[
  {
    "text": "Judge Orders Release of Tufts Student Detained by ICE  —  The student, Rumeysa Ozturk, was being detained in Louisiana.  A federal judge said her detention threatened to chill the speech of millions of noncitizens.  —  A federal judge in Vermont ordered the Trump administration on Friday … ",
    "url": "https://www.nytimes.com/2025/05/09/us/judge-orders-government-release-tufts-student.html"
  },
  {
    "text": "Judge orders immediate release of Rumeysa Ozturk, Tufts student detained by ICE  —  U.S. District Judge William Sessions III said her detention, over an op-ed, could chill the speech of “millions and millions” of noncitizens.  —  BURLINGTON, Vermont — A federal judge Friday ordered … ",
    "url": "https://www.politico.com/news/2025/05/09/rumeysa-ozturk-tufts-ice-release-00338953"
  },
  {
    "text": "For Immediate Release  —  For Further Information Contact:  —  Retired Associate Justice of the Supreme Court of the United States, David H. Souter, died peacefully yesterday at home in New Hampshire.  He was 85 years old.  Justice Souter was appointed to the Court by President George H.W. Bush in 1990 … ",
    "url": "https://www.supremecourt.gov/publicinfo/press/pressreleases/pr_05-09-25"
  },
  {
    "text": "‘Harrowing’: Video shows Worcester police hold girl's face on ground during ICE operation  —  Telemundo Nueva Inglaterra captured video of a 16-year-old girl's face being held on the ground by Worcester police officers; she and her mother were detained in an apparent ICE operation",
    "url": "https://www.nbcboston.com/news/local/harrowing-video-shows-worcester-police-hold-girls-face-on-ground-during-ice-operation/3708641/"
  },
  {
    "text": "Newark mayor, New Jersey candidate for governor Ras Baraka arrested after refusing to leave ICE facility  —  NEWARK, NJ — Newark Mayor Ras Baraka was taken into custody Thursday afternoon after allegedly committing trespass and defying multiple warnings from federal authorities to vacate … ",
    "url": "https://www.shorenewsnetwork.com/2025/05/09/newark-mayor-ras-baraka-arrested-after-refusing-to-leave-ice-facility/"
  },
  {
    "text": "Colbert Was Sold on Pope Leo by a Single Tweet About JD Vance  —  X CATHEDRA  —  Pope Leo's posts on X have captured the attention of commentators, including the ‘Late Show’ host.  —  Stephen Colbert was won over by the newly elected Pope Leo XIV in no time.",
    "url": "https://www.thedailybeast.com/stephen-colbert-was-sold-on-pope-leo-by-a-single-tweet-about-jd-vance/"
  },
  {
    "text": "Trump Officials Seek to Bring First White Afrikaners to U.S. as Refugees Next Week  —  The rapid relocation of the Afrikaners, who President Trump says have been racially persecuted in South Africa, stands in stark contrast to the virtual shutdown of all other refugee admissions.",
    "url": "https://www.nytimes.com/2025/05/09/world/africa/trump-afrikaner-refugees.html?unlocked_article_code=1.F08.t-lY.vzWqetLkTWYN&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Here's what we know about Trump's June 14 D.C. military parade  —  With June 14 fast approaching, President Trump's proposed military parade is yet to be finalized, but permit applications give us a glimpse into the spectacle that's expected to cost tens of millions of dollars.",
    "url": "https://www.axios.com/local/washington-dc/2025/05/09/trump-military-parade-route-concert-music"
  },
  {
    "text": "Crypto Is Still for Criming  —  Yesterday “the president” announced a trade “deal” with “Britain.”  IN CASE YOU'RE WONDERING, I'M TRYING TO EMULATE TRUMP'S STYLE, WITH RANDOM QUOTATION MARKS AND BLOCK CAPITALS, PLUS EXCLAMATION POINTS AT WEIRD PLACES!  —  Anyway, as I predicted yesterday … ",
    "url": "https://paulkrugman.substack.com/p/crypto-is-still-for-criming"
  },
  {
    "text": "Barnard suspends WKCR and Spectator reporters who covered Butler Library protest  —  Barnard and Columbia issued interim suspensions Thursday afternoon to four student journalists who covered a Wednesday pro-Palestinian protest in Butler Library, citing “information received” … ",
    "url": "https://www.columbiaspectator.com/news/2025/05/09/barnard-suspends-wkcr-and-spectator-reporters-who-covered-butler-library-protest/"
  },
  {
    "text": "Air traffic controllers for Newark airport briefly lose radar access again  —  The air traffic controllers directing planes into the Newark, New Jersey, airport lost their radar Friday morning for the second time in two weeks.  —  The Federal Aviation Administration said the radar at the facility … ",
    "url": "https://apnews.com/article/newark-airport-radar-outage-c41c772690e710b39412cd02c83819f0"
  },
  {
    "text": "Manufacturers Say Trump Has Made Opening U.S. Factories Impossible  —  The Trump administration's tariff scheme appears less and less likely to bring manufacturing jobs back to U.S. shores.  —  Businesses across the country are crunching the numbers and realizing that, despite Donald Trump's insistence … ",
    "url": "https://newrepublic.com/post/195070/donald-trump-tariffs-manufacturers-opening-factories"
  },
  {
    "text": "Justice Sotomayor Says Lawyers Must ‘Stand Up’ and ‘Fight This Fight’  —  In pointed remarks, the justice told an audience of hundreds of lawyers that she had joined them as “an act of solidarity.”  —  Justice Sonia Sotomayor, speaking to hundreds of lawyers at an American Bar Association event … ",
    "url": "https://www.nytimes.com/2025/05/09/us/justice-sotomayor-talk.html"
  },
  {
    "text": "New Pope Has Creole Roots in New Orleans  —  His ancestry, traced to a historic enclave of Afro-Caribbean culture, links Leo XIV to the rich and sometimes overlooked Black Catholic experience in America.  —  Robert Francis Prevost, the Chicago-born cardinal selected on Thursday as the new pope … ",
    "url": "https://www.nytimes.com/2025/05/08/us/pope-leo-creole-new-orleans.html"
  },
  {
    "text": "New FEMA head tells staff: “Don't get in my way... I will run right over you”  —  During his first all-hands meeting with agency personnel, acting Federal Emergency Management Agency Administrator David Richardson issued a striking warning: “Don't get in my way,” the former United States … ",
    "url": "https://www.cbsnews.com/news/fema-acting-administrator-david-richardson-staff-meeting/"
  },
  {
    "text": "Man ‘Disappeared’ by ICE Was on El Salvador Flight Manifest, Hacked Data Shows  —  Ricardo Prada Vásquez, a Venezuelan man whose family says he was “disappeared” and who wasn't included on a previously leaked government list of people sent to a notorious mega prison in El Salvador … ",
    "url": "https://www.404media.co/man-disappeared-by-ice-was-on-el-salvador-flight-manifest-hacked-data-shows/"
  },
  {
    "text": "MAGA influencer collapses on Fox News after starting transphobic rant about Kamala Harris's ‘incompetency’  —  A Fox News segment veered into chaos Thursday night when Camryn Kinsey, a former Trump administration staffer and far-right media personality, collapsed live on air … ",
    "url": "https://www.advocate.com/news/fox-news-camryn-kinsey-faints"
  },
  {
    "text": "Here is a specific thing you can do to fight Trump's politicization of public services  —  Trump's maximalist strategy of firing off one executive action after another seeks to overwhelm us.  Finding some tangible way to respond sometimes feels impossible.  So, here is something that you can do:",
    "url": "https://donmoynihan.substack.com/p/here-is-a-specific-thing-you-can"
  },
  {
    "text": "The U.S.-U.K. deal shows the trade war is here to stay  —  Markets cheered the new trade pact between the U.S. and U.K. yesterday.  — But the details show that trade war relief will only go so far, even as the de-escalation road map becomes clearer.  —  The big picture … ",
    "url": "https://www.axios.com/2025/05/09/uk-trade-deal-trump-tariffs"
  },
  {
    "text": "Pam Bondi Spilled Epstein Secrets to Bogus ‘Nanny’ at Brunch  —  NANNY CAM  —  The attorney general was reportedly caught on a hidden camera talking to a woman hired by James O'Keefe to pose as a nanny.  —  Days before she announced “thousands of videos” of evidence in the Jeffrey Epstein case … ",
    "url": "https://www.thedailybeast.com/pam-bondi-spilled-jeffrey-epstein-secrets-to-bogus-nanny-at-brunch/"
  },
  {
    "text": "President Trump fires Librarian of Congress Carla Hayden  —  President Donald Trump abruptly fired Librarian of Congress Carla Hayden on Thursday as the White House continues to purge the federal government of those perceived to oppose the president and his agenda.",
    "url": "https://apnews.com/article/donald-trump-library-of-congress-carla-hayden-20a1862ce6d2e0d51a84a37b264ce2ef"
  },
  {
    "text": "Exclusive: NSF faces radical shake-up as officials abolish its 37 divisions  —  Changes seen as a response to presidential directives on what research to fund  —  The National Science Foundation (NSF), already battered by White House directives and staff reductions, is plunging into deeper turmoil.",
    "url": "https://www.science.org/content/article/exclusive-nsf-faces-radical-shake-officials-abolish-its-37-divisions"
  },
  {
    "text": "Exclusive: US weighs special status for Greenland as quest for island intensifies  —  U.S. officials are discussing a plan to pull Greenland into America's sphere of influence using a type of agreement that the United States has used to keep close ties with several Pacific Island nations … ",
    "url": "https://www.reuters.com/world/us-weighs-special-status-greenland-quest-island-intensifies-2025-05-09/"
  },
  {
    "text": "White House to take choice of Pentagon chief of staff out of Hegseth's hands  —  Exclusive: The intervention to marginalize Ricky Buria is aimed at insulating the Pentagon from any more missteps  —  Exasperated by the turmoil that has dogged Pete Hegseth's office in recent weeks … ",
    "url": "https://www.theguardian.com/us-news/2025/may/09/white-house-pentagon-hegseth-chief-of-staff"
  },
  {
    "text": "D.C.-area economy starts to show deep impacts of federal spending cuts  —  Unemployment claims are rising and consumers are pulling back on spending, sparking worries of an economic slump in the region on par with the one that occurred during the pandemic.  —  The D.C. region's economy … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2025/05/09/dc-economy-slump-recession-trump/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ2NzYzMjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ4MTQ1NTk5LCJpYXQiOjE3NDY3NjMyMDAsImp0aSI6IjE3MmYxM2NhLWUxNTEtNDI5Yy1hNDFiLTIyMmU5ZTNmZmI1YiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9kYy1tZC12YS8yMDI1LzA1LzA5L2RjLWVjb25vbXktc2x1bXAtcmVjZXNzaW9uLXRydW1wLyJ9.EK6gjrDZuUhHl6SvK0J4kK30ebxE-_A8wOEmSPIQ0U4&itid=gfta&fbclid=IwZXh0bgNhZW0BMQABHhieozCzDHkdjTBzHCGTX3qTqqr6Tkczwv4WEVXmZ_4W1QWbsqfpTUV04-2__aem_atbavsjyTrPYLjt9N57tnw"
  },
  {
    "text": "Few support punitive funding cuts to colleges and universities  —  Most of the public believes that colleges and universities make significant contributions to scientific and technological advancement and think their federal research funding should be maintained.",
    "url": "https://apnorc.org/projects/few-support-punitive-funding-cuts-to-colleges-and-universities/"
  },
  {
    "text": "USDA, DOGE demand states hand over personal data about food stamp recipients  —  The Department of Agriculture is demanding states hand over personal data of food assistance recipients — including Social Security numbers, addresses and, in at least one state, citizenship status … ",
    "url": "https://www.npr.org/2025/05/09/nx-s1-5389952/usda-snap-doge-data-immigration"
  },
  {
    "text": "Exclusive: Iran to send Russia launchers for short-range missiles, sources say  —  Iran is preparing to deliver in the near future launchers for short-range ballistic missiles that the U.S. said Tehran sent to Russia last year for use against Ukraine, according to two Western security officials and a regional official.",
    "url": "https://www.reuters.com/world/iran-send-russia-launchers-short-range-missiles-sources-say-2025-05-09/"
  }
]