[
  {
    "text": "Trump announces 30% tariffs against EU, Mexico to begin Aug. 1, rattling major US trading partners  —  President Donald Trump on Saturday announced he's levying tariffs of 30% against the European Union and Mexico starting Aug. 1, a move that could cause massive upheaval between the United States and two of its biggest trade partners.",
    "url": "https://apnews.com/article/trump-tariffs-eu-mexico-66bf84d97dcd69bbd1f1108e42283afd"
  },
  {
    "text": "Trump Threatens Steep Tariffs on Goods From E.U. and Mexico  —  European leaders had been trying to negotiate more favorable terms for months.  They may retaliate with tariffs of their own.  —  President Trump announced in letters posted to social media on Saturday that he would place … ",
    "url": "https://www.nytimes.com/2025/07/12/us/politics/europe-eu-tariffs-trade.html"
  },
  {
    "text": "Trump announces 30% tariffs against Mexico, EU to begin on Aug. 1  —  President Trump on Saturday announced he is levying 30% tariffs against Mexico and the European Union.  They are set to begin on August 1.  —  He announced the tariffs on two of the United States' biggest trade partners … ",
    "url": "https://www.cbsnews.com/news/trump-announcement-tariffs-mexico-european-union/"
  },
  {
    "text": "Trump unveils 30 percent tariff for EU, Mexico  —  President Trump on Saturday announced his administration would levy a 30 percent tariff on goods from Mexico and members of the European Union beginning Aug. 1, targeting two of the U.S.'s top trading partners.",
    "url": "https://thehill.com/business/5398099-donald-trump-tariffs-mexico-european-union-30-percent/"
  },
  {
    "text": "Trump says he'll slap 30% tariffs on Mexico, European Union on Aug. 1  —  Trump has spent the past several days sending letters to various world leaders about new tariffs the United States would be imposing on them.  —  President Donald Trump threatened Saturday morning to impose 30 percent tariffs … ",
    "url": "https://www.washingtonpost.com/politics/2025/07/12/trump-tariffs-mexico-european-union/"
  },
  {
    "text": "Federal judge halts indiscriminate immigration stops in Los Angeles and beyond  —  In a searing ruling against the Trump administration, a federal judge on Friday temporarily blocked federal agents from using racial profiling to carry out indiscriminate immigration arrests that advocates … ",
    "url": "https://www.latimes.com/california/story/2025-07-11/federal-judge-temporarily-halts-alleged-indiscriminate-immigration-stops"
  },
  {
    "text": "Tech billionaire Trump adviser Marc Andreesen says universities will ‘pay the price’ for DEI  —  The investor in a private group chat also criticized Stanford and said colleges are biased against Trump voters: “My people are furious.”  —  Influential tech investor and Trump adviser Marc Andreessen recently … ",
    "url": "https://www.washingtonpost.com/technology/2025/07/12/marc-andreessen-private-chat-universities-diversity/"
  },
  {
    "text": "Trump Thinks He Can Take Away Citizenship From Anyone He Doesn't Like  —  The president is now musing about trying to revoke Rosie O'Donnell's birthright citizenship because he doesn't like her  —  Since the first day of his second term, President Donald Trump has been trying … ",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-us-citizenship-rosie-o-donnell-zohran-mamdani-1235384436/"
  },
  {
    "text": "Trump threatens to revoke US citizenship of longtime critic Rosie O'Donnell … The White House declined to comment on whether Trump was serious about the threat, or how he would revoke the American actor's citizenship — a move for which there is no clear legal precedent.",
    "url": "https://www.politico.com/news/2025/07/12/trump-revoke-citizenship-rosie-odonnell-00449920"
  },
  {
    "text": "Trump threatens to strip Rosie O'Donnell of U.S. citizenship.  —  President Trump said he was weighing using the power of the government against one of his longtime entertainment world nemeses, the comedian and actress Rosie O'Donnell, threatening to revoke her citizenship.",
    "url": "https://www.nytimes.com/2025/07/12/us/politics/trump-rosie-odonnell-citizenship.html"
  },
  {
    "text": "Surely, You Are Not Surprised  —  We can be — and ought to be — shocked by the various scenes unfolding before us, but we cannot really be surprised can we?  The chaos and the cruelty were always the point; and what did we expect from an administration crammed full of reductio ad absurdum appointees at every level?",
    "url": "https://charliesykes.substack.com/p/surely-you-are-not-surprised"
  },
  {
    "text": "US Justice fires nine more employees from Jack Smith's team, sources say  —  U.S. Attorney General Pam Bondi on Friday fired at least nine more Justice Department employees who worked for Special Counsel Jack Smith to investigate President Donald Trump's retention of classified records … ",
    "url": "https://www.reuters.com/world/us/us-justice-fires-nine-more-employees-jack-smiths-team-sources-say-2025-07-12/"
  },
  {
    "text": "Bondi fires 20 DOJ employees from Jan. 6, Trump documents cases  —  Attorney General Pam Bondi has fired more than 20 Justice Department employees who worked on cases involving the Jan. 6 riot at the Capitol and Donald Trump's handling of classified documents, sources told Axios.",
    "url": "https://www.axios.com/2025/07/12/pam-bondi-fires-justice-employees-jan6-documents-trump"
  },
  {
    "text": "FEMA Didn't Answer Thousands of Calls From Flood Survivors, Documents Show  —  Two days after deadly Texas floods, the agency struggled to answer calls from survivors because of call center contracts that weren't extended.  —  Two days after catastrophic floods roared through Central Texas … ",
    "url": "https://www.nytimes.com/2025/07/11/climate/fema-missed-calls-texas-floods.html?unlocked_article_code=1.Vk8.HZRd.zn6zK44YkS7l&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Contrarians to the Rescue on Birthright Citizenship!  —  Publisher's Roundup 26  —  A couple of weeks ago, when the Roberts Court struck down some nationwide injunctions protecting birthright citizenship in the Casa case, we here at The Contrarian told you not to panic.",
    "url": "https://contrarian.substack.com/p/contrarians-to-the-rescue-on-birthright"
  },
  {
    "text": "Senate GOP faces ‘gut check time’ on axing global HIV program  —  Senate Republicans remain wary of eliminating the popular and successful global HIV/AIDS program PEPFAR, as they face down a July 18 deadline to vote on President Trump's first tranche of rescissions requests.",
    "url": "https://thehill.com/policy/healthcare/5397689-pepfar-funding-debate-republicans/"
  },
  {
    "text": "Lights Out: U.S. Withdraws Support for Global Media  —  Foreign aid cuts to USAID, other outlets, cast a long shadow over journalism around the world  —  In the 12 years since Radio Rozana's first broadcast, founder Lina Chawaf has worked tirelessly to expand the outlet's coverage of her native Syria.",
    "url": "https://niemanreports.org/usaid-ned-usagm-cuts-doge-trump/"
  },
  {
    "text": "Judge Orders Los Angeles Police to Stop Shooting Projectiles at Journalists  —  Los Angeles Police Department officers fired foam projectiles and flash-bang devices at reporters and photographers who were covering the immigration protests in June.  —  A federal judge on Friday ordered … ",
    "url": "https://www.nytimes.com/2025/07/11/us/judge-orders-los-angeles-police-to-stop-shooting-projectiles-at-journalists.html"
  }
]