[
  {
    "text": "Trump closes down federal worker buyout offer after judge lifts hold  —  The administration moved to close the buyout program Wednesday evening after a federal judge in Massachusetts rejected a call from several labor groups that sued to block the initiative",
    "url": "https://www.washingtonpost.com/dc-md-va/2025/02/12/trump-federal-worker-buyout-court-hearing/"
  },
  {
    "text": "Live Updates: Federal Resignation Program Moves Ahead After Judge Signs Off  —  Where Things Stand  — Trimming federal work force: A federal judge said the Trump administration's deferred resignation program for federal workers could move forward, allowing the White House to advance … ",
    "url": "https://www.nytimes.com/live/2025/02/12/us/trump-news-gabbard-rfk"
  },
  {
    "text": "“Armored Tesla” forecast to win $400 million State Department contract after Trump's election, government document shows  —  The State Department's procurement forecast, revised as of late December 2024, lists Tesla as the recipient of the largest expected contract, with Marco Rubio's department planning … ",
    "url": "https://www.dropsitenews.com/p/elon-musk-armored-tesla-forecast-400-million-state-department-contracts"
  },
  {
    "text": "Trump administration set to purchase $400 million worth of armored Teslas  —  The Trump administration is expected to purchase $400 million worth of armored Tesla vehicles, according to a new State Department document detailing procurement for fiscal year 2025.",
    "url": "https://www.npr.org/2025/02/13/g-s1-48571/trump-administration-order-400-million-worth-of-armored-teslas"
  },
  {
    "text": "Trump Removal of Whistleblower Agency Head Blocked by Judge  — Judge held Trump's firing of Hampton Dellinger likely unlawful  — Other independent agency officials are suing over removals  —  A federal judge in Washington blocked for now President Donald Trump from removing the head … ",
    "url": "https://www.bloomberg.com/news/articles/2025-02-13/trump-removal-of-whistleblower-agency-head-blocked-by-judge"
  },
  {
    "text": "Elon Musk's X to pay about $10 million to settle Trump lawsuit over account suspension … Social media company X has agreed to pay about $10 million to settle a lawsuit by President Donald Trump, who has put X's billionaire owner Elon Musk in charge of a major government cost- and staff-cutting effort.",
    "url": "https://www.cnbc.com/2025/02/12/elon-musk-x-settle-trump-lawsuit-capitol-riot-doge.html"
  },
  {
    "text": "New York Got $80 Million for Migrants.  The White House Took It Back.  —  The New York City comptroller's office, which first noticed the missing money, said that the Federal Emergency Management Agency had unilaterally taken the funds from the city's accounts.",
    "url": "https://www.nytimes.com/2025/02/12/nyregion/doge-migrant-hotel-shelters.html"
  },
  {
    "text": "Republicans Love Trump's Spending Cuts.  Just Not in Their States.  —  Even as they praise the president's unilateral actions to slash federal spending, G.O.P. lawmakers have quietly moved to seek carve outs or exemptions for their own constituents.  —  Republicans in Congress have responded … ",
    "url": "https://www.nytimes.com/2025/02/12/us/politics/trump-spending-republicans-agriculture-research.html"
  },
  {
    "text": "Hegseth's rough start: Pentagon chief faces protest at U.S. base abroad  —  The question isn't why the defense secretary faced pushback at U.S. European Command headquarters; the question is whether he'll see more protests soon.  —  Though it still seems hard to believe, a couple of weeks ago … ",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/hegseths-rough-start-pentagon-chief-faces-protest-us-base-abroad-rcna191828"
  },
  {
    "text": "House GOP budget resolution hangs in the balance as hardliners hold out support  —  The House GOP's budget resolution is hanging in the balance as a handful of hardliners withhold support for the measure, setting the stage for a high-stakes committee vote on Thursday.",
    "url": "https://thehill.com/homenews/house/5142240-house-gop-budget-resolution/"
  },
  {
    "text": "US sues New York state officials over immigration enforcement, attorney general says  —  The U.S. Justice Department has sued New York State officials over alleged failures to enforce federal immigration law, Attorney General Pam Bondi told reporters on Wednesday.",
    "url": "https://www.reuters.com/world/us/us-sues-new-york-state-officials-over-immigration-enforcement-attorney-general-2025-02-12/"
  },
  {
    "text": "Measles Outbreak Hits Town in Texas  —  As of Tuesday, 22 children and two adults had been infected, all of whom were unvaccinated, local officials said.  —  A worsening measles outbreak has taken root in Texas, sickening two dozen and hospitalizing nine on the western edge of the state … ",
    "url": "https://www.nytimes.com/2025/02/12/science/measles-vaccination-texas.html"
  },
  {
    "text": "Mass firings have begun at federal agencies  —  Mass firings have begun at federal agencies, with terminations of probationary employees underway at the Department of Education and the Small Business Administration, federal employees and union sources told CNN Wednesday.",
    "url": "https://www.cnn.com/2025/02/12/politics/mass-firings-federal-agencies"
  },
  {
    "text": "Eric Adams Discussed Possible Republican Primary Run With G.O.P. Leader  —  The mayor discussed options to run for re-election in the Republican contest as recently as Monday.  Asked for comment, he said he was running as a Democrat.  —  Mayor Eric Adams of New York City has quietly explored running … ",
    "url": "https://www.nytimes.com/2025/02/12/nyregion/eric-adams-republican-primary.html"
  },
  {
    "text": "Sen. Elizabeth Warren's Two-Word Plan to Save the CFPB From Elon Musk  —  “Banks hated this agency from the first time I ever talked about it.”  —  Following the 2008 global financial crisis, the Consumer Financial Protection Bureau (CFPB) was established by Congress to reign … ",
    "url": "https://www.motherjones.com/politics/2025/02/sen-elizabeth-warrens-two-word-plan-to-save-the-cfpb-from-elon-musk/"
  },
  {
    "text": "Some Migrants Sent by Trump to Guantánamo Are Being Held by Military Guards  —  The Times has obtained a list of 53 Venezuelan men the Trump administration has put in a wartime prison built to hold Al Qaeda suspects.  —  Dozens of Venezuelan migrants sent by the Trump administration … ",
    "url": "https://www.nytimes.com/2025/02/12/us/gitmo-migrants-trump.html"
  },
  {
    "text": "McConnell Comments on Gabbard Nomination  —  Washington, D.C. - U.S. Senator Mitch McConnell (R-KY), Chairman of the Senate Appropriations Subcommittee on Defense, issued the following statement today on the nomination of Tulsi Gabbard to serve as Director of National Intelligence:",
    "url": "https://www.mcconnell.senate.gov/public/index.cfm/pressreleases?ID=9639B1E9-C3F0-4160-8D13-C87C7310AB55"
  },
  {
    "text": "US eggs prices hit a record high of $4.95 and are likely to keep climbing  —  Egg prices hit a record high as the U.S. contends with an ongoing bird flu outbreak, but consumers didn't need government figures released Wednesday to tell them eggs are terribly expensive and hard to find at times because of an ongoing.",
    "url": "https://apnews.com/article/egg-prices-record-bird-flu-a2394bdefc7bd0514d4f003cc5e8a908"
  },
  {
    "text": "Trump and Musk Hunt for Corruption, Very Selectively  —  Spending that the White House does not like is being labeled fraudulent.  At the same time, President Trump is rolling back anticorruption efforts and ethical standards for himself and allies like Elon Musk.",
    "url": "https://www.nytimes.com/2025/02/12/us/politics/trump-musk-corruption.html"
  },
  {
    "text": "What you can do to fight the Trump agenda  —  “What can I do?”  —  That's the question a lot of you are asking.  —  I've spent the last week exploring that question.  And the overarching answer, based on my research, is that you should reach out and make connections with others … ",
    "url": "https://www.headsupnews.org/p/what-you-can-do-to-fight-the-trump"
  },
  {
    "text": "“Largest data breach in US history”: Three more lawsuits try to stop DOGE … The US DOGE Service's access to the private data of ordinary Americans and federal employees is being challenged in several lawsuits filed this week.  —  Three new complaints seek court orders that would stop … ",
    "url": "https://arstechnica.com/tech-policy/2025/02/largest-data-breach-in-us-history-three-more-lawsuits-try-to-stop-doge/"
  },
  {
    "text": "New Kennedy Center board elects Trump as chair.  Rutter departs as president.  —  President Trump's refashioned board of trustees voted him chairman in a meeting Wednesday afternoon.  President Deborah Rutter told staff she was leaving the institution.  —  The Kennedy Center board … ",
    "url": "https://www.washingtonpost.com/entertainment/2025/02/12/trump-elected-kennedy-center-board-chair/"
  },
  {
    "text": "The GSA Plans to Sell Hundreds of Its Federal Government Buildings  —  The General Services Administration, staffed at its upper levels by Elon Musk associates, plans to sell 500-plus buildings—some of which house government agencies and the offices of US senators.",
    "url": "https://www.wired.com/story/gsa-sell-government-buildings/"
  },
  {
    "text": "BREAKING: NIH admits funding freeze is illegal, will resume issuing grants  —  On Monday afternoon, Popular Information broke the news that the National Institutes of Health (NIH) had frozen virtually all grant funding in violation of two federal court orders.",
    "url": "https://popular.info/p/breaking-nih-admits-funding-freeze"
  },
  {
    "text": "Donald Trump is Now the Mayor of New York  —  The Trump DOJ's decision to drop charges against New York City Mayor Eric Adams may not be the most serious act of prosecutorial corruption in decades but it's almost certainly the most brazen.  The stated reasons for dropping the charges were absurd … ",
    "url": "https://talkingpointsmemo.com/edblog/donald-trump-is-now-the-mayor-of-new-york"
  },
  {
    "text": "Bernie Sanders launches high-profile offensive against ‘the oligarchy’  —  “He likes spreading his message, and likes being adored,” a former aide said.  —  Bernie Sanders, the two-time presidential candidate, is barnstorming Iowa and Nebraska to rally voters against what he calls … ",
    "url": "https://www.politico.com/news/2025/02/12/bernie-sanders-iowa-midterms-trump-musk-00203974"
  },
  {
    "text": "Musk's ‘efficiency’ agency site adds data from controversial rightwing thinktank  —  Website of ‘Doge’ includes information published by thinktank CEI, which claims to fight ‘climate alarmism’  —  Flanked by Donald Trump in the Oval Office this week, Elon Musk claimed his much-vaunted … ",
    "url": "https://www.theguardian.com/us-news/2025/feb/12/trump-musk-doge-website"
  },
  {
    "text": "Department of Education rescinds Title IX guidance that NIL payments must be proportionate  —  The U.S. Department of Education has officially rescinded a nine-page fact sheet on Title IX guidance that was released last month under the outgoing presidential administration, a move that was anticipated by many within college sports.",
    "url": "https://www.nytimes.com/athletic/6131665/2025/02/12/title-ix-nil-college-sports-department-of-education/"
  }
]