[
  {
    "text": "BREAKING: First Trump RICO defendant takes plea agreement  —  X  —  Bail bondsman Scott Hall on Friday became the first defendant in the Fulton County election interference case to take a plea agreement with prosecutors.  —  During an impromptu hearing before Fulton Superior Court Judge Scott McAfee … ",
    "url": "https://www.ajc.com/politics/breaking-first-trump-rico-defendant-takes-plea-agreement/3L3OZWOFIJHWHLJUTQSNHO4VL4/"
  },
  {
    "text": "First co-defendant in Trump Georgia election case pleads guilty  — Scott Hall, one of 18 co-defendants of former President Donald Trump in the Georgia election interference case, pleaded guilty to the charges against him.  — Hall, a bail bondsman, is the first defendant in the case to plead guilty in the case.",
    "url": "https://www.cnbc.com/2023/09/29/first-co-defendant-in-trump-georgia-election-case-pleads-guilty.html"
  },
  {
    "text": "DOJ special counsel cites Trump's targeting of Milley in push for gag order  —  Justice Department (DOJ) special counsel Jack Smith on Friday pushed harder for a gag order that would limit what former President Trump can say publicly, citing his recent posts threatening witnesses in the criminal cases against him.",
    "url": "https://thehill.com/regulation/court-battles/4231412-doj-special-counsel-cites-trumps-targeting-of-milley-in-push-for-gag-order/"
  },
  {
    "text": "Trump floats plan to attend New York trial on business fraud  —  The surprise move would bring Trump face-to-face with a Manhattan judge he has repeatedly derided.  —  Former President Donald Trump plans to show up in person for at least the first week of a civil trial set to open in New York … ",
    "url": "https://www.politico.com/news/2023/09/29/trump-attend-business-fraud-trial-00119198"
  },
  {
    "text": "'It's crazy': Shutdown caps Congress' week from hell  —  Back in the 1990s, as then-Speaker Gingrich put it, Republicans could at least “afford to have five or six people be idiots.”  —  Democratic Rep. Jamaal Bowman has never seen a scenario like this week: “Not in real life — in movies.",
    "url": "https://www.politico.com/news/2023/09/30/congress-dysfunction-government-shutdown-00119206"
  },
  {
    "text": "How Did the Government Get to a Shutdown, and What Will It Take to Reopen?  —  Any deal to keep it open would have to be bipartisan, since the Senate and White House are controlled by Democrats, and the House by Republicans.  —  The federal government is careening toward a shutdown at midnight on Saturday.",
    "url": "https://www.nytimes.com/2023/09/30/us/politics/shutdown-government-reopen.html"
  },
  {
    "text": "IRS contractor charged with stealing Donald Trump's tax returns, which were leaked to press  —  Federal prosecutors announced charges Friday against a contractor with the Internal Revenue Service who allegedly stole the tax returns of a high-ranking government official.",
    "url": "https://www.cnn.com/2023/09/29/politics/irs-contractor-trump-taxes/"
  },
  {
    "text": "GOP senators say they won't stop Democrats from replacing Feinstein on Judiciary Committee  —  Sen. Dianne Feinstein's death creates a vacancy on the powerful panel that oversees President Biden's judicial nominees.  Without her, Democrats don't have a majority on it.",
    "url": "https://www.nbcnews.com/politics/congress/republicans-replace-dianne-feinstein-judiciary-committee-rcna118151"
  },
  {
    "text": "The Trump administration touted him as a victim of #MeToo.  Now he's accused of dismembering a girlfriend  —  The gruesome discovery spoke to a ghastly crime.  —  On the afternoon of July 20, someone using a waterfront trail in Alameda spotted a large garbage bag wrapped in duct tape … ",
    "url": "https://www.sfchronicle.com/bayarea/article/alameda-murder-joseph-roberts-18380333.php"
  },
  {
    "text": "Elon Musk attacked German support for migrants and promoted a call to support a far-right extremist political party  — Germany has responded to an attack from Elon Musk, saying it's “saving lives” by helping migrants.  — The billionaire had promoted the claim that Germany is facilitating “illegal” immigration to Europe.",
    "url": "https://www.businessinsider.com/elon-musk-immigration-migrants-germany-far-right-extremism-twitter-x-2023-9?op=1"
  },
  {
    "text": "Pregnant with no OB-GYNs around: In Idaho, maternity care became a casualty of its abortion ban  —  After an Idaho hospital closed its obstetrics department, pregnant women in the county have been left without nearby care.  Their OB-GYNs fled the state.  —  If you're pregnant in Bonner County … ",
    "url": "https://www.nbcnews.com/health/womens-health/pregnant-women-struggle-find-care-idaho-abortion-ban-rcna117872"
  },
  {
    "text": "Dress code debate reflects the US Senate's diminished reputation  —  The debate over the U.S. Senate dress code, spurred by Sen. John Fetterman (D-Pa.), is a fight that seems insignificant to most yet reflects how the once vaunted and respected institution of the U.S. Senate has diminished in the eyes of the American people.",
    "url": "https://thehill.com/opinion/campaign/4228226-dress-code-debate-reflects-the-us-senates-diminished-reputation/"
  },
  {
    "text": "With Shutdown Looming, Biden Calls Out Speaker McCarthy for a “Terrible Bargain” With MAGA Republicans  —  In a wide-ranging video interview being published Sunday, the president also addressed broad threats to democracy, ethical concerns about the Supreme Court and more.",
    "url": "https://www.propublica.org/article/biden-interview-shutdown-mccarthy-impeachment-gop"
  },
  {
    "text": "Biden to convene his Cabinet early next week to discuss continuity of government  —  President Joe Biden is expected to convene his Cabinet early next week to discuss continuity of government after a potential shutdown begins Sunday, four administration officials familiar with the plans told CNN.",
    "url": "https://www.cnn.com/2023/09/29/politics/biden-cabinet-meeting-congress-shutdown/"
  },
  {
    "text": "Dialogue has started: NACP suspends 5 Greek shipping companies and OTP Bank from the list of international sponsors of war while negotiations are underway  —  Посилання скопійовано",
    "url": "https://nazk.gov.ua/en/news/dialogue-has-started-nacp-suspends-5-greek-shipping-companies-and-otp-bank-from-the-list-of-international-sponsors-of-war-while-negotiations-are-underway/"
  }
]