[
  {
    "text": "Trump world considers having the former president deliver the official GOP State of the Union response  —  Two sources told NBC News that Trump is leaning against doing it.  The decision ultimately rests with the Republican leadership in Congress.  —  WASHINGTON — Aides and allies close … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-world-former-president-deliver-gop-state-union-response-rcna138979"
  },
  {
    "text": "Trump says he purposefully mixes up politicians' names … - Biden's campaign seized on the moment by sharing it on social media, and in a campaign ad.  — He's mixed up Biden and former President Obama at least seven times in recent months, per Forbes.",
    "url": "https://www.axios.com/2024/02/15/trump-biden-memory-age-attacks"
  },
  {
    "text": "White House Clashed With Justice Dept. Over Special Counsel Report  —  Previously undisclosed letters show a testy exchange over whether the Justice Department violated its own guidelines in releasing a report with comments disparaging President Biden.  —  The White House clashed … ",
    "url": "https://www.nytimes.com/2024/02/15/us/politics/joe-biden-special-counsel.html"
  },
  {
    "text": "Trump's first criminal trial will start March 25, judge says  —  The schedule means Trump will spend weeks in court instead of on the campaign trail.  —  Former President Donald Trump's first criminal trial will start on March 25 as scheduled, a judge said in New York on Thursday as he denied Trump's attempts to throw out the charges.",
    "url": "https://www.politico.com/news/2024/02/15/trump-hush-money-criminal-case-hearing-update-00141621"
  },
  {
    "text": "Will Georgia prosecutor Fani Willis be removed from election case against Trump?  —  Fulton County District Attorney Fani Willis took the witness stand Thursday and forcefully pushed back against what she described as “lies” about her romantic relationship with a special prosecutor during … ",
    "url": "https://apnews.com/article/fani-willis-hearing-trump-case-potential-conflict-c37fcf993ac33c150f3cb3e4a7a888db"
  },
  {
    "text": "Live Updates: Key Witness Contradicts Trump Prosecutors' Timeline of Relationship  —  A former friend and colleague of Fani Willis says the district attorney's romance with the lead prosecutor in the Georgia election interference case began before he was hired, possibly bolstering defense lawyers' claims of a conflict of interest.",
    "url": "https://www.nytimes.com/live/2024/02/15/us/fani-willis-trump-hearing"
  },
  {
    "text": "Truth Social merger deal wins key approval, a victory for Trump  —  The former president's stake in the post-merger company would be valued, at today's share price, at nearly $4 billion.  —  The Securities and Exchange Commission has approved the merger proposal of former president Donald Trump's media start … ",
    "url": "https://www.washingtonpost.com/technology/2024/02/15/truth-social-trump-merger-sec/"
  },
  {
    "text": "Trump's Truth Social nears Wall Street listing that could yield millions  —  The deal could inject some $300 million into the company, which operates Trump's social media bullhorn, Truth Social.  —  Donald Trump may be finally headed for Wall Street.  —  The Securities and Exchange Commission … ",
    "url": "https://www.politico.com/news/2024/02/15/trumps-truth-social-nears-wall-street-listing-that-could-yield-millions-00141650"
  },
  {
    "text": "DeSantis Walks Back FL Book Ban Statute He Once Championed  —  Ron DeSantis's culture war book banning statute has resulted in chaos, confusion and anger as Florida has banned the highest number of books in the country from schools and public libraries.  Florida teachers and libraries face felony charges … ",
    "url": "https://www.meidastouch.com/news/desantis-walks-back-florida-book-ban-statute-he-once-championed"
  },
  {
    "text": "Special counsel charges FBI confidential source for allegedly providing false derogatory info on President Biden, Hunter Biden  —  Alexander Smirnov was arrested in Las Vegas on Wednesday.  —  The FBI seal is seen outside the headquarters building in Washington, DC on July 5, 2016.",
    "url": "https://abcnews.go.com/Politics/special-counsel-charges-fbi-confidential-source-alexander-smirnov/story?id=107275129"
  },
  {
    "text": "FBI informant at heart of GOP's Biden bribery allegations indicted over false statements  —  The confidential source at the center of allegations being promoted by House Republicans that President Biden accepted a bribe has been arrested and charged with making false statements to the FBI.",
    "url": "https://thehill.com/regulation/court-battles/4471124-fbi-informant-at-heart-of-gops-biden-bribery-allegations-indicted-for-false-statements/"
  },
  {
    "text": "The final repudiation of ‘2000 Mules’  —  Since Donald Trump left office in January 2021, there has been no more influential presentation of his theory that the election was stolen than the film “2000 Mules,” created by activist — and Trump pardon recipient — Dinesh D'Souza.",
    "url": "https://www.washingtonpost.com/politics/2024/02/15/dsouza-2000-mules-repudiation/"
  },
  {
    "text": "Texas Active Club Leader Blurred His Face But Forgot to Scrub His Socials  —  The Texas Observer and Bellingcat have identified the leader of a white nationalist group that distributed antisemitic and racist flyers in Weatherford, Mineral Wells, and Eagle Pass, three small Texas cities, over the last year.",
    "url": "https://www.bellingcat.com/news/2024/02/15/texas-active-club-leader-blurred-his-face-but-forgot-to-scrub-his-socials/"
  },
  {
    "text": "US disrupts Russian hacking campaign that infiltrated home, small business routers: DOJ  —  The FBI coordinated with other foreign partners to disrupt the GRU-led campaign.  —  A laptop is seen on a Russian flag in this undated stock photo.  —  The FBI announced Thursday it successfully disrupted … ",
    "url": "https://abcnews.go.com/Politics/us-disrupts-russian-hacking-campaign-infiltrated-home-small/story?id=107258976"
  },
  {
    "text": "White House hits Johnson for going on recess without passing Ukraine aid  —  The White House on Thursday bashed Speaker Mike Johnson (R-La.) for starting the House recess without bringing the Senate-passed Ukraine aid package to the floor for a vote.  —  The Senate early Tuesday approved … ",
    "url": "https://thehill.com/homenews/administration/4470043-white-house-hits-johnson-for-going-on-recess-without-passing-ukraine-aid/"
  },
  {
    "text": "Rosendale drops Montana Senate bid  —  Rosendale just launched a long-anticipated Senate bid last Friday against Sen. Jon Tester (D-Mont.).  The filing deadline for the state is March 11.  —  GOP Rep. Matt Rosendale is dropping his Montana Senate bid less than a week after he officially launched it, he confirmed to POLITICO.",
    "url": "https://www.politico.com/news/2024/02/15/rosendale-drops-montana-senate-bid-00141812"
  },
  {
    "text": "Air Canada's chatbot gave a B.C. man the wrong information.  Now, the airline has to pay for the mistake  —  Air Canada has been ordered to compensate a B.C. man because its chatbot gave him inaccurate information.  —  The Civil Resolution Tribunal's decision on the dispute was posted online Wednesday … ",
    "url": "https://bc.ctvnews.ca/air-canada-s-chatbot-gave-a-b-c-man-the-wrong-information-now-the-airline-has-to-pay-for-the-mistake-1.6769454"
  },
  {
    "text": "Rep. Barbara Lee in California Senate race says minimum wage should be raised to $50  —  Candidates vying for California's U.S. Senate seat met onstage Monday for a relatively tame second debate, where California's cost of living was raised as a key issue.  —  In a standout moment … ",
    "url": "https://www.usatoday.com/story/news/politics/2024/02/15/barbara-lee-minimum-wage/72611446007/"
  },
  {
    "text": "Maryland 2024 Poll: Former Gov. Larry Hogan Starts Strong in Election for Open Senate Seat  —  Trump's Criminal Indictments Raise More Doubts for Voters than Bidens' Age  —  Economy and Crime are Top Issues for Maryland Voters  —  The first Emerson College Polling/The Hill/DC News Now survey … ",
    "url": "https://emersoncollegepolling.com/maryland-2024-poll-former-gov-larry-hogan-starts-strong-in-election-for-open-senate-seat/"
  },
  {
    "text": "Russia has obtained a ‘troubling’ emerging anti-satellite weapon, the White House says  —  The White House on Thursday publicly confirmed that Russia's has obtained a “troubling” emerging anti-satellite weapon but said it cannot directly cause “physical destruction” on Earth.",
    "url": "https://apnews.com/article/russia-anti-satellite-weapon-threat-technology-2880f9c55122dcafe87188bc92dd6cde"
  }
]