[
  {
    "text": "Harris defeats Trump in Virginia  —  Vice President Harris has won Virginia, maintaining Democrats' control of the state at the presidential level despite some Republican inroads in recent years, according to a projection from Decision Desk HQ.  —  Polls in the run-up to Election … ",
    "url": "https://thehill.com/homenews/campaign/4964243-kamala-harris-wins-virginia/"
  },
  {
    "text": "NBC News Exit Poll: Voters express deep concern about America's democracy and economy  —  Women are twice as likely as men to rank abortion as their top issue, according to preliminary results from the national survey.  —  The state of democracy and the economy in the United States … ",
    "url": "https://www.nbcnews.com/politics/2024-election/nbc-news-exit-poll-voters-express-concern-democracy-economy-rcna178602"
  },
  {
    "text": "NBC News Exit Poll: Harris loses ground with Latinos  —  NBC News Exit Poll Desk  —  Latino men are breaking for Trump by a 10-point margin, 54% to 44%, in a major reversal from four years ago, according to the NBC News Exit Poll.  In 2020, Latino men backed Biden over Trump by a 23-point margin, 59% to 36%.",
    "url": "https://www.nbcnews.com/politics/2024-election/live-blog/presidential-election-2024-live-updates-rcna175556/rcrd62776?canonicalCard=true"
  },
  {
    "text": "Trump is doing better than 2020 all across the board so far  —  One trend is coming in clear across the more than 1,300 counties that have reported close to complete results already: Donald Trump is improving on his 2020 margins.  While most of these counties aren't in the battlegrounds, they reveal a consistent shift toward Trump.",
    "url": "https://www.politico.com/live-updates/2024/11/05/2024-election-results-live-coverage-updates-analysis/trump-harris-counties-2020-comparison-00187667"
  },
  {
    "text": "AP VoteCast: Harris voters motivated by democracy, Trump supporters by inflation and immigration  —  Voters for Kamala Harris and Donald Trump who cast their ballots for Tuesday's presidential election had vastly different motivations — reflecting a broader national divide on the problems the United States faces.",
    "url": "https://apnews.com/article/ap-votecast-elections-harris-trump-voters-d5cf4e3611f50ec4349d93ddc7f037cd"
  },
  {
    "text": "Live Presidential Forecast  —  Our election model estimates the outcome of the race in real time based on polling data, the votes reported so far and what we expect from remaining votes.  Read how it works ›  —  Chance of winning  —  No estimates yet",
    "url": "https://www.nytimes.com/interactive/2024/11/05/us/elections/results-president-forecast-needle.html"
  },
  {
    "text": "Election Live Updates: A Caustic and Turbulent Race Is in Voters' Hands  — Polls in parts of Indiana and Kentucky have closed, and voting ends in six more states including Georgia, a key battleground, at 7 p.m. Eastern time.  Turnout looked strong in an election that Vice President Kamala Harris … ",
    "url": "https://www.nytimes.com/live/2024/11/05/us/trump-harris-election"
  },
  {
    "text": "What a GOP congressional majority could mean for a Trump presidency  —  One senator said voters are giving Republicans “an extraordinary opportunity.”  —  Ohio Republican Senate candidate Bernie Moreno during a watch party on election night, Nov. 5, 2024, in Westlake, Ohio, with his wife Bridget.",
    "url": "https://abcnews.go.com/Politics/gop-congressional-majority-trump-presidency/story?id=115548853"
  },
  {
    "text": "Democrats feel 2016 all over again in Harris-Trump battle  —  Democrats started election night feeling genuinely optimistic about Vice President Harris's chance of becoming the nation's first female president.  —  But as the evening wore on and former President Trump began to surpass 200 electoral votes … ",
    "url": "https://thehill.com/homenews/campaign/4975404-democrats-optimistic-vice-president-harris/"
  },
  {
    "text": "Florida's abortion amendment fails, leaving 6-week ban in place  —  Florida's abortion-rights ballot initiative fell short of passing on Tuesday, leaving in place a six-week abortion ban that has helped restrict access across almost all of the Southern U.S.  —  The measure's defeat … ",
    "url": "https://thehill.com/policy/healthcare/4969765-florida-abortion-rights-ballot/"
  },
  {
    "text": "Florida amendment to legalize recreational marijuana falls short  —  Despite public backing from Donald Trump, marijuana will remain legal in the state only for medical use, NBC News projects.  —  An effort to legalize the use of recreational marijuana in Florida has failed at the ballot box, NBC News projects.",
    "url": "https://www.nbcnews.com/politics/2024-election/florida-marijuana-recreational-use-ballot-measure-rejected-rcna173902"
  },
  {
    "text": "Live House election results for 2024 races  —  House elections live balance of power for 2024  —  All 435 seats in the U.S. House of Representatives are on the ballot on Election Day, and whichever party wins control of the House will likely have a slim majority, making every seat crucial to a majority.",
    "url": "https://www.cbsnews.com/live-updates/house-election-results-2024/"
  },
  {
    "text": "Election Day bomb threats disrupt voting in multiple states  —  The U.S. saw a rash of discredited bomb threats called in at polling places in multiple states on Election Day, in some cases spurring the need for extended voting hours.  —  Faulty bomb threats were called into at least five states … ",
    "url": "https://thehill.com/homenews/campaign/4975024-russia-bomb-threats-polling-places/"
  },
  {
    "text": "Sarah McBride becomes the first out transgender person elected to Congress  —  McBride, a Democrat who served two terms as a state senator, wins Delaware's only House seat, NBC News projects.  —  WILMINGTON, Del. — Delaware state Sen. Sarah McBride won the state's only House seat Tuesday … ",
    "url": "https://www.nbcnews.com/nbc-out/out-politics-and-policy/sarah-mcbride-first-transgender-congress-delaware-rcna177878"
  },
  {
    "text": "Trump campaign denies and revokes journalists' election night credentials after critical coverage  —  New York CNN  —  Journalists from multiple news organizations have been denied credentials to former President Donald Trump's election night watch event in West Palm Beach, Florida … ",
    "url": "https://www.cnn.com/2024/11/05/media/trump-revokes-journalists-election-night-credentials/"
  },
  {
    "text": "Israel's Netanyahu dismisses his defense minister as wars rage.  Protests erupt across country  —  Israeli Prime Minister Benjamin Netanyahu on Tuesday dismissed his popular defense minister, Yoav Gallant, in a surprise announcement that came as the country is embroiled in wars on multiple fronts across the region.",
    "url": "https://apnews.com/article/israel-netanyahu-gallant-gaza-war-lebanon-3810d3adb1603e8485b4be46a5b79f8b"
  },
  {
    "text": "Moreno ousts Brown in Ohio Senate race  —  Republican businessman Bernie Moreno has defeated incumbent Sen. Sherrod Brown (D-Ohio), the chair of the Senate Banking Committee, boosting Republican chances of taking back control of the Senate.  —  Moreno, 57, who built up a successful network … ",
    "url": "https://thehill.com/homenews/senate/4973460-moreno-defeats-brown-senate-race/"
  },
  {
    "text": "Andy Kim Wins in New Jersey to Become the First Korean American Senator  —  Mr. Kim, a Democrat, will take the seat previously held by Robert Menendez, who resigned after being convicted of taking bribes.  —  Representative Andy Kim was elected on Tuesday to the U.S. Senate … ",
    "url": "https://www.nytimes.com/2024/11/05/nyregion/nj-senate-kim-bradshaw.html"
  },
  {
    "text": "Supreme Court: Cobb County absentee ballots must be returned by Election Day  —  The court sided with the Republican National Committee, removing the relief that a lower court ordered.  —  The Georgia Supreme Court on Monday ordered that Cobb County may only count absentee ballots received by 7 p.m. on Election Day.",
    "url": "https://www.ajc.com/politics/cobb-county-absentee-ballots-must-be-returned-by-election-day-georgia-supreme-court-rules/7DHUDZ4IARGOLDHYPR53AI7PYU/"
  },
  {
    "text": "Milwaukee rerunning more than 30,000 absentee ballots over error, delaying results  —  Vanessa Swales Alison DirrMilwaukee Journal Sentinel  —  The City of Milwaukee restarted the processing about 31,000 absentee ballots after an election observer brought to officials' attention that doors covering … ",
    "url": "https://www.jsonline.com/story/news/politics/elections/2024/11/05/milwaukee-rerunning-more-than-30000-ballots-over-machine-error/76078233007/"
  },
  {
    "text": "How are things looking in Pennsylvania?  Dems are feeling cautiously optimistic  —  How are Democrats feeling in Pennsylvania, the most pivotal battleground in the country?  Cautiously optimistic.  I surveyed 10 Dem elected officials and strategists across the state and, to a person … ",
    "url": "https://www.politico.com/live-updates/2024/11/05/2024-election-results-live-coverage-updates-analysis/pennsylvania-vibe-check-early-00187540"
  },
  {
    "text": "Arizona's Kari Lake Is Already Claiming Election Fraud  —  The night before the election, Arizona Senate candidate Kari Lake, a former TV anchor-turned-election truther, thanked her supporters for voting early—something she has long railed against.  —  Prescott, AZ — Kari Lake stood … ",
    "url": "https://www.wired.com/story/kari-lake-campaign-claims-election-fraud/"
  },
  {
    "text": "Former DACA recipient wins New Mexico legislative seat, making history  —  This piece originally appeared as part of NPR's live coverage of the 2024 election.  For more election coverage from the NPR Network head to our live updates page.  —  ALBUQUERQUE — Democrat Cindy Nava … ",
    "url": "https://www.npr.org/2024/11/06/g-s1-32862/daca-new-mexico-results-immigration-cindy-nava"
  }
]