[
  {
    "text": "Ex-officer Derek Chauvin, convicted in George Floyd's killing, stabbed in prison, AP source says  —  Derek Chauvin, the former Minneapolis police officer convicted of murdering George Floyd, was stabbed by another inmate and seriously injured Friday at a federal prison in Arizona … ",
    "url": "https://apnews.com/article/derek-chauvin-george-floyd-prison-stabbing-f24cde6aa28877d034530c2dc40ef7ea"
  },
  {
    "text": "Derek Chauvin stabbed, seriously injured in prison  —  The former Minneapolis police officer has been serving time in a medium-security prison in Arizona.  —  Former Minneapolis police officer Derek Chauvin was stabbed and seriously injured Friday by a fellow inmate at an Arizona federal prison … ",
    "url": "https://www.startribune.com/report-derek-chauvin-stabbed-seriously-injured-in-prison/600322234/"
  },
  {
    "text": "Rep. Dean Phillips Announces He Won't Seek Re-Election to Congress  —  MINNETONKA, MN - Today, Rep. Dean Phillips (D, MN) announced he will not seek re-election to Congress in 2024.  Phillips has represented Minnesota's Third Congressional District in the U.S. House of Representatives since 2019 and released the following statement:",
    "url": "https://phillips.house.gov/news/documentsingle.aspx?DocumentID=1003"
  },
  {
    "text": "Rep. Dean Phillips, running for president, won't seek re-election to Congress  —  Returning to Congress after his primary challenge to President Biden would be “both unproductive and uncomfortable,” Phillips said.  —  Democratic Rep. Dean Phillips will not run for re-election to the U.S. House … ",
    "url": "https://www.startribune.com/rep-dean-phillips-running-for-president-wont-seek-reelection-congress-us-house/600322141/"
  },
  {
    "text": "Pro-Israel teacher hides in Queens high school as ‘radicalized’ students riot: ‘They want her fired’  —  Hundreds of “radicalized” kids rampaged through the halls of a Queens high school this week for nearly two hours after they discovered a teacher had attended a pro-Israel rally … ",
    "url": "https://nypost.com/2023/11/25/metro/jewish-teacher-hides-in-queens-high-school-as-students-riot/"
  },
  {
    "text": "Andrew Cuomo accused of sexual harassment in new lawsuit filed by former executive assistant Brittany Commisso  —  A former executive assistant to former New York Gov. Andrew Cuomo who had accused him of groping her has filed a lawsuit alleging sexual harassment.",
    "url": "https://www.cbsnews.com/news/andrew-cuomo-sued-sexual-assault-brittany-commisso-former-executive-assistant/"
  },
  {
    "text": "Andrew Cuomo accused of sexual harassment by former aide in new legal filing  —  ALBANY, N.Y. — Former New York Gov. Andrew Cuomo is being sued by a former aide who says Cuomo sexually harassed her while he was still in office.  —  Cuomo's former executive assistant Brittany Commisso filed … ",
    "url": "https://www.washingtonpost.com/politics/2023/11/24/cuomo-sexual-harassment-lawsuit-adult-survivors-act/f0c4056e-8b06-11ee-a36e-fdb7be9bd43d_story.html"
  },
  {
    "text": "Who Would Donald Trump  —  CHOOSE AS HIS RUNNING MATE?  —  Donald J. Trump hasn't won a single primary or caucus vote yet, let alone the Republican nomination, but his lead in the polls has left much of the political world viewing his nomination as all but inevitable.",
    "url": "https://www.nytimes.com/interactive/2023/us/politics/donald-trump-vp.html"
  },
  {
    "text": "X May Lose Up to $75 Million in Revenue as More Advertisers Pull Out  —  Internal documents show companies like Airbnb, Coca-Cola and Microsoft have halted ads, or are at risk of doing so, after Elon Musk's endorsement of an antisemitic conspiracy theory.  —  X, the social media company formerly known … ",
    "url": "https://www.nytimes.com/2023/11/24/business/x-elon-musk-advertisers.html"
  },
  {
    "text": "No American hostages freed by Hamas on day one of cease-fire with Israel  —  US official says White House ‘doing all we can’ to secure Americans' release  —  Two dozen hostages were released by the terrorist group Hamas, but no American was released on the first day of the cease-fire with Israel.",
    "url": "https://www.foxnews.com/politics/no-american-hostages-freed-hamas-day-1-cease-fire-israel"
  },
  {
    "text": "The polls keep getting worse for Biden  —  Trump's vote share in national polls is higher than at any time in the past year.  —  President Joe Biden's poll numbers keep getting worse.  —  November started with New York Times/Siena College polls showing Trump ahead in four of the six swing states … ",
    "url": "https://www.politico.com/news/2023/11/25/biden-polls-worse-trump-00128536"
  },
  {
    "text": "Ted Cruz Skewers Kamala Harris Gas Stove That He Claims ‘Dems Want to Ban’  —  Never mind the White House has said President Biden would not support such a ban  —  Sen. Ted Cruz (R-Texas) was tilting at windmills — or, rather tilting at gas stoves — on Friday when he slammed Vice President Kamala Harris … ",
    "url": "https://themessenger.com/news/ted-cruz-skewers-kamala-harris-gas-stove-that-he-claims-dems-want-to-ban"
  },
  {
    "text": "House Speaker Mike Johnson Spent Years Defending Christian Speech In Public Schools  —  “The ultimate goal of the enemy is silencing the Gospel,” the Republican said in 2004 after Jewish parents sued a school for pushing Christianity on their kids.  —  LOADING",
    "url": "https://www.huffpost.com/entry/mike-johnson-christianity-public-schools_n_65565dfce4b0998d699f5f0d"
  },
  {
    "text": "Anonymous businessman donates $800,000 to struggling Auburn Food Bank  —  The food bank's director said they can now afford to move into a bigger space just blocks down the road.  —  AUBURN, Wash. — The population in the city of Auburn has grown by more than 30,000 people since the millennium … ",
    "url": "https://www.king5.com/article/news/local/anonymous-businessman-donates-to-struggling-auburn-food-bank/281-27a4b58a-0716-42ee-bf2c-fe05f83c8ae1"
  },
  {
    "text": "The Secret Megadonor Behind the MAGA Movement's ‘Nerve Center’  —  In the aftermath of Jan. 6, one conservative group has been buying up real estate around Capitol Hill and growing its influence.  Much of that is thanks to this one secret donor. … In a few short years … ",
    "url": "https://www.thedailybeast.com/the-secret-megadonor-mike-rydin-behind-the-maga-movements-nerve-center-conservative-partnership-institute"
  },
  {
    "text": "Heroic Immigrant Actually Stopped the Dublin Stabbing That Led to Far-Right Riot  —  Far right ‘hooligans’ whipped up outrage after reports the attacker in the shocking Dublin school stabbing was an immigrant.  It turns out, the man who stopped him was Brazilian.",
    "url": "https://www.thedailybeast.com/caio-benicio-heroic-brazilian-stopped-the-dublin-stabbing-that-led-to-far-right-riot"
  }
]