[
  {
    "text": "Why Is Trump Trying to Make Ukraine Lose?  —  The former president isn't in office—but is still dictating U.S. policy.  —  Nearly half a year has passed since the White House asked Congress for another round of American aid for Ukraine.  Since that time, at least three different legislative efforts … ",
    "url": "https://www.theatlantic.com/ideas/archive/2024/02/one-global-issue-trump-cares-about/677592/"
  },
  {
    "text": "Democratic leader shoots down discharge petition on Ukraine-border bill  —  The head of the House Democratic Caucus wasted no time Thursday shooting down a bipartisan proposal linking Ukraine aid to border security.  —  Rep. Pete Aguilar (D-Calif.) said the supporters of that plan are “well-meaning” and “thoughtful” lawmakers.",
    "url": "https://thehill.com/homenews/house/4497826-democratic-leader-shoots-down-discharge-petition-on-ukraine-border-bill/"
  },
  {
    "text": "House Republican prepares “discharge petition” on Ukraine aid … - “We have to get something done,” said Rep. Brian Fitzpatrick (R-Pa.), co-chair of the bipartisan Problem Solvers Caucus, who is leading the push.  — “It's existential, it's time sensitive.",
    "url": "https://www.axios.com/2024/02/29/house-republican-ukraine-aid-discharge-petition"
  },
  {
    "text": "House passes short-term funding bill to avert shutdown  —  The House on Thursday approved a short-term funding bill to avert a partial government shutdown this weekend, sending the legislation to the Senate one day before Friday's funding deadline.  —  The legislation … ",
    "url": "https://thehill.com/homenews/house/4497940-house-passes-short-term-funding-bill-to-avert-shutdown/"
  },
  {
    "text": "Trump pushes Steve Daines to succeed McConnell as GOP's Senate leader … - Trump, is consolidating his power over the GOP and Republicans in Congress, and his blessing — along with a triumphant November election — could position Daines for the Senate leadership job when the new Congress starts in January.",
    "url": "https://www.axios.com/2024/02/29/trump-pushes-steve-daines-mcconnell-successor-senate"
  },
  {
    "text": "Scoop: GOP Rep. Mark Green reverses decision to retire after Trump pressure … - “While my strong desire was to leave Congress at the end of this year, since my announcement, I have received countless calls from constituents, colleagues, and President Trump urging me to reconsider,” he said in a statement.",
    "url": "https://www.axios.com/2024/02/29/mark-green-congress-retire-reelection-trump"
  },
  {
    "text": "Goodbye, Mitch: You were the worst  —  But the Republicans might find someone even worse to replace you  —  He will be remembered as one of the most dangerous politicians in living memory.  He helped transform the Republican Party into a cult, worshiping at the altar of authoritarianism.",
    "url": "https://robertreich.substack.com/p/goodbye-mitch-you-were-the-worst"
  },
  {
    "text": "Trump appeals Illinois judge's ruling removing him from primary ballot  —  Judge Tracie Porter had ordered Trump's removal from presidential ballot for his role in the US Capitol attack  —  Donald Trump has appealed a decision from an Illinois state judge who decided he should be removed … ",
    "url": "https://www.theguardian.com/us-news/2024/feb/29/trump-illinois-presidential-primary-ballot-appeal"
  },
  {
    "text": "Supreme Court narrows the lens as it takes up Trump's immunity claim  —  In agreeing to hear the case, the court made it clear that it will focus on specifics of when a former president might be able to claim immunity for official acts taken in office.  —  WASHINGTON — As former President … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-narrows-lens-takes-trumps-immunity-claim-rcna141155"
  },
  {
    "text": "Pace of Supreme Court Immunity Case Shadowed by Looming Election  —  In an ordinary case, the justices' decision to hear arguments in April might seem a sober compromise.  But the electoral calendar and Donald J. Trump's hope for delays prompt questions.  —  “There comes a point,” … ",
    "url": "https://www.nytimes.com/2024/02/29/us/politics/supreme-court-immunity-case.html"
  },
  {
    "text": "Republican senator blocks bill to protect IVF  —  Sen. Cindy Hyde-Smith, R-Miss., blocked the bill brought by Sen. Tammy Duckworth, D-Ill., who used IVF to have her daughters.  —  WASHINGTON — Republican Sen. Cindy Hyde-Smith of Mississippi blocked passage of legislation Wednesday that would protect access to in vitro fertilization.",
    "url": "https://www.nbcnews.com/politics/congress/republican-senator-cindy-hyde-smith-blocks-bill-protecting-ivf-rcna141083"
  },
  {
    "text": "Washington State's largest labor union endorses ‘uncommitted’ over Biden  —  The biggest state chapter of the United Food and Commercial Workers suggested it is concerned about Joe Biden's ability to defeat Donald Trump.  —  The biggest labor union in Washington State endorsed voting … ",
    "url": "https://www.nbcnews.com/politics/2024-election/washington-states-largest-labor-union-endorses-uncommitted-biden-rcna141139"
  },
  {
    "text": "Trump's claims of a migrant crime wave are not supported by national data  —  An NBC News review of available 2024 crime data shows overall crime levels dropping in those cities that have received the most migrants.  —  WASHINGTON — When Donald Trump speaks at the southern border in Texas on Thursday … ",
    "url": "https://www.nbcnews.com/politics/2024-election/trumps-claims-migrant-crime-wave-are-not-supported-national-data-rcna140896"
  },
  {
    "text": "Britt to deliver GOP response to Biden State of the Union address  —  Sen. Katie Britt (R-Ala.) will deliver the Republican response to President Biden's State of the Union address next week.  —  “I am truly honored and grateful for the opportunity to speak directly to my fellow Americans on March 7.",
    "url": "https://thehill.com/homenews/campaign/4498239-britt-to-deliver-gop-response-to-biden-state-of-the-union-address/"
  },
  {
    "text": "Revealed: ‘extremist’ Trump economist plots rightwing overhaul of US treasury  —  Stephen Moore, who withdrew from Fed consideration after sexist remarks were uncovered, is co-author of radical Project 2025 effort  —  Stephen Moore, a conservative economist whose controversial remarks … ",
    "url": "https://www.theguardian.com/us-news/2024/feb/29/trump-economist-stephen-moore-us-treasury-project-2025"
  },
  {
    "text": "Missouri GOP Candidate for Governor Was Only ‘Honorary’ KKK Member  —  The name of “Pro-White man” Darrell Leon McClanahan III sits atop Missouri's gubernatorial ballot  —  These photos tweeted yesterday by former Missouri Representative Shamed Dogan first appeared on the website … ",
    "url": "https://www.riverfronttimes.com/news/missouri-gop-candidate-for-governor-is-only-honorary-kkk-member-42007057"
  },
  {
    "text": "Israel-Hamas war: Gaza Health Ministry says over 30,000 Palestinians killed  —  Israeli strikes over central Gaza late Wednesday killed at least 20 people, including five women and two children.  Dozens of men held prayers for the deceased, wrapped traditionally in white shrouds, outside al-Aqsa Martyrs Hospital in Deir al-Balah.",
    "url": "https://apnews.com/article/israel-hamas-war-news-02-29-2024-f9b5a62a80d8b83eac4946d3c85af58b"
  },
  {
    "text": "E. Jean Carroll tells judge to reject Trump's request to delay $83 million judgment, calling him the ‘least trustworthy of borrowers’  —  E. Jean Carroll said Donald Trump should not be given more time to post the $83.3 million she was awarded in her defamation trial against the former president … ",
    "url": "https://www.cnn.com/2024/02/29/politics/e-jean-carroll-donald-trump/"
  },
  {
    "text": "Judge blocks Texas law that gives police broad powers to arrest migrants who illegally enter US  —  A federal judge on Thursday blocked a new Texas law that gives police broad powers to arrest migrants suspected of illegally entering the U.S., dealing a victory to the Biden administration … ",
    "url": "https://apnews.com/article/texas-migrant-arrests-court-ruling-3bcded91620cbd9686575caa6bcac203"
  }
]