[
  {
    "text": "Senior U.S. prosecutor resigns, citing demands to open probe into Biden-era contract  —  The top federal prosecutor who supervised criminal cases at the Washington, D.C. U.S. Attorney's office resigned on Tuesday, citing what she described as an improper demand by officials appointed … ",
    "url": "https://ca.news.yahoo.com/senior-u-prosecutor-resigns-citing-150420249.html"
  },
  {
    "text": "Head of Justice Department's Washington, DC, criminal division quits  —  The head of the criminal division within the DC US Attorney's Office has left her post, according to four sources.  —  The sudden departure of Justice Department veteran Denise Cheung comes a day after President Donald … ",
    "url": "https://www.cnn.com/2025/02/18/politics/justice-department-dc-criminal-division"
  },
  {
    "text": "High-ranking D.C. federal prosecutor resigns in protest  —  The leader of the criminal division has stepped down following a dispute over freezing Biden-era environmental grants.  —  The head of the criminal division in the U.S. attorney's office in D.C. resigned Tuesday morning after declining … ",
    "url": "https://www.washingtonpost.com/investigations/2025/02/18/federal-prosecutor-dc-resigns/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM5ODU0ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQxMjM3MTk5LCJpYXQiOjE3Mzk4NTQ4MDAsImp0aSI6ImIxY2MyZTAyLTY1YWUtNDg5ZS1iMTBiLWIzNzYwYmI4MGZmZiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9pbnZlc3RpZ2F0aW9ucy8yMDI1LzAyLzE4L2ZlZGVyYWwtcHJvc2VjdXRvci1kYy1yZXNpZ25zLyJ9.qO8Nbo3eH7L7qqiJiGL7va_FWw9RTBni2zBb7t1InN4&itid=gfta"
  },
  {
    "text": "USDA says it accidentally fired officials working on bird flu and is trying to rehire them  —  In a statement, an Agriculture Department spokesperson told NBC News that officials are “working to swiftly rectify the situation.”  —  The United States Department of Agriculture on Tuesday acknowledged that … ",
    "url": "https://www.nbcnews.com/politics/doge/usda-accidentally-fired-officials-bird-flu-rehire-rcna192716"
  },
  {
    "text": "Musk Ally Demands Admin Access to System That Lets Government Text the Public  —  A worker at the General Services Administration told colleagues in a Slack message Tuesday that they have resigned in protest after Elon Musk ally Thomas Shedd requested “admin/root access to all components … ",
    "url": "https://www.404media.co/musk-ally-demands-admin-access-to-system-that-lets-government-text-the-public/"
  },
  {
    "text": "U.S. weighs destroying $500 million in stockpiled covid tests  —  The government is reviewing proposals to shut down the program that ships free covid tests to American households and has been considering destroying 160 million tests.",
    "url": "https://www.washingtonpost.com/health/2025/02/18/trump-administration-covid-tests-stockpile/"
  },
  {
    "text": "F.D.A.'s Food Safety Chief Resigns Over Trump Administration Layoffs  —  The chief said the loss of critical employees overseeing the nation's food supply made his work impossible.  Robert F. Kennedy Jr., the nation's new health secretary, has pledged to gut the division.",
    "url": "https://www.nytimes.com/2025/02/18/us/politics/fda-food-safety-jim-jones-resignation.html"
  },
  {
    "text": "Food head at FDA quits citing Trump administration's mass staff cuts  —  Jim Jones, who joined Food and Drug Administration in 2023, says layoffs would make it ‘fruitless’ to continue in role  —  The head of the food division at the US Food and Drug Administration has quit in protest … ",
    "url": "https://www.theguardian.com/us-news/2025/feb/18/fda-food-head-quits-trump"
  },
  {
    "text": "Trump says Ukraine ‘should never have started it’ in comments about war with Russia  —  Trump made the remark while deriding Ukrainian President Volodymyr Zelenskyy, whose country was invaded by Russia in February 2022.  —  President Donald Trump suggested Tuesday that Ukraine was responsible … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-says-ukraine-should-never-have-started-it-remarks-war-russia-rcna192710"
  },
  {
    "text": "‘Good luck with that.’ Trump administration terminates privacy officials at agency overseeing government hiring and firing  —  The Trump administration has quietly fired multiple members of the “privacy team” and other officials from the office that oversees the hiring of federal workers … ",
    "url": "https://www.cnn.com/2025/02/18/politics/opm-privacy-team-fired/"
  },
  {
    "text": "Judge calls prosecutors into court to explain reasons for abandoning Eric Adams case  —  Judge Dale Ho scheduled a hearing for Wednesday.  —  NEW YORK — The federal judge overseeing the criminal case against New York City Mayor Eric Adams ordered the mayor and federal prosecutors to appear … ",
    "url": "https://www.politico.com/news/2025/02/18/eric-adams-judge-orders-prosecutors-00204658"
  },
  {
    "text": "As U.S. and Putin negotiate, intel shows he's not interested ‘in a real peace deal,’ sources say  —  Intelligence suggests Russian President Vladimir Putin is going through the motions and still thinks he can eventually control all of Ukraine, the sources told NBC News.",
    "url": "https://www.nbcnews.com/politics/national-security/us-putin-negotiate-intel-shows-s-not-interested-real-peace-deal-source-rcna192524"
  },
  {
    "text": "Defense Department firings expected to start soon, officials say  —  Pentagon agencies were told to submit lists of probationary employees after members of Elon Musk's DOGE arrived, people familiar with the matter said.  —  The Trump administration has directed defense agencies to turn … ",
    "url": "https://www.washingtonpost.com/national-security/2025/02/18/pentagon-layoffs-musk-doge-trump/"
  },
  {
    "text": "Judge Chutkan rejects call from Democratic AGs for temporary restraining order blocking DOGE's access to federal data  —  A federal judge declined on Tuesday to temporarily block Elon Musk and his Department of Government Efficiency from accessing federal data systems at a slew of executive branch agencies.",
    "url": "https://www.cnn.com/2025/02/18/politics/doge-temporary-restraining-order-chutkan"
  },
  {
    "text": "'Stephen, let's calm down': Yelling Trump aide berates host as he loses cool live on CNN  —  White House aide Stephen Miller launched into a barrage of shouting aimed at CNN's Brianna Keilar Tuesday as she grilled him on cuts being made by Elon Musk's Department of Government Efficiency … ",
    "url": "https://www.rawstory.com/stephen-miller-cnn/"
  },
  {
    "text": "Zachary Levi Begs Elon Musk Not To Fire The ‘Good’ Federal Workers Who Voted For Trump  —  The “Shazam” star was upset that Trump supporters are getting “lost in the cracks” during DOGE's firing frenzy.  —  LOADING  —  Oh, bless his heart: Zachary Levi seems to believe that a billionaire cares … ",
    "url": "https://www.huffpost.com/entry/zachary-levi-elon-musk-trump-voters_n_67b4ba4fe4b0765f4479cbfc"
  },
  {
    "text": "Trump's DOJ Erases Report On Violence Against Native American Women  —  The Justice Department has removed a report from its website that lays out recommendations for tackling the crisis of missing and murdered Indigenous women.  —  The Not Invisible Act Commission's final report … ",
    "url": "https://www.huffpost.com/entry/donald-trump-white-house-live-updates_n_67aa443de4b0cced3687c9ec/liveblog_67b4f9e5e4b08e2e24824c73"
  },
  {
    "text": "Not Even DOGE Employees Know Who's Legally Running DOGE  —  Despite all appearances, the White House insists that Elon Musk is not in charge of DOGE.  US Doge Service employees can't get a straight answer about who is.  —  President Donald Trump and Elon Musk have repeatedly affirmed Musk's leadership … ",
    "url": "https://www.wired.com/story/doge-elon-musk-leadership-administrator/"
  },
  {
    "text": "Brazil Charges Bolsonaro With Attempting a Coup  —  Brazil's attorney general charged the former president Jair Bolsonaro with trying to overturn the 2022 elections.  —  Jair Bolsonaro, Brazil's former president, was charged Tuesday with overseeing a vast scheme to try to undermine … ",
    "url": "https://www.nytimes.com/2025/02/18/world/americas/brazil-charges-bolsonaro-with-attempting-a-coup.html?unlocked_article_code=1.yE4.2sw0.VYH5zB6UhP9f&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "National Science Foundation Fires 168 Workers as Federal Purge Continues  —  Firings at the NSF included permanent employees who had already completed their one-year probationary period, as well as at-will workers.  —  The National Science Foundation fired nearly 170 workers in a Zoom call … ",
    "url": "https://www.wired.com/story/national-science-foundation-february-2025-firings/"
  },
  {
    "text": "Hamas says it will release bodies of four hostages, including Bibas children, on Thursday and six living hostages on Saturday  —  Hamas on Tuesday said that it will release the dead bodies of four Israeli hostages on Thursday, including the two youngest people held by the group, Kfir and Ariel Bibas.",
    "url": "https://www.cnn.com/2025/02/18/middleeast/hamas-israel-hostages-to-release-bibas-family-intl"
  },
  {
    "text": "Fact Sheet: President Donald J. Trump Expands Access to In Vitro Fertilization (IVF)  —  LOWERING COSTS AND REDUCING BARRIERS TO IVF: Today, President Donald J. Trump signed an Executive Order expanding access to in vitro fertilization (IVF) for Americans.  — The Order directs policy recommendations … ",
    "url": "https://www.whitehouse.gov/fact-sheets/2025/02/fact-sheet-president-donald-j-trump-expands-access-to-in-vitro-fertilization-ivf/"
  },
  {
    "text": "Kennedy says panel will examine childhood vaccine schedule after promising not to change it  —  To earn the vote he needed to become the nation's top health official, Robert F. Kennedy Jr. made a special promise to a U.S. senator: He would not change the nation's current vaccination schedule.",
    "url": "https://apnews.com/article/childhood-vaccines-schedule-kennedy-trump-hhs-4d5e6c52c602f5edbcd837748605e9d0"
  },
  {
    "text": "The House GOP budget resolution is in trouble  —  Speaker Mike Johnson is staring down at least a dozen Republican holdouts on the budget blueprint he wants to put on the House floor in the coming days — and he can only afford to lose one member and still approve the resolution along party lines.",
    "url": "https://www.politico.com/live-updates/2025/02/18/congress/budget-reconciliation-trump-whip-00204735"
  },
  {
    "text": "Birthright Citizenship  —  Since the publication of our opinion piece on birthright citizenship in the New York Times (\"Trump Might Have a Case on Birthright Citizenship\"), we have received numerous critiques, some quite thoughtful (others less so), both in this and other venues.",
    "url": "https://reason.com/volokh/2025/02/18/birthright-citizenship/"
  },
  {
    "text": "DOGE Tipline  —  The actions taken by Donald Trump through his executive orders and Elon Musk's tampering with federal agencies and systems are creating havoc within the government.  Have you been affected by this?  —  Please use the form below to share your story with us!",
    "url": "https://votevets.org/doge-tipline"
  },
  {
    "text": "Under Trump's Mass Deportation Plan, Some Migrants Are Being Sent to Panama  —  Migrants deported from the United States are being held at the Decapolis Hotel Panama in Panama City.  The deportees come from Afghanistan, Iran, China and other nations.  —  They arrived at the United States border … ",
    "url": "https://www.nytimes.com/2025/02/18/world/americas/trump-migrant-deportation-panama.html?unlocked_article_code=1.x04.R5ag.BfOOWT0b5lvs&smid=url-share"
  },
  {
    "text": "Trump's FBI pick one step closer to confirmation  —  Kash Patel, the controversial nominee to lead the FBI, cleared another key procedural hurdle Tuesday.  The Senate voted 48-45 to move forward with Patel's nomination, setting up his confirmation vote in the coming days to helm the agency for a 10-year term.",
    "url": "https://www.politico.com/live-updates/2025/02/18/congress/kash-patel-senate-confirmation-cloture-00204744"
  },
  {
    "text": "FAA Employees Say Trump and Musk's Purge Is a ‘Threat’ to Air Safety  —  After firing hundreds of Federal Aviation Administration employees, the Trump administration is now attempting to downplay safety concerns  —  Donald Trump and Elon Musk fired hundreds of Federal Aviation Administration … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-musk-faa-firings-purge-air-safety-1235271233/"
  },
  {
    "text": "Moving on from 18F.  —  note: This post gets into the last few weeks of American politics.  If that's not your cup of tea, or if that's a stressful topic for you, please feel free to skip this one.  (Also, it's a bit long.  Sorry about that.)  —  Last week, I finished my tenure as a designer at 18F.",
    "url": "https://ethanmarcotte.com/wrote/leaving-18f/"
  },
  {
    "text": "Missouri bill proposes registry for pregnant women to ‘reduce preventable abortions’  —  JEFFERSON CITY, Mo. (KTVI) — Legislation introduced in Missouri would create a list of “at risk” pregnant women in the state in order to “reduce the number of preventable abortions.”",
    "url": "https://thehill.com/homenews/state-watch/5151439-missouri-bill-registry-pregnant-women-abortion/"
  },
  {
    "text": "Trevor Noah makes shocking declaration that maybe segregation was a good thing after all  —  So while it was the Dems who fought to keep segregation as the status quo, most of that racism is still perpetuated by that same side.  This is why Trevor Noah and a Princeton professor discussed … ",
    "url": "https://www.louderwithcrowder.com/noah-benjamin-segregation"
  },
  {
    "text": "Bannon Calls Musk a ‘Parasitic Illegal Immigrant’  —  Stephen Bannon, a top adviser during President Trump's first term and a key figure among his supporters, said Elon Musk wants to “play-act as God” as part of his push to overhaul the federal government.  —  Stephen K. Bannon … ",
    "url": "https://www.nytimes.com/2025/02/18/us/politics/steve-bannon-elon-musk-feud.html"
  },
  {
    "text": "Appeals court blocks Biden's $500 billion student debt relief plan  —  A federal appeals court on Tuesday blocked former President Joe Biden's Saving on a Valuable Education plan, ruling that his administration lacked the authority to implement key provisions of the student loan repayment program.",
    "url": "https://www.washingtonexaminer.com/news/justice/3322428/appeals-court-blocks-biden-500-billion-student-debt-relief-plan/"
  },
  {
    "text": "Postmaster general to step down, asks for replacement  —  Postmaster General Louis DeJoy, a former prominent Trump fundraiser who was appointed during the president's first term, announced Tuesday he would be stepping down.  —  In a release, the U.S. Postal Service said DeJoy had notified … ",
    "url": "https://thehill.com/homenews/administration/5151031-postmaster-general-louis-dejoy-trump-musk-doge/"
  },
  {
    "text": "FEMA is losing scores of employees.  That could slow disaster response.  —  Cuts at the Federal Emergency Management Agency could affect people across the country who are struggling to rebuild and prepare for disasters.  —  Hundreds of Federal Emergency Management Agency employees were fired … ",
    "url": "https://www.washingtonpost.com/climate-environment/2025/02/18/fema-layoffs-disaster-response/"
  },
  {
    "text": "Hiring freeze of firefighters could be deadly, Forest Service captain warns  —  Capt. Ben McLane said stalled onboarding of seasonal employees will force the system to operate at a diminished capacity as the wildfire season heats up.  —  SKAMANIA COUNTY, Wash. — A freeze on the hiring … ",
    "url": "https://www.nbcnews.com/weather/wildfires/hiring-freeze-firefighters-deadly-forest-service-captain-warns-rcna192494"
  },
  {
    "text": "Meet the Disabled Vets, Cancer Researchers, and Nuclear Techs Fired by Elon Musk  —  Dave Pasquino served two tours in Iraq for this country.  When he came back, the 45-year-old veteran was told he was entitled to full disability benefits because of an array of symptoms like post-traumatic stress disorder … ",
    "url": "https://slate.com/news-and-politics/2025/02/elon-musk-doge-purge-cancer-nuclear-weapons.html"
  }
]