[
  {
    "text": "Exclusive: Harris leads Trump 44% to 42% in US presidential race, Reuters/Ipsos poll finds  —  Vice President Kamala Harris opened up a marginal two-percentage-point lead over Republican Donald Trump after President Joe Biden ended his re-election campaign and passed the torch to her, a Reuters/Ipsos poll found.",
    "url": "https://www.reuters.com/world/us/harris-leads-trump-44-42-us-presidential-race-reutersipsos-poll-finds-2024-07-23/"
  },
  {
    "text": "Poll: Presidential race hits a reset with Harris vs. Trump  —  The 2024 presidential campaign has hit a reset with more voters moving into the undecided camp now that Kamala Harris is potentially the Democratic nominee, a new NPR/PBS News/Marist poll finds.  —  Harris and former President Donald Trump … ",
    "url": "https://www.npr.org/2024/07/23/nx-s1-5048890/elections-poll-biden-harris-trump"
  },
  {
    "text": "Trump Camp Is Planning to ‘Willie Horton’ Kamala Harris  —  DONALD TRUMP'S CAMPAIGN IS PREPARING a full-scale blitz on Vice President Kamala Harris, with broadsides on her record that borrow from the ad that came to define dog-whistle politics.  —  The question is not just whether it will work … ",
    "url": "https://www.thebulwark.com/p/trump-planning-to-willie-horton-kamala"
  },
  {
    "text": "Clip resurfaces of Vance criticizing Harris for being ‘childless,’ testing Trump's new running mate  —  Comments Donald Trump's running mate JD Vance made in 2021 questioning Vice President Kamala Harris' leadership because she did not have biological children have resurfaced … ",
    "url": "https://apnews.com/article/jd-vance-kamala-harris-childless-trump-0a37e991097b66c52bff5bf7ecf8de7b"
  },
  {
    "text": "The Kamala Harris Effect  —  As the conversation about Joe Biden stepping aside ramped up after the June 27th debate, it was pretty clear, at least to me, that if he did so it could only be Kamala Harris to rise in his place.  This was true not just for logistical reasons such as access … ",
    "url": "https://thinkbigpicture.substack.com/p/kamala-harris-biden-trump-2024"
  },
  {
    "text": "Trump says he is willing to debate Harris multiple times … Former Presiden t Donald Trump on Tuesday said he would be willing to debate Vice President Kamala Harris multiple times if she is nominated, as expected, by the Democratic National Convention as the party's presidential candidate.",
    "url": "https://www.cnbc.com/2024/07/23/trump-says-he-is-willing-to-debate-harris-multiple-times.html"
  },
  {
    "text": "Live Election Updates: Harris Rallies Exuberant Wisconsin Crowd, Saying ‘When We Fight, We Win’  —  Vice President Kamala Harris visited a key battleground state and quickly went on the offensive against former President Donald J. Trump, casting the race as a contest between a prosecutor and a felon.",
    "url": "https://www.nytimes.com/live/2024/07/23/us/harris-trump-news-election-biden"
  },
  {
    "text": "Elon Musk backs down from $45 million a month pledge to Trump, says he doesn't ‘subscribe to cult of personality’ … Elon Musk is not spending $45 million a month to elect former President Donald Trump, though he has created a new super political action committee (PAC) to fund the Republican candidate … ",
    "url": "https://fortune.com/2024/07/23/elon-musk-backs-down-from-45-million-a-month-pledge-to-trump-says-he-doesnt-subscribe-to-cult-of-personality/"
  },
  {
    "text": "House GOP leaders urge members: Stop making race comments about Harris  —  Leadership warned lawmakers during a closed-door meeting to focus on the vice president's record, not her race.  —  House Republican leaders told lawmakers to focus on criticizing Vice President Kamala Harris' record without reference … ",
    "url": "https://www.politico.com/news/2024/07/23/gop-race-comments-harris-00170735"
  },
  {
    "text": "Secret Service Director Cheatle resigns with ‘heavy heart’ after Trump rally shooting  —  Secret Service Director Kimberly Cheatle faced scrutiny after the attempted assassination of former president Donald Trump at a rally in Pennsylvania.  —  U.S. Secret Service Director Kimberly Cheatle resigned Tuesday … ",
    "url": "https://www.washingtonpost.com/nation/2024/07/23/secret-service-director-cheatle-scrutiny/"
  },
  {
    "text": "Warren Introduces Bill Effectively Overturning Extremist SCOTUS “Chevron” Ruling  —  The far right Court handed a major win to corporate and right-wing interests in their “Chevron” ruling last month.  —  A group of senators led by Sen. Elizabeth Warren (D-Massachusetts) … ",
    "url": "https://truthout.org/articles/warren-introduces-bill-effectively-overturning-extremist-scotus-chevron-ruling/"
  },
  {
    "text": "The Very White and Very Male Race to Be Kamala Harris' Vice President Is Underway  —  Democrats' most prominent — and possibly most cookie-cutter — governors and senators are jockeying for Harris' consideration.  — Copy  —  Kentucky Gov. Andy Beshear made a conspicuous appearance on “Morning Joe.”",
    "url": "https://www.notus.org/2024-election/white-male-race-kamala-harris-vice-president"
  },
  {
    "text": "Michigan man kills himself after running over 80-year-old Trump supporter  —  The man called police to confess to a crime and then killed himself before authorities arrived at the scene  —  A Michigan man suspected of using an all-terrain vehicle to run over an elderly man … ",
    "url": "https://www.theguardian.com/us-news/article/2024/jul/23/hancock-michigan-man-death-"
  },
  {
    "text": "The Christian-Nationalist Rot Runs Deep  —  Also: Kamala Harris skips the start-up phase.  —  ∙ Paid  —  1. Christians  —  On Sunday, Brent Leatherwood, the president of the Southern Baptist Convention Ethics and Religious Liberty Commission, gave a statement about Joe Biden's decision to step aside from the 2024 campaign.",
    "url": "https://www.thebulwark.com/p/the-christian-nationalist-rot-runs"
  },
  {
    "text": "A Reader's Guide To MAGA's Racist And Misogynistic Attacks On Kamala Harris  —  A lot of things happened.  Here are some of the things.  This is TPM's Morning Memo.  Sign up for the email version.  —  Throw Everything Against The Wall And See What Sticks",
    "url": "https://talkingpointsmemo.com/morning-memo/racist-and-misogynistic-attacks-on-kamala-harris"
  },
  {
    "text": "Trump's Massive Deportation Plan Echoes Concentration Camp History  —  Trump's language about immigrants “poisoning” the U.S. repeats past rhetoric that led to civilian detention camps, with horrific, tragic results  —  The Republican National Convention hit rock bottom on its third day in Milwaukee … ",
    "url": "https://www.scientificamerican.com/article/trumps-massive-deportation-plan-echoes-concentration-camp-history/"
  },
  {
    "text": "Secret Service encourages Trump campaign to stop outdoor rallies  —  Trump campaign is scouting indoor venues, such as basketball arenas and other large spaces where thousands of people can fit, people familiar with the request said.  —  Secret Service officials encouraged Donald Trump's campaign … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/23/trump-rallies-secret-service-change/"
  },
  {
    "text": "Sunday was the hottest day ever recorded on Earth, scientists say  —  The historic day comes on the heels of 13 straight months of unprecedented temperatures and the hottest year scientists have ever seen.  —  Global temperatures hit the highest levels in recorded history on Sunday … ",
    "url": "https://www.washingtonpost.com/climate-environment/2024/07/23/hottest-day-ever-recorded-climate-change/"
  },
  {
    "text": "JD Vance repeatedly indicated in 2016 that he believed Donald Trump had committed sexual assault  —  Ohio Sen. JD Vance, the Republican vice presidential nominee, repeatedly indicated in 2016 that he believed Donald Trump had committed sexual assault, even suggesting in one TV segment that in a … ",
    "url": "https://www.cnn.com/2024/07/23/politics/kfile-jd-vance-believed-donald-trump-sexual-assault-allegations-2016/"
  },
  {
    "text": "Democratic foreign policy heavyweights endorse Harris in open letter  —  John Kerry, Susan Rice and others in the Democratic foreign policy establishment are lining up behind Kamala Harris for president, noting her international leadership.  —  Some of the most senior foreign policy leaders … ",
    "url": "https://www.washingtonpost.com/national-security/2024/07/23/kamala-harris-foreign-policy-endorsement/"
  },
  {
    "text": "Bob Menendez to resign Senate seat following federal bribery conviction  —  A storied career in New Jersey politics comes to an end as Menendez bows to calls for him to leave the Senate following his conviction on federal bribery and corruption charges.  —  Sen. Bob Menendez (D-N.J.) … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/23/senator-bob-menendez-resigns-senate/"
  }
]