[
  {
    "text": "Musk's DOGE seeks access to personal taxpayer data, raising alarm at IRS  —  The unusual request would put sensitive data about millions of American taxpayers in the hands of Trump political appointees.  —  Elon Musk's U.S. DOGE Service is seeking access to a heavily-guarded Internal Revenue Service system … ",
    "url": "https://www.washingtonpost.com/business/2025/02/16/doge-irs-access-taxpayer-data/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM5NjgyMDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQxMDY0Mzk5LCJpYXQiOjE3Mzk2ODIwMDAsImp0aSI6ImQyZjZkNzAxLWRlNDYtNDBkMy1hMzdlLTEzYTVkMmFiZDQwZSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9idXNpbmVzcy8yMDI1LzAyLzE2L2RvZ2UtaXJzLWFjY2Vzcy10YXhwYXllci1kYXRhLyJ9.GTR7Kzo7RHkVEfAw9fm8z_ME0V59fiFRofc8rtH9dG8&itid=gfta"
  },
  {
    "text": "DOGE-affiliated employee has accessed IRS system with sensitive taxpayer information  —  The Integrated Data Retrieval System allows IRS employees to access taxpayer information.  —  WASHINGTON — An Internal Revenue Service employee who is affiliated with the Department of Government Efficiency … ",
    "url": "https://www.nbcnews.com/politics/doge/doge-affiliated-employee-accessed-irs-system-sensitive-taxpayer-inform-rcna192423"
  },
  {
    "text": "The US said Ukraine would meet with Russia to discuss peace.  That was news to Kyiv.  —  “I do not know what it is,” said Ukraine's President Volodymyr Zelenskyy. … MUNICH — Ukrainian officials reacted with a mixture of shock and confusion to the news that top Trump administration officials … ",
    "url": "https://www.politico.eu/article/us-ukraine-russia-peace-kyiv-eu-munich-security-conference/"
  },
  {
    "text": "US Health Department Layoffs Expand to Medicare, FDA  — Employees at CMS, FDA, CDC received notices in weekend cuts  —  The Department of Health and Human Services laid off employees Saturday evening across some of its biggest agencies — the Centers for Medicare and Medicaid Services … ",
    "url": "https://www.bloomberg.com/news/articles/2025-02-16/us-health-department-layoffs-expand-to-medicare-fda"
  },
  {
    "text": "Mass firings continue across nation's health agencies  —  The cuts have raised questions about the extent of the impact on public health.  —  The Trump administration carried out more mass firings across the Health and Human Services Department this weekend, continuing a chaotic purge … ",
    "url": "https://www.politico.com/news/2025/02/16/mass-firings-health-agencies-00204570"
  },
  {
    "text": "CDC ‘disease detectors’ among hundreds fired as Trump administration ramps up agency cuts  —  Administration officials last week informed CDC leaders of plans to cut up to 10% of its workforce as it targeted federal probationary employees.  —  The Trump administration on Saturday terminated hundreds … ",
    "url": "https://www.nbcnews.com/politics/doge/cdc-disease-detectors-fired-trump-administration-agency-cuts-doge-rcna192420"
  },
  {
    "text": "Washington Post backs out of ‘Fire Elon Musk’ ad order  —  The Washington Post this week backed out of a “Fire Elon Musk” advertising order that was to run as a wrap on some of its Tuesday editions, according to the advocacy group Common Cause.  —  The group said it signed a $115,000 agreement … ",
    "url": "https://thehill.com/media/5148497-washington-post-backs-out-of-fire-elon-musk-ad-order/"
  },
  {
    "text": "Trump Fired, Then Unfired, National Nuclear Security Administration Employees.  What Were Their Jobs?  —  The administration asked some of the agency's workers, who were part of last week's massive layoffs across the federal government, to come back.  —  When termination letters were sent … ",
    "url": "https://www.nytimes.com/2025/02/16/us/politics/trump-national-nuclear-security-administration-employees-firings.html"
  },
  {
    "text": "Trump administration tries to bring back fired nuclear weapons workers in DOGE reversal  —  The Trump administration has halted the firings of hundreds of federal employees who were tasked with working on the nation's nuclear weapons programs, in an about-face that has left workers confused … ",
    "url": "https://apnews.com/article/nuclear-doge-firings-trump-federal-916e6819104f04f44c345b7dde4904d5"
  },
  {
    "text": "Democrats confront their powerlessness as Trump flexes authority  —  Amid Democrats' shock and bickering over how much to respond to President Donald Trump is a deeper question rippling through leaders across the Capitol and across the country: How much should they rely on the same institutional … ",
    "url": "https://www.cnn.com/2025/02/16/politics/democrats-strategy-powerless-trump/"
  },
  {
    "text": "Adams Forcefully Resists Calls to Resign: ‘I Am Going Nowhere’  —  Mayor Eric Adams spoke at two Black churches in Queens and pushed back at those who “are dancing on my grave.”  —  Whenever Mayor Eric Adams has faced adversity, he has sought refuge in the pulpit of Black churches … ",
    "url": "https://www.nytimes.com/2025/02/16/nyregion/eric-adams-resign.html"
  },
  {
    "text": "Trump Asks Supreme Court to Let Him Fire US Agency Head  — Justices asked to step in on emergency basis, person says  — Trump seeking to remove head of US whistleblower agency  —  President Donald Trump asked the US Supreme Court to let him fire the head of an independent US agency … ",
    "url": "https://www.bloomberg.com/news/articles/2025-02-16/trump-administration-asks-supreme-court-to-intervene-on-firing"
  },
  {
    "text": "DOGE Worker Says He Was Radicalized by Reading Writer Who Later Denied Holocaust  —  In a since-deleted Substack post, a member of Elon Musk's team praised an essay by Ron Unz—who has called the Holocaust potentially a “hoax” and said Trayvon Martin was “a violent young thug.”",
    "url": "https://www.motherjones.com/politics/2025/02/doge-elon-musk-ron-unz-holocaust-substack-post-sailer-vdare-trump/"
  },
  {
    "text": "Jan. 6 Rioters Argue Pardons Apply to Charges Including Murder Plot, Child Porn  —  Defendants argue that Trump pardons should absolve them of additional crimes, some discovered during investigations of the Capitol riot",
    "url": "https://www.wsj.com/us-news/law/jan-6-released-aftermath-7e8a57a4"
  },
  {
    "text": "In Moving to Stop Adams Case, Career Lawyer Sought to Stave Off Deeper Crisis  —  A high-stakes decision for public corruption prosecutors at the Justice Department revealed a generational difference.  —  The threat of a mass firing was unspoken but loomed over the videoconference call.",
    "url": "https://www.nytimes.com/2025/02/16/us/politics/justice-department-trump-eric-adams.html?unlocked_article_code=1.xU4.9Q_0.von4-SS0CHt9&smid=url-share"
  },
  {
    "text": "Birthright Citizenship: Barnett & Wurman's NY Times Essay and their Bates/Blackstone Double Backfire  —  Randy Barnett & Ilan Wurman had a guest essay in the N.Y. Times on Feb. 15th: “Trump Might Have a Case on Birthright Citizenship.”  The bottom line is that their essay backfires … ",
    "url": "https://shugerblogcom.wordpress.com/2025/02/16/birthright-citizenship-barnett-wurmans-ny-times-essay-and-their-bates-backfire/"
  },
  {
    "text": "Netanyahu says Israel working closely with US on Trump's plan for Gaza  —  Israeli PM and US secretary of state express joint support for ‘bold vision’ that would force 2 million people to leave  —  Benjamin Netanyahu has said his government is working closely with the US to implement Donald Trump's plan … ",
    "url": "https://www.theguardian.com/world/2025/feb/16/israel-netanyahu-trump-plan-gaza"
  },
  {
    "text": "Transportation Department workers with ‘exceptional’ reviews told they're fired for ‘performance’ issues  —  President Donald Trump's administration has started the mass firing of workers who are new to the civil service or have recently switched jobs.  —  Letters went out to dozens … ",
    "url": "https://www.nbcnews.com/politics/doge/federal-workers-exceptional-reviews-fired-performance-issues-rcna192347"
  }
]