[
  {
    "text": "Justice Department Told Trump in May That His Name Is Among Many in the Epstein Files  —  Bondi also told president at the meeting that Justice decided to not release more Jeffrey Epstein documents because of the presence of child pornography and the need to protect victims",
    "url": "https://www.wsj.com/politics/justice-department-told-trump-name-in-epstein-files-727a8038?st=zBt3ap&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Attorney General Told Trump His Name Appeared in Epstein Files  —  It was not clear what those documents were, or in what context the president's name was raised.  —  Attorney General Pam Bondi informed President Trump in the spring that his name appeared in the Jeffrey Epstein files … ",
    "url": "https://www.nytimes.com/2025/07/23/us/politics/trump-epstein-files-named.html"
  },
  {
    "text": "Columbia Agrees to $200 Million Fine to Settle Fight With Trump  —  The White House had canceled more than $400 million in research funding to the university, saying it had failed to protect Jewish students from harassment.  —  Columbia University will pay a $200 million fine to settle allegations … ",
    "url": "https://www.nytimes.com/2025/07/23/nyregion/columbia-trump-funding-deal.html?unlocked_article_code=1.Y08.JLw9.j_kHu1zCP-Rq&smid=url-share"
  },
  {
    "text": "Columbia University to pay over $200 million to resolve Trump probes  —  Columbia University said on Wednesday it will pay over $200 million to the U.S. government in a settlement with President Donald Trump's administration to resolve federal probes and to have most of its suspended federal funding restored.",
    "url": "https://www.reuters.com/world/us/columbia-university-trump-administration-reach-deal-over-funding-washington-post-2025-07-23/"
  },
  {
    "text": "Trump administration reaches deal with Columbia University  —  The agreement will restore most of the $400 million in federal funding cuts related to allegations of antisemitism, protests and diversity policies  —  just now  —  Columbia University and the Trump administration have agreed … ",
    "url": "https://www.washingtonpost.com/education/2025/07/23/trump-columbia-university-agreement-federal-funding/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzUzMjQzMjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzU0NjI1NTk5LCJpYXQiOjE3NTMyNDMyMDAsImp0aSI6ImJlY2NjN2YwLWRmYmQtNGZkMy04ZTg1LTAxMTg5MWRiY2FlNSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9lZHVjYXRpb24vMjAyNS8wNy8yMy90cnVtcC1jb2x1bWJpYS11bml2ZXJzaXR5LWFncmVlbWVudC1mZWRlcmFsLWZ1bmRpbmcvIn0.IyuyNrlh_LhQgvZRUFsZWsrWBBrBDWS5lleuNbvnwk8&itid=gfta"
  },
  {
    "text": "House subcommittee votes to subpoena Justice Department for Epstein files  —  A House subcommittee on Wednesday voted to subpoena the Department of Justice for files in the sex trafficking investigation into Jeffrey Epstein after Democrats successfully goaded GOP lawmakers to defy President Donald Trump … ",
    "url": "https://apnews.com/article/epstein-files-congress-democrats-subpoena-republicans-trump-5d17ea83f7ffeff5784159848b97f38e"
  },
  {
    "text": "House Oversight subcommittee votes to subpoena DOJ for Epstein files  —  A House Oversight subcommittee voted Wednesday to subpoena the Department of Justice to release files related to Jeffrey Epstein.  House Oversight Chair James Comer will be required to sign the subpoena before it can officially … ",
    "url": "https://cnn.com/2025/07/23/politics/house-epstein-files-subpoena"
  },
  {
    "text": "House Panel Votes to Subpoena Justice Dept. for Epstein Files  —  Three Republicans joined with five Democrats to support the motion.  —  A key House subcommittee on Wednesday voted to subpoena the Justice Department for its files regarding the investigation into the accused sex trafficker Jeffrey Epstein … ",
    "url": "https://www.nytimes.com/2025/07/23/us/politics/house-subpoena-justice-dept-epstein-files.html"
  },
  {
    "text": "Appeals court finds Trump's effort to end birthright citizenship unconstitutional, upholds block  —  A federal appeals court ruled Wednesday that President Donald Trump's order seeking to end birthright citizenship is unconstitutional, affirming a lower-court decision that blocked its enforcement nationwide.",
    "url": "https://apnews.com/article/immigration-birthright-citizenship-16658c712cf6a3141f168c7557c0628d"
  },
  {
    "text": "Scoop: Cooper plans to enter North Carolina Senate race next week  —  Former North Carolina Gov. Roy Cooper (D) is preparing to launch his Senate campaign next week, multiple sources told Axios. … - Cooper, a popular former governor, will instantly become the Democratic favorite to challenge … ",
    "url": "https://www.axios.com/2025/07/23/roy-cooper-run-north-carolina-senate-democrat"
  },
  {
    "text": "Trump's top federal prosecutor in L.A. struggles to secure indictments in protest cases  —  To bystanders at the federal courthouse in downtown Los Angeles, it sounded as though U.S. Atty. Bill Essayli would not take no for an answer.  —  A prosecutor had the irate Trump administration appointee … ",
    "url": "https://www.latimes.com/california/story/2025-07-23/protester-charges-essayli"
  },
  {
    "text": "Judge Denies Request to Unseal Epstein Grand Jury Transcripts in Florida  —  The president and his subordinates, including Attorney General Pam Bondi, have come under enormous pressure to release further details about the disgraced financier Jeffrey Epstein.",
    "url": "https://www.nytimes.com/2025/07/23/us/politics/florida-epstein-transcripts-unsealed-denied.html?unlocked_article_code=1.Yk8.Il_R.ZiBOWbFkq-sD&smid=url-share"
  },
  {
    "text": "Supreme Court allows Trump to remove 3 Democrats on the Consumer Product Safety Commission  —  The Supreme Court on Wednesday allowed the Trump administration to remove three Democratic members of the Consumer Product Safety Commission, who had been fired by President Donald Trump and then reinstated by a federal judge.",
    "url": "https://apnews.com/article/supreme-court-trump-consumer-product-safety-f0ed5ff2409287440f5067d64031429d"
  },
  {
    "text": "Hegseth Signal messages came from email classified ‘SECRET,’ watchdog told  —  The revelation contradicts the Trump administration's longstanding claims that no classified information was shared by the defense secretary's account during the “Signalgate” scandal.",
    "url": "https://www.washingtonpost.com/national-security/2025/07/23/hegseth-signalgate-classified-secret/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzUzMjQzMjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzU0NjI1NTk5LCJpYXQiOjE3NTMyNDMyMDAsImp0aSI6IjJhNTM1Yjc2LThkNjAtNDJiZS04YjIxLTY0ZGVlMmQxNjU2NSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb25hbC1zZWN1cml0eS8yMDI1LzA3LzIzL2hlZ3NldGgtc2lnbmFsZ2F0ZS1jbGFzc2lmaWVkLXNlY3JldC8ifQ.0ZfVmHOagV4Sqob7oYKs_hKt-ZMnzh36CPqRqAZKRsw&itid=gfta"
  },
  {
    "text": "Shapiro rebukes Mamdani for failing to condemn ‘blatantly antisemitic’ extremists  —    LEWISTOWN, Pa. — Inside a coffee shop in this small town of 8,500 people, hundreds of miles from the bustle of Manhattan, Pennsylvania Gov. Josh Shapiro made his first public comments about Zohran Mamdani … ",
    "url": "https://jewishinsider.com/2025/07/josh-shapiro-slams-zohran-mamdani-anitsemitism-pennsylvania-governor-new-york-city-mayor/"
  },
  {
    "text": "11 tips for becoming a columnist  —  Here's my advice for handling the awesome responsibility of this job.  —  So you wanna be a columnist, eh?  —  Young aspiring journalists and wizened elders often ask how I scored this sweet gig.  Truth is, I don't entirely know.",
    "url": "https://www.washingtonpost.com/opinions/2025/07/23/column-writing-tips-media-rampell/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzUzMjQzMjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzU0NjI1NTk5LCJpYXQiOjE3NTMyNDMyMDAsImp0aSI6IjJkYmE5YzZlLTU2ODYtNDA0MC1hNWVhLWUyNTNiZWNhNzUxOCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9vcGluaW9ucy8yMDI1LzA3LzIzL2NvbHVtbi13cml0aW5nLXRpcHMtbWVkaWEtcmFtcGVsbC8ifQ.C88W8dHAI87bOPznxlVjf9BBaWcbQ32qNVp5x9YzRrA&itid=gfta"
  },
  {
    "text": "Winooski Superintendent Detained, Questioned by Border Officials  —  Superintendent Wilmer Chavarria, a U.S. citizen, was questioned for hours at a Houston airport as he returned from a visit to Nicaragua with his husband.  —  Winooski schools superintendent Wilmer Chavarria was detained … ",
    "url": "https://m.sevendaysvt.com/news/winooski-superintendent-detained-questioned-by-border-officials-44054967"
  },
  {
    "text": "A D.O.J. Whistleblower Speaks Out  —  In a complaint, a former Justice Department lawyer said his former colleagues were being forced to choose between the president's agenda and their ethical obligations as attorneys.  —  This transcript was created using speech recognition software.",
    "url": "https://www.nytimes.com/2025/07/23/podcasts/the-daily/a-doj-whistleblower-speaks-out.html?unlocked_article_code=1.Yk8.xeuA.LlViZgrPUMga&smid=url-share"
  },
  {
    "text": "Trump's ‘massive’ deal with Japan is giving US automakers heartburn … “American Automakers still need to review the details of the U.S.-Japan agreement, but any deal that charges a lower tariff for Japanese imports with virtually no U.S. content than it does North American-built vehicles … ",
    "url": "https://www.politico.com/news/2025/07/23/trumps-massive-deal-with-japan-is-giving-u-s-automakers-heartburn-00473313"
  },
  {
    "text": "Columbia's Administrators Are Fooling Themselves  —  In 1672, Charles II unilaterally suspended repayment of 1.2 million pounds to London's private bankers.  Having run up this debt, and unable to finance a flotilla of ships to fight the Dutch, Charles became neither the first nor the last absolute monarch to break his word.",
    "url": "https://www.nytimes.com/2025/07/23/opinion/trump-columbia-deal-professor.html"
  },
  {
    "text": "Judge orders Kilmar Abrego Garcia released from criminal custody … The decisions from U.S. District Judge Waverly Crenshaw Jr. in Tennessee and U.S. District Judge Paula Xinis in Maryland — issued in tandem on Wednesday — are a climactic moment in Abrego's four-month saga … ",
    "url": "https://www.politico.com/news/2025/07/23/kilmar-abrego-garcia-ruling-00471663"
  },
  {
    "text": "Gaza is starving.  Where are the American Jewish leaders?  —  Privately, Jewish lay leaders are anguished over Gaza.  Publicly, they fear being labelled antisemitic  —  A few days after a Lebanese Christian militia, under the permissive watch of the Israeli army, slaughtered thousands … ",
    "url": "https://forward.com/opinion/757549/american-jewish-leadership-gaza-starvation/"
  },
  {
    "text": "Aid Groups Blame Israel's Gaza Restrictions for ‘Mass Starvation’  —  More than 100 organizations, including Save the Children and Doctors Without Borders, added to growing calls for aid restrictions to be eased and the war to end.  —  More than 100 aid agencies and rights groups … ",
    "url": "https://www.nytimes.com/2025/07/23/world/middleeast/aid-groups-gaza-starvation.html?unlocked_article_code=1.Yk8.nSwx.hTV5iu8jLr4c&smid=url-share"
  },
  {
    "text": "Angus King Says He Voted to Confirm Josh Divine Because Josh Hawley Asked Nicely  —  On Tuesday, the Republican-controlled Senate narrowly voted to confirm Josh Divine and Cristian Stevens to a pair of district court vacancies in Missouri.  Divine, a 35-year-old anti-choice activist … ",
    "url": "https://ballsandstrikes.org/nominations/angus-king-josh-divine-josh-hawley-confirmation/"
  },
  {
    "text": "Skydance Tells FCC It Will Create CBS News Ombudsman, Eliminate DEI at Paramount  —  The company said it would commit to a “comprehensive review” post-transaction. … Skydance has told the Federal Communications Commission that once its acquisition of Paramount Global is complete … ",
    "url": "https://www.hollywoodreporter.com/business/business-news/skydance-paramount-fcc-cbs-news-ombudsman-media-bias-1236326955/"
  }
]