[
  {
    "text": "Kamala Harris Wipes Out Trump's Swing-State Lead in Election Dead Heat  —  The vice president is polling better than Biden was before he dropped out, according to the latest Bloomberg News/Morning Consult survey.  —  Kamala Harris has wiped out Donald Trump's lead across seven battleground states … ",
    "url": "https://www.bloomberg.com/news/features/2024-07-30/kamala-harris-erases-trump-s-swing-state-lead-in-2024-election-poll"
  },
  {
    "text": "Harris to hold first rally with running mate Tuesday in Philadelphia  —  The vice president is expected to announce her pick sometime before the appearance.  —  Vice President Kamala Harris is expected to announce her running mate by Tuesday, when she will hold her first rally with her pick in Philadelphia.",
    "url": "https://www.politico.com/news/2024/07/30/harris-first-rally-running-mate-tuesday-philadelphia-00171999"
  },
  {
    "text": "Harris takes 4-point lead in Pennsylvania; Casey up 5 on McCormick: poll  —  Video Player is loading.  —  Play Video  —  Unmute  —  Current Time 0:00 … Stream Type LIVE  —  Seek to live, currently behind liveLIVE  —  Playback Rate  —  Chapters  — Chapters  —  Descriptions",
    "url": "https://thehill.com/homenews/campaign/4800420-harris-lead-pennsylvania-casey-mccormick-poll/"
  },
  {
    "text": "Harris campaign unveils ad hitting Trump back over the border  —  Vice President Harris's campaign on Tuesday unveiled a new campaign video that attacks former President Trump over the U.S.-southern border in response to a Trump ad targeting Harris on the issue.",
    "url": "https://thehill.com/homenews/4801766-kamala-harris-donald-trump-border/"
  },
  {
    "text": "Harris dares Trump to debate her as she campaigns in Atlanta: “Say it to my face”  —  Vice President Kamala Harris taunted former President Donald Trump to meet her on a debate stage before the November election while she campaigned in Atlanta on Tuesday night.",
    "url": "https://www.cbsnews.com/news/kamala-harris-rally-atlanta-megan-thee-stallion/"
  },
  {
    "text": "Harris to hold rally with VP pick in Philadelphia on Tuesday, sources say  —  U.S. Vice President Kamala Harris is planning to hold a rally with her yet-to-be-named vice presidential choice on Tuesday in Philadelphia, according to two sources familiar with the planning.",
    "url": "https://www.reuters.com/world/us/harris-hold-rally-with-vp-pick-philadelphia-tuesday-sources-say-2024-07-31/"
  },
  {
    "text": "Read J.D. Vance's Violent Foreword to Project 2025 Leader's New Book … Donald Trump has been desperate lately to distance himself from Project 2025, the Heritage Foundation's radical plan to remake the federal government under his presidency.  “I have no idea who is behind it,” … ",
    "url": "https://newrepublic.com/article/184393/jd-vance-violent-foreword-kevin-roberts-project-2025-leader-book"
  },
  {
    "text": "Project 2025 to end policy work after Democratic attacks angered Trump  —  The Trump campaign grew furious with the Heritage Foundation over press coverage tying the candidate to unpopular policy proposals  —  The right-wing policy operation that became a rallying cry for Democrats … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/30/project-2025-director-paul-dans-leaves-heritage-foundation/"
  },
  {
    "text": "Project 2025 director leaves Heritage Foundation after Democratic attacks and Trump criticism  —  The director of the Heritage Foundation's Project 2025 vision for a complete overhaul of the federal government stepped down Tuesday after facing pressure from Donald Trump's campaign … ",
    "url": "https://apnews.com/article/project-2025-heritage-foundation-trump-e2674ea34da786d85e97c0908b0b98a8"
  },
  {
    "text": "Trump pressed for answers after saying supporters 'won't have to vote' again  —  What did Donald Trump mean when he told supporters they “won't have to vote anymore” if he wins?  The Republican's latest explanation was hardly reassuring.  —  Given Donald Trump's apparent discomfort … ",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trump-pressed-answers-saying-supporters-wont-vote-rcna164264"
  },
  {
    "text": "I didn't vote for Tim Walz originally.  Now I'm completely Walz-pilled.  —  Minnesota Gov. Tim Walz is on the short list for Kamala Harris' running mate, and he's been a lot better for my home state than I had hoped.  —  Minnesota Gov. Tim Walz thinks the leaders of the modern Republican Party … ",
    "url": "https://www.msnbc.com/opinion/msnbc-opinion/tim-walz-kamala-harris-vp-pick-minnesota-rcna164157"
  },
  {
    "text": "Kari Lake Wins Senate Primary to Face Ruben Gallego in November  —  The Republican firebrand and fierce Trump ally prevailed over Mark Lamb, while Representative Ruben Gallego was unopposed in the Democratic primary.  —  Kari Lake won the Republican primary for U.S. Senate in Arizona on Tuesday … ",
    "url": "https://www.nytimes.com/2024/07/30/us/politics/kari-lake-ruben-gallego.html"
  },
  {
    "text": "Kari Lake wins Arizona GOP Senate primary, setting up a key race against Democrat Ruben Gallego  —  NBC News projects Lake defeated two opponents to secure the Republican Senate nomination.  Gallego ran unopposed in the Democratic primary.  —  PHOENIX — Kari Lake won the Republican Senate primary … ",
    "url": "https://www.nbcnews.com/politics/2024-election/kari-lake-wins-arizona-gop-senate-primary-ruben-gallego-rcna164043"
  },
  {
    "text": "Norah O'Donnell to leave “CBS Evening News” anchor desk after 2024 election for new role at network  —  “CBS Evening News” anchor and managing editor Norah O'Donnell has announced that she will leave her role at the anchor desk after the 2024 election and take on a new position at the network.",
    "url": "https://www.cbsnews.com/news/norah-odonnell-to-leave-cbs-evening-news-anchor-desk-new-role-at-network/"
  },
  {
    "text": "‘White Dudes for Harris’ X Suspension Sparks Fury: ‘Election Interference’  —  A social-media account for white male supporters of  —  was briefly suspended from X, formerly  —  , sparking anger online.  —  Newsweek observed that the White Dudes for Harris X account had been temporarily suspended … ",
    "url": "https://www.newsweek.com/white-dudes-harris-x-suspension-1931827"
  },
  {
    "text": "Murkowski slams Vance's ‘childless cat lady’ comments as ‘offensive’ to women  —  Sen. Lisa Murkowski (R-Alaska) hit her party's own vice presidential nominee, Sen. JD Vance (R-Ohio), for what she called “offensive” comments about “childless cat ladies.”  “If the Republican Party is trying … ",
    "url": "https://www.politico.com/live-updates/2024/07/30/congress/murkowski-critical-vance-cat-lady-trump-republicans-senate-00171864"
  },
  {
    "text": "Iran says Hamas leader Ismail Haniyeh was assassinated in Tehran  —  Hamas leader Ismail Haniyeh was assassinated in Tehran, Iran's paramilitary Revolutionary Guard said early Wednesday.  No one immediately claimed responsibility for the assassination but suspicion immediately fell on Israel … ",
    "url": "https://apnews.com/article/iran-hamas-israel-30968a7acb31cd8b259de9650014b779"
  },
  {
    "text": "The last thing JD Vance probably wants to be associated with right now is a couch.  But for some reason, he's still talking about it.  — Sen. JD Vance's 2024 campaign has been dogged by viral jokes that he once had sex with a couch.  — To be clear, he did not write about having intercourse with a couch in “Hillbilly Elegy.”",
    "url": "https://www.businessinsider.com/jd-vance-couch-mention-nevada-rally-joke-viral-tweet-vp-2024-7"
  },
  {
    "text": "Biden to open first night of Democratic convention, sources say  —  The first night of the Democratic National Convention, now less than three weeks away, is expected to feature a keynote speaker previously slated to close the program: President Joe Biden.  —  Biden is expected to deliver … ",
    "url": "https://www.cnn.com/2024/07/30/politics/biden-democratic-national-convention-opening-night/"
  },
  {
    "text": "Democracy Will Suffer a Relatively Quiet Death.  We Simulated It.  —  PICTURE THIS: It's March 2025, and Donald Trump is back in the White House.  Despite the burst of euphoria that followed Joe Biden's withdrawal from the presidential race, Trump managed to eke out a narrow Electoral College victory.",
    "url": "https://www.thebulwark.com/p/democracy-suffer-quiet-death-simulated-trump"
  },
  {
    "text": "‘Wild west of election work’: How certification fights are already cropping up in battleground states  —  Georgia conservative Julie Adams spread conspiracies about election workers, concocted a baseless story about ballot couriers drinking beer and doing drugs while hoarding ballots … ",
    "url": "https://www.cnn.com/2024/07/30/politics/certification-fights-battle-ground-states/"
  }
]