[
  {
    "text": "Pete Hegseth's drinking worried colleagues at Fox News, sources tell NBC News  —  Ten current and former Fox employees say Trump's pick for defense secretary drank in ways that concerned his co-workers.  A Trump transition team spokesperson called the claims “completely unfounded and false.”",
    "url": "https://www.nbcnews.com/politics/national-security/pete-hegseths-drinking-worried-colleagues-fox-news-sources-tell-nbc-ne-rcna181471"
  },
  {
    "text": "Trump Mulls Replacing Pete Hegseth With Florida Gov. Ron DeSantis  —  The president-elect is discussing replacing the current Pentagon nominee as the former Fox News host faces mounting scrutiny over allegations about his personal life  —  President-elect Donald Trump is considering Florida … ",
    "url": "https://www.wsj.com/politics/elections/trump-mulls-replacing-pete-hegseth-with-florida-gov-ron-desantis-8f682ad2?st=nvDros&reflink=article_copyURL_share"
  },
  {
    "text": "Trump's pick for defense secretary, Pete Hegseth, is in peril in the Senate  —  As many as six GOP senators are not currently comfortable supporting Hegseth, following allegations concerning drinking and his treatment of women, sources told NBC News.  —  WASHINGTON — President-elect Donald Trump's pick … ",
    "url": "https://www.nbcnews.com/politics/congress/trumps-pick-defense-secretary-pete-hegseth-peril-senate-republicans-rcna182738"
  },
  {
    "text": "Trump Talks to DeSantis About Replacing Hegseth  —  And about appointing Lara Trump to the Senate.  —  DONALD TRUMP AND RON DESANTIS have personally discussed the possibility of the Florida governor becoming the next secretary of defense amid concerns that sexual assault allegations … ",
    "url": "https://www.thebulwark.com/p/trump-talks-to-desantis-about-replacing-hegseth-secretary-defense-florida"
  },
  {
    "text": "Charlamagne tha God tells Democrats to get off ‘moral high ground’ amid Biden pardon  —  Radio host Charlamagne tha God contended President Joe Biden and Democrats need to “stop acting” as though they are the political party of the “moral high ground” in the wake of the president pardoning his son.",
    "url": "https://www.washingtonexaminer.com/news/3247021/charlamagne-tha-god-tells-democrats-get-off-moral-high-ground-amid-biden-pardon/"
  },
  {
    "text": "Then, Now, and Forever: The People Are the Problem  —  The Hunter Biden Pardon Discourse and our infantilization of voters.  —  ∙ Paid  —  1. Children of God  —  The Hunter Biden Pardon Discourse is a perfect distillation of our dominant political asymmetry.",
    "url": "https://www.thebulwark.com/p/then-now-and-forever-the-people-are"
  },
  {
    "text": "The new question ballot-measure pollsters have to ask  —  DRIVING THE DAY — Our Chris Cadelago has an exclusive story out this afternoon on Gov. Gavin Newsom breaking from President Joe Biden over his decision to pardon his son, Hunter Biden: “I took the president at his word,” Newsom told Chris.",
    "url": "https://www.politico.com/newsletters/california-playbook-pm/2024/12/03/the-new-question-ballot-measure-pollsters-have-to-ask-00192461"
  },
  {
    "text": "Kash Patel, Trump's pick to lead FBI, has been targeted in an Iranian hack, sources say  —  Kash Patel, President-elect Donald Trump's pick to run the FBI, was recently informed by the bureau that he had been targeted as part of an Iranian hack, two sources familiar with the matter told CNN.",
    "url": "https://www.cnn.com/2024/12/03/politics/kash-patel-targeted-iran-hack"
  },
  {
    "text": "The Storybook Start—and Bitter End—of Pete Hegseth's First Marriage  —  Donald Trump's nominee for secretary of defense is a conservative culture warrior, a central-casting alpha male who believes in guns, God, and the primacy of the family unit.  The story of his first marriage … ",
    "url": "https://www.vanityfair.com/news/story/pete-hegseth-first-marriage"
  },
  {
    "text": "South Korea's Warning for Washington  —  Even botched plots to seize power damage democratic institutions and norms.  —  A right-wing wannabe authoritarian president—a leader who attacks the press, is accused of abusing power for personal gain, uses his power to block investigations … ",
    "url": "https://www.theatlantic.com/international/archive/2024/12/south-korea-martial-law/680864/?gift=5Jt_OsUNCrDLh-WaaPKh0XzGHZ_IyMOkNIRUpZb0LN8&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "McConnell cries foul after 2 Democratic judges cancel retirement after Trump victory  —  Senate Minority Leader Mitch McConnell (R-Ky.) vented his displeasure Monday after two Democratic-appointed federal judges reversed their decisions to retire in what appear to be efforts to stop President-elect Trump … ",
    "url": "https://thehill.com/homenews/senate/5019863-mcconnell-criticizes-judges-retirement/"
  },
  {
    "text": "Here Are the Republicans Kash Patel Wants to Target  —  Trump's pick to be FBI director has expressed an intent to mount a revenge-a-thon that will include not just Democrats.  —  For years, Kash Patel, the MAGA provocateur, conspiracy theory monger, and seller of pills he claims reverse … ",
    "url": "https://www.motherjones.com/politics/2024/12/here-are-the-republicans-kash-patel-wants-to-target/"
  },
  {
    "text": "California Democrat Flips Seat in the Last House Race to Be Called  —  Adam Gray, a former state lawmaker, defeated Representative John Duarte, a Republican, in a reversal of their 2022 race.  —  A Democratic former state lawmaker defeated the Republican incumbent on Tuesday to flip a seat … ",
    "url": "https://www.nytimes.com/2024/12/04/us/politics/california-house-gray-duarte.html?unlocked_article_code=1.e04.JQ0z.Ecx9hmZtLcbs&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "‘Gut punch’: Trump upsets local union leaders by opposing U.S. Steel-Nippon deal  —  On Monday night, President-elect Donald Trump reiterated his opposition to the proposed $14.9 billion sale of U.S. Steel to Japan's Nippon Steel Co., vowing to block the deal when he takes office.",
    "url": "https://triblive.com/news/politics-election/gut-punch-trump-upsets-local-union-leaders-by-opposing-us-steel-nippon-deal/"
  },
  {
    "text": "You Won't Believe Who Was Crowned ‘Model of the Year’  —  In October, Townhall covered how Victoria's Secret held its iconic fashion show for the first time in six years.  —  The lingerie company shocked the world by including two models who are “transgender,” also known as biological males.",
    "url": "https://townhall.com/tipsheet/madelineleesman/2024/12/03/you-wont-believe-who-was-crowned-model-of-the-year-n2648555"
  },
  {
    "text": "House Democrat to force floor vote this week to release Matt Gaetz ethics report  —  Rep. Sean Casten introduced a privileged resolution that would require the House Ethics Committee to make its investigative report into the former Florida congressman public.",
    "url": "https://www.nbcnews.com/politics/congress/house-democrat-force-floor-vote-week-release-matt-gaetz-ethics-report-rcna182710"
  },
  {
    "text": "Trump's DEA nominee withdraws from consideration just days after being picked  —  President-elect Trump's choice to lead the Drug Enforcement Administration (DEA) announced on Tuesday he is withdrawing from consideration just three days after Trump made his nomination known.",
    "url": "https://thehill.com/homenews/administration/5020659-trump-dea-nominee-withdraw/"
  },
  {
    "text": "Pardon Fallout: A Visibly Shaken Chuck Todd Turns on Joe and Jill Biden in Must-Watch Moment  —  Though many in the mainstream media are in full-blown Democrat apologist mode (more so than normal) in the aftermath of Joe Biden's “full and unconditional” pardoning of his son, convicted felon Hunter Biden … ",
    "url": "https://redstate.com/sister-toldjah/2024/12/03/pardon-fallout-a-visibly-angry-chuck-todd-turns-on-the-biden-family-in-must-watch-moment-n2182748"
  },
  {
    "text": "Black Republicans feel left out of Trump's 2nd-term picks  —  Besides HUD secretary, the president-elect has picked no Blacks for his Cabinet.  —  In this Oct. 29, 2024 file photo, President-elect Donald Trump attends a campaign event, in Allentown, Pa.  —  As President-elect Donald Trump fills … ",
    "url": "https://abcnews.go.com/Politics/black-republicans-feel-left-trumps-term-picks/story?id=116205418"
  },
  {
    "text": "Judge Orders Fani Willis to Release All Communications with Jack Smith and J6 Committee  —  A judge ordered Fulton County District Attorney Fani Willis to release all communications with Jack Smith and the House January 6 Committee.  —  Earlier this year conservative watchdog group Judicial Watch asked … ",
    "url": "https://www.thegatewaypundit.com/2024/12/judge-orders-fani-willis-release-all-communications-jack/"
  },
  {
    "text": "Ontario Man Arrested on Complaint Alleging He Exported Shipments of Firearms, Ammunition and Other Military Items to North Korea  —  For Immediate Release  —  U.S. Attorney's Office, Central District of California  —  LOS ANGELES - A San Bernardino County man was arrested today … ",
    "url": "https://www.justice.gov/usao-cdca/pr/ontario-man-arrested-complaint-alleging-he-exported-shipments-firearms-ammunition-and"
  },
  {
    "text": "Senate Republicans Aim to Tackle Border First, Taxes Later  —  Incoming majority leader John Thune lays out a two-step process for passing Trump's agenda  —  WASHINGTON—Senate Republicans are considering quick legislation early next year to strengthen border security … ",
    "url": "https://www.wsj.com/politics/senate-republicans-aim-to-tackle-border-first-taxes-later-98026ef8?st=U6MTKW&reflink=desktopwebshare_perm"
  },
  {
    "text": "Ninth Circuit rules in favor of federal deportation  —  (The Center Square) - The federal government has the authority to deport foreign nationals in the U.S. illegally over the objection of local authorities, a panel of three judges on the Ninth Circuit Court of Appeals unanimously ruled.",
    "url": "https://www.thecentersquare.com/washington/article_85a7d08e-b11c-11ef-8e28-3f9a1e87c49b.html"
  },
  {
    "text": "Stunning chart shows ‘mindblowing’ rise in manufacturing under Biden — that Trump gets to ‘ribbon cut’  —  During the 2024 presidential race, Donald Trump relentlessly attacked President Joe Biden and Vice President Kamala Harris on the economy — blaming both of them for post-pandemic inflation in the United States.",
    "url": "https://www.alternet.org/biden-manufacturing-armlovich/"
  }
]