[
  {
    "text": "On the Campaign Trail, Elon Musk Juggled Drugs and Family Drama  —  As Mr. Musk entered President Trump's orbit, his private life grew increasingly tumultuous and his drug use was more intense than previously known.  —  As Elon Musk became one of Donald J. Trump's closest allies last year … ",
    "url": "https://www.nytimes.com/2025/05/30/us/elon-musk-drugs-children-trump.html?unlocked_article_code=1.LE8.YA7T.1z0vkogrzeCV&smid=url-share"
  },
  {
    "text": "Supreme Court Allows Trump Administration, for Now, to End Biden-Era Migrant Program  —  The Trump administration had asked the court to allow it to end deportation protections for more than 500,000 people facing dire humanitarian crises in their home countries.",
    "url": "https://www.nytimes.com/2025/05/30/us/politics/trump-immigration-supreme-court.html"
  },
  {
    "text": "Trump Taps Palantir to Compile Data on Americans … Alex Karp, a co-founder and the chief executive of Palantir, at a forum in Washington in April.  The Trump administration has expanded Palantir's work across the federal government.Caroline Gutman for The New York Times",
    "url": "https://www.nytimes.com/2025/05/30/technology/trump-palantir-data-americans.html?unlocked_article_code=1.LE8.jmh8.yvBmMb_-hjDt&smid=url-share"
  },
  {
    "text": "Contradicting RFK Jr., CDC keeps recommending covid vaccine for kids  —  Earlier this week, the Health and Human Services secretary said that healthy children did not need to get vaccinated for coronavirus.  —  Coronavirus vaccines are still recommended for healthy children if their doctors approve … ",
    "url": "https://www.washingtonpost.com/health/2025/05/30/covid-vaccines-children-pregnant-women/"
  },
  {
    "text": "CDC Issues New Advice on Covid Vaccines for Children That Contradicted RFK Jr.  —  Health Secretary Robert F. Kennedy Jr. said on Tuesday that the vaccine would no longer appear on the childhood immunization schedule.  C.D.C.'s update counters his policy.  —  Days after Health Secretary … ",
    "url": "https://www.nytimes.com/2025/05/30/health/cdc-covid-vaccines-children-pregnant-women.html"
  },
  {
    "text": "Defending Medicaid Cuts, Ernst Tells Iowans, ‘We All Are Going to Die’  —  Senator Joni Ernst's flip response in an exchange with constituents about the effects of Trump's domestic policy bill spread quickly online.  —  Senator Joni Ernst, Republican of Iowa, had a gloomy message for constituents … ",
    "url": "https://www.nytimes.com/2025/05/30/us/politics/medicaid-cuts-joni-ernst-iowa-town-hall.html"
  },
  {
    "text": "Trump's Angry New Tirade Over Tariff Ruling Accidentally Says Too Much  —  President Donald Trump's angry, unhinged rant on Truth Social over this week's judicial ruling against his tariffs is getting attention for its fury at Leonard Leo, the mastermind of the conservative takeover of the courts.",
    "url": "https://newrepublic.com/article/195931/trump-angry-tirade-tariff-ruling"
  },
  {
    "text": "Trump fires director of the National Portrait Gallery  —  It was unclear if Trump can dismiss Smithsonian leaders.  The termination of Kim Sajet marks the president's first action against an institution he has vowed to purge of “anti-American ideology.”",
    "url": "https://www.washingtonpost.com/entertainment/art/2025/05/30/trump-portrait-gallery-director/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ4NTc3NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ5OTU5OTk5LCJpYXQiOjE3NDg1Nzc2MDAsImp0aSI6IjlhY2M0YmY3LWU0NWMtNDc3Yi1iYWNiLTlhMWEzY2NlNTFjZCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9lbnRlcnRhaW5tZW50L2FydC8yMDI1LzA1LzMwL3RydW1wLXBvcnRyYWl0LWdhbGxlcnktZGlyZWN0b3IvIn0.JMNXcOKfpJPI6uL_EtSH2ZQHmJQJX189dqyYYepvb00&itid=gfta"
  },
  {
    "text": "White House convenes meeting to brainstorm new Harvard measures  —  The push comes as the White House regroups after a federal judge blocked its move to bar Harvard from enrolling international students.  —  The Trump administration is escalating its campaign against Harvard University … ",
    "url": "https://www.politico.com/news/2025/05/30/white-house-convenes-meeting-to-brainstorm-new-harvard-measures-00376782"
  },
  {
    "text": "California opens inquiry into Paramount and Trump  —  The Scoop  —  The California State Senate has invited two former top CBS figures to testify in a new inquiry into whether the network's parent company has violated state laws against bribery and unfair competition.",
    "url": "https://www.semafor.com/article/05/30/2025/california-opens-inquiry-into-paramount-and-trump"
  },
  {
    "text": "Elon Musk's Legacy Is Disease, Starvation and Death  —  There is an Elon Musk post on X, his social media platform, that should define his legacy.  “We spent the weekend feeding USAID into the wood chipper,” he wrote on Feb. 3.  He could have “gone to some great parties.  Did that instead.”",
    "url": "https://www.nytimes.com/2025/05/30/opinion/elon-musk-doge-usaid.html?unlocked_article_code=1.LE8.M8Vw.raMdU_L48AEh&smid=bs-share"
  },
  {
    "text": "State begins rolling out expanded student visa vetting — starting with Harvard  —  The State Department issued instructions to consulates and embassies late Thursday telling them to start the vetting immediately.  —  The State Department has told U.S. consulates and embassies … ",
    "url": "https://www.politico.com/news/2025/05/30/state-implements-reviews-of-harvard-visa-applicants-social-media-accounts-00375921"
  },
  {
    "text": "Trump Administration Knew Vast Majority of Venezuelans Sent to Salvadoran Prison Had Not Been Convicted of U.S. Crimes  —  Homeland Security records reveal that officials knew that more than half of the 238 deportees were labeled as having no criminal record in the U.S. and had only violated immigration laws.",
    "url": "https://www.propublica.org/article/trump-el-salvador-deportees-criminal-convictions-cecot-venezuela"
  },
  {
    "text": "DOGE left United States Institute of Peace office with water damage, rats, and roaches  —  The chief executive of the United States Institute of Peace says Elon Musk's Department of Government Efficiency left the nonprofit's Washington, D.C. headquarters in disarray, full of water damage … ",
    "url": "https://techcrunch.com/2025/05/30/doge-left-united-states-institute-of-peace-office-with-water-damage-rats-and-roaches/"
  },
  {
    "text": "A court halted his deportation.  The Trump administration deported him 28 minutes later.  —  Officials blamed “administrative errors.”  It's the fourth known case of an improper deportation by the Trump administration.  —  The Trump administration has admitted that it improperly deported another immigrant … ",
    "url": "https://www.politico.com/news/2025/05/30/trump-administration-deports-fourth-immigrant-court-order-violation-00378173"
  },
  {
    "text": "Loretta Swit a.k.a. Hot Lips of TV's ‘M*A*S*H,’ Dies at 87  —  She won two Emmy Awards for her sympathetic portrayal of an Army major on the hit TV show and had a long career in TV and theater.  —  Loretta Swit, the Emmy-winning actress who made the high-strung and relentlessly militaristic … ",
    "url": "https://www.nytimes.com/2025/05/30/obituaries/loretta-swit-dead.html"
  },
  {
    "text": "USDA Employee and Others Charged in $66 Million SNAP Fraud Scheme  —  A U.S. Department of Agriculture (USDA) worker and five other individuals are accused in a massive food stamp fraud scheme.  —  The suspects in the case were identified as Michael Kehoe, Mohamad Nawafleh, Omar Alrawashdeh … ",
    "url": "https://www.breitbart.com/crime/2025/05/30/usda-employee-others-charged-66-million-snap-fraud-scheme/"
  },
  {
    "text": "STAT+: New HHS document details deep NIH cuts as part of Trump budget request  —  The Department of Health and Human Services on Friday released a summary of President Trump's budget request for the 2026 fiscal year that provides the most detailed look yet at how his administration hopes … ",
    "url": "https://www.statnews.com/2025/05/30/nih-cuts-new-details-18-billion-budget-reduction-outlined-in-congressional-budget-justification/"
  },
  {
    "text": "Biden whines that politics are ‘so divided,’ rips cutting vets' benefits in first speech since cancer diagnosis  —  Former President Joe Biden joked Friday that he was “mentally incompetent” and said his metastatic prostate cancer's “prognosis is good” in his first public appearance since … ",
    "url": "https://nypost.com/2025/05/30/us-news/biden-says-politics-are-so-divided-in-first-speech-since-cancer-diagnosis/"
  },
  {
    "text": "Jake Tapper Tapped Out: Anti-Biden Book First Week Sales A Bust After Non Stop CNN Shilling  —  Jake Tapper has been yapping about Joe Biden for two solid weeks.  —  CNN has allowed him to excoriate Biden 24/7, carrying on incessantly with few quoted sources that Biden was incompetent during his presidency.",
    "url": "https://www.showbiz411.com/2025/05/29/jake-tapper-tapped-out-anti-biden-book-first-week-sales-a-bust-after-non-stop-cnn-shilling"
  },
  {
    "text": "PBS sues Trump over executive order targeting federal funding, following NPR  —  The public broadcaster says a May 1 executive order violated its First Amendment rights.  —  PBS sued the Trump administration on Friday, nearly one month after the president issued an executive order targeting its federal funding.",
    "url": "https://www.washingtonpost.com/style/media/2025/05/30/pbs-sues-trump-cpb-npr/"
  },
  {
    "text": "Trump Says He Will Consider Pardoning Diddy  —  BEG YOUR PARDON!  —  The president knows the shamed rap mogul and wants to know the facts of the case.  —  Donald Trump refused to dismiss the possibility of a pardon for Sean “Diddy” Combs, even though the rap tycoon is currently on trial on sex trafficking and other serious charges.",
    "url": "https://www.thedailybeast.com/trump-says-he-will-consider-pardoning-diddy/"
  },
  {
    "text": "Trump picks right-wing lawyer and podcaster who promoted 2020 election lies as watchdog agency head  —  President Donald Trump's pick to lead a federal watchdog agency is a former right-wing podcast host who has praised criminally charged influencer Andrew Tate as a “extraordinary human being” … ",
    "url": "https://apnews.com/article/trump-office-of-special-counsel-paul-ingrassia-1812d6ac0e694402dc7c817dcc79291e"
  },
  {
    "text": "Why Are Republicans Planning to Tax University Endowments More Heavily Than Other Forms of Private Wealth?  —  There isn't a legitimate public purpose.  The intent is punitive and political.  —  A view of the Harvard University campus on May 24, 2025, in Cambridge, Massachusetts",
    "url": "https://prospect.org/education/2025-05-30-why-republicans-planning-to-tax-university-endowments/"
  },
  {
    "text": "Vance's Trump Force Two Campaign Plane Now Being Used for Deportation Flights  —  ICE AIR  —  A private jet known as “Trump Force Two” which was used to transport JD Vance during the election is now being used to deport migrants to Central America, records show.",
    "url": "https://www.thedailybeast.com/vances-trump-force-two-campaign-plane-now-being-used-for-deportation-flights/"
  },
  {
    "text": "Kristi Noem said an immigrant threatened to kill Trump.  The story quickly fell apart  —  A claim by Homeland Security Secretary Kristi Noem that an immigrant threatened the life of President Donald Trump has begun to unravel.  —  Noem announced an arrest of a 54-year-old man who was living … ",
    "url": "https://apnews.com/article/ice-letter-threatening-trump-21447adfd14eb1a043f95344f9ccb3d5"
  },
  {
    "text": "Campaign board fines Andrew Cuomo $675,000; awards rival Adrienne Adams millions  —  The multimillion-dollar cash infusion was essential for the City Council speaker's campaign.  —  NEW YORK — New York City mayoral candidate Adrienne Adams on Friday qualified for just over $2 million … ",
    "url": "https://www.politico.com/news/2025/05/30/andrew-cuomo-adrienne-adams-matching-funds-00376661"
  },
  {
    "text": "How ICE Is Seeking to Ramp Up Deportations Through Courthouse Arrests  —  Officials had largely steered clear of arrests at immigration courts out of concern that they would deter people from showing up for hearings.  —  A hearing on Tuesday at immigration court in Van Nuys, Calif. … ",
    "url": "https://www.nytimes.com/2025/05/30/us/politics/ice-courthouse-arrests.html"
  }
]