[
  {
    "text": "Trump attorney says Kavanaugh will ‘step up’ in ballot cases  —  An attorney for former President Trump, Alina Habba, said late Thursday that she has faith in the Supreme Court and believes that Justice Brett Kavanaugh will “step up” in Trump's ballot cases in Maine and Colorado.",
    "url": "https://thehill.com/homenews/campaign/4390774-trump-attorney-kavanaugh-will-step-up-ballot-cases/"
  },
  {
    "text": "'These people know what they're doing': Why Trump is attacking Haley in NH  —  What if it is closer than expected in the Granite state?  —  Donald Trump may be up by 20 percentage points in New Hampshire, but he and his team have moved swiftly to cut down any opponent they see rising.",
    "url": "https://www.politico.com/news/2024/01/05/trump-is-attacking-haley-in-nh-his-real-problem-is-the-expectations-game-00133929"
  },
  {
    "text": "Trump's China Scandal Is Way Worse Than What Biden Is Getting Impeached Over … House Democrats have produced a report showing that, during his presidency, Donald Trump accepted $7.8 million from foreign countries, most of which were from China.  This serves as another illustration … ",
    "url": "https://nymag.com/intelligencer/2024/01/biden-getting-impeached-for-less-than-trumps-china-scandal.html"
  },
  {
    "text": "James Comer searched for China link to Biden — but Oversight found Trump instead: reporter  —  The House Oversight and Reform Committee, under Rep. James Comer's (R-KY) leadership, has searched through the finances of President Joe Biden and the rest of his family looking for incriminating links to foreign entities.",
    "url": "https://www.rawstory.com/trump-foreign-money-2666871402/"
  },
  {
    "text": "The war in Gaza may widen.  The Biden admin is getting ready for it.  —  That could put President Joe Biden in the center of a messy Middle East conflict in the midst of a bruising re-election campaign.  —  Biden administration officials are drawing up plans for the U.S. to respond … ",
    "url": "https://www.politico.com/news/2024/01/04/war-gaza-widen-biden-getting-ready-00133949"
  },
  {
    "text": "What January 6 Made Clear to Me  —  Our democratic institutions are only as strong as the courage of those entrusted with their care.  —  The sixth of january is the date prescribed in United States law for Congress to count the electoral votes in the presidential election.",
    "url": "https://www.theatlantic.com/ideas/archive/2024/01/three-years-after-january-6-capitol-insurrection-trump/677024/"
  },
  {
    "text": "The White House's tense podium battle  —  They share a podium — and a mutual frustration.  White House press secretary Karine Jean-Pierre and the National Security Council's John Kirby frequently split the podium at media briefings, but behind the scenes their relationship is fraught with tension, White House sources tell Axios.",
    "url": "https://www.axios.com/2024/01/05/white-house-press-secretary-jean-pierre-kirby-tension"
  },
  {
    "text": "Florida ready to follow Ohio and secure abortion rights  —  A measure has reached the threshold to qualify for this year's ballot.  —  TALLAHASSEE, Florida — Florida abortion rights advocates, who have seen access to the procedure erode in the state and nationally in recent years … ",
    "url": "https://www.politico.com/news/2024/01/05/florida-abortion-rights-amendment-00133938"
  },
  {
    "text": "1/5/24 ☀️ Punchbowl News AM  —  We have two pieces of big news this morning on behind-the-scenes machinations related to border security talks and government funding. … Speaker Mike Johnson told House Republican freshmen on a private conference call Thursday that he may try … ",
    "url": "https://punchbowl.news/archive/1524-punchbowl-news-am/"
  },
  {
    "text": "Bill Ackman's celebrity academic wife Neri Oxman's dissertation is marred by plagiarism  — Harvard president Claudine Gay resigned after conservative activists revealed she had plagiarized.  — Hedge fund manager and prominent Harvard donor Bill Ackman helped lead the charge against Gay.",
    "url": "https://www.businessinsider.com/bill-ackman-wife-neri-oxman-mit-dissertation-plagiarism-2024-1"
  },
  {
    "text": "Court says even passive members of Jan. 6 mob can be convicted of disorderly conduct  —  The decision is a victory for the Justice Department on one of the most common charges lodged against Jan. 6 defendants.  —  A federal appeals court ruled Friday that Jan. 6 defendants can be found culpable of … ",
    "url": "https://www.politico.com/news/2024/01/05/court-says-even-passive-members-of-jan-6-mob-can-be-convicted-of-disorderly-conduct-00134030"
  },
  {
    "text": "Former Capitol Police officer outspoken about Jan. 6 launches run for Congress  —  Harry Dunn, who has testified extensively about the Jan. 6 riot, recently retired from the force and is running in Maryland's 3rd Congressional District.  —  WASHINGTON — Nearly three years ago to the day … ",
    "url": "https://www.nbcnews.com/politics/2024-election/former-capitol-police-officer-harry-dunn-jan-6-run-congress-rcna132110"
  },
  {
    "text": "17-year-old kills sixth grader, wounds five others in Iowa school shooting, police say  —  Police say multiple people have been shot at a high school in Iowa  —  17-year-old killed a sixth grader in Iowa school shooting, friends of suspect say he was bullied",
    "url": "https://apnews.com/article/perry-high-school-shooting-iowa-1defc6260e074362240a31a7f30cf1b9"
  },
  {
    "text": "Arrest footage of Trump co-defendant provides glimpse into Jack Smith probe  —  “They were f—king relentless,” former Black Voices for Trump director Harrison Floyd said of his confrontation with FBI agents dispatched by the special counsel.  —  Special counsel Jack Smith's probe … ",
    "url": "https://www.politico.com/news/2024/01/04/harrison-floyd-trump-bodycam-footage-jack-smith-00133933"
  },
  {
    "text": "McCarty eyes the ‘middle ground’ on crime  —  THE BUZZ: Fights over California's criminal justice system will lead to some of the biggest policy showdowns in the statehouse this year.  And Assemblymember Kevin McCarty has been tapped to be the referee.  —  The Sacramento Democrat is on his way out … ",
    "url": "https://www.politico.com/newsletters/california-playbook/2024/01/05/mccarty-eyes-the-middle-ground-on-crime-00133959"
  },
  {
    "text": "Florida venue cancels Marjorie Taylor Greene event after learning of its Jan. 6 focus  —  The event was originally touted as book-signing hosted by a local Republican Party.  —  A central Florida venue has canceled an event that was to feature Rep. Marjorie Taylor Greene, R-Ga. … ",
    "url": "https://www.nbcnews.com/politics/politics-news/florida-venue-cancels-marjorie-taylor-greene-jan-6-event-rcna132365"
  },
  {
    "text": "Florida Proud Boy Sentenced on Felony Charges for Assaulting Police Officers During Jan. 6 Capitol Breach  —  For Immediate Release  —  U.S. Attorney's Office, District of Columbia  —  Defendant Became a Fugitive to Avoid Sentencing, Triggering a 6-Week Manhunt",
    "url": "https://www.justice.gov/usao-dc/pr/florida-proud-boy-sentenced-felony-charges-assaulting-police-officers-during-jan-6"
  }
]