[
  {
    "text": "Trump Administration Draft Order Calls for Drastic Overhaul of State Department  —  The draft executive order to be signed by President Trump would eliminate Africa operations and shut down bureaus working on democracy, human rights and refugee issues.  —  A draft White House executive order proposes … ",
    "url": "https://www.nytimes.com/2025/04/20/us/politics/trump-state-department-overhaul.html?unlocked_article_code=1.BE8.QhVd.gY0YDBy3y33U"
  },
  {
    "text": "Vance meets Pope Francis on Easter Sunday after tangle over migration, gets chocolate eggs for kids  —  U.S. Vice President JD Vance met briefly with Pope Francis on Sunday to exchange Easter greetings, after they got into a long-distance tangle over the Trump administration's migrant deportation plans.",
    "url": "https://apnews.com/article/pope-vance-us-migration-c9fc577cabff138de7bd8026133994fc"
  },
  {
    "text": "Vance meets with pope as Francis's Easter message decries ‘logic of fear’  —  The visit at the Vatican brought together the ailing head of the Catholic church and a high-profile convert who has criticized the pope's social teachings.  —  Vance meets with Pope Francis on Easter Sunday",
    "url": "https://www.washingtonpost.com/politics/2025/04/20/vance-pope-francis-easter-vatican/"
  },
  {
    "text": "Pope Francis meets with US Vice President JD Vance at Santa Marta  —  The brief meeting of Pope Francis with US Vice President JD Vance offered the opportunity to exchange Easter greetings.  Yesterday Cardinal Parolin met with the US leader at the Secretariat of State.",
    "url": "https://www.vaticannews.va/en/pope/news/2025-04/pope-francis-meets-us-vice-president-jd-vance-at-santa-marta.html"
  },
  {
    "text": "Sen. Chris Van Hollen says America is in a ‘constitutional crisis’ as Trump disregards court orders in the Abrego Garcia case  —  The Maryland senator told “Meet the Press” that the Trump administration needs to litigate the case in courtrooms rather than social media posts.",
    "url": "https://www.nbcnews.com/politics/trump-administration/chris-van-hollen-america-constitutional-crisis-trump-abrego-garcia-rcna202018"
  },
  {
    "text": "Thousands of protesters rally against Trump across US  —  Thousands of protesters rallied in Washington and other cities across the U.S. on Saturday to voice their opposition to President Donald Trump's policies on deportations, government firings, and the wars in Gaza and Ukraine.",
    "url": "https://www.reuters.com/world/us/thousands-protesters-rally-against-trump-across-us-2025-04-19/"
  },
  {
    "text": "Boeing begins flying back planes refused by Chinese airlines  —  Beijing orders carriers to stop taking deliveries of US jets as part of its trade war strategy  —  The US plane manufacturer Boeing has begun flying 737 Max jets that were refused by Chinese airline customers back to the United States … ",
    "url": "https://www.bangkokpost.com/business/general/3006447/boeing-begins-flying-back-planes-refused-by-chinese-airlines"
  },
  {
    "text": "Zuckerberg, Dimon Are Among Top Sellers Ahead of Tariff Stock Rout  —  Billionaire Oracle CEO also unloaded shares in first quarter before markets tumbled.  —  Insiders including Meta Platforms Inc.'s Mark Zuckerberg, Oracle Corp.'s Safra Catz and JPMorgan Chase & Co.'s Jamie Dimon cashed … ",
    "url": "https://www.bloomberg.com/news/articles/2025-04-20/zuckerberg-dimon-are-among-top-sellers-ahead-of-tariff-stock-rout"
  },
  {
    "text": "The America I loved is gone  —  It was a nation of dreams, built for the screen.  Then it shattered  —  The first impression America gave me was gentle carelessness.  We were driving down from Canada to visit family friends in Texas sometime in the mid- to late 1980s … ",
    "url": "https://www.theguardian.com/us-news/ng-interactive/2025/apr/20/american-dream-trump-canada"
  },
  {
    "text": "Musk to Force Pentagon to Build and Then Pay Him to Use Network of Killer Satellites … This is a two day old article.  But with so much else going on I hadn't seen it.  If you haven't really must read it.  It's one of growing number of examples that the US government is at present essentially … ",
    "url": "https://talkingpointsmemo.com/edblog/musk-to-force-pentagon-to-build-and-them-pay-him-to-use-network-of-killer-satellites"
  },
  {
    "text": "As legal fight raged, ICE buses filled with Venezuelans heading toward airport turned around, video shows  —  At least 28 detainees were placed on buses Friday evening at ICE's Bluebonnet Detention Center in Anson, Texas, and then driven toward an airport about an hour away.",
    "url": "https://www.nbcnews.com/politics/immigration/legal-fight-raged-ice-buses-filled-venezuelans-heading-airport-turned-rcna202007"
  },
  {
    "text": "This Midwestern city has long been a federal hub.  The pain from DOGE's cuts is everywhere  —  In her 28 years working for the federal government, Shea Giagnorio provided day care for the children of U.S. soldiers, training for employees and oversight for safety net programs.",
    "url": "https://apnews.com/article/doge-federal-cuts-job-musk-trump-kansas-city-06023cbc68c82fdaa021ced1069fd81c"
  },
  {
    "text": "Three Hegseth aides ousted in leak investigation decry ‘baseless attacks’  —  Three former senior advisers to Defense Secretary Pete Hegseth decried on Saturday what they called “baseless attacks” after each was escorted from the Pentagon in an expanding probe on information leaks.",
    "url": "https://apnews.com/article/hegseth-leak-probe-officials-ousted-a21e9ee6db5b75707ddc66e360eee874"
  },
  {
    "text": "U.S. citizen in Arizona detained by immigration officials for 10 days  —  IMMIGRATION OFFICIALS IN TUCSON ARRESTED THE 19-YEAR-OLD MAN FROM ALBUQUERQUE ON APRIL 8, SAYING HE HAD ENTERED THE COUNTRY ILLEGALLY, BEFORE A JUDGE DISMISSED HIS CASE ON APRIL 17.  —  19-year-old Jose Hermosillo … ",
    "url": "https://news.azpm.org/p/news-articles/2025/4/18/224512-us-citizen-in-arizona-detained-by-immigration-officials-for-10-days/"
  },
  {
    "text": "Ukraine's Zelenskiy says Russian army ‘trying to create impression’ of Easter ceasefire  —  Russia and Ukraine blamed each other on Sunday for breaking a one-day Easter ceasefire announced by President Vladimir Putin, with both sides accusing the other of carrying out hundreds of attacks.",
    "url": "https://www.reuters.com/world/europe/ukraines-zelenskiy-says-russian-army-trying-create-impression-easter-ceasefire-2025-04-20/"
  },
  {
    "text": "Arizona Governor Vetoes Bill That Would Have Supported Federal Immigration Efforts  —  The administration wants the Supreme Court to “dissolve” their block on deportations of Venezuelans and to allow lower courts to consider the case.  —  The Trump administration asks the justices to reject an A.C.L.U. request to pause deportations.",
    "url": "https://www.nytimes.com/live/2025/04/19/us/trump-news"
  },
  {
    "text": "Democrats face growing calls for generational change  —  Calls for generational change among Democrats are growing louder as the party seeks to chart a path forward going into the 2026 midterms.  —  On Wednesday, Democratic National Committee (DNC) Chair David Hogg's group Leaders … ",
    "url": "https://thehill.com/homenews/campaign/5256401-democrats-call-for-generational-change/"
  },
  {
    "text": "The fascist moment is here: Have mainstream liberals heard the alarm go off?  —  Welcome to upside-down America: David Brooks calls for revolution while Gretchen Whitmer and Gavin Newsom grovel  —  This is pretty much it, I would say: This is the moment we have long feared — or … ",
    "url": "https://www.salon.com/2025/04/20/the-fascist-moment-is-here-have-mainstream-liberals-heard-the-alarm/"
  },
  {
    "text": "Trump isn't holding rallies these days — and doesn't seem to miss them much  —  “There's really no reason to do it,” a senior White House official said of holding a rally.  —  In his first eight months in the White House in 2017, Donald Trump held nine rallies — the kind of campaign-style events … ",
    "url": "https://www.washingtonpost.com/politics/2025/04/20/trump-less-rallies/"
  },
  {
    "text": "White House solicits corporate sponsors for its Easter Egg Roll event  —  The White House is for the first time soliciting corporate sponsors for the annual Easter Egg Roll event to be held Monday on the South Lawn.  This comes as billionaire tech executives have faced growing criticism for cozying up to the Trump administration.",
    "url": "https://www.npr.org/2025/04/19/g-s1-61377/white-house-easter-egg-roll-corporate-sponsors"
  }
]