[
  {
    "text": "Johnson ‘all in’ for Trump  —  Speaker Mike Johnson said he's “all in” for former President Donald Trump's 2024 bid to return to the White House during a Tuesday morning appearance on CNBC's “Squawk Box.”  “I have endorsed him wholeheartedly,” Johnson said, adding he was … ",
    "url": "https://www.politico.com/live-updates/2023/11/14/congress/johnson-trump-2024-00127013"
  },
  {
    "text": "Trump Wants Us to Know He Will Stop at Nothing in 2025  —  Over the last few weeks, we've gotten a pretty good idea of what Donald Trump would do if given a second chance in the White House.  And it is neither exaggeration nor hyperbole to say that it looks an awful lot like a set … ",
    "url": "https://www.nytimes.com/2023/11/14/opinion/trump-stephen-miller-immigration.html"
  },
  {
    "text": "Trump's Truth Social has lost $73 million in less than 2 years, new filing says  —  Former President Trump's social media platform, Truth Social, has lost $73 million in net sales since the platform's official launch in February 2022, according to a new financial disclosure filing from Digital World Acquisition Corp. (DWAC).",
    "url": "https://thehill.com/homenews/media/4308023-trumps-truth-social-has-lost-73-million-in-less-than-two-years-new-filing-says/"
  },
  {
    "text": "‘The boss is not going to leave’: Proffer videos show ex-Trump lawyers telling Georgia prosecutors about efforts to overturn 2020 election  —  ABC News obtained video from interviews held with Jenna Ellis and Sidney Powell.  —  Jenna Ellis reads a statement after Ellis pleading guilty … ",
    "url": "https://abcnews.go.com/US/boss-leave-proffer-videos-show-trump-lawyers-telling/story?id=104831939"
  },
  {
    "text": "‘I do my best not to revisit this’: Emotional Paul Pelosi tells court of the moment he was attacked by a hammer-wielding David DePape in his own home in front of cops - having stalled him by calling 911  — DePape said he was looking for Nancy Pelosi, the then-Speaker of the House, and attacked Paul with a hammer, fracturing his skull",
    "url": "https://www.dailymail.co.uk/news/article-12745289/paul-pelosi-david-depape-attacked-san-francisco-trial-testimony.html"
  },
  {
    "text": "He's a Communist Trust Fund Baby Who Inherited Millions.  Now, He's Using Daddy's Money To Harass Jews.  —  Earlier this year, avowed communist James “Fergie” Chambers secured “multiple hundreds of millions of dollars” from his family, which controls the Cox Enterprises empire.",
    "url": "https://freebeacon.com/israel/hes-a-communist-trust-fund-baby-who-inherited-millions-now-hes-using-daddys-money-to-harass-jews/"
  },
  {
    "text": "The alarming news progressive groups delivered to the White House  —  Top White House aides reviewed private polling showing Biden's economic message falling flat and suggesting paths toward a turnaround.  —  Earlier this fall, President Joe Biden's top aides met a pair of progressives … ",
    "url": "https://www.politico.com/news/2023/11/14/white-house-bidenomics-polling-00126982"
  },
  {
    "text": "Nearly two dozen toddlers sickened by lead linked to applesauce pouches, CDC says  —  Children ages 1 to 3 were affected, and at least one child showed a blood lead level eight times higher than the level that raises concern, the Centers for Disease Control and Prevention said.",
    "url": "https://www.nbcnews.com/health/health-news/nearly-two-dozen-toddlers-sickened-lead-linked-applesauce-pouches-cdc-rcna125067"
  },
  {
    "text": "'He'll be out': Santos' GOP critics anxiously await report they hope will help boot him  —  If it's damning, as many expect, an Ethics Committee report could provide the votes to officially sever the New York Republican from the House.  —  Rep. George Santos (R-N.Y.) has evaded two efforts this year to oust him from the House.",
    "url": "https://www.politico.com/news/2023/11/14/george-santos-ethics-report-ouster-00126887"
  },
  {
    "text": "Mike Johnson's shutdown plan gets a hall pass from furious Freedom Caucus  —  Members of the conservative House Freedom Caucus took an official position against the two-tiered stopgap funding bill aimed at averting a government shutdown just hours before it is set to come to the floor for a vote on Tuesday.",
    "url": "https://www.axios.com/2023/11/14/freedom-caucus-mike-johnson-government-shutdown"
  },
  {
    "text": "Mike Johnson's Shady Finances Are Already Coming Back to Bite Him  —  Speaker Mike Johnson (R-LA) is facing a new ethics complaint over a litany of alleged violations with his financial disclosures. … When newly minted Republican Speaker of the House Mike Johnson was asked on Fox News … ",
    "url": "https://www.thedailybeast.com/mike-johnsons-shady-finances-are-already-coming-back-to-bite-him"
  },
  {
    "text": "More Than 400 U.S. Officials Sign Letter Protesting Biden's Israel Policy  —  The signers, representing some 40 government agencies, reflect growing internal dissent over the administration's support of Israel's military campaign in Gaza.  —  More than 400 political appointees … ",
    "url": "https://www.nytimes.com/2023/11/14/us/politics/israel-biden-letter-gaza-cease-fire.html"
  },
  {
    "text": "Scoop: Nikki Haley and Jamie Dimon hold private convos on the economy  —  JPMorgan Chase CEO Jamie Dimon has been talking privately with GOP presidential candidate Nikki Haley about the global economy, and believes she has the potential to bring the country together, a top banking source tells Axios.",
    "url": "https://www.axios.com/2023/11/14/nikki-haley-republicans-jamie-dimon-economy"
  },
  {
    "text": "Inflation expected to have cooled in October  —  Economists expect prices to have risen 3.3% over the year ending in October.  —  Prices are displayed as a person shops in a grocery store on Sept. 12, 2023 in Los Angeles.  —  Economists expect fresh data on Tuesday to show that inflation cooled … ",
    "url": "https://abcnews.go.com/Business/inflation-expected-cooled-october/story?id=104843301"
  },
  {
    "text": "Black for Palestine: Meet Rashida Tlaib's favorite Israel-hating group with terror ties  —  Black for Palestine is “an emerging national network of black activists committed to supporting the Palestinian struggle for freedom, justice, peace and self-determination” that boasts famous left-wing … ",
    "url": "https://www.washingtonexaminer.com/news/house/palestine-rashida-tlaib-israel-terror-ties-hamas"
  },
  {
    "text": "These companies spent over $100 million to avoid accountability for drinking water contamination  —  Between 2019 and 2022, chemical companies spent more than $110 million lobbying against rules to curb potentially harmful “forever chemicals,” according to a new study by Food & Water Watch (FWW).",
    "url": "https://popular.info/p/these-companies-spent-over-100-million"
  },
  {
    "text": "How Trump's rhetoric compares to Hitler's  —  Donald Trump has long toyed with the language of famous autocrats, authoritarians and fascists.  Think: “enemy of the people,” “retribution” and the frequent, years-long allusions to political violence.  —  But even by his standards … ",
    "url": "https://www.washingtonpost.com/politics/2023/11/13/how-trumps-rhetoric-compares-hitlers/"
  },
  {
    "text": "Unmarried to the Mob  —  After the ex-wife of a Trump Organization insider talked to prosecutors, she lost her children and her home.  But she's still fighting.  —  Pocket  —  This article appears in the November 27/December 4, 2023 issue, with the headline “Unmarried to the Mob.”",
    "url": "https://www.thenation.com/article/society/jennifer-weisselberg-trump-organization/"
  },
  {
    "text": "U.S. Economic Calendar  —  This Week's Major U.S. Economic Reports & Fed Speakers  —  Time (ET) Report Period Actual Median Forecast Previous  —  New York Fed President John Williams speaks Fed Vice Chair Philip Jefferson speaks  —  Fed Vice Chair for Supervision Michael Barr testifies to Senate panel",
    "url": "https://www.marketwatch.com/economy-politics/calendar"
  },
  {
    "text": "Scoop: Trump pollster sees Haley benefiting from Tim Scott's exit … - “Despite the narrative that the DeSantis team is trying to push, it's clear that other candidates dropping out is not causing voters to consolidate around him,” the memo argues.  — Trump (43%) continues to boast … ",
    "url": "https://www.axios.com/2023/11/14/haley-polls-tim-scott-trump-2024-election"
  },
  {
    "text": "Biden administration bolsters effort to battle antisemitism and Islamophobia in schools  —  President Joe Biden has been under pressure to respond to mounting incidents on college campuses.  —  WASHINGTON — The Biden administration is rolling out new tools Tuesday to address the continued rise … ",
    "url": "https://www.nbcnews.com/politics/white-house/biden-administration-bolsters-effort-battle-antisemitism-islamophobia-rcna125005"
  },
  {
    "text": "'I've seen better run city council campaigns': Tim Scott's allies fume after exit  —  The South Carolina senator told just two campaign staff members of his plan to drop out.  —  When Tim Scott announced the end of his presidential bid from the studio of his house in Hanahan, S.C. … ",
    "url": "https://www.politico.com/news/2023/11/13/tim-scott-allies-fume-exit-00126827"
  }
]