[
  {
    "text": "Liz Cheney, outspoken Trump critic, weighs third-party presidential run  —  The former congresswoman says she is determined to stop Trump.  Other Trump critics think a third-party candidacy could help him.  —  Liz Cheney, one of the most vociferous critics of Donald Trump in the Republican Party … ",
    "url": "https://www.washingtonpost.com/elections/2023/12/05/liz-cheney-trump-president-2024/"
  },
  {
    "text": "Special counsel alleges Trump ‘sent’ supporters on path to Jan. 6 violence  —  Jack Smith accused the former president of a history of election lies and ‘encouragement of violence.’  —  Federal prosecutors on Tuesday accused former president Donald Trump of a long pattern of lying about elections … ",
    "url": "https://www.washingtonpost.com/national-security/2023/12/05/trump-jan-6-violence-election-obstruction/"
  },
  {
    "text": "Mike Johnson Says Republicans Are Blurring Jan. 6 Footage To Protect Rioters From DOJ  —  The House speaker offered a remarkable statement in support of those who rioted at the Capitol in 2021.  —  WASHINGTON ― House Speaker Mike Johnson (R-La.) said Tuesday that Republicans … ",
    "url": "https://www.huffpost.com/entry/mike-johnson-jan-6-footage_n_656f46cce4b09331c7f2219e"
  },
  {
    "text": "Donald Trump's 2024 Campaign, in His Own Menacing Words  —  Trump's language has become darker, harsher and more threatening during his third run for the White House.  —  As he campaigns for another term in the White House, Donald Trump sounds like no other presidential candidate in U.S. history.",
    "url": "https://www.nytimes.com/2023/12/05/us/politics/trump-2024-president-campaign.html"
  },
  {
    "text": "Jack Smith wants to tell jury about Trump's earlier attempts to sow doubt about elections  —  The special counsel is seeking a judge's permission to introduce evidence that may help jurors assess Trump's intent in the weeks leading to Jan. 6.  —  Special counsel Jack Smith wants a Washington … ",
    "url": "https://www.politico.com/news/2023/12/05/jack-smith-trump-elections-jan-6-00130200"
  },
  {
    "text": "Tommy Tuberville announces end to blanket military holds  —  ‘We fought hard,’ he said after telling his Republican colleagues he was lifting his holds  —  Sen. Tommy Tuberville (R-Ala.) announced Tuesday that he would lift his blanket hold on military promotions, ending a nearly 10-month standoff … ",
    "url": "https://www.washingtonpost.com/politics/2023/12/05/tuberville-lifts-military-promotions-hold/"
  },
  {
    "text": "Tuberville releasing hold on hundreds of military promotions  —  Sen. Tommy Tuberville (R-Ala.) announced on Tuesday that he is ending his months-long blockade on hundreds of military promotions.  —  Tuberville said that he is jumping on board with an idea presented by Sens. Dan Sullivan … ",
    "url": "https://thehill.com/homenews/senate/4343067-tuberville-release-hold-military-promotions/"
  },
  {
    "text": "Top Democratic Donor, Reid Hoffman, Gives $250,000 to a Nikki Haley Super PAC  —  Mr. Hoffman, the co-founder of LinkedIn, has funded an array of anti-Trump candidates and causes.  —  When Jamie Dimon, the chief executive of JPMorgan Chase, urged Democratic donors last week to rally behind Nikki Haley … ",
    "url": "https://www.nytimes.com/2023/12/05/us/politics/nikki-haley-reid-hoffman-donation.html"
  },
  {
    "text": "NYT: A New Dem ‘Operation Chaos’ Pays Off for Haley; Update: DeSantis Blasts  —  Let's be clear about this.  Nikki Haley has not personally solicited funds from major Democrat donors for her primary campaign to win the GOP's presidential nomination.  Even the super-PAC supporting Haley's campaign … ",
    "url": "https://hotair.com/ed-morrissey/2023/12/05/nyt-a-new-dem-operation-chaos-pays-off-for-haley-n596863"
  },
  {
    "text": "Introduction  —  A national poll released today by the Institute of Politics at Harvard Kennedy School indicates that among 18-to-29-year-olds, President Biden's approval rating stands at 35%.  Still, the President maintains a solid lead in a head-to-head matchup against former President Trump.",
    "url": "https://iop.harvard.edu/youth-poll/46th-edition-fall-2023"
  },
  {
    "text": "Statement from Congressman Patrick McHenry  —  WASHINGTON — Congressman Patrick McHenry (NC-10) released the following statement:",
    "url": "https://mchenry.house.gov/news/documentsingle.aspx?DocumentID=404652"
  },
  {
    "text": "Hamas drugged hostages before releasing them  —  Israeli Health Ministry confirms Hamas gave hostages tranquilizers, extra food, right before their release so they would look better than their actual health condition  —  Hamas gave Israeli hostages tranquilizers to make them appear … ",
    "url": "https://jewishinsider.com/2023/12/hamas-hostages-klonopin-israel-gaza-release/"
  },
  {
    "text": "McHenry set to pass on reelection  —  The North Carolina Republican served as temporary speaker during this fall's chaotic search for a replacement for Kevin McCarthy.",
    "url": "https://www.politico.com/live-updates/2023/12/05/congress/mchenry-out-00130103"
  },
  {
    "text": "Speaker Johnson gives Biden an ultimatum on Ukraine funding, immigration  —  Biden administration has warned that Ukraine funding will run out by the end of the year  —  There will be no additional funding for Ukraine without first making extensive reforms to the U.S. immigration system … ",
    "url": "https://www.foxnews.com/politics/speaker-johnson-gives-biden-ultimatum-ukraine-funding-immigration"
  },
  {
    "text": "Accounts of Sexual Violence by Hamas Are Aired Amid Criticism of U.N.  —  A presentation at the U.N., organized in part by Sheryl Sandberg, accused the body of ignoring the rape and mutilation of women in the Oct. 7 assault on Israel, and heard gruesome details from witnesses.",
    "url": "https://www.nytimes.com/2023/12/04/world/middleeast/israel-hamas-sexual-violence-un.html"
  },
  {
    "text": "U.S. imposes visa ban on Israeli settlers who attacked Palestinians  —  The U.S. State Department on Tuesday announced it has imposed sanctions on several dozen Israeli settlers believed to be involved in attacks against Palestinians, banning them from traveling to the U.S.",
    "url": "https://www.axios.com/2023/12/05/us-israeli-settler-west-bank-visa-ban-plan"
  },
  {
    "text": "Congress provided $7.5B for electric vehicle chargers.  Built so far: Zero.  —  The sluggish rollout could undermine President Joe Biden's reelection messaging promoting electric vehicles.  —  Congress at the urging of the Biden administration agreed in 2021 to spend $7.5 billion to build tens … ",
    "url": "https://www.politico.com/news/2023/12/05/congress-ev-chargers-billions-00129996"
  },
  {
    "text": "“Someone tell me what to do”  —  Across the country, states require more training to prepare students and teachers for mass shootings than for those expected to protect them.  The differences were clear in Uvalde, where children and officers waited on opposite sides of the door.",
    "url": "https://www.texastribune.org/2023/12/05/uvalde-officer-student-trainings-mass-shootings/"
  },
  {
    "text": "New Hampshire Republicans Introduce 15-Day Abortion Ban  —  With a Republican trifecta in the Senate, House and governor's mansion, the bill has a real chance to become law.  —  Republicans in New Hampshire filed one of the most extreme abortion bans in the country on Tuesday ― … ",
    "url": "https://www.huffpost.com/entry/new-hampshire-15-day-abortion-ban_n_656f66dee4b0f3e5f44b124c"
  }
]