[
  {
    "text": "Steve Scalise's celebration on pause  —  The House GOP's hoped-for moment of unity never materialized on Wednesday.  Now it's another long slog ahead.  —  After Steve Scalise clinched House Republicans' nod for speaker on Wednesday, he did not deliver a victory speech.",
    "url": "https://www.politico.com/news/2023/10/11/scalise-moment-of-unity-on-pause-house-gop-00121049"
  },
  {
    "text": "Cenk Uygur running for president as Democrat  —  The News  —  Progressive pundit Cenk Uygur will challenge President Biden for the Democratic nomination, offering himself as an alternative to an incumbent who “is definitely going to lose” if he makes it to the general election.",
    "url": "https://www.semafor.com/article/10/11/2023/cenk-uygur-running-for-president-as-democrat"
  },
  {
    "text": "Fox News Poll: Support for Haley doubles in GOP primary, she tops Biden by four  —  Trump received 59% support among Republican voters … Former President Donald Trump maintains his commanding lead in the Republican presidential contest, but his nomination would unify Democrats in the general election … ",
    "url": "https://www.foxnews.com/official-polls/fox-news-poll-haley-doubles-gop-primary-biden"
  },
  {
    "text": "Sen. Mitt Romney urged Democratic senators to challenge Biden — and he named names  —  At the Park City E2 Summit with Republican donors and influencers, the Utah senator made another plea for the anti-Trump crowd to coalesce around a single opponent to Trump",
    "url": "https://www.deseret.com/2023/10/10/23910516/mitt-romney-e2-summit-trump-israel-biden"
  },
  {
    "text": "How to think morally about the Israel-Hamas war  —  Massacring civilians is neither decolonization nor self-defense.  —  In southern Israel, Hamas terrorists broke into a room where a family of five was hiding and slaughtered every one of them.  In Gaza, a father wrapped in gauze held his child … ",
    "url": "https://www.vox.com/world-politics/23911550/israel-hamas-war-gaza-palestine-leftist-democrats"
  },
  {
    "text": "Israel Targets All Hamas Leaders Across Gaza in Fresh War Effort  — Military spokesman says political leaders same as army  — A ground war has not been decided but army is preparing for it  —  Israel is targeting Hamas' political leaders in Gaza as well as military ones as it seeks … ",
    "url": "https://www.bloomberg.com/news/articles/2023-10-12/israel-targets-all-hamas-leaders-across-gaza-in-fresh-war-effort"
  },
  {
    "text": "U.S. intelligence indicates Iranian leaders were surprised by Hamas attack  —  But Biden administration officials say Iran was “complicit” in the attack since it has armed and trained Hamas for decades.  —  American spy agencies have obtained “exquisite” intelligence that shows Iranian leaders … ",
    "url": "https://www.nbcnews.com/news/investigations/us-intelligence-indicates-iranian-leaders-surprised-hamas-attack-rcna119946"
  },
  {
    "text": "Judge Accused of Sending Wildly Inappropriate Texts During Her First Murder Trial  —  The Oklahoma judge swapped more than 500 texts about everything from a prosecutor's genitals to a “pretty” cop, an investigation found.  —  An Oklahoma judge could be booted from the bench after an investigation found … ",
    "url": "https://www.thedailybeast.com/oklahoma-judge-traci-soderstrom-busted-sending-inappropriate-texts-during-murder-trial"
  },
  {
    "text": "Oklahoma Judge Who Texted During Murder Trial Faces Removal  —  The chief justice of the Oklahoma Supreme Court is recommending the removal of District Judge Traci Soderstrom, who exchanged more than 500 texts with her courtroom bailiff during the trial.  —  Video",
    "url": "https://www.huffpost.com/entry/bc-us-oklahoma-judge-cellphone_n_6526ebace4b0a32c15c144c6"
  },
  {
    "text": "Supreme Court likely to side with South Carolina GOP in racial gerrymandering case  —  A lower court had ruled that the state's Republican-drawn map was a racial gerrymander.  —  The Supreme Court's conservative majority on Wednesday appeared likely to uphold a Republican-drawn congressional district … ",
    "url": "https://www.politico.com/news/2023/10/11/supreme-court-likely-to-side-with-south-carolina-gop-in-racial-gerrymandering-case-00121003"
  },
  {
    "text": "Democrats furious over Van Orden outburst during White House briefing on Israel terrorist attack  —  Multiple attendees described Van Orden as acting belligerent towards the Biden administration briefers when he asked questions.",
    "url": "https://www.politico.com/live-updates/2023/10/11/congress/van-orden-outburst-house-israel-00120961"
  },
  {
    "text": "She was told her twin sons wouldn't survive.  Texas law made her give birth anyway.  —  Miranda Michel, 26, couldn't leave the state for an abortion.  But she also couldn't bear the idea of carrying a nonviable pregnancy to term.  —  Editor's note: This story includes images some people may find distressing.",
    "url": "https://www.texastribune.org/2023/10/11/texas-abortion-law-texas-abortion-ban-nonviable-pregnancies/"
  },
  {
    "text": "Judge in Trump documents case weighs whether defense lawyers are too close to witnesses  —  Lawyers for Trump co-defendants Walt Nauta and Carlos De Oliveira also represented witnesses expected to be called at trial, which prosecutors warned could be a conflict of interest.",
    "url": "https://www.usatoday.com/story/news/politics/2023/10/12/donald-trump-classified-documents-defense-lawyers/70974834007/"
  },
  {
    "text": "China Invited Pentagon Chief to Defense Forum, Reuters Says  — Lower level officials will attend, three people familiar say  — Ties between Beijing and Washington showing signs of warming  —  The US has accepted China's invitation to attend a top annual security forum in Beijing this month … ",
    "url": "https://www.bloomberg.com/news/articles/2023-10-12/us-to-attend-beijing-defense-forum-as-ties-stabilize-reuters"
  },
  {
    "text": "Fulton County DA rebuffs Jim Jordan's request for information on her investigation of Trump  —  Fulton County District Attorney Fani Willis declined to provide House Judiciary Chairman Jim Jordan with any additional information about her investigation of former President Donald Trump … ",
    "url": "https://www.cnn.com/2023/10/11/politics/fani-willis-jim-jordan/"
  },
  {
    "text": "Pro-Trump Lawyers Kenneth Chesebro and Sidney Powell Try - Again - to Dismiss Georgia RICO Charges Against Them  —  Fulton County Superior Court Judge Scott McAfee on Wednesday heard pre-trial arguments to dismiss the Georgia election-racketeering case before the trial begins with jury selection on Oct. 20",
    "url": "https://themessenger.com/politics/trump-georgia-mcafee-hearing-rico-chesebro-powell"
  },
  {
    "text": "8,700 Ford Kentucky Truck plant members join UAW strike  —  United Auto Workers expanded its ongoing strikes against major automobile manufacturers Wednesday after a Ford truck plant in Kentucky joined the strike, the union announced.  —  About 8,700 workers from the company's Truck Assembly Plant … ",
    "url": "https://thehill.com/business/4251235-ford-kentucky-truck-plant-employees-join-strike-uaw/"
  },
  {
    "text": "Cory Mills Evacuates Americans out of Israel  —  As Israel calls up 300,000 reservists to join the war effort against the terror group Hamas, Florida Congressman Cory Mills (R) has once again answered the call to service, and flew overnight to Israel to help rescue Americans stranded there.",
    "url": "https://floridianpress.com/2023/10/cory-mills-evacuates-americans-out-of-israel/"
  }
]