[
  {
    "text": "Playbook: What Trump wants from Capitol Hill  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  THE $46 BILLION MAN — “Elon Musk Says Vote on His Pay Winning by ‘Wide Margins,’” by WSJ's Christina Rogers and David Benoit",
    "url": "https://www.politico.com/newsletters/playbook/2024/06/13/what-trump-wants-from-capitol-hill-00163125"
  },
  {
    "text": "DNC to tail Trump with mobile billboard of Jan. 6 attack during visit to Capitol Hill  —  Democrats are highlighting the riot, which took place after a Trump speech to supporters near the White House, as he returns to meet with lawmakers.  —  When Donald Trump visits Washington on Thursday … ",
    "url": "https://www.nbcnews.com/politics/2024-election/dnc-tail-trump-mobile-billboard-jan-6-attack-visit-capitol-hill-rcna156870"
  },
  {
    "text": "Public Notice's Sinclair report makes national headlines  —  From Morning Joe to the HuffPost, it's been a big week for the newsletter.  —  As part of a collaboration with Judd Legum of Popular Information, earlier this week I published a report on Sinclair's right-wing media empire … ",
    "url": "https://www.publicnotice.co/p/aaron-rupar-public-notice-sinclair-judd-legum"
  },
  {
    "text": "Trump Rants About Sharks, and Everyone Just Pretends It's Normal  —  Hours before meeting with his probation officer about his recent felony convictions, a leading candidate for U.S. president went on a bizarre rant about sharks.  —  Sharks, Donald Trump claimed, were attacking more frequently than usual … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/06/trump-shark-rant/678666/"
  },
  {
    "text": "Republican National Committee prepares for a convention Trump may not attend  —  Republican officials are working to ensure that Trump will be able to address convention attendees from afar if he chooses to do so — or if he is forced to because of his legal troubles.",
    "url": "https://www.nbcnews.com/politics/2024-election/republican-national-committee-convention-trump-may-not-attend-rcna156838?taid=666ad0faf5f56e0001ae0cda"
  },
  {
    "text": "Here's what the Christian right wants from a second Trump term  —  Religious conservatives see opportunities for fresh gains after a series of victories during Trump's first term.  Rights advocates see a dangerous blurring of church and state.  —  Donald Trump's presidency delivered … ",
    "url": "https://www.washingtonpost.com/politics/2024/06/13/trump-christian-right-abortion-prayer/"
  },
  {
    "text": "“It appears to be a payoff”: Expert says Kushner's Saudi cash an “egregious” national security worry  —  Senate Finance Committee Chairman Ron Wyden is investigating Saudi support for Jared Kushner's private equity firm  —  Based on his prior experience and demonstrated abilities … ",
    "url": "https://www.salon.com/2024/06/12/it-appears-to-be-a-payoff-expert-says-kushners-saudi-cash-an-egregious-national-security-worry/"
  },
  {
    "text": "Microsoft Chose Profit Over Security and Left U.S. Government Vulnerable to Russian Hack, Whistleblower Says  —  Microsoft hired Andrew Harris for his extraordinary skill in keeping hackers out of the nation's most sensitive computer networks.  In 2016, Harris was hard at work on a mystifying incident … ",
    "url": "https://www.propublica.org/article/microsoft-solarwinds-golden-saml-data-breach-russian-hackers"
  },
  {
    "text": "Why the Southern Baptists' vote opposing IVF could change national politics  —  The move may signal the beginning of a broad turn on the right against IVF, an issue that many social conservatives see as the “pro-life” movement's next frontier.  —  INDIANAPOLIS — The Southern Baptist Convention … ",
    "url": "https://www.politico.com/news/2024/06/12/ivf-southern-baptist-convention-evangelical-00162994"
  },
  {
    "text": "Wisconsin Supreme Court Lifts New Restrictions on Early Voting Sites Ahead of 2024 Elections  —  WASHINGTON, D.C. — The Wisconsin Supreme Court's liberal majority yesterday froze part of a lower court's decision that stood to significantly limit the number of early voting locations municipalities … ",
    "url": "https://www.democracydocket.com/news-alerts/wisconsin-supreme-court-lifts-new-restrictions-on-early-voting-sites-ahead-of-2024-elections/"
  },
  {
    "text": "Denial and Forgetting at the Hunter Biden Trial  —  Consider the levels of denial and forgetting that it takes to write this paragraph the week that Hunter Biden, charged by a Trump US Attorney turned Special Counsel using evidence significantly sourced from a laptop handed over by John Paul Mac Isaac, stood trial.",
    "url": "https://www.emptywheel.net/2024/06/13/denial-and-forgetting-at-the-hunter-biden-trial/"
  },
  {
    "text": "Mike Johnson Weaponizes Government in Fight Against Biden  —  House Speaker Mike Johnson has a tendency to think that when things go bad for his party, it's the product of gross legislative mismanagement, judicial weaponization, and a vast executive conspiracy.",
    "url": "https://newrepublic.com/post/182638/mike-johnson-hypocritical-quest-merrick-garland-contempt"
  },
  {
    "text": "'Who's the Black guy?':  Evangelicals want Trump to pick an anti-abortion running mate.  They care less who it is.  —  Trump has evangelical voters locked in.  —  INDIANAPOLIS — Eight years ago, needing a running mate to vouch for him among skittish evangelicals, Donald Trump turned to Mike Pence … ",
    "url": "https://www.politico.com/news/2024/06/13/trump-evangelical-voters-anti-abortion-vice-president-00163053"
  },
  {
    "text": "Trump's bid to steal the youth … - The latest New York Times/Siena polling of likely voters has President Biden with just a 2-point lead over Trump. … - By contrast, CNN exit polling showed that Biden won the 18-29-year-old vote by 24 percentage points in 2020, and that Hillary Clinton won it by 19 points in 2016.",
    "url": "https://www.axios.com/2024/06/13/trump-election-young-voters-polling"
  },
  {
    "text": "‘The big story of the 21st century’: is this the most shocking documentary of the year?  —  Six years in the making, jaw-dropping new film The Grab shows a secret scramble by governments and private firms to buy up global resources  —  In 2013, the US food conglomerate Smithfield Foods … ",
    "url": "https://www.theguardian.com/film/article/2024/jun/12/the-grab-documentary-review"
  },
  {
    "text": "Record Share of U.S. Electorate Is Pro-Choice and Voting on It  —  Democrats continue to rally around abortion rights since Dobbs verdict  —  WASHINGTON, D.C. — A record-high 32% of U.S. voters say they would only vote for a candidate for major office who shares their views on abortion.",
    "url": "https://news.gallup.com/poll/645836/record-share-electorate-pro-choice-voting.aspx"
  },
  {
    "text": "Congressional Baseball Game descends into chaos after protesters storm field  —  Eight people were arrested after storming the field at Nationals Park during the annual Congressional Baseball Game  —  Several arrests were made at the Congressional Baseball Game for Charity Wednesday night … ",
    "url": "https://www.foxnews.com/politics/congressional-baseball-game-descends-chaos-after-protesters-storm-field"
  },
  {
    "text": "Oklahoma Supreme Court dismisses lawsuit of last Tulsa Race Massacre survivors seeking reparations  —  The Oklahoma Supreme Court on Wednesday dismissed a lawsuit by survivors of the 1921 Tulsa Race Massacre, dampening the hope of advocates for racial justice that the city would make financial amends … ",
    "url": "https://apnews.com/article/1921-race-massacre-tulsa-black-survivors-b7a4c83514ce79640a8490d49efb9006"
  },
  {
    "text": "Hearing on the Manhattan District Attorney's Office  —  Location:  —  2141 Rayburn House Office Building  —  Video  —  WASHINGTON, D.C. - The House Judiciary Committee will hold a hearing on Thursday, June 13, 2024, at 10:00 a.m. ET to examine Alvin Bragg's political prosecution of President Trump.",
    "url": "https://judiciary.house.gov/committee-activity/hearings/hearing-manhattan-district-attorneys-office-0"
  },
  {
    "text": "Eugene Young withdraws from US House race  —  Nearly one year after beginning his campaign, Eugene Young is stepping out of the race for Delaware's seat in the U.S. House.  —  The former Delaware State Housing Authority Director has suspended his campaign for the Democratic nomination.",
    "url": "https://www.wdel.com/news/eugene-young-withdraws-from-us-house-race/article_0aff1eac-28df-11ef-a66a-136e551ceb89.html"
  },
  {
    "text": "Senate Republicans block Democrats' Supreme Court ethics bill  —  The legislation would establish a code of conduct for the justices, as well as recusal rules and new requirements for disclosing gifts and travel.  Republicans blocked it from advancing.  —  WASHINGTON — Senate Republicans … ",
    "url": "https://www.nbcnews.com/politics/congress/senate-gop-blocks-democrats-supreme-court-ethics-bill-rcna156738"
  },
  {
    "text": "Neil Goldschmidt, Oregon former governor who sexually abused young girl, dies at 83  —  Neil Goldschmidt, the Oregon governor and Portland mayor credited with turning a frumpish city into a thriving metropolis only to see his record forever stained by revelations that he had sexually abused a young teen girl … ",
    "url": "https://www.oregonlive.com/politics/2024/06/neil-goldschmidt-former-governor-forever-tainted-by-scandal-dies.html"
  },
  {
    "text": "Ohio Election Shock as Republican District Shifts 20 Points to Democrats  —  district in Ohio has shifted 20 points to the  —  .  —  Republican state Senator Michael Rulli defeated Democrat Michael Kripchak to win the election held in eastern Ohio's 6th District on Tuesday to fill … ",
    "url": "https://www.newsweek.com/ohio-special-election-congress-results-1911576"
  }
]