[
  {
    "text": "Biden says he regrets referring to ‘an illegal’ during his State of the Union address  —  The president used the term to describe Jose Antonio Ibarra, a Venezuelan who crossed the border into the U.S. and has been charged with the murder of Laken Riley.  —  President Joe Biden on Saturday told MSNBC … ",
    "url": "https://www.nbcnews.com/politics/white-house/biden-says-regrets-reference-illegal-state-union-address-rcna142561"
  },
  {
    "text": "Marjorie Taylor Greene Wants Points for ‘Scaring’ Joe Biden at SOTU  —  LOOK AT ME!  LOOK AT ME!  —  “You know, you guys saw that video of Joe Biden when he saw me this week at the State of the Union.  This is the hat I had on.”  —  Rep. Marjorie Taylor Greene (R-GA) … ",
    "url": "https://www.thedailybeast.com/marjorie-taylor-greene-wants-points-for-scaring-joe-biden-at-sotu"
  },
  {
    "text": "“Smokin' Joe Biden”: Campaign builds on SOTU buzz … - “Donald Trump believes the job of the president is to take care of Donald Trump,” Biden says. … - By the end of this month, the campaign expects to surge from 100 staff members in the seven battlegrounds to 350+, with 100+ field offices, per the AP.",
    "url": "https://www.axios.com/2024/03/09/biden-campaign-ad-trump"
  },
  {
    "text": "How Trump Fumbled his Attack on Biden's Age  —  Donald Trump and the Republicans smelled blood.  President Biden had recently been on the defensive about his age.  A series of polls released over the weekend heightened Democratic concerns.  The Republicans knew the press would treat … ",
    "url": "https://www.messageboxnews.com/p/how-trump-fumbled-his-attack-on-bidens"
  },
  {
    "text": "Trump backtracks on statement that Georgia polls are rigged because now he is ‘winning by so much’  —  At a rally in Rome, Ga., on Saturday, former President Trump backtracked on his previous statements that polls in the state are rigged since he now is “winning by so much.”",
    "url": "https://thehill.com/homenews/campaign/4521748-trump-backtracks-on-statement-that-georgia-polls-are-rigged-because-now-he-is-winning-by-so-much/"
  },
  {
    "text": "The Biden-Trump Rerun: A Nation Craving Change Gets More of the Same  —  Americans love a candidate who promises something new.  But when a sitting president runs against a former one, can either claim the mantle of change?  —  The promise of change has been a powerful force in presidential campaigns … ",
    "url": "https://www.nytimes.com/2024/03/09/us/politics/trump-biden-presidential-campaign-2024.html"
  },
  {
    "text": "Katie Britt's false linkage of a sex-trafficking case to Joe Biden  —  The Fact Checker … — Sen. Katie Boyd Britt (R-Ala.), in the Republican response to the State of the Union address, March 7  —  If you were watching Britt's speech on Thursday night, you likely would have thought … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/09/fact-check-katie-britt-sex-trafficking/"
  },
  {
    "text": "Biden rebutter Sen. Britt blasted for recycling 20-year-old sex traffic story to attack border policy  — In her rebuttal to Biden's State of the Union, Republican Sen. Katie Britt of Alabama used what appears to be a sex trafficking victim's experience from the early 2000s to condemn President Joe Biden's current border policy.",
    "url": "https://www.cnbc.com/2024/03/09/katie-britt-unrelated-sex-trafficking-story-state-of-the-union-rebuttal.html"
  },
  {
    "text": "How Katie Britt, Alabama's so-called ‘reasonable’ senator, lost herself and much more  —  This is an opinion column.  —  Katie Britt's kitchen was empty.  Her table was bare.  —  There was nothing to see but her.  And she was - they told us - ready for her closeup.  —  Come on in, America.",
    "url": "https://www.al.com/news/2024/03/archibald-how-katie-britt-alabamas-so-called-reasonable-senator-lost-herself-and-a-whole-lot-more.html"
  },
  {
    "text": "Questions Arise About Britt's State of the Union Response  —  The Alabama senator used a story about sex trafficking to criticize the Biden administration's border policies.  But it wasn't fully accurate.  —  In her rebuttal to President Biden's State of the Union speech Thursday night … ",
    "url": "https://www.nytimes.com/2024/03/09/us/politics/katie-britt-republican-response-sotu-trafficking.html"
  },
  {
    "text": "Inside A Secret Society Of Prominent Right-Wing Christian Men Prepping For A ‘National Divorce’  —  A trove of documents obtained by TPM reveal the society's inner workings.  —  A secret, men-only right-wing society with members in influential positions around the country is on a crusade … ",
    "url": "https://talkingpointsmemo.com/news/inside-a-secret-society-of-prominent-right-wing-christian-men-prepping-for-a-national-divorce"
  },
  {
    "text": "Invented Narratives and the Outrage Industry  —  The Outrage Industry  —  Even if you are not caught up in the Outrage Industry, it affects you because it affects us all.  —  The Outrage Industry influences how we talk about politics with our friends and family—and why some people avoid talking about politics.",
    "url": "https://terikanefield.com/invented-narratives-and-the-outrage-industry/"
  },
  {
    "text": "Pope says Ukraine should have ‘courage of the white flag’ of negotiations  —  Pope Francis has said in an interview that Ukraine should have what he called the courage of the “white flag” and negotiate an end to the war with Russia that followed Moscow's full-scale invasion two years ago and that has killed tens of thousands.",
    "url": "https://www.reuters.com/world/europe/pope-says-ukraine-should-have-courage-white-flag-negotiations-2024-03-09/"
  },
  {
    "text": "Robert De Niro Goes Off on ‘Total Monster’ Trump and His Fans In Epic Rant on Bill Maher — Calls Him Every Name In The Book  —  Acting legend Robert De Niro went on a blistering rant about former President Donald Trump and his supporters, sounding the alarm on a new Trump term and calling him a string of derogatory names.",
    "url": "https://www.mediaite.com/entertainment/robert-de-niro-goes-off-on-trump-and-his-fans-in-epic-rant-on-bill-maher-calls-him-every-name-in-the-book/"
  },
  {
    "text": "How Trump's Justice Dept. Derailed an Investigation of a Major Company  —  The industrial giant Caterpillar hired William Barr and other lawyers to defuse a federal criminal investigation of alleged tax dodges.  —  In December 2018, a team of federal law enforcement agents flew to Amsterdam … ",
    "url": "https://www.nytimes.com/2024/03/09/business/caterpillar-tax-trump-barr.html"
  }
]