[
  {
    "text": "Trump ridiculed after accusing Kamala Harris of mistreating Mike Pence  —  Harris campaign responds: ‘In a stunning senile moment Trump suggested it was Harris who treated Pence poorly’  —  Donald Trump has drawn ridicule and accusations of hypocrisy after accusing Kamala Harris of mistreating Mike Pence … ",
    "url": "https://www.theguardian.com/us-news/article/2024/sep/02/trump-hypocrisy-harris-pence"
  },
  {
    "text": "How Trump Plans to Make Voters Hate Harris  —  FULL COURT PRESS  —  Harris' campaign has opted to cast her as the “underdog candidate,” hoping to move “past the bitterness, cynicism, and divisive battles of the past.”  —  Journalist  —  With Donald Trump and Kamala Harris neck and neck … ",
    "url": "https://www.thedailybeast.com/how-donald-trump-plans-to-make-voters-hate-kamala-harris"
  },
  {
    "text": "Where the race between Trump and Harris stands on Labor Day, according to our polling expert  —  A race that Kamala Harris leads nationally is the equivalent of a knife fight in a phone booth, and it's set to be decided in a smaller-than-usual number of states.",
    "url": "https://www.politico.com/news/2024/09/02/trump-harris-polls-2024-00176981"
  },
  {
    "text": "Former Aurora cop charged with raping daughter remains free as mom is sent to jail  —  Colorado mother objects to court-ordered reunification therapy, claims it is harmful and abusive  —  A retired Aurora police sergeant faces criminal charges for raping his daughter and continually sexually assaulting … ",
    "url": "https://denvergazette.com/colorado-watch/reunification-therapy-colorado-child-abuse/article_96e08e26-66f4-11ef-b15c-ab5c4905bfc1.html"
  },
  {
    "text": "Lara Trump's Singing Brutally Roasted: ‘Every Note Is a Violation’  —  ‘TONE DEAF’  —  The new, highly auto-tuned vocals from the RNC Chairwoman are being compared to “sack of rusty cans being thrown into an industrial wood chipper.”  —  Journalist  —  Lara Trump's new music video for her song … ",
    "url": "https://www.thedailybeast.com/lara-trumps-singing-brutally-roasted-on-social-media"
  },
  {
    "text": "Harris appeals to Detroit workers on Labor Day: ‘You better thank a union member’  —  Vice President Kamala Harris and her running mate, Gov. Tim Walz (R-MN), used Labor Day to court U.S. workers in the Midwest as they seek to preserve Democrats' long-standing alliance with unions.",
    "url": "https://www.washingtonexaminer.com/news/campaigns/presidential/3141021/harris-appeals-detroit-workers-labor-day-unions/"
  },
  {
    "text": "Exclusive: US seizes Venezuela President Nicolas Maduro's airplane in the Dominican Republic  —  The United States has seized Venezuela President Nicolas Maduro's airplane after determining that its acquisition was in violation of US sanctions, among other criminal issues.",
    "url": "https://www.cnn.com/2024/09/02/politics/us-seizes-venezuela-president-maduros-airplane"
  },
  {
    "text": "2020 election deniers ordered to pay $1 million in Pennsylvania voting machine dispute  —  A Pennsylvania judge has determined that three 2020 election deniers must pay nearly $1 million in fees as the result of a years-long legal dispute with state officials over voting equipment used during … ",
    "url": "https://www.cnn.com/2024/09/02/politics/election-deniers-pennsylvania-voting-machine-dispute/"
  },
  {
    "text": "Voters beginning to think Conservatives are ‘weird’, research suggests  —  Tories found to have problems with relatability, and few voters can identify party leadership candidates  —  Conservative politicians have started to be seen as “weird”, and few members of the public … ",
    "url": "https://www.theguardian.com/politics/article/2024/sep/02/voters-beginning-to-think-conservatives-are-weird-research-suggests"
  },
  {
    "text": "Donald Trump is losing it  —  His alarming cognitive decline deserves the scrutiny that Joe Biden received.  —  The process of removing Biden as the Democratic presidential candidate can't exactly be said to have worked well, but it worked.  And now it's time for Americans to turn … ",
    "url": "https://www.newstatesman.com/us-election-2024/2024/09/donald-trump-is-losing-it"
  },
  {
    "text": "Biden: Netanyahu isn't doing enough to get a Gaza hostage and ceasefire deal … - White House national security adviser Jake Sullivan on Sunday told families of U.S. hostages held in Gaza that Biden is considering presenting Israel and Hamas a final proposal for a hostage-release and ceasefire … ",
    "url": "https://www.axios.com/2024/09/02/biden-netanyahu-israel-gaza-hostage-ceasefire-deal"
  },
  {
    "text": "Trump eyes plan that may give Elon Musk role in auditing U.S. agencies  —  The GOP presidential nominee has discussed asking executives to comb through federal books.  For Musk, the task could bring conflicts of interest.  —  Behind closed doors, former president Donald Trump and his advisers … ",
    "url": "https://www.washingtonpost.com/business/2024/09/02/trump-elon-musk-commission-doge/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI1MjQ5NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI2NjMxOTk5LCJpYXQiOjE3MjUyNDk2MDAsImp0aSI6IjRlOTIwNDdkLTRiOGEtNDg5OS04ZTI1LTQyOWE2ODM4OTI4YiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9idXNpbmVzcy8yMDI0LzA5LzAyL3RydW1wLWVsb24tbXVzay1jb21taXNzaW9uLWRvZ2UvIn0.GbWTqXoffVRHKHKaBg99NLagts4IAE_6Y-4dcG2twKQ&itid=gfta"
  },
  {
    "text": "‘Ticking time bomb’: Plunging office values alarm Washington  —  Fed Chair Jerome Powell has voiced concern, saying that commercial real estate risk “will be with us for some time, probably for years.”  —  Four and a half years after the pandemic sent workers home, the office property bill is finally coming due.",
    "url": "https://www.politico.com/news/2024/09/02/office-property-values-fed-00174697"
  },
  {
    "text": "Elon Musk suggests support for replacing democracy with government of ‘high-status males’  —  The theory suggests that the only people able to think freely are ‘high [testostrone] alpha males’ and ‘aneurotypical people’  —  Support truly  —  independent journalism  —  Support us to deliver journalism without an agenda.",
    "url": "https://www.independent.co.uk/news/world/americas/elon-musk-trump-x-views-b2605907.html"
  },
  {
    "text": "Elon Musk is an unguided geopolitical missile  —  While his influence is showing up from Ukraine to China, he still lacks the ability to make the law  —  Big businesses and billionaires usually steer clear of political controversy.  If they exercise power, they prefer to do it in the shadows.",
    "url": "https://www.ft.com/content/b384c68c-a8b8-42ea-8786-337d962c2e96"
  },
  {
    "text": "Convicted fraudsters launch AI lobbying firm using fake names  —  Jacob Wohl and Jack Burkman are operating under the pseudonyms Jay Klein and Bill Sanders.  —  A Washington startup pitched as a service to integrate AI into lobbying is covertly run by a pair of well-known … ",
    "url": "https://www.politico.com/news/2024/09/02/jacob-wohl-jack-burkman-ai-lobbying-pseudonyms-00176917"
  }
]