[
  {
    "text": "Senate Republicans fume over ‘fiasco’ in House  —  Senate Republicans were left fuming Thursday over what they called the dysfunctional “s— show” and “fiasco” they witnessed in the House as two proposals to fund the government through Christmas failed this week.",
    "url": "https://thehill.com/homenews/senate/5049966-senate-republicans-house-government-funding/"
  },
  {
    "text": "Musk Shows Trump That He's the New Chaos in Town  —  If you haven't seen the details, the meltdown on Capitol Hill went from bad to worse this evening.  Or awesome to awesomer, depending on your perspective.  Let's review.  Donald Trump wanted a smooth ride to January 20th.",
    "url": "https://talkingpointsmemo.com/edblog/musk-shows-trump-that-hes-the-new-chaos-in-town"
  },
  {
    "text": "Backlash builds as Elon Musk endorses Germany's far right  —  Elon Musk is backing the far-right Alternative for Germany (AfD), triggering an outcry in Berlin in the run-up to a critical snap election.  —  “Only the AfD can save Germany,” the billionaire X owner wrote on the platform on Friday … ",
    "url": "https://www.politico.eu/article/elon-musk-endorses-germanys-far-right/"
  },
  {
    "text": "Trump says any shutdown ‘is a Biden problem to solve’  —  The president-elect has insisted that any funding package include an extension, or elimination, of the debt limit.  —  President-elect Donald Trump worked Friday morning to foist the blame for any potential government shutdown onto … ",
    "url": "https://www.politico.com/news/2024/12/20/trump-shutdown-biden-problem-00195574"
  },
  {
    "text": "White House alerts agencies to prepare for shutdown; House GOP weighs next steps  —  The White House Office of Management and Budget alerted federal agencies Friday morning to prepare for an imminent government shutdown, according to two people familiar with the matter who spoke on the condition … ",
    "url": "https://www.washingtonpost.com/politics/2024/12/20/government-shutdown-bill-house-trump-musk/"
  },
  {
    "text": "Why Republicans will probably be blamed for a shutdown  —  The GOP has set about trying to blame Democrats, but it's clear which side is driving the harder bargain — and Americans don't like that.  —  The federal government has been hurtling toward a shutdown at midnight early Saturday ever since Elon Musk … ",
    "url": "https://www.washingtonpost.com/politics/2024/12/20/government-shutdown-republicans-johnson-blame-deal/"
  },
  {
    "text": "Johnson says plan C reached to avert shutdown, vote expected  —  Speaker Mike Johnson (R-La.) said Republicans have arrived at a plan C to avert a shutdown and the House will vote Friday morning on the legislation.  —  “Yeah, yeah, we have a plan,” Johnson said Friday morning as he entered the Capitol.",
    "url": "https://thehill.com/homenews/house/5050249-mike-johnson-house-republicans-plan-c-shutdown/"
  },
  {
    "text": "Elon Musk is becoming a one-man rogue state - it's time we reined him in  —  He has bankrolled elections, stoked riots and ignored laws.  We mustn't make the mistake of playing nice with the world's richest bully  —  Elon Musk is, more or less, a rogue state.",
    "url": "https://www.theguardian.com/commentisfree/2024/dec/20/elon-musk-is-becoming-a-one-man-rogue-state-its-time-we-reined-him-in"
  },
  {
    "text": "Elon Killed the Budget Deal.  Cancer Research for Kids Was Collateral Damage.  —  THE DECISION BY REPUBLICAN LEADERSHIP to scuttle a bipartisan funding deal on Thursday night has left lawmakers scrambling and others anxiously bracing for a government shutdown.",
    "url": "https://www.thebulwark.com/p/elon-musk-killed-budget-deal-children-cancer-funding-collateral-damage"
  },
  {
    "text": "Louisiana forbids public health workers from promoting COVID, flu and mpox shots  —  A group of high-level managers at the Louisiana Department of Health walked into a Nov. 14 meeting in Baton Rouge expecting to talk about outreach and community events.  —  Instead, they were told … ",
    "url": "https://www.npr.org/sections/shots-health-news/2024/12/20/nx-s1-5223440/louisiana-ban-public-health-promoting-covid-flu-mpox-vaccines-landry-rfk-jr-anti-vaccine"
  },
  {
    "text": "White House starts scrapping pending regulations, including student debt cancellation  —  President Joe Biden is abandoning his effort to cancel student loans for more than 38 million Americans, the first step in an administration-wide plan to jettison pending regulations … ",
    "url": "https://apnews.com/article/student-loan-forgiveness-debt-cancellation-619a94aa46c4e356f6d6cf7c6fa13e32"
  },
  {
    "text": "House GOP eyes plan C that cuts Trump debt ceiling demand  —  House Republicans are eyeing a new spending proposal that would tee up votes on three separate measures: to fund the government, appropriate disaster relief and allocate farm assistance, three sources told The Hill.",
    "url": "https://thehill.com/homenews/house/5050725-house-gop-government-funding-three-bills/"
  },
  {
    "text": "Oops.  Pentagon Undercounted Troops in Syria By More Than 100%  —  The Pentagon is famous for being unable to keep track of things.  Money?  Not sure where it went.  Inventory?  “We have stuff, but are not sure how much, where it is, or how much has disappeared.”  —  But soldiers in war zones?",
    "url": "https://hotair.com/david-strom/2024/12/20/oops-pentagon-undercounted-troops-in-syria-by-more-than-100-n3798060"
  },
  {
    "text": "Major Trump donors who complained of immigrant ‘invasion’ used Mexican workers illegally, sources allege  —  Exclusive: Experts believe the alleged ‘shuttle support’ program used by Uline - a company owned by billionaires Liz and Dick Uihlein - is likely illegal and exploitative of workers",
    "url": "https://www.theguardian.com/us-news/2024/dec/20/uline-mexican-workers-trump"
  },
  {
    "text": "Behind the Curtain: Media vs. reporting … We are also the government,\" Donald Trump Jr. tweeted yesterday to his 13 million followers.  — MAGA's online army now can assess “information rapidly & pressure our representatives to act in a manner that actually represents what we want,” Don Jr. added.",
    "url": "https://www.axios.com/2024/12/20/government-shutdown-media-vs-reporting-musk"
  },
  {
    "text": "Campus safety update  —  Dear fellow Patriots:  —  I am writing to update you on a new situation we are managing relative to a student who was recently arrested by the FBI, as it has caused security concerns among some members of the community that I want to address.",
    "url": "https://president.gmu.edu/news/2024-12/campus-safety-update"
  },
  {
    "text": "Judges increasingly alarmed as Trump's Jan. 6 clemency decision nears  —  “The rewriting of the history of Jan. 6, 2021, is incredibly disturbing,” Judge Beryl Howell said.  —  U.S. District Judge Tanya Chutkan says she has often reassured police officers traumatized by the violence of Jan. 6 … ",
    "url": "https://www.politico.com/news/2024/12/20/judges-trump-jan6-clemency-warnings-00195496"
  },
  {
    "text": "NDP Leader Singh Says He'll Vote to Topple Trudeau Government  —  A Canadian opposition leader said his caucus plans to vote against Justin Trudeau's government, a move that would plunge the country into an election early next year unless the prime minister seeks a temporary suspension of parliament.",
    "url": "https://www.bloomberg.com/news/articles/2024-12-20/ex-trudeau-ally-jagmeet-singh-says-he-ll-vote-to-bring-government-down"
  }
]