[
  {
    "text": "House GOP members seek to expel Gaetz amid renewed threat to vacate House Speaker McCarthy  —  House GOP members are preparing a motion to expel Rep. Matt Gaetz, R-Fla., amid his renewed threat to pursue a motion to vacate House Speaker Kevin McCarthy.  —  The House Republican members … ",
    "url": "https://www.foxnews.com/politics/house-gop-members-seek-expel-gaetz-renewed-threat-vacate-house-speaker-mccarthy"
  },
  {
    "text": "Gaetz's plan to oust McCarthy meets chilly Dem reception  —  Rep. Matt Gaetz (R-Fla.) wants to remove House Speaker Kevin McCarthy (R-Calif.) for working across the aisle to stop a government shutdown — but some Democrats are not on board. … - McCarthy responded in a CBS News interview that he will … ",
    "url": "https://www.axios.com/2023/10/01/matt-gaetz-kevin-mccarthy-removal-democrats"
  },
  {
    "text": "Playbook: Inside the chess match between McCarthy, Jeffries and Gaetz  —  Presented by With help from Eli Okun and Garrett Ross  —  DRIVING THE DAY  —  SPOTTED leaving the Capitol after the House CR vote: House Democratic leaders HAKEEM JEFFRIES, KATHERINE CLARK and PETE AGUILAR all laughing … ",
    "url": "https://www.politico.com/newsletters/playbook/2023/10/01/inside-the-chess-match-between-mccarthy-jeffries-and-gaetz-00119335"
  },
  {
    "text": "Matt Gaetz says he will attempt to oust Kevin McCarthy from the speakership this week  —  Rep. Matt Gaetz is planning to attempt to oust Speaker Kevin McCarthy from the role this week after the House leader worked with Democrats to avoid a government shutdown on Saturday.",
    "url": "https://www.cnn.com/2023/10/01/politics/house-republicans-infighting-matt-gaetz-kevin-mccarthy-shutdown/"
  },
  {
    "text": "AOC Says She Would ‘Absolutely’ Vote to Oust ‘Very Weak’ Speaker McCarthy  —  The congresswoman quipped that in attempting to avert a shutdown Republicans were “run[ning] around the House like a Roomba, until they found a door that House Democrats opened”  —  IN A RARE moment of unity … ",
    "url": "https://www.rollingstone.com/politics/politics-news/aoc-would-vote-to-oust-speaker-mccarthy-1234836365/"
  },
  {
    "text": "Scoop: Rep. Dean Phillips steps down from Dem leadership  —  Rep. Dean Phillips (D-Minn.) is stepping down from his role in House Democratic leadership after floating a primary challenge to President Biden. … - “I celebrate Leader Jeffries for his remarkable and principled leadership … ",
    "url": "https://www.axios.com/2023/10/01/dean-phillips-steps-down-dem-leadership-biden"
  },
  {
    "text": "Nikki Haley Says Trump's Campaign Sent Her A Birdcage  —  The move came after Trump dubbed her “birdbrain” after she criticized him at the second GOP primary debate.  —  LOADING  —  Former South Carolina Gov. Nikki Haley suggested Sunday that former President Donald Trump's campaign sent … ",
    "url": "https://www.huffpost.com/entry/nikki-haley-trump-birdcage_n_6519d208e4b05c5fe1b6cdbe"
  },
  {
    "text": "As His Fraud Trial Begins, Trump Looks to Capitalize on It  —  The former president is making the case to his supporters that he is being wrongfully prosecuted.  And it might bring him more support.  —  Former President Donald J. Trump is expected to attend the opening of the civil trial … ",
    "url": "https://www.nytimes.com/2023/10/01/us/politics/trump-fraud-trial.html"
  },
  {
    "text": "Police are searching for 9-year-old girl abducted from a New York campground  —  Charlotte Sena was last seen at Moreau Lake State Park in Saratoga County around 6:15 p.m. Saturday.  Police believe she's in “imminent danger of serious harm and/or death.”  —  New York State Police are searching … ",
    "url": "https://www.nbcnews.com/news/us-news/police-are-searching-9-year-old-girl-abducted-new-york-campground-rcna118282"
  },
  {
    "text": "Minnesota Twin Cities marathon canceled due to record-setting heat  —  Sunday in Minneapolis and St. Paul will be the hottest day of the week with record-setting temperatures possible in the afternoon, according to the National Weather Service.  —  The Medtronic Twin Cities Marathon … ",
    "url": "https://www.nbcnews.com/news/us-news/minnesota-twin-cities-marathon-canceled-due-record-setting-heat-rcna118268"
  },
  {
    "text": "One Reason the Trump Fever Won't Break  —  The more I consider the challenge posed by Christian nationalism, the more I think most observers and critics are paying too much attention to the wrong group of Christian nationalists.  We mainly think of Christian nationalism as a theology or at least as a philosophy.",
    "url": "https://www.nytimes.com/2023/10/01/opinion/christian-nationalism-trump-renew-america.html"
  },
  {
    "text": "‘Red Caesarism’ is rightwing code - and some Republicans are listening  —  Argument for a ‘red Caesar’ to rule US may seem esoteric but conservative thinktank behind idea has connections to Trump  —  In June, rightwing academic Kevin Slack published a book-length polemic claiming that ideas … ",
    "url": "https://www.theguardian.com/world/2023/oct/01/red-caesar-authoritarianism-republicans-extreme-right"
  },
  {
    "text": "Arnold Schwarzenegger Is Here to Pump You Up (Emotionally)  —  Arnold Schwarzenegger has been a part of the American landscape for so long that the improbability of his story is all too easy to take for granted: An immigrant bodybuilder from Austria with a long and unwieldy name … ",
    "url": "https://www.nytimes.com/interactive/2023/10/01/magazine/arnold-schwarzenegger-interview.html"
  },
  {
    "text": "The Case for Amplifying Trump's Insanity  —  The “Banality of Crazy” has warped American politics, as few voters recognize just how deranged, delusional, and dangerous Donald Trump is...because the press rarely reports on his routine insanity. … Sometimes, you have to write when you're angry.",
    "url": "https://www.forkingpaths.co/p/the-case-for-amplifying-trumps-insanity"
  }
]