[
  {
    "text": "Playbook: Look who's pushing for a Trump reset  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  QUOTE OF THE DAY — A senior administration official to WSJ's Alex Ward and Nancy Youssef on the possibility of an Iranian attack on Israel … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/08/15/look-whos-pushing-for-a-trump-reset-00174134"
  },
  {
    "text": "Robert F. Kennedy Jr. tried to meet with Kamala Harris to discuss Cabinet job  —  Harris has rebuffed the offer of an endorsement, while Kennedy has also had conversations with Republican nominee Donald Trump about a role in his administration.  —  Independent presidential candidate Robert … ",
    "url": "https://www.washingtonpost.com/politics/2024/08/14/rfk-jr-kamala-harris-cabinet-trump/"
  },
  {
    "text": "Republicans tell Trump to focus on issues, not “crowd sizes.”  Project 2025 shows that will backfire  —  There's a reason Trump's team wants to hide his policy agenda: Voters hate his plans as much as his personality  —  Donald Trump beat Nikki Haley in the Republican primary by repeatedly calling her … ",
    "url": "https://www.salon.com/2024/08/15/tell-to-focus-on-issues-not-crowd-sizes-project-2025-shows-that-will-backfire/"
  },
  {
    "text": "August 2024 National Poll: Harris 50%, Trump 46%  —  Home Polls August 2024 National Poll: Harris 50%, Trump 46%  —  Independents, Younger Voters Swing Toward Harris  —  The first Emerson College Polling national survey following President Biden's decision not to seek re-election finds … ",
    "url": "https://emersoncollegepolling.com/august-2024-national-poll-harris-50-trump-46/"
  },
  {
    "text": "Franklin & Marshall Poll Release: August 2024  —  I'm writing to share our summary report for the August 2024 Franklin & Marshall College Poll.  I've highlighted a few of the key findings below, but I encourage you to read the full report, which is also included.",
    "url": "https://www.fandmpoll.org/franklin-marshall-poll-release-august-2024/"
  },
  {
    "text": "White House says deals struck to cut prices of popular Medicare drugs that cost $50 billion yearly  —  WASHINGTON (AP) — The Biden administration is taking a victory lap after federal officials inked deals with drug companies to lower the price for 10 of Medicare's most popular and costliest drugs … ",
    "url": "https://apnews.com/article/biden-drug-prices-medicare-prescriptions-34886d6f362c242be268c05d5efd5411"
  },
  {
    "text": "The Saudi Payments to Trump Are More Important than the Suspected Egyptian One  —  As you know, I was calling on the press to focus on the suspected $10 million payment Egypt made to Trump since before it was cool — since even before the WaPo significantly advanced the story over a month later.",
    "url": "https://www.emptywheel.net/2024/08/15/the-saudi-payments-to-trump-are-more-important-than-the-suspected-egyptian-one/"
  },
  {
    "text": "Zelensky says Ukraine has captured key Russian town  —  Video Player is loading.  —  Play Video  —  Unmute  —  Current Time 0:00  —  Loaded: 0%  —  Stream Type LIVE  —  Seek to live, currently behind liveLIVE  —  Playback Rate  —  Chapters  — Chapters  —  Descriptions",
    "url": "https://thehill.com/policy/defense/4829130-ukraine-captures-sudzha-russian-kursk/"
  },
  {
    "text": "Why Facebook blocked Popular Information's reporting on Laura Loomer  —  Yesterday, Popular Information published a detailed report on the close relationship between former President Donald Trump and Laura Loomer, a far-right conspiracy theorist who says America should be a “white Judeo-Christian ethnostate.”",
    "url": "https://popular.info/p/update-why-facebook-blocked-popular"
  },
  {
    "text": "Trump seeks to delay his hush money sentencing until after the election  —  His lawyers are seeking to have the conviction overturned on immunity grounds.  —  NEW YORK — Attorneys for Donald Trump asked the judge overseeing the former president's Manhattan criminal case to postpone his sentencing … ",
    "url": "https://www.politico.com/news/2024/08/15/trump-seeks-delay-to-hush-money-sentencing-00174157"
  },
  {
    "text": "JD Vance: ‘Whole Purpose Of The Postmenopausal Female’ Is To Care For Grandkids  —  JD Vance once said one of the best things for the economy is the “postmenopausal female” because her purpose in life is to provide free childcare.  —  The comments were revealed Wednesday in newly resurfaced audio from 2020 … ",
    "url": "https://www.ibtimes.com/jd-vance-postmenopausal-female-economy-3739794"
  },
  {
    "text": "The case for Harris embracing nationwide free school meals  —  It's good policy and good politics. … Last weekend at a rally in Las Vegas, Kamala Harris announced one of her first explicit new policy positions: a plan to “eliminate taxes on tips for service and hospitality workers.”",
    "url": "https://www.publicnotice.co/p/kamala-harris-walz-free-school-meals-nationwide"
  },
  {
    "text": "Nevada Senate Race Now Favors Democrat, Report Says  —  The nonpartisan Cook Political Report moved the race from “tossup” to “lean Democrat” after polling shows Senator Jacky Rosen with a large edge.  —  Senator Jacky Rosen of Nevada, a Democrat seeking re-election to her seat for the first time … ",
    "url": "https://www.nytimes.com/2024/08/15/us/politics/jacky-rosen-nevada-senate.html"
  },
  {
    "text": "When Is “Recyclable” Not Really Recyclable?  When the Plastics Industry Gets to Define What the Word Means.  —  Companies whose futures depend on plastic production are trying to persuade the federal government to allow them to put the label “recyclable” on plastic shopping bags … ",
    "url": "https://www.propublica.org/article/plastics-industry-redefine-recyclable-ftc-grocery-bags"
  },
  {
    "text": "Tim Walz's 2006 campaign falsely described details about his arrest for DWI in 1995  —  When Democratic vice presidential nominee Tim Walz first ran for Congress in 2006, his campaign repeatedly made false statements about the details of his 1995 arrest for drunk and reckless driving.",
    "url": "https://www.cnn.com/2024/08/15/politics/tim-walz-2006-campaign-falsely-described-dwi-kfile/"
  },
  {
    "text": "JD Vance: Amazon funded Black Lives Matter so riots would destroy rival retailers  —  Loading...  WASHINGTON  —  In 2021, J.D. Vance gave a speech to a conservative think tank on “woke capital” - and accused Amazon of funding Black Lives Matter in order to burn down the competition.",
    "url": "https://www.csmonitor.com/USA/Politics/2024/0815/jd-vance-speech-bezos-amazon-abortion"
  },
  {
    "text": "Ex-Google CEO says successful AI startups can steal IP and hire lawyers to ‘clean up the mess’ … Former Google CEO and chairman Eric Schmidt has made headlines for saying that Google was blindsided by the early the rise of ChatGPT because its employees decided that “working from home was more important than winning.”",
    "url": "https://www.theverge.com/2024/8/14/24220658/google-eric-schmidt-stanford-talk-ai-startups-openai"
  },
  {
    "text": "George Helmy will be new U.S. Senator from New Jersey  —  Gov. Phil Murphy intends to appoint George S. Helmy, his former chief of staff, to the United States Senate to replace Bob Menendez, the New Jersey Globe has confirmed.  —  Murphy is expected to formally offer Helmy the post on Thursday … ",
    "url": "https://newjerseyglobe.com/congress/george-helmy-will-be-new-u-s-senator-from-new-jersey/"
  }
]