[
  {
    "text": "Justice Samuel Alito absent from Supreme Court session for second day in a row  —  Justice Samuel Alito was not present on Friday morning as the Supreme Court handed down opinions in the courtroom, the second day in a row he has been absent.  —  Alito's absence, for which the Supreme Court … ",
    "url": "https://www.cnn.com/2024/06/21/politics/samuel-alito-not-present-supreme-court/"
  },
  {
    "text": "“Alarm bells about Obergefell”: Sotomayor pens blistering dissent on SCOTUS marriage attack  —  Sotomayor warned gay marriage could be next as her colleagues gutted a U.S. citizen's right to marry a non-citizen  —  Supreme Court Justice Sonia Sotomayor used her dissent in a case that struck … ",
    "url": "https://www.salon.com/2024/06/21/alarm-bells-about-obergefell-sotomayor-pens-blistering-dissent-on-scotus-marriage/"
  },
  {
    "text": "Sotomayor Issues Dire Warning on Supreme Court Ruling on Noncitizens … In a ruling delivered Friday, the Supreme Court decided 6-3 that U.S. citizens have no constitutional interest in their noncitizen spouses being able to enter the United States—despite the fact that a married person … ",
    "url": "https://newrepublic.com/post/182960/supreme-court-sotomayor-non-citizens-marriage-munoz-obergefell"
  },
  {
    "text": "Judge dismisses Nevada fake electors case over lack of jurisdiction  —  Judge Mary Kay Holthus ruled that Clark County was not an appropriate place to decide the case.  —  Courts Election 2020  —  A Clark County judge has dismissed the charges filed against the six Nevada Republicans … ",
    "url": "https://thenevadaindependent.com/article/judge-dismisses-nevada-fake-electors-case-over-lack-of-jurisdiction"
  },
  {
    "text": "Judge dismisses charges in Nevada fake electors case over venue question, attorney general to appeal  —  A judge in Las Vegas dismissed an indictment Friday against six Republicans accused of submitting certificates to Congress falsely declaring Donald Trump the winner of the state's 2020 … ",
    "url": "https://apnews.com/article/nevada-republicans-fake-electors-indictment-trump-9d06ffc619314f85e0bdb321b820a557"
  },
  {
    "text": "Judge Cannon wants to know whether Merrick Garland is supervising Jack Smith  —  The judge in Donald Trump's classified documents case asked lawyers how much independence the special counsel has.  —  FORT PIERCE, Florida — The federal judge overseeing Donald Trump's classified documents … ",
    "url": "https://www.politico.com/news/2024/06/21/trump-classified-documents-cannon-garland-smith-00164541"
  },
  {
    "text": "60 years ago today, they murdered my protector  —  I've shared some of this with you, but today marks 60 years since it happened — when the Klan murdered my protector.  —  I was always the shortest kid in school, which made me an easy target for bullies.  To protect myself … ",
    "url": "https://robertreich.substack.com/p/60-years-ago-today-they-murdered"
  },
  {
    "text": "Trump Mega Donor Miriam Adelson Opens Up Cash Spigot  —  MONEY, MONEY, MONEY  —  After sitting out the Republican primary, the fifth-richest woman in America has given money to Trump and to House and Senate Republicans including Ted Cruz.  —  Republican mega-donor Miriam Adelson … ",
    "url": "https://www.thedailybeast.com/trump-mega-donor-miriam-adelson-opens-up-cash-spigot"
  },
  {
    "text": "What the Hell Is Going on With the Supreme Court's Trump Ruling?  —  BEHIND THE SCENES  —  The court's deadline to release a decision is next Friday, June 28, but there are fears the conservative majority may have something more sinister up their sleeve.  —  The Supreme Court released … ",
    "url": "https://www.thedailybeast.com/what-the-hell-is-going-on-with-the-supreme-courts-trump-immunity-ruling"
  },
  {
    "text": "‘Florida loves prison labor’: why most incarcerated people still work for free in the Sunshine state  —  Many prisoners clean toilets and prep food with no pay - as the state charges $50 a day for their incarceration  —  A $9bn food services company is using prisoners to make meals … ",
    "url": "https://www.theguardian.com/us-news/article/2024/jun/21/florida-unpaid-prison-labor"
  },
  {
    "text": "How Misleading Videos Are Trailing Biden as He Battles Age Doubts  —  A flurry of recent clips, many of them edited or lacking context, laid bare a major challenge for the president as he tries to persuade voters he has the energy for a second term.  —  President Biden has many adversaries in this year's election.",
    "url": "https://www.nytimes.com/2024/06/21/us/politics/biden-age-videos.html"
  },
  {
    "text": "Biden vs. Trump: Will the First 2024 Debate Jolt the Race?  —  Is the election a choice between the two, or purely a referendum on the president?",
    "url": "https://www.wsj.com/politics/elections/biden-vs-trump-will-the-first-2024-debate-jolt-the-race-9edc9419"
  },
  {
    "text": "Kyle Rittenhouse's Family: We're His Collateral Damage  —  ROGUE SON  —  The far-right darling is accused of leaving his mom and sister high and dry as they fight eviction.  —  Kyle Rittenhouse has been publicly dragged by his own family, who say the far-right darling left them high and dry … ",
    "url": "https://www.thedailybeast.com/kyle-rittenhouses-family-publicly-throws-him-under-the-bus"
  },
  {
    "text": "On the House Floor, Republicans Gag Mentions of Trump's Conviction  —  During official proceedings of the G.O.P.-controlled chamber, speaking about former President Donald J. Trump's felony conviction has been forbidden, while disparaging President Biden and Democrats is routine.",
    "url": "https://www.nytimes.com/2024/06/21/us/politics/house-republicans-trump.html"
  },
  {
    "text": "Amid GOP infighting, judge strips Ohio House speaker of control over Republican caucus campaign fund  —  A county judge stripped Republican Ohio House Speaker Jason Stephens of his control over the GOP caucus' campaign fund on Friday, escalating intraparty tensions in the chamber headed into November's election.",
    "url": "https://apnews.com/article/ohio-house-speaker-gop-caucus-campaign-fund-d654fce42b9e877d4e6dac56bcb0c6fb"
  },
  {
    "text": "ObamaCare preventive care mandate to stay in place after court ruling  —  A federal appeals court ruled Friday that a Christian-owned business can't be compelled to cover preventive medications as is required under the Affordable Care Act (ACA), but it determined a Texas judge carried out an … ",
    "url": "https://thehill.com/policy/healthcare/4733629-obamacare-preventive-care-mandate-to-stay-in-place-after-court-ruling/"
  },
  {
    "text": "A surprising winner in the Supreme Court gun ruling: Hunter Biden  —  The court's decision Friday involves a sister provision to the drug-users prohibition that Biden was found guilty of violating.  —  As the president's son prepares to appeal his recent conviction, he will likely renew … ",
    "url": "https://www.politico.com/news/2024/06/21/hutner-biden-supreme-court-rahimi-ruling-00164480"
  },
  {
    "text": "Upside-down American flag flying outside Etna Township trustee's home angers local vets  —  An upside-down American flag, a symbol connected with false claims that the 2020 election was stolen from former President Donald Trump, has been flying outside an elected official's Licking County home in recent weeks.",
    "url": "https://www.dispatch.com/story/news/local/2024/06/21/vets-criticize-etna-trustee-over-upside-down-flag-flying-at-her-home/74157096007/"
  },
  {
    "text": "Israeli Official Describes Secret Government Bid to Cement Control of West Bank  —  Israeli judges have long ruled that Israel's control of the territory is a temporary military occupation and complies with international law.  A powerful minister's recent speech, caught on tape, suggested the government is trying to change that.",
    "url": "https://www.nytimes.com/2024/06/21/world/middleeast/israel-west-bank-netanyahu-bezalel-smotrich.html"
  },
  {
    "text": "US farmers turn towards Biden over Trump's past agricultural policies  —  A growing number of rural Americans now plan to vote for Biden, fearing Trump could cost farmers again  —  For two decades, Christopher Gibbs, a row crop and cattle farmer in Shelby county, Ohio, was an ardent Republican party member.",
    "url": "https://www.theguardian.com/us-news/article/2024/jun/21/trump-biden-agriculture-policies"
  },
  {
    "text": "Trump's Not ‘Bluffing’: Inside the MAGA Efforts To Make a Second Term Even More Extreme  —  “Yes, we do really want to burn it all down,” a Republican close to Trump tells Rolling Stone … That's the message one close Trump adviser and former administration official … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-not-bluffing-maga-extreme-second-term-1235044464/"
  }
]