[
  {
    "text": "Meta Deletes Trans and Nonbinary Messenger Themes  —  Meta deleted nonbinary and trans themes for its Messenger app this week, around the same time that the company announced it would change its rules to allow users to declare that LGBTQ+ people are “mentally ill,” 404 Media has learned.",
    "url": "https://www.404media.co/meta-deletes-trans-and-nonbinary-messenger-themes/"
  },
  {
    "text": "Inside Mark Zuckerberg's Sprint to Remake Meta for the Trump Era  —  After visiting President-elect Donald J. Trump in November, Mr. Zuckerberg decided to relax Meta's speech policies.  He asked a small team to carry out his goals within weeks.  The repercussions are just beginning.",
    "url": "https://www.nytimes.com/2025/01/10/technology/meta-mark-zuckerberg-trump.html?unlocked_article_code=1.oE4.jwD6.Qu-_MhilMnvv&smid=url-share"
  },
  {
    "text": "Meta never cared about factchecking.  What it wants is friction-free oligarchy  —  The company's plan to end its factchecking program is about appeasing Trump.  That signals the making of a mafia state  —  This week Meta announced the elimination of its factchecking program in the US … ",
    "url": "https://www.theguardian.com/commentisfree/2025/jan/10/meta-factchecking-donald-trump"
  },
  {
    "text": "Live Updates: Trump to Be Sentenced in N.Y. Criminal Case  —  The proceedings are set to begin at 9:30 a.m. in Manhattan.  Though the president-elect is expected to avoid jail time, his sentencing on 34 counts will formalize his status as a felon and make him the first to carry that distinction into the White House.",
    "url": "https://www.nytimes.com/live/2025/01/10/nyregion/trump-hush-money-sentencing?unlocked_article_code=1.oE4.Lfvj.59La0Pj1ELhH&smid=url-share"
  },
  {
    "text": "Exclusive: Meta kills DEI programs … - The moves come just three days after Meta ended many of its efforts to fact-check and police speech on Facebook, Instagram and Threads.  — The announcement also follows a host of public moves by tech companies and executives to align with the politics … ",
    "url": "https://www.axios.com/2025/01/10/meta-dei-programs-employees-trump"
  },
  {
    "text": "Read: Meta's memo to employees rolling back DEI programs",
    "url": "https://www.axios.com/2025/01/10/meta-dei-memo-employees-programs"
  },
  {
    "text": "House GOP puts Medicaid, ACA, climate measures on chopping block  —  The menu of potential spending offsets has been circulated by House Budget Chair Jodey Arrington.  —  House Republicans are passing around a “menu” of more than $5 trillion in cuts they could use to bankroll President-elect … ",
    "url": "https://www.politico.com/news/2025/01/10/spending-cuts-house-gop-reconciliation-medicaid-00197541"
  },
  {
    "text": "Will Trump Just Let California Burn?  —  Right now, as Los Angeles deals with a horrendous wildfire emergency, Donald Trump is just an extremely unhelpful critic of the people trying to save lives and homes.  The torrent of abuse and misinformation he is spewing is unfortunate but not calamitous.",
    "url": "https://nymag.com/intelligencer/article/will-trump-just-let-california-burn.html"
  },
  {
    "text": "DOGE is dispatching agents across U.S. government  —  Federal officials are already dealing with surrogates from Elon Musk and Vivek Ramaswamy's nongovernmental body before Donald Trump is sworn in again.  —  Elon Musk and Vivek Ramaswamy are sending representatives to agencies across … ",
    "url": "https://www.washingtonpost.com/business/2025/01/10/musk-ramaswamy-doge-federal-agencies/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM2NDg1MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM3ODY3NTk5LCJpYXQiOjE3MzY0ODUyMDAsImp0aSI6ImRhY2Q0MmI5LWM5NjEtNGM1ZS05YWU4LWNiNTBlNjM3NTI0NyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9idXNpbmVzcy8yMDI1LzAxLzEwL211c2stcmFtYXN3YW15LWRvZ2UtZmVkZXJhbC1hZ2VuY2llcy8ifQ.SPfFh8QQmh7CW5xnX93Txv0_sUOA_AFxK_KUkCFRgO4&itid=gfta"
  },
  {
    "text": "DHS extends TPS for Salvadorans, potentially complicating Trump's plans  —  The Biden administration on Friday extended a key humanitarian program for El Salvadoran nationals in a move that could complicate the incoming Trump administration's plans to do away with long-term immigrant protections.",
    "url": "https://thehill.com/latino/5079024-dhs-tps-el-salvadora-trump-immigration-crackdown/"
  },
  {
    "text": "State to probe why Pacific Palisades reservoir was offline, empty when firestorm exploded  —  A large reservoir in Pacific Palisades that is part of the Los Angeles water supply system was out of use when a ferocious wildfire destroyed thousands of homes and other structures nearby, the Los Angeles Times found.",
    "url": "https://www.latimes.com/california/story/2025-01-10/as-flames-raged-in-palisades-a-key-reservoir-nearby-was-offline"
  },
  {
    "text": "Rudy Giuliani held in contempt for second time this week  —  Federal judge rips into Guiliani over “fabricated lies.”  —  A federal judge has held Rudy Giuliani in contempt for continuing to falsely accuse two Georgia women of election fraud in 2020, breaching a court order against further attacking … ",
    "url": "https://www.politico.com/news/2025/01/10/rudy-giuliani-contempt-second-time-defamation-case-00197627"
  },
  {
    "text": "Drone collides with firefighting plane during Los Angeles wildfires  —  A drone crashed into a firefighting aircraft near the California Palisades fire Thursday, the Federal Aviation Administration announced.  —  The aircraft landed safely but sustained wing damage, and it is out of service.",
    "url": "https://www.washingtonexaminer.com/policy/energy-and-environment/3283207/drone-collides-firefighting-plane-los-angeles-wildfires/"
  },
  {
    "text": "Gabbard reverses course on key intel-gathering tool as nomination teeters … In her first public comments since being nominated, Gabbard told us in an exclusive statement that she now supports Section 702, saying the program is “crucial” and “must be safeguarded to protect our nation while ensuring the civil liberties of Americans.”",
    "url": "https://punchbowl.news/article/senate/gabbard-changes-stance-on-section-702/"
  },
  {
    "text": "A time for truth and reconciliation  —  Trump's return to the White House augurs the ‘apokálypsis’ of the ancien regime's secrets  —  The writer is a technology entrepreneur and investor.  —  In 2016, President Barack Obama told his staff that Donald Trump's election victory was “not the apocalypse”.",
    "url": "https://www.ft.com/content/a46cb128-1f74-4621-ab0b-242a76583105"
  },
  {
    "text": "As a Climate Scientist, I Knew It Was Time to Leave Los Angeles  —  I am utterly devastated by the Los Angeles wildfires, shaking with rage and grief.  The Altadena community near Pasadena, where the Eaton fire has damaged or destroyed at least 5,000 structures, was my home for 14 years.",
    "url": "https://www.nytimes.com/2025/01/10/opinion/la-fires-los-angeles-wildfires.html?unlocked_article_code=1.oE4.wlwn.9-ljiFqRbGB9&smid=bs-share"
  },
  {
    "text": "US adds whopping 256K jobs in December  —  The U.S. added 256,000 jobs and the unemployment rate ticked down to 4.1 percent in December, according to data released Friday by the Labor Department.  —  The December jobs report showed the U.S. economy blowing past expectations to end the year.",
    "url": "https://thehill.com/business/5078668-us-adds-whopping-256k-jobs-in-december/"
  },
  {
    "text": "Vince McMahon, SEC reach $1.7M settlement over hush money payments  —  World Wrestling Entertainment (WWE) co-founder Vince McMahon reached a settlement with the Securities and Exchange Commission (SEC) on Friday for failing to disclose two payments made on behalf of himself and the company.",
    "url": "https://thehill.com/business/5080048-vince-mcmahon-sec-reach-1-7m-settlement-over-hush-money-payments/"
  },
  {
    "text": "Trump can still vote after sentencing, but can't own a gun and will have to turn over DNA sample  —  President-elect Donald Trump doesn't have to go to jail, pay a fine or perform community service as a result of his New York hush money conviction.  A judge ended the case Friday with a sentence … ",
    "url": "https://apnews.com/article/trump-hush-money-felon-rights-708d782fe985f2c08d7b82ef13f17dd9"
  },
  {
    "text": "Barry Blitt's “Two's a Crowd”  —  Elon Musk takes center stage.  —  In cartoonist Barry Blitt's portrayal of the upcoming Inauguration Day, the new President is sidelined into a dash of yellow hair and a sliver of red tie.  “On January 20, 2025, the next leader of the United States—and of the free world—assumes power,” Blitt said.",
    "url": "https://www.newyorker.com/culture/cover-story/cover-story-2025-01-20"
  },
  {
    "text": "Readout of President Biden's Call with President Zelenskyy of Ukraine  —  President Joseph R. Biden, Jr. spoke today with President Volodymyr Zelenskyy of Ukraine to discuss U.S. support for Ukraine in its courageous defense against Russian aggression.  President Biden updated President Zelenskyy … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2025/01/10/readout-of-president-bidens-call-with-president-zelenskyy-of-ukraine-16/"
  },
  {
    "text": "2024 first year to pass 1.5C global warming limit  —  BBC Climate & Verify data journalism teams  —  The planet has moved a major step closer to warming more than 1.5C, new data shows, despite world leaders vowing a decade ago they would try to avoid this.",
    "url": "https://www.bbc.com/news/articles/cd7575x8yq5o"
  },
  {
    "text": "Mike Johnson Seeks Money From Democratic Bill He Called ‘Legislative Malpractice’  —  The House speaker opposed the Inflation Reduction Act and has vowed to roll it back.  But he's quietly urging the EPA to give his district a grant funded by the law.  —  LOADING",
    "url": "https://www.huffpost.com/entry/mike-johnson-inflation-reduction-act-grant_n_6781505de4b03b195d664a4a"
  },
  {
    "text": "University of West Florida braces for leadership changes  —  The University of West Florida is bracing for significant changes in leadership following a wave of new appointments to its Board of Trustees.  —  Over the past month, the Florida Board of Governors replaced three trustees … ",
    "url": "https://www.wuwf.org/local-news/2025-01-08/university-of-west-florida-braces-for-leadership-changes"
  },
  {
    "text": "We've Never Been Here Before: The Zero-Accountability Presidency … So here we are, at another one of those Trump moments that by now can only be called boringly surreal: The president-elect was sentenced Friday in New York in the hush-money trial, 10 days before taking the oath of office.",
    "url": "https://newrepublic.com/post/190086/trump-zero-accountability-presidency"
  },
  {
    "text": "The Trumps Are in Talks to Reclaim Their Prized D.C. Hotel  —  The family firm is looking for a hotel in the capital as Trump prepares to return to the White House  —  Donald Trump's real-estate company is in talks to reclaim its former Washington, D.C., hotel, a move that could offer … ",
    "url": "https://www.wsj.com/real-estate/trump-dc-hotel-sale-white-house-return-0a4ba019?st=qa9Bfg&reflink=article_copyURL_share"
  },
  {
    "text": "'He's compromised'—NYC Dems Fear Mayor Will Trade Deportations For Trump Pardon  —  Eric Adams is politically vulnerable, under indictment, and has just one card left to play.  —  WHEN ERIC ADAMS HIT THE FAMED Apollo theater in Harlem on Thursday for his State of the City address … ",
    "url": "https://www.thebulwark.com/p/hes-compromisednyc-dems-fear-mayor"
  },
  {
    "text": "Supreme Court Rebuke of Trump on Sentencing Shows Its Divisions  —  Two Republican appointees, Chief Justice Roberts and Justice Barrett, joined the court's three liberals in ordering the president-elect to face sentencing on Friday.  —  The Supreme Court's rejection on Thursday … ",
    "url": "https://www.nytimes.com/2025/01/09/us/supreme-court-trump-hush-money.html"
  }
]