[
  {
    "text": "Johnson's margin drops to one vote as Gallagher heads for early exit  —  Allies of the Wisconsin Republican say he was long jaded by the antics of the House following the ouster of Speaker Kevin McCarthy.",
    "url": "https://www.politico.com/live-updates/2024/03/22/congress/gallagher-leaving-early-00148586"
  },
  {
    "text": "Republican Rep. Mike Gallagher will resign early, leaving House majority hanging by a thread  —  House Republicans lost another member in Rep. Ken Buck, R-Colo., on Friday.  Gallagher's early departure could leave Republicans with just one vote to spare on legislation.",
    "url": "https://www.nbcnews.com/politics/congress/republican-mike-gallagher-resign-early-house-majority-shrinks-rcna144672"
  },
  {
    "text": "Marjorie Taylor Greene files motion to remove Speaker Mike Johnson … - Johnson's predecessor, Rep. Kevin McCarthy (R-Calif.), became the first House speaker to be ousted after hardline Republicans triggered a motion to vacate against him last year.  — Greene's move came after she voiced … ",
    "url": "https://www.axios.com/2024/03/22/majorie-taylor-greene-mike-johnson-vacate-motion"
  },
  {
    "text": "MTG Officially Launches Revolt Against Speaker Mike Johnson  —  On Friday, Rep. Marjorie Taylor Greene (R-GA) filed a motion to force a vote on Mike Johnson's removal from the speakership.  —  It's anarchy again in the House GOP.  —  On Friday, Rep. Marjorie Taylor Greene (R-GA) … ",
    "url": "https://www.thedailybeast.com/marjorie-taylor-greene-officially-launches-motion-to-vacate-revolt-against-speaker-mike-johnson"
  },
  {
    "text": "House Passes Spending Bill to Avert Shutdown, Prompting G.O.P. Mutiny  —  The bipartisan vote split Republicans and prompted a threat to oust Speaker Mike Johnson.  It was not clear whether Senate Republicans would allow the spending measure to pass in time to avoid a shutdown.",
    "url": "https://www.nytimes.com/2024/03/22/us/politics/congress-spending-bill-government-shutdown.html"
  },
  {
    "text": "Trump is about to get $3 billion richer after deal is approved to take his company public.  But it won't solve his cash crunch  —  Investors have approved a deal on Friday to make Truth Social owner Trump Media a publicly traded company.  —  The green light from shareholders clears … ",
    "url": "https://www.cnn.com/2024/03/22/business/trump-truth-social-dwac-shares"
  },
  {
    "text": "The Publicly-Traded Presidential Candidate  —  We've all been focused lately on a question appropriate for Schadenfriday: How is Donald Trump going to post a $450+ million bond to cover his appeal in the New York civil fraud case?  The clock is ticking, and Trump claims he doesn't have the ability to post it.",
    "url": "https://statuskuo.substack.com/p/the-publicly-traded-presidential"
  },
  {
    "text": "Moscow concert attack live updates: Dozens reported dead after shooting  —  What we know about the Moscow concert attack … Public events across Russia called off after attack  —  Several regional leaders across Russia, including in the annexed Kherson region of Ukraine … ",
    "url": "https://www.nbcnews.com/news/world/live-blog/russia-moscow-concert-attack-shooting-rcna144706"
  },
  {
    "text": "Terrorist attack at concert hall outside Moscow Latest updates … a few seconds ago  —  Putin recently dismissed U.S. warning of potential terrorist attacks in Moscow  —  On March 19, Vladimir Putin dismissed warnings from U.S. diplomats that there was an imminent risk of a terrorist attack at a crowded venue in Moscow.",
    "url": "https://meduza.io/en/live/2024/03/22/terrorist-attack-at-concert-hall-outside-moscow"
  },
  {
    "text": "Ronna McDaniel, Former R.N.C. Chair, Joins NBC News  —  Her new role as a commentator on NBC and MSNBC programs comes shortly after she stepped down as the leader of the Republican National Committee.  —  Ronna McDaniel, who stepped down as chairwoman of the Republican National Committee this month … ",
    "url": "https://www.nytimes.com/2024/03/22/business/media/ronna-mcdaniel-nbc-msnbc.html"
  },
  {
    "text": "NBC hires former RNC chair Ronna McDaniel, who has demonized the press and refused to acknowledge Biden was fairly elected  —  NBC News on Friday announced that it had hired Ronna McDaniel, the former Republican National Committee chair who has repeatedly attacked the network and its journalists … ",
    "url": "https://www.cnn.com/2024/03/22/media/ronna-mcdaniel-nbc/"
  },
  {
    "text": "We Have Met the Enemy and He Owns the Valet Booth at Trump Tower  —  As we can see, the New York State civil judgment against Donald Trump, totaling roughly $450 million, and Trump's seeming inability to post a bond for the amount in order to appeal the judgment, is the real deal.",
    "url": "https://talkingpointsmemo.com/edblog/we-have-met-the-enemy-and-he-owns-the-valet-booth-at-trump-tower/sharetoken/3jTLuWi6kWgZ"
  },
  {
    "text": "Fox News' demands to impeach Biden blew up in the GOP's face  —  The network deserves a big share of the blame for leading Republicans into this debacle.  —  It's time to call it: The House GOP's shambolic inquiry into the impeachment of President Joe Biden expired on Wednesday night … ",
    "url": "https://www.msnbc.com/opinion/msnbc-opinion/fox-news-sean-hannity-biden-impeachment-rcna144499"
  },
  {
    "text": "F.B.I. Tells Passengers on Alaska Flight They May Have Been Crime Victims  —  Letters sent by the bureau's Seattle office are a sign that the Justice Department's investigation into Boeing, the maker of the plane whose fuselage panel blew off, is ramping up.",
    "url": "https://www.nytimes.com/2024/03/22/us/politics/fbi-investigation-boeing.html"
  },
  {
    "text": "CNN Polls: Majority of voters in Michigan and Pennsylvania are dissatisfied with their presidential choices  —  Voters in Michigan and Pennsylvania - two states that flipped from red to blue in the 2020 presidential election - begin this year's general election campaign more dissatisfied … ",
    "url": "https://www.cnn.com/2024/03/22/politics/cnn-poll-michigan-pennsylvania/"
  },
  {
    "text": "Exclusive: Texas AG Ken Paxton could see criminal charges dropped in deal with prosecutors  —  Felony charges would be erased in exchange for community service and six-figure restitution.  —  Texas Attorney General Ken Paxton is nearing a resolution to the 9-year-old securities fraud charges … ",
    "url": "https://www.statesman.com/story/news/state/2024/03/22/ken-paxton-securities-fraud-case-felony-charges-texas-ag-plea-negotiation/72960517007/"
  },
  {
    "text": "Users shocked to find Instagram limits political content by default  —  Instagram never directly told users it was limiting political content by default.  —  Instagram users have started complaining on X (formerly Twitter) after discovering that Meta has begun limiting recommended political content by default.",
    "url": "https://arstechnica.com/tech-policy/2024/03/instagram-users-outraged-by-app-limiting-political-content-ahead-of-elections/"
  },
  {
    "text": "House Dems could have Johnson's back on ouster threat — if Ukraine aid gets a vote  —  All Democrats had previously voted to oust McCarthy along with a group of Republicans last fall.",
    "url": "https://www.politico.com/live-updates/2024/03/22/congress/dems-could-back-mike-johnson-motion-vacate-house-00148564"
  }
]