[
  {
    "text": "As top Trump aides sent texts on Signal, flight data show a member of the group chat was in Russia  —  President Trump's Ukraine and Middle East envoy Steve Witkoff was in Moscow, where he met with Russian President Vladimir Putin, when he was included in a group chat with more than a dozen … ",
    "url": "https://www.cbsnews.com/news/trump-envoy-steve-witkoff-signal-text-group-chat-russia-putin/"
  },
  {
    "text": "Trump stands by national security adviser despite leaked military plans, saying mishap had ‘no impact’ on Yemen strikes  —  “Michael Waltz has learned a lesson, and he's a good man,” President Donald Trump said of his national security adviser in a Tuesday phone interview with NBC News.",
    "url": "https://www.nbcnews.com/politics/white-house/trump-stands-national-security-adviser-leaked-military-plans-saying-mi-rcna197944"
  },
  {
    "text": "Days after the Signal leak, the Pentagon warned the app was the target of hackers  —  Several days after top national security officials accidentally included a reporter in a Signal chat about bombing the Houthi sites in Yemen, a Pentagon-wide advisory warned against using the messaging app, even for unclassified information.",
    "url": "https://www.npr.org/2025/03/25/nx-s1-5339801/pentagon-email-signal-vulnerability"
  },
  {
    "text": "'It's so unbelievable': Cyber world stunned over war planners using Signal  —  Regardless of app security, experts say communicating the military plans of the U.S. government in a non-classified space creates a massive security vulnerability.  —  Lawmakers and experts are sounding the alarm … ",
    "url": "https://www.politico.com/news/2025/03/25/signal-cybersecurity-trump-war-planning-00246881"
  },
  {
    "text": "It's a thousand times worse than you think  —  Whiskeyleaks seems appropriate  —  The explosive news broke yesterday that National Security Advisor Michael Waltz had opened a Signal group chat to discuss the planning for strikes on Houthi rebels in Yemen and included Atlantic Editor-in-Chief Jeffrey Goldberg.",
    "url": "https://fpwellman.substack.com/p/its-a-thousand-times-worse-than-you"
  },
  {
    "text": "Seven Reasons Trump's Entire National Security Team Should Resign in Disgrace  —  The White House, with the help of Politico, is trying to make National Security Adviser Mike Waltz the fall guy for adding Atlantic editor Jeff Goldberg to the Signal thread on which they planned war strikes against Yemen.",
    "url": "https://www.emptywheel.net/2025/03/25/seven-reasons-trumps-entire-national-security-team-should-resign-in-disgrace/"
  },
  {
    "text": "Long waits, waves of calls, website crashes: Social Security is breaking down  —  A flood of cuts led by Elon Musk has sent the agency into chaos as a new commissioner prepares to take charge.",
    "url": "https://www.washingtonpost.com/politics/2025/03/25/social-security-phones-doge-cuts/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQyODc1MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ0MjU3NTk5LCJpYXQiOjE3NDI4NzUyMDAsImp0aSI6IjFkMDMzZWUyLWQ5ZTItNDdjNS05OWY4LTk1NmE1YmVlMGU1NyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzAzLzI1L3NvY2lhbC1zZWN1cml0eS1waG9uZXMtZG9nZS1jdXRzLyJ9.r-0WQpn_MpOALvoIcQHovmsrG46R2HoKXKyTK8lg0CY&itid=gfta"
  },
  {
    "text": "SignalGate Is Bad; But OPSEC Isn't Even the Worst Part Of It … I haven't had time to comment on the Jeff Goldberg story about the war cabinet planning a military campaign on the Signal app.  So a few brief thoughts.  —  To state the obvious, in any normal administration Hegseth and Waltz … ",
    "url": "https://talkingpointsmemo.com/edblog/signalgate-is-bad-but-opsec-isnt-even-the-worst-part-of-it"
  },
  {
    "text": "Law firms refuse to represent Trump opponents in the wake of his attacks  —  The result is an extraordinary threat to constitutional rights of due process and legal representation and a far weaker effort to challenge Trump's actions in court than during his first term.  —  Just now",
    "url": "https://www.washingtonpost.com/politics/2025/03/25/trump-law-firms/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQyODc1MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ0MjU3NTk5LCJpYXQiOjE3NDI4NzUyMDAsImp0aSI6Ijc1MzFjOGI2LTU2ODItNDU0NC1iMzNjLWIxNDQwOWU3MGEyZCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzAzLzI1L3RydW1wLWxhdy1maXJtcy8ifQ.ihgngGFFkV8B5ErBReXHfw_0te5Zm494nb87SWDPKJk&itid=gfta"
  },
  {
    "text": "Speaker Mike Johnson floats eliminating federal courts as GOP ramps up attacks on judges  —  Republican lawmakers are setting their sights on the judiciary following court rulings that have halted Trump's agenda.  —  WASHINGTON — Facing pressure from his right flank to take on judges … ",
    "url": "https://www.nbcnews.com/politics/congress/speaker-mike-johnson-floats-eliminating-federal-courts-rcna197986"
  },
  {
    "text": "Now Europe Knows What Trump's Team Calls It Behind Its Back: ‘Pathetic’  —  Trump officials have demanded more European military spending and questioned the continent's values.  Leaked messages show the depth of the rift.  —  Trump administration officials haven't kept their disdain for Europe quiet.",
    "url": "https://www.nytimes.com/2025/03/25/world/europe/signal-jeffrey-goldberg-message-hegseth.html"
  },
  {
    "text": "Who is the most popular U.S. political figure?  —  Maybe Democrats can learn something from them  —  There is a lot of debate right now over why and how the Democrats lost the 2024 election, and what to do about it before 2026.  The takes have been catalyzed by recent surveys showing … ",
    "url": "https://gelliottmorris.substack.com/p/who-is-the-most-popular-us-elected"
  },
  {
    "text": "Trump to Name Right-Wing Media Critic Ambassador to South Africa  —  L. Brent Bozell III, who must be confirmed by the Senate, would be stepping into the role at a time when relations between South Africa and the United States are at a low point.  —  President Trump plans to nominate L. Brent Bozell III … ",
    "url": "https://www.nytimes.com/2025/03/25/us/politics/trump-bozell-ambassador-south-africa.html"
  },
  {
    "text": "MAGA Influencers May Have Been Paid to Break With RFK  —  Secret cash flies in the MAGA soda wars  —  IF YOU'VE EVER BEEN READING YOUR social media feed and suddenly noticed that conservative personalities have latched on to some obscure issue they've never cared about before … ",
    "url": "https://www.thebulwark.com/p/maga-influencers-break-with-rfk-soda-payola-scandal-influenceable-atlantic"
  },
  {
    "text": "Florida debates lifting some child labor laws to fill jobs vacated by undocumented immigrants  —  New York CNN  —  Florida has been working for years to crack down on employers that hire undocumented immigrants.  But that presented a problem for businesses in the state that are desperate … ",
    "url": "https://cnn.com/2025/03/25/business/florida-child-labor-laws"
  },
  {
    "text": "Noem says she plans to ‘eliminate FEMA’  —  Homeland Security Secretary Kristi Noem said she planned to “eliminate” the Federal Emergency Management Agency (FEMA) during a televised Cabinet meeting Monday.  —  While giving a status report on border security, Noem added, “and we're going to eliminate FEMA.”",
    "url": "https://thehill.com/policy/energy-environment/5213057-noem-plans-eliminate-fema/"
  },
  {
    "text": "Columbia's President Faces Angry Faculty in Closed-Door Meetings  —  Katrina Armstrong warns of ‘devastating’ risk of funding cuts  —  Columbia University interim president Katrina Armstrong met with anxious faculty over the weekend in an effort to generate support, warn of the jeopardy … ",
    "url": "https://www.wsj.com/us-news/education/columbia-trump-faculty-meetings-38a65fff?st=DFBj2Q&reflink=article_copyURL_share"
  },
  {
    "text": "Trump Administration Plans to Freeze Family-Planning Grants  —  Tens of millions of dollars in federal funding for Planned Parenthood and other groups would be cut off while the administration examines their DEI efforts  —  The Trump administration is moving to freeze tens of millions … ",
    "url": "https://www.wsj.com/politics/policy/trump-administration-plans-to-freeze-family-planning-grants-541441be?st=rEu3KY&reflink=mobilewebshare_permalink"
  },
  {
    "text": "Exclusive: Secretive Chinese network tries to lure fired federal workers, research shows  —  A network of companies operated by a secretive Chinese tech firm has been trying to recruit recently laid-off U.S. government workers, according to job ads and a researcher who uncovered the campaign.",
    "url": "https://www.reuters.com/world/china/secretive-chinese-network-tries-lure-fired-federal-workers-research-shows-2025-03-25/"
  },
  {
    "text": "A Rising Democratic Star Is Ready for New Leadership — Without Chuck Schumer  —  Michigan Democrat Mallory McMorrow says it's time for a new generation to take on Trump.  —  Mallory McMorrow doesn't claim to have all the answers for the Democratic Party.  But as the 38-year-old Michigan Democrat gears … ",
    "url": "https://www.politico.com/news/magazine/2025/03/25/mallory-mcmorrow-michigan-senate-chuck-schumer-00246369"
  },
  {
    "text": "White House Says Russia and Ukraine Agree to Stop Fighting in Black Sea  —  The agreement announced after parallel sets of talks in Riyadh would be the first significant step toward the full cease-fire the Trump Administration had been pushing, but it still would fall short.",
    "url": "https://www.nytimes.com/2025/03/25/world/europe/russia-ukraine-deal-black-sea.html"
  },
  {
    "text": "Education Department Reeling After Layoffs  —  The Trump administration said its sweeping cuts would eliminate bloat at the department.  Staff say the “chaotic” process has stalled essential functions and left remaining employees with unmanageable workloads.",
    "url": "https://www.insidehighered.com/news/government/politics-elections/2025/03/25/education-department-staff-struggle-after-mass"
  },
  {
    "text": "Trump Admin Plans to Cut Team Responsible for Critical Atomic Measurement Data  —  The team at the National Institute of Standards and Technology publishes measurement data crucial for advanced research in areas like astrophysics, nuclear fusion, and semiconductors.",
    "url": "https://www.wired.com/story/nist-doge-layoffs-atomic-spectroscopy/"
  },
  {
    "text": "The Worst and the Dimmest  —  Most relatively informed citizens will be aware by now of the biggest news story that has come out of this administration: national security officials accidentally added Atlantic editor Jeffrey Goldberg to a Signal group chat where they discussed operations against the Houthis in Yemen.",
    "url": "https://www.unpopularfront.news/p/the-worst-and-the-dimmest"
  }
]