[
  {
    "text": "E. Jean Carroll Lawyer Threatens to Seek Sanctions Against Trump Attorney for ‘Utterly Baseless’ Claims Judge Was Her ‘Mentor’  —  Trump's lawyer Alina Habba claimed the judge had a conflict of interest based on a tabloid rumor of an alleged 30-year-old professional tie",
    "url": "https://themessenger.com/politics/e-jean-carroll-roberta-kaplan-trump-alina-habba-judge-mentor"
  },
  {
    "text": "First look: John Bolton's predictions for a second Trump term  —  John Bolton — Donald Trump's former national security adviser — is laying out his nightmare scenarios for a second Trump term in a foreword to the paperback edition of his memoir “The Room Where It Happened,” out Tuesday.",
    "url": "https://www.axios.com/2024/01/30/trump-john-bolton-second-term-2024-election"
  },
  {
    "text": "E. Jean Carroll Delivered the Sound Bite That Could Win Trump the Election  —  There's the liberal media's crusade against the former president, but then there's E. Jean Carroll's war against Trump, which is something otherworldly.  She's filed multiple lawsuits against Donald Trump.",
    "url": "https://townhall.com/tipsheet/mattvespa/2024/01/29/e-jean-carroll-delivered-a-huge-in-kind-contribution-to-trump-during-her-msnbc-interview-n2634353"
  },
  {
    "text": "Trump can stay on Illinois 2024 ballot after 14th Amendment challenge, officials say  —  A bipartisan state board voted 8-0 to affirm Trump's eligibility.  —  Former U.S. President Donald Trump waves as he departs for his second civil trial after E. Jean Carroll accused Trump of raping her decades ago … ",
    "url": "https://abcnews.go.com/Politics/trump-remain-illinois-2024-ballot-after-14th-amendment/story?id=106765313"
  },
  {
    "text": "House Republicans poised to torpedo GOP's best chance in years to pass border bill  —  House Republicans appear to be on the precipice of torpedoing their best opportunity in years of passing border legislation.  —  Republicans had long insisted on changes to border and migration policy … ",
    "url": "https://thehill.com/homenews/house/4436245-house-republicans-border-deal/"
  },
  {
    "text": "Republicans Who Screamed About A Crisis On The Border Now Oppose A Plan To Fix It  —  Many on the right claim the U.S. is being “invaded” by migrants but also want to wait until Donald Trump is elected president again to stop it.  —  LOADING  —  WASHINGTON ― For months … ",
    "url": "https://www.huffpost.com/entry/republicans-border-deal-donald-trump_n_65b80899e4b0102bd2d5c0d4"
  },
  {
    "text": "Israeli undercover forces dressed as women and medics storm West Bank hospital, killing 3 militants  —  Israeli forces disguised as civilian women and medical workers stormed a hospital Tuesday in the occupied West Bank, killing three Palestinian militants in a dramatic raid that underscored … ",
    "url": "https://apnews.com/article/israel-hamas-war-news-01-30-2024-b1ba33c7c0c5c62f85932a20c2a0bc92"
  },
  {
    "text": "CONFIRMED: House Democrat Being Criminally Investigated Is ‘Squad’ Member Cori Bush  —  As RedState reported on Monday, a House Democrat is currently under criminal investigation for the misuse of government funds under the guise of paying for “security” services.",
    "url": "https://redstate.com/bonchie/2024/01/30/confirmed-house-democrat-being-criminally-investigated-is-squad-member-cori-bush-n2169406"
  },
  {
    "text": "Justice Department investigating Rep. Cori Bush campaign's use of security funds  —  The Missouri Democrat confirmed the investigation, denying any wrongdoing and saying that her campaign is “fully cooperating.”  —  WASHINGTON — Rep. Cori Bush, D-Mo., a key progressive … ",
    "url": "https://www.nbcnews.com/politics/congress/justice-department-investigating-rep-cori-bush-campaigns-use-security-rcna136377"
  },
  {
    "text": "Justice Sotomayor speaks on frustration following some Supreme Court rulings  —  Supreme Court Justice Sonia Sotomayor opened up on Monday about the “frustration” she said she experiences daily as the high court's conservative supermajority continues to move the country further to the right.",
    "url": "https://www.cnn.com/2024/01/29/politics/sotomayor-supreme-court-frustration/"
  },
  {
    "text": "Manchin's wife hospitalized after car accident  —  Gayle Manchin, the wife of Sen. Joe Manchin (D-W.Va.), was admitted to a hospital in Alabama on Tuesday after being involved in a car accident, the senator's office announced.  —  According to Sen. Manchin's office, his wife and a colleague … ",
    "url": "https://thehill.com/homenews/senate/4437529-manchins-wife-hospitalized-after-car-accident/"
  },
  {
    "text": "Not Just Claudine Gay.  Harvard's Chief Diversity Officer Plagiarized and Claimed Credit for Husband's Work, Complaint Alleges  —  It's not just Claudine Gay.  Harvard University's chief diversity and inclusion officer, Sherri Ann Charleston, appears to have plagiarized extensively in her academic work … ",
    "url": "https://freebeacon.com/campus/not-just-claudine-gay-harvards-chief-diversity-officer-plagiarized-and-claimed-credit-for-husbands-work-complaint-alleges/"
  },
  {
    "text": "Biden says he's decided how to respond to deadly attack on US forces in Jordan  —  President Biden said Tuesday he has decided how he plans to respond to an attack on U.S. forces in Jordan that killed three Americans, but stressed he was not seeking a wider war in the Middle East.",
    "url": "https://thehill.com/homenews/administration/4437420-biden-decided-response-attack-jordan/"
  },
  {
    "text": "New US-made longer-range bomb expected to arrive as soon as Wednesday in Ukraine  —  The Ground-Launched Small Diameter Bomb doesn't even exist in the U.S. inventory.  —  The Pentagon has successfully tested a new long-range precision bomb for Ukraine that is expected to arrive on the battlefield … ",
    "url": "https://www.politico.com/news/2024/01/30/new-us-made-longer-range-bomb-expected-to-arrive-as-soon-wednesday-in-ukraine-00138566"
  },
  {
    "text": "It's not that MAGA doesn't believe E. Jean Carroll — they just don't care that Trump abuses women  —  Trump verdict and new Vince McMahon allegations are a dark reminder that red state America cultivates rape culture  —  Not that she'll ever bring herself to use words like “rapist” or … ",
    "url": "https://www.salon.com/2024/01/30/its-not-that-maga-doesnt-believe-e-jean-carroll--they-just-dont-care-that-abuses-women/"
  },
  {
    "text": "Economic Mood Improves, but Inflation Still Vexing Americans  —  WASHINGTON, D.C. — While still negative overall, Gallup's Economic Confidence Index has improved each of the past two months to its highest point in two years, reflecting improved views of both current economic conditions and the economy's direction.",
    "url": "https://news.gallup.com/poll/609221/economic-mood-improves-inflation-vexing-americans.aspx"
  },
  {
    "text": "Party feud breaks out ahead of RNC meeting in Las Vegas  —  GOP county chairs and local activists warned the party isn't doing enough to compete in November.  —  LAS VEGAS — Days before the Republican National Committee was set to convene here, hundreds of Republican officials gathered … ",
    "url": "https://www.politico.com/news/2024/01/29/republican-party-feud-turning-point-las-vegas-00138493"
  },
  {
    "text": "3 U.S. Service Members Killed, Others Injured in Jordan Following Drone Attack  —  Three U.S. soldiers were killed yesterday in Jordan, while more than 40 other service members were injured following an uncrewed aerial system attack at a military base near the Syrian border.",
    "url": "https://www.defense.gov/News/News-Stories/Article/Article/3659809/3-us-service-members-killed-others-injured-in-jordan-following-drone-attack/"
  },
  {
    "text": "Exclusive: US disabled Chinese hacking network targeting critical infrastructure  —  The U.S. government in recent months launched an operation to fight a pervasive Chinese hacking operation that successfully compromised thousands of internet-connected devices, according to two Western security officials … ",
    "url": "https://www.reuters.com/world/us/us-disabled-chinese-hacking-network-targeting-critical-infrastructure-sources-2024-01-29/"
  },
  {
    "text": "‘White Lives Matter’ member gets 18 years for firebombing church that planned drag events  —  Aimenn Penny told the FBI that he would have felt better if his Molotov cocktails had burned an LGBT-friendly church to the ground.  —  WASHINGTON — A member of the pro-Nazi group White Lives Matter … ",
    "url": "https://www.nbcnews.com/politics/justice-department/white-lives-matter-member-gets-18-years-firebombing-church-planned-dra-rcna136374"
  }
]