[
  {
    "text": "New Court Filings Place Matt Gaetz at a Party at the Center of the Sex Trafficking Scandal  —  This is the first public filing that cites sworn testimony alleging that Gaetz attended one of the long-rumored parties with a teenage girl.  — Copy  —  Rep. Matt Gaetz attended a drug-fueled sex party … ",
    "url": "https://www.notus.org/florida/new-court-filings-matt-gaetz-dorworth-sex-party"
  },
  {
    "text": "How Dumb Do They Think You Are?  —  Ohio's Republican governor, Mike DeWine, comes to the defense of Springfield and its Haitian community in the New York Times today: … Happy Friday.  —  Uh, Gross  —Andrew Egger  —  When the rumor mill started churning yesterday that some major … ",
    "url": "https://www.thebulwark.com/p/how-dumb-do-they-think-you-are"
  },
  {
    "text": "Trump Ignores Mark Robinson Controversy, Hoping Gubernatorial Candidate Will Drop Out  —  CNN's article scrambled G.O.P. plans for winning North Carolina.  People close to Donald Trump are holding out hope Lt. Gov. Mark Robinson will decide to quit the governor's race.",
    "url": "https://www.nytimes.com/2024/09/20/us/politics/trump-mark-robinson.html"
  },
  {
    "text": "I'm the Governor of Ohio.  I Don't Recognize the Springfield That Trump and Vance Describe.  —  I was born in Springfield, Ohio.  My wife, Fran, and I have lived our entire lives less than 10 miles from this city.  —  When we were dating in high school, we would go there to see movies … ",
    "url": "https://www.nytimes.com/2024/09/20/opinion/springfield-haitian-migrants-ohio.html?unlocked_article_code=1.ME4.GXDA.7LLopMRyJqap&smid=url-share"
  },
  {
    "text": "Matt Gaetz Was at Sex and Drugs Party With High School Junior: Court Docs  —  BOMBSHELL  —  Filings cite sworn statements from three witnesses.  —  Rep. Matt Gaetz was at a 2017 party with a 17-year-old girl at the heart of an alleged sex trafficking scandal, according to legal documents filed Thursday.",
    "url": "https://www.thedailybeast.com/matt-gaetz-was-at-sex-and-drugs-party-with-high-school-junior-court-docs"
  },
  {
    "text": "Nuzzi's RFK Relationship  —  “Had the magazine been aware of this relationship, she would not have continued to cover the presidential campaign,” the spokesperson said. … “Recently our Washington Correspondent Olivia Nuzzi acknowledged to the magazine's editors that she had engaged … ",
    "url": "https://www.status.news/p/olivia-nuzzi-rfk-new-york-magazine"
  },
  {
    "text": "'I'm a black NAZI!':  NC GOP nominee for governor made dozens of disturbing comments on porn forum  —  Editor's Note: The below story contains offensive language.  —  Mark Robinson, the controversial and socially conservative Republican nominee for governor of North Carolina … ",
    "url": "https://www.cnn.com/2024/09/19/politics/kfile-mark-robinson-black-nazi-pro-slavery-porn-forum"
  },
  {
    "text": "Pro-Trump Georgia election board votes to require hand counts of ballots  —  Critics plan to sue, saying the new requirement would almost certainly lead to errors and could disrupt the process of certifying the vote in a crucial battleground state.  —  ATLANTA — The Georgia State Election Board approved … ",
    "url": "https://www.washingtonpost.com/politics/2024/09/20/trump-georgia-election-board-hand-count-ballots/"
  },
  {
    "text": "Trump Electoral-Vote Heist Underway in Nebraska  —  With the major-party presidential candidates in close battles in a sparse landscape of battleground states, every electoral vote matters.  There are scenarios where either Kamala Harris or Donald Trump wins 269 or 270 electoral votes.",
    "url": "https://nymag.com/intelligencer/article/trump-electoral-vote-heist-underway-in-nebraska.html"
  },
  {
    "text": "Trump says Jews would deserve much of the blame if he loses  —  In a speech Thursday billed as former President Donald Trump's answer to rising antisemitism, he said Jews would bear much of the responsibility if he loses the presidential election.  —  And in a second speech later in the evening … ",
    "url": "https://forward.com/fast-forward/655947/trump-jews-blame-israel-harris/"
  },
  {
    "text": "Kamala Harris Says Anyone Who Breaks Into Her House Is ‘Getting Shot’  —  The Democratic presidential nominee said she can support both the Second Amendment and commonsense gun reform.  —  LOADING  —  Vice President Kamala Harris defended her gun ownership and said she would use a firearm … ",
    "url": "https://www.huffpost.com/entry/kamala-harris-gun-ownership-oprah-winfrey_n_66ecd25be4b07a173e50d8c2"
  },
  {
    "text": "White officer who fatally shot Black man shouldn't have been in his backyard, judge rules in suit  —  A federal judge has partially sided with the family of a Black man who was fatally shot by a now-imprisoned white Kansas City, Missouri, police detective, ruling that the officer should not have entered the man's backyard.",
    "url": "https://apnews.com/article/exkansas-city-detective-wrongful-death-lawsuit-59a7e2b9fa8c512969608d52bd94fab3"
  },
  {
    "text": "Microsoft deal would reopen Three Mile Island nuclear plant to power AI  —  The owner of the shuttered Pennsylvania plant plans to bring it online by 2028, with the tech giant buying all the power it produces.  —  Pennsylvania's dormant Three Mile Island nuclear plant would be brought … ",
    "url": "https://www.washingtonpost.com/business/2024/09/20/microsoft-three-mile-island-nuclear-constellation/"
  },
  {
    "text": "I co-chaired Nikki Haley's Iowa campaign.  I am endorsing Kamala Harris.  —  I heard Harris articulate that she has always brought groups of diverse individuals and opinions together to solve problems.  That is a healthier and wiser way to lead.  —  I served as an Iowa state co-chair of the Nikki Haley for President campaign.",
    "url": "https://www.desmoinesregister.com/story/opinion/columnists/iowa-view/2024/09/20/republicans-for-kamala-harris-dawn-roberts-iowa-campaign-nikki-haley/75306017007/"
  },
  {
    "text": "The Trump Lie Machine Is Broken  —  It shouldn't have taken a year, let alone nine, for political elites to stop getting snookered by Donald Trump.  —  I say that as someone with very low expectations.  Being an easy mark is part of the price of admission to the heights of American discourse.",
    "url": "https://www.offmessage.net/p/the-trump-lie-machine-is-broken"
  },
  {
    "text": "Kentucky sheriff charged in killing of judge at courthouse  —  A judge in a rural Kentucky county was shot and killed in his courthouse chambers Thursday, and the local sheriff was charged with murder, police said.  The preliminary investigation indicates Letcher County Sheriff Shawn M. Stines … ",
    "url": "https://apnews.com/article/courthouse-shooting-kentucky-f93419fff14202a88e28b5ea49b26810"
  },
  {
    "text": "Which Mexico are you?  New Mexico furious after Texas installs razor wire along its border  —  Texas' latest move is a ‘political stunt’ that will have 'will have no meaningful impact on our nation's broken immigration system,' New Mexico Governor Michelle Lujan Grisham said",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/texas-new-mexico-border-wire-b2615743.html"
  },
  {
    "text": "How they have failed us  —  It is as if the editorial department at The Washington Post woke up one morning asking, in headlines I will quote below, “What are we doing wrong?”  —  I will start by trying to answer the question for them, The New York Times, CNN, and the rest of incumbent journalism:",
    "url": "https://buzzmachine.com/2024/09/19/how-they-have-failed-us/"
  },
  {
    "text": "Trump Media hits new 52-week low after DJT lockup restrictions expire … Shares of Trump Media sank more than 7% Friday morning, hitting a new 52-week low one day after “lockup” restrictions expired, which had previously prevented its majority shareholder, former President Donald Trump … ",
    "url": "https://www.cnbc.com/2024/09/20/djt-trump-media-stock-selloff-lockup-.html"
  },
  {
    "text": "Jason Stanley on how authoritarians rewrite the past  —  “Authoritarian regimes must erase any history of social movements for democracy.”  —  ∙ Paid … “Fascist politics invokes a pure mythic past tragically destroyed,” Jason Stanley wrote at the very beginning of his 2018 book … ",
    "url": "https://www.publicnotice.co/p/jason-stanley-interview-fascism-erasing-history"
  },
  {
    "text": "Trump's Deranged Plan to Lower Food Prices by Raising Them  —  At a campaign event on Tuesday night, Donald Trump vowed to lower the price of groceries by ... taxing them?  Responding to a question about food costs, Trump told the Michigan audience that his plan would entail both energy deregulation … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/09/trump-tariffs-grocery-prices/679942/"
  },
  {
    "text": "Supreme Court declines to reinstate Jill Stein on Nevada's ballot  —  The Supreme Court rejected the Nevada Green Party's request for an emergency order putting its candidate, Jill Stein, on the presidential ballot in the key swing state.  —  Without any noted dissents … ",
    "url": "https://thehill.com/regulation/court-battles/4890417-supreme-court-rejects-green-party/"
  },
  {
    "text": "Postmaster general: ‘Wrong’ to say mail ballots might be misplaced  —  U.S. Postmaster General Louis DeJoy expressed frustration Thursday to reporters about the ongoing criticism from election officials about how the agency handles mail-in ballots, saying it is wrong to suggest they could be displaced.",
    "url": "https://thehill.com/homenews/campaign/4890260-postmaster-general-responds-mail-in-ballot-criticism/"
  }
]