[
  {
    "text": "‘Hands Off!’ protesters across US rally against President Donald Trump and Elon Musk  —  Millions of people took part in protests against President Donald Trump and Elon Musk across all 50 states and globally on Saturday, organized by a pro-democracy movement in response to what they call a … ",
    "url": "https://cnn.com/2025/04/05/us/hands-off-protests-trump-musk"
  },
  {
    "text": "You Can Stop Asking Where the Mass Opposition Is.  It's Everywhere.  —  It is a cliche to begin a story about a rally with a quote from a funny sign, but one small piece of floppy brown cardboard floating down 40th Street in Manhattan on Saturday seemed to capture the mood of this weekend's … ",
    "url": "https://www.motherjones.com/politics/2025/04/hands-off-donald-trump-fear-new-york-city/"
  },
  {
    "text": "Nationwide ‘Hands Off!’ protests erupt against Trump and Musk  —  Demonstrators gathered across the country on Saturday, many animated by differing issues, but united in opposition to the Trump administration with the single message: “Hands off!”  —  Organizers said more than 1,300 “Hands Off! … ",
    "url": "https://www.npr.org/2025/04/05/nx-s1-5353388/hands-off-protests-washington-dc"
  },
  {
    "text": "DOJ places attorney on leave after struggling in Maryland migrant case  —  Pam Bondi said DOJ lawyers must “zealously advocate” for the administration.  —  Attorney General Pam Bondi speaks at a news conference at the Justice Department, Feb. 12, 2025, in Washington.",
    "url": "https://abcnews.go.com/Politics/doj-places-attorney-leave-after-struggling-maryland-migrant/story?id=120526466"
  },
  {
    "text": "Justice Dept. Accuses Top Immigration Lawyer of Failing to Follow Orders  —  Erez Reuveni conceded in court that the deportation last month of Kilmar Armando Abrego Garcia, who had a court order allowing him to stay in the United States, should never have taken place.",
    "url": "https://www.nytimes.com/2025/04/05/us/politics/justice-dept-immigration-lawyer-leave.html"
  },
  {
    "text": "Second measles death reported in Texas  —  Health Secretary Robert F. Kennedy Jr. is expected to attend the child's funeral, which is scheduled for Sunday.  —  Another child with measles in Texas has died, the Department of Health and Human Services confirmed late Saturday night, though the exact cause of death is under investigation.",
    "url": "https://www.nbcnews.com/health/health-news/second-measles-death-texas-child-kennedy-rcna199882"
  },
  {
    "text": "A Second Child Dies of Measles in Texas  —  It is the second confirmed measles death in the U.S. in a decade.  If the outbreak continues at the current pace, the nation may lose its “elimination” status.  —  2 MIN READ  —  How Measles Attacks an Unvaccinated Child  —  ADVERTISEMENT  —  Got a Tip?",
    "url": "https://www.nytimes.com/2025/04/06/health/measles-death-texas.html?unlocked_article_code=1.9k4.-axm.xQubqLRVFw0Z&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Amid anti-DEI push, National Park Service rewrites history of Underground Railroad  —  Since Trump took office, the park service — an agency charged with preserving American history — has changed how its website describes key moments from slavery to Jim Crow",
    "url": "https://www.washingtonpost.com/investigations/2025/04/06/national-park-service-underground-railroad-history-slavery/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQzOTEyMDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ1Mjk0Mzk5LCJpYXQiOjE3NDM5MTIwMDAsImp0aSI6IjRiMzYzMGM3LWY4YmQtNGM3NS05MjNjLTUwNzI4ZjNkMWQwYSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9pbnZlc3RpZ2F0aW9ucy8yMDI1LzA0LzA2L25hdGlvbmFsLXBhcmstc2VydmljZS11bmRlcmdyb3VuZC1yYWlscm9hZC1oaXN0b3J5LXNsYXZlcnkvIn0.NJeQgDttIclC-I8x1pFhlSfDIelzBtZ-mbICWqiPn68&itid=gfta"
  },
  {
    "text": "As Savings Disappear, Social Security is Also Under Threat  —  Many Americans are watching their retirement savings melt away because of President Trump's disastrous trade policies.  In normal downturns, they could at least reassure themselves that Social Security would always be there.",
    "url": "https://donmoynihan.substack.com/p/as-savings-crater-social-security"
  },
  {
    "text": "Doge's attack on social security causing ‘complete, utter chaos’, staff says  —  Understaffed agency sent into ‘death spiral’ as employees warn Musk-led cuts will lead to structural collapse  —  Office closures, staffing and service cuts, and policy changes at the Social Security Administration … ",
    "url": "https://www.theguardian.com/us-news/2025/apr/06/musk-doge-social-security"
  },
  {
    "text": "Exclusive: how the Atlantic's Jeffrey Goldberg got added to the White House Signal group chat  —  Internal investigation cleared the national security adviser Mike Waltz, but the mistake was months in the making  —  Donald Trump's national security adviser Mike Waltz included a journalist … ",
    "url": "https://www.theguardian.com/us-news/2025/apr/06/signal-group-chat-leak-how-it-happened"
  },
  {
    "text": "Elon Musk hopes for ‘zero-tariff situation’ between US and EU  —  Elon Musk, the world's richest man and the face of the Trump administration's Department of Government Efficiency, said Saturday that he hopes for a “zero-tariff situation” between Europe and the United States.",
    "url": "https://cnn.com/2025/04/05/business/musk-tariffs-us-europe/"
  },
  {
    "text": "A Playbook for Standing Up to President Trump  —  In his attacks on law firms, universities and other American institutions, President Trump is relying on an illusion.  The illusion is that the institutions are powerless to fight back and that they face a choice between principle and survival.",
    "url": "https://www.nytimes.com/2025/04/06/opinion/trump-law-firms-universities.html"
  },
  {
    "text": "Starmer vows to ‘shelter British business from the storm’ of US tariffs  —  British prime minister promises to “turbocharge” plans to improve the U.K.'s competitiveness this week.  —  U.K. Prime Minister Keir Starmer said his government is ready to use industrial policy to mitigate the impact … ",
    "url": "https://www.politico.eu/article/uks-starmer-vows-to-shelter-businesses-from-tariff-storm/"
  },
  {
    "text": "Trump tariffs based on massive error, conservative think tank says  —  The formula used by the Trump administration to levy reciprocal tariffs contains a serious math error that over-inflates the impact by about a factor of four, economists at the American Enterprise Institute said.",
    "url": "https://www.axios.com/2025/04/06/trump-tariffs-error-aei"
  },
  {
    "text": "Treasury Secretary Scott Bessent says Americans looking to retire aren't concerned about day-to-day markets, dismisses concerns about a potential recession  —  Bessent's comments come after President Donald Trump warned that the “economic revolution” won't “be easy” in a social media post.",
    "url": "https://www.nbcnews.com/politics/trump-administration/bessent-americans-retire-arent-worried-stock-market-recession-rcna199892"
  },
  {
    "text": "Texas county that swung to Trump grapples with immigration crackdown after bakery is targeted  —  Leonardo Baez and Nora Avila-Guel's bakery in the Texas community of Los Fresnos is a daily stop for many residents to share gossip over coffee and pick up cakes and pastries for birthdays, office parties or themselves.",
    "url": "https://apnews.com/article/immigration-enforcement-texas-bakery-border-homan-trump-335468ef4f0e577fa03ec03463e20854"
  },
  {
    "text": "Trump administration orders half of national forests open for logging  —  An emergency order removes protections covering more than half the land managed by the U.S. Forest Service as the president aims to boost timber production.  —  The Trump administration has removed environmental protections covering … ",
    "url": "https://www.washingtonpost.com/climate-environment/2025/04/05/trump-administration-orders-half-national-forests-open-logging/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQzODI1NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ1MjA3OTk5LCJpYXQiOjE3NDM4MjU2MDAsImp0aSI6ImZkN2NmZWJmLTFkZjgtNGIwMy05ZThkLTk1NDZhMjk3NmM3YiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9jbGltYXRlLWVudmlyb25tZW50LzIwMjUvMDQvMDUvdHJ1bXAtYWRtaW5pc3RyYXRpb24tb3JkZXJzLWhhbGYtbmF0aW9uYWwtZm9yZXN0cy1vcGVuLWxvZ2dpbmcvIn0.FbQ5R6Kpo1cuoww0X_AibN0rlqxNDL3qDcHv4Qt_OTY&itid=gfta"
  },
  {
    "text": "Trump's Next Target: Poverty-Stricken Kids  —  Head Start and other early-childhood programs are among those affected by massive cuts to HHS.  —  AS THE TRUMP ADMINISTRATION has hacked away at the Department of Health and Human Services these past few weeks, most of the attention has focused … ",
    "url": "https://www.thebulwark.com/p/trump-next-target-poverty-stricken-kids-hhs-head-start-early-childhood-child-care-education-programs-federal-cuts"
  },
  {
    "text": "Trump Family's Cash Registers Ring as Financial Meltdown Plays Out  —  The party was on at a Saudi-backed LIV Golf tournament at the president's Doral resort in Florida and a fund-raiser at Mar-a-Lago, even as markets tumbled.  —  The financial market meltdown was underway … ",
    "url": "https://www.nytimes.com/2025/04/05/us/politics/trump-family-saudi-golf.html?unlocked_article_code=1.9U4.Ja7s.tKXlCFXVIMDV"
  },
  {
    "text": "He Said He Would Ban Congressional Stock Trading.  Now in Office, He Trades Freely.  —  Representative Rob Bresnahan Jr., who campaigned on prohibiting stock trading by members of Congress, has emerged as one of the most active stock traders in the freshman class.",
    "url": "https://www.nytimes.com/2025/04/05/us/politics/congress-stock-trading-ban.html"
  }
]