[
  {
    "text": "Trump, co-defendants to be arraigned in Georgia on Sept. 6  —  Former President Trump will be arraigned next Wednesday in Georgia over charges he and 18 co-defendants sought to overturn the state's election results.  —  Trump's arraignment has been set for Sept. 6 at 9:30 a.m. … ",
    "url": "https://thehill.com/regulation/court-battles/4174548-trump-co-defendants-to-be-arraigned-in-georgia-on-sept-6/"
  },
  {
    "text": "Trump arraignment set for Sept. 6 in Georgia election case  — Donald Trump will be arraigned Sept. 6 in Atlanta in the criminal case where he is accused of conspiring to overturn the 2020 presidential election in Georgia.  — Trump's arraignment will take place at 9:30 a.m. ET that day … ",
    "url": "https://www.cnbc.com/2023/08/28/trump-arraignment-set-for-sept-6-in-georgia-election-case.html"
  },
  {
    "text": "DeSantis booed at vigil for victims of racist shooting in Florida  —  Florida Gov. Ron DeSantis, a GOP presidential candidate, was met with boos while speaking late Sunday at a vigil held for the three victims of a racially motivated shooting in Jacksonville.",
    "url": "https://thehill.com/homenews/state-watch/4174426-desantis-booed-at-vigil-for-victims-of-racist-shooting-in-florida/"
  },
  {
    "text": "August 2023 National Poll: Trump Debate Snub May Open Door for Other Candidates  —  Home Polls August 2023 National Poll: Trump Debate Snub May Open Door for Other Candidates  —  Hunter Biden Legal Issues Offsetting Trump Indictments for Independents  —  A new Emerson College Polling survey … ",
    "url": "https://emersoncollegepolling.com/august-2023-national-poll-trump-debate-snub-may-open-door-for-other-candidates/"
  },
  {
    "text": "Trump support ‘softening,’ possible opening for challengers  —  It's too early to determine if it is a trend or “blip,” but a survey of Republican voters following last week's GOP debate has found a “softening” of support for former President Donald Trump.  —  While Trump remains the leader … ",
    "url": "https://www.washingtonexaminer.com/news/washington-secrets/trump-support-softening-possible-opening-for-challengers"
  },
  {
    "text": "The Federalist Society's mugshots  —  This entirely free edition of Public Notice is made possible by paid subscribers.  If you appreciate our work and aren't already one, please support us by signing up.  Just click the button below for a free trial.  —  Sign up for Public Notice free trial",
    "url": "https://www.publicnotice.co/p/jeffrey-clark-eastman-charges-federalist-society"
  },
  {
    "text": "Killing of ‘Staunch’ GOP Activist in New Hampshire Under Investigation  —  A colleague called Alexander Talcott “an exceptionally skilled champion for the rule of law and the importance of fair and honest elections.”  —  A Republican Party activist and lawyer died after he was fatally stabbed … ",
    "url": "https://www.thedailybeast.com/gop-activist-alexander-talcotts-killing-in-new-hampshire-under-investigation"
  },
  {
    "text": "If the U.S. economy is doing well, why do so many Americans say it's terrible?  —  The leading economic indicators show the U.S. economy is performing well, but most Americans still believe economic conditions are extremely poor — as if the country was mired in a deep recession.  What explains this discrepancy?",
    "url": "https://popular.info/p/if-the-us-economy-is-doing-well-why"
  },
  {
    "text": "Trump's indictments: Polling shows half of Americans want him to suspend his campaign, and more takeaways  —  Despite what he claims, he isn't getting a continued bounce in support.  —  The most recent ABC News/Ipsos poll, conducted Aug. 15-17, showed some problems for former President Donald Trump … ",
    "url": "https://abcnews.go.com/Politics/trumps-indictments-polling-shows-half-americans-suspend-campaign/story?id=102342093"
  },
  {
    "text": "House Republicans' road to power runs through New York.  Stefanik is driving.  —  Elise Stefanik insists she has a plan that will allow the party to hold off a Democratic offensive.  —  POTSDAM, N.Y. — Elise Stefanik is betting big on 2024.  —  The leading House Republican says she convinced … ",
    "url": "https://www.politico.com/news/2023/08/28/stefanik-plans-100m-campaign-push-in-home-state-new-york-00113073"
  },
  {
    "text": "Michel Calls for EU to Be Ready for New Members by 2030  — Macron floats idea of ‘multi-speed’ Europe for aspirants  — Russia's war in Ukraine added urgency to enlargement debate  —  European Council President Charles Michel proposed setting a target date for the bloc to get serious … ",
    "url": "https://www.bloomberg.com/news/articles/2023-08-28/eu-s-michel-calls-for-bloc-to-be-ready-for-new-members-by-2030"
  },
  {
    "text": "The World Is Contemplating a Second Trump Administration  —  Possibility that former president will win next year's election has capitals across globe on edge  —  The U.S. presidential election is more than a year away, but allies and adversaries around the world have already begun to contemplate … ",
    "url": "https://www.wsj.com/world/the-world-is-contemplating-a-second-trump-administration-f6e970c4?mod=followamazon"
  },
  {
    "text": "The Real Story Behind Ron DeSantis' Newest Fired Prosecutor  —  Ron DeSantis bragged at the GOP debate about firing two prosecutors in his state.  His latest conquest is now speaking out. … When Florida Gov. Ron DeSantis finally spoke to a national audience on stage at last week's … ",
    "url": "https://www.thedailybeast.com/the-real-story-behind-ron-desantis-newest-fired-prosecutor"
  },
  {
    "text": "McCarthy starts to plot Biden impeachment strategy while GOP skeptics remain  —  House Speaker Kevin McCarthy and top Republicans have begun to strategize about how to move forward with an impeachment inquiry into President Joe Biden this fall - the latest sign that the House GOP is seriously laying … ",
    "url": "https://www.cnn.com/2023/08/28/politics/mccarthy-biden-impeachment-strategy/"
  }
]