[
  {
    "text": "Murkowski knocks Musk over ‘absurd weekend email’  —  Sen. Lisa Murkowski (R-Alaska) slammed Elon Musk over an “absurd weekend email” sent to federal employees requiring they send the Office of Personnel Management (OPM) a list of what they accomplished in the past week.",
    "url": "https://thehill.com/homenews/senate/5160216-murkowski-knocks-musk-over-absurd-weekend-email/"
  },
  {
    "text": "Email starts power clash between Musk and agency leaders — even the Trump loyalists  —  The response to Elon Musk's “What did you do last week?” threat is the first sign that even staunch White House allies are beginning to flex their political muscle against him.",
    "url": "https://www.politico.com/news/2025/02/23/musk-guidance-conflict-agency-leaders-00205640"
  },
  {
    "text": "Key federal agencies refuse to comply with Musk's latest demand in his cost-cutting crusade  —  Key U.S. agencies, including the FBI, State Department and the Pentagon, have instructed their employees not to comply with cost-cutting chief Elon Musk's latest demand that federal workers explain … ",
    "url": "https://apnews.com/article/musk-federal-workers-trump-demand-firings-06553df358086db05917d3c50f3699d6"
  },
  {
    "text": "Some Agencies Urge Staff Not to Comply With Musk's Ultimatum  —  The F.B.I. director, Kash Patel, the director of national intelligence, Tulsi Gabbard, and others told employees not to respond to a directive from Mr. Musk to summarize their accomplishments.  —  Several Trump administration … ",
    "url": "https://www.nytimes.com/2025/02/23/us/politics/elon-musk-email-federal-workers.html?unlocked_article_code=1.zE4.jUot.IMfNMHuRDW8a"
  },
  {
    "text": "Germany's Merz vows ‘independence’ from Trump's America, warning NATO may soon be dead  —  BERLIN — Friedrich Merz did not even wait for the final results in Germany's election before delivering what could well be a defining verdict on U.S. President Donald Trump, consigning Europe's 80-year alliance with the United States to the past.",
    "url": "https://www.politico.eu/article/friedrich-merz-germany-election-united-states-donald-trump-nato/"
  },
  {
    "text": "German election: Friedrich Merz urges ‘independence’ from US  —  To view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video  —  Early projections say Germany's conservative bloc has secured some 28.5% of the votes ahead of the far-right AfD with over 20%.",
    "url": "https://www.dw.com/en/german-election-friedrich-merz-urges-independence-from-us/live-71700729"
  },
  {
    "text": "Joy Reid's MSNBC Show Canceled in Major Shake-Up  —  Ms. Reid's 7 p.m. program will be replaced by a panel show co-hosted by Symone Sanders Townsend, Alicia Menendez and Michael Steele.  —  Joy Reid's evening news show on MSNBC is being canceled, part of a far-reaching programming overhaul orchestrated … ",
    "url": "https://www.nytimes.com/2025/02/23/business/msnbc-joy-reid.html?unlocked_article_code=1.zE4.FslK.eZ38_1_IrEe5&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Outside Tesla in the Philly suburbs, the green shoots of an American uprising  —  There was a mad-as-hell-can't-take-it-anymore moment for every one of the dozen or so sign-waving protesters who stood on the side of busy Route 30 in suburban Devon on a brisk but brightly sunny Saturday morning … ",
    "url": "https://www.inquirer.com/opinion/commentary/tesla-protest-philadelphia-elon-musk-20250223.html"
  },
  {
    "text": "Enrique Tarrio follows and insults officers who defended US Capitol on January 6  —  Ex-leader of far-right Proud Boys trails group through lobby of Washington hotel, engaging officer Michael Fanone  —  Enrique Tarrio, the former leader of the far-right Proud Boys group who was convicted … ",
    "url": "https://www.theguardian.com/us-news/2025/feb/22/enrique-tarrio-capitol-police"
  },
  {
    "text": "Chaos erupts at legislative town hall in Coeur d'Alene  —  COEUR d'ALENE — Saturday's legislative town hall hosted by the Kootenai County Republican Central Committee turned volatile after some attendees voiced their concerns over the possible repeal of Medicaid expansion and other bills working their way through the Idaho Legislature.",
    "url": "https://cdapress.com/news/2025/feb/22/chaos-erupts-at-kcrcc-legislative-town-hall/"
  },
  {
    "text": "The Trump administration is firing 2,000 USAID workers and putting thousands of others on leave  —  The Trump administration said Sunday that it is eliminating 2,000 posts at the U.S. Agency for International Development and placing all but a fraction of others worldwide on leave.",
    "url": "https://apnews.com/article/usaid-trump-musk-foreign-aid-firings-a3af8ce6ef17878b718c8e2ed3bf98e4"
  },
  {
    "text": "Republicans Face Angry Voters at Town Halls, Hinting at Broader Backlash  —  After a monthlong honeymoon for the G.O.P. at the start of President Trump's term, lawmakers are confronting a groundswell of fear and disaffection in districts around the country.  —  Some came with complaints … ",
    "url": "https://www.nytimes.com/2025/02/23/us/politics/republicans-congress-town-halls-trump.html?unlocked_article_code=1.zE4.ac8t.Fpct8t-bKu6p&smid=url-share"
  },
  {
    "text": "Condoms for Gaza?  Ukraine started the war with Russia?  The president's manipulations of the truth lay the groundwork for radical change.  —  The United States sent $50 million in condoms to Hamas.  Diversity programs caused a plane crash.  China controls the Panama Canal.  Ukraine started the war with Russia.",
    "url": "https://www.nytimes.com/2025/02/23/us/politics/trump-alternative-reality.html?unlocked_article_code=1.zE4.dM37.lKwB_tcaCnbp"
  },
  {
    "text": "German election: Projections say CDU/CSU leads with 29%  —  To view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video  —  Early projections say Germany's conservative bloc has secured some 29% of the votes, emerging as the largest party ahead of the far-right AfD with around 19.5%.",
    "url": "https://www.dw.com/en/german-election-projections-say-cdu-csu-leads-with-29/live-71700729"
  },
  {
    "text": "Trump Envoy Can't Name a Single Concession Russia Will Make in Peace Deal  —  CNN host Jake Tapper exposed President Trump's negotiation strategy in the war in Ukraine as a top foreign affairs envoy struggled to point out one concession Russia would make in a peace deal.",
    "url": "https://www.thedailybeast.com/trump-envoy-steve-witkoff-cant-name-a-single-concession-russia-will-make-in-peace-deal/"
  },
  {
    "text": "Photos: ‘Distress flag’ towers over Yosemite to protest cuts as crowds view firefall  —  A group of frustrated Yosemite National Park staffers hoping to draw attention to the federal government's sweeping workforce cuts hung an upside-down American flag Saturday thousands of feet off the ground on the side of El Capitan.",
    "url": "https://www.sfchronicle.com/outdoors/article/yosemite-protest-job-cuts-20180229.php"
  },
  {
    "text": "Minnesota Senator Calls Elon Musk ‘A Dick’  —  “This is the ultimate dick boss move from Musk - except he isn't even the boss, he's just a dick.”  —  Sen. Tina Smith (D-Minn.) called out Elon Musk for his new requirement that all federal employees defend their jobs or else get fired.",
    "url": "https://www.huffpost.com/entry/minnesota-senator-calls-elon-musk-a-dick_n_67bb513ce4b081ef58f9dc28"
  },
  {
    "text": "Local news deserves high marks for coverage of the doge fallout  —  Local news is doing what it does best: build trust by reporting on stories local residents can verify with their own eyes.  Recently, much of that reporting has focused on the local impact of the reckless actions of Donald Trump and Elon Musk.",
    "url": "https://jenniferschulze.substack.com/p/local-news-deserves-high-marks-for"
  },
  {
    "text": "Chris Murphy Emerges as a Clear Voice for Democrats Countering Trump  —  The second-term senator from Connecticut is eschewing caution and throwing out the traditional political playbook as he seeks a broader audience for his critiques of the president and his agenda.",
    "url": "https://www.nytimes.com/2025/02/23/us/politics/chris-murphy-democrats-trump.html?unlocked_article_code=1.zE4.I5EL.cs0dK-t2A4PK&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "GOP's Lawler breaks with Trump on Zelensky, advises against public spat  —  Rep. Mike Lawler (R-N.Y.) broke with President Trump over Ukrainian President Volodymyr Zelensky and advised against a public spat between the two leaders.  —  “Are you disturbed at all by the rhetoric coming from the Trump administration about Zelensky?”",
    "url": "https://thehill.com/homenews/house/5160257-gops-lawler-breaks-with-trump-on-zelensky-advises-against-public-spat/"
  },
  {
    "text": "Thousands in Midwestern GOP Districts Attend Sanders' First Stops on Tour to Fight Oligarchy  —  After addressing more than 3,400 Nebraska residents in Omaha Friday evening, U.S. Sen. Bernie Sanders on Saturday made his second stop on his National Tour to Fight Oligarchy—telling Iowa City … ",
    "url": "https://www.commondreams.org/news/bernie-sanders-donald-trump"
  },
  {
    "text": "Trump officials prepare plans to revive Title 42 policy to expel migrants, documents show  —  Washington — The Trump administration has prepared plans to implement a policy that would allow U.S. immigration officials to swiftly expel migrants on the grounds that they could spread diseases like tuberculosis … ",
    "url": "https://www.cbsnews.com/news/trump-title-42-migrants-documents/"
  },
  {
    "text": "Hegseth: Trump Will Install New Military Attorneys Who Won't Be ‘Roadblocks to Anything’  —  The defense secretary justified the firings of top judge advocate generals  —  Secretary of Defense Pete Hegseth defended the Trump administration's purge of top military lawyers because they want people … ",
    "url": "https://www.rollingstone.com/politics/politics-news/hegseth-military-lawyers-firings-roadblocks-1235276960/"
  },
  {
    "text": "Disability amid disaster: People with disabilities are disproportionately impacted by natural disasters  —  After disasters, people with disabilities are more likely to be displaced, more likely to never return home and more likely to receive scam offers, Census Bureau data shows.",
    "url": "https://www.nbcnews.com/data-graphics/people-disabilities-are-disproportionately-impacted-natural-disasters-rcna192577"
  },
  {
    "text": "Why the Government Will Probably Shut Down in March  —  The U.S. government's current stopgap spending measure expires on March 14.  But if your instinct is to scoff at the latest talk of a government shutdown as a boy-cries-wolf phenomenon, that's understandable.",
    "url": "https://nymag.com/intelligencer/article/why-a-government-shutdown-in-march-is-so-likely.html"
  }
]