[
  {
    "text": "Columbia Yields to Trump in Battle Over Federal Funding  —  School to ban masks, empower police and rein in controversial academic department  —  Columbia University will cede to President Trump's far-reaching demands in negotiations over $400 million in federal funding he revoked this month … ",
    "url": "https://www.wsj.com/us-news/education/columbia-university-trump-demands-federal-funding-e94d41ca?st=MVb992&reflink=article_copyURL_share"
  },
  {
    "text": "Decades Ago, Columbia Refused to Pay Trump $400 Million  —  A quarter century ago, the university was looking to expand.  It considered, and rejected, property owned by Donald Trump.  He did not forget it.  —  Donald Trump was demanding $400 million from Columbia University.",
    "url": "https://www.nytimes.com/2025/03/21/nyregion/trump-columbia-university-400-million.html?unlocked_article_code=1.5k4.gPqS.2tWiVKxmUmh8&smid=url-share"
  },
  {
    "text": "Columbia Agrees to Trump's Demands After Federal Funds Are Stripped  —  The administration has moved to cut $400 million in federal funding to the university without changes to its policies and rules.  —  Columbia University agreed on Friday to overhaul its protest policies … ",
    "url": "https://www.nytimes.com/2025/03/21/nyregion/columbia-response-trump-demands.html"
  },
  {
    "text": "Under threat from Trump, Columbia University agrees to policy changes  —  Columbia University agreed Friday to put its Middle East studies department under new supervision and overhaul its rules for protests and student discipline, acquiescing to an extraordinary ultimatum by the Trump administration … ",
    "url": "https://apnews.com/article/columbia-university-funding-trump-fa70143c715df8fd4ef337c0e1ccf872"
  },
  {
    "text": "U.S. to revoke legal status of more than a half-million migrants, urges them to self deport  —  The Trump administration will be revoking the legal status of hundreds of thousands of Latin American and Haitian migrants welcomed into the U.S. under a Biden-era sponsorship process … ",
    "url": "https://www.cbsnews.com/news/u-s-to-revoke-legal-status-of-over-a-half-million-migrants-chnv/"
  },
  {
    "text": "Trump revokes legal status for 530,000 Cubans, Haitians, Nicaraguans and Venezuelans  —  U.S. President Donald Trump's administration will revoke the temporary legal status of 530,000 Cubans, Haitians, Nicaraguans and Venezuelans in the United States, according to a Federal Register notice on Friday … ",
    "url": "https://www.reuters.com/world/us/trump-revokes-legal-status-530000-cubans-haitians-nicaraguans-venezuelans-2025-03-21/"
  },
  {
    "text": "Federal judge pushes back on acting Social Security head over threat to close agency  —  Leland Dudek backed off his argument that a ruling blocking Elon Musk's cost-cutting team from access to sensitive data could apply to all agency employees.  —  just now",
    "url": "https://www.washingtonpost.com/politics/2025/03/21/social-security-benefits-trump-doge/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQyNTI5NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQzOTExOTk5LCJpYXQiOjE3NDI1Mjk2MDAsImp0aSI6ImU3ZTBmZGQxLWUzNGItNDE4Ny1hMTFjLTZmZGU1YmZiZmE3ZiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzAzLzIxL3NvY2lhbC1zZWN1cml0eS1iZW5lZml0cy10cnVtcC1kb2dlLyJ9.NSr5fpbMc10PSQWZy7qubcqNthsh_Bjoq8b_btWprZ0&itid=gfta"
  },
  {
    "text": "Trump says he didn't sign proclamation invoking Alien Enemies Act  —  President Donald Trump on Friday downplayed his involvement in invoking the Alien Enemies Act of 1798 to deport Venezuelan migrants, saying for the first time that he hadn't signed the proclamation, even as he stood by his administration's move.",
    "url": "https://www.cnn.com/2025/03/21/politics/trump-signature-alien-enemies-act-proclamation/"
  },
  {
    "text": "Trump Fires Nearly the Entire Civil Rights Branch of D.H.S.  —  The move guts the office responsible for oversight over President Trump's immigration crackdown.  —  The Trump administration fired nearly the entire civil rights branch of the Department of Homeland Security on Friday … ",
    "url": "https://www.nytimes.com/2025/03/21/us/politics/trump-civil-rights-homeland-security-deportations.html?unlocked_article_code=1.5k4.RV0s._A5mbmF3TuC0&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Commerce secretary: No one but ‘fraudsters’ would complain about missed Social Security check  —  Commerce Secretary Howard Lutnick raised alarm over “fraudsters” receiving Social Security benefits, as Trump allies have ramped up rhetoric about potential waste in the program amid … ",
    "url": "https://thehill.com/homenews/administration/5208187-commerce-secretary-social-security-fraud/"
  },
  {
    "text": "Trump announces Boeing wins sixth-generation aircraft contract for F-47  —  President Donald Trump announced Friday that the Air Force is “moving forward” with the plan to acquire the “world's first sixth-generation fighter jet,” named the F-47.  —  Trump said Boeing beat out Lockheed Martin … ",
    "url": "https://www.washingtonexaminer.com/policy/defense/3355212/trump-boeing-sixth-generation-fighter-jet-contract-f47/"
  },
  {
    "text": "No evidence of coordinated vandalism of Teslas despite Musk and Trump claims  —  The attacks have come as Musk has emerged as one of the brightest flashpoints of an already tumultuous second Trump administration.  —  Law enforcement officials and domestic extremism experts say they have found … ",
    "url": "https://www.nbcnews.com/tech/elon-musk/tesla-vandalism-not-coordinated-trump-musk-claims-rcna197369"
  },
  {
    "text": "Legal community shaken by a powerful law firm's decision to give in to Trump's demands  —  President Donald Trump rescinded his executive order targeting Paul Weiss — after the law firm agreed to certain conditions.  —  WASHINGTON — On Thursday, the powerful law firm Paul Weiss caved.",
    "url": "https://www.nbcnews.com/politics/trump-administration/legal-community-shaken-powerful-law-firm-paul-weiss-trump-rcna197490"
  },
  {
    "text": "Voice of America staff sue Trump administration for shutting down network  —  Six Voice of America journalists sued Kari Lake and the Trump administration on Friday, alleging their moves to shut down the U.S.-funded network were unlawful and unconstitutional.",
    "url": "https://www.npr.org/2025/03/21/nx-s1-5336351/voice-of-america-trump-lawsuit-kari-lake-voa"
  },
  {
    "text": "Finland, Denmark Issue Travel Warnings For US  —  Denmark and Finland have revised their travel guidance for transgender individuals planning to visit the United States.  —  Newsweek has contacted the ministry for comment via email.  —  Why It Matters  —  The move follows similar guidance updates … ",
    "url": "https://www.newsweek.com/denmark-issues-travel-warning-us-2048508"
  },
  {
    "text": "Trump revokes access to classified material for Kamala Harris, Hillary Clinton and Biden officials  —  Trump previously cut off former President Joe Biden's access to intelligence material.  —  President Donald Trump in a Friday night memo rescinded any existing security clearances and access … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-revokes-access-classified-material-kamala-harris-hillary-clinton-rcna197591"
  },
  {
    "text": "“They hate us”: Democrats confront their own Tea Party  —  Democratic members of Congress, back home in their districts for the last week, have been encountering a level of anger and hostility that some see as reminiscent of the 2010 Tea Party wave.  —  Why it matters: The dynamic could spill … ",
    "url": "https://www.axios.com/2025/03/21/democrats-house-senate-tea-party-trump"
  },
  {
    "text": "Trump Endorses Brad Schimel in Wisconsin Supreme Court Race  —  The president threw his support to Brad Schimel, the conservative candidate in a race for control of the battleground state's top court.  Elon Musk has spent millions of dollars on the contest.",
    "url": "https://www.nytimes.com/2025/03/21/us/politics/trump-schimel-wisconsin-supreme-court.html"
  },
  {
    "text": "Two Utah GOP representatives hosted a town hall.  They were met with shouts of ‘shame’ and ‘do your job.’  —  Reps. Celeste Maloy and Mike Kennedy appear to be the only members of Utah's congressional delegation to hold a town hall during the March recess.  —  Over the course of an hour … ",
    "url": "https://www.sltrib.com/news/politics/2025/03/20/utah-gop-reps-maloy-kennedy-told/"
  },
  {
    "text": "Leakers to Musk: We're 'not Elon's servants'  —  Even before Musk's comments, federal workers felt vulnerable and increasingly incensed.  —  The pervasive fear and anger that have been rippling through federal agencies over Elon Musk's slashing approach to shrinking government deepened … ",
    "url": "https://www.politico.com/news/2025/03/21/musk-leakers-government-trump-doge-00243208"
  },
  {
    "text": "George Foreman, Boxing Champion and Grilling Magnate, Dies at 76  —  He claimed a world title in his 20s and again in his 40s, and then made millions selling grills.  —  George Foreman, a heavyweight boxing champion who returned to the sport to regain his title at the improbable age of 45 … ",
    "url": "https://www.nytimes.com/2025/03/21/sports/george-foreman-dead.html"
  },
  {
    "text": "Trump says student loans moving to SBA, ‘special needs’ to HHS  —  President Trump said Friday he is “immediately” moving the handling of federal student loans to the Small Business Administration (SBA), and shifting programs for students with disabilities to the Department of Health and Human Services … ",
    "url": "https://thehill.com/homenews/education/5207597-trump-student-loans-sba-special-needs-disabled-students-hhs-mcmahon-kennedy/"
  }
]