[
  {
    "text": "When Debates Don't Go Well, Donald Trump Has a Go-To Move  —  It does not usually involve congratulating the moderators for their impartiality and quietly resolving to do better the next time.  —  As former President Donald J. Trump sought to minimize the damage done by Tuesday night's debate … ",
    "url": "https://www.nytimes.com/2024/09/12/us/politics/trump-debate.html"
  },
  {
    "text": "Trump's mental capacity is now topic one  —  The Donald Trump who melted down on the debate stage Tuesday night is not a well man.  —  He sounded like a lunatic.  He expressed his belief in things that simply aren't true.  (Think: “They're eating the dogs.  They're eating the cats.\")",
    "url": "https://presswatchers.org/2024/09/trumps-mental-capacity-is-now-topic-one/"
  },
  {
    "text": "$47 Million Flowed Into Harris Campaign in 24 Hours After Debate  —  The sum included donations from 600,000 individuals.  Vice President Kamala Harris already had a significant financial edge over former President Donald J. Trump entering September.  —  Vice President Kamala Harris raised $47 million … ",
    "url": "https://www.nytimes.com/2024/09/12/us/politics/harris-debate-donations.html"
  },
  {
    "text": "Harris Extends Lead Over Trump After First Presidential Debate  —  The Democratic nominee leads the Republican by 5 points among likely voters following Tuesday's face-off  —  Data Downloads  —  A sortable CSV of results among likely voters in the Kamala Harris-Donald Trump presidential match-up",
    "url": "https://pro.morningconsult.com/instant-intel/harris-trump-first-debate-poll"
  },
  {
    "text": "‘Disturbing’: Lindsey Graham Says Trump Shouldn't Pal Around With 9/11 Conspiracy Theorist  —  “I think that the president would serve himself well to make sure this doesn't become a bigger story,” the South Carolina senator said of Trump's associations with far-right activist Laura Loomer.  —  LOADING",
    "url": "https://www.huffpost.com/entry/laura-loomer-trump-graham_n_66e32519e4b0056e82917b22"
  },
  {
    "text": "Is the Entire World Conspiring to Make It Look Like Trump Lost the Debate? … In the immediate aftermath of the presidential debate, most reporters and analysts conveyed a similar narrative of what had transpired: Kamala Harris baited Donald Trump into an angry, frequently incoherent performance.",
    "url": "https://nymag.com/intelligencer/article/donald-trump-lost-debate-matt-taibbi-kamala-harris.html"
  },
  {
    "text": "Trump's Repetitive Speech Is a Bad Sign  —  If the debate was a cognitive test, the former president failed.  —  Tuesday's presidential debate was, among other things, an excellent real-world test of the candidates' cognitive fitness—and any fair-minded mental-health expert would be very worried about Donald Trump's performance.",
    "url": "https://www.theatlantic.com/health/archive/2024/09/trump-harris-debate-cognitive-decline/679803/"
  },
  {
    "text": "Fox News host triggers Donald Trump by saying “he decisively lost” the debate with Kamala Harris  —  Fox Business anchor Neil Cavuto said the debate wasn't close, declaring it a “lopsided” loss for the Republican  —  Republican and Democratic critics alike had some pointers for Donald Trump … ",
    "url": "https://www.salon.com/2024/09/12/fox-news-host-triggers-donald-by-saying-he-decisively-lost-the-debate-with-kamala-harris/"
  },
  {
    "text": "When a Lie Becomes a Bomb Threat: The Fallout of a Racist Conspiracy in Springfield  —  Trump and Vance's baseless claims about pet-eating Haitian immigrants show how falsehoods spread for political gain can lead to real-world chaos.  —  The lie was absurd, and yet it spread like wildfire.",
    "url": "https://www.readtpa.com/p/when-a-lie-becomes-a-bomb-threat"
  },
  {
    "text": "Robert F. Kennedy Jr. Has Sabotaged Early Voting in a Critical Swing State  —  The North Carolina Supreme Court tossed a grenade into the state's election on Monday, violating both state and federal law to grant Robert F. Kennedy Jr.'s cynical, last-minute removal from the ballot.",
    "url": "https://slate.com/news-and-politics/2024/09/north-carolina-robert-kennedy-early-voting-trump-sabotage.html"
  },
  {
    "text": "In blow to Newsmax, judge rules Smartmatic's case over 2020 election lies will go to trial this month  —  A major defamation case against Newsmax will proceed to trial later this month, a judge ruled Thursday, dealing a blow to the right-wing network and setting the stage for the 2020 election … ",
    "url": "https://www.cnn.com/smartmatic-newsmax-trial-2020-election-fox/"
  },
  {
    "text": "Manchin opens door for Schumer on judicial confirmations … - That's a huge win for Schumer, who was previously looking to capitalize on GOP absences or rely on Vice President Kamala Harris to break ties.  —  In a surprise, Manchin voted to advance the nomination of Kevin Ritz … ",
    "url": "https://www.axios.com/2024/09/13/manchin-schumer-judicial-confirmations-biden-trump"
  },
  {
    "text": "Judge narrows election interference case against Trump in Georgia  —  Judge Scott McAfee wrote in his decision that 3 of the counts could no longer stand because they involved accusations of perjury or false statements under federal jurisdiction.  —  ATLANTA — The judge in election interference case … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/judge-narrows-election-interference-case-trump-georgia-rcna170898"
  },
  {
    "text": "These people have seen Harris in the Situation Room.  Here's what they have to say.  —  Harris is “more hard-line than most people think,” says a retired four-star general who has briefed her many times.  —  Would Kamala Harris make a good president and commander in chief?",
    "url": "https://www.washingtonpost.com/opinions/2024/09/12/harris-commander-predictions-colleagues/"
  },
  {
    "text": "How Elon Musk Secretly Tried to Oust a Texas Prosecutor  —  In a bid to counter George Soros, the Tesla chief executive unsuccessfully backed the opponent of a progressive district attorney  —  Elon Musk secretly channeled hundreds of thousands of dollars into a local race in Travis County … ",
    "url": "https://www.wsj.com/us-news/elon-musk-texas-da-jose-garza-oust-atempt-206db043?st=0r4kfh0mlpe0euo"
  },
  {
    "text": "Trump's Bedminster club hosted an alleged Nazi sympathizer who stormed the Capitol  —  Twice this past summer, Donald Trump's golf club in Bedminster, N.J. has featured speeches from a rioter convicted of participating in the Jan. 6, 2021 attack on the U.S. Capitol, who has a well-documented history … ",
    "url": "https://www.npr.org/2024/09/12/nx-s1-5107435/trump-capitol-riot-antisemitic-bedminster"
  },
  {
    "text": "Biden Poised to Approve Ukraine's Use of Long-Range Western Weapons in Russia  —  The topic will be on the agenda Friday with the first official visit to Washington by Britain's new prime minister, Keir Starmer.  —  President Biden appears on the verge of clearing the way for Ukraine … ",
    "url": "https://www.nytimes.com/2024/09/12/us/politics/biden-ukraine-weapons.html"
  },
  {
    "text": "Neither Elon Musk Nor Anybody Else Will Ever Colonize Mars  —  Mars does not have a magnetosphere.  Any discussion of humans ever settling the red planet can stop right there, but of course it never does.  Do you have a low-cost plan for, uh, creating a gigantic active dynamo at Mars's dead core?",
    "url": "https://defector.com/neither-elon-musk-nor-anybody-else-will-ever-colonize-mars"
  }
]