[
  {
    "text": "Paramount to Pay Trump $16 Million to Settle ‘60 Minutes’ Lawsuit  —  President Trump sued Paramount over a “60 Minutes” interview with his opponent, former Vice President Kamala Harris.  —  Paramount has agreed to pay President Trump $16 million to settle his lawsuit over the editing … ",
    "url": "https://www.nytimes.com/2025/07/02/business/media/paramount-trump-60-minutes-lawsuit.html?unlocked_article_code=1.TU8.YC_b.1krdNQ5ih266&smid=nytcore-android-share"
  },
  {
    "text": "Paramount, CBS forced to pay eight figures, change editorial policy in settlement with President Trump  —  Result of the agreement on lawsuit could reach north of $30 million with $16 million upfront  —  FIRST ON FOX - Paramount Global and CBS agreed on Tuesday to pay President Donald Trump … ",
    "url": "https://www.foxnews.com/media/paramount-global-settles-trumps-lawsuit-against-cbs-news-over-60-minutes-interview"
  },
  {
    "text": "Paramount will pay $16 million in settlement with Trump over ‘60 Minutes’ interview  —  In a case seen as a challenge to American free-speech principles, Paramount has agreed to pay $16 million to settle a lawsuit by President Donald Trump over the editing of CBS' “ 60 Minutes” … ",
    "url": "https://apnews.com/article/trump-media-harris-minutes-paramount-6415042fe910ae60b432dd8c73ef61b2"
  },
  {
    "text": "The Conscience of Lisa Murkowski  —  Today's newsletter is farrago of cruelty, cowardice, betrayal, and hypocrisy. … — Lisa Murkowski.  —  Or not.  —  This morning, I'm tempted to write that Lisa Murkowski is simply the worst.  But, of course this is unfair, because there is so much competition for that distinction.",
    "url": "https://charliesykes.substack.com/p/the-conscience-of-lisa-murkowski"
  },
  {
    "text": "Trump Meets GOP Hardliners as Tax Bill Hits Resistance in House  —  President Donald Trump is meeting with a faction of conservative lawmakers at the White House who have threatened to sink his signature tax legislation over its $3.4 trillion price tag as lawmakers cast doubt on whether it can pass by July 4.",
    "url": "https://www.bloomberg.com/news/articles/2025-07-02/house-republican-hardliners-warn-of-a-delay-to-trump-tax-vote"
  },
  {
    "text": "Trump Says U.S. Has Reached Trade Deal With Vietnam  —  The president said he had agreed to initial trade terms with Vietnam, the second country to strike a limited deal after Mr. Trump threatened steep tariffs.  —  President Trump said on Wednesday that the United States had reached … ",
    "url": "https://www.nytimes.com/2025/07/02/business/economy/trump-vietnam-trade-deal.html"
  },
  {
    "text": "Analysis shows Trump's tariffs would cost US employers $82.3 billion  —  An analysis finds a critical group of U.S. employers would face a direct cost of $82.3 billion from President Donald Trump's current tariff plans, a sum that could potentially be managed through price hikes, layoffs, hiring freezes or lower profit margins.",
    "url": "https://apnews.com/article/trump-tariffs-analysis-employers-consumers-prices-6fef729ff39ce24fcd46bbb60134b032"
  },
  {
    "text": "Wisconsin Supreme Court's liberal majority strikes down 176-year-old abortion ban  —  The Wisconsin Supreme Court's liberal majority struck down the state's 176-year-old abortion ban on Wednesday, ruling 4-3 that it was superseded by a newer state law that criminalizes abortions only after a fetus can survive outside the womb.",
    "url": "https://apnews.com/article/wisconsin-abortion-ban-1849-01658358639a63db7df92aeec34c612d"
  },
  {
    "text": "Wisconsin Supreme Court Strikes Down 1849 Abortion Ban  —  After the U.S. Supreme Court overturned Roe v. Wade in 2022, Republican prosecutors in Wisconsin had said they intended to enforce the old law.  —  The Wisconsin Supreme Court invalidated a state abortion ban on Wednesday that was enacted … ",
    "url": "https://www.nytimes.com/2025/07/02/us/wisconsin-abortion-1849-supreme-court.html?unlocked_article_code=1.TU8.5DH8.EWL106_QmJud&smid=url-share"
  },
  {
    "text": "The private sector lost 33,000 jobs in June, badly missing expectations for a 100,000 increase, ADP says … Private sector hiring unexpectedly contracted in June, payrolls processing firm ADP said Wednesday, in a possible sign that the economy may not be as sturdy as investors believe … ",
    "url": "https://www.cnbc.com/2025/07/02/adp-jobs-report-june-2025.html"
  },
  {
    "text": "Tesla Sales Fall 13%, Putting Carmaker on Course for Annual Drop  —  Tesla Inc. shares jumped after the carmaker posted a less drastic decline in vehicle sales than the most pessimistic analysts feared.  —  The company delivered 384,122 vehicles during the last three months, down 13% from a year earlier.",
    "url": "https://www.bloomberg.com/news/articles/2025-07-02/tesla-sales-fall-13-putting-carmaker-on-course-for-annual-drop"
  },
  {
    "text": "What is and isn't legal when ICE officers make an immigration arrest  —  Videos showing masked officers whisking people into unmarked cars have sparked outcry.  A look at ICE's powers as Congress prepares to give the agency a giant infusion of cash.  —  Summary1415",
    "url": "https://www.washingtonpost.com/immigration/2025/07/02/ice-raids-arrests-masks-warrants-kids/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzUxNDI4ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzUyODExMTk5LCJpYXQiOjE3NTE0Mjg4MDAsImp0aSI6ImU1NmZlMjFiLWI1OWQtNDFlOC1iMzQxLTA4MzFiYmQ1ZTk5NCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9pbW1pZ3JhdGlvbi8yMDI1LzA3LzAyL2ljZS1yYWlkcy1hcnJlc3RzLW1hc2tzLXdhcnJhbnRzLWtpZHMvIn0.Kh9fZ43UMlhmugo1z9eJs9cIj27qLYFQ4R2_G2mUI7M&itid=gfta"
  },
  {
    "text": "Judge Rejects Trump's Attempt to Stop Asylum Claims  —  The judge wrote that neither the Constitution nor federal immigration law gave the president the authority to “adopt an alternative immigration system.”  —  A federal judge in Washington ruled on Wednesday that the Trump administration … ",
    "url": "https://www.nytimes.com/2025/07/02/us/politics/asylum-trump.html?unlocked_article_code=1.TU8.oFiG.scm8h_9vNgmY&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "The Grand Opening of an American Concentration Camp  —  What were you doing the day the president attended the opening of an American concentration camp in the Everglades?  Dubbed “Alligator Alcatraz” by Republican officials because of the predators living in the surrounding swampland … ",
    "url": "https://newrepublic.com/article/197508/alligator-alcatraz-trump-concentration-camp"
  },
  {
    "text": "Trump's Finances Were Shaky.  Then He Began to Capitalize on His Comeback. … An attendee posed with a cutout of President Trump at a Bitcoin conference in Las Vegas at the end of May.Gabriela Bhaskar/The New York Times  —  Last spring, even as Donald J. Trump's march back toward … ",
    "url": "https://www.nytimes.com/2025/07/02/us/trump-finances-crypto.html?unlocked_article_code=1.TU8.0-Hw.gkOsbJKO2qrj&smid=url-share"
  },
  {
    "text": "Trump pick to run federal watchdog: A 30-year-old who once shared a 9/11 conspiracy video and has ties to a Holocaust denier  —  The man President Donald Trump wants to put in charge of protecting whistleblowers - and rooting out government corruption - is a 30-year-old lawyer with barely … ",
    "url": "https://cnn.com/2025/07/02/politics/kfile-paul-ingrassia-office-of-special-counsel-nomination"
  },
  {
    "text": "Fox News, MAGA hats and cookies: Inside Trump's West Wing  —  Trump likes to see whom he wants and call whom he chooses, and in the new term, he presides over a White House that mirrors the man, current and former aides say.  —  WASHINGTON — The military leaders who came to the Oval Office … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/fox-news-maga-hats-cookies-trump-west-wing-rcna214754"
  },
  {
    "text": "Lack of New U.S. Sanctions Allows Restricted Goods and Funds Into Russia  —  President Trump has issued no new restrictions on Russia this year, in effect allowing Moscow to acquire the money and materials it needs in its conflict with Ukraine.  —  Since President Trump returned to office in January … ",
    "url": "https://www.nytimes.com/2025/07/02/us/politics/trump-russia-sanctions.html?unlocked_article_code=1.TU8.Ws2y.fRC0JkjyS7Sx&smid=url-share"
  },
  {
    "text": "Attorney general: ‘Everyone is Welcome Here’ sign cannot be displayed in Idaho schools  —  (UPDATED, 3:30 p.m., Monday, with comments from Sarah Inama.)  —  The “Everyone is Welcome Here” sign that sparked a viral nationwide controversy can no longer be displayed in Idaho schools … ",
    "url": "https://www.idahoednews.org/top-news/attorney-general-everyone-is-welcome-here-sign-cannot-be-displayed-in-idaho-schools/"
  },
  {
    "text": "Ukraine summons top US diplomat after Washington halts some arms supplies  —  Reduction in weapons shipments makes Kyiv more vulnerable to Russia's escalating attacks  —  Christopher Miller and Fabrice Deprez in Kyiv and James Politi in Washington  —  Ukraine summoned a top diplomat … ",
    "url": "https://www.ft.com/content/b69e327d-95a3-487d-a9b6-6a72ef48ba61"
  },
  {
    "text": "Inside the Dysfunction at Rubio's Shrunken National Security Council  —  Fewer meetings, more top-down demands and worries some officials may go rogue are upending the system.  —  When the Pentagon recently launched a review of a landmark security pact with Australia and the United Kingdom … ",
    "url": "https://www.politico.com/news/magazine/2025/07/02/trumps-national-security-council-is-flailing-00436700"
  }
]