[
  {
    "text": "Gag Order Against Trump Is Expanded to Bar Attacks on Judge's Family  —  Donald Trump had in recent days targeted the daughter of Juan Merchan, the judge overseeing his criminal trial in Manhattan, in blistering social media posts.  —  The New York judge overseeing Donald J. Trump's upcoming … ",
    "url": "https://www.nytimes.com/2024/04/01/nyregion/trump-gag-order-juan-merchan.html"
  },
  {
    "text": "Donald Trump has posted a $175 million bond to avert asset seizure as he appeals NY fraud penalty  —  Donald Trump posted a $175 million bond on Monday in his New York civil fraud case, halting collection of the more than $454 million he owes and preventing the state from seizing his assets … ",
    "url": "https://apnews.com/article/donald-trump-civil-fraud-trial-feb0593a5bbd3837edc0db195554eda1"
  },
  {
    "text": "Trump secures $175 million bond in New York civil fraud case  —  An appeals court last week reduced the amount of bond he was required to post.  —  Former President Donald Trump speaks at a campaign rally in Rome, GA, March 9, 2024.  —  Former President Donald Trump and his co-defendants … ",
    "url": "https://abcnews.go.com/US/trump-secures-175-million-bond-new-york-civil/story?id=108715465"
  },
  {
    "text": "Trump posts $175M bond to keep N.Y. authorities from seizing property  —  NEW YORK — Donald Trump posted a $175 million bond on Monday to prevent New York authorities from seizing his assets, including properties such as Trump Tower, pending appeal of a civil fraud judgment against him of nearly a half-billion dollars.",
    "url": "https://www.washingtonpost.com/national-security/2024/04/01/trump-new-york-bond-175-million/"
  },
  {
    "text": "Trump Media auditor warns that losses ‘raise substantial doubt’ about company's ability to continue  —  The Truth Social parent, which trades under the stock ticker DJT, said it lost more than $58 million last year.  —  An auditor has raised doubts about the ability of Donald Trump's publicly traded company … ",
    "url": "https://www.nbcnews.com/business/business-news/trump-media-auditor-warns-losses-raise-doubt-company-rcna145831"
  },
  {
    "text": "Florida Supreme Court upholds state's 15-week abortion ban, but voters will soon have a say  —  The Florida Supreme Court on Monday cleared the way for the state to ban abortions after six weeks of pregnancy, before many women know they are pregnant, while also giving voters a chance to remove restrictions in November.",
    "url": "https://apnews.com/article/florida-abortion-ban-supreme-court-ruling-6a4949fc7459afe9b5e298086a793126"
  },
  {
    "text": "RFK Jr. rebuked for calling Biden bigger threat to democracy than Trump  —  Independent presidential candidate Robert F. Kennedy Jr. repeatedly advanced an argument Monday that President Biden poses a greater threat to democracy than Donald Trump, a comment that drew swift rebukes from several historians and experts.",
    "url": "https://www.washingtonpost.com/elections/2024/04/02/rfk-jr-biden-trump-democracy/"
  },
  {
    "text": "RFK Jr. Lays Out Argument That Biden's a Bigger Threat to Democracy Than Trump  —  DEVIL'S ADVOCATE  —  On CNN, Kennedy—who some believe could help Trump win in November—was also confronted with his old criticisms of “spoiler” candidate Ralph Nader before the 2000 election.",
    "url": "https://www.thedailybeast.com/rfk-jr-lays-out-argument-that-bidens-a-bigger-threat-to-democracy-than-trump"
  },
  {
    "text": "Iran vows response after strike it blames on Israel demolishes consulate in Syria  —  Iran and one of its key proxies vowed Tuesday to respond to a strike widely attributed to Israel that demolished Iran's consulate in the Syrian capital of Damascus and killed eight people, including two Iranian generals.",
    "url": "https://apnews.com/article/iran-syria-israel-hezbollah-gaza-damascus-f7a1af3a9fc67de1962d4f1589d7e9f0"
  },
  {
    "text": "World Central Kitchen Says U.S. Citizen Among 7 Staff Killed in ‘Targeted’ Triple Israeli Attack  —  ‘UNFORGIVABLE’  —  José Andrés' international aid organization said it would pause its work in Gaza in the wake of the killings.  —  A dual U.S.-Canadian citizen … ",
    "url": "https://www.thedailybeast.com/world-central-kitchen-says-us-citizen-among-7-staff-killed-in-targeted-triple-israeli-attack"
  },
  {
    "text": "Corporate profit bonanza  —  In the last three months of 2023, after-tax corporate profits reached an all-time high of $2.8 trillion.  This is part of a long-term growth in corporate profits that began in the 1980s, picked up steam at the turn of the millennium, and exploded since 2020.",
    "url": "https://popular.info/p/corporate-profit-bonanza"
  },
  {
    "text": "Manufacturing discontent  —  How Dems can fight back against Republican resentment politics. … It's become something of a cottage industry to explore how white rural animus gives much-needed support to Republican candidates in local, state, and national elections.",
    "url": "https://www.publicnotice.co/p/white-maga-rural-rage-how-to-counter-it"
  },
  {
    "text": "Biden's Justice Department looks for scapegoats in overdose deaths  —  Americans concerned about the politicization of our legal system won't be comforted by the Department of Justice's lawsuit against Walmart's alleged role in the opioid crisis, which looked political from the jump.",
    "url": "https://thehill.com/opinion/white-house/4565622-biden-doj-looks-for-scapegoats-over-overdose-deaths/"
  },
  {
    "text": "House Republicans push to rename DC international airport after Trump  —  ‘In my lifetime, our nation has never been greater than under the leadership of President Donald J Trump’: Reschenthaler  —  FIRST ON FOX: A group of House Republicans is pushing to rename Washington, D.C.'s … ",
    "url": "https://www.foxnews.com/politics/house-republicans-push-rename-dc-international-airport-trump"
  },
  {
    "text": "Fake right-wing panic about “trans” Easter is part of Trump's push for Christian nationalism  —  Phony claims that Democrats “mock your faith” are a cynical excuse to strip Americans of religious freedom  —  Most Americans spent Easter weekend with traditional activities like church or egg hunts … ",
    "url": "https://www.salon.com/2024/04/02/fake-right-wing-panic-about-trans-easter-is-part-of-push-for-christian-nationalism/"
  },
  {
    "text": "Trump Allies Plan Anti-Racism Overhaul to Protect White People: Report  —  NEW PRIORITY  —  Donald Trump's close allies want to overhaul anti-racism protections to focus on protecting white people rather than people of color if he wins another term in November, according to a report.",
    "url": "https://www.thedailybeast.com/trump-allies-plan-anti-racism-overhaul-to-protect-white-people-report"
  },
  {
    "text": "Lou Conter, last survivor of USS Arizona from Pearl Harbor attack, dies at 102  —  Lou Conter, the last living survivor of the USS Arizona battleship that exploded and sank during the Japanese bombing of Pearl Harbor, has died.  He was 102.  —  Conter passed away on Monday at his home in Grass Valley … ",
    "url": "https://apnews.com/article/pearl-harbor-uss-arizona-survivor-lou-conter-e4fdc131104be724691c364177e55076"
  }
]