[
  {
    "text": "Jordan clinches Speaker nomination in GOP's second go at the gavel  —  House Republicans nominated Rep. Jim Jordan (R-Ohio) for Speaker on Friday, the conference's second attempt to find a candidate who can win the gavel on the House floor.  —  Jordan, currently chair of the House Judiciary Committee … ",
    "url": "https://thehill.com/homenews/house/4254931-jim-jordan-wins-speaker-nomination/"
  },
  {
    "text": "House Republicans collapse into anarchy  —  War in Israel.  War in Ukraine.  The federal government shutting down in 35 days.  These are uncertain times.  —  But there is one eternal truth, one unwavering constant to steady us when all else is in flux: Every time the House Republican majority tries … ",
    "url": "https://www.washingtonpost.com/opinions/2023/10/13/scalise-jordan-house-gop-speaker-chaos/"
  },
  {
    "text": "Fear and loathing grips the House GOP  —  While Republicans appear to be turning next to Jim Jordan, some are already airing open doubts that he can pull off what the majority leader couldn't.  —  The House GOP has entered an angrier and more bewildered phase in its leadership crisis.",
    "url": "https://www.politico.com/news/2023/10/13/republicans-speaker-mccarthy-jim-jordan-00121370"
  },
  {
    "text": "Live updates House GOP voting on speaker hopefuls Jim Jordan and Austin Scott  —  House Republicans on Friday afternoon are holding a closed-door vote between two nominees for speaker: Reps. Jim Jordan (Ohio) and Austin Scott (Ga.).  The conference is scrambling to find a nominee … ",
    "url": "https://www.washingtonpost.com/politics/2023/10/13/house-speaker-vote/"
  },
  {
    "text": "Israel orders unprecedented evacuation of 1 million in Gaza as possible ground offensive looms  —  Gaza's energy crisis risk hospitals turning into morgues  —  Israel Defense Forces release footage of assault on Gaza-adjacent outpost  —  Israel's military told some 1 million Palestinians … ",
    "url": "https://apnews.com/article/israel-palestinians-gaza-hamas-war-c8b4fc20e4fd2ef381d5edb7e9e8308c"
  },
  {
    "text": "Stunning State Department Memo Warns Diplomats: No Gaza ‘De-Escalation’ Talk  —  As Israel escalates its offensive, U.S. diplomats are being discouraged from publicly using three phrases that would urge calm.  —  As Israel escalates its attacks on Gaza, the State Department … ",
    "url": "https://www.huffpost.com/entry/state-department-internal-emails-gaza-israel_n_65296395e4b0a304ff6ff95d"
  },
  {
    "text": "Ground invasion of Gaza ‘imminent,’ Israeli officials say  —  The operation was expected following Hamas' brutal terrorist attack and has been seen as likely after Israel ordered an evacuation of northern Gaza.  —  Israel's ground invasion of Gaza is “imminent,” two Israeli officials said Friday … ",
    "url": "https://www.politico.com/news/2023/10/13/gaza-ground-invasion-israel-00121452"
  },
  {
    "text": "Will Narcissist Trump's Bizarre Praise for Hezbollah Hurt Him?  —  DONALD TRUMP HAS DEMONSTRATED YET AGAIN that he is a man without a single ounce of human decency.  At an event in West Palm Beach on Wednesday night, just four days after Hamas's brutal attack on Israeli civilians, Trump did the unthinkable.",
    "url": "https://plus.thebulwark.com/p/narcissist-trumps-bizarre-praise-hezbollah"
  },
  {
    "text": "Donald Trump's Israeli War Insight  —  He attacks Netanyahu in a crisis because of old personal grudges.  —  The front-runner for the GOP presidential nomination for some reason used the words “smart” and “Hezbollah” in the same sentence on Wednesday night.",
    "url": "https://www.wsj.com/articles/donald-trump-israel-benjamin-netanyahu-hezbollah-gaza-hamas-54a426c8?mod=followamazon"
  },
  {
    "text": "Another element of Trump's ‘rigged election’ narrative collapses  —  What's important to Donald Trump is that people think that he didn't lose the 2020 election or, at the very least, that they think he only lost because someone cheated or broke the law or conspired against him or applied … ",
    "url": "https://www.washingtonpost.com/politics/2023/10/13/another-element-trumps-rigged-election-narrative-collapses/"
  },
  {
    "text": "Dennis Kucinich Leaves Robert F. Kennedy Jr.'s Presidential Campaign  —  The former Democratic congressman, who served as Mr. Kennedy's campaign manager, departed just days after he introduced Mr. Kennedy as an independent candidate.  —  Dennis J. Kucinich has left his post … ",
    "url": "https://www.nytimes.com/2023/10/13/us/politics/rfk-campaign-dennis-kucinich.html"
  },
  {
    "text": "4 Democratic centrists to McHenry: Let's make a deal  —  In a letter to McHenry that was obtained by POLITICO, the Democrats floated giving him “temporary, expanded authorities” — in exchange for concessions.",
    "url": "https://www.politico.com/live-updates/2023/10/13/congress/dems-to-mchenry-00121499"
  },
  {
    "text": "US intelligence warned of the potential for violence days before Hamas attack  —  The US intelligence community produced at least two assessments based in part on intelligence provided by Israel warning the Biden administration of an increased risk for Palestinian-Israeli conflict in the weeks ahead … ",
    "url": "https://www.cnn.com/2023/10/13/politics/us-intelligence-warnings-potential-gaza-clash-days-before-attack/"
  },
  {
    "text": "Stanford instructor removed for targeting Jewish students as ‘colonizers’ after Hamas attack on Israel  —  An instructor at Stanford University has been suspended for what the president and provost called “identity-based targeting” of students in connection with the Israel-Gaza war.",
    "url": "https://forward.com/news/564587/stanford-university-jewish-students-instructor-hamas/"
  },
  {
    "text": "Ex-Trump Organization CFO Allen Weisselberg's Testimony Abruptly Ended After Forbes Story Accused Him of Perjury  —  A source close to New York Attorney General Letitia James confirmed that her office is looking into the latest report about the former Trump CFO's testimony",
    "url": "https://themessenger.com/politics/allen-weisselberg-trump-organization-cfo-testimony-forbes-perjury"
  },
  {
    "text": "‘Top secret’ Hamas documents show that terrorists intentionally targeted elementary schools and a youth center  —  Maps and documents recovered from the bodies of Hamas attackers reveal a coordinated plan to target children and take hostages inside an Israeli village near Gaza.",
    "url": "https://www.nbcnews.com/news/investigations/top-secret-hamas-documents-show-terrorists-intentionally-targeted-elem-rcna120310"
  },
  {
    "text": "Even with last-minute challenger, Jordan poised to move toward speaker's gavel  —  Republicans are meeting to hear directly from Jordan and Rep. Austin Scott, who threw his hat into the ring just before the close-door meeting",
    "url": "https://www.politico.com/live-updates/2023/10/13/congress/scott-jordan-gop-house-speaker-race-00121455"
  },
  {
    "text": "DeSantis, voter have heated exchange over Gaza bombings: 'You had my vote, but you don't now'  —  Florida Gov. Ron DeSantis (R), a 2024 presidential candidate, had a heated exchange with a voter over Israel's airstrikes in Gaza after Hamas militants launched a deadly attack against Israel last weekend.",
    "url": "https://thehill.com/homenews/campaign/4254261-desantis-israel-gaza-bombings-voter-heated-exchange/"
  }
]