[
  {
    "text": "A Trump Conviction Could Cost Him Enough Voters to Tip the Election  —  Recent general-election polling has generally shown Donald Trump maintaining a slight lead over President Biden.  Yet many of those polls also reveal an Achilles' heel for Mr. Trump that has the potential to change the shape of the race.",
    "url": "https://www.nytimes.com/2023/12/26/opinion/trump-polling-conviction.html"
  },
  {
    "text": "Trump augurs divisive year in angry Christmas rant  —  Most global political, spiritual and national leaders mark Christmas with a plea for peace, or by stressing the virtues of family and unity.  —  That's not Donald Trump's style.  —  The ex-president unleashed an online torrent of fury and bitterness … ",
    "url": "https://www.cnn.com/2023/12/26/politics/trump-christmas-rant/"
  },
  {
    "text": "Appeals court wipes conviction for ex-congressman  —  A federal appeals court panel wiped ex-Rep. Jeff Fortenberry's (R-Neb.) conviction of lying to the FBI about an illegal campaign contribution, ruling Tuesday that he was not tried in the proper venue.  —  Last year, a jury sitting … ",
    "url": "https://thehill.com/regulation/court-battles/4377688-appeals-court-wipes-conviction-ex-congressman/"
  },
  {
    "text": "Republican Rep. Marjorie Taylor Greene targeted in swatting attempt on Christmas Day  —  Rep. Marjorie Taylor Greene, R-Ga., was targeted by a swatting attempt at her Georgia home on Christmas Day.  —  The Republican lawmaker shared on X, the platform formerly known as Twitter, on Monday that … ",
    "url": "https://www.usatoday.com/story/news/politics/2023/12/26/marjorie-taylor-green-ga-swatting-christmas/72029352007/"
  },
  {
    "text": "Police increase patrols around Colorado justices' homes after Trump ruling  —  The Denver Police Department said Tuesday it is investigating reports of threats or harassment against the Colorado Supreme Court justices and has increased patrols around their residences.",
    "url": "https://thehill.com/homenews/state-watch/4377445-colorado-supreme-court-trump-ruling-police-increase-patrols-justices-homes/"
  },
  {
    "text": "Ohio grand jury to decide whether to charge woman who miscarried for ‘abuse of a corpse’  —  Brittany Watts's water broke prematurely and she miscarried at home; when she went to the hospital a nurse called the police  —  A grand jury is set to decide whether an Ohio woman who miscarried … ",
    "url": "https://www.theguardian.com/us-news/2023/dec/26/ohio-jury-woman-miscarriage-abuse-corpse"
  },
  {
    "text": "Rapper Ye, the former Kanye West, apologizes in Hebrew for anti-Jewish remarks  —  The rapper Ye, formerly known as Kanye West, issued an apology in Hebrew to the Jewish community on Tuesday for his past antisemitic remarks, saying he sought forgiveness and regretted any pain that his words had caused.",
    "url": "https://www.reuters.com/world/us/rapper-kanye-west-apologies-jewish-community-antisemitic-remarks-2023-12-26/"
  },
  {
    "text": "Colorado Gov. Jared Polis faces backlash for cringy ‘Feliz Navidad’ rendition as migrant crisis surges  —  Colorado Governor Jared Polis is drawing harsh criticism for his “Feliz Navidad” holiday message as the state struggles for resources while battling a significant immigration crisis … ",
    "url": "https://nypost.com/2023/12/26/news/colorado-gov-jared-polis-ripped-for-cringy-feliz-navidad-rendition-as-migrant-crisis-surges-in-denver/"
  },
  {
    "text": "Will Trump provoke a crisis of legitimacy for the US supreme court?  —  The court can only rescue Trump from the Colorado ruling by shredding originalism and textualism.  Will it?  —  Donald Trump's packing of the supreme court, to which he appointed three members, to create … ",
    "url": "https://www.theguardian.com/commentisfree/2023/dec/26/trump-us-supreme-court-crisis"
  },
  {
    "text": "The latest front in the Gaetz vs. McCarthy fight: House primaries  —  Gaetz keeps supporting candidates in primaries where McCarthy has already backed someone else.  —  Republicans are desperate to avoid nasty primaries next year.  But the architect of Kevin McCarthy's ouster from the speakership has other plans.",
    "url": "https://www.politico.com/news/2023/12/26/the-latest-front-in-the-gaetz-vs-mccarthy-fight-house-primaries-00133131"
  },
  {
    "text": "Georgia offered Medicaid with a work requirement.  Few have signed up.  —  Only 1,800 people enrolled — and critics blame the paltry expansion on an overly complex program with too many hurdles for people to clear.  —  A GOP experiment forcing low-income people to work to qualify … ",
    "url": "https://www.politico.com/news/2023/12/26/georgia-public-health-insurance-expansion-00132698"
  },
  {
    "text": "An avalanche of money is coming to kick Lauren Boebert out of Congress  — Lauren Boebert was nearly unseated by Democrat Adam Frisch in 2022, and he's running again in 2024.  — He's raised more money than all but two members of Congress, and the most of any non-incumbent.",
    "url": "https://www.businessinsider.com/lauren-boebert-fundraising-adam-frisch-congress-2023-12"
  },
  {
    "text": "Which 2028 Presidential Wannabe Had the Best Year?  —  Ambitious politicians spent 2023 jockeying for the presidential race on the horizon.  —  POLITICO illustration by Emily Scherer/Photos by Getty Images, AP  —  Donald Trump's road to victory in the 2016 presidential election began in March 2011 … ",
    "url": "https://www.politico.com/news/magazine/2023/12/26/who-is-winning-2028-presidential-election-00133119"
  },
  {
    "text": "The year of Republicans throwing accusations against Biden at the wall  —  None have stuck, thus far.  —  In the interregnum between Democrats losing control of the House in the 2022 midterm elections and Republicans taking control in January, senior members of the chamber's Republican … ",
    "url": "https://www.washingtonpost.com/politics/2023/12/26/biden-republicans-impeachment-inquiry-2023/"
  },
  {
    "text": "Statement from Secretary of Defense Lloyd J. Austin III on U.S. Strikes in Iraq  —  Today, at President Biden's direction, U.S. military forces conducted necessary and proportionate strikes on three facilities used by Kataib Hezbollah and affiliated groups in Iraq.",
    "url": "https://www.defense.gov/News/Releases/Release/Article/3626180/statement-from-secretary-of-defense-lloyd-j-austin-iii-on-us-strikes-in-iraq/"
  }
]