[
  {
    "text": "What Ginni Thomas and Leonard Leo wrought: How a justice's wife and a key activist started a movement  —  Thanks to the Supreme Court's Citizens United ruling, a trove of so-called “dark money” was about to be unleashed.  Two activists prepared to seize the moment.",
    "url": "https://www.politico.com/news/2023/09/10/ginni-thomas-leonard-leo-citizens-united-00108082"
  },
  {
    "text": "Virginia Gov. Glenn Youngkin Pardons Father Who Protested School Board After Daughter's Sexual Assault  —  Scott Smith was convicted of disorderly conduct over the 2021 incident  —  A Facebook icon representing an external link to share the article on Facebook.A Twitter icon representing … ",
    "url": "https://themessenger.com/politics/virginia-gov-glenn-youngkin-pardons-father-who-protested-school-board-after-daughters-sexual-assault"
  },
  {
    "text": "Guns Rights Group Sues New Mexico Over Public Firearm Carry Ban  —  Gov. Michelle Lujan Grisham suspended the state's firearms carry laws for 30 days, citing a public health emergency  —  A Facebook icon representing an external link to share the article on Facebook.A Twitter icon representing … ",
    "url": "https://themessenger.com/politics/guns-rights-group-sues-new-mexico-over-public-firearm-carry-ban"
  },
  {
    "text": "The House GOP leadership's Trump split rears its head  —  With assists from Jordain Carney, Sarah Ferris, Olivia Beavers, Ursula Perano and Burgess Everett  —  HOUSE GOP LEADERS' OPEN-SECRET DIVIDE OVER TRUMP  —  It's the split that most everyone on the Hill knows about — and keeps rearing its head.",
    "url": "https://www.politico.com/newsletters/huddle/2023/09/08/the-house-gop-leaderships-trump-split-rears-its-head-00114678"
  },
  {
    "text": "Book Review: ‘Elon Musk,’ by Walter Isaacson  —  Walter Isaacson's biography of the billionaire entrepreneur depicts a mercurial “man-child” with grandiose ambitions and an ego to match.  —  Buy Book ▾ … When you purchase an independently reviewed book through our site, we earn an affiliate commission.",
    "url": "https://www.nytimes.com/2023/09/09/books/review/elon-musk-walter-isaacson.html"
  },
  {
    "text": "California Gov. Gavin Newsom would make an ‘interim’ choice if Dianne Feinstein vacates her Senate seat  —  In a new interview with NBC's “Meet the Press,” the California governor said he would not select any of the candidates currently running to replace the ailing senator.",
    "url": "https://www.nbcnews.com/politics/2024-election/gavin-newsom-make-interim-appointment-dianne-feinstein-senate-rcna103933"
  },
  {
    "text": "Why Mothers Feel Touched Out  —  When my first child was a few months old, a man shouted at me while I stood in the snow with my sleeping baby slung over my shoulder, partially covered by a worn blanket.  We lived in upstate New York, it was winter, and she had fallen asleep on me during a rare outing.",
    "url": "https://www.nytimes.com/2023/09/10/opinion/motherhood-bodily-autonomy.html"
  },
  {
    "text": "GOP senator says he would ‘speak’ to No Labels about 2024 third-party run  —  Sen. Bill Cassidy (R-La.) on Sunday said he would be open to speaking to No Labels if they approached him about a potential third-party run.  —  “What about No Labels?”  NBC's Chuck Todd asked Cassidy.",
    "url": "https://thehill.com/homenews/campaign/4196634-gop-senator-says-he-would-speak-to-no-labels-about-third-party-run/"
  },
  {
    "text": "Tuberville ‘paralyzing’ Pentagon, House Foreign Affairs chair says  —  “I really wish he would reconsider this,” he said.  —  Rep. Michael McCaul (R-Texas) repeatedly said Sunday that Sen. Tommy Tuberville's one-person blockade of military nominations was “paralyzing” the Defense Department.",
    "url": "https://www.politico.com/news/2023/09/10/tuberville-military-mccaul-00114901"
  },
  {
    "text": "Colorado secretary of state calls Trump a ‘liar,’ vows to see ballot lawsuit through  —  Colorado Secretary of State Jena Griswold (D) called former President Trump a “liar,” after he suggested a recent push to use the 14th Amendment to keep him off the ballot in the state was “election interference.”",
    "url": "https://thehill.com/regulation/court-battles/4196268-colorado-official-on-trump-ballot-lawsuit/"
  },
  {
    "text": "Transcript: Vice President Kamala Harris on “Face the Nation,” Sept. 10, 2023  —  The following is a transcript of an interview with Vice President Kamala Harris that aired on “Face the Nation” on Sept. 10, 2023.  —  MARGARET BRENNAN: So, you're 58 now.  If you win a second term … ",
    "url": "https://www.cbsnews.com/news/vice-president-kamala-harris-face-the-nation-transcript-09-10-2023/"
  },
  {
    "text": "‘Gas Hat’ Jan. 6 rioter who first breached Capitol tunnel entrance arrested by FBI  —  Gregory Mijares, who federal authorities say set off a battle between law enforcement at the lower west tunnel, was identified with the help of online sleuths.  —  WASHINGTON — The man who federal authorities … ",
    "url": "https://www.nbcnews.com/politics/justice-department/gas-hat-jan-6-rioter-first-breached-capitol-tunnel-entrance-arrested-f-rcna102361"
  },
  {
    "text": "J.F.K. Assassination Witness Breaks His Silence and Raises New Questions  —  The account of Paul Landis, one of the Secret Service agents just feet away from John F. Kennedy when he was struck down, could change the understanding of what happened in Dallas in 1963.  —  He still remembers the first gunshot.",
    "url": "https://www.nytimes.com/2023/09/09/us/politics/jfk-assassination-witness-paul-landis.html"
  },
  {
    "text": "US seizes nearly 1 million barrels of Iranian oil allegedly bound for China  —  The US government seized nearly 1 million barrels of Iranian crude oil allegedly bound for China, according to newly unsealed court documents and a statement released by the Department of Justice on Friday.",
    "url": "https://www.cnn.com/2023/09/09/politics/us-oil-iran-china-doj/"
  }
]