[
  {
    "text": "What Trump promised oil CEOs as he asked them to steer $1 billion to his campaign  —  Donald Trump has pledged to scrap President Biden's policies on electric vehicles and wind energy, as well as other initiatives opposed by the fossil fuel industry.  —  As Donald Trump sat … ",
    "url": "https://www.washingtonpost.com/politics/2024/05/09/trump-oil-industry-campaign-money/"
  },
  {
    "text": "Stormy Daniels says speaking about Trump has been bad for her life … Former US President Donald Trump speaks to the press before his trial for allegedly covering up hush money payments linked to extramarital affairs, at Manhattan Criminal Court in New York City, on May 9, 2024.",
    "url": "https://www.cnbc.com/2024/05/09/trump-trial-stormy-daniels-testimony-hush-money-case.html"
  },
  {
    "text": "‘Grueling’: The Trial May Be Getting to Trump  —  Did Stormy Daniels' testimony help or hurt the case against Trump?  POLITICO's reporters in the courtroom and on the campaign trail take you behind the curtain.  —  Until this week, Donald Trump's criminal trial in Manhattan has been … ",
    "url": "https://www.politico.com/news/magazine/2024/05/09/trump-trial-stormy-daniels-testimony-00156845"
  },
  {
    "text": "As co-rulers of the House, the Democratic majority-in-waiting may have already arrived  —  In a House with a single-vote GOP majority, many argue that Democrats are no longer just the majority-in-waiting — but that they have already arrived.  Lawmakers of both parties … ",
    "url": "https://www.washingtonpost.com/politics/2024/05/09/house-democrats-house-speaker-hakeem-jeffries-mike-johnson/"
  },
  {
    "text": "How Republicans Echo Antisemitic Tropes Despite Declaring Support for Israel  —  Prominent Republicans have seized on campus protests to assail what they say is antisemitism on the left.  But for years they have mainstreamed anti-Jewish rhetoric.  —  The Republican speaker of the House … ",
    "url": "https://www.nytimes.com/2024/05/09/us/antisemitism-republicans-trump.html"
  },
  {
    "text": "Playbook: Johnson: Biden's having a ‘senior moment’ on Israel  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  Last night on CNN, President JOE BIDEN made news by drawing a clear red line that Israel is rapidly approaching: He will halt shipments of bombs … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/05/09/johnson-bidens-having-a-senior-moment-on-israel-00156995"
  },
  {
    "text": "Robert F. Kennedy Jr. appears to surprise his running mate with his position on abortion  —  Kennedy and Nicole Shanahan appeared on separate episodes of Sage Steele's podcast, with Kennedy saying women should be able to make the decision “even if it's full-term.”",
    "url": "https://www.nbcnews.com/politics/2024-election/robert-f-kennedy-jr-surprise-running-mate-abortion-position-rcna151344"
  },
  {
    "text": "Barron Trump to step into the political arena as a Florida delegate at the Republican convention  —  The position as an at-large delegate for the Florida Republican Party will be the most high-profile political role thus far for Barron, former President Donald Trump's youngest son.",
    "url": "https://www.nbcnews.com/politics/donald-trump/barron-trump-florida-delegate-republican-national-convention-rcna151388"
  },
  {
    "text": "‘Failing act of political theater’: Greene ostracized after Johnson ouster push  —  Centrists have regarded the Georgia firebrand with a degree of skepticism for a while.  Now she's even losing conservative allies.",
    "url": "https://www.politico.com/live-updates/2024/05/09/congress/everybody-hates-mtg-00157030"
  },
  {
    "text": "The dangerously illiberal judges  —  A group of Trump appointees vow they won't hire clerks from Columbia because students there engaged in protest they don't like. … It was likely only a matter of time before right-wing federal judges decided to weigh in on student protests over the ongoing slaughter of Palestinians.",
    "url": "https://www.publicnotice.co/p/columbia-protests-law-clerk-trump-judges-boycott"
  },
  {
    "text": "Maryland 2024 Poll: Alsobrooks 42%, Trone 41%  —  Home Polls Maryland 2024 Poll: Alsobrooks 42%, Trone 41%  —  Hogan with Majority Support in GOP Primary, But Trails in General Election  —  A new Emerson College Polling/The Hill/DC News Now survey in Maryland finds the Democratic U.S. Senate primary … ",
    "url": "https://emersoncollegepolling.com/maryland-2024-poll-alsobrooks-42-trone-41/"
  },
  {
    "text": "‘Total lie:’ Ann Coulter denies opposing Ramaswamy's presidency due to his race  —  Commentator Ann Coulter has denied saying she would not have voted for Vivek Ramaswamy in the Republican Party's 2024 primary elections due to his Indian ethnicity, calling accusations of racism a “total lie.”",
    "url": "https://www.washingtonexaminer.com/news/2997672/total-lie-ann-coulter-denies-opposing-ramaswamys-presidency-due-to-race/"
  },
  {
    "text": "Federal prosecutors reissue criminal charges against ex-Rep. Jeff Fortenberry  —  The Nebraska Republican was convicted of lying to the FBI two years ago, but an appeals court ruled the charges should've been brought in a different venue.  —  Federal prosecutors have charged former … ",
    "url": "https://www.politico.com/news/2024/05/09/jeff-fortenberry-criminal-charges-00157018"
  },
  {
    "text": "Supreme Court won't create new asset forfeiture standard  —  The Supreme Court on Thursday ruled against two Alabama women seeking immediate hearings to reclaim property that was seized from them after crimes committed by other people, a move that declines to set a new asset forfeiture standard.",
    "url": "https://www.washingtonexaminer.com/news/supreme-court/2997526/supreme-court-asset-forfeiture/"
  },
  {
    "text": "As a Veteran Reporter, I've Always Valued Neutrality.  But Trump's Threat To Democracy Should be the Biggest Political Story of 2024  —  What the New York Times is getting wrong in its coverage of Trump vs. Biden.  —  For as long as I've been a reporter, maintaining neutrality while covering politicians has been journalists' mandate.",
    "url": "https://zeteo.com/p/as-a-veteran-reporter-ive-always"
  }
]