[
  {
    "text": "Trump to remain on Michigan ballot after judge rejects another 14th Amendment challenge  —  A Michigan judge on Tuesday dismissed a lawsuit that tried to use the 14th Amendment's “insurrectionist ban” to remove Donald Trump from the state's 2024 ballot.  —  The judge separately ruled … ",
    "url": "https://www.cnn.com/2023/11/14/politics/michigan-judge-trump-14th-amendment/"
  },
  {
    "text": "House Speaker Mike Johnson endorses Trump, defends ‘stolen election’ claims  — House Speaker Mike Johnson endorsed former President Donald Trump for the 2024 Republican presidential nomination for what appeared to be the first time.  — “I'm all in for President Trump,” Johnson, R-La., said on CNBC's “Squawk Box.”",
    "url": "https://www.cnbc.com/2023/11/14/speaker-mike-johnson-endorses-trump-defends-false-election-claims.html"
  },
  {
    "text": "Trump allowed to stay on Michigan presidential ballot, judge rules … - Several states are seeing lawsuits arguing that the Republican primary front-runner's actions surrounding the Jan. 6 U.S. Capitol riot should disqualify him from serving as president under the Civil War-era amendment's insurrection clause.",
    "url": "https://www.axios.com/2023/11/15/trump-michigan-presidential-ballot-ruling"
  },
  {
    "text": "Johnson Said in 2015 Trump Was Unfit and Could Be ‘Dangerous’ as President  —  Speaker Mike Johnson, then a Republican state lawmaker, posted on social media that Donald J. Trump lacked the character and morality to be president and could be vindictive.  —  Years before he played a lead role … ",
    "url": "https://www.nytimes.com/2023/11/14/us/politics/mike-johnson-donald-trump.html"
  },
  {
    "text": "Senate Dems take major step towards ending Tuberville's military holds  —  It will now require at least nine Republicans to support it on the Senate floor.  Those prospects are iffy.",
    "url": "https://www.politico.com/live-updates/2023/11/14/congress/tuberville-nominations-rules-committee-change-senate-00127031"
  },
  {
    "text": "GOP frets as Senate Dems move to break Tuberville's military holds  —  He's put them in a tough spot between anti-abortion activists and the military community.  But they're not ready to bench the friendly, back-slapping “Coach.”  —  Several Senate Republicans have made a public show … ",
    "url": "https://www.politico.com/news/2023/11/14/why-the-senate-gop-still-isnt-forcing-tuberville-to-move-on-military-holds-00127156"
  },
  {
    "text": "Senate Rules panel votes along party lines to break Tuberville's military holds  —  The Senate Rules Committee voted along party lines Tuesday to advance a resolution that would allow Senate Majority Leader Chuck Schumer (D-N.Y.) to confirm more than 350 military promotions being held … ",
    "url": "https://thehill.com/homenews/senate/4309704-senate-rules-panel-paves-way-to-break-tubervilles-military-holds/"
  },
  {
    "text": "After Trump case video leak, Georgia prosecutor seeks emergency seal for evidence  —  The Atlanta-area prosecutor leading the criminal racketeering case against former president Donald Trump and 14 allies alleging they broke the law when they sought to overturn Trump's 2020 election loss … ",
    "url": "https://www.washingtonpost.com/national-security/2023/11/14/fani-willis-trump-case-videos/"
  },
  {
    "text": "Prosecutors urge appeals court to reinstate Trump gag order  —  The special counsel's office argued that Trump has exploited two temporary suspensions of the gag order to assail prosecutors and witnesses.  —  Former President Donald Trump's renewed attacks on the family of special counsel Jack Smith … ",
    "url": "https://www.politico.com/news/2023/11/14/prosecutors-urge-appeals-court-to-reinstate-trump-gag-order-00127112"
  },
  {
    "text": "Conservatives hold back on Johnson ouster threat — but plot other payback  —  The House GOP's right flank is furious the new speaker worked with Democrats to avoid a shutdown, a move that essentially mirrored Kevin McCarthy's last act on the job.  —  Speaker Mike Johnson is averting … ",
    "url": "https://www.politico.com/news/2023/11/14/mike-johnson-speaker-shutdown-democrats-00127083"
  },
  {
    "text": "Matt Gaetz calls for House Ethics investigation into Kevin McCarthy  —  Conservative Rep. Matt Gaetz (R-Fla.) announced Tuesday he is filing an ethics complaint against former Speaker Kevin McCarthy following the California Republican's altercation with Rep. Tim Burchett (R-Tenn.).",
    "url": "https://www.axios.com/2023/11/14/matt-gaetz-house-ethics-kevin-mccarthy-burchett"
  },
  {
    "text": "Paul Pelosi's Alleged Attacker Bursts Into Tears on the Witness Stand  —  David DePape testified that he'd become caught up in a slew of conspiracies after listening to podcasters like Tim Pool and James Lindsay.  —  David DePape, the man accused of breaking into Rep. Nancy Pelosi's home … ",
    "url": "https://www.thedailybeast.com/paul-pelosis-alleged-attacker-david-depape-bursts-into-tears-at-trial"
  },
  {
    "text": "More Than 400 U.S. Officials Sign Letter Protesting Biden's Israel Policy  —  The signers, representing some 40 government agencies, reflect growing internal dissent over the administration's support of Israel's military campaign in Gaza.  —  More than 400 political appointees … ",
    "url": "https://www.nytimes.com/2023/11/14/us/politics/israel-biden-letter-gaza-cease-fire.html"
  },
  {
    "text": "Moskowitz, Comer get into tense exchange at hearing: ‘You look like a smurf here’  —  Rep. Jared Moskowitz (D-Fla.) and chair of the House Oversight Committee James Comer (R-Ky.) got into a heated exchange on Tuesday.  —  During a hearing focused on oversight of the U.S. General Services Administration … ",
    "url": "https://thehill.com/homenews/house/4309288-moskowitz-comer-tense-exchange/"
  },
  {
    "text": "8 Republicans Voted With All House Democrats to Block Mayorkas Impeachment  —  Democrats get by in the House with a little help from their Republican friends.  They blocked Rep. Marjorie Taylor Greene's move to force a straight up or down vote on the impeachment of DHS Secretary Mayorkas Monday night.",
    "url": "https://hotair.com/karen-townsend/2023/11/14/8-republicans-voted-with-all-house-democrats-to-block-mayorkas-impeachment-n592316"
  },
  {
    "text": "Andreessen Horowitz Invests in Civitai, Which Profits From Nonconsensual AI Porn  —  Join the newsletter to get the latest updates.  —  Success  —  Great!  Check your inbox and click the link.  —  Error  —  Please enter a valid email address.  —  Andreessen Horowitz, also known as a16z … ",
    "url": "https://www.404media.co/andreessen-horowitz-invests-in-civitai-key-platform-for-deepfake-porn/"
  },
  {
    "text": "New Perspectives on the Feel-Bad Economy  —  Almost two years have passed since I began trying to draw people's attention to the widening gap between economic perceptions and economic reality.  At the time the economic picture was mixed, with rapid job growth yet also rising inflation … ",
    "url": "https://www.nytimes.com/2023/11/14/opinion/partisanship-economy-polling.html"
  },
  {
    "text": "Trans Boy Returns To Lead Role In ‘Oklahoma!’  After Outcry At Sherman School Board Meeting  —  Please support my independent reporting and advocacy on transgender legislation by subscribing.  You help me keep this going and keep people informed.  —  In a crowded school board meeting … ",
    "url": "https://www.erininthemorning.com/p/trans-boy-returns-to-lead-role-in"
  },
  {
    "text": "Israeli Shells Hit Gaza's Al-Shifa Hospital as Battle With Hamas Intensified  —  Israel said Palestinian militants had misfired projectiles, but an analysis of photos and videos of Friday's strikes shows that some of the munitions were likely fired by Israeli forces.",
    "url": "https://www.nytimes.com/2023/11/14/world/middleeast/israel-gaza-al-shifa-hospital.html"
  },
  {
    "text": "DeSantis says Romney ‘never fought for us.’ An unearthed yearbook photo shows he once campaigned for him  —  The Florida governor on Tuesday called Romney part of the “surrender caucus.”  —  A photo from Ron DeSantis' 2005 Harvard Law School yearbook shows DeSantis, left, campaigning for Mitt Romney.",
    "url": "https://abcnews.go.com/US/desantis-romney-fought-us-unearthed-yearbook-photo-shows/story?id=104882433"
  },
  {
    "text": "STAT+: UnitedHealth pushed employees to follow an algorithm to cut off Medicare patients' rehab care  —  The nation's largest health insurance company pressured its medical staff to cut off payments for seriously ill patients in lockstep with a computer algorithm's calculations … ",
    "url": "https://www.statnews.com/2023/11/14/unitedhealth-algorithm-medicare-advantage-investigation/"
  },
  {
    "text": "House members left in stunned disbelief, horror by video of Hamas' attack on Israel  —  Lawmakers exited a screening of video from the Hamas attack largely in silence, several of them openly crying  —  House lawmakers were stunned into shock and disbelief by a screening on Capitol Hill of footage of Hamas' attack on Israel on Oct. 7.",
    "url": "https://jewishinsider.com/2023/11/capitol-hill-israel-hamas-attacks-footage-screening/"
  },
  {
    "text": "Congressional Campaign Staffer Pleads Guilty to Wire Fraud  —  For Immediate Release  —  U.S. Attorney's Office, Eastern District of New York  —  Samuel Miele Convicted of Impersonating High-Ranking Aide to House Leader to Obtain Campaign Contributions, Also Admits to Charging Credit Cards … ",
    "url": "https://www.justice.gov/usao-edny/pr/congressional-campaign-staffer-pleads-guilty-wire-fraud"
  }
]