[
  {
    "text": "Trump Images at Grave Dismay Family of Green Beret Buried at Arlington  —  After a confrontation with Trump campaign officials, a cemetery employee declined to press charges and military officials said it was because she feared retribution from Donald Trump's supporters.",
    "url": "https://www.nytimes.com/2024/08/28/us/politics/trump-arlington-cemetery.html"
  },
  {
    "text": "Trump campaign was warned not to take photos at Arlington before altercation, defense official says  —  JD Vance, asked about a Trump campaign incident at Arlington National Cemetery, instead focused on the US withdrawal from Afghanistan calling Kamala Harris “disgraceful” for not firing anyone for service member's deaths.",
    "url": "https://apnews.com/article/trump-arlington-cemetery-altercation-afghanistan-3f0331e9209336a9b696ec164be7eb1c"
  },
  {
    "text": "Why Trump's ‘incident’ at Arlington National Cemetery matters  —  Donald Trump's appearance at Arlington National Cemetery this week was already controversial.  Then the public learned about an “incident.”  —  In modern American politics, the vast majority of officials in both parties … ",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trumps-incident-arlington-national-cemetery-matters-rcna168577"
  },
  {
    "text": "Dispute Grows Over Trump's Arlington Cemetery Visit as Vance Says Harris Can ‘Go to Hell’  —  Republican former president honored fallen soldiers earlier this week  —  Former President Donald Trump's honoring of fallen soldiers at Arlington National Cemetery sparked a controversy … ",
    "url": "https://www.wsj.com/politics/elections/trump-arlington-cemetery-visit-harris-walz-542a91b3"
  },
  {
    "text": "How a Trump visit sparked turmoil at America's most sacred cemetery  —  Army officials hoped clear rules would avoid a damaging public spat with Trump.  He gave them one anyway.  —  Earlier this month, Republican presidential nominee Donald Trump's campaign contacted military officials … ",
    "url": "https://www.washingtonpost.com/politics/2024/08/28/trump-arlington-cemetery-section-60/"
  },
  {
    "text": "The Trump Campaign Is Now Running on Pure Contempt  —  Both Trump and JD Vance are incapable of hiding their lack of basic humanity.  —  Pocket  —  Tuesday's political news cycle delivered a crash course in the fundamental outlook of the Trumpified Republican Party, via a pair … ",
    "url": "https://www.thenation.com/article/politics/trump-arlington-cemetery-scandal/"
  },
  {
    "text": "‘Furious’: Veterans slam Trump team's altercation at Arlington National Cemetery  —  Rachel Barber Josh Meyer Zac Anderson Tom Vanden BrookUSA TODAY  —  WASHINGTON − Some veterans reacted with alarm to reports of an altercation between a member of Donald Trump's entourage and a top official … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/08/28/trump-arlington-cemetery-veterans/74980080007/"
  },
  {
    "text": "Trump Reposts Crude Sexual Remark About Harris on Truth Social  —  Though the former president has a history of making crass insults about opponents, the reposts signal his willingness to continue to shatter longstanding political norms.  —  Former President Donald J. Trump used … ",
    "url": "https://www.nytimes.com/2024/08/28/us/politics/trump-truth-social-posts.html"
  },
  {
    "text": "Trump Goes Full Fascist in Truth Social Posting Spree  —  One campaign official says staffers are relieved that the former president has largely isolated his social media presence to his own app … On Wednesday — in the aftermath of a new election-interference indictment from Special Counsel Jack Smith … ",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-fascism-qanon-truth-social-posting-spree-1235089984/"
  },
  {
    "text": "Fox News Poll: Harris closes gap with Trump in Sun Belt states  —  Trump leads on the economy and immigration, Harris leads on abortion and uniting the U.S.  —  Join Fox News for access to this content  —  While support for former President Trump has held steady, Vice President Kamala Harris … ",
    "url": "https://www.foxnews.com/official-polls/fox-news-poll-harris-closes-gap-trump-sun-belt-states"
  },
  {
    "text": "Looming court deadlines and hearings threaten to snag Trump's sprint to November  —  Trump may not be going to trial again this year — but that doesn't mean his legal troubles won't interfere with the campaign.  —  Special counsel Jack Smith's surprise re-indictment of Donald Trump … ",
    "url": "https://www.politico.com/news/2024/08/28/trump-court-hearings-deadlines-00176680"
  },
  {
    "text": "During Antitrust Trial, Exec Admits Kroger Jacked Up Milk and Egg Prices Above Inflation  —  A top Kroger executive admitted under questioning from a Federal Trade Commission attorney on Tuesday that the grocery chain raised its egg and milk prices above the rate of inflation … ",
    "url": "https://www.commondreams.org/news/kroger-egg-prices"
  },
  {
    "text": "Supreme Court rebuffs Biden administration plea to restore multibillion-dollar student debt plan  —  The Supreme Court on Wednesday kept on hold the latest multibillion-dollar plan from the Biden administration that would have lowered payments for millions of borrowers, while lawsuits make their way through lower courts.",
    "url": "https://apnews.com/article/supreme-court-biden-student-loans-f566c623ccb3f322523d7e0a2f88b0c5"
  },
  {
    "text": "Harris campaign mocks Trump over muted mic debate: ‘His own team wants to shut him up’  —  Vice President Harris's campaign co-chair Mitch Landrieu on Wednesday mocked former President Trump over the microphone muting issue at the upcoming presidential debate, saying his own team “wants to shut him up.”",
    "url": "https://thehill.com/homenews/campaign/4852183-harris-campaign-mocks-trump-over-muted-mic-debate-his-own-team-wants-to-shut-him-up/"
  },
  {
    "text": "Harris Camp Trolls Trump with Ad Targeting Mar-a-Lago  —  WHEN KAMALA HARRIS'S PRESIDENTIAL CAMPAIGN announced a new attack ad Tuesday, the vice president's strategists made sure to run it in every battleground state —as well as a single media market in Florida: the one that includes Donald Trump's Mar-a-Lago club in Palm Beach.",
    "url": "https://www.thebulwark.com/p/harris-camp-trolls-trump-with-ad"
  },
  {
    "text": "Vance repeats a bogus Trump claim on ‘factories’ debunked years ago  —  The figure he cites doesn't actually refer to factories.  And Biden's record on this front is better anyway.  —  “If you go back to the Trump presidency, we had 12,000 factories that were built during Donald Trump's presidency.”",
    "url": "https://www.washingtonpost.com/politics/2024/08/28/vance-trump-factories-manufacturing-biden/"
  },
  {
    "text": "Elon Musk, Eyeing Edge for Trump, Hires Republican Political Adviser  —  The move suggests that Mr. Musk, the world's richest person, is preparing to become even more involved in the presidential campaign and beyond.  —  Elon Musk, the world's richest person, has hired a Republican operative … ",
    "url": "https://www.nytimes.com/2024/08/28/us/politics/elon-musk-political-adviser.html"
  },
  {
    "text": "I Lurves Me a Happy Warrior  —  And J.D. Vance is that guy.  —  God bless all the moaners, groaners, and the double-belly-aching Greek chorus who cannot begin to stop with their doomcasting about Trump's vice presidential nominee pick.  —  Go jump in a lake.  —  This kid - and he's a kid to me - is rockin' the house.",
    "url": "https://hotair.com/tree-hugging-sister/2024/08/28/i-lurves-me-a-happy-warrior-n3793782"
  },
  {
    "text": "McCormick confuses Philadelphia, Mississippi with Pennsylvania in X post  —  Pennsylvania Senate candidate Dave McCormick (R) was mocked Wednesday after his X account confused Philadelphia, Miss., with Pennsylvania's biggest city.  —  McCormick's account on social platform X shared a clip … ",
    "url": "https://thehill.com/homenews/campaign/4852659-mccormick-philadelphia-mississippi-mistake/"
  },
  {
    "text": "Former Nevada official found guilty of murdering journalist  —  A Las Vegas court on Wednesday convicted a former Nevada official of the murder of investigative journalist Jeff German.  —  The jury returned a unanimous verdict of first-degree murder for former Clark County public administrator Robert Telles.",
    "url": "https://www.voanews.com/a/former-nevada-official-found-guilty-of-murdering-journalist-/7762931.html"
  },
  {
    "text": "Election Could End Up in Front of SCOTUS Warns Ketanji Brown Jackson  —  BRACE FOR IMPACT  —  Jackson's comments come after Special Counsel Jack Smith filed a superseding indictment against Donald Trump in his ongoing election interference case.  —  Journalist",
    "url": "https://www.thedailybeast.com/election-results-could-end-up-in-front-of-scotus-warns-ketanji-brown-jackson"
  },
  {
    "text": "Signal Is More Than Encrypted Messaging.  Under Meredith Whittaker, It's Out to Prove Surveillance Capitalism Wrong  —  On its 10th anniversary, Signal's president wants to remind you that the world's most secure communications platform is a nonprofit.  It's free.  It doesn't track you or serve you ads.",
    "url": "https://www.wired.com/story/meredith-whittaker-signal/"
  },
  {
    "text": "Sarah Palin Is Granted New Libel Trial Against The New York Times  —  A federal appeals court said the judge overseeing the original trial, which Ms. Palin lost, had wrongly excluded evidence and might have swayed jurors as they were deliberating.  —  A federal appeals court on Wednesday ordered … ",
    "url": "https://www.nytimes.com/2024/08/28/business/media/sarah-palin-libel-trial-new-york-times.html"
  },
  {
    "text": "The Election Story Nobody Wants to Talk About  —  A Q&A with David Neiwert, America's foremost writer and thinker on far-right extremism, on what might happen if Trump wins—or loses.  —  Members of the Proud Boys rally in front of the Ohio State Capitol building in Columbus, Ohio, January 6, 2024.",
    "url": "https://prospect.org/politics/2024-08-28-election-story-nobody-talks-about-neiwert-qa/"
  }
]