[
  {
    "text": "How the US and UK Came to Attack the Houthis  — From a conference in St. Croix to military action in Yemen  — US pursued diplomatic track before turning to its arsenal  —  President Joe Biden was vacationing in St. Croix on the morning of Jan. 1 when he convened a meeting of his national security team.",
    "url": "https://www.bloomberg.com/news/articles/2024-01-12/biden-s-clear-message-how-us-uk-came-to-attack-the-houthis"
  },
  {
    "text": "US launches another retaliatory airstrike against Iran-backed Houthis in Yemen  —  The strikes are aimed at degrading their capability to attack Red Sea shipping.  —  On Jan. 11, 2024, at 2:30 a.m. (Sanaa time), U.S. Central Command forces, in coordination with the United Kingdom … ",
    "url": "https://abcnews.go.com/Politics/us-launches-retaliatory-airstrike-iran-backed-houthis-yemen/story?id=106339873"
  },
  {
    "text": "Trump ordered to pay New York Times, three reporters nearly $400,000 in legal costs over dismissed lawsuit  — A New York judge former President Donald Trump to pay The New York Times and three of its reporters nearly $400,000 to cover their legal costs for a lawsuit by him that was dismissed last year.",
    "url": "https://www.cnbc.com/2024/01/12/trump-ordered-to-pay-new-york-times-reporters-over-lawsuit.html"
  },
  {
    "text": "E. Jean Carroll Wants Judge to Stop Trump From Turning Trial Into a ‘Circus’  —  Carroll's legal team on Friday questioned whether Trump can even testify — and showed his five-minute courtroom tirade in his fraud case to argue he wants to ‘sow chaos’  —  JWPlayer",
    "url": "https://themessenger.com/politics/trump-e-jean-carroll-judge-testimony-trial"
  },
  {
    "text": "DeSantis plans to go from Iowa to South Carolina, instead of New Hampshire, as he targets Haley  —  Ron DeSantis is taking his battle with Nikki Haley directly to her home state, planning to head straight to South Carolina — which holds the first GOP votes in the South — after Monday's Iowa caucuses.",
    "url": "https://apnews.com/article/ron-desantis-nikki-haley-donald-trump-south-carolina-ea62d9ad2674747f3dbb01a323f92cfd"
  },
  {
    "text": "Ron DeSantis Admits Fox News Isn't Real News … Meeting with reporters Friday, Ron DeSantis blurted out something every Republican politician knows, but never says: Conservative media does not hold Republicans accountable.  “He's got basically a Praetorian Guard of the conservative media … ",
    "url": "https://nymag.com/intelligencer/2024/01/ron-desantis-admits-fox-news-isnt-real-news.html"
  },
  {
    "text": "IRS says it collected $360 million more from rich tax cheats as its funding is threatened yet again  —  The IRS says it has collected an additional $360 million in overdue taxes from delinquent millionaires as the agency's leadership tries to promote the latest work it has done to modernize … ",
    "url": "https://apnews.com/article/irs-tax-biden-inflation-reduction-act-ceacc306233f1a41e0e41e81e89a60a5"
  },
  {
    "text": "Hunter Biden's Offer to Testify Won't Protect Him From Contempt, GOP Says  —  If Republicans 'want to play chicken with this, fine, that's their choice,' a source close to Hunter Biden told The Messenger  —  House Republicans said Friday they will continue to pursue contempt of Congress charges … ",
    "url": "https://themessenger.com/politics/hunter-bidens-offer-to-testify-wont-protect-him-from-contempt-gop-says"
  },
  {
    "text": "Fox News Kicks Mike Lindell and His MyPillow Ads to the Curb  —  The pillow magnate claims Fox News “canceled” him for hiring Lou Dobbs, but a Fox News source with knowledge told The Daily Beast that Lindell simply hasn't paid his bills.  —  MAGA pillow magnate Mike Lindell alleges that Fox News … ",
    "url": "https://www.thedailybeast.com/fox-news-kicks-mike-lindell-and-his-mypillow-ads-to-the-curb"
  },
  {
    "text": "Two US Navy sailors reported missing while conducting operations off coast of Somalia  —  Two U.S. Navy sailors were reported missing at sea while conducting operations off the coast of Somalia on Thursday evening, the U.S. military said in a statement on Friday, adding that search and rescue operations were ongoing to locate them.",
    "url": "https://www.reuters.com/world/two-us-navy-sailors-reported-missing-while-conducting-operations-off-coast-2024-01-13/"
  },
  {
    "text": "Oil companies will soon pay fees for emitting a climate ‘super-pollutant’  —  The action is one of the Biden administration's strongest against the fossil fuel industry under provisions of a 2022 climate law  —  The Environmental Protection Agency on Friday proposed steep new fees … ",
    "url": "https://www.washingtonpost.com/climate-environment/2024/01/12/methane-fee-epa-climate/"
  },
  {
    "text": "Prosecutors to seek death penalty for white supremacist who killed 10 at Buffalo supermarket  —  Federal prosecutors said Friday that they will seek the death penalty against a white supremacist who killed 10 Black people at a Buffalo supermarket.  Payton Gendron, 20, is already serving … ",
    "url": "https://apnews.com/article/buffalo-supermarket-shooting-death-penalty-b6ab8eda541c2c0a0b512a89b0471b91"
  },
  {
    "text": "Biden campaign grapples with undecided voters who don't yet believe Trump could be the nominee  —  Voting in the Republican primary can't start soon enough in the minds of President Joe Biden's campaign advisers.  —  Even as the Biden reelection campaign forges ahead with preparations … ",
    "url": "https://www.cnn.com/2024/01/12/politics/trump-biden-2024-campaign/"
  },
  {
    "text": "Supreme Court to review restrictions on homeless encampments  —  The Supreme Court said Friday it will consider whether state and local officials can punish homeless individuals for camping and sleeping in public spaces when shelter beds are unavailable.  —  The justices will review … ",
    "url": "https://www.washingtonpost.com/politics/2024/01/12/supreme-court-homeless-encampments-restrictions/"
  },
  {
    "text": "EXCLUSIVE: Here's The Tape of Roger Stone Discussing Assassination of Democrats — Which He Denied Ever Doing  —  Roger Stone has contested Mediaite's reporting this week regarding comments he made on tape floating the assassination of two members of Congress.",
    "url": "https://www.mediaite.com/politics/exclusive-heres-the-tape-of-roger-stone-discussing-assassination-of-democrats-which-he-denied-ever-doing/"
  },
  {
    "text": "Americans divided on how SCOTUS should handle Trump ballot access: POLL  —  The U.S. Supreme Court will hear ballot access arguments on Feb. 8.  —  Former President and Republican presidential candidate Donald Trump campaigns, in Clinton, Iowa, Jan 6, 2024.",
    "url": "https://abcnews.go.com/US/americans-divided-scotus-handle-trump-ballot-access-poll/story?id=106300304"
  },
  {
    "text": "Quaker Oats recalls more granola products due to salmonella risk  —  Quaker Oats is expanding a prior recall to include additional cereals, granola bars and snacks sold across the U.S. because they could be contaminated with salmonella.  —  The recalled products are sold throughout the 50 states … ",
    "url": "https://www.cbsnews.com/news/quaker-granola-recall-salmonella/"
  },
  {
    "text": "The Supreme Court Will Decide if States Can Force Hospitals to Let Women Die  —  Here are the types of patients who will die if Supreme Court justices say states can block doctors from providing emergency abortion care  —  The Supreme Court will decide this term whether states can force doctors … ",
    "url": "https://www.rollingstone.com/politics/politics-features/supreme-court-states-emergency-abortion-1234945425/"
  }
]