[
  {
    "text": "Andrew Cuomo weighing his options in NYC mayoral election and potential independent bid  —  Former New York Gov. Andrew Cuomo, fresh off congratulating opponent Zohran Mamdani in New York City's mayoral primary election, is weighing his options for the November general election.",
    "url": "https://www.cbsnews.com/newyork/news/andrew-cuomo-zohran-mamdani-nyc-mayor-primary-election/"
  },
  {
    "text": "What Democrats can (and can't) learn from Zohran Mamdani's triumph  —  Four takeaways from the socialist's shocking defeat of Andrew Cuomo. … It's hard to overstate how much this was not supposed to happen.  —  On Tuesday night, Zohran Mamdani — a 33-year-old socialist and state lawmaker … ",
    "url": "https://www.vox.com/politics/417776/zohran-mamdani-cuomo-nyc-mayor-policies-democrats"
  },
  {
    "text": "Trump wages all-out fight for control of Iran strike narrative  —  President Trump is going to extraordinary lengths to defend his claim that U.S. airstrikes “obliterated” Iran's nuclear program, determined to cement the operation as a defining victory of his presidency.",
    "url": "https://www.axios.com/2025/06/25/trump-iran-nuclear-intelligence-obliterated"
  },
  {
    "text": "Scoop: Trump to limit sharing classified info with Congress after leak on Iran bombing damage … - The FBI also is investigating the leak, the sources said. … - “We are declaring a war on leakers,” a senior White House official said Wednesday.  — “The FBI is investigating the leak,” the source said.",
    "url": "https://www.axios.com/2025/06/25/iran-bombing-intelligence-trump-congress"
  },
  {
    "text": "Rubio Fleshes Out Trump's Case That Iran Nuclear Capacity Was Eliminated  —  Secretary of State Marco Rubio said U.S. strikes had destroyed a facility that is key to turning highly enriched nuclear fuel into a working bomb.  He railed against a less optimistic U.S. intelligence report.",
    "url": "https://www.nytimes.com/2025/06/25/us/politics/iran-nuclear-program-damage-rubio.html?unlocked_article_code=1.Rk8.Qcah.NRcCxPKYcs-B&smid=url-share"
  },
  {
    "text": "Thune faces brewing megabill mutiny  —  Sen. Thom Tillis warned his colleagues during a closed-door meeting Wednesday that he would not vote to take up the party's sweeping domestic policy bill without further clarity on Medicaid changes, a person granted anonymity to disclose private discussions said.",
    "url": "https://www.politico.com/live-updates/2025/06/25/congress/megabill-senate-mutiny-00424389"
  },
  {
    "text": "“You have no credibility”: Lake grilled by House Committee over Voice of America cuts  —  Kari Lake was dressed down by representatives from both parties on her handling of government-funded media  —  While testifying before a House committee on Wednesday, Kari Lake faced severe criticism … ",
    "url": "https://www.salon.com/2025/06/25/you-have-no-credibility-lake-grilled-by-house-committee-over-voice-of-america-cuts/"
  },
  {
    "text": "'They're Not Breathing': Inside the Chaos of ICE Detention Center 911 Calls  —  Records of hundreds of emergency calls from ICE detention centers obtained by WIRED—including audio recordings—show a system inundated by life-threatening incidents, delayed treatment, and overcrowding.",
    "url": "https://www.wired.com/story/ice-detention-center-911-emergencies/"
  },
  {
    "text": "CDC to hire former head of anti-vaccine group founded by RFK Jr.  —  The Centers for Disease Control and Prevention is hiring Lyn Redwood, a nurse and the former head of a group critics have denounced as anti-vaccine, to work in its vaccine safety office, multiple CDC officials tell CBS News.",
    "url": "https://www.cbsnews.com/news/cdc-vaccine-safety-office-hire-former-head-anti-vaccine-group-founded-rfk-jr/"
  },
  {
    "text": "Trump DOJ sues all federal judges in Maryland over deportation order  —  Legal experts said the unusual lawsuit marks an escalation in the Trump administration's attacks on the U.S. judiciary.  —  Summary907  —  The Justice Department sued all 15 federal district court judges in Maryland … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2025/06/25/doj-sues-maryland-judges/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzUwODI0MDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzUyMjA2Mzk5LCJpYXQiOjE3NTA4MjQwMDAsImp0aSI6ImUyZmEwZTJlLTcyNjItNDMzZi1hNjAzLTJjNDc5YjU3OWFiYSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9kYy1tZC12YS8yMDI1LzA2LzI1L2Rvai1zdWVzLW1hcnlsYW5kLWp1ZGdlcy8ifQ.6KulD7UhFMLNjUw0ZNdMZR_fqmAlEIJrK5egCHTSgIE&itid=gfta"
  },
  {
    "text": "Norton's office walks back her desire to seek re-election — again  —  Del. Eleanor Holmes Norton (D-D.C.) keeps personally telling reporters she will run for re-election — only for her staff to walk it back. … - An hour-and-a-half-later, Norton's spokesperson Sharon Nichols told Axios: “No decision has been made.",
    "url": "https://www.axios.com/2025/06/25/norton-dc-re-election-seeks"
  },
  {
    "text": "Mediator Proposes $20 Million Settlement in Trump's CBS Suit  —  Potential package would include a donation, legal costs and public service announcements  —  A mediator has proposed that President Trump and Paramount Global settle his lawsuit over a CBS News “60 Minutes” … ",
    "url": "https://www.wsj.com/business/media/mediator-proposes-20-million-settlement-in-trumps-cbs-suit-ed04c3e3?st=KHicGt&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Trump's Use of Federal Troops in Drug Raid Outside of Los Angeles: An Alarming Escalation  —  Last week, federalized National Guard forces who were deployed in Los Angeles in response to protests against Immigration and Customs Enforcement (ICE) raids assisted the Drug Enforcement Administration … ",
    "url": "https://www.justsecurity.org/115545/federalized-national-guard-drug-raids/"
  },
  {
    "text": "The U.S. Department of Education is far behind on producing key statistics  —  As a country, we need to understand who goes to school, where, and what their experiences are.  It's hard to ensure that students have access to quality education without some basic information about our schools.",
    "url": "https://www.brookings.edu/articles/the-u-s-department-of-education-is-far-behind-on-producing-key-statistics/"
  },
  {
    "text": "Where Is Iran's Supreme Leader, Ayatollah Ali Khamenei?  —  Ayatollah Ali Khamenei has not been seen publicly or heard from in nearly a week.  That absence has surprised and unnerved everyone from political insiders to the general public.  —  With the nation watching … ",
    "url": "https://www.nytimes.com/2025/06/25/world/middleeast/where-is-khamenei-iran-supreme-leader.html"
  },
  {
    "text": "Trump's Border Czar Claims Death Threats Have Driven Him From Wife  —  DISPLACED  —  President Donald Trump's border czar Tom Homan says he has received so much hate for his positions on immigration that he is unable to live safely with his family.  In a podcast interview with the New York Post … ",
    "url": "https://www.thedailybeast.com/trumps-border-czar-tom-homan-living-separately-from-wife-due-to-death-threats/"
  },
  {
    "text": "Trump Considers Naming Next Fed Chair Early in Bid to Undermine Powell  —  Warsh, Hassett and Bessent are among those under consideration as Trump evaluates their commitment to cutting rates—and ‘made-for-TV’ appeal  —  President Trump's exasperation over the Federal Reserve's take-it-slow approach … ",
    "url": "https://www.wsj.com/economy/central-banking/trump-considers-naming-next-fed-chair-early-in-bid-to-undermine-powell-d3edcb9c?st=RsjPmE&reflink=article_copyURL_share"
  },
  {
    "text": "Something is ‘pulsing’ beneath the Earth, scientists say - and could tear a continent apart  —  Rhythmic surges are like a ‘heartbeat’ under the ground  —  Scientists have detected deep pulses in the Earth beneath Africa - and it could tear the continent apart.",
    "url": "https://www.independent.co.uk/space/earth-pulsing-continent-africa-b2776542.html"
  },
  {
    "text": "‘Criminal immigrant’ means whatever the administration says it means  —  Trump's deportation goals are being met by targeting non-criminal immigrants.  —  President Donald Trump being President Donald Trump, it certainly seems possible that he believed that the Maryland resident … ",
    "url": "https://www.washingtonpost.com/opinions/2025/06/25/immigration-criminals-trump-invention/"
  },
  {
    "text": "House GOP issues new subpoenas, ramping up ActBlue investigation  —  The fundraising platform claims the probe is partisan and not related to lawmaking.  —  House GOP committees have issued new subpoenas to ActBlue, intensifying their probe of the Democratic fundraising platform.",
    "url": "https://www.politico.com/news/2025/06/25/actblue-subpoena-house-gop-investigation-00424703"
  },
  {
    "text": "Iranian immigrant who has lived in New Orleans nearly 50 years arrested outside Lakeview home  —  The arrest highlights how Trump's immigration crackdown has ensnared people who were long allowed to stay in the U.S. as their cases unfolded.  — 5 min to read",
    "url": "https://www.nola.com/news/politics/national_politics/iran-new-orleans-woman-arrested/article_bcfdc93e-01dc-4021-b5f8-a91ded5ed784.html"
  },
  {
    "text": "Kyle Rittenhouse Steps Away From Public Eye, Deletes Social Media Accounts, Leaves Gun Shop Job  —  Kyle Rittenhouse quietly shuttered his social media accounts and stepped back from the spotlight at some point during the past few months, an about-face from the slew of public speaking appearances … ",
    "url": "https://www.mediaite.com/online/kyle-rittenhouse-steps-away-from-public-eye-deletes-social-media-accounts-leaves-gun-shop-job/"
  }
]