[
  {
    "text": "ICE arrests Palestinian activist who led Columbia University protests, lawyer says  —  A prominent Palestinian activist who helped lead Columbia University's 2024 student encampment protests was arrested Saturday night in New York City by federal immigration authorities who claimed they were acting … ",
    "url": "https://www.cbsnews.com/newyork/news/ice-arrest-mahmoud-khalil-palestinian-activist-columbia-protests/"
  },
  {
    "text": "BREAKING: DHS Detains Palestinian Student from Columbia Encampment, Advocates Say  —  On Saturday, Department of Homeland Security (DHS) officers detained Mahmoud Khalil - a recent Columbia University graduate who helped lead the Gaza solidarity encampment - at his New York City home … ",
    "url": "https://zeteo.com/p/breaking-dhs-detains-palestinian"
  },
  {
    "text": "US authorities arrest Palestinian student protester at Columbia University, students say  —  Agents from U.S. President Donald Trump's administration arrested a Palestinian graduate student who played a prominent role in last year's pro-Palestinian protests at New York's Columbia University, four fellow students said on Sunday.",
    "url": "https://www.reuters.com/world/us/us-authorities-arrest-palestinian-student-protester-columbia-university-students-2025-03-09/"
  },
  {
    "text": "DHS Detains Lead Negotiator of Columbia Gaza Solidarity Encampment After Online Campaign by Pro-Israel Groups  —  NEW YORK CITY—On Saturday night, Department of Homeland Security (DHS) agents entered a student residential building at Columbia University in uptown New York and detained Mahmoud Khalil … ",
    "url": "https://www.dropsitenews.com/p/dhs-detains-columbia-university-student-gaza"
  },
  {
    "text": "Trump won't rule out a recession in 2025  —  “I hate to predict things like that,” Trump said when pressed about the possibility of a recession during a recorded interview that aired on “Sunday Morning Futures with Maria Bartiromo.”  —  President Donald Trump is confident that the country's economy … ",
    "url": "https://www.politico.com/news/2025/03/09/trump-recession-tariffs-2025-economy-00220016"
  },
  {
    "text": "The Bond Market's Trump Trade Is Looking Like a Recession Trade  —  Bond traders are signaling an increasing risk that the US economy will stall as President Donald Trump's chaotic tariff rollouts and federal-workforce cuts threaten to further restrain the pace of growth.",
    "url": "https://www.bloomberg.com/news/articles/2025-03-09/the-bond-market-s-trump-trade-is-looking-like-a-recession-trade"
  },
  {
    "text": "Massive turnout at Democratic lawmakers' town halls as Republicans hide from voters  —  LGBTQ+ stories are more important than ever.  Join us in fighting for our future.  Support our journalism.  —  One-time Monthly  —  $19.67 $50 Other  —  $5 $19.67 $50  —  Join the Fight",
    "url": "https://www.advocate.com/politics/huge-turnout-democratic-town-halls"
  },
  {
    "text": "Liberal leadership race: Mark Carney elected by landslide to be next prime minister  —  Political newcomer promises to ‘fight’ for Canadian economy, sovereignty  —  Who is Mark Carney, Canada's next prime minister?  —  How Mark Carney went from his upbringing in Alberta to central banker … ",
    "url": "https://www.cbc.ca/news/politics/livestory/liberal-leadership-race-mark-carney-elected-by-landslide-to-be-next-prime-minister-9.6678061"
  },
  {
    "text": "Chinese investors privately take stakes in Elon Musk's companies  —  Asset managers have been promoting tech mogul's ties to Donald Trump to lure capital to xAI, Neuralink and SpaceX  —  Wealthy Chinese investors are quietly funnelling tens of millions of dollars into private companies controlled … ",
    "url": "https://www.ft.com/content/66857e1e-a217-4ddd-8332-d9f0f75aa459"
  },
  {
    "text": "Fear of Trump Has Elite Law Firms in Retreat  —  Executive orders against Perkins Coie and Covington & Burling have chilled industry  —  Elite law firms formed a proud part of the opposition to the first Trump administration.  This time around, the industry is fearful of taking on a president … ",
    "url": "https://www.wsj.com/us-news/law/fear-of-trump-has-elite-law-firms-in-retreat-6f251dec?st=y1T1Ya&reflink=article_copyURL_share"
  },
  {
    "text": "Real chilling effects  —  Normally I record the classes I teach.  It gives students who miss class a chance to catch up.  I also make space in my classes to talk about what is happening in government right now.  A couple of weeks ago, students asked we keep the discussions, but stop recording the class.",
    "url": "https://donmoynihan.substack.com/p/real-chilling-effects"
  },
  {
    "text": "Howard County resident who traveled internationally has confirmed case of measles  —  MDH: This measles case not associated with outbreak in Texas, New Mexico  —  A positive case of measles was confirmed in a Howard County resident who recently traveled internationally, according to health officials.",
    "url": "https://www.wbaltv.com/article/measles-confirmed-case-maryland-howard-county/64111796"
  },
  {
    "text": "WATCH: Vice President JD Vance confronts Cincinnati protesters, condemns them on social media  —  CINCINNATI — Video shared with WCPO shows Vice President JD Vance interacting with Cincinnati protesters headed to a Walnut Hills rally Saturday.  —  Vance posted on X condemning the protesters … ",
    "url": "https://www.wcpo.com/news/government/local-politics/youre-a-s-t-person-vp-jd-vance-condemns-protesters-allegedly-following-him-near-his-walnut-hills-home"
  },
  {
    "text": "Syrian government loyalists accused of executing civilians as violence erupts  —  Armed men loyal to the Syrian government carried out field executions and spoke of purifying the country, according to eyewitnesses and video, providing a gruesome picture of a crackdown against remnants … ",
    "url": "https://www.cnn.com/2025/03/09/middleeast/syria-executions-violence-assad-alawite-intl"
  },
  {
    "text": "Companies warn investors that DOGE's federal cuts might hurt business  —  As earnings season begins, filings to the SEC point to uncertainty from the current administration as potential trouble for business.  —  Elon Musk's sweeping makeover of the federal government in recent weeks … ",
    "url": "https://www.washingtonpost.com/business/2025/03/09/doge-companies-warnings-sec-filings/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQxNDk2NDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQyODc1MTk5LCJpYXQiOjE3NDE0OTY0MDAsImp0aSI6ImZjNjFhMTBjLTY4NzEtNDM4OC04ODRkLWQzODk5MDZmNDc3ZCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9idXNpbmVzcy8yMDI1LzAzLzA5L2RvZ2UtY29tcGFuaWVzLXdhcm5pbmdzLXNlYy1maWxpbmdzLyJ9.U5TaWk4b8uEeSDw-eB7YWUx-lnz_NOqXd3BBM4RpEFg&itid=gfta"
  },
  {
    "text": "Israel cuts off electricity supply to Gaza, affecting a desalination plant producing drinking water  —  Israel cut off the electricity supply to Gaza, officials said Sunday, affecting a desalination plant producing drinking water for part of the arid territory.  Hamas called it part of Israel's “starvation policy.”",
    "url": "https://apnews.com/article/gaza-israel-palestinians-war-news-ba90f0de3d4f64a1762d1a39f787817f"
  },
  {
    "text": "Zuckerberg's Meta considered sharing user data with China, whistleblower alleges  —  Meta went to extreme lengths, including developing a censorship system, in a failed attempt to bring Facebook to millions of internet users in China, according to a whistleblower complaint.",
    "url": "https://www.washingtonpost.com/technology/2025/03/09/meta-china-censorship-facebook-mark-zuckerberg/"
  },
  {
    "text": "Selma is Stronger than MAGA  —  “You're teaching young people to love America.”  —Justice Anthony Kennedy to President Donald Trump, March 4, 2025  —  Sherrilyn's Newsletter is a reader-supported publication.  To receive new posts and support my work, consider becoming a free or paid subscriber.",
    "url": "https://sherrilyn.substack.com/p/selma-is-stronger-than-maga"
  }
]