[
  {
    "text": "Mike Johnson's Wife Runs Counseling Service That Compares Being Gay To Bestiality, Incest  —  The newly elected Republican House speaker and his wife, Kelly, have long intertwined their political and business lives.  —  LOADING  —  The wife of newly elected House Speaker Mike Johnson … ",
    "url": "https://www.huffpost.com/entry/mike-johnson-wife-homosexuality-bestiality-incest_n_653abfb6e4b00110fef0462e"
  },
  {
    "text": "For Mike Johnson, Religion Is at the Forefront of Politics and Policy  —  The new House speaker has put his faith at the center of his political career, and aligned himself with a newer cohort of conservative Christianity that some describe as Christian nationalism.",
    "url": "https://www.nytimes.com/2023/10/27/us/politics/mike-johnson-speaker-religion.html"
  },
  {
    "text": "The Christian Nationalism of Speaker Mike Johnson … In his first day as the new Speaker of the United States House of Representatives, Mike Johnson (R-LA) wasted no time in using sweeping religious rhetoric to magnify this political moment.  While addressing his colleagues he shared how, “I don't believe there are any coincidences.",
    "url": "https://time.com/6329207/speaker-mike-johnson-christian-nationalism/"
  },
  {
    "text": "Stephen King on Mass Shootings: We're Out of Things to Say  —  There is no solution to the gun problem, and little more to write, because Americans are addicted to firearms.  —  Representative Jared Golden, from Maine's Second Congressional District, has reversed course … ",
    "url": "https://www.nytimes.com/2023/10/27/opinion/stephen-king-maine-shootings.html"
  },
  {
    "text": "Chemical crisis: The unseen toxic threat contaminating wildlife worldwide  —  An unseen but growing chemical contamination crisis is threatening wildlife across all seven continents, exacerbating a host of environmental threats they're already facing.  —  Plastic pollution in the oceans … ",
    "url": "https://thehill.com/opinion/energy-environment/4279490-chemical-crisis-the-unseen-toxic-threat-contaminating-wildlife-worldwide/"
  },
  {
    "text": "The Aftermath of a Massacre Is Always the Time to Push for Gun Legislation  —  Axios: … Since no other civilized country on the planet has massacres like this, Johnson is implicitly arguing that the problem isn't the human heart, but the American heart.  —  Or, maybe the problem is the fact … ",
    "url": "https://daringfireball.net/linked/2023/10/27/aftermath"
  },
  {
    "text": "Democrat lawmaker launches presidential campaign against Biden, blasts border policies: ‘Not secure’ … CONCORD, N.H. - As he formally launched a long-shot Democratic primary challenge against President Biden on Friday, Rep. Dean Phillips criticized the president's border policies.",
    "url": "https://www.foxnews.com/politics/democrat-lawmaker-launches-presidential-campaign-against-biden-blasts-border-policies-not-secure?intcmp=tw_fnc"
  },
  {
    "text": "Gaza's Tunnels Loom Large for Israel's Ground Forces  —  Hamas is believed to hide weapons, fighters and even command centers in miles of subterranean pathways and chambers.  —  Just after midnight on Tuesday, the Israel Defense Forces announced that they had struck a tunnel that allowed Hamas to “infiltrate Israel through the sea.”",
    "url": "https://www.nytimes.com/2023/10/28/us/politics/gazas-tunnels-israel-ground-war.html"
  },
  {
    "text": "Playbook PM: Will Dean Phillips stop Trump or help him?  —  THE TALENTED MR. SANTOS — Rep. GEORGE SANTOS (R-N.Y.) today pleaded not guilty to 10 new federal counts against him, maintaining his innocence in the face of prosecutors' superseding indictment.  His trial on charges of fraud … ",
    "url": "https://www.politico.com/newsletters/playbook-pm/2023/10/27/will-dean-phillips-stop-trump-or-help-him-00123999"
  },
  {
    "text": "U.S. urges Israel against Gaza ground invasion, pushes surgical campaign  —  U.S. officials say a full-scale ground invasion risks a wider Middle East war and jeopardizes the lives of hundreds of hostages  —  The Biden administration is urging Israel to rethink its plans for a major ground offensive … ",
    "url": "https://www.washingtonpost.com/politics/2023/10/27/us-urging-israel-rethinkg-gaza-ground-invasion/"
  },
  {
    "text": "State rep. pays tribute to men acquitted in governor kidnap plot  —  ALLEGAN, Mich. (WOOD) — A West Michigan state legislator paid tribute Friday to two men acquitted in the failed plot to kidnap Gov. Gretchen Whitmer, with Rep. Rachelle Smit saying she was doing so on behalf of the state.",
    "url": "https://www.woodtv.com/news/allegan-county/state-rep-pays-tribute-to-men-acquitted-in-governor-kidnap-plot/"
  },
  {
    "text": "Team Trump Revives Attack Ads Against DeSantis in Iowa  —  A super PAC supporting Trump is shifting its strategy again, with less than three months before the state's first-in-the-nation caucuses.  —  The super PAC supporting Donald J. Trump will begin airing an attack against Ron DeSantis in Iowa … ",
    "url": "https://www.nytimes.com/2023/10/27/us/politics/trump-desantis-iowa-ads.html"
  },
  {
    "text": "Gun Maine suspect used to kill 18 people was bought legally just days before psychiatric evaluation, sources say  —  The gun investigators believe Robert Card used to kill 18 people and wound more than a dozen others was purchased legally just days before he was hospitalized and ordered … ",
    "url": "https://www.cnn.com/2023/10/27/us/maine-shootings-suspect-search-friday/"
  },
  {
    "text": "Bill Barr knocks Trump for having verbal skills that ‘are limited’  —  Former U.S. Attorney General Bill Barr knocked former President Trump's verbal skills in Friday comments.  —  “His verbal skills are limited,” Barr said at an event at The University of Chicago's Institute of Politics.",
    "url": "https://thehill.com/homenews/4280503-bill-barr-knocks-trump-for-having-verbal-skills-that-are-limited/"
  },
  {
    "text": "Kanye and Adidas: Money, Misconduct and the Price of Appeasement  —  The Adidas team was huddled with Kanye West, pitching ideas for the first shoe they would create together.  It was 2013, and the rapper and the sportswear brand had just agreed to become partners.",
    "url": "https://www.nytimes.com/2023/10/27/business/kanye-west-adidas-yeezy.html"
  },
  {
    "text": "Biden has succeeded all along.  The media can't ignore it.  —  This week, I'll look at evolving coverage of President Biden, pick the pol of the week and share something off the (political) beaten path.  —  What caught my eye  —  Until recently, the gulf between President Biden's performance … ",
    "url": "https://www.washingtonpost.com/opinions/2023/10/27/biden-performance-media-israel-gaza-war/"
  },
  {
    "text": "Arizona prosecutors ask about 2020 pressure campaign by Trump allies  —  PHOENIX — The Arizona attorney general's investigation into the coordinated attempt to overturn the 2020 election results by creating and sending documents to the federal government falsely declaring Donald Trump … ",
    "url": "https://www.washingtonpost.com/politics/2023/10/27/arizona-investigation-2020-election-trump/"
  }
]