[
  {
    "text": "‘FRIENDS’ STAR MATTHEW PERRY DEAD AT 54 ... After Apparent Drowning  —  EXCLUSIVE  —  706.9K … UPDATE  —  6:02 PM PT — More details are surfacing about the circumstances surrounding Matthew Perry's death ... as sources tell us he actually died at his own house after some physical activity this morning.",
    "url": "https://www.tmz.com/2023/10/28/friends-star-matthew-perry-dead-dies-drowning/"
  },
  {
    "text": "Pence Bows Out of '24 Race His Former Boss Is Dominating  —  He increasingly attacked Donald Trump over Jan. 6, but gained little traction and struggled to raise money.  —  Former Vice President Mike Pence, who spent four years dutifully serving President Donald J. Trump but refused to carry … ",
    "url": "https://www.nytimes.com/2023/10/28/us/politics/pence-drops-out-2024.html"
  },
  {
    "text": "Mike Pence suspends his struggling 2024 campaign  —  The former vice president was unable to gain traction in the face of Donald Trump's dominance in the race  —  Mike Pence announced on Saturday at the Republican Jewish Coalition gathering in Las Vegas that he was suspending his campaign and exiting the race for the GOP nomination.",
    "url": "https://www.washingtonpost.com/politics/2023/10/28/mike-pence-suspends-his-struggling-2024-campaign/"
  },
  {
    "text": "Mike Pence drops out of 2024 presidential race: ‘No regrets’  —  Former Vice President Mike Pence on Saturday dropped his bid for the Republican presidential nomination, ending his campaign for the White House after struggling to raise money and gain traction in the polls.",
    "url": "https://apnews.com/article/mike-pence-2024-president-campaign-republican-trump-0ec44fc2a5b8683f34883e0ea72b2ab2"
  },
  {
    "text": "Israel-Hamas War  —  Netanyahu Says Israeli Troops Have Pushed Into Gaza  —  Prime Minister Benjamin Netanyahu of Israel called the incursion “the second stage of the war.”  He did not describe it as an invasion, and the maneuver appeared more limited than some experts had predicted.",
    "url": "https://www.nytimes.com/live/2023/10/28/world/israel-gaza-news-hamas-war"
  },
  {
    "text": "A spiderweb of Hamas tunnels in Gaza Strip raises risks for an Israeli ground offensive  —  As an Israeli ground offensive in the Gaza Strip looms in its most devastating war yet with Hamas, one of the greatest threats to both its troops and the 2.3 million Palestinians trapped inside the seaside enclave is buried deep underground.",
    "url": "https://apnews.com/article/israel-palestinians-hamas-tunnels-warfare-15453b5729e38aeb55af5b419835a5eb"
  },
  {
    "text": "Mike Johnson Conducted Seminars Promoting the US as a “Christian Nation”  —  The new House speaker called for “Biblically-sanctioned government.”  —  Rep. Mike Johnson, the newly elected Republican House speaker, used to conduct a seminar in churches premised on the idea that the United States is a “Christian nation.”",
    "url": "https://www.motherjones.com/politics/2023/10/mike-johnson-seminars-christian-nation-speaker-far-right/"
  },
  {
    "text": "How Mike Johnson went from little-known to House speaker in 24 hours  —  Just hours after securing the Republican nomination for House speaker, Majority Whip Tom Emmer (R-Minn.) walked into a conference meeting Tuesday evening and bluntly informed his colleagues that he knew how to count votes … ",
    "url": "https://www.washingtonpost.com/politics/2023/10/28/how-mike-johnson-went-little-known-house-speaker-24-hours/"
  },
  {
    "text": "Cheryl Hines slams Biden for not providing RFK Jr. security detail  —  Actress Cheryl Hines slammed President Biden for not providing a security detail to her husband, presidential candidate Robert F. Kennedy Jr., in comments Friday.  —  Hines joined TMZ to speak about the intruder … ",
    "url": "https://thehill.com/homenews/campaign/4281313-cheryl-hines-slams-biden-for-not-providing-rfk-jr-security-detail/"
  },
  {
    "text": "The deep inequity of the anti-college movement  —  I immigrated from Mexicali, Mexico, when I was 10 years old, the child of farm laborers.  I was still learning English when my high school teachers advised me to forgo any college dreams.  —  But there in the Imperial Valley of southeast California … ",
    "url": "https://thehill.com/opinion/congress-blog/4281108-the-deep-inequity-of-the-anti-college-movement/"
  },
  {
    "text": "Hutchinson's campaign manager to depart after disagreement over viable path to nomination  —  Asa Hutchinson's presidential campaign manager is leaving the campaign next week due to differences over direction and whether the former Arkansas governor still has a path to the 2024 Republican nomination, according to two sources.",
    "url": "https://www.cnn.com/2023/10/27/politics/hutchinson-campaign-manager-depart-campaign/"
  },
  {
    "text": "Ramaswamy addresses Israel policy criticism at Jewish forum in Las Vegas  —  Since the Oct. 7 Hamas attack in Israel, Ramaswamy has increasingly generated controversy over his remarks about the U.S.'s role in the conflict.  —  Vivek Ramaswamy on Saturday addressed criticism of his Israel stance … ",
    "url": "https://www.politico.com/news/2023/10/28/vivek-ramaswamy-israel-policy-00124095"
  },
  {
    "text": "Mike Johnson is well within the mainstream of today's GOP  —  Republicans' long public nightmare came to an end this past week when Louisiana's Mike Johnson became the 56th speaker of the House.  If you're like most people who claim to be smart about politics, you immediately pretended to know who he was and then went to Google him.",
    "url": "https://www.cnn.com/2023/10/28/politics/mike-johnson-speaker-republican-mainstream/"
  },
  {
    "text": "Misinformation is flowing ahead of Ohio abortion vote.  Some is coming from a legislative website  —  The inflammatory language targeting a reproductive rights measure on Ohio's fall ballot is the type of messaging that is common in the closing weeks of a highly contested initiative campaign … ",
    "url": "https://apnews.com/article/election-2023-ohio-abortion-amendment-misinformation-6b870f06abe5d70e8aa0a535b2e9dd1a"
  },
  {
    "text": "Johnson's speakership win fails to end House GOP infighting  —  The centrist vs. conservative spending fight is rearing its head again.  New York Republicans are pushing to expel George Santos.  Matt Gaetz is still openly taking aim at Kevin McCarthy and others.",
    "url": "https://www.politico.com/news/2023/10/27/spending-gaetz-santos-house-gop-infighting-00124049"
  }
]