[
  {
    "text": "A DHS staffer faces serious punishment for accidentally adding a reporter to a group email  —  The episode, which has not been previously reported, raises questions about unequal punishment for inadvertent leakers in the Trump administration.  —  A federal worker accidentally includes … ",
    "url": "https://www.nbcnews.com/politics/national-security/dhs-staffer-faces-serious-punishment-accidentally-adding-reporter-grou-rcna198233"
  },
  {
    "text": "Trump Takes Government Secrecy Seriously.  But Only When It Suits Him.  —  In the Trump era, the definition of an official secret depends on whatever works best for the president.  —  As far as the Trump administration is concerned, there are government secrets and then there are government secrets.",
    "url": "https://www.nytimes.com/2025/03/27/us/politics/trump-signal-leak-venezuela-deportations.html"
  },
  {
    "text": "Skadden, a Top Law Firm, Is in Talks to Avert an Executive Order  —  The discussions come as other major firms are said to be trying to cut deals with the White House.  —  The elite law firm Skadden, Arps, Slate, Meagher & Flom has had discussions with President Trump's advisers about a deal … ",
    "url": "https://www.nytimes.com/2025/03/27/business/trump-law-firms-skadden-arps.html?unlocked_article_code=1.7E4.3mWR.RWGkLydk7UHE"
  },
  {
    "text": "Addressing Risks From WilmerHale  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:  —  Section 1.  Background.  My Administration is committed to addressing the significant risks associated with law firms … ",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/03/addressing-risks-from-wilmerhale/"
  },
  {
    "text": "Fact Sheet: President Donald J. Trump Addresses Risks from WilmerHale  —  SUSPENDING SECURITY CLEARANCES TO PROTECT THE NATIONAL INTEREST: Today, President Donald J. Trump signed an Executive Order to suspend security clearances held by individuals at Wilmer Cutler Pickering Hale and Dorr LLP … ",
    "url": "https://www.whitehouse.gov/fact-sheets/2025/03/fact-sheet-president-donald-j-trump-addresses-risks-from-wilmerhale/"
  },
  {
    "text": "Trump executive order on Smithsonian targets funding for programs with ‘improper ideology’  —  President Donald Trump on Thursday revealed his intention to force changes at the Smithsonian Institution with an executive order that targets funding for programs that advance “divisive narratives” … ",
    "url": "https://apnews.com/article/trump-smithsonian-executive-order-improper-ideology-558ebfab722f603e94e02a1a4b06ed4d"
  },
  {
    "text": "Fact Sheet: President Donald J. Trump Restores Truth and Sanity to American History  —  RESTORING TRUTH IN AMERICAN HISTORY: Today, President Donald J. Trump signed an Executive Order restoring truth and sanity to American history by revitalizing key cultural institutions and reversing the spread of divisive ideology.",
    "url": "https://www.whitehouse.gov/fact-sheets/2025/03/fact-sheet-president-donald-j-trump-restores-truth-and-sanity-to-american-history/"
  },
  {
    "text": "Restoring Truth and Sanity to American History  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:  —  Section 1.  Purpose and Policy.  Over the past decade, Americans have witnessed a concerted … ",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/03/restoring-truth-and-sanity-to-american-history/"
  },
  {
    "text": "Trump issues executive order to eliminate ‘anti-American ideology’ from Smithsonian  —  The executive order also calls for the replacement of memorials and monuments removed since 2020.  —  President Donald Trump issued an executive order Thursday evening promising to eliminate “improper … ",
    "url": "https://www.washingtonpost.com/history/2025/03/27/trump-issues-executive-order-eliminate-anti-american-ideology-smithsonian/"
  },
  {
    "text": "Trump Pulls Stefanik's UN Nomination to Protect GOP Majority  —  President Donald Trump says he will withdraw Representative Elise Stefanik's nomination to serve as the US ambassador to the United Nations, citing Republicans' narrow hold on the House.  —  “With a very tight Majority … ",
    "url": "https://www.bloomberg.com/news/articles/2025-03-27/trump-to-pull-stefanik-s-un-nomination-gop-senator-says"
  },
  {
    "text": "The disappearing of Rumeysa Ozturk is something I never thought I'd see in America  —  You've probably seen something like this before — but only in a movie, and only in a film that was seeking to capture the horrors of daily life under Joseph Stalin at the peak of his 1930s purges across the USSR … ",
    "url": "https://www.inquirer.com/opinion/rumeysa-ozturk-arrested-ice-tufts-20250327.html"
  },
  {
    "text": "Trump Warned U.S. Automakers Not to Raise Prices in Response to Tariffs  —  Threat came in a call earlier this month, in which carmakers feared punishment if prices go up  —  When President Trump convened CEOs of some of the country's top automakers for a call earlier this month … ",
    "url": "https://www.wsj.com/business/autos/trump-tariffs-automaker-prices-warning-928bc7a9?st=FbeQ4v&reflink=article_copyURL_share"
  },
  {
    "text": "Fact Sheet: President Donald J. Trump Exempts Agencies with National Security Missions from Federal Collective Bargaining Requirements  —  PROTECTING OUR NATIONAL SECURITY: Today, President Donald J. Trump signed an Executive Order using authority granted by the Civil Service Reform Act of 1978 … ",
    "url": "https://www.whitehouse.gov/fact-sheets/2025/03/fact-sheet-president-donald-j-trump-exempts-agencies-with-national-security-missions-from-federal-collective-bargaining-requirements/"
  },
  {
    "text": "How Kristi Noem's $50,000 Rolex in a Salvadoran prison became a political flashpoint  —  The high-end Swiss watch lent a striking contrast to her tour of a notoriously overcrowded mega-prison in one of Latin America's poorest countries.  —  Just now  —  When Homeland Security Secretary … ",
    "url": "https://www.washingtonpost.com/politics/2025/03/27/kristi-noem-rolex-controversy/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQzMDQ4MDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ0NDMwMzk5LCJpYXQiOjE3NDMwNDgwMDAsImp0aSI6ImE5YTVjMjNhLTRkNDMtNGE4ZS04NTBiLTE2MzVhNDY2ODA2NyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzAzLzI3L2tyaXN0aS1ub2VtLXJvbGV4LWNvbnRyb3ZlcnN5LyJ9.haZ-hHrOzjHyyEU-KSePC8IAtp-ohHNx4XrzTV6vaQo&itid=gfta"
  },
  {
    "text": "Russian scientist from Harvard Medical School detained in U.S., faces deportation and likely arrest upon return due to anti-war stance  —  A Russian scientist working at Harvard Medical School has been detained in the United States and placed in immigration detention.",
    "url": "https://theins.press/en/news/280037"
  },
  {
    "text": "RFK Jr.'s massive cuts stun staff, leave senior employees scrambling  —  The cuts sent shockwaves through the department's sprawling workforce, prompting a scramble among senior agency officials to figure out which employees and policy priorities were affected.",
    "url": "https://www.politico.com/news/2025/03/27/very-few-people-know-whats-happening-rfk-jr-cuts-surprise-and-alarm-00254822"
  },
  {
    "text": "ADL Shutters Flagship Anti-Bias Program … IN DECEMBER 2023, during a monthly call with the Anti-Defamation League (ADL) education team, Clara Hess, the vice president of education for the nonprofit, announced a major change: The organization would be phasing out its flagship anti-bias education program, A World of Difference (AWOD).",
    "url": "https://jewishcurrents.org/adl-shutters-flagship-anti-bias-program"
  },
  {
    "text": "Internal White House document details layoff plans across U.S. agencies  —  While officials stressed the estimates were subject to change, the snapshot suggests how agencies are working to meet Trump's mandate to shrink government.  —  Just now  —  Federal officials are preparing for agencies … ",
    "url": "https://www.washingtonpost.com/politics/2025/03/27/federal-worker-layoffs-government-agencies/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQzMDQ4MDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ0NDMwMzk5LCJpYXQiOjE3NDMwNDgwMDAsImp0aSI6ImIyZTNhZjA0LWU0OTEtNGNhMS04ZjUyLTViYjE2MzQ3Y2M1NSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzAzLzI3L2ZlZGVyYWwtd29ya2VyLWxheW9mZnMtZ292ZXJubWVudC1hZ2VuY2llcy8ifQ.ZhLUWAC6kS9DZEhxOy5BeViRYcRkYvIsFgeNBNFIlsY&itid=gfta"
  },
  {
    "text": "Top Senate Republican Protests Trump Bid to Withhold Spending  —  Senator Susan Collins of Maine, the chairwoman of the Appropriations Committee, joined top Democrats in insisting that the president does not have the power to “pick and choose” what to fund.  —  A top Senate Republican … ",
    "url": "https://www.nytimes.com/2025/03/27/us/politics/susan-collins-appropriations-trump.html"
  },
  {
    "text": "Even More Venmo Accounts Tied to Trump Officials in Signal Group Chat Left Data Public  —  WIRED has found four new Venmo accounts that appear to be associated with Trump officials who were in an infamous Signal chat.  One made a payment with a note consisting solely of an eggplant emoji.",
    "url": "https://www.wired.com/story/even-more-venmo-accounts-tied-to-trump-officials-in-signal-group-chat-left-data-public/"
  }
]