[
  {
    "text": "Trump kicks off a Pennsylvania rally by talking about Arnold Palmer's genitalia  —  Donald Trump's campaign suggested he would begin previewing his closing argument Saturday night with Election Day barely two weeks away.  But the former president kicked off his rally with a detailed story … ",
    "url": "https://apnews.com/article/trump-arnold-palmer-closing-arguments-latrobe-pennsylvania-2bea9620c523e531a55259200215284e"
  },
  {
    "text": "Trump fixates on Arnold Palmer as ‘all man’ in showers during profane rally  —  Turning his attention to his rival after a meandering start, Donald Trump used profanity to insult Vice President Kamala Harris.  —  LATROBE, Pa. — Seventeen days from the election, here in arguably … ",
    "url": "https://www.washingtonpost.com/politics/2024/10/19/trump-rally-arnold-palmer-attacks-harris/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI5MzEwNDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzMwNjk2Mzk5LCJpYXQiOjE3MjkzMTA0MDAsImp0aSI6IjkwMmQ2ZThiLWI0ZTAtNDllNC05ZDdlLTE0OTRmMmFkMjI3YSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzEwLzE5L3RydW1wLXJhbGx5LWFybm9sZC1wYWxtZXItYXR0YWNrcy1oYXJyaXMvIn0.oOm8EbxP21EDTXZIEvqMv0Zx9iGckLJHQ8-aR1rh1O4&itid=gfta"
  },
  {
    "text": "Harris says Trump is ‘cruel’ at Georgia rally as she spotlights abortion restrictions  —  ATLANTA — Vice President Kamala Harris said Saturday that Republican former President Donald Trump was “cruel” for how he talked about the grieving family of a Georgia mother who died after waiting 20 hours … ",
    "url": "https://www.npr.org/2024/10/20/g-s1-29102/harris-says-trump-is-cruel-at-georgia-rally-as-she-spotlights-abortion-restrictions"
  },
  {
    "text": "Trump calls Harris a ‘s— vice president’ and mentions Arnold Palmer's genitals in bizarre rally  —  Harris on Saturday ripped Trump for meandering in his public remarks, saying that the former president “generally for the life of him cannot finish a thought.”",
    "url": "https://www.nbcnews.com/politics/2024-election/trump-calls-harris-s-president-personal-attacks-escalate-rcna176259"
  },
  {
    "text": "The Very Real Scenario Where Trump Loses and Takes Power Anyway  —  If Trump overturns the 2024 election, here's how it could happen.  —  Four years ago, a sitting president — rejected by American voters — attempted to seize a second term anyway, plunging the nation into confusion, conflict and, in its last gasp, violence.",
    "url": "https://www.politico.com/news/magazine/2024/10/20/trump-overturn-2024-election-plan-00184103"
  },
  {
    "text": "Pennsylvania Gov. Shapiro: Law enforcement should ‘take a look at’ Elon Musk voter payments  —  On Saturday, Musk announced that he would pay registered voters $1 million per day until Election Day to sign a petition circulated by his super PAC.  —  Pennsylvania Gov. Josh Shapiro on Sunday … ",
    "url": "https://www.nbcnews.com/politics/2024-election/pennsylvania-gov-shapiro-law-enforcement-take-look-elon-musk-voter-pay-rcna176279"
  },
  {
    "text": "Musk promises to award $1 million each day to a signer of his petition  —  Billionaire Elon Musk promised on Saturday to give away $1 million each day until November's election to someone who signs his online petition supporting the U.S. Constitution.  —  And he wasted no time … ",
    "url": "https://www.reuters.com/world/us/elon-musk-promises-award-1-mln-each-day-signer-his-petition-2024-10-20/"
  },
  {
    "text": "Elon Musk Veers Into Clearly Illegal Vote Buying, Offering $1 Million Per Day Lottery Prize Only to Registered Voters  —  Hugo Lowell: “Elon Musk says on stage at a town hall that America PAC will be awarding $1 million every day until the election to a registered Pennsylvania voter who has signed his petition.",
    "url": "https://electionlawblog.org/?p=146397"
  },
  {
    "text": "Statement from President Joe Biden  —  We are heartbroken to learn about the ferry dock walkway collapse on Georgia's Sapelo Island.  What should have been a joyous celebration of Gullah-Geechee culture and history instead turned into tragedy and devastation.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/10/19/statement-from-president-joe-biden-9/"
  },
  {
    "text": "Trump Media Whistleblower Blasts Company for Outsourcing Jobs Abroad as Betrayal of “America First”  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up to receive our biggest stories as soon as they're published.  —  An internal whistleblower complaint … ",
    "url": "https://www.propublica.org/article/trump-media-whistleblower-complaint-devin-nunes"
  },
  {
    "text": "Who's Mailing the Catholic Tribune?  It's Not the Church, It's Partisan Media.  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up for Dispatches, a newsletter that spotlights wrongdoing around the country, to receive our stories in your inbox every week.",
    "url": "https://www.propublica.org/article/church-no-affiliation-catholic-tribune-metric-media"
  },
  {
    "text": "'It's real': Kamala Harris appears to say Israel committing genocide in Gaza  —  “Listen, what he's talking about, it's real.  It's real.  That's not the subject that I came to discuss today, but it's real, and I respect his voice.”  —  US presidential candidate Kamala Harris appeared … ",
    "url": "https://www.jpost.com/diaspora/article-825264"
  },
  {
    "text": "For Trump, a Lifetime of Scandals Heads Toward a Moment of Judgment  —  No major party presidential candidate, much less president, in American history has been accused of wrongdoing so many times.  —  No major party presidential candidate, much less president, in American history has been accused of wrongdoing so many times.",
    "url": "https://www.nytimes.com/2024/10/20/us/politics/trump-scandals.html"
  },
  {
    "text": "How to Read the Immunity Appendix  —  I'm still working through a deeper dive of the appendix to his immunity brief that Jack Smith released on Friday.  —  But I thought I'd share how I'm reading it, as I'll need to refer back to that when I write up some of the interesting things I've found.",
    "url": "https://www.emptywheel.net/2024/10/20/how-to-read-the-immunity-appendix/"
  },
  {
    "text": "Trump doubles down on tariff plan that voters hate … A majority of voters are less likely to support a candidate who promotes universal tariffs, according to NBC News polling released Sunday, marring a cornerstone economic proposal of former President Donald Trump's campaign.",
    "url": "https://www.cnbc.com/2024/10/20/trump-tariffs-election.html"
  }
]