[
  {
    "text": "Applebaum on Autocracy … Anne Applebaum has spent decades chronicling the rise of authoritarianism and the collapse of democratic norms around the world.  In her latest piece for The Atlantic, appearing on this week's cover, she turned her attention to Sudan, where a brutal civil war has displaced millions of people.",
    "url": "https://www.status.news/p/anne-applebaum-autocracy-interview"
  },
  {
    "text": "Trump adviser defends labor official's firing, deflects on how data was ‘rigged’  —  Kevin Hassett pointed to the scale of hiring data revisions when asked for evidence to support Trump's claims that a jobs report was politically rigged.  —  just now  —  President Donald Trump's decision … ",
    "url": "https://www.washingtonpost.com/politics/2025/08/03/bureau-labor-statistics-firing-fallout/"
  },
  {
    "text": "Why Trump's Meddling in the Bureau of Labor Statistics Matters  —  Imagine a group of 5-year-olds playing a board game.  The rules are clear, the goal is fair, and one child edges ahead — until, suddenly, another child starts losing.  That's when the trouble begins.  “He cheated!” the losing child yells.",
    "url": "https://www.nytimes.com/2025/08/03/opinion/trump-bls-fired-labor-jobs-data.html?unlocked_article_code=1.bU8.iLX3.cvxds1pXUGP_&smid=nytcore-android-share"
  },
  {
    "text": "Trump Fired America's Economic Data Collector.  History Shows the Perils. … President Trump said he ousted the head of the Bureau of Labor Statistics because the numbers produced by her agency were “rigged” to hurt him politically.Haiyun Jiang/The New York Times",
    "url": "https://www.nytimes.com/2025/08/03/business/trump-bls-firing-economic-reports.html?unlocked_article_code=1.bU8.rRDw.MHENewXzaxZX&smid=url-share"
  },
  {
    "text": "Texas House Democrats flee the state in bid to block GOP's proposed congressional map  —  The lawmakers' absence means the lower chamber won't have enough members present to function, stalling passage of a draft map Democrats have condemned as a political power grab.",
    "url": "https://www.texastribune.org/2025/08/03/texas-democrats-quorum-break-redistricting-map/"
  },
  {
    "text": "Texas Democrats flee state, blocking plan to pad GOP's control of Congress  —  By leaving, Democratic state legislators can stall a Republican plan that would give the GOP five more seats to protect their narrow House majority.  —  Democrats in the Texas legislature fled the state Sunday … ",
    "url": "https://www.washingtonpost.com/politics/2025/08/03/texas-democrats-block-gop-redistricting/"
  },
  {
    "text": "Texas Democrats head to Illinois to deny Republicans a quorum on redistricting  —  In an extraordinary move brokered with Illinois Gov. Pritzker, dozens of Texas House Democrats move to deny quorum as the GOP is set to draw new maps.  —  CHICAGO — In an extraordinary move … ",
    "url": "https://www.nbcnews.com/politics/elections/texas-democrats-head-illinois-deny-republicans-quorum-redistricting-rcna222743"
  },
  {
    "text": "Texas Democrats Leave for Chicago in Bid to Halt Redistricting  —  Democratic lawmakers said they are leaving the state of Texas in an effort to temporarily block Republicans from redrawing its congressional maps — a redistricting initiative pushed by President Donald Trump.",
    "url": "https://www.bloomberg.com/news/articles/2025-08-03/democratic-lawmakers-to-flee-texas-in-bid-to-halt-redistricting"
  },
  {
    "text": "Texas Democrats Leave the State to Block GOP Congressional Map  —  A group of Texas Democratic lawmakers fled the state Sunday, activating their emergency plan to block a hastily-drawn Republican congressional map that's poised to set off a national redistricting battle between red states and blue states.",
    "url": "https://www.democracydocket.com/news-alerts/texas-democrats-leave-the-state-to-block-gop-congressional-map/"
  },
  {
    "text": "White House has no plan to mandate IVF care, despite campaign pledge  —  President Donald Trump has said he wants a “baby boom,” but critics say his administration has yet to make significant family policy changes — and that Medicaid cuts will hurt.  —  Just now",
    "url": "https://www.washingtonpost.com/business/2025/08/03/trump-administration-ivf-care/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzU0MTkzNjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzU1NTc1OTk5LCJpYXQiOjE3NTQxOTM2MDAsImp0aSI6ImYzOTU5ODNjLWM1ZTEtNDNhYS1iYTUxLTY2ODcxYzE5YzNkNyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9idXNpbmVzcy8yMDI1LzA4LzAzL3RydW1wLWFkbWluaXN0cmF0aW9uLWl2Zi1jYXJlLyJ9.YSK9HByFcgPcpwi455pAFHYsR16Mkpk0DjGtyL5AQTU&itid=gfta"
  },
  {
    "text": "The Mothership Vortex: An Investigation Into the Firm at the Heart of the Democratic Spam Machine  —  How a single consulting firm extracted $282 million from a network of spam PACs while delivering just $11 million to actual campaigns.  —  The digital deluge is a familiar annoyance for anyone on a Democratic fundraising list.",
    "url": "https://data4democracy.substack.com/p/the-mothership-vortex-an-investigation"
  },
  {
    "text": "Harvard President Garber Tells Faculty He Is Not Considering a $500 Million Deal With Trump  —  Harvard President Alan M. Garber '76 has told faculty that a deal with the Trump administration is not imminent and denied that the University is considering a $500 million settlement … ",
    "url": "https://www.thecrimson.com/article/2025/8/3/garber-500-million-trump/"
  },
  {
    "text": "The Justice Department seeks voter and election information from at least 19 states, AP finds  —  The requests have come in letters, emails and phone calls.  The specifics vary, but the target is consistent: The U.S. Department of Justice is ramping up an effort to get voter data and other election information from the states.",
    "url": "https://apnews.com/article/justice-department-election-officials-voting-trump-a04b1522bed0cb6bbc286e25b139701f"
  },
  {
    "text": "Trump Is Very Mad at Charlamagne Tha God for Talking About Epstein  —  “I think this Epstein thing is going to be a way for traditional conservatives to take their party back,” the radio host said on Lara Trump's Fox News show  —  Donald Trump is angry and lashing out at radio host … ",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-charlamagne-tha-god-epstein-1235399362/"
  },
  {
    "text": "Trump And Miller Compel Colleges Not To Enroll International Students  —  Stuart Anderson writes about immigration, business and globalization.  —  SaveComment  —  The Trump administration is using rules, policies and formal agreements to compel and discourage U.S. universities from enrolling international students.",
    "url": "https://www.forbes.com/sites/stuartanderson/2025/08/03/trump-and-miller-compel-colleges-not-to-enroll-international-students/"
  },
  {
    "text": "The rise of AI tools that write about you when you die  —  Families and funeral directors are using AI obituary generators to more efficiently memorialize the dead.  What happens when they get it wrong?  —  Two days after Jeff Fargo's mother died, he lay in bed, crying, at home in Nevada and opened his laptop to ChatGPT.",
    "url": "https://www.washingtonpost.com/technology/2025/08/03/ai-obituaries-funeral-homes/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzU0MTkzNjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzU1NTc1OTk5LCJpYXQiOjE3NTQxOTM2MDAsImp0aSI6IjBiNTk1NmY1LWU4MDUtNDBkNC1hNzA0LTIzNjk4NWE4MjM0ZCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS90ZWNobm9sb2d5LzIwMjUvMDgvMDMvYWktb2JpdHVhcmllcy1mdW5lcmFsLWhvbWVzLyJ9.76hnvtuQDy7BamNKDbYGEsCCvQi3VTlxmf6BphsNwLg&itid=gfta"
  },
  {
    "text": "ICE crackdown imperils Afghans who aided U.S. war effort, lawyers say  —  Two former Afghan interpreters for U.S. forces face deportation despite following immigration processes, according to attorneys for the men.  —  One former interpreter for U.S. forces in Afghanistan was detained … ",
    "url": "https://www.washingtonpost.com/nation/2025/08/03/afghanistan-immigrants-trump-deportations/"
  },
  {
    "text": "McCloskeys win back AR-15 rifle 5 years after Black Lives Matter protest confrontation  —  The St. Louis couple who went viral in 2020 for wielding guns as Black Lives Matter protesters marched outside their property have regained possession of their semiautomatic rifle.",
    "url": "https://nypost.com/2025/08/03/us-news/st-louis-mccloskeys-win-back-ar-15-rifle-5-years-after-black-lives-matter-protest-confrontation/"
  },
  {
    "text": "Putin Widens Effort to Control Russia's Internet  —  The introduction of a state-approved messaging app has raised fears that Russia could be preparing to block WhatsApp and Telegram.  —  Russia is escalating its efforts to curtail online freedom, taking new steps toward a draconian state-controlled internet.",
    "url": "https://www.nytimes.com/2025/08/03/world/europe/russia-putin-internet.html?unlocked_article_code=1.bU8.4BJp.o2liXswIHpJ-&smid=url-share"
  },
  {
    "text": "The problem is far bigger than Jeffrey Epstein  —  Treating the scandal as an aberration misunderstands the global epidemic of violence against women  —  On 2 July, the jury delivered a guilty verdict on some of the charges against the music mogul Sean Combs, accused of horrific sexual abuse … ",
    "url": "https://www.theguardian.com/commentisfree/2025/aug/03/jeffrey-epstein-violence-women"
  },
  {
    "text": "DOJ is walking back the White House's goal to arrest 3,000 immigrants per day … It's not the only case that has featured the 3,000-arrest-per-day target as a crucial piece of evidence that the administration's single-minded drive to rack up arrests may have prompted immigration authorities to cut corners or break the law.",
    "url": "https://www.politico.com/news/2025/08/03/white-house-doj-immigration-quota-mismatch-00490406"
  },
  {
    "text": "Sandra Grimes, Who Helped Unmask a C.I.A. Traitor, Dies at 79  —  She became suspicious when she discovered large deposits in the bank account of Aldrich Ames, whose betrayal cost the lives of at least eight double agents.  —  Unmasking the deadliest traitor in Central Intelligence Agency history … ",
    "url": "https://www.nytimes.com/2025/08/03/us/politics/sandra-grimes-dead.html"
  },
  {
    "text": "China welcomes 183 Brazil coffee sellers in wake of US tariffs  —  China has approved 183 new Brazilian coffee companies to export products to the Chinese market, according to a social media post of the Chinese embassy in Brazil on Saturday.  —  The measure, a boon to local exporters … ",
    "url": "https://www.reuters.com/world/china/china-welcomes-183-brazil-coffee-sellers-wake-us-tariffs-2025-08-03/"
  },
  {
    "text": "DNC chair says Democrats will start process of setting 2028 primary calendar this month  —  Democratic National Committee (DNC) Chair Ken Martin said on Sunday that the party will begin deliberating the 2028 primary calendar later this month at a meeting in Minneapolis.",
    "url": "https://thehill.com/homenews/campaign/5434223-dnc-chair-says-democrats-will-start-process-of-setting-2028-primary-calendar-this-month/"
  },
  {
    "text": "Transcript: Dr. Mehmet Oz on “Face the Nation with Margaret Brennan,” Aug. 3, 2025  —  The following is the transcript of an interview with Dr. Mehmet Oz, Centers for Medicare & Medicaid Services administrator, that aired on “Face the Nation with Margaret Brennan” on Aug. 3, 2025.",
    "url": "https://www.cbsnews.com/news/dr-mehmet-oz-cms-administrator-face-the-nation-08-03-2025/"
  },
  {
    "text": "Tequila, Drugs and Torture: The Spending Binge of Two Crypto Bros That Ended Behind Bars  —  William Duplessie and John Woeltz hatched grandiose plans in business and politics but instead drew charges in an alleged kidnap scheme  —  A private jet lifted off on a night in February … ",
    "url": "https://www.wsj.com/us-news/crypto-duplessie-woeltz-kidnap-torture-aae24e88?st=vzAxS3&reflink=desktopwebshare_permalink"
  }
]