[
  {
    "text": "The Proud Boys and Militias Come to Tesla's Defense  —  After weeks of “Tesla Takedown” protests, extremist groups are showing up to back Elon Musk's beleaguered car company.  —  Over the weekend, thousands of people joined the “Tesla Takedown” protest movement at the company's showrooms across the country.",
    "url": "https://www.wired.com/story/proud-boys-and-militias-come-to-teslas-defense/"
  },
  {
    "text": "Trump Administration Will Review Billions in Funding for Harvard  —  The administration has already canceled hundreds of millions in federal grants and contracts at Columbia and the University of Pennsylvania.  —  The Trump administration said on Monday that it was reviewing roughly $9 billion … ",
    "url": "https://www.nytimes.com/2025/03/31/us/trump-administration-harvard-funding.html"
  },
  {
    "text": "Trump is plotting the biggest tax rise in global history  —  The burden for paying the bulk of the president's Liberation Day tariffs will fall on consumers, potentially at some $600 billion a year  —  We might think of him as a tax-cutter, an enemy of big government, and an instinctive ally … ",
    "url": "https://www.telegraph.co.uk/us/comment/2025/03/31/trump-plotting-biggest-tax-rise-global-history/"
  },
  {
    "text": "Estimates Imply That Burden of Tariffs Could Fall Heavily on Consumers  —  A White House trade adviser projected that tariffs would raise about $6 trillion over the next decade.  But raising so much revenue for the government conflicts with the administration's goal of reshoring manufacturing.",
    "url": "https://www.nytimes.com/2025/03/31/us/politics/tariffs-estimates-consumers.html?unlocked_article_code=1.8E4.GW8x.u6NJs6mwBuKA&smid=url-share"
  },
  {
    "text": "Stocks Mark Worst Month in Years as Trump's Tariffs Loom  —  Markets around the world have wavered as fear and uncertainty over tariffs and trade wars rattle investors.  The S&P 500 just recorded its worst month since 2022, shedding 5.8 percent in March.  —  The S&P 500 ended March … ",
    "url": "https://www.nytimes.com/2025/03/30/business/stocks-nikkei-sp500.html"
  },
  {
    "text": "Trump's Tariff Agenda Bets on Americans Giving Up Cheap Goods  —  Treasury Secretary Scott Bessent argues that the American dream is about more than cheap televisions, but inflation-weary consumers might disagree.  —  President Trump's sweeping tariffs are expected to raise the cost of cars … ",
    "url": "https://www.nytimes.com/2025/03/31/business/trump-tariffs-higher-prices.html"
  },
  {
    "text": "Top Officials Placed on Leave After Denying DOGE Access to Federal Payroll Systems  —  DOGE demanded full access to a US Department of the Interior system that handles even the Supreme Court's paychecks.  When top staff asked questions, they were put on leave.",
    "url": "https://www.wired.com/story/doge-access-federal-payroll-systems-officials-leave-interior/"
  },
  {
    "text": "DOGE Accesses Federal Payroll System Over Objections of Career Staff  —  Elon Musk's team gains visibility into sensitive information about hundreds of thousands of government workers despite security concerns raised by IT officials.  —  Members of Elon Musk's cost-cutting Department … ",
    "url": "https://www.nytimes.com/2025/03/31/us/politics/doge-musk-federal-payroll.html?unlocked_article_code=1.8E4.xODT.4Bkvc9BGqcL4&smid=url-share"
  },
  {
    "text": "Republican Operative Nicholas Jacobs Locks Twitter After Elon Musk Check Controversy  —  Jacobs received a $1M check from Musk at a rally in support of Brad Schimel  —  Nicholas Jacobs, chair of the Wisconsin College Republicans and a rising GOP operative, has locked his Twitter account … ",
    "url": "https://meidasnews.com/news/republican-operative-nicholas-jacobs-locks-twitter-after-elon-musk-check-controversy"
  },
  {
    "text": "Cory Booker launches marathon Senate speech  —  Sen. Cory Booker is planning to hold the Senate floor for as long as he can in an effort to protest actions by President Donald Trump and congressional Republicans.  The New Jersey Democrat took to the Senate floor on Monday evening … ",
    "url": "https://www.politico.com/live-updates/2025/03/31/congress/cory-booker-talk-a-thon-00262482"
  },
  {
    "text": "I'm tired of being mocked and hated because I'm a conservative woman  —  As a conservative woman living in Texas, I often feel like I'm living a dual reality.  I'm a mom and a writer, but that's not all.  I go to church, laugh with friends and wave at my neighbors while we are walking our dogs.",
    "url": "https://www.yahoo.com/news/im-tired-being-mocked-hated-090530234.html"
  },
  {
    "text": "Marine Le Pen barred from running for French presidency in 2027  —  Far-right leader found guilty of embezzlement of European funds and immediately barred from running for office  —  The French far-right leader Marine Le Pen has been barred from running for president in 2027 after a court found … ",
    "url": "https://www.theguardian.com/world/2025/mar/31/marine-le-pen-barred-from-running-for-french-presidency-in-2027"
  },
  {
    "text": "John Roberts created a monster.  It's about to eat him.  —  ✍️ ⚖️ ✍️ With corporate outlets obeying in advance, supporting independent political media is more important right now than ever.  Public Notice is possible thanks to paid subscribers.",
    "url": "https://www.publicnotice.co/p/john-roberts-trump-supreme-court-2025"
  },
  {
    "text": "Trump Commutes the Sentence of Another Hunter Biden Business Associate  —  Jason Galanis had pleaded guilty to his role in two fraud schemes before cooperating with Republican congressional investigations into the Bidens.  —  President Trump last week commuted the lengthy fraud sentence … ",
    "url": "https://www.nytimes.com/2025/03/31/us/politics/trump-hunter-biden-jason-galanis.html"
  },
  {
    "text": "New FDA commissioner agreed to oust top vaccine regulator after private swearing-in  —  The forced resignation of Peter Marks has unsettled scientists and researchers.  —  Food and Drug Administration Commissioner Marty Makary signed off on the ouster of top vaccine official Peter Marks shortly … ",
    "url": "https://www.politico.com/news/2025/03/31/new-fda-commissioner-signed-off-on-ousting-top-vaccine-regulator-after-private-swearing-in-00260582"
  },
  {
    "text": "China, Japan, South Korea will jointly respond to US tariffs, Chinese state media says  —  China, Japan and South Korea agreed to jointly respond to U.S. tariffs, a social media account affiliated with Chinese state broadcaster CCTV said on Monday.  —  The comments came after the three countries held … ",
    "url": "https://www.reuters.com/world/china-japan-south-korea-will-jointly-respond-us-tariffs-chinese-state-media-says-2025-03-31/"
  },
  {
    "text": "Louisiana voters reject constitutional amendments championed by Republican governor  —  Louisiana voters soundly rejected four constitutional amendments championed by Republican Gov. Jeff Landry related to crime, courts and finances.  Voters said no to each amendment by margins exceeding 60% … ",
    "url": "https://apnews.com/article/louisiana-constitutional-amendments-landry-c9a48606790251bdddb84978eea382ea"
  },
  {
    "text": "The Pragmatic And Moral Case To Sell Your Tesla  —  If you were waiting for a sign, this is it.  It's time to sell.  —  When I tell strangers my job is to review cars for a living, the most common response is “What do you think of Tesla?”  For well over a decade, Tesla has been the strange … ",
    "url": "https://insideevs.com/features/755057/tesla-sell-victoria-scott-musk/"
  },
  {
    "text": "Missouri Officials Seize Control of St. Louis Police, in Latest Bid to Shutter Local Reforms  —  It has taken nearly a decade for St. Louis' Civilian Oversight Board to find the footing needed to effectively investigate police misconduct and give residents the tools to hold police accountable, says board member Keith Rose.",
    "url": "https://boltsmag.org/missouri-state-control-of-st-louis-police/"
  },
  {
    "text": "Trump administration deports more alleged gang members to El Salvador  —  Move is latest in controversial method of deporting people to be imprisoned abroad without due process in US  —  The US has sent 17 more people accused of being gang members to El Salvador without providing their names … ",
    "url": "https://www.theguardian.com/us-news/2025/mar/31/trump-deports-alleged-gang-members-el-salvador"
  },
  {
    "text": "‘Obstructing justice’: Judge holds ICE agent in contempt over detention of defendant mid-trial  —  A Boston Municipal Court judge has held an Immigration and Customs Enforcement agent in contempt for allegedly obstructing justice when agents arrested a defendant in the middle of his jury trial last week.",
    "url": "https://www.bostonglobe.com/2025/03/31/metro/ice-detention-defendant-trial-judge-investigation/"
  },
  {
    "text": "How to Save a Democracy  —  Americans Can Learn From Opponents of Authoritarianism Elsewhere  —  The first few weeks of Donald Trump's second presidency have accelerated a process of democratic erosion in the United States.  In just two months, the president and his allies have issued executive orders … ",
    "url": "https://www.foreignaffairs.com/united-states/how-save-democracy-trump"
  },
  {
    "text": "Transcript: Trump Text Fiasco Worsens as Knives Come Out for Hegseth  —  The following is a lightly edited transcript of the March 31 episode of the Daily Blast podcast.  Listen to it here.  —  Greg Sargent: This is The Daily Blast from The New Republic, produced and presented by the DSR network.",
    "url": "https://newrepublic.com/article/193361/transcript-trump-text-fiasco-worsens-knives-come-hegseth"
  },
  {
    "text": "DOGE Is Trying to Gift Itself a $500 Million Building, Court Filings Show  —  The documents reveal a DOGE affiliate is attempting to transfer the headquarters of an independent think tank, the United States Institute of Peace, to the government at no cost.  —  The DOGE-affiliated acting president … ",
    "url": "https://www.wired.com/story/doge-takes-control-usip-office-building/"
  },
  {
    "text": "U.S. Has Spent $40 Million to Jail About 400 Migrants at Guantánamo  —  The disclosure of the tab so far came after five senators visited the offshore operation, which they condemned as a waste of resources.  —  Five senators who visited the U.S. base at Guantánamo Bay, Cuba … ",
    "url": "https://www.nytimes.com/2025/03/31/us/politics/migrants-guantanamo-costs.html"
  },
  {
    "text": "Voice of America Is Broken and Can't Be Reformed  —  The U.S. international broadcaster is politically biased, confused and ineffective.  Tear it down.  —  President Trump, in a March 14 executive order, called for the elimination of the U.S. Agency for Global Media to the extent possible by law.",
    "url": "https://www.wsj.com/opinion/voice-of-america-is-broken-and-cant-be-reformed-media-policy-c4781fb0?st=MGehGw&reflink=article_imessage_share"
  },
  {
    "text": "America's Future Is Hungary  —  MAGA conservatives love Viktor Orbán.  But he's left his country corrupt, stagnant, and impoverished.  —  flashy hotels and upmarket restaurants now dominate the center of Budapest, a city once better known for its shabby facades.",
    "url": "https://www.theatlantic.com/magazine/archive/2025/05/viktor-orban-hungary-maga-corruption/682111/?gift=hVZeG3M9DnxL4CekrWGK3x9sHVa0LDGR9gcTv0mlsRo&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "How the Social Security Administration and DOGE are gaslighting Americans  —  The Social Security Administration (SSA) sent an email on March 27 to beneficiaries saying that reports that field offices were closing was an invention of fake news media.  “Recent reports in the media that the … ",
    "url": "https://popular.info/p/how-the-social-security-administration-fff"
  },
  {
    "text": "Comic Amber Ruffin cut from White House correspondents' event after angering Trump team  —  The White House Correspondents Association says it canceled comedian Amber Ruffin from performing at its annual dinner because it wants to refocus the event on journalistic excellence.",
    "url": "https://apnews.com/article/amber-ruffin-white-house-correspondents-dinner-5c92401a3732d45213be365643f347fc"
  },
  {
    "text": "Why Is Elon Musk Trying to Buy a Wisconsin Supreme Court Seat?  —  Tuesday's election, as the only statewide race in the country before November, is a crucial test for the growing backlash against the Trump Administration's agenda.  —  In mid-January, Brad Schimel, a Wisconsin circuit-court judge running … ",
    "url": "https://www.newyorker.com/news/the-lede/why-is-elon-musk-trying-to-buy-a-wisconsin-supreme-court-seat"
  },
  {
    "text": "136. Setting the Record Straight on the Anti-Trump Injunctions  —  Welcome back to “One First,” a weekly newsletter that aims to make the U.S. Supreme Court more accessible to all of us.  —  Every Monday morning, I'll be offering an update on goings-on at the Court (\"On the Docket\"); … ",
    "url": "https://www.stevevladeck.com/p/136-setting-the-record-straight-on"
  },
  {
    "text": "RFK Jr.'s layoffs expected to gut worker safety agency NIOSH, officials say  —  At least two-thirds of the staff at the National Institute of Occupational Safety and Health, or NIOSH, are expected to be laid off as part of a restructuring ordered by Health and Human Services Secretary Robert F. Kennedy Jr. … ",
    "url": "https://www.cbsnews.com/news/rfk-jr-layoffs-hhs-niosh-worker-safety-agency/"
  },
  {
    "text": "Democrats Sue to Block Trump Bid to Control Elections  —  The Democratic Party is suing President Donald Trump over his sweeping executive order last week that attempted to wrest control of elections from the states.  —  Filed Monday by Elias Law Group on behalf of Senate Minority Leader Chuck Schumer … ",
    "url": "https://www.democracydocket.com/news-alerts/democrats-sue-to-block-trump-bid-to-control-elections/"
  },
  {
    "text": "Tim Walz: Why We Lost  —  The would-be Democratic vice-president on 2024's mistakes and 2025's opportunity.  —  Every Democrat seems to have their own diagnosis for why the party lost power in Washington last year, but only one of them was on the vice-presidential ticket.",
    "url": "https://nymag.com/intelligencer/article/tim-walz-democrats-election-trump-kamala-harris.html"
  }
]