[
  {
    "text": "Colorado Supreme Court justices face a flood of threats after disqualifying Trump from the ballot  —  The latest round of threats fits a familiar pattern: Trump faces a legal setback, and officials face threats.  —  In the 24 hours since the Colorado Supreme Court kicked former President Donald Trump off … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/colorado-justices-face-flood-threats-disqualifying-trump-ballot-rcna130720"
  },
  {
    "text": "It's not just Trump: How racism shadows the GOP campaign  —  Donald Trump is getting headlines for saying immigrants are “poisoning the blood of our country.”  But for months the GOP race for president has been shadowed by xenophobia, as some candidates or those backing them have embraced racist and white nationalist themes.",
    "url": "https://www.axios.com/2023/12/21/trump-racism-gop-campaign-2024"
  },
  {
    "text": "How Rep. Jamie Raskin sees the Colorado Supreme Court ruling  —  Good morning, Early Birds.  Winter is no longer coming — it's here.  Today is the shortest day of the year.  Tips: earlytips@washpost.com.  Was this forwarded to you?  Sign up here.  Thanks for waking up with us.",
    "url": "https://www.washingtonpost.com/politics/2023/12/21/how-rep-jamie-raskin-sees-colorado-supreme-court-ruling/"
  },
  {
    "text": "Democrats Keep Hoping It's Curtains for Trump.  He's Still Center Stage.  —  As Donald Trump faces a new threat to his political future, this time over the question of ballot eligibility, Democrats again find themselves looking toward American institutions to stop him.",
    "url": "https://www.nytimes.com/2023/12/21/us/politics/democrats-trump-ballot.html"
  },
  {
    "text": "The Colorado Ruling Calls the Originalists' Bluff  —  The disqualification of Donald Trump challenges the Supreme Court's conservatives to follow through on their stated beliefs.  —  The Colorado Supreme Court has left the justices of the United States Supreme Court in the very uncomfortable position … ",
    "url": "https://www.theatlantic.com/ideas/archive/2023/12/colorado-supreme-court-trump-originalism/676909/"
  },
  {
    "text": "Christie defies calls to bow out, leaving anti-Trump movement splintered  —  The former New Jersey governor and his allies argue that someone needs to take the fight to Trump and that he is best equipped for a one-on-one showdown  —  LONDONDERRY, N.H. — Chris Christie arrived … ",
    "url": "https://www.washingtonpost.com/politics/2023/12/21/chris-christie-trump-republican-nomination/"
  },
  {
    "text": "Putin 'has Trump's number' and still sees him ‘as an asset’, says Fiona Hill  —  Former White House Russia expert argues in a podcast why Moscow is eager for the ex-president to return  —  Vladimir Putin has had Donald Trump's “number for some time ... knows how to manipulate him” … ",
    "url": "https://www.theguardian.com/us-news/2023/dec/20/donald-trump-vladimir-putin-us-elections-2024-moscow"
  },
  {
    "text": "Federal judge blocks California law that would have banned carrying firearms in most public places  —  A federal judge on Wednesday temporarily blocked a California law that would have banned carrying firearms in most public places, ruling that it violates the Second Amendment of the U.S. Constitution … ",
    "url": "https://apnews.com/article/california-gun-laws-concealed-carry-c7ebb8506ed99f41b59455350647c0b6"
  },
  {
    "text": "A broken immigration system keeps workers out of jobs the U.S. needs to fill  —  North Dakota's hospitals are desperate for nurses, but backlogs and other problems in immigration agencies block the way  —  BISMARCK, N.D. — The leaders of Sanford Medical Center had waited all summer to learn … ",
    "url": "https://www.washingtonpost.com/politics/2023/12/21/legal-immigration-backlog-nurses-foreign-hiring/"
  },
  {
    "text": "Speaker Mike Johnson and daughter were profiled attending ‘purity ball’ in 2015 German TV news segment  —  The unearthed segment is the latest example of Johnson's deeply held views.  —  A still image from a 2015 German news segment featuring Mike Johnson and his family.",
    "url": "https://abcnews.go.com/US/speaker-mike-johnson-daughter-profiled-attending-purity-ball/story?id=105785626"
  },
  {
    "text": "U.S. House quietly investigated separate sex tape scandal  —  The Scoop  —  The high-profile Senate sex scandal that rocked Washington, D.C. this month, was, in fact, the time in less thantwo years that sexually explicit videos filmed in the U.S. Capitol prompted an investigation.",
    "url": "https://www.semafor.com/article/12/20/2023/us-house-quietly-investigated-separate-sex-tape-scandal"
  },
  {
    "text": "Readout of Chairman of the Joint Chiefs of Staff Gen. CQ Brown, Jr.'s Video Teleconference with People's Liberation Army of China Chief of the Joint Staff Department Gen. Liu Zhenli  —  Office of the Chairman of the Joint Chiefs of Staff Public Affairs  —  WASHINGTON, D.C. … ",
    "url": "https://www.jcs.mil/Media/News/News-Display/Article/3623794/readout-of-chairman-of-the-joint-chiefs-of-staff-gen-cq-brown-jrs-video-telecon/"
  },
  {
    "text": "12 states where the fate of abortion rights could be on 2024 ballots  —  Voters in about a dozen states in 2024 could decide the fate of abortion rights with constitutional amendments on the ballot in a pivotal election year — including in several battlegrounds that will be key to deciding … ",
    "url": "https://www.washingtonpost.com/politics/2023/12/20/abortion-rights-2024-ballot-measures/"
  },
  {
    "text": "The NRA Is at Rock Bottom—And 15 Years of Tax Filings Tell the Story  —  Years of NRA tax returns obtained by The Daily Beast show that the gun group's revenue has been falling for years.  And last year was the NRA's weakest fundraising year since 2008. … Pay Dirt is a weekly foray into the pigpen of political funding.",
    "url": "https://www.thedailybeast.com/the-nra-is-at-rock-bottomand-15-years-of-tax-filings-tell-the-story"
  },
  {
    "text": "Jan. 6 rioter nabbed in Bumble dating app sting pleads guilty to assaulting officers  —  Andrew Taake was turned in by a Bumble user who used the dating app to try to illicit confessions from Donald Trump supporters who took part in the Capitol attack.  —  WASHINGTON — Nearly three years ago … ",
    "url": "https://www.nbcnews.com/politics/justice-department/jan-6-rioter-nabbed-bumble-dating-app-sting-pleads-guilty-assaulting-o-rcna130593"
  }
]