[
  {
    "text": "GOP senator says Trump should drop out and calls classified documents case ‘almost a slam dunk’  —  Republican Sen. Bill Cassidy described the case against former President Donald Trump for allegedly mishandling classified documents as “almost a slam dunk” and said he thinks Trump should drop out of the 2024 presidential race.",
    "url": "https://www.cnn.com/2023/08/20/politics/bill-cassidy-trump-should-drop-out-cnntv/"
  },
  {
    "text": "CBS News poll finds Trump's big lead grows, as GOP voters dismiss indictments  —  Well, there's no debate about this: Right now, the Republican Party would easily re-nominate Donald Trump for 2024.  And it's not close.  —  The former president now holds his largest lead over his rivals in our polling amid his recent legal troubles.",
    "url": "https://www.cbsnews.com/news/trump-poll-indictments-2023-08-20/"
  },
  {
    "text": "Meadows told special counsel he could not recall Trump ever declassifying Mar-a-Lago docs: Sources  —  Trump has insisted that he declassified all the materials before he left office.  —  Appearing to contradict former President Donald Trump's primary public defense in the classified documents case … ",
    "url": "https://abcnews.go.com/US/meadows-told-special-counsel-recall-trump-declassifying-mar/story?id=102396159"
  },
  {
    "text": "Hogan says No Labels likely to launch third-party ‘alternative’ if Trump, Biden win nominations  —  Former Maryland Gov. Larry Hogan (R) said Sunday No Labels will “very likely” launch a third-party “alternative” if former President Trump and President Biden win the nominations for their parties.",
    "url": "https://thehill.com/homenews/campaign/4161274-hogan-says-no-labels-likely-to-launch-third-party-alternative-if-trump-biden-win-nominations/"
  },
  {
    "text": "Trump confirms he will skip the first GOP debate — and maybe future ones, as well  —  A source familiar with Trump's thinking told NBC News that the former president's social media post, where he made the declaration, applies only to the first two debates.  —  Trump will skip first GOP debate and talk with Tucker Carlson instead",
    "url": "https://www.nbcnews.com/politics/trump-confirms-skip-first-gop-presidential-debate-maybe-future-ones-rcna100888"
  },
  {
    "text": "Trump May Skip Some G.O.P. Debates, but Advisers See a Biden Face-Off as Key  —  The strong desire of Mr. Trump's advisers to see him debate Mr. Biden in the event of a rematch could lead to a clash with the Republican National Committee.  —  On July 17, the head of the Republican Party traveled … ",
    "url": "https://www.nytimes.com/2023/08/20/us/politics/trump-biden-debates.html"
  },
  {
    "text": "Minnesota Democrat pans ‘weird group of folks’ on GOP debate stage  —  Minnesota Gov. Tim Walz (D) on Sunday called the GOP presidential candidates heading to the debate stage a “weird group of folks.”  —  When asked by NBC's “Meet The Press” moderator Chuck Todd about his working relationship … ",
    "url": "https://thehill.com/homenews/4160943-minnesota-democrat-pans-weird-group-of-folks-on-gop-debate-stage/"
  },
  {
    "text": "Russia's Luna-25 Moon Lander Is Lost in a Crash  —  The robotic Luna-25 spacecraft appeared to have “ceased its existence” after a failed orbital adjustment, the space agency Roscosmos said.  —  A Russian robotic spacecraft that was headed to the lunar surface has crashed into the moon … ",
    "url": "https://www.nytimes.com/2023/08/20/science/russia-moon-space-crash.html"
  },
  {
    "text": "Mark Meadows asks federal court for Georgia charges to be dismissed  —  Former Trump chief of staff Mark Meadows has asked a federal court to order all charges against him brought by Fulton County, Georgia, prosecutors last week to be dismissed, since he says the charges relate to his then-role in the federal government.",
    "url": "https://www.cnn.com/2023/08/20/politics/meadows-court-georgia-dismissed/"
  },
  {
    "text": "DeSantis Tweaks His Messaging and Tactics After a Tough Campaign Stretch  —  The Florida governor, who has been losing ground in polls and dealing with staffing, spending and messaging issues, looks to right his campaign in New Hampshire.  —  On a weekend tour through New Hampshire … ",
    "url": "https://www.nytimes.com/2023/08/20/us/politics/desantis-stump-speech.html"
  },
  {
    "text": "Biden administration to urge Americans get new COVID-19 boosters  —  The Biden administration plans to urge all Americans to get a booster shot for the coronavirus this autumn to counter a new wave of infections, a White House official said on Sunday.  —  The official said that while the Centers … ",
    "url": "https://www.reuters.com/world/us/biden-administration-urge-americans-get-new-covid-19-boosters-2023-08-20/"
  },
  {
    "text": "‘I could sell golf’: How DeSantis and aides courted lobbyists for campaign cash  —  The efforts to effectively auction off leisure time to those seeking to influence state policy created a special pathway of access for big donors that is striking in the way that it was documented in writing, ethics experts said",
    "url": "https://www.washingtonpost.com/politics/2023/08/20/ron-desantis-donors-lobbyists-florida/"
  },
  {
    "text": "Transcript: Hawaii Gov. Josh Green on “Face the Nation,” August 20, 2023  —  The following is a transcript of an interview with Hawaii Gov. Josh Green that aired on “Face the Nation” on August 20, 2023.  —  MARGARET BRENNAN: We go now to Hawaii's Governor Joshua Green in Honolulu.  Good morning.",
    "url": "https://www.cbsnews.com/news/josh-green-hawaii-governor-face-the-nation-08-20-2023/"
  },
  {
    "text": "How conservatives use ‘verbal jiu-jitsu’ to turn liberals' language against them  —  The two frontrunners for the White House in 2024 are tied in a hypothetical rematch.  Congress is paralyzed.  Every big election seems to be decided by razor-thin margins.",
    "url": "https://www.cnn.com/2023/08/20/politics/conservatives-verbal-combat-blake-cec/"
  },
  {
    "text": "Before investigating Hunter Biden, prosecutor worked with brother Beau  —  David Weiss, the special counsel investigating Hunter Biden, has long targeted Delaware's powerful interests.  His onetime experience with Beau Biden potentially complicates the probe.",
    "url": "https://www.washingtonpost.com/politics/2023/08/20/hunter-biden-david-weiss-special-prosecutor-delaware/"
  }
]