[
  {
    "text": "Why some Republicans won't vote for Trump if he's nominated  —  A small but substantial chunk of Republican primary and caucus voters say they would be so dissatisfied if Donald Trump became the party's presidential nominee that they would not vote for him in November's general election, according to AP VoteCast.",
    "url": "https://apnews.com/article/trump-primary-caucus-republican-voters-general-election-4a64d34b6d74e167cf6b256784c841c0"
  },
  {
    "text": "CBS News poll finds voters remember Trump's economy as good, boosting Trump to national lead over Biden today  —  As Super Tuesday makes an historic rematch all but official, voters are comparing not just two presidents, but two presidencies.  —  And right now former President Donald Trump emerges … ",
    "url": "https://www.cbsnews.com/news/poll-trump-leads-biden-economy/"
  },
  {
    "text": "A Large Percentage of Republican Primary Voters Can't Stomach Trump  —  New polling analyses indicate what Trump is up against within his own party.  —  Former president Donald Trump easily swept to victory in a handful of additional Republican caucuses this weekend, looking ever more imperious in his bid for the GOP nomination.",
    "url": "https://www.motherjones.com/politics/2024/03/trump-republican-voters-polling-primary/"
  },
  {
    "text": "Majority of Biden's 2020 Voters Now Say He's Too Old to Be Effective  —  A New York Times/Siena College poll revealed how much even his supporters worry about his age, intensifying what has become a grave threat to his re-election bid.  —  Widespread concerns about President Biden's age pose … ",
    "url": "https://www.nytimes.com/2024/03/03/us/politics/biden-age-trump-poll.html"
  },
  {
    "text": "Trump confuses Obama for Biden again at Virginia rally speech  —  Richmond crowd reportedly went silent as 77-year-old mixed up the president and ex-president for third time in past six months  —  Donald Trump confused Barack Obama for Joe Biden at a rally in Virginia on Saturday … ",
    "url": "https://www.theguardian.com/us-news/2024/mar/03/trump-confuses-obama-biden-virginia-rally"
  },
  {
    "text": "Lisa Murkowski says she ‘could not’ vote for Trump or Biden in 2024  —  The Alaska senator admitted that she also didn't vote for former President Donald Trump in 2020.  —  WASHINGTON — Republican Sen. Lisa Murkowski said Saturday she “could not” vote for former President Donald Trump … ",
    "url": "https://www.nbcnews.com/politics/2024-election/lisa-murkowski-says-not-vote-trump-biden-2024-rcna141551"
  },
  {
    "text": "Florida is swamped by disease outbreaks as quackery replaces science  —  The state is in the grip of a measles outbreak, yet Joseph Ladapo, the surgeon general, continues to ignore medical science to stop it  —  Shortly before Joseph Ladapo was sworn in as Florida's surgeon general in 2022 … ",
    "url": "https://www.theguardian.com/us-news/2024/mar/03/florida-measles-outbreak-preventable"
  },
  {
    "text": "A Supreme Court decision could come Monday in a case about barring Trump from the 2024 ballot  —  A Supreme Court decision could come as soon as Monday in the case about whether former President Donald Trump can be kicked off the ballot over his efforts to undo his defeat in the 2020 election.",
    "url": "https://apnews.com/article/supreme-court-trump-capitol-riot-colorado-maine-d784759ab9376d4c3a6e3ae72465f448"
  },
  {
    "text": "Trump's Mar-a-Lago playdate with Orbán is cause for alarm  —  Trump's upcoming meetup with the Hungarian leader is particularly worrying after the Supreme Court arguably gave him a pathway to model the strongman during a second term.  —  Donald Trump's Mar-a-Lago estate has become … ",
    "url": "https://www.msnbc.com/the-reidout/reidout-blog/trump-viktor-orban-mar-a-lago-visit-rcna141449"
  },
  {
    "text": "Nikki Haley says she's no longer bound by RNC pledge to endorse Trump if he wins  —  In an interview with “Meet the Press,” Haley dodged, saying, “When you all ask Donald Trump if he would support me, then I will talk about that.”  —  Former U.N. Ambassador Nikki Haley no longer feels bound … ",
    "url": "https://www.nbcnews.com/politics/2024-election/nikki-haley-says-s-no-longer-bound-rnc-pledge-endorse-trump-wins-rcna141518"
  },
  {
    "text": "The anti-abortion playbook for restricting birth control  —  Contraception, like IVF, poses problems for those claiming personhood begins at conception.  —  The national debate over IVF, unfolding after an Alabama court decision prompted multiple clinics in the state to halt operations, prompts a question: What might be next?",
    "url": "https://www.vox.com/24087411/anti-abortion-roe-dobbs-birth-control-contraception-ivf"
  },
  {
    "text": "Brand new report reveals widening voter participation gap due to gutting of Voting Rights Act  —  A new report from the Brennan Center for Justice details the growing racial voter gap as Black voter participation has gone down since the Supreme Court dealt a major blow to the Voting Rights Act in 2013.",
    "url": "https://www.msnbc.com/ali-velshi/watch/brand-new-report-reveals-widening-voter-participation-gap-due-to-gutting-of-voting-rights-act-205361733839"
  },
  {
    "text": "Lauren Boebert doesn't want to lose the House  —  A messy divorce and flagging popularity upended her personal life and threatened her political future.  Can the MAGA Mean Girl start over without changing?  —  WINDSOR, Colo. — On a recent February afternoon, Rep. Lauren Boebert's (R-Colo.) … ",
    "url": "https://www.washingtonpost.com/style/power/2024/03/03/lauren-boebert-reelection/"
  },
  {
    "text": "Republican attacks on tenure ramp up in latest battle with higher education  —  Tenure for college professors is the latest front in Republicans' battle with higher education.  —  Since tenure gives a professor job security for decades, undercutting it is one way conservatives … ",
    "url": "https://thehill.com/homenews/education/4498350-republican-attacks-college-tenure-higher-education/"
  }
]