[
  {
    "text": "Trump won't rule out seeking a third term in the White House, tells NBC News ‘there are methods’ for doing so  —  President Donald Trump said in a Sunday-morning phone call that he was “not joking” about a third term, adding that “it is far too early to think about it.”",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-third-term-white-house-methods-rcna198752"
  },
  {
    "text": "Americans want Trump's focus more on prices, not tariffs; most approve of deportation efforts — CBS News poll  —  After a week that brought tough economic news and polling showing Americans' views of the economy are still sour, most say President Trump has focused too much on tariffs … ",
    "url": "https://www.cbsnews.com/news/opinion-poll-trump-economy-tariffs-deportation-immigration/"
  },
  {
    "text": "Trump's promised ‘Liberation Day’ of tariffs is coming.  Here's what it could mean for you  —  President Donald Trump says Wednesday will be “Liberation Day” — a moment when he plans to roll out a set of tariffs that he promises will free the United States from foreign goods.",
    "url": "https://apnews.com/article/trump-new-tariffs-liberation-day-import-taxes-118d73f50e5133ef3d9598aed6661a6c"
  },
  {
    "text": "Trump says he's ‘very angry’ and ‘pissed off’ at Putin during an NBC News interview  —  Trump said in an early-morning phone call that if he believes Russia is at fault for a ceasefire not being reached with Ukraine, he may impose secondary tariffs on Russian oil.",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-angry-putin-zelenskyy-iran-sanctions-rcna198729"
  },
  {
    "text": "Trump says “there will be bombing” if Iran does not make nuclear deal  —  U.S. President Donald Trump on Sunday threatened Iran with bombings and secondary tariffs if Tehran did not come to an agreement with Washington over its nuclear program.  —  In a telephone interview with NBC News … ",
    "url": "https://www.reuters.com/world/trump-says-there-will-be-bombing-if-iran-does-not-make-nuclear-deal-2025-03-30/"
  },
  {
    "text": "For God's Sake, Fellow Lawyers, Stand Up to Trump  —  President Trump this month issued an executive order clearly intended to destroy the venerable law firm Perkins Coie, a firm that has zealously represented clients large and small for more than a century.",
    "url": "https://www.nytimes.com/2025/03/30/opinion/perkins-coie-trump.html?unlocked_article_code=1.704.9pYt.a6WWtBIYt52n"
  },
  {
    "text": "Scoop: White House to take charge of briefing-room seating chart  —  The White House plans to impose its own seating chart for reporters in the briefing room in coming weeks, taking over a function long managed by the reporters themselves through the White House Correspondents' Association.",
    "url": "https://www.axios.com/2025/03/30/white-house-press-briefing-seating-chart"
  },
  {
    "text": "Deep fear in coal country: DOGE cuts put region's miners and families on edge  —  For federal safety inspectors, the urgent call to their sprawling mining office near Pittsburgh was bleak: Man crushed in the rubble of an aging mine in the heart of coal country.",
    "url": "https://www.post-gazette.com/business/powersource/2025/03/30/coal-mine-safety-doge-trump-spending-cuts-federal/stories/202503280062"
  },
  {
    "text": "SCOOP: ICE Revoking Students' Immigration Statuses Without Their or the University's Knowledge  —  In a developing story, it appears the Trump administration is quietly targeting even more students for deportation and doing so in a way that is taking universities and the students themselves completely by surprise.",
    "url": "https://zeteo.com/p/ice-manually-revoking-university-students-residency-status-middle-east"
  },
  {
    "text": "Twenty Lessons, read by John Lithgow  —  Key selections from On Tyranny, for viewing and sharing  —  Here is my best guidance for action, rendered beautifully by the great John Lithgow.  I first published these lessons more than eight years ago, in late 2016.",
    "url": "https://snyder.substack.com/p/twenty-lessons-read-by-john-lithgow"
  },
  {
    "text": "The s-word rippling through Wall Street and Main Street  —  Economic growth has flatlined so far this year.  Inflation has picked up.  And consumers expect both to get worse in the months ahead.  —  Why it matters: For the moment, it adds up to Wall Street's least-favorite “s-word,” … ",
    "url": "https://www.axios.com/2025/03/30/stagflation-economy-inflation-growth"
  },
  {
    "text": "UAW president: ‘Deplorable’ that Trump stripped union rights for federal workers  —  United Auto Workers (UAW) President Shawn Fain said it is “deplorable” that President Trump moved to strip union rights from federal workers.  —  Fain joined CBS News's “Face the Nation” on Sunday … ",
    "url": "https://thehill.com/homenews/administration/5222300-uaw-president-deplorable-trump-strip-union-rights-federal-workers/"
  },
  {
    "text": "A Competitive Race for Mike Waltz's Seat Rattles Republicans  —  Democrats are hoping to do better in Florida's Sixth District than they did in November, when President Trump won it by 30 points.  —  Frank Curnow, a retired Navy veteran, had a question for the Republican Party volunteers … ",
    "url": "https://www.nytimes.com/2025/03/30/us/politics/a-competitive-race-for-mike-waltzs-seat-rattles-republicans.html"
  },
  {
    "text": "DOGE wants businesses to run government services ‘as much as possible’  —  Elon Musk's effort is pushing privatization — a longtime goal for conservatives and for Silicon Valley alike — across federal agencies  —  Mail delivery.  Real estate.  Foreign aid grants.",
    "url": "https://www.washingtonpost.com/technology/2025/03/30/doge-privatize-government-usps-trump/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQzMzA3MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ0Njg5NTk5LCJpYXQiOjE3NDMzMDcyMDAsImp0aSI6IjM5MzgyNDNiLTU2ZDUtNDRkOC04YzA5LTg1NTBmMWZhYjI1YSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS90ZWNobm9sb2d5LzIwMjUvMDMvMzAvZG9nZS1wcml2YXRpemUtZ292ZXJubWVudC11c3BzLXRydW1wLyJ9.SRNV-xoYzN5sJ9bun4C03UPYG3TCnPBxhqGLBmYS2ss&itid=gfta"
  },
  {
    "text": "(2nd LD) Trade chiefs of S. Korea, China, Japan discuss advancing trade cooperation at three-way meeting  —  Kim Na-young  —  (ATTN: ADDS more info in paras 7-9, 12-15)  —  The top trade officials of South Korea, China and Japan on Sunday discussed bolstering trade cooperation among … ",
    "url": "https://en.yna.co.kr/view/AEN20250330000952320"
  },
  {
    "text": "‘Never been done’: Why Republicans might approve a budget whose numbers don't match up  —  The planned House vs. Senate split sidesteps a thorny political problem but sets up a tricky path forward.  —  President Donald Trump wants action now, unity later, on his legislative agenda.",
    "url": "https://www.politico.com/news/2025/03/30/gop-budget-house-vs-senate-00258076"
  },
  {
    "text": "A.O.C. Wants the Democrats to Think Anew  —  It might surprise some people that Representative Alexandria Ocasio-Cortez, American politics' most dynamic progressive icon, wishes Democrats would stop thinking “that the power struggle within the party is between progressives and moderates,” as she told me recently.",
    "url": "https://www.nytimes.com/2025/03/30/opinion/aoc-bernie-sanders-democrats.html?unlocked_article_code=1.704.Bkmd.s7ohS_0MiAfU&smid=url-share"
  },
  {
    "text": "Trump quickly works to consolidate power and muzzle dissenting voices  —  From law firms and universities to the arts and the press, Trump has targeted these independent actors and tried to bend them to his worldview — willingly or not.  —  WASHINGTON — Moving at a rapid-fire clip … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-quickly-works-consolidate-power-muzzle-dissenting-voices-rcna197766"
  },
  {
    "text": "Infantilizing the Military  —  Hegseth is now purging military libraries  —  It is fair to say that Pete Hegseth did not get to where he is today by reading, or considering all sides of a topic.  He shoots from the hip.  He calls it like it is.  He posts war plans on group chats.",
    "url": "https://donmoynihan.substack.com/p/infantilizing-the-military"
  },
  {
    "text": "The Trump 2.0 resistance: Alive, but evolved  —  The resistance of 2025 may not be wearing a pink knitted cap — but it's alive in town halls, streets, campuses and car dealerships across the country.  —  The big picture: If the 2017 Women's March heralded a new era of protest, so too … ",
    "url": "https://www.axios.com/2025/03/30/trump-doge-protests-resistance-april-5"
  },
  {
    "text": "Protesters rebelling against Elon Musk's purge of US government swarm Tesla showrooms  —  The Tesla Takedown movement Saturday attempted to surround all 277 of the automaker's showrooms and service centers in the U.S. in hopes of hitting Musk's bottom line.  —  SAN FRANCISCO … ",
    "url": "https://www.politico.com/news/2025/03/29/protesters-elon-musk-tesla-00259304"
  },
  {
    "text": "White House ordered firing of L.A. federal prosecutor on ex-Fatburger CEO case, sources say  —  A federal prosecutor in Los Angeles was fired Friday at the behest of the White House, after lawyers for a fast-food executive he was prosecuting pushed officials in Washington to drop all charges against him … ",
    "url": "https://www.latimes.com/california/story/2025-03-29/los-angeles-federal-prosecutor-fired"
  },
  {
    "text": "Trump seeks takeover of elections in a bid for more presidential power  —  Rooted in the president's false claims of election fraud, Trump's executive order is illustrative of governing through dictates rather than legislation.  —  Just now  —  Almost no part of government is immune … ",
    "url": "https://www.washingtonpost.com/politics/2025/03/30/trump-seeks-takeover-elections/"
  },
  {
    "text": "The Secret History of the War in Ukraine  —  This is the untold story of America's hidden role in Ukrainian military operations against Russia's invading armies.  —  On a spring morning two months after Vladimir Putin's invading armies marched into Ukraine, a convoy of unmarked cars slid … ",
    "url": "https://www.nytimes.com/interactive/2025/03/29/world/europe/us-ukraine-military-war-wiesbaden.html"
  },
  {
    "text": "Just like McCarthy, Trump spreads fear everywhere before picking off his targets  —  Arrests, blacklists and deportations are chilling reminders of the red scare that transformed America  —  'Gold, mister, is worth what it is because of the human labor that goes into the finding and getting of it.",
    "url": "https://www.theguardian.com/commentisfree/2025/mar/30/just-like-mccarthy-trump-spreads-fear-everywhere-before-picking-off-his-targets"
  },
  {
    "text": "After DOGE Targeted V.A., an Iraq Veteran Faced Uncertainty and Crisis … It had been six days since Joy Marver was locked out of her office at the U.S. Department of Veterans Affairs, five days since she checked herself into a hospital for emergency psychiatric care, and two days since … ",
    "url": "https://www.nytimes.com/2025/03/30/us/doge-iraq-veteran-fired.html"
  }
]