[
  {
    "text": "Trump ousts at least 15 independent inspectors general in late-night purge  —  The dismissals appeared to violate federal law, which requires Congress to receive 30 days' notice of any intent to fire a Senate-confirmed inspector general.",
    "url": "https://www.washingtonpost.com/politics/2025/01/24/trump-fire-inspectors-general-federal-agencies/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM3Njk0ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM5MDc3MTk5LCJpYXQiOjE3Mzc2OTQ4MDAsImp0aSI6IjM0ZGM3MzVkLTU4ODktNDEzOC04MWQ1LTEwZjQzOGY3NjUzZiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzAxLzI0L3RydW1wLWZpcmUtaW5zcGVjdG9ycy1nZW5lcmFsLWZlZGVyYWwtYWdlbmNpZXMvIn0.8XF_Noz3ifkriOenjwC09PgmWb3cN91LcQD73dnY3uA&itid=gfta"
  },
  {
    "text": "Trump fires independent inspectors general in Friday night purge  —  The watchdogs say the removals may be invalid for failing to comply with a 2022 law requiring a 30-day notification to Congress before removals.  —  President Donald Trump fired multiple independent federal watchdogs … ",
    "url": "https://www.politico.com/news/2025/01/25/donald-trump-inspectors-general-firing-00200611"
  },
  {
    "text": "Trump Fires at Least 12 Inspectors General in Late-Night Purge  —  The internal government watchdogs were believed to have been dismissed at several major agencies, though the Justice Department's was not said to have been among them.  —  President Trump fired at least 12 inspectors general late … ",
    "url": "https://www.nytimes.com/2025/01/24/us/politics/trump-fires-inspectors-general.html"
  },
  {
    "text": "Trump fires 17 independent inspectors general at federal agencies, source says  —  U.S. President Donald Trump fired 17 independent watchdogs at multiple government agencies on Friday, a person with knowledge of the matter said, eliminating a critical oversight component and clearing the way to replace them with loyalists.",
    "url": "https://www.reuters.com/world/us/trump-fires-least-12-independent-inspectors-general-washington-post-reports-2025-01-25/"
  },
  {
    "text": "Through the blizzard of edicts, see Trump for what he is: an autocrat reaching for limitless power  —  In just 100 hours, the returned president has already revealed his goal and exposed the weakness of those who might challenge him  —  It's hard to see in a blizzard.",
    "url": "https://www.theguardian.com/commentisfree/2025/jan/24/donald-trump-executive-orders-autocrat-limitless-power"
  },
  {
    "text": "Let's Get to the Marrow of What Trump Just Did  —  This is an edited transcript of an episode of “The Ezra Klein Show.”  You can listen to the conversation by following or subscribing to the show on the NYT Audio App, Apple, Spotify, Amazon Music, YouTube, iHeartRadio or wherever you get your podcasts.",
    "url": "https://www.nytimes.com/2025/01/25/opinion/ezra-klein-podcast-dara-lind-matthew-yglesias.html"
  },
  {
    "text": "McConnell sends a message  —  With a vote against Pete Hegseth, the former GOP leader makes clear he will be an unreliable ally of Donald Trump.  —  Mitch McConnell might not run the Senate anymore.  But he made clear on Friday night that he still knows how to wield power.",
    "url": "https://www.politico.com/news/2025/01/24/pete-hegseth-vote-mcconnell-006649"
  },
  {
    "text": "Trump's canceling of 50 security clearances is unprecedented and partisan, experts say  —  The move is meant to please Trump voters, punish perceived enemies and represents “the most politically saturated security action since the Oppenheimer case in the 1950s.”",
    "url": "https://www.nbcnews.com/politics/national-security/trumps-canceling-scores-security-clearances-unprecedented-rcna189245?utm"
  },
  {
    "text": "Scientists at NIH can't purchase supplies for their studies after Trump administration pauses outside communications  —  Scientists at the National Institutes of Health have been told the communications pause announced by the Trump Administration earlier this week includes a pause on all purchasing … ",
    "url": "https://www.cnn.com/2025/01/24/health/nih-scientists-purchase-supplies-trump-administration-pauses-communications/"
  },
  {
    "text": "C.I.A. Now Favors Lab Leak Theory to Explain Covid's Origins  —  A new analysis that began under the Biden administration is released by the C.I.A.'s new director, John Ratcliffe, who wants the agency to get “off the sidelines” in the debate.  —  The C.I.A. has said for years … ",
    "url": "https://www.nytimes.com/2025/01/25/us/politics/cia-covid-lab-leak.html"
  },
  {
    "text": "CIA now says Covid-19 is more likely to have originated from a lab leak  —  The intelligence agency has said for years it couldn't say with certainty where the pandemic originated from.  —  The Central Intelligence Agency said Saturday that it's more likely a lab leak caused the Covid-19 pandemic … ",
    "url": "https://www.politico.com/news/2025/01/25/cia-covid-19-lab-00200618"
  },
  {
    "text": "House Speaker Invites Trump to Address Congress on March 4  —  House Speaker Mike Johnson invited President Donald Trump to address a joint session of Congress on March 4, seeking to set the stage for his first major speech to lawmakers since he returned to the White House.",
    "url": "https://www.bloomberg.com/news/articles/2025-01-25/house-speaker-invites-trump-to-address-congress-on-march-4"
  },
  {
    "text": "A Montgomery County official mimicked Elon Musk's controversial ‘salute,’ sparking outrage online and her resignation from the local library and a nonprofit  —  A township supervisor in Montgomery County has come under fire, and resigned from her position at the local library and a nonprofit … ",
    "url": "https://www.inquirer.com/politics/pennsylvania/towamencin-supervisor-laura-smith-nazi-salute-20250125.html"
  },
  {
    "text": "Elon Musk appears on video at German far right campaign event  —  Elon Musk made a surprise appearance during Germany's AfD (Alternative fuer Deutschland) election campaign event in Halle in eastern Germany on Saturday, speaking publicly in support of the far right party for the second time in as many weeks.",
    "url": "https://www.reuters.com/world/europe/elon-musk-appears-video-german-far-right-campaign-event-2025-01-25/"
  },
  {
    "text": "More DEI fallout: Air Force scraps course that used videos of Tuskegee Airmen and female WWII pilots  —  The Air Force has removed training courses with videos of its storied Tuskegee Airmen and the Women Airforce Service Pilots, or WASPs — the female World War II pilots who were vital … ",
    "url": "https://apnews.com/article/air-force-dei-tuskegee-women-wwii-pilots-ecdeac68dc7696535d093c7690ab73bc"
  },
  {
    "text": "‘Hit Him Back Twice as Hard’: Canada's No. 1 Populist Has a Risky Trump Strategy  —  Eight years ago, Justin Trudeau was the face of Canadian resistance to Trump.  Not anymore.  —  “I'm a street fighter in politics,” Ontario Premier Doug Ford said.  “If someone throws a punch at me, I'm going to hit him back twice as hard.”",
    "url": "https://www.politico.com/news/magazine/2025/01/25/doug-ford-trump-trade-resistance-00200457"
  },
  {
    "text": "China tells Rubio to behave himself in veiled warning  —  China's veteran foreign minister has issued a veiled warning to America's new secretary of state: Behave yourself.  Foreign Minister Wang Yi conveyed the message in a phone call Friday, their first conversation since Marco Rubio's confirmation … ",
    "url": "https://apnews.com/article/china-us-rubio-wang-phone-0c2dfd278aa002cfb6100683daec5b7f"
  }
]