[
  {
    "text": "Trump Received Millions From Foreign Governments as President, Report Finds  —  House Democrats released evidence that the former president took in at least $7.8 million from foreign entities while in office, engaging in the kind of conduct the G.O.P. is grasping to pin on President Biden.",
    "url": "https://www.nytimes.com/2024/01/04/us/politics/trump-hotels-foreign-business-report.html"
  },
  {
    "text": "Report: Trump businesses received $7.8 million in foreign payments during presidency  —  During Donald Trump's presidency, his businesses received at least $7.8 million in payments from the foreign governments and officials of 20 countries, including China, Saudi Arabia and Qatar … ",
    "url": "https://www.washingtonpost.com/politics/2024/01/04/report-trump-businesses-received-78-million-foreign-payments-during-presidency/"
  },
  {
    "text": "Trump received at least $7.8 million in payments from foreign governments as president, House Democrats say  —  Democrats on the House Oversight Committee obtained information about the payments during two of the four years Trump served as president.  —  WASHINGTON — Former President Donald … ",
    "url": "https://www.nbcnews.com/politics/congress/trump-received-78-million-payments-foreign-governments-president-repor-rcna132276"
  },
  {
    "text": "ISIS claims responsibility for deadly Iran bombing  —  The Islamic State of Iraq and Syria (ISIS) has claimed responsibility for a deadly Iran bombing that killed over 80 people and wounded scores more.  —  ISIS, seen as a terrorist group by most of the world, said in a widely circulated statement … ",
    "url": "https://thehill.com/policy/defense/4389226-isis-iran-bombing-kerman/"
  },
  {
    "text": "Islamic State claims responsibility for attacks that killed nearly 100 people in Iran - group on telegram  —  Islamic State claimed responsibility on Thursday for two explosions that killed nearly 100 people and wounded scores at a ceremony in Iran to commemorate commander Qassem Soleimani, who was killed by a U.S. drone in 2020.",
    "url": "https://www.reuters.com/world/middle-east/islamic-state-claims-responsibility-attacks-that-killed-nearly-100-people-iran-2024-01-04/"
  },
  {
    "text": "Florida surgeon general calls for halt on mRNA covid vaccines, citing debunked claim  —  Florida's top health official called for a halt to using mRNA coronavirus vaccines on Wednesday, contending that the shots could contaminate patients' DNA — a claim that has been roundly debunked … ",
    "url": "https://www.washingtonpost.com/health/2024/01/03/florida-surgeon-general-ladapo-covid-vaccine/"
  },
  {
    "text": "Most Republicans think Donald Trump is a person of faith.  We asked why  —  More Republicans see Trump as a ‘person of faith’ than as ‘religious’  —  Most Republican voters consider former President Donald Trump to be a person of faith, putting him ahead of other more vocally religious individuals … ",
    "url": "https://www.deseret.com/2024/1/3/23982720/republicans-think-donald-trump-is-person-of-faith-we-asked-why"
  },
  {
    "text": "Chicago in January with flip flops  —  Judd Legum, Tesnim Zekeria, and Rebecca Crosby  —  Texas Governor Greg Abbott (R) says he has transported 95,000 migrants from the Texas border to New York, Washington, DC, and other cities.  On New Year's Eve, Abbott flew hundreds of migrants … ",
    "url": "https://popular.info/p/chicago-in-january-with-flip-flops"
  },
  {
    "text": "Claudine Gay and America's new class system  —  Ibram X. Kendi's “anti-racist” pronouncements are pure grift, but his woke prestige makes them a good place to start in examining Claudine Gay's belated exit as Harvard University's first black president.  In her long-overdue resignation letter Tuesday … ",
    "url": "https://www.washingtonexaminer.com/opinion/claudine-gay-and-americas-new-class-system"
  },
  {
    "text": "Biden campaign previews Jan. 6-focused speech with new TV ad  —  The 60-second spot, which features the president's past message about threats to democracy, comes shortly before the first contests in the GOP nominating process.  —  As President Joe Biden prepares to deliver … ",
    "url": "https://www.nbcnews.com/politics/2024-election/biden-campaign-previews-jan-6-focused-speech-new-tv-ad-rcna132137"
  },
  {
    "text": "Fear of MAGA “backlash” is no reason to let Donald Trump make an illegal run for president  —  Giving into MAGA threats by keeping Trump on the ballot just emboldens fascists to get even more violent  —  Despite hand-wringing mainstream media coverage calling it “controversial,” … ",
    "url": "https://www.salon.com/2024/01/04/fear-of-maga-backlash-is-no-reason-to-let-donald-make-an-illegal-run-for/"
  },
  {
    "text": "Multiple people shot at Iowa high school on the first day after winter break, officials say  —  The shooter at Perry High School is dead from an apparent self-inflicted gunshot wound, multiple senior law enforcement officials said.  Three others were injured, including two students and an administrator, the officials added.",
    "url": "https://www.nbcnews.com/news/us-news/live-blog/live-updates-active-shooting-perry-high-school-rcna132235"
  },
  {
    "text": "A quarter of Americans believe FBI instigated Jan. 6, Post-UMD poll finds  —  More than 3 in 10 Republicans have adopted the falsehood that the FBI conspired to cause the Capitol riot  —  Twenty-five percent of Americans say it is “probably” or “definitely” true that the FBI instigated the Jan. 6 … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2024/01/04/fbi-conspiracy-jan-6-attack-misinformation/"
  },
  {
    "text": "Biden administration awarding $162M to expand computer chip factories in Colorado, Oregon  —  The Biden administration announced an agreement Thursday to provide $162 million in federal funding to Microchip Technology to expand production of computer chips domestically, the second tranche … ",
    "url": "https://thehill.com/homenews/administration/4388788-biden-administration-funding-chip-factories-colorado-oregon/"
  },
  {
    "text": "Progressive group files FEC complaint against Phillips campaign  —  A progressive watchdog organization has filed a Federal Election Commission (FEC) complaint against Rep. Dean Phillips (D-Minn.), alleging his presidential campaign improperly coordinated with a super PAC.",
    "url": "https://thehill.com/homenews/campaign/4388846-fec-complaint-dean-phillips-2024-election/"
  },
  {
    "text": "Texas, where women are less important than a fetus  —  Texas doesn't care if pregnant women die.  That comes as no surprise in the post-Dobbs abortion landscape.  But it's worth noting when the state's unceasing cruelty is aided and abetted by federal judges.  —  Need something to talk about?",
    "url": "https://www.washingtonpost.com/opinions/2024/01/03/abortion-texas-5th-circuit-emergency/"
  },
  {
    "text": "No Top U.S. Government Official Earns Majority Job Approval  —  WASHINGTON, D.C. — As Congress and the Supreme Court return from holiday break, none of the leading elected or appointed figures of the U.S. federal government receives majority approval from Americans.",
    "url": "https://news.gallup.com/poll/547997/no-top-government-official-earns-majority-job-approval.aspx"
  },
  {
    "text": "US Senators urge Tesla, other automakers to stay neutral in union organizing  —  A group of 33 senators on Thursday urged Tesla (TSLA.O) and 12 other automakers to remain neutral in ongoing efforts by the United Auto Workers (UAW) to organize U.S. auto plants.",
    "url": "https://www.reuters.com/business/autos-transportation/senators-urge-tesla-12-other-automakers-remain-neutral-organizing-drives-2024-01-04/"
  },
  {
    "text": "‘Beyond Crazy’: The Liberal Jew Mugged by a Post-Oct. 7 World  —  French rabbi Delphine Horvilleur says the antisemitism in the U.S. following Hamas' attack on Israel is not so surprising — and all too familiar.  —  SAINT-JEAN-CAP-FERRAT, France —  “If I had been given one dollar … ",
    "url": "https://www.politico.com/news/magazine/2024/01/04/delphine-horvilleur-antisemitism-france-00133462"
  }
]