[
  {
    "text": "Bragg Soldiers Who Cheered Trump's Political Attacks While in Uniform Were Checked for Allegiance, Appearance  —  It was supposed to be a routine appearance, a visit from the commander in chief to rally the troops, boost morale and celebrate the Army's 250th-birthday week … ",
    "url": "https://www.military.com/daily-news/2025/06/11/bragg-soldiers-who-cheered-trumps-political-attacks-while-uniform-were-checked-allegiance-appearance.html"
  },
  {
    "text": "Guard Soldiers Deployed in Trump's LA Crackdown Aren't Getting Paid Yet  —  The 4,000 California National Guard soldiers who President Donald Trump surged into Los Angeles remain unpaid due to delays in issuing official activation orders, leaving compensation and benefits in limbo.",
    "url": "https://www.military.com/daily-news/2025/06/11/guard-soldiers-deployed-trumps-la-crackdown-arent-getting-paid-yet.html"
  },
  {
    "text": "National Guard troops have temporarily detained civilians in LA protests, commander says  —  National Guard troops already have temporarily detained civilians in the Los Angeles protests over immigration raids, the commander in charge said Wednesday, but they quickly turned them over to law enforcement.",
    "url": "https://apnews.com/article/national-guard-immigration-raids-los-angeles-c9957a0d4ded48e40ce78efb0b7a8fbf"
  },
  {
    "text": "David Hogg to Exit D.N.C. After Backlash to His Primary Plan  —  Mr. Hogg said he would not run again for vice chair after the party voted for a new election.  Democrats have been furious at his plan to challenge the party's sitting lawmakers in primary races.",
    "url": "https://www.nytimes.com/2025/06/11/us/politics/david-hogg-dnc-democrats.html"
  },
  {
    "text": "DNC will redo party elections for David Hogg and Malcolm Kenyatta's posts after procedural error  —  The DNC determined it failed to follow internal rules in its February officer election.  Separately, Hogg's plans to back primaries against incumbent Democrats stirred controversy.",
    "url": "https://www.nbcnews.com/politics/elections/david-hogg-dnc-vice-chair-vote-malcolm-kenyatta-rcna212023"
  },
  {
    "text": "Hogg declines to run again for DNC vice chair after new election is called  —  The 25-year-old activist said he will devote his efforts to Leaders We Deserve.  —  David Hogg will not run again for his Democratic National Committee vice chairman position, he announced on Tuesday … ",
    "url": "https://www.politico.com/news/2025/06/11/hogg-vote-new-election-dnc-00401673"
  },
  {
    "text": "Israel is poised to launch operation on Iran, sources say  —  U.S. officials have been told Israel is fully ready to launch an operation into Iran, multiple sources told CBS News.  —  The U.S. anticipates Iran could retaliate on certain American sites in neighboring Iraq.",
    "url": "https://www.cbsnews.com/news/israel-is-poised-to-launch-operation-on-iran-sources-say/"
  },
  {
    "text": "U.S. evacuating personnel from the Middle East amid growing tensions with Iran  —  The U.S. is evacuating nonessential staff from the embassy in Baghdad and families members of military personnel from several bases in the Gulf amid growing concerns about the security situation, according to two State Department and Pentagon officials.",
    "url": "https://www.axios.com/2025/06/11/middle-east-evacuating-baghdad-iran"
  },
  {
    "text": "Fulbright board resigns over alleged Trump administration interference  —  The 12-person board that oversees the Fulbright Program accused the White House of denying a “substantial” number of scholarship recipients.  —  The entire 12-person board tasked with overseeing the State Department's … ",
    "url": "https://www.washingtonpost.com/nation/2025/06/11/fulbright-board-scholarships-trump-administration/"
  },
  {
    "text": "Majority Of Voters Oppose GOP Budget Bill, With Just 67% Of Republicans In Support, Quinnipiac University National Poll Finds; Trump Job Approval: 38%, His Handling Of Russia - Ukraine War Lowest Among List Of Issues  — mail_outline  —  As the Senate debates the GOP tax … ",
    "url": "https://poll.qu.edu/poll-release?releaseid=3924"
  },
  {
    "text": "Brian Wilson, Beach Boys visionary leader and summer's poet laureate, dies at 82  —  Brian Wilson, the Beach Boys' visionary and fragile leader whose genius for melody, arrangements and wide-eyed self-expression inspired “Good Vibrations,” “California Girls” and other summertime anthems … ",
    "url": "https://apnews.com/article/brian-wilson-dies-beach-boys-2272762e46c46820a7af09ffc73cb9a6"
  },
  {
    "text": "Hegseth says troops in LA are lawful.  He just can't explain why.  —  The Pentagon chief stumbled when pressed on the legal underpinning for the deployment of 700 Marines to California.  —  Defense Secretary Pete Hegseth on Wednesday insisted the Pentagon's deployment of troops to Los Angeles was lawful.",
    "url": "https://www.politico.com/news/2025/06/11/hegseth-hearing-stumble-los-angeles-00400436"
  },
  {
    "text": "RFK Jr. includes vaccine misinformation spreaders among newly announced ACIP members  —  Health Secretary Robert F. Kennedy Jr. on Wednesday announced the new members of a key vaccine advisory committee, just days after he fired all sitting members in what he called “a clean sweep.”",
    "url": "https://thehill.com/policy/healthcare/5345259-rfk-jr-includes-vaccine-misinformation-spreaders-among-newly-announced-acip-members/"
  },
  {
    "text": "Mamdani surges in new poll, leading Cuomo for first time in New York mayor's race  —  The former governor has topped every voter survey since entering the race, but the democratic socialist is gaining on him.  —  NEW YORK — Zohran Mamdani, the young democratic socialist who has been rising … ",
    "url": "https://www.politico.com/news/2025/06/11/zohran-mamdani-climbs-to-top-of-poll-leading-andrew-cuomo-00401594"
  },
  {
    "text": "Kosovo will accept up to 50 deported migrants from America.  —  Here's the latest  — Musk's regrets: Elon Musk phoned President Trump before publicly expressing regret for attacks that he said “went too far” during a public feud between the men last week, according to people familiar with the matter.",
    "url": "https://www.nytimes.com/live/2025/06/11/us/trump-news"
  },
  {
    "text": "New China Trade ‘Deal’ Takes U.S. Back to Where It Started  —  If a handshake agreement holds, it would merely undo some of the damage from the trade war that President Trump started.  —  After two days of tense negotiations, the United States and China appear to have walked back from the brink … ",
    "url": "https://www.nytimes.com/2025/06/11/us/politics/us-china-trade-deal-trump.html"
  },
  {
    "text": "Where are the people the Trump administration has deported?  —  In its first 150 days, the second Trump administration has used immigration authorities to aggressively deport people — including by sending them to foreign prisons and to countries where they had no prior connection.",
    "url": "https://www.lawdork.com/p/where-are-the-people-the-trump-administration"
  },
  {
    "text": "Trump's EPA announces major rollbacks to power plant pollution limits  —  More than 200 health experts say regulatory proposals will lead to biggest increase in pollution in decades  —  US power plants will be allowed to pollute nearby communities and the wider world with more unhealthy air toxins … ",
    "url": "https://www.theguardian.com/us-news/2025/jun/11/trump-administration-epa-pollution"
  },
  {
    "text": "Naval Academy history chair resigns over ordered removal of symposium paper  —  The chair of the Naval Academy History Department resigned after reportedly being ordered by the academy's superintendent to remove a previously approved paper from the list of those to be presented at an upcoming symposium.",
    "url": "https://www.baltimoresun.com/2025/06/11/naval-academy-history-chair-resigns-over-ordered-removal-of-symposium-paper/?lctg=052714A1241CB574C4A51502A1"
  },
  {
    "text": "GOP Senators Freak Out When Asked About Trump's Military Parade Costing $45 Million  —  Some ducked into elevators.  Some stared into space.  “I answered the question I wanted to answer!”  Sen. Todd Young (R-Ind.) snapped.  —  WASHINGTON - They snapped.  They stared off into space.",
    "url": "https://www.huffpost.com/entry/gop-senators-trump-military-parade-cost_n_6849b95de4b0cf5f0c9ad0ab"
  },
  {
    "text": "Head of FEMA's storm response center leaving agency amid leadership exodus  —  The head of FEMA's National Response Coordination Center — a position responsible for the government's response to storms — submitted his resignation letter Wednesday and will formally depart the agency in two weeks.",
    "url": "https://www.cbsnews.com/news/jeremy-greenberg-fema-national-response-coordination-center-resigns/"
  },
  {
    "text": "Judge Opens Door to Releasing Mahmoud Khalil as Soon as This Week  —  Mr. Khalil, a legal permanent resident, has been held in Louisiana for more than three months.  The judge suggested he could be released as early as Friday unless the government successfully appeals.",
    "url": "https://www.nytimes.com/2025/06/11/nyregion/mahmoud-khalil-release-order.html"
  },
  {
    "text": "Leavitt Storms Out of Press Briefing Over Free Speech Grilling  —  OUTTA HERE!  —  Trump has long claimed to be a defender of the First Amendment.  —  White House Press Secretary Karoline Leavitt abruptly ended a news conference after facing tough questions over free speech.",
    "url": "https://www.thedailybeast.com/leavitt-storms-out-of-press-briefing-over-free-speech-grilling/"
  },
  {
    "text": "Dozens Of Journalists Targeted, Shot, Detained While Covering LA Protests, Press Org Says  —  “I never thought for one moment that I'd actually have to be fearful of law enforcement during a public protest,” said one photojournalist hospitalized after getting shot in the leg.",
    "url": "https://www.huffpost.com/entry/journalists-shot-detained-covering-la-immigration-protests_n_68482fd5e4b0c1bc4e818847"
  },
  {
    "text": "CDC backtracks on layoffs, rehires more than 400 people  —  Around half of those employees are in the National Center for HIV, Viral Hepatitis, STD, and Tuberculosis Prevention.  —  The Centers for Disease Control and Prevention is reinstating more than 400 people who had received layoff notices … ",
    "url": "https://www.politico.com/news/2025/06/11/cdc-backtracks-on-layoffs-rehires-more-than-400-people-00400404"
  },
  {
    "text": "ICE agents ram car to take man into custody in Boyle Heights  —  Federal agents arrested a man in Boyle Heights after a crash.  The chaotic scene was captured by surveillance video.  —  BOYLE HEIGHTS, Calif. (KABC) — A Wednesday morning crash in Boyle Heights was being investigated … ",
    "url": "https://abc7.com/post/federal-agents-involved-boyle-heights-crash-accused-hit-run-lapd-investigating/16724558/"
  },
  {
    "text": "‘Embarrassing’: Trump ‘booed mercilessly’ by Kennedy Center at ‘Les Miserables’ opening  —  Just before the Kennedy Center's opening night performance of the musical “Les Miserables,” President Donald Trump and First Lady Melania Trump stood to be recognized.  They were met with a loud chorus of boos.",
    "url": "https://www.alternet.org/trump-booed-mercilessly/"
  }
]