[
  {
    "text": "Jim Jordan to force floor vote for House speaker on Tuesday after consolidating Republican support - as it happened  —  This live blog has now closed.  Read our latest US politics stories here:  —  Key events  —  Closing summary  —  Biden and Harris condemn murder of six-year-old Palestinian in Illinois",
    "url": "https://www.theguardian.com/us-news/live/2023/oct/16/trump-gag-order-jan-6-trial-biden-israel-politics-live-updates"
  },
  {
    "text": "Trump placed under limited gag order in federal election case in D.C.  —  No ‘carte blanche’ for a candidate who is also a defendant, the judge said at a hearing  —  A federal judge issued a limited gag order Monday against Donald Trump, saying the former president must stop disparaging prosecutors … ",
    "url": "https://www.washingtonpost.com/national-security/2023/10/16/trump-gag-order-chutkan/"
  },
  {
    "text": "Live updates Judge to hear argument over Trump gag order in Jan. 6 case  —  Special counsel Jack Smith's office is in federal court in D.C. today asking for a gag order that would bar former president Donald Trump from maligning the judge, prosecutors, witnesses and potential jurors in his election obstruction case.",
    "url": "https://www.washingtonpost.com/national-security/2023/10/16/trump-court-hearing-judge-gag-order-jan-6/"
  },
  {
    "text": "Trump faces reckoning as D.C. judge mulls gag order  —  At a court hearing Monday, a judge will consider special counsel Jack Smith's demand that Trump be formally ordered to stop attacking potential witnesses against him.  —  Can Donald Trump be gagged?  —  That's the question at the heart … ",
    "url": "https://www.politico.com/news/2023/10/16/trump-gag-order-hearing-00121626"
  },
  {
    "text": "PLAINFIELD TOWNSHIP HOMICIDE UPDATE  —  On 10/14/2023 at approximately 11:38 AM, deputies with the Will County Sheriff's Office were sent to a residence located near the 16200 block of S. Lincoln Highway in Unincorporated Plainfield Township regarding a stabbing that occurred involving a landlord and renter.",
    "url": "https://www.facebook.com/WillCountySheriff/posts/pfbid0KUUoQZaZb6KPoVG3EUy3sdoENpoyb7rk9FDV7GFJ9iZ3FUPDapMj3gMnhvrCMiRGl"
  },
  {
    "text": "More on Disastrous Biden Interview: Scott Pelley Has to Help Him Finish Sentence, Says President ‘Tired’  —  I wrote earlier about a couple of the teaser clips from the “60 Minutes” interview with Joe Biden.  —  Those were bad, but the complete interview was even worse.",
    "url": "https://redstate.com/nick-arama/2023/10/15/more-on-disastrous-biden-interview-throws-israel-under-the-bus-and-shows-he-has-no-idea-whats-going-on-n2165104"
  },
  {
    "text": "Biden campaign to launch account on Trump's Truth Social  —  'There's very little ‘truth’ happening on Truth Social, but at least now it'll be a little fun,' Biden campaign tells Fox News Digital  —  EXCLUSIVE: The Biden campaign is launching an account on former President Trump's Truth Social, Fox News Digital has learned.",
    "url": "https://www.foxnews.com/politics/biden-campaign-launch-account-trumps-truth-social"
  },
  {
    "text": "Huntsman family, longtime Penn supporters, will halt donations to ‘unrecognizable’ University  —  This story is developing and will continue to be updated.  —  1987 College graduate Jon Huntsman Jr. told Penn President Liz Magill that his family will stop donating to Penn … ",
    "url": "https://www.thedp.com/article/2023/10/penn-jon-huntsman-jr-wharton-halts-donations-magill"
  },
  {
    "text": "Rockets are fired toward Israel from the Gaza Strip, as seen from southern Israel, Monday.Credit: Leo Correa /AP  — Hamas releases first video of Israeli hostage in Gaza; family confirms  — Hamas claims to hold 200 Israeli hostages, with dozens held by other Gaza factions",
    "url": "https://www.haaretz.com/israel-news/2023-10-16/ty-article-live/israel-prepares-for-ground-invasion-biden-big-mistake-to-reoccupy-gaza/0000018b-364f-dc99-a1db-3fcf1ae10000"
  },
  {
    "text": "Marjorie Taylor Greene and the lingering belief that truth is partisan  —  Paul Hodgkins was one of the first people to plead guilty to charges stemming from the riot at the Capitol on Jan. 6, 2021.  Hodgkins made it to the floor of the Senate, where he was photographed next to the “QAnon Shaman” and others.",
    "url": "https://www.washingtonpost.com/politics/2023/10/16/greene-jan6-election/"
  },
  {
    "text": "Justice Department Seeking Stronger Prison Sentences for Proud Boys Members  —  DOJ filed notice it wants the U.S. Court of Appeals in D.C., to help impose longer sentences for Enrique Tarrio, Joseph Biggs, Zachary Rehl, Dominic Pezzola and Ethan Nordean",
    "url": "https://themessenger.com/politics/proud-boys-prison-sentences-justice-department-appeal-tarrio-biggs-jan6"
  },
  {
    "text": "Scott's super PAC cancels TV ad reservations as campaign sputters  —  The super PAC supporting Tim Scott's presidential campaign said Monday it will cancel “all of our Fall media inventory.”  —  The super PAC supporting Tim Scott's presidential bid is canceling most of its remaining TV spending … ",
    "url": "https://www.politico.com/news/2023/10/16/scott-super-pac-cancels-tv-ad-reservations-00121745"
  },
  {
    "text": "Trump Federal Election Case: Judge Imposes Limited Gag Order on Trump  —  The order pits the First Amendment rights of a presidential candidate against the responsibilities of a judge to protect witnesses and to preserve the integrity of the proceedings.",
    "url": "https://www.nytimes.com/live/2023/10/16/us/trump-gag-order-election-case-news"
  },
  {
    "text": "U.S. to ease sanctions on Venezuelan oil for freer presidential election  —  BOGOTÁ, Colombia — The Biden administration and the government of Venezuelan President Nicolás Maduro have agreed to a deal in which the U.S. would ease sanctions on Venezuela's oil industry … ",
    "url": "https://www.washingtonpost.com/world/2023/10/16/venezuela-us-sanctions-deal/"
  },
  {
    "text": "George Santos' campaign loses $16,500 in three months  —  Rep. George Santos' (R-N.Y.) campaign saw a net loss of more than $16,500 in campaign contribution between July and September, according to Federal Election Commission filings. … - At the same time, his campaign spent $42,000 … ",
    "url": "https://www.axios.com/2023/10/15/george-santos-campaign-16500-net-loss-three-months"
  },
  {
    "text": "Supreme Court allows Biden administration to continue fully enforcing ghost gun regulations  —  The Supreme Court on Monday allowed the Biden administration to continue regulating so-called ghost guns - untraceable homemade weapons - as firearms under federal law.",
    "url": "https://www.cnn.com/2023/10/16/politics/ghost-gun-regulations-enforcement-supreme-court/"
  },
  {
    "text": "Fourth Iranian Arrested Illegally Crossing US Border This Month  —  U.S. authorities on the southern border have apprehended an Iranian citizen crossing into Texas for the fourth time this month.  —  The Iranians are considered “special interest aliens” because the U.S. government designates Iran a supporter of terrorism.",
    "url": "https://freebeacon.com/latest-news/fourth-iranian-arrested-illegally-crossing-us-border-this-month/"
  },
  {
    "text": "Scoop: Oprah pitched a White House run with Mitt Romney, book reveals … - Romney tells Coppins he dismissed the idea, believing that such a campaign would inadvertently help Trump.",
    "url": "https://www.axios.com/2023/10/16/oprah-mitt-romney-trump-2020"
  },
  {
    "text": "Janet Yellen: America can certainly afford two wars, US Treasury secretary says  —  In an exclusive interview, Janet Yellen urges Republicans to appoint a new House of Representatives speaker to enable greater financial support to be agreed for both Israel and Ukraine.",
    "url": "https://news.sky.com/story/we-can-certainly-afford-two-wars-us-treasury-secretary-says-12985335"
  },
  {
    "text": "Former Navajo Nation president challenges Arizona Republican who ousted McCarthy  —  Former Navajo Nation President Jonathan Nez is challenging Republican Rep. Eli Crane for his seat in Arizona's 2nd Congressional District.  —  Nez, in his announcement on X, the website formerly known as Twitter … ",
    "url": "https://thehill.com/homenews/campaign/4258625-ex-navajo-nation-president-challenges-arizona-republican-who-ousted-mccarthy/"
  }
]