[
  {
    "text": "Jeffries: House stopgap bill ‘total defeat for the extreme MAGA Republicans’  —  House Minority Leader Hakeem Jeffries (D-N.Y.) on Saturday hailed Democratic efforts in passing a short-term bill to fund the government, calling it a “defeat” for “MAGA Republicans.”",
    "url": "https://thehill.com/homenews/house/4232181-jeffries-house-stopgap-bill-total-defeat-for-the-extreme-maga-republicans/"
  },
  {
    "text": "McCarthy, McConnell suffer setbacks over control of their caucuses  —  The House speaker and Senate minority leader faced rejection on different fronts: McCarthy forced into leaning on Democrats to keep the government open and McConnell defied by GOP senators on Ukraine  —  Congressional bureau chief",
    "url": "https://www.washingtonpost.com/politics/2023/10/01/mccarthy-mcconnell-congress-government-shutdown/"
  },
  {
    "text": "‘It is a surrender’: Why McCarthy reversed with his survival uncertain  —  After Saturday's shocking vote, the speaker all but taunted his critics to come after his gavel if they wanted to.  —  When he walked into the Capitol on Saturday, Speaker Kevin McCarthy knew exactly what he'd do to stave off … ",
    "url": "https://www.politico.com/news/2023/09/30/kevin-mccarthy-government-shutdown-deal-00119290"
  },
  {
    "text": "Kevin McCarthy avoided a government shutdown.  But the fiasco shows he's weaker than ever  —  Election 2024,California Politics  —  Kevin McCarthy's struggle to become House speaker should have been the most embarrassing moment in his political career.  The U.S. House of Representatives … ",
    "url": "https://www.latimes.com/politics/story/2023-09-30/government-shutdown-shows-kevin-mccarthy-weaker-than-ever"
  },
  {
    "text": "Vivek Ramaswamy slams House-passed stopgap measure to fund the government  —  ANAHEIM, California — Republican presidential candidate Vivek Ramaswamy criticized a just-passed stopgap measure from the House of Representatives to keep the federal government funded after he finished speaking at the California GOP convention.",
    "url": "https://www.washingtonexaminer.com/vivek-ramaswamy-slams-house-continuing-resolution-government-shutdown"
  },
  {
    "text": "Inside McCarthy's Shutdown Turnabout That Left His Speakership at Risk  —  The Republican speaker opted to keep the government open the only way he could — by partnering with Democrats — in a surprise reversal that left him as politically vulnerable as ever.",
    "url": "https://www.nytimes.com/2023/10/01/us/politics/mccarthy-shutdown-turnabout.html"
  },
  {
    "text": "It's time to end McCarthy's reign of error  —  For eight months, there were no adults working in the House Republican day-care center.  —  Day after day, the toddlers of the far right threw tantrum after tantrum.  But instead of giving the brats in his caucus a timeout … ",
    "url": "https://www.washingtonpost.com/opinions/2023/09/30/mccarthy-government-shutdown-avoided/"
  },
  {
    "text": "Fetterman: 'I'm done normalizing this dysfunction'  —  Pennsylvania Sen. John Fetterman (D) expressed his frustration with the recent state of Congress in the wake of the Senate voting to approve a continuing resolution (CR) to keep the government funded Saturday.",
    "url": "https://thehill.com/homenews/senate/4232340-fetterman-im-done-normalizing-this-dysfunction/"
  },
  {
    "text": "McCarthy compares Rep. Jamaal Bowman pulling a fire alarm to Jan. 6 rioters  —  The fire alarm, which Bowman's office suggested was unintentional, came as Democrats were trying to delay a vote after Republicans rushed to pass the stopgap measure.  —  Rep. Jamal Bowman allegedly pulls fire alarm in House building",
    "url": "https://www.nbcnews.com/politics/congress/jamaal-bowman-pulled-fire-alarm-rcna118230"
  },
  {
    "text": "Grant Shapps to ramp up support for Volodymyr Zelensky  —  UK to boost training for Ukrainian soldiers and Navy may help protect grain vessels  —  Britain will ramp up its training programme for Ukrainian soldiers under plans being discussed with military chiefs, the new Defence Secretary has disclosed.",
    "url": "https://www.telegraph.co.uk/politics/2023/09/30/grant-shapps-to-send-uk-troops-to-ukraine/"
  },
  {
    "text": "Powerful political player was under investigation in ‘bizarre’ scheme involving Taylor Swift tickets before suicide: SAO  —  JACKSONVILLE, Fla. - A powerful political player in Jacksonville who took his own life in an Atlantic Beach parking lot last year was under investigation for a … ",
    "url": "https://www.news4jax.com/news/local/2023/09/29/powerful-political-player-was-under-investigation-in-bizarre-scheme-involving-taylor-swift-tickets-before-suicide-sao/"
  },
  {
    "text": "Elon Musk crosses the border to Nazi  —  On Thursday I posted on Bluesky that it's been a quiet week for the Jews, and that turned out to be a mistake.  —  The last two weeks of Jewish high holidays went off mostly without a hitch—save for a few bomb threats—which was an incredible relief … ",
    "url": "https://thehandbasket.substack.com/p/elon-musk-crosses-the-border-to-nazi"
  },
  {
    "text": "Trump goes to trial in New York before a judge who just ruled he's a fraud  —  The $250 million civil trial starts Monday — and Trump may be there in person.  —  NEW YORK — Donald Trump is set to go to trial Monday in New York's civil lawsuit accusing him of extensive business fraud … ",
    "url": "https://www.politico.com/news/2023/10/01/trump-civil-trial-new-york-00119297"
  },
  {
    "text": "How the right's elevation of Robert F. Kennedy Jr. could now backfire  —  The American right's efforts to elevate Robert F. Kennedy Jr. were as transparent as they were cynical.  The idea, as advanced by Stephen K. Bannon and the like, was clearly to try to embarrass President Biden in the Democratic primary.",
    "url": "https://www.washingtonpost.com/politics/2023/10/01/how-rights-elevation-robert-f-kennedy-jr-could-now-backfire/"
  }
]