[
  {
    "text": "Kennedy's Lawyer Has Asked the F.D.A. to Revoke Approval of the Polio Vaccine  —  Aaron Siri, who specializes in vaccine lawsuits, has been at Robert F. Kennedy Jr.'s side reviewing candidates for top jobs at the Department of Health and Human Services.  —  The lawyer helping Robert F … ",
    "url": "https://www.nytimes.com/2024/12/13/health/aaron-siri-rfk-jr-vaccines.html?unlocked_article_code=1.hE4.9RTQ.LzniX-N7b4Jd&smid=bs-share"
  },
  {
    "text": "Trump to discuss ending childhood vaccination programs with RFK Jr.  —  U.S. President-elect Donald Trump in an interview published on Thursday said he will be talking to Robert F. Kennedy Jr., his nominee to run the Department of Health and Human Services, about ending childhood vaccination programs.",
    "url": "https://www.reuters.com/world/us/trump-discuss-ending-childhood-vaccination-programs-with-rfk-jr-2024-12-12/"
  },
  {
    "text": "When depicting the government as bad is more important than stopping polio  —  News that an ally of Robert F. Kennedy Jr. sought the revocation of the polio vaccine helps put Kennedy's broader misinformed effort into context.  —  When debates over the efficacy of vaccines emerge … ",
    "url": "https://www.washingtonpost.com/politics/2024/12/13/when-depicting-government-bad-is-more-important-than-stopping-polio/"
  },
  {
    "text": "Texas files first lawsuit against out-of-state abortion provider  —  This case sets up a legal battle between Texas' near-total abortion ban and New York's shield law that protects doctors from out-of-state prosecution.  —  Texas Attorney General Ken Paxton has filed a lawsuit accusing … ",
    "url": "https://www.texastribune.org/2024/12/13/texas-paxton-abortion-pill-mail-lawsuit/"
  },
  {
    "text": "Pelosi Hospitalized in Luxembourg After Falling  —  A person familiar with the incident said the former House speaker, 84, had tripped going down stairs at a palace.  She was taken to a hospital for treatment and evaluation.  —  Former Speaker Nancy Pelosi was hospitalized on Friday … ",
    "url": "https://www.nytimes.com/2024/12/13/us/politics/nancy-pelosi-hospitalized-luxembourg-falling.html?unlocked_article_code=1.hE4.jKTg.9wwGQwbJ_TnY&smid=bs-share"
  },
  {
    "text": "Former House Speaker Nancy Pelosi injured, hospitalized while traveling to Luxembourg  —  Pelosi, 84, was traveling overseas for Battle of the Bulge remembrances  —  Former House Speaker Nancy Pelosi suffered an injury and has been admitted to a hospital in Luxembourg, Fox News has confirmed.",
    "url": "https://www.foxnews.com/politics/former-house-speaker-nancy-pelosi-injured-hospitalized-while-traveling-luxembourg"
  },
  {
    "text": "OpenAI's Sam Altman to Donate $1 Million to Trump's Inaugural Fund  —  Mr. Altman and OpenAI have recently hired key executives who previously worked for the Clinton, Obama and Biden administrations.  —  OpenAI said on Friday that its chief executive, Sam Altman, was planning to donate $1 million … ",
    "url": "https://www.nytimes.com/2024/12/13/technology/openai-sam-altman-trump-inauguration.html"
  },
  {
    "text": "America voted for a dumpster fire — Democrats just need to let it burn itself out  —  There's a quiet but intense debate going on today in America, over how and whether the country will function over the next few years.  —  Despite Republicans having an ostensible House majority for the last two years … ",
    "url": "https://thehill.com/opinion/campaign/5037307-republicans-consequences-trump/"
  },
  {
    "text": "Exclusive: Trump transition wants to scrap crash reporting requirement opposed by Tesla  —  The Trump transition team wants the incoming administration to drop a car-crash reporting requirement opposed by Elon Musk's Tesla (TSLA.O), according to a document seen by Reuters … ",
    "url": "https://www.reuters.com/business/autos-transportation/trump-transition-recommends-scrapping-car-crash-reporting-requirement-opposed-by-2024-12-13/"
  },
  {
    "text": "Trump says GOP will push to eliminate daylight saving time  —  President-elect Trump on Friday said Republicans would push to eliminate daylight saving time, calling it “inconvenient” and “costly.”  —  “The Republican Party will use its best efforts to eliminate Daylight Saving Time … ",
    "url": "https://thehill.com/homenews/campaign/5039673-trump-gop-daylight-saving-time/"
  },
  {
    "text": "Democrats need to change their approach to Trump's second term, top Kamala Harris pollster says  —  One of the first public airings of Democrats' strategy suggests they should try something new this time around with the president-elect.  —  A pollster to Kamala Harris' presidential campaign … ",
    "url": "https://www.politico.com/news/2024/12/13/democrats-2024-election-retrospective-trump-00194273"
  },
  {
    "text": "Trump Is About to Betray His Rural Supporters  —  This article was featured in the One Story to Read Today newsletter.  Sign up for it here.  —  Donald Trump's support in rural America appears to have virtually no ceiling.  In last month's election, Trump won country communities … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/12/trump-gop-rural-supporters/680981/?gift=47TjPNd1fvywdLyCkprj-JdpdDBpfw0M3Y9jwwIzrHA&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Vance invites Daniel Penny to Army-Navy game  —  “Daniel's a good guy, and New York's mob district attorney tried to ruin his life for having a backbone,” Vance wrote in a post on X.  —  Vice-president elect JD Vance will bring Daniel Penny, a Marine veteran recently acquitted … ",
    "url": "https://www.politico.com/news/2024/12/13/daniel-penny-jd-vance-army-navy-game-00194222"
  },
  {
    "text": "Trump calls for mystery drones to be shot down  —  President-elect Trump on Friday evening called for authorities to shoot down the mysterious drones that have been seen in the skies of New Jersey and around the country.  —  He also suggested the government must know more about the mysterious sightings.",
    "url": "https://thehill.com/homenews/state-watch/5039992-trump-drones-shot-down/"
  },
  {
    "text": "Half of Americans have no confidence in Trump's Cabinet picks: Poll … - Only three in 10 Americans feel “extremely” or “very” confident that he'll choose qualified Cabinet members.  — Respondents had a similar level of confidence in his ability to manage government spending and perform … ",
    "url": "https://www.axios.com/2024/12/13/trump-confidence-cabinet-military-spending-ap-norc-survey"
  },
  {
    "text": "Gillibrand Presses Biden to Amend the Constitution to Enshrine Sex Equality  —  Senator Kirsten Gillibrand of New York is leading the charge for Democrats to persuade President Biden to adopt the Equal Rights Amendment, which would invite a Supreme Court battle.",
    "url": "https://www.nytimes.com/2024/12/13/us/politics/gillibrand-biden-equal-rights-amendment.html"
  },
  {
    "text": "'Everyone's demoralized.' Trump's climate threats rattle world's biggest science meeting  —  Researchers attending the American Geophysical Union conference worry their work could disappear when a president who rejects climate science takes office.  —  Censorship.  Funding cuts.  Layoffs.",
    "url": "https://www.politico.com/news/2024/12/13/trump-climate-threats-scientists-00194253"
  },
  {
    "text": "Survey: Most voters disapprove of RFK Jr.'s nomination after learning his views  —  Most Americans disapprove of Robert F. Kennedy Jr. potentially leading the Department of Health and Human Services once they hear about his positions and beliefs, according to a survey from Democratic-aligned groups Protect … ",
    "url": "https://thehill.com/policy/healthcare/5039407-rfk-nomination-survey-disapproval/"
  },
  {
    "text": "'I wish I didn't pull that damn fire alarm': Rep. Bowman reflects on his time in Congress, primary loss  —  “I wish I didn't pull that damn fire alarm, you know what I'm saying?”  —  A candid admission by New York Congressman Jamaal Bowman about a moment that made him the butt of jokes … ",
    "url": "https://ny1.com/nyc/all-boroughs/politics/2024/12/13/i-wish-i-didn-t-pull-that-damn-fire-alarm---rep--bowman-reflects-on-time-in-congress--primary-loss"
  },
  {
    "text": "HFC backs two-pronged reconciliation plan, urges focus on border  —  The House Freedom Caucus is throwing its weight behind a two-step, party-line policy push, with the ultra-conservative bloc calling for an initial bill to address border security that's fully paid for and a second push for tax and other policy priorities.",
    "url": "https://www.politico.com/live-updates/2024/12/13/congress/hfc-backs-two-pronged-reconciliation-plan-00194331"
  },
  {
    "text": "Six Childhood Scourges We've Forgotten About, Thanks to Vaccines  —  Most Americans, including doctors, have no memory of the devastating diseases that routinely threatened children until the 1960s.  —  Some of President-elect Donald J. Trump's picks for the government's top health posts … ",
    "url": "https://www.nytimes.com/2024/12/13/health/childhood-diseases-vaccines-preventable.html?unlocked_article_code=1.hE4.z2ry.nx-TAnNftvSw&smid=url-share"
  }
]