[
  {
    "text": "Koch Network Endorses Nikki Haley in Bid to Push GOP Past Trump  —  The support will give Ms. Haley more organizational strength in the field as she battles Gov. Ron DeSantis of Florida for the No. 2 spot in the Republican presidential race.  —  The political network founded … ",
    "url": "https://www.nytimes.com/2023/11/28/us/politics/koch-network-nikki-haley-endorsement-trump.html"
  },
  {
    "text": "Koch network endorses Nikki Haley for president as it looks to stop Trump  —  The powerful political network led by conservative billionaire Charles Koch endorsed Nikki Haley for president on Tuesday, as it looks to stop Donald Trump from being the Republican nominee.",
    "url": "https://www.washingtonpost.com/elections/2023/11/28/koch-network-haley-president/"
  },
  {
    "text": "Pence told Jan. 6 special counsel harrowing details about 2020 aftermath, warnings to Trump: Sources  —  The former VP is the top official known to have spoken with investigators.  —  In this Nov. 24, 2020 file photo President Donald Trump and Vice President Mike Pence prepare to speak … ",
    "url": "https://abcnews.go.com/US/pence-told-jan-6-special-counsel-harrowing-details/story?id=105183391"
  },
  {
    "text": "Trump's Backdoor Attempts to Delay His Trials Are Backfiring  —  The New York judge overseeing Donald Trump's hush money trial won't even consider pushing it back, especially after prosecutors accused defense lawyers of delay games. … Donald Trump's calendar is filling up—and not with campaign events.",
    "url": "https://www.thedailybeast.com/trumps-new-gambit-to-delay-his-trials-isnt-quite-working"
  },
  {
    "text": "Georgia prosecutors oppose plea deals for Trump, Meadows and Giuliani  —  Exclusive: sources say Fulton county prosecutors unwilling to offer deals to key trio, preferring instead to force them to trial  —  Fulton county prosecutors do not intend to offer plea deals to Donald Trump and at least … ",
    "url": "https://www.theguardian.com/us-news/2023/nov/28/trump-trial-georgia-no-plea-deal"
  },
  {
    "text": "Republicans Demand White House Withdraw Nomination of Hunter Biden Crony  —  Senate Republicans this week called on the White House to withdraw its nomination of Hunter Biden's former law associate to serve as head of the office that handles federal whistleblower complaints.",
    "url": "https://freebeacon.com/biden-administration/republicans-demand-white-house-withdraw-nomination-of-hunter-biden-crony/"
  },
  {
    "text": "Republicans must meet the moment  —  It's been almost three years since Democrats retook the White House, and the nation is watching in disbelief as the country they once knew is no longer secure — economically, culturally, or militarily.  —  Reckless spending and leftist regulations … ",
    "url": "https://www.washingtonexaminer.com/opinion/republicans-must-meet-the-moment"
  },
  {
    "text": "Elon Musk boosts Pizzagate conspiracy theory that led to D.C. gunfire  —  The far-right theory motivated a gunman to fire multiple rounds inside the Comet Ping Pong pizzeria in Northwest Washington in 2016.  Musk boosted the theory to his 164 million followers anyway.",
    "url": "https://www.washingtonpost.com/technology/2023/11/28/pizzagate-musk-twitter-x-controversy/"
  },
  {
    "text": "Elon Musk deletes ‘Pizzagate’ meme following widespread backlash  —  Billionaire Elon Musk on Tuesday took down a post from his account on X, the platform formerly known as Twitter, that embraced a years-old false conspiracy theory about child sex trafficking after the tech and media mogul received widespread backlash and mockery.",
    "url": "https://thehill.com/policy/technology/4331790-elon-musk-deletes-pizzagate-meme/"
  },
  {
    "text": "Fox News founder Rupert Murdoch deposed in Smartmatic election lawsuit  — Rupert Murdoch is being deposed in the $2.7 billion Smartmatic defamation lawsuit against Fox Corp. over allegedly damaging election lies, a source familiar with the matter told CNBC.",
    "url": "https://www.cnbc.com/2023/11/28/fox-news-founder-rupert-murdoch-deposed-in-smartmatic-election-lawsuit.html"
  },
  {
    "text": "Major news outlets gave much less coverage to Trump's “vermin” attack then they did Clinton's “deplorables” remark  —  Huge disparities mark coverage in national broadcast, cable, and print outlets  —  RESEARCH CONTRIBUTIONS FROM ROB SAVILLO, HARRISON RAY, PETE TSIPIS & TORRI LONERGAN",
    "url": "https://www.mediamatters.org/donald-trump/major-news-outlets-gave-much-less-coverage-trumps-vermin-attack-then-they-did-clintons"
  },
  {
    "text": "Ukrainian spy chief's wife poisoned, media reports say  —  The wife of Ukraine's military spy chief has been poisoned with heavy metals and is undergoing treatment in a hospital, a spokesperson for the agency said on Tuesday.  —  Marianna Budanova is the wife of Kyrylo Budanov … ",
    "url": "https://www.reuters.com/world/europe/ukrainian-spy-chiefs-wife-poisoned-media-reports-say-2023-11-28/"
  },
  {
    "text": "Robert De Niro Claims Trump Remarks Were Slashed at Awards Night  —  Whoops and cheers arose as the two-time Oscar winner read his full speech off his phone after he alleged parts of it had been cut from a teleprompter.  —  Robert De Niro appeared to call Apple out in front of an audience … ",
    "url": "https://www.thedailybeast.com/robert-de-niro-claims-trump-remarks-were-slashed-at-awards-night"
  },
  {
    "text": "CIA director pushes big hostage deal in secret meeting with Mossad chief  —  The meeting in Qatar comes as William Burns takes on a central role navigating the crisis for President Biden  —  CIA Director William J. Burns arrived in Qatar on Tuesday for secret meetings with Israel's spy chief … ",
    "url": "https://www.washingtonpost.com/national-security/2023/11/28/cia-william-burns-israel-hamas-hostages/"
  },
  {
    "text": "Jimmy Carter attends memorial to honor Rosalynn Carter  —  A dozen political leaders, including the Bidens, were are the tribute service.  —  LIVE  —  An Armed Forces body bearer team carries the casket of former first lady Rosalynn Carter from the Jimmy Carter Presidential Library and Museum, Nov. 28, 2023, in Atlanta.",
    "url": "https://abcnews.go.com/Politics/bidens-former-ladies-honor-rosalynn-carter/story?id=105206346"
  },
  {
    "text": "Scoop: Jewish Democrats rebuke GOP bill to expel Palestinians … - The GOP bill, introduced earlier this month by Rep. Ryan Zinke (R-Mont.) with 10 Republican co-sponsors, would ban or revoke visas, refugee status and asylum for Palestinian Authority passport holders dating back to Oct 1, shortly before the Hamas attack on Israel.",
    "url": "https://www.axios.com/2023/11/28/jewish-democrats-zinke-bill-expel-palestinians"
  },
  {
    "text": "The NFL needs to speak out against the Kansas City Chiefs fan in Black face, Native headdress  —  They're doubling up on the racism.  Are you going to say anything, Roger Goodell?  —  It takes a lot to disrespect two groups of people at once.  But on Sunday afternoon in Las Vegas … ",
    "url": "https://deadspin.com/roger-goodell-kansas-city-chiefs-fan-black-face-native-1851048905"
  },
  {
    "text": "California pushing to formalize role of subnational governments at global climate talks  —  California delegates to this week's global climate summit are hoping to cement a more prominent position for subnational governments in future negotiations, state officials told reporters on Tuesday.",
    "url": "https://thehill.com/policy/equilibrium-sustainability/4331555-california-un-climate-conference-cop28-subnational-governments-formalize-role/"
  },
  {
    "text": "Presidential debates may not happen in 2024.  Here's how we can save this valuable tradition  —  The Commission on Presidential Debates announced the forthcoming slate of debate sites for presidential election season 2024.  Since 1976, there have been consistent televised presidential debates in the United States.",
    "url": "https://thehill.com/opinion/congress-blog/4330350-presidential-debates-may-not-happen-in-2024-heres-how-we-can-save-this-valuable-tradition/"
  },
  {
    "text": "Sean ‘Diddy’ Combs temporarily steps aside as the chairman of Revolt  —  Combs made the decision to step aside from the media network last week, a spokesperson said.  —  Sean “Diddy” Combs has temporarily stepped aside as the chairman of Revolt, a spokesperson for the music mogul said.",
    "url": "https://www.nbcnews.com/news/us-news/sean-diddy-combs-temporarily-steps-chairman-revolt-rcna127013"
  },
  {
    "text": "Exclusive: Biden emails 800k student loan borrowers about forgiven debt  —  More than 800,000 student loan borrowers are set to receive a message from President Biden Tuesday afternoon. … - “I've heard from countless people who have told me that relieving the burden of student loan debt … ",
    "url": "https://www.axios.com/2023/11/28/biden-student-loan-relief-email"
  },
  {
    "text": "A rural post office was told to prioritize Amazon packages.  Chaos ensued.  —  BEMIDJI, Minn. — When Delbert Mikelson's mail started showing up late — and sometimes not showing up at all — he blamed it on the opening of deer season.  —  “I thought my carrier was out hunting,” … ",
    "url": "https://www.washingtonpost.com/technology/2023/11/28/amazon-missed-mail-rural-towns/"
  }
]