[
  {
    "text": "How Trump was talked into — and out of — a run for speaker  —  A behind-the-scenes campaign coaxed the former president out of a quixotic campaign.  —  Just hours after Kevin McCarthy was deposed as House speaker, the “draft Trump” movement began.  —  “I called him and I said, 'Sir … ",
    "url": "https://www.politico.com/news/2023/10/06/trump-jim-jordan-house-speaker-endorsements-00120320"
  },
  {
    "text": "Trump Drops Lawsuit Against Judge Who Doomed His Company  —  The former president's attempt to throw a wrench in the New York AG's case against him by suing Justice Arthur F. Engoron was a failure.  —  A week into his bank fraud trial, Donald Trump late Thursday night dropped … ",
    "url": "https://www.thedailybeast.com/trump-drops-lawsuit-against-judge-arthur-f-engoron-who-doomed-his-company"
  },
  {
    "text": "Inside Trump's earlier secret bid for House speaker as McCarthy nomination drama unfolded  —  From ABC News Chief Washington Correspondent Jonathan Karl's upcoming book.  —  Former U.S. President Donald Trump arrives to deliver remarks at the South Carolina State House, Jan. 28, 2023 in Columbia, SC.",
    "url": "https://abcnews.go.com/Politics/inside-trumps-earlier-secret-bid-house-speaker-mccarthy/story?id=103779066"
  },
  {
    "text": "How a Texas Congressman ‘Totally F—d’ Trump's House Speaker Race Strategy (Exclusive)  —  According to one adviser, the former president is ‘pissed’ at Rep. Troy Nehls  —  A Facebook icon representing an external link to share the article on Facebook.A Twitter icon representing an external link … ",
    "url": "https://themessenger.com/politics/donald-trump-house-speaker-race-troy-nehls"
  },
  {
    "text": "Trump seeks pause in New York fraud trial  —  Attorneys for former President Trump are seeking to temporarily pause his civil fraud trial, along with the enforcement of a ruling issued before the trial started finding Trump and his business liable for fraud, until after the case has been appealed.",
    "url": "https://thehill.com/regulation/court-battles/4242026-trump-seeks-pause-in-new-york-fraud-trial/"
  },
  {
    "text": "Many GOP anti-Trumpers are throwing in the towel … They've concluded that the GOP's base can't quit Trump. … - Republican Accountability PAC — a group of former Trump voters dedicated to moving beyond the former president — is giving up on the primary after spending $1 million on ads in Iowa.",
    "url": "https://www.axios.com/2023/10/06/gop-anti-trump-fading-away-2024"
  },
  {
    "text": "Trump Escalates Anti-Immigrant Rhetoric With ‘Poisoning the Blood’ Comment  —  When asked about immigration in a recent interview, the former president used language with echoes of white supremacy and Hitler.  —  Former President Donald J. Trump said undocumented immigrants were … ",
    "url": "https://www.nytimes.com/2023/10/05/us/politics/trump-immigration-rhetoric.html"
  },
  {
    "text": "‘What Is Broken in American Politics Is the Republican Party’  —  Fourteen experts on the roots of Kevin McCarthy's ouster and what's broken in American politics  —  “McCarthy chose to accept his fate” “Trump acted as a lightning rod” “The culture of democracy is robust” “A project at war with the Constitution”",
    "url": "https://www.politico.com/news/magazine/2023/10/06/republican-leaders-mccarthy-expert-roundup-00120170"
  },
  {
    "text": "America needs to talk about the right's ‘Red Caesar’ plan for U.S. dictatorship  —  The incredible scenes this week on Capitol Hill — leaving the U.S. House without a speaker and promising an autumn of sheer chaos in Congress — marked a rapid escalation of the downward spiral of American democracy.",
    "url": "https://www.inquirer.com/opinion/red-caesar-right-american-dictatorship-20231005.html"
  },
  {
    "text": "How a previously obscure House rule could decide the next speaker  —  Any one Republican still has the power to eject the House leader.  It's a problem that only some in the GOP want to solve.  —  Anyone who hopes to become the next speaker must first attempt to settle a raging debate inside … ",
    "url": "https://www.politico.com/news/2023/10/06/next-house-speaker-reform-mccarthy-00120178"
  },
  {
    "text": "During an online fundraiser, Matt Gaetz denounced the Biden impeachment effort as unserious  —  As the House tries to replace Kevin McCarthy, the future of the impeachment inquiry could become a bargaining chip in the wrangling to win the speakership.  —  WASHINGTON — Days before Rep. Matt Gaetz led … ",
    "url": "https://www.nbcnews.com/politics/congress/gaetz-biden-impeachment-rosendale-rcna119131"
  },
  {
    "text": "Payrolls soared by 336,000 in September, defying expectations for a hiring slowdown  — Nonfarm payrolls increased by 336,000 for the month, better than the Dow Jones consensus estimate for 170,000.  — Average hourly earnings rose 0.2% for the month and 4.2% from a year ago, compared to respective estimates for 0.3% and 4.3%.",
    "url": "https://www.cnbc.com/2023/10/06/jobs-report-september-2023.html"
  },
  {
    "text": "Iowa police dispute Ramaswamy campaign's claim that protesters rammed their car  —  “Our investigation has revealed no evidence to substantiate” the claim that protesters hit Ramaswamy's car on purpose and fled, police said.  —  Republican presidential candidate Vivek Ramaswamy's campaign claimed Thursday … ",
    "url": "https://www.politico.com/news/2023/10/06/vivek-ramaswamy-iowa-car-00120318"
  },
  {
    "text": "N.J. Attorney General Opens Inquiry Into Nadine Menendez's Fatal Crash  —  The scrutiny could create fresh legal and political peril for Senator Robert Menendez, a Democrat, who has been charged with accepting bribes.  —  The New Jersey attorney general's office seized records on Thursday … ",
    "url": "https://www.nytimes.com/2023/10/06/nyregion/nadine-menendez-investigation-koop.html"
  },
  {
    "text": "Running Spoiler Campaigns Does Not Protect ‘Democracy’ … Most Americans who oppose Donald Trump agree the threat to democracy is the major issue of the 2024 election.  But what, precisely, constitutes the threat?  To most Democrats, the danger is that the election will install into power … ",
    "url": "https://nymag.com/intelligencer/2023/10/running-spoiler-campaigns-does-not-protect-democracy.html"
  },
  {
    "text": "Judge rejects Georgia election subversion defendant Chesebro's bid to dismiss indictment  —  The judge presiding over the Georgia election subversion case rejected an attempt by pro-Donald Trump attorney Kenneth Chesebro to dismiss his indictment, according to a court filing on Friday.",
    "url": "https://www.cnn.com/2023/10/06/politics/ken-chesebro-fulton-county/"
  },
  {
    "text": "Iowa surrenders, will fall back to Super Tuesday for Democrats  —  Iowa Democrats say they will compete for an earlier nominating contest in future years.  —  ST. LOUIS — Iowa is surrendering.  The state will now be a Super Tuesday state for Democrats.  —  Iowa's influential perch within … ",
    "url": "https://www.politico.com/news/2023/10/06/iowa-democrats-super-tuesday-00120337"
  },
  {
    "text": "A bipartisan coalition is the way forward for the House  —  Hakeem Jeffries (N.Y.) is the Democratic leader of the House of Representatives.  —  In recent days, Democrats have tried to show our colleagues in the Republican majority a way out of the dysfunction and rancor they have allowed to engulf the House.",
    "url": "https://www.washingtonpost.com/opinions/2023/10/06/hakeem-jeffries-bipartisan-coalition-house-gop/"
  },
  {
    "text": "The Irony of Trump Whining About a Jury Trial His Lawyers Didn't Formally Request  —  How can Donald Trump complain about not getting a jury trial if his own lawyers didn't file the paperwork to ask for one?  By being Donald Trump. … When the judge overseeing Donald Trump's bank fraud trial reminded … ",
    "url": "https://www.thedailybeast.com/the-irony-of-trump-whining-about-a-jury-trial-his-lawyers-didnt-formally-request"
  },
  {
    "text": "Hillary Clinton says ‘MAGA extremists’ may need ‘formal deprogramming’  —  Former Secretary of State Hillary Clinton said “MAGA extremists” may need a “formal deprogramming” while slamming followers of former President Donald Trump.  —  Clinton, who lost to Trump in the 2016 presidential election … ",
    "url": "https://www.washingtonexaminer.com/news/campaigns/hillary-clinton-says-maga-extremists-may-need-formal-deprogramming"
  },
  {
    "text": "Trump allegedly discussed US nuclear subs with foreign national after leaving White House: Sources  —  Trump allegedly discussed the information with an Australian billionaire.  —  Months after leaving the White House, former President Donald Trump allegedly discussed potentially sensitive information … ",
    "url": "https://abcnews.go.com/US/after-white-house-trump-allegedly-discussed-potentially-sensitive/story?id=103760456"
  },
  {
    "text": "Kentucky 2023 Poll: Beshear Holds 16-Point Lead Over Cameron in Gubernatorial Election  —  Home Polls Kentucky 2023 Poll: Beshear Holds 16-Point Lead Over Cameron in Gubernatorial Election  —  A new Emerson College Polling survey of Kentucky voters finds incumbent Democratic Governor Andy Beshear … ",
    "url": "https://emersoncollegepolling.com/kentucky-2023-poll-beshear-holds-16-point-lead-over-cameron-in-gubernatorial-election/"
  }
]