[
  {
    "text": "Koch network stops spending on Nikki Haley's presidential campaign  —  Americans for Prosperity Action said it had to “take stock” after Haley's loss in South Carolina.  —  Americans For Prosperity Action, the powerful conservative group supporting Nikki Haley in the Republican presidential primary … ",
    "url": "https://www.politico.com/news/2024/02/25/koch-afp-nikki-haley-00143212"
  },
  {
    "text": "‘My ultimate and absolute revenge’: Trump gives chilling CPAC speech on presidential agenda  —  Unbound and unhinged, ex-president vilifies immigrants before devolving into bizarre riffs, including calling himself ‘total genius’  —  Donald Trump styled himself as a “proud political dissident” … ",
    "url": "https://www.theguardian.com/us-news/2024/feb/24/donald-trump-cpac-speech"
  },
  {
    "text": "Status Report: Warning Signs for Trump  —  A quick check-in on the state of affairs on the other side of the campaign aisle.  For some time now, it's been down to two people, Trump and Haley, and yesterday the GOP primary contest was in Haley's home state of South Carolina.  —  Newsflash: Trump won.",
    "url": "https://statuskuo.substack.com/p/status-report-warning-signs-for-trump"
  },
  {
    "text": "South Carolina Republicans see Trump as more electable, more fit than Haley: Preliminary exit polling  —  Sixty-two percent also falsely think Biden didn't legitimately win in 2020.  —  Voters cast their ballot at Kilbourne Park Baptist Church during the Republican presidential primary in Columbia, South Carolina, Feb. 24, 2024.",
    "url": "https://abcnews.go.com/Politics/south-carolina-republicans-trump-electable-fit-haley-preliminary/story?id=107521006"
  },
  {
    "text": "Lawmakers fail to reach deal with partial shutdown looming  —  Senate Majority Leader Chuck Schumer (D-N.Y.) on Sunday blasted Republicans over for threat of what he called “a harmful and unnecessary government shutdown” as Congress struggles to strike a bipartisan deal days out from a key funding deadline.",
    "url": "https://thehill.com/policy/energy-environment/4488498-lawmakers-fail-to-reach-deal-with-partial-shutdown-looming/"
  },
  {
    "text": "Biden is summoning congressional leaders to the White House to talk Ukraine and government funding  —  President Joe Biden will convene the top four congressional leaders at the White House on Tuesday to press lawmakers on passing an emergency aid package for Ukraine and Israel … ",
    "url": "https://apnews.com/article/biden-johnson-schumer-congress-aid-ukraine-israel-a4b886c469b3d5bff8ae7a18e5896eb1"
  },
  {
    "text": "Lawmakers fail to reach deal with partial shutdown looming  —  Congressional leaders are trading blame as both sides struggle to strike a bipartisan deal to stave off the threat of a partial government shutdown.  —  Lawmakers have until Mar. 1 to pass legislation to fund the departments of Agriculture … ",
    "url": "https://thehill.com/homenews/senate/4488498-lawmakers-fail-to-reach-deal-with-partial-shutdown-looming/"
  },
  {
    "text": "Democratic operative admits to commissioning fake Biden robocall that used AI  —  Steve Kramer acknowledged Sunday that he created the fake Joe Biden robocall at the center of a multistate investigation after NBC News reported about his involvement.  —  Steve Kramer, a veteran political consultant working … ",
    "url": "https://www.nbcnews.com/politics/2024-election/democratic-operative-admits-commissioning-fake-biden-robocall-used-ai-rcna140402?taid=65dbacde592fef00019b1579"
  },
  {
    "text": "Justice Thomas Hires Law Clerk Accused of Sending Racist Text Messages  —  Crystal Clanton, who is close with the Thomas family, has said she does not remember sending the messages, which emerged in 2017.  —  Justice Clarence Thomas recently hired a law clerk who was previously accused … ",
    "url": "https://www.nytimes.com/2024/02/24/us/crystal-clanton-clarence-thomas-clerk.html"
  },
  {
    "text": "What Is Christian Nationalism, Exactly?  —  If you're alarmed by the rise of Christian nationalism, the single worst thing you can do is define it too broadly.  If you define it too broadly, then you're telling millions of ordinary churchgoing citizens that the importation of their religious values … ",
    "url": "https://www.nytimes.com/2024/02/25/opinion/christian-nationalism.html"
  },
  {
    "text": "Fiona Hill: Trump comparison to Navalny ‘brazen’ and ‘shameful’  —  Former National Security Council adviser Fiona Hill went after former President Trump on Sunday after he compared himself to the late Russian opposition leader Alexei Navalny as a political dissident.",
    "url": "https://thehill.com/homenews/campaign/4488138-fiona-hill-trump-comparison-to-navalny-brazen-and-shameful/"
  },
  {
    "text": "Climate change is throwing the water cycle into chaos across the U.S.  —  As the planet continues to warm, this cycle is expected to be increasingly stretched, warped and broken.  —  The water cycle that shuttles Earth's most vital resource around in an unending, life-giving loop is in trouble.",
    "url": "https://www.nbcnews.com/science/science-news/climate-change-throwing-water-cycle-chaos-us-rcna137892"
  },
  {
    "text": "Newsom launches abortion ads in Republican states to fight ‘war on women’  —  Series of new advertisements target Republican efforts to criminalize abortions and a ‘war on travel’ for reproductive care  —  California's governor, Gavin Newsom, is launching a series of new advertisements … ",
    "url": "https://www.theguardian.com/world/2024/feb/25/gavin-newsom-abortion-ads-republican-states"
  },
  {
    "text": "Hobbycraft refused to sell paint to black man as ‘he may use it for graffiti’  —  Louis Gray says he was racially profiled after trying to buy spray paint to make over his son's bicycle helmet  —  A black man shopping for paint with his four-year-old son says he was racially profiled … ",
    "url": "https://www.theguardian.com/world/2024/feb/25/hobbycraft-refuse-to-sell-paint-to-black-man-as-he-may-use-it-for-graffiti"
  },
  {
    "text": "No Labels director says Nikki Haley 'somebody we'd definitely be interested in'  —  Joe Cunningham, national director for the political organization No Labels, said on Sunday that Republican presidential candidate Nikki Haley is “somebody we'd definitely be interested in” … ",
    "url": "https://thehill.com/homenews/campaign/4488229-no-labels-director-says-nikki-haley-somebody-wed-definitely-be-interested-in/"
  },
  {
    "text": "What would happen without a Leap Day?  More than you might think  —  Leap year.  It's a delight for the calendar and math nerds among us.  So how did it all begin and why?  —  Have a look at some of the numbers, history and lore behind the (not quite) every four year phenom that adds a 29th day to February.",
    "url": "https://apnews.com/article/leap-year-history-leap-day-february-calendar-c6936d284843ec2722b2eb215159efed"
  },
  {
    "text": "Ukraine war: Zelensky says 31,000 troops killed since Russia's full-scale invasion  —  Volodymyr Zelensky says 31,000 Ukrainian soldiers have been killed during Russia's full-scale invasion.  —  The Ukrainian president said he would not give the number of wounded as that would help Russian military planning.",
    "url": "https://www.bbc.com/news/world-europe-68397525"
  }
]