[
  {
    "text": "Trump ends speculation on another debate: ‘There will be no rematch’  —  The former president is turning down both invitations from Fox News and CNN.  —  Donald Trump is making it clear: He doesn't want a second debate, regardless of which network is hosting.",
    "url": "https://www.politico.com/news/2024/10/09/trump-harris-debate-no-rematch-00183179"
  },
  {
    "text": "'I don't want to be nice': Trump ramps up personal attacks on Harris at Pennsylvania rally  —  Trump's campaign event in Scranton, the birthplace of President Joe Biden, was the first of two in the battleground state Wednesday less than four weeks before Election Day.",
    "url": "https://www.nbcnews.com/politics/2024-election/trump-ramps-personal-attacks-kamala-harris-scranton-rally-rcna174292"
  },
  {
    "text": "Harris makes impromptu call into CNN, says Trump's hurricane comments ‘dangerous’  —  Vice President Harris called into CNN on Wednesday to talk about Hurricane Milton as it approaches Florida, bashing former President Trump for his comments about the federal government's response to the latest storms.",
    "url": "https://thehill.com/homenews/administration/4924499-kamala-harris-impromptu-cnn-call-hurricane-milton/"
  },
  {
    "text": "Trump rejects Fox News invite to debate Harris in late October  —  Republican former President Donald Trump said on Wednesday he will not debate Democratic Vice President Kamala Harris, hours after Fox News invited the two presidential contenders to participate in a possible second debate on either Oct. 24 or Oct. 27.",
    "url": "https://www.reuters.com/world/us/fox-news-proposes-dates-possible-second-trump-harris-debate-2024-10-09/"
  },
  {
    "text": "Meteorologists Get Death Threats as Hurricane Milton Conspiracy Theories Thrive  —  It's their job to warn residents about destructive storms — but political polarization has made them targets online  —  As Hurricane Milton approaches Florida, meteorologists are staying awake for days … ",
    "url": "https://www.rollingstone.com/culture/culture-features/hurricane-milton-misinformation-meteorlogist-death-threats-1235130352/"
  },
  {
    "text": "Swing State Poll 2024: Pennsylvania, Michigan, Wisconsin: Blue Wall Shows Cracks As Race Tightens, Quinnipiac University Poll Finds; U.S. Senate Races: Michigan Moves To Toss-Up, Dems Lead In PA & WI  —  mail_outline  —  PENNSYLVANIA: Harris 49%, Trump 46%, other candidates 2%",
    "url": "https://poll.qu.edu/poll-release?releaseid=3913"
  },
  {
    "text": "Tim Walz Rally Goes Live on World of Warcraft Twitch Stream  —  This is the latest chapter of the Kamala Harris campaign's effort to reach young male voters.  —  Kamala Harris' campaign is livestreaming a Tim Walz rally from Arizona and Azeroth tonight.  Yes, Azeroth—the planet from World of Warcraft.",
    "url": "https://www.wired.com/story/tim-walz-rally-world-of-warcraft-twitch/"
  },
  {
    "text": "Susan Rice: Trump's reported calls with Putin appear illegal  —  Former White House adviser and United Nations ambassador Susan Rice called out former President Trump over a report that he has spoken with Russian President Vladimir Putin at least seven times since leaving office, suggesting such calls would violate the Logan Act.",
    "url": "https://thehill.com/policy/international/4924145-susan-rice-trump-putin-logan-act/"
  },
  {
    "text": "“Severely compromised”: Experts warn right-wing SCOTUS justices may “seek to intervene” in election  —  “People are underestimating how messy this could get,” expert says amid growing election-related litigation  —  Supreme Court watchers increasingly worry that the 2024 election between … ",
    "url": "https://www.salon.com/2024/10/09/severely-compromised-experts-warn-right-wing-scotus-justices-may-seek-to-intervene-in/"
  },
  {
    "text": "JD Vance Owns Company That Sells American Real Estate to Foreign Investors?  —  The Ohio senator's venture capital fund invested in the app AcreTrader.  —  In early October 2024, several social media accounts supporting U.S. Vice President Kamala Harris shared a copypasta meme alleging … ",
    "url": "https://www.snopes.com/news/2024/10/08/jd-vance-acretrader/"
  },
  {
    "text": "Trump ‘Bidenomics’ ad shows a Philly-area mom who really supports Kamala Harris  —  Kimberly Burrell sat among a group of loved ones of Philadelphia's gun violence victims in July for an interview with a national television reporter.The gathering took place around the anniversary of the death … ",
    "url": "https://www.inquirer.com/opinion/donald-trump-political-ad-kimberly-burrell-20241009.html"
  },
  {
    "text": "Election Live Updates: Campaigns Swarm Sun Belt, With Early Voting Starting in Arizona  —  No candidate has ever raised so much money so fast.  And it's more than former President Donald J. Trump has announced raising in all of 2024.  —  Here's the latest on the presidential race.",
    "url": "https://www.nytimes.com/live/2024/10/09/us/harris-trump-election"
  },
  {
    "text": "Adam Schiff Perfectly Leaves Trumpy Opponent ‘Speechless’ During Debate  —  California Rep. Adam Schiff and Steve Garvey are vying for the late Diane Feinstein's Senate seat.  Garvey, a Trumper with no political experience, was left “speechless” at one point in the debate.",
    "url": "https://crooksandliars.com/2024/10/adam-schiff-perfectly-leaves-trumpy"
  },
  {
    "text": "Readout of President Joe Biden's Call with Prime Minister Netanyahu of Israel  —  President Biden spoke this morning with Prime Minister Netanyahu of Israel.  Vice President Harris joined the call.  The President affirmed his ironclad commitment to Israel's security.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/10/09/readout-of-president-joe-bidens-call-with-prime-minister-netanyahu-of-israel-9/"
  },
  {
    "text": "Harris Campaign Names Republicans Who Voted Against FEMA Funding  —  who voted against Federal Emergency Management Agency (FEMA) funding two weeks ago.  —  The vote was part of a $20 billion package on September 25.  The bill passed both the House and Senate",
    "url": "https://www.newsweek.com/kamala-harris-republicans-voting-against-fema-1965493"
  },
  {
    "text": "Dozens of Democrats join push to strong-arm Mike Johnson … - Johnson, however, said during a trip to North Carolina on Wednesday that “it will take some time” for states to calculate the extent of their financial need.  — Pointing to the stopgap spending bill the House passed last month … ",
    "url": "https://www.axios.com/2024/10/09/dozens-of-democrats-join-push-to-strong-arm-mike-johnson"
  },
  {
    "text": "Trump Pledges to End ‘Double Taxation’ of Americans Abroad  —  The idea is the latest from Republican nominee that goes beyond extending 2017 tax law  —  WASHINGTON—Republican presidential nominee Donald Trump said he supports lowering taxes on U.S. citizens who live abroad … ",
    "url": "https://www.wsj.com/politics/policy/donald-trump-tax-plan-americans-abroad-a74bfbdd"
  },
  {
    "text": "Host Laughs in Trump's Face After He Calls Himself ‘a Truthful Person’  —  ROFL  —  Podcaster Andrew Schulz broke into a fit of giggles so intense he almost slid off his seat after the former president referred to himself as “basically a truthful person.”  —  A podcast host interviewing … ",
    "url": "https://www.thedailybeast.com/host-laughs-in-trumps-face-after-he-calls-himself-basically-a-truthful-person"
  },
  {
    "text": "Democrats start to hit the panic button  —  Democrats' nerves are at an all-time high.  —  Two months ago — even a month ago — they were feeling bullish about Vice President Harris's prospects of defeating former President Trump.  —  But now, with less than a month to go until Election Day … ",
    "url": "https://thehill.com/homenews/campaign/4922690-democrats-nervous-kamala-harris-campaign/"
  },
  {
    "text": "Trump's Remarks on Migrants Illustrate His Obsession With Genes  —  In discussing migrants and genes, the former president used language that reflected his decades-long belief that bloodlines determine a person's capacity for success or violence.  —  With the presidential race in its closing weeks … ",
    "url": "https://www.nytimes.com/2024/10/09/us/politics/trump-migrants-genes.html"
  },
  {
    "text": "Tim Johnson, former Senate Banking chair, dies at 77  —  The South Dakota Democrat served on the Hill for almost three decades.  —  Former Senate Banking Chair Tim Johnson died at 77 Tuesday following complications from a stroke.  —  The South Dakota Democrat retired in 2015 … ",
    "url": "https://www.politico.com/news/2024/10/09/former-senate-banking-chair-johnson-dies-at-77-00183020"
  },
  {
    "text": "Democrats can't make Georgia governor investigate State Election Board, judge says  —  The Republican-led board recently passed changes to election rules, including an election night hand count of ballots and a rule requiring a “reasonable inquiry”  —  A Fulton County judge dismissed … ",
    "url": "https://www.ajc.com/politics/ethics-case-against-georgia-election-board-dismissed-by-fulton-judge/RKUMJ4DLGFEVBFRD3ZYN3YYUFQ/"
  },
  {
    "text": "Russia has suffered more than 600K casualties in Ukraine, US official says  —  Russia has suffered more than 600,000 casualties in the war with Ukraine, a senior U.S. defense official said Wednesday.  —  The number of Russian dead or wounded is significantly higher than the last official update … ",
    "url": "https://thehill.com/policy/defense/4924544-russia-casualties-ukraine-us-official/"
  }
]