[
  {
    "text": "Hope Hicks gets teary testifying at Trump's hush money trial  —  After a week of tabloid-focused testimony, the former aide led the jury through the whirlwind of the 2016 campaign and directly to the Oval Office.  —  NEW YORK — Hope Hicks, a former top aide to Donald Trump … ",
    "url": "https://www.washingtonpost.com/politics/2024/05/03/trump-hush-money-trial-hope-hicks-testimony/"
  },
  {
    "text": "“More credible”: Legal experts say Hope Hicks' testimony “ties everything more closely to Trump”  —  “The DA's office is going to argue that all of these puzzle pieces add up to a crime,” law professor says  —  Former Trump campaign press secretary and White House communications director Hope Hicks testified … ",
    "url": "https://www.salon.com/2024/05/03/more-credible-legal-experts-say-hope-hicks-testimony-ties-everything-more-closely-to-trump/"
  },
  {
    "text": "U.S. Congressman Henry Cuellar and His Wife Charged with Bribery, Unlawful Foreign Influence, and Money Laundering Schemes  —  For Immediate Release  —  Congressman Allegedly Accepted $600,000 in Bribes from Two Foreign Entities in Exchange for Official Acts as a Member of Congress",
    "url": "https://www.justice.gov/opa/pr/us-congressman-henry-cuellar-and-his-wife-charged-bribery-unlawful-foreign-influence-and"
  },
  {
    "text": "Japan disappointed by Biden's “xenophobic” comments  —  Japan has told the United States that President Joe Biden's recent remarks describing the Asian nation as “xenophobic” were disappointing, a source close to the matter said Friday.  —  The Japanese government told the U.S. side that Biden's comments … ",
    "url": "https://english.kyodonews.net/news/2024/05/14d6da84e84d-japan-disappointed-by-bidens-xenophobic-comments.html"
  },
  {
    "text": "Republican Firebrand Ted Cruz Now Courts Democrats to Win Re-Election  —  Texas senator faces competitive contest against Colin Allred this fall  —  CYPRESS, Texas—There are two sides to Ted Cruz, the Republican senator says.  —  The self-described conservative warrior has opposed most big compromise legislation.",
    "url": "https://www.wsj.com/politics/elections/ted-cruz-texas-senate-election-strategy-313d0be3"
  },
  {
    "text": "Democrats bracing for massive protests at party's August convention  —  As demonstrations over Gaza erupt at campuses across the country, Biden team faces prospect of chaotic scenes in Chicago.  —  As protests over the Israel-Gaza war sweep college campuses, pro-Palestinian activists … ",
    "url": "https://www.washingtonpost.com/politics/2024/05/04/democratic-convention-protests-gaza/"
  },
  {
    "text": "Statement From Attorney General Ken Paxton After Austin City Council Threatens Noncompliance with Texas Law Prohibiting “Gender Transition” Treatments For Children  —  Texas Attorney General Ken Paxton issued the following statement reminding the City of Austin of the obligations Texas municipalities … ",
    "url": "https://www.texasattorneygeneral.gov/news/releases/statement-attorney-general-ken-paxton-after-austin-city-council-threatens-noncompliance-texas-law"
  },
  {
    "text": "Biden faces new Democratic pressure to rein in Israel … - Among the assurances is that the country will “facilitate and not arbitrarily deny, restrict, or otherwise impede” aid into Gaza, or else U.S. weapons transfers would be halted. … - They pointed to allegations … ",
    "url": "https://www.axios.com/2024/05/03/biden-house-democrats-israel-gaza"
  },
  {
    "text": "Mark Meadows unmasked in Arizona fake electors indictment, faces 9 felony charges: Report  —  Charges have formally been made public against Mark Meadows, the onetime chief of staff to former President Donald Trump, in the expansive fake electors case now underway in Arizona.",
    "url": "https://lawandcrime.com/high-profile/mark-meadows-unmasked-in-arizona-fake-electors-indictment-faces-9-felony-charges-report/"
  },
  {
    "text": "Biden's allies move to sink RFK Jr.  —  The effort reflects a level of concern among Democrats about Kennedy — but also an opportunity they see to wound Donald Trump.  —  The coalition of Democratic groups that pressured No Labels out of the 2024 contest is now turning its sights on Robert F. Kennedy Jr.",
    "url": "https://www.politico.com/news/2024/05/03/bidens-allies-move-to-sink-rfk-jr-00156113"
  },
  {
    "text": "Legal challenge to Amazon UK's new “one-click to quit the union” tool  —  Following the news that Amazon warehouse workers in Coventry will soon get to vote on Trade Union recognition, Foxglove is supporting five workers at the Amazon UK Coventry warehouse to launch a legal challenge of Amazon's latest union-busting tactic.",
    "url": "https://www.foxglove.org.uk/2024/05/02/legal-challenge-to-amazon-uks-new-one-click-to-quit-the-union-tool/"
  },
  {
    "text": "Trump Media's accountant is charged with “massive fraud” by the SEC  —  BF Borgers, the independent accounting firm for Trump Media & Technology Group, is facing allegations of “massive fraud” from the Securities and Exchange Commission, which on Friday claimed the auditor ran a “sham audit mill” that put investors at risk.",
    "url": "https://www.cbsnews.com/news/trump-media-accountant-borgers-charged-with-massive-fraud-sec/"
  },
  {
    "text": "US diplomat who quit over Biden administration's Gaza policy speaks out  —  Hala Rharrit never expected that she would choose to leave her career as a US diplomat.  —  She had spent her “entire adult life” at the State Department having joined the foreign service in 2006 … ",
    "url": "https://www.cnn.com/2024/05/03/politics/hala-rharrit-us-diplomat-biden-gaza/"
  },
  {
    "text": "Louisiana governor fires back at Mick Jagger jab: ‘Might remember the Stone Age’  —  Gov. Jeff Landry (R-LA) hit back at Rolling Stones singer Mick Jagger after the rock star threw a jab at him.  —  At a Thursday night concert, Jagger, 80, made a quip that Landry wanted to return the world to the Stone Age … ",
    "url": "https://www.washingtonexaminer.com/news/2991070/louisiana-governor-mick-jagger-jab-stone-age/"
  },
  {
    "text": "Liberals Must Resist the New McCarthyism Over Israel Criticism  —  The hysteria over Palestine protests on campus that is being ginned up to protect US support for Israel's war is the beginning of a new Red Scare.  Liberals must resist it, because it will come for them, too.",
    "url": "https://jacobin.com/2024/05/israel-campus-protest-antisemitism-mccarthyism/"
  },
  {
    "text": "Missouri abortion rights group collects enough signatures to advance ballot measure  —  An amendment to enshrine abortion rights in the Missouri constitution is now one step closer to appearing before voters this year.  —  A proposed amendment to enshrine abortion access in Missouri's constitution cleared … ",
    "url": "https://www.nbcnews.com/politics/2024-election/missouri-abortion-rights-ballot-measure-rcna150448"
  },
  {
    "text": "Prosecutors: Docs in boxes seized from Mar-a-Lago were inadvertently jumbled  —  Special counsel Jack Smith's team acknowledged mischaracterizing the issue at a recent hearing in the Trump classified documents case, but said the reordering was not significant.",
    "url": "https://www.politico.com/news/2024/05/03/mar-a-lago-trump-classified-documents-00156124"
  }
]