[
  {
    "text": "As Musk endorses antisemitic conspiracy theory, X has been placing ads for Apple, Bravo, IBM, Oracle, and Xfinity next to pro-Nazi content  —  CEO Linda Yaccarino previously claimed that brands are “protected from the risk of being next to” toxic posts  —  Update (11/16/23) … ",
    "url": "https://www.mediamatters.org/twitter/musk-endorses-antisemitic-conspiracy-theory-x-has-been-placing-ads-apple-bravo-ibm-oracle"
  },
  {
    "text": "IBM Immediately Suspends Advertising From X/Twitter After Discovering Its Ads Appeared Next to Pro-Nazi Content … “IBM has zero tolerance for hate speech and discrimination and we have immediately suspended all advertising on X while we investigate this entirely unacceptable situation,” a company rep said in a statement to Variety.",
    "url": "https://variety.com/2023/digital/news/ibm-pulls-advertising-x-twitter-pro-nazi-content-1235793261/"
  },
  {
    "text": "Santos calls Ethics Committee report a ‘dirty biased act’ that ‘tramples over all of my rights’  —  Rep. George Santos (R-N.Y.) took to social media Thursday evening after the House Ethics Committee released a scathing report about his potential federal crimes, calling politics and the report  “dirty.”",
    "url": "https://thehill.com/homenews/house/4314525-santos-ethics-committee-report-dirty-biased-act-tramples-rights/"
  },
  {
    "text": "Santos ethics report finds ‘substantial evidence’ of criminal wrongdoing  —  The report doesn't recommend expulsion, but a vote to oust the New York Republican is likely regardless.  —  A bipartisan ethics report concludes there is “substantial evidence” that George Santos violated federal criminal laws … ",
    "url": "https://www.politico.com/news/2023/11/16/santos-ethics-reports-finds-substantial-evidence-of-criminal-wrongdoing-00127527"
  },
  {
    "text": "Trump Crosses a Crucial Line  —  But Americans can still choose a better path.  —  The former president, after years of espousing authoritarian beliefs, has fully embraced the language of fascism.  But Americans—even those who have supported him—can still refuse to follow him deeper into darkness.",
    "url": "https://www.theatlantic.com/newsletters/archive/2023/11/trump-crosses-a-crucial-line/676031/"
  },
  {
    "text": "Appeals court temporarily lifts Trump gag order in civil fraud case  —  The ruling came after the former president's lawyers argued that he'd been improperly barred from complaining about Judge Arthur Engoron's law clerk.  —  A New York appeals court on Thursday temporarily blocked a gag order … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/appeals-court-temporarily-lifts-trump-gag-order-civil-fraud-case-rcna125588"
  },
  {
    "text": "Ohio 2024 Poll: Brown Tops Potential GOP Opponents in the U.S. Senate Race  —  Trump and Biden Comfortably Lead Republican and Democratic Primaries  —  A new Emerson College Polling/WJW-TV Fox 8 Cleveland survey of Ohio voters finds Democratic Senator Sherrod Brown leading potential Republican opponents … ",
    "url": "https://emersoncollegepolling.com/ohio-2024-poll-brown-tops-potential-gop-opponents-in-the-u-s-senate-race/"
  },
  {
    "text": "Donald Trump's 2024 Trial Schedule Drifts Into Chaos  —  Court filings, judicial opinions, public statements and other developments reveal how the former president could face only a single trial on his road to Election Day  —  JWPlayer  —  In theory, Donald Trump is facing down the prospect … ",
    "url": "https://themessenger.com/politics/trump-2024-criminal-trial-schedule-dc-georgia-florida-new-york"
  },
  {
    "text": "Sean Combs Is Accused by Cassie of Rape and Years of Abuse in Lawsuit  —  In the suit, the singer says Mr. Combs, known as Puff Daddy or Diddy, subjected her to a pattern of control and abuse over about a decade.  Mr. Combs “vehemently” denied the allegations.",
    "url": "https://www.nytimes.com/2023/11/16/arts/music/sean-combs-diddy-cassie-rape-lawsuit.html"
  },
  {
    "text": "Don't just be horrified.  Ban AR-15s, bump stocks and large magazines.  —  Even the best-written accounts cannot fully convey the carnage of mass shootings.  The frequency and lethality of massacres on U.S. soil numb society to the moral outrage of slaughtered innocents.",
    "url": "https://www.washingtonpost.com/opinions/2023/11/16/ar15-bloody-photos-bump-stocks/"
  },
  {
    "text": "New York authorities make largest-ever seizure of knock-off goods, worth more than $1B  —  Photographs released by prosecutors showed shelves stacked with counterfeit wallets and bags.  —  NEW YORK — Federal authorities in New York announced on Wednesday the largest-ever seizure of counterfeit goods … ",
    "url": "https://www.nbcnews.com/news/us-news/new-york-authorities-make-largest-ever-seizure-knock-goods-1b-rcna125473"
  },
  {
    "text": "Special counsel investigating Joe Biden's handling of classified material is not expected to bring charges  —  Special counsel Robert Hur is not expected to charge anyone in connection with the mishandling of classified documents at two locations connected to President Joe Biden, two sources close to the investigation told CNN.",
    "url": "https://www.cnn.com/2023/11/16/politics/special-counsel-hur-biden/"
  },
  {
    "text": "How Osama bin Laden's ‘Letter to America’ reached millions online  —  Videos citing the document had been viewed far less than many TikTok posts.  Then a journalist made a compilation and posted it to X, causing attention to the manifesto to explode.  —  On Monday, a TikTok user with 371 followers … ",
    "url": "https://www.washingtonpost.com/style/2023/11/16/guardian-osama-bin-laden-letter-to-america/"
  },
  {
    "text": "CNN Exclusive: Special counsel using California grand jury in Hunter Biden probe, subpoenas his uncle James Biden  —  Special counsel prosecutors are using a Los Angeles grand jury to seek documents and possible testimony from multiple witnesses as part of the ongoing federal investigation … ",
    "url": "https://www.cnn.com/2023/11/16/politics/special-counsel-california-grand-jury-hunter-james-biden"
  },
  {
    "text": "Capitol Police confront fallout from violent protest at Democratic headquarters  —  The Hill's police force has been on edge after recent assaults on lawmakers and the Jan. 6 insurrection.  —  The Capitol Police announced that a protest that turned violent outside of Democratic Party … ",
    "url": "https://www.politico.com/news/2023/11/16/capitol-police-fallout-protest-democratic-headquarters-00127579"
  },
  {
    "text": "Exclusive: Department of Education opens seven school investigations over alleged incidents of antisemitism and Islamophobia  —  The Department of Education has launched investigations into seven schools after receiving complaints about alleged incidents of antisemitism and Islamophobia, an administration official tells CNN.",
    "url": "https://www.cnn.com/2023/11/16/politics/department-of-education-antisemitism-islamophobia-investigations"
  },
  {
    "text": "USCP Statement on the Unlawful Demonstration outside the DNC  —  Last night approximately 200 people gathered in front of the Democratic National Committee (DNC) headquarters to protest the conflict in the Middle East.  —  We have handled hundreds of peaceful protests, but last night's group was not peaceful.",
    "url": "https://www.uscp.gov/media-center/press-releases/uscp-statement-unlawful-demonstration-outside-dnc"
  },
  {
    "text": "Cease-fire now.  The killing in Gaza must stop  —  It has become impossible to distinguish between Israel's decidedly non-surgical operation against Hamas militants in Gaza and the indiscriminate killing of Palestinian civilians.  When so-called humanitarian pauses in the bombardment … ",
    "url": "https://www.latimes.com/opinion/story/2023-11-16/editorial-ceasefire-now-the-killing-in-gaza-must-stop"
  },
  {
    "text": "Progressive pressure on Jeffries: Israel critics want help surviving backlash  —  It's a moment for new House Democratic leaders to shore up support among the left flank, as the two sides strike different tones on the Israel-Hamas War.  —  Progressive Democrats who've condemned Israel … ",
    "url": "https://www.politico.com/news/2023/11/16/progressives-primary-israel-jeffries-00127450"
  },
  {
    "text": "New Hampshire Democratic office is vandalized with antisemitic and white supremacist symbols  —  The vandalism included swastikas and an antisemitic slur spray-painted on the side of the Belknap County Democrats' office.  —  The New Hampshire Democratic Party's Belknap County office … ",
    "url": "https://www.nbcnews.com/politics/politics-news/new-hampshire-democratic-office-vandalized-antisemitic-white-supremaci-rcna125530"
  },
  {
    "text": "Dexter Wade, buried without his family's knowledge, had ID on him with his home address, lawyer says  —  Dexter Wade, 37, was run over by a police cruiser in March, and buried in a pauper's grave.  His mother searched for him for months before learning what happened.",
    "url": "https://www.nbcnews.com/news/us-news/dexter-wade-buried-mississippi-id-home-address-lawyer-says-rcna125511"
  }
]