[
  {
    "text": "Harris holds slight national lead over Trump, Post-ABC-Ipsos poll finds  —  The result is a notable improvement for Democrats in a contest that a little more than a month ago showed Biden and Trump in a dead heat.  —  Vice President Kamala Harris holds a narrow lead over former president Donald Trump … ",
    "url": "https://www.washingtonpost.com/politics/2024/08/18/harris-trump-post-abc-ipsos-poll/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzIzOTUzNjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI1MzM1OTk5LCJpYXQiOjE3MjM5NTM2MDAsImp0aSI6IjA3MGRlYWZlLTBkY2QtNGMxOS04NDQ3LTNmYTU5ZWY5MmExNCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzA4LzE4L2hhcnJpcy10cnVtcC1wb3N0LWFiYy1pcHNvcy1wb2xsLyJ9.R1Q9c_XYrIEXHkuCsHs8SUUVMarHbrzvNFB95MbmSyk&itid=gfta"
  },
  {
    "text": "“Fake polls”: Vance downplays Harris rise … - Among likely voters, Harris holds a 6-point lead, 51% to 45%.  — Independents swung from Trump +4 against President Biden in July to Harris +11 over Trump in August. … - CBS/YouGov polling also released on Sunday shows Harris leading Trump by a 3-point margin nationally.",
    "url": "https://www.axios.com/2024/08/18/vance-harris-election-polls-fake"
  },
  {
    "text": "CBS News poll: Gender gap, enthusiasm, economy make for tight Harris-Trump race on Democratic convention eve  —  When Kamala Harris became the Democratic presidential nominee, the party saw a major surge in enthusiasm from its voters.  It pulled the party into an effectively even race … ",
    "url": "https://www.cbsnews.com/news/new-poll-kamala-harris-policies-trump-democratic-convention-2024/"
  },
  {
    "text": "Behind the Curtain: Trump's devil-in-Georgia problem … Yet Trump himself has made this make-or-break state dramatically more breakable by torching its popular Republican governor, Brian Kemp, bluntly and repeatedly.  — “He's a bad guy. … - “Little Brian, little Brian Kemp,” Trump continued.",
    "url": "https://www.axios.com/2024/08/18/trump-2024-election-georgia-brian-kemp"
  },
  {
    "text": "Sen. Lindsey Graham: ‘Trump the provocateur, the showman may not win this election’  —  The South Carolina senator urged his fellow Republicans to campaign for former President Donald Trump, but added that Trump needs to focus more on policy.  —  South Carolina GOP Sen. Lindsey Graham … ",
    "url": "https://www.nbcnews.com/politics/2024-election/lindsey-graham-trump-provocateur-showman-may-not-win-election-rcna167060"
  },
  {
    "text": "Harris leads Trump overall but not on handling of the economy: POLL  —  Among all adults, the Harris tickets leads and the Trump ticket by 50%-45%.  —  Vice President and Democratic presidential candidate Kamala Harris walks on stage in the overflow room after speaking at Prince George's Community College in Largo, MD, Aug. 15, 2024.",
    "url": "https://abcnews.go.com/Politics/harris-trump-poll-election-issues/story?id=112865487"
  },
  {
    "text": "Trump to counter DNC with swing state blitz  —  Former President Trump and his allies will fan out across battleground states this week in a bid to directly counter Vice President Harris and Democrats as they gather for their convention in Chicago.  —  Trump will visit four swing states this week … ",
    "url": "https://thehill.com/homenews/campaign/4833353-donald-trump-counter-dnc-swing-state-blitz/"
  },
  {
    "text": "Inciting rioters in Britain was a test run for Elon Musk.  Just see what he plans for America  —  The presidential election is three months away.  What if the billionaire contests the result?  What if he decides democracy is over-rated?  —  Just over four years ago … ",
    "url": "https://www.theguardian.com/commentisfree/article/2024/aug/18/inciting-rioters-in-britain-was-a-test-run-for-elon-musk-just-see-what-he-plans-for-america"
  },
  {
    "text": "Protesters paused to reconsider opposing Harris at the DNC.  They decided on full steam ahead.  —  There are at least six major protests planned during the DNC in Chicago.  —  CHICAGO — There was a moment after Vice President Kamala Harris was tapped to run for president … ",
    "url": "https://www.politico.com/news/2024/08/18/dnc-protests-gaza-kamala-harris-00174497"
  },
  {
    "text": "Whitmer says people ‘reading too much’ into price-gouging plan specifics  —  Video Player is loading.  —  Play Video  —  Unmute  —  Current Time 0:00  —  Loaded: 0%  —  Stream Type LIVE  —  Seek to live, currently behind liveLIVE  —  Playback Rate  —  Chapters  — Chapters",
    "url": "https://thehill.com/homenews/campaign/4833272-whitmer-says-people-reading-too-much-into-price-gouging-plan-specifics/"
  },
  {
    "text": "Far-right influencers turn against Trump campaign  —  Hard-right provocateurs take aim at how the former president's aides are positioning him for the November vote — though not at the Republican candidate himself.  —  Some of the internet's most influential far-right figures are turning … ",
    "url": "https://www.washingtonpost.com/technology/2024/08/18/trump-campaign-nick-fuentes-groypers-hard-right-criticism/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzIzOTUzNjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI1MzM1OTk5LCJpYXQiOjE3MjM5NTM2MDAsImp0aSI6IjBkMDFlZjEwLTA3N2EtNGNiNC05NDc3LTg5N2U1NmM3NzJhYSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS90ZWNobm9sb2d5LzIwMjQvMDgvMTgvdHJ1bXAtY2FtcGFpZ24tbmljay1mdWVudGVzLWdyb3lwZXJzLWhhcmQtcmlnaHQtY3JpdGljaXNtLyJ9.pIOGmhr5u28NfLiHRA8SU1hyMTb4pOkB1u6nxEe0uZ4&itid=gfta"
  },
  {
    "text": "Michelle Obama to address Democratic Convention on Tuesday … - NBC News was first to report the Tuesday speaking slot. … - The DNC will kickoff on Monday, with President Biden headlining opening night and former Secretary of State Hillary Clinton also speaking.",
    "url": "https://www.axios.com/2024/08/18/michelle-obama-dnc-speech-night"
  },
  {
    "text": "Former aide H.R. McMaster on how Trump enjoys “pitting people against each other”  —  Lt. Gen. H.R. McMaster had been a soldier for three decades when Donald Trump named him his national security adviser just one month into his administration.  “Lots of people told me not to do it,” McMaster said.",
    "url": "https://www.cbsnews.com/news/h-r-mcmaster-at-war-with-ourselves-my-tour-of-duty-in-the-trump-white-house/"
  },
  {
    "text": "Beshear says Harris's economic plan to to ensure ‘capitalism stays within the guardrails’  —  Kentucky Gov. Andy Beshear (D) defended Vice President Harris's newly unveiled economic agenda, saying it will help ensure the economy is working properly.  —  “I do because I've been an attorney general … ",
    "url": "https://thehill.com/homenews/campaign/4833377-andy-beshear-kamala-harris-economic-plan-economy-work-properly/"
  },
  {
    "text": "Six Takeaways From the Magazine's Profile of Joe Biden  —  His decision to quit the race ended a remarkable chapter in American political history — and started one that may yet define his legacy.  —  Joe Biden dreamed of one day becoming president nearly all his life.",
    "url": "https://www.nytimes.com/2024/08/18/magazine/biden-presidency-legacy-takeaways.html"
  },
  {
    "text": "Kremlin response to Kursk incursion shows how Putin freezes in a crisis  —  When Russian President Vladimir Putin's authority is tested, his response often lacks quick, decisive action that lives up to his bellicose rhetoric.  —  Faced with crisis, Vladimir Putin tends to freeze.",
    "url": "https://www.washingtonpost.com/world/2024/08/18/vladimir-putin-kursk-crisis-reponse/"
  },
  {
    "text": "Kamala Harris Wants to Build 3 Million Houses.  Is That Enough?  —  Whoever wins the presidency will be inheriting an unaffordable housing market with no easy way to fix it.  Years of high interest rates have made it difficult for buyers to afford a new home, while sellers are reluctant … ",
    "url": "https://nymag.com/intelligencer/article/kamala-harris-wants-3-million-more-houses-is-that-enough.html"
  }
]