[
  {
    "text": "EXCLUSIVE: Ethics committee told of second sexual encounter between Matt Gaetz and 17-year-old at party, sources say  —  The woman who says she had sex when she was a minor with then-Rep. Matt Gaetz told the House Ethics Committee she had two sexual encounters with him at one party in 2017, sources familiar with her testimony tell CNN.",
    "url": "https://www.cnn.com/2024/11/21/politics/matt-gaetz-second-sexual-encounter-minor/"
  },
  {
    "text": "'You Don't Have the Votes': How Trump Barred the Gaetz  —  DONALD TRUMP GIVETH.  And he taketh away.  —  Eight days after making the snap decision to nominate Matt Gaetz to be the nation's next attorney general, Trump phoned him Thursday morning to tell him he wouldn't get confirmed, according to a source briefed on the conversation.",
    "url": "https://www.thebulwark.com/p/you-dont-have-votes-trump-matt-gaetz-attorney-general"
  },
  {
    "text": "Trump announces Pam Bondi as new attorney general pick hours after Matt Gaetz withdraws  —  Bondi previously served as Florida's attorney general.  —  President-elect Donald Trump announced Thursday evening that his new pick for attorney general is Pam Bondi.  —  Bondi previously served as Florida's attorney general.",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-announces-pam-bondi-attorney-general-pick-gaetz-withdraws-rcna181279"
  },
  {
    "text": "Historically brief, but Gaetz's Cabinet bid still did a lot of damage  —  No candidate for the Cabinet has been named so soon after an election and then withdrawn as rapidly as Gaetz.  —  If it seems like only a week ago that President-elect Donald Trump named then-Rep. Matt Gaetz (R-Florida) … ",
    "url": "https://www.washingtonpost.com/politics/2024/11/21/trump-gaetz-attorney-general-senate/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzMyMTY1MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzMzNTQ3NTk5LCJpYXQiOjE3MzIxNjUyMDAsImp0aSI6Ijg5NGMxMmVlLWZmZWEtNDVlMi05MDY2LTdlZDk5OTg0ZjRjNSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzExLzIxL3RydW1wLWdhZXR6LWF0dG9ybmV5LWdlbmVyYWwtc2VuYXRlLyJ9.8v0yEh1aPPmL16BFgLTvbN5Xz1ln7WMdgtVqUo_ZI68&itid=gfta"
  },
  {
    "text": "Matt Gaetz withdraws his bid for attorney general amid sexual misconduct allegations  —  Trump's choice had been hindered by sexual misconduct allegations and a House Ethics Committee investigation.  —  Former Rep. Matt Gaetz, R-Fla., on Thursday announced that he would withdraw himself … ",
    "url": "https://www.nbcnews.com/politics/justice-department/matt-gaetz-withdraws-name-attorney-general-consideration-rcna181206"
  },
  {
    "text": "Trump Allies Were Worried Gaetz Would Be ‘Most Blackmail-able’ AG Ever  —  Matt Gaetz withdrew his name from consideration to be attorney general.  Trump allies worried he had far too many skeletons in his closet … The former Florida congressman's historically short stint as a presidential pick came … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-gaetz-attorney-general-blackmail-1235176338/"
  },
  {
    "text": "HR 9495: Bill Threatening Nonprofits Passes House  —  Editor's Note: This article will continue to be updated as more news about HR 9495 is released.  —  A bill, HR 9495, which would allow a presidentially appointed treasury secretary to unilaterally strip a nonprofit of its status if deemed a … ",
    "url": "https://nonprofitquarterly.org/hr-9495-bill-threatening-nonprofits-passes-house/"
  },
  {
    "text": "GOP Takes First Steps To Shut Down Climate Groups  —  Democrats just helped Republicans give President-elect Donald Trump the potential power to shut down nonprofits under the guise of fighting terrorism — while GOP lawmakers have quietly revealed a new blueprint for defunding organizations they disagree with.",
    "url": "https://www.levernews.com/gop-takes-first-steps-to-shut-down-climate-groups/"
  },
  {
    "text": "Brazilian police indict former President Bolsonaro and aides over alleged 2022 coup attempt  —  Brazil's federal police said Thursday they indicted former President Jair Bolsonaro and 36 other people for allegedly attempting a coup to keep him in office after his defeat in the 2022 elections.",
    "url": "https://apnews.com/article/brazil-jair-bolsonaro-indictment-0d62fe0a7399483aee48cf3c845560ea"
  },
  {
    "text": "Police report reveals assault allegations against Hegseth, Trump's pick for defense secretary  —  A woman told police that she was sexually assaulted in 2017 by Pete Hegseth after he took her phone, blocked the door to a California hotel room and refused to let her leave … ",
    "url": "https://apnews.com/article/hegseth-assault-allegations-police-report-trump-e6ebec0a1a5c7fb51cb5e2198f5e12a5"
  },
  {
    "text": "South Dakota Republican introduces bill to eliminate Department of Education  —  Sen. Mike Rounds (R-S.D.) introduced legislation on Thursday to eliminate the Department of Education, a move that would have the support of President-elect Trump.  —  The proposal would get rid of the federal agency … ",
    "url": "https://thehill.com/homenews/education/5003481-south-dakota-republican-department-of-education-trump/"
  },
  {
    "text": "Judge Schedules Hearing For Rudy Giuliani After Workers Say He Won't Stop Smearing Them  —  Remarks by Rudy Giuliani about the women on his podcast prompted the call for the contempt hearing just a day ago.  —  A civil contempt hearing is now on the books in Washington, D.C., for Rudy Giuliani … ",
    "url": "https://www.huffpost.com/entry/judge-sets-civil-contempt-hearing-for-rudy-giuliani-after-defamed-workers-say-he-cant-stop-smearing-them_n_673f8198e4b090a704c8d520"
  },
  {
    "text": "Schumer explains reported GOP deal on judges  —  The office of Senate Majority Leader Chuck Schumer is defending a reported deal where Democrats ceded four appeals court nominations in favor of confirming more of President Joe Biden's lower-level federal judicial appointees.",
    "url": "https://www.politico.com/live-updates/2024/11/21/congress/schumer-on-gop-judges-deal-00191038"
  },
  {
    "text": "Senator Bob Casey Concedes to David McCormick in Pennsylvania  —  Mr. Casey, a three-term Democrat, bowed out of his race against Mr. McCormick, a Republican who led narrowly amid a recount of votes in one of the nation's top Senate races.  —  Senator Bob Casey, a three-term Democrat … ",
    "url": "https://www.nytimes.com/2024/11/21/us/politics/bob-casey-david-mccormick-pennsylvania-senate.html"
  },
  {
    "text": "Ambulances were at Mar-a-Lago for Vance motorcade, not for Trump |  Fact check  —  A Nov. 21 post on X, formerly Twitter (direct link, archive link) claims President-elect Donald Trump left his Florida home in an emergency vehicle.  —  “Now trump in an ambulance out of mar a Lago with vans full … ",
    "url": "https://www.usatoday.com/story/news/factcheck/2024/11/21/donald-trump-mar-a-lago-ambulance-fact-check/76488242007/"
  },
  {
    "text": "US intelligence warns defense companies of Russian sabotage threat  —  U.S. intelligence officials warned American defense companies on Thursday to increase security precautions following several acts of sabotage in Europe that officials have blamed on Russia.",
    "url": "https://apnews.com/article/sabotage-russia-germany-putin-ukraine-058ee53d79af97bc9a499ccc10a5e35a"
  },
  {
    "text": "1 big thing: 🇺🇦 Ukraine's lame-duck danger  —  Tensions between Moscow and the West have reached new heights over the past several days:  — The war in Ukraine has veered into volatile new territory, ignited by a final push — in Washington, Moscow and Kyiv … ",
    "url": "https://www.axios.com/newsletters/axios-am-3bf8ba50-a7aa-11ef-a78c-418139a86ee5.html?chunk=3&utm_term=emshare"
  },
  {
    "text": "ICC Issues War-Crimes Arrest Warrants for Netanyahu, Gallant Over Gaza War  —  Court alleges use of starvation as a weapon and direction of attacks against civilians  —  The International Criminal Court issued arrest warrants for Israeli Prime Minister Benjamin Netanyahu … ",
    "url": "https://www.wsj.com/world/middle-east/icc-issues-war-crimes-arrest-warrant-for-netanyahu-gallant-over-gaza-war-0573b79a"
  },
  {
    "text": "‘I think Elon may get frustrated fairly quickly’  —  Rep. Ro Khanna casts doubt on Elon Musk's new Department of Government Efficiency and its small-government ambitions.  —  Elon Musk's bold plans to slash jobs and spending across federal agencies may run headlong into lawmakers … ",
    "url": "https://www.politico.com/news/2024/11/21/ro-khanna-elon-musk-doge-defense-00191053"
  },
  {
    "text": "Charted: Harris' popular vote gap with Biden … - Harris won far fewer voters than Biden in New York City, Chicago and L.A., and ran behind Biden in blue areas generally, a New York Times analysis shows. … But both were also unusually high-turnout elections.",
    "url": "https://www.axios.com/2024/11/21/harris-trump-popular-vote-total-election"
  }
]