[
  {
    "text": "Koch network stops spending on Nikki Haley's presidential campaign  —  Americans for Prosperity Action said it had to “take stock” after Haley's loss in South Carolina.  —  Americans For Prosperity Action, the powerful conservative group supporting Nikki Haley in the Republican presidential primary … ",
    "url": "https://www.politico.com/news/2024/02/25/koch-afp-nikki-haley-00143212"
  },
  {
    "text": "Status Report: Warning Signs for Trump  —  A quick check-in on the state of affairs on the other side of the campaign aisle.  For some time now, it's been down to two people, Trump and Haley, and yesterday the GOP primary contest was in Haley's home state of South Carolina.  —  Newsflash: Trump won.",
    "url": "https://statuskuo.substack.com/p/status-report-warning-signs-for-trump"
  },
  {
    "text": "Months After Backing Haley, Koch Network Suspends Support for Her Campaign  —  The group's chief executive wrote in an email to staff on Sunday that it would now focus on House and Senate races.  —  The political network created by the billionaire industrialist Koch brothers announced … ",
    "url": "https://www.nytimes.com/2024/02/25/us/politics/haley-koch-network.html"
  },
  {
    "text": "Lawmakers fail to reach deal with partial shutdown looming  —  Senate Majority Leader Chuck Schumer (D-N.Y.) on Sunday blasted Republicans over for threat of what he called “a harmful and unnecessary government shutdown” as Congress struggles to strike a bipartisan deal days out from a key funding deadline.",
    "url": "https://thehill.com/policy/energy-environment/4488498-lawmakers-fail-to-reach-deal-with-partial-shutdown-looming/"
  },
  {
    "text": "Lawmakers fail to reach deal with partial shutdown looming  —  Congressional leaders are trading blame as both sides struggle to strike a bipartisan deal to stave off the threat of a partial government shutdown.  —  Lawmakers have until Mar. 1 to pass legislation to fund the departments of Agriculture … ",
    "url": "https://thehill.com/homenews/senate/4488498-lawmakers-fail-to-reach-deal-with-partial-shutdown-looming/"
  },
  {
    "text": "Biden is summoning congressional leaders to the White House to talk Ukraine and government funding  —  President Joe Biden will convene the top four congressional leaders at the White House on Tuesday to press lawmakers on passing an emergency aid package for Ukraine and Israel … ",
    "url": "https://apnews.com/article/biden-johnson-schumer-congress-aid-ukraine-israel-a4b886c469b3d5bff8ae7a18e5896eb1"
  },
  {
    "text": "Ronna McDaniel, the R.N.C.'s Top Official, Plans to Step Down on March 8  —  The chairwoman of the Republican National Committee said on Monday that she would step down in just over a week, as former President Donald J. Trump seeks to install a new handpicked leader for the national party ahead of the general election this fall.",
    "url": "https://www.nytimes.com/2024/02/26/us/politics/ronna-mcdaniel-rnc-trump.html"
  },
  {
    "text": "Democratic operative admits to commissioning fake Biden robocall that used AI  —  Steve Kramer acknowledged Sunday that he created the fake Joe Biden robocall at the center of a multistate investigation after NBC News reported about his involvement.  —  Steve Kramer, a veteran political consultant working … ",
    "url": "https://www.nbcnews.com/politics/2024-election/democratic-operative-admits-commissioning-fake-biden-robocall-used-ai-rcna140402?taid=65dbacde592fef00019b1579"
  },
  {
    "text": "The prospect of a second Trump presidency has the intelligence community on edge  —  Trump sought major changes at the intel agencies in his first term; former officials say he could be more radical in a second.  —  Former top officials from Donald Trump's administration are warning … ",
    "url": "https://www.politico.com/news/2024/02/26/trump-intelligence-agency-national-security-00142968"
  },
  {
    "text": "As the Election Comes Into Focus, Pressure Builds in the West Wing  —  The presidency has always been a pressure cooker, but some in the Biden administration see wars, age, family stress and another race against Donald J. Trump combining with unusual force.  —  A former adviser to President Biden … ",
    "url": "https://www.nytimes.com/2024/02/26/us/politics/biden-election-pressure-west-wing.html"
  },
  {
    "text": "What Is Christian Nationalism, Exactly?  —  If you're alarmed by the rise of Christian nationalism, the single worst thing you can do is define it too broadly.  If you define it too broadly, then you're telling millions of ordinary churchgoing citizens that the importation of their religious values … ",
    "url": "https://www.nytimes.com/2024/02/25/opinion/christian-nationalism.html"
  },
  {
    "text": "Palestinian Prime Minister Shtayyeh resigns  —  Palestinian Prime Minister Mohammad Shtayyeh said on Monday he was resigning to allow for the formation of a broad consensus among Palestinians about political arrangements following Israel's war against the Islamist group Hamas in Gaza.",
    "url": "https://www.reuters.com/world/middle-east/palestinian-prime-minister-shtayyeh-resigns-2024-02-26/"
  },
  {
    "text": "Stupid Power  —  Deluding ourselves about America's delusions.  —  In all my years as someone spouting opinions about public affairs, I have never been more wrong than when I predicted that something could not happen because it was just too stupid.  My first distinct memory of this phenomenon came … ",
    "url": "https://www.hamiltonnolan.com/p/stupid-power"
  },
  {
    "text": "Republicans Struggle to Respond as Democrats Emphasize the Alabama I.V.F. Ruling  —  A decision in Alabama's Supreme Court, which pointed to the overturning of Roe v. Wade, has rocked presidential and congressional campaigns.  —  More than a week after the Alabama Supreme Court declared … ",
    "url": "https://www.nytimes.com/2024/02/25/us/politics/alabama-ivf-ruling-republicans-democrats.html"
  },
  {
    "text": "Fiona Hill: Trump comparison to Navalny ‘brazen’ and ‘shameful’  —  Former National Security Council adviser Fiona Hill went after former President Trump on Sunday after he compared himself to the late Russian opposition leader Alexei Navalny as a political dissident.",
    "url": "https://thehill.com/homenews/campaign/4488138-fiona-hill-trump-comparison-to-navalny-brazen-and-shameful/"
  }
]