[
  {
    "text": "The Court Just Sealed Everyone's Fate, Including Its Own  —  This week, the Supreme Court managed to fail to meet the already extremely low expectations most sane people already had for it.  First, during the Idaho EMTALA case on whether hospitals receiving federal funding can refuse … ",
    "url": "https://newrepublic.com/article/181032/supreme-court-trump-immunity-sealed-fate"
  },
  {
    "text": "Florida GOP Rep. Posey abruptly announces retirement  —  He first won his deep-red seat in 2008.  —  TALLAHASSEE, Florida — Rep. Bill Posey (R-Fla.) abruptly announced on Friday that he will not seek reelection, after initially planning to run for another term.",
    "url": "https://www.politico.com/news/2024/04/26/florida-bill-posey-retirement-00154658"
  },
  {
    "text": "'Where's Cricket?'  Don't Ask.  Kristi Noem Defends Killing Her Dog.  —  In a forthcoming book, the South Dakota governor, seen as a potential vice-presidential pick, tells of shooting her hunting dog.  And a goat.  —  Gov. Kristi Noem of South Dakota on Friday defended a story included … ",
    "url": "https://www.nytimes.com/2024/04/26/us/politics/kristi-noem-dog-killing.html"
  },
  {
    "text": "Biden Taunts Trump, Calling Him a ‘Loser,’ Trying to Get Under His Skin  —  President Biden has been trying to hit his opponent where it hurts, critiquing everything from his hairstyle to his energy levels in court.  —  This week, one presidential candidate has called the other a loser … ",
    "url": "https://www.nytimes.com/2024/04/26/us/politics/biden-trump-taunts.html"
  },
  {
    "text": "Maine Dems say they'll consider cutting off Trump's path, if Nebraska moves to hurt Biden  —  Converting the state's electoral votes to winner-take-all would likely erase any gains Trump would make in Nebraska.  —  If Nebraska Republicans changed their electoral college rules to help Donald Trump … ",
    "url": "https://www.politico.com/news/2024/04/26/maine-nebraska-electoral-votes-trump-00154645"
  },
  {
    "text": "The Tech Baron Seeking to “Ethnically Cleanse” San Francisco … To fully grasp the current situation in San Francisco, where venture capitalists are trying to take control of City Hall, you must listen to Balaji Srinivasan.  Before you do, steel yourself for what's to come … ",
    "url": "https://newrepublic.com/article/180487/balaji-srinivasan-network-state-plutocrat"
  },
  {
    "text": "G.O.P. Asks Secret Service to Move Protesters Away From Convention Venue  —  The Republican National Committee said moving protesters farther away from the venue in Milwaukee would reduce the risk of confrontations.  —  The Republican Party sent a letter to the Secret Service on Friday urging … ",
    "url": "https://www.nytimes.com/2024/04/26/us/politics/republican-convention-protest-milwaukee.html"
  },
  {
    "text": "After RNC Shakeup, Trump Ground Game Could Be Compromised  —  Plus: A look at the Washington GOP's unconventional gubernatorial endorsement.  —  Happy Friday!  And we better not bury the lead on the biggest political story of the day: Babydog, the English bulldog owned by Gov. Jim Justice of West Virginia … ",
    "url": "https://thedispatch.com/newsletter/dispatch-politics/after-rnc-shakeup-trump-ground-game-could-be-compromised/"
  },
  {
    "text": "RNC's ‘election integrity’ lawyer charged with election crimes  —  Christina Bobb is the lawyer overseeing the RNC's “election integrity” efforts.  She was also just indicted by a grand jury for election-related crimes.  —  A total of 18 Republicans were indicted in Arizona yesterday as part … ",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/rncs-election-integrity-lawyer-charged-election-crimes-rcna149309"
  },
  {
    "text": "Samuel Alito's Resentment Goes Full Tilt on a Black Day for the Court  —  On the day Donald Trump took office in January 2017, pondering what he might do to the country's democratic norms and institutions, I wrote these words: “Trump will destroy them, if keeping Trump on top requires it.  Or try to.",
    "url": "https://newrepublic.com/post/181023/samuel-alito-trump-immunity-black-day-supreme-court"
  },
  {
    "text": "Court upholds New York law that says ISPs must offer $15 broadband  —  New York obtains significant win for states' ability to regulate broadband.  —  A federal appeals court today reversed a ruling that prevented New York from enforcing a law requiring Internet service providers to sell $15 broadband plans to low-income consumers.",
    "url": "https://arstechnica.com/tech-policy/2024/04/court-upholds-new-york-law-that-says-isps-must-offer-15-broadband/"
  },
  {
    "text": "Trump will dismantle key US weather and science agency, climate experts fear  —  Plan to break up Noaa claims its research is ‘climate alarmism’ and calls for commercializing forecasts, weakening forecasts  —  Climate experts fear Donald Trump will follow a blueprint created by his allies … ",
    "url": "https://www.theguardian.com/us-news/2024/apr/26/trump-presidency-gut-noaa-weather-climate-crisis"
  },
  {
    "text": "Donald Trump Refusing To Go After David Pecker Raises Questions  —  Speculation has risen as to why Donald Trump has not risked violating his gag order to attack former National Enquirer publisher David Pecker following his damning testimony in the hush money trial.",
    "url": "https://www.newsweek.com/donald-trump-trial-david-pecker-national-enquirer-1894487"
  },
  {
    "text": "The dishonest — and ironic — push to blame campus protests on George Soros  —  There is very obviously an element of opposition to the ongoing protests on college campuses that is rooted in familiar partisan rhetoric.  The political right's hostility to college professors and insistences … ",
    "url": "https://www.washingtonpost.com/politics/2024/04/26/dishonest-ironic-push-blame-campus-protests-george-soros/"
  },
  {
    "text": "No One Has a Right to Protest in My Home  —  The difference between a private yard and a public forum  —  as a constitutional scholar and the dean of the UC Berkeley School of Law, I strongly defend the right to speak one's mind in public forums.  But the rancorous debate over the Israel-Hamas war seems … ",
    "url": "https://www.theatlantic.com/ideas/archive/2024/04/campus-protest-first-amendment-berkeley/678186/"
  }
]