[
  {
    "text": "Texas Supreme Court Temporarily Halts Court-Approved Abortion  —  The court, responding to an appeal from Attorney General Ken Paxton, put on hold a lower court order allowing an abortion for a woman whose fetus has a fatal condition.  —  The Texas Supreme Court late Friday temporarily halted … ",
    "url": "https://www.nytimes.com/2023/12/08/us/texas-abortion-court-ken-paxton.html"
  },
  {
    "text": "Texas Supreme Court temporarily blocks pregnant woman from emergency abortion  —  The Texas Supreme Court has temporarily blocked a pregnant woman from obtaining an emergency abortion in a ruling issued late Friday.  —  The court froze a lower court's ruling that would have allowed Kate Cox … ",
    "url": "https://www.cnn.com/2023/12/08/us/texas-abortion-ruling-attorney-general-petition/"
  },
  {
    "text": "Ken Paxton asks Texas Supreme Court to stop abortion for woman with lethal fetal anomaly  —  After a Travis County district judge cleared the way for Kate Cox, 31, to terminate her pregnancy, Ken Paxton petitioned the state's highest court to halt the ruling.",
    "url": "https://www.texastribune.org/2023/12/08/texas-abortion-lawsuit-ken-paxton/"
  },
  {
    "text": "Her Online Sex Life Was Exposed.  She Lost Her Election.  Now She's Speaking Out.  —  Susanna Gibson's campaign was rocked when an opponent exposed her private digital life to the public.  She won't be the last.  —  It is not often that a state legislative campaign in an off-season election seizes the national spotlight.",
    "url": "https://www.politico.com/news/magazine/2023/12/09/susanna-gibson-virginia-digital-privacy-00130883"
  },
  {
    "text": "Trump Takes 2024 Lead as Biden Approval Hits New Low, WSJ Poll Finds  —  Unhappiness with Biden's performance is pervasive, with economic pessimism weighing him down  —  WASHINGTON—President Biden's political standing is at its weakest point of his presidency, a new Wall Street Journal poll finds … ",
    "url": "https://www.wsj.com/politics/elections/trump-takes-2024-lead-as-biden-approval-hits-new-low-wsj-poll-finds-fb4fca0c?mod=followamazon"
  },
  {
    "text": "Trump camp escalates attempt to limit second-term talk from outside allies  —  Top officials in Donald Trump's campaign sought Friday to quell discussions about his possible second term in the White House, amid alarms about authoritarianism and reports about personnel.",
    "url": "https://www.washingtonpost.com/politics/2023/12/08/trump-campaign-statement-second-term/"
  },
  {
    "text": "Kevin McCarthy endorses Donald Trump; says he would serve in Trump cabinet if he's the ‘best person’ for the job  —  WASHINGTON - Former House Speaker Kevin McCarthy, R-Calif, said in an interview that he'd endorse former President Trump for president in 2024 and would serve in his cabinet if given the opportunity.",
    "url": "https://www.usatoday.com/story/news/politics/elections/2023/12/09/mccarthy-endorses-trump-in-2024-says-he-would-serve-in-trump-cabinet-in-the-right-position/71862405007/"
  },
  {
    "text": "Trump lawyer says he will take stand in fraud trial regardless of gag order  —  Former President Trump's attorney Alina Habba claimed Friday that her client would take the stand on Monday in his civil fraud trial, despite the judge's gag order and discouragement from his legal team.",
    "url": "https://thehill.com/regulation/court-battles/4351358-alina-habba-trump-will-take-stand-fraud-trial-despite-gag-order/"
  },
  {
    "text": "Sen. Vance sends letter slamming Ohio State University DEI efforts, calling it ‘racial hatred’  —  Sen. J.D. Vance (R-Ohio) sent a letter slamming Ohio State University for its diversity, equity and inclusion (DEI) efforts Friday.  —  “Today I wrote to the leadership of Ohio State … ",
    "url": "https://thehill.com/homenews/education/4351361-vance-letter-slamming-osu-dei-efforts/"
  },
  {
    "text": "GOP Senate candidates soften their abortion stances amid a post-Roe losing streak  —  In key 2024 battleground states, some Republican Senate hopefuls have quietly shifted elements of their abortion positions.  —  Republican candidates in states that will determine control of the U.S. Senate next year … ",
    "url": "https://www.nbcnews.com/politics/2024-election/gop-senate-candidates-soften-abortion-stances-2024-roe-losing-streak-rcna125185"
  },
  {
    "text": "CDC issues travel advisory for Mexico, citing ‘Rocky Mountain Spotted Fever’  —  The Centers for Disease Control (CDC) issued a travel advisory for Mexico Friday, citing “reports” of Rocky Mountain spotted fever.  —  “There have been reports of Rocky Mountain spotted fever (RMSF) … ",
    "url": "https://thehill.com/policy/healthcare/4351338-cdc-travel-advisory-mexico-rocky-mountain-spotted-fever/"
  },
  {
    "text": "Ukraine in ‘mortal danger’ without aid, Olena Zelenska warns  —  Olena Zelenska has warned that Ukrainians are in “mortal danger” of being left to die if Western countries don't continue their financial support.  —  Ukraine's first lady spoke to Sunday with Laura Kuenssberg … ",
    "url": "https://www.bbc.com/news/world-europe-67667035"
  },
  {
    "text": "Why are the 14th Amendment lawsuits seeking to bar Trump failing?  —  So far, all 14th Amendment lawsuits against Trump have been rejected by courts.  —  Former President Donald Trump attends a Manhattan courthouse trial in a civil fraud case in New York, October 18, 2023.",
    "url": "https://abcnews.go.com/Politics/14th-amendment-lawsuits-seeking-bar-trump-failing/story?id=105391248"
  },
  {
    "text": "Voters to choose between Rep. Sheila Jackson Lee and state Sen. John Whitmire for Houston mayor  —  The new mayor will have to deal with new laws from the GOP-led state government over control of local elections and the ability to impose local regulations.  —  HOUSTON — Two of Houston's … ",
    "url": "https://www.politico.com/news/2023/12/09/voters-to-choose-between-rep-sheila-jackson-lee-and-state-sen-john-whitmire-for-houston-mayor-00130942"
  }
]