[
  {
    "text": "Playbook: Dropping the H-bomb on 2024  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  NEW NYT/SIENA POLL — Among registered voters: Trump beats Biden, 46% to 44%.  Among likely voters: Biden beats Trump, 47% to 45%.  Toplines ... Crosstabs",
    "url": "https://www.politico.com/newsletters/playbook/2023/12/19/dropping-the-h-bomb-on-2024-00132405"
  },
  {
    "text": "How Much Is Biden's Support of Israel Hurting Him With Young Voters?  —  Donald Trump leads him among those 18 to 29, a new poll shows.  —  As recently as this summer, a poll with Donald J. Trump leading among young voters would have been eye-popping.  —  Now, it's increasingly familiar … ",
    "url": "https://www.nytimes.com/2023/12/19/upshot/poll-biden-trump-israel-youth.html"
  },
  {
    "text": "Democrats Must Do What the GOP Won't in Battling Trump's Racism  —  I used to loathe Democrats for how viciously they campaigned.  But because Republicans have mostly surrendered, the country needs Dems to fight like hell. … It's almost like Donald Trump is intentionally saying outrageous things to throw this election.",
    "url": "https://www.thedailybeast.com/democrats-must-do-what-the-gop-wont-in-battling-trumps-racism"
  },
  {
    "text": "Gov. Greg Abbott signs bill making illegal immigration a state crime  —  The new law would authorize police to arrest people they suspect crossed the Rio Grande between ports of entry.  Abbott also signed a bill earmarking more than $1 billion for more border barriers.",
    "url": "https://www.texastribune.org/2023/12/18/texas-governor-abbott-bills-border-wall-illegal-entry-crime-sb3-sb4/"
  },
  {
    "text": "Biden resists his age limitations, causing tension  —  President Biden's reluctance to acknowledge his physical limitations at age 81 is causing some tension on his team, as senior aides and First Lady Jill Biden push him to rest more and be vigilant about his health going into 2024.",
    "url": "https://www.axios.com/2023/12/19/biden-resistance-age-trump-election-2024"
  },
  {
    "text": "Statement from Secretary of Defense Lloyd J. Austin III on Ensuring Freedom of Navigation in the Red Sea  —  The recent escalation in reckless Houthi attacks originating from Yemen threatens the free flow of commerce, endangers innocent mariners, and violates international law.",
    "url": "https://www.defense.gov/News/Releases/Release/Article/3621110/statement-from-secretary-of-defense-lloyd-j-austin-iii-on-ensuring-freedom-of-n/"
  },
  {
    "text": "Toplines: December 2023 Times/Siena Poll of Registered Voters Nationwide  —  Donald Trump leads Joe Biden by 46 percent to 44 percent among registered voters.  —  Thinking ahead to next year's presidential general election, are you almost certain that you will vote, very likely to vote … ",
    "url": "https://www.nytimes.com/interactive/2023/12/19/us/elections/times-siena-national-poll-toplines.html"
  },
  {
    "text": "Miami GOP Strategist Barbara Balmaseda Arrested on Capitol Riot Charges  —  Barbara Balmaseda has been charged with a felony count of obstructing an official proceeding during the Capitol riot. … Authorities have unsealed an arrest warrant for Barbara Balmaseda, a former Florida International … ",
    "url": "https://www.miaminewtimes.com/news/miami-gop-strategist-barbara-balmaseda-accused-of-storming-us-capitol-18501993"
  },
  {
    "text": "Cardin ‘angry,’ ‘disappointed’ with ex-staffer after sex tape reveal  —  Sen. Ben Cardin (D-Md.) on Monday said he is “angry” after a video emerged of a now-former staffer performing lewd acts in a Senate committee hearing room.  —  Cardin declined to delve into particulars about the staffer … ",
    "url": "https://thehill.com/homenews/senate/4366737-cardin-angry-disappointed-with-ex-staffer-after-sex-tape-reveal/"
  },
  {
    "text": "Fernandina Beach Man Pleads Guilty To Threatening To Kill A United States Supreme Court Justice  —  For Immediate Release  —  U.S. Attorney's Office, Middle District of Florida  —  Jacksonville, Florida - United States Attorney Roger B. Handberg announces that Neal Brij Sidhwaney (43 … ",
    "url": "https://www.justice.gov/usao-mdfl/pr/fernandina-beach-man-pleads-guilty-threatening-kill-united-states-supreme-court"
  },
  {
    "text": "Inside The Russian Propaganda Mill Beaming Out Of A Florida Strip Mall  —  When Ben Swann delivers a news report, he looks and sounds like any other TV anchor:  conventionally attractive, slick hair, clad in an unremarkable but well-tailored suit.  —  But unlike thousands of TV reporters around … ",
    "url": "https://talkingpointsmemo.com/news/inside-the-russian-propaganda-mill-beaming-out-of-a-florida-strip-mall"
  },
  {
    "text": "Trump Is Scrambling to Block One Particular Expert Witness in His New E. Jean Carroll Case  —  Donald Trump's lawyers want to bar the same expert witness who came up with a hefty calculation in Rudy Giuliani's defamation case from testifying in a new E. Jean Carroll lawsuit.",
    "url": "https://www.thedailybeast.com/donald-trump-scrambles-to-block-expert-witness-ashlee-humphreys-in-his-new-e-jean-carroll-case"
  },
  {
    "text": "Florida was supposed to be the future of the GOP — now the state party is in shambles  —  Gov. Ron DeSantis grasps desperately for attention, as the state party chair is pushed out after a rape allegation  —  It may seem hard to believe right now, but this time last year … ",
    "url": "https://www.salon.com/2023/12/19/florida-was-supposed-to-be-the-future-of-the--now-the-state-party-is-in-shambles/"
  },
  {
    "text": "The New York Times Is Part of the Effing Problem  —  1. Shade of a Gray Lady  —  James Bennet has written a long piece for the Economist about “When the New York Times Lost Its Way.”  —  Bennet was an editor at the Atlantic who went to the NYT to run the paper's op-ed page and was fired … ",
    "url": "https://plus.thebulwark.com/p/the-new-york-times-is-part-of-the"
  },
  {
    "text": "Government presumption of racial disadvantage under siege by White plaintiffs  —  Minority business programs that dispense federal aid based on ‘social disadvantage presumptions’ are built on a ‘house of cards,’ scholars say  —  An agency created 54 years ago to bolster minority-owned businesses … ",
    "url": "https://www.washingtonpost.com/business/2023/12/18/minority-business-programs-racial-disadvantage/"
  },
  {
    "text": "Judge issues order keeping Confederate memorial at Arlington Cemetery for now  —  A lawsuit by the group Defend Arlington accused the Army, which runs the cemetery, of violating regulations in seeking a hasty removal of the memorial  —  A federal judge on Monday issued a temporary restraining … ",
    "url": "https://www.nbcwashington.com/news/local/judge-issues-order-keeping-confederate-memorial-at-arlington-cemetery-for-now/3496987/"
  },
  {
    "text": "Trump Asks Full D.C. Appeals Court to Review Gag Order in Election Case  —  The former president is seeking the full court's review after a three-judge panel upheld a gag order imposed by the trial court but narrowed its scope.  —  Lawyers for former President Donald J. Trump asked … ",
    "url": "https://www.nytimes.com/2023/12/18/us/politics/trump-gag-order-election.html"
  }
]