[
  {
    "text": "“Have You No Decency?”:  Republican Calls Sarah McBride “Mister,” Dems Erupt And End Hearing  —  During a meeting of the House Foreign Affairs Committee, a Republican representative, Rep. Keith Self, called transgender congresswoman the “gentleman from Delaware.”  Dems pushed back.",
    "url": "https://www.erininthemorning.com/p/have-you-no-decency-republican-calls"
  },
  {
    "text": "Republicans advance a government funding bill despite Democratic opposition  —  House Republicans passed a critical test of their unity Tuesday on legislation to avoid a partial government shutdown, teeing up a final vote in the afternoon for a measure that keeps federal agencies funded through September.",
    "url": "https://apnews.com/article/congress-budget-funding-government-shutdown-e027a644af4152377b8cf99f6a91102f"
  },
  {
    "text": "Education Department Fires 1,300 Workers, Gutting Its Staff  —  The layoffs mean that the department will now have a work force of about half the size it did when President Trump took office.  —  The Education Department announced on Tuesday that it was firing more than 1,300 workers … ",
    "url": "https://www.nytimes.com/2025/03/11/us/politics/trump-education-department-firings.html?unlocked_article_code=1.3E4.iXQq.0RGSfsfI4Mwh&smid=url-share"
  },
  {
    "text": "U.S. Department of Education Initiates Reduction in Force  —  As part of the Department of Education's final mission, the Department today initiated a reduction in force (RIF) impacting nearly 50% of the Department's workforce.  Impacted Department staff will be placed on administrative leave beginning Friday, March 21st.",
    "url": "https://www.ed.gov/about/news/press-release/us-department-of-education-initiates-reduction-force"
  },
  {
    "text": "Department of Education staff told offices will be closed Wednesday  —  Washington — Staff at the Department of Education received a notice Tuesday instructing them to leave the building by 6 p.m. local time and informing them that all department offices in Washington, D.C. … ",
    "url": "https://www.cbsnews.com/news/education-department-staff-offices-closed/"
  },
  {
    "text": "Education Department to Lay Off Half of Staff  —  Ahead of the announcement, the department told staff that DC offices would be closed on Wednesday and reopen Thursday for “security reasons.”  —  The Education Department is moving to lay off half of its more than 4,000 employees Tuesday evening … ",
    "url": "https://www.insidehighered.com/news/government/politics-elections/2025/03/11/education-department-reduce-staff-half"
  },
  {
    "text": "Education Department cuts half its staff as Trump vows to wind the agency down  —  The Education Department plans to lay off more than 1,300 of its employees as part of an effort to halve the organization's staff — a prelude to President Donald Trump's plan to dismantle the agency.",
    "url": "https://apnews.com/article/education-department-layoffs-job-cuts-linda-mcmahon-ce9f6a8a63972aede0d8fbdf057ab788"
  },
  {
    "text": "Trump trade war confounds CEOs, deepening economic unease  —  Trump addressed business leaders Tuesday as stock markets continue sliding over concerns about his tariff policies.  —  just now  —  President Donald Trump faced more than 100 top business leaders Tuesday … ",
    "url": "https://www.washingtonpost.com/politics/2025/03/11/trump-tariffs-stock-market-uncertainty/"
  },
  {
    "text": "Ontario suspending 25% surcharge on provincially generated electricity purchased by U.S. states  —  Move comes after Trump threatened Ontario ‘will pay a financial price’ for levy  —  Ontario is suspending its promise to add a 25 per cent surcharge on exports of electricity to some U.S. states … ",
    "url": "https://www.cbc.ca/news/canada/toronto/trump-ford-ontario-electricity-tariffs-trade-war-1.7480234"
  },
  {
    "text": "Lutnick says Trump's policies are “worth it” even if they lead to recession  —  Washington — Commerce Secretary Howard Lutnick defended President Trump's economic policies Tuesday, saying they are “worth it” even if they lead to a recession.  —  “These policies are the most important thing America … ",
    "url": "https://www.cbsnews.com/news/lutnick-trumps-policies-worth-it-recession/"
  },
  {
    "text": "Musk Seeks to Put $100 Million Directly Into Trump Political Operation  —  Elon Musk has signaled he wants to make some donations not just to his own super PAC, which is called America PAC and has spent heavily on President Trump in the past, but to an outside entity.",
    "url": "https://www.nytimes.com/2025/03/11/us/politics/elon-musk-trump-donation.html"
  },
  {
    "text": "Johns Hopkins Plans Staff Layoffs After $800 Million Grant Cuts  —  Local and international health research efforts are already winding down as the university braces for even more potential cuts  —  The Trump administration has terminated $800 million in grants to Johns Hopkins University … ",
    "url": "https://www.wsj.com/health/healthcare/johns-hopkins-federal-funding-foreign-aid-cut-ca841d31?st=jycPj9&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Trump, Perkins Coie and John Adams  —  The President breaks a bedrock legal principle by targeting the law firm for representing clients he doesn't like.  —  Tap For Sound  —  As he campaigned for a second term, Donald Trump often said his retribution against opponents would be “success.”",
    "url": "https://www.wsj.com/opinion/donald-trump-perkins-coie-covington-and-burling-executive-order-4b285e8b?st=puHnzN&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Trump's Latest Weapon Against Critics: Destroying Their Lawyers  —  from the first-they-came-for-the-lawyers dept  —  When a president uses executive power to not just blacklist but effectively destroy a major law firm, solely for representing political opponents, it means he's given … ",
    "url": "https://www.techdirt.com/2025/03/11/trumps-latest-weapon-against-critics-destroying-their-lawyers/"
  },
  {
    "text": "USAID official tells remaining staffers: Shred and burn all your documents  —  The mass document destruction order marks the latest step to dismantle the agency.  —  A senior official at USAID instructed the agency's remaining staff to convene at the agency's now-former headquarters … ",
    "url": "https://www.politico.com/news/2025/03/11/usaid-official-tells-remaining-staffers-shred-and-burn-all-your-documents-00224404"
  },
  {
    "text": "Trump official tasked with defending DOGE cuts posted fashion influencer videos from her office  —  As the Office of Personnel Management oversaw the layoffs of thousands of federal workers and pressed others to justify their positions, the agency's chief spokesperson repeatedly used her office … ",
    "url": "https://www.cnn.com/2025/03/11/politics/opm-spokesperson-fashion-influencer-videos-invs/"
  },
  {
    "text": "What Really Happened With the DDoS Attacks That Took Down X  —  Elon Musk said a “massive cyberattack” disrupted X on Monday and pointed to “IP addresses originating in the Ukraine area” as the source of the attack.  Security experts say that's not how it works.",
    "url": "https://www.wired.com/story/x-ddos-attack-march-2025/"
  },
  {
    "text": "Trump administration eyes cuts to Justice Department public corruption unit, people familiar say  —  President Donald Trump's administration is considering cutting most of the lawyers in the U.S. Justice Department unit that handles public corruption cases, four people familiar with the matter said on Tuesday.",
    "url": "https://www.reuters.com/world/us/trump-administration-eyes-cuts-justice-department-public-corruption-unit-people-2025-03-12/"
  },
  {
    "text": "Marco Rubio Personally Signed Off to Detain Mahmoud Khalil on ‘Foreign Policy Grounds,’ Sources Confirm  —  Marco Rubio personally signed off on the arrest of Palestinian Columbia University student protest negotiator Mahmoud Khalil, using a narrow, little-used authority given to the secretary of state … ",
    "url": "https://zeteo.com/p/marco-rubio-personally-signed-off"
  },
  {
    "text": "Ukraine willing to accept 30-day ceasefire with Russia as U.S. lifts freeze on aid and intelligence  —  Jeddah, Saudi Arabia — The U.S. and Ukraine said Kyiv would accept a 30-day ceasefire with Russia after talks in Saudi Arabia on Tuesday, with Washington pledging to immediately lift … ",
    "url": "https://www.cbsnews.com/news/ukraine-ceasefire-russia-us-talks-saudi-arabia/"
  },
  {
    "text": "USDA halts more than $100M in funding for University of Maine System programs  —  The move temporarily pauses USDA funding for Maine's university system after President Donald Trump threatened to cut off the state over Maine's decision to allow transgender athletes to compete in sports.",
    "url": "https://www.pressherald.com/2025/03/11/usda-halts-funding-for-all-university-of-maine-programs/?link-source=announcement-bar"
  },
  {
    "text": "What lies behind the dramatic shift in markets  —  The sudden change in investors' growth expectations for the three largest economies is upending many consensus trades  —  The writer is president of Queens' College, Cambridge, and an adviser to Allianz and Gramercy",
    "url": "https://www.ft.com/content/7568e76f-3455-4ca3-b901-79f411ce7e11"
  }
]