[
  {
    "text": "Momentum builds to oust Johnson from House speakership  —  One right-wing member called on the speaker to resign, which Johnson rejected  —  Two far-right members are now threatening to oust House Speaker Mike Johnson just as the embattled Republican leader has introduced a complex plan intended … ",
    "url": "https://www.washingtonpost.com/politics/2024/04/16/mike-johnson-house-speaker-ukraine-israel-greene-massie/"
  },
  {
    "text": "Democrats warn Mike Johnson: Don't play us on foreign aid … - “There is no circumstance that we could support anything that does not include humanitarian aid,” House Minority Leader Hakeem Jeffries (D-N.Y.) told Axios. … - The fourth bill is expected to include national security-related … ",
    "url": "https://www.axios.com/2024/04/16/mike-johnson-foreign-aid-democrats"
  },
  {
    "text": "Mike Johnson says he won't resign amid right-wing backlash over foreign aid to Ukraine  —  A defiant House Speaker Mike Johnson, facing growing threats to his speakership, said Tuesday he is not resigning and dismissed threats to his gavel as “absurd” after a second Republican member … ",
    "url": "https://www.cnn.com/2024/04/16/politics/mike-johnson-foreign-aid-plan-republican-reaction/"
  },
  {
    "text": "Why Trump's Trial is a Big Political Problem  —  Pundits are underestimating the potential impact of a candidate getting  —  Not to sound overdramatic, but yesterday is a day that will go down in political history.  For the first time, a former President is the defendant in a criminal trial … ",
    "url": "https://www.messageboxnews.com/p/why-trumps-trial-is-a-big-political"
  },
  {
    "text": "The reality of being a criminal defendant on trial finally dawned on Trump.  He didn't take it well.  —  Donald Trump will spend most of this spring in a drab county courtroom, and he's not happy about it.  —  Donald Trump is learning a hard lesson: Criminal defendants don't get to set their own schedules.",
    "url": "https://www.politico.com/news/2024/04/16/trump-trial-reality-criminal-defendant-00152421"
  },
  {
    "text": "NPR suspends veteran editor as it grapples with his public criticism  —  NPR has formally punished Uri Berliner, the senior editor who publicly argued a week ago that the network had “lost America's trust” by approaching news stories with a rigidly progressive mindset.",
    "url": "https://npr.org/2024/04/16/1244962042/npr-editor-uri-berliner-suspended-essay"
  },
  {
    "text": "Pro-Trump network OAN and Smartmatic settle 2020 election defamation case  —  Voting technology company Smartmatic and the far-right network One America News said Tuesday that they had settled a defamation lawsuit stemming from the outlet's lies about the 2020 election.",
    "url": "https://www.cnn.com/2024/04/16/media/oan-smartmatic-settlement"
  },
  {
    "text": "Smartmatic and MAGA Network OAN Settle Election Defamation Case  —  CONFIDENTIAL  —  The far-right network was initially sued by the voting software firm for pushing baseless conspiracies that the 2020 presidential election was rigged against Donald Trump.",
    "url": "https://www.thedailybeast.com/smartmatic-and-one-america-news-settle-election-defamation-case"
  },
  {
    "text": "Tom Cotton Doubles Down on Calls for Mob Violence Against Protesters  —  HE WENT TO LAW SCHOOL?  —  The Arkansas Republican seems confused about laws against assault and battery.  —  A day after encouraging members of the public to “take matters into their own hands” to deal with peaceful protesters … ",
    "url": "https://www.thedailybeast.com/tom-cotton-doubles-down-on-calls-for-mob-violence-against-protesters"
  },
  {
    "text": "Supreme Court seems divided over obstruction charge in Jan. 6 case that may impact Trump, rioters  —  The Supreme Court seemed deeply divided Tuesday over a challenge to a federal law that prosecutors used to charge more than 350 people who were part of the pro-Donald Trump mob that attacked the U.S. Capitol on Jan. 6, 2021.",
    "url": "https://www.washingtonpost.com/national-security/2024/04/16/supreme-court-jan-6-obstruction-case-trump-rioters/"
  },
  {
    "text": "Romney open to voting with Democrats to dismiss Mayorkas impeachment … But at the same time, I think the Senate should give a chance for debate, even if it's limited to two hours,\" Romney said.  — “So if there's a motion just to table without any discussion, that's something I would oppose.",
    "url": "https://www.axios.com/2024/04/16/mayorkas-impeachment-dismiss-vote-mitt-romney"
  },
  {
    "text": "Why Biden Should Not Debate Trump  —  The networks want their show, but to give the challenger equal status on a TV stage would be a dire normalization of his attempted coup.  —  A consortium of television networks yesterday released a joint statement inviting President Joe Biden … ",
    "url": "https://www.theatlantic.com/ideas/archive/2024/04/joe-biden-donald-trump-presidential-debate/678079/"
  },
  {
    "text": "Federal appeals court overturns West Virginia transgender sports ban  —  A federal appeals court has overturned a West Virginia transgender sports ban, finding that the law violates Title IX, the federal civil rights law that prohibits sex-based discrimination in schools.",
    "url": "https://apnews.com/article/west-virginia-transgender-sports-ban-overturned-badf5518ada74d01a3f0a0420d2f4074"
  },
  {
    "text": "Verified pro-Nazi X accounts flourish under Elon Musk  —  An NBC News review identified 150 verified “Premium” accounts that have posted or amplified pro-Nazi content.  —  Elon Musk's X is a thriving hub for Nazi support and propaganda, with paid subscribers sharing speeches by Adolf Hitler or content praising his genocidal regime.",
    "url": "https://www.nbcnews.com/tech/social-media/x-twitter-elon-musk-nazi-extremist-white-nationalist-accounts-rcna145020"
  },
  {
    "text": "Protesters arrested after shutting down Golden Gate Bridge for hours  —  Traffic was blocked for nearly 5 hours before it started moving again just after noon  —  Activists protesting the war in Gaza shut down Highway 101 on the Golden Gate Bridge Monday morning, snarling the commute … ",
    "url": "https://www.nbcbayarea.com/news/local/san-francisco/protest-golden-gate-bridge/3510362/"
  },
  {
    "text": "Sen Hawley calls on Energy Secretary Granholm to resign in heated exchange over stock trades  —  ‘It is outrageous that you misled us,’ Hawley said  —  Sen. Josh Hawley, R-Mo., called on Energy Secretary Jennifer Granholm to resign Tuesday following a heated exchange over her past financial transactions.",
    "url": "https://www.foxnews.com/politics/sen-hawley-calls-on-energy-secretary-granholm-to-resign-in-heated-exchange-over-stock-trades"
  }
]