[
  {
    "text": "Biden team brings in $10 million in the 24 hours after the State of the Union  —  First to NBC News: The financial haul dwarfs some of the president's biggest fundraising days in 2023, before his rematch with Donald Trump was set.  —  President Joe Biden's re-election machine brought … ",
    "url": "https://www.nbcnews.com/politics/2024-election/biden-raises-10-million-24-hours-state-union-rcna142624"
  },
  {
    "text": "Marjorie Taylor Greene Wants Points for ‘Scaring’ Joe Biden at SOTU  —  LOOK AT ME!  LOOK AT ME!  —  “You know, you guys saw that video of Joe Biden when he saw me this week at the State of the Union.  This is the hat I had on.”  —  Rep. Marjorie Taylor Greene (R-GA) … ",
    "url": "https://www.thedailybeast.com/marjorie-taylor-greene-wants-points-for-scaring-joe-biden-at-sotu"
  },
  {
    "text": "Biden says he regrets referring to ‘an illegal’ during his State of the Union address  —  The president used the term to describe Jose Antonio Ibarra, a Venezuelan who crossed the border into the U.S. and has been charged with the murder of Laken Riley.  —  President Joe Biden on Saturday told MSNBC … ",
    "url": "https://www.nbcnews.com/politics/white-house/biden-says-regrets-reference-illegal-state-union-address-rcna142561"
  },
  {
    "text": "Biden Expresses Regret for Calling an Undocumented Immigrant ‘an Illegal’  —  The president had used the word in an unscripted exchange with Republicans during his State of the Union address on Thursday.  —  President Biden expressed regret on Saturday for using the word “illegal” … ",
    "url": "https://www.nytimes.com/2024/03/09/us/politics/biden-undocumented-immigrant-regret.html"
  },
  {
    "text": "Katie Britt's false linkage of a sex-trafficking case to Joe Biden  —  The Fact Checker … — Sen. Katie Boyd Britt (R-Ala.), in the Republican response to the State of the Union address, March 7  —  If you were watching Britt's speech on Thursday night, you likely would have thought … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/09/fact-check-katie-britt-sex-trafficking/"
  },
  {
    "text": "How Katie Britt, Alabama's so-called ‘reasonable’ senator, lost herself and much more  —  This is an opinion column.  —  Katie Britt's kitchen was empty.  Her table was bare.  —  There was nothing to see but her.  And she was - they told us - ready for her closeup.  —  Come on in, America.",
    "url": "https://www.al.com/news/2024/03/archibald-how-katie-britt-alabamas-so-called-reasonable-senator-lost-herself-and-a-whole-lot-more.html"
  },
  {
    "text": "Americans split on who they trust to do a better job as president: POLL  —  An ABC News/Ipsos poll finds a near-even split between Biden, Trump and neither.  —  President Joe Biden delivers the annual State of the Union address before a joint session of Congress in the House chamber at the Capital building … ",
    "url": "https://abcnews.go.com/Politics/biden-trump-americans-trust-president-poll/story?id=107938351"
  },
  {
    "text": "600 Activision QA workers just formed the biggest videogame union in the US  —  Quality assured.  —  First reported by The Verge, 600 Activision QA workers have formed a new union at the publisher.  It was organized through the Communications Workers of America (CWA), like other unions at the company … ",
    "url": "https://www.pcgamer.com/gaming-industry/600-activision-qa-workers-just-formed-the-biggest-videogame-union-in-the-us/"
  },
  {
    "text": "Nervous about November?  Stop listening to pundits and start defending the president  —  It's the only way that we are going to defeat the anti-democratic forces that are looking to transform our nation  —  This past week's State of the Union, and the incredibly powerful performance by the President … ",
    "url": "https://www.salon.com/2024/03/10/nervous-about-november-stop-listening-to-pundits-and-start-defending-the/"
  },
  {
    "text": "Invented Narratives and the Outrage Industry  —  The Outrage Industry  —  Even if you are not caught up in the Outrage Industry, it affects you because it affects us all.  —  The Outrage Industry influences how we talk about politics with our friends and family—and why some people avoid talking about politics.",
    "url": "https://terikanefield.com/invented-narratives-and-the-outrage-industry/"
  },
  {
    "text": "$91M Bond Didn't Stop Trump From Trashing E. Jean Carroll Again  —  Donald Trump just had to post a $91.6 million bond while he appeals the verdict in the defamation case won by his rape accuser, E. Jean Carroll.  But that whopping sum wasn't enough to get him to stop trashing her.",
    "url": "https://www.thedailybeast.com/dollar91m-bond-didnt-stop-donald-trump-from-trashing-e-jean-carroll-again"
  },
  {
    "text": "Pope Francis Says Ukraine Should Negotiate End of War With Russia  —  Pope Francis said in an interview that Ukraine, facing a possible defeat, should have the courage to negotiate an end to the war with Russia and not be ashamed to sit at the same table to carry out peace talks.",
    "url": "https://www.bloomberg.com/en/news/thp/2024-03-09/pope-francis-ukraine-should-have-the-courage-of-the-white-flag-negotiate-end-of-war-with-russia"
  },
  {
    "text": "Maryland Gov. Moore: Black community will mobilize behind Biden  —  Maryland Governor Wes Moore joins MSNBC's the Rev. Al Sharpton to discuss the path forward for the Biden campaign after the president's State of the Union speech.",
    "url": "https://www.msnbc.com/politicsnation/watch/maryland-gov-moore-black-community-will-mobilize-behind-biden-206035525783"
  },
  {
    "text": "Kari Lake Tries a New Tactic: Mending Fences  —  The close Trump ally is courting former foes and trying to mend fences as she runs for Senate in Arizona.  But bad blood from her 2022 campaign simmers at home.  —  Conciliatory messages on social media.  Open invitations for coffee.",
    "url": "https://www.nytimes.com/2024/03/10/us/politics/kari-lake-arizona-senate.html"
  },
  {
    "text": "Robert De Niro Goes Off on ‘Total Monster’ Trump and His Fans In Epic Rant on Bill Maher — Calls Him Every Name In The Book  —  Acting legend Robert De Niro went on a blistering rant about former President Donald Trump and his supporters, sounding the alarm on a new Trump term and calling him a string of derogatory names.",
    "url": "https://www.mediaite.com/entertainment/robert-de-niro-goes-off-on-trump-and-his-fans-in-epic-rant-on-bill-maher-calls-him-every-name-in-the-book/"
  }
]