[
  {
    "text": "Writers Guild Reaches Tentative Agreement With Studios and Streamers, Union Says  —  In a significant development that could bring an end to a historic writers' strike, the union and the Alliance of Motion Picture and Television Producers announced a provisional deal on Sunday.",
    "url": "https://www.hollywoodreporter.com/business/business-news/writers-guild-deal-reached-studios-end-of-strike-1235403981/"
  },
  {
    "text": "Hollywood screenwriters and studios reach tentative deal to resolve strike  —  The writers walkout started nearly 150 days ago, bringing the film and television industry to a standstill.  —  The Writers Guild of America and Hollywood's top media companies reached a tentative agreement Sunday … ",
    "url": "https://www.nbcnews.com/pop-culture/pop-culture-news/hollywood-screenwriters-studios-reach-tentative-deal-resolve-strike-rcna107963"
  },
  {
    "text": "Playbook: How McCarthy is angling to survive the week  —  Presented by With help from Eli Okun and Garrett Ross  —  DRIVING THE DAY  —  ONE STRIKE DOWN?  — “Writers Guild Reaches Tentative Agreement With Studios and Streamers,” by the Hollywood Reporter's Katie Kilkenny",
    "url": "https://www.politico.com/newsletters/playbook/2023/09/25/how-mccarthy-is-angling-to-survive-the-week-00117882"
  },
  {
    "text": "Trump Trials: The Waiting Game  —  Welcome back to The Trump Trials, our weekly effort to keep readers up to date on the many criminal cases the 45th president is fighting in federal and state courts.  —  Let's dig in:  —  What's ahead  —  Donald Trump's lawyers have until Monday … ",
    "url": "https://www.washingtonpost.com/national-security/2023/09/24/trump-trials-updates-latest-news/"
  },
  {
    "text": "Trump has a second-term agenda, and it's more terrifying than ever  —  Former President Trump is on the campaign trail again, and most of the attention he's getting is for bare-knuckled attacks on his chief opponents, President Biden (whom he derides as “Crooked Joe\") and Florida Gov. Ron DeSantis … ",
    "url": "https://www.latimes.com/politics/story/2023-09-24/mcmanus-column-trump-second-term-agenda"
  },
  {
    "text": "GOP donor wants his money back after candidate hires Corey Lewandowski  —  An alleged unwanted advance causes ripples in Louisiana's gubernatorial primary two years later.  —  John Odom, a major Republican donor, has been a top backer of Louisiana gubernatorial candidate Jeff Landry.",
    "url": "https://www.politico.com/news/2023/09/25/john-odom-jeff-landry-corey-lewandowski-00117843"
  },
  {
    "text": "Big GOP donors hoped for an alternative to Trump.  Now some are giving up.  —  The number of big-money donors giving to super PACs focused on the GOP primary is down from 2016.  —  Top Republican donors shopping for a candidate not named Donald Trump had high hopes that Ron DeSantis would be their savior.",
    "url": "https://www.politico.com/news/2023/09/25/who-wants-to-get-involved-and-waste-money-some-gop-donors-give-up-on-finding-an-alternative-to-trump-00117772"
  },
  {
    "text": "Zelensky and Trudeau Give Soldier Who Reportedly Fought for Nazi Germany a Standing Ovation  —  The Canadian parliament, Prime Minister Justin Trudeau and Ukrainian President Volodymyr Zelensky have been reported to have given a standing ovation to a reported former member of a Nazi military division.",
    "url": "https://www.breitbart.com/europe/2023/09/24/zelensky-and-trudeau-give-soldier-who-reportedly-fought-for-nazi-germany-a-standing-ovation/"
  },
  {
    "text": "California Dem calls McCarthy ‘a spectator speaker’  —  “He may have the title, but Donald Trump and Marjorie Taylor Greene and Matt Gaetz, they all share the job,” Eric Swalwell said.  —  Kevin McCarthy may have the title of House speaker but there are other Republicans holding the reins … ",
    "url": "https://www.politico.com/news/2023/09/24/swalwell-mccarthy-spectator-speaker-00117841"
  },
  {
    "text": "Menendez will hold press conference on Monday  —  U.S. Senator Bob Menendez will hold a press conference on Monday morning in Hudson County, where he grew up and where he launched his political career as a 20-year-old school board member, making his first public comments since his indictment on federal corruption charges on Friday.",
    "url": "https://newjerseyglobe.com/congress/menendez-will-hold-press-conference-on-monday/"
  },
  {
    "text": "Marjorie Taylor Greene Tweets Hanukkah Menorah Image for Yom Kippur  —  WRONG HOLIDAY!  —  Rep. Marjorie Taylor Greene (R-GA) is getting roasted on Twitter (now known as X) after posting a Yom Kippur message featuring an image of a Hanukkah menorah.  She swiftly deleted the post without … ",
    "url": "https://www.thedailybeast.com/rep-marjorie-taylor-greene-tweets-hannukah-menorah-image-for-yom-kippur"
  },
  {
    "text": "GOP Rep Who Pushes ‘Traditional Values’ Is Accused of Affair With Lobbyist  —  SPLITSVILLE  —  Melody Duncan, wife of Rep. Jeff Duncan (R-SC), filed for a divorce on Friday, citing her husband's multiple alleged affairs and a particular mistress she identified as Liz Williams … ",
    "url": "https://www.thedailybeast.com/gop-rep-jeff-duncan-accused-of-multiple-affairs-while-pushing-traditional-values"
  },
  {
    "text": "You've Persuaded Us Already  —  When it comes to the idea that conservatism has embraced fascism and supremacy, nobody is more persuasive than conservatives themselves.  An essay on bullies and the margins of permission in the USA.  —  In Missouri, a state Senator who's running for governor … ",
    "url": "https://armoxon.substack.com/p/youve-persuaded-us-already"
  },
  {
    "text": "Yes, there was global warming in prehistoric times.  But nothing in millions of years compares with what we see today  —  “The climate is always changing!”  So goes a popular refrain from climate deniers who continue to claim that there's nothing special about this particular moment.",
    "url": "https://www.latimes.com/opinion/story/2023-09-24/climate-change-fossil-fuels-global-warming-rate"
  },
  {
    "text": "After Florida restricts Black history, churches step up to teach it  —  MIAMI — They filed into the pews one after the other on a sweltering Wednesday night, clutching Bibles and notepads, ready to learn at church what they no longer trusted would be taught at school.",
    "url": "https://www.washingtonpost.com/nation/2023/09/24/florida-black-history-churches-teaching/"
  }
]