[
  {
    "text": "DOGE Plans to Rebuild SSA Code Base in Months, Risking Benefits and System Collapse  —  Social Security systems contain tens of millions of lines of code written in COBOL, an archaic programming language.  Safely rewriting that code would take years—DOGE wants it done in months.",
    "url": "https://www.wired.com/story/doge-rebuild-social-security-administration-cobol-benefits/"
  },
  {
    "text": "Trump Commutes Ozy Media Founder's Sentence Just Before His Surrender  —  Carlos Watson, who started the now-defunct digital media company, had been sentenced to almost 10 years in prison for trying to defraud investors and lenders.  —  President Trump on Friday commuted the sentence of Carlos Watson … ",
    "url": "https://www.nytimes.com/2025/03/28/business/carlos-watson-ozy-media-trump.html"
  },
  {
    "text": "Trump Administration Live Updates: Major Law Firm Makes Deal to Avoid Punishing Order, President Says  —  Where Things Stand  — Law firm deal: President Trump announced that the major law firm of Skadden, Arps, Slate, Meagher & Flom had agreed to provide $100 million in pro bono work … ",
    "url": "https://www.nytimes.com/live/2025/03/28/us/trump-greenland-vance-news"
  },
  {
    "text": "USAID terminates nearly all its remaining employees  —  The Trump administration is terminating nearly all of the remaining 900 employees of the United States Agency for International Development, in a final reduction-in-force.  —  Virtually no one will be spared, not even political appointees … ",
    "url": "https://www.npr.org/sections/goats-and-soda/2025/03/28/g-s1-56968/usaid-terminates-nearly-all-its-remaining-employees"
  },
  {
    "text": "Vance, citing threats from Russia and China, urges Greenland to ‘cut a deal’ with the U.S.  —  “When the president says 'We've got to have Greenland,' he's saying this island is not safe,” the vice president said.  —  Vice President JD Vance on Friday did not rule out using military action … ",
    "url": "https://www.politico.com/news/2025/03/28/vance-greenland-military-deal-00005407"
  },
  {
    "text": "Trump moves to strip unionization rights from most federal workers  —  It's the latest effort in his drive to disempower the federal bureaucracy.  —  President Donald Trump is trying to revoke collective bargaining rights from most federal employees — the latest move in his aggressive campaign to weaken the federal workforce.",
    "url": "https://www.politico.com/news/2025/03/28/union-rights-federal-workers-donald-trump-00257010"
  },
  {
    "text": "Musk changes reason for visiting Wisconsin to hand out $2 million ahead of Supreme Court election  —  Wisconsin's Democratic attorney general asked a court on Friday to block billionaire Elon Musk from handing out $1 million checks to voters this weekend, just two days before the state's hotly contested Supreme Court was to be decided.",
    "url": "https://apnews.com/article/wisconsin-supreme-court-elon-musk-trump-d75807980ac311b87606fb4ec58cc466"
  },
  {
    "text": "Dow sinks 600 points.  Stocks are on track for their worst quarter since 2023  —  New York CNN  —  US stocks were lower Friday as investors digested souring consumer sentiment and inflation data that showed an uptick in one of the Federal Reserve's key gauges, underscoring the delicate state … ",
    "url": "https://cnn.com/2025/03/28/investing/us-stocks-tariff-uncertainty-volatility"
  },
  {
    "text": "Federal judge blocks Trump from dismantling Consumer Financial Protection Bureau  —  A federal judge agreed Friday to block the Trump administration from dismantling the Consumer Financial Protection Bureau, an agency that was targeted for mass firings before the court's intervention.",
    "url": "https://apnews.com/article/trump-consumer-financial-protection-bureau-d091cfb0794813e40098a40e00a6d1c2"
  },
  {
    "text": "What is the Smithsonian, and why is President Trump unhappy with it?  —  President Donald Trump's executive order titled “Restoring Truth and Sanity to American History” targets the Smithsonian Institution — which has, he contends, “come under the influence of a divisive, race-centered ideology.”",
    "url": "https://apnews.com/article/smithsonian-trump-executive-order-e0132b9c865901ec702329b1f6e0c35e"
  },
  {
    "text": "Appeals court clears way for Trump to fire leaders of ‘independent’ federal agencies  —  The ruling is a victory for Trump's effort to control regulatory bodies that Congress intended to operate with some independence.  —  A federal appeals court has cleared the way for President Donald Trump … ",
    "url": "https://www.politico.com/news/2025/03/28/appeals-court-ruling-trump-independent-federal-agencies-00258300"
  },
  {
    "text": "Trump admin offers Voice of America employees buyouts as judge blocks it from being shut down  —  Just as a federal judge issued an order blocking the administration's efforts to dismantle the broadcaster, U.S. Agency for Global Media staffers received an email offering them a renewed opportunity … ",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/voice-of-america-trump-restraining-order-b2723614.html"
  },
  {
    "text": "Israeli officials furious that Signal group chat exposed intelligence, sources say  —  Washington — Israeli officials are furious over the Signal chat leak involving senior Trump administration officials because it included sensitive intelligence Israel provided to the U.S. from a human intelligence source … ",
    "url": "https://www.cbsnews.com/news/israeli-officials-signal-texts-exposed-intelligence-sources-say/"
  },
  {
    "text": "RFK Jr. to gut vaccine promotion and HIV prevention office, sources say  —  The entire staff of the federal government's Office of Infectious Disease and HIV/AIDS Policy is expected to be laid off, multiple federal health officials told CBS News Friday.  The moves are part of a broader … ",
    "url": "https://www.cbsnews.com/news/rfk-jr-to-gut-vaccine-promotion-and-hiv-prevention-office-sources-say/"
  },
  {
    "text": "Musk's xAI buys Musk's X social media platform for $33 billion  —  Elon Musk's xAI artificial intelligence firm has acquired Musk's X, the social media outfit formerly known as Twitter for $33 billion.  —  The all-stock deal announced on Friday consolidates two of Musk's multiple portfolio companies … ",
    "url": "https://www.reuters.com/markets/deals/musks-xai-buys-social-media-platform-x-45-billion-2025-03-28/"
  },
  {
    "text": "Collision warning sounds in cockpit of Delta plane due to close call with Air Force jet near Reagan National Airport  —  A close call between a Delta Air Lines Airbus A319 taking off from Ronald Reagan Washington National Airport and a US Air Force T-38 jet, often used by the military for training … ",
    "url": "https://cnn.com/2025/03/28/us/delta-military-jet-close-call-dca"
  },
  {
    "text": "Elon Musk stepping down from DOGE in May. Here's what he said  —  Elon Musk may be getting out of DOGE.  —  On Thursday, Musk said he plans to step down from his role in Donald Trump's administration this spring.  —  The head of Tesla and X owner said he plans on stepping down in May during … ",
    "url": "https://www.yahoo.com/news/elon-musk-stepping-down-doge-155302029.html"
  },
  {
    "text": "Russian medical researcher at Harvard, who protested the Ukraine war, detained by ICE  —  Kseniia Petrova's attorney said her previous arrest in Russia and social media activity “will almost certainly ensure a nice, hefty jail sentence for her” if she is deported back.",
    "url": "https://www.nbcnews.com/news/us-news/russian-medical-researcher-harvard-protested-ukraine-war-detained-ice-rcna198528"
  },
  {
    "text": "This Is Just Dumb  —  It's not the hypocrisy that bothers me; it's the stupidity.  We're all shocked — shocked! — that President Trump and his team don't actually care about protecting classified information or federal record retention laws.  But we knew that already.",
    "url": "https://www.nytimes.com/2025/03/28/opinion/trump-hegseth-signal-chat.html?unlocked_article_code=1.7U4.TdAd.85izsorPgz31&smid=tw-share"
  },
  {
    "text": "Hegseth's younger brother is serving in a key role inside the Pentagon  —  Defense Secretary Pete Hegseth's younger brother is serving in a key position inside the Pentagon as a Department of Homeland Security liaison and senior adviser, Hegseth's office confirmed.",
    "url": "https://www.defensenews.com/pentagon/2025/03/28/hegseths-younger-brother-is-serving-in-a-key-role-inside-the-pentagon/"
  },
  {
    "text": "Strong earthquake strikes central Myanmar, panic in Bangkok  —  A powerful earthquake killed more than 140 people in Myanmar on Friday, authorities said, toppling buildings and wrecking infrastructure across a wide area, including a skyscraper under construction in neighbouring Thailand.",
    "url": "https://www.reuters.com/world/asia-pacific/strong-earthquake-central-myanmar-panic-bangkok-2025-03-28/"
  },
  {
    "text": "Secretary of Defense Pete Hegseth's ‘kafir’ tattoo draws criticism.  What does it mean?  —  Hegseth has previously attracted attention over his many tattoos.  This time, new photos show that he has the word ‘kafir’ on his upper arm.  What does that mean and what do critics say it's indicating?",
    "url": "https://www.usatoday.com/story/news/politics/2025/03/27/pete-hegseth-tattoo-kafir/82696572007/"
  },
  {
    "text": "The CDC Buried a Measles Forecast That Stressed the Need for Vaccinations  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up to receive our biggest stories as soon as they're published.  —  Leaders at the Centers for Disease Control and Prevention ordered staff … ",
    "url": "https://www.propublica.org/article/measles-vaccine-rfk-cdc-report"
  },
  {
    "text": "Judge releases detained Venezuelan couple with temporary protected status  —  The judge said the detention of the couple was baseless and unlawful.",
    "url": "https://www.washingtonpost.com/dc-md-va/2025/03/28/judge-releases-detained-venezuelans-temporary-protected-status/"
  },
  {
    "text": "Secretary of State Marco Rubio Remarks to the Press  —  SECRETARY RUBIO:  Grant?  —  QUESTION:  The Ukrainian children who —  SECRETARY RUBIO:  Oh, the data.  The data is secured.  We secured the data.  We'll transfer it to the appropriate party.  We've ensured that.",
    "url": "https://www.state.gov/secretary-of-state-marco-rubio-remarks-to-the-press-3/"
  },
  {
    "text": "'If We Don't Get Our S—t Together, Then We Are Going to Be in a Permanent Minority'  —  It's been months since Democrats suffered a devastating defeat at the polls.  For all the talk about the party's need for change, few seem actually willing to make the leap.",
    "url": "https://www.politico.com/news/magazine/2025/03/28/2024-election-democrats-kamala-harris-00230631"
  }
]