[
  {
    "text": "Trump wants Jordan and Egypt to accept more Palestinian refugees and floats plan to ‘clean out’ Gaza  —  President Donald Trump said Saturday he would like to see Jordan, Egypt and other Arab nations increase the number of Palestinian refugees they are accepting from the Gaza Strip … ",
    "url": "https://apnews.com/article/trump-biden-israel-bomb-gaza-hamas-war-023b36984c6116c128b5e47f117bba2a"
  },
  {
    "text": "Trump suggests Palestinians leave Gaza and ‘we just clean out’ territory  —  US president says he wants people to move to neighbouring nations, after resuming shipments of 2,000lb bombs to Israel  —  Donald Trump has suggested large numbers of Palestinians should leave Gaza to “just clean out” … ",
    "url": "https://www.theguardian.com/us-news/2025/jan/26/trump-resumes-sending-2000-pound-bombs-to-israel-undoing-biden-pause"
  },
  {
    "text": "Graham says ‘a good chance’ Supreme Court sides with Trump on birthright citizenship  —  Sen. Lindsey Graham (R-S.C.) said he believes there is a “good chance” that the Supreme Court sides with President Trump on the issue of birthright citizenship.  —  Graham joined NBC's “Meet the Press” … ",
    "url": "https://thehill.com/regulation/court-battles/5107286-graham-birthright-citizenship/"
  },
  {
    "text": "Scoop: How Trump's “black box” limits outside influences … - Trump jammed through confirmation of Defense Secretary Pete Hegseth, fired at least a dozen inspectors general, proposed killing FEMA, and scolded LA officials. … - It's stunning to veterans of Trump's first West Wing.",
    "url": "https://www.axios.com/2025/01/26/trump-white-house-inner-circle-influence"
  },
  {
    "text": "Sen. Lindsey Graham says he thinks Trump pardoning violent Jan. 6 defendants was ‘a mistake’  —  In an interview on NBC News' “Meet the Press,” GOP Sen. Lindsey Graham said of the president's decision to pardon those convicted of violent crimes: “I think that's a mistake.”",
    "url": "https://www.nbcnews.com/politics/donald-trump/lindsey-graham-trump-pardoning-violent-jan-6-defendant-mistake-rcna189322"
  },
  {
    "text": "Trump wiped January 6 convicts' records clean.  Now his DOJ is wiping evidence of rioters' crimes from the internet  —  As President Donald Trump this week sought to rewrite the history of his supporters' attack on the US Capitol, a database detailing the vast array of criminal charges … ",
    "url": "https://www.cnn.com/2025/01/25/politics/january-6-justice-department-database/"
  },
  {
    "text": "‘Look in the Mirror’: New Catholic JD Vance Lectures Church Leaders on Faith  —  Vance, who converted to the Catholic Church five years ago, called on a group of bishops to “do better” after they criticized the White House's immigration policies.",
    "url": "https://www.thedailybeast.com/look-in-the-mirror-vance-preaches-to-bishops-on-how-to-be-catholic/"
  },
  {
    "text": "South Korea's Impeached Leader Is Indicted on Insurrection Charges  —  President Yoon Suk Yeol will stand trial along with his former defense minister and others who participated in his short-lived imposition of martial law.  —  South Korea's impeached and arrested president, Yoon Suk Yeol … ",
    "url": "https://www.nytimes.com/2025/01/26/world/asia/south-korea-yoon-indicted-martial-law.html?unlocked_article_code=1.sE4.ff0C.GsJc_fv1QiPE&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Trump's gutting of federal DEI programs will hit rural poor communities  —  Just hours after his swearing-in this week, as a raft of executive orders was presented and signed at the Resolute Desk in the Oval Office, President Donald Trump authorized action to end “radical and wasteful government DEI programs and preferencing.”",
    "url": "https://www.cnn.com/2025/01/26/climate/trump-environmental-justice-rural-poor-communities/"
  },
  {
    "text": "White House tells Republicans to get behind Trump's nominees — or face political ‘consequences’  —  More Trump nominees with potentially rocky paths to confirmation face hearings in the Senate this week, including Tulsi Gabbard, Robert F. Kennedy Jr. and Kash Patel.",
    "url": "https://www.nbcnews.com/politics/donald-trump/white-house-republicans-trump-nominees-political-consequences-rcna189288"
  },
  {
    "text": "Colombia's President Says He Will Not Accept U.S. Deportation Flights  —  Gustavo Petro said on X that the United States should not treat Colombian migrants as criminals and needs to establish a dignified protocol before his country will allow their return.  —  Colombia will not accept … ",
    "url": "https://www.nytimes.com/2025/01/26/world/americas/colombia-us-deportation-flights.html"
  },
  {
    "text": "SNL comedian uses five words to explain why ‘Elon Musk is not a Nazi’  —  The billionaire was accused of making a fascist salute during an inauguration celebration for Donald Trump  —  Your support helps us to tell the story  —  From reproductive rights to climate change to Big Tech … ",
    "url": "https://www.independent.co.uk/arts-entertainment/films/news/snl-elon-musk-nazi-salute-b2686485.html"
  },
  {
    "text": "Musk tells far-right Germany party “past guilt” gets too much focus … - Musk in 2023 faced backlash for endorsing an antisemitic post, as 164 Jewish rabbis and activists upped their calls to companies to stop advertising on the Musk-owned X.  — He's also failed to stop the posting or amplification of pro-Nazi content on X.",
    "url": "https://www.axios.com/2025/01/26/musk-germany-afd-party-past-guilt-holocaust"
  },
  {
    "text": "Trump says he believes US will ‘get Greenland’  —  President Donald Trump has said he believes the US will gain control of Greenland, after showing renewed interest in acquiring the autonomous Danish territory in recent weeks.  —  “I think we're going to have it,” he told reporters on Air Force … ",
    "url": "https://www.bbc.com/news/articles/crkezj07rzro"
  },
  {
    "text": "‘People Will Be Shocked’: Trump Tests the Boundaries of the Presidency  —  Even more than in his first term, President Trump has mounted a fundamental challenge to the norms and expectations of what a president can and should do.  —  On his first full day back in the White House … ",
    "url": "https://www.nytimes.com/2025/01/26/us/politics/trump-boundaries-presidency.html"
  },
  {
    "text": "In 2024 Elections, Most Races Were Over Before They Started  —  A New York Times analysis shows new maps stifled partisan competition for seats in the House of Representatives and state legislatures.  —  Competition is an endangered species in legislative elections.",
    "url": "https://www.nytimes.com/2025/01/26/us/politics/2024-elections-congress-state-redistricting.html"
  },
  {
    "text": "The 12 Democrats who make the most sense for 2028  —  There's a vacuum atop an adrift Democratic Party.  Here's who could fill it.  —  Democrats are adrift.  —  The 2024 election was closer than many people realize — and a lot closer than President Donald Trump claims.",
    "url": "https://www.washingtonpost.com/politics/2025/01/25/2028-democrats-whitmer-shapiro-harris-buttigieg/"
  },
  {
    "text": "Trump's executive actions have more muscle this time around, but many are just posturing  —  The president's early actions are already enacting sweeping changes across the federal government.  But not all of them are likely to result in tangible change.  —  President Donald Trump's first week … ",
    "url": "https://www.politico.com/news/2025/01/26/trump-orders-tangible-posturing-006590"
  },
  {
    "text": "Transcript: Vice President JD Vance on “Face the Nation with Margaret Brennan,” Jan. 26, 2025  —  The following is the full transcript of an interview with Vice President JD Vance on “Face the Nation with Margaret Brennan” that aired on Jan. 26, 2025.  —  MARGARET BRENNAN: Mr. Vice President, if you're ready, we'll dive right in.",
    "url": "https://www.cbsnews.com/news/jd-vance-transcript-face-the-nation-01-26-2025/"
  },
  {
    "text": "‘I am terrified’: Workers describe the dark mood inside federal agencies  —  “I would love to leave, but I don't know where I'd go,” said one staffer.  —  President Donald Trump's executive orders targeting the federal workforce have injected a fresh wave of anxiety among employees across the bureaucracy … ",
    "url": "https://www.politico.com/news/2025/01/25/federal-workers-trump-dei-00200588"
  },
  {
    "text": "Trump's federal DEI purge puts hundreds on leave, nixes $420M in contracts  —  FIRST ON FOX: President Donald Trump's executive order terminating all federal diversity, equity, and inclusion (DEI) programs has already sidelined 395 government bureaucrats, a senior administration official told Fox News Digital.",
    "url": "https://www.foxnews.com/politics/trumps-termination-federal-dei-programs-leaves-395-workers-leave-420-million-contracts-canceled"
  }
]