[
  {
    "text": "GOP tensions explode after McCarthy bows out of speaker race  —  House Republicans were distraught, furious and concerned for the future of their party after Rep. Kevin McCarthy (R-Calif.) announced he won't run for speaker again after being ousted on Tuesday.",
    "url": "https://www.axios.com/2023/10/04/house-republicans-kevin-mccarthy-removal-speaker"
  },
  {
    "text": "The House GOP Is a Failed State  —  Kevin McCarthy's ouster is dramatic evidence, if redundant, about the state of the modern GOP.  —  At the start, Kevin McCarthy's speakership was effectively an optical illusion.  At the end, it was an exercise in self-abasement.  Francis Chung/POLITICO",
    "url": "https://www.politico.com/news/magazine/2023/10/03/house-gop-failed-state-00119842"
  },
  {
    "text": "'He's about clicks': Florida Republicans furious at Gaetz  —  They called him divisive and an attention-seeker.  —  MIAMI — Florida's congressional Republicans are done with Matt Gaetz.  —  They left the House chamber last night furious after Gaetz led seven other GOP members … ",
    "url": "https://www.politico.com/news/2023/10/04/florida-republicans-matt-gaetz-furious-00119865"
  },
  {
    "text": "House bipartisan caucus risks collapse after McCarthy ouster … The Republicans say he was punished for “doing the right thing” after advancing a stopgap funding bill on a bipartisan basis.  — Frustrated members said that Democrats in the group, which is aimed at finding bipartisan solutions … ",
    "url": "https://www.axios.com/2023/10/03/problem-solvers-caucus-mccarthy-removal-speaker"
  },
  {
    "text": "Kevin McCarthy's embarrassing lesson: MAGA torches everything it touches — and will destroy itself  —  Democrats get it: Don't get in the way when your opponents are self-destructing  —  In the wake of Rep. Matt Gaetz, R-Fla., moving to vacate Rep. Kevin McCarthy, R-Calif. … ",
    "url": "https://www.salon.com/2023/10/04/kevin-mccarthys-embarrassing-lesson-maga-torches-everything-it-touches--and-will-destroy-itself/"
  },
  {
    "text": "As McCarthy tumbled toward defeat, Trump did not defend his speakership  —  Trump's limited support for the man he famously called ‘my Kevin’ encapsulated a relationship that has ebbed and flowed over the years  —  As Kevin McCarthy battled this week to keep the job he would eventually lose … ",
    "url": "https://www.washingtonpost.com/politics/2023/10/04/trump-mccarthy-relationship/"
  },
  {
    "text": "The rudderless GOP careens toward 2024  —  Kevin McCarthy's undoing underscores a bigger problem — the inability to govern itself — that risks imperiling the party's chances in 2024.  —  There's no House speaker, Republicans are tearing each other to shreds over Kevin McCarthy's ouster … ",
    "url": "https://www.politico.com/news/2023/10/04/republican-party-mccarthy-2024-00119802"
  },
  {
    "text": "Kevin McCarthy is GOP incompetence made flesh  —  No Republican equipped to be speaker would want the job in the first place. … Republican Kevin McCarthy became the first House Speaker to be removed midterm by his own caucus on Tuesday.  He quickly announced that he would not run again; his brief speakership is over.",
    "url": "https://www.publicnotice.co/p/kevin-mccarthy-matt-gaetz-feud-freedom-caucus"
  },
  {
    "text": "McHenry ordered Pelosi to leave her Capitol hideaway office by Wednesday  —  The former speaker blasted the move as a “sharp departure from tradition.”",
    "url": "https://www.politico.com/live-updates/2023/10/03/congress/mchenry-pelosi-hideaway-office-house-remove-00119803"
  },
  {
    "text": "Nikki Haley vaults to second place in New Hampshire in new GOP primary poll  —  Today's Suffolk University/Boston Globe/USA TODAY poll (yes, that's a mouthful) will be touted by Nikki Haley's campaign.  She's rocketed into second place with the support of 19% of likely New Hampshire Republican Primary voters … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2023/10/04/suffolk-boston-globe-usa-today-poll/71050447007/"
  },
  {
    "text": "Giuliani's Drinking, Long a Fraught Subject, Has Trump Prosecutors' Attention  —  The former mayor's drinking has become an investigative subplot in Donald Trump's federal case over 2020 election interference.  But long before that, friends had grown deeply concerned.",
    "url": "https://www.nytimes.com/2023/10/04/us/politics/rudy-giuliani-drinking.html"
  },
  {
    "text": "Jordan becomes first to announce run for speaker  —  His candidacy will likely run right into Majority Leader Steve Scalise (R-La.), who is also considering a speakership bid and has worked to court conservatives.",
    "url": "https://www.politico.com/live-updates/2023/10/04/congress/jordain-officially-in-00119892"
  },
  {
    "text": "Exclusive: US will transfer weapons seized from Iran to Ukraine  —  The US will transfer thousands of seized Iranian weapons and rounds of ammunition to Ukraine, in a move that could help to alleviate some of the critical shortages facing the Ukrainian military as it awaits more money … ",
    "url": "https://www.cnn.com/2023/10/04/politics/us-iran-seized-weapons-ukraine/"
  },
  {
    "text": "Bob Menendez's wife hit and killed a man while driving on Bogota's Main Street in 2018  —  Nadine Arslanian Menendez, federally indicted in a bribery scheme with her husband, Sen. Bob Menendez, struck and killed a man while driving her Mercedes-Benz on Main Street in Bogota in December 2018.",
    "url": "https://www.northjersey.com/story/news/new-jersey/2023/10/04/bob-menendez-wife-car-accident-bogota-nj-police-indictment/71051427007/"
  },
  {
    "text": "FIREFIGHTERS RESPOND TO PLANE CRASH INVOLVING NEWBERG HOME  —  Shortly before 7 p.m., multiple callers to 911 reported seeing a small airplane spiraling toward the ground and crashing near North Cedar Street in Newberg.  Firefighters were dispatched to the scene and located the airplane … ",
    "url": "https://www.facebook.com/TualatinValleyFireandRescue/posts/pfbid0uLQ5RNk52X3AXYbjN84M4Kq74jZ8UyeShjjBoCmWvmQVx3gyLnUFNnoMSG5p8jDPl"
  },
  {
    "text": "Right-Wing Brit Broadcaster Arrested Over Rumble Rant  —  Laurence Fox's arrest comes after he went on an unrelated, on-air sexist tirade that got him fired.  —  Right-wing British political activist and actor Laurence Fox was arrested Wednesday on suspicion of “conspiring to commit criminal damage” … ",
    "url": "https://www.thedailybeast.com/right-wing-brit-broadcaster-laurence-fox-arrested-over-rumble-rant"
  },
  {
    "text": "Private sector job growth fell well below expectations: ADP  —  A key employment measurement for the U.S. economy came in well below expectations for September, indicating some labor market weakness amid other signs of strength.  —  The U.S. economy added 89,000 private-sector jobs in September, according to payroll firm ADP.",
    "url": "https://thehill.com/business/4237832-private-sector-job-growth-fell-well-below-expectations-adp/"
  }
]