[
  {
    "text": "Fetterman: Kash Patel Told Me He Won't Go After Trump's ‘Enemies List’  —  The senator said that Democrats should “chill out” about Trump  —  Sen. John Fetterman said that Kash Patel, Donald Trump's nominee to lead the FBI, assured him he will not be targeting Trump's enemies.",
    "url": "https://www.rollingstone.com/politics/politics-news/john-fetterman-kash-patel-trump-enemies-list-1235215270/"
  },
  {
    "text": "Trump signals plans to use all levers of power against the media  —  Press freedom advocates say they fear that the second Trump administration will ramp up pressure on journalists, in keeping with the president-elect's combative rhetoric.  —  For many years, Donald Trump repeatedly threatened … ",
    "url": "https://www.washingtonpost.com/politics/2024/12/22/trump-abc-news-settlement-george-stephanopoulos/"
  },
  {
    "text": "Trump suggests Panama Canal be returned to US control  —  President-elect Trump on Sunday again took on the matter of the Panama Canal, suggesting to a conference of his supporters that it be returned to U.S. control in a remarkable suggestion to push a sovereign country to cede territory.",
    "url": "https://thehill.com/homenews/administration/5052795-trump-suggests-panama-canal-be-returned-to-us-control/"
  },
  {
    "text": "Panama's Leader Takes Up Feud With Trump Over Control of Canal  —  Panama's president rebuffed Donald Trump's threat to reimpose US control over the Panama Canal, saying its shipping tolls aren't inflated and that sovereignty over the waterway isn't negotiable.",
    "url": "https://www.bloomberg.com/news/articles/2024-12-22/panama-s-leader-takes-up-feud-with-trump-over-canal-s-control"
  },
  {
    "text": "Absent GOP Congresswoman Found in Assisted Living Home: Report  —  Rep. Kay Granger has not cast a single vote in Congress since late July  —  Republican Rep. Kay Granger, who has missed 100 percent of votes in the House since July 24, has been in an assisted living and memory care home, according to a report.",
    "url": "https://www.rollingstone.com/politics/politics-news/kay-granger-assisted-living-memory-care-report-1235214921/"
  },
  {
    "text": "Retiring U.S. Rep. Kay Granger experiencing ‘dementia issues,’ per family  —  Retiring U.S. Rep. Kay Granger, R-Fort Worth, has missed votes in Congress since the summer and her son said she has been “having some dementia issues late in the year.”  The last time the 81-year-old congresswoman cast … ",
    "url": "https://www.dallasnews.com/news/politics/2024/12/22/republican-rep-kay-granger-texas-missed-votes-dementia/"
  },
  {
    "text": "Transcript: Rep. Tony Gonzales on “Face the Nation with Margaret Brennan,” Dec. 22, 2024  —  The following is a transcript of an interview with Rep. Tony Gonzales, Republican of Texas, on “Face the Nation with Margaret Brennan” that aired on Dec. 22, 2024.  —  MARGARET BRENNAN: Good morning and welcome to Face the Nation.",
    "url": "https://www.cbsnews.com/news/tony-gonzales-texas-republican-face-the-nation-transcript/"
  },
  {
    "text": "Bluesky finds with growth comes growing pains — and bots  —  Bluesky has seen its user base soar since the U.S. presidential election, boosted by people seeking refuge from Elon Musk's X, which they view as increasingly leaning too far to the right given its owner's support of President-elect Donald Trump … ",
    "url": "https://apnews.com/article/bluesky-growth-users-bots-misinformation-ce9df3b9166ec1ba36f3d5278ff60dcb"
  },
  {
    "text": "Two US Navy pilots shot down over Red Sea in apparent ‘friendly fire’ incident, US military says  —  Two U.S. Navy pilots were shot down Sunday over the Red Sea in an apparent “friendly fire” incident, the U.S military said, marking the most serious incident to threaten troops in over a year of America targeting Yemen's Houthi rebels.",
    "url": "https://apnews.com/article/mideast-wars-yemen-us-navy-pilots-houthi-95a792daae3b0120186bfc6c66e1b6fe"
  },
  {
    "text": "Letter Calling for Tracking People of Color Circulates in an Oregon County  —  The letter, distributed in Lincoln County, Ore., tells community members to report people who may be undocumented, the sheriff's office said.  —  A letter circulating in a coastal county in rural Oregon encourages … ",
    "url": "https://www.nytimes.com/2024/12/22/us/oregon-anti-immigrant-letter-investigation.html"
  },
  {
    "text": "Donald Trump's transition team seeks to pull US out of WHO ‘on day one’  —  Swift exit would remove global health body's main source of funds and damage its ability to tackle emergencies  —  Donald Trump's transition team is pushing to pull the US out of the World Health Organization … ",
    "url": "https://www.ft.com/content/e6061ed5-2703-4b8a-9948-a557aaaf52c2"
  },
  {
    "text": "Trump Previews Second Term in Sprawling Speech to Conservative Conference  —  President-elect Donald J. Trump repeated false claims about immigration and the border, slammed diversity initiatives and discussed the Panama Canal in the 90-minute address.  —  President-elect Donald J. Trump delivered … ",
    "url": "https://www.nytimes.com/2024/12/22/us/politics/trump-speech-turning-point-arizona.html"
  },
  {
    "text": "Dear Federal Workers: Don't Quit  —  Our democracy needs federal workers more than ever.  —  Over the next few weeks, U.S. civil servants will spend the holidays wrestling with a tough choice: Stay in your jobs and work for a president who openly disdains you and might try to fire you — or quit.",
    "url": "https://www.politico.com/news/magazine/2024/12/22/dear-federal-workers-dont-quit-00195750"
  },
  {
    "text": "Ivanka Trump is done with politics and says she isn't coming back  —  For Ivanka Trump's entire adult life, she worked for her father.  —  When Donald Trump was a real estate mogul, she was designing his next hotel.  When he was on a reality TV show, she was in his television boardroom.",
    "url": "https://www.cnn.com/2024/12/22/politics/ivanka-trump-out-of-politics/"
  }
]