[
  {
    "text": "2 Democrats speak out against transgender athletes after Trump win  —  Two House Democrats said they oppose transgender athletes competing in women's sports in the immediate aftermath of President-elect Trump's decisive victory over Vice President Harris, shifting right of their previous policy positions … ",
    "url": "https://thehill.com/homenews/house/4979665-democrats-transgender-athletes/"
  },
  {
    "text": "Why Trump won — 9 takeaways from the 2024 election  —  What happened in the 2024 election was a political earthquake.  —  Former President Trump not only won in the Electoral College, but he won so big that he expanded his coalition with historic demographic shifts.",
    "url": "https://www.npr.org/2024/11/08/g-s1-33274/2024-election-how-trump-won-takeaways"
  },
  {
    "text": "Harris Tried to Win Over Republicans.  Democratic Support Collapsed Instead  —  The vice president did not pull Republicans from Trump, and the percentage of voters identifying as Democrat declined, according to exit polls  —  During the final weeks of the 2024 campaign … ",
    "url": "https://www.rollingstone.com/politics/politics-features/harris-republican-appeal-democratic-support-collapse-1235156634/"
  },
  {
    "text": "Trump says there's ‘no price tag’ for his mass deportation plan  —  In an exclusive interview with NBC News, Trump talked about his campaign promise to carry out the largest mass deportation of immigrants in U.S. history.  —  President-elect Donald Trump told NBC News on Thursday … ",
    "url": "https://www.nbcnews.com/politics/2024-election/trump-says-no-price-tag-mass-deportation-plan-rcna179178"
  },
  {
    "text": "What Trump's MAGA allies have planned for immigration in Project 2025 … - Trump repeatedly claimed during his campaign that he knew nothing about the right-wing policy map, despite the fact that the Heritage Foundation-backed plan was written by his close allies and supported by his top advisers.",
    "url": "https://www.axios.com/2024/11/08/trump-maga-immigration-project-2025"
  },
  {
    "text": "Judge declares Biden immigration program for spouses of U.S. citizens illegal  —  A federal judge on Thursday struck down a Biden administration program that would allow unauthorized immigrants married to American citizens to get legal status and a streamlined path to U.S. citizenship, declaring the policy illegal.",
    "url": "https://www.cbsnews.com/news/judge-declares-biden-immigration-program-for-spouses-of-u-s-citizens-illegal/"
  },
  {
    "text": "Judge strikes down Biden program shielding immigrant spouses from deportation  —  A federal judge on Thursday struck down a Biden administration policy that aimed to ease a path to citizenship for some undocumented immigrants who are married to U.S. citizens.",
    "url": "https://www.npr.org/2024/11/08/g-s1-33370/judge-biden-program-immigrant-spouses-deportation"
  },
  {
    "text": "Donald Trump picks Susie Wiles to be chief of staff  —  A veteran of Florida politics, Wiles directed Trump's campaign to victory in the state in 2016.  —  President-elect Donald Trump has tapped his campaign senior adviser Susie Wiles as White House chief of staff.",
    "url": "https://www.politico.com/news/2024/11/07/donald-trump-susie-wiles-chief-of-staff-00188346"
  },
  {
    "text": "Why Democrats won't build their own Joe Rogan  —  Minutes after Donald Trump was declared the winner of the 2024 election, Dana White took the stage to thank the influencers who helped lead Trump to victory.  “I want to thank the Nelk Boys, Adin Ross, Theo Von, Bussin' With The Boys … ",
    "url": "https://www.usermag.co/p/why-democrats-wont-build-their-own"
  },
  {
    "text": "Colorado governor says tax cuts key to state's shift left  —  Colorado Gov. Jared Polis (D) said on Wednesday tax cuts are key to his state's shift to the left in the wake of President-elect Trump's win in the 2024 presidential election.  —  Republicans made gains in large portions of the U.S … ",
    "url": "https://thehill.com/homenews/campaign/4980033-colorado-governor-tax-cuts-key-states-shift-left/"
  },
  {
    "text": "Racist text messages target young African Americans post-election  —  Black college and high school students report receiving racist texts about being “selected to pick cotton at the nearest plantation.”  —  Federal, state, and local authorities are investigating the offensive messages that have been sent over the last two days.",
    "url": "https://www.npr.org/2024/11/07/g-s1-33340/racist-text-messages-african-americans-splc-fbi"
  },
  {
    "text": "Adams pledges to work with Trump on public safety, infrastructure  —  The mayor, a Democrat, said he can find common ground with “anyone and everyone.”  —  NEW YORK — Mayor Eric Adams spoke Wednesday with President-elect Donald Trump about working together on infrastructure … ",
    "url": "https://www.politico.com/news/2024/11/07/adams-pledges-to-work-with-trump-00188252"
  },
  {
    "text": "MAGA Launches Increasingly Horrific Attacks on Women After Trump Win  —  The immediate aftermath of Donald Trump's presidential election win is already a bad omen for women and minorities across the nation, who within less than 48 hours have found themselves the subjects of hate campaigns designed to belittle and marginalize them.",
    "url": "https://newrepublic.com/post/188159/donald-trump-maga-attacks-women"
  },
  {
    "text": "Democrats Need To Compete In The New Media Landscape — Or Keep Paying The Price  —  This is your TPM evening briefing.  —  As always happens after a bad election loss — and is compounded when that loss is sweeping, and to the man who launched a coup against the country — the losing side is in full panic mode.",
    "url": "https://talkingpointsmemo.com/where-things-stand/democrats-need-to-compete-in-the-new-media-landscape-or-keep-paying-the-price"
  },
  {
    "text": "The model exactly predicted the most likely election map  —  Before we get into the meat of today's newsletter, just a quick update on our plans.  Silver Bulletin, we hope, will have a long future.  But I'm thinking about things in a few different stages:  — Short term: We're treating next week … ",
    "url": "https://www.natesilver.net/p/the-model-exactly-predicted-the-most"
  },
  {
    "text": "Scoop: Trump dismissed Rick Scott as Senate GOP leader … - A senior Trump campaign official pushed back on Axios' reporting, saying Trump “hasn't weighed in on the leadership race and anyone who says differently is wrong.” … - Scott had signs at his campaign victory party on Tuesday that read … ",
    "url": "https://www.axios.com/2024/11/08/trump-rick-scott-senate-gop-leader-thune"
  },
  {
    "text": "Dem governor issues stark warning to Trump: ‘You come for my people, you come through me’  —  Gov. JB Pritzker says he is a ‘warrior’ for the people of Illinois  —  Democrat Illinois Gov. JB Pritzker issued a stark warning to President-elect Trump following his landmark victory … ",
    "url": "https://www.foxnews.com/politics/dem-governor-issues-stark-warning-trump-you-come-my-people-you-come-through-me"
  },
  {
    "text": "11/8/24 ☀️ AM:  —  House Republicans could be saddled with another tiny majority  —  Trump looms over Senate GOP leadership race  —  Hawley backs Cornyn for Senate GOP leader  —  Who's in line to lead the NRCC and DCCC  —  House Republicans could be saddled with another tiny majority",
    "url": "https://punchbowl.news/archive/11824-am/"
  },
  {
    "text": "After 248 years, America prepares for life under a king  —  It took only hours after a majority of Americans chose to return Donald Trump as a strongman-style president for the first billionaire supplicant to come forward on bended knee.  Amazon founder Jeff Bezos, the third-richest person on the planet … ",
    "url": "https://www.inquirer.com/opinion/trump-american-strongman-jack-smith-20241107.html?id=ujrAMZuwiDqmS"
  },
  {
    "text": "Ex-energy regulator says he offered Trump team plan to cut his old agency  —  Other former FERC officials warned ex-FERC chair Neil Chatterjee's message could prompt an exodus of talented staff at the agency that regulates the nation's interstate pipelines and electricity markets at a critical period for the power industry.",
    "url": "https://www.politico.com/news/2024/11/07/chatterjee-trump-ferc-cut-00188307"
  },
  {
    "text": "Israeli soccer fans targeted in wave of violence in Amsterdam  —  Maccabi Tel Aviv FC was in Amsterdam to play Ajax  —  Maccabi Tel Aviv FC supporters were reportedly the target of violence in Amsterdam Thursday before and during the soccer team's match against Ajax.",
    "url": "https://www.foxnews.com/sports/israeli-soccer-fans-target-wave-violence-amsterdam"
  }
]