[
  {
    "text": "Mark Zuckerberg lies about content moderation to Joe Rogan's face … I'll spare you the experience of listening to one of the richest men in the world whine and just tell you straight out: Mark Zuckerberg's interview on The Joe Rogan Experience is full of lies.",
    "url": "https://www.theverge.com/2025/1/10/24341117/mark-zuckerberg-facebook-joe-rogan-lies"
  },
  {
    "text": "Zuckerberg urges Trump to stop the EU from fining US tech companies  —  Comparing the bloc's antitrust penalties to tariffs, the Meta boss argued that Brussels is “screwing with” American industry.  —  The U.S. government under incoming President Donald Trump should intervene to stop the EU … ",
    "url": "https://www.politico.eu/article/zuckerberg-urges-trump-to-stop-eu-from-screwing-with-fining-us-tech-companies/"
  },
  {
    "text": "Jack Smith resigns from DOJ  —  The special counsel's departure was disclosed in a court filing submitted Saturday afternoon to U.S. District Judge Aileen Cannon.  —  Special counsel Jack Smith has completed his work on two criminal investigations of President-elect Donald Trump and resigned Friday from the Justice Department.",
    "url": "https://www.politico.com/news/2025/01/11/jack-smith-resigns-justice-department-trump-criminal-investigation-00197694"
  },
  {
    "text": "Trump claims Biden blocking his agenda at the last-minute.  Policy experts weigh in.  —  Biden has banned much offshore drilling while Trump says “drill, baby, drill.”  —  President Joe Biden and President-elect Donald Trump  —  As his time in the White House comes to a close … ",
    "url": "https://abcnews.go.com/Politics/trump-claims-biden-blocking-agenda-minute-policy-experts/story?id=117562473"
  },
  {
    "text": "Jeff Bezos' WaPo reeling from losses and ‘internal drama’ as Trump returns to DC: report  —  At a time when the always newsworthy Donald Trump is headed back to the White House, the venerable Washington Post should be gearing up to cover his second term but instead is being subjected to an exodus … ",
    "url": "https://www.rawstory.com/bezos-washington-post/"
  },
  {
    "text": "President Biden Awards Presidential Medal of Freedom with Distinction to His Holiness Pope Francis  —  Today, President Biden spoke with His Holiness Pope Francis and named him as a recipient of the Presidential Medal of Freedom with Distinction.  The Presidential Medal of Freedom … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2025/01/11/president-biden-awards-presidential-medal-of-freedom-with-distinction-to-his-holiness-pope-francis/"
  },
  {
    "text": "O Canada, Come Join Us  —  My great-great-grandmother was born in Saint John, New Brunswick, and first saw the United States as a 10-year-old.  My great-grandfather was an Irish Canadian who married a Maine girl.  My wife's father was born in Ontario, descended from a long line of Newfoundlanders … ",
    "url": "https://www.nytimes.com/2025/01/11/opinion/o-canada-come-join-us.html"
  },
  {
    "text": "Despite Trump's Attacks, Republicans Made Big Gains in Mail Voting  —  As Republican voters embraced a practice that Donald J. Trump railed against for years, softening his tone only slightly in 2024, the party eroded a key Democratic advantage across the country.",
    "url": "https://www.nytimes.com/2025/01/11/us/politics/trump-2024-election-mail-votes.html"
  },
  {
    "text": "The Second Time as Farce: Imperialism in the 21st Century  —  Hegel remarks somewhere that all great world-historic facts and personages appear, so to speak, twice.  He forgot to add: the first time as tragedy, the second time as farce.  — Karl Marx, “The Eighteen Brumaire of Louis Bonaparte”, 1851",
    "url": "https://nathangoldwag.wordpress.com/2025/01/11/the-second-time-as-farce-imperialism-in-the-21st-century/"
  },
  {
    "text": "'There are a lot of bitter people here, I'm one of them': rust belt voters on why they backed Trump again despite his broken promises  —  Many in Youngstown, Ohio, believe the president-elect will tackle the town's decline this time.  Others are worried about his character flaws.",
    "url": "https://www.theguardian.com/us-news/2025/jan/11/there-are-a-lot-of-bitter-people-here-im-one-of-them-rust-belt-voters-on-why-they-backed-trump-again-despite-his-broken-promises"
  },
  {
    "text": "Scoop: Denmark sent Trump team private messages on Greenland … - Trump has repeatedly declared that controlling Greenland — the world's largest island — is necessary for U.S. national security vis-a-vis Russia and China. … - Climate change is opening up the Arctic for competition between superpowers … ",
    "url": "https://www.axios.com/2025/01/11/denmark-response-trump-greenland-threat"
  },
  {
    "text": "DoJ releases its Tulsa race massacre report over 100 years after initial review  —  DoJ report acknowledges attack ‘was so systematic and coordinated that it transcended mere mob violence’  —  On Friday, the Department of Justice (DoJ) released its report on the Tulsa race massacre after announcing the review last September.",
    "url": "https://www.theguardian.com/us-news/2025/jan/10/tulsa-race-massacre-report-doj"
  },
  {
    "text": "In Congress, a Push for Proxy Voting for New Parents Draws Bipartisan Support … Representative Brittany Pettersen at the Capitol on Wednesday.Haiyun Jiang for The New York Times  —  Representative Brittany Pettersen, a second-term Colorado Democrat, was not planning to have a second child at the age of 43.",
    "url": "https://www.nytimes.com/2025/01/11/us/politics/congress-proxy-voting-parental-leave.html"
  },
  {
    "text": "Scott Bessent, Trump's Billionaire Treasury Pick, Will Shed Assets to Avoid Conflicts  —  Financial disclosure forms show hundreds of millions of assets including property in the Bahamas and investments in Bitcoin and China's currency.  —  Scott Bessent, the billionaire hedge fund manager … ",
    "url": "https://www.nytimes.com/2025/01/11/business/scott-bessent-treasury-divest.html"
  },
  {
    "text": "The California Wildfires Are the Latest Disaster Supercharged by Climate Change  —  Extreme weather events — deadly heat waves, floods, fires and hurricanes — are the consequences of a warming planet, scientists say.  —  As Los Angeles burned for days on end, horrifying the nation … ",
    "url": "https://www.nytimes.com/2025/01/10/climate/california-fires-climate-change-disasters.html?unlocked_article_code=1.oU4.teAw.73gudJ3Hvi9J&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Mike Pence Shares the First Thing He Said to Trump in Four Years … Though Mike Pence hadn't seen Donald Trump since leaving the White House, the former vice president said he was grateful to get a moment to speak with him at Jimmy Carter's state funeral this week.",
    "url": "https://www.christianitytoday.com/2025/01/mike-pence-donald-trump-carter-funeral-russell-moore/"
  },
  {
    "text": "Playbook: Kamala Harris' zombie fundraising  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  CALL IT THE 2028 BOWL — JD VANCE's Ohio State Buckeyes will meet PETE BUTTIGIEG's Notre Dame Fighting Irish in next Monday's college football national championship game in New Orleans.",
    "url": "https://www.politico.com/newsletters/playbook/2025/01/11/kamala-harris-zombie-fundraising-00197681"
  },
  {
    "text": "Protesters chanting ‘no to Nazis’ block access to AfD party congress  —  Summit attendees are expected to formally nominate Alice Weidel as the far-right candidate for chancellor in next month's election.  —  Thousands of demonstrators gathered in the East German town of Riesa on Saturday … ",
    "url": "https://www.politico.eu/article/protesters-chanting-no-to-nazis-block-access-to-afd-party-congress/"
  },
  {
    "text": "As L.A. Fires Rage, Trump and Newsom's Hostilities Resurface  —  California's Democratic governor, Gavin Newsom, and President-elect Donald J. Trump have long feuded.  Can the rancor be set aside to help a devastated city recover?  —  As fires raged around Los Angeles, Gov. Gavin Newsom … ",
    "url": "https://www.nytimes.com/2025/01/11/us/politics/los-angeles-fires-trump-newsom.html"
  },
  {
    "text": "TikTok takeaways: Supreme Court appears likely to uphold impending ban  —  Maureen Groppe Bart Jansen Karissa Waddick Rebecca MorinUSA TODAY  —  WASHINGTON − As the Supreme Court on Friday heard starkly different views on whether the government can effectively ban a social media platform used … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2025/01/11/tiktok-trouble-supreme-court-impending-ban/77623334007/"
  },
  {
    "text": "Americans stocking up on foreign goods before Trump tariffs: ‘a sense of urgency’  —  As inauguration day approaches, consumers scooping up iPads, building supplies, shelf-stable foods and electric cars  —  Lauren Aratani in New York and Guardian community team",
    "url": "https://www.theguardian.com/business/2025/jan/11/foreign-goods-trump-tariffs"
  },
  {
    "text": "Pressure mounts on Farage to resign after break with Musk  —  Ten Reform UK councillors quit in protest over the “incompetent or malevolent” management of the far-right party.  —  A group of 10 Reform UK councillors have resigned in a bid to get Nigel Farage to step down as the right-wing party's leader.",
    "url": "https://www.politico.eu/article/pressure-mounts-on-farage-to-resign-savage-break-with-musk-rejection/"
  }
]