[
  {
    "text": "Fetterman Plans to Give Back Menendez Donation In Cash-Filled Envelopes (Exclusive)  —  Fetterman is the only Senate Democrat to call on Menendez to resign after a federal bribery indictment  —  A Facebook icon representing an external link to share the article on Facebook.A Twitter icon representing … ",
    "url": "https://themessenger.com/politics/fetterman-plans-to-give-back-menendez-donation-in-cash-filled-envelopes-exclusive"
  },
  {
    "text": "History Offers Democrats a Way Out of the Menendez Problem  —  Oddly enough, it involves the very same seat the New Jersey senator refuses to resign.  —  Senator Robert Menendez had a bad week.  —  A New Jersey Democrat currently serving his third full term in the Senate … ",
    "url": "https://www.politico.com/news/magazine/2023/09/25/history-dept-bob-menendez-democrats-00117935"
  },
  {
    "text": "Second Senate Democrat calls for Menendez resignation  —  Sen. Sherrod Brown (D-Ohio) on Monday became the second Senate Democrat to call on Sen. Bob Menendez (D-N.J.) to resign after he was indicted on federal bribery charges late last week.  —  “Senator Menendez has broken the public trust … ",
    "url": "https://thehill.com/homenews/senate/4222340-second-senate-democrat-calls-for-menendez-resignation/"
  },
  {
    "text": "Trump Floats the Idea of Executing Joint Chiefs Chairman Milley  —  The former president is inciting violence against the nation's top general.  America's response is distracted and numb.  —  Late Friday night, the former president of the United States—and a leading candidate to be the next president … ",
    "url": "https://www.theatlantic.com/ideas/archive/2023/09/trump-milley-execution-incitement-violence/675435/"
  },
  {
    "text": "Trump appears to remain worried that 2024 won't be rigged to his benefit  —  Former president Donald Trump has never been particularly adept at masking his true feelings.  He feels confident in his ability to close the deal, however robustly he's previously undermined his position.",
    "url": "https://www.washingtonpost.com/politics/2023/09/25/trump-pennsylvania-voting/"
  },
  {
    "text": "Trump pledges to investigate MSNBC parent company for ‘threatening treason’  —  Former President Trump pledged to investigate Comcast, the parent company for NBC and MSNBC, if he is elected in 2024, saying it “will be thoroughly scrutinized for their knowingly dishonest and corrupt coverage of people, things, and events.”",
    "url": "https://thehill.com/homenews/4221310-trump-pledges-to-investigate-msnbc-parent-for-threatening-treason/"
  },
  {
    "text": "Trump doesn't buy gun after saying he wants to in South Carolina  — The Trump campaign walked back a claim that former President Donald Trump bought a Glock handgun in South Carolina.  — A since-deleted video posted on social media by Trump's spokesman, Steven Cheung … ",
    "url": "https://www.cnbc.com/2023/09/25/trump-says-he-is-buying-glock-handgun-at-south-carolina-event.html"
  },
  {
    "text": "Could a discharge petition keep the government open?  —  Good morning, Early Birds.  If you observe Yom Kippur, have an easy fast.  Tips: earlytips@washpost.com.  Was this forwarded to you?  Sign up here.  Thanks for waking up with us.  —  In today's edition ...  Sen. Bob Menendez holds … ",
    "url": "https://www.washingtonpost.com/politics/2023/09/25/could-discharge-petition-keep-government-open/"
  },
  {
    "text": "Newsom and DeSantis agree to debate on Fox News  —  Florida Gov. and Republican presidential candidate Ron DeSantis (R) and California Gov. Gavin Newsom (D) have agreed to participate in a televised debate in November that will be moderated by Fox News host Sean Hannity.",
    "url": "https://thehill.com/homenews/4221793-newsom-desantis-agree-fox-news-debate-nov-30/"
  },
  {
    "text": "Classified Documents Judge Sets Hearing To Review Possible Conflicts of Interest for Lawyer Representing Aide and Pool Worker  —  The Justice Department requested the hearing with Woodward's clients ‘to inform them of potential risks and inquire into possible waivers’",
    "url": "https://themessenger.com/politics/classified-documents-judge-sets-hearing-to-review-possible-conflicts-of-interest-for-lawyer-representing-aide-and-pool-worker-walt-nauta-donald-trump"
  },
  {
    "text": "Today's Biden Inc question: Did an FBI ‘mole’ tip Hunter to indictments of China-intel front execs?  —  How did an executive of CEFC, a known front for China's intelligence apparatus, manage to get out of the US ahead of sealed indictments from the Department of Justice?",
    "url": "https://hotair.com/ed-morrissey/2023/09/25/todays-biden-inc-question-did-an-fbi-mole-tip-hunter-to-indictments-of-china-intel-front-execs-n580300"
  },
  {
    "text": "Majority of Americans continue to favor moving away from Electoral College  —  How we did this  —  The Electoral College has played an outsize role in some recent U.S. elections.  And a majority of Americans would welcome a change to the way presidents are elected, according to a new Pew Research Center survey.",
    "url": "https://www.pewresearch.org/short-reads/2023/09/25/majority-of-americans-continue-to-favor-moving-away-from-electoral-college/"
  },
  {
    "text": "Trump Georgia election juror names to be kept secret until trial ends, judge rules  — The identities of the Georgia jurors who will hear the election interference trial against former President Donald Trump will be kept secret until the end of the trial, a judge ordered.",
    "url": "https://www.cnbc.com/2023/09/25/trump-georgia-election-jurors-names-to-be-kept-secret-at-trial.html"
  },
  {
    "text": "8 hospitalized after ‘sudden severe turbulence’ on Florida-bound flight  —  FORT LAUDERDALE, Fla. (WFLA) — Eight people were hospitalized Monday after being injured during rough skies on a flight to Florida.  —  Passengers and crew aboard the JetBlue flight experienced “sudden severe turbulence” … ",
    "url": "https://thehill.com/policy/transportation/4222399-8-hospitalized-after-sudden-severe-turbulence-on-florida-bound-flight/"
  },
  {
    "text": "I served in the House for 28 years.  It's now more dysfunctional than ever.  —  I was back on Capitol Hill last week, where I had the dual experiences of meaningful memories of the past colliding with realities of the present.  —  Former staff members from my personal office … ",
    "url": "https://thehill.com/opinion/campaign/4221898-i-served-in-the-house-for-28-years-its-now-more-dysfunctional-than-ever/"
  },
  {
    "text": "Leader of Canada's House of Commons apologizes for honoring man who fought for Nazis  —  The speaker of Canada's House of Commons apologized Sunday for recognizing a man who fought for a Nazi military unit during World War II.  Just after Ukrainian President Volodymyr Zelenskyy delievered … ",
    "url": "https://apnews.com/article/canada-parliament-apology-ukraine-nazi-eedc22e1d810011c412953168a4cee46"
  },
  {
    "text": "Before Jan. 6, the FBI predicted extremists would be ‘very willing to take action’ over a 2020 election dispute  —  An FBI “red cell” report predicted that law enforcement action and a “lack of coordination” between groups would prevent widespread violence in response to a disputed election.",
    "url": "https://www.nbcnews.com/politics/justice-department/jan-6-fbi-predicted-extremists-willing-take-action-2020-election-dispu-rcna117173"
  },
  {
    "text": "Barreling toward shutdown, McCarthy scrambles to get even one spending win  —  The speaker's latest plan is to advance four spending bills on Tuesday.  But it's unclear that he has the votes.  And it still won't keep the government open.",
    "url": "https://www.politico.com/live-updates/2023/09/25/congress/mccarthys-career-deciding-week-00118006"
  },
  {
    "text": "2 Looming Rulings Could Shape Trump's Fraud Trial in New York  —  Donald J. Trump has adopted a long-shot legal strategy to try to delay his upcoming civil trial and severely limit the case against him.  —  After four years of investigating and litigating, Letitia James was finally due for her day in court against Donald J. Trump.",
    "url": "https://www.nytimes.com/2023/09/25/nyregion/trump-letitia-james-fraud-lawsuit-trial.html"
  }
]