[
  {
    "text": "It's Official: With “Vermin,” Trump Is Now Using Straight-up Nazi Talk … We've all often wondered whether Donald Trump understands the historical import of what comes out of his mouth.  He's so ill-informed, so proudly ignorant, that it's easy to think that when he hurls a historical insult, he just doesn't know.",
    "url": "https://newrepublic.com/article/176877/trump-vermin-speech-nazi-language"
  },
  {
    "text": "Trump Compares Political Foes To ‘Vermin’ On Veterans Day—Echoing Nazi Propaganda  —  Former President Donald Trump pledged to eliminate political extremist groups that “lie, steal and cheat on elections,” calling them “vermin” during a speech Saturday and in a Truth Social post commemorating Veterans Day … ",
    "url": "https://www.forbes.com/sites/saradorn/2023/11/12/trump-compares-political-foes-to-vermin-on-veterans-day-echoing-nazi-propaganda/"
  },
  {
    "text": "In Veterans Day Speech, Trump Promises to ‘Root Out’ the Left  —  The former president said that threats from abroad were less concerning than liberal “threats from within” and that he was a “very proud election denier.”  —  Former President Donald J. Trump, on a day set aside to celebrate … ",
    "url": "https://www.nytimes.com/2023/11/11/us/politics/trump-new-hampshire-veterans.html"
  },
  {
    "text": "Biden shifts into campaign mode with more attacks on Trump  —  President Joe Biden is ramping up attacks on former President Trump after some allies privately urged him to do so in recent days.  —  WASHINGTON — President Biden is shifting more into campaign mode, with plans to increasingly attack … ",
    "url": "https://www.nbcnews.com/politics/2024-election/biden-shifts-campaign-mode-attacks-trump-rcna124777"
  },
  {
    "text": "What President Joe Biden plans to do if he gets a second term  —  President Joe Biden has a lot of unfinished business from his first term that he intends to continue if reelected.  It's a far different vision for the country than Donald Trump has outlined during his own campaign.  (Nov. 12)",
    "url": "https://apnews.com/article/joe-biden-second-term-agenda-election-2024-272bb9582df845cf9cd222ff2e9bd2f1"
  },
  {
    "text": "Burgum vows to stick it out through the New Hampshire primary  —  After he failed to qualify for the third debate, the long-shot Republican presidential candidate said he won't suspend his campaign before the Iowa caucuses and New Hampshire primary.  —  DES MOINES — Long-shot Republican … ",
    "url": "https://www.nbcnews.com/meet-the-press/meetthepressblog/burgum-vows-stick-new-hampshire-primary-rcna124813"
  },
  {
    "text": "“Covering him as a normal candidate”: Extremism scholars say TV news “normalizing” Trump's threats  —  TV news outlets increasingly ignore Trump's “dehumanizing” rhetoric at rallies despite growing threat  —  Trump recently made alarming statements, including advocating for “ideological screening” … ",
    "url": "https://www.salon.com/2023/11/12/covering-him-as-a-normal-candidate-extremism-scholars-say-tv-news-normalizing-trumps/"
  },
  {
    "text": "F.B.I. Examining Whether Adams Cleared Red Tape for Turkish Government  —  After winning the 2021 Democratic mayoral primary, Eric Adams successfully pressed city officials to allow the opening of a Manhattan high-rise housing the Turkish Consulate General.  —  Federal authorities … ",
    "url": "https://www.nytimes.com/2023/11/12/nyregion/eric-adams-investigation-turkey-consulate.html"
  },
  {
    "text": "Voting group founded by Abrams, once led by Warnock, faces financial scrutiny  —  The New Georgia Project, which helped turn Georgia into a swing state, confronts allegations of mismanagement, undocumented spending.  —  The New Georgia Project, a voting rights organization founded … ",
    "url": "https://www.politico.com/news/2023/11/12/new-georgia-project-nse-ufot-00122485"
  },
  {
    "text": "House GOP pursuing two-step plan to avert government shutdown  —  House Republicans are pursuing a two-step plan for funding the government, three sources familiar with the matter told CNN, as Congress barrels toward another spending deadline Friday.  —  Newly elected House Speaker Mike Johnson announced … ",
    "url": "https://www.cnn.com/2023/11/11/politics/house-speaker-mike-johnson-pitches/"
  },
  {
    "text": "UCLA faculty call on school to condemn protests, speech ‘crossing the line’  —  A group of over 300 faculty at the University of California, Los Angeles (UCLA) signed a letter calling on the school to condemn protests “crossing the line from protected speech to unlawful incitement” amid the ongoing Israel-Hamas war.",
    "url": "https://thehill.com/homenews/education/4305783-ucla-faculty-call-condemn-protests-crossing-the-line/"
  },
  {
    "text": "The Authoritarianism Is The Point  —  Why is the Trump campaign so loudmouthed about its autocratic policy plans?  —  If elected next year, Donald Trump's plans for his second term are not a secret.  Indeed, for the past six months or so there has been story after story about what he intended to do come January 20, 2025.",
    "url": "https://danieldrezner.substack.com/p/the-authoritarianism-is-the-point"
  },
  {
    "text": "‘QAnon shaman’ from Jan. 6 Capitol attack could run as Libertarian for Congress  —  Arizona's “QAnon shaman,” whose horned fur hat and tattoos became an enduring symbol of the Jan. 6, 2021, attack on the U.S. Capitol, wants to go back to Washington, D.C.  —  This time, Jacob Chansley wants … ",
    "url": "https://www.azcentral.com/story/news/politics/elections/2023/11/11/qanon-shaman-jacob-chansley-could-run-for-debbie-lesko-seat-in-ariz/71545920007/"
  },
  {
    "text": "Scoop: Top Biden adviser to visit Israel, Qatar to discuss efforts to free hostages  —  Brett McGurk, President Biden's senior Middle East adviser, is expected to travel to Israel and several other countries in the region this coming week to discuss the war in Gaza and the efforts to secure … ",
    "url": "https://www.axios.com/2023/11/12/hamas-gaza-hostages-qatar-israel-netanyahu-biden"
  },
  {
    "text": "The age pretext  —  I wanted to make a couple of follow-up points to Paul's excellent post below because bad faith arguments like Douthat's are going to become increasingly common, especially if some combination of Manchin and Romney decide to run a No Labels ratfucking campaign.",
    "url": "https://www.lawyersgunsmoneyblog.com/2023/11/the-age-pretext"
  }
]