[
  {
    "text": "What Are the 2024 Disaster Scenarios for Democrats and Republicans?  —  There are still some circumstances that could lead to a blowout for either side.  —  Everyone involved in political analysis has pretty much assumed that no matter who wins the 2024 presidential (and for that matter, congressional) elections, it will be close.",
    "url": "https://nymag.com/intelligencer/article/2024-election-disaster-scenarios-for-democrats-and-republicans.html"
  },
  {
    "text": "Views of Trump trial unchanged following verdict — CBS News poll  —  Views about former President Donald Trump's New York criminal trial after the verdict look much like they did before it took place.  —  Just over half the country thought Trump was guilty before the verdict … ",
    "url": "https://www.cbsnews.com/news/trump-verdict-new-york-poll/"
  },
  {
    "text": "‘No way out without bloodshed’: the right believe the US is under threat and are mobilizing  —  In ‘mirror world’, Trump is martyr and Biden is autocrat, as calls for violence erupt on internet after ex-president's conviction  —  The posts are ominous.  —  “Pick a side, or YOU are next … ",
    "url": "https://www.theguardian.com/us-news/article/2024/jun/02/far-right-mobilizing-biden-presidency"
  },
  {
    "text": "Republicans join Trump's attacks on justice system and campaign of vengeance after guilty verdict  —  Following his conviction in hush money case, Trump again slams ‘rigged trial’  —  Biden calls Trump's claims of a rigged trial ‘reckless... dangerous’ and ‘irresponsible’",
    "url": "https://apnews.com/article/trump-guilty-republicans-vengeance-a05db7fa2512a62afe035992f2baaf16"
  },
  {
    "text": "“Swept Up!”  The Russian Payments that Led to Trump's Felony Conviction  —  There has been a lot of performed ignorance about the origin of the investigation that led to the felony conviction of Donald Trump.  —  Former Attorney General Jeff Sessions' spox, Sarah Isgur, quoted Robert Jackson about prosecutors choosing defendants.",
    "url": "https://www.emptywheel.net/2024/06/02/swept-up-the-russian-payments-that-led-to-trumps-felony-conviction/"
  },
  {
    "text": "Revenge: analysis of Trump posts shows relentless focus on punishing enemies  —  Citizens for Responsibility and Ethics in Washington documents former president's threats against perceived political opponents  —  A major study of Donald Trump's social media posts has revealed the scale … ",
    "url": "https://www.theguardian.com/us-news/article/2024/jun/02/trump-social-media-threats"
  },
  {
    "text": "Plot twist: WA has a law against felons running for office  —  If local Republicans knew what was good for them, they would now move to drop Donald Trump from Washington's fall ballot.  —  I know, they won't.  They're in too deep.  Trump won 76% of our state's GOP presidential primary vote.",
    "url": "https://www.seattletimes.com/seattle-news/politics/plot-twist-for-trump-wa-has-a-law-against-felons-running-for-office/"
  },
  {
    "text": "RNC co-chair Lara Trump attacks Hogan for calling for respect for legal process  —  Lara Trump doesn't commit to having the Republican National Committee give money to Hogan's run for Senate.  —  Lara Trump, the co-chair of the Republican National Committee and daughter-in-law of Donald Trump … ",
    "url": "https://www.washingtonpost.com/politics/2024/06/02/larry-hogan-lara-trump-rnc/"
  },
  {
    "text": "A Felon in the Oval Office Would Test the American System  —  The system of checks and balances established in the Constitution was meant to hold wayward presidents accountable, but some wonder how it will work if the next president is already a felon.  —  The revolutionary hero Patrick Henry knew this day would come.",
    "url": "https://www.nytimes.com/2024/06/02/us/politics/trump-presidency-checks-balances.html"
  },
  {
    "text": "News site editor's ties to Iran, Russia show misinformation's complexity  —  Experts say an overlap in funding underscores concern that the spread of falsehoods and propaganda online is entering a more complicated stage as the November election draws closer.",
    "url": "https://www.washingtonpost.com/technology/2024/06/02/grayzone-russia-iran-support/"
  },
  {
    "text": "Why Trump's Speech After His Guilty Verdict Was All Business, No Politics  —  In his post-verdict remarks, the former president sounded more like an aggrieved New York businessman than the political martyr his supporters believe him to be.  —  The way to evaluate a political speech … ",
    "url": "https://www.nytimes.com/2024/06/01/books/review/donald-trump-speech-verdict.html"
  },
  {
    "text": "As Hunter Biden's Trial Nears, President Biden Pulls Him Close  —  President Biden has weathered years of scandals surrounding his son.  But people close to both men say the president has refused to treat him as a political liability.  —  President Biden wakes up every day to a list of concerns he must address as commander in chief.",
    "url": "https://www.nytimes.com/2024/06/02/us/politics/as-hunter-bidens-trial-nears-president-biden-pulls-him-close.html"
  },
  {
    "text": "‘This Week’ Transcript 6-2-24: Gov. Wes Moore, Trump Attorney Will Scharf and John Kirby  —  Governor Wes Moore speaks during a President Joe Biden campaign stop at South Restaurant & Jazz Club, in Philadelphia, on May 29, 2024. … GEORGE STEPHANOPOULOS, ABC “THIS WEEK” ANCHOR … ",
    "url": "https://abcnews.go.com/Politics/week-transcript-6-2-24-gov-wes-moore/story?id=110743140"
  },
  {
    "text": "Donald Trump joins TikTok and rapidly wins two million followers  —  Within hours of joining TikTok, Republican presidential candidate Donald Trump had attracted over 2 million followers on the short video social media platform that he tried to ban as president on national security grounds.",
    "url": "https://www.reuters.com/world/us/donald-trump-joins-tiktok-video-platform-he-once-sought-ban-2024-06-02/"
  },
  {
    "text": "Michael Cohen Worries Trump Will Spill Secrets in Prison ‘for a Bag of Tuna’  —  EXIT INTERVIEWS  —  “If America turns against him, he would rather see America burned to the ground,” Cohen said.  —  Michael Cohen says he's “afraid” for national security if Donald Trump goes to prison.",
    "url": "https://www.thedailybeast.com/michael-cohen-worries-trump-will-spill-secrets-in-prison-for-a-bag-of-tuna"
  }
]