[
  {
    "text": "Jump in Enthusiasm for 2024 Race  —  Harris picks up support among young voters and ‘double haters’  —  West Long Branch, NJ - Democrats' enthusiasm has skyrocketed since they swapped their presidential nominee.  The latest national Monmouth (\"Mon-muth\") University Poll finds voter support … ",
    "url": "https://www.monmouth.edu/polling-institute/reports/monmouthpoll_us_081424/"
  },
  {
    "text": "The Fight To Redefine the 2024 Race for President  —  A new Cook Political Report Swing State Project Survey conducted by BSG and GS Strategy Group shows Vice President Kamala Harris leading or tied with former President Donald Trump in all but one of the seven battleground states.",
    "url": "https://www.cookpolitical.com/survey-research/2024-swing-state-project/fight-redefine-2024-race-president"
  },
  {
    "text": "Harris Narrows in Florida: Is the Sunshine State Up for Grabs?  —  As the 2024 U.S. presidential race intensifies, a new poll from the Florida Atlantic University Political Communication and Public Opinion Research Lab (PolCom Lab) and Mainstreet Research USA reveals the shifting tides of politics in Florida … ",
    "url": "https://www.faupolling.com/august142024/"
  },
  {
    "text": "Where Harris has improved the most on Biden  —  She's doing much better than Biden in every swing state.  —  ∙ Paid  —  I'll have a story forthcoming for you later this week — if I can find the time in between the zillion podcasts I'm doing — on renewed GOP efforts to “unskew the polls”.",
    "url": "https://www.natesilver.net/p/where-harris-has-improved-the-most"
  },
  {
    "text": "Pennsylvania 2024: Harris Has Slight Edge Over Trump In Tight Race, Gets Boost From Women, Quinnipiac University Pennsylvania Poll Finds; Senate Race: Casey Up 8 Points Over McCormick  —  mail_outline  —  In the critical swing state of Pennsylvania, Vice President Kamala Harris has a slight edge … ",
    "url": "https://poll.qu.edu/poll-release?releaseid=3902"
  },
  {
    "text": "Trump Allies Fear He's Sabotaging His Own Campaign  —  The former president can't get over feeling “cheated” by Joe Biden's exit from the race, says one source, while another speculates he might “have PTSD” following last month's assassination attempt.  —  In the hierarchy of Donald Trump's put-downs … ",
    "url": "https://www.vanityfair.com/news/story/trump-allies-fear-sabotaging-campaign"
  },
  {
    "text": "J.D. Vance Is Bombing His Audition As Trump Heir Apparent  —  One of the many interesting things about the abrupt change in the trajectory of the 2024 presidential election since Kamala Harris replaced Joe Biden as the Democratic presidential nominee is that once very lively questions that had fallen by the wayside are returning.",
    "url": "https://nymag.com/intelligencer/article/jd-vance-audition-trump-heir-apparent.html"
  },
  {
    "text": "Donald Trump rally in Asheville live updates: Thomas Wolfe Auditorium is full  —  Former President Donald Trump is in Asheville today, Aug. 14, to hold a campaign rally in his bid to regain the presidency in the Nov. 5 general election.  It is Trump's first campaign visit to Asheville since September 2016 … ",
    "url": "https://www.citizen-times.com/story/news/local/2024/08/14/trump-asheville-rally-republican-live-coverage/74787771007/"
  },
  {
    "text": "Google says Iranian efforts to hack US presidential campaigns are ongoing and wide-ranging  —  Google said Wednesday that an alleged Iranian hacking operation aimed at US presidential campaigns is ongoing and more wide-ranging than previously known as the hackers continue to target … ",
    "url": "https://www.cnn.com/2024/08/14/politics/google-iran-hacking-presidential-election"
  },
  {
    "text": "Iranian backed group steps up phishing campaigns against Israel, U.S.  —  Today Google's Threat Analysis Group (TAG) is sharing insights on APT42, an Iranian government-backed threat actor, and their targeted phishing campaigns against Israel and Israeli targets.",
    "url": "https://blog.google/threat-analysis-group/iranian-backed-group-steps-up-phishing-campaigns-against-israel-us/"
  },
  {
    "text": "Ruling: Fetus can be referred to as ‘unborn human being’ in Arizona abortion measure voter pamphlet  —  An informational pamphlet for Arizona voters who will decide in the fall whether to guarantee a constitutional right to an abortion can refer to a fetus as an “unborn human being,” the state's highest court ruled Wednesday.",
    "url": "https://apnews.com/article/arizona-abortion-rights-ballot-measure-b0ea37c92692533da109fd74a07b25f7"
  },
  {
    "text": "A Florida referendum is putting Trump in a bind on abortion  —  The former president is under pressure to say how he'll vote on the measure.  —  Donald Trump still doesn't have an answer on how he'll vote on an abortion measure in his home state.  And it's about to become a lot harder for him to avoid it.",
    "url": "https://www.politico.com/news/2024/08/14/florida-referendum-trump-abortion-00173957"
  },
  {
    "text": "Biden harbors lingering frustration at Pelosi, Obama, Schumer  —  Ahead of the convention that's meant to unify the party, tensions still remain.  —  President Joe Biden is frustrated that Barack Obama wouldn't tell him to his face that he should leave the race.",
    "url": "https://www.politico.com/news/2024/08/14/biden-frustration-obama-pelosi-00173883"
  },
  {
    "text": "Prepare for Trump to be sentenced to prison on September 18  —  The objective here is to enable VP Kamala Harris and the media-Democratic complex to label Trump ‘a convicted felon sentenced to prison’ as voting begins  —  To the surprise of no one, Judge Juan Merchan has yet again denied … ",
    "url": "https://www.foxnews.com/opinion/andrew-mccarthy-prepare-trump-sentenced-prison-september-18"
  },
  {
    "text": "GOP pollster on Trump-Harris: 'I haven't seen anything like this'  —  Republican pollster Frank Luntz appears stunned at the current state of the Kamala Harris-Donald Trump matchup and this year's presidential election.  —  Luntz, who's been called “The Nostradamus of pollsters” … ",
    "url": "https://www.nj.com/politics/2024/08/gop-pollster-on-trump-harris-i-havent-seen-anything-like-this.html"
  },
  {
    "text": "Reporter grills Trump over ‘false’ crowd size claim: 'There's all kinds of video evidence'  —  Former President Donald Trump continued to falsely claim this week that he had spoken to the largest crowds in history.  —  After casting his ballot during early voting in the Florida primary Wednesday … ",
    "url": "https://www.rawstory.com/trump-harris-crowd-size/"
  },
  {
    "text": "The big question touching a nerve this election: “Can my husband find out who I am voting for?”  —  November may come down to a battle between controlling men and women who just want their freedom  —  “Can my husband find out who I am voting for in the Presidential Election?”",
    "url": "https://www.salon.com/2024/08/14/can-my-husband-find-out-i-am-voting-for-the-big-question-touching-a-nerve-this/"
  },
  {
    "text": "US inflation dipped in July as Federal Reserve expected to cut interest rates  —  Prices rose at an annual rate of 2.9% in July, as inflation dipped below 3% for the first time since 2021  —  US annual inflation rate dipped below 3% in July for the first time since 2021 … ",
    "url": "https://www.theguardian.com/business/article/2024/aug/14/us-july-inflation-interest-rates"
  },
  {
    "text": "Tampa Voters Get Their Say Two Years After DeSantis Axed Their Democratic Prosecutor  —  Andrew Warren is running to win back his old job as Tampa's top prosecutor.  Since the Democrat joined the race in April, he has released campaign videos, basked in endorsements, and raised hundreds … ",
    "url": "https://boltsmag.org/hillsborough-county-tampa-state-attorney-2024-election/"
  },
  {
    "text": "Project 2025's Climate Cuts Would Cost Americans Billions Of Dollars Per Year  —  The Republican manifesto would cost millions of jobs and cause a dramatic surge in emissions.  —  LOADING  —  Project 2025 ― the plan that Republican operatives have drafted as a policy blueprint … ",
    "url": "https://www.huffpost.com/entry/project-2025-climate_n_66bce83fe4b03d1ac02e0021"
  },
  {
    "text": "Turnout in Wisconsin election tops 26%, highest in 60 years for fall primary in presidential year  —  Turnout in Wisconsin's election Tuesday was the highest in 60 years for a presidential year partisan primary, with over 26% of the state's voting-age population casting ballots, based on unofficial results.",
    "url": "https://apnews.com/article/wisconsin-election-turnout-senate-24ac974d995a286fb79eb9a277e8435e"
  },
  {
    "text": "Ex-US air force specialist with Christian nationalist ties leads combat trainings  —  Michael Caughran's history raises questions about extent to which his far-right and survivalist activities overlapped with his enlistment  —  A former US air force survival expert with militia … ",
    "url": "https://www.theguardian.com/us-news/article/2024/aug/14/former-air-force-christian-nationalism-combat-courses"
  },
  {
    "text": "FTC bans fake online reviews, inflated social media influence; rule takes effect in October … The Federal Trade Commission on Wednesday voted unanimously to ban marketers from using fake reviews, like those generated with AI technology, and other misleading practices to promote their products and services.",
    "url": "https://www.cnbc.com/2024/08/14/ftc-bans-fake-reviews-social-media-influence-markers.html"
  }
]