[
  {
    "text": "Scoop: Biden seizes debate limelight for “Project 2025” push … - The Trump campaign points instead to the Agenda47 website for policies explicitly endorsed by former President Trump. … - Google search interest in “Project 2025” surged earlier this month, and a John Oliver segment … ",
    "url": "https://www.axios.com/2024/06/27/biden-project-2025-trump-debate"
  },
  {
    "text": "Playbook: The most important night of the 2024 election  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  POSTED MOMENTS AGO — Who is to blame for the crisis gripping The Washington Post?  WILL LEWIS, the CEO with an increasingly scarred reputation?",
    "url": "https://www.politico.com/newsletters/playbook/2024/06/27/the-most-important-night-of-the-2024-election-00165273"
  },
  {
    "text": "Watch?  Cringe?  Abstain?  All about tonight's high-stakes debate  —  Although a lot of people are adamant that they have no intention of looking in on tonight's presidential debate, I have a feeling they'll change their minds when 9 p.m. rolls around.  The Associated Press reported … ",
    "url": "https://margaretsullivan.substack.com/p/watch-cringe-abstain-all-about-tonights"
  },
  {
    "text": "Debate day brings bad news for Biden  —  DEBATE DAY BRINGS BAD NEWS FOR BIDEN.  It's only natural for pollsters and other political professionals to try to take the public's temperature about a presidential race right before a big debate.  The debate might have little effect on the race … ",
    "url": "https://www.washingtonexaminer.com/daily-memo/3061070/debate-day-brings-bad-news-for-biden/"
  },
  {
    "text": "Corruption Law Allows Gifts to State and Local Officials, Supreme Court Rules  —  The court, which has limited the sweep of several anti-corruption laws, distinguished after-the-fact rewards from before-the-fact bribes.  —  The Supreme Court limited the sweep of a federal law on Wednesday aimed … ",
    "url": "https://www.nytimes.com/2024/06/26/us/politics/supreme-court-corruption-bribery.html"
  },
  {
    "text": "The Supreme Court rules that state officials can engage in a little corruption, as a treat  —  On a 6-3 party-line vote, the Supreme Court ruled on Wednesday that state officials may accept “gratuities” from people who wish to reward them for their official actions, despite a federal anti-corruption statute … ",
    "url": "https://www.vox.com/scotus/357170/supreme-court-snyder-united-states-corruption"
  },
  {
    "text": "25+ Years of Daily Show Clips Gone as Paramount Axes Comedy Central Site  —  First on LateNighter: One of the richest repositories of late-night videos is no longer.  —  ComedyCentral.com had been home to clips from every episode of The Daily Show since 1999, and the entire run of The Colbert Report … ",
    "url": "https://latenighter.com/news/paramount-axes-comedy-central-website-show-clips-library/"
  },
  {
    "text": "The Supreme Court strips the SEC of a critical enforcement tool in fraud cases  —  The Supreme Court on Thursday stripped the Securities and Exchange Commission of a major tool in fighting securities fraud in a decision that also could have far-reaching effects on other regulatory agencies.",
    "url": "https://apnews.com/article/supreme-court-regulatory-agencies-sec-36f16444b1d4fc52985fdb68896362bb"
  },
  {
    "text": "Exclusive: Michelle Obama's private frustration with the Bidens … - Michelle Obama also was initially reluctant to campaign for Biden after he became the Democratic nominee in 2020, people familiar with the situation told Axios.  — Biden's team says the relationship between the families is strong … ",
    "url": "https://www.axios.com/2024/06/27/michelle-obama-private-frustration-bidens-2024-election"
  },
  {
    "text": "How right-wing media is legitimizing a nonsensical and nonexistent lawsuit  —  This is a special joint edition of Public Notice and Judd Legum's Popular Information.  You can subscribe to Popular Information here.  —  On June 20, Missouri Attorney General Andrew Bailey announced on X … ",
    "url": "https://www.publicnotice.co/p/andrew-bailey-new-york-lawsuit-trump-sinclair"
  },
  {
    "text": "What Kind of ‘Psycho’ Calls Dead Americans ‘Losers’ and ‘Suckers’?  —  Trump's denial of his own well-documented remarks is a tell.  —  Perhaps you've noticed lately that Donald Trump, a man not known for subtlety, has been testing the limits of the Streisand effect.",
    "url": "https://www.theatlantic.com/politics/archive/2024/06/what-kind-of-psycho-calls-dead-americans-losers-and-suckers/678807/"
  },
  {
    "text": "EXCLUSIVE: VA Senate candidate says he was ‘blown up’ in combat.  His record doesn't show that.  —  Elizabeth Beyer Tom Vanden BrookUSA TODAY  —  WASHINGTON — The Republican candidate for U.S. Senate in Virginia, a decorated Navy veteran, has made repeated references to becoming disabled after he was … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/06/26/hung-cao-military-record-purple-heart/74220141007/"
  },
  {
    "text": "Most Biden rally appearances are shorter than a sitcom, helping fuel stamina concerns  —  Concerns over the president's mental acuity have mounted in recent months  —  President Biden spoke for a maximum of 33 minutes and clocked in at well under half an hour during the majority … ",
    "url": "https://www.foxnews.com/politics/most-biden-rally-appearances-shorter-than-sitcom-helping-fuel-stamina-concerns"
  },
  {
    "text": "7 in 10 think Supreme Court justices prioritize ideology: AP poll  —  WASHINGTON (AP) — A solid majority of Americans say Supreme Court justices are more likely to be guided by their own ideology rather than serving as neutral arbiters of government authority, a new poll finds … ",
    "url": "https://apnews.com/article/supreme-court-trump-presidential-immunity-abortion-gun-2918d3af5e37e44bbad9c3526506c66d"
  },
  {
    "text": "Supreme Court Poised to Allow Emergency Abortions in Idaho  — Opinion was briefly posted on the court's website and removed  — Hospitals would be allowed to protect pregnant mother's health  —  The US Supreme Court is poised to allow abortions in medical emergencies in Idaho … ",
    "url": "https://www.bloomberg.com/news/articles/2024-06-26/us-supreme-court-poised-to-allow-emergency-abortions-in-idaho"
  },
  {
    "text": "What Trump And Biden Really Mean When They Fight About Electric Vehicles  —  The argument is about a lot more than Detroit and cars.  —  LOADING  —  President Joe Biden sketched out his vision for the future of America's auto industry during a visit to Detroit in late 2021.",
    "url": "https://www.huffpost.com/entry/biden-trump-auto-industry-electric-vehicle-future_n_667c6d35e4b07cb66c6c9d74"
  },
  {
    "text": "Supreme Court blocks Purdue Pharma opioid settlement  —  The justices ruled that a bankruptcy judge did not have the authority to let members of Sackler family evade facing future lawsuits.  —  WASHINGTON — The Supreme Court on Thursday blew up the massive bankruptcy reorganization … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-blocks-purdue-pharma-opioid-settlement-rcna139066"
  },
  {
    "text": "Supreme Court blocks EPA's interstate air pollution regulation  —  The Environmental Protection Agency's “good neighbor” rule is aimed at reducing air pollution that crosses state lines and contributes to smog.  —  WASHINGTON — The Supreme Court on Thursday blocked a Biden administration … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-blocks-epas-interstate-air-pollution-reg-rcna141387"
  },
  {
    "text": "SCOTUS Puntalooza: Court Rejects Challenge to Government-Directed Censorship  —  Consider today a very disappointing day at the Supreme Court.  Not only did the court publish only two of the outstanding opinions in unresolved cases this term, they also chose to punt on one of the most important.",
    "url": "https://hotair.com/ed-morrissey/2024/06/26/scotus-palooza-n3790961"
  }
]