[
  {
    "text": "Civil rights groups warn that the decision involving birthright citizenship will create chaos.  —  In a major victory for President Trump, the court restricted the ability of federal judges to block his executive orders.  The decision may reshape the way U.S. citizenship is granted, even temporarily.",
    "url": "https://www.nytimes.com/live/2025/06/27/us/birthright-citizenship-supreme-court?unlocked_article_code=1.SE8.k7xB.zOPE7sAysDjJ&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Live updates: Supreme Court limits nationwide injunctions, but leaves fate of birthright citizenship unclear  —  Watch live as U.S. President Donald Trump holds a press briefing at the White House.  —  A divided Supreme Court ruled that individual judges lack the authority to grant nationwide injunctions … ",
    "url": "https://apnews.com/live/supreme-court-decisions-updates?link_source=ta_bluesky_link&taid=685ea8ebea31db0001a84c5b"
  },
  {
    "text": "Supreme Court limits nationwide injunctions in birthright citizenship order  —  The Supreme Court in a 6-3 decision along ideological lines on Friday sided with the Trump administration's request to limit universal injunctions issued by federal courts.  The opinion in the birthright citizenship case was highly anticipated.",
    "url": "https://www.npr.org/2025/06/27/nx-s1-5435786/scotus-birthright-citizenship-universal-injunctions"
  },
  {
    "text": "Supreme Court's blockbuster day  —  Thank you for signing up!  —  The latest in politics and policy.  Direct to your inbox.  Sign up for the 12:30 Report newsletter  —  Happy Friday!  This is a great weekend for television — the third and final season of “Squid Game” is out on Netflix, and “The Bear” is also back!",
    "url": "https://thehill.com/newsletters/1230-report/5373386-supreme-court-birthright-citizenship-porn-access-lgbtq-books/"
  },
  {
    "text": "Supreme Court, in birthright citizenship case, limits judges' power to block Trump's policies nationwide  —  While a partial Trump win on nationwide injunctions, challenges can continue.  —  Supreme Court Police officers stand outside the Supreme Court in Washington, June 27, 2025.",
    "url": "https://abcnews.go.com/Politics/supreme-court-rules-nationwide-injunctions-trump-birthright-citizenship/story?id=123034189"
  },
  {
    "text": "The Supreme Court's birthright citizenship decision isn't as devastating as you think  —  On Friday, the Supreme Court released its long-awaited decision in Trump v. CASA, a case challenging President Donald Trump's attempt to strip many Americans of citizenship.",
    "url": "https://www.vox.com/scotus/417954/supreme-court-birthright-citizenship-trump-casa-nationwide-injunctions"
  },
  {
    "text": "Supreme Court limits nationwide injunctions, but fate of Trump birthright citizenship order unclear  —  A divided Supreme Court on Friday ruled that individual judges lack the authority to grant nationwide injunctions, but the decision left unclear the fate of President Donald Trump's restrictions on birthright citizenship.",
    "url": "https://apnews.com/article/supreme-court-trump-birthright-citizenship-immigration-9da9e11d83f2fd3cbf95e6a733651daf"
  },
  {
    "text": "University of Virginia President Resigns Under Pressure From Trump Administration  —  The Justice Department had demanded that James E. Ryan step down in order to help resolve a civil rights investigation into the school.  —  The University of Virginia's president, James E. Ryan … ",
    "url": "https://www.nytimes.com/2025/06/27/us/politics/university-of-virginia-president-resigns-trump-justice-department.html"
  },
  {
    "text": "Newsom Sues Fox News for Saying He Lied About Call With Trump  —  The lawsuit, which seeks at least $787 million in damages, comes as the California governor adopts an increasingly combative style with the president and his allies.  —  Gov. Gavin Newsom of California sued Fox News on Friday … ",
    "url": "https://www.nytimes.com/2025/06/27/us/politics/gavin-newsom-fox-news-lawsuit-trump-call.html?unlocked_article_code=1.SE8.yIet.URW2V3hn-0G-&smid=url-share"
  },
  {
    "text": "Gavin Newsom sues Fox News for $787M in defamation case over Trump call  —  The amount is nearly identical to Dominion Voting's 2023 defamation settlement with Fox News.  —  Gavin Newsom is taking a page right out of Donald Trump's media playbook.  —  The California governor accused Fox News … ",
    "url": "https://www.politico.com/news/2025/06/27/newsom-sues-fox-news-defamation-case-00429168"
  },
  {
    "text": "Supreme Court backs parents seeking to opt their kids out of LGBTQ books in elementary schools  —  Parents sued Montgomery County, Maryland, schools after it said they couldn't opt their children out of exposure to LGBTQ books in the classroom.  —  WASHINGTON — The Supreme Court … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-backs-parents-seeking-opt-kids-lgbtq-books-elementary-sc-rcna208040"
  },
  {
    "text": "'It's a Killing Field': IDF Soldiers Ordered to Shoot Deliberately at Unarmed Gazans Waiting for Humanitarian Aid  —  Zen Read",
    "url": "https://www.haaretz.com/israel-news/2025-06-27/ty-article-magazine/.premium/idf-soldiers-ordered-to-shoot-deliberately-at-unarmed-gazans-waiting-for-humanitarian-aid/00000197-ad8e-de01-a39f-ffbe33780000"
  },
  {
    "text": "Gun Silencer Provision In GOP Tax Bill Violates Rules, Says Senate Rules Ref  —  The parliamentarian ruled that the provision making it easier to get silencers, rifles and shotguns is irrelevant to the budget bill and has to come out.  —  WASHINGTON — A provision in the GOP's tax … ",
    "url": "https://www.huffpost.com/entry/gun-silencer-provision-violates-senate-rules-parliamentarian_n_685d787ce4b0bd0253108069"
  },
  {
    "text": "On Iran, a reminder that party trumps values  —  Last week, I wrote in my weekly chart article “The myth of Republican isolationism” that the GOP is not in fact the party of isolationism, despite the conventional wisdom about Donald Trump and his coalition.  I pointed out that support … ",
    "url": "https://www.gelliottmorris.com/p/on-iran-a-reminder-that-party-trumps"
  },
  {
    "text": "Group suing over Trump's birthright order seeks to convert case to a class action lawsuit  —  An organization representing immigrants fighting President Donald Trump's birthright citizenship order wasted little time seeking to recalibrate its legal strategy to block the president's policy despite … ",
    "url": "https://www.politico.com/live-updates/2025/06/27/supreme-court-rulings-decisions-today-news-analysis/class-action-lawsuit-in-00427992"
  },
  {
    "text": "Trump terminates trade talks with Canada  —  The president posted on Truth Social that Canada had planned to put a tax on U.S. technology companies, calling the move “a blatant attack.”  —  President Donald Trump said Friday that he had terminated trade discussions with Canada … ",
    "url": "https://www.nbcnews.com/business/economy/trump-terminates-ends-canada-trade-talks-tariffs-rcna215608"
  },
  {
    "text": "A Week for the Ages in the Annals of Trump Suck-Uppery  —  The nato Secretary General goes all-in on strategic self-abasement while meeting with his American “Daddy.”  —  Over the past decade, as I watched ambitious, embattled, fearful, or just plain weak interlocutors deal with Donald Trump … ",
    "url": "https://www.newyorker.com/news/letter-from-trumps-washington/a-week-for-the-ages-in-the-annals-of-trump-suckuppery"
  },
  {
    "text": "The Public Is Resisting Trump.  The Elites Aren't.  —  Back in April, the White House took a sledgehammer to America's trading relationships with the rest of the world, pledging that a shiny new trade regime would be in place within three months: “90 deals in 90 days.”",
    "url": "https://www.thebulwark.com/p/the-public-is-resisting-trump-the-elites-are-not-polling-deportations-big-beautiful-bill"
  },
  {
    "text": "Environmental groups sue to block migrant detention center rising in Florida Everglades  —  Environmental groups filed a federal lawsuit Friday to block a migrant detention center dubbed “Alligator Alcatraz” now being built on an airstrip in the heart of the Florida Everglades.",
    "url": "https://apnews.com/article/florida-alligator-alcatraz-history-immigration-detention-activism-796d5fae66d28de45c647241aa02d7bd"
  },
  {
    "text": "Supreme Court Says Age Verification Laws for Porn Sites Are Constitutional  —  Nineteen states have age verification laws. … The U.S. Supreme Court ruled on Friday that states with laws requiring age verification for porn sites is constitutional. … The Texas law, which requires age … ",
    "url": "https://gizmodo.com/supreme-court-says-age-verification-laws-for-porn-sites-are-constitutional-2000621265"
  },
  {
    "text": "Two major NYC unions back Mamdani's general election bid for mayor  —  Mamdani scored an upset win over Andrew Cuomo, who received labor backing during his failed primary bid.  —  NEW YORK — Two major labor unions that backed Andrew Cuomo's failed Democratic mayoral bid are set … ",
    "url": "https://www.politico.com/news/2025/06/27/two-major-nyc-unions-back-mamdanis-general-election-bid-for-mayor-00429596"
  },
  {
    "text": "Supreme Court endorses Obamacare panel that requires free preventive care  —  The case grew out of a conservative religious challenge to the approval of HIV prevention treatments that insurers are required to provide at no cost to patients.  —  WASHINGTON — The Supreme Court on Friday rejected … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-endorses-obamacare-panel-requires-free-preventive-care-rcna207918"
  },
  {
    "text": "Iranian woman, who has lived in US for 47 years, taken by Ice while gardening  —  Madonna ‘Donna’ Kashanian, 64, was taken by plainclothes officers from her home in New Orleans  —  A 64-year-old Iranian woman, who has lived in the US for 47 years, was detained by immigration agents … ",
    "url": "https://www.theguardian.com/us-news/2025/jun/27/ice-detains-woman-iran-new-orleans"
  },
  {
    "text": "DHS Terminates Haiti TPS, Encourages Haitians to Obtain Lawful Status  —  WASHINGTON - Secretary of Homeland Security Kristi Noem today announced the termination of Temporary Protected Status for Haiti.  The TPS designation for the country expires on Aug. 3, 2025, and the termination will be effective on Tuesday, September 2, 2025.",
    "url": "https://www.dhs.gov/news/2025/06/27/dhs-terminates-haiti-tps-encourages-haitians-obtain-lawful-status"
  },
  {
    "text": "DOGE enters ATF with mandate to slash gun regulations  —  The agency is working with the ATF general counsel to cut upwards of 50 regulations as the administration drastically reduces the number of inspectors.  —  The U.S. DOGE Service has sent staff to the Bureau of Alcohol, Tobacco … ",
    "url": "https://www.washingtonpost.com/national-security/2025/06/27/atf-doge-regulations-cuts-guns/"
  },
  {
    "text": "Cuomo Doesn't Blame Himself for Losing the Primary.  Others Do.  —  Even some of his supporters say Andrew M. Cuomo ran an aloof campaign for mayor that underestimated his chief rival, Zohran Mamdani.  —  For Andrew M. Cuomo, the rally rolling out a $20-an-hour minimum wage proposal … ",
    "url": "https://www.nytimes.com/2025/06/27/nyregion/cuomo-mayor-campaign.html?unlocked_article_code=1.SE8.6TLQ.t1x2Z2qfo9eK&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "California donors cool on Kamala Harris: ‘No one is incredibly pumped.’  —  Some party funders have privately shared their ambivalence as the former vice president ramps up her outreach ahead of a potential run for governor.  —  LOS ANGELES — Kamala Harris is ramping up her outreach … ",
    "url": "https://www.politico.com/news/2025/06/27/california-donors-kamala-harris-governor-00428797"
  }
]