[
  {
    "text": "Post-ABC poll: Biden faces criticism on economy, immigration and age  —  A finding that shows Trump leading Biden by a wide margin does not match other recent polling, however, suggesting it is an outlier  —  A Washington Post-ABC News poll finds President Biden struggling to gain approval … ",
    "url": "https://www.washingtonpost.com/politics/2023/09/24/biden-trump-poll-2024-election/"
  },
  {
    "text": "Troubles for Biden not just his age in reelection campaign: POLL  —  The president's job approval rating is 19 points underwater.  —  President Joe Biden's job approval rating is 19 points underwater, his ratings for handling the economy and immigration are at career lows.",
    "url": "https://abcnews.go.com/Politics/troubles-biden-age-reelection-campaign-poll/story?id=103436611"
  },
  {
    "text": "As Trump Prosecutions Move Forward, Threats and Concerns Increase  —  As criminal cases proceed against the former president, heated rhetoric and anger among his supporters have authorities worried about the risk of political dissent becoming deadly.  —  At the federal courthouse in Washington … ",
    "url": "https://www.nytimes.com/2023/09/24/us/politics/trump-prosecutions-threats-violence.html"
  },
  {
    "text": "Trump Trials: The Waiting Game  —  Welcome back to The Trump Trials, our weekly effort to keep readers up to date on the many criminal cases the 45th president is fighting in federal and state courts.  —  Let's dig in:  —  What's ahead  —  Donald Trump's lawyers have until Monday … ",
    "url": "https://www.washingtonpost.com/national-security/2023/09/24/trump-trials-updates-latest-news/"
  },
  {
    "text": "Trump has a second-term agenda, and it's more terrifying than ever  —  Former President Trump is on the campaign trail again, and most of the attention he's getting is for bare-knuckled attacks on his chief opponents, President Biden (whom he derides as “Crooked Joe\") and Florida Gov. Ron DeSantis … ",
    "url": "https://www.latimes.com/politics/story/2023-09-24/mcmanus-column-trump-second-term-agenda"
  },
  {
    "text": "Ohio Republican on shutdown scenario: 'I'll bet on Kevin McCarthy any day'  —  But Democratic Rep. Maxine Waters only sees chaos in the GOP.  —  House Speaker Kevin McCarthy is in a very difficult position as Republicans this week are preparing to start debate on four government funding bills … ",
    "url": "https://www.politico.com/news/2023/09/24/waters-turner-mccarthy-government-shutdown-00117822"
  },
  {
    "text": "GOP Rep Who Pushes ‘Traditional Values’ Is Accused of Affair With Lobbyist  —  SPLITSVILLE  —  Melody Duncan, wife of Rep. Jeff Duncan (R-SC), filed for a divorce on Friday, citing her husband's multiple alleged affairs and a particular mistress she identified as Liz Williams … ",
    "url": "https://www.thedailybeast.com/gop-rep-jeff-duncan-accused-of-multiple-affairs-while-pushing-traditional-values"
  },
  {
    "text": "You've Persuaded Us Already  —  When it comes to the idea that conservatism has embraced fascism and supremacy, nobody is more persuasive than conservatives themselves.  An essay on bullies and the margins of permission in the USA.  —  In Missouri, a state Senator who's running for governor … ",
    "url": "https://armoxon.substack.com/p/youve-persuaded-us-already"
  },
  {
    "text": "Zelensky and Trudeau Give Soldier Who Reportedly Fought for Nazi Germany a Standing Ovation  —  The Canadian parliament, Prime Minister Justin Trudeau and Ukrainian President Volodymyr Zelensky have been reported to have given a standing ovation to a reported former member of a Nazi military division.",
    "url": "https://www.breitbart.com/europe/2023/09/24/zelensky-and-trudeau-give-soldier-who-reportedly-fought-for-nazi-germany-a-standing-ovation/"
  },
  {
    "text": "Anti-vaxxers are now a modern political force  —  The once-fringe movement is now seeing an influx in cash after the Covid pandemic.  —  This is the final story of a five-part series diving into the rise of the anti-vaccine political movement.  —  For years, groups at the vanguard … ",
    "url": "https://www.politico.com/news/2023/09/24/anti-vaxxers-political-power-00116527"
  },
  {
    "text": "Marjorie Taylor Greene Tweets Hanukkah Menorah Image for Yom Kippur  —  WRONG HOLIDAY!  —  Rep. Marjorie Taylor Greene (R-GA) is getting roasted on Twitter (now known as X) after posting a Yom Kippur message featuring an image of a Hanukkah menorah.  She swiftly deleted the post without … ",
    "url": "https://www.thedailybeast.com/rep-marjorie-taylor-greene-tweets-hannukah-menorah-image-for-yom-kippur"
  },
  {
    "text": "After Florida restricts Black history, churches step up to teach it  —  MIAMI — They filed into the pews one after the other on a sweltering Wednesday night, clutching Bibles and notepads, ready to learn at church what they no longer trusted would be taught at school.",
    "url": "https://www.washingtonpost.com/nation/2023/09/24/florida-black-history-churches-teaching/"
  },
  {
    "text": "Menendez will hold press conference on Monday  —  U.S. Senator Bob Menendez will hold a press conference on Monday morning in Hudson County, where he grew up and where he launched his political career as a 20-year-old school board member, making his first public comments since his indictment on federal corruption charges on Friday.",
    "url": "https://newjerseyglobe.com/congress/menendez-will-hold-press-conference-on-monday/"
  },
  {
    "text": "This Week with Gosar  —  BREAKING NEWS: 232,972 Illegals Crossed the Border in August  —  Late Friday Biden quietly announced that nearly 233,000 illegal aliens crossed the southern border last month.  He didn't want you to know that's why he waited until the last minute to release the latest data.",
    "url": "https://gosar.house.gov/news/email/show.aspx?ID=P57YDUJWJGKSVINHGEIZ6D6JJM"
  }
]