[
  {
    "text": "Biden's polling denial: Why he doesn't believe he's behind … - That bedrock belief has informed Biden's largely steady-as-she-goes campaign — even as many Democrats outside the White House are agitating for the campaign to change direction, given that Biden is polling well behind where he was four years ago.",
    "url": "https://www.axios.com/2024/05/14/biden-polls-denial-trump-2024-election"
  },
  {
    "text": "DOJ requests judge order Steve Bannon to begin prison sentence  —  An appeals court upheld Bannon's contempt of Congress conviction last week.  —  Steve Bannon, former adviser to Donald Trump, speaks at the Turning Point Action conference in West Palm Beach, Fla., July 16, 2023.",
    "url": "https://abcnews.go.com/Politics/doj-requests-judge-order-steve-bannon-begin-prison/story?id=110209704"
  },
  {
    "text": "Live Updates: Cohen Says He Sought to Influence Election With Payment ‘on Behalf of Mr. Trump’  —  Michael D. Cohen, Donald J. Trump's former fixer, described Mr. Trump confirming a plan to pay him back for buying the silence of a porn star, Stormy Daniels.  Mr. Trump faces 34 felony counts related to the reimbursement.",
    "url": "https://www.nytimes.com/live/2024/05/14/nyregion/trump-trial-news-michael-cohen"
  },
  {
    "text": "Speaker Johnson to attend Trump trial in Manhattan in show of support  —  House Speaker Mike Johnson is in Manhattan on Tuesday morning, his office tells Fox News Digital  —  House Speaker Mike Johnson, R-La., is expected in downtown Manhattan on Tuesday morning to show solidarity with former President Trump during his criminal trial.",
    "url": "https://www.foxnews.com/politics/speaker-johnson-attend-trump-trial-manhattan-show-support"
  },
  {
    "text": "Mike Johnson expected to join Trump at N.Y. criminal trial … - North Dakota Gov. Burgum, a Trump VP contender, is also expected in court on Tuesday, Axios has learned.  — So is fellow VP contender Vivek Ramaswamy, his spokesperson confirmed to Axios on Monday.",
    "url": "https://www.axios.com/2024/05/14/mike-johnson-new-york-trump-criminal-trial"
  },
  {
    "text": "Gaza: Israelis Attacking Known Aid Worker Locations  —  End Unlawful Attacks, Ensure Accountability  —  Israeli forces have carried out at least eight strikes on aid workers' convoys and premises in Gaza since October 2023, even though aid groups had provided their coordinates … ",
    "url": "https://www.hrw.org/news/2024/05/14/gaza-israelis-attacking-known-aid-worker-locations"
  },
  {
    "text": "Even When a Cop Is Killed With an Illegally Purchased Weapon, the Gun Store's Name Is Kept Secret  —  Under the Gun: How Gun Violence Is Impacting the Nation  —  As America emerged from the pandemic, communities continued to experience a rising tide of gun violence.",
    "url": "https://www.propublica.org/article/guns-chicago-police-ella-french-indiana-tiahrt-amendment"
  },
  {
    "text": "MIT Hired Six New Diversity Deans.  Two of Them Are Serial Plagiarists, Complaint Alleges.  —  In dissertation titled ‘Cite a Sista,’ Tracie Jones-Barrett stole an entire passage on ‘ethical considerations’ from her classmate  —  In June 2021, a year into the cultural aftershocks of George Floyd's death … ",
    "url": "https://freebeacon.com/campus/mit-hired-six-new-diversity-deans-two-of-them-are-serial-plagiarists-complaint-alleges/"
  },
  {
    "text": "Ken Griffin Waits to See Trump's VP Pick Before Backing Him  — Griffin declined to name who he'd like as Trump's running mate  — The Citadel CEO is a prolific donor to Republican candidates  —  Ken Griffin, one of the most prolific supporters of Republicans across the US … ",
    "url": "https://www.bloomberg.com/news/articles/2024-05-14/ken-griffin-is-waiting-to-see-trump-s-vp-pick-before-backing-him"
  },
  {
    "text": "Fox News and the MAGA media are lining up their shot at American democracy  —  With the presidential election less than half a year away, evidence is everywhere that the right is planning to end the American experiment in representative government if it fails to legitimately return Donald Trump to the White House.",
    "url": "https://www.mediamatters.org/fox-news/fox-news-and-maga-media-are-lining-their-shot-american-democracy"
  },
  {
    "text": "Do Americans Remember the Actual Trump Presidency?  —  One of the remarkable things about the 2024 presidential election is that for the first time since 1912 voters will have a choice between presidents who served back-to-back in the immediately preceding eight years.",
    "url": "https://nymag.com/intelligencer/article/do-americans-remember-the-actual-trump-presidency.html"
  },
  {
    "text": "Louisiana lawmakers insist child rape victims must carry their pregnancy to term  —  Former President Donald Trump, now the presumptive Republican nominee, boasts that he “broke Roe v. Wade.”  In the aftermath, according to Trump, “states are working very brilliantly” to impose various restrictions … ",
    "url": "https://popular.info/p/louisiana-lawmakers-insist-child"
  },
  {
    "text": "Clarence Thomas Hates the “Hideous Place” That Made Him Rich  —  Supreme Court justices are not above shaping their own public images.  Many of them write books, either biographies about their own lives or general treatises about their view on the law.  They often speak to law students … ",
    "url": "https://newrepublic.com/article/181538/clarence-thomas-hideous-washington-made-rich"
  },
  {
    "text": "House Democrats launch probe of Trump's dinner with oil executives  —  Lawmakers demand details of a Mar-a-Lago dinner where Trump promised to ease regulations on the oil industry while asking executives to steer $1 billion to his 2024 campaign.  —  House Democrats are launching an investigation … ",
    "url": "https://www.washingtonpost.com/climate-environment/2024/05/14/trump-oil-executives-investigation-democrats/"
  },
  {
    "text": "Dem operative daughter of NYC judge in Trump trial aided effort to kick Trump off Colorado ballot: report  —  The Brennan Center for Justice filed an amicus brief in support of the Supreme Court rejecting Trump's appeal of the Colorado Supreme Court's decision to remove him from the ballot.",
    "url": "https://thepostmillennial.com/dem-operative-daughter-of-nyc-judge-in-trump-trial-aided-effort-to-kick-trump-off-colorado-ballot-report"
  },
  {
    "text": "Playbook: The 2024 campaign heads to the House floor  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  CLICKER — “Trump's Lawyers Are Making Major Mistakes,” by Ankush Khardori: “Put simply, [DONALD] TRUMP's legal team has made several considerable … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/05/14/the-2024-campaign-heads-to-the-house-floor-00157791"
  },
  {
    "text": "NFL player rips Biden for ‘murder of innocent babies’ at college commencement speech  —  Kansas City Chiefs kicker Harrison Butker criticized President Joe Biden during a commencement speech at Benedictine College on Saturday.  —  Butker, an outspoken and devout Catholic … ",
    "url": "https://www.washingtonexaminer.com/news/3002728/nfl-player-rips-biden-for-murder-of-innocent-babies-at-college-commencement-speech/"
  },
  {
    "text": "FACT SHEET: President Biden Takes Action to Protect American Workers and Businesses from China's Unfair Trade Practices  —  President Biden's economic plan is supporting investments and creating good jobs in key sectors that are vital for America's economic future and national security.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/05/14/fact-sheet-president-biden-takes-action-to-protect-american-workers-and-businesses-from-chinas-unfair-trade-practices/"
  },
  {
    "text": "Wholesale prices rose 0.5% in April, more than expected … WATCH NOW  —  Wholesale prices jumped more than expected in April, putting up another potential roadblock to interest rate cuts anytime soon.  —  The producer price index, a gauge of prices received at the wholesale level … ",
    "url": "https://www.cnbc.com/2024/05/14/ppi-report-wholesale-prices-rose-0point5percent-in-april-more-than-expected.html"
  },
  {
    "text": "Tennessee woman denied abortion after fetus' ‘brain not attached’ slams state ban  —  State lawmakers 'don't see the mourning and the grieving that these moms' experience after getting a heartbreaking diagnosis, Breanna Cecil tells , Kelly Rissman  —  A Tennessee woman who was denied … ",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/tennessee-denied-abortion-ban-lawsuit-b2529144.html"
  }
]