[
  {
    "text": "New details about police activity after lawmaker shootings raise questions about response  —  The Minnesota Star Tribune found that Brooklyn Park police waited more than 60 minutes to enter the Hortman home and that several law enforcement agencies were unaware of the situation for hours.",
    "url": "https://www.startribune.com/article/601432709"
  },
  {
    "text": "Multiple people have been stabbed at a Walmart in Michigan and a suspect is in custody  —  Multiple people were stabbed at a Walmart in Traverse City, and a suspect was in custody, authorities said Saturday.  The Michigan State Police said the local sheriff's office is investigating the incident and details were limited.",
    "url": "https://apnews.com/article/walmart-stabbing-michigan-traverse-city-7d31d22005921a90e54c813a563c2457"
  },
  {
    "text": "11 people injured and suspect in custody after ‘random’ stabbing in Traverse City Walmart, officials say  —  Video Ad Feedback  —  Sheriff shares details in stabbing at Michigan Walmart  —  Sheriff shares details in stabbing at Michigan Walmart  —  Friend of pastor arrested by ICE details ‘subhuman’ conditions of his detainment",
    "url": "https://cnn.com/2025/07/26/us/traverse-city-walmart-stabbing-michigan"
  },
  {
    "text": "Ghislaine Maxwell's meetings with Justice Department shrouded in secrecy  —  Former prosecutors and lawyers for victims question what occurred and who was present during two days of interviews with the Jeffrey Epstein accomplice and convicted sex trafficker.",
    "url": "https://www.nbcnews.com/politics/justice-department/ghislaine-maxwell-justice-department-meetings-rcna221240"
  },
  {
    "text": "The latest child to starve to death in Gaza weighed less than when she was born  —  A mother pressed a final kiss to what remained of her 5-month-old daughter and wept.  Esraa Abu Halib's baby now weighed less than when she was born.  —  On a sunny street in shattered Gaza … ",
    "url": "https://apnews.com/article/gaza-israel-starvation-children-malnutrition-baby-baf865b861c9a2fd9c75068936062146"
  },
  {
    "text": "Parasitic sea vampire bites RFK Jr in health chief's bizarre new stunt  —  Robert F Kennedy Jr has found himself in another awkward situation involving animals.  —  On a tour of the Nez Perce salmon hatchery in Idaho on Thursday, RFK Jr let a parasitic sea vampire, also known as a lamprey … ",
    "url": "https://www.dailymail.co.uk/sciencetech/article-14941309/Parasitic-sea-vampire-bites-RFK-Jr-bizarre-stunt.html"
  },
  {
    "text": "Hegseth team told to stop polygraph tests after complaint to White House  —  The White House intervention, which has not previously been reported, came in the form of a phone call by a person close to the administration.  —  Defense Secretary Pete Hegseth's use of polygraph tests to search … ",
    "url": "https://www.washingtonpost.com/national-security/2025/07/26/pete-hegseth-leak-investigation-trump/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzUzNTAyNDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzU0ODg0Nzk5LCJpYXQiOjE3NTM1MDI0MDAsImp0aSI6Ijg5ODBjYjliLTExZGQtNDNjOC04OWYxLWJmNjQ1YjBiOThlOCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb25hbC1zZWN1cml0eS8yMDI1LzA3LzI2L3BldGUtaGVnc2V0aC1sZWFrLWludmVzdGlnYXRpb24tdHJ1bXAvIn0.iOX-_3QRd8IoaJanJkJg62YEllJg79BwdWdqfajphuc&itid=gfta"
  },
  {
    "text": "Trump urges Thailand, Cambodia ceasefire with trade talk  —  The aim of Trump and other world leaders is to halt the fiercest border clash between Thailand and Cambodia in 13 years  —  WASHINGTON - President Donald Trump urged the leaders of Cambodia and Thailand to end three days … ",
    "url": "https://www.usatoday.com/story/news/world/2025/07/26/trump-thailand-cambodia-border-dispute-trade/85389013007/"
  },
  {
    "text": "E.U. Cuts Aid to Ukraine Over Corruption Concerns  —  The $1.7 billion reduction capped a tough week for President Volodymyr Zelensky as he deals with Ukraine's governance issues.  —  President Volodymyr Zelensky's anticorruption policies have already provoked Ukraine's first antigovernment protests since the Russian invasion in 2022.",
    "url": "https://www.nytimes.com/2025/07/26/world/europe/eu-ukraine-corruption-aid.html"
  },
  {
    "text": "Musk sought to stoke the Trump-Epstein scandal.  Mission accomplished.  —  The former “first buddy” remains a potent political risk for Trump months after he publicly left the White House.  —  President Donald Trump split with Elon Musk almost two months ago.",
    "url": "https://www.washingtonpost.com/politics/2025/07/26/trump-epstein-musk-controversy/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzUzNTAyNDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzU0ODg0Nzk5LCJpYXQiOjE3NTM1MDI0MDAsImp0aSI6IjA5YTNhMjlhLTk0OGMtNDUxOC1hMTY2LTVjYmNiYWE0YmQ3MyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzA3LzI2L3RydW1wLWVwc3RlaW4tbXVzay1jb250cm92ZXJzeS8ifQ.9sEcuOChbtzQKM9qBEu06L5zPn9eKPoExEAYGMarmeo&itid=gfta"
  },
  {
    "text": "How redistricting in Texas and other states could change the game for US House elections  —  Redistricting usually happens after the once-a-decade population count by the U.S. Census Bureau or in response to a court ruling.  Now, Texas Republicans want to break that tradition — and other states could follow suit.",
    "url": "https://apnews.com/article/texas-trump-redistricting-census-california-republicans-constitutional-1c6287fc23214548be734bbbf7056117"
  },
  {
    "text": "Four stories that are more important than the Epstein Files  —  The Jeffrey Epstein story has swallowed the country whole. … Over the past couple of weeks, one story has overshadowed every other, no matter how important they might be: Jeffrey Epstein.  —  Unless you've been taking … ",
    "url": "https://www.vox.com/future-perfect/421254/jeffrey-epstein-files-donald-trump-national-debt-media"
  },
  {
    "text": "A Golfing Trump Is Greeted by Protesters in Scotland  —  The president was criticized by demonstrators on a range of issues, from his stance on immigration and Gaza to his ties to the sex offender Jeffrey Epstein.  —  As President Trump golfed Saturday at his course in Turnberry, Scotland … ",
    "url": "https://www.nytimes.com/2025/07/26/world/europe/trump-protest-scotland.html"
  },
  {
    "text": "Democratic candidates are posting weightlifting videos in search of a midterm lift  —  Democrats running in next year's midterms are pumping out videos of themselves pumping iron.  —  In one video, Texas Senate candidate Colin Allred stands in his home gym after a workout and, still in a sweat … ",
    "url": "https://cnn.com/2025/07/26/politics/democrats-weightlifting-videos"
  },
  {
    "text": "Trump says Kamala Harris should be prosecuted over celebrity endorsements  —  President Donald Trump called for former Vice President Kamala Harris to be prosecuted over large sums her campaign doled out to celebrities on the campaign trail in 2024.  —  In a Truth Social post on Saturday night … ",
    "url": "https://www.washingtonexaminer.com/news/white-house/3483260/trump-kamala-harris-should-be-prosecuted-celebrity-endorsements/"
  },
  {
    "text": "Prison debt is crushing Black women, advocates say  —  Nearly all states allowing jails and prisons to charge incarcerated people for room and board or medical care highlights a deeper problem: their families, especially Black women, are forced to cover the costs, according to a new report.",
    "url": "https://www.axios.com/2025/07/26/states-inmates-pay-incarceration-black-women"
  },
  {
    "text": "Lauren Boebert's Son Charged With Misdemeanor Child Abuse  —  The Congresswoman's oldest son was on probation after pleading guilty to identity theft last October. … Audio By Carbonatix … According to records obtained from the Windsor Police Department and confirmed … ",
    "url": "https://www.westword.com/news/lauren-boeberts-son-now-facing-child-abuse-charge-25141015"
  },
  {
    "text": "Elon Musk is threatening to put third-party candidates on the ballot.  Democrats are giddy. … Musk was one of President Donald Trump's biggest benefactors in the 2024 election, spending hundreds of millions to help get him and other Republicans elected.  But since his break with the president … ",
    "url": "https://www.politico.com/news/2025/07/26/elon-musk-america-party-swing-states-00477177"
  }
]