[
  {
    "text": "Trump allegedly discussed US nuclear subs with foreign national after leaving White House: Sources  —  Trump allegedly discussed the information with an Australian billionaire.  —  Months after leaving the White House, former President Donald Trump allegedly discussed potentially sensitive information … ",
    "url": "https://abcnews.go.com/US/after-white-house-trump-allegedly-discussed-potentially-sensitive/story?id=103760456"
  },
  {
    "text": "America needs to talk about the right's ‘Red Caesar’ plan for U.S. dictatorship  —  The incredible scenes this week on Capitol Hill — leaving the U.S. House without a speaker and promising an autumn of sheer chaos in Congress — marked a rapid escalation of the downward spiral of American democracy.",
    "url": "https://www.inquirer.com/opinion/red-caesar-right-american-dictatorship-20231005.html"
  },
  {
    "text": "‘What Is Broken in American Politics Is the Republican Party’  —  Fourteen experts on the roots of Kevin McCarthy's ouster and what's broken in American politics  —  “McCarthy chose to accept his fate” “Trump acted as a lightning rod” “The culture of democracy is robust” “A project at war with the Constitution”",
    "url": "https://www.politico.com/news/magazine/2023/10/06/republican-leaders-mccarthy-expert-roundup-00120170"
  },
  {
    "text": "Playbook: Inside Trump's surprise endorsement  —  Presented by With help from Eli Okun and Garrett Ross  —  DRIVING THE DAY  —  BREAKING OVERNIGHT — AP: “Imprisoned activist NARGES MOHAMMADI won the Nobel Peace Prize Friday for fighting the oppression of women in Iran.”",
    "url": "https://www.politico.com/newsletters/playbook/2023/10/06/inside-trumps-surprise-endorsement-00120314"
  },
  {
    "text": "Trump Said to Have Revealed Nuclear Submarine Secrets to Australian Businessman  —  Soon after leaving office, the former president shared sensitive information about American submarines with a billionaire member of Mar-a-Lago, according to people familiar with the matter.",
    "url": "https://www.nytimes.com/2023/10/05/us/politics/trump-nuclear-submarine-classified-documents.html"
  },
  {
    "text": "The Irony of Trump Whining About a Jury Trial His Lawyers Didn't Formally Request  —  How can Donald Trump complain about not getting a jury trial if his own lawyers didn't file the paperwork to ask for one?  By being Donald Trump. … When the judge overseeing Donald Trump's bank fraud trial reminded … ",
    "url": "https://www.thedailybeast.com/the-irony-of-trump-whining-about-a-jury-trial-his-lawyers-didnt-formally-request"
  },
  {
    "text": "Trump moves to “temporarily” dismiss $500 million lawsuit against Michael Cohen  —  Former President Donald Trump moved Thursday to dismiss his $500 million lawsuit against his former lawyer, Michael Cohen, without prejudice, allowing him to refile the suit again in the future.",
    "url": "https://www.cbsnews.com/news/trump-moves-temporarily-dismiss-michael-cohen-lawsuit/"
  },
  {
    "text": "Speaker race splits House Republicans … Hern hasn't officially entered the speaker race.  —  House Republicans will host a candidate forum Tuesday night and the closed party election Wednesday.  There is no timeline for electing a speaker on the House floor. … There's no other way to say it.",
    "url": "https://punchbowl.news/article/jordan-scalise-hern-to-face-off-in-speaker-debate/"
  },
  {
    "text": "During an online fundraiser, Matt Gaetz denounced the Biden impeachment effort as unserious  —  As the House tries to replace Kevin McCarthy, the future of the impeachment inquiry could become a bargaining chip in the wrangling to win the speakership.  —  WASHINGTON — Days before Rep. Matt Gaetz led … ",
    "url": "https://www.nbcnews.com/politics/congress/gaetz-biden-impeachment-rosendale-rcna119131"
  },
  {
    "text": "I.R.S. Puts Lien on Giuliani's Palm Beach Condo for $550,000 Tax Debt  —  The action by federal tax officials is the latest sign of Rudolph W. Giuliani's growing financial troubles.  —  The I.R.S. has placed a lien on a Florida property owned by Rudolph W. Giuliani, the former New York City mayor … ",
    "url": "https://www.nytimes.com/2023/10/05/us/politics/irs-lien-giuliani-palm-beach-condo.html"
  },
  {
    "text": "Hannity Mocks ‘The View’ Co-Host by Saying His Dad Hit Him With a Belt  —  CORPORAL PUNISHMENT  —  Sean Hannity took a swipe at The View co-host Sunny Hostin on Thursday night for being a “snowflake” and said his own father used to beat him with a belt.  In a segment about Rep. Jim Jordan … ",
    "url": "https://www.thedailybeast.com/hannity-mocks-the-view-co-host-sunny-hostin-by-saying-his-dad-hit-him-with-a-belt"
  },
  {
    "text": "Payrolls soared by 336,000 in September, defying expectations for a hiring slowdown  — Nonfarm payrolls increased by 336,000 for the month, better than the Dow Jones consensus estimate for 170,000.  — Average hourly earnings rose 0.2% for the month and 4.2% from a year ago, compared to respective estimates for 0.3% and 4.3%.",
    "url": "https://www.cnbc.com/2023/10/06/jobs-report-september-2023.html"
  },
  {
    "text": "Narges Mohammadi, Jailed Iranian Activist, Is 2023 Laureate  —  The activist, who is serving a 10-year sentence in Tehran, was honored “for her fight against the oppression of women in Iran.”  —  Here's what to know about this year's prize.  —  Narges Mohammadi, an Iranian activist … ",
    "url": "https://www.nytimes.com/live/2023/10/06/world/nobel-peace-prize"
  },
  {
    "text": "Kentucky 2023 Poll: Beshear Holds 16-Point Lead Over Cameron in Gubernatorial Election  —  Home Polls Kentucky 2023 Poll: Beshear Holds 16-Point Lead Over Cameron in Gubernatorial Election  —  A new Emerson College Polling survey of Kentucky voters finds incumbent Democratic Governor Andy Beshear … ",
    "url": "https://emersoncollegepolling.com/kentucky-2023-poll-beshear-holds-16-point-lead-over-cameron-in-gubernatorial-election/"
  },
  {
    "text": "‘A Slap in the Face of Voters’: What R.N.C. Members Say About Trump's Calls to Cancel Debates  —  Many members of the Republican National Committee say they are giving little weight to the Trump campaign's appeal.  —  After refusing to participate in the first two Republican debates … ",
    "url": "https://www.nytimes.com/2023/10/06/us/politics/republican-debate-rnc.html"
  },
  {
    "text": "Unusual Repurpose of Giraffe Feces Seized by Minnesota  —  MINNEAPOLIS—U.S. Customs and Border Protection (CBP) agriculture specialists at Minneapolis - Saint Paul International Airport (MSP) inspected a small box containing giraffe fecal material.  —  On September 29, a passenger returning … ",
    "url": "https://www.cbp.gov/newsroom/local-media-release/unusual-repurpose-giraffe-feces-seized-minnesota"
  },
  {
    "text": "Ivory Coast president removes prime minister, dissolves government  —  Ivory Coast's President Alassane Ouattara has removed the prime minister and dissolved his government, the presidency's secretary general Aboudramane Cisse said on Friday.  —  No reason was provided for the unexpected move.",
    "url": "https://www.reuters.com/world/africa/ivory-coast-president-has-dissolved-government-presidency-2023-10-06/"
  },
  {
    "text": "Hillary Clinton says ‘MAGA extremists’ may need ‘formal deprogramming’  —  Former Secretary of State Hillary Clinton said “MAGA extremists” may need a “formal deprogramming” while slamming followers of former President Donald Trump.  —  Clinton, who lost to Trump in the 2016 presidential election … ",
    "url": "https://www.washingtonexaminer.com/news/campaigns/hillary-clinton-says-maga-extremists-may-need-formal-deprogramming"
  },
  {
    "text": "American Airlines is sorry for accusing David Ryan Harris, who was traveling with his kids, of child trafficking  —  Homepage News  —  American Airlines has apologized to musician David Ryan Harris for stopping and questioning him at LAX last month because they suspected he was trafficking children.",
    "url": "https://www.latimes.com/entertainment-arts/story/2023-10-05/american-airlines-apologizes-to-david-ryan-harris-after-falsely-accusing-him-of-trafficking-children"
  },
  {
    "text": "Boston University Loaned $600K to a Mysterious Trust Run by Ibram Kendi's Brother-In-Law  —  Kendi's Center for Antiracist Research faces allegations of financial mismanagement  —  In September of 2020, just weeks after Ibram X. Kendi launched the Center for Antiracist Research at Boston University … ",
    "url": "https://freebeacon.com/issues/boston-university-loaned-600k-to-a-mysterious-trust-run-by-ibram-kendis-brother-in-law/"
  },
  {
    "text": "White House planning face-to-face meeting with Xi Jinping in California  —  With tension high, the leaders will look to reset relations at the Asia-Pacific Economic Cooperation summit in November, administration officials say  —  The White House has begun making plans for a November meeting … ",
    "url": "https://www.washingtonpost.com/national-security/2023/10/05/biden-xi-meeting-apec-summit/"
  },
  {
    "text": "Spoiler alert: Biden world is taking third-party threats seriously  —  The president's campaign is preparing to take on challengers.  And big Dem donors are trying to fund counter-offensive operations.  —  LinkedIn co-founder Reid Hoffman convened a Zoom call with 30 other like-minded donors … ",
    "url": "https://www.politico.com/news/2023/10/06/biden-donors-third-party-challengers-2024-00120285"
  },
  {
    "text": "Nancy Mace Solicits Campaign Funds on Fox, Flouting House Rules  —  ‘PRINCIPLED STAND’  —  Rep. Nancy Mace (R-SC), one of the eight Republicans who voted to oust Kevin McCarthy from the speakership, could soon find herself in hot water with the House Ethics Committee.",
    "url": "https://www.thedailybeast.com/nancy-mace-solicits-campaign-funds-on-fox-flouting-house-rules"
  }
]