[
  {
    "text": "Trump Team Leaves Behind an Alliance in Crisis  —  European leaders felt certain about one thing after a whirlwind tour by Trump officials — they were entering a new world where it was harder to depend on the United States.  —  Many critical issues were left uncertain … ",
    "url": "https://www.nytimes.com/2025/02/16/us/politics/trump-europe-alliance-crisis.html"
  },
  {
    "text": "The US said Ukraine would meet with Russia to discuss peace.  That was news to Kyiv.  —  “I do not know what it is,” said Ukraine's President Volodymyr Zelenskyy. … MUNICH — Ukrainian officials reacted with a mixture of shock and confusion to the news that top Trump administration officials … ",
    "url": "https://www.politico.eu/article/us-ukraine-russia-peace-kyiv-eu-munich-security-conference/"
  },
  {
    "text": "Ukraine Won't Accept a Deal It Didn't Help Negotiate, Zelensky Says  —  Volodymyr Zelensky, the president of Ukraine, told NBC News that he'd warned President Trump that Russia's president, Vladimir Putin, is a “liar.”  —  President Volodymyr Zelensky of Ukraine reiterated in an interview … ",
    "url": "https://www.nytimes.com/2025/02/16/us/politics/ukraine-zelensky-trump-russia.html?unlocked_article_code=1.xU4.l4WU.evOOBrzPwvJ0&smid=url-share"
  },
  {
    "text": "Transcript: Rep. Dan Crenshaw on “Face the Nation with Margaret Brennan,” Feb. 16, 2025  —  The following is the transcript of an interview with GOP Rep. Dan Crenshaw of Texas that aired on “Face the Nation with Margaret Brennan” on Feb. 16, 2025.  —  MARGARET BRENNAN: And we go now to … ",
    "url": "https://www.cbsnews.com/news/dan-crenshaw-face-the-nation-transcript-02-16-2025/"
  },
  {
    "text": "Musk's DOGE seeks access to personal taxpayer data, raising alarm at IRS  —  The unusual request would put sensitive data about millions of American taxpayers in the hands of Trump political appointees.  —  Elon Musk's U.S. DOGE Service is seeking access to a heavily-guarded Internal Revenue Service system … ",
    "url": "https://www.washingtonpost.com/business/2025/02/16/doge-irs-access-taxpayer-data/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM5NjgyMDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQxMDY0Mzk5LCJpYXQiOjE3Mzk2ODIwMDAsImp0aSI6ImQyZjZkNzAxLWRlNDYtNDBkMy1hMzdlLTEzYTVkMmFiZDQwZSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9idXNpbmVzcy8yMDI1LzAyLzE2L2RvZ2UtaXJzLWFjY2Vzcy10YXhwYXllci1kYXRhLyJ9.GTR7Kzo7RHkVEfAw9fm8z_ME0V59fiFRofc8rtH9dG8&itid=gfta"
  },
  {
    "text": "Trump Asks Supreme Court to Let Him Fire US Agency Head  — Justices asked to step in on emergency basis, person says  — Trump seeking to remove head of US whistleblower agency  —  President Donald Trump asked the US Supreme Court to let him fire the head of an independent US agency … ",
    "url": "https://www.bloomberg.com/news/articles/2025-02-16/trump-administration-asks-supreme-court-to-intervene-on-firing"
  },
  {
    "text": "Appeals court rejects Trump in showdown over firing of ethics watchdog  —  The D.C. Circuit panel voted, 2-1, against the president's bid to immediately remove Hampton Dellinger.  —  A divided federal appeals court panel has again turned down President Donald Trump's request to follow through … ",
    "url": "https://www.politico.com/news/2025/02/16/appeals-court-rejects-trump-in-showdown-over-firing-of-ethics-watchdog-00204551"
  },
  {
    "text": "Trump administration asks Supreme Court to greenlight whistleblower office firing  —  The Justice Department is asking the Supreme Court to greenlight President Trump's firing of the head of a federal whistleblower protection office, marking the new Trump administration's first appeal to the high court.",
    "url": "https://thehill.com/homenews/5148365-trump-supreme-court-whistleblower-office-firing/"
  },
  {
    "text": "Democrats confront their powerlessness as Trump flexes authority  —  Amid Democrats' shock and bickering over how much to respond to President Donald Trump is a deeper question rippling through leaders across the Capitol and across the country: How much should they rely on the same institutional … ",
    "url": "https://www.cnn.com/2025/02/16/politics/democrats-strategy-powerless-trump/"
  },
  {
    "text": "US Health Department Layoffs Expand to Medicare, FDA  — Employees at CMS, FDA, CDC received notices in weekend cuts  —  The Department of Health and Human Services laid off employees Saturday evening across some of its biggest agencies — the Centers for Medicare and Medicaid Services … ",
    "url": "https://www.bloomberg.com/news/articles/2025-02-16/us-health-department-layoffs-expand-to-medicare-fda"
  },
  {
    "text": "Mass firings continue across nation's health agencies  —  The cuts have raised questions about the extent of the impact on public health.  —  The Trump administration carried out more mass firings across the Health and Human Services Department this weekend, continuing a chaotic purge … ",
    "url": "https://www.politico.com/news/2025/02/16/mass-firings-health-agencies-00204570"
  },
  {
    "text": "DOGE Mismanagement Principles  —  Sam Rayburn, the Texan who served as House Speaker for 17 years was fond of saying: … Rayburn was talking about policymaking, but the point extends to more broadly to governing.  Trashing government agencies is easy.  Making them work is hard.",
    "url": "https://donmoynihan.substack.com/p/doge-mismanagement-principles"
  },
  {
    "text": "Boycotting President Elon  —  Protests have been gathering around Tesla dealerships: … Elon has also been an increasing focus of protests of other venues, which makes sense — a white nationalist plutocrat being given unaccountable power helps cut through the “populist” … ",
    "url": "https://www.lawyersgunsmoneyblog.com/2025/02/boycotting-president-elon"
  },
  {
    "text": "Washington Post backs out of ‘Fire Elon Musk’ ad order  —  The Washington Post this week backed out of a “Fire Elon Musk” advertising order that was to run as a wrap on some of its Tuesday editions, according to the advocacy group Common Cause.  —  The group said it signed a $115,000 agreement … ",
    "url": "https://thehill.com/media/5148497-washington-post-backs-out-of-fire-elon-musk-ad-order/"
  },
  {
    "text": "Congresswoman Tenney Moves to Make President Trump's Birthday a Federal Holiday  —  Washington, DC - Congresswoman Claudia Tenney (NY-24) today introduced the Trump's Birthday and Flag Day Holiday Establishment Act to officially designate June 14 as a federal holiday to commemorate President Donald J. Trump's Birthday and Flag Day.",
    "url": "https://tenney.house.gov/media/press-releases/congresswoman-tenney-moves-make-president-trumps-birthday-federal-holiday"
  },
  {
    "text": "John Major: Trump's US isolationism threatens global democracy  —  Former UK prime minister says US may regret ceding world stage to China and condemns ‘hypocritical’ JD Vance speech  —  Democracy around the globe is under threat from the retreat of Donald Trump's US into isolationism … ",
    "url": "https://www.theguardian.com/politics/2025/feb/16/john-major-trump-us-isolationism-threatens-global-democracy"
  },
  {
    "text": "Trump administration firings hit key office handling bird flu response  —  The layoffs in USDA's National Animal Health Laboratory Network program office come as egg prices reach record high amid worsening outbreak.  —  Laboratories in a national network of 58 facilities responding to the spread … ",
    "url": "https://www.politico.com/news/2025/02/16/trump-administration-firings-bird-flu-response-00204542"
  },
  {
    "text": "The Worst and the Dimmest  —  Hey cousins.  The world's richest man held court in the Oval Office this week while his pet president watched from the resolute desk wearing his trademark pants-shitting scowl.  The world's richest man was telling the press lies to repeat while holding his hands … ",
    "url": "https://www.the-reframe.com/the"
  },
  {
    "text": "'I think that's ridiculous': Tom Homan on quid pro quo speculation over Eric Adams  —  “It was cop to cop, not border czar to mayor, cop to cop.  And we talked about the public safety threats and how they should be removed from our communities,” Homan said on CNN.",
    "url": "https://www.politico.com/news/2025/02/16/homan-adams-immigration-rikers-justice-00204559"
  }
]