[
  {
    "text": "Democrats laugh off Greene's plan to force Johnson ouster vote … - “She is about to realize her inevitable irrelevance,” one senior House Democrat told Axios just minutes after Greene made her announcement.  — Another senior House Democrat cast Greene's motion as “drama that hurts Republicans.”",
    "url": "https://www.axios.com/2024/05/01/democrats-greene-vote-mike-johnson-ouster"
  },
  {
    "text": "McConnell says he's ready for ‘chaos’ in House to end  —  Senate Republican Leader Mitch McConnell (Ky.) on Wednesday said he's ready for the “chaos” that has plagued the House for much of 2023 and 2024 to end next week, when a bipartisan group of lawmakers is expected to vote to quash a motion … ",
    "url": "https://thehill.com/homenews/4636847-mcconnell-house-chaos-johnson/"
  },
  {
    "text": "Arizona's Democratic leaders get enough votes to repeal 19th century abortion ban  —  Democrats secured enough votes in the Arizona Senate on Wednesday to repeal a Civil War-era ban on abortions that the state's highest court recently allowed to take effect.",
    "url": "https://apnews.com/article/arizona-abortion-1864-ban-repeal-24578e546b69ca087e01034bcaf4aa01"
  },
  {
    "text": "Arizona Senate passes repeal of 1864 abortion ban, sending it to governor's desk  —  Once signed, the legislation won't take effect for several months.  —  Members of Arizona for Abortion Access, the ballot initiative to enshrine abortion rights in the Arizona State Constitution … ",
    "url": "https://abcnews.go.com/Politics/arizona-senate-passes-repeal-1864-abortion-ban-sending/story?id=109827722"
  },
  {
    "text": "Dueling protesters clash at UCLA hours after police clear pro-Palestinian demonstration at Columbia  —  Officers have taken protesters into custody after Columbia University called in police to end the pro-Palestinian occupation on the New York campus.  The scene unfolded shortly … ",
    "url": "https://apnews.com/article/israel-palestinian-campus-student-protests-war-c6e5549532c85f13493daa22d0d143ac"
  },
  {
    "text": "Trump tries to paint college campus anti-Israel protests as a Biden political liability  —  Biden aides have said they think the protests will blow over.  —  WASHINGTON — Joe Biden's advisers believe that tensions over U.S. support for Israel in the war in Gaza spreading through college campuses … ",
    "url": "https://www.nbcnews.com/politics/2024-election/trump-tries-paint-college-campus-anti-israel-protests-biden-political-rcna150253"
  },
  {
    "text": "Trump backs surveillance and prosecution of women to enforce abortion bans  —  As part of an extensive interview with Time Magazine, former President Donald Trump expanded on what abortion access would look like in the United States in a potential second term.",
    "url": "https://popular.info/p/trump-backs-surveillance-and-prosecution"
  },
  {
    "text": "Trump to address Libertarian Party convention  —  Former President Trump is planning to speak at the Libertarian Party's convention in D.C. later this month, his campaign confirmed on Wednesday.  —  Trump will “address concerns voiced by its members” during the address on May 25, the party said in a statement.",
    "url": "https://thehill.com/homenews/campaign/4636581-trump-address-libertarian-party-convention/"
  },
  {
    "text": "Trump Is Now Raging at His Own Lawyer—and Wrecking a Big MAGA Fantasy  —  Because Donald Trump must always be seen as wielding absolute mastery over his hapless, flailing opponents, he and his propagandists want you to believe his hush-money trial in Manhattan has proven nothing but a smashing political success for him.",
    "url": "https://newrepublic.com/article/181138/trump-raging-lawyer-todd-blanche-maga-fantasy"
  },
  {
    "text": "Saudis push for ‘plan B’ that excludes Israel from key deal with US  —  Riyadh seeks more modest agreement with Washington in absence of Gaza ceasefire and Netanyahu resistance to Palestinian state  —  The US and Saudi Arabia have drafted a set of agreements on security and technology-sharing … ",
    "url": "https://www.theguardian.com/world/2024/may/01/saudi-us-biden-deal-israel"
  },
  {
    "text": "Giuliani's Bankruptcy Creditors Demand to Know His Spending  —  The former New York mayor and Trump lawyer actually spent nearly $120,000 in January, and his creditors say he is still not turning over required financial information.  —  Besieged by creditors and with his income drying up … ",
    "url": "https://www.nytimes.com/2024/05/01/us/politics/bankruptcy-giuliani-spending.html"
  },
  {
    "text": "Biden must remember the reason Jordan, Egypt, and the rest of the Middle East don't accept Palestinian refugees  —  .  —  In the first half of this fiscal year alone, the United States has admitted 42,000 Chinese nationals, 14,000 Russian nationals, 8,000 Turkish nationals, and 43,000 Indian nationals who crossed our southern border.",
    "url": "https://www.washingtonexaminer.com/opinion/2986510/biden-jordan-egypt-middle-east-palestinian-refugees/"
  },
  {
    "text": "Exclusive: DOJ civil rights leader says she was a victim of abuse in extraordinary statement  —  The leader of the Justice Department's civil rights division, Kristen Clarke, said in an extraordinary personal statement shared with CNN that she was a victim of years-long domestic abuse and chose … ",
    "url": "https://www.cnn.com/2024/05/01/politics/kristen-clarke-justice-department-domestic-violence/"
  },
  {
    "text": "Whistleblower Josh Dean of Boeing supplier Spirit AeroSystems has died  —  Joshua Dean, a former quality auditor at Boeing supplier Spirit AeroSystems and one of the first whistleblowers to allege Spirit leadership had ignored manufacturing defects on the 737 MAX, died Tuesday morning … ",
    "url": "https://www.seattletimes.com/business/whistleblower-josh-dean-of-boeing-supplier-spirit-aerosystems-has-died/"
  },
  {
    "text": "Members of Congress demand answers on Mario Andretti's rejection from F1 races  —  The letter accuses Formula One Management of possibly violating antitrust laws.  —  Formula One racing legend Mario Andretti listens during a news conference at the Capitol in Washington, May 1, 2024.",
    "url": "https://abcnews.go.com/Politics/members-congress-demand-answers-mario-andrettis-rejection-f1/story?id=109838108"
  },
  {
    "text": "House passes divisive antisemitism bill as GOP denounces campus protests  —  Critics call the Antisemitism Awareness Act, which has some Democratic support, an effort to silence criticism of Israel and an affront to the First Amendment  —  House Republicans are seeking to unite … ",
    "url": "https://www.washingtonpost.com/national-security/2024/05/01/antisemitism-awarness-act-campus-protests/"
  },
  {
    "text": "A Huge Gender Gap Is Emerging Among Young Voters  —  It has become clear that one constituency — young voters, 18 to 29 years old — will play a key, if not pivotal, role in determining who will win the Biden-Trump rematch.  —  Four years ago, according to exit polls, voters in this age group kept Trump from winning re-election.",
    "url": "https://www.nytimes.com/2024/05/01/opinion/biden-younger-voters-gender.html"
  },
  {
    "text": "Trump confirms he wanted to go to Capitol on Jan. 6  —  Former President Trump on Wednesday confirmed he told Secret Service agents he wanted to go to the Capitol on Jan. 6, 2021, while he mocked the claim that he lunged at officers in his vehicle when they refused.",
    "url": "https://thehill.com/homenews/campaign/4636879-trump-confirms-he-wanted-to-go-to-capitol-on-jan-6/"
  },
  {
    "text": "The Ozempic Effect: How a Weight Loss Wonder Drug Gobbled Up an Entire Economy  —  The blockbuster drug producer is Europe's most valuable company — and its home country is feeling the effects  —  There is no escaping Ozempic and Wegovy.  The diabetes and obesity drugs are a global phenomenon.",
    "url": "https://www.bloomberg.com/news/features/2024-04-30/denmark-and-novo-nordisk-ozempic-maker-s-success-makes-huge-impact"
  },
  {
    "text": "Trump's sit-downs with foreign officials are ‘annoying’ some in Biden's camp  —  It's not unusual for a presidential nominee to meet with foreign officials, but Trump's meetings have, at times, had the trappings of a state visit.  —  WASHINGTON — As Donald Trump rolled out the red carpet … ",
    "url": "https://www.nbcnews.com/politics/2024-election/trump-foreign-officials-annoying-biden-rcna148904"
  },
  {
    "text": "The 8 Types Of Democrats And Republicans In The House  —  We analyzed voting patterns to see if members actually vote with their caucuses.  —  Amina Brown  —  Some say Congress is a lot like high school — but who lawmakers vote with isn't necessarily who they sit with in the cafeteria.",
    "url": "https://projects.fivethirtyeight.com/types-democrats-republicans-house-2024/"
  },
  {
    "text": "‘A step back in time’: America's Catholic Church sees an immense shift toward the old ways  —  It was the music that changed first.  Or maybe that's just when many people at the pale brick Catholic church in the quiet Wisconsin neighborhood finally began to realize what was happening.",
    "url": "https://apnews.com/article/catholic-church-shift-orthodoxy-tradition-7638fa2013a593f8cb07483ffc8ed487"
  },
  {
    "text": "RFK Jr. is all over conservative media.  Trump's camp is concerned.  —  The independent presidential candidate is quickly becoming a thorn in Donald Trump's side.  —  Robert F. Kennedy Jr.'s increasingly frequent appearances on conservative media platforms are beginning to raise alarms at Mar-a-Lago.",
    "url": "https://www.politico.com/news/2024/05/01/rfk-jr-trump-2024-elections-00155425"
  },
  {
    "text": "Israel tells U.S. it will punish Palestinian Authority if ICC issues warrants … - That investigation has been extended to the Oct. 7 attacks and the war that has been raging in Gaza since then, according to the prosecutor's office. … - U.S. and Israeli officials said Israel told … ",
    "url": "https://www.axios.com/2024/05/01/us-israel-palestinian-authority-icc-arrest-warrant"
  }
]