[
  {
    "text": "Donald Trump may not pay bond — and instead let Letitia James seize Trump Tower: insiders  —  As Donald Trump faces a Monday deadline to post a $454 million bond in the civil fraud case against him in New York, insiders said he may be weighing a little-discussed option: Do nothing.",
    "url": "https://nypost.com/2024/03/20/business/donald-trump-may-not-pay-bond-and-instead-let-letitia-james-seize-trump-tower-insiders/"
  },
  {
    "text": "Panic mode sets in for Trump as he faces deadline for massive bond  —  Former President Donald Trump is in panic mode as the deadline approaches to secure a half-billion-dollar bond to appeal his civil fraud case in New York, according to multiple sources familiar with his thinking.",
    "url": "https://www.cnn.com/2024/03/19/politics/trump-bond-deadline-panic"
  },
  {
    "text": "What Trump Supporters Think When He Mocks People With Disabilities  —  Last weekend, I stood among thousands of Donald Trump supporters in a windy airfield, watching them watch their candidate.  I traveled to the former president's event just outside Dayton, Ohio, because I couldn't stop thinking … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/03/trump-disabilities-supporters-responses/677812/"
  },
  {
    "text": "Nostalgic for the Trump years?  That's because his draconian budget cuts never passed.  —  A New York Times poll released this month revealed that more voters believe Donald Trump's policies benefitted them personally than feel that way about Joe Biden's policies.  We have news for these Americans.",
    "url": "https://thehill.com/opinion/white-house/4545202-nostalgic-for-the-trump-years-thats-because-his-draconian-budget-cuts-never-passed/"
  },
  {
    "text": "Biden impeachment hearing descends into chaos as lawmaker caught on hot mic branding it ‘Jurassic Park’  —  'You can't make this stuff up,' someone can be heard saying  —  A hot mic captured a lawmaker labelling the heated House Oversight Committee's impeachment inquiry hearing … ",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/biden-impeachment-hearing-jurassic-park-b2515858.html"
  },
  {
    "text": "Ocasio-Cortez demands GOP specify actual crimes in Biden impeachment inquiry  —  Rep. Alexandria Ocasio-Cortez (D-N.Y.) pressured the GOP to name the specific crime they are accusing President Biden of as they proceed with their impeachment inquiry.  —  Ocasio-Cortez noted the recent arrest … ",
    "url": "https://thehill.com/homenews/house/4544855-ocasio-cortez-gop-specific-crimes-biden-impeachment-inquiry/"
  },
  {
    "text": "Could Republicans blow it with bad candidates — again?  —  Welcome to The Campaign Moment, where we're averting our gaze from the presidential election thanks to some significant developments in the battle for Congress.  —  (Did a friend forward this to you?  If so, sign up here.)  —  The big moment",
    "url": "https://www.washingtonpost.com/politics/2024/03/20/ohio-senate-moreno-trump-senate-republicans/"
  },
  {
    "text": "‘Very, very troubling’: Judges, lawyers flummoxed by Judge Cannon  —  The jurist overseeing Donald Trump's classified documents case in Florida has raised eyebrows and alarms with her latest order  —  Lawyers and former judges said they are baffled by an order issued this week … ",
    "url": "https://www.washingtonpost.com/national-security/2024/03/20/trump-cannon-judge-pra-jury-instructions/"
  },
  {
    "text": "Republicans Call for Retirement Age Hike in Clash With Biden  —  Search by Topic  —  The largest caucus of House Republicans called for an increase in the Social Security retirement age Wednesday, setting up a clash with President Joe Biden over spending on popular entitlement programs.",
    "url": "https://news.bgov.com/bloomberg-government-news/republicans-call-for-retirement-age-hike-in-clash-with-biden"
  },
  {
    "text": "House Republican budget calls for raising the retirement age for Social Security  —  A budget by the Republican Study Committee, a group of more than 170 GOP lawmakers, highlights how many in the party would seek to govern if Republicans win in November.  —  WASHINGTON — A new budget … ",
    "url": "https://www.nbcnews.com/politics/congress/republican-budget-raise-age-retirement-social-security-medicare-rcna144341"
  },
  {
    "text": "Biden Administration Announces Rules Aimed at Expanding Electric Vehicles  —  The regulations would require automakers to sell more electric vehicles and hybrids by gradually tightening limits on tailpipe pollution.  —  The Biden administration on Wednesday issued one of the most significant … ",
    "url": "https://www.nytimes.com/2024/03/20/climate/biden-phase-out-gas-cars.html"
  },
  {
    "text": "House approves pro-fracking, pro-oil bills to kick off ‘energy week’  —  House Republicans on Wednesday kicked off voting on a slate of legislation for what they are dubbing “energy week,” passing two measures in support of oil and gas development.  —  Collectively, the energy-related legislation … ",
    "url": "https://thehill.com/policy/energy-environment/4545229-house-approves-pro-fracking-pro-oil-bills-to-kick-off-energy-week/"
  },
  {
    "text": "Freedom Caucus votes to remove Ken Buck  —  The House Freedom Caucus voted to remove Rep. Ken Buck (R-Colo.) from the group Tuesday night, a member of the conservative body told The Hill, a dismissal that comes days before he is set to retire from Congress.  —  The Freedom Caucus member … ",
    "url": "https://thehill.com/homenews/house/4545351-freedom-caucus-ken-buck/"
  },
  {
    "text": "MUST-SEE: AOC Has a Mental Breakdown After Bobulinski Runs Circles Around Her  —  Hunter Biden demanded a hearing on Capitol Hill and then didn't show up.  Perhaps he should have because his allies in the Democratic caucus aren't handling things well.  —  In the gift that just keeps on giving … ",
    "url": "https://redstate.com/bonchie/2024/03/20/aoc-has-a-mental-breakdown-during-hearing-after-bobulinski-runs-circles-around-her-n2171655"
  },
  {
    "text": "Leo Varadkar steps down as Irish prime minister in shock move  —  “I'm proud that we have made the country a more equal and more modern place,” the taoiseach said in Dublin.  —  Leo Varadkar, Ireland's first openly gay taoiseach, or prime minister, said Wednesday that he would step down … ",
    "url": "https://www.nbcnews.com/news/world/leo-varadkar-steps-irelands-prime-minister-shock-move-rcna144222"
  },
  {
    "text": "Mass Shooter Father's Chilling Prison Calls to Prosecutor Revealed  —  An investigation is now underway after threatening calls from prison by James Crumbley were revealed by the prosecutor handling his case.  —  The alleged jailhouse threats the father of the Oxford High School mass shooter … ",
    "url": "https://www.thedailybeast.com/mass-shooter-father-james-crumbleys-chilling-prison-calls-to-prosecutor-revealed"
  },
  {
    "text": "Julian Assange, Justice Department Exploring Guilty Plea to End 14-Year Legal Drama  —  WikiLeaks founder is locked in legal battle to avoid extradition to U.S.  —  in London  —  The U.S. Justice Department is considering whether to allow Julian Assange to plead guilty to a reduced charge … ",
    "url": "https://www.wsj.com/world/europe/julian-assange-justice-department-exploring-guilty-plea-to-end-14-year-legal-drama-09c6ff83"
  },
  {
    "text": "House Republican divisions over governing spill onto campaign trail  —  An incumbent in Illinois is one of several members of Congress who have faced opposition from colleagues in primary contests  —  The ideologically fractured House Republican conference has spent the past year debating what it takes to govern.",
    "url": "https://www.washingtonpost.com/politics/2024/03/20/house-republicans-2024-election-campaign/"
  }
]