[
  {
    "text": "Hegseth Orders Navy to Strip Name of Gay Rights Icon Harvey Milk from Ship  —  Defense Secretary Pete Hegseth has ordered the Navy to take the rare step of renaming a ship, one that bears the name of a gay rights icon, documents and sources show.  —  Military.com reviewed a memorandum … ",
    "url": "https://www.military.com/daily-news/2025/06/03/hegseth-orders-navy-strip-name-of-gay-rights-icon-harvey-milk-ship.html"
  },
  {
    "text": "Navy set to rename USNS Harvey Milk, mulls new names for other ships named for civil rights leaders  —  Washington — The U.S. Navy plans to rename the USNS Harvey Milk, a fleet replenishment oiler named after the slain gay rights leader and Navy veteran, and is considering renaming multiple naval ships named … ",
    "url": "https://www.cbsnews.com/news/navy-new-name-usns-harvey-milk-ships-named-for-civil-rights-leaders/"
  },
  {
    "text": "Hegseth moves to rename Navy ship honoring gay rights icon Harvey Milk  —  The directive could be expanded to include other military vessels named for prominent American civil rights figures, said people familiar with internal discussions.  —  The Pentagon is making plans to strip the name … ",
    "url": "https://www.washingtonpost.com/national-security/2025/06/03/harvey-milk-navy-hegseth-civil-rights/"
  },
  {
    "text": "U.S. May Strip Harvey Milk's Name From Navy Vessel  —  Defense Secretary Pete Hegseth ordered a review of ship names honoring Mr. Milk, a gay rights pioneer, and other leaders.  In Mr. Milk's case, the move is intended as a rebuke of Pride Month.  —  Defense Secretary Pete Hegseth has ordered … ",
    "url": "https://www.nytimes.com/2025/06/03/us/politics/navy-ships-harvey-milk-renamed.html"
  },
  {
    "text": "Hegseth orders renaming of ship named after gay rights icon Harvey Milk  —  Secretary of Defense Pete Hegseth has ordered the secretary of the Navy to rename the oiler ship USNS Harvey Milk, according to a defense official.  —  The ship, which was launched in 2021 and named after the gay rights activist … ",
    "url": "https://cnn.com/2025/06/03/politics/hegseth-orders-renaming-ship-named-harvey-milk"
  },
  {
    "text": "MTG Admits She Didn't Read Trump Mega Bill She Voted For  —  Diehard MAGA Rep. Marjorie Taylor Greene said she wished she had not voted for President Donald Trump's “One Big, Beautiful” spending bill, explaining that she wasn't aware of its contents.  “Full transparency … ",
    "url": "https://www.thedailybeast.com/marjorie-taylor-greene-admits-she-didnt-read-trump-mega-bill-she-voted-for/"
  },
  {
    "text": "Trump asks Congress to wipe out funding for public broadcasting  —  President Trump took yet another step Tuesday to place NPR and PBS at the center of his broader clash with major cultural institutions, formally asking Congress to take back the $1.1 billion it has set aside for all public broadcasters for the next two years.",
    "url": "https://www.npr.org/2025/06/03/nx-s1-5418080/pbs-npr-trump-rescission-public-broadcasting"
  },
  {
    "text": "Scoop: Four reasons Musk attacked Trump's “big beautiful bill”  —  Elon Musk blasted President Trump's legacy legislation Tuesday, casting it as a bloated mess, but those who have spoken to the billionaire say he was frustrated at failing to win favorable treatment in the bill and the administration at large.",
    "url": "https://www.axios.com/2025/06/03/elon-musk-trump-white-house-relationship"
  },
  {
    "text": "Trump formally asks Congress to claw back approved spending targeted by DOGE  —  The White House on Tuesday officially asked Congress to claw back $9.4 billion in already approved spending, taking funding away from programs targeted by Elon Musk's Department of Government Efficiency.",
    "url": "https://apnews.com/article/trump-spending-cuts-rescissions-doge-699a224a72d025537df03629eb1a06df"
  },
  {
    "text": "Trump administration revokes guidance requiring hospitals to provide emergency abortions  —  The Trump administration announced on Tuesday that it would revoke guidance to the nation's hospitals that directed them to provide emergency abortions for women when they are necessary to stabilize their medical condition.",
    "url": "https://apnews.com/article/abortion-emtala-biden-trump-emergency-hospital-3640bff165dac1d28b91e8adee7e47dd"
  },
  {
    "text": "Exclusive: CDC expert resigns from COVID vaccines advisory role, sources say  —  Pediatric infectious disease expert Dr. Lakshmi Panagiotakopoulos of the U.S. CDC resigned on Tuesday as co-leader of a working group that advises outside experts on COVID-19 vaccines and is leaving the agency … ",
    "url": "https://www.reuters.com/business/healthcare-pharmaceuticals/cdc-expert-resigns-covid-vaccines-advisory-role-sources-say-2025-06-03/"
  },
  {
    "text": "CMS Statement on Emergency Medical Treatment and Labor Act (EMTALA)  —  The Department of Health and Human Services and Centers for Medicare & Medicaid Services (\"CMS\") are rescinding July 2022 guidance from CMS with the subject “Reinforcement of EMTALA Obligations specific to Patients … ",
    "url": "https://www.cms.gov/newsroom/press-releases/cms-statement-emergency-medical-treatment-and-labor-act-emtala"
  },
  {
    "text": "Texas man arrested and accused of trespassing at Mar-a-Lago told police he wanted to ‘marry Kai’  —  Anthony Reyes told law enforcement that he wanted to “marry Kai,” according to a police report.  Kai is the name of the president's 18-year-old granddaughter.",
    "url": "https://www.nbcnews.com/politics/donald-trump/texas-man-arrested-trespassing-mar-lago-told-police-wanted-spread-gosp-rcna210751"
  },
  {
    "text": "After Trump Takeover, Kennedy Center Ticket Sales Fall Sharply  —  The Kennedy Center disputed the relevance of the data, part of an analysis by employees, saying that it had started its annual subscription campaign later than usual.  —  Ticket sales and subscription revenue … ",
    "url": "https://www.nytimes.com/2025/06/03/arts/music/kennedy-center-ticket-sales-subscriptions.html"
  },
  {
    "text": "Bakersfield girl who faced deportation and loss of lifesaving medical care is allowed to stay in U.S.  —  WASHINGTON — The family of a 4-year-old Bakersfield girl with a rare medical condition has been granted humanitarian protection from deportation, allowing her to continue receiving lifesaving treatment in the United States.",
    "url": "https://www.latimes.com/california/story/2025-06-03/bakersfield-girl-who-faced-deportation-loss-of-lifesaving-medical-care-granted-humanitarian-parole"
  },
  {
    "text": "The Washington Post Plans an Influx of Outside Opinion Writers  —  A new program, known internally as Ripple, would open The Post to journalists at other publications and influential writers on Substack.  —  The Washington Post has published some of the world's most influential voices … ",
    "url": "https://www.nytimes.com/2025/06/03/business/media/washington-post-opinion-ripple.html?unlocked_article_code=1.ME8.yzj8.AuF2bnwSme6h&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "RNC Intervenes to Back Trump Anti-Voting Order, Claims Greater Voter Access Hurts Their Candidates  —  The Republican National Committee (RNC) filed a motion Tuesday to intervene in ongoing federal litigation against President Donald Trump's executive order on voting, which aimed … ",
    "url": "https://www.democracydocket.com/news-alerts/rnc-intervenes-to-back-trump-anti-voting-order-claims-greater-voter-access-hurts-their-candidates/"
  },
  {
    "text": "2 Chinese nationals charged with smuggling ‘potential agroterrorism’ fungus into US: DOJ  —  Authorities said it was in connection with work at the University of Michigan.  —  This photo released by the U.S. District Court for the Eastern District of Michigan shows what authorities … ",
    "url": "https://abcnews.go.com/Politics/2-chinese-nationals-charged-smuggling-potential-agroterrorism-fungus/story?id=122454213"
  },
  {
    "text": "Trump Wants to Cut Tribal College Funding by Nearly 90%, Putting Them at Risk of Closing  —  ProPublica found that Congress was underfunding tribal colleges by a quarter-billion dollars per year.  Rather than fixing the problem, proposed federal funding cuts unveiled this week would devastate the schools, tribal education leaders say.",
    "url": "https://www.propublica.org/article/tribal-colleges-universities-trump-cuts-funding"
  },
  {
    "text": "FBI discovers cache of guns, armor and Nazi paraphernalia while raiding home in Washington state  —  Law enforcement discovered a cache of weaponry and armor, including a machine gun and grenade launchers, along with Nazi paraphernalia during a raid of a home in Washington state, authorities said Tuesday.",
    "url": "https://apnews.com/article/nazi-white-supremacist-guns-fbi-washington-2246cf68af02d592d192a9b52d8941e3"
  },
  {
    "text": "Florida higher ed board stuns UF, blocks Santa Ono from becoming president  —  In a stunning move, the board that oversees Florida's higher education system voted against the confirmation of Dr. Santa Ono, formerly president of the University of Michigan, as the University of Florida's 14th president.",
    "url": "https://eu.gainesville.com/story/news/education/2025/06/03/board-of-governors-rejects-santa-ono-as-university-of-florida-president/84007003007/"
  },
  {
    "text": "A sweeping new ICE operation shows how Trump's focus on immigration is reshaping federal law enforcement  —  Members of other agencies are getting detailed to assist ICE, while Justice Department personnel shift to immigration-focused teams and prioritize immigration-related cases.",
    "url": "https://www.nbcnews.com/politics/justice-department/ice-operation-trump-focus-immigration-reshape-federal-law-enforcement-rcna193494"
  },
  {
    "text": "Hegseth to skip Ukraine meeting at NATO headquarters  —  The absence of the U.S. defense secretary marks the first time in the Ukraine Defense Contact Group's history that an American defense chief misses the monthly meeting.  —  Defense Secretary Pete Hegseth won't attend a Wednesday meeting … ",
    "url": "https://www.politico.com/news/2025/06/03/hegseth-skip-ukraine-meeting-nato-00384220"
  },
  {
    "text": "Troop Casualties in Ukraine War Near 1.4 Million, Study Finds  —  With high casualty figures and the slow pace of Russia's territorial gains, President Vladimir V. Putin could face years more of a grinding war of attrition in Ukraine.  —  Nearly one million Russian troops have been killed … ",
    "url": "https://www.nytimes.com/2025/06/03/us/politics/russia-ukraine-troop-casualties.html"
  },
  {
    "text": "Higher Tariffs on Steel and Aluminum Imports Go Into Effect  —  The president has ratcheted up the rate on foreign metals to 50 percent, double the previous rate, saying the levies weren't high enough to help the U.S. industry.  —  U.S. tariffs on steel and aluminum imports doubled on Wednesday … ",
    "url": "https://www.nytimes.com/2025/06/04/business/economy/trump-tariffs-steel-aluminum.html"
  },
  {
    "text": "Google's New AI Tool Generates Convincing Deepfakes of Riots, Conflict, and Election Fraud  —  Google's recently launched AI video tool can generate realistic clips that contain misleading or inflammatory information about news events, according to a TIME analysis and several tech watchdogs.",
    "url": "https://time.com/7290050/veo-3-google-misinformation-deepfake/"
  }
]