[
  {
    "text": "CBS News poll: Gender gap, enthusiasm, economy make for tight Harris-Trump race on Democratic convention eve  —  When Kamala Harris became the Democratic presidential nominee, the party saw a major surge in enthusiasm from its voters.  It pulled the party into an effectively even race … ",
    "url": "https://www.cbsnews.com/news/new-poll-kamala-harris-policies-trump-democratic-convention-2024/"
  },
  {
    "text": "Harris holds slight national lead over Trump, Post-ABC-Ipsos poll finds  —  The result is a notable improvement for Democrats in a contest that a little more than a month ago showed Biden and Trump in a dead heat.  —  Vice President Kamala Harris holds a narrow lead over former president Donald Trump … ",
    "url": "https://www.washingtonpost.com/politics/2024/08/18/harris-trump-post-abc-ipsos-poll/"
  },
  {
    "text": "Behind the Curtain: Trump's devil-in-Georgia problem … Yet Trump himself has made this make-or-break state dramatically more breakable by torching its popular Republican governor, Brian Kemp, bluntly and repeatedly.  — “He's a bad guy. … - “Little Brian, little Brian Kemp,” Trump continued.",
    "url": "https://www.axios.com/2024/08/18/trump-2024-election-georgia-brian-kemp"
  },
  {
    "text": "Trump Has Turned Over an Old Leaf  —  Meet the new Trump, same as the old Trump.  —  By the time Donald Trump announced his 2024 campaign for president, the idea of a “new Trump” had become a running gag, taken seriously only by the most credulous reporters and most desperately optimistic Republican officeholders.",
    "url": "https://www.theatlantic.com/politics/archive/2024/08/trump-has-turned-over-old-leaf/679494/"
  },
  {
    "text": "Trump escalates gendered personal insults against Harris, defying GOP pressure  —  The Republican nominee also stoked Democrats' rift over Israel by baselessly claiming Harris passed over Gov. Josh Shapiro to be her running mate because he is Jewish.  —  WILKES-BARRE, Pa. … ",
    "url": "https://www.washingtonpost.com/politics/2024/08/17/trump-harris-presidential/"
  },
  {
    "text": "Harris and Walz will campaign by bus in Pennsylvania before the Democratic convention in Chicago  —  WASHINGTON (AP) — Democratic presidential nominee Kamala Harris and running mate Tim Walz will campaign by bus in southwestern Pennsylvania on Sunday, hoping to ride the wave of enthusiasm … ",
    "url": "https://apnews.com/article/harris-walz-bus-tour-campaign-pennsylvania-2fa74e23e4cd21218f61f6c6595a577c"
  },
  {
    "text": "Trump campaign attempts to reset with candidate who sometimes has his own plans  —  Kamala Harris's entry into the race has scrambled Donald Trump's plans and revived concerns about whether he can focus his attacks.  —  Donald Trump's top brass gathered reporters in West Palm Beach, Fla. … ",
    "url": "https://www.washingtonpost.com/politics/2024/08/17/trump-campaign-harris/"
  },
  {
    "text": "Kamala Harris heads to DNC in Chicago with momentum and a big opportunity  —  WASHINGTON — Riding a wave of momentum since announcing her candidacy, Vice President Kamala Harris heads to Chicago this week for the Democratic National Convention with an opportunity to reintroduce herself … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/08/18/kamala-harris-dnc-opportunity/74796684007/"
  },
  {
    "text": "Inciting rioters in Britain was a test run for Elon Musk.  Just see what he plans for America  —  The presidential election is three months away.  What if the billionaire contests the result?  What if he decides democracy is over-rated?  —  Just over four years ago … ",
    "url": "https://www.theguardian.com/commentisfree/article/2024/aug/18/inciting-rioters-in-britain-was-a-test-run-for-elon-musk-just-see-what-he-plans-for-america"
  },
  {
    "text": "You Should Know  —  I flagged this on social media.  But I wanted to make sure you knew.  Trump just announced a “crime and safety” rally for next Tuesday in Howell, Michigan, a town that has been heavily associated with the KKK for decades.  Indeed, just late last month White Supremacists marched … ",
    "url": "https://talkingpointsmemo.com/edblog/you-should-know"
  },
  {
    "text": "Willie Brown to Donald Trump: Mention My Name Again and Get Sued  —  The former president has falsely claimed that he nearly died in a helicopter ride with Mr. Brown, and that Mr. Brown said “terrible things” about Kamala Harris.  —  Willie Brown, the former mayor of San Francisco … ",
    "url": "https://www.nytimes.com/2024/08/17/us/politics/willie-brown-donald-trump-sue-lawsuit.html"
  },
  {
    "text": "‘Things I Trust More Than Donald Trump’ List Goes Viral: ‘Dinner with Jeffrey Dahmer’  —  ‘A CASEY ANTHONY DAYCARE’  —  When “The View” co-host Anna Navarro posted the list to her Instagram account, numerous social media users added their own comments.  —  A viral list called … ",
    "url": "https://www.thedailybeast.com/the-view-co-host-anna-navarro-posts-things-i-trust-more-than-donald-trump-list"
  },
  {
    "text": "Mark Robinson, Who Often Calls Abortion Murder: ‘We Had an Abortion’  —  The North Carolina Republican gubernatorial candidate previously said mass shootings were karma for the “murder of infants” … He compared supporters of reproductive rights to people who fought to preserve slavery.",
    "url": "https://www.rollingstone.com/politics/politics-features/mark-robinson-abortion-murder-north-carolina-1235082406/"
  },
  {
    "text": "Six Takeaways From the Magazine's Profile of Joe Biden  —  His decision to quit the race ended a remarkable chapter in American political history — and started one that may yet define his legacy.  —  Joe Biden dreamed of one day becoming president nearly all his life.",
    "url": "https://www.nytimes.com/2024/08/18/magazine/biden-presidency-legacy-takeaways.html"
  },
  {
    "text": "‘Keyboard warrior’ jailed for part in UK disorder  —  A man who posted material on social media to stir up racial hatred during recent unrest across the UK has been jailed for three years.  —  Wayne O'Rourke, who had more than 90,000 followers to his X account, posted misinformation … ",
    "url": "https://www.bbc.com/news/articles/c5y3gre3y9yo"
  }
]