[
  {
    "text": "Small airplane down in Potomac River near Ronald Reagan National Airport  —  A small aircraft is down in the Potomac River near Ronald Reagan Washington National Airport and fireboats were on the scene, the Washington fire department said.  —  The airport said late on Wednesday that all takeoffs … ",
    "url": "https://www.reuters.com/world/us/takeoffs-landings-halted-ronald-reagan-national-airport-after-aircraft-incident-2025-01-30/"
  },
  {
    "text": "Live updates: Plane crashes into Potomac River after collision with helicopter near Reagan National Airport  —  A regional jet collided in midair with a helicopter while on approach to Reagan Washington National Airport around 9 p.m., the FAA said Wednesday evening in a preliminary update.",
    "url": "https://www.nbcnews.com/news/us-news/live-blog/live-updates-plane-crashes-potomac-river-collision-helicopter-reagan-n-rcna189942"
  },
  {
    "text": "American Airlines plane crashes with helicopter near Reagan National Airport  —  Video shows midair collision near Reagan National Airport  —  An American Airlines passenger plane that departed from Wichita, Kansas, and a U.S. Army Black Hawk helicopter collided near Reagan National Airport Wednesday evening … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2025/01/29/aircraft-crash-potomac/"
  },
  {
    "text": "Trump Gutted Key Aviation Safety Committee Before D.C. Plane Crash  —  Last week, just days after his inauguration, Donald Trump eliminated the membership of a key committee that handles aviation security.  And on Wednesday night,  a passenger plane collided with a military helicopter in the Washington, D.C., area.",
    "url": "https://newrepublic.com/post/190934/trump-aviation-safety-committee-dc-plane-crash"
  },
  {
    "text": "Passenger jet collides with helicopter while landing at Reagan Washington National Airport, FAA says  —  A passenger jet has collided with a helicopter while landing at Ronald Reagan National Airport near Washington.  That's according to the Federal Aviation Administration, which says the collision remains under investigation.",
    "url": "https://apnews.com/article/ronald-reagan-national-airport-crash-cebb142d24859ba0c4e0e4fd6c33773f"
  },
  {
    "text": "White House regroups as funding freeze chaos recalls first term's travel ban  —  Democrats declared victory for blunting Trump's momentum while the White House insisted it isn't backing down.  —  In his first week in office, President Donald Trump moved swiftly to deliver on a signature campaign promise … ",
    "url": "https://www.washingtonpost.com/politics/2025/01/30/trump-funding-freeze-chaos/"
  },
  {
    "text": "FBI Overhaul Off to a Rocky Start as Kash Patel Prepares to Defend His Vision  —  White House mixes up who is temporarily in charge of agency as Trump loyalist heads into Senate confirmation hearing  —  WASHINGTON—Trump officials tried to start their shake-up of the Federal Bureau … ",
    "url": "https://www.wsj.com/politics/policy/fbi-overhaul-off-to-a-rocky-start-as-kash-patel-prepares-to-defend-his-vision-1085c6f8?st=ChdHtS&reflink=mobilewebshare_permalink"
  },
  {
    "text": "FAA Chief Quit on Jan. 20 After Elon Musk Told Him to Resign  —  The Federal Aviation Administration's leader stepped down on Jan. 20, months after Elon Musk demanded that he quit.The move by Michael Whitaker means the FAA has no Senate-confirmed leader for one of the biggest crises in its history … ",
    "url": "https://www.thedailybeast.com/faa-chief-michael-whitaker-quit-on-jan-20-after-elon-musk-told-him-to-resign/"
  },
  {
    "text": "In Tense Call, Governors Push Schumer to Fight Harder Against Trump  —  On a call with Senator Chuck Schumer, the minority leader, six Democratic governors pushed him to slow down the confirmation of President Trump's nominees and to do more to block his agenda.",
    "url": "https://www.nytimes.com/2025/01/29/us/politics/chuck-schumer-trump-agenda-cabinet.html?unlocked_article_code=1.tE4.uTbf.cKtvP65o9Anu&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Despite media reports, Trump has not offered federal employees a “buyout”  —  Anyone who has read reports in the Associated Press, the New York Times, CBS News, CNN, USA Today, the Los Angeles Times, NBC News, or Axios would be under the impression that the Trump administration … ",
    "url": "https://popular.info/p/despite-media-reports-trump-has-not"
  },
  {
    "text": "No survivors expected after midair D.C. plane crash, Trump speaks from White House  —  Officials believe that all passengers and crew onboard American Eagle Flight 5342, which collided midair Wednesday evening with an Army Black Hawk helicopter near Reagan National Airport, were killed.",
    "url": "https://www.washingtonpost.com/dc-md-va/2025/01/30/dc-plane-crash-updates-helicopter-potomac-reagan-airport/"
  },
  {
    "text": "Trump's Inaugural Approval Rating Is Historically Low Again  —  Americans divided over whether Trump's pace in addressing major U.S. problems is about right or too fast  —  WASHINGTON, D.C. — At 47%, President Donald Trump's initial job approval rating for his second term is similar … ",
    "url": "https://news.gallup.com/poll/655955/trump-inaugural-approval-rating-historically-low-again.aspx"
  },
  {
    "text": "Franklin County woman pardoned for Capitol riot is sentenced to 10 years in fatal crash  —  UNION, Mo. — The Franklin County woman pardoned for her participation in the U.S. Capitol insurrection on Jan. 6, 2021 was sentenced Wednesday to 10 years in prison for her role in a fatal drunk driving crash.",
    "url": "https://www.stltoday.com/news/local/crime-courts/emily-hernandez-pardoned-for-capitol-riot-sentenced-to-17-years-in-fatal-dwi-crash/article_bf4def6e-de51-11ef-a3a0-97de6fd4bd53.html"
  },
  {
    "text": "Criminal records of Jan. 6 rioters pardoned by Trump include rape, domestic violence  —  Editor's Note: This story includes descriptions of violent crimes and sexual abuse involving both adults and children that may be disturbing to readers.  —  On his first day in office … ",
    "url": "https://www.npr.org/2025/01/30/nx-s1-5276336/donald-trump-jan-6-rape-assault-pardons-rioters"
  },
  {
    "text": "Ending Radical Indoctrination in K-12 Schooling  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:  —  Section 1.  Purpose and Policy.  Parents trust America's schools to provide their children … ",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/01/ending-radical-indoctrination-in-k-12-schooling/"
  },
  {
    "text": "To Pay for Trump Tax Cuts, House GOP Floats Plan to Slash Benefits for the Poor and Working Class  —  A menu of options being circulated by congressional Republicans also includes new tax cuts for corporations and the ultrawealthy.  —  One of the hallmarks of Donald Trump's presidential campaign … ",
    "url": "https://www.propublica.org/article/trump-tax-cuts-congress-republicans-plan-slash-benefits"
  },
  {
    "text": "Musk team's push to gut federal workforce bypassed key Trump officials  —  Billionaire Elon Musk has worked behind the scenes on an initiative aimed at depleting the civil service, prompting questions about its legality.  —  Billionaire Elon Musk's influence over a traditionally nonpartisan agency … ",
    "url": "https://www.washingtonpost.com/business/2025/01/29/elon-musk-opm-federal-workers-buyout-trump/"
  },
  {
    "text": "RFK Jr. Says Trump Gave Him 1 Directive On The Abortion Pill  —  The drugs are used for 63% of abortion care and have been widely deemed safe by scientists.  —  LOADING  —  Abortion came up several times during the first of Robert F. Kennedy Jr.'s confirmation hearings for health secretary … ",
    "url": "https://www.huffpost.com/entry/rfk-jr-will-study-the-safety-of-abortion-pill-on-trumps-orders_n_679a71e5e4b0c5507e4ae06e"
  },
  {
    "text": "Trump's Firings Could Bring Court Cases That Expand His Power  —  The prospect of legal challenges to President Trump's purges may be a feature, not a bug, for adherents of sweeping presidential authority.  —  President Trump abruptly fired dozens of officials in the past few days … ",
    "url": "https://www.nytimes.com/2025/01/29/us/politics/trump-firings-officials-legal-test.html"
  },
  {
    "text": "Pentagon agency pauses celebrations for Martin Luther King Jr. Day, Black History Month and more  —  The Defense Department's intelligence agency has paused observances of Martin Luther King Jr. Day, Pride Month, Holocaust Days of Remembrance and other cultural or historical annual events … ",
    "url": "https://apnews.com/article/trump-holiday-mlk-day-pride-black-hispanic-dei-047bbdbfc12ea6e9a9731f5861d84e70"
  },
  {
    "text": "Trump Signs Agreement Calling for Meta to Pay $25 Million to Settle Suit  —  The president had sued the social-media company after his accounts were suspended  —  President Trump has signed settlement papers that are expected to require Meta Platforms to pay roughly $25 million to resolve … ",
    "url": "https://www.wsj.com/us-news/law/trump-signs-agreement-calling-for-meta-to-pay-25-million-to-settle-suit-6f734c8c?st=7ms8uR&reflink=article_imessage_share"
  },
  {
    "text": "Declassified CIA Guide to Sabotaging Fascism Is Suddenly Viral  —  A declassified World War II-era government guide to “simple sabotage” is currently one of the most popular open source books on the internet.  The book, called “Simple Sabotage Field Manual,” was declassified in 2008 by the CIA and … ",
    "url": "https://www.404media.co/declassified-cia-guide-to-sabotaging-fascism-is-suddenly-viral/"
  },
  {
    "text": "Ogles: ‘Did DEI play a role’ in fatal DC plane crash?  —  Rep. Andy Ogles (R-Tenn.) is questioning whether diversity, equity and inclusion (DEI) played a role in the fatal plane crash at Reagan Washington National Airport outside of Washington, D.C.  —  Ogles, in an interview … ",
    "url": "https://thehill.com/homenews/house/5116066-andy-ogles-dei-role-dca-crash/"
  },
  {
    "text": "Trump Administration's Halt of CDC's Weekly Scientific Report Stalls Bird Flu Studies  —  The Trump administration has intervened in the release of important studies on the bird flu, as an outbreak escalates across the United States.  —  One of the studies would reveal whether veterinarians … ",
    "url": "https://kffhealthnews.org/news/article/cdc-trump-mmwr-bird-flu-studies-blocked-meddling/"
  }
]