[
  {
    "text": "Arizona Republicans block attempt to repeal abortion ban … - “We've got the eyes of the world watching the state of Arizona,” state Rep. Stephanie Stahl Hamilton (D-Tucson), who sponsored the repeal, said in a floor speech Wednesday. … He was the lone House Republican to support the repeal effort.",
    "url": "https://www.axios.com/2024/04/10/arizona-abortion-repeal-republicans-block"
  },
  {
    "text": "Arizona Republicans Thwart Attempts to Repeal 1864 Abortion Ban  —  Democrats in both houses of the Legislature were blocked from advancing bills to roll back a reinstated 160-year-old ban on nearly all abortions in the state.  —  A decision by Arizona's highest court upholding an 1864 ban … ",
    "url": "https://www.nytimes.com/2024/04/10/us/abortion-ban-arizona-democrats-repeal.html"
  },
  {
    "text": "Arizona Republicans condemn their own abortion policy  —  On Tuesday, the Arizona Supreme Court issued a bombshell decision banning virtually all abortions in the state.  The majority found that since the Supreme Court overturned Roe v. Wade, a near-total ban from 1864 — before Arizona was a state — was back in effect.",
    "url": "https://popular.info/p/arizona-republicans-condemn-their"
  },
  {
    "text": "Abortion ruling is a full-on disaster for Arizona Republicans  —  Opinion: With the return of an 1864 abortion ban, Republicans now face a five-alarm fire that could consume their grip on Arizona.  If you are Trump or Kari Lake, you are freaking out right now.",
    "url": "https://www.azcentral.com/story/opinion/op-ed/laurieroberts/2024/04/09/abortion-ruling-disaster-arizona-republicans/73263944007/"
  },
  {
    "text": "Trump loses third bid this week to delay hush money trial  —  A New York appeals judge on Wednesday denied Donald Trump's third last-ditch attempt this week to delay his April 15 criminal trial on charges stemming from hush money paid to a porn star, paving the way for the first-ever trial of a former U.S. president.",
    "url": "https://www.reuters.com/legal/trump-tries-delay-hush-money-trial-third-time-this-week-2024-04-10/"
  },
  {
    "text": "Trump fails to delay N.Y. criminal trial for a third time this week  —  NEW YORK — Donald Trump's attorneys failed to persuade an appeals court judge on Wednesday to delay the former president's New York criminal trial, scheduled to begin next week, by saying the presiding judge was not qualified to oversee the proceedings.",
    "url": "https://www.washingtonpost.com/politics/2024/04/10/trump-new-york-criminal-trial-merchan/"
  },
  {
    "text": "Trump lawyers set to return court with another challenge to his impending criminal trial in New York  —  The former president's filing at the state Appellate Division is his third challenge to the case in three days.  —  Lawyers for former President Donald Trump were heading … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-lawyers-return-court-another-challenge-criminal-trial-new-york-rcna147209"
  },
  {
    "text": "U.S. voters take Trump's hush money charges seriously: Poll … - The New York trial, set to start on April 15 with jury selection, concerns a 2016 payment allegedly made to adult film actress Stormy Daniels.  — About 4 in 10 Republican respondents considered the hush money charges to be serious.",
    "url": "https://www.axios.com/2024/04/10/trump-hush-money-voters-poll"
  },
  {
    "text": "Playbook: Why Trump is Johnson's best friend right now  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  JUST POSTED — “Matt Gaetz Is Winning,” by The Atlantic's Elaine Godfrey: Rep. MATT GAETZ (R-Fla.) “is a creature of our time: versed in the art … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/04/11/why-trump-is-johnsons-best-friend-right-now-00151686"
  },
  {
    "text": "Matt Gaetz Is Winning … Usually, you need about 10 minutes to walk from the Rayburn House Office Building to the House Chamber.  But if you're running from a reporter, it'll only take you five.  —  When Matt Gaetz spotted me outside his office door one afternoon early last November … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/04/matt-gaetz-house-republican-congress-profile/677915/"
  },
  {
    "text": "How Biden's campaign plans to pummel Trump on abortion  —  The reelect is going to spend the next half year publicizing the testimonials of those affected by harsh new state abortion laws.  —  Joe Biden's campaign plans to hammer Donald Trump for his role in erasing abortion rights largely … ",
    "url": "https://www.politico.com/news/2024/04/11/biden-campaign-trump-abortion-00151656"
  },
  {
    "text": "Biden Administration Approves Expansion of Background Checks on Gun Sales  —  The new rule, which is likely to face legal challenges, is an attempt to regulate a fast-growing shadow market of weapons that has fueled gun violence.  —  The Biden administration has approved the broadest expansion … ",
    "url": "https://www.nytimes.com/2024/04/11/us/politics/biden-guns-background-checks.html"
  },
  {
    "text": "Truong My Lan: Vietnamese billionaire sentenced to death for $44bn fraud  —  Truong My Lan is accused of looting one of Vietnam's largest banks over a period of 11 years  —  It was the most spectacular trial ever held in Vietnam, befitting one of the greatest bank frauds the world has ever seen.",
    "url": "https://www.bbc.com/news/world-asia-68778636"
  },
  {
    "text": "Trump looms over fight to oust Speaker Johnson  —  As Mike Johnson stares down a serious threat to his speakership, he's taking steps to show alignment with the most powerful figure in the Republican Party: Donald Trump.  —  Johnson has made plans to trek down to Mar-a-Lago on Friday to appear … ",
    "url": "https://www.cnn.com/2024/04/10/politics/trump-johnson-news-conference/"
  },
  {
    "text": "Alabama Man Charged with Detonating an Explosive Device Outside of Alabama Attorney General's Office  —  For Immediate Release  —  An Alabama man was indicted for his alleged role in detonating an explosive device in downtown Montgomery, Alabama.  —  On April 10, law enforcement arrested … ",
    "url": "https://www.justice.gov/opa/pr/alabama-man-charged-detonating-explosive-device-outside-alabama-attorney-generals-office"
  },
  {
    "text": "Trump Media director accused of ‘hacking’ files in attempted corporate ‘coup’: Lawsuit … This photo illustration shows an image of former President Donald Trump next to a phone screen that is displaying the Truth Social app, in Washington, DC, on February 21, 2022.",
    "url": "https://www.cnbc.com/2024/04/10/trump-media-director-accused-of-hacking-files-lawsuit.html"
  },
  {
    "text": "Police Report: Trump County Chair Threatened To Rape Boss's Wife, Then Kill Him  —  Jonathan Stone, a former New Hampshire police officer, has been a part of Trump's campaign since 2016, when he gave Trump an inscribed AR-15 assault rifle.  —  LOADING  —  One of Donald Trump's county campaign chairs … ",
    "url": "https://www.huffpost.com/entry/trump-fired-police-officer-new-hampshire_n_6616de8ce4b0999df35397ba"
  },
  {
    "text": "Bolton says he will write in Dick Cheney for president again this year  —  Former national security adviser John Bolton revealed he will write in former Vice President Dick Cheney for president in November — for the second time.  —  “Well, I might as well say it now.",
    "url": "https://thehill.com/homenews/campaign/4587685-bolton-dick-cheney-write-in-2024-president/"
  },
  {
    "text": "Biden Loses Support Among Black Men, WSJ Poll Finds  —  New survey of seven battleground states also shows some Black women are weighing other options",
    "url": "https://www.wsj.com/politics/elections/biden-trump-black-men-support-election-2024-poll-a7d9da22"
  },
  {
    "text": "The Trump donor whom Biden can't fire is running the U.S. Postal Service directly into the ground—just what everyone warned about when he was confirmed during the pandemic  —  Technology has afforded us the ability to connect with nearly anyone, anytime—and free of charge.",
    "url": "https://fortune.com/2024/04/10/usps-dejoy-price-hikes-customer-dissatisfaction/"
  },
  {
    "text": "White House hosts star-studded state dinner including Clintons, Bezos, and finance giants  —  The White House hosted its glitzy state dinner for the Japanese prime minister on Wednesday night, and some star-studded names are on the guest list.  —  Former President Bill Clinton … ",
    "url": "https://www.washingtonexaminer.com/news/white-house/2962116/white-house-star-studded-state-dinner-clintons-bezos-finance-giants/"
  },
  {
    "text": "Japan Gives Washington 250 Cherry Trees as Replacements  —  The trees will replace 140 that will be torn up as part of a restoration project.  The capital's first Japanese cherry trees were a gift from the mayor of Tokyo in 1912.  —  Japan is giving the United States 250 cherry trees … ",
    "url": "https://www.nytimes.com/2024/04/10/us/politics/japan-us-cherry-trees.html"
  },
  {
    "text": "The less you vote, the more you back Trump  —  A new poll suggests it's Republicans who should be rooting for higher turnout.  —  57:42  —  Idahoans at the polling location for precinct 1712, All Saints Episcopal Church, cast their ballots on Election Day in 2022 in Boise.",
    "url": "https://abcnews.go.com/538/vote-back-trump/story?id=109090626"
  }
]