[
  {
    "text": "Senators receive affidavit containing new allegations against Pete Hegseth, who denies the claims  —  The former sister-in-law of Trump's defense secretary pick said that Hegseth made his second wife fear for her safety.  Hegseth's second wife said, “There was no physical abuse in my marriage.”",
    "url": "https://www.nbcnews.com/politics/national-security/senators-received-affidavit-containing-new-allegations-pete-hegseth-de-rcna188342"
  },
  {
    "text": "Hegseth Ex-Sister-in-Law Tells Senators He Was ‘Abusive’ to Second Wife  —  A woman once married to the brother of Pete Hegseth, the defense secretary nominee, submitted a sworn statement to the Senate in a late-hour complication to his confirmation.  His attorney denied her account.",
    "url": "https://www.nytimes.com/2025/01/21/us/politics/hegseth-senators-affidavit.html?unlocked_article_code=1.q04.WqU2.FjpnG4Psf5Uq&smid=url-share"
  },
  {
    "text": "Hegseth Routinely Passed Out from Alcohol Abuse, Witness Says  —  Trump's Pentagon pick has denied allegations, calling them part of a ‘smear campaign’  —  Pete Hegseth, President Trump's pick to run the Pentagon, regularly abused alcohol to the point that he passed out at family gatherings … ",
    "url": "https://www.wsj.com/politics/policy/pete-hegseth-affidavit-witness-drunk-passing-out-e216ca85?st=TXviBX"
  },
  {
    "text": "Senate learns of new allegations against Hegseth  —  The Defense secretary nominee's former sister-in-law, in an affidavit, said she witnessed his drunken aggression and that his second wife worried about her safety.  —  Pete Hegseth's former sister-in-law, in an affidavit given to senators on Tuesday … ",
    "url": "https://www.politico.com/news/2025/01/21/hegseth-new-allegations-00199730"
  },
  {
    "text": "Trump picks fights with his party  —  The Scoop  —  As jubilant as Republican lawmakers are over Donald Trump's second term, they're facing a familiar reality: The president is back to picking fights with them and trying to bend them to his will.  —  From pardoning Jan. 6 offenders … ",
    "url": "https://www.semafor.com/article/01/21/2025/mcconnell-criticizes-trumps-broad-pardon-of-capitol-riot-defendants"
  },
  {
    "text": "Judges Begin Freeing Jan. 6 Defendants and Dismissing Their Cases  —  Two prominent far-right extremists with central roles in the Capitol attack, Enrique Tarrio of the Proud Boys and Stewart Rhodes of the Oath Keepers militia, have been set free.  —  One day after President Donald J … ",
    "url": "https://www.nytimes.com/2025/01/21/us/politics/jan-6-defendants-freed.html"
  },
  {
    "text": "Twenty-two States Sue to Stop Trump's Birthright Citizenship Order  —  The lawsuit to block the president's executive order is the first salvo in what is likely to be a long-running legal fight over immigration policy.  —  Attorneys general from 22 states sued President Trump in two federal district courts … ",
    "url": "https://www.nytimes.com/2025/01/21/us/trump-birthright-citizenship.html?unlocked_article_code=1.q04.hfP-.SAqdJ8-Ey02w"
  },
  {
    "text": "Trump signs order seeking to rename Alaska's Denali and the Gulf of Mexico  —  President Donald Trump said the Gulf of Mexico will be called Gulf of America, while the Denali mountain peak will revert to its old name, Mount McKinley.  —  President Donald Trump on Monday issued … ",
    "url": "https://www.washingtonpost.com/politics/2025/01/21/trump-gulf-of-america-mexico-denali-mckinley/"
  },
  {
    "text": "Coast Guard Commandant terminated over border lapses, recruitment, DEI focus: official  —  Senior DHS official confirms to Fox News Digital Coast Guard Adm. Linda Fagan has been relieved of her post  —  EXCLUSIVE: The Commandant of the U.S. Coast Guard has been terminated over concerns about the border … ",
    "url": "https://www.foxnews.com/politics/coast-guard-commandant-terminated-over-border-lapses-recruitment-dei-focus-official"
  },
  {
    "text": "Trump to announce up to $500 billion in private sector AI infrastructure investment  —  President Trump is set to announce billions of dollars in private sector investment to build artificial intelligence infrastructure in the United States, CBS News has learned.",
    "url": "https://www.cbsnews.com/news/trump-announces-private-sector-ai-infrastructure-investment/"
  },
  {
    "text": "Trump to announce AI infrastructure investment backed by Oracle, OpenAI and Softbank",
    "url": "https://www.cnbc.com/2025/01/21/trump-ai-openai-oracle-softbank.html"
  },
  {
    "text": "Federal Employees Union Sues Trump Over Worker Protections  —  The National Treasury Employees Union argues a move to “radically reshape the civil service” by making it easier to fire federal workers violates the will of Congress.  —  The National Treasury Employees Union said on Tuesday … ",
    "url": "https://www.nytimes.com/2025/01/21/us/politics/trump-schedule-f-federal-workers.html"
  },
  {
    "text": "Trump terminates John Bolton's security detail within hours of taking office  —  Within hours of taking office, President Donald Trump terminated the Secret Service detail that was assigned to his former national security adviser John Bolton, Bolton confirmed to CNN on Tuesday.",
    "url": "https://www.cnn.com/2025/01/21/politics/john-bolton-security-detail-trump"
  },
  {
    "text": "AOC slams ADL for excusing Elon Musk's ‘awkward gesture:’ 'You're defending a Heil Hitler salute'  —  Musk spoke at an inauguration event for President Trump after he was sworn in on Monday  —  Rep. Alexandria Ocasio-Cortez, D-N.Y., attacked the Anti-Defamation League (ADL) … ",
    "url": "https://www.foxnews.com/media/aoc-slams-adl-excusing-elon-musks-awkward-gesture-youre-defending-heil-hitler-salute"
  },
  {
    "text": "Musk responds to backlash over gesture at Trump rally  —  Elon Musk has caused outrage over a one-armed gesture he gave during a speech celebrating the inauguration of Donald Trump.  —  Musk thanked the crowd for “making it happen”, before placing his right hand over his heart and then thrusting … ",
    "url": "https://www.bbc.com/news/articles/cy48v1x4dv4o"
  },
  {
    "text": "America's second Paris withdrawal is not like the first … - There may be sufficient momentum now in both the Paris regime as well as the burgeoning clean energy sector that this will make only a symbolic difference. … - Last time the U.S. left, no other country followed that move.",
    "url": "https://www.axios.com/2025/01/21/us-paris-withdrawal-effects-second-time"
  },
  {
    "text": "Instagram hides search results for ‘Democrats’  —  Meta says its working urgently to fix a problem with Instagram which results in a “results hidden” message when users search for the terms “Democrat” or “Democrats”.  —  Some social media users have accused the company of political bias … ",
    "url": "https://www.bbc.com/news/articles/c4g32yxpdz0o"
  },
  {
    "text": "Bishop Calls Out Trump and Vance To Their Face  —  This stunning video highlights the first direct call out received by Trump and Vance since taking office.  —  This afternoon, Bishop Mariann Edgar Budde fearlessly called out Donald Trump and JD Vance to their faces at a national prayer service.",
    "url": "https://meidasnews.com/news/bishop-calls-out-trump-and-vance-to-their-face"
  },
  {
    "text": "Justice Dept. removes senior career officials from key positions  —  The Justice Department reassignments involve top career officials in the national security and criminal divisions, according to multiple people familiar with the matter.  —  The Trump administration has removed … ",
    "url": "https://www.washingtonpost.com/national-security/2025/01/21/justice-trump-removes-senior-staffers-national-security-criminal/"
  },
  {
    "text": "The Land of Greater Fools  —  America as a big con.  —  Successful criminals and politicians both understand the wisdom of going big.  It's a felony to steal a thousand bucks.  It's still a felony to steal a billion.  Might as well steal the billion.  Likewise, it takes about the same amount … ",
    "url": "https://www.hamiltonnolan.com/p/the-land-of-greater-fools"
  },
  {
    "text": "Decentralized Social Media Is the Only Alternative to the Tech Oligarchy  —  If it wasn't already obvious, the last 72 hours have made it crystal clear that it is urgent to build and mainstream alternative, decentralized social media platforms that are resistant to government censorship and control … ",
    "url": "https://www.404media.co/decentralized-social-media-is-the-only-alternative-to-the-tech-oligarchy/"
  },
  {
    "text": "Statement from a DHS Spokesperson on Directives Expanding Law Enforcement and Ending the Abuse of Humanitarian Parole  —  WASHINGTON - Yesterday, Acting Department of Homeland Security Secretary Benjamine Huffman issued two directives essential to ending the invasion of the US southern border … ",
    "url": "https://www.dhs.gov/news/2025/01/21/statement-dhs-spokesperson-directives-expanding-law-enforcement-and-ending-abuse"
  },
  {
    "text": "Donald Trump's Medicare Executive Order Explained  —  's executive order 14087, which was put in place to lower the cost of prescription drugs for Americans.  —  Newsweek has reached out to the Trump transition team outside of regular working hours via email for comment.  —  Why It Matters",
    "url": "https://www.newsweek.com/donald-trump-medicare-executive-order-explained-2018138"
  },
  {
    "text": "Sheinbaum Calls for ‘Cool Head’ as Trump Sends Peso Tumbling  — Trump tariff pledge reignites fears he'll target Mexico  — Sheinbaum says she's focused on details rather than rhetoric  —  President Claudia Sheinbaum called for cool heads to prevail after Donald Trump's vow … ",
    "url": "https://www.bloomberg.com/news/articles/2025-01-21/mexico-must-keep-cool-head-on-trump-orders-sheinbaum-says-m66jyfvz"
  },
  {
    "text": "Pritzker attacks Trump over birthright citizenship order: It's ‘chaos’  —  CHICAGO — Illinois Gov. JB Pritzker launched an attack on President Donald Trump's planned executive order attempting to revoke birthright citizenship.  “That's unconstitutional.  We will not follow an unconstitutional order … ",
    "url": "https://www.politico.com/live-updates/2025/01/20/donald-trump-inauguration-day-news-updates-analysis/pritzker-trump-birthright-citizenship-00199472"
  },
  {
    "text": "Trump Takes Down Spanish Version Of White House Website  —  Less than 24 hours after Trump's inauguration, his team has also removed the government's site with information on reproductive rights and health care.  —  LOADING  —  Less than 24 hours after Donald Trump's inauguration … ",
    "url": "https://www.huffpost.com/entry/trump-takes-down-spanish-white-house-website_n_678fed78e4b0a822b63dd194"
  }
]