[
  {
    "text": "New Hampshire's independents could drive Republican primary outcome  —  PORTSMOUTH, N.H. — Dawn Hartnett, 56, a registered independent who voted for Joe Biden in 2020, crammed into a country store this week to catch a glimpse of Nikki Haley.  She has never voted for a Republican in a presidential election … ",
    "url": "https://www.washingtonpost.com/politics/2024/01/20/new-hampshire-primary-independents-haley-trump/"
  },
  {
    "text": "In Frigid New Hampshire, Haley Turns Up the Heat.  But Is It Too Late?  —  On the last weekend before the state's primary on Tuesday, Nikki Haley made her most forceful case yet in her long-shot bid to defeat Donald Trump for the G.O.P. nomination.  —  Nikki Haley on Saturday blasted Donald … ",
    "url": "https://www.nytimes.com/2024/01/21/us/politics/haley-new-hampshire.html"
  },
  {
    "text": "Latest poll shows Trump leading Haley by 19% in NH  —  Ron DeSantis is still a distant third at 6% with three days until the state's first-in-the-nation primary  —  Republican presidential frontrunner Donald Trump increased his lead over Nikki Haley to 19% with two days remaining until the state's primary … ",
    "url": "https://www.nbcboston.com/news/politics/latest-poll-shows-trump-leading-haley-by-19-in-nh/3253299/"
  },
  {
    "text": "Stefanik pushes back on reports Trump mixed up Haley, Pelosi  —  Rep. Elise Stefanik (R-N.Y.) pushed back on reports that former President Trump mixed up his GOP presidential primary rival Nikki Haley with former House Speaker Nancy Pelosi (D-Calif.), according to an NBC News report.",
    "url": "https://thehill.com/homenews/campaign/4419704-stefanik-pushes-back-reports-trump-mixed-up-haley-pelosi/"
  },
  {
    "text": "Nikki Haley questions whether Trump is ‘mentally fit’ after he confuses her with Nancy Pelosi  —  Haley told supporters in New Hampshire that “we can't have someone else that we question whether they're mentally fit to do this.”  —  MANCHESTER, N.H. — Nikki Haley questioned whether Donald Trump … ",
    "url": "https://www.nbcnews.com/politics/2024-election/nikki-haley-trump-mentally-fit-nancy-pelosi-rcna134887"
  },
  {
    "text": "Trump's feral close to the New Hampshire primary  —  The former president was magnanimous after winning Iowa.  He quickly returned to form.  —  For all of 17 minutes in Iowa, Donald Trump was magnanimous.  He thanked his campaign managers by name.  He praised Iowans for delivering him a victory.",
    "url": "https://www.politico.com/news/2024/01/20/trumps-feral-close-to-the-new-hampshire-primary-00136707"
  },
  {
    "text": "DeSantis to New Hampshire voters: I'll bring ‘Live Free or Die’ motto to White House  —  Republican presidential candidate Ron DeSantis relayed a message to New Hampshire voters ahead of next Tuesday's primary that he will bring the “Live Free or Die” motto if elected president.",
    "url": "https://thehill.com/homenews/campaign/4419886-desantis-new-hampshire-voters-live-free-or-die-motto-white-house/"
  },
  {
    "text": "Trump Confuses Haley and Pelosi, Accusing Rival of Jan. 6 Lapse  —  Donald Trump has often accused former House Speaker Nancy Pelosi of failing to provide adequate security for the Capitol.  On Friday, he inexplicably substituted Nikki Haley's name for Ms. Pelosi's.",
    "url": "https://www.nytimes.com/2024/01/19/us/politics/trump-confuses-haley-and-pelosi-accusing-rival-of-jan-6-lapse.html"
  },
  {
    "text": "‘America Is Under Attack’: Inside the Anti-D.E.I. Crusade  —  In late 2022, a group of conservative activists and academics set out to abolish the diversity, equity and inclusion programs at Texas' public universities.  —  They linked up with a former aide to the state's powerful lieutenant governor … ",
    "url": "https://www.nytimes.com/interactive/2024/01/20/us/dei-woke-claremont-institute.html"
  },
  {
    "text": "House GOP already considering a future without Johnson  —  Speaker Mike Johnson is beset with political challenges: At least two conservative lawmakers have begun threatening his job.  The former acting speaker trashed Johnson's performance this week.  A border-policy showdown with the Senate and White House draws nearer every day.",
    "url": "https://www.politico.com/news/2024/01/21/house-gop-mike-johnson-future-00136677"
  },
  {
    "text": "U.S. Pushes Hostage-Release Plan Aimed at Ending Gaza War  —  The talks are at an early stage, and large gaps remain between Israel and Hamas on the details  —  DUBAI—The U.S., Egypt and Qatar are pushing Israel and Hamas to join a phased diplomatic process that would start with a release of hostages and … ",
    "url": "https://www.wsj.com/world/middle-east/u-s-pushes-hostage-release-plan-aimed-at-ending-gaza-war-d48b27e1?mod=followamazon"
  },
  {
    "text": "Where there's smoke, there's fire: Nikki Haley is our choice for the 2024 First in the Nation Primary  —  A hot mic moment from a candidate's withdrawal speech made headlines recently.  His assessment of Nikki Haley: “She's going to get smoked.”  The candidate was close in his assessment, but missed the mark.",
    "url": "https://www.unionleader.com/opinion/editorials/where-theres-smoke-theres-fire-nikki-haley-is-our-choice-for-the-2024-first-in/article_9d248a32-b71b-11ee-97e7-0fe4f8ed2c23.html"
  },
  {
    "text": "Science is revealing why American politics are so intensely polarized  —  Political psychologists say they see tribalism intensifying, fueled by contempt for the other side  —  ATKINSON, N.H. — They stood in line for hours, in steady snow that became steady sleet, to hear the leader of their tribe.",
    "url": "https://www.washingtonpost.com/science/2024/01/20/polarization-science-evolution-psychology/"
  },
  {
    "text": "Top Fani Willis ally calls for lead prosecutor Nathan Wade to step aside  —  A key ally of Fulton County District Attorney Fani Willis (D) said Saturday that the lead prosecutor of the election interference case against former president Donald Trump should step aside amid allegations … ",
    "url": "https://www.washingtonpost.com/national-security/2024/01/20/norm-eisen-fani-willis-nathan-wade/"
  }
]