[
  {
    "text": "‘Morning Joe’ meeting with Trump was driven by fears of retribution from incoming administration, sources say  —  New York CNN  —  “Morning Joe” co-hosts Joe Scarborough and Mika Brzezinski announced Monday, in dramatic fashion, that they went to Mar-a-Lago last week for a fence-mending meeting with President-elect Donald Trump.",
    "url": "https://www.cnn.com/2024/11/19/media/morning-joe-trump-mar-a-lago-meeting-fears/"
  },
  {
    "text": "Behind the Mar-a-Lago meeting  —  Joe Scarborough and Mika Brzezinski's fence-mending meeting with President-elect Donald Trump has the media world buzzing.  Now I have some new reporting to share about why it happened.  —  Yesterday, as outraged “Morning Joe” fans registered their objections … ",
    "url": "https://view.newsletters.cnn.com/messages/17320243327424fa19cf3ca3d/raw"
  },
  {
    "text": "Senate Republicans deliver a message to Trump: Gaetz's confirmation is in jeopardy  —  They're privately hoping Trump doesn't make them walk the plank.  —  Numerous Republican lawmakers told Donald Trump and his team that they believe his pick to be attorney general, controversial Rep. Matt Gaetz … ",
    "url": "https://www.politico.com/news/2024/11/19/senate-republicans-matt-gaetz-attorney-general-00190332"
  },
  {
    "text": "Scoop: Trump personally squeezes senators on Matt Gaetz … - “He clearly wants Matt Gaetz,” said Sen. Kevin Cramer (R-N.D.), who received a call from Trump. … - “One thing about Donald Trump, people should never confuse his support for one of his nominees as a tactical or strategic tool for somebody else,” Cramer said.",
    "url": "https://www.axios.com/2024/11/18/trump-gaetz-confirmation-senate"
  },
  {
    "text": "Gaetz May Not Be Confirmed, Trump Admits.  He's Pushing Him and Others Anyway.  —  The president-elect is taking a flood-the-zone approach to his cabinet nominations, betting that the Senate won't dare to turn them all down.  —  In his private conversations over the past few days … ",
    "url": "https://www.nytimes.com/2024/11/18/us/politics/trump-cabinet.html"
  },
  {
    "text": "GOP senators deride idea of replacing FBI background checks for Trump nominees  —  Senate Republicans are rejecting a proposal floated by some advisers to President-elect Trump to take the job of conducting background checks for high-level nominees away from the FBI and give it to private investigators.",
    "url": "https://thehill.com/homenews/senate/4996945-senate-republicans-reject-private-investigators/"
  },
  {
    "text": "Negative signs for Gaetz as senators brush off questions amid Trump pressure  —  A negative sign looms for Matt Gaetz: Nearly a dozen GOP senators won't commit to confirming him for attorney general, saying they want to let the process play out.  And many, even if they aren't insisting … ",
    "url": "https://www.politico.com/live-updates/2024/11/18/congress/gop-senators-on-gaetz-ethics-report-00190295"
  },
  {
    "text": "Republican bathroom bill targets Congress's first transgender member  —  South Carolina Republican Nancy Mace introduces bill two months before Sarah McBride is to be sworn in  —  After Delaware elected the first ever openly transgender member of Congress earlier this month … ",
    "url": "https://www.theguardian.com/us-news/2024/nov/19/sarah-mcbride-congress-bathroom-bill-transgender"
  },
  {
    "text": "Mace introduces bill to bar trans women from Capitol restrooms  —  Rep. Nancy Mace (R-S.C.) on Monday introduced a bill to bar transgender women from facilities on Capitol Hill that match their gender identity.  —  The resolution, which would prohibit members, officers and employees … ",
    "url": "https://thehill.com/homenews/house/4997024-mace-introduces-bill-transgender/"
  },
  {
    "text": "Trump Confirms Plan to Use Military to Carry Out Mass Deportations  —  Further proof that the president-elect is willing—even excited—to implement the cruel immigration policy.  —  On Monday, Donald Trump appeared to confirm that he is willing—even eager—to declare a national emergency … ",
    "url": "https://www.motherjones.com/politics/2024/11/trump-mass-deportations-military-national-emergency/"
  },
  {
    "text": "RFK Jr. is a massive public health threat  —  Dems like Jared Polis shouldn't pretend pretend otherwise.  —  ∙ Paid … Donald Trump, in his vacuous orange wisdom, has nominated vaccine denier, crank, and champion of disease Robert F. Kennedy Jr. to be the Secretary of Health and Human Services (HHS).",
    "url": "https://www.publicnotice.co/p/rfk-jr-public-health-threat-vaccines"
  },
  {
    "text": "US Won't Adjust Posture After Russia Lowers Nuclear Threshold  —  The US sees no reason to adjust its nuclear posture in response to Russia's decision to lower the threshold for using atomic weapons, a National Security Council spokesperson said.  —  The Russian decision wasn't a surprise … ",
    "url": "https://www.bloomberg.com/news/articles/2024-11-19/us-won-t-adjust-posture-after-russia-lowers-nuclear-threshold"
  },
  {
    "text": "Sen. Thom Tillis Faces an Early Trump Loyalty Test … Calen Razor and  Alex Roarty  — Copy  —  Donald Trump's controversial Cabinet selections are already making life difficult for Republican senators.  —  No one should know that better than Thom Tillis.",
    "url": "https://www.notus.org/congress/sen-thom-tillis-trump-loyalty-test-2026"
  },
  {
    "text": "Hacker Is Said to Have Gained Access to File With Damaging Testimony About Gaetz  —  The computer file is said to contain testimony from the woman who said she had sex with Matt Gaetz, President-elect Donald Trump's choice to be attorney general, when she was 17.",
    "url": "https://www.nytimes.com/2024/11/19/us/politics/matt-gaetz-hack-testimony.html"
  },
  {
    "text": "Leak it like Sam Alito  —  What is obviously a very damning report about Matt Gaetz is now available for everyone on the Ethics Committee to view: … Guest's claims to be free of influence from leadership are the antithesis of credible.  But it shouldn't matter.",
    "url": "https://www.lawyersgunsmoneyblog.com/2024/11/leak-it-like-sam-alito"
  },
  {
    "text": "November 18, 2024  —  On Friday, Secretary of Commerce Gina Raimondo locked in a $6.6 billion deal with the Taiwan Semiconductor Manufacturing Company for it to invest $65 billion in three state-of-the-art fabrication plants in Arizona.  This will bring thousands of jobs to the state.",
    "url": "https://heathercoxrichardson.substack.com/p/november-18-2024"
  },
  {
    "text": "Half of Ukrainians Want Quick, Negotiated End to War  —  EU, U.K. favored over U.S. as negotiators … LONDON — After more than two years of grinding conflict, Ukrainians are increasingly weary of the war with Russia.  In Gallup's latest surveys of Ukraine, conducted in August and October 2024 … ",
    "url": "https://news.gallup.com/poll/653495/half-ukrainians-quick-negotiated-end-war.aspx"
  },
  {
    "text": "Trump Plans to Attend Musk's SpaceX Launch on Tuesday  —  The president-elect's decision to witness the liftoff is another example of his close ties to the world's wealthiest entrepreneur.  —  President-elect Donald J. Trump plans to attend a SpaceX launch in Texas on Tuesday … ",
    "url": "https://www.nytimes.com/2024/11/18/us/politics/trump-musk-spacex-launch-texas.html"
  },
  {
    "text": "The Trump administration's next target: naturalized US citizens  —  It appears that President-elect Donald Trump intends to keep his campaign promise to begin deporting at least 15 million people who, he claims, have been “poisoning the blood” of our country.",
    "url": "https://thehill.com/opinion/immigration/4992787-trump-deportation-plan-immigration/"
  },
  {
    "text": "Judge denies Jan. 6 defendant's bid to delay trial that could straddle Trump inauguration  —  A Jan. 6 defendant facing five felony charges could be on trial at the precise moment power changes hand from President Joe Biden to President-elect Donald Trump — an uncomfortable prospect … ",
    "url": "https://www.politico.com/live-updates/2024/11/19/congress/january-6-donald-trump-doj-00190348"
  },
  {
    "text": "Republicans slow down Senate floor to delay Biden judicial picks  —  Senate Republicans moved to slow down the pace of judicial nomination confirmations in the waning days of Joe Biden's presidency on Monday evening, forcing the chamber into hours of routine votes.  What happened?",
    "url": "https://www.politico.com/live-updates/2024/11/19/congress/senate-slowdown-00190335"
  },
  {
    "text": "Trump nominates former Wisconsin Rep. Sean Duffy for Secretary of Transportation  —  Duffy served as a member of the House Financial Services committee while serving as a member of Congress  —  President-elect Trump announced that he is nominating former Congressman Sean Duffy of Wisconsin … ",
    "url": "https://www.foxnews.com/politics/trump-nominates-former-wisconsin-rep-sean-duffy-secretary-transportation"
  },
  {
    "text": "Pennsylvania Dem Gov. Josh Shapiro sides with state supreme court ruling not to count certain mail-in ballots  —  The ruling is a victory for GOP officials in an effort to keep the party's narrow Senate victory  —  Join Fox News for access to this content  —  Pennsylvania Gov. Josh Shapiro … ",
    "url": "https://www.foxnews.com/politics/pennsylvania-dem-gov-josh-shapiro-sides-state-supreme-court-ruling-not-count-certain-mail-in-ballots"
  },
  {
    "text": "For Minority Working-Class Voters, Dismay in Democrats Led to Distrust  —  In scores of interviews throughout 2024, Latino, Black and Asian American voters, many of whom voted for Donald Trump, said they no longer trusted Democrats to improve the economy.  —  The working-class voters Vice … ",
    "url": "https://www.nytimes.com/2024/11/19/us/politics/trump-working-class-voters.html"
  }
]