[
  {
    "text": "Harris seen as debate winner while maintaining slight lead over Trump: POLL  —  Taylor Swift's endorsement of Harris shows little impact, the poll found.  —  Vice President Kamala Harris and former President Donald Trump attend a presidential debate in Philadelphia, Sept. 10, 2024.",
    "url": "https://abcnews.go.com/Politics/harris-debate-winner-maintaining-slight-lead-trump-poll/story?id=113673862"
  },
  {
    "text": "Swift endorsement turns more voters from Harris than it attracts: poll  —  It might not be such a “Love Story” after all.  —  Taylor Swift's endorsement of Vice President Kamala Harris and her running mate, Minnesota Gov. Tim Walz, may turn more voters away than it attracts.",
    "url": "https://nypost.com/2024/09/14/us-news/more-voters-to-vote-against-harris-than-for-after-swift-endorsement-poll/"
  },
  {
    "text": "Ronald Reagan's former staff back Harris-Walz ticket: “Today is a choice between integrity and demagoguery.”  —  Seventeen former staff members of the late Republican President Ronald Reagan are endorsing the Democratic nominee, Vice President Kamala Harris.",
    "url": "https://www.cbsnews.com/news/ronald-reagan-former-staff-back-harris-walz-ticket/"
  },
  {
    "text": "Trump can't accept his poor debate.  So he's spiraled into conspiracy theories.  —  Since Kamala Harris was widely seen as besting him at the debate, Donald Trump has spread conspiracy theories and spun false tales, losing focus on what polls say matters most to voters.",
    "url": "https://www.washingtonpost.com/politics/2024/09/14/trump-conspiracies-lies-analysis/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI2Mjg2NDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI3NjY4Nzk5LCJpYXQiOjE3MjYyODY0MDAsImp0aSI6IjIyYTI0YjE0LTViZjctNDYwMy1iMzYxLTkzYjUwZWZlODE1OSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzA5LzE0L3RydW1wLWNvbnNwaXJhY2llcy1saWVzLWFuYWx5c2lzLyJ9.K92q18FTQozl_3gOyecXSzZCuEcHQsjdoTD-iIxkAMQ&itid=gfta"
  },
  {
    "text": "Donald Trump Jr. Piles On With Racist Comments About Haitians  —  After former President Donald J. Trump spread debunked claims that immigrants from Haiti were eating pets, his son cast more aspersions on Haitian immigrants.  —  Amid fallout from Donald J. Trump's debunked claim about immigrants … ",
    "url": "https://www.nytimes.com/2024/09/14/us/politics/don-jr-trump-haitian-migrants.html?unlocked_article_code=1.Kk4.NClr.x2kjJ2DpQ0tc&smid=url-share"
  },
  {
    "text": "JD Vance's Blood-and-Soil Nationalism Finds Its Target  —  If Senator JD Vance of Ohio had a moral compass, a shred of decency or a belief in anything other than his own ambition and will-to-power, he would resign his Senate seat effective immediately, leave the presidential race and retire from public life … ",
    "url": "https://www.nytimes.com/2024/09/14/opinion/jd-vance-haiti-ohio-immigrants.html"
  },
  {
    "text": "Loomer threatens to sue Maher over Trump affair rumor  —  Laura Loomer hit back over Bill Maher's assertion that she was having an affair with Donald Trump  —  Laura Loomer is threatening to lawyer up after Bill Maher joked about a possible affair between the far-right troll and Donald Trump.",
    "url": "https://www.salon.com/2024/09/14/loomer-threatens-to-maher-over-affair-rumor/"
  },
  {
    "text": "The Laura Loomer Problem Is the Same as the Vladimir Putin Problem  —  At about the same time that several of Donald Trump's most loyal supporters were warning that Laura Loomer's access to the former President threatens his presidential bid, Tim Walz was in Grand Rapids mocking how easy it is to manipulate Donald Trump.",
    "url": "https://www.emptywheel.net/2024/09/14/the-laura-loomer-problem-is-the-same-as-the-vladimir-putin-problem/"
  },
  {
    "text": "Fact check: Harris campaign social media account has repeatedly deceived with misleading edits and captions  —  A social media account run by Vice President Kamala Harris' campaign has been repeatedly deceptive.  —  The @KamalaHQ account, which has more than 1.3 million followers … ",
    "url": "https://www.cnn.com/2024/09/14/politics/fact-check-harris-campaign-social-media/"
  },
  {
    "text": "‘The Apprentice’ Producers Were Shocked by Trump's ‘Musty Carpet’  —  CREATING DONALD TRUMP  —  “Our job was to make him look legitimate, to make him look like there was something behind it, even though we pretty much all knew that there wasn't,” one producer said.  —  Journalist",
    "url": "https://www.thedailybeast.com/producers-of-the-apprentice-expose-donald-trumps-musty-carpet-in-new-book"
  },
  {
    "text": "Cheating as a Way of Life  —  What Donald keeps getting away with  —  Donald spent the weekend, as he often does, lying to the American people and ranting about all of the ways in which the debate was rigged against him—from the moderators giving Kamala Harris the questions ahead … ",
    "url": "https://www.marytrump.org/p/cheating-as-a-way-of-life"
  },
  {
    "text": "It's Time To Oppress Conservatives  —  Last Tuesday Donald Trump shat his pants on national TV in prime time, and ever since he's been scooting his butt around on the national carpet trying to dislodge the detritus of loserdom, stumbling around the post-debate media spin tent like a shaved tranquilized bear … ",
    "url": "https://www.the-reframe.com/its-time-to-oppress-conservatives-2/"
  },
  {
    "text": "Arizona's 1864 abortion ban is officially off the books  —  Arizona's Civil War-era ban on nearly all abortions officially was repealed Saturday.  —  The Western swing state has been whipsawed over recent months, starting with the Arizona Supreme Court deciding in April to let the state enforce … ",
    "url": "https://www.latimes.com/world-nation/story/2024-09-14/arizonas-1864-abortion-ban-is-officially-off-the-books"
  },
  {
    "text": "JD Vance says it would be ‘very hard’ for Trump to win without North Carolina  —  Recent polling has shown a razor-thin race in the Tar Heel State.  —  GREENVILLE, N.C. — Sen. JD Vance, R-Ohio, said on Saturday that it would be “very hard” for the Trump campaign to win in November if it does … ",
    "url": "https://www.nbcnews.com/politics/2024-election/jd-vance-says-hard-trump-win-north-carolina-rcna171162"
  },
  {
    "text": "Trump's swing-state plan targets “sometimes” voters … - Trump's team is outgunned in sheer resources: The campaign says it has about 27,000 top volunteers on the ground nationwide, and “hundreds of thousands” more in various roles in battleground states.",
    "url": "https://www.axios.com/2024/09/14/trump-swing-state-voter-targets"
  }
]