[
  {
    "text": "Schumer: Vance VP pick helps Democrats  —  “I'll bet President Trump is sitting there, scratching his head, and wondering, ‘Why did I pick this guy?’”  Schumer said.  “The choice may be one of the best things he ever did for Democrats.”  —  Senate Majority Leader Chuck Schumer (D-N.Y.) … ",
    "url": "https://www.politico.com/news/2024/07/28/schumer-vance-vp-pick-helps-democrats-00171535"
  },
  {
    "text": "Trump's insult trap: Republicans hunt for elusive Harris attack line … - Black voters could be sensitive to attacks on Harris' identity, including quotes from multiple Republican lawmakers last week labeling her a “DEI vice president.”  — Years-old comments from J.D. Vance calling Harris a … ",
    "url": "https://www.axios.com/2024/07/29/trump-attacks-harris-dei-gop-election"
  },
  {
    "text": "Ilhan Omar says Trump is ‘losing his memory’ after he confuses her with Rashida Tlaib  —  Ex-president Trump confuses Minnesota progressive member with her fellow “Squad” Democrat  —  Support truly  —  independent journalism  —  Our mission is to deliver unbiased, fact-based reporting … ",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/ilhan-omar-trump-rashida-tlaib-b2587342.html"
  },
  {
    "text": "Elon Musk Shares Kamala Harris Deepfake  —  The billionaire troll posted a video with altered audio that made it sound like the vice president said she did not “know the first thing about running the country” and is “the ultimate diversity hire”  —  Billionaire Elon Musk shared a deepfake video … ",
    "url": "https://www.rollingstone.com/politics/politics-news/elon-musk-kamala-harris-deepfake-1235069564/"
  },
  {
    "text": "JD Vance is faltering in the Midwest, a big problem for the GOP  — When Trump tapped JD Vance as his running mate, the Ohioan's background was a major selling point.  — But new CNN data shows Vance with a double-digit net unfavorable rating across the Midwest.",
    "url": "https://www.businessinsider.com/jd-vance-midwest-presidential-election-gop-trump-2024-7"
  },
  {
    "text": "Venezuela election live updates: Opposition claims victory after Maduro was declared the winner  —  Supporters of President Nicolás Maduro gather at Miraflores Palace in Caracas as Maduro is declared the winner in Venezuela's presidential election amid opposition claims of irregularities.",
    "url": "https://apnews.com/live/venezuela-election-updates-maduro-machado-gonzalez"
  },
  {
    "text": "Harris Camp Warns Supporters: Don't Get Duped by ‘Scam PACs’  —  KAMALA HARRIS'S TEAM IS WARNING DONORS not to fall prey to “financial scams” from groups sending email and text messages that suggest they're raising money for the vice president.  —  Those messages came rapidly last week … ",
    "url": "https://www.thebulwark.com/p/harris-camp-warns-of-democratic-scam-pacs"
  },
  {
    "text": "“My Beautiful Christians:” Trump's Pandering to Christian Nationalists  —  The other day, during an address to a Turning Point conference, Trump implored, … Video  —  Horse race journalists didn't care.  They found it more important to repeat and therefore magnify Trump's latest slur on Vice President Harris.",
    "url": "https://www.emptywheel.net/2024/07/29/my-beautiful-christians-dont-talk-about-trumps-pandering-to-christian-nationalists/"
  },
  {
    "text": "Buttigieg Tells Fox Viewers that MAGA Is a Cult  —  “We don't have that kind of warped reality on our side,” the Biden transportation secretary said, calling Trump “older and stranger” than he was in 2016  —  Pete Buttigieg offered a dose of reality for viewers on Fox, pointing out the lies and “cult of personality” of Donald Trump.",
    "url": "https://www.rollingstone.com/politics/politics-news/buttigieg-fox-viewers-maga-cult-1235069586/"
  },
  {
    "text": "My plan to reform the Supreme Court and ensure no president is above the law  —  We can and must prevent the abuse of presidential power and restore the public's faith in our judicial system.  —  The writer is president of the United States.  —  This nation was founded on a simple yet profound principle: No one is above the law.",
    "url": "https://www.washingtonpost.com/opinions/2024/07/29/joe-biden-reform-supreme-court-presidential-immunity-plan-announcement/"
  },
  {
    "text": "House Dem super PAC adds $24M to fall TV ad buys  —  House Democrats' largest super PAC is adding to its already massive fall ad campaign, including targeting three new Republican incumbents as it tries to capitalize on a surge of enthusiasm surrounding Vice President Kamala Harris' rise.",
    "url": "https://www.politico.com/live-updates/2024/07/29/congress/house-majority-pac-24m-ad-buys-00171570"
  },
  {
    "text": "How to Buy a President  —  Donald Trump's joke of a media company is also a $6 billion meme stock — and an unprecedented opportunity for corruption.  —  What may turn out to be a hinge in American history occurs one day in November 2004, when the future president of the United States asks … ",
    "url": "https://nymag.com/intelligencer/article/donald-trump-truth-social-djt-stock-corruption.html"
  },
  {
    "text": "Biden to announce Supreme Court reforms on Monday  —  President Biden on Monday will propose term limits for Supreme Court justices and a constitutional amendment to counteract their recent presidential immunity decision, according to a White House official.",
    "url": "https://thehill.com/homenews/administration/4797259-biden-to-announce-supreme-court-reforms-on-monday/"
  },
  {
    "text": "America's New Political War Pits Young Men Against Young Women  —  A majority of men under 30 support former President Trump and Republican control of Congress, a sharp reversal from the 2020 race; young women strongly favor Democrats",
    "url": "https://www.wsj.com/politics/policy/men-women-vote-republican-democrat-election-7f5f726c"
  },
  {
    "text": "'We all realize it's unlikely.' But Pete Buttigieg's VP stock is rising.  —  He has taken heat in his role in the Biden administration.  But to some Harris advisers, he makes an intriguing pitch.  —  Suddenly, Pete Buttigieg is everywhere.  —  The transportation secretary is blitzing … ",
    "url": "https://www.politico.com/news/2024/07/28/pete-buttigieg-longshot-vp-harris-00171515"
  }
]