[
  {
    "text": "Obama, Pelosi privately expressed concerns over Biden  —  Barack Obama and Nancy Pelosi have spoken privately about Joe Biden and the future of his 2024 campaign.  Both the former president and ex-speaker expressed concerns about how much harder they think it's become for the president to beat Donald Trump.",
    "url": "https://www.cnn.com/2024/07/11/politics/obama-pelosi-biden-democrats-2024/"
  },
  {
    "text": "Joe Biden Calls Kamala Harris ‘Vice President Trump’ at Crucial Press Conference  —  OH JOE  —  The president's make-or-break press conference started with a mix-up after he called Ukrainian President Zelensky “Putin.”  —  Deputy Washington Bureau Chief  —  Joe Biden started … ",
    "url": "https://www.thedailybeast.com/joe-biden-calls-kamala-harris-vice-president-trump-in-disastrous-start-to-press-conference"
  },
  {
    "text": "Biden does some damage control with House Dems — but not enough  —  President Joe Biden delivered a steady performance at a high-stakes press conference Thursday but still fell short of assuring jittery Democrats concerned about his future, prolonging painful questions across the party.",
    "url": "https://www.politico.com/live-updates/2024/07/11/congress/how-dem-lawmakers-viewed-bidens-performance-00167743"
  },
  {
    "text": "After Biden's debate performance, the presidential race is unchanged  —  The race for the presidency remains statistically tied despite President Biden's dismal debate performance two weeks ago, a new national NPR/PBS NewsHour/Marist poll finds.  —  Biden actually gained a point since last month's survey … ",
    "url": "https://www.npr.org/2024/07/12/nx-s1-5036518/biden-trump-poll"
  },
  {
    "text": "Potentially dozens of Democrats expected to call on Biden to step aside after NATO conference  —  Four Democratic sources with knowledge tell CBS News that they expect dozens of Democratic lawmakers over the next 48 hours to issue statements calling for President Biden to step out of the race.",
    "url": "https://www.cbsnews.com/news/potentially-dozens-of-democrats-expected-to-call-on-biden-to-step-aside-after-nato-conference/"
  },
  {
    "text": "Angry and stunned Democrats blame Biden's closest advisers for shielding public from full extent of president's decline  —  At a star-studded fundraiser for President Joe Biden in Los Angeles last month, George Clooney wasn't the only one who came away concerned about the president.",
    "url": "https://www.cnn.com/2024/07/11/politics/joe-biden-age-decline-democrats-angry/"
  },
  {
    "text": "White House guests recount concerns after seeing Biden weeks before debate: ‘What we witnessed was troubling’  —  Some guests at a White House concert in June say they had concerns about Biden.  —  President Joe Biden, center, during a Juneteenth concert on the South Lawn of the White House, June 10, 2024.",
    "url": "https://abcnews.go.com/US/white-house-guests-recount-concerns-after-biden-weeks/story?id=111849442"
  },
  {
    "text": "Is Kamala Harris a Stronger Candidate Than Biden?  —  Possibility that the president will end his campaign highlights his vice president's political pros and cons  —  GREENSBORO, N.C.—In the background of President Biden's decision on whether to continue his campaign against Donald Trump … ",
    "url": "https://www.wsj.com/politics/elections/is-kamala-harris-a-stronger-candidate-than-biden-831b7dbb"
  },
  {
    "text": "Playbook: Biden's presser leaves Dems in ‘purgatory’  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  GOOD MORNING, MR. PRESIDENT — “The race for the presidency remains statistically tied despite [President JOE] BIDEN's dismal debate performance two weeks ago … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/07/12/bidens-presser-leaves-dems-in-purgatory-00167772"
  },
  {
    "text": "Behind the Curtain: Committee to Unelect the President … - Former Obama aides: The strained relationship between Obama and Biden extends to their former aides, including David Axelrod (Obama's ruthlessly pragmatic chief strategist) and the influential “Pod Save America” guys.",
    "url": "https://www.axios.com/2024/07/12/biden-news-old-democrats-president"
  },
  {
    "text": "Civic Media  —  Statement regarding edits to the July 4th interview with President Biden  —  The Earl Ingram Show was one of two radio programs contacted by the Biden campaign following the June 27th debate to speak with President Biden.  The interview was recorded on July 3rd and aired … ",
    "url": "https://civicmedia.us/2024/07/11/statement-regarding-edits-to-the-july-4th-interview-with-president-biden"
  },
  {
    "text": "Trump May Attempt to Disavow Project 2025 — but He's not Disavowing Viktor Orbán  —  The press has been a bit befuddled by Trump's repeated attempts to disavow Project 2025.  —  One of the best debunkings of Trump's false disavowal came from CNN, which made a list of the 140 Trump associates involved in Project 2025.",
    "url": "https://www.emptywheel.net/2024/07/12/transitive-transatlantic-authoritarianism-heritage-orban-trump/"
  },
  {
    "text": "Where are the Radical Republicans when we need them?  —  America once understood the necessity of uniting against existential threats. … History teaches a clear lesson: When a nation's democratic institutions are facing an existential threat, relentlessly opposing it should be the sole focus.",
    "url": "https://www.publicnotice.co/p/the-need-to-unite-against-trump-2024"
  },
  {
    "text": "AOC understands the stakes: The “high crimes” of Clarence Thomas and Sam Alito must be prosecuted  —  The corruption of Supreme Court justices is about more than greed.  It “constitutes a clear danger to our democracy”  —  Corruption is one of those issues that tends to rile … ",
    "url": "https://www.salon.com/2024/07/12/aoc-understands-the-stakes-the-high-crimes-of-clarence-thomas-and-sam-alito-must-be-prosecuted/"
  },
  {
    "text": "Nepal PM Dahal loses parliamentary vote of confidence  —  Nepal Prime Minister Pushpa Kamal Dahal lost a parliamentary vote of confidence on Friday, ending a tumultuous 20-month tenure that saw him survive four such trust votes, and paving the way for the formation of a new coalition government.",
    "url": "https://www.reuters.com/world/asia-pacific/nepal-pm-dahal-loses-parliamentary-vote-confidence-2024-07-12/"
  },
  {
    "text": "GOP Rep Delivers a House Floor Speech Straight Out of 'The Handmaid's Tale'  —  BLESSED BE THE FRUIT  —  In a speech before the House that seemed lifted right out of Margaret Atwood's dystopian classic, Rep. Glenn Grothman said he wants the U.S. to go back to 1960.",
    "url": "https://www.thedailybeast.com/rep-glenn-grothman-delivers-speech-straight-out-of-the-handmaids-tale"
  }
]