[
  {
    "text": "Car crashes into parked SUV in Biden's motorcade near Delaware campaign HQ  —  President Biden and first lady Jill Biden are safe after a car crashed into an SUV guarding his motorcade near his campaign headquarters in Wilmington, Delaware on Sunday night, the White House said.",
    "url": "https://www.axios.com/2023/12/18/car-crashes-suv-guarding-biden-motorcade-delaware-campaign-hq"
  },
  {
    "text": "Biden safe after car collides with motorcade  —  President Joe Biden was safe on Sunday night after a car collided with a motorcade SUV that was part of the president's security detail, a Reuters witness said.  —  Biden and First Lady Jill Biden had just left his campaign headquarters when the collision occurred.",
    "url": "https://www.reuters.com/world/us/car-collides-with-vehicle-president-bidens-motorcade-delaware-witness-2023-12-18/"
  },
  {
    "text": "Trump reprises dehumanizing language on undocumented immigrants, warns of ‘invasion’  —  Former president Donald Trump on Sunday accused undocumented immigrants of waging an “invasion” of the United States, in a speech that highlighted his frequent use of dehumanizing language and exaggerated terms … ",
    "url": "https://www.washingtonpost.com/politics/2023/12/18/trump-immigrants-invasion-dehumanizing/"
  },
  {
    "text": "Behind the Curtain — Another Trump 2025 edge: a compliant Congress  —  If former President Trump wins next year, he'd have much greater power than in his first term — and fewer restraints on carrying out his political agenda.  That's thanks to the trifecta of a more compliant cabinet, government workforce — and Congress.",
    "url": "https://www.axios.com/2023/12/18/trump-2025-republican-congress"
  },
  {
    "text": "Florida GOP votes to strip Chair Christian Ziegler of authority amid rape allegation  —  The Florida GOP on Sunday began the process of removing Chair Christian Ziegler amid a sexual assault allegation, with the party's executive board voting during an emergency meeting to censure the chair … ",
    "url": "https://www.heraldtribune.com/story/news/politics/state/2023/12/17/florida-republicans-take-steps-toward-removing-chair-christian-ziegler/71933027007/"
  },
  {
    "text": "Biden said to be increasingly frustrated by dismal poll numbers  —  In one recent meeting he said poll numbers were unacceptably low and he wanted to know what his team and his campaign were doing about it  —  The night before President Biden departed Washington to celebrate Thanksgiving on Nantucket … ",
    "url": "https://www.washingtonpost.com/politics/2023/12/18/joe-biden-polls-campaign/"
  },
  {
    "text": "A “Delicate Matter”: Clarence Thomas' Private Complaints About Money Sparked Fears He Would Resign  —  Friends of the Court: SCOTUS Justices' Beneficial Relationships With Billionaire Donors  —  Supreme Court Justice Clarence Thomas' decadeslong friendship with real estate tycoon Harlan Crow … ",
    "url": "https://www.propublica.org/article/clarence-thomas-money-complaints-sparked-resignation-fears-scotus"
  },
  {
    "text": "Conservatives move to keep abortion off the 2024 ballot  —  “We don't believe those rights should be subjected to majority vote.”  —  Conservatives are testing new tactics to keep abortion off the ballot following a series of high-profile defeats.  —  In Arizona, Florida, Nevada and other states … ",
    "url": "https://www.politico.com/news/2023/12/18/first-rule-of-the-anti-abortion-playbook-dont-let-the-public-vote-on-abortion-00132049"
  },
  {
    "text": "A Third-Party Candidate Can't Win in 2024  —  No Labels is pushing a dangerous lie that would simply serve to put Donald Trump back in the White House.  —  With a rematch between President Joe Biden and Donald Trump almost set in stone, it's time to put a farce to rest … ",
    "url": "https://www.politico.com/news/magazine/2023/12/18/third-party-2024-no-labels-00132066"
  },
  {
    "text": "Dean Phillips' standing on Capitol Hill has all but collapsed  —  As Rep. Dean Phillips ramps up his long-shot bid for president, his Democratic colleagues back in Washington are fuming at what they see as the Minnesotan's betrayal of his party. … - Democrats “who see the same polls that I see … ",
    "url": "https://www.axios.com/2023/12/17/dean-phillips-standing-on-capitol-hill-has-all-but-collapsed"
  },
  {
    "text": "Canada will soon announce an all-EV sales requirement for 2035: reports  —  Canada is expected to announce new regulations this week that will require all vehicles sold in the country to be zero-emissions by 2035, according to news reports.  —  The new regulations, which will reportedly … ",
    "url": "https://thehill.com/policy/energy-environment/4364936-canada-will-soon-announce-an-all-ev-sales-requirement-for-2035-reports/"
  },
  {
    "text": "No Beliefs, Just Intentions  —  Victims of abuse create language to name both abuse and abusers.  Inevitably, abusers use that same language to deny what they're doing.  Navigating false equivalence in an age of rising fascism. … Two families got fed up and moved away.  The Nobles of Iowa moved to blue Minnesota.",
    "url": "https://armoxon.substack.com/p/no-beliefs-just-intentions"
  },
  {
    "text": "Southwest's $140M penalty ‘should put all airlines on notice’ after travel debacle  —  Last year's travel mess left 16,900 flights canceled and more than two million passengers stranded.  —  The Transportation Department is slapping Southwest Airlines with the largest consumer protection penalty … ",
    "url": "https://www.politico.com/news/2023/12/18/southwest-airlines-fine-2022-transportation-00132222"
  },
  {
    "text": "Scoop: Crypto leaders build colossal $78 million war chest for 2024  —  Cryptocurrency industry leaders have poured $78 million into super PACs aimed at bolstering and growing the ranks of crypto-friendly lawmakers on Capitol Hill, Axios has learned. … - Crypto-focused super PAC Fairshake … ",
    "url": "https://www.axios.com/2023/12/18/crypto-super-pac-fairshake-2024-elections"
  }
]