[
  {
    "text": "The Republican Plot Against Donald Trump  —  The Republican Plot Against Donald Trump  —  The inside story of how Congress is pursuing endless war in Ukraine—and trying to stop a Trump election.  —  This weekend, Senate Democrats (joined by a few Republicans, including most Republican leadership) … ",
    "url": "https://www.theamericanconservative.com/how-congress-is-pursuing-endless-war-in-ukraine-and-trying-to-stop-a-trump-election/"
  },
  {
    "text": "G.O.P. Officials, Once Critical, Stand by Trump After NATO Comments  —  Defending Donald Trump or deflecting his statements, some top G.O.P. officials reflected the trajectory of a party that the former president has largely bent to his will.  —  After Donald J. Trump suggested he had threatened … ",
    "url": "https://www.nytimes.com/2024/02/12/us/politics/trump-nato-republicans.html"
  },
  {
    "text": "Republicans play cleanup on aisle Trump after former president's NATO comments  —  One of the things I'm not going to do any longer is respond to every comment Donald Trump makes and say ‘Do you still support him?’  I do and I support him because Joe Biden's a disaster.  —  Sen. Marco Rubio, R-Fla.",
    "url": "https://www.npr.org/2024/02/12/1230950457/trump-nato-haley-south-carolina-primary-rubio-gop-lawmakers"
  },
  {
    "text": "Trump seeks Supreme Court intervention in election interference case  —  Former President Donald Trump is turning to the justices in a last-ditch effort to prevent his prosecution in the federal election interference case from moving closer to trial.  —  WASHINGTON — Former President Donald Trump … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/trump-seeks-supreme-court-intervention-election-interference-case-rcna137694"
  },
  {
    "text": "‘Wow!’  Morning Joe Crew Stunned By Montage of Trump Repeated Gaffes from Weekend Rallies  —  Joe Scarborough and Mika Brzezinski were equally stunned by a montage of confusing gaffes by former President Donald Trump over a weekend of political rallies, each exclaiming “wow!” coming out of the montage aired on Monday's Morning Joe.",
    "url": "https://www.mediaite.com/tv/wow-morning-joe-crew-stunned-by-montage-of-trump-repeated-gaffes-from-weekend-rallies/"
  },
  {
    "text": "Trump faces Monday deadline to ask the Supreme Court for a delay in his election interference trial  —  WASHINGTON (AP) — Former President Donald Trump faces a Monday deadline for asking the Supreme Court to extend the delay in his trial on charges he plotted to overturn his 2020 election loss.",
    "url": "https://apnews.com/article/supreme-court-trump-capitol-riot-immunity-60bd61263299a88e48d4005d70b6094f"
  },
  {
    "text": "Police have identified the woman who opened fire in a Houston megachurch.  Here's what we know  —  A woman who walked into a popular Texas megachurch Sunday afternoon with a long gun and a young child opened fire before she was killed by law enforcement officers on scene.",
    "url": "https://www.cnn.com/2024/02/12/us/joel-osteen-lakewood-church-shooting-monday/"
  },
  {
    "text": "Media creates Biden “fitness” crisis  —  Robert Hur, the Republican special prosecutor assigned to investigate President Biden, is a lawyer, not a doctor.  On Thursday, Hur issued a lengthy report that came to the legal conclusion that charges against Biden for mishandling classified materials were not warranted.",
    "url": "https://popular.info/p/manufacturing-a-political-crisis"
  },
  {
    "text": "Call and Response: Putin Demanded Greater Russia and Trump Agreed  —  Over the weekend, Putin and Donald Trump seem to have come to public agreement that, if elected in November, Trump would help Putin pursue Greater Russia.  —  In his session with Tucker Carlson, after all … ",
    "url": "https://www.emptywheel.net/2024/02/12/call-and-response-putin-is-demanding-greater-russia/"
  },
  {
    "text": "Donald Trump and Tucker Carlson gave Putin exactly want he wants  —  It is no coincidence that Trump made his biggest threat against NATO right after Tucker Carlson sat with Putin  —  As we all know, the biggest story in the world is the breaking news that President Joe Biden is old.",
    "url": "https://www.salon.com/2024/02/12/donald-and-tucker-carlson-gave-putin-exactly-want-he-wants/"
  },
  {
    "text": "Statement From Walter Reed Military Medical Center Officials on Secretary of Defense Lloyd J. Austin III's Health Status  —  Dr. John Maddox, Trauma Medical Director, and Dr. Gregory Chesnut, Center for Prostate Disease Research of the Murtha Cancer Center Director, at Walter Reed National … ",
    "url": "https://www.defense.gov/News/Releases/Release/Article/3673065/statement-from-walter-reed-military-medical-center-officials-on-secretary-of-de/"
  },
  {
    "text": "Biden disparages Netanyahu in private but hasn't changed U.S. policy toward Israel  —  As the reported Palestinian death toll in Gaza reaches 28,000, the president continues to believe that unequivocally supporting Israel is the right policy.  —  WASHINGTON — President Joe Biden has been venting … ",
    "url": "https://www.nbcnews.com/news/investigations/biden-disparages-netanyahu-private-hasnt-changed-us-policy-israel-rcna138282"
  },
  {
    "text": "‘The voice we woke up to’: Bob Edwards, longtime ‘Morning Edition’ host, dies at 76  —  Bob Edwards, the veteran broadcaster and longtime host of Morning Edition who left an indelible mark on NPR's sound, has died.  He was 76 years old.  —  NPR's Susan Stamberg says Edwards' voice became part … ",
    "url": "https://www.npr.org/2024/02/12/165681524/bob-edwards-dead-npr-host"
  },
  {
    "text": "Exclusive: How Biden botched the border  —  Aboard Air Force One en route to tour the southern border in January 2023, President Biden sat at the head of his conference table and exploded with fury.  — The president lit into his team, which included then-Deputy Chief of Staff Jen O'Malley Dillon … ",
    "url": "https://www.axios.com/2024/02/12/how-biden-botched-border"
  },
  {
    "text": "Republican Michigan lawmaker loses staff and committee assignment after online racist post  —  A Republican lawmaker in Michigan has lost his committee assignment and staff, days after posting an image of a racist ideology on social media  —  For free real time breaking news alerts sent straight … ",
    "url": "https://www.independent.co.uk/news/ap-republican-michigan-gretchen-whitmer-black-b2494937.html"
  },
  {
    "text": "Former RNC Chair Comes Up With Damning New Way To Describe Trump Supporters  —  Michael Steele asked why some voters don't just get what the former president is about.  —  LOADING  —  Michael Steele, a former chair of the Republican National Committee, on Sunday, ripped Donald Trump supporters as … ",
    "url": "https://www.huffpost.com/entry/michael-steele-donald-trump-supporters_n_65ca0c52e4b067c6b73da848"
  }
]