[
  {
    "text": "Trump Officials Attack a German Consensus on Nazis and Speech  —  Vice President JD Vance and Elon Musk have challenged decades-long approaches to political extremism that were designed to prevent another Hitler.  —  The American vice president visited a concentration camp on Thursday afternoon.",
    "url": "https://www.nytimes.com/2025/02/15/world/europe/vance-musk-nazis-afd-munich.html"
  },
  {
    "text": "German Chancellor Scholz Rebukes Vance's Support for Far-Right During Munich Conference  —  At the Munich Security Conference, Olaf Scholz accused the U.S. vice president of unacceptable interference in Germany's coming elections.  — 2.5k  —  Chancellor Olaf Scholz of Germany … ",
    "url": "https://www.nytimes.com/2025/02/15/world/europe/scholz-vance-munich-germany.html?unlocked_article_code=1.xE4.mulj.COUVBJ5qAg8m&smid=url-share"
  },
  {
    "text": "Birthright Citizenship - A Response to Barnett and Wurman  —  In a recent New York Times op ed, legal scholars Randy Barnett and Ilan Wurman offer a partial defense of President Trump's executive order denying birthright citizenship to children of undocumented immigrants, and migrants in the US on temporary visas.",
    "url": "https://reason.com/volokh/2025/02/15/birthright-citizenship-a-response-to-barnett-and-wurman/"
  },
  {
    "text": "Don't Assume Trump Is Wrong About Birthright Citizenship  —  On his first day in office, President Trump issued an executive order that purports to end birthright citizenship for certain children.  It does so despite Section 1 of the 14th Amendment, which declares, “All persons born … ",
    "url": "https://www.nytimes.com/2025/02/15/opinion/trump-birthright-citizenship.html?unlocked_article_code=1.xE4.OCZA.QtpiNIig_NCZ&smid=url-share"
  },
  {
    "text": "Trump-Musk Scandal at USAID Takes Unnerving Turn With Vile Leaked Memo  —  Shockingly, it turns out that empowering the richest human being on the planet to maliciously and gratuitously heap additional misery on that planet's most poor, hungry, and desperate people might—just might … ",
    "url": "https://newrepublic.com/article/191578/trump-musk-scandal-usaid-leaked-memo"
  },
  {
    "text": "Musk and Trump are stopping the distribution of live-saving aid and firing anybody who tells the public about it  —  These people are just cartoonishly evil:  —  A new internal memo circulating inside the U.S. Agency for International Development neatly captures this split.",
    "url": "https://www.lawyersgunsmoneyblog.com/2025/02/musk-and-trump-are-stopping-the-distribution-of-live-saving-aid-and-firing-anybody-who-tells-the-public-about-it"
  },
  {
    "text": "Trump administration wants to un-fire some nuclear safety workers but can't figure out how to reach them  —  The individuals, who work in an agency that oversees the nation's nuclear stockpile, had been fired on Thursday and lost access to their federal government email accounts.",
    "url": "https://www.nbcnews.com/politics/national-security/trump-administration-wants-un-fire-nuclear-safety-workers-cant-figure-rcna192345"
  },
  {
    "text": "US Forest Service and National Park Service to fire thousands of workers  —  Agencies say Trump's latest push to trim government could impede firefighting efforts and create crises at national parks  —  The US Forest Service is firing about 3,400 recent hires while the National Park Service … ",
    "url": "https://www.theguardian.com/us-news/2025/feb/15/us-forest-service-national-park-service-layoffs"
  },
  {
    "text": "Records show how DOGE planned Trump's DEI purge — and who gets fired next  —  A DOGE team plans to fire federal workers who are not in DEI roles and employees in offices that protect equal rights, internal documents show.  —  A team of workers from the U.S. DOGE Service developed step … ",
    "url": "https://www.washingtonpost.com/nation/2025/02/15/doge-fire-federal-employees-trump-dei/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM5NTk1NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQwOTc3OTk5LCJpYXQiOjE3Mzk1OTU2MDAsImp0aSI6ImZjM2IwNWI5LWNjODUtNGRmYy1iYjM4LWM2NWNkZDg0M2UyZiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb24vMjAyNS8wMi8xNS9kb2dlLWZpcmUtZmVkZXJhbC1lbXBsb3llZXMtdHJ1bXAtZGVpLyJ9.qWJU35oN5qhQSXIFVU0OnfmsRXxEde6ezIeNf2mmTV0"
  },
  {
    "text": "Internal DOGE documents lay out plans for ‘Phase 3’ to begin on Wednesday: report  —  According to the Department of Government Efficiency (DOGE) documents obtained by the Washington Post, Elon Musk's unofficial agency is set to launch what they have labeled as “Phase 3” of their drive to dismantle the government on Wednesday.",
    "url": "https://www.rawstory.com/doge-musk-government/"
  },
  {
    "text": "Musk accused Reuters of ‘social deception.’ The deception was his.  —  Trump's DOGE chief mischaracterizes a contract as he marshals “deep state” conspiracy theories to justify cuts to federal agencies.  —  The actor and director Ron Howard posted Wednesday on X an article … ",
    "url": "https://www.washingtonpost.com/technology/2025/02/15/musk-doge-deception-reuters/"
  },
  {
    "text": "Hegseth's Bruising 72-Hour Debut Overseas  —  It was a crash course in geopolitical realities as the new defense secretary stepped onto the world stage.  —  Defense Secretary Pete Hegseth has had a rocky trip to Europe this week.  —  In his debut on the world stage, Mr. Hegseth told NATO … ",
    "url": "https://www.nytimes.com/2025/02/15/us/politics/hegseth-ukraine-russia.html"
  },
  {
    "text": "Trump administration fires 20 immigration judges with no explanation  —  Courts are currently backlogged with 3.7m cases as US president demands more deportations  —  The Trump administration fired 20 immigration judges without explanation, a union official said on Saturday amid sweeping moves … ",
    "url": "https://www.theguardian.com/us-news/2025/feb/15/trump-administration-fires-immigration-judges"
  },
  {
    "text": "Musk, Trump Establish New Era of Kleptocracy in America  —  A third dispatch comparing how the US media would cover this moment if it was happening overseas  —  American institutions, from the media to civil society to Congress and state capitals, continue to underreact to the unraveling of our democracy.",
    "url": "https://www.doomsdayscenario.co/p/musk-trump-establish-new-era-of-kleptocracy-in-america"
  },
  {
    "text": "‘The Gulf of America’ Is the Wrong Fight to Pick  —  The more that politicians mess around with place names, the more important it is to respond according to consistent principles.  —  The executive order rechristening the body of water known internationally as the “Gulf of Mexico” is not an easy document to take seriously.",
    "url": "https://www.theatlantic.com/ideas/archive/2025/02/trump-gulf-renaming-order/681704/"
  },
  {
    "text": "German chancellor slams Vance's call for Europe to be inclusive of far-right parties  —  German Chancellor Olaf Scholz sharply rebuked U.S. Vice President JD Vance on Saturday, a day after Vance gave a speech saying European leaders should not shun far-right political parties.",
    "url": "https://www.npr.org/2025/02/15/nx-s1-5298683/jd-vance-afd-germany-olaf-scholz-musk"
  },
  {
    "text": "Trump Publicly Admits He Thinks He Can Break Any Law He Wants  —  Donald Trump has been back in office for less than one month, and he, Elon Musk, and his senior administration officials have already plunged the nation into an ongoing constitutional crisis and openly performed various brazen acts … ",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-break-law-presidents-day-1235269528/"
  },
  {
    "text": "An Unchecked Trump Rapidly Remakes U.S. Government and Foreign Policy  —  The president's swift moves underscore the confidence of an administration with a much firmer grip on the levers of government than during his first term.  —  The last time President Trump held office … ",
    "url": "https://www.nytimes.com/2025/02/15/us/politics/trump-foreign-policy-government-firings.html"
  },
  {
    "text": "Maryland National Guard out of Frederick Douglass parade after DoD order declares Black History Month ‘dead’  —  Strict guidance from the national defense department crushed plans for an Eastern Shore parade held in honor of Frederick Douglass' 207th birthday because it was being held during … ",
    "url": "https://www.thebaltimorebanner.com/politics-power/maryland-national-guard-frederick-douglass-parade-UM7PE6LNMZG5NNQ3Q3OHD6E47E/"
  },
  {
    "text": "How a Vermont border agent's death exposed violence linked to the cultlike Zizian group  —  In the wooded outskirts of Chapel Hill, North Carolina, a perplexed landlord noticed odd sights at two of his rental properties.  —  Tenants wore long black coats and parked box trucks outside the duplexes.",
    "url": "https://www.cbsnews.com/news/vermont-border-agent-death-exposed-violence-linked-cultlike-zizian-group/"
  },
  {
    "text": "NAACP lists companies that dump DEI in its tactical spending guide for Black Americans  —  The NAACP wants Black Americans to steer their buying power toward companies that haven't pulled back from diversity, equity and inclusion programs under conservative pressure, and the nation's oldest … ",
    "url": "https://apnews.com/article/black-consumers-dei-buying-guide-naacp-34664d8af92e2dc1ba787a498348b7a4"
  },
  {
    "text": "Former RNC Chair Erupts On-Air: To Hell With Republicans!  —  MSNBC host Michael Steele rebuked Republicans in a fiery Saturday morning monologue in which he alleged that President Donald Trump has given DOGE director Elon Musk “absolute power.”  Addressing co-hosts Alicia Menendez … ",
    "url": "https://www.thedailybeast.com/msnbcs-michael-rebukes-gop-over-trump-worship-to-hell-with-republicans/"
  },
  {
    "text": "Not Quite a Unified Theory of Trumpism, but Still an Alarming Pattern  —  President Trump's second term dizzies many Americans, but I find it oddly familiar — an echo of the time I lived in China as a reporter.  —  Americans sometimes misperceive Trump's actions as a fire hose of bizarre … ",
    "url": "https://www.nytimes.com/2025/02/15/opinion/trump-authoritarian-china.html"
  },
  {
    "text": "Trump Supporters Shared How He Could Lose Their Support, And There's One Issue That's Verrrrry Important To Them  —  “We didn't vote for my husband to lose his government career and benefits.”  —  Ashley Holt— BuzzFeed … We recently asked people in the BuzzFeed Community who voted … ",
    "url": "https://www.huffpost.com/entry/trump-supporters-lose-support_n_67af70f2e4b014c4688dabb0"
  }
]