[
  {
    "text": "Trolling the Troll  —  Kamala Harris knows how to get under Donald's skin  —  Americans have known for a while that my uncle has the thinnest skin on the planet.  We now know that Vice President Kamala Harris is all the way under it because Donald keeps admitting it.  —  “I'm very angry at her,” Donald said Thursday.",
    "url": "https://www.marytrump.org/p/trolling-the-troll"
  },
  {
    "text": "Trump's Capitol Hill allies fume at his unfocused candidacy … - “Kamala Harris and Tim Walz are the most left-wing ticket in history,” National Republican Congressional Committee Chair Richard Hudson (R-N.C.) said on the call, according to a source familiar with his comments.",
    "url": "https://www.axios.com/2024/08/16/house-republicans-trump-message-focus-harris"
  },
  {
    "text": "Trump Is Pissed at Harris for Trapping Him in Two Debates  —  Is Donald Trump really trying to get out of debating Kamala Harris again?  Or is it the opposite?  —  On Thursday, it seemed like the dust had finally settled.  “The debate about debates is over,” said Michael Tyler … ",
    "url": "https://newrepublic.com/post/184962/donald-trump-pissed-kamala-harris-chicken-out-debate"
  },
  {
    "text": "‘When they go low, we go with the flow’: Dems ramp up attacks on Trump  —  Democrats are embracing snark.  —  If Democrats in 2016 rallied around Michelle Obama's mantra that “when they go low, we go high,” today they're burying that ambition under a hill of insults, memes and snark.",
    "url": "https://www.politico.com/news/2024/08/17/democrats-trump-attacks-00174470"
  },
  {
    "text": "Harris Puts Four Sun Belt States Back in Play, Times/Siena Polls Find  —  Kamala Harris and Donald Trump are in close races across Arizona, Georgia, Nevada and North Carolina, crucial swing states that Mr. Trump had seemed en route to run away with just a few weeks ago.",
    "url": "https://www.nytimes.com/2024/08/17/us/elections/kamala-harris-trump-az-nc-ga-nv.html?unlocked_article_code=1.Dk4.h1jB.r4PD8EvalJH3&smid=url-share"
  },
  {
    "text": "Harris surges with Black voters in key battleground states but gaps remain  —  Deborah Barfield Berry Terry Collins Lauren VillagranUSA TODAY  —  After two years without work, Darryl Gatewood got a job earlier this year driving a pharmaceutical delivery truck in suburban Pennsylvania - a good-paying job, with healthcare.",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/08/17/black-voters-harris-trump-poll/74773493007/"
  },
  {
    "text": "Armed and Underground: Inside the Turbulent, Secret World of an American Militia  —  This story discusses threats of violence and contains a racial slur.  —  Reporting Highlights  — Militias After Jan. 6: Internal messages reveal how AP3, one of the largest U.S. militias … ",
    "url": "https://www.propublica.org/article/inside-secret-ap3-militia-american-patriots-three-percent"
  },
  {
    "text": "VFW Admonishes Former President for Medal of Honor Remarks  —  The following is a message from VFW National Commander Al Lipphardt  —  WASHINGTON — “On Thursday, former President Donald Trump spoke at an event where he made some flippant remarks about the Medal of Honor and the heroes who have received it.",
    "url": "https://www.vfw.org/media-and-events/latest-releases/archives/2024/8/vfw-admonishes-former-president-for-medal-of-honor-remarks"
  },
  {
    "text": "Trump belittles Medal of Honor award in campaign speech  —  Former President Donald Trump on Thursday said the Presidential Medal of Freedom is a “better” award than the Defense Department's Medal of Honor because service members have to sacrifice their lives or health to receive the military's highest honor … ",
    "url": "https://www.militarytimes.com/news/pentagon-congress/2024/08/16/trump-belittles-medal-of-honor-award-in-campaign-speech/"
  },
  {
    "text": "The times demand serious economic ideas.  Harris supplies gimmicks.  —  ‘Price gouging’ is not causing inflation.  So why is the vice president promising to stamp it out?  —  Vice President Kamala Harris's speech Friday was an opportunity to get specific with voters about how a Harris presidency … ",
    "url": "https://www.washingtonpost.com/opinions/2024/08/16/harris-economy-plan-gimmicks/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzIzNzgwODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI1MTYzMTk5LCJpYXQiOjE3MjM3ODA4MDAsImp0aSI6IjljYjYwZGIyLWQ0MjgtNDU1MC04MTBlLTM5YzM0Mzk0MzQ2ZCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9vcGluaW9ucy8yMDI0LzA4LzE2L2hhcnJpcy1lY29ub215LXBsYW4tZ2ltbWlja3MvIn0.bWh6D-1MNXD5zbyMIvYzINb8bsVgYj2fXfppjv0ictA&itid=gfta"
  },
  {
    "text": "Bronze statue of John Lewis replaces more than 100-year-old Confederate monument  —  A large bronze statue of the late civil rights icon leader and Georgia congressman John Lewis was installed Friday, at the very spot where a contentious monument to the confederacy stood for more than 110 years … ",
    "url": "https://apnews.com/article/john-lewis-bronze-statue-replaced-confederate-georgia-b0c51086a4b83750ff38b1af2167abde"
  },
  {
    "text": "Gov. Tim Walz shares his ‘white guy’ taco recipe with VP Kamala Harris  —  (FOX 9) - Minnesota Gov. Tim Walz explains his “white guy tacos” to Vice President Kamala Harris in a new video on social media.  The first step of his recipe: unseasoned ground beef.  —  What's in the recipe?",
    "url": "https://www.fox9.com/news/tim-walz-white-guy-taco-recipe"
  },
  {
    "text": "California man who was wrongfully convicted by Kamala Harris reveals her sickening taunt when he was found guilty  —  An actor who was wrongfully convicted of murder by Kamala Harris said the Vice President laughed in his face when the verdict was read out in court.",
    "url": "https://www.dailymail.co.uk/news/article-13750465/actor-wrongfully-convicted-kamala-harris-taunt.html"
  },
  {
    "text": "Former congressman George Santos expected to plead guilty to charges related to campaign fraud Monday  —  Former New York Rep. George Santos is expected to plead guilty Monday to federal charges relating to fraudulent activity during his 2022 midterm campaign, according to multiple sources familiar with the deal.",
    "url": "https://www.cnn.com/2024/08/16/politics/santos-expected-plead-guilty-campaign-fraud"
  },
  {
    "text": "Harris reset the election, and congressional Dems are starting to shift strategies  —  Democrats are seeing new energy — and poll numbers.  But they also know they still have a serious fight on their hands in November.  —  Battleground Democrats are suddenly jumping at the chance to campaign with the top of the ticket.",
    "url": "https://www.politico.com/news/2024/08/17/house-senate-democrats-kamala-harris-congress-00174480"
  },
  {
    "text": "House GOP sets its sights on Walz  —  The House Oversight Committee is opening an investigation into Democrats' vice presidential pick.  —  House Republicans are setting their sights on Minnesota Gov. Tim Walz, Democrats' vice presidential candidate — the latest indication that they are using … ",
    "url": "https://www.politico.com/news/2024/08/16/tim-walz-james-comer-china-00174403"
  }
]