[
  {
    "text": "Defiant Biden tells donors: 'We're done talking about the debate'  —  A defiant President Joe Biden insisted to his donors on Monday that he is “done talking about the debate” and implored the party to ignore any further distractions and direct its attention back to Donald Trump.  “We need to move forward.",
    "url": "https://www.politico.com/live-updates/2024/07/08/congress/defiant-biden-tells-donors-were-done-with-the-debate-00166834"
  },
  {
    "text": "Joe Biden Is Not A Decent Man  —  The refrain that Biden is a ‘good’ or ‘decent’ man falls flat when you consider the president's decades of recorded lies and slander.  —  Even as they attempt to force him out, Democrats are still praising the sterling character of the president, especially in contrast to Trump.",
    "url": "https://thefederalist.com/2024/07/08/joe-biden-is-not-a-decent-man/"
  },
  {
    "text": "I was wrong about Biden  —  The worst feeling in the world  —  I really don't enjoy being wrong.1 But looking back on Biden's disastrous debate with the benefit of some time away, I have to admit that I was wrong.  —  I was, of course, aware that Joe Biden was old and showed signs of aging.",
    "url": "https://www.slowboring.com/p/i-was-wrong-about-biden"
  },
  {
    "text": "Biden's Strategy to Make the Race About Trump Is Suddenly in Doubt  —  The Biden campaign's effort to raise questions about Donald J. Trump's ability to be president has boomeranged into a referendum on the president's own competence.  —  From the outset of President Biden's re-election campaign … ",
    "url": "https://www.nytimes.com/2024/07/08/us/politics/biden-trump-strategy.html"
  },
  {
    "text": "Biden warns Congress' Democrats he is “staying in this race” … - “I have heard the concerns that people have ... I am not blind to them,” Biden said.  — But, he said, “I wouldn't be running again if I did not absolutely believe I was the best person to beat Donald Trump in 2024.”",
    "url": "https://www.axios.com/2024/07/08/biden-house-senate-democrats-staying-in-race"
  },
  {
    "text": "Biden tells Hill Democrats he won't step aside amid party drama and “it's time for it to end'  —  U.S. President Joe Biden could make a decision within days whether to remain a candidate for reelection, said Hawaii's governor who participated in a recent meeting with Biden and other Democratic governors … ",
    "url": "https://apnews.com/article/biden-campaign-house-democrats-senate-16c222f825558db01609605b3ad9742a"
  },
  {
    "text": "Trump proposes scaled back platform that softens language on abortion, same sex marriage  —  The draft was circulated Monday among members of the 2024 Republican convention platform committee.  It will be discussed and voted on later this week.  —  The 2024 Republican convention platform aides … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/08/trump-abortion-republican-platform/"
  },
  {
    "text": "What Trump doesn't want you to know about Project 2025  —  Project 2025 is a radical blueprint for a potential second Trump administration, spearheaded by the right-wing Heritage Foundation.  The plan calls for withdrawing approval for the abortion pill, banning pornography, slashing corporate taxes … ",
    "url": "https://popular.info/p/what-trump-doesnt-want-you-to-know"
  },
  {
    "text": "Parkinson's Expert Visited the White House Eight Times in Eight Months  —  The White House has said that President Biden has no signs of the disease and that there has been no reason to update the most recent testing, conducted in February.  —  An expert on Parkinson's disease … ",
    "url": "https://www.nytimes.com/2024/07/08/us/politics/parkinsons-expert-white-house.html"
  },
  {
    "text": "Joe Biden, in the Goodest Bunker Ever  —  When I saw the Michael Shear story in The Times on July 4, recounting how President Biden had stumbled talking to Black radio hosts days after his debate debacle, telling one he was proud to have been “the first Black woman to serve with a Black president,” I knew it spelled trouble.",
    "url": "https://www.nytimes.com/2024/07/07/opinion/joe-biden-goodest.html"
  },
  {
    "text": "The Supreme Incompetents  —  All of the United States' most important governing institutions are failing at once.  —  Congress, of course, has long been barely able to function.  Every year, it struggles merely to fund the rest of the government, and the risk that it will trigger … ",
    "url": "https://www.vox.com/scotus/359206/supreme-court-incompetent-abortion-trump-immunity"
  },
  {
    "text": "Imagine if Dana Bash Knew Trump Had Been President Before?  —  After letting Donald Trump lie non-stop in the debate, Dana Bash invited his aspiring running-mate, Marco Rubio, onto her show to tell the same lies.  —  Ostensibly, she was asking Rubio about whether the Supreme Court immunity … ",
    "url": "https://www.emptywheel.net/2024/07/08/imagine-if-dana-bash-knew-trump-had-been-president-before/"
  },
  {
    "text": "Boeing accepts a plea deal to avoid a criminal trial over 737 Max crashes, Justice Department says  —  Boeing will plead guilty to a criminal fraud charge stemming from two crashes of 737 Max jetliners that killed 346 people after the government determined the company violated an agreement … ",
    "url": "https://apnews.com/article/boeing-guilty-plea-crashes-245a38dc6d3082f4ddff1f6f74f274f2"
  },
  {
    "text": "Marjorie Taylor Greene Botches Basic American History In Most Humiliating Way … LOADING",
    "url": "https://www.huffpost.com/entry/marjorie-taylor-greene-declaration-age_n_668b89d0e4b07ef2c81768ec"
  },
  {
    "text": "Comedian from ‘Anchorman’ and ‘Mr. Show’ pleads guilty in Jan. 6 Capitol attack  —  Actor Jay Johnston, who also had a voice role on “Bob's Burgers,” had been No. 247 on the FBI's Capitol Violence list.  —  WASHINGTON — A veteran comedian with roles on “Mr. Show,” “Arrested Development,” … ",
    "url": "https://www.nbcnews.com/politics/justice-department/comedian-anchorman-mr-show-pleads-guilty-jan-6-capitol-attack-rcna160242"
  },
  {
    "text": "The destruction of the regulatory state is already happening  —  The post-Chevron world is here. … It's been barely a week since conservatives on the US Supreme Court radically upended the balance of power between the branches of government, giving the federal courts the exclusive power … ",
    "url": "https://www.publicnotice.co/p/chevron-ruling-fallout-regulatory-state-demise"
  }
]