[
  {
    "text": "TikTok is coming back online after Trump pledged to restore it  —  New York CNN  —  TikTok appears to be coming back online just hours after President-elect Donald Trump pledged Sunday that he would sign an executive order Monday that aims to restore the banned app.",
    "url": "https://www.cnn.com/2025/01/19/tech/tiktok-ban/"
  },
  {
    "text": "Trump promises to delay TikTok ban in U.S. with Monday executive order  —  Trump says the order will delay enforcement of the TikTok ban so “we can make a deal to protect our national security” with partial U.S. ownership of the platform.  —  President-elect Donald Trump confirmed Sunday … ",
    "url": "https://www.washingtonpost.com/technology/2025/01/19/tiktok-trump-executive-order-ban/"
  },
  {
    "text": "Trump says he will issue an executive order Monday to get TikTok back up  —  President-elect Donald Trump said Sunday that he plans to issue an executive order that would give TikTok's China-based parent company more time to find an approved buyer before the popular video-sharing platform is subject to a permanent U.S.ban.",
    "url": "https://apnews.com/article/tiktok-ban-trump-biden-china-bdc79b7ce741a81761f67ea56d410103"
  },
  {
    "text": "Donald Trump, crypto billionaire … - After another massive overnight rally, as of Sunday morning Trump's crypto holdings were worth as much as $58 billion on paper, enough — with his other assets — to make him one of the world's 25 richest people.",
    "url": "https://www.axios.com/2025/01/19/donald-trump-crypto-billionaire"
  },
  {
    "text": "Biden Pardons Five More, Including Late Civil Rights Leader Marcus Garvey  —  Civil rights leaders and lawmakers have long said that Mr. Garvey's 1923 conviction for mail fraud was unjust, arguing that he was targeted for his work.  —  President Biden pardoned five activists and public servants on Sunday … ",
    "url": "https://www.nytimes.com/2025/01/19/us/politics/biden-pardons-marcus-garvey.html"
  },
  {
    "text": "Statement from President Joe Biden on Clemency Actions  —  America is a country built on the promise of second chances.  As President, I have used my clemency power to make that promise a reality by issuing more individual pardons and commutations than any other President in U.S. history.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2025/01/19/statement-from-president-joe-biden-on-clemency-actions-3/"
  },
  {
    "text": "A president's final days  —  As Biden leaves office, his term is ending where it began: Trump.  —  On a recent Tuesday morning, in a dim underground parking garage in west Los Angeles, President Joe Biden sat idly in his car, seemingly paralyzed by events.",
    "url": "https://www.politico.com/news/2025/01/19/inside-bidens-final-days-004594"
  },
  {
    "text": "Live Updates: First Hostages Return to Israel as Gaza Cease-Fire Takes Hold  —  The initial stage of a truce between Israel and Hamas prompted celebrations in Gaza and hope for an end to the 15-month war.  Three women were the first Israeli hostages to be released.",
    "url": "https://www.nytimes.com/live/2025/01/19/world/israel-hamas-gaza-ceasefire"
  },
  {
    "text": "‘Lady McBiden’: Alexandra Pelosi Blasts the First Lady  —  The feud between the president and ex-speaker intensifies in the waning days of his presidency.  —  Since breaking her hip in Europe last month, Speaker Emerita Nancy Pelosi has been deluged with messages, flowers and calls of concern … ",
    "url": "https://www.politico.com/news/magazine/2025/01/19/lady-mcbiden-alexandra-pelosi-first-lady-00199164"
  },
  {
    "text": "National Guard troops worry Trump will deploy them for mass deportations  —  “I don't want to be seen as a Gestapo,” one former senior military official said.  —  National Guard members fear landing in the center of a political tussle between red state governors and blue state attorneys general … ",
    "url": "https://www.politico.com/news/2025/01/19/trump-national-guard-mass-deporations-fears-00199063"
  },
  {
    "text": "Schools Using AI Emulation of Anne Frank That Urges Kids Not to Blame Anyone for Holocaust  —  The Anne Frank Experience  —  You're probably familiar with Anne Frank, a European Jewish girl whose posthumously-published diary documents her time hiding from Nazi persecution … ",
    "url": "https://futurism.com/the-byte/ai-anne-frank-blame-holocaust"
  },
  {
    "text": "Bannon: Billionaire CEOs have surrendered to Trump  —  Ex-Trump adviser Steve Bannon said he sees the presence of billionaire CEOs and tech moguls at President-elect Trump's inaugural events as a white flag of surrender from “the oligarchs.” … - “I will have Elon Musk run out of here by Inauguration Day … ",
    "url": "https://www.axios.com/2025/01/19/steve-bannon-trump-zuckerberg-inauguration"
  },
  {
    "text": "Texas Has a Perverse Idea of Religious Freedom  —  The Supreme Court of Texas just heard oral argument in a case challenging a remarkably punitive and malicious attack on religious liberty by the state of Texas.  That attack isn't just dangerous on its own terms, it's also a potential preview … ",
    "url": "https://www.nytimes.com/2025/01/19/opinion/texas-catholic-immigration-paxton.html"
  },
  {
    "text": "Trump Triggers a Crisis in Denmark—And Europe  —  What a single phone call from the president-elect did to an unswerving American ally  —  What did Donald Trump say over the phone to Mette Frederiksen, the Danish prime minister, on Wednesday?  I don't know which precise words he used, but I witnessed their impact.",
    "url": "https://www.theatlantic.com/international/archive/2025/01/trump-greenland-crisis-denmark-europe/681371/?gift=hVZeG3M9DnxL4CekrWGK3-Fo9dEMl2OnGCN0ZRdSEeg&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "‘Reactionary nihilism’: how a rightwing movement strives to end US democracy  —  Money, Lies, and God exposes a Christian nationalist movement funded by the super-rich seeking to secure their wealth at the expense of others  —  There is a “real and very, very present” threat to the US … ",
    "url": "https://www.theguardian.com/us-news/2025/jan/19/katherine-stewart-money-lies-god-book-christian-nationlism"
  },
  {
    "text": "A Trump Oligarchy Is Moving to Washington, and Buying Up Prime Addresses  —  Billionaires and multimillionaires are flocking to a city where power has been more important than money, but is now deeply intertwined with it.  —  President Biden warned in his farewell address to the nation … ",
    "url": "https://www.nytimes.com/2025/01/19/us/politics/trump-billionaires-washington-homes.html"
  },
  {
    "text": "Trump ally says first 100 days will be “shock and awe”  —  Four years ago, Donald and Melania Trump bid farewell.  Many in both parties believed Trump was heading into a permanent political winter, especially after he sought to overturn the 2020 election, and a mob of his supporters attacked the Capitol.",
    "url": "https://www.cbsnews.com/news/trump-ally-says-first-100-days-will-be-shock-and-awe/"
  },
  {
    "text": "Ramaswamy's future at DOGE is in doubt as he prepares to announce bid for Ohio governor  —  He's set to work with Elon Musk at the unofficial Department of Government Efficiency.  —  Vivek Ramaswamy could withdraw from working with the Department of Government Efficiency ahead of his bid for Ohio governor … ",
    "url": "https://www.politico.com/news/2025/01/19/ramaswamys-future-at-doge-is-in-doubt-as-he-prepares-to-announce-bid-for-ohio-governor-00199173"
  },
  {
    "text": "Exclusive: German ambassador warns of Trump plan to redefine constitutional order, document shows  —  Germany's ambassador to the United States has warned that the incoming Trump administration will rob U.S. law enforcement and the media of their independence and hand big tech companies … ",
    "url": "https://www.reuters.com/world/us/german-ambassador-warns-trump-plan-redefine-constitutional-order-document-shows-2025-01-18/"
  }
]