[
  {
    "text": "Trump pauses Canada, Mexico auto tariffs  —  “We spoke with the big three auto dealers,” White House spokesperson Karoline Leavitt told reporters.  “We are going to give a one-month exemption on any autos coming through [the U.S.-Mexico-Canada Agreement.”  —  President Donald Trump has decided … ",
    "url": "https://www.politico.com/news/2025/03/05/trump-auto-tariffs-pause-canada-mexico-00213949"
  },
  {
    "text": "The Trump Depression  —  Donald Trump is on track to be the first president to deliberately engineer a severe depression.  —  Financial news is displayed as people work on the floor at the New York Stock Exchange in New York, March 4, 2025.  —  In assessing how past presidents dealt … ",
    "url": "https://prospect.org/economy/2025-03-05-trump-depression/"
  },
  {
    "text": "Supreme Court rejects Trump administration's bid to avoid paying USAID contractors  —  The Trump administration's efforts to effectively dismantle the foreign aid agency led contractors to file suit claiming they are owed money.  —  WASHINGTON — The Supreme Court on Wednesday endorsed … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-rejects-trump-administrations-bid-avoid-paying-usaid-con-rcna194230"
  },
  {
    "text": "Supreme Court rejects Trump's request to keep billions in foreign aid frozen  —  A divided Supreme Court on Wednesday rejected the Trump administration's request to keep billions of dollars in foreign aid approved by Congress frozen.  —  However, the court did not immediately say when the money must … ",
    "url": "https://www.cnn.com/2025/03/05/politics/supreme-court-usaid-foreign-aid/"
  },
  {
    "text": "Trump Administration Live Updates: Supreme Court Denies Bid to Freeze Nearly $2 Billion in Foreign Aid  —  Where Things Stand:  — Foreign aid ruling: The Supreme Court rejected President Trump's emergency request to freeze nearly $2 billion in foreign aid on Wednesday morning … ",
    "url": "https://www.nytimes.com/live/2025/03/05/us/trump-news"
  },
  {
    "text": "Trump administration plans to cut 80,000 employees from Veterans Affairs, according to internal memo  —  The Department of Veterans Affairs is planning an “aggressive” reorganization that includes cutting 80,000 jobs from the sprawling agency that provides health care for retired military members … ",
    "url": "https://apnews.com/article/veterans-affairs-cuts-doge-musk-trump-f587a6bc3db6a460e9c357592e165712"
  },
  {
    "text": "USDA employees fired en masse by Trump administration reinstated, workers' board says  —  A workers' board is reinstating - at least temporarily - almost 6,000 fired probationary workers from the Department of Agriculture, according to a newly issued order obtained by CNN.",
    "url": "https://www.cnn.com/2025/03/05/politics/usda-employees-fired-reinstatement/"
  },
  {
    "text": "Sylvester Turner, Sworn In as U.S. Representative in January, Dies at 70  —  A former mayor of Houston, he was in attendance at the president's speech on Tuesday night but was later taken to a hospital.  —  Sylvester Turner, a former mayor of Houston who was sworn in as a U.S. representative in January … ",
    "url": "https://www.nytimes.com/2025/03/05/us/politics/sylvester-turner-dead.html"
  },
  {
    "text": "Let's Be Honest About The State Of The Union  —  It wasn't necessary to watch all of Trump's speech last night to understand where we are as a country.  The state of our union, as I noted Sunday night, is compromised.  And that comes as no surprise to any of us.",
    "url": "https://joycevance.substack.com/p/lets-be-honest-about-the-state-of"
  },
  {
    "text": "The American Century is Over  —  President in Name Only Donald Trump delivered remarks to a joint session of Congress typical of him—overstuffed, narcissistic, mean-spirited, and deeply dishonest.  And boring—not to mention interminable.  Some (smart) Democrats chose not to attend … ",
    "url": "https://contrarian.substack.com/p/the-american-century-is-over"
  },
  {
    "text": "The Simple Explanation for Why Trump Turned Against Ukraine  —  Donald Trump's highly public schism with Volodymyr Zelensky has yielded the kind of doublethink that is common in personality cults.  Those believers who approve of the policy hail the great leader's strategic genius.",
    "url": "https://www.theatlantic.com/politics/archive/2025/03/republican-theories-foreign-policy/681921/"
  },
  {
    "text": "U.S. Suspends Costly Deportation Flights Using Military Aircraft  —  Trump administration had used C-17s to fly migrants abroad and to Guantanamo Bay  —  The Trump administration has stopped using military aircraft to fly migrants who entered the U.S. illegally to Guantanamo Bay or other countries, defense officials said.",
    "url": "https://www.wsj.com/politics/national-security/trump-deportation-flights-paused-cost-c37c577a?st=Gbg8UE"
  },
  {
    "text": "Poll on Trump's 2025 joint address to Congress finds large majority of viewers approve  —  A large majority of speech watchers approved of what they heard from President Trump's joint address to Congress Tuesday night.  —  The viewership was heavily Republican — historically a president's party draws more of their own partisans.",
    "url": "https://www.cbsnews.com/news/trump-speech-joint-address-congress-poll-2025/"
  },
  {
    "text": "Trump's Rage Over “Low” Deportations Suddenly Gets More Unnerving  —  For weeks now, President Donald Trump's propagandists have relentlessly glorified his mass-deportations, even posting images of defeated-looking migrants getting frog-marched onto shiny military planes.",
    "url": "https://newrepublic.com/article/192318/trump-immigrant-deportations-low-rage-unnerving"
  },
  {
    "text": "US cuts off intelligence sharing with Ukraine  —  Fresh blow to embattled government in Kyiv as Trump administration shifts on conflict  —  The US has cut off intelligence-sharing with Kyiv in a move that could seriously hamper the Ukrainian military's ability to target Russian forces, according to officials familiar with the matter.",
    "url": "https://www.ft.com/content/c58fccea-00c4-4fad-bc0a-0185b7415579"
  },
  {
    "text": "Fact-checking 26 suspect claims in Trump's address to Congress  —  President makes false claims about border crossings, regulations, the economy, inflation and many other issues  —  President Donald Trump's address to a joint session of Congress on Tuesday was vintage Trump: long … ",
    "url": "https://www.washingtonpost.com/politics/2025/03/05/fact-check-trump-speech-address-congress/"
  },
  {
    "text": "Exclusive: U.S. holding secret talks with Hamas … - While the Trump administration consulted with Israel about the possibility of engaging with Hamas, Israel learned about aspects of the talks through other channels, one source said.  — The sources spoke with Axios on the condition … ",
    "url": "https://www.axios.com/2025/03/05/us-hamas-talks-gaza-war-israel"
  },
  {
    "text": "Panama Leader Accuses Trump of Lying to Congress Over Canal  — Mulino reiterates that Panama won't return the canal to US  — Panama bonds rallied on news of Hutchison, BlackRock port deal  —  Panama's president accused Donald Trump of lying to Congress after the US leader reiterated his intention to take over the Panama Canal.",
    "url": "https://www.bloomberg.com/news/articles/2025-03-05/panama-s-president-accuses-trump-of-lying-to-congress-over-canal"
  },
  {
    "text": "How Elon Musk Muscled His Way Into the FAA  —  The billionaire overseeing a wide-ranging government efficiency effort is offering his own SpaceX technology as the future of flight-safety inside the Federal Aviation Administration  —  Two weeks ago, SpaceX engineer Ted Malaska showed … ",
    "url": "https://www.bloomberg.com/news/features/2025-03-05/after-elon-musk-lands-at-faa-his-starlink-business-stands-to-gain-business?accessToken=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzb3VyY2UiOiJTdWJzY3JpYmVyR2lmdGVkQXJ0aWNsZSIsImlhdCI6MTc0MTE4MzcwMywiZXhwIjoxNzQxNzg4NTAzLCJhcnRpY2xlSWQiOiJTU05EODBUMEFGQjUwMCIsImJjb25uZWN0SWQiOiIyQjE3NzFFOTlEODc0QzRDOTY1Njg1RTZBQkJGM0QwRCJ9.TDRlodRA_4vXOGL7ETxW9z4EWut0hVv9bnCs7SkMsNY"
  },
  {
    "text": "Exclusive: Judges face rise in threats as Musk blasts them over rulings  —  U.S. Marshals have warned federal judges of unusually high threat levels as tech billionaire Elon Musk and other Trump administration allies ramp up efforts to discredit judges who stand in the way of White House efforts … ",
    "url": "https://www.reuters.com/world/us/judges-face-rise-threats-musk-blasts-them-over-rulings-2025-03-05/"
  },
  {
    "text": "Ted Cruz's Commerce Committee devolves over migrant-related subpoena  —  Members of the Senate Commerce Committee, led by Sen. Ted Cruz, clashed in a rancorous hearing Wednesday morning over the GOP's push to subpoena documents from the Massachusetts Port Authority related to its sheltering of migrants in Boston Logan Airport.",
    "url": "https://www.politico.com/live-updates/2025/03/05/congress/ted-cruz-commerce-committee-migration-00213199"
  },
  {
    "text": "A 40-day Target boycott starts today.  It couldn't come at a worse time for the company  —  New York CNN  —  Target is facing a 40-day consumer boycott starting Wednesday over the company's shift away from diversity, equity and inclusion (DEI) policies.",
    "url": "https://www.cnn.com/2025/03/05/business/target-boycott-jamal-bryant/"
  },
  {
    "text": "Trump Promised Retribution.  Turns Out He Had a Very Big Target in Mind.  —  Donald Trump rambled, ranted and raved his way through the 2024 presidential campaign, but he was clear on one point.  When he was elected, he would get revenge.  —  “I am your retribution,” Trump said to crowds of his supporters throughout the campaign.",
    "url": "https://www.nytimes.com/2025/03/05/opinion/trump-revenge-american-people.html?unlocked_article_code=1.1k4.tMFy.S4Y0L8lOygBN&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Disney to Cut Nearly 6% of Staff Across ABC News, Disney Entertainment Networks  —  The layoffs are being announced to employees as early as Wednesday  —  About 200 employees are being let go at Disney's ABC News Group and Disney Entertainment Networks unit, people familiar with the matter said.",
    "url": "https://www.wsj.com/business/media/disney-to-cut-nearly-6-staff-across-abc-news-disney-entertainment-networks-8af04b40?st=p8GQQr&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Mayor Adams' Job Approval Rating Drops To All-Time Low Of 20%, Quinnipiac University New York City Poll Finds; 56% Of Voters Say Adams Should Resign From Office  —  mail_outline  —  As New York City Mayor Eric Adams faces legal uncertainty over federal corruption charges, as well as a re-election bid … ",
    "url": "https://poll.qu.edu/poll-release?releaseid=3920"
  }
]