[
  {
    "text": "Trump is suddenly in need of a lot of cash.  That's everyone's problem.  —  The former president was just ordered to pay $355 million in his New York fraud case, bringing the tally this year to nearly half a billion dollars in civil damages.  —  Two recent verdicts have now left Donald Trump … ",
    "url": "https://www.vox.com/24073920/trump-financial-new-york-trouble-fraud-e-jean-carroll-civil-suit-damages-debt"
  },
  {
    "text": "Trump Ordered to Pay $355 Million and Barred From New York Business  —  The ruling in Donald J. Trump's civil fraud case could cost him all his available cash.  The judge said that the former president's “complete lack of contrition” bordered on pathological.",
    "url": "https://www.nytimes.com/2024/02/16/nyregion/trump-civil-fraud-trial-ruling.html"
  },
  {
    "text": "Trump and His Family Are Fined $355 Million for Fraud—and a Lack of Remorse That “Borders on Pathological”  —  The ruling, if upheld, marks the end of the Trump Organization as we know it.  —  New York Supreme Court Justice Arthur Engoron ordered Donald Trump to pay $355 million in fines … ",
    "url": "https://slate.com/news-and-politics/2024/02/donald-trump-civil-fraud-355-million-new-york-restrictions-trump-organization.html"
  },
  {
    "text": "For Donald Trump, the Recriminations Will Be Televised  —  The former president's trials aren't being aired.  That isn't stopping him from turning them into a political reality show.  —  The civil-fraud case against Donald J. Trump's businesses in New York, in which he was ordered to pay a penalty of $355 million, was not televised.",
    "url": "https://www.nytimes.com/2024/02/17/arts/television/donald-trump-trials.html"
  },
  {
    "text": "Zelenskiy Invites Trump to Observe ‘Real War’ at Frontlines  — Former president has questioned US commitment to NATO alliance  — Ukrainian leader in Germany at Munich Security Conference  —  Ukrainian President Volodymyr Zelenskiy invited Donald Trump to travel with him to the frontlines … ",
    "url": "https://www.bloomberg.com/news/articles/2024-02-17/zelenskiy-invites-trump-to-experience-real-war-at-frontlines"
  },
  {
    "text": "Trump's legal debts top a half-billion dollars.  Will he have to pay?  —  A New York judge has ordered Donald Trump and his companies to pay $355 million.  The judge found they engaged in a years-long scheme to dupe banks and others with financial statements that inflated his wealth.  (Feb. 16)",
    "url": "https://apnews.com/article/trump-fraud-carroll-fines-82d423b8e7a7f9a32470729c5f4410e5"
  },
  {
    "text": "'I Have to Say Goodbye.  But I Don't Want to Go to Jail.'  —  One of Navalny's closest friends mourns his death, and Russia's future.  —  Alexei Navalny didn't want to be a martyr.  What he wanted, according to Yevgenia Albats, one of his closest friends, was to lead his country.",
    "url": "https://www.politico.com/news/magazine/2024/02/17/alexei-navalny-death-russia-putin-00142002"
  },
  {
    "text": "The majority of traffic from Elon Musk's X may have been fake during the Super Bowl, report suggests  —  These numbers are legitimately shocking. … Also riding high from the big game?  Elon Musk's X. The company formerly known as Twitter published its own press release … ",
    "url": "https://mashable.com/article/x-twitter-elon-musk-bots-fake-traffic"
  },
  {
    "text": "Ex-FBI official sentenced to over two years for hiding payment from Albanian businessman  —  WASHINGTON - A former top FBI counterintelligence official was sentenced on Friday to 28 months in prison for concealing at least $225,000 he took from an Albanian businessperson with ties to the Albanian government.",
    "url": "https://www.usatoday.com/story/news/politics/2024/02/17/charles-mcgonigal-fbi-official-albania/72640427007/"
  },
  {
    "text": "Retired FBI Special Agent in Charge Sentenced for Concealing Information from the FBI  —  For Immediate Release  —  Charles F. McGonigal Admitted to Receiving $225,000 Cash Payment  —  Charles F. McGonigal, 55, a former FBI Special Agent in Charge of the New York Field Office … ",
    "url": "https://www.justice.gov/opa/pr/retired-fbi-special-agent-charge-sentenced-concealing-information-fbi"
  },
  {
    "text": "Justice Department Transfers Approximately $500,000 in Forfeited Russian Funds to Estonia for Benefit of Ukraine  —  For Immediate Release  —  Estonia to Support Ukraine Using Funds Forfeited by United States After Interception of Sophisticated Military-Grade Machinery Bound for Russia; Defendant in Scheme Separately Pleads Guilty",
    "url": "https://www.justice.gov/opa/pr/justice-department-transfers-approximately-500000-forfeited-russian-funds-estonia-benefit"
  },
  {
    "text": "GOP suffers ‘most spectacular embarrassment imaginable’ in anti-Biden case  —  The GOP's impeachment crusade against Joe Biden will continue, even after their star witness was charged with lying to the FBI, but it really shouldn't.  —  It's not exactly a secret that the impeachment crusade … ",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/gop-suffers-spectacular-embarrassment-imaginable-anti-biden-case-rcna139159"
  },
  {
    "text": "GOP House chair: Johnson has no way out of Ukraine floor vote  —  The GOP chair of the House Foreign Affairs Committee was bullish Friday on the chamber delivering U.S. military assistance to Ukraine, Israel and Taiwan, despite the “brainwashing” of some within his caucus who oppose foreign spending … ",
    "url": "https://thehill.com/homenews/house/4473343-mccaul-johnson-ukraine-aid-floor-vote/"
  },
  {
    "text": "Trump campaign scrambles over abortion ban report as Democrats seize the moment  —  The Trump campaign said it was “fake news” that he supports a 16-week abortion ban, as Democrats were quick to hit him on it.  —  WASHINGTON — President Joe Biden's campaign and abortion rights advocates ripped … ",
    "url": "https://www.nbcnews.com/politics/2024-election/trump-campaign-scrambles-abortion-ban-report-democrats-16-weeks-rcna139223"
  },
  {
    "text": "U.S. Plans to Send Weapons to Israel Amid Biden Push for Cease-Fire Deal  —  Delivery would include bombs, precision-guidance kits and bomb fuses  —  ISTANBUL—The Biden administration is preparing to send bombs and other weapons to Israel that would add to its military arsenal … ",
    "url": "https://www.wsj.com/world/middle-east/u-s-plans-to-send-weapons-to-israel-amid-biden-push-for-cease-fire-deal-184e75bc?mod=politics_whatsnews_pos3"
  },
  {
    "text": "Wisconsin fake elector tells ‘60 Minutes’ he was afraid of Trump supporters  —  MADISON - The former chairman of the Wisconsin Republican Party in a new interview claims he sent Congress paperwork he signed posing as an elector for Donald Trump following the former president's 2020 election loss … ",
    "url": "https://www.jsonline.com/story/news/politics/2024/02/16/wisconsin-fake-elector-tells-60-minutes-he-feared-trump-supporters/72617180007/"
  },
  {
    "text": "I've reported on the health of every president since Reagan.  Here's what I think about Trump and Biden  —  When I interviewed Ronald Reagan about his health in 1980, he was 69 and poised to become the oldest person to be elected president.  During our conversation, Reagan was mentally sharp.",
    "url": "https://www.statnews.com/2024/02/16/trump-biden-dementia-cognitive-health-lawrence-altman-presidential-history/"
  },
  {
    "text": "House bipartisan group unveils $66 billion foreign aid bill … - The bill also blocks the use of federal funds to transfer migrants between detention centers or other locations unless it is for adjudicating their immigration case.  — It would also implement a Trump-era policy … ",
    "url": "https://www.axios.com/2024/02/16/house-foreign-aid-bill-ukraine-israel-border"
  }
]