[
  {
    "text": "Trump suggests he's open to revoking access to abortion pill  —  The former president has previously praised a Supreme Court ruling that maintained access to the key abortion drug mifepristone.  —  Donald Trump suggested in a news conference Thursday that he is open to curbing access … ",
    "url": "https://www.washingtonpost.com/politics/2024/08/08/trump-abortion-pill-mifepristone-news-conference/"
  },
  {
    "text": "Trump and Harris have agreed to a Sept. 10 presidential debate on ABC, network says  —  ABC says both Donald Trump and Kamala Harris have agreed to a Sept. 10 presidential debate, setting up a face-off between the Republican and Democratic nominees.  The announcement Thursday came shortly … ",
    "url": "https://www.pbs.org/newshour/politics/trump-and-harris-have-agreed-to-a-sept-10-presidential-debate-on-abc-network-says"
  },
  {
    "text": "Trump Tries to Wrestle Back Attention at Mar-a-Lago News Conference  —  In an hourlong exchange with reporters, the former president criticized Vice President Kamala Harris for not doing the same, insulted her intelligence and boasted about the size of his rallies.",
    "url": "https://www.nytimes.com/2024/08/08/us/politics/trump-press-conference-mar-a-lago.html"
  },
  {
    "text": "RFK Jr. and the third-party effect are now hurting Trump  —  The dynamic has shifted with Kamala Harris atop the Democratic ticket.  And Robert F. Kennedy Jr. — once elevated by Trump allies — is looking more like a significant liability for the GOP nominee.",
    "url": "https://www.washingtonpost.com/politics/2024/08/08/rfk-jr-third-party-effect-are-now-hurting-trump/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzIzMDg5NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI0NDcxOTk5LCJpYXQiOjE3MjMwODk2MDAsImp0aSI6ImU0ZDRjYTBkLTJiODAtNDU4Ni1hZjI5LTc5NDAwMTFiYjM0OCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzA4LzA4L3Jmay1qci10aGlyZC1wYXJ0eS1lZmZlY3QtYXJlLW5vdy1odXJ0aW5nLXRydW1wLyJ9.0YdhLfkfKPWnotmkxkG6nhB8ipcUZuK0YtCGtk4F_GA&itid=gfta"
  },
  {
    "text": "Trump lashes out at Harris and falsely claims no one was killed on January 6  —  Former president attacks Democratic rival in rambling press conference and complains media is favoring her  —  Struggling in the polls and charged with running a lackluster presidential campaign … ",
    "url": "https://www.theguardian.com/us-news/article/2024/aug/08/trump-january-6-lies-kamala-harris-attacks"
  },
  {
    "text": "Harris campaign tweaks Walz biography amid scrutiny of military credentials  —  The update comes a day after Republicans escalated attacks on his record in the Army National Guard, accusing Walz of inflating his rank at retirement.  —  Kamala Harris' presidential campaign updated … ",
    "url": "https://www.politico.com/news/2024/08/08/harris-walz-military-credentials-00173236"
  },
  {
    "text": "Tim Walz's military record, National Guard departure get new scrutiny  —  The Harris-Walz campaign has cited his Army experience as an asset.  But Republicans and some who served with him have questioned claims about his service.  —  Tim Walz was weighing a life-altering decision when he stepped … ",
    "url": "https://www.washingtonpost.com/elections/2024/08/07/tim-walz-military-record/"
  },
  {
    "text": "Why Harris isn't taking questions  —  Welcome to POLITICO's West Wing Playbook, your guide to the people and power centers in the Biden administration.  —  There is a line in the movie “Bull Durham” where CRASH DAVIS, the sage journeyman catcher played by KEVIN COSTNER, tells “NUKE” LaLOOSH … ",
    "url": "https://www.politico.com/newsletters/west-wing-playbook/2024/08/07/why-harris-isnt-taking-questions-00173115"
  },
  {
    "text": "What Walz — and the records — say about his military service as others criticized it  —  ListenWhat Walz — and the records — say about his military service as others criticized it  —  In 1981, Tim Walz and his father traveled to the nearest Army National Guard enlistment officer to his hometown in Nebraska.",
    "url": "https://www.mprnews.org/story/2024/08/08/what-walz-has-said-about-his-military-record-as-others-criticized-it"
  },
  {
    "text": "Harris leads Trump by 5 points in Ipsos poll  —  Democrat Kamala Harris leads Republican Donald Trump 42% to 37% in the race for the Nov. 5 U.S. presidential election, according to an Ipsos poll published on Thursday.  —  The poll found Harris had widened her lead since a July 22-23 Reuters/Ipsos survey … ",
    "url": "https://www.reuters.com/world/us/harris-leads-trump-by-5-points-ipsos-poll-2024-08-08/"
  },
  {
    "text": "New Marquette Law School Poll national survey finds Harris leading Trump and outperforming Biden against Trump; enthusiasm to vote among Democrats having risen substantially  —  MILWAUKEE - A new Marquette Law School Poll national survey finds Vice President Kamala Harris is the choice … ",
    "url": "https://law.marquette.edu/poll/2024/08/07/mlspsc21-release/"
  },
  {
    "text": "Elon Musk's X Sued an Advertising Coalition.  Now It's Shutting Down.  —  The Global Alliance for Responsible Media will dissolve after Mr. Musk accused the group of orchestrating a boycott.  —  An influential advertising industry group said it would shut down after being sued this week by X … ",
    "url": "https://www.nytimes.com/2024/08/08/technology/elon-musk-x-advertisers-boycott.html?unlocked_article_code=1.BU4.rEt4.gqvdfhrYvbQ6&smid=url-share"
  },
  {
    "text": "The Global Alliance for Responsible Media is ‘discontinuing’ after Elon Musk's X filed an antitrust lawsuit against it  — The World Federation of Advertisers is ‘discontinuing’ the activities of the Global Alliance for Responsible Media.  — The decision follows an antitrust lawsuit filed … ",
    "url": "https://www.businessinsider.com/ad-group-to-suspend-garm-initiative-following-elon-musk-lawsuit-2024-8"
  },
  {
    "text": "Tim Walz's normal dad energy is causing MAGA to come unglued  —  Walz is the opposite of weird: Kamala Harris' running mate shows masculinity can be about love and not hate  —  In their first go-round in attacking Gov. Tim Walz, the Donald Trump campaign bet that maximum hyperbole … ",
    "url": "https://www.salon.com/2024/08/08/tim-walzs-normal-energy-is-causing-maga-to-come-unglued/"
  },
  {
    "text": "Trump won't say how he'll vote on Florida abortion amendment  —  The former president also predicted the vote for the amendment would end up in a more “liberal way” than anticipated.  —  MIAMI — Former President Donald Trump wouldn't say Thursday how he'll vote on a proposed Florida state … ",
    "url": "https://www.politico.com/news/2024/08/08/trump-vote-florida-abortion-amendment-00173279"
  },
  {
    "text": "Nancy Pelosi's Art of Power  —  The former Speaker discusses how she hastened Joe Biden's decision to drop out, her new memoir, and not getting “doggy doo-doo on your shoe.”  —  Nancy Pelosi likes to say that she went from “housewife to House member to House Speaker.”",
    "url": "https://www.newyorker.com/news/daily-comment/nancy-pelosis-art-of-power"
  },
  {
    "text": "Powerful former North Dakota lawmaker pleads guilty to traveling to Europe to pay for sex with minor  —  Ray Holmberg, 80, of Grand Forks, served more than 45 years in the North Dakota Senate.  He was indicted for travel with intent to engage in illicit sexual activity.",
    "url": "https://www.nbcnews.com/politics/politics-news/north-dakota-lawmaker-pleads-guilty-traveling-europe-pay-sex-minor-rcna165882"
  },
  {
    "text": "Get Ready Now: Republicans Will Refuse to Certify a Harris Win  —  Some darkness in honor of JVL.  It's important stuff.  —A.B. Stoddard  —  1. Trump's Not Taking the L. . .  The last two weeks—the unveiling of the Harris-Walz ticket, and Kamala Harris's surge in the polls—feels like some surreal dream state.",
    "url": "https://www.thebulwark.com/p/republicans-will-refuse-certify-harris-election"
  }
]