[
  {
    "text": "Kamala Harris is breaking Republican brains  —  MAGA lacks issues against her, so it brings up the silly and the slimy  —  The MAGA crowd doesn't like Kamala Harris because she's a strong Democratic woman and candidate of African and Asian descent.  —  Those aren't good or valid reasons to oppose her, of course.",
    "url": "https://www.stopthepresses.news/p/kamala-harris-is-breaking-republican"
  },
  {
    "text": "Top Dems threatened to forcibly remove Biden from office unless he dropped out, set him up to fail at Trump debate: Sources  —  Operatives at the very highest levels of the Democratic Party threatened Joe Biden with forcibly removing him from office unless he stepped down, sources told The Post.",
    "url": "https://nypost.com/2024/07/22/us-news/top-dems-threatened-to-remove-biden-unless-he-resigned/"
  },
  {
    "text": "Harris secures enough delegate endorsements to win the Democratic presidential nomination  —  Kamala Harris has the support of enough Democratic delegates to win the party's nomination for president, according to CNN's delegate estimate.  —  While endorsements from delegates continue to come in … ",
    "url": "https://www.cnn.com/2024/07/22/politics/kamala-harris-delegates-democratic-presidential-nomination/"
  },
  {
    "text": "2024 Race: Trump vs. Harris Too Close To Call, Trump Slightly Ahead In 6-Way Race, Quinnipiac University National Poll Finds; 62% Say Biden Dropping Out Of Race Right Thing To Do  —  mail_outline  —  One day after President Joe Biden dropped out of the 2024 presidential race … ",
    "url": "https://poll.qu.edu/poll-release?releaseid=3901"
  },
  {
    "text": "‘DEI,’ ‘Colored,’ ‘Jezebel’: MAGA Attacks on Kamala Harris Are Getting Ugly  —  The right right can barely contain its racist, sexist contempt for Biden's likely 2024 replacement  —  MAGA REPUBLICANS ARE subjecting Vice President Kamala Harris to a barrage of racist and sexist attacks … ",
    "url": "https://www.rollingstone.com/politics/politics-news/maga-republicans-racist-sexist-attacks-kamala-harris-1235065295/"
  },
  {
    "text": "GOP lawsuits over Kamala Harris using Biden campaign funds or headlining Democratic ballots will all fail, experts say  — Republicans may sue to stop Kamala Harris from taking Biden's campaign cash and place on the ballot.  — Such lawsuits are doomed at best — and at worst would be blatantly frivolous, legal experts told BI.",
    "url": "https://www.businessinsider.com/gop-lawsuits-kamala-harris-campaign-finance-ballot-election-will-fail-2024-7"
  },
  {
    "text": "Trump's New Rival May Bring Out His Harshest Instincts  —  After years planning to face President Biden, Donald J. Trump and his team will be campaigning against Kamala Harris.  He has attacked female rivals and critics in brutal and personal terms.  —  Donald J. Trump and his political team spent nearly … ",
    "url": "https://www.nytimes.com/2024/07/23/us/politics/trump-harris-attack-lines.html"
  },
  {
    "text": "Exclusive: Beyoncé gives Kamala Harris permission to use her song ‘Freedom’ for her presidential campaign  —  Vice President Kamala Harris made a big entrance during her first official visit to her campaign headquarters on Monday evening, walking out to Beyoncé's song “Freedom.”",
    "url": "https://www.cnn.com/2024/07/22/entertainment/beyonce-freedom-harris-campaign/"
  },
  {
    "text": "Biden cancels nine trips, extends Delaware stay after dropping out of 2024 race  —  President Biden has canceled nine trips that were scheduled for the next two weeks after suddenly dropping out of the 2024 race, The Post can reveal.  —  Biden was scheduled to leave Monday for the West Coast … ",
    "url": "https://nypost.com/2024/07/22/us-news/biden-cancels-nine-trips-extends-delaware-stay-after-dropping-out/"
  },
  {
    "text": "Harris into the whirlwind  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  Forty-eight hours ago, VP KAMALA HARRIS was focused on preparing for an upcoming debate with the Republican who wants her job.  This morning, she wakes up with enough delegate commitments … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/07/23/harris-into-the-whirlwind-00170544"
  },
  {
    "text": "7/23/24 ☀️ AM:  —  GOP struggles to find its Harris message  —  Vulnerable Dems see chance for ‘reset’ with Biden out  —  Inside Johnson's assassination commission  —  GOP struggles to find its Harris message … House Republicans just got the rug pulled out from under them.",
    "url": "https://punchbowl.news/archive/72324-am/"
  },
  {
    "text": "Harris Clinches Majority of Delegates as She Closes In on Nomination  —  On her first full day in the race, Kamala Harris drew endorsements from her final possible rivals, hauled in record sums of cash and attacked Donald Trump.  —  Vice President Kamala Harris moved swiftly to assert herself … ",
    "url": "https://www.nytimes.com/2024/07/22/us/politics/kamala-harris-trump-2024-election.html?unlocked_article_code=1.9U0.mFuP.gX5WPTwrwgdE&smid=url-share"
  },
  {
    "text": "Top Sinclair anchor resigned over concerns about biased and inaccurate content  —  Eugene Ramirez, the lead anchor of Sinclair's national evening news broadcast, resigned in January over concerns about the accuracy and right-wing bias of the content he was required to present on air, three sources told Popular Information.",
    "url": "https://popular.info/p/top-sinclair-anchor-resigned-over"
  },
  {
    "text": "Judge dismisses Nina Jankowicz lawsuit against Fox News  —  A judge in Delaware tossed a lawsuit filed by Nina Jankowicz, the former head of the short-lived Department of Homeland Security (DHS) disinformation board, against Fox News.  —  The judge granted Fox's motion on Monday to have the case dismissed … ",
    "url": "https://thehill.com/homenews/media/4786974-jankowicz-fox-lawsuit-dismissed/"
  },
  {
    "text": "Trump and RFK Jr. Discussed Trading Admin. Position for Endorsement: Report  —  The conspiracy theorist may be exploring other options amid a stagnant campaign … According to a Monday report from The Washington Post, Kennedy discussed the possibility that he could end his campaign … ",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-rfk-jr-administration-position-endorsement-1235065173/"
  },
  {
    "text": "$30 million gift will fund center to push for Supreme Court overhaul  —  Private equity investor Jim Kohlberg will fund research, public outreach and policy advocacy on the Supreme Court, through the Brennan Center for Justice.  —  A business executive and philanthropist has pledged $30 million … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/23/brennan-supreme-court-ethics-center/"
  },
  {
    "text": "US asks Moscow to free jailed Russian-American journalist Kurmasheva  —  The U.S. Embassy in Moscow on Tuesday called on Russia to free Alsu Kurmasheva, a Russian-American journalist for U.S.-funded Radio Free Europe/Radio Liberty (RFE/RL) who was jailed last week in what RFE/RL said was “a mockery of justice.”",
    "url": "https://www.reuters.com/world/us-embassy-moscow-calls-russia-free-russian-american-journalist-kurmasheva-2024-07-23/"
  },
  {
    "text": "Exclusive: President Biden suffered an undisclosed medical emergency during his time in Las Vegas, police sources say  —  When President Joe Biden began his campaign trip in Las Vegas last week, everything seemed to be running as smoothly as it could for an 81-year-old president in physical and cognitive decline.",
    "url": "https://www.dossier.today/p/exclusive-president-biden-suffered"
  }
]