[
  {
    "text": "Mike Pence Says He Won't Endorse Donald Trump For President  —  This should come as “no surprise,” Trump's former vice president said.  —  Former Vice President Mike Pence confirmed Friday that he will not be endorsing Donald Trump for president.  —  “It should come as no surprise … ",
    "url": "https://www.huffpost.com/entry/mike-pence-not-endorsing-donald-trump-2024-election_n_65f4ab9de4b0b4d0b8995cbe"
  },
  {
    "text": "Pence says he ‘cannot in good conscience’ endorse Trump  —  Former Vice President Mike Pence on Friday said he “cannot in good conscience” endorse presumptive GOP nominee Donald Trump, arguing that Trump is pursuing an agenda that is “at odds with the conservative agenda.”",
    "url": "https://www.cnn.com/2024/03/15/politics/pence-will-not-endorse-trump/"
  },
  {
    "text": "Pence declines to endorse Trump, won't back Biden  —  Former Vice President Mike Pence has declined to endorse his onetime running mate, former President Trump, in a bombshell announcement Friday.  —  Pence, whose relationship soured with Trump after the January 6 riots wherein the president faulted … ",
    "url": "https://www.foxnews.com/media/pence-declines-to-endorse-trump-wont-back-biden"
  },
  {
    "text": "Trump aide Peter Navarro asks Supreme Court to keep him out of prison  —  A senior aide to former president Donald Trump asked the Supreme Court on Friday to keep him out of prison while he appeals his conviction for refusing to testify before Congress about his involvement in efforts to overturn the 2020 election.",
    "url": "https://www.washingtonpost.com/politics/2024/03/15/peter-navarro-supreme-court/"
  },
  {
    "text": "Judge delays Trump's hush-money criminal trial 30 days, citing last-minute evidence dump  —  NEW YORK (AP) — A judge on Friday delayed former President Donald Trump's hush-money criminal trial until at least mid-April after his lawyers said they needed more time to sift through a profusion … ",
    "url": "https://apnews.com/article/trump-hush-money-criminal-trial-delay-8e41f4be00f0420056433d2381189df8"
  },
  {
    "text": "Trump hush money trial delayed until at least April, judge rules  —  Donald Trump's criminal trial stemming from hush money paid to a porn star before the 2016 U.S. election will start no earlier than April after the judge on Friday granted a 30-day delay due to the late disclosure of evidence to the former president.",
    "url": "https://www.reuters.com/legal/trump-hush-money-trial-delayed-until-late-april-judge-rules-2024-03-15/"
  },
  {
    "text": "Nathan Wade resigns from Trump Georgia case following judge's ruling  —  ATLANTA — Either Fani Willis goes or Nathan Wade does - that was the ruling from Fulton County Superior Court Scott McAfee on Friday in the Georgia election interference case.  —  Channel 2 Action News confirms … ",
    "url": "https://www.wsbtv.com/news/local/atlanta/nathan-wade-resigns-trump-georgia-case-following-judges-ruling/MZV2BLXKW5GCBM6WLMMKILS67U/"
  },
  {
    "text": "Mike Johnson Suddenly Seems Ready to Stick a Shiv in MAGA  —  Poor Mike Johnson is in quite a bind.  The House speaker simply doesn't have a governing majority: It is borderline impossible to pass anything with only Republican votes, because the hard-right MAGA bloc wants to thwart governing at all costs.",
    "url": "https://newrepublic.com/article/179861/mike-johnson-ukraine-aid-bill-shiv-maga"
  },
  {
    "text": "Secret Service, Justice Dept locate person of interest in swatting attacks on DHS Secretary Mayorkas and other officials  —  Federal agents have located a person of interest in over 100 swatting calls, which included calls targeting  Homeland Security Secretary Alejandro Mayorkas … ",
    "url": "https://www.cbsnews.com/news/swatting-suspect-mayorkas-secret-service-justice-dept/"
  },
  {
    "text": "Ginsburg family blasts plan to give RBG Award to Musk, Murdoch, others  —  The family of the late Ruth Bader Ginsburg and some of the Supreme Court justice's former colleagues have denounced this year's slate of honorees for an award that a philanthropic foundation bestows in the name of the liberal icon.",
    "url": "https://www.washingtonpost.com/style/power/2024/03/15/ruth-bader-ginsburg-award-backlash/"
  },
  {
    "text": "2 Orange school board conservatives ousted by recalls with LGBTQ+ policies at the center  —  Voters in the city of Orange appear to have ousted two conservative school board members who had spearheaded policies widely opposed by advocates for LGBTQ+ youth in a recall election viewed … ",
    "url": "https://www.latimes.com/california/story/2024-03-15/orange-unified-school-board-members-who-embraced-culture-wars-are-ousted"
  },
  {
    "text": "How CrowdTangle predicted the future  —  Eight years after buying the data analysis tool CrowdTangle, and four years after it began exasperating the executives responsible for it, Meta said Thursday that it would shut down the tool on August 14.  —  CrowdTangle, a data analysis tool … ",
    "url": "https://www.platformer.news/meta-crowdtangle-shutdown-dsa-platform-transparency/"
  },
  {
    "text": "Leaked SpaceX documents show company forbids employees to sell stock if it deems they've misbehaved  —  ‘An act of dishonesty against the company’ is among the violations cited  —  SpaceX requires employees to agree to some unusual terms related to their stock awards, which have a chilling effect on staff … ",
    "url": "https://techcrunch.com/2024/03/15/spacex-employee-stock-sales-forbidden/"
  },
  {
    "text": "Security footage of Boeing repair before door-plug blowout was overwritten  —  NTSB: Boeing “unable to find the records documenting” repair work on 737 Max 9.  —  A government investigation into a Boeing 737 Max 9 plane's door-plug blowout has been hampered by a lack of repair records … ",
    "url": "https://arstechnica.com/tech-policy/2024/03/boeing-door-plug-probe-stalled-by-missing-records-overwritten-security-footage/"
  },
  {
    "text": "Kushner Developing Deals Overseas Even as His Father-in-Law Runs for President  —  Donald Trump's son-in-law, who was also a senior White House official, said he was close to finalizing real estate projects in Albania and Serbia.  —  Jared Kushner, the son-in-law of Donald J. Trump … ",
    "url": "https://www.nytimes.com/2024/03/15/us/politics/jared-kushner-pursuing-development-deals-in-albania-and-serbia.html"
  },
  {
    "text": "Supreme Court Narrowly Interprets Landmark Reduced Sentencing Law  —  The justices sided with the government in a case focused on who is eligible for shorter prison sentences under the bipartisan First Step Act passed in 2018.  —  The Supreme Court sided with the government on Friday … ",
    "url": "https://www.nytimes.com/2024/03/15/us/politics/supreme-court-sentencing-first-step-act.html"
  },
  {
    "text": "Lara Trump says she wants to hire QAnon conspiracy theorist Scott Presler to work for the RNC  —  Lara Trump, who was recently elected as co-chair to the Republican National Committee, said on March 14 that she is interested in hiring right-wing influencer, QAnon conspiracy theorist, and … ",
    "url": "https://www.mediamatters.org/lara-trump/lara-trump-says-she-wants-hire-qanon-conspiracy-theorist-scott-presler-work-rnc"
  },
  {
    "text": "‘We are losing our kids to a satanic cult,’ Sen. Tommy Tuberville warns during Utah campaign stop  —  The Alabama Republican has endorsed Republican U.S. Senate candidate Trent Staggs in the race to replace Utah Sen. Mitt Romney in Congress.  —  Alabama Republican U.S. Sen. Tommy Tuberville … ",
    "url": "https://www.sltrib.com/news/politics/2024/03/15/we-are-losing-our-kids-satanic/"
  },
  {
    "text": "GOP backtracks on closing community centers and sidetracking early-vote program  —  Officials said Friday that the shift in announced plans was a result of the fast pace of the takeover of the Republican National Committee at the start of the week  —  The Republican Party's new chairman … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/15/rnc-backtrack-cuts/"
  }
]