[
  {
    "text": "Biden Offers to Debate Trump, With Terms, Shunning the Debate Commission  —  The president wants two debates before early voting begins, with no crowds.  Donald Trump's camp has said it would debate “anytime and anywhere.”  —  President Biden is willing to debate former President Donald J. Trump … ",
    "url": "https://www.nytimes.com/2024/05/15/us/politics/biden-trump-debates.html"
  },
  {
    "text": "Biden proposes June and September faceoffs with Trump, who accepts dates  —  The president said he will not participate in the traditional televised showdowns organized by the Commission on Presidential Debates.  —  President Biden said Wednesday that he will not participate … ",
    "url": "https://www.washingtonpost.com/politics/2024/05/15/biden-trump-presidential-debates/"
  },
  {
    "text": "Biden and Trump accept CNN's invitation to debate on June 27  —  President Joe Biden and former President Donald Trump have both accepted an invitation from CNN to debate on June 27, a historically early showdown that will set the tone for the final months of the 2024 campaign.",
    "url": "https://www.cnn.com/2024/05/15/politics/joe-biden-debate/"
  },
  {
    "text": "Ron Klain, Former Chief of Staff, Will Return to Help Biden With Debate  —  Mr. Klain left the White House last year and became the chief legal officer at Airbnb.  He plans to take a vacation from his job to help President Biden prepare.  —  Ron Klain, the president's former chief of staff … ",
    "url": "https://www.nytimes.com/2024/05/15/us/politics/ron-klain-biden-trump-debate.html"
  },
  {
    "text": "Biden prods Trump to accept invite for June 27 presidential debate on CNN … - “Over to you, Donald. … - Biden's campaign offered to debate Trump twice in one-on-one settings, well before most early voting has concluded.  — “Trump lost two debates to me in 2020.",
    "url": "https://www.axios.com/2024/05/15/biden-trump-june-presidential-debate"
  },
  {
    "text": "A GOP Texas school board member campaigned against schools indoctrinating kids.  Then she read the curriculum.  —  Courtney Gore, a Granbury ISD school board member, has disavowed the far-right platform she campaigned on.  Her defiance has brought her backlash.",
    "url": "https://www.texastribune.org/2024/05/15/texas-granbury-isd-school-board-courtney-gore/"
  },
  {
    "text": "Former far-right hard-liner says pro-voucher billionaires are using school board races to sow distrust in public education  —  The largesse from billionaires Tim Dunn and brothers Farris and Dan Wilks has made its way into local politics.  Courtney Gore, a Republican school board member in Granbury … ",
    "url": "https://www.texastribune.org/2024/05/15/texas-tim-dunn-wilks-brothers-vouchers-courtney-gore/"
  },
  {
    "text": "‘Embarrassing’: Mitt Romney hits his fellow Republicans for traveling to Donald Trump's hush money trial  —  The parade of GOP leaders appearing outside the New York City courthouse where former President Donald Trump is on trial is “a little embarrassing,” Sen. Mitt Romney, R-Utah, said Wednesday.",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/05/15/mitt-romney-donald-trump-court/73699111007/"
  },
  {
    "text": "Is Trump orchestrating a new criminal conspiracy?  —  In recent days, several high-profile Republican political figures have traveled to the Manhattan Criminal Court, where Donald Trump is on trial.  Outside the courthouse, they addressed the media and attacked key witnesses, the jury, and even the judge's daughter.",
    "url": "https://popular.info/p/is-trump-orchestrating-a-new-criminal"
  },
  {
    "text": "Trump said men would see his mistreatment of Stormy Daniels as “cool.”  His trial suggests otherwise  —  Stormy Daniels is just the latest woman to note Trump uses coercion because he's incapable of persuasion  —  Despite all the press hand-wringing about Michael Cohen's so-called credibility issues … ",
    "url": "https://www.salon.com/2024/05/15/said-men-would-see-his-mistreatment-of-stormy-daniels-as-cool-his-trial-suggests-otherwise/"
  },
  {
    "text": "17% of Voters Blame Biden for the End of Roe  —  The mistaken belief, in a new poll, shows how even as abortion is mobilizing Democrats, confusion over the issue is also a challenge.  —  Nearly one in five voters in battleground states says that President Biden is responsible for ending … ",
    "url": "https://www.nytimes.com/2024/05/15/upshot/abortion-biden-trump-blame.html"
  },
  {
    "text": "Warning signs for Trump: 5 takeaways from Tuesday's primaries  —  Nikki Haley's zombie presidential candidacy is still drawing a sizable slice of the Republican vote in the suburbs.  —  Donald Trump showed weakness in the suburbs in Tuesday's primaries, while Joe Biden's problem with the protest vote appeared to fade.",
    "url": "https://www.politico.com/news/2024/05/15/maryland-nebraska-west-virginia-primaries-takeaways-00158068"
  },
  {
    "text": "And then there were two: Seventh Native American tribe bans Gov. Noem  —  The Crow Creek Sioux Tribe in central South Dakota has joined six of the state's tribes in preventing Gov. Kristi Noem from coming onto their tribal land, leaving the governor just two reservations she can still travel to.",
    "url": "https://www.thedakotascout.com/p/and-then-there-were-two-seventh-native"
  },
  {
    "text": "Russian Disinformation Videos Smear Biden Ahead of U.S. Election  —  Many of the videos are trying to appeal to right-wing voters with fake messages about President Biden, experts say.  —  Last month, a video began circulating on social media purporting to tell the story of an internet troll farm … ",
    "url": "https://www.nytimes.com/2024/05/15/us/politics/russia-disinformation-election.html"
  },
  {
    "text": "Revealed: Magician David Copperfield accused of sexual misconduct by multiple women  —  A total of 16 women have accused Copperfield of sexual misconduct and inappropriate behavior spanning decades.  More than half said they were teenagers at the time.  Copperfield's lawyers say the allegations … ",
    "url": "https://www.theguardian.com/us-news/article/2024/may/15/david-copperfield-investigation"
  },
  {
    "text": "Nikki Haley gathers her donors and ignores Trump  —  Haley didn't endorse the former president or push her supporters to back him.  —  Donald Trump may be the presumptive Republican presidential nominee, but Nikki Haley isn't offering him her support or donor network yet.",
    "url": "https://www.politico.com/news/2024/05/15/at-private-donor-event-haley-thanks-supporters-and-ignores-trump-00158058"
  },
  {
    "text": "'I'm really curious about the dog': Trump weighs in on Kristi Noem at a private fundraiser  —  Trump has largely avoided weighing in on the dog controversy publicly, as the South Dakota governor continues to face questions about shooting her pet dead 20 years ago.",
    "url": "https://www.nbcnews.com/politics/2024-election/trump-kristi-noem-really-curious-dog-fundraiser-rcna152444"
  },
  {
    "text": "Plan to ban sex education for children under nine  —  Schools in England will be banned from teaching sex education to children under nine, in new government guidance expected to be published on Thursday.  —  The BBC has not seen the new guidelines but a government source said they also included plans … ",
    "url": "https://www.bbc.com/news/uk-politics-69013002"
  },
  {
    "text": "Bibi's rant: Israel isn't a “vassal state” of the U.S. … - It was a shot across the bow to show Netanyahu how concerned Biden remains about the prime minister continuing to say he's planning to order an invasion of Rafah, where more than 1 million displaced Palestinians have taken shelter.",
    "url": "https://www.axios.com/2024/05/15/netanyahu-israel-rant-biden-gaza-war"
  },
  {
    "text": "Republicans probing Jan. 6 investigation asks star witness Cassidy Hutchinson for more documents  —  A House Administration oversight panel wants Hutchinson to provide information about her book deal as well as communications with former Rep. Liz Cheney and top Trump White House officials.",
    "url": "https://www.nbcnews.com/politics/congress/gop-committee-probing-jan-6-investigation-asks-star-witness-cassidy-hu-rcna152324"
  },
  {
    "text": "Barge collides with Pelican Island Causeway in Texas, causing damage and oil spill  —  A barge has collided with the Pelican Island Causeway in Galveston, Texas, damaging the bridge, closing the roadway to all vehicular traffic and causing an oil spill.  —  The collision occurred at around 10 a.m. local time.",
    "url": "https://www.cbsnews.com/news/pelican-island-bridge-causeway-galveston-texas-barge-collision/"
  }
]