[
  {
    "text": "Matt Gaetz ethics report says his drug use and sex with a minor violated state laws  —  Former Rep. Matt Gaetz, a Florida Republican who briefly stood to become President-elect Donald Trump's nominee to be attorney general, was found by congressional ethics investigators to have paid numerous women … ",
    "url": "https://www.cbsnews.com/news/matt-gaetz-ethics-report-released/"
  },
  {
    "text": "House Ethics report finds evidence Matt Gaetz paid thousands for sex and drugs including paying a 17-year-old for sex in 2017  —  The House Ethics Committee found evidence that former Rep. Matt Gaetz paid tens of thousands of dollars to women for sex or drugs on at least 20 occasions … ",
    "url": "https://www.cnn.com/2024/12/23/politics/matt-gaetz-house-ethics-report"
  },
  {
    "text": "Statement of the Committee on Ethics Regarding Representative Matt Gaetz  —  On December 23, 2024, the Committee on Ethics (Committee) released the attached Report regarding allegations relating to Representative Matt Gaetz.  —  The Committee previously noted that there has been a significant … ",
    "url": "https://ethics.house.gov/press-releases/statement-of-the-committee-on-ethics-regarding-representative-matt-gaetz-2/"
  },
  {
    "text": "Ethics report alleges Gaetz paid 17-year-old for sex  —  Investigators also said the Florida Republican solicited prostitutes, used illegal drugs, took improper gifts and tried to obstruct their probe.  —  A yearslong House Ethics Committee investigation into former Rep. Matt Gaetz found … ",
    "url": "https://www.politico.com/news/2024/12/23/matt-gaetz-ethics-report-findings-00195875"
  },
  {
    "text": "Gaetz sues Ethics Committee in last-minute bid to block release of report  —  Former Rep. Matt Gaetz (R-Fla.) on Monday filed a lawsuit against the House Ethics Committee in a last-minute attempt to block the panel from releasing its report on the Florida Republican.",
    "url": "https://thehill.com/homenews/house/5053397-gaetz-ethics-committee-lawsuit/"
  },
  {
    "text": "Trump Transition Live Updates: Ethics Panel Draft Report Accuses Gaetz of ‘Regularly’ Paying for Sex and Using Drugs  —  Where Things Stand  — A draft report by the House Ethics Committee accused former Representative Matt Gaetz, Republican of Florida, of regularly paying for sex … ",
    "url": "https://www.nytimes.com/live/2024/12/23/us/matt-gaetz-report-trump-news"
  },
  {
    "text": "Statement from President Joe Biden on Federal Death Row Commutations  —  I've dedicated my career to reducing violent crime and ensuring a fair and effective justice system.  —  Today, I am commuting the sentences of 37 of the 40 individuals on federal death row to life sentences without the possibility of parole.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/12/23/statement-from-president-joe-biden-on-federal-death-row-commutations/"
  },
  {
    "text": "Biden gives life in prison to 37 of 40 federal death row inmates before Trump can resume executions  —  President Joe Biden announced on Monday that he is commuting the sentences of 37 of the 40 people on federal death row, converting their punishments to life imprisonment just weeks … ",
    "url": "https://apnews.com/article/biden-death-row-commutations-trump-executions-f67b5e04453cd1aa6383c516bc14f300"
  },
  {
    "text": "Biden commutes most federal death row sentences to life in prison before Trump takes office  —  President Joe Biden announced Monday that he is taking 37 people off federal death row to serve out life sentences behind bars — a decision that leaves only three federal prisoners awaiting execution … ",
    "url": "https://www.cnn.com/2024/12/23/politics/biden-federal-death-row-trump"
  },
  {
    "text": "By stepping on rakes, Trump ruins his own ‘honeymoon’ phase  —  The president-elect had one demand for the bill to prevent a government shutdown.  He didn't get it.  The result made him look weak at an inopportune time.  —  It's not uncommon for a president-elect to enjoy a “honeymoon” … ",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/stepping-rakes-trump-ruins-honeymoon-phase-rcna185194"
  },
  {
    "text": "Trump's big Mike Johnson decision  —  A messy Capitol Hill endgame has the president-elect pondering a change in House leadership.  —  After the House passed a shutdown-averting spending bill Friday, a very relieved Speaker Mike Johnson proclaimed to reporters that President-elect Donald Trump was “certainly happy about this outcome.”",
    "url": "https://www.politico.com/news/2024/12/23/mike-johnson-speaker-trump-limbo-00195854"
  },
  {
    "text": "Trump bristles at Musk's rocketing profile as Democrats play on the president-elect's vanity  —  Whether Elon Musk is the real “president,” merely the “prime minister” or just Donald Trump's multibillionaire enforcer, he's carving out an unprecedented role that could raise conflicts of interest for the new administration.",
    "url": "https://www.cnn.com/2024/12/23/politics/president-musk-trump-analysis/"
  },
  {
    "text": "Greenland is not for sale, its leader says in response to Trump  —  Greenland is not for sale, its elected leader said on Monday, responding to comments made by U.S. President-elect Donald Trump regarding the “ownership and control” of the vast Arctic island that has been part of Denmark for over 600 years.",
    "url": "https://www.reuters.com/world/americas/greenland-is-not-sale-its-leader-says-response-trump-2024-12-23/"
  },
  {
    "text": "Anti-Abortion Officials Continue Deputizing Angry Men To Turn Over Their Partners In New Legal Foray  —  A 20-year-old woman in Collin County, Texas arrives at the emergency room to address severe bleeding.  A health care provider tells the man she's with that the woman had been nine weeks pregnant.",
    "url": "https://talkingpointsmemo.com/news/paxton-abortion-texas"
  },
  {
    "text": "Trump Organization Accused of Tax Evasion in Panama: What We Know  —  has started a quarrel with Panama over the fees it's charging American ships to use the Panama Canal, while the Trump Organization is fighting a court case over taxes in the central American country.  —  What to Know",
    "url": "https://www.newsweek.com/donald-trump-panama-canal-threats-hotel-taxes-court-filing-2005079"
  },
  {
    "text": "Trump picks billionaire financier for deputy defense secretary  —  The choice of Stephen Feinberg of Cerberus Capital Management comes as Pete Hegseth continues to face questions in the confirmation process for the top Pentagon post.",
    "url": "https://www.washingtonpost.com/politics/2024/12/22/trump-defense-department-stephen-feinberg/"
  }
]