[
  {
    "text": "Could McCarthy really lose his job?  —  Good morning, Early Birds.  If you're looking to brush up on Bibi ahead of President Biden's meeting with him in New York on Wednesday, allow us to suggest David Remnick's 1998 profile in which Benjamin Netanyahu smokes a Davidoff in his office without offering Remnick one.",
    "url": "https://www.washingtonpost.com/politics/2023/09/18/could-mccarthy-really-lose-his-job/"
  },
  {
    "text": "House Republicans strike deal on short-term funding, but Senate likely to reject it  —  Half a dozen House Republicans announced a deal on Sunday to temporarily fund the government with the goal of averting a shutdown at the end of the month.  But it's far from certain that the proposal … ",
    "url": "https://www.washingtonpost.com/politics/2023/09/17/gop-continuing-resolution/"
  },
  {
    "text": "Playbook: McCarthy's latest gambit falls flat  —  Presented by With help from Eli Okun and Garrett Ross  —  DRIVING THE DAY  —  BREAKING OVERNIGHT — “Iran-US prisoner swap likely set in motion as $6 billion of once-frozen Iranian assets reaches Qatar,” by AP's Jon Gambrell … ",
    "url": "https://www.politico.com/newsletters/playbook/2023/09/18/mccarthys-latest-gambit-falls-flat-00116484"
  },
  {
    "text": "Meet the Press - September 17, 2023  —  Former President Donald Trump, Peter Baker, Laura Jarrett and Carol Lee  —  KRISTEN WELKER:  —  This Sunday, my exclusive interview with former President Donald Trump.  —  KRISTEN WELKER:  —  When you go to bed at night, do you worry about going to jail?",
    "url": "https://www.nbcnews.com/meet-the-press/meet-press-september-17-2023-n1307173"
  },
  {
    "text": "Democratic Virginia Rep. Jennifer Wexton Won't Seek Reelection  —  Wexton was diagnosed with supranuclear palsy  —  A Facebook icon representing an external link to share the article on Facebook.A Twitter icon representing an external link to share the article on Twitter.An Email icon … ",
    "url": "https://themessenger.com/politics/virginia-rep-jennifer-wexton-wont-seek-reelection"
  },
  {
    "text": "Jennifer Wexton will not seek reelection, citing health concerns  —  Democratic Rep. Jennifer Wexton of Virginia announced Monday morning she will finish out her term in Congress but will not seek reelection, citing health concerns.  —  Wexton was diagnosed with Parkinson's disease a few months ago … ",
    "url": "https://www.cnn.com/2023/09/18/politics/jennifer-wexton-not-running-reelection/"
  },
  {
    "text": "Five Americans detained in Iran are freed and on flight out of country, Qatari official tells CNN  —  Doha and Washington CNN  —  Five Americans who had been imprisoned in Iran have been freed and are on a flight out of the country, a Qatari official briefed on the matter told CNN … ",
    "url": "https://www.cnn.com/2023/09/18/politics/iran-us-prisoner-release-intl/"
  },
  {
    "text": "Mark Meadows's Testimony in Georgia Case May Have Done Him No Favors  —  Mark Meadows, a former top Trump aide, took the witness stand in hopes of having his election interference case moved to federal court.  So far, the strategy has not paid off.  —  One morning last month … ",
    "url": "https://www.nytimes.com/2023/09/18/us/mark-meadows-georgia-trump-case.html"
  },
  {
    "text": "I Was Attacked by Trump and Musk.  It Was a Strategy to Change What You See Online.  —  When I worked at Twitter, I led the team that placed a fact-checking label on one of Donald Trump's tweets for the first time.  Following the violence of Jan. 6, I helped make the call to ban his account from Twitter altogether.",
    "url": "https://www.nytimes.com/2023/09/18/opinion/trump-elon-musk-twitter.html"
  },
  {
    "text": "Hunter Biden sues IRS over disclosures  —  The lawsuit over IRS agent interviews with Congress and the press comes as a special counsel weighs charging him with tax crimes  —  President Biden's son Hunter Biden filed a lawsuit Monday against the Internal Revenue Service … ",
    "url": "https://www.washingtonpost.com/national-security/2023/09/18/hunter-biden-lawsuit-irs/"
  },
  {
    "text": "Trump moves to put the nail in DeSantis' campaign coffin  —  The ex-president is upping his presence in Iowa in an attempt to close any door on a comeback by the Florida governor.  —  Donald Trump's campaign believes Ron DeSantis is flatlining.  Now, they want to bury him.",
    "url": "https://www.politico.com/news/2023/09/18/trump-desantis-campaign-iowa-00116452"
  },
  {
    "text": "Republicans who objected to a Biden impeachment inquiry now say they're fine with it  —  The shift in tone after Speaker Kevin McCarthy launched the inquiry by himself reflects the continued reluctance of House Republicans in swing districts to buck their party leaders.",
    "url": "https://www.nbcnews.com/politics/congress/republicans-objected-biden-impeachment-inquiry-now-say-fine-rcna104871"
  },
  {
    "text": "Keir Starmer pledges to seek major rewrite of Brexit deal  —  Labour leader tells FT his government would put closer trading relationship with Brussels at heart of growth policy  —  Sir Keir Starmer has promised to seek a major rewrite of Britain's Brexit deal in 2025 if Labour win … ",
    "url": "https://www.ft.com/content/6bdc4e88-c2ed-44ad-aa7d-c70bc358e027"
  },
  {
    "text": "U.S. asks for help finding missing F-35 fighter jet after pilot ejects during ‘mishap’  —  Joint Base Charleston in South Carolina appealed to the public for information in its bid to “locate an F-35 that was involved in a mishap” on Sunday afternoon.  —  A U.S. fighter jet's stealth abilities appear … ",
    "url": "https://www.nbcnews.com/news/us-news/f-35-fighter-jet-missing-pilot-ejects-mishap-rcna105534"
  },
  {
    "text": "Scoop: Schumer ditches Senate's informal dress code … - “Senators are able to choose what they wear on the Senate floor. … - Fetterman, who was elected last year, initially followed Senate tradition and wore suits. … The change applies only to senators — staff members will still be required to follow the old dress code.",
    "url": "https://www.axios.com/2023/09/17/senate-drops-dress-code-schumer"
  },
  {
    "text": "Ken Paxton emerges victorious from yet another career scandal  —  It marked a screaming milestone in a two-decade political career that has seen Paxton harness the state's increasingly conservative politics — and later the rise of Donald Trump — to stay in power longer than his vulnerabilities would suggest.",
    "url": "https://www.texastribune.org/2023/09/17/ken-paxton-impeachment-trial-scandal/"
  }
]