[
  {
    "text": "Playbook: Iowa enters the spin zone  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  HISTORY LESSON, PART 1 — “Martin Luther King Jr. Was a Radical,” by Sheryll Cashin for POLITICO Magazine: “The civil rights icon's image has been sanitized to Kumbaya, feel-good platitudes.",
    "url": "https://www.politico.com/newsletters/playbook/2024/01/15/iowa-enters-the-spin-zone-00135582"
  },
  {
    "text": "Majority of Iowa caucusgoers say Trump conviction wouldn't affect their support  —  The Iowa poll shows 18% of likely caucusgoers would be less likely to back Trump in 2024 if he's convicted of a crime before the general election.  —  More than 6-in-10 likely Republican caucusgoers … ",
    "url": "https://www.nbcnews.com/meet-the-press/meetthepressblog/majority-iowa-caucusgoers-say-trump-conviction-wouldnt-affect-support-rcna133876"
  },
  {
    "text": "More Nikki Haley supporters would vote for Biden over Trump in November, Iowa Poll finds  —  Just 23% of Nikki Haley supporters say they would vote for Donald Trump in a rematch with Joe Biden, a new Des Moines Register/NBC News/Mediacom Iowa Poll shows right before the Iowa Caucuses",
    "url": "https://www.desmoinesregister.com/story/news/politics/iowa-poll/caucus/2024/01/14/iowa-poll-nikki-haley-supporters-more-likely-vote-joe-biden-over-donald-trump-november-2024-election/72193795007/"
  },
  {
    "text": "Iowa caucus: Trump counts on evangelicals to carry him to victory  —  Iowa's influential evangelical voters were once decidedly lukewarm on Donald Trump.  But if recent polls are accurate, born-again Christians will carry him to victory on Monday in the Republican caucuses.  What has changed?",
    "url": "https://www.bbc.com/news/world-us-canada-67918713"
  },
  {
    "text": "Views of MAGA movement correspond to Iowa caucus support, poll finds  —  Asked to describe how “MAGA” they are, 60% of Trump's supporters call themselves “Ultra” or “Regular” MAGA, while 50% of Haley backers are anti-MAGA.  —  Views of former President Donald Trump's “Make America Great Again” … ",
    "url": "https://www.nbcnews.com/meet-the-press/meetthepressblog/views-maga-movement-correspond-iowa-caucus-support-poll-finds-rcna133878"
  },
  {
    "text": "Courting the Kook Vote in Iowa, Vivek Draws the Ire of Trump  —  Ramaswamy is fourth in the polls, but top-of-mind for the former president.  —  ANKENY, Iowa—Vivek Ramaswamy was just going through his implausible plan for firing 75 percent of the federal workforce—\"the first four agencies we're … ",
    "url": "https://thedispatch.com/article/courting-the-kook-vote-in-iowa-vivek-draws-the-ire-of-trump/"
  },
  {
    "text": "Why The World Is Betting Against American Democracy  —  Ambassadors to Washington warn that the GOP-Democratic divide is endangering America's national security.  —  Foreign diplomats are aghast that so many U.S. leaders let their zeal for partisan politics prevent the basic functions of government.",
    "url": "https://www.politico.com/news/magazine/2024/01/15/what-foreign-diplomats-say-about-u-s-politics-behind-closed-doors-00135326"
  },
  {
    "text": "Nikki Haley Refuses to Say a Man Cannot Become a Woman During Campaign Event  —  The Iowa Caucus is just hours away and social issues seem to be top of mind for at least some voters in the Hawkeye State.  —  Extreme weather conditions in Iowa limited the 2024 GOP hopefuls to mostly virtual events … ",
    "url": "https://www.megynkelly.com/2024/01/15/nikki-haley-can-a-man-become-a-woman-iowa/"
  },
  {
    "text": "Key Trump Lawyer Withdraws as Manhattan Criminal Trial Nears  —  Joseph Tacopina brought extensive experience with high-profile cases to former president Donald J. Trump's legal team.  —  Joseph Tacopina, the trial lawyer on Donald J. Trump's legal team with the most successes defending high-profile clients … ",
    "url": "https://www.nytimes.com/2024/01/15/us/politics/tacopina-trump-lawyer.html"
  },
  {
    "text": "How the Iowa caucuses work  —  Here's how the first Republican presidential nominating contest of 2024 will work on the ground Monday night.  —  On Monday evening, Iowa Republicans will head to schools and community centers to participate in their first-in-the-nation caucuses … ",
    "url": "https://www.nbcnews.com/politics/2024-election/iowa-caucuses-explained-2024-elections-rcna133550"
  },
  {
    "text": "Swastika spray-painted near Holocaust memorial in Philadelphia, police say  —  Authorities are investigating the vandalism, which comes amid a surge in antisemitic incidents nationwide.  —  A swastika was discovered on a wall near Philadelphia's Holocaust memorial on Sunday, police said.",
    "url": "https://www.nbcnews.com/news/us-news/swastika-spray-painted-holocaust-memorial-philadelphia-police-say-rcna133926"
  },
  {
    "text": "Woman killed, 17 wounded in terrorist car-ramming and stabbing spree in Ra'anana  —  Children, teens among injured; cars seized from owners during attack; police arrest 2 suspects — Palestinian relatives from Hebron area who were working illegally in the city",
    "url": "https://www.timesofisrael.com/woman-killed-17-wounded-in-terrorist-car-ramming-and-stabbing-spree-in-raanana/"
  },
  {
    "text": "Biden Money Haul: Nearly $100 Million Raised, Most Ever By a Democrat at This Point  —  The haul shows how fundraising is one of Biden's distinct competitive advantages over Republicans in 2024  —  President Joe Biden announced Monday that his campaign and the Democratic National Committee raised $97 million … ",
    "url": "https://themessenger.com/news/biden-money-haul-nearly-100-million-raised-most-ever-by-a-democrat-at-this-point"
  },
  {
    "text": "The Miseducation of Nikki Haley  —  After her failure to identify slavery as the cause of the Civil War generated a wave of criticism last month, Nikki Haley assured her potential constituents that she had Black friends, and that she understood the war's origins.",
    "url": "https://www.nytimes.com/2024/01/14/opinion/nikki-haley-slavery-civil-war.html"
  }
]