[
  {
    "text": "Trump quotes Putin condemning American democracy, praises autocrat Orban  —  Trump also called Jan. 6 defendants “hostages” and again demonized immigrants as “poisoning the blood of our country”  —  DURHAM, N.H. — Republican polling leader Donald Trump approvingly quoted autocrats Vladimir Putin … ",
    "url": "https://www.washingtonpost.com/elections/2023/12/16/trump-authoritarians-putin-orban-poisoning-blood/"
  },
  {
    "text": "Trump repeats ‘poisoning the blood’ anti-immigrant remark  —  Donald Trump, the Republican presidential frontrunner, said on Saturday that undocumented immigrants were “poisoning the blood of our country,” repeating language that has previously drawn criticism as xenophobic and echoing of Nazi rhetoric.",
    "url": "https://www.reuters.com/world/us/trump-repeats-poisoning-blood-anti-immigrant-remark-2023-12-16/"
  },
  {
    "text": "Why a Trump conviction might not save Biden's reelection  —  Pollsters have already started to explore what effect, if any, a criminal conviction before the election would have on Trump's support.  —  It's the go-to refrain for Democrats watching Joe Biden fall behind Donald Trump in polls: Just wait until Trump is convicted.",
    "url": "https://www.politico.com/news/2023/12/16/why-a-trump-conviction-might-not-save-bidens-reelection-00132125"
  },
  {
    "text": "Ron DeSantis wanted to change the way campaigns were funded.  Then the fights started.  —  With just weeks to go before the Iowa caucuses, the GOP candidate's bold strategy is now in tatters and its top architect has resigned  —  Florida Gov. Ron DeSantis entered the Republican presidential race … ",
    "url": "https://www.washingtonpost.com/politics/2023/12/16/desantis-super-pac-collapse/"
  },
  {
    "text": "Lawsuit claims CPAC knew of past allegations of sexual misconduct by Matt Schlapp  —  Officials overseeing the Conservative Political Action Conference knew about past accusations of sexual misconduct by chairman Matt Schlapp but failed to investigate or remove him from his powerful post … ",
    "url": "https://www.washingtonpost.com/nation/2023/12/16/cpac-matt-schlapp-lawsuit-sexual-misconduct/"
  },
  {
    "text": "Florida Sex Scandal Shakes Moms for Liberty, as Group's Influence Wanes  —  The conservative group led the charge on the Covid-era education battles.  But scandals and losses are threatening its power.  —  Moms for Liberty, a national right-wing advocacy group, was born in Florida as a response … ",
    "url": "https://www.nytimes.com/2023/12/16/us/politics/moms-for-liberty-sex-scandal.html"
  },
  {
    "text": "Trump lawyer blasts Jack Smith's urgency for ruling in immunity case: 'It's un-American'  —  Alina Habba, a lawyer for former President Trump, blasted Special Counsel Jack Smith for his urgency in asking the Supreme Court to take up Trump's federal 2020 election criminal case and weigh in on his immunity defense.",
    "url": "https://thehill.com/regulation/court-battles/4364070-trump-lawyer-blasts-jack-smiths-urgency-for-ruling-immunity-case/"
  },
  {
    "text": "Trump confronts ‘scheduling nightmare’ as court cases collide with campaign  —  The former president is frontloading his schedule in anticipation that legal proceedings may disrupt the campaign.  —  DURHAM, New Hampshire — Donald Trump's upcoming court calendar is creating a logistical headache for his presidential campaign.",
    "url": "https://www.politico.com/news/2023/12/16/trump-schedule-court-campaign-00132153"
  },
  {
    "text": "An order blocking enforcement of Ohio's abortion ban stands after the high court dismissed an appeal  —  The Ohio Supreme Court has dismissed the state's challenge to a judge's order that has blocked enforcement of Ohio's near-ban on abortions for the past 14 months.",
    "url": "https://apnews.com/article/abortion-ban-ohio-constitution-9d8f9e75aecb1ce2dc98d2e9ff9b4071"
  },
  {
    "text": "Quaker Recalls Granola Bars and Granola Cereals Due to Possible Health Risk  —  When a company announces a recall, market withdrawal, or safety alert, the FDA posts the company's announcement as a public service.  FDA does not endorse either the product or the company. … Summary",
    "url": "https://www.fda.gov/safety/recalls-market-withdrawals-safety-alerts/quaker-recalls-granola-bars-and-granola-cereals-due-possible-health-risk"
  },
  {
    "text": "Senate staffer alleged by conservative outlets to have had sex in a hearing room is no longer employed  —  Conservative news outlets alleged that the aide to Sen. Ben Cardin, D-Md., appeared in a leaked video showing men having sex in a Senate hearing room.  —  Sen. Ben Cardin's office … ",
    "url": "https://www.nbcnews.com/politics/congress/senate-staffer-alleged-conservative-outlets-sex-hearing-room-rcna130095"
  },
  {
    "text": "McCarthy mentee Vince Fong determined ineligible for congressional candidacy  —  California Assemblyman Vince Fong (R) isn't eligible to run for Congress in 2024, the state Secretary of State determined Friday, throwing Rep. Kevin McCarthy's (R-Calif.) succession into question.",
    "url": "https://thehill.com/homenews/house/4363558-mccarthy-mentee-vince-fong-ineligible-for-congress/"
  },
  {
    "text": "Confederate Memorial at Arlington will be removed despite GOP opposition  —  Though dozens of congressional Republicans protested the move, the Army says it will begin work in coming days  —  The U.S. Army intends to remove a Confederate memorial from Arlington National Cemetery next week … ",
    "url": "https://www.washingtonpost.com/national-security/2023/12/16/confederate-memorial-arlington-cemetery/"
  },
  {
    "text": "Statement from President Joe Biden on the Passing of Amir Sheikh Nawaf Al-Ahmed Al-Jaber Al-Sabah  —  Jill and I were saddened to learn of the passing of His Highness Amir Sheikh Nawaf Al-Ahmed Al-Jaber Al-Sabah, the Amir of Kuwait.  Sheikh Nawaf was a valued partner and true friend … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2023/12/16/statement-from-president-joe-biden-on-the-passing-of-amir-sheikh-nawaf-al-ahmed-al-jaber-al-sabah/"
  }
]