[
  {
    "text": "Trump's Shock Comic Was Set to Call Harris a ‘C*nt’  —  DONALD TRUMP'S CAMPAIGN WAS LEFT scrambling Sunday night after roast-comic Tony Hinchcliffe made insulting jokes about Hispanic and black people on stage at the ex-president's Madison Square Garden rally.",
    "url": "https://www.thebulwark.com/p/trumps-shock-comic-was-set-to-call"
  },
  {
    "text": "Ana Navarro and ‘View’ Hosts Slam ‘Vile,’ Racist Jokes Made at Trump Rally  —  A “comedian” joked that Puerto Rica was a “floating island of garbage” while opening for Trump at Madison Square Garden … During Monday's episode of The View, the two Latina hosts slammed Tony Hinchcliffe's jokes … ",
    "url": "https://www.rollingstone.com/politics/politics-news/ana-navarro-view-hosts-slam-racist-jokes-made-trump-rally-1235145170/"
  },
  {
    "text": "MAGA's closing argument: Racist attacks on a critical bloc of swing-state voters  —  Republican officials are panicking after a comedian made racist jokes about Latinos and the territory of Puerto Rico during a rally for former President Donald Trump at Madison Square Garden Sunday night … ",
    "url": "https://www.vox.com/politics/380462/trump-tony-hinchcliffe-puerto-rico-latinos-pennsylvania"
  },
  {
    "text": "Trump's Promise to Young Men: I Am Your Retribution Against Women  —  Donald Trump's rally at Madison Square Garden on Sunday was alarming for many reasons, not least for its overt fascism and racism, but it was also, as The New York Times accurately reported, a “carnival” of “misogyny”—one directed at Kamala Harris in particular.",
    "url": "https://newrepublic.com/article/187419/trumps-promise-young-men-retribution-against-women"
  },
  {
    "text": "Over 200,000 subscribers flee ‘Washington Post’ after Bezos blocks Harris endorsement  —  The Washington Post has been rocked by a tidal wave of cancellations from digital subscribers and a series of resignations from columnists, as the paper grapples with the fallout of owner Jeff Bezos's decision … ",
    "url": "https://www.npr.org/2024/10/28/nx-s1-5168416/washington-post-bezos-endorsement-president-cancellations-resignations"
  },
  {
    "text": "Betrayed Washington Post readers leave their parting thoughts in 140,000 comments  —  According to NPR's David Folkenflik, a staggering, catastrophic 8 percent of Washington Post subscribers - over 200,000 — have canceled their subscriptions since Friday's news broke that owner Jeff Bezos ordered … ",
    "url": "https://presswatchers.org/2024/10/betrayed-washington-post-readers-leave-their-parting-thoughts-in-140000-comments/"
  },
  {
    "text": "‘Untenable and unconscionable’: Exodus from Washington Post editorial board continues  —  The Scoop  —  Two more Washington Post opinion writers resigned from its editorial board Monday as the paper reels into the US election amid an identity crisis.  —  David Hoffman, who joined the Post … ",
    "url": "https://www.semafor.com/article/10/28/2024/more-editorial-board-members-resign-at-washington-post"
  },
  {
    "text": "Burning ballots pulled from inside smoking Vancouver ballot box; hundreds of ballots lost  —  VANCOUVER, Wash. — KATU was on the scene at Fisher's Landing Transit Center in Vancouver early Monday morning, where heavy smoke was seen coming from inside a dropoff ballot box.",
    "url": "https://www.katu.com/news/local/vancouver-ballot-box-seen-smoking-same-morning-as-portland-ballot-box-arson"
  },
  {
    "text": "Police say fires set at ballot boxes in Oregon and Washington are connected; ‘suspect vehicle’ ID'd  —  Police say they have identified a “suspect vehicle” connected to incendiary devices that set fires in ballot drop boxes in Oregon and Washington state early Monday.",
    "url": "https://apnews.com/article/vote-ballot-drop-box-democracy-fire-f66c52f774955106fb9e7c8172825cff"
  },
  {
    "text": "2 ballot drop boxes set on fire in Portland area; hundreds of ballots destroyed  —  Police in Vancouver and Portland are investigating two Monday morning fires intentionally set at ballot boxes.Elections officials in Multnomah County said only three ballots were destroyed at the ballot box … ",
    "url": "https://www.oregonlive.com/news/2024/10/a-second-ballot-box-fire-this-time-in-clark-county-destroys-hundreds-of-ballots.html?origin=serp_auto"
  },
  {
    "text": "Trump Wants You to Accept All of This as Normal  —  The former president is psychologically preparing Americans for an assault on the electoral system.  —  In the final week of this election season, the Republican Party is running two different campaigns.  One of them is an ugly and angry but conventional political enterprise.",
    "url": "https://www.theatlantic.com/politics/archive/2024/10/maidison-square-garden-election-fraud/680429/?gift=hVZeG3M9DnxL4CekrWGK36Ka554OqzSbHzHo9_Vj1FE&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "This Is Trump's Message  —  This article was featured in the One Story to Read Today newsletter.  Sign up for it here.  —  We might as well start with the lowlight of last night's Trump campaign rally at Madison Square Garden.  That would be Tony Hinchcliffe, a podcaster who's part of Joe Rogan's circle … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/10/trump-madison-square-garden-rally/680424/"
  },
  {
    "text": "Trump Hints at ‘Little Secret’ With House Republicans, Setting Off a Panic  —  The former president seemed to delight in fueling speculation about what he is cooking up with House Republicans, prompting Democrats to worry about election fraud.  Speaker Mike Johnson refused to explain.",
    "url": "https://www.nytimes.com/2024/10/28/us/politics/trump-secret-house-republicans-panic.html"
  },
  {
    "text": "Trump's Dark Little “Secret” With Mike Johnson Is Actually a Threat … Donald Trump says that he and Speaker Mike Johnson have a dirty “little secret.”  —  Speaking at a rally at Madison Square Garden on Sunday, Trump seemed to tell his fans that he and the Republican House speaker have a plan … ",
    "url": "https://newrepublic.com/post/187596/trump-secret-mike-johnson-madison-square-garden-nyc-rally"
  },
  {
    "text": "A new Supreme Court case could change the result of the presidential election  —  Support independent journalism that matters — become a Vox Member.  —  On October 23, the Pennsylvania Supreme Court ruled that many voters who cast a mailed-in ballot improperly, thus rendering their vote … ",
    "url": "https://www.vox.com/scotus/380170/supreme-court-pennsylvania-election-republican-genser"
  },
  {
    "text": "Republicans Cling to Slim Leads in Nebraska and Texas Senate Races  —  In Nebraska, Dan Osborn, an independent, is in a tight race with Senator Deb Fischer, and in Texas, Representative Colin Allred is four percentage points behind Senator Ted Cruz.  —  Dan Osborn, a union leader … ",
    "url": "https://www.nytimes.com/2024/10/28/us/politics/nebraska-texas-senate-races.html"
  },
  {
    "text": "“Put Them in Trauma”: Inside a Key MAGA Leader's Plans for a New Trump Agenda  —  Private videos reveal Trump adviser Russ Vought's “shadow” plans for using the military on protesters, defunding the EPA and villainizing civil servants.  —  Co-published with Documented  —  Reporting Highlights",
    "url": "https://www.propublica.org/article/video-donald-trump-russ-vought-center-renewing-america-maga"
  },
  {
    "text": "The Comically Terrible Rollout of Latter-day Saints for Trump  —  One of the more puzzling, albeit obscure, subplots in the final weeks of this campaign season has been Donald Trump's thunderingly incompetent effort to court Mormon voters.  —  Earlier this month, the former president's … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/10/latter-day-saints-trump/680428/?gift=66OeTwjwIWd7-zlTK2lFDhsR1KzhmiNuNhuD2ZZZ7vo&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Trump Campaign Worker Blows Whistle on ‘Grift’ and Bugging Plot  —  ‘GREEDY AND WRONG’  —  A bombshell email claims millions were funneled from campaign to “overcharging” firms—and some went to a top Kamala Harris donor.  —  EXCLUSIVE  —  A Trump campaign worker has been fired after trying … ",
    "url": "https://www.thedailybeast.com/donald-trump-campaign-worker-blows-whistle-on-grift-and-bugging-plot-in-bombshell-email/"
  }
]