[
  {
    "text": "Hegseth Said to Have Shared Attack Details in Second Signal Chat  —  The defense secretary sent sensitive information about strikes in Yemen to an encrypted group chat that included his wife and brother, people familiar with the matter said.  —  Defense Secretary Pete Hegseth shared detailed information … ",
    "url": "https://www.nytimes.com/2025/04/20/us/politics/hegseth-yemen-attack-second-signal-chat.html?unlocked_article_code=1.BE8.BauJ.3YOHxBJpnIXl&smid=url-share"
  },
  {
    "text": "Former Top Pentagon Spokesperson Details ‘Month From Hell’ Inside the Agency  —  The total chaos at the Department of Defense is becoming a major distraction for the Trump administration, writes John Ullyot.  —  It's been a month of total chaos at the Pentagon.",
    "url": "https://www.politico.com/news/magazine/2025/04/20/pentagon-chaos-ullyot-hegseth-00205594"
  },
  {
    "text": "Former Pentagon official warns department's dysfunction could topple Hegseth  —  “The last month has been a full-blown meltdown at the Pentagon,” John Ullyot, the former top Defense Department spokesperson, wrote in a POLITICO Magazine opinion piece.  —  The Pentagon is in “total chaos” … ",
    "url": "https://www.politico.com/news/2025/04/20/ullyot-pentagon-hegseth-chaos-00300695"
  },
  {
    "text": "Hegseth shared detailed military plans in second Signal chat that included his wife and brother  —  Secretary of Defense Pete Hegseth shared detailed plans about a military operation against the Houthis in Yemen on a second Signal group chat that included his wife, lawyer and brother, three people familiar with the chat told CNN.",
    "url": "https://cnn.com/2025/04/20/politics/hegseth-second-signal-chat-military-plans/"
  },
  {
    "text": "Hegseth Faces Heat After New Signal Chat Emerges and Claim of Pentagon ‘Chaos’  —  A former top Hegseth adviser suggested Sunday night that Trump should consider replacing the embattled Defense chief  —  WASHINGTON—Defense Secretary Pete Hegseth created a Signal chat with his wife … ",
    "url": "https://www.wsj.com/politics/national-security/hegseth-faces-heat-after-new-signal-chat-emerges-and-claim-of-pentagon-chaos-e717ea84?st=kRfV66&reflink=desktopwebshare_permalink"
  },
  {
    "text": "After Meeting Wrongly Deported Man, Van Hollen Accuses Trump of Defying Courts  —  “Facilitating his return means something more than doing nothing, and they are doing nothing,” Senator Chris Van Hollen said after his trip to El Salvador.  —  Senator Chris Van Hollen on Sunday accused … ",
    "url": "https://www.nytimes.com/2025/04/20/us/politics/van-hollen-deportation-trump-courts.html"
  },
  {
    "text": "Nancy Mace Films Herself Having Wild Meltdown On ‘Unhinged Lunatic’ Voter Over Hosting Town Halls  —  The shocking, filthy exchange took a turn after the politician alluded that he was gay.  —  Rep. Nancy Mace (R-SC) shared footage of an expletive-laden confrontation between her and an “unhinged lunatic” voter over the weekend.",
    "url": "https://www.huffpost.com/entry/nancy-mace-store-argument-meltdown_n_68054198e4b0d0d20e4721a3"
  },
  {
    "text": "Rubio denies that Trump will politicize the Foreign Service and slash embassies  —  The Trump administration is distancing itself from a document that has circulated within the State Department that would eliminate the career diplomatic corps in its current, non-partisan form and slash embassies around the world.",
    "url": "https://www.govexec.com/management/2025/04/rubio-denies-trump-will-politicize-foreign-service-and-slash-embassies/404703/"
  },
  {
    "text": "Is Donald Trump Breaking the Law?  Seven Experts Weigh In.  —  Trump critics say we are in a constitutional crisis.  The White House says that's hysterical.  What do our top legal minds say?  —  The first 90 days of President Trump's second term have been marked by a series of aggressive legal maneuvers.",
    "url": "https://www.thefp.com/p/is-donald-trump-breaking-the-law"
  },
  {
    "text": "Six men charged after forcibly removing woman from North Idaho town hall  —  KOOTENAI COUNTY, Idaho — Just one week after its recommendation, the Coeur d'Alene City Attorney's Office has filed charges against six men involved in the forced removal of a woman at a Kootenai County town hall in February.",
    "url": "https://www.kivitv.com/news/six-men-charged-after-forcibly-removing-woman-from-north-idaho-town-hall"
  },
  {
    "text": "Amy Klobuchar calls on supreme court to hold Trump officials in contempt  —  Senator warns of US getting ‘closer to a constitutional crisis’ as Samuel Alito's dissent signals deference to Trump  —  Minnesota senator Amy Klobuchar warned on Sunday that the US is “getting closer and closer … ",
    "url": "https://www.theguardian.com/us-news/2025/apr/20/amy-klobuchar-samuel-alito-trump-immigration"
  },
  {
    "text": "As bird flu hits cattle herds in U.S., scientists say these H5N1 factors worry them most  —  As the H5N1 bird flu virus mutates and rapidly spreads through American cattle herds — a first for the U.S. — doctors and veterinarians are fearful that if the virus is left unchecked, it could spiral into a possible pandemic",
    "url": "https://www.cbsnews.com/news/bird-flu-pandemic-potential-scientists-60-minutes/"
  },
  {
    "text": "Sen. Kennedy says Trump's idea to send Americans to foreign prisons is not ‘moral’: Full interview  —  In an exclusive interview with Meet the Press, Sen. John Kennedy (R-La.) disagreed with President Trump's idea to deport U.S. citizens to foreign prisons, saying it should not be “considered appropriate or moral.”",
    "url": "https://www.nbcnews.com/meet-the-press/video/sen-kennedy-says-trump-s-idea-to-send-americans-to-foreign-prisons-is-not-moral-full-interview-237939781770"
  },
  {
    "text": "Trump Administration Irate at Harvard, Plans to Pull Additional $1 Billion in Funding  —  The university publicized a government demand letter that asked for federal oversight of the campus  —  The Trump administration has grown so furious with Harvard University after a week … ",
    "url": "https://www.wsj.com/us-news/education/trump-administration-irate-at-harvard-will-pull-additional-1-billion-in-funding-8c209113?st=6r13ey&reflink=article_copyURL_share"
  },
  {
    "text": "Trump's Surgeon General Pick Distorted Key Parts of Her Résumé  —  Dr. Janette Nesheiwat, an urgent-care physician and former Fox News medical contributor 1 who is President Donald Trump's nominee for surgeon general of the United States, has over at least the last 15 years falsely represented … ",
    "url": "https://lastcampaign.substack.com/p/trumps-surgeon-general-pick-distorted"
  },
  {
    "text": "Zeldin says he can ‘absolutely’ assure public EPA deregulation efforts won't harm environment  —  Environmental Protection Agency (EPA) Administrator Lee Zeldin said he can “absolutely” assure the public that the various deregulation efforts undergone by the agency will not harm the environment.",
    "url": "https://thehill.com/policy/energy-environment/5257850-zeldin-public-epa-deregulations-wont-harm-environment/"
  },
  {
    "text": "Buick finally had cars Americans wanted to buy - then came tariffs  —  General Motors' (GM.N) Buick was on a roll.  Sales for the once-stodgy brand were up 39% in the first quarter with a refreshed lineup of compact SUVs including the Envision, Encore GX, and the Envista, its top-selling SUV for under $30,000.",
    "url": "https://www.reuters.com/business/autos-transportation/buick-finally-had-cars-americans-wanted-buy-then-came-tariffs-2025-04-19/"
  },
  {
    "text": "DHL suspends high value US deliveries over tariffs  —  DHL Express is suspending deliveries to the US worth more than $800 (£603) because of a “significant increase” in red tape at customs following the introduction of Donald Trump's new tariff regime.",
    "url": "https://www.bbc.com/news/articles/c1jx9ep5l63o"
  },
  {
    "text": "Trump's Tariffs Won't Even Let You Drink Your Way Through these Tough Times  —  One evening last week I came home and mixed myself a cocktail.  That night it was a riff on a martini.  I started with a bottle of Botanist gin, which is distilled in Scotland with a broad range of local botanicals like apple mint, birch leaf, and heather.",
    "url": "https://www.theunpopulist.net/p/trumps-tariffs-wont-even-let-you"
  }
]