[
  {
    "text": "I Was a Skeptic of the Stormy Daniels Prosecution.  I Was Wrong.  —  The prosecution of Donald Trump starting in New York this week is on firm legal ground.  —  When Manhattan District Attorney Alvin Bragg brought criminal charges against Donald Trump in 2023, I was highly skeptical of his decision.",
    "url": "https://slate.com/news-and-politics/2024/04/stormy-daniels-prosecution-stronger-than-i-thought.html"
  },
  {
    "text": "Live Updates: Trump Trial Poised to Begin, a Criminal Case Without Precedent  —  Jury selection is set to start as Donald J. Trump faces charges he faked business records to cover up a sex scandal before winning the presidency.  The judge declined Mr. Trump's request to recuse himself.",
    "url": "https://www.nytimes.com/live/2024/04/15/nyregion/trump-hush-money-trial"
  },
  {
    "text": "Trump rages at judge hours before hush money case begins  —  Former President Trump railed against the judge in his criminal hush money case early Monday, just hours before the first criminal trial against a former president is set to begin.  —  Recalling complaints he has made for months … ",
    "url": "https://thehill.com/regulation/court-battles/4594517-trump-posts-hush-money-trial-judge/"
  },
  {
    "text": "It's Time to Play to Win  —  BUCKLE UP—Donald Trump's first criminal trial starts today.  The jury—when they manage to seat one—will consider whether Trump falsified business records to cover up hush-money payments to porn star Stormy Daniels, with whom he allegedly had an affair shortly … ",
    "url": "https://www.thebulwark.com/p/its-time-to-play-to-win"
  },
  {
    "text": "How to pick a jury that can judge Donald Trump  —  Tailoring questions to probe prospective jurors' political biases and opinions of the former president is more art than science.  —  Former President Donald Trump's criminal trial in New York begins Monday with an immediate and fundamental challenge … ",
    "url": "https://www.politico.com/news/2024/04/14/jury-selection-donald-trump-00151962"
  },
  {
    "text": "GOP Lawmakers Are All-In on Trump—a Conviction Be Damned  —  FIFTH AVENUE FAITHFUL  —  We asked more than 20 Republicans in Congress whether they were comfortable with the GOP nominee potentially being a convicted felon.  Only one expressed any issue with it.",
    "url": "https://www.thedailybeast.com/gop-lawmakers-are-all-in-on-trumpa-conviction-be-damned"
  },
  {
    "text": "Justice Clarence Thomas misses Supreme Court arguments  —  The conservative justice was not present for oral arguments on Monday, but the court did not provide a reason why.  —  WASHINGTON — Conservative Supreme Court Justice Clarence Thomas was not present at the court for oral arguments on Monday … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/justice-clarence-thomas-misses-supreme-court-arguments-rcna147826"
  },
  {
    "text": "Justice Thomas misses Supreme Court session Monday with no explanation  —  Supreme Court Justice Clarence Thomas was absent from the court Monday with no explanation.  Thomas, 75, also was not participating remotely in arguments, as justices sometimes do when they are ill or otherwise can't be there in person.",
    "url": "https://thehill.com/homenews/ap/ap-politics/ap-justice-thomas-misses-supreme-court-session-monday-with-no-explanation/"
  },
  {
    "text": "Federal criminal investigation opened into Key Bridge crash  —  The FBI has opened a criminal investigation focusing on the massive container ship that brought down the Francis Scott Key Bridge in Baltimore last month — a probe that will look at least in part at whether the crew left … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2024/04/15/balitmore-key-bridge-criminal-investigation/"
  },
  {
    "text": "FBI opens criminal investigation into Baltimore bridge collapse, AP source says  —  The FBI is conducting a criminal investigation into the deadly collapse of Baltimore's Francis Scott Key Bridge that is focused on the circumstances leading up to it and whether all federal laws were followed … ",
    "url": "https://apnews.com/article/baltimore-bridge-collapse-fbi-investiagation-58188d524035c756872603055f309c78"
  },
  {
    "text": "Trump Media shares plunge more than 15% after company files to issue additional DJT stock … This photo illustration shows an image of former President Donald Trump reflected in a phone screen that is displaying the Truth Social app, in Washington, DC, on February 21, 2022.",
    "url": "https://www.cnbc.com/2024/04/15/trump-media-shares-plunge-after-company-files-to-issue-additional-djt-stock.html"
  },
  {
    "text": "The Supreme Court effectively abolishes the right to mass protest in three US states  —  It is no longer safe to organize a protest in Louisiana, Mississippi, or Texas.  —  The Supreme Court announced on Monday that it will not hear Mckesson v. Doe.  The decision not to hear Mckesson leaves … ",
    "url": "https://www.vox.com/scotus/24080080/supreme-court-mckesson-doe-first-amendment-protest-black-lives-matter"
  },
  {
    "text": "Israel Repelled Iran's Huge Attack.  But Only With Help From U.S. and Arab Partners.  —  Working with partners, it fended off worst of Iranian strikes; what comes next will test powers in the Middle East and beyond  —  Saturday's Iranian strike on Israel was huge by any standard.",
    "url": "https://www.wsj.com/world/middle-east/analysis-israel-repelled-irans-huge-attack-but-only-with-help-from-u-s-and-arab-partners-a7844065"
  },
  {
    "text": "Tax Day reveals a major split in how Joe Biden and Donald Trump would govern  —  Tax Day reveals a major split in how Joe Biden and Donald Trump would govern: The presidential candidates have conflicting ideas about how much to reveal about their own finances and the best ways to boost the economy through tax policy.",
    "url": "https://apnews.com/article/trump-biden-income-taxes-irs-returns-filings-55d3031de64251169eb247f52430618d"
  },
  {
    "text": "Trump trade advisers plot dollar devaluation  —  Advisers close to the former president — particularly his former trade chief Robert Lighthizer — are considering policies that would weaken the dollar relative to other currencies, which could juice U.S. exports but also fuel inflation.",
    "url": "https://www.politico.com/news/2024/04/15/devaluing-dollar-trump-trade-war-00152009"
  }
]