[
  {
    "text": "Trump tries some debate prep on the campaign trail  —  Over the course of nearly 90 minutes, Trump kept coming back to talking about Thursday's debate in Atlanta.  —  Donald Trump might be eschewing formal preparations for Thursday's debate — but that doesn't mean he isn't thinking about it.",
    "url": "https://www.politico.com/news/2024/06/22/trump-philly-rally-debate-00164578"
  },
  {
    "text": "For Biden and Trump, a Debate Rematch With Even Greater Risks and Rewards  —  The matchup on Thursday will be the earliest presidential debate in American history, and any potential missteps could linger for weeks or months.  —  The debate between President Biden and former President Donald J. Trump … ",
    "url": "https://www.nytimes.com/2024/06/23/us/politics/biden-trump-debate-stakes.html"
  },
  {
    "text": "Trump Just Revealed How He'll Attack Biden at Debate—and It's Vile  —  You can't say you weren't warned: At the upcoming presidential debate on June 27, Donald Trump plans to highlight a handful of horrific murders—allegedly by undocumented migrants—and blame them on President Biden.",
    "url": "https://newrepublic.com/article/182993/trump-biden-debate-attack"
  },
  {
    "text": "Here's How Biden Could Rattle Trump in Their First Debate  —  My opponent likes to pose as a tough guy.  But where I come from—and it may be old-fashioned—if you lose, you take the hit.  You don't whine and cry about it and blame everybody else.  You take responsibility, you move on.",
    "url": "https://link.motherjones.com/public/35799406"
  },
  {
    "text": "Trump floats UFC-style migrant league amid border crisis  —  At the Faith & Freedom Coalition gathering in Washington, D.C., Trump called migrants “tough people” who could beat the country's best fighters.  —  Former President Donald Trump suggested in two speeches Saturday that migrants coming … ",
    "url": "https://www.politico.com/news/2024/06/22/trump-ufc-migrant-league-00164570"
  },
  {
    "text": "Trump ‘Tiny Hands’ Joke Rules Out VP Contender: Ex-Aide  —  Anthony Scaramucci said that Donald Trump will pick “a white guy” to be his running mate.  —  FREE SPEECH?  —  Attendees of a May 31 panel on antisemitism at a Columbia University alumni event captured pictures of texts … ",
    "url": "https://www.thedailybeast.com/trump-tiny-hands-joke-rules-out-vp-contender-marco-rubio-says-anthony-scaramucci"
  },
  {
    "text": "Michael Flynn Has Turned His Trump-World Celebrity Into a Family Business … Many of Donald J. Trump's allies have tried to turn political fame into private income.  Few have done it on the scale that Michael T. Flynn has.Sam Hodgson for The New York Times",
    "url": "https://www.nytimes.com/2024/06/23/us/politics/donald-trump-michael-flynn-qanon.html"
  },
  {
    "text": "US, Vietnam Discuss Boosting Cooperation in Wake of Putin Visit  —  The US and Vietnam discussed ways to develop their strategic partnership, according to a statement from the Hanoi government, in a meeting that follows a visit to the Southeast Asian nation last week by Russian President Vladimir Putin.",
    "url": "https://www.bloomberg.com/news/articles/2024-06-23/us-vietnam-discuss-boosting-cooperation-in-wake-of-putin-visit"
  },
  {
    "text": "Disappointment and ‘depression’: Biden's biggest fundraisers watch their advantage vanish  —  Joe Biden's allies are bracing after Donald Trump erased the president's financial edge.  —  Joe Biden's campaign planned to bury Donald Trump in an avalanche of cash.",
    "url": "https://www.politico.com/news/2024/06/23/biden-trump-finances-00164566"
  },
  {
    "text": "Republicans urge Trump to avoid 2020 debate pitfalls: 'Don't take the bait'  —  Senate Republicans are urging former President Trump to avoid a repeat of his much-maligned debate performance against President Biden four years ago when the two meet onstage Thursday for a pivotal moment in their rematch.",
    "url": "https://thehill.com/homenews/senate/4733881-republicans-trump-debate/"
  },
  {
    "text": "In Trump we trust: religious right on crusade to make their man president  —  America's evangelicals sense a chance to impose a radical agenda and resist what they see as a tide of liberal secularism  —  God's army is on the march.  And many of its foot soldiers are wearing … ",
    "url": "https://www.theguardian.com/us-news/article/2024/jun/22/trump-christians-president-religion"
  },
  {
    "text": "Biden DHS docs suggested Trump supporters, military and religious people are likely violent terror threats  —  Internal documents show that the board suggested ‘most of the Domestic Terrorism threat’ in the U.S. comes from Trump supporters  —  Join Fox News for access to this content",
    "url": "https://www.foxnews.com/politics/biden-dhs-docs-suggested-trump-supporters-military-religious-people-likely-violent-terror-threats?intcmp=tw_fnc"
  },
  {
    "text": "Florida Dems Hope Fourth Time Is A Charm Against Rick Scott And His Bank Account  —  The U.S. senator and former governor has won all three of his statewide races, but never by more than a single percentage point.  —  TAMPA, Fla. — As Democrats gear up for yet another run … ",
    "url": "https://www.huffpost.com/entry/mucarsel-powell-rick-scott-florida-abortion_n_66748780e4b043a634bd9ea9"
  },
  {
    "text": "Bowman, in Fight for His Political Life, Embraces the Left's Star Power  —  Representative Alexandria Ocasio-Cortez and Senator Bernie Sanders rallied with Jamaal Bowman on Saturday, three days before the primary on Tuesday.  —  He cracked jokes on “The Late Show With Stephen Colbert,” … ",
    "url": "https://www.nytimes.com/2024/06/22/nyregion/bowman-aoc-bernie.html"
  }
]