[
  {
    "text": "Sen. Alex Padilla is forcibly removed from DHS Secretary Kristi Noem's news conference  —  The Democrat said he had questions for Trump's Cabinet secretary during her press conference in Los Angeles.  —  Sen. Alex Padilla, D-Calif., was forcibly removed from a news conference in Los Angeles … ",
    "url": "https://www.nbcnews.com/politics/congress/sen-alex-padilla-forcibly-removed-dhs-sec-kristi-noems-press-conferenc-rcna212688"
  },
  {
    "text": "Tensions explode on House floor over Padilla incident  —  Rep. John Mannion (D-N.Y.) shocked colleagues in both parties Thursday by tearing into Rep. Mike Lawler (R-N.Y.) in what sources described as a tense and profane confrontation over the forcible removal of Sen. Alex Padilla (D-Calif.).",
    "url": "https://www.axios.com/2025/06/12/alex-padilla-john-mannion-mike-lawler-house-floor"
  },
  {
    "text": "CNN Security Analyst Defends Kristi Noem and Agents Who Shoved Senator Out of Presser  —  A CNN analyst who once served as an FBI special agent defended some of the tactics used by Secret Service and FBI personnel in their clash with Sen. Alex Padilla (D-CA) Thursday.",
    "url": "https://www.mediaite.com/media/news/cnn-security-analyst-defends-kristi-noem-and-agents-who-shoved-senator-out-of-presser/"
  },
  {
    "text": "Recriminations erupt after Noem guards tackle Padilla  —  “If this is how this administration responds to a senator with a question ... you can only imagine what they're doing to farmworkers, to cooks, to day laborers,” Padilla said.  —  LOS ANGELES — It began as a garden-variety news conference.",
    "url": "https://www.politico.com/news/2025/06/12/california-sen-alex-padilla-handcuffed-at-noem-presser-00403253"
  },
  {
    "text": "California Sen. Alex Padilla forcefully removed from Noem's press conference by security  —  Democratic California U.S. Sen. Alex Padilla was forcefully removed Thursday by security officers from a press conference being held on immigration by Homeland Security Secretary Kristi Noem.",
    "url": "https://apnews.com/article/alex-padilla-noem-immigration-protest-california-f67d220a0254473c53c16aa96f554239"
  },
  {
    "text": "Sen. Padilla Pushed to Ground, Handcuffed for Demanding DHS Not Lie  —  Forcibly removing a sitting US senator, as they opposed the president's immigration policy, is a part of a broader slide.  —  As Homeland Security Secretary Kristi Noem talked about the need to apply constitutional rights … ",
    "url": "https://www.motherjones.com/politics/2025/06/alex-padilla-handcuff-dhs-noem-press-conference/"
  },
  {
    "text": "Democratic senator forcibly removed from DHS press conference  —  Sen. Alex Padilla (D-Calif.) was physically removed on Thursday from a Los Angeles press conference held by Homeland Security Secretary Kristi Noem.  —  Why it matters: In a video posted to X by a Fox News reporter … ",
    "url": "https://www.axios.com/2025/06/12/alex-padilla-homeland-security-kristi-noem"
  },
  {
    "text": "Here's the latest.  —  The Israeli government has been making preparations for weeks for an attack on Iran's nuclear facilities.  —  Here's the latest.  —  Explosions rocked Tehran early Friday morning, and Israel's defense minister said his country's warplanes had carried out an attack on Iran … ",
    "url": "https://www.nytimes.com/live/2025/06/12/world/israel-iran-us-nuclear?unlocked_article_code=1.Ok8.U3b4.WA988zCDEwXA&smid=url-share"
  },
  {
    "text": "Israel attacks Iran's capital with explosions booming across Tehran  —  Israel attacked Iran's capital early Friday, with explosions booming across Tehran as Israel said it targeted nuclear and military sites.  The attack comes as tensions have reached new heights over Tehran's rapidly advancing nuclear program.",
    "url": "https://apnews.com/article/iran-explosions-israel-tehran-00234a06e5128a8aceb406b140297299"
  },
  {
    "text": "U.S. told Israel it won't participate in an Israeli strike on Iran  —  The Trump administration told the Israeli government the U.S. won't be directly involved in any Israeli military strike against Iran's nuclear facilities, two U.S. sources and an Israeli source familiar with those discussions tell Axios.",
    "url": "https://www.axios.com/2025/06/12/israel-strike-iran-us-not-participate"
  },
  {
    "text": "Judge sharply questions Trump's Guard deployment to Los Angeles  —  U.S. District Judge Charles Breyer says he's poised to rule as soon as Thursday evening.  —  SAN FRANCISCO — A federal judge cast doubts Thursday on the legality of President Donald Trump's deployment of the National Guard in Los Angeles … ",
    "url": "https://www.politico.com/news/2025/06/12/national-guard-california-lawsuit-court-hearing-00403910"
  },
  {
    "text": "Hegseth won't commit to obeying courts on Marines in Los Angeles  —  The Defense secretary declined to say whether the Pentagon would comply with any judicial order blocking Trump's domestic troop deployment.  —  Defense Secretary Pete Hegseth refused to say whether he would follow the courts … ",
    "url": "https://www.politico.com/news/2025/06/12/hegseth-marines-los-angeles-00402794"
  },
  {
    "text": "Judge Slams Trump Admin in California National Guard Case  —  A federal judge in a hearing Thursday appeared deeply skeptical of the Department of Justice's (DOJ) legal defense of President Donald Trump federalizing the California National Guard in response to largely peaceful protests in Los Angeles.",
    "url": "https://www.democracydocket.com/news-alerts/judge-trump-federalize-california-national-guard-case/"
  },
  {
    "text": "Trump's birthday parade may be cancelled over thunderstorms  —  Army spokesman tells The Times of safety fears as president hopes to mark 250 years of the US military with event in Washington on Saturday  —  President Trump's plans to hold a military parade in Washington on his 79th birthday … ",
    "url": "https://www.thetimes.com/us/american-politics/article/is-trump-birthday-parade-cancelled-weather-pbrg02h2z"
  },
  {
    "text": "Combined Distributional Effects of the One Big Beautiful Bill Act and of Tariffs  —  The combination of 2025 tariff increases implemented as of June 1 and the One Big Beautiful Bill Act passed by the House of Representatives would reduce after-tax-and-transfer incomes on average among the bottom 80 percent of U.S. households.",
    "url": "https://budgetlab.yale.edu/research/combined-distributional-effects-one-big-beautiful-bill-act-and-tariffs"
  },
  {
    "text": "Trump Voter Gets Choked Up After ICE Detains a Third of His Staff  —  BUYER'S REMORSE  —  A Florida roofing boss backed the president's tough immigration policies.  Then six of his workers were taken away...  Vincent Scardina supported Donald Trump's tough stance on immigration at the ballot box.",
    "url": "https://www.thedailybeast.com/trump-voter-gets-choked-up-after-ice-detains-a-third-of-his-staff/"
  },
  {
    "text": "Exclusive: Trump administration will tell migrants from Cuba, Haiti, Nicaragua and Venezuela their legal status is terminated  —  The Department of Homeland Security on Thursday will tell hundreds of thousands of migrants that their permission to live and work in the United States had been revoked … ",
    "url": "https://cnn.com/2025/06/12/politics/migrants-cuba-venezuela-haiti-nicaragua"
  },
  {
    "text": "Troops and marines deeply troubled by LA deployment: ‘Morale is not great’  —  Several service members told advocacy groups they felt like pawns in a political game and assignment was unnecessary  —  California national guards troops and marines deployed to Los Angeles to help restore order … ",
    "url": "https://www.theguardian.com/us-news/2025/jun/12/los-angeles-national-guard-troops-marines-morale"
  },
  {
    "text": "Most say the upcoming military parade is not a good use of government funds  —  Forty percent approve of the military parade honoring the 250th anniversary of the U.S. Army, and 60% say it is not a good use of government funds.  Similar shares, about 3 in 10, feel the U.S. government spends … ",
    "url": "https://apnorc.org/projects/most-say-the-upcoming-military-parade-is-not-a-good-use-of-government-funds/"
  },
  {
    "text": "“Delay, Interfere, Undermine”  —  Leer en español.  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up to receive our biggest stories as soon as they're published.  —  In mid-April, President Donald Trump sat down in the Oval Office with President Nayib Bukele … ",
    "url": "https://www.propublica.org/article/bukele-trump-el-salvador-ms13-gang-vulcan-corruption-investigation"
  },
  {
    "text": "Trump promises farmers “changes are coming” to immigration crackdown  —  President Trump acknowledged that his “very aggressive” immigration policies are ripping long-time workers from the farming and hospitality industries, in a Thursday Truth Social post.  —  The big picture … ",
    "url": "https://www.axios.com/2025/06/12/trump-immigration-enforcement-farms-hotels"
  },
  {
    "text": "ICE activity reported at 2 Downey churches  —  DOWNEY, Calif. — The city of Los Angeles is on high alert on the sixth day of protests over ICE activity, and President Trump sending in 4,000 National Guard members and 700 Marines.  —  Civil rights leaders on Wednesday said ICE agents showed up at two churches in Downey.",
    "url": "https://spectrumnews1.com/ca/southern-california/politics/2025/06/11/downey-churches-raided-by-ice-agents"
  }
]