[
  {
    "text": "Exclusive: Suspect in Coachella Valley Trump assassination attempt denies accusation, supports ex-president  —  Suspect a registered Republican from Las Vegas and member of a right-leaning anti-government group, sheriff says  —  A third assassination attempt against former President Donald Trump … ",
    "url": "https://www.pressenterprise.com/2024/10/13/las-vegas-man-found-with-loaded-firearm-high-capacity-magazine-near-trump-rally-in-coachella-valley/"
  },
  {
    "text": "Weapons Violation Arrest  —  Reporting Supervisor: Sergeant Ben Medina  —  File # C242860022  —  Details:  —  at 4:59 p.m., deputies assigned to former President Donald Trump's rally in the Coachella Valley contacted the driver of a black SUV at a checkpoint at the intersection of Avenue 52 and Celebration Drive.",
    "url": "https://www.riversidesheriff.org/CivicAlerts.aspx?AID=5898"
  },
  {
    "text": "Armed man arrested outside Trump's Coachella rally — and sheriff says it was possible third assassination attempt  —  Local cops arrested an armed man outside Donald Trump's Coachella Valley rally on Saturday, and the local sheriff said it may have been a third assassination attempt against the former president.",
    "url": "https://nypost.com/2024/10/13/us-news/third-trump-assassination-attempt-thwarted-when-armed-man-arrested-outside-coachella-rally-sheriff-says/"
  },
  {
    "text": "Man arrested near Donald Trump's California rally with loaded guns, police say  —  The suspect, identified as Las Vegas resident Vem Miller was, apprehended by authorities about half-mile from entrance to Coachella rally  —  A man armed with guns and false press and VIP passes was apprehended … ",
    "url": "https://www.theguardian.com/us-news/2024/oct/13/las-vegas-man-arrested-trump-assassination-attempt-coachella-california"
  },
  {
    "text": "About those New York Times headlines  —  Twitter, which is what I prefer to call Elon Musk's disaster, is still interesting and useful at times, despite its decay.  —  And the other day, there was a dustup there over two New York Times headlines.  One was about Kamala Harris, the other about Donald Trump.",
    "url": "https://margaretsullivan.substack.com/p/about-those-new-york-times-headlines"
  },
  {
    "text": "‘Vile stuff’: NYT shamed by its own former public editor for whitewashing Trump racism  —  Former New York Times public editor Margaret Sullivan this week shamed her one-time employer for its coverage of the 2024 presidential election.  —  Writing on her Substack page … ",
    "url": "https://www.rawstory.com/trump-racism-2669387273/"
  },
  {
    "text": "Cheney doubts Johnson will carry out ‘constitutional obligations’ to certify election  —  Former Rep. Liz Cheney (R-Wyo.) said in a Sunday interview that she doubts House Speaker Mike Johnson (R-La.) will carry out “his constitutional obligations” to certify the 2024 election.",
    "url": "https://thehill.com/homenews/campaign/4931211-cheney-johnson-certify-2024-election/"
  },
  {
    "text": "Harris Suggests Trump Is ‘Weak and Unstable’ in Pointed Challenge  —  Kamala Harris asked why Donald J. Trump had not released his medical records, appeared on “60 Minutes” or agreed to a second debate.  —  Vice President Kamala Harris challenged former President Donald J. Trump on Sunday … ",
    "url": "https://www.nytimes.com/2024/10/13/us/politics/harris-trump-weak-and-unstable.html"
  },
  {
    "text": "Trump Wants the Military to Target Americans Who Oppose Him  —  The former president said he thinks U.S. troops should be deployed “if necessary” against “radical left lunatics” on election day  —  Donald Trump proposed deploying military forces against U.S. citizens who oppose him on election day.",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-military-target-americans-oppose-him-1235132806/"
  },
  {
    "text": "Hurricane recovery officials in N.C. relocated amid report of ‘armed militia,’ email shows  —  Safety fears are growing as misinformation collides with a large-scale federal recovery effort.  —  LAKE LURE, N.C. — Federal emergency response personnel on Saturday had employees operating … ",
    "url": "https://www.washingtonpost.com/weather/2024/10/13/federal-officials-nc-temporarily-relocated-amid-report-armed-militia-email-shows/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI4NzkyMDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzMwMTc0Mzk5LCJpYXQiOjE3Mjg3OTIwMDAsImp0aSI6ImVhZWZhZDUyLWFhY2EtNDc3Zi1iZDRlLWZkMzM1NmVjOTBjMiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS93ZWF0aGVyLzIwMjQvMTAvMTMvZmVkZXJhbC1vZmZpY2lhbHMtbmMtdGVtcG9yYXJpbHktcmVsb2NhdGVkLWFtaWQtcmVwb3J0LWFybWVkLW1pbGl0aWEtZW1haWwtc2hvd3MvIn0.BaGrTy9ZRxMPH9cxITvM1C18f2v862tZKRIZxsmtuSc&itid=gfta"
  },
  {
    "text": "Josh Hawley's Local Newspaper Declares Him the ‘Worst Sitting Senator’  —  NO CONFIDENCE  —  The St. Louis Post-Dispatch objected to Hawley's actions leading up to the Jan. 6 Capitol riots.  —  A local newspaper in Missouri wrote a scathing rebuke of the state's Sen. Josh Hawley … ",
    "url": "https://www.thedailybeast.com/st-louis-post-dispatch-names-josh-hawley-the-worst-sitting-senator"
  },
  {
    "text": "X blocked hacked JD Vance dossier links after the Trump campaign flagged it … The Presidential campaign of Donald Trump asked X to stop links to a story containing VP nominee JD Vance's hacked dossier from circulating before X chose to block them, reports The New York Times.",
    "url": "https://www.theverge.com/2024/10/13/24269234/x-blocked-jd-vance-dossier-after-trump-campaign-request"
  },
  {
    "text": "Meghan McCain's threat to Dems backfires as her dad's biographer issues warning of his own  —  Meghan McCain recently threatened Democrats by saying she might release what her father, John McCain, really thought about Vice President Kamala Harris.  But that threat backfired on Sunday.",
    "url": "https://www.rawstory.com/meghan-mccain-threat-backfired/"
  },
  {
    "text": "Trump disarmed a political landmine in refusing to release his tax returns  —  Despite the storm over the former president's refusal to disclose them in 2016 and 2020, the issue has gone quiet this year.  —  Former President Donald Trump was once harshly criticized for failing to release his tax returns … ",
    "url": "https://www.politico.com/news/2024/10/13/trump-hasnt-released-his-tax-returns-the-response-meh-00182874"
  },
  {
    "text": "Press Breaks Record For Worst Week of Coverage Ever  —  Welcome to our 10th edition of Corporate Media Fails.  Having done this for nine weeks now, I thought the Press couldn't surprise me anymore.  I was wrong.  —  After a long debate, here are the top 5 corporate media fails for this week, that everyone needs to see.",
    "url": "https://www.dworkinsubstack.com/p/press-breaks-record-for-worst-week"
  },
  {
    "text": "Project 2025 offers a chilling preview of Trump's autocratic plans for a second term  —  The plan would upend the rule of law, destabilize democracy, exacerbate climate change, increase poverty, jeopardize health care, increase inequality, weaken education, and benefit the very rich.",
    "url": "https://www.inquirer.com/opinion/editorials/inq2/trump-threat-project-2025-second-term-extreme-right-heritage-foundation-20241013.html"
  },
  {
    "text": "Internal polling memo has warning signs for Senate Republicans  —  Some races are tightening but other key pickup opportunities are moving in the wrong direction, according to a new round of polling from the Senate Leadership Fund.  —  The top GOP super PAC charged with flipping the Senate … ",
    "url": "https://www.politico.com/news/2024/10/13/senate-republican-poll-memo-00183570"
  },
  {
    "text": "‘Absolute chaos’ as ‘MAGA faithful were stranded’ in desert after California event: report  —  Donald Trump left his own followers, including elderly supporters, stranded in the desert after a rally in Southern California, according to reports.  —  Trump spoke in Coachella on Saturday … ",
    "url": "https://www.rawstory.com/trump-fans-stranded-desert-rally/"
  },
  {
    "text": "Statement by Pentagon Press Secretary Maj. Gen. Pat Ryder on the Deployment of a THAAD Battery to Israel  —  At the direction of the President, Secretary Austin authorized the deployment of a Terminal High-Altitude Area Defense (THAAD) battery and associated crew of U.S. military personnel … ",
    "url": "https://www.defense.gov/News/Releases/Release/Article/3934493/statement-by-pentagon-press-secretary-maj-gen-pat-ryder-on-the-deployment-of-a/"
  },
  {
    "text": "DeSantis misses post-hurricane meeting with Biden — again  —  It is the second time the president has been in the state in the last two weeks to view hurricane damage.  —  Ron DeSantis skipped meeting with Joe Biden on Sunday, the second time in as many weeks that the Republican governor … ",
    "url": "https://www.politico.com/news/2024/10/13/joe-biden-ron-desantis-hurricane-meeting-00183559"
  }
]