[
  {
    "text": "Hegseth had an unsecured internet line set up in his office to connect to Signal, AP sources say  —  Defense Secretary Pete Hegseth had an internet connection that bypassed the Pentagon's security protocols set up in his office to use the Signal messaging app on a personal computer … ",
    "url": "https://apnews.com/article/hegseth-signal-chat-dirty-internet-line-6a64707f10ca553eb905e5a70e10bd9d"
  },
  {
    "text": "Polygraph Threats, Leaks and Infighting: Pentagon Chaos Rattles Hegseth  —  Defense secretary has chastised top military officers and staffers as he seeks to quiet a storm he helped create  —  WASHINGTON—Defense Secretary Pete Hegseth was rattled.  —  Word had leaked that he was planning … ",
    "url": "https://www.wsj.com/politics/national-security/pete-hegseth-pentagon-fired-aides-cfa9e0d5?st=2DDS8u"
  },
  {
    "text": "Hegseth used Signal app connected to ‘dirty line’ on personal computer in Pentagon office: Sources  —  It was connected to the internet on an unsecured commercial line, sources said.  —  Secretary of Defense Pete Hegseth attends a meeting of the Eradicating Anti-Christian Bias Task Force … ",
    "url": "https://abcnews.go.com/Politics/hegseth-signal-app-connected-dirtly-line-computer-pentagon/story?id=121142551"
  },
  {
    "text": "Trump Directs Justice Dept. to Investigate ActBlue, Democrats' Cash Engine  —  The president ordered an inquiry into ActBlue, the main Democratic fund-raising platform, in his latest move using the government to target political opponents.  —  President Trump on Thursday directed … ",
    "url": "https://www.nytimes.com/2025/04/24/us/politics/trump-actblue-democrats.html"
  },
  {
    "text": "Trump to target Democratic fundraising powerhouse ActBlue with DOJ probe  —  President Donald Trump is slated to issue a memorandum on Thursday targeting ActBlue, the Democratic Party's main fundraising platform - taking aim at one of the key pillars of the financial infrastructure for Democratic candidates.",
    "url": "https://cnn.com/2025/04/24/politics/actblue-trump-memo-doj-probe/"
  },
  {
    "text": "Trump to target ActBlue in presidential memorandum  —  The action is expected to come Thursday.  —  In a shot at ActBlue, the left's major online donation platform, President Donald Trump plans to sign a presidential memorandum on Thursday cracking down on foreign contributions in American elections … ",
    "url": "https://www.politico.com/news/2025/04/24/trump-to-target-actblue-in-presidential-memorandum-00307251"
  },
  {
    "text": "Trump Tells Putin to ‘STOP!’  After Deadly Russian Attack on Kyiv  —  The attack, which killed at least 12 people, was the deadliest on Ukraine's capital in nearly a year.  President Trump called on President Vladimir V. Putin to “STOP!” in a post on social media.",
    "url": "https://www.nytimes.com/2025/04/24/world/europe/ukraine-kyiv-russia-attack.html"
  },
  {
    "text": "Trump pardons Nevada politician who paid for cosmetic surgery with funds to honor a slain officer  —  President Donald Trump has pardoned a Nevada Republican politician who was awaiting sentencing on federal charges that she used money meant for a statue honoring a slain police officer for personal costs, including plastic surgery.",
    "url": "https://apnews.com/article/trump-pardon-michele-fiore-nevada-fraud-cf56ef8b302b8111e47cf52d5a606d19"
  },
  {
    "text": "Elon Musk and DOGE's Savings May Be Erased by New Costs  —  An expert on the federal work force estimates that the speed and chaos of Mr. Musk's cuts to the bureaucracy will cost taxpayers $135 billion this fiscal year.  —  President Trump and Elon Musk promised taxpayers big savings … ",
    "url": "https://www.nytimes.com/2025/04/24/us/politics/musk-cuts.html?unlocked_article_code=1.CE8.vMmE.oMshBwTC3mC8&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "How Trump team turned a dinner invite into a crypto boon worth millions  —  Nearly two dozen crypto wallets acquired more than 100,000 $TRUMP meme coins, worth roughly $100 million, after its promoters said top buyers could join the president for dinner.  —  Buyers have poured tens of millions … ",
    "url": "https://www.washingtonpost.com/technology/2025/04/24/trump-trump-memecoin-cryto/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ1NDY3MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ2ODQ5NTk5LCJpYXQiOjE3NDU0NjcyMDAsImp0aSI6ImU2MzFmMjVlLTQ2NWYtNGJiZi05ZGYyLTQ3ODFiMzk0NGYzOCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS90ZWNobm9sb2d5LzIwMjUvMDQvMjQvdHJ1bXAtdHJ1bXAtbWVtZWNvaW4tY3J5dG8vIn0.twE8VExxCbf2pw4qfDwExNmPBhsGSNgyP24sMZeSoqE&itid=gfta"
  },
  {
    "text": "Judge halts parts of Trump's overhaul of US elections, including proof-of-citizenship requirement  —  A judge on Thursday blocked the Trump administration from immediately enacting certain changes to how federal elections are run, including adding a proof-of-citizenship requirement to the federal voter registration form.",
    "url": "https://apnews.com/article/trump-elections-executive-order-citizenship-lawsuit-4b683fe2e1106316fdb05621be9b7d0e"
  },
  {
    "text": "U.S. Sidelines Lawyers Who Doubted Their Own Case on Congestion Pricing  —  The Trump administration replaced lawyers who had exposed flaws in its legal battle over New York City's congestion pricing program.  —  The U.S. Department of Transportation on Thursday said it took the extraordinary step … ",
    "url": "https://www.nytimes.com/2025/04/24/nyregion/nyc-congestion-pricing-duffy-lawyers.html?unlocked_article_code=1.CE8.vgqL.VKDKYVyrggAf"
  },
  {
    "text": "Trump Lashes Out at Rupert Murdoch Over Fox News' ‘Trump Hating, Fake Pollster’ After Survey Reveals Record-Low Approval Ratings  —  President also calls on media mogul to make changes at Wall Street Journal: ‘It sucks’  —  President Trump is unhappy with Fox News Channel again … ",
    "url": "https://variety.com/2025/tv/news/trump-rupert-murdoch-fox-news-poll-record-low-approval-1236377066/"
  },
  {
    "text": "Controversial Hegseth chief of staff to leave Pentagon  —  Joe Kasper will continue to support and advise the Pentagon, he said, but as a special government employee.  —  Defense Secretary Pete Hegseth's controversial chief of staff, who played a central role in a recent power struggle … ",
    "url": "https://www.politico.com/news/2025/04/24/hegseth-chief-of-staff-pentagon-leaving-00308721"
  },
  {
    "text": "Federal Officials Promise to Restore Funding to Women's Health Initiative  —  Investigators had been informed that funding for the decades-long research effort would be slashed.  Officials said on Thursday evening that grants would be restored.  —  Following an outcry from scientists and health experts … ",
    "url": "https://www.nytimes.com/2025/04/24/health/womens-health-initiative-cuts.html?unlocked_article_code=1.CE8.2prR._hhjEWBLktfy&smid=nytcore-android-share"
  },
  {
    "text": "Exclusive: NSF director to resign amid grant terminations, job cuts, and controversy  —  “I have done all I can,” says Sethuraman Panchanathan, a Trump appointee who has led agency since 2020  —  The director of the National Science Foundation (NSF) announced his resignation today … ",
    "url": "https://www.science.org/content/article/nsf-director-resign-amid-grant-terminations-job-cuts-and-controversy"
  },
  {
    "text": "Trump officials consider shrinking 6 national monuments in the West  —  Interior Department officials are considering scaling back the boundaries of national monuments in the West to encourage energy development on public lands.  —  Trump officials are analyzing whether to remove federal protections … ",
    "url": "https://www.washingtonpost.com/climate-environment/2025/04/24/trump-national-monument-reductions-mining-oil/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ1NDY3MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ2ODQ5NTk5LCJpYXQiOjE3NDU0NjcyMDAsImp0aSI6ImQzOWVjOGMzLTZjNmItNDk5ZC04NDJiLTMxYTIyOWUwYWExNiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9jbGltYXRlLWVudmlyb25tZW50LzIwMjUvMDQvMjQvdHJ1bXAtbmF0aW9uYWwtbW9udW1lbnQtcmVkdWN0aW9ucy1taW5pbmctb2lsLyJ9.wP-Fnw4MScMLmpVidhArWpAqfbxFCGOsnZwfIe623K4&itid=gfta"
  },
  {
    "text": "Trump to be in third-tier seats at Pope's funeral  —  Arcane Vatican protocol suggests US president may have to settle for a place away from the limelight  —  Donald Trump may be the most famous person on the planet and leader of the free world, but he could be deeply disappointed when he sees … ",
    "url": "https://www.telegraph.co.uk/news/2025/04/24/trump-to-be-in-third-tier-seats-at-popes-funeral/"
  },
  {
    "text": "Slotkin is testing a ‘war plan’ to beat Trump.  She wants Dems to ditch wokeness and muscle up  —  The Michigan senator will give the first in a series of political speeches on Thursday.  —  Elissa Slotkin, the former CIA analyst turned battleground senator, will on Thursday start road-testing … ",
    "url": "https://www.politico.com/news/2025/04/24/slotkin-has-a-war-plan-to-beat-trump-dont-be-weak-and-woke-00308176"
  },
  {
    "text": "The Trump Victim I Can't Stop Thinking About  —  I understand why Kilmar Abrego Garcia has become the face of Donald Trump's monstrous policy of sending migrants to a gulag in El Salvador.  In a court filing, the administration's own lawyers initially admitted that his deportation was an … ",
    "url": "https://www.nytimes.com/2025/04/24/opinion/trump-el-salvador-makeup-artist.html?unlocked_article_code=1.CU8.9Zkg.GcAWP4Xh3YyP&smid=url-share"
  },
  {
    "text": "One of Trump's billionaire supporters has harsh words for the president about his trade war  —  Citadel CEO Ken Griffin, a billionaire supporter of President Donald Trump and a megadonor to Republican candidates, had some unusually harsh words for the president about his trade war … ",
    "url": "https://cnn.com/2025/04/24/business/ken-griffin-trump-trade-war-brand"
  },
  {
    "text": "If A.I. Systems Become Conscious, Should They Have Rights?  —  As artificial intelligence systems become smarter, one A.I. company is trying to figure out what to do if they become conscious.  —  One of my most deeply held values as a tech columnist is humanism.",
    "url": "https://www.nytimes.com/2025/04/24/technology/ai-welfare-anthropic-claude.html?https://www.nytimes.com/2025/04/24/technology/ai-welfare-anthropic-claude.html"
  },
  {
    "text": "Trump grants interview to The Atlantic's Jeffrey Goldberg despite Signal chat bombshell, past criticism  —  He has attacked The Atlantic editor for what he claims are false stories.  —  President Donald Trump waits for the arrival of Norway's Prime Minister Jonas Gahr Store to the White House on April 24, 2025.",
    "url": "https://abcnews.go.com/Politics/trump-meet-atlantics-jeffrey-goldberg-interview-despite-signal/story?id=121128726"
  },
  {
    "text": "Tuberville running for Governor of Alabama in 2026  —  U.S. Senator Tommy Tuberville (R-Auburn) is running for Governor of Alabama in 2026, according to reports confirmed by Yellowhammer News.  —  Back in state while Congress is in recess, Tuberville told a group of donors at a private event … ",
    "url": "https://yellowhammernews.com/tuberville-running-for-governor-of-alabama-in-2026/"
  },
  {
    "text": "Investigation into Unlawful “Straw Donor” and Foreign Contributions in American Elections  —  MEMORANDUM FOR THE SECRETARY OF THE TREASURY  —  THE ATTORNEY GENERAL THE COUNSEL TO THE PRESIDENT  —  Federal law (52 U.S.C. 30121 and 30122) strictly prohibits making political contributions … ",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/04/investigation-into-unlawful-straw-donor-and-foreign-contributions-in-american-elections/"
  },
  {
    "text": "Trump admin must seek return of another man who was improperly deported to El Salvador, judge rules  —  A Trump-appointed judge ruled that the administration deported a 20-year-old Venezuelan man last month in violation of a legally binding, court-approved settlement agreement.",
    "url": "https://www.politico.com/news/2025/04/24/trump-el-salvador-deportation-venezuelan-minor-judge-00307336"
  },
  {
    "text": "Hanoi denies Washington will snub Vietnam War commemoration  —  The Vietnamese government says it expects American officials to attend ceremonies, in spite of a US media report.  —  BANGKOK - The Vietnamese government says it is expecting a sizable U.S. presence when it marks the 50th anniversary … ",
    "url": "https://www.rfa.org/english/vietnam/2025/04/25/us-war-ceremony-snub/"
  },
  {
    "text": "Trump's Single Stroke of Brilliance  —  I've detested at least three-quarters of what the Trump administration has done so far, but it possesses one quality I can't help admiring: energy.  I don't know which cliché to throw at you, but it is flooding the zone, firing on all cylinders, moving rapidly on all fronts at once.",
    "url": "https://www.nytimes.com/2025/04/24/opinion/trump-administration-energy-strength-weakness.html"
  },
  {
    "text": "Alleged former members of neo-Nazi group claim its leader is Russian spy  —  Allegation against Rinaldo Nazzaro, founder of the Base, could shed new meaning on group's efforts inside Ukraine  —  Alleged former members of an international neo-Nazi terrorist organization are claiming … ",
    "url": "https://www.theguardian.com/us-news/2025/apr/24/neo-nazi-group-the-base-leader-russian-spy-allegations"
  },
  {
    "text": "Europe Really Is Jailing People for Online Speech  —  From Germany to Britain, citizens are now routinely targeted for what they say.  —  Please support the cause of free speech by becoming a paying subscriber for less than the cost of a cup of coffee a week!  —  Imagine this scenario.",
    "url": "https://yaschamounk.substack.com/p/europe-really-does-have-a-free-speech"
  },
  {
    "text": "21 Years Later, Deported Back to a ‘Home’ He Barely Knew  —  As Trump's deportation efforts get underway, I set out to answer two questions: What is it like to be deported from the United States?  And what is it like for deported immigrants to reintegrate into their home countries?",
    "url": "https://www.nytimes.com/2025/04/24/nyregion/deportation-trump-jamaica.html?unlocked_article_code=1.CE8.z8eo.YCyaeMxjC0be&smid=url-share"
  },
  {
    "text": "DNC chair rips vice chair David Hogg's plan to challenge incumbent Democrats  —  Democratic National Committee Chair Ken Martin said Thursday that party officers should be banned from taking sides in primaries, countering DNC Vice Chair David Hogg's plan to raise money for candidates challenging Democratic incumbents.",
    "url": "https://apnews.com/article/david-hogg-ken-martin-dnc-incumbents-challenge-17af67b0e56813e383cd3beef327e858"
  }
]