[
  {
    "text": "Jeff Flake endorses Kamala Harris for president: ‘I know of her character’  —  Former Republican Sen. Jeff Flake is endorsing Vice President Kamala Harris because of his conservative values — not in spite of them — he said Saturday in an interview announcing his support for the Democratic presidential nominee.",
    "url": "https://www.azcentral.com/story/news/politics/elections/2024/09/29/jeff-flake-endorses-kamala-harris-for-president/75421304007/"
  },
  {
    "text": "Trump falsely attacks Harris as ‘mentally impaired’ and ‘mentally disabled,’ prompting criticism  —  The remarks drew a rebuke from a group that advocates for people with disabilities.  —  Republican presidential nominee Donald Trump criticized Vice President Kamala Harris's mental capacity Saturday … ",
    "url": "https://www.washingtonpost.com/politics/2024/09/28/trump-harris-attacks-mentally-impaired-criticism/"
  },
  {
    "text": "Harris team quietly courts big-name GOP endorsements  —  Anti-Trump conservatives are serving as emissaries to bring prominent Republicans on board, hoping to influence rank-and-file voters.  —  As former congresswoman Liz Cheney repeatedly and publicly spoke out over the last year … ",
    "url": "https://www.washingtonpost.com/politics/2024/09/29/harris-campaign-courts-prominent-republican-endorsements/"
  },
  {
    "text": "Vance not allowed to campaign in Pittsburgh culinary landmark — despite Harris event at same restaurant chain  —  The vice presidential nominee met supporters outside instead after the restaurant said it wasn't told in advance about the campaign stop  —  Vice presidential candidate … ",
    "url": "https://www.foxnews.com/politics/vance-not-allowed-campaign-pittsburgh-culinary-landmark-despite-harris-event-same-restaurant-chain"
  },
  {
    "text": "Vance appears at event hosted by hard-right Christian nationalist  —  The live event was hosted by Lance Wallnau, who has blended hard-right politics with Christian supremacy and who has demonized Kamala Harris.  —  MONROEVILLE, Pa. — Republican vice-presidential candidate JD Vance appeared Saturday … ",
    "url": "https://www.washingtonpost.com/elections/2024/09/28/jd-vance-christian-nationalism-lance-wallnau/"
  },
  {
    "text": "JD Vance suffers latest campaign fail after being denied entry into restaurant  —  The incident occurred after the Republican vice presidential nominee turned up to Primanti Bros in North Versailles, Pennsylvania, and was denied entry  —  Your support helps us to tell the story",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/jd-vance-campaign-fail-restaurant-pennslvania-b2620651.html"
  },
  {
    "text": "CBS News says it will be up to Vance and Walz to fact-check each other in veep debate  —  CBS News, hosting vice presidential candidates JD Vance and Tim Walz for the general election campaign's third debate next week, says it will be up to the politicians — not the moderators — to check the facts of their opponents.",
    "url": "https://apnews.com/article/cbs-debate-vice-president-fact-check-7a3b31c98ab092dd44915df57a359d10"
  },
  {
    "text": "Early Voting Begins.  Republicans Don't Want to Be Left Behind.  —  Both parties want your vote ASAP, though Trump continues to send mixed messages  —  The first wave of presidential ballots is in the mail, and Republican and Democratic officials alike have a plea for voters: Don't wait for Election Day.",
    "url": "https://www.wsj.com/politics/elections/early-voting-campaigns-election-2024-a4a1b9bb"
  },
  {
    "text": "UK MP Quits Labour Slamming ‘Staggering Hypocrisy’ Under Starmer  — Duffield says sleaze, nepotism, avarice are ‘off the scale’  — Resignation exposes rifts in Labour months after election win  —  A Member of Parliament quit the UK's governing Labour Party, unleashing a deeply personal attack … ",
    "url": "https://www.bloomberg.com/news/articles/2024-09-29/uk-mp-quits-labour-slamming-staggering-hypocrisy-under-starmer"
  },
  {
    "text": "Her trans daughter made the volleyball team.  Then an armed officer showed up.  —  Jessica Norton eased her minivan out of the driveway, and she told herself she'd done what any mother would.  Her daughter Elizabeth had wanted to play high school volleyball, and Norton had let her.",
    "url": "https://www.washingtonpost.com/nation/interactive/2024/trans-sports-girls-florida-bans/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI3NDk2MDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI4ODc4Mzk5LCJpYXQiOjE3Mjc0OTYwMDAsImp0aSI6IjM0MzMzMGZhLWNiMGMtNDdlZi04OTM2LTg3ZGE3MzUyNjJkYyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb24vaW50ZXJhY3RpdmUvMjAyNC90cmFucy1zcG9ydHMtZ2lybHMtZmxvcmlkYS1iYW5zLyJ9.avVZKJ17-2OOoHgK-Svb1curhHBAq0Nij-A9rsUIKAc&itid=gfta"
  },
  {
    "text": "Federal Judge Strikes Down Key Provision of Texas' Omnibus Voter Suppression Law  —  A federal judge struck down a key provision of Texas' 2021 omnibus voter suppression legislation, Senate Bill 1, after finding that certain aspects of the statute impose unconstitutional and unlawful burdens on marginalized groups of voters.",
    "url": "https://www.democracydocket.com/news-alerts/federal-judge-strikes-down-key-provision-of-texas-omnibus-voter-suppression-law/"
  },
  {
    "text": "‘Border czar’ Kamala Harris panned for wearing reported $62K necklace to southern border: ‘You look ridiculous’  —  The border crisis has been an albatross around Kamala Harris' neck — and now her jewelry is too.  —  The Democratic presidential nominee was snapped Friday at the southern border in Arizona … ",
    "url": "https://nypost.com/2024/09/28/us-news/border-czar-kamala-harris-wears-reported-62k-necklace-to-southern-border/"
  },
  {
    "text": "Trump's $100,000 Watches: A Gateway for Illicit Financial Flows?  —  As the U.S. election draws near, Donald Trump's introduction of a “luxury” watch priced at $100,000 raises more than eyebrows—it sparks serious concerns about potential loopholes for financial misconduct.  Trump's grifts these days are endless.",
    "url": "https://www.meidasplus.com/p/trumps-100000-watches-a-gateway-for"
  },
  {
    "text": "Florida congressional candidate charged with threatening to kill primary opponent  —  The Justice Department revealed an indictment Friday that said William Robert Braddock III, of St. Petersburg, Fla., had threatened to kill his opponent in a 2022 primary.  —  The Justice Department revealed … ",
    "url": "https://www.nbcnews.com/politics/justice-department/florida-congressional-candidate-charged-threatening-kill-primary-oppon-rcna173144"
  }
]