[
  {
    "text": "JD Vance says school shootings are a ‘fact of life,’ calls for better security  —  School shootings are a “fact of life,” so the U.S. needs to harden security to prevent more carnage like the shooting this week that left four dead in Georgia, Republican vice presidential nominee JD Vance said Thursday.",
    "url": "https://apnews.com/article/jd-vance-georgia-shooting-7d7727a1aff8491f66914a4d8a14cd8c"
  },
  {
    "text": "JD Vance says school shootings are a “fact of life”  —  Bucking a question on gun control, Vance argued more school security, not reasonable gun restrictions, were needed  —  Republican Vice Presidential nominee JD Vance said that school shootings were simply a “fact of life” … ",
    "url": "https://www.salon.com/2024/09/05/jd-vance-says-school-are-a-fact-of-life/"
  },
  {
    "text": "Trump deputy campaign manager identified in Arlington National Cemetery dustup  —  One of two staffers involved in the altercation at Arlington National Cemetery is a deputy campaign manager for Donald Trump's reelection bid, NPR has learned.  The former president insisted this week the incident … ",
    "url": "https://www.npr.org/2024/09/05/nx-s1-5101991/trump-campaign-arlington-national-cemetery-staff-debate"
  },
  {
    "text": "The father of the Georgia school shooting suspect has been arrested and charged, authorities say  —  The father of the Apalachee High School shooting suspect has been arrested in connection with the shooting that left four people dead, according to the Georgia Bureau of Investigation.",
    "url": "https://www.cnn.com/2024/09/05/us/winder-georgia-shooting-apalachee-high-school"
  },
  {
    "text": "Hunter Biden enters shock guilty plea in $1.4M tax evasion case, first son facing up to 17 years in prison  —  LOS ANGELES — He's the first son — and twice convicted.  —  For the second time in three months, Hunter Biden was convicted of federal charges after he unexpectedly copped … ",
    "url": "https://nypost.com/2024/09/05/us-news/hunter-biden-plans-to-plead-guilty-in-1-4m-federal-tax-evasion-trial/"
  },
  {
    "text": "Russia's useful idiots  —  The MAGA influencer ecosystem is even shadier than we thought. … On Wednesday, the Department of Justice indicted two employees of RT, formerly Russia Today, a Russian state-run media outlet, for covertly shoveling millions of dollars at MAGA influencers happy to do Russia's bidding.",
    "url": "https://www.publicnotice.co/p/russia-indictment-tim-pool-benny-johnson-rubin"
  },
  {
    "text": "White House condemns Tucker Carlson's ‘Nazi propaganda’ interview as ‘disgusting and sadistic insult’  —  New York CNN  —  The Biden administration is denouncing Tucker Carlson after the far-right personality hosted a guest on his show this week who suggested the Holocaust happened by accident … ",
    "url": "https://www.cnn.com/2024/09/05/media/white-house-condemns-tucker-carlson-nazi-propaganda-interview/"
  },
  {
    "text": "Harris abandons 2019 pledge to ban plastic straws … - “I think we should,” she said. … - “She doesn't support banning plastic straws,” a campaign official told Axios.  — “She cast the tie-breaking vote on the most consequential legislation to combat climate change and create clean energy jobs … ",
    "url": "https://www.axios.com/2024/09/05/kamala-harris-plastic-straw-ban"
  },
  {
    "text": "Vance: John McCain wouldn't support Harris if he saw the border  —  “I really don't believe that,” the Republican vice presidential nominee said.  —  Republican vice presidential nominee JD Vance said on Thursday from Arizona that he does not believe former Sen. John McCain … ",
    "url": "https://www.politico.com/news/2024/09/05/vance-mccain-arizona-harris-00177643"
  },
  {
    "text": "Harris's Huge Cash Edge Means Less Need for Her to Headline Fundraisers  —  Vice president raised $361 million in August and ended month with more than $400 million in the bank, giving her an advantage over Donald Trump  —  WASHINGTON—Vice President Kamala Harris's prolific fundraising … ",
    "url": "https://www.wsj.com/politics/elections/harriss-huge-cash-edge-means-less-need-for-her-to-headline-fundraisers-1654aff0"
  },
  {
    "text": "Trump's federal election prosecution isn't going to trial anytime soon.  But it could still produce damaging revelations before Nov. 5.  —  A new schedule from Judge Tanya Chutkan leaves the door open for an October surprise.  —  Special counsel Jack Smith and Donald Trump … ",
    "url": "https://www.politico.com/news/2024/09/05/trump-federal-election-case-chutkan-schedule-00177619"
  },
  {
    "text": "Navy Secretary Broke Law With Trump-Bashing, Pro-Biden Comments: Watchdog  —  Carlos Del Toro's comments while on official duty overseas violated the Hatch Act, said the U.S. Office of Special Counsel.  —  LOADING  —  Navy Secretary Carlos Del Toro broke the law by publicly endorsing … ",
    "url": "https://www.huffpost.com/entry/navy-secretary-hatch-act_n_66dae860e4b0abbb7b447dd2"
  },
  {
    "text": "Stop letting right wing influencers cosplay as ‘independent’ media  —  We need to know who is funding the creator economy  —  Yesterday, a federal indictment revealed that a Tennessee media company working with right-wing influencers including Benny Johnson, Tim Pool, Dave Rubin … ",
    "url": "https://taylorlorenz.substack.com/p/we-need-to-know-who-is-funding-the"
  },
  {
    "text": "U.S. labor market cools again in August, adding 142,000 jobs … - The report also shows notable revisions for months past: The economy added just 89,000 jobs in July—25,000 fewer than initially thought.  — June's gains were revised down by 61,000 to 118,000.",
    "url": "https://www.axios.com/2024/09/06/jobs-report-august-2024-economy-unemployment"
  },
  {
    "text": "Physician sentenced to 9 months in prison for punching police officer during Capitol riot  —  A Massachusetts medical doctor who punched a police officer during a mob's attack on the U.S. Capitol was sentenced Thursday to nine months of imprisonment followed by nine months of home confinement.",
    "url": "https://apnews.com/article/jacquelyn-starer-doctor-massachusetts-capitol-riot-76190db8a354c339776f3e1c8169306a"
  },
  {
    "text": "‘A huge mistake’: Trump's crypto allies cringe over family's startup  —  The crypto venture is attracting what appear to be hacks and attempted scams ahead of its launch.  —  Donald Trump's sons want to turn their father's growing bromance with the cryptocurrency industry into the new family business.",
    "url": "https://www.politico.com/news/2024/09/06/trump-family-crypto-startup-00177566"
  },
  {
    "text": "Whoops: Report That Harris Team Regrets Not Picking Shapiro, As Nate Silver Has More Bad News for Them  —  As we reported, that honeymoon for Kamala Harris is looking like it might be over as the American people take a better look at her and her running mate, Tim Walz.",
    "url": "https://redstate.com/nick-arama/2024/09/05/whoops-sounds-like-harris-people-are-regretting-picking-walz-as-nate-silver-has-more-bad-news-for-them-n2178952"
  },
  {
    "text": "Eighty-eight corporate leaders endorse Harris in new letter, including CEOs of Yelp, Box  —  @IN/MEGAN-CASSELLA-BA02A160/ @MMCASSELLA  — Eighty-eight corporate leaders signed a new letter Friday endorsing Vice President Kamala Harris for president.  — Signers include former 21st … ",
    "url": "https://www.cnbc.com/2024/09/06/harris-endorsed-trump-murdoch-yelp-snap-ripple.html"
  },
  {
    "text": "FBI raids homes of top aides to New York City Mayor Eric Adams  —  The two deputy mayors are the highest-ranking Adams administration officials yet to be ensnared in the federal probe into Adams' 2021 campaign.  —  NEW YORK — Federal authorities have raided the homes of two of New York City Mayor Eric Adams … ",
    "url": "https://www.politico.com/news/2024/09/05/fbi-new-york-city-mayor-eric-adams-00177536"
  },
  {
    "text": "Trump Can't Get Himself Out of the Abortion Straitjacket  —  Donald Trump is stuck.  —  He is a brutally transactional politician who represents a coalition of ideologues.  His instinct is to promise the moon, and he'll say anything to get a vote — or just to get out of a room.",
    "url": "https://www.nytimes.com/2024/09/06/opinion/trump-dobbs-abortion.html"
  },
  {
    "text": "Did the media learn nothing from its disastrous coverage of Trump and Clinton in 2016?  —  The press is still pursuing the appearance of fairness by treating the true and the false, normal and outrageous, as equally valid  —  The first thing to say about the hate and scorn currently directed … ",
    "url": "https://www.theguardian.com/commentisfree/article/2024/sep/06/trump-clinton-harris-election"
  }
]