[
  {
    "text": "First on CNN: Federal prosecutors file new criminal case against Hunter Biden  —  Federal prosecutors have filed a new criminal case against Hunter Biden, people briefed on the matter said.  —  The exact nature of the charges couldn't immediately be learned because court documents have not been made public.",
    "url": "https://www.cnn.com/2023/12/07/politics/hunter-biden-criminal-case/"
  },
  {
    "text": "Hunter Biden faces new indictment in California  —  President Biden's son Hunter Biden was indicted in California Thursday on a litany of tax charges, according to documents made public.  —  The indictment Hunter Biden's failure to pay nearly $200,000 of income tax in the year 2019.",
    "url": "https://www.foxnews.com/politics/hunter-biden-faces-new-indictment-california"
  },
  {
    "text": "New charges against Hunter Biden expected Thursday  —  The president's son was previously indicted on federal gun charges in September.  —  Hunter Biden has been indicted on nine tax-related charges, including three felony counts, according to court documents filed Thursday in a federal court in Los Angeles.",
    "url": "https://www.nbcnews.com/politics/white-house/hunter-biden-charged-rcna128658"
  },
  {
    "text": "Penn loses $100 million donation over antisemitism hearing  —  A wealthy donor to the University of Pennsylvania is withdrawing a gift worth around $100 million in protest of the school's response to antisemitism on campus.  —  The big picture: The final straw for Ross Stevens … ",
    "url": "https://www.axios.com/2023/12/07/upenn-antisemitism-magill-100-million-donation"
  },
  {
    "text": "UPenn board chair expected to speak with president Liz Magill about stepping down  —  New York CNN  —  The University of Pennsylvania's board of trustees held an emergency meeting Thursday as school president Liz Magill faces scathing criticism over her performance at a House hearing earlier this week.",
    "url": "https://www.cnn.com/2023/12/07/business/penn-emergency-meeting-liz-magill/"
  },
  {
    "text": "Wharton board calls on Penn president Liz Magill to resign  —  University of Pennsylvania President Liz Magill is being asked to resign by the board of Penn's Wharton business school, according to a letter obtained by Axios. … - Earlier today, Axios reported that a wealthy donor pulled … ",
    "url": "https://www.axios.com/2023/12/08/penn-antisemitism-wharton-magill-resign"
  },
  {
    "text": "North Dakota senator's son charged with manslaughter after officer killed in police chase  —  Sen. Kevin Cramer's son, Ian Cramer, was charged in connection with a police chase on Wednesday that led to the death of a sheriff's deputy in Mercer County, North Dakota.",
    "url": "https://www.nbcnews.com/politics/politics-news/north-dakota-senators-son-charged-manslaughter-police-chase-killed-off-rcna128653"
  },
  {
    "text": "Sen. Kevin Cramer's son charged with manslaughter  —  Sen. Kevin Cramer's (R-N.D.) son was charged with manslaughter on Thursday after he killed a North Dakota sheriff's deputy in a car wreck Wednesday evening, according to local police.  —  Police said Ian Cramer, 42 … ",
    "url": "https://thehill.com/regulation/court-battles/4348521-kevin-cramer-son-manslaughter/"
  },
  {
    "text": "What Jack Smith Says  —  Jack Smith has filed his 404(b) notice, advising the Court and Trump of other crimes and bad acts committed by Trump that he intends to offer as evidence when the D.C. election interference case goes to trial.  The notice is nine pages long, you can read the whole thing here.",
    "url": "https://joycevance.substack.com/p/what-jack-smith-says"
  },
  {
    "text": "Alan Hostetter, ex-police chief who brought hatchet to Capitol on Jan. 6, sentenced to 11 years in prison  —  A former California police chief who brought a hatchet to the Capitol on Jan. 6, 2021, has been sentenced to more than 11 years in prison for his role in the siege.",
    "url": "https://www.cbsnews.com/news/alan-hostetter-sentenced-january-6-capitol-attack-11-years/"
  },
  {
    "text": "N.Y. appeals court upholds Judge Engoron's ruling that Trump committed ‘widespread fraud’  —  Former President Donald Trump was dealt a major blow by the New York Court of Appeals on Thursday in the midst of his ongoing civil fraud trial in the Empire State.",
    "url": "https://www.rawstory.com/trump-organization-fraud-2666475449/"
  },
  {
    "text": "Albany Police: Man fired gun outside Temple Israel, told officers ‘Free Palestine’  —  One person investigated for shooting at Temple Israel  —  One person investigated for shooting at Temple Israel  —  A 28-year-old man is accused of firing shots on the grounds of Temple Israel and yelling “Free Palestine” before he was arrested.",
    "url": "https://wnyt.com/top-stories/albany-police-man-fired-shotgun-outside-temple-israel/"
  },
  {
    "text": "Texas progressive group previously bailed out suspect charged in deadly Austin, San Antonio shooting rampage  —  Shane James, 34, previously served as a U.S. Army infantry officer before he was discharged in August 2015, the Army said  —  A suspect accused of six murders across Texas during … ",
    "url": "https://www.foxnews.com/politics/texas-progressive-group-previously-bailed-suspect-charged-deadly-austin-san-antonio-shooting-rampage?intcmp=tw_fnc"
  },
  {
    "text": "Why Fundamentalists Love Trump  —  I just finished reading Tim Alberta's masterly new book, “The Kingdom, the Power, and the Glory: American Evangelicals in an Age of Extremism.”  It's a powerful and emotionally resonant account of the transformation in evangelical politics that has brought us … ",
    "url": "https://www.nytimes.com/2023/12/07/opinion/donald-trump-fundamentalists-evangelical.html"
  },
  {
    "text": "White Supremacists Are Celebrating Vivek Ramaswamy's ‘Great Replacement’ Rant  —  Presidential candidate Vivek Ramaswamy boosted multiple far-right conspiracy theories during the GOP debate on Wednesday night, in a dangerous mainstreaming of once-fringe claims.",
    "url": "https://www.wired.com/story/vivek-ramaswamy-debate-great-replacement-theory-conspiracy/"
  },
  {
    "text": "MAGA rioter punched woman ‘in the throat’ after his sexual advances were denied: Feds  —  Federal prosecutors are arguing that a North Carolina man charged in connection with the January 6 Capitol attack should await trial in jail because he allegedly instigated a bar fight after a woman rejected him … ",
    "url": "https://www.rawstory.com/maga-rioter-punched-woman-in-the-throat-after-his-advances-were-denied-feds/"
  },
  {
    "text": "RNC Fourth Presidential Primary Debate 12/06/23 Transcript  —  RNC Fourth Presidential Primary Debate 12/06/23.  Read the transcript here.  —  Transcribe Your Own Content  —  Welcome to the fourth and final Republican Presidential Primary Debate of the Year live from the University of Alabama.",
    "url": "https://www.rev.com/blog/transcripts/rnc-fourth-presidential-primary-debate-12-06-23-transcript"
  },
  {
    "text": "Democrats eye Montana abortion ballot measure to boost Tester  —  Democrat-aligned groups are working to put a state constitutional amendment protecting abortion rights on Montana's ballot next year, a move that would boost embattled Democratic Sen. Jon Tester's re-election bid.",
    "url": "https://www.axios.com/2023/12/08/montana-abortion-law-rights-state-constitution-amendment"
  },
  {
    "text": "Police have recovered video of Florida GOP chair and alleged victim in rape investigation  —  Disclaimer: This story contains explicit sexual content and details involving an alleged sexual assault.  —  Sarasota police have recovered a cell phone video taken by Florida GOP chairman Christian Ziegler … ",
    "url": "https://flcga.org/police-have-recovered-video-of-florida-gop-chair-and-alleged-victim-in-rape-investigation/"
  },
  {
    "text": "Marking start of Hanukkah, Emhoff condemns antisemitism, says Biden and Harris ‘have your back’  —  WASHINGTON (AP) — Speaking at the lighting ceremony of a massive menorah in front of the White House to mark the first night of Hanukkah, Doug Emhoff, the husband of Vice President Kamala Harris … ",
    "url": "https://apnews.com/article/hanukkah-emhoff-harvard-antisemitism-college-menorah-4d0b8aa2c33f0793e408261ca4778b0f"
  },
  {
    "text": "DeSantis Super PAC Cancels Donor Event Citing Waning Interest  — About 3,000 supporters were invited to attend Alabama event  — Scrapped fundraiser follows Never Back Down leadership changes  —  The super political action committee backing Florida Governor Ron DeSantis' presidential bid canceled … ",
    "url": "https://www.bloomberg.com/news/articles/2023-12-07/desantis-super-pac-cancels-donor-event-in-alabama-on-lack-of-interest"
  },
  {
    "text": "Fetterman says if we want peace, Israel needs to be able to destroy Hamas  —  PITTSBURGH — Sen. John Fetterman (D-PA) has emerged as one of the most reliable supporters of the Jewish community in his hometown, which is located a handful of miles from where the deadliest massacre of Jews happened … ",
    "url": "https://www.washingtonexaminer.com/opinion/columnists/fetterman-says-israel-needs-to-be-able-to-destroy-hamas"
  },
  {
    "text": "Fetterman defends ‘reasonable’ border talks as fellow Dems fume  —  The Pennsylvania progressive's comments follow his staunch support for Israel's war in Gaza, which has also befuddled some of his typical allies on the left.",
    "url": "https://www.politico.com/live-updates/2023/12/07/congress/fetterman-on-border-00130639"
  }
]