[
  {
    "text": "The Jolt: Marjorie Taylor Greene blasts Kemp and floats VP, Senate bids  —  Since Fulton County District Attorney Fani Willis indicted former President Donald Trump for interfering in Georgia's 2020 election, U.S. Rep. Marjorie Taylor Greene has been on the attack.The conservative firebrand … ",
    "url": "https://www.ajc.com/politics/politics-blog/the-jolt-marjorie-taylor-greene-blasts-kemp-and-floats-vp-senate-bids/YKTNGG7QRJDBTH4RSVTV37PZPI/"
  },
  {
    "text": "What debate?  Trump could time his Georgia arrest to blot out first matchup  —  Allies say lining up his surrender with the first debate would be a wise political decision.  But those aligned with his rivals say Trump won't be able to overshadow the contest.",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-arrest-debate-rcna100090"
  },
  {
    "text": "Americans are divided along party lines over Trump's actions in election cases, AP-NORC poll shows  —  Donald Trump and 18 allies have been indicted in Georgia over efforts to overturn his 2020 election loss in the state.  There is no shortage of logistical challenges raised by the sprawling racketeering indictment.",
    "url": "https://apnews.com/article/trump-indictment-poll-georgia-elections-b6140eed88b3153e41dbf9e008d5a21b"
  },
  {
    "text": "Trump supporters post names and addresses of Georgia grand jurors online  —  A fringe website featured the purported names and addresses of the Fulton County grand jury that indicted Trump and 18 others for their efforts to overturn the 2020 election.  —  ATLANTA — The purported names … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/names-addresses-grand-jurors-georgia-trump-indictment-posted-online-rcna100239"
  },
  {
    "text": "Majority Of Americans Say Trump Should Be Prosecuted On Federal Criminal Charges Linked To 2020 Election, Quinnipiac University National Poll Finds; DeSantis Slips, Trump Widens Lead In GOP Primary  —  mail_outline  —  In the wake of a federal indictment accusing former President Donald Trump … ",
    "url": "https://poll.qu.edu/poll-release?releaseid=3877"
  },
  {
    "text": "DeSantis slips to lowest level of support in Quinnipiac 2024 polling  —  Florida Gov. Ron DeSantis's support in the Republican presidential primary slipped to its lowest level this year, according to a new Quinnipiac University national poll released Wednesday.",
    "url": "https://thehill.com/homenews/campaign/4155446-desantis-slips-to-lowest-level-of-support-in-quinnipiac-2024-polling/"
  },
  {
    "text": "Santos Aide Who Impersonated McCarthy Staff Member Faces Federal Charges  —  The aide, Samuel Miele, was accused of impersonating the staff member in fund-raising appeals and was charged with wire fraud and identity theft.  —  A campaign associate of Representative George Santos … ",
    "url": "https://www.nytimes.com/2023/08/16/nyregion/sam-miele-charged-george-santos.html"
  },
  {
    "text": "Unmasking the Co-Conspirators in Trump's Georgia Indictment  —  Trump's latest indictment includes 18 co-defendants and 30 unindicted co-conspirators.  Here's our attempt at figuring out as many as possible. … Donald Trump's fourth indictment is, on almost every level … ",
    "url": "https://www.thedailybeast.com/who-are-trumps-unindicted-co-conspirators-in-georgia-we-unmask-them"
  },
  {
    "text": "The ‘brains’ behind fake Trump electors was once a liberal Democrat  —  Kenneth Chesebro, a Harvard-trained lawyer, may be the least well known of the main players in Trump's federal and Georgia indictments  —  VEGA ALTA, Puerto Rico — The blinds were drawn at a handsome villa … ",
    "url": "https://www.washingtonpost.com/national-security/2023/08/16/kenneth-cheseboro-trump-indictment-fake-electors/"
  },
  {
    "text": "US appeals court rules to restrict abortion pill use  —  A U.S. appeals court ruled on Wednesday to restrict access to the abortion pill mifepristone, partially upholding a lower court ruling that alarmed abortion advocates and pharmaceutical companies.  —  The New Orleans-based 5th U.S. Circuit Court … ",
    "url": "https://www.reuters.com/world/us/us-appeals-court-rules-restrict-abortion-pill-use-2023-08-16/"
  },
  {
    "text": "Appeals court embraces abortion-pill limits, sets up Supreme Court review  —  The Supreme Court has ruled that mifepristone, a key abortion drug, will remain available for now under existing rules while litigation continues  —  A federal appeals court on Wednesday said it would restrict access … ",
    "url": "https://www.washingtonpost.com/politics/2023/08/16/abortion-pill-mifepristone-court-ruling-appeal/"
  },
  {
    "text": "Fulton County district attorney wants Trump trial to begin March 4, 2024  —  Fulton County District Attorney Fani Willis has asked a judge to set a trial date of March 4, 2024, for former President Donald Trump and his 18 co-defendants.  —  Willis also asked to schedule arraignments … ",
    "url": "https://www.cnn.com/2023/08/16/politics/trump-trial-request-march-4/"
  },
  {
    "text": "GOP lawmaker apologizes for ‘religious freedom’ tweet  —  A Republican lawmaker apologized Tuesday for a “religious freedom” tweet he posted earlier that day after receiving backlash from both sides of the aisle.  —  Rep. Max Miller (R-Ohio) asked Lizzie Marbach, director of communications … ",
    "url": "https://thehill.com/homenews/house/4155171-gop-lawmaker-apologizes-for-religious-freedom-tweet/"
  },
  {
    "text": "Sinema takes on Schumer, Jeffries and the White House over the border  —  Border-state Democrats are frustrated to see New York claim most of a recent migrant relief infusion.  But Arizona's formerly Democratic senator is speaking out the loudest.  —  When the Biden administration doled … ",
    "url": "https://www.politico.com/news/2023/08/16/sinema-takes-on-schumer-jeffries-border-00111355"
  },
  {
    "text": "Liberal Dark Money Behemoth Faces IRS Complaint Over Alleged Bait-And-Switch Scheme  —  A watchdog group is asking the IRS to investigate the liberal dark money behemoth Arabella Advisors following a Washington Free Beacon report on the shadowy organization.",
    "url": "https://freebeacon.com/democrats/liberal-dark-money-behemoth-faces-irs-complaint-over-alleged-bait-and-switch-scheme/"
  },
  {
    "text": "Ohio Secretary of State Frank LaRose fires press secretary over tweets criticizing Trump  —  The dismissal of Rob Nichols comes as LaRose seeks Trump's endorsement in a competitive GOP Senate primary.  —  CLEVELAND — An official spokesperson for Ohio Secretary of State Frank LaRose is out of a job … ",
    "url": "https://www.nbcnews.com/meet-the-press/meetthepressblog/ohio-secretary-state-frank-larose-fires-press-secretary-tweets-critici-rcna100222"
  },
  {
    "text": "Pakistan crowd vandalises churches, torches homes after blasphemy accusation  —  A Muslim crowd attacked a Christian community in eastern Pakistan on Wednesday, vandalising several churches and setting scores of houses on fire after accusing two of its members of desecrating the Koran, police and community leaders said.",
    "url": "https://www.reuters.com/world/asia-pacific/pakistani-christian-community-attacked-after-blasphemy-accusation-police-2023-08-16/"
  }
]