[
  {
    "text": "Senate Version of Trump's Policy Bill Would Slash Medicaid Spending Even More  —  Analysis from the nonpartisan Congressional Budget Office found that Republicans' new version of the legislation would make far deeper cuts and lead to more people becoming uninsured than previous proposals.",
    "url": "https://www.nytimes.com/2025/06/29/us/politics/trump-policy-bill-health-insurance-cuts.html?unlocked_article_code=1.Sk8.Z70s.6Fin2_Yt0XQQ&smid=re-share"
  },
  {
    "text": "Senate's “big, beautiful bill” would add $3.3 trillion in new debt: CBO  —  The Senate reconciliation package being debated this weekend would add nearly $3.3 trillion in budget deficits over the next 10 years, according to a new estimate by the Congressional Budget Office (CBO).",
    "url": "https://www.axios.com/2025/06/29/senate-big-beautiful-bill-deficits-debt"
  },
  {
    "text": "Senate rulekeeper deals blows to revised ‘Big, beautiful bill’  —  A Medicaid carveout for Alaska was among the “Byrd bath” casualties.  —  The Senate's rewritten domestic policy bill faces new hurdles after the parliamentarian advised senators Sunday that several provisions violate … ",
    "url": "https://www.politico.com/news/2025/06/29/megabill-byrd-alaska-megabill-parliamentarian-00431730"
  },
  {
    "text": "A $1 Trillion Medicaid Cut Is THIS Close to Happening.  Here's What It'd Look Like.  —  ENID RODRIGUEZ KNOWS WHAT A DIFFERENCE Medicaid can make, because it's made a huge difference for her.  —  Rodriguez, 51, has been working for pretty much her entire life—first in organizations … ",
    "url": "https://www.thebulwark.com/p/medicaid-cuts-republicans-severing-lifeline-north-carolina"
  },
  {
    "text": "How the G.O.P. Bill Saves Money: Paperwork, Paperwork, Paperwork  —  Instead of directly reducing benefits for the poor, Republicans are making them harder to get and to keep.  —  Low-income Americans would lose health coverage and government food assistance on an unprecedented scale under … ",
    "url": "https://www.nytimes.com/2025/06/29/upshot/republicans-medicaid-cuts-paperwork.html?unlocked_article_code=1.Sk8.42Eb.FOClm95vHJAO&smid=nytcore-ios-share&referringSource=articleShare&sgrp=c-cb"
  },
  {
    "text": "Intercepted call of Iranian officials downplays damage of U.S. attack  —  The officials were heard saying Trump's strike on Iran proved less devastating than expected.  The administration calls the intelligence insignificant.",
    "url": "https://www.washingtonpost.com/national-security/2025/06/29/trump-iran-nuclear-damage-intercepted-call/"
  },
  {
    "text": "Iran could restart enriching uranium in months, says nuclear watchdog chief  —  Comments by IAEA's Rafael Grossi follow week of conflicting claims about damage done by US and Israeli strikes  —  Iran could be able to start producing enriched uranium again “in a matter of months” … ",
    "url": "https://www.ft.com/content/b639c6ab-49ac-438c-9a3c-dfda75b2f4dd"
  },
  {
    "text": "Sen. Thom Tillis won't run for reelection in 2026  —  Sen. Thom Tillis won't run for re-election in 2026, the North Carolina Republican announced Sunday. … - “It's not a hard choice, and I will not be seeking re-election,” Tillis said in a statement announcing his plans.",
    "url": "https://www.axios.com/2025/06/29/thom-tillis-retire-senate-north-carolina"
  },
  {
    "text": "GOP Sen. Thom Tillis says he's not running for re-election in North Carolina  —  The announcement comes one day after Tillis voted against advancing a massive bill for Trump's agenda in the Senate.  —  WASHINGTON — Sen. Thom Tillis, R-N.C., announced Sunday that he would not run for re-election … ",
    "url": "https://www.nbcnews.com/politics/2026-election/gop-sen-thom-tillis-not-running-re-election-north-carolina-rcna215819"
  },
  {
    "text": "Zohran Mamdani doubles down on plan to target ‘whiter neighborhoods’ with higher taxes — and says billionaires shouldn't exist  —  Socialist New York City mayoral candidate Zohran Mamdani doubled down Sunday on his plan to jack up property taxes on “richer and whiter neighborhoods” — while asserting billionaires shouldn't exist.",
    "url": "https://nypost.com/2025/06/29/us-news/zohran-mamdani-doubles-down-on-plan-to-target-richer-and-whiter-neighborhoods/"
  },
  {
    "text": "Tim Walz eulogizes slain lawmaker as a historic Minnesotan — and friend  —  Minnesota Gov. Tim Walz sat in a front pew during Melissa and Mark Hortman's funeral alongside former president Joe Biden and former vice president Kamala Harris.  —  Scores of mourners tearfully bid farewell … ",
    "url": "https://www.washingtonpost.com/nation/2025/06/28/melissa-hortman-minnesota-funeral-boetler/"
  },
  {
    "text": "How Zohran Mamdani Brought New Voters to the Polls  —  Mr. Mamdani, the likely winner of the Democratic primary for mayor of New York City, drew tens of thousands of new voters to the polls.  Here's how.  —  Upstart challengers in political races often begin with the goal of drawing new or disillusioned voters to their cause.",
    "url": "https://www.nytimes.com/2025/06/29/nyregion/zohran-mamdani-voters-strategy.html?unlocked_article_code=1.Sk8.md1v.BJkCrKImVM5k&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Trump says the administration is working on a ‘temporary pass’ for immigrants in certain industries  —  The president's comments mark the latest shift in his administration's approach to immigrant workers in certain industries.  —  WASHINGTON — President Donald Trump said in an interview … ",
    "url": "https://www.nbcnews.com/politics/immigration/trump-administration-working-temporary-pass-immigrants-farm-industries-rcna215806"
  },
  {
    "text": "Star witness against Kilmar Abrego García was due to be deported.  Now he's being freed.  —  Jose Ramon Hernandez Reyes is a three-time felon who has been released early from federal prison to a halfway house in exchange for his cooperation in the case.",
    "url": "https://www.washingtonpost.com/immigration/2025/06/28/star-witness-against-kilmar-abrego-garca-was-due-be-deported-now-hes-being-freed/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzUxMDgzMjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzUyNDY1NTk5LCJpYXQiOjE3NTEwODMyMDAsImp0aSI6ImVkZTBmMDcyLWEyOTEtNGU5Zi04NGIwLWY5YzdiZGYwMmQxYiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9pbW1pZ3JhdGlvbi8yMDI1LzA2LzI4L3N0YXItd2l0bmVzcy1hZ2FpbnN0LWtpbG1hci1hYnJlZ28tZ2FyY2Etd2FzLWR1ZS1iZS1kZXBvcnRlZC1ub3ctaGVzLWJlaW5nLWZyZWVkLyJ9._Nch735ocr9BypFYB3Xw3tJUhhZe5g2iCY6LIT4QPPA&itid=gfta"
  },
  {
    "text": "To fight Trump's funding freezes, states try a new gambit: Withholding federal payments  —  The novel and untested approach has been introduced by Democratic lawmakers in at least four states.  —  Democratic legislators mostly in blue states are attempting to fight back against President … ",
    "url": "https://www.nbcnews.com/politics/politics-news/trumps-funding-freezes-states-new-gambit-withholding-federal-money-rcna215212"
  },
  {
    "text": "“When is cancer political?”  Medical researchers, patients decry Trump admin's layoffs, budget cuts  —  They might easily be mistaken for Congressional staffers, reluctant to face the day, but these are among the most accomplished cancer specialists in the country, meeting with Representatives, Senators and staff.",
    "url": "https://www.cbsnews.com/news/when-is-cancer-political-medical-researchers-patients-decry-trump-admins-layoffs-budget-cuts/"
  },
  {
    "text": "U.S. will send tariffs letters in coming days, deals not needed, Trump says  —  A looming deadline to make trade deals doesn't necessarily matter, President Trump said Sunday, because the U.S. will simply send letters to hundreds of countries assigning tariff rates.",
    "url": "https://www.axios.com/2025/06/29/trump-tariffs-pause"
  },
  {
    "text": "White House eyes Kentucky state senator for Massie challenge  —  White House officials will host Kentucky state Sen. Aaron Reed in the coming weeks for a discussion about challenging GOP Rep. Thomas Massie in next year's Republican primary, according to two people granted anonymity to describe the private plans.",
    "url": "https://www.politico.com/live-updates/2025/06/29/congress/aaron-reed-thomas-massie-challenger-00432138"
  }
]