[
  {
    "text": "Trump fires chairman of the Joint Chiefs of Staff  —  President Donald Trump abruptly fired Air Force Gen. CQ Brown Jr. as chairman of the Joint Chiefs of Staff on Friday, sidelining a history-making fighter pilot and respected officer as part of a campaign to rid the military of leaders who support diversity and equity in the ranks.",
    "url": "https://apnews.com/article/trump-brown-joint-chiefs-of-staff-firing-fa428cc1508a583b3bf5e7a5a58f6acf"
  },
  {
    "text": "Trump Fires Joint Chiefs Chairman Amid Flurry of Dismissals at Pentagon  —  The decision to fire Gen. Charles Q. Brown Jr., a four-star fighter pilot, upends a tradition in which the Joint Chiefs chairman traditionally remains in place as administrations change.",
    "url": "https://www.nytimes.com/2025/02/21/us/politics/trump-fires-cq-brown-pentagon.html"
  },
  {
    "text": "Dan Caine, Trump's Joint Chiefs Pick, Had Unusual Path to Top Ranks  —  The general made an impression on the president in 2018 when he said the Islamic State could be defeated in a week, according to the president.  —  In President Trump's telling, Dan Caine, the retired Air Force lieutenant general whom … ",
    "url": "https://www.nytimes.com/2025/02/21/us/politics/dan-caine-trump-joint-chiefs.html"
  },
  {
    "text": "Stock Market Sees Biggest Declines of Trump's Presidency So Far  —  Fueling a 1.7 percent decline on Friday was an unexpected drop in the University of Michigan's consumer sentiment index, as Americans worried about stubborn inflation.  —  Stocks slumped on Friday, with the S&P 500 wiping … ",
    "url": "https://www.nytimes.com/2025/02/21/business/stock-market-declines-trump.html"
  },
  {
    "text": "AP sues 3 Trump administration officials, citing freedom of speech  —  The Associated Press sued three Trump administration officials Friday over access to presidential events, citing freedom of speech in asking a federal judge to stop the 10-day blocking of its journalists.",
    "url": "https://apnews.com/article/ap-lawsuit-trump-administration-officials-0352075501b779b8b187667f3427e0e8"
  },
  {
    "text": "Back in their districts, GOP lawmakers get an earful on DOGE and Musk  —  Town halls from Wisconsin to Oregon grew testy this week as concerned voters showed up to vent  —  ROSWELL, Georgia — The crowd packed into City Hall and filled an overflow room with one question, above all … ",
    "url": "https://www.washingtonpost.com/politics/2025/02/21/doge-georgia-town-hall-gop/"
  },
  {
    "text": "‘Precision is the priority’?  Trump administration pauses some mass firings  —  One White House official says there is now a reluctance to fire veterans.  —  After a chaotic first wave of mass firings, Trump administration officials say they are slowing the pace of gutting certain agencies … ",
    "url": "https://www.politico.com/news/2025/02/21/trump-administration-federal-employees-firing-slowdown-00205540"
  },
  {
    "text": "Exclusive: US could cut Ukraine's access to Starlink internet services over minerals, say sources  —  U.S. negotiators pressing Kyiv for access to Ukraine's critical minerals have raised the possibility of cutting the country's access to Elon Musk's vital Starlink satellite internet system … ",
    "url": "https://www.reuters.com/business/us-could-cut-ukraines-access-starlink-internet-services-over-minerals-say-2025-02-22/"
  },
  {
    "text": "Supreme Court maintains pause on Trump bid to immediately fire watchdog agency head  —  The Supreme Court, which has a 6-3 conservative majority, weighs in on a case involving the new Trump administration for the first time.  —  WASHINGTON — The Supreme Court on Friday for now prevented President Donald … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-maintains-pause-trump-bid-immediately-fire-watchdog-agen-rcna192643"
  },
  {
    "text": "Trump to shut down all 8,000 EV charging ports at federal govt buildings  —  The Trump administration is shutting down EV chargers at all federal government buildings and is also expected to sell off the General Services Administration's (GSA) newly bought EVs.",
    "url": "https://electrek.co/2025/02/21/trump-to-shut-down-all-8000-ev-charging-ports-at-federal-govt-buildings/"
  },
  {
    "text": "Ex-Proud Boys leader Enrique Tarrio arrested on assault charge outside U.S. Capitol  —  Tarrio was released from prison last month after President Donald Trump cut short his 22 year prison sentence for seditious conspiracy related to the Jan. 6, 2021 attack on the Capitol.",
    "url": "https://www.nbcnews.com/politics/politics-news/ex-proud-boys-leader-enrique-tarrio-arrested-assault-charge-us-capitol-rcna193246"
  },
  {
    "text": "‘See You In Court’: Maine Gov. Goes Head-To-Head With Trump Over Trans Athlete Ban  —  Democrat Janet Mills had a heated exchange with Trump after he threatened to withhold federal funds to states that don't obey his executive order.  —  LOADING  —  Maine Gov. Janet Mills (D) … ",
    "url": "https://www.huffpost.com/entry/janet-mills-spars-trump-trans-athlete-order_n_67b8d114e4b09eb9377046ee"
  },
  {
    "text": "Acting ICE director removed amid White House pressure to boost arrests  —  Caleb Vitello, a veteran ICE official, will be reassigned in latest agency shakeup.  —  The Trump administration has removed the top official at Immigration and Customs Enforcement one month into his tenure … ",
    "url": "https://www.washingtonpost.com/immigration/2025/02/21/ice-director-removed-caleb-vitello/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQwMTE0MDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQxNDk2Mzk5LCJpYXQiOjE3NDAxMTQwMDAsImp0aSI6IjMyYjFlYTc2LWJkZDgtNGZmYi04Y2U2LTA0Mzc2MDAyODkxZiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9pbW1pZ3JhdGlvbi8yMDI1LzAyLzIxL2ljZS1kaXJlY3Rvci1yZW1vdmVkLWNhbGViLXZpdGVsbG8vIn0.kaUOemt9BRryof4Ucw2WzxaavZaD3jPwRcAJtMYME6g&itid=gfta"
  },
  {
    "text": "DOGE's Only Public Ledger Is Riddled With Mistakes  —  The figures from Elon Musk's team of outsiders represent billions in government cuts.  They are also full of accounting errors, outdated data and other miscalculations.  —  Elon Musk and his Department of Government Efficiency … ",
    "url": "https://www.nytimes.com/2025/02/21/upshot/doge-musk-trump-errors.html?unlocked_article_code=1.y04.8IDa.H_9Bh-vHgzGZ"
  },
  {
    "text": "Trump's Firing Spree at FAA Was Even More Terrible Than He Admitted  —  The Trump administration's Federal Aviation Administration firings are much worse than they initially let on.  —  Politico has reported that the 130 terminated FAA workers last month included critical employees who directly … ",
    "url": "https://newrepublic.com/post/191818/trump-firing-spree-faa"
  },
  {
    "text": "Judge largely blocks Trump's executive orders ending federal support for DEI programs  —  A federal judge on Friday largely blocked sweeping executive orders from President Donald Trump that seek to end government support for programs promoting diversity, equity and inclusion.",
    "url": "https://apnews.com/article/dei-diversity-equity-inclusion-trump-federal-judge-5b04fbc742bd32adf98ca108b4b12b37"
  },
  {
    "text": "Immigration Activists Hope the Courts Will Stall Trump's TPS Orders Again  —  The Trump administration is ending temporary protected status for Haitians early, but activists plan to fight back.  — Copy  —  Immigrant rights activists are preparing to fight in court against the Trump … ",
    "url": "https://www.notus.org/haiti-temporary-protected-status"
  },
  {
    "text": "The University of Pittsburgh pauses its Ph.D. admissions process amid research funding uncertainty  —  Amid uncertainty about frozen research aid from the National Institutes of Health, the University of Pittsburgh has put its Ph.D. admissions on ice.  The school confirmed Friday … ",
    "url": "https://www.wesa.fm/health-science-tech/2025-02-21/university-pittsburgh-phd-pause-research-funding-uncertainty"
  },
  {
    "text": "Trump Issued Perhaps His Most Terrifying Executive Order on Tuesday  —  Over the past month, many have warned that President Donald Trump is trying to make himself king or dictator.  Trump's defenders wave off such warnings as hysterical hyperbole.  The past week has shown that they are very much not.",
    "url": "https://slate.com/news-and-politics/2025/02/king-donald-trump-terrifying-executive-order.html"
  },
  {
    "text": "Rep. Cliff Bentz fields questions at emotional Union County town hall  —  LA GRANDE — Oregon's U.S. Rep. Cliff Bentz tried to make it through his usual routine Wednesday, Feb. 19, at his town hall in La Grande.  But the crowd was not having it.  —  Residents from Union County … ",
    "url": "https://www.lagrandeobserver.com/news/local/rep-cliff-bentz-fields-questions-at-emotional-union-county-town-hall/article_5c6207c0-efe8-11ef-aa69-878a1d2e57d4.html"
  },
  {
    "text": "Another Town Hall(s) Goes Off the Rails - Oregon 2nd District Edition  —  In Oregon's 2nd district Rep. Cliff Bentz (R) got a rude awakening in four town halls he held in the district this past week.  At one point in his town hall in La Grande he chided the audience, saying a lot of representatives had refused to even hold town halls.",
    "url": "https://talkingpointsmemo.com/edblog/another-town-halls-goes-off-the-rails-oregon-2nd-district-edition"
  },
  {
    "text": "US Rep. Glenn Grothman faces hostile crowd at Oshkosh town hall meeting  —  Constituents ask congressman about Medicaid funding, power of Elon Musk  —  People booed and jeered at U.S. Rep. Glenn Grothman as he walked into the Algoma Town Hall just outside Oshkosh Friday morning.",
    "url": "https://www.wpr.org/news/glenn-grothman-faces-hostile-crowd-at-oshkosh-town-hall"
  },
  {
    "text": "With No Buy-in From Egypt or Jordan, Trump Appears to Back Away From His Gaza Plan  —  Earlier this month, the president said he favored taking control of Gaza and displacing the Palestinian population of the devastated seaside enclave.  But Egypt and Jordan flatly rejected cooperating.",
    "url": "https://www.nytimes.com/2025/02/21/us/politics/trump-gaza-egypt-jordan.html?unlocked_article_code=1.y04.JIGe.RSwbeQovvRkh"
  },
  {
    "text": "Richard Grenell: There will be conditions on Los Angeles fire aid  —  The Trump administration special envoy said the White House is talking about what the conditions will be.  —  President Donald Trump's special envoy Richard Grenell said there will be strings attached to California wildfire aid.",
    "url": "https://www.politico.com/news/2025/02/21/california-wildfire-aid-conditions-trump-administration-00205479"
  },
  {
    "text": "Former Intelligence Officer Claims KGB Recruited Trump  —  A former Soviet intelligence officer has alleged that Donald Trump was recruited by the KGB in 1987 and given the codename “Krasnov.”  Alnur Mussayev, 71, a former head of intelligence in Kazakhstan and before that a Soviet KGB officer … ",
    "url": "https://www.thedailybeast.com/former-intelligence-officer-alnur-mussayev-claims-kgb-recruited-donald-trump-under-codename-krasnov/"
  },
  {
    "text": "French leader cancels CPAC speech after Bannon's apparent Nazi salute … - Bannon did not immediately respond to Axios' request for comment.  — A CPAC representative did not respond to a request for comment Friday. … - “As a result, I have taken the immediate decision to cancel … ",
    "url": "https://www.axios.com/2025/02/21/steve-bannon-cpac-nazi-salute-french-leader"
  },
  {
    "text": "Europe targets homegrown nuclear deterrent as Trump sides with Putin  —  Europe's politicians are openly discussing how they could tackle the threat of nuclear attack without American help, in a dramatic sign of the deep crisis engulfing the transatlantic alliance under Donald Trump.",
    "url": "https://www.politico.eu/article/europe-nuclear-weapons-nato-donald-trump-vladimir-putin-friedrich-merz/"
  },
  {
    "text": "DOGE Put Him in the Treasury Department.  His Company Has Federal Contracts Worth Millions  —  Experts say the conflicts posed by Tom Krause's dual roles are unprecedented in the modern era.  —  Over the past couple of decades, a number of US government officials have left their roles for lucrative jobs at tech companies.",
    "url": "https://www.wired.com/story/krause-doge-cloud-software-treasury/"
  },
  {
    "text": "Trump Administration Stalls Scientific Research Despite Court Ruling  —  Using an arcane law, officials have effectively delayed funding from the National Institutes of Health, leaving medical studies in jeopardy.  —  The Trump administration has blocked key parts of the federal government's apparatus … ",
    "url": "https://www.nytimes.com/2025/02/21/science/nih-research-funding-delays.html?unlocked_article_code=1.yk4.qNQA.zVPAsVztAZ3p&smid=url-share"
  },
  {
    "text": "F.D.A. Firings Decimated Teams Reviewing A.I. and Food Safety  —  Staff units evaluating high-tech surgical robots and insulin-delivery systems were gutted by Trump layoffs even though industry fees, not taxpayers, financed the employee salaries.  —  In recent years, the Food … ",
    "url": "https://www.nytimes.com/2025/02/21/health/fda-trump-layoffs-device-and-food-safety.html?unlocked_article_code=1.y04.lvro.4RGYAg4qxVBf&smid=nytcore-ios-share&referringSource=articleShare&sgrp=c-cb"
  }
]