[
  {
    "text": "Trump's Midnight In America  —  Three weeks and a day until election day, and this thing is tied, tied, tied.  Nate Silver's polling average has Kamala Harris up a tick under three points nationally—which might give Donald Trump the barest of edges at this moment in the Electoral College.",
    "url": "https://www.thebulwark.com/p/trumps-midnight-in-america"
  },
  {
    "text": "October 13, 2024  —  “He is the most dangerous person ever.  I had suspicions when I talked to you about his mental decline and so forth, but now I realize he's a total fascist.  He is now the most dangerous person to this country...a fascist to the core.”",
    "url": "https://heathercoxrichardson.substack.com/p/october-13-2024"
  },
  {
    "text": "Trump targets immigrants legally in US for deportation  —  Having protected status may not save you. … As the 2024 election heads into the home stretch, Donald Trump and JD Vance are doing what they do best: whipping up a racist campaign of hate against immigrants.",
    "url": "https://www.publicnotice.co/p/trump-deportation-tps-humanitarian-parole"
  },
  {
    "text": "America's choice: Do voters want to live in reality, or a dangerous dream world?  —  Donald Trump stopped Friday at a plush mountain hotel called Gaylord Rockies Resort just outside Aurora, Colo., to launch a Western weekend getaway — from basic reality.  His rally at the resort's convention center … ",
    "url": "https://www.inquirer.com/opinion/donald-trump-campaign-unreality-aurora-20241013.html"
  },
  {
    "text": "Hurricane recovery officials in N.C. relocated amid report of ‘armed militia,’ email shows  —  Safety fears are growing as misinformation collides with a large-scale federal recovery effort.  —  LAKE LURE, N.C. — Federal emergency response personnel on Saturday had employees operating … ",
    "url": "https://www.washingtonpost.com/weather/2024/10/13/federal-officials-nc-temporarily-relocated-amid-report-armed-militia-email-shows/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI4NzkyMDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzMwMTc0Mzk5LCJpYXQiOjE3Mjg3OTIwMDAsImp0aSI6ImVhZWZhZDUyLWFhY2EtNDc3Zi1iZDRlLWZkMzM1NmVjOTBjMiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS93ZWF0aGVyLzIwMjQvMTAvMTMvZmVkZXJhbC1vZmZpY2lhbHMtbmMtdGVtcG9yYXJpbHktcmVsb2NhdGVkLWFtaWQtcmVwb3J0LWFybWVkLW1pbGl0aWEtZW1haWwtc2hvd3MvIn0.BaGrTy9ZRxMPH9cxITvM1C18f2v862tZKRIZxsmtuSc&itid=gfta"
  },
  {
    "text": "FEMA makes “operational adjustments” in hurricane response as threats spike … - There's been a surge in threats following mis- and disinformation on the federal response to Hurricane Helene. … - FEMA warned last week that the falsehoods significantly impeded response efforts to hurricanes Helene and Milton.",
    "url": "https://www.axios.com/2024/10/14/fema-threats-hurricane-recovery-misinformation"
  },
  {
    "text": "Harris campaign targets Republicans in Arizona with new ad  —  The ad features GOP Mesa Mayor John Giles, who also spoke at the DNC.  —  Kamala Harris' campaign is out with a new ad targeting Republican voters in the battleground state of Arizona that features the GOP mayor of Mesa saying that he is a … ",
    "url": "https://www.politico.com/news/2024/10/14/kamala-harris-ad-trump-arizona-00183578"
  },
  {
    "text": "Internal polling memo has warning signs for Senate Republicans  —  Some races are tightening but other key pickup opportunities are moving in the wrong direction, according to a new round of polling from the Senate Leadership Fund.  —  The top GOP super PAC charged with flipping the Senate … ",
    "url": "https://www.politico.com/news/2024/10/13/senate-republican-poll-memo-00183570"
  },
  {
    "text": "Exclusive: Suspect in Coachella Valley Trump assassination attempt denies accusation, supports ex-president  —  Suspect a registered Republican from Las Vegas and member of a right-leaning anti-government group, sheriff says  —  A third assassination attempt against former President Donald Trump … ",
    "url": "https://www.pressenterprise.com/2024/10/13/las-vegas-man-found-with-loaded-firearm-high-capacity-magazine-near-trump-rally-in-coachella-valley/"
  },
  {
    "text": "Michigan GOP candidate's ad aimed at Black voters has wrong election date  —  The Michigan Legislative Black Caucus accused Republican Tom Barrett's campaign of misleading Black voters with an ad carrying the wrong election date.  —  Tom Barrett, a Republican vying for a Michigan congressional seat … ",
    "url": "https://www.washingtonpost.com/elections/2024/10/14/tom-barrett-michigan-election-misleading-ad/"
  },
  {
    "text": "The Atlantic Editor-In-Chief Jeffrey Goldberg warns newsroom decay is how ‘democracy decomposes’  —  “We're sleepwalking into an absolute disaster,” Goldberg said.  —  In an industry beset by challenges, The Atlantic is a rare bright spot.  —  The 167-year-old magazine announced this week … ",
    "url": "https://www.status.news/p/atlantic-jeffrey-goldberg-2024-interview"
  },
  {
    "text": "Scoop: Karine Jean-Pierre blocks John Kirby at White House podium … - Kirby, President Biden's top spokesperson for foreign affairs, joined Jean-Pierre for most briefings after Israel was attacked on Oct. 7, 2023.  — But for the past two-plus months Kirby has been mostly absent in the briefing room … ",
    "url": "https://www.axios.com/2024/10/14/white-house-briefings-karine-jean-pierre-john-kirby"
  },
  {
    "text": "Orbán threatens to mess with Ukraine aid to help Trump  —  Hungary's latest attempt to disrupt Ukraine aid isn't about money — it would penalize the EU.  It's about making friends with Donald Trump.  —  Hungarian Prime Minister Viktor Orbán is preparing to serve … ",
    "url": "https://www.politico.eu/article/viktor-orban-threaten-ukraine-aid-help-donald-trump/"
  },
  {
    "text": "This could have been a year of a federal court reckoning for Trump.  Judges had other ideas  —  The indictment charging Donald Trump with hoarding classified documents leveled one jaw-dropping allegation after another, including that he showed off a secret Pentagon attack plan to guests … ",
    "url": "https://apnews.com/article/trump-federal-court-classified-documents-2020-election-302f87960dbd84d7be5daedaf03328d8"
  },
  {
    "text": "Behind the Curtain — Election scenario 1: War-gaming a Trump sweep … This period, lasting at least two years, until the next congressional races, would allow Republicans to move ambitiously — with few brakes beyond the Senate filibuster.  — The vast majority of congressional leaders are now Trump loyalists.",
    "url": "https://www.axios.com/2024/10/14/trump-election-win-scenario-gop"
  },
  {
    "text": "Trump's protests aside, his agenda has plenty of overlap with Project 2025  —  Donald Trump insists that Project 2025, a nearly 1,000-page blueprint for a hard-right turn in American government and society, does not reflect his priorities for a White House encore.  “I haven't read it.",
    "url": "https://apnews.com/article/trump-project-2025-heritage-foundation-e2b1be71422f4afcfd4a397828f7cab6"
  },
  {
    "text": "Josh Hawley's Local Newspaper Declares Him the ‘Worst Sitting Senator’  —  NO CONFIDENCE  —  The St. Louis Post-Dispatch objected to Hawley's actions leading up to the Jan. 6 Capitol riots.  —  A local newspaper in Missouri wrote a scathing rebuke of the state's Sen. Josh Hawley … ",
    "url": "https://www.thedailybeast.com/st-louis-post-dispatch-names-josh-hawley-the-worst-sitting-senator"
  }
]