[
  {
    "text": "Fani Willis admits relationship with prosecutor on Trump Georgia case  —  ATLANTA — Fulton County District Attorney Fani T. Willis (D) admitted she had a personal relationship with an outside prosecutor she appointed to manage the election interference case against former president Donald Trump … ",
    "url": "https://www.washingtonpost.com/national-security/2024/02/02/fani-willis-response-accusations/"
  },
  {
    "text": "Fani Willis just killed any chance Trump had to kick her off his case: legal expert  —  Fulton County District Attorney Fani Willis finally admitted on Friday that she was romantically involved with one of her special prosecutors, Nathan Wade — but the details she and Wade have now revealed destroy … ",
    "url": "https://www.rawstory.com/trump-fani-willis-affair/"
  },
  {
    "text": "Fani Filing: A Fling Is Fine, So F Off  —  Sometimes, the best defense is a good offense.  And sometimes, offense is just a desperate ploy.  —  Fani Willis and Nathan Wade faced a deadline today to respond to the disqualification motion filed by RICO defendant Michael Roman that alleges a personal conflict of interest.",
    "url": "https://hotair.com/ed-morrissey/2024/02/02/fani-filing-a-fling-is-fine-so-f-off-n609212"
  },
  {
    "text": "Behind the Curtain: Trump's conviction scenario  —  Former President Trump is breezing to the GOP nomination — but, in private, is bracing for the genuine possibility that he'll be the first convicted felon in U.S. history to represent a major party.",
    "url": "https://www.axios.com/2024/02/02/trump-conviction-trial-jan-6-court"
  },
  {
    "text": "Judge will delay Trump's federal trial as court considers his presidential immunity claim  —  Judge Tanya Chutkan called off the March 4 trial date in an order on Friday, saying she will set a new date after Trump's immunity appeal is resolved.  —  WASHINGTON — Former President Donald … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/judge-will-delay-trumps-federal-trial-court-considers-presidential-imm-rcna137045"
  },
  {
    "text": "Judge suspends Trump's March election interference trial while awaiting immunity ruling  —  The judge overseeing former President Trump's election interference case on Friday suspended his March 4 trial, saying she will set a new trial date after an appeals court weighs whether the case … ",
    "url": "https://thehill.com/regulation/court-battles/4445162-judge-suspends-trumps-march-election-interference-trial-while-awaiting-immunity-ruling/"
  },
  {
    "text": "Inside Biden's obsession with “Morning Joe”  —  When White House aides appear on MSNBC's “Morning Joe,” they're often booked between 7 and 7:40 a.m. ET.  That's so they'll reach one crucial and loyal viewer: President Biden. … - During the day, Biden has long asked his staff whether they saw a story … ",
    "url": "https://www.axios.com/2024/02/02/biden-obsession-morning-joe-msnbc-media"
  },
  {
    "text": "It's Crazy That the Booming Economy Is Hurting Biden … The closer we get to the election, the harder it becomes to explain the polls by any material basis.  The primary explanation for President Joe Biden's disastrous polling has been that voters believe the economy has been poor.",
    "url": "https://nymag.com/intelligencer/2024/02/jobs-report-biden-bideonomics-campaign-economy-trump.html"
  },
  {
    "text": "Roberta Kaplan says Trump threw papers across table at Mar-a-Lago deposition because his legal team agreed to feed her lunch  —  Attorney Roberta Kaplan said former President Donald Trump threw papers across a table and stormed off during a deposition at Mar-a-Lago after learning that his legal team had agreed to provide her lunch.",
    "url": "https://www.cnn.com/2024/02/01/politics/roberta-kaplan-donald-trump-deposition-maralago/"
  },
  {
    "text": "He Was Accused of Sexual Misconduct.  Then Trump Hired Him.  Then He Was Indicted in Mar-a-Lago Case.  —  Trump body man Walt Nauta is a critical figure in the Mar-a-Lago documents case.  Trump only hired him after Nauta was dismissed from the White House after sexual harassment claims.",
    "url": "https://www.thedailybeast.com/walt-nauta-was-accused-of-sexual-misconduct-then-trump-hired-him-then-he-was-indicted-in-mar-a-lago-case"
  },
  {
    "text": "It's The Impunity, Stupid  —  The very first time I decided to actually look into whether Tesla was doing what it said it was doing, I spent a long weekend discovering that its revolutionary battery swap station was a sham designed to rip off California's Zero Emission Vehicle program.",
    "url": "https://niedermeyer.io/2024/02/02/its-the-impunity-stupid/"
  },
  {
    "text": "Trump Is Inching Closer to the Worst Legal Defeat of his Life  —  It sure looks like Trump's business empire is about to get hammered.  —  Former President Donald Trump has suffered through plenty of painful courtroom defeats during his lengthy career as one of America's most litigious businessmen.",
    "url": "https://www.vice.com/en/article/g5yn8x/trump-is-inching-closer-to-the-worst-legal-defeat-of-his-life"
  },
  {
    "text": "U.S. Voters: Biden, Most in House Don't Deserve Another Term  —  WASHINGTON, D.C. — Fewer than four in 10 U.S. registered voters say President Joe Biden deserves to be reelected, while less than a quarter say the same about most members of the U.S. House.  As is almost always the case … ",
    "url": "https://news.gallup.com/poll/609602/voters-biden-house-don-deserve-term.aspx"
  },
  {
    "text": "Tommy Tuberville May Yet Pay for His Antics, if House Dems Have Their Way  —  Democrats on the House Oversight Committee on Friday called for an investigation into Senator Tommy Tuberville's blockade on military promotions.  —  Tuberville single-handedly blocked hundreds of military promotions … ",
    "url": "https://newrepublic.com/post/178713/tommy-tuberville-pay-military-blockade-house-democrats"
  },
  {
    "text": "CNN Anchor Stunned Into Silence After Panelist Explains Why Illegals Don't Stay in Florida  —  CNN anchor Erica Hill was stunned into silence on Friday morning after a panelist explained to her why illegal immigrants don't stay in Florida.  —  The exchange came after four illegal immigrants … ",
    "url": "https://redstate.com/bonchie/2024/02/02/cnn-anchor-stunned-into-silence-after-panelist-explains-why-illegals-dont-stay-in-florida-n2169541"
  },
  {
    "text": "New report points to blockbuster U.S. job growth as 2024 begins  —  By every metric, the latest jobs report points to an incredibly strong U.S. job market.  The political implications have the potential to be dramatic.  —  Expectations heading into this morning showed projections … ",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/new-report-points-blockbuster-us-job-growth-2023-begins-rcna136921"
  },
  {
    "text": "Ryan Samsel, Jan. 6 defendant who instigated breach, convicted of multiple felonies  —  Samsel and four others were convicted of participating in the “civil disorder” wrought by the mob and of assaulting police officers.  —  The Jan. 6 defendant widely seen as the instigator of the violent breach … ",
    "url": "https://www.politico.com/news/2024/02/02/ryan-samsel-jan-6-defendant-00139344"
  },
  {
    "text": "Joe Rogan Gets New Spotify Deal Worth Up to $250 Million  —  Hit show to be distributed broadly, including on YouTube, rather than exclusively on audio-streaming service  —  Spotify has reached a new deal with star podcaster Joe Rogan that will allow his hit show to be distributed broadly.",
    "url": "https://www.wsj.com/business/media/joe-rogan-podcast-spotify-deal-28eb5f74?mod=followamazon"
  },
  {
    "text": "I prosecuted Watergate and never feared for our democracy — but Greg Abbott has me worried  —  Abbott either doesn't understand the Constitution, or doesn't want to.  Both options are worrying.  —  By Jill Wine-Banks, former Watergate prosecutor  —  I am not an alarmist by nature.",
    "url": "https://www.msnbc.com/opinion/msnbc-opinion/greg-abbott-border-supreme-court-immigration-biden-rcna136746"
  }
]