[
  {
    "text": "Trump says ‘violent day’ of policing will end crime  —  The remarks at a campaign rally Sunday did not amount to a policy proposal allowing police retaliation, the former president's campaign said.  —  Former President Donald Trump on Sunday called for “one real rough, nasty” and “violent day” … ",
    "url": "https://www.politico.com/news/2024/09/29/trump-violent-day-policing-crime-00181619"
  },
  {
    "text": "‘Chills me’: Experts horrified by Trump's call for ‘really violent day’ of policing  —  2024 GOP presidential nominee Donald Trump openly advocated police brutality when, during a campaign speech in Erie, Pennsylvania on Sunday, September 29, he called for “one really violent day” of policing.",
    "url": "https://www.rawstory.com/trump-police/"
  },
  {
    "text": "‘Trump Is a Scab’: Harris Campaign Fumes Over Trump's Wild Anti-Overtime Rant  —  'I WOULDN'T PAY'  —  The former president admitted he “shouldn't say this” at a rally in Pennsylvania—just minutes before the Harris campaign highlighted the comments.  —  Former president Donald Trump openly admitted … ",
    "url": "https://www.thedailybeast.com/trump-is-a-scab-harris-campaign-fumes-over-trumps-wild-anti-overtime-rant"
  },
  {
    "text": "Trump Suggests Terrifying Solution To Ending Crime: The Purge  —  His dangerous solution came on the heels of him repeating the false, fearmongering claim that crime is skyrocketing.  —  LOADING  —  At a rally on Sunday in Erie, Pennsylvania, Trump casually seemed to suggest that one day of violence would put an end to crime.",
    "url": "https://www.huffpost.com/entry/donald-trump-solution-crime-the-purge_n_66f9b7c8e4b019aae3aa34a3"
  },
  {
    "text": "The Only Patriotic Choice for President  —  It is hard to imagine a candidate more unworthy to serve as president of the United States than Donald Trump.  He has proved himself morally unfit for an office that asks its occupant to put the good of the nation above self-interest.",
    "url": "https://www.nytimes.com/2024/09/30/opinion/editorials/kamala-harris-2024.html"
  },
  {
    "text": "‘Morning Joe’ Asks Trump: How Did Harris ‘Destroy’ You in Debate if She's ‘Stupid?’  —  OUCH  —  “The question answers itself, I guess,” Joe Scarborough said.  —  MSNBC host Joe Scarborough has some questions for Donald Trump after his latest attacks on Kamala Harris.",
    "url": "https://www.thedailybeast.com/morning-joe-scarborough-asks-trump-how-did-harris-destroy-you-in-debate-if-shes-stupid"
  },
  {
    "text": "Ex-MAGA Voters Fear Trump's ‘Really Evil, Dark Path’ In Scathing New Ads … LOADING … Video",
    "url": "https://www.huffpost.com/entry/republican-voters-against-trump-ad-blitz_n_66fa7857e4b06bc72dbb9b2c"
  },
  {
    "text": "Kris Kristofferson, Country Music Legend and ‘A Star Is Born’ Leading Man, Dies at 88  —  Kris Kristofferson, who attained success as both a groundbreaking country music singer-songwriter and a Hollywood film and TV star, died Saturday at home in Maui, Hawaii.",
    "url": "https://variety.com/2024/film/obituaries-people-news/kris-kristofferson-dead-country-music-legend-actor-1236159472/"
  },
  {
    "text": "Taking Trump's mass deportation vow seriously and literally  —  His signature campaign promise is to brutalize people on an unprecedented scale. … Donald Trump has repeatedly promised that if he returns to the White House, he will deport every undocumented person in the US.",
    "url": "https://www.publicnotice.co/p/trump-mass-deportation-plan-explained"
  },
  {
    "text": "Actor Zachary Levi cites RFK Jr.'s endorsement in call to support Trump  —  Actor Zachary Levi called former President Donald Trump the best choice voters have ahead of the 2024 election, citing how Trump has been backed by Robert F. Kennedy Jr.  —  Levi explained that he grew … ",
    "url": "https://www.washingtonexaminer.com/news/campaigns/presidential/3170444/zachary-levi-cites-rfk-endorsement-call-to-support-trump/"
  },
  {
    "text": "What Tim Walz's past debate performances reveal about how he may take on JD Vance  —  Tim Walz gazed into the television camera and sped through a seemingly rehearsed set of points he was hoping to drive home in one of his first political debates, just days before the 2006 election … ",
    "url": "https://www.npr.org/2024/09/30/nx-s1-5130194/tim-walz-jd-vance-vice-presidential-debate"
  },
  {
    "text": "How Congress Gets Its Groove Back  —  The Supreme Court's recent rulings will change how Congress writes laws.  It may even force the legislative branch to take a hard look at its own dysfunctions. … This is not just another fish story.  —  It begins with the Magnuson-Stevens Fishery Conservation … ",
    "url": "https://prospect.org/politics/2024-09-30-how-congress-gets-its-groove-back/"
  },
  {
    "text": "Vance appears at conference hosted by preacher who says Harris is possessed by the devil  —  Over the weekend, Republican Vice Presidential nominee JD Vance was a featured speaker at a conference, the Courage Tour, hosted by radical preacher Lance Wallnau.  In a September 19 appearance on … ",
    "url": "https://popular.info/p/vance-appears-at-conference-hosted"
  },
  {
    "text": "MAGA Switches Off Netflix After Chairman Donates to Harris Campaign  —  TUNING OUT  —  The hashtag #CancelNetflix started trending just days after Reed Hastings announced he'd given $7 million to Kamala Harris' bid for the presidency.  —  Donald Trump supporters appear to have quit Netflix en masse … ",
    "url": "https://www.thedailybeast.com/netflix-cancellations-surge-after-reed-hastings-donates-millions-to-kamala-harris"
  },
  {
    "text": "‘The Power Broker’ at 50 — and what author Robert Caro is still uncovering  —  In Robert Caro's Upper West Side office, it is 1965.  —  “Like right now, just at this moment, Lyndon Johnson is creating Medicare,” Caro told me in the middle of a recent interview.  “It's July, 1965.”  —  Right now.",
    "url": "https://www.npr.org/2024/09/30/nx-s1-5123695/the-power-broker-robert-caro-new-book-democracy"
  },
  {
    "text": "VA staff got into Vance, Walz medical files, sparking investigation  —  At least a dozen VA employees improperly accessed the medical records of vice presidential nominees JD Vance and Tim Walz this summer, investigators found.  —  At least a dozen employees at the Department … ",
    "url": "https://www.washingtonpost.com/politics/2024/09/30/vance-walz-medical-records-breach-va/"
  },
  {
    "text": "Republicans Deploy Cash to Crack Democrats' Blue Wall in Senate  —  Group aligned with Sen. Mitch McConnell to spend $67.5 million on ad reservations in Pennsylvania, Michigan and Wisconsin  —  WASHINGTON—A group aligned with Senate Minority Leader Mitch McConnell (R., Ky.) … ",
    "url": "https://www.wsj.com/politics/elections/republicans-deploy-cash-to-crack-democrats-blue-wall-in-senate-b8a3dd6f"
  }
]