[
  {
    "text": "E. Jean Carroll's Lawyer: Trump Told Me ‘See You Next Tuesday’  —  ALL CLASS  —  Roberta Kaplan, the attorney who represented E. Jean Carroll in her successful lawsuit against Donald Trump, says the ex-president used a vulgarity on her at the end of a deposition at Mar-a-Lago.",
    "url": "https://www.thedailybeast.com/e-jean-carrolls-lawyer-roberta-kaplan-trump-told-me-see-you-next-tuesday"
  },
  {
    "text": "After Speedy Start, Appeals Court Slows Down on Trump Immunity Decision  —  The implications have started coming into focus with the scrapping of March 4 as the start date for the former president's federal trial on charges of trying to overturn the 2020 election.",
    "url": "https://www.nytimes.com/2024/02/03/us/politics/trump-immunity-appeals-court.html"
  },
  {
    "text": "Special counsel mounts forceful — and unusual — defense of Trump classified documents case  —  The routine filing features a public rebuttal of “misimpressions” allegedly fueled by the former president.  —  Special counsel Jack Smith used a routine legal filing Friday to offer … ",
    "url": "https://www.politico.com/news/2024/02/02/special-counsel-mounts-forceful-and-unusual-defense-of-trump-classified-documents-case-00139456"
  },
  {
    "text": "At R.N.C. Meeting, Talk Is of Coming Trump Merger and Chairwoman's Fate  —  Donald Trump has long worked closely with Ronna McDaniel, the head of the Republican National Committee.  In private, he has begun to question its direction under her leadership.  —  In early 2021, when former … ",
    "url": "https://www.nytimes.com/2024/02/03/us/politics/trump-ronna-mcdaniel-rnc.html"
  },
  {
    "text": "Trump markets himself as an outsider in new campaign ad: ‘Embrace the label’  —  Former President Trump released a new campaign advertisement on his Truth Social site where he calls himself an outsider and tells supporters to embrace being one too.  —  “Treat the word ‘impossible’ as nothing more than motivation.",
    "url": "https://thehill.com/homenews/campaign/4446147-trump-markets-self-outsider-new-campaign-ad/"
  },
  {
    "text": "Biden's economy keeps messing up Trump's message  —  “You can't blame the president when policies go wrong, and then say he's not responsible if things are going right.”  —  The U.S. economy just keeps getting better.  And it's forcing Donald Trump and his allies to contort the talking points … ",
    "url": "https://www.politico.com/news/2024/02/02/trump-and-his-allies-adjust-their-messaging-on-the-economy-as-it-steadily-improves-00139447"
  },
  {
    "text": "Most Republicans aren't aware of Trump's various legal issues  —  There is an assumption, probably particularly among those who cover the news and those who read it, that Donald Trump's legal travails are common knowledge.  We talk about things like the potential effects of a Trump conviction … ",
    "url": "https://www.washingtonpost.com/politics/2024/02/02/most-republicans-arent-aware-trumps-various-legal-issues/"
  },
  {
    "text": "The wild probe into investors of DWAC, Trump Media's proposed merger ally  —  Sales of Digital World Acquisition stock triggered a widespread federal probe that involved a confidential informant, a secret airport phone scan and an elite anti-money-laundering squad.  Three people were indicted, but the investigation continues.",
    "url": "https://www.washingtonpost.com/technology/2024/02/03/trump-social-dwac-investigation/"
  },
  {
    "text": "Ted Cruz wants lawmakers to get security escorts through America's airports  —  Cruz told POLITICO that his amendment is about ensuring that political VIPs aren't endangered as they pass through public spaces in airports.  —  Viral photos of politicians jetting off to a tropical hideaway during … ",
    "url": "https://www.politico.com/news/2024/02/03/ted-cruz-airport-security-00139430"
  },
  {
    "text": "Exclusive: Republican Hits Clarence Thomas With Lawsuit Over His Taxes  —  Republican John Anthony Castro is filing a lawsuit against Clarence Thomas, accusing the U.S. Supreme Court associate justice of failing to file his income taxes, Newsweek has learned.",
    "url": "https://www.newsweek.com/exclusive-republican-hits-clarence-thomas-lawsuit-over-his-taxes-1866488"
  },
  {
    "text": "Supreme Court may look to the Civil War to resolve whether Trump can be on the ballot  —  Chief Justice Salmon Chase's handling of cases involving Confederate President Jefferson Davis and a Black man in Virginia help inform the Supreme Court ahead of Feb. 8 hearing.",
    "url": "https://www.nbcnews.com/politics/supreme-court/trump-jefferson-david-14th-amendment-rcna136369"
  },
  {
    "text": "Education Department sends final Title IX rule to OMB for approval  —  Department officials were initially supposed to finalize the regulation on sexual misconduct and gender identity in May of 2023.  —  A long-awaited policy that mandates how schools respond to sexual misconduct … ",
    "url": "https://www.politico.com/news/2024/02/03/education-department-title-ix-00139459"
  },
  {
    "text": "This Lawmaker Wants to Jail People for Watching Porn  —  Oklahoma lawmaker Dusty Deevers is a hardcore Christian nationalist who believes the government should “terrorize evildoers”  —  Dusty Deevers is a fundamentalist preacher.  He's also a state senator.",
    "url": "https://www.rollingstone.com/politics/politics-features/dusty-deevers-lawmaker-jail-people-watching-porn-1234959499/"
  },
  {
    "text": "Kamala Harris Bolsters Biden for 2024 and Lays Groundwork for 2028  —  Stumping for the president ahead of South Carolina's Democratic primary, Ms. Harris has been working to shore up his vulnerabilities with Black voters and younger voters.  —  For decades, ambitious politicians with eyes … ",
    "url": "https://www.nytimes.com/2024/02/03/us/politics/kamala-harris-biden-south-carolina-primary.html"
  },
  {
    "text": "Trump's Lackeys Have Found Fani Willis' Weakness  —  They are making a cynical move to derail or delay the case.  Here's what she should do to stop it. … The racketeering case that Fulton County District Attorney Fani Willis brought against Donald Trump and 18 MAGA minions is so strong … ",
    "url": "https://www.thedailybeast.com/trumps-lackey-jim-jordan-has-found-fani-willis-weakness"
  },
  {
    "text": "President Biden: ‘If you harm an American, we will respond’  —  President Biden released a statement on the U.S. strikes in Iraq and Syria in response to the deadly drone attack in Jordan that killed three service members.  In his statement he says “the United States does not seek conflict … ",
    "url": "https://www.nbcnews.com/now/video/biden-releases-statement-on-u-s-retaliation-strikes-in-iraq-and-syria-203517509990"
  }
]