[
  {
    "text": "Ukraine Says It Downed Russian Air Target With Sea Drone For First Time  —  Ukraine claims that for the first time one of its sea drones has downed a Russian military target in the air during a day of intense attacks by both sides as the war edges closer to its three-year anniversary.",
    "url": "https://www.rferl.org/a/air-raid-sirens-blare-across-ukraine-explosions-heard-in-kyiv/33258909.html"
  },
  {
    "text": "Treasury Sanctions Entities in Iran and Russia That Attempted to Interfere in the U.S. 2024 Election  —  WASHINGTON - Today, the Department of the Treasury's Office of Foreign Assets Control (OFAC) is designating a subordinate organization of Iran's Islamic Revolutionary Guard Corps (IRGC) … ",
    "url": "https://home.treasury.gov/news/press-releases/jy2766"
  },
  {
    "text": "US imposes sanctions on Russian and Iranian groups over disinformation targeting American voters  —  The United States has imposed sanctions on two groups linked to Iranian and Russian efforts to target American voters with disinformation ahead of this year's election.",
    "url": "https://apnews.com/article/russia-iran-trump-disinformation-election-959d3f36ffc81f3e5d07386122076e7e"
  },
  {
    "text": "Chip Roy on Johnson: 'I don't believe he has the votes'  —  Rep. Chip Roy (R-Texas) said Tuesday that Speaker Mike Johnson (R-La.) does not have the votes to keep the gavel and that he remains undecided on whether he can support the Louisiana Republican in the Friday floor vote, despite President-elect Trump endorsing Johnson.",
    "url": "https://thehill.com/homenews/house/5061200-chip-roy-undecided-mike-johnson-speaker/"
  },
  {
    "text": "F.B.I. Says It Found Largest Cache of Homemade Explosives in Its History at Va. Farm  —  Investigators discovered more than 150 devices, mostly pipe bombs, on a property outside Norfolk, court papers say.  —  A Virginia man was arrested this month with what federal prosecutors described … ",
    "url": "https://www.nytimes.com/2024/12/31/us/fbi-explosives-virginia-farm.html"
  },
  {
    "text": "‘Raw Water’ Devotees Swear by Natural Springs, Despite the Risks … The highway that winds along the coast of Marin County offers some of California's most magnificent vistas, with the deep blue Pacific Ocean glittering through veils of fog.  But for a handful of travelers, the views aren't the prize.",
    "url": "https://www.nytimes.com/2024/12/31/us/raw-water-natural-springs.html"
  },
  {
    "text": "Trump ally Laura Loomer on Musk: ‘Nobody wants to cross this guy’  —  Laura Loomer, a staunch ally of President-elect Trump and far-right activist, suggested that some Republicans in Trump's circle don't want to cross billionaire Elon Musk.  —  “It sounds like people are scared of crossing the king … ",
    "url": "https://thehill.com/homenews/administration/5060997-donald-trump-administration-laura-loomer-elon-musk/"
  },
  {
    "text": "Stars Flee Jeff Bezos' Paper for Steve Jobs' Widow's Mag  —  OUT WITH THE OLD...  The Washington Post is taking more blows after losing 200,000 subscribers when its owner stopped it endorsing Kamala Harris.  —  SHOP WITH SCOUTED  —  J.Crew's Semi-Secret Factory Sale Is Not to Be Missed",
    "url": "https://www.thedailybeast.com/stars-flee-jeff-bezos-washington-post-for-steve-jobs-widows-the-atlantic/"
  },
  {
    "text": "Nearly all of Puerto Rico is without power on New Year's Eve  —  A blackout hit nearly all of Puerto Rico early Tuesday as the U.S. territory prepared to celebrate New Year's, leaving more than 1.3 million clients in the dark.  Officials said it could take up to two days to restore power.",
    "url": "https://apnews.com/article/puerto-rico-power-outage-b594dc464d469b812dc9b65c76cc16e9"
  },
  {
    "text": "Judge hands Rudy Giuliani loss on eve of new trial involving defamation case  —  Former New York City Mayor Rudy Giuliani is headed to court for a trial over whether he must turn over his Florida condo to the Georgia election workers he defamed — and he had a request shot down by the judge this week.",
    "url": "https://www.rawstory.com/rudy-giuliani-2670710747/"
  },
  {
    "text": "Trump Drops Brutal Clip of Regime's Cover Up of Biden's Decline  —  Mainstream media wanted to pretend that President Joe Biden's cognitive decline wasn't observable until his bad time at the one debate he had with President-elect Donald Trump.  —  A recent Wall Street Journal report explained … ",
    "url": "https://redstate.com/nick-arama/2024/12/31/trump-drops-brutal-clip-of-regimes-cover-up-of-bidens-decline-n2183771"
  },
  {
    "text": "The Biden mistake that blew up America  —  Happy New Year's Eve from the Will Bunch Newsletter, which is marking the end of a momentous and possibly calamitous 2024 by not reviewing the last grim 12 months but simply plowing ahead with new topics.  I do have big plans for 2025 … ",
    "url": "https://www.inquirer.com/columnists/attytood/merrick-garland-jimmy-carter-trump-20241231.html"
  },
  {
    "text": "The Case for Finding Common Ground With RFK  —  A pro-vaccine doctor argues that the left should engage with Americans skeptical of public-health rules.  —  Democrats need to build a bigger tent to be competitive.  But building a bigger political tent means compromising … ",
    "url": "https://www.theatlantic.com/podcasts/archive/2024/12/rfk-common-ground/681186/"
  },
  {
    "text": "The New Years' Eve Ethics Massacre  —  The House Ethics Committee's decisions let congressmen put campaign cash in their pockets and make other allegations of misusing their offices disappear.  —  Yesterday the House Ethics Committee effectively legalized the conversion of campaign funds … ",
    "url": "https://firstbranchforecast.substack.com/p/the-new-years-eve-ethics-massacre"
  },
  {
    "text": "Governor Cooper Takes Capital Clemency Actions  —  Today, Governor Roy Cooper announced that he has commuted the sentences of 15 people on death row in North Carolina to life without the possibility of parole.  He commuted these sentences after a thorough review of detailed petitions … ",
    "url": "https://governor.nc.gov/news/press-releases/2024/12/31/governor-cooper-takes-capital-clemency-actions"
  },
  {
    "text": "Patrick McHenry Lets Loose on the Republican Insurgents He Left Behind  —  The retiring Republican reflects on his transformation over 20 years in Congress.  —  When a 29-year-old Patrick McHenry entered Congress in 2005, few would have believed the man described as the GOP's … ",
    "url": "https://www.politico.com/news/magazine/2024/12/31/patrick-mchenry-exit-interview-00195664"
  },
  {
    "text": "Military appeals court rules defense secretary couldn't rescind 9/11 plea deals  —  Washington — A military appeals court ruled Monday that Defense Secretary Lloyd Austin could not withdraw plea agreements for Khalid Sheikh Mohammed, the accused mastermind of the Sept. 11, 2001, terror attacks … ",
    "url": "https://www.cbsnews.com/news/9-11-plea-deals-khalid-sheik-mohammed-lloyd-austin-appeals-court/"
  },
  {
    "text": "World's 500 Richest People Surpassed $10 Trillion in Wealth This Year  — Tech billionaires led the way with combined $903 billion gain  — Trump's election win pushed Musk's fortune above $400 billion  —  The world's 500 richest people got vastly richer in 2024, with Elon Musk … ",
    "url": "https://www.bloomberg.com/news/articles/2024-12-31/world-s-500-richest-billionaires-surpassed-10-trillion-in-wealth-in-2024"
  }
]