[
  {
    "text": "Email starts power clash between Musk and agency leaders — even the Trump loyalists  —  The response to Elon Musk's “What did you do last week?” threat is the first sign that even staunch White House allies are beginning to flex their political muscle against him.",
    "url": "https://www.politico.com/news/2025/02/23/musk-guidance-conflict-agency-leaders-00205640"
  },
  {
    "text": "Key federal agencies refuse to comply with Musk's latest demand in his cost-cutting crusade  —  Key U.S. agencies, including the FBI, State Department and the Pentagon, have instructed their employees not to comply with cost-cutting chief Elon Musk's latest demand that federal workers explain … ",
    "url": "https://apnews.com/article/musk-federal-workers-trump-demand-firings-06553df358086db05917d3c50f3699d6"
  },
  {
    "text": "Some Agencies Urge Staff Not to Comply With Elon Musk's Performance Email  —  The F.B.I. director, Kash Patel, the director of national intelligence, Tulsi Gabbard, and others told employees not to respond to a directive from Mr. Musk to summarize their accomplishments.",
    "url": "https://www.nytimes.com/2025/02/23/us/politics/elon-musk-email-federal-workers.html?unlocked_article_code=1.zE4.jUot.IMfNMHuRDW8a"
  },
  {
    "text": "Germany's Merz vows ‘independence’ from Trump's America, warning NATO may soon be dead  —  BERLIN — Friedrich Merz did not even wait for the final results in Germany's election before delivering what could well be a defining verdict on U.S. President Donald Trump, consigning Europe's 80-year alliance with the United States to the past.",
    "url": "https://www.politico.eu/article/friedrich-merz-germany-election-united-states-donald-trump-nato/"
  },
  {
    "text": "German election: Friedrich Merz urges ‘independence’ from US  —  To view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video  —  Early projections say Germany's conservative bloc has secured some 28.5% of the votes ahead of the far-right AfD with over 20%.",
    "url": "https://www.dw.com/en/german-election-friedrich-merz-urges-independence-from-us/live-71700729"
  },
  {
    "text": "Ahead of UN showdown on Ukraine, US urges countries to vote no on rival European bid for action  —  The United States is urging the United Nations General Assembly to back its resolution to mark the third anniversary of Russia's invasion of Ukraine on Monday, oppose any amendments and vote … ",
    "url": "https://www.reuters.com/world/ahead-un-showdown-ukraine-us-urges-countries-vote-no-rival-european-bid-action-2025-02-24/"
  },
  {
    "text": "Enrique Tarrio follows and insults officers who defended US Capitol on January 6  —  Ex-leader of far-right Proud Boys trails group through lobby of Washington hotel, engaging officer Michael Fanone  —  Enrique Tarrio, the former leader of the far-right Proud Boys group who was convicted … ",
    "url": "https://www.theguardian.com/us-news/2025/feb/22/enrique-tarrio-capitol-police"
  },
  {
    "text": "Political conference in DC interrupted by death threats against speakers critical of Trump  —  A political conference in Washington, DC, that bills itself as the alternative to the Trump-aligned CPAC was evacuated on Sunday after a death threat made against several of its speakers who have been critical of President Donald Trump.",
    "url": "https://www.cnn.com/2025/02/23/politics/principles-first-washington-dc-threats/"
  },
  {
    "text": "The Trump administration is putting thousands of USAID staffers on leave and cutting US jobs  —  The Trump administration said Sunday that it was placing all but a fraction of staffers at the U.S. Agency for International Development on leave worldwide and eliminating at least 1,600 U.S.-based jobs.",
    "url": "https://apnews.com/article/usaid-trump-musk-foreign-aid-firings-a3af8ce6ef17878b718c8e2ed3bf98e4"
  },
  {
    "text": "Trump Appointees Fire 2,000 U.S.A.I.D. Employees and Put Others Worldwide on Leave  —  The announcement, by email, came two days after a judge said the Trump administration could proceed with plans that amount to dismantling the aid agency.  —  Trump administration appointees in charge … ",
    "url": "https://www.nytimes.com/2025/02/23/us/politics/trump-usaid-employees-firing.html"
  },
  {
    "text": "Chaos erupts at legislative town hall in Coeur d'Alene  —  COEUR d'ALENE — Saturday's legislative town hall hosted by the Kootenai County Republican Central Committee turned volatile after some attendees voiced their concerns over the possible repeal of Medicaid expansion and other bills working their way through the Idaho Legislature.",
    "url": "https://cdapress.com/news/2025/feb/22/chaos-erupts-at-kcrcc-legislative-town-hall/"
  },
  {
    "text": "UPDATE on town hall chaos: Woman who was dragged out speaks, police chief condemns security, name of security firm confirmed  —  COEUR d'ALENE — A legislative town hall organized by the Kootenai County Republican Central Committee devolved into chaos Saturday when unidentified … ",
    "url": "https://cdapress.com/news/2025/feb/23/update-on-town-hall-chaos-woman-who-was-dragged-out-speaks-police-chief-condemns-security-name-of-security-firm-confirmed/"
  },
  {
    "text": "Outside Tesla in the Philly suburbs, the green shoots of an American uprising  —  There was a mad-as-hell-can't-take-it-anymore moment for every one of the dozen or so sign-waving protesters who stood on the side of busy Route 30 in suburban Devon on a brisk but brightly sunny Saturday morning … ",
    "url": "https://www.inquirer.com/opinion/commentary/tesla-protest-philadelphia-elon-musk-20250223.html"
  },
  {
    "text": "Musk barks back at Pentagon critic … - The billionaire DOGE leader was apparently responding to a CNN report that a Pentagon official had called the directive “the silliest thing I've seen in 40 years.” … Separately, Pentagon official Darin Selnick, performing the duties of under secretary … ",
    "url": "https://www.axios.com/2025/02/24/musk-email-workers-pentagon-official"
  },
  {
    "text": "The U.S. Economy Depends More Than Ever on Rich People  —  The highest-earning 10% of Americans have increased their spending far beyond inflation.  Everyone else hasn't.",
    "url": "https://www.wsj.com/economy/consumers/us-economy-strength-rich-spending-2c34a571"
  },
  {
    "text": "‘Domino effect’ of Trump policies to spread pain nationwide: economists  —  CNBC is reporting that President Donald Trump and X owner Elon Musk's cuts to the federal workforce may amount to “the biggest job cut in U.S. history” that could also hurt the U.S. economy as a whole.",
    "url": "https://www.rawstory.com/trump-economy-2671203418/"
  },
  {
    "text": "MSNBC reportedly cancels Joy Reid show in reshuffle at liberal network  —  ReidOut is being cancelled as part of a lineup shuffle being helmed by the network's new president, Rebecca Kutler  —  MSNBC has reportedly canceled longtime anchor Joy Reid's show in what is evidently a major programming restructure at the liberal network.",
    "url": "https://www.theguardian.com/media/2025/feb/23/msnbc-joy-reid-show"
  },
  {
    "text": "Trump names Dan Bongino deputy FBI director … - Bongino previously served in the New York Police Department (NYPD) before joining the U.S. Secret Service and working in the Presidential Protective Division during the administrations George W. Bush and Obama administrations.",
    "url": "https://www.axios.com/2025/02/24/dan-bongino-trump-fbi-deputy-director"
  },
  {
    "text": "Former FDA chief ‘very concerned’ about Texas measles outbreak spreading  —  Former Food and Drug Administration (FDA) Commissioner Scott Gottlieb said he is “very concerned” about the measles outbreak in Texas spreading.  —  Gottlieb joined CBS News's “Face the Nation” on Sunday … ",
    "url": "https://thehill.com/policy/healthcare/5160089-former-fda-chief-very-concerned-about-texas-measles-outbreak-spreading/"
  },
  {
    "text": "What Felt Impossible Became Possible  —  I've spent many hours since the election reading about the Ku Klux Klan in the 1920s.  It started the day after election day when I had hours to kill in the lobby of a Hampton Inn, waiting for a room to open up.  I loaded a library archive page up on my phone … ",
    "url": "https://dansinker.com/posts/2025-02-23-dale/"
  },
  {
    "text": "Trump and Elon Musk are floating ‘DOGE dividends.’ Low-income Americans might not get the benefits.  —  The president recently touted the idea, which came to a 30-year-old investor in a dream and caught the attention of Elon Musk on X.  —  James Fishback said the whole idea came to him in a recent dream … ",
    "url": "https://www.nbcnews.com/politics/doge/trump-elon-musk-doge-dividends-low-income-americans-rcna192994"
  },
  {
    "text": "Local news deserves high marks for coverage of the doge fallout  —  Local news is doing what it does best: build trust by reporting on stories local residents can verify with their own eyes.  Recently, much of that reporting has focused on the local impact of the reckless actions of Donald Trump and Elon Musk.",
    "url": "https://jenniferschulze.substack.com/p/local-news-deserves-high-marks-for"
  },
  {
    "text": "HUD cuts expected to worsen America's housing crisis, staffers say  —  The Department of Housing and Urban Development is expected to be slashed in half, according to an internal memo obtained by The Washington Post  —  New!  Catch up quickly with key takeaways",
    "url": "https://www.washingtonpost.com/business/2025/02/23/hud-cuts-doge-housing/"
  },
  {
    "text": "'It's Over!'  James Carville Tells Dan Abrams the Trump White House Will Suffer a ‘Massive Collapse’ in ‘Less Than 30 Days’  —  Veteran Democratic strategist James Carville told Mediaite's Dan Abrams that the Trump administration would “collapse” within 30 days and advised Democrats to sit back and let it happen.",
    "url": "https://www.mediaite.com/politics/its-over-james-carville-tells-dan-abrams-the-trump-white-house-will-suffer-a-massive-collapse-in-less-than-30-days/"
  },
  {
    "text": "Disability amid disaster: People with disabilities are disproportionately impacted by natural disasters  —  After disasters, people with disabilities are more likely to be displaced, more likely to never return home and more likely to receive scam offers, Census Bureau data shows.",
    "url": "https://www.nbcnews.com/data-graphics/people-disabilities-are-disproportionately-impacted-natural-disasters-rcna192577"
  }
]