[
  {
    "text": "Kristi Noem is suddenly front-and-center in the veepstakes  —  The South Dakota governor will appear with Donald Trump at an event in Rapid City on Friday.  —  Not long ago, it looked like Kristi Noem's star was flaming out.  Following a turbulent first term, the South Dakota governor elected … ",
    "url": "https://www.politico.com/news/2023/09/08/kristi-noem-veepstakes-00114586"
  },
  {
    "text": "Republicans are trying to find a new term for ‘pro-life’ to stave off more electoral losses  —  Sen. Todd Young, R-Ind., summarized the closed-door meeting on Capitol Hill as being focused on “pro-baby policies.”  —  WASHINGTON — Republican strategists are exploring a shift away from … ",
    "url": "https://www.nbcnews.com/politics/congress/republicans-try-find-new-term-life-stave-electoral-losses-rcna103924"
  },
  {
    "text": "Playbook: New strains for the McCarthy-McConnell relationship  —  Presented by With help from Eli Okun and Garrett Ross  —  DRIVING THE DAY  —  ENDORSING TRUMP TODAY — “'She's played her cards right'; Kristi Noem is positioning herself for the veepstakes,” by Adam Wren: “[I] … ",
    "url": "https://www.politico.com/newsletters/playbook/2023/09/08/the-mccarthy-mcconnell-relationship-faces-a-key-test-00114675"
  },
  {
    "text": "Trump White House official Navarro convicted of contempt after defying House Jan. 6 subpoena  —  Trump White House official Peter Navarro was found guilty Thursday of contempt of Congress charges for refusing to cooperate with a congressional investigation into the Jan. 6, 2021, attack on the U.S. Capitol.",
    "url": "https://apnews.com/article/trump-white-house-navarro-contempt-congress-jan-6-a4ad58e1f590e5884fd347c86c121a8a"
  },
  {
    "text": "DeSantis voiced complaints about top super PAC strategist, people familiar with comments say  —  The Florida governor and White House hopeful was “apoplectic” over a pre-debate strategy memo publicly posted on the website of Jeff Roe's firm, according to one person familiar with the comments",
    "url": "https://www.washingtonpost.com/politics/2023/09/08/ron-desantis-super-pac-debate/"
  },
  {
    "text": "Jim Jordan seeks docs from Jack Smith's dealings with attorney in Trump classified records fight  —  House Judiciary Chairman Jim Jordan (R-Ohio) on Thursday asked special counsel Jack Smith to turn over information relating to attorney Stanley Woodward, who has represented numerous Mar-a-Lago employees in dealings with prosecutors.",
    "url": "https://thehill.com/homenews/house/4193068-jim-jordan-seeks-docs-from-jack-smiths-dealings-with-attorney-representing-defendants-in-trump-classified-records-fight/"
  },
  {
    "text": "Climate protester glues feet to floor, interrupting US Open semifinal between Gauff and Muchova  —  The U.S. Open semifinal between Coco Gauff and Karolina Muchova was delayed by 50 minutes because of a disruption by environmental activists in the Arthur Ashe Stadium stands on Thursday night.",
    "url": "https://apnews.com/article/us-open-delay-women-semifinals-gauff-muchova-00a82f465076adea36b098aa6ca08a0d"
  },
  {
    "text": "Justice Kavanaugh says ethics changes may be coming to Supreme Court  —  CLEVELAND — Justice Brett M. Kavanaugh said Thursday that he is “hopeful” the Supreme Court soon will take specific steps to deal with ethics issues at the court and boost public confidence in the institution.",
    "url": "https://www.washingtonpost.com/politics/2023/09/07/justice-kavanaugh-ethics-supreme-court/"
  },
  {
    "text": "Press Forward Will Award More Than $500 Million to Revitalize Local News  —  A national coalition of donors catalyzes local news and information for stronger communities.  —  A coalition of 22 donors today announced Press Forward, a national initiative to strengthen communities and democracy … ",
    "url": "https://www.macfound.org/press/press-releases/press-forward-will-award-more-than-500-million-to-revitalize-local-news"
  },
  {
    "text": "The surprisingly strong constitutional case for Trump's disqualification  —  The 14th Amendment is quite clear that insurrectionists can't hold office.  —  ∙ Paid … Citizens for Responsibility and Ethics in Washington (CREW) sued earlier this week to keep Donald Trump off the presidential ballot in Colorado.",
    "url": "https://www.publicnotice.co/p/trump-14th-amendment-section-3-disqualified-crew"
  },
  {
    "text": "The Supreme Court's Fake Praying Coach Case Just Got Faker  —  Last year, the Supreme Court ruled in favor of high school football coach's right to engage in “brief, quiet, personal” prayer—despite photographic evidence that his prayers were drawn-out, loud, and extremely public.",
    "url": "https://slate.com/news-and-politics/2023/09/supreme-court-praying-coach-joe-kennedy-fake.html"
  },
  {
    "text": "Unredacted Final Report From Georgia Special Grand Jury Set for Release on Friday  —  The report includes the recommendation for Fulton County District Attorney Fani Willis to charge on related attempts to overturn the 2020 election  —  A Facebook icon representing an external link to share … ",
    "url": "https://themessenger.com/politics/unredacted-final-report-from-georgia-special-grand-jury-set-for-release-on-friday"
  },
  {
    "text": "Trump hosts $100,000-per-person Bedminster fundraiser to help Giuliani pay legal bills  —  Former President Donald Trump hosted a $100,000-a-plate fundraiser for disgraced former New York Mayor Rudy Giuliani at his Bedminster, New Jersey, golf club Thursday night as Giuliani struggles to pay his mounting legal bills.",
    "url": "https://apnews.com/article/trump-rudy-giuliani-fundraiser-bedminster-27724c04738a9d47114c3ea50b88b2ee"
  },
  {
    "text": "The GOP Is Losing the Doctor Vote in Pennsylvania.  Will the Party Flatline in 2024?  —  A political realignment around health care is reshaping state politics.  —  Animation by Kate Dehler for POLITICO  —  DERRY TOWNSHIP, Pa. —  Here in Hershey, the once-sleepy south-central Pennsylvania town built … ",
    "url": "https://www.politico.com/news/magazine/2023/09/08/pennsylvania-medical-establishment-gop-00114316"
  },
  {
    "text": "Tim Scott suggests opponents are planting stories about his unmarried status  —  The South Carolina senator has been slowly rising in early-state polls in the Republican presidential contest.  —  RYE, N.H. — Sen. Tim Scott suggested during a Thursday campaign stop in New Hampshire … ",
    "url": "https://www.nbcnews.com/politics/2024-election/tim-scott-suggests-opponents-are-planting-stories-unmarried-status-rcna103984"
  },
  {
    "text": "Wisconsin Republicans Try to Subvert Democracy, Again  —  For a little while this year, it looked as though Wisconsin voters had finally broken out of the straitjacket of minority rule in their state.  The key to their freedom was an April State Supreme Court election that … ",
    "url": "https://www.nytimes.com/2023/09/08/opinion/wisconsin-supreme-court-impeach.html"
  },
  {
    "text": "Prospect of Hunter Biden indictment and impeachment casts shadow over White House  —  Hunter Biden being indicted on an amended gun charge by the end of this month will complicate President Joe Biden's reelection campaign, particularly if there is a trial.  —  But how deeply Hunter Biden becomes … ",
    "url": "https://www.washingtonexaminer.com/news/white-house/hunter-biden-indictment-joe-biden-campaign"
  },
  {
    "text": "Biden administration considers forcing migrant families to remain in Texas  —  Immigration and the Border  —  The Biden administration is considering forcing some migrant families who enter the country without authorization to remain near the border in Texas  —  can we just list the border states then?",
    "url": "https://www.latimes.com/politics/story/2023-09-07/biden-migrant-families-border"
  },
  {
    "text": "Chaos, Comedy, and ‘Crying Rooms’: Inside Jimmy Fallon's ‘Tonight Show’  —  Sixteen current and former staffers say Fallon's erratic behavior spoiled their “dream” of working on The Tonight Show  —  I … The host, known for his warm and congenial presence onscreen, was acting especially dismissive … ",
    "url": "https://www.rollingstone.com/tv-movies/tv-movie-features/jimmy-fallon-tonight-show-toxic-work-environment-crying-rooms-nbc-1234819421/"
  },
  {
    "text": "Biden's Cabinet members told the White House they plan to stay for his full term  —  White House chief of staff Jeff Zients told all Cabinet members he wanted to know by the end of the summer whether they'll stay through next year.  —  WASHINGTON — Earlier this summer … ",
    "url": "https://www.nbcnews.com/politics/white-house/bidens-cabinet-members-told-white-house-plan-stay-put-rcna103927"
  },
  {
    "text": "They Did This to Themselves  —  THE DREAD IS PALPABLE.  —  Donald Trump's dominance over the Republican party and his overwhelming lead in primary polling has some conservatives shaking their fists at the sky.  —  “What, in Heaven's name, is the case for keeping him around?” asks an exasperated Charles Cooke in National Review.",
    "url": "https://plus.thebulwark.com/p/they-did-this-to-themselves"
  },
  {
    "text": "Anti-police activist discovers the consequences of ‘dismantling’ the police  —  Shivanthi Sathanandan describes herself on Twitter as ‘2nd Vice Chair, Minnesota Democratic-Farmer-Labor Party’—which is what the Democratic Party calls itself in Minnesota.  And we learned today that she was pretty viciously attacked:",
    "url": "https://twitchy.com/aaronwalker/2023/09/07/shivanthi-sathanandan-discovers-consequences-of-dismantling-the-police-n2386950"
  },
  {
    "text": "White House finishes $50 million renovation of Situation Room in first overhaul since 2007  —  A smaller room, where former President Barack Obama and top officials monitored the raid that killed Osama bin Laden, was preserved in its entirety and sent to the Obama library.",
    "url": "https://www.nbcnews.com/politics/white-house/white-house-finishes-50-million-renovation-situation-room-rcna104011"
  }
]