[
  {
    "text": "Scoop: Trump quietly moves Haley off his blacklist … - Trump is scrambling to make up a fundraising disadvantage against President Biden and pay legal fees. … - A reconciliation with Haley, his former UN ambassador, also could help Trump cut attract some of the college-educated Republicans … ",
    "url": "https://www.axios.com/2024/05/11/trump-moves-haley-off-blacklist-2024-election"
  },
  {
    "text": "Donald Trump says Nikki Haley not under consideration for vice president  —  Former President Donald Trump is dismissing a report that he is considering his GOP primary opponent Nikki Haley as a running mate.  —  Trump wrote on his social Media platform Truth Social Saturday that … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/05/11/donald-trump-nikki-haley-vice-presidet/73654328007/"
  },
  {
    "text": "Nikki Haley keeps racking up votes in final stretch of the GOP primary, and Donald Trump keeps ignoring them  —  Biden has a strategy for trying to bring anti-Trump Republicans to his side, while Trump still hasn't reached out to Haley two months after she dropped out of the primary.",
    "url": "https://www.politico.com/news/2024/05/11/nikki-haley-voters-00157455"
  },
  {
    "text": "Trump May Owe $100 Million From Double-Dip Tax Breaks, Audit Shows … The I.R.S. believes that former President Donald J. Trump violated a law meant to prevent double-dipping on tax-reducing losses.Jamie Kelter Davis for The New York Times  —  Former President Donald J. Trump used … ",
    "url": "https://www.nytimes.com/2024/05/11/us/trump-taxes-audit-chicago.html"
  },
  {
    "text": "IRS Audit of Trump Could Cost Former President More Than $100 Million  —  The tax agency concluded in its long-running investigation that Trump effectively claimed the same massive write-off twice on his failed Chicago tower.  —  Co-published with The New York Times",
    "url": "https://www.propublica.org/article/trump-irs-audit-chicago-hotel-taxes"
  },
  {
    "text": "Trump's Sleazy $1 Billion Shakedown of Oil Execs Gives Dems an Opening  —  Ever since Donald Trump descended that golden escalator in 2015, a central tenet of his bond with his supporters has been a simple promise to them: I have seen elite corruption and self-dealing from the inside, and I will put that know-how to work for you.",
    "url": "https://newrepublic.com/article/181493/trump-big-oil-campaign"
  },
  {
    "text": "Trump's youngest son Barron ‘declines’ to be RNC delegate, his mother Melania says  —  Barron Trump is declining to serve as a delegate on behalf of his father at the Republican National Convention, according to his mother's office.  —  The Florida Republican Party announced on Wednesday … ",
    "url": "https://www.bbc.com/news/world-us-canada-68992293"
  },
  {
    "text": "GOP escalates fight with Secret Service over convention protesters  —  Senior GOP representatives have been arguing for weeks with Secret Service officials, but the agency has not budged.  —  Top Republican Party officials are escalating their fight with the Secret Service over the party's convention … ",
    "url": "https://www.washingtonpost.com/politics/2024/05/10/republican-convention-milwaukee-protesters/"
  },
  {
    "text": "Narrative of Trump snoozing in court takes hold — much to his annoyance  —  It's unclear if Donald Trump has actually been sleeping, and he vehemently denies it.  But Democrats and late-night hosts have seized on the reports anyway.  —  “Don Snoreleone.”  “Donnie Nappleseed.”  “Sleepy Don.”",
    "url": "https://www.washingtonpost.com/politics/2024/05/11/trump-sleeping-trial-court/"
  },
  {
    "text": "Biden's isolation grows as Gaza report both criticizes and clears Israel  —  Like much of the president's, at times, halting approach toward the war, the report released to Congress on Friday drew criticism from across the political spectrum.",
    "url": "https://www.washingtonpost.com/politics/2024/05/10/biden-israel-human-rights-report/"
  },
  {
    "text": "Clarence Thomas says critics are pushing ‘nastiness’ and calls Washington a ‘hideous place’  —  The Supreme Court justice said that “reckless” people in Washington, D.C., will “bomb your reputation.”  —  FAIRHOPE, Ala. — Supreme Court Justice Clarence Thomas told attendees … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/justice-clarence-thomas-calls-washington-hideous-place-rcna151782"
  },
  {
    "text": "A guilty verdict?  Donald Trump and allies are bracing voters for the worst  —  WASHINGTON - When former president and 2024 candidate Donald Trump claims that the judicial system wants to put him in jail, he's not just protesting the ongoing hush money trial.  —  Trump is also bracing voters for the possibility of a guilty verdict.",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/05/11/trump-guilty-verdict-allies-prep-voters/73630657007/"
  },
  {
    "text": "Kristi Noem's dog killing is pure Southern gothic  —  A literary critic's take on the South Dakota governor's memoir, “No Going Back.”  —  Toward the end of Fred Gipson's 1956 classic, “Old Yeller,” Travis says, “It was going to kill something inside me to do it, but I knew then that I had to shoot my big yeller dog.”",
    "url": "https://www.washingtonpost.com/books/2024/05/10/kristi-noem-dog-book-review/"
  },
  {
    "text": "Will You Accept the Election Results?  Republicans Dodge the Question.  —  Leading Republicans have refused to say flatly that they will accept the outcome of the presidential election if Donald Trump loses.  —  Less than six months out from the presidential contest, leading Republicans … ",
    "url": "https://www.nytimes.com/2024/05/11/us/politics/republicans-election-denial.html"
  }
]