[
  {
    "text": "Trump: ‘I Need the Kind of Generals That Hitler Had’  —  To support The Atlantic's journalism, please consider subscribing today.  —  In April 2020, Vanessa Guillén, a 20-year-old Army private, was bludgeoned to death by a fellow soldier at Fort Hood, in Texas.",
    "url": "https://www.theatlantic.com/politics/archive/2024/10/trump-military-generals-hitler/680327/?gift=guxsrl_dAdXUP9zqbQPWxeXgG6TzRGw9UxuZ0SJ0TQw&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "As Election Nears, Kelly Warns Trump Would Rule Like a Dictator  —  John Kelly, the Trump White House's longest-serving chief of staff, said that he believed that Donald Trump met the definition of a fascist.  —  Few top officials spent more time behind closed doors in the White House … ",
    "url": "https://www.nytimes.com/2024/10/22/us/politics/john-kelly-trump-fitness-character.html?unlocked_article_code=1.UE4.qRWh.Vr3WYAUHll29&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Trump Was Enraged by Funeral Cost for ‘F-king Mexican’ U.S. Soldier: Report  —  The former president also said he needed “the kind of generals that Hitler had,” The Atlantic reports  —  Donald Trump has a long history of disrespect for deceased members of the military and immigrants.",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-raged-soldier-funeral-hitler-generals-1235140426/"
  },
  {
    "text": "Trump Raged at Slain Soldier's Funeral Bill: ‘$60K to Bury a F***ing Mexican’  —  ANOTHER BILL UNPAID  —  When Donald Trump got the bill for Vanessa Guillén's funeral in 2020, he reportedly raged, “It doesn't cost 60,000 bucks to bury a f—ing Mexican!”",
    "url": "https://www.thedailybeast.com/trump-raged-at-slain-soldiers-funeral-bill-60k-to-bury-a-fing-mexican/"
  },
  {
    "text": "Trump hurls a string of insults at Harris including ‘lazy,’ a racist trope against Black people  —  Republican presidential nominee Donald Trump on Tuesday hurled a series of personal attacks at Vice President Kamala Harris, calling her “lazy” — a word long used to demean Black people in racist terms … ",
    "url": "https://apnews.com/article/trump-kamala-lazy-trope-stereotype-4c2ded1046e492c5d24c7382245d0f7b"
  },
  {
    "text": "Here's What My Gut Says About the Election.  But Don't Trust Anyone's Gut, Even Mine.  —  In an election where the seven battleground states are all polling within a percentage point or two, 50-50 is the only responsible forecast.  Since the debate between Kamala Harris and Donald Trump … ",
    "url": "https://www.nytimes.com/2024/10/23/opinion/election-polls-results-trump-harris.html"
  },
  {
    "text": "Why I'm Certain Kamala Harris Will Win  —  There is a palpable anxiety wailing on the winds of American life right now.  More than in any other election in my lifetime, I've been consistently asked by people of all stripes and creeds: “Can Kamala Harris win this thing?  Are we going to be OK?”",
    "url": "https://www.nytimes.com/2024/10/23/opinion/kamala-harris-win-election.html"
  },
  {
    "text": "Rudy Giuliani must give control of luxury items and Manhattan apartment to Georgia election workers he defamed, judge rules  —  A federal judge on Tuesday ordered former Donald Trump attorney and New York mayor Rudy Giuliani to turn over all his valuable possessions and his Manhattan penthouse apartment … ",
    "url": "https://www.cnn.com/2024/10/22/politics/rudy-giuliani-bankruptcy-georgia-election-workers"
  },
  {
    "text": "Judge who tossed Trump's classified docs case on list of proposed candidates for attorney general  —  Federal Judge Aileen Cannon dismissed Trump's classified documents case in July.  —  Republican presidential nominee, former President Donald Trump takes the stage during a campaign rally … ",
    "url": "https://abcnews.go.com/US/judge-tossed-trumps-classified-docs-case-list-proposed/story?id=114997807"
  },
  {
    "text": "Biden highlights drug cost savings, hits Trump on ‘concepts’ of ObamaCare plan  —  President Biden on Tuesday highlighted his administration's efforts to lower prescription drug costs as he seeks to cement his legacy in his final months in office.  —  At an event in New Hampshire alongside … ",
    "url": "https://thehill.com/homenews/campaign/4947728-biden-sanders-drug-costs-new-hampshire/"
  },
  {
    "text": "House Republicans brace for leadership scramble  —  House Republicans are bracing for potential leadership shake-ups in the coming weeks, a post-election scramble that will heavily depend on who wins control of the lower chamber and White House in November.  —  The biggest wildcard is what Speaker Mike Johnson (R-La.) will do.",
    "url": "https://thehill.com/homenews/house/4947831-house-gop-leadership-johnson-jordan-scalise/"
  },
  {
    "text": "Los Angeles Times won't endorse for president  —  The Scoop  —  The owner of the Los Angeles Times has blocked the paper from endorsing a candidate for president this year.  —  Last week, the LA Times published its electoral endorsements for the 2024 election.",
    "url": "https://www.semafor.com/article/10/22/2024/los-angeles-times-wont-endorse-for-president"
  },
  {
    "text": "Meta suspends accounts tracking Trump, Bezos jets, echoing Elon Musk's X  —  Instagram and Threads blocked accounts that shared public data on Mark Zuckerberg's and Donald Trump's private planes.  A similar move on X stirred up a free-speech firestorm.",
    "url": "https://www.washingtonpost.com/technology/2024/10/22/meta-suspends-private-jet-tracking-trump-musk/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI5NTY5NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzMwOTU1NTk5LCJpYXQiOjE3Mjk1Njk2MDAsImp0aSI6ImQ0ZTljYWVkLWEyNTItNGUzNi04NTFmLTNhMmJiNTQ5N2JjNCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS90ZWNobm9sb2d5LzIwMjQvMTAvMjIvbWV0YS1zdXNwZW5kcy1wcml2YXRlLWpldC10cmFja2luZy10cnVtcC1tdXNrLyJ9.7_5djiqd11g7YEZKIYm8YodHp_97KglRaa-wckJ6d98&itid=gfta"
  },
  {
    "text": "Bill Gates Privately Says He Has Backed Harris With $50 Million Donation  —  Mr. Gates said in a statement to The Times that “this election is different,” reflecting a significant change in his political strategy.  —  After decades of sitting on the sidelines of politics, Bill Gates … ",
    "url": "https://www.nytimes.com/2024/10/22/us/elections/bill-gates-future-forward-kamala-harris.html?unlocked_article_code=1.UE4.zULj._yKRUO7AtSiJ&smid=nytcore-ios-share&referringSource=articleShare&tgrp=bth"
  },
  {
    "text": "Russia is behind viral disinformation targeting Walz, intelligence official says  —  Groups in Russia created and helped spread viral disinformation targeting Democratic vice presidential candidate Tim Walz, a senior U.S. intelligence official said Tuesday.  The content, which includes … ",
    "url": "https://apnews.com/article/walz-russia-disinformation-election-harris-trump-8646b7f354df629cd5d6661ba51e7174"
  },
  {
    "text": "Texas library committee suspended, decision to reclassify Indigenous history book as “fiction” reversed  —  Last week, Popular Information reported that Montgomery County, Texas had mandated public libraries move a well-regarded children's book documenting the mistreatment of Native Americans … ",
    "url": "https://popular.info/p/update-texas-library-committee-suspended"
  },
  {
    "text": "Trump set to go on Joe Rogan's podcast  —  Former President Donald Trump is expected to record an interview with podcasting behemoth Joe Rogan on Friday.  The interview will take place at Rogan's studio in Austin, Texas, according to a person familiar with the plans who was granted anonymity to discuss the matter.",
    "url": "https://www.politico.com/live-updates/2024/10/22/2024-elections-live-coverage-updates-analysis/trump-joe-rogan-podcast-00184894"
  },
  {
    "text": "How the hell is this even close?  —  It boggles the mind.  But it's not unexplainable. … The presidential election remains a coin toss, which in and of itself isn't unusual.  Most presidential elections since 2000 have been very close.  Even 2008, the lone blowout, was a nail-biter until the very end of the campaign.",
    "url": "https://www.publicnotice.co/p/harris-trump-how-the-hell-is-this-close"
  },
  {
    "text": "Georgia Supreme Court halts reinstatement of new election rules while weighing appeal  —  Georgia's top court on Tuesday declined to let several controversial election rules go into effect while it weighs an appeal by national Republicans.  The rules were passed in recent months by the State Election Board … ",
    "url": "https://thehill.com/homenews/state-watch/4947482-georgia-supreme-court-halts-election-rules/"
  },
  {
    "text": "McDonald's Quarter Pounder burgers linked to E. coli outbreak  —  McDonald's Quarter Pounder burgers and some ingredients will be temporarily unavailable in some states to protect customers after the food was linked to an E. coli outbreak, according to a press release from the Centers for Disease Control and Prevention (CDC) on Tuesday.",
    "url": "https://thehill.com/policy/healthcare/4947556-mcdonalds-quarter-pounder-e-coli/"
  },
  {
    "text": "Harris lifted language from Republican attorney in her 2007 congressional testimony  —  Kamala Harris lifted language from a Republican attorney when she testified in front of Congress in 2007, a CNN review of her testimony finds.  —  Experts CNN spoke with said that the instance … ",
    "url": "https://www.cnn.com/2024/10/22/politics/kamala-harris-plagiarism-allegation-congressional-testimony"
  }
]