[
  {
    "text": "Trump's co-defendants are already starting to turn against him  —  There's a nascent courtroom strategy by some people close to Donald Trump: Heap blame on the former president.  —  The finger-pointing among Donald Trump's inner circle has begun.  —  And as his four criminal cases march toward trials … ",
    "url": "https://www.politico.com/news/2023/09/05/trump-cases-defendants-flipping-00113910"
  },
  {
    "text": "The 14th Amendment Trump Panic  —  Banning Trump from the ballot under Section 3 of the post-Civil War constitutional amendment would harm U.S. law and democracy.  —  You'd think Donald Trump's opponents would learn.  When they fight the former President in the voting booth … ",
    "url": "https://www.wsj.com/articles/the-14th-amendment-donald-trump-panic-election-ballot-constitution-amendment-candidate-president-fb3d65?mod=followamazon"
  },
  {
    "text": "Alabama's congressional map is struck down again for diluting Black voters' power  —  A panel of three federal judges has struck down Alabama's latest map of congressional election districts for not following a court order to comply with the landmark Voting Rights Act.",
    "url": "https://www.npr.org/2023/09/05/1193749552/alabama-congressional-map"
  },
  {
    "text": "Federal Court Again Strikes Down Alabama's Congressional Map  —  Republicans failed to comply with a court order to create a second majority-Black district or something “close to it,” the judicial panel said.  —  A panel of federal judges rejected Alabama's latest congressional map on Tuesday … ",
    "url": "https://www.nytimes.com/2023/09/05/us/politics/alabama-congressional-map.html"
  },
  {
    "text": "Consistent Signs of Erosion in Black and Hispanic Support for Biden  —  It's a weakness that could manifest itself as low Democratic turnout even if Trump and Republicans don't gain among those groups.  —  President Biden is underperforming among nonwhite voters in New York Times/Siena College national polls … ",
    "url": "https://www.nytimes.com/2023/09/05/upshot/biden-trump-black-hispanic-voters.html"
  },
  {
    "text": "Why Hunter Biden might not be the slam dunk issue GOP commentators hoped  —  The controversy surrounding Hunter Biden is falling flat in the GOP primary.  —  Aides to President Joe Biden had braced for the Republican candidates to pile on the Hunter Biden attacks during the first primary debate.",
    "url": "https://www.politico.com/news/2023/09/05/hunter-biden-gop-primary-00113820"
  },
  {
    "text": "CNN Exclusive: Special counsel election probe continues with focus on fundraising, voting equipment breaches  —  Special counsel Jack Smith is still pursuing his investigation into efforts to overturn the 2020 election a month after indicting Donald Trump for orchestrating a broad conspiracy … ",
    "url": "https://www.cnn.com/2023/09/05/politics/special-counsel-election-probe-continues-fundraising-voting-equipment-breaches-sidney-powell/"
  },
  {
    "text": "‘Stop Cop City’ Activists Hit With RICO Charges By Same Grand Jury That Indicted Trump  —  The defendants include a legal observer arrested at a protest, activists who distributed fliers, and others who ran a bail fund.  —  Georgia prosecutors have filed racketeering charges against 61 people accused … ",
    "url": "https://www.thedailybeast.com/stop-cop-city-activists-hit-with-rico-charges-by-same-georgia-grand-jury-that-indicted-trump"
  },
  {
    "text": "Three service secretaries to Tuberville: Stop this dangerous hold on senior officers  —  Carlos Del Toro is secretary of the Navy.  Frank Kendall is secretary of the Air Force.  Christine Wormuth is secretary of the Army.  —  As the civilian leaders of the Navy, Air Force, Space Force and Army … ",
    "url": "https://www.washingtonpost.com/opinions/2023/09/04/army-navy-air-force-secretaries-tuberville-military-hold/"
  },
  {
    "text": "How Democrats are bracing for a ‘MAGA shutdown’  —  Presented by DEMS STRIVE TO STICK TOGETHER  —  There's still a month to go, but Capitol Hill is girding for an appropriations breakdown — and Democrats are already strategizing over how to make Republicans pay for what some have already started calling a “MAGA shutdown.”",
    "url": "https://www.politico.com/newsletters/huddle/2023/09/05/how-democrats-are-bracing-for-a-maga-shutdown-00113940"
  },
  {
    "text": "Capitol Hill doctor: McConnell did not have a stroke or seizure when freezing before cameras  —  The Capitol's attending physician, Brian Monahan, said in a new letter that Senate GOP Leader Mitch McConnell did not suffer a stroke or seizure - and is not suffering from Parkinson's disease … ",
    "url": "https://www.cnn.com/2023/09/05/politics/mitch-mcconnell-health-latest/"
  },
  {
    "text": "Disney tickets, PS5s, and big-screen TVs: Florida parents exploit DeSantis' school vouchers  —  Florida parents are taking advantage of an expanded school voucher program championed by Governor Ron DeSantis (R), according to messages from private Facebook groups obtained by Popular Information.",
    "url": "https://popular.info/p/disney-tickets-ps5s-and-big-screen"
  },
  {
    "text": "Famed hacker and Twitter whistleblower Peiter ‘Mudge’ Zatko is joining the Biden administration  —  Welcome to The Cybersecurity 202!  What were you all up to over our break?  I made it back to Indiana for a lovely wedding between two dear friends.  —  Was this forwarded to you?  Sign up here.",
    "url": "https://www.washingtonpost.com/politics/2023/09/05/cisa-makes-big-name-hire-its-crusade-against-insecure-products/"
  },
  {
    "text": "Alex Murdaugh Lawyers Claim Fame-Hungry Clerk Rebecca Hill Tainted Jury  —  They are appealing his murder conviction and demanding a federal investigation—but the clerk denies wrongdoing.  —  Alex Murdaugh's attorneys are demanding a new trial and a federal investigation … ",
    "url": "https://www.thedailybeast.com/alex-murdaugh-lawyers-claim-fame-hungry-clerk-rebecca-hill-tainted-jury"
  },
  {
    "text": "Texas fracking billionaire brothers fuel rightwing media with millions of dollars  —  Farris and Dan Wilks' deep pockets fund climate denialism education, conservative politicians and pro-fossil fuel projects  —  Two billionaire Texas brothers whose fortunes derive from oil and gas fracking … ",
    "url": "https://www.theguardian.com/us-news/2023/sep/05/texas-fracking-billionaire-brothers-prageru-daily-wire"
  },
  {
    "text": "CNN Poll: GOP voters' broad support for Trump holds, with less than half seriously worried criminal charges will harm his 2024 chances  —  Former President Donald Trump continues to hold what has proven to be an unshakeable position atop the Republican field of candidates vying … ",
    "url": "https://www.cnn.com/2023/09/05/politics/cnn-poll-trump-primary-criminal-charges/"
  },
  {
    "text": "D.C. POLL: 64% of Residents Would Find Trump Guilty Ahead of Trial  —  Home Polls D.C. POLL: 64% of Residents Would Find Trump Guilty Ahead of Trial  —  A new Emerson College Polling survey in the nation's capital asked D.C. residents if they would vote to find former President Donald Trump guilty … ",
    "url": "https://emersoncollegepolling.com/d-c-poll-64-of-residents-would-find-trump-guilty-ahead-of-trial/"
  },
  {
    "text": "Trump Ally Perry's Phone-Records Fight With DOJ Revived by Court  — Perry fought special counsel access to phone in Jan. 6 probe  — Donald Trump federally indicted while phone fight was pending  —  A federal appeals court has revived Republican Representative Scott Perry's fight … ",
    "url": "https://www.bloomberg.com/news/articles/2023-09-05/trump-ally-perry-s-phone-records-fight-with-doj-revived-by-court"
  },
  {
    "text": "Truth Social investment partner extends deadline, avoiding liquidation  —  The extension will give Digital World Acquisition another year to merge with Donald Trump's start-up  —  Shareholders in Digital World Acquisition, the investment partner of former president Donald Trump's media start-up … ",
    "url": "https://www.washingtonpost.com/technology/2023/09/05/trump-truth-social-merger-extension-dwac/"
  },
  {
    "text": "Fan thrown out of U.S. Open after German star says they used ‘famous Hitler phrase’  —  Alexander Zverev, who won the match against Jannik Sinner, said that the fan had started “singing the anthem of Hitler that was back in the day.”  —  A fan was removed from a U.S. Open tennis match … ",
    "url": "https://www.nbcnews.com/news/us-news/us-open-fan-thrown-out-zverev-match-famous-hitler-phrase-rcna103338"
  },
  {
    "text": "EU's Reynders to Take Over Antitrust Reins When Vestager Steps Aside  — Vestager due to step down imminently in race for top EIB role  — Jourova will be promoted to executive vice president position … Reynders will take on the competition policy portfolio when her nomination to lead … ",
    "url": "https://www.bloomberg.com/news/articles/2023-09-05/eu-s-reynders-to-take-over-antitrust-reins-when-vestager-steps-aside"
  }
]