[
  {
    "text": "Musk Cronies Dive Into Treasury Dept Payments Code Base  —  Overnight, Wired reported that, contrary to published reports that DOGE operatives at the Treasury Department are limited to “read only” access to department payment systems, this is not true.  A 25-year-old DOGE operative named Marko Elez … ",
    "url": "https://talkingpointsmemo.com/edblog/musk-cronies-dive-into-treasury-dept-payments-code-base/sharetoken/f6ef509c-ac91-4914-ad6d-4b0f6f8abc3b"
  },
  {
    "text": "A 25-Year-Old With Elon Musk Ties Has Direct Access to the Federal Payment System  —  The Bureau of the Fiscal Service is a sleepy part of the Treasury Department.  It's also where, sources say, a 25-year-old engineer tied to Elon Musk has admin privileges over the code that controls Social Security payments, tax returns, and more.",
    "url": "https://www.wired.com/story/elon-musk-associate-bfs-federal-payment-system/"
  },
  {
    "text": "Federal Workers Sue to Disconnect DOGE Server  —  Two federal workers, citing reports that Elon Musk's associates are operating an illegally connected email server at OPM, seek a restraining order.  —  Federal employees are seeking a temporary restraining order as part of a class action lawsuit accusing … ",
    "url": "https://www.wired.com/story/federal-workers-sue-over-doge-server/"
  },
  {
    "text": "Elon Musk's Power Grab Is Lawless, Dangerous, and—Yes—a Coup  —  The federal government is currently under relentless and unlawful assault by a man no one elected to lead it.  With Donald Trump's blessing and enabling, Elon Musk and his confederates have laid siege to the executive branch … ",
    "url": "https://slate.com/news-and-politics/2025/02/elon-musk-power-grab-trump-coup.html"
  },
  {
    "text": "About 20,000 federal workers took “buyout” so far, official says  —  About 20,000 federal workers have accepted the “buyout” offer put forward by the Trump administration last week, a senior administration official tells Axios. … - The offer is open through Thursday, meaning the total could rise … ",
    "url": "https://www.axios.com/2025/02/04/trump-buyout-federal-workers-20000"
  },
  {
    "text": "FBI turns over names of 5,000 employees who worked on January 6 cases to Trump Justice Department, as agents sue  —  FBI officials have complied with demands to provide the Justice Department with a list of thousands of employees who worked on investigations related to the January 6, 2021 … ",
    "url": "https://www.cnn.com/2025/02/04/politics/fbi-employees-tuesday"
  },
  {
    "text": "U.S. government officials privately warn Musk's blitz appears illegal  —  The billionaire's DOGE team has launched an all-out assault on federal agencies, triggering numerous legal objections.  —  The chaotic blitz by Elon Musk's Department of Government Efficiency has triggered legal … ",
    "url": "https://www.washingtonpost.com/business/2025/02/04/elon-musk-government-legal-doge/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM4NjQ1MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQwMDI3NTk5LCJpYXQiOjE3Mzg2NDUyMDAsImp0aSI6ImJmNWQ2YmJhLWQzYmEtNDdkMS05MDQ0LTVhZWI2ZjNhYjllMiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9idXNpbmVzcy8yMDI1LzAyLzA0L2Vsb24tbXVzay1nb3Zlcm5tZW50LWxlZ2FsLWRvZ2UvIn0.nAg1iiymvc20QOtIdoLG04zHuSNFRwgDGTLPr4OLgHI&itid=gfta"
  },
  {
    "text": "Trump suggests displaced Palestinians in Gaza be ‘permanently’ resettled outside war-torn territory  —  President Donald Trump said Tuesday he isn't ruling out deploying U.S. troops to support reconstruction of Gaza and he envisions “long-term” U.S. ownership of a redevelopment of the territory.",
    "url": "https://apnews.com/article/trump-netanyahu-washington-ceasefire-1c8deec4dd46177e08e07d669d595ed3"
  },
  {
    "text": "State Department moving to evacuate USAID staff worldwide: Sources  —  The State Department has begun working to assist in evacuating all USAID staff who are on foreign assignments worldwide, sources familiar with the effort told ABC News.  —  The Department is aiming to recall all USAID employees … ",
    "url": "https://abcnews.go.com/Politics/live-updates/trump-second-term-live-updates/?id=118389757&entryId=118457128"
  },
  {
    "text": "Democrats Are Falling For Trump and Musk's Foreign Aid Trap  —  Three veteran strategists want their party to be more thoughtful about fighting Trump's anti-bureaucracy campaign.  —  After three months of soul-searching about how to revive their party, some Democrats this week believe … ",
    "url": "https://www.politico.com/news/magazine/2025/02/04/democrats-foreign-aid-trap-trump-00202447"
  },
  {
    "text": "White House preparing executive order to abolish the Department of Education  —  The planned order follows years of campaign promises from President Donald Trump to abolish the federal Education Department.  —  The White House is preparing an executive order to eliminate the Department of Education … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/white-house-preparing-executive-order-abolish-department-education-rcna190205"
  },
  {
    "text": "NFL to remove ‘End Racism’ messaging in end zone ahead of Super Bowl: Sources  —  NEW ORLEANS — At his annual news conference Monday, NFL commissioner Roger Goodell expressed strong support for the league's policies designed to promote diversity at the club-employment level and indicated that those endeavors will continue.",
    "url": "https://www.nytimes.com/athletic/6112317/2025/02/04/nfl-end-racism-super-bowl-dei-trump/"
  },
  {
    "text": "RFK Jr. closes in on HHS Cabinet post after Senate panel vote  —  Robert F. Kennedy Jr., once seen as a long shot to serve as America's top health official, is now set to head to the Senate floor for a confirmation vote.  —  Robert F. Kennedy Jr. is now one step closer to running … ",
    "url": "https://www.washingtonpost.com/health/2025/02/04/rfk-jr-confirmation-committee-vote-hhs-secretary/"
  },
  {
    "text": "Trump and Musk demand termination of federal office leases through General Services Administration  —  One of the next moves in President Donald Trump and Elon Musk's sweeping effort to fire government employees and curtail operations is using the agency that manages thousands … ",
    "url": "https://apnews.com/article/trump-musk-gsa-terminate-office-leases-f8faac5e2038722f705587c8dd21ab26"
  },
  {
    "text": "‘Things Are Going to Get Intense:’ How a Musk Ally Plans to Push AI on the Government  —  Thomas Shedd, a Musk-associate and now head of the General Services Administration's Technology Transformation Services (TTS), told government tech workers in a meeting this week that the administration plans … ",
    "url": "https://www.404media.co/things-are-going-to-get-intense-how-a-musk-ally-plans-to-push-ai-on-the-government/"
  },
  {
    "text": "Breaking the Law  —  Just weeks in, the Trump administration has violated rules, laws, and the Constitution.  —  “In America,” Thomas Paine wrote at the founding, “the law is king.”  Amid today's governing and constitutional crisis, we are finding out whether that is still true.",
    "url": "https://www.brennancenter.org/our-work/analysis-opinion/breaking-law"
  },
  {
    "text": "Republican Senators Say They're Fine Handing Their Power to Elon Musk  —  Musk's actions may be unconstitutional but “nobody should bellyache about that,” Sen. Thom Tillis said.  — Copy  —  Tech billionaire Elon Musk is working to shut down government agencies and cancel congressionally approved funding … ",
    "url": "https://www.notus.org/congress/trump-musk-treasury-spending"
  },
  {
    "text": "Negotiations stall ahead of shutdown deadline as Democrats slam Trump for subverting spending laws  —  Democrats are eying the March 14 deadline to push back on Trump's recent unilateral actions, saying he needs to follow the law on government funding.  —  WASHINGTON — Government funding negotiations … ",
    "url": "https://www.nbcnews.com/politics/congress/negotiations-stall-shutdown-deadline-democrats-slam-trump-rcna190464"
  },
  {
    "text": "‘Beyond betrayal.’ Venezuelans in Florida are angry at Trump immigration policy  —  MIAMI — Venezuelan migrants in South Florida say they feel betrayed by a Trump administration decision to end legal protections for hundreds of thousands of people who fled dictatorships and sought refuge in the U.S.",
    "url": "https://www.npr.org/2025/02/04/nx-s1-5285470/venezuelans-florida-tps-immigration-trump"
  },
  {
    "text": "EPA spending freeze continues despite court orders  —  Two judges have ordered the administration to lift the freeze.  But nonprofits and states still can't get money for contracts backed by the Inflation Reduction Act.  —  The Trump administration is still freezing many climate … ",
    "url": "https://www.politico.com/news/2025/02/04/epa-spending-freeze-court-orders-00202253"
  },
  {
    "text": "EXCLUSIVE: Daniel Penny Gets Hired by Andreessen Horowitz  —  “Daniel acted with courage in a tough situation,” said partner David Ulevitch in a statement explaining the hire.  —  In less than two months, Daniel Penny has gone from facing a potential 20 years in prison to landing a role … ",
    "url": "https://www.thefp.com/p/exclusive-daniel-penny-hired-at-andreessen-horowitz"
  },
  {
    "text": "Scoop: Senate Dems plot USAID revenge on Trump … - Sen. Richard Blumenthal (D-Conn.) told Axios on Tuesday that he's willing to place holds on Trump nominees on the Senate Judiciary Committee.  — Blumenthal said the caucus is proceeding as if there is a blanket hold on Trump nominations.",
    "url": "https://www.axios.com/2025/02/04/senate-democrats-holds-nominees-usaid"
  },
  {
    "text": "U.S. Begins Migrant Flights to Guantanamo Bay  —  The Trump administration has said it would expand operations at the American naval base in Cuba to hold up to 30,000 immigrants  —  WASHINGTON—The first flights carrying detained migrants from the U.S. to Guantanamo Bay have headed … ",
    "url": "https://www.wsj.com/politics/policy/u-s-begins-migrant-flights-to-guantanamo-bay-9fec8df3?st=XxUA5s"
  },
  {
    "text": "Family member condemns use of armored vehicle, stun grenades in Phoenix ICE arrest  —  A family member is speaking out against an ICE operation in northwest Phoenix on Sunday, calling it an unnecessary use of force that involved an armored vehicle, flash bang grenades and several dozen ICE agents … ",
    "url": "https://www.azcentral.com/story/news/politics/immigration/2025/02/03/phoenix-ice-arrest-61-year-old-man-involves-armored-vehicle-stun-grenades/78189148007/"
  },
  {
    "text": "Donald Trump Jr. accused of illegal duck hunting near Venice  —  Donald Trump Jr., the eldest son of U.S. President Donald Trump, broke Italian and European Union environmental protection laws when he hunted ducks near Venice in December, according to two Italian Green party lawmakers.",
    "url": "https://www.usatoday.com/story/news/politics/2025/02/04/donald-trump-jr-hunting/78207902007/"
  },
  {
    "text": "Proud Boys Lose Control of Their Name to a Black Church They Vandalized  —  A judge awarded the trademarked name and symbols to a Washington church to help satisfy a $2.8 million judgment against the far-right group.  —  The Proud Boys no longer have control over their own name.",
    "url": "https://www.nytimes.com/2025/02/03/us/politics/proud-boys.html?unlocked_article_code=1.uU4.lp9k.r2aKo3bH0DJX&smid=nytcore-ios-share&referringSource=articleShare"
  }
]