[
  {
    "text": "DOJ expected to announce indictment of Texas Democratic Rep. Henry Cuellar, sources say  —  Federal authorities searched the congressman's home in Laredo in 2022 as part of an investigation into the country of Azerbaijan and a group of U.S. businessmen.  —  WASHINGTON — The Justice Department … ",
    "url": "https://www.nbcnews.com/politics/congress/doj-expected-announce-indictment-texas-democratic-rep-henry-cuellar-so-rcna150567"
  },
  {
    "text": "U.S. Congressman Henry Cuellar and His Wife Charged with Bribery, Unlawful Foreign Influence, and Money Laundering Schemes  —  For Immediate Release  —  Congressman Allegedly Accepted $600,000 in Bribes from Two Foreign Entities in Exchange for Official Acts as a Member of Congress",
    "url": "https://www.justice.gov/opa/pr/us-congressman-henry-cuellar-and-his-wife-charged-bribery-unlawful-foreign-influence-and"
  },
  {
    "text": "Democratic US Rep. Henry Cuellar of Texas and his wife are indicted over ties to Azerbaijan  —  Democratic U.S. Rep. Henry Cuellar of Texas and his wife were indicted on conspiracy and bribery charges and taken into custody Friday in connection with a U.S. Department of Justice probe … ",
    "url": "https://apnews.com/article/henry-cuellar-texas-azerbaijan-ddb1dea393ba88d8d823557ec6c0d93a"
  },
  {
    "text": "Trump Trial Live Updates: Hope Hicks Details Campaign's Panic Over ‘Access Hollywood’ Tape  —  On the stand in Donald J. Trump's criminal trial, Ms. Hicks, who was his press secretary in 2016, described the chaos that ensued after the infamous recording of the candidate discussing how he groped women was made public.",
    "url": "https://www.nytimes.com/live/2024/05/03/nyregion/trump-hush-money-trial"
  },
  {
    "text": "“More credible”: Legal experts say Hope Hicks' testimony “ties everything more closely to Trump”  —  “The DA's office is going to argue that all of these puzzle pieces add up to a crime,” law professor says  —  Former Trump campaign press secretary and White House communications director Hope Hicks testified … ",
    "url": "https://www.salon.com/2024/05/03/more-credible-legal-experts-say-hope-hicks-testimony-ties-everything-more-closely-to-trump/"
  },
  {
    "text": "Hope Hicks gets teary testifying at Trump's hush money trial  —  After a week of tabloid-focused testimony, the former aide led the jury through the whirlwind of the 2016 campaign and directly to the Oval Office.  —  NEW YORK — Hope Hicks, a former top aide to Donald Trump … ",
    "url": "https://www.washingtonpost.com/politics/2024/05/03/trump-hush-money-trial-hope-hicks-testimony/"
  },
  {
    "text": "SEC charges Trump Media auditor with ‘massive fraud’ on hundreds of companies, imposes lifetime ban … The auditing firm for Trump Media and the auditor's owner were charged Friday with “massive fraud” by the Securities and Exchange Commission for work that affected more than 1,500 SEC filings, the federal regulator announced.",
    "url": "https://www.cnbc.com/2024/05/03/trump-media-auditor-charged-by-sec-with-massive-fraud-permanently-barred-from-public-company-audits.html"
  },
  {
    "text": "Mark Meadows unmasked in Arizona fake electors indictment, faces 9 felony charges: Report  —  Charges have formally been made public against Mark Meadows, the onetime chief of staff to former President Donald Trump, in the expansive fake electors case now underway in Arizona.",
    "url": "https://lawandcrime.com/high-profile/mark-meadows-unmasked-in-arizona-fake-electors-indictment-faces-9-felony-charges-report/"
  },
  {
    "text": "Statement From Attorney General Ken Paxton After Austin City Council Threatens Noncompliance with Texas Law Prohibiting “Gender Transition” Treatments For Children  —  Texas Attorney General Ken Paxton issued the following statement reminding the City of Austin of the obligations Texas municipalities … ",
    "url": "https://www.texasattorneygeneral.gov/news/releases/statement-attorney-general-ken-paxton-after-austin-city-council-threatens-noncompliance-texas-law"
  },
  {
    "text": "Biden's allies move to sink RFK Jr.  —  The effort reflects a level of concern among Democrats about Kennedy — but also an opportunity they see to wound Donald Trump.  —  The coalition of Democratic groups that pressured No Labels out of the 2024 contest is now turning its sights on Robert F. Kennedy Jr.",
    "url": "https://www.politico.com/news/2024/05/03/bidens-allies-move-to-sink-rfk-jr-00156113"
  },
  {
    "text": "Biden faces new Democratic pressure to rein in Israel … - Among the assurances is that the country will “facilitate and not arbitrarily deny, restrict, or otherwise impede” aid into Gaza, or else U.S. weapons transfers would be halted. … - They pointed to allegations … ",
    "url": "https://www.axios.com/2024/05/03/biden-house-democrats-israel-gaza"
  },
  {
    "text": "Louisiana governor fires back at Mick Jagger jab: ‘Might remember the Stone Age’  —  Gov. Jeff Landry (R-LA) hit back at Rolling Stones singer Mick Jagger after the rock star threw a jab at him.  —  At a Thursday night concert, Jagger, 80, made a quip that Landry wanted to return the world to the Stone Age … ",
    "url": "https://www.washingtonexaminer.com/news/2991070/louisiana-governor-mick-jagger-jab-stone-age/"
  },
  {
    "text": "Legal challenge to Amazon UK's new “one-click to quit the union” tool  —  Following the news that Amazon warehouse workers in Coventry will soon get to vote on Trade Union recognition, Foxglove is supporting five workers at the Amazon UK Coventry warehouse to launch a legal challenge of Amazon's latest union-busting tactic.",
    "url": "https://www.foxglove.org.uk/2024/05/02/legal-challenge-to-amazon-uks-new-one-click-to-quit-the-union-tool/"
  },
  {
    "text": "Liberals Must Resist the New McCarthyism Over Israel Criticism  —  The hysteria over Palestine protests on campus that is being ginned up to protect US support for Israel's war is the beginning of a new Red Scare.  Liberals must resist it, because it will come for them, too.",
    "url": "https://jacobin.com/2024/05/israel-campus-protest-antisemitism-mccarthyism/"
  },
  {
    "text": "Missouri abortion rights group collects enough signatures to advance ballot measure  —  An amendment to enshrine abortion rights in the Missouri constitution is now one step closer to appearing before voters this year.  —  A proposed amendment to enshrine abortion access in Missouri's constitution cleared … ",
    "url": "https://www.nbcnews.com/politics/2024-election/missouri-abortion-rights-ballot-measure-rcna150448"
  },
  {
    "text": "8 Possible Trump VP Candidates Who Haven't Shot Their Dogs  —  That we know of!  —  LOADING  —  Kristi Noem thought the political world would be impressed by her story of executing a dog, but she seems to have misjudged her fellow Republicans — including, most critically, Donald Trump.",
    "url": "https://www.huffpost.com/entry/trump-vp-list-kristi-noem_n_6634f704e4b0fc2b95294be2"
  },
  {
    "text": "Anti-Israel George Washington University Professor Dubs US Congressman a ‘Race Traitor’ and ‘Uncle Tom’  —  A George Washington University professor accused an African American congressman of being a “race traitor” and an “Uncle Tom” over his support for Jewish students as they face a tidal wave … ",
    "url": "https://freebeacon.com/campus/anti-israel-george-washington-university-professor-dubs-us-congressman-a-race-traitor-and-uncle-tom/"
  },
  {
    "text": "US diplomat who quit over Biden administration's Gaza policy speaks out  —  Hala Rharrit never expected that she would choose to leave her career as a US diplomat.  —  She had spent her “entire adult life” at the State Department having joined the foreign service in 2006 … ",
    "url": "https://www.cnn.com/2024/05/03/politics/hala-rharrit-us-diplomat-biden-gaza/"
  },
  {
    "text": "Prosecutors: Docs in boxes seized from Mar-a-Lago were inadvertently jumbled  —  Special counsel Jack Smith's team acknowledged mischaracterizing the issue at a recent hearing in the Trump classified documents case, but said the reordering was not significant.",
    "url": "https://www.politico.com/news/2024/05/03/mar-a-lago-trump-classified-documents-00156124"
  },
  {
    "text": "An AI tool used in thousands of criminal cases is facing legal challenges  —  Cybercheck's founder has said the software tops 90% accuracy.  Defense lawyers have said he lied under oath about his expertise and made false claims about when and where the technology has been used.",
    "url": "https://www.nbcnews.com/news/crime-courts/ai-tool-used-thousands-criminal-cases-facing-legal-challenges-rcna149607"
  },
  {
    "text": "Israel briefs US on plan to move Gazans ahead of Rafah invasion  —  The Israel Defense Forces recently told the U.S. government and aid groups operating on the ground that they had developed a plan to move people out of Rafah.  —  The Israeli military has informed aid groups … ",
    "url": "https://www.politico.com/news/2024/05/03/israel-gazans-rafah-invasion-00156024"
  },
  {
    "text": "US Justice Department warns it will sue if Iowa tries to enforce its new immigration law  —  The U.S. Department of Justice will sue Iowa to block a new immigration law criminalizing “illegal reentry” if it remains in effect, a top DOJ official wrote to Gov. Kim Reynolds and Attorney General Brenna Bird Thursday.",
    "url": "https://www.desmoinesregister.com/story/news/politics/2024/05/03/department-of-justice-warns-lawsuit-iowa-immigration-illegal-reentry-law-kim-reynolds/73548125007/"
  },
  {
    "text": "Former government employee charged with falsely accusing coworkers of participating in Jan. 6 Capitol attack  —  Washington — A former government employee with ties to federal intelligence agencies was arrested in Virginia Thursday and accused of sending fake tips to the FBI … ",
    "url": "https://www.cbsnews.com/news/former-government-employee-miguel-zapata-falsely-accusing-coworkers-jan-6-capitol-attack/"
  }
]