[
  {
    "text": "Republican Katie Britt Ruthlessly Mocked for SOTU Response  —  Alabama Senator Katie Britt on Thursday faced widespread backlash after delivering the Republican Party's response to President Joe Biden's State of the Union address.  —  Many users on X, formerly Twitter … ",
    "url": "https://www.newsweek.com/republican-katie-britt-ruthlessly-mocked-sotu-response-1877151"
  },
  {
    "text": "What Biden's SOTU ad-libs say about his politics — and his preparedness  —  President Biden came into Thursday night's State of the Union address amid remarkably low expectations about his performance.  The right-wing media universe has been focused for months on his age … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/08/biden-sotu-speech-ad-libs/"
  },
  {
    "text": "Forget Biden's SOTU Performance, and Focus on Tiny, Weak Mike Johnson  —  Joe Biden more than made it through Thursday night's State of the Union address.  That moment that his supporters always fear—the major brain fart, the confusing of Nikki Haley with Nancy Pelosi (oh wait, that was someone else)—never came.",
    "url": "https://newrepublic.com/post/179672/forget-bidens-sotu-performance-focus-tiny-weak-mike-johnson"
  },
  {
    "text": "Official GOP Response to SOTU Has Republicans ‘Losing It’  —  Sen. Katie Britt of Alabama gave the GOP response to President Biden's annual address—which got panned by some in her own party.  —  As President Joe Biden mingled on the House floor following his State of the Union address Thursday night … ",
    "url": "https://www.thedailybeast.com/official-katie-britt-gop-response-to-state-of-the-union-has-republicans-losing-it"
  },
  {
    "text": "A lot of moms can't see themselves in Katie Britt's kitchen  —  The Alabama senator's performance seemed aimed at suburban women whom Republicans have done little to win back  —  Before Sen. Katie Boyd Britt (R-Ala.) had even begun her State of the Union rebuttal on Thursday night … ",
    "url": "https://www.washingtonpost.com/style/power/2024/03/08/katie-britt-gop-response-to-biden-speech-suburban-women/"
  },
  {
    "text": "‘What the Hell Am I Watching’: Republicans Torch Their Own SOTU Rebuttal  —  Alabama Sen. Katie Britt was panned after delivering the most bizarre State of the Union rebuttal in recent memory  —  THE RITUAL SURROUNDING the annual State of the Union is never complete until the president's opposition … ",
    "url": "https://www.rollingstone.com/politics/politics-news/katie-britt-sotu-rebuttal-torched-republicans-1234983528/"
  },
  {
    "text": "The Smart Political Strategy Behind Biden's Big Speech  —  Last night was a very good night for Joe Biden.  The President delivered a vigorous, pugilistic speech with the highest possible stakes for his presidency.  He was strong and in command.  Most importantly, he made his best case yet for reelection.",
    "url": "https://www.messageboxnews.com/p/the-smart-political-strategy-behind"
  },
  {
    "text": "Democrat demands apology from Van Orden after SOTU outburst  —  Rep. Mark Pocan (D-Wis.) is demanding an apology from his fellow Wisconsin Rep. Derrick Van Orden (R) following Van Orden's outburst at Thursday's State of the Union address.  —  The outburst came as Biden spoke critically … ",
    "url": "https://thehill.com/homenews/house/4518834-democrat-demands-apology-van-orden-state-of-the-union-outburst-lies/"
  },
  {
    "text": "Media Falls In Love All Over Again With ‘Feisty,’ ‘Fiery’ Biden  —  In today's Amiable Skeptics episode, which will go up early this afternoon but was taped later in the day yesterday, Adam Baldwin and I briefly discussed the upcoming State of the Union speech.",
    "url": "https://hotair.com/ed-morrissey/2024/03/08/media-falls-in-love-all-over-again-with-feisty-fiery-biden-n3784321"
  },
  {
    "text": "Father of Marine Killed in Afghanistan Is Arrested During Biden's Address  —  Steve Nikoui yelled “Abbey Gate, Abbey Gate” during the speech, a reference to where his son, Lance Cpl. Kareem Nikoui, and 12 other troops were killed during the chaotic final days of the U.S. presence in Kabul.",
    "url": "https://www.nytimes.com/2024/03/08/us/politics/abbey-gate-yelling-state-of-union.html"
  },
  {
    "text": "Disaster for Trump as Truth Social Crashes at Critical SOTU Moment  —  The former president heavily promoted his live reactions prior to President Joe Biden's SOTU speech.  But when it came time, Trump's promises crashed and burned.  —  Donald Trump may have rage-posted … ",
    "url": "https://www.thedailybeast.com/disaster-for-trump-as-truth-social-crashes-at-critical-sotu-moment"
  },
  {
    "text": "Biden.  Can.  Win.  —  Believe.  —  ∙ Paid  —  Before we get started: Sarah and I taped a banger of a Secret Podcast this morning and I pushed it out early.  You can catch it here.  Trigger warning: Johnny from Jersey is insufferable.  —  Join  —  1. Brandon  —  Were you surprised?",
    "url": "https://plus.thebulwark.com/p/biden-can-win"
  },
  {
    "text": "Republicans Complain Joe Biden Had Too Much Energy at SOTU  —  A number of conservative commentators hit out at President Biden, suggesting that his State of the Union address in the House on Thursday was too aggressive or energetic.  Fox News host Sean Hannity branded Biden “very angry” … ",
    "url": "https://www.newsweek.com/republicans-joe-biden-energy-state-union-1877209"
  },
  {
    "text": "Trump posts $91M bond while appealing E. Jean Carroll defamation judgment  —  NEW YORK — Donald Trump on Friday secured a bond for more than $91 million to cover the judgment in writer E. Jean Carroll's defamation case while he appeals.  —  A document was posted in federal court memorializing … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/08/trump-91-million-e-jean-carroll-defamation-bond/"
  },
  {
    "text": "Trump posts $91M bond as he appeals E. Jean Carroll defamation verdict  —  Former President Trump posted a roughly $91 million bond on Friday as he appeals the verdict in advice columnist E. Jean Carroll's defamation lawsuit.  —  Trump had aimed to delay posting the bond or reduce the amount … ",
    "url": "https://thehill.com/regulation/court-battles/4518938-trump-bond-e-jean-carroll-defamation-verdict/"
  },
  {
    "text": "UFOs in storage?  Findings about alien technology from exhaustive Pentagon review  —  The review looked at UFO sightings and reports dating back decades.  —  This video grab image obtained April 28, 2020, courtesy of the U.S. Department of Defense shows part of an unclassified video taken … ",
    "url": "https://abcnews.go.com/US/ufos-storage-findings-alien-technology-exhaustive-pentagon-review/story?id=107899910"
  },
  {
    "text": "‘A likelihood of bribery, jury tampering, or of physical injury or harassment’: At first criminal trial of a former president, judge keeps juror names protected — and warns Trump about gag order  —  An extensive history of public and repeated attacks on trial jurors and grand jurors … ",
    "url": "https://lawandcrime.com/high-profile/a-likelihood-of-bribery-jury-tampering-or-of-physical-injury-or-harassment-at-first-criminal-trial-of-a-former-president-judge-keeps-juror-names-protected-and-warns-trump-about-gag-o/"
  },
  {
    "text": "Hot streak for American jobs continues in early months of 2024  —  The unemployment rate has now been below 4% for 25 consecutive months — a streak unseen in the United States since the 1960s.  —  Expectations heading into this morning showed projections of about 198,000 new jobs having been added in the United States in February.",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/hot-streak-american-jobs-continues-early-months-2024-rcna142417"
  }
]