[
  {
    "text": "Anti-abortion extremists in the US are waging a holy war against women  —  Republicans aren't content with just forcing women to give birth, they are intent on controlling all facets of reproductive healthcare, as we're seeing in Alabama  —  The holy war on IVF",
    "url": "https://www.theguardian.com/commentisfree/2024/feb/24/alabama-frozen-embryo-ivf-anti-abortion-patriarchy"
  },
  {
    "text": "IVF helps women become mothers — so why does the Christian right hate it so much?  —  Former Gov. Nikki Haley, R-S.C., gets a lot of glowing coverage simply because she occasionally criticizes Donald Trump in her fruitless presidential primary run against him.",
    "url": "https://www.salon.com/2024/02/23/alabamas-targeting-of-ivf-is-the-christian-rights-attempt-to-control-motherhood-and-theocracy/"
  },
  {
    "text": "Ignoring Warnings, G.O.P. Trumpeted Now-Discredited Allegation Against Biden  —  Republicans in Congress built their impeachment case against President Biden around a bribery accusation that the F.B.I. had warned them was uncorroborated.  —  In May 2023, Senator Charles E. Grassley … ",
    "url": "https://www.nytimes.com/2024/02/23/us/politics/gop-smirnov-allegation-biden.html"
  },
  {
    "text": "Jim Jordan Offers Startling Confession on Indicted Biden Informant  —  After trying and failing to salvage Republicans' crumbling impeachment inquiry into President Joe Biden, Ohio Representative Jim Jordan at last, finally, conceded on Friday that Alexander Smirnov's story might not be totally accurate.",
    "url": "https://newrepublic.com/post/179270/jim-jordan-confession-indicted-biden-fbi-informant-smirnov"
  },
  {
    "text": "Exclusive — Dark Trump at CPAC: “Biden's fast track to hell” … Senior campaign officials tell us Trump will lay out his general-election case against Biden in the 1 p.m. speech — flipping the “four more years” argument to a series of dire warnings about Biden's re-election.",
    "url": "https://www.axios.com/2024/02/24/trump-cpac-speech-excerpt"
  },
  {
    "text": "Trump says Black voters like him more because of his indictments and mug shot  —  The GOP candidate tells a group of Black conservatives: 'I'm being indicted for you, the Black population'  —  COLUMBIA, S.C. — Former President Trump sought to appeal to Black voters on Friday night … ",
    "url": "https://www.washingtonpost.com/politics/2024/02/24/trump-black-voters-indicted-mug-shot/"
  },
  {
    "text": "Jury finds NRA liable for mismanagement, says Wayne LaPierre violated duties  —  LaPierre and an NRA executive must pay a combined $6.35 million, the NY AG said.  —  Wayne LaPierre, CEO of the National Rifle Association, leaves New York State Supreme Court, Feb. 23, 2024, in New York.",
    "url": "https://abcnews.go.com/US/jury-finds-nra-liable-mismanagement-wayne-lapierre-violated/story?id=107269909"
  },
  {
    "text": "Jury finds NRA, Wayne LaPierre liable in civil corruption case  —  A Manhattan jury found three top executives of the National Rifle Association liable Friday in a lengthy civil trial that focused on alleged corruption and the misspending of millions of dollars.",
    "url": "https://www.npr.org/2024/02/23/1232229060/nra-wayne-lapierre-corruption-trial-verdict-new-york"
  },
  {
    "text": "Even Before His Trial, the N.R.A.'s Wayne LaPierre Was a Fraud  —  The pro-gun group's former leader used the organization's funds to enrich himself and those close to him.  But the deception went much deeper.  —  In early January, Wayne LaPierre, the longtime head of the National Rifle Association … ",
    "url": "https://www.newyorker.com/news/news-desk/wayne-lapierre-nra-trial-verdict-self-dealing"
  },
  {
    "text": "Judge formally says Trump owes $454 million in civil fraud case, countdown starts for him to put up the money for appeal  —  A New York judge on Friday formally ordered Donald Trump to pay $454 million, including interest, a move that will give the former president one month to post nearly half … ",
    "url": "https://www.cnn.com/2024/02/23/politics/trump-judgment-civil-fraud-ruling"
  },
  {
    "text": "White House reverses West Bank policy, calling Israeli settlements illegal  —  The decision was in response to reports that the far-right government of Israeli Prime Minister Benjamin Netanyahu was planning further settlement expansion, an official said  —  BUENOS AIRES — Secretary … ",
    "url": "https://www.washingtonpost.com/national-security/2024/02/23/israel-west-bank-settlements-illegal/"
  },
  {
    "text": "Vindman: Trump's NATO threat likely a ‘contributing factor’ in Navalny's death  —  Retired Army Lt. Col. Alexander Vindman argued that former President Trump's recent comments about NATO are likely a “contributing factor” in the death of Russian opposition leader Alexei Navalny.",
    "url": "https://thehill.com/policy/international/4486707-vindman-trump-nato-threat-likely-contrinuting-factor-navalny-death/"
  },
  {
    "text": "Dozens of Previously Unreported SCOTUS Trips in New Marshals Documents — But Justice Thomas and the Chief Justice Are Nowhere to be Found  —  Ditching deputy marshals at the gates of Bohemian Grove.  An extravagant birthday party at Lincoln Center.  Religious services at a Brooklyn theater.",
    "url": "https://fixthecourt.com/2024/02/usms-foia-release-2024/"
  },
  {
    "text": "RFK Jr.'s comedy night: Barbs for Biden, but the joke may be on Trump  —  The L.A. fundraiser featuring Adam Carolla, Jeremy Piven and others seemed to appeal to Kennedy-curious voters who might otherwise support the Republican  —  LOS ANGELES — There were plenty of moments during … ",
    "url": "https://www.washingtonpost.com/style/power/2024/02/22/rfk-jr-comedy-fundraiser-la/"
  },
  {
    "text": "This week, we faced all that the Dobbs justices unleashed  —  The five justices of the U.S. Supreme Court who overturned Roe v. Wade 20 months ago Saturday gave a green light to a new brand of Republican extremism in hyperdrive — a hyperdrive that has been on full, frightening display this week.",
    "url": "https://www.lawdork.com/p/dobbs-ivf-marriage-nex"
  },
  {
    "text": "Being Denied a Press Pass at CPAC Was the Best Way to Cover the Conference  —  This is what happened when MAGA people thought I was one of them.  —  I've attended the Conservative Political Action Conference almost yearly since 2009, always as a credentialed reporter.",
    "url": "https://www.motherjones.com/politics/2024/02/being-denied-a-press-pass-at-cpac-was-the-best-way-to-cover-the-conference/"
  },
  {
    "text": "Russia-Ukraine war anniversary: Western leaders in Kyiv as Russian drone hits Odesa  —  President Volodymyr Zelenskyy welcomed Western leaders to Kyiv Saturday to mark the second anniversary of Russia's full-scale invasion, as Ukrainian forces run low on ammunition and weaponry and foreign aid hangs in the balance.",
    "url": "https://apnews.com/article/russia-ukraine-war-second-anniversary-65088ba9eb9bd729cf8c677e2115cb35"
  }
]