[
  {
    "text": "Exclusive: Hundreds at Alligator Alcatraz have no criminal charges, Miami Herald learns  —  Hundreds of immigrants with no criminal charges in the United States are being held at Alligator Alcatraz, a detention facility state and federal officials have characterized as a place where “vicious” … ",
    "url": "https://www.miamiherald.com/news/local/immigration/article310541810.html"
  },
  {
    "text": "Is your family member or client at Alligator Alcatraz?  We obtained a list  —  The Miami Herald/Tampa Bay Times has obtained a list of more than 700 people who have been detained or appear to be scheduled to be sent to the Florida-run immigration detention facility known as Alligator Alcatraz.",
    "url": "https://www.miamiherald.com/news/local/immigration/article310541770.html"
  },
  {
    "text": "MAGA cares more about Jeffrey Epstein than dying without Medicaid, which explains everything  —  The first week of July was one that shook MAGA World — the solid base of the 77 million voters who last fall restored the Donald Trump regime to power — to its very core.In Washington … ",
    "url": "https://www.inquirer.com/opinion/commentary/why-jeffrey-epstein-matters-maga-trump-20250713.html"
  },
  {
    "text": "MAGA Is Tearing Itself Apart Over Jeffrey Epstein  —  Last week President Trump's Department of Justice delivered a blow to one of the foundational beliefs of the MAGA movement, one that helped carry him back to the White House.  —  In an unsigned memorandum, the department declared … ",
    "url": "https://www.nytimes.com/2025/07/13/opinion/epstein-files-trump-maga.html?unlocked_article_code=1.WE8.2HY-.lGR_PFcifO7Q&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Head of Trump's economic council circles around questions on 50 percent tariff on Brazil … “With most countries, it's really about us getting the tariffs in order, and I think this tariff on Brazil is higher because of the president's frustration with Bolsonaro,” Hassett said.",
    "url": "https://www.politico.com/news/2025/07/13/kevin-hassett-brazil-tariffs-00450411"
  },
  {
    "text": "DHS Secretary Kristi Noem says Trump wants FEMA ‘remade,’ not dismantled  —  Noem and Trump have previously floated getting rid of the agency, which administers emergency relief.  —  Homeland Security Secretary Kristi Noem said Sunday that President Donald Trump wants the Federal Emergency Management Agency … ",
    "url": "https://www.nbcnews.com/politics/trump-administration/dhs-secretary-kristi-noem-trump-wants-fema-remade-not-dismantled-texas-rcna218507"
  },
  {
    "text": "Trump Is Gutting Weather Science and Reducing Disaster Response  —  As a warming planet delivers more extreme weather, experts warn that the Trump administration is dismantling the government's disaster capabilities.  —  In an effort to shrink the federal government, President Trump … ",
    "url": "https://www.nytimes.com/2025/07/13/climate/floods-trump-cuts-disaster-preparedness-fema.html?unlocked_article_code=1.WE8.z0Za.sb0IhyOHcUUU&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Chairman Rand Paul Releases Final Report Detailing Secret Service Failures in Attempted Assassination of President Donald J. Trump  —  Report Reveals Inexcusable Negligence, Communication Breakdowns, Systemic Weaknesses, and Limited Accountability  —  Today, U.S. Senator Rand Paul (R-KY) … ",
    "url": "https://www.hsgac.senate.gov/media/reps/chairman-rand-paul-releases-final-report-detailing-secret-service-failures-in-attempted-assassination-of-president-donald-j-trump/"
  },
  {
    "text": "ICE memo outlines plan to deport migrants to countries where they are not citizens  —  The dramatic shift in policy could result in thousands of people being sent to places where they lack family ties or even a common language.  —  Federal immigration officers may deport immigrants … ",
    "url": "https://www.washingtonpost.com/immigration/2025/07/12/immigrants-deportations-trump-ice-memo/"
  },
  {
    "text": "From Science to Diversity, Trump Hits the Reverse Button on Decades of Change  —  President Trump has moved aggressively to reopen long-settled issues and to dismantle long-established institutions as he tries to return to what he considers better times.  —  NEWS ANALYSIS",
    "url": "https://www.nytimes.com/2025/07/13/us/politics/trump-reversal-better-times.html"
  },
  {
    "text": "A clinic blames its closing on Trump's Medicaid cuts.  Patients don't buy it.  —  A clinic in rural Nebraska has become a political flash point after tying its looming closure to Trump's law cutting Medicaid.  —  CURTIS, Nebraska — The only health clinic here is shutting down … ",
    "url": "https://www.washingtonpost.com/politics/2025/07/13/trump-tax-bill-medicaid-rural/"
  },
  {
    "text": "China Gets More Airtime Around the World as Voice of America Signs Off  —  Chinese state media has expanded its reach from Indonesia to Nigeria after Trump's March order to dismantle U.S. government-funded outlets",
    "url": "https://www.wsj.com/world/china/voice-of-america-china-russia-65f54e6a"
  },
  {
    "text": "What we know about the shooting at a Kentucky church  —  A now-deceased suspect shot a member of law enforcement Sunday in Fayette County, Kentucky, before fleeing to a Baptist church, leaving multiple victims, according to state officials. … - The trooper who was shot and others … ",
    "url": "https://www.axios.com/2025/07/13/kentucky-church-shooting-what-we-know"
  },
  {
    "text": "DOJ drops charges against Utah doctor accused of throwing away COVID vaccines, distributing fake vaccination cards  —  The Justice Department moved to dismiss charges against a Utah plastic doctor charged in connection with a COVID-19 fraud scheme, Attorney General Pam Bondi announced on Saturday.",
    "url": "https://thehill.com/policy/healthcare/5398661-justice-department-drops-charges-against-doctor/"
  },
  {
    "text": "American Allies Want to Redraw the World's Trade Map, Minus the U.S.  —  Facing growing chaos, the European Union and numerous other countries are seeking to forge a global trading nexus that is less vulnerable to American tariffs.  —  Trade chaos is forcing America's allies closer together, and further from the United States.",
    "url": "https://www.nytimes.com/2025/07/13/world/europe/trump-tariffs-trade-europe-us.html?unlocked_article_code=1.WE8.aDgN.OBfPzJhIIPUL&smid=url-share"
  },
  {
    "text": "How DOGE's reckless cuts created chaos at the Social Security Administration  —  Staff reassignments are not going to fix the growing problems at the agency.  —  The Trump administration's colossal cuts to the Social Security Administration in the name of “efficiency” are sowing chaos and dysfunction throughout the agency.",
    "url": "https://www.msnbc.com/opinion/msnbc-opinion/social-security-administration-phone-benefits-wait-doge-trump-rcna218252"
  },
  {
    "text": "Trump's paranoid security state  —  America's top national security agencies have been using polygraph tests, seeking employees' communications and threatening criminal investigations, all in the name of ferreting out leakers or ensuring loyalty. … - Patel and his deputy, Dan Bongino … ",
    "url": "https://www.axios.com/2025/07/13/trump-leak-hunts-polygraph-tests-fbi-pentagon"
  },
  {
    "text": "Economists See Lower Recession Risk and Stronger Job Growth: WSJ Survey  —  Forecasters nudge up growth, trim inflation estimates as tariffs prove lower, less costly than expected in April.  —  The economic fallout from President Trump's policies may prove less dire than feared.",
    "url": "https://www.wsj.com/economy/economists-see-lower-recession-risk-and-stronger-job-growth-wsj-survey-10d6e476"
  },
  {
    "text": "Trump says he's considering revoking Rosie O'Donnell's citizenship, reigniting decades-long feud  —  President Donald Trump reignited a decades-long feud with comedian Rosie O'Donnell Saturday, taking to his Truth Social platform to write he was considering revoking her citizenship.",
    "url": "https://cnn.com/2025/07/12/politics/rosie-odonnell-donald-trump"
  }
]