[
  {
    "text": "It's not that MAGA doesn't believe E. Jean Carroll — they just don't care that Trump abuses women  —  Trump verdict and new Vince McMahon allegations are a dark reminder that red state America cultivates rape culture  —  Not that she'll ever bring herself to use words like “rapist” or … ",
    "url": "https://www.salon.com/2024/01/30/its-not-that-maga-doesnt-believe-e-jean-carroll--they-just-dont-care-that-abuses-women/"
  },
  {
    "text": "E. Jean Carroll Delivered the Sound Bite That Could Win Trump the Election  —  There's the liberal media's crusade against the former president, but then there's E. Jean Carroll's war against Trump, which is something otherworldly.  She's filed multiple lawsuits against Donald Trump.",
    "url": "https://townhall.com/tipsheet/mattvespa/2024/01/29/e-jean-carroll-delivered-a-huge-in-kind-contribution-to-trump-during-her-msnbc-interview-n2634353"
  },
  {
    "text": "First look: John Bolton's predictions for a second Trump term  —  John Bolton — Donald Trump's former national security adviser — is laying out his nightmare scenarios for a second Trump term in a foreword to the paperback edition of his memoir “The Room Where It Happened,” out Tuesday.",
    "url": "https://www.axios.com/2024/01/30/trump-john-bolton-second-term-2024-election"
  },
  {
    "text": "House Republicans poised to torpedo GOP's best chance in years to pass border bill  —  House Republicans appear to be on the precipice of torpedoing their best opportunity in years of passing border legislation.  —  Republicans had long insisted on changes to border and migration policy … ",
    "url": "https://thehill.com/homenews/house/4436245-house-republicans-border-deal/"
  },
  {
    "text": "Republicans Who Screamed About A Crisis On The Border Now Oppose A Plan To Fix It  —  Many on the right claim the U.S. is being “invaded” by migrants but also want to wait until Donald Trump is elected president again to stop it.  —  LOADING  —  WASHINGTON ― For months … ",
    "url": "https://www.huffpost.com/entry/republicans-border-deal-donald-trump_n_65b80899e4b0102bd2d5c0d4"
  },
  {
    "text": "1/30/24 ☀️ Punchbowl News AM … The House Homeland Security Committee will mark up a resolution today to impeach DHS Secretary Alejandro Mayorkas, the first time in nearly 150 years that the chamber will try to remove a member of the president's Cabinet. … Meaning this all will have achieved nothing.",
    "url": "https://punchbowl.news/archive/13024-punchbowl-news-am/"
  },
  {
    "text": "After three years, Biden goes all-in on the T-word  —  President Biden deliberately avoided the word for nearly three years, using euphemisms like “the other guy” and “my predecessor.”  Now his speeches are peppered with it: “Trump.” … - In a speech Saturday in Columbia, S.C. … ",
    "url": "https://www.axios.com/2024/01/30/biden-avoid-saying-trump-2024-election"
  },
  {
    "text": "Biden faces treacherous political choices in answering deadly attack  —  Republicans demand that Biden attack Iran.  Some warn that risks a wider Middle East conflagration.  —  President Biden met with top aides Monday to review potential American responses to a drone attack … ",
    "url": "https://www.washingtonpost.com/politics/2024/01/29/biden-attacks-iran-mideast/"
  },
  {
    "text": "Justice Sotomayor speaks on frustration following some Supreme Court rulings  —  Supreme Court Justice Sonia Sotomayor opened up on Monday about the “frustration” she said she experiences daily as the high court's conservative supermajority continues to move the country further to the right.",
    "url": "https://www.cnn.com/2024/01/29/politics/sotomayor-supreme-court-frustration/"
  },
  {
    "text": "Retired conservative federal judge urges Supreme Court to disqualify Trump from office  —  A former conservative federal appellate judge is urging the Supreme Court to keep Donald Trump off the ballot, arguing the ex-president's effort to cling to power after his 2020 election loss was … ",
    "url": "https://www.cnn.com/2024/01/29/politics/luttig-conway-supreme-court-trump-insurrection/"
  },
  {
    "text": "Israeli undercover forces dressed as women and medics storm West Bank hospital, killing 3 militants  —  Israeli forces disguised as civilian women and medical workers stormed a hospital Tuesday in the occupied West Bank, killing three Palestinian militants in a dramatic raid that underscored … ",
    "url": "https://apnews.com/article/israel-hamas-war-news-01-30-2024-b1ba33c7c0c5c62f85932a20c2a0bc92"
  },
  {
    "text": "Republicans now say it might be okay to ignore the Supreme Court  —  A consequential development of the Trump era is what increasingly looks like the Republicans' acrimonious divorce from the rule of law.  —  The party that once prided itself as the law-and-order side has leaped headlong … ",
    "url": "https://www.washingtonpost.com/politics/2024/01/29/republicans-now-say-it-might-be-okay-ignore-supreme-court/"
  },
  {
    "text": "Not Just Claudine Gay.  Harvard's Chief Diversity Officer Plagiarized and Claimed Credit for Husband's Work, Complaint Alleges  —  It's not just Claudine Gay.  Harvard University's chief diversity and inclusion officer, Sherri Ann Charleston, appears to have plagiarized extensively in her academic work … ",
    "url": "https://freebeacon.com/campus/not-just-claudine-gay-harvards-chief-diversity-officer-plagiarized-and-claimed-credit-for-husbands-work-complaint-alleges/"
  },
  {
    "text": "Party feud breaks out ahead of RNC meeting in Las Vegas  —  GOP county chairs and local activists warned the party isn't doing enough to compete in November.  —  LAS VEGAS — Days before the Republican National Committee was set to convene here, hundreds of Republican officials gathered … ",
    "url": "https://www.politico.com/news/2024/01/29/republican-party-feud-turning-point-las-vegas-00138493"
  },
  {
    "text": "The anti-abortion plan ready for Trump on Day One  —  The stakes of the election go far beyond whether a GOP president signs a bill banning the procedure.  —  Anti-abortion groups have not yet persuaded Donald Trump to commit to signing a national ban if he returns to the White House.",
    "url": "https://www.politico.com/news/2024/01/29/trump-abortion-ban-2024-campaign-00138417"
  },
  {
    "text": "Exclusive: US disabled Chinese hacking network targeting critical infrastructure  —  The U.S. government in recent months launched an operation to fight a pervasive Chinese hacking operation that successfully compromised thousands of internet-connected devices, according to two Western security officials … ",
    "url": "https://www.reuters.com/world/us/us-disabled-chinese-hacking-network-targeting-critical-infrastructure-sources-2024-01-29/"
  },
  {
    "text": "Texas AG seeks transgender records in Georgia as part of his wider probe  —  Texas Attorney General Ken Paxton has requested medical records from a Georgia telehealth clinic that provides gender-affirming care, a newly discovered move that shows the Republican official is looking in multiple states … ",
    "url": "https://www.washingtonpost.com/nation/2024/01/29/texas-ag-transgender-records-georgia/"
  },
  {
    "text": "Right-Wingers Say Super Bowl Is Rigged So Taylor Swift Can Endorse Biden  —  It's all really stupid  —  Taylor Swift has shattered virtually every major record in the music industry, and as she lives her best life supporting her boyfriend, Kansas City Chiefs tight end Travis Kelce, she's also breaking the brains of right-wingers.",
    "url": "https://www.rollingstone.com/politics/politics-news/taylor-swift-targeted-conspiracies-chiefs-super-bowl-1234955940/"
  }
]