[
  {
    "text": "Exclusive: Hotelier Robert Bigelow gives Trump $1 million for legal fees  —  Hotelier Robert Bigelow told Reuters on Tuesday he gave Republican presidential candidate Donald Trump $1 million for his legal fees and agreed to donate another $20 million to a pro-Trump outside group for campaign purposes.",
    "url": "https://www.reuters.com/world/us/donor-bigelow-gave-trump-1-mln-legal-fees-donate-20-million-more-2024-01-30/"
  },
  {
    "text": "Trump's PACs Spent Roughly $50 Million on Legal Expenses in 2023  —  The former president is facing four criminal indictments and potential trials that could drive his legal bills even higher as he seeks to lock up the Republican presidential nomination.  —  Donald J. Trump piled up legal expenses … ",
    "url": "https://www.nytimes.com/2024/01/30/us/politics/trump-legal-fees.html"
  },
  {
    "text": "Trump Has Devoured the Republican Establishment  —  It was almost 15 months ago that The New York Post published a full-page cover photo of Ron DeSantis with the headline “DeFUTURE.”  His 19-point victory in the Florida governor's race was one of the few bright spots of the 2022 elections … ",
    "url": "https://www.nytimes.com/2024/01/30/opinion/trump-republican-establishment.html"
  },
  {
    "text": "Trump Spent $50 Million in Donor Money on Legal Bills Last Year: Report  —  The former president's PAC are operating as slush funds to help him fight off a mountain of civil and criminal cases … According to two sources who spoke to the Times, the former president's massive legal bills … ",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-50-million-donor-money-legal-bills-2023-1234956948/"
  },
  {
    "text": "Trump Allies Pledge ‘Holy War’ Against Taylor Swift  —  Taylor Swift hasn't even endorsed Joe Biden's 2024 campaign, but Trump is already privately grousing he's “more popular” than her  —  Singer-songwriter Taylor Swift hasn't even endorsed President Joe Biden for reelection yet.",
    "url": "https://www.rollingstone.com/politics/politics-features/donald-trump-more-popular-taylor-swift-maga-biden-1234956829/"
  },
  {
    "text": "Biden mocks Trump during Florida fundraiser  —  He lamented that Florida had faced a “real dose of Trumpism.”  —  MIAMI — President Joe Biden came to South Florida to cash in and dump all over Donald Trump.  —  During a fundraiser in Jupiter, Florida, on Tuesday, Biden rallied donors … ",
    "url": "https://www.politico.com/news/2024/01/30/biden-mocks-trump-during-florida-fundraiser-00138672"
  },
  {
    "text": "Judge orders Tesla to undo Elon Musk's $56 billion pay package  —  The ruling by a Delaware court stems from a Tesla shareholder lawsuit over the tech billionaire's 2018 compensation package  —  A Delaware judge on Tuesday ruled that Elon Musk's generous 2018 compensation package … ",
    "url": "https://www.washingtonpost.com/technology/2024/01/30/elon-musk-pay-package/"
  },
  {
    "text": "Elon Musk cannot keep Tesla pay package worth more than $55 billion, judge rules  —  Elon Musk is not entitled to landmark compensation package awarded by Tesla's board of directors that is potentially worth more than $55 billion, a Delaware judge ruled Tuesday.",
    "url": "https://apnews.com/article/elon-musk-tesla-compensation-pay-shareholders-e75687178d1175fba36ca55bd9c4c805"
  },
  {
    "text": "Trump pressured prosecutor to ‘blow up’ Hunter Biden's gun plea deal: court filing  —  Hunter Biden's lawyers working to dismiss their client's gun case argued Tuesday far-right extremists and former President Donald Trump unduly pressured prosecutors once willing to cut a deal.",
    "url": "https://www.rawstory.com/hunter-biden-trump-gun/"
  },
  {
    "text": "Syphilis Is Soaring in the U.S.  —  Cases have risen by 80 percent since 2018, the C.D.C. reported.  But chlamydia remains by far the most common sexually transmitted infection.  —  Syphilis, once nearly eliminated in the United States, continues to resurge, reaching the highest rate … ",
    "url": "https://www.nytimes.com/2024/01/30/health/syphilis-cdc.html"
  },
  {
    "text": "The ‘Take Our Border Back’ Convoy Is Already a Complete Mess  —  Instead of immigrants, the group of extremists mostly battled each other, paranoia, and their GPS systems.  —  On Monday morning, the organizers of the Take Our Border Back convoy kicked off their road trip to the Texas-Mexico border in Virginia Beach.",
    "url": "https://www.wired.com/story/day-one-take-our-border-back-convoy-texas/"
  },
  {
    "text": "Disturbing Bill Would Let Arizona Legislators Ignore Election Results  —  The proposed bill would give the legislature absolute power to control the state's electoral college votes, disenfranchising millions of citizens.  —  An Arizona lawmaker who signed on to be a “fake elector” … ",
    "url": "https://www.thedailybeast.com/disturbing-bill-would-let-arizona-legislators-ignore-election-results"
  },
  {
    "text": "Trump can stay on Illinois 2024 ballot after 14th Amendment challenge, officials say  —  A bipartisan state board voted 8-0 to affirm Trump's eligibility.  —  Former U.S. President Donald Trump waves as he departs for his second civil trial after E. Jean Carroll accused Trump of raping her decades ago … ",
    "url": "https://abcnews.go.com/Politics/trump-remain-illinois-2024-ballot-after-14th-amendment/story?id=106765313"
  },
  {
    "text": "Prosecutor in Trump Georgia case settles divorce ahead of testimony  —  The lead prosecutor in the Georgia election interference case against former president Donald Trump and his allies settled a contentious divorce dispute on Tuesday, canceling a hearing scheduled for Wednesday morning … ",
    "url": "https://www.washingtonpost.com/national-security/2024/01/30/nathan-wade-divorce-case-settled/"
  },
  {
    "text": "Montana's Governor Defends Stealing a Teenager From Parents Over Not Conforming to Transgender Agenda  —  As RedState previously reported, Montana's state child protective services came and took away the 14-year-old girl of a family in Glasgow.  The parents, Krista and Todd Kolstad … ",
    "url": "https://redstate.com/brandon_morse/2024/01/30/montanas-governor-defends-stealing-a-teenager-from-parents-over-not-conforming-to-transgender-agenda-n2169425"
  },
  {
    "text": "Ron DeSantis Calls For Ilhan Omar To Be Expelled From Congress, Denaturalized And Deported  —  Florida Republican Gov. Ron DeSantis called Tuesday for Minnesota Democratic Rep. Ilhan Omar to be expelled from Congress, denaturalized as a U.S. citizen and deported back to Somalia in response … ",
    "url": "https://dailycaller.com/2024/01/30/ron-desantis-call-ilhan-omar-expel-congress-denaturalize-deport/"
  },
  {
    "text": "Florida bars transgender residents from changing gender on driver's licenses  —  Transgender Floridians will no longer be able to change their gender on state-issued driver's licenses, according to a Florida Department of Highway Safety and Motor Vehicles memo addressed to county tax collectors.",
    "url": "https://thehill.com/homenews/state-watch/4438514-florida-bars-transgender-residents-from-changing-gender-on-drivers-licenses/"
  },
  {
    "text": "Explorer may have found wreckage of Amelia Earhart's plane in Pacific  —  A former U.S. Air Force intelligence officer says he believes he has found the wreckage of Amelia Earhart's plane, which disappeared nine decades ago, on the bottom of the Pacific Ocean using sonar data from a deep-sea drone.",
    "url": "https://www.reuters.com/world/us/explorer-may-have-found-wreckage-amelia-earharts-plane-pacific-2024-01-31/"
  },
  {
    "text": "The historically familiar subtext to fears about immigrants to the U.S.  —  There are very real pressures that exist because of the recent increase in immigrants to the United States.  The number of immigrants who have been released into the country to await legal proceedings is over 2 million since 2021 … ",
    "url": "https://www.washingtonpost.com/politics/2024/01/30/immigration-white-history-migrants/"
  },
  {
    "text": "House Democrats close ranks against “bulls**t” Mayorkas impeachment  —  House Democrats are expecting their caucus to stay unified against a Republican vote to impeach Secretary of Homeland Security Alejandro Mayorkas that could come as soon as next week.",
    "url": "https://www.axios.com/2024/01/30/house-democrats-mayorkas-impeachment-vote"
  },
  {
    "text": "We Found That Landlords Could Be Using Algorithms to Fix Rent Prices.  Now Lawmakers Want to Make the Practice Illegal.  —  After a ProPublica investigation, U.S. senators introduced a bill to curb “price fixing” linked to rent-setting software.  “Setting prices with an algorithm is no different … ",
    "url": "https://www.propublica.org/article/senators-introduce-legislation-stop-landlords-algorithm-price-fixing"
  },
  {
    "text": "Pluralistic: My McLuhan lecture on enshittification (30 Jan 2024)  — My McLuhan lecture on enshittification: Live from Berlin.  — Hey look at this: Delights to delectate.  — This day in history: 2014, 2019, 2023  — Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading",
    "url": "https://pluralistic.net/2024/01/30/go-nuts-meine-kerle/"
  },
  {
    "text": "Iraq's Kataib Hezbollah suspends attacks on US forces  —  Iran-aligned Iraqi armed group Kataib Hezbollah announced on Tuesday the suspension of all its military operations against U.S. troops in the region, in a decision aimed at preventing “embarrassment” of the Iraqi government, the group said.",
    "url": "https://www.reuters.com/world/middle-east/iraqs-kataib-hezbollah-suspends-military-operations-us-forces-statement-2024-01-30/"
  },
  {
    "text": "Man sentenced to 18 years for bombing church that was hosting drag event  —  Aimenn Penny grew angrier and angrier late on March 24, as he watched online videos about drag shows, prosecutors said.  —  Committed to stopping one near his home in northeastern Ohio, he got in his vehicle and … ",
    "url": "https://www.washingtonpost.com/nation/2024/01/30/ohio-church-bombing-drag-show/"
  },
  {
    "text": "Abrams-founded Fair Fight lays off staff, pares back services amid mounting debt  —  The Fair Fight political and advocacy organization that Stacey Abrams founded is laying off staffers and narrowing its mission as it struggles with mounting debt from lengthy court battles over voting rights that racked up massive legal bills.",
    "url": "https://www.ajc.com/politics/abrams-founded-fair-fight-lays-off-staff-pares-back-services-amid-mounting-debt/UIFGIO2TXBFI5GF6SAQMN4U6UQ/"
  },
  {
    "text": "GOP moderates send warning shot to Johnson over tax deal  —  Moderate House Republicans sent a warning shot to Speaker Mike Johnson (R-La.) on Tuesday, coming close to blocking legislative action on the House floor in protest of the bipartisan, bicameral tax deal not including an increase in the state and local tax deduction (SALT).",
    "url": "https://thehill.com/homenews/house/4437928-gop-moderates-house-tax-deal-warning-shot/"
  },
  {
    "text": "The voters are rejecting Washington's failed border deal  —  Last week's reporting from The Hill is a perfect example of how Senate Minority Leader Mitch McConnell (R-Ky.) is preserving a Republican Party in Washington that has completely lost touch with our voters and the real world.",
    "url": "https://thehill.com/opinion/4437718-the-voters-are-rejecting-washingtons-failed-border-deal/"
  }
]