[
  {
    "text": "Judge Gags Trump After Ex-President Attacks His Law Clerk  —  Shortly before a lunch break, Trump circulated a false rumor about Manhattan Supreme Court Justice Arthur Engoron, which traces its origins to a now-shuttered satirical website  —  A Facebook icon representing an external link … ",
    "url": "https://themessenger.com/politics/trump-gag-order-new-york-engoron-clerk-truth-social"
  },
  {
    "text": "Trump Posts (Then Deletes) Attack Against Judge's Clerk During Trial  —  The former president is attending his New York civil fraud trial in person, ranting at cameras and on social media in between courtroom sessions … Trump last week was found guilty of committing fraud in the case … ",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-attacks-judge-engoron-clerk-new-york-fraud-trial-1234838462/"
  },
  {
    "text": "Judge Shuts Down Trump's Claim That He Reversed Himself on Statute of Limitations  —  The former president claimed the judge ‘overruled’ himself and would knock out ‘80%’ of the case, but the judge began day two of the trial by shooting that down  —  A Facebook icon representing an external link … ",
    "url": "https://themessenger.com/politics/judge-rejects-trump-claim-overruled-statute-of-limitations"
  },
  {
    "text": "Trump Ordered Not to Comment on Judge's Staff in Fraud Case  —  The former president attacked Justice Arthur F. Engoron's clerk in a social media post that soon disappeared.  He was called to account behind closed doors.  —  A New York judge placed a limited gag order on Donald J. Trump … ",
    "url": "https://www.nytimes.com/2023/10/03/nyregion/trump-gag-order-fraud-trial.html"
  },
  {
    "text": "Trump fraud trial live updates: Day 2 begins with testimony from ex-Trump accountant  —  Trump appears in court for Day 2 of civil fraud trial … 2m ago / 6:59 PM UTC  —  Trump appears to delete post attacking judge's law clerk  —  Dan Gallo  —  Amid all the delays … ",
    "url": "https://www.nbcnews.com/politics/live-blog/trump-fraud-trial-live-updates-rcna118408"
  },
  {
    "text": "Republicans must expel Matt Gaetz  —  Newt Gingrich, a Republican from Georgia, was speaker of the House of Representatives from 1995 to 1999.  —  Rep. Matt Gaetz (R-Fla.) is an anti-Republican who has become actively destructive to the conservative movement.  —  Drama has filled the halls of Congress for 234 years.",
    "url": "https://www.washingtonpost.com/opinions/2023/10/03/newt-gingrich-matt-gaetz-remove/"
  },
  {
    "text": "Will House Speaker Kevin McCarthy lose his job?  Here are the scenarios.  —  Rep. Matt Gaetz (R-Fla.) followed through his pledge to trigger a vote to oust Speaker Kevin McCarthy (R-Calif.) on Monday evening, kicking off a complicated process that will determine McCarthy's fate.",
    "url": "https://www.washingtonpost.com/politics/2023/10/03/kevin-mccarthy-house-speaker-vote/"
  },
  {
    "text": "Speaker Kevin McCarthy is on the ropes.  Here are some possible successors  —  The list of possibilities include members of his leadership team and some top conservative allies.  —  WASHINGTON — It's far from certain Rep. Matt Gaetz, R-Fla., can successfully topple House Speaker Kevin McCarthy … ",
    "url": "https://www.nbcnews.com/politics/congress/speaker-mccarthy-ropes-are-possible-successors-rcna118491"
  },
  {
    "text": "McCarthy becomes first speaker removed by U.S. House vote  —  The House has voted to remove Kevin McCarthy as speaker of the House, marking the first time in history that a speaker has been removed this way.  —  Congress has now entered unchartered territory.",
    "url": "https://www.npr.org/2023/10/03/1203310040/mccarthy-gaetz-speaker-news"
  },
  {
    "text": "The Supreme Court's uncharacteristic moment of sanity  —  Justices considering a case against the CFPB seem unlikely to trigger a second Great Depression.  —  Imagine that the Supreme Court of the United States spent an entire morning debating whether penguins are the primary cause … ",
    "url": "https://www.vox.com/scotus/2023/10/3/23901502/supreme-court-cfpb-appropriations-clause-community-financial-kavanaugh-barrett"
  },
  {
    "text": "RNC warns Christie and Ramaswamy not to hold joint Fox News segment  —  The two candidates will now sit down for separate interviews.  —  The Republican National Committee told former New Jersey Gov. Chris Christie and entrepreneur Vivek Ramaswamy Monday night that if they went through … ",
    "url": "https://www.politico.com/news/2023/10/03/rnc-chris-christie-vivek-ramaswamy-debate-fox-00119629"
  },
  {
    "text": "Neither Party Well-Liked, but GOP Holds Advantage on Issues  — Republican and Democratic Parties viewed unfavorably on balance  — Between the two, Republican Party trusted more on economy and security  — GOP also ahead on which party can handle “most important problem”",
    "url": "https://news.gallup.com/poll/511979/neither-party-liked-gop-holds-advantage-issues.aspx"
  },
  {
    "text": "No Labels makes its choice  —  No Labels claims to be a non-partisan centrist organization.  It describes itself as a movement for the “politically homeless.”  But in practice, it has supported Republicans and very conservative Democrats.  This year, No Labels has spent millions … ",
    "url": "https://popular.info/p/no-labels-makes-its-choice"
  },
  {
    "text": "How red-state politics are shaving years off American lives  —  ASHTABULA, Ohio — Mike Czup unspooled the hose to wash his hearse.  It was time to pick up the body of yet another neighbor who had died in the prime of life.  —  Since he started working at 15 in the funeral business, Czup has seen plenty of tragedies.",
    "url": "https://www.washingtonpost.com/health/interactive/2023/republican-politics-south-midwest-life-expectancy/"
  },
  {
    "text": "Sinclair stations aired a sponsored segment featuring a white nationalist who supports killing journalists  —  Sinclair said “the segment in question is no longer on our air” following a Media Matters inquiry  —  At least 16 Sinclair television stations ran sponsored gold investment segments … ",
    "url": "https://www.mediamatters.org/stew-peters/sinclair-stations-aired-sponsored-segment-featuring-white-nationalist-who-supports"
  },
  {
    "text": "Buckle up: McCarthy's future to be decided on Tuesday  —  The speaker said he would not make a deal with Democrats to save his gavel: “They haven't asked for anything.  I'm not going to provide anything.”",
    "url": "https://www.politico.com/live-updates/2023/10/03/congress/mccarthy-wont-deal-with-dems-00119620"
  },
  {
    "text": "Justice Department Announces Eight Indictments Against China-Based Chemical Manufacturing Companies and Employees  —  For Immediate Release  —  The Justice Department today announced the unsealing of eight indictments in the Middle and Southern Districts of Florida charging China-based companies … ",
    "url": "https://www.justice.gov/opa/pr/justice-department-announces-eight-indictments-against-china-based-chemical-manufacturing"
  },
  {
    "text": "‘A travesty’: Clarence Thomas refuses to recuse in case that could benefit billionaire benefactor  —  U.S. Supreme Court Justice Clarence Thomas on Monday recused himself from a decision—but the rare move from the embattled right-winger came as he weighed in on another case involving … ",
    "url": "https://www.rawstory.com/a-travesty-clarence-thomas-refuses-to-recuse-in-case-that-could-benefit-billionaire-benefactor/"
  },
  {
    "text": "Why MAGA Wants to Betray Ukraine  —  So the federal government wasn't shut down over the weekend, although we may have to go through this whole drama again in six weeks.  Kevin McCarthy, the speaker of the House, ended up doing the obvious: bringing a funding bill to the floor that could pass … ",
    "url": "https://www.nytimes.com/2023/10/02/opinion/columnists/maga-republicans-ukraine.html"
  },
  {
    "text": "Schwarzenegger advises Trump on weight loss: ‘Run around your cell three times’  —  Arnold Schwarzenegger has some exercise advice for former President Trump: Do some laps around a jail cell.  —  “If he would ask me what should you do for fitness, I would just say, 'Run around your cell three times.",
    "url": "https://thehill.com/blogs/in-the-know/4235722-schwarzenegger-advises-trump-on-weight-loss-run-around-your-cell-three-times/"
  }
]