[
  {
    "text": "Trump's $91.6 million question  —  New York juries have found, by a preponderance of the evidence, that former President Donald Trump sexually assaulted writer E. Jean Carroll in a Bergdorf Goodman dressing room in the mid-90s and then repeatedly defamed her, falsely accusing Carroll of lying about the incident.",
    "url": "https://popular.info/p/trumps-916-million-question"
  },
  {
    "text": "The media is still selling a fantasy version of Trump  —  This free edition of PN is made possible by paid subscribers.  If you aren't one already, hit the button and sign up to support our independent journalism.  —  ⌨️ Subscribe to Public Notice ⌨️",
    "url": "https://www.publicnotice.co/p/axios-new-york-times-nbc-trump-fantasy-version"
  },
  {
    "text": "Donald Trump May Be Closer To Bankruptcy Than It Seems  —  Donald Trump may be in a worse financial situation than most people think, a financial analyst has said.  —  Jon Gabrielsen, an Atlanta-based market economist, told Newsweek that Trump's liquidity problems may be more acute than they first appear … ",
    "url": "https://www.newsweek.com/donald-trump-bankruptcy-court-awards-e-jean-carroll-new-york-fraud-case-engoron-1877890"
  },
  {
    "text": "E. Jean Carroll lawyer suggests third Trump defamation lawsuit possible after new comments  — Donald Trump again denied rape and defamation claims against him by E. Jean Carroll.  — The presumptive Republican presidential nominee claimed on CNBC's “Squawk Box” that the numerous judgments … ",
    "url": "https://www.cnbc.com/2024/03/11/trump-again-attacks-e-jean-carroll-as-he-appeals-rape-defamation-penalties.html"
  },
  {
    "text": "Former advisers sound the alarm that Trump praises despots in private and on the campaign trail  —  To Donald Trump, Hungarian strongman Viktor Orbán is “fantastic,” Chinese leader Xi Jinping is “brilliant,” North Korea's Kim Jong Un is “an OK guy,” and, most alarmingly … ",
    "url": "https://www.cnn.com/2024/03/11/politics/trump-despots-advisers-sound-alarm/"
  },
  {
    "text": "Trump floats ‘cutting’ retirement spending, drawing quick pushback from Biden  —  The Republican nominee-in-waiting said that “there's a lot you can do in terms of cutting” when pressed on CNBC about the solvency of Social Security, Medicare and Medicaid.  —  Presumptive Republican nominee … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-floats-cutting-retirement-spending-drawing-quick-pushback-biden-rcna142776"
  },
  {
    "text": "The MAGA Aesthetic Is Beginning to Rot  —  The stable of imagery associated with the far-right insurgency no longer seems as fresh as it did when Trump first donned his red cap.  —  Pocket  —  For headline writers and Beltway pundits, the takeaway from last week's State of the Union address was clear … ",
    "url": "https://www.thenation.com/article/politics/maga-aesthetic-trump-style/"
  },
  {
    "text": "Trump Posted Manipulated Video of Democrats Applauding Him At Biden's State of the Union Speech  —  Trump continues to post manipulated media  —  On Sunday, Trump posted a manipulated video showing himself replacing Joe Biden struggling at the State of the Union speech and Democrats cheering for him.",
    "url": "https://www.meidastouch.com/video/trump-posted-manipulated-video-of-democrats-applauding-him-at-bidens-state-of-the-union-speech"
  },
  {
    "text": "House to Move Ahead With Bill Targeting TikTok as Trump Flips to Oppose It  —  Bipartisan legislation to force the Chinese owners of the platform to divest or face a ban was moving forward in Congress even after former President Donald J. Trump came out strongly against banning it.",
    "url": "https://www.nytimes.com/2024/03/11/us/politics/trump-tiktok-ban-cnbc.html"
  },
  {
    "text": "House Republicans release report seeking to undermine Jan. 6 Committee and star witness  —  The report takes aim at key Jan. 6 witness Cassidy Hutchinson, citing unnamed Trump White House staffers who did not corroborate her testimony.  —  WASHINGTON — A House committee investigating … ",
    "url": "https://www.nbcnews.com/politics/congress/house-republicans-report-jan-6-committee-cassidy-hutchinson-trump-rcna142762"
  },
  {
    "text": "Testimony Fleshes Out Account of Trump's Demand to Go to Capitol on Jan. 6  —  But a newly released transcript of an interview of the Secret Service agent who drove Donald Trump's vehicle that day disputes that he tried to grab the steering wheel or lunged at another agent.",
    "url": "https://www.nytimes.com/2024/03/11/us/politics/jan-6-trump-motorcade-secret-service.html"
  },
  {
    "text": "Trump seeks to derail New York hush money trial over immunity claims  —  Former President Trump is seeking to derail the start of his first criminal trial just two weeks out from when it is scheduled to begin, asserting a presidential immunity defense in the case for the first time.",
    "url": "https://thehill.com/regulation/court-battles/4524017-trump-new-york-hush-money-trial-immunity/"
  },
  {
    "text": "How a tenacious reporter revealed Sen. Katie Britt's SOTU response to be ‘beyond misleading’  —  Britt tied an anecdote about a woman who survived sex trafficking to Biden's border policies.  But it happened during the George W. Bush admin.  —  Last Thursday was President Joe Biden's big State of the Union address.",
    "url": "https://www.poynter.org/commentary/2024/katie-britt-scarlett-johansson-teacup-snl/"
  },
  {
    "text": "Biden effigy beaten at GOP event in Kansas; ex-official calls for resignations  —  Attendees at a Kansas county Republican Party event punched, kicked and took a baseball bat to an effigy of President Biden on Friday, sparking backlash from former party officials.",
    "url": "https://thehill.com/homenews/state-watch/4524200-johnson-county-kansas-republican-event-biden-effigy/"
  },
  {
    "text": "Sex trafficking victim says Sen. Katie Britt telling her story during SOTU rebuttal is ‘not fair’  —  The woman whose story Alabama Sen. Katie Britt appeared to have shared in the Republican response to the State of the Union as an example of President Joe Biden's failed immigration policies told CNN … ",
    "url": "https://www.cnn.com/2024/03/10/politics/katie-britt-sex-trafficking-victim-interview"
  },
  {
    "text": "HUD Secretary Marcia Fudge to resign, says affordable housing is ‘an American issue’  —  WASHINGTON ‒ Housing and Urban Development Secretary Marcia Fudge will step down from her top post in the Biden administration this month, she announced Monday, saying that after decades of public service, she's retiring and returning to Ohio.",
    "url": "https://www.usatoday.com/story/news/politics/2024/03/11/hud-secretary-marcia-fudge-steps-down/72886441007/"
  }
]