[
  {
    "text": "Pete Hegseth's Mother Accused Her Son of Mistreating Women for Years  —  Penelope Hegseth made the accusation in an email to her son in 2018, amid his contentious divorce.  She said on Friday that she regretted the email and had apologized to him.  —  The mother of Pete Hegseth … ",
    "url": "https://www.nytimes.com/2024/11/29/us/politics/pete-hegseth-mother-email.html?unlocked_article_code=1.d04.hkIK.QnXcVaptGbvi&smid=url-share"
  },
  {
    "text": "Text of the Email That Pete Hegseth's Mother Sent Him  —  Penelope Hegseth sent the email to her son in 2018 as he was in the middle of divorcing his wife, Samantha. … Son,  —  I have tried to keep quiet about your character and behavior, but after listening to the way you made Samantha feel today, I cannot stay silent.",
    "url": "https://www.nytimes.com/2024/11/29/us/politics/hegseth-email-text.html?unlocked_article_code=1.d04.9f-K.N-9gETW23a9n&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Trump nominates Charles Kushner, father of Jared Kushner, as US Ambassador to France  —  WASHINGTON - President-elect Donald Trump selected Charles Kushner, father of Jared Kushner, to serve as U.S. Ambassador to France on Saturday.  —  “I am pleased to nominate Charles Kusher, of New Jersey … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/11/30/trump-charles-kushner-france-ambassador/76677177007/"
  },
  {
    "text": "Trump wants pardoned real estate developer Charles Kushner to be ambassador to France  —  President-elect Donald Trump said Saturday that he wants real estate developer Charles Kushner, father of Trump's son-in-law Jared Kushner, to serve as ambassador to France.",
    "url": "https://apnews.com/article/trump-france-ambassador-charles-kushner-pardon-c3835be92b1fbd1dffcd05707cba9f52"
  },
  {
    "text": "Journalists flock to Bluesky as X becomes increasingly ‘toxic’  —  Journalists are finding more readers and less hate on Bluesky than on the platform they used to know as Twitter.  —  When Ashton Pittman, an award-winning news editor and reporter, first joined the app Bluesky, he said … ",
    "url": "https://www.nbcnews.com/tech/social-media/bluesky-x-becomes-social-media-rcna181685"
  },
  {
    "text": "Corporate America Launches Unorthodox Campaign to Gain Trump's Attention  —  Companies look at scrubbing left-leaning policies from their websites and scoping out appearances on conservative podcasts  —  Corporate America is unleashing an unorthodox campaign to influence Donald Trump's agenda … ",
    "url": "https://www.wsj.com/politics/trump-transition-lobbying-company-image-ffd42d2e?st=JPBsv7&reflink=article_copyURL_share"
  },
  {
    "text": "Democrats Weigh Dumping Nadler, Regrouping to Counter Trump  —  Some House Democrats want to oust aging committee leaders like Representative Jerrold Nadler in favor of younger lawmakers who they see as better suited to take on the president.  —  House Democrats are considering pushing aside … ",
    "url": "https://www.nytimes.com/2024/11/30/us/politics/democrats-nadler-raskin.html?unlocked_article_code=1.d04.O4Lp.-L_mNecSV85s&smid=url-share"
  },
  {
    "text": "What to know about sudden rebel gains in Syria's 13-year war and why it matters  —  The 13-year civil war in Syria has roared back into prominence with a surprise rebel offensive on Aleppo, one of Syria's largest cities and an ancient business hub.  The push is among the rebels' strongest … ",
    "url": "https://apnews.com/article/syria-hts-assad-aleppo-fighting-2be43ee530b7932b123a0f26b158ac22"
  },
  {
    "text": "Trump threatens 100% tariff on the BRIC bloc of nations if they act to undermine US dollar  —  President-elect Donald Trump on Saturday threatened 100% tariffs against a bloc of nine nations if they act to undermine the U.S. dollar.  His threat was directed at countries in the so-called BRIC alliance … ",
    "url": "https://apnews.com/article/trump-dollar-dominance-brics-treasury-8572985f41754fe008b98f38180945c3"
  },
  {
    "text": "Emboldened ‘manosphere’ accelerates threats and demeaning language toward women after US election  —  In the days after the presidential election, Sadie Perez began carrying pepper spray with her around campus.  Her mom also ordered her and her sister a self-defense kit that included keychain spikes … ",
    "url": "https://apnews.com/article/trump-harris-election-womens-rights-social-media-d5cea53480437ac8bf837aaa821e5681"
  },
  {
    "text": "How Our Messed-Up Dating Culture Leads to Loneliness, Anger and Donald Trump  —  Joe Rogan.  Elon Musk.  Representatives of bro culture are on the ascent, bringing with them an army of disaffected young men.  But where did they come from?  Many argue that a generation of men are resentful … ",
    "url": "https://www.nytimes.com/2024/11/30/opinion/dating-bro-culture-manosphere-trump-cinderella.html?unlocked_article_code=1.d04.pcRs.Jt6MhG9ZzSMz&smid=url-share"
  },
  {
    "text": "Canada's Trudeau returns home after Trump meeting without assurances that tariffs are off the table  —  Canadian Prime Minister Justin Trudeau returned home Saturday after his meeting with Donald Trump without assurances the president-elect will back away from threatened tariffs on all products from the major American trading partner.",
    "url": "https://apnews.com/article/trudeau-trump-canada-tariffs-mexico-border-e0ee7f9b3dddc80d1260585c11869fff"
  },
  {
    "text": "Trump promised Jan. 6 pardons.  His post-election silence is making loyalists nervous.  —  His die-hard supporters — as well as some federal judges — are left to speculate about his clemency plans.  —  Donald Trump campaigned on a pledge to pardon a vast swath of supporters who stormed the Capitol on Jan. 6, 2021.",
    "url": "https://www.politico.com/news/2024/11/30/trump-january-6-pardons-00192036"
  },
  {
    "text": "Dems fear Harris' continued fundraising ‘erodes trust’  —  The fundraising emails sound as urgent as ever, even following her defeat.  —  The 2024 election is over.  But Kamala Harris' fundraising emails keep coming — and sound as urgent as ever.  —  “Even a quick donation of $50 is enough … ",
    "url": "https://www.politico.com/news/2024/11/30/harris-campaign-fundraising-democrats-trust-00191919"
  },
  {
    "text": "Is it safe to have a child?  Americans rethink family planning ahead of Trump's return  —  Some in the US are reconsidering children, with fears over reproductive healthcare and the climate crisis front of mind  —  Chris Peterson wasn't surprised that Donald Trump won the 2024 presidential election.",
    "url": "https://www.theguardian.com/us-news/2024/nov/30/family-planning-trump"
  }
]