[
  {
    "text": "The Border Is Now Becoming a GOP Crisis  —  How the GOP is fumbling its best chance at pinning Biden and the Democrats in a corner on immigration  —  It's hard to believe, but the GOP is turning its best weapon—the border crisis—into a political liability.",
    "url": "https://statuskuo.substack.com/p/the-border-is-now-becoming-a-gop"
  },
  {
    "text": "GOP Senator Reveals the Sick Truth About the Trump-MAGA Border Scam … Republican Senator James Lankford, who is leading negotiations over a border security bill, is discovering to his great shock that Donald Trump and MAGA Republicans are not operating entirely in good faith.",
    "url": "https://newrepublic.com/article/178530/gop-senator-james-lankford-trump-maga-border-scam"
  },
  {
    "text": "Trumps Throw Tantrum Over Court Monitor's Financial Bombshell  —  A lawyer for the Trumps slammed Judge Barbara S. Jones in a court filing Monday morning, vehemently denying Trump lied about a missing $48 million loan.  —  Now that the retired federal judge babysitting the Trump Organization … ",
    "url": "https://www.thedailybeast.com/trumps-throw-tantrum-over-court-monitors-financial-bombshell"
  },
  {
    "text": "Trump civil fraud trial: Why the New York case stands apart  —  Within days, Donald Trump could potentially have his sprawling real estate business empire ordered “dissolved” for repeated misrepresentations on financial statements to lenders, adding him to a short list of scam marketers … ",
    "url": "https://apnews.com/article/trump-fraud-business-law-courts-banks-lending-punishment-2ee9e509a28c24d0cda92da2f9a9b689"
  },
  {
    "text": "Trump Lawyer Attacks ‘Self-Serving’ Court-Appointed Monitor as a ‘Javert’ After She Calls Out Financial ‘Errors’  —  Instead of stealing a loaf of bread like Victor Hugo's protagonist, Trump stands accused of fraudulently inflating his wealth by billions  —  The Donald Trump family's lawyer went … ",
    "url": "https://themessenger.com/politics/trump-fraud-trial-court-monitor-judge-barbara-jones-engoron"
  },
  {
    "text": "Preliminary report suggests enemy drone that killed US troops in Jordan was mistaken for a US drone  —  An enemy drone that killed three American troops and wounded dozens of others in Jordan may have been confused with an American drone returning to the U.S. installation, two U.S. officials said Monday.",
    "url": "https://apnews.com/article/jordan-drone-attack-attack-confusion-f175962e058b9b6f668303faf248d8e6"
  },
  {
    "text": "Trump calls UAW president a ‘dope’ after union endorses Biden  —  “Get rid of this dope & vote for DJT,” Trump said on Truth Social.  —  Former President Donald Trump took a swipe at the United Auto Workers president Sunday night, calling him a “dope” days after the UAW endorsed President Joe Biden.",
    "url": "https://www.politico.com/news/2024/01/29/trump-uaw-president-dope-biden-00138310"
  },
  {
    "text": "Ex-IRS contractor sentenced to 5 years in prison for leaking Trump tax records  —  Charles Littlejohn had pleaded guilty to leaking thousands of tax records, including for Trump and billionaires like Jeff Bezos and Elon Musk.  —  WASHINGTON — The former Internal Revenue Service contractor … ",
    "url": "https://www.nbcnews.com/politics/justice-department/former-irs-contractor-sentenced-5-years-prison-leaking-trump-tax-recor-rcna135908?taid=65b7daa9f47c880001ead0be"
  },
  {
    "text": "E. Jean Carroll says she plans to use $83 million on ‘something Donald Trump hates’  —  “He's just something in a suit,” Carroll said about seeing Trump in court.  —  E. Jean Carroll appears on “Good Morning American” on Jan. 29, 2024, after a jury awarded her more than $83 million … ",
    "url": "https://abcnews.go.com/GMA/Culture/jean-carroll-plans-83-million-donald-trump-hates/story?id=106751516"
  },
  {
    "text": "The second insurrection  —  “The Federal Government has broad constitutional powers in determining what aliens shall be admitted to the United States, the period they may remain, regulation of their conduct before naturalization, and the terms and conditions of their naturalization … ",
    "url": "https://popular.info/p/the-second-insurrection"
  },
  {
    "text": "Pro-Trump network OAN execs may have ‘engaged in criminal activities’ while promoting 2020 election lies, Smartmatic alleges  —  In the wake of the 2020 election, the president of the far-right network One America News sent a potentially explosive email to former Trump campaign lawyer Sidney Powell … ",
    "url": "https://www.cnn.com/2024/01/29/business/oan-smartmatic-election-lawsuit/"
  },
  {
    "text": "At Least 12 U.N. Agency Employees Involved in Oct. 7 Attacks, Intelligence Reports Say  —  Around 10% of Palestinian aid agency's 12,000 staff in Gaza have links to militants, according to intelligence dossier  —  TEL AVIV—At least 12 employees of the U.N.'s Palestinian refugee agency … ",
    "url": "https://www.wsj.com/world/middle-east/at-least-12-u-n-agency-employees-involved-in-oct-7-attacks-intelligence-reports-say-a7de8f36?mod=followamazon"
  },
  {
    "text": "Trump's Secret Plan to Expand Presidential Immunity To ‘King George’ Levels  —  Tired of being criminally prosecuted, Donald Trump and his allies are plotting a way to give presidents a legal shield for life if he wins in 2024 … But the arguments that Trump's lawyers are currently litigating … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trumps-secret-plan-expand-presidential-immunity-1234955710/"
  },
  {
    "text": "Kyrsten Sinema Loves to Fly Private—on the Taxpayer's Dime  —  Kyrsten Sinema is using her Senate office's money for a curious purpose: private flights. … It's hardly a secret that Sen. Kyrsten Sinema (I-AZ) likes to fly private.  It was just last April when it came out that Sinema's campaign … ",
    "url": "https://www.thedailybeast.com/kyrsten-sinema-loves-to-fly-privateon-the-taxpayers-dime"
  },
  {
    "text": "The combustible mix of right-wing anger coming together in Texas  —  One of the most striking news photos taken in 2014, 10 years ago, showed an armed man lying on a highway overpass in Nevada, aiming a long gun through a gap in the overpass's concrete barriers.  The target at which he was apparently aiming?",
    "url": "https://www.washingtonpost.com/politics/2024/01/29/immigration-border-texas-trump/"
  },
  {
    "text": "One Iranian and Two Canadian Nationals Indicted in Murder-for-Hire Scheme  —  For Immediate Release  —  One Iranian and two Canadian nationals have been charged with conspiracy to use interstate commerce in the commission of a murder-for-hire plot.  —  According to court documents … ",
    "url": "https://www.justice.gov/opa/pr/one-iranian-and-two-canadian-nationals-indicted-murder-hire-scheme"
  },
  {
    "text": "GOP's Salazar says she can't recall how she voted on CHIPS, appropriations bills  —  Rep. María Salazar (R-Fla.) said on Sunday she could not recall how she voted on two key pieces of legislation that she has since touted as victories that she brought home for her district.",
    "url": "https://thehill.com/homenews/house/4435658-gop-salazar-cannot-recall-vote-chips-appropriations-bills/"
  }
]