[
  {
    "text": "Trump Stepped Down From Trust Within Days of Allen Weisselberg's Post-Indictment Resignation  —  The revelation was largely subsumed by the former president's rambunctious and pugilistic testimony, insulting the judge and New York attorney general  —  Donald J. Trump's ongoing civil fraud trial … ",
    "url": "https://themessenger.com/politics/trump-resigned-trust-allen-weisselberg-indictment"
  },
  {
    "text": "Trump's Recipe for a Shockingly Raw Power Grab  —  The former president and his allies are reportedly planning to lay siege to the rule of law.  —  Former President Donald Trump speaks at a rally on Apr. 23, 2022 in Delaware, Ohio.  Joe Maiorana/AP  —  You can't say Donald Trump didn't warn us.",
    "url": "https://www.politico.com/news/magazine/2023/11/07/mag-shafer-trump-dictator-00125767"
  },
  {
    "text": "Political Doom Spiral: What if Both Biden and Trump Died Next Summer?  —  The title question is something that many of us probably don't like to spend a lot of time thinking about.  Or perhaps you dwell on it quite a bit.  But at this point, it's a topic that is increasingly hard to ignore.",
    "url": "https://hotair.com/jazz-shaw/2023/11/07/political-doom-spiral-what-if-both-biden-and-trump-died-next-summer-n590732"
  },
  {
    "text": "CNN Poll: Trump narrowly leads Biden in hypothetical rematch  —  One year out from Election Day 2024, former President Donald Trump narrowly leads President Joe Biden, 49% to 45% among registered voters, in a hypothetical rematch in the latest CNN poll conducted by SSRS.",
    "url": "https://www.cnn.com/2023/11/07/politics/cnn-poll-trump-biden-matchup/"
  },
  {
    "text": "Ohio Votes to Establish Right to Abortion  —  The State Constitution will protect access to the procedure.  The result sends a strong signal that voters are still angry about the demise of Roe.  —  Ohio voters approved a ballot measure enshrining a right to abortion in the State Constitution on Tuesday … ",
    "url": "https://www.nytimes.com/2023/11/07/us/politics/ohio-abortion-amendment.html"
  },
  {
    "text": "Ohio Issue 1 Election Results: Establish a Constitutional Right to Abortion  —  Ohio Issue 2 Passes  —  Ohio has voted to legalize the possession and sale of marijuana.  ›  —  Ohio Issue 1 Passes  —  Ohio has voted to make the right to an abortion protected by the State Constitution.",
    "url": "https://www.nytimes.com/interactive/2023/11/07/us/elections/results-ohio-issue-1-abortion-rights.html"
  },
  {
    "text": "Democratic Gov. Andy Beshear wins re-election in Kentucky  —  NBC News projects a victory for Beshear, who leaned on his work as governor and outspent opponent Daniel Cameron.  —  Democratic Gov. Andy Beshear of Kentucky has won re-election, defying the usual political leanings of the red state, NBC News projects.",
    "url": "https://www.nbcnews.com/politics/elections/democratic-governor-andy-beshear-wins-second-term-kentucky-rcna122072"
  },
  {
    "text": "Democrat Andy Beshear wins reelection in Kentucky governor's race  —  Democratic Gov. Andy Beshear was projected to win reelection in Kentucky, according to Decision Desk HQ, fending off a challenge from his former President Trump-backed Republican challenger.",
    "url": "https://thehill.com/homenews/campaign/4297778-andy-beshear-kentucky-governors-race-democrat/"
  },
  {
    "text": "I Was Branded the ‘Central Park Karen’.  I Still Live in Hiding  —  “Slit your wrists,” strangers texted me.  —  “If anyone deserves prison rape, it's you,” people I had never met called me to say.  —  “The noble thing to do is to remove yourself from society...so please kill yourself.”",
    "url": "https://www.newsweek.com/i-was-branded-central-park-karen-i-still-live-hiding-1839483"
  },
  {
    "text": "Democrat flips deep-red New Jersey Assembly seat in upset  —  Democrats have successfully flipped a seat in New Jersey's General Assembly in a a deep-red district that has not elected a Democratic legislator in three decades.  —  Decision Desk HQ projects that Democrat Avi Schnall has won … ",
    "url": "https://thehill.com/homenews/campaign/4298839-democrat-flips-deep-red-new-jersey-assembly-seat-in-upset/"
  },
  {
    "text": "House GOP moves to reduce Buttigieg's salary to $1  —  It has no shot at becoming law, but it's not the first time Republicans have tried to use obscure spending rules this way.",
    "url": "https://www.politico.com/live-updates/2023/11/07/congress/mtg-aims-at-buttigieg-00125906"
  },
  {
    "text": "Danica Roem becomes Virginia's first openly transgender state senator  —  Virginia Democrat Danica Roem was projected to win her election Tuesday, according to Decision Desk HQ, becoming the commonwealth's first openly transgender state senator and the first out transgender person elected to a state Senate anywhere in the South.",
    "url": "https://thehill.com/homenews/campaign/4297911-danica-roem-becomes-virginias-first-openly-transgender-state-senator/"
  },
  {
    "text": "LIVE ELECTION RESULTS: Kentucky, Mississippi, Ohio, Pennsylvania, Rhode Island, Virginia  —  It's a Tuesday in November and it's a big Election Day for several different states and municipalities.  There are gubernatorial races in Kentucky and Mississippi, a special election for one of Rhode Island's … ",
    "url": "https://redstate.com/redstatestaff/2023/11/07/live-election-results-kentucky-mississippi-ohio-pennsylvania-rhode-island-virginia-n2166023"
  },
  {
    "text": "House votes to censure Rashida Tlaib over anti-Israel comments  —  The House of Representatives has voted to censure Rep. Rashida Tlaib, D-Mich., in a 234 - 188 vote on Tuesday night.  —  The punishment, while largely symbolic, was a formal public rebuke of her most recent anti-Israel comments … ",
    "url": "https://www.foxnews.com/politics/house-votes-censure-rashida-tlaib-over-anti-israel-comments"
  },
  {
    "text": "Mike Johnson embodies evangelicals' embattlement strategy.  It may be backfiring.  —  (RNS) — Since Rep. Mike Johnson was elected speaker of the House of Representatives, much has been written about his evangelical Christian faith and its influence on his right-wing political views.",
    "url": "https://religionnews.com/2023/11/06/mike-johnsons-embodies-evangelicals-embattlement-strategy-it-may-be-backfiring/"
  },
  {
    "text": "Republican Candidate Charged With Child Porn Offenses Hours Before Election  —  A Texas Republican city council candidate is facing felony child pornography charges after being arrested just hours before the elections.  —  Brad Benson, a candidate for Place #4 on the city council of Granbury … ",
    "url": "https://www.newsweek.com/texas-republican-candidate-brad-benson-charged-child-porn-offences-hours-before-election-1841474"
  },
  {
    "text": "Behind closed doors, senators pitch options to solve Tuberville's blockade  —  “Hopefully we can work through this and get something done in a short period of time,” the Alabama senator said.  —  Tommy Tuberville is open to a face-saving solution to get out of his self-made blockade of military nominees … ",
    "url": "https://www.politico.com/news/2023/11/07/tuberville-military-promotions-gop-00125821"
  },
  {
    "text": "Ex-CIA officer pleads guilty to drugging, sexually abusing women  —  Brian Jeffrey Raymond, 47, will be sentenced to between 24 and 30 years in prison.  He drugged and abused women, including video recording them nude.  —  A former CIA agent pleaded guilty Tuesday to drugging and sexually abusing … ",
    "url": "https://www.nbcnews.com/news/us-news/ex-cia-officer-pleads-guilty-drugging-sexually-abusing-women-rcna124102"
  },
  {
    "text": "House Republicans Toil for a Spending Strategy With a Shutdown Close at Hand  —  Speaker Mike Johnson is facing many of the same challenges his predecessor did as he looks for a way to avoid a government shutdown that will be acceptable to his deeply divided conference.",
    "url": "https://www.nytimes.com/2023/11/07/us/politics/house-republicans-spending-shutdown.html"
  },
  {
    "text": "What's up with Speaker Johnson not reporting a bank account?  —  This column has been updated.  —  A teeny fraction of American households don't have a bank account.  In recent days, it appeared that one such household might belong to the man second in line for the presidency: House Speaker Mike Johnson.",
    "url": "https://www.washingtonpost.com/opinions/2023/11/07/mike-johnson-speaker-bank-account-mystery/"
  },
  {
    "text": "Clarksville, Indiana, town council candidate dead after collapsing at polling station  —  David “Red” Worrall, a former District 3 town councilman and Republican candidate running for the Clarksville, Indiana, council, died Tuesday, according to a news release issued by the town.",
    "url": "https://www.washingtonexaminer.com/news/campaigns/clarksville-town-council-candidate-dead-collapsing"
  },
  {
    "text": "US Army Brass: Send in the Clowns  —  Right about now, I am almost without words at the complete chaos the United States Army has devolved into.  Believe me, I'm going to find plenty of words, but it is just such a gob-smacking, indescribable, totally avoidable, epic cluster flock that I almost … ",
    "url": "https://hotair.com/tree-hugging-sister/2023/11/07/us-army-brass-send-in-the-clowns-n590598"
  }
]