[
  {
    "text": "‘Same clown car with a different driver’: House GOP goes off the rails  —  Mike Johnson may have avoided a shutdown, but the House GOP is still emotionally raw from its 22-day speakership fight.  —  The House GOP has descended, as one member put it, into “schoolyard bully bullshit.”",
    "url": "https://www.politico.com/news/2023/11/15/the-house-gop-is-stuck-on-a-failure-loop-00127418"
  },
  {
    "text": "‘Signs of life’ on longshot Senate border deal  —  Good morning, Early Birds.  Dwayne Johnson, a.k.a. The Rock, was on Capitol Hill on Wednesday.  We wonder if he and Sen. Joe Manchin III (D-W.Va.) met up to discuss a potential presidential unity ticket.  Tips: earlytips@washpost.com.",
    "url": "https://www.washingtonpost.com/politics/2023/11/16/signs-life-longshot-senate-border-deal/"
  },
  {
    "text": "Mitch McConnell's Strength Is Tested in Fight for Ukraine Aid  —  Longtime GOP Senate leader backs broad foreign-aid package as some Republican colleagues balk  —  WASHINGTON—The Senate battle over Ukraine aid has become a legacy-defining issue for Minority Leader Mitch McConnell … ",
    "url": "https://www.wsj.com/politics/policy/mitch-mcconnells-strength-is-tested-in-fight-for-ukraine-aid-42488da5?mod=followamazon"
  },
  {
    "text": "Trumpworld Is Already at War Over Staffing a New Trump White House  —  A year out from Election Day, Trumpworld is tearing itself apart over different groups claiming they have the inside track on staffing the White House. … The America First Policy Institute was supposed to add … ",
    "url": "https://www.thedailybeast.com/trumpworld-is-already-at-war-over-staffing-a-new-trump-white-house"
  },
  {
    "text": "Rudy's Ukraine caper looks even worse now  —  This free edition of Public Notice is made possible by paid subscribers.  If you aren't one already, please consider signing up.  Just click the button below.  —  Click for Public Notice free trial  —  There's something so utterly predictable … ",
    "url": "https://www.publicnotice.co/p/giuliani-ukraine-kulyk-derkach-dubinsky-treason"
  },
  {
    "text": "Last Post, Please Read  —  Good morning.  This is Zandar's Dad.  I am sorry to tell you that he passed away over the weekend, peacefully in his sleep.  Fortunately, his computer was on and open to this page but I don't know if I will be able to post again.  This blog was Jon's passion.",
    "url": "http://zandarvts.blogspot.com/2023/11/last-post-please-read.html"
  },
  {
    "text": "Judge to issue protective order in Georgia Trump case  —  Lawyer acknowledges sharing videos that prompted dispute.  —  A Fulton County judge Wednesday said he would draft an order protecting some evidence from pre-trial disclosure in the Donald Trump election interference case … ",
    "url": "https://www.ajc.com/politics/judge-to-issue-protective-order-in-georgia-trump-case/D5SWV2HPXND4VDMZNWYK3UDE5M/"
  },
  {
    "text": "How Trump plays the media on abortion  —  Since the fall of Roe v. Wade, abortion has been a losing issue for Republicans.  This was evident in this year's election: in Ohio, voters approved a constitutional amendment to enshrine abortion rights.  In Kentucky, pro-choice Governor Andy Beshear … ",
    "url": "https://popular.info/p/how-trump-plays-the-media-on-abortion"
  },
  {
    "text": "Playbook: Biden and Xi clear the air  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  THE TRUTH IS OUT THERE — Garrett Graff for POLITICO Mag: “We Have a UFO Problem.  What We Don't Have (Yet) is a Serious Answer.”  —  SHOWDOWN ON SOUTH CAPITOL STREET … ",
    "url": "https://www.politico.com/newsletters/playbook/2023/11/16/bidens-one-two-step-with-china-00127542"
  },
  {
    "text": "More pandas will be coming to the U.S., China's president signals  —  SAN FRANCISCO — Chinese President Xi Jinping signaled that China will send new pandas to the United States, calling them “envoys of friendship between the Chinese and American peoples.”  —  “We are ready to continue … ",
    "url": "https://www.npr.org/2023/11/16/1213443655/pandas-us-china-xi"
  },
  {
    "text": "Scoop: U.S. warns Israel it's violating visa waiver deal with West Bank closure  —  The Biden administration warned Israel that it is violating the visa waiver agreement with the U.S. by preventing Palestinian Americans who live in the occupied West Bank from entering Israel since … ",
    "url": "https://www.axios.com/2023/11/16/israel-visa-waiver-palestinian-americans-us-violation"
  },
  {
    "text": "Trump's new Latino strategy casts him as victim of socialists … - Hialeah is more than 95% Hispanic, and the vast majority of those residents are Cuban Americans, a conservative electorate that identifies more with Republicans than many other Latino groups.",
    "url": "https://www.axios.com/2023/11/16/trump-new-latino-strategy-victim-socialists-florida"
  },
  {
    "text": "Kari Lake ‘drove a stake’ through the heart of McCain Republicans.  Now she wants a meeting.  —  The Senate candidate is making appeals to some of the very people she attacked in 2022.  —  Kari Lake is finally ready to move on from the 2022 election — or at least she wants her rivals to.",
    "url": "https://www.politico.com/news/2023/11/15/kari-lake-mccain-republicans-00127464"
  },
  {
    "text": "Capitol Police clash with group protesting ‘violently’ outside DNC  —  Capitol police say all members have been evacuated from the area.  —  Police officers wear gas masks as they keep watch outside the Democratic National Headquarters during a multi-denominational event hosted … ",
    "url": "https://abcnews.go.com/Politics/capitol-police-working-back-150-people-protesting-dnc/story?id=104930336"
  },
  {
    "text": "Gavin Newsom Gave Millions to Mosques that Cheer the Annihilation of Jews  —  California Gov. Gavin Newsom (D.) has awarded millions of dollars in taxpayer funds to mosques whose leaders have preached anti-Semitic hate and called for violence against Israel.",
    "url": "https://freebeacon.com/california/gavin-newsom-gave-millions-to-mosques-that-cheer-the-annihilation-of-jews/"
  },
  {
    "text": "Ethics Committee will not recommend punishment for embattled Rep. George Santos  —  The New York Republican has pleaded not guilty to charges and defended himself.  —  Rep. George Santos walks back to his office after debate on the House floor on a resolution to expel him from Congress … ",
    "url": "https://abcnews.go.com/Politics/ethics-committee-recommend-punishment-embattled-rep-george-santos/story?id=104913312"
  },
  {
    "text": "Ronna McDaniel is under siege — and, her critics concede, likely to survive  —  The RNC chair faces criticism from lawmakers, candidates and activists.  But the committee members themselves don't have much appetite for a change at this juncture.  —  Republican National Committee Chair Ronna McDaniel … ",
    "url": "https://www.politico.com/news/2023/11/16/ronna-mcdaniel-republican-national-committee-00127506"
  },
  {
    "text": "The Squad Is About to Fight for Its Political Life  —  One of the biggest, bitterest, and most expensive political battles of the 2024 election cycle has emerged: The American Israel Public Affairs Committee, one of the most powerful, best-funded influence operations in Washington … ",
    "url": "https://slate.com/news-and-politics/2023/11/squad-primary-battle-israel-gaza-pacs.html"
  },
  {
    "text": "Trump's own fraud-trial expert testifies about ‘glaring’ problems in his financial statements — but blames the accountants  — Wednesday was Trump's third day of presenting defense witnesses at his civil fraud trial in NY.  — An ex-SEC accountant offered blunt testimony on Trump's net-worth statements.",
    "url": "https://www.businessinsider.com/trump-gets-beat-up-by-his-own-fraud-trial-expert-2023-11?op=1"
  },
  {
    "text": "Hamas agrees to tentative deal to free dozens of hostages, pending Israel's approval  —  Hamas wants a multiday pause in fighting, increased humanitarian aid, and freedom for an unknown number of Palestinians in Israeli jails in exchange for the release of at least 50 women and children being held in Gaza",
    "url": "https://www.washingtonpost.com/national-security/2023/11/15/hamas-israel-gaza-hostage-deal/"
  },
  {
    "text": "Biden judicial nominee fails to explain law terms when asked by Sen. John Kennedy  —  Sen. John Kennedy (R-LA) stumped one of President Joe Biden's judicial nominees while going through a speed round of questions about legal terms during a Senate Judiciary Committee hearing on Wednesday.",
    "url": "https://www.washingtonexaminer.com/news/senate/biden-judicial-nominee-fails-explain-law-terms-asked-kennedy"
  },
  {
    "text": "Nikki Haley suffers setback from conservatives after vowing to verify social media users  —  Republican presidential candidate Nikki Haley's recent comments on requiring social media users to verify their identity online have sparked conservative backlash to a campaign that has steadily gained momentum in the GOP primary race.",
    "url": "https://www.washingtonexaminer.com/news/campaigns/nikki-haley-suffers-setback-conservatives-social-media-users"
  },
  {
    "text": "20 women are now suing Texas, saying state abortion laws endangered them  —  Cristina Nuñez's doctors had always advised her not to get pregnant.  She has diabetes, end-stage renal disease and other health conditions, and when she unexpectedly did become pregnant, it made her extremely sick.",
    "url": "https://www.npr.org/sections/health-shots/2023/11/15/1213188342/20-women-sue-texas-over-abortion-laws"
  },
  {
    "text": "‘Anti-establishment’ activist sought to incite Trump supporters on Jan. 6, DOJ argues  —  John Earle Sullivan, a self-proclaimed activist and journalist, only filmed the riot as a “ploy” to rile up the mob, federal prosecutors argued at his trial.  —  WASHINGTON — A man who previously held himself … ",
    "url": "https://www.nbcnews.com/politics/justice-department/anti-establishment-activist-sought-incite-trump-supporters-jan-6-doj-a-rcna125397"
  }
]