[
  {
    "text": "A tense new Jan. 6 video shows Republican congressmen admonishing rioters trying to enter House chamber  —  “You ought to be ashamed of yourself!” one Republican representative told rioters as they attempted to breach the House floor.  “I've never had people act this way.”",
    "url": "https://www.nbcnews.com/politics/justice-department/tense-new-jan-6-video-shows-republican-congressmen-admonishing-rioters-rcna132625"
  },
  {
    "text": "What Did Josh Hawley's Jan. 6 Fist Pump Really Mean?  We Asked the Photographer Who Got the Shot.  —  A Q&A with POLITICO photographer Francis Chung on capturing an iconic moment.  —  Sen. Josh Hawley gestures toward a crowd of supporters of President Donald Trump gathered outside … ",
    "url": "https://www.politico.com/news/magazine/2024/01/06/jan-6-josh-hawley-photo-q-a-00134017"
  },
  {
    "text": "Trump Signals an Election Year Full of Falsehoods on Jan. 6 and Democracy  —  In dueling sets of speeches, Donald Trump and President Biden are framing the election as a battle for the future of democracy — with Mr. Trump brazenly casting Mr. Biden as the true menace.",
    "url": "https://www.nytimes.com/2024/01/06/us/politics/jan-6-trump-biden.html"
  },
  {
    "text": "FBI in Florida captures 3 people linked to Jan. 6 on third anniversary of riot  —  The FBI apprehended three people accused of participating in the Jan. 6, 2021, attack on the Capitol, at a ranch in Florida, the agency announced Saturday.  —  FBI's Tampa office identified the fugitives … ",
    "url": "https://thehill.com/regulation/court-battles/4393014-fbi-captures-3-fugitives-linked-to-jan-6-riot/"
  },
  {
    "text": "Fanone says GOP lawmakers attempt to ‘whitewash’ Jan. 6 due to ‘politically inconvenient’ reality  —  Former D.C. police officer Michael Fanone lashed out against GOP lawmakers on Friday, blasting attempts to “whitewash” the Jan. 6 Capitol riots as something less than what they were as we reach … ",
    "url": "https://thehill.com/homenews/4393040-fanone-says-gop-lawmakers-attempt-whitewash-jan-6-due-to-politically-inconvenient-reality/"
  },
  {
    "text": "Obama, worried about Trump, urges Biden circle to bolster campaign  —  The former president shared his thoughts about the reelection campaign during a private lunch with Biden at the White House  —  Former president Barack Obama has raised questions about the structure of President Biden's … ",
    "url": "https://www.washingtonpost.com/politics/2024/01/06/obama-biden-meeting-campaign-2024/"
  },
  {
    "text": "Trump's promotion of debunked election report reveals divisions in his circle  —  Former president Donald Trump took to his social media website one day this past week to post a report ridden with falsehoods about fraud in the 2020 election.  And his legal team cited Trump's post in a brief … ",
    "url": "https://www.washingtonpost.com/politics/2024/01/06/trump-debunked-report-election-advisers/"
  },
  {
    "text": "Trump Considers Making 2017 Personal Tax Cuts Permanent  — Candidate intends to keep corporate tax levels unchanged  — Trump aims to seize on Biden's economic weakness with voters  —  Donald Trump plans to make permanent the 2017 individual tax cuts that he enacted as president … ",
    "url": "https://www.bloomberg.com/news/articles/2024-01-06/trump-considers-making-2017-personal-tax-cuts-permanent"
  },
  {
    "text": "Republican secretary of state threatens to kick Biden off the ballot as Trump payback  —  Missouri Secretary of State Jay Ashcroft said that while he didn't want to do it, he had to remind people of how “severe” the situation is.  —  A top Republican official in Missouri is threatening … ",
    "url": "https://www.nbcnews.com/politics/2024-election/missouri-republican-secretary-of-state-biden-trump-ballot-rcna132600"
  },
  {
    "text": "DeSantis Says He's Looking to Make ‘Credible Case’ to Remove Biden From Florida Ballot  —  The Sunshine State governor made a similar comment recently when he warned that Maine's ruling disqualifying Trump 'opens up Pandora's box'  —  JWPlayer  —  Florida Gov. Ron DeSantis has revealed that he's … ",
    "url": "https://themessenger.com/politics/desantis-says-hes-looking-to-make-credible-case-to-remove-biden-from-florida-ballot"
  },
  {
    "text": "Statement from Pentagon Press Secretary Maj. Gen. Pat Ryder on Secretary of Defense Austin  —  Pentagon Press Secretary Maj. Gen. Pat Ryder provided the following statement on Secretary of Defense Austin:  —  On the evening of January 1, Secretary of Defense Lloyd J. Austin III was admitted … ",
    "url": "https://www.defense.gov/News/Releases/Release/Article/3633270/statement-from-pentagon-press-secretary-maj-gen-pat-ryder-on-secretary-of-defen/"
  },
  {
    "text": "US Intelligence Shows Flawed China Missiles Led Xi to Purge Army  — China missiles filled with water, not fuel: US intelligence  — Xi seeking to root out corruption, prepare military for combat  —  US intelligence indicates that President Xi Jinping's sweeping military purge came … ",
    "url": "https://www.bloomberg.com/news/articles/2024-01-06/us-intelligence-shows-flawed-china-missiles-led-xi-jinping-to-purge-military"
  },
  {
    "text": "A second Trump presidency is an existential national security threat to our democracy  —  If you had told us in 2019 that a mob of Americans would be inspired by a president of the United States to ransack the U.S. Capitol, assault police officers and intimidate sitting members of Congress … ",
    "url": "https://thehill.com/opinion/4392907-a-second-trump-presidency-is-an-existential-national-security-threat-to-our-democracy/"
  },
  {
    "text": "House Speaker Johnson invites Biden to deliver State of the Union address on March 7 … - It will be the first State of the Union address for Johnson, who became House speaker in October after a drawn-out and bitter battle for the chair. … - He also went off script and urged Republicans … ",
    "url": "https://www.axios.com/2024/01/06/biden-state-of-the-union-address-super-tuesday"
  }
]