[
  {
    "text": "Trump Posts Fake Video Showing Obama Arrest  —  President Trump shared what appeared to be an A.I.-generated video of former President Barack Obama being detained in the Oval Office.  —  President Trump reposted a fake video showing former President Barack Obama being arrested in the Oval Office … ",
    "url": "https://www.nytimes.com/2025/07/21/us/politics/trump-fake-video-obama-arrest.html?unlocked_article_code=1.YE8.5AlG.yCWEfO-dHbwl&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Trump's Wildly Fascistic Posting Spree Isn't Just a Distraction From Epstein  —  The president spent Sunday night posting content fantasizing about the arrest of Barack Obama and other Democrats  —  President Donald Trump shared an AI-generated video depicting FBI agents arresting former … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-fascist-posting-spree-distraction-epstein-1235389825/"
  },
  {
    "text": "Trump's Big Epstein Distraction Isn't Working  —  Hope and Change the Subject  —  FACED WITH CONSERVATIVE backlash over the end of the Jeffrey Epstein investigation, Donald Trump over the past week has engaged in what can only be described as a monumental distraction campaign.",
    "url": "https://www.thebulwark.com/p/trump-big-epstein-distraction-isnt-working-obama-treason-polygamy"
  },
  {
    "text": "As MAGA world focuses on Epstein, Trump seeks focus on anything else  —  In the last 48 hours, Trump has unspooled comments on a litany of controversies, all of which seem designed to distract attention from the Jeffrey Epstein case.  —  Just now  —  Over the last 48 hours … ",
    "url": "https://www.washingtonpost.com/politics/2025/07/21/trump-epstein-distractions/"
  },
  {
    "text": "Records Related to the Assassination of the Reverend Dr. Martin Luther King, Jr.  —  On This Page  —  The National Archives' Role in Fulfilling Executive Order 14176  —  How is the National Archives Making These Records Available?  —  2025 Release  —  Release Notes  — Contact Us",
    "url": "https://www.archives.gov/research/mlk"
  },
  {
    "text": "Trump administration released FBI records on MLK Jr. despite his family's opposition  —  The Trump administration has released records of the FBI's surveillance of Martin Luther King Jr., despite opposition from the slain Nobel laureate's family and the civil rights group that he led until his 1968 assassination.",
    "url": "https://apnews.com/article/martin-luther-king-fbi-files-donald-trump-1a58c3f0c9ec8878e487434e0d372b81"
  },
  {
    "text": "Tulsi dumps COINTELPRO files on MLK  —  Speaking of recurring themes in the conservative movement, Trump and Gabbard have decided to go J. Edgar Hoover with a Trump scandal getting traction: … Relatedly, his taking the FBI's smear campaign at face value was a clear sign that David Garrow was well on the way to crankdom.",
    "url": "https://www.lawyersgunsmoneyblog.com/2025/07/tulsi-dumps-cointelpro-files-on-mlk"
  },
  {
    "text": "House Republicans at standstill over Epstein drama  —  House Republicans may choose to scrap several floor votes this week as internal party drama over the release of Jeffrey Epstein files is derailing the work of the Rules Committee.  The panel came to a standstill, again … ",
    "url": "https://www.politico.com/live-updates/2025/07/21/congress/epstein-drama-disrupts-house-schedule-00466632"
  },
  {
    "text": "White House removes Wall Street Journal from Scotland press pool over Epstein bombshell … The White House is removing the Wall Street Journal from the pool of reporters covering the president's weekend trip to Scotland, White House press secretary Karoline Leavitt told POLITICO.",
    "url": "https://www.politico.com/news/2025/07/21/journal-removed-white-house-pool-epstein-00465548"
  },
  {
    "text": "Judge gives ex-officer nearly 3 years in Breonna Taylor raid, rebuffs DOJ call for no prison time  —  A federal judge on Monday sentenced a former Kentucky police officer to nearly three years in prison for using excessive force during the deadly Breonna Taylor raid five years ago … ",
    "url": "https://apnews.com/article/breonna-taylor-raid-hankison-sentence-4da93877da13f506be42cc1c738cab2b"
  },
  {
    "text": "Malcolm-Jamal Warner, ‘Cosby Show’ actor, dies at 54 in Costa Rica drowning  —  Malcolm-Jamal Warner the actor who played teenage son Theo Huxtable on “The Cosby Show,” has died at age 54 in an accidental drowning in Costa Rica, authorities there said.  Costa Rica's Judicial Investigation Department … ",
    "url": "https://apnews.com/article/malcolm-jamal-warner-dies-drowning-330d6643dcb2cd038a3fe5a9cc8abb70"
  },
  {
    "text": "Estimated Budgetary Effects of Public Law 119-21, to Provide for Reconciliation Pursuant to Title II of H. Con. Res. 14, Relative to CBO's January 2025 Baseline  —  Public Law 119-21 as enacted on July 4, 2025  —  CBO estimates that Public Law 119-21 will result in a net increase … ",
    "url": "https://www.cbo.gov/publication/61570"
  },
  {
    "text": "Pam Bondi Grants Hillary Clinton Email Probe Request Amid Epstein Furor  —  Attorney General Pam Bondi announced Monday that the Justice Department has released documents related to the FBI's investigation into Hillary Clinton's use of a private email server.  —  The Context",
    "url": "https://www.newsweek.com/pam-bondi-jeffrey-epstein-files-hillary-clinton-emails-2101893"
  },
  {
    "text": "FEMA search and rescue chief resigns after frustration with Texas flood response  —  The head of FEMA's Urban Search and Rescue branch, which runs a network of teams stationed across the country that can swiftly respond to natural disasters, resigned on Monday.",
    "url": "https://cnn.com/2025/07/21/politics/fema-search-and-rescue-chief-resigns"
  },
  {
    "text": "Treasury Secretary Bessent calls for a review of ‘the entire’ Federal Reserve … Treasury Secretary Scott Bessent on Monday suggested a review of the Federal Reserve that would go beyond the current controversy over building renovations and look at its overall function.",
    "url": "https://www.cnbc.com/2025/07/21/treasury-secretary-bessent-calls-for-a-review-of-the-entire-federal-reserve.html"
  },
  {
    "text": "Trump lashes out at federal judge presiding over Harvard case … “She is a TOTAL DISASTER, which I say even before hearing her Ruling,” Trump wrote in the post to his social media platform, Truth Social.  “She has systematically taken over the various Harvard cases, and is an automatic ‘loss’ for the People of our Country!”",
    "url": "https://www.politico.com/news/2025/07/21/trump-harvard-case-judge-00465755"
  },
  {
    "text": "“You Feel Like Your Life is Over”  —  Abusive Practices at Three Florida Immigration Detention Centers Since January 2025  —  Summary  —  Among the flurry of immigration-related executive orders marking the second presidential administration of Donald Trump is Executive Order 14159 … ",
    "url": "https://www.hrw.org/report/2025/07/21/you-feel-like-your-life-is-over/abusive-practices-at-three-florida-immigration"
  },
  {
    "text": "Why Colbert got canceled  —  There was a time not so long ago when going on TV with Jon Stewart or Stephen Colbert was pretty much the best thing I could imagine.  —  According to IMDb, I appeared on The Daily Show seven times, The Colbert Report three times, and The Late Show with Stephen Colbert … ",
    "url": "https://www.natesilver.net/p/why-colbert-got-canceled"
  },
  {
    "text": "Donald Trump: six months in six charts  —  US president has had profound impact at home and abroad with tumultuous start to second term  —  It has been six months since Donald Trump began his second term as US president.  —  In that time he has shaken trading relations with US allies … ",
    "url": "https://www.ft.com/content/bba4bc2f-2619-49a1-b81b-36e82bef768a"
  },
  {
    "text": "Only Three Weeks Left to Register for LibCon2025  —  Space is filling up fast for ISMA's second annual ‘Liberalism for the 21st Century’ conference—so you should sign up now without delay  —  There are only three weeks left till our parent organization, the Institute for the Study … ",
    "url": "https://www.theunpopulist.net/p/only-three-weeks-left-to-register"
  },
  {
    "text": "The Art of the Settlement … For weeks, according to multiple people familiar with the matter, the executives had held firm at $15 million.  But Trump's legal team—apparently spooked by a looming court deadline that could move the case out of Amarillo, Texas—had begun dropping their demand.",
    "url": "https://www.status.news/p/paramount-trump-settlement-board-ceos"
  },
  {
    "text": "Is Trump Really Turning the Tables on the Epstein Story?  The Beltway Press's Favorite Source Thinks So.  —  Let's look at who exactly is making this claim in, uh, every media outlet in the United States. … Over the weekend, every outlet with a Washington newsroom seemed to be wondering the same thing … ",
    "url": "https://slate.com/news-and-politics/2025/07/trump-epstein-news-steve-bannon.html"
  },
  {
    "text": "U.S.-Based Orange Juice Importer Sues Over Trump's 50% Tariff on Brazilian Goods  —  Orange juice prices in the U.S. are already high.  The suit argues that the tariff would lead to retail price hikes of up to 25 percent.  —  A U.S.-based juice company is suing over President Trump's pledge … ",
    "url": "https://www.nytimes.com/2025/07/21/us/politics/orange-juice-trump-brazil-tariffs.html"
  },
  {
    "text": "Prominent US anti-vaxxer says he caught measles and traveled back home  —  Brian Hooker seems to not have alerted authorities of his illness after leaving west Texas  —  One of the most prominent anti-vaccine activists in the US says he caught measles in west Texas and traveled back home … ",
    "url": "https://www.theguardian.com/us-news/2025/jul/21/anti-vaxxer-measles-texas"
  },
  {
    "text": "My Fix for the Confused and Leaderless Democrats  —  Constipated.  Leaderless.  Confused.  A cracked-out clown car.  Divided.  These are the words I hear my fellow Democrats using to describe our party as of late.  The truth is they're not wrong: The Democratic Party is in shambles.",
    "url": "https://www.nytimes.com/2025/07/21/opinion/carville-democrats-midterms-mamdani.html"
  },
  {
    "text": "Michael Flynn floats ‘military trial for Obama’ despite presidential immunity  —  Disgraced former National Security Adviser Michael Flynn suggested former President Barack Obama should face a “military trial” after Director of National Intelligence Tulsi Gabbard accused him of a … ",
    "url": "https://www.rawstory.com/michael-flynn-obama/"
  },
  {
    "text": "ICE will ‘flood the zone’ in NYC … The alleged shooter entered the country illegally in 2023 during then-President Joe Biden's tenure and had been arrested and released four times in the years since, Noem said.  She blamed the shooting on New York's sanctuary city policies that limit … ",
    "url": "https://www.politico.com/news/2025/07/21/ice-new-york-city-enforcement-00465313"
  },
  {
    "text": "Divorce, adultery allegations against Paxton jolt Senate race in Texas  —  In one of the biggest GOP primaries of the midterms, Sen. John Cornyn and his allies are attacking Ken Paxton over his personal life, and some backers are rethinking their support.  —  Firebrand Texas Republican Ken … ",
    "url": "https://www.washingtonpost.com/politics/2025/07/21/paxton-divorce-texas-cornyn-senate-trump/"
  },
  {
    "text": "Trump's lawsuit against Wall Street Journal now has a judge — and it's not Aileen Cannon … Trump's new lawsuit against The Wall Street Journal and owner Rupert Murdoch seeks an even more audacious sum: $20 billion.  Trump says the newspaper defamed him by reporting last week that Trump … ",
    "url": "https://www.politico.com/news/2025/07/21/wall-street-lawsuit-judge-donald-trump-00465363"
  },
  {
    "text": "Omar Fateh wins mayoral endorsement at chaotic DFL convention … - It's also the Minneapolis DFL's first endorsement in any contested mayor's race since at least 1997, per the Star Tribune. … - “We know the status quo are going to do anything and everything to maintain power,” he told his supporters.",
    "url": "https://www.axios.com/local/twin-cities/2025/07/20/omar-fateh-minneapolis-dfl-endorsement-mayor"
  },
  {
    "text": "Women's contributions and men's racism erased from history of national monument  —  An initiative to fill in historical gaps from the Muir Woods National Monument disappeared under pressure from the Trump administration.  —  Under pressure from the Trump administration, the National Park Service … ",
    "url": "https://19thnews.org/2025/07/public-lands-women-monuments-erasure/"
  }
]