[
  {
    "text": "Trump approval sinks as Americans criticize his major policies, poll finds  —  After high expectations before he returned to office, most Americans say the president has made the economy worse.  —  As he nears the end of his first 100 days in office, President Donald Trump is facing growing opposition … ",
    "url": "https://www.washingtonpost.com/politics/2025/04/27/trump-poll-approval-rating-100-days/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ1NzI2NDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ3MTA4Nzk5LCJpYXQiOjE3NDU3MjY0MDAsImp0aSI6ImM4MDVkM2Y0LWU1ZDAtNGY1Yi05MmMwLTkzNWZhMWUwYzhhNiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzA0LzI3L3RydW1wLXBvbGwtYXBwcm92YWwtcmF0aW5nLTEwMC1kYXlzLyJ9.9JTGanwIHAx27t6faYMkGv66fWprICpdIDGOupOvm8k"
  },
  {
    "text": "100 days in and the public feels Trump's presidency is proceeding mostly as expected  —  Most partisans agree they are getting what they expected from Trump's second term, but 84% of Democrats think Trump is doing a poor or terrible job as president so far and 68% of Republicans think he's doing a good or great job.",
    "url": "https://apnorc.org/projects/100-days-in-and-the-public-feels-trumps-presidency-is-proceeding-mostly-as-expected/"
  },
  {
    "text": "CNN Poll: Trump's approval at 100 days lower than any president in at least seven decades  —  Donald Trump won back the Oval Office and took charge of the government amid the strongest poll numbers of his political career, but as the 100-day mark of his presidency approaches … ",
    "url": "https://cnn.com/2025/04/27/politics/approval-rating-trump-100-days/"
  },
  {
    "text": "Trump has lowest 100-day approval rating in 80 years: POLL  —  Majorities of voters disapprove of many of Trump's policies, the poll found.  —  President Donald Trump talks to reporters in the Oval Office of the White House in Washington, April 23, 2025.  —  Donald Trump has the lowest 100 … ",
    "url": "https://abcnews.go.com/Politics/trump-lowest-100-day-approval-rating-80-years/story?id=121165473"
  },
  {
    "text": "Three U.S. citizens, ages 2, 4 and 7, swiftly deported from Louisiana  —  The cases have renewed concerns that the Trump administration's expedited deportations are violating the rights of both citizens and noncitizens.  —  Three U.S. citizen children from two different families were deported … ",
    "url": "https://www.washingtonpost.com/immigration/2025/04/26/us-citizen-children-deported-ice/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ1NjQwMDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ3MDIyMzk5LCJpYXQiOjE3NDU2NDAwMDAsImp0aSI6IjM5MjZlNWYyLTg2NDYtNDM4Yi05YTViLTI5YjRlNzM4ZjExYiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9pbW1pZ3JhdGlvbi8yMDI1LzA0LzI2L3VzLWNpdGl6ZW4tY2hpbGRyZW4tZGVwb3J0ZWQtaWNlLyJ9.Rm7u0rjPmi8MkPr9rnhg_-oGfcj8fu1tJP7dscz3WEs&itid=gfta"
  },
  {
    "text": "Democrats seize on a new issue to use against the GOP: Social Security  —  As Democrats link Trump to Social Security's struggles, he reiterates his promise to protect the agency's benefits while also carrying out sweeping staff and spending cuts.  —  Democrats, after weeks of struggling … ",
    "url": "https://www.washingtonpost.com/politics/2025/04/27/social-security-cuts-democrats-trump-republicans/"
  },
  {
    "text": "Republicans in the toughest swing districts become hard to find for people angry about Trump  —  Many days over the past two weeks, no one answered the phone at any of U.S. Rep. Scott Perry's four offices.  Perry's team did not share details about the Republican congressman's public appearances until they were over.",
    "url": "https://apnews.com/article/republicans-recess-congress-no-town-halls-de45284c77fbc54a13c7090f75994674"
  },
  {
    "text": "Georgia Democrat Jon Ossoff says Trump's ‘chaos and uncertainty’ hurts the economy  —  Democratic Sen. Jon Ossoff of Georgia said Saturday that President Donald Trump's unsettled economic policy is the biggest problem facing his state, saying the “chaos and uncertainty” is hurting the ability … ",
    "url": "https://apnews.com/article/jon-ossoff-trump-economy-georgia-ff63415a6c263aa0616979311b9c12c6"
  },
  {
    "text": "Nine dead and multiple injured as driver plows into Vancouver crowd  —  The attack happened during a block party celebrating Filipino culture.  The crowd took the suspect into custody at the scene, and police say they are “confident” it was not an act of terrorism.",
    "url": "https://www.nbcnews.com/world/canada/multiple-dead-injured-driver-plows-vancouver-crowd-police-say-rcna203182"
  },
  {
    "text": "ICE promises bystanders who challenged Charlottesville raid will be prosecuted  —  After ICE raided a downtown Charlottesville courthouse and arrested two men, the federal agency is promising to prosecute the bystanders who challenged their authority.  —  ×  —  Week in Virginia",
    "url": "https://dailyprogress.com/news/local/crime-courts/article_e6ce6e4a-4161-476f-8d28-94150a891092.html"
  },
  {
    "text": "Man arrested in theft of DHS chief Kristi Noem's purse is in the U.S. illegally, official says  —  Noem's bag was stolen by a masked man Sunday night while she was having dinner with her family in Washington, D.C.  —  The suspect who was arrested Saturday in the theft of Secretary Kristi Noem's purse … ",
    "url": "https://www.nbcnews.com/politics/national-security/man-believed-stolen-dhs-chief-kristi-noems-purse-custody-rcna203176"
  },
  {
    "text": "Wisconsin judge threatens courtroom boycott over Hannah Dugan arrest  —  A Wisconsin judge is threatening not to hold court in protest of federal authorities arresting her fellow judge Hannah Dugan last week.  —  Judge Monica Isham made the announcement in an email to judges across the state on Saturday.",
    "url": "https://www.foxnews.com/politics/wisconsin-judge-threatens-courtroom-boycott-over-hannah-dugan-arrest"
  },
  {
    "text": "Transcript: Russian Foreign Minister Sergey Lavrov on “Face the Nation with Margaret Brennan,” April 27, 2025  —  The following is the full transcript of an interview with Russian Foreign Minister Sergey Lavrov, a portion of which aired on “Face the Nation with Margaret Brennan” on April 27, 2025.",
    "url": "https://www.cbsnews.com/news/sergey-lavrov-russian-foreign-minister-face-the-nation-transcript-04-27-2025/"
  },
  {
    "text": "Wife of US Coast Guard member arrested over expired visa after security check for military housing  —  The wife of an active-duty Coast Guardsman was arrested earlier this week by federal immigration authorities inside the family residential section of the U.S. Naval Air Station at Key West … ",
    "url": "https://apnews.com/article/coast-guard-immigration-arrest-navy-ice-8c59f778f3245b470871e1da96bf90e7"
  },
  {
    "text": "Bessent says he doesn't know if Trump has spoken with China's Xi  —  Treasury secretary says ‘good behavior’ by partners will keep tariffs lower.  —  Treasury Secretary Scott Bessent delivers remarks during the International Finance Institute Global Outlook Forum, April 23, 2025 in Washington",
    "url": "https://abcnews.go.com/Politics/bessent-trump-spoken-chinas-xi/story?id=121201271"
  },
  {
    "text": "Trump's Tariffs Prompt Wave of Lawsuits as States and Businesses Fight Back  —  The cases are the latest test of the president's expansive claims of executive power.  —  Somewhere along a roughly 7,500-mile journey that begins in Shenzhen, China, there are 19 shipments bound for Rick Woldenberg … ",
    "url": "https://www.nytimes.com/2025/04/27/us/politics/trump-tariffs-lawsuits.html"
  },
  {
    "text": "Federal work shaped a Black middle class.  Now it's destabilized by Trump's job cuts  —  Shirley Hopkins built careers for herself and countless other Black workers through a federal government job.  —  While working in the National Institutes of Health's human resources office, she became known as the “recruitment lady.”",
    "url": "https://www.npr.org/2025/04/27/nx-s1-5349442/black-federal-employees-trump-cuts"
  },
  {
    "text": "Trump-aligned club for the ultra rich launches in Washington  —  The launch of “Executive Branch” comes as Trump world looks to remake Washington.  —  A new club is coming to Washington — and you probably can't get in.  —  Donald Trump Jr., megadonor Omeed Malik and several other investors … ",
    "url": "https://www.politico.com/news/2025/04/26/donald-trump-washington-club-00311720"
  },
  {
    "text": "Analyzing the scale of Trump's federal layoffs in his first 100 days  —  Nearly 100 days.  Wide-ranging and chaotic firings across at least 30 agencies.  —  At least 121,000 federal workers have been fired or laid off in the three months since President Donald Trump's second term began … ",
    "url": "https://cnn.com/2025/04/26/politics/federal-layoffs-trump-musk-dg/"
  },
  {
    "text": "GOP Medicaid debate intensifies as Republicans search for cuts  —  House Republicans are under the gun to get specific on how they will offset President Trump's domestic policy agenda, and they will soon need to decide if they will touch the political stove by trying to scale back Medicaid benefits.",
    "url": "https://thehill.com/policy/healthcare/5268561-house-republicans-medicaid-cuts/"
  },
  {
    "text": "Trump and Zelenskyy have ‘very productive’ talk as they attend Pope Francis' funeral  —  Trump and Zelenskyy were both in Rome for Pope Francis' funeral  —  President Donald Trump and Ukrainian President Volodymyr Zelenskyy met face-to-face for the first time since their infamous Oval Office spat in February.",
    "url": "https://www.foxnews.com/world/trump-zelenskyy-have-very-productive-talk-attend-pope-francis-funeral"
  },
  {
    "text": "National Science Foundation eliminates hundreds of grants day after director resigns  —  WASHINGTON - Approximately 700 scientific research projects funded through the National Science Foundation were canceled on April 25 amid scrutiny from President Donald Trump's Department of Government Efficiency.",
    "url": "https://www.usatoday.com/story/news/politics/2025/04/26/national-science-foundation-doge-cuts/83282784007/"
  }
]