[
  {
    "text": "BREAKING: First Trump RICO defendant takes plea agreement  —  X  —  Bail bondsman Scott Hall on Friday became the first defendant in the Fulton County election interference case to take a plea agreement with prosecutors.  —  During an impromptu hearing before Fulton Superior Court Judge Scott McAfee … ",
    "url": "https://www.ajc.com/politics/breaking-first-trump-rico-defendant-takes-plea-agreement/3L3OZWOFIJHWHLJUTQSNHO4VL4/"
  },
  {
    "text": "First co-defendant in Trump Georgia election case pleads guilty  — Scott Hall, one of 18 co-defendants of former President Donald Trump in the Georgia election interference case, pleaded guilty to the charges against him.  — Hall, a bail bondsman, is the first defendant in the case to plead guilty in the case.",
    "url": "https://www.cnbc.com/2023/09/29/first-co-defendant-in-trump-georgia-election-case-pleads-guilty.html"
  },
  {
    "text": "Judge denies Jeffrey Clark's attempt to move Georgia case to federal court  —  A judge denied former Justice Department official Jeffrey Clark's attempt to move his Georgia charges to federal court Friday, dealing another significant blow to the early defense strategy being pursued … ",
    "url": "https://thehill.com/regulation/court-battles/4230570-judge-denies-jeffrey-clarks-attempt-to-move-georgia-case-to-federal-court/"
  },
  {
    "text": "GOP senators say they won't stop Democrats from replacing Feinstein on Judiciary Committee  —  Sen. Dianne Feinstein's death creates a vacancy on the powerful panel that oversees President Biden's judicial nominees.  Without her, Democrats don't have a majority on it.",
    "url": "https://www.nbcnews.com/politics/congress/republicans-replace-dianne-feinstein-judiciary-committee-rcna118151"
  },
  {
    "text": "Feinstein's Death Intensifies Fight for a Coveted California Senate Seat  —  Gov. Gavin Newsom has pledged to pick a Black woman to fill the seat, but has also said he would not choose any of the current Democrats running for Senate.  —  The death of Senator Dianne Feinstein … ",
    "url": "https://www.nytimes.com/2023/09/29/us/politics/dianne-feinstein-replacement-senate.html"
  },
  {
    "text": "House Republicans cancel planned recess as government shutdown appears more likely  — House GOP leaders failed to pass a short-term spending bill with fewer than two days left to fund the federal government and avoid a shutdown.  — GOP Speaker Kevin McCarthy pitched the bill … ",
    "url": "https://www.cnbc.com/2023/09/29/government-shutdown-fear-grows-as-mccarthy-lays-out-partisan-vote-plan.html"
  },
  {
    "text": "Trump floats plan to attend New York trial on business fraud  —  The surprise move would bring Trump face-to-face with a Manhattan judge he has repeatedly derided.  —  Former President Donald Trump plans to show up in person for at least the first week of a civil trial set to open in New York … ",
    "url": "https://www.politico.com/news/2023/09/29/trump-attend-business-fraud-trial-00119198"
  },
  {
    "text": "How Trump Is Complicating McCarthy's Attempts to Avoid a Shutdown  —  The former president has been publicly pushing a shutdown, but his views are shaped by his own handling of the 2018 shutdown.  —  When a group of House Republicans thwarted Speaker Kevin McCarthy's attempt at averting … ",
    "url": "https://www.nytimes.com/2023/09/29/us/politics/trump-shutdown.html"
  },
  {
    "text": "Man tied to suspected shooter in Tupac Shakur's 1996 killing arrested in Las Vegas, AP sources say  —  One of the last living witnesses to the 1996 killing of rapper Tupac Shakur has been arrested in the Las Vegas-area, a long-awaited breakthrough in a case that has frustrated investigators … ",
    "url": "https://apnews.com/article/tupac-shakur-killing-duane-keefe-davis-vegas-3f7050c2a68813d86a96b96fbb3f1d1a"
  },
  {
    "text": "EXCLUSIVE: Robert F. Kennedy Jr. Planning to Announce Independent Run  —  2024 presidential candidate Robert F. Kennedy Jr. plans to announce he will run as an independent on October 9 in Pennsylvania, Mediaite has learned.  —  Kennedy's campaign machine is now planning “attack ads” … ",
    "url": "https://www.mediaite.com/politics/exclusive-robert-f-kennedy-jr-planning-to-announce-independent-run/"
  },
  {
    "text": "UPDATED: IRS consultant charged in massive leak of taxpayer data  —  DOJ said Charles Littlejohn stole the files while working as a government contractor and gave them to a news organization.  —  A consultant for the IRS has been charged with leaking to the news media private tax information … ",
    "url": "https://www.politico.com/news/2023/09/29/irs-leak-charge-00119190"
  },
  {
    "text": "Matt Gaetz is reaching out to Dems about a McCarthy ouster  —  Among the lawmakers he spoke to as he threatens the speaker's gavel: Congressional Progressive Caucus Chair Rep. Pramila Jayapal (D-Wash.).",
    "url": "https://www.politico.com/live-updates/2023/09/29/congress/gaetz-courts-dems-00119085"
  },
  {
    "text": "Flooding in New York  —  A ‘Fire Hose of Moisture’ Inundates New York Streets and Subways  —  Gov. Kathy Hochul declared a state of emergency and urged people to stay off roads during what one official described as “the wettest day we've had since Hurricane Ida.”  —  Friday's rainfall in New York broke records.",
    "url": "https://www.nytimes.com/live/2023/09/29/nyregion/nyc-rain-flash-flooding"
  },
  {
    "text": "On Fox News, GOP impeachment leaders spread false claims with impunity  —  The Republican push to impeach President Biden formally began on Thursday with a hearing held by the House Oversight Committee on Capitol Hill.  By most objective accounts, it was not a huge success for the GOP … ",
    "url": "https://www.washingtonpost.com/politics/2023/09/29/fox-gop-hannity/"
  },
  {
    "text": "Melania Trump ‘quietly’ renegotiated prenup with Donald ahead of potential second presidential term, legal woes: sources  —  Sources tell Page Six that Melania Trump has “quietly” renegotiated her prenuptial agreement with Donald Trump in advance of his potentially serving a second term in the White House.",
    "url": "https://pagesix.com/2023/09/28/melania-trump-quietly-renegotiated-donald-trump-prenup/"
  },
  {
    "text": "Ramaswamy fires back at Mexican president in border spat: ‘New daddy in town’  —  Obrador urged Mexican-Americans not to support the 38-year-old GOP hopeful during a recent press conference  —  FIRST ON FOX — Republican presidential candidate Vivek Ramaswamy is doubling … ",
    "url": "https://www.foxnews.com/politics/ramaswamy-fires-back-mexican-president-border-new-daddy-in-town"
  },
  {
    "text": "The Shame of Collaboration  —  France on Trial: The Case of Marshal Pétain  —  If any of us thought we could do our fellow creatures good by committing or, more probably, condoning an evil act, would we do so?  Would we even recognize the moment when it happened, or accept that it was evil?",
    "url": "https://compactmag.com/article/the-shame-of-collaboration"
  }
]