[
  {
    "text": "The Supreme Court's “Unanimous” Trump Ballot Ruling Is Actually a 5-4 Disaster  —  On Monday, the Supreme Court unanimously reversed a Colorado Supreme Court decision removing Donald Trump from the ballot because of his engagement in an insurrection on Jan. 6.",
    "url": "https://slate.com/news-and-politics/2024/03/supreme-court-trump-colorado-ballot-disaster.html"
  },
  {
    "text": "Lost Track of Trump's Weekend Verbal Gaffes?  Here's a Full List.  —  Donald Trump does not seem OK.  The GOP front-runner was alarmingly loose-lipped during back-to-back campaign rallies in Richmond, Virginia, and Greensboro, North Carolina, on Saturday, during which he admitted … ",
    "url": "https://newrepublic.com/post/179521/donald-trump-weekend-verbal-gaffes"
  },
  {
    "text": "Amy Coney Barrett disagreed with the majority over Trump, but admonished the liberals instead  —  Justice Amy Coney Barrett packed two very different messages into her one-page opinion on Monday as the Supreme Court declared states could not toss former President Donald Trump off the ballot.",
    "url": "https://www.cnn.com/2024/03/04/politics/amy-coney-barrett-supreme-court-trump-analysis"
  },
  {
    "text": "Do Americans Have a ‘Collective Amnesia’ About Donald Trump?  —  It's only been three years, but memories of Mr. Trump's presidency have faded and changed fast.  —  Not all that long ago, many Americans committed hours a day to tracking then-President Donald J. Trump's every move.",
    "url": "https://www.nytimes.com/2024/03/05/us/politics/trump-presidency-election-voters.html"
  },
  {
    "text": "Supreme Court hands Trump victory in Colorado 14th Amendment ballot challenge  —  The Supreme Court unanimously ruled Colorado cannot disqualify former President Trump from the ballot under the 14th Amendment's insurrection ban, a historic decision that preserves Trump's ability to seek a second presidential term.",
    "url": "https://thehill.com/regulation/court-battles/4506318-supreme-court-trump-colorado-14th-amendment-ballot-challenge/"
  },
  {
    "text": "The Supreme Court Just Erased Part of the Constitution  —  Section 3 of the 14th Amendment of the Constitution is essentially a dead letter, at least as it applies to candidates for federal office.  Under the U.S. Supreme Court's ruling that reversed the Colorado Supreme Court's decision striking Donald Trump … ",
    "url": "https://www.nytimes.com/2024/03/04/opinion/supreme-court-trump-colorado-constitution.html"
  },
  {
    "text": "Despite win, Supreme Court strikes blow to Trump's central campaign theme  —  He claims the legal system is corrupt, conflicted and rigged against him.  —  Former President Donald Trump arrives at a campaign rally in Richmond, VA, Mar. 2, 2024.  —  The U.S. Supreme Court's ruling Monday knocking … ",
    "url": "https://abcnews.go.com/Politics/despite-win-supreme-court-strikes-blow-trumps-central/story?id=107779801"
  },
  {
    "text": "Supreme Court unanimously allows Trump to remain on 2024 ballot, finds states ‘have no power’ to enforce insurrection clause — ‘especially’ as to the presidency  —  The U.S. Supreme Court on Monday ruled in a per curiam opinion that Donald Trump will remain on the presidential primary ballot in Colorado … ",
    "url": "https://lawandcrime.com/supreme-court/supreme-court-unanimously-allows-trump-to-remain-on-2024-ballot-finds-states-have-no-power-to-enforce-insurrection-clause-especially-as-to-the-presidency/"
  },
  {
    "text": "Supreme Court temporarily blocks new Texas immigration enforcement law  —  Justice Samuel Alito issued an order that puts the law on hold while the justices determine what next steps to take.  —  WASHINGTON — The Supreme Court on Monday temporarily blocked a new Texas immigration law in response to a Biden administration request.",
    "url": "https://www.nbcnews.com/politics/supreme-court/biden-administration-asks-supreme-court-block-texas-immigration-law-rcna141761"
  },
  {
    "text": "Air Force Employee Indicted for Unlawful Disclosure of Classified National Defense Information  —  For Immediate Release  —  A civilian employee of the U.S. Air Force assigned to the U.S. Strategic Command (USSTRATCOM), at Offutt Air Force Base, was arrested Saturday, March 2 … ",
    "url": "https://www.justice.gov/opa/pr/air-force-employee-indicted-unlawful-disclosure-classified-national-defense-information"
  },
  {
    "text": "Corporate-backed Congressman pushes anti-Semitic attack against journalist  —  Judd Legum, Tesnim Zekeria, and Rebecca Crosby  —  On Sunday, first-term Congressman Mike Collins (R-GA) participated in a vehemently anti-Semitic attack against a Washington Post journalist on X, the social network formerly known as Twitter.",
    "url": "https://popular.info/p/corporate-backed-congressman-pushes"
  },
  {
    "text": "Racial disparities in voter turnout have grown since Supreme Court ruling, study says  —  The turnout gap between white and nonwhite voters in the U.S. is growing fastest in jurisdictions that were stripped of a federal civil rights-era voting protection a decade ago, according to a new study.",
    "url": "https://npr.org/2024/03/05/1235521824/voter-turnout-race-disparities-supreme-court"
  },
  {
    "text": "Conspiracies hinder GOP's efforts in Kansas to cut the time for returning mail ballots  —  A repeating of baseless election conspiracy theories in the Republican-controlled Kansas Legislature appears to have scuttled GOP lawmakers' efforts this year to shorten the time that voters have to return mail ballots",
    "url": "https://abcnews.go.com/Politics/wireStory/conspiracies-hinder-gops-efforts-kansas-cut-time-returning-107799110"
  },
  {
    "text": "Mark Cuban Backs Biden in 2024, Urging More Action on Drug Costs  — Co-founder of Cost Plus Drugs joins White House roundtable  — Cuban backed Haley in primary but supports Biden in general",
    "url": "https://www.bloomberg.com/news/articles/2024-03-04/mark-cuban-backs-biden-over-trump-in-2024-calls-for-drug-cost-reform"
  },
  {
    "text": "Biden to form ‘strike force’ to go after price-gouging  —  President Biden will announce Tuesday the formation of a “strike force” to hold companies accountable for price-gouging practices.  —  The announcement comes days before the State of the Union, where Biden is expected … ",
    "url": "https://thehill.com/business/4507871-biden-strike-force-price-gouging-junk-fees-inflation/"
  },
  {
    "text": "House conservatives fume over deal backed by Johnson  —  Hard-line conservatives are up in arms over the bipartisan government funding deal endorsed by Speaker Mike Johnson (R-La.), but heading into this week's vote to prevent a partial shutdown, they've been forced to acknowledge they're all but powerless to block it.",
    "url": "https://thehill.com/homenews/house/4507677-spending-deal-rankles-frustrated-conservatives/"
  },
  {
    "text": "Commission fines Apple over €1.8 billion over abusive App store rules for music streaming providers  —  The European Commission has fined Apple over €1.8 billion for abusing its dominant position on the market for the distribution of music streaming apps to iPhone and iPad users ('iOS users') through its App Store.",
    "url": "https://ec.europa.eu/commission/presscorner/detail/en/ip_24_1161"
  }
]