[
  {
    "text": "Taunting Trump: Harris campaign's sneer tactics … Now he's the taunted.  — It's another dimension of Vice President Harris' “happy warrior” approach to a campaign that's sure to get uglier this fall. … - But Monday's widespread coverage of the backstage fight over the “muted mics” … ",
    "url": "https://www.axios.com/2024/08/27/taunting-trump-harris-campaigns-sneer-tactics"
  },
  {
    "text": "Crockett: Trump will ‘get his butt handed to him’ if he debates Harris  —  Rep. Jasmine Crockett (D-Texas) on Monday said that former President Trump will have his “butt handed to him” in the Sept. 10 debate against Vice President Harris — if he shows up.  —  Speaking on MSNBC … ",
    "url": "https://thehill.com/homenews/campaign/4849844-jasmine-crockett-trump-debate/"
  },
  {
    "text": "Trump to Put Kennedy and Gabbard on his Transition Team  —  Mr. Kennedy and Ms. Gabbard, who had been progressive Democrats for many years, will join the former president's sons and Senator JD Vance, his running mate, as honorary co-chairs.  —  Donald J. Trump plans to name his former rival … ",
    "url": "https://www.nytimes.com/2024/08/27/us/politics/trump-transition-rfk-tulsi-gabbard.html"
  },
  {
    "text": "Playbook: Inside Harris' big interview decision  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  ONE CEASE-FIRE DOWN — “Oasis reunites for tour and ends a 15-year hiatus during Gallagher brothers' feud,” by AP's Danica Kirka and Maria Sherman in London",
    "url": "https://www.politico.com/newsletters/playbook/2024/08/27/inside-harris-big-interview-decision-00176402"
  },
  {
    "text": "Trump Camp Spends Tens of Thousands to Air Ads In and Around Mar-a-Lago  —  DONALD TRUMP'S CAMPAIGN is set to run cable news ads this week so they can be seen at the ex-president's Mar-a-Lago club and surrounding environs.  —  The South Florida expense is likely to have no impact on the course of the election.",
    "url": "https://www.thebulwark.com/p/trump-camp-buying-tv-ads-mar-a-lago-florida"
  },
  {
    "text": "The Conservatives Who Sold Their Souls for Trump  —  The rage and shame of the anti-anti-Trumpers is getting worse.  —  Today, Rich Lowry, the editor of National Review (the flagship conservative magazine founded by William F. Buckley Jr.), published an article claiming that Donald Trump could win the 2024 election “on character.”",
    "url": "https://www.theatlantic.com/newsletters/archive/2024/08/the-conservatives-who-sold-their-souls-for-trump/679623/?gift=hVZeG3M9DnxL4CekrWGK38nWdgGJEJDaAV_aOdhRDAM&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Harris takes lead over Trump after convention: Poll  —  Video Player is loading.  —  Play Video  —  Unmute  —  Current Time 0:00  —  Loaded: 0%  —  Stream Type LIVE  —  Seek to live, currently behind liveLIVE  —  Playback Rate  —  Chapters  — Chapters  —  Descriptions",
    "url": "https://thehill.com/homenews/campaign/4849880-vice-president-harris-leads-trump/"
  },
  {
    "text": "How Telegram played itself  —  By now you've surely heard that Telegram founder Pavel Durov is in French custody.  On Saturday, the Russia-born billionaire was arrested after landing in a private plane at Le Bourget airport outside Paris.  Durov is now being questioned as part … ",
    "url": "https://www.platformer.news/telegram-durov-arrest-france-explainer/"
  },
  {
    "text": "The bewildering politics of Telegram  —  Here are two big reasons the controversial app just became a global flashpoint.  —  When Telegram founder Pavel Durov was arrested late Saturday at an airport outside Paris, accused of complicity in illegal online behavior and refusing to disclose information … ",
    "url": "https://www.politico.com/news/2024/08/26/telegram-app-politics-00176386"
  },
  {
    "text": "MAGA attacks on Kamala Harris' stepdaughter threaten to backfire on Donald Trump  —  Ella Emhoff has triggered Trump's bitter bro fanbase — but his embrace of the incel vote could come back to haunt  —  MAGA thought leaders can't stop proving that they are weird, just as Vice President Kamala Harris … ",
    "url": "https://www.salon.com/2024/08/27/maga-on-kamala-harris-stepdaughter-threaten-to-backfire-on-donald/"
  },
  {
    "text": "Nebraska Reverts to 19th-Century Voting Restrictions, Clouding Rights for Thousands  —  The Nebraska Voting Rights Restoration Coalition was ready for July 19.  A new state law, Legislative Bill 20, would take effect that day, instantly granting voting rights to some 7,000 people with past felony convictions.",
    "url": "https://boltsmag.org/nebraska-voting-rights-restoration/"
  },
  {
    "text": "How The Hell Was Trump Allowed To Use Arlington National Cemetery As A Campaign Prop?  —  This is an insult to the over 400 Medal of Honor awardees buried there.  —  Well, luckily for the former president*'s campaign, it wasn't raining on Monday, when he grotesquely used Arlington National Cemetery … ",
    "url": "https://www.esquire.com/news-politics/politics/a61975583/trump-arlington-cemetery-visit/"
  },
  {
    "text": "Zuckerberg says Biden admin “pressured” Meta to censor Covid-19 content … - This included censoring “humor and satire,” he added, noting that officials “expressed a lot of frustration with our teams when we didn't agree.”  — “I believe the government pressure was wrong … ",
    "url": "https://www.axios.com/2024/08/27/zuckerberg-biden-administration-meta-censor-covid"
  },
  {
    "text": "RFK may be unable to withdraw his name from ballots in some swing states  —  After spending several months and millions of dollars overcoming onerous requirements to try to get on the ballot in all 50 states, Robert F. Kennedy Jr. is now facing new barriers to get off the ballot in some states.",
    "url": "https://www.npr.org/2024/08/26/g-s1-19634/rfk-jr-withdraw-ballot-battleground-states-michigan-north-carolina"
  },
  {
    "text": "Harris flip-flops on building the border wall … - Harris is embracing a more hawkish immigration policy as Donald Trump's campaign spends tens of millions of dollars attacking her about the border.  — But she still has significant differences with Trump on immigration … ",
    "url": "https://www.axios.com/2024/08/27/kamala-harris-flip-flops-border-wall"
  },
  {
    "text": "Biden impeachment backlash builds within House GOP  —  House Republicans are furious about being forced into a last-minute Biden impeachment vote — which they say could hurt their campaigns, top GOP sources tell Axios. … But just one member can force a vote.",
    "url": "https://www.axios.com/2024/08/27/biden-impeachment-vote-house-republicans"
  },
  {
    "text": "Trump lawyers accuse Fani Willis of playing ‘race card’  —  Former President Trump's legal team wants Fulton County District Attorney Fani Willis (D) taken off his Georgia election interference case, arguing in a new filing that the prosecutor, who is Black, has shown unfair “racial animus” toward Trump.",
    "url": "https://thehill.com/homenews/4849449-trump-legal-fani-willis-racial-animus/"
  },
  {
    "text": "MAGA Is So ‘Desperate’ They've Now Gone After Tim Walz's Dog  —  PAW PATROL  —  MSNBC anchor Jen Psaki noted an “important lesson” for Republicans after the conspiracy was quickly debunked.  —  Republicans spent Monday ginning up a quickly-disproven conspiracy about vice presidential … ",
    "url": "https://www.thedailybeast.com/maga-is-so-desperate-theyve-now-gone-after-tim-walzs-dog"
  },
  {
    "text": "Chinese government hackers penetrate U.S. internet providers to spy  —  Beijing's hacking effort has “dramatically stepped up from where it used to be,” says former top U.S cybersecurity official.  —  Chinese government-backed hackers have penetrated deep into U.S. internet service providers … ",
    "url": "https://www.washingtonpost.com/technology/2024/08/27/chinese-government-hackers-penetrate-us-internet-providers-spy/"
  },
  {
    "text": "The 2024 Trump Campaign Policy Proposals: Budgetary, Economic and Distributional Effects … Key Points  — We project that conventionally estimated tax revenue falls by $5.8 trillion over the next 10 years, producing an equivalent amount of primary deficits.",
    "url": "https://budgetmodel.wharton.upenn.edu/issues/2024/8/26/trump-campaign-policy-proposals-2024"
  },
  {
    "text": "The Lawmaker Leading the Investigation Into the Trump Assassination Attempt Says He Warned Campaign Staff About the Venue  —  Rep. Mike Kelly insisted in an interview that his task force would skirt politics as it seeks a complete answer to what happened in July.  — Copy",
    "url": "https://www.notus.org/trump-2024/trump-assassination-attempt-investigation-mike-kelly"
  },
  {
    "text": "The Supreme Court is sowing confusion over how it will handle election disputes this fall  —  The recent US Supreme Court decision changing voter registration rules in Arizona has voting rights advocates anxious about how the justices will approach emergency election appeals in the runup to the November election.",
    "url": "https://www.cnn.com/2024/08/27/politics/supreme-court-election-purcell-principle/"
  },
  {
    "text": "First look: Latinos warned Project 2025 would hit them hard … - Yet “there's not enough information” about how it “has really, really troubling ideas on issues that really matter to the Latino community,” says Vanessa Cardenas, executive director of America's Voice, an immigrant rights organization.",
    "url": "https://www.axios.com/2024/08/27/latinos-warned-project-2025-impact"
  },
  {
    "text": "Trump, Harris lay out tax plans with trillions of dollars on the line  —  With a huge swath of Trump's 2017 tax cuts set to expire at the end of next year, the presidential candidates are putting down markers on the issue.  —  The next president, be it Kamala Harris or Donald Trump … ",
    "url": "https://www.politico.com/news/2024/08/27/trump-harris-tax-cuts-00175441"
  }
]