[
  {
    "text": "Inside Elon Musk's Plan for DOGE to Slash Government Costs  —  Mr. Musk has turned to Silicon Valley to help recruit executives who will take up unofficial positions across the federal government.  —  An unpaid group of billionaires, tech executives and some disciples of Peter Thiel … ",
    "url": "https://www.nytimes.com/2025/01/12/us/politics/elon-musk-doge-government-trump.html?unlocked_article_code=1.ok4.JXW-.m8CE_yWg6VxQ&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Republican congressman calls for halting of disaster relief to California  —  Warren Davidson of Ohio says aid should be withheld until the state ravaged by wildfires reforms forestry management  —  A Republican US congressman from Ohio has called for federal disaster relief to be withheld … ",
    "url": "https://www.theguardian.com/us-news/2025/jan/11/warren-davidson-republican-disaster-relief-california-wildfires"
  },
  {
    "text": "California Fire Facts  —  LIE - California Cut Firefighting Budgets  — FACT: The number of CalFIRE personnel has nearly doubled since 2019 (from 5,829 to 10,741)  — FACT: CalFIRE's budget has nearly doubled since 2019 ($2 Billion to $3.8 Billion)  —  LIE - These Wildfires are Caused … ",
    "url": "https://gavinnewsom.com/california-fire-facts/"
  },
  {
    "text": "Pardoned by Trump, Manafort Is Back and Looking for Foreign Work  —  The president-elect's 2016 campaign chairman, four years after receiving clemency, is testing the international market with a team of Trump-linked consultants.  —  Constant Méheut and Michael Schwirtz",
    "url": "https://www.nytimes.com/2025/01/12/us/politics/trump-manafort.html?unlocked_article_code=1.ok4.k_bq.-NCsI5kUVYHV&smid=url-share"
  },
  {
    "text": "Trump Calls Officials Handling Los Angeles Wildfires ‘Incompetent’  —  Governor Gavin Newsom and Los Angeles County authorities have invited President-elect Donald J. Trump to tour the devastation, but he has not publicly responded.  —  President-elect Donald J. Trump offered fresh criticism early Sunday … ",
    "url": "https://www.nytimes.com/2025/01/12/us/trump-los-angeles-fire-newsom-bass.html"
  },
  {
    "text": "Vance: Jan. 6 Rioters Who ‘Committed Violence’ Should Not Be Pardoned  —  The vice president-elect left wiggle room, however, saying there is “a little bit of gray area there”  —  Vice president-elect J.D. Vance drew a line delineating which Jan. 6 criminals and defendants will be considered … ",
    "url": "https://www.rollingstone.com/politics/politics-news/vance-jan-6-protesters-pardons-violence-1235232707/"
  },
  {
    "text": "Steve Bannon: ‘I Will Do Anything’ to Keep Elon Musk out of the White House  —  ROME — Former Breitbart News executive chairman Steve Bannon has declared war on Elon Musk, vowing to have the tech billionaire kicked out of the White House by the time Donald Trump is inaugurated.",
    "url": "https://www.breitbart.com/politics/2025/01/11/steve-bannon-i-will-do-anything-keep-elon-musk-out-white-house/"
  },
  {
    "text": "Readout of President Joe Biden's Call with Prime Minister Netanyahu of Israel  —  President Biden spoke today with Prime Minister Netanyahu of Israel.  The two leaders discussed the ongoing negotiations in Doha for a ceasefire and hostage release deal based on the May 27 … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2025/01/12/readout-of-president-joe-bidens-call-with-prime-minister-netanyahu-of-israel-11/"
  },
  {
    "text": "He gave his cats raw milk because he thought it was healthier.  He says it tragically backfired  —  A California man whose two cats died after drinking raw milk recalled for bird flu risk says he meant to keep his beloved pets healthy, but his efforts tragically backfired.",
    "url": "https://apnews.com/article/raw-milk-california-cats-bird-flu-c3f6201216efb2a7e98ca143329a631a"
  },
  {
    "text": "Trump Plans a Cruel Deportation Propaganda Blitz to Scare Away Immigrants  —  The president-elect and his allies plan to take their racist Springfield terror campaign national  —  Donald Trump is coming back into office this month on a vow to initiate the “largest” mass deportation operation … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-deportation-propaganda-blitz-immigrants-1235231889/"
  },
  {
    "text": "I'm a Federal Employee.  This Is What We Need Most in the Trump Era.  —  Federal employees like me have been hearing a lot in recent weeks about how important it is for us to stay in our jobs, despite President-elect Donald Trump's open animosity toward much of the federal work force.",
    "url": "https://www.nytimes.com/2025/01/12/opinion/administrative-deep-state-trump.html"
  },
  {
    "text": "White Christian nationalists are poised to remake America in their image during Trump's second term, author says  —  There's an image that captures the threat posed by the White Christian nationalist movement — and how it could become even more dangerous over the next four years.",
    "url": "https://www.cnn.com/2025/01/12/us/white-christian-nationalism-du-mez-cec/"
  },
  {
    "text": "Fires, Hurricanes, Extreme Weather: The Media Misses the Climate Link  —  Protesting the fossil fuel industry and their political allies can help fix the narrative, and turn disasters into opportunities for climate action … For the destruction of Asheville?  The devastation of Acapulco?",
    "url": "https://www.rollingstone.com/politics/political-commentary/los-angeles-fires-climate-media-1235232654/"
  },
  {
    "text": "Trump's Cabinet picks are set for Senate hearings.  Here's the schedule  —  After the initial crush of personnel announcements for President-elect Donald Trump's incoming administration, now the nominations process officially begins.  —  Senate hearings are scheduled this coming week for several of Trump's picks for the Cabinet.",
    "url": "https://apnews.com/article/trump-cabinet-picks-senate-hearings-schedule-4ed7745df0eae49bad07d02d7b16805b"
  }
]