[
  {
    "text": "Elon Musk's Secret Conversations With Vladimir Putin  —  Regular contacts between world's richest man and America's chief antagonist raise security concerns; topics include geopolitics, business and personal matters  —  Elon Musk, the world's richest man and a linchpin of U.S. space efforts … ",
    "url": "https://www.wsj.com/world/russia/musk-putin-secret-conversations-37e1c187?st=N4UC19&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Phoenix police ID suspect in arson of USPS mailbox that damaged ballots  —  PHOENIX (AZFamily) — A suspect has reportedly been taken into custody in connection with a fire in a United States Postal Service Collection Box in Phoenix overnight, which damaged over a dozen ballots inside.",
    "url": "https://www.azfamily.com/2024/10/24/usps-blue-collection-box-damaged-by-fire-overnight-phoenix/"
  },
  {
    "text": "Musk's super PAC skips daily $1 million swing state giveaway after DOJ warning … - The SpaceX CEO had pledged to give away $1 million every day to registered voters in swing states who sign the super PAC's petition in favor of the First and Second Amendments.",
    "url": "https://www.axios.com/2024/10/24/elon-musk-million-dollar-giveaway-doj-warning"
  },
  {
    "text": "Elon Musk Sure Seems Scared After That DOJ Warning on His Dumb Lottery  —  After receiving a warning from the Justice Department, Elon Musk has stopped his $1 million giveaway to swing voters from his super PAC.  —  The tech CEO pledged Saturday to give away the hefty sum each … ",
    "url": "https://newrepublic.com/post/187519/elon-musk-doj-warning-1-million-lottery"
  },
  {
    "text": "The double standard for Harris and Trump has reached a breaking point  —  One candidate can rant about gibberish while the other has to be perfect.  —  Something is wrong with this split-screen picture.  On one side, former president Donald Trump rants about mass deportations and claims to have stopped … ",
    "url": "https://www.washingtonpost.com/opinions/2024/10/24/harris-trump-cnn-town-hall/"
  },
  {
    "text": "Bluesky Announces Series A to Grow Network of 13M+ Users  —  Bluesky now exceeds 13 million users, the AT Protocol developer ecosystem continues to grow, and we've shipped highly requested features like direct messages and video.  We're excited to announce that we've raised a $15 million Series … ",
    "url": "https://bsky.social/about/blog/10-24-2024-series-a"
  },
  {
    "text": "Exclusive: Democratic lawmakers request probe into Trump son-in-law after Reuters Saudi report  —  The Democratic chair of the U.S. Senate Finance Committee and a prominent Democratic congressman asked the U.S. attorney general on Thursday to appoint a special counsel to investigate whether Jared Kushner … ",
    "url": "https://www.reuters.com/world/us/democratic-lawmakers-request-probe-into-trump-son-in-law-after-reuters-saudi-2024-10-24/"
  },
  {
    "text": "Trump Flirts With the Ultimate Tax Cut: No Income Taxes at All  —  The former president has repeatedly praised a period in American history when there was no income tax, and the country relied on tariffs to fund the government.  —  Former President Donald J. Trump has spent … ",
    "url": "https://www.nytimes.com/2024/10/24/us/politics/donald-trump-tax-policy.html?unlocked_article_code=1.Uk4.SGjJ.N1oLDWOGe53P&smid=url-share"
  },
  {
    "text": "Washington Post staffers suspect owner Jeff Bezos holding up Kamala Harris endorsement: report  —  Washington Post staffers are growing restless over the left-leaning paper's silence on endorsing Vice President Kamala Harris for president — with many suspecting that owner Jeff Bezos is behind the delay, according to a report.",
    "url": "https://nypost.com/2024/10/24/media/washington-post-staffers-suspect-jeff-bezos-holding-up-harris-endorsement/"
  },
  {
    "text": "Montana Senate candidate says he was ‘medically discharged’ from the Navy.  Records say otherwise.  —  The disclosure comes as Tim Sheehy was already facing scrutiny for questionable claims he has made about his military career.  —  Tim Sheehy, a former Navy SEAL running for the Senate in Montana … ",
    "url": "https://www.nbcnews.com/politics/montana-senate-candidate-says-was-medically-discharged-navy-records-sa-rcna176726"
  },
  {
    "text": "CDC recommends second COVID vaccine dose for those 65 and older  —  Immunocompromised adults or those who are older than 65 should get a second dose of the latest COVID-19 vaccine, the Centers for Disease Control and Prevention (CDC) officially recommended.  —  The CDC on Wednesday adopted … ",
    "url": "https://thehill.com/policy/healthcare/4952052-cdc-recommends-covid-vaccine-second-dose-65-and-older-immunocompromised/"
  },
  {
    "text": "Trump ignored disaster aid request from political rival … In early September 2020, wildfires tore through eastern Washington state, obliterating tens of millions of dollars of property, displacing hundreds of rural residents and killing a 1-year-old boy.  —  But then-President Donald Trump refused … ",
    "url": "https://www.eenews.net/articles/trump-ignored-disaster-aid-request-from-political-rival/"
  },
  {
    "text": "The Election Is Happening Too Soon  —  I had hoped this election would be a moment of national renewal.  I had hoped that the Democrats could decisively defeat MAGA populism and send us down a new national path.  —  That's clearly not going to happen.  No matter who wins this election … ",
    "url": "https://www.nytimes.com/2024/10/24/opinion/polarization-harris-change.html"
  },
  {
    "text": "County judge strikes down Ohio abortion ban, citing voter-approved reproductive rights amendment  —  The most far-reaching of Ohio's laws restricting abortion was struck down on Thursday by a county judge who said last year's voter-approved amendment enshrining reproductive rights renders the so-called heartbeat law unconstitutional.",
    "url": "https://apnews.com/article/ohio-abortion-ban-ruling-e83ad0f1af11ded06d73d900bb240a04"
  },
  {
    "text": "Bruce Springsteen Performs At Kamala Harris Rally, Tells Crowd That Donald Trump Is Running To Be “An American Tyrant” … “He does not understand this country, its history, or what it means to be deeply American,” Springsteen told the crowd at James R. Hallford Stadium near Atlanta.",
    "url": "https://deadline.com/2024/10/kamala-harris-bruce-springsteen-rally-georgia-1236157889/"
  },
  {
    "text": "Trump alumni warn he could deploy troops against Americans  —  “It's not the American way,” said his former chief of staff, John Kelly.  —  As protests swept the nation after the murder of George Floyd and some rioting broke out in Washington, President Donald Trump demanded in a White House meeting … ",
    "url": "https://www.washingtonpost.com/elections/2024/10/24/trump-military-president-election/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI5NzQyNDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzMxMTI4Mzk5LCJpYXQiOjE3Mjk3NDI0MDAsImp0aSI6IjVmYjAwZjNjLTNlMTItNDAxOC1iMDMxLTk2NjNlMjliOWM0YSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9lbGVjdGlvbnMvMjAyNC8xMC8yNC90cnVtcC1taWxpdGFyeS1wcmVzaWRlbnQtZWxlY3Rpb24vIn0.qKmChonLu_I7IXG2nelOgl0gXolchXVTHqRJ3ARvlWc"
  },
  {
    "text": "New poll: Trump is getting record levels of support among young Black and Latino men  —  A new poll that includes large oversamples of young voters of color shows Donald Trump has massively increased his support among groups that he previously performed poorly with in 2020.",
    "url": "https://www.politico.com/live-updates/2024/10/23/2024-elections-live-coverage-updates-analysis/genforward-poll-black-latino-voters-00185161"
  },
  {
    "text": "Trump Hasn't Spent A Dime Of His Own Money On His 2024 Campaign  —  The campaign and political committees of billionaire presidential candidate Donald Trump have paid his businesses millions for air travel, lodging, catering and more.  —  It's been more than 30 years since the Trump Shuttle folded … ",
    "url": "https://www.forbes.com/sites/zacheverson/2024/10/23/donald-trump-campaign-funds-business-trump-organization/"
  },
  {
    "text": "GOP Rep. David Schweikert Said Women Who Get Abortions ‘Hate That Baby’ And America  —  “They hate that baby because it symbolizes a responsibility,” the Arizona Republican said in a newly unearthed 2022 interview.  —  LOADING  —  WASHINGTON — Rep. David Schweikert (R-Ariz.) … ",
    "url": "https://www.huffpost.com/entry/gop-david-schweikert-abortion-arizona_n_67194bd5e4b0ede6b2bff075"
  },
  {
    "text": "‘Shameful’: Naval Academy cancels authoritarianism lecture After ‘MAGA pressure’  —  The U.S. Naval Academy is under fire after it invited — then uninvited — a distinguished expert on authoritarianism and fascism to give a lecture.  —  Dr. Ruth Ben-Ghiat is a professor of history … ",
    "url": "https://www.alternet.org/authoritarianism-maga-pressure/"
  },
  {
    "text": "House GOP committee that oversees elections hired two former Trump officials involved in 2020 fake elector scheme  —  House Republicans on the committee with broad jurisdiction over national elections have hired at least two former Donald Trump campaign officials involved in the 2020 fake electors scheme … ",
    "url": "https://www.cnn.com/2024/10/24/politics/house-gop-committee-trump-fake-elector-scheme"
  },
  {
    "text": "Donald Trump's McDonald's Shift Went Down Best With Gen Z  —  Donald Trump's shift at a Pennsylvania  —  was most popular with Gen Z, a new poll shows.  —  The former President, known for his love of fast food,  —  when he learned how to make fries at a branch in Feasterville-Trevose in Bucks County last weekend.",
    "url": "https://www.newsweek.com/donald-trump-mcdonald-shift-gen-z-1974347"
  },
  {
    "text": "A fresh push to hobble Russia's war economy  —  With help from Joe Gould and Daniel Lippman  —  The U.S. and its allies are on a renewed push to cut Russia's economy off from the world to pressure it to end the Ukraine war, but not everyone is convinced sanctions and other economic restrictions … ",
    "url": "https://www.politico.com/newsletters/national-security-daily/2024/10/24/a-fresh-push-to-hobble-russias-war-economy-00183727"
  },
  {
    "text": "Stevie Nicks: ‘I Believe in the Church of Stevie’  —  In a nearly four-hour interview, the legendary singer goes deep on longevity, Kamala Harris, why Fleetwood Mac are finished and much more  —  E  —  VERY SECOND FEELS like an eternity when you're hovering four inches from Stevie Nicks, noodling around with her blouse.",
    "url": "https://www.rollingstone.com/music/music-features/stevie-nicks-fleetwood-mac-kamala-harris-new-music-1235140437/"
  },
  {
    "text": "Trump says the U.S. is ‘like a garbage can for the world’ as he dials up immigration rhetoric  —  The former president has increasingly turned his focus to the border and undocumented immigrants in the closing stretch of the election.  —  Former President Donald Trump said Thursday the United States is … ",
    "url": "https://www.nbcnews.com/politics/2024-election/trump-us-garbage-can-world-immigration-rhetoric-rcna177166"
  },
  {
    "text": "Mike Lee calls for no ‘sabotage’ of GOP candidates amid McConnell book remarks  —  Sen. Mike Lee is calling on candidates running for Senate GOP leadership to weigh in on Mitch McConnell's recent remarks against Donald Trump, which included him referring to the former president as a “sleazeball … ",
    "url": "https://www.politico.com/live-updates/2024/10/24/2024-elections-live-coverage-updates-analysis/lee-vs-mcconnell-00185353"
  },
  {
    "text": "Federal appeals court upholds New York's ban on guns in sensitive places  —  A recent Supreme Court decision doesn't mean New York can't enforce laws banning firearms from “sensitive” places such as public transportation, hospitals and schools, a federal appeals court said Thursday, repeating findings it made a year ago.",
    "url": "https://apnews.com/article/new-york-gun-ban-sensitive-locations-423f57af32c43761b9c5b0fa8cfa0348"
  },
  {
    "text": "Trump's former lawyer worries some Christians will abstain from voting  —  We're chatting with lawmakers, former elected officials and political operatives every day between now and Nov. 5 to get a better sense of where people's heads are at — and what their candidate needs to be doing better.",
    "url": "https://www.politico.com/live-updates/2024/10/24/2024-elections-live-coverage-updates-analysis/jenna-ellis-donald-trump-00185153"
  },
  {
    "text": "EXCLUSIVE: Republican State Sen. Rob Cowles: ‘I plan on voting for Harris’ … State Sen. Robert Cowles, a Republican from Green Bay, says he is voting for Kamala Harris in the upcoming presidential election.  —  “I plan on voting for Harris,” he said.  —  Cowles said he has been concerned … ",
    "url": "https://civicmedia.us/news/2024/10/24/exclusive-republican-state-senator-rob-cowles-i-plan-on-voting-for-harris"
  },
  {
    "text": "Truth Social's Bank Spent Funds on Prostitutes, Drugs and Strippers  —  BANKERS BEHAVING BADLY  —  The partners of the firm that backed Donald Trump's IPO this spring also allegedly lost millions of dollars gambling, according to two lawsuits.  —  Partners at the Wall Street firm backing … ",
    "url": "https://www.thedailybeast.com/partners-at-ef-hutton-the-firm-backing-truth-social-spent-money-on-prostitutes-drugs-strippers-and-gambling-lawsuits-say/"
  },
  {
    "text": "Should Kamala Harris embrace Lina Khan?  Democrats are split — and some worry it will cost her.  —  The Democratic nominee isn't campaigning with the high-profile trustbuster, or defending Khan from attacks.  —  From a tight Senate race in Arizona to congressional contests in Texas and Illinois … ",
    "url": "https://www.politico.com/news/2024/10/24/kamala-harris-lina-khan-00185345"
  }
]