[
  {
    "text": "Trump's Capitol Hill allies fume at his unfocused candidacy … - “Kamala Harris and Tim Walz are the most left-wing ticket in history,” National Republican Congressional Committee Chair Richard Hudson (R-N.C.) said on the call, according to a source familiar with his comments.",
    "url": "https://www.axios.com/2024/08/16/house-republicans-trump-message-focus-harris"
  },
  {
    "text": "Trump Pulls in Tulsi Gabbard for Debate Prep  —  Tulsi Gabbard, the former Democrat who has rebranded herself as a celebrity among Donald J. Trump's supporters, once eviscerated Kamala Harris on a debate stage.  —  Former President Donald J. Trump has begun preparing for his debate … ",
    "url": "https://www.nytimes.com/2024/08/16/us/politics/trump-debate-tulsi-gabbard.html?unlocked_article_code=1.DU4.zW-3.EUNARKJDeSbt&smid=nytcore-ios-share&referringSource=articleShare&sgrp=c-cb"
  },
  {
    "text": "Playbook: Could the Harris campaign become the Harris movement?  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  BIDEN UNPLUGGED — Is it just us, or does non-candidate JOE BIDEN seem a little more liberated these days?",
    "url": "https://www.politico.com/newsletters/playbook/2024/08/16/could-the-harris-campaign-become-the-harris-movement-00174341"
  },
  {
    "text": "The times demand serious economic ideas.  Harris supplies gimmicks.  —  ‘Price gouging’ is not causing inflation.  So why is the vice president promising to stamp it out?  —  Vice President Kamala Harris's speech Friday was an opportunity to get specific with voters about how a Harris presidency … ",
    "url": "https://www.washingtonpost.com/opinions/2024/08/16/harris-economy-plan-gimmicks/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzIzNzgwODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI1MTYzMTk5LCJpYXQiOjE3MjM3ODA4MDAsImp0aSI6IjljYjYwZGIyLWQ0MjgtNDU1MC04MTBlLTM5YzM0Mzk0MzQ2ZCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9vcGluaW9ucy8yMDI0LzA4LzE2L2hhcnJpcy1lY29ub215LXBsYW4tZ2ltbWlja3MvIn0.bWh6D-1MNXD5zbyMIvYzINb8bsVgYj2fXfppjv0ictA&itid=gfta"
  },
  {
    "text": "Trump belittles Medal of Honor award in campaign speech  —  Former President Donald Trump on Thursday said the Presidential Medal of Freedom is a “better” award than the Defense Department's Medal of Honor because service members have to sacrifice their lives or health to receive the military's highest honor … ",
    "url": "https://www.militarytimes.com/news/pentagon-congress/2024/08/16/trump-belittles-medal-of-honor-award-in-campaign-speech/"
  },
  {
    "text": "Trump draws a parallel between a campaign donor and war heroes  —  Trump told an audience on Thursday that the Presidential Medal of Freedom was “better” than the Medal of Honor, since honored soldiers were often wounded.  —  The day before Halloween 2019, President Donald Trump welcomed Master … ",
    "url": "https://www.washingtonpost.com/politics/2024/08/16/trump-draws-parallel-between-campaign-donor-war-heroes/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzIzNzgwODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI1MTYzMTk5LCJpYXQiOjE3MjM3ODA4MDAsImp0aSI6ImQyZTE3ZTNhLWNiOTctNDEyMC05OTk0LTc3MTk1NWQ3ZDg5OCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzA4LzE2L3RydW1wLWRyYXdzLXBhcmFsbGVsLWJldHdlZW4tY2FtcGFpZ24tZG9ub3Itd2FyLWhlcm9lcy8ifQ.eqNEhq5ZqTS-EFuJKXDwMGd6rdnfBoEVcy9kIF-aYYw&itid=gfta"
  },
  {
    "text": "Gov. Tim Walz shares his ‘white guy’ taco recipe with VP Kamala Harris  —  (FOX 9) - Minnesota Gov. Tim Walz explains his “white guy tacos” to Vice President Kamala Harris in a new video on social media.  The first step of his recipe: unseasoned ground beef.  —  What's in the recipe?",
    "url": "https://www.fox9.com/news/tim-walz-white-guy-taco-recipe"
  },
  {
    "text": "House GOP sets its sights on Walz  —  The House Oversight Committee is opening an investigation into Democrats' vice presidential pick.  —  House Republicans are setting their sights on Minnesota Gov. Tim Walz, Democrats' vice presidential candidate — the latest indication that they are using … ",
    "url": "https://www.politico.com/news/2024/08/16/tim-walz-james-comer-china-00174403"
  },
  {
    "text": "Menendez, Convicted of Taking Bribes, Ends Race for Re-election  —  Senator Robert Menendez of New Jersey instructed state officials on Friday to remove his name from the Nov. 5 ballot.  —  Senator Robert Menendez, a famously pugnacious Democrat whose five-decade political career came … ",
    "url": "https://www.nytimes.com/2024/08/16/nyregion/nj-menendez-suspends-senate-race.html"
  },
  {
    "text": "This Georgia Republican Defied Trump.  Now He's Fighting a Defamation Suit.  —  The secretary of state, Brad Raffensperger, has spent $500,000 defending himself in court.  He says the plaintiff will only settle if he effectively endorses a debunked conspiracy theory about the 2020 election.",
    "url": "https://www.nytimes.com/2024/08/16/us/politics/brad-raffensperger-2020-georgia-election.html?unlocked_article_code=1.DU4.NCd6.Ue0uwKEjw-nJ&smid=url-share"
  },
  {
    "text": "Watch Undercover Video: Project 2025 Co-Author Lays Out “Radical Agenda” for Next Trump Term  —  As Donald Trump tries to distance his campaign from Project 2025, those behind the right-wing policy blueprint to remake the U.S. government continue to brag in private about their close ties … ",
    "url": "https://www.democracynow.org/2024/8/16/project_2025_undercover_video"
  },
  {
    "text": "Supreme Court refuses DOJ request to partially reinstate new Title IX rule  —  The Supreme Court in a 5-4 decision denied the Biden administration's emergency request to partially reinstate its new Title IX rule.  —  The sweeping changes extend the sex-discrimination law's protections … ",
    "url": "https://thehill.com/regulation/court-battles/4832117-supreme-court-denies-title-ix-doj-request/"
  },
  {
    "text": "JD Vance's plane makes emergency landing after door malfunction  —  The plane carrying Vance, a Boeing 737, declared an emergency shortly after it had left the airport in Milwaukee and returned for repairs.  —  The charter plane carrying former president Donald Trump's running mate Sen. JD Vance … ",
    "url": "https://www.washingtonpost.com/politics/2024/08/16/jd-vance-airplane-boeing/"
  },
  {
    "text": "Former congressman George Santos expected to plead guilty to charges related to campaign fraud Monday  —  Former New York Rep. George Santos is expected to plead guilty Monday to federal charges relating to fraudulent activity during his 2022 midterm campaign, according to multiple sources familiar with the deal.",
    "url": "https://www.cnn.com/2024/08/16/politics/santos-expected-plead-guilty-campaign-fraud"
  },
  {
    "text": "Pennsylvania 2024 Poll: Trump 49%, Harris 48%  —  Home Polls Pennsylvania 2024 Poll: Trump 49%, Harris 48%  —  A new Emerson College Polling/RealClearPennsylvania survey finds 49% of voters support former President Donald Trump, and 48% support Vice President Kamala Harris for president in the Keystone state.",
    "url": "https://emersoncollegepolling.com/pennsylvania-2024-poll-trump-49-harris-48/"
  },
  {
    "text": "READ: Former President Donald Trump's financial disclosure  —  Former President Donald Trump's latest financial reports were released Thursday, offering the first look in more than a year at the Republican presidential nominee's finances, business holdings and liabilities.",
    "url": "https://www.cnn.com/2024/08/15/politics/read-donald-trump-financial-disclosure-forms/"
  },
  {
    "text": "Former aide sues Texas Rep. Troy Nehls, alleging he was forced out because he's gay  —  Alex Chadwell, a former employee in Nehls' congressional office, said he was ostracized and sidelined after Nehls found out his sexual orientation.  Nehls denies the claims.",
    "url": "https://www.politico.com/news/2024/08/16/former-aide-sues-texas-rep-troy-nehls-alleging-he-was-forced-out-because-hes-gay-00174458"
  },
  {
    "text": "He found a Project 2025 duffel bag.  Then police showed up at his house.  —  Journalist and author Malcolm Harris says he found the bag left on a ledge in Capitol Hill.  It turned out to be more trouble than it was worth.  —  Author Malcolm Harris opened the door of his Capitol Hill home … ",
    "url": "https://www.washingtonpost.com/style/media/2024/08/16/project-2025-dc-duffel-bag/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzIzNzgwODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI1MTYzMTk5LCJpYXQiOjE3MjM3ODA4MDAsImp0aSI6ImE2ZDRkMGFiLTljZDUtNGY5YS04YWM4LWU5NmZhY2NiZjZjOCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9zdHlsZS9tZWRpYS8yMDI0LzA4LzE2L3Byb2plY3QtMjAyNS1kYy1kdWZmZWwtYmFnLyJ9._K2-c4_rSO58WvJztzhRQW8_p_MRzVbJJyEiFP9ojx4&itid=gfta"
  },
  {
    "text": "Kamala Harris wants to stop Wall Street's homebuying spree  —  Institutional investors could own 40% of single-family rental homes by 2030, according to one estimate  —  Vice President Kamala Harris unveiled plans to tackle the rise in Wall Street homeownership as part of a slate of economic proposals announced Friday.",
    "url": "https://qz.com/harris-campaign-housing-rental-costs-real-estate-1851624062"
  },
  {
    "text": "Nancy Mace Keeps Mispronouncing ‘Kamala,’ Sending CNN Panel Spinning  —  SORRY NOT SORRY  —  The spotlight-hungry congresswoman insisted she wasn't doing it on purpose, even after several panelists corrected her.  —  South Carolina Rep. Nancy Mace insisted on mispronouncing Vice President Kamala Harris … ",
    "url": "https://www.thedailybeast.com/nancy-mace-keeps-mispronouncing-kamala-sending-cnn-panel-spinning"
  }
]