[
  {
    "text": "Russia's Staggering Success In Duping Willing Republicans And Right Wing Media  —  A lot of things happened.  Here are some of the things.  This is TPM's Morning Memo.  —  The Plot Thickens  —  The former FBI informant charged with fabricating the Burisma bribery story about President Biden … ",
    "url": "https://morningmemo.talkingpointsmemo.com/p/russias-staggering-success-in-duping"
  },
  {
    "text": "10 Republicans who treated the Biden bribery claim like gospel  —  When we learned last week that the Justice Department had indicted the informant behind the severest claims against President Biden for allegedly lying about those claims, the House GOP impeachment leader, Rep. James Comer (Ky.), downplayed the news.",
    "url": "https://www.washingtonpost.com/politics/2024/02/21/10-republicans-who-treated-biden-bribery-claim-like-gospel/"
  },
  {
    "text": "Fox News co-host ‘surprised’ by GOP's ‘threshold for humiliation’ in Biden probe  —  Fox News co-host Jessica Tarlov mocked House Republicans on Wednesday for their pursuit of impeachment charges against President Biden.  —  “This is the path that they've chosen to take … ",
    "url": "https://thehill.com/homenews/media/4481267-fox-news-host-surprised-gop-threshold-humiliation-biden-probe/"
  },
  {
    "text": "Jim Jordan Is in Deep Trouble  —  Ohio congressman Jim Jordan could face major repercussions over the Republican attempt to impeach Joe Biden after a former FBI informant charged with making false bribery claims against the president was accused of using Russian intelligence, legal experts suggest.",
    "url": "https://www.newsweek.com/jim-jordan-joe-biden-impeachment-bribery-russia-1871889"
  },
  {
    "text": "It's Even Worse Than We Imagined  —  Just when you thought it couldn't be worse, here we are.  —  As I reported last week, a star witness for the GOP-led impeachment inquiry, someone Rep. Jim Jordan (R-OH) had called a “highly credible human source,” was indicted for making false statements and reports.",
    "url": "https://statuskuo.substack.com/p/its-even-worse-than-we-imagined"
  },
  {
    "text": "Nikki Haley sides with Alabama Supreme Court on IVF ruling: ‘Embryos, to me, are babies’  —  The Alabama court's recent ruling raised concerns among doctors and patients worried that classifying embryos as children could restrict in-vitro fertilization.  —  NORTH AUGUSTA, S.C. … ",
    "url": "https://www.nbcnews.com/politics/2024-election/nikki-haley-sides-alabama-supreme-court-ivf-ruling-embryos-are-babies-rcna139819"
  },
  {
    "text": "Fearing prosecution, UAB pauses in vitro fertilization after Alabama embryo court ruling  —  The University of Alabama at Birmingham health system has paused in vitro fertilization procedures following an Alabama Supreme Court decision due to fear of criminal prosecution and lawsuits, a spokeswoman said.",
    "url": "https://www.al.com/news/2024/02/uab-pauses-in-vitro-fertilization-due-to-fear-of-prosecution-officials-say.html"
  },
  {
    "text": "Rep. Good was forced to leave a Trump store opening that McGuire was headlining  —  Rep. Bob Good, R-VA05, was forced to leave an event in his district over the weekend where Republicans gathered to support Donald Trump.  Good supporters believe the event was doubling as a campaign event … ",
    "url": "https://www.virginiascope.com/rep-good-was-forced-to-leave-a-trump-store-opening-that-mcguire-was-headlining/"
  },
  {
    "text": "Mike Johnson invoked God in a GOP presentation on keeping the majority.  It didn't land well.  —  The speaker delivered a presentation that, while ostensibly about holding the majority this fall, took a notably moral turn, according to two people in the room.",
    "url": "https://www.politico.com/live-updates/2024/02/21/congress/johnsons-sermon-to-gop-retreagt-00142436"
  },
  {
    "text": "FACT SHEET: President Biden Cancels Student Debt for more than 150,000 Student Loan Borrowers Ahead of Schedule  —  Today, President Biden announced the approval of $1.2 billion in student debt cancellation for almost 153,000 borrowers currently enrolled in the Saving on a Valuable Education (SAVE) repayment plan.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/02/21/fact-sheet-president-biden-cancels-student-debt-for-more-than-150000-student-loan-borrowers-ahead-of-schedule/"
  },
  {
    "text": "U.S. Attorney Announces Nuclear Materials Trafficking Charges Against Japanese Yakuza Leader  —  For Immediate Release  —  U.S. Attorney's Office, Southern District of New York  —  Takeshi Ebisawa of Japan, Leader Within the Yakuza Transnational Organized Crime Syndicate … ",
    "url": "https://www.justice.gov/usao-sdny/pr/us-attorney-announces-nuclear-materials-trafficking-charges-against-japanese-yakuza"
  },
  {
    "text": "The Great Forgotten Betrayal of the Trump Years  —  Donald Trump's weird relationship with Vladimir Putin and Russia is back in the news.  But something big is missing.  —  After his remarks earlier this month encouraging the Russian leader/war criminal to invade NATO countries … ",
    "url": "https://link.motherjones.com/public/34415116"
  },
  {
    "text": "Trump and allies plotting militarized mass deportations, detention camps  —  As president, Trump sought to use military planes and bases for deportation.  Now, he and his allies are talking about a new effort that current and former officials warn could be impractical and dangerous.",
    "url": "https://www.washingtonpost.com/politics/2024/02/20/trump-mass-deportations-immigration/"
  },
  {
    "text": "Okla. nonbinary teen died after school fight amid reported bullying  —  What is known with certainty in Owasso, Okla., is that a 16-year-old is dead.  —  Nex Benedict collapsed the day after an altercation in a girls' bathroom at the public high school they attended, a school where relatives … ",
    "url": "https://www.washingtonpost.com/nation/2024/02/21/oklahoma-teen-lgbtq-nex-benedict-died/"
  },
  {
    "text": "Elon Musk quietly visited the Biden White House in September  —  Musk and President Joe Biden, who didn't meet during the visit, have had a frosty relationship driven by differing views on labor unions and more.  —  Tech billionaire Elon Musk quietly visited the White House in September … ",
    "url": "https://www.nbcnews.com/tech/tech-news/elon-musk-quietly-visited-biden-white-house-september-rcna139836"
  },
  {
    "text": "Amy Brown, wife of GOP Senate candidate Sam Brown, opens up about her abortion for the first time publicly  —  Sam Brown is running for Senate in Nevada, and he told NBC News that his wife's experience has helped show him politicians have to “lead with compassion.”",
    "url": "https://www.nbcnews.com/politics/2024-election/sam-amy-brown-abortion-nevada-gop-republican-senate-race-rcna136826?_branch_match_id=1279445062030396012"
  },
  {
    "text": "2024 Election: Biden Holds On To Slight Lead Over Trump, Quinnipiac University National Poll Finds; Trump Gets Higher Marks On Age, Mental & Physical Fitness; Biden Does Better On Ethics, Empathy & Temperament  —  mail_outline  —  In a hypothetical 2024 general election presidential matchup … ",
    "url": "https://poll.qu.edu/poll-release?releaseid=3890"
  },
  {
    "text": "Teamsters give GOP first major donation in years with $45,000 to RNC  —  The Teamsters' political committee has given $45,000 to the Republican National Committee, according to federal records, a significant departure for a powerful organized labor group that has more recently supported Democrats … ",
    "url": "https://www.washingtonpost.com/business/2024/02/21/teamsters-trump-biden-union/"
  },
  {
    "text": "Consumers are tired of price increases.  Big brands are paying attention.  —  Even Walmart lowered the price of its French bread back to $1, but consumers shouldn't expect broad-based cuts across the economy.  —  Until recently, Brooke Benson considered herself a Panera Bread loyalist.",
    "url": "https://www.nbcnews.com/business/consumer/consumers-are-tired-price-increases-brands-are-paying-attention-rcna138892"
  },
  {
    "text": "How the Kremlin weaponized Russian history — and has used it to justify the war in Ukraine  —  Earlier this month, when Tucker Carlson asked Vladimir Putin about his reasons for invading Ukraine two years ago, Putin gave him a lecture on Russian history.  The 71-year-old Russian leader spent … ",
    "url": "https://apnews.com/article/russia-ukraine-war-history-putin-propaganda-80cb70fff9820357eddb83170695bdbb"
  },
  {
    "text": "Florida School Rocked by More Cases of Measles as Parents Skip Vax  —  Eleven other states have reported measles cases this year, but no area has been hit as hard as South Florida.  —  An elementary school in Florida has been hit with a measles outbreak that's made six students sick … ",
    "url": "https://www.thedailybeast.com/florida-elementary-school-rocked-by-more-cases-of-measles"
  },
  {
    "text": "Sidney Powell and Other Trump-Aligned Lawyers Will Face Legal Penalties  —  The Supreme Court declined to take up an appeal by a group of lawyers who challenged the 2020 election results in Michigan.  —  Sidney Powell, L. Lin Wood and several other lawyers who advanced former President … ",
    "url": "https://www.nytimes.com/2024/02/21/us/politics/trump-sidney-powell-kraken.html"
  },
  {
    "text": "The Antisemitic Cartoon  —  Dear Members of the Harvard Community,  —  A few groups purporting to speak on behalf of Harvard affiliates recently circulated a flagrantly antisemitic cartoon in a post on social media channels.  The cartoon, included in a longer post, depicted what appeared … ",
    "url": "https://www.harvard.edu/president/news/2024/the-antisemitic-cartoon/"
  },
  {
    "text": "Mar-a-Lago judge denies Trump's request to file briefs together in documents case, orders slower, one-by-one pace instead  —  The federal judge overseeing Donald Trump's indictment for allegedly illegally retaining classified documents at his Mar-a-Lago estate in Florida has denied a request … ",
    "url": "https://lawandcrime.com/high-profile/mar-a-lago-judge-denies-trumps-request-to-file-briefs-together-in-documents-case-orders-slower-one-by-one-pace-instead/"
  },
  {
    "text": "Donald Trump may not believe in God, but he still plans to turn America into a Christian theocracy  —  Like any cult leader, Trump's goal is to get power — and the religious right is ready to take advantage  —  If there were only some way to prove it, I would happily bet everything I own that Donald Trump does not believe in God.",
    "url": "https://www.salon.com/2024/02/21/donald-may-not-believe-in-god-but-he-still-plans-to-turn-america-into-a-christian-theocracy/"
  },
  {
    "text": "Scoop: NRSC pushes Senate GOP candidates on Mayorkas impeachment … - Schumer has not committed to holding a full trial for Mayorkas.  — Demanding a trial for Biden's border chief would “hold Senate Democrats' feet to the fire for their refusal to demand accountability for the invasion … ",
    "url": "https://www.axios.com/2024/02/21/nrsc-senate-republicans-mayorkas-impeachment"
  },
  {
    "text": "Ukraine, IMF Near $900 Million Payment Amid Stalled US Aid  — Deal expected as soon as Thursday as war anniversary nears  — Move follows talks over backup plan if US can't deliver aid  —  Ukraine is near an agreement with the International Monetary Fund to get the next $900 million disbursement … ",
    "url": "https://www.bloomberg.com/news/articles/2024-02-21/ukraine-imf-near-900-million-payment-amid-stalled-us-aid"
  }
]