[
  {
    "text": "AOC Rips “Tyrannical and Un-American” Arrest of Mahmoud Khalil  —  Representative Alexandria Ocasio-Cortez condemned ICE's detainment of Mahmoud Khalil, calling it a “tyrannical” move.  —  “Violating rule of law, actually,” AOC wrote on Monday, responding to an assertion from Katie Miller … ",
    "url": "https://newrepublic.com/post/192558/aoc-ocasio-cortez-arrest-palestinian-activist-mahmoud-khalil"
  },
  {
    "text": "Judge halts deportation of Palestinian activist whose arrest was celebrated by Trump  —  Mahmoud Khalil is a legal U.S. resident who had a prominent role in Columbia University protests.  —  A federal judge has halted the deportation of a Columbia University graduate student who was detained … ",
    "url": "https://www.politico.com/news/2025/03/10/trump-palestinian-activist-columbia-00221550"
  },
  {
    "text": "Judge blocks removal of Palestinian activist who was detained at Columbia University  —  Mahmoud Khalil is being held at a Louisiana detention center, his attorney said.  —  Student negotiator Mahmoud Khalil is on the Columbia University campus in New York at a pro-Palestinian protest encampment on April 29, 2024.",
    "url": "https://abcnews.go.com/US/ice-arrests-palestinian-activist-green-card-columbia-university/story?id=119616144"
  },
  {
    "text": "Trump Administration Seeks to Expel a Green-Card Holder Over Student Protests  —  Immigration officers arrested a Columbia University graduate for helping lead campus protests against Israel's treatment of Palestinians.  President Trump said the case was “the first arrest of many to come.”",
    "url": "https://www.nytimes.com/2025/03/10/us/trump-rubio-khalil-columbia-student-protests.html"
  },
  {
    "text": "This Is the Greatest Threat to Free Speech Since the Red Scare  —  On Saturday, immigration agents showed at the apartment building of Mahmoud Khalil, a leader of last year's pro-Palestinian protests at Columbia University, and told him his student visa had been revoked and that he was being detained.",
    "url": "https://www.nytimes.com/2025/03/10/opinion/mahmoud-khalil-free-speech.html"
  },
  {
    "text": "Dow falls by almost 900 points in market rout after Trump says he won't rule out a recession  —  New York CNN  —  US stocks plunged, bitcoin stumbled and Wall Street's fear gauge hit its highest level this year as concerns about President Donald Trump's economic policy led to a widespread market selloff on Monday.",
    "url": "https://www.cnn.com/2025/03/10/investing/us-stocks-drop-after-trump-says-he-wont-rule-out-a-recession/"
  },
  {
    "text": "White House downplays economic ‘blips’ as stock market tumbles  —  The sell-off comes amid economic uncertainty and after President Donald Trump declined to rule out the possibility of a recession.  —  President Donald Trump's senior advisers downplayed fresh economic turbulence Monday … ",
    "url": "https://www.washingtonpost.com/business/2025/03/10/stocks-dow-fall-trump/"
  },
  {
    "text": "Health Update  —  With a heavy heart, I have to tell you that after a long battle with cancer my husband Kevin Drum passed away on Friday, March 7, 2025.  —  No public memorial services are planned.  —  In lieu of flowers, please donate to the charity or political cause of your choice.",
    "url": "https://jabberwocking.com/health-update-100/"
  },
  {
    "text": "Over texts and ‘eyeball to eyeball,’ Republicans succeed in persuading Musk.  But Democrats hit dead ends  —  When a multi-million federal grant program for dairy businesses was shut down earlier this month in line with Elon Musk's Department of Government Efficiency push to downsize the government … ",
    "url": "https://www.cnn.com/2025/03/10/politics/republican-lawmakers-doge-musk-success/"
  },
  {
    "text": "Tesla Shares Plunge as Musk's Political Role Grows More Divisive  —  The automaker's shares soared after Election Day as Elon Musk took a high-profile role as a Trump adviser.  Now those gains have evaporated.  —  Tesla shares plunged on Monday, hitting their lowest point since before Election Day … ",
    "url": "https://www.nytimes.com/2025/03/10/business/tesla-stock-market-elon-musk.html"
  },
  {
    "text": "Top ‘Washington Post’ columnist resigns, accusing publisher of killing piece  —  A top political columnist for The Washington Post resigned today, accusing Post chief executive and publisher Will Lewis of killing her column that criticized owner Jeff Bezos's drive to overhaul the opinion pages to focus on his libertarian priorities.",
    "url": "https://www.npr.org/2025/03/10/nx-s1-5323136/washington-post-editor-ruth-marcus-resigns"
  },
  {
    "text": "Justice Dept. Official Says She Was Fired After Opposing Restoring Mel Gibson's Gun Rights  —  Elizabeth G. Oyer, the former pardon attorney, said that she was not told why she was dismissed, but that as events unfolded she feared they might lead to her firing.",
    "url": "https://www.nytimes.com/2025/03/10/us/politics/justice-department-mel-gibson.html?unlocked_article_code=1.3E4.9xqZ.oziqQOWfRdAK"
  },
  {
    "text": "At SXSW, Bluesky CEO Jay Graber pokes fun at Mark Zuckerberg with Latin phrase T-shirt  —  When Bluesky CEO Jay Graber walked on stage at SXSW 2025 for her keynote discussion, she wore a large black T-shirt with her hair pulled back into a bun.  At first glance, it might appear … ",
    "url": "https://techcrunch.com/2025/03/10/at-sxsw-bluesky-ceo-jay-graber-pokes-fun-at-mark-zuckerberg-with-latin-phrase-t-shirt/"
  },
  {
    "text": "Firm Targeted by Trump Over Clinton Campaign Work Hires Top Litigators  —  President Trump stripped Perkins Coie of access to federal buildings and personnel, citing its work for Hillary Clinton's 2016 campaign.  The firm hired Williams & Connolly, which is skilled in fighting the government, to represent it.",
    "url": "https://www.nytimes.com/2025/03/10/us/politics/trump-perkins-coie.html"
  },
  {
    "text": "Mike Johnson's chief of staff slurred speech and had trouble standing during DUI arrest, police say  —  Hayden Haynes, chief of staff to House Speaker Mike Johnson, slurred his speech and was “staggering” when shortly before Capitol Police arrested him after Trump's speech at the Capitol last week … ",
    "url": "https://www.nbcnews.com/politics/politics-news/live-blog/live-updates-trump-government-shutdown-china-tariffs-labor-ukraine-rcna195479/rcrd74688?canonicalCard=true"
  },
  {
    "text": "X down: Twitter not working amid major outage  —  Your support helps us to tell the story  —  From reproductive rights to climate change to Big Tech, The Independent is on the ground when the story is developing.  Whether it's investigating the financials of Elon Musk's pro-Trump PAC … ",
    "url": "https://www.the-independent.com/tech/x-down-twitter-not-working-elon-musk-latest-b2712094.html"
  },
  {
    "text": "Billionaires at Trump's Swearing-In Have Since Lost $210 Billion … As Donald Trump took the oath of office on Jan. 20, he was flanked by some of the world's wealthiest people.  The billionaires present that day — including Elon Musk, Jeff Bezos and Mark Zuckerberg — had never been richer … ",
    "url": "https://www.bloomberg.com/news/articles/2025-03-10/billionaires-at-trump-s-swearing-in-have-since-lost-200-billion"
  },
  {
    "text": "Kennedy Links Measles Outbreak to Poor Diet and Health, Citing Fringe Theories  —  In a recent interview, the health secretary also suggested that the measles vaccine had harmed children in West Texas, center of an outbreak.  —  In a sweeping interview, Robert F. Kennedy Jr. … ",
    "url": "https://www.nytimes.com/2025/03/10/health/measles-texas-kennedy-fox.html?unlocked_article_code=1.204.sAQR.wAUh7GrZlYMr&smid=url-share"
  },
  {
    "text": "Will Dems Pick Up Their Sword? … (Ed. Note: I go into a lot of detail below.  The bottom line is Democrats have about 48 hours to convince D senators to clip Elon's wings.  It's still totally doable.  But it has to happen in the next 48 hours.)  —  We're now down to the wire with the so-called “continuing resolution” fight.",
    "url": "https://talkingpointsmemo.com/edblog/will-dems-pick-up-their-sword"
  },
  {
    "text": "Ukraine Must Cede Territory in Any Peace Deal, Rubio Says  —  The secretary of state, heading to talks with Ukrainian officials in Saudi Arabia, said future talks with Moscow will be needed to determine what Russia is willing to give up to end the war.  —  Secretary of State Marco Rubio … ",
    "url": "https://www.nytimes.com/2025/03/10/us/politics/rubio-ukraine-russia.html"
  },
  {
    "text": "National Cancer Institute Employees Can't Publish Information on These Topics Without Special Approval  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up to receive our biggest stories as soon as they're published.  —  Employees at the National Cancer Institute … ",
    "url": "https://www.propublica.org/article/national-cancer-institute-flagged-topics-vaccines-autism-rfk-jr"
  },
  {
    "text": "Trump's Call to Scrap ‘Horrible’ Chip Program Spreads Panic  —  The president's attack on the key tenet of the Biden administration's industrial policy has set off concerns that he may claw back its funding.  —  As President Trump addressed Congress last week, he veered off script to attack … ",
    "url": "https://www.nytimes.com/2025/03/10/technology/trump-chips-act.html?unlocked_article_code=1.204.M3QT.UGTrsSXi9m6B"
  },
  {
    "text": "Texas bill would make identifying as transgender a felony punishable by jail  —  The bill, while unlikely to pass, highlights the increasing extremism of legislation targeting trans people, especially in Texas, in recent years.  —  A Texas state bill could charge transgender people with … ",
    "url": "https://www.nbcnews.com/nbc-out/rcna195642"
  },
  {
    "text": "Deleted tweets show top State Department official spread false rumor about Rubio's sexuality, called him ‘low IQ’  —  A top acting State Department official deleted at least half a dozen tweets that ridiculed his now boss, Secretary of State Marco Rubio, including ones calling him “low IQ” … ",
    "url": "https://www.cnn.com/2025/03/10/politics/darren-beattie-marco-rubio-deleted-tweets-kfile"
  },
  {
    "text": "Comedian who mocked Puerto Rico at Trump rally gets Netflix deal  —  Tony Hinchcliffe's YouTube channel boasts over 2 million subscribers.  —  Tony Hinchcliffe, the comedian whose -appearance at a New York rally for then-candidate Donald Trump drew bipartisan backlash after he made disparaging comments … ",
    "url": "https://www.politico.com/news/2025/03/10/tony-hinchcliffe-trump-netflix-00222074"
  },
  {
    "text": "At Harvard Talk, Former Israeli PM Joked He Would Give Exploding Pagers to Protesters  —  Former Israeli Prime Minister Naftali Bennett joked to hundreds of people about sending explosive devices to dissenting event attendees at a talk at the Harvard Business School on Thursday, according to six people present at the discussion.",
    "url": "https://www.thecrimson.com/article/2025/3/10/naftali-bennett-hbs-talk/"
  },
  {
    "text": "Trump's next climate move: Show global warming benefits humanity … President Donald Trump has long rejected climate science.  —  Now, his administration is grappling with how to assemble a body of federal climate research to show a warming world is benefiting humanity.",
    "url": "https://www.eenews.net/articles/trumps-next-climate-move-show-global-warming-benefits-humanity/"
  }
]