[
  {
    "text": "The difference between work and Trump's staged McDonald's theatrics  —  There were reports suggesting Trump “worked” at a McDonald's, but that's not quite right — because there's a difference between work and staged theatrics.  —  As Donald Trump handed a bag of food to people … ",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/difference-work-trumps-staged-mcdonalds-theatrics-rcna176365"
  },
  {
    "text": "Donald Trump McDonald's Hit With Bad Reviews: ‘Bronzer on My Fries’  —  Internet pranksters are trolling presidential-hopeful  —  he briefly worked at during a photo opportunity on Sunday.  —  The  —  candidate put in a short  —  at restaurant in Feasterville-Trevose, Pennsylvania.",
    "url": "https://www.newsweek.com/donald-trump-mcdonalds-yelp-reviews-pennsylvania-1972253"
  },
  {
    "text": "No, McDonald's didn't confirm Trump's baseless claim about Kamala Harris  —  In a message to employees obtained by The Washington Post, the fast-food giant made clear that it isn't saying what Trump says it's saying.  —  In any other presidential campaign, one of the candidates' mention … ",
    "url": "https://www.washingtonpost.com/politics/2024/10/21/trump-harris-worked-at-mcdonalds/"
  },
  {
    "text": "Russian Propaganda Unit Appears to Be Behind Spread of False Tim Walz Sexual Abuse Claims  —  The Russian-aligned network Storm-1516 has a long history of posting fake whistleblower videos—including deepfakes—to push Kremlin talking points.  —  A Russian-aligned propaganda network notorious … ",
    "url": "https://www.wired.com/story/russian-propaganda-unit-storm-1516-false-tim-walz-sexual-abuse-claims/"
  },
  {
    "text": "Viral attack on Walz features fake former student making false claim  —  Hawaii man who attended a school where Walz taught — but says they never met — was dismayed to see person in video using his name to make a false allegation against the vice presidential candidate  —  Using a stolen identity to attack Tim Walz",
    "url": "https://www.washingtonpost.com/investigations/2024/10/21/tim-walz-matthew-metro-video/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI5NDgzMjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzMwODY5MTk5LCJpYXQiOjE3Mjk0ODMyMDAsImp0aSI6IjFhOTZkYmE3LWIwNzgtNDE3ZS1hMGM1LWRiMGRhNDk0NjA5NCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9pbnZlc3RpZ2F0aW9ucy8yMDI0LzEwLzIxL3RpbS13YWx6LW1hdHRoZXctbWV0cm8tdmlkZW8vIn0.6q4iQjY18B5szkeHTmlNBUL2fh9AYnPzTjlPOPZCGbE&itid=gfta"
  },
  {
    "text": "An Update to Our Readers  —  Last month, the magazine enlisted the law firm Davis Wright Tremaine to review Olivia Nuzzi's work during the 2024 campaign.  They reached the same conclusion as the magazine's initial internal review of her published work, finding no inaccuracies nor evidence of bias.",
    "url": "https://nymag.com/press/article/an-update-to-our-readers.html"
  },
  {
    "text": "'More Republicans than you've seen vote for a Democrat in decades': Inside the Harris campaign effort to turn red voters blue  —  By Andrew Feinberg speaks to the former Trump voters who are now planning to pull the lever for Harris — and the campaign politicos who came up with an unusual strategy",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/republicans-against-trump-harris-campaign-b2633011.html"
  },
  {
    "text": "Kamala Harris against Despair  —  As you know, I've been tracking Kamala Harris' outreach to Republicans, Liz Cheney above all, with a good deal of interest.  I've spoken about why it makes sense from a demographic perspective; if Harris can attract some of Nikki Haley's voters, it could put her over the top in these 50/50 states.",
    "url": "https://www.emptywheel.net/2024/10/21/kamala-harris-against-despair/"
  },
  {
    "text": "Elon Musk ‘Jokes’ in a Church About Someone Killing Kamala Harris  —  “Assassinating a puppet is pointless,” the Trump-backing billionaire said in a Saturday church appearance  —  Elon Musk keeps trying to stick his “joke” about somebody assassinating Vice President Kamala Harris.",
    "url": "https://www.rollingstone.com/politics/politics-news/elon-musk-harris-trump-assassination-joke-church-1235139632/"
  },
  {
    "text": "What Would the Trump Campaign Plans Mean for Social Security?  —  The Social Security trust funds will be insolvent by Fiscal Year (FY) 2034, according to projections by the Congressional Budget Office (CBO), at which point the law calls for a 23 percent cut in benefits.",
    "url": "https://www.crfb.org/blogs/what-would-trump-campaign-plans-mean-social-security"
  },
  {
    "text": "Fact check: Trump repeats debunked lies about FEMA's hurricane response during North Carolina visit  —  Former President Donald Trump used a Monday visit to North Carolina to repeat debunked lies about the federal response to Hurricane Helene.  —  Speaking to reporters in a hard-hit community … ",
    "url": "https://www.cnn.com/2024/10/21/politics/fact-check-trump-fema-hurricane-response/"
  },
  {
    "text": "PAC paying Trump's legal fees has run out of cash — with $3M in debt: report  —  The Washington Post reported that Vice President Kamala Harris has a huge cash advantage over Donald Trump in the 2024 race after bringing in $1 billion in fewer than three months on the campaign trail.",
    "url": "https://www.rawstory.com/trump-legal-fees-super-pac/"
  },
  {
    "text": "Ted Cruz Suffers Blow as Texas' Biggest Newspaper Endorses Opponent  —  , Texas' biggest newspaper has endorsed his Democratic opponent, Rep. Colin Allred.  —  Cruz is facing Allred, a three-term congressman from Dallas, in a closely watched race that could determine which party wins control of the U.S.",
    "url": "https://www.newsweek.com/ted-cruz-blow-newspaper-endorses-opponent-1972051"
  },
  {
    "text": "Arnold Palmer's daughter on what he would think of Donald Trump today: 'I think he'd cringe'  —  Donald Trump's opening at his rally Saturday in Latrobe, Pa., birthplace of the late Arnold Palmer, was a boast about how close he was to the legendary golfer.  —  But that relationship … ",
    "url": "https://www.palmbeachpost.com/story/sports/pga/2024/10/20/donald-trump-latrobe-pennsylvania-arnold-palmer/75763112007/"
  },
  {
    "text": "First two Elon Musk giveaway winners had already voted  —  Elon Musk is doing a good job of drawing attention with his $1 million giveaways to Pennsylvania voters.  But will the project actually boost Donald Trump?  Two Pennsylvania voters have won the billionaire's super PAC lottery so far … ",
    "url": "https://www.politico.com/live-updates/2024/10/21/2024-elections-live-coverage-updates-analysis/elon-musk-million-winners-already-voted-00184772"
  },
  {
    "text": "Mifepristone Lawsuit: Republican Attorneys General In Court Filing: We Demand Pregnant Teenagers  —  Three state Republican Attorneys General filed a complaint in federal court on October 11 arguing that their states have a right to pregnant teenagers and that right is being violated by the U.S. Food and Drug Administration.",
    "url": "https://ballsandstrikes.org/law-politics/mifepristone-lawsuit-republican-ags-more-pregnant-teens/"
  },
  {
    "text": "Former GOP lawmakers, officials urge Garland to investigate Musk  —  The Justice Department confirmed that Attorney General Merrick Garland got the letter, but it declined to say whether it is investigating Musk or his PAC.  —  Former Republican lawmakers, advisers and Justice Department officials … ",
    "url": "https://www.washingtonpost.com/national-security/2024/10/21/elon-musk-voting-petition-justice-department-trump/"
  },
  {
    "text": "With Two Weeks to Go, Pennsylvania Senate Shifts to Toss Up, Nebraska Senate Moves to Lean Republican  —  With two weeks to go until Election Day, the Senate map still favors Republicans.  Montana Sen. Jon Tester remains the likeliest Democrat to lose reelection, which along with the GOP's certain pickup … ",
    "url": "https://www.cookpolitical.com/analysis/senate/senate-overview/two-weeks-go-pennsylvania-senate-shifts-toss-nebraska-senate-moves"
  },
  {
    "text": "Florida official says DeSantis's office ordered him to threaten TV stations over abortion ads  —  John Wilson, general counsel for the Florida Department of Health, wrote in a sworn affidavit that officials from Gov. Ron DeSantis's (R-Fla.) office pushed him to threaten television stations … ",
    "url": "https://thehill.com/blogs/blog-briefing-room/news/4945482-florida-department-health-threatens/"
  },
  {
    "text": "Infants died at higher rates after abortion bans in the US, research shows  —  In the year and a half following the Supreme Court Dobbs decision that revoked the federal right to an abortion, hundreds more infants died than expected in the United States, new research shows.",
    "url": "https://www.cnn.com/2024/10/21/health/infant-deaths-increase-post-dobbs-abortion-bans"
  },
  {
    "text": "Intuit asked us to delete part of this Decoder episode  —  We declined. … Today's episode of Decoder, well — it's a ride.  I'm talking to Intuit CEO Sasan Goodarzi, who's built Intuit into a juggernaut business software company through a series of major acquisitions.",
    "url": "https://www.theverge.com/2024/10/21/24273820/intuit-ceo-sasan-goodarzi-turbotax-irs-quickbooks-ai-software-decoder-interview"
  }
]