[
  {
    "text": "Jack Smith's Big New Jan. 6 Brief Is a Major Indictment of the Supreme Court  —  It's rare to simultaneously feel red-hot anger and wistfulness, especially when merely reading a document.  But those are exactly the emotions that washed over me when I read the redacted version … ",
    "url": "https://slate.com/news-and-politics/2024/10/trump-election-interference-trial-jack-smith-brief-supreme-court-failure.html"
  },
  {
    "text": "Bombshell immunity filing details Trump's alleged ‘increasingly desperate’ bid to overturn 2020 election  —  Trump privately described claims of voter fraud as “crazy,” the filing says.  —  In this July 31, 2024, file photo, Republican presidential candidate former President Donald Trump waits … ",
    "url": "https://abcnews.go.com/US/bombshell-special-counsel-filing-includes-new-allegations-trumps/story?id=114409494"
  },
  {
    "text": "Jack Smith lays out his case against Trump in vivid detail  —  In a newly unsealed legal brief, the special counsel revealed private, detailed conversations Trump had with GOP officials in his bid to subvert the 2020 election.  —  As his bid to hold on to power in 2020 grew increasingly desperate … ",
    "url": "https://www.politico.com/news/2024/10/02/jack-smith-trump-case-00182258"
  },
  {
    "text": "11 damning details in Jack Smith's new brief in the Trump election case  —  From Trump's fictitious stats about voter fraud to the FBI's forensic analysis of Trump's phone, prosecutors previewed how they would make their case at trial.  —  Special counsel Jack Smith won't get a chance … ",
    "url": "https://www.politico.com/news/2024/10/02/jack-smith-trump-election-brief-details-00182287"
  },
  {
    "text": "Jack Smith Lays Out New Evidence in Trump's Jan. 6 Case  —  Judge Tanya Chutkan made public portions of a filing by prosecutors setting out their argument for why the case should go forward despite the Supreme Court's ruling on presidential immunity.  —  When told by an aide … ",
    "url": "https://www.nytimes.com/2024/10/02/us/politics/trump-jan-6-case-jack-smith-evidence.html?unlocked_article_code=1.PE4.CPV7.DVbtr_zR8EME&smid=url-share"
  },
  {
    "text": "Key takeaways from special counsel Jack Smith's major filing in Trump's 2020 election case  —  Washington — U.S. District Judge Tanya Chutkan has made public a key filing from special counsel Jack Smith that includes evidence compiled in his investigation into former President Donald Trump's alleged efforts … ",
    "url": "https://www.cbsnews.com/news/trump-2020-election-filing-special-counsel-jack-smith/"
  },
  {
    "text": "Playbook: The first October surprise of 2024  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  TODAY'S MARQUEE EVENT — VP KAMALA HARRIS' campaign has made a big deal about her going to places Democrats don't typically go.",
    "url": "https://www.politico.com/newsletters/playbook/2024/10/03/the-first-october-surprise-of-2024-00182319"
  },
  {
    "text": "Special counsel Jack Smith provides fullest picture yet of his 2020 election case against Trump in new filing  —  Federal prosecutors laid out their most extensive case to date against former President Donald Trump for his effort to overturn the 2020 election in a sweeping legal brief … ",
    "url": "https://www.cnn.com/2024/10/02/politics/jack-smith-donald-trump-filing/"
  },
  {
    "text": "Trump fear factor hits Senate GOP … - “I said, 'Sir, if I was you, I would stay out of the race, because there's no win for you in this,'” Sen. Markwayne Mullin (R-Okla.) told us about a recent call with Trump.  — “I hope not,” said Sen. Thom Tillis, when asked if he thinks Trump will weigh in.",
    "url": "https://www.axios.com/2024/10/03/trump-senate-republicans-mcconnell-thune-cornyn"
  },
  {
    "text": "Inside Jim Jordan's campaign for top House Republican  —  Good morning, Early Birds.  Shana tova.  President George W. Bush signed legislation creating the Troubled Asset Relief Program — popularly known as the bank bailout — 16 years ago today.  Send tips to earlytips@washpost.com.",
    "url": "https://www.washingtonpost.com/politics/2024/10/03/inside-jim-jordans-campaign-top-house-republican/"
  },
  {
    "text": "Behind the Curtain: Vance's “Minnesota nice” ploy … Walz was girded for war against Vance, who has spent the past 10 weeks defending past controversial remarks.  — Instead, Vance greeted Walz with a big smile, and the two shook hands warmly right off the bat.",
    "url": "https://www.axios.com/2024/10/03/jd-vance-vp-debate-nice"
  },
  {
    "text": "Trump and his allies are not planning to concede another electoral loss  —  The former president and his allies are making it clear, repeatedly, that the only outcome they will accept without hesitation is one where he is the victor.  —  The reason that it is important to ask Sen. JD Vance … ",
    "url": "https://www.washingtonpost.com/politics/2024/10/02/trump-his-allies-are-not-planning-concede-another-electoral-loss/"
  },
  {
    "text": "Melania Trump passionately defends abortion rights in upcoming memoir  —  Exclusive: ‘I have carried this belief with me throughout my entire adult life’, former first lady writes in memoir  —  Melania Trump made an extraordinary declaration in an eagerly awaited memoir to be published … ",
    "url": "https://www.theguardian.com/us-news/2024/oct/02/melania-trump-memoir-defends-abortion-rights"
  },
  {
    "text": "Trump campaign brings in $160 million in September  —  Hundreds of millions of dollars raised by each campaign are going towards expensive television buys in battleground states.  —  Donald Trump's campaign reported raising over $160 million in September as it gears up for the final five weeks of the presidential election.",
    "url": "https://www.politico.com/news/2024/10/02/trump-fundraising-september-2024-00182263"
  },
  {
    "text": "How Eric Adams Could Beat His Bribery Case  —  The optics are terrible, but the Supreme Court and Congress have made it harder than ever to prosecute public corruption.  —  New York City Mayor Eric Adams arrives at federal court on Wednesday in New York.  As it stands now, the criminal case against Adams is not a sure thing.",
    "url": "https://www.politico.com/news/magazine/2024/10/03/eric-adams-new-york-criminal-case-00182227"
  },
  {
    "text": "Harris and Biden surveyed damage wrought by Hurricane Helene in 2 swing states  —  AUGUSTA, Ga. — Vice President Harris took a pause from the campaign trail on Wednesday to visit a neighborhood ravaged by Hurricane Helene where more than half of residents don't have power and many don't have running water … ",
    "url": "https://www.npr.org/2024/10/02/nx-s1-5136749/kamala-harris-joe-biden-hurricane-helene-north-carolina-georgia"
  },
  {
    "text": "Exclusive: Multiple Women Claiming Romantic Relationships With RFK Jr. Threaten His Standing in Trump Orbit  —  At least three women are claiming to have had romantic relationships with Robert F. Kennedy Jr. in just the last year, as he pursued a long-shot bid for the presidency, Mediaite has learned.",
    "url": "https://www.mediaite.com/politics/exclusive-multiple-women-claiming-romantic-relationships-with-rfk-jr-threaten-his-standing-in-trump-orbit/"
  },
  {
    "text": "Ted Cruz, Rick Scott, and Other Senate Republicans Voted to Defund FEMA—Now Ask for Federal Aid  —  Written for MeidasTouch by J.D. Wolf  —  As the federal response to Hurricane Helene is well underway, many MAGA Republicans have been politicizing the Biden administration's efforts.",
    "url": "https://www.meidasplus.com/p/ted-cruz-rick-scott-and-other-senate"
  },
  {
    "text": "Exclusive: Musk funded right-wing political non-profit years before he endorsed Trump, sources say  —  Elon Musk secretly funded a conservative political group in recent years, according to four people familiar with his donations, illustrating quiet financial support for right-wing causes … ",
    "url": "https://www.reuters.com/world/us/musk-funded-right-wing-political-non-profit-years-before-he-endorsed-trump-2024-10-02/"
  },
  {
    "text": "Walz vs Vance: Fact Checking the VP Debate  —  Tim Walz and JD Vance met for their first and only Vice Presidential debate.  Below I provide a comprehensive analysis on 10 of the most salient questions and subjects.  We have a lot to cover so let's dive in.  Likewise, please consider subscribing to support my work and advocacy.",
    "url": "https://www.qasimrashid.com/p/walz-vs-vance-fact-checking-the-vp"
  },
  {
    "text": "Trump downplays troop brain injuries from Iran attack as ‘headaches’  —  Former President Donald Trump downplayed the injuries of troops who suffered traumatic brain injuries following missile strikes against a U.S. base at the end of his time in office, referring to them as “headaches” at a campaign event in Wisconsin on Tuesday.",
    "url": "https://www.militarytimes.com/news/pentagon-congress/2024/10/02/trump-downplays-troop-brain-injuries-from-iran-attack-as-headaches/"
  },
  {
    "text": "Video: Derrick Anderson's Disastrous Week Highlighted In New Advertisement, “Fake Family Guy,” Ahead of UMW Debate  —  “Derrick faked having a family.  Now he wants to control yours.”  —  From the Eugene Vindman for Congress (VA07), which has been watching as their opponent … ",
    "url": "https://bluevirginia.us/2024/10/video-derrick-andersons-disastrous-week-highlighted-in-new-advertisement-fake-family-guy-ahead-of-umw-debate"
  }
]