[
  {
    "text": "Maybe Stealing Womens' Rights Wasn't the Best Election Plan  —  Abortion initiatives have gone seven for seven at the ballot box since the Supreme Court killed Roe.  Democrats are pressing the advantage  —  It's abortion, stupid.  —  Across the country on Tuesday night … ",
    "url": "https://www.rollingstone.com/politics/politics-features/abortion-wins-big-kentucky-ohio-virginia-2023-elections-1234872518/"
  },
  {
    "text": "Democrats romp, Youngkin flops: 4 takeaways from Tuesday's election  —  Joe Biden's party has had a very strong year at the ballot box.  Whether it extends to the president in 2024 is another matter.  —  Joe Biden has had a very bad few days.  His party just had a banner year.",
    "url": "https://www.politico.com/news/2023/11/08/election-day-2023-results-takeaways-00126035"
  },
  {
    "text": "Fox & Friends Blast Governor Glenn Youngkin's ‘Epic Failure’ in Virginia Election One Day After Going ALL IN On Him  —  One day after featuring Governor Glenn Youngkin and co-hosting Tuesday's show from Manassas, Virginia, Fox & Friends piled on following Tuesday's election results.",
    "url": "https://www.mediaite.com/tv/fox-friends-blast-governor-glenn-youngkins-epic-failure-in-virginia-election-one-day-after-going-all-in-on-him/"
  },
  {
    "text": "Fatalism creeps in around DeSantis  —  In the shadow of polls showing DeSantis hasn't cut into former Trump's lead at the national level or in early state contests, there is a sense of growing fatalism around the Florida governor.  —  “It feels like in July I'll be wearing a f—",
    "url": "https://www.nbcnews.com/politics/2024-election/live-blog/third-republican-debate-live-updates-rcna121790/rcrd24990?canonicalCard=true"
  },
  {
    "text": "Cassidy Hutchinson: Why I Testified  —  Happy Wednesday.  —  This is what is known as a vibe shift.  —  The polls suggested that Democrats were entering another Dark Night of the Soul, but once again they overperformed when the actual votes were counted.",
    "url": "https://plus.thebulwark.com/p/cassidy-hutchinson-why-i-testified-b25"
  },
  {
    "text": "The GOP is in a Trump trap  —  Trump hasn't been a consistent electoral success — but Republicans have had even fewer winning nights without him.  —  I've never been a huge off-year elections person.  There are different types of election nerds, and I've always been more of a macro guy … ",
    "url": "https://www.natesilver.net/p/the-gop-is-in-a-trump-trap"
  },
  {
    "text": "Three Arrested for Operating High-End Brothel Network  —  For Immediate Release  —  U.S. Attorney's Office, District of Massachusetts  —  Interested sex buyers were allegedly required to provide employer information and references before booking appointments",
    "url": "https://www.justice.gov/usao-ma/pr/three-arrested-operating-high-end-brothel-network"
  },
  {
    "text": "Feds charge 3 with running high-end brothels allegedly frequented by politicians  —  Brothels were allegedly located in Fairfax and Tysons, Va.  —  The Justice Department said Wednesday it is investigating politicians, military officers and government contractors for buying sex through … ",
    "url": "https://www.politico.com/news/2023/11/08/feds-brothel-investigation-politicians-00126153"
  },
  {
    "text": "Behind Hamas's Bloody Gambit to Create a ‘Permanent’ State of War  —  Hamas leaders say they waged their Oct. 7 attack on Israel because they believed the Palestinian cause was slipping away, and that only violence could revive it.  —  Thousands have been killed in Gaza, with entire families wiped out.",
    "url": "https://www.nytimes.com/2023/11/08/world/middleeast/hamas-israel-gaza-war.html"
  },
  {
    "text": "Moms for Liberty Falls Flat on Its Face in School Board Races  —  Iowa chapters of the far-right group Moms for Liberty endorsed 13 candidates in school board races across the state.  Only one was elected.  —  The Tuesday loss is a stinging rebuke of Moms for Liberty, a “parental rights” … ",
    "url": "https://newrepublic.com/post/176746/moms-liberty-falls-flat-face-school-board-races-iowa"
  },
  {
    "text": "Republican debate live updates: Five presidential candidates take the stage tonight on NBC … 6m ago / 11:53 PM UTC  —  What do the candidates eat pre-debate?  —  “If I'm picking the restaurant after the debate, that's bad,” Christie said.  — SHARE THIS -  —  Copied",
    "url": "https://www.nbcnews.com/politics/2024-election/live-blog/third-republican-debate-live-updates-rcna121790#rcrd24885"
  },
  {
    "text": "‘Is the fat lady warming up?  Yes’: Trump chokes off his rivals' last lines of attack  —  Donald Trump's opponents rested their case against him on the argument he can't beat Joe Biden.  Now polls suggest he can.  —  Publicly and privately, on the stump and in closed-door pitches to prospective donors … ",
    "url": "https://www.politico.com/news/2023/11/08/trump-biden-electability-argument-00125911"
  },
  {
    "text": "Comer Issues Subpoenas to Biden Family & Associates  —  WASHINGTON—House Committee on Oversight and Accountability Chairman James Comer (R-Ky.) today issued subpoenas to President Joe Biden's son, Hunter Biden, brother, James Biden, and Biden family associate, Rob Walker, to appear for depositions.",
    "url": "https://oversight.house.gov/release/comer-issues-subpoenas-to-biden-family-associates%EF%BF%BC/"
  },
  {
    "text": "Sen. JD Vance says Republicans have to ‘recognize how much voters mistrust us’ on abortion  — Ohions just voted to enshrine abortion rights into the state's constitution.  — JD Vance, Ohio's GOP senator, says his party needs to recognize people don't trust them on abortion.",
    "url": "https://www.businessinsider.com/jd-vance-republicans-voters-mistrust-issue-one-abortion-2023-11?op=1"
  },
  {
    "text": "Jim Jordan Sniffs Dick Pics While Rome Burns  —  Yesterday, David Weiss, the US Attorney turned Special Counsel leading an investigation into Hunter Biden that has entered a sixth year, testified to the House Judiciary Committee.  —  His written statement debunked Gary Shapley's claims … ",
    "url": "https://www.emptywheel.net/2023/11/08/jim-jordan-sniffs-dick-pics-while-rome-burns/"
  },
  {
    "text": "U.S. officials pick Greenbelt, Md., for new FBI national headquarters  —  Prince George's suburb selected despite concerns from FBI leaders over the decision-making process, a person familiar with the situation said  —  Federal officials have decided the FBI will leave its iconic … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2023/11/08/fbi-headquarters-chosen-greenbelt/"
  },
  {
    "text": "Minnesota Supreme Court dismisses effort to block Trump from state's primary ballot  —  A group of voters have been trying to ban Trump from the 2024 GOP primary and general election ballots based on 14th Amendment grounds.  —  The Minnesota Supreme Court on Wednesday dismissed an effort … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/minnesota-supreme-court-dismisses-effort-block-trump-states-primary-ba-rcna124291"
  },
  {
    "text": "'I'm calling from Israeli intelligence.  We have the order to bomb.  You have two hours'  —  The call to Mahmoud Shaheen came at dawn.  —  It was Thursday 19 October at about 06:30, and Israel had been bombing Gaza for 12 days straight.  —  He'd been in his third-floor … ",
    "url": "https://www.bbc.com/news/world-middle-east-67327079"
  },
  {
    "text": "Mississippi's Election Day Voting Failures Simply Should Not Be Happening in 2023  —  Polling places ran out of ballots in heavily Black communities.  This is unacceptable and can't be allowed to happen again. … What happened in Mississippi on election day simply cannot be considered OK in the United States of America in 2023.",
    "url": "https://www.thedailybeast.com/mississippis-election-day-voting-failures-shouldnt-be-happening-in-2023"
  },
  {
    "text": "Ten Members and Associates of the Gambino Crime Family Arrested in Coordinated U.S.-Italian Takedown  —  For Immediate Release  —  U.S. Attorney's Office, Eastern District of New York  —  Defendants Charged in Brooklyn Federal Court with Racketeering Conspiracy Involving Violent Extortions, Assaults, Arson, and Union-Related Crimes",
    "url": "https://www.justice.gov/usao-edny/pr/ten-members-and-associates-gambino-crime-family-arrested-coordinated-us-italian"
  }
]