[
  {
    "text": "Kilmar Abrego Garcia on way back to US to face criminal charges: Sources  —  Sources say he faces charges of illegally transporting migrants within the U.S.  —  Undated photo provided by Murray Osorio PLLC shows Kilmar Abrego Garcia.  —  Murray Osorio PLLC via AP",
    "url": "https://abcnews.go.com/US/mistakenly-deported-kilmar-abrego-garcia-back-us-face/story?id=121333122"
  },
  {
    "text": "Abrego Garcia indictment led top federal prosecutor in Tennessee to resign: Sources  —  The decision to pursue the indictment against Kilmar Abrego Garcia led to the abrupt departure of Ben Schrader, a high-ranking federal prosecutor in Tennessee, sources briefed on Schrader's decision told ABC News.",
    "url": "https://abcnews.go.com/Politics/live-updates/trump-admin-live-updates/?id=122407456&entryId=122591572"
  },
  {
    "text": "Abrego Garcia Charged With Illegally Transporting Migrants  —  Kilmar Abrego Garcia, the Maryland man wrongly deported by the Trump administration to a prison in El Salvador, is being brought back to the US to face federal charges that he illegally transported undocumented immigrants within the country.",
    "url": "https://www.bloomberg.com/news/articles/2025-06-06/abrego-garcia-returning-to-us-to-face-charges-abc-reports"
  },
  {
    "text": "Kilmar Abrego Garcia has been returned to the United States to face criminal charges  —  Kilmar Abrego Garcia, the Maryland man mistakenly deported to El Salvador in March, has been returned to the United States to face federal criminal charges, Attorney General Pam Bondi said Friday.",
    "url": "https://cnn.com/2025/06/06/politics/kilmar-abrego-garcia"
  },
  {
    "text": "The Alarming Part of the Musk-Trump Dispute  —  The Alarming Part of the Musk-Trump Dispute  —  At the height of the juvenile flame war on Thursday between the world's richest man and its most powerful one, Donald Trump posted a barely veiled threat on his website Truth Social.",
    "url": "https://www.nytimes.com/live/2025/06/02/opinion/thepoint"
  },
  {
    "text": "Democratic congressman steps up his work to pull Musk toward his party for the midterms  —  Rep. Ro Khanna, D-Calif., talked with one of Elon Musk's “senior confidants” on Thursday about whether the ex-DOGE leader, now feuding with Donald Trump, might want to help the Democratic Party in the midterms.",
    "url": "https://www.semafor.com/article/06/06/2025/khanna-steps-up-his-work-to-pull-musk-toward-democrats"
  },
  {
    "text": "Trump preparing large-scale cancellation of federal funding for California, sources say  —  The Trump administration is preparing to cancel a large swath of federal funding for California, an effort which could begin as soon as Friday, according to multiple sources.",
    "url": "https://cnn.com/2025/06/06/politics/trump-california-federal-funding"
  },
  {
    "text": "Justices Grant DOGE Access to Social Security Data and Let the Team Shield Records  —  As Elon Musk leaves Washington, the team he formed to ferret out waste and abuse won dual victories in the Supreme Court.  —  The Supreme Court on Friday let members of the Department of Government Efficiency … ",
    "url": "https://www.nytimes.com/2025/06/06/us/politics/supreme-court-doge-social-security.html?unlocked_article_code=1.M08.N1mJ.2_cKK1NkMc2j&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Supreme Court allows DOGE to access Social Security data  —  The dispute concerns efforts by the Department of Government Efficiency, largely led by Elon Musk, to access sensitive data, including Social Security numbers.  —  WASHINGTON — The Supreme Court on Friday allowed members … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-trump-doge-social-security-data-access-elon-musk-rcna206515"
  },
  {
    "text": "Supreme Court allows DOGE team to access Social Security systems with data on millions of Americans  —  The Supreme Court handed the Trump administration two victories Friday in cases involving the Department of Government Efficiency, including giving it access to Social Security systems … ",
    "url": "https://apnews.com/article/doge-social-security-trump-elon-musk-99f3f281154fe0f91e6a6e612bf8e9ba"
  },
  {
    "text": "Rep. Mary Miller faces bipartisan fury over “ignorant” Sikh comment  —  Rep. Mary Miller (R-Ill.) is coming under fire from colleagues in both parties after misidentifying a Sikh man as Muslim and saying he should have “never been allowed” to deliver the House's morning prayer.",
    "url": "https://www.axios.com/2025/06/06/mary-miller-sikh-muslim-republicans-democrats"
  },
  {
    "text": "The Real Reason for the Trump-Musk Feud is Uglier Than You Think  —  As the war between Donald Trump and Elon Musk worsens, what's truly odd about this whole spectacle is that the actual substantive disagreement between them seems to be of little interest to media observers.",
    "url": "https://newrepublic.com/article/196246/real-reason-trump-musk-feud-uglier"
  },
  {
    "text": "Proud Boys Leaders Sue U.S. Over Jan. 6 Prosecutions  —  Lawsuit seeks $100 million in damages after their conviction, imprisonment for roles in Capitol attack  —  Five members of the Proud Boys, once convicted of masterminding the Jan. 6 breach of the U.S. Capitol, are accusing … ",
    "url": "https://www.wsj.com/us-news/law/proud-boys-leaders-sue-u-s-over-jan-6-prosecutions-90f9f4ce?st=qbdV5i&reflink=desktopwebshare_permalink"
  },
  {
    "text": "He's a Master of Outrage on X. The Pay Isn't Great. … Visuals by Martina Tuaty  —  Dominick McGee was walking into the White House in April and couldn't believe his luck.  He was a self-proclaimed “nobody” just three years ago when he started working alone from his apartment … ",
    "url": "https://www.nytimes.com/2025/06/06/technology/x-right-wing-influencer.html?unlocked_article_code=1.M08.RjD3.BsNcPp9EcYQn"
  },
  {
    "text": "Inside the Billion-Dollar Effort to Make Trump Feel Good About Himself  —  Trump's administration is marshaling vast public resources and more than $1 billion worth of taxpayer money to flatter the president … Vice President J.D. Vance was seated directly across from the president … ",
    "url": "https://www.rollingstone.com/politics/politics-features/donald-trump-dear-leader-bondi-noem-republican-propaganda-1235356187/"
  },
  {
    "text": "Appeals court largely reinstates Trump's ban on AP's access to White House  —  A divided panel of the appeals court lifted portions of a lower-court judge's ruling that had blocked the ban.  —  A federal appeals court panel on Friday reinstated parts of President Donald Trump's ban … ",
    "url": "https://www.politico.com/news/2025/06/06/associated-press-ban-trump-white-house-00393216"
  },
  {
    "text": "Former federal inmate pardoned by Trump tapped as Bureau of Prisons deputy director  —  Joshua J. Smith, a Tennessee businessman whom the president pardoned during his first term, now advocates for inmate rehabilitation.  —  A former federal inmate who was pardoned by President Donald Trump … ",
    "url": "https://www.nbcnews.com/politics/politics-news/former-federal-inmate-pardoned-trump-tapped-bureau-prisons-deputy-dire-rcna211396"
  },
  {
    "text": "Trump administration races to fix a big mistake: DOGE fired too many people  —  Across the government, officials are rehiring federal workers who were forced out or encouraged to resign.  —  Early this spring, the Food and Drug Administration fired nearly 50 workers in the Office of Regulatory Policy … ",
    "url": "https://www.washingtonpost.com/business/2025/06/06/doge-staff-cuts-rehiring-federal-workers/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ5MTgyNDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzUwNTY0Nzk5LCJpYXQiOjE3NDkxODI0MDAsImp0aSI6ImYwMmZlZGM3LWJjNzAtNGExYy04Yzc5LTFmOTczMmM1YWJhZSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9idXNpbmVzcy8yMDI1LzA2LzA2L2RvZ2Utc3RhZmYtY3V0cy1yZWhpcmluZy1mZWRlcmFsLXdvcmtlcnMvIn0.b81QLz4gjwtIpGqhsJj5YlBXMq3JZ5brJArFCi87asc"
  },
  {
    "text": "Why Trump probably can't cut Musk loose  —  Breaking up is hard to do — especially when one party is a billionaire with near-unassailable dominance of the nation's ability to launch things into space, and the other is a president who has staked a significant portion of his legacy on wildly ambitious space-based projects.",
    "url": "https://www.vox.com/politics/415780/musk-trump-spacex-nasa-starlink-golden-dome"
  },
  {
    "text": "SEIU California President David Huerta Injured, Detained at ICE Raid in Los Angeles  —  Los Angeles - David Huerta, President of SEIU California and SEIU- United Service Workers West was injured and detained at an ICE raid in Los Angeles today while exercising his First Amendment right to observe and document law enforcement activity.",
    "url": "https://seiuca.org/press-releases/2025/06/06/seiu-california-president-david-huerta-injured-detained-at-ice-raid-in-los-angeles/"
  },
  {
    "text": "Former U.S. attorney Damian Williams leaves Paul Weiss for Jenner & Block  —  The former prosecutor is leaving a firm that made a deal with the Trump administration for one that fought it.  —  Damian Williams, the former top federal prosecutor in Manhattan, is leaving the law firm Paul Weiss … ",
    "url": "https://www.washingtonpost.com/politics/2025/06/06/law-firms-trump-damian-williams-jenner-block/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ5MTgyNDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzUwNTY0Nzk5LCJpYXQiOjE3NDkxODI0MDAsImp0aSI6IjI5YzdiMDBlLWQwMzAtNDVkMC04MWNmLTU4MDBiMzIzZGRmYyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzA2LzA2L2xhdy1maXJtcy10cnVtcC1kYW1pYW4td2lsbGlhbXMtamVubmVyLWJsb2NrLyJ9.Gj8fgipXLKt06b3O3P3i8YgxKvOWhVTEYKK6phhnh6w"
  },
  {
    "text": "Exclusive: ADL chief compares student protesters to ISIS and al-Qaeda in address to Republican officials  —  Jonathan Greenblatt also said protests against Israel were driven by ‘same kind of nihilists’ who participated in Black Lives Matter  —  Jonathan Greenblatt, the Anti-Defamation League CEO … ",
    "url": "https://forward.com/news/726133/greenblatt-adl-protesters-terrorists/"
  },
  {
    "text": "DOGE Developed Error-Prone AI Tool to “Munch” Veterans Affairs Contracts  —  We obtained records showing how a Department of Government Efficiency staffer with no medical experience used artificial intelligence to identify which VA contracts to kill.  “AI is absolutely the wrong tool for this,” one expert said.",
    "url": "https://www.propublica.org/article/trump-doge-veterans-affairs-ai-contracts-health-care"
  },
  {
    "text": "University of Michigan using undercover investigators to surveil student Gaza protesters  —  Revealed: security trailing students on and off campus as video shows investigator faking disability when confronted  —  The University of Michigan is using private, undercover investigators … ",
    "url": "https://www.theguardian.com/us-news/2025/jun/06/michigan-university-gaza-surveillance"
  },
  {
    "text": "The latest personnel purge at the FBI adds to a destabilizing problem  —  Almost immediately after Donald Trump's second term began, FBI officials targeted by Republicans have been ousted.  —  Among the many problems that have emerged in federal law enforcement during Donald Trump's second term is the campaign against key personnel.",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/latest-personnel-purge-fbi-adds-destabilizing-problem-rcna211508"
  },
  {
    "text": "DHS memo details how National Guard troops will be used for immigration enforcement  —  National Guard troops would be used in immigration-enforcement activities, including in “night operations and rural interdiction,” as well as “guard duty and riot control” inside detention facilities … ",
    "url": "https://www.npr.org/2025/06/06/nx-s1-5425421/dhs-national-guard-immigration-enforcement"
  },
  {
    "text": "Tesla becomes desperate with Cybertruck, launches biggest discount yet  —  Tesla has announced that it now offers interest-free loans on the Cybertruck until the end of the month.  The move is the equivalent of a roughly $10,000 discount and shows that Tesla has reached a new level of desperation in trying to sell the Cybertruck.",
    "url": "https://electrek.co/2025/06/05/tesla-goes-full-desperate-cybertruck-with-biggest-discount-yet/"
  },
  {
    "text": "Buyer With Ties to Chinese Communist Party Got V.I.P. Treatment at Trump Crypto Dinner … He Tianying outside the White House on May 23.  Mr. He is a member of an advisory body that seeks to broaden the Communist Party's influence and solicit support from influential people in Chinese society.Jason Andrew for The New York Times",
    "url": "https://www.nytimes.com/2025/06/06/us/politics/trump-crypto-dinner-china-he-tianying.html"
  }
]