[
  {
    "text": "How Right Wingers Rushed to DEI Hire Pete Hegseth  —  Pete Hegseth is wildly unqualified to run DOD.  He described yesterday the most people he had ever supervised was 100.  The non-profit budgets that went broke under his stewardship were in the $10 million range.",
    "url": "https://www.emptywheel.net/2025/01/15/how-right-wingers-rushed-to-dei-hire-pete-hegseth/"
  },
  {
    "text": "The Greatest DEI Disaster Ever  —  Democratic Senators—especially the women—shed an even brighter light on a sketchy, uninformed nominee who has no business lording over the Pentagon  —  Watching Secretary of Defense nominee Pete Hegseth demonstrate his appalling lack of credentials … ",
    "url": "https://contrarian.substack.com/p/the-greatest-dei-disaster-ever"
  },
  {
    "text": "Live Updates: Trump's Attorney General Pick to Face Questions Over Lobbying  —  Senators are likely to ask Pam Bondi, a former attorney general of Florida who has close ties to President-elect Donald J. Trump, how she would handle thorny legal questions as leader of the Justice Department.",
    "url": "https://www.nytimes.com/live/2025/01/15/us/bondi-confirmation-attorney-general"
  },
  {
    "text": "FDA to Revoke Authorization for the Use of Red No. 3 in Food and Ingested Drugs  —  Constituent Update  —  The FDA is revoking the authorization for the use of FD&C Red No. 3 as a matter of law, based on the Delaney Clause of the Federal Food, Drug, and Cosmetic Act (FD&C Act).",
    "url": "https://www.fda.gov/food/hfp-constituent-updates/fda-revoke-authorization-use-red-no-3-food-and-ingested-drugs"
  },
  {
    "text": "FDA bans Red No. 3, artificial coloring used in beverages, candy and other foods  —  Evidence shows that the synthetic dye can cause cancer in lab animals.  —  The Food and Drug Administration said Wednesday it's banning the use of Red No. 3, a synthetic dye that gives food and drinks … ",
    "url": "https://www.nbcnews.com/health/health-news/fda-bans-red-no-3-artificial-coloring-beverages-candy-rcna185479"
  },
  {
    "text": "Scoop: Trump's $500 million post-election windfall … - “The money is just pouring in at Mar-a-Lago. … - “We're looking at half a billion [dollars] by June, and we're on track,” this adviser said. … - They include the president-elect's inauguration account, the MAGA Inc. super PAC … ",
    "url": "https://www.axios.com/2025/01/15/trump-windfall-fundraising-500-million"
  },
  {
    "text": "Paul Krugman Issues Dire Warning On How ‘A Lot’ Of Trump Voters Will Be ‘Brutally Scammed’  —  The economist also slammed one of the president-elect's policies as “terrible.”  —  LOADING  —  “A lot of people” who voted for Donald Trump in the 2024 presidential election … ",
    "url": "https://www.huffpost.com/entry/paul-krugman-donald-trump-voters_n_678789f0e4b009ff2590c7b3"
  },
  {
    "text": "Former Bernie Sanders campaign manager Faiz Shakir enters DNC Chair race  —  The race has so far focused on party mechanics.  That could change with Shakir's candidacy.  —  Faiz Shakir, who led Bernie Sanders' 2020 presidential campaign, is jumping into the race for chair … ",
    "url": "https://www.politico.com/news/2025/01/15/faiz-shakir-dnc-chair-democrats-00198365"
  },
  {
    "text": "Biden Races to Cement His Legacy Through a Series of Actions  —  The president has issued policy decisions in a number of areas in the final days of his term, including environmental justice, prison reform and immigration.  —  In the final days of his term, President Biden has issued a series … ",
    "url": "https://www.nytimes.com/2025/01/15/us/politics/biden-policy-decisions.html"
  },
  {
    "text": "No, Merrick Garland Did Not Let Donald Trump Skate … Some time in the next five days, Merrick Garland will step down as the nation's eighty-sixth attorney general, bringing to a close one of the most distinguished careers in public service in the last century.",
    "url": "https://newrepublic.com/article/190248/merrick-garland-trump-prosecution-delays"
  },
  {
    "text": "Live Updates: Israel and Hamas Agree to Gaza Cease-Fire Deal, Officials Say  —  The cease-fire would take effect immediately, a White House official said.  The first phase of the deal, including the start of hostage releases, would last six weeks, although it was not clear what day that would begin, the official said.",
    "url": "https://www.nytimes.com/live/2025/01/15/world/israel-hamas-cease-fire-deal-gaza?unlocked_article_code=1.pU4.RX8a.tvGIXHe5ZsnS&smid=url-share"
  },
  {
    "text": "Trump will begin his presidency in delicate position, poll finds  —  As Donald Trump prepares to once again assume the office of the presidency, a new NPR/PBS News/Marist poll finds that, despite his claims of an “unprecedented and powerful mandate,” Trump may have to be careful about how far he decides to go with what he wants to do.",
    "url": "https://www.npr.org/2025/01/15/nx-s1-5259893/poll-trump-immigration-economy-favorability"
  },
  {
    "text": "Poland's Tusk Says Russia Planned Terror Acts Against Airlines  —  Polish Prime Minister Donald Tusk accused Russia of planning to carry out “acts of air terror” against airlines worldwide as he urged European partners to join forces in countering Moscow's alleged sabotage attempts.",
    "url": "https://www.bloomberg.com/news/articles/2025-01-15/poland-s-tusk-says-russia-planned-terror-acts-against-airlines"
  },
  {
    "text": "Yoon becomes South Korea's first sitting president to be detained after martial law chaos  —  South Korea's impeached president, Yoon Suk Yeol, was detained in a major law enforcement operation at the presidential compound Wednesday, defiantly insisting the anti-corruption agency … ",
    "url": "https://apnews.com/article/south-korea-yoon-martial-law-detain-8dd7f03661be39729741de9a3b5d1714"
  },
  {
    "text": "Exclusive: Trump team asks three US senior career diplomats to resign, sources say  —  Aides to President-elect Donald Trump have asked three senior career diplomats who oversee the U.S. State Department's workforce and internal coordination to step down from their roles … ",
    "url": "https://www.reuters.com/world/us/trump-team-asks-three-us-senior-career-diplomats-resign-sources-say-2025-01-15/"
  },
  {
    "text": "Jack Smith reminds us of the futility of truth in the Trump era  —  Yesterday unfolded in a sort of perfectly stupid synchronicity, with the past crimes of Donald Trump, as detailed in the just-released Jack Smith report, being overshadowed by the confirmation hearing for Trump's secretary of defense nominee, Pete Hegseth.",
    "url": "https://www.publicnotice.co/p/jack-smith-final-report-trump-january-6"
  },
  {
    "text": "Austin failed to tell Congress or the White House about his health problems as required, report says  —  Defense Secretary Lloyd Austin did not inform Congress or the White House as required when he was incapacitated due to treatment for prostate cancer or when complications worsened his condition last year … ",
    "url": "https://apnews.com/article/austin-pentagon-prostate-cancer-investigation-fabfd130fe42952caf70f21ae1da156c"
  },
  {
    "text": "Toyota exposed as major funder of climate change deniers: Watchdog  —  Nearly three decades after its introduction, the hybrid Toyota Prius is still associated with environmental action and the scientific consensus that fossil fuel emissions, including those from vehicles, must be reduced to avoid the worst effects of planetary heating.",
    "url": "https://www.rawstory.com/toyota-exposed-as-major-funder-of-climate-change-deniers-watchdog/"
  },
  {
    "text": "Michelle Obama signals she's done with Trump  —  Michelle Obama is done with President-elect Trump, if her decision to skip next week's inauguration means anything.  —  The former first lady, who once called on Democrats to go high when Trump's Republican Party goes low … ",
    "url": "https://thehill.com/homenews/administration/5085611-michelle-obama-skips-trump-inauguration/"
  },
  {
    "text": "How a major bank cheated its customers out of $2 billion, according to a new federal lawsuit  —  An explosive new lawsuit filed by the Consumer Financial Protection Bureau (CFPB) alleges that Capital One bank cheated its customers out of $2 billion.  According to the lawsuit … ",
    "url": "https://popular.info/p/how-a-major-cheated-its-customers"
  },
  {
    "text": "Are We Sleepwalking Into Autocracy?  —  Since Donald Trump's election victory, we have witnessed striking accommodations to his narrow win and mandate, what has been called “anticipatory obedience.”  —  Are we sleepwalking into an autocracy?  We hope not, and would be glad if the threat does not materialize.",
    "url": "https://www.nytimes.com/2025/01/15/opinion/trump-democracy-autocracy.html?unlocked_article_code=1.pU4.x6An.U_mm8A0x_kMB&utm_source=substack&utm_medium=email"
  },
  {
    "text": "AG Nominee Pam Bondi Consulted for Group That Took Over Trump's D.C. Hotel  —  The company, which owes Bondi $1 million, defaulted and lost the leasing rights to Trump's D.C. hotel.  Now, Trump's family wants to buy it back … The president-elect's family weren't the only people in his orbit who profited from the hotel deal.",
    "url": "https://www.rollingstone.com/politics/politics-features/pam-bondi-trump-hotel-consulted-1235236747/"
  },
  {
    "text": "Nonprofit Founded by Stacey Abrams Admits Secretly Aiding Her 2018 Campaign  —  The New Georgia Project, whose leaders also included Raphael Warnock, now a senator, admitted violating campaign finance laws.  It agreed to a $300,000 penalty.  —  A nonprofit founded by Stacey Abrams … ",
    "url": "https://www.nytimes.com/2025/01/15/us/politics/nonprofit-stacey-abrams.html"
  },
  {
    "text": "The Fear Is the Point  —  IN A SEMINAL 2018 ARTICLE FOR THE ATLANTIC, Adam Serwer wrote, of then-President Donald Trump's immigration policy and general approach to governance, “The Cruelty is the Point.”  —  But as the pieces begin to come together on Trump 2.0's approach to mass deportations, a different sensation is emerging: fear.",
    "url": "https://www.thebulwark.com/p/the-fear-is-the-point"
  },
  {
    "text": "Trump Said He'd Solve Ukraine on Day One.  Republicans Say He Didn't Mean ‘Day One.’  —  “I don't think the media pressing Day One is specifically ‘Day One,’” Rep. Marjorie Taylor Greene told NOTUS.  — Copy  —  Early on in his latest campaign for president, Donald Trump unveiled a headline-grabbing campaign promise on Ukraine.",
    "url": "https://www.notus.org/congress/trump-solve-ukraine-day-one-republicans"
  },
  {
    "text": "Jeff Bezos, Elon Musk and Mark Zuckerberg to attend Trump's inauguration  —  They will be sitting on the dais during the swearing-in as Silicon Valley leaders aim to make inroads with Trump, who attacked Big Tech during his first presidency.  —  Tech moguls Jeff Bezos … ",
    "url": "https://www.washingtonpost.com/politics/2025/01/14/jeff-bezos-elon-musk-mark-zuckerberg-attend-trump-inauguration/"
  }
]