[
  {
    "text": "Steve Scalise diagnosed with ‘very treatable’ blood cancer  —  House Majority Leader Steve Scalise (R-La.) was diagnosed with multiple myeloma, a blood cancer, he announced Tuesday.  —  Scalise, 57, has begun treatment and plans to return to Washington, D.C.",
    "url": "https://thehill.com/homenews/house/4176620-steve-scalise-diagnosed-blood-cancer/"
  },
  {
    "text": "House Majority Leader Steve Scalise says he is being treated for cancer  —  The Louisiana Republican said he has been “diagnosed with Multiple Myeloma, a very treatable blood cancer” and he expects to return to his work as majority leader.  —  WASHINGTON — House Majority Leader Steve Scalise … ",
    "url": "https://www.nbcnews.com/politics/congress/house-majority-leader-steve-scalise-diagnosed-cancer-rcna102343"
  },
  {
    "text": "How Trump's Election Lies Left the Michigan G.O.P. Broken and Battered  —  Infighting between Trump acolytes and traditionalists has driven away donors and voters.  Can the Michigan Republican Party rebuild in time for the presidential election?  —  The Michigan Republican Party is starving for cash.",
    "url": "https://www.nytimes.com/2023/08/29/us/politics/trump-michigan-republican-party.html"
  },
  {
    "text": "A shutdown wouldn't halt Trump's trials, so Republicans seek to rein in his prosecutors  —  Federal criminal proceedings are exempted from shutdowns.  But GOP House members want to use a must-pass funding bill to defund or limit law enforcement investigating Trump.",
    "url": "https://www.nbcnews.com/politics/donald-trump/shutdown-wouldnt-halt-trumps-trials-republicans-seek-rein-prosecutors-rcna102152"
  },
  {
    "text": "These are the first 10 drugs subject to Medicare price negotiations  —  The Biden administration unveiled Tuesday the names of the first 10 drugs subject to price negotiations in Medicare.  —  They are: Eliquis, Jardiance, Xarelto, Januvia, Farxiga, Entresto, Enbrel, Imbruvica, Stelara … ",
    "url": "https://www.cnn.com/2023/08/29/politics/medicare-drug-price-negotiations/"
  },
  {
    "text": "Supreme Court Justice Amy Coney Barrett Says She Welcomes Public Scrutiny Of Court  —  U.S. Supreme Court Justice Amy Coney Barrett did not offer any opinion, or speak directly about, recent calls for the justices to institute an official code of conduct.  —  LOADING",
    "url": "https://www.huffpost.com/entry/supreme-court-barrett_n_64edc1e4e4b05b73949dea39"
  },
  {
    "text": "Justice Amy Coney Barrett: 'I've acquired a thick skin'  —  Justice Amy Coney Barrett said Monday night that she has developed a thick skin to criticism during her tenure as a judge and stressed that she welcomes public scrutiny of the Supreme Court.  —  “I think that justices and all judges … ",
    "url": "https://www.cnn.com/2023/08/29/politics/justice-barrett-supreme-court/"
  },
  {
    "text": "GOP salivates at the biggest campaign finance win since Citizens United  —  It could be a seismic shift in how tens of millions of campaign dollars are spent.  —  Republicans have waged a decades-long battle to blow up the campaign-finance laws that rein in big-money spending.",
    "url": "https://www.politico.com/news/2023/08/29/gop-campaign-finance-citizens-united-00113235"
  },
  {
    "text": "GOP silences ‘Tennessee Three’ Democrat on House floor for day on ‘out of order’ rule; crowd erupts  —  Republican lawmakers voted Monday to temporarily silence a Democratic member of the so-called Tennessee Three during an already tense House floor session after determining … ",
    "url": "https://apnews.com/article/tennessee-special-session-gun-control-f0af470eb6f377633735c5a1dcefa66f"
  },
  {
    "text": "China behind ‘largest ever’ digital influence operation  —  People with ties to China's law enforcement agencies conducted the largest known covert digital influence operation aimed at discrediting the West and promoting Beijing's agenda across more than 50 social media and online platforms … ",
    "url": "https://www.politico.eu/article/china-behind-largest-ever-digital-influence-operation-says-meta/"
  },
  {
    "text": "Old Clip Shows Vivek Ramaswamy Asking Candidate Question That Now Applies To Self  —  Video from 2003 shows 18-year-old Ramaswamy asking the Rev. Al Sharpton why he should vote for an inexperienced politician.  —  LOADING  —  Vivek Ramaswamy once asked a rather prescient question that applies to himself today.",
    "url": "https://www.huffpost.com/entry/vivek-ramaswamy-al-sharpton-inexperienced-politician_n_64edc0bce4b0e32801d610e3"
  },
  {
    "text": "Playbook: A first look at the big new Biden book  —  Presented by With help from Eli Okun and Garrett Ross  —  DRIVING THE DAY  —  IDALIA LATEST — From the National Hurricane Center's 5 a.m. update: “IDALIA NOW A HURRICANE ... EXPECTED TO RAPIDLY INTENSIFY INTO AN EXTREMELY DANGEROUS MAJOR HURRICANE BEFORE LANDFALL ON WEDNESDAY.”",
    "url": "https://www.politico.com/newsletters/playbook/2023/08/29/a-first-look-at-the-big-new-biden-book-00113271"
  },
  {
    "text": "Faculty member shot and killed in a campus building, says University of North Carolina official  —  A University of North Carolina faculty member was shot and killed in a campus building, officials said Monday.  A suspect was arrested about an hour and a half after shots were reported … ",
    "url": "https://apnews.com/article/university-north-carolina-chapel-hill-shooting-9a264145d183eeb7c28bb7d6a467ab39"
  },
  {
    "text": "Job openings fall to lowest level in more than two years  —  The number of job openings in the United States decreased to 8.8 million in July, the lowest level it has been in more than two years.  —  The new numbers, which look at openings across all sectors for that month … ",
    "url": "https://www.washingtonexaminer.com/policy/economy/job-openings-fall-lowest-two-years"
  },
  {
    "text": "EXCLUSIVE: Eminem sends Vivek Ramaswamy a cease and desist letter demanding he stop rapping his music on the campaign trail  — Rapper Eminem has objected to Republican candidate Vivek Ramaswamy using his music on the campaign trail, DailyMail.com can exclusively report",
    "url": "https://www.dailymail.co.uk/news/article-12453955/Im-REAL-Slim-Shady-Eminem-sends-skinny-Vivek-Ramaswamy-cease-desist-letter-demanding-stop-rapping-music-campaign-trail.html"
  },
  {
    "text": "More than 60 people arrested at a gay wedding in southern Nigeria  —  Arrests of gay people are common in Nigeria, where the Same Sex Marriage Prohibition Act carries up to 10 years in jail for gay individuals.  —  ABUJA, Nigeria — Police in Nigeria said Tuesday they detained … ",
    "url": "https://www.nbcnews.com/nbc-out/out-news/60-people-arrested-gay-wedding-southern-nigeria-rcna102302"
  },
  {
    "text": "The chaos in Florida school libraries  —  For months, districts across Florida have purged books with LGBTQ characters and themes from school libraries.  The removal of these books followed the passage of the Parental Rights in Education Act in 2022, a bill championed by Governor Ron DeSantis … ",
    "url": "https://popular.info/p/the-chaos-in-florida-school-libraries"
  },
  {
    "text": "The Final Days  —  Joe Biden was determined to get out of Afghanistan—no matter the cost.  —  august is the month when oppressive humidity causes the mass evacuation of official Washington.  In 2021, White House Press Secretary Jen Psaki piled her family into the car for a week at the beach.",
    "url": "https://www.theatlantic.com/magazine/archive/2023/10/afghanistan-withdrawal-biden-decision/675116/"
  },
  {
    "text": "How Vivek Ramaswamy makes money from climate denial  —  At Wednesday's debate, Ramaswamy said he was the “only candidate who's not bought and paid for.”  That couldn't be further from the truth.  —  At the first Republican presidential debate last week, most of the candidates struggled … ",
    "url": "https://heated.world/p/how-vivek-ramaswamy-makes-money-from"
  },
  {
    "text": "Open Letter to the President & Congressional Leaders from Concerned Business Leaders Regarding the Asylum-Seekers Humanitarian Crisis  —  Dear President Biden and Congressional Leaders:  —  The New York business community is deeply concerned about the humanitarian crisis that has resulted … ",
    "url": "https://pfnyc.org/news/open-letter-to-the-president-congressional-leaders-from-concerned-business-leaders-regarding-the-asylum-seekers-humanitarian-crisis/"
  },
  {
    "text": "Final Say  —  TEHRAN - In Last July, the Tehran Times exclusively reported that former U.S. envoy for Iran Rob Malley got his security clearance suspended on April 21.  The Tehran Times now can reveal that Malley breached three U.S. national security rules.",
    "url": "https://www.tehrantimes.com/news/488429/Final-Say"
  },
  {
    "text": "Pope Francis blasts US Catholics for ‘reactionary’ views  —  Pope Francis criticized the state of the Catholic Church in the United States, calling it “reactionary” in recent comments during a closed-door meeting with members of the Jesuit religious order in Portugal.",
    "url": "https://www.washingtonexaminer.com/news/pope-francis-blasts-u-s-catholics-reactionary-views"
  },
  {
    "text": "Inside Matt Schlapp's Offer to Settle the Sexual Battery Lawsuit Against Him  —  American Conservative Union chairman Matt Schlapp has maintained that the sexual battery allegations against him are untrue.  But he's also offered to settle, sources say.",
    "url": "https://www.thedailybeast.com/inside-matt-schlapps-offer-to-settle-the-sexual-battery-lawsuit-against-him"
  }
]