[
  {
    "text": "JD Vance Says Trump's Comments About Kamala Harris' Racial Identity Were ‘Hysterical’  —  “I think he pointed out the fundamental chameleon-like nature of Kamala Harris,” Vance told reporters on his plane.  — Copy  —  PHOENIX — Sen. JD Vance told reporters it's “hysterical how much the media … ",
    "url": "https://www.notus.org/trump-2024/jd-vance-kamala-harris-race"
  },
  {
    "text": "Trump and his allies had a plan for how to hit Harris.  Then he opened his mouth.  —  “He's grasping around,” said Chuck Coughlin, an Arizona-based political strategist.  —  Scrambling to put an end to Kamala Harris' ascent, Donald Trump's campaign and outside allies came up with a plan … ",
    "url": "https://www.politico.com/news/2024/08/01/donald-trump-kamala-harris-attack-plan-00172178"
  },
  {
    "text": "Republicans reel at Trump's “embarrassing” remarks about Harris … - “It was awful,” one House Republican said of the interview, telling Axios it raised concerns about whether Trump can contain his impulses while running against the first woman, Black and Asian American vice president.",
    "url": "https://www.axios.com/2024/07/31/house-senate-republicans-trump-nabj-interview"
  },
  {
    "text": "What polling shows about the top VP contenders for Kamala Harris  —  As Vice President Kamala Harris prepares to announce her running mate, a new poll from The Associated Press-NORC Center for Public Affairs Research finds that several of the top contenders for the role are largely unknown to Americans.",
    "url": "https://apnews.com/article/harris-shapiro-kelly-beshear-walz-vp-democrats-d01c79817844b66c5bf466a1cd403c50"
  },
  {
    "text": "Trump's usual sexist sneers don't work against Harris - and to top it off, she's laughing at him  —  Younger, slicker and more telegenic than her rival, the Democratic candidate really might just beat him  —  A funny thing happened in the hours after the exit of Joe Biden from the US presidential race … ",
    "url": "https://www.theguardian.com/commentisfree/article/2024/aug/01/kamala-harris-donald-trump-democrat-candidate"
  },
  {
    "text": "JD Vance Insists He Has Trump's Confidence  —  In an interview with NOTUS, the GOP vice presidential candidate pressed to move on from the last week and spelled out how he'd be different from Mike Pence.  — Copy  —  OVER ARIZONA — JD Vance is downplaying how rocky his first days … ",
    "url": "https://www.notus.org/trump-2024/jd-vance-interview-trump"
  },
  {
    "text": "Trump Goes Full Racist In Front Of Black Journalists  —  This is your TPM evening briefing.  —  Shortly after President Joe Biden dropped out of the presidential race and endorsed Vice President Kamala Harris as his pick for Democratic nominee, Republican leadership in Congress quickly put … ",
    "url": "https://talkingpointsmemo.com/where-things-stand/trump-goes-full-racist-in-front-of-black-journalists"
  },
  {
    "text": "Trump's new birtherism  —  Donald Trump's audacious lie about Vice President Kamala Harris' race confirmed what many had long suspected: running against a Black woman could summon the former president's worst impulses. … - In one fell swoop, Trump hijacked a news cycle dominated … ",
    "url": "https://www.axios.com/2024/08/01/trump-kamala-harris-black-birtherism"
  },
  {
    "text": "Playbook: So much for the ‘new’ Trump  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  FIRST IN PLAYBOOK — A new round of surveys from GOP pollster Public Opinion Strategies, conducted for the Competitiveness Coalition, finds a tight presidential race in five battleground states:",
    "url": "https://www.politico.com/newsletters/playbook/2024/08/01/so-much-for-the-new-trump-00172219"
  },
  {
    "text": "US Reporter to Be Freed by Russia in Major Prisoner Swap  — Wall Street Journal reporter Gershkovich to be let go in deal  — US, Russia had held extensive talks on prisoner exchange  —  Russia is releasing Wall Street Journal reporter Evan Gershkovich and former US Marine Paul Whelan … ",
    "url": "https://www.bloomberg.com/news/articles/2024-08-01/us-reporter-released-by-russia-in-multi-country-prisoner-swap"
  },
  {
    "text": "Plea Agreements Reached with 9/11 Defendants Khalid Shaikh Mohammad, Walid Bin 'Attash and Mustafa al Hawsawi  —  The Convening Authority for Military Commissions, Susan Escallier, has entered into pretrial agreements with Khalid Shaikh Mohammad, Walid Muhammad Salih Mubarak Bin 'Attash … ",
    "url": "https://www.defense.gov/News/Releases/Release/Article/3857257/plea-agreements-reached-with-911-defendants-khalid-shaikh-mohammad-walid-bin-at/"
  },
  {
    "text": "Trump Allies Believe Kellyanne Conway Is Badmouthing JD Vance  —  DONALD TRUMP'S 2024 PRESIDENTIAL CAMPAIGN is facing its biggest stress-test yet.  And already the pressure is widening subterranean cracks of mistrust and rivalry.  —  The fault lines emerged rapidly as Trump's VP pick … ",
    "url": "https://www.thebulwark.com/p/trump-allies-kellyanne-conway-badmouthing-vance"
  },
  {
    "text": "Why Tim Walz's progressive support is great for Democrats  —  Also: Trump's racist self-immolation in front of Black journalists. … Two weeks ago, Minnesota Gov. Tim Walz was largely unknown nationally.  Today, he's a widely beloved Democratic figure and a leading candidate to become Kamala Harris's running mate.",
    "url": "https://www.publicnotice.co/p/tim-walz-kamala-harris-progressive-support-dems"
  },
  {
    "text": "First, Murdoch papers targeted me.  Now there is evidence they falsely implicated me in a cover-up  —  Asked why millions of News Group emails were deleted, Washington Post publisher Will Lewis pointed the finger at me  —  Blazoned across the top of every edition of the Washington Post is the statement “Democracy dies in darkness”.",
    "url": "https://www.theguardian.com/commentisfree/article/2024/jul/31/gordon-brown-tom-watson-news-international-william-lewis-rupert-murdoch"
  },
  {
    "text": "The truth about “migrant crime” during the Trump administration  —  “Our crime rate is going up while crime statistics all over the world are plunging,” Trump told the crowd at the Turning Point Action Conference last week in West Palm Beach, Florida.  “We have a new form of crime.  It's called migrant crime.”",
    "url": "https://popular.info/p/the-truth-about-migrant-crime-during"
  },
  {
    "text": "New Louisiana Law Serves as a Warning to Bystanders Who Film Police: Stay Away or Face Arrest  —  Louisiana is the fourth state to enact a so-called police buffer law, which allows officers to order people to keep their distance.  Journalists say the law will make it harder to document when police use excessive force.",
    "url": "https://www.propublica.org/article/louisiana-police-buffer-law"
  },
  {
    "text": "Rudy Giuliani agrees to deal to end his bankruptcy case, pay creditors' financial adviser $400k  —  Rudy Giuliani has agreed to a last-minute deal to end his personal bankruptcy case and pay about $400,000 to a financial adviser hired by his creditors, avoiding a potential deep-dive into the former … ",
    "url": "https://apnews.com/article/giuliani-bankruptcy-freeman-moss-2020-election-f290be562d8ace055950a1d1768c9bfc"
  },
  {
    "text": "GOP Lawmakers Don't Know How Trump's ‘Mass Deportation’ Policy Would Work.  They're Still On Board.  —  When NOTUS asked Rep. Troy Nehls how the government would deport potentially millions of undocumented immigrants, Nehls had a simple answer: “One at a time.”  — Copy",
    "url": "https://www.notus.org/congress/gop-lawmakers-trump-mass-deportation"
  },
  {
    "text": "'It's very intense': The vice presidential vetting process, from those who have been vetted  —  WASHINGTON - So you want to be vice president?  Prepare for one of the most invasive reviews of your personal life in American politics.  —  Before they can be selected as a running mate … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/08/01/harris-vp-vetting-process/74545420007/"
  }
]