[
  {
    "text": "All Bets Are Off  —  In Joseph O'Neill's first essay in our pages, he warned readers that “the Republican Party enjoyed a mystifying presumption of legitimacy,” contrasted with “the curious timidity of Democrats.”  In that instance, he was describing the 2000 presidential election fiasco in Florida … ",
    "url": "https://www.nybooks.com/online/2024/11/09/all-bets-are-off-joseph-oneill/"
  },
  {
    "text": "Nancy Pelosi Insists the Election Was Not a Rebuke of the Democrats  —  Devin Oktar Yalkin for The New York Times  —  Perhaps no Democratic politician has been a greater antagonist to Donald Trump than Nancy Pelosi.  As the House minority leader and then speaker of the House during Trump's first term … ",
    "url": "https://www.nytimes.com/2024/11/09/magazine/nancy-pelosi-election-interview.html?unlocked_article_code=1.Yk4._9vw.RdeZCVe4PD4f&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "I spent hours trying to persuade US voters to choose Harris not Trump.  I know why she lost  —  As a phone bank volunteer, I hoped to counter the Republican attacks and half-truths, but people really believed them  —  It has been an extraordinary week for US politics … ",
    "url": "https://www.theguardian.com/commentisfree/2024/nov/09/us-voters-kamala-harris-donald-trump-republican"
  },
  {
    "text": "Why Did Trump Win?  These Dems Have Discovered a Very Disturbing Answer … There are 1,000 convoluted theories floating around on social media that purport to explain why Donald Trump won the presidential race.  But some Democrats and people on Kamala Harris's campaign have concluded … ",
    "url": "https://newrepublic.com/article/188238/trump-won-voter-perception-2024"
  },
  {
    "text": "Trump Holds Up Transition Process Over Ethics Code  —  President-elect Donald J. Trump has not submitted a required ethics plan stating he will avoid conflicts of interest.  —  President-elect Donald J. Trump has not yet submitted a legally required ethics pledge stating that he will avoid conflicts … ",
    "url": "https://www.nytimes.com/2024/11/09/us/politics/donald-trump-ethics-transition.html?unlocked_article_code=1.Yk4.DzTR.8JtbY6Vn50_a&smid=url-share"
  },
  {
    "text": "Playbook: The ‘deep state’ prepares to get Trumped  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  CALLED OVERNIGHT — DONALD TRUMP wins Nevada.  Sen. JACKY ROSEN (D-Nev.) wins reelection, as do Reps. DON BACON (R-Neb.) and ANDREA SALINAS (D-Ore.).",
    "url": "https://www.politico.com/newsletters/playbook/2024/11/09/the-deep-state-prepares-to-get-trumped-00188605"
  },
  {
    "text": "Arizona Elections Signal Robust Immigration Enforcement Under Trump  —  Along with a state ballot initiative to empower local officials on immigration, voters in the largest county elected a sheriff following in the footsteps of the notorious Joe Arpaio.",
    "url": "https://www.bloomberg.com/news/articles/2024-11-09/in-arizona-voters-elect-sheriff-arpaio-deputy-pass-immigration-ballot-measure"
  },
  {
    "text": "Trump's win was real but not a landslide.  Here's where it ranks  —  A version of this story appeared in CNN's What Matters newsletter.  To get it in your inbox, sign up for free here.  —  ► It's a comeback for the ages for a president to go from a pariah after trying to overturn one election to president-elect after the next.",
    "url": "https://www.cnn.com/2024/11/09/politics/donald-trump-election-what-matters/"
  },
  {
    "text": "Justice Dept. to focus on ‘most egregious’ Jan. 6 cases until Trump is inaugurated  —  President-elect Donald Trump has said he would “absolutely” consider pardoning every Capitol rioter and has called them political prisoners and “hostages.”  —  WASHINGTON — The Justice Department plans … ",
    "url": "https://www.nbcnews.com/politics/2024-election/jan-6-cases-what-happens-focus-felony-rioters-trump-election-rcna175386"
  },
  {
    "text": "How blue states are plotting to thwart Trump  —  They're prepping lawsuits and legislation to stymie the incoming administration.  —  Donald Trump pledged in one of his final campaign speeches to work with Democratic mayors and governors if reelected.  But just hours after the former president … ",
    "url": "https://www.politico.com/news/2024/11/08/blue-states-democrats-trump-resistance-00188493"
  },
  {
    "text": "Conservatives weigh potential show of opposition against Johnson  —  House Republicans are holding their leadership elections next week, where Mike Johnson is largely expected to earn the speakership nomination.  —  Even as Republicans are increasingly optimistic that they'll keep control of the House … ",
    "url": "https://www.politico.com/news/2024/11/09/conservatives-opposition-johnson-00188615"
  },
  {
    "text": "Trump, Who Was Charged with Mishandling Secrets, Will Get Classified Briefings Again  —  Two years ago, the FBI raided Donald Trump's home to retrieve government records he had refused to return, including hundreds containing classified information.  The indictment that followed alleged … ",
    "url": "https://time.com/7174648/donald-trump-classified-documents/"
  },
  {
    "text": "Trump has shaped the Supreme Court, but it could still hinder his agenda  —  Although the court has three Trump appointees as part of its 6-3 conservative majority, it has not always ruled for him and could push back on expansive uses of executive power.  —  WASHINGTON — President-elect … ",
    "url": "https://www.nbcnews.com/politics/2024-election/trump-shaped-supreme-court-still-hinder-agenda-rcna179288"
  },
  {
    "text": "Authoritarians like Trump love fear, defeatism, surrender.  Do not give them what they want  —  We must lay up our supplies - of love, care, trust, community and resolve - so we may resist the storm  —  Here we are in a crisis in which almost everything we love is going to be under siege … ",
    "url": "https://www.theguardian.com/world/2024/nov/09/authoritarians-like-trump-love-fear-defeatism-surrender-do-not-give-them-what-they-want"
  },
  {
    "text": "November 8, 2024  —  Social media has been flooded today with stories of Trump voters who are shocked to learn that tariffs will raise consumer prices as reporters are covering that information.  Daniel Laguna of LevelUp warned that Trump's proposed 60% tariff on Chinese imports could raise … ",
    "url": "https://heathercoxrichardson.substack.com/p/november-8-2024"
  },
  {
    "text": "Cuban implies Trump's tariff threat having negative impact ‘right now’  —  Billionaire and former Harris campaign surrogate Mark Cuban warned of the negative impact of President-elect Trump's tariff plans, which include a general tariff on imported goods and an additional tariff specific … ",
    "url": "https://thehill.com/business/4982216-cuban-implies-trumps-tariff-threat-already-having-effect/"
  },
  {
    "text": "Smile, Flatter and Barter: How the World Is Prepping for Trump Part II  —  Foreign leaders have rushed to ingratiate themselves with Donald J. Trump in recent days, nervously recalling the clashes, insults and feuds of his first presidency.  —  When Prime Minister Keir Starmer met Donald J … ",
    "url": "https://www.nytimes.com/2024/11/09/world/europe/trump-presidency-global-reaction.html?unlocked_article_code=1.Yk4.0cgS.Q77t6UvItbzh&smid=url-share"
  },
  {
    "text": "Democratic US Sen. Jacky Rosen is reelected in Nevada, securing battleground seat  —  Nevada Democratic Sen. Jacky Rosen won reelection, beating Republican Sam Brown in a tight but unusually quiet race for the battleground state.  Rosen, a first-term senator, campaigned on abortion rights … ",
    "url": "https://apnews.com/article/nevada-senate-election-race-2024-f6646cfc6bdfb00d78897322cd25ae44"
  }
]