[
  {
    "text": "MAYOR RAS J. BARAKA'S STATEMENT ON ICE RAID ON NEWARK BUSINESS ESTABLISHMENT  —  “Today, U.S. Immigration and Customs Enforcement (ICE) agents raided a local establishment in the City of Newark, detaining undocumented residents as well as citizens, without producing a warrant.",
    "url": "https://www.newarknj.gov/news/mayor-ras-j-barakas-statement-on-ice-raid-on-newark-business-establishment"
  },
  {
    "text": "Newark mayor: ICE raided business without a warrant, detained U.S. citizens  —  U.S. Immigration and Customs Enforcement agents carried out a raid on a Newark business Thursday, detaining non-citizens and citizens alike, according to Mayor Ras J. Baraka.  —  The incident, which could not immediately … ",
    "url": "https://www.nj.com/essex/2025/01/newark-mayor-ice-raided-business-without-a-warrant-detained-us-citizens.html"
  },
  {
    "text": "The Border Debate Is Over.  Dems Lost.  —  ONE OF MY FAVORITE nuggets about immigration (yes, I have favorite immigration trivia) is about the timeline for the creation of the Department of Homeland Security (DHS), Immigration and Customs Enforcement (ICE), and Customs and Border Protection (CBP).",
    "url": "https://www.thebulwark.com/p/democrats-lost-border-debate-immigration-trump-miller"
  },
  {
    "text": "Trump Officials Move to Quickly Expel Migrants Biden Allowed In Temporarily  —  A memo appears to allow Immigration and Customs Enforcement officers to target programs that let in more than a million people.  —  The Trump administration is giving Immigration and Customs Enforcement officers … ",
    "url": "https://www.nytimes.com/2025/01/23/us/politics/trump-immigrants-deportation.html?unlocked_article_code=1.rk4.jkfQ.TGWT4A93zYdo&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Experts saw Samoa's plunging vaccination rates as a crisis.  RFK Jr. saw an opportunity.  —  New details show how Robert F. Kennedy Jr., then chair of an anti-vaccine group and now Trump's pick for health secretary, sought to exploit a deadly vaccine accident.",
    "url": "https://www.nbcnews.com/news/us-news/rfk-jr-samoa-measles-vaccine-crisis-rcna187787"
  },
  {
    "text": "RFK Jr.'s allies have a plan to upend childhood vaccination  —  Robert F. Kennedy's Jr. advisers are sparring over how far he should go on vaccines as health secretary.  —  Top advisers to Robert F. Kennedy Jr. are battling over how aggressively to target vaccines during his first days … ",
    "url": "https://www.politico.com/news/2025/01/24/rfk-jr-allies-child-vaccinations-00200364"
  },
  {
    "text": "Donald Trump is not waiting for RFK Jr. — he has already started his war on public health  —  RFK's hearing hasn't even started yet and the White House has already attacked vaccines, birth control and the WHO  —  Robert Kennedy's Senate hearing to review his nomination to head Health and Human Services … ",
    "url": "https://www.salon.com/2025/01/24/donald-is-not-waiting-for-rfk-jr--he-has-already-started-his-on-public-health/"
  },
  {
    "text": "Trump's Plan to Crush the Academic Left  —  Last year, Chris Rufo, the influential right-wing strategist who spearheaded the campaign against diversity, equity and inclusion, or D.E.I., initiatives, told me about his ambitions for a second Trump presidency.  He hoped, he said … ",
    "url": "https://www.nytimes.com/2025/01/24/opinion/trump-dei-education-harvard.html?unlocked_article_code=1.rk4.tqup.HyOsQkRyhSgl&smid=url-share"
  },
  {
    "text": "Rutgers Center Cancels Conference in Response to Trump DEI Orders  —  The Rutgers University Center for Minority Serving Institutions announced Thursday that it has canceled an upcoming virtual conference about registered apprenticeship programs as a result of President Trump's executive … ",
    "url": "https://www.insidehighered.com/news/quick-takes/2025/01/24/rutgers-cancels-hbcu-event-align-trump-dei-orders"
  },
  {
    "text": "Trump Says States Should Manage Disasters.  Former FEMA Leaders Agree.  —  “I'd rather see the states take care of their own problems,” the president said.  Federal emergency managers from both parties have made the same argument.  —  President Trump plans to tour damage on Friday … ",
    "url": "https://www.nytimes.com/2025/01/24/climate/trump-says-states-should-manage-disasters-former-fema-leaders-agree.html"
  },
  {
    "text": "Wall Street Journal knocks Trump for leaving former aides unprotected  —  The editorial board of the Wall Street Journal is blasting President Trump over a decision to revoke the security details from former top aides to his first administration.  —  “The possibility of falling … ",
    "url": "https://thehill.com/homenews/media/5104723-trump-revokes-security-details/"
  },
  {
    "text": "Elon Musk doesn't deserve the benefit of the doubt  —  Since Donald Trump's rise to power, some liberals have developed a bad habit of seeing secret Nazi imagery everywhere on the right.  —  Be it Laura Ingraham allegedly sieg-heiling at the 2016 Republican National Convention … ",
    "url": "https://www.vox.com/politics/396535/elon-musk-nazi-salute-trump-inauguration"
  },
  {
    "text": "Paul Krugman on Leaving the New York Times  —  The paper wanted to take away his newsletter or make him write less frequently, he says.  —  For two and a half decades, Paul Krugman's columns in the New York Times were beacons of intelligence and common sense.",
    "url": "https://www.cjr.org/analysis/paul-krugman-leaving-new-york-times-heavy-hand-editing-less-frequent-columns-newsletter.php"
  },
  {
    "text": "New GOP bill would let Trump (but not Obama) run for a third term  —  Rep. Andy Ogles' bill to amend the Constitution and empower Donald Trump to seek a third term will inevitably fail.  That doesn't mean it's irrelevant.  —  About a week after Donald Trump was elected to a second term … ",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/new-gop-bill-let-trump-not-obama-run-third-term-rcna189099"
  },
  {
    "text": "There Is No Resistance  —  To see how far the lines of normal have moved since President Donald Trump freed the January 6ers, briefly return to the closing days of the 2024 presidential campaign.  At the time, a hot issue was whether Trump harbored fascist tendencies, as some of his former aides alleged.",
    "url": "https://www.theatlantic.com/politics/archive/2025/01/republicans-rationalization-trump-pardons/681433/"
  },
  {
    "text": "White House says migrant deportation flights with military aircraft have begun  —  The Trump administration has started flying immigrants who entered the U.S. illegally out of the country using military aircraft, a White House spokesperson said Friday.  —  White House press secretary Karoline … ",
    "url": "https://thehill.com/homenews/administration/5104685-migrant-deportation-military-aircraft/"
  },
  {
    "text": "Trump staff ‘furious’ after Musk trashes AI project  —  “It's clear he has abused the proximity to the president,” said one ally of the president.  —  Some of President Donald Trump's key aides and allies are furious with Elon Musk for publicly trashing his $500 billion artificial intelligence mega-deal.",
    "url": "https://www.politico.com/news/2025/01/23/trump-staff-musk-conflict-00200311"
  },
  {
    "text": "“A pact with the devil”  —  Donald Trump now has many of the country's richest and most powerful executives explicitly on his side.  That was evident this week as Elon Musk, Mark Zuckerberg, Jeff Bezos, Google CEO Sundar Pichai, TikTiok CEO Shou Chew, and OpenAI CEO Sam Altman all had prime spots … ",
    "url": "https://www.publicnotice.co/p/david-de-jong-nazi-interview-trump-musk"
  },
  {
    "text": "Sensing Political Support, Abortion Opponents Raise Ambitions  —  The March for Life on Friday will bring together a movement invigorated by some early moves of the second Trump administration.  —  Anti-abortion activists are charging ahead with their ultimate mission to end all abortions nationwide … ",
    "url": "https://www.nytimes.com/2025/01/24/us/abortion-march-for-life.html"
  },
  {
    "text": "Trump enlists attorney general to investigate Biden administration  —  President has thrown weight of justice department behind two politically charged reviews into his personal grievances  —  Donald Trump has tasked the attorney general in two executive orders to conduct far-reaching investigations … ",
    "url": "https://www.theguardian.com/us-news/2025/jan/24/trump-executive-orders-justice-department"
  },
  {
    "text": "Instagram and Facebook Blocked and Hid Abortion Pill Providers' Posts  —  Some posts related to obtaining abortion pills were recently hidden on Instagram and Facebook and some accounts were suspended, before being later restored.  —  Instagram and Facebook have recently blurred … ",
    "url": "https://www.nytimes.com/2025/01/23/technology/instagram-facebook-abortion-pill-providers.html?unlocked_article_code=1.rk4.o9WP.YpCM4kgrojZx&smid=tw-share"
  },
  {
    "text": "Judge bars Rhodes, other Oath Keepers from entering DC without court permission  —  A federal judge on Friday barred Oath Keepers founder Stewart Rhodes and seven other members of the right-wing extremist group from entering Washington, D.C., without the court's permission … ",
    "url": "https://thehill.com/regulation/court-battles/5104820-federal-judge-bars-oath-keepers-washington-dc-capitol/"
  },
  {
    "text": "Trump: Zelensky 'shouldn't have allowed' war with Russia to happen  —  President Trump suggested Friday that Ukrainian President Volodymyr Zelensky bore some responsibility for the war that began almost three years ago with Russia's invasion.  —  “Zelenskyy, I will say this, he wants to settle now.",
    "url": "https://thehill.com/policy/international/5104739-trump-zelensky-shouldnt-have-allowed-war-with-russia-to-happen/"
  },
  {
    "text": "“Excluding Indians”: Trump admin questions Native Americans' birthright citizenship in court  —  The Trump admin is leaning on a pre-14th Amendment law in its fight to redefine birthright citizenship  —  In the Trump administration's arguments defending his order to suspend birthright citizenship … ",
    "url": "https://www.salon.com/2025/01/23/excluding-indians-admin-questions-native-americans-birthright-citizenship-in/"
  },
  {
    "text": "Women, gays, transgender and queer Americans serve in the military because men won't  —  When I worked on the 1st Marine Division's staff back from 2004-2007, I was part of a team that had to “find” officers and senior enlisted Marines to send to Iraq.  Later, I was part of a team … ",
    "url": "https://thehill.com/opinion/5104066-military-recruitment-issues/"
  },
  {
    "text": "Orbán's new threat: I'll end Russia sanctions unless Ukraine pumps Putin's gas  —  But diplomats still expect the Hungarian prime minister to ultimately back down, perhaps as soon as Monday.  —  Hungary again delayed the renewal of the EU's Russia sanctions on Friday … ",
    "url": "https://www.politico.eu/article/hungary-viktor-orban-threat-sanction-russia-ukraine-putin-gas/"
  },
  {
    "text": "DOJ orders federally funded legal service providers to stop providing support at immigration courts  —  Legal service providers help individuals navigate immigration court proceedings.  —  The seal of the U.S. Justice Department is seen on the podium in the Department's headquarters briefing room … ",
    "url": "https://abcnews.go.com/US/doj-orders-federally-funded-legal-service-providers-stop/story?id=118027656"
  },
  {
    "text": "How Trump Will Fail  —  After a four-year hiatus, we are once again compelled to go spelunking into the deeper caverns of Donald Trump's brain.  We climb under his ego, which interestingly makes up 87 percent of his neural tissue; we burrow beneath the nucleus accumbens … ",
    "url": "https://www.nytimes.com/2025/01/23/opinion/trump-mckinley-populism.html?unlocked_article_code=1.rk4.Afzz.Oj-y5zfRbfzZ&smid=re-nytopinion"
  },
  {
    "text": "Trump's budget pick, Russ Vought, is starting to upend Washington  —  The president's nominee for the Office of Management and Budget aims to slash spending and regulation — and push the limits of presidential power to achieve Trump's agenda.  —  Even before he takes the reins … ",
    "url": "https://www.washingtonpost.com/business/2025/01/24/russell-vought-trump-budget/"
  }
]