[
  {
    "text": "Trump fires labor statistics boss hours after weak jobs report  —  The president implied that the BLS commissioner, longtime federal employee Erika McEntarfer, manipulated the data “for political purposes.”  —  President Donald Trump on Friday ordered the firing of the head of the Bureau … ",
    "url": "https://www.nbcnews.com/business/economy/trump-orders-firing-bls-commissioner-weak-jobs-report-rcna222531"
  },
  {
    "text": "Statement on Commissioner McEntarfer's Removal  —  Today, President Trump called into question the integrity of the Employment Situation report that the BLS released this morning.  He accused BLS Commissioner Erika McEntarfer of deliberately reporting false numbers to reflect poorly on this administration.",
    "url": "https://www.friendsofbls.org/updates/2025/8/1/statement-on-commissioner-mcentarfers-removal"
  },
  {
    "text": "Trump fires commissioner of labor statistics to be fired after weaker-than-expected jobs figures slam markets  —  President Donald Trump on Friday fired the Bureau of Labor Statistics commissioner, hours after the agency reported that job growth in the U.S. had slowed to a near-halt.",
    "url": "https://www.cnbc.com/2025/08/01/trump-erika-mcentarfer-jobs-report-fired.html"
  },
  {
    "text": "Trump Fires Labor Statistics Head, Prompting Concerns About Data  —  President Donald Trump fired the head of the Bureau of Labor Statistics hours after a report showed weak job growth, prompting outcries from economists and policymakers over the integrity of the data going forward.",
    "url": "https://www.bloomberg.com/news/articles/2025-08-01/trump-says-he-ll-fire-labor-statistics-head-after-weak-jobs-data?accessToken=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzb3VyY2UiOiJTdWJzY3JpYmVyR2lmdGVkQXJ0aWNsZSIsImlhdCI6MTc1NDA3NDM2MSwiZXhwIjoxNzU0Njc5MTYxLCJhcnRpY2xlSWQiOiJUMEJSTUFHUTdMSkYwMCIsImJjb25uZWN0SWQiOiI2NjMxNUMzNzNDNzE0NzFGQkU1ODZBQjMzQ0JERDc0RCJ9.e3rVAaqzqse7-37uRxQ2TeaQ375p_eZty8vdi10OD7Q"
  },
  {
    "text": "Caracas on the Potomac  —  What I wrote just before Trump took office  —  If stagflation breaks out under an authoritarian regime, but officials aren't allowed to report the numbers, did it make a sound?  —  Over the past six months we've watched institution after institution corrupted by the Trump administration.",
    "url": "https://paulkrugman.substack.com/p/caracas-on-the-potomac"
  },
  {
    "text": "Trump says he will fire labor statistics chief after weak jobs report  —  President Trump said he will fire the commissioner of the Bureau of Labor Statistics after the independent government agency reported weak jobs numbers for July and the preceding month.",
    "url": "https://www.axios.com/2025/08/01/trump-jobs-labor-statistics"
  },
  {
    "text": "EXCLUSIVE: Someone Waived Ghislaine Maxwell's Sex Offender Status to Move Her to a Minimum Security Camp in Texas  —  About an hour ago, CNN and NBC reported that Ghislaine Maxwell was moved to a minimum security camp in Texas.  —  According to sources who have spoken on the condition of anonymity … ",
    "url": "https://www.muellershewrote.com/p/exclusive-someone-waived-ghislaine"
  },
  {
    "text": "Comer says he will postpone Ghislaine Maxwell testimony  —  The scheduled congressional deposition of Ghislaine Maxwell, a co-conspirator of convicted sex offender Jeffrey Epstein, is indefinitely postponed, House Oversight Chair James Comer said Friday.  In a letter to Maxwell … ",
    "url": "https://www.politico.com/live-updates/2025/08/01/congress/maxwell-hearing-postponed-00489019"
  },
  {
    "text": "Republican-led House committee postpones Ghislaine Maxwell deposition  —  Rep. James Comer, chair of the House Oversight Committee, indicated that next steps will be determined after the Supreme Court decides whether to review Maxwell's appeal.  —  Congressional testimony … ",
    "url": "https://www.nbcnews.com/politics/congress/house-oversight-committee-postpones-ghislaine-maxwell-deposition-rcna222571"
  },
  {
    "text": "Corporation for Public Broadcasting Addresses Operations Following Loss of Federal Funding  —  The Corporation for Public Broadcasting (CPB) announced today that it will begin an orderly wind-down of its operations following the passage of a federal rescissions package and the release … ",
    "url": "https://cpb.org/pressroom/Corporation-Public-Broadcasting-Addresses-Operations-Following-Loss-Federal-Funding"
  },
  {
    "text": "Trump Says He Ordered Subs Repositioned in Rare Nuclear Threat to Russia  —  In a social media post, the president described the move as a deterrent prompted by threats by a former Russian leader.  It is unclear if any submarines did actually change position.",
    "url": "https://www.nytimes.com/2025/08/01/us/politics/trump-nuclear-submarines-russia.html?unlocked_article_code=1.a08.pxCU.44vq5oqwJQ6O&smid=url-share"
  },
  {
    "text": "4 killed in bar shooting in Anaconda, Montana; authorities searching for suspect  —  Four people were killed in a shooting at a bar in Anaconda, Montana, on Friday, authorities said.  A suspect is at large.  —  The Montana Division of Criminal Investigation confirmed to CBS News … ",
    "url": "https://www.cbsnews.com/news/anaconda-montana-shooting/"
  },
  {
    "text": "Four people dead in Montana bar shooting, suspect at large  —  Four people are dead after a shooting at a bar in Anaconda, Montana, Friday morning, the Montana Division of Criminal Investigation said in a news release.  —  Anaconda-Deer Lodge County Law Enforcement Center said in a Facebook post … ",
    "url": "https://cnn.com/2025/08/01/us/anaconda-montana-shooting"
  },
  {
    "text": "HHS further constrains certain vaccine advisers to the CDC, limiting their input in evidence reviews  —  In a further jolt to the process of reviewing and recommending vaccines at the US Centers for Disease Control and Prevention, another group of outside advisers to the agency was abruptly sidelined this week.",
    "url": "https://cnn.com/2025/08/01/health/hhs-liaison-acip-vaccine-advisers-cdc"
  },
  {
    "text": "ChatGPT users shocked to learn their chats were in Google search results … Faced with mounting backlash, OpenAI removed a controversial ChatGPT feature that caused some users to unintentionally allow their private—and highly personal—chats to appear in search results.",
    "url": "https://arstechnica.com/tech-policy/2025/08/chatgpt-users-shocked-to-learn-their-chats-were-in-google-search-results/"
  },
  {
    "text": "Federal Reserve governor to resign early, handing Trump an immediate opening on board  —  Federal Reserve Board Governor Adriana Kugler is stepping down from Fed, creating an unexpected opening for President Trump to shape the Federal Reserve.  —  Just now",
    "url": "https://www.washingtonpost.com/business/2025/08/01/kugler-resigns-fed-trump/"
  },
  {
    "text": "Ex-Trump prosecutor Jack Smith under investigation by Office of Special Counsel after claims of playing politics: ‘No one is above the law’  —  The Office of Special Counsel has launched a formal investigation into Jack Smith, the first official legal probe into his conduct, The Post has learned.",
    "url": "https://nypost.com/2025/08/01/us-news/official-investigation-into-trump-prosecutor-jack-smith-launched/"
  },
  {
    "text": "The FBI Redacted Trump's Name in the Epstein Files  —  The bureau's FOIA team tasked with conducting a final review of the records blacked out the names before higher-ups said last month that releasing the documents ‘would not be appropriate or warranted.’ … ‘The most transparent administration in history’",
    "url": "https://www.bloomberg.com/news/newsletters/2025-08-01/epstein-files-trump-s-name-was-redacted-by-the-fbi?accessToken=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzb3VyY2UiOiJTdWJzY3JpYmVyR2lmdGVkQXJ0aWNsZSIsImlhdCI6MTc1NDA1OTE1MiwiZXhwIjoxNzU0NjYzOTUyLCJhcnRpY2xlSWQiOiJUMEJLSjNHUTdMOEUwMCIsImJjb25uZWN0SWQiOiIyQjE3NzFFOTlEODc0QzRDOTY1Njg1RTZBQkJGM0QwRCJ9.3ALPrarxmje8f879sHyUxeFbyg60ntxdgX4Ar8jOZLQ"
  },
  {
    "text": "Breaking: Supreme Court, in Order Asking for Additional Briefing in Louisiana Voting Case, Appears to Put the Constitutionality of Section 2 of the Voting Rights Act into Question  —  The Supreme Court just issued this order:  —  Louisiana had to create that second majority-minority district … ",
    "url": "https://electionlawblog.org/?p=151301"
  },
  {
    "text": "Anti-Israel NYC Councilwoman Tiffany Caban, dozens of protesters swarm Chuck Schumer, Kirsten Gillibrand's NYC offices to ‘let Gaza live’  —  Anti-Israel New York City Councilwoman Tiffany Caban was arrested along with several other protesters as scores of screaming demonstrators descended … ",
    "url": "https://nypost.com/2025/08/01/us-news/protesters-swarm-chuck-schumer-kirsten-gillibrands-nyc-offices-to-let-gaza-live/"
  }
]