[
  {
    "text": "Ex-FBI informant charged with lying about Bidens had Russian intelligence contacts, prosecutors say  —  LAS VEGAS (AP) — A former FBI informant charged with making up a multimillion-dollar bribery scheme involving President Joe Biden, his son Hunter and a Ukrainian energy company had contacts … ",
    "url": "https://apnews.com/article/hunter-biden-fbi-informant-joe-biden-ef48c7543e7a45cd3b8b671d0e2f60e5"
  },
  {
    "text": "DOJ: FBI informant said Russian intelligence involved in Hunter Biden story … - Smirnov was indicted by a federal grand jury in the Central District of California after being arrested at the Harry Reid International Airport in Las Vegas, Nevada.  — Prosecutors alleged Smirnov falsely told FBI agents … ",
    "url": "https://www.axios.com/2024/02/20/hunter-biden-fbi-informant-russian-intelligence"
  },
  {
    "text": "Playbook: The Biden impeachment's latest big blow  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  A RACE TO WATCH — JOHN AVLON, the former CNN anchor, is officially jumping into the race for New York's 1st Congressional District.",
    "url": "https://www.politico.com/newsletters/playbook/2024/02/21/the-biden-impeachments-latest-big-blow-00142385"
  },
  {
    "text": "Donald Trump says he doesn't know if he could work with Mitch McConnell if re-elected  —  The Senate GOP leader and the former president, once allies, split after the Jan. 6 attack.  —  GREENVILLE, S.C. — Former President Donald Trump said Tuesday that he was uncertain if he could work … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/donald-trump-says-doesnt-know-work-mitch-mcconnell-re-elected-rcna139677"
  },
  {
    "text": "Nex Benedict matters  —  Judd Legum, Tesnim Zekeria, and Rebecca Crosby  —  Nex Benedict, a 16-year-old Oklahoma sophomore, died on February 8.  Nex, who was non-binary, was attacked in an Owasso High School bathroom the previous day, sustaining serious head injuries.",
    "url": "https://popular.info/p/nex-benedict-matters"
  },
  {
    "text": "Letitia James says she's prepared to seize Trump's buildings if he can't pay his $354M civil fraud fine  —  The New York attorney general made the remarks in an interview with ABC News.  —  Attorney General Letitia James arrives for a press conference following a verdict … ",
    "url": "https://abcnews.go.com/US/letitia-james-shes-prepared-seize-trumps-assets-pay/story?id=107381482"
  },
  {
    "text": "Scoop: GOP privately expects government shutdown … - “People are predicting a shutdown even if it's just for a few days,” a GOP lawmaker recently told Axios.  — They're either “close to reaching a deal or it's about to blow up,” one subcommittee chair recently told a fellow House Republican.",
    "url": "https://www.axios.com/2024/02/21/republicans-government-shutdown-mike-johnson"
  },
  {
    "text": "Alito renews criticism of Supreme Court's same-sex marriage ruling in rejecting Missouri jury case  —  Supreme Court Justice Samuel Alito renewed his criticism Tuesday of the high court's landmark same-sex marriage ruling, addressing it in a five-page statement as part of an order explaining … ",
    "url": "https://thehill.com/regulation/court-battles/4479539-alito-renews-criticism-of-supreme-courts-same-sex-marriage-ruling-in-rejecting-missouri-jury-case/"
  },
  {
    "text": "Trump's G.O.P. Is a Confederacy of Fakers  —  I've got a suggestion for the next Trump-G.O.P. fund-raising scheme.  You know how sports memorabilia stores sometimes sell basketballs autographed by an entire N.B.A. team?  Well, I was imagining that Donald Trump could sell white flags at $1,000 … ",
    "url": "https://www.nytimes.com/2024/02/20/opinion/ukraine-trump-republicans.html"
  },
  {
    "text": "Donald Trump's Cash Crunch Just Got Much, Much Worse  —  New federal campaign finance filings reveal that Trump is burning through donors' funds as he struggles to fund his legal defense and his 2024 campaign.  —  As Donald Trump's legal troubles consume more and more of his time … ",
    "url": "https://www.thedailybeast.com/donald-trumps-cash-crunch-just-got-much-much-worse"
  },
  {
    "text": "The Fani Willis mess, explained  —  It ultimately serves as a reminder that the courts can't save us. … While Trump continues to face 91 criminal charges and considerable financial liabilities from his losses in civil cases, a significant sideshow has developed in Georgia.",
    "url": "https://www.publicnotice.co/p/fani-willis-mistake-nathan-wade-trump-fulton-ga"
  },
  {
    "text": "Shock, anger, confusion grip Alabama after court ruling on embryos  —  Alabama doctors are puzzled over whether they will have to make changes to in vitro fertilization procedures.  Couples have crammed into online support groups wondering if they should transfer frozen embryos out of state.",
    "url": "https://www.washingtonpost.com/nation/2024/02/20/alabama-supreme-court-ivf-embryos/"
  },
  {
    "text": "Tax records reveal the lucrative world of covid misinformation  —  Four major nonprofits that rose to prominence during the coronavirus pandemic by capitalizing on the spread of medical misinformation collectively gained more than $118 million between 2020 and 2022, enabling the organizations … ",
    "url": "https://www.washingtonpost.com/nation/2024/02/21/covid-misinformation-earnings/"
  },
  {
    "text": "Aileen Cannon Might Actually Get Herself Kicked Off the Trump Classified Docs Case  —  The recent news about possible Russian space nukes reminds us that we live in a very insecure world.  That is why perhaps none of Donald Trump's four criminal cases is more troubling than the federal prosecution brought … ",
    "url": "https://slate.com/news-and-politics/2024/02/aileen-cannon-trump-classified-disqualification.html"
  },
  {
    "text": "Biden Cancels $1.2 Billion of Federal Student Loans  — Relief benefits first 150,000 under plan announced last month  — Americans receiving debt relief will get email from Biden  —  President Joe Biden's administration announced that more than 150,000 borrowers will receive $1.2 billion … ",
    "url": "https://www.bloomberg.com/news/articles/2024-02-21/student-loan-forgiveness-biden-cancels-1-2b-of-federal-debt"
  },
  {
    "text": "Ron DeSantis ally Chris Rufo has close ties with ‘dissident right’ magazine  —  Relationship with IM-1776 that praises dictators, racist ideologues and attacks liberal democracy is collaborative and supportive  —  Chris Rufo, a rightwing culture-war celebrity and close Ron DeSantis ally … ",
    "url": "https://www.theguardian.com/world/2024/feb/21/chris-rufo-im-1776-far-right-desantis"
  },
  {
    "text": "Trump and allies plotting militarized mass deportations, detention camps  —  As president, Trump sought to use military planes and bases for deportation.  Now, he and his allies are talking about a new effort that current and former officials warn could be impractical and dangerous.",
    "url": "https://www.washingtonpost.com/politics/2024/02/20/trump-mass-deportations-immigration/"
  },
  {
    "text": "GOP chances of winning the Senate on the rise  —  Senate Republicans have seen their chances of taking the Senate majority steadily rise this year as they have expanded the battlefield, limited internal fights and recruited a set of strong candidates.  —  It's a remarkable shift from two years ago … ",
    "url": "https://thehill.com/homenews/campaign/4479501-gop-chances-of-winning-the-senate-on-the-rise/"
  },
  {
    "text": "Is the New York Times neutral on the future of democracy?  —  Does the New York Times care if democracy survives?  —  I ask this question sincerely, because the Times' political coverage sometimes makes me wonder.  —  On most subjects, the Times' values are transparent.",
    "url": "https://www.stopthepresses.news/p/is-the-new-york-times-neutral-on"
  }
]