[
  {
    "text": "The Supreme Court's ballot ruling is absurd.  They don't care.  —  There are more important things than logic and legal principles. … Last week, the Supreme Court gave Donald Trump a big assist by agreeing to hear his presidential immunity claim, dragging their feet long enough to ensure … ",
    "url": "https://www.publicnotice.co/p/scotus-ballot-ruling-trump-colorado-explained"
  },
  {
    "text": "The Supreme Court Just Erased Part of the Constitution  —  Section 3 of the 14th Amendment of the Constitution is essentially a dead letter, at least as it applies to candidates for federal office.  Under the U.S. Supreme Court's ruling that reversed the Colorado Supreme Court's decision striking Donald Trump … ",
    "url": "https://www.nytimes.com/2024/03/04/opinion/supreme-court-trump-colorado-constitution.html"
  },
  {
    "text": "Supreme Court unanimously allows Trump to remain on 2024 ballot, finds states ‘have no power’ to enforce insurrection clause — ‘especially’ as to the presidency  —  The U.S. Supreme Court on Monday ruled in a per curiam opinion that Donald Trump will remain on the presidential primary ballot in Colorado … ",
    "url": "https://lawandcrime.com/supreme-court/supreme-court-unanimously-allows-trump-to-remain-on-2024-ballot-finds-states-have-no-power-to-enforce-insurrection-clause-especially-as-to-the-presidency/"
  },
  {
    "text": "Biden's new strategy: Go for Trump's jugular … Biden has told friends he thinks Trump is wobbly, both intellectually and emotionally, and will explode if Biden mercilessly gigs and goads him — “go haywire in public,” as one adviser put it.  — Other sources tell us that Biden is looking for a fight.",
    "url": "https://www.axios.com/2024/03/05/biden-new-strategy-attack-trump-2024-election"
  },
  {
    "text": "Maddening New Poll: Voters Are Unaware of Trump “Dictator” Threats  —  President Biden's brain trust appears confident that he will ultimately prevail over Donald Trump due to the threat Trump poses to our constitutional system.  By November, the election's “focus will become overwhelmingly on democracy … ",
    "url": "https://newrepublic.com/article/179548/poll-voters-trump-dictator-threats"
  },
  {
    "text": "Do Americans Have a ‘Collective Amnesia’ About Donald Trump?  —  It's only been three years, but memories of Mr. Trump's presidency have faded and changed fast.  —  Not all that long ago, many Americans committed hours a day to tracking then-President Donald J. Trump's every move.",
    "url": "https://www.nytimes.com/2024/03/05/us/politics/trump-presidency-election-voters.html"
  },
  {
    "text": "Super Tuesday caps a strong political week for Trump  —  Good morning, Early Birds.  Today is Super Tuesday.  We hope your Tuesday is super, too.  Tips: earlytips@washpost.com.  Was this forwarded to you?  Sign up here.  Thanks for waking up with us.  —  In today's edition … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/05/super-tuesday-caps-strong-political-week-trump/"
  },
  {
    "text": "Biden to form ‘strike force’ to go after price-gouging  —  President Biden will announce Tuesday the formation of a “strike force” to hold companies accountable for price-gouging practices.  —  The announcement comes days before the State of the Union, where Biden is expected … ",
    "url": "https://thehill.com/business/4507871-biden-strike-force-price-gouging-junk-fees-inflation/"
  },
  {
    "text": "Michelle Obama's office says the former first lady ‘will not be running for president’ in 2024  —  Democrats and Republicans have mused about a Michelle Obama candidacy, albeit for different reasons.  —  WASHINGTON — Former President Barack Obama has said he's “all in” for President Joe Biden's re-election effort.",
    "url": "https://www.nbcnews.com/politics/2024-election/michelle-obama-former-first-lady-not-running-president-2024-rcna141767"
  },
  {
    "text": "Michelle Obama's office squashes talk of a White House bid: ‘She will not be running for president’  —  Michelle Obama is making it crystal clear — she's not eyeing a return to the White House with a surprise presidential bid, according to her office.  —  “As former first Lady Michelle Obama … ",
    "url": "https://thehill.com/blogs/in-the-know/4509334-michelle-obama-white-house-bid-2024/"
  },
  {
    "text": "Super Tuesday 2024: Which states are voting, the key rules to know and what's at stake  —  The first Super Tuesday polls close on the Republican side at 7 p.m. ET as voters cast ballots across the country.  —  Tuesday is the most consequential day in the race for both parties' presidential nominations … ",
    "url": "https://www.nbcnews.com/politics/2024-election/super-tuesday-which-states-vote-primary-trump-haley-biden-rcna141250"
  },
  {
    "text": "Mark Cuban Backs Biden in 2024, Urging More Action on Drug Costs  — Co-founder of Cost Plus Drugs joins White House roundtable  — Cuban backed Haley in primary but supports Biden in general",
    "url": "https://www.bloomberg.com/news/articles/2024-03-04/mark-cuban-backs-biden-over-trump-in-2024-calls-for-drug-cost-reform"
  },
  {
    "text": "Cuban says he'd vote for Biden even if ‘he was being given last rites’  —  Mark Cuban, the former owner of the Dallas Mavericks, said he would cast his vote for President Biden over former President Trump in November, even if “he was being given last rites.”",
    "url": "https://thehill.com/homenews/campaign/4508956-cuban-vote-biden-even-if-he-was-given-last-rites/"
  },
  {
    "text": "Supreme Court temporarily blocks new Texas immigration enforcement law  —  Justice Samuel Alito issued an order that puts the law on hold while the justices determine what next steps to take.  —  WASHINGTON — The Supreme Court on Monday temporarily blocked a new Texas immigration law in response to a Biden administration request.",
    "url": "https://www.nbcnews.com/politics/supreme-court/biden-administration-asks-supreme-court-block-texas-immigration-law-rcna141761"
  },
  {
    "text": "Air Force Employee Indicted for Unlawful Disclosure of Classified National Defense Information  —  For Immediate Release  —  A civilian employee of the U.S. Air Force assigned to the U.S. Strategic Command (USSTRATCOM), at Offutt Air Force Base, was arrested Saturday, March 2 … ",
    "url": "https://www.justice.gov/opa/pr/air-force-employee-indicted-unlawful-disclosure-classified-national-defense-information"
  },
  {
    "text": "Biden administration ADMITS flying 320,000 migrants secretly into the U.S. to reduce the number of crossings at the border has national security ‘vulnerabilities’  — A lawsuit reveals Biden's CBP is refusing to disclose airports where it is flying undocumented aliens from other countries",
    "url": "https://www.dailymail.co.uk/news/article-13155765/biden-illegal-migrant-flying-program-national-security-vulnerability.html"
  },
  {
    "text": "California man is first in the U.S. to be charged with smuggling greenhouse gases, prosecutors say  —  It's the first prosecution in the U.S. to include charges related to a 2020 law that prohibits the importation of hydrofluorocarbons.  —  SAN DIEGO — A Southern California man was arrested Monday … ",
    "url": "https://www.nbcnews.com/news/us-news/california-man-first-us-charged-smuggling-greenhouse-gases-prosecutors-rcna141811"
  },
  {
    "text": "“They frankly laugh behind the backs of their own voters”: How Republicans bamboozle rural whites  —  In “White Rural Rage,” Paul Waldman and Thomas Schaller reject the narrative that treats Trump voters like children  —  It's become a tedious trope, the Beltway journalist who goes … ",
    "url": "https://www.salon.com/2024/03/05/-the-media-should-stop-treating-rural-people-like-children/"
  },
  {
    "text": "Scanners that spot smuggled fentanyl at the border sit unused because Congress hasn't provided the cash to install them  —  The money to install the screeners was in the supplemental funding request Republicans blocked.  —  Customs and Border Protection has spent millions … ",
    "url": "https://www.nbcnews.com/politics/immigration/border-fentanyl-scanners-unused-congress-provided-no-money-rcna141432"
  },
  {
    "text": "Scott narrowly leads Mucarsel-Powell in Florida Senate race: Poll  —  Sen. Rick Scott (R-Fla.) is narrowly leading Democrat challenger Debbie Mucarsel-Powell by 3 points, according to a new poll.  —  A survey from the left-leaning firm Public Policy Polling, paid for by EMILY's List … ",
    "url": "https://thehill.com/homenews/4508253-scott-narrowly-leads-mucarsel-powell-in-florida-senate-race-poll/"
  }
]