[
  {
    "text": "Trump's DOJ secretly obtained records of his FBI pick Kash Patel, lawmakers, staffers and media in leak investigation  —  The Justice Department secretly obtained phone records from two members of Congress and 43 staffers - including Kash Patel, President-elect Donald Trump's pick to lead the FBI … ",
    "url": "https://www.cnn.com/2024/12/10/politics/justice-department-spying-congress-patel-trump-ig-report"
  },
  {
    "text": "FBI Director Christopher Wray preparing to resign  —  FBI Director Christopher A. Wray plans to resign on or before Inauguration Day, The Washington Times has learned.  —  Mr. Wray is calling it quits because he doesn't want to get fired by President-elect Donald Trump … ",
    "url": "https://www.washingtontimes.com/news/2024/dec/9/christopher-wray-fbi-director-preparing-resign/"
  },
  {
    "text": "Trump's DOJ secretly obtained phone and text message logs of 43 congressional staffers and 2 members of Congress  —  The Justice Department's investigation into leaks of classified information in 2017 and 2018 was far broader than previously known, according to the department's internal watchdog.",
    "url": "https://www.nbcnews.com/politics/justice-department/trumps-doj-secretly-obtained-phone-text-message-logs-43-congressional-rcna183610"
  },
  {
    "text": "Kash Patel Doesn't Belong at the FBI  —  At the NSC, he was less interested in his assigned duties than in proving his loyalty to Donald Trump.  —  The president's constitutional obligation to “take Care that the Laws be faithfully executed” requires evenhanded action in the national rather … ",
    "url": "https://www.wsj.com/opinion/kash-patel-doesnt-belong-at-the-fbi-cabinet-nominee-5ef655eb"
  },
  {
    "text": "Mitch McConnell falls during Senate Republican lunch  —  Incoming Senate GOP Leader John Thune says he's “fine.”  —  Senate Minority Leader Mitch McConnell accompanied by Senate Minority Whip John Thune takes a question from a reporter during a news conference following … ",
    "url": "https://abcnews.go.com/Politics/mitch-mcconnell-falls-senate-republican-lunch/story?id=116650005"
  },
  {
    "text": "‘Delusional’ AOC slammed for suggesting subway riders should be scared of Daniel Penny: ‘Utter stupidity’  —  Progressive Rep. Alexandria Ocasio-Cortez (D-NY) said New York City subway riders should be scared of Daniel Penny after he was found not guilty in the chokehold death of Jordan Neely … ",
    "url": "https://nypost.com/2024/12/10/us-news/aoc-suggests-subway-riders-should-be-scared-of-daniel-penny/"
  },
  {
    "text": "Manhattan DA urges judge not to toss out guilty verdict in Trump hush money case  —  Sentencing and appeals could be put on hold until after Trump leaves office, the prosecutor said.  —  Manhattan District Attorney Alvin Bragg says Donald Trump's imminent return to the presidency is not a reason … ",
    "url": "https://www.politico.com/news/2024/12/10/bragg-trump-hush-money-verdict-election-000314"
  },
  {
    "text": "Kennedy's War on Corn Syrup Brings a Health Crusade to Trump Country  —  When Donald J. Trump said Robert F. Kennedy Jr. could “go wild” on health, he might not have expected his pick for health secretary doing battle against the president-elect's own voters.",
    "url": "https://www.nytimes.com/2024/12/10/us/politics/rfk-jr-corn-trump.html?unlocked_article_code=1.gU4.c-Ys.p9iO4T9CcUh9&smid=url-share"
  },
  {
    "text": "DOGE Heads Musk and Ramaswamy Signal Social Security Cuts Are Coming  —  Trump vowed to “not cut one penny” from Social Security, but his other statements and actions suggest that he plans to.",
    "url": "https://truthout.org/articles/doge-heads-musk-and-ramaswamy-signal-social-security-cuts-are-coming/"
  },
  {
    "text": "Incoming border czar Tom Homan promises mass deportation: ‘Going to start right here in Chicago’  —  Donald Trump's incoming border czar Tom Homan promised mass deportation at an event Monday, saying he'll start with Chicago migrants.  —  CHICAGO (WLS) — Incoming border czar Tom Homan showed … ",
    "url": "https://abc7chicago.com/post/donald-trump-immigration-incoming-border-czar-tom-homan-promises-mass-deportation-says-hell-start-chicago-migrants/15633535/"
  },
  {
    "text": "Suspect in Health Care C.E.O.'s Killing Charged With Murder  —  The suspect, Luigi Mangione, 26, was charged by New York prosecutors.  He was arrested and arraigned in Altoona, Pa., on Monday after being spotted at a McDonald's.  —  Follow the latest updates on the killing of UnitedHealthcare's chief executive.",
    "url": "https://www.nytimes.com/live/2024/12/09/nyregion/unitedhealthcare-ceo-shooting-news"
  },
  {
    "text": "Florida lawmaker abruptly switches to GOP shortly after winning election as Democrat  —  “It is sad that she has elevated her own needs above the needs of her district,” Democrat says  —  Florida state Rep. Susan Valdes switched her party registration from Democrat to Republican on Monday … ",
    "url": "https://www.salon.com/2024/12/10/florida-lawmaker-abruptly-switches-to-shortly-after-winning-as-democrat/"
  },
  {
    "text": "New York AG Letitia James says she won't drop civil fraud case against Trump  —  Trump demanded James drop the case against him  —  New York Attorney General Letitia James said she will not drop the civil fraud case against President-elect Donald Trump as she waits for the appeal court decision … ",
    "url": "https://www.foxnews.com/politics/new-york-ag-letitia-james-says-she-wont-drop-civil-fraud-case-against-trump"
  },
  {
    "text": "Trump's Defense Pick Is Now Denying Things He Said on Tape  —  Pete Hegseth is hoping you'll forget he thinks women aren't suited for combat roles in the military.  Too bad he enthusiastically declared it on camera a little over a month ago.  —  The vitriolic television host … ",
    "url": "https://newrepublic.com/post/189208/donald-trump-defense-pete-hegseth-women-combat"
  },
  {
    "text": "Democrats demand answers from Trump pick Mehmet Oz on ‘Medicare privatization’  —  In a new letter, seven Democratic lawmakers probed “Dr. Oz” on his past support for putting all seniors in Medicare Advantage and questioned whether he has conflicts of interest.",
    "url": "https://www.nbcnews.com/politics/congress/democrats-demand-answers-trump-pick-mehmet-oz-medicare-privatization-rcna183514"
  },
  {
    "text": "Eric Trump Promises the ‘Most Pro-Crypto President’ in History  —  Speaking at a Middle East conference, President-elect Donald J. Trump's son said his family had embraced cryptocurrency because some banks stopped doing business with them after Jan. 6.  —  Eric Trump flew across the world … ",
    "url": "https://www.nytimes.com/2024/12/10/us/politics/eric-trump-cryptocurrency-conference.html?unlocked_article_code=1.gU4.e9yv.zkrZWiaBWJHl&smid=url-share"
  },
  {
    "text": "Some Other America, One I Do Not Know  —  Some people are very upset about the public reaction to the assassination of UnitedHealthcare CEO Brian Thompson.  The killing has generated horror, but also mocking memes, a wave of hostility towards the healthcare industry, and rhetoric that stops barely short of calling the murder justified.",
    "url": "https://www.popehat.com/p/some-other-america-one-i-do-not-know"
  },
  {
    "text": "Trump promises expedited permits for $1 billion US investment … - Transition spokespeople did not immediately return requests for comment on who or what would be eligible. … That rate is declining, though. … - Zeldin is considered to have little environmental policymaking experience … ",
    "url": "https://www.axios.com/2024/12/10/trump-expedited-permits-1-billion-environment"
  },
  {
    "text": "Israel Says It Destroyed Syria's Navy, Part of Wave of Post-Assad Attacks  —  Israel says it is striking Syrian military sites to keep them out of “the hands of extremists.”  The rebels who toppled the Assad government began laying out their plans while rival groups fought fierce battles for territory.",
    "url": "https://www.nytimes.com/live/2024/12/10/world/syria-news-assad-rebels"
  },
  {
    "text": "Trump mocks Prime Minister Justin Trudeau as the ‘governor’ of the ‘Great State of Canada’  —  The president-elect has proposed imposing tariffs on Canada and Mexico that he said would make the U.S. “rich.”  —  President-elect Donald Trump mocked Prime Minister Justin Trudeau overnight as the … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-mocks-prime-minister-justin-trudeau-governor-great-state-canada-rcna183570"
  },
  {
    "text": "Biden: Trump's tax and tariffs plans are a ‘major mistake’  —  Five weeks after the election, the president took his sharpest swing at Trump's policy plans.  —  President Joe Biden on Tuesday took direct aim at President-elect Donald Trump's economic agenda, denigrating his plan … ",
    "url": "https://www.politico.com/news/2024/12/10/biden-trumps-tax-tariffs-plans-major-mistake-00193507"
  },
  {
    "text": "Trump lawyers and aide hit with 10 additional felony charges in Wisconsin over 2020 fake electors  —  Wisconsin prosecutors filed 10 additional felony charges Tuesday against two attorneys and an aide to President-elect Donald Trump who advised Trump in 2020 as part of a plan … ",
    "url": "https://apnews.com/article/wisconsin-trump-fake-electors-5624cb3e441f6866da4f2dd452a902bc"
  },
  {
    "text": "US Steel Drops as Biden Plans to Block Sale to Nippon Steel  — CFIUS panel is set to refer decision to Biden later this month  — Both companies likely to pursue litigation if deal is blocked  —  President Joe Biden plans to formally block the $14.1 billion sale of United States Steel Corp … ",
    "url": "https://www.bloomberg.com/news/articles/2024-12-10/biden-set-to-finally-kill-nippon-steel-s-proposed-takeover-of-us-steel?accessToken=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzb3VyY2UiOiJTdWJzY3JpYmVyR2lmdGVkQXJ0aWNsZSIsImlhdCI6MTczMzg2NDMwMSwiZXhwIjoxNzM0NDY5MTAxLCJhcnRpY2xlSWQiOiJTTzJXMjNEV1gyUFMwMCIsImJjb25uZWN0SWQiOiI1Q0UxNDZFN0UyMzA0RUM5OEIxOUI3MjU4M0NDNzM0MiJ9.1ETRZ8ZXVSyh2dUi7v1GQYxMJtxdJKTvXd34LiA00dY"
  },
  {
    "text": "On Issue After Issue, Trump Promises the Moon.  No Word on the Rocket.  —  The president-elect has made some of the most expansive campaign pledges in history.  Some supporters fear that his bravado could undermine his ambitions.  —  In his own telling, President-elect Donald J. Trump wields magical powers … ",
    "url": "https://www.nytimes.com/2024/12/10/us/politics/trump-promises.html"
  },
  {
    "text": "Scoop: RFK Jr. pushes his daughter-in-law for CIA deputy director … - President-elect Trump, who has signaled plans to try to overhaul U.S. intelligence agencies during his second term, has already named former intelligence director John Ratcliffe to lead the CIA.",
    "url": "https://www.axios.com/2024/12/10/rfk-jr-amaryllis-fox-cia-trump"
  },
  {
    "text": "How Catholics can urge Joe Biden to commute death row sentences before leaving office  —  After months of election news, followed by an onslaught of reports about new political appointees, many of us feel the heavy weight of uncertainty and even fear about what is to come with the next administration.",
    "url": "https://www.americamagazine.org/politics-society/2024/12/09/death-penalty-biden-pope-francis-jubilee-year-249438"
  },
  {
    "text": "Why Democrats Got the Politics of Immigration So Wrong for So Long  —  They spent more than a decade tacking left on the issue to win Latino votes.  It may have cost them the White House—twice.  —  the election of donald trump this year shattered a long-standing piece of conventional wisdom … ",
    "url": "https://www.theatlantic.com/ideas/archive/2024/12/democrats-latino-vote-immigration/680945/"
  },
  {
    "text": "Pervert Alert: Convicted Sex Offender Anthony Weiner Running for New York City Council  —  Anthony Weiner, the former Democratic congressman from New York and registered sex offender who served 18 months in federal prison for sending explicit texts to a 15-year-old girl, is running for office again.",
    "url": "https://freebeacon.com/author/stiles/democrats/pervert-alert-convicted-sex-offender-anthony-weiner-running-for-new-york-city-council/"
  }
]