[
  {
    "text": "What's Really Behind Trump's Tariffs?  —  Earlier this week, Trump imposed punishing 25 percent tariffs on our neighbors Canada and Mexico while hiking tariffs on Chinese products another 10 percent.  He did this despite strong pressure from groups like the U.S. Chamber of Commerce … ",
    "url": "https://thinkbigpicture.substack.com/p/trump-tariffs-mexico-canada"
  },
  {
    "text": "Trump puts new limits on Elon Musk  —  The president convened his secretaries, with Musk, to clarify power.  —  President Donald Trump convened his Cabinet in person on Thursday to deliver a message: You're in charge of your departments, not Elon Musk.  —  According to two administration officials … ",
    "url": "https://www.politico.com/news/2025/03/06/trump-cabinet-musk-025093"
  },
  {
    "text": "IKEA beds?  Dressers?  Inside the ‘exceedingly odd’ DOGE office setup  —  Details of the arrangements at GSA offer a window into the lifestyle of DOGE workers.  —  As DOGE staffers dismantle the federal workforce, they're following Elon Musk's ethos of moving fast and breaking things.",
    "url": "https://www.politico.com/news/2025/03/06/doge-federal-office-bedrooms-00216863"
  },
  {
    "text": "War heroes and military firsts are among 26,000 images flagged for removal in Pentagon's DEI purge  —  References to a World War II Medal of Honor recipient, the Enola Gay aircraft that dropped an atomic bomb on Japan and the first women to pass Marine infantry training are among the tens … ",
    "url": "https://apnews.com/article/dei-purge-images-pentagon-diversity-women-black-8efcfaec909954f4a24bad0d49c78074"
  },
  {
    "text": "Addressing Risks from Perkins Coie LLP  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:  —  Section 1.  Purpose.  The dishonest and dangerous activity of the law firm Perkins Coie LLP (\"Perkins Coie\") has affected this country for decades.",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/03/addressing-risks-from-perkins-coie-llp/"
  },
  {
    "text": "Marshals Escort DOGE Team Into African Aid Agency  —  A day earlier, U.S. African Development Foundation workers had refused entry to Department of Government Efficiency workers and the State Department official in charge of foreign aid.  —  Federal marshals on Thursday escorted officials … ",
    "url": "https://www.nytimes.com/2025/03/06/us/politics/doge-african-aid-agency.html?unlocked_article_code=1.2E4.Z0zQ.rAy-u90FaieT&smid=url-share"
  },
  {
    "text": "Elon Musk's DOGE Sued After Using U.S. Marshals to Take Over Agency … Elon Musk's Department of Government Efficiency used the U.S. Marshals to physically take over a government agency Thursday, and now that agency head is suing.  —  Five employees of DOGE along with deputy acting head … ",
    "url": "https://newrepublic.com/post/192442/doge-marocco-sued-us-marshals-takeover-usadf-agency"
  },
  {
    "text": "Breakup of SpaceX's Starship Rocket Disrupts Florida Airports  —  Video showed the upper stage of the most powerful rocket ever built spinning out of control in space, a repeat of an unsuccessful test flight in January that led to debris falling over the Caribbean.",
    "url": "https://www.nytimes.com/2025/03/06/science/spacex-starship-launch.html"
  },
  {
    "text": "Justice Amy Coney Barrett ignites anger on the right after ruling against Trump  —  Conservative allies of President Donald Trump called Supreme Court Justice Amy Coney Barrett “evil,” a “closet Democrat” and a “DEI hire.”  —  Just now  —  The Supreme Court's closely divided decision … ",
    "url": "https://www.washingtonpost.com/politics/2025/03/06/amy-coney-barrett-trump-criticism-supreme-court/"
  },
  {
    "text": "Judge Reinstates Fired NLRB Member, Rejecting ‘A Presidency That Is Untouchable By The Law’  —  A federal judge ruled that President Trump's firing of Gwynne Wilcox was unlawful and ordered her restored to the National Labor Relations Board in an opinion that excoriated his quest to craft a new, super-powerful presidency.",
    "url": "https://talkingpointsmemo.com/news/judge-nlrb-trump-supreme-court"
  },
  {
    "text": "Second death reported in growing measles outbreak  —  The death of a New Mexico adult comes eight days after a 6-year-old child succumbed to the disease in Texas last week.  —  just now  —  An unvaccinated New Mexico adult who tested positive for measles has died, the second death … ",
    "url": "https://www.washingtonpost.com/health/2025/03/06/measles-death-outbreak-new-mexico/"
  },
  {
    "text": "‘People Are Going Silent’: Fearing Retribution, Trump Critics Muzzle Themselves … More than six weeks into the second Trump administration, there is a chill spreading over political debate in Washington and beyond.By Kenny Holston/The New York Times  —  The silence grows louder every day.",
    "url": "https://www.nytimes.com/2025/03/06/us/politics/trump-democracy.html?unlocked_article_code=1.104.bA78.onhUDRzXTMl3"
  },
  {
    "text": "Trump administration must pay debts to USAID partners by Monday, judge rules  —  A federal judge ordered the administration to pay what is owed to at least nine aid groups that filed a lawsuit after Trump paused all U.S. foreign assistance.  —  A federal judge is giving the Trump administration until Monday … ",
    "url": "https://www.nbcnews.com/politics/trump-administration/trump-administration-must-pay-debts-usaid-partners-monday-judge-rules-rcna195248"
  },
  {
    "text": "Scoop: Dems privately confront Trump speech disruptors  —  House Democratic leadership is privately confronting members who disrupted President Trump's speech to Congress, Axios has learned.  —  Why it matters: Many progressives defied House Minority Leader Hakeem Jeffries' (D-N.Y.) request to avoid making themselves the story.",
    "url": "https://www.axios.com/2025/03/06/trump-speech-congress-democrats-disrupt"
  },
  {
    "text": "Scoop: State Dept. to use AI to revoke visas of foreign students who appear “pro-Hamas”  —  Secretary of State Marco Rubio is launching an AI-fueled “Catch and Revoke” effort to cancel the visas of foreign nationals who appear to support Hamas or other designated terror groups, senior State Department officials tell Axios.",
    "url": "https://www.axios.com/2025/03/06/state-department-ai-revoke-foreign-student-visas-hamas"
  },
  {
    "text": "Trump Administration Forces Maine Parents To Visit Social Security Offices To Register Newborns  —  The Social Security Administration canceled contracts that allowed Maine parents to sign up newborns for Social Security numbers at the hospital.  —  For decades, new parents across … ",
    "url": "https://www.huffpost.com/entry/maine-social-security-numbers_n_67ca4f3fe4b0f0ee26f56963"
  },
  {
    "text": "‘She Needs to Shut Her Mouth’: Dad of Teen Cancer Survivor Whom Trump Honored Blasts Rachel Maddow  —  The father of DJ Daniel, the teenage cancer survivor whom President Trump honored on Tuesday, had harsh words for MSNBC host Rachel Maddow after she deemed the president “disgusting” for spotlighting the boy's fight with cancer.",
    "url": "https://www.breitbart.com/politics/2025/03/06/she-needs-to-shut-her-mouth-dad-of-teen-cancer-survivor-whom-trump-honored-blasts-rachel-maddow/"
  },
  {
    "text": "A Sensitive Complex Housing a CIA Facility Was on GSA's List of US Properties for Sale  —  Plans to redevelop a Northern Virginia warehouse site have long been complicated by the area's worst-kept secret—the presence of a CIA facility.  The GSA put the site up for sale anyway.",
    "url": "https://www.wired.com/story/gsa-sale-cia-facility/"
  },
  {
    "text": "As Ebola Spreads in Uganda, Trump Aid Freeze Hinders Effort to Contain It, U.S. Officials Fear  —  Two more people are reported dead from the disease, and dozens are in isolation, as the outbreak grows.  —  The Ebola outbreak in Uganda has worsened significantly, and the country's ability … ",
    "url": "https://www.nytimes.com/2025/03/06/health/ebola-uganda-usaid.html?unlocked_article_code=1.2E4.DgLS.IGVEb1QM9gbs&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "RFK Jr. warns vaccinating poultry for bird flu could backfire  —  Federal health agencies oppose the use of bird flu vaccines in poultry right now, Health and Human Services Secretary Robert F. Kennedy Jr. said, weighing in publicly on it for the first time in his new role.",
    "url": "https://www.cbsnews.com/news/rfk-jr-vaccinating-poultry-bird-flu-could-backfire/"
  },
  {
    "text": "Social Security Workers Aren't Allowed to Read This Story  —  New internet restrictions at the embattled SSA have cut off access to WIRED, along with other “general news” websites like The Washington Post and The New York Times.  —  Employees at the Social Security Administration (SSA) … ",
    "url": "https://www.wired.com/story/social-security-workers-arent-allowed-to-read-this-story/"
  },
  {
    "text": "Trump's FDA pick says he'll review whether abortion pill must be dispensed in person again  —  Dr. Marty Makary, nominated to lead the Food and Drug Administration, faced questions about the abortion pill, vaccine advisory meetings and the measles during his hearing.",
    "url": "https://www.nbcnews.com/health/health-news/trumps-fda-pick-says-review-whether-abortion-pill-must-dispensed-perso-rcna195156"
  },
  {
    "text": "DOGE targets child support database full of income data  —  Associates of Elon Musk's group provoked yet another clash with career civil servants over sensitive government records  —  Just now  —  Representatives of the U.S. DOGE Service have sought access to a powerful database of nearly … ",
    "url": "https://www.washingtonpost.com/business/2025/03/06/doge-hhs-ssa-data/"
  },
  {
    "text": "He Gave a Name to What Many Christians Feel … Aaron Renn's “negative world” framework has inspired conferences, sermons, and essays.  —  In the two years since Aaron Renn moved to Carmel, Ind., he has become a kind of unofficial booster for the unusual suburb of Indianapolis.",
    "url": "https://www.nytimes.com/2025/03/06/us/aaron-renn-christianity-conservative-negative-world.html"
  },
  {
    "text": "CBS moves to dismiss $20 billion Trump lawsuit  —  CBS on Thursday filed two motions to dismiss an amended complaint to the lawsuit filed against it by President Trump before he took office last October.  —  Why it matters: CBS is under extraordinary pressure to resolve its legal battle … ",
    "url": "https://www.axios.com/2025/03/06/cbs-files-to-dismiss-trump-lawsuit"
  }
]