[
  {
    "text": "Trump's billionaires set to take government by storm … - They've been picked to lead the departments of Treasury (Scott Bessent), Commerce (Howard Lutnick), Education (Linda McMahon), Interior (Doug Burgum), the Small Business Administration (Kelly Loeffler) and NASA (Jared Isaacman).",
    "url": "https://www.axios.com/2024/12/06/trump-billionaires-cabinet-elon-musk"
  },
  {
    "text": "Trump announces new role for his administration, names PayPal co-founder ‘White House AI and crypto czar’  —  David Sacks is a longtime ally of Elon Musk and the former COO of PayPal.  —  In this July 15, 2024, file photo, David Sacks, CEO of Yammer, speaks during the first day of the 2024 … ",
    "url": "https://abcnews.go.com/Politics/trump-announces-new-role-administration-names-paypal-founder/story?id=116509911"
  },
  {
    "text": "Milley among potential Trump targets who may get preemptive pardons … - White House lawyers are discussing pardons for people who haven't even been investigated, let alone charged.  — Biden's team fears Trump and his allies, who have boasted of enemies lists and exacting “retribution … ",
    "url": "https://www.axios.com/2024/12/06/biden-preemptive-pardons-trump-milley-cheney-fauci"
  },
  {
    "text": "Of Course Joe Biden Was Right to Pardon His Son  —  People need to stop asking Democrats to play by different rules than Republicans, and they need to stop asking Biden to be a worse father than any of us would be in his place.  —  Bluesky  —  Pocket  —  Ido not believe I have read … ",
    "url": "https://www.thenation.com/article/politics/joe-biden-hunter-pardon-was-right-mystal/"
  },
  {
    "text": "TikTok Faces U.S. Ban After Losing Bid to Overturn New Law  —  The law will ban the video app in the United States by Jan. 19 if its owner, ByteDance, does not sell it to a non-Chinese company.  —  TikTok is one step closer to disappearing in the United States after a panel of federal judges … ",
    "url": "https://www.nytimes.com/2024/12/06/business/media/tiktok-ban-court-decision.html"
  },
  {
    "text": "Everybody Loves FRED: How America Fell for a Data Tool  —  From Facebook political debates to college classrooms, the St. Louis Fed's data tool has gained a major following.  —  Fans post about him on social media.  Swag bearing his name sells out on the regular.",
    "url": "https://www.nytimes.com/2024/12/06/business/economy/fred-economic-data-fandom.html"
  },
  {
    "text": "Elon Musk funded a super PAC comparing Trump's position on abortion to Ruth Bader Ginsburg's  —  Elon Musk was the sole funder of a super PAC formed less than a month before the election that focused on advertising intended to convince voters that Donald Trump 's stance on abortion was akin … ",
    "url": "https://apnews.com/article/elon-musk-rbg-pac-abortion-349e66f50b2cd08f6bcebed56f941a3e"
  },
  {
    "text": "Millions will lose health coverage if ACA subsidies expire: CBO  —  A new report released by the Congressional Budget Office (CBO) found that if the Affordable Care Act's (ACA) extended subsidies are allowed to expire at the end of 2025, millions of people will become uninsured and premiums will rise.",
    "url": "https://thehill.com/policy/healthcare/5026478-affordable-care-act-subsidies-expiration-health-coverage/"
  },
  {
    "text": "Breaking news.  Romanian court cancels presidential election in latest political earthquake  —  The first round of the elections saw a previously unknown far-right nationalist candidate Călin Georgescu top the polls in a shock result.  —  The Romanian presidential run-off between … ",
    "url": "https://www.euronews.com/my-europe/2024/12/06/romanian-constitutional-court-blocks-presidential-run-off"
  },
  {
    "text": "Exclusive: Trump may cancel US Postal Service electric mail truck contract, sources say  —  Donald Trump's transition team is considering canceling the United States Postal Service's contracts to electrify its delivery fleet, as part of a broader suite of executive orders targeting electric vehicles … ",
    "url": "https://www.reuters.com/business/autos-transportation/trump-may-cancel-us-postal-service-electric-mail-truck-contract-sources-say-2024-12-06/"
  },
  {
    "text": "The Rage and Glee That Followed a C.E.O.'s Killing Should Ring All Alarms  —  It started barely minutes after the horrifying news broke that the chief executive of UnitedHealthcare, Brian Thompson, was fatally shot in midtown Manhattan.  Even before any details were available … ",
    "url": "https://www.nytimes.com/2024/12/06/opinion/united-health-care-ceo-shooting.html"
  },
  {
    "text": "Melania Trump says heading to the White House for the second term is much different than the first  —  Soon-to-be first lady Melania Trump said Friday that preparing to enter the White House for the second time looks a lot different from the first go-around.  Now, she and her husband know what to expect.",
    "url": "https://apnews.com/article/melania-trump-election-2024-da94d167e0fc1723465c0586a8d17ae8"
  },
  {
    "text": "USDA orders testing of milk for bird flu  —  The mandate targeting bulk milk transporters and dairy processors is meant to help identify herds that have caught the virus, which has spread among livestock.  —  The national milk supply must be tested for bird flu under a federal order announced Friday … ",
    "url": "https://www.nbcnews.com/health/health-news/usda-orders-testing-milk-bird-flu-rcna183212"
  },
  {
    "text": "Pre-election research shows disturbing trend among Republicans  —  Public opinion research conducted in October shows a shift in one political party that might make Donald Trump's election on Nov. 5 less of a surprise.  A majority of the party now agrees with a sentiment about immigration … ",
    "url": "https://www.alternet.org/trump-poisoning-the-blood/"
  },
  {
    "text": "Paul Krugman retires as Times columnist  —  After nearly 25 years as an Opinion columnist, Paul is signing off.  —  I want to take you back to Jan. 2, 2000, a day when Y2K was in the rearview mirror and the dot-com bubble burst was just around the corner, when the Dow stood at a mighty 11,500 … ",
    "url": "https://www.nytco.com/press/paul-krugman-retires-as-times-columnist/"
  },
  {
    "text": "Eric Adams doesn't rule out switch to the GOP: ‘Cancel me’  —  The New York City mayor has been at odds with national Democrats over immigration.  —  NEW YORK — New York City Mayor Eric Adams, a Democrat who has taken a soft touch with President-elect Donald Trump, left open the possibility … ",
    "url": "https://www.politico.com/news/2024/12/06/new-york-eric-adams-republican-party-00192988"
  },
  {
    "text": "No, Trump Can't Just ‘Dismiss’ the Senate  —  The threat from House Republicans should be seen and called out for what it is: an autocratic move that is not just unlawful but contemptuous of constitutionalism.  —  Donald Trump has not even returned to office, and already a constitutional crisis may be in the making.",
    "url": "https://www.theatlantic.com/politics/archive/2024/12/trump-senate-constitution-house-congress/680898/?gift=bS5uJDR4sjeV0yFcCB-C2NhoNCBq9xfUhpmldx1VSWw&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Health-care quality rating at 24-year low: Gallup  —  Americans' outlook on the quality of health care in the U.S. is at a 24-year low, according to a new survey.  —  The Gallup poll, released Friday, shows 33 percent of U.S. adults said the quality of American health care is excellent and 11 percent said it is good.",
    "url": "https://thehill.com/policy/healthcare/5026200-health-care-quality-rating-24-year-low-gallup/"
  },
  {
    "text": "Ocasio-Cortez launches bid for top role on Oversight, as some Dems predict she'll win  —  As Alexandria Ocasio-Cortez jumps into the race to be the top Democrat on the Oversight Committee, she's testing how far her colleagues are willing to go as they shake up their leadership structure.",
    "url": "https://www.politico.com/live-updates/2024/12/06/congress/ocasio-cortez-prepares-oversight-bid-00193010"
  },
  {
    "text": "How Trump could bring on a second civil war  —  Trump may force a second civil war on America with his plan to use the military to round up at least 11 million undocumented people inside the United States — even if it means breaking up families — send them to detention camps, and then deport them.",
    "url": "https://robertreich.substack.com/p/are-we-heading-toward-a-second-civil"
  },
  {
    "text": "Putin's Pals Say Tucker Carlson Is Acting as a Secret Back-Channel to Trump  —  GOING UNDERCOVER  —  Carlson traveled to Moscow to push the Kremlin's Ukraine propaganda in public, but what was he doing in private?  —  Tucker Carlson, the darling of the Russian state media … ",
    "url": "https://www.thedailybeast.com/putins-pals-say-tucker-carlson-is-acting-as-a-secret-back-channel-to-trump/"
  },
  {
    "text": "California Capitol building evacuated after receiving threat  —  The state Assembly and Senate are currently on recess until Jan. 6.  —  SACRAMENTO, California — The California Capitol building in Sacramento was evacuated on Friday morning after receiving a threat.",
    "url": "https://www.politico.com/news/2024/12/06/california-capitol-evacuated-threat-00193046"
  },
  {
    "text": "Biden will leave office as the ‘worst president’ in modern history, according to voters in devastating poll  — J.L. Partners polled 1006 registered voters for their views on Joe Biden  — Respondents were asked to rank nine recent presidents from best to worst",
    "url": "https://www.dailymail.co.uk/news/article-14162187/joe-biden-nixon-trump-rating-president.html"
  },
  {
    "text": "Want a VIP invitation to Donald Trump's inauguration?  That'll cost you — a lot.  —  If you want to rub elbows with President-elect Donald Trump and his incoming administration during inaugural celebrations, it'll cost you — between half a million and $2 million, specifically.",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/12/06/vip-invitation-donald-trump-inauguration/76822535007/"
  },
  {
    "text": "Most federal workers are not in D.C. See where they live.  —  Trump has promised to move 100,000 workers out of the “Washington Swamp.”  —  With the inauguration just weeks away, federal workers in Washington are bracing to see if President-elect Donald Trump and his administration fulfill … ",
    "url": "https://www.washingtonpost.com/politics/2024/12/06/federal-workers-map/"
  }
]