[
  {
    "text": "‘Two Weeks’ Is Trump's Favorite Unit of Time  —  “Two weeks” is one of President Trump's favorite units of time.  It can mean something, or nothing at all.  —  “Within the next two weeks.”  —  That is when President Trump now says he will be ready to make his decision about bombing Iran or not.",
    "url": "https://www.nytimes.com/2025/06/19/world/middleeast/trump-iran-two-weeks.html"
  },
  {
    "text": "Trump administration boosts monitoring of possible Iran-backed cells in U.S. — as Trump weighs strikes, sources say  —  As President Trump is contemplating potential U.S. strikes on Iranian nuclear facilities, law enforcement officials have stepped up surveillance of Iran-backed operatives … ",
    "url": "https://www.cbsnews.com/news/trump-administration-monitor-iran-backed-cells-trump-weighs-strikes/"
  },
  {
    "text": "Trump's fear of Iran becoming ‘another Libya’ stalls decision on nuke site strikes for two weeks: sources  —  WASHINGTON — President Trump's wariness over bombing Iran is due in part to concerns about creating “another Libya” if Supreme Leader Ayatollah Khamenei is toppled … ",
    "url": "https://nypost.com/2025/06/19/us-news/president-trump-holding-off-for-two-weeks-on-attacks-against-last-iran-nuke-sites-over-concerns-of-creating-another-libya-sources/"
  },
  {
    "text": "Trump to decide on Iran action ‘within two weeks,’ White House says  —  President Trump will make a decision on whether the U.S. will strike Iran “within two weeks,” the White House said Thursday.  —  “Based on the fact that there's a substantial chance of negotiations that may or may not take place … ",
    "url": "https://www.npr.org/2025/06/19/nx-s1-5439075/israel-iran-conflict-hospital"
  },
  {
    "text": "Iran has what it needs to produce a nuclear weapon in ‘a couple of weeks,’ White House says  —  Trump will make a decision on Iran within two weeks, Karoline Leavitt said.  —  White House press secretary Karoline Leavitt speaks during a press briefing at the White House, June 19, 2025, in Washington.",
    "url": "https://abcnews.go.com/Politics/iran-produce-nuclear-weapon-couple-weeks-white-house/story?id=123016638"
  },
  {
    "text": "Trump is silent about Juneteenth on a day he previously honored as president  —  President Donald Trump honored Juneteenth in each of his first four years as president, even before it became a federal holiday.  He even claimed once to have made it “famous.”",
    "url": "https://apnews.com/article/trump-juneteenth-slavery-statement-holiday-28afec7cd532295437d53d3ec29f549f"
  },
  {
    "text": "Appeals court extends order allowing Trump to deploy National Guard to L.A.  —  Washington — A federal appeals court on Thursday extended its block of a judge's order that directed President Trump to return control of California's National Guard to Gov. Gavin Newsom.",
    "url": "https://www.cbsnews.com/news/appeals-court-extends-order-allowing-trump-to-deploy-national-guard-to-l-a/"
  },
  {
    "text": "Appeals court lets Trump keep control National Guard troops deployed to Los Angeles during protests  —  An appeals court on Thursday allowed President Donald Trump to keep control of National Guard troops he deployed to Los Angeles following protests over immigration raids.",
    "url": "https://apnews.com/article/los-angeles-protests-national-guard-lawsuit-ae2433fca9a2834634efefc9a545745b"
  },
  {
    "text": "ICE agents say posting names endangers them, Nashville mayor says real problem is masking  —  The Mayor's office releasing the names of ICE agents has brought scrutiny from GOP lawmakers, DHS, and ICE over the concern that it endangers federal immigration officers.",
    "url": "https://fox17.com/news/local/ice-agents-say-posting-names-endangers-them-nashville-mayor-says-real-problem-is-masking-dhs-google-news"
  },
  {
    "text": "Elon Musk's SpaceX Starship explodes on test stand  —  The failure sent a giant fireball into the sky over the company's South Texas launch site.  —  SpaceX Starship explodes on test stand  —  SpaceX's Starship spacecraft exploded ahead of an engine test late Wednesday … ",
    "url": "https://www.washingtonpost.com/technology/2025/06/19/starship-spacex-explosion-musk/"
  },
  {
    "text": "LA Dodgers says it denied ICE access to stadium grounds  —  The Los Angeles Dodgers said Thursday it denied Immigration and Customs Enforcement (ICE) agents entry to their stadium grounds.  —  “This morning, ICE agents came to Dodger Stadium and requested permission to access the parking lots.",
    "url": "https://thehill.com/latino/5359804-la-dodgers-deny-ice-access-to-stadium-grounds/"
  },
  {
    "text": "Where is the outrage over Skrmetti?  —  The response to Wednesday's U.S. Supreme Court decision upholding Tennessee's law barring transgender minors from obtaining gender-affirming medical care has been muted at best.  —  In its U.S. v. Skrmetti ruling, the Supreme Court's Republican appointees shaved off … ",
    "url": "https://www.lawdork.com/p/where-is-the-outrage-over-skrmetti"
  },
  {
    "text": "Mark Cuban: Harris Camp Asked For VP Vetting Papers  —  The former Dallas Mavericks owner declined, saying he wouldn't make a particularly good Number Two.  —  Transcript  —  Last summer, during the height of the presidential campaign—not the Biden v. Trump one, the Harris v. Trump one … ",
    "url": "https://www.thebulwark.com/p/mark-cuban-harris-camp-asked-for"
  },
  {
    "text": "6/20/25 ☀️ AM: … The Senate just started a long weekend, but Senate Majority Leader John Thune and the White House are ratcheting up the pressure on rank-and-file GOP senators to pass a massive Republican reconciliation bill by the end of next week.",
    "url": "https://punchbowl.news/archive/62025-am/"
  },
  {
    "text": "A New Middle East Is Unfolding Before Our Eyes … That day, a shepherd posted cell phone footage of an Israeli C-130 low in the sky over Syria, sheep bells clanking over the roar of the engines.  The Assad family had fled the country months earlier, helpless to keep rebels out of Damascus without Hezbollah.",
    "url": "https://time.com/7295798/new-middle-east-time-cover/"
  },
  {
    "text": "GOP congressman says he was run off the road by ‘deranged man’ on the way to work  —  Ohio Republican Rep. Max Miller said Thursday he was run off the road by a “deranged man” who waved a Palestinian flag in his direction and lobbed death threats before driving away.",
    "url": "https://thehill.com/homenews/house/5359953-max-miller-run-off-road/"
  },
  {
    "text": "Trump Tax Bill Bails Out Private Equity's Layoff Scheme  —  Lawmakers quietly added a line that effectively subsidizes Wall Street buying up companies, slashing wages, closing factories, and firing workers.  —  Congressional lawmakers have inserted a line into President Donald Trump's … ",
    "url": "https://www.levernews.com/trump-tax-bill-bails-out-private-equitys-layoff-scheme/"
  },
  {
    "text": "Maduro Locks Up Economists Sharing Data on Venezuela's Decline  —  President Nicolás Maduro has intensified his crackdown on independent economists and consultants, detaining at least eight people in what critics call a bid to control data exposing Venezuela's decline.",
    "url": "https://www.bloomberg.com/news/articles/2025-06-19/maduro-locks-up-economists-sharing-data-on-venezuela-s-decline"
  },
  {
    "text": "Washington cherry growers struggle to find pickers  —  The threat of federal immigration agents raiding orchards in central Washington is causing a labor shortage that has compelled some Washington producers to leave cherries unpicked or delay their harvests until the fruit overripens and is worth less money.",
    "url": "https://www.spokesman.com/stories/2025/jun/18/washington-cherry-growers-struggle-to-find-pickers/"
  },
  {
    "text": "ICE agents covering their faces should rattle all Americans  —  A California bill that restricts local and state law enforcement officials from covering their faces is a necessary, if symbolic, rebuke of the encroaching police state.  —  As sickening as it is to see Immigration … ",
    "url": "https://www.msnbc.com/msnbc/amp/rcna213483"
  },
  {
    "text": "Focus groups: Latino Trump voters diverge on deportations but largely still back the president  —  The focus group participants broadly supported Trump's actions on immigration and the economy, but some divisions emerged over the focus of his deportation program.",
    "url": "https://www.nbcnews.com/politics/politics-news/focus-groups-latino-trump-voters-diverge-deportations-largely-still-ba-rcna213461"
  },
  {
    "text": "Leavitt: Jasmine Crockett's comments on Trump supporters were ‘incredibly derogatory’  —  White House press secretary Karoline Leavitt piled on Rep. Jasmine Crockett (D-TX) Thursday for recent comments the latter made about supporters of President Donald Trump.",
    "url": "https://www.washingtonexaminer.com/news/white-house/3447673/karoline-leavitt-jasmine-crockett-trump-supporters-white-house/"
  },
  {
    "text": "Instead of defending budget bill, GOP touts one that doesn't exist  —  Republicans have resorted to fabrication because most voters reject their bill's regressive measures.  —  If you don't have anything nice to say, just make something up instead.  —  That's the strategy Republican politicians … ",
    "url": "https://www.washingtonpost.com/opinions/2025/06/19/gop-budget-misleading-regressive/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzUwMzA1NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzUxNjg3OTk5LCJpYXQiOjE3NTAzMDU2MDAsImp0aSI6IjE5NzkyNWE5LWUyOTQtNDcyYS04ZGQ3LTg1YThmYjBhYzUyNiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9vcGluaW9ucy8yMDI1LzA2LzE5L2dvcC1idWRnZXQtbWlzbGVhZGluZy1yZWdyZXNzaXZlLyJ9.UPLr5rLHo1-2WHkNVbPfQY9H-G3i7FG5FXvtPobSV4A&itid=gfta"
  }
]