[
  {
    "text": "DeSantis booed at vigil for victims of racist shooting in Florida  —  Florida Gov. Ron DeSantis, a GOP presidential candidate, was met with boos while speaking late Sunday at a vigil held for the three victims of a racially motivated shooting in Jacksonville.",
    "url": "https://thehill.com/homenews/state-watch/4174426-desantis-booed-at-vigil-for-victims-of-racist-shooting-in-florida/"
  },
  {
    "text": "The Federalist Society's mugshots  —  This entirely free edition of Public Notice is made possible by paid subscribers.  If you appreciate our work and aren't already one, please support us by signing up.  Just click the button below for a free trial.  —  Sign up for Public Notice free trial",
    "url": "https://www.publicnotice.co/p/jeffrey-clark-eastman-charges-federalist-society"
  },
  {
    "text": "Trump lawyers back in D.C. federal court as judge prepares to schedule trial date  —  Washington — A federal judge in Washington, D.C. is set to decide on Monday when former President Donald Trump will stand trial in the 2020 election-related case brought by special counsel Jack Smith … ",
    "url": "https://www.cbsnews.com/news/trump-dc-trial-date-to-be-scheduled-judge/"
  },
  {
    "text": "Meadows heads to federal court for first skirmish in Trump Georgia case  —  Former White House chief of staff will ask federal judge to take over the case — and then to dismiss charges against him related to the 2020 election  —  Lawyers for Donald Trump's former chief of staff Mark Meadows … ",
    "url": "https://www.washingtonpost.com/national-security/2023/08/28/mark-meadows-federal-court-trump-georgia-election-case/"
  },
  {
    "text": "August 2023 National Poll: Trump Debate Snub May Open Door for Other Candidates  —  Home Polls August 2023 National Poll: Trump Debate Snub May Open Door for Other Candidates  —  Hunter Biden Legal Issues Offsetting Trump Indictments for Independents  —  A new Emerson College Polling survey … ",
    "url": "https://emersoncollegepolling.com/august-2023-national-poll-trump-debate-snub-may-open-door-for-other-candidates/"
  },
  {
    "text": "Trump support ‘softening,’ possible opening for challengers  —  It's too early to determine if it is a trend or “blip,” but a survey of Republican voters following last week's GOP debate has found a “softening” of support for former President Donald Trump.  —  While Trump remains the leader … ",
    "url": "https://www.washingtonexaminer.com/news/washington-secrets/trump-support-softening-possible-opening-for-challengers"
  },
  {
    "text": "If the U.S. economy is doing well, why do so many Americans say it's terrible?  —  The leading economic indicators show the U.S. economy is performing well, but most Americans still believe economic conditions are extremely poor — as if the country was mired in a deep recession.  What explains this discrepancy?",
    "url": "https://popular.info/p/if-the-us-economy-is-doing-well-why"
  },
  {
    "text": "Trump's indictments: Polling shows half of Americans want him to suspend his campaign, and more takeaways  —  Despite what he claims, he isn't getting a continued bounce in support.  —  The most recent ABC News/Ipsos poll, conducted Aug. 15-17, showed some problems for former President Donald Trump … ",
    "url": "https://abcnews.go.com/Politics/trumps-indictments-polling-shows-half-americans-suspend-campaign/story?id=102342093"
  },
  {
    "text": "The World Is Contemplating a Second Trump Administration  —  Possibility that former president will win next year's election has capitals across globe on edge  —  The U.S. presidential election is more than a year away, but allies and adversaries around the world have already begun to contemplate … ",
    "url": "https://www.wsj.com/world/the-world-is-contemplating-a-second-trump-administration-f6e970c4?mod=followamazon"
  },
  {
    "text": "House Republicans' road to power runs through New York.  Stefanik is driving  —  Elise Stefanik insists she has a plan that will allow the party to hold off a Democratic offensive.  —  POTSDAM, N.Y. — Elise Stefanik is betting big on 2024.  —  The No. 3 House Republican says she convinced … ",
    "url": "https://www.politico.com/news/2023/08/28/stefanik-plans-100m-campaign-push-in-home-state-new-york-00113073"
  },
  {
    "text": "Russia charges U.S. consulate worker with spying over the war in Ukraine  —  The arrest of Robert Shonov in May drew condemnation from the State Department.  —  Russia has charged a former U.S. consulate employee with collecting information for Washington on the war in Ukraine.",
    "url": "https://www.nbcnews.com/news/world/russia-charges-us-consulate-worker-spying-ukraine-war-rcna102086"
  },
  {
    "text": "Republicans seize on gasoline prices, but the U.S. is pumping oil faster than ever  —  GOP presidential candidates are blaming pump prices on President Joe Biden's clean energy policies, even though the U.S. is churning out record amounts of oil.  —  The late-summer surge in gasoline prices … ",
    "url": "https://www.politico.com/news/2023/08/28/republicans-gas-prices-oil-production-00111626"
  },
  {
    "text": "We must keep marching toward Dr. King's dream  —  Joe Biden is president of the United States.  —  Sixty years ago, the Rev. Martin Luther King Jr. and hundreds of thousands of fellow Americans marched on Washington for jobs and freedom.  In describing his dream for us all … ",
    "url": "https://www.washingtonpost.com/opinions/2023/08/27/joe-biden-king-march-on-washington-jobs-freedom/"
  },
  {
    "text": "Biden is widely seen as too old for office, an AP-NORC poll finds.  Trump's got other problems  —  Americans actually agree on something in this time of raw discord: Joe Biden is too old to be an effective president in a second term.  Only a few years his junior, Donald Trump raises strikingly less concern about his age.",
    "url": "https://apnews.com/article/biden-age-poll-trump-2024-620e0a5cfa0039a6448f607c17c7f23e"
  }
]