[
  {
    "text": "Trump Falsely Claims That the Crowds Seen at Harris Rallies Are Fake  —  The former president, in a series of social media posts, said that Vice President Kamala Harris had used A.I. technology to create images of fake crowds at her events.  —  Former President Donald J. Trump has taken … ",
    "url": "https://www.nytimes.com/2024/08/11/us/politics/trump-harris-crowds-ai.html?unlocked_article_code=1.CU4.IU4A.laO56X6syKZM&smid=url-share"
  },
  {
    "text": "The Reintroduction of Kamala Harris  —  The soundtrack suggested a Beyoncé concert.  The light-up bracelets evoked the Eras Tour.  And the exuberant crowd—more than 14,000 strong, lining up in the rain—resembled the early days of Barack Obama.  Inside a Philadelphia arena on Aug. 6 … ",
    "url": "https://time.com/7009317/reintroduction-of-kamala-harris/"
  },
  {
    "text": "Playbook: The unwritten Harris agenda  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  VIBE CHECK — “Harris is pushing joy.  Trump paints a darker picture.  Will mismatched moods matter?” by AP's Will Weissert and Michelle L. Price … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/08/12/the-unwritten-harris-agenda-00173589"
  },
  {
    "text": "Harris becomes betting favorite in presidential election odds after swing state barnstorm  —  Democratic presidential nominee Vice President Kamala Harris stands as the slight betting favorite over Republican nominee former President Donald Trump to win the White House.",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/08/12/harris-trump-presidential-election-odds-swing-state-tour/74762000007/"
  },
  {
    "text": "Trump falsely claims Harris Michigan rally crowd 'didn't exist,' was generated with AI  —  Former President Donald Trump took to social media on Sunday to falsely claim that Vice President Kamala Harris' campaign faked photos of the crowd at her Detroit-area rally last week using artificial intelligence.",
    "url": "https://ny1.com/nyc/all-boroughs/politics/2024/08/11/trump-kamala-harris-michigan-rally-ai"
  },
  {
    "text": "The most expensive political ad of all time  —  In 2022, Elon Musk purchased Twitter, one of the world's largest social networks, for $44 billion.  From a financial perspective, it has not worked out well.  Over the last two years, the value of Twitter — which Musk renamed X — has plunged.",
    "url": "https://popular.info/p/the-most-expensive-political-ad-of"
  },
  {
    "text": "Early numbers show violent crime dropping sharply … - It also gives Vice President Kamala Harris, a former prosecutor in San Francisco and California attorney general, a potent defense against attacks from the right on crime. … - 54 of the 69 major cities in the report saw drops in violent crime … ",
    "url": "https://www.axios.com/2024/08/12/violent-crime-harris-trump-election"
  },
  {
    "text": "Trump Is a Threat Whether He Wins or Loses, Biden Says  —  “He's a genuine danger to American security,” Biden said of Trump in his first TV interview since dropping out of the race.  —  In his first interview since dropping out of the election last month and endorsing Vice President Kamala Harris … ",
    "url": "https://www.motherjones.com/politics/2024/08/trumps-a-threat-whether-he-wins-or-loses-biden-says/"
  },
  {
    "text": "JD Vance's Campaign Won't Deny That's Him in Viral Drag Photo  —  ‘SOFA LAUREN’  —  The GOP's vice presidential pick is a vocal critic of gender affirming care for minors and once opposed federal protections for gay and interracial marriages.  —  Journalist",
    "url": "https://www.thedailybeast.com/jd-vances-campaign-wont-deny-thats-him-in-viral-drag-photo"
  },
  {
    "text": "Poll: Democratic attacks on JD Vance are working  —  The Scoop  —  New polling shared exclusively with Semafor shows Democrats' attacks on JD Vance's views on abortion, divorce and “childless cat ladies” are sticking with voters.  —  A pair of surveys by Blueprint, the centrist Democratic pollster backed … ",
    "url": "https://www.semafor.com/article/08/12/2024/poll-democratic-attacks-on-jd-vance-are-working"
  },
  {
    "text": "U.S. deploys submarine to Middle East; Israel anticipates direct attack from Iran  —  The order came after Defense Secretary Lloyd Austin spoke with Israeli Defense Minister Yoav Gallant, discussing efforts to deter Iran.  —  TEL AVIV — U.S. Defense Secretary Lloyd Austin has ordered … ",
    "url": "https://www.washingtonpost.com/world/2024/08/12/israel-iran-hamas-war-news-gaza/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzIzNDM1MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI0ODE3NTk5LCJpYXQiOjE3MjM0MzUyMDAsImp0aSI6IjA1OTBjYzEzLWRmMDUtNDJhMC1iY2E4LWVlMjQ1YjdiMzk3MCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS93b3JsZC8yMDI0LzA4LzEyL2lzcmFlbC1pcmFuLWhhbWFzLXdhci1uZXdzLWdhemEvIn0.XUjDbZJRvmmZ-hkICmSqwdbLcXkt7XEvHduEUgbQPSc&itid=gfta"
  },
  {
    "text": "Democrats to invest six figures in turning out voters living outside the U.S.  —  The Democratic Party is making a first-time investment in registering and turning out voters living outside of the United States.  The party is estimating that some 1.6 million Americans abroad are from crucial battleground states this cycle.",
    "url": "https://www.cbsnews.com/news/democrats-investment-voters-abroad-us-election/"
  },
  {
    "text": "Exclusive: DNC launches first Harris-Walz ad blitz … - The DNC says it is launching more than 80 billboards, which will run in English and Spanish, in and around the major metropolitan areas in the swing states of Arizona, Georgia, Michigan, North Carolina, Nevada, Pennsylvania and Wisconsin.",
    "url": "https://www.axios.com/2024/08/12/dnc-harris-walz-billboards-2024-democrats"
  },
  {
    "text": "White House launches broad new regulatory effort, as Harris prepares to unveil economic plan … The Biden Administration on Monday unveiled a new, multi-agency regulatory initiative to target corporate practices that officials claim are designed to waste consumers' time and needlessly burden … ",
    "url": "https://www.cnbc.com/2024/08/12/biden-harris-new-regulations-would-target-corporations-that-waste-consumers-time.html"
  },
  {
    "text": "Delays hit 40% of Biden's major IRA manufacturing projects  —  FT research shows that $84bn of initiatives announced in first year of the IRA and Chips Act have experienced slowdowns  —  Some 40 per cent of the biggest US manufacturing investments announced in the first year … ",
    "url": "https://www.ft.com/content/afb729b9-9641-42b2-97ca-93974c461c4c"
  },
  {
    "text": "JD Vance says mass deportations should ‘start with 1 million,’ defends ‘thought experiment’ giving parents extra votes  —  The GOP vice presidential candidate discussed several issues with Jonathan Karl.  —  Republican vice presidential candidate JD Vance is interviewed by ABC News' Jon Karl on Aug. 10, 2024.",
    "url": "https://abcnews.go.com/Politics/jd-vance-mass-deportations-start-1-million-defends/story?id=112739447"
  }
]