[
  {
    "text": "Trump supports immigration visas backed by Musk: ‘I have many H-1B visas on my properties’  —  President-elect Trump told The Post Saturday he supports immigration visas for highly skilled workers, appearing to side with Elon Musk in the roiling intra-MAGA debate on the issue.",
    "url": "https://nypost.com/2024/12/28/us-news/donald-trump-backs-h-1b-visa-program-supported-by-elon-musk/"
  },
  {
    "text": "Trump appears to side with Musk, tech allies in debate over foreign workers roiling his supporters  —  President-elect Donald Trump appears to be siding with Elon Musk and his other backers in the tech industry as a dispute over immigration visas has divided his supporters.",
    "url": "https://apnews.com/article/trump-maga-immigration-visas-musk-91ab17e141cc9764fb18b8bc862c84dc"
  },
  {
    "text": "Trump says he is a ‘believer’ in H-1B visas for skilled migrant workers as right spars on immigration: report  —  Musk argued that immigrants are needed for the tech sector  —  President-elect Trump appeared to agree with Elon Musk in support of H-1B visas for skilled workers in the U.S. … ",
    "url": "https://www.foxnews.com/politics/trump-says-he-believer-h-1b-visas-skilled-migrant-workers-right-spars-immigration-report"
  },
  {
    "text": "Joe Biden's lonely battle to sell his vision of American democracy  —  In his presidency's final chapter, Biden has mused about whether he should have handled some decisions differently  —  Earlier this year, Rep. James E. Clyburn met President Joe Biden at the White House to deliver a stern message … ",
    "url": "https://www.washingtonpost.com/politics/2024/12/28/bidens-lonely-battle-to-sell-american-democracy/"
  },
  {
    "text": "Biden reportedly regrets ending re-election campaign and says he'd have defeated Trump  —  President also regrets picking Merrick Garland for attorney general, as he was slow to prosecute Trump for January 6  —  Joe Biden regrets having pulled out of this year's presidential race and believes … ",
    "url": "https://www.theguardian.com/us-news/2024/dec/28/joe-biden-regrets-dropping-out-re-election"
  },
  {
    "text": "Elon Musk pens German newspaper opinion piece supporting far-right AfD party  —  Billionaire Trump adviser said his ‘significant investments’ in the country justified his wading into German politics  —  The tech entrepreneur and close adviser to Donald Trump Elon Musk has taken a stunning … ",
    "url": "https://www.theguardian.com/world/2024/dec/28/elon-musk-germany-afd-party"
  },
  {
    "text": "Trump calls federal judge's decision on border wall “major, crucial WIN” … - The attorney general's office said in a news release Paxton asked for a probe “to uncover potential legal violations committed by the Biden Administration after recent reports that segments of the border wall were auctioned off for pennies on the dollar.”",
    "url": "https://www.axios.com/2024/12/28/trump-border-wall-federal-judge-blocks-biden"
  },
  {
    "text": "Dean Phillips Was Right About Joe Biden.  He Finds It ‘Awfully Unsatisfying.’  —  The three-term lawmaker and presidential candidate is deeply disappointed with his fellow Democrats.  —  Outgoing Minnesota Rep. Dean Phillips poses for a portrait at his home in Capitol Hill in Washington on Dec. 16.",
    "url": "https://www.politico.com/news/magazine/2024/12/28/dean-phillips-congress-exit-interview-00195232"
  },
  {
    "text": "Man accused of attacking TV reporter, saying 'This is Trump's America now'  —  A Colorado man is facing possible bias-motivated charges for allegedly attacking a television news reporter after demanding to know whether he was a citizen, saying “This is Trump's America now,” according to court documents.",
    "url": "https://apnews.com/article/tv-reporter-attack-trumps-america-40c4c3622bf85baef9cefbd50d50fcec"
  },
  {
    "text": "Putin Apologizes but Does Not Take Responsibility for Azerbaijani Plane Crash  —  President Vladimir V. Putin of Russia told the Azerbaijani leader, Ilham Aliyev, in a phone call, “that the tragic incident took place in Russian airspace.”  —  President Vladimir V. Putin of Russia … ",
    "url": "https://www.nytimes.com/2024/12/28/world/europe/kazakhstan-russia-azerbaijan-plane-crash.html"
  },
  {
    "text": "Dear Jurisprudence: Can Trump Really Run for a Third Term?  —  At the end of 2024, we consider reader questions (and worries) about 2025. … Dear (Juris)Prudence,  —  Every so often, Trump throws out the phrase “If I'm reelected.”  Politicos talk about Trump being a lame duck and how impossible that is … ",
    "url": "https://slate.com/news-and-politics/2024/12/can-trump-run-for-a-third-term.html"
  },
  {
    "text": "Abortions are up in the US.  It's a complicated picture as women turn to pills, travel  —  Abortion has become slightly more common despite bans or deep restrictions in most Republican-controlled states, and the legal and political fights over its future are not over yet.",
    "url": "https://apnews.com/article/abortion-roe-dobbs-states-data-5632f60aa1d797bcdec9fbc77a385413"
  },
  {
    "text": "The Progressive Moment in Global Politics Is Over  —  Weak economic growth and record immigration are driving gains by the right, especially populists  —  The progressive moment is over—at least for now.  —  This past year showed that the progressive politics that dominated … ",
    "url": "https://www.wsj.com/world/global-politics-conservative-right-shift-ea0e8d05"
  },
  {
    "text": "Mexico, Betting Trump Is Bluffing on Tariffs, Sees an Opportunity  —  Business leaders in Mexico say the incoming U.S. administration will enhance the appeal of their factories as an alternative to plants in China.  —  Monterrey in Mexico, a country that emerged as an attractive manufacturing hub … ",
    "url": "https://www.nytimes.com/2024/12/28/business/trump-tariffs-mexico-china.html"
  }
]