[
  {
    "text": "What could happen as Trump faces deadline on half-billion-dollar bond  —  One option is that New York Attorney General Letitia James could begin seizing Trump's properties next week  —  Donald Trump, who lost a civil fraud case in New York last month, must put up a bond of nearly half … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/23/trump-bond-deadline-new-york-fraud-case/"
  },
  {
    "text": "Truth Social made Trump richer and gave him a new megaphone.  But it's struggling as a social media site  —  When he's not raising horses or working at a construction site, 28-year-old Nick Mirtschink says he spends “a lot” of time on Truth Social, the social media platform started by Donald Trump.",
    "url": "https://www.cnn.com/2024/03/23/politics/truth-social-donald-trump/"
  },
  {
    "text": "We Have Met the Enemy and He Owns the Valet Booth at Trump Tower  —  As we can see, the New York State civil judgment against Donald Trump, totaling roughly $450 million, and Trump's seeming inability to post a bond for the amount in order to appeal the judgment, is the real deal.",
    "url": "https://talkingpointsmemo.com/edblog/we-have-met-the-enemy-and-he-owns-the-valet-booth-at-trump-tower/sharetoken/3jTLuWi6kWgZ"
  },
  {
    "text": "It's ‘brass tacks’ time for cash-strapped Trump campaign  —  The former president has blocked off two days next week to make fundraising calls.  —  Donald Trump doesn't have the money to match what Democrats are expected to spend against him in the presidential campaign.",
    "url": "https://www.politico.com/news/2024/03/23/trump-donors-fundraising-00148679"
  },
  {
    "text": "Trump's dark ‘retribution’ pledge at center of 2024 bid, but can he make it reality?  —  He recently said Liz Cheney and others “should go to jail.”  —  Republican presidential candidate and former U.S. President Donald Trump speaks during a campaign rally, Mar. 2 in Richmond, Va.",
    "url": "https://abcnews.go.com/Politics/trumps-dark-retribution-pledge-center-2024-bid-make/story?id=108315702"
  },
  {
    "text": "Biden campaign tests Trump's name-calling strategy with ‘Broke Don’  —  President Biden's reelection campaign has dubbed former President Trump “Broke Don,” taking a strategy out of Trump's playbook that his political rivals know all too well.  —  Trump has used nicknames — from “Little Marco” … ",
    "url": "https://thehill.com/homenews/campaign/4550498-biden-campaign-tests-trumps-name-calling-strategy-with-broke-don/"
  },
  {
    "text": "The last time a Trump company went public it didn't go well for investors  —  Trump made millions in the 1990s when his casino company went public.  Investors lost a fortune.  —  Donald Trump's social media company could go public as soon as next week, paving the way for a potentially huge windfall … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/last-time-trump-company-went-public-didnt-go-well-investors-rcna144657"
  },
  {
    "text": "Gunmen Kill at Least 60 at Moscow Concert Hall, Russian Officials Say  —  U.S. officials said the Islamic State was responsible for the attack, one of the deadliest in Russia's capital region in more than a decade.  —  Here is the latest on the attack in Russia.",
    "url": "https://www.nytimes.com/live/2024/03/22/world/moscow-shooting"
  },
  {
    "text": "ISIS claims responsibility for attack at Moscow-area concert venue that left at least 60 dead  —  ISIS has claimed responsibility for an attack at a popular concert venue complex near Moscow Friday after assailants stormed the venue with guns and incendiary devices, killing at least 60 people and injuring 145.",
    "url": "https://www.cnn.com/2024/03/22/europe/crocus-moscow-shooting"
  },
  {
    "text": "Moscow concert attack live updates: Dozens reported dead after shooting  —  What we know about the Moscow concert attack … Public events across Russia called off after attack  —  Several regional leaders across Russia, including in the annexed Kherson region of Ukraine … ",
    "url": "https://www.nbcnews.com/news/world/live-blog/russia-moscow-concert-attack-shooting-rcna144706"
  },
  {
    "text": "House leaves for a two-week break — without addressing Ukraine aid  —  The U.S. ally is running dangerously low on ammunition in its war with Russia.  Speaker Mike Johnson said this week's priority was averting a shutdown and Ukraine will be next.  —  WASHINGTON — After voting to avert … ",
    "url": "https://www.nbcnews.com/politics/congress/house-leaves-two-week-break-addressing-ukraine-aid-rcna144446"
  },
  {
    "text": "13-year-old rape victim has baby amid confusion over state's abortion ban  —  Law enforcement used DNA from the baby to apprehend the suspect.  —  At just 13-years-old Ashley became a mother to a little baby boy nicknamed “Peanut.”  —  Regina, a mother of three daughters … ",
    "url": "https://abcnews.go.com/US/13-year-rape-victim-baby-amid-confusion-states/story?id=108351812"
  },
  {
    "text": "Republicans Who Do Not Regularly Watch Fox Are Less Likely to Back Trump  —  Survey data shows more of them believe he acted criminally.  —  Republicans who get their news from nonconservative mainstream media outlets are less likely to support Donald J. Trump than those who follow conservative outlets.",
    "url": "https://www.nytimes.com/2024/03/23/upshot/fox-republicans-trump.html"
  },
  {
    "text": "Johnson's margin drops to one vote as Gallagher heads for early exit  —  Allies of the Wisconsin Republican say he was long jaded by the antics of the House following the ouster of Speaker Kevin McCarthy.",
    "url": "https://www.politico.com/live-updates/2024/03/22/congress/gallagher-leaving-early-00148586"
  },
  {
    "text": "The Online Degradation of Women and Girls That We Meet With a Shrug  —  Alarms are blaring about artificial intelligence deepfakes that manipulate voters, like the robocall sounding like President Biden that went to New Hampshire households, or the fake video of Taylor Swift endorsing Donald Trump.",
    "url": "https://www.nytimes.com/2024/03/23/opinion/deepfake-sex-videos.html"
  },
  {
    "text": "This Gen Z Democrat quit his job protecting elections to run against a fake elector  —  24-year-old Ashwin Ramaswami is running for the Georgia state Senate, taking on a Republican who was indicted alongside Donald Trump.  —  Ashwin Ramaswami spent the last three years working … ",
    "url": "https://www.nbcnews.com/politics/2024-election/gen-z-democrat-georgia-fake-elector-state-senate-rcna144294"
  },
  {
    "text": "Judge permits Gaetz, Greene to sue California cities that canceled their events  —  But the judge blasted the GOP lawmakers for “pure conjecture” and “conspiracy theory” against civic groups.  —  A federal judge on Friday cleared the way for Reps. Matt Gaetz and Marjorie Taylor Greene to sue … ",
    "url": "https://www.politico.com/news/2024/03/22/judge-permits-gaetz-greene-to-sue-california-cities-that-canceled-their-events-00148693"
  },
  {
    "text": "NBC hires former RNC chair Ronna McDaniel, who has demonized the press and refused to acknowledge Biden was fairly elected  —  NBC News on Friday announced that it had hired Ronna McDaniel, the former Republican National Committee chair who has repeatedly attacked the network and its journalists … ",
    "url": "https://www.cnn.com/2024/03/22/media/ronna-mcdaniel-nbc/"
  }
]