[
  {
    "text": "Commerce Secretary Lutnick says tariff exemptions for electronics are only temporary  —  Lutnick said “semiconductor tariffs” will likely come in “a month or two.”  —  Secretary of Commerce Howard Lutnick speaks with ABC News while appearing on ‘This Week’ April 13, 2025.",
    "url": "https://abcnews.go.com/Politics/commerce-secretary-lutnick-tariff-exemptions-electronics-temporary/story?id=120752319"
  },
  {
    "text": "A Devastating Trade Spat With China Shows Few Signs of Abating  —  The Trump administration is in a standoff with the Chinese government as trade tensions escalate, leaving U.S. businesses in the cross hairs  —  President Trump abruptly paused his “reciprocal” tariffs on most countries … ",
    "url": "https://www.nytimes.com/2025/04/13/us/politics/trump-tariffs-trade-war-china.html"
  },
  {
    "text": "Phones, other electronics exempt from new tariffs, Trump administration says  —  The exemptions come days after the U.S. trade representative said “the president has been clear” that he does not intend to give exemptions to the tariffs.  —  The Trump administration has spared smartphones … ",
    "url": "https://www.washingtonpost.com/business/2025/04/12/trump-tariff-exemptions-smartphones-computers/"
  },
  {
    "text": "Trump administration says wrongly deported man is alive in El Salvador prison  —  The U.S. government continued to refuse to provide any details about whether it has taken any steps to return him to the United States.  —  The Trump administration confirmed Saturday that Kilmar Abrego Garcia … ",
    "url": "https://www.politico.com/news/2025/04/12/abrego-garcia-el-salvador-alive-00287678"
  },
  {
    "text": "Trump DOJ Flips Off SCOTUS in Brazen Update on Deported Dad  —  ‘BARBARIANS’  —  A senior department official stated that Kilmar Abrego Garcia was detained under the sovereign authority of El Salvador.  —  The Trump administration is continuing to seemingly do everything it can to avoid securing … ",
    "url": "https://www.thedailybeast.com/trump-doj-flips-off-scotus-in-brazen-update-on-deported-dad/"
  },
  {
    "text": "Trump Has Added Risk to the Surest Bet in Global Finance … Investors buy U.S. Treasury bonds on the assumption that, come what may, the federal government will endure.Jason Andrew for The New York Times  —  There are not many certainties in the world of money, but this traditionally has been one of them … ",
    "url": "https://www.nytimes.com/2025/04/13/business/trump-risk-us-bonds.html?unlocked_article_code=1._U4.ESlJ.Av0nh-7KcMqJ"
  },
  {
    "text": "DOGE Is Far Short of Its Goal, and Still Overstating Its Progress  —  Elon Musk now says his group will produce only 15 percent of the savings it promised.  But even that estimate is inflated with errors and guesswork.  —  Last week, Elon Musk indicated for the first time that his Department … ",
    "url": "https://www.nytimes.com/2025/04/13/us/politics/doge-contracts-savings.html?unlocked_article_code=1._U4.jxBu.wPOiLoypY3tm"
  },
  {
    "text": "‘Donald Trump Needed To Send a Message’  —  The president just accelerated America's democratic backsliding — all with just the stroke of his signature on two brazenly vengeful executive orders … That is, Trump aims to severely punish and brutalize his enemies, big and small … ",
    "url": "https://www.rollingstone.com/politics/politics-features/donald-trump-order-investigate-miles-taylor-chris-krebs-1235316424/"
  },
  {
    "text": "Don't Be Fooled: RFK Jr. Is Still Talking Down Vaccines  —  THREE PEOPLE HAVE DIED in Texas and more than five hundred have gotten sick in what is shaping up as the largest single measles outbreak in decades.  And somehow Robert F. Kennedy Jr. still hasn't provided a firm … ",
    "url": "https://www.thebulwark.com/p/dont-be-fooled-rfk-jr-kennedy-is-still-talking-down-vaccines-hhs-cuts-measles-cdc"
  },
  {
    "text": "Russian strike kills at least 32, injures 99 in Sumy on Palm Sunday  —  Editor's Note: This is a developing story.  —  A Russian ballistic missile strike killed dozens of people in the northeastern Ukrainian city of Sumy on the morning of Palm Sunday, Sumy Mayor Artem Kobzar reported on April 13.",
    "url": "https://kyivindependent.com/russia-kills-over-20-in-sumy-on-palm-sunday/"
  },
  {
    "text": "Trump officials push immigrant gang message, but sometimes don't back it up in court  —  As U.S. President Donald Trump's administration cracks down on immigration, its officials have repeatedly publicly identified detainees as gang leaders or even terrorists, without attempting to back those inflammatory claims up in court.",
    "url": "https://www.reuters.com/world/us/trump-officials-push-immigrant-gang-message-sometimes-dont-back-it-up-court-2025-04-13/"
  },
  {
    "text": "The Trump Tariffs Just Got Even Worse  —  Higher costs, uncertainty and crony capitalism, oh my  —  So no, I'm not up in the middle of the night obsessing about tariffs.  It's mid-morning here.  Still, I didn't plan a tariff post today; Part I of my financial crisis primer will be going up in a few hours.",
    "url": "https://paulkrugman.substack.com/p/the-trump-tariffs-just-got-even-worse"
  },
  {
    "text": "Homeland Security Email Tells a US Citizen to ‘Immediately’ Self-Deport  —  An email sent by the Department of Homeland Security instructs people in the US on a temporary legal status to leave the country.  But who the email actually applies to—and who actually received it—is far from clear.",
    "url": "https://www.wired.com/story/homeland-security-email-tells-a-us-citizen-to-immediately-self-deport/"
  },
  {
    "text": "Harvard Professors Sue Trump Administration Over Threat to Cut Funding  —  The administration is reviewing about $9 billion in federal funding that the university receives.  —  Two groups representing Harvard professors sued the Trump administration on Friday, saying that its threat … ",
    "url": "https://www.nytimes.com/2025/04/12/us/politics/harvard-professors-trump-lawsuit-funding.html"
  },
  {
    "text": "DOGE Goons Physically Drag Social Security Worker From Desk  —  TOSSED OUT  —  The high-ranking civil servant had opposed a plan to push out migrants by falsely listing them as dead.  —  A senior executive at the Social Security Administration was physically dragged from his office this week … ",
    "url": "https://www.thedailybeast.com/doge-goons-physically-drag-social-security-worker-from-desk/"
  },
  {
    "text": "Trump tariff plans bring concern about prices, financial impact, but GOP base sees jobs long-term — CBS News poll  —  Amid a tumultuous week in the markets, the outlook on President Trump's trade and tariff policy hinges not just on what Americans think will happen, but when.",
    "url": "https://www.cbsnews.com/news/poll-trump-tariffs-13-04-2025/"
  },
  {
    "text": "The rise of end times fascism  —  The governing ideology of the far right has become a monstrous, supremacist survivalism.  Our task is to build a movement strong enough to stop them  —  The movement for corporate city states cannot believe its good luck.",
    "url": "https://www.theguardian.com/us-news/ng-interactive/2025/apr/13/end-times-fascism-far-right-trump-musk"
  },
  {
    "text": "At packed L.A. rally, Bernie Sanders says U.S. facing ‘extraordinary danger’  — A rally with Vermont Sen. Bernie Sanders and U.S. Rep. Alexandria Ocasio-Cortez drew tens of thousands of people to downtown Los Angeles.  — “Despair is not an option,” Sanders told the crowd.",
    "url": "https://www.latimes.com/politics/story/2025-04-12/bernie-sanders-fighting-oligarchy-tour-los-angeles-aoc-alexandria-ocasio-cortez-joan-baez-neil-young-maggie-rogers"
  }
]