[
  {
    "text": "McConnell Defends Polio Vaccine, an Apparent Warning to Kennedy  —  “Efforts to undermine public confidence in proven cures are not just uninformed — they're dangerous,” said the former Republican leader, who is a polio survivor.  —  Senator Mitch McConnell, the former Republican leader … ",
    "url": "https://www.nytimes.com/2024/12/13/us/politics/mcconnell-polio-vaccine-rfk-jr.html?unlocked_article_code=1.hU4.LTJL.KTBX1EbeSUzA&smid=url-share"
  },
  {
    "text": "Polio survivor Mitch McConnell criticizes efforts to undermine vaccine  —  The statement is the first time the Senate minority leader has publicly weighed in on the nomination process beyond acknowledging meeting with some of Trump's picks for his administration.",
    "url": "https://www.washingtonpost.com/politics/2024/12/13/mcconnell-polio-vaccine-trump-cabinet/"
  },
  {
    "text": "Texas files first lawsuit against out-of-state abortion provider  —  This case sets up a legal battle between Texas' near-total abortion ban and New York's shield law that protects doctors from out-of-state prosecution.  —  Texas Attorney General Ken Paxton has filed a lawsuit accusing … ",
    "url": "https://www.texastribune.org/2024/12/13/texas-paxton-abortion-pill-mail-lawsuit/"
  },
  {
    "text": "Apple CEO visits Mar-a-Lago, joining list of tech execs seemingly courting Trump  —  Apple CEO Tim Cook visited Mar-a-Lago on Friday, joining a growing list of tech executives that are seemingly courting President-elect Trump ahead of his return to the White House.",
    "url": "https://thehill.com/policy/technology/5040426-apple-tim-cook-donald-trump-visit/"
  },
  {
    "text": "Trump to Dine With Apple's Tim Cook at Mar-A-Lago Friday  — Cook skirted tariff threats on Apple in Trump's first term  — President-elect also plans meeting with Amazon's Bezos … Cook and Trump will dine at the president-elect's Mar-a-Lago club in Palm Beach, the people said … ",
    "url": "https://www.bloomberg.com/news/articles/2024-12-14/trump-to-dine-with-apple-s-tim-cook-at-mar-a-lago-friday"
  },
  {
    "text": "In Display of Fealty, Tech Industry Curries Favor With Trump  —  It was a week of frenzied activity, as Silicon Valley billionaires and their companies brandished checks and compliments for the President-elect.  —  The $1 million donations came gradually — and then all at once.  —  Meta.  Amazon.",
    "url": "https://www.nytimes.com/2024/12/14/technology/trump-tech-amazon-meta-openai.html?unlocked_article_code=1.hU4.29gd.MUs5Bt6IFE5l&smid=url-share"
  },
  {
    "text": "South Korean president Yoon Suk Yeol impeached after martial law ploy  —  Yoon must immediately hand over power to the prime minister, who will act as caretaker while the courts review the impeachment vote.  The process could take months.  —  SEOUL — The South Korean National Assembly voted Saturday … ",
    "url": "https://www.washingtonpost.com/world/2024/12/14/south-korea-yoon-impeachment-vote/"
  },
  {
    "text": "Trump says GOP will push to eliminate daylight saving time  —  President-elect Trump on Friday said Republicans would push to eliminate daylight saving time, calling it “inconvenient” and “costly.”  —  “The Republican Party will use its best efforts to eliminate Daylight Saving Time … ",
    "url": "https://thehill.com/homenews/campaign/5039673-trump-gop-daylight-saving-time/"
  },
  {
    "text": "Trump's Transition Business Largely Happens After Night Falls  —  At his Mar-a-Lago club in Florida, the president-elect has been hosting diplomatic dinners, announcing cabinet picks and firing off texts to his aides — all after the sun goes down.  —  It was past midnight in Florida this week … ",
    "url": "https://www.nytimes.com/2024/12/14/us/politics/trump-diplomacy-night-mar-a-lago.html"
  },
  {
    "text": "The Week CEOs Bent the Knee to Trump  —  Companies abandoned him after the Jan. 6, 2021, riot.  Now, they are rushing to curry favor with the president-elect as he prepares to return to the White House.  —  When Donald Trump arrived at the New York Stock Exchange this week for a postelection victory lap … ",
    "url": "https://www.wsj.com/politics/policy/donald-trump-ceos-corporate-influence-second-term-df1455f7?st=841ksg&reflink=article_copyURL_share"
  },
  {
    "text": "Trump nominates conservative culture warrior to lead DOJ civil rights  —  Harmeet Dhillon, a Republican lawyer in liberal San Francisco, is poised to be the first Sikh American to run the U.S. Department of Justice's Civil Rights Division.  —  WASHINGTON — President-elect Donald Trump tapped Harmeet Dhillon … ",
    "url": "https://www.nbcnews.com/politics/justice-department/trump-nominates-conservative-culture-warrior-lead-doj-civil-rights-rcna183588"
  },
  {
    "text": "The Memo: Trump revels as establishment figures pay homage at home and abroad  —  The second time's a charm for President-elect Trump — at least when it comes to an election win getting him the establishment recognition he has always sought.  —  Trump has received a display of homage at home … ",
    "url": "https://thehill.com/homenews/5040234-the-memo-trump-revels-as-establishment-figures-pay-homage-at-home-and-abroad/"
  },
  {
    "text": "BBC complains to Apple over misleading shooting headline  —  The BBC has complained to Apple after the tech giant's new iPhone feature generated a false headline about a high-profile murder in the United States.  —  Apple Intelligence, launched in the UK earlier this week, uses artificial intelligence … ",
    "url": "https://www.bbc.com/news/articles/cd0elzk24dno"
  },
  {
    "text": "Are Childhood Vaccines ‘Overloading’ the Immune System?  No.  —  Vaccines today are more efficient and contain far fewer stimulants to the immune system than some used decades ago.  —  It's an idea as popular as it is incorrect: American babies now receive too many vaccines … ",
    "url": "https://www.nytimes.com/2024/12/14/health/childhood-vaccines-immunity.html"
  },
  {
    "text": "Trump Backs a Longshoremen's Union That Supported Him  —  President-elect Donald J. Trump is supporting the International Longshoremen's Association, which could strike soon if it doesn't reach a deal on automation with employers.  —  Leaders of some labor unions tried to establish … ",
    "url": "https://www.nytimes.com/2024/12/14/business/economy/trump-ila-port-strike.html"
  },
  {
    "text": "Georgia lawmakers elect Western critic as new president  —  Georgian lawmakers elected Mikheil Kavelashvili, a hardline critic of the West, as president on Saturday, setting him up to replace a pro-Western incumbent amid major protests against the government over a halt to the country's European Union accession talks last month.",
    "url": "https://www.reuters.com/world/europe/lawmakers-georgia-elect-hardline-critic-west-new-president-2024-12-14/"
  },
  {
    "text": "Bringing Elon to a knife fight  —  DOGE has made it both impossible not to talk about government reform, and impossible to talk about it.  The topic is everywhere, but the subject is now entirely eclipsed on the left by the horror of who has been assigned the task and the need to decry DOGE as a bad faith effort.",
    "url": "https://www.eatingpolicy.com/p/bringing-elon-to-a-knife-fight"
  },
  {
    "text": "Donald Trump ‘eyes deal’ to save failing DC Waldorf-Astoria, turn it back into Trump International Hotel  —  President-elect Donald Trump is weighing a bid to save the failing Waldorf-Astoria hotel in Washington, DC - and rebrand it once more as a Trump International Hotel, The Post has learned.",
    "url": "https://nypost.com/2024/12/13/business/donald-trump-eyes-deal-for-waldorf-astoria-dc-hotel/"
  },
  {
    "text": "Biden Administration Is Said to Allow California to Ban New Gas-Powered Cars  —  California and 11 other states want to halt the sale of new gas-powered cars by 2035.  President-elect Donald Trump is expected to try to stop them.  —  The Biden administration is expected in the coming days … ",
    "url": "https://www.nytimes.com/2024/12/13/climate/california-ban-gas-cars-electric-biden-trump.html"
  },
  {
    "text": "Vance invites Daniel Penny, acquitted in chokehold death, to Army-Navy game  —  Penny, a former Marine, was asked to accompany President-elect Donald Trump in his suite at the game Saturday.  —  Vice President-elect JD Vance has invited Daniel Penny, a former Marine who was acquitted … ",
    "url": "https://www.washingtonpost.com/politics/2024/12/13/vance-daniel-penny-army-navy-football-trump/"
  },
  {
    "text": "Patel Distorts Justice Dept. Benghazi Inquiry, Inflating His Role  —  Donald J. Trump's pick to be the next F.B.I. director has both exaggerated his importance in the government's criminal inquiry into the 2012 attack and misleadingly distorted its conduct and results.",
    "url": "https://www.nytimes.com/2024/12/13/us/politics/kash-patel-benghazi-investigation-doj.html"
  },
  {
    "text": "Democrats need to change their approach to Trump's second term, top Kamala Harris pollster says  —  One of the first public airings of Democrats' strategy suggests they should try something new this time around with the president-elect.  —  A pollster to Kamala Harris' presidential campaign … ",
    "url": "https://www.politico.com/news/2024/12/13/democrats-2024-election-retrospective-trump-00194273"
  }
]