[
  {
    "text": "The ‘faith-based’ leader for Philly's Moms for Liberty chapter is a registered sex offender  —  Phillip Fisher Jr. is a pastor and Republican ward leader who coordinates faith-based outreach for Philadelphia's Moms for Liberty chapter.He's also a registered sex offender … ",
    "url": "https://www.inquirer.com/politics/philadelphia/moms-for-liberty-philadelphia-pastor-sex-offender-20231120.html"
  },
  {
    "text": "Right-Wing ‘Moms for Liberty’ Organizer Is a Convicted Sex Offender  —  Phillip Fisher Jr., who does faith-based outreach for the group in Philadelphia, abused a 14-year-old in 2011, The Philadelphia Inquirer reported on Monday  —  MOMS FOR LIBERTY is a conservative parental rights group … ",
    "url": "https://www.rollingstone.com/politics/politics-news/moms-for-liberty-organizer-convicted-sex-offender-1234887013/"
  },
  {
    "text": "The Real Reason Why Biden Shouldn't Drop Out  —  Panicked Democrats, vibrating with anxiety over the polls, continue to nurture an unlikely fantasy: Joe Biden looks at his family across the Thanksgiving table on Nantucket and says with a weary sigh, “I can't do this for another five years.",
    "url": "https://newrepublic.com/article/177020/real-reason-biden-shouldnt-drop"
  },
  {
    "text": "Sen. Mike Lee promotes a debunked conspiracy theory about a Jan. 6 rioter  —  Kevin Lyons stole a photo and a wallet from Nancy Pelosi's office, but conservative figures are using a video of the Trump supporter to spread misinformation about Jan. 6.  —  WASHINGTON — A Republican senator … ",
    "url": "https://www.nbcnews.com/politics/justice-department/sen-mike-lee-promotes-debunked-conspiracy-theory-jan-6-rioter-rcna125993"
  },
  {
    "text": "Greene calls for new Jan. 6 select committee  —  Rep. Marjorie Taylor Greene (R-Ga.) on Sunday called on Speaker Mike Johnson (R-La.) to create a new Jan. 6 select committee she said would target the original members of the panel and exonerate the so-called “MAGA” wing of the Republican Party … ",
    "url": "https://thehill.com/homenews/house/4318796-greene-new-jan-6-select-committee/"
  },
  {
    "text": "Federal appeals court ruling threatens enforcement of the Voting Rights Act  —  The decision from the 8th Circuit is likely headed to the Supreme Court.  —  A federal appeals court issued a ruling Monday that could gut the Voting Rights Act, saying only the federal government … ",
    "url": "https://www.politico.com/news/2023/11/20/federal-court-deals-devastating-blow-to-voting-rights-act-00128069"
  },
  {
    "text": "The lion, the wig and the warrior.  Who is Javier Milei, Argentina's president-elect?  —  His legions of fans call him “the madman” and “the wig” due to his ferocity and unruly mop of hair.  He refers to himself as “the lion.”  He thinks sex education is a Marxist plot to destroy the family … ",
    "url": "https://apnews.com/article/javier-milei-profile-argentina-election-82488d49cca5aee10d4b911bde530922"
  },
  {
    "text": "Many former Trump aides say he shouldn't be president.  Will it matter?  —  Critics are grappling with how they can puncture Trump's candidacy in 2024 and whether their voices will have any impact  —  John F. Kelly, the longest-serving chief of staff in President Donald Trump's White House … ",
    "url": "https://www.washingtonpost.com/nation/2023/11/20/trump-aides-cabinet-critics-election/"
  },
  {
    "text": "Appeals court judges express skepticism as Trump lawyer fights to reverse gag order in Jan. 6 case  —  At oral arguments debating whether a temporarily-lifted gag order on Donald Trump in his election subversion case in Washington, D.C., is warranted, it was a question of the First Amendment and faith … ",
    "url": "https://lawandcrime.com/high-profile/appeals-court-judges-express-skepticism-as-trump-lawyer-fights-to-reverse-gag-order-in-jan-6-case/"
  },
  {
    "text": "Trump's Retribution … The New York Times political correspondent Maggie Haberman tells Jamie that a second Trump will be defined by unfettered score settling.  Plus:  —Trump's social media strategy  —Bannon friction -Trump/Carlson 24?  —Trump's totalitarian rhetoric -The trials are happening",
    "url": "https://thedispatch.com/podcast/dispatch-podcast/trumps-retribution/"
  },
  {
    "text": "Richest 1% account for more carbon emissions than poorest 66%, report says  —  ‘Polluter elite’ are plundering the planet to point of destruction, says Oxfam after comprehensive study of climate inequality  —  The richest 1% of humanity is responsible for more carbon emissions than the poorest 66% … ",
    "url": "https://www.theguardian.com/environment/2023/nov/20/richest-1-account-for-more-carbon-emissions-than-poorest-66-report-says"
  },
  {
    "text": "Support for Abortion Access Is Near Record, WSJ-NORC Poll Finds  —  Some 55% of respondents say a pregnant woman should be able to get an abortion for any reason  —  Santana De'LaBay, a 29-year-old Republican with six children, thinks her party is wrong to back broad abortion restrictions.",
    "url": "https://www.wsj.com/politics/policy/support-for-abortion-access-is-near-record-wsj-norc-poll-finds-6021c712?mod=followamazon"
  },
  {
    "text": "Cardi B declines to endorse Biden, pointing to spending on wars  —  Rapper and actress Cardi B declined to lend her endorsement to President Biden's 2024 reelection effort, noting New York City's recent public service cuts and the country providing resources to Israel and Ukraine.",
    "url": "https://thehill.com/blogs/in-the-know/4319368-cardi-b-declines-to-endorse-biden-pointing-to-spending-on-wars/"
  },
  {
    "text": "RFK Jr. leads 2024 candidates in favorability poll  —  Independent presidential candidate Robert F. Kennedy Jr. currently leads the pack of 2024 presidential candidates with a high favorability rating among respondents in a Harvard CAPS-Harris survey.  —  The poll, published Monday and shared … ",
    "url": "https://thehill.com/homenews/campaign/4319127-rfk-jr-leads-2024-candidates-in-favorability-poll/"
  },
  {
    "text": "Who Is Most Responsible For Divisions In The U.S.?  Social Media Ranks #1 Among Young Voters, Quinnipiac University National Poll Finds; Table The Talk About Politics At Thanksgiving, Say Voters  —  mail_outline  —  Given a list of four options and asked which they hold most responsible … ",
    "url": "https://poll.qu.edu/poll-release?releaseid=3885"
  },
  {
    "text": "4 more free COVID tests will be available to each household ahead of the holidays  —  The winter season is expected to bring a resurgence of the virus.  —  Boxes of BinaxNow a COVID-19 at home test kit made by Abbott, Aug. 13, 2022, in North Haledon, N.J.  —  Ahead of the approaching holidays … ",
    "url": "https://abcnews.go.com/Health/4-free-covid-tests-household-ahead-holidays/story?id=104989775"
  },
  {
    "text": "6 in 10 Trump voters say there's a ‘chance’ they choose another candidate: Poll  —  More than 60 percent of Trump primary voters said there is “at least some chance” they would support a candidate other than former President Trump in the Republican presidential primary, according to a survey … ",
    "url": "https://thehill.com/homenews/campaign/4318892-6-in-10-trump-voters-say-chance-they-choose-another-candidate-poll/"
  }
]