[
  {
    "text": "Injuries reported in shooting at Georgia high school  —  WINDER, Ga. (AP) — Injuries have been reported after a school shooting at a Georgia high school, which was put on lockdown Wednesday and students gathered in its football stadium, the local sheriff's office said.",
    "url": "https://apnews.com/article/georgia-high-school-lockdown-3969d34cf6a7adc787facf21c469ef4d"
  },
  {
    "text": "At least 4 killed, approximately 30 injured in school shooting, sources say  —  At least four people are believed to have been killed and approximately 30 more injured in a shooting at Apalachee High School in Winder, Georgia, according to law enforcement sources in the state.",
    "url": "https://www.cnn.com/2024/09/04/us/winder-ga-shooting-apalachee-high-school/"
  },
  {
    "text": "Exclusive: Biden administration to accuse Russia of sustained effort to influence 2024 election  —  The Biden administration on Wednesday plans to accuse Russia of a sustained effort to influence the 2024 US presidential election by using Kremlin-run media and other online platforms … ",
    "url": "https://www.cnn.com/2024/09/04/politics/biden-administration-accuse-russia-election-influence-efforts"
  },
  {
    "text": "Two RT Employees Indicted for Covertly Funding and Directing U.S. Company that Published Thousands of Videos in Furtherance of Russian Interests  —  For Immediate Release  —  Employees of Russian State-Controlled Media Outlet Deployed Nearly $10 Million to Publish RT-Curated Content … ",
    "url": "https://www.justice.gov/opa/pr/two-rt-employees-indicted-covertly-funding-and-directing-us-company-published-thousands"
  },
  {
    "text": "CNN polls across six battlegrounds find Georgia and Pennsylvania are key toss-ups  —  The 2024 presidential campaign's home stretch kicks off with a mixed outlook across six key battlegrounds, according to new CNN polls conducted by SSRS in each state.  Vice President Kamala Harris holds … ",
    "url": "https://www.cnn.com/2024/09/04/politics/cnn-polls-battleground-states/"
  },
  {
    "text": "Biden preparing to block Nippon Steel purchase of U.S. Steel  —  The move would pose a setback for relations with Japan.  —  President Joe Biden is preparing to announce that he will formally block Nippon Steel's proposed $14.9 billion acquisition of U.S. Steel, according to three people … ",
    "url": "https://www.washingtonpost.com/business/2024/09/04/biden-prepares-reject-us-steel-deal/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI1NDIyNDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI2ODA0Nzk5LCJpYXQiOjE3MjU0MjI0MDAsImp0aSI6ImQxNGEyNzNiLTUyODctNGU3NC05YzUwLWIwMTJiZDg4MzE1MyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9idXNpbmVzcy8yMDI0LzA5LzA0L2JpZGVuLXByZXBhcmVzLXJlamVjdC11cy1zdGVlbC1kZWFsLyJ9.PP55NWyK3q3sUrSHQes3Ep8d13B-HoketReHAX-TOaY&itid=gfta"
  },
  {
    "text": "U.S. Steel Warns of Plant Closings if Sale Collapses  —  Company says it might move headquarters out of Pittsburgh if Nippon Steel can't complete $14.1 billion purchase  —  U.S. Steel's chief executive said the company would close steel mills and likely move its headquarters out of Pittsburgh … ",
    "url": "https://www.wsj.com/business/u-s-steel-warns-of-plant-closings-if-sale-collapses-4ef45756?st=39nvoz2g4o7rrf3&reflink=article_copyURL_share"
  },
  {
    "text": "Barron Trump arrives at NYU for first day at college  —  Former President Donald Trump's youngest child, Barron Trump, was spotted arriving at New York University Wednesday to kick off his first day of college life.  —  The towering 18-year-old was flanked by Secret Service agents … ",
    "url": "https://nypost.com/2024/09/04/us-news/barron-trump-arrives-at-nyu-for-first-day-at-college/"
  },
  {
    "text": "Watchdog seeks Cannon removal from Trump documents case  —  Video Player is loading.  —  Play Video  —  Unmute  —  Current Time 0:00 … Stream Type LIVE  —  Seek to live, currently behind liveLIVE  —  Playback Rate  —  Chapters  — Chapters  —  Descriptions  — descriptions off, selected",
    "url": "https://thehill.com/regulation/court-battles/4861235-crew-requests-removal-cannon/"
  },
  {
    "text": "If Republicans Want to Win, They Need Trump to Lose — Big  —  To dominate the country once more, Republicans need to hasten the move to a post-Trump party.  —  Accepting his party's nomination in 1984, Democrat Walter Mondale vowed to cut the deficit with a memorable line about the tough medicine either … ",
    "url": "https://www.politico.com/news/magazine/2024/09/04/kamala-harris-republicans-after-trump-00177194"
  },
  {
    "text": "Ginni Thomas Privately Praised Group Working Against Supreme Court Reform: “Thank You So, So, So Much”  —  In a call with donors, First Liberty Institute's Kelly Shackelford read the supportive email he said came from Thomas.  The leader of the religious-rights group also labeled Justice Elena Kagan … ",
    "url": "https://www.propublica.org/article/ginni-thomas-email-scotus-ethics-reform-first-liberty-institute"
  },
  {
    "text": "Tim Walz's family members reveal they are backing TRUMP in bombshell leaked photo  —  A new leaked image shows members of vice presidential candidate Gov. Tim Walz's family are supporting his Republican rival.  —  The photo shared by former Nebraska GOP gubernatorial candidate Charles W … ",
    "url": "https://www.dailymail.co.uk/news/article-13812837/Tim-Walz-family-brother-Trump-Kamala-campaign.html"
  },
  {
    "text": "Vulnerable Republicans worry Johnson's spending plan increases shutdown risk  —  The speaker told GOP lawmakers in a private call on Wednesday that he's planning to bring a conservative-favored funding package up for a vote.  —  Some of the House GOP's most vulnerable members told Speaker Mike Johnson … ",
    "url": "https://www.politico.com/news/2024/09/04/republicans-johnson-spending-plan-shutdown-00177322"
  },
  {
    "text": "Silver Bulletin 2024 presidential election forecast  —  All the numbers for Trump vs. Harris.  —  ∙ Paid … Let's cut to the chase: So, who's gonna win the election?  —  Well, honestly, we don't know — but we can give you our best probabilistic guess.",
    "url": "https://www.natesilver.net/p/nate-silver-2024-president-election-polls-model"
  },
  {
    "text": "Kamala Harris to Pare Back Biden's Capital-Gains Tax Proposal  —  Advisers believe a more-modest increase would balance taxing wealthy households and encouraging investment  —  WASHINGTON—Democratic presidential nominee Kamala Harris is planning to propose a less drastic increase … ",
    "url": "https://www.wsj.com/politics/policy/kamala-harris-to-pare-back-bidens-capital-gains-tax-proposal-14c537b1"
  },
  {
    "text": "How the Media Sanitizes Trump's Insanity  —  Four years ago, in an article for Media Matters for America, I warned that journalists were sanitizing Donald Trump's incoherent ramblings to make them more palatable for the average voter.  The general practice went like this … ",
    "url": "https://newrepublic.com/article/185530/media-criticism-trump-sanewashing-problem"
  },
  {
    "text": "Why thousands of Florida students are not being taught sex ed  —  In May 2023, Florida Governor Ron DeSantis (R) signed Florida House Bill 1069, a law that requires sex education classes in the state to conform to right-wing ideology.  Specifically, the law requires all sex education classes … ",
    "url": "https://popular.info/p/why-thousands-of-florida-students"
  },
  {
    "text": "Republican House panel subpoenas Gov. Walz in investigation of Minnesota nonprofit that ran a Covid aid scheme  —  The group Feeding Our Future faces federal criminal charges that it created fake children's names to seek reimbursements for meals that were never served.",
    "url": "https://www.nbcnews.com/politics/congress/republican-house-panel-subpoenas-gov-walz-investigation-minnesota-non-rcna169436"
  },
  {
    "text": "‘A ton of Covid out there’: US summer wave not taken seriously enough - experts  —  Epidemiologists push newly approved booster vaccines as current virus strain threatens at-risk groups  —  Infectious disease experts say many people are not taking the latest Covid-19 wave in the US seriously enough … ",
    "url": "https://www.theguardian.com/us-news/article/2024/sep/04/covid-19-summer-wave"
  }
]