[
  {
    "text": "I'm the Governor of Ohio.  I Don't Recognize the Springfield That Trump and Vance Describe.  —  I was born in Springfield, Ohio.  My wife, Fran, and I have lived our entire lives less than 10 miles from this city.  —  When we were dating in high school, we would go there to see movies … ",
    "url": "https://www.nytimes.com/2024/09/20/opinion/springfield-haitian-migrants-ohio.html?unlocked_article_code=1.ME4.GXDA.7LLopMRyJqap&smid=url-share"
  },
  {
    "text": "How Dumb Do They Think You Are?  —  Ohio's Republican governor, Mike DeWine, comes to the defense of Springfield and its Haitian community in the New York Times today: … Happy Friday.  —  Uh, Gross  —Andrew Egger  —  When the rumor mill started churning yesterday that some major … ",
    "url": "https://www.thebulwark.com/p/how-dumb-do-they-think-you-are"
  },
  {
    "text": "Trump Ignores Mark Robinson Controversy, Hoping Gubernatorial Candidate Will Drop Out  —  CNN's article scrambled G.O.P. plans for winning North Carolina.  People close to Donald Trump are holding out hope Lt. Gov. Mark Robinson will decide to quit the governor's race.",
    "url": "https://www.nytimes.com/2024/09/20/us/politics/trump-mark-robinson.html"
  },
  {
    "text": "New Court Filings Place Matt Gaetz at a Party at the Center of the Sex Trafficking Scandal  —  This is the first public filing that cites sworn testimony alleging that Gaetz attended one of the long-rumored parties with a teenage girl.  — Copy  —  Rep. Matt Gaetz attended a drug-fueled sex party … ",
    "url": "https://www.notus.org/florida/new-court-filings-matt-gaetz-dorworth-sex-party"
  },
  {
    "text": "Pro-Trump Georgia election board votes to require hand counts of ballots  —  Critics plan to sue, saying the new requirement would almost certainly lead to errors and could disrupt the process of certifying the vote in a crucial battleground state.  —  ATLANTA — The Georgia State Election Board approved … ",
    "url": "https://www.washingtonpost.com/politics/2024/09/20/trump-georgia-election-board-hand-count-ballots/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI2ODA0ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI4MTg3MTk5LCJpYXQiOjE3MjY4MDQ4MDAsImp0aSI6IjE4ZWFiMzg0LWI0YzAtNDg0OS1iZDAyLWQ2OWY3M2Q4OWUzMyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzA5LzIwL3RydW1wLWdlb3JnaWEtZWxlY3Rpb24tYm9hcmQtaGFuZC1jb3VudC1iYWxsb3RzLyJ9.6YbhZUEbRz6Z5KR45vVgeF7W8k1P4tuRjFroyQvDRR8"
  },
  {
    "text": "Nuzzi's RFK Relationship  —  “Had the magazine been aware of this relationship, she would not have continued to cover the presidential campaign,” the spokesperson said. … “Recently our Washington Correspondent Olivia Nuzzi acknowledged to the magazine's editors that she had engaged … ",
    "url": "https://www.status.news/p/olivia-nuzzi-rfk-new-york-magazine"
  },
  {
    "text": "Trump says Jews would deserve much of the blame if he loses  —  In a speech Thursday billed as former President Donald Trump's answer to rising antisemitism, he said Jews would bear much of the responsibility if he loses the presidential election.  —  And in a second speech later in the evening … ",
    "url": "https://forward.com/fast-forward/655947/trump-jews-blame-israel-harris/"
  },
  {
    "text": "Exclusive: Harris campaign launching new ad seeking to tie Trump to Mark Robinson  —  Vice President Kamala Harris' campaign on Friday launched a new television ad seeking to tie former President Donald Trump to North Carolina's Republican gubernatorial nominee Mark Robinson … ",
    "url": "https://www.cnn.com/2024/09/20/politics/mark-robinson-donald-trump-kamala-harris-ad/"
  },
  {
    "text": "Microsoft deal would reopen Three Mile Island nuclear plant to power AI  —  The owner of the shuttered Pennsylvania plant plans to bring it online by 2028, with the tech giant buying all the power it produces.  —  Pennsylvania's dormant Three Mile Island nuclear plant would be brought … ",
    "url": "https://www.washingtonpost.com/business/2024/09/20/microsoft-three-mile-island-nuclear-constellation/"
  },
  {
    "text": "Trump Media hits new 52-week low after DJT lockup restrictions expire … Shares of Trump Media sank more than 7% Friday morning, hitting a new 52-week low one day after “lockup” restrictions expired, which had previously prevented its majority shareholder, former President Donald Trump … ",
    "url": "https://www.cnbc.com/2024/09/20/djt-trump-media-stock-selloff-lockup-.html"
  },
  {
    "text": "Harris Hits Core Campaign Themes in Emotional Forum With Oprah Winfrey  —  Vice President Kamala Harris spoke off the cuff, as guests included a teenager shot at her school and the family of a woman in Georgia who died as a result of the state's abortion ban.",
    "url": "https://www.nytimes.com/2024/09/20/us/politics/kamala-harris-oprah-winfrey-event.html"
  },
  {
    "text": "I co-chaired Nikki Haley's Iowa campaign.  I am endorsing Kamala Harris.  —  I heard Harris articulate that she has always brought groups of diverse individuals and opinions together to solve problems.  That is a healthier and wiser way to lead.  —  I served as an Iowa state co-chair of the Nikki Haley for President campaign.",
    "url": "https://www.desmoinesregister.com/story/opinion/columnists/iowa-view/2024/09/20/republicans-for-kamala-harris-dawn-roberts-iowa-campaign-nikki-haley/75306017007/"
  },
  {
    "text": "Mark Robinson offers up the 2024 version of the I-was-hacked defense  —  “AI” is the new “hackers.”  —  One of the least credible ways in which North Carolina Lt. Gov. Mark Robinson (R) attempted to dismiss Thursday's report about wildly offensive comments he made on the message board … ",
    "url": "https://www.washingtonpost.com/politics/2024/09/20/mark-robinson-comments-cnn-story-north-carolina/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI2ODA0ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI4MTg3MTk5LCJpYXQiOjE3MjY4MDQ4MDAsImp0aSI6IjgwN2NkNzM2LWIxZTQtNDcwMi05NzExLWEzZjBiODc4NzA5NCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzA5LzIwL21hcmstcm9iaW5zb24tY29tbWVudHMtY25uLXN0b3J5LW5vcnRoLWNhcm9saW5hLyJ9.zR5XcwuqZr6U3Bf1BS_Sx0k3RvfcM5aVNMj9j6E0GfI&itid=gfta"
  },
  {
    "text": "Kentucky sheriff charged in killing of judge at courthouse  —  A judge in a rural Kentucky county was shot and killed in his courthouse chambers Thursday, and the local sheriff was charged with murder, police said.  The preliminary investigation indicates Letcher County Sheriff Shawn M. Stines … ",
    "url": "https://apnews.com/article/courthouse-shooting-kentucky-f93419fff14202a88e28b5ea49b26810"
  },
  {
    "text": "The Trump Lie Machine Is Broken  —  It shouldn't have taken a year, let alone nine, for political elites to stop getting snookered by Donald Trump.  —  I say that as someone with very low expectations.  Being an easy mark is part of the price of admission to the heights of American discourse.",
    "url": "https://www.offmessage.net/p/the-trump-lie-machine-is-broken"
  },
  {
    "text": "Which Mexico are you?  New Mexico furious after Texas installs razor wire along its border  —  Texas' latest move is a ‘political stunt’ that will have 'will have no meaningful impact on our nation's broken immigration system,' New Mexico Governor Michelle Lujan Grisham said",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/texas-new-mexico-border-wire-b2615743.html"
  },
  {
    "text": "How they have failed us  —  It is as if the editorial department at The Washington Post woke up one morning asking, in headlines I will quote below, “What are we doing wrong?”  —  I will start by trying to answer the question for them, The New York Times, CNN, and the rest of incumbent journalism:",
    "url": "https://buzzmachine.com/2024/09/19/how-they-have-failed-us/"
  },
  {
    "text": "House Republicans work to defuse Trump as they defy shutdown demands  —  GOP appropriators have been calling their presidential nominee, trying to convince him his calls to shut down the government over a voting bill are a bad idea.  —  House Republicans are typically hesitant to defy Donald Trump.",
    "url": "https://www.politico.com/news/2024/09/20/house-gop-trump-shutdown-00180243"
  },
  {
    "text": "White officer who fatally shot Black man shouldn't have been in his backyard, judge rules in suit  —  A federal judge has partially sided with the family of a Black man who was fatally shot by a now-imprisoned white Kansas City, Missouri, police detective, ruling that the officer should not have entered the man's backyard.",
    "url": "https://apnews.com/article/exkansas-city-detective-wrongful-death-lawsuit-59a7e2b9fa8c512969608d52bd94fab3"
  },
  {
    "text": "Trump's Deranged Plan to Lower Food Prices by Raising Them  —  At a campaign event on Tuesday night, Donald Trump vowed to lower the price of groceries by ... taxing them?  Responding to a question about food costs, Trump told the Michigan audience that his plan would entail both energy deregulation … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/09/trump-tariffs-grocery-prices/679942/"
  }
]