[
  {
    "text": "Republicans ramp up search for an escape hatch from speaker chaos  —  A bipartisan solution to the GOP's leadership problems still sounds farfetched to most.  But then, so does Jim Jordan's prospects of winning next week.  —  Centrists are signaling they're open to a deal.  Democrats are outlining terms.",
    "url": "https://www.politico.com/news/2023/10/13/stopgap-speaker-00121409"
  },
  {
    "text": "Democrats refuse to help GOP out of House speaker mess, trashing Jim Jordan as an ‘insurrectionist’  —  Democratic leaders spoke on the steps of the Capitol and dialed up their rhetoric against Republicans for nominating a conservative firebrand to be the next House speaker.",
    "url": "https://www.nbcnews.com/politics/congress/democrats-refuse-help-republicans-house-speaker-mess-rcna120242"
  },
  {
    "text": "Jordan clinches Speaker nomination in GOP's second go at the gavel  —  House Republicans nominated Rep. Jim Jordan (R-Ohio) for Speaker on Friday, the conference's second attempt to find a candidate who can win the gavel on the House floor.  —  Jordan, currently chair of the House Judiciary Committee … ",
    "url": "https://thehill.com/homenews/house/4254931-jim-jordan-wins-speaker-nomination/"
  },
  {
    "text": "House Republicans collapse into anarchy  —  War in Israel.  War in Ukraine.  The federal government shutting down in 35 days.  These are uncertain times.  —  But there is one eternal truth, one unwavering constant to steady us when all else is in flux: Every time the House Republican majority tries … ",
    "url": "https://www.washingtonpost.com/opinions/2023/10/13/scalise-jordan-house-gop-speaker-chaos/"
  },
  {
    "text": "GOP lawmaker plans to launch a bid for House speaker if Jim Jordan falls short  —  Rep. Mike Johnson, R-La., is laying the groundwork to seek the speaker's gavel if Rep. Jim Jordan, the party's current nominee, is unable to get the votes needed on the House floor.",
    "url": "https://www.nbcnews.com/politics/congress/mike-johnson-plans-launch-house-speaker-bid-jim-jordan-falters-rcna120403"
  },
  {
    "text": "Live updates House GOP voting on speaker hopefuls Jim Jordan and Austin Scott  —  House Republicans on Friday afternoon are holding a closed-door vote between two nominees for speaker: Reps. Jim Jordan (Ohio) and Austin Scott (Ga.).  The conference is scrambling to find a nominee … ",
    "url": "https://www.washingtonpost.com/politics/2023/10/13/house-speaker-vote/"
  },
  {
    "text": "Israel orders unprecedented evacuation of 1 million in Gaza as possible ground offensive looms  —  Gaza's energy crisis risk hospitals turning into morgues  —  Israel Defense Forces release footage of assault on Gaza-adjacent outpost  —  Israel's military told some 1 million Palestinians … ",
    "url": "https://apnews.com/article/israel-palestinians-gaza-hamas-war-c8b4fc20e4fd2ef381d5edb7e9e8308c"
  },
  {
    "text": "Stunning State Department Memo Warns Diplomats: No Gaza ‘De-Escalation’ Talk  —  As Israel escalates its offensive, U.S. diplomats are being discouraged from publicly using three phrases that would urge calm.  —  As Israel escalates its attacks on Gaza, the State Department … ",
    "url": "https://www.huffpost.com/entry/state-department-internal-emails-gaza-israel_n_65296395e4b0a304ff6ff95d"
  },
  {
    "text": "Israeli President Says There Are No Innocent Civilians In Gaza  —  “It is an entire nation out there that is responsible,” Isaac Herzog said as Israel ordered 1.1 million Palestinians to evacuate their homes.  —  LOADING  —  As Israel engages in a massive air campaign ahead … ",
    "url": "https://www.huffpost.com/entry/israel-gaza-isaac-herzog_n_65295ee8e4b03ea0c004e2a8"
  },
  {
    "text": "Trump falsely characterized Israel's role in his administration's hit on Iran's Soleimani, say former U.S. officials  —  “They were never on board with it,” said a former senior White House official, referring to the Israelis.  “They always thought it was a dangerous and destabilizing idea.”",
    "url": "https://www.nbcnews.com/politics/national-security/trump-mischaracterized-israel-role-hit-iran-soleimani-rcna120368"
  },
  {
    "text": "‘Top secret’ Hamas documents show that terrorists intentionally targeted elementary schools and a youth center  —  Maps and documents recovered from the bodies of Hamas attackers reveal a coordinated plan to target children and take hostages inside an Israeli village near Gaza.",
    "url": "https://www.nbcnews.com/news/investigations/top-secret-hamas-documents-show-terrorists-intentionally-targeted-elem-rcna120310"
  },
  {
    "text": "Michael Cohen Set to Skip Trump Bank Fraud Trial Testimony  —  Cohen is poised to be a star witness in the New York AG's case against his former boss, but he is planning to skip his appearance next week. … Michael Cohen, the archenemy of Donald Trump, was set to be the star witness at the ex-president's ongoing bank fraud trial.",
    "url": "https://www.thedailybeast.com/michael-cohen-set-to-skip-donald-trump-new-york-bank-fraud-trial-testimony"
  },
  {
    "text": "4 Democratic centrists to McHenry: Let's make a deal  —  In a letter to McHenry that was obtained by POLITICO, the Democrats floated giving him “temporary, expanded authorities” — in exchange for concessions.",
    "url": "https://www.politico.com/live-updates/2023/10/13/congress/dems-to-mchenry-00121499"
  },
  {
    "text": "Dennis Kucinich Leaves Robert F. Kennedy Jr.'s Presidential Campaign  —  The former Democratic congressman, who served as Mr. Kennedy's campaign manager, departed just days after he introduced Mr. Kennedy as an independent candidate.  —  Dennis J. Kucinich has left his post … ",
    "url": "https://www.nytimes.com/2023/10/13/us/politics/rfk-campaign-dennis-kucinich.html"
  },
  {
    "text": "Stanford students say lecturer called Jews in class ‘colonizers,’ minimized Holocaust  —  As Stanford University investigates reports that a lecturer discussing the war between Hamas and Israel “called out individual students in class based on their backgrounds and identities,” … ",
    "url": "https://www.sfchronicle.com/bayarea/article/suspended-stanford-teacher-allegedly-separated-18423074.php"
  },
  {
    "text": "Israel Is Walking Into a Trap  —  Storming into Gaza will fulfill Hamas's wish.  —  It's a trap.  Hamas's ruthless and spectacular attack on southern Israel last Saturday was many things: an atrocity, a display of militant ingenuity, and a demonstration of the weakness of Israeli intelligence and defenses.",
    "url": "https://www.theatlantic.com/international/archive/2023/10/israel-hamas-war-iran-trap/675628/"
  },
  {
    "text": "US intelligence warned of the potential for violence days before Hamas attack  —  The US intelligence community produced at least two assessments based in part on intelligence provided by Israel warning the Biden administration of an increased risk for Palestinian-Israeli conflict in the weeks ahead … ",
    "url": "https://www.cnn.com/2023/10/13/politics/us-intelligence-warnings-potential-gaza-clash-days-before-attack/"
  }
]