[
  {
    "text": "Trump Leads in 5 Key States, as Young and Nonwhite Voters Express Discontent With Biden  —  A new set of Times/Siena polls, including one with The Philadelphia Inquirer, reveal an erosion of support for the president among young and nonwhite voters upset about the economy and Gaza.",
    "url": "https://www.nytimes.com/2024/05/13/us/politics/biden-trump-battleground-poll.html"
  },
  {
    "text": "Cross-Tabs: May 2024 Times/Siena Poll of the Presidential Battlegrounds  —  Donald Trump leads Joe Biden in five of six states polled by The New York Times, The Philadelphia Inquirer and Siena College from April 28 to May 9, 2024.  —  View toplines for the full set of polls and cross-tabs for: all registered voters |",
    "url": "https://www.nytimes.com/interactive/2024/05/13/us/elections/times-siena-poll-registered-voter-crosstabs.html"
  },
  {
    "text": "How on Earth is Donald Trump Getting Credit for Joe Biden's Economy? … Joe Biden's trip to Wisconsin last week would, in normal political times, have been a grand slam.  He went to the very spot in Racine County where, in 2018, Donald Trump showed up literally holding a golden shovel … ",
    "url": "https://newrepublic.com/article/181499/earth-donald-trump-getting-credit-joe-bidens-economy"
  },
  {
    "text": "Justice Thomas has used this “hideous place” to amass the power he now exploits  —  Anyone who lives in Washington, D.C., and says they hate it here have almost always, with rare exceptions, never made the actual Washington their home.  They have limited themselves to the halls of power … ",
    "url": "https://www.lawdork.com/p/justice-thomas-attacks-dc-as-hideous"
  },
  {
    "text": "The biggest flaw in Justice Clarence Thomas' newest complaints  —  Justice Clarence Thomas wants the public to believe the serious accusations he's faced are “lies.”  He's going to have to be far more specific.  —  As a matter of jurisprudence, Supreme Court Justice Clarence Thomas has reason to be pleased.",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/biggest-flaw-justice-clarence-thomas-newest-complaints-rcna151935"
  },
  {
    "text": "The real cancel culture  —  In 2020, Bari Weiss quit her job as an editor and writer at the New York Times editorial page in a huff.  In her public resignation letter, Weiss argued that she was forced out because the paper had become “illiberal” and her more conservative beliefs made her … ",
    "url": "https://popular.info/p/the-real-cancel-culture"
  },
  {
    "text": "Psaki's new book falsely recounts Biden's watch check in troop ceremony  —  Former White House press secretary Jen Psaki claims in her new book that President Biden never looked at his watch during the ceremony for soldiers killed during the U.S. withdrawal from Afghanistan in 2021 … ",
    "url": "https://www.axios.com/2024/05/13/psaki-book-biden-watch-check-afghanistan"
  },
  {
    "text": "My life as a Chinese spy: Secret police agent tells all  —  Loading...  abc.net.au/news/china-spy-secret- police-agent-tells-all-four-corners/ 103826708  —  For the first time ever, an undercover agent for China's secret police steps out of the shadows to tell all about where he's been and who he's been targeting.",
    "url": "https://www.abc.net.au/news/2024-05-13/china-spy-secret-police-agent-tells-all-four-corners/103826708"
  },
  {
    "text": "Tim O'Brien on 35 years of covering Trump  —  “His id and animal impulses weren't fully unleashed in the way they are now.”  —  ∙ Paid … Ten years before Donald Trump came down that golden escalator to change the course of American history, Tim O'Brien had already exposed him as a fraud.",
    "url": "https://www.publicnotice.co/p/tim-obrien-interview-trump-2024"
  },
  {
    "text": "State Republican parties are going rogue  —  Good morning, Early Birds.  Staring at the sky to watch the eclipse is out.  Staring at the sky to watch the aurora borealis is in.  (At least it can't damage your eyes.)  Tips: earlytips@washpost.com.  Was this forwarded to you?  Sign up here.",
    "url": "https://www.washingtonpost.com/politics/2024/05/13/state-republican-parties-are-going-rogue/"
  },
  {
    "text": "Three people charged with offences under the National Security Act  —  Three people have been charged with offences under the National Security Act as part of an investigation led by officers from the Met's Counter Terrorism Command with support from colleagues in Counter Terrorism Policing in the North East and South East.",
    "url": "https://news.met.police.uk/news/three-people-charged-with-offences-under-the-national-security-act-483705"
  },
  {
    "text": "Gallego Places $19 Million Ad Buy in Arizona, the Largest of Any Senate Candidate  —  Representative Ruben Gallego is raising and spending money at a torrid pace as he prepares to face Kari Lake in the November election.  —  Representative Ruben Gallego, running unopposed in the Democratic primary … ",
    "url": "https://www.nytimes.com/2024/05/13/us/politics/gallego-arizona-senate-ads.html"
  },
  {
    "text": "How 20 Years of Same-Sex Marriage Changed America  —  After ‘dire predictions,’ the effects have been largely positive, a new study finds  —  Twenty years ago this week, David Wilson and Rob Compton entered into a marriage that some believed would bring on the apocalypse.",
    "url": "https://www.wsj.com/politics/policy/how-20-years-of-same-sex-marriage-changed-america-670758bd"
  },
  {
    "text": "The Most Endangered Democrat in America  —  Jamaal Bowman might lose his job over Israel.  —  Jamaal Bowman, the two-term congressman from Westchester County and the would-be future of the progressive left, is tired of the questions about George Latimer.  “Yeah, I mean, I think it says something … ",
    "url": "https://nymag.com/intelligencer/article/jamaal-bowman-george-latimer-primary-israel.html"
  }
]