[
  {
    "text": "Trump Falsely Claims That the Crowds Seen at Harris Rallies Are Fake  —  The former president, in a series of social media posts, said that Vice President Kamala Harris had used A.I. technology to create images of fake crowds at her events.  —  Former President Donald J. Trump has taken … ",
    "url": "https://www.nytimes.com/2024/08/11/us/politics/trump-harris-crowds-ai.html?unlocked_article_code=1.CU4.IU4A.laO56X6syKZM&smid=url-share"
  },
  {
    "text": "Trump falsely claims Harris Michigan rally crowd 'didn't exist,' was generated with AI  —  Former President Donald Trump took to social media on Sunday to falsely claim that Vice President Kamala Harris' campaign faked photos of the crowd at her Detroit-area rally last week using artificial intelligence.",
    "url": "https://ny1.com/nyc/all-boroughs/politics/2024/08/11/trump-kamala-harris-michigan-rally-ai"
  },
  {
    "text": "Trump falsely accuses Harris campaign of fabricated AI crowd photos  —  In the days following President Joe Biden's announcement that he would step aside as the Democratic nominee, conspiracy theorists and far-right influencers have promoted a number of falsehoods targeted at the Harris campaign.",
    "url": "https://www.washingtonpost.com/politics/2024/08/11/trump-falsely-accuses-harris-campaign-fabricated-ai-crowd-photos/"
  },
  {
    "text": "Trump Is a Threat Whether He Wins or Loses, Biden Says  —  “He's a genuine danger to American security,” Biden said of Trump in his first TV interview since dropping out of the race.  —  In his first interview since dropping out of the election last month and endorsing Vice President Kamala Harris … ",
    "url": "https://www.motherjones.com/politics/2024/08/trumps-a-threat-whether-he-wins-or-loses-biden-says/"
  },
  {
    "text": "JD Vance's Campaign Won't Deny That's Him in Viral Drag Photo  —  ‘SOFA LAUREN’  —  The GOP's vice presidential pick is a vocal critic of gender affirming care for minors and once opposed federal protections for gay and interracial marriages.  —  Journalist",
    "url": "https://www.thedailybeast.com/jd-vances-campaign-wont-deny-thats-him-in-viral-drag-photo"
  },
  {
    "text": "162 lies and distortions in a news conference.  NPR fact-checks former President Trump  —  There were a host of false things that Donald Trump said during his hour-long news conference Thursday that have gotten attention.  —  A glaring example is his helicopter emergency landing story, which has not stood up to scrutiny.",
    "url": "https://www.npr.org/2024/08/11/nx-s1-5070566/trump-news-conference"
  },
  {
    "text": "What “Center” Is That, Exactly?  —  Hey friends!  If you've read Very Fine People and enjoyed it, why not leave a quick rating or review on Amazon or Goodreads?  It would help bunches!  —  I really can't get over the signs.  —  The Republicans held what was basically a Nuremberg rally … ",
    "url": "https://www.the-reframe.com/what-center-is-that-exactly/"
  },
  {
    "text": "Trump's Anger Out of Control as Poll Numbers Keep Cratering  —  GOING DOWN  —  According to Axios sources, Trump “is struggling to get past his anger” and his advisers are “deeply rattled” by his “meandering, mean and often middling public performances.”  —  Donald Trump's advisers … ",
    "url": "https://www.thedailybeast.com/trump-advisers-deeply-rattled-by-his-spiraling-campaign-report"
  },
  {
    "text": "Joint statement on the Middle East: 12 August 2024  —  Joint Statement from the Leaders of France, Germany and the United Kingdom on the Middle East  —  Prime Minister's Office, 10 Downing Street and The Rt Hon Sir Keir Starmer KCB KC MP  —  We, the leaders of France, Germany and the United Kingdom … ",
    "url": "https://www.gov.uk/government/news/joint-statement-on-the-middle-east-12-august-2024"
  },
  {
    "text": "New Israeli intelligence suggests Iran prepares to attack Israel within days: sources … - But one of the sources who has direct knowledge of the intelligence said the situation is “still fluid.”  —  The assessment, which was drafted in the last 24 hours, represents a shift, the sources said.",
    "url": "https://www.axios.com/2024/08/11/iran-attack-israel-intelligence-updated"
  },
  {
    "text": "Harris is beating Trump by transcending him  —  The vice president and her running mate are achieving a radical shift in messaging.  —  The sudden and radical shift in the trajectory of the 2024 campaign owes to more than the replacement of President Joe Biden with Vice President Kamala Harris as the Democratic candidate.",
    "url": "https://www.washingtonpost.com/opinions/2024/08/11/harris-walz-transcending-trump-2024/"
  },
  {
    "text": "State House Speaker Scott Saiki loses Democratic primary to Kim Coco Iwamoto  —  Hawaii's longtime House speaker lost his Democratic Party primary election to a former state Board of Education member who campaigned on tackling corruption in government.  —  Speaker Scott Saiki was ousted by Kim Coco Iwamoto.",
    "url": "https://apnews.com/article/hawaii-state-house-primary-democratic-ccbe2264b5a2c15e5ccd67cb98a3ae4e"
  },
  {
    "text": "New Mexico governor invites Texas doctors to practice in her state following restrictive abortion law  —  Gov. Michelle Lujan Grisham announced last Sunday an initiative to invite Texas doctors to consider relocating to her neighboring state of New Mexico, in response to Texas's “draconian abortion ban.”",
    "url": "https://thehill.com/homenews/state-watch/4823127-new-mexico-governor-invites-texas-doctors-to-practice-in-her-state-following-restrictive-abortion-law/"
  },
  {
    "text": "Kid Rock Threw the Party.  MAGA Faithful Brought the Joy, Rage and Smirnoff Ice.  —  A music festival headlined by the pro-Trump musician offered a snapshot of a maturing American subculture, with a mash-up of hedonism, rebellion and beer-guzzling pursuit of happiness.",
    "url": "https://www.nytimes.com/2024/08/11/us/kid-rock-trump-maga.html?unlocked_article_code=1.CE4.CHgb.4M5QM2laC31E&smid=url-share"
  },
  {
    "text": "To Save Conservatism From Itself, I Am Voting for Harris  —  I believe life begins at conception.  If I lived in Florida, I would support the state's heartbeat bill and vote against the referendum seeking to liberalize Florida's abortion laws.  I supported the Dobbs decision and I support … ",
    "url": "https://www.nytimes.com/2024/08/11/opinion/harris-trump-conservatives-abortion.html"
  }
]