[
  {
    "text": "Musk Is Going All In to Elect Trump  —  Elon Musk is planting himself in Pennsylvania, has brought his brain trust to help and may even knock on doors himself.  —  In the final weeks of the presidential campaign, the richest man in the world has involved himself in the U.S. election in a manner unparalleled in modern history.",
    "url": "https://www.nytimes.com/2024/10/11/us/politics/elon-musk-donald-trump-pennsylvania.html?unlocked_article_code=1.RU4.hLOY.jvVZPOk1gLaB&smid=url-share"
  },
  {
    "text": "Vance, Given 5 Chances to Say Trump Lost in 2020, Takes None  —  In an interview with The New York Times, Senator JD Vance repeatedly refused to acknowledge Donald J. Trump's defeat and said he would not have certified the 2020 results.  —  Heading into the final three weeks of the 2024 election … ",
    "url": "https://www.nytimes.com/2024/10/11/us/politics/vance-trump-2020-election-results.html"
  },
  {
    "text": "What It Looks Like When One Side Rejects Democracy  —  A lot of things happened.  Here are some of the things.  This is TPM's Morning Memo.  Sign up for the email version.  —  When Democracy Itself Is On the Ballot, We've Already Lost  —  The last few weeks have been a particularly strange stretch … ",
    "url": "https://talkingpointsmemo.com/morning-memo/what-it-looks-like-when-one-side-rejects-democracy"
  },
  {
    "text": "Trump's top general calls ex-president ‘fascist to the core’ and ‘most dangerous person to this country,’ new book says  —  Your support helps us to tell the story  —  This election is still a dead heat, according to most polls.  In a fight with such wafer-thin margins … ",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/trump-fascist-general-woodward-book-b2627972.html"
  },
  {
    "text": "Trump's top general calls former president “fascist” and “dangerous” threat … - “I had suspicions when I talked to you about his mental decline and so forth, but now I realize he's a total fascist,” Milley, who served from 2019 to 2023, said to Woodward. … Milley has been criticized by the far right.",
    "url": "https://www.axios.com/2024/10/11/mark-milley-trump-fascist-bob-woodward-book"
  },
  {
    "text": "GOP senator touts ‘support’ of colleague — who didn't endorse her  —  Sen. Deb Fischer (R-NE) is facing a competitive election for the first time in years — and she's trying to whip out bipartisan credentials to stave off the threat.  —  The problem is, the senator whose “support” … ",
    "url": "https://www.rawstory.com/deb-fischer/"
  },
  {
    "text": "Trump requests military aircraft and vehicles amid Iran threat  —  There is no evidence tying Iran to either of the recent assassination attempts, but the FBI has not ruled out the possibility.  —  Donald Trump's campaign requested military aircraft for Trump to fly in during the final weeks … ",
    "url": "https://www.washingtonpost.com/politics/2024/10/11/trump-security-threats-iran-election-2024-campaign/"
  },
  {
    "text": "Justice Department Sues Virginia for Violating Federal Law's Prohibition on Systematic Efforts to Remove Voters Within 90 Days of an Election  —  For Immediate Release  —  The Justice Department announced today that it has filed a lawsuit against the State of Virginia … ",
    "url": "https://www.justice.gov/opa/pr/justice-department-sues-virginia-violating-federal-laws-prohibition-systematic-efforts"
  },
  {
    "text": "Damning Video Shows Roger Stone Is Plotting a Coup for November  —  A nine-minute, unedited, undercover interview with Roger Stone revealed some of the MAGA ally's more disturbing goals for a second Trump administration.  —  The covert recording of a discussion between Stone … ",
    "url": "https://newrepublic.com/post/187088/roger-stone-donald-trump-coup-november-video"
  },
  {
    "text": "California officials reject more SpaceX rocket launches, with some citing Musk's X posts  —  SpaceX's plans to launch more rockets from the California coast were rejected by a state commission this week, with some officials citing Elon Musk's political posts on X and raising concerns … ",
    "url": "https://www.latimes.com/california/story/2024-10-11/la-me-spacex-coastal-commission"
  },
  {
    "text": "Trump Is Said to Consider Brooke Rollins for White House Chief of Staff  —  Ms. Rollins, a conservative lawyer who ran domestic policy in the Trump administration, is said to be under consideration for the role should Donald J. Trump win the election.  —  Former President Donald J. Trump … ",
    "url": "https://www.nytimes.com/2024/10/11/us/politics/trump-brooke-rollins-chief-of-staff.html"
  },
  {
    "text": "From the Storm to the Stormtroopers  —  The Fascist Logic of Climate Lying  —  Today, our American fascists blame the hurricanes on the meteorologists and disrupt the government response.  Tomorrow they will blame climate change on the climate scientists and deport their enemies of choice.",
    "url": "https://snyder.substack.com/p/from-the-storm-to-the-stormtroopers"
  },
  {
    "text": "Harris ad bashes Trump for criticizing Detroit  —  Vice President Harris's campaign released an ad titled “Like Detroit” on Friday, criticizing former President Trump for his unfavorable comments about the city.  —  “They said we were dead.  That our best days were behind us,” … ",
    "url": "https://thehill.com/homenews/state-watch/4929218-harris-campaign-trump-detroit-comments/"
  },
  {
    "text": "I'm Running Out of Ways to Explain How Bad This Is … The truth is, it's getting harder to describe the extent to which a meaningful percentage of Americans have dissociated from reality.  As Hurricane Milton churned across the Gulf of Mexico last night, I saw an onslaught … ",
    "url": "https://www.theatlantic.com/technology/archive/2024/10/hurricane-milton-conspiracies-misinformation/680221/?gift=bQgJMMVzeo8RHHcE1_KM0QW0K3DKS019CAwkgCJs0j8&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "WSJ battleground Trump-Harris poll: It's a toss-up, folks  —  Across all the swing-state voters surveyed, Trump leads Harris 46 percent to 45 percent.  —  A Wall Street Journal poll of seven swing states shows Vice President Kamala Harris and former President Donald Trump still neck and neck … ",
    "url": "https://www.politico.com/news/2024/10/11/wsj-battleground-trump-harris-poll-00183414"
  },
  {
    "text": "Trump ghostwriter ‘deeply unsettled’ by evidence of ex-president's ‘psychopathy’  —  Donald Trump's ghostwriter for his myth-making memoir “The Art of the Deal” explained how the new film “The Apprentice” reveals how the former president's childhood trauma warped him into a “psychopath” … ",
    "url": "https://www.rawstory.com/tony-schwartz-trump-psychopathy/"
  },
  {
    "text": "Rumors on X Are Becoming the Right's New Reality  —  The site formerly known as Twitter has become the center of a fantastical political culture.  —  A curious set of claims has recently emerged from the right-wing corners of the social-media platform X: FEMA is systematically abandoning … ",
    "url": "https://www.theatlantic.com/ideas/archive/2024/10/rumors-x-twitter-musk/680219/"
  },
  {
    "text": "Cities seek more than $750K in unpaid bills for Trump campaign events since 2016  —  At least four cities and a county are still waiting to be reimbursed for costs associated with local law enforcement and first responders during Trump's visits.  —  Former President Donald Trump held … ",
    "url": "https://www.nbcnews.com/politics/2024-election/cities-seek-750k-unpaid-bills-trump-campaign-events-rcna174757"
  },
  {
    "text": "Democrats to swing states: A vote for Jill Stein is a vote for Trump  —  Democrats are arguing in a new pitch to swing-state voters that a vote for Green Party nominee Jill Stein would only help elect former President Trump.  —  An ad released Thursday says that Stein was “key” … ",
    "url": "https://thehill.com/homenews/campaign/4928622-democrats-swing-state-voters-jill-stein-trump-harris/"
  },
  {
    "text": "Friday Smiles: Some Very Savvy People Break Down the Democratic Freak Out  —  Besides roaming the interwebs and combing through so many different X accounts myself, I'm lucky enough to have a dear friend from high school who once worked in Congress.  Nowadays, he does his own thing … ",
    "url": "https://hotair.com/tree-hugging-sister/2024/10/11/friday-smiles-some-very-savvy-people-break-down-the-democratic-freak-out-n3795687"
  }
]