[
  {
    "text": "Behind the Curtain: Trump's exponential power surge  —  Something shocking — and telling — has unfolded beyond Donald Trump's onstage, online and courtroom theatrics: He's running a professional, well-managed, disciplined presidential campaign.  — His 2024 operation is more sophisticated … ",
    "url": "https://www.axios.com/2024/01/25/trump-2024-campaign-republican-nominee"
  },
  {
    "text": "Manhattan's District Attorney Is Quietly Preparing for a Trump Trial  —  As prosecutors navigate calendars and appeals, Alvin L. Bragg may take the former president's first criminal case to trial.  He has said that covering up a hush-money payment was a fraud on voters.",
    "url": "https://www.nytimes.com/2024/01/25/nyregion/trump-hush-money-trial-stormy-daniels.html"
  },
  {
    "text": "Trump Privately Pressuring GOP Senators To ‘Kill’ Border Deal To Deny Biden A Win  —  The former president is telling Republicans he “doesn't want Biden to have a victory” in 2024, said a source familiar with the bipartisan negotiations.  —  LOADING  —  WASHINGTON - Donald Trump … ",
    "url": "https://www.huffpost.com/entry/trump-border-deal-republicans-biden_n_65b18fa0e4b0166fc770ae46"
  },
  {
    "text": "Trump opens up lead over Biden in rematch many Americans don't want  —  Donald Trump leads Democratic President Joe Biden by six percentage points in a Reuters/Ipsos poll that showed Americans are unhappy about an election rematch that came into sharper focus this week.",
    "url": "https://www.reuters.com/world/us/americans-dismayed-by-biden-trump-2024-rematch-reutersipsos-poll-finds-2024-01-25/"
  },
  {
    "text": "‘A Warning Shot’: Maggie Haberman Explains Why Trump Attacked Kayleigh McEnany  —  The New York Times reporter shared her analysis after Trump lashed out at his former press secretary over her comments on Fox News.  —  LOADING  —  New York Times journalist Maggie Haberman said Donald Trump's outburst … ",
    "url": "https://www.huffpost.com/entry/maggie-haberman-kayleigh-mcenany-trump_n_65b242a1e4b074981636eb7d"
  },
  {
    "text": "U.S. economy booms with 3.3% growth in final quarter of 2023 … - The economy moderated in the September-December period compared to the previous quarter's 4.9% growth, which got a notable boost from companies building up inventories. … - That dynamic continued in the fourth quarter … ",
    "url": "https://www.axios.com/2024/01/25/us-gdp-fourth-quarter-economy-growth"
  },
  {
    "text": "Who are No Labels' donors?  Democratic groups file complaints in an attempt to find out  —  For months, the centrist group No Labels has stockpiled cash and diligently worked to secure ballot access for a potential third-party presidential bid, striking fear among allies of President Joe Biden … ",
    "url": "https://apnews.com/article/no-labels-campaign-finance-complaint-biden-trump-05062262e04b4bb346ab06eaea99630b"
  },
  {
    "text": "Housing is now unaffordable for a record half of all U.S. renters, study finds  —  Over the past two years, Genuine Campbell was shocked at how rent for her two-bedroom apartment in Philadelphia just kept going up — from $1,300 a month to $1,600.  She's a single mom of four … ",
    "url": "https://www.npr.org/2024/01/25/1225957874/housing-unaffordable-for-record-half-all-u-s-renters-study-finds"
  },
  {
    "text": "Playbook: Conservatives take aim at tax deal  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  THE MAGA CASH MACHINE — “Trump's super PAC raised $46 million in 6 months,” by Alex Isenstadt: “The rise in donations reflects the growing belief among … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/01/25/conservatives-take-aim-at-tax-deal-00137763"
  },
  {
    "text": "Outrage as New Restaurant Opens Called ‘October 7’  —  “We expect the Jordanian government to condemn this publicly and unequivocally,” wrote Israeli opposition leader Yair Lapid.  —  A new restaurant apparently named after the brutal massacre of Israelis by Hamas militants on Oct. 7 has opened in Jordan, sparking outrage in Israel.",
    "url": "https://www.thedailybeast.com/outrage-as-new-restaurant-opens-called-october-7"
  },
  {
    "text": "Penn Jillette Wants to Talk It All Out  —  Penn Jillette has a large, framed French-language poster of Renaldo and Clara behind him.  Most people wouldn't know what that is, but as a Bob Dylan fan, I do — it's his largely forgotten, widely panned 1978 film that he wrote, directed and starred in.",
    "url": "https://www.cracked.com/article_40871_penn-jillette-wants-to-talk-it-all-out.html"
  },
  {
    "text": "64K women and girls became pregnant due to rape in states with abortion bans, study estimates  —  The research letter, published by JAMA Internal Medicine, estimated that nearly 520,000 rapes were associated with 64,565 pregnancies across 14 states.  —  More than 64,000 women and girls became pregnant … ",
    "url": "https://www.nbcnews.com/politics/politics-news/64k-women-girls-became-pregnant-due-rape-states-abortion-bans-study-es-rcna135565"
  },
  {
    "text": "Sen. Barrasso's wife dies after 2-year battle with brain cancer  —  Sen. Barrasso announces wife's death  —  Sen. John Barrasso, R-Wy., announced on Thursday that his wife, Bobbi, died after a two-year battle with glioblastoma, a type of brain cancer.  —  “After a courageous battle with cancer … ",
    "url": "https://www.foxnews.com/politics/sen-barrassos-wife-dies-after-2-year-battle-cancer"
  },
  {
    "text": "An Iowa bill would make students sing the national anthem every day.  One lawmaker sang it  —  When it came time for her closing comments at Wednesday's Iowa House subcommittee meeting, Rep. Sue Cahill stood — and began singing the national anthem.  —  “O say can you see, by the dawn's early light … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/01/25/iowa-bill-require-students-sing-national-anthem-every-day/72349739007/"
  },
  {
    "text": "The Looming Contest Between Two Presidents and Two Americas  —  The general election matchup that seems likely between President Biden and former President Donald J. Trump is about fundamentally disparate visions of the nation.  —  Each of them has sat behind the Resolute Desk in the Oval Office … ",
    "url": "https://www.nytimes.com/2024/01/25/us/politics/two-presidents-two-americas.html"
  },
  {
    "text": "Democrats Are Having a Blast Making a Circus of the GOP's Hunter Biden Probe  —  “We're calling out their bullshit like every single time, and I think they're surprised by it,” one Democrat on the Oversight Committee said. … When Rep. Jared Moskowitz (D-FL) arrived at the Hunter Biden contempt hearing … ",
    "url": "https://www.thedailybeast.com/democrats-are-having-a-blast-making-a-circus-of-the-gops-hunter-biden-probe"
  },
  {
    "text": "SCOTUS is poised to take a sledgehammer to federal agencies  —  Why overturning the Chevron precedent would be very big (and bad) deal.  —  ∙ Paid … Since conservatives fully captured the US Supreme Court during the Trump administration, right-wingers have been racking up wins.",
    "url": "https://www.publicnotice.co/p/scotus-chevron-precedent-overturned-explained"
  },
  {
    "text": "U.S. Secretly Alerted Iran Ahead of Islamic State Terrorist Attack  —  Washington passed actionable intelligence to Tehran about the plot that killed 84 and wounded many more  —  WASHINGTON—The U.S. secretly warned Iran that Islamic State was preparing to carry out the terrorist attack early … ",
    "url": "https://www.wsj.com/world/middle-east/u-s-secretly-alerted-iran-ahead-of-islamic-state-terrorist-attack-af77a19a?mod=followamazon"
  },
  {
    "text": "How life is going for this former McCarthy deputy: Not great  —  Republicans in the Bayou State are privately speculating if Garret Graves made too many enemies, both in Washington and back home.  —  Louisiana is enjoying outsized control over House GOP leadership these days … ",
    "url": "https://www.politico.com/news/2024/01/25/mccarthy-deputy-louisiana-gop-00136428"
  },
  {
    "text": "Oklahoma enlists notorious right-wing zealot to guide school library policy  —  Ellen Ochoa Elementary School, in Tulsa, Oklahoma, was among the dozens of schools that received bomb threats last year after being targeted by the far-right Libs of TikTok account.",
    "url": "https://popular.info/p/oklahoma-enlists-notorious-right"
  }
]