[
  {
    "text": "Donald Trump McDonald's Hit With Bad Reviews: ‘Bronzer on My Fries’  —  Internet pranksters are trolling presidential-hopeful  —  he briefly worked at during a photo opportunity on Sunday.  —  The  —  candidate put in a short  —  at restaurant in Feasterville-Trevose, Pennsylvania.",
    "url": "https://www.newsweek.com/donald-trump-mcdonalds-yelp-reviews-pennsylvania-1972253"
  },
  {
    "text": "McDonald's is distancing itself from Donald Trump after a high-profile visit to the fryer  —  The fast food giant said it did not facilitate Trump's visit to a Pennsylvania restaurant and “does not endorse candidates for elected office”  —  McDonald's is distancing itself … ",
    "url": "https://qz.com/mcdonalds-donald-trump-kamala-harris-election-2024-1851677492"
  },
  {
    "text": "No, McDonald's didn't confirm Trump's baseless claim about Kamala Harris  —  In a message to employees obtained by The Washington Post, the fast-food giant made clear that it isn't saying what Trump says it's saying.  —  In any other presidential campaign, one of the candidates' mention … ",
    "url": "https://www.washingtonpost.com/politics/2024/10/21/trump-harris-worked-at-mcdonalds/"
  },
  {
    "text": "An Update to Our Readers  —  Last month, the magazine enlisted the law firm Davis Wright Tremaine to review Olivia Nuzzi's work during the 2024 campaign.  They reached the same conclusion as the magazine's initial internal review of her published work, finding no inaccuracies nor evidence of bias.",
    "url": "https://nymag.com/press/article/an-update-to-our-readers.html"
  },
  {
    "text": "'More Republicans than you've seen vote for a Democrat in decades': Inside the Harris campaign effort to turn red voters blue  —  By Andrew Feinberg speaks to the former Trump voters who are now planning to pull the lever for Harris — and the campaign politicos who came up with an unusual strategy",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/republicans-against-trump-harris-campaign-b2633011.html"
  },
  {
    "text": "Kamala Harris Isn't Repeating the Mistakes of 2016  —  Donald Trump might still win, but it won't be for Democrats' lack of a well-organized campaign.  —  Will Donald Trump win?  As I write this in late October, no one knows for sure if 2024 will be a repeat of 2020 or 2016 … ",
    "url": "https://www.vanityfair.com/news/story/kamala-harris-isnt-repeating-mistakes-2016"
  },
  {
    "text": "Kamala Harris against Despair  —  As you know, I've been tracking Kamala Harris' outreach to Republicans, Liz Cheney above all, with a good deal of interest.  I've spoken about why it makes sense from a demographic perspective; if Harris can attract some of Nikki Haley's voters, it could put her over the top in these 50/50 states.",
    "url": "https://www.emptywheel.net/2024/10/21/kamala-harris-against-despair/"
  },
  {
    "text": "Elon Musk ‘Jokes’ in a Church About Someone Killing Kamala Harris  —  “Assassinating a puppet is pointless,” the Trump-backing billionaire said in a Saturday church appearance  —  Elon Musk keeps trying to stick his “joke” about somebody assassinating Vice President Kamala Harris.",
    "url": "https://www.rollingstone.com/politics/politics-news/elon-musk-harris-trump-assassination-joke-church-1235139632/"
  },
  {
    "text": "First two Elon Musk giveaway winners had already voted  —  Elon Musk is doing a good job of drawing attention with his $1 million giveaways to Pennsylvania voters.  But will the project actually boost Donald Trump?  Two Pennsylvania voters have won the billionaire's super PAC lottery so far … ",
    "url": "https://www.politico.com/live-updates/2024/10/21/2024-elections-live-coverage-updates-analysis/elon-musk-million-winners-already-voted-00184772"
  },
  {
    "text": "Russian Propaganda Unit Appears to Be Behind Spread of False Tim Walz Sexual Abuse Claims  —  The Russian-aligned network Storm-1516 has a long history of posting fake whistleblower videos—including deepfakes—to push Kremlin talking points.  —  A Russian-aligned propaganda network notorious … ",
    "url": "https://www.wired.com/story/russian-propaganda-unit-storm-1516-false-tim-walz-sexual-abuse-claims/"
  },
  {
    "text": "With Election Day 2 Weeks Away, 15 Million Voters Have Already Cast a Ballot  —  Since the pandemic, early voting has become a broadly accepted part of American elections.  But it is difficult to glean partisan advantage.  —  With two weeks until Election Day, more than 15 million people … ",
    "url": "https://www.nytimes.com/2024/10/21/us/politics/2024-early-voting.html"
  },
  {
    "text": "Fact check: Trump repeats debunked lies about FEMA's hurricane response during North Carolina visit  —  Former President Donald Trump used a Monday visit to North Carolina to repeat debunked lies about the federal response to Hurricane Helene.  —  Speaking to reporters in a hard-hit community … ",
    "url": "https://www.cnn.com/2024/10/21/politics/fact-check-trump-fema-hurricane-response/"
  },
  {
    "text": "PAC paying Trump's legal fees has run out of cash — with $3M in debt: report  —  The Washington Post reported that Vice President Kamala Harris has a huge cash advantage over Donald Trump in the 2024 race after bringing in $1 billion in fewer than three months on the campaign trail.",
    "url": "https://www.rawstory.com/trump-legal-fees-super-pac/"
  },
  {
    "text": "Former GOP lawmakers, officials urge Garland to investigate Musk  —  The Justice Department confirmed that Attorney General Merrick Garland got the letter, but it declined to say whether it is investigating Musk or his PAC.  —  Former Republican lawmakers, advisers and Justice Department officials … ",
    "url": "https://www.washingtonpost.com/national-security/2024/10/21/elon-musk-voting-petition-justice-department-trump/"
  },
  {
    "text": "Mifepristone Lawsuit: Republican Attorneys General In Court Filing: We Demand Pregnant Teenagers  —  Three state Republican Attorneys General filed a complaint in federal court on October 11 arguing that their states have a right to pregnant teenagers and that right is being violated by the U.S. Food and Drug Administration.",
    "url": "https://ballsandstrikes.org/law-politics/mifepristone-lawsuit-republican-ags-more-pregnant-teens/"
  },
  {
    "text": "Walz on Musk's pro-Trump giveaways: 'That's what you do when you have no plan'  —  Tim Walz on Monday blasted Elon Musk's recent pro-Trump pledge to give away millions of dollars to registered voters in battleground states, saying the tech billionaire's actions are what happens “when you have no plan.”",
    "url": "https://www.politico.com/live-updates/2024/10/21/2024-elections-live-coverage-updates-analysis/walz-on-musk-00184650"
  },
  {
    "text": "Ted Cruz Suffers Blow as Texas' Biggest Newspaper Endorses Opponent  —  , Texas' biggest newspaper has endorsed his Democratic opponent, Rep. Colin Allred.  —  Cruz is facing Allred, a three-term congressman from Dallas, in a closely watched race that could determine which party wins control of the U.S.",
    "url": "https://www.newsweek.com/ted-cruz-blow-newspaper-endorses-opponent-1972051"
  },
  {
    "text": "What Would the Trump Campaign Plans Mean for Social Security?  —  The Social Security trust funds will be insolvent by Fiscal Year (FY) 2034, according to projections by the Congressional Budget Office (CBO), at which point the law calls for a 23 percent cut in benefits.",
    "url": "https://www.crfb.org/blogs/what-would-trump-campaign-plans-mean-social-security"
  },
  {
    "text": "Florida official says DeSantis's office ordered him to threaten TV stations over abortion ads  —  John Wilson, general counsel for the Florida Department of Health, wrote in a sworn affidavit that officials from Gov. Ron DeSantis's (R-Fla.) office pushed him to threaten television stations … ",
    "url": "https://thehill.com/blogs/blog-briefing-room/news/4945482-florida-department-health-threatens/"
  }
]