[
  {
    "text": "Behind the Curtain: Unbendable Biden vs. breaking-point Dems … Both plan fierce public and private campaigns to see who buckles.  — It won't be him, Biden says publicly and privately. … These Democrats, further deflated by Biden's high-stakes ABC interview, believe there's nothing … ",
    "url": "https://www.axios.com/2024/07/07/biden-democrats-drop-election-campaign"
  },
  {
    "text": "Four more Democrats in Congress call for Biden to step aside in 2024 race  —  The increased calls for the president to drop his re-election bid follow a prime-time interview that failed to alleviate widespread Democratic concerns about Biden.  —  WASHINGTON — Four additional Democrats … ",
    "url": "https://www.nbcnews.com/politics/2024-election/four-democrats-congress-call-biden-step-2024-race-rcna160625"
  },
  {
    "text": "Biden turns to Pennsylvania to try to save his campaign  —  The president once dubbed “Pennsylvania's third senator” made an appearance in front of a supportive crowd Sunday morning, with friendly elected officials in tow.  —  PHILADELPHIA — President Joe Biden is returning to his roots … ",
    "url": "https://www.politico.com/news/2024/07/07/joe-biden-pennsylvania-campaign-00166723"
  },
  {
    "text": "Sen. Graham thinks Biden will “be replaced” as Democratic nominee … - “If she does become the nominee, this is a dramatically different race than it is right now, today. … - Trump advisers told Axios the campaign would launch scathing attacks on Harris should she pick up the baton … ",
    "url": "https://www.axios.com/2024/07/07/trump-biden-graham-cognitive-tests"
  },
  {
    "text": "French left set to beat Le Pen's far right in election shock  —  PARIS  —  The left-wing alliance in France is on course to win the most seats in parliament in a dramatic election upset, dealing a surprise blow to the far-right party of Marine Le Pen, according to early estimates.",
    "url": "https://www.politico.eu/article/france-legislative-election-2024-second-round-front-populaire-jean-luc-melenchon-raphael-glucksmann-shock-victory/"
  },
  {
    "text": "2024 France election live updates: Prime Minister Attal plans to resign as projections show leftists lead  —  The first projections in the 2024 French legislative election say leftists have won most seats.  The surprise projections put President Emmanuel Macron's centrist alliance in second and the far right in third.",
    "url": "https://apnews.com/live/france-election-results-updates-round-2-macron-le-pen"
  },
  {
    "text": "NY Times reporter hilariously sticks it to ‘sex abuser’ Trump after Truth Social attack  —  The New York Times' Peter Baker got the last laugh on Sunday after former president Donald Trump smeared Baker and his wife, Susan Glasser of the New Yorker, early Sunday morning on Truth Social.",
    "url": "https://www.rawstory.com/trump-abuser/"
  },
  {
    "text": "‘I have to hit pause here’: J.D. Vance flips out on NBC host as she fact-checks him  —  In just the first half of Sen. J.D. Vance's interview with “Meet the Press” host Kristen Welker, the Ohio Republican waved his hands and snapped at her as she attempted to fact-check him.",
    "url": "https://www.alternet.org/jd-vance-2668697406/"
  },
  {
    "text": "The world wasn't ready for Trump in 2016.  It's not making that mistake this time.  —  In 2016, no one in the world was ready for President Trump.  America's NATO allies aren't making the same mistake this time.  —  In Brussels, NATO officials have devised a plan to lock in long-term military support … ",
    "url": "https://www.politico.com/news/2024/07/07/nato-prepare-trump-2024-00165522"
  },
  {
    "text": "Playbook: Biden's lesson in political first aid  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  MUST READ — “Secret Meetings, Private Threats and a Massive Arms Race: How the World is Preparing for Trump,” by Paul McLeary, Christoph Schiltz, Stefanie Bolzen, Jacopo Barigazzi and Philipp Fritz:",
    "url": "https://www.politico.com/newsletters/playbook/2024/07/07/bidens-lesson-in-political-first-aid-00166719"
  },
  {
    "text": "Biden expected to make decision about future in ‘next couple of days,’ Hawaii governor says  —  President Joe Biden could determine his political future within the next couple of days, according to a Democratic governor.  —  The entire world is anxiously awaiting whether Biden decides to stay … ",
    "url": "https://www.washingtonexaminer.com/news/campaigns/presidential/3072184/biden-make-decision-future-couple-days-hawaii-governor/"
  },
  {
    "text": "Trump running mate decision nears, with Vance, Rubio at center of talks  —  The campaign is eyeing an announcement by July 15th and internal talks have focused heavily on the two senators.  —  Former president Donald Trump's campaign is aiming to announce his running mate by July 15 … ",
    "url": "https://www.washingtonpost.com/elections/2024/07/06/trump-running-mate-vance-rubio-republicans/"
  },
  {
    "text": "Rep. Adam Schiff says Biden needs to ‘win overwhelmingly’ or ‘pass the torch’: Full interview  —  Democratic Rep. Adam Schiff (Calif.) exclusively joins Meet the Press to talk about the state of President Joe Biden's re-election campaign.",
    "url": "https://www.nbcnews.com/meet-the-press/video/biden-needs-to-win-overwhelmingly-or-pass-the-torch-rep-adam-schiff-says-full-interview-214352965535"
  },
  {
    "text": "House Republicans request interview with White House physician  —  The GOP investigation is the latest sign of the growing political fallout from President Biden's debate performance.  —  House Republicans are opening an investigation into President Joe Biden's doctor in the wake … ",
    "url": "https://www.politico.com/news/2024/07/07/house-republicans-biden-physician-00166725"
  }
]