[
  {
    "text": "AP sources: White House altered record of Biden's ‘garbage’ remarks despite stenographer concerns  —  White House press officials altered the official transcript of a call in which President Joe Biden appeared to take a swipe at supporters of Donald Trump, drawing objections from the federal workers … ",
    "url": "https://apnews.com/article/biden-garbage-transcript-puerto-rico-trump-326e2f516a94a470a423011a946b6252"
  },
  {
    "text": "When You Thought He Couldn't Sink Lower  —  Donald Trump's two strongest personality traits each had a moment on the campaign trail yesterday.  —  At a rally in Albuquerque, New Mexico, the buffoon: “I'm here for one very simple reason.  I like you very much, and it's good for my credentials with the Hispanic and Latino community.”",
    "url": "https://www.thebulwark.com/p/when-you-thought-he-couldnt-sink"
  },
  {
    "text": "Liz Cheney Fires Back at Trump, Accuses Him of Threatening Her ‘With Death’ in Blistering Counter  —  Liz Cheney shot back at former President Donald Trump's comments from Thursday night, where he darkly floated a scenario where guns were firing at the former Republican Congressional leader and Kamala Harris supporter.",
    "url": "https://www.mediaite.com/politics/liz-cheney-fires-back-at-trumps-threatening-her-with-death-with-blistering-counter-attack/"
  },
  {
    "text": "Trump lagging in early vote with seniors in Pennsylvania, a red flag for GOP  —  Democrats account for about 58 percent of the votes cast by seniors so far in Pennsylvania.  —  Donald Trump is lagging Kamala Harris in Pennsylvania early voting with a critical and once-reliably Republican constituency: seniors.",
    "url": "https://www.politico.com/news/2024/10/31/trump-lagging-early-votes-seniors-pennsylvania-00186612"
  },
  {
    "text": "How Harris or Trump Could Win This Deadlocked Presidential Race, in 19 Maps  —  The best evidence that American politics is deeply, stubbornly and immovably stuck is that the presidential race is back where it started in the Electoral College race for 270 votes, despite the work … ",
    "url": "https://www.nytimes.com/interactive/2024/11/01/opinion/harris-trump-electoral-college-prediction.html?unlocked_article_code=1.Wk4.5EAA.EktNU2c4wI2Q&smid=url-share"
  },
  {
    "text": "Men, get out and vote and don't let Harris lie her way into White House  —  What is the difference between men and women?  No - that's not one of those trick questions meant to trip-up a Democrat nominee for the Supreme Court.  —  It's an easy one.  And it's especially easy if you're … ",
    "url": "https://nypost.com/2024/10/31/opinion/men-get-out-and-vote-and-dont-let-harris-lie-her-way-into-white-house/"
  },
  {
    "text": "A Pregnant Teenager Died After Trying to Get Care in Three Visits to Texas Emergency Rooms  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up to receive our biggest stories as soon as they're published.  —  Candace Fails screamed for someone in the Texas hospital to help her pregnant daughter.",
    "url": "https://www.propublica.org/article/nevaeh-crain-death-texas-abortion-ban-emtala"
  },
  {
    "text": "J.Lo Claps Back at Trump Rally Puerto Rico Jab: ‘We Are Americans’  —  LET'S GET LOUD  —  “Our pain matters” the singer said at a Las Vegas event for Kamala Harris.  —  As promised, Jennifer Lopez took the stage at Kamala Harris's rally in Las Vegas on Thursday night … ",
    "url": "https://www.thedailybeast.com/jennifer-lopez-claps-back-at-trump-rally-puerto-rico-jab-we-are-americans/"
  },
  {
    "text": "Listen to Jeffrey Epstein Spill Intel on Donald Trump's White House  —  OH LORDY  —  A new recording captures Epstein dishing on Trump.  —  Michael Wolff, the explosive chronicler of Donald Trump's four years in the White House, has released what he says is a recording of Jeffrey Epstein … ",
    "url": "https://www.thedailybeast.com/listen-to-jeffrey-epstein-spill-intel-on-donald-trumps-white-house-on-tape-released-by-author-michael-wolff/"
  },
  {
    "text": "Some Maga men seem to think women don't have rights - starting with their wives  —  The 2024 election is in part about whether women can be free and equal citizens of this republic.  Right now too many cannot  —  This week, the fundamentalist Christian pastor Dale Partridge argued in a series … ",
    "url": "https://www.theguardian.com/commentisfree/2024/nov/01/maga-trump-men-supporters-womens-rights"
  },
  {
    "text": "What Happens When Trump Exploits Your Daughter's Murder  —  When Mollie Tibbetts was killed by an undocumented immigrant, Trump tried to hijack her story.  Her mom says his divisiveness “has got to stop”  —  BROOKLYN, Iowa — It's been more than six years since Mollie Tibbetts … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-exploits-daughter-mollie-tibbetts-murder-1235149834/"
  },
  {
    "text": "Elon Musk's Machine for Fascism: A One-Stop Shop for Disinformation and Violence  —  Just over a year ago, I described how Twitter had been used as a way to sow false claims in support of Trump in 2016 and 2020.  —  I described how, in 2016, trolls professionalized their efforts … ",
    "url": "https://www.emptywheel.net/2024/11/01/elon-musks-machine-for-fascism-a-one-stop-shop-for-disinformation-and-violence/"
  },
  {
    "text": "“Voter Report Card” mailings described as “creepy” and “insulting,” defended as effective tool  —  Julia Ramsey is used to a deluge of election-related mail.  Campaign mailings have clogged her Pennsylvania mailbox day after day for months, but one she received this week stood out from the rest.",
    "url": "https://www.cbsnews.com/news/voter-report-card-mailings-described-as-creepy-and-insulting-defended-as-effective-tool/"
  },
  {
    "text": "‘All hell has broken loose’: Inside Elon Musk's high-stakes pro-Trump door-knocking effort  —  More than a half-dozen operatives and canvassers connected to America PAC described an inordinate number of suspect entries and having to canvass during Hurricane Helene.",
    "url": "https://www.nbcnews.com/politics/2024-election/elon-musks-high-stakes-trump-door-knocking-effort-america-pac-rcna176255?taid=6724d0249f2d880001f6fdb4"
  },
  {
    "text": "Donald Trump's campaign of relentless lying  —  The United States that Donald Trump describes in his rally speeches would be pretty bad if it actually existed.  —  Schools secretly sending children for gender-affirming surgeries without parental consent.  Towns and even cities conquered by illegal immigrants.",
    "url": "https://www.cnn.com/2024/11/01/politics/analysis-donald-trumps-campaign-of-relentless-lying/"
  },
  {
    "text": "Texas hospitals must now ask patients whether they're in the US legally.  Here's how it works  —  Texas hospitals must ask patients starting Friday whether they are in the U.S. legally and track the cost of treating people without legal status following an order by Republican Gov. Greg Abbott … ",
    "url": "https://apnews.com/article/texas-immigration-hospital-health-care-abbott-florida-aeee92d7515a18b492c737b3657569ab"
  },
  {
    "text": "Trump's ‘grab them’ comment was history.  Now TikTok is showing it to young voters.  —  As the audio clip circulates on the popular video app, Gen Z users are expressing their shock.  —  It's been eight years since leaked audio from a conversation between Donald Trump and TV host Billy Bush … ",
    "url": "https://www.washingtonpost.com/technology/2024/10/31/tiktok-trump-access-hollywood-gen-z/"
  },
  {
    "text": "Europe's Greens ask Jill Stein to pull out of US election to prevent Trump victory  —  “The race for the White House is too close for comfort,” write parties from around Europe, calling on Stein to throw her support behind Democrat Kamala Harris.  —  Green politicians from across Europe … ",
    "url": "https://www.politico.eu/article/europes-greens-tell-jill-stein-to-pull-out-of-us-election-to-defeat-trump/"
  },
  {
    "text": "Leopards Are Telling You That They Will Eat YOUR Face  —  Do you know this widely cited meme, introduced in a 2015 tweet? … It's hard to explain why this is perfect, but it is.  If Donald Trump wins, there will eventually be a lot of sobbing among people who voted for him.",
    "url": "https://www.nytimes.com/2024/10/31/opinion/trump-musk-mike-johnson.html?unlocked_article_code=1.Wk4.duhW.K0tYG-e4y7vD&smid=url-share"
  },
  {
    "text": "Donald Trump Is Done With Checks and Balances  —  What does it mean to say that “democracy is on the ballot” on Election Day?  —  In her speech on Tuesday in Washington, D.C., delivered from the same place near the White House where Donald Trump incited a crowd to attack the Capitol on Jan. 6 … ",
    "url": "https://www.nytimes.com/2024/11/01/opinion/donald-trump-kamala-harris-election-power.html?unlocked_article_code=1.Wk4.S1lK.O7tbymT0gllX&smid=url-share"
  },
  {
    "text": "David Clements: The Evangelist of Election Refusal  —  Former law professor David Clements urges local election officials to refuse to certify elections—and trains citizens to pressure them to do so.  —  Meet The Authors … In the final moments of the training exercise … ",
    "url": "https://www.lawfaremedia.org/article/david-clements--the-evangelist-of-election-refusal"
  },
  {
    "text": "Meet the Democrats using porn ads to convince Trump voters to stay home  —  Earlier this year, Wally Nowinski and his buddy Matt Curry were texting back and forth about what they — two regular voters with no ties to any political campaign — could do to defeat Donald Trump in the presidential election.",
    "url": "https://www.npr.org/2024/11/01/nx-s1-5168877/2024-election-pac-trump-porn-sites"
  }
]