[
  {
    "text": "Trump holds seemingly pointless press conference filled with false claims  —  Speaking at Mar-a-Lago, Trump said that he has “agreed” to three debates in September  —  Support truly  —  independent journalism  —  Our mission is to deliver unbiased, fact-based reporting that holds power to account and exposes the truth.",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/trump-press-conference-kamala-harris-b2593570.html"
  },
  {
    "text": "“They take the strategic national reserves.  They're virtually empty now.  We have never had it this low.”  —  The former president offered two other dates to debate the Democratic nominee in a news conference from Mar-a-Lago.  Vice President Kamala Harris and Gov. Tim Walz of Minnesota spoke … ",
    "url": "https://www.nytimes.com/live/2024/08/08/us/harris-trump-election?unlocked_article_code=1.BU4.jtbD.k6bKLivotw2d&smid=url-share"
  },
  {
    "text": "Trump recommits to a Sept. 10 debate and lashes out at Harris at news conference  —  Trump lashes out at Harris, recommits to a Sept. 10 debate at hourlong news conference  —  The latest: Follow AP for live coverage of the 2024 election and Trump's news conference",
    "url": "https://apnews.com/article/trump-harris-news-conference-florida-election-2024-94b590ddf0434d9ea7b1241396dbbcc6"
  },
  {
    "text": "Trump says he ‘went down in a helicopter’ with Willie Brown.  Former S.F. mayor says it never happened  —  Donald Trump said Thursday that he once had to make an emergency landing while riding in a helicopter with former San Francisco Mayor Willie Brown.  —  In a rambling news conference … ",
    "url": "https://www.sfchronicle.com/politics/joegarofoli/article/donald-trump-willie-brown-helicopter-19629432.php"
  },
  {
    "text": "Trump appears to confuse former Mayor Willie Brown with former Gov. Jerry Brown  —  Trump said at a news conference in Mar-a-Lago that he was once in a helicopter with former San Francisco Mayor Willie Brown that nearly crashed.  —  Former President Donald Trump on Thursday appeared … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-appears-confuse-willie-brown-jerry-brown-rcna165903"
  },
  {
    "text": "Willie Brown Says Trump's Helicopter Crash Story Never Happened  —  In a news conference, the former president recounted a brush with death alongside Willie Brown, the former San Francisco mayor.  A few aspects of the story don't hold up to scrutiny.  —  Former President Donald J. Trump told … ",
    "url": "https://www.nytimes.com/2024/08/08/us/politics/trump-helicopter-willie-brown.html"
  },
  {
    "text": "Tim Walz is giving MAGA a master class in manhood  —  The joyful Minnesota governor is a valuable spokesperson for Harris whose background and personality can help the Democratic ticket undermine Trump's efforts to woo America's men.  —  Tim Walz's first official speech on the Democratic ticket displayed … ",
    "url": "https://www.msnbc.com/the-reidout/reidout-blog/tim-walz-manhood-masculinity-trump-maga-rcna165649"
  },
  {
    "text": "Masculinity's check-engine light is on.  Let Tim Walz have a look.  —  Vice-presidential nominee Walz's “Midwestern dad vibe” comes with opportunities to rethink a whole tool kit of types.  —  Tim Walz is running to be America's vice president, but perhaps you've noticed that the internet has already cast him as America's dad.",
    "url": "https://www.washingtonpost.com/style/power/2024/08/08/tim-walz-midwestern-dad/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzIzMDg5NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI0NDcxOTk5LCJpYXQiOjE3MjMwODk2MDAsImp0aSI6ImIwOTMyM2RmLTI4ZDAtNDNmYS1hMDVlLThmNDk4YTlmNWJjNyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9zdHlsZS9wb3dlci8yMDI0LzA4LzA4L3RpbS13YWx6LW1pZHdlc3Rlcm4tZGFkLyJ9.qrXWJDPNCulN4NXB9Zvu68HVlhwQ5LCMY6hNWLrG08s&itid=gfta"
  },
  {
    "text": "Harris campaign tweaks Walz biography amid scrutiny of military credentials  —  The update comes a day after Republicans escalated attacks on his record in the Army National Guard, accusing Walz of inflating his rank at retirement.  —  Kamala Harris' presidential campaign updated … ",
    "url": "https://www.politico.com/news/2024/08/08/harris-walz-military-credentials-00173236"
  },
  {
    "text": "Why isn't the media reporting on Trump's increasing dementia?  —  Today, Trump held an hourlong news conference in the main room at Mar-a-Lago.  He insulted Kamala Harris's intelligence, lied about the state of the U.S. economy, and claimed the country would be in mortal danger if he didn't win the election.",
    "url": "https://robertreich.substack.com/p/why-isnt-the-media-reporting-on-trumps"
  },
  {
    "text": "Harris leads Trump by 5 points in Ipsos poll  —  Democrat Kamala Harris leads Republican Donald Trump 42% to 37% in the race for the Nov. 5 U.S. presidential election, according to an Ipsos poll published on Thursday.  —  The poll found Harris had widened her lead since a July 22-23 Reuters/Ipsos survey … ",
    "url": "https://www.reuters.com/world/us/harris-leads-trump-by-5-points-ipsos-poll-2024-08-08/"
  },
  {
    "text": "Trump holds 2-point lead over Harris with a big advantage on economy, CNBC survey shows … WATCH NOW  —  The CNBC All-America Economic Survey finds former President Donald Trump holding a commanding lead among voters on key economic issues, but ahead of Vice President Kamala Harris … ",
    "url": "https://www.cnbc.com/2024/08/08/trump-holds-2-point-lead-over-harris-with-a-big-advantage-on-economy-cnbc-survey-shows.html"
  },
  {
    "text": "Trump suggests he's open to revoking access to abortion pill  —  The former president has previously praised a Supreme Court ruling that maintained access to the key abortion drug mifepristone.  —  Donald Trump suggested in a news conference Thursday that he is open to curbing access … ",
    "url": "https://www.washingtonpost.com/politics/2024/08/08/trump-abortion-pill-mifepristone-news-conference/"
  },
  {
    "text": "Elon Musk's X Sued an Advertising Coalition.  Now It's Shutting Down.  —  The Global Alliance for Responsible Media will dissolve after Mr. Musk accused the group of orchestrating a boycott.  —  An influential advertising industry group said it would shut down after being sued this week by X … ",
    "url": "https://www.nytimes.com/2024/08/08/technology/elon-musk-x-advertisers-boycott.html?unlocked_article_code=1.BU4.rEt4.gqvdfhrYvbQ6&smid=url-share"
  },
  {
    "text": "Trump assassination attempt: Pennsylvania police release bodycam from deadly Butler rally  —  Police in Pennsylvania released bodycam Thursday showing the chaotic moments after Thomas Crooks attempted to assassinate former President Trump  —  BUTLER, Penn.",
    "url": "https://www.foxnews.com/us/trump-assassination-attempt-pennsylvania-police-release-bodycam-from-deadly-butler-rally"
  },
  {
    "text": "U.S. Athletes Are Taking Full Advantage of Free Healthcare in Olympic Village  —  Women's rugby player Ariana Ramsey's videos showcasing her appointments have gone viral, and now many others are making good use of the medical services offered in Paris.  —  PARIS — Ariana Ramsey won … ",
    "url": "https://www.si.com/olympics/american-athletes-taking-full-advantage-of-free-healthcare-olympic-village-france"
  },
  {
    "text": "Project 2025 is everywhere.  Don't believe the distancing or “winding down” claims.  —  Donald Trump, his many former staff behind Project 2025, JD Vance, and others involved in the far-right project to bend government to a second Trump administration's will are trying to tell us that Project 2025 … ",
    "url": "https://www.lawdork.com/p/project-2025-is-everywhere"
  },
  {
    "text": "Columbia deans resign over texts officials say contained antisemitic tropes  —  Three deans at Columbia University have resigned from the school after text messages that officials said contained antisemitic tropes were revealed.  —  A spokesperson for the school confirmed the resignations of Cristen Kromm … ",
    "url": "https://thehill.com/homenews/education/4819664-columbia-deans-resign-over-texts-antisemitic-tropes/"
  },
  {
    "text": "Nancy Pelosi's Art of Power  —  The former Speaker discusses how she hastened Joe Biden's decision to drop out, her new memoir, and not getting “doggy doo-doo on your shoe.”  —  Nancy Pelosi likes to say that she went from “housewife to House member to House Speaker.”",
    "url": "https://www.newyorker.com/news/daily-comment/nancy-pelosis-art-of-power"
  }
]