[
  {
    "text": "Trump Received Millions From Foreign Governments as President, Report Finds  —  House Democrats released evidence that the former president took in at least $7.8 million from foreign entities while in office, engaging in the kind of conduct the G.O.P. is grasping to pin on President Biden.",
    "url": "https://www.nytimes.com/2024/01/04/us/politics/trump-hotels-foreign-business-report.html"
  },
  {
    "text": "Most Republicans think Donald Trump is a person of faith.  We asked why  —  More Republicans see Trump as a ‘person of faith’ than as ‘religious’  —  Most Republican voters consider former President Donald Trump to be a person of faith, putting him ahead of other more vocally religious individuals … ",
    "url": "https://www.deseret.com/2024/1/3/23982720/republicans-think-donald-trump-is-person-of-faith-we-asked-why"
  },
  {
    "text": "How Trump Has Used Fear and Favor to Win Republican Endorsements  —  The former president keeps careful watch over his endorsements from elected Republicans, aided by a disciplined and methodical behind-the-scenes operation.  —  On his last day as president on Jan. 20, 2021 … ",
    "url": "https://www.nytimes.com/2024/01/04/us/politics/trump-endorsements.html"
  },
  {
    "text": "One attack, two interpretations: Biden and Trump both make the Jan. 6 riot a political rallying cry  —  WASHINGTON — Former President Donald Trump will spend Saturday's third anniversary of the Capitol riot by holding two campaign rallies in leadoff-voting Iowa in his bid to win back the White House.",
    "url": "https://www.washingtonpost.com/politics/2024/01/04/biden-trump-january-6-anniversary-speech-campaign/b9249470-aabe-11ee-bc8c-7319480da4f9_story.html"
  },
  {
    "text": "Illinois and Massachusetts voters seek to take Trump off 2024 ballot  —  Groups of voters from Illinois and Massachusetts on Thursday filed motions to remove Donald Trump from the 2024 ballot, adding to the list of states where the former president faces a challenge to his candidacy under … ",
    "url": "https://www.cnn.com/2024/01/04/politics/illinois-voters-ask-elections-board-to-take-trump-off-2024-ballot/"
  },
  {
    "text": "Michael Fanone Has A Grave Warning For Voters  —  “I'm telling you that this election is like no other,” the former police officer told HuffPost ahead of the third anniversary of the Capitol insurrection.  —  LOADING  —  Former D.C. Metropolitan Police Officer Michael Fanone believes … ",
    "url": "https://www.huffpost.com/entry/michael-fanone-2024-message-voters_n_65957bcbe4b0f27b6e35ff9c"
  },
  {
    "text": "Could the Supreme Court actually disqualify Trump?  —  Donald Trump has now appealed rulings from two states banishing him from their 2024 primary ballots for allegedly engaging in an insurrection after the 2020 election.  Trump petitioned the U.S. Supreme Court on Wednesday to reject the Colorado Supreme Court's decision.",
    "url": "https://www.washingtonpost.com/politics/2024/01/04/could-supreme-court-actually-disqualify-trump/"
  },
  {
    "text": "Multiple people shot at Iowa high school on the first day after winter break, officials say  —  The shooter at Perry High School is dead from an apparent self-inflicted gunshot wound, multiple senior law enforcement officials said.  Three others were injured, including two students and an administrator, the officials added.",
    "url": "https://www.nbcnews.com/news/us-news/live-blog/live-updates-active-shooting-perry-high-school-rcna132235"
  },
  {
    "text": "6 shot, 1 dead following shooting at Perry High School, officials say  —  Dylan Butler, a student at Perry High School, “acted alone,” according to the Iowa Division of Criminal Investigation.  —  PERRY, Iowa — A Perry High School student killed one person and injured five others Thursday morning … ",
    "url": "https://www.weareiowa.com/article/news/local/perry-high-school-iowa-active-shooter-shooting-january-4-police-updates/524-9a97ab8a-808e-4470-935a-7ccd86293a76"
  },
  {
    "text": "17-year-old kills sixth grader, wounds five others in Iowa school shooting, police say  —  Police say multiple people have been shot at a high school in Iowa  —  17-year-old killed a sixth grader in Iowa school shooting, friends of suspect say he was bullied",
    "url": "https://apnews.com/article/perry-high-school-shooting-iowa-1defc6260e074362240a31a7f30cf1b9"
  },
  {
    "text": "Florida venue cancels Marjorie Taylor Greene event after learning of its Jan. 6 focus  —  The event was originally touted as book-signing hosted by a local Republican Party.  —  A central Florida venue has canceled an event that was to feature Rep. Marjorie Taylor Greene, R-Ga. … ",
    "url": "https://www.nbcnews.com/politics/politics-news/florida-venue-cancels-marjorie-taylor-greene-jan-6-event-rcna132365"
  },
  {
    "text": "US hasn't formally assessed if Israel violating human rights  —  The Biden administration has been deflecting accusations this week about Israel's actions in Gaza, saying its ally isn't committing acts of genocide.  But it also acknowledges it conducted no formal assessment of whether Israel is violating international humanitarian law.",
    "url": "https://www.politico.com/newsletters/national-security-daily/2024/01/04/us-hasnt-formally-assessed-if-israel-violating-human-rights-00133799"
  },
  {
    "text": "Trump files ‘powerhouse’ motion calling for Special Counsel Jack Smith to be held in contempt of court  —  Trump attorney says Smith is converting the court's docket into ‘an arm of the Biden campaign’  —  Former President Donald Trump's attorneys filed what his campaign called a “powerhouse” … ",
    "url": "https://www.foxnews.com/politics/trump-files-powerhouse-motion-calling-special-counsel-jack-smith-held-contempt-court"
  },
  {
    "text": "Mob of over 100 looters smashes car through Compton bakery, trashes store after street takeover  —  A mob of over 100 looters purposefully crashed a Kia into a small bakery in Compton, Calif., before they flooded in and ransacked the store during a night of rampage on the streets earlier this week.",
    "url": "https://nypost.com/2024/01/04/news/la-mob-of-over-100-looters-takeover-compton-bakery-after-car-smashes-through-front-door/"
  },
  {
    "text": "Stefanik pulls endorsement of House GOP recruit over Trump criticism  —  The No. 4 House Republican leader said she was “very disappointed” in Craig Riedel's “inappropriate comments.”",
    "url": "https://www.politico.com/live-updates/2024/01/04/congress/stefanik-pulls-ohio-endorsement-trump-arrogant-00133819"
  },
  {
    "text": "Hydroxychloroquine could have caused 17,000 deaths during COVID, study finds  —  Former US President Donald Trump said: ‘What do you have to lose?  Take it.’  —  Nearly 17,000 people may have died after taking hydroxycholoroquine during the first wave of COVID, according to a study by French researchers.",
    "url": "https://www.politico.eu/article/hydroxychloroquine-could-have-caused-17000-deaths-during-covid-study-finds/"
  },
  {
    "text": "Revealed: Roger Stone's Secret Call With Proud Boys Leader in Lead-Up to Jan. 6  —  In this exclusive clip from the doc A Storm Foretold, Trump operative Roger Stone is captured conversing with Proud Boys leader Enrique Tarrio  —  BACK IN SEPTEMBER, the former chairman of the Proud Boys … ",
    "url": "https://www.rollingstone.com/tv-movies/tv-movie-news/roger-stone-secret-call-proud-boys-leader-enrique-tarrio-a-storm-foretold-doc-1234939906/"
  },
  {
    "text": "ISIS claims responsibility for deadly Iran bombing  —  The Islamic State of Iraq and Syria (ISIS) has claimed responsibility for a deadly Iran bombing that killed over 80 people and wounded scores more.  —  ISIS, seen as a terrorist group by most of the world, said in a widely circulated statement … ",
    "url": "https://thehill.com/policy/defense/4389226-isis-iran-bombing-kerman/"
  },
  {
    "text": "Bill Ackman's celebrity academic wife Neri Oxman's dissertation is marred by plagiarism  — Harvard president Claudine Gay resigned after conservative activists revealed she had plagiarized.  — Hedge fund manager and prominent Harvard donor Bill Ackman helped lead the charge against Gay.",
    "url": "https://www.businessinsider.com/bill-ackman-wife-neri-oxman-mit-dissertation-plagiarism-2024-1"
  }
]