[
  {
    "text": "Abrego Garcia and MS-13: What Do We Know?  —  The allegation seems to stem from double hearsay in a document authored by a later suspended police detective.  —  Meet The Authors … In multiple filings, the government has conceded that it wrongfully removed Kilmar Armando Abrego Garcia … ",
    "url": "https://www.lawfaremedia.org/article/abrego-garcia-and-ms-13--what-do-we-know"
  },
  {
    "text": "The Constitutional Crisis Is Here  —  Between the path of outright defiance of the Supreme Court and following its order to “facilitate” the return of Kilmar Abrego Garcia from El Salvador's infamous Centro de Confinamiento del Terrorismo (CECOT), the Trump administration has chosen a third way … ",
    "url": "https://www.theatlantic.com/politics/archive/2025/04/bukele-trump-court-order/682432/?gift=Je3D9AQS-C17lUTOnl2W8FIcAJ_15fkw4XWpbB8kiu0&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Trump told us the horrifying reason why Kilmar Abrego Garcia is not back in the U.S.  —  We are approaching one month since the United States illegally sent Kilmar Abrego Garcia to the CECOT “terrorism” prison in El Salvador on the third March 15 flight that took people to the prison.",
    "url": "https://www.lawdork.com/p/trump-told-us-the-horrifying-reason"
  },
  {
    "text": "Trump's immigration agenda is not popular  —  To start this post, I am going to ask you a key question about immigration policy.  But first, I need to establish a few facts based on recent news:  —  On Monday, April 14, 2025, Donald Trump met with the President of El Salvador, Nayib Bukele, in the Oval Office.",
    "url": "https://www.gelliottmorris.com/p/trumps-immigration-agenda-isnt-popular"
  },
  {
    "text": "Trump is halfway to making America a police state  —  The president's refusal to accept a Supreme Court ruling on illegal deportation is a turning point  —  At around noon on April 14 2025, America ceased to have a law-abiding government.  Some would argue that had already happened on January 20, when Donald Trump was inaugurated.",
    "url": "https://www.ft.com/content/4c4b0f14-3e85-4436-94de-204d3f518f3c"
  },
  {
    "text": "Maryland senator requests meeting with Salvadoran president to discuss deported Maryland man  —  Maryland Sen. Chris Van Hollen requested a meeting with El Salvador President Nayib Bukele during his visit to the United States to discuss the return of Kilmar Abrego Garcia, a Maryland man who was wrongly deported.",
    "url": "https://www.cbsnews.com/baltimore/news/van-hollen-el-salvador-abrego-garcia-deportation/"
  },
  {
    "text": "Levin and Martinez express support for Harvard amid funding fight with Trump administration  —  University president Jonathan Levin '94 and Provost Jenny Martinez expressed support for Harvard after its president Alan Garber M.D. '83 — a Stanford Medicine professor emeritus … ",
    "url": "https://stanforddaily.com/2025/04/15/levin-martinez-back-harvard-president/"
  },
  {
    "text": "A whistleblower's disclosure details how DOGE may have taken sensitive labor data  —  In the first days of March, a team of advisers from President Trump's new Department of Government Efficiency initiative arrived at the Southeast Washington, D.C., headquarters of the National Labor Relations Board.",
    "url": "https://www.npr.org/2025/04/15/nx-s1-5355896/doge-nlrb-elon-musk-spacex-security"
  },
  {
    "text": "JD Vance: My message to Europe America doesn't want a vassal continent  —  “It's not good for Europe to be the permanent security vassal of the United States.”  So says JD Vance during a phone conversation with UnHerd on Monday, his first major interview with a European outlet since taking office as Vice President.",
    "url": "https://unherd.com/2025/04/jd-vance-my-message-to-europe/"
  },
  {
    "text": "Why President Trump isn't signing many laws … Trump and Republican congressional leaders often claim his new administration has been the most productive in recent memory.  —  Except when it comes to passing laws.  —  Trump has signed fewer bills into law at this point in his presidency … ",
    "url": "https://punchbowl.news/article/white-house/trump-bills-first-hundred-days/"
  },
  {
    "text": "This Tax Day, an IRS in Crisis  —  Every year during tax season, please spare a thought for the IRS.  It is our least loved agency, but one of our most important.  Last year, I noted how an IRS modernization effort was making real progress in terms of improved service quality.",
    "url": "https://donmoynihan.substack.com/p/this-tax-day-an-irs-in-crisis"
  },
  {
    "text": "Columbia Activist Arrested by ICE at His Appointment for Citizenship  —  Mohsen Mahdawi, a legal permanent resident, has lived in the United States for 10 years and was arrested in Vermont.  He has not been charged with a crime.  —  Mohsen Mahdawi, an organizer of pro-Palestinian demonstrations … ",
    "url": "https://www.nytimes.com/2025/04/14/nyregion/columbia-student-palestinian-arrested-ice.html?unlocked_article_code=1._k4.8_ZE.-FIbFnHAlLiG&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "The Vibe Shifts Against the Right  —  Alex Kaschuta's podcast, “Subversive,” used to be a node in the network between weird right-wing internet subcultures and mainstream conservatism.  She hosted men's rights activists and purveyors of “scientific” racism, neo-reactionary online personalities … ",
    "url": "https://www.nytimes.com/2025/04/14/opinion/dissident-right-trump.html?unlocked_article_code=1._04.sl24.OWMmanBrjj5U&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "US Derails G-7 Condemnation of Russian Missile Strike on Ukraine  —  The US has told Group of Seven allies it won't endorse a statement condemning Russia's deadliest attack on Ukraine this year because it wants to keep negotiations with Moscow on track.  —  Russia fired two short-range … ",
    "url": "https://www.bloomberg.com/news/articles/2025-04-15/us-derails-g-7-condemnation-of-russian-missile-strike-on-ukraine"
  },
  {
    "text": "Inside Trump's Plan to Halt Hundreds of Regulations … At the Department of Health and Human Services, Trump administration officials want to reverse a regulation that has required nursing homes to have more medical staff on duty.  —  At the Mine Safety and Health Administration … ",
    "url": "https://www.nytimes.com/2025/04/15/us/politics/trump-doge-regulations.html?unlocked_article_code=1._04.DssR.oTOM7pWte8bU&smid=url-share"
  },
  {
    "text": "China Orders Boeing Jet Delivery Halt as Trade War Expands … Beijing has also asked that Chinese carriers halt any purchases of aircraft-related equipment and parts from US companies, the people said, asking not to be identified discussing matters that are private.",
    "url": "https://www.bloomberg.com/news/articles/2025-04-15/china-tells-airlines-stop-taking-boeing-jets-as-trump-tariffs-expand-trade-war"
  },
  {
    "text": "DOGE cut a CDC team as it was about to start a project to help N.C. flood victims  —  In and around Asheville, N.C., there are still visible signs of devastation that remain from the floods of Hurricane Helene six months ago: rusted debris in the yards of water-damaged residences in ruins.",
    "url": "https://www.npr.org/sections/shots-health-news/2025/04/15/nx-s1-5364897/cdc-disaster-doge-trump-layoffs-hurricane-helene"
  },
  {
    "text": "State Dept. to propose major overhaul of U.S. diplomatic footprint … The document, part of a broader FY 2026 budget proposal due to the Office of Management and Budget later today, outlines a consolidation of outposts in countries such as Japan and Canada, that includes “resizing” … ",
    "url": "https://punchbowl.news/article/foreign-policy/state-major-overhaul/"
  },
  {
    "text": "White House to Ask Congress to Claw Back Funding From NPR and PBS  —  Trump administration officials want legislators to rescind $1.1 billion for the Corporation for Public Broadcasting, which provides some support for public media.  —  The White House is planning to ask Congress to claw … ",
    "url": "https://www.nytimes.com/2025/04/14/business/media/trump-npr-pbs-funding.html"
  },
  {
    "text": "North Carolina Supreme Court throws out hundreds of ballots based on flawed data  —  This is a special collaboration between Popular Information and Anderson Alerts, a newsletter about North Carolina politics.  —  Josiah Young was born and raised in North Carolina.",
    "url": "https://popular.info/p/north-carolina-supreme-court-throws"
  },
  {
    "text": "EU Expects US Tariffs to Stay as Talks Make Little Progress  —  The European Union and US made scant progress bridging trade differences this week as officials from President Donald Trump's administration indicated that the bulk of the US tariffs imposed on the bloc will not be removed.",
    "url": "https://www.bloomberg.com/news/articles/2025-04-15/eu-expects-most-us-tariffs-to-stay-as-talks-make-little-progress"
  },
  {
    "text": "This Lawyer Defended Republicans and Democrats.  His Candor Cost Him His Job.  —  Erez Reuveni, a career Justice Department attorney, made no excuses for the government's error in deporting a man to an El Salvador prison  —  WASHINGTON—When a judge expressed outrage that the first Trump administration had … ",
    "url": "https://www.wsj.com/politics/policy/this-lawyer-defended-republicans-and-democrats-his-candor-cost-him-his-job-b3515a38?st=KTs59Z&reflink=desktopwebshare_permalink"
  },
  {
    "text": "State Terror  —  Yesterday the president defied a Supreme Court ruling to return a man who was mistakenly sent to a gulag in another country, celebrated the suffering of this innocent person, and spoke of sending Americans to foreign concentration camps.  —  This is the beginning … ",
    "url": "https://snyder.substack.com/p/state-terror"
  },
  {
    "text": "Man arrested after threatening Tulsi Gabbard and her husband  —  “Prepare to die, you, Tulsi, and everyone you hold dear,” one of the texts read, according to the Justice Department.  “America will burn.”  —  A man is facing a federal charge after allegedly threatening to kill Director … ",
    "url": "https://www.nbcnews.com/news/us-news/man-arrested-threatening-tulsi-gabbard-husband-rcna201289"
  }
]