[
  {
    "text": "Justice Department broadens Trump's Jan. 6 clemency as it moves to drop gun cases  —  In court papers, DOJ revealed a newly expansive interpretation of the president's Jan. 6 pardons.  —  The Justice Department now says that President Donald Trump's clemency for Jan. 6 rioters covers unrelated crimes … ",
    "url": "https://www.politico.com/news/2025/02/20/justice-department-january-6-clemency-guns-00205357"
  },
  {
    "text": "Senate confirms Kash Patel as FBI director  —  The Trump loyalist is taking over a bureau in turmoil over firings and an effort to gather names of people who worked on Jan. 6 Capitol riot investigations.  —  WASHINGTON — Kash Patel, a longtime loyalist to President Donald Trump … ",
    "url": "https://www.nbcnews.com/politics/justice-department/senate-confirms-kash-patel-fbi-director-rcna192842"
  },
  {
    "text": "Senate confirms Kash Patel, fierce critic of FBI, to head the bureau  —  The Republican-led Senate voted Thursday to confirm Kash Patel as the new FBI director despite questions about whether he has the qualifications and the temperament to lead the nation's most powerful law enforcement agency.",
    "url": "https://www.npr.org/2025/02/20/g-s1-49696/trump-cabinet-picks-kash-patel"
  },
  {
    "text": "DOGE's Millions: As Musk and Trump Gut Government, Their Ax-Cutting Agency Gets Cash Infusion  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up to receive our biggest stories as soon as they're published.  —  While Elon Musk and his underlings demand budget cuts … ",
    "url": "https://www.propublica.org/article/doge-trump-musk-funding-foia-congress-transparency"
  },
  {
    "text": "The private GOP panic over the slash-and-burn DOGE firings  —  White House aides are inundated with congressional calls as Republicans fret.  —  A growing number of congressional Republicans are desperately trying to back-channel with White House officials as President Donald Trump's Department … ",
    "url": "https://www.politico.com/news/2025/02/20/gop-lawmaker-doge-cut-panic-00205282"
  },
  {
    "text": "Trump expected to take control of USPS, fire postal board, officials say  —  The move threatens to upend trillions of dollars in ecommerce business and the 250-year-old Postal Service.",
    "url": "https://www.washingtonpost.com/business/2025/02/20/trump-usps-takeover-dejoy/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQwMDI3NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQxNDA5OTk5LCJpYXQiOjE3NDAwMjc2MDAsImp0aSI6ImYxNGZjMDk0LWQxYTQtNDY1NC1hYTlhLTYxMjg2NTBhZjQ5MiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9idXNpbmVzcy8yMDI1LzAyLzIwL3RydW1wLXVzcHMtdGFrZW92ZXItZGVqb3kvIn0.u4-aaGSTQ9mIRyCxMtpynB5uVJCYDnGl767MBhDWh2A&itid=gfta"
  },
  {
    "text": "Gov. Hochul says she won't remove NYC Mayor Adams from office … We rely on your support to make local news available to all  —  Make your contribution now and help Gothamist thrive in 2025.  Donate today  —  Gothamist is funded by sponsors and member donations",
    "url": "https://gothamist.com/news/gov-hochul-wont-remove-nyc-mayor-adams-from-office-for-now-source-says"
  },
  {
    "text": "Sen. Mitch McConnell won't seek reelection in 2026, ending long tenure as Republican power broker  —  Republican Sen. Mitch McConnell is announcing on Thursday that he won't seek reelection next year, ending a decadeslong tenure as a power broker who championed conservative causes … ",
    "url": "https://apnews.com/article/mitch-mcconnell-senate-retirement-34c79ef12bf62d14cb71d3c393f23a83"
  },
  {
    "text": "Trump again raises idea of running for an unconstitutional third term  —  The suggestion followed a stretch of days in which Trump referred to himself as a king and quoted a dictator in suggesting that he was immune from following laws  —  President Donald Trump on Thursday again raised … ",
    "url": "https://www.washingtonpost.com/politics/2025/02/20/trump-third-term-king-unconstitutional/"
  },
  {
    "text": "HHS orders CDC to halt some vaccine ads, saying RFK Jr. wants message focused on ‘informed consent’  —  Experts fear effort to recalibrate tone could dampen vaccine uptake  —  The Centers for Disease Control and Prevention was ordered to shelve promotions it developed for a variety of vaccines … ",
    "url": "https://www.statnews.com/2025/02/20/cdc-vaccine-promotions-rfk-jr-informed-consent/"
  },
  {
    "text": "Elon Musk's private security detail gets deputized by US Marshals Service  —  The US Marshals Service has deputized members of Elon Musk's private security detail, giving them certain rights and protections of federal law enforcement agents, three law enforcement officials familiar with the matter told CNN.",
    "url": "https://www.cnn.com/2025/02/20/politics/elon-musk-private-security-deputized-marshals-service/"
  },
  {
    "text": "Justice Department deletes database tracking federal police misconduct  —  Trump executive order ends National Law Enforcement Accountability Database, which Trump proposed creating in 2020  —  The first nationwide database tracking misconduct by federal police officers has been shut … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2025/02/20/trump-justice-nlead-database-deleted/"
  },
  {
    "text": "Hundreds of Philly IRS workers laid off on Thursday, union says  —  Around 400 Philadelphia IRS workers are expected to be laid off on Thursday, Feb. 20, union leader Alex Jay Berman confirmed  —  Hundreds of Philadelphia IRS employees were laid off on Thursday as part of the Trump administration's efforts … ",
    "url": "https://www.nbcphiladelphia.com/news/local/philadelphia-irs-layoffs-firings-union-president-trump/4114738/"
  },
  {
    "text": "X Hinted at Possible Deal Trouble in Talks With Ad Giant to Increase Spending  —  Interpublic recently signed an advertising agreement with the platform; other agencies are also in negotiations  —  A lawyer at advertising conglomerate Interpublic Group fielded a phone call in December … ",
    "url": "https://www.wsj.com/business/media/x-hinted-at-possible-deal-trouble-in-talks-with-ad-giant-to-increase-spending-feb122a6?st=uZvVpH&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Acting U.S. attorney opens inquiries into Democrats alleging possible threats to DOGE, Supreme Court justices  —  Ed Martin, the acting U.S. attorney for the District of Columbia, revealed he has opened inquiries into public statements of Sen. Chuck Schumer, the Democratic leader in the U.S. Senate … ",
    "url": "https://www.cbsnews.com/news/acting-u-s-attorney-inquiry-schumer-possible-threat-doge-supreme-court-justices/"
  },
  {
    "text": "Paramount Is Starting to Fight Back Against Trump in ‘60 Minutes’ Lawsuit  —  The CBS News owner's legal strategy has revolved around arguments challenging the President's insistence that it should stay in federal court in Texas, in addition to raising the specter of discovery and arbitration.",
    "url": "https://www.hollywoodreporter.com/business/business-news/paramount-fighting-trump-60-minutes-lawsuit-1236142433/"
  },
  {
    "text": "Trump Administration Abruptly Clears Out Migrants It Sent to Guantánamo  —  A transfer operation on Thursday repatriated 177 Venezuelans via a handoff in Honduras, while one migrant was brought back to U.S. soil.  —  The Trump administration on Thursday transferred all of the Venezuelan migrants … ",
    "url": "https://www.nytimes.com/2025/02/20/us/politics/guantanamo-venezuelans-trump-migrants.html?unlocked_article_code=1.yk4.Pbuo.YUvSy5Y76rwV&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Trump Team Plans Deep Cuts at Office That Funds Recovery From Big Disasters  —  Staff at the office, a branch of the U.S. housing department that Congress uses to address the worst catastrophes, would be reduced by 84 percent.  —  The Trump administration plans to all but eliminate the office … ",
    "url": "https://www.nytimes.com/2025/02/20/climate/trump-cuts-hud-disaster-recovery.html?unlocked_article_code=1.yU4.8YfX.6o3vtAA6f4In&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "DOGE Puts $1 Spending Limit on Government Employee Credit Cards  —  The restrictions are already in place at the General Services Administration along with several other agencies.  Soon they'll roll out to most of the federal government, sources say.  —  Elon Musk's so-called Department … ",
    "url": "https://www.wired.com/story/doge-government-credit-cards/"
  },
  {
    "text": "Trump Dismantles Government Fight Against Foreign Influence Operations  —  The Trump administration has reassigned or forced out several dozen government employees who had been working to fight foreign interference in U.S. elections at multiple agencies, according to current and former officials.",
    "url": "https://www.nytimes.com/2025/02/20/business/trump-foreign-influence-election-interference.html?unlocked_article_code=1.yU4.AZOt.qiZb0SfZ1_20&smid=bs-share"
  },
  {
    "text": "Chris Kluwe isn't backing down after arrest for MAGA protest.  'Somebody's got to step up'  —  HUNTINGTON BEACH, Calif. - Former NFL punter Chris Kluwe wore a T-shirt, shorts and flip flops when he showed up to talk about his arrest Tuesday night during the Huntington Beach City Council meeting.",
    "url": "https://www.usatoday.com/story/sports/nfl/2025/02/20/chris-kluwe-arrest-maga-protest-city-council-meeting/79337534007/"
  },
  {
    "text": "Terrorist Designations of International Cartels  —  Today, the State Department is fulfilling one of President Trump's first promises since he took office.  I'm pleased to announce the Department's designation of eight organizations as Foreign Terrorist Organizations (FTOs) and Specially Designated Global Terrorists (SDGTs).",
    "url": "https://www.state.gov/terrorist-designations-of-international-cartels/"
  },
  {
    "text": "Judge warns Trump administration not to dodge court order unfreezing foreign aid  —  Officials avoid contempt of court, but can't implement any broad holds on payments, a judge ruled.  —  A federal judge delivered a stern warning to the Trump administration that it must abide by a court order … ",
    "url": "https://www.politico.com/news/2025/02/20/judge-warn-trump-administration-foreign-aid-00205377"
  },
  {
    "text": "The Ultimate Betrayal  —  America just switched sides in the Ukraine war. … Even though anyone with eyes could see this coming, Donald Trump's recent moves with regard to Ukraine and Russia come as a huge blow.  We are in the midst of a global fight between Western liberal democracy … ",
    "url": "https://www.persuasion.community/p/the-ultimate-betrayal"
  },
  {
    "text": "Education Department “Lifting the Pause” on Some Civil Rights Probes, but Not for Race or Gender Cases  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up to receive our biggest stories as soon as they're published.  —  The U.S. Department of Education … ",
    "url": "https://www.propublica.org/article/department-education-civil-rights-investigations-disability-gender-race-discrimination"
  },
  {
    "text": "Trump's Putinization of America  —  It's not just in foreign policy that the President is turning Russia's way.  —  No matter how many times Donald Trump openly parrots the Kremlin line, it's never not going to sound wrong coming from the President of the United States.",
    "url": "https://www.newyorker.com/news/letter-from-trumps-washington/trumps-putinization-of-america"
  },
  {
    "text": "Trump administration backtracks on eliminating thousands of national parks employees  —  Following a loud public outcry about job cuts at the National Parks Service — and a relentless media campaign from outdoors enthusiasts across the country — it looks like the Trump administration has blinked.",
    "url": "https://www.latimes.com/california/story/2025-02-20/trump-administration-backtracks-eliminating-thousands-national-parks-employees"
  },
  {
    "text": "Grand jury recommends Alabama police department be ‘immediately abolished’  —  Five officers were indicted amid a probe into the Hanceville Police Department.  —  Cody Alan Kelso, Jason Scott Wilbanks, Jason Shane Marlin, William Andrew Shelnutt, and Eric Michael Kelso are shown … ",
    "url": "https://abcnews.go.com/US/hanceville-alabama-police-department-officers-indicted-grand-jury-abolish/story?id=118989336"
  },
  {
    "text": "‘Cowardliness at the top’: Science agency staff revolt over cuts  —  At an emotional meeting, foundation officials announced layoffs for about 10 percent of their workforce and warned of more firings to come.  —  The National Science Foundation went beyond the staff cuts demanded … ",
    "url": "https://www.politico.com/news/2025/02/20/inside-national-science-foundation-firings-00204763"
  },
  {
    "text": "Is That Legal?  A Guide to Trump's Big Moves So Far.  —  Examining the legality of 38 major actions the president has taken in his first month.  —  In his first month in office, President Trump has ordered a radical set of changes to the federal government.",
    "url": "https://www.nytimes.com/2025/02/20/upshot/trump-executive-orders-legality.html"
  },
  {
    "text": "‘Stand up for us!’  Republican shouted down as he defends DOGE cuts at town hall  —  Rep. Rich McCormick (R-GA) tried to tout massive federal spending cuts proposed by tech billionaire Elon Musk's Department of Government Efficiency task force at a town hall in his heavily Republican district … ",
    "url": "https://www.rawstory.com/rich-mccormick/"
  },
  {
    "text": "Judge rules against union bid to block mass federal layoffs by Trump  —  The case was the broadest suit brought against the Trump administration over its plans to dismiss both probationary workers and thousands of other government employees.  —  A federal judge Thursday denied a bid … ",
    "url": "https://www.nbcnews.com/politics/trump-administration/trump-can-move-forward-federal-firings-judge-rules-unions-lawsuit-rcna193071"
  },
  {
    "text": "The End of the Postwar World  —  Trump's cruelty and lies about Ukraine send a dark message to America's other allies.  —  For eight decades, America's alliances with other democracies have been the bedrock of American foreign policy, trade policy, and cultural influence.",
    "url": "https://www.theatlantic.com/international/archive/2025/02/trump-ukraine-postwar-world/681745/?gift=hVZeG3M9DnxL4CekrWGK35iUJsVcM2Xa87K_rW9aC5Y&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  }
]