[
  {
    "text": "Fulton County special grand jury recommended charges against Lindsey Graham and 2 Georgia US senators  —  The special grand jury in Fulton County investigating the 2020 presidential election in Georgia recommended charges against Republican Sen. Lindsey Graham of South Carolina and former GOP … ",
    "url": "https://www.cnn.com/2023/09/08/politics/fulton-county-special-grand-jury-report/"
  },
  {
    "text": "Grand jury called for indicting Sens. Graham, Perdue, Loeffler in Trump Georgia election case  — The full special grand jury report that previewed the criminal indictment of former President Donald Trump and 18 others for trying to overturn his loss in the 2020 Georgia election was released.",
    "url": "https://www.cnbc.com/2023/09/08/trump-georgia-election-case-special-grand-jury-report-release-set.html"
  },
  {
    "text": "BREAKING: Fulton special grand jury recommended 39 indictments  —  X  —  Members of the Fulton County special purpose grand jury that investigated interference in Georgia's 2020 presidential election recommended that 39 people be indicted for alleged crimes, including former President Donald Trump … ",
    "url": "https://www.ajc.com/politics/breaking-fulton-special-grand-jury-recommended-dozens-of-indictments/EGPPH6ER7RCNZCOSSULHQVCRQM/"
  },
  {
    "text": "Republicans are trying to find a new term for ‘pro-life’ to stave off more electoral losses  —  Sen. Todd Young, R-Ind., summarized the closed-door meeting on Capitol Hill as being focused on “pro-baby policies.”  —  WASHINGTON — Republican strategists are exploring a shift away from … ",
    "url": "https://www.nbcnews.com/politics/congress/republicans-try-find-new-term-life-stave-electoral-losses-rcna103924"
  },
  {
    "text": "Kristi Noem is suddenly front and center in the veepstakes  —  The South Dakota governor will appear with Donald Trump at an event in Rapid City on Friday.  —  Not long ago, it looked like Kristi Noem's star was flaming out.  Following a turbulent first term, the South Dakota governor elected … ",
    "url": "https://www.politico.com/news/2023/09/08/kristi-noem-veepstakes-00114586"
  },
  {
    "text": "Trump overstated net worth by up to $3.6 billion per year, NY AG alleges in new filing  — Former President Donald Trump's net worth was inflated by billions of dollars per year more than what he claimed, the New York attorney general's office alleged in a new court filing.",
    "url": "https://www.cnbc.com/2023/09/08/trump-overstated-net-worth-by-up-to-3point6-billion-per-year-ny-ag-alleges-in-new-filing.html"
  },
  {
    "text": "Another Christian influencer arrested for child abuse: Why conservatives keep falling for these cons  —  Ruby Franke was yet another Duggar knock-off, putting a shiny happy gloss on religious oppression  —  In many ways, it's the least surprising story of our times: A showily Christian … ",
    "url": "https://www.salon.com/2023/09/08/another-christian-influencer-arrested-for-child-abuse-why-conservatives-keep-falling-for-these-cons/"
  },
  {
    "text": "IRS cracking down on 1,600 millionaires over back taxes  —  The IRS is launching an initiative to crack down on 1,600 millionaires and 75 large businesses it says owe hundreds of millions of dollars in back taxes, the agency announced Friday.  —  The program takes advantage of additional funding … ",
    "url": "https://thehill.com/business/4193872-irs-cracking-down-on-1600-millionaires-over-back-taxes/"
  },
  {
    "text": "I.R.S. Deploys Artificial Intelligence to Target Rich Partnerships  —  The tax agency is opening examinations into large hedge funds, private equity groups, real estate investors and law firms.  —  The Internal Revenue Service has started using artificial intelligence to investigate tax evasion … ",
    "url": "https://www.nytimes.com/2023/09/08/us/politics/irs-deploys-artificial-intelligence-to-target-rich-partnerships.html"
  },
  {
    "text": "BLASTPASS: NSO Group iPhone Zero-Click, Zero-Day Exploit Captured in the Wild  —  Apple has just issued an update for Apple products including iPhones, iPads, Mac computers, and Apple Watches.  We encourage all users to immediately update their devices.  —  We urge all at-risk users … ",
    "url": "https://citizenlab.ca/2023/09/blastpass-nso-group-iphone-zero-click-zero-day-exploit-captured-in-the-wild/"
  },
  {
    "text": "Pence says he supports an impeachment inquiry by House Republicans  —  House Republicans are floating the possibility of an impeachment inquiry of President Biden  —  Former Vice President Pence said there is an “ethical cloud” hanging over the Biden family and President Biden's administration … ",
    "url": "https://www.foxnews.com/politics/pence-says-ethical-cloud-hangs-over-biden-family-would-support-an-impeachment-inquiry-by-house-gop"
  },
  {
    "text": "Trump Hates Hillary Clinton.  He Might Hate This Judge More.  —  Donald Trump's revenge lawsuit against Hillary Clinton has turned into a retaliatory plot against a judge he has history with.  And now he's testing his ability to target judges.  —  Donald Trump is still so bitter … ",
    "url": "https://www.thedailybeast.com/trump-hates-hillary-clinton-he-might-hate-this-judge-more"
  },
  {
    "text": "Border Crisis Comes to Blue Cities After Migrants Are Bused North  —  The strain of migrants in New York, Chicago, Los Angeles and other cities has taxed resources, divided Democrats and put pressure on President Biden to act.  —  When Gov. Greg Abbott of Texas began sending migrants … ",
    "url": "https://www.nytimes.com/2023/09/08/us/politics/gop-migrants-blue-cities.html"
  },
  {
    "text": "Trump Adviser Peter Navarro Was Convicted, Really Fast, of Contempt of Congress  —  “Executive privilege” is not a magical incantation.  —  Donald Trump and many of his acolytes take the position that the words “executive privilege” are more or less magic.",
    "url": "https://www.motherjones.com/politics/2023/09/peter-navarro-verdit-contempt-congress/"
  },
  {
    "text": "Appeals court temporarily stays order for Texas to remove buoy barrier  —  The ruling will allow Texas to keep the buoys in the Rio Grande while the court renders a full decision.  —  The 5th U.S. Circuit Court of Appeals on Thursday temporarily halted a district judge's order for Texas … ",
    "url": "https://www.politico.com/news/2023/09/07/appeals-court-temporarily-stays-order-for-texas-to-remove-buoy-barrier-00114631"
  },
  {
    "text": "DeSantis voiced complaints about top super PAC strategist, people familiar with comments say  —  The Florida governor and White House hopeful was “apoplectic” over a pre-debate strategy memo publicly posted on the website of Jeff Roe's firm, according to one person familiar with the comments",
    "url": "https://www.washingtonpost.com/politics/2023/09/08/ron-desantis-super-pac-debate/"
  },
  {
    "text": "Exclusive: How the Supreme Court's conservatives rebuffed Alabama  —  When the Supreme Court considered the challenge to an Alabama congressional map that shortchanged the state's Black voters, liberal justices expected the conservative majority to side with Alabama - if not gut the 1965 Voting Rights Act altogether.",
    "url": "https://www.cnn.com/2023/09/08/politics/supreme-court-voting-rights-kavanaugh-alabama/"
  },
  {
    "text": "The Supreme Court's Fake Praying Coach Case Just Got Faker  —  Last year, the Supreme Court ruled in favor of high school football coach's right to engage in “brief, quiet, personal” prayer—despite photographic evidence that his prayers were drawn-out, loud, and extremely public.",
    "url": "https://slate.com/news-and-politics/2023/09/supreme-court-praying-coach-joe-kennedy-fake.html"
  },
  {
    "text": "The surprisingly strong constitutional case for Trump's disqualification  —  The 14th Amendment is quite clear that insurrectionists can't hold office.  —  ∙ Paid … Citizens for Responsibility and Ethics in Washington (CREW) sued earlier this week to keep Donald Trump off the presidential ballot in Colorado.",
    "url": "https://www.publicnotice.co/p/trump-14th-amendment-section-3-disqualified-crew"
  },
  {
    "text": "Wisconsin Republicans Try to Subvert Democracy, Again  —  For a little while this year, it looked as though Wisconsin voters had finally broken out of the straitjacket of minority rule in their state.  The key to their freedom was an April State Supreme Court election that … ",
    "url": "https://www.nytimes.com/2023/09/08/opinion/wisconsin-supreme-court-impeach.html"
  },
  {
    "text": "Justice Samuel Alito rejects calls from Democratic senators to recuse in case involving journalist who interviewed him  —  Supreme Court Justice Samuel Alito sharply rejected calls from Democratic senators that he not participate in an upcoming tax case where one of the lawyers involved … ",
    "url": "https://www.cnn.com/2023/09/08/politics/alito-durbin-supreme-court-ethics/"
  },
  {
    "text": "Climate protester glues feet to floor, interrupting US Open semifinal between Gauff and Muchova  —  The U.S. Open semifinal between Coco Gauff and Karolina Muchova was delayed by 50 minutes because of a disruption by environmental activists in the Arthur Ashe Stadium stands on Thursday night.",
    "url": "https://apnews.com/article/us-open-delay-women-semifinals-gauff-muchova-00a82f465076adea36b098aa6ca08a0d"
  },
  {
    "text": "Jim Jordan seeks docs from Jack Smith's dealings with attorney in Trump classified records fight  —  House Judiciary Chairman Jim Jordan (R-Ohio) on Thursday asked special counsel Jack Smith to turn over information relating to attorney Stanley Woodward, who has represented numerous Mar-a-Lago employees in dealings with prosecutors.",
    "url": "https://thehill.com/homenews/house/4193068-jim-jordan-seeks-docs-from-jack-smiths-dealings-with-attorney-representing-defendants-in-trump-classified-records-fight/"
  }
]