[
  {
    "text": "Ukraine Aid Bill Clears Critical Hurdle in the House as Democrats Supply the Votes  —  Democrats stepped in to support bringing the aid package to the floor, in a remarkable breach of custom on a key vote that paved the way for its passage.  —  The House took a critical step on Friday toward approving … ",
    "url": "https://www.nytimes.com/2024/04/19/us/politics/congress-vote-ukraine-bill-house.html"
  },
  {
    "text": "Man Sets Himself on Fire Near Courthouse Where Trump Is on Trial  —  Onlookers screamed as fire engulfed the man, who had thrown pamphlets in the air before he set himself aflame.  A police officer tried to extinguish the flames before the man was taken away in an ambulance.",
    "url": "https://www.nytimes.com/2024/04/19/nyregion/man-on-fire-trump.html"
  },
  {
    "text": "Man Sets Himself on Fire Outside Court Amid Trump Trial  —  A man set himself on fire on Friday outside the New York courthouse where Donald Trump's historic hush-money trial was taking place, witnesses said.  —  A witness on the scene said he first heard the man throwing pamphlets into the air … ",
    "url": "https://freebeacon.com/issues/man-sets-himself-on-fire-outside-court-amid-trump-trial/"
  },
  {
    "text": "Emergency rooms refused to treat pregnant women, leaving one to miscarry in a lobby restroom  —  One woman miscarried in the lobby restroom of a Texas emergency room as front desk staff refused to admit her.  Another woman learned that her fetus had no heartbeat at a Florida hospital … ",
    "url": "https://apnews.com/article/pregnancy-emergency-care-abortion-supreme-court-roe-9ce6c87c8fc653c840654de1ae5f7a1c"
  },
  {
    "text": "New York AG says $175 million Trump fraud bond isn't properly backed, should be voided … Former President Donald Trump returns from a lunch break at Manhattan criminal court as jury selection continues in New York, NY on Thursday, April 18, 2024. … - CNBC Councils  — CNBC on Peacock",
    "url": "https://www.cnbc.com/2024/04/19/new-york-ag-says-175-million-trump-fraud-bond-isnt-properly-backed-should-be-voided.html"
  },
  {
    "text": "NY AG asks Trump civil fraud judge to declare $175M bond ‘without effect’  —  The New York attorney general's office has asked a judge to void the $175 million bond former President Trump secured to put off paying the larger monetary damage award in his civil fraud case.",
    "url": "https://thehill.com/regulation/court-battles/4606053-ny-ag-trump-civil-fraud-judge-declare-175m-bond-without-effect/"
  },
  {
    "text": "Whiplash as Russia Toasts Derided Marjorie Taylor Greene as Their Top New Hero  —  FROM FOOL TO TOOL  —  Speaker Mike Johnson is no longer Russia's No.1 favorite, he's been replaced by a congresswoman who was once roundly mocked on Russian TV.  —  In recent years, clips from Tucker Carlson's shows … ",
    "url": "https://www.thedailybeast.com/whiplash-as-russia-toasts-derided-marjorie-taylor-greene-as-their-top-new-hero"
  },
  {
    "text": "This G.O.P. Senate Candidate Says He Grew Up on a Family Farm.  Not Exactly.  —  David McCormick has often spoken about his modest upbringing on a farm in Pennsylvania.  A close look at his past tells a different story.  —  David McCormick's origin story goes something like this … ",
    "url": "https://www.nytimes.com/2024/04/19/us/politics/dave-mccormick-farm-pennsylvania.html"
  },
  {
    "text": "Columbia University is colluding with the far-right in its attack on students  —  In her willingness to unleash state violence against student protestors, Minouche Shafik proved herself to be a willing ally to extremists  —  The students sat on the ground and sang as police in riot gear approached them.",
    "url": "https://www.theguardian.com/commentisfree/2024/apr/19/far-right-columbia-university-student-arrests"
  },
  {
    "text": "Trump's Trial Is Already Wreaking Havoc on His Campaign  —  THE DEFENSE IS RESTLESS  —  The hush money trial was never going to be good for Trump, but the first week in court proved just how disruptive and damaging it will be for his 2024 bid. … TRIAL AND ERROR",
    "url": "https://www.thedailybeast.com/trumps-trial-is-already-wreaking-havoc-on-his-campaign"
  },
  {
    "text": "Twitter alternative Post News is shutting down … Post News, a Twitter alternative that emerged in the wake of Elon Musk's takeover, is shutting down.  Noam Bardin, the platform's founder and former CEO of Waze, writes that Post News “is not growing fast enough to become a real business or a significant platform.”",
    "url": "https://www.theverge.com/2024/4/19/24135011/twitter-alternative-post-news-shutdown"
  },
  {
    "text": "Judge locks up ‘Three Percenter’ militia members in Jan. 6 obstruction case  —  The obstruction of an official proceeding charge is in jeopardy before the Supreme Court, meaning that some of the defendants could ultimately only serve a year in prison.  —  WASHINGTON — Three California men … ",
    "url": "https://www.nbcnews.com/politics/justice-department/judge-locks-three-percenter-militia-members-jan-6-obstruction-case-rcna148456"
  },
  {
    "text": "Biden-Harris Administration Takes Critical Action to Protect Alaska Native Subsistence, Lands and Wildlife  —  Publishes final rule to maximize protections for more than 13 million acres in the western Arctic, invites input on additional Special Area protections",
    "url": "https://www.doi.gov/pressreleases/biden-harris-administration-takes-critical-action-protect-alaska-native-subsistence"
  },
  {
    "text": "Iran fires at apparent Israeli attack drones near Isfahan air base and nuclear site  —  Iran has fired air defenses at a major air base and a nuclear site near its central city of Isfahan after spotting drones.  The commotion early Friday raised fears of a possible Israeli retaliatory strike … ",
    "url": "https://apnews.com/article/iran-israel-mideast-tensions-4-19-2024-a7ccbae2e2844bab089e8e4377a24ddb"
  },
  {
    "text": "‘Sleepy Don’ Dozes Off in Court AGAIN  —  NEEDS SLEEP BIGLY  —  Apparently a high-stakes trial just isn't enough to keep the former president awake.  —  Apparently Donald Trump needs to catch up on some sleep, as the former president appeared to doze off in a New York City courtroom yet again on Friday.",
    "url": "https://www.thedailybeast.com/sleepy-don-dozes-off-in-court-again"
  },
  {
    "text": "Matt Gaetz attended 2017 party where minor and drugs were present, woman's sworn statement obtained by Congress claims  —  The Ethics panel is questioning witnesses about allegations involving Gaetz.  —  Rep. Matt Gaetz walks past reporters as he leaves a House GOP caucus meeting at the U.S Capitol … ",
    "url": "https://abcnews.go.com/US/matt-gaetz-attended-2017-party-minor-drugs-present/story?id=109324572"
  },
  {
    "text": "Tesla recalls the Cybertruck for faulty accelerator pedals that can get stuck  —  Tesla is recalling all 3,878 Cybertrucks that it has shipped to date, due to a problem where the accelerator pedal can get stuck, putting drivers at risk of a crash, according to the National Highway Traffic Safety Administration.",
    "url": "https://techcrunch.com/2024/04/19/tesla-cybertruck-throttle-accelerator-pedal-stuck/"
  },
  {
    "text": "Biden's Title IX rules are a victory for powerful teachers unions fueling Dem campaigns  —  Major teachers union said regulations will ensure transgender students can use whatever bathroom they want  —  The Biden administration's actions finalizing revised Title IX regulations represent … ",
    "url": "https://www.foxnews.com/politics/bidens-title-ix-rules-are-a-victory-for-powerful-teacher-unions-fueling-dem-campaigns"
  },
  {
    "text": "Trump campaign says it will deploy thousands of election workers to monitor poll sites  —  The program underscores Trump's fixation with election security, which he deployed in an effort to undermine results of the 2020 election.  —  Former President Donald Trump's political operation … ",
    "url": "https://www.politico.com/news/2024/04/19/trump-campaign-election-monitoring-00153217"
  },
  {
    "text": "EXCLUSIVE: West Virginia Girls ‘Step-Out’ Of Track & Field Meet To Protest Transgender Competitor  —  On Tuesday, a United States Circuit Court of Appeals ruled that a West Virginia law that bars biological boys from competing on girls' sports teams cannot be enforced with regard to a 13-year-old … ",
    "url": "https://www.outkick.com/sports/west-virginia-girls-protest-transgender-biological-male-track-field"
  },
  {
    "text": "Citadel Securities blasts Trump Media CEO Devin Nunes over short-selling letter … Devin Nunes, chief executive officer of Truth Social, speaks during the Conservative Political Action Conference (CPAC) in National Harbor, Maryland, US, on Thursday, March 2, 2023.",
    "url": "https://www.cnbc.com/2024/04/19/citadel-securities-blasts-trump-media-ceo-over-djt-short-sale-letter.html"
  }
]