[
  {
    "text": "Maine settles lawsuit against USDA over $3 million in school funds  —  The Department of Agriculture agreed it will not interfere with Maine school funding based on alleged Title IX violations without following the proper procedure, according to a settlement announced Friday.",
    "url": "https://www.pressherald.com/2025/05/02/maine-settles-case-over-frozen-usda-school-funds/"
  },
  {
    "text": "Trump administration settles with Maine over funding freeze after dispute over trans athletes  —  In response, the state will drop its lawsuit that had been filed against the U.S. Department of Agriculture.  —  / Source: The Associated Press  —  PORTLAND, Maine — President Donald Trump's administration … ",
    "url": "https://www.nbcnews.com/nbc-out/out-politics-and-policy/trump-administration-settles-maine-funding-freeze-dispute-trans-athlet-rcna204541"
  },
  {
    "text": "Public media executives push back against Trump targeting NPR and PBS: ‘Blatantly unlawful’  —  The president issued an executive order late Thursday trying to cut federal funding.  —  Public media executives are pushing back against President Donald Trump's late Thursday executive order seeking … ",
    "url": "https://www.politico.com/news/2025/05/02/npr-pbs-trump-executive-order-response-00323798"
  },
  {
    "text": "Former Weather Service Leaders Warn Staffing Cuts Could Lead to ‘Loss of Life’  —  The former agency directors say current employees will face an “impossible task” to maintain service just as hurricane season begins.  —  Five former National Weather Service directors have taken the unusual step … ",
    "url": "https://www.nytimes.com/2025/05/02/weather/nws-staffing-cuts-trump.html?unlocked_article_code=1.EU8.Wigu.FqDVTX60NFtd"
  },
  {
    "text": "Kennedy Orders Search for New Measles Treatments Instead of Urging Vaccination  —  Decades of research have turned up no miracle treatment for measles, but studies show the M.M.R. shot is 97 percent effective in preventing the disease.  —  With the United States facing its largest single measles outbreak … ",
    "url": "https://www.nytimes.com/2025/05/02/health/measles-treatments-vaccines-kennedy.html"
  },
  {
    "text": "Judge strikes down Trump executive order punishing prominent law firm  —  The judge said Trump's executive order sanctioning Perkins Coie was “motivated by retaliation” and is unconstitutional.  —  President Donald Trump's executive order that sought to punish the law firm Perkins Coie … ",
    "url": "https://www.politico.com/news/2025/05/02/trump-law-firms-executive-00324973"
  },
  {
    "text": "Trump administration reaches settlement with family of Ashli Babbitt, rioter killed on Jan. 6, 2021  —  The Trump administration has reached a settlement with the family of Ashli Babbitt, the Trump supporter who was shot and killed while in the mob breaching the House Speaker's Lobby on Jan. 6, 2021.",
    "url": "https://www.cbsnews.com/news/trump-administration-settlement-family-ashli-babbitt-rioter-killed-on-jan-6-2021/"
  },
  {
    "text": "A massive tariff on millions of Americans' purchases just went into effect — cue the chaos  —  New York CNN  —  Many Americans might not have felt major effects from President Donald Trump's sweeping tariffs — until now.  —  That's because a major shipping loophole expired at one minute past midnight on Friday.",
    "url": "https://cnn.com/2025/05/02/economy/de-minimis-packages-tariff"
  },
  {
    "text": "Scoop: Stephen Miller emerges as top contender for Trump's next national security adviser  —  President Trump's top policy adviser, Stephen Miller, is garnering buzz inside the White House as a top candidate to be the next national security adviser, five sources familiar with the situation say.",
    "url": "https://www.axios.com/2025/05/02/stephen-miller-national-security-adviser-candidate"
  },
  {
    "text": "Texas goes after toothpaste in escalating fight over fluoride … Texas Attorney General Ken Paxton is investigating two leading toothpaste makers over their use of fluoride, suggesting that they are “illegally marketing” the teeth cleaners to parents and kids “in ways that are misleading, deceptive, and dangerous.”",
    "url": "https://arstechnica.com/health/2025/05/texas-goes-after-toothpaste-in-escalating-fight-over-fluoride/"
  },
  {
    "text": "Trump plans major downsizing at U.S. spy agencies  —  The CIA plans to cut 1,200 positions, along with thousands more from other parts of the U.S. intelligence community.  —  The Trump administration is planning significant personnel cuts at the Central Intelligence Agency and other major U.S. spy units … ",
    "url": "https://www.washingtonpost.com/national-security/2025/05/02/cia-layoffs-trump-administration/"
  },
  {
    "text": "Trump administration asks Supreme Court to let DOGE access Social Security systems  —  The Trump administration asked the Supreme Court on Friday to clear the way for Elon Musk 's Department of Government Efficiency to access Social Security systems containing personal data on millions of Americans.",
    "url": "https://apnews.com/article/doge-social-security-trump-administration-supreme-court-a38db8e9908e56b01265432f4d46e8e3"
  },
  {
    "text": "Trump Allies Sue John Roberts To Give White House Control Of Court System  —  A think tank founded by Stephen Miller sued Roberts and the office that administers the judiciary, claiming that the White House should run the federal courts.  —  Close allies of President Trump are asking a judge … ",
    "url": "https://talkingpointsmemo.com/news/trump-allies-sue-john-roberts-to-give-white-house-control-of-court-system"
  },
  {
    "text": "United Airlines Cancels Newark Flights After FAA Staff Walks Out  —  The decision came after 20% of the FAA controllers at Newark walked off the job, CEO Scott Kirby said  —  United Airlines is cancelling 35 daily round trip flights from Newark, N.J., starting this weekend after a group of air-traffic controllers walked off the job.",
    "url": "https://www.wsj.com/business/airlines/united-airlines-cancels-newark-flights-after-faa-staff-walks-out-e794b071?st=zXLpdk&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Trump downplays recession fears, saying the U.S. would be ‘OK’ in the long term  —  Speaking to NBC News' “Meet the Press,” Trump said the U.S. is in a “transition period” but will “do fantastically” in the long run.  —  President Donald Trump on Friday downplayed concerns about potential economic trouble … ",
    "url": "https://www.nbcnews.com/politics/trump-administration/trump-downplays-recession-fears-saying-us-ok-long-term-rcna203511"
  },
  {
    "text": "All By Himself  —  John Fetterman insists he is in good health.  But staffers past and present say they no longer recognize the man they once knew.  —  When John Fetterman was released from Walter Reed hospital in March 2023, Adam Jentleson, then his chief of staff, was proud of his boss … ",
    "url": "https://nymag.com/intelligencer/article/john-fetterman-struggle-mental-health-clinical-depression.html"
  },
  {
    "text": "Trump Seeks to Eliminate the National Endowment for the Arts  —  The president's budget proposal also called for getting rid of the National Endowment for the Humanities and the Institute of Museum and Library Sciences.  —  President Trump proposed eliminating the National Endowment … ",
    "url": "https://www.nytimes.com/2025/05/02/arts/nea.html"
  },
  {
    "text": "Mike Waltz Has Somehow Gotten Even Worse at Using Signal  —  A photo taken this week showed Mike Waltz using an app that looks like—but is not—Signal to communicate with top officials.  “I don't even know where to start with this,” says one expert.  —  On ThursdaY, Reuters published … ",
    "url": "https://www.wired.com/story/mike-waltz-has-somehow-gotten-even-worse-at-using-signal/"
  },
  {
    "text": "White House wants Rubio in powerful dual role long-term  —  His dual role is seen as far more than a short-term solution.  —  Marco Rubio is expected to serve as both secretary of State and national security adviser for a minimum of six months, and a number of top advisers to President Donald Trump … ",
    "url": "https://www.politico.com/news/2025/05/02/marco-rubio-state-national-security-00324680"
  },
  {
    "text": "Trump's Space Budget Reflects Influence of Elon Musk and SpaceX  —  SpaceX, already one of the biggest NASA and Pentagon contractors, could win billions of dollars in new contracts if President Trump's budget proposal is approved by Congress.  —  Elon Musk and SpaceX are big winners in Donald J. Trump's 2026 spending plan.",
    "url": "https://www.nytimes.com/2025/05/02/us/politics/elon-musk-spacex-trump-budget.html?unlocked_article_code=1.EE8.Wi3e.H4OSNufcTZ12"
  },
  {
    "text": "Trump's First Judicial Pick Is... Someone Who Worked For His SCOTUS Picks  —  Progressive groups warned that Whitney Hermandorfer is proof that Trump wants judicial nominees willing to put personal loyalty over the law.  —  WASHINGTON — President Donald Trump has picked his first judicial nominee … ",
    "url": "https://www.huffpost.com/entry/trump-first-judicial-nominee-whitney-hermandorfer-scotus_n_6814de7ee4b08575d39c89e1"
  },
  {
    "text": "Federal Employees Are Now Less Likely to Work from Home Than Private Sector Workers  —  So far, we haven't seen much tangible impact from the Department of Government Efficiency (DOGE) in the hard economic data.  Their claimed savings haven't materialized in federal spending figures … ",
    "url": "https://mikekonczal.substack.com/p/federal-employees-are-now-less-likely"
  },
  {
    "text": "Rubio and German Foreign Ministry spar on X over comments accusing Germany of “tyranny in disguise”  —  A remarkable exchange played out on X on Friday as US Secretary of State Marco Rubio accused the government of key ally Germany of “tyranny in disguise” for designating the far-right Alternative for Germany … ",
    "url": "https://cnn.com/2025/05/02/politics/marco-rubio-germany-foreign-ministry-spat"
  },
  {
    "text": "I Never Lost Hope in the Principles of Democracy  —  On April 14, 2025, I was detained during what should have been my citizenship naturalization interview.  After more than two weeks of unjust imprisonment, a federal judge ruled in favor of releasing me.  In a major victory for democracy … ",
    "url": "https://www.nytimes.com/2025/05/02/opinion/mohsen-mahdawi-ice-detention.html?unlocked_article_code=1.EE8.aupQ.28zpWyh0uozq&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Comedian Russell Brand appears in court on rape and sex assault charges  —  British actor and comedian Russell Brand appeared in a London court on Friday to face charges of rape and multiple counts of sex assault in cases relating to four separate women more than two decades ago.",
    "url": "https://www.reuters.com/world/uk/comedian-russell-brand-due-uk-court-face-rape-sex-assault-charges-2025-05-01/"
  },
  {
    "text": "Trump repeats that the government will revoke Harvard's tax-exempt status  —  President Donald Trump says Harvard University will be stripped of its tax-exempt status, redoubling an extraordinary threat amid a broader chess match over free speech, political ideology and federal funding … ",
    "url": "https://cnn.com/2025/05/02/us/white-house-harvard-tax-status"
  },
  {
    "text": "In court, Trump team backs off its public deportation claims  —  Days after Trump undercut his administration on Kilmar Abrego García, the administration is downplaying other “vague statements.”  —  Amid all the controversy over the Trump administration's deportations … ",
    "url": "https://www.washingtonpost.com/politics/2025/05/02/trump-deportations-court-immigration-el-salvador/"
  },
  {
    "text": "Boys at My High School Love the Tate Brothers.  Here's Why.  —  In this confusing time for young men, we take our role models where we can find them.  —  “He's back!” someone exclaimed in a group chat at my private, all-boys Catholic high school in Chicago.",
    "url": "https://www.wsj.com/lifestyle/relationships/boys-at-my-high-school-love-the-tate-brothers-heres-why-6b1df184?st=3gH8kD"
  },
  {
    "text": "Border agents posted at Tucson maternity ward to quickly deport migrant mom  —  A Guatemalan woman who gave birth in Tucson on Wednesday — days after entering Arizona through the desert and getting arrested by border agents — is facing rapid deportation proceedings under Trump's … ",
    "url": "https://tucson.com/news/local/border/article_b024b264-ab3a-4ab9-b39b-cb2a2ff5e7a7.html"
  },
  {
    "text": "Ex-Pelosi Adviser Tees Off On Jeffries, Democrats  —  Ashley Etienne says Hakeem Jeffries is failing to tap a powerful resource in his predecessor — and it shows.  —  House Democratic Leader Hakeem Jeffries received mad props from the base this spring for his showdown with the GOP over Elon Musk and a potential government shutdown.",
    "url": "https://www.politico.com/news/magazine/2025/05/02/etienne-jeffries-pelosi-democrats-00322628"
  },
  {
    "text": "Environmental Protection Agency plans staff cuts in sweeping overhaul  —  The Environmental Protection Agency announced plans on May 2 to slash its budget by $300 million in fiscal year 2026, reduce staffing to 1980s levels and dissolve its research and development office as part of a sweeping overhaul of the agency.",
    "url": "https://www.usatoday.com/story/news/politics/2025/05/02/epa-cut-staff-research-office/83418393007/"
  },
  {
    "text": "Trump to host military parade to celebrate Army's 250th birthday, honor active-duty service members, veterans  —  The parade is set for June 14  —  EXCLUSIVE: President Donald Trump will host a military parade in June to honor military veterans and active-duty service members and commemorate … ",
    "url": "https://www.foxnews.com/politics/trump-host-military-parade-celebrate-armys-250th-birthday-honor-active-duty-service-members-veterans"
  },
  {
    "text": "Hard-liners' Medicaid letter has ties to GOP think tank  —  A letter signed by 20 hard-line House Republicans calling for deep cuts to Medicaid in the GOP's domestic policy megabill appears to be written at least in part by a conservative think tank with ties to top Republican leaders.",
    "url": "https://www.politico.com/live-updates/2025/05/02/congress/chip-roy-medicaid-letter-paragon-health-00324249"
  },
  {
    "text": "Josh Hawley's Medicaid Switcheroo  —  The Missouri Republican once campaigned against its expansion.  Now he opposes reform.  —  The political evolution by some Republicans in Congress on Medicaid is something to behold.  Take Missouri Sen. Josh Hawley, who once sought to repeal ObamaCare … ",
    "url": "https://www.wsj.com/opinion/josh-hawley-obamacare-medicaid-reform-congress-gop-budget-75b86e8f"
  },
  {
    "text": "After Trump dismisses hundreds of scientists working on climate report, two groups say they'll publish their work  —  After the Trump administration dismissed nearly 400 scientists who compile the nation's major quadrennial report on the impacts of climate change in the U.S. … ",
    "url": "https://www.cbsnews.com/news/trump-scientists-climate-assessment-two-groups-to-publish-their-work/"
  },
  {
    "text": "Two MSNBC Hosts on Motherhood and Covering Trump 2.0  —  Happy May!  Welcome back.  Don't hesitate to reach out with tips, questions, ideas, intrusive thoughts: [email protected] and [email protected].  This week, I had the pleasure of meeting two incredible journalists...",
    "url": "https://www.politico.com/newsletters/women-rule/2025/05/02/two-msnbc-hosts-on-motherhood-and-covering-trump-2-0-00323254"
  }
]