[
  {
    "text": "Federal judge rejects bids to halt Georgia prosecution of Trump aides over 2020 election  —  Fulton County District Attorney Fani Willis sharply rejected efforts by Mark Meadows and Jeffrey Clark to derail the criminal proceedings against them in her jurisdiction.",
    "url": "https://www.politico.com/news/2023/08/23/georgia-trump-racketeering-case-state-court-00112480"
  },
  {
    "text": "Federal Judge Refuses To Block Arrests Of Mark Meadows, Jeffrey Clark In Georgia Case  —  The former White House chief of staff and former Justice Department official separately argued to bar their arrests as they seek to move the case to federal court.  —  LOADING",
    "url": "https://www.huffpost.com/entry/jeffrey-clark-mark-meadows-requests-to-block-arrest-rejected_n_64e68f95e4b01168be1758d6"
  },
  {
    "text": "Mar-a-Lago IT worker was told he won't face charges in special counsel probe  —  Washington — The Mar-a-Lago IT employee who, according to a federal court filing, implicated former President Donald Trump and two of his aides in an alleged pressure campaign to delete security camera footage … ",
    "url": "https://www.cbsnews.com/news/mar-a-lago-it-worker-told-he-wont-face-charges-special-counsel-probe/"
  },
  {
    "text": "Free Lawyers!  But Big Strings Attached  —  If your boss is accused of criming, and investigators want to talk to you, here's a tip: Be wary if the company generously offers to pay for your lawyer.  —  Remember Cassidy Hutchinson, the former aide to former White House chief of staff Mark Meadows?",
    "url": "https://statuskuo.substack.com/p/free-lawyers-but-big-strings-attached"
  },
  {
    "text": "Wagner Group leader Yevgeny Prigozhin dies in plane crash in Russia  —  Prigozhin had led a rebellion against Russian authorities earlier this year.  —  Wagner Group leader Yevgeny Prigozhin was on the passenger list of a plane that crashed in Russia's Tver region on Wednesday … ",
    "url": "https://abcnews.go.com/International/wagner-group-leader-yevgeny-prigozhin-passenger-list-plane/story?id=102497445"
  },
  {
    "text": "Wagner boss Prigozhin killed in jet crash in Russia  —  Exactly two months after his failed coup, Wagner mercenary group founder Yevgeny Prigozhin died on Wednesday after his private jet crashed in flames on an internal flight within Russia, the country's aviation authority said.",
    "url": "https://www.politico.eu/article/jet-believed-to-be-carrying-wagner-boss-prigozhin-crashes-in-russia/"
  },
  {
    "text": "Giuliani Describes Jail Experience After Surrendering in Georgia Election Case  —  He stands 5' 11\" and tips the scales at 230 pounds, according to Fulton County booking records, which list his hair color as “gray or partially gray.  Former New York City mayor Rudy Giuliani said he didn't feel … ",
    "url": "https://www.thedailybeast.com/rudy-giuliani-finally-finds-a-lawyer-in-georgia-as-he-surrenders-to-jail"
  },
  {
    "text": "It may be time to break out the masks against Covid, some experts say  —  If you're at high risk of serious illness or death from Covid-19, it's time to dust off those N95 masks and place them snugly over your nose and mouth to protect yourself from a recent uptick of the virus, according to a growing number of experts.",
    "url": "https://www.cnn.com/2023/08/23/health/masks-covid-surge-wellness/"
  },
  {
    "text": "Emails reveal Secret Service contacts with Oath Keepers  —  Internal Secret Service emails obtained by CREW show special agents in close communication with Oath Keepers leader Stewart Rhodes, while failing to acknowledge the group's ties to white nationalists and clashes with law enforcement.",
    "url": "https://www.citizensforethics.org/reports-investigations/crew-investigations/emails-reveal-secret-service-contacts-with-oath-keepers/"
  },
  {
    "text": "Justice Department Announces Results of Nationwide COVID-19 Fraud Enforcement Action  —  For Immediate Release  —  Department Also Announces the Launch of Two New COVID-19 Fraud Strike Forces  —  The Justice Department announced today the results of a coordinated, nationwide enforcement action … ",
    "url": "https://www.justice.gov/opa/pr/justice-department-announces-results-nationwide-covid-19-fraud-enforcement-action"
  },
  {
    "text": "How Fox News Plans to Have Trump ‘Appear’ at Its GOP Debate  —  The network has found a way to ensure Trump is a part of their highly touted debate, even if he doesn't physically participate.  —  Donald Trump, the Republican 2024 frontrunner and quadruply indicted former president … ",
    "url": "https://www.thedailybeast.com/how-fox-news-plans-to-have-trump-appear-at-its-gop-debate"
  },
  {
    "text": "Fulton County defendant was earlier charged in Md. with attacking FBI agent  —  Harrison William Prescott Floyd is accused of assaulting an agent working on Justice Department's probe of efforts to obstruct 2020 election  —  A Trump supporter indicted last week in Fulton County, Ga. … ",
    "url": "https://www.washingtonpost.com/national-security/2023/08/23/willie-floyd-fulton-maryland-fbi-arrest/"
  },
  {
    "text": "Democrats and Republicans deeply divided on extreme weather, Post-UMD poll finds  —  Partisans remain split on climate change contributing to more disasters, and on their weather becoming more extreme  —  Nearly 150 million Americans were under heat alerts Tuesday, after July marked the planet's hottest month on record.",
    "url": "https://www.washingtonpost.com/climate-environment/2023/08/23/extreme-weather-climate-change-poll/"
  },
  {
    "text": "Anti-LGBTQ posts by suspect in Pride flag-related killing don't violate rules, X says  —  The shooter's apparent account was reported by a user on Tuesday, about 24 hours after the shooter was named by police.  —  Gunman identified in deadly dispute over LGBTQ Pride flag",
    "url": "https://www.nbcnews.com/nbc-out/out-news/pride-flag-suspect-twitter-rules-rcna101492"
  },
  {
    "text": "Fury at Michigan officials charged in 2020 false electors scheme: 'This isn't who we are'  —  State Republican lawmakers who allegedly signed on as Trump's false electors in 2020 face anger, prosecution and recall  —  The fight for democracy is supported by",
    "url": "https://www.theguardian.com/us-news/2023/aug/23/michigan-false-electors-trump-state-republicans"
  },
  {
    "text": "South Carolina Supreme Court Upholds Abortion Law, Reversing Earlier Decision  —  The ruling, by a newly all-male bench, allows the state's new six-week abortion ban to take effect.  —  The South Carolina Supreme Court on Wednesday upheld the state's new near-total ban on abortion by a 4-1 vote … ",
    "url": "https://www.nytimes.com/2023/08/23/us/south-carolina-abortion-supreme-court.html"
  },
  {
    "text": "Texas Takes Attacks on Austin to New Level With “Death Star” Law  —  This story was produced in partnership with the Garrison Project, an independent, nonpartisan organization addressing the crisis of mass incarceration and policing.  —  On Sept. 1, a bill with the pithy title … ",
    "url": "https://slate.com/news-and-politics/2023/08/greg-abbott-texas-attacks-austin-with-death-star.html"
  },
  {
    "text": "'We're Winning': Apple Formally Endorses Right to Repair Legislation After Spending Millions Fighting It  —  In a letter from its lobbyist, Apple ‘urges’ California lawmakers to pass the strongest right-to-repair law in the country.  —  Apple told a California legislator that it is formally supporting … ",
    "url": "https://www.404media.co/apple-endorses-california-right-to-repair-bill/"
  },
  {
    "text": "A Trump appointee argues in dissent that OSHA's workplace rules are unconstitutional  —  Judge Nalbandian wrote that “today” was the day to end OSHA.  The Sixth Circuit majority disagreed, but big-name legal conservatives want OSHA gone.  —  On Wednesday morning, the U.S. Court of Appeals … ",
    "url": "https://www.lawdork.com/p/nalbandian-osha-workplace-rules-dissent"
  },
  {
    "text": "How Oklahoma's schools superintendent became the state's top culture warrior  —  Ryan Walters, who called a teachers union a “terrorist organization” and pushed for prayer in public schools, offers a preview of what could be coming in other Republican-led states.",
    "url": "https://www.nbcnews.com/news/us-news/ryan-walters-oklahoma-schools-superintendent-tulsa-rcna101235"
  },
  {
    "text": "‘Dark Brandon’ Appears on Fox News' Homepage on Day of Republican Debates: 'I'm Bringing Roe Back' (Exclusive)  —  President Joe Biden's 2024 reelection campaign is sending Milwaukee — and Fox News readers — a pro-choice message from the president's satirical alter-ego",
    "url": "https://people.com/dark-brandon-fox-news-homepage-ads-gop-debate-exclusive-7734825"
  }
]