[
  {
    "text": "Trump, Biden and CNN Prepare for a Hostile Debate (With Muted Mics)  —  With Donald Trump's rampage at the first 2020 debate still fresh in the memories of both campaigns and the moderators, the candidates are preparing in sharply different ways.  —  President Biden and former President … ",
    "url": "https://www.nytimes.com/2024/06/15/us/politics/trump-biden-debate-rules.html"
  },
  {
    "text": "White House Rips ‘Desperate’ Murdoch Press Over Deceptive Biden Video  —  WANDER NO MORE  —  A deceptively edited video posted on X by The New York Post drew the attention of the White House senior deputy press secretary.  —  A member of the White House communications team went … ",
    "url": "https://www.thedailybeast.com/white-house-rips-desperate-murdoch-press-over-biden-italy-video"
  },
  {
    "text": "CEOs at Trump meeting: Ex-president ‘meandering’ and 'doesn't know what he's talking about' … WATCH NOW  —  WASHINGTON — Former President Donald Trump failed to impress everyone in a room full of top CEOs Thursday at the Business Roundtable's quarterly meeting, multiple attendees told CNBC.",
    "url": "https://www.cnbc.com/2024/06/14/ceos-at-trump-meeting-not-impressed.html"
  },
  {
    "text": "Supreme Court strikes down Trump-era ban on bump stocks for guns  —  In a concurring opinion, Samuel Alito said the ‘simple remedy’ to the gun issue is Congress amending the law that bans machine guns.  —  WASHINGTON - The Supreme Court ruled Friday that devices that turn a semi-automatic rifle … ",
    "url": "https://www.usatoday.com/story/news/politics/2024/06/14/supreme-court-trump-bump-stocks-guns-decision/72957521007/"
  },
  {
    "text": "Biden preparing to offer legal status to undocumented immigrants who have lived in U.S. for 10 years  —  The Biden administration is making plans to announce one of the largest immigration relief programs in recent history, developing a policy that would offer legal status to hundreds … ",
    "url": "https://www.cbsnews.com/news/biden-plan-undocumented-immigrants-legal-status-10-years-in-u-s-married/"
  },
  {
    "text": "Do members of Congress need a pay raise?  After 15 years, some say yes.  —  Lawmakers have doled out significant raises to staffers and other public employees but they haven't dared to give themselves raises, even to adjust for inflation.  —  Year in and year out, Congress finds … ",
    "url": "https://www.washingtonpost.com/politics/2024/06/15/congress-pay-raises/"
  },
  {
    "text": "Alex Jones' personal assets will be sold to help pay Sandy Hook debt as judge decides Infowars' fate  —  A federal judge on Friday ordered the liquidation of conspiracy theorist Alex Jones ′ personal assets but was still deciding on his company's separate bankruptcy case … ",
    "url": "https://apnews.com/article/alex-jones-sandy-hook-lawsuit-3ccd113496caee18a085dfa54c6e6c0e"
  },
  {
    "text": "How 2024 pollsters are trying to avoid their 2020 mistakes … - It's “pretty apparent” that polling has some “entrenched problems,” Benjamin Toff, a University of Minnesota professor who researches public trust in polls and news coverage. … Many polls also sampled too many college graduates … ",
    "url": "https://www.axios.com/2024/06/15/2024-election-polls-trump-biden"
  },
  {
    "text": "Democrats divided over Supreme Court controversies as decisions loom  —  Liberals say a string of revelations about Supreme Court Justice Samuel A. Alito Jr. raise questions about his ability to rule impartially on Jan. 6-related cases.  —  Liberals have been united in their anger … ",
    "url": "https://www.washingtonpost.com/politics/2024/06/15/supreme-court-alito-thomas-democrats/"
  },
  {
    "text": "Stanford's top disinformation research group collapses under pressure  —  The Stanford Internet Observatory provided real-time analysis on viral election falsehoods but has struggled amid attacks from conservative politicians and activists.  —  The Stanford Internet Observatory … ",
    "url": "https://www.washingtonpost.com/technology/2024/06/14/stanford-internet-observatory-disinformation-research-lawsuits-politics/"
  },
  {
    "text": "Speaker Johnson says House will go to court for Biden audio after Justice Dept. refused to prosecute  —  Speaker Mike Johnson said Friday that the House will go to court to enforce the subpoena against Attorney General Merrick Garland for access to President Joe Biden's special counsel audio interview … ",
    "url": "https://apnews.com/article/justice-department-contempt-biden-classified-documents-8f38c7178fb0c996442781243f65ab97"
  },
  {
    "text": "The Chilling Reason You May Never See the New Trump Movie  —  This week I finally got to see “The Apprentice,” an absorbing, disturbing movie about the relationship between the red-baiting mob lawyer Roy Cohn and a young Donald Trump.  The film, which was received with an extended standing ovation … ",
    "url": "https://www.nytimes.com/2024/06/14/opinion/the-apprentice-trump-movie.html"
  },
  {
    "text": "Johnson faces bipartisan uproar over House Intel picks … - Some are also concerned about the highly sensitive information to which committee members are often exposed. … - Both picks were bound to be inflammatory: Perry's phone was seized by the FBI as part of its Jan. 6 probe … ",
    "url": "https://www.axios.com/2024/06/15/house-intelligence-committee-johnson-perry-jackson"
  },
  {
    "text": "Jan. 6, America's Rupture and the Strange, Forgotten Power of Oblivion  —  On March 4, Judge Tanya Chutkan presided over jury selection for a criminal trial in a Jan. 6, 2021, case.  That date had long been scheduled, though there was a different defendant seated before her than had been planned … ",
    "url": "https://www.nytimes.com/2024/06/15/opinion/jan-6-memory-memorial-forgetting.html"
  },
  {
    "text": "If Everyone Voted, Would Biden Benefit?  Not Anymore.  —  Inside the unusual dynamic shaping the 2024 campaign.  —  In a reversal of one of the most familiar patterns in American politics, it appears that Donald J. Trump, not President Biden, would stand to gain if everyone in the country turned out and voted.",
    "url": "https://www.nytimes.com/2024/06/15/upshot/election-democrats-republicans-turnout-trump.html"
  },
  {
    "text": "Biden goes straight from G7 to Hollywood fundraiser, balancing geopolitics with his reelection bid  —  Flying through the night across nine time zones, from southern Italy to Southern California, President Joe Biden will shift focus from Russia's challenge of Western unity to raking in big bucks … ",
    "url": "https://apnews.com/article/biden-hollywood-fundraiser-clooney-roberts-ukraine-summit-40081471c93faa68de5c4aa30455303b"
  }
]