[
  {
    "text": "Judge fines Donald Trump $5,000 after post maligning court staffer is found on campaign website  —  Former President Donald Trump was fined $5,000 on Friday after a disparaging social media post about a key court staffer in his New York civil fraud case was allowed to linger on his campaign website after the judge ordered it deleted.",
    "url": "https://apnews.com/article/donald-trump-letitia-james-fraud-contempt-new-york-ce593e3ee07d95bb6ec7e2de23f47dc9"
  },
  {
    "text": "Judge Chutkan temporarily freezes Trump gag order in 2020 election subversion case  —  US District Judge Tanya Chutkan on Friday temporarily froze the gag order she issued on Donald Trump in the former president's federal 2020 election subversion criminal case.",
    "url": "https://www.cnn.com/2023/10/20/politics/trump-gag-order-tanya-chutkan-election-subversion-case/"
  },
  {
    "text": "Judge Fines Trump, Threatens Prison Time for ‘Blatantly’ Violating Gag Order  —  Trump's New York AG case isn't supposed to be a criminal case, but it may result in Trump getting thrown in jail anyway.  —  The judge overseeing Donald Trump's bank fraud trial threatened to throw the former president in jail … ",
    "url": "https://www.thedailybeast.com/judge-threatens-imprisoning-trump-for-blatantly-violating-gag-order"
  },
  {
    "text": "Live updates Jim Jordan fails to become House speaker on third ballot  —  Rep. Jim Jordan (R-Ohio) failed Friday on a third ballot to be elected House speaker after backing off a plan to empower a temporary speaker.  Jordan, a conservative firebrand and ally of former president Donald Trump … ",
    "url": "https://www.washingtonpost.com/politics/2023/10/20/house-speaker-vote-live/"
  },
  {
    "text": "Kenneth Chesebro: Pro-Trump lawyer pleads guilty in Georgia election subversion case, implicates Trump in fake elector conspiracy  —  Kenneth Chesebro, an attorney who helped orchestrate the Trump campaign's 2020 fake electors plot, pleaded guilty Friday in the Georgia election subversion case … ",
    "url": "https://www.cnn.com/2023/10/20/politics/kenneth-chesebro-georgia-election-subversion/"
  },
  {
    "text": "Supreme Court says White House can continue requests to tech companies  —  The Supreme Court on Friday temporarily allowed the Biden administration to continue its efforts to get social media companies to remove posts from their platforms that the government says are misleading.",
    "url": "https://www.washingtonpost.com/politics/2023/10/20/supreme-court-tech-companies-social-media-posts/"
  },
  {
    "text": "Supreme Court blocks restrictions on Biden administration efforts to remove contentious social media posts  —  The Biden administration had called a lower court injunction “unprecedented” for restricting officials' ability to raise concerns about problematic social media content on issues like Covid-19.",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-blocks-biden-social-media-curbs-rcna105785"
  },
  {
    "text": "Comer Releases Evidence of Direct Payment to Joe Biden  —  WASHINGTON—House Committee on Oversight and Accountability Chairman James Comer (R-Ky.) today announced the committee obtained bank records revealing a $200,000 direct payment from James and Sara Biden to Joe Biden in the form of a personal check.",
    "url": "https://oversight.house.gov/release/comer-releases-evidence-of-direct-payment-to-joe-biden/"
  },
  {
    "text": "Jack Smith uses Brett Kavanaugh law review article and Trump's own impeachment arguments to slap down Jan. 6 ‘presidential immunity’ claims  —  In a double serving of what could arguably be described as doses of one's own medicine, special counsel Jack Smith plucked apart Donald Trump's latest efforts … ",
    "url": "https://lawandcrime.com/trump/jack-smith-uses-brett-kavanaugh-law-review-article-and-trumps-own-impeachment-arguments-to-slap-down-jan-6-presidential-immunity-claims/"
  },
  {
    "text": "Trump's Bitter Standoff with Fox News Is Only Getting Worse  —  Fox News appears to have adopted a policy of no live interviews for Donald Trump.  That's bad news for the presidential candidate. … In both of his last presidential runs, Fox News was essential to Donald Trump's success.",
    "url": "https://www.thedailybeast.com/trumps-bitter-standoff-with-fox-news-is-only-getting-worse"
  },
  {
    "text": "Mastodon Is the Good One  —  Join the newsletter to get the latest updates.  —  Success  —  Great!  Check your inbox and click the link.  —  Error  —  Please enter a valid email address.  —  Earlier this week, friend of 404 Media Katie Notopoulos, who is a great journalist and internet knower … ",
    "url": "https://www.404media.co/mastodon-is-the-good-one/"
  },
  {
    "text": "Biden Says Hamas Attack Was to Halt Israel-Saudi Arabia Thaw  — US was working to normalize Israel, Saudi Arabia relations  — Oct. 7 attack killed more than 1,400 people, 200 taken hostage  —  US President Joe Biden said Hamas attacked Israel in part to stymie its efforts … ",
    "url": "https://www.bloomberg.com/news/articles/2023-10-20/biden-says-hamas-attacked-to-halt-israel-saudi-normalization"
  },
  {
    "text": "'It's astonishing': GOP ditches Jordan as speaker pick  —  It was an unexpectedly fast end to the Ohio conservative's candidacy to lead the chaos-ridden House GOP.",
    "url": "https://www.politico.com/live-updates/2023/10/20/congress/jordan-loses-00122781"
  },
  {
    "text": "Trump World Vows to Tank a Speaker Bid From House Majority Whip Tom Emmer (Exclusive)  —  'An Emmer speakership is something that won't go over well in our circles,' one source close to Trump told The Messenger … House Majority Whip Tom Emmer, R-Minn., is angling to be the next House speaker … ",
    "url": "https://themessenger.com/politics/trump-world-vows-to-tank-a-speaker-bid-from-house-majority-whip-tom-emmer-exclusive"
  },
  {
    "text": "The Real Reason Hamas Just Released Two American Hostages  —  According to Israeli officials, Iranian-backed terrorist organization Hamas released two American hostages Friday afternoon for “humanitarian” purposes after kidnapping and holding them in the Gaza Strip for nearly two weeks.",
    "url": "https://townhall.com/tipsheet/katiepavlich/2023/10/20/dont-be-fooled-by-the-reason-hamas-just-released-two-hostages-n2630157"
  },
  {
    "text": "CDC says skin-disfiguring parasite may be endemic in Texas, present in other states  —  The CDC identified dozens of Leishmania cases — all without a history of travel outside the U.S. — over a 14-year period.  —  A parasite capable of causing a disfiguring skin disease may be endemic … ",
    "url": "https://www.nbcnews.com/health/health-news/cdc-says-skin-disfiguring-parasite-may-endemic-texas-present-states-rcna121450"
  },
  {
    "text": "US intelligence report alleging Russia election interference shared with 100 countries  —  The United States on Friday released a U.S. intelligence assessment sent to more than 100 countries that found Moscow is using spies, social media and Russian state-run media to erode public faith … ",
    "url": "https://www.reuters.com/world/us/us-intelligence-report-alleging-russia-election-interference-shared-with-100-2023-10-20/"
  },
  {
    "text": "Chief prosecutor of Jan. 6 rioters describes ‘pervasive’ threats to his office  —  Matthew Graves, the U.S. attorney for the District of Columbia, described the threats in a closed-door interview with the House Judiciary Committee.  —  The federal prosecutors who have brought charges … ",
    "url": "https://www.politico.com/news/2023/10/20/jan-6-prosecutor-pervasive-threats-00122733"
  },
  {
    "text": "U.S. watchdog: Verified X accounts are main source of misinformation about Israel-Hamas war  —  NewsGuard takes issue with the platform's Blue-Checked account verification process  —  Verified accounts on the social media platform X are responsible for spreading the bulk of misinformation … ",
    "url": "https://www.upi.com/Top_News/US/2023/10/20/NewsGuard-report-X-verified-accounts-spread-misinformation-Israel-Hamas-war/2601697796230/"
  }
]