[
  {
    "text": "Two Elections: “The rules were that you guys weren't going to fact-check”  —  I want to elaborate on something I said on Nicole Sandler's show on Friday.  There were really two elections last Tuesday.  —  In one, politics worked.  —  In the other, propaganda worked far better.",
    "url": "https://www.emptywheel.net/2024/11/10/two-elections-the-rules-were-that-you-guys-werent-going-to-fact-check/"
  },
  {
    "text": "Musk calls Thune “top choice of Democrats” for GOP leader … - President-elect Trump frequently battled GOP Leader Mitch McConnell (R-Ky.) during his first term and could decide to put his thumb on the scale to get someone sure to do his bidding this time around.",
    "url": "https://www.axios.com/2024/11/10/musk-calls-thune-top-choice-of-democrats-for-gop-leader"
  },
  {
    "text": "Trump presses next GOP Senate leader to allow ‘recess appointments’  —  It comes as Rick Scott has racked up support from prominent conservative backers, including Elon Musk.  —  President-elect Donald Trump on Sunday said Senate Republicans' next leader must embrace so-called “recess appointments … ",
    "url": "https://www.politico.com/news/2024/11/10/trump-presses-next-republican-senate-leader-recess-appointments-00188640"
  },
  {
    "text": "Trump talked to Putin, told Russian leader not to escalate in Ukraine  —  President-elect Donald Trump spoke with Russian President Vladimir Putin on Thursday and discussed the war in Ukraine, according to people familiar with the call.  —  President-elect Donald Trump spoke … ",
    "url": "https://www.washingtonpost.com/national-security/2024/11/10/trump-putin-phone-call-ukraine/"
  },
  {
    "text": "2024's other big loser?  The mainstream media.  Is there any path forward?  —  The American mainstream media, and its vital watchdog role that once made it a trusted, major institution in a flawed yet functioning democracy, imploded in 2024, and it happened in two ways … ",
    "url": "https://www.inquirer.com/opinion/commentary/trust-mainstream-media-2024-election-20241110.html?id=bpjtJ3uwA0BYL"
  },
  {
    "text": "House Fast Tracks Bill That Would Give Trump Power to Target Nonprofits  —  The legislation would let the Treasury Department revoke tax-exempt status for any “terrorist supporting organization”  —  Donald Trump hasn't even taken office, and Congress is already moving to advance legislation to expand his ability to target his enemies.",
    "url": "https://www.rollingstone.com/politics/politics-news/house-bill-trump-power-target-nonprofits-1235161151/"
  },
  {
    "text": "The Democrats Need an Honest Conversation on Gender Identity  —  One of the mysteries of this election is how the Democrats approached polling day with a set of policies on gender identity that they were neither proud to champion—nor prepared to disown.  —  Although most Americans agree … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/11/democrats-dishonest-gender-conversation-2024-election/680604/"
  },
  {
    "text": "Many in government are worried about Trump's return.  At DOJ, they're terrified.  —  Trump blames DOJ for much of his torment over the past four years.  Lawyers there fear what's next.  —  A collective sense of dread has taken hold at the Department of Justice, which drew Donald Trump's rage … ",
    "url": "https://www.politico.com/news/2024/11/10/trump-return-justice-department-00188623"
  },
  {
    "text": "The Dream of the Raised Arm  —  Born in 1907 in Forst, Germany, a town near the Polish border, Charlotte Beradt was a young journalist who reported on women's issues and other aspects of German social and political life for the weekly journal Die Weltbühne.",
    "url": "https://www.nybooks.com/articles/2024/12/05/the-dream-of-the-raised-arm-third-reich-of-dreams-beradt-zadie-smith/"
  },
  {
    "text": "Democrats' $1.9 trillion bet that blew up  —  Nearly four years ago, the Biden administration and Congressional Democrats made a $1.9 trillion bet in the form of the American Rescue Plan.  They lost, as it contributed to a surge in inflation that fueled massive voter discontent and Donald Trump's return to the White House.",
    "url": "https://www.axios.com/2024/11/10/trump-policy-stimulus-inflation"
  },
  {
    "text": "Bernie vs. Nancy: Dems' working-class reckoning … - “While the Democratic leadership defends the status quo, the American people are angry and want change. … - “Will the big money interests and well-paid consultants who control the Democratic Party learn any real lessons from this disastrous campaign?”",
    "url": "https://www.axios.com/2024/11/10/democrats-working-class-voters-trump"
  },
  {
    "text": "Trump on Day 1: Begin deportation push, pardon Jan. 6 rioters and make his criminal cases vanish  —  Donald Trump has said he wouldn't be a dictator — “except for Day 1.”  According to his own statements, he's got a lot to do on that first day in the White House.",
    "url": "https://apnews.com/article/trump-day-1-priorities-deportations-drilling-ukraine-6747c6e64b0440978f59450b928f61d1"
  },
  {
    "text": "Schumer withholds Senate orientation invite from McCormick  —  Democrats are holding out hope that Sen. Bob Casey can pick up enough votes to hold on to the Pennsylvania Senate seat.  —  Senate Majority Leader Chuck Schumer will not allow Sen.-elect Dave McCormick (R-Pa.) … ",
    "url": "https://www.politico.com/news/2024/11/10/schumer-casey-mccormick-senate-orientation-00188644"
  },
  {
    "text": "Jockeying kicks off to fill Vance vacancy in Senate  —  Ohio Gov. Mike DeWine (R) is facing a key decision on whom to tap to fill the term of Vice President-elect Vance as jockeying among Ohio Republicans for the coveted appointment is set to become a knife fight.",
    "url": "https://thehill.com/homenews/senate/4981631-senate-vacancy-vance-ohio-dewine/"
  },
  {
    "text": "Justice Sonia Sotomayor Is Expected to Remain on Supreme Court  —  Some liberal activists have called for the 70-year-old Obama appointee to retire before Trump can fill her seat  —  WASHINGTON—Despite calls from some liberal activists for Justice Sonia Sotomayor to step down while Democrats … ",
    "url": "https://www.wsj.com/us-news/law/justice-sonia-sotomayor-is-expected-to-remain-on-supreme-court-2aaf62e0?st=gYLFiY"
  },
  {
    "text": "Dearborn's Arab Americans feel vindicated by Harris' loss  —  Dearborn residents swung toward Trump.  It was a protest vote against Harris and Biden.  —  DEARBORN, Michigan — Arab American leaders for months warned Vice President Kamala Harris that she needed to separate herself … ",
    "url": "https://www.politico.com/news/2024/11/10/dearborn-vote-kamala-harris-trump-00188618"
  },
  {
    "text": "For legal disputes, Elon Musk's X picked a venue far from Texas HQ  —  By changing his company's terms of service, Elon Musk has ensured that lawsuits against X will be heard in courthouses that are a hub for conservative judges.  —  Tech billionaire Elon Musk has chosen a sprawling federal court district … ",
    "url": "https://www.washingtonpost.com/national-security/2024/11/10/twitter-x-elon-musk-lawsuits/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzMxMjE0ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzMyNTk3MTk5LCJpYXQiOjE3MzEyMTQ4MDAsImp0aSI6IjBiYTdiZTE5LTUzODMtNGY4Mi1hN2MzLWUyNGRjMDhkYTEwMiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb25hbC1zZWN1cml0eS8yMDI0LzExLzEwL3R3aXR0ZXIteC1lbG9uLW11c2stbGF3c3VpdHMvIn0.zx5rx1KKR5Dke9AJFpMIpKSqn_8X8vXeeLtS7yhpnmo&itid=gfta"
  },
  {
    "text": "Trump Is Expected to Upend Biden Labor Policies Favoring Unions  —  After gains by organized labor under President Biden, a second Trump administration is likely to change course on regulation and enforcement.  —  Joseph R. Biden Jr. promised to be the most pro-labor president in history.",
    "url": "https://www.nytimes.com/2024/11/10/business/economy/trump-biden-labor-unions.html?unlocked_article_code=1.Y04.0nsf.Pfn8UrowauNH"
  }
]