[
  {
    "text": "Penn loses $100 million donation over antisemitism hearing  —  A wealthy donor to the University of Pennsylvania is withdrawing a gift worth around $100 million in protest of the school's response to antisemitism on campus.  —  The big picture: The final straw for Ross Stevens … ",
    "url": "https://www.axios.com/2023/12/07/upenn-antisemitism-magill-100-million-donation"
  },
  {
    "text": "UPenn board chair expected to speak with president Liz Magill about stepping down  —  New York CNN  —  The University of Pennsylvania's board of trustees held an emergency meeting Thursday as school president Liz Magill faces scathing criticism over her performance at a House hearing earlier this week.",
    "url": "https://www.cnn.com/2023/12/07/business/penn-emergency-meeting-liz-magill/"
  },
  {
    "text": "What Jack Smith Says  —  Jack Smith has filed his 404(b) notice, advising the Court and Trump of other crimes and bad acts committed by Trump that he intends to offer as evidence when the D.C. election interference case goes to trial.  The notice is nine pages long, you can read the whole thing here.",
    "url": "https://joycevance.substack.com/p/what-jack-smith-says"
  },
  {
    "text": "First on CNN: Federal prosecutors file new criminal case against Hunter Biden  —  Federal prosecutors have filed a new criminal case against Hunter Biden, people briefed on the matter said.  —  The exact nature of the charges couldn't immediately be learned because court documents have not been made public.",
    "url": "https://www.cnn.com/2023/12/07/politics/hunter-biden-criminal-case/"
  },
  {
    "text": "Hunter Biden indicted on 9 new charges in California related to allegedly failing to pay taxes  —  Hunter Biden pleaded not guilty in October to federal gun charges in US District Court for the District of Delaware  —  President Biden's son Hunter Biden was indicted in California Thursday … ",
    "url": "https://www.foxnews.com/politics/hunter-biden-faces-new-indictment-california"
  },
  {
    "text": "Sen. Kevin Cramer's son charged with manslaughter  —  Sen. Kevin Cramer's (R-N.D.) son was charged with manslaughter on Thursday after he killed a North Dakota sheriff's deputy in a car wreck Wednesday evening, according to local police.  —  Police said Ian Cramer, 42 … ",
    "url": "https://thehill.com/regulation/court-battles/4348521-kevin-cramer-son-manslaughter/"
  },
  {
    "text": "North Dakota senator's son charged with manslaughter after officer killed in police chase  —  Sen. Kevin Cramer's son, Ian Cramer, was charged in connection with a police chase on Wednesday that led to the death of a sheriff's deputy in Mercer County, North Dakota.",
    "url": "https://www.nbcnews.com/politics/politics-news/north-dakota-senators-son-charged-manslaughter-police-chase-killed-off-rcna128653"
  },
  {
    "text": "N.Y. appeals court upholds Judge Engoron's ruling that Trump committed ‘widespread fraud’  —  Former President Donald Trump was dealt a major blow by the New York Court of Appeals on Thursday in the midst of his ongoing civil fraud trial in the Empire State.",
    "url": "https://www.rawstory.com/trump-organization-fraud-2666475449/"
  },
  {
    "text": "Alan Hostetter, ex-police chief who brought hatchet to Capitol on Jan. 6, sentenced to 11 years in prison  —  A former California police chief who brought a hatchet to the Capitol on Jan. 6, 2021, has been sentenced to more than 11 years in prison for his role in the siege.",
    "url": "https://www.cbsnews.com/news/alan-hostetter-sentenced-january-6-capitol-attack-11-years/"
  },
  {
    "text": "Albany Police: Man fired gun outside Temple Israel, told officers ‘Free Palestine’  —  One person investigated for shooting at Temple Israel  —  One person investigated for shooting at Temple Israel  —  A 28-year-old man is accused of firing shots on the grounds of Temple Israel and yelling “Free Palestine” before he was arrested.",
    "url": "https://wnyt.com/top-stories/albany-police-man-fired-shotgun-outside-temple-israel/"
  },
  {
    "text": "Killing of Reuters Journalist Was ‘Apparently Deliberate’ Israeli Strike, Group Says  —  Human Rights Watch found that the slain journalist and six colleagues were not near active fighting in southern Lebanon and would have been clearly visible to Israeli forces.",
    "url": "https://www.nytimes.com/2023/12/07/world/middleeast/reuters-journalist-killed-lebanon-israel-hrw.html"
  },
  {
    "text": "Why Fundamentalists Love Trump  —  I just finished reading Tim Alberta's masterly new book, “The Kingdom, the Power, and the Glory: American Evangelicals in an Age of Extremism.”  It's a powerful and emotionally resonant account of the transformation in evangelical politics that has brought us … ",
    "url": "https://www.nytimes.com/2023/12/07/opinion/donald-trump-fundamentalists-evangelical.html"
  },
  {
    "text": "House Freedom Caucus Losing Faith in Speaker Johnson After His ‘Ass Whooping’  —  ‘Right now, it looks pretty bleak,’ Johnson critic Rep. Eric Burlison told The Messenger  —  Speaker Mike Johnson signing off on a defense bill that was scrubbed of hardliners' top ideological priorities … ",
    "url": "https://themessenger.com/politics/house-freedom-caucus-losing-faith-in-speaker-johnson-after-his-ass-whooping"
  },
  {
    "text": "Behind the Curtain — Exclusive: How Trump would build his loyalty-first Cabinet  —  Former President Trump, if elected, would build a Cabinet and White House staff based mainly on two imperatives: pre-vetted loyalty to him and a commitment to stretch legal and governance boundaries … ",
    "url": "https://www.axios.com/2023/12/07/trump-loyalty-cabinet-2025-carlson-miller-bannon"
  },
  {
    "text": "MAGA rioter punched woman ‘in the throat’ after his sexual advances were denied: Feds  —  Federal prosecutors are arguing that a North Carolina man charged in connection with the January 6 Capitol attack should await trial in jail because he allegedly instigated a bar fight after a woman rejected him … ",
    "url": "https://www.rawstory.com/maga-rioter-punched-woman-in-the-throat-after-his-advances-were-denied-feds/"
  },
  {
    "text": "Kevin McCarthy uses PAC to lavish cash on high-end resorts, private jets and fine dining  —  Rambling above the rust-colored cliffs of the Palos Verdes Peninsula, the Terranea Resort is known for its ocean views, world-ranked spa and villas that can command $3,000 a night or more.",
    "url": "https://www.latimes.com/california/story/2023-12-07/spending-by-kevin-mccarthys-leadership-pac"
  },
  {
    "text": "WATCH: Hamas Terrorists Surrender en Masse, and the Photos and Videos Are Telling  —  Hamas terrorists have started to surrender en masse in the area of Khan Younis, one of the terrorist government's last strongholds.  The latest advance has the IDF operating in Southern Gaza … ",
    "url": "https://redstate.com/bonchie/2023/12/07/watch-hamas-terrorists-surrender-in-mass-and-the-images-are-telling-n2167279"
  },
  {
    "text": "The White House is threatening the patents of high-priced drugs developed with taxpayer dollars  —  The Biden administration is putting pharmaceutical companies on notice, warning them that if the price of certain drugs is too high, the government might cancel their patent protection and allow rivals to make their own versions.",
    "url": "https://apnews.com/article/biden-drug-prices-patents-2024-campaign-f92da4ee89814d3ab89a909399bf4c85"
  },
  {
    "text": "Las Vegas shooting suspect was a professor who recently applied for a job at UNLV, AP source says  —  Three people were fatally shot and a fourth person was critically wounded in an attack on the University of Nevada, Las Vegas campus, police said.  The suspected shooter also was found dead.",
    "url": "https://apnews.com/article/campus-shooting-las-vegas-unlv-55ca455e2d00f1126cc1dbf4cc29139e"
  },
  {
    "text": "Texas progressive group previously bailed out suspect charged in deadly Austin, San Antonio shooting rampage  —  Shane James, 34, previously served as a U.S. Army infantry officer before he was discharged in August 2015, the Army said  —  A suspect accused of six murders across Texas during … ",
    "url": "https://www.foxnews.com/politics/texas-progressive-group-previously-bailed-suspect-charged-deadly-austin-san-antonio-shooting-rampage?intcmp=tw_fnc"
  },
  {
    "text": "Fetterman defends ‘reasonable’ border talks as fellow Dems fume  —  The Pennsylvania progressive's comments follow his staunch support for Israel's war in Gaza, which has also befuddled some of his typical allies on the left.",
    "url": "https://www.politico.com/live-updates/2023/12/07/congress/fetterman-on-border-00130639"
  },
  {
    "text": "White Supremacists Are Celebrating Vivek Ramaswamy's ‘Great Replacement’ Rant  —  Presidential candidate Vivek Ramaswamy boosted multiple far-right conspiracy theories during the GOP debate on Wednesday night, in a dangerous mainstreaming of once-fringe claims.",
    "url": "https://www.wired.com/story/vivek-ramaswamy-debate-great-replacement-theory-conspiracy/"
  },
  {
    "text": "Manning Won't File for Re-Election Under Egregiously Gerrymandered Maps  —  Greensboro, N.C. - Congresswoman Kathy Manning (NC-06) announced today that she will not file for re-election under the egregiously gerrymandered congressional districts, which the Republican-led North Carolina General Assembly passed … ",
    "url": "https://manning.house.gov/media/press-releases/manning-wont-file-re-election-under-egregiously-gerrymandered-maps"
  },
  {
    "text": "RNC Fourth Presidential Primary Debate 12/06/23 Transcript  —  RNC Fourth Presidential Primary Debate 12/06/23.  Read the transcript here.  —  Transcribe Your Own Content  —  Welcome to the fourth and final Republican Presidential Primary Debate of the Year live from the University of Alabama.",
    "url": "https://www.rev.com/blog/transcripts/rnc-fourth-presidential-primary-debate-12-06-23-transcript"
  }
]