[
  {
    "text": "Ukraine Aid Bill Clears Critical Hurdle in the House as Democrats Supply the Votes  —  Democrats stepped in to support bringing the aid package to the floor, in a remarkable breach of custom on a key vote that paved the way for its passage.  —  The House took a critical step on Friday toward approving … ",
    "url": "https://www.nytimes.com/2024/04/19/us/politics/congress-vote-ukraine-bill-house.html"
  },
  {
    "text": "Third Republican joins motion to remove Mike Johnson … - Gosar cited the passage of the foreign aid bill, which includes aid to Ukraine that right-wing hardliners staunchly oppose, as well as Republicans' recent difficulty in passing border legislation.  — “We need a Speaker who puts America … ",
    "url": "https://www.axios.com/2024/04/19/gosar-joins-motion-to-vacate-mike-johnson"
  },
  {
    "text": "'You Can't Govern By Shooting Yourself in the Head Every Day'  —  “You can't govern by shooting yourself in the head every day.”  —  As Speaker of the House Mike Johnson fends off another conservative rebellion over his four-part foreign aid plan, he's garnering support from former speaker … ",
    "url": "https://www.politico.com/news/magazine/2024/04/19/newt-gingrich-mike-johnson-speakership-qa-00153117"
  },
  {
    "text": "Man Sets Himself on Fire Near Courthouse Where Trump Is on Trial  —  Onlookers screamed as fire engulfed the man, who had thrown pamphlets in the air before he set himself aflame.  A police officer tried to extinguish the flames before the man was taken away in an ambulance.",
    "url": "https://www.nytimes.com/2024/04/19/nyregion/man-on-fire-trump.html"
  },
  {
    "text": "Man Sets Himself on Fire Outside Court Amid Trump Trial  —  A man set himself on fire on Friday outside the New York courthouse where Donald Trump's historic hush-money trial was taking place, witnesses said.  —  A witness on the scene said he first heard the man throwing pamphlets into the air … ",
    "url": "https://freebeacon.com/issues/man-sets-himself-on-fire-outside-court-amid-trump-trial/"
  },
  {
    "text": "Emergency rooms refused to treat pregnant women, leaving one to miscarry in a lobby restroom  —  One woman miscarried in the lobby restroom of a Texas emergency room as front desk staff refused to admit her.  Another woman learned that her fetus had no heartbeat at a Florida hospital … ",
    "url": "https://apnews.com/article/pregnancy-emergency-care-abortion-supreme-court-roe-9ce6c87c8fc653c840654de1ae5f7a1c"
  },
  {
    "text": "Israeli missiles hit site in Iran, ABC News reports  —  Explosions echoed over an Iranian city on Friday in what sources described as an Israeli attack, but Tehran played down the incident and indicated it had no plans for retaliation - a response that appeared gauged towards averting region-wide war.",
    "url": "https://www.reuters.com/world/middle-east/israeli-missiles-hit-site-iran-abc-news-reports-2024-04-19/"
  },
  {
    "text": "Columbia University is colluding with the far-right in its attack on students  —  In her willingness to unleash state violence against student protestors, Minouche Shafik proved herself to be a willing ally to extremists  —  The students sat on the ground and sang as police in riot gear approached them.",
    "url": "https://www.theguardian.com/commentisfree/2024/apr/19/far-right-columbia-university-student-arrests"
  },
  {
    "text": "Matt Gaetz attended 2017 party where minor and drugs were present, woman's sworn statement obtained by Congress claims  —  The Ethics panel is questioning witnesses about allegations involving Gaetz.  —  Rep. Matt Gaetz walks past reporters as he leaves a House GOP caucus meeting at the U.S Capitol … ",
    "url": "https://abcnews.go.com/US/matt-gaetz-attended-2017-party-minor-drugs-present/story?id=109324572"
  },
  {
    "text": "This G.O.P. Senate Candidate Says He Grew Up on a Family Farm.  Not Exactly.  —  David McCormick has often spoken about his modest upbringing on a farm in Pennsylvania.  A close look at his past tells a different story.  —  David McCormick's origin story goes something like this … ",
    "url": "https://www.nytimes.com/2024/04/19/us/politics/dave-mccormick-farm-pennsylvania.html"
  },
  {
    "text": "Trump campaign says it will deploy thousands of election workers to monitor poll sites  —  The program underscores Trump's fixation with election security, which he deployed in an effort to undermine results of the 2020 election.  —  Former President Donald Trump's political operation … ",
    "url": "https://www.politico.com/news/2024/04/19/trump-campaign-election-monitoring-00153217"
  },
  {
    "text": "Trump's covid response was even worse than you remember  —  In a sane country, it would disqualify him from ever again holding office. … As we approach the four-year anniversary of Donald Trump suggesting from the White House podium that bleach injections could be a miracle covid cure … ",
    "url": "https://www.publicnotice.co/p/trump-covid-response-revisited"
  },
  {
    "text": "‘Sleepy Don’ Dozes Off in Court AGAIN  —  NEEDS SLEEP BIGLY  —  Apparently a high-stakes trial just isn't enough to keep the former president awake.  —  Apparently Donald Trump needs to catch up on some sleep, as the former president appeared to doze off in a New York City courtroom yet again on Friday.",
    "url": "https://www.thedailybeast.com/sleepy-don-dozes-off-in-court-again"
  },
  {
    "text": "Trump's Trial Is Already Wreaking Havoc on His Campaign  —  THE DEFENSE IS RESTLESS  —  The hush money trial was never going to be good for Trump, but the first week in court proved just how disruptive and damaging it will be for his 2024 bid. … TRIAL AND ERROR",
    "url": "https://www.thedailybeast.com/trumps-trial-is-already-wreaking-havoc-on-his-campaign"
  },
  {
    "text": "Whiplash as Russia Toasts Derided Marjorie Taylor Greene as Their Top New Hero  —  FROM FOOL TO TOOL  —  Speaker Mike Johnson is no longer Russia's No.1 favorite, he's been replaced by a congresswoman who was once roundly mocked on Russian TV.  —  In recent years, clips from Tucker Carlson's shows … ",
    "url": "https://www.thedailybeast.com/whiplash-as-russia-toasts-derided-marjorie-taylor-greene-as-their-top-new-hero"
  },
  {
    "text": "Donald Trump turns the GOP into a protection racket — and demands Republican candidates pay up  —  To “be seen favorably,” the Trump campaign threatens, Republicans must give 5 percent — or more — to the boss  —  For someone who frequently proclaims his innocence, Donald Trump sure loves to act like a two-bit gangster.",
    "url": "https://www.salon.com/2024/04/19/donald-turns-the-into-a-protection-racket--and-demands-candidates-pay-up/"
  },
  {
    "text": "R.F.K. Jr.'s Environmental Colleagues Urge Him to Drop Presidential Bid  —  Nearly 50 leaders and activists who worked with Mr. Kennedy at an environmental nonprofit group will run ads calling on him to “Honor our planet, drop out.”  —  As an independent candidate for the White House … ",
    "url": "https://www.nytimes.com/2024/04/19/climate/rfk-jr-environment.html"
  },
  {
    "text": "EXCLUSIVE: West Virginia Girls ‘Step-Out’ Of Track & Field Meet To Protest Transgender Competitor  —  On Tuesday, a United States Circuit Court of Appeals ruled that a West Virginia law that bars biological boys from competing on girls' sports teams cannot be enforced with regard to a 13-year-old … ",
    "url": "https://www.outkick.com/sports/west-virginia-girls-protest-transgender-biological-male-track-field"
  },
  {
    "text": "Biden's Title IX rules are a victory for powerful teachers unions fueling Dem campaigns  —  Major teachers union said regulations will ensure transgender students can use whatever bathroom they want  —  The Biden administration's actions finalizing revised Title IX regulations represent … ",
    "url": "https://www.foxnews.com/politics/bidens-title-ix-rules-are-a-victory-for-powerful-teacher-unions-fueling-dem-campaigns"
  },
  {
    "text": "Look Out, Joe: RFK, Jr. Is on the Michigan Ballot  —  Robert F. Kennedy, Jr.'s presidential campaign had a major victory on Thursday.  Kennedy is on the Michigan ballot.  —  That may not sound like much but he can muck up the race for Joe Biden as he gains ballot access in various states.",
    "url": "https://hotair.com/karen-townsend/2024/04/19/look-out-joe-rfk-jr-is-on-the-michigan-ballot-n3786814"
  }
]