[
  {
    "text": "Netanyahu says Israel ‘at war’ after Hamas attack; air force kills nearly 200 in Gaza air strikes  —  Israeli Prime Minister Benjamin Netanyahu said “we are at war, and we will win it” Saturday after Hamas launched an assault and took captives following the 50th anniversary of the start … ",
    "url": "https://www.washingtonpost.com/world/2023/10/07/israel-gaza-rocket-attack-hamas/"
  },
  {
    "text": "Hamas surprise attack out of Gaza Strip stuns Israel and leaves dozens dead in fighting, retaliation  —  Hamas militants fired thousands of rockets and sent dozens of fighters into Israeli towns near the Gaza Strip in an unprecedented surprise early morning attack during a major Jewish holiday Saturday … ",
    "url": "https://apnews.com/article/israel-palestinians-gaza-hamas-rockets-airstrikes-tel-aviv-11fb98655c256d54ecb5329284fc37d2"
  },
  {
    "text": "Eyes turn to Iran as Israel responds to Hamas terror attacks  —  As Israel reels from a coordinated terror operation by Gaza-based Hamas that, by early accounts, has left dozens of civilians dead and wounded, it's unclear how the military may retaliate.  —  Early reports show that dozens … ",
    "url": "https://www.washingtonexaminer.com/policy/defense-national-security/iran-israel-responds-hamas-terror-attacks"
  },
  {
    "text": "Pentagon says it will support Israel after Netanyahu declares war  —  Defense Secretary Lloyd Austin said the U.S. stands squarely by Israel and will ensure it “has what it needs to defend itself” after Israeli Prime Minister Benjamin Netanyahu declared war against Palestinian militants that launched a surprise attack on his country.",
    "url": "https://thehill.com/policy/defense/4243366-pentagon-says-it-will-support-israel-after-leader-declares-war/"
  },
  {
    "text": "‘Rock solid and unwavering’: Biden pledges support for Israel after Hamas attacks  —  The president speaks with Israeli Prime Minister Benjamin Netanyahu after unprecedented escalation leaves 40 dead.  —  President Joe Biden spoke with Israeli Prime Minister Benjamin Netanyahu Saturday morning about the … ",
    "url": "https://www.politico.com/news/2023/10/07/hamas-terrorism-attacks-on-israeli-civilians-00120480"
  },
  {
    "text": "World leaders condemn attack on Israel by Palestinian militant group Hamas  —  The Palestinian militant group Hamas launched a wide scale attack on Israel early Saturday, the largest attack in its conflict with the country in decades.  Hamas militants invaded multiple Israeli towns … ",
    "url": "https://thehill.com/policy/international/4243331-world-leaders-condemn-attack-on-israel-by-palestines-hamas/"
  },
  {
    "text": "The Cost of Inaction on Immigration  —  It is difficult to find an issue that more exemplifies the dysfunction of American government today than immigration.  —  In the past year, more than a million people have entered the United States through the southern border, overflowing shelters and straining public services.",
    "url": "https://www.nytimes.com/2023/10/07/opinion/new-york-migrant-crisis.html"
  },
  {
    "text": "Destroy Trump's old excuses instantly, then preemptively destroy his new ones @spocko@mastodon.online  —  Today's news on Trump's national security crimes:  —  Trump Leaked Nuclear Sub Secrets To Australian Businessman  —  Susie Madrak, Oct 6, 2023 Crooks and Liars",
    "url": "https://digbysblog.net/2023/10/06/destroy-trumps-old-excuses-instantly-then-preemptively-destroy-his-new-ones-spockomastodon-online/"
  },
  {
    "text": "Robert F. Kennedy is headed for a breakup with the Democratic Party  —  Kennedy's expected independent presidential campaign is based on the conspiracy theory that the party has “rigged” the primaries against him.  —  Robert F. Kennedy Jr. appears headed for a breakup with the party … ",
    "url": "https://www.nbcnews.com/politics/2024-election/robert-f-kennedy-headed-breakup-democratic-party-rcna118646"
  },
  {
    "text": "X rolls out new ad format that can't be reported, blocked  —  The new ads also don't disclose who the advertiser is or that they are even ads.  —  X, the Elon Musk-owned platform formerly known as Twitter, has begun serving its users with a weird new ad format and it's one of the company's least transparent products yet.",
    "url": "https://mashable.com/article/twitter-x-new-clickbait-ad-format"
  },
  {
    "text": "The One Thing Trumpies and Swifties Have in Common  —  Group belonging is a powerful feeling, and it's becoming even more powerful — and shaping politics more and more.  —  In the annals of fandom, there may never have been a moment quite like the one last weekend, when a certain American pop star showed … ",
    "url": "https://www.politico.com/news/magazine/2023/10/06/taylor-swift-donald-trump-fans-00119999"
  },
  {
    "text": "Should you believe the polls or the special elections?  There's a third way: Virginia.  —  The close race for control of the state legislature will tell us a lot about which party has the upper hand going into next year.  —  RICHMOND, Va. — Next month's Virginia state legislative election … ",
    "url": "https://www.politico.com/news/2023/10/07/virginia-legislative-elections-2024-00120467"
  },
  {
    "text": "Republicans bash Hillary Clinton for floating ‘formal deprogramming’ of Trump supporters  —  Clinton referred to half of Trump's supporters as belonging in ‘basket of deplorables’ before losing to former president in 2016  —  Republicans bashed former Democratic presidential candidate Hillary Clinton … ",
    "url": "https://www.foxnews.com/politics/republicans-bash-hillary-clinton-floating-formal-deprogramming-trump-supporters"
  },
  {
    "text": "‘Jan. 6 choir’ member sentenced to 7 years in Capitol attack  —  A man who joined a nightly performance of the national anthem inside the D.C. jail that has been promoted by former president Donald Trump and his allies was sentenced to seven years in prison for assaulting police and obstructing Congress on Jan. 6.",
    "url": "https://www.washingtonpost.com/dc-md-va/2023/10/06/jenkins-jan-6-choir-member-sentence-attack/"
  },
  {
    "text": "Empty speaker's office aggravates House-Senate beef  —  It's not just increased fears about a shutdown.  Senators would consider themselves lucky to end the year without a catastrophe.  —  The chaos-ridden, speaker-less House is threatening to stymie a host of bipartisan legislative efforts across … ",
    "url": "https://www.politico.com/news/2023/10/07/house-speaker-shutdown-mccarthy-00120146"
  },
  {
    "text": "Dramatic Increase in DPRK-Russia Border Rail Traffic After Kim-Putin Summit  — Satellite imagery of North Korea's Tumangang Rail Facility at the border with Russia captured on October 5, 2023, shows an unprecedented number of freight railcars, totaling approximately 73 railcars.",
    "url": "https://beyondparallel.csis.org/dramatic-increase-in-dprk-russia-border-rail-traffic-after-kim-putin-summit/"
  },
  {
    "text": "Kevin McCarthy's election machine in limbo as GOP seeks new speaker  —  The deposed speaker spent 15 years building the political operation that won back control of the House in 2022  —  California Rep. Kevin McCarthy spent 15 years building the political machine that won back control … ",
    "url": "https://www.washingtonpost.com/politics/2023/10/06/mccarthy-republicans-fundraising-house-elections/"
  }
]