[
  {
    "text": "Trump loses third bid this week to delay hush money trial  —  A New York appeals judge on Wednesday denied Donald Trump's third last-ditch attempt this week to delay his April 15 criminal trial on charges stemming from hush money paid to a porn star, paving the way for the first-ever trial of a former U.S. president.",
    "url": "https://www.reuters.com/legal/trump-tries-delay-hush-money-trial-third-time-this-week-2024-04-10/"
  },
  {
    "text": "Trump lawyers set to return court with another challenge to his impending criminal trial in New York  —  The former president's filing at the state Appellate Division is his third challenge to the case in three days.  —  Lawyers for former President Donald Trump were heading … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-lawyers-return-court-another-challenge-criminal-trial-new-york-rcna147209"
  },
  {
    "text": "Trump fails to delay N.Y. criminal trial for a third time this week  —  NEW YORK — Donald Trump's attorneys failed to persuade an appeals court judge on Wednesday to delay the former president's New York criminal trial, scheduled to begin next week, by saying the presiding judge was not qualified to oversee the proceedings.",
    "url": "https://www.washingtonpost.com/politics/2024/04/10/trump-new-york-criminal-trial-merchan/"
  },
  {
    "text": "U.S. voters take Trump's hush money charges seriously: Poll … - The New York trial, set to start on April 15 with jury selection, concerns a 2016 payment allegedly made to adult film actress Stormy Daniels.  — About 4 in 10 Republican respondents considered the hush money charges to be serious.",
    "url": "https://www.axios.com/2024/04/10/trump-hush-money-voters-poll"
  },
  {
    "text": "Donald Trump's first criminal trial is nearly here — and he's already starting to melt down  —  Trump is very worried about his election interference case for good reason  —  There's been some talk lately about Donald Trump's light campaign schedule compared to President Joe Biden … ",
    "url": "https://www.salon.com/2024/04/10/donald-first-criminal-trial-is-nearly-here--and-hes-already-starting-to-melt-down/"
  },
  {
    "text": "Arizona Republicans Thwart Attempts to Repeal 1864 Abortion Ban  —  Democrats in both houses of the Legislature were blocked from advancing bills to roll back a reinstated 160-year-old ban on nearly all abortions in the state.  —  A decision by Arizona's highest court upholding an 1864 ban … ",
    "url": "https://www.nytimes.com/2024/04/10/us/abortion-ban-arizona-democrats-repeal.html"
  },
  {
    "text": "Republican Sen. Rick Scott softens his abortion position after Florida Supreme Court ruling  —  Sen. Rick Scott of Florida this week joined the ranks of Republican incumbents scrambling to strike a balance on reproductive rights, saying he opposes a November ballot initiative to strike … ",
    "url": "https://apnews.com/article/florida-senate-rick-scott-abortion-republican-democrat-elections-5723ec9e1a3033db60dfa4efb6f1e6f4"
  },
  {
    "text": "Trump can't escape the firestorm over abortion rights — just like Joe Biden hoped  — Donald Trump tried to wash his hands politically of the abortion issue.  — Instead, the former president's statement disappointed some allies and left key questions resolved.",
    "url": "https://www.businessinsider.com/trump-abortion-views-biden-arizona-2024-election-2024-4"
  },
  {
    "text": "Trump says he wouldn't sign federal abortion ban  —  Former President Donald Trump on Wednesday said he would not sign a federal abortion ban if one reached his desk were he to be elected in November.  —  It's Trump's firmest response to date on a national abortion ban.",
    "url": "https://www.cnn.com/2024/04/10/politics/trump-says-he-wouldnt-sign-federal-abortion-ban"
  },
  {
    "text": "Crenshaw says Greene's expulsion threat for ‘attention,’ doesn't have much support  —  Rep. Dan Crenshaw (R-Texas) said Wednesday that Rep. Marjorie Taylor Greene (R-Ga.) is seeking “attention” with her expulsion threat against Speaker Mike Johnson (R-La.).  —  “Right now, I'm not sure … ",
    "url": "https://thehill.com/homenews/house/4586650-crenshaw-greene-johnson-expulsion-threat/"
  },
  {
    "text": "Alabama Man Charged with Detonating an Explosive Device Outside of Alabama Attorney General's Office  —  For Immediate Release  —  An Alabama man was indicted for his alleged role in detonating an explosive device in downtown Montgomery, Alabama.  —  On April 10, law enforcement arrested … ",
    "url": "https://www.justice.gov/opa/pr/alabama-man-charged-detonating-explosive-device-outside-alabama-attorney-generals-office"
  },
  {
    "text": "Trump Media director accused of ‘hacking’ files in attempted corporate ‘coup’: lawsuit … This photo illustration shows an image of former President Donald Trump next to a phone screen that is displaying the Truth Social app, in Washington, DC, on February 21, 2022.",
    "url": "https://www.cnbc.com/2024/04/10/trump-media-director-accused-of-hacking-files-lawsuit.html"
  },
  {
    "text": "emptywheel Makes CIPA History  —  Yesterday, Judge Aileen Cannon issued a surly order, acceding to Jack Smith's request to protect witnesses.  In reversing herself, Cannon scolded Smith for not making a more fulsome case to seal information. … Ultimately, Cannon argued the 11th Circuit precedent … ",
    "url": "https://www.emptywheel.net/2024/04/10/emptywheel-makes-cipa-history/"
  },
  {
    "text": "North Carolina 2024: Trump On Upside Of Too-Close-To-Call Race, Quinnipiac University North Carolina Poll Finds; Governor's Race: Stein Leads Robinson 52% - 44%  —  mail_outline  —  In a state considered pivotal to the outcome of the 2024 presidential election, President Joe Biden … ",
    "url": "https://poll.qu.edu/poll-release?releaseid=3895"
  },
  {
    "text": "Police Report: Trump County Chair Threatened To Rape Boss's Wife, Then Kill Him  —  Jonathan Stone, a former New Hampshire police officer, has been a part of Trump's campaign since 2016, when he gave Trump an inscribed AR-15 assault rifle.  —  LOADING  —  One of Donald Trump's county campaign chairs … ",
    "url": "https://www.huffpost.com/entry/trump-fired-police-officer-new-hampshire_n_6616de8ce4b0999df35397ba"
  },
  {
    "text": "Japan Gives Washington 250 Cherry Trees as Replacements  —  The trees will replace 140 that will be torn up as part of a restoration project.  The capital's first Japanese cherry trees were a gift from the mayor of Tokyo in 1912.  —  Japan is giving the United States 250 cherry trees … ",
    "url": "https://www.nytimes.com/2024/04/10/us/politics/japan-us-cherry-trees.html"
  },
  {
    "text": "Senate approves resolution targeting Biden highway climate rule, with Democratic support  —  The Senate on Wednesday passed a measure to nullify a Transportation Department rule targeting highway greenhouse gas emissions.  —  The Senate on Wednesday passed a measure to nullify … ",
    "url": "https://www.politico.com/news/2024/04/10/senate-approves-resolution-targeting-highway-emissions-rule-00151588"
  },
  {
    "text": "Could two red states keep Joe Biden off the ballot?  —  Republican Secretaries of State in Ohio and Alabama have told Democrats that their presidential ticket might not qualify for their ballots, warning that the party's nominating convention in Chicago will come too late to make their deadlines.",
    "url": "https://www.semafor.com/article/04/10/2024/could-two-red-states-keep-joe-biden-off-the-general-election-ballot"
  },
  {
    "text": "South Dakota Gov. Kristi Noem Is Now Banished From 10 Percent of Her Own State  —  SEE YA  —  The Standing Rock Sioux are the third Native American tribe to declare the pro-Trump governor persona non grata over insulting remarks she has made in recent months.",
    "url": "https://www.thedailybeast.com/south-dakota-gov-kristi-noem-is-now-banished-from-10-percent-of-her-own-state"
  },
  {
    "text": "Renowned photographer leaves Ford foundation board after Cheney passed over for award  —  David Hume Kennerly, the Pulitzer Prize-winning photographer, resigned as a trustee of the Gerald R. Ford Presidential Foundation on Tuesday, citing the group's decision not to give former Rep. Liz Cheney … ",
    "url": "https://thehill.com/homenews/4587303-renowned-photographer-leaves-ford-foundation-board-after-cheney-passed-over-for-award/"
  },
  {
    "text": "Shooting at Ramadan event in West Philadelphia leaves 3 injured, 5 in custody, police say  —  PHILADELPHIA (CBS) - Three people were shot at the end of a Ramadan event with around 1,000 people in attendance in West Philadelphia's Parkside section Wednesday afternoon, according to police.",
    "url": "https://www.cbsnews.com/news/west-philly-shooting-police/"
  },
  {
    "text": "US Sees Imminent Missile Strike on Israel by Iran, Proxies  — Iran, proxies may strike Israeli military, government sites  — Attack would mark major widening of conflict in Middle East  —  The US and its allies believe major missile or drone strikes by Iran or its proxies against military … ",
    "url": "https://www.bloomberg.com/news/articles/2024-04-10/us-sees-missile-strike-on-israel-by-iran-proxies-as-imminent"
  },
  {
    "text": "Hong Kong: RSF representative detained and deported on attempt to monitor Jimmy Lai's national security trial  —  Organisation:  — RSF_en  —  A representative of Reporters Without Borders (RSF) has been deported from Hong Kong on arrival to the territory to monitor the landmark trial … ",
    "url": "https://rsf.org/en/hong-kong-rsf-representative-detained-and-deported-attempt-monitor-jimmy-lai-s-national-security"
  },
  {
    "text": "Moskowitz fires back at Trump over remarks on Jewish Democrats  —  Rep. Jared Moskowitz (D-Fla.) fired back at former President Trump over his latest remarks about Jewish Democrats Wednesday.  —  Trump said any Jewish person who votes for Democrats or President Biden “should have their head examined” … ",
    "url": "https://thehill.com/homenews/house/4585951-moskowitz-fires-back-at-trump-over-remarks-on-jewish-democrats/"
  },
  {
    "text": "Elon Musk picks his speech battle  —  Happy Wednesday!  Hope your eyes are recovering.  Send news tips to: will.oremus@washpost.com.  —  Though Elon Musk often insists his goal with X is to promote free speech, his actions have rarely been those of the “free-speech absolutist” he once claimed to be.",
    "url": "https://www.washingtonpost.com/politics/2024/04/10/elon-musk-picks-his-speech-battle/"
  },
  {
    "text": "Klain on Biden: He is focused too much on bridges  —  The former chief of staff praised the president's accomplishments.  But he also wondered whether he had the right focus.  —  Former White House chief of staff Ron Klain openly questioned President Joe Biden's political strategy Tuesday night … ",
    "url": "https://www.politico.com/news/2024/04/09/ron-klain-joe-biden-infrastructure-00151438"
  }
]