[
  {
    "text": "As Supreme Court weighs Trump's eligibility, the ‘10th justice’ stays mum  —  The solicitor general would typically file arguments on an issue of this magnitude — but the upcoming Trump case is a political lightning rod.  —  As the Supreme Court prepares to hold arguments next month … ",
    "url": "https://www.politico.com/news/2024/01/24/trump-eligibility-supreme-court-biden-justice-department-00137655"
  },
  {
    "text": "The Tired Monotony of a Trump Rally in 2024  —  ATKINSON, New Hampshire — The line snaked along the driveway, hundreds of people long.  The weather was dreadful in southern New Hampshire — ice and the slush and the subfreezing temperatures — but Donald Trump's faithful didn't care.",
    "url": "https://www.politico.com/news/magazine/2024/01/24/trump-rally-speeches-maga-vibes-00137364"
  },
  {
    "text": "Trump Privately Pressuring GOP Senators To ‘Kill’ Border Deal To Deny Biden A Win  —  The former president is telling Republicans he “doesn't want Biden to have a victory” in 2024, said a source familiar with the bipartisan negotiations.  —  LOADING  —  WASHINGTON - Donald Trump … ",
    "url": "https://www.huffpost.com/entry/trump-border-deal-republicans-biden_n_65b18fa0e4b0166fc770ae46"
  },
  {
    "text": "Collins, leading Senate GOP centrist, won't endorse Trump in 2024  —  Sen. Susan Collins (Maine), the top-ranking Republican on the Senate Appropriations Committee and a key figure in getting bills passed through Congress, says she will not endorse former President Trump, even if he becomes the Republican Party's nominee for president.",
    "url": "https://thehill.com/homenews/senate/4426835-collins-wont-endorse-trump-2024/"
  },
  {
    "text": "Trump wants to send troops to the inner cities.  A top senator wants to rein him in.  —  Sen. Richard Blumenthal is contacting other lawmakers in his bid to overhaul the Insurrection Act.  —  A top Democratic senator is renewing his effort to rein in Donald Trump's — or any other future president's … ",
    "url": "https://www.politico.com/news/2024/01/24/trump-insurrection-act-deploy-military-00137598"
  },
  {
    "text": "64K women and girls became pregnant due to rape in states with abortion bans, study estimates  —  The research letter, published by JAMA Internal Medicine, estimated that nearly 520,000 rapes were associated with 64,565 pregnancies across 14 states.  —  More than 64,000 women and girls became pregnant … ",
    "url": "https://www.nbcnews.com/politics/politics-news/64k-women-girls-became-pregnant-due-rape-states-abortion-bans-study-es-rcna135565"
  },
  {
    "text": "Raped, pregnant and in an abortion ban state?  Researchers gauge how often it happens  —  As an abortion provider in Montana, Dr. Samuel Dickman has seen patients routinely who tell him they became pregnant after a rape.  His sense was the patients who were telling him were only a fraction of the true number.",
    "url": "https://www.npr.org/sections/health-shots/2024/01/24/1226161416/rape-caused-pregnancy-abortion-ban-states"
  },
  {
    "text": "Alina Habba Spotted At Trump Victory Party After Delaying Defamation Trial Over Illness  —  The former president's legal team requested a trial delay, saying Habba had been exposed to COVID and had a fever.  She attended the party one day later.  —  LOADING",
    "url": "https://www.huffpost.com/entry/alina-habba-trump-party-illness_n_65b14dabe4b09e7f5b9e1784"
  },
  {
    "text": "Penn Jillette Wants to Talk It All Out  —  Penn Jillette has a large, framed French-language poster of Renaldo and Clara behind him.  Most people wouldn't know what that is, but as a Bob Dylan fan, I do — it's his largely forgotten, widely panned 1978 film that he wrote, directed and starred in.",
    "url": "https://www.cracked.com/article_40871_penn-jillette-wants-to-talk-it-all-out.html"
  },
  {
    "text": "Exclusive: House ethics probe of Gaetz seeks information from DOJ and woman who allegedly had sex with congressman as a minor  —  The House Ethics Committee investigating Rep. Matt Gaetz has reached out to the woman whom the congressman allegedly had sexual relations with when she was a 17-year-old minor … ",
    "url": "https://www.cnn.com/2024/01/24/politics/house-ethics-matt-gaetz"
  },
  {
    "text": "Arizona GOP chair resigns, alleges Kari Lake blackmail  —  The chairman of the Arizona Republican Party announced he will resign on Wednesday after leaked audio appeared to show him attempting to pay Senate candidate Kari Lake not to run for office in 2024.  —  Jeff DeWit said that the audio was “selectively edited.”",
    "url": "https://thehill.com/homenews/state-watch/4427081-arizona-gop-chair-resigns-alleges-kari-lake-blackmail/"
  },
  {
    "text": "Democrats win challenge to North Carolina voter election law  —  A federal judge blocked a specific provision of the law's same-day voter registration requirements.  —  Joe Biden quietly scored a legal victory in North Carolina this week, in what could prove to be a consequential development in a closely divided state.",
    "url": "https://www.politico.com/news/2024/01/24/north-carolina-voter-election-law-00137679"
  },
  {
    "text": "Statement from NSC Spokesperson Adrienne Watson on Reported Strikes at UNRWA Facility in Southern Gaza  —  We are gravely concerned by reports today of strikes hitting a UN Relief and Works Agency (UNRWA) facility — with subsequent reports of fires in the building—in a neighborhood … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/01/24/statement-from-nsc-spokesperson-adrienne-watson-on-reported-strikes-at-unrwa-facility-in-southern-gaza/"
  },
  {
    "text": "The RNC Shuttered Most of the Hispanic Community Centers It Touted as Critical to Winning Over Latino Voters  —  JWPlayer  —  During the 2022 cycle, the Republican Party made a commitment to Latino voters that hadn't been seen before, touting nearly two dozen RNC Hispanic Community Centers … ",
    "url": "https://themessenger.com/politics/the-rnc-shuttered-most-of-the-hispanic-community-centers-it-touted-as-critical-to-winning-over-latino-voters"
  },
  {
    "text": "Auto Workers Union Endorses Biden Over ‘Scab’ Trump  —  The UAW is backing the president months after he made history by picketing alongside striking workers  —  THE UNITED AUTO Workers (UAW), one of the nation's largest and most influential unions in the country, has endorsed Joe Biden for president.",
    "url": "https://www.rollingstone.com/politics/politics-news/uaw-endorses-biden-scab-trump-1234953626/"
  },
  {
    "text": "FDA warns consumers not to purchase or use Neptune's Fix or any tianeptine product due to serious risks … [1/23/2024] FDA continues to receive severe adverse event reports after use of Neptune's Fix products, including seizures, loss of consciousness and death.",
    "url": "https://www.fda.gov/drugs/drug-safety-and-availability/fda-warns-consumers-not-purchase-or-use-neptunes-fix-or-any-tianeptine-product-due-serious-risks"
  },
  {
    "text": "Ohio lawmakers override DeWine veto of gender-affirming care ban, transgender athlete restrictions  —  The Ohio Senate voted 23-9 Wednesday to override Republican Gov. Mike DeWine's veto of legislation banning gender-affirming health care for minors and preventing transgender women and girls from competing on female school sports teams.",
    "url": "https://thehill.com/homenews/lgbtq/4427040-ohio-senate-house-override-dewine-veto-gender-affirming-care-ban-transgender-athlete/"
  },
  {
    "text": "Governor Abbott signals potential defiance of Supreme Court's border ruling  —  Governor Greg Abbott issued a “Statement on Texas' Constitutional Right to Self-Defense,” following calls by numerous Republican lawmakers to resist the high court's order, including three state representatives from Houston.",
    "url": "https://www.houstonpublicmedia.org/articles/news/border/2024/01/24/475398/governor-abbott-signals-potential-defiance-of-supreme-courts-border-ruling/"
  },
  {
    "text": "Washington State “Proud Boy” Sentenced to Six Years in Prison for Actions During and After Jan. 6 Capitol Breach  —  For Immediate Release  —  U.S. Attorney's Office, District of Columbia  —  Defendant Told Judge “You could give me 100 years and I would still do it all over again.”",
    "url": "https://www.justice.gov/usao-dc/pr/washington-state-proud-boy-sentenced-six-years-prison-actions-during-and-after-jan-6"
  },
  {
    "text": "GOP Rep Only Regrets One Thing in ‘Marshall Law’ Text After Jan. 6  —  CNN's Kaitlan Collins said it was “striking” to hear that, three years later, South Carolina Rep. Ralph Norman still stands by it.  —  Rep. Ralph Norman (R-SC) has just one regret regarding a text message he sent … ",
    "url": "https://www.thedailybeast.com/gop-rep-only-regrets-one-thing-in-marshall-law-text-after-jan-6"
  },
  {
    "text": "Hong Kong's top court overturns acquittal of human rights lawyer  —  Hong Kong's top court on Thursday overturned the acquittal of activist and human rights lawyer Chow Hang Tung of inciting others to join an unauthorised vigil to remember victims of China's 1989 Tiananmen Square crackdown.",
    "url": "https://www.reuters.com/world/china/hong-kongs-top-court-overturns-acquittal-human-rights-lawyer-2024-01-25/"
  },
  {
    "text": "Trump's White House Pharmacy Handed Out Drugs Like Candy: Report  —  A Department of Defense report found an obscene lack of control over the handling of controlled medications while Trump was in office  —  White House pharmacists reportedly distributed uppers and downers like candy … ",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-white-house-pharmacy-prescription-drugs-1234953535/"
  },
  {
    "text": "Religious ‘Nones’ are now the largest single group in the U.S.  —  When Americans are asked to check a box indicating their religious affiliation, 28% now check ‘none.’  —  A new study from Pew Research finds that the religiously unaffiliated - a group comprised of atheists … ",
    "url": "https://www.npr.org/2024/01/24/1226371734/religious-nones-are-now-the-largest-single-group-in-the-u-s"
  }
]