[
  {
    "text": "Kamala Harris Broke Donald Trump  —  This article was featured in the One Story to Read Today newsletter.  Sign up for it here.  —  Last night in Philadelphia, Kamala Harris did to Donald Trump what Donald Trump had done to Joe Biden: She broke her opponent on a debate stage.",
    "url": "https://www.theatlantic.com/politics/archive/2024/09/kamala-harris-broke-donald-trump/679780/?gift=T7Rc-usB5FOiIPROxn3jvnVuS3Prqq3lk-Vov8FvMC8&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "What More Do You People Want from Kamala Harris?  —  1. The Philadelphia Massacre  —  Let's do this rundown style.  —  1. Harris delivered the goods.  You never know if a politician can play on the national stage until they do it.  Sometimes a promising candidate pops.  Sometimes they're Ron DeSantis.",
    "url": "https://www.thebulwark.com/p/what-more-do-you-people-want-from"
  },
  {
    "text": "Trump Demands ABC Be Shut Down for Daring to Fact Check Debate  —  SCORCHED EARTH  —  The former president went on ‘Fox & Friends’ to complain that he'd been treated unfairly.  —  Donald Trump called for ABC News to be shut down during a rant about the way he was treated by the network during … ",
    "url": "https://www.thedailybeast.com/trump-demands-abc-be-shut-down-for-daring-to-fact-check-debate"
  },
  {
    "text": "How resounding was Kamala Harris's debate win?  Let's look at the polls.  —  Early results show Harris won by a historically large margin.  And Trump voters both acknowledged that and said it could impact their votes.  —  Vice President Kamala Harris turned in one of the more resounding debate performances … ",
    "url": "https://www.washingtonpost.com/politics/2024/09/11/kamala-harris-debate-performance-polls/"
  },
  {
    "text": "Even Fox News Acknowledges Reality: Trump Blew the Debate  —  “Make no mistake about it: Trump had a bad night.”  —  As my colleague David Corn put it, Donald Trump lost the first presidential debate against Kamala Harris by simply being himself: He spent the night ranting, raving … ",
    "url": "https://www.motherjones.com/politics/2024/09/fox-news-brit-hume-trump-debate/"
  },
  {
    "text": "How Harris Roped a Dope  —  Sign up for The Decision, a newsletter featuring our 2024 election coverage.  —  Vice President Kamala Harris walked onto the ABC News debate stage with a mission: trigger a Trump meltdown.  —  She succeeded.  —  Former President Donald Trump had a mission too: control yourself.",
    "url": "https://www.theatlantic.com/politics/archive/2024/09/how-harris-roped-a-dope/679779/"
  },
  {
    "text": "How Swing Voters Reacted to the Trump-Harris Debate  —  “I think she was the clear winner,” said one voter.  “She was more presidential.”  —  Before last night's debate, I got a text from a friend who summed up Kamala Harris's predicament: She has to appear feminine but not dainty.",
    "url": "https://www.theatlantic.com/politics/archive/2024/09/kamala-harris-trump-debate-sexism-bar/679791/"
  },
  {
    "text": "CNN Flash Poll: Majority of debate watchers say Harris outperformed Trump onstage  —  Registered voters who watched Tuesday's presidential debate broadly agree that Kamala Harris outperformed Donald Trump, according to a CNN poll of debate watchers conducted by SSRS.",
    "url": "https://www.cnn.com/2024/09/11/politics/election-poll-trump-harris-debate/"
  },
  {
    "text": "If You Want to Know Who Won the Debate, Watch Fox News the Moment It Ended  —  Tuning in to Fox News following Tuesday's presidential debate, it was hard to describe the mood.  Somber comes to mind—a little like you might find at a funeral, perhaps for a beloved cat consumed by a political boogeyman.",
    "url": "https://slate.com/business/2024/09/debate-donald-trump-kamala-harris-winner-fox-news.html"
  },
  {
    "text": "This Was the Beginning of Donald Trump's Final Unraveling  —  Let's cut to the chase: “I have concepts of a plan” was the defining moment of this debate and is going to go down in presidential debate lore as one of the most pathetic lines in debate history.  For the record, it was about health care … ",
    "url": "https://newrepublic.com/article/185850/debate-donald-trump-final-unraveling"
  },
  {
    "text": "Trump's Trainwreck  —  You know who cares about the notorious bias of the media-Democrat complex?  Conservatives.  You know who was not the relevant, target audience for last night's debate between presidential candidates?  Conservatives.  —  If you're obsessing over how bad … ",
    "url": "https://www.nationalreview.com/corner/trumps-trainwreck/"
  },
  {
    "text": "Some undecided voters not convinced by Harris after debate with Trump  —  Kamala Harris was widely seen as dominating Tuesday's presidential debate against Republican former president Donald Trump, but a group of undecided voters remained unconvinced that the Democratic vice president was the better candidate.",
    "url": "https://www.reuters.com/world/us/some-undecided-voters-not-convinced-by-harris-after-debate-with-trump-2024-09-11/"
  },
  {
    "text": "Aiden Clark's dad begs Springfield, politicians: Stop using son to hate Haitians  —  Boy was killed in 2023 school bus crash caused by Haitian immigrant; father says 'we can't even protect his memory when he's gone'  —  The father of the 11-year-old boy killed last year when a minivan driver struck … ",
    "url": "https://www.springfieldnewssun.com/news/aiden-clarks-dad-begs-springfield-politicians-stop-using-son-to-hate-haitians/QEZC7DVPKVC5JDPLNH7H2YSRPU/"
  },
  {
    "text": "Unhinged Elon Musk Offers to Impregnate Taylor Swift  —  The father-of-12 offered his unlikely insight into the presidential debate after Swift endorsed Harris.  —  ‘NO GOING BACK’  —  “Harris proved she's the best choice to lead our nation forward,” says the man she replaced as Democratic presidential nominee.",
    "url": "https://www.thedailybeast.com/elon-musk-breaks-debate-silence-with-bizarre-offer-to-impregnate-taylor-swift"
  },
  {
    "text": "How Taylor Swift Surprised Harris, and Entered a New Political Era  —  The pop star capped a big night for Kamala Harris with an unexpectedly timed endorsement that could draw in more young voters.  Ms. Swift's political message, too, was newly direct and personal.",
    "url": "https://www.nytimes.com/2024/09/11/us/politics/taylor-swift-politics-harris.html"
  },
  {
    "text": "Speaker Johnson pulls a vote on a bill to avoid a partial government shutdown  —  WASHINGTON (AP) — Speaker Mike Johnson pulled a vote Wednesday on a temporary spending bill that would keep federal agencies and programs funded for six months as it became increasingly clear the measure lacked … ",
    "url": "https://apnews.com/article/government-shutdown-mike-johnson-house-voting-citizenship-b2b20d38dbb0fcf3390a97eb1cc29418"
  },
  {
    "text": "Mark Zuckerberg says he's done apologizing  —  The home of the Golden State Warriors was packed on Tuesday evening this week, but it wasn't to watch Steph Curry.  Thousands of fans gathered at the Chase Center in downtown San Francisco to watch one of Silicon Valley's biggest ballers … ",
    "url": "https://techcrunch.com/2024/09/11/mark-zuckerberg-says-hes-done-apologizing/"
  },
  {
    "text": "Election officials warn that widespread problems with the US mail system could disrupt voting  —  State and local election officials from across the country on Wednesday warned that problems with the nation's mail delivery system threaten to disenfranchise voters in the upcoming presidential election … ",
    "url": "https://apnews.com/article/election-2024-mail-ballots-voting-postal-service-985dd6e483fb6dc593d83255b11a9d0a"
  }
]