[
  {
    "text": "Exclusive: Georgia prosecutors have messages showing Trump's team is behind voting system breach  —  Atlanta-area prosecutors investigating efforts to overturn the 2020 election results in Georgia are in possession of text messages and emails directly connecting members of Donald Trump's legal team … ",
    "url": "https://www.cnn.com/2023/08/13/politics/coffee-county-georgia-voting-system-breach-trump/"
  },
  {
    "text": "Trump's ‘Co-Conspirators’ Are Already Starting to Turn on Each Other  —  “It is the 'please don't put me in jail, put that other guy in jail' strategy,” says one attorney working in Trump's legal orbit … A number of the ex-president's chief lieutenants and alleged co-conspirators in the plot … ",
    "url": "https://www.rollingstone.com/politics/politics-features/donald-trump-jack-smith-coconspirators-rudy-giuliani-1234806292/"
  },
  {
    "text": "Louis DeJoy: From Trump villain to Biden's clean energy buddy  —  The postmaster general has struck up an unexpected partnership with the president's green guru, John Podesta.  —  During the summer of 2020, there were few bigger Democratic super villains than Louis DeJoy.",
    "url": "https://www.politico.com/news/2023/08/13/how-louis-dejoy-went-from-democratic-nightmare-fuel-to-biden-clean-energy-player-00110945"
  },
  {
    "text": "What is the plan, Trump?  —  Former President Donald Trump is notoriously a man of many words, as are his multitudes of surrogates and supporters.  The 45th president and his team have had quite a bit to say recently about the mental state of special counsel Jack Smith, “disloyal” Ron … ",
    "url": "https://www.washingtonexaminer.com/opinion/what-is-the-plan-trump"
  },
  {
    "text": "Georgia Is Ground Zero for Trump Exhaustion as Another Indictment Looms  —  Case is a reminder of the 2020 election saga that has torn state GOP apart; 'It's just getting ridiculous'  —  PEACHTREE CITY, Ga.—Georgia has become ground zero for exhaustion over the legal drama surrounding Donald Trump … ",
    "url": "https://www.wsj.com/articles/donald-trump-election-grand-jury-georgia-voters-4cd64c0?mod=djemalertNEWS"
  },
  {
    "text": "How Trump Benefits From an Indictment Effect  —  In polling, fund-raising and conservative media, the former president has turned criminal charges into political assets.  —  Early on March 18, former President Donald J. Trump hit send on a social media post saying he would be “arrested on Tuesday of next week.”",
    "url": "https://www.nytimes.com/2023/08/13/us/politics/trump-indictment-effect.html"
  },
  {
    "text": "RFK Jr. says he'd sign a federal ban on abortions after three months of pregnancy  —  The stance puts Kennedy — who's mounting long shot bid to unseat President Joe Biden as the Democratic standard bearer in 2024 — out of step with most of his party.  —  DES MOINES, IOWA … ",
    "url": "https://www.nbcnews.com/politics/2024-election/rfk-jr-says-sign-federal-ban-abortions-three-months-pregnancy-rcna99689"
  },
  {
    "text": "Newsom vs. DeSantis debate stalling over Fox News audience  —  The California Democrat and Florida Republican agreed to the debate, but hit a stalemate over the network hosting a live studio audience.  —  Gavin Newsom and Ron DeSantis have reached an impasse in their Fox News debate planned for November … ",
    "url": "https://www.politico.com/news/2023/08/14/ron-desantis-gavin-newsom-debate-fox-news-00111001"
  },
  {
    "text": "The Supreme Court is taking a wrecking ball to the wall between church and state  —  The Court's Republican majority has ground the Constitution's establishment clause down to a nub.  —  Last June, a previously obscure Oklahoma state board voted to allow two Roman Catholic dioceses to operate a charter school in that state.",
    "url": "https://www.vox.com/scotus/2023/8/13/23822822/supreme-court-establishment-clause-church-state-separation-carson-bremerton"
  },
  {
    "text": "Christie says no one has given him a loyalty pledge to sign  —  The RNC's loyalty pledge is a hot issue in advance of the first GOP debate.  —  Republican presidential candidate Chris Christie said Sunday he has yet to sign the party's loyalty pledge because no one has given it to him.",
    "url": "https://www.politico.com/news/2023/08/13/chris-christie-republican-debate-pledge-00110980"
  },
  {
    "text": "Massachusetts passed a 4% millionaire's tax last year.  Now every public school student is going to get free lunch.  — Massachusetts passed a 4% tax on people who make more than $1 million per year.  — Revenue from the new income tax is being used to give kids in the state free lunch and breakfast at school.",
    "url": "https://www.businessinsider.com/massachusetts-millionaire-tax-gets-kids-free-school-lunches-2023-8?op=1"
  },
  {
    "text": "A conversation with the newspaper owner raided by cops  —  Very few stories these days take my breath away, but this one did the trick: Cops in Kansas raided the office of local newspaper the Marion County Record Friday morning because of a complaint by a local restaurant owner named Kari Newell.",
    "url": "https://thehandbasket.substack.com/p/a-conversation-with-the-newspaper"
  },
  {
    "text": "The Clean Energy Future Is Arriving Faster Than You Think  —  The United States is pivoting away from fossil fuels and toward wind, solar and other renewable energy, even in areas dominated by the oil and gas industries.  —  This is the first article in a three-part series examining the speed … ",
    "url": "https://www.nytimes.com/interactive/2023/08/12/climate/clean-energy-us-fossil-fuels.html"
  },
  {
    "text": "Hunter Biden's lawyer says trial ‘not inevitable’ as scrutiny mounts  —  Hunter Biden's lawyer on Sunday said a trial is “not inevitable,” days after the Trump-appointed US attorney investigating the president's son was granted special counsel status following a breakdown in plea talks to resolve tax and gun charges.",
    "url": "https://www.cnn.com/2023/08/13/politics/hunter-biden-trial-lawyer/"
  },
  {
    "text": "2 eject from vintage Soviet jet before crash at Michigan air show  —  No injuries were reported when the MiG-23, flying at Thunder Over Michigan, plummeted and hit vehicles in a parking lot in Belleville, authorities said.  —  Two people in a vintage fighter jet ejected dramatically … ",
    "url": "https://www.nbcnews.com/news/us-news/2-eject-vintage-soviet-jet-crash-michigan-air-show-rcna99709"
  },
  {
    "text": "Trump swoops into Iowa fair, defying customs and clashing with DeSantis  —  Pork chops, protesters of the Florida governor and a swift visit by the former president were at the center of a high-drama day  —  DES MOINES — The crowd that had craned to watch Florida Gov. Ron DeSantis (R) … ",
    "url": "https://www.washingtonpost.com/elections/2023/08/12/iowa-state-fair-trump-desantis/"
  }
]