[
  {
    "text": "Don't fall for Trump's new abortion position claims  —  While once again taking credit for the end of Roe v. Wade and the constitutional right to an abortion, Donald Trump nonetheless tried to distance himself on Monday from the most extreme anti-abortion positions of his party in an explicit effort to “win elections.”",
    "url": "https://www.lawdork.com/p/dont-fall-for-trumps-new-abortion-position"
  },
  {
    "text": "Evangelicals won't be bothered by Trump's abortion gambit — they know he's lying  —  Project 2025 makes it clear: The plan is a national abortion ban, even if by executive order  —  On Monday, with great fanfare, Donald Trump released his “plan” on abortion in a video posted to Truth Social.",
    "url": "https://www.salon.com/2024/04/09/evangelicals-wont-be-bothered-by-abortion-gambit--they-know-hes-lying/"
  },
  {
    "text": "Trump hush money jurors will be asked about QAnon, not political affiliation  —  Prospective jurors in former President Trump's hush money trial can expect to be asked about QAnon and Antifa — but not their political party affiliation.  —  The New York judge overseeing Trump's criminal trial … ",
    "url": "https://thehill.com/regulation/court-battles/4582457-trump-hush-money-jurors-asked-about-qanon-not-political-affiliation/"
  },
  {
    "text": "Ken Buck knocks ‘Moscow Marjorie’ Taylor Greene  —  Former Rep. Ken Buck (R-Colo.) took shots at Rep. Marjorie Taylor Greene (R-Ga.) Monday, attacking his former GOP colleague as “Moscow Marjorie.”  —  The jab comes after former Speaker Kevin McCarthy (R-Calif.) called Greene a … ",
    "url": "https://thehill.com/homenews/house/4582430-ken-buck-knocks-moscow-marjorie-taylor-greene/"
  },
  {
    "text": "I've Been at NPR for 25 Years.  Here's How We Lost America's Trust.  —  Uri Berliner, a veteran at the public radio institution, says the network lost its way when it started telling listeners how to think.  —  You know the stereotype of the NPR listener: an EV-driving, Wordle-playing, tote bag-carrying coastal elite.",
    "url": "https://www.thefp.com/p/npr-editor-how-npr-lost-americas-trust"
  },
  {
    "text": "European court rules human rights violated by climate inaction  —  A group of older Swiss women have won the first ever climate case victory in the European Court of Human Rights.  —  The women, mostly in their 70s, said that their age and gender made them particularly vulnerable to the effects of heatwaves linked to climate change.",
    "url": "https://www.bbc.com/news/science-environment-68768598"
  },
  {
    "text": "Tenth consecutive monthly heat record alarms and confounds climate scientists  —  If the anomaly does not stabilise by August, ‘the world will be in uncharted territory’, says climate expert  —  Another month, another global heat record that has left climate scientists scratching their heads … ",
    "url": "https://www.theguardian.com/global/2024/apr/09/tenth-consecutive-monthly-heat-record-alarms-confounds-climate-scientists"
  },
  {
    "text": "As Kushner's Investment Firm Steps Out, the Potential Conflicts Are Growing  —  Jared Kushner's Affinity Partners has invested more than $1.2 billion, much of it in firms abroad, drawing new scrutiny as his father-in-law, Donald Trump, again seeks the presidency.",
    "url": "https://www.nytimes.com/2024/04/09/us/politics/jared-kushner-affinity-partners.html"
  },
  {
    "text": "Trump says Jews who vote for Biden do ‘not love Israel’ and ‘should be spoken to’  —  The presumptive Republican presidential nominee repeated an antisemitic trope he has pushed suggesting American Jews have dual loyalties to the U.S. and Israel.  —  Former President Donald Trump on Monday … ",
    "url": "https://www.nbcnews.com/politics/2024-election/trump-says-jews-vote-biden-not-love-israel-spoken-rcna146972"
  },
  {
    "text": "The Ugly Truth Behind Ted Cruz's Super PAC Podcast  —  CRUZ CONTROL  —  Ted Cruz is once again pushing the bounds of campaign finance laws, this time with his super PAC pocketing hundreds of thousands of dollars for his podcast appearances. … In recent weeks, a number of news reports … ",
    "url": "https://www.thedailybeast.com/ted-cruz-is-turning-an-allied-super-pac-into-a-media-company"
  },
  {
    "text": "Idaho Man Arrested for Attempting to Provide Material Support to ISIS  —  For Immediate Release  —  Alexander Scott Mercurio, 18, of Coeur d'Alene, Idaho, was arrested Saturday, April 6, 2024, in Coeur d'Alene for attempting to provide material support and resources to ISIS.",
    "url": "https://www.justice.gov/opa/pr/idaho-man-arrested-attempting-provide-material-support-isis"
  },
  {
    "text": "Which Trump lies stick?  Republicans believe some falsehoods more than they did six years ago, our poll finds.  —  Fictions, misleading claims, wild exaggerations, lies — former president Donald Trump dispenses untruths of one variant or another relentlessly.",
    "url": "https://www.washingtonpost.com/politics/2024/04/09/some-trump-falsehoods-stick-more-than-others-fact-checker-poll-finds/"
  },
  {
    "text": "Biden's Latest Student Loan Bailout Has Election-Year Bribe Written All Over It  —  The Democrat's election-year bribe would be paid for by taxpayers forced to shoulder an ever-expanding national debt.  —  President Joe Biden campaigned in swing-state Wisconsin on Monday to sell … ",
    "url": "https://thefederalist.com/2024/04/09/bidens-latest-student-loan-bailout-has-election-year-bribe-written-all-over-it/"
  },
  {
    "text": "Biden Is Spending $1 Trillion to Fight Climate Change.  Voters Don't Care.  —  President's campaign is promoting the effort, hoping to attract young people  —  President Biden has done more to address climate change than any of his predecessors.  So far, voters don't seem to care.",
    "url": "https://www.wsj.com/politics/elections/biden-is-spending-1-trillion-to-fight-climate-change-voters-dont-care-21d8cb05"
  },
  {
    "text": "Who Wants to Be a Trillionaire?  —  Don't laugh.  That's exactly where America's oligarchic policies are taking us.  —  Forbes' annual list of the 400 richest Americans debuted in 1982 with shipping magnate Daniel Ludwig in the top slot.  Ludwig's wealth, the magazine reported, was $2 billion (about $6.3 billion in today's dollars).",
    "url": "https://www.motherjones.com/politics/2024/04/wealth-inequality-trillionaires-oligarchy-federal-tax-policy/"
  },
  {
    "text": "The Black Market That Delivers Elon Musk's Starlinks to U.S. Foes  —  The satellite-internet devices are helping Russian fighters in Ukraine and paramilitary forces in Sudan; SpaceX hasn't shut them off  —  A salesman at Moscow-based online retailer shopozz.ru has supplemented his usual business … ",
    "url": "https://www.wsj.com/business/telecom/starlink-musk-ukraine-russia-sudan-satellite-communications-technology-f4fc79d9"
  },
  {
    "text": "Colorado GOP ousts reporter from event, claiming ‘unfair’ coverage  —  As a veteran journalist in Colorado, it wasn't Sandra Fish's first time reporting on the state GOP assembly.  But it was her first time getting kicked out.  —  The Colorado Republican Party expelled Fish from its event in Pueblo … ",
    "url": "https://www.washingtonpost.com/politics/2024/04/09/colorado-gop-assembly-reporter/"
  },
  {
    "text": "None of This Is Normal  —  Donald Trump's 2024 bid is an antidemocratic revenge fantasy being treated like a conventional political campaign.  —  On Monday morning, Axios's Mike Allen blasted out his early morning email with the subject line: “Scoop: Trump's retaliation plan.”",
    "url": "https://www.vanityfair.com/news/donald-trump-2024-election-none-of-this-is-normal"
  },
  {
    "text": "EPA to crack down on toxic emissions from more than 200 chemical plants  —  The Biden administration will require more than 200 chemical plants to cut their emissions of toxic chemicals as part of a broader effort to reduce cancer cases.  —  The Environmental Protection Agency (EPA) … ",
    "url": "https://thehill.com/policy/energy-environment/4582067-epa-to-crack-down-on-toxic-emissions-from-more-than-200-chemical-plants/"
  },
  {
    "text": "Sonia Sotomayor's retirement is a political IQ test  —  Are you into politics to win — or to feel good about yourself?  —  Sonia Sotomayor, one of the three remaining liberal Supreme Court justices, will turn 70 years old in June, is diabetic and had one parent who died at a young age.",
    "url": "https://www.natesilver.net/p/sonia-sotomayors-retirement-is-a"
  },
  {
    "text": "How Donald Trump's mug shot became a defiant and divisive 2024 symbol  —  CONWAY, S.C. — After Quinzell Williams stepped out of an Uber near a campaign rally featuring Donald Trump, a passing couple did a double take.  —  “Aren't you embarrassed to be wearing that?” they asked, Williams recalled.",
    "url": "https://www.washingtonpost.com/politics/interactive/2024/mugshot-trump-2024-election-campaign/"
  }
]