[
  {
    "text": "Trump Leads Biden in Nearly Every Battleground State, New Poll Finds  —  Voters in battleground states said they trusted Donald J. Trump over President Biden on the economy, foreign policy and immigration, as Mr. Biden's multiracial base shows signs of fraying.",
    "url": "https://www.nytimes.com/2023/11/05/us/politics/biden-trump-2024-poll.html"
  },
  {
    "text": "Trump and allies plot revenge, Justice Department control in a second term  —  Advisers have also discussed deploying the military to quell potential unrest on Inauguration Day.  Critics have called the ideas under consideration dangerous and unconstitutional.",
    "url": "https://www.washingtonpost.com/politics/2023/11/05/trump-revenge-second-term/"
  },
  {
    "text": "If Trump wins, more voters foresee better finances, staying out of war — CBS News poll  —  With views of things in America continuing to be bad and now hitting their most negative marks of the year, one might expect an incumbent president to trail in a pre-election poll — as Joe Biden does in this one.",
    "url": "https://www.cbsnews.com/news/trump-vs-biden-poll-2024-presidential-election-year-out/"
  },
  {
    "text": "Zelensky invites Trump to Ukraine: 'He can't manage this war'  —  Ukrainian President Volodymyr Zelensky has invited former President Trump to his country's war zone, saying the former president “can't manage this war.”  —  Zelensky, who joined NBC “Meet the Press” Kristen Welker … ",
    "url": "https://thehill.com/policy/international/4293934-zelensky-invites-trump-ukraine-he-cant-manage-this-war/"
  },
  {
    "text": "Iowa Gov. Kim Reynolds to endorse Ron DeSantis for president at Monday rally in Des Moines  —  Gov. Kim Reynolds' decision to endorse Ron DeSantis is likely to anger Donald Trump, who has already accused Reynolds of being insufficiently loyal.  —  After months of quietly signaling her support … ",
    "url": "https://www.desmoinesregister.com/story/news/elections/presidential/caucus/2023/11/05/iowa-gov-kim-reynolds-to-endorse-ron-desantis-president-monday-rally-des-moines-caucuses-2024-trump/71438016007/"
  },
  {
    "text": "House Speaker Mike Johnson Skirts Question on Personal Bank Account  —  The newfound Speaker said he was a “man of modest means” in a Fox interview.  —  House Speaker Mike Johnson (R-LA) responded on Sunday to a report by The Daily Beast that highlighted his apparent lack of a bank account on his financial disclosure.",
    "url": "https://www.thedailybeast.com/house-speaker-mike-johnson-skirts-question-on-personal-bank-account"
  },
  {
    "text": "Trump 2.0: The climate cannot survive another Trump term  —  This op-ed is part of a series exploring what a second term would look like for either President Biden or former President Trump.  —  Back in the home stretch of the 2020 presidential election, I stated that a second Trump term would be “game over for the climate.”",
    "url": "https://thehill.com/opinion/energy-environment/4290467-trump-2-0-the-climate-cannot-survive-another-trump-term/"
  },
  {
    "text": "William Lewis named publisher and CEO of The Washington Post  —  The veteran media executive, previously the publisher of the Wall Street Journal, was tapped by Washington Post owner Jeff Bezos to replace Fred Ryan, who stepped down in August.  —  William Lewis, a reporter-turned-executive … ",
    "url": "https://www.washingtonpost.com/style/media/2023/11/04/william-lewis-publisher-ceo-washington-post/"
  },
  {
    "text": "Judge Cannon's Response  —  Thursday night, prosecutors alerted federal Judge Aileen Cannon in Southern Florida that after Trump's lawyers asked her to delay his trial there because it was too close in time to his trial in the District of Columbia, they turned around and asked the Judge in D.C. to delay the trial there as well.",
    "url": "https://joycevance.substack.com/p/judge-cannons-response"
  },
  {
    "text": "‘MAGA Mike Johnson’ and Our Broken Christian Politics  —  There are two moments from Mike Johnson's early days as speaker of the House that almost perfectly encapsulate the broken way that so many Republican evangelicals approach politics.  The first occurred just after the House elected Johnson.",
    "url": "https://www.nytimes.com/2023/11/05/opinion/maga-mike-johnson-christianity.html"
  },
  {
    "text": "DeWine calls Ohio abortion ballot measure a ‘radical proposal’  —  Ohio Gov. Mike DeWine (R) called a referendum on reproductive rights on the ballot Tuesday in his home state a “radical proposal,” just days before voters will take to the polls to weigh in on the issue.",
    "url": "https://thehill.com/homenews/state-watch/4294279-dewine-calls-ohio-abortion-ballot-measure-a-radical-proposal/"
  },
  {
    "text": "US official says over 300 Americans have been able to leave Gaza  —  White House Principal Deputy National Security Adviser Jon Finer confirmed on Sunday that more than 300 Americans have been able to leave Gaza nearly one month since the war between Israel and militant group Hamas began.",
    "url": "https://thehill.com/policy/international/4294365-us-official-says-over-300-americans-have-been-able-to-leave-gaza/"
  },
  {
    "text": "Israel minister suspended after calling nuking Gaza an option  —  Heritage Minister Amichai Eliyahu's statements ‘are not based in reality,’ Prime Minister Netanyahu says.  —  Israel's Heritage Minister Amichai Eliyahu was suspended indefinitely after he said in an interview that dropping … ",
    "url": "https://www.politico.eu/article/israel-minister-amichai-eliyahu-suspend-benjamin-netanyahu-nuclear-bomb-gaza-hamas-war/"
  },
  {
    "text": "Speaker Johnson pushes to couple Ukraine aid and border: ‘Take care of our own border first’  —  House Speaker Mike Johnson argues Democrats ‘not listening’ to their constituents on the border crisis  —  House Speaker Mike Johnson, R-La., on Sunday argued it “makes sense” to couple Ukraine aid with funding for the U.S.-Mexico border.",
    "url": "https://www.foxnews.com/politics/speaker-johnson-pushes-couple-ukraine-aid-border-take-care-our-own-border-first"
  },
  {
    "text": "Obama Urges Americans to Take in ‘Whole Truth’ of Israel-Gaza War  —  The former president said everyone was “complicit to some degree” in the current bloodshed and acknowledged the points of view on both sides of the conflict.  —  Barack Obama offered a complex analysis of the conflict between Israel … ",
    "url": "https://www.nytimes.com/2023/11/04/us/politics/obama-israel-palestine.html"
  }
]