[
  {
    "text": "House Republicans strike deal on short-term funding, but Senate likely to reject it  —  Half a dozen House Republicans announced a deal on Sunday to temporarily fund the government with the goal of averting a shutdown at the end of the month.  But it's far from certain that the proposal … ",
    "url": "https://www.washingtonpost.com/politics/2023/09/17/gop-continuing-resolution/"
  },
  {
    "text": "Could McCarthy really lose his job?  —  Good morning, Early Birds.  If you're looking to brush up on Bibi ahead of President Biden's meeting with him in New York on Wednesday, allow us to suggest David Remnick's 1998 profile in which Benjamin Netanyahu smokes a Davidoff in his office without offering Remnick one.",
    "url": "https://www.washingtonpost.com/politics/2023/09/18/could-mccarthy-really-lose-his-job/"
  },
  {
    "text": "Playbook: McCarthy's latest gambit falls flat  —  Presented by With help from Eli Okun and Garrett Ross  —  DRIVING THE DAY  —  BREAKING OVERNIGHT — “Iran-US prisoner swap likely set in motion as $6 billion of once-frozen Iranian assets reaches Qatar,” by AP's Jon Gambrell … ",
    "url": "https://www.politico.com/newsletters/playbook/2023/09/18/mccarthys-latest-gambit-falls-flat-00116484"
  },
  {
    "text": "9/18/23 ☀️ Punchbowl News AM  —  This is an enormous week for Speaker Kevin McCarthy and House Republicans.  —  The federal government will shut down in 13 days unless Congress greenlights more funding.  And House Republicans are pushing a partisan stopgap spending bill … ",
    "url": "https://punchbowl.news/archive/91823-punchbowl-news-am/"
  },
  {
    "text": "‘A colossal mistake to showcase this sociopath’: NBC facing backlash after ‘shameful’ Trump interview airs  —  NBC's attempt to avoid the pitfalls of the Donald Trump CNN town hall which was a contributing factor to the departure of CEO of CNN Worldwide Chris Licht does not appear to have panned out despite being taped and edited.",
    "url": "https://www.rawstory.com/trump-kristen-welker/"
  },
  {
    "text": "Jennifer Wexton will not seek reelection, citing health concerns  —  Democratic Rep. Jennifer Wexton of Virginia announced Monday morning she will finish out her term in Congress but will not seek reelection, citing health concerns.  —  Wexton was diagnosed with Parkinson's disease a few months ago … ",
    "url": "https://www.cnn.com/2023/09/18/politics/jennifer-wexton-not-running-reelection/"
  },
  {
    "text": "Democratic Virginia Rep. Jennifer Wexton Won't Seek Reelection  —  Wexton was diagnosed with supranuclear palsy  —  A Facebook icon representing an external link to share the article on Facebook.A Twitter icon representing an external link to share the article on Twitter.An Email icon … ",
    "url": "https://themessenger.com/politics/virginia-rep-jennifer-wexton-wont-seek-reelection"
  },
  {
    "text": "Hunter Biden sues IRS over disclosures  —  The lawsuit over IRS agent interviews with Congress and the press comes as a special counsel weighs charging him with tax crimes  —  President Biden's son Hunter Biden filed a lawsuit Monday against the Internal Revenue Service … ",
    "url": "https://www.washingtonpost.com/national-security/2023/09/18/hunter-biden-lawsuit-irs/"
  },
  {
    "text": "Five Americans detained in Iran are freed and on flight out of country, Qatari official tells CNN  —  Doha and Washington CNN  —  Five Americans who had been imprisoned in Iran have been freed and are on a flight out of the country, a Qatari official briefed on the matter told CNN … ",
    "url": "https://www.cnn.com/2023/09/18/politics/iran-us-prisoner-release-intl/"
  },
  {
    "text": "I Was Attacked by Trump and Musk.  It Was a Strategy to Change What You See Online.  —  When I worked at Twitter, I led the team that placed a fact-checking label on one of Donald Trump's tweets for the first time.  Following the violence of Jan. 6, I helped make the call to ban his account from Twitter altogether.",
    "url": "https://www.nytimes.com/2023/09/18/opinion/trump-elon-musk-twitter.html"
  },
  {
    "text": "Trump moves to put the nail in DeSantis' campaign coffin  —  The ex-president is upping his presence in Iowa in an attempt to close any door on a comeback by the Florida governor.  —  Donald Trump's campaign believes Ron DeSantis is flatlining.  Now, they want to bury him.",
    "url": "https://www.politico.com/news/2023/09/18/trump-desantis-campaign-iowa-00116452"
  },
  {
    "text": "Scoop: Schumer ditches Senate's informal dress code … - “Senators are able to choose what they wear on the Senate floor. … - Fetterman, who was elected last year, initially followed Senate tradition and wore suits. … The change applies only to senators — staff members will still be required to follow the old dress code.",
    "url": "https://www.axios.com/2023/09/17/senate-drops-dress-code-schumer"
  },
  {
    "text": "Lawmakers are spending way more to keep themselves safe.  Is it enough?  —  A Post analysis of campaign and congressional reports shows spending on security has skyrocketed since the Jan. 6 attack on the Capitol  —  Candidates running for House and Senate offices increased campaign spending … ",
    "url": "https://www.washingtonpost.com/politics/2023/09/18/congress-security-spending-violence-threats/"
  },
  {
    "text": "Ken Paxton emerges victorious from yet another career scandal  —  It marked a screaming milestone in a two-decade political career that has seen Paxton harness the state's increasingly conservative politics — and later the rise of Donald Trump — to stay in power longer than his vulnerabilities would suggest.",
    "url": "https://www.texastribune.org/2023/09/17/ken-paxton-impeachment-trial-scandal/"
  },
  {
    "text": "Two pilots killed in crash at National Championship Races in Reno  —  Two pilots were killed Sunday after their planes collided while landing at the National Championship Air Races in Reno, Nevada, the race organizers confirmed.  —  The Reno Air Racing Association (RARA) … ",
    "url": "https://thehill.com/blogs/blog-briefing-room/4209326-two-pilots-killed-in-crash-at-national-championship-races-in-reno/"
  }
]