[
  {
    "text": "Epic double debacle stings House GOP  —  It's 10 minutes of humiliation that will live in House lore. … - Speaker Mike Johnson lost by one vote — a Republican vote! — the first impeachment of a Cabinet official in 148 years. … - GOP lawmakers openly criticized leaders for bringing … ",
    "url": "https://www.axios.com/2024/02/07/house-republicans-mike-johnson-impeachment-israel"
  },
  {
    "text": "Chuck Schumer to push stripped-down Israel and Ukraine aid package after GOP blocks Senate border bill  —  The vote comes after Republican senators made clear there isn't enough support for a bipartisan border security bill that included foreign aid to Ukraine, Israel and Taiwan.",
    "url": "https://www.nbcnews.com/politics/congress/chuck-schumer-push-stripped-israel-ukraine-aid-package-gop-blocks-sena-rcna137661"
  },
  {
    "text": "Chip Roy knocks Trump over border claim: 'That didn't happen'  —  Rep. Chip Roy (R-Texas) took a dig at former President Trump in a House floor speech on Tuesday, denying the former president's claim that any executive could unilaterally close the southern border.",
    "url": "https://thehill.com/homenews/house/4452898-chip-roy-donald-trump-border/"
  },
  {
    "text": "In chaotic scene, Republicans argue with GOP lawmaker after ‘no’ vote on impeachment  —  Moments before the vote to impeach Homeland Security Secretary Alejandro Mayorkas narrowly failed Tuesday evening, a chaotic scene unfolded on the House floor.  —  The vote had unexpectedly come to a tie … ",
    "url": "https://www.washingtonpost.com/politics/2024/02/06/house-republicans-yell-gallagher-impeachment-vote/"
  },
  {
    "text": "Al Green, in Hospital Garb, Delivers Vote to Kill Mayorkas Impeachment  —  The Democrat from Texas had undergone abdominal surgery but rushed to the Capitol because he said the vote was “personal.”  —  With the final minutes for the vote dwindling, the House watched intently on Tuesday night … ",
    "url": "https://www.nytimes.com/2024/02/06/us/politics/al-green-mayorkas-impeachment.html"
  },
  {
    "text": "In stunner, House GOP bid to impeach Mayorkas fails  —  A House GOP effort to impeach Homeland Security Secretary Alejandro Mayorkas failed in embarrassing fashion Tuesday as three Republicans joined Democrats in voting against what would have been the second-ever impeachment of a Cabinet official.",
    "url": "https://thehill.com/homenews/house/4452038-in-stunner-house-gop-bid-to-impeach-mayorkas-fails/"
  },
  {
    "text": "The Memo: Former Trump White House lawyer predicts crushing defeat at Supreme Court  —  A former attorney for the Trump White House predicts that the Supreme Court will rule unanimously against the 45th president on his claims to be immune from criminal prosecution.",
    "url": "https://thehill.com/regulation/court-battles/4451952-trump-immunity-ty-cobb-predicts-crushing-defeat-supreme-court/"
  },
  {
    "text": "‘None of these candidates’ beats out Haley in Nevada primary that Trump skipped  —  Donald Trump skipped the contest, which does not count for delegates to the nominating convention.  On the Democratic side, President Biden won easily.  —  Former U.N. ambassador Nikki Haley suffered … ",
    "url": "https://www.washingtonpost.com/politics/2024/02/06/nevada-biden-haley-primary/"
  },
  {
    "text": "Putin interview with Tucker Carlson shows Kremlin outreach to Trump's GOP  —  MOSCOW — As Russian state television propagandists salivated over Tucker Carlson's interview with President Vladimir Putin, the first of Carlson's falsehoods about his visit to Moscow was punctured, fittingly enough … ",
    "url": "https://www.washingtonpost.com/world/2024/02/07/tucker-carlson-putin-russia-ukraine/"
  },
  {
    "text": "Behind the border mess: Open GOP rebellion against McConnell  —  The Republican leader told POLITICO that his critics “had their shot” already.  But conservatives are not done whacking him over the immigration-for-Ukraine aid implosion.  —  Conservative hardliners once celebrated Mitch McConnell … ",
    "url": "https://www.politico.com/news/2024/02/07/mcconnell-gop-rebellion-border-deal-00139972"
  },
  {
    "text": "Ronna McDaniel, R.N.C. Chairwoman, Plans to Step Down  —  Donald Trump is likely to back a supporter of his false claims of election fraud, Michael Whatley, the head of the North Carolina G.O.P., to replace her.  —  The chairwoman of the Republican National Committee, Ronna McDaniel … ",
    "url": "https://www.nytimes.com/2024/02/06/us/politics/ronna-mcdaniel-rnc-trump.html"
  },
  {
    "text": "Inside Donald Trump's Incredible Cash Crunch  —  Two New York laws are about to smack Trump in the face, no matter if he plans to appeal two massive civil judgments that could wipe out all the cash in his pocket. … Donald Trump is just days away from getting slammed with a court judgment … ",
    "url": "https://www.thedailybeast.com/inside-donald-trumps-incredible-cash-crunch"
  },
  {
    "text": "Michael Fanone Hits ‘Spineless’ Matt Gaetz And Allies With The Facts About Jan. 6 … LOADING",
    "url": "https://www.huffpost.com/entry/michael-fanone-matt-gaetz-resolution_n_65c34a9be4b069b665dd5efe"
  },
  {
    "text": "Military helicopter with 5 Marines on board goes missing en route to California  —  The helicopter was en route from Nevada to California Tuesday night.  —  A CH-53E Super Stallion is seen here in an undated file photo.  —  California search and rescue crews are looking for a missing helicopter … ",
    "url": "https://abcnews.go.com/US/military-helicopter-5-marines-board-missing-en-route/story?id=107021601"
  },
  {
    "text": "Jeanine Pirro Stuns Fox News Co-Hosts by Calling Black Colleague an ‘Oreo’  —  During a Fox News segment on how New York Mayor Eric Adams applauded his “chocolate” administration, things got a bit awkward.  —  Fox News host Jeanine Pirro called her Black colleague an “Oreo” … ",
    "url": "https://www.thedailybeast.com/jeanine-pirro-calls-black-colleague-an-oreo-during-fox-segment"
  },
  {
    "text": "Shocking Fox News Moment Sees Guardian Angels Give Man ‘Pain Compliance’ On Live TV  —  “His mother back in Venezuela felt the vibrations,” the group's founder Curtis Sliwa boasted to Sean Hannity, adding the man is now “sucking concrete.”  —  LOADING  —  Fox News host Sean Hannity's interview … ",
    "url": "https://www.huffpost.com/entry/sean-hannity-guardian-angels-fox-news_n_65c364a0e4b0dbc806aec1af"
  },
  {
    "text": "For First Time in Two Decades, U.S. Buys More From Mexico Than China  —  The United States bought more goods from Mexico than China in 2023 for the first time in 20 years, evidence of how much global trade patterns have shifted.  —  In the depths of the pandemic, as global supply chains buckled … ",
    "url": "https://www.nytimes.com/2024/02/07/business/economy/united-states-china-mexico-trade.html"
  },
  {
    "text": "Alleged aspiring militia “sniper” with plans to attack agents at border arrested  —  A Tennessee militia member who told an undercover federal agent that the U.S. is “being invaded” by migrants was planning to travel to the southern border with a stockpile of weapons and commit acts of violence … ",
    "url": "https://www.cbsnews.com/news/militia-sniper-paul-faye-southern-border-attack-federal-agents/"
  },
  {
    "text": "Joe Biden just did the rarest thing in US politics: he stood up to the oil industry  —  The Biden administration suspended new permits for natural gas terminals.  Can we see more of this kind of backbone?  —  Ten days ago Joe Biden did something remarkable, and almost without precedent - he actually said no to big oil.",
    "url": "https://www.theguardian.com/commentisfree/2024/feb/07/joe-biden-big-oil-lng-permits"
  },
  {
    "text": "IRS: Fund us, and we'll collect hundreds of billions from tax cheaters  —  A new Treasury Department study, taking aim at GOP critics, argues a bigger budget prevents massive tax evasion  —  The Internal Revenue Service is fighting back against Republican efforts to shrink its budget … ",
    "url": "https://www.washingtonpost.com/business/2024/02/06/irs-tax-evasion-study-budget/"
  }
]