[
  {
    "text": "US firm that paid indicted FBI informant tied to Trump associates, records reveal  —  Alexander Smirnov was paid $600,000 in 2020 - the same year he allegedly began lying to FBI about Bidens' role in Ukraine business  —  An American company that paid the now indicted FBI informant Alexander Smirnov … ",
    "url": "https://www.theguardian.com/us-news/2024/mar/14/company-paying-fbi-informant-trump-connections"
  },
  {
    "text": "Exclusive: Trump launched CIA covert influence operation against China  —  Two years into office, President Donald Trump authorized the Central Intelligence Agency to launch a clandestine campaign on Chinese social media aimed at turning public opinion in China against its government … ",
    "url": "https://www.reuters.com/world/us/trump-launched-cia-covert-influence-operation-against-china-2024-03-14/"
  },
  {
    "text": "Trump's RNC officially kills the GOP's mail-in voter effort  —  The Trump-branded Republican Party is less interested in promoting voting by mail than in legal challenges aimed at voting systems.  —  In a victory for the extremist wing of the Republican Party, it looks like Donald Trump's … ",
    "url": "https://www.msnbc.com/the-reidout/reidout-blog/main-in-voting-bank-your-vote-republicans-rcna143291"
  },
  {
    "text": "RNC Shutting Down Community Centers Aimed at Minority Outreach  —  An overhaul of the party's operations continues after Donald Trump's allies take over.  —  The Republican National Committee, days after electing new leadership and overhauling its presidential campaign operation … ",
    "url": "https://www.nytimes.com/2024/03/13/us/politics/republican-community-centers-closed.html"
  },
  {
    "text": "Sterilizer plants release a cancer-causing gas.  The Biden administration will make them cut those emissions by 90 percent  —  The Biden administration is cutting down on emissions of a cancer-causing chemical that's released by companies that sterilize medical devices and other products.",
    "url": "https://thehill.com/policy/energy-environment/4530474-sterilizer-plants-release-a-cancer-causing-gas-the-biden-administration-will-make-them-cut-those-emissions-by-90-percent/"
  },
  {
    "text": "Biden's Best Shot Against Trump Lies in Three ‘Blue Wall’ States  — Campaign has doubled its staffing in swing states this month  — Biden visits Michigan Thursday, Dingell says it's must-win  —  President Joe Biden's reelection prospects largely hinge on the so-called Blue Wall … ",
    "url": "https://www.bloomberg.com/news/articles/2024-03-14/biden-s-best-shot-against-trump-lies-in-three-blue-wall-states"
  },
  {
    "text": "RFK Jr.'s VP prospect Aaron Rodgers has shared false Sandy Hook conspiracy theories in private conversations  —  Independent presidential candidate Robert F. Kennedy Jr. has confirmed that among his potential vice-presidential prospects is New York Jets quarterback Aaron Rodgers … ",
    "url": "https://www.cnn.com/2024/03/13/politics/aaron-rodgers-sandy-hook-conspiracy-theories/"
  },
  {
    "text": "Media compounds failure on Hur report  —  On February 8, Special Counsel Robert Hur released a report describing President Joe Biden as a “well-meaning, elderly man with a poor memory” and “diminished faculties.”  Although Hur concluded that criminal charges against Biden … ",
    "url": "https://popular.info/p/media-compounds-failure-on-hur-report"
  },
  {
    "text": "Elon Musk Keeps Spreading a Very Specific Kind of Racism  —  He is the “patient zero for this sort of stuff right now.”  —  Racist pseudo-science is making a comeback thanks to Elon Musk.  Recently, the tech billionaire has been retweeting prominent race scientist adherents on his platform X … ",
    "url": "https://www.motherjones.com/politics/2024/03/elon-musk-racist-tweets-science-video/"
  },
  {
    "text": "Schumer to call for ‘new election’ in Israel in scathing speech on Netanyahu  —  “Israel cannot hope to succeed as a pariah opposed by the rest of the world,” the Senate majority leader is expected to say.  —  Senate Majority Leader Charles E. Schumer (D-N.Y.) will call for the Israeli government … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/14/israel-elections-netanyahu-charles-schumer/"
  },
  {
    "text": "South Dakota legislator calls for inquiry into Gov. Noem's Texas dental trip and promo video  —  A Democratic legislator on Wednesday called for an inquiry into South Dakota Republican Gov. Kristi Noem's trip to Texas for dental work and a promotional video in which she praises the doctors for giving her … ",
    "url": "https://apnews.com/article/south-dakota-texas-kristi-noem-dental-teeth-775ac3e08a73e232023e38425bc5a075"
  },
  {
    "text": "Gallego gets Latino Victory endorsement in Arizona Senate bid  —  Arizona Democratic Rep. Ruben Gallego's Senate bid is being backed by the Latino Victory Fund.  —  Latino Victory's endorsement on Thursday morning comes as more national and Arizona Democrats have stepped firmly into Gallego's camp … ",
    "url": "https://thehill.com/latino/4530130-gallego-latino-victory-arizona-senate-sinema-lake/"
  },
  {
    "text": "Democrats prepare to go to war against third party candidates  —  The Democratic National Committee is building its first-ever team to counter third-party candidates while outside groups stockpile money for a wider campaign.  —  The Democratic National Committee is building its first-ever team … ",
    "url": "https://www.nbcnews.com/politics/2024-election/dnc-war-third-party-candidates-rcna143290"
  },
  {
    "text": "Religious supremacy, not Supremacy Clause, is key to Fifth Circuit contraception ruling  —  Two of Donald Trump's most conservative, religiously motivated judicial appointees have now issued a two-tier attack on the federal government's longstanding policy that clinics receiving Title X funding need … ",
    "url": "https://www.lawdork.com/p/duncan-religious-supremacy-not-supremacy-clause"
  },
  {
    "text": "Steven Mnuchin Says He Is Putting Together a Group to Buy TikTok  —  Former Treasury secretary's comments come after House voted to ban the app in the U.S. or force a sale  —  Steven Mnuchin is putting together a consortium to try to buy TikTok, the former Treasury secretary said.",
    "url": "https://www.wsj.com/tech/steven-mnuchin-says-he-is-putting-together-a-group-to-buy-tiktok-3aac4a33"
  },
  {
    "text": "Stormy Daniels Is Going to Screw Trump's Campaign Schedule  —  Trump is about to have his entire schedule derailed by courtroom appearances and, even if his campaign thinks he can make it work, Trump is about to have real time problems.  —  Having secured his third straight Republican … ",
    "url": "https://www.thedailybeast.com/the-courtroom-over-the-campaign-trail-inside-trumps-broken-schedule"
  },
  {
    "text": "Biden administration announces $120 million for tribal climate resilience  —  The Biden administration will fund 146 tribal climate resilience projects to the tune of $120 million, Interior Department officials announced Thursday.  —  The funds include $71 million in Inflation Reduction Act … ",
    "url": "https://thehill.com/policy/energy-environment/4531461-biden-administration-announces-120-million-for-tribal-climate-resilience/"
  },
  {
    "text": "Boebert slams Buck's decision as ‘weak sauce,’ says she won't run in special election  —  Rep. Lauren Boebert (R-Colo.) called Rep. Ken Buck's (R-Colo.) decision to resign early “weak sauce” but said she would not be resigning to run in the special election to fill his seat.",
    "url": "https://thehill.com/homenews/campaign/4529046-lauren-boebert-ken-buck-colorado-special-election-reelection/"
  },
  {
    "text": "Kamala Harris to visit an abortion clinic, a first for a president or vice president  —  Harris plans to tour a Planned Parenthood clinic in Minnesota on Thursday.  —  Vice President Kamala Harris plans to tour a Planned Parenthood clinic in Minnesota that provides abortion services Thursday … ",
    "url": "https://www.nbcnews.com/politics/2024-election/kamala-harris-will-visit-planned-parenthood-rcna143324"
  },
  {
    "text": "Donald Trump Is a National-Security Risk  —  The GOP candidate should not be given intelligence briefings.  —  Since 1952, the White House has allowed major-party candidates access to classified intelligence briefings so that they will be current on important issues if they win the election.",
    "url": "https://www.theatlantic.com/newsletters/archive/2024/03/donald-trump-is-a-national-security-risk/677750/"
  },
  {
    "text": "Councils from Paris to the Yarra want to use parking fees to clamp down on big SUVs.  What are they doing and will they succeed?  —  Inner suburban Melbourne council joins French capital in targeting large vehicles and moving towards size-based pricing for parking",
    "url": "https://amp-theguardian-com.cdn.ampproject.org/c/s/amp.theguardian.com/australia-news/2024/mar/14/melbourne-yarra-city-council-parking-fees-suvs-utes"
  },
  {
    "text": "Live updates: Trump to attend Florida classified documents hearing seeking dismissal of charges … Former President Donald Trump is expected to attend a hearing Thursday in the federal criminal case involving his handling of classified documents in Florida, where his attorneys will argue the case should be thrown out.",
    "url": "https://www.nbcnews.com/politics/donald-trump/live-blog/trump-hearing-classified-documents-live-updates-rcna143103"
  },
  {
    "text": "AI-created election disinformation is deceiving the world  —  From Bangladesh to Slovakia, AI-generated deepfakes have been undermining elections around the globe.  Experts say their reach and sophistication is a sign of things to come in consequential elections later this year.  (March 15)",
    "url": "https://apnews.com/article/artificial-intelligence-elections-disinformation-chatgpt-bc283e7426402f0b4baa7df280a4c3fd"
  },
  {
    "text": "Hair-Raising Details of New Jersey GOP Senate Candidate's DUI Emerge  —  Asked by a cop if he'd been in a crash, the New Jersey Republican said: “I don't think so,” according to a police report.  —  New details have emerged of an incident involving a New Jersey Republican candidate running … ",
    "url": "https://www.thedailybeast.com/hair-raising-details-of-gop-senate-candidate-alex-zdans-dui-emerge"
  },
  {
    "text": "No Labels Co-Chairman Pat McCrory Quits Group as It Presses Ahead With Presidential Ticket  —  GOP former North Carolina governor departs as centrist group plans to create a candidate selection committee  —  WASHINGTON—Former North Carolina Gov. Pat McCrory, a national co-chairman of No Labels … ",
    "url": "https://www.wsj.com/politics/elections/no-labels-co-chairman-pat-mccrory-quits-group-as-it-presses-ahead-with-presidential-ticket-a10b041f"
  },
  {
    "text": "How immigration is driving U.S. job growth … - “Faster population and labor force growth has meant that employment could grow more quickly than previously believed without adding to inflationary pressures,” economists Wendy Edelberg and Tara Watson write for the Hamilton Project.",
    "url": "https://www.axios.com/2024/03/13/immigration-economy-jobs-growth-good"
  },
  {
    "text": "Johnson signals shift on Ukraine to GOP senators  —  Speaker Mike Johnson (R-La.) told Republican senators Wednesday to expect the House to send them legislation to help Ukraine, but cautioned that what comes out of the House will look substantially different than the $95 billion foreign aid package the Senate passed last month.",
    "url": "https://thehill.com/homenews/senate/4530355-johnson-signals-shift-on-ukraine-to-gop-senators/"
  }
]