[
  {
    "text": "White House to brief lawmakers as House chairman warns of ‘serious national security threat’  —  Lawmakers said the issue is serious but shouldn't cause immediate alarm.  —  National Security Advisor Jake Sullivan speaks during a press briefing at the White House in Washington, Feb. 14, 2024.",
    "url": "https://abcnews.go.com/Politics/white-house-plans-brief-lawmakers-house-chairman-warns/story?id=107232293"
  },
  {
    "text": "House Intel chair warns of ‘serious national security threat’ ahead of planned White House briefing  —  The administration will brief House leaders on Thursday.  Rep. Jim Himes, the top Democrat on the House Intelligence Committee said there's no reason for Americans to panic.",
    "url": "https://www.nbcnews.com/politics/national-security/house-intel-chair-warns-serious-national-security-threat-ahead-planned-rcna138848"
  },
  {
    "text": "What we know about the ‘disturbing’ Russia intel roiling the Hill  —  The intelligence is related to Moscow's weaponization of its orbital systems, one of those informed about its content said.  —  A vague warning by the chair of the House Intelligence Committee about a “serious national security threat” … ",
    "url": "https://www.politico.com/news/2024/02/14/house-intel-national-security-threat-russia-space-power-00141473"
  },
  {
    "text": "House Intel Chairman announces ‘serious national security threat,’ sources say it is related to Russia  —  House Intelligence Committee Chair Mike Turner has made information concerning a “serious national security threat” available to all members of Congress to review, the committee said on Wednesday.",
    "url": "https://www.cnn.com/2024/02/14/politics/house-intel-chairman-serious-national-security-threat/"
  },
  {
    "text": "George Santos Mercilessly Trolls GOP After Democrats Win His Old Seat  —  He even took the time to text his former colleagues to call them “f***ing idiots.”  —  Disgraced former congressman George Santos tore into the Republican Party on Tuesday night after a Democrat won his old House seat … ",
    "url": "https://www.thedailybeast.com/george-santos-mercilessly-trolls-gop-after-democrats-win-his-old-seat"
  },
  {
    "text": "3 takeaways from the New York special election  —  Democrats had reason to celebrate yet another election Tuesday, with Tom Suozzi winning the special election for the seat of indicted and expelled former congressman George Santos (R-N.Y.) and flipping the district blue.",
    "url": "https://www.washingtonpost.com/politics/2024/02/13/new-york-special-election-santos/"
  },
  {
    "text": "Biden attacked Hur for asking him when Beau died.  That didn't happen, sources say.  —  The president raised his son's death after being asked about his workflow at a Virginia rental home, where he said he found classified materials, two sources said.  —  President Joe Biden lashed … ",
    "url": "https://www.nbcnews.com/politics/justice-department/biden-attacked-hur-asking-beau-died-didnt-happen-sources-say-rcna138709"
  },
  {
    "text": "Republicans admit it.  Kevin McCarthy has never looked so good.  —  House GOP insiders view the new speaker as a man perpetually without a plan.  —  For nine months in his speakership, Kevin McCarthy seemed like a man with a title but no power — desperately improvising to keep … ",
    "url": "https://www.politico.com/news/2024/02/14/johnson-faces-waves-of-buyers-remorse-00141407"
  },
  {
    "text": "About Damn Time  —  The Republicans in the House finally did something right.  Alejandro Mayorkas was finally impeached.  —  Way back when the House Republicans dumped Kevin McCarthy and finally replaced him with Mike Johnson, I predicted nothing would change.  Republicans have too small a majority to get much of anything done.",
    "url": "https://hotair.com/david-strom/2024/02/14/about-damn-time-n3782921"
  },
  {
    "text": "Nikki Haley: ‘Diminished,’ ‘unhinged’ Trump has changed since she backed him  —  In an interview with NBC News' Craig Melvin, Haley explained away her past support for Trump while knocking his recent conduct and his age.  —  Former U.N. Ambassador Nikki Haley defended her past support … ",
    "url": "https://www.nbcnews.com/politics/2024-election/nikki-haley-diminished-unhinged-trump-changed-backed-rcna138667"
  },
  {
    "text": "Biden Shields Palestinians in the U.S. From Deportation  —  The president, who is facing mounting criticism over U.S. support for Israel, used an authority that exempts people from deportation if their homeland is in crisis.  —  President Biden on Wednesday shielded thousands of Palestinians … ",
    "url": "https://www.nytimes.com/2024/02/14/us/politics/biden-palestinians-deportation.html"
  },
  {
    "text": "Military says Russian landing ship sunk in Black Sea  —  Editor's Note: This is a developing story and will continue to be updated.  —  The Russian landing ship Caesar Kunikov was sunk in the Black Sea in the morning of Feb. 14, the General Staff of Ukraine's Armed Forces confirmed.",
    "url": "https://kyivindependent.com/media-russian-landing-ship-allegedly-sunk-by-drones-in-black-sea/"
  },
  {
    "text": "ASSISTANT DEMOCRATIC LEADER CLYBURN STATEMENT ON HOUSE LEADERSHIP ROLE  —  WASHINGTON, D.C. — Today, U.S. House Assistant Democratic Leader James E. Clyburn released the following statement on his decision to step down from House Democratic leadership:  —  “I have informed Leader Hakeem Jeffries … ",
    "url": "https://assistantdemocraticleader.house.gov/media/press-releases/assistant-democratic-leader-clyburn-statement-house-leadership-role"
  },
  {
    "text": "House panel obtains texts allegedly showing Gaetz setting up 2017 Florida Keys trip with woman his associate paid for sex: Sources  —  The House Ethics Committee is reviewing the messages, sources tell ABC News.  —  Rep. Matt Gaetz is shown at the U.S. Capitol in Washington, D.C., on Feb. 6, 2024.",
    "url": "https://abcnews.go.com/US/house-panel-obtains-texts-allegedly-showing-gaetz-setting/story?id=107126493"
  },
  {
    "text": "Conservative group tells judge it has no evidence to back its claims of Georgia ballot stuffing  —  A conservative group has told a Georgia judge that it doesn't have evidence to support its claims of illegal ballot stuffing during the the 2020 general election and a runoff two months later.",
    "url": "https://apnews.com/article/georgia-elections-true-vote-ballot-stuffing-199113b47bc2df79c63fdf007cd23115"
  },
  {
    "text": "Mozilla downsizes as it refocuses on Firefox and AI: Read the memo  —  After installing a new interim CEO earlier this month, Mozilla, the organization behind the Firefox browser, is making some major changes to its product strategy, TechCrunch has learned.  —  Specifically, Mozilla plans … ",
    "url": "https://techcrunch.com/2024/02/13/mozilla-downsizes-as-it-refocuses-on-firefox-and-ai-read-the-memo/"
  },
  {
    "text": "Pete Hoekstra Is Rightful Chair of Michigan Republicans, R.N.C. Says  —  The Republican National Committee sided with a group of state members who ousted Kristina Karamo, a far-right election denier, in January.  —  After a bitter monthlong fight in Michigan over who has a valid claim to lead … ",
    "url": "https://www.nytimes.com/2024/02/14/us/politics/hoekstra-karamo-michigan-republican-chair.html"
  },
  {
    "text": "The Tangled Fates of Fani Willis and Her Biggest Case  —  Will the Fulton County D.A.'s “clandestine” relationship derail her effort to prosecute Trump?  —  This past August, Manny Arora, a lawyer in Atlanta, considered an unusual challenge to the charges brought against his client Kenneth Chesebro.",
    "url": "https://www.newyorker.com/news/letter-from-the-south/the-tangled-fates-of-fani-willis-and-her-biggest-case"
  }
]