[
  {
    "text": "A new kind of Republican Party is forming at the RNC  —  The GOP is dramatically transforming.  Just listen carefully to the RNC.  —  MILWAUKEE — A new kind of Republican Party is revealing itself at its national convention.  —  All the markers of a MAGA jamboree are on display … ",
    "url": "https://www.politico.com/news/2024/07/17/rnc-republican-party-transformation-maga-00168933"
  },
  {
    "text": "J.D. Vance's Stunning Admission About Trump Spells Trouble for MAGA  —  Now that Ohio Senator J.D. Vance is Donald Trump's running mate, everyone is combing through his old quotes, and a striking one has surfaced: In 2016, Vance warned that Trump threatened to take the white working class to a “very dark place.”",
    "url": "https://newrepublic.com/article/183904/jd-vances-stunning-admission-trump-spells-trouble-maga"
  },
  {
    "text": "Playbook: New polling bolsters ‘Dump Biden’ push  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  FIRST IN PLAYBOOK: WHAT DEMOCRATS ARE READING — This polling memo (h/t JMart) from BlueLabs Analytics is circulating among party officials still keen … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/07/17/new-polling-bolsters-dump-biden-push-00168943"
  },
  {
    "text": "Nearly two-thirds of Democrats want Biden to withdraw, new AP-NORC poll finds … Nearly two-thirds of Democrats say President Joe Biden should withdraw from the presidential race and let his party nominate a different candidate, according to a new poll, sharply undercutting his post-debate claim that … ",
    "url": "https://apnews.com/article/biden-trump-poll-drop-out-debate-democrats-59eebaca6989985c2bfbf4f72bdfa112"
  },
  {
    "text": "GOP Platform Author Admits There's a National Ban  —  Click to skip ahead: In WTF NYT, the paper of record deceptively edited a quote.  In the States, news out of Ohio, Michigan, Montana and more.  I Told Ya So on the GOP's abortion plank.  Ballot Measure Updates has more on the financial impact statement fight in Florida.",
    "url": "https://jessica.substack.com/p/gop-platform-author-admits-theres"
  },
  {
    "text": "DNC letter says virtual roll call to nominate Biden will happen in August  —  The Democratic National Committee has determined that a virtual roll call vote to formally nominate President Biden as the party's nominee will happen in August, according to a letter sent Wednesday by the heads of the convention rules committee.",
    "url": "https://www.cbsnews.com/news/democratic-national-committee-letter-joe-biden-virtual-roll-call/"
  },
  {
    "text": "Scoop: House Democrats scrap letter opposing early DNC vote … - Rep. Jared Huffman (D-Calif.) told Axios the letter is being scrapped after party officials said earlier on Wednesday that the virtual roll call would not be held before August.  — “We've achieved what we wanted here,” … ",
    "url": "https://www.axios.com/2024/07/17/house-democrats-dnc-letter-biden-vote"
  },
  {
    "text": "Former Trump adviser Peter Navarro released from prison after serving 4 months for contempt of Congress  —  Former Donald Trump White House adviser Peter Navarro was released from a Miami federal prison Wednesday after completing his four-month sentence for defying a subpoena from the January 6 congressional committee.",
    "url": "https://www.cnn.com/2024/07/17/politics/peter-navarro-released-from-prison-contempt"
  },
  {
    "text": "Biden Group Therapy  —  Fresh reporting on the collective private mourning of top Democrats after the tragic “events”—as they are known in Washington-speak—of the weekend.  Nevertheless, some cling to hope.  “He also said he would drop if he saw data saying he can't win,” said a campaign source.",
    "url": "https://puck.news/biden-saturday-zoom-call-with-house-democrats-goes-off-the-rails/"
  },
  {
    "text": "Andreessen Horowitz co-founders explain why they're supporting Trump  —  Marc Andreessen, the co-founder of one of the most prominent venture capital firms in Silicon Valley, says he's been a Democrat most of his life.  He says he has endorsed and voted for Bill Clinton, Al Gore, John Kerry, Barack Obama and Hillary Clinton.",
    "url": "https://techcrunch.com/2024/07/16/andreessen-horowitz-co-founders-explain-why-theyre-supporting-trump/"
  },
  {
    "text": "The phony populism of JD Vance  —  It's a cynical branding exercise. … Trump chose JD Vance as his running mate this week, and a certain segment of the news media immediately rushed to declare the start of a new kind of working-class Republicanism.  —  “JD Vance pick unnerves GOP's business elite … ",
    "url": "https://www.publicnotice.co/p/jd-vance-phony-populism-trump"
  },
  {
    "text": "Biden set to announce support for major Supreme Court changes  —  Plans include proposals for legislation to establish term limits for the justices and an enforceable ethics code  —  President Biden is finalizing plans to endorse major changes to the Supreme Court in the coming weeks … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/16/biden-supreme-court-reforms/"
  },
  {
    "text": "Donald Trump calls for Taiwan to ‘pay’ for its own defence  —  TSMC shares slide after Republican candidate's comments rattle island nation reliant on security guarantee  —  Former US president Donald Trump has said Taiwan should pay the US for its defence guarantees, a statement … ",
    "url": "https://www.ft.com/content/84f8336e-9b8a-4662-a665-47aa3edb6bc9"
  },
  {
    "text": "Boiled Frog Journalism: Is Trump an Agent of Saudi Arabia, and Other Pressing Questions Buried under Biden's Age  —  A jury found Robert Menendez guilty on all charges yesterday, including those alleging he accepted payments from Egypt and Qatar (I didn't follow the trial closely enough … ",
    "url": "https://www.emptywheel.net/2024/07/17/boiled-frog-journalism-is-trump-an-agent-of-saudi-arabia-and-other-pressing-questions-buried-under-bidens-age/"
  },
  {
    "text": "Court ‘Going To Remove’ Aileen Cannon From Trump Case: Anti-MAGA Lawyer  —  's classified documents case will be removed from the proceedings following her latest ruling, a legal expert has said.  —  Ben Meiselas, attorney and frequent Trump critic, hit out at the “horrific” decision from Judge",
    "url": "https://www.newsweek.com/aileen-cannon-removed-trump-classified-documents-jack-smith-1926234"
  },
  {
    "text": "Germany to halve military aid for Ukraine despite possible Trump White House  —  Germany will halve military aid for Ukraine next year, even with the possibility that Republican candidate Donald Trump could return to the White House and curb support for Kyiv.",
    "url": "https://www.reuters.com/world/europe/germany-halve-military-aid-ukraine-despite-possible-trump-white-house-2024-07-17/"
  },
  {
    "text": "Trump's tariffs mean big opportunities for corruption  —  The White House will be picking winners and losers  —  I didn't write about tariffs or trade policy in Monday's post on the economic implications of a GOP sweep in November.  That's in part because, to the extent any policy issue … ",
    "url": "https://www.slowboring.com/p/trumps-tariffs-mean-big-opportunities"
  },
  {
    "text": "Microsoft laid off a DEI team, and its lead wrote an internal email blasting how DEI is ‘no longer business critical’  — Microsoft laid off a diversity, equity, and inclusion team, citing “changing business needs.”  — The move follows commitments made by Microsoft and other tech firms after the George Floyd protests.",
    "url": "https://www.businessinsider.com/microsoft-layoffs-dei-leader-email-2024-7"
  },
  {
    "text": "Donald Trump doesn't have stitches after assassination attempt, but a “nice flesh wound,” Eric Trump says  —  Former President Donald Trump's son, Eric Trump, said his father doesn't have stitches after he was shot in an assassination attempt at a rally in Pennsylvania over the weekend … ",
    "url": "https://www.cbsnews.com/news/assassination-attempt-trump-rally-shooting-ear-doesnt-have-stitches-nice-flesh-wound-eric-trump/"
  },
  {
    "text": "Organizers expect enough signatures to ask Nebraska voters to repeal private school funding law  —  Public school advocates believe they have enough signatures to ask Nebraska voters in November to repeal a law that provides taxpayer money for private school tuition, marking the latest twist … ",
    "url": "https://apnews.com/article/private-school-choice-nebraska-ballot-3b73fe065060b753d2f2a0b8a7682dab"
  },
  {
    "text": "MAGA Makes Racist Attacks Against JD Vance's Wife  —  Extremist figures and members of the Make America Great Again movement have criticized the  —  named him as his running mate in the 2024 election.  —  Usha Vance, the daughter of Indian immigrants, was raised in San Diego before meeting her husband at Yale Law School.",
    "url": "https://www.newsweek.com/jd-vance-wife-attacks-maga-trump-running-mate-1926194"
  },
  {
    "text": "Megadonors Are Plotting to Change Biden's Mind With Money.  Will It Work?  —  They're calling politicians.  They're dangling money to members of Congress.  But major Democratic donors who want President Biden to step aside are also learning the limits of their powers.",
    "url": "https://www.nytimes.com/2024/07/17/us/politics/biden-democratic-donors-trump.html"
  },
  {
    "text": "The extraordinary duplicity of Musk's $180 million donation to support Trump  —  Billionaire Elon Musk will reportedly spend $180 million to encourage former President Donald Trump supporters in swing states to vote absentee, a practice Musk has publicly described as “insane,” “too risky,” and a recipe for “large-scale fraud.”",
    "url": "https://popular.info/p/the-extraordinary-duplicity-of-musks"
  },
  {
    "text": "The MAGA Plan to End Free Weather Reports  —  Project 2025 would all but dissolve the National Oceanic and Atmospheric Administration.  —  In the United States, as in most other countries, weather forecasts are a freely accessible government amenity.  The National Weather Service issues alerts … ",
    "url": "https://www.theatlantic.com/science/archive/2024/07/noaa-project-2025-weather/678987/"
  },
  {
    "text": "Venezuelan Citizen Pleads Guilty to Possessing Fraudulent Green Card  —  For Immediate Release  —  U.S. Attorney's Office, Middle District of Georgia  —  Sibling and Roommate also Face Federal Charges for Allegedly Having Fake Identifications  —  MACON, Ga. - A Venezuelan citizen admitted … ",
    "url": "https://www.justice.gov/usao-mdga/pr/venezuelan-citizen-pleads-guilty-possessing-fraudulent-green-card"
  }
]