[
  {
    "text": "If Trump Wants War With Iran, Let's Hear From Congress First  —  As President Trump considers pulling American forces into a risky and unpredictable new war in the Middle East, it's time for the legislative branch to step up.  U.S. lawmakers should insist the president obtain a new war authorization … ",
    "url": "https://www.nytimes.com/2025/06/18/opinion/trump-iran-war-congress.html"
  },
  {
    "text": "Iran Is Preparing Missiles for Possible Retaliatory Strikes on U.S. Bases, Officials Say  —  American commanders have put troops on high alert throughout the region as fears of a wider war grow.  —  Iran has prepared missiles and other military equipment for strikes on U.S. bases … ",
    "url": "https://www.nytimes.com/2025/06/17/us/politics/iran-israel-us-bases.html?unlocked_article_code=1.Pk8.KsL_.N4D1U_alczh0&smid=url-share"
  },
  {
    "text": "Inside the clashes between Trump and Gabbard  —  The director of national intelligence has rankled Trump with her statements about nuclear war, and the president has suggested she's off message.  —  As President Donald Trump privately mulled joining Israel's campaign against Iran this month … ",
    "url": "https://www.politico.com/news/2025/06/17/gabbard-trump-00411685"
  },
  {
    "text": "US spies said Iran wasn't building a nuclear weapon.  Trump dismisses that assessment  —  Tulsi Gabbard left no doubt when she testified to Congress about Iran's nuclear program earlier this year.  The country was not building a nuclear weapon, the national intelligence director told lawmakers … ",
    "url": "https://apnews.com/article/gabbard-trump-intelligence-iran-nuclear-program-51c8d85d536f8628870c110ac05bb518"
  },
  {
    "text": "How Trump Shifted on Iran Under Pressure From Israel  —  President Trump spent the first months of his term holding back Israel's push for an assault on Iran's nuclear program.  With the war underway, his posture has gyrated as he weighs sending in the U.S. military.",
    "url": "https://www.nytimes.com/2025/06/17/us/politics/trump-iran-israel-nuclear-talks.html?unlocked_article_code=1.Pk8.yX3k.QsVcm1X7gVTt&smid=url-share"
  },
  {
    "text": "Trump's MAGA purity test  —  Ten years after Donald Trump hijacked the GOP with a promise to burn down the establishment, his own movement is warning him not to go soft.  —  Why it matters: On two core articles of faith — no foreign wars and no protections for unauthorized immigrants … ",
    "url": "https://www.axios.com/2025/06/18/trump-maga-purity-tests"
  },
  {
    "text": "Homeland Security Secretary Kristi Noem transported by ambulance to DC-area hospital, sources say  —  Homeland Security Secretary Kristi Noem was transported by ambulance on Tuesday to a hospital in Washington, DC, two sources familiar with the matter told CNN.",
    "url": "https://cnn.com/2025/06/17/politics/kristi-noem-hostpital"
  },
  {
    "text": "Brad Lander Is Arrested by ICE Agents at Immigration Courthouse  —  Mr. Lander, the New York City comptroller and a candidate for mayor, was handcuffed as he tried to steer a man past Immigration and Customs Enforcement officers.  —  Brad Lander, the New York City comptroller who is running for mayor … ",
    "url": "https://www.nytimes.com/2025/06/17/nyregion/brad-lander-immigration-ice.html"
  },
  {
    "text": "Comptroller Brad Lander arrested at ICE court hearing  —  City Comptroller Brad Lander was arrested and accosted by masked federal agents at immigration court in Lower Manhattan.  —  The city's elected financial watchdog, and a Democratic candidate for mayor, appeared at 26 Federal Plaza … ",
    "url": "https://www.amny.com/news/brad-lander-arrested-ice-court-hearing-06172025/"
  },
  {
    "text": "NYC Mayoral Candidate Brad Lander Latest Victim of ICE Violence  —  The New York City comptroller was assisting a man in immigration court when masked agents arrested him.  —  APTOPIX New York Immigration Court Arrest  —  New York City Comptroller Brad Lander is placed under arrest … ",
    "url": "https://prospect.org/justice/2025-06-17-brad-lander-arrested-ice-immigration/"
  },
  {
    "text": "Far-Right ‘Appeal to Heaven’ Flag Flown Above Government Agency in DC  —  The “Appeal To Heaven” flag, a popular symbol for Christian nationalists that was waved by January 6 rioters, was raised over the Small Business Administration headquarters last week.  —  A controversial “Appeal to Heaven” … ",
    "url": "https://www.wired.com/story/far-right-appeal-to-heaven-flag-sba-government-agency-dc/"
  },
  {
    "text": "Trump Makes More Monstrous Changes to the White House  —  TACKY  —  The president isn't content ripping up the Rose Garden and splashing the Oval Office with gold.  —  Donald Trump continued his White House overhaul Tuesday after announcing the installation of two giant flag poles … ",
    "url": "https://www.thedailybeast.com/trump-makes-more-monstrous-changes-to-the-white-house/"
  },
  {
    "text": "Hospitals stunned by Senate GOP's Medicaid plan  —  Republicans want to curtail taxes states have imposed to increase payments to hospitals.  —  One of the most powerful lobbies in Washington is redoubling its efforts to avoid a cut to Medicaid payments in the GOP's megabill.",
    "url": "https://www.politico.com/news/2025/06/17/hospitals-senate-medicaid-megabill-taxes-00410769"
  },
  {
    "text": "Senate passes landmark crypto regulation bill on a bipartisan vote, sending it to the House  —  The 68-30 vote on the GENIUS Act marked the first time that the Senate has passed major legislation regulating digital assets.  —  WASHINGTON — After weeks of stops and starts … ",
    "url": "https://www.nbcnews.com/politics/congress/senate-passes-landmark-crypto-regulation-bill-bipartisan-vote-sending-rcna213437"
  },
  {
    "text": "Trump set to grant another extension to avoid TikTok disruption  —  The social media platform is technically prohibited under U.S. law unless it can find an American buyer.  —  President Donald Trump will extend a deadline for the owner of social media platform TikTok to find a U.S. buyer … ",
    "url": "https://www.nbcnews.com/news/us-news/trump-extension-tiktok-rcna213625"
  },
  {
    "text": "Truck carrying tank after Army's 250th birthday parade kills pedestrian in DC  —  The accident occurred on the evening of June 16.  —  A truck carrying one of the Army M1 Abrams tanks that participated in President Donald Trump's parade in honor of the service's 250th birthday struck and killed a woman in Washington.",
    "url": "https://www.usatoday.com/story/news/politics/2025/06/17/army-tank-kills-dc-pedestrian-birthday-parade/84246151007/"
  },
  {
    "text": "California court upholds John Eastman's disbarment for role in Trump 2020 plot  —  Eastman's “false narrative” about the 2020 results undermined American elections and the legal system, the court wrote.  —  A California court has upheld a recommendation that attorney John Eastman should lose … ",
    "url": "https://www.politico.com/news/2025/06/17/california-court-john-eastman-disbarment-00411266"
  },
  {
    "text": "‘Insensitive, to say the least’: Mike Lee deletes Minnesota posts amid GOP criticism  —  Utah Sen. Mike Lee, amid widespread outrage, has deleted a pair of social media posts associating the deadly Minnesota shootings last weekend with “Marxists” and the state's Democratic governor.",
    "url": "https://www.politico.com/live-updates/2025/06/17/congress/kevin-cramer-blasts-mike-lee-posts-00410547"
  },
  {
    "text": "Senators Assail Antidoping Regulator for ‘Stonewalling and Intimidation’  —  Members of both parties criticized the World Anti-Doping Agency for its decision not to sanction Chinese swimmers who tested positive for a banned substance, including some who went on to win Olympic medals.",
    "url": "https://www.nytimes.com/2025/06/17/us/politics/senate-swimmers-antidoping-regulator.html"
  },
  {
    "text": "ICE detained University of Utah student after gaining secret access to Colorado deputy's communications, sheriff's office says  —  Caroline Dias Goncalves, 19, has been detained in an immigration center for nearly two weeks since she was pulled over on June.  5.",
    "url": "https://www.sltrib.com/news/education/2025/06/17/ice-detains-utah-student-after/"
  },
  {
    "text": "Trump's Conflicting Messages on Workplace Raids Leave Businesses Reeling  —  Trump officials insist the president is fully committed to mass deportation.  But they have been careful not to directly contradict the president's attempt to offer a reprieve to certain businesses.",
    "url": "https://www.nytimes.com/2025/06/17/us/politics/trump-conflicting-messages-workplace-raids.html"
  },
  {
    "text": "Why a Vaccine Expert Left the C.D.C.: ‘Americans Are Going to Die’  —  Dr. Fiona Havers is influential among researchers who study immunizations.  The wholesale dismissal of the agency's scientific advisers crossed the line, she said.  —  In 13 years at the Centers for Disease Control and Prevention … ",
    "url": "https://www.nytimes.com/2025/06/18/health/havers-cdc-vaccines-kennedy.html"
  },
  {
    "text": "These centrist women on a group chat are leading Democrats in 2025  —  Abigail Spanberger, Mikie Sherrill and Elissa Slotkin, who ascended during President Donald Trump's first term in 2018, are playing major roles for their party this year, in governor's races and beyond.",
    "url": "https://www.washingtonpost.com/politics/2025/06/18/spanberger-slotkin-sherrill-democrats-women-2025/"
  },
  {
    "text": "Senate Democrats Are Letting Trump's Judicial Nominees Off the Hook  —  On Sunday, 11 days after the Senate Judiciary Committee held confirmation hearings for President Donald Trump's first batch of judicial nominees, the committee published the nominees' answers to follow-up questions posed by the committee's members.",
    "url": "https://ballsandstrikes.org/nominations/trump-judicial-nominees-senate-democrats-off-the-hook/"
  },
  {
    "text": "Family says baby delivered through C-section from Georgia mom who was declared brain dead  —  Family members said Adriana Smith will be taken off life support this week. … ATLANTA — The family of Adriana Smith, a metro Atlanta nurse who was declared brain dead in February while pregnant, said her baby boy has arrived.",
    "url": "https://www.11alive.com/article/news/health/adriana-smith-baby-born-life-support-update-brain-dead-nicu/85-1fb6595c-3966-4a50-993d-0e36e05cb256"
  }
]