[
  {
    "text": "ICE arrests Palestinian activist who led Columbia University protests, lawyer says  —  A prominent Palestinian activist who helped lead Columbia University's 2024 student encampment protests was arrested Saturday night in New York City by federal immigration authorities who claimed they were acting … ",
    "url": "https://www.cbsnews.com/newyork/news/ice-arrest-mahmoud-khalil-palestinian-activist-columbia-protests/"
  },
  {
    "text": "Immigration Authorities Arrest Pro-Palestinian Activist at Columbia  —  Mahmoud Khalil, who recently completed a graduate program at Columbia, has legal permanent residency, his lawyer said.  —  Federal immigration authorities on Saturday detained a well-known activist who played a major role … ",
    "url": "https://www.nytimes.com/2025/03/09/nyregion/ice-arrests-palestinian-activist-columbia-protests.html"
  },
  {
    "text": "Immigration agents arrest Palestinian activist who helped lead Columbia University protests  —  Federal immigration authorities arrested a Palestinian activist Saturday who played a prominent role in Columbia University's protests against Israel, a significant escalation in the Trump administration's pledge … ",
    "url": "https://apnews.com/article/columbia-university-mahmoud-khalil-ice-15014bcbb921f21a9f704d5acdcae7a8"
  },
  {
    "text": "BREAKING: DHS Detains Palestinian Student from Columbia Encampment, Advocates Say  —  On Saturday, Department of Homeland Security (DHS) officers detained Mahmoud Khalil - a recent Columbia University graduate who helped lead the Gaza solidarity encampment - at his New York City home … ",
    "url": "https://zeteo.com/p/breaking-dhs-detains-palestinian"
  },
  {
    "text": "Trump won't rule out a recession in 2025  —  “I hate to predict things like that,” Trump said when pressed about the possibility of a recession during a recorded interview that aired on “Sunday Morning Futures with Maria Bartiromo.”  —  President Donald Trump is confident that the country's economy … ",
    "url": "https://www.politico.com/news/2025/03/09/trump-recession-tariffs-2025-economy-00220016"
  },
  {
    "text": "Massive turnout at Democratic lawmakers' town halls as Republicans hide from voters  —  As Republican lawmakers dodge in-person town halls, avoiding direct engagement with voters furious over the Trump administration's devastating policies, LGBTQ+ Democrats like Washington Rep. Emily Randall … ",
    "url": "https://www.advocate.com/politics/huge-turnout-democratic-town-halls"
  },
  {
    "text": "Liberal leadership race: Mark Carney elected by landslide to be next prime minister  —  Political newcomer promises to ‘fight’ for Canadian economy, sovereignty  —  Who is Mark Carney, Canada's next prime minister?  —  How Mark Carney went from his upbringing in Alberta to central banker … ",
    "url": "https://www.cbc.ca/news/politics/livestory/liberal-leadership-race-mark-carney-elected-by-landslide-to-be-next-prime-minister-9.6678061"
  },
  {
    "text": "US added to international watchlist for rapid decline in civic freedoms  —  Civicus, an international non-profit, puts country alongside Democratic Republic of Congo, Italy, Pakistan and Serbia  —  The United States has been added to the Civicus Monitor Watchlist, which identifies countries … ",
    "url": "https://www.theguardian.com/us-news/2025/mar/09/watchlist-decline-civic-freedoms-civicus"
  },
  {
    "text": "Israel cuts off electricity supply to Gaza, affecting a desalination plant producing drinking water  —  Israel cut off the electricity supply to Gaza, officials said Sunday, affecting a desalination plant producing drinking water for part of the arid territory.  Hamas called it part of Israel's “starvation policy.”",
    "url": "https://apnews.com/article/gaza-israel-palestinians-war-news-ba90f0de3d4f64a1762d1a39f787817f"
  },
  {
    "text": "Britain urged to form breakaway ‘Four Eyes’ alliance without the US after Trump's ‘unprecedented’ decision to block intelligence sharing with Ukraine  —  Britain must develop a ‘Four Eyes’ intelligence sharing alliance in response to Donald Trump's actions over Ukraine, defence sources have said.",
    "url": "https://www.dailymail.co.uk/news/article-14477803/Britain-urged-form-breakaway-Four-Eyes-alliance-without-US-Trumps-unprecedented-decision-block-intelligence-sharing-Ukraine.html"
  },
  {
    "text": "Rubio and Musk turn on Polish foreign minister in spat over Starlink use in Ukraine: ‘Be quiet small man’  —  Secretary of State presses on with Trump administration's efforts to make European nations profess gratitude … Your support helps us to tell the story",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/rubio-musk-poland-starlink-twitter-ukraine-b2711840.html"
  },
  {
    "text": "Athol Fugard, South African Playwright Who Dissected Apartheid, Dies at 92  —  In works that included “Blood Knot,” “Sizwe Banzi Is Dead” and “The Island,” he exposed the realities of racial separatism in his homeland.  —  Athol Fugard, the South African playwright whose portrayals … ",
    "url": "https://www.nytimes.com/2025/03/09/obituaries/athol-fugard-dead.html?unlocked_article_code=1.204.JalK.tPVAnzHGp_vd"
  },
  {
    "text": "Ukrainian journalist Victoria Roshchyna died after savage torture and extreme emaciation in Russian captivity  —  The 27-year-old journalist, who lived for her work, had travelled to occupied Zaporizhzhia oblast in order to find out about Russia's torture prisons on occupied territory",
    "url": "https://khpg.org/en/1608814479"
  },
  {
    "text": "Real chilling effects  —  Normally I record the classes I teach.  It gives students who miss class a chance to catch up.  I also make space in my classes to talk about what is happening in government right now.  A couple of weeks ago, students asked we keep the discussions, but stop recording the class.",
    "url": "https://donmoynihan.substack.com/p/real-chilling-effects"
  },
  {
    "text": "Zuckerberg's Meta considered sharing user data with China, whistleblower alleges  —  Meta went to extreme lengths, including developing a censorship system, in a failed attempt to bring Facebook to millions of internet users in China, according to a whistleblower complaint.",
    "url": "https://www.washingtonpost.com/technology/2025/03/09/meta-china-censorship-facebook-mark-zuckerberg/"
  },
  {
    "text": "WATCH: Vice President JD Vance confronts Cincinnati protesters, condemns them on social media  —  CINCINNATI — Video shared with WCPO shows Vice President JD Vance interacting with Cincinnati protesters headed to a Walnut Hills rally Saturday.  —  Vance posted on X condemning the protesters … ",
    "url": "https://www.wcpo.com/news/government/local-politics/youre-a-s-t-person-vp-jd-vance-condemns-protesters-allegedly-following-him-near-his-walnut-hills-home"
  },
  {
    "text": "Howard County resident who traveled internationally has confirmed case of measles  —  MDH: This measles case not associated with outbreak in Texas, New Mexico  —  A positive case of measles was confirmed in a Howard County resident who recently traveled internationally, according to health officials.",
    "url": "https://www.wbaltv.com/article/measles-confirmed-case-maryland-howard-county/64111796"
  }
]