[
  {
    "text": "Harris plans to use ABC debate time even if Trump doesn't show up  —  Vice President Kamala Harris is planning to show up for the previously agreed-upon debate set for September 10 on ABC - even if Donald Trump does not, a source familiar with the matter tells CNN.",
    "url": "https://www.cnn.com/2024/08/03/politics/kamala-harris-donald-trump-debate/"
  },
  {
    "text": "Trump claims new debate deal as Harris urges sticking to existing date  —  The Harris campaign was baffled by Trump's claims that he had struck a deal for a new debate on Fox.  —  Republican presidential nominee Donald Trump claimed late Friday night to have struck a deal for a new debate … ",
    "url": "https://www.washingtonpost.com/politics/2024/08/03/trump-harris-debate-abc-fox/"
  },
  {
    "text": "Trump calls off ABC debate, suggests Fox News face-off instead  —  In a Truth Social post late Friday night, Trump wrote that the Sept. 10 debate on ABC was “terminated.”  —  Former President Donald Trump pulled out of the only scheduled debate with Democratic frontrunner Kamala Harris, proposing a new debate on Fox News on his terms.",
    "url": "https://www.politico.com/news/2024/08/03/trump-calls-off-abc-debate-suggests-fox-news-face-off-instead-00172554"
  },
  {
    "text": "Jimmy Carter's next goal is voting for Kamala Harris for president  —  The former president is ‘more alert and interested in politics’ in recent days, his family says  —  As former President Jimmy Carter nears his 100th birthday, his milestone celebration isn't on his mind.  —  Defeating Donald Trump is.",
    "url": "https://www.ajc.com/politics/jimmy-carters-next-goal-is-voting-for-kamala-harris/UKCLDIUSSJC6JM4NP7HGOEDCNY/"
  },
  {
    "text": "Jimmy Carter says he's hoping to vote for Kamala Harris as 100th birthday approaches  —  WASHINGTON - Former President Jimmy Carter told family that as he approaches his milestone 100th birthday this fall that he's holding on to vote in the presidential election.",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/08/03/jimmy-carter-kamala-harris-vote-100/74657161007/"
  },
  {
    "text": "Jimmy Carter Says He's Hanging On to Vote for Kamala Harris  —  BIRTHDAY WISH  —  As the 39th U.S. President's 100th birthday nears, Jimmy Carter told his family from hospice care that his ultimate goal is to vote for Kamala Harris before he passes.  —  As his 100th birthday nears … ",
    "url": "https://www.thedailybeast.com/jimmy-carter-says-hes-hanging-on-to-vote-for-kamala-harris-as-100th-birthday-nears"
  },
  {
    "text": "With Vance's elevation, Pennsylvania voters reexamine Trump's views on women  —  “Now that you've got Kamala in there, you've got a whole different ballgame,” one independent Pennsylvania voter said.  —  BUCKS COUNTY, Pa. — More than a week after Kamala Harris's debut as the likely Democratic … ",
    "url": "https://www.washingtonpost.com/politics/2024/08/03/with-vances-elevation-pennsylvania-voters-reexamine-trumps-views-women/"
  },
  {
    "text": "Many Voters Say Kamala Harris's Race Is Not an Important Issue  —  Even as Trump plays up racial divisions, many Americans said they would rather not dwell on race or identity.  “We can all see that you're Black.”  —  “Obviously, we have eyes.”  —  That was the somewhat jaded response … ",
    "url": "https://www.nytimes.com/2024/08/03/us/kamala-harris-race-trump.html"
  },
  {
    "text": "Trump team gambles on new ground game capitalizing on loosened rules  —  The campaign is joining forces with outside groups such as Turning Point Action after regulators cleared the way for more coordination.  But it comes with the risk of untested outfits duplicating efforts or working at cross purposes.",
    "url": "https://www.washingtonpost.com/politics/2024/08/03/trump-allies-ground-game/"
  },
  {
    "text": "Why she should pick Shapiro  —  Silver Bulletin Subscriber Questions, Edition #11A.  —  ∙ Paid  —  Welcome to Edition #11A of Silver Bulletin Subscriber Questions.  I'm going to do something slightly unusual here and break this into two parts.  This half consists of a single long answer … ",
    "url": "https://www.natesilver.net/p/why-she-should-pick-shapiro"
  },
  {
    "text": "Election 2024 live updates  —  Trump asserts new debate deal ahead of a rally in Atlanta  —  Republican presidential nominee Donald Trump is asserting that he and Vice President Harris had agreed to debate on Sept. 4 on Fox News — a move that the Harris campaign is disputing.",
    "url": "https://www.washingtonpost.com/politics/2024/08/03/2024-election-campaign-updates-harris-trump/"
  },
  {
    "text": "Defense Secretary Revokes Plea Deal for Accused Sept. 11 Plotters  —  Defense Secretary Lloyd J. Austin III assumed direct oversight of the case and effectively put the death penalty back on the table.  —  Defense Secretary Lloyd J. Austin III on Friday relieved the overseer of the war court … ",
    "url": "https://www.nytimes.com/2024/08/02/us/politics/911-plotters-plea-deal.html?unlocked_article_code=1.AE4.HKWp.ZcD3F2UPP4xi&smid=url-share"
  },
  {
    "text": "More Than Half of Americans Think the First Amendment Provides Too Many Rights  —  More than half of Americans believe the First Amendment can go too far in the rights it guarantees, according to a new survey from the Foundation for Individual Rights and Expression (FIRE), a First Amendment-focused nonprofit.",
    "url": "https://reason.com/2024/08/03/more-than-half-of-americans-think-the-first-amendment-provides-too-many-rights/"
  },
  {
    "text": "Trump and Harris go all-in to make Pennsylvania the new Florida … - The Trump and Harris 2024 presidential campaigns are set to spend more than double on advertising in Pennsylvania than in any of the other six swing states, according to an Axios analysis of AdImpact data.",
    "url": "https://www.axios.com/2024/08/03/trump-harris-pennsylvania-ad-spending-president"
  },
  {
    "text": "How JD Vance Thinks About Power  —  Mr. Vance has been blunt about wanting to break norms and test constitutional limits to execute his ideas: “We have to get pretty wild, pretty far out there.”  —  Mr. Vance has been blunt about wanting to break norms and test constitutional limits to execute his ideas … ",
    "url": "https://www.nytimes.com/2024/08/03/us/politics/jd-vance-donald-trump-2024-campaign.html?unlocked_article_code=1.AE4.248B.wGb1x66odz0i&smid=url-share"
  },
  {
    "text": "Mussolini, Trump and What Assassination Attempts Really Do  —  A scholar of Mussolini and authoritarianism explains how failed attacks can be used to consolidate power.  —  On April 7, 1926, Fascist leader Benito Mussolini gave a speech to a conference of surgeons, and then began walking with his aides through the streets of Rome.",
    "url": "https://www.politico.com/news/magazine/2024/08/03/assassination-attempts-mussolini-trump-00171825"
  }
]