[
  {
    "text": "Pardoned Jan. 6 Rioter Already Rearrested on Gun Charges  —  Trump granted clemency to hundreds of alleged or convicted violent criminals.  One is back behind bars … In May 2023, Daniel Ball of Homosassa, Florida, was indicted on 12 counts related to his participation in the attack on the Capitol.",
    "url": "https://www.rollingstone.com/politics/politics-news/jan-6-rioter-pardoned-trump-rearrested-gun-charges-1235243994/"
  },
  {
    "text": "“F—k it: Release 'em all”: Why Trump embraced broad Jan. 6 pardons … - Trump vacillated during an internal debate over targeted clemency vs. a blanket decision according to two insiders.  — But as Trump's team wrestled with the issue, and planned a shock-and-awe batch of executive orders Day 1 … ",
    "url": "https://www.axios.com/2025/01/22/trump-pardons-jan6-clemency"
  },
  {
    "text": "US military ordering thousands more troops to southern border  —  Thousands of additional active duty US troops are being ordered to the southern US border with Mexico, just two days after President Donald Trump mandated that the US military step up its presence there, according to officials familiar with the matter.",
    "url": "https://www.cnn.com/2025/01/22/politics/us-military-troops-southern-border/"
  },
  {
    "text": "Justice Department orders investigation of local compliance with Trump immigration crackdown  —  The Justice Department has ordered federal prosecutors to investigate state or local officials who they believe are interfering with the Trump administration's crackdown on immigration … ",
    "url": "https://apnews.com/article/justice-department-immigration-enforcement-f0e3fc616da9746796378d1cd6385b1b"
  },
  {
    "text": "U.S. border agents told to summarily deport migrants without asylum hearings under Trump edict  —  Washington — Citing President Trump's extraordinary move to close the American asylum system, U.S. border agents have been instructed to summarily deport migrants crossing into the country … ",
    "url": "https://www.cbsnews.com/news/trump-deportations-migrants-border-asylum-hearings/"
  },
  {
    "text": "Trump Revokes Workplace Discrimination Rules Enacted By LBJ In 1965  —  The new president just unwound a landmark anti-discrimination measure implemented amid the height of the Civil Rights Movement.  —  LOADING  —  On Wednesday, President Donald Trump revoked a six-decade-old executive order designed … ",
    "url": "https://www.huffpost.com/entry/trump-executive-order-discrimination-lbj_n_67914b7ce4b0835f2b834b9c"
  },
  {
    "text": "Trump warns he'll adjourn Congress to make recess appointments.  How would that work?  —  President Trump is threatening to use his powers to adjourn Congress so he can make recess appointments for at least some of his top Cabinet nominees and their deputies, enabling them to begin running the largest federal departments.",
    "url": "https://www.cbsnews.com/news/trump-recess-appointments-adjourning-congress/"
  },
  {
    "text": "No recess till Trump gets his Cabinet, top GOP senators say  —  Top Senate Republicans are vowing to stay in session until all of President Donald Trump's Cabinet nominees are confirmed — a pledge that could keep senators in Washington for weeks due to Democratic delay tactics.",
    "url": "https://www.politico.com/live-updates/2025/01/22/congress/trump-cabinet-senate-recess-00200069"
  },
  {
    "text": "Announcing The Stargate Project  —  The Stargate Project is a new company which intends to invest $500 billion over the next four years building new AI infrastructure for OpenAI in the United States.  We will begin deploying $100 billion immediately.  This infrastructure will secure American leadership … ",
    "url": "https://openai.com/index/announcing-the-stargate-project/"
  },
  {
    "text": "Convicted US Capitol rioter turns down Trump pardon  —  One of the people who served jail time for taking part in the US Capitol riot four years ago has refused a pardon from President Donald Trump, saying: “We were wrong that day.”  —  Pamela Hemphill, who pleaded guilty and was sentenced … ",
    "url": "https://www.bbc.com/news/articles/cvged988377o"
  },
  {
    "text": "Trump pulls back Biden drug pricing action  —  TRUMP PULLS BACK BIDEN DRUG PRICING EO — The Trump administration's first drug pricing action — rescinding a Biden executive order encouraging Medicare to help lower prescription costs — is befuddling drug pricing experts.",
    "url": "https://www.politico.com/newsletters/prescription-pulse/2025/01/22/trump-pulls-back-biden-drug-pricing-action-00199717"
  },
  {
    "text": "Jamie Dimon says Trump's tariff policy is positive for national security so people should ‘get over it’ … WATCH NOW  —  JPMorgan Chase CEO Jamie Dimon said Wednesday that the looming tariffs that President Donald Trump is expected to slap on U.S. trading partners could be viewed positively.",
    "url": "https://www.cnbc.com/2025/01/22/jamie-dimon-on-trumps-tariffs-get-over-it.html"
  },
  {
    "text": "Trump administration cancels travel for refugees already cleared to resettle in the US  —  Refugees who had been approved to travel to the United States before a deadline next week suspending America's refugee resettlement program have had their travel plans canceled by the Trump administration.",
    "url": "https://apnews.com/article/refugees-flights-trump-immigration-border-resettlement-33ebaa34bc4d0c069a22ee7aa5f8ff6d"
  },
  {
    "text": "Trump Seeks to Paralyze Independent Privacy and Civil Liberties Watchdog  —  The Trump White House has told three Democratic-selected members of the Privacy and Civil Liberties Oversight Board to resign or be fired, which would stop the independent agency from functioning.",
    "url": "https://www.nytimes.com/2025/01/22/us/trump-privacy-civil-liberties-oversight-board.html"
  },
  {
    "text": "How to Stop Trump in One Stupid Chart  —  For reasons I can't explain, this entire newsletter feels like it was written in ALL CAPS.  So maybe you'll imagine me shouting it at you, like a crazy person.  —  Because basically, that's how I feel right now: Like a crazy person.  Maybe you do, too?",
    "url": "https://www.thebulwark.com/p/how-to-stop-trump-in-one-stupid-chart"
  },
  {
    "text": "House Republicans create new panel aimed at undermining Jan. 6 committee  —  Days after Trump pardoned the Capitol's violent attackers, Rep. Barry Loudermilk (R-Ga.) will lead a new subcommittee investigating what led to the attack.  —  Speaker Mike Johnson has launched a new effort intended … ",
    "url": "https://www.politico.com/news/2025/01/22/jan-6-committee-trump-election-00199990"
  },
  {
    "text": "Hegseth's Former Sister-in-Law Says He Believed Women Shouldn't Vote  —  That tracks with the tenets of a religious movement he's involved in.  —  On Tuesday, NBC broke the story of a sworn testimony from the ex-sister-in-law of Pete Hegseth, President Trump's pick for the US Secretary of Defense.",
    "url": "https://www.motherjones.com/politics/2025/01/hegseths-former-sister-in-law-says-he-believed-women-shouldnt-vote/"
  },
  {
    "text": "Biden's letter to Trump revealed: ‘May God bless you and guide you’  —  Trump teased he may release ‘very nice’ letter from Biden  —  The letter that former President Joe Biden wrote to President Donald Trump upon leaving office on Monday has been exclusively obtained by Fox News.",
    "url": "https://www.foxnews.com/politics/bidens-letter-trump-revealed-may-god-bless-you-guide-you"
  },
  {
    "text": "160 national security staffers are sent home as the White House aligns its team to Trump's agenda  —  President Donald Trump's national security adviser has sidelined about 160 National Security Council aides, sending them home while the administration reviews staffing and tries to align … ",
    "url": "https://apnews.com/article/trump-national-security-council-staffers-d167985d61c96dd278b0e58a402ff865"
  },
  {
    "text": "Antioch High School on lockdown: Two people are dead, one stable  —  NASHVILLE, Tenn. (WTVF) — Two students are dead and another student was injured after a shooting inside Antioch High School on Wednesday.  —  According to police, two students were shot by another in the cafeteria.",
    "url": "https://www.newschannel5.com/news/police-two-students-shot-at-antioch-high-school-shooter-turned-gun-on-themself"
  },
  {
    "text": "CBS 58 weather reporter Sam Kuffel is out after criticizing Elon Musk arm gesture  —  Daniel Bice Mary SpicuzzaMilwaukee Journal Sentinel  —  A Milwaukee TV weather forecaster has been dropped by her station one day after she criticized Elon Musk on social media for his straight-arm gesture that many have likened to a Nazi salute.",
    "url": "https://www.jsonline.com/story/news/politics/2025/01/22/cbs-58s-sam-kuffel-is-out-after-criticizing-elon-musk-arm-gesture/77883983007/"
  }
]