[
  {
    "text": "Arizona Republicans denounce revived 1864 abortion ban in sudden reversal  —  As the party struggles to talk about abortion, response marks fastest and strongest rebuke of bans since the fall of Roe  —  Hours after Arizona's supreme court declared on Tuesday that a 160-year-old abortion ban … ",
    "url": "https://www.theguardian.com/us-news/2024/apr/10/arizona-republicans-against-state-abortion-ban"
  },
  {
    "text": "Fox News buries court decision implementing a near-total abortion ban in Arizona  —  None of the network's evening “opinion” shows mentioned it at all  —  RESEARCH CONTRIBUTIONS FROM HARRISON RAY & TYLER MONROE  —  Fox News' evening “opinion” hosts completely ignored Tuesday's ruling … ",
    "url": "https://www.mediamatters.org/fox-news/fox-news-buries-court-decision-implementing-near-total-abortion-ban-arizona"
  },
  {
    "text": "Trump says he wouldn't sign federal abortion ban  —  Former President Donald Trump on Wednesday said he would not sign a federal abortion ban if one reached his desk were he to be elected in November.  —  It's Trump's firmest response to date on a national abortion ban.",
    "url": "https://www.cnn.com/2024/04/10/politics/trump-says-he-wouldnt-sign-federal-abortion-ban"
  },
  {
    "text": "‘Catastrophic,’ ‘a shock’: Arizona's abortion ruling threatens to upend 2024 races  —  State Supreme Court rules a near-total ban from 1864 can go into effect in a battleground state that could play an outsize role in the presidential election and help determine which party controls the U.S. Senate next year",
    "url": "https://www.washingtonpost.com/elections/2024/04/10/arizona-abortion-ban-politics-election/"
  },
  {
    "text": "Trump says Arizona abortion ruling went too far  —  The former president predicted that Arizona's governor and others “are going to bring it back into reason.”  —  Former President Donald Trump said Wednesday that Arizona's Supreme Court went too far in ruling the state's 160-year-old near-total abortion ban can be enforced.",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-says-arizona-abortion-ruling-went-far-rcna147217"
  },
  {
    "text": "Donald Trump's first criminal trial is nearly here — and he's already starting to melt down  —  Trump is very worried about his election interference case for good reason  —  There's been some talk lately about Donald Trump's light campaign schedule compared to President Joe Biden … ",
    "url": "https://www.salon.com/2024/04/10/donald-first-criminal-trial-is-nearly-here--and-hes-already-starting-to-melt-down/"
  },
  {
    "text": "Former Trump executive Allen Weisselberg sentenced to 5 months in jail for lying in civil fraud case  —  Allen Weisselberg, a retired executive in Donald Trump's real estate empire, was sentenced on Wednesday to five months in jail for lying under oath during his testimony in the civil fraud lawsuit brought … ",
    "url": "https://apnews.com/article/weisselberg-trump-perjury-new-york-b76cde56c6cb983ab8789f95d5a0c6c0"
  },
  {
    "text": "Trump's Ex-Finance Chief Is Sentenced to 5 Months in Rikers for Perjury  —  Allen H. Weisselberg admitted that he had lied about helping Donald J. Trump inflate his net worth to win favorable loan terms.  —  Allen H. Weisselberg, Donald J. Trump's longtime financial lieutenant … ",
    "url": "https://www.nytimes.com/2024/04/10/nyregion/allen-weisselberg-sentenced-trump.html"
  },
  {
    "text": "RFK Jr. sounds like Trump as he courts MAGA voters … - Kennedy is now drawing fire from Trump and other conservatives who once hailed Kennedy's campaign. … - “This is a humanitarian crisis because of the understanding across the globe that we now have an open border here,” … ",
    "url": "https://www.axios.com/2024/04/10/kennedy-trump-maga-biden-voters"
  },
  {
    "text": "Cornel West chooses Black Lives Matter activist Melina Abdullah as his vice president  —  The independent candidate needs a VP pick to gain access to the ballot in a number of states.  —  Cornel West tapped university professor and prominent Black Lives Matter activist Melina Abdullah … ",
    "url": "https://www.politico.com/news/2024/04/10/cornel-west-black-lives-matter-activist-melina-abdullah-vice-president-00151525"
  },
  {
    "text": "Inflation Continues to Climb (Paul Krugman Hardest Hit)  —  Inflation refuses to go away quietly.  The CPI numbers out today are raising concerns that we may not see the soft landing we were hoping for. … The DOW is down more than 500 points today in response to the news.",
    "url": "https://hotair.com/john-s-2/2024/04/10/inflation-continues-to-climb-paul-krugman-hardest-hit-n3786261"
  },
  {
    "text": "Scoop: Biden plans order to limit southern border crossings by end of month … But Biden, briefed on polls of rising voter anger, wants a dramatic step. … - Biden would use authority in Section 212(f) of the Immigration and Nationality Act, which gives the president broad leeway … ",
    "url": "https://www.axios.com/2024/04/10/biden-border-executive-order-immigrants-asylum-limit"
  },
  {
    "text": "Klain on Biden: He is focused too much on bridges  —  The former chief of staff praised the president's accomplishments.  But he also wondered whether he had the right focus.  —  Former White House chief of staff Ron Klain openly questioned President Joe Biden's political strategy Tuesday night … ",
    "url": "https://www.politico.com/news/2024/04/09/ron-klain-joe-biden-infrastructure-00151438"
  },
  {
    "text": "Trump's deeply misogynist lie about moms killing babies  —  It reveals a fear of women's empowerment he shares with the Christian right. … On Monday, Donald Trump released a video announcing his much heralded abortion “policy.”  The statement was typically garbled, deliberately vague, and chock full of absurd assertions.",
    "url": "https://www.publicnotice.co/p/trump-abortion-statement-lie-moms-killing-babies"
  },
  {
    "text": "Elon Musk picks his speech battle  —  Happy Wednesday!  Hope your eyes are recovering.  Send news tips to: will.oremus@washpost.com.  —  Though Elon Musk often insists his goal with X is to promote free speech, his actions have rarely been those of the “free-speech absolutist” he once claimed to be.",
    "url": "https://www.washingtonpost.com/politics/2024/04/10/elon-musk-picks-his-speech-battle/"
  },
  {
    "text": "Tied California House race heading to a recount  —  A spokesperson for one of the tied candidates blasted the recount request as “a page right out of Trump's political playbook.”  —  SACRAMENTO, California — Officials in Santa Clara County are gearing up for a recount in the wild race … ",
    "url": "https://www.politico.com/news/2024/04/09/tied-california-house-race-heading-to-a-recount-00151424"
  },
  {
    "text": "Missing Florida GOP leader trashed hotel room while family searched for him  —  After George Riley Jr. was kicked out of a Kissimmee hotel and later found by Osceola County sheriff's deputies, he apologizes. … While family and friends distributed posters of a missing Republican Party … ",
    "url": "https://www.tampabay.com/news/florida/2024/04/09/missing-florida-gop-leader-trashed-hotel-room-while-family-searched-him/"
  },
  {
    "text": "Trump supporters trying to recall Wisconsin GOP leader failed, elections review concludes  —  MADISON, Wis. (AP) — The effort by supporters of former President Donald Trump to recall Wisconsin's top elected Republican did not gather enough signatures to trigger the recall election and therefore … ",
    "url": "https://apnews.com/article/wisconsin-assembly-recall-speaker-trump-vos-826350a3aaff12e9c290b50ea7f8ca30"
  },
  {
    "text": "Congress must let Ukraine win, say Barbra Streisand, Sean Penn, Imagine Dragons, Timothy Snyder and other luminaries  —  Opinion by more than 35 artists, activists, scholars and others … CNN  —  Together we call upon Congress to do the right thing.  —  Ukrainians are fighting for their existence.",
    "url": "https://www.cnn.com/2024/04/10/opinions/sean-penn-barbra-streisand-imgaine-dragons-congress-ukraine-snyder/"
  },
  {
    "text": "Joe Biden campaign responds to Wes Allen; says president will be on ballot in all 50 states  —  President Joe Biden's campaign has responded to Alabama Secretary of State Wes Allen's letter that notified the Democratic Party that its national convention will be too late to get its presidential nominee … ",
    "url": "https://www.al.com/news/2024/04/joe-biden-campaign-responds-to-wes-allen-says-president-will-be-on-ballot-in-all-50-states.html"
  },
  {
    "text": "Nuclear deal in tatters, Iran edges close to weapons capability  —  Six years after the Trump administration withdrew from the Iran nuclear accord, Tehran is rapidly accumulating enriched uranium, some of it very close to weapons grade.  Experts fear that a bomb could be a short dash away.",
    "url": "https://www.washingtonpost.com/national-security/2024/04/10/iran-nuclear-bomb-iaea-fordow/"
  },
  {
    "text": "Texas Dem suggests Black people shouldn't pay taxes as form of reparations: ‘Puts money back in your pocket’  —  Rep Jasmine Crockett says the proposal may not be as popular as ‘actually giving out dollars’  —  A House Democrat recently suggested that Black Americans should be exempt … ",
    "url": "https://www.foxnews.com/politics/texas-dem-suggests-black-people-pay-taxes-form-reparations-puts-money-pocket"
  },
  {
    "text": "GOP rep mocks Navy over backward scope in Instagram pic  —  Rep. Mike Collins (R-Ga.) mocked the Navy Wednesday for posting a photo of a commanding officer holding an assault weapon with a backward scope, which has since been removed from social media.  —  Collins posted Wednesday … ",
    "url": "https://thehill.com/homenews/house/4585502-gop-rep-mocks-navy-over-backwards-scope-in-instagram-pic/"
  },
  {
    "text": "House Republicans are in chaos again, fighting over a key surveillance tool  —  The House GOP is working to reauthorize FISA Section 702, a spying power that the White House says is key to national security.  But some conservatives and Donald Trump oppose it.",
    "url": "https://www.nbcnews.com/politics/congress/house-republicans-are-chaos-fighting-key-surveillance-tool-rcna147175"
  },
  {
    "text": "German police arrest Iraqi couple suspected of genocide for enslaving Yazidi girls  —  German police have arrested an Iraqi couple alleged to be Islamic State members, on suspicion of genocide and crimes against humanity for enslaving two Yazidi girls, federal prosecutors said on Wednesday.",
    "url": "https://www.reuters.com/world/german-police-arrest-iraqi-couple-suspected-genocide-enslaving-yazidi-girls-2024-04-10/"
  },
  {
    "text": "Consumers will finally see FCC-mandated ‘nutrition labels’ for most broadband plans … Starting on Wednesday, all but the smallest ISPs will be required to publish broadband “nutrition labels” on all of their plans, the regulator announced.  The FCC's intention behind the labels … ",
    "url": "https://www.theverge.com/2024/4/10/24125572/fcc-broadband-nutrition-labels-isp-deadline-today"
  }
]