[
  {
    "text": "Trump ends speculation on another debate: ‘There will be no rematch’  —  The former president is turning down both invitations from Fox News and CNN.  —  Donald Trump is making it clear: He doesn't want a second debate, regardless of which network is hosting.",
    "url": "https://www.politico.com/news/2024/10/09/trump-harris-debate-no-rematch-00183179"
  },
  {
    "text": "Harris Calls Into The Weather Channel After Trump Declined Their Call  —  MEDIA BLITZ CONTINUES  —  Kamala Harris called into The Weather Channel on Wednesday to speak about Hurricane Milton ahead of its evening landfall—an appearance the network said was also offered to Donald Trump, but he ignored it.",
    "url": "https://www.thedailybeast.com/harris-calls-into-the-weather-channel-after-trump-declined-their-call"
  },
  {
    "text": "Obama Heads to Pennsylvania to Give Harris a Jolt of Democratic Energy  —  The former president, one of the party's most popular figures, will rally in Pittsburgh for Kamala Harris, as her campaign deploys its most influential surrogates in a push to get out the vote.",
    "url": "https://www.nytimes.com/2024/10/10/us/politics/obama-pittsburgh-rally-harris.html"
  },
  {
    "text": "'I don't want to be nice': Trump ramps up personal attacks on Harris at Pennsylvania rally  —  Trump's campaign event in Scranton, the birthplace of President Joe Biden, was the first of two in the battleground state Wednesday less than four weeks before Election Day.",
    "url": "https://www.nbcnews.com/politics/2024-election/trump-ramps-personal-attacks-kamala-harris-scranton-rally-rcna174292"
  },
  {
    "text": "Is the Trump campaign's male-dominated culture losing women votes?  —  The campaign views men as Trump's path to victory, and many staffers talk like it.  —  Soon after Donald Trump's campaign team took over the Republican National Committee earlier this year, a senior Trump aide was asked … ",
    "url": "https://www.washingtonpost.com/politics/2024/10/10/is-trump-campaigns-male-dominated-culture-losing-women-votes/"
  },
  {
    "text": "Democrats start to hit the panic button  —  Democrats' nerves are at an all-time high.  —  Two months ago — even a month ago — they were feeling bullish about Vice President Harris's prospects of defeating former President Trump.  —  But now, with less than a month to go until Election Day … ",
    "url": "https://thehill.com/homenews/campaign/4922690-democrats-nervous-kamala-harris-campaign/"
  },
  {
    "text": "Swing State Poll 2024: Pennsylvania, Michigan, Wisconsin: Blue Wall Shows Cracks As Race Tightens, Quinnipiac University Poll Finds; U.S. Senate Races: Michigan Moves To Toss-Up, Dems Lead In PA & WI  —  mail_outline  —  PENNSYLVANIA: Harris 49%, Trump 46%, other candidates 2%",
    "url": "https://poll.qu.edu/poll-release?releaseid=3913"
  },
  {
    "text": "Republicans Appear Poised to Take Control of Senate, New Poll Shows  —  The latest polling from The New York Times and Siena College shows Republicans leading in key Senate races in Montana, Texas and Florida.  —  Control of the Senate appears likely to flip from the Democratic Party … ",
    "url": "https://www.nytimes.com/2024/10/10/us/politics/senate-polls-montana-florida-texas.html"
  },
  {
    "text": "Meteorologists Get Death Threats as Hurricane Milton Conspiracy Theories Thrive  —  It's their job to warn residents about destructive storms — but political polarization has made them targets online  —  As Hurricane Milton approaches Florida, meteorologists are staying awake for days … ",
    "url": "https://www.rollingstone.com/culture/culture-features/hurricane-milton-misinformation-meteorlogist-death-threats-1235130352/"
  },
  {
    "text": "Tim Walz Rally Goes Live on World of Warcraft Twitch Stream  —  This is the latest chapter of the Kamala Harris campaign's effort to reach young male voters.  —  Kamala Harris' campaign is livestreaming a Tim Walz rally from Arizona and Azeroth tonight.  Yes, Azeroth—the planet from World of Warcraft.",
    "url": "https://www.wired.com/story/tim-walz-rally-world-of-warcraft-twitch/"
  },
  {
    "text": "“Severely compromised”: Experts warn right-wing SCOTUS justices may “seek to intervene” in election  —  “People are underestimating how messy this could get,” expert says amid growing election-related litigation  —  Supreme Court watchers increasingly worry that the 2024 election between … ",
    "url": "https://www.salon.com/2024/10/09/severely-compromised-experts-warn-right-wing-scotus-justices-may-seek-to-intervene-in/"
  },
  {
    "text": "Trump ‘Bidenomics’ ad shows a Philly-area mom who really supports Kamala Harris  —  Kimberly Burrell sat among a group of loved ones of Philadelphia's gun violence victims in July for an interview with a national television reporter.The gathering took place around the anniversary of the death … ",
    "url": "https://www.inquirer.com/opinion/donald-trump-political-ad-kimberly-burrell-20241009.html"
  },
  {
    "text": "JD Vance Owns Company That Sells American Real Estate to Foreign Investors?  —  The Ohio senator's venture capital fund invested in the app AcreTrader.  —  In early October 2024, several social media accounts supporting U.S. Vice President Kamala Harris shared a copypasta meme alleging … ",
    "url": "https://www.snopes.com/news/2024/10/08/jd-vance-acretrader/"
  },
  {
    "text": "Harris Campaign Names Republicans Who Voted Against FEMA Funding  —  who voted against Federal Emergency Management Agency (FEMA) funding two weeks ago.  —  The vote was part of a $20 billion package on September 25.  The bill passed both the House and Senate",
    "url": "https://www.newsweek.com/kamala-harris-republicans-voting-against-fema-1965493"
  },
  {
    "text": "Dozens of Democrats join push to strong-arm Mike Johnson … - Johnson, however, said during a trip to North Carolina on Wednesday that “it will take some time” for states to calculate the extent of their financial need.  — Pointing to the stopgap spending bill the House passed last month … ",
    "url": "https://www.axios.com/2024/10/09/dozens-of-democrats-join-push-to-strong-arm-mike-johnson"
  },
  {
    "text": "Susan Rice: Trump's reported calls with Putin appear illegal  —  Former White House adviser and United Nations ambassador Susan Rice called out former President Trump over a report that he has spoken with Russian President Vladimir Putin at least seven times since leaving office, suggesting such calls would violate the Logan Act.",
    "url": "https://thehill.com/policy/international/4924145-susan-rice-trump-putin-logan-act/"
  },
  {
    "text": "Trump Spreads His Politics of Grievance to Nonwhite Voters  —  Eight years ago, he won over many white voters, who were often called the forgotten Americans.  Now, he hopes to make inroads with Black and Latinos by stoking resentments and pointing to scapegoats.",
    "url": "https://www.nytimes.com/2024/10/10/us/politics/trump-spreads-his-politics-of-grievance-to-nonwhite-voters.html"
  },
  {
    "text": "Readout of President Joe Biden's Call with Prime Minister Netanyahu of Israel  —  President Biden spoke this morning with Prime Minister Netanyahu of Israel.  Vice President Harris joined the call.  The President affirmed his ironclad commitment to Israel's security.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/10/09/readout-of-president-joe-bidens-call-with-prime-minister-netanyahu-of-israel-9/"
  },
  {
    "text": "Trump Pledges to End ‘Double Taxation’ of Americans Abroad  —  The idea is the latest from Republican nominee that goes beyond extending 2017 tax law  —  WASHINGTON—Republican presidential nominee Donald Trump said he supports lowering taxes on U.S. citizens who live abroad … ",
    "url": "https://www.wsj.com/politics/policy/donald-trump-tax-plan-americans-abroad-a74bfbdd"
  },
  {
    "text": "Election Live Updates: Campaigns Swarm Sun Belt, With Early Voting Starting in Arizona  —  No candidate has ever raised so much money so fast.  And it's more than former President Donald J. Trump has announced raising in all of 2024.  —  Here's the latest on the presidential race.",
    "url": "https://www.nytimes.com/live/2024/10/09/us/harris-trump-election"
  }
]