[
  {
    "text": "Hegseth had an unsecured internet line set up in his office to connect to Signal, AP sources say  —  Defense Secretary Pete Hegseth had an internet connection that bypassed the Pentagon's security protocols set up in his office to use the Signal messaging app on a personal computer … ",
    "url": "https://apnews.com/article/hegseth-signal-chat-dirty-internet-line-6a64707f10ca553eb905e5a70e10bd9d"
  },
  {
    "text": "Polygraph Threats, Leaks and Infighting: Pentagon Chaos Rattles Hegseth  —  Defense secretary has chastised top military officers and staffers as he seeks to quiet a storm he helped create  —  WASHINGTON—Defense Secretary Pete Hegseth was rattled.  —  Word had leaked that he was planning … ",
    "url": "https://www.wsj.com/politics/national-security/pete-hegseth-pentagon-fired-aides-cfa9e0d5?st=2DDS8u"
  },
  {
    "text": "Trump to target ActBlue in presidential memorandum  —  The action is expected to come Thursday.  —  In a shot at ActBlue, the left's major online donation platform, President Donald Trump plans to sign a presidential memorandum on Thursday cracking down on foreign contributions in American elections … ",
    "url": "https://www.politico.com/news/2025/04/24/trump-to-target-actblue-in-presidential-memorandum-00307251"
  },
  {
    "text": "Trump to target Democratic fundraising powerhouse ActBlue with DOJ probe  —  President Donald Trump is slated to issue a memorandum on Thursday targeting ActBlue, the Democratic Party's main fundraising platform - taking aim at one of the key pillars of the financial infrastructure for Democratic candidates.",
    "url": "https://cnn.com/2025/04/24/politics/actblue-trump-memo-doj-probe/"
  },
  {
    "text": "Fox News Poll: The first 100 days of President Trump's second term  —  82% are extremely or very concerned about inflation, down from 89% in January  —  As Donald Trump approaches the 100th day of his second term, a Fox News survey finds voters pleased with the job he is doing on border security … ",
    "url": "https://www.foxnews.com/official-polls/fox-news-poll-first-100-days-president-trumps-second-term"
  },
  {
    "text": "Trump Lashes Out at Rupert Murdoch Over Fox News' ‘Trump Hating, Fake Pollster’ After Survey Reveals Record-Low Approval Ratings  —  President also calls on media mogul to make changes at Wall Street Journal: ‘It sucks’  —  President Trump is unhappy with Fox News Channel again … ",
    "url": "https://variety.com/2025/tv/news/trump-rupert-murdoch-fox-news-poll-record-low-approval-1236377066/"
  },
  {
    "text": "72% of American Jews disapprove of Donald Trump's performance so far, poll finds … Nearly three quarters of American Jews disapprove of the job Donald Trump is doing as president and most dislike how he is handling antisemitism in the United States, according to a new survey.",
    "url": "https://www.jta.org/2025/04/24/politics/72-of-american-jews-disapprove-of-donald-trumps-performance-so-far-poll-finds"
  },
  {
    "text": "Trump Tells Putin to ‘STOP!’  After Deadly Russian Attack on Kyiv  —  The attack, which killed at least 12 people, was the deadliest on Ukraine's capital in nearly a year.  President Trump called on President Vladimir V. Putin to “STOP!” in a post on social media.",
    "url": "https://www.nytimes.com/2025/04/24/world/europe/ukraine-kyiv-russia-attack.html"
  },
  {
    "text": "U.S. Sidelines Lawyers Who Doubted Their Own Case on Congestion Pricing  —  The Trump administration replaced lawyers who had exposed flaws in its legal battle over New York City's congestion pricing program.  —  The U.S. Department of Transportation on Thursday said it took the extraordinary step … ",
    "url": "https://www.nytimes.com/2025/04/24/nyregion/nyc-congestion-pricing-duffy-lawyers.html?unlocked_article_code=1.CE8.vgqL.VKDKYVyrggAf"
  },
  {
    "text": "How Trump team turned a dinner invite into a crypto boon worth millions  —  Nearly two dozen crypto wallets acquired more than 100,000 $TRUMP meme coins, worth roughly $100 million, after its promoters said top buyers could join the president for dinner.  —  Buyers have poured tens of millions … ",
    "url": "https://www.washingtonpost.com/technology/2025/04/24/trump-trump-memecoin-cryto/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ1NDY3MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ2ODQ5NTk5LCJpYXQiOjE3NDU0NjcyMDAsImp0aSI6ImU2MzFmMjVlLTQ2NWYtNGJiZi05ZGYyLTQ3ODFiMzk0NGYzOCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS90ZWNobm9sb2d5LzIwMjUvMDQvMjQvdHJ1bXAtdHJ1bXAtbWVtZWNvaW4tY3J5dG8vIn0.twE8VExxCbf2pw4qfDwExNmPBhsGSNgyP24sMZeSoqE&itid=gfta"
  },
  {
    "text": "Judge halts parts of Trump's overhaul of US elections, including proof-of-citizenship requirement  —  A judge on Thursday blocked the Trump administration from immediately enacting certain changes to how federal elections are run, including adding a proof-of-citizenship requirement to the federal voter registration form.",
    "url": "https://apnews.com/article/trump-elections-executive-order-citizenship-lawsuit-4b683fe2e1106316fdb05621be9b7d0e"
  },
  {
    "text": "Elon Musk and DOGE's Savings May Be Erased by New Costs  —  An expert on the federal work force estimates that the speed and chaos of Mr. Musk's cuts to the bureaucracy will cost taxpayers $135 billion this fiscal year.  —  President Trump and Elon Musk promised taxpayers big savings … ",
    "url": "https://www.nytimes.com/2025/04/24/us/politics/musk-cuts.html?unlocked_article_code=1.CE8.vMmE.oMshBwTC3mC8&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "The Untold Story of How Ed Martin Ghostwrote Online Attacks Against a Judge — and Still Became a Top Trump Prosecutor  —  Martin's career is dotted with ethical and professional questions, records show.  Some of the most serious ones about the interim U.S. attorney for D.C. have remained buried … ",
    "url": "https://www.propublica.org/article/ed-martin-trump-interim-dc-us-attorney-secret-judge-attacks"
  },
  {
    "text": "Trump pardons Nevada politician who paid for her plastic surgery with funds to honor a slain officer  —  President Donald Trump has pardoned a Nevada Republican politician who was awaiting sentencing on federal charges that she used money meant for a statue honoring a slain police officer for personal costs, including plastic surgery.",
    "url": "https://apnews.com/article/trump-pardon-michele-fiore-nevada-fraud-cf56ef8b302b8111e47cf52d5a606d19"
  },
  {
    "text": "Trump officials consider shrinking 6 national monuments in the West  —  Interior Department officials are considering scaling back the boundaries of national monuments in the West to encourage energy development on public lands.  —  Trump officials are analyzing whether to remove federal protections … ",
    "url": "https://www.washingtonpost.com/climate-environment/2025/04/24/trump-national-monument-reductions-mining-oil/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ1NDY3MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ2ODQ5NTk5LCJpYXQiOjE3NDU0NjcyMDAsImp0aSI6ImQzOWVjOGMzLTZjNmItNDk5ZC04NDJiLTMxYTIyOWUwYWExNiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9jbGltYXRlLWVudmlyb25tZW50LzIwMjUvMDQvMjQvdHJ1bXAtbmF0aW9uYWwtbW9udW1lbnQtcmVkdWN0aW9ucy1taW5pbmctb2lsLyJ9.wP-Fnw4MScMLmpVidhArWpAqfbxFCGOsnZwfIe623K4&itid=gfta"
  },
  {
    "text": "Trump grants interview to The Atlantic's Jeffrey Goldberg despite Signal chat bombshell, past criticism  —  He has attacked The Atlantic editor for what he claims are false stories.  —  President Donald Trump waits for the arrival of Norway's Prime Minister Jonas Gahr Store to the White House on April 24, 2025.",
    "url": "https://abcnews.go.com/Politics/trump-meet-atlantics-jeffrey-goldberg-interview-despite-signal/story?id=121128726"
  },
  {
    "text": "Trump admin must seek return of another man who was improperly deported to El Salvador, judge rules  —  A Trump-appointed judge ruled that the administration deported a 20-year-old Venezuelan man last month in violation of a legally binding, court-approved settlement agreement.",
    "url": "https://www.politico.com/news/2025/04/24/trump-el-salvador-deportation-venezuelan-minor-judge-00307336"
  },
  {
    "text": "Trump to be in third-tier seats at Pope's funeral  —  Arcane Vatican protocol suggests US president may have to settle for a place away from the limelight  —  Donald Trump may be the most famous person on the planet and leader of the free world, but he could be deeply disappointed when he sees … ",
    "url": "https://www.telegraph.co.uk/news/2025/04/24/trump-to-be-in-third-tier-seats-at-popes-funeral/"
  },
  {
    "text": "If A.I. Systems Become Conscious, Should They Have Rights?  —  As artificial intelligence systems become smarter, one A.I. company is trying to figure out what to do if they become conscious.  —  One of my most deeply held values as a tech columnist is humanism.",
    "url": "https://www.nytimes.com/2025/04/24/technology/ai-welfare-anthropic-claude.html?https://www.nytimes.com/2025/04/24/technology/ai-welfare-anthropic-claude.html"
  },
  {
    "text": "Slotkin is testing a ‘war plan’ to beat Trump.  She wants Dems to ditch wokeness and muscle up  —  The Michigan senator will give the first in a series of political speeches on Thursday.  —  Elissa Slotkin, the former CIA analyst turned battleground senator, will on Thursday start road-testing … ",
    "url": "https://www.politico.com/news/2025/04/24/slotkin-has-a-war-plan-to-beat-trump-dont-be-weak-and-woke-00308176"
  },
  {
    "text": "Controversial Hegseth chief of staff to leave Pentagon  —  Joe Kasper will continue to support and advise the Pentagon, he said, but as a special government employee.  —  Defense Secretary Pete Hegseth's controversial chief of staff, who played a central role in a recent power struggle … ",
    "url": "https://www.politico.com/news/2025/04/24/hegseth-chief-of-staff-pentagon-leaving-00308721"
  },
  {
    "text": "Runaway Tren  —  How a Colorado slumlord's psyop turned into a brand-new ‘forever war’ on Venezuela  —  Earlier this month, a middle-aged woman with shaggy, silvery hair and a pleasant smoker's contralto flew from Denver to Washington to testify before the House Judiciary Committee.",
    "url": "https://prospect.org/justice/2025-04-24-runaway-tren-de-aragua-colorado-housing-gangs/"
  },
  {
    "text": "One of Trump's billionaire supporters has harsh words for the president about his trade war  —  Citadel CEO Ken Griffin, a billionaire supporter of President Donald Trump and a megadonor to Republican candidates, had some unusually harsh words for the president about his trade war … ",
    "url": "https://cnn.com/2025/04/24/business/ken-griffin-trump-trade-war-brand"
  },
  {
    "text": "Federal Officials Promise to Restore Funding to Women's Health Initiative  —  Investigators had been informed that funding for the decades-long research effort would be slashed.  Officials said on Thursday evening that grants would be restored.  —  Following an outcry from scientists and health experts … ",
    "url": "https://www.nytimes.com/2025/04/24/health/womens-health-initiative-cuts.html?unlocked_article_code=1.CE8.2prR._hhjEWBLktfy&smid=nytcore-android-share"
  },
  {
    "text": "Trump says the U.S. and China are ‘actively’ discussing tariffs.  Beijing says that's false.  —  Global concern is growing amid a U.S.-China standoff over high tariff levels that amount to a mutual trade embargo between the world's two largest economies.  —  HONG KONG — China … ",
    "url": "https://www.nbcnews.com/news/world/tariff-trade-war-china-beijing-trump-washington-us-economy-markets-rcna202535"
  },
  {
    "text": "Pentagon to resume medical care for transgender troops  —  The move is another setback for Defense Secretary Pete Hegseth, who has made culture war issues a major part of his role.  —  The Pentagon will resume gender-affirming care for transgender service members, according to a memo obtained by POLITICO … ",
    "url": "https://www.politico.com/news/2025/04/24/transgender-troops-military-care-00306827"
  },
  {
    "text": "Trump Is a Virus  —  Chaos is about to take its toll  —  Hammering out a few words before getting on the bike.  —  It has been amazing to watch the stock market gyrating in response to things that aren't even policy changes — they're hints and rumors of policy changes.",
    "url": "https://paulkrugman.substack.com/p/trump-is-a-virus"
  },
  {
    "text": "US judge blocks Trump from withholding funds from 16 ‘sanctuary’ cities, counties  —  A federal judge on Thursday blocked Donald Trump's administration from withholding federal funding from more than a dozen so-called sanctuary jurisdictions that have declined to cooperate with the Republican president's hardline immigration crackdown.",
    "url": "https://www.reuters.com/legal/us-judge-blocks-trump-withholding-funds-16-sanctuary-cities-counties-2025-04-24/"
  },
  {
    "text": "Wrong turn leads to hundreds of immigrant arrests at the Detroit-Canada border bridge  —  Warning: this story contains description of a suicide attempt.  —  The road that leads to the Ambassador Bridge, which connects Detroit to Canada, is notoriously difficult to navigate, even for locals.",
    "url": "https://www.npr.org/2025/04/24/nx-s1-5374937/immigrant-arrests-detroit-canada-border-bridge-detention"
  },
  {
    "text": "Rubio eliminates office that oversees climate talks  —  The Office of Global Change was notified Thursday that it would be shuttered.  —  The State Department is eliminating the Office of Global Change, which oversees international climate change negotiations for the United States.",
    "url": "https://www.politico.com/news/2025/04/24/rubio-eliminates-climate-office-00308505"
  },
  {
    "text": "‘The Democratic Party in Florida is dead’: Top Florida Senate Dem leaves party  —  Pizzo's announcement is just the latest blow for Florida's beleaguered Democratic Party.  —  TALLAHASSEE, Florida — State Senate Minority Leader Jason Pizzo said Thursday he is leaving the Democratic Party … ",
    "url": "https://www.politico.com/news/2025/04/24/florida-pizza-democrats-unaffiliated-departure-legislature-00308629"
  },
  {
    "text": "21 Years Later, Deported Back to a ‘Home’ He Barely Knew  —  As Trump's deportation efforts get underway, I set out to answer two questions: What is it like to be deported from the United States?  And what is it like for deported immigrants to reintegrate into their home countries?",
    "url": "https://www.nytimes.com/2025/04/24/nyregion/deportation-trump-jamaica.html?unlocked_article_code=1.CE8.z8eo.YCyaeMxjC0be&smid=url-share"
  }
]