[
  {
    "text": "'I'm a black NAZI!':  NC GOP nominee for governor made dozens of disturbing comments on porn forum  —  Editor's Note: The below story contains offensive language.  —  Mark Robinson, the controversial and socially conservative Republican nominee for governor of North Carolina … ",
    "url": "https://www.cnn.com/2024/09/19/politics/kfile-mark-robinson-black-nazi-pro-slavery-porn-forum"
  },
  {
    "text": "Robinson comments leave North Carolina Republicans reeling  —  An explosive report Thursday that North Carolina GOP gubernatorial candidate Mark Robinson made many offensive statements on a porn site's message board has Republicans in the state reeling and Democrats on offense.",
    "url": "https://thehill.com/homenews/campaign/4889585-north-carolina-gop-candidate-mark-robinson-scandal/"
  },
  {
    "text": "Robinson under pressure to withdraw from gubernatorial race  —  North Carolina Republicans are bracing Thursday morning as word spreads about a damning news story looming regarding Lt. Gov. Mark Robinson.  —  Sources with direct knowledge have spoken with Carolina Journal on the condition … ",
    "url": "https://www.carolinajournal.com/robinson-under-pressure-to-withdraw-from-gubernatorial-race/"
  },
  {
    "text": "North Carolina GOP defends Robinson following explosive CNN report  —  The North Carolina Republican Party released a statement Thursday evening defending its gubernatorial nominee, Lt. Gov. Mark Robinson, after an explosive report about him was released.  —  “Mark Robinson has categorically denied … ",
    "url": "https://thehill.com/homenews/campaign/4889881-north-carolina-gop-mark-robinson-cnn-report/"
  },
  {
    "text": "Email address belonging to Mark Robinson found on Ashley Madison  —  An adviser to the North Carolina Republican confirmed the email address belongs to him.  —  An email address belonging to North Carolina Lt. Gov. Mark Robinson was registered on Ashley Madison, a website designed for married people seeking affairs.",
    "url": "https://www.politico.com/news/2024/09/19/north-carolina-lt-governor-mark-robinson-ashley-madison-00180107"
  },
  {
    "text": "Sabato's Crystal Ball shifts North Carolina gubernatorial race toward Democrats amid Robinson controversy  —  The political forecasting site Larry Sabato's Crystal Ball shifted the North Carolina gubernatorial race Thursday toward Democrats amid an unfolding controversy involving Lt. Gov. Mark Robinson, the Republican candidate.",
    "url": "https://thehill.com/homenews/state-watch/4889411-north-carolina-governor-race-shifts-democrats/"
  },
  {
    "text": "Nuzzi's RFK Relationship  —  “Had the magazine been aware of this relationship, she would not have continued to cover the presidential campaign,” the spokesperson said. … “Recently our Washington Correspondent Olivia Nuzzi acknowledged to the magazine's editors that she had engaged … ",
    "url": "https://www.status.news/p/olivia-nuzzi-rfk-new-york-magazine"
  },
  {
    "text": "Mike Johnson bypassed a second time with rare maneuver … - In May, a discharge petition led by Rep. Greg Steube (R-Fla.) attained the necessary 218 signatures to force a House vote on legislation providing tax relief to victims of natural disasters.  — The last time a discharge petition succeeded … ",
    "url": "https://www.axios.com/2024/09/19/discharge-petition-social-security-mike-johnson"
  },
  {
    "text": "Kentucky sheriff charged in killing of judge at courthouse  —  A judge in a rural Kentucky county was shot and killed in his courthouse chambers Thursday, and the local sheriff was charged with murder, police said.  The preliminary investigation indicates Letcher County Sheriff Shawn M. Stines … ",
    "url": "https://apnews.com/article/courthouse-shooting-kentucky-f93419fff14202a88e28b5ea49b26810"
  },
  {
    "text": "Kentucky judge shot and killed in his chambers, suspect in custody: Officials  —  District Judge Kevin Mullins was killed at the Letcher County Courthouse.  —  Kentucky judge Kevin Mullins was shot and killed in his chambers on Thursday, according to officials.",
    "url": "https://abcnews.go.com/US/kentucky-judge-shot-killed-in-chambers/story?id=113856879"
  },
  {
    "text": "With abortion in focus, Harris's event with Oprah prompts cheers and tears  —  Winfrey introduced celebrities and shepherded an audience that was both live and on Zoom between energetic applause and somber reflection.  —  FARMINGTON HILLS, Mich. — A star-studded online rally designed … ",
    "url": "https://www.washingtonpost.com/politics/2024/09/20/harris-oprah-winfrey-zoom-rally/"
  },
  {
    "text": "New Court Filings Place Matt Gaetz at a Party at the Center of the Sex Trafficking Scandal  —  This is the first public filing that cites sworn testimony alleging that Gaetz attended one of the long-rumored parties with a teenage girl.  — Copy  —  Rep. Matt Gaetz attended a drug-fueled sex party … ",
    "url": "https://www.notus.org/florida/new-court-filings-matt-gaetz-dorworth-sex-party"
  },
  {
    "text": "Trump tells Jewish audience Israel will be ‘eradicated’ if he doesn't win  —  Trump spoke at a campaign event on “Fighting Anti-Semitism in America.”  —  Former President and Republican presidential candidate Donald Trump speaks at the Israeli-American Council National Summit in Washington, D.C., on Sept. 19, 2024.",
    "url": "https://abcnews.go.com/Politics/trump-israel-eradicated-win/story?id=113853150"
  },
  {
    "text": "Trump Falsely Accusing Harris Of Using Hacked Material - Which Is Exactly What He Did In 2016  —  Trump has successfully persuaded many Americans that his campaign's collusion with Russia in 2016 was a “hoax.”  It was not.  —  WASHINGTON — Donald Trump on Thursday falsely accused Vice … ",
    "url": "https://www.huffpost.com/entry/trump-harris-hack-iran-russia_n_66ec6351e4b083d40a2c8910"
  },
  {
    "text": "It's Not Just Haitians In Springfield.  Mass Immigration Is Destroying The American Nation  —  We argue about illegal immigration, but we should be arguing about assimilation and what it means to be a nation.  —  After the presidential debate last Tuesday night, J.D. Vance told CNN's Kaitlin Collins … ",
    "url": "https://thefederalist.com/2024/09/19/its-not-just-haitians-in-springfield-mass-immigration-is-destroying-the-american-nation/"
  },
  {
    "text": "Local Teamsters unions in swing states rush to endorse Harris  —  The powerful national union declared this week that it would not endorse a Democrat for the first time in nearly three decades.  —  A wave of local and regional Teamsters union branches in battleground states rushed … ",
    "url": "https://www.washingtonpost.com/business/2024/09/19/teamsters-endorsement-harris-trump/"
  },
  {
    "text": "Harris Leads Trump by 13 Points, 55-42%, Similar to 53-39% in August; In Multi-Candidate Race, Harris Leads by 12 Points, Same as August  — Voters Trust Harris More on Abortion, Democracy, Economy; Immigration Tied  — Gillibrand Leads Sapraicone 54-31%; NYS Proposed ERA Favored 64-23%",
    "url": "https://scri.siena.edu/2024/09/19/harris-leads-trump-by-13-points-55-42-similar-to-53-39-in-august-in-multi-candidate-race-harris-leads-by-12-points-same-as-august/"
  },
  {
    "text": "Secret Service probing Musk's post about Biden, Harris assassination attempts … - “The Secret Service is aware of the social media post made by Elon Musk and as a matter of practice, we do not comment on matters involving protective intelligence,” Secret Service spokesperson Melissa McKenzie said in a statement to Axios.",
    "url": "https://www.axios.com/2024/09/19/elon-musk-secret-service-assassination-post"
  },
  {
    "text": "UH-OH: The slowest mail in the country is in key swing states, NBC investigations finds  —  Tens of thousands of voters were disenfranchised by slow mail in 2020  —  In 2020, when the United States Postal Service began an ambitious plan to modernize and consolidate services … ",
    "url": "https://www.nbcnewyork.com/news/national-international/slowest-mail-in-country-key-swing-states-nbc-investigation/5810571/"
  },
  {
    "text": "Casey leading McCormick in Pennsylvania Senate polling  —  Pennsylvania Sen. Bob Casey (D) is leading his Republican rival Dave McCormick in new Keystone State polling.  —  In a new poll from The Philadelphia Inquirer/The New York Times/Siena College, Casey garnered 49 percent support … ",
    "url": "https://thehill.com/homenews/campaign/4889171-casey-leads-mccormick-pennsylvania-poll/"
  },
  {
    "text": "Kamala Harris is doing more press interviews, if you look closely  —  New York CNN  —  For several weeks after Kamala Harris became the Democratic nominee for president, media observers and critics questioned her decision to remain inaccessible to the press.",
    "url": "https://www.cnn.com/2024/09/19/media/kamala-harris-press-strategy-local-media"
  },
  {
    "text": "WATCH: Nancy Mace Spices Up House Hearing With Ice-Cold Dish of Revenge Against Woke CNN Panelist  —  We've got a lot of serious things going on in this country, some of which undoubtedly weigh heavily on one's emotions, mind, and soul.  —  So, with that in mind, I thought some lighter fare would be in order.",
    "url": "https://redstate.com/sister-toldjah/2024/09/19/watch-nancy-mace-spices-up-congressional-hearing-with-ice-cold-dish-of-revenge-against-woke-cnn-panelist-n2179538"
  },
  {
    "text": "Dem Rep. Jared Moskowitz Publicly Mocks James Comer's Stalled Biden Probe  —  ‘CONCEPTS OF IMPEACHMENT’  —  Florida's Jared Moskowitz held up Comer's 300-page report while also making a dig at Donald Trump.  —  Florida Rep. Jared Moskowitz landed a two-in-one dig at Republicans during … ",
    "url": "https://www.thedailybeast.com/dem-rep-jared-moskowitz-publicly-mocks-james-comers-stalled-biden-probe"
  }
]