[
  {
    "text": "Trump Pushes Forward in 2024 Run Amid Indictments and Colorado Ruling  —  This week's debate over his very eligibility for office served as a stark reminder that anyone else facing such a wide array of legal problems would have left the political stage long ago.  —  In another era, a politician would have walked away.",
    "url": "https://www.nytimes.com/2023/12/23/us/politics/trump-legal-challenges.html"
  },
  {
    "text": "Canada's Trudeau says a second Trump presidency could harm climate goals  —  Canadian Prime Minister Justin Trudeau said in an interview that if former President Trump were reelected, it could cause harm for climate goals.  —  Trudeau expressed to the Canadian Broadcasting Corporation (CBC) … ",
    "url": "https://thehill.com/policy/energy-environment/4375031-trudeau-second-trump-presidency-could-harm-climate-goals/"
  },
  {
    "text": "Scaramucci on Trump's rhetoric compared to Hitler: 'It's a total dog whistle'  —  Former Trump communications director Anthony Scaramucci claimed former President Trump's remarks that drew comparisons to Adolf Hitler, “Mein Kampf” and Nazi Germany are “a total dog whistle.”",
    "url": "https://thehill.com/homenews/campaign/4375154-scaramucci-trumps-rhetoric-a-total-dog-whistle/"
  },
  {
    "text": "Democrats in Key States Worry Biden Could Be a Drag on Their Races  —  Candidates for the Senate and House have expressed concern that the president has not done enough to build an operation or excite voters.  —  Democrats in battleground states are growing increasingly anxious … ",
    "url": "https://www.nytimes.com/2023/12/23/us/politics/biden-congressional-democrats-concern.html"
  },
  {
    "text": "Supreme Court Won't Hear Case on Trump's Immunity Defense for Now  —  Jack Smith, the special counsel prosecuting former President Donald J. Trump, had urged the justices to move with extraordinary speed, bypassing a federal appeals court.  —  The Supreme Court declined on Friday to decide … ",
    "url": "https://www.nytimes.com/2023/12/22/us/politics/trump-supreme-court-immunity.html"
  },
  {
    "text": "Trump vows a peaceful transfer of power if reelected  —  Trump insisted that he peacefully turned over power to Biden in 2021, though he's been indicted for his role in trying to overturn the results of the 2020 election.  —  If reelected president in 2024, Donald Trump vowed Friday … ",
    "url": "https://www.politico.com/news/2023/12/22/trump-biden-reelection-2020-00133089"
  },
  {
    "text": "Newsom pans efforts to block Trump from California ballot  —  A number of California politicians rushed to fast-track efforts to deem Trump ineligible for the presidency after the Colorado Supreme Court's ruling.  —  LOS ANGELES — Gov. Gavin Newsom has a message for California politicians eager … ",
    "url": "https://www.politico.com/news/2023/12/22/newsom-pans-efforts-to-block-trump-from-california-ballot-00133152"
  },
  {
    "text": "Biden Convinced Netanyahu to Halt a Pre-Emptive Strike Against Hezbollah  —  Urgent call illustrates Washington's attempts to prevent a widening war in the Middle East  —  WASHINGTON—President Biden urged Israeli Prime Minister Benjamin Netanyahu to halt a pre-emptive strike against Hezbollah forces … ",
    "url": "https://www.wsj.com/world/middle-east/how-biden-averted-a-second-front-by-convincing-israel-not-to-attack-hezbollah-on-oct-11-e14a0a3b?mod=followamazon"
  },
  {
    "text": "Putin Quietly Signals He Is Open to a Cease-Fire in Ukraine  —  Despite its bravado in public, the Kremlin has indicated its interest in striking a deal to halt the war — so long as it could still declare victory.  —  Despite its bravado in public, the Kremlin has indicated its interest … ",
    "url": "https://www.nytimes.com/2023/12/23/world/europe/putin-russia-ukraine-war-cease-fire.html"
  },
  {
    "text": "Federal judge denies request to block Massachusetts assault weapons ban  —  A federal judge in Massachusetts shut down an attempt to block the state's assault weapons ban Friday, arguing that the law does not break with recent Supreme Court precedent that has severely shaken gun control legislation.",
    "url": "https://thehill.com/regulation/court-battles/4375035-federal-judge-denies-request-block-massachusetts-assault-weapons-ban/"
  },
  {
    "text": "I'm Michigan's Chief Election Official.  Trump's Still a Threat to Democracy, So Let's Be Prepared.  —  The new report about Trump's attempt to interfere with my state's election certification doesn't surprise me.  We must stay vigilant over the danger he'll bring in 2024.",
    "url": "https://www.thedailybeast.com/im-michigans-chief-election-official-trumps-still-a-threat-to-democracy"
  },
  {
    "text": "Trump asking allies about possibility of Nikki Haley for vice president  —  Former President Donald Trump has been asking allies and advisers for their thoughts about Nikki Haley as a potential vice presidential candidate, two sources familiar with the conversations tell CBS News.",
    "url": "https://www.cbsnews.com/news/trump-nikki-haley-vice-president-possiblity/"
  },
  {
    "text": "We cannot turn our back on the Endangered Species Act after 50 years of preventing extinction  —  Fifty years ago, Republicans and Democrats in both chambers came together in an inspirational show of bipartisanship to pass one of our nation's most respected and successful conservation laws: the Endangered Species Act.",
    "url": "https://thehill.com/opinion/congress-blog/4373187-we-cannot-turn-our-back-on-the-endangered-species-act-after-50-years-of-preventing-extinction/"
  },
  {
    "text": "Wisconsin Supreme Court rules legislative maps unconstitutional, orders new boundaries for 2024 vote  —  Molly Beck Jessie OpoienMilwaukee Journal Sentinel  —  MADISON - The Wisconsin Supreme Court on Friday ordered the Republican-controlled state Legislature to draw new legislative boundaries ahead … ",
    "url": "https://www.jsonline.com/story/news/politics/2023/12/22/wisconsin-supreme-court-rules-legislative-maps-unconstitutional/72010456007/"
  }
]