[
  {
    "text": "Netanyahu warns of long war with Hamas; Hezbollah and Israel trade fire  —  The Israel Defense Forces launched fresh strikes on Gaza early Sunday local time as violence in the region continued overnight, with Prime Minister Benjamin Netanyahu warning of a long and difficult war ahead.",
    "url": "https://www.washingtonpost.com/world/2023/10/08/israel-gaza-strikes-hamas-netanyahu/"
  },
  {
    "text": "IDF troops battle gunmen in Kfar Aza, Magen; 2 Israeli tourists killed in Egypt  —  IDF hits Hamas targets, says more than 400 terrorists killed; rocket hits Ashkelon hospital; more than 500 Israelis dead, 2,048 wounded, dozens taken hostage in Gaza  —  Security cabinet confirms Israel at war … ",
    "url": "https://www.timesofisrael.com/liveblog-october-8-2023/"
  },
  {
    "text": "'There's Going to Be a Lot of Soul-Searching in Israel When This Is Over'  —  Former U.S. peace negotiator Dennis Ross weighs in on Hamas' attack on Israel and the “missed opportunities” that led to the war.  —  No American diplomat is more familiar with the long history of enmity between Israelis … ",
    "url": "https://www.politico.com/news/magazine/2023/10/07/israel-hamas-attack-00120498"
  },
  {
    "text": "The significance of why Hamas chose to attack Israel now  —  Former U.S. officials say the group and its Iranian backers tried to exploit Israeli political divisions and to derail historic negotiations between Saudi Arabia, Israel and the U.S.  —  Hamas's unprecedented attack on Israel comes … ",
    "url": "https://www.nbcnews.com/news/significance-hamas-chose-attack-israel-now-rcna119351"
  },
  {
    "text": "Blinken says US working to verify reports of several Americans dead and missing in Israel  —  Secretary of State Antony Blinken said Sunday the US is “working overtime” to verify reports of missing and dead Americans overseas after Hamas launched an unprecedented attack against Israel.",
    "url": "https://www.cnn.com/2023/10/08/politics/blinken-israel-war-cnntv/"
  },
  {
    "text": "U.S. plans to move ships and planes closer to Israel  —  The U.S. is also looking at options for a possible evacuation of Americans from Israel.  Nothing has been decided, but one option involves putting some Americans on Navy ships.  —  The U.S. military is planning to move U.S. Navy ships … ",
    "url": "https://www.nbcnews.com/news/investigations/us-plans-move-ships-planes-closer-israel-rcna119385"
  },
  {
    "text": "Biden plans to ‘rapidly’ send additional aid to Israel  —  Tel Aviv has asked Washington for specific weapons systems.  —  The Biden administration is working to fulfill Israel's request to urgently transfer weapons to Tel Aviv, according to a U.S. official and second person familiar with the talks … ",
    "url": "https://www.politico.com/news/2023/10/08/biden-major-weapons-transfer-israel-00120520"
  },
  {
    "text": "How Not to Respond to a Terrorist Attack  —  The things I least want to hear on a day when Hamas terrorists kill hundreds of Israeli civilians.  —  I'm afraid it's not a good evening, but I wish you one anyway.  —  I seldom write about Israeli-Palestinian matters, but it's not because I don't think about them.",
    "url": "https://www.dogshirtdaily.com/p/how-not-to-respond-to-a-terrorist"
  },
  {
    "text": "Netanyahu Bears Responsibility for This Israel-Gaza War  —  The disaster that befell Israel on the holiday of Simchat Torah is the clear responsibility of one person: Benjamin Netanyahu.  The prime minister, who has prided himself on his vast political experience and irreplaceable wisdom in security matters … ",
    "url": "https://www.haaretz.com/opinion/editorial/2023-10-08/ty-article-opinion/netanyahu-bears-responsibility/0000018b-0b9d-d8fc-adff-6bfd1c880000"
  },
  {
    "text": "'I'd still vote for' Biden if he was ‘dead’: Pa. voters react to Trump-Biden 2024 rematch  —  Some Pennsylvania voters would rather cast an unenthusiastic ballot for Biden than a vote for Trump.",
    "url": "https://www.nbcnews.com/meet-the-press/video/-i-d-still-vote-for-biden-if-he-was-dead-pa-voters-react-to-trump-biden-2024-rematch-194683973849"
  },
  {
    "text": "We should unify in private behind a speaker candidate, Colorado Republican says  —  “It makes a lot more sense to do this behind closed doors,” Ken Buck said.  —  Rep. Ken Buck said Sunday he wants House Republicans to agree on a candidate for speaker in private before putting the candidate up to the full House for a vote.",
    "url": "https://www.politico.com/news/2023/10/08/ken-buck-speaker-candidate-unify-00120512"
  },
  {
    "text": "GOP criticism that White House funded Iran ahead of Israel attack is ‘false narrative,’ Blinken argues  —  House Majority Leader Steve Scalise had called it a sign of “appeasement.”  —  Secretary of State Antony Blinken on Sunday pushed back on growing Republican criticism that the White House's decision … ",
    "url": "https://abcnews.go.com/Politics/blinken-responds-criticism-iran-money-transfer-ahead-hamas/story?id=103809664"
  },
  {
    "text": "Attack on Israel underscores ‘irresponsibility’ of Republicans paralyzing House with speaker fight: Christie  —  The 2024 candidate said the U.S. should try to keep the conflict from spreading.  —  Republican presidential candidate Chris Christie said on Sunday that the U.S. should provide Israel with … ",
    "url": "https://abcnews.go.com/Politics/attack-israel-underscores-irresponsibility-republicans-paralyzing-house-speaker/story?id=103809670"
  },
  {
    "text": "Terrorist group's attack on Israel is yet another Biden geopolitical failure  —  How many billions of dollars does President Joe Biden want to send to countries that support terrorist groups?  It's an important question that needs answering after Hamas' attack on Israel on Saturday morning.",
    "url": "https://www.washingtonexaminer.com/opinion/terrorist-groups-attack-on-israel-is-yet-another-biden-geopolitical-failure"
  },
  {
    "text": "UK's Starmer Says He's ‘Bang on Schedule’ to Win Power  — Labour leader says party on track to return to government  — But polls indicate voters still unsure of Labour direction … UK Labour leader Keir Starmer said his party is on track to return to power at the next election … ",
    "url": "https://www.bloomberg.com/news/articles/2023-10-08/uk-s-starmer-says-he-s-bang-on-schedule-to-win-power"
  }
]