[
  {
    "text": "Key Republican says he won't back Trump's pick for top DC prosecutor because of Jan. 6 ties  —  Republican Sen. Thom Tillis says he's informed the White House that he won't support Ed Martin, President Donald Trump's pick for top federal prosecutor in Washington, stalling the nomination … ",
    "url": "https://apnews.com/article/ed-martin-prosecutor-january-6-trump-nominee-justice-7b9d392ff6a20ab6c25dd5f03b176c85"
  },
  {
    "text": "Tulsi Gabbard Reused the Same Weak Password on Multiple Accounts for Years  —  Now the US director of national intelligence, Gabbard failed to follow basic cybersecurity practices on several of her personal accounts, leaked records reviewed by WIRED reveal.  —  Tulsi Gabbard … ",
    "url": "https://www.wired.com/story/tulsi-gabbard-dni-weak-password/"
  },
  {
    "text": "FAA suspends work of independent panel reviewing air traffic control  —  A panel of experts, including the former chair of the NTSB and former head of NASA, had been asked to evaluate the FAA's oversight of traffic control operations.  —  The Federal Aviation Administration halted the work … ",
    "url": "https://www.washingtonpost.com/transportation/2025/05/06/faa-halts-review-of-atc-oversight/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ2NTA0MDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ3ODg2Mzk5LCJpYXQiOjE3NDY1MDQwMDAsImp0aSI6ImY3YzYyY2VhLTk0MTctNGNlMC04MWIzLWM1Mzg4N2Y0YWIxYSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS90cmFuc3BvcnRhdGlvbi8yMDI1LzA1LzA2L2ZhYS1oYWx0cy1yZXZpZXctb2YtYXRjLW92ZXJzaWdodC8ifQ.SWGEvLHm1a-2cnTqvrPgWMIiA_NYUMSVB3tEL64__7M&itid=gfta"
  },
  {
    "text": "2 United Airlines Jets Clip Wings at San Francisco Airport  —  No one was injured in the incident, which occurred as the Boeing 777 jets were leaving the gate area early on Tuesday.  The airline canceled both trans-Pacific flights.  —  A United Airlines Boeing 777 jet clipped the wingtip … ",
    "url": "https://www.nytimes.com/2025/05/06/us/united-airlines-planes-clip-wings-sfo.html"
  },
  {
    "text": "India Strikes Pakistan Two Weeks After Terrorist Attack  —  The strikes came after an attack by militants killed more than two dozen civilians in Indian-administered Kashmir and are an intensification of a conflict between two nuclear powers.  —  India said early Wednesday that it had conducted strikes … ",
    "url": "https://www.nytimes.com/2025/05/06/world/asia/india-pakistan-attacks.html?unlocked_article_code=1.FE8.TnL9.E5H5egy6fTGC&smid=url-share"
  },
  {
    "text": "India launches military operation against Pakistan in major escalation  —  India has launched a major military operation against Pakistan in a major escalation of tensions between the two nuclear-armed neighbors.  —  The missile strikes early Wednesday morning targeted “terrorist infrastructure” … ",
    "url": "https://cnn.com/2025/05/06/asia/india-pakistan-kashmir-conflict-hnk-intl"
  },
  {
    "text": "Exclusive: Order by Hegseth to cancel Ukraine weapons caught White House off guard  —  NEW YORK/WASHINGTON - Roughly a week after Donald Trump started his second term as president, the U.S. military issued an order to three freight airlines operating out of Dover Air Force Base in Delaware … ",
    "url": "https://www.reuters.com/world/us/order-by-hegseth-cancel-ukraine-weapons-caught-white-house-off-guard-2025-05-06/"
  },
  {
    "text": "Supreme Court lets Trump ban transgender people from military  —  Neither the majority nor the dissenters provided any reasoning for their positions.  —  President Donald Trump can proceed with his plan to ban transgender people from the military, including by removing transgender troops currently serving … ",
    "url": "https://www.politico.com/news/2025/05/06/trump-ban-transgender-troops-scotus-ruling-00331383"
  },
  {
    "text": "Supreme Court allows Trump to implement transgender military ban  —  The blanket ban, expanding on a similar policy Trump proposed in his first term, has been blocked nationwide by lower courts.  —  WASHINGTON — The Supreme Court on Tuesday allowed President Donald Trump to implement his ban … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-allows-trump-implement-transgender-military-ban-rcna204135"
  },
  {
    "text": "U.S. Orders Intelligence Agencies to Step Up Spying on Greenland  —  Effort underscores seriousness of Trump's intent to acquire the island from Denmark  —  The U.S. is stepping up its intelligence-gathering efforts regarding Greenland, drawing America's spying apparatus into President Trump's campaign … ",
    "url": "https://www.wsj.com/world/greenland-spying-us-intelligence-809c4ef2?st=szxFWE&reflink=mobilewebshare_permalink"
  },
  {
    "text": "Trump admin plans to shut down money-saving Energy Star program soon, sources say  —  The Trump administration is preparing to eliminate two key Environmental Protection Agency divisions focused on climate change and energy efficiency, including its consumer-facing Energy Star program, according to two sources familiar with the plan.",
    "url": "https://cnn.com/2025/05/06/climate/energy-star-trump"
  },
  {
    "text": "Elon Musk's Grok AI Will ‘Remove Her Clothes’ In Public, On X  —  Elon Musk's Grok, an AI chatbot that people can interact with via X, is being used to undress photos women are posting to the social media platform, as first flagged t0 404 Media by Kolina Koltai, a researcher and trainer at Bellingcat.",
    "url": "https://www.404media.co/elon-musks-grok-ai-will-remove-her-clothes-in-public-on-x/"
  },
  {
    "text": "ICE Agents Are Targeting DC Restaurants  —  Immigration and Customs Enforcement agents are targeting DC restaurants today in what is shaping up to be one of the city's most high-profile examples yet of President Donald Trump's immigration crackdown.  Millie's in Spring Valley … ",
    "url": "https://www.washingtonian.com/2025/05/06/ice-agents-are-targeting-dc-restaurants/"
  },
  {
    "text": "The first boats carrying Chinese goods with 145% tariffs are arriving in LA. Shipments are cut in half.  Expect shortages soon  —  American consumers are on the cusp of tough choices because of President Donald Trump's trade war.  —  Ships now pulling into US harbors from China … ",
    "url": "https://cnn.com/2025/05/06/business/tariffs-price-increases-shortages-ports"
  },
  {
    "text": "N.Y. judge finds Alien Enemies Act use illegal, blocks removals to ‘evil’ jail  —  A federal judge in New York ruled that the Trump administration does not have legal justification to deport Venezuelan immigrants under the Alien Enemies Act.  —  NEW YORK — A federal judge on Tuesday barred … ",
    "url": "https://www.washingtonpost.com/politics/2025/05/06/new-york-judge-no-deportation-trump-alien-enemies-act/"
  },
  {
    "text": "Trump Brags About Gold-Plated Office While Telling Americans to Cut Expenses  —  The president gloated about his “24-karat gold” White House renovation as his nonsensical tariff agenda drives up prices for consumers  —  Austerity for thee but not for me.  As Donald Trump advises … ",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-brags-gold-plated-office-tariffs-1235332861/"
  },
  {
    "text": "The Company Behind the Signal Clone Mike Waltz Used Has Direct Access to User Chats  —  A new analysis of TM Signal's source code appears to show that the app sends users' message logs in plaintext.  At least one top Trump administration official used the app.",
    "url": "https://www.wired.com/story/tm-signal-telemessage-plaintext-message-archive/"
  },
  {
    "text": "At Trump's urging, USPS board to name FedEx official as postmaster general  —  David Steiner is a member of FedEx's board and was previously the leader of sanitation company Waste Management.  —  President Donald Trump and the U.S. Postal Service's governing board are expected … ",
    "url": "https://www.washingtonpost.com/business/2025/05/06/usps-trump-david-steiner/"
  },
  {
    "text": "Second US Navy jet is lost at sea from Truman aircraft carrier  —  Another F/A-18 Super Hornet fighter jet from the USS Harry S. Truman aircraft carrier has been lost in the Red Sea, the second jet lost from the carrier in just over a week, four people familiar with the matter told CNN.",
    "url": "https://cnn.com/2025/05/06/politics/second-us-navy-jet-is-lost-at-sea"
  },
  {
    "text": "Anti-Israel protesters occupy University of Washington building, 30 arrested  —  A group of anti-Israel protesters occupied a building at the University of Washington (UW) in Seattle on Monday before police in riot gear intervened and arrested at least 30 of them, according to officials.",
    "url": "https://www.foxnews.com/us/anti-israel-protesters-occupy-university-washington-building-30-arrested"
  },
  {
    "text": "'It's All Cronyism Going Forward'  —  A flu researcher the Trump administration elevated to power will now benefit from a massive funding award.  —  Matthew J. Memoli has had an exceptionally good year.  —  At the beginning of January, Memoli was a relatively little-known flu researcher running … ",
    "url": "https://www.theatlantic.com/health/archive/2025/05/nih-cronyism/682713/"
  },
  {
    "text": "Department of Education Eliminates Grant for PBS Children's Shows  —  The termination of the federal grant program, called Ready To Learn, resulted in a loss of $23 million that would have gone to educational programs.  —  The White House effort to cut funding for NPR and PBS is beginning to take effect.",
    "url": "https://www.nytimes.com/2025/05/06/us/politics/doe-kills-grant-pbs-childrens-shows.html"
  },
  {
    "text": "Trump administration to garnish wages of 5.3 million defaulted student loan borrowers this summer … The Trump Administration resumed collection efforts on defaulted student loans Monday after a roughly five-year hiatus — and affected borrowers could begin feeling the financial consequences sooner than experts expected.",
    "url": "https://www.cnbc.com/2025/05/06/how-soon-defaulted-student-loan-borrowers-may-face-collections.html"
  },
  {
    "text": "Trump team urged Ukraine to take U.S. deportees amid war, documents show  —  The extraordinary request illustrates the administration's aggressive bid to identify willing partners who will accept people expelled by the U.S.  —  The Trump administration earlier this year urged the Ukrainian government … ",
    "url": "https://www.washingtonpost.com/national-security/2025/05/06/trump-ukraine-deportees/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ2NTA0MDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ3ODg2Mzk5LCJpYXQiOjE3NDY1MDQwMDAsImp0aSI6ImYyYjM3ZGY4LTM3MDAtNGNlYy1hMjRjLTA5OTc5MDhlYzY3ZCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb25hbC1zZWN1cml0eS8yMDI1LzA1LzA2L3RydW1wLXVrcmFpbmUtZGVwb3J0ZWVzLyJ9.muCFfMY1lPsdq2EtROxY7x4yXLAt5LSQJ2FHFdVfNy8&itid=gfta"
  },
  {
    "text": "‘What Are They Doing Illegal?’  Officer Says Before Arresting Pro-Palestine Students  —  Audio reveals an officer admitting UT Austin students weren't breaking the law before they were arrested.  The students are now suing Greg Abbott  —  A police officer questioned the legality … ",
    "url": "https://www.rollingstone.com/politics/politics-features/texas-students-arrested-pro-palestine-protest-sue-abbott-1235332777/"
  },
  {
    "text": "A Student Journalist Covered a Pro-Palestine Protest.  Soon, Her Graduation Came Under Threat.  —  A botched challenge to press freedom at Columbia University's Barnard College.  —  Back in March, pro-Palestine protesters staged a sit-in at Barnard College, an affiliate of Columbia University, just across the street.",
    "url": "https://www.cjr.org/news/student-journalist-columbia-covered-a-pro-palestine-protest-graduation-under-threat.php"
  },
  {
    "text": "Ohio governor moves to keep the state GOP from endorsing Trump-backed Vivek Ramaswamy to succeed him  —  The Ohio Republican Party is slated to take a Friday vote on whether to give Ramaswamy its endorsement in the 2026 race for governor.  —  CLEVELAND — President Donald Trump endorsed Vivek Ramaswamy … ",
    "url": "https://www.nbcnews.com/politics/2026-election/ohio-governor-moves-keep-state-gop-endorsing-trump-backed-vivek-ramasw-rcna205146"
  },
  {
    "text": "Trump picks Rudy Giuliani's son for key World Cup post  —  The younger Giuliani worked as a special assistant to the president and associate director of the Office of Public Liaison during Trump's first term.  —  President Donald Trump on Tuesday tapped Andrew Giuliani — the son of Rudy Giuliani … ",
    "url": "https://www.politico.com/news/2025/05/06/donald-trump-fifa-world-cup-00331917"
  },
  {
    "text": "President Trump's Media Company Is Offering Movies About ‘Lizard People’ And Other Wild Conspiracy Theories  —  Less than two minutes into the movie, the narrator makes a shocking claim.  —  “The evidence we are about to present to you has the potential to rewrite thousands of years of human history.",
    "url": "https://talkingpointsmemo.com/news/truth-plus-trump-conspiracy-theories"
  },
  {
    "text": "Is the White House for sale?  New reports on Trump's crypto ventures raise concern.  —  A UAE-backed investment group and an international trucking logistics firm are pouring millions into cryptocurrencies linked to the president.  —  Investors appear to be getting a little impatient for some good news on Donald Trump's trade war.",
    "url": "https://www.msnbc.com/top-stories/latest/trump-white-house-for-sale-crypto-rcna205142"
  },
  {
    "text": "What do disengaged voters think about Trump now?  —  In the 2024 election, Donald Trump gained a surprising edge from an unlikely group: Americans who typically don't vote.  According to a New York Times analysis, these low-turnout voters backed Trump by a double-digit margin … ",
    "url": "https://www.gelliottmorris.com/p/what-do-disengaged-voters-think-about"
  },
  {
    "text": "Trump Finds Solution to Aviation Woes—Fire a Democrat  —  GROUNDED  —  Since January, President Donald Trump has moved swiftly to purge board members overseeing independent agencies.  —  The White House on Monday ousted the vice chair of the National Transportation Safety Board (NTSB) … ",
    "url": "https://www.thedailybeast.com/trump-finds-solution-to-transport-woesfire-democrat-member-of-ntsb-alvin-brown/"
  },
  {
    "text": "They voted for Trump and now their son is in ICE detention  —  Green card holder from Argentina held in South Georgia's Stewart Detention Center.  —  LUMPKIN — Just 2 miles away from a sprawling South Georgia immigrant jail sits El Refugio, a hospitality house where the loved ones … ",
    "url": "https://www.ajc.com/news/georgia-news/they-voted-for-trump-and-now-their-son-is-in-ice-detention/SYFCW7GWOVA6NBW63RXUN3IJEU/"
  },
  {
    "text": "She Called a 5-Year-Old the N-Word  —  N-word-slinging woman becomes right-wing hero  —  OVER THE PAST WEEK, portions of the American right have embraced a Minnesota woman whose claim to fame is that she allegedly called a 5-year-old boy the n-word, going so far as to help her raise hundreds of thousands of dollars.",
    "url": "https://www.thebulwark.com/p/she-called-a-five-year-old-the-n-word-crowdfunding"
  },
  {
    "text": "Utah becomes first US state to ban fluoride in public drinking water  —  Republican governor Spencer Cox signs law despite pleas of health experts, who warn that children will be most hurt  —  Utah on Wednesday will become the first state in the US to ban fluoride in public drinking water.",
    "url": "https://www.theguardian.com/us-news/2025/may/06/utah-flouride-water-ban"
  }
]