[
  {
    "text": "Trump Is No Gerald Ford  —  No other president has used an assassination attempt to inflame American politics the way Donald Trump does.  —  Every American has the right to participate in public life without violence, and that includes Donald Trump.  Personally, I think he probably belongs in jail … ",
    "url": "https://www.theatlantic.com/newsletters/archive/2024/09/trump-is-no-gerald-ford/679900/"
  },
  {
    "text": "Trump's golf outings have long concerned Secret Service  —  Sunday's episode in West Palm Beach made gravely apparent the security challenges at the former president's private golf courses.  —  Soon after Donald Trump became president, authorities tried to warn him about the risks posed … ",
    "url": "https://www.washingtonpost.com/politics/2024/09/16/trump-golf-courses-secret-service-protection/"
  },
  {
    "text": "Elon Musk Is a National Security Risk  —  Musk's now-deleted post questioning why no one has attempted to assassinate Joe Biden and Kamala Harris renews concerns over his work for the US government—and potential to inspire extremist violence.  —  Shortly following reports … ",
    "url": "https://www.wired.com/story/elon-musk-biden-harris-assassination-post-x/"
  },
  {
    "text": "US Secret Service says it is aware of Musk post about Biden, Harris  —  The U.S. Secret Service said on Monday it was aware of a post by billionaire Elon Musk on the X social media platform musing about an absence of assassination attempts on President Joe Biden and Vice President Kamala Harris.",
    "url": "https://www.reuters.com/world/us/us-secret-service-says-it-is-aware-musk-post-about-biden-harris-2024-09-16/"
  },
  {
    "text": "Omnipresent AI cameras will ensure good behavior, says Larry Ellison  —  “We're going to have supervision,” says billionaire Oracle co-founder Ellison.  —  On Thursday, Oracle co-founder Larry Ellison shared his vision for an AI-powered surveillance future during a company financial meeting, reports Business Insider.",
    "url": "https://arstechnica.com/information-technology/2024/09/omnipresent-ai-cameras-will-ensure-good-behavior-says-larry-ellison/"
  },
  {
    "text": "Vote for Kamala Harris to Support Science, Health and the Environment  —  Kamala Harris has plans to improve health, boost the economy and mitigate climate change.  Donald Trump has threats and a dangerous record  —  In the November election, the U.S. faces two futures.",
    "url": "https://www.scientificamerican.com/article/vote-for-kamala-harris-to-support-science-health-and-the-environment/"
  },
  {
    "text": "Mark Meadows's Arizona charges to stay in state court, federal judge rules  —  The ruling is a setback for the former Trump White House chief of staff, who unsuccessfully tried the same legal maneuver in a separate case in Georgia.  —  A judge has denied a request from Mark Meadows … ",
    "url": "https://www.washingtonpost.com/national-security/2024/09/16/mark-meadows-arizona-federal-court/"
  },
  {
    "text": "Harris leads Trump in Pennsylvania — and two bellwether PA counties — exclusive poll finds  —  Joey Garrison Michael CollinsUSA TODAY  —  WASHINGTON - Democratic presidential nominee Kamala Harris narrowly leads former President Donald Trump in the critical battleground state of Pennsylvania … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/09/16/harris-trump-pennsylvania-poll/75236006007/"
  },
  {
    "text": "Reggaeton Star Nicky Jam Deletes Endorsement After Donald Trump Misgendering  —  HOT TO COLD  —  Jam, who was introduced by Trump as a “hot” woman, disabled the comment section of a recent Instagram post after being mocked by commentators.  —  Reggaeton star Nicky Jam seems to be rolling … ",
    "url": "https://www.thedailybeast.com/reggaeton-star-nicky-jam-deletes-trump-post-amid-misgendering-backlash"
  },
  {
    "text": "Giuliani Takes Another L in Court as Judge Tosses His Suit Against Biden  —  CAN'T CATCH A BREAK  —  Last October, Giuliani sued Biden for saying during a 2020 presidential debate that Giuliani was a “Russian pawn.”  —  Cash-strapped former Donald Trump adviser Rudy Giuliani's defamation lawsuit … ",
    "url": "https://www.thedailybeast.com/giuliani-takes-another-l-in-court-as-judge-tosses-his-suit-against-biden"
  },
  {
    "text": "House Dems' ‘sleeper’ seats suddenly in sight  —  With assists from POLITICO's Congress team  —  MIDWEST MOMENTUM ... OR MIRAGE?  —  The Kamala Harris effect has House Democrats thinking they can gain seats in a place they've been losing for years: the Midwest.",
    "url": "https://www.politico.com/newsletters/inside-congress/2024/09/16/house-dems-sleeper-seats-suddenly-in-sight-00179407"
  },
  {
    "text": "Meta bans RT, days after U.S. accuses Russian outlet of disinformation  —  U.S. officials on Friday accused RT of carrying out covert information warfare operations around the world as an arm of Russia's spy agencies.  —  Social media giant Meta on Monday announced that it is banning Russian … ",
    "url": "https://www.nbcnews.com/news/us-news/meta-bans-rt-russian-disinformation-rcna171402"
  },
  {
    "text": "Tense Teamsters Meeting With Harris Ends With an Endorsement Still Dangling  —  The Teamsters president, Sean O'Brien, indicated he could announce as soon as Wednesday which presidential candidate — if any — the union would back.  —  Vice President Kamala Harris held a sometimes tense meeting … ",
    "url": "https://www.nytimes.com/2024/09/16/us/politics/teamsters-harris.html?unlocked_article_code=1.LU4.JbRE.EcJ0aOgJrw9J&smid=url-share"
  },
  {
    "text": "Ex-Trump aide says old boss is one of the ‘biggest offenders of escalatory rhetoric’  —  A former White House director of strategic communications for Donald Trump called for toning down “political rhetoric” following the second assassination plot against Trump — and called her old boss “one of the biggest offenders.”",
    "url": "https://www.rawstory.com/alyssa-farah-griffin-2669216328/"
  },
  {
    "text": "New details of Trump family crypto project released, including who can buy in … More than two hours into Republican former President Donald Trump's World Liberty Financial launch event on X Monday night, the team behind the Trump family's new crypto project finally unveiled a key detail … ",
    "url": "https://www.cnbc.com/2024/09/16/trump-crypto-world-liberty-financial.html"
  },
  {
    "text": "He's Jumped the Shark  —  A television analogy helps explain what's happening in Trumpland and how the ex-president has lost the narrative.  —  Toward the end of the fifth year of the popular TV series Happy Days, the writers had The Fonz put on water skis and jump over a live shark.",
    "url": "https://statuskuo.substack.com/p/hes-jumped-the-shark"
  },
  {
    "text": "Mark Robinson Waves Hand By Groin, Says Young Women Must ‘Get This Under Control’  —  In a newly resurfaced video from 2022, the North Carolina GOP gubernatorial nominee also criticizes “all this giving out of birth control.”  —  LOADING  —  WASHINGTON ― In a newly unearthed video from 2022 … ",
    "url": "https://www.huffpost.com/entry/mark-robinson-young-women-sex-birth-control_n_66e87182e4b06998fbec7ceb"
  },
  {
    "text": "Trump and Vance Are Harming the People They Claim to Care About  —  Springfield, Ohio, is just the sort of beleaguered heartland manufacturing town that Donald Trump and J. D. Vance say the MAGA movement wants to help.  Instead, the Republican ticket has chosen to make life miserable … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/09/trump-vance-springfield-ohio/679894/"
  },
  {
    "text": "Gen Z women are the future Republicans were so worried about  —  Since 2016, the views of young women have shifted sharply to the left.  —  Tucked into a fascinating article about partisanship and names in America, The Washington Post's Andrew Van Dam and Lenny Bronner included a chart … ",
    "url": "https://www.washingtonpost.com/politics/2024/09/16/gen-z-women-are-future-republicans-were-so-worried-about/"
  },
  {
    "text": "TikTok faces skeptical judges in hearing over potential ban  —  The two-hour hearing allowed TikTok and the government to give Appeals Court judges their opinions on a potential TikTok ban.  —  A three-judge panel of the D.C. Circuit U.S. Court of Appeals sounded unconvinced Monday that the TikTok … ",
    "url": "https://www.nbcnews.com/tech/tech-news/tiktok-faces-skeptical-judges-hearing-potential-ban-rcna171173"
  }
]