[
  {
    "text": "Judge overseeing Georgia election interference case dismisses some charges against Trump  —  ATLANTA (AP) — The judge overseeing the Georgia election interference case on Wednesday dismissed some of the charges against former President Donald Trump, but many other counts in the indictment remain.",
    "url": "https://apnews.com/article/georgia-election-interference-2020-trump-46e0b68c25719c404130f7e6eab69dcd"
  },
  {
    "text": "Cheney fuels speculation about her next move  —  Speculation is growing about the role former Rep. Liz Cheney (R-Wyo.) will play in the 2024 election as President Biden and former President Trump barrel toward a rematch.  —  Cheney has vowed that she'll do whatever it takes to keep Trump from returning to the White House.",
    "url": "https://thehill.com/homenews/campaign/4526744-cheney-fuels-speculation-about-her-next-move/"
  },
  {
    "text": "Putin Recalls Trump Acting Like Jealous GF in Private  —  According to him, Trump made no attempt to hide his own insecurities about Joe Biden.  —  Russia's Vladimir Putin has revealed an apparently previously unreported conversation with Donald Trump in which he claims the then-American president … ",
    "url": "https://www.thedailybeast.com/putin-recalls-trump-being-jealous-of-sleepy-joe-biden-in-private"
  },
  {
    "text": "Donald Trump Flips Out At Democrats' Mocking Montages With Massive Self-Own … Video",
    "url": "https://www.huffpost.com/entry/donald-trump-supercut-response_n_65f1850fe4b09953f2f84035"
  },
  {
    "text": "Judge in Georgia election interference case dismisses three counts against Trump  —  Judge Scott McAfee found some of the counts against the former president and some of his co-defendants were lacking details.  —  ATLANTA — The judge presiding over the election interference case in Georgia … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/judge-georgia-election-interference-case-dismisses-three-counts-trump-rcna143182"
  },
  {
    "text": "Trailing Trump in Polls, Biden Can Be More Bullish in One Battleground  —  The president faces lagging energy in many key states.  But in Wisconsin, which he will visit on Wednesday, rolling clashes over abortion rights and democracy have kept Democratic voters fired up.",
    "url": "https://www.nytimes.com/2024/03/13/us/politics/biden-wisconsin-trump.html"
  },
  {
    "text": "‘Make the RNC White Again’: GOP Ends Minority Outreach Program  —  With Trump allies taking over the RNC and cleaning house, one of the casualties was a minority outreach program that seemed to be working for Republicans. … After years of accusations of financial mismanagement … ",
    "url": "https://www.thedailybeast.com/make-the-rnc-white-again-gop-ends-minority-outreach-program"
  },
  {
    "text": "Trump's GOP is already dying  —  For Donald Trump, last week must have seemed like a final, crowning victory over his lingering Republican critics.  On Friday the Republican National Committee made official what Trump had already decreed weeks ago, electing Trump's daughter-in-law, Lara Trump, as party co-chair.",
    "url": "https://thehill.com/opinion/campaign/4528680-trumps-gop-is-already-dying/"
  },
  {
    "text": "House passes TikTok crackdown that could ban app in U.S.  —  The swift rebuke shifts attention to the Senate, where the bill faces significant political barriers and constitutional concerns  —  The House overwhelmingly passed a measure Wednesday to force TikTok to split from its parent company … ",
    "url": "https://www.washingtonpost.com/technology/2024/03/13/tiktok-ban-passes-house-vote/"
  },
  {
    "text": "Hunter Biden declines House committee invitation to testify publicly  —  Hunter Biden has declined an invitation to testify next week in a public hearing before the House Oversight Committee, according to a letter from Hunter Biden's attorney, Abbe Lowell, sent to Rep. James Comer (R-Ky.), the panel's chairman.",
    "url": "https://www.washingtonpost.com/politics/2024/03/13/hunter-biden-declines-public-testimony/"
  },
  {
    "text": "Hunter Biden rebuffs Republicans' invitation to appear for a public hearing  —  Hunter Biden on Wednesday rejected an invitation from House Republicans to appear for a public hearing next week alongside former business associates, an inquiry his attorney dismissed as a “carnival side show.”",
    "url": "https://apnews.com/article/hunter-biden-hearing-congress-house-republicans-impeachment-7110f5808edf570a63d880e2cad8feb7"
  },
  {
    "text": "Man pleads guilty to scheme to create giant sheep hybrids for captive hunting  —  A Montana man pleaded guilty Tuesday to two felony charges connected to an effort to create a giant sheep hybrids for captive hunting, the Justice Department announced.  —  Arthur “Jack” Schubarth, 80 … ",
    "url": "https://thehill.com/homenews/state-watch/4529016-man-pleads-guilty-giant-sheep-hybrids-captive-hunting/"
  },
  {
    "text": "Say gay, Florida  —  This week, the State of Florida agreed to settle a lawsuit challenging the constitutionality of the Parental Rights in Education Act, better known as the “Don't Say Gay” law.  The bill's text prohibited “classroom instruction by school personnel or third parties … ",
    "url": "https://popular.info/p/update-say-gay-florida"
  },
  {
    "text": "A small city in Oklahoma elected a white nationalist.  Will it be able to vote him out?  —  Judd Blevins, a city commissioner in Enid, Oklahoma, marched in the 2017 white nationalist Unite the Right rally.  Now he faces a recall vote.  —  ENID, Okla. — The photo of Judd Blevins was unmistakable.",
    "url": "https://www.nbcnews.com/news/us-news/oklahoma-recall-vote-judd-blevins-enid-city-council-rcna143041"
  },
  {
    "text": "Brett Kavanaugh knows truth of alleged sexual assault, Christine Blasey Ford says in book  —  In memoir, professor whose accusation rocked 2018 supreme court hearings says rightwing justice not ‘consummately honest person’  —  The US supreme court justice Brett Kavanaugh is not a … ",
    "url": "https://www.theguardian.com/us-news/2024/mar/13/christine-blasey-ford-book-supreme-court-brett-kavanaugh-sexual-assault"
  },
  {
    "text": "On popular online platforms, predatory groups coerce children into self-harm  —  Vulnerable teens are blackmailed into degrading and violent acts by abusers who then boast about it  —  Editor's note: This story describes extremely disturbing events that may be upsetting for some people.",
    "url": "https://www.washingtonpost.com/investigations/interactive/2024/764-predator-discord-telegram/"
  },
  {
    "text": "LGBTQ+ Identification in U.S. Now at 7.6%  —  More than one in five Gen Z adults identify as LGBTQ+  —  WASHINGTON, D.C. — LGBTQ+ identification in the U.S. continues to grow, with 7.6% of U.S. adults now identifying as lesbian, gay, bisexual, transgender, queer or some other sexual orientation besides heterosexual.",
    "url": "https://news.gallup.com/poll/611864/lgbtq-identification.aspx"
  },
  {
    "text": "$500K Sand Dune Designed to Protect Coastal Homes Washes Away in Just 3 Days  —  CRUMBLED  —  In a drastic attempt to protect their beachfront homes, residents in Salisbury, Massachusetts, invested $500,000 in a sand dune to defend against encroaching tides.",
    "url": "https://www.thedailybeast.com/dollar500k-dune-designed-to-protect-massachusetts-homes-last-just-3-days"
  }
]