[
  {
    "text": "BREAKING: Trump, allies will be booked at Fulton County Jail, sheriff says  —  X  —  Former President Donald Trump and his 18 co-defendants will be booked at the Fulton County Jail, the sheriff's office said Tuesday.  —  “At this point, based on guidance received from the District Attorney's office … ",
    "url": "https://www.ajc.com/news/crime/breaking-trump-allies-will-be-booked-at-fulton-county-jail-sheriff-says/TVA75MWN3ZG4DBSS4TLO7EB4WE/"
  },
  {
    "text": "Trump Plans to Release 100-Page Report on Georgia Election Fraud Claims  —  Liz Harrington, a communications aide described as a true believer in the former president's lies about a stolen election, helped prepare the report.  Mr. Trump said he would release it on Monday.",
    "url": "https://www.nytimes.com/2023/08/15/us/politics/trump-election-report-georgia-indictment.html"
  },
  {
    "text": "Trump stiffed his alleged co-conspirators, whose false claims brought in $250 million  — Several of former President Donald Trump's allies who are now facing criminal charges for helping him try to overturn the results of the 2020 election were never paid by the Trump political operation for work they did in late 2020.",
    "url": "https://www.cnbc.com/2023/08/15/trump-co-conspirators-never-got-paid-by-trump-team.html"
  },
  {
    "text": "This Indictment Hits Different  —  LATE MONDAY NIGHT, a grand jury in Fulton County, Georgia handed down a sweeping 98-page indictment against Donald Trump and 18 others—including former White House Chief of Staff Mark Meadows and lawyers Jeffrey Clark, Kenneth Chesebro, John Eastman, Jenna Ellis, and Rudy Giuliani.",
    "url": "https://plus.thebulwark.com/p/this-indictment-hits-different"
  },
  {
    "text": "Kimberly Guilfoyle Cites John Gotti To Defend Trump, Makes The Opposite Point She Intended  —  The conservative media personality seemed to inadvertently suggest that Gotti, an infamous mobster, was less of a criminal than Trump.  —  LOADING  —  Donald Trump Jr.'s girlfriend, Kimberly Guilfoyle … ",
    "url": "https://www.huffpost.com/entry/kimberly-guilfoyle-defend-trump-john-gotti_n_64dbe594e4b01778ea6f9e82"
  },
  {
    "text": "Special Counsel Obtained Trump's Direct Messages on Twitter  —  The nature of the messages or who exactly wrote them remained unclear, but it was a revelation that such messages were associated with the former president's account.  —  The federal prosecutors who charged former President Donald J. Trump … ",
    "url": "https://www.nytimes.com/2023/08/15/us/politics/trump-twitter-direct-messages-warrant.html"
  },
  {
    "text": "Special counsel obtained Trump DMs despite ‘momentous’ bid by Twitter to delay, unsealed filings show  —  Judge Beryl Howell lit into Twitter for taking steps to give Donald Trump advance notice about the search warrant.  —  Special counsel Jack Smith obtained an extraordinary array of data … ",
    "url": "https://www.politico.com/news/2023/08/15/special-counsel-obtained-trump-twitter-howell-00111410"
  },
  {
    "text": "Trump's Social Media Posts Test Conditions of His Release in Jan. 6 Case  —  Some lawyers have said that if the former president were an ordinary citizen issuing these attacks, he would be in jail by now.  The question is whether he will face similar consequences.",
    "url": "https://www.nytimes.com/2023/08/16/us/politics/trump-chutkan-2020-election-truth-social.html"
  },
  {
    "text": "Mark Meadows seeks to move Fulton County election case to federal court  —  The former chief of staff was indicted with Trump and 17 others on Monday.  —  Former White House Chief of Staff Mark Meadows officially filed Tuesday to move the case brought against him by Fulton County District … ",
    "url": "https://abcnews.go.com/US/meadows-seeks-move-fulton-county-election-case-federal/story?id=102295084"
  },
  {
    "text": "Mark Meadows is ‘playing all sides’ trying to get out of trouble: Legal expert  —  Former White House Chief of Staff Mark Meadows has “played all sides” as he tried to avoid prosecution for his involvement in the plot to overturn the 2020 presidential election, argued former federal prosecutor Harry Litman … ",
    "url": "https://www.rawstory.com/mark-meadows-playing-all-sides/"
  },
  {
    "text": "Playbook: Why Biden won't touch on Trump  —  Presented by With help from Eli Okun and Garrett Ross  —  DRIVING THE DAY  —  AZ VS. NYC — “Sinema takes on Schumer, Jeffries and the White House over the border,” by Burgess Everett: “Independent Sen. KYRSTEN SINEMA is on the warpath … ",
    "url": "https://www.politico.com/newsletters/playbook/2023/08/16/why-biden-wont-touch-on-trump-00111417"
  },
  {
    "text": "Entire police department resigns in Minnesota city, leaves mayor ‘blindsided’: ‘Zero applicants’  —  Goodhue's police chief said in July that he had ‘zero applicants’ to join force  —  Goodhue, Minnesota, a small city in the southeastern part of the state, lost its entire police force … ",
    "url": "https://www.foxnews.com/media/entire-police-department-resigns-minnesota-town-leaves-mayor-blindsided-zero-applicants"
  },
  {
    "text": "POLL: 60% of Republican Primary Voters Support Trump for President  —  Former President Donald Trump is widening his lead over the field of Republican rivals, according to a new poll shared with The Daily Signal.  —  With support from 60% of Republican primary voters, Trump commands … ",
    "url": "https://www.dailysignal.com/2023/08/16/poll-60-of-republican-primary-voters-support-trump-for-president/"
  },
  {
    "text": "California Sen. Dianne Feinstein alleges financial abuse in lawsuit over her husband's estate  —  WASHINGTON — Sen. Dianne Feinstein, D-Calif., has called to remove the trustees of her late husband's estate, alleging that they committed financial abuse against her, according to a lawsuit filed earlier this month.",
    "url": "https://www.usatoday.com/story/news/politics/2023/08/16/dianne-feinstein-alleges-financial-abuse-california-estate/70601091007/"
  },
  {
    "text": "Janet Yellen explains her ‘magic mushroom’ experience in China  —  New York CNN  —  US Treasury Secretary Janet Yellen ate a “magic mushroom” on a recent trip to Beijing, but the aftereffects don't sound that special.  —  CNN's Erin Burnett spoke to her Monday, asking about the … ",
    "url": "https://www.cnn.com/2023/08/15/business/janet-yellen-magic-mushrooms-china/"
  },
  {
    "text": "Elon Musk's X is throttling traffic to websites he dislikes  —  The site formerly known as Twitter has added a five-second delay when a user clicks on a shortened link to the New York Times, Facebook and other sites Musk commonly attacks, a Washington Post analysis found",
    "url": "https://www.washingtonpost.com/technology/2023/08/15/twitter-x-links-delayed/"
  },
  {
    "text": "German Cannabis Bill Passes Cabinet in Legalization Push  — Draft law allowing adults to have 25 grams sent to parliament  — Adults can also grow as many as three plants, establish clubs  —  Germany's ruling coalition approved a scaled-back plan to decriminalize personal use of cannabis … ",
    "url": "https://www.bloomberg.com/news/articles/2023-08-16/german-cannabis-bill-passes-scholz-cabinet-in-legalization-push"
  },
  {
    "text": "DOJ: Government did not ‘renege’ on Hunter Biden plea deal  —  In a Tuesday filing, federal prosecutors working on the case against President Joe Biden's son, Hunter, said they “did not renege” on a previous plea agreement with the younger Biden.  —  Hunter Biden and his legal team alleged … ",
    "url": "https://thehill.com/regulation/court-battles/4153972-doj-government-did-not-renege-hunter-biden-plea-deal/"
  }
]