[
  {
    "text": "Pence told Jan. 6 special counsel harrowing details about 2020 aftermath, warnings to Trump: Sources  —  The former VP is the top official known to have spoken with investigators.  —  In this Nov. 24, 2020 file photo President Donald Trump and Vice President Mike Pence prepare to speak … ",
    "url": "https://abcnews.go.com/US/pence-told-jan-6-special-counsel-harrowing-details/story?id=105183391"
  },
  {
    "text": "Trump's Backdoor Attempts to Delay His Trials Are Backfiring  —  The New York judge overseeing Donald Trump's hush money trial won't even consider pushing it back, especially after prosecutors accused defense lawyers of delay games. … Donald Trump's calendar is filling up—and not with campaign events.",
    "url": "https://www.thedailybeast.com/trumps-new-gambit-to-delay-his-trials-isnt-quite-working"
  },
  {
    "text": "Georgia prosecutors oppose plea deals for Trump, Meadows and Giuliani  —  Exclusive: sources say Fulton county prosecutors unwilling to offer deals to key trio, preferring instead to force them to trial  —  Fulton county prosecutors do not intend to offer plea deals to Donald Trump and at least … ",
    "url": "https://www.theguardian.com/us-news/2023/nov/28/trump-trial-georgia-no-plea-deal"
  },
  {
    "text": "Billionaire-backed Koch network endorses Nikki Haley for president  — The political network largely financed by billionaire Charles Koch has endorsed Nikki Haley for president.  — The endorsement marks the end of a yearlong search for a viable alternative to Donald Trump.",
    "url": "https://www.cnbc.com/2023/11/28/billionaire-backed-koch-network-endorses-nikki-haley-for-president.html"
  },
  {
    "text": "Koch network endorses Nikki Haley for president as it looks to stop Trump  —  The powerful political network led by conservative billionaire Charles Koch endorsed Nikki Haley for president on Tuesday, as it looks to stop Donald Trump from being the Republican nominee.",
    "url": "https://www.washingtonpost.com/elections/2023/11/28/koch-network-haley-president/"
  },
  {
    "text": "The Hunter Biden counter-offensive: A strategy long overdue, or a political minefield  —  The president's son has a new legal plan, and it will play out in parallel with his father's reelection campaign.  —  For years, as Hunter Biden faced a protracted criminal probe … ",
    "url": "https://www.politico.com/news/2023/11/28/hunter-biden-legal-strategy-00127787"
  },
  {
    "text": "CIA director pushes big hostage deal in secret meeting with Mossad chief  —  The meeting in Qatar comes as William Burns takes on a central role navigating the crisis for President Biden  —  CIA Director William J. Burns arrived in Qatar on Tuesday for secret meetings with Israel's spy chief … ",
    "url": "https://www.washingtonpost.com/national-security/2023/11/28/cia-william-burns-israel-hamas-hostages/"
  },
  {
    "text": "Ukrainian spy chief's wife poisoned, media reports say  —  The wife of Ukraine's military spy chief has been poisoned with heavy metals and is undergoing treatment in a hospital, a spokesperson for the agency said on Tuesday.  —  Marianna Budanova is the wife of Kyrylo Budanov … ",
    "url": "https://www.reuters.com/world/europe/ukrainian-spy-chiefs-wife-poisoned-media-reports-say-2023-11-28/"
  },
  {
    "text": "Why the Fifth Circuit Keeps Making Such Outlandish Decisions  —  Where to even start in cataloging the most ridiculous—and alarming—recent rulings to come out of the U.S. Court of Appeals for the Fifth Circuit?  —  There's a case about whether a class action could go forward that boiled … ",
    "url": "https://www.theatlantic.com/politics/archive/2023/11/fifth-circuit-conservative-supreme-court/676116/"
  },
  {
    "text": "Tuesday Tribute Service for Rosalynn Carter Will Feature Family Members, Favorite Scriptures, Music  — President and Mrs. Biden, Vice President, Former First Ladies to Attend  — Georgia Governor, Atlanta Mayor, Emory Presidents Expected  —  An invitation-only tribute service for former … ",
    "url": "https://www.cartercenter.org/news/pr/2023/rosalynn-carter-tuesday-motorcade-route-set.html"
  },
  {
    "text": "Major news outlets gave much less coverage to Trump's “vermin” attack then they did Clinton's “deplorables” remark  —  Huge disparities mark coverage in national broadcast, cable, and print outlets  —  RESEARCH CONTRIBUTIONS FROM ROB SAVILLO, HARRISON RAY, PETE TSIPIS & TORRI LONERGAN",
    "url": "https://www.mediamatters.org/donald-trump/major-news-outlets-gave-much-less-coverage-trumps-vermin-attack-then-they-did-clintons"
  },
  {
    "text": "The Left's fear of fascism under Trump is the ultimate example of projection  —  The liberal crazies, from actor Rob Reiner to the once conservative but now ideologue-for-sale Joe Scarborough, have their knickers in a knot over the potential that America may drift into “fascism” … ",
    "url": "https://www.washingtonexaminer.com/restoring-america/fairness-justice/lefts-fear-fascism-under-trump-ultimate-example-projection"
  },
  {
    "text": "Antagonisms flare as red states try to dictate how blue cities are run  —  Despite long advocating small government and local control, Republican governors and legislators across a significant swath of the country are increasingly overriding the actions of Democratic cities … ",
    "url": "https://www.washingtonpost.com/nation/2023/11/27/red-states-blue-cities-preemption-control/"
  },
  {
    "text": "Jewish groups sue University of California over ‘unchecked’ antisemitism  —  The 36-page lawsuit argues that UC Berkeley and its law school's inaction on discrimination against Jewish students has led to a spread of antisemitism.  —  Jewish groups are suing the University of California system … ",
    "url": "https://www.politico.com/news/2023/11/28/jewish-groups-university-california-antisemitism-lawsuit-00128772"
  },
  {
    "text": "Russian court extends detention of WSJ reporter Evan Gershkovich until end of January  —  The hearing took place behind closed doors because authorities say details of the criminal case against the American journalist are classified.  —  MOSCOW — A court in Moscow on Tuesday extended … ",
    "url": "https://www.nbcnews.com/news/world/russian-court-extends-detention-wsj-reporter-evan-gershkovich-end-janu-rcna126941"
  },
  {
    "text": "Why Biden is falling behind on nominations  —  Good morning, Early Birds.  This evening is the Capitol Christmas Tree Lighting.  The tree is a Norway spruce from West Virginia's Monongahela National Forest.  Tips: earlytips@washpost.com.  Was this forwarded to you?  Sign up here.",
    "url": "https://www.washingtonpost.com/politics/2023/11/28/why-biden-is-falling-behind-nominations/"
  },
  {
    "text": "Sports Illustrated Published Articles by Fake, AI-Generated Writers  —  There was nothing in Drew Ortiz's author biography at Sports Illustrated to suggest that he was anything other than human.  —  “Drew has spent much of his life outdoors, and is excited to guide you through his never-ending list … ",
    "url": "https://futurism.com/sports-illustrated-ai-generated-writers"
  },
  {
    "text": "‘Stop the price gouging’: Biden hits corporations over high consumer costs  — President Joe Biden took aim at corporations for charging prices he said were artificially high.  — “Any corporation that has not brought their prices back down, even as inflation has come down … ",
    "url": "https://www.cnbc.com/2023/11/27/white-house-supply-chain-bidenomics-wins.html"
  }
]