[
  {
    "text": "Where Things Stand  — House Republican leaders are offering a new proposal to avert a shutdown, a day after President-elect Donald J. Trump torpedoed a spending deal that House Speaker Mike Johnson had struck with Democrats.  The plan would tie an extension of government funding … ",
    "url": "https://www.nytimes.com/live/2024/12/19/us/trump-spending-government-shutdown"
  },
  {
    "text": "The World's Richest Man Wants to Burn It All Down  —  Per NBC News, the Republicans who welcomed Elon Musk into their tent as a key decision-maker and thought leader are having an excellent time: … Happy Thursday.  —  The Kent Brockman Republicans  —  by William Kristol",
    "url": "https://www.thebulwark.com/p/the-worlds-richest-man-wants-to-burn"
  },
  {
    "text": "Republicans Cut Child Cancer Research From Funding Bill After Musk's Meddling  —  The House GOP has been in a state of chaos after the billionaire led a campaign to kill a bipartisan funding bill  —  Less than 48 hours before defaulting and triggering a shutdown, Congress is still scrambling … ",
    "url": "https://www.rollingstone.com/politics/politics-news/gop-cuts-child-cancer-research-funding-bill-musk-1235212295/"
  },
  {
    "text": "GOP strikes a new spending deal  —  Republicans have struck a deal on a short-term government spending patch and potential debt limit increase, according to two GOP lawmakers meeting in Speaker Mike Johnson's office Thursday afternoon.  “There is an agreement,” said Rep. Stephanie Bice (R-Okla.).",
    "url": "https://www.politico.com/live-updates/2024/12/19/congress/gop-strikes-a-new-spending-deal-00195410"
  },
  {
    "text": "The Chaos Monkeys Have Already Taken Over the Zoo  —  The peddlers of misinformation are high on their own supply  —  Well, I was going to post about proposals for bank deregulation, but I think that can wait for a bit.  The news of the moment is the looming prospect that the federal government will shut down over the weekend.",
    "url": "https://paulkrugman.substack.com/p/the-chaos-monkeys-have-already-taken"
  },
  {
    "text": "Trump team affirms he's leader of GOP amid ‘President Musk’ barbs  —  President-elect Trump's transition team pushed back against Democratic lawmakers who suggested Elon Musk is the “real leader” of the Republican Party after his aggressive pressure campaign against a stopgap spending measure.",
    "url": "https://thehill.com/policy/technology/5049293-trump-musk-republican-party/"
  },
  {
    "text": "The GOP Is Treating Musk Like He's in Charge  —  This week, the world's richest person solidified his influence over American politics.  —  Yesterday, a tantrum from the world's richest person swayed events in Congress.  First, Elon Musk launched a blizzard of X posts denouncing … ",
    "url": "https://www.theatlantic.com/newsletters/archive/2024/12/the-gop-is-treating-musk-like-hes-in-charge/681117/"
  },
  {
    "text": "Shutdown threatens ‘chaos’ for Trump's transition and inauguration  —  Transition “landing teams” were already delayed and may now lose access to the staffers briefing them.  —  The collapse of Congress' spending negotiations is throwing the presidential transition and preparations … ",
    "url": "https://www.politico.com/news/2024/12/19/shutdown-trump-transition-chaos-00195393"
  },
  {
    "text": "Republicans scramble for a path forward after spending plan collapse  —  House Republican leaders planned to work through the night and into Friday on a Plan C for funding the government, after abandoning their deal with Democrats and failing to pass an alternative backed by President-elect Donald Trump.",
    "url": "https://www.politico.com/live-updates/2024/12/19/congress/republicans-scramble-for-plan-c-00195514"
  },
  {
    "text": "Trump's demands leave Republicans flailing with no plan on eve of shutdown  —  GOP leaders have kept both chambers waiting as they privately discuss a Plan B after President-elect Donald Trump and Elon Musk torched their bipartisan funding deal.  —  WASHINGTON — House Speaker Mike Johnson … ",
    "url": "https://www.nbcnews.com/politics/congress/trumps-demands-leave-republicans-no-plan-government-shutdown-rcna184866"
  },
  {
    "text": "House GOP drops PBM reforms in scaled-down spending bill  —  House Republicans have abandoned language to rein in the pharmacy benefit manager (PBM) industry from a new government funding bill released late Thursday.  —  Leaders earlier this week agreed to PBM reforms as part of a sweeping health package … ",
    "url": "https://thehill.com/policy/healthcare/5049676-house-republicans-drop-pbm-reform/amp/"
  },
  {
    "text": "GA appeals court disqualifies DA Fani Willis from Trump election case, lets indictment stand … A Georgia appeals court on Thursday disqualified Fulton County District Attorney Fani Willis from overseeing the criminal election interference prosecution of President-elect Donald Trump and other defendants.",
    "url": "https://www.cnbc.com/2024/12/19/trump-georgia-da-fani-willis-disqualified.html"
  },
  {
    "text": "How Liberal America Came to Its Senses … A decade ago, cultural norms in elite American institutions took a sharply illiberal turn.  Professors would get disciplined, journalists fired, ordinary people harassed by social-media mobs, over some decontextualized phrase or weaponized misunderstanding.",
    "url": "https://www.theatlantic.com/ideas/archive/2024/12/cancel-culture-illiberalism-dead/681031/"
  },
  {
    "text": "Jeff Bezos and Donald Trump met for dinner at Mar-a-Lago, joined by Elon Musk  —  After feuds during Trump's first term, Trump and Bezos have both noted their recent evolving relationship.  —  President-elect Donald Trump had dinner Wednesday with Amazon founder Jeff Bezos … ",
    "url": "https://www.washingtonpost.com/politics/2024/12/19/trump-bezos-musk-dinner/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM0NTg0NDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM1OTY2Nzk5LCJpYXQiOjE3MzQ1ODQ0MDAsImp0aSI6IjU1NTE1YjRiLTdiMGYtNDM2OS05NTZjLTBhNjQwMjU1MGNiMiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzEyLzE5L3RydW1wLWJlem9zLW11c2stZGlubmVyLyJ9.Zlti6VTMhsU7lsOF-ROnULsEFtdy5SXLnlyTrCr6syI&itid=gfta"
  },
  {
    "text": "How the White House Functioned With a Diminished Biden in Charge  —  Aides kept meetings short and controlled access, top advisers acted as go-betweens and public interactions became more scripted.  The administration denied Biden has declined.  —  During the 2020 presidential primary … ",
    "url": "https://www.wsj.com/politics/biden-white-house-age-function-diminished-3906a839?st=Cf7dGH"
  },
  {
    "text": "GOP lawmakers prepare to carry out Gaetz's revenge, expose harassment settlements  —  Former Rep. Matt Gaetz, the focus of a House Ethics Committee report that may soon become public, is planning to inflict fresh pain on some of his old colleagues.  A number of Republican lawmakers are preparing to help.",
    "url": "https://www.politico.com/live-updates/2024/12/19/congress/gaetzs-revenge-00195398"
  },
  {
    "text": "Top aide to Eric Adams indicted on bribery and conspiracy charges  —  The aide's son and two developers were also charged.  —  NEW YORK — Prosecutors charged New York City Mayor Eric Adams' closest confidant in a conspiracy, bribery and money laundering case Thursday.",
    "url": "https://www.politico.com/news/2024/12/19/ingrid-lewis-martin-indicted-new-york-eric-adams-aide-00195366"
  },
  {
    "text": "Teamsters Launch Largest Strike Against Amazon in American History  —  Workers to Strike $2 Trillion Corporation Nationwide on Thursday  —  Press Contact: Kara Deniz Email: kdeniz@teamster.org  —  (WASHINGTON) - The Teamsters will launch the largest strike against Amazon in U.S. history beginning at 6 a.m. EST on Thurs., Dec. 19.",
    "url": "https://teamster.org/2024/12/teamsters-launch-largest-strike-against-amazon-in-american-history/"
  }
]