[
  {
    "text": "Live Updates: Trump Threatens to Cut Elon Musk's Government Contracts as Feud Escalates  —  The open acrimony between the two men comes after the billionaire denounced President Trump's signature domestic policy bill as an “abomination.”  —  Haiyun Jiang for The New York Times  —  Here's the latest.",
    "url": "https://www.nytimes.com/live/2025/06/05/us/trump-elon-musk"
  },
  {
    "text": "The Day That Trump and Musk Torched Their Partnership  —  An afternoon of escalating attacks left the men threatening to wield their power against each other  —  WASHINGTON—This is exactly what President Trump and his advisers were trying to avoid.  —  Just six days ago … ",
    "url": "https://www.wsj.com/politics/elon-musk-trump-fight-gop-bill-c2e0be66?st=L4UgZk&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Trump and His Team Tease Vengeance Against Elon as Feud Goes Nuclear  —  The president is threatening to “terminate” Musk's federal contracts, while a senior appointee warns the administration could investigate his companies  —  President Donald Trump has threatened to “terminate” … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-threatens-vengeance-against-elon-musk-feud-1235356996/"
  },
  {
    "text": "Scoop: Democrats probe whether Trump is in the Epstein files  —  House Democrats are asking the Department of Justice and FBI whether it is true, as Elon Musk now claims, that President Trump is in the Epstein files, Axios has learned.  —  Why it matters: It's the starkest example to date … ",
    "url": "https://www.axios.com/2025/06/06/trump-epstein-files-doj-democrats-musk-bondi"
  },
  {
    "text": "Trump and Musk's relationship flames out just as intensely and publicly as it started  —  Donald Trump and Elon Musk's alliance took off like one of SpaceX's rockets.  It was supercharged and soared high.  And then it blew up.  —  The spectacular flameout Thursday peaked as Trump threatened … ",
    "url": "https://apnews.com/article/trump-musk-tax-bill-6e7845081259c34db785182c51569c0c"
  },
  {
    "text": "Musk calls for Trump's impeachment  —  Elon Musk unleashed a fresh round of tweets Thursday evening, calling for President Trump to be impeached and declaring that SpaceX would begin decommissioning a spacecraft essential to NASA's operation.  —  Why it matters: Trump's threat to cancel billions … ",
    "url": "https://www.axios.com/2025/06/05/musk-trump-impeachment"
  },
  {
    "text": "Trump, White House aides signal a possible détente with Musk  —  The two men have been embroiled in a feud over legislation that encompasses the president's agenda.  —  Signs of a truce are emerging in the increasingly bitter clash between two of the world's most powerful men.",
    "url": "https://www.politico.com/news/2025/06/05/trump-white-house-aides-signal-a-possible-detente-with-musk-00391502"
  },
  {
    "text": "Mike Johnson scrambles to stop Elon Musk from torching the megabill  —  The speaker is mounting a multi-front rebuttal to the billionaire's criticism — and trying to keep the backlash contained.  —  Mike Johnson has spent his 19 months as speaker forging a close relationship with President Donald Trump … ",
    "url": "https://www.politico.com/news/2025/06/05/elon-musk-mike-johnson-megabill-00390657"
  },
  {
    "text": "Tesla Plunges After Conflict Erupts Between Musk and Trump … Trump on Thursday said he was “very disappointed” by the Tesla chief executive officer's criticism of the president's signature tax policy bill.  Musk fired back in several social media posts, saying in one that “without me, Trump would have lost the election.”",
    "url": "https://www.bloomberg.com/news/articles/2025-06-05/tesla-has-1-2-billion-at-risk-in-trump-bill-musk-wants-to-kill"
  },
  {
    "text": "Trump and Musk's Relationship Melts Down in Spectacular Fashion  —  The speed of the fallout was breathtaking, with President Trump celebrating Elon Musk during an Oval Office farewell just last Friday.  —  The moment had finally come, and it was every bit as lowdown, vindictive, personal … ",
    "url": "https://www.nytimes.com/2025/06/05/us/politics/trump-elon-musk-fight.html"
  },
  {
    "text": "The White House adviser who helped fuel Trump-Musk feud  —  Shortly after President Trump unexpectedly withdrew Elon Musk's pick to lead NASA last weekend, one name quickly surfaced as a major force behind the surprise decision: top White House aide Sergio Gor.",
    "url": "https://www.axios.com/2025/06/06/trump-musk-feud-nasa-white-house-aide"
  },
  {
    "text": "The Musk-Trump Divorce Is as Messy as You Thought It Would Be  —  The world's richest man and its most powerful leader channel their inner middle schooler in a breakup for the ages.  —  Shamelessness, defined as brazen disregard for that which might deter anyone else, has always been one of Donald Trump's superpowers.",
    "url": "https://www.newyorker.com/news/letter-from-trumps-washington/the-musk-trump-divorce-is-as-messy-as-you-thought-it-would-be"
  },
  {
    "text": "Republicans worry Medicaid cuts would hurt their communities, poll finds  —  While Democrats and independents are far more likely to have concerns, the Republican concerns illustrate the perils as the Senate weighs Medicaid cuts.  —  More than 4 in 10 Republicans worried significant cuts … ",
    "url": "https://www.washingtonpost.com/health/2025/06/06/medicaid-cuts-poll-trump-big-budget-bill/"
  },
  {
    "text": "ICE officers stuck in Djibouti shipping container with deported migrants  —  Trump officials transferred the migrants to the East African nation in response to a judge's order.  They now face threats that include rocket attacks from Yemen.  —  Nearly a dozen immigration officers … ",
    "url": "https://www.washingtonpost.com/immigration/2025/06/05/djibouti-deportations-migrants-ice-trump/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9"
  },
  {
    "text": "Immigration agents mistakenly detain deputy U.S. marshal in Tucson, feds confirm  —  A deputy U.S. marshal was mistakenly detained by immigration agents inside the federal building that houses Tucson's immigration court, U.S. Marshals Service officials confirmed on Thursday.",
    "url": "https://tucson.com/news/local/border/article_2573f016-3596-4f32-93f7-7e99b6459675.html"
  },
  {
    "text": "Harvard Sues Over Trump Barring Foreign Students' US Entry  —  Harvard University sued to stop the Trump administration from barring its international students' entrance to the US, adding to a high-stakes legal battle between the government and the school.  —  Harvard asked a judge on Thursday … ",
    "url": "https://www.bloomberg.com/news/articles/2025-06-05/harvard-sues-over-trump-barring-its-foreign-students-us-entry"
  },
  {
    "text": "Trump threatens Musk the same way he did Harvard  —  He threatened to use federal contracts to gain retribution.  —  A federal contract is for services rendered in the public interest as specified in the contract.  It is not payment for political loyalty to a temporary occupant of the White House.",
    "url": "https://steveinskeep.substack.com/p/trump-threatens-musk-the-same-way"
  },
  {
    "text": "D.C.'s Reagan National Airport will close during Army's birthday bash  —  Military flyovers and fireworks on June 14, which coincides with Trump's birthday, are expected to disrupt commercial passenger flights.  —  Reagan National Airport is expected to halt takeoffs and landings … ",
    "url": "https://www.washingtonpost.com/business/2025/06/05/army-trump-birthday-parade-airport-closure/"
  },
  {
    "text": "A Massachusetts student arrested by ICE on his way to volleyball practice has been released  —  A Massachusetts high school student who was arrested by immigration agents on his way to volleyball practice has been released from custody after a judge granted him bond Thursday.",
    "url": "https://apnews.com/article/marcelo-gomes-ice-massachusetts-arrest-volleyball-1356302a723f6f5b0a95028754f7291e"
  }
]