[
  {
    "text": "Special Counsel Report Says Trump Would Have Been Convicted in Election Case  —  “But for Mr. Trump's election and imminent return to the presidency, the office assessed that the admissible evidence was sufficient to obtain and sustain a conviction at trial,” the report said.",
    "url": "https://www.nytimes.com/2025/01/14/us/politics/trump-special-counsel-report-election-jan-6.html?unlocked_article_code=1.pE4.qEsJ.JEVOGbzuKumK&smid=url-share"
  },
  {
    "text": "Justice Dept. releases Trump special counsel report on Jan. 6 case  —  President-elect Donald Trump has tried to prevent the release of special counsel Jack Smith's report before he takes office next week.  —  If Donald Trump wasn't elected president in November, the Justice Department … ",
    "url": "https://www.washingtonpost.com/national-security/2025/01/13/trump-jan-6-classified-documents-investigations-report-jack-smith/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM2NzQ0NDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM4MTI2Nzk5LCJpYXQiOjE3MzY3NDQ0MDAsImp0aSI6ImY3NDAxYjhlLTgwMTAtNDMxMi04ZGFhLTc1NzE4NzI4ZmZhMyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb25hbC1zZWN1cml0eS8yMDI1LzAxLzEzL3RydW1wLWphbi02LWNsYXNzaWZpZWQtZG9jdW1lbnRzLWludmVzdGlnYXRpb25zLXJlcG9ydC1qYWNrLXNtaXRoLyJ9.htf79lOEXtgCoUMTpZO0-Xm_DRjwQJa0IS63ZOR4aXk&itid=gfta"
  },
  {
    "text": "A Contrarian Take on Volume One of Jack Smith's Report  —  The fact that we are already familiar with almost all of the facts in the first volume of Jack Smith's final report on January 6th and Donald Trump's attempted self-coup, makes them no less horrifying.",
    "url": "https://contrarian.substack.com/p/a-contrarian-take-on-volume-one-of"
  },
  {
    "text": "The Report on Trump's 2020 Election Subversion Is Damning  —  “The admissible evidence was sufficient to obtain and sustain a conviction at trial,” Jack Smith's team wrote in the 130-page report … The 130-page report is damning, and concludes that “the admissible evidence was sufficient to obtain and sustain a conviction at trial.”",
    "url": "https://www.rollingstone.com/politics/politics-news/jack-smith-report-trump-2020-election-subversion-damning-1235234566/"
  },
  {
    "text": "The Pressure Campaign to Get Pete Hegseth Confirmed as Defense Secretary  —  Supporters of Donald Trump's nominee have intimidated potential witnesses and suppressed the F.B.I. background check of the former Fox News host in the run-up to his Senate hearing.",
    "url": "https://www.newyorker.com/news/the-lede/the-pressure-campaign-to-get-pete-hegseth-confirmed-as-defense-secretary"
  },
  {
    "text": "Former Fox anchor Gretchen Carlson makes request ahead of hearing  —  Former Fox News anchor Gretchen Carlson and her nonprofit group sent a letter yesterday asking the Senate Armed Services Committee to allow an alleged victim of sexual assault to testify anonymously at Hegseth's confirmation hearing.",
    "url": "https://www.nbcnews.com/politics/congress/live-blog/senate-confirmation-hearings-live-updates-pete-hegseth-first-trump-cab-rcna186867/rcrd68168"
  },
  {
    "text": "China Discusses Sale of TikTok US to Musk as One Possible Option  — ByteDance's preferred strategy is to fight ban, sources say  — Trump has said he would like to delay ban to seek resolution  —  Chinese officials are evaluating a potential option that involves Elon Musk acquiring … ",
    "url": "https://www.bloomberg.com/news/articles/2025-01-14/china-discusses-sale-of-tiktok-us-to-musk-as-one-possible-option?accessToken=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzb3VyY2UiOiJTdWJzY3JpYmVyR2lmdGVkQXJ0aWNsZSIsImlhdCI6MTczNjgxMzk1OSwiZXhwIjoxNzM3NDE4NzU5LCJhcnRpY2xlSWQiOiJTUFJTMDNUMEFGQjQwMCIsImJjb25uZWN0SWQiOiI3MDQyN0U3REVGMkM0MDEzODNCNDUzRjAyNUE2NDc3NyJ9.7qgkxCtNvjSnnOz1POZ22exlVzW6sZbXYfKK9YbQ3oU&leadSource=uverify%20wall"
  },
  {
    "text": "Bannon: Zuckerberg 'can't be trusted'  —  Steve Bannon, a former adviser to President-elect Trump, went after Meta CEO Mark Zuckerberg in a Monday episode of his “Bannon's War Room” podcast.  —  “Zuckerberg can't be trusted, at all,” Bannon said on his show, in a clip highlighted by Mediaite.",
    "url": "https://thehill.com/policy/technology/5084210-steve-bannon-meta-mark-zuckerberg/"
  },
  {
    "text": "Zuckerberg Debuts ‘Real Mark’ in Push to Woo Trump  —  Meta pursues a MAGA makeover, in the latest political pivot for a company that once banned the now-president-elect from its platforms  —  Mark Zuckerberg wants Donald Trump to get to know the “real Mark.”",
    "url": "https://www.wsj.com/tech/mark-zuckerberg-meta-trump-pivot-392e4a3f?st=jPh9dB&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Marco Rubio Isn't Likely to Last Long as Secretary of State  —  He's being undermined by fellow Republicans, and that's before he shows up to lead a workforce Trump distrusts.  —  Congratulations, Marco Rubio!  You'll soon be secretary of State.  —  Condolences, too.  You're not likely to last long in the job.",
    "url": "https://www.politico.com/news/magazine/2025/01/14/marco-rubio-secretary-of-state-column-00197805"
  },
  {
    "text": "Harris declines to invite Vance for courtesy visit to vice president's residence before inauguration  —  When JD Vance, his wife Usha and their three young children move into the Naval Observatory residence on Jan. 20, it will be their first time inside the white Queen Anne-style mansion … ",
    "url": "https://www.cbsnews.com/news/harris-jd-vance-vice-presidents-residence/"
  },
  {
    "text": "Michelle Obama will skip Trump inauguration, but ex-Presidents Obama, Clinton and Bush will be there  —  Former first lady Michelle Obama will skip the inauguration of President-elect Donald Trump, the second time in two weeks that she is not attending a gathering of former U.S. leaders and their spouses … ",
    "url": "https://apnews.com/article/trump-inauguration-obama-bush-clinton-f7212766dc0f69444d8a4537a736c2d2"
  },
  {
    "text": "Bannon taunts Musk: He doesn't have that much power  —  As Trump's big-tent GOP returns to power, Bannon and Musk have served as a prime example of the infighting already underway.  —  Steve Bannon taunted his fellow Trump ally Elon Musk on Tuesday, telling POLITICO that the president-elect's … ",
    "url": "https://www.politico.com/news/2025/01/14/bannon-on-musk-he-doesnt-have-that-much-power-00198060"
  },
  {
    "text": "The president who could not choose  —  Joe Biden's fatal flaw led to four years of weakness. … Build Back Better was a sweeping agenda of economic reform on the scale of the New Deal, meant to solidify its author as the “FDR-sized” president he wanted to be.  —  Dusting the text off now, you can feel that ambition.",
    "url": "https://www.vox.com/politics/394712/joe-biden-president-legacy-inflation-manchin"
  },
  {
    "text": "January 2025 National Poll: Democrats, Republicans, and Independents Agree U.S. is on the Wrong Track  —  Home Polls January 2025 National Poll: Democrats, Republicans, and Independents Agree U.S. is on the Wrong Track  —  A majority of voters think climate change contributed to raging California wildfires.",
    "url": "https://emersoncollegepolling.com/january-2025-national-poll-democrats-republicans-and-independents-agree-u-s-is-on-the-wrong-track/"
  },
  {
    "text": "Rashida Jones, MSNBC President, Steps Down  —  Rebecca Kutler, senior vice president of content strategy at MSNBC, will succeed Ms. Jones as interim president.  —  The president of MSNBC, Rashida Jones, is stepping down from that position, the company said on Tuesday, a major change … ",
    "url": "https://www.nytimes.com/2025/01/14/business/media/msnbc-rashida-jones-stepping-down.html?unlocked_article_code=1.pE4.ieQy.XlIXLcIv5sQn&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "It was the Best of Biden, It was the Worst of Biden  —  As President Biden's final days in public service wind down, his legislative accomplishments and the stumbles of his presidency are laid bare  —  The release of the first volume of Special Counsel Jack Smith's report provides … ",
    "url": "https://contrarian.substack.com/p/it-was-the-best-of-biden-it-was-the"
  },
  {
    "text": "Putin needs Trump's help more than ever  —  And Trump is signaling that he'll deliver.  —  It's been nearly three years since Vladimir Putin's despotic regime began its reign of terror against Ukraine by attempting to conquer the country and, in Putin's words, put an end to the “fictional” Ukrainian nation.",
    "url": "https://www.publicnotice.co/p/putin-trump-ukraine-inauguration-2025"
  },
  {
    "text": "‘Conditions’ should be placed on California wildfire aid: House Speaker Mike Johnson  —  A number of Republicans are calling for conditions to any federal aid that goes to California as the state struggles with catastrophic wildfires.  One Democrat says it could come back to bite them.",
    "url": "https://www.usatoday.com/story/news/politics/2025/01/13/house-speaker-mike-johnson-california-wildfire-aid/77681997007/"
  },
  {
    "text": "Biden's Push to Cancel Student Debt Surpasses 5 Million Borrowers  —  With Monday's authorization and 27 previous ones, the Biden administration has forgiven over $180 billion in student loans, even as its larger policy vision never took root.  —  The Education Department announced on Monday … ",
    "url": "https://www.nytimes.com/2025/01/13/us/politics/biden-student-loan-forgiveness.html"
  },
  {
    "text": "Consumer bureau sues Capital One for ‘cheating’ customers on savings account interest  —  The government's consumer watchdog on Tuesday sued Capital One for alleging “cheating” customers out of billions in interest payments.  —  The Consumer Financial Protection Bureau (CFPB) … ",
    "url": "https://thehill.com/business/5084563-capital-one-sued-interest-payments/"
  },
  {
    "text": "Democrats will get amendments to Senate immigration bill, says key Republican  —  Sen. Katie Britt (R-Ala.) said on Tuesday that there will “absolutely” be amendments to the Senate GOP's first immigration bill — indication that Republicans will agree to Democratic demands for a more expansive legislative debate.",
    "url": "https://www.politico.com/live-updates/2025/01/14/congress/lakin-riley-amendments-immigration-00198095"
  }
]