[
  {
    "text": "What Trump promised oil CEOs as he asked them to steer $1 billion to his campaign  —  Donald Trump has pledged to scrap President Biden's policies on electric vehicles and wind energy, as well as other initiatives opposed by the fossil fuel industry.  —  As Donald Trump sat … ",
    "url": "https://www.washingtonpost.com/politics/2024/05/09/trump-oil-industry-campaign-money/"
  },
  {
    "text": "As co-rulers of the House, the Democratic majority-in-waiting may have already arrived  —  In a House with a single-vote GOP majority, many argue that Democrats are no longer just the majority-in-waiting — but that they have already arrived.  Lawmakers of both parties … ",
    "url": "https://www.washingtonpost.com/politics/2024/05/09/house-democrats-house-speaker-hakeem-jeffries-mike-johnson/"
  },
  {
    "text": "‘Grueling’: The Trial May Be Getting to Trump  —  Did Stormy Daniels' testimony help or hurt the case against Trump?  POLITICO's reporters in the courtroom and on the campaign trail take you behind the curtain.  —  Until this week, Donald Trump's criminal trial in Manhattan has been … ",
    "url": "https://www.politico.com/news/magazine/2024/05/09/trump-trial-stormy-daniels-testimony-00156845"
  },
  {
    "text": "Stormy Daniels on having sex with Trump: ‘Nobody would ever want to publicly say that’ … Former US President Donald Trump speaks to the press before his trial for allegedly covering up hush money payments linked to extramarital affairs, at Manhattan Criminal Court in New York City, on May 9, 2024.",
    "url": "https://www.cnbc.com/2024/05/09/trump-trial-stormy-daniels-testimony-hush-money-case.html"
  },
  {
    "text": "Biden says he will stop sending bombs and artillery shells to Israel if they launch major invasion of Rafah  —  Programming note: CNN's Erin Burnett's full interview with President Joe Biden airs at 7 p.m. ET on “Erin Burnett OutFront”  —  President Joe Biden said for the first time Wednesday … ",
    "url": "https://www.cnn.com/2024/05/08/politics/joe-biden-interview-cnntv"
  },
  {
    "text": "Playbook: Johnson: Biden's having a ‘senior moment’ on Israel  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  Last night on CNN, President JOE BIDEN made news by drawing a clear red line that Israel is rapidly approaching: He will halt shipments of bombs … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/05/09/johnson-bidens-having-a-senior-moment-on-israel-00156995"
  },
  {
    "text": "Barron Trump to step into the political arena as a Florida delegate at the Republican convention  —  The position as an at-large delegate for the Florida Republican Party will be the most high-profile political role thus far for Barron, former President Donald Trump's youngest son.",
    "url": "https://www.nbcnews.com/politics/donald-trump/barron-trump-florida-delegate-republican-national-convention-rcna151388"
  },
  {
    "text": "The dangerously illiberal judges  —  A group of Trump appointees vow they won't hire clerks from Columbia because students there engaged in protest they don't like. … It was likely only a matter of time before right-wing federal judges decided to weigh in on student protests over the ongoing slaughter of Palestinians.",
    "url": "https://www.publicnotice.co/p/columbia-protests-law-clerk-trump-judges-boycott"
  },
  {
    "text": "As a Veteran Reporter, I've Always Valued Neutrality.  But Trump's Threat To Democracy Should be the Biggest Political Story of 2024  —  What the New York Times is getting wrong in its coverage of Trump vs. Biden.  —  For as long as I've been a reporter, maintaining neutrality while covering politicians has been journalists' mandate.",
    "url": "https://zeteo.com/p/as-a-veteran-reporter-ive-always"
  },
  {
    "text": "How Republicans Echo Antisemitic Tropes Despite Declaring Support for Israel  —  Prominent Republicans have seized on campus protests to assail what they say is antisemitism on the left.  But for years they have mainstreamed anti-Jewish rhetoric.  —  The Republican speaker of the House … ",
    "url": "https://www.nytimes.com/2024/05/09/us/antisemitism-republicans-trump.html"
  },
  {
    "text": "Maryland 2024 Poll: Alsobrooks 42%, Trone 41%  —  Home Polls Maryland 2024 Poll: Alsobrooks 42%, Trone 41%  —  Hogan with Majority Support in GOP Primary, But Trails in General Election  —  A new Emerson College Polling/The Hill/DC News Now survey in Maryland finds the Democratic U.S. Senate primary … ",
    "url": "https://emersoncollegepolling.com/maryland-2024-poll-alsobrooks-42-trone-41/"
  },
  {
    "text": "Federal prosecutors reissue criminal charges against ex-Rep. Jeff Fortenberry  —  The Nebraska Republican was convicted of lying to the FBI two years ago, but an appeals court ruled the charges should've been brought in a different venue.  —  Federal prosecutors have charged former … ",
    "url": "https://www.politico.com/news/2024/05/09/jeff-fortenberry-criminal-charges-00157018"
  },
  {
    "text": "Seven Members and Associates of Large-Scale Gas Pump Skimming Device Organization Charged with Racketeering and Money Laundering Conspiracies  —  For Immediate Release  —  An indictment was unsealed today in the Eastern District of Virginia charging seven men with racketeer influenced … ",
    "url": "https://www.justice.gov/opa/pr/seven-members-and-associates-large-scale-gas-pump-skimming-device-organization-charged"
  },
  {
    "text": "Nikki Haley Is Huddling With Donors and Won't Endorse Donald Trump Yet  —  Some of her supporters want her to run for president in 2028, but she is watching from the sidelines for now  —  Nikki Haley is easing back into public life after dropping out of the Republican presidential race in early March … ",
    "url": "https://www.wsj.com/politics/elections/nikki-haley-is-huddling-with-donors-and-wont-endorse-donald-trump-yet-052d3d0f"
  },
  {
    "text": "Vermont poised to become first US state to charge big oil for climate damage  —  If passed, the groundbreaking measure could be a model for other states to hold fossil fuel companies liable  —  Vermont is poised to pass a groundbreaking measure forcing major polluting companies to help pay … ",
    "url": "https://www.theguardian.com/us-news/article/2024/may/09/vermont-charge-oil-industry-climate-crisis"
  },
  {
    "text": "Top Republicans, led by Trump, refuse to commit to accept 2024 election results  —  One possible vice-presidential candidate, Sen. Tim Scott (R-S.C.), repeatedly declined to say whether he will accept the outcome.  —  Top Republicans, led by former president Donald Trump … ",
    "url": "https://www.washingtonpost.com/elections/2024/05/08/trump-republicans-2024-election-results/"
  },
  {
    "text": "In surprise move, Somalia asks U.N. to end political mission  —  Somalia's government has requested the termination of a U.N. political mission that has advised it on peace-building, security reforms and democracy for over a decade, according to a letter the foreign minister wrote to the Security Council.",
    "url": "https://www.reuters.com/world/africa/surprise-move-somalia-asks-un-end-political-mission-2024-05-09/"
  },
  {
    "text": "Dems' kangaroo court against Donald Trump is only backfiring  —  For Trump haters, the Stormy Daniels trial is a fantasy come true.  —  An orgasmic treat of Donald in his boxers, being spanked on the bottom by a porno actress.  —  The former president trapped in court like a caged lion … ",
    "url": "https://nypost.com/2024/05/08/opinion/dems-kangaroo-court-against-donald-trump-is-only-backfiring/"
  },
  {
    "text": "Stack Overflow bans users en masse for rebelling against OpenAI partnership — users banned for deleting answers to prevent them being used to train ChatGPT  —  Stack Overflow is overflowing with salt.  —  Stack Overflow, a legendary internet forum for programmers and developers … ",
    "url": "https://www.tomshardware.com/tech-industry/artificial-intelligence/stack-overflow-bans-users-en-masse-for-rebelling-against-openai-partnership-users-banned-for-deleting-answers-to-prevent-them-being-used-to-train-chatgpt"
  },
  {
    "text": "Harris Warns of Supreme Court's Future Rulings: ‘I Worry About Fundamental Freedoms’  —  In an interview with The Times, Vice President Kamala Harris deepened her criticism of the conservative justices who overturned Roe and singled out Clarence Thomas's views on other settled cases.",
    "url": "https://www.nytimes.com/2024/05/09/us/politics/kamala-harris-interview.html"
  }
]