[
  {
    "text": "Republicans Are No Longer a Political Party  —  It's become yet another subsidiary of Trump Inc.  —  When historians chronicle the end of the Grand Old Party, they may mark 2024 as the turning point.  Something called the Republican Party will surely exist for years to come … ",
    "url": "https://www.theatlantic.com/ideas/archive/2024/02/republicans-are-no-longer-political-party/677437/"
  },
  {
    "text": "An Infuriating Poll Finding About Trump Should Galvanize Democrats  —  You've probably heard that Donald Trump has “tightened his grip on the Republican Party,” or that he's “bent the party to his will.”  Pundits repeat such formulations constantly, because, well, it's true … ",
    "url": "https://newrepublic.com/article/178951/poll-biden-blamed-border-deal-galvanize-democrats"
  },
  {
    "text": "‘Cowboys for Trump’ founder is hoping a Supreme Court ruling on ballot eligibility could help him too  —  Couy Griffin was thrown out of office in New Mexico under the same theory Colorado voters are seeking to use against former President Donald Trump.  —  WASHINGTON — Couy Griffin … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/cowboys-trump-founder-supreme-court-rcna138476"
  },
  {
    "text": "Statement from President Joe Biden on House GOP's Baseless Impeachment of Secretary Mayorkas  —  History will not look kindly on House Republicans for their blatant act of unconstitutional partisanship that has targeted an honorable public servant in order to play petty political games.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/02/13/statement-from-president-joe-biden-on-house-gops-baseless-impeachment-of-secretary-mayorkas/"
  },
  {
    "text": "House GOP impeaches Mayorkas by a single vote  —  Breaking: House impeaches Homeland Security Secretary Alejandro Mayorkas, succeeding on second try, in a rebuke of Biden's immigration policy.  The resolution is non-binding, however, and may not go very far in the Senate because even some Republicans … ",
    "url": "https://www.washingtonpost.com/politics/2024/02/13/mayorkas-impeachment-seccond-house-vote/"
  },
  {
    "text": "On Capitol Hill, Republicans Use Bigoted Attacks Against Political Foes  —  House and Senate Republicans have denigrated fellow lawmakers, Biden administration officials and witnesses in racist ways, both in casual comments and in official settings.  —  When Representative Marjorie Taylor Greene … ",
    "url": "https://www.nytimes.com/2024/02/13/us/politics/republicans-racist-language.html"
  },
  {
    "text": "Here's the latest on the impeachment vote.  —  House Republicans Impeach Mayorkas for Border Policies  —  In a redo of their first failed attempt, Republicans pushed through the charges over solid Democratic opposition, making the homeland security secretary the first sitting cabinet member to be impeached.",
    "url": "https://www.nytimes.com/live/2024/02/13/us/mayorkas-impeachment"
  },
  {
    "text": "Exclusive: Trump adviser proposes new tiered system for NATO members who don't pay up  —  A leading national security adviser to Donald Trump told Reuters on Tuesday that he would push for changes to NATO if the former president returns to power that could result in some member nations losing protection against an outside attack.",
    "url": "https://www.reuters.com/world/trump-adviser-proposes-new-tiered-system-nato-members-who-dont-pay-up-2024-02-13/"
  },
  {
    "text": "Democrats Propose Discharge Petition to Get Past Mike Johnson  —  Senior Democrats are suggesting that a discharge petition could be introduced to bring a $95-billion overseas aid bill to a vote in the House of Representatives if Speaker Mike Johnson refuses to introduce it.",
    "url": "https://www.newsweek.com/democrats-propose-discharge-petition-get-past-mike-johnson-1869521"
  },
  {
    "text": "After facing off with Senate ‘Freedom Caucus’, McConnell urges Johnson on Ukraine  —  But the GOP leader did not push the speaker to bring up the Senate-passed foreign aid bill, specifically.  —  The Ukraine fight has been a painful one for Mitch McConnell, fueling conservative calls … ",
    "url": "https://www.politico.com/news/2024/02/13/mcconnell-johnson-ukraine-aid-senate-00141201"
  },
  {
    "text": "High School Girls Basketball Team Quits After Crowd Allegedly Spews Racial Slurs  —  School officials in Scarsdale and East Ramapo have announced an investigation into the incident.  —  A high school girls' basketball game in Scarsdale, New York came to an early finish on Saturday … ",
    "url": "https://www.thedailybeast.com/high-school-girls-basketball-team-quits-after-crowd-spews-racial-slurs-report-says"
  },
  {
    "text": "Racial slurs spewed at Scarsdale v. East Ramapo girls basketball game, officials say  —  Scarsdale and East Ramapo school officials are investigating a reported racially charged incident during a Feb. 10 girls basketball game at Scarsdale.  It's the latest investigation into slurs being spewed during a Section 1 sporting event.",
    "url": "https://www.lohud.com/story/news/local/westchester/scarsdale/2024/02/13/racial-slurs-scarsdale-east-ramapo-ny-basketball-game-reported-investigated/72570529007/"
  },
  {
    "text": "Marjorie Taylor Greene's Rant At ‘Curb Your Enthusiasm’ Is Comedy Gold  —  The far-right congresswoman better watch out for those “nasty commies” from California.  —  LOADING  —  Rep. Marjorie Taylor Greene (R-Ga.) took her far-right views to another dimension Tuesday in a wild screed against HBO's “Curb Your Enthusiasm.”",
    "url": "https://www.huffpost.com/entry/marjorie-taylor-greene-curb-your-enthusiasm_n_65cb92bfe4b01f4a8b026670"
  },
  {
    "text": "Tesla worker killed in fiery crash may be first ‘Full Self-Driving’ fatality  —  Evidence suggests the advanced driver-assistance system was engaged during a fatal crash that killed recruiter Hans von Ohain in 2022  —  The following footage obtained by The Washington Post shows Colorado … ",
    "url": "https://www.washingtonpost.com/technology/interactive/2024/tesla-full-self-driving-fatal-crash/"
  },
  {
    "text": "Bloodbath at CBS News claims senior correspondent embroiled in First Amendment case — and another who weathered HR probe: sources  —  Several CBS News reporters were caught up in layoffs at Paramount Global that claimed 800 jobs, including one who is embroiled in a high-stakes First Amendment fight … ",
    "url": "https://nypost.com/2024/02/13/media/bloodbath-at-cbs-news-includes-reporter-fighting-first-amendment-case/"
  },
  {
    "text": "Wisconsin lawmakers adopt new legislative maps that could undo gerrymandering  —  Votes by Republican-dominated state assembly and state senate signal that the years-long battle may be finally drawing to a close  —  The fight for democracy is supported by  —  Wisconsin lawmakers voted … ",
    "url": "https://www.theguardian.com/us-news/2024/feb/13/wisconsin-senate-new-voter-maps-gerrymandering"
  },
  {
    "text": "CDC plans to drop five-day covid isolation guidelines  —  Americans who test positive for the coronavirus no longer need to routinely stay home from work and school for five days under new guidance planned by the Centers for Disease Control and Prevention.  —  The agency is loosening … ",
    "url": "https://www.washingtonpost.com/health/2024/02/13/covid-isolation-guidelines-cdc-change/"
  },
  {
    "text": "It took me three tries to register to vote in Texas — and I'm an elections reporter  —  Moments after I became a naturalized citizen in 2023, I registered to vote.  Here's what happened next. … When I started working at Votebeat more than a year ago, I knew little about elections.",
    "url": "https://www.texastribune.org/2024/02/13/exas-voter-registration-election-2024/"
  },
  {
    "text": "Exclusive: Musk's SpaceX fined after ‘near amputation’ suffered by worker, records show  —  U.S. worker safety officials fined Elon Musk's SpaceX $3,600 this month after an accident at its site in Washington state led to a “near amputation,” according to inspection records reviewed by Reuters.",
    "url": "https://www.reuters.com/technology/space/musks-spacex-fined-near-amputation-suffered-by-worker-records-show-2024-02-13/"
  },
  {
    "text": "Scoop: Israeli minister blocking flour Bibi promised Biden would be allowed into Gaza  —  Israeli ultranationalist Finance Minister Bezalel Smotrich is blocking a U.S.-funded flour shipment to Gaza because its recipient is the UN Relief and Works Agency (UNRWA), two Israeli and U.S. officials told Axios.",
    "url": "https://www.axios.com/2024/02/13/israel-gaza-flour-shipment"
  },
  {
    "text": "Anti-DEI Law Implementation Has Been a Disaster … In Texas, we know that incoming hurricanes require preparations to reduce damage.  But the state's colleges and universities were ill-prepared for the superstorm of Senate Bill 17 (SB 17).  Passed during the recent, regular session … ",
    "url": "https://www.texasobserver.org/anti-dei-law-implementation-has-been-a-disaster/"
  }
]