[
  {
    "text": "After Fury, Netanyahu Deletes, Apologizes for Post Blaming Security Chiefs for Hamas Attack  —  In a post overnight Saturday, Netanyahu asserted that he never received forewarning about Hamas' deadly attack.  He earlier said ‘After the war everyone will have to answer to hard questions...Right now, my task is to save the country’",
    "url": "https://www.haaretz.com/israel-news/2023-10-29/ty-article/after-drawing-fury-netanyahu-deletes-tweet-blaming-security-chiefs-for-hamas-attack/0000018b-7a77-d4a8-a3cf-feff35d20000"
  },
  {
    "text": "Israel's Netanyahu says wasn't shown intel of planned Hamas attack  —  Israeli Prime Minister Benjamin Netanyahu on Sunday took a jab at his intelligence chiefs on the X platform, saying they never warned him Hamas was planning its wide-scale attack on Oct. 7, but later retracted his comments and issued an apology.",
    "url": "https://www.reuters.com/world/middle-east/israels-netanyahu-says-wasnt-shown-intel-planned-hamas-attack-2023-10-29/"
  },
  {
    "text": "National security adviser defends Israel's efforts to defeat Hamas  —  “We have taken the position that Israel has a right to defend itself against terrorist attacks,” Sullivan said.  —  U.S. national security adviser Jake Sullivan defended Israel's campaign against Hamas on Sunday … ",
    "url": "https://www.politico.com/news/2023/10/29/national-security-advisor-defends-israel-hamas-00124113"
  },
  {
    "text": "Mike Pence Simplifies the Gag Order Dispute  —  If my Irish Daylight Savings calculation and PACER operations are correct, Donald Trump submitted his reply to DOJ's opposition to a stay on the gag Judge Tanya Chutkan imposed at around 8:50PM ET last night. … The filing includes the kind of sophistry John Lauro excels at.",
    "url": "https://www.emptywheel.net/2023/10/29/mike-pence-simplifies-the-gag-order-dispute/"
  },
  {
    "text": "The Devil's Bargain Mike Pence Could Not Escape  —  The former vice president tied himself to Donald Trump in the 2016 campaign and it may have cost him a political future.  —  The decision by Mike Pence to end his presidential campaign on Saturday was a bow to what had finally become inevitable.",
    "url": "https://www.nytimes.com/2023/10/29/us/politics/pence-trump-2024.html"
  },
  {
    "text": "After setback, antiabortion forces struggle before key Ohio vote  —  CINCINNATI — Students hoping to get others to vote “no” on an upcoming Ohio amendment to ensure abortion rights took the soft approach at a recent event at the University of Cincinnati.  —  The signs in their booth were alarmist … ",
    "url": "https://www.washingtonpost.com/nation/2023/10/29/ohio-issue-1-election-abortion/"
  },
  {
    "text": "‘FRIENDS’ STAR MATTHEW PERRY DEAD AT 54 ... After Apparent Drowning  —  EXCLUSIVE  —  885.5K … UPDATE  —  6:02 PM PT — More details are surfacing about the circumstances surrounding Matthew Perry's death ... as sources tell us he actually died at his own house after some physical activity this morning.",
    "url": "https://www.tmz.com/2023/10/28/friends-star-matthew-perry-dead-dies-drowning/"
  },
  {
    "text": "“Lord of the Flies”: The House's chaotic next era, explained  —  New House Speaker Mike Johnson faces a long to-do list and a caucus with short patience for compromise.  —  On Wednesday, Congress finally reopened.  After more than three weeks without a speaker, the elevation … ",
    "url": "https://www.vox.com/politics/2023/10/29/23935362/mike-johnson-house-speaker-ukraine-israel-immigration"
  },
  {
    "text": "Andy Kim is making a big bet on breaking New Jersey Democratic politics  —  The mild-mannered congressmember has early momentum that will test the party's established power structure.  —  Andy Kim is trying to do something rare in New Jersey politics: win by casting himself as a soft-spoken outsider.",
    "url": "https://www.politico.com/news/2023/10/29/andy-kim-vs-the-jersey-machine-00124091"
  },
  {
    "text": "DeSantis allies earn big paychecks on the front lines of his culture fights  —  Florida Gov. Ron DeSantis recently recounted blow by blow at an Iowa sports bar his takeover of a tiny liberal arts school, describing how he turned Sarasota's New College from a “Marxist commune” … ",
    "url": "https://www.cnn.com/2023/10/29/politics/ron-desantis-florida-allies-big-paychecks/"
  },
  {
    "text": "Full Jayapal: ‘There are racists within the Netanyahu government’  —  Rep. Pramila Jayapal (D-Wash.), chair of the Congressional Progressive Caucus, addresses her position on the Israel-Hamas war and reacts to Rep. Dean Phillips' (D-Minn.) primary challenge against President Joe Biden in an exclusive interview with Meet the Press.",
    "url": "https://www.nbcnews.com/meet-the-press/video/full-jayapal-there-are-racists-within-the-netanyahu-government-196643909536"
  },
  {
    "text": "Schwarzenegger says he would like to see Manchin run for president  —  Actor and former California Gov. Arnold Schwarzenegger (R) said Sunday that he would like to see Sen. Joe Manchin (D-W.Va.) make a bid for the White House.  —  NBC's Kristen Welker asked the former California governor on … ",
    "url": "https://thehill.com/homenews/campaign/4282254-schwarzenegger-says-he-would-like-to-see-manchin-run-for-president/"
  },
  {
    "text": "Meet the Press - October 29, 2023  —  Gov. Ron DeSantis (R) Presidential Candidate, Rep. Pramila Jayapal (D), Stephen Hayes, Kelly O'Donnell, Toluse Olorunnipa and Jen Psaki  —  KRISTEN WELKER:  —  This Sunday, next stage.  Israel expands its ground operations in Gaza as President Biden pushes for a humanitarian pause.",
    "url": "https://www.nbcnews.com/meet-the-press/meet-press-october-29-2023-n1307811"
  },
  {
    "text": "‘This is not cancel culture’: DeSantis defends call to ban pro-Palestinian groups at Florida colleges  —  “You have a right to go out and demonstrate, but you can't provide material support to terrorism,” he said.  —  Florida Gov. Ron DeSantis defended his call to ban pro-Palestinian groups … ",
    "url": "https://www.politico.com/news/2023/10/29/desantis-ban-pro-palestinian-florida-colleges-00124124"
  }
]