[
  {
    "text": "Trump, Biden and CNN Prepare for a Hostile Debate (With Muted Mics)  —  With Donald Trump's rampage at the first 2020 debate still fresh in the memories of both campaigns and the moderators, the candidates are preparing in sharply different ways.  —  President Biden and former President … ",
    "url": "https://www.nytimes.com/2024/06/15/us/politics/trump-biden-debate-rules.html"
  },
  {
    "text": "Donald Trump's 78th birthday becomes a show of loyalty for his fans and fellow Republicans  —  Donald Trump marked his 78th birthday on Friday night by addressing a fawning crowd in Florida and repeatedly dismissing his opponent in November's election, 81-year-old President Joe Biden, as too frail to handle a second term.",
    "url": "https://apnews.com/article/donald-trump-florida-birthday-club-47-verdict-260917979ae034f72415f415e8935be6"
  },
  {
    "text": "White House Rips ‘Desperate’ Murdoch Press Over Deceptive Biden Video  —  WANDER NO MORE  —  A deceptively edited video posted on X by The New York Post drew the attention of the White House senior deputy press secretary.  —  A member of the White House communications team went … ",
    "url": "https://www.thedailybeast.com/white-house-rips-desperate-murdoch-press-over-biden-italy-video"
  },
  {
    "text": "Moment Biden, 81, freezes AGAIN after shuffling away from G7 leaders forcing Italian PM to shepherd him back for pic  —  Watch Biden's latest concerning incident in the clip above  —  ELDERLY Joe Biden has given his “worst ever” performance at a major international summit, G7 insiders say … ",
    "url": "https://www.thesun.co.uk/news/28495274/joe-biden-freezes-again-shuffling-g7-giorgia-meloni/"
  },
  {
    "text": "CEOs at Trump meeting: Ex-president ‘meandering’ and 'doesn't know what he's talking about' … WATCH NOW  —  WASHINGTON — Former President Donald Trump failed to impress everyone in a room full of top CEOs Thursday at the Business Roundtable's quarterly meeting, multiple attendees told CNBC.",
    "url": "https://www.cnbc.com/2024/06/14/ceos-at-trump-meeting-not-impressed.html"
  },
  {
    "text": "Biden preparing to offer legal status to undocumented immigrants who have lived in U.S. for 10 years  —  The Biden administration is making plans to announce one of the largest immigration relief programs in recent history, developing a policy that would offer legal status to hundreds … ",
    "url": "https://www.cbsnews.com/news/biden-plan-undocumented-immigrants-legal-status-10-years-in-u-s-married/"
  },
  {
    "text": "The Chilling Reason You May Never See the New Trump Movie  —  This week I finally got to see “The Apprentice,” an absorbing, disturbing movie about the relationship between the red-baiting mob lawyer Roy Cohn and a young Donald Trump.  The film, which was received with an extended standing ovation … ",
    "url": "https://www.nytimes.com/2024/06/14/opinion/the-apprentice-trump-movie.html"
  },
  {
    "text": "Speaker Johnson says House will go to court for Biden audio after Justice Dept. refused to prosecute  —  Speaker Mike Johnson said Friday that the House will go to court to enforce the subpoena against Attorney General Merrick Garland for access to President Joe Biden's special counsel audio interview … ",
    "url": "https://apnews.com/article/justice-department-contempt-biden-classified-documents-8f38c7178fb0c996442781243f65ab97"
  },
  {
    "text": "Judge rejects bankruptcy plan for Alex Jones' Infowars but allows him to liquidate his personal assets  —  A Texas bankruptcy judge has rejected a proposed liquidation of conspiracy theorist Alex Jones' company Free Speech Systems, the parent company of Infowars, saying it was, in his opinion, in the best interest of the creditors.",
    "url": "https://www.cnn.com/2024/06/14/media/infowars-alex-jones-liquidation-ruling/"
  },
  {
    "text": "Stanford's top disinformation research group collapses under pressure  —  The Stanford Internet Observatory provided real-time analysis on viral election falsehoods but has struggled amid attacks from conservative politicians and activists.  —  The Stanford Internet Observatory … ",
    "url": "https://www.washingtonpost.com/technology/2024/06/14/stanford-internet-observatory-disinformation-research-lawsuits-politics/"
  },
  {
    "text": "Voters care about abortion more than ever—and that's a problem for the GOP  —  Republicans have created a disaster on abortion since the Supreme Court overturned Roe v. Wade two years ago.  They have no message to justify their extreme forced birth positions.  Their candidates are afraid to talk about it.",
    "url": "https://www.dailykos.com/stories/2024/6/14/2246687/-Voters-care-about-abortion-more-than-ever-and-that-s-a-problem-for-the-GOP"
  },
  {
    "text": "Biden goes straight from G7 to Hollywood fundraiser, balancing geopolitics with his reelection bid  —  Flying through the night across nine time zones, from southern Italy to Southern California, President Joe Biden will shift focus from Russia's challenge of Western unity to raking in big bucks … ",
    "url": "https://apnews.com/article/biden-hollywood-fundraiser-clooney-roberts-ukraine-summit-40081471c93faa68de5c4aa30455303b"
  },
  {
    "text": "Colombia lawmakers approve pension reform in victory for Petro  —  Colombia's lower house on Friday approved a pension reform proposed by President Gustavo Petro, marking a victory for the leftist, who has struggled to get lawmaker approval for several of his cornerstone promises.",
    "url": "https://www.reuters.com/world/americas/colombia-lawmakers-approve-pension-reform-victory-petro-2024-06-15/"
  },
  {
    "text": "‘Cheapfake’ Biden videos enrapture right-wing media, but deeply mislead  —  The Republican National Committee posts a clipped video.  Then the New York Post, the Telegraph and other pro-Trump outlets follow suit with the same deceptive framing.",
    "url": "https://www.washingtonpost.com/politics/2024/06/14/cheapfake-biden-videos-enrapture-right-wing-media-deeply-mislead/"
  }
]