[
  {
    "text": "Over 100 Republican National Security Leaders Endorse Vice President Harris  —  Donald Trump cannot be trusted “to support and defend the Constitution of the United States against all enemies, foreign and domestic . . . and bear true faith and allegiance to the same.",
    "url": "https://rbmralumni4harris.substack.com/p/over-100-republican-national-security"
  },
  {
    "text": "Sean Hannity Makes False Claim About Trump's Would-Be Assassins  —  The Fox News host was not helping matters any in his error about the attempts on Trump's life.  —  LOADING  —  Sean Hannity on Tuesday incorrectly said both would-be assassins of Donald Trump were Democrats.  (Watch the video below.)",
    "url": "https://www.huffpost.com/entry/sean-hannity-donald-trump-assassins-democrats_n_66eab4d4e4b00648275b4ea2"
  },
  {
    "text": "111 Former G.O.P. Officials Back Harris, Calling Trump ‘Unfit to Serve’  —  The signatories of a letter endorsing the Democratic vice president included former members of Congress, defense secretaries, C.I.A. directors and other national security officials.  —  More than 100 former national … ",
    "url": "https://www.nytimes.com/2024/09/18/us/politics/republican-officials-harris-endorsement.html"
  },
  {
    "text": "Israel Planted Explosives in Pagers Sold to Hezbollah, Officials Say  —  Small amounts of explosive were implanted in beepers that Hezbollah had ordered from a Taiwanese company, according to American and other officials briefed on the operation.  —  Israel carried out its operation … ",
    "url": "https://www.nytimes.com/2024/09/17/world/middleeast/israel-hezbollah-pagers-explosives.html"
  },
  {
    "text": "Israel planted explosives in Hezbollah's Taiwan-made pagers, say sources  —  A Taiwanese pager maker denied on Wednesday that it had produced devices that wounded thousands of Hezbollah operatives in Lebanon when they exploded, an audacious attack that raised the prospect of a full-scale war between … ",
    "url": "https://www.reuters.com/world/middle-east/israel-planted-explosives-hezbollahs-taiwan-made-pagers-say-sources-2024-09-18/"
  },
  {
    "text": "How the Trump Campaign Ran With Rumors About Pet-Eating Migrants—After Being Told They Weren't True  —  Springfield, Ohio, city officials were contacted by Vance's team and said the claims were baseless.  It didn't matter and now the town is in chaos.  —  SPRINGFIELD, Ohio … ",
    "url": "https://www.wsj.com/us-news/springfield-ohio-pet-eating-claims-haitian-migrants-04598d48?st=n5zqPV&reflink=article_copyURL_share"
  },
  {
    "text": "The Miles Davis of Tax Policy  —  Trump's just making it up on the fly.  —  Leading the news this morning: Melania Trump's latest video hawking her forthcoming memoir.  “Why do I stand proudly behind my nude modeling work?” the former first lady asks over a string soundtrack.",
    "url": "https://www.thebulwark.com/p/the-miles-davis-of-tax-policy"
  },
  {
    "text": "Russia propaganda group behind fake Kamala Harris hit-and-run story, says Microsoft  —  Microsoft researchers found that the group created a video, paid an actor to appear as the alleged victim, and spread the claim through a fake website  —  A false claim circulating on social media … ",
    "url": "https://www.theguardian.com/us-news/2024/sep/18/kamala-harris-fake-hit-run-story-russia-propaganda-storm-1516"
  },
  {
    "text": "JD Vance Makes Light of Actual Foreign Interference in His State  —  At a press conference on Ohio's efforts to respond to the chaos created in Springfield by a slew of bomb threats, Governor Mike DeWine revealed that a number of the bomb threats came from “one particular country” overseas.  —  Video",
    "url": "https://www.emptywheel.net/2024/09/18/jd-vance-makes-light-of-actual-foreign-interference-in-his-state/"
  },
  {
    "text": "Scripps News/Ipsos poll: Majority supports mass deportation of undocumented immigrants  —  The poll also showcases major partisan divides between voters on how to address one of the biggest topics of the presidential race: immigration.  —  A majority of Americans support the mass deportation … ",
    "url": "https://www.scrippsnews.com/politics/path-to-the-white-house/scripps-news-ipsos-poll-majority-supports-mass-deportation-of-undocumented-immigrants"
  },
  {
    "text": "Network of Georgia election officials strategizing to undermine 2024 result  —  Emails reveal Georgia Election Integrity Coalition, a group of officials and election deniers, coordinating in swing state  —  The fight for democracy is supported by  —  Emails obtained by the Guardian reveal … ",
    "url": "https://www.theguardian.com/us-news/2024/sep/18/trump-election-georgia"
  },
  {
    "text": "‘Suspicious Occurrence’ Near Donald Trump New York Rally: What We Know  —  Nassau County police responded to a “suspicious occurrence” near the location of former President  —  's Wednesday night rally in Long Island, noting that no explosives were located, the department confirmed to Newsweek.",
    "url": "https://www.newsweek.com/donald-trump-rally-suspicious-occurrence-long-island-ny-1955749"
  },
  {
    "text": "AJC poll finds Kamala Harris and Donald Trump are locked in a tight race in Georgia  —  The race has tightened since the AJC's poll in June when the former president held a 5-point lead over President Joe Biden.  —  Vice President Kamala Harris and former President Donald Trump are locked … ",
    "url": "https://www.ajc.com/politics/ajc-poll-finds-kamala-harris-and-donald-trump-are-locked-in-a-tight-race-in-georgia/C5CQ6742V5AHVIDUVQ77LQ7YMY/"
  },
  {
    "text": "Kentucky governor bans use of ‘conversion therapy’ with executive order  —  Democratic Gov. Andy Beshear banned the use of “conversion therapy” on minors in Kentucky on Wednesday, calling his executive order a necessary step to protect children from a widely discredited practice that tries … ",
    "url": "https://apnews.com/article/kentucky-conversion-therapy-andy-beshear-93a07354cd0ed2e7fc09c15f204f75c0"
  },
  {
    "text": "More than a dozen GOP nominees, elected officials, and Trump advisers have appeared on Laura Loomer's show (including JD Vance)  —  While some Republicans have tried to distance their party from Laura Loomer, her show's guest list indicates how closely linked the GOP is to the far-right extremist.",
    "url": "https://www.mediamatters.org/laura-loomer/more-dozen-gop-nominees-elected-officials-and-trump-advisers-have-appeared-laura"
  },
  {
    "text": "Johnson's colleagues baffled by his shutdown strategy … - “I don't know how he thinks it's going to pass ... where are the votes coming from?” said Rep. Troy Nehls (R-Texas).  — Another House Republican, speaking on the condition of anonymity, called Johnson's plan “puzzling” … ",
    "url": "https://www.axios.com/2024/09/18/johnsons-colleagues-baffled-by-his-shutdown-strategy"
  },
  {
    "text": "Lawrence on Trump's deadly abortion ban: ‘Women are dying.  They got what they wanted.’  —  Amber Nicole Thurman died after doctors delayed her life-saving abortion care.  Her death was ruled “preventable” by the Georgia Maternal Mortality Review Committee, ProPublica reported.",
    "url": "https://www.msnbc.com/the-last-word/watch/lawrence-on-trump-s-deadly-abortion-ban-women-are-dying-they-got-what-they-wanted-219579973725"
  },
  {
    "text": "A new government report reveals the fundamental flaw in the American economy  —  A little-noticed report by the non-partisan Congressional Budget Office (CBO) released this month reveals why, for most Americans, the economy is broken.  The report focuses on the American economy from 2019 to 2021.",
    "url": "https://popular.info/p/a-new-government-report-reveals-the"
  },
  {
    "text": "JD Vance defends pet-eating remarks: ‘The media has a responsibility to fact-check’  —  Republican VP nominee claims at Wisconsin rally that constituents told him 'they'd seen something in Springfield'  —  JD Vance defended his comments about Haitian immigrants eating pets during a rally Tuesday … ",
    "url": "https://www.theguardian.com/us-news/2024/sep/17/jd-vance-wisconsin-rally-immigrants-media"
  },
  {
    "text": "Trump's delusional debate spin speaks volumes  —  The contrast with Biden is telling. … Kamala Harris clobbered Donald Trump during their first (and likely only) presidential debate on September 10.  She humiliated him by smirking and laughing at his offensive buffoonery.",
    "url": "https://www.publicnotice.co/p/trump-debate-spin-kamala-harris"
  },
  {
    "text": "The FBI is investigating suspicious packages sent to election officials in more than 15 states  —  The FBI and the U.S. Postal Inspection Service on Tuesday were investigating the origin of suspicious packages that have been sent to or received by elections officials in more than 15 states … ",
    "url": "https://apnews.com/article/elections-workers-security-suspicious-packages-e3400b1e86bc02f7345d9970ef356bec"
  },
  {
    "text": "Justice Department files $100 million lawsuit against owner of ship that rammed into Baltimore's Key Bridge  —  The Justice Department on Wednesday filed a lawsuit against the owner and operator of the container ship that rammed into the Francis Scott Key Bridge in March … ",
    "url": "https://www.cbsnews.com/news/dali-key-bridge-baltimore-justice-department-lawsuit/"
  }
]