[
  {
    "text": "Australia opposition leader Dutton loses seat in shock vote defeat  —  Australia's opposition leader Peter Dutton said on Saturday he had lost his own parliamentary seat as he conceded his conservative Liberals had been defeated in national elections by the incumbent Labor Party.",
    "url": "https://www.reuters.com/world/asia-pacific/australia-state-broadcaster-abc-projects-opposition-leader-dutton-lose-seat-2025-05-03/"
  },
  {
    "text": "Australia's Labor Party, buoyed by anti-Trump bump, set to win reelection  —  Prime Minister Anthony Albanese and his ruling Labor Party were trailing in polls until recently, but his conservative rival was hurt by Trumpian tendencies.  —  SYDNEY — Australia's center-left government … ",
    "url": "https://www.washingtonpost.com/world/2025/05/03/australia-labor-albanese-trump-election/"
  },
  {
    "text": "First Canada, Now Australia: The Trump Factor Boosts Another World Leader in an Election  —  Australian Prime Minister Anthony Albanese returned to power as voters sought stability  —  SYDNEY—Australian Prime Minister Anthony Albanese was returned to power in an election Saturday … ",
    "url": "https://www.wsj.com/world/first-canada-now-australia-the-trump-factor-boosts-another-world-leader-in-a-close-election-bef1c5a1?st=6yDFJK&reflink=mobilewebshare_permalink"
  },
  {
    "text": "Australia's center-left Labor Party retains power in vote seen as test of anti-Trump sentiment  —  Brisbane and Sydney, Australia CNN  —  Australia's Prime Minister Anthony Albanese has secured a second term in office in a disastrous night for his conservative rivals … ",
    "url": "https://cnn.com/2025/05/03/australia/australia-election-results-albanese-dutton-intl-hnk"
  },
  {
    "text": "Inside Waltz's ouster: Before Signalgate, talks with Israel angered Trump  —  The fired national security adviser engaged in intense coordination with Israeli Prime Minister Benjamin Netanyahu about military options against Iran ahead of an Oval Office meeting between the Israeli leader and Trump, two people said.",
    "url": "https://www.washingtonpost.com/politics/2025/05/03/waltz-trump-israel/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ2MjQ0ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ3NjI3MTk5LCJpYXQiOjE3NDYyNDQ4MDAsImp0aSI6ImMzNzJhNDgyLTlhYjAtNGMzZS04N2M3LWFkYTQyYzYxZGM1NiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzA1LzAzL3dhbHR6LXRydW1wLWlzcmFlbC8ifQ.bWnAb6nqV9dU4waDOYJNMC1mMAT_ARkp-wQGqajQfEo&itid=gfta"
  },
  {
    "text": "World may be ‘post-herd immunity’ to measles, top US scientist says  —  As infections pummel communities in the US, Mexico and Canada, fear of ‘the most contagious human disease’ grows  —  A leading immunologist warned of a “post-herd-immunity world”, as measles outbreaks affect communities … ",
    "url": "https://www.theguardian.com/us-news/2025/may/03/measles-post-herd-immunity"
  },
  {
    "text": "C.I.A. to Cut More Than 1,000 Positions Over Several Years  —  The agency plans, for now, to use attrition, including retirements and voluntary resignations, to reduce the size of the C.I.A. instead of more mass firings.  —  The C.I.A. plans to cut more than 1,000 staff positions through attrition … ",
    "url": "https://www.nytimes.com/2025/05/02/us/politics/trump-cia-cuts.html"
  },
  {
    "text": "Former Weather Service Leaders Warn Staffing Cuts Could Lead to ‘Loss of Life’  —  The former agency directors say current employees will face an “impossible task” to maintain service just as hurricane season begins.  —  Five former National Weather Service directors have taken the unusual step … ",
    "url": "https://www.nytimes.com/2025/05/02/weather/nws-staffing-cuts-trump.html?unlocked_article_code=1.EU8.Wigu.FqDVTX60NFtd"
  },
  {
    "text": "Harvard President Says Any Move to Revoke Tax-Exempt Status Would Be ‘Highly Illegal’  —  Alan Garber was responding to Trump's latest threat to remove the university's tax-exempt status  —  Harvard University President Alan Garber fought back against President Trump's renewed threat to revoke … ",
    "url": "https://www.wsj.com/us-news/education/trump-harvard-tax-exempt-status-3b114fb7?st=sWKtYK&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Maine settles lawsuit against USDA over $3 million in school funds  —  The Department of Agriculture agreed it will not interfere with Maine school funding based on alleged Title IX violations without following the proper procedure, according to a settlement announced Friday.",
    "url": "https://www.pressherald.com/2025/05/02/maine-settles-case-over-frozen-usda-school-funds/"
  },
  {
    "text": "Budgets as Propaganda  —  If you are wonky enough to be reading this blog, you have probably heard the expression, “a budget is a moral document”.  Budgets are not just pages of numbers, they are also statements of values.  It is one of those insights, once learned, that seems indisputable and never to be forgotten.",
    "url": "https://donmoynihan.substack.com/p/budgets-as-propaganda"
  },
  {
    "text": "Airliners abort landings as Army helicopter makes ‘scenic’ loop around Pentagon  —  The incident occurred a week after the Army unit involved in the deadly Jan. 29 crash said it was resuming flights.  —  Two airliners abandoned landing attempts at Washington's Reagan National Airport … ",
    "url": "https://www.washingtonpost.com/transportation/2025/05/02/national-dca-airliners-helicopter-danger/"
  },
  {
    "text": "I Teach Computer Science, and That Is All  —  On Oct. 8, 2023, I was on the steps of Harvard's Widener Library, taking part in a vigil for the victims of Hamas's terrorist attack.  I'm an Israeli American tenured professor, and I felt it was my duty to stand up for Jewish and Israeli students.",
    "url": "https://www.nytimes.com/2025/05/02/opinion/work-school-classroom-politics-harvard.html?unlocked_article_code=1.EU8.39-w.pxGCfn3MzuuF&smid=nytcore-android-share"
  },
  {
    "text": "Voice of America staff can resume reporting next week, DOJ says  —  An email from the Justice Department said VOA staff can begin a “phased return” to the office and programming.  The broadcaster has been shut down since March.",
    "url": "https://www.washingtonpost.com/style/2025/05/03/voice-of-america-voa-return-usagm/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ2MjQ0ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ3NjI3MTk5LCJpYXQiOjE3NDYyNDQ4MDAsImp0aSI6IjYzNzdmYTMwLTc0ZTItNGNmMS04OGVkLWE2MzM4MTQ5MWJiZSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9zdHlsZS8yMDI1LzA1LzAzL3ZvaWNlLW9mLWFtZXJpY2Etdm9hLXJldHVybi11c2FnbS8ifQ.mfAXankRgVnZ8DSPDwRqQa4jSezqX5q2bqaNMSc4V_4&itid=gfta"
  },
  {
    "text": "Car Prices Expected to Rise as Tariffs on Parts Kick In  —  Tariffs on imported parts will have a broad impact because all vehicles use components made abroad.  —  The United States imposed 25 percent tariffs on imported auto parts on Saturday that could sharply raise prices for new and used vehicles … ",
    "url": "https://www.nytimes.com/2025/05/03/business/trump-auto-parts-tariffs.html?unlocked_article_code=1.EU8.SeDp.iaVS7xI5PDdZ&smid=url-share"
  },
  {
    "text": "White House posts AI image of Trump as pope  —  The White House on Saturday posted an AI-generated image of U.S. President Donald Trump depicted as the leader of the Catholic Church, a couple of days after he jokingly said “I'd like to be pope.”  —  The picture, which was first posted … ",
    "url": "https://www.politico.eu/article/white-house-post-ai-generated-picture-donald-trump-pope/"
  },
  {
    "text": "How Trump Accidentally Sabotaged His Own Case Against Abrego Garcia  —  He has now said it right out in the open—not once but twice.  In two major interviews, President Donald Trump openly declared that he has the power to bring the wrongfully deported Kilmar Abrego Garcia back to the United States.",
    "url": "https://newrepublic.com/article/194815/trump-accidentally-sabotaged-case-abrego-garcia"
  },
  {
    "text": "More than 15,000 USDA employees take Trump's offer to resign  —  Their departures will affect how the department administers food safety and nutrition programs, conducts research and offers services to farmers.  —  At least 15,000 Agriculture Department employees have taken … ",
    "url": "https://www.politico.com/news/2025/05/03/more-than-15000-employees-resign-agriculture-department-trump-00324834"
  },
  {
    "text": "Judge strikes down Trump executive order punishing prominent law firm  —  The judge said Trump's executive order sanctioning Perkins Coie was “motivated by retaliation” and is unconstitutional.  —  President Donald Trump's executive order that sought to punish the law firm Perkins Coie … ",
    "url": "https://www.politico.com/news/2025/05/02/trump-law-firms-executive-00324973"
  },
  {
    "text": "‘Do I Look Like I Care?’:  AOC Shreds Trump's Border Czar In Blunt Free Speech Reminder  —  The congresswoman slammed Tom Homan after he claimed she could be in “trouble” over her “know your rights” advice.  —  Rep. Alexandria Ocasio-Cortez (D-N.Y.) tore apart White House border czar Tom Homan … ",
    "url": "https://www.huffpost.com/entry/aoc-alexandria-ocasio-cortez-trump-tom-homan-immigration_n_68155361e4b08215e5f69edd"
  },
  {
    "text": "United Airlines Cancels Newark Flights After FAA Staff Walks Out  —  The decision came after 20% of the FAA controllers at Newark walked off the job, CEO Scott Kirby said  —  United Airlines is cancelling 35 daily round trip flights from Newark, N.J., starting this weekend after a group of air-traffic controllers walked off the job.",
    "url": "https://www.wsj.com/business/airlines/united-airlines-cancels-newark-flights-after-faa-staff-walks-out-e794b071?st=zXLpdk&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Texas goes after toothpaste in escalating fight over fluoride … Texas Attorney General Ken Paxton is investigating two leading toothpaste makers over their use of fluoride, suggesting that they are “illegally marketing” the teeth cleaners to parents and kids “in ways that are misleading, deceptive, and dangerous.”",
    "url": "https://arstechnica.com/health/2025/05/texas-goes-after-toothpaste-in-escalating-fight-over-fluoride/"
  },
  {
    "text": "Company Boasts Spending Up To $20 Million On Trump Crypto Coin To Buy Influence  —  The arrangement puts money in Trump's pocket in return for the opportunity to change policy — exactly the sort of pay-to-play scheme critics warned about.  —  WASHINGTON — An international trucking logistics firm … ",
    "url": "https://www.huffpost.com/entry/trump-coins-freight-influence_n_68153967e4b03d516aad99d3"
  },
  {
    "text": "Universities Deserve Special Standing … the nation's leading universities are locked in an unprecedented battle with a president and an administration that have chosen to withhold billions of dollars in vital federal research funding in order to take control of institutions for which freedom … ",
    "url": "https://www.theatlantic.com/ideas/archive/2025/05/universities-special-standing/682670/"
  },
  {
    "text": "‘The truckers are scrambling’: Trump's tariffs hit drivers, L.A. port workers hard  —  Amid a wave of unprecedented tariffs, anxiety is running high for truck drivers like Helen, who makes her living delivering cargo containers from the Los Angeles and Long Beach harbors to warehouses and other customers around Southern California.",
    "url": "https://www.latimes.com/business/story/2025-05-03/trumps-tariffs-hit-truckers-and-port-workers"
  },
  {
    "text": "Trump Seeks to Eliminate the National Endowment for the Arts  —  The president's budget proposal also called for getting rid of the National Endowment for the Humanities and the Institute of Museum and Library Sciences.  —  President Trump proposed eliminating the National Endowment … ",
    "url": "https://www.nytimes.com/2025/05/02/arts/nea.html"
  },
  {
    "text": "May 2, 2025  —  Yesterday I identified incorrectly the messaging app newly fired national security advisor Michael Waltz was using at a Cabinet meeting on Wednesday as the unsecure Signal app.  Joseph Cox of 404 Media identified the app as “an obscure and unofficial version of Signal” from … ",
    "url": "https://heathercoxrichardson.substack.com/p/may-2-2025"
  },
  {
    "text": "I Never Lost Hope in the Principles of Democracy  —  On April 14, 2025, I was detained during what should have been my citizenship naturalization interview.  After more than two weeks of unjust imprisonment, a federal judge ruled in favor of releasing me.  In a major victory for democracy … ",
    "url": "https://www.nytimes.com/2025/05/02/opinion/mohsen-mahdawi-ice-detention.html?unlocked_article_code=1.EE8.aupQ.28zpWyh0uozq&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Trump administration in talks with Rwanda to take deportees from U.S.  —  Washington — Rwanda's government and the Trump administration are discussing details about a potential agreement for Kigali to accept deportees from the U.S., including Africans and other non-Rwandan nationals, CBS News has learned.",
    "url": "https://www.cbsnews.com/news/trump-administration-in-talks-with-rwanda-to-take-deportees-from-u-s/"
  },
  {
    "text": "Trump family's net worth has increased by $2.9 billion thanks to crypto investments, new report says  —  President Trump's venture into crypto products has increased his family's wealth by billions in the last six months, according to a new report, as his administration continues to loosen … ",
    "url": "https://www.cbsnews.com/news/trump-family-net-worth-crypto-investments/"
  }
]