[
  {
    "text": "Republican National Committee pulls resolution declaring Trump as the ‘presumptive 2024 nominee’  —  The Republican National Committee has pulled a resolution to consider declaring Donald Trump the party's “presumptive 2024 nominee” before he formally clinches the requisite number of delegates … ",
    "url": "https://apnews.com/article/rnc-trump-presumptive-nominee-haley-2024-campaign-74c529ab8d3804622276f8e197cd3a5c"
  },
  {
    "text": "Nikki Haley touts $1.2 million in donations after Trump vows to blacklist her donors  — Nikki Haley's presidential campaign said it raised $1.2 million in one day after former President Donald Trump vowed to blacklist Haley's donors.  — Haley's campaign said it has taken a total … ",
    "url": "https://www.cnbc.com/2024/01/26/nikki-haley-touts-1point2-million-in-donations-after-trump-vows-to-blacklist-her-donors.html"
  },
  {
    "text": "Mainstream media bloodbath: News outlets slash jobs as business suffers  —  Nearly a dozen mainstream media companies are gutting staff and scrambling to rescue their struggling businesses. … But an ongoing bloodbath is decimating news outlets nationwide.",
    "url": "https://www.axios.com/2024/01/26/media-layoffs-strikes-journalism-dying"
  },
  {
    "text": "Border standoff between Texas, feds intensifies as governor defies Supreme Court ruling  —  This week, the Supreme Court sided with federal agents to remove razor wire put in place by Texas along the Rio Grande.  The state is using wire and state agents to block Border Patrol from accessing a section of the border in Eagle Pass.",
    "url": "https://www.pbs.org/newshour/show/border-standoff-between-texas-feds-intensifies-as-governor-defies-supreme-court-ruling"
  },
  {
    "text": "Donald Trump storms out of closing arguments in E Jean Carroll trial  —  The former president continued to attack the woman suing him for defamation after his testimony on Thursday  —  Why is Donald Trump back in court against E. Jean Carroll?  —  Roughly 20 minutes after walking into the courtroom … ",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/trump-storms-out-court-carroll-trial-b2485495.html"
  },
  {
    "text": "Judge Threatens to Send Trump Lawyer Alina Habba ‘in the Lockup’ at E. Jean Carroll Trial  —  The blockbuster remark came moments before closing arguments in Trump's second trial in a case brought by E. Jean Carroll  —  A federal judge threatened Donald Trump's attorney Alina Habba with jail time on Friday … ",
    "url": "https://themessenger.com/politics/trump-alina-habba-jail-e-jean-carroll-federal-judge-threat"
  },
  {
    "text": "White House offers unredacted Jan. 6 transcripts to GOP — with conditions  —  House Republicans have pushed for the records for months as they've cast doubt on the Jan. 6 select committee's work.",
    "url": "https://www.politico.com/live-updates/2024/01/26/congress/new-white-house-move-jan-6-transcripts-saga-00137977"
  },
  {
    "text": "White House halts enormous natural gas projects in victory for environmentalists  —  'This isn't just bad policy, it's bad politics,' former FERC chairman tells Fox News Digital  —  The White House is halting the permitting process for several proposed liquefied natural gas (LNG) … ",
    "url": "https://www.foxnews.com/politics/white-house-halts-enormous-natural-gas-projects-victory-environmentalists?intcmp=tw_fnc"
  },
  {
    "text": "Statement from President Joe Biden on Decision to Pause Pending Approvals of Liquefied Natural Gas Exports  —  In every corner of the country and the world, people are suffering the devastating toll of climate change.  Historic hurricanes and floods wiping out homes, businesses, and houses of worship.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/01/26/statement-from-president-joe-biden-on-decision-to-pause-pending-approvals-of-liquefied-natural-gas-exports/"
  },
  {
    "text": "Justice Department Announces Surge of Resources to Fight Violent Crime in Washington, D.C.  —  For Immediate Release  —  The Justice Department announced today that it will surge additional law enforcement tools and resources to target those most responsible for violent crime and carjackings in Washington, D.C.",
    "url": "https://www.justice.gov/opa/pr/justice-department-announces-surge-resources-fight-violent-crime-washington-dc"
  },
  {
    "text": "Missouri GOP Lawmaker Floats Rule Change to Bring Back Duels  —  A senator could challenge another to mortal combat if the first's “honor is impugned.”  —  Bitter divisions between Republicans in the Missouri Senate culminated in a proposed rule change that would allow senators to settle … ",
    "url": "https://www.thedailybeast.com/missouri-gop-lawmaker-floats-rule-change-to-bring-back-duels"
  },
  {
    "text": "Texas senator who voted to acquit Paxton calls to reopen impeachment trial  —  In a court filing last week, Texas Attorney General Ken Paxton's office said they would not contest accusations he violated the Whistleblower Act  —  Texas Sen. Drew Springer (R-Muenster) wrote a letter … ",
    "url": "https://www.nbcdfw.com/news/politics/lone-star-politics/texas-senator-who-voted-to-acquit-paxton-calls-to-reopen-impeachment-trial/3444726/"
  },
  {
    "text": "Lauren Boebert blasted as carpetbagger in first debate in new congressional district race  —  U.S. Rep. Lauren Boebert defended her mountains-to-plains shift in congressional districts, even as Republican rivals used the contest's first debate Thursday night to suggest she is a carpetbagger and hypocrite.",
    "url": "https://www.axios.com/local/denver/2024/01/26/lauren-boebert-carpetbagger-debate-4th-district-colorado"
  },
  {
    "text": "Leading Museums Remove Native Displays Amid New Federal Rules  —  The American Museum of Natural History is closing two major halls as museums around the nation respond to updated policies from the Biden administration.  —  The American Museum of Natural History will close … ",
    "url": "https://www.nytimes.com/2024/01/26/arts/design/american-museum-of-natural-history-nagpra.html"
  },
  {
    "text": "Former Trump lawyer Rudy Giuliani raises less than $1 million from 13 donors in legal defense fund  — Rudy Giuliani raised less than $1 million from just 13 donors, among them his friends and a group of former President Donald Trump's allies, to help pay off his legal fees.",
    "url": "https://www.cnbc.com/2024/01/25/trump-lawyer-rudy-giuliani-raises-less-than-1-million-in-legal-defense-fund.html"
  },
  {
    "text": "Speaker Johnson: Senate border deal ‘dead on arrival’ in House  —  Speaker Mike Johnson (R-La.) said in a Friday letter to his colleagues that Senate legislation addressing the border and aid to Ukraine and other countries would have been “dead on arrival” in the House, if reports about its terms are true.",
    "url": "https://thehill.com/homenews/house/4431375-speaker-johnson-senate-border-deal-dead-on-arrival-in-house/"
  },
  {
    "text": "Economists Predicted a Recession.  So Far They've Been Wrong.  —  A widely predicted recession never showed up.  Now, economists are assessing what the unexpected resilience tells us about the future.  —  The recession America was expecting never showed up.",
    "url": "https://www.nytimes.com/2024/01/26/business/economy/economy-recession-soft-landing.html"
  },
  {
    "text": "The Story of the Decade  —  New documents strengthen—perhaps conclusively—the lab-leak hypothesis of Covid-19's origins.  —  / Health Care  —  / Eye on the News / Health Care  —  The day is growing ever closer when Washington may have to add to its agenda with Beijing a nettlesome item … ",
    "url": "https://www.city-journal.org/article/new-documents-bolster-lab-leak-hypothesis"
  },
  {
    "text": "The court's decision has heavy symbolic meaning, even if it may have little practical impact.  —  U.N. Court Orders Israel to Prevent Genocide, but Does Not Demand Stop to War  —  The court ruled that Israel must prevent genocidal acts by its forces.  Later, the U.N. agency that aids Palestinians … ",
    "url": "https://www.nytimes.com/live/2024/01/26/world/israel-hamas-gaza-news"
  }
]