[
  {
    "text": "Invocation of the Alien Enemies Act Regarding the Invasion of The United States by Tren De Aragua  —  BY THE PRESIDENT OF THE UNITED STATES OF AMERICA  —  Tren de Aragua (TdA) is a designated Foreign Terrorist Organization with thousands of members, many of whom have unlawfully infiltrated … ",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/03/invocation-of-the-alien-enemies-act-regarding-the-invasion-of-the-united-states-by-tren-de-aragua/"
  },
  {
    "text": "Trump invokes 18th century law to speed deportations, judge stalls it hours later  —  A federal judge barred the Trump administration Saturday from carrying out deportations under a sweeping 18th century law that the president invoked hours earlier to speed removal of Venezuelan gang members from the United States.",
    "url": "https://apnews.com/article/trump-aclu-deportations-venezuelans-b2566f05b10bf1cde1caf467a3b001cc"
  },
  {
    "text": "Court blocks deportations hours after Trump says he invoked Alien Enemies Act  —  A little before 7:00 p.m. Saturday, a federal judge issued an order temporarily stopping deportations set in motion by President Donald Trump hours earlier when he announced that he had invoked a law last used to justify Japanese internment camps.",
    "url": "https://www.lawdork.com/p/alien-enemies-act-venezuela-tro"
  },
  {
    "text": "Federal judge blocks Trump's plan to target ‘alien enemies’ for deportation  —  In his latest move to clamp down on illegal immigration and immigration more broadly, President Trump has filed a presidential action invoking the Alien Enemies Act of 1798, a seldom-used law that gives … ",
    "url": "https://www.npr.org/2025/03/15/nx-s1-5246028/trump-alien-enemies-act-tren-de-aragua-deportation"
  },
  {
    "text": "Judge blocks Trump after he invokes wartime Alien Enemies Act to speed up deportations  —  Trump invoked the Alien Enemies Act against Tren de Aragua members.  A federal judge later ordered the administration to turn around any planes that had already taken off.",
    "url": "https://www.washingtonpost.com/immigration/2025/03/15/trump-alien-enemies-venezuela-migrants-deportations/"
  },
  {
    "text": "Voice of America staff put on leave after Trump orders cuts  —  Employees at Voice of America were placed on paid leave on Saturday and funding for two U.S. news services that broadcast to authoritarian regimes was slashed, one day after President Donald Trump signed an executive order gutting … ",
    "url": "https://www.reuters.com/business/media-telecom/trump-signs-order-gut-voice-america-other-agencies-2025-03-15/"
  },
  {
    "text": "‘Bloody Saturday’ at Voice of America and other U.S.-funded networks  —  Journalists showed up at the Voice of America today to broadcast their programs only to be told they had been locked out: Federal officials had embarked on indefinite mass suspensions.  —  All full-time staffers … ",
    "url": "https://www.npr.org/2025/03/15/nx-s1-5329244/bloody-saturday-voiceofamerica-radio-free-asia-europe-trump-kari-lake"
  },
  {
    "text": "Trump signs order to gut staff at Voice of America and other US-funded media organizations  —  President Donald Trump's administration on Saturday began making deep cuts to Voice of America and other government-run, pro-democracy programming, with the organization's director saying all VOA employees have been put on leave.",
    "url": "https://apnews.com/article/trump-voice-of-america-cuts-3faf72e620dbc5f42e5508a2b9d8c8da"
  },
  {
    "text": "Trump Orders Attacks on Militant Sites in Yemen and Issues a Warning to Iran  —  The air and naval strikes on targets controlled by the Iran-backed Houthi fighters were intended to open up international shipping lanes in the Red Sea.  —  The United States carried out large-scale military strikes … ",
    "url": "https://www.nytimes.com/2025/03/15/us/politics/us-attack-houthis.html?unlocked_article_code=1.4E4.L_Jf.rG1ujfWb4AWs&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Brown Medicine doctor deported despite federal court order.  What we know.  —  A federal court order that would have halted the immediate deportation of a Rhode Island doctor was issued Friday evening while the doctor's departing plane sat on the tarmac at Boston Logan International Airport, said a family friend and colleague.",
    "url": "https://www.providencejournal.com/story/news/local/2025/03/15/rhode-island-doctor-rasha-alawieh-deported-despite-federal-court-order/82441360007/"
  },
  {
    "text": "Indivisible Calls on Schumer to Step Aside  —  WASHINGTON, D.C.—Yesterday, Minority Leader Chuck Schumer surrendered leverage in the Senate, paving the way for a GOP funding bill that jeopardizes critical programs and accelerates the efforts of Trump, Musk and congressional Republicans … ",
    "url": "https://indivisible.org/statements/indivisible-calls-schumer-step-aside"
  },
  {
    "text": "A Title VI Demand Letter That Itself Violates Title VI (and the Constitution)  —  On Thursday, the president of Columbia University received a remarkable letter from the General Services Administration, the Department of Health and Human Services, and the Department of Education.",
    "url": "https://balkin.blogspot.com/2025/03/a-title-vi-demand-letter-that-itself.html"
  },
  {
    "text": "Oklahoma man says Social Security benefits terminated without warning or explanation  —  OKLAHOMA CITY (KFOR) — An Oklahoma City retiree said his Social Security benefits were suspended without warning — and with no explanation given when he reached out.  He worries it may have to do with the place … ",
    "url": "https://www.wkrn.com/news/national/oklahoma-man-says-social-security-benefits-terminated-without-warning-or-explanation/"
  },
  {
    "text": "Musk Said No One Has Died Since Aid Was Cut.  That Isn't True.  —  Mr. Kristof reported from South Sudan and Nairobi, Kenya.  Ms. Fezehai is a photographer and visual journalist based in Kenya.  —  As the world's richest men slash American aid for the world's poorest children, they insist that all is well.",
    "url": "https://www.nytimes.com/interactive/2025/03/15/opinion/foreign-aid-cuts-impact.html?unlocked_article_code=1.4E4.H8Lx.GD39rucUfloD&smid=url-share"
  },
  {
    "text": "Continuing the Reduction of the Federal Bureaucracy  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:  —  Section 1.  Purpose.  This order continues the reduction in the elements of the Federal bureaucracy … ",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/03/continuing-the-reduction-of-the-federal-bureaucracy/"
  },
  {
    "text": "Border patrol grabs Venezuelan parents in D.C., despite protected status  —  Their arrests, weeks before TPS is set to expire for many Venezuelans, raised alarms that the Trump administration is again willing to separate parents and children.  —  Just now  —  The Venezuelan couple … ",
    "url": "https://www.washingtonpost.com/immigration/2025/03/15/immigration-arrests-temporary-protected-status/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQyMDExMjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQzMzkzNTk5LCJpYXQiOjE3NDIwMTEyMDAsImp0aSI6IjdhNzA2NzgxLWJlYTQtNDEwMS1hOTk3LTZhNDE0MjMzNzVkYyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9pbW1pZ3JhdGlvbi8yMDI1LzAzLzE1L2ltbWlncmF0aW9uLWFycmVzdHMtdGVtcG9yYXJ5LXByb3RlY3RlZC1zdGF0dXMvIn0.FnQcZJ07cj_r5VxFRzAzu9PQVTEFioSKop1fvsYVeac&itid=gfta"
  },
  {
    "text": "Keeping With Kennedy's Advice, Measles Patients Turn to Unproven Treatments  —  In West Texas, some with severe illness have not been taken to a doctor until their conditions worsened, officials said.  —  Struggling to contain a raging measles epidemic in West Texas, public health officials … ",
    "url": "https://www.nytimes.com/2025/03/15/health/measles-texas-kennedy.html?unlocked_article_code=1.4E4.k_it.5DRBXEbONfjO&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "RFE/RL President: Defunding Would be “Massive Gift to America's Enemies”  —  RFE/RL President: Defunding Would be “Massive Gift to America's Enemies”  —  Radio Free Europe/Radio Liberty (RFE/RL) was informed today by the U.S. Agency for Global Media (USAGM) that its federal grant agreement … ",
    "url": "https://about.rferl.org/article/rfe-rl-president-defunding-would-be-massive-gift-to-americas-enemies/"
  },
  {
    "text": "Whitewashing American history  —  When I teach my students about organizational culture, one of the things we talk about are artifacts: visual representations of norms and meaning.  These could be art, posters, websites or office layouts.  What is the organization telling you about what it is, what values it cares about?",
    "url": "https://donmoynihan.substack.com/p/whitewashing-american-history"
  },
  {
    "text": "CA 120: Gavin's podcast - Presidential run or empire building?  —  This is the second of a two-part series analyzing the impact of Gov. Gavin Newsom's podcast, “This is Gavin Newsom.”  Part one can be accessed here.  —  In last week's article we reviewed polling on Governor Newsom's announcement … ",
    "url": "https://capitolweekly.net/ca-120-gavins-podcast-presidential-run-or-empire-building/"
  },
  {
    "text": "Trump admin makes Asheville remove ‘DEI’ language to access hurricane relief aid  —  The Trump administration recently denied a funding request from the city of Asheville, North Carolina, to help its recovery from Hurricane Helene, telling the city it must cut a program meant to aid female and minority contractors.",
    "url": "https://www.yahoo.com/news/trump-admin-makes-asheville-remove-192212840.html"
  },
  {
    "text": "How a Columbia Student Fled to Canada After ICE Came Looking for Her  —  Ranjani Srinivasan's student visa was revoked by U.S. immigration authorities.  That was just the start of her odyssey.  —  The first knock at the door came eight days ago, on a Friday morning.",
    "url": "https://www.nytimes.com/2025/03/15/nyregion/columbia-student-kristi-noem-video.html"
  }
]