[
  {
    "text": "Exclusive: Harris and her VP pick will tour battleground states next week - sources  —  Vice President Kamala Harris will tour battleground states next week with her vice presidential candidate, two sources familiar with the planning said on Tuesday, a signal the selection process for her running mate is coming to a close.",
    "url": "https://www.reuters.com/world/us/harris-her-vp-pick-will-tour-battleground-states-next-week-sources-2024-07-30/"
  },
  {
    "text": "Harris is in much better shape than Biden.  But she has one big problem.  —  It's the Electoral College.  —  ∙ Paid  —  The Silver Bulletin presidential election forecast model relaunched today, and there's some good news for Democrats: Kamala Harris is in a considerably better position … ",
    "url": "https://www.natesilver.net/p/harris-trump-electoral-college"
  },
  {
    "text": "Whoa: Trump Hits 52% in New Harvard/Harris Poll  —  Say, whose honeymoon is this, anyway?  Supposedly, Kamala Harris has “totally upended” the race with The Anointment and the media's rush to proclaim the advent of “Kamalot.”  Also, Donald Trump only has a ceiling in the mid-40s … ",
    "url": "https://hotair.com/ed-morrissey/2024/07/30/whoa-trump-hits-52-in-new-harvardharris-poll-n3792463"
  },
  {
    "text": "Lara Trump Compares Harris to a Fashion Designer's Faux ‘Trash Bag’  —  It was the latest in a series of vicious personal attacks Republicans have lobbed at the vice president since Democrats coalesced around her as their presidential nominee.  —  Lara Trump, the Republican Party co-chair … ",
    "url": "https://www.nytimes.com/2024/07/30/us/politics/lara-trump-kamala-harris-trash-bag.html"
  },
  {
    "text": "Trump Media Quietly Enters Deal With a Republican Donor Who Could Benefit From a Second Trump Administration  —  This month, former President Donald Trump's media company announced it was making its first major purchase: technology to help stream TV on Truth Social, its Twitter-like platform.",
    "url": "https://www.propublica.org/article/trump-media-truth-social-jedtec-james-davison-conflict-of-interest"
  },
  {
    "text": "Harris's best response to the ‘too liberal’ attack  —  She is the one aligned with the bulk of Americans.  —  Minnesota Gov. Tim Walz (D), a possible pick for vice president, gave a pitch-perfect answer on CNN to the charge that he is too “liberal”:",
    "url": "https://www.washingtonpost.com/opinions/2024/07/30/harris-liberal-attacks/"
  },
  {
    "text": "It's not just ‘cat ladies’: JD Vance has a history of disparaging people without kids  —  Republican vice presidential nominee Sen. JD Vance has a history of making disparaging remarks toward people without children, a CNN KFile review of his comments shows, including fundraising off his now-infamous … ",
    "url": "https://www.cnn.com/2024/07/30/politics/kfile-jd-vance-history-disparaging-people-without-kids/"
  },
  {
    "text": "Murkowski slams Vance's ‘childless cat lady’ comments as ‘offensive’ to women  —  Sen. Lisa Murkowski (R-Alaska) hit her party's own vice presidential nominee, Sen. JD Vance (R-Ohio), for what she called “offensive” comments about “childless cat ladies.”  “If the Republican Party is trying … ",
    "url": "https://www.politico.com/live-updates/2024/07/30/congress/murkowski-critical-vance-cat-lady-trump-republicans-senate-00171864"
  },
  {
    "text": "Harris and Democrats keep calling Trump and Vance ‘weird.’ Here's why  —  Vice President Kamala Harris and her Democratic allies are emphasizing a new line of criticism against Republicans — branding Donald Trump and his running mate, Ohio Sen. JD Vance, as “weird.”",
    "url": "https://apnews.com/article/kamala-harris-trump-vance-weird-c54d506d1f533ee7aa455f7b500322c5"
  },
  {
    "text": "Exclusive: The inside story of John Roberts and Trump's immunity win at the Supreme Court  —  The Supreme Court's toughest cases during Chief Justice John Roberts' tenure have often generated internal suspense, with shifting votes, last-minute switches and the chief's own push toward compromises … ",
    "url": "https://www.cnn.com/2024/07/30/politics/supreme-court-john-roberts-trump-immunity-6-3-biskupic/"
  },
  {
    "text": "Progressives urge Harris to consider Beshear, Walz for VP, not Shapiro  —  Video Player is loading.  —  Play Video  —  Unmute  —  Current Time 0:00 … Stream Type LIVE  —  Seek to live, currently behind liveLIVE  —  Playback Rate  —  Chapters  — Chapters  —  Descriptions",
    "url": "https://thehill.com/homenews/campaign/4800359-kamala-harris-josh-shapiro-andy-beshear-tim-walz/"
  },
  {
    "text": "‘White Dudes for Harris’ X Suspension Sparks Fury: ‘Election Interference’  —  A social-media account for white male supporters of  —  was briefly suspended from X, formerly  —  , sparking anger online.  —  Newsweek observed that the White Dudes for Harris X account had been temporarily suspended … ",
    "url": "https://www.newsweek.com/white-dudes-harris-x-suspension-1931827"
  },
  {
    "text": "Maddow points out frightening truth about Trump's lack of concern about votes  —  Rachel Maddow rounds up instances in which Donald Trump not only assures his supporters that if he is elected they won't have to vote in the future, but also that even for this 2024 election he does not need votes.",
    "url": "https://www.msnbc.com/rachel-maddow/watch/maddow-points-out-frightening-truth-about-trump-s-lack-of-concern-about-votes-215958085917"
  },
  {
    "text": "Behind the Curtain: The battle for Trump power … - Trump constantly tells friends he felt burned by disloyal Cabinet officials and staff last time around. … - JD Vance would be very involved with planning Trump's transition — the high-stakes period between Election Day and the inauguration.",
    "url": "https://www.axios.com/2024/07/30/trump-cabinet-shortlist-vance"
  },
  {
    "text": "Yes They Can?  —  Democrats haven't been this fired up about a presidential candidate since Obama, and the Harris campaign is racing to capitalize on the momentum: hiring veteran ad-maker Jim Margolis, doubling down on TikTok (where Kamala is approaching Trump-level virality), and leaning into the J.D. Vance creep factor.",
    "url": "https://puck.news/can-the-harris-campaign-sustain-the-kamala-mentum/"
  },
  {
    "text": "‘White Dudes for Harris’ — including The Dude himself — raise over $4M  —  The Zoom fundraiser for Vice President Harris, attended by actor Jeff Bridges, Mark Hamill and Pete Buttigieg among others, raised over $4 million, organizers said.  —  After Black Women for Harris and White Women for Harris … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/30/white-dudes-harris-jeff-bridges/"
  },
  {
    "text": "Head of Project 2025 Steps Down Following Trump Criticism  —  The group had set an agenda for a second Trump term but was criticized by the former president  —  WASHINGTON—The Heritage Foundation official who leads Project 2025, the conservative roadmap for the next Republican administration … ",
    "url": "https://www.wsj.com/politics/elections/project-2025-head-steps-down-89cba52b?st=p4sjndltdejmfeh"
  },
  {
    "text": "Democracy Will Suffer a Relatively Quiet Death.  We Simulated It.  —  We also found steps we can take now to save it.  —  PICTURE THIS: It's March 2025, and Donald Trump is back in the White House.  Despite the burst of euphoria that followed Joe Biden's withdrawal from the presidential race … ",
    "url": "https://www.thebulwark.com/p/democracy-suffer-quiet-death-simulated-trump"
  },
  {
    "text": "Trump would ‘absolutely’ scrap Biden's Air Force One colors, adviser says  —  If reelected, Trump still has time to change the paint job back to red, white and dark blue.  But it'd be expensive.  —  If Donald Trump returns to the presidency, he'll have another shot at achieving a goal … ",
    "url": "https://www.politico.com/news/2024/07/30/trump-air-force-one-00171453"
  },
  {
    "text": "NABJ to Host Former President Trump for a Conversation in Chicago During Annual Convention  —  CHICAGO - Former U.S. President Donald J. Trump will participate in a conversation with journalists at the National Association of Black Journalists (NABJ) Annual Convention & Career Fair during … ",
    "url": "https://nabjonline.org/blog/nabj-to-host-former-president-trump-for-a-conversation-in-chicago-during-its-annual-convention/"
  }
]