[
  {
    "text": "The mystery of the missing binder: How a collection of raw Russian intelligence disappeared under Trump  —  A binder containing highly classified information related to Russian election interference went missing at the end of Donald Trump's presidency, raising alarms among intelligence officials … ",
    "url": "https://www.cnn.com/interactive/2023/12/politics/missing-russia-intelligence-trump-dg/"
  },
  {
    "text": "Material From Russia Investigation Went Missing as Trump Left Office  —  A binder given to the Trump White House contained details that intelligence agencies believe could reveal secret sources and methods.  —  Material from a binder with highly classified information connected to the investigation … ",
    "url": "https://www.nytimes.com/2023/12/15/us/politics/trump-binder-classified-material-russia.html"
  },
  {
    "text": "Behind the Scenes at the Dismantling of Roe v. Wade  —  On Feb. 10 last year, Justice Samuel A. Alito Jr. showed his eight colleagues how he intended to uproot the constitutional right to abortion.  —  At 11:16 a.m., his clerk circulated a 98-page draft opinion in Dobbs v. Jackson Women's Health Organization.",
    "url": "https://www.nytimes.com/2023/12/15/us/supreme-court-dobbs-roe-abortion.html"
  },
  {
    "text": "Why Bob Vander Plaats thinks some evangelicals can't quit Trump  —  Good morning, Early Birds.  We're running out of shelves on which to hide our elves.  Please send suggestions (and, more importantly, newsworthy tips) to earlytips@washpost.com.  Was this forwarded to you?  Sign up here.",
    "url": "https://www.washingtonpost.com/politics/2023/12/15/why-bob-vander-plaats-thinks-some-evangelicals-cant-quit-trump/"
  },
  {
    "text": "Melania Trump Welcomes You to America, for Some Reason  —  Her husband is accused of swiping Archives property.  But she's set to star in a winning photo op.  —  For two years, the National Archives stalked Donald Trump over secret presidential records he's accused of purloining.",
    "url": "https://www.politico.com/news/magazine/2023/12/15/melania-trump-national-archives-naturalization-ceremony-00131762"
  },
  {
    "text": "House GOP reeling after a top recruit blasts Trump on tape  —  In a must-win Ohio race, one Republican candidate is facing allegations of stolen valor — and now another is inviting the former president's wrath by bashing him.  —  House Republicans are scrambling to fix … ",
    "url": "https://www.politico.com/news/2023/12/15/house-gop-trump-ohio-00131833"
  },
  {
    "text": "What's Driving Former Progressives to the Right?  —  In a new essay in the progressive magazine In These Times, the writers Kathryn Joyce and Jeff Sharlet grapple with the contemporary version of an old phenomenon: erstwhile leftists decamping to the right.  There have been plenty … ",
    "url": "https://www.nytimes.com/2023/12/15/opinion/democrats-shift-rightward.html"
  },
  {
    "text": "Judges dubious of Mark Meadows' bid to avoid facing charges in Georgia state court  —  The former White House chief of staff is charged alongside Donald Trump with a conspiracy to tamper with the 2020 election in Georgia.  —  A federal appeals court panel took a skeptical stance Friday toward … ",
    "url": "https://www.politico.com/news/2023/12/15/mark-meadows-trump-georgia-charges-federal-court-00131993"
  },
  {
    "text": "Rep. Elise Stefanik files complaint against judge who has ruled in Jan. 6 and Trump cases  —  The New York Republican and staunch Trump ally is asking for an ethics investigation, arguing the judge has engaged in “highly inappropriate political speech.”  —  WASHINGTON — Rep. Elise Stefanik … ",
    "url": "https://www.nbcnews.com/politics/congress/elise-stefanik-files-complaint-judge-ruled-jan-6-trump-cases-rcna129878"
  },
  {
    "text": "Kanye West Goes On Unhinged Rant, ‘Jesus Christ, Hitler, Ye!  Sponsor That!!’  —  KANYE WEST UNHINGED RANT IN VEGAS ... ‘Jesus Christ, Hitler, Ye!  Sponsor That!!!’ … Kanye West is apparently in the grips of a serious mental health episode ... that's the only conclusion to draw from his furious rant … ",
    "url": "https://www.tmz.com/2023/12/15/kanye-west-rant-las-vegas-jesus-christ-hitler-ye-sponsor-that-vultures/"
  },
  {
    "text": "Two-month battle to replace ex-Rep. George Santos could cost $20 million  — The race to represent a New York House district once held by the ousted Republican Rep. George Santos is expected to cost up to $20 million.  — Former Democratic Rep. Tom Suozzi and Republican Mazi Melesa Pilip … ",
    "url": "https://www.cnbc.com/2023/12/15/george-santos-district-could-see-millions-of-dollars-in-spending.html"
  },
  {
    "text": "U.S. economy will pull off soft landing in 2024, CBO projects  —  The U.S. economy is on track to avoid a recession next year as inflation returns to normal, according to new economic projections released by the Congressional Budget Office. … But its projections suggest America will skirt an all-out contraction in growth.",
    "url": "https://www.axios.com/2023/12/15/us-economy-avoid-recession-inflation-cbo-projections"
  },
  {
    "text": "Billionaires Are Bankrolling Judges' Luxury Travel  —  Two deep-pocketed conservative organizations paid to send federal judges on 251 trips in 2021 and 2022 — far more than any other source.  —  In 2021 and 2022, two conservative, billionaire-funded legal interests sent more than 100 federal judges … ",
    "url": "https://www.levernews.com/billionaires-are-bankrolling-judges-luxury-travel/"
  },
  {
    "text": "'I'm not a progressive': Fetterman breaks with the left, showing a maverick side  —  Sen. John Fetterman, D-Pa., has drawn fire from progressives over his fierce support for Israel and broken with immigration advocates with his support for curtailing migration.",
    "url": "https://www.nbcnews.com/politics/congress/-not-progressive-fetterman-breaks-left-israel-immigration-rcna129747"
  },
  {
    "text": "Cornel West thinks Biden won't make it to the general election  —  The independent candidate rejected the idea he could be a “spoiler” for Biden in an exclusive meeting with POLITICO.  —  Cornel West doesn't think Joe Biden will make it to the general election.",
    "url": "https://www.politico.com/news/2023/12/15/cornel-west-biden-election-00131944"
  },
  {
    "text": "Hungary blocks €50bn of EU funding for Ukraine  —  Hungary has blocked €50bn ($55bn; £43bn) in EU aid for Ukraine - just hours after an agreement was reached on starting membership talks.  —  “Summary of the nightshift: veto for the extra money to Ukraine,” … ",
    "url": "https://www.bbc.com/news/world-europe-67724357"
  },
  {
    "text": "2. Assessments of Joe Biden  —  A third of Americans currently say they approve of Joe Biden's job performance as president, while nearly two-thirds (64%) say they disapprove.  This is little changed over the last year.  —  Around six-in-ten Democrats and Democratic leaners (61%) … ",
    "url": "https://www.pewresearch.org/politics/2023/12/14/assessments-of-joe-biden/"
  },
  {
    "text": "Mother of 6-year-old who shot teacher in Virginia gets 2 years in prison for child neglect  —  The mother of a 6-year-old who shot his teacher in Virginia was sentenced Friday to two years in prison for felony child neglect, nearly a year after her son used her gun to critically wound the educator.",
    "url": "https://apnews.com/article/virginia-student-shot-teacher-mother-sentencing-9b99a00c2745dcbcd49b4c25f2a86f96"
  },
  {
    "text": "Chicago's progressive Mayor Brandon Johnson announces plans to ax Windy City's high-achieving selective-enrollment high schools to boost ‘equity’ despite promising not to during election campaign  — Johnson's Board of Education has proposed shifting back toward neighborhood schools … ",
    "url": "https://www.dailymail.co.uk/news/article-12864439/Chicago-Mayor-Brandon-Johnson-selective-enrollment-high-schools.html"
  },
  {
    "text": "The Immigration Policy Spiral  —  Joe Biden, from a position of weakness, is trying to cut a punitive deal on border policy without the House.  —  Migrants are loaded onto shuttle buses as hundreds gather along the border, December 5, 2023, in Lukeville, Arizona.",
    "url": "https://prospect.org/politics/2023-12-15-immigration-policy-spiral/"
  },
  {
    "text": "25 Films Selected for Preservation in National Film Registry  —  ‘Apollo 13,’ ‘Home Alone,’ ‘Lady and the Tramp,’ ‘Terminator 2,’ ‘Love and Basketball,’ ‘12 Years a Slave,’ ‘The Nightmare Before Christmas’ Among Titles Selected for Preservation  —  Twenty-five influential films have been selected … ",
    "url": "https://newsroom.loc.gov/news/25-films-selected-for-preservation-in-national-film-registry/s/aa4bef48-95f6-486f-882d-110613633b1e"
  }
]