[
  {
    "text": "Crowd Leaves Early as Trump Dances to Music on Stage For 39 Minutes  —  town hall event on Monday reportedly began leaving early after the  —  presidential nominee decided to stop taking questions from the audience and instead played music for 39 minutes.  —  The former president attended … ",
    "url": "https://www.newsweek.com/trump-crowd-leaves-early-audience-made-listen-music-long-time-1969034"
  },
  {
    "text": "“Trump appears lost”: Alarm after Trump town hall abruptly turns into “bizarre” musical event  —  For more than a half hour, the former president stood on stage listening to music instead of answering questions  —  For just under 40 minutes, the Republican candidate who won't release … ",
    "url": "https://www.salon.com/2024/10/15/trump-appears-lost-alarm-after-town-hall-abruptly-turns-into-bizarre-musical-event/"
  },
  {
    "text": "Trump sways and bops to music for 39 minutes in bizarre town hall episode  —  Vice President Kamala Harris has called Trump, 78, unstable and questioned his mental acuity.  —  OAKS, Pa. — The town hall, moderated by South Dakota Gov. Kristi L. Noem (R), began with questions from preselected attendees for the former president.",
    "url": "https://www.washingtonpost.com/politics/2024/10/14/trump-music-sways-town-hall/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI4ODc4NDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzMwMjYwNzk5LCJpYXQiOjE3Mjg4Nzg0MDAsImp0aSI6IjhiMTg0YzljLTMzNzEtNGU0YS05N2JjLWZjODAxZGFhY2QyOSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzEwLzE0L3RydW1wLW11c2ljLXN3YXlzLXRvd24taGFsbC8ifQ.pyvRxp5n3WOTnCOWjyKNFh1y73JJFJf7B-qB-nKRbns"
  },
  {
    "text": "Trump Bobs His Head to Music for 30 Minutes in Odd Town Hall Detour  —  After multiple interruptions, Donald Trump cut off questions and seemed to decide that it would be more enjoyable for all concerned — and, it appeared, for himself — if he fired up his campaign playlist.",
    "url": "https://www.nytimes.com/2024/10/14/us/politics/trump-town-hall-dj-music.html"
  },
  {
    "text": "Trump Breaks Down Onstage  —  At a campaign event last night, Trump got bored—and weirdness ensued.  —  Is Donald Trump well enough to serve as president?  —  The question is not temperamental or philosophical fitness—he made clear long ago that the answer to both is no—but something more fundamental.",
    "url": "https://www.theatlantic.com/ideas/archive/2024/10/trump-breaks-down-stage/680256/"
  },
  {
    "text": "Kamala Harris needs weird voters  —  Tomorrow (Wednesday) at 11 a.m., I'll conduct a live Election Dialogue with Matt Yglesias on the Substack app.  Matt's outstanding newsletter, Slow Boring, has one of the highest audience overlaps with Silver Bulletin of any other Substack newsletter, so I know many of you already know him.",
    "url": "https://www.natesilver.net/p/kamala-harris-needs-weird-voters"
  },
  {
    "text": "Exclusive: Harris holds steady, marginal 45%-42% lead over Trump, Reuters/Ipsos poll finds  —  Democratic Vice President Kamala Harris held a marginal 3-percentage-point lead over Republican Donald Trump - 45% to 42% - as the two stayed locked in a tight race to win the Nov. 5 U.S. presidential election, a new Reuters/Ipsos poll found.",
    "url": "https://www.reuters.com/world/us/harris-holds-steady-marginal-46-43-lead-over-trump-reutersipsos-poll-finds-2024-10-15/"
  },
  {
    "text": "The Hour of Darkness Is Here  —  These are the times that try a nation's soul.  —  ∙ Paid  —  1. Cope Kills  —  Over the last 48 hours various Democratic friends have told me that:  — The polls are wrong.  — Polling averages are skewed by garbage Republican polls.",
    "url": "https://www.thebulwark.com/p/the-hour-of-darkness-is-here"
  },
  {
    "text": "Trump Crumbles When Pressed on Economic Policy in Tense Interview  —  The former president attempted to “weave” his way through an interview with Bloomberg News, but couldn't escape his own policy black hole  —  Donald Trump continued his pre-election economic event tour on Tuesday … ",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-crumbles-pressed-economic-policy-bloomberg-interview-1235134459/"
  },
  {
    "text": "Trump Media shares fall nearly 10% after DJT plunge triggers trading halt … Trump Media shares closed down nearly 10% Tuesday, after a wild trading session that was briefly halted due to volatility when the Truth Social owner's stock suddenly plunged in price.",
    "url": "https://www.cnbc.com/2024/10/15/trump-media-shares-halted-after-sudden-djt-stock-plunge.html"
  },
  {
    "text": "Record number of early votes cast in Georgia as election gets underway in battleground state  —  A record number of early votes have been cast in Georgia on Tuesday as residents headed to the polls in a critical battleground state that is grappling with the fallout from Hurricane Helene … ",
    "url": "https://www.cnn.com/2024/10/15/politics/early-voting-record-georgia/"
  },
  {
    "text": "Here's how Donald Trump would lower grocery prices  —  In his own words.  —  Donald Trump's town-hall-style campaign event in Pennsylvania on Monday understandably attracted more attention for its conclusion than for its contents.  But the actual question-and-answer period did provide useful insights that should not be overlooked.",
    "url": "https://www.washingtonpost.com/politics/2024/10/15/heres-how-donald-trump-will-lower-grocery-prices/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI4OTY0ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzMwMzQ3MTk5LCJpYXQiOjE3Mjg5NjQ4MDAsImp0aSI6IjVjNmM0YjFhLTA5YTktNDNkMi04Y2EwLWFkNTIyMDI2ZmFiMiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzEwLzE1L2hlcmVzLWhvdy1kb25hbGQtdHJ1bXAtd2lsbC1sb3dlci1ncm9jZXJ5LXByaWNlcy8ifQ.m6pD2Sx_LV9I8Q6mlX8B5pI-bP18hu2gBs6SQqriArw&itid=gfta"
  },
  {
    "text": "Suddenly, the Electoral College Is Posing a Problem for Trump  —  Americans of color are apparently moving to the right.  Donald Trump is poised to make historic gains with nonwhite voters in November, according to recent polling, accelerating the racial depolarization of the electorate.",
    "url": "https://slate.com/news-and-politics/2024/10/trump-electoral-college-edge-shrinks-pennsylvania-wisconsin-polls.html"
  },
  {
    "text": "The Kavanaugh cover-up  —  Over the last few years, the Supreme Court majority has issued a series of rulings that have fundamentally reshaped America — ending federal protections for abortion rights, upending the ability of federal agencies to issue regulations, and granting the president near-total immunity from criminal prosecution.",
    "url": "https://popular.info/p/the-kavanaugh-cover-up"
  },
  {
    "text": "Election 2024 live updates: Harris to sit with Charlamagne tha God as Trump defends his age  —  Trump heads to Georgia, with an Atlanta rally while Harris is in Detroit.  Their running mates, Sen. JD Vance, R-Ohio, and Minnesota Gov. Tim Walz, are campaigning in Pennsylvania.",
    "url": "https://www.nbcnews.com/politics/2024-election/live-blog/trump-harris-presidential-election-live-updates-rcna175178#rcrd60274"
  },
  {
    "text": "U.S. demands Israel improve humanitarian conditions in Gaza or risk military aid … - Israeli authorities closed crossings into Gaza earlier this month, halting deliveries of food and essential supplies to 400,000 Palestinians before some trucks were able to enter again on Monday.",
    "url": "https://www.axios.com/2024/10/15/us-israel-gaza-humanitarian-conditions-military-aid-letter"
  },
  {
    "text": "The rise — and fall? — of the New Progressive Economics … , By Andrew Prokop is a senior politics correspondent at Vox, covering the White House, elections, and political scandals and investigations. … When Kamala Harris gave her campaign's biggest economic speech yet in Pittsburgh last month … ",
    "url": "https://www.vox.com/2024-elections/377170/kamala-harris-economic-policy-new-progressive-economics"
  },
  {
    "text": "North Carolina governor candidate Mark Robinson sues CNN over report about posts on porn site  —  North Carolina Lt. Gov. Mark Robinson announced a lawsuit Tuesday against CNN over its recent report alleging he made explicit racial and sexual posts on a pornography website's message board, calling the reporting reckless and defamatory.",
    "url": "https://apnews.com/article/north-carolina-governor-robinson-porn-posts-e195d3d8a03ce7d0b3496ab7cecefbe7"
  },
  {
    "text": "Trump Abruptly Cancels Another Mainstream TV Interview  —  PULLS OUT AGAIN  —  CNBC co-host Joe Kernen announced on air that the previously unknown interview had been canceled.  —  SILENT TREATMENT  —  The former House speaker played a key role in convincing her old friend to abandon his re-election bid.",
    "url": "https://www.thedailybeast.com/donald-trump-cancels-mainstream-tv-interview-on-cnbcs-squawk-box"
  },
  {
    "text": "BrucePac meat recall includes these foods from Trader Joe's, Kroger and more.  Here's a list.  —  Hundreds of products sold at grocery chains such as Kroger, Wegmans and Trader Joe's are part of a BrucePac meat recall involving almost 10 million pounds of meat and poultry that may be contaminated … ",
    "url": "https://www.cbsnews.com/news/brucepac-recall-meat-poultry-listeria-trader-joes-kroger-usda-list/"
  },
  {
    "text": "Georgia Election Officials Have a Duty to Certify Results, Judge Rules  —  A Georgia judge ruled yesterday that certifying election results is a mandatory duty for county election officials.  —  In his opinion, Fulton County Superior Court Judge Robert McBurney stated that … ",
    "url": "https://www.democracydocket.com/news-alerts/georgia-election-officials-have-a-duty-to-certify-results-judge-rules/"
  },
  {
    "text": "Trump backs out of CNBC interview, his second about-face with mainstream press this month  —  New York CNN  —  Donald Trump has backed out of an interview with CNBC, marking the second time this month the former president has canceled on a mainstream press interview.",
    "url": "https://www.cnn.com/2024/10/15/media/trump-cancel-cnbc-interview-media/"
  }
]