[
  {
    "text": "NY Gears Up to Seize Trump Westchester Assets If Fraud Fine Is Unpaid  — State registered $454 million judgment in Westchester County  — Area is home to a Trump golf course and Seven Springs estate  —  New York state's $454 million judgment against Donald Trump in a civil fraud lawsuit … ",
    "url": "https://www.bloomberg.com/news/articles/2024-03-21/ny-poised-to-seize-trump-westchester-assets-if-fraud-fine-unpaid"
  },
  {
    "text": "Trump is broke.  That's bad news for the GOP.  —  President Biden, meanwhile, is loaded. … Presumptive GOP presidential nominee Donald Trump owes the state of New York $454 million for being a fraudulent businessman who lied about the value of his assets for years.",
    "url": "https://www.publicnotice.co/p/trump-is-broke-and-thats-bad-for-republicans"
  },
  {
    "text": "Manhattan DA tells judge not to further delay Trump trial: ‘Enough is enough’  —  The district attorney's office said only about 300 of the over 170,000 documents recently turned over to Trump's lawyers have any relevance to the case.  —  State prosecutors in New York said Thursday that fewer … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/manhattan-d-tells-judge-not-delay-trump-trial-enough-enough-rcna144453"
  },
  {
    "text": "New York Attorney General takes initial step to prepare to seize Trump assets  —  The New York attorney general's office has filed judgments in Westchester County, the first indication that the state is preparing to try to seize Donald Trump's golf course and private estate north of Manhattan, known as Seven Springs.",
    "url": "https://www.cnn.com/2024/03/21/politics/trump-calls-ny-attorney-generals-bond-suggestions-impractical-and-unjust/"
  },
  {
    "text": "Biden Leads in 6 New Polls, The Booming American Economy, The Republican Party Is Broke and Broken  —  Big Day Today - With Dems at 1pm ET, Ruben Gallego at 8pm - Join Us!  —  Happy Thursday all.  Got a few things for you today:  —  2 Events Today - Register, Join Us!",
    "url": "https://www.hopiumchronicles.com/p/biden-leads-in-6-new-polls-the-booming"
  },
  {
    "text": "Biden's stutter surges into the presidential campaign  —  Trump mocks and exaggerates the speech impediment.  Biden embraces it as reflecting compassion.  —  President Biden recently sent out a video of a meeting with a 9-year-old with a stutter, telling the young boy, “Don't let anybody tell you that you can't do anything.”",
    "url": "https://www.washingtonpost.com/politics/2024/03/21/biden-stutter-trump-mock-compassion/"
  },
  {
    "text": "Trump has an early lead on Biden.  But problems are piling up around him.  —  Missteps and unresolved policy problems are mounting for the former president.  —  Donald Trump is walking back recent comments about cutting Social Security.  He's searching for an elusive abortion message … ",
    "url": "https://www.politico.com/news/2024/03/21/trump-biden-polling-lead-problems-00148131"
  },
  {
    "text": "Apple sued by Biden administration over alleged iPhone ‘monopoly power’  —  The Department of Justice and 16 state and district attorneys general launched a major lawsuit against the technology giant accusing it of harming consumers by limiting competition.  —  The U.S. Department … ",
    "url": "https://www.nbcnews.com/business/business-news/apple-sued-doj-antitrust-monopoly-biden-rcna144424"
  },
  {
    "text": "Elon Musk Pushes a Vile, Toxic Hate Video—and Exposes His Own Scam  —  For much of the last week, Elon Musk's mighty Twitter feed—sorry, his X feed—featured as its pinned tweet a video that purports to lay bare a vast conspiracy among Democrats to “flood” the country with “illegals” to lock in a “permanent voting majority.”",
    "url": "https://newrepublic.com/article/180007/elon-musk-great-replacement-theory-hate-video"
  },
  {
    "text": "GOP lawmaker: I'm not sure we ever had votes for impeachment  —  Rep. Tim Burchett (R-Tenn.) said Wednesday evening that he was not sure the House GOP ever had enough votes for an impeachment inquiry into President Biden.  —  Burchett is a member of the House Oversight Committee … ",
    "url": "https://thehill.com/homenews/house/4546668-gop-lawmaker-im-not-sure-we-ever-had-votes-for-impeachment/"
  },
  {
    "text": "Federal judge sentencing a Jan. 6 rioter worries Trump could spur another attack  —  Judge Rudy Contreras said it wasn't tough to imagine former President Donald Trump issuing what a Jan. 6 defendant referred to as another “call to battle.”  —  WASHINGTON — A federal judge … ",
    "url": "https://www.nbcnews.com/politics/justice-department/federal-judge-sentencing-jan-6-rioter-worries-trump-spur-another-attac-rcna144465"
  },
  {
    "text": "CNN Ambushes GOP Nominee Who Called for Biden's Execution  —  The GOP pick to run North Carolina's public schools has called for the deaths of Biden and Obama.  CNN couldn't get her to comment, so they found her in person.  —  CNN couldn't get the GOP nominee to run North Carolina's public schools … ",
    "url": "https://www.thedailybeast.com/cnn-ambushes-north-carolina-gop-nominee-michele-morrow-who-called-for-bidens-execution"
  },
  {
    "text": "Kyle Rittenhouse Flees Stage After Face-Off With Booing Protesters  —  He refused to answer a question about hate speech and was booed by the crowd.  —  Kyle Rittenhouse, who became a darling of the right after shooting three protesters in 2020, hightailed it off a stage at the University … ",
    "url": "https://www.thedailybeast.com/kyle-rittenhouse-flees-university-of-memphis-stage-after-facing-off-with-booing-protesters"
  },
  {
    "text": "Trump Media, launched after an insurrection, faces rebellion of its own  —  Four lawsuits involving the founding boosters of Truth Social threaten to erode former president Donald Trump's grasp on a massive financial haul  —  When former president Donald Trump's Trump Media & Technology Group … ",
    "url": "https://www.washingtonpost.com/technology/2024/03/21/truth-social-trump-merger-lawsuits/"
  },
  {
    "text": "Statement from President Joe Biden on Nearly $6 Billion in Student Debt Cancellation for 78,000 Public Service Workers  —  Today, my Administration is cancelling student loans for an additional 78,000 public service workers - teachers, nurses, firefighters, and more - through Public Service Loan Forgiveness.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/03/21/statement-from-president-joe-biden-on-nearly-6-billion-in-student-debt-cancellation-for-78000-public-service-workers/"
  },
  {
    "text": "Prosecutor tells jury former Milwaukee official who requested fake ballots was no whistleblower  —  A jury found a former Milwaukee election official accused of obtaining fake absentee ballots guilty Wednesday of misconduct in office and fraud, rejecting her arguments that she was trying … ",
    "url": "https://apnews.com/article/wisconsin-ballot-fraud-trump-trial-c6b568d58e2ad7121566c3734ab5d851"
  },
  {
    "text": "Women are getting off birth control amid misinformation explosion  —  Search for birth control on TikTok or Instagram and a cascade of misleading videos vilifying hormonal contraception appear: Young women blaming their weight gain on the pill.  Right-wing commentators claiming that some birth control can lead to infertility.",
    "url": "https://www.washingtonpost.com/health/2024/03/21/stopping-birth-control-misinformation/"
  },
  {
    "text": "US Backs $50 Billion Ukraine Bond Using Frozen Russia Assets  — US wants G-7 to support a proposal to sell bonds for Ukraine  — The debt would be backed by profits from frozen Russian assets  —  The US proposed to its Group of Seven allies that they create a special purpose vehicle … ",
    "url": "https://www.bloomberg.com/news/articles/2024-03-21/us-backs-50-billion-bond-for-ukraine-using-frozen-russia-assets"
  },
  {
    "text": "Cannon Fodder: Law Clerks Quit On Judge Aileen Cannon  —  Please note the many UPDATES at the end of this post. … On Tuesday, the New York Times published an article titled, “Judge in Trump Documents Case Draws Attention for Slow Pace.”  Reporter Alan Feuer wrote that Judge Aileen M. Cannon … ",
    "url": "https://davidlat.substack.com/p/judge-aileen-cannon-law-clerks-quit-on-her"
  },
  {
    "text": "Garland: ‘Absurd’ to think he should've censored special counsel report on Biden  —  The attorney general said publicizing the politically damaging document was consistent with the tradition of transparency for such reports.  —  Attorney General Merrick Garland dismissed as “absurd” … ",
    "url": "https://www.politico.com/news/2024/03/21/garland-absurd-to-think-he-shouldve-censored-special-counsel-report-on-biden-00148300"
  },
  {
    "text": "Ghost Army veterans receive Congressional Gold Medal  —  The top-secret Ghost Army, which practiced deception during World War II to save tens of thousands of lives, was awarded the Congressional Gold Medal at a Thursday ceremony.  —  Three of the seven surviving veterans — Bernard Bluestein … ",
    "url": "https://thehill.com/homenews/house/4547601-ghost-army-veterans-receive-congressional-gold-medal/"
  },
  {
    "text": "Secretary Antony J. Blinken With Christiane Baissary of Al Hadath  —  RITZ-CARLTON HOTEL JEDDAH, SAUDI ARABIA  —  QUESTION:  Mr. Secretary, thank you for joining us.  —  SECRETARY BLINKEN:  Thank you for having me.  —  QUESTION:  This is your sixth tour in the region since the war started in October.",
    "url": "https://www.state.gov/secretary-antony-j-blinken-with-christiane-baissary-of-al-hadath/"
  }
]