[
  {
    "text": "Trump, White House aides signal a possible détente with Musk  —  The two men have been embroiled in a feud over legislation that encompasses the president's agenda.  —  Signs of a truce are emerging in the increasingly bitter clash between two of the world's most powerful men.",
    "url": "https://www.politico.com/news/2025/06/05/trump-white-house-aides-signal-a-possible-detente-with-musk-00391502"
  },
  {
    "text": "Trump tells ABC Musk ‘lost his mind’; ‘not particularly’ interested in talking to him  —  He spoke with ABC News Chief Washington Correspondent Jonathan Karl.  —  President Donald Trump attends a meeting with the Fraternal Order of Police in the State Dinning Room of the White House, June 5, 2025, in Washington.",
    "url": "https://abcnews.go.com/Politics/day-after-blistering-exchange-trump-calls-elon-musk/story?id=122567621"
  },
  {
    "text": "Musk already lost his war against Trump  —  Polling shows that Republicans are almost 12 times more likely to side with the president than Elon Musk.  —  There is only one person who is unquestionably able to both maintain a high level of public visibility and stay on President Donald Trump's good side.",
    "url": "https://www.washingtonpost.com/opinions/2025/06/06/musk-trump-spacex-republicans-polling/"
  },
  {
    "text": "Trump-Musk feud live updates as president says he's not focused on rift  —  What to know about the Trump-Musk feud  — President Trump told CBS News' Robert Costa he's focused on domestic and foreign policy — and not on his feud with Elon Musk.  — The relationship between Mr. Trump … ",
    "url": "https://www.cbsnews.com/live-updates/trump-elon-musk-executive-orders/"
  },
  {
    "text": "Elon Musk goes on a warpath against Trump and the GOP  —  The fallout from the very public breakup could engulf Republican hopes of holding onto the House.  —  Elon Musk just launched a war against the GOP.  Now the party's hopes of holding onto power are at stake.",
    "url": "https://www.politico.com/news/2025/06/06/elon-musk-gop-donald-trump-midterms-00391246"
  },
  {
    "text": "Kilmar Abrego Garcia on way back to US to face criminal charges: Sources  —  Sources say he faces charges of illegally transporting migrants within the U.S.  —  Undated photo provided by Murray Osorio PLLC shows Kilmar Abrego Garcia.  —  Murray Osorio PLLC via AP",
    "url": "https://abcnews.go.com/US/mistakenly-deported-kilmar-abrego-garcia-back-us-face/story?id=121333122"
  },
  {
    "text": "Trump preparing large-scale cancellation of federal funding for California, sources say  —  The Trump administration is preparing to cancel a large swath of federal funding for California, an effort which could begin as soon as Friday, according to multiple sources.",
    "url": "https://cnn.com/2025/06/06/politics/trump-california-federal-funding"
  },
  {
    "text": "DOGE Developed Error-Prone AI Tool to “Munch” Veterans Affairs Contracts  —  We obtained records showing how a Department of Government Efficiency staffer with no medical experience used artificial intelligence to identify which VA contracts to kill.  “AI is absolutely the wrong tool for this,” one expert said.",
    "url": "https://www.propublica.org/article/trump-doge-veterans-affairs-ai-contracts-health-care"
  },
  {
    "text": "Republican said Sikh should not be allowed to deliver House prayer  —  Rep. Mary Miller (R-Ill.) posted — then quickly deleted — that a Sikh should have “never been allowed” to lead the House of Representatives' daily prayer on Friday after initially incorrectly calling the man a Muslim.",
    "url": "https://www.axios.com/2025/06/06/mary-miller-sikh-house-prayer-deletes-post"
  },
  {
    "text": "Former federal inmate pardoned by Trump tapped as Bureau of Prisons deputy director  —  Joshua J. Smith, a Tennessee businessman whom the president pardoned during his first term, now advocates for inmate rehabilitation.  —  A former federal inmate who was pardoned by President Donald Trump … ",
    "url": "https://www.nbcnews.com/politics/politics-news/former-federal-inmate-pardoned-trump-tapped-bureau-prisons-deputy-dire-rcna211396"
  },
  {
    "text": "Trump administration races to fix a big mistake: DOGE fired too many people  —  Across the government, officials are rehiring federal workers who were forced out or encouraged to resign.  —  Early this spring, the Food and Drug Administration fired nearly 50 workers in the Office of Regulatory Policy … ",
    "url": "https://www.washingtonpost.com/business/2025/06/06/doge-staff-cuts-rehiring-federal-workers/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ5MTgyNDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzUwNTY0Nzk5LCJpYXQiOjE3NDkxODI0MDAsImp0aSI6ImYwMmZlZGM3LWJjNzAtNGExYy04Yzc5LTFmOTczMmM1YWJhZSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9idXNpbmVzcy8yMDI1LzA2LzA2L2RvZ2Utc3RhZmYtY3V0cy1yZWhpcmluZy1mZWRlcmFsLXdvcmtlcnMvIn0.b81QLz4gjwtIpGqhsJj5YlBXMq3JZ5brJArFCi87asc"
  },
  {
    "text": "Inside the Billion-Dollar Effort to Make Trump Feel Good About Himself  —  Trump's administration is marshaling vast public resources and more than $1 billion worth of taxpayer money to flatter the president … Vice President J.D. Vance was seated directly across from the president … ",
    "url": "https://www.rollingstone.com/politics/politics-features/donald-trump-dear-leader-bondi-noem-republican-propaganda-1235356187/"
  },
  {
    "text": "University of Michigan using undercover investigators to surveil student Gaza protesters  —  Revealed: security trailing students on and off campus as video shows investigator faking disability when confronted  —  The University of Michigan is using private, undercover investigators … ",
    "url": "https://www.theguardian.com/us-news/2025/jun/06/michigan-university-gaza-surveillance"
  },
  {
    "text": "Trump-Musk split exposes how reliant NASA has become on SpaceX  —  Elon Musk's threat Thursday to decommission SpaceX's Dragon spacecraft would have left NASA reliant on Russian capsules to get its astronauts into space.  —  Why it matters: Musk's rift with President Trump exposes … ",
    "url": "https://www.axios.com/2025/06/06/musk-spacex-dragon-capsule-nasa-space-station-trump"
  },
  {
    "text": "Two House Republicans issue megabill threats as Senate ponders changes  —  Two House Republicans drew firm red lines Friday on changes to the House GOP megabill, threatening to vote “no” if the Senate made any changes whatsoever to key provisions.  Rep. Nick LaLota of New York warned GOP senators … ",
    "url": "https://www.politico.com/live-updates/2025/06/06/congress/nick-lalota-chip-roy-megabill-red-lines-00392277"
  },
  {
    "text": "DHS memo details how National Guard troops will be used for immigration enforcement  —  National Guard troops would be used in immigration-enforcement activities, including in “night operations and rural interdiction,” as well as “guard duty and riot control” inside detention facilities … ",
    "url": "https://www.npr.org/2025/06/06/nx-s1-5425421/dhs-national-guard-immigration-enforcement"
  },
  {
    "text": "Tesla becomes desperate with Cybertruck, launches biggest discount yet  —  Tesla has announced that it now offers interest-free loans on the Cybertruck until the end of the month.  The move is the equivalent of a roughly $10,000 discount and shows that Tesla has reached a new level of desperation in trying to sell the Cybertruck.",
    "url": "https://electrek.co/2025/06/05/tesla-goes-full-desperate-cybertruck-with-biggest-discount-yet/"
  },
  {
    "text": "Former U.S. attorney Damian Williams leaves Paul Weiss for Jenner & Block  —  The former prosecutor is leaving a firm that made a deal with the Trump administration for one that fought it.  —  Damian Williams, the former top federal prosecutor in Manhattan, is leaving the law firm Paul Weiss … ",
    "url": "https://www.washingtonpost.com/politics/2025/06/06/law-firms-trump-damian-williams-jenner-block/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ5MTgyNDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzUwNTY0Nzk5LCJpYXQiOjE3NDkxODI0MDAsImp0aSI6IjI5YzdiMDBlLWQwMzAtNDVkMC04MWNmLTU4MDBiMzIzZGRmYyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzA2LzA2L2xhdy1maXJtcy10cnVtcC1kYW1pYW4td2lsbGlhbXMtamVubmVyLWJsb2NrLyJ9.Gj8fgipXLKt06b3O3P3i8YgxKvOWhVTEYKK6phhnh6w"
  },
  {
    "text": "Proud Boys Leaders Sue U.S. Over Jan. 6 Prosecutions  —  Lawsuit seeks $100 million in damages after their conviction, imprisonment for roles in Capitol attack  —  Five members of the Proud Boys, once convicted of masterminding the Jan. 6 breach of the U.S. Capitol, are accusing … ",
    "url": "https://www.wsj.com/us-news/law/proud-boys-leaders-sue-u-s-over-jan-6-prosecutions-90f9f4ce?st=qbdV5i&reflink=desktopwebshare_permalink"
  },
  {
    "text": "He's a Master of Outrage on X. The Pay Isn't Great. … Visuals by Martina Tuaty  —  Dominick McGee was walking into the White House in April and couldn't believe his luck.  He was a self-proclaimed “nobody” just three years ago when he started working alone from his apartment … ",
    "url": "https://www.nytimes.com/2025/06/06/technology/x-right-wing-influencer.html?unlocked_article_code=1.M08.RjD3.BsNcPp9EcYQn"
  },
  {
    "text": "Congress's Budget Referee Confronts Swarm of GOP Critics  —  In interview, Phill Swagel defends CBO's forecasting record, nonpartisanship  —  WASHINGTON—Phill Swagel expected this.  Well, most of it.  —  Swagel, a mild-mannered academic economist, runs the Congressional Budget Office … ",
    "url": "https://www.wsj.com/politics/policy/cbo-phill-swagel-republican-tax-spending-bill-bea1b190"
  },
  {
    "text": "Trump Planning to Extend TikTok Deadline—Again  —  The move would mark Trump's third extension, as he seeks to stave off enforcement of a law requiring that the app be banned in the U.S. or sold  —  WASHINGTON—President Trump is planning to give TikTok another lifeline.",
    "url": "https://www.wsj.com/politics/policy/trump-tiktok-ban-extension-f242c36a?st=KTCYtf&reflink=article_copyURL_share"
  },
  {
    "text": "A DOGE architect leaves the movement after Musk feuds with Trump  —  “What's not okay is his baseless personal attacks against President Trump,” James Fishback told POLITICO.  —  James Fishback, the chief architect behind the proposal to send “DOGE checks,” told POLITICO Friday he's stepping away … ",
    "url": "https://www.politico.com/news/2025/06/06/a-doge-architect-leaves-the-movement-after-musk-feuds-with-trump-00391651"
  },
  {
    "text": "White House Quietly Pressures Senate to Water Down Russia Sanctions  —  Trump administration officials urge Sen. Lindsey Graham to weaken legislation  —  WASHINGTON—The Trump administration is trying to get Sen. Lindsey Graham (R, S.C.) to significantly weaken his Russia-sanctions bill … ",
    "url": "https://www.wsj.com/politics/policy/trump-russia-sanctions-senate-dea1f81d?st=6QHTs6&reflink=article_copyURL_share"
  },
  {
    "text": "Here are the people Trump doesn't want to exist  —  Women, people of color and those in the LGBTQ+ community are main targets  —  When the Trump administration encounters a group it doesn't respect or care for, oftentimes it just deletes them — specifically, the very record of their existence.",
    "url": "https://www.washingtonpost.com/opinions/interactive/2025/trump-deletions-government-records-defense-photos/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ5MTgyNDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzUwNTY0Nzk5LCJpYXQiOjE3NDkxODI0MDAsImp0aSI6ImJmYjIzZTY0LTMwMzgtNGZhOC05ZDI2LTU0ZTFiZDk2NTRkOCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9vcGluaW9ucy9pbnRlcmFjdGl2ZS8yMDI1L3RydW1wLWRlbGV0aW9ucy1nb3Zlcm5tZW50LXJlY29yZHMtZGVmZW5zZS1waG90b3MvIn0.0mhN6Od0wCYUpcWz06nKqAjrbkkP_ySPLVR7KPHTdOQ&itid=gfta"
  },
  {
    "text": "It's a Really Bad Time to Be an Expert in Washington  —  The Trump administration has eviscerated the expert class that generated alternative views in its best moments, and engaged in groupthink at its worst.  —  The most dangerous occupation in Washington these days is being an expert.",
    "url": "https://www.nytimes.com/2025/06/06/us/politics/experts-trump-doge-cuts.html?unlocked_article_code=1.M08.NMME.SIai1RiYzApq"
  },
  {
    "text": "They are not good at this  —  Nearly five months into Trump's new reign of error, his administration's mistakes are multiplying.  —  There is no sanctuary from Trump administration buffoonery.  —  On May 29, Homeland Security Secretary Kristi Noem released a “comprehensive list of sanctuary jurisdictions.”",
    "url": "https://www.washingtonpost.com/opinions/2025/06/06/trump-mistakes-noem-rfk/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ5MTgyNDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzUwNTY0Nzk5LCJpYXQiOjE3NDkxODI0MDAsImp0aSI6IjIyM2IxYmY1LTYxZDUtNGZhMS04M2Y3LWFlNTJjZTU3YWEzNSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9vcGluaW9ucy8yMDI1LzA2LzA2L3RydW1wLW1pc3Rha2VzLW5vZW0tcmZrLyJ9.HaKf-hwQcdeM-zpBGnWp5f-9Gm8EzE78voBRPKw9OVw"
  },
  {
    "text": "The Plastic Surgery Procedure Booming Among Washington Men  —  Chiseled jawlines are in everywhere, but in Washington, D.C., people have even more reasons to go under the knife (or at least the needle).  —  One of Washington observers' favorite online games, in the MAGA-2 era … ",
    "url": "https://www.politico.com/news/magazine/2025/06/05/dc-plastic-surgery-jawlines-trump-00380485"
  },
  {
    "text": "How Trump's pick for surgeon general uses her big online following to make money  —  President Donald Trump's pick to be the next U.S. surgeon general has repeatedly said the nation's medical, health and food systems are corrupted by special interests and people out to make a profit at the expense of Americans' health.",
    "url": "https://apnews.com/article/surgeon-general-trump-casey-means-affiliate-conflicts-8d8cb29defa07028dbd97fc24a72c474"
  },
  {
    "text": "Russia is at war with Britain and US is no longer a reliable ally, UK adviser says  —  Government defence expert Fiona Hill warns UK to respond to threats by becoming more cohesive and resilient  —  Russia is at war with Britain, the US is no longer a reliable ally and the UK has to respond … ",
    "url": "https://www.theguardian.com/politics/2025/jun/06/russia-is-at-war-with-uk-and-us-no-longer-reliable-ally"
  },
  {
    "text": "A U.S. Citizen Married an Immigrant.  Trump Tore Their Life Apart.  —  “A Lot of Conversations, Research, and Crying”  —  IT'S EASY TO FORGET THAT back in 2012, Mitt Romney was an advocate for self-deportation.  The Republican challenger ran on a platform that explicitly called for the lives … ",
    "url": "https://www.thebulwark.com/p/love-in-the-time-of-self-deportation-part-two"
  },
  {
    "text": "Nearly 100 House Democrats urge RFK Jr. to restore millions in family planning grants  —  Nearly 100 House Democrats are calling on Health and Human Services Secretary Robert F. Kennedy Jr. to restore tens of millions of dollars in federal family planning grants to more than a dozen organizations … ",
    "url": "https://thehill.com/policy/healthcare/5337240-lawmakers-robert-f-kennedy-jr-restoration-family-planning-grants/"
  }
]