[
  {
    "text": "Trump blames Biden-Harris ‘rhetoric’ for latest assassination attempt, says he will ‘save the country’  —  Democrats have previously blamed Trump for raising the temperature and being a ‘threat to democracy’  —  EXCLUSIVE: Former President Trump said President Biden and Vice President Harris' … ",
    "url": "https://www.foxnews.com/politics/trump-blames-biden-harris-rhetoric-latest-assassination-attempt-says-he-save-country?intcmp=tw_pols"
  },
  {
    "text": "'The most complex, dynamic and dangerous threat environment I've experienced'  —  The second apparent assassination attempt of Donald Trump is the latest peril in a race that has been defined by anger and threats.  —  The toxic political climate and a complex web of threats … ",
    "url": "https://www.politico.com/news/2024/09/16/secret-service-threats-assassination-attempts-00179398"
  },
  {
    "text": "Man accused of trying to kill Trump wrote a book urging Iran to assassinate the ex-president  —  Ryan Wesley Routh portrayed himself online as a man who built housing for homeless people in Hawaii, tried to recruit fighters for Ukraine to defend itself against Russia, and described his support … ",
    "url": "https://apnews.com/article/trump-assassination-attempt-suspect-ukraine-f76ed09f256f6bd21727a10901d92af7"
  },
  {
    "text": "Trump's golf outings have long concerned Secret Service  —  Sunday's episode in West Palm Beach made gravely apparent the security challenges at the former president's private golf courses.  —  Soon after Donald Trump became president, authorities tried to warn him about the risks posed … ",
    "url": "https://www.washingtonpost.com/politics/2024/09/16/trump-golf-courses-secret-service-protection/"
  },
  {
    "text": "Biden and Trump speak after potential assassination attempt  —  President Biden and former President Trump spoke over the phone Monday after an apparent assassination attempt against the Republican nominee at his Florida golf course.  —  “We had a very nice call.",
    "url": "https://thehill.com/homenews/campaign/4882959-joe-biden-donald-trump-potential-assassination-attempt/"
  },
  {
    "text": "Trump assassination attempt suspect laughs, smiles during first court appearance in Florida  —  The suspect in the second assassination attempt on former President Trump laughed and smiled ahead of his first court appearance in Florida on Monday, FOX News confirmed.",
    "url": "https://www.foxnews.com/politics/trump-assassination-attempt-suspect-laughs-smiles-during-first-court-appearance-florida"
  },
  {
    "text": "J.D. Vance Just Sold Out His Family to Defend Trump and Laura Loomer  —  J.D. Vance would apparently rather protect Donald Trump's decision to pal around with self-described “proud Islamophobe” and 9/11 conspiracy theorist Laura Loomer than stand up for his own wife.",
    "url": "https://newrepublic.com/post/185988/jd-vance-family-donald-trump-laura-loomer"
  },
  {
    "text": "House Dems' ‘sleeper’ seats suddenly in sight  —  With assists from POLITICO's Congress team  —  MIDWEST MOMENTUM ... OR MIRAGE?  —  The Kamala Harris effect has House Democrats thinking they can gain seats in a place they've been losing for years: the Midwest.",
    "url": "https://www.politico.com/newsletters/inside-congress/2024/09/16/house-dems-sleeper-seats-suddenly-in-sight-00179407"
  },
  {
    "text": "A secretive group recruited far-right candidates in key US House races.  It could help Democrats  —  Joe Wiederien was an unlikely candidate to challenge a Republican congressman in one of the nation's most competitive House districts.  A fervent supporter of former President Donald Trump … ",
    "url": "https://apnews.com/article/patriots-run-project-congress-candidates-trump-democrats-republicans-election-d29b438f46589bd7ecced80ac64e93a4"
  },
  {
    "text": "Portage County sheriff: ‘Write down the addresses’ of Kamala Harris supporters who display yard signs  —  Sheriff Bruce D. Zuchowski, who took office in 2021, made the remarks in Facebook posts shared to two separate accounts on the night of Sept. 13.  —  PORTAGE COUNTY, Ohio … ",
    "url": "https://www.wkyc.com/article/news/local/portage-county/portage-county-sheriff-write-down-addresses-of-kamala-harris-supporters-who-display-yard-signs/95-3d5f701d-01c2-4207-9c42-67d8aa0f01a4"
  },
  {
    "text": "Vote for Kamala Harris to Support Science, Health and the Environment  —  Kamala Harris has plans to improve health, boost the economy and mitigate climate change.  Donald Trump has threats and a dangerous record  —  In the November election, the U.S. faces two futures.",
    "url": "https://www.scientificamerican.com/article/vote-for-kamala-harris-to-support-science-health-and-the-environment/"
  },
  {
    "text": "Scientific American magazine backs Harris with second endorsement in 179-year history  —  Scientific American magazine has endorsed Democratic presidential candidate Kamala Harris.  It's only the second time the magazine has backed a presidential candidate in its 179-year history.",
    "url": "https://www.rawstory.com/kamala-harris-scientific-american/"
  },
  {
    "text": "Abortion Bans Have Delayed Emergency Medical Care.  In Georgia, Experts Say This Mother's Death Was Preventable.  —  At least two women in Georgia died after they couldn't access legal abortions and timely medical care in their state, ProPublica has found.  This is one of their stories.",
    "url": "https://www.propublica.org/article/georgia-abortion-ban-amber-thurman-death"
  },
  {
    "text": "Elon Musk Deletes His Post Asking Why No One Has Tried to Assassinate Biden or Harris  —  His remark, just hours after what the authorities said was a second assassination attempt on Donald J. Trump, immediately drew outrage.  —  Hours after what the F.B.I. called a second attempted assassination … ",
    "url": "https://www.nytimes.com/2024/09/16/us/politics/musk-deleted-tweet-biden-kamala.html"
  },
  {
    "text": "Mark Robinson Waves Hand By Groin, Says Young Women Must ‘Get This Under Control’  —  In a newly resurfaced video from 2022, the North Carolina GOP gubernatorial nominee also criticizes “all this giving out of birth control.”  —  LOADING  —  WASHINGTON ― In a newly unearthed video from 2022 … ",
    "url": "https://www.huffpost.com/entry/mark-robinson-young-women-sex-birth-control_n_66e87182e4b06998fbec7ceb"
  },
  {
    "text": "He's Jumped the Shark  —  A television analogy helps explain what's happening in Trumpland and how the ex-president has lost the narrative.  —  Toward the end of the fifth year of the popular TV series Happy Days, the writers had The Fonz put on water skis and jump over a live shark.",
    "url": "https://statuskuo.substack.com/p/hes-jumped-the-shark"
  },
  {
    "text": "It Sure Looks Like This GOP Senate Hopeful Doctored One Of His Campaign Ads  —  In a recent TV spot, the logo of a controversial think tank is mysteriously missing from Tim Sheehy's shirt.  —  The campaign of Montana GOP Senate candidate Tim Sheehy appears to have doctored a recent TV advertisement … ",
    "url": "https://www.huffpost.com/entry/tim-sheehy-perc-tv-ad_n_66e87bbfe4b0b7fef832280f"
  },
  {
    "text": "Heritage Foundation Admits KOSA Will Be Useful For Removing Pro-Abortion Content... If Trump Wins  —  It's no secret that Trump-administration-in-waiting at the Heritage Foundation supports KOSA because it thinks it will be useful in achieving some of the most extreme goals of Project 2025, a project Heritage created.",
    "url": "https://www.techdirt.com/2024/09/16/heritage-foundation-admits-kosa-will-be-useful-for-removing-pro-abortion-content-if-trump-wins/"
  }
]