[
  {
    "text": "From Dems, a Reminder: January 6 Was Horrible  —  Shove all us grouchy Shapiro-or-bust types in a locker: Tim Walz's speech last night was the speech of the convention so far—and with the single best moment of the convention so far:  —  The bar has officially been raised for crowd-reaction shots of Ella Emhoff tonight.",
    "url": "https://www.thebulwark.com/p/dems-reminder-january-6-was-horrible"
  },
  {
    "text": "Donald Trump: ‘I Hate My Opponent’  —  DONALD TRUMP HAS NO PLANS TO HEED the advice of his aides and limit himself to policy contrasts when he debates Kamala Harris.  He wants to make it personal.  —  “This is just the way I am.  I hate my opponent.  I hate my opponents,” … ",
    "url": "https://www.thebulwark.com/p/donald-trump-i-hate-my-opponent-harris-debate-prep"
  },
  {
    "text": "I worked in Trump's White House.  Here's why I'm voting for Kamala Harris.  —  There is only one choice this November, and that candidate is Vice President Kamala Harris.  —  I am a lifelong Republican who worked in the Trump White House, and the truth is that I'd rather be backing a candidate from my own party for president.",
    "url": "https://www.msnbc.com/opinion/msnbc-opinion/former-trump-white-house-staffer-olivia-troye-voting-kamala-harris-rcna167352"
  },
  {
    "text": "White House condemns antisemitism after Trump attacks ‘Jewish Governor’ Shapiro  —  The White House on Friday issued a fresh condemnation of antisemitism after former President Donald Trump referred to Pennsylvania Gov. Josh Shapiro as the “highly overrated Jewish Governor” and criticized him for supporting Vice President Kamala Harris.",
    "url": "https://www.politico.com/live-updates/2024/08/22/dnc-live-updates-coverage/donald-trump-josh-shapiro-jewish-governor-00175805"
  },
  {
    "text": "What anxious parents of neurodivergent children can learn from Tim and Gwen Walz  —  The Walzes' words and their embrace of their son may seem utterly unremarkable.  But that's the point.  —  Minnesota Gov. Tim Walz's open acknowledgement that he and his wife used fertility treatments … ",
    "url": "https://www.msnbc.com/opinion/msnbc-opinion/tim-walz-children-gus-neurodivergent-rcna166748"
  },
  {
    "text": "“That's my dad!”  Tim Walz's DNC speech moves his kids to tears … - “Hope, Gus and Gwen, you are my entire world and I love you,” said Walz, prompting his 17-year-old son, with tears in his eyes, to stand and say: “That's my dad!”  — The reaction of Gus, who has a non-verbal learning disorder … ",
    "url": "https://www.axios.com/2024/08/22/tim-walz-dnc-speech-gus-thats-my-dad"
  },
  {
    "text": "Arkansas Supreme Court upholds rejection of abortion rights petitions, blocking ballot measure  —  The Arkansas Supreme Court upheld the state's rejection of signature petitions for an abortion rights ballot initiative on Thursday, keeping the proposal from going before voters in November.",
    "url": "https://apnews.com/article/abortion-ballot-arkansas-supreme-court-48c208d49d82b467fbcc4b9c2724617a"
  },
  {
    "text": "Trump's Angry New Rants About the Obamas Betray a Deeper MAGA Fear  —  After Barack and Michelle Obama ripped into Donald Trump at the Democratic convention, it unleashed a flood of responses from the former president.  He ranted that the Obamas had called him names, blamed his advisers for constraining him … ",
    "url": "https://newrepublic.com/article/185142/trumps-angry-new-rants-obamas-betray-deeper-maga-fear"
  },
  {
    "text": "Where Harris Has Gained and Lost Support Compared With Biden  —  Gains among women are one example of her distinctive mark on the race.  —  When Kamala Harris became her party's nominee, she inherited a Democratic coalition in shambles.  —  As she wraps up her party's convention one month later … ",
    "url": "https://www.nytimes.com/2024/08/22/upshot/kamala-harris-polling-groups.html"
  },
  {
    "text": "Bill Clinton and the wide gap in job gains by presidential party  —  Speaking at the Democratic convention, Bill Clinton suggested that the partisan “score” on job creation since the Cold War was 50 million to 1 million.  It is.  —  Former president Bill Clinton, speaking during the third night … ",
    "url": "https://www.washingtonpost.com/politics/2024/08/22/clinton-dnc-jobs-created-since-cold-war/"
  },
  {
    "text": "How Tim Walz Learned To Throw a Punch  —  The vice presidential candidate was a steady centrist.  Now he's a fighting progressive.  —  CHICAGO — Democrats let loose with roars Wednesday evening for the version of Minnesota Gov. Tim Walz that they have come to know over the past month … ",
    "url": "https://www.politico.com/news/magazine/2024/08/22/tim-walz-dnc-column-00175767"
  },
  {
    "text": "Trump promotes family's new crypto platform, ‘The Defiant Ones’ … Former president Donald Trump on Thursday promoted a soon-to-launch, Trump Organization crypto platform, “The DeFiant Ones” to his 7.5 million followers on Truth Social.  —  “For too long, the average American has been squeezed … ",
    "url": "https://www.cnbc.com/2024/08/22/trump-crypto-defi-protocol-launch.html"
  },
  {
    "text": "PBS' Judy Woodruff apologizes for remark about Trump and peace talks in Israel  —  She said her remarks had not been based on any original reporting on her part.  —  Veteran PBS correspondent Judy Woodruff apologized on Wednesday for comments she had made on the air regarding former President Donald Trump … ",
    "url": "https://www.politico.com/news/2024/08/22/judy-woodruff-apologizes-trump-israel-00175758"
  },
  {
    "text": "Pelosi is belle of the DNC ball.  Not everyone is happy about it.  —  Good morning, Early Birds.  Our condolences are with the family and friends of Rep. Bill Pascrell Jr. (D-N.J.), who died yesterday at the age of 87.  Send tips to earlytips@washpost.com.  Thanks for waking up with us.",
    "url": "https://www.washingtonpost.com/politics/2024/08/22/pelosi-is-belle-dnc-ball-not-everyone-is-happy-about-it/"
  },
  {
    "text": "Freedom Takes Center Stage: Harris and Walz's Secret Weapon Against the GOP  —  The song that was inspired by this article is available here.  —  My reading this article as an audio podcast is available here.  —  Share  —  When President Biden was running for re-election … ",
    "url": "https://hartmannreport.com/p/freedom-takes-center-stage-harris-832"
  },
  {
    "text": "Democrats: All Your Base Are Belong to Us  —  Tonight after Kamala Harris wraps, the team will be getting together for an immediate livestream over on the YouTube channel.  —  Come and hang out!  —  1. Outreach  —  Last night the Democratic party served notice that it is not satisfied … ",
    "url": "https://www.thebulwark.com/p/democrats-all-your-base-are-belong"
  },
  {
    "text": "Trump takes it upon himself to decide who is a proper Jew  —  In an interview and a late-night social media post, the former president railed against and disparaged Jewish Democrats, largely for being anti-Trump.  —  One of the defining characteristics of Donald Trump's politics is the extent … ",
    "url": "https://www.washingtonpost.com/politics/2024/08/22/trump-takes-it-upon-himself-decide-who-is-proper-jew/"
  }
]