[
  {
    "text": "Senate dismisses Mayorkas impeachment without trial  —  The Senate voted Wednesday to dismiss two articles of impeachment against Homeland Security Secretary Alejandro Mayorkas, shutting down the possibility of a lengthy Senate trial, which Republicans had demanded to bring attention … ",
    "url": "https://thehill.com/homenews/senate/4600362-mayorkas-impeachment-dismissed-trial/"
  },
  {
    "text": "Senate kick-starts Arizona abortion ban repeal after House Republicans block similar bill  —  Mary Jo Pitzl Stacey Barchenger Ray SternArizona Republic  —  Arizona House Republicans twice blocked attempts on Wednesday to repeal a near-total abortion ban that dates from 1864.",
    "url": "https://www.azcentral.com/story/news/politics/legislature/2024/04/17/arizona-abortion-ban-lawmakers-poised-to-again-try-to-overturn-1864-law/73331740007/"
  },
  {
    "text": "Senate convenes Mayorkas impeachment trial as Democrats will seek a quick dismissal  —  The Senate on Wednesday opened the impeachment trial of Homeland Security Secretary Alejandro Mayorkas over his handling of the U.S.-Mexico border, swearing in senators as jurors while Democrats said they wanted … ",
    "url": "https://apnews.com/article/mayorkas-senate-impeachment-trial-democrats-29aa775c0e866f4160f320583f261a72"
  },
  {
    "text": "Arizona Republicans Splinter Over Repeal of 1864 Abortion Ban  —  The State Senate introduced a bill to repeal a near-total abortion ban dating back to the Civil War, while the House blocked an effort to do so.  —  The two chambers of Arizona's State Legislature diverged sharply on Wednesday … ",
    "url": "https://www.nytimes.com/2024/04/17/us/arizona-abortion-ban-repeal.html"
  },
  {
    "text": "Rating Changes: Arizona Senate and AZ-6  —  KEY POINTS FROM THIS ARTICLE  — We're making a couple of rating changes today, both in Arizona.  — The state's open-seat Senate race goes from Toss-up to Leans Democratic, and Rep. Juan Ciscomani (R, AZ-6) moves from Leans Republican to Toss-up.",
    "url": "https://centerforpolitics.org/crystalball/rating-changes-arizona-senate-and-az-6/"
  },
  {
    "text": "Arizona Republicans again quash effort to repeal 1864 abortion ban  —  A state Supreme Court ruling upholding the near-total ban prompted efforts by Democratic lawmakers to repeal it and by Republicans to offset the political fallout.  —  PHOENIX — For the second time in two weeks … ",
    "url": "https://www.nbcnews.com/politics/arizona-lawmakers-repeal-abortion-ban-rcna148224"
  },
  {
    "text": "Incensed Democrats stoke GOP revolt against Mike Johnson … - Johnson “needs to make a decision,” one House Republican warned, adding that there is “a lot of frustration” in the GOP conference. … - Clark pointed to increasing indications from Republicans that they are prepared to start signing … ",
    "url": "https://www.axios.com/2024/04/17/mike-johnson-house-democrats-israel-ukraine"
  },
  {
    "text": "Trump campaign asks for cut of candidates' fundraising when they use his name and likeness  —  The campaign sent the letter as the former president is struggling to close a fundraising gap with Biden.  —  Former President Donald Trump's campaign has found a new way to press for badly needed cash.",
    "url": "https://www.politico.com/news/2024/04/17/trump-campaign-fundraising-five-percent-00152830"
  },
  {
    "text": "Barr, a vocal Trump critic, says he will ‘support the Republican ticket’ in November  —  Former attorney general previously said voting for Trump would be “playing Russian roulette with the country,” but said Wednesday that a “continuation of the Biden administration is national suicide”",
    "url": "https://www.washingtonpost.com/politics/2024/04/17/barr-vocal-trump-critic-says-he-will-support-republican-ticket-november/"
  },
  {
    "text": "Biden chokes up while talking about deceased son and Trump's disparaging remarks about service members  —  “That man doesn't deserve to have been the commander in chief for my son, my uncle,” he said, referring to Beau Biden and Ambrose Finnegan, who both served in the military.",
    "url": "https://www.nbcnews.com/politics/2024-election/biden-chokes-talking-beau-trumps-remarks-service-members-rcna148274"
  },
  {
    "text": "Exclusive: Donald Trump mulls middle-class tax cut as he eyes return to office  —  U.S. Republican presidential candidate Donald Trump has indicated to advisers he is keen on a new middle-class tax cut should he return to the White House, two people familiar with the discussions said … ",
    "url": "https://www.reuters.com/world/us/donald-trump-mulls-middle-class-tax-cut-he-eyes-return-office-2024-04-17/"
  },
  {
    "text": "Trump could have helped response to Jan. 6 riot — but didn't — per new testimony  —  Two senior leaders of the D.C. guard at the time of the Capitol attack painted a picture of the boost that never came, according to transcripts reviewed by POLITICO.  —  Donald Trump could have cleared … ",
    "url": "https://www.politico.com/news/2024/04/17/trump-jan-6-capitol-riot-national-guard-00152757"
  },
  {
    "text": "Blinken Is Sitting on Staff Recommendations to Sanction Israeli Military Units Linked to Killings or Rapes  —  A special State Department panel told Secretary of State Antony Blinken that the U.S. should restrict arms sales to Israeli military units that have been credibly accused of human rights abuses.",
    "url": "https://www.propublica.org/article/israel-gaza-blinken-leahy-sanctions-human-rights-violations"
  },
  {
    "text": "Arrest warrant issued for Rep. Kevin Boyle; family working to treat “serious” mental health condition  —  PHILADELPHIA (CBS) — An arrest warrant has been issued for Pennsylvania State Rep. Kevin Boyle, Philadelphia police said on Tuesday, April 16.  —  The warrant is for a violation of a protection from abuse order, police said.",
    "url": "https://www.cbsnews.com/philadelphia/news/kevin-boyle-state-rep-arrest-warrant-pennsylvania-philadelphia/"
  },
  {
    "text": "Maine Joins National Popular Vote Compact  —  In voting news, Maine has become the latest state to join the National Popular Vote compact, which could transform the way presidents are elected in the United States.  Sixteen states and Washington, D.C., have now pledged to award … ",
    "url": "https://www.democracynow.org/2024/4/17/headlines/maine_joins_national_popular_vote_compact"
  },
  {
    "text": "NPR Editor Who Accused Broadcaster of Liberal Bias Resigns  —  Uri Berliner, who has worked at NPR for 25 years, said in an essay last week that the nonprofit had allowed progressive bias to taint its coverage.  —  Uri Berliner, the NPR editor who accused the broadcaster of liberal bias … ",
    "url": "https://www.nytimes.com/2024/04/17/business/media/uri-berliner-npr-resigns.html"
  },
  {
    "text": "Chinese diplomats are quietly meeting with Hill staffers about TikTok  —  After a bill that would force the sale of the company passed the House, diplomats from the Chinese Embassy met with Hill offices to push talking points defending the app.  —  The Chinese Embassy has held meetings … ",
    "url": "https://www.politico.com/news/2024/04/17/china-lobbying-tiktok-congress-00152819"
  },
  {
    "text": "Council of Europe unanimously votes to use seized Russian assets to fund Ukraine reconstruction, compensation  —  Content-Type:  —  News Based on facts, either observed and verified directly by the reporter, or reported and verified from knowledgeable sources.",
    "url": "https://www.euractiv.com/section/europe-s-east/news/council-of-europe-unanimously-votes-to-use-seized-russian-assets-to-fund-ukraine-reconstruction-compensation/"
  },
  {
    "text": "Trump gripes he can't reject ‘unlimited’ jurors in New York hush money trial … Former U.S. President Donald Trump speaks to the media on the first day of his trial for allegedly covering up hush money payments at Manhattan Criminal Court on April 15, 2024 in New York City.",
    "url": "https://www.cnbc.com/2024/04/17/trump-complains-about-hush-money-trial-jury-selection.html"
  },
  {
    "text": "Secret Russian foreign policy document urges action to weaken the U.S.  —  Russia's Foreign Ministry has been drawing up plans to try to weaken its Western adversaries, including the United States, and leverage the Ukraine war to forge a global order free from what it sees as American dominance … ",
    "url": "https://www.washingtonpost.com/world/2024/04/17/russia-foreign-policy-us-weaken/"
  }
]