[
  {
    "text": "Hochul embraces gerrymandering in New York … The redistricting skirmish in New York is one front in a much larger battle nationwide.  Aside from Texas and New York, California, Ohio and Missouri are also considering similar changes to gain a political advantage ahead of next year's midterm elections … ",
    "url": "https://www.politico.com/news/2025/08/04/hochul-embraces-gerrymandering-in-new-york-00492008"
  },
  {
    "text": "Governor Abbott Statement On House Democratic Quorum Break  —  Governor Greg Abbott today released the following statement outlining the legal consequences that House Democrat members face for breaking quorum, including the potential loss of their seats and felony violations.",
    "url": "https://gov.texas.gov/news/post/governor-abbott-statement-on-house-democratic-quorum-break"
  },
  {
    "text": "Texas governor threatens to seek removal of Democrats who fled state, escalating tensions  —  The Texas state House is set to reconvene at 3 p.m. CT Monday.  Democrats have left the state to try to stop Republicans from moving ahead with enacting a new congressional map that would give the GOP five more safe seats.",
    "url": "https://www.washingtonpost.com/politics/2025/08/04/texas-democrats-redistricting-maps-abbott-trump/"
  },
  {
    "text": "Sen. Klobuchar says Congress must ‘reassert’ itself after weak jobs report  —  President Trump insists that tariffs are driving an economic boom, but the data tells a more complicated story.  Sen. Amy Klobuchar, D-Minn., denounced Trump's tariffs and firing of a senior Labor official, saying Congress must “get its power back.”",
    "url": "https://www.npr.org/2025/08/04/nx-s1-5491550/weak-jobs-reports-amy-klobuchar"
  },
  {
    "text": "Trump to Appoint New Top Labor Official Within Days  —  President Trump fired the commissioner of the Bureau of Labor Statistics on Friday after the agency released dour monthly jobs data.  —  President Trump said on Sunday that he would announce a new commissioner for the Bureau of Labor Statistics … ",
    "url": "https://www.nytimes.com/2025/08/03/us/politics/trump-bureau-labor-statistics-commissioner.html"
  },
  {
    "text": "Tesla board awards $30bn of shares to Elon Musk  —  Billionaire chief executive threatened to leave electric-vehicle maker if he was not given more stock  —  Tesla's board has approved the award of 96mn shares worth about $30bn to Elon Musk as part of a new pay deal after the billionaire … ",
    "url": "https://www.ft.com/content/ae085ae9-3d15-4d68-a28f-39c88e8bf8c8"
  },
  {
    "text": "Tesla Grants Musk $29 Billion in Stock to Keep 'Elon's Energies Focused'  —  The “interim” package announced on Monday was intended to help retain Elon Musk, whose previous pay plan was invalidated by a judge.  —  Tesla granted shares to Elon Musk worth nearly $30 billion, the company said on Monday … ",
    "url": "https://www.nytimes.com/2025/08/04/business/tesla-elon-musk-29-billion.html"
  },
  {
    "text": "US links $1.9 billion in state disaster funds to Israel boycott stance  —  U.S. states and cities that boycott Israeli companies will be denied federal aid for natural disaster preparedness, the Trump administration has announced, tying routine federal funding to its political stance.",
    "url": "https://www.reuters.com/world/us/us-links-19-billion-state-disaster-funds-israel-boycott-stance-2025-08-04/"
  },
  {
    "text": "New Firm Seeks to Confront Trump on Executive Power  —  The Washington Litigation Group is the latest nonprofit group to join the legal challenges against the president, with a strategy of focusing on appeals early in the case.  —  Cathy A. Harris learned she was fired for a third time during her daughter's high school graduation.",
    "url": "https://www.nytimes.com/2025/08/04/us/politics/trump-appeals-firings.html"
  },
  {
    "text": "Netanyahu government votes to dismiss attorney general  —  Israel's cabinet voted to dismiss Israel's attorney general, a key Netanyahu critic, as the U.S. grows increasingly impatient with the war in Gaza.  —  TEL AVIV — Israeli Prime Minister Benjamin Netanyahu's far-right government … ",
    "url": "https://www.washingtonpost.com/world/2025/08/04/gaza-war-netanyahu-pressure/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzU0MjgwMDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzU1NjYyMzk5LCJpYXQiOjE3NTQyODAwMDAsImp0aSI6ImYwMWU3OWI4LTNkMmItNDcyOS04MjMwLWZjYWYzY2U1NzM0ZSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS93b3JsZC8yMDI1LzA4LzA0L2dhemEtd2FyLW5ldGFueWFodS1wcmVzc3VyZS8ifQ.ezEnwGj1AgJPLRF7oaU5pwR-KnzIKozOj1-MdyIoiJc&itid=gfta"
  },
  {
    "text": "Rep. Nancy Mace, Trump critic-turned-ally, to run for South Carolina governor  —  She joins a crowded Republican primary field that includes a rival candidate she has already clashed with sharply this year.  —  Rep. Nancy Mace (R-South Carolina), who has shifted her stance on President Donald Trump … ",
    "url": "https://www.washingtonpost.com/politics/2025/08/04/mace-governor-south-carolina-trump/"
  },
  {
    "text": "Start the presses!  New York Post will expand to LA with launch of The California Post  —  The New York Post is going Hollywood.  —  The nation's most popular tabloid will launch The California Post early next year — delivering its brand of fearless, common-sense journalism and legendary headlines … ",
    "url": "https://nypost.com/2025/08/04/media/start-the-presses-new-york-post-will-expand-to-la-with-launch-of-the-california-post/"
  },
  {
    "text": "Kristi Noem says “Alligator Alcatraz” to be model for ICE state-run detention centers  —  Homeland Security Secretary Kristi Noem says “Alligator Alcatraz” will serve as a model for state-run migrant detention centers, and she told CBS News in an interview that she hopes to launch a handful … ",
    "url": "https://www.cbsnews.com/news/alligator-alcatraz-model-kristi-noem-homeland-security/"
  },
  {
    "text": "Community Colleges Have Been Hit by Trump's War on Elite Universities  —  Measures intended to punish elite universities are inflicting collateral damage on the nation's two-year colleges, which educate 40 percent of all undergraduates.  —  A welding class at Delta College, a community college near Saginaw, Mich.",
    "url": "https://www.nytimes.com/2025/08/04/magazine/trump-community-college-anti-dei.html?unlocked_article_code=1.bk8.O9vd.hhK-1Pm-KwAA&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "How US adults are using ‘buy now, pay later’ services, according to a new AP-NORC poll  —  The vast majority of U.S. adults are at least somewhat stressed about the cost of groceries, a new poll finds, as prices continue to rise and concerns about the impact of President Donald Trump's tariffs remain widespread.",
    "url": "https://apnews.com/article/poll-cost-living-groceries-expense-stress-worry-cd183c59f034f6e87525675f3ca04864"
  },
  {
    "text": "This Attack on a Federal Judge Is Preposterous  —  Last week, in a post on social media, Attorney General Pam Bondi announced that the Justice Department filed a misconduct complaint against James Boasberg, the chief judge of the Federal District Court in Washington, claiming he made … ",
    "url": "https://www.nytimes.com/2025/08/04/opinion/trump-bondi-judge-boasberg.html?unlocked_article_code=1.bk8.5n0B.Ku9Cgaj_6dpa&smid=url-share"
  },
  {
    "text": "Trump moves to bar nearly all abortions at Veterans Affairs hospitals  —  The proposed rule would repeal a Biden-era VA policy that allowed for abortions in some cases, including rape and incest.  —  Pregnant veterans would no longer be allowed to receive abortions at Department … ",
    "url": "https://www.washingtonpost.com/nation/2025/08/04/veterans-va-abortion-trump/"
  },
  {
    "text": "All major Las Vegas Strip casinos are now unionized in historic labor victory  —  When Susana Pacheco accepted a housekeeping job at a casino on the Las Vegas Strip 16 years ago, she believed it was a step toward stability for her and her 2-year-old daughter.",
    "url": "https://apnews.com/article/las-vegas-strip-culinary-union-casinos-hotels-804fafe363e0bc593084ab17531b2e25"
  },
  {
    "text": "Trump Praises ‘HOTTEST’ Sydney Sweeney Ad, Bashes Taylor Swift  —  The debacle over the Euphoria star's great “jeans” — and her politics — has made it all the way to the president … “Sydney Sweeney, a registered Republican, has the ‘HOTTEST’ ad out there.",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-praises-sydney-sweeney-american-eagle-ad-1235399767/"
  },
  {
    "text": "State Department to charge some travelers $10,000 bond to get visas … Those details were further spelled out in an unpublished version of the draft regulation posted to the Federal Register.  The final version of the rule is slated to publish in the Federal Register on Tuesday and take effect 15 days later, on Aug. 20.",
    "url": "https://www.politico.com/news/2025/08/04/state-department-visa-bonds-00492077"
  },
  {
    "text": "Popular 1980s actor Loni Anderson of the hit TV series ‘WKRP in Cincinnati’ has died  —  FROM AP ARCHIVES: Loni Anderson in 2023: ‘It still is nice to embrace what you are.’  —  Loni Anderson, who played a struggling radio station's empowered receptionist on the hit TV comedy “WKRP in Cincinnati … ",
    "url": "https://apnews.com/article/loni-anderson-actor-died-obituary-3614dc44dbad987f74fc4cd64bd3e7fc"
  },
  {
    "text": "Many Jewish Voters Back Mamdani.  And Many Agree With Him on Gaza.  —  Zohran Mamdani won over Jewish voters in New York City who were energized by his economic agenda and unbothered by — or sympathetic to — his views on Israel and Gaza.  —  Ben Sadoff knocked on roughly 1,000 doors … ",
    "url": "https://www.nytimes.com/2025/08/04/nyregion/zohran-mamdani-jewish-voters-gaza.html?unlocked_article_code=1.bk8.dqJ6.ai6hYcIrP_DB&smid=url-share"
  },
  {
    "text": "The 3 biggest problems with the new and unwarranted investigation into Jack Smith  —  For years, Team Trump treated the Hatch Act like a joke.  To target former special counsel Jack Smith, it's apparently changed its mind.  —  It's a serious enough problem when Donald Trump publicly endorses investigations … ",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/3-biggest-problems-new-unwarranted-investigation-jack-smith-rcna222856"
  },
  {
    "text": "China Is Choking Supply of Critical Minerals to Western Defense Companies  —  Beijing's tightened controls are a sign of the leverage it has over the U.S. military supply chain  —  China is limiting the flow of critical minerals to Western defense manufacturers, delaying production … ",
    "url": "https://www.wsj.com/world/asia/china-western-defense-industry-critical-minerals-3971ec51?st=Ududoc"
  }
]