[
  {
    "text": "Kamala Harris is breaking Republican brains  —  MAGA lacks issues against her, so it brings up the silly and the slimy  —  The MAGA crowd doesn't like Kamala Harris because she's a strong Democratic woman and candidate of African and Asian descent.  —  Those aren't good or valid reasons to oppose her, of course.",
    "url": "https://www.stopthepresses.news/p/kamala-harris-is-breaking-republican"
  },
  {
    "text": "‘DEI,’ ‘Colored,’ ‘Jezebel’: MAGA Attacks on Kamala Harris Are Getting Ugly  —  The right right can barely contain its racist, sexist contempt for Biden's likely 2024 replacement  —  MAGA REPUBLICANS ARE subjecting Vice President Kamala Harris to a barrage of racist and sexist attacks … ",
    "url": "https://www.rollingstone.com/politics/politics-news/maga-republicans-racist-sexist-attacks-kamala-harris-1235065295/"
  },
  {
    "text": "Democrats Are Making a Huge Mistake  —  Yesterday, Joe Biden did the honorable thing, after weeks of denying that anything had to be done at all.  His announcement took his party by surprise—and now, in haste, the Democrats are making a colossal error and ensuring that they will reap … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/07/kamala-harris-democrat-mini-primary/679187/"
  },
  {
    "text": "JD Vance says he's annoyed that he won't have the chance to debate Kamala Harris  —  In his first solo event as Trump's running mate, Vance blasted Biden and Harris, leaned into the culture wars and reminisced with a hometown crowd in Ohio.  —  MIDDLETOWN, Ohio — Sen. JD Vance, R-Ohio … ",
    "url": "https://www.nbcnews.com/politics/2024-election/jd-vance-annoyed-debate-kamala-harris-rcna163074"
  },
  {
    "text": "MAGA Crowd Melts Down After Mike Pence Says Something Reasonable  —  Trump followers were in a tizzy after the former vice president thanked Biden for “putting the interests of our Nation ahead of his own” by ending his campaign.  —  LOADING  —  Former Vice President Mike Pence managed … ",
    "url": "https://www.huffpost.com/entry/mike-pence-tweet-response-biden_n_669e8f38e4b03375f56eb520"
  },
  {
    "text": "Fake Harris audio spreads like wildfire on TikTok after Biden's announcement  —  Incoherent audio wrongly attributed to Vice President Kamala Harris is going viral among right-wing accounts on TikTok following President Joe Biden's exit from the presidential race.",
    "url": "https://www.mediamatters.org/tiktok/fake-harris-audio-spreads-wildfire-tiktok-after-bidens-announcement"
  },
  {
    "text": "Sen. Mark Kelly Emerges As Unexpected VP Candidate For Kamala Harris  —  Kelly is a low-profile senator with a strong resume from a swing state who could bring “demographic balance” to the Democratic ticket.  —  LOADING  —  Sen. Mark Kelly (D-Ariz.) has emerged as a surprising running mate option … ",
    "url": "https://www.huffpost.com/entry/mark-kelly-kamala-harris-vp_n_669ea19ee4b030a2640a86d8"
  },
  {
    "text": "Trump campaign began preparing for Biden exit in May, confidential memo shows  —  Exactly one month before Joe Biden's disastrous debate performance, a Donald Trump campaign staffer distributed a document to top Trump campaign aides.  The subject line: “Nominating An Alternative Democratic Presidential Candidate.”",
    "url": "https://www.politico.com/live-updates/2024/07/22/kamala-harris-campaign-biden-drop-out/trump-kamala-harris-biden-00170471"
  },
  {
    "text": "J.D. Vance bashes Democratic nominee change as anti-democratic  —  The GOP vice-presidential nominee held his first solo rallies since the party convention, first in his hometown of Middletown, Ohio, then in Radford, Va.  —  MIDDLETOWN, Ohio — A week after Ohio Sen. J.D. Vance became Donald … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/22/jd-vance-rallies-ohio-virginia/"
  },
  {
    "text": "GOP lawsuits over Kamala Harris using Biden campaign funds or headlining Democratic ballots will all fail, experts say  — Republicans may sue to stop Kamala Harris from taking Biden's campaign cash and place on the ballot.  — Such lawsuits are doomed at best — and at worst would be blatantly frivolous, legal experts told BI.",
    "url": "https://www.businessinsider.com/gop-lawsuits-kamala-harris-campaign-finance-ballot-election-will-fail-2024-7"
  },
  {
    "text": "The post-Biden era may be uncertain for the Democrats, but for Trump it will be utterly dismaying  —  Whoever is nominated, a fresh choice will be on offer - a far better one than a grudge match between two grumpy old men  —  To borrow from Shakespeare, “Nothing in his life became him like the leaving it.”",
    "url": "https://www.theguardian.com/commentisfree/article/2024/jul/22/post-joe-biden-era-democrats-donald-trump"
  },
  {
    "text": "Scoop: Senate GOP plots new attacks on Kamala Harris … - The GOP plans to exploit the dynamic of Biden himself having doubted his VP's chances at beating Trump.  — “It is important to remember the only reason Joe Biden held on as long as he did was by aggressively making the case … ",
    "url": "https://www.axios.com/2024/07/22/kamala-harris-senate-republicans-nrsc-president"
  },
  {
    "text": "Kamala Harris smashes fundraising record with stunning $81 million haul over 24 hours  —  Kamala Harris is smashing fundraising records as the Democratic Party's donors — big and small — open their wallets for the vice president in the immediate aftermath of President Joe Biden's stunning decision to step aside.",
    "url": "https://apnews.com/article/kamala-harris-fundraising-democrat-president-biden-trump-434a55ea1eb29e5da92cc9b1f9cb401f"
  },
  {
    "text": "Suddenly Trump Looks Older and More Deranged  —  Four days after the end of the Republican National Convention, it suddenly looks like a very different event.  I watched it intermittently, on television, along with perhaps 25 million other Americans (a relatively small number, though enough to matter).",
    "url": "https://www.theatlantic.com/politics/archive/2024/07/trump-looks-older-and-more-deranged/679186/"
  },
  {
    "text": "RFK Jr. floated a job in a Trump White House as he weighed endorsing Trump  —  The independent candidate suggested being given a senior job overseeing a portfolio of health and medical issues, an idea that the Trump campaign rejected  —  Independent presidential candidate Robert F. Kennedy Jr. held talks … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/22/rfk-jr-floated-job-trump-white-house-he-weighed-endorsing-trump/"
  },
  {
    "text": "Trump's age and health under renewed scrutiny after Biden's exit  —  As president, Donald Trump released a report that experts said showed he had heart disease and was obese.  But as a candidate, he has refused to release bloodwork results, his weight or other key information.",
    "url": "https://www.washingtonpost.com/politics/2024/07/22/trump-age-health/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzIxNjIwODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzIzMDAzMTk5LCJpYXQiOjE3MjE2MjA4MDAsImp0aSI6IjQ1MDY4ODcyLTI3OWQtNGIzNC1iNWM0LWFkZjdhMmEzYTVmYyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzA3LzIyL3RydW1wLWFnZS1oZWFsdGgvIn0.9mEdo0-zGkhN2Ac_-k0CywQf9hAgY-2dVwY5fWNd-RQ&itid=gfta"
  },
  {
    "text": "Lawmakers visit Butler, walk on roof where suspect shot at Trump, rallygoers  —  During a visit Monday to the site of the attempted assassination of former President Donald Trump, lawmakers climbed onto the roof used to open fire on the rally and later expressed deep doubts about official explanations … ",
    "url": "https://www.politico.com/live-updates/2024/07/22/congress/house-homeland-security-butler-trump-shooting-green-roof-00170389"
  }
]