[
  {
    "text": "US firm that paid indicted FBI informant tied to Trump associates, records reveal  —  Alexander Smirnov was paid $600,000 in 2020 - the same year he allegedly began lying to FBI about Bidens' role in Ukraine business  —  An American company that paid the now indicted FBI informant Alexander Smirnov … ",
    "url": "https://www.theguardian.com/us-news/2024/mar/14/company-paying-fbi-informant-trump-connections"
  },
  {
    "text": "Biden's Best Shot Against Trump Lies in ‘Blue Wall’ States  — Campaign has doubled its staffing in swing states this month  — Biden visits Michigan Thursday as Dingell says it's must-win  —  President Joe Biden's reelection prospects largely hinge on the so-called Blue Wall … ",
    "url": "https://www.bloomberg.com/news/articles/2024-03-14/biden-s-best-shot-against-trump-lies-in-three-blue-wall-states"
  },
  {
    "text": "Trump in court for hearing on classified documents charges  —  FORT PIERCE, Fla. — Presumptive GOP presidential candidate Donald Trump attended a court hearing Thursday where his lawyers tried to convince a federal judge to throw out charges against him for allegedly mishandling highly classified documents … ",
    "url": "https://www.washingtonpost.com/national-security/2024/03/14/trump-classified-documents-presidential-records-act-espionage/"
  },
  {
    "text": "Trump's RNC officially kills the GOP's mail-in voter effort  —  The Trump-branded Republican Party is less interested in promoting voting by mail than in legal challenges aimed at voting systems.  —  In a victory for the extremist wing of the Republican Party, it looks like Donald Trump's … ",
    "url": "https://www.msnbc.com/the-reidout/reidout-blog/main-in-voting-bank-your-vote-republicans-rcna143291"
  },
  {
    "text": "Former Treasury Secretary Mnuchin is putting together an investor group to buy TikTok  — Former Treasury Secretary Steven Mnuchin said he is putting together an investor group to try to buy TikTok.  — “I think the legislation should pass and I think it should be sold,” Mnuchin told CNBC's “Squawk Box” on Thursday.",
    "url": "https://www.cnbc.com/2024/03/14/former-treasury-secretary-mnuchin-is-putting-together-an-investor-group-to-buy-tiktok.html"
  },
  {
    "text": "In history-making visit, Harris plans to tour Minnesota abortion clinic  —  Vice President Harris plans to travel to Minnesota on Thursday to visit a reproductive health center that provides abortions, according to a White House official, in what is believed to be the first time an American president … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/14/kamala-harris-abortion-visit-minnesota/"
  },
  {
    "text": "Exclusive: Trump launched CIA covert influence operation against China  —  Two years into office, President Donald Trump authorized the Central Intelligence Agency to launch a clandestine campaign on Chinese social media aimed at turning public opinion in China against its government … ",
    "url": "https://www.reuters.com/world/us/trump-launched-cia-covert-influence-operation-against-china-2024-03-14/"
  },
  {
    "text": "Sen. Bob Menendez is considering running for re-election as an independent, sources say  —  The New Jersey Democrat has been indicted on 18 federal counts, including accepting bribes from a foreign government.  He and his wife have pleaded not guilty.  —  WASHINGTON — Indicted Sen. Bob Menendez … ",
    "url": "https://www.nbcnews.com/politics/2024-election/sen-bob-menendez-considering-running-re-election-independent-sources-s-rcna143406"
  },
  {
    "text": "Hair-Raising Details of New Jersey GOP Senate Candidate's DUI Emerge  —  Asked by a cop if he'd been in a crash, the New Jersey Republican said: “I don't think so,” according to a police report.  —  New details have emerged of an incident involving a New Jersey Republican candidate running … ",
    "url": "https://www.thedailybeast.com/hair-raising-details-of-gop-senate-candidate-alex-zdans-dui-emerge"
  },
  {
    "text": "Schumer to call for ‘new election’ in Israel in scathing speech on Netanyahu  —  “Israel cannot hope to succeed as a pariah opposed by the rest of the world,” the Senate majority leader is expected to say.  —  Senate Majority Leader Charles E. Schumer (D-N.Y.) will call for the Israeli government … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/14/israel-elections-netanyahu-charles-schumer/"
  },
  {
    "text": "Media compounds failure on Hur report  —  On February 8, Special Counsel Robert Hur released a report describing President Joe Biden as a “well-meaning, elderly man with a poor memory” and “diminished faculties.”  Although Hur concluded that criminal charges against Biden … ",
    "url": "https://popular.info/p/media-compounds-failure-on-hur-report"
  },
  {
    "text": "RFK Jr.'s VP prospect Aaron Rodgers has shared false Sandy Hook conspiracy theories in private conversations  —  Independent presidential candidate Robert F. Kennedy Jr. has confirmed that among his potential vice-presidential prospects is New York Jets quarterback Aaron Rodgers … ",
    "url": "https://www.cnn.com/2024/03/13/politics/aaron-rodgers-sandy-hook-conspiracy-theories/"
  },
  {
    "text": "Johnson signals shift on Ukraine to GOP senators  —  Speaker Mike Johnson (R-La.) told Republican senators Wednesday to expect the House to send them legislation to help Ukraine, but cautioned that what comes out of the House will look substantially different than the $95 billion foreign aid package the Senate passed last month.",
    "url": "https://thehill.com/homenews/senate/4530355-johnson-signals-shift-on-ukraine-to-gop-senators/"
  },
  {
    "text": "Elon Musk Keeps Spreading a Very Specific Kind of Racism  —  He is the “patient zero for this sort of stuff right now.”  —  Racist pseudo-science is making a comeback thanks to Elon Musk.  Recently, the tech billionaire has been retweeting prominent race scientist adherents on his platform X … ",
    "url": "https://www.motherjones.com/politics/2024/03/elon-musk-racist-tweets-science-video/"
  },
  {
    "text": "US ambassador hits out at Hungary's ‘unhinged anti-American messaging’  —  In speech in Budapest, David Pressman says while Hungary under Viktor Orbán tries to wait out US government, ‘we will act’  —  The US ambassador to Hungary has said Washington will act in response to Budapest's … ",
    "url": "https://www.theguardian.com/us-news/2024/mar/14/us-ambassador-hungary-unhinged-anti-american-messaging-orban"
  },
  {
    "text": "Sterilizer plants release a cancer-causing gas.  The Biden administration will make them cut those emissions by 90 percent  —  The Biden administration is cutting down on emissions of a cancer-causing chemical that's released by companies that sterilize medical devices and other products.",
    "url": "https://thehill.com/policy/energy-environment/4530474-sterilizer-plants-release-a-cancer-causing-gas-the-biden-administration-will-make-them-cut-those-emissions-by-90-percent/"
  },
  {
    "text": "Democrats prepare to go to war against third party candidates  —  The Democratic National Committee is building its first-ever team to counter third-party candidates while outside groups stockpile money for a wider campaign.  —  The Democratic National Committee is building its first-ever team … ",
    "url": "https://www.nbcnews.com/politics/2024-election/dnc-war-third-party-candidates-rcna143290"
  },
  {
    "text": "Stormy Daniels Is Going to Screw Trump's Campaign Schedule  —  Trump is about to have his entire schedule derailed by courtroom appearances and, even if his campaign thinks he can make it work, Trump is about to have real time problems.  —  Having secured his third straight Republican … ",
    "url": "https://www.thedailybeast.com/the-courtroom-over-the-campaign-trail-inside-trumps-broken-schedule"
  },
  {
    "text": "Gallego gets Latino Victory endorsement in Arizona Senate bid  —  Arizona Democratic Rep. Ruben Gallego's Senate bid is being backed by the Latino Victory Fund.  —  Latino Victory's endorsement on Thursday morning comes as more national and Arizona Democrats have stepped firmly into Gallego's camp … ",
    "url": "https://thehill.com/latino/4530130-gallego-latino-victory-arizona-senate-sinema-lake/"
  },
  {
    "text": "South Dakota legislator calls for inquiry into Gov. Noem's Texas dental trip and promo video  —  A Democratic legislator on Wednesday called for an inquiry into South Dakota Republican Gov. Kristi Noem's trip to Texas for dental work and a promotional video in which she praises the doctors for giving her … ",
    "url": "https://apnews.com/article/south-dakota-texas-kristi-noem-dental-teeth-775ac3e08a73e232023e38425bc5a075"
  }
]