[
  {
    "text": "GOP tax bill on track to add more than $2.5 trillion to U.S. deficit  —  The figure is expected to intensify a national debate over spending and tax levels as President Donald Trump tries to push the legislation through Congress.  —  The Republican tax proposal emerging in the House … ",
    "url": "https://www.washingtonpost.com/business/2025/05/15/gop-tax-deficit-bill/"
  },
  {
    "text": "Why The Qataris Are Happy To Dump Their 747 On Trump  —  The Qatari 747 that President Donald Trump would like to make the next Air Force One.  —  The president may be thirsting for a new four-engine jumbo jet, but many governments and royal families are unloading their fuel-guzzling palaces in the sky.",
    "url": "https://www.forbes.com/sites/jeremybogaisky/2025/05/14/qatar-747-trump/"
  },
  {
    "text": "The Trump Administration Leaned on African Countries.  The Goal: Get Business for Elon Musk.  —  The State Department has intervened on behalf of Musk's satellite internet company in five developing nations.  In Gambia, U.S. diplomats have lobbied and browbeat at least seven government ministers … ",
    "url": "https://www.propublica.org/article/trump-musk-starlink-state-department-gambia-africa-pressure"
  },
  {
    "text": "Tanks, cannons and soldiers sleeping in DC offices: Inside Trump birthday military parade  —  Plans include bringing 7,500 cots to DC office buildings for soldiers.  The latest price tag for the affair: $30 million, a figure expected to rise to $45 million.",
    "url": "https://www.usatoday.com/story/news/politics/2025/05/15/trump-birthday-army-parade/83602867007/"
  },
  {
    "text": "Democrats grill Noem on Abrego Garcia and 2 deported US children  —  A House Homeland Security Committee meeting on reconciliation devolved into a slew of criticism on Trump's biggest immigration controversies this term.  —  Democrats on Wednesday pressed Homeland Security Secretary Kristi Noem … ",
    "url": "https://www.politico.com/news/2025/05/14/kristi-noem-deportation-abrego-garcia-00349649"
  },
  {
    "text": "Walmart Plans to Raise Prices Because of Tariffs  —  Retailer has weathered the trade war but says the full impact of tariffs on consumers has yet to come  —  Higher prices are coming to Walmart's shelves.  —  The retailer said Thursday that it plans to raise prices this month and early this summer … ",
    "url": "https://www.wsj.com/business/retail/walmart-wmt-q1-earnings-report-stock-2026-b978bcf5?st=M91oNN"
  },
  {
    "text": "Trump White House Sharpens Its Knives for Politico's Owner  —  A Different Type of Playbook  —  THE TRUMP ADMINISTRATION IS SENDING aggressive signals about launching a potential federal investigation into the company that owns Politico and Business Insider as retaliation … ",
    "url": "https://www.thebulwark.com/p/trump-white-house-sharpens-knives-mathias-dopfner-axel-springer-politico-business-insider-donald-trump-jr"
  },
  {
    "text": "Judge Dismisses ‘Trespassing’ Charges Promoted by Trump in Border ‘Defense Area’  —  A newly designated “military installation” that stretches the length of the frontier in New Mexico has made trespassing a novel criminal charge at the border, bringing turmoil to the state.",
    "url": "https://www.nytimes.com/2025/05/15/us/new-mexico-border-trump.html?unlocked_article_code=1.HU8.quV3.nbRHHb_VB27J&smid=url-share"
  },
  {
    "text": "In Birthright Citizenship Case, Supreme Court Examines the Power of District Judges  —  The Supreme Court will hear arguments on whether federal judges can block Trump administration policy across the country.  —  It has been a major impediment to President Trump's agenda … ",
    "url": "https://www.nytimes.com/2025/05/15/us/supreme-court-birthright-citizenship.html?unlocked_article_code=1.HU8.fyKh.Zj3FWUxFA6Z5&smid=bs-share"
  },
  {
    "text": "D.H.S. Requests 20,000 National Guard Members to Help With Immigration Crackdown  —  The Defense Department is reviewing the request.  If approved, one official said, it would be the first time National Guard troops were used to help enforce an immigration crackdown in the country.",
    "url": "https://www.nytimes.com/2025/05/15/us/politics/national-guard-immigration.html"
  },
  {
    "text": "‘Most Transparent’ White House In History Keeps Majority Of Trump's Remarks Secret  —  Trump's aides released just 20% of the transcripts of his speeches and interactions with the press over his first 100 days, excluding many of his most unhinged comments  —  WASHINGTON — If you're interested … ",
    "url": "https://www.huffpost.com/entry/trump-secret-transcripts_n_6824fe20e4b021b5064adc84"
  },
  {
    "text": "Baby Is Healed With World's First Personalized Gene-Editing Treatment … KJ Muldoon was born with a rare genetic disorder, CPS1 deficiency, that affects just one in 1.3 million babies.Muldoon Family  —  Something was very wrong with Kyle and Nicole Muldoon's baby.  —  The doctors speculated.",
    "url": "https://www.nytimes.com/2025/05/15/health/gene-editing-personalized-rare-disorders.html"
  },
  {
    "text": "Denver airport air traffic control went out for 6 minutes on Monday, report says  —  Up to 20 pilots were unable to talk to controllers, Denver7 reports  —  Pilots flying into Denver International Airport on Monday couldn't communicate with air traffic controllers for about six minutes … ",
    "url": "https://www.denverpost.com/2025/05/15/denver-international-airport-air-traffic-control-outage-longmont/"
  },
  {
    "text": "Trump Wants His Corruption to Be Public  —  Programming note at the jump: Tonight, The Bulwark will host an emergency briefing on the major changes to our nation's health care system that Trump and his Republican allies are trying to push forward this week.  Our own Jonathan Cohn … ",
    "url": "https://www.thebulwark.com/p/trump-wants-his-corruption-to-be-public-mob-boss-justice-department-qatar-plane-air-force-one"
  },
  {
    "text": "Trump's sanctions on ICC prosecutor have halted tribunal's work  —  The International Criminal Court's chief prosecutor has lost access to his email, and his bank accounts have been frozen.  The Hague-based court's American staffers have been told that if they travel to the U.S. they risk arrest.",
    "url": "https://apnews.com/article/icc-trump-sanctions-karim-khan-court-a4b4c02751ab84c09718b1b95cbd5db3"
  },
  {
    "text": "We ran 10 flagship state colleges.  The war on higher ed won't stop with Harvard.  —  Plus, the radical jurisprudence of the late David Souter.  —  The Trump administration's attack on higher education won't be confined to Harvard University.  And Americans should be worried about what it portends … ",
    "url": "https://www.washingtonpost.com/opinions/2025/05/15/trump-harvard-uva-michigan-florida-unc/"
  },
  {
    "text": "Trump Administration Cancels Scores of Grants to Study Online Misinformation … Lisa K. Fazio, an associate professor at Vanderbilt University, whose federal grant to study how repetition of lies reinforced them was canceled.Houston Cofield for The New York Times",
    "url": "https://www.nytimes.com/2025/05/15/business/trump-online-misinformation-grants.html?unlocked_article_code=1.HU8.wE-z.z9MREZGGZqhG"
  },
  {
    "text": "US reportedly plans to slash bank rules imposed to prevent 2008-style crash  —  Watchdogs could cut capital rules as Trump's deregulation drive opens door to rollback of post-crisis protections  —  US watchdogs are reportedly planning to slash capital rules for banks designed … ",
    "url": "https://www.theguardian.com/business/2025/may/15/us-reportedly-plans-slash-bank-rules-imposed-prevent-2008-style-crash"
  },
  {
    "text": "Ed Martin publicizes ethics probe he says was wrongly disclosed  —  Former D.C. U.S. attorney nominee revealed he faces a legal disciplinary review in an all-office goodbye email, while claiming his confidentiality was violated  —  Justice Department official Ed Martin … ",
    "url": "https://www.washingtonpost.com/national-security/2025/05/15/ed-martin-dc-ethics-investigation/"
  },
  {
    "text": "Top Iranian official says Tehran would forgo highly enriched uranium in nuclear deal with Trump  —  The comments from a member of the supreme leader's inner circle appear to be the clearest public statements yet on Iran's willingness to reach an agreement with the U.S.",
    "url": "https://www.nbcnews.com/news/us-news/iran-enriched-uranium-nuclear-deal-trump-rcna206833"
  },
  {
    "text": "Did the media blow it on Biden?  —  Beginning in 2023, I repeatedly criticized both the media and Democratic partisans for failing to take former President Biden's age and fitness for office seriously enough.  This was not exactly a popular opinion at the time: the more common complaint … ",
    "url": "https://www.natesilver.net/p/did-the-media-blow-it-on-biden"
  },
  {
    "text": "Top Sexual Assault Hotline Drops Resources After Trump Orders  —  Fearing funding cuts, the anti-sexual-violence organization RAINN barred referring callers to resources for L.G.B.T.Q. people, immigrants and other marginalized groups.  —  Fearing the loss of federal funding … ",
    "url": "https://www.nytimes.com/2025/05/15/well/rainn-dei-trump-executive-orders.html"
  },
  {
    "text": "Exclusive: FEMA is “not ready” for hurricane season, internal agency review shows  —  Hurricane preparations at Federal Emergency Management Agency have slowed to a crawl, and the disaster relief agency “is not ready” for the June 1 start to the season, according to an internal agency review obtained by CNN.",
    "url": "https://cnn.com/2025/05/15/politics/fema-review-concerns-hurricane-season"
  },
  {
    "text": "Another Reason Trump's Birthright Citizenship Order is Unlawful  —  On his first day in office, President Donald Trump issued Executive Order 14,160 (the EO), which denies birthright citizenship to any child born in the United States who does not have at least one parent who is a U.S. citizen or lawful permanent resident.",
    "url": "https://www.justsecurity.org/113422/birthright-citizenship-statute/"
  },
  {
    "text": "JD Vance Plans Return to Vatican for Pope Leo's Inaugural Mass  —  Vice President JD Vance will attend the inaugural mass of Pope Leo XIV following the pontiff's historic election as the first American leader of the Roman Catholic Church.  —  Vance, the highest-ranking Catholic in the US government … ",
    "url": "https://www.bloomberg.com/news/articles/2025-05-15/jd-vance-plans-return-to-vatican-for-pope-leo-s-inaugural-mass?accessToken=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzb3VyY2UiOiJTdWJzY3JpYmVyR2lmdGVkQXJ0aWNsZSIsImlhdCI6MTc0NzMwMzk0MywiZXhwIjoxNzQ3OTA4NzQzLCJhcnRpY2xlSWQiOiJTVlpaQkVUMVVNMFcwMCIsImJjb25uZWN0SWQiOiIxMjUxREUzNTNGMjg0NUYzQjEwMEYwOUJCQzREMDgwNCJ9.vdBrzVOeUhOEhh3CRhecd8iryYtWHr5j0aoadj40F_0&leadSource=uverify%20wall"
  },
  {
    "text": "Exclusive: Musk took leased cars back so Tesla could use them as “robotaxis.”  Instead, Tesla sold them  —  Tesla last November ended an unusual policy that prohibited U.S. leasing customers from buying their cars at lease-end.  —  The policy started in 2019, when Tesla announced that customers … ",
    "url": "https://www.reuters.com/sustainability/boards-policy-regulation/musk-took-leased-cars-back-so-tesla-could-use-them-robotaxis-instead-tesla-sold-2025-05-15/"
  },
  {
    "text": "Decapitated Dolphin in North Carolina Prompts $20,000 Reward Offer From U.S.  —  The 8-foot long bottlenose dolphin was found dead with its head missing last month on the shore of Lea-Hutaff Island, N.C., north of Wilmington.  —  The federal authorities want to know who decapitated a dolphin … ",
    "url": "https://www.nytimes.com/2025/05/15/us/north-carolina-dolphin-reward.html"
  },
  {
    "text": "Florida becomes second state to ban fluoride in public water  —  Gov. Ron DeSantis called the fluoridation of water “forced medication,” saying it violates “informed consent.”  —  Florida has become the second state to officially ban fluoride in public water.",
    "url": "https://www.nbcnews.com/news/us-news/florida-becomes-second-state-ban-fluoride-public-water-rcna205127"
  },
  {
    "text": "Lessons From the Newark Debacle  —  Maybe government does something useful  —  I did something either brave or foolish last week.  I was booked on a flight from Amsterdam to Newark, and decided to ignore advice from friends urging me to rebook on a plane heading someplace else.",
    "url": "https://paulkrugman.substack.com/p/lessons-from-the-newark-debacle"
  }
]