[
  {
    "text": "Trump co-defendant Kenneth Chesebro pleads guilty in Georgia election case  —  Chesebro became the second former Trump lawyer to plead guilty in as many days, following Sidney Powell on Thursday.  —  ATLANTA — Kenneth Chesebro, a former lawyer for Donald Trump's campaign … ",
    "url": "https://www.washingtonpost.com/national-security/2023/10/20/chesebro-guilty-plea-trump-georgia/"
  },
  {
    "text": "Kenneth Chesebro: Pro-Trump lawyer pleads guilty in Georgia election subversion case, implicates Trump in fake elector conspiracy  —  Kenneth Chesebro, an attorney who helped orchestrate the Trump campaign's 2020 fake electors plot, pleaded guilty Friday in the Georgia election subversion case … ",
    "url": "https://www.cnn.com/2023/10/20/politics/kenneth-chesebro-georgia-election-subversion/"
  },
  {
    "text": "Team Trump Never Dreamed Sidney Powell Would Flip on Them  —  She was the ultimate MAGA conspiracy theorist.  Then she got charged with being part of a criminal conspiracy, and her tune started to change  —  Sidney Powell was the wildest of MAGA diehards — someone who swore long past … ",
    "url": "https://www.rollingstone.com/politics/politics-features/team-trump-sidney-powell-flip-rico-fulton-county-1234858576/"
  },
  {
    "text": "Jury selection begins in Fulton Trump case amid talk of plea deal  —  Hundreds of would-be jurors gathered at the Fulton County courthouse Friday and began filling out questionnaires, the first step in the criminal trial of a Donald Trump ally accused to conspiring with the former president to overthrow the 2020 election.",
    "url": "https://www.ajc.com/politics/jury-selection-begins-in-fulton-trump-case-amid-talk-of-plea-deal/O2LJI2U3ZNHKNCYG2QXNJLKCCI/"
  },
  {
    "text": "Live updates Jim Jordan fails to become House speaker on third ballot  —  Rep. Jim Jordan (R-Ohio) failed Friday on a third ballot to be elected House speaker after backing off a plan to empower a temporary speaker.  Jordan, a conservative firebrand and ally of former president Donald Trump … ",
    "url": "https://www.washingtonpost.com/politics/2023/10/20/house-speaker-vote-live/"
  },
  {
    "text": "Jim Jordan Says He's Not Giving Up On Speaker Bid Ahead Of Another Vote  —  As the prospect of a series of weekend votes in the House looms, the Judiciary Committee chairman is sticking with his 2020 election denialism.  —  LOADING  —  Rep. Jim Jordan (R-Ohio) is not done yet.",
    "url": "https://www.huffpost.com/entry/jim-jordan-not-giving-up-house-speaker_n_65326c14e4b0d7f72de1da43"
  },
  {
    "text": "Jordan and the GOP find a new low point in speaker mess  —  There are few things Congress loves more than a short-term solution to a long-term problem — something to help it forestall difficult decisions and paper over divisions in hopes that, at some later date, these problems will magically disappear.",
    "url": "https://www.washingtonpost.com/politics/2023/10/19/jim-jordan-speaker-mchenry-speaker/"
  },
  {
    "text": "House GOP drowning as crisis reaches breaking point  —  It seems that every day without a speaker brings a new release of pent-up anger from Republicans who see no way out of their self-inflicted pain.  —  When Matt Gaetz stepped to the microphones during Thursday's three-hour private House GOP meeting … ",
    "url": "https://www.politico.com/news/2023/10/19/house-gop-speaker-mccarthy-gaetz-00122617"
  },
  {
    "text": "It Turns Out Joe Biden Is Actually In Charge of the Biden Administration … The central Republican attack line on Joe Biden has always been that he is not in charge of his own administration.  “They're surrounded by vicious, smart people, radical left people, but they're very smart, and they're very vicious,” said Donald Trump.",
    "url": "https://nymag.com/intelligencer/2023/10/bidens-israel-policy-proves-hes-running-his-administration.html"
  },
  {
    "text": "October 2023 National Poll: Trump Making Inroads with Young Voters Against Biden, Maintains Majority Support in Republican Primary  —  Home Polls October 2023 National Poll: Trump Making Inroads with Young Voters Against Biden, Maintains Majority Support in Republican Primary",
    "url": "https://emersoncollegepolling.com/october-2023-national-poll-trump-making-inroads-with-young-voters-against-biden-maintains-majority-support-in-republican-primary/"
  },
  {
    "text": "Behind the Curtain: Rattled U.S. government fears wars could spread … Never before have we talked to so many top government officials who, in private, are so worried about so many overseas conflicts at once. … But to sound a siren of clinical, clear-eyed realism: U.S. officials … ",
    "url": "https://www.axios.com/2023/10/20/biden-government-war-fears-israel-hamas"
  },
  {
    "text": "Elon Musk's X removes the New York Times' verification badge  —  The unexplained decision removes the only symbol distinguishing the news organization from impostors and comes amid a flood of false information related to the Israel-Gaza war, some of which Musk has personally endorsed.",
    "url": "https://www.washingtonpost.com/technology/2023/10/19/x-twitter-nyt-dispute-musk/"
  },
  {
    "text": "Maryland circuit court judge killed in driveway of home, police say  —  Washington County Circuit Court Judge Andrew Wilkinson, 52, was found with apparent gunshot wounds and died at a hospital, authorities said.  —  A Maryland judge was found apparently shot in the driveway of his home Thursday evening and later died, officials say.",
    "url": "https://www.nbcnews.com/news/us-news/maryland-circuit-court-judge-killed-driveway-home-police-say-rcna121366"
  },
  {
    "text": "White House to Congress: We want $106 billion for the wars and the border  —  The request was directed to Speaker Pro Tempore Patrick McHenry who is currently leading a House that remains frozen without a speaker.  —  The Biden administration asked Congress on Friday to approve … ",
    "url": "https://www.politico.com/news/2023/10/20/white-house-to-congress-we-want-106-billion-for-the-wars-and-the-border-00122704"
  },
  {
    "text": "Sarah Huckabee Sanders Bans ‘Woke’ Words In Culture War Cluelessness  —  The Arkansas governor, who once served as Trump's press secretary, was criticized by the ACLU and LGBTQ+ advocates for the move.  —  LOADING  —  Arkansas Gov. Sarah Huckabee Sanders (R) on Thursday signed an executive order banning … ",
    "url": "https://www.huffpost.com/entry/sarah-huckabee-sanders-anti-woke_n_65327ce1e4b0eb7cdbc26f38"
  },
  {
    "text": "Israeli official slams Greta Thunberg after she backs Palestinians in Gaza  —  ‘Whoever identifies with Greta in any way in the future, in my view, is a terror supporter,’ says Israeli army spokesperson.  —  The Israeli military lashed out at Swedish climate activist Greta Thunberg on Friday … ",
    "url": "https://www.politico.eu/article/greta-thunberg-calls-global-pro-palestinian-strike-gaza-genocide-israel-slam/"
  },
  {
    "text": "Judge Won't Let Alex Jones Use Bankruptcy to Avoid Sandy Hook Damages  —  A Texas court ruling means the Infowars broadcaster must pay most of the $1.4 billion he owes Sandy Hook families, regardless of whether his business survives.  —  The judge in Alex Jones's bankruptcy case ruled … ",
    "url": "https://www.nytimes.com/2023/10/19/us/politics/alex-jones-sandy-hook.html"
  },
  {
    "text": "Jon Stewart's Show on Apple Is Ending  —  Mr. Stewart and Apple are parting ways because of creative differences over “The Problem,” people with knowledge of the decision said.  —  Jon Stewart's show on Apple's streaming service is abruptly coming to an end, according to several people … ",
    "url": "https://www.nytimes.com/2023/10/19/business/media/jon-stewart-the-problem-ends.html"
  }
]