[
  {
    "text": "Playbook: Kamala Harris sizes up her competition  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  EURO EARTHQUAKE — Voters in the European Parliament elections veered sharply to the right in results announced yesterday, with many of the continent's ruling centrist parties making major retreats.",
    "url": "https://www.politico.com/newsletters/playbook/2024/06/10/kamala-harris-sizes-up-her-competition-00162458"
  },
  {
    "text": "Trump tells rally-goers not to die in searing Vegas heat: 'I don't care about you, I just want your vote'  —  Remark get laughs at rally - but also draws raised eyebrows on social media as critics argue Trump was being truthful  —  Donald Trump is no stranger to accusations that he has little regard … ",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/trump-voters-heat-las-vegas-b2559547.html"
  },
  {
    "text": "Eric Swalwell Savages Trump Rally With ‘You Might Be In A Cult If... ’ Video  —  The California congressman hilariously captured the ridiculous messianic vibe of Trump's Las Vegas campaign stop.  —  LOADING  —  Rep. Eric Swalwell (D-Calif.) mocked Donald Trump's Las Vegas rally Sunday … ",
    "url": "https://www.huffpost.com/entry/eric-swalwell-trump-you-know-youre-in-a-cult-if_n_6666c4f4e4b02fc48bf3e03f"
  },
  {
    "text": "The Mooch's warning to Trump's new pals on Wall Street  —  Editor's note: Morning Money is a free version of POLITICO Pro Financial Services morning newsletter, which is delivered to our subscribers each morning at 5:15 a.m. The POLITICO Pro platform combines the news you need with tools … ",
    "url": "https://www.politico.com/newsletters/morning-money/2024/06/10/the-moochs-warning-to-trumps-new-pals-on-wall-street-00162439"
  },
  {
    "text": "Biden admin has discussed potentially negotiating unilateral deal with Hamas to free U.S. hostages  —  Such talks, if they begin, would not include Israel and would be conducted through Qatari interlocutors.  —  WASHINGTON — Biden administration officials have discussed potentially negotiating … ",
    "url": "https://www.nbcnews.com/news/investigations/biden-administration-discussed-potentially-negotiating-unilateral-deal-rcna156266"
  },
  {
    "text": "Trump's sentencing: everything you need to know  —  Defendants normally plead for leniency.  Trump is too busy slandering the judge. … With Donald Trump's sentencing for his 34 felony convictions just a month away, speculation about the criminal consequences for the former president is reaching a fever pitch.",
    "url": "https://www.publicnotice.co/p/trump-new-york-sentencing-explained-july-11-2024"
  },
  {
    "text": "The brazen GOP plan to launder cash to the nation's most radical gubernatorial candidate  —  One of the country's most hotly contested gubernatorial contests is taking place in North Carolina, where Lt. Governor Mark Robinson (R) — known for his extremist views on LGBTQ rights, abortion … ",
    "url": "https://popular.info/p/the-brazen-gop-plan-to-launder-cash"
  },
  {
    "text": "Donald Trump's Last (We Hope) Grift  —  Have you been to the Trump Ocean Resort Baja Mexico?  It's absolutely lovely; you must visit one of these days.  I did, a little while back.  Let me tell you all about it.  The resort is in Mexico, just over the border with the United States and southwest of … ",
    "url": "https://newrepublic.com/article/182345/donald-trump-last-grift"
  },
  {
    "text": "Liberal Judge Susan Crawford enters race for Wisconsin Supreme Court with majority at stake  —  A liberal judge who previously represented Planned Parenthood in a case related to abortion access has entered the race for Wisconsin Supreme Court  —  This photo provided by Susan Crawford for Wisconsin … ",
    "url": "https://abcnews.go.com/US/wireStory/liberal-judge-susan-crawford-enters-race-wisconsin-supreme-110980605"
  },
  {
    "text": "Trump irritates House Freedom Caucus with endorsements … But there is one area where Trump is really irking the group of conservative hardliners — endorsements.  —  First, Trump endorsed against the group's chair, Rep. Bob Good (R-Va.).  Now, senior HFC members are openly criticizing … ",
    "url": "https://punchbowl.news/article/election-2024/donald-trump-house-freedom-caucus-endorsements/"
  },
  {
    "text": "Trump Demands Biden Remove Ad of Him Calling Dead Soldiers ‘Suckers’ and ‘Losers’  —  WAGING WAR  —  The former president said only a “psycho” or a “very stupid person” would've made such statements.  —  Donald Trump on Sunday called for President Joe Biden to take down an attack ad featuring … ",
    "url": "https://www.thedailybeast.com/trump-demands-biden-remove-ad-of-him-calling-dead-soldiers-suckers-and-losers"
  },
  {
    "text": "The Success Narratives of Liberal Life Leave Little Room for Having Children  —  For young, secular, politically progressive men and women, having children has become something of an afterthought.  Liberal conventional wisdom encourages people to spend their 20s on journeys of personal … ",
    "url": "https://www.nytimes.com/2024/06/10/opinion/natalism-liberalism-parenthood.html"
  },
  {
    "text": "Ukraine strikes Moscow's most advanced fighter jet inside Russia … - The attack took place at the Akhtubinsk airfield in Russia's Astrakhan region, about 366 miles behind the front lines, GUR added.  — “The Su-57 is Moscow's most advanced fighter” jet that can carry two different types of cruise missiles.",
    "url": "https://www.axios.com/2024/06/10/ukraine-strike-russian-fighter-jet-su57"
  },
  {
    "text": "Scholz Heading for Another Election Rout in Eastern Germany  — Ruling parties were trounced in the former communist regions  — Three states where AfD is strongest force vote in September  —  Scholz's SPD Sees Worst-Ever Result in Germany's EU Vote  —  Chancellor Olaf Scholz's … ",
    "url": "https://www.bloomberg.com/news/articles/2024-06-10/scholz-heading-for-another-election-debacle-in-eastern-germany"
  },
  {
    "text": "EU elections 2024 live: Emmanuel Macron dissolves French parliament and calls snap election after huge far-right gains  —  Emmanuel Macron makes shock decision to call election for 30 June after National Rally makes huge gains in France  —  Turnout across EU at 51% Estimates for Portugal Estimate for Romania Estimate for Poland",
    "url": "https://www.theguardian.com/world/live/2024/jun/09/eu-europe-elections-2024-results-news-updates-live-latest"
  },
  {
    "text": "Benny Gantz Quits Israel's Emergency Government in Dispute Over Gaza  —  Gantz threatened to resign last month.  —  The Israeli politician Benny Gantz, a key member of the country's war cabinet, quit the government on Sunday over Prime Minister Benjamin Netanyahu's handling of the war in Gaza.",
    "url": "https://www.nytimes.com/live/2024/06/09/world/israel-gaza-war-hamas"
  }
]