[
  {
    "text": "Libertarians block Trump's longshot bid for party support … - Trump and independent presidential candidate Robert F. Kennedy Jr. were both among the candidates nominated by delegates on Sunday, but Libertarian Party chair Angela McArdle determined the former president was ineligible … ",
    "url": "https://www.axios.com/2024/05/26/trump-libertarian-rfk-jr-ineligible-nominee"
  },
  {
    "text": "Trump booed at Libertarian convention  —  Donald Trump was booed repeatedly during an appearance at the Libertarian Party's national convention on Saturday as he asked members for their support.  —  Mr Trump, the presumptive Republican presidential nominee, told the party's delegates to unite with him to beat Democrat Joe Biden.",
    "url": "https://www.bbc.com/news/articles/c722qy5dzlgo"
  },
  {
    "text": "Trump doesn't submit paperwork to be considered by Libertarian Party after soliciting votes  —  On Saturday, Trump asked multiple times for the libertarian audience to nominate him or vote for him.  —  WASHINGTON — Hours after former President Donald Trump asked libertarians … ",
    "url": "https://www.nbcnews.com/politics/2024-election/trump-doesnt-submit-paperwork-libertarian-party-nomination-soliciting-rcna154132"
  },
  {
    "text": "RFK Jr. loses in first round of Libertarian Party's presidential nomination vote.  Trump didn't file paperwork to qualify  —  Independent presidential candidate Robert F. Kennedy Jr. was eliminated from contention for the Libertarian Party's presidential nomination during the party's convention Sunday.",
    "url": "https://www.cnn.com/2024/05/26/politics/rfk-jr-nominated-libertarian-party/"
  },
  {
    "text": "Tim Scott on Trump Getting Booed by Libertarians: He's So Popular!  —  THEY WERE SAYING ‘BOO-URNS’  —  Trump was met with a wall of boos on Saturday night.  For one of his veepstakes frontrunners, that shows the ex-president is only getting more popular.  —  Donald Trump was met … ",
    "url": "https://www.thedailybeast.com/tim-scott-on-trump-getting-booed-by-libertarians-hes-so-popular"
  },
  {
    "text": "Denial about Donald Trump has reached a new low  —  Authoritarians have often told us what they are going to do, but people have rarely believed them.  —  Republican presidential candidate Donald Trump, who incited a violent insurrection in January 2021 to try and remain in office illegally … ",
    "url": "https://www.msnbc.com/opinion/msnbc-opinion/trump-authoritarianism-american-denial-2024-rcna153962"
  },
  {
    "text": "Peru's Unpopular Leader Hits New Low: A 5% Approval Rating  — A new poll by IEP shows continuous decline in voters' support  — Scandals have led to several impeachment attempts this year  —  Peru's Dina Boluarte saw her approval rating fall to a new low, with only 5% of people indicating … ",
    "url": "https://www.bloomberg.com/news/articles/2024-05-26/peru-s-unpopular-leader-hits-new-low-a-5-approval-rating"
  },
  {
    "text": "Royce White—Steve Bannon Protege Who Called Our Reporter a “Cuck”—Endorsed by Minnesota GOP for Senate  —  The former NBA player and Black Lives Matter protester leader became a MAGA star spewing galaxy-brain conspiracies about Jews.  Now, he's got the stamp of approval from the GOP.",
    "url": "https://www.motherjones.com/politics/2024/05/royce-white-us-senate-2024-republican-nomination-blm-george-floyd-nba/"
  },
  {
    "text": "Seattle museum shut down after staff walkout to protest exhibit on antisemitic hatred  —  Nearly 30 Seattle museum staffers have shut down the art center in protest of its new “Confronting Hate Together” exhibit, claiming portions of the show “conflate anti-Zionism as antisemitism.”",
    "url": "https://nypost.com/2024/05/26/us-news/seattle-museum-shut-down-by-staffers-who-walk-off-job-to-protest-exhibit-on-antisemitic-hatred/"
  },
  {
    "text": "Hill GOP urges Trump to consider a running mate with center-right appeal — maybe even Haley  —  Rep. Ryan Zinke (R-Mont.) advised Trump to look at a VP pick who “really reflects areas where he needs to be more competitive to win.”  —  Donald Trump is getting clear advice from a sizable number … ",
    "url": "https://www.politico.com/news/2024/05/26/trump-running-mate-haley-gop-00159747"
  },
  {
    "text": "Transcript: Transportation Secretary Pete Buttigieg on “Face the Nation,” May 26, 2024  —  The following is a transcript of an interview with Transportation Secretary Pete Buttigieg on “Face the Nation” that aired on May 26, 2024.  —  MARGARET BRENNAN: And we're joined by the Secretary of Transportation, Pete Buttigieg.",
    "url": "https://www.cbsnews.com/news/pete-buttigieg-transportation-secretary-face-the-nation-transcript-05-26-2024/"
  },
  {
    "text": "Fetterman, Flashing a Sharper Edge, Keeps Picking Fights With the Left  —  The first-term Pennsylvanian has battled with progressives on Israel, immigration and energy, adopting a more caustic political persona and alienating some supporters.  —  Senator John Fetterman was hard to miss … ",
    "url": "https://www.nytimes.com/2024/05/26/us/politics/fetterman-democrats-israel-gaza.html"
  },
  {
    "text": "Who is Ross Ulbricht, the prison inmate who could be key to Trump's libertarian support  —  Former President Donald Trump received a frosty reception at this weekend's Libertarian Party's national convention, but one of his few applause lines was for promising to commute a sentence for a man named Ross Ulbricht.",
    "url": "https://www.washingtonexaminer.com/news/campaigns/presidential/3017931/ross-ulbricht-prison-inmate-key-trump-libertarian-support/"
  },
  {
    "text": "Proposed Texas GOP platform calls for the Bible in schools, electoral changes that would lock Democrats out of statewide office  —  The platform was voted on Saturday, with tallies expected next week.  Other planks call abortion homicide and gender-transition care “child abuse.”",
    "url": "https://www.texastribune.org/2024/05/25/texas-republican-party-convention-platform/"
  }
]