[
  {
    "text": "Full transcript of Biden's special counsel interview paints nuanced portrait  —  The president doesn't seem as absent-minded as Hur has made him out to be — and Hur doesn't appear as crass as Biden has portrayed him  —  President Biden was in the early stages of his interview … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/12/biden-hur-transcript-classified-documents/"
  },
  {
    "text": "Robert Hur will testify as private citizen with help from Trumpworld figures  —  EXCLUSIVE: Ex-Special Counsel arranged to leave Justice Department the day before his appearance with the House Judiciary Committee  —  Special Counsel Robert Hur to testify on Biden's handling of classified documents",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/robert-hur-trump-special-counsel-b2510944.html"
  },
  {
    "text": "How the Special Counsel's Portrayal of Biden's Memory Compares With the Transcript  —  The special counsel, Robert K. Hur, accused the president last month of “significant” memory problems.  The interview transcript offers context to his report.  —  A transcript of a special counsel's hourslong interview … ",
    "url": "https://www.nytimes.com/2024/03/12/us/politics/hur-biden-memory-transcript.html"
  },
  {
    "text": "Special Counsel Who Investigated Biden to Defend Report by Saying He Needed to ‘Show My Work’  —  Republicans are likely to pepper Robert K. Hur about his justifications for not charging the president.  Democrats will almost certainly slam him for making broad assertions about Mr. Biden's memory.",
    "url": "https://www.nytimes.com/2024/03/12/us/politics/robert-hur-biden-report.html"
  },
  {
    "text": "Biden pounces as Trump eyes cuts to Social Security and Medicare  —  Democrats want nothing more than to see Donald Trump talk about cutting Social Security and Medicare.  Fortunately for them, that's exactly what happened.  —  At a time when so much of American politics seems radical … ",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/biden-pounces-trump-eyes-cuts-social-security-medicare-rcna142920"
  },
  {
    "text": "Republican Voters Against Trump Plans $50 Million Ad Campaign  —  The group, Republican Voters Against Trump, will run a series of homemade videos of Americans who voted for him in the past but say they can no longer do so in 2024.  —  A Republican group dedicated to opposing former President Donald J. Trump … ",
    "url": "https://www.nytimes.com/2024/03/12/us/politics/republican-voters-against-trump.html"
  },
  {
    "text": "Boeing whistleblower found dead in US  —  Prior to his death, whistleblower John Barnett was testifying against Boeing over concerns about standards.",
    "url": "https://www.bbc.com/news/business-68534703"
  },
  {
    "text": "It Sure Seems Like the Courts Have Placed Christianity Above Other Faiths  —  “Religious freedom” is having a moment in federal courts.  One of the big successful goals of the conservative legal movement was that religious freedom would be advanced in a way that it supposedly had not been before.",
    "url": "https://slate.com/news-and-politics/2024/03/supreme-court-and-religion-judges-christianity.html"
  },
  {
    "text": "Diplomatic source to ‘Post’: Gaza maritime route was Netanyahu's idea - exclusive  —  According to the source, on October 22, two weeks following the war's outbreak, Netanyahu discussed with President Biden the concept of “delivering humanitarian aid to Gaza via the sea”",
    "url": "https://www.jpost.com/international/article-791239"
  },
  {
    "text": "Trump asked Elon Musk if he wanted to buy Truth Social  —  The idea went nowhere, but the former president and the billionaire X owner have continued to communicate more than was previously known  —  Former president Donald Trump asked Elon Musk last summer whether the billionaire industrialist … ",
    "url": "https://www.washingtonpost.com/technology/2024/03/12/trump-musk-truth-social-sale/"
  },
  {
    "text": "‘Absolute bloodbath’ at RNC as new leadership loyal to Trump purges staff  —  Chair Michael Whatley and co-chair Lara Trump move to reorganize the party, with an expected cull of 60 members  —  Donald Trump's new leadership team at the Republican National Committee started the process … ",
    "url": "https://www.theguardian.com/us-news/2024/mar/11/new-rnc-leadership-trump-loyals-purge-staff"
  },
  {
    "text": "RNC fires dozens of employees after Trump-backed leadership takes over  —  About 60 people were told they were no longer employed, according to a person with direct knowledge  —  The new leadership team at the Republican National Committee — handpicked by former president Donald Trump … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/11/rnc-trump-firings/"
  },
  {
    "text": "Team Trump Begs Him to Keep His Mouth Shut at NYC Criminal Trial  —  The former president's lawyers and aides are trying to “prevent him from talking his way into a mess,” says one Trump adviser  —  SEVERAL LAWYERS AND political advisers for Donald Trump tell Rolling Stone that they want him to keep … ",
    "url": "https://www.rollingstone.com/politics/politics-features/team-trump-mouth-shut-new-york-criminal-trial-1234985735/"
  },
  {
    "text": "Republicans say Britt being treated like Sarah Palin 2.0  —  Alabama Sen. Katie Britt's (R) debut on the national political stage is prompting comparisons to another fiery conservative mom: former Alaska Gov. Sarah Palin (R).  —  The comparisons took a new life late Saturday … ",
    "url": "https://thehill.com/homenews/senate/4524885-republicans-say-britt-being-treated-like-sarah-palin-2-0/"
  },
  {
    "text": "New data explodes myth of crime wave fueled by migrants  —  Republican politicians and sympathetic media outlets are claiming that America is in the midst of a violent “crime wave,” driven in part by undocumented immigrants.  New data, however, demonstrates that there was not a spike in violent crime in 2023.",
    "url": "https://popular.info/p/new-data-explodes-myth-of-crime-wave"
  },
  {
    "text": "The US DEI regime failed Haiti  —  The National Palace of Haiti was once among the most recognizable and beautiful architectural landmarks of one of the world's poorest countries.  —  Today, the site where it stood is empty.  The building was demolished in 2012 after sustaining severe damage … ",
    "url": "https://www.washingtonexaminer.com/opinion/2914276/the-us-dei-regime-failed-haiti/"
  },
  {
    "text": "Does telling the truth matter anymore?  —  To say that this nation is hopelessly politically divided is the understatement of the year.  It shouts out at you in every political poll.  We no longer have two competing political parties but two armed enemy camps.",
    "url": "https://thehill.com/opinion/4525483-press-does-telling-the-truth-matter-anymore/"
  },
  {
    "text": "Donald Trump Stung as New Poll Shows How Unpopular He Is  —  Donald Trump continues to have a low favorability score among Americans, new polling shows, despite being the likely Republican nominee after winning the lion's share of primaries and seeing off his only remaining rival.",
    "url": "https://www.newsweek.com/donald-trump-unpopular-polls-2024-election-1877870"
  },
  {
    "text": "House GOP report aims to undermine Jan. 6 committee … - A senior Democratic congressional aide called the report “yet another attempt to rewrite the history of January 6th and whitewash the events of that horrible, bloody, and violent day.”  — Rep. Bennie Thompson (D-Miss.) … ",
    "url": "https://www.axios.com/2024/03/11/house-republican-report-jan-6-committee"
  }
]