[
  {
    "text": "George Santos Accused Of Stealing House Member's Personal Credit Card Info  —  GOP Rep. Max Miller of Ohio made the allegation not long before Santos was expelled from Congress.  —  Rep. Max Miller (R-Ohio) accused his now-former GOP colleague George Santos of stealing his and his mother's … ",
    "url": "https://www.huffpost.com/entry/max-miller-george-santos-expelled_n_656a0ee7e4b066e398b77240"
  },
  {
    "text": "House votes to expel indicted Rep. George Santos from Congress  —  The New York Republican is now just the third lawmaker since the Civil War to be expelled from the House of Representatives.  —  WASHINGTON — The House voted overwhelmingly to expel indicted Rep. George Santos on Friday … ",
    "url": "https://www.nbcnews.com/politics/congress/george-santos-expulsion-congress-ny-house-ethics-committee-rcna127179"
  },
  {
    "text": "40 bills that didn't get a single vote: What Rep. George Santos did in Congress  —  An NBC News analysis of the New York Republican's legislative record shows few accomplishments and little support from his colleagues.  —  WASHINGTON — Former Rep. George Santos, R-N.Y. … ",
    "url": "https://www.nbcnews.com/politics/congress/george-santos-bills-vote-congress-legislative-career-rcna127464"
  },
  {
    "text": "NY-03: With Santos Expulsion Likely, Toss Up Special Looms on Long Island  —  With nearly 90 House Republicans planning to vote to expel GOP Rep. George Santos (NY-03) per Politico's latest whip count, it looks like a matter of hours until the most infamous House member of the social media age is finally ousted.",
    "url": "https://www.cookpolitical.com/analysis/house/new-york-house/ny-03-santos-expulsion-likely-toss-special-looms-long-island"
  },
  {
    "text": "Steve Scalise reveals what's really happened since McCarthy's fall  —  The House Majority Leader illuminates what happened behind closed doors after Kevin McCarthy's ousting as well as what to expect next on impeachment; why he will vote against expelling George Santos; and how Speaker Mike Johnson … ",
    "url": "https://www.politico.com/news/2023/12/01/steve-scalise-house-majority-00129239"
  },
  {
    "text": "Trump can be held civilly liable in Jan. 6 riot, judges rule  —  Donald Trump can be held civilly liable for the actions of the mob that attacked the U.S. Capitol on Jan. 6, 2021, an appeals court ruled Friday in a long-awaited decision that could clear the way for lawsuits seeking financial damages from the former president.",
    "url": "https://www.washingtonpost.com/dc-md-va/2023/12/01/trump-can-be-sued-jan-6-immunity/"
  },
  {
    "text": "Behind the Curtain — Scoop: The Trump job applications revealed  —  We told you in a “Behind the Curtain” column last month that Trump allies are pre-screening the ideologies of thousands of potential appointees and employees in case he wins back the White House.",
    "url": "https://www.axios.com/2023/12/01/trump-government-job-applications-2025"
  },
  {
    "text": "Trump's campaign thinks it's getting a surprise assist from Dean Phillips  —  Joe Biden's primary opponent is make the ex-president's electability argument for him.  —  Donald Trump's campaign believes it's getting a welcome boost from an unexpected source.",
    "url": "https://www.politico.com/news/2023/12/01/trump-surprise-assist-dean-phillips-00129427"
  },
  {
    "text": "Sparks flew behind the scenes at the Ron DeSantis and Gavin Newsom debate  —  While the candidates said they were happy to keep debating for longer than 90 minutes, an intervention from the California governor's wife put a stop to it.  —  Florida Gov. Ron DeSantis and California Gov. Gavin Newsom … ",
    "url": "https://www.nbcnews.com/politics/2024-election/gavin-newsom-fox-debate-rcna127563"
  },
  {
    "text": "Newsom camp: Hannity, DeSantis cheated.  They dispute the charges.  —  The messy prime-time event outside Atlanta between Gavin Newsom and Ron DeSantis didn't end when the Fox News cameras stopped.  Newsom's team says DeSantis and Fox broke several rules.  —  ALPHARETTA, Georgia — So much for that Newsom-Hannity bromance.",
    "url": "https://www.politico.com/news/2023/12/01/newsom-desanitis-debate-cheating-00129555"
  },
  {
    "text": "Sandra Day O'Connor, the first female Supreme Court justice, dead at 93  —  From the early 1990s until her retirement in 2005, she was the indisputable swing justice  —  Sandra Day O'Connor, the first woman to serve on the Supreme Court and the justice who held the court's center for more than a generation … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/sandra-day-oconnor-dead-dies-rcna127589"
  },
  {
    "text": "Speaker Johnson wrote foreword for book filled with conspiracy theories and homophobic insults  —  Speaker of the House Mike Johnson wrote the foreword and publicly promoted a 2022 book that spread baseless and discredited conspiracy theories and used derogatory homophobic insults.",
    "url": "https://www.cnn.com/2023/12/01/politics/kfile-mike-johnson-conspiracy-theories-homophobic-slurs/"
  },
  {
    "text": "Why Cornel West Is Broke  —  Newly uncovered divorce filings reveal allegations of a “secret life” and help explain why the presidential candidate, who has earned millions of dollars over the years, has hardly anything left.  —  Cornel West has been a fixture of American society for more than three decades … ",
    "url": "https://www.forbes.com/sites/jemimadenham/2023/12/01/why-cornel-west-is-broke/"
  },
  {
    "text": "Israel Knew Hamas's Attack Plan More Than a Year Ago  —  A blueprint reviewed by The Times laid out the attack in detail.  Israeli officials dismissed it as aspirational and ignored specific warnings.  —  Israeli officials obtained Hamas's battle plan for the Oct. 7 terrorist attack … ",
    "url": "https://www.nytimes.com/2023/11/30/world/middleeast/israel-hamas-attack-intelligence.html"
  },
  {
    "text": "Advertisers Say They Do Not Plan to Return to X After Musk's Comments  —  Elon Musk, the owner of X, criticized advertisers with expletives on Wednesday at The New York Times's DealBook Summit.  —  Advertisers said on Thursday that they did not plan to reopen their wallets anytime soon with X … ",
    "url": "https://www.nytimes.com/2023/11/30/technology/elon-musk-dealbook-advertisers.html"
  }
]