[
  {
    "text": "Conservatives plot challenge against Johnson in internal Speaker elections  —  Hardline conservatives are plotting to challenge Speaker Mike Johnson (R-La.) for the gavel during Wednesday's internal House GOP elections, four sources familiar with the matter told The Hill.",
    "url": "https://thehill.com/homenews/house/4986503-gop-conservatives-challenge-speaker-johnson/"
  },
  {
    "text": "Mike Johnson challenger expected at House GOP speaker election … - House conservatives have yet to pick a candidate to challenge Johnson. … - Johnson survived a leadership challenge in May after passing an aid package for Ukraine on suspension. … - If the current projections hold … ",
    "url": "https://www.axios.com/2024/11/12/mike-johnson-house-speaker-vote"
  },
  {
    "text": "Russia Attempts to Collect Its Winnings  —  Russia has been engaged in a good deal of dick-wagging with Trump since the election.  —  After Trump won, Russia did not call to congratulate — at least as far as we know (though Viktor Orbán seems to be Trump's handler and he did).",
    "url": "https://www.emptywheel.net/2024/11/12/russia-attempts-to-collect-its-winnings/"
  },
  {
    "text": "Putin Isn't Fighting for Land in Ukraine  —  And Biden has mere weeks to give the Ukrainians the resources they need to fight.  —  russian drone and missile strikes on Ukrainian targets have increased in frequency in the week since the U.S. election, killing civilians and destroying another dam.",
    "url": "https://www.theatlantic.com/international/archive/2024/11/biden-trump-ukraine/680632/?gift=hVZeG3M9DnxL4CekrWGK3-1_K7E1RdOWOBSJN46wpFA&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Trump picks Kristi Noem to serve as his Homeland Security secretary  —  President-elect Donald Trump has selected South Dakota Gov. Kristi Noem as his next secretary of the Department of Homeland Security, according to two people familiar with the selection.",
    "url": "https://www.cnn.com/2024/11/12/politics/kristi-noem-homeland-security-secretary/"
  },
  {
    "text": "Trump Cabinet Picks So Far Decried as ‘Nightmare Fuel’  —  Progressive advocates voiced alarm Monday over U.S. President-elect Donald Trump's initial leadership picks—including a border czar who oversaw the separation of migrant families during the Republican's first term … ",
    "url": "https://www.commondreams.org/news/trump-cabinet-picks"
  },
  {
    "text": "Trump Draft Executive Order Would Create Board to Purge Generals  —  The panel could upend the military review process and raise concerns about the politicization of the military  —  WASHINGTON—The Trump transition team is considering a draft executive order that establishes a “warrior board” … ",
    "url": "https://www.wsj.com/politics/national-security/trump-draft-executive-order-would-create-board-to-purge-generals-7ebaa606?st=Phr48B&reflink=article_copyURL_share"
  },
  {
    "text": "Rubio news triggers MAGA backlash  —  Some Trump diehards are holding out hope for Ric Grenell for the top foreign policy post.  —  Shortly after news leaked that Donald Trump was expected to name Sen. Marco Rubio as his secretary of state, some of the most MAGA-minded online warriors rushed … ",
    "url": "https://www.politico.com/news/2024/11/12/rubio-news-triggers-maga-backlash-00189024"
  },
  {
    "text": "‘Extraordinary circumstances’: NY judge in Trump case pauses all court deadlines, sentencing  —  The 34 convictions could have placed President-elect Donald Trump in prison for up to 4 years  —  The Manhattan judge overseeing President-elect Donald Trump's trial agreed to grant a stay … ",
    "url": "https://www.foxnews.com/politics/trumps-new-york-convictions-ruling-issued"
  },
  {
    "text": "No Trump bump: MSNBC hemorrhaging viewers since Election Day, sheds more than half of primetime audience  —  'It's a stale product no one will want to listen to going forward,' Curtis Houck says  —  MSNBC's reliably liberal audience has tuned out the anti-Trump network since Election … ",
    "url": "https://www.foxnews.com/media/msnbc-hemorrhaging-viewers-since-election-day-sheds-more-than-half-of-primetime-audience"
  },
  {
    "text": "Trump expected to try to halt TikTok ban, allies say  —  The president-elect promised to ‘save’ the social media app, which faces a deadline early next year to find a non-China-based owner.  —  President-elect Donald Trump is expected to try to halt a potential U.S. ban of TikTok next year … ",
    "url": "https://www.washingtonpost.com/business/2024/11/12/trump-tiktok-ban-sale/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzMxMzg3NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzMyNzY5OTk5LCJpYXQiOjE3MzEzODc2MDAsImp0aSI6IjBhNjM5Y2Y2LTZiNGEtNGUxYy05ODViLWE3ODIxYThkZjk1ZiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9idXNpbmVzcy8yMDI0LzExLzEyL3RydW1wLXRpa3Rvay1iYW4tc2FsZS8ifQ.B2J5DrxizzWKBOHvs2_RS81jrI7m9P44kHiRfTL9rWU"
  },
  {
    "text": "“Babydog” banned: Jim Justice's bulldog can't visit Senate floor … - Justice, the current West Virginia governor, is in Washington for orientation alongside his fellow incoming senators.  — He asked Tuesday if Babydog could join him on the Senate floor and was told no by staff, the sources said.",
    "url": "https://www.axios.com/2024/11/12/babydog-jim-justice-senate-floor"
  },
  {
    "text": "What the numbers actually say about the 2024 election  —  In what will likely be the narrowest margin of victory since 2000, Trump probably benefitted from who stayed home.  —  We remain in the post-election period when consultants and politicians try their best to frame the results … ",
    "url": "https://www.washingtonpost.com/politics/2024/11/12/what-numbers-actually-say-about-2024-election/"
  },
  {
    "text": "Justice Samuel Alito Plans to Remain on Supreme Court  —  Some Republicans suggest the veteran jurist could step down to let Trump appoint a younger conservative  —  WASHINGTON—Justice Samuel Alito has no plans to step down from the Supreme Court, people close to the justice said … ",
    "url": "https://www.wsj.com/us-news/law/justice-samuel-alito-plans-to-remain-on-supreme-court-f14aac9e?st=nuc6Zo"
  },
  {
    "text": "Will the American project survive the anger of white men?  —  At key moments throughout US history, white male anger has been privileged over national security, progress or basic welfare  —  A friend recently asked: “Do you think the United States will survive the anger of white men?”",
    "url": "https://www.theguardian.com/commentisfree/2024/nov/12/trump-white-men-anger-american-history"
  },
  {
    "text": "The Two Donald Trumps  —  The central contradiction of Donald Trump's reelection is this: He owes his victory to the fact that millions of voters appear to have seen him as the stability candidate who would usher in a return to pre-COVID normalcy.  But he has put forward a second-term agenda … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/11/trump-voters-stability-chaos/680635/"
  },
  {
    "text": "Trump picks former Arkansas Gov. Mike Huckabee to be ambassador to Israel  —  President-elect Donald Trump will nominate former Arkansas Gov. Mike Huckabee as ambassador to Israel, Trump announced Tuesday.  Huckabee is a staunch defender of Israel and his intended nomination comes … ",
    "url": "https://apnews.com/article/trump-transition-white-house-staff-huckabee-f51121db5b18814bbab014e872c2a736"
  },
  {
    "text": "Melania Trump declines to meet with Jill Biden at White House, citing Mar-a-Lago raid: source  —  Melania Trump declined an offer to head to the White House Wednesday and meet with Jill Biden, citing the Biden administration's past raid on Mar-a-Lago as part of the federal government's investigation into classified documents.",
    "url": "https://nypost.com/2024/11/11/us-news/melania-trump-declines-to-meet-with-jill-biden-at-white-house-citing-mar-a-lago-raid-source/"
  },
  {
    "text": "Federal judge blocks Louisiana law that requires classrooms to display Ten Commandments  —  A new Louisiana law that requires the Ten Commandments to be displayed in every public classroom by Jan. 1 has been temporarily blocked after a federal judge granted a preliminary injunction on Tuesday.",
    "url": "https://apnews.com/article/ten-commandments-law-blocked-public-schools-louisiana-87b3dde94e583fdbb9ecb26db42b0206"
  },
  {
    "text": "Trump considering former Rep. Chris Stewart for DNI … - Trump reportedly dumped Stewart after learning the Utahn had criticized him as “our Mussolini” in 2016. … - A Trump transition spokesperson did not immediately respond to a request for comment.",
    "url": "https://www.axios.com/2024/11/12/trump-chris-stewart-director-national-intelligence"
  },
  {
    "text": "Pentagon secrets leaker Jack Teixeira sentenced to 15 years in prison by a federal judge  —  A federal judge on Tuesday sentenced a Massachusetts Air National Guard member to 15 years in prison after he pleaded guilty to leaking highly classified military documents about the war in Ukraine.",
    "url": "https://apnews.com/article/jack-teixeira-pentagon-leak-sentence-e67e18f310101b2f1c894ca1b550a3eb"
  },
  {
    "text": "John Paulson Drops Out of Running to Become Trump Treasury Secretary  —  Investor says his ‘complex financial obligations’ would prevent him from joining administration  —  Veteran investor John Paulson is dropping out of the running to become President-elect Donald Trump's Treasury secretary … ",
    "url": "https://www.wsj.com/politics/elections/john-paulson-treasury-secretary-trump-cabinet-f18b24e0?st=krLXPL&reflink=article_copyURL_share"
  },
  {
    "text": "Kamala Harris Did Listen To Working-Class Voters.  They Didn't Listen To Trump.  —  Plus, the shocking New Jersey result, and the connection between the election and “The Big Lebowski” — all in the November 12, 2024 newsletter.  —  One week later and the Democratic Party's self-flagellation continues.",
    "url": "https://washingtonmonthly.com/2024/11/12/kamala-harris-did-listen-to-working-class-voters-they-didnt-listen-to-trump/"
  },
  {
    "text": "Hispanic groups challenge data on Trump's Latino inroads … - In Michigan, Trump won 58% of Latino voters compared to just 39% for Harris, according to the Edison poll. … - In San Diego's eighth council district, which is roughly 75% Latino, Trump got 40% of the vote, local election analyst Mason Herron points out.",
    "url": "https://www.axios.com/2024/11/12/trump-latino-voters-unidos-us"
  },
  {
    "text": "‘He has to deliver’: Trump's dilemma on how far to go with promised pardons for January 6 rioters  —  It was an uncharacteristically warm November night in the nation's capital Wednesday, when a few dozen people gathered on a street corner outside the city's biggest jail.",
    "url": "https://www.cnn.com/2024/11/12/politics/trump-january-6-rioters-pardons/"
  },
  {
    "text": "WATCH: Oprah Gets Cornered by Reporter and Asked About That Million Dollars From Kamala (Updated)  —  Update:  —  Harpo, Oprah's production company, has now issued a statement saying, “The campaign paid for the production costs of ‘Unite for America,’ a live-streaming event … ",
    "url": "https://redstate.com/nick-arama/2024/11/11/oprah-remarks-on-kamala-town-hall-n2181856"
  },
  {
    "text": "Democrat Ruben Gallego wins Arizona US Senate race against Republican Kari Lake  —  Democrat Ruben Gallego has been elected Arizona's first Latino U.S. senator, defeating Republican Kari Lake and preventing Republicans from further padding their Senate majority.",
    "url": "https://apnews.com/article/arizona-senate-ruben-gallego-kari-lake-ea364326c93f9a8a32b7b9ca7ca696d4"
  },
  {
    "text": "Donald Trump Jr. Is Joining a Venture Capital Firm  —  The firm, 1789 Capital, invests in products and companies aimed at conservative audiences.  —  The eldest son of President-elect Donald J. Trump will not be a member of his father's administration — he is joining a venture capital firm.",
    "url": "https://www.nytimes.com/2024/11/11/us/donald-trump-jr-firm.html"
  },
  {
    "text": "State Department: Israel not in violation of US law on humanitarian aid to Gaza  —  The State Department on Tuesday said that Israel is not in violation of U.S. law related to the delivery and access of humanitarian assistance to the Gaza Strip, despite pushback from aid groups and the United Nations.",
    "url": "https://thehill.com/policy/international/4986478-us-israel-law-gaza-aid/"
  },
  {
    "text": "The End of American Exceptionalism  —  Trump's Reelection Will Redefine U.S. Power  —  The only thing uncontroversial about Donald Trump is how he won his second term.  Despite polls showing a statistical dead heat and fears of a long, drawn-out wait for election results, Trump was declared the winner early last Wednesday morning.",
    "url": "https://www.foreignaffairs.com/united-states/end-american-exceptionalism"
  }
]