[
  {
    "text": "Hillary Clinton: I've Debated Trump and Biden.  Here's What I'm Watching For.  —  Last week, I had the time of my life at the Tony Awards introducing a song from “Suffs,” the Broadway musical I co-produced about the suffragists who won women the right to vote.",
    "url": "https://www.nytimes.com/2024/06/25/opinion/hillary-clinton-trump-biden-debate.html"
  },
  {
    "text": "Trump's VP announcement could come as early as this week  —  Four sources told NBC News that the campaign is considering revealing Trump's running mate this week, possibly before his debate with Biden on Thursday.  —  Former President Donald Trump could announce his vice presidential pick … ",
    "url": "https://www.nbcnews.com/politics/2024-election/trump-considering-announcing-vp-pick-this-week-debate-rcna158827"
  },
  {
    "text": "The Nuclear Weapons Document Trump Stashed under Bubble Wrap and a Christmas Pillow  —  As noted, Jack Smith has filed his response to Trump's bid to throw out his stolen document indictment because the order of certain boxes was not retained.  —  A key part of Smith's response argues … ",
    "url": "https://www.emptywheel.net/2024/06/25/the-nuclear-weapons-document-trump-stashed-under-bubble-wrap-and-a-christmas-pillow/"
  },
  {
    "text": "Newly released photos from FBI's Mar-a-Lago search show Trump keepsakes alongside sensitive records  —  Washington — Newly revealed photographs taken by the FBI during its August 2022 search of former President Donald Trump's South Florida resort shed further light on how the former president kept keepsakes … ",
    "url": "https://www.cbsnews.com/news/newly-released-photos-fbi-mar-a-lago-search-show-trump-boxes-keepsakes-alongside-sensitive-records/"
  },
  {
    "text": "Trump expressed concern that returning classified docs after subpoena could result in criminal charges, according to sealed notes  —  Judge Aileen Cannon is considering tossing out the notes as evidence.  —  This image contained in a court filing by the Department of Justice on Aug. 30 … ",
    "url": "https://abcnews.go.com/US/trump-expressed-concern-returning-classified-docs-after-subpoena/story?id=111383032"
  },
  {
    "text": "Trump Could Actually Lose Florida.  Here's Why.  —  After two years of Governor Ron DeSantis pushing his extremist agenda, there's a case to be made that voters have had enough of the Republican Party's obsession with culture wars.  —  The Florida Democratic Party insists the state is in play in November … ",
    "url": "https://www.bloomberg.com/opinion/articles/2024-06-25/florida-democrats-think-biden-can-win-the-state-in-november"
  },
  {
    "text": "AJC Poll: Trump leads Biden in Georgia ahead of first debate  —  Sharp warning signs emerge in the state for both candidates.  —  Former President Donald Trump holds a slight lead over President Joe Biden in Georgia in an Atlanta Journal-Constitution poll released Tuesday ahead of an Atlanta debate … ",
    "url": "https://www.ajc.com/politics/ajc-poll-trump-leads-biden-in-georgia-ahead-of-first-debate/2INZ7K3PNFCGNHF7N5SFP2HF4A/"
  },
  {
    "text": "Scoop: 16 Nobel economists see a Trump inflation bomb … - “While each of us has different views on the particulars of various economic policies, we all agree that Joe Biden's economic agenda is vastly superior to Donald Trump,” the 16 economists write in a letter, first obtained by Axios.",
    "url": "https://www.axios.com/2024/06/25/nobel-prize-winners-biden-economy-trump-inflation"
  },
  {
    "text": "Donald Trump May ‘Reignite’ Inflation, Nobel Prize-Winning Economists Warn  —  A coalition of Nobel Prize-winning economists has warned about inflation if former President  —  wins the presidential election.  —  President  —  and Trump are set to face off in the November election, and inflation remains a key issue in the race.",
    "url": "https://www.newsweek.com/donald-trump-inflation-nobel-economists-warning-1917046"
  },
  {
    "text": "Donald Trump hush money gag on witnesses and jurors lifted, but prosecutors remain protected  —  Former President Donald Trump was freed on Tuesday from gag order restrictions that protected witnesses and jurors in his hush money case, although prosecutors and the family members … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/06/25/trump-hush-money-gag-order-lifted/74207314007/"
  },
  {
    "text": "Israeli Military Must Draft Ultra-Orthodox Jews, Supreme Court Rules  —  The court ruled there was no legal justification for the ultra-Orthodox exemption from service, a decision that threatened to split Prime Minister Benjamin Netanyahu's wartime government.",
    "url": "https://www.nytimes.com/2024/06/25/world/middleeast/israel-military-ultra-orthodox-jews-supreme-court.html"
  },
  {
    "text": "Why Jamaal Bowman's New York primary is huge for pro-Israel groups  —  An AIPAC-aligned super PAC and others have spent increasingly huge sums of money in high-profile Democratic primaries.  Their record is mixed, but a Bowman defeat would be their biggest win yet.",
    "url": "https://www.washingtonpost.com/politics/2024/06/25/why-jamaal-bowmans-new-york-primary-is-huge-pro-israel-groups/"
  },
  {
    "text": "Infant mortality rate rose 8% in wake of Texas abortion ban, study shows  —  In the wake of Texas' abortion ban, the state's infant death rate increased and more died of birth defects, a study published Monday shows.  —  The analysis out of Johns Hopkins University is the latest research … ",
    "url": "https://apnews.com/article/abortion-texas-infant-mortality-birth-defects-b055ac35cdbc9ec13f400b4c3e1056e7"
  },
  {
    "text": "Conservative US lawmakers are pushing for an end to no-fault divorce  —  Republicans in Louisiana, Oklahoma, Nebraska and Texas have discussed eliminating or restricting such cases  —  Some prominent conservative lawmakers and commentators are advocating for ending no-fault divorce … ",
    "url": "https://www.theguardian.com/us-news/article/2024/jun/25/republicans-no-fault-divorce"
  },
  {
    "text": "Ethics investigation adds to troubles for GOP's Ronny Jackson  —  Rep. Ronny Jackson didn't need another controversy.  The Texas Republican is nevertheless facing an advancing investigation from the House Ethics Committee.  —  During his relatively brief tenure as a political figure … ",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/ethics-investigation-adds-troubles-gops-ronny-jackson-rcna158760"
  },
  {
    "text": "Oklahoma Supreme Court Says No to State Funding for a Religious Charter School  —  In a closely watched case, Oklahoma's highest court blocked what was set to become the nation's first religious charter school.  An appeal is likely.  —  The Oklahoma Supreme Court blocked on Tuesday … ",
    "url": "https://www.nytimes.com/2024/06/25/us/oklahoma-supreme-court-religious-charter-school.html"
  },
  {
    "text": "Biden expected to pardon veterans convicted under military law banning gay sex, officials say  —  President Joe Biden is expected to pardon US veterans who were convicted by the military over a 60-year period under a military law that banned gay sex, three US officials told CNN.",
    "url": "https://www.cnn.com/2024/06/25/politics/biden-expected-pardon-veterans-convicted-gay-sex-law"
  },
  {
    "text": "Conservatives win longtime Liberal stronghold Toronto-St. Paul's in shock byelection result  —  Stunning result raises questions about Prime Minister Justin Trudeau's future  —  Conservative candidate Don Stewart has won the longtime federal Liberal stronghold of Toronto-St. Paul's … ",
    "url": "https://www.cbc.ca/news/politics/byelection-polls-liberal-conservative-ballot-vote-1.7243748"
  },
  {
    "text": "Steve Bannon Prepares for Prison  —  Steve Bannon is taking his show on the road.  Convicted by a federal jury in 2022 for contempt of Congress, the right-wing agitator is set to spend four months in a Connecticut penitentiary starting July 1.  It's the latest act in the iconoclastic performance … ",
    "url": "https://time.com/6991472/steve-bannon-prison-trump/"
  },
  {
    "text": "Kenya's parliament burns as protesters object to new taxes.  Clashes spread and bodies are counted  —  (AP video shot by: Jackson Njehia and Idi Ali Juma)  —  Anti-tax protesters enter Kenya's parliament as clashes with police intensify, resulting in deaths",
    "url": "https://apnews.com/article/kenya-protests-finance-bill-33a20092285f1d663264f7b0d513e1da"
  },
  {
    "text": "Charlie Kirk once unified conservative youth for Trump.  Why are Republicans now turning on him?  —  Kirk's non-profit, Turning Point Action, is planning a $100m ‘chase the vote’ operation to help propel the ex-president to the White House, but his outsized influence is being subjected to scrutiny",
    "url": "https://www.theguardian.com/us-news/ng-interactive/2024/jun/25/charlie-kirk-turning-point-usa-chase-the-vote-trump"
  },
  {
    "text": "Depletion of major groundwater source threatens Great Plains farming  —  In the heart of the country, Great Plains farmers and ranchers produce a quarter of all U.S. crops and 40 percent of its beef.  But they rely on a resource that has been slowly drying up, water.",
    "url": "https://www.pbs.org/newshour/show/depletion-of-major-groundwater-source-threatens-great-plains-farming"
  },
  {
    "text": "House GOP passes on using funding bills to target Trump prosecutors — for now  —  House Republicans are bypassing a major tool they said they could use to target former President Donald Trump's prosecutors — at least for now.  Republicans on the House Appropriations Committee … ",
    "url": "https://www.politico.com/live-updates/2024/06/25/congress/gop-punts-on-trump-prosecutors-00164828"
  }
]