[
  {
    "text": "Chris Christie plays down risk to Republicans if Trump loses primary but won't leave the race  —  He argued “the public en masse will begin to ignore” the former president  —  Republican presidential candidate and former Governor of New Jersey Chris Christie speaks at the Hudson Institute, on Nov. 15, 2023, in Washington, D.C.",
    "url": "https://abcnews.go.com/Politics/chris-christie-plays-risk-republicans-trump-loses-primary/story?id=105156248"
  },
  {
    "text": "To Beat Trump, Nikki Haley Is Trying to Speak to All Sides of a Fractured G.O.P.  —  Her campaign will test what political strategists and observers of her rise in politics have said is among her greatest political skills: an ability to massage her message to the moment.",
    "url": "https://www.nytimes.com/2023/11/26/us/politics/haley-trump-issues-2024.html"
  },
  {
    "text": "Christie says he plans to stay in GOP race through convention  —  Former New Jersey Gov. Chris Christie said he plans to stay in the Republican primary race through next summer's nominating convention, dismissing a recent CNN poll that shows him trailing former President Donald Trump … ",
    "url": "https://www.cnn.com/2023/11/26/politics/chris-christie-republican-2024-haley-trump-cnntv/"
  },
  {
    "text": "Trump Shows Off at Palmetto Bowl Football Faceoff on Nikki Haley's Home Turf to Mixed Reception  —  'You lost.  You're guilty.  Welcome to Columbia, Donald,' flashed two billboards that greeted him, sponsored by ‘vermin’  —  Former President Donald Trump came out to watch … ",
    "url": "https://themessenger.com/politics/trump-shows-off-at-palmetto-bowl-football-faceoff-on-nikki-haleys-home-turf-to-mixed-reception"
  },
  {
    "text": "A Troubling Trump Pardon and a Link to the Kushners  —  A commutation for a drug smuggler named Jonathan Braun had broader implications than previously known.  It puts new focus on how Donald Trump would use his clemency powers in a second term.  —  Even amid the uproar … ",
    "url": "https://www.nytimes.com/2023/11/26/us/politics/trump-pardon-braun.html"
  },
  {
    "text": "Trump's Pardoning of a Loan Shark Derailed a Federal Investigation: Report  —  The former president undermined negotiations between Jonathan Braun and prosecutors who hoped Braun would testify against other predatory lenders in exchange for his release",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-pardon-loan-shark-jonathan-braun-1234897002/"
  },
  {
    "text": "Romney says any Democrat would be ‘an upgrade’ over Trump in 2024  —  Sen. Mitt Romney (R-Utah) signaled that nearly any candidate in the 2024 field, of either party, would be an “upgrade” over another term for former President Trump.  —  “I'd be happy to support virtually any one of the Republicans … ",
    "url": "https://thehill.com/homenews/senate/4327061-romney-democrat-upgrade-over-trump-in-2024/"
  },
  {
    "text": "Turner says House passage of Ukraine, Israel aid package unlikely before end of year  —  Rep. Mike Turner (R-Ohio), the chairman of the House Intelligence Committee, predicted Sunday that approval of an aid package to Ukraine and Israel is unlikely before the end of the year.",
    "url": "https://thehill.com/homenews/house/4327893-turner-says-house-passage-of-ukraine-israel-aid-package-unlikely-before-end-of-year/"
  },
  {
    "text": "A doctor tried to renew his passport.  Now he's no longer a citizen.  —  The Northern Virginia doctor was born in D.C. and given a U.S. birth certificate.  At 61, he learned his citizenship was granted by mistake.  —  Siavash Sobhani is stateless.  —  The Northern Virginia doctor knows at least that much about his situation.",
    "url": "https://www.washingtonpost.com/dc-md-va/2023/11/25/virginia-doctor-passport-citizenship-nightmare/"
  },
  {
    "text": "What we actually know about aliens, according to science  —  GREEN BANK, W.Va. — It came from space, hurtling at tremendous speed: a mystery object, reddish, rocky, shaped like a cigar.  Its velocity was so extreme it had to have come from somewhere far away, in the interstellar realm.",
    "url": "https://www.washingtonpost.com/science/2023/11/25/aliens-uaps-scientific-evidence/"
  },
  {
    "text": "THE DANGER OF NOT CONFRONTING TRUMP  —  I believe we must question and confront Trump for democracy, for the rights of immigrants and, simply, for good journalism.  —  Due to the strong criticisms after Univision aired an interview with Donald Trump on Nov. 9 -that put in doubt the independence … ",
    "url": "https://jorgeramos.com/en/the-danger-of-not-confronting-trump-2/"
  },
  {
    "text": "Santos lashes out at colleagues as he stares down expulsion  —  Rep. George Santos (R-N.Y.) said Friday he won't resign from Congress but acknowledged he will likely be expelled as he lobbed salacious accusations at colleagues and called the chair of the Ethics Committee a “p***y”.",
    "url": "https://www.axios.com/2023/11/25/santos-lashes-out-expulsion-vote"
  },
  {
    "text": "Members of Congress Head for the Exits, Many Citing Dysfunction  —  More than three dozen incumbents have announced they will not seek re-election next year.  Some are running for other offices, while others intend to leave Congress altogether.  —  Eleven are running for the Senate.",
    "url": "https://www.nytimes.com/2023/11/26/us/politics/congress-retirement-republicans-democrats.html"
  },
  {
    "text": "At Meta, Millions of Underage Users Were an ‘Open Secret,’ States Say  —  Meta “routinely documented” children under 13 on Instagram and “unlawfully” collected their data, according to a newly unsealed complaint.  —  Meta has received more than 1.1 million reports of users under the age … ",
    "url": "https://www.nytimes.com/2023/11/25/technology/instagram-meta-children-privacy.html"
  },
  {
    "text": "Gaza: Findings on October 17 al-Ahli Hospital Explosion  —  Evidence Points to Misfired Rocket but Full Investigation Needed  —  (Jerusalem) - The explosion that killed and injured many civilians at al-Ahli Arab Hospital in Gaza on October 17, 2023, resulted from an apparent rocket-propelled munition … ",
    "url": "https://www.hrw.org/news/2023/11/26/gaza-findings-october-17-al-ahli-hospital-explosion"
  }
]