[
  {
    "text": "Vance appears at event hosted by hard-right Christian nationalist  —  The live event was hosted by Lance Wallnau, who has blended hard-right politics with Christian supremacy and who has demonized Kamala Harris.  —  MONROEVILLE, Pa. — Republican vice-presidential candidate JD Vance appeared Saturday … ",
    "url": "https://www.washingtonpost.com/elections/2024/09/28/jd-vance-christian-nationalism-lance-wallnau/"
  },
  {
    "text": "Vance not allowed to campaign in Pittsburgh culinary landmark — despite Harris event at same restaurant chain  —  The vice presidential nominee met supporters outside instead after the restaurant said it wasn't told in advance about the campaign stop  —  Vice presidential candidate … ",
    "url": "https://www.foxnews.com/politics/vance-not-allowed-campaign-pittsburgh-culinary-landmark-despite-harris-event-same-restaurant-chain"
  },
  {
    "text": "JD Vance suffers latest campaign fail after being denied entry into restaurant  —  The incident occurred after the Republican vice presidential nominee turned up to Primanti Bros in North Versailles, Pennsylvania, and was denied entry  —  Your support helps us to tell the story",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/jd-vance-campaign-fail-restaurant-pennslvania-b2620651.html"
  },
  {
    "text": "Harris trolls Trump on second debate during Georgia-Alabama game  —  The campaign aimed to reach viewers in the key battleground state of Georgia.  —  Kamala Harris doesn't get to decide if Donald Trump debates her a second time.  But she will attempt to extract a cost if he won't.",
    "url": "https://www.washingtonpost.com/politics/2024/09/28/harris-trump-debate-alabama-georgia-football/"
  },
  {
    "text": "Tim Walz Expected To Bring Receipts About JD Vance's Anti-Abortion Stances To VP Debate  —  Walz's Republican opponent in the 2022 Minnesota governor's race thinks the former coach will be “loud and clear” on abortion.  —  On a different debate stage in 2022, then Minnesota gubernatorial … ",
    "url": "https://www.vanityfair.com/news/story/tim-walz-jd-vance-anti-abortion-stances-vp-debate"
  },
  {
    "text": "Statement from President Joe Biden on the Death of Hassan Nasrallah  —  Hassan Nasrallah and the terrorist group he led, Hezbollah, were responsible for killing hundreds of Americans over a four-decade reign of terror.  His death from an Israeli airstrike is a measure of justice for his many victims … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/09/28/statement-from-president-joe-biden-on-the-death-of-hassan-nasrallah/"
  },
  {
    "text": "Florida congressional candidate charged with threatening to kill primary opponent  —  The Justice Department revealed an indictment Friday that said William Robert Braddock III, of St. Petersburg, Fla., had threatened to kill his opponent in a 2022 primary.  —  The Justice Department revealed … ",
    "url": "https://www.nbcnews.com/politics/justice-department/florida-congressional-candidate-charged-threatening-kill-primary-oppon-rcna173144"
  },
  {
    "text": "The Republican Freak Show  —  Like the man who leads it, the GOP is not just incidentally grotesque.  It is grotesque at its core.  —  the gop is a moral freak show, and freak shows attract freaks.  Which is why Mark Robinson fits in so well in today's Republican Party.",
    "url": "https://www.theatlantic.com/politics/archive/2024/09/mark-robinson-rfk-jr-trump/680064/?gift=MEpCTQExoFIUxpSYhsgq4g48z3vrajfEgcP627QB2L8&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Federal Judge Strikes Down Key Provision of Texas' Omnibus Voter Suppression Law  —  A federal judge struck down a key provision of Texas' 2021 omnibus voter suppression legislation, Senate Bill 1, after finding that certain aspects of the statute impose unconstitutional and unlawful burdens on marginalized groups of voters.",
    "url": "https://www.democracydocket.com/news-alerts/federal-judge-strikes-down-key-provision-of-texas-omnibus-voter-suppression-law/"
  },
  {
    "text": "Trump falsely attacks Harris as ‘mentally impaired’ and ‘mentally disabled,’ prompting criticism  —  The remarks drew a rebuke from a group that advocates for people with disabilities.  —  Republican presidential nominee Donald Trump criticized Vice President Kamala Harris's mental capacity Saturday … ",
    "url": "https://www.washingtonpost.com/politics/2024/09/28/trump-harris-attacks-mentally-impaired-criticism/"
  },
  {
    "text": "Trump's $100,000 Watches: A Gateway for Illicit Financial Flows?  —  As the U.S. election draws near, Donald Trump's introduction of a “luxury” watch priced at $100,000 raises more than eyebrows—it sparks serious concerns about potential loopholes for financial misconduct.  Trump's grifts these days are endless.",
    "url": "https://www.meidasplus.com/p/trumps-100000-watches-a-gateway-for"
  },
  {
    "text": "Justice Dept. sues Alabama over program aimed at removing voters  —  Federal prosecutors said the state's efforts to strike more than 3,200 people from voting rolls was done too close to November's election.  —  The Justice Department on Friday sued the state of Alabama over a program … ",
    "url": "https://www.washingtonpost.com/national-security/2024/09/27/justice-department-alabama-lawsuit-voting/"
  },
  {
    "text": "We need to talk about Jared Kushner's sketchy Saudi-backed fund  —  Why is Donald Trump's son-in-law raking in millions in fees from investors but not delivering them money?  —  An investigation led by Senate Finance Committee Chairman Ron Wyden, D-Ore., has discovered what he sees … ",
    "url": "https://www.msnbc.com/opinion/msnbc-opinion/jared-kushner-private-equity-firm-affinity-senate-investigation-rcna172758"
  },
  {
    "text": "Michigan man charged with assaulting postal carrier over Kamala Harris flyer  —  (CBS DETROIT) — A 61-year-old Farmington Hills man faces multiple criminal charges after he allegedly assaulted a female postal carrier Thursday evening upon receiving a flyer in the mail featuring Vice President Kamala Harris.",
    "url": "https://www.cbsnews.com/detroit/news/postal-carrier-assault-kamala-harris-flyer/"
  },
  {
    "text": "Childless GOP Candidate Borrows Family for Weird Photo Shoot  —  FAKE FAMILY VALUES  —  Anti-abortion Republican Derrick Anderson, who is running for Virginia's seventh congressional district, appears to be trying to appeal to women using a bizarre tactic.",
    "url": "https://www.thedailybeast.com/childless-gop-candidate-derrick-anderson-borrows-family-for-weird-photo-shoot"
  },
  {
    "text": "5 takeaways from this week's Trump-Harris polls  —  The polls are coming thick and fast with less than six weeks to go before Election Day.  —  Vice President Harris has seen broadly favorable polling results this week — with some caveats.  —  Harris now leads former President Trump … ",
    "url": "https://thehill.com/homenews/campaign/4904478-vice-president-harris-polls/"
  },
  {
    "text": "Young women grow less religious than young men … - The exodus of young women can be seen in particular in white evangelical congregations, which are becoming smaller and more male.  — The faith divide also reflects a political divide: polls show young women moving left much faster than young men.",
    "url": "https://www.axios.com/2024/09/28/religion-poll-gen-z-men-women-gap"
  },
  {
    "text": "Rising egg prices linked to bird flu's impact on supply chain  —  The rising price of eggs in the last year has been linked to bird's flu impact on the supply chain.  —  Eggs' price tag has gone up by 28.1 percent in the last 12 months, according to the Bureau of Labor Statistics.",
    "url": "https://thehill.com/business/4905382-bird-flu-eggs-prices/"
  },
  {
    "text": "Gubernatorial candidate Mark Robinson treated for burns received at appearance, campaign says  —  North Carolina Republican Lt. Gov. Mark Robinson received burns Friday night while attending a truck show as he was campaigning for governor, his campaign said.",
    "url": "https://apnews.com/article/north-carolina-mark-robinson-campaign-burns-00effaac25e35bd453eca7a03f497e94"
  },
  {
    "text": "Israel Strikes Lebanon Again After Killing Hezbollah Leader  —  The bombings late Saturday were the latest in a week of stepped up attacks.  A bombing on Friday assassinated Hassan Nasrallah, a stunning escalation in Israel's campaign against the Iranian-backed group.",
    "url": "https://www.nytimes.com/live/2024/09/28/world/israel-lebanon-hezbollah-hamas"
  }
]