[
  {
    "text": "Texas woman who sought court permission for abortion leaves state for the procedure, attorneys say  —  A pregnant Texas woman who sought court permission for an abortion in an unprecedented challenge to one of the most restrictive bans in the U.S. has left the state to obtain the procedure, her attorneys said Monday.",
    "url": "https://apnews.com/article/abortion-texas-ban-7d865cdfd75bdc6b2f4186f4d1e6e8bd"
  },
  {
    "text": "Texas Supreme Court Rules Against Woman Who Sought Court-Approved Abortion  —  Hours before the ruling, a group representing the woman, whose fetus received a fatal diagnosis, said she was leaving Texas for an abortion.  —  The Texas Supreme Court on Monday overturned a lower court order allowing … ",
    "url": "https://www.nytimes.com/2023/12/11/us/texas-abortion-kate-cox.html"
  },
  {
    "text": "Texas Supreme Court rules against woman at center of abortion battle  —  Kate Cox had already decided to go out of state for procedure after learning that carrying the pregnancy to term could jeopardize her future fertility  —  Kate Cox, a Dallas-area woman who petitioned a judge … ",
    "url": "https://www.washingtonpost.com/politics/2023/12/11/kate-cox-texas-abortion/"
  },
  {
    "text": "The Texas abortion case blows up the abortion ban rationale  —  Abortion rights activists, medical professionals and ordinary women warned the Supreme Court in advance of the Dobbs v. Jackson Women's Health Organization decision: Legislatures cannot dictate medical decisions without creating horrendous injustices and medical travesties.",
    "url": "https://www.washingtonpost.com/opinions/2023/12/11/abortion-ban-texas/"
  },
  {
    "text": "Special counsel reveals plans to use Trump's phone data at trial  —  Jack Smith indicated that he plans to call an expert witness who extracted and reviewed data copied from Trump's phone.  —  Special counsel Jack Smith has extracted data from the cell phone Donald Trump used while in the White House … ",
    "url": "https://www.politico.com/news/2023/12/11/special-counsel-trump-phone-data-trial-00131196"
  },
  {
    "text": "Special Counsel asks Supreme Court to immediately decide Trump immunity question  —  A federal judge had rejected former President Donald Trump's immunity claim over his prosecution in election interference case.  —  WASHINGTON — Special Counsel Jack Smith on Monday asked the Supreme Court … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/special-counsel-asks-supreme-court-immediately-decide-trump-immunity-q-rcna129088"
  },
  {
    "text": "Special Counsel Asks Supreme Court to Decide Whether Trump Is Immune From Prosecution  —  The request was unusual in two ways: Jack Smith asked the justices to rule before an appeals court acted, and he urged them to move with exceptional speed.  —  Jack Smith, the special counsel prosecuting … ",
    "url": "https://www.nytimes.com/2023/12/11/us/politics/trump-supreme-court-immunity-election-case.html"
  },
  {
    "text": "Republican senator says Ukraine should cede land and cut a deal with Putin to end the war  —  Sen. JD Vance, on the eve of Ukrainian President Volodymyr Zelenskyy's trip to Capitol Hill, dismissed fears that Russia would keep making advances if it's victorious in Ukraine.",
    "url": "https://www.nbcnews.com/politics/congress/jd-vance-says-ukraine-cede-land-cut-deal-putin-end-war-rcna129195"
  },
  {
    "text": "Michigan Gov. Gretchen Whitmer's latest move on abortion highlights Democrats' 2024 push  —  In an interview with NBC News before repealing a remaining state restriction on abortion, Whitmer said, “When you stay in the fight, you can win.”  —  Michigan Gov. Gretchen Whitmer on Monday repealed … ",
    "url": "https://www.nbcnews.com/politics/politics-news/gretchen-whitmers-abortion-move-highlights-democrats-2024-push-rcna128930"
  },
  {
    "text": "CNN Polls: Trump leads Biden in Michigan and Georgia as broad majorities hold negative views of the current president  —  Former President Donald Trump has the upper hand over President Joe Biden in two critical battleground states - Michigan and Georgia - with broad majorities … ",
    "url": "https://www.cnn.com/2023/12/11/politics/cnn-polls-trump-biden-michigan-georgia/"
  },
  {
    "text": "Iowa GOP debate in peril with Nikki Haley noncommittal  —  The final GOP presidential debate before the Iowa caucuses may not happen, as former UN Ambassador Nikki Haley hasn't committed to participating and Vivek Ramaswamy and former Gov. Chris Christie aren't on pace to qualify.",
    "url": "https://www.axios.com/2023/12/12/iowa-debate-republican-nikki-haley-ron-desantis-trump"
  },
  {
    "text": "Giuliani's Defense Says $43 Million in Damages Would Be ‘Death Sentence’  —  The bizarre remark came in opening statements of a trial to determine how much he'll owe in damages to two Georgia poll workers.  —  On day one of Rudy Giuliani's trial to determine how much he'll owe a pair … ",
    "url": "https://www.thedailybeast.com/rudy-giulianis-defense-says-awarding-dollar43-million-in-damages-would-be-death-penalty"
  },
  {
    "text": "A deadly delivery highlights ‘falsified’ heat records at USPS  —  The Postal Service allegedly doctored heat training records of thousands of mail carriers.  One of them died on a blistering day in June.  —  Eugene Gates, a Dallas letter carrier for the Postal Service, died of heat exposure in June.",
    "url": "https://www.politico.com/news/2023/12/11/usps-major-heat-deaths-00128875"
  },
  {
    "text": "“Bombshell”: Does Harvard's President Also Have a Plagiarism Scandal?  Update: Billionaire donor demands Gay's firing  —  Isn't the anti-Semitism and hypocrisy scandal enough for Claudine Gay?  Harvard's board has gotten very quiet over the past week after its president's congressional testimony outraged practically everyone.",
    "url": "https://hotair.com/ed-morrissey/2023/12/11/bombshell-does-harvards-president-also-have-a-plagiarism-scandal-n598202"
  },
  {
    "text": "Project Veritas CEO Jumps Ship After Finding ‘Evidence of Past Illegality’  —  ANOTHER ONE BITES THE DUST  —  Hannah Giles, the CEO of conservative nonprofit Project Veritas, announced her resignation “effective immediately” on Monday, saying she'd unwittingly “stepped into an unsalvageable mess” upon taking the job earlier this year.",
    "url": "https://www.thedailybeast.com/project-veritas-ceo-hannah-giles-jumps-ship-after-finding-evidence-of-past-illegality"
  },
  {
    "text": "Scoop: House Freedom Caucus drama erupts over its next leader  —  An influential member of the House Freedom Caucus won't run for a leadership spot, citing a recommendation by the group's board that Rep. Bob Good (R-Va.) serve as its next chairman. … - “I ask that we consider how to best increase … ",
    "url": "https://www.axios.com/2023/12/12/house-freedom-caucus-leader-drama-bob-good"
  },
  {
    "text": "Dover Man Arrested and Charged with Threatening to Kill a Presidential Candidate  —  For Immediate Release  —  U.S. Attorney's Office, District of New Hampshire  —  CONCORD - A Dover man has been arrested and charged in connection with sending text messages that threatened a presidential candidate … ",
    "url": "https://www.justice.gov/usao-nh/pr/dover-man-arrested-and-charged-threatening-kill-presidential-candidate"
  },
  {
    "text": "House Takes Up Long-Building Debate Over Rival Surveillance Bills  —  The fight over privacy and national security, which has scrambled partisan lines, will come to a head with an unusual double vote on the floor.  —  A long-simmering debate over a powerful surveillance tool is coming to a head in Congress … ",
    "url": "https://www.nytimes.com/2023/12/11/us/politics/house-fisa-surveillance-bill.html"
  },
  {
    "text": "Exclusive: Former Mar-a-Lago employee-turned-witness repeatedly contacted by Trump and associates before documents charges  —  West Palm Beach, FL CNN  —  Three months after the FBI seized classified records from Mar-a-Lago last August, a longtime employee of Donald Trump's private club quit his job.",
    "url": "https://www.cnn.com/2023/12/11/politics/former-mar-a-lago-employee-special-counsel-trump/"
  },
  {
    "text": "House to Vote on Impeachment Probe Wednesday  —  Republicans argue it is an essential step in getting past what they call the Biden administration's ‘stonewalling’ of their impeachment probe  —  House Republicans are expected to schedule a floor vote on Wednesday to formally authorize … ",
    "url": "https://themessenger.com/politics/house-to-vote-on-impeachment-probe-wednesday"
  },
  {
    "text": "Trump as Dictator Is a Classic Case of Projection  —  Biden and his supporters try to excuse and deflect attention from their own authoritarian actions.  —  If you haven't heard, Donald Trump and his MAGA Republicans are planning a coup.  “A Trump dictatorship is increasingly inevitable … ",
    "url": "https://www.wsj.com/articles/trump-as-dictator-is-a-classic-case-of-projection-2024-election-biden-robert-kagan-a4bc86c7?mod=followamazon"
  }
]