[
  {
    "text": "GOP tax bill on track to add more than $2.5 trillion to U.S. deficit  —  The figure is expected to intensify a national debate over spending and tax levels as President Donald Trump tries to push the legislation through Congress.  —  The Republican tax proposal emerging in the House … ",
    "url": "https://www.washingtonpost.com/business/2025/05/15/gop-tax-deficit-bill/"
  },
  {
    "text": "At Supreme Court, a Once-Fringe Birthright Citizenship Theory Takes the Spotlight  —  Before the Trump presidency, there was broad consensus that the 14th Amendment established birthright citizenship for children born in the United States.  —  Shortly after the Supreme Court announced … ",
    "url": "https://www.nytimes.com/2025/05/14/us/politics/supreme-court-birthright-citizenship.html?unlocked_article_code=1.HE8.Q410.yK0QeKrZnUKh&smid=url-share"
  },
  {
    "text": "Another Reason Trump's Birthright Citizenship Order is Unlawful  —  On his first day in office, President Donald Trump issued Executive Order 14,160 (the EO), which denies birthright citizenship to any child born in the United States who does not have at least one parent who is a U.S. citizen or lawful permanent resident.",
    "url": "https://www.justsecurity.org/113422/birthright-citizenship-statute/"
  },
  {
    "text": "The Trump Administration Leaned on African Countries.  The Goal: Get Business for Elon Musk.  —  The State Department has intervened on behalf of Musk's satellite internet company in five developing nations.  In Gambia, U.S. diplomats have lobbied and browbeat at least seven government ministers … ",
    "url": "https://www.propublica.org/article/trump-musk-starlink-state-department-gambia-africa-pressure"
  },
  {
    "text": "Trump's sanctions on ICC prosecutor have halted tribunal's work  —  The International Criminal Court's chief prosecutor has lost access to his email, and his bank accounts have been frozen.  The Hague-based court's American staffers have been told that if they travel to the U.S. they risk arrest.",
    "url": "https://apnews.com/article/icc-trump-sanctions-karim-khan-court-a4b4c02751ab84c09718b1b95cbd5db3"
  },
  {
    "text": "The MAGA-World Rift Over Trump's Qatari Jet  —  As Air Force One glided into Doha today, it was easy to imagine President Donald Trump having a case of jet envy.  —  Hamad International Airport, in Qatar's capital, is sometimes home to the $400 million “palace in the sky,” a luxury liner that Trump is eyeing.",
    "url": "https://www.theatlantic.com/politics/archive/2025/05/trump-qatar-plane-reaction/682811/?gift=oL5KrnLzy2TX41fj2EidlRvfnjTqxi3koPhwx-5IRdg&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Walmart Plans to Raise Prices Because of Tariffs  —  Retailer has weathered the trade war but says the full impact of tariffs on consumers has yet to come  —  Higher prices are coming to Walmart's shelves.  —  The retailer said Thursday that it plans to raise prices this month and early this summer … ",
    "url": "https://www.wsj.com/business/retail/walmart-wmt-q1-earnings-report-stock-2026-b978bcf5?st=M91oNN"
  },
  {
    "text": "Trump Wants His Corruption to Be Public  —  Programming note at the jump: Tonight, The Bulwark will host an emergency briefing on the major changes to our nation's health care system that Trump and his Republican allies are trying to push forward this week.  Our own Jonathan Cohn … ",
    "url": "https://www.thebulwark.com/p/trump-wants-his-corruption-to-be-public-mob-boss-justice-department-qatar-plane-air-force-one"
  },
  {
    "text": "U.S. AG Pam Bondi Sold More than $1 Million in Trump Media Stock the Day Trump Announced Sweeping Tariffs  —  Attorney General Pam Bondi sold between $1 million and $5 million worth of shares of Trump Media the same day that President Donald Trump unveiled bruising new tariffs that caused … ",
    "url": "https://www.propublica.org/article/pam-bondi-trump-media-stock-tariffs"
  },
  {
    "text": "Wisconsin judge pleads not guilty to obstructing ICE arrest  —  Milwaukee County Judge Hannah Dugan entered her not-guilty plea two days after a federal grand jury returned an indictment.  —  MILWAUKEE — A Wisconsin judge pleaded not guilty Thursday to charges that she interfered with an immigration arrest.",
    "url": "https://www.washingtonpost.com/national-security/2025/05/15/wisconsin-judge-immigration-arrest-plea/"
  },
  {
    "text": "Denver airport air traffic control went out for 6 minutes on Monday, report says  —  Up to 20 pilots were unable to talk to controllers, Denver7 reports  —  Pilots flying into Denver International Airport on Monday couldn't communicate with air traffic controllers for about six minutes … ",
    "url": "https://www.denverpost.com/2025/05/15/denver-international-airport-air-traffic-control-outage-longmont/"
  },
  {
    "text": "Democrats rattled again by fresh claims that Biden aides hid his frailty  —  A new book and Biden's public appearances are potential distractions as the party seeks to focus on Trump.  —  A growing number of Democrats are publicly second-guessing their party's handling of the last election … ",
    "url": "https://www.washingtonpost.com/politics/2025/05/14/biden-democrats-age-mental-health-book/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ3MTk1MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ4NTc3NTk5LCJpYXQiOjE3NDcxOTUyMDAsImp0aSI6Ijc3NjQ4MjI2LTgyOGMtNGQxMi04NDUzLWNmZTc4MWZlZGZjOSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzA1LzE0L2JpZGVuLWRlbW9jcmF0cy1hZ2UtbWVudGFsLWhlYWx0aC1ib29rLyJ9.Kku3CtC6KCXiDEB6hfgQAil2j1Oj-4j2oFWij8Ox6sY&itid=gfta"
  },
  {
    "text": "Trump Administration Cancels Scores of Grants to Study Online Misinformation … Lisa K. Fazio, an associate professor at Vanderbilt University, whose federal grant to study how repetition of lies reinforced them was canceled.Houston Cofield for The New York Times",
    "url": "https://www.nytimes.com/2025/05/15/business/trump-online-misinformation-grants.html?unlocked_article_code=1.HU8.wE-z.z9MREZGGZqhG"
  },
  {
    "text": "Trump-Kushner Hotel Project in Serbia Hits a Snag: Alleged Forgery  —  Serbian authorities say an official admitted to forging a document allowing a protected site in Belgrade to be demolished and replaced with a Trump hotel.  —  The Trump family's $500 million luxury hotel project in Serbia … ",
    "url": "https://www.nytimes.com/2025/05/14/us/politics/trump-kushner-hotel-serbia.html?unlocked_article_code=1.HU8.0hDF.llqKSv_aGL-y"
  },
  {
    "text": "Russian National Charged with Smuggling Biological Material Into Boston  —  For Immediate Release  —  U.S. Attorney's Office, District of Massachusetts  —  BOSTON - A Russian national has been arrested and charged for allegedly attempting to smuggle clawed frog embryos and embryonic samples into the United States.",
    "url": "https://www.justice.gov/usao-ma/pr/russian-national-charged-smuggling-biological-material-boston"
  },
  {
    "text": "Top Sexual Assault Hotline Drops Resources After Trump Orders  —  Fearing funding cuts, the anti-sexual-violence organization RAINN barred referring callers to resources for L.G.B.T.Q. people, immigrants and other marginalized groups.  —  Fearing the loss of federal funding … ",
    "url": "https://www.nytimes.com/2025/05/15/well/rainn-dei-trump-executive-orders.html"
  },
  {
    "text": "Gabbard fires intel officials who oversaw memo contradicting White House claims on Venezuelan gang  —  Democratic lawmakers criticized the firings, suggesting they were punishment for providing information that didn't support the administration's agenda.  —  Director of National Intelligence … ",
    "url": "https://www.nbcnews.com/politics/national-security/gabbard-fires-intel-officials-oversaw-memo-contradicting-white-house-c-rcna206918"
  },
  {
    "text": "Top Iranian official says Tehran would forgo highly enriched uranium in nuclear deal with Trump  —  The comments from a member of the supreme leader's inner circle appear to be the clearest public statements yet on Iran's willingness to reach an agreement with the U.S.",
    "url": "https://www.nbcnews.com/news/us-news/iran-enriched-uranium-nuclear-deal-trump-rcna206833"
  },
  {
    "text": "US reportedly plans to slash bank rules imposed to prevent 2008-style crash  —  Watchdogs could cut capital rules as Trump's deregulation drive opens door to rollback of post-crisis protections  —  US watchdogs are reportedly planning to slash capital rules for banks designed … ",
    "url": "https://www.theguardian.com/business/2025/may/15/us-reportedly-plans-slash-bank-rules-imposed-prevent-2008-style-crash"
  },
  {
    "text": "El Chapo's family members cross US border in apparent deal with Trump administration  —  Ex-wife of imprisoned kingpin El Chapo among 17 family members entering through San Diego border crossing  —  Join Fox News for access to this content  —  Mexican officials said Wednesday … ",
    "url": "https://www.foxnews.com/politics/el-chapos-family-members-cross-us-border-apparent-deal-trump-administration"
  },
  {
    "text": "Exclusive: Musk took leased cars back so Tesla could use them as “robotaxis.”  Instead, Tesla sold them  —  Tesla last November ended an unusual policy that prohibited U.S. leasing customers from buying their cars at lease-end.  —  The policy started in 2019, when Tesla announced that customers … ",
    "url": "https://www.reuters.com/sustainability/boards-policy-regulation/musk-took-leased-cars-back-so-tesla-could-use-them-robotaxis-instead-tesla-sold-2025-05-15/"
  },
  {
    "text": "Inside Harvard's Discrimination Machine  —  The university has adopted race-conscious hiring policies, potentially in violation of civil rights law.  —  / Eye on the News / Education, Politics and Law  —  The Trump administration has escalated its battle with Harvard University … ",
    "url": "https://www.city-journal.org/article/harvard-university-discrimination-dei-hiring-trump"
  },
  {
    "text": "Americans are divided over DEI programs on college campuses, an AP-NORC poll finds  —  As President Donald Trump seeks to end diversity, equity and inclusion practices on college campuses, a new poll suggests that while the concept of DEI is divisive, some of the initiatives being affected … ",
    "url": "https://apnews.com/article/dei-race-higher-education-diversity-equity-inclusion-29e6d46c36e5eae6323551ca2f9c00ce"
  },
  {
    "text": "D.H.S. Requests 20,000 National Guard Members to Help With Immigration Crackdown  —  The Defense Department is reviewing the request.  If approved, one official said, it would be the first time National Guard troops were used to help enforce an immigration crackdown in the country.",
    "url": "https://www.nytimes.com/2025/05/15/us/politics/national-guard-immigration.html"
  },
  {
    "text": "Don Jr.'s Axel to Grind  —  An unflattering story about Donald Trump Jr. triggered a White House assault on Business Insider and parent company Axel Springer—and signaled just how far Trumpworld is willing to go to silence critical coverage.  —  When Business Insider published a story this week headlined … ",
    "url": "https://www.status.news/p/trump-jr-hunter-biden-business-insider-backlash"
  },
  {
    "text": "The white rural reckoning  —  This article is co-authored by Tom Schaller and Paul Waldman.  Their book “White Rural Rage: The Threat to American Democracy” will be released in paperback later this month.  Schaller is professor of political science at the University of Maryland-Baltimore County.",
    "url": "https://www.publicnotice.co/p/trump-white-rural-reckoning-waldman-schaller"
  },
  {
    "text": "Democracy's downward spiral leaves Starmer no leeway on immigration  —  Broken promises played midwife to Brexit and are capable of powering Reform — or a Conservative facsimile — into office  —  Roula Khalaf, Editor of the FT, selects her favourite stories in this weekly newsletter.",
    "url": "https://www.ft.com/content/3daf7366-fe7f-4b6b-9e23-652499082b34"
  },
  {
    "text": "Inside Trump's fixation on diplomatic nominees … As of this week, the panel has approved more than two dozen Trump nominees for senior State Department roles and foreign ambassadorships.  In doing so, Democrats say Republicans are violating long-standing committee traditions in order to satisfy Trump.",
    "url": "https://punchbowl.news/article/senate/trump-fixation-diplomatic-nominees/"
  },
  {
    "text": "She covered human rights for VOA in Azerbaijan.  Now she's in jail.  —  Ulviyya Ali reported for Voice of America for years.  Trump's moves to dismantle the U.S.-funded outlet may have put her at greater risk, activists say.  —  Ulviyya Ali took out her phone and rushed to write a letter asserting her innocence.",
    "url": "https://www.washingtonpost.com/world/2025/05/15/voice-of-america-journalist-arrested-azerbaijan/"
  },
  {
    "text": "The Road to Trump's Embrace of White South Africans  —  The Trump administration's hostile approach to South Africa was shaped by a convergence of factors.  —  White South Africans at a rally outside the United States Embassy in Pretoria in February.Joao Silva/The New York Times",
    "url": "https://www.nytimes.com/2025/05/14/us/politics/trump-south-africa-afrikaners.html"
  },
  {
    "text": "Supreme Court to Hear Trump's Bid to End Birthright Citizenship  —  Administration asks for power to implement president's reinterpretation of 14th Amendment after lower courts found it unconstitutional  —  WASHINGTON—President Trump's bid to abolish birthright citizenship reaches … ",
    "url": "https://www.wsj.com/us-news/law/supreme-court-birthright-citizenship-trump-dcea5bc8?st=tYMpLB&reflink=mobilewebshare_permalink"
  },
  {
    "text": "Dems aren't shying away from talking about 2028 presidential bids  —  The days of the shadow primary are giving way to a franker, more overt approach to the race for the White House.  —  Presidential contenders used to pretend they weren't running for president.  Not anymore.",
    "url": "https://www.politico.com/news/2025/05/15/democrats-2028-presidential-campaign-talk-00350545"
  },
  {
    "text": "Fox anchor Bret Baier said media should “100%” scrutinize Trump's family the same as Biden's.  He hasn't come close.  —  Despite advocating for equal scrutiny of presidents' family corruption, Baier's Special Report has hardly reported on alleged influence peddling by Donald Trump's sons … ",
    "url": "https://www.mediamatters.org/bret-baier/fox-anchor-bret-baier-said-media-should-100-scrutinize-trumps-family-same-bidens-he?_bhlid=b3413edc3493f292637eef004fc4518a8d38bd7e"
  }
]