[
  {
    "text": "Top House Republican Wants Help From Democrats to Pick a Speaker  — House Armed Services Chair Says GOP unable to elect speaker  — Calls on Democratic leader to offer conditions to aid GOP  —  A powerful Republican is looking to Democrats to help resolve his party's impasse over naming a speaker of the House.",
    "url": "https://www.bloomberg.com/news/articles/2023-10-12/democrats-to-the-rescue-some-republicans-see-it-as-solution-to-speaker-impasse"
  },
  {
    "text": "Chaos persists as ‘fractured’ House GOP frets about when — or if — it will elect a speaker  —  Some Republicans worry they might never get the votes without some Democratic help.  Others say it's time to empower Speaker Pro Tempore Patrick McHenry to conduct business.",
    "url": "https://www.nbcnews.com/politics/congress/chaos-house-republicans-speaker-rcna119967"
  },
  {
    "text": "10/12/23 ☀️ Punchbowl News AM … But worse.  Maybe way worse. … Only the stakes this time are higher, the time frame is shorter, the opposition is larger and the House Republican Conference is angrier. … After winning the GOP speaker nomination on Wednesday — barely … ",
    "url": "https://punchbowl.news/archive/101223-punchbowl-news-am/"
  },
  {
    "text": "The New Republican Establishment  —  An alternative Trumpist governing elite gets closer to ruling the party.  —  In the final account, the rise and fall of Kevin McCarthy might read like the familiar tale of a Republican congressional leader toppled by a small but uncompromising right-wing faction.",
    "url": "https://www.nytimes.com/2023/10/12/upshot/new-republican-establishment-speaker.html"
  },
  {
    "text": "Biden aides slam Trump for calling Hezbollah ‘very smart’  —  Aides to President Biden and his campaign blasted former President Trump on Thursday for remarks a night earlier in which Trump described Hezbollah as “very smart” amid unfolding violence in Israel.",
    "url": "https://thehill.com/homenews/campaign/4251829-biden-aides-slam-trump-for-calling-hezbollah-very-smart/"
  },
  {
    "text": "Why is Trump Trashing Netanyahu?  —  On Wednesday, Donald Trump held a rally in West Palm Beach, Florida.  Considering Palm Beach County has one of the highest concentrations of Jewish people in America, the typical person at a Trump rally is quite conservative, and Israel is now responding … ",
    "url": "https://washingtonmonthly.com/2023/10/12/why-is-trump-trashing-netanyahu/"
  },
  {
    "text": "De Niro warns democracy 'won't survive' Trump reelection  —  Robert De Niro is issuing a dire warning against the country reelecting former President Trump, saying “democracy won't survive the return of a wannabe dictator.”  —  “I've spent a lot of time studying bad men,” the “Godfather” … ",
    "url": "https://thehill.com/blogs/in-the-know/4253058-de-niro-warns-democracy-wont-survive-trump-reelection/"
  },
  {
    "text": "U.S., Qatar agree to stop Iran from tapping $6 billion fund after Hamas attack  —  U.S. officials and the Qatari government have agreed to stop Iran from accessing a $6 billion account for humanitarian assistance in light of Hamas's attack on Israel, Deputy Treasury Secretary Wally Adeyemo told House Democrats … ",
    "url": "https://www.washingtonpost.com/business/2023/10/12/iran-oil-fund-us-israel/"
  },
  {
    "text": "Blinken describes images of Hamas attack victims, pledges US support on trip to Israel  —  “It's simply depravity in the worst imaginable way,” Blinken said.  —  Secretary of State Antony Blinken on Thursday described gruesome photos and videos he reviewed depicting victims of Hamas' terrorist attack on Israeli civilians.",
    "url": "https://abcnews.go.com/International/blinken-meets-hamas-attack-survivors-pledges-us-support/story?id=103925374"
  },
  {
    "text": "A new indictment charges Sen. Menendez with being an unregistered agent of the Egyptian government  —  Federal prosecutors have rewritten their indictment against U.S. Sen. Bob Menendez of New Jersey and his wife to charge them with conspiring to have him act as an agent of Egypt and Egyptian officials.",
    "url": "https://apnews.com/article/bob-menendez-indictment-c1850764b8ce7c613fc50f0e4f495e87"
  },
  {
    "text": "Six Months Ago NPR Left Twitter.  The Effects Have Been Negligible  —  A lot of people threaten to leave Twitter.  Not many of them have actually done it.  —  This was true even before Elon Musk's purchase of the platform a year ago.  But the parade of calamities since … ",
    "url": "https://niemanreports.org/articles/npr-twitter-musk/"
  },
  {
    "text": "What It Would Mean to Treat Hamas Like ISIS  —  The instant I understood the scale of Hamas's attack on Israel, I understood the probable response.  As I read reports of Hamas terrorists murdering entire families, raping Israeli women beside the bodies of their dead friends and dragging Israeli hostages … ",
    "url": "https://www.nytimes.com/2023/10/12/opinion/israel-hamas-isis-gaza.html"
  },
  {
    "text": "Van Orden defends outburst at Biden officials over Israel, denies cursing  —  Rep. Derrick Van Orden (R-Wis.) on Thursday defended his questioning of Biden administration officials at a briefing this week on Israel after other lawmakers criticized him for what they called rude and obnoxious behavior.",
    "url": "https://thehill.com/homenews/house/4253013-van-orden-defends-outburst-at-biden-officials-over-israel-denies-cursing/"
  },
  {
    "text": "Wisconsin Republicans Retreat From Threats to Impeach Liberal Justice  —  Republicans had floated the idea of impeaching Janet Protasiewicz, newly seated on the Wisconsin Supreme Court, before she could undo the party's legislative gerrymander.  But on Thursday, they backed off.",
    "url": "https://www.nytimes.com/2023/10/12/us/politics/wisconsin-republicans-impeach-janet-protasiewicz.html"
  },
  {
    "text": "Consumer prices rose 0.4% in September, more than expected  — The consumer price index increased 0.4% on the month and 3.7% from a year ago, above respective forecasts for 0.3% and 3.6%.  — Core CPI increased 0.3% on the month and 4.1% on a 12-month basis, both exactly in line with expectations.",
    "url": "https://www.cnbc.com/2023/10/12/cpi-september-2023.html"
  },
  {
    "text": "Poll: Majority blames gov't for Hamas massacre, says Netanyahu must resign  —  An overwhelming majority of 86% of respondents, including 79% of coalition supporters, said the surprise attack from Gaza is a failure of the country's leadership.  —  Four out of five Jewish Israelis believe … ",
    "url": "https://www.jpost.com/israel-news/article-767880"
  },
  {
    "text": "France bans pro-Palestinian protests, citing risk of ‘disturbances to public order’  —  French police used teargas and water cannon to break up a banned rally in support of the Palestinian people in Paris on Thursday after the interior minister said such gatherings were “likely to generate disturbances to public order”.",
    "url": "https://www.reuters.com/world/europe/france-bans-pro-palestinian-protests-citing-risk-disturbances-public-order-2023-10-12/"
  },
  {
    "text": "Republican Sen. Tuberville Warns Against ‘Picking Sides in the Middle East’ in Jaw-Dropping Interview  —  Senator Tommy Tuberville (R-AL) is under fire for telling an interviewer that “when you start picking sides in the Middle East, it can get really messy very quick” amid the violence in Israel spurred by Hamas.",
    "url": "https://www.mediaite.com/news/republican-sen-tuberville-warns-against-picking-sides-in-the-middle-east-in-jaw-dropping-interview/"
  },
  {
    "text": "Law enforcement steps up patrols of Jewish houses of worship, businesses as calls for attacks in the U.S. intensify online  —  Former Hamas leader Khaled Mashal recently called for Friday to be a global day of “anger” in support of the recent Hamas attack on Israel.",
    "url": "https://www.nbcnews.com/news/us-news/law-enforcement-patrols-jewish-synagogues-temples-businesses-rcna120055"
  }
]