[
  {
    "text": "Trump's first criminal trial will start March 25, judge says  —  The schedule means Trump will spend weeks in court instead of on the campaign trail.  —  Former President Donald Trump's first criminal trial will start on March 25 as scheduled, a judge said in New York on Thursday as he denied Trump's attempts to throw out the charges.",
    "url": "https://www.politico.com/news/2024/02/15/trump-hush-money-criminal-case-hearing-update-00141621"
  },
  {
    "text": "Trump hush money trial to start March 25, judge denies dismissal request  — A New York judge said that jury selection in the hush money trial of former President Donald Trump will begin March 25.  — The judge denied Trump's request to dismiss charges in the case.",
    "url": "https://www.cnbc.com/2024/02/15/trump-in-new-york-courr-for-stormy-daniels-hush-money-case-hearing-.html"
  },
  {
    "text": "The investigation that led to the charges spanned nearly five years.  —  Ruling that the case against Donald J. Trump can proceed, Justice Juan M. Merchan said he planned to begin the trial on March 25.  —  A judge rejected a bid to toss the hush-money case.  Here's the latest.",
    "url": "https://www.nytimes.com/live/2024/02/15/nyregion/trump-manhattan-criminal-case"
  },
  {
    "text": "Judge Rules Full Speed Ahead on Trump's Manhattan Criminal Trial  —  Donald Trump tried to avoid trial in Manhattan for covering up his hush money payment to Stormy Daniels, but a judge on Thursday said it's going forward in March as planned.  —  Donald Trump will face trial next month … ",
    "url": "https://www.thedailybeast.com/judge-rules-full-speed-ahead-on-trumps-manhattan-criminal-trial"
  },
  {
    "text": "Scoop: Hur making plans to testify to GOP panel about Biden … - Biden, his White House and his personal lawyer have been bashing Hur over his report, which cleared Biden of criminal wrongdoing but painted the president, 81, as having “diminished faculties” and a “poor memory.”",
    "url": "https://www.axios.com/2024/02/15/robert-hur-congress-testimony-biden-memory"
  },
  {
    "text": "Spare Us Lara Trump  —  Well, that was fast!  Donald Trump is not yet the Republican nominee for president, but already we're witnessing a resurgence of the in-your-face nepotism that brought us last decade's cringe-worthy reality show: Javanka in the West Wing.",
    "url": "https://www.nytimes.com/2024/02/15/opinion/donald-trump-family.html"
  },
  {
    "text": "Republicans Are Acting Like 2024 Is Their Last Campaign  —  It's understandable that Donald Trump regards the 2024 election as his final shot at redemption after a 2020 defeat he still cannot admit.  In August, he will very likely become a three-time presidential nominee at the age of 78.",
    "url": "https://nymag.com/intelligencer/article/republicans-are-acting-like-the-2024-election-is-their-last.html"
  },
  {
    "text": "The Truth About Trump's RNC Shakeup—and Why the GOP Will Suffer  —  A shakeup at the RNC may mean less money for anyone not named Donald Trump.  And that's terrible news for state parties desperate for cash. … Donald Trump doesn't want his snowballing legal troubles to just be his problem … ",
    "url": "https://www.thedailybeast.com/the-truth-about-trumps-rnc-shakeupand-why-the-gop-will-suffer"
  },
  {
    "text": "The final repudiation of ‘2000 Mules’  —  Since Donald Trump left office in January 2021, there has been no more influential presentation of his theory that the election was stolen than the film “2000 Mules,” created by activist — and Trump pardon recipient — Dinesh D'Souza.",
    "url": "https://www.washingtonpost.com/politics/2024/02/15/dsouza-2000-mules-repudiation/"
  },
  {
    "text": "The biggest online threat to 2024 elections isn't AI  —  Happy Valentine's Day.  Remember when asking AI to generate candy hearts resulted in delightfully incoherent messages like “U hack” and “Sweat poo?”  Those were simpler times.  Send news tips and ersatz love letters to: will.oremus@washpost.com.",
    "url": "https://www.washingtonpost.com/politics/2024/02/14/biggest-online-threat-2024-elections-isnt-ai/"
  },
  {
    "text": "Meta Cuts Funding for Fact-Checking on WhatsApp as Elections Loom  —  Meta Platforms is reducing payments to news organizations that fact-check potential misinformation on WhatsApp, including around elections, according to three people with knowledge of the situation.",
    "url": "https://www.theinformation.com/articles/meta-cuts-fact-checking-efforts-on-whatsapp-as-elections-loom"
  },
  {
    "text": "Joe Manchin floats Mitt Romney as a potential running mate as he weighs a presidential bid  —  Manchin made the comment Thursday in Cleveland, the latest stop on his “listening tour” as the West Virginia senator ponders a third-party White House campaign.  —  CLEVELAND — Sen, Joe Manchin … ",
    "url": "https://www.nbcnews.com/politics/2024-election/joe-manchin-floats-mitt-romney-potential-running-mate-rcna138977"
  },
  {
    "text": "Kristen Stewart fires back at old Trump posts encouraging Robert Pattinson to ‘dump’ her  —  Kristen Stewart is blasting former President Trump as “such a little baby” for tweeting about her then-relationship years before he became commander in chief.  —  In 2012, Trump weighed … ",
    "url": "https://thehill.com/blogs/in-the-know/4469702-kristen-stewart-trump-robert-pattinson-twilight/"
  },
  {
    "text": "McConnell defends push for Ukraine aid amid attacks from Trump wing of GOP: ‘Every argument against this is wrong’  —  Senate GOP Leader Mitch McConnell strongly defended his handling of a foreign aid package and bipartisan border security deal under heavy criticism from his right flank … ",
    "url": "https://www.cnn.com/2024/02/14/politics/mitch-mcconnell-foreign-aid/"
  },
  {
    "text": "Safety Net  —  Research indicates access to paid family leave is linked to a decrease in infant deaths and better economic, physical and mental health for new parents.  —  Currently, 13 states have some form of paid parental leave to care for newborns.  —  No states that banned abortion offer paid parental leave.",
    "url": "https://projects.propublica.org/the-year-after-a-denied-abortion/"
  },
  {
    "text": "Adam Schiff steps out on climate  —  He's the first of the leading candidates for California's open Senate seat to release a detailed platform.  —  Rep. Adam Schiff on Thursday proposed ending federal subsidies for oil and gas production, offering federal wildfire insurance … ",
    "url": "https://www.politico.com/news/2024/02/15/schiff-steps-out-on-climate-00141599"
  },
  {
    "text": "Parker County ‘White Nationalist Fight Club’ Leader Exposed  —  The Texas Observer and Bellingcat have identified the leader of a white nationalist group that distributed antisemitic and racist flyers in Weatherford, Mineral Wells, and Eagle Pass over the last year.",
    "url": "https://www.texasobserver.org/rhett-murry-loftis-white-nationalist-active-club/"
  },
  {
    "text": "Maryland 2024 Poll: Former Gov. Larry Hogan Starts Strong in Election for Open Senate Seat  —  Home Polls Maryland 2024 Poll: Former Gov. Larry Hogan Starts Strong in Election for Open Senate Seat … The first Emerson College Polling/The Hill/DC News Now survey of the 2024 Maryland U.S … ",
    "url": "https://emersoncollegepolling.com/maryland-2024-poll-former-gov-larry-hogan-starts-strong-in-election-for-open-senate-seat/"
  },
  {
    "text": "2/15/24 ☀️ Punchbowl News AM … Just this week, Speaker Mike Johnson has: … This is the most chaotic, inefficient and ineffective majority we've seen in decades covering Congress.  It started this way under former Speaker Kevin McCarthy and has gotten worse under Johnson.",
    "url": "https://punchbowl.news/archive/21524-punchbowl-news-am/"
  },
  {
    "text": "Updated: Incident at National Archives Rotunda Closes Galleries to Public  —  Press Release  —  The National Archives Rotunda and galleries in Washington, DC, closed to the public today after two individuals dumped red powder on the encasement protecting the U.S. Constitution at approximately 2:30 pm.",
    "url": "https://www.archives.gov/press/press-releases/2024/nr24-14"
  }
]