[
  {
    "text": "Trump kicks off a Pennsylvania rally by talking about Arnold Palmer's genitalia  —  Donald Trump's campaign suggested he would begin previewing his closing argument Saturday night with Election Day barely two weeks away.  But the former president kicked off his rally with a detailed story … ",
    "url": "https://apnews.com/article/trump-arnold-palmer-closing-arguments-latrobe-pennsylvania-2bea9620c523e531a55259200215284e"
  },
  {
    "text": "At a Pennsylvania Rally, Trump Descends to New Levels of Vulgarity  —  The G.O.P. nominee repeated crude insults, and his supporters relished each moment.  But the display could alienate swing voters.  —  Former President Donald J. Trump on Saturday spewed crude and vulgar remarks at a rally … ",
    "url": "https://www.nytimes.com/2024/10/19/us/politics/trump-vulgarity-pennsylvania-rally.html"
  },
  {
    "text": "Trump fixates on Arnold Palmer as ‘all man’ in showers during profane rally  —  Turning his attention to his rival after a meandering start, Donald Trump used profanity to insult Vice President Kamala Harris.  —  LATROBE, Pa. — Seventeen days from the election, here in arguably … ",
    "url": "https://www.washingtonpost.com/politics/2024/10/19/trump-rally-arnold-palmer-attacks-harris/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI5MzEwNDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzMwNjk2Mzk5LCJpYXQiOjE3MjkzMTA0MDAsImp0aSI6IjkwMmQ2ZThiLWI0ZTAtNDllNC05ZDdlLTE0OTRmMmFkMjI3YSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzEwLzE5L3RydW1wLXJhbGx5LWFybm9sZC1wYWxtZXItYXR0YWNrcy1oYXJyaXMvIn0.oOm8EbxP21EDTXZIEvqMv0Zx9iGckLJHQ8-aR1rh1O4&itid=gfta"
  },
  {
    "text": "The Very Real Scenario Where Trump Loses and Takes Power Anyway  —  If Trump overturns the 2024 election, here's how it could happen.  —  Four years ago, a sitting president — rejected by American voters — attempted to seize a second term anyway, plunging the nation into confusion, conflict and, in its last gasp, violence.",
    "url": "https://www.politico.com/news/magazine/2024/10/20/trump-overturn-2024-election-plan-00184103"
  },
  {
    "text": "Musk promises to award $1 million each day to a signer of his petition  —  Billionaire Elon Musk promised on Saturday to give away $1 million each day until November's election to someone who signs his online petition supporting the U.S. Constitution.  —  And he wasted no time … ",
    "url": "https://www.reuters.com/world/us/elon-musk-promises-award-1-mln-each-day-signer-his-petition-2024-10-20/"
  },
  {
    "text": "Elon Musk Veers Into Clearly Illegal Vote Buying, Offering $1 Million Per Day Lottery Prize Only to Registered Voters  —  Hugo Lowell: “Elon Musk says on stage at a town hall that America PAC will be awarding $1 million every day until the election to a registered Pennsylvania voter who has signed his petition.",
    "url": "https://electionlawblog.org/?p=146397"
  },
  {
    "text": "'It's real': Kamala Harris appears to say Israel committing genocide in Gaza  —  “Listen, what he's talking about, it's real.  It's real.  That's not the subject that I came to discuss today, but it's real, and I respect his voice.”  —  US presidential candidate Kamala Harris appeared … ",
    "url": "https://www.jpost.com/diaspora/article-825264"
  },
  {
    "text": "Trump Media Whistleblower Blasts Company for Outsourcing Jobs Abroad as Betrayal of “America First”  —  An internal Truth Social complaint reviewed by ProPublica calls for the firing of CEO Devin Nunes, alleging he has pursued an “America Last” hiring policy, “consistently lied” and made the company vulnerable to action by regulators.",
    "url": "https://www.propublica.org/article/trump-media-whistleblower-complaint-devin-nunes"
  },
  {
    "text": "Four of Trump's Most Meandering Remarks This Week  —  The former president says that his style is to “weave” from one subject to the next.  Others see something more worrisome in his ramblings.  —  One of the truisms of Trump World is that being viewed as boring is a sin more deadly than being wrong.",
    "url": "https://www.nytimes.com/2024/10/20/us/politics/trump-meandering-remarks.html"
  },
  {
    "text": "Harris turns 60: How her age compares to past presidents … - Age took on an outsized role in the 2024 race when Biden was on the ticket, as many voters felt he was too old to be president.  — More recently, Trump's age and acuity have been under scrutiny. … Just 12 presidents have taken office in their 60s or 70s.",
    "url": "https://www.axios.com/2024/10/20/harris-trump-ages-60-birthday"
  },
  {
    "text": "At least 7 dead in Georgia dock collapse on US Atlantic coast  —  At least seven people were killed after part of a boat dock collapsed, sending at least 20 into the Atlantic waters off the coast of the U.S. state of Georgia.  —  U.S. Coast Guard ships were searching Saturday night for missing people.",
    "url": "https://www.reuters.com/world/us/least-7-dead-georgia-dock-collapse-us-atlantic-coast-2024-10-20/"
  },
  {
    "text": "How to Read the Immunity Appendix  —  I'm still working through a deeper dive of the appendix to his immunity brief that Jack Smith released on Friday.  —  But I thought I'd share how I'm reading it, as I'll need to refer back to that when I write up some of the interesting things I've found.",
    "url": "https://www.emptywheel.net/2024/10/20/how-to-read-the-immunity-appendix/"
  },
  {
    "text": "Who's Mailing the Catholic Tribune?  It's Not the Church, It's Partisan Media.  —  ProPublica has traced these mass-mailed newspapers to a “pink slime” network known for misinformation and its financial ties to right-wing super PACs and billionaires.  —  One by one, Catholic dioceses … ",
    "url": "https://www.propublica.org/article/church-no-affiliation-catholic-tribune-metric-media"
  },
  {
    "text": "Harris is attending church in Georgia and encouraging Black congregants to vote  —  Kamala Harris is going to church in Georgia on Sunday, where she will speak to the faithful and encourage Black congregants to vote as part of a nationwide campaign push known as “souls to the polls.”",
    "url": "https://apnews.com/article/harris-election-2024-trump-church-georgia-voting-91f92ede412f87f10851544c9ba637b7"
  },
  {
    "text": "Montana GOP Senate Hopeful Accused Firefighters Of ‘Milking’ Infernos For Extra Pay  —  Tim Sheehy, who made his fortune in aerial firefighting, has argued that “a lot” of wildland firefighters want to let infernos burn in order to rack up overtime pay.  —  Montana GOP Senate hopeful Tim Sheehy … ",
    "url": "https://www.huffpost.com/entry/montana-gop-tim-sheehy-wildland-firefighters_n_6712a64ce4b03a110eb42f8c"
  }
]