[
  {
    "text": "How Mark Meadows' Testimony May Have Just Helped Prosecutors  —  Mark Meadows made his surprise appearance in court on Monday, and while what he said may have seemed innocuous, it could be much more damning than anyone thinks.  —  For years now, Mark Meadows has avoided answering questions … ",
    "url": "https://www.thedailybeast.com/how-mark-meadows-testimony-may-have-just-helped-prosecutors"
  },
  {
    "text": "Georgia Senate leader seeks ways to sanction ‘tainted’ Willis over Trump charges  —  X  —  A Republican-led effort to reprimand District Attorney Fani Willis after she brought charges against former President Donald Trump in Fulton County is poised to expand, as state and federal lawmakers pursue … ",
    "url": "https://www.ajc.com/politics/politics-blog/georgia-senate-leader-seeking-ways-to-sanction-tainted-willis-over-trump-charges/PP34EF3CS5B77F5XJ3WMTAW7KQ/"
  },
  {
    "text": "Trump may not attend arraignment in Fulton County  —  Washington — Former President Donald Trump may not show up to his arraignment in Georgia next week, according to two sources familiar with his plans.  —  Trump is considering waiving his arraignment appearance, which is scheduled … ",
    "url": "https://www.cbsnews.com/news/trump-arraignment-fulton-county-georgia/"
  },
  {
    "text": "Proud Boy Enrique Tarrio's January 6 sentencing abruptly postponed due to ‘emergency’  —  The sentencing for Enrique Tarrio, the former chair of the Proud Boys, was postponed unexpectedly on Wednesday morning “due to an emergency,” according to the U.S. attorney's office in Washington, D.C.",
    "url": "https://www.washingtonexaminer.com/policy/courts/proud-boy-enrique-tarrior-january-6-sentenced-abruptly-postponed-emergency"
  },
  {
    "text": "Proud Boys leader Enrique Tarrio's sentencing delayed in seditious conspiracy case  —  Washington — Former Proud Boys leader Enrique Tarrio's sentencing hearing has been delayed, due to an emergency, the U.S. attorney's office said in a press release Wednesday morning.",
    "url": "https://www.cbsnews.com/news/proud-boys-leader-enrique-tarrio-sentencing-seditious-conspiracy-case/"
  },
  {
    "text": "A 6-figure Donald Trump donor is now a No Labels adviser  —  A major Republican donor and one-time financial backer of former President Donald Trump is now a leader in the Florida chapter of No Labels' third-party presidential bid.  —  Allan Keen, a Florida-based real estate developer … ",
    "url": "https://www.politico.com/news/2023/08/30/trump-donor-no-labels-adviser-00113395"
  },
  {
    "text": "Is Judge Cannon preparing to kneecap Trump's Florida documents case?  —  Spoiler alert: Yes. … Last year, Judge Aileen Cannon tried valiantly to derail the Justice Department's investigation of Donald Trump's retention of classified documents at his Florida country club.",
    "url": "https://www.publicnotice.co/p/judge-aileen-cannon-trump-florida-documents-case"
  },
  {
    "text": "Rudy Giuliani is liable for defaming Georgia election workers, judge rules  —  U.S. District Court Judge Beryl Howell ordered Giuliani to pay the two election workers punitive damages.  —  A federal judge ruled Wednesday that Rudy Giuliani is legally liable for defaming two Georgia election workers … ",
    "url": "https://www.politico.com/news/2023/08/30/judge-rules-giuliani-is-liable-for-defaming-georgia-election-workers-orders-sanctions-00113462"
  },
  {
    "text": "Judge orders default judgment, sanctions against Rudy Giuliani in election workers' lawsuit  — A federal judge issued a default judgment against former Trump lawyer Rudy Giuliani and imposed sanctions on him in a civil conspiracy lawsuit filed by two Georgia election workers.",
    "url": "https://www.cnbc.com/2023/08/30/judge-orders-default-judgment-sanctions-against-rudy-giuliani-in-election-workers-lawsuit.html"
  },
  {
    "text": "RNC member: State parties should develop ‘options’ to deny Trump nomination if he's a convicted felon  —  Bill Palatucci, a Republican National Committee member from New Jersey, is sounding the alarm that the RNC needs to adopt an escape hatch to boot former President Donald Trump … ",
    "url": "https://www.rawstory.com/trump-2024-2664623601/"
  },
  {
    "text": "Tennessee House Speaker silences critic, avoids vote on alleged residency fraud  —  On Monday, Tennessee Representative Justin Jones (D) distributed a letter to his colleagues in the Tennessee House announcing his intention to call a vote of no confidence in House Speaker Cameron Sexton (R).",
    "url": "https://popular.info/p/update-tennessee-house-speaker-silences"
  },
  {
    "text": "DeSantis tells Biden: Keep your IRA money  —  The governor is blocking Biden's IRA benefits from Floridians.  There's not much Dems can do about it.  —  President Joe Biden is offering one of his White House challengers hundreds of millions of dollars to spend in his state.",
    "url": "https://www.politico.com/news/2023/08/30/desantis-refuses-biden-climate-ira-money-00113397"
  },
  {
    "text": "Robert F. Kennedy Jr. Gushes Over Donald Trump's Mug Shot On Jesse Watters' Show  —  The long-shot Democratic presidential candidate asked the question about Trump's mug shot that many may be thinking.  —  LOADING  —  Robert F. Kennedy Jr. not surprisingly praised Donald Trump's mug shot on … ",
    "url": "https://www.huffpost.com/entry/robert-f-kennedy-jr-donald-trump-mug-shot_n_64ef1bcee4b0cf275533a38c"
  },
  {
    "text": "GOP State Rep. Arrested On Voter Fraud Charge  —  Alabama legislator David Cole, a doctor and Army veteran, is accused of voting in a district where he did not live.  —  LOADING  —  An Alabama legislator was arrested Tuesday on felony voter fraud charges accusing him of voting in a district where he did not live.",
    "url": "https://www.huffpost.com/entry/alabama-gop-lawmaker-arrested_n_64ef3239e4b02f61505e3dab"
  },
  {
    "text": "Over 100 former clerks of Justice Thomas sign open letter defending his integrity, independence  —  112 of Justice Thomas' former clerks say news stories attacking him are ‘part of larger attack on the Court’ and its ‘legitimacy’  —  EXCLUSIVE - Over 100 former clerks of Supreme Court Justice … ",
    "url": "https://www.foxnews.com/politics/over-100-former-clerks-justice-thomas-sign-open-letter-defending-his-integrity-independence"
  },
  {
    "text": "Dem Senate plots move amid spending clash with House GOP  —  Majority Leader Chuck Schumer is tentatively planning to bring up several spending bills for floor votes in mid-September.  —  The Senate is preparing its first big move in the fall spending fight.",
    "url": "https://www.politico.com/news/2023/08/30/schumer-spending-senate-house-gop-00113447"
  },
  {
    "text": "Exclusive: Russia will not probe Prigozhin plane crash under international rules  —  Russia has informed Brazil's aircraft investigation authority that it will not probe the crash of the Brazilian-made Embraer (EMBR3.SA) jet that killed mercenary boss Yevgeny Prigozhin under international rules … ",
    "url": "https://www.reuters.com/world/europe/russia-will-not-probe-prigozhin-plane-crash-under-international-rules-brazil-2023-08-29/"
  },
  {
    "text": "A.O.C. at 33: ‘Evolving,’ ‘Learning,’ But Not Ready to Call Herself an Insider  —  The congresswoman from New York says she's different from when she first took office.  But she's not ready to call herself an insider.  —  Representative Alexandria Ocasio-Cortez is used to being a lightning rod.",
    "url": "https://www.nytimes.com/2023/08/30/us/politics/aoc-third-term-congress.html"
  },
  {
    "text": "Playbook: The House GOP mulls some impeachment hypocrisy  —  Presented by With help from Eli Okun and Garrett Ross  —  DRIVING THE DAY  —  FLORIDA LATEST — Via the National Hurricane Center: “IDALIA RAPIDLY INTENSIFIES INTO A CATEGORY 4 HURRICANE ... CATASTROPHIC STORM SURGE AND DESTRUCTIVE WINDS … ",
    "url": "https://www.politico.com/newsletters/playbook/2023/08/30/the-house-gop-mulls-some-impeachment-hypocrisy-00113436"
  },
  {
    "text": "Twitter allows US political candidates and parties to advertise in policy switch  —  Announcement by the Elon Musk-owned social media platform has experts concerned over misinformation ahead of 2024 election  —  The social media company formerly known as Twitter said Tuesday … ",
    "url": "https://www.theguardian.com/technology/2023/aug/29/twitter-x-political-ads-us-policy-misinformation"
  }
]