[
  {
    "text": "With six words, Michelle Obama rewires America's conversation on race  —  Most of us, Michelle Obama said, “will never benefit from the affirmative action of generational wealth.”  —  In her speech at the Democratic National Convention in 2016, Michelle Obama coined one of the defining phrases … ",
    "url": "https://www.washingtonpost.com/politics/2024/08/21/with-six-words-michelle-obama-rewires-americas-conversation-race/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI0MjEyODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI1NTk1MTk5LCJpYXQiOjE3MjQyMTI4MDAsImp0aSI6ImNmZWY4OWJiLWZiN2ItNDdjNy04MWVkLWZhMTgyNWNjNmM4NCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzA4LzIxL3dpdGgtc2l4LXdvcmRzLW1pY2hlbGxlLW9iYW1hLXJld2lyZXMtYW1lcmljYXMtY29udmVyc2F0aW9uLXJhY2UvIn0.8VxR9LlAaJi-_5ISKknA3QVy8H6xIfgQKen7M9xmcuY&itid=gfta"
  },
  {
    "text": "Michelle Obama Absolutely Takes Apart Donald Trump  —  In 2007, a young biracial senator from Illinois named Barack Obama was trying to convince Black voters that he was one of them.  I traveled to South Carolina to see a set of speeches that would become a historic inflection point … ",
    "url": "https://www.nytimes.com/2024/08/20/opinion/michelle-obama-dnc-speech.html"
  },
  {
    "text": "Trump hits back at Obamas: ‘Do I still have to stick to policy?’  —  Former President Trump on Wednesday mocked allies who suggested he should not engage in personal attacks, pointing to fiery speeches a night earlier from former President Obama and former first lady Michelle Obama at the Democratic convention.",
    "url": "https://thehill.com/homenews/campaign/4839905-trump-mocks-allies-obama-attacks/"
  },
  {
    "text": "Michelle Obama Is a Master of Politics Because She Hates Politics  —  The former first lady delivers an emotional barnstormer that reaches beyond ideology.  —  Pocket  —  When Barack Obama took the stage at the Democratic National Convention late on Tuesday, he immediately paid tribute … ",
    "url": "https://www.thenation.com/article/politics/michelle-obama-dnc-speech/"
  },
  {
    "text": "RFK Jr. plans to drop out of presidential race by end of week: Sources  —  Sources say Kennedy is leaning toward endorsing former President Trump.  —  Robert F. Kennedy Jr. speaks at the Bitcoin 2024 conference in Nashville, July 26, 2024.  —  Robert Kennedy Jr. is planning to drop … ",
    "url": "https://abcnews.go.com/US/rfk-jr-plans-drop-presidential-race-end-week/story?id=113028999"
  },
  {
    "text": "What happens if Kennedy endorses Trump?  —  The independent candidate doesn't have much support — and it's not clear how much of it would transfer.  —  It seems increasingly likely that Robert F. Kennedy Jr.'s odd, doomed bid for the presidency is nearing its end.",
    "url": "https://www.washingtonpost.com/politics/2024/08/21/kennedy-drop-out-trump/"
  },
  {
    "text": "Robert F. Kennedy Jr. moves closer to Trump endorsement  —  His campaign has announced an address to the nation Friday in Arizona about what happens next.  —  Robert F. Kennedy Jr. announced he will address the nation about the path forward for his campaign Friday in Arizona … ",
    "url": "https://www.washingtonpost.com/politics/2024/08/21/robert-f-kennedy-jr-moves-closer-trump-endorsement/"
  },
  {
    "text": "Trump has far less campaign money and infrastructure than Harris  —  The former president's campaign infrastructure is smaller than Harris' — and his own from 2020.  —  Former President Donald Trump's campaign spending more than doubled last month as he dropped big money on ads attacking his new opponent … ",
    "url": "https://www.politico.com/news/2024/08/21/trump-harris-campaign-spending-fec-00175377"
  },
  {
    "text": "Leave the Dunn.  Take the cannoli.  —  Welcome to POLITICO's West Wing Playbook, your guide to the people and power centers in the Biden administration.  —  The “Fridays at Five” gathering in the Eisenhower Executive Office Building, one of three White House farewell events honoring departing … ",
    "url": "https://www.politico.com/newsletters/west-wing-playbook/2024/08/20/leave-the-dunn-take-the-cannolis-00175121"
  },
  {
    "text": "Look out — Republicans are defecting from Trump's MAGA army in droves  —  Video Player is loading.  —  Play Video  —  Unmute  —  Current Time 0:00  —  Loaded: 0%  —  Stream Type LIVE  —  Seek to live, currently behind liveLIVE  —  Playback Rate  —  Chapters  — Chapters",
    "url": "https://thehill.com/opinion/campaign/4837058-harris-rise-gop-trump-weakness/"
  },
  {
    "text": "Donald Trump Accused of Committing ‘Massive Crime’ With Reported Phone Call  —  Donald Trump has been accused of violating federal law by allegedly calling Israeli Prime Minister  —  to discuss the ceasefire deal the U.S. is helping negotiate between Israel and  —  .",
    "url": "https://www.newsweek.com/donald-trump-accused-crime-benjamin-netanyahu-call-ceasefire-hamas-1942248"
  },
  {
    "text": "MAGA Activist Sneaked Onto the Convention Floor in a Disguise  —  Where's Weirdo?  —  National political conventions can attract a lot of strange people, a lot of famous people, and a lot of people who are both.  I saw a few of each last night at the Democratic convention … ",
    "url": "https://www.thebulwark.com/p/maga-activist-sneaked-onto-the-convention"
  },
  {
    "text": "Trump Isn't Finished  —  The damage inflicted on the nation during Donald Trump's first term in office pales in comparison with what he will do if he is elected to a second term.  How can we know this?  The best evidence is Trump himself.  He has repeatedly demonstrated his willingness to tear the country apart.",
    "url": "https://www.nytimes.com/2024/08/21/opinion/trump-second-term-2025.html?unlocked_article_code=1.Ek4.MGLi.HFM1Ziql-h-t&smid=em-share"
  },
  {
    "text": "U.S. Investigating Americans Who Worked With Russian State Television  —  The F.B.I. raided the homes of two prominent commentators on Russian state television channels as part of an effort to blunt attempts to influence November's election.  —  The Department of Justice has begun … ",
    "url": "https://www.nytimes.com/2024/08/21/technology/us-fbi-russia-election-disinformation.html?unlocked_article_code=1.Ek4.RFBV.l1VKhQQQPmUT&smid=nytcore-ios-share&referringSource=articleShare&sgrp=c-cb"
  },
  {
    "text": "Vladimir Putin manipulated Donald Trump's ‘ego and insecurities’, book says  —  Former US national security adviser HR McMaster claims Russian president had a hold over Trump in new memoir  —  Vladimir Putin exploited Donald Trump's “ego and insecurities” to exert an almost mesmeric hold … ",
    "url": "https://www.theguardian.com/books/article/2024/aug/21/trump-putin-hr-mcmaster-memoir"
  },
  {
    "text": "Nonfarm payroll growth revised down by 818,000, Labor Department says  — As part of its preliminary annual benchmark revisions to the nonfarm payroll numbers, the Bureau of Labor Statistics said the actual job growth was nearly 30% less than the initially reported … WATCH NOW",
    "url": "https://www.cnbc.com/2024/08/21/nonfarm-payroll-growth-revised-down-by-818000-labor-department-says.html"
  },
  {
    "text": "Judge orders Trump to update him on unanswered Secret Service subpoena tied to Jan. 6 civil case  —  A federal judge overseeing civil litigation brought against Donald Trump by lawmakers and police who endured the Jan. 6 attack on the U.S. Capitol has agreed to give the former president … ",
    "url": "https://lawandcrime.com/high-profile/judge-orders-trump-to-update-him-on-unanswered-secret-service-subpoena-tied-to-jan-6-civil-case/"
  },
  {
    "text": "‘Hotties for Harris’ Is Where the DNC Gets Horny … There are affinity groups of every kind at the Democratic National Convention in Chicago.  There are events for Black Democrats, Hispanic Democrats, Asian American Democrats and LGBT Democrats.  Pro-union and business-friendly events.",
    "url": "https://nymag.com/intelligencer/article/2024-dnc-chicago-hotties-for-harris-memes.html"
  },
  {
    "text": "DeSantis takeover of Florida school boards has big setback  —  At least 11 of his endorsed candidates appear to have lost Tuesday.  —  TALLAHASSEE, Florida — Gov. Ron DeSantis' attempt to elect conservative-leaning school board members across Florida hit a snag Tuesday … ",
    "url": "https://www.politico.com/news/2024/08/20/ron-desantis-school-board-results-00175296"
  },
  {
    "text": "FBI probes insect attack on Democratic breakfast in Chicago  —  CHICAGO − Chicago Police and the FBI are investigating if saboteurs placed bugs in a breakfast buffet prepared for delegates at the Democratic National Convention on Wednesday.  —  “Multiple unknown female offenders … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/08/21/maggots-chicago-democrats-hotel/74892695007/"
  },
  {
    "text": "Justice Department signals plan to salvage obstruction charges in some Jan. 6 cases  —  Prosecutors still see a path to conviction for some defendants, even while dropping the charge in other cases following a Supreme Court ruling.  —  The Justice Department said Wednesday it plans … ",
    "url": "https://www.politico.com/news/2024/08/21/justice-department-jan-6-obstruction-00175412"
  },
  {
    "text": "Why Can't Fact Checkers Handle Donald Trump?  —  Fact checkers' reviews of DNC speeches about Trump have routinely botched the facts — earning one correction so far and a community note on X  —  FACT CHECKING COLUMNS have been around for some time but gained new popularity with the rise … ",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-fact-checkers-dnc-1235084868/"
  },
  {
    "text": "Oath Keepers lawyer pleads guilty to ordering militia to destroy evidence after Capitol riot  —  Kellye SoRelle, of Texas, pleaded guilty to one felony count of obstruction of justice.  —  WASHINGTON — A Texas woman who served as the former general counsel for the Oath Keepers pleaded guilty Wednesday … ",
    "url": "https://www.wusa9.com/article/news/national/capitol-riots/oath-keepers-lawyer-pleads-guilty-to-ordering-militia-to-destroy-evidence-after-capitol-riot-kellye-sorelle-stewart-rhodes/65-c1bab370-f4f0-4fad-8ed7-8e995b634f7c"
  },
  {
    "text": "How Kamala intends to bring prices down  —  Not with price controls but with more competition  —  I don't want to alarm you, but the Labor Department today revised downward its monthly payroll numbers over the past year by about 818,000 jobs: Employers added roughly 174,000 jobs per month instead … ",
    "url": "https://robertreich.substack.com/p/how-kamala-intends-to-bring-prices"
  },
  {
    "text": "Bill Pascrell, longtime N.J. congressman and fierce Trump critic, dies at 87  —  The Democrat's four decades in rough-and-tumble New Jersey politics prepared him well for one of his most visible roles: Donald Trump antagonizer.  —  WASHINGTON — Democratic Rep. Bill Pascrell … ",
    "url": "https://www.nbcnews.com/politics/congress/bill-pascrell-democrat-new-jersey-congressman-dead-rcna166227"
  },
  {
    "text": "Beyoncé Threatens Cease-and-Desist Over Trump Campaign's ‘Freedom’ Video  —  Former president did not receive permission to use Lemonade song in 13-second video posted by Trump's spokesperson, Rolling Stone has learned … A source close to Beyoncé tells Rolling Stone … ",
    "url": "https://www.rollingstone.com/music/music-news/beyonce-threatens-cease-and-desist-trump-campaign-freedom-video-1235084830/"
  }
]