[
  {
    "text": "The Big Companies Funding Trump's Inauguration Despite Denouncing Jan. 6  —  The second Trump inaugural fund is on track to be the most lucrative yet  —  Four years ago, dozens of companies denounced the invasion of the U.S. Capitol and pledged to withhold support from those who disputed the 2020 election results.",
    "url": "https://www.wsj.com/business/trump-inauguration-sponsors-large-company-donations-a3cc1b92?st=gUfJeV&reflink=article_copyURL_share"
  },
  {
    "text": "Trump and his allies say the GOP is the party of free speech.  Their actions say otherwise.  —  For them, free speech means they get to shout the loudest and silence everyone who disagrees with them.  —  If you listened to President-elect Donald Trump and his Republican allies during the campaign … ",
    "url": "https://www.msnbc.com/top-stories/latest/trump-free-speech-hypocrisy-rcna184445"
  },
  {
    "text": "The Walmart Effect  —  New research suggests that the company makes the communities it operates in poorer—even taking into account its famous low prices.  —  No corporation looms as large over the American economy as Walmart.  It is both the country's biggest private employer … ",
    "url": "https://www.theatlantic.com/ideas/archive/2024/12/walmart-prices-poverty-economy/681122/"
  },
  {
    "text": "Texas Sovereignty Act would allow Texas to declare federal actions unconstitutional  —  TYLER, Texas (KLTV) - Senator Bob Hall of Canton has introduced Senate Bill 80, allowing Texas to declare federal actions unconstitutional.  —  Senator Hall has dubbed it the Texas Sovereignty Act.",
    "url": "https://www.kltv.com/2024/12/24/texas-sovereignty-act-would-allow-texas-declare-federal-actions-unconstitutional/"
  },
  {
    "text": "How to have a Trumpy Christmas, and make the president-elect richer, too  —  Donald Trump is profiting off his election in unprecedented ways as his family business sells $92 MAGA hat Christmas ornaments and $22 golden wrapping paper.  —  The Trump Store has a gift for every patriot on your Christmas list.",
    "url": "https://www.washingtonpost.com/politics/2024/12/25/how-have-trumpy-christmas-make-president-elect-richer-too/"
  },
  {
    "text": "Elon Musk Takes Aim at Wikipedia  —  What's New  —  Elon Musk has urged his followers not to donate to Wikipedia, which he branded “Wokepedia,” until “they restore balance to their editing authority.”  —  The tech billionaire made the claim on X,  —  , in response to another user … ",
    "url": "https://www.newsweek.com/elon-musk-takes-aim-wikipedia-fund-raising-editing-political-woke-2005742"
  },
  {
    "text": "Russia launches major Christmas Day attack on Ukraine's energy system  —  Zelenskyy describes cruise and ballistic missile strikes, which caused blackouts in several regions, as ‘inhuman’  —  Christmas morning in Ukraine was overshadowed by a massive Russian aerial attack using cruise missiles … ",
    "url": "https://www.theguardian.com/world/2024/dec/25/russia-christmas-day-attack-ukraine-energy-system"
  },
  {
    "text": "‘I Probably Could Have Flipped Over a Few More Tables’  —  Outgoing Rep. Cori Bush gets candid about her time in Congress and how progressives should respond to 2024.  —  Rep. Cori Bush was swept into office in 2020 on a wave of liberal energy, defeating a longtime Democratic incumbent … ",
    "url": "https://www.politico.com/news/magazine/2024/12/25/cori-bush-congress-exit-interview-00195630"
  },
  {
    "text": "It's official: Biden signs new law, designates bald eagle as ‘national bird’  —  Bald eagle officially named U.S. national bird  —  The White House announced on Christmas Eve President Joe Biden signed a bill officially designating the bald eagle as the national bird.",
    "url": "https://www.foxnews.com/politics/its-official-biden-signs-new-law-designates-bald-eagle-national-bird"
  },
  {
    "text": "Sen. Kyrsten Sinema's recent lavish travel expenses broke the law, watchdog group alleges  —  A government watchdog group has filed a complaint against Sen. Kyrsten Sinema, alleging that her recent pricey travel expenditures broke campaign-finance laws.  —  The nonprofit Citizens … ",
    "url": "https://www.azcentral.com/story/news/politics/elections/2024/12/24/kyrsten-sinemas-illegal-travel-spending-allegations/77180639007/"
  },
  {
    "text": "Letter urging residents to report ‘brown folks’ condemned by Oregon officials  —  Oregon officials called the anonymous letter “racist.”  —  Oregon state flag waving in the wind.  —  Several officials in Lincoln County, Oregon have received an anonymous letter urging people to report … ",
    "url": "https://abcnews.go.com/US/letter-urging-residents-report-brown-folks-condemned-oregon/story?id=117082954"
  },
  {
    "text": "Major international crisis ‘much more likely’ in Trump's second term, says his ex-national security adviser  —  John Bolton delivers scathing critique of Trump's lack of knowledge or coherent strategy: 'I'm very worried'  —  A major international crisis is “much more likely” … ",
    "url": "https://www.theguardian.com/us-news/2024/dec/24/donald-trump-john-bolton-crisis-likely"
  },
  {
    "text": "Trump and Musk Want to Cut Billions From the Budget.  It Won't Be Easy.  —  Efforts to cut government spending and eliminate waste are dwarfed by the rising costs of the social safety net programs and interest expenses.  —  When Elon Musk and Vivek Ramaswamy, the businessmen … ",
    "url": "https://www.nytimes.com/2024/12/24/business/trump-musk-ramaswamy-doge-government-spending.html"
  },
  {
    "text": "Rep. Granger's Hill absence, revelation of ‘dementia issues’ reignite age debate  —  The 81-year-old congresswoman's situation reanimated a simmering discussion over the health and mental acuity of aging elected officials, with several of Granger's colleagues calling for changes and raising worries about the nation's oldest leaders.",
    "url": "https://www.washingtonpost.com/politics/2024/12/24/kay-granger-texas-congresswoman-age-facility/"
  }
]