[
  {
    "text": "The Ten Commandments must be displayed in Louisiana classrooms under requirement signed into law  —  Louisiana has become the first state to require that the Ten Commandments be displayed in every public school classroom under a bill signed into law by Republican Gov. Jeff Landry on Wednesday.",
    "url": "https://apnews.com/article/louisiana-ten-commandments-displayed-classrooms-571a2447906f7bbd5a166d53db005a62"
  },
  {
    "text": "The Supreme Court's approach on ‘history and tradition’ is irking Amy Coney Barrett  —  On a Supreme Court where the conservative supermajority increasingly leans on history as a guide, a dispute may be simmering over how many modern cases can be resolved by looking to the nation's past.",
    "url": "https://www.cnn.com/2024/06/19/politics/amy-coney-barrett-clarence-thomas-originalism"
  },
  {
    "text": "Amy Coney Barrett may be poised to split conservatives on the Supreme Court  —  Legal experts see signs of a “raging” philosophical debate among the court's supermajority.  —  A rift is emerging among the Supreme Court's conservatives — and it could thwart the court's recent march to expand gun rights.",
    "url": "https://www.politico.com/news/2024/06/19/amy-coney-barrett-supreme-court-conservatives-rift-00164047"
  },
  {
    "text": "“In Mike I trust”: Biden's faith-based campaign … - But that puts them on an island within much of the party about what will decide the election, as polls consistently have shown Biden tied or behind even after a slight bump following Trump's criminal conviction.",
    "url": "https://www.axios.com/2024/06/19/biden-faith-campaign-mike-donilon-2024-election"
  },
  {
    "text": "Biden's ads haven't been working.  Now, he's trying something new.  —  The president has been massively outspending Donald Trump on the airwaves and still losing. … President Joe Biden's odds of reelection may be worse than they look.  And they don't look great.  —  The 2024 presidential race remains very close.",
    "url": "https://www.vox.com/politics/355756/joe-biden-campaign-ad-trump-convicted-criminal"
  },
  {
    "text": "How the NFL's ‘Worst-Ever’ Owner is Blocking Movie Showing ‘Rapist’ Trump  —  OF COURSE HE IS  —  Former Washington Commanders owner Dan Snyder might be able to stop “The Apprentice” from hitting screens thanks to a bizarre twist: He helped finance the movie.",
    "url": "https://www.thedailybeast.com/how-dan-snyder-is-trying-to-block-trump-biopic-the-apprentice-from-theaters"
  },
  {
    "text": "Boeing committed ‘the deadliest corporate crime in US history’ and should be fined $24 billion, victims' families say  —  New York CNN  —  Families that lost loved ones in two Boeing 737 Max crashes said on Wednesday that the company committed the “deadliest corporate crime in US history” … ",
    "url": "https://www.cnn.com/2024/06/19/business/boeing-families-lawsuit/"
  },
  {
    "text": "Scoop: White House cancels meeting, scolds Netanyahu in protest over video … - “This decision makes it clear that there are consequences for pulling such stunts,” a U.S. official said.  — “The Americans are fuming. … - Some Israeli officials were already en route to Washington when the meeting was cancelled.",
    "url": "https://www.axios.com/2024/06/19/netanyahu-video-biden-cancels-iran-meeting"
  },
  {
    "text": "Stonehenge covered in powder paint by Just Stop Oil  —  Part of Stonehenge has been covered in orange powder paint by protesters.  —  Two Just Stop Oil campaigners sprayed the powder paint on the historic site near Salisbury, Wiltshire, at about 12:00 BST on Wednesday.",
    "url": "https://www.bbc.com/news/articles/cw44mdee0zzo"
  },
  {
    "text": "Witness tells House Ethics Committee that Matt Gaetz paid her for sex: Sources  —  The committee has interviewed at least half a dozen women who were witnesses.  —  Rep. Matt Gaetz looks on during a news conference about unidentified aerial phenomena (UAP) transparency on Capitol Hill in Washington, D.C., Nov. 30, 2023.",
    "url": "https://abcnews.go.com/US/witness-tells-house-ethics-committee-matt-gaetz-paid/story?id=111217102"
  },
  {
    "text": "ERO Baltimore arrests unlawfully present Salvadoran convicted of sexually assaulting Maryland minor  —  ELLICOTT CITY, Md. — Enforcement and Removal Operations Baltimore apprehended an unlawfully present 39-year-old Salvadoran national convicted of sexually assaulting a minor in Baltimore.",
    "url": "https://www.ice.gov/news/releases/ero-baltimore-arrests-unlawfully-present-salvadoran-convicted-sexually-assaulting"
  },
  {
    "text": "The deceptive Biden G7 video was quickly debunked, but it kept going viral anyway  —  Despite fact-checks online, Big Tech platforms continued to spread a misleading video of President Joe Biden.  —  Misleading videos and false claims that President Joe Biden wandered off aimlessly … ",
    "url": "https://www.nbcnews.com/tech/misinformation/biden-g7-video-joe-cheapfake-kept-going-viral-rcna157591"
  },
  {
    "text": "Something's Rotten About the Justices Taking So Long on Trump's Immunity Case  —  For those looking for the hidden hand of politics in what the Supreme Court does, there's plenty of reason for suspicion on Donald Trump's as-yet-decided immunity case given its urgency.",
    "url": "https://www.nytimes.com/2024/06/19/opinion/supreme-court-trump-immunity.html"
  },
  {
    "text": "This GOP-leaning political polling firm has turned into a purveyor of anti-vaccine propaganda  —  Rasmussen Reports used to be a fairly creditable and credible political polling organization, good enough to be included among the pollsters relied on by services such as FiveThirtyEight to give … ",
    "url": "https://www.latimes.com/business/story/2024-06-19/this-gop-leaning-polling-firm-has-turned-into-a-purveyor-of-anti-vaccine-propaganda"
  },
  {
    "text": "Sunak to lose seat in Tory wipeout, major poll predicts  —  Exclusive survey for The Telegraph also shows party on track to slump to 53 seats, with around three-quarters of Cabinet voted out  —  Rishi Sunak is predicted to become the first sitting prime minister ever to lose their seat at a general election.",
    "url": "https://www.telegraph.co.uk/politics/2024/06/19/rishi-sunak-to-lose-seat-tory-wipeout-major-poll-predicts/"
  },
  {
    "text": "US officials don't see clear path to ending war in Gaza as cease-fire talks stall  —  Biden officials say Hamas and Israel disagree on how to end all hostilities in Gaza.  —  Biden administration officials increasingly doubt that Israel and Hamas will reach a comprehensive cease-fire deal under … ",
    "url": "https://www.politico.com/news/2024/06/19/gaza-israel-cease-fire-talks-00164098"
  },
  {
    "text": "Two courts, two justice systems  —  Shock!  The U.S. Chamber of Commerce is treated substantially differently by today's federal court system than families with trans kids.  —  Just before the close of business Tuesday, items appeared on two court dockets with which Law Dork readers … ",
    "url": "https://www.lawdork.com/p/two-courts-two-justice-systems"
  },
  {
    "text": "Chemicals from East Palestine derailment spread to 16 US states, data shows  —  Rain and snow samples from Wisconsin to Maine and North Carolina after crash show highest pH levels over last decade  —  Chemicals released during the East Palestine train wreck fires in February 2023 in Ohio … ",
    "url": "https://www.theguardian.com/us-news/article/2024/jun/19/east-palestine-toxic-derailment-chemicals-spread"
  }
]