[
  {
    "text": "Trump ‘Tiny Hands’ Joke Rules Out VP Contender: Ex-Aide  —  Anthony Scaramucci said that Donald Trump will pick “a white guy” to be his running mate.  —  FREE SPEECH?  —  Attendees of a May 31 panel on antisemitism at a Columbia University alumni event captured pictures of texts … ",
    "url": "https://www.thedailybeast.com/trump-tiny-hands-joke-rules-out-vp-contender-marco-rubio-says-anthony-scaramucci"
  },
  {
    "text": "Trump Just Revealed How He'll Attack Biden at Debate—and It's Vile  —  You can't say you weren't warned: At the upcoming presidential debate on June 27, Donald Trump plans to highlight a handful of horrific murders—allegedly by undocumented migrants—and blame them on President Biden.",
    "url": "https://newrepublic.com/article/182993/trump-biden-debate-attack"
  },
  {
    "text": "Here's How Biden Could Rattle Trump in Their First Debate  —  My opponent likes to pose as a tough guy.  But where I come from—and it may be old-fashioned—if you lose, you take the hit.  You don't whine and cry about it and blame everybody else.  You take responsibility, you move on.",
    "url": "https://link.motherjones.com/public/35799406"
  },
  {
    "text": "Trump keeps flip-flopping his policy positions after meeting with rich people  —  Top CEOs were seen nodding their heads when Trump talked about finding ways to keep American-educated talent at home.  —  Donald Trump privately hinted at a shift in immigration policy at a Business Roundtable meeting last week.",
    "url": "https://www.politico.com/news/2024/06/22/trump-policy-flip-flop-00164538"
  },
  {
    "text": "DeSantis Vetoes All Arts Grants in Florida  —  Gov. Ron DeSantis gave no explanation for zeroing out the $32 million in grants that were approved by state lawmakers.  —  For the past 10 days, Richard Russell has been rattled, poring over budgets and working the phones in an attempt to limit … ",
    "url": "https://www.nytimes.com/2024/06/21/arts/ron-desantis-veto-arts-funding-florida.html"
  },
  {
    "text": "Florida Dems Hope Fourth Time Is A Charm Against Rick Scott And His Bank Account  —  The U.S. senator and former governor has won all three of his statewide races, but never by more than a single percentage point.  —  TAMPA, Fla. — As Democrats gear up for yet another run … ",
    "url": "https://www.huffpost.com/entry/mucarsel-powell-rick-scott-florida-abortion_n_66748780e4b043a634bd9ea9"
  },
  {
    "text": "Who Is on Donald Trump's Revenge List?  —  One of the central themes of Donald Trump's 2024 presidential campaign has been the desire for vengeance against those who he believes have done him and the country wrong.  “I am your retribution,” has become a staple of his stump speech, and it's not just rhetoric.",
    "url": "https://nymag.com/intelligencer/article/who-is-donald-trump-planning-revenge-against.html"
  },
  {
    "text": "Bernie shreds billionaires backing Trump: 'They'd rather give up democracy than take a hit'  —  Sen. Bernie Sanders joins Chris Hayes to discuss the billionaires flocking back to Donald Trump: “At a time when we have so much greed out there, when the religion of the billionaire class is greed … ",
    "url": "https://www.msnbc.com/all-in/watch/bernie-shreds-billionaires-backing-trump-they-d-rather-give-up-democracy-than-take-a-hit-213481029702"
  },
  {
    "text": "Bowman, in Fight for His Political Life, Embraces the Left's Star Power  —  Representative Alexandria Ocasio-Cortez and Senator Bernie Sanders rallied with Jamaal Bowman on Saturday, three days before the primary on Tuesday.  —  He cracked jokes on “The Late Show With Stephen Colbert,” … ",
    "url": "https://www.nytimes.com/2024/06/22/nyregion/bowman-aoc-bernie.html"
  },
  {
    "text": "Trump campaign seeks to head off convention revolt from its right flank  —  Aides scrambled to foil a plot to throw the nominating process into chaos as suspicions abound about potentially disloyal delegates.  —  PHOENIX — Arizona delegates to the Republican National Convention gathered … ",
    "url": "https://www.washingtonpost.com/politics/2024/06/22/trump-convention-revolt-right-wing-arizona/"
  },
  {
    "text": "A GOP Lawmaker Was Arrested After Chasing a Stripper With a Gun in the Middle of the Night  —  On Wednesday, no less credible a source than Slate.com announced that Lansing, Michigan, is the most relevant bellwether population center in the country.  Where goeth Lansing, so goeth the nation, we say.",
    "url": "https://slate.com/news-and-politics/2024/06/neil-friske-arrest-michigan-representative-gun-adult-dancer-stripper.html"
  },
  {
    "text": "Sotomayor Issues Dire Warning on Supreme Court Ruling on Noncitizens … In a ruling delivered Friday, the Supreme Court decided 6-3 that U.S. citizens have no constitutional interest in their noncitizen spouses being able to enter the United States—despite the fact that a married person … ",
    "url": "https://newrepublic.com/post/182960/supreme-court-sotomayor-non-citizens-marriage-munoz-obergefell"
  },
  {
    "text": "Texas Congressman Won't Stop Wearing Combat Infantryman Badge that Was Revoked  —  More than a month after a news report revealed that the Combat Infantryman Badge Rep. Troy Nehls, R-Texas, wears on his lapel was revoked since he was never eligible for the award to begin with, the congressman refuses to take the pin off.",
    "url": "https://www.military.com/daily-news/2024/06/21/texas-congressman-wont-stop-wearing-combat-infantryman-badge-was-revoked.html"
  },
  {
    "text": "The establishment wins: Primary voters keep backing incumbents  —  Democratic and GOP incumbents have been winning most of their primaries despite deep voter frustration toward Washington.  —  In a year filled with voter anger toward Washington, Reps. Tom Cole and Gerry Connolly seemed … ",
    "url": "https://www.washingtonpost.com/politics/2024/06/22/primary-elections-incumbents/"
  },
  {
    "text": "Pro-Ted Cruz group draws scrutiny for receiving money from his podcast's company  —  Campaign finance experts have questioned whether the arrangement runs afoul of a ban on candidates directing money to super PACs that can raise unlimited amounts of money.  —  A super PAC supporting … ",
    "url": "https://www.washingtonpost.com/elections/2024/06/22/ted-cruz-podcast-super-pac/"
  }
]