[
  {
    "text": "Pennsylvania conservatives panicked Trump is ‘not even trying’ to win key voting bloc  —  Conservatives in Pennsylvania are growing increasingly alarmed that Donald Trump is not making a concerted effort to win the state's 19 Electoral College votes which could mean the difference between … ",
    "url": "https://www.rawstory.com/trump-pennsylvania-2668983435/"
  },
  {
    "text": "‘This was a coup.’ Trump primes supporters to challenge a Harris win.  —  Amid a tight presidential race, Donald Trump has tried to delegitimize Kamala Harris's nomination and undermine confidence in this year's election.  —  From the moment Vice President Kamala Harris emerged … ",
    "url": "https://www.washingtonpost.com/politics/2024/08/19/trump-stolen-election-coup-overthrow/"
  },
  {
    "text": "The election is extremely close  —  Harris is winning — but her strategy still seems a little complacent  —  Kamala Harris has pulled off a virtuosic political performance this summer.  In the immediate aftermath of Joe Biden's debate fiasco, the Democratic Party was paralyzed … ",
    "url": "https://www.slowboring.com/p/the-election-is-extremely-close"
  },
  {
    "text": "Harris implies Trump a ‘coward’ during Pennsylvania campaign appearance  —  U.S. Vice President Kamala Harris indirectly criticized former President Donald Trump on Sunday, suggesting her opponent in the Nov. 5 election was a “coward” whose politics focused on putting down rivals.",
    "url": "https://www.reuters.com/world/us/harris-campaigns-swing-state-pennsylvania-en-route-chicago-convention-2024-08-18/"
  },
  {
    "text": "Trump 'might win, but he's not a majority candidate': Brit Hume  —  Fox News chief political analyst Brit Hume on Sunday argued that while former President Trump could win the November election, voters' dislike of him makes him “not a majority candidate.”  —  When asked on “Fox News Sunday” … ",
    "url": "https://thehill.com/homenews/campaign/4833904-donald-trump-not-majority-candidate-brit-hume/"
  },
  {
    "text": "Playbook: Biden's day to bask  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  Greetings from Chicago, where the Democratic National Convention kicks off in a few hours, marking another milestone in this crazy presidential election year.",
    "url": "https://www.politico.com/newsletters/playbook/2024/08/19/bidens-day-to-bask-00174559"
  },
  {
    "text": "Scoop: Harris-Walz probes ignite House GOP divisions … - One House Republican, speaking on the condition of anonymity to critique their party's investigations, said the probes are “unnecessary.”  — “We have an election to win. … - Rep. Don Bacon (R-Neb.) argued that investigating Harris and Walz is … ",
    "url": "https://www.axios.com/2024/08/19/harris-walz-house-republican-investigations"
  },
  {
    "text": "DNC lineup: Who's speaking and what to expect … - Monday, “For the People”: Biden and Dr. Jill Biden speak, along with former Secretary of State Hillary Clinton and a welcome from Chicago Mayor Brandon Johnson.  — Tuesday, “A Bold Vision for America's Future”: Former President Obama … ",
    "url": "https://www.axios.com/2024/08/18/dnc-speaker-schedule-obama-biden"
  },
  {
    "text": "FBI arrests D.C. Council member Trayon White  —  The nature of the allegations against White, a Democrat representing Ward 8, were not immediately clear.  The FBI declined to comment.  —  The FBI arrested D.C. Council member Trayon White Sr. on Sunday, according to the council's chairman … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2024/08/18/trayon-white-dc-arrested-fbi/"
  },
  {
    "text": "Election Deniers Secretly Pushed Rule That Would Make It Easier to Delay Certification of Georgia's Election Results  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up for Dispatches, a newsletter that spotlights wrongdoing around the country, to receive our stories in your inbox every week.",
    "url": "https://www.propublica.org/article/georgia-election-board-vote-certification"
  },
  {
    "text": "Gouging out the truth  —  In a speech on Friday, Vice President Kamala Harris fleshed out some of the economic policies she would pursue if she won the presidency in November.  Harris spoke briefly about her plans to crack down on price gouging in the grocery industry.",
    "url": "https://popular.info/p/gouging-out-the-truth"
  },
  {
    "text": "Republicans flood TV with misleading ads about immigration, border  —  Turn on reduced motion Scroll to continue  —  Throughout the year, American airwaves were inundated by campaign advertising mentioning immigration, placing the issue at the center of this year's elections.",
    "url": "https://www.washingtonpost.com/elections/interactive/2024/republican-campaign-ads-immigration-border-security/"
  },
  {
    "text": "McCarthy's last flop … - Rep. Matt Gaetz (R-Fla.) is expected to win easily on Tuesday despite a McCarthy-linked PAC spending more than $3 million against him.  — “McCarthy thinks about me a lot more than I think about him,” Gaetz told us. … - “[W]hen you leave, you should go off to do the next thing you're going to do.",
    "url": "https://www.axios.com/2024/08/18/kevin-mccarthy-house-speaker-gaetz-elections"
  },
  {
    "text": "Secret Service finds protecting Trump is extraordinarily challenging  —  Trump's team has complained in the wake of an assassination attempt that earlier requests for additional resources had been denied, while agency officials say he receives a heavier level of security than any other former president.",
    "url": "https://www.washingtonpost.com/politics/2024/08/19/trump-secret-service-assassination-security/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzIzOTUzNjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI1MzM1OTk5LCJpYXQiOjE3MjM5NTM2MDAsImp0aSI6ImRiOTU4MmMyLWE1ZmItNDljMC04NzhlLTA5ZjExYTUwMDFlZSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzA4LzE5L3RydW1wLXNlY3JldC1zZXJ2aWNlLWFzc2Fzc2luYXRpb24tc2VjdXJpdHkvIn0.t2pmoAQ10wV-EUNrzBV33tgOhlzSw3-VbVsV7peMPPM&itid=gfta"
  },
  {
    "text": "Inside Kamala Harris's Enormous Fundraising Drive  —  Donors have taken a give-money-now, ask-questions-later approach to fueling the Democratic ticket  —  Heather Ahern Huish was so elated when she read online that President Biden was endorsing Kamala Harris for the White House … ",
    "url": "https://www.wsj.com/politics/elections/kamala-harris-fundraising-donors-election-2024-724da4f6"
  },
  {
    "text": "Russia Bans George and Amal Clooney's Foundation as ‘Undesirable’  —  SHUT DOWN  —  It's not a word typically associated with the couple.  —  Russian authorities on Monday declared George Clooney's nonprofit “undesirable,” effectively blocking it from operating inside the country.",
    "url": "https://www.thedailybeast.com/russia-bans-george-and-amal-clooneys-foundation-for-justice-as-undesirable"
  }
]