[
  {
    "text": "Republicans Are Cutting Medicare.  Not Only Medicaid, Medicare.  —  Passage of the Big Beautiful Bill will force mandatory sequestration that will mean half a trillion dollars in Medicare cuts.  —  House Speaker Mike Johnson (R-LA) speaks with reporters ahead of a final vote … ",
    "url": "https://prospect.org/politics/2025-07-03-republicans-cutting-medicare-not-only-medicaid/"
  },
  {
    "text": "House passes sprawling domestic policy bill, sending it to Trump's desk  —  The Republican package would slash taxes, boost spending on immigration enforcement and the military, and impose steep cuts to Medicaid, SNAP and clean energy funding.  —  WASHINGTON — The Republican-controlled House … ",
    "url": "https://www.nbcnews.com/politics/congress/house-final-vote-trump-big-beautiful-bill-republicans-rcna216626"
  },
  {
    "text": "What Trump Told Me About His Complete Domination of Congress  —  Demanding a bill by Independence Day was a telling flourish for someone with zero tolerance for independence in the legislative branch.  —  When I reached President Donald Trump by phone Tuesday night, with his “big, beautiful” … ",
    "url": "https://www.politico.com/news/magazine/2025/07/03/trump-interview-megabill-rachael-bade-00438195"
  },
  {
    "text": "SCOTUS allows Trump admin to send eight men to South Sudan with no process  —  The U.S. Supreme Court issued an order on Thursday that will empower the Trump administration to send people subject to deportation to countries they have no connection with that are so dangerous the Trump administration advises Americans not to travel there.",
    "url": "https://www.lawdork.com/p/scotus-allows-trump-admin-to-send"
  },
  {
    "text": "They Savaged Their Party's Bill.  Then They Voted for It.  —  Many Republicans had harshly criticized President Trump's marquee bill extending tax cuts and slashing social safety net programs — almost right up until the moment they voted for it.  —  In the days leading up to House passage … ",
    "url": "https://www.nytimes.com/2025/07/03/us/politics/republican-criticism-trump-policy-bill.html"
  },
  {
    "text": "House passes tax and immigration bill, sending it to Trump's desk  —  Legislation to extend tax cuts and fund border and defense programs would increase the national debt by close to $4 trillion over the next decade.  —  Republicans on Thursday notched the first major legislative victory … ",
    "url": "https://www.washingtonpost.com/business/2025/07/03/trump-tax-bill-house/"
  },
  {
    "text": "Trump and Putin Discuss Iran and Ukraine in Phone Call  —  The measure extending tax cuts and slashing the social safety net goes to President Trump for his signature, but the debate over it exposed deep rifts in his party.  —  Here's the latest.  —  The House on Thursday narrowly passed … ",
    "url": "https://www.nytimes.com/live/2025/07/03/us/trump-news-policy-bill"
  },
  {
    "text": "Hakeem Jeffries breaks the House record for longest floor speech  —  Democratic Leader Hakeem Jeffries delivered the longest speech in House history Thursday, holding the floor for well over eight hours to delay passage of Republicans' domestic policy megabill.",
    "url": "https://www.politico.com/live-updates/2025/07/03/congress/hakeem-jeffries-longest-house-speech-00438933"
  },
  {
    "text": "Supreme Court paves the way for Trump to send migrants to South Sudan  —  The Justice Department had sought clarification of a recent Supreme Court decision that cleared the path for the administration to quickly deport immigrants to “third countries.”  —  WASHINGTON — The Supreme Court … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-trump-send-migrants-south-sudan-djibouti-rcna214952"
  },
  {
    "text": "Mamdani Identified as Asian and African American on College Application  —  Zohran Mamdani, the Democrat running for mayor of New York City, was born in Uganda.  He doesn't consider himself Black but said the application didn't allow for the complexity of his background.",
    "url": "https://www.nytimes.com/2025/07/03/nyregion/mamdani-columbia-black-application.html?unlocked_article_code=1.Tk8.dq-_.OgG4Ktak82Hp&smid=url-share"
  },
  {
    "text": "Roughly 140 EPA staffers who signed ‘dissent’ letter are put on leave  —  Trump officials have placed 139 employees who signed a letter of dissent protesting the Environmental Protection Agency's current direction and policies on leave Thursday.  —  The Trump administration has placed … ",
    "url": "https://www.washingtonpost.com/climate-environment/2025/07/03/epa-dissent-letter-employees-leave/"
  },
  {
    "text": "Rural southwest Nebraska clinic closes, blaming expected Medicaid cuts  —  LINCOLN, Neb. (KLKN) — A clinic in southwest Nebraska announced Wednesday that it is closing due to financial challenges, including anticipated Medicaid cuts.  —  McCook-based Community Hospital said it is shutting … ",
    "url": "https://www.klkntv.com/rural-southwest-nebraska-clinic-closes-blaming-expected-medicaid-cuts/"
  },
  {
    "text": "L.A. activist indicted after handing out face shields to anti-ICE protesters  —  A local activist who handed out protective face shields to protesters last month during demonstrations against the Trump administration's chaotic immigration raids was indicted by a federal grand jury Wednesday.",
    "url": "https://www.latimes.com/california/story/2025-07-03/activist-indicted-face-shields-protests"
  },
  {
    "text": "CBS News anchor swipes at parent company for settling Trump lawsuit ‘it said is without basis in law and fact’  —  'Can you hold power to account after paying it millions?  Can an audience trust you when it thinks you've traded away that trust?'  John Dickerson asked viewers on Wednesday.",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/cbs-john-dickerson-paramount-trump-settlement-b2782199.html"
  },
  {
    "text": "Conservative Arizona Supreme Court Justice Clint Bolick has a warning for America  — Arizona Supreme Court Justice Clint Bolick criticized attacks on the American justice system by senior Trump administration officials.  — Bolick expressed concern over a disregard for due process and threats to suspend habeas corpus.",
    "url": "https://www.azcentral.com/story/news/local/arizona/2025/07/03/arizona-supreme-court-justice-warning/84290154007/"
  },
  {
    "text": "Medicaid, food aid recipients worry about safety net cuts in bill sent to Trump  —  Supporters of the sweeping tax and spending legislation that Congress has sent to President Donald Trump say the changes to Medicaid, food aid and other programs will encourage personal responsibility and halt those scamming the system.",
    "url": "https://apnews.com/article/big-bill-medicaid-snap-food-trump-congress-4e1826a670b5eb2b802f08adc1c325a2"
  },
  {
    "text": "US military says 200 Marines being sent to support ICE in Florida  —  The U.S. military said on Thursday it will send 200 Marines to Florida to provide administrative and logistical support to Immigrations and Customs Enforcement.  —  The Marines are the first wave of U.S. Northern Command's support … ",
    "url": "https://www.reuters.com/world/us/us-military-says-200-marines-being-sent-support-ice-florida-2025-07-03/"
  },
  {
    "text": "CIA review of 2016 Russia election probe finds no major flaws … The eight-page review is the latest episode in a long-running saga over a Russian influence campaign that officials have said sought to damage Hilary Clinton and aid Trump in an election that he ultimately won by a narrow margin … ",
    "url": "https://www.politico.com/news/2025/07/02/cia-review-of-2016-russia-election-probe-finds-no-major-flaws-00438159"
  },
  {
    "text": "Conservative litigator Paul Clement to defend Maryland federal judges in DOJ case  —  Prominent conservative U.S. Supreme Court advocate Paul Clement has been retained by the federal judges in Maryland to defend them in an unusual lawsuit filed by President Donald Trump's administration … ",
    "url": "https://www.reuters.com/legal/government/conservative-litigator-paul-clement-defend-maryland-federal-judges-doj-case-2025-07-03/"
  },
  {
    "text": "Here are the Declaration of Independence's Grievances Against King George III.  Many Apply to Trump.  —  It's uncanny.  —  When Thomas Jefferson was writing the Declaration of Independence in the weeks leading up July 4, 1776, he wanted to not only rely on just high-falutin enlightenment ideals … ",
    "url": "https://www.motherjones.com/politics/2025/07/declaration-of-independences-grievances-against-king-george-iii-many-apply-to-trump/"
  },
  {
    "text": "First immigration detainees arrive at Florida center in the Everglades  —  The first group of immigrants has arrived at a new detention center deep in the Florida Everglades that officials have dubbed “Alligator Alcatraz,” a spokesperson for Republican state Attorney General James Uthmeier told The Associated Press.",
    "url": "https://apnews.com/article/alligator-alcatraz-immigration-detainees-florida-56670910db4c88800d9df42ac3ce7f91"
  },
  {
    "text": "Planned Parenthood pledges to sue Trump administration over megabill funding cut  —  Planned Parenthood has vowed to take the Trump administration to court over a provision in the newly-passed megabill that would “defund” the nonprofit for up to one year.  Alexis McGill Johnson … ",
    "url": "https://www.politico.com/live-updates/2025/07/03/congress/planned-parenthood-trump-lawsuit-00439702"
  },
  {
    "text": "Legal experts say journalist's arrest violated First Amendment  —  When Atlanta journalist Mario Guevara was arrested while filming an anti-ICE protest on June 14, he repeatedly identified himself as press.  He wore a vest marked “PRESS.”  And he was recording — not protesting.",
    "url": "https://atlantaciviccircle.org/2025/07/02/journalists-arrest-violated-first-amendment-mario-guevara/"
  },
  {
    "text": "Supreme Court to consider reviving Mississippi evangelist's challenge to protest ordinance  —  The Supreme Court on Thursday said it will consider reviving an evangelist's challenge to a Mississippi city's protest ordinance.  —  Gabriel Olivier, a self-described Christian called to evangelize … ",
    "url": "https://thehill.com/regulation/court-battles/5383473-supreme-court-evangelists-challenge/"
  }
]