[
  {
    "text": "Biden staff “miserable,” alarmed as pressure builds … “Even if you're trying to focus on work, nothing is going to break through or get any acknowledgment” from bosses.  —  A high-ranking Democratic National Committee official told Axios: “The only thing that can really allay concerns … ",
    "url": "https://www.axios.com/2024/07/05/biden-staffs-white-house-dnc-campaign-miserable-2024"
  },
  {
    "text": "Behind the Curtain: Trump's Kamala Harris plan … President Biden insisted again Thursday in an unscripted remark, after a supporter at a Fourth of July event on the White House South Lawn yelled that they needed him, and to keep up the fight: “You got me, man!  I'm not going anywhere.”",
    "url": "https://www.axios.com/2024/07/05/behind-the-curtain-trumps-kamala-harris-plan"
  },
  {
    "text": "Varying Treatment of Biden and Trump Puts Their Parties in Stark Relief  —  Republicans and Democrats live in radically different universes, interpreting the same set of facts through radically different lenses.  —  One of America's political parties has a presidential candidate who is really old and showing it.",
    "url": "https://www.nytimes.com/2024/07/05/us/politics/biden-trump-parties.html"
  },
  {
    "text": "Democrats start moving to Harris as Biden digs in  —  Amid the ongoing fallout from Joe Biden's debate performance, talk in many top Democratic circles has already moved to who Kamala Harris' running mate would be.  —  That's how certain a widening group of leading party officials … ",
    "url": "https://www.cnn.com/2024/07/05/politics/kamala-harris-democrats-biden/"
  },
  {
    "text": "Playbook: The biggest interview of Joe Biden's life  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  DEMOCRACY IN THE U.K. — The Labour Party is back in power after 14 years in the political wilderness following a landslide election victory … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/07/05/the-biggest-interview-of-joe-bidens-life-00166605"
  },
  {
    "text": "A Third House Democrat, Seth Moulton, Calls on Biden to Drop Out  —  Representative Lloyd Doggett was the first sitting House Democrat to urge President Biden to leave the race, followed by Representative Raúl M. Grijalva.  —  Representative Seth Moulton of Massachusetts called … ",
    "url": "https://www.nytimes.com/2024/07/05/us/politics/democrat-seth-moulton-biden-drop-out.html"
  },
  {
    "text": "MAGA ‘freak out’ starts as Trump game plan threatens to ‘backfire’: analyst  —  A controversial campaign tactic is backfiring on former President Donald Trump as powerful celebrities warn of a imminent authoritarian regime that could put an end to “recreational sex” as part of a “fascistic game plan … ",
    "url": "https://www.rawstory.com/trump-project-2025-2668691343/"
  },
  {
    "text": "Project 2025 was supposed to boost Donald Trump's campaign — but it may be backfiring instead  —  Trump's authoritarian game plan is breaking through the post-debate noise and it's starting to scare people  —  When Project 2025 was released, a number of progressives expressed surprise … ",
    "url": "https://www.salon.com/2024/07/05/project-2025-was-supposed-to-boost-donald-campaign--but-it-may-be-backfiring-instead/"
  },
  {
    "text": "Trump torches Heritage Foundation's Project 2025 … - Trump's disavowal comes two days after Heritage Foundation president Kevin Roberts drew outrage from Democrats with his comments about a “second American Revolution” on Steve Bannon's radio show.  — “[W]e are in the process … ",
    "url": "https://www.axios.com/2024/07/05/trump-project-2025-heritage-foundation"
  },
  {
    "text": "MAGA Gov Candidate's Ugly, Hateful Rant: “Some Folks Need Killing!”  —  Mark Robinson, the extremist GOP nominee for governor in North Carolina, appeared to endorse political violence in a bizarre and extended rant he delivered on June 30 in a small-town church.  —  “Some folks need killing!”",
    "url": "https://newrepublic.com/article/183443/mark-robinson-north-carolina-gov-candidate-hateful-rant-killing"
  },
  {
    "text": "Donald Trump Claims Republicans' Project 2025 has Nothing to Do With Him: ‘Abysmal’  —  OK, SURE  —  The 900-page conservative wish-list includes a massive abortion crackdown.  Now Trump claims he knows nothing about it.  —  Donald Trump rushed to distance himself from the Republicans … ",
    "url": "https://www.thedailybeast.com/donald-trump-claims-republicans-project-2025-has-nothing-to-do-with-him-abysmal"
  },
  {
    "text": "Wisconsin Supreme Court changes course, will allow expanded use of ballot drop boxes this fall  —  MADISON, Wis. (AP) — The Wisconsin Supreme Court ruled Friday that officials can place ballot drop boxes around their communities in this fall's elections, overturning its own ruling … ",
    "url": "https://apnews.com/article/wisconsin-supreme-court-ballot-drop-boxes-2024-9d3973ea65b78436df478e7d8ae28cce"
  },
  {
    "text": "Tempers flare as Trump team revises abortion plank for Republican platform  —  The former president wants the platform to endorse leaving the issue to the states rather than a federal ban in the wake of Roe v. Wade's demise.  —  Top advisers to Donald Trump have begun to discuss draft language … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/05/trump-abortion-republican-platform/"
  },
  {
    "text": "Vatican excommunicates ex-ambassador to U.S., Archbishop Carlo Maria Viganò, declares him guilty of schism  —  A firebrand conservative who became one of Pope Francis' most ardent critics has been excommunicated by the Vatican.  —  Archbishop Carlo Maria Viganò … ",
    "url": "https://www.cbsnews.com/news/vatican-carlo-maria-vigano-pope-francis-excommunicated-schism/"
  },
  {
    "text": "Ex-Trump Staffer Alleges Campaign Settled Seedy Suits in Bombshell Filing  —  ‘TELL ME THE TRUTH’  —  The texts, allegedly between A.J. Delgado and Jenna Ellis, claimed Donald Trump's campaign paid off a number of lawsuits for what could be a high-profile adviser.",
    "url": "https://www.thedailybeast.com/ex-trump-staffer-alleges-campaign-settled-seedy-suits-in-bombshell-filing"
  }
]