[
  {
    "text": "Fulton County special grand jury recommended charges against Lindsey Graham, David Perdue and Kelly Loeffler  —  The special grand jury in Fulton County investigating the 2020 presidential election in Georgia recommended charges against Republican Sen. Lindsey Graham of South Carolina … ",
    "url": "https://www.cnn.com/2023/09/08/politics/fulton-county-special-grand-jury-report/"
  },
  {
    "text": "Grand jury called for indicting Sens. Graham, Perdue, Loeffler in Trump Georgia election case  — The full special grand jury report that previewed the criminal indictment of former President Donald Trump and 18 others for trying to overturn his loss in the 2020 Georgia election was released.",
    "url": "https://www.cnbc.com/2023/09/08/trump-georgia-election-case-special-grand-jury-report-release-set.html"
  },
  {
    "text": "BREAKING: Fulton special grand jury recommended 39 indictments  —  X  —  Members of the Fulton County special purpose grand jury that investigated interference in Georgia's 2020 presidential election recommended that 39 people be indicted for alleged crimes, including former President Donald Trump … ",
    "url": "https://www.ajc.com/politics/breaking-fulton-special-grand-jury-recommended-dozens-of-indictments/EGPPH6ER7RCNZCOSSULHQVCRQM/"
  },
  {
    "text": "Trump overstated net worth by up to $3.6 billion each year, NY attorney general alleges in new filing  — Former President Donald Trump's net worth was inflated by billions of dollars each year more than the New York attorney general's office originally estimated, the office alleged in a new court filing.",
    "url": "https://www.cnbc.com/2023/09/08/trump-overstated-net-worth-by-up-to-3point6-billion-per-year-ny-ag-alleges-in-new-filing.html"
  },
  {
    "text": "Trump Inflated His Assets Up to $3.6 Billion, New York AG Claims  —  Previously accusing Trump of inflating his assets up to $2.2 billion in a year, New York AG Letitia James now says that's a ‘conservative’ estimate  —  A Facebook icon representing an external link to share the article … ",
    "url": "https://themessenger.com/politics/trump-inflated-his-assets-up-to-3-6-billion-new-york-ag-claims"
  },
  {
    "text": "Republicans are trying to find a new term for ‘pro-life’ to stave off more electoral losses  —  Sen. Todd Young, R-Ind., summarized the closed-door meeting on Capitol Hill as being focused on “pro-baby policies.”  —  WASHINGTON — Republican strategists are exploring a shift away from … ",
    "url": "https://www.nbcnews.com/politics/congress/republicans-try-find-new-term-life-stave-electoral-losses-rcna103924"
  },
  {
    "text": "Kristi Noem is suddenly front and center in the veepstakes  —  The South Dakota governor will appear with Donald Trump at an event in Rapid City on Friday.  —  Not long ago, it looked like Kristi Noem's star was flaming out.  Following a turbulent first term, the South Dakota governor elected … ",
    "url": "https://www.politico.com/news/2023/09/08/kristi-noem-veepstakes-00114586"
  },
  {
    "text": "IRS cracking down on 1,600 millionaires over back taxes  —  The IRS is launching an initiative to crack down on 1,600 millionaires and 75 large businesses it says owe hundreds of millions of dollars in back taxes, the agency announced Friday.  —  The program takes advantage of additional funding … ",
    "url": "https://thehill.com/business/4193872-irs-cracking-down-on-1600-millionaires-over-back-taxes/"
  },
  {
    "text": "Another Christian influencer arrested for child abuse: Why conservatives keep falling for these cons  —  Ruby Franke was yet another Duggar knock-off, putting a shiny happy gloss on religious oppression  —  In many ways, it's the least surprising story of our times: A showily Christian … ",
    "url": "https://www.salon.com/2023/09/08/another-christian-influencer-arrested-for-child-abuse-why-conservatives-keep-falling-for-these-cons/"
  },
  {
    "text": "Samuel Alito says ‘no valid reason’ to step aside from Supreme Court case involving lawyer who interviewed him for WSJ  —  In the interviews, the conservative justice pushed back on claims of ethics violations and questioned whether Congress could legislate on the issue.",
    "url": "https://www.nbcnews.com/politics/supreme-court/samuel-alito-says-no-valid-reason-step-supreme-court-case-involving-la-rcna104082"
  },
  {
    "text": "Pence says he supports an impeachment inquiry by House Republicans  —  House Republicans are floating the possibility of an impeachment inquiry of President Biden  —  Former Vice President Pence said there is an “ethical cloud” hanging over the Biden family and President Biden's administration … ",
    "url": "https://www.foxnews.com/politics/pence-says-ethical-cloud-hangs-over-biden-family-would-support-an-impeachment-inquiry-by-house-gop"
  },
  {
    "text": "BLASTPASS: NSO Group iPhone Zero-Click, Zero-Day Exploit Captured in the Wild  —  Apple has just issued an update for Apple products including iPhones, iPads, Mac computers, and Apple Watches.  We encourage all users to immediately update their devices.  —  We urge all at-risk users … ",
    "url": "https://citizenlab.ca/2023/09/blastpass-nso-group-iphone-zero-click-zero-day-exploit-captured-in-the-wild/"
  },
  {
    "text": "Pelosi will seek reelection  —  The move would extend her 36-year House career and continue to freeze her would-be California successors in a long-standing holding pattern.  —  Nancy Pelosi isn't done yet.  —  The San Francisco Democrat and first female speaker of the House told volunteers … ",
    "url": "https://www.politico.com/news/2023/09/08/pelosi-will-seek-reelection-00114722"
  },
  {
    "text": "Protest Stops U.S. Open Semifinal Match  —  The delay of 49 minutes during the match between Coco Gauff and Karolina Muchova was caused by environmental protesters, including one who glued his feet to the ground.  —  The U.S. Open semifinal match on Thursday night between Coco Gauff … ",
    "url": "https://www.nytimes.com/2023/09/07/sports/tennis/protest-stops-us-open-semifinal-match.html"
  },
  {
    "text": "Take another look at Joe Biden.  His is the presidency progressives have been waiting for  —  With Trump looming, Biden could still lose the White House.  But this has been a transformative period of achievement  —  he tragedy of Joe Biden is that people see his age … ",
    "url": "https://www.theguardian.com/commentisfree/2023/sep/08/joe-biden-presidency-progressives-donald-trump"
  },
  {
    "text": "Trump Hates Hillary Clinton.  He Might Hate This Judge More.  —  Donald Trump's revenge lawsuit against Hillary Clinton has turned into a retaliatory plot against a judge he has history with.  And now he's testing his ability to target judges.  —  Donald Trump is still so bitter … ",
    "url": "https://www.thedailybeast.com/trump-hates-hillary-clinton-he-might-hate-this-judge-more"
  },
  {
    "text": "DeSantis voiced complaints about top super PAC strategist, people familiar with comments say  —  The Florida governor and White House hopeful was “apoplectic” over a pre-debate strategy memo publicly posted on the website of Jeff Roe's firm, according to one person familiar with the comments",
    "url": "https://www.washingtonpost.com/politics/2023/09/08/ron-desantis-super-pac-debate/"
  },
  {
    "text": "Newsom on a potential 2024 run: Not going to happen  —  “We need to move past this notion that [Joe Biden is] not going to run,” Newsom said.  —  California Gov. Gavin Newsom has a message to voters who think President Joe Biden won't run again.  —  “We need to move past this notion … ",
    "url": "https://www.politico.com/news/2023/09/08/newsom-biden-harris-2024-00114684"
  },
  {
    "text": "Appeals court temporarily stays order for Texas to remove buoy barrier  —  The ruling will allow Texas to keep the buoys in the Rio Grande while the court renders a full decision.  —  The 5th U.S. Circuit Court of Appeals on Thursday temporarily halted a district judge's order for Texas … ",
    "url": "https://www.politico.com/news/2023/09/07/appeals-court-temporarily-stays-order-for-texas-to-remove-buoy-barrier-00114631"
  },
  {
    "text": "The Supreme Court's Fake Praying Coach Case Just Got Faker  —  Last year, the Supreme Court ruled in favor of high school football coach's right to engage in “brief, quiet, personal” prayer—despite photographic evidence that his prayers were drawn-out, loud, and extremely public.",
    "url": "https://slate.com/news-and-politics/2023/09/supreme-court-praying-coach-joe-kennedy-fake.html"
  },
  {
    "text": "China's military seeks to exploit U.S. troops, veterans, general warns  —  A memo obtained by The Post says Beijing is working to enhance its armed forces by targeting Americans with specialized skills and training  —  China's military is conducting a sophisticated exploitation campaign designed to … ",
    "url": "https://www.washingtonpost.com/national-security/2023/09/08/china-military-exploit-us-troops-veterans/"
  },
  {
    "text": "FAA orders Musk's SpaceX to take 63 corrective actions on Starship, keeps rocket grounded  — The Federal Aviation Administration said Elon Musk's SpaceX must keep its Starship Super Heavy rocket grounded.  — The federal agency had been probing the April launch, which saw SpaceX's Starship explode in mid-flight.",
    "url": "https://www.cnbc.com/2023/09/08/faa-starship-grounded-corrective-action.html"
  }
]