[
  {
    "text": "How I Would Script This Moment for Biden and the Democrats  —  The Paley Center for Media just opened an exhibition celebrating the 25th anniversary of “The West Wing,” the NBC series I wrote from 1999 to 2003.  Some of the show's story points have become outdated in the last quarter-century … ",
    "url": "https://www.nytimes.com/2024/07/21/opinion/biden-west-wing-aaron-sorkin.html?unlocked_article_code=1.800.mJpZ.eTOV3Li2kEkN&smid=url-share"
  },
  {
    "text": "Trump's edge over Biden takes notable leap in Michigan, new battleground state poll shows  —  An exclusive new Free Press poll of likely Michigan voters shows former President Donald Trump has taken a notable 7-percentage-point lead over incumbent President Joe Biden in the state … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/07/21/michigan-poll-trump-biden-polling/74488606007/"
  },
  {
    "text": "Biden's Obama grudge drives 2024 resolve … - Many Obama advisers pressured Biden to not run in 2016 and Biden's resentment over that episode has diminished Obama's influence with Biden as the president contemplates his path forward.  — If Obama directly pushed Biden to not to run this time … ",
    "url": "https://www.axios.com/2024/07/21/biden-obama-2024-president-drop-out"
  },
  {
    "text": "For Biden, a Decision to Step Aside Would Raise Another Question  —  As President Biden grapples with the possibility of dropping his bid for re-election, a secondary question looms: Should he endorse his own vice president as the nominee?  —  President Biden has been saying some awfully nice things … ",
    "url": "https://www.nytimes.com/2024/07/21/us/politics/biden-harris-nomination.html"
  },
  {
    "text": "Trump favorability rises following shooting, majority of Americans want Biden to end campaign: POLL  —  More Americans also blame Trump for rise in political violence.  —  Republican presidential nominee and former President Donald Trump gives his acceptance speech at the Republican National Convention … ",
    "url": "https://abcnews.go.com/Politics/trump-favorability-rises-shooting-majority-americans-biden-end/story?id=112112043"
  },
  {
    "text": "Democratic Party chairs in 7 battleground states reaffirm support for Biden  —  WASHINGTON — Democratic Party chairs of seven critical battleground states Sunday reaffirmed their support for President Joe Biden, urging their fellow Democrats to focus on beating former President Donald Trump … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/07/21/dem-party-chairs-in-7-key-swing-states-reaffirm-support-for-biden/74486033007/"
  },
  {
    "text": "“It's not that complicated”: Pete Buttigieg on why a gay billionaire is backing JD Vance  —  When asked to weigh in on Peter Thiel's reasons for supporting Vance, Buttigieg broke it down plainly: Money  —  In a segment of “Real Time with Bill Maher” at the start of the weekend … ",
    "url": "https://www.salon.com/2024/07/20/its-not-that-complicated-pete-buttigieg-on-why-a-gay-billionaire-is-backing-jd-vance/"
  },
  {
    "text": "J.D. Vance Pounded Beers and Told Me Trump Threatens America: Comedian  —  IN VINO VERITAS?  —  Liberal redneck Trae Crowder says he spent time with J.D. Vance in 2016 “pounding beers” and lamenting how bad President Trump would be for America.  —  Self-professed “liberal redneck” … ",
    "url": "https://www.thedailybeast.com/comedian-trae-crowder-says-jd-vance-told-him-donald-trump-was-a-threat-to-us"
  },
  {
    "text": "Since Leaving Butler, Trump Has Foregone the Best Medical Care and Is Withholding CT Scan Results  —  Fresh off his stunt calls for Joe Biden to be drug tested during the debate, Ronny Jackson — the lapsed doctor who turned the White House into a pill mill and covered up Trump's near-lethal COVID … ",
    "url": "https://www.emptywheel.net/2024/07/21/since-butler-trump-has-foregone-competent-medical-care-and-is-withholding-ct-scan-results/"
  },
  {
    "text": "Secret Service said to have denied requests for more security at Trump events  —  Top officials repeatedly rejected requests from Trump's security detail for more manpower and gear at events before attempted assassination, at times citing lack of resources, people familiar with the asks said.",
    "url": "https://www.washingtonpost.com/nation/2024/07/20/trump-secret-service-security-attempted-assassination/"
  },
  {
    "text": "‘I Guess This Is Normal Politics Now’  —  He had closed down the office of the Butler County Democrats and suspended local campaigning.  And nearly every hour since a 20-year-old man had tried to assassinate Donald Trump at a rally on the edge of town, Phil Heasley, a party co-chair … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/07/butler-pennsylvania-trump-shooting/679173/"
  },
  {
    "text": "Pulitzer-winning author Anne Applebaum: ‘Often, for autocrats, the second time in power is worse’  —  The journalist tells of her fears for democracy's future, the dangers of another Trump presidency and how her husband became Poland's foreign minister  —  A couple of years ago … ",
    "url": "https://www.theguardian.com/books/article/2024/jul/21/anne-applebaum-autocracy-inc-donald-trump-vladimir-putin-gaza-european-elections-propaganda-keir-starmer"
  },
  {
    "text": "The GOP's one-man show, starring Donald Trump  —  The Republican National Convention provided little drama this year, as party faithful paid homage to their nominee, former President Donald Trump.  CBS News correspondent John Dickerson, anchor of “The Daily Report,” reflects on the role … ",
    "url": "https://www.cbsnews.com/video/the-gops-one-man-show-starring-donald-trump/"
  },
  {
    "text": "Sen. Joe Manchin joins calls for Biden to drop out of the presidential race  —  Manchin said his demand comes with a “heavy heart” as Biden faces mounting calls from Democrats to drop out after his disastrous June debate performance.  —  Sen. Joe Manchin, I-W.Va, on Sunday joined growing calls … ",
    "url": "https://www.nbcnews.com/politics/2024-election/sen-joe-manchin-biden-drop-out-presidential-race-rcna162892"
  }
]