[
  {
    "text": "Playbook: The politics that could make or break a border deal  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  WHAT YOUR MEDIA FRIENDS ARE TEXTING ABOUT — The Economist's James Bennet is out with a very buzzy, nearly 17,000-word piece on the culture war roiling … ",
    "url": "https://www.politico.com/newsletters/playbook/2023/12/14/the-politics-that-could-make-or-break-a-border-deal-00131713"
  },
  {
    "text": "Biden impeachment inquiry authorized by House Republicans, despite lack of evidence  —  The U.S. House of Representatives voted on Wednesday to formally authorize its ongoing impeachment inquiry into President Joe Biden, as Republicans unite behind the effort even though they have yet to find evidence of wrongdoing by the Democrat.",
    "url": "https://www.reuters.com/world/us/us-house-republicans-ready-vote-formalize-biden-impeachment-inquiry-2023-12-13/"
  },
  {
    "text": "Senate Passes Defense Bill, Steering Clear of Far-Right Policy Dictates  —  The $886 billion legislation is the product of bipartisan negotiations between the House and Senate in which right-wing restrictions on abortion, transgender care and diversity initiatives were jettisoned.",
    "url": "https://www.nytimes.com/2023/12/13/us/senate-defense-bill.html"
  },
  {
    "text": "Statement from President Joe Biden on Baseless House Republican Impeachment Stunt  —  The American people need their leaders in Congress to take action on important priorities for the nation and world.  —  On Tuesday, I met with the President of Ukraine, who is leading his people in a battle for freedom against Russian aggression.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2023/12/13/statement-from-president-joe-biden-on-baseless-house-republican-impeachment-stunt/"
  },
  {
    "text": "Fox Board Member Paul Ryan Slams Trump, Hails Cheney and Kinzinger: 'Trump's Not a Conservative, He's an Authoritarian Narcissist'  —  Former House Speaker Paul Ryan tore into Donald Trump in a recent interview, denouncing the former president as an “authoritarian narcissist,” … ",
    "url": "https://www.mediaite.com/news/fox-board-member-paul-ryan-slams-trump-hails-cheney-and-kinzinger-trumps-not-a-conservative-hes-an-authoritarian-narcissist/"
  },
  {
    "text": "Lawyer Fani Willis calls proposed pause on Trump's election case ‘silly notion’  —  Fulton County District Attorney Fani Willis rejected the idea that her prosecution of Donald Trump could amount to election interference.  Willis, who obtained a sweeping indictment against Trump and 18 others in August, is seeking an August trial date.",
    "url": "https://apnews.com/article/fani-willis-trump-2020-election-indictment-georgia-de77f102a0747f9c65ed874a1f0612c0"
  },
  {
    "text": "Exclusive: Recordings describe 2020 Oval Office photo-op where Trump was briefed on fake electors and January 6  —  Before a group of supportive lawyers entered the Oval Office for a photo-op with then-President Donald Trump in December 2020, they were given a clear instruction … ",
    "url": "https://www.cnn.com/2023/12/13/politics/trump-2020-oval-office-fake-electors-recordings/"
  },
  {
    "text": "Trump Pulls Ahead in Michigan as Union, Women Voters Sour on Biden  —  Biden now trails Trump in seven swing states on economic concerns, the latest Bloomberg News/Morning Consult Poll shows.  —  Donald Trump has pulled ahead of President Joe Biden in must-win Michigan as voters remain pessimistic … ",
    "url": "https://www.bloomberg.com/news/articles/2023-12-14/trump-leads-biden-in-michigan-with-gains-in-union-women-votes-for-2024"
  },
  {
    "text": "Is it time for a second look at Kamala Harris?  —  With Biden's polling worse than ever, the Kamala question deserves a serious answer.  —  ∙ Paid  —  Speaking at a fundraiser in Massachusetts last week, Joe Biden reportedly said that “If Trump wasn't running, I'm not sure I'd be running, but we cannot let him win.”",
    "url": "https://www.slowboring.com/p/is-it-time-for-a-second-look-at-kamala"
  },
  {
    "text": "Trump fraud-trial judge evacuated from Manhattan courthouse soon after testimony ends  — The Trump fraud trial is nearing its end in a lower Manhattan courthouse.  — More than 10 weeks of testimony wrapped on Wednesday with a verdict expected in a month.",
    "url": "https://www.businessinsider.com/manhattan-courthouse-evacuated-donald-trump-new-york-civil-fraud-trial-2023-12"
  },
  {
    "text": "Protest calling for cease-fire in Gaza shuts down SB 110 Freeway in downtown Los Angeles  —  The CHP says 75 people were arrested.  —  A protest on the 110 Freeway in downtown Los Angeles prompted a shutdown of southbound lanes as demonstrators called for a cease-fire in Gaza.  —  KABC",
    "url": "https://abc7.com/110-freeway-protest-downtown-cease-fire/14177639/"
  },
  {
    "text": "GOP critics decry ‘regulatory harassment’ as FCC denies Elon Musk's Starlink $900M in subsidies  —  Republican critics raged after the Federal Communications Commission rejected nearly $900 million in subsidies for Elon Musk's Starlink internet service - a move they decried as a vindictive play by the Biden administration.",
    "url": "https://nypost.com/2023/12/13/business/fcc-denies-elon-musks-starlink-nearly-900m-in-subsidies/"
  },
  {
    "text": "When the New York Times lost its way  —  America's media should do more to equip readers to think for themselves  —  Are we truly so precious?  \" Dean Baquet, the executive editor of the New York Times, asked me one Wednesday evening in June 2020.  I was the editorial-page editor of the Times … ",
    "url": "https://www.economist.com/1843/2023/12/14/when-the-new-york-times-lost-its-way"
  },
  {
    "text": "In Annual News Conference, Putin Says His War Aims Have Not Changed  —  The Russian leader has been taking questions for nearly two hours, albeit in a closely controlled setting.  When asked about Ukraine, he suggested that Western support for the country was drying up.",
    "url": "https://www.nytimes.com/2023/12/14/world/europe/putin-speech-russia.html"
  },
  {
    "text": "Liz Cheney's Checkered History  —  Deep in her new book, “Oath and Honor,” Liz Cheney points out that the likeness of Clio, the Greek muse of history, is found in the Capitol's National Statuary Hall.  “Clio is depicted riding in the chariot of time, making notes in the book in her hand,” … ",
    "url": "https://www.nytimes.com/2023/12/14/opinion/trump-liz-cheney-memoir.html"
  },
  {
    "text": "Social Media Is a Mess.  Government Meddling Would Only Make It Worse.  —  This term, the Supreme Court will reconsider America's laissez-faire approach to regulating the internet, and in doing so it will address vital and new First Amendment questions.  Can states stop social media sites from blocking certain content?",
    "url": "https://www.nytimes.com/2023/12/14/opinion/supreme-court-social-media.html"
  },
  {
    "text": "Exclusive: Nearly half of the Israeli munitions dropped on Gaza are imprecise ‘dumb bombs,’ US intelligence assessment finds  —  Nearly half of the air-to-ground munitions that Israel has used in Gaza in its war with Hamas since October 7 have been unguided, otherwise known as “dumb bombs,” according to a new US intelligence assessment.",
    "url": "https://www.cnn.com/2023/12/13/politics/intelligence-assessment-dumb-bombs-israel-gaza/"
  },
  {
    "text": "Jamie Raskin Rails Against Republicans at Hunter Biden-less Deposition (Exclusive)  —  ‘Chairmen Comer and Jordan have denied him the ability to testify because they are not interested in giving the people the whole truth and nothing but the truth, but rather in leaking distorted half-truths and quarter-truths,’ Raskin said",
    "url": "https://themessenger.com/politics/jamie-raskin-rails-against-republicans-at-hunter-biden-less-deposition-exclusive"
  }
]