[
  {
    "text": "The polls are suggesting a huge shift in the electorate.  Are they right?  —  It's a significant reversal from recent history: President Joe Biden is struggling with young voters but performing better than most Democrats with older ones.  —  Something weird is happening beneath … ",
    "url": "https://www.politico.com/news/2024/04/07/voter-age-biden-trump-2024-election-00150923"
  },
  {
    "text": "Gaza buildings and land decimated in 6 months of war … - More than 100 Israelis are still being held hostage in Gaza.  — Even prior to Oct. 7, years of Israeli blockade and military operations in the densely-populated enclave left many in Gaza with inadequate access to clean water, electricity or sewer.",
    "url": "https://www.axios.com/2024/04/07/gaza-infrastructure-land-damage-israel-six-months-war"
  },
  {
    "text": "Trump: Would be a “great honor” to be jailed for gag order violation … - “We have to Save our Country from these Political Operatives masquerading as Prosecutors and Judges, and I am willing to sacrifice my Freedom for that worthy cause,” he said. … - Merchan expanded the gag order … ",
    "url": "https://www.axios.com/2024/04/07/trump-gag-order-new-york-merchan-jail"
  },
  {
    "text": "‘Increasingly chaotic’: Why House Republicans are heading for the exits  —  The decision by 21 Republican lawmakers to step back is indicative of the broader morale problem within the GOP conference  —  House Majority Leader Steve Scalise thought he had a good argument for Rep. Mike Gallagher (R-Wis.).",
    "url": "https://www.washingtonpost.com/politics/2024/04/07/house-republicans-retirements-mike-johnson-majority-elections/"
  },
  {
    "text": "Trump tells billionaires he'll keep their taxes low at $50 million fundraising gala  —  Biden hit Trump for promising to extend the tax cuts in a video released Saturday.  —  WASHINGTON — Former President Donald Trump emphasized the importance of extending his signature tax cuts … ",
    "url": "https://www.nbcnews.com/politics/2024-election/trump-tells-billionaires-ll-keep-taxes-low-50-million-fundraising-gala-rcna146748"
  },
  {
    "text": "Suspect Arrested in Arson at Burlington Office of Senator Sanders  —  For Immediate Release  —  U.S. Attorney's Office, District of Vermont  —  Burlington, Vermont - The United States Attorney's Office for the District of Vermont stated that Shant Soghomonian (also known as Michael Soghomonian) … ",
    "url": "https://www.justice.gov/usao-vt/pr/suspect-arrested-arson-burlington-office-senator-sanders"
  },
  {
    "text": "Intel Chair Turner: ‘Absolutely true’ that Russia propaganda has infected US Congress  —  House Intelligence Chair Mike Turner (R-Ohio) on Sunday stressed the expansive reach of Russian propaganda and said it has even presented itself on the floor of the U.S. Congress.",
    "url": "https://thehill.com/homenews/house/4579289-intel-chair-turner-absolutely-true-russia-propaganda-infected-us-congress/"
  },
  {
    "text": "Rep. Adam Smith says he trusts Speaker Johnson will ‘not abandon Ukraine’  —  Democratic Rep. Adam Smith (Wash.) said on Sunday that he trusts House Speaker Mike Johnson (R-La.) 's pledge not to abandon Ukraine and predicted Johnson's ability to fulfill that pledge would give little reason to Democrats to oust him.",
    "url": "https://thehill.com/homenews/house/4579429-rep-adam-smith-says-he-trusts-speaker-johnson-will-not-abandon-ukraine/"
  },
  {
    "text": "‘Mischief and problems’: rightwing activists ramp up drive to hand-count ballots  —  Mike Lindell and fellow influencers have hit the road since Donald Trump's 2020 loss, threatening chaos for the 2024 election  —  The fight for democracy is supported by  —  This article was published … ",
    "url": "https://www.theguardian.com/us-news/2024/apr/07/hand-count-ballot-roadshows-election-influencers"
  },
  {
    "text": "Former GOP rep says Trump ‘appeals to the worst of us,’ calls on Biden ‘to recognize the moment’  —  Former Republican Congressman Joe Walsh (Ill.) said that former President Trump “appeals to the worst of us” when discussing his rhetoric and called on President Biden to “recognize the moment” … ",
    "url": "https://thehill.com/homenews/campaign/4578861-former-gop-rep-says-trump-appeals-to-the-worst-of-us/"
  },
  {
    "text": "Navy cancels ship briefings after damning internal report  —  As China's fleet grows, the U.S. is struggling with fresh delays in building new subs and warships.  —  As the Navy's largest U.S. trade show gets underway on Monday, officers in charge of the service's marquee shipbuilding programs … ",
    "url": "https://www.politico.com/news/2024/04/07/navy-cancels-ship-briefings-internal-report-00150879"
  },
  {
    "text": "Why is the Press Making Trump Seem More Normal?  —  Believe it or not, much of the political press has an inadvertent pro-Trump bias  —  On Thursday morning, Donald Trump was a guest on Hugh Hewitt's radio show.  Hewitt is a one time Never Trump conservative turned obsequious Trump flunkie.",
    "url": "https://www.messageboxnews.com/p/why-the-press-ignored-trump-accusing"
  },
  {
    "text": "Inside Donald Trump's secret plan to end the Ukraine-Russia war  —  Foreign policy experts and some Republicans warned that pressuring Ukraine to cede land would reward Putin  —  Former president Donald Trump has privately said he could end Russia's war in Ukraine by pressuring Ukraine … ",
    "url": "https://www.washingtonpost.com/politics/2024/04/05/trump-ukraine-secret-plan/"
  },
  {
    "text": "RNC chair: We're ‘going to be in the room’ when votes are cast, counted in November  —  Republican National Committee (RNC) Chair Michael Whatley said the committee will ensure they are “going to be in the room” when the early votes are cast and counted in the November election.",
    "url": "https://thehill.com/homenews/campaign/4578554-rnc-chair-were-going-to-be-in-the-room-when-votes-are-cast-counted-in-november/"
  }
]