[
  {
    "text": "Harris Tried to Win Over Republicans.  Democratic Support Collapsed Instead  —  The vice president did not pull Republicans from Trump, and the percentage of voters identifying as Democrat declined, according to exit polls  —  During the final weeks of the 2024 campaign … ",
    "url": "https://www.rollingstone.com/politics/politics-features/harris-republican-appeal-democratic-support-collapse-1235156634/"
  },
  {
    "text": "The right-wing claims about voter fraud have suddenly vanished  —  On election night, as the results looked to be in Trump's favor, the baseless conspiracy theories about fraud began tapering off.  —  In the months leading up to the election, Donald Trump and his Republican allies warned relentlessly of widespread voter fraud.",
    "url": "https://www.msnbc.com/top-stories/latest/trump-republicans-voter-fraud-claims-election-2024-rcna179105"
  },
  {
    "text": "The Strategic Failure of 2024 Was Written in 2021  —  President Biden bet everything on the innate goodness of the American people.  We should learn from his mistake.  —  ∙ Paid  —  1. Two Paths in the Wood  —  At the beginning of Joe Biden's presidency he had a choice.",
    "url": "https://www.thebulwark.com/p/the-strategic-failure-of-2024-was"
  },
  {
    "text": "Trump says there's ‘no price tag’ for his mass deportation plan  —  In an exclusive interview with NBC News, Trump talked about his campaign promise to carry out the largest mass deportation of immigrants in U.S. history.  —  President-elect Donald Trump told NBC News on Thursday … ",
    "url": "https://www.nbcnews.com/politics/2024-election/trump-says-no-price-tag-mass-deportation-plan-rcna179178"
  },
  {
    "text": "Donald Trump picks Susie Wiles to be chief of staff  —  A veteran of Florida politics, Wiles directed Trump's campaign to victory in the state in 2016.  —  President-elect Donald Trump has tapped his campaign senior adviser Susie Wiles as White House chief of staff.",
    "url": "https://www.politico.com/news/2024/11/07/donald-trump-susie-wiles-chief-of-staff-00188346"
  },
  {
    "text": "Florida woman takes job as White House chief of staff  —  Welcome to POLITICO's West Wing Playbook, your guide to the preparations, personnel decisions and policy deliberations of Donald Trump's transition.  POLITICO Pro subscribers receive a version of this newsletter first.  —  The chief of staff pick is in.",
    "url": "https://www.politico.com/newsletters/west-wing-playbook/2024/11/07/susie-wiles-trump-chief-of-staff-00188152"
  },
  {
    "text": "Judge declares Biden immigration program for spouses of U.S. citizens illegal  —  A federal judge on Thursday struck down a Biden administration program that would allow unauthorized immigrants married to American citizens to get legal status and a streamlined path to U.S. citizenship, declaring the policy illegal.",
    "url": "https://www.cbsnews.com/news/judge-declares-biden-immigration-program-for-spouses-of-u-s-citizens-illegal/"
  },
  {
    "text": "Trump's election win sends private prisons stocks soaring as investors anticipate hard crackdown on migration  —  President-elect Donald Trump has vowed to launch the biggest deportation in American history—this could translate to big bucks for companies like CoreCivic and Geo Group.",
    "url": "https://fortune.com/2024/11/07/president-donald-trump-election-immigration-border-detention-ice-geo-group-corecivic/"
  },
  {
    "text": "2 Democrats speak out against transgender athletes after Trump win  —  Two House Democrats said they oppose transgender athletes competing in women's sports in the immediate aftermath of President-elect Trump's decisive victory over Vice President Harris, shifting right of their previous policy positions … ",
    "url": "https://thehill.com/homenews/house/4979665-democrats-transgender-athletes/"
  },
  {
    "text": "The model exactly predicted the most likely election map  —  Before we get into the meat of today's newsletter, just a quick update on our plans.  Silver Bulletin, we hope, will have a long future.  But I'm thinking about things in a few different stages:  — Short term: We're treating next week … ",
    "url": "https://www.natesilver.net/p/the-model-exactly-predicted-the-most"
  },
  {
    "text": "Behind the Curtain: Washington's open for business … There are several reasons to expect a very different outcome this time.  — Trump will office with Republican control of the Senate + Republicans are on track to hold the House.  Every Republican leader and committee chair … ",
    "url": "https://www.axios.com/2024/11/07/trump-elon-musk-business-tax-cuts"
  },
  {
    "text": "MAGA Launches Increasingly Horrific Attacks on Women After Trump Win … The immediate aftermath of Donald Trump's presidential election win is already a bad omen for women and minorities across the nation, who within less than 48 hours have found themselves the subjects of hate campaigns designed to belittle and marginalize them.",
    "url": "https://newrepublic.com/post/188159/donald-trump-maga-attacks-women"
  },
  {
    "text": "Fed policy expected to collide with the reality of a second Trump term  —  As the Federal Open Market Committee wraps up its meetings ahead of its latest interest rate decision Thursday, questions about Trump's economic policies loom large.  —  The Federal Reserve is set to announce … ",
    "url": "https://www.nbcnews.com/business/economy/federal-reserve-interest-rate-decision-november-2024-post-election-rcna179025"
  },
  {
    "text": "DNC chair calls Sanders's criticism ‘straight up BS’  —  Democratic National Committee (DNC) Chair Jaime Harrison on Thursday responded to Sen. Bernie Sanders's (I-Vt.) accusations that the party has abandoned the working class, contributing to its loss of the White House and Senate on Election Day.",
    "url": "https://thehill.com/homenews/campaign/4979136-dnc-chair-jamie-harrison-responds-bernie-sanders/"
  },
  {
    "text": "Why Democrats won't build their own Joe Rogan  —  Minutes after Donald Trump was declared the winner of the 2024 election, Dana White took the stage to thank the influencers who helped lead Trump to victory.  “I want to thank the Nelk Boys, Adin Ross, Theo Von, Bussin' With The Boys … ",
    "url": "https://www.usermag.co/p/why-democrats-wont-build-their-own"
  },
  {
    "text": "There's No Denying It Anymore: Trump Is Not a Fluke—He's America  —  The United States chose Donald Trump in all his ugliness and cruelty, and the country will get what it deserves.  —  Pocket  —  America deserves everything it is about to get.  We had a chance to stand united against fascism … ",
    "url": "https://www.thenation.com/article/politics/trump-is-america-not-a-fluke/"
  },
  {
    "text": "Governor Newsom convenes a special session of the Legislature to protect California values  —  What you need to know: Governor Newsom is convening a special session to protect California values, including fundamental civil rights, reproductive freedom, climate action, immigrant families, and more.",
    "url": "https://www.gov.ca.gov/2024/11/07/special-session-ca-values/"
  },
  {
    "text": "Dem governor issues stark warning to Trump: ‘You come for my people, you come through me’  —  Gov. JB Pritzker says he is a ‘warrior’ for the people of Illinois  —  Democrat Illinois Gov. JB Pritzker issued a stark warning to President-elect Trump following his landmark victory … ",
    "url": "https://www.foxnews.com/politics/dem-governor-issues-stark-warning-trump-you-come-my-people-you-come-through-me"
  },
  {
    "text": "Biden Rushing Study That Threatens to Slow Trump's LNG Plans  — Officials are racing to finish study on LNG export impacts  — Study could slow down but not stop Trump LNG expansion efforts  —  The Biden administration is racing to complete a study that could complicate President … ",
    "url": "https://www.bloomberg.com/news/articles/2024-11-07/biden-rushing-study-that-threatens-to-slow-trump-s-lng-plans?accessToken=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzb3VyY2UiOiJTdWJzY3JpYmVyR2lmdGVkQXJ0aWNsZSIsImlhdCI6MTczMTAwMjY5MSwiZXhwIjoxNzMxNjA3NDkxLCJhcnRpY2xlSWQiOiJTTUo4N1dEV1JHRzAwMCIsImJjb25uZWN0SWQiOiJENzMwQ0QzRDRENzQ0RUJDQTk2QzlCQUYxRTE4OTg4RCJ9.eQtw_v0ZXvITLm0iy0yrTmmsKyaspkVXAamMCQ43uNg"
  },
  {
    "text": "Virginia Attorney General condemns racist text messages sent out following presidential election  —  The text message asked people to report to a plantation to pick cotton.  It arrived on people's phones a day after Election Day.  —  NORFOLK, Va. — On Wednesday, the Virginia Attorney … ",
    "url": "https://www.13newsnow.com/article/news/local/mycity/norfolk/racist-text-message-sent-virginia-attorney-general-condemns-plantation-cotton/291-3c46b3dd-930f-4496-86d8-529f3974f3bc"
  },
  {
    "text": "Stefanik eyed for top Trump administration post  —  One of President-elect Donald Trump's most vocal supporters in the House is on the short list to become his next ambassador to the United Nations, according to five people familiar with the potential appointment.",
    "url": "https://www.politico.com/live-updates/2024/11/07/congress/stefanik-eyed-for-post-00188354"
  },
  {
    "text": "Laura Gillen defeats Rep. Anthony D'Esposito in heated NY rematch focused on border security  —  Democrats scored a key House win on Long Island, unseating a Republican accused of an affair and patronage.  —  NEW YORK — Democratic challenger Laura Gillen notched an upset Tuesday night … ",
    "url": "https://www.politico.com/news/2024/11/07/laura-gillen-wins-new-york-house-race-00187414"
  },
  {
    "text": "After 248 years, America prepares for life under a king  —  It took only hours after a majority of Americans chose to return Donald Trump as a strongman-style president for the first billionaire supplicant to come forward on bended knee.  Amazon founder Jeff Bezos, the third-richest person on the planet … ",
    "url": "https://www.inquirer.com/opinion/trump-american-strongman-jack-smith-20241107.html?id=ujrAMZuwiDqmS"
  },
  {
    "text": "Judge scolds Giuliani for not turning over assets to two women, including car he's driving  —  Trump ally and former New York Mayor Rudy Giuliani got a tongue-lashing Thursday in federal court after missing a deadline to turn over valuables to two election workers he defamed, including one asset … ",
    "url": "https://www.cbsnews.com/news/rudy-giuliani-bankruptcy-fight-valuables/"
  },
  {
    "text": "Mississippi District Attorney, Mayor of Jackson, and Jackson City Council Member Charged with Bribery and Other Offenses  —  For Immediate Release  —  An indictment was unsealed today in the Southern District of Mississippi charging Hinds County District Attorney, Jody E. Owens II, 43 … ",
    "url": "https://www.justice.gov/opa/pr/mississippi-district-attorney-mayor-jackson-and-jackson-city-council-member-charged-bribery"
  }
]