[
  {
    "text": "Schumer says he won't step down as Senate Democratic leader despite government funding uproar  —  Senate Democratic leader Chuck Schumer says he won't resign his post, despite pressure from some in his party after he voted to move forward with a Republican spending bill that avoided a government shutdown.",
    "url": "https://apnews.com/article/schumer-democrats-senate-trump-b7363a2667635115d6675999000233c8"
  },
  {
    "text": "Greenland Officials Express Fury Over Trump's Plan to Send Delegation  —  Usha Vance, the second lady, and Michael Waltz, the national security adviser, are on their way this week.  Greenlandic officials called the move “aggressive.”  —  Relations between Greenland and the United States sank further … ",
    "url": "https://www.nytimes.com/2025/03/23/us/politics/usha-vance-trump-us-greenland.html"
  },
  {
    "text": "Attorney general to Jasmine Crockett: ‘Tread very carefully’ with your Musk critique  —  Ahead of expected protests at Tesla locations, the Democratic representative said her calls to action against Musk were nonviolent.  —  Attorney General Pam Bondi warned Rep. Jasmine Crockett (D-Texas) … ",
    "url": "https://www.politico.com/news/2025/03/23/bondi-jasmine-crockett-musk-tesla-protests-00244256"
  },
  {
    "text": "Brad Karp's Message To Paul Weiss About Its Deal With The Trump Administration  —  Welcome to Original Jurisdiction, the latest legal publication by me, David Lat.  You can learn more about Original Jurisdiction by reading its About page, and you can email me at davidlat@substack.com.",
    "url": "https://davidlat.substack.com/p/brad-karp-firmwide-email-to-paul-weiss-about-the-trump-administration-deal"
  },
  {
    "text": "SpaceX Positioned to Secure Billions in New Federal Contracts Under Trump  —  Elon Musk's role in the White House allows him to cancel contracts and influence policy, potentially benefiting his companies.  Supporters say he has the best technology.  —  A SpaceX Falcon 9 rocket preparing … ",
    "url": "https://www.nytimes.com/2025/03/23/us/politics/spacex-contracts-musk-doge-trump.html?unlocked_article_code=1.6E4.Js11.uNYKUZdBQkCf"
  },
  {
    "text": "'This is not your grandmother's Easter Egg Roll': White House seeks corporate sponsorships for Easter event  —  The White House, through an outside event production company called Harbinger, is soliciting corporate sponsors for this year's Easter Egg Roll, which is prompting major concerns … ",
    "url": "https://www.cnn.com/2025/03/23/politics/white-house-easter-egg-roll-corporate-sponsorships/"
  },
  {
    "text": "Fans at NCAA Wrestling Championships Show Love For Trump.  But Not So Much Musk.  —  President Trump and Elon Musk took in the Division I wrestling championship in Philadelphia on Saturday.  But some of Mr. Trump's supporters expressed complicated feelings about his billionaire adviser.",
    "url": "https://www.nytimes.com/2025/03/23/us/politics/trump-musk-ncaa-wrestling-philadelphia.html"
  },
  {
    "text": "Jessica Aber, US attorney found dead at 43, was in charge of high-profile cases targeting CIA leaks, Russian fraud  —  The former US Attorney in the Eastern District of Virginia who was found dead Saturday morning had been in charge of some of the biggest cases targeting leaks in the CIA … ",
    "url": "https://nypost.com/2025/03/23/us-news/jessica-aber-us-attorney-found-dead-at-43-was-in-charge-of-cases-targeting-cia-leaks-russian-fraud/"
  },
  {
    "text": "Trump Wants to Force Immigrants to Share Their Social Media Handles When Applying for Citizenship  —  Experts say this is an assault on the First Amendment  —  Soon, if a new proposal from the Trump administration goes into effect, immigrants applying for green cards or citizenship … ",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-immigrants-share-social-media-handles-1235301736/"
  },
  {
    "text": "Trump Won't Win a War Against the Courts  —  President Trump has wasted no time in his second term in declaring war on the nation's federal judiciary, the country's legal profession and the rule of law.  He has provoked a constitutional crisis with his stunning frontal assault on the third branch … ",
    "url": "https://www.nytimes.com/2025/03/23/opinion/trump-judge-venezuela-deportation.html"
  },
  {
    "text": "Trump moves closer to court crisis  —  Many top legal experts believe a full-blown constitutional showdown between President Trump and the courts is already here.  Others are confident there's still room to avoid one.  — But most agree that the administration's battle with U.S. District Judge James … ",
    "url": "https://www.axios.com/2025/03/23/trump-boasberg-courts-constitutional-crisis"
  },
  {
    "text": "Trump Cruelly Terminates Program for Legal Migrants Fleeing Communist Tyranny, and Seeks to Deport them  —  Yesterday, the Trump Administration terminated legal “parole” status for some 530,000 legal migrants who entered the United States under the CHNV program, which allowed residents … ",
    "url": "https://reason.com/volokh/2025/03/23/trump-cruelly-terminates-program-for-legal-migrants-fleeing-communist-tyranny-and-seeks-to-deport-them/"
  },
  {
    "text": "Attorney General Pam Bondi says Supreme Court could get involved in Alien Enemies Act case  —  Bondi again criticized judges who have ruled against the Trump administration.  —  WASHINGTON — Attorney General Pam Bondi once again attacked members of the judiciary in a Fox News interview Sunday … ",
    "url": "https://www.nbcnews.com/politics/justice-department/attorney-general-supreme-court-involved-alien-enemies-act-case-rcna197682"
  },
  {
    "text": "How Hooters Became a Refuge for Young Gay Men  —  It was an annual tradition.  Every Thanksgiving, I would fly down to Florida before the rest of the family.  My grandfather would pick me up at the airport.  We'd talk about politics, my soccer season and changes to Fox News's prime-time lineup.",
    "url": "https://www.nytimes.com/2025/03/23/opinion/hooters-gay-family.html?unlocked_article_code=1.6U4.FJKa.YInjHKAe9YVu&smid=url-share"
  },
  {
    "text": "Jeremy Clarkson taunts ‘idiot’ Elon Musk over Tesla vandalism  —  British broadcaster Jeremy Clarkson has reignited a feud with carmaker-turned-political figure Elon Musk that started in 2008 with a bad review of a Tesla car on motoring show Top Gear.  —  People in the United States and around … ",
    "url": "https://www.politico.eu/article/jeremy-clarkson-idiot-elon-musk-tesla-vandalism/"
  },
  {
    "text": "Protesters denounce Musk, DOGE outside Tesla showroom  —  Jasmine Fernández Antonio FinsPalm Beach Post  —  (This story has been updated to add new information and to change or add a photo or video..)  —  WEST PALM BEACH — Protesters lined up outside the Tesla showroom … ",
    "url": "https://www.palmbeachpost.com/story/news/trump/2025/03/22/demonstrators-denounce-musk-outside-telsa-showroom-in-wpb/82610986007/"
  },
  {
    "text": "Trump vs. Canada: Prime Minister Carney calls snap election to take on president  —  Canada's new prime minister said he needs a mandate from Canadians to take on U.S. President Donald Trump.  —  OTTAWA — Prime Minister Mark Carney called a snap election on Sunday, saying he needs a mandate … ",
    "url": "https://www.politico.com/news/2025/03/23/canada-carney-snap-election-trump-00244196"
  },
  {
    "text": "Max Frankel, Top Times Editor Who Led a Newspaper in Transition, Dies at 94  —  Max Frankel, who fled Nazi Germany as a boy and rose to pinnacles of American journalism as a Pulitzer Prize-winning correspondent for The New York Times and later as its executive editor during eight years … ",
    "url": "https://www.nytimes.com/2025/03/23/obituaries/max-frankel-dead.html?unlocked_article_code=1.6E4.S7Vc.JgjJ2obwBO9l&smid=url-share"
  },
  {
    "text": "Paris votes on making 500 streets car-free, in test for green city policies  —  Mayor Anne Hidalgo has floated a plan to “revegetate” 500 Parisian streets to make the city more liveable.  Critics say it would deepen divides between urbanites and commuters.  —  Parisians cast their ballots Sunday … ",
    "url": "https://www.washingtonpost.com/world/2025/03/23/paris-car-free-vote-anne-hidalgo/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQyNzAyNDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ0MDg0Nzk5LCJpYXQiOjE3NDI3MDI0MDAsImp0aSI6IjViNzg4MDIwLWIzMzItNDdiZS05YmVkLWI2M2UyMTVkMTEwNSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS93b3JsZC8yMDI1LzAzLzIzL3BhcmlzLWNhci1mcmVlLXZvdGUtYW5uZS1oaWRhbGdvLyJ9.TqDLN-GQnst0f2f560c7rBjqNYKhCqKCSICQ507_VnQ&itid=gfta"
  },
  {
    "text": "Tax Cheats Could Prosper Under Trump, IRS Experts Say  —  The Internal Revenue Service could lose 10 percent of its revenue — $500 billion — because taxpayers and businesses think the Trump administration won't go after them for not paying taxes … According to internal projections … ",
    "url": "https://www.rollingstone.com/politics/politics-news/tax-cheats-trump-irs-1235301645/"
  },
  {
    "text": "U.S. Lodges New Accusations Against Detained Columbia Protest Leader  —  The Trump administration is now accusing the Columbia University graduate and protest leader of having withheld information when he applied for permanent residency status.  —  When Mahmoud Khalil … ",
    "url": "https://www.nytimes.com/2025/03/23/nyregion/mahmoud-khalil-trump-allegations.html?unlocked_article_code=1.6E4.yybQ.lFVpc9a2nJ_B"
  },
  {
    "text": "Kari Lake Isn't Telling the Truth About the VOA  —  She says a new headquarters is a waste of taxpayer funds, but the lease saved the government more than $150 million.  —  President Trump recently selected Kari Lake as his top adviser to the U.S. Agency for Global Media … ",
    "url": "https://www.wsj.com/opinion/kari-lake-isnt-telling-the-truth-about-voas-new-building-lease-taxpayer-savings-7dcdb17e"
  },
  {
    "text": "Trump's transgender rights rollbacks prompt allies to adjust travel warnings  —  Several European countries have adjusted travel guidelines for citizens seeking to enter the U.S. as the Trump administration has implemented several rollbacks on transgender rights.",
    "url": "https://www.axios.com/2025/03/23/allies-issue-usa-travel-guidlines-transgender"
  },
  {
    "text": "Global AIDS program teetering after Trump admin's shock-and-awe  —  President Trump is taking apart one of George W. Bush's proudest achievements.  —  America's most celebrated global health program is on life support, former U.S. government officials and global health advocates say.",
    "url": "https://www.politico.com/news/2025/03/23/syndicate-americas-global-aids-relief-program-is-on-the-brink-00244106"
  }
]