[
  {
    "text": "In New York, the Trump Brand Is Costing Some Condo Owners  —  When Donald J. Trump became president, condominiums in buildings emblazoned with his name began selling for less, according to an analysis.  —  In the world of real estate, Donald J. Trump's name has long been synonymous with luxury.",
    "url": "https://www.nytimes.com/2024/02/18/realestate/trump-condos-prices-nyc.html"
  },
  {
    "text": "The GOP Has Crossed an Ominous Threshold on Foreign Policy  —  The long decline of the Republican Party's internationalist wing may have reached a tipping point.  —  Since Donald Trump emerged as the GOP's dominant figure in 2016, he has championed an isolationist and nationalist agenda … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/02/how-the-gops-thinking-on-international-issues-evolved/677505/"
  },
  {
    "text": "Seeing Haley's attacks on Trump, some claim her as a member of the resistance  —  But the former S.C. governor rejects the label, saying her campaign ‘is not an anti-Trump movement’  —  Speaking to influential Republican donors at a private gathering in Palm Beach, Fla., on the last Tuesday of January … ",
    "url": "https://www.washingtonpost.com/politics/2024/02/18/haley-trump-resistance-gop-primary/"
  },
  {
    "text": "Michael Cohen suggests Trump's mounting legal fees make him ‘thoroughly compromised’: ‘He is for sale’  —  Michael Cohen - who long served as former President Trump's personal lawyer and fixer - warned on Sunday of the potential risk of sending Trump back to the White House with mounting legal fees and financial liabilities.",
    "url": "https://thehill.com/regulation/court-battles/4475770-michael-cohen-suggests-trumps-mounting-legal-fees-make-him-thoroughly-compromised-he-is-for-sale/"
  },
  {
    "text": "Trump hawks $399 branded shoes at ‘Sneaker Con,’ a day after a $355 million ruling against him  —  PHILADELPHIA (AP) — As he closes in on the Republican presidential nomination, former President Donald Trump made a highly unusual stop Saturday, hawking new Trump-branded sneakers at “Sneaker Con … ",
    "url": "https://apnews.com/article/trump-sneakers-sneaker-con-philadelphia-4de093eda6f8d1c68baf8fe8095f777b"
  },
  {
    "text": "Trump remains silent on Navalny's death  —  Former president Donald Trump, who earlier this month set off worries among allies after he said would encourage Russia to invade a NATO country that wasn't spending enough on defense, has remained silent on the death of Alexei Navalny, Vladimir Putin's most potent political opponent.",
    "url": "https://www.washingtonpost.com/politics/2024/02/18/trump-navalny-putin/"
  },
  {
    "text": "Navalny's death fails to move the dial for Republican Senator J.D. Vance  —  At Munich Security Conference, American senator doubles-down on view that Ukraine should cede territory to Russia.  —  U.S. Senator J.D. Vance has made a name for himself in the United States Congress … ",
    "url": "https://www.politico.eu/article/navalny-death-fails-to-move-the-dial-for-vance/"
  },
  {
    "text": "Conservative activist Charlie Kirk helped oust Ronna McDaniel at the RNC.  Now the knives are out for him.  —  The right-wing provocateur's antics — including attacks on Martin Luther King Jr., Black pilots and Taylor Swift — have caused a rift in Trump world.",
    "url": "https://www.nbcnews.com/politics/donald-trump/charlie-kirk-ronna-mcdaniel-rnc-trump-rcna139288"
  },
  {
    "text": "Why Trump's Sleaziest Criminal Case Is So Important  —  Editor's note: The below article first appeared in David Corn's newsletter, Our Land.  The newsletter comes out twice a week (most of the time) and provides behind-the-scenes stories and articles about politics, media, and culture.",
    "url": "https://www.motherjones.com/politics/2024/02/donald-trump-stormy-daniels-hush-money-porn-star-criminal-case/"
  },
  {
    "text": "Inside Kamala Harris' quiet effort to break through the Biden campaign's information bubble  —  For some, it's been a conversation off to the side at the White House congressional holiday party.  Others have gathered at actress Eva Longoria's house in Los Angeles.",
    "url": "https://www.cnn.com/2024/02/18/politics/kamala-harris-biden-reelection-effort/"
  },
  {
    "text": "Top UN court to hold hearings on legality of the Israeli occupation of Palestinian-claimed lands  —  The United Nations' highest court opens historic hearings Monday into the legality of Israel's 57-year occupation of lands sought for a Palestinian state, plunging the 15 international judges … ",
    "url": "https://apnews.com/article/israel-palestinians-court-gaza-occupation-8e194a5d96bc6a2264a0bb3de8576210"
  },
  {
    "text": "Top Maricopa county official quits as election looms: ‘All I do is play defense’  —  Clint Hickman, who helped lead Arizona's largest county through the pandemic and 2020 election, has faced endless harassment for the last few years  —  For Clint Hickman, an official who helped lead Arizona's … ",
    "url": "https://www.theguardian.com/us-news/2024/feb/18/maricopa-county-clint-hickman"
  },
  {
    "text": "Cheney says it's ‘worth’ Johnson losing Speakership over passing Ukraine aid bill  —  Former Rep. Liz Cheney (R-Wyo.) said it's worth it for Speaker Mike Johnson (R-La.) to lose the Speakership if he passes a bill approving aid for Ukraine.  —  Cheney called on Johnson to bring a bill … ",
    "url": "https://thehill.com/homenews/house/4475545-cheney-says-its-worth-johnson-losing-speakership-over-passing-ukraine-aid-bill/"
  },
  {
    "text": "A year after Jimmy Carter's entered hospice care, advocates hope his endurance drives awareness  —  ATLANTA (AP) — Since Jimmy Carter entered hospice care at his home in south Georgia one year ago, the former U.S. president has celebrated his 99th birthday, enjoyed tributes to his legacy and lost his wife of 77 years.",
    "url": "https://apnews.com/article/jimmy-carter-roslaynn-hospice-year-anniversary-c93498575e806f1a1d83714cf8e5c0b6"
  }
]