[
  {
    "text": "Judge hints at delay for Trump's March trial date in federal election case  —  Judge Tanya Chutkan suggested that Trump will get additional time to prepare for trial if appellate courts reject his claims of immunity.  —  The judge overseeing the federal criminal case against Donald Trump … ",
    "url": "https://www.politico.com/news/2024/01/18/judge-hints-at-delay-for-trumps-march-trial-date-in-federal-election-case-00136403"
  },
  {
    "text": "Donald Trump Has Chosen to Pay Millions to Trash Rule of Law  —  I have a standing complaint that reporters serially fall into Donald Trump's trap of reporting on his courtroom tantrums rather than the evidence of his fraud and crime presented therein.  But I'm going to do just that … ",
    "url": "https://www.emptywheel.net/2024/01/18/donald-trump-has-chosen-to-pay-millions-to-trash-rule-of-law/"
  },
  {
    "text": "Judge loses patience with Trump lawyer in E. Jean Carroll sex assault defamation trial  — E. Jean Carroll resumed testifying in her civil defamation trial stemming from sexual assault claims against Donald Trump.  — Trump clashed with Judge Lewis Kaplan and complained about Carroll's testimony during her first day on the stand.",
    "url": "https://www.cnbc.com/2024/01/18/trump-trial-e-jean-carroll-testimony-ex-president-judge-clash.html"
  },
  {
    "text": "E. Jean Carroll used to be somebody  —  Once you enter Trump's world, your own world evaporates  —  E. Jean Carroll used to have a career, now she has Donald Trump.  She used to have prestige, now she has Donald Trump.  She used to have an identity, and then in 2019 she accused … ",
    "url": "https://www.washingtonpost.com/style/power/2024/01/18/e-jean-carroll-and-the-donald-trump-trials/"
  },
  {
    "text": "Scoop: Mike Pence's former chief of staff endorses Trump  —  Mike Pence's former chief of staff Nick Ayers is endorsing former President Trump, Axios has learned. … - “How long are the candidates going to stay the race and continue to divert money to an intramural squabble?”",
    "url": "https://www.axios.com/2024/01/18/trump-endorsement-pence-nick-ayers"
  },
  {
    "text": "Is It Over?  —  The opinions expressed by columnists are their own and do not necessarily represent the views of Townhall.com.  —  Top Columns  —  Trending on Townhall Media  —  Call For a Mop - There's Been an Evisceration During Congressional Testimony and the Floor Is Slippery",
    "url": "https://townhall.com/columnists/calthomas/2024/01/18/is-it-over-n2633759"
  },
  {
    "text": "With Trump's victory in Iowa, we're inching toward autocracy  —  Iowans voted this week in the Republican primary race, which shouldn't mean very much.  Iowa's population is 3.2 million, about one percent of the total United States.  There are 2,083,000 registered voters there, with 718,000 registered Republican.",
    "url": "https://thehill.com/opinion/campaign/4416566-with-trumps-victory-in-iowa-were-inching-toward-autocracy/"
  },
  {
    "text": "Trump leads Biden with independent voters by 11 points: Poll  —  Former President Trump is leading President Biden with independent voters, outpacing the incumbent by 11 points, according to a new poll.  —  In the new Messenger/Harris poll, the former president garnered 46 percent … ",
    "url": "https://thehill.com/homenews/campaign/4416654-trump-leads-biden-with-independent-voters-by-11-points-poll/"
  },
  {
    "text": "DeSantis regrets anti-media strategy: ‘I should have gone on everything’  —  The governor initially appeared only on conservative outlets before changing his strategy.  —  MIAMI — Ron DeSantis wishes he could have a do-over with the media.  —  In an interview Thursday with radio host Hugh Hewitt … ",
    "url": "https://www.politico.com/news/2024/01/18/desantis-regret-anti-media-campaign-strategy-00136330"
  },
  {
    "text": "Trump will stay on ballot in Washington state  —  A judge in Washington rejected an effort to boot former President Trump off the state's primary and general ballots in a ruling Thursday.  —  Thurston County, Wash., Superior Court Judge Mary Sue Wilson's ruling was in response to a challenge … ",
    "url": "https://thehill.com/regulation/court-battles/4416366-trump-washington-state-ballot-challenge/"
  },
  {
    "text": "Netanyahu says he has told US that he opposes Palestinian state in any postwar scenario  —  Israeli Prime Minister Benjamin Netanyahu says he has informed the United States that he opposes the establishment of a Palestinian state as part of any postwar scenario.",
    "url": "https://apnews.com/article/israel-hamas-war-news-01-18-2024-73d552c6e73e0dc3783a0a11b2b5f67d"
  },
  {
    "text": "Ga. judge in Trump case orders hearing on accusations of Willis misconduct  —  Superior Court Judge Scott McAfee also wrote in his order that Willis must respond to the accusations in writing by Feb. 2.  The accusations first came to light in a filing from one of Trump's co-defendants, former campaign aide Mike Roman.",
    "url": "https://www.washingtonpost.com/national-security/2024/01/18/judge-orders-hearing-fani-willis-misconduct-georgia-case/"
  },
  {
    "text": "House, Senate pass short-term bill averting government shutdown until March  —  Far-right House conservatives were furious over the move, which sends the bill to President Biden to sign into law and keep the government open.  —  Congress on Thursday passed legislation to keep … ",
    "url": "https://www.washingtonpost.com/business/2024/01/18/government-shutdown-bill-senate-house/"
  },
  {
    "text": "Democratic Lawmakers Plan Push To Get Controversial Biden Adviser Out Of Office  —  House Democrats have drafted a letter seeking the resignation of White House aide Brett McGurk, whose Middle East policies are seen as worsening the Gaza crisis.  —  LOADING",
    "url": "https://www.huffpost.com/entry/congress-brett-mcgurk-biden-middle-east_n_65a98154e4b041f1ce65448b"
  },
  {
    "text": "Justice Department report finds ‘cascading failures’ in response to Uvalde attack  —  A U.S. Justice Department report released Thursday on the 2022 school shooting in Uvalde, Texas, found “cascading failures” by law enforcement before, during, and after the attack that killed 19 children and two teachers.",
    "url": "https://www.npr.org/2024/01/18/1225340219/uvalde-report"
  },
  {
    "text": "Salad and spinach kits sold in 7 states recalled over listeria risk  —  BrightFarms spinach and salad kits sold in seven U.S. states are being recalled because they may be contaminated with listeria, according to a notice posted by the U.S. Food and Drug Administration.",
    "url": "https://www.cbsnews.com/news/spinach-salad-kit-recall-listeria-stop-shop-wegmans/"
  },
  {
    "text": "No Labels alleges criminal conspiracy against 2024 presidential effort  —  No Labels, the nonpartisan group preparing to run a third-party presidential ticket, has asked the Department of Justice to investigate whether Democratic and Republican strategists are engaged in an … ",
    "url": "https://www.axios.com/2024/01/18/no-labels-criminal-conspiracy-2024-president"
  },
  {
    "text": "Introducing the New England DEI Patriots  —  If racism is America's original sin, then Democrats and others on the Left are the biblical Babylonians of the 21st century.  For a group of people who claim to want racism gone, they wickedly do everything possible to make sure it remains alive — or at least the insinuation of it.",
    "url": "https://www.washingtonexaminer.com/opinion/beltway-confidential/2803337/introducing-the-new-england-dei-patriots/"
  },
  {
    "text": "State Health Department Issues Unprecedented $300K Penalty to Midwife for Falsifying Vaccine Records  —  Roughly 1,500 School-Aged Children Affected Across New York State  —  Children Are Required to Receive Vaccines Prior to Returning to School  —  The New York State Department of Health … ",
    "url": "https://www.health.ny.gov/press/releases/2024/2024-01-17_baldwin_midwifery.htm"
  },
  {
    "text": "Democrat Frost challenges GOP to introduce bill to remove Statue of Liberty  —  Rep. Maxwell Frost (D-Fla.) challenged his Republican colleagues to introduce a bill that removes the Statue of Liberty because of their stances on immigration at the southern border.",
    "url": "https://thehill.com/homenews/house/4414275-democrat-frost-gop-statue-of-liberty/"
  },
  {
    "text": "Metaphors Journalists Live By (Part II)  —  The conclusion of our story of the bad things that can happen when journalists refuse to criticize themselves  —  Demonstrators hold up signs during a protest against the election of Donald Trump, on Fifth Avenue near Trump Tower, November 12, 2016, in New York.",
    "url": "https://prospect.org/politics/2024-01-18-metaphors-journalists-live-by-part-ii/"
  }
]