[
  {
    "text": "Supreme Court Poised to Allow Emergency Abortions in Idaho  — Opinion was briefly posted on the court's website and removed  — Hospitals would be allowed to protect pregnant mother's health  —  The US Supreme Court is poised to allow abortions in medical emergencies in Idaho … ",
    "url": "https://www.bloomberg.com/news/articles/2024-06-26/us-supreme-court-poised-to-allow-emergency-abortions-in-idaho"
  },
  {
    "text": "Supreme Court inadvertently uploads ‘document’ about ruling in Idaho abortion case  —  The court said a final opinion on the access question has not been released.  —  Supreme Court is seen on Capitol Hill, April 25, 2024.  —  The U.S. Supreme Court on Wednesday “inadvertently and briefly” … ",
    "url": "https://abcnews.go.com/Politics/supreme-court-inadvertently-uploads-document-ruling-idaho-abortion/story?id=111071015"
  },
  {
    "text": "Trump trusted more than Biden on democracy among key swing-state voters  —  A poll shows that Americans rate threats to democracy as an important issue, but that the president has yet to convince them he is the one to defend it.  —  President Biden and his Democratic allies have cast … ",
    "url": "https://www.washingtonpost.com/politics/2024/06/26/biden-trump-swing-state-poll-democracy/"
  },
  {
    "text": "The presidential election isn't a toss-up  —  As our model launches, either Biden or Trump could easily win — but the odds are in the ex-president's favor.  —  ∙ Paid … We hope all of this will prove to be worth your time — and money — and you can sign up using the link below.",
    "url": "https://www.natesilver.net/p/the-presidential-election-isnt-a"
  },
  {
    "text": "GOP former Rep. Adam Kinzinger endorses Biden, whose campaign wants to flip anti-Trump Republicans  —  NEW YORK (AP) — Republican former congressman Adam Kinzinger endorsed President Joe Biden on Wednesday, giving the Democrat a prominent new ally in his high-stakes campaign to win over moderate Republicans and independents this fall.",
    "url": "https://apnews.com/article/kinzinger-biden-endorsement-president-republican-30fd37b730fc435c308dcf801586f664"
  },
  {
    "text": "Trump Pulls Ahead In Presidential Race, Vast Majority Of Voters Plan To Watch Debate, 16% Open To Changing Choice For President, Quinnipiac University National Poll Finds; Voters Support Social Media Warning Label And Banning Smartphones In The Classroom  —  mail_outline",
    "url": "https://poll.qu.edu/poll-release?releaseid=3900"
  },
  {
    "text": "Democrats groan at AIPAC “overkill” against Jamaal Bowman … - “It might change how they talk about [Israel],” one moderate House Democrat said of their colleagues, speaking on the condition of anonymity. … - AIPAC spent at least $14.5 million on anti-Bowman ads through its PAC … ",
    "url": "https://www.axios.com/2024/06/26/democrats-aipac-jamaal-bowman-george-latimer"
  },
  {
    "text": "Three female GOP state senators who filibustered S.C. abortion ban lost their primaries  —  They were defeated by three male Republican candidates.  —  Three Republican state senators in South Carolina who filibustered an abortion ban in the state have lost in their primary elections this month.",
    "url": "https://www.nbcnews.com/politics/2024-election/three-gop-state-senators-filibustered-sc-abortion-ban-lost-primaries-rcna158965"
  },
  {
    "text": "Supreme Court tosses out claim Biden administration coerced social media companies to remove content  —  The justices considered whether officials crossed the line when the Biden administration pressured social media platforms to remove content.  —  WASHINGTON — The Supreme Court … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-tosses-claim-biden-administration-coerced-social-media-c-rcna151356"
  },
  {
    "text": "Ketanji Brown Jackson Blasts “Absurd” Supreme Court Bribery Ruling  —  Supreme Court Justice Ketanji Brown Jackson took her conservative colleagues to task Wednesday over a ruling weakening a federal statute that prevented public officials from receiving bribes in the form of gratuities.",
    "url": "https://newrepublic.com/post/183135/ketanji-brown-jackson-absurd-supreme-court-bribery"
  },
  {
    "text": "A coup attempt is feared in Bolivia as troops pour into the streets  —  LA PAZ, Bolivia (AP) — Armored vehicles rammed into the doors of Bolivia's government palace Wednesday as a top government official warned of a coup attempt and President Luis Arce said “irregular” deployment of troops was taking place in the capital.",
    "url": "https://apnews.com/article/bolivia-military-deployment-arce-coup-fears-028cd88f3be1fb02164c05deb0faa099"
  },
  {
    "text": "Trump's claim that Biden is “jacked up” on drugs is more than projection — it's cult conditioning  —  Parroting Trump's obvious lies creates the groupthink that keeps followers from asking too many questions  —  Donald Trump has been thinking a lot about cocaine lately … ",
    "url": "https://www.salon.com/2024/06/26/donald-claims-joe-biden-is-jacked-up-on--it-reveals-how-he-controls-the-maga/"
  },
  {
    "text": "Supreme Court wipes out anti-corruption law that bars officials from taking gifts for past favors  —  The Supreme Court on Wednesday struck down part of a federal anti-corruption law that makes it a crime for state and local officials to take gifts valued at more than $5,000 from a donor … ",
    "url": "https://www.latimes.com/world-nation/story/2024-06-26/supreme-court-anti-corruption-law"
  },
  {
    "text": "Remember Those Gay Activists Accused of Abusing Their Adopted Kids?  —  WARNING: This article contains graphic descriptions of child sexual abuse.  Reader discretion is advised.  —  Remember the self-avowed LGBTQ+ activists accused of sexually abusing their adopted sons?",
    "url": "https://townhall.com/tipsheet/miacathell/2024/06/26/zulock-tentative-trial-n2638642"
  },
  {
    "text": "GOP leaders deliver private warning to a powerful chair on her privacy bill  —  House Energy and Commerce Chair Cathy McMorris Rodgers got a clear warning Tuesday from the chamber's top two GOP leaders: If you don't fix your data privacy bill, it's on track to die in your committee.",
    "url": "https://www.politico.com/live-updates/2024/06/26/congress/data-privacy-struggles-00165046"
  },
  {
    "text": "A signature Biden law aimed to boost renewable energy.  It also helped a solar company reap billions  —  As he campaigned for the presidency, Joe Biden promised to spend billions of dollars to “save the world” from climate change.  One of the largest players in the solar industry was ready.",
    "url": "https://apnews.com/article/biden-solar-inflation-reduction-act-dca914675cd0855004214d82aab5b10c"
  },
  {
    "text": "Rep. Troy Nehls Has Stopped Wearing the Combat Infantryman Badge After Accusations of Stolen Valor  —  The Texas Republican doubled down on wearing the badge, which the Army revoked in 2023, for weeks.  He has finally taken it off.  He blames the media.  — Copy",
    "url": "https://www.notus.org/congress/troy-nehls-stops-wearing-combat-infantryman-badge"
  },
  {
    "text": "Police officers who attended Trump's Jan. 6 ‘Stop the Steal’ rally may be allowed to keep their identities private  —  A striking legal question came before justices of the Washington State Supreme Court this week: Does a group of police officers who attended the “Stop the Steal” … ",
    "url": "https://lawandcrime.com/high-profile/police-officers-who-attended-trumps-jan-6-stop-the-steal-rally-may-be-allowed-to-keep-their-identities-private/"
  },
  {
    "text": "Elite misinformation is an underrated problem  —  Important institutions are too eager to mislead people  —  The whole notion of “misinformation” as conventionally construed has taken some blows lately, including scandals in the misinformation research field and, more importantly … ",
    "url": "https://www.slowboring.com/p/elite-misinformation-is-an-underrated"
  },
  {
    "text": "Biden administration to lower costs for 64 drugs through inflation penalties on drugmakers … The Biden administration on Wednesday said it will impose inflation penalties on 64 prescription drugs for the third quarter of this year, lowering costs for certain older Americans enrolled in Medicare.",
    "url": "https://www.cnbc.com/2024/06/26/biden-to-lower-some-drug-costs-through-inflation-penalties.html"
  },
  {
    "text": "Biden Officials Pressed Trans Medical Group to Change Guidelines for Minors, Court Filings Show  —  Newly released emails from an influential group issuing transgender medical guidelines indicate that U.S. health officials lobbied to remove age minimums for surgery in minors because of concerns over political fallout.",
    "url": "https://www.nytimes.com/2024/06/25/health/transgender-minors-surgeries.html"
  }
]