[
  {
    "text": "Mike Johnson's Wife Takes Down Website That Compared Being Gay To Bestiality, Incest  —  HuffPost first reported on Kelly Johnson's counseling service that likens LGBTQ+ people to people who have sex with animals and family members.  —  LOADING  —  House Speaker Mike Johnson's wife took … ",
    "url": "https://www.huffpost.com/entry/mike-johnson-wife-website-homosexuality-bestiality-incest_n_653fd7a9e4b0ae2dc0b49d17"
  },
  {
    "text": "Ex-North Dakota Lawmaker Accused Of Flying To Prague To Rape Minor  —  Ex-Republican state Sen. Ray Holmberg is facing federal charges for intent to rape a minor and receiving images depicting child sexual abuse.  —  A former longtime North Dakota lawmaker is charged with traveling to Prague … ",
    "url": "https://www.huffpost.com/entry/ap-us-former-legislator-indicted-north-dakota_n_653ff3dee4b0a78a26a44b60"
  },
  {
    "text": "Hedge fund billionaire Leon Cooperman, in rare public rebuke of a Republican candidate, says Trump ‘belongs in jail’  —  New York CNN  —  Leon Cooperman, the hedge fund billionaire who has famously clashed with Sen. Elizabeth Warren over her proposed wealth tax, is cautioning voters … ",
    "url": "https://www.cnn.com/2023/10/30/investing/leon-cooperman-trump-biden/"
  },
  {
    "text": "Ivanka Trump Helped Her Dad Lie About His Net Worth  —  When Ivanka Trump takes the stand in her father's fraud case, she should have plenty to talk about.  —  Ivanka Trump is expected to testify on Friday in a $250 million fraud case that the New York attorney general is waging against her father and his associates.",
    "url": "https://www.forbes.com/sites/danalexander/2023/10/30/ivanka-trump-helped-her-dad-lie-about-his-net-worth/"
  },
  {
    "text": "Executive Order on the Safe, Secure, and Trustworthy Development and Use of Artificial Intelligence  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered as follows:  —  Section 1.  Purpose.",
    "url": "https://www.whitehouse.gov/briefing-room/presidential-actions/2023/10/30/executive-order-on-the-safe-secure-and-trustworthy-development-and-use-of-artificial-intelligence/"
  },
  {
    "text": "Ron DeSantis Turns Down Chance To Squash Lifted Shoe Speculation  —  People have been trolling the Florida governor and GOP presidential candidate by claiming his signature cowboy boots have hidden heels.  —  LOADING  —  It looks like Florida Gov. Ron DeSantis can't sidestep ridiculous rumors about his height much longer.",
    "url": "https://www.huffpost.com/entry/ron-desantis-dismisses-heel-boot-rumor_n_65402831e4b0a78a26a470a8"
  },
  {
    "text": "America's Rifle Fetish Is Destroying Its Sense of Freedom  —  In Anthony Mann's 1950 western “Winchester '73,” a rare and much-desired Winchester rifle brings misery and death to the unlucky souls who manage to bring it into their possession.  In the West as brought to you by Mann … ",
    "url": "https://www.nytimes.com/2023/10/31/opinion/maine-mass-shooting-rifles-freedom.html"
  },
  {
    "text": "White House shoots down GOP funding bills  —  The Big Story  —  Biden fires veto warning to House GOP on funding  —  The White House is threatening to veto House Republican funding bills as the party moves quickly to pass partisan spending plans.",
    "url": "https://thehill.com/newsletters/business-economy/4284280-white-house-shoots-down-gop-funding-bills/"
  },
  {
    "text": "‘This war is prophetically significant’: why US evangelical Christians support Israel  —  One strand of evangelical theology holds that the return of Jews to the region starts the clock ticking on a seven-year armageddon, after which Jesus Christ will return",
    "url": "https://www.theguardian.com/world/2023/oct/30/us-evangelical-christians-israel-hamas-war"
  },
  {
    "text": "Las Vegas man charged after making antisemitic threats to Nevada senator  —  John Anthony Miller was arrested Thursday and appeared in federal court a day later in connection with the one count of threatening a federal official, the Justice Department said.  —  A Nevada man has been charged … ",
    "url": "https://www.nbcnews.com/politics/congress/las-vegas-man-charged-making-antisemitic-threats-nevada-senator-rcna122866"
  },
  {
    "text": "Earl Blumenauer Will Not Run for Reelection  —  After 50 years in elected office and 14 terms representing Oregon's 3rd Congressional District, he is retiring.  —  Expand  —  U.S. Rep. Earl Blumenauer, whose 3rd Congressional District runs from Portland east to Hood River … ",
    "url": "https://www.wweek.com/news/2023/10/30/earl-blumenauer-will-not-run-for-re-election/"
  },
  {
    "text": "‘Medical emergency’ leads to another short-handed military post due to Tuberville protest  —  The nation's top Marine has been hospitalized due to a “medical emergency,” officials say, leaving a three-star ranked leader to take charge thanks to a stalled confirmation process led by Sen. Tommy Tubervile over the Corps' abortion policy.",
    "url": "https://www.rawstory.com/tommy-tuberville-marine-corps/"
  },
  {
    "text": "Alabama Pol Jailed for FaceTiming Witness in His Bribery Case  —  SORRY, WRONG NUMBER  —  An 82-year-old state lawmaker from Alabama was sent to jail on Monday for FaceTiming a witness—the founder of a gospel music non-profit he allegedly tried to bribe to lie to the FBI about a kickback scheme.",
    "url": "https://www.thedailybeast.com/alabama-rep-john-rogers-jailed-for-facetiming-witness-in-his-bribery-case"
  },
  {
    "text": "Montenegro votes in new government with Milojko Spajic prime minister  —  After weeks of negotiations, Montenegro's parliament on Tuesday appointed a new government, a coalition of pro-European and pro-Serb parties expected to lead the small Balkan country in its bid to join the European Union.",
    "url": "https://www.reuters.com/world/europe/montenegro-votes-new-government-with-milojko-spajic-prime-minister-2023-10-31/"
  },
  {
    "text": "Antisemitic mob storms through Russian airport as flight from Tel Aviv lands  —  An angry crowd in Russia's mostly Muslim region of Dagestan stormed an airport where a flight from Israel arrived on Sunday, forcing authorities to close the facility and divert flights.",
    "url": "https://www.cnn.com/2023/10/30/europe/russia-dagestan-airport-anti-israel-intl-hnk/"
  },
  {
    "text": "White House details draft plans for next student debt relief plan  —  The draft regulatory plans outline what are essentially four separate student debt relief programs for different categories of borrowers.  —  President Joe Biden is considering canceling student debt for borrowers whose balances … ",
    "url": "https://www.politico.com/news/2023/10/30/white-house-next-student-debt-relief-plan-00124351"
  },
  {
    "text": "Far-right German politician arrested after ‘Sieg Heil’ salutes heard  —  Banned totalitarian symbols found at fraternity of Daniel Halemba, 22, who takes up seat in Bavarian legislature on Thursday  —  A legislator with the far-right Alternative für Deutschland (AfD) … ",
    "url": "https://www.theguardian.com/world/2023/oct/30/far-right-german-politician-arrested-after-sieg-heil-salutes-heard"
  },
  {
    "text": "‘Be looking over your shoulder’: MAGA man arrested for threats against Fani Willis  —  A 59-year-old supporter of Donald Trump has been arrested for threats against Fulton County District Attorney Fani Willis and Fulton County Sheriff Pat Labat, Atlanta Journal-Constitution reporter Tamar Hallerman posted on social media Monday.",
    "url": "https://www.rawstory.com/fani-willis-maga-trump-threats/"
  },
  {
    "text": "U.S. Department of Education Announces Withholding of Payment to Student Loan Servicer as Part of Accountability Measures for Harmed Borrowers  —  Contact:  Press Office, (202) 401-1576, press@ed.gov  —  U.S. Secretary of Education Miguel Cardona and Federal Student Aid (FSA) … ",
    "url": "https://www.ed.gov/news/press-releases/us-department-education-announces-withholding-payment-student-loan-servicer-part-accountability-measures-harmed-borrowers"
  },
  {
    "text": "Outraised and embattled, Lauren Boebert heads back to Colorado with a revamped campaign strategy  —  Retreating from the turmoil in Washington, D.C., Rep. Lauren Boebert arrived in bucolic southwest Colorado to turmoil of a different sort — the lingering impact of an embarrassing moment … ",
    "url": "https://apnews.com/article/boebert-gop-voters-campaign-apology-reelection-frisch-af8cf7cb563e6b97bc75f3e8b849281c"
  },
  {
    "text": "GM, UAW reach tentative deal after weeks of contract negotiations  —  Jamie L. LaReau Eric D. LawrenceDetroit Free Press  —  General Motors and the United Auto Workers have reached a tentative agreement, less than 48 hours after the union struck the automaker's Spring Hill Assembly plant in Tennessee … ",
    "url": "https://www.freep.com/story/money/cars/general-motors/2023/10/30/gm-uaw-deal-contract-negotiations-update/71334972007/"
  },
  {
    "text": "House Israel aid bill includes $14.3 billion by slashing IRS funds  —  The Israel aid package, which includes proposed cuts to President Joe Biden's signature Inflation Reduction Act, has not been well received by Democrats.  They “are already blasting newly minted Speaker Johnson for politicizing … ",
    "url": "https://www.nbcnews.com/meet-the-press/video/house-israel-aid-bill-includes-14-3-billion-by-slashing-irs-funds-196725317628"
  }
]