[
  {
    "text": "Trump Received Millions From Foreign Governments as President, Report Finds  —  House Democrats released evidence that the former president took in at least $7.8 million from foreign entities while in office, engaging in the kind of conduct the G.O.P. is grasping to pin on President Biden.",
    "url": "https://www.nytimes.com/2024/01/04/us/politics/trump-hotels-foreign-business-report.html"
  },
  {
    "text": "Florida surgeon general calls for halt on mRNA covid vaccines, citing debunked claim  —  Florida's top health official called for a halt to using mRNA coronavirus vaccines on Wednesday, contending that the shots could contaminate patients' DNA — a claim that has been roundly debunked … ",
    "url": "https://www.washingtonpost.com/health/2024/01/03/florida-surgeon-general-ladapo-covid-vaccine/"
  },
  {
    "text": "Claudine Gay and America's new class system  —  Ibram X. Kendi's “anti-racist” pronouncements are pure grift, but his woke prestige makes them a good place to start in examining Claudine Gay's belated exit as Harvard University's first black president.  In her long-overdue resignation letter Tuesday … ",
    "url": "https://www.washingtonexaminer.com/opinion/claudine-gay-and-americas-new-class-system"
  },
  {
    "text": "'This Isn't About Plagiarism or Anti-Semitism': Jamaal Bowman Cries Racism Over Claudine Gay Resignation  —  ‘The only winners are fascists who bullied a brilliant and historic black woman,’ New York congressman says  —  New York congressman Jamaal Bowman is rushing to former Harvard … ",
    "url": "https://freebeacon.com/campus/this-isnt-about-plagiarism-or-anti-semitism-jamaal-bowman-cries-racism-over-claudine-gay-resignation/"
  },
  {
    "text": "1/4/24 ☀️ Punchbowl News AM … House Republicans seem to be itching to have a fight over border security as part of the government funding debate heading into the Jan. 19 and Feb. 2 shutdown deadlines.  Back in Washington, Senate negotiators and the Biden administration … ",
    "url": "https://punchbowl.news/archive/1424-punchbowl-news-am/"
  },
  {
    "text": "Chicago in January with flip flops  —  Judd Legum, Tesnim Zekeria, and Rebecca Crosby  —  Texas Governor Greg Abbott (R) says he has transported 95,000 migrants from the Texas border to New York, Washington, DC, and other cities.  On New Year's Eve, Abbott flew hundreds of migrants … ",
    "url": "https://popular.info/p/chicago-in-january-with-flip-flops"
  },
  {
    "text": "Biden moving up planned speech on democracy due to expected winter storm  —  President Biden moved his speech on democracy, marking the anniversary of Jan. 6, up a day due to the incoming winter storm in the Northeast and mid-Atlantic regions this weekend.  —  The president was set to travel … ",
    "url": "https://thehill.com/homenews/administration/4388709-biden-moving-speech-on-democracy-jan-6-winter-storm/"
  },
  {
    "text": "Biden administration awarding $162M to expand computer chip factories in Colorado, Oregon  —  The Biden administration announced an agreement Thursday to provide $162 million in federal funding to Microchip Technology to expand production of computer chips domestically, the second tranche … ",
    "url": "https://thehill.com/homenews/administration/4388788-biden-administration-funding-chip-factories-colorado-oregon/"
  },
  {
    "text": "Most Republicans think Donald Trump is a person of faith.  We asked why  —  More Republicans see Trump as a ‘person of faith’ than as ‘religious’  —  Most Republican voters consider former President Donald Trump to be a person of faith, putting him ahead of other more vocally religious individuals … ",
    "url": "https://www.deseret.com/2024/1/3/23982720/republicans-think-donald-trump-is-person-of-faith-we-asked-why"
  },
  {
    "text": "‘Beyond Crazy’: The Liberal Jew Mugged by a Post-Oct. 7 World  —  French rabbi Delphine Horvilleur says the antisemitism in the U.S. following Hamas' attack on Israel is not so surprising — and all too familiar.  —  SAINT-JEAN-CAP-FERRAT, France —  “If I had been given one dollar … ",
    "url": "https://www.politico.com/news/magazine/2024/01/04/delphine-horvilleur-antisemitism-france-00133462"
  },
  {
    "text": "The Fifth Circuit just made it even more dangerous to be pregnant in a red state  —  The Trumpiest court in America just tried to neutralize a federal law requiring most hospitals to provide medically necessary abortions.  —  On Tuesday, a notoriously right-wing federal appeals court attempted … ",
    "url": "https://www.vox.com/scotus/2024/1/3/24023889/abortion-supreme-court-emtala-fifth-circuit-texas-becerra"
  },
  {
    "text": "A quarter of Americans believe FBI instigated Jan. 6, Post-UMD poll finds  —  More than 3 in 10 Republicans have adopted the falsehood that the FBI conspired to cause the Capitol riot  —  Twenty-five percent of Americans say it is “probably” or “definitely” true that the FBI instigated the Jan. 6 … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2024/01/04/fbi-conspiracy-jan-6-attack-misinformation/"
  },
  {
    "text": "The names of more than 170 Jeffrey Epstein associates were just revealed in unsealed court documents.  Here's what we know.  — The names of more than 170 Jeffrey Epstein associates were just unsealed.  — Powerful associates like Bill Clinton, Prince Andrew, Glenn Dubin, and Jean Luc Brunel are in the documents.",
    "url": "https://www.businessinsider.com/jeffrey-epstein-list-names-unsealed-doe-court-documents-2024-1"
  },
  {
    "text": "Former Harvard President Claudine Gay: This Is About More Than My Mistakes  —  On Tuesday, I made the wrenching but necessary decision to resign as Harvard's president.  For weeks, both I and the institution to which I've devoted my professional life have been under attack.",
    "url": "https://www.nytimes.com/2024/01/03/opinion/claudine-gay-harvard-president.html"
  },
  {
    "text": "Islamic State claims responsibility for attacks that killed nearly 100 people in Iran - group on telegram  —  Islamic State claimed responsibility on Thursday for two explosions that killed nearly 100 people and wounded scores at a ceremony in Iran to commemorate commander Qassem Soleimani, who was killed by a U.S. drone in 2020.",
    "url": "https://www.reuters.com/world/middle-east/islamic-state-claims-responsibility-attacks-that-killed-nearly-100-people-iran-2024-01-04/"
  },
  {
    "text": "Florida man arrested and accused of threatening to kill Rep. Eric Swalwell and his kids  —  Prosecutors say a 72-year-old man from Greenacres left voicemail messages that included threats to “come after you and kill you” and “come and kill your children.”  —  A Florida man was arrested Wednesday … ",
    "url": "https://www.nbcnews.com/politics/congress/florida-man-arrested-allegedly-threatening-kill-rep-eric-swalwell-kids-rcna132198"
  },
  {
    "text": "Christie Says in a New Ad That He Was Wrong to Support Trump in 2016  —  “Now, we're confronted with the very same choice again,” former Gov. Chris Christie of New Jersey said in the ad, rejecting calls to end his campaign in order to narrow the anti-Trump field.",
    "url": "https://www.nytimes.com/2024/01/04/us/politics/christie-trump-ad.html"
  },
  {
    "text": "Progressive group files FEC complaint against Phillips campaign  —  A progressive watchdog organization has filed a Federal Election Commission (FEC) complaint against Rep. Dean Phillips (D-Minn.), alleging his presidential campaign improperly coordinated with a super PAC.",
    "url": "https://thehill.com/homenews/campaign/4388846-fec-complaint-dean-phillips-2024-election/"
  },
  {
    "text": "Multiple state Capitols evacuated due to mass-emailed bomb threats  —  Capitol buildings in multiple states were temporarily shut down and evacuated Wednesday because of threats.  —  “It was a mass email sent to several (Secretaries of State) and state offices across the country,” … ",
    "url": "https://www.cnn.com/2024/01/03/us/state-capitols-threats/"
  }
]