[
  {
    "text": "China Raises Tariffs on US Goods to 125% in Retaliation … China retaliated against Donald Trump's latest tariffs by hiking duties on all US goods, while calling the administration's actions a “joke” and saying it no longer considers them worth matching.  —  Beijing will raise tariffs … ",
    "url": "https://www.bloomberg.com/news/articles/2025-04-11/china-raises-tariffs-on-us-goods-to-125-in-retaliation"
  },
  {
    "text": "Space Force Commander in Greenland Sent Out Email Breaking with Vance After His Visit  —  Just days after Vice President JD Vance's March visit to Pituffik Space Base in Greenland, the installation commander sent out an email to the base distancing it from Vance's criticism of Denmark … ",
    "url": "https://www.military.com/daily-news/2025/04/10/space-force-commander-greenland-sent-out-email-breaking-vance-after-his-visit.html"
  },
  {
    "text": "US fires Greenland military base chief for ‘undermining’ Vance  —  The head of the US military base in Greenland has been fired after she reportedly sent an email distancing herself from Vice-President JD Vance's criticism of Denmark.  —  The US military's Space Operations Command … ",
    "url": "https://www.bbc.com/news/articles/creq99l218do"
  },
  {
    "text": "Supreme Court says Trump administration must work to bring back mistakenly deported Maryland man  —  The Supreme Court on Thursday said the Trump administration must work to bring back a Maryland man who was mistakenly deported to prison in El Salvador, rejecting the administration's emergency appeal.",
    "url": "https://apnews.com/article/supreme-court-maryland-deportation-trump-9f46dd62890befdc321ed1ab56107470"
  },
  {
    "text": "Breaking: SCOTUS says Trump admin must “facilitate” Kilmar Abrego Garcia's return  —  The U.S. Supreme Court on Thursday evening upheld a district court's order that the Trump administration “facilitate and effectuate” the return of Kilmar Abrego Garcia, the man sent to a prison El Salvador illegally … ",
    "url": "https://www.lawdork.com/p/breaking-scotus-says-trump-admin"
  },
  {
    "text": "Government Spending Continues to Climb Even as DOGE Touts Cuts  —  Musk team's $150 billion in savings barely dents $6.8 trillion in spending largely on autopilot, WSJ analysis finds  —  Cumulative total spending since Trump's inauguration compared with the same periods in 2023 and 2024",
    "url": "https://www.wsj.com/politics/policy/trump-doge-government-spending-increases-5903992d"
  },
  {
    "text": "Social Security Lists Thousands of Migrants as Dead to Prompt Them to ‘Self-Deport’ … Migrants who arrived in New York last year waited for shelter assignments at the Roosevelt Hotel.Todd Heisler/The New York Times  —  Since taking office, the Trump administration has moved aggressively … ",
    "url": "https://www.nytimes.com/2025/04/10/us/politics/migrants-deport-social-security-doge.html?unlocked_article_code=1.-k4.T5Nf.m-Dm8UB0A62d&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Trump doubles down on prosecuting his political enemies  —  I've got to hand it to President Trump.  I would not have thought it possible, but he did something on Wednesday that distracted me from his tariff train wreck.  —  Of course, I'm not saying this is a good thing.",
    "url": "https://thehill.com/opinion/judiciary/5242757-trump-krebs-taylor-justice/"
  },
  {
    "text": "The Conservative Activist Pushing Trump to Attack U.S. Colleges  —  Christopher Rufo has helped inspire Republican messaging and bills on hot-button issues.  —  Produced by Eric Krupke and Asthaa Chaturvedi  —  Original music by Marion Lozano and Dan Powell  —  Listen and follow ‘The Daily’",
    "url": "https://www.nytimes.com/2025/04/11/podcasts/the-daily/christopher-rufo-dei-critical-race-theory.html"
  },
  {
    "text": "Six people have died in a helicopter crash in the Hudson River in New York City, an AP source says  —  A helicopter broke apart in midair and crashed upside-down into the Hudson River between Manhattan and the New Jersey waterfront Thursday, killing all six people aboard in the latest high … ",
    "url": "https://apnews.com/article/new-york-helicopter-crash-e0368ea529659ee1513d92dcbf05a28d"
  },
  {
    "text": "Visas revoked for students, graduates at multiple Texas universities amid deportation efforts  —  A growing number of international students attending Texas universities have had their visas revoked by the U.S. government as part of a nationwide crackdown on student activism at public campuses.",
    "url": "https://www.keranews.org/texas-news/2025-04-10/visas-texas-students-revoked-protests-deportation"
  },
  {
    "text": "How DOGE may have improperly used Social Security data to push voter fraud narratives  —  One of Elon Musk's Department of Government Efficiency lieutenants working in the Social Security Administration has been pushing dubious claims about noncitizens voting, apparently using access to data … ",
    "url": "https://www.npr.org/2025/04/11/nx-s1-5352470/doge-musk-social-security-voting"
  },
  {
    "text": "Fox News Accidentally Wrecks Trump's Tariff Spin as MAGA Panic Worsens  —  After President Trump's supposed tariff “pause,” we still have a 10 percent tariff on most global imports; the trade war with China is intensifying; and markets have plunged again.  Fox News figures are aggressively spinning the … ",
    "url": "https://newrepublic.com/article/193884/fox-news-accidentally-wrecks-trump-tariff-spin-maga-panic-worsens"
  },
  {
    "text": "US law firms quietly scrub DEI references from websites to appease Trump  —  Changes at two dozen prestigious firms underscore Trump's successful intimidation campaign against legal profession  —  Democracy and justice is supported by  —  Nearly two dozen US law firms have quietly scrubbed references … ",
    "url": "https://www.theguardian.com/us-news/2025/apr/11/law-firms-dei"
  },
  {
    "text": "CDC's cruise ship inspectors laid off amid bad year for outbreaks  —  All of the full-time employees in the Centers for Disease Control and Prevention's Vessel Sanitation Program are now off the job, multiple officials tell CBS News, gutting the agency's ability to investigate outbreaks and conduct health inspections on cruise ships.",
    "url": "https://www.cbsnews.com/news/cdc-cruise-ship-inspectors-layoffs-outbreaks-norovirus/"
  },
  {
    "text": "US consumer sentiment plummets to second-lowest level on records going back to 1952  —  Americans are rarely this pessimistic about the economy.  —  Consumer sentiment plunged 11% this month to a preliminary reading of 50.8, the University of Michigan said in its latest survey released Friday … ",
    "url": "https://cnn.com/2025/04/11/economy/us-consumer-sentiment-april"
  },
  {
    "text": "Florida's DOGE agency asks university faculty to hand over research  —  A letter sent last week asks colleges to compile a list of all research and grants.  —  Gov. Ron DeSantis' office has asked colleges and universities across Florida to hand over detailed information on grants received … ",
    "url": "https://www.tampabay.com/news/education/2025/04/10/floridas-doge-agency-asks-university-faculty-hand-over-research/"
  },
  {
    "text": "Gay Venezuelan stylist sent to Salvadoran prison after a disgraced Milwaukee cop's report  —  A disgraced former Milwaukee cop with credibility issues helped seal the fate of a gay Venezuelan makeup artist sent to El Salvador's notorious prison, according to documents reviewed by USA TODAY.",
    "url": "https://eu.jsonline.com/story/news/investigations/2025/04/10/fired-milwaukee-cops-report-helped-send-gay-stylist-to-el-salvador/83023882007/"
  },
  {
    "text": "AI Slop Farms Are Churning Out Fake Heartwarming Videos About Trump Figures  —  Machine-made YouTube videos are racking up views while fooling the MAGA faithful.  —  The judge demanded that White House Press Secretary Karoline Leavitt remove her cross necklace, but soon he was humiliated.",
    "url": "https://www.motherjones.com/politics/2025/04/ai-slop-donald-trump-youtube/"
  },
  {
    "text": "Massive cuts to NASA science proposed in early White House budget plan  —  The preliminary version of President Donald Trump's budget proposal to Congress, known as a “passback,” would cut the agency's science budget funding nearly in half.  —  NASA's science budget could be cut nearly … ",
    "url": "https://www.washingtonpost.com/science/2025/04/11/nasa-science-budget-cuts-trump/"
  }
]