[
  {
    "text": "The Sad, Pathetic Spectacle of John Kelly's Critics  —  WHEN GEN. JOHN KELLY WENT PUBLIC about Trump's praise for Hitler and his fears about a dictatorial second Trump term, he joined a growing list of former Trump officials ringing the alarm.  —  He also sparked what has become a pathetic … ",
    "url": "https://www.thebulwark.com/p/the-sad-pathetic-spectacle-of-john"
  },
  {
    "text": "Fox Host Says Maybe Trump Didn't Realize Hitler's Generals Were Nazis  —  Trump's former chief of staff said on Tuesday that the former president said he needed “the kind of generals that Hitler had” … On Tuesday, Kelly told The New  York Times that the former president meets the established definition of fascism.",
    "url": "https://www.rollingstone.com/politics/politics-news/fox-host-maybe-trump-hitler-generals-nazis-1235140921/"
  },
  {
    "text": "Three Reasons I'm Certain Kamala Harris Will Win  —  There is a palpable anxiety wailing on the winds of American life right now.  More than in any other election in my lifetime, I've been consistently asked by people of all stripes and creeds: “Can Kamala Harris win this thing?  Are we going to be OK?”",
    "url": "https://www.nytimes.com/2024/10/23/opinion/kamala-harris-win-election.html?unlocked_article_code=1.UU4.Dppr.wIh0xy1BzQfE&smid=nytcore-ios-share&referringSource=articleShare&tgrp=cpy"
  },
  {
    "text": "Here's What My Gut Says About the Election, but Don't Trust Anyone's Gut, Even Mine  —  In an election where the seven battleground states are all polling within a percentage point or two, 50-50 is the only responsible forecast.  Since the debate between Kamala Harris and Donald Trump … ",
    "url": "https://www.nytimes.com/2024/10/23/opinion/election-polls-results-trump-harris.html?unlocked_article_code=1.UU4.M0l1.AcCc5_9jpjz2&smid=url-share"
  },
  {
    "text": "“Red Wave” Redux: Are GOP Polls Rigging the Averages in Trump's Favor?  —  Last month, a GOP-friendly polling firm presented itself, and its data, in a highly unusual way.  Rather than maintain a nominally neutral public-facing profile, this pollster acted more like a cavalry brigade for Donald Trump's campaign.",
    "url": "https://newrepublic.com/article/187425/gop-polls-rigging-averages-trump"
  },
  {
    "text": "Justice Department warns Elon Musk that his $1 million giveaway to registered voters may be illegal  —  The Justice Department warned Elon Musk's America PAC in recent days that his $1 million sweepstakes to registered voters in swing states may violate federal law, people briefed on the matter told CNN.",
    "url": "https://www.cnn.com/2024/10/23/politics/elon-musk-justice-department-letter/"
  },
  {
    "text": "Justice Department warns Musk's PAC that $1M voter giveaway could be illegal  —  Pressure has mounted on prosecutors in recent days to scrutinize the lottery-style stunt.  —  The Justice Department has sent a letter to tech billionaire Elon Musk's super PAC, America PAC … ",
    "url": "https://www.nbcnews.com/tech/tech-news/doj-warns-musk-1m-petition-giveaway-illegal-rcna176911"
  },
  {
    "text": "Justice Department Warns Musk That His $1 Million Giveaway Might Be Illegal  —  Elon Musk's super PAC, which supports Donald Trump's presidential bid, is giving cash prizes to registered voters who sign a petition.  —  The Justice Department sent a letter to the super PAC founded by Elon Musk … ",
    "url": "https://www.nytimes.com/2024/10/23/us/politics/elon-musk-department-of-justice-giveaway.html"
  },
  {
    "text": "Harris to deliver closing argument speech Tuesday on the National Mall  —  The vice president is slated to present her final case to the American people in D.C. exactly one week before Election Day.  —  Vice President Kamala Harris is planning to deliver her closing argument Tuesday in a speech … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2024/10/23/kamala-harris-campaign-rally-dc-national-mall-election/"
  },
  {
    "text": "Donald Trump fixates on Harris aide Ian Sams, who goads him on Fox News  —  Trump and his aides have repeatedly publicly attacked Sams for his criticism of the former president during Fox interviews.  —  In the final three weeks of the presidential race, former president Donald Trump … ",
    "url": "https://www.washingtonpost.com/politics/2024/10/23/trump-ian-sams-fox-harris/"
  },
  {
    "text": "Wrong-way driver passes Harris motorcade on Milwaukee highway  —  The driver was a 55-year-old Milwaukee man suspected of being impaired who was taken into custody, authorities said.  —  A suspected drunk driver going the wrong way on a highway in Milwaukee came close to Vice President … ",
    "url": "https://www.washingtonpost.com/elections/2024/10/23/wrong-way-drive-harris-motorcade/"
  },
  {
    "text": "Kamala Harris is right, Trump 2.0 would be “unhinged,” aimed at “unchecked power”  —  Donald Trump is dangerous.  The Supreme Court and Congress failed us.  Now, it's up to us.  As Harris said Wednesday, “What do the American people want?”  —  On Wednesday, Vice President Kamala Harris gave brief … ",
    "url": "https://www.lawdork.com/p/kamala-harris-v-donald-trump-unchecked-power"
  },
  {
    "text": "“Not Medically Necessary”: Inside the Company Helping America's Biggest Health Insurers Deny Coverage for Care  —  Co-published with The Capitol Forum  —  Uncovered: How the Insurance Industry Denies Coverage to Patients  — Dialing for Dollars: America's largest insurers hire EviCore … ",
    "url": "https://www.propublica.org/article/evicore-health-insurance-denials-cigna-unitedhealthcare-aetna-prior-authorizations"
  },
  {
    "text": "Judge's ultimatum forces deal to shelve subpoena fight in House GOP probe of Hunter Biden  —  'Don't test me on this,' Judge Ana Reyes intoned, betting her dog that the subpoenas wouldn't yield the info Republicans are seeking.  —  A highly unusual ultimatum from a frustrated judge caused … ",
    "url": "https://www.politico.com/news/2024/10/23/subpoena-fight-hunter-biden-00185119"
  },
  {
    "text": "It's Possible to Track Someone's Personal Phone to an Abortion Clinic.  And It's Legal Too.  —  A company got access to a mobile phone-tracking tool used by law enforcement and U.S. government agencies across the country.  They found significant privacy vulnerabilities.  — Copy",
    "url": "https://www.notus.org/technology/cell-phone-tracking-law-enforcement-abortion-clinic"
  },
  {
    "text": "U.S. Study on Puberty Blockers Goes Unpublished Because of Politics, Doctor Says  —  The leader of the long-running study said that the drugs did not improve mental health in children with gender distress and that the finding might be weaponized by opponents of the care.",
    "url": "https://www.nytimes.com/2024/10/23/science/puberty-blockers-olson-kennedy.html?unlocked_article_code=1.UU4.1SEh.eaaVvaj1FXOT&smid=url-share"
  },
  {
    "text": "Her billionaire marriage broke up.  Her VP campaign fizzled.  Now she's a Trump-world star.  —  With a massive divorce settlement from Google co-founder Sergey Brin, Nicole Shanahan is remaking herself as a pro-Trump wellness guru — raising alarm in Silicon Valley.",
    "url": "https://www.washingtonpost.com/technology/2024/10/23/nicole-shanahan-maga-make-america-healthy-trump-rfk-jr/"
  },
  {
    "text": "Donald Trump campaign manager shared posts in 2021 saying Trump's lies caused the violence on January 6  —  In the immediate aftermath of the January 6, 2021, attack on the US Capitol, a number of conservatives and Republicans broke ranks with then-President Donald Trump and blamed him for the violence that day.",
    "url": "https://www.cnn.com/2024/10/23/politics/trump-campaign-manager-january-6/"
  },
  {
    "text": "Democrat raises alarm over Trump campaign's failure to enter into transition agreements  —  Rep. Jamie Raskin (D-Md.) is raising concerns about the Trump campaign's failure to enter into presidential transition agreements with the federal government, cautioning that the delay could negatively impact … ",
    "url": "https://thehill.com/homenews/house/4949533-raskin-trump-transition-agreement/"
  },
  {
    "text": "Swing State Poll 2024: Michigan, Wisconsin: Gender Divide Defines Tight Races In Rust Belt Battlegrounds, Quinnipiac University Poll Finds; U.S. Senate Races: Dem Holds Lead In MI, Very Close In WI  —  mail_outline  —  MICHIGAN: Harris 49%, Trump 46%, other candidates 2%",
    "url": "https://poll.qu.edu/poll-release?releaseid=3915"
  },
  {
    "text": "Republicans say they're getting swamped in state legislatures  —  Republicans are sounding the alarm that they need to close the money gap with Democrats in the battle for state legislatures, calling the “financial disparity this cycle ... more significant than ever.”",
    "url": "https://www.politico.com/live-updates/2024/10/23/2024-elections-live-coverage-updates-analysis/republicans-state-legislatures-00185017"
  },
  {
    "text": "I'm a College President.  Universities Aren't Ready for What's Coming.  —  Universities are trying to stay out of politics.  It's coming at the worst possible time.  —  It is urgent that the leaders of colleges and universities stand up in defense of their interests and the values of higher education.",
    "url": "https://slate.com/life/2024/10/trump-college-presidents-politics-liberal-conservative.html"
  },
  {
    "text": "Dem allies promoting third-party candidates  —  House Democrats are turning to unlikely saviors to help their nominees win in difficult districts: third-party candidates.  In Montana, Ohio and Alaska, the Democratic Congressional Campaign Committee is signaling to its allies … ",
    "url": "https://www.politico.com/live-updates/2024/10/23/2024-elections-live-coverage-updates-analysis/democrats-house-races-alaska-montana-00185160"
  },
  {
    "text": "Georgia audit finds 20 noncitizens registered to vote  —  Secretary of State Brad Raffensperger canceled their registrations and referred cases to law enforcement  —  An audit uncovered 20 noncitizens out of 8.2 million registered voters in Georgia, according to findings announced by Secretary of State Brad Raffensperger on Wednesday.",
    "url": "https://www.ajc.com/politics/election-audit-shows-20-noncitizens-registered-to-vote-in-georgia/NRORAL7Z3RDSNMQ3QDLVEARPSY/"
  }
]