[
  {
    "text": "Live Updates: Prosecutors Say Trump's Attacks Are Threat to Trial  —  Prosecutors in Donald J. Trump's criminal trial want him held in contempt for attacking witnesses and others close to the case, which centers on a hush-money payment to a porn star.  Testimony is set to resume later Tuesday morning.",
    "url": "https://www.nytimes.com/live/2024/04/23/nyregion/trump-hush-money-trial-news"
  },
  {
    "text": "Trump was going to dominate the courtroom.  Instead, he is shrinking.  —  For months, the news coverage of Donald Trump's legal ordeal eagerly amplified the four-times-indicted former president's narcissistic spin: He would use his trials to his benefit, dominating the 2024 campaign.",
    "url": "https://www.washingtonpost.com/opinions/2024/04/23/trump-losing-courtroom-campaign-bragg-trial/"
  },
  {
    "text": "Mike Johnson's Momentous Shift  —  At a crucial juncture, the speaker went from pandering to Trump to managing him and from challenging the Democrats to working with them.  —  There are no atheists in foxholes and few isolationists in high office.  —  Confronted with sobering briefings revealing Ukraine … ",
    "url": "https://www.politico.com/news/magazine/2024/04/23/mike-johnson-ukraine-shift-00153825"
  },
  {
    "text": "Playbook: Trump to MTG: Give it a rest  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  SPOILER ALERT — “Republicans are starting to worry about RFK Jr.,” by Lisa Kashinsky, Brittany Gibson, Jessica Piper and Steven Shepard: “'Kennedy was introduced … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/04/23/trump-to-mtg-give-it-a-rest-00153784"
  },
  {
    "text": "Kari Lake says ‘unfortunately’ Arizona isn't enforcing 1864 abortion ban, flipping again  —  The Senate candidate supported the 19th-century ban in 2022, came out against it this month, and now appears to be backing it again in a new interview.  —  Arizona GOP Senate candidate Kari Lake … ",
    "url": "https://www.nbcnews.com/politics/2024-election/kari-lake-says-unfortunately-arizona-isnt-enforcing-1864-abortion-ban-rcna148948"
  },
  {
    "text": "House GOP conservatives galvanize against Tony Gonzales … Hardline House GOP conservatives tell us they're feeling a renewed sense of motivation to go after Gonzales after he called out Rep. Matt Gaetz (R-Fla.) and House Freedom Caucus Chair Bob Good (R-Va.) on CNN this weekend.",
    "url": "https://punchbowl.news/article/tony-gonzales-brandon-herrera-primary-runoff/"
  },
  {
    "text": "Inside the Off-the-Record Calls Held by Anti-Trump Legal Pundits  —  Some of the country's most prominent legal commentators are holding off-the-record sessions to hash out the latest twists and turns in Donald Trump's legal saga.  —  As the Jan. 6 committee was working on its bombshell investigation … ",
    "url": "https://www.politico.com/news/magazine/2024/04/23/anti-trump-legal-pundits-calls-00153300"
  },
  {
    "text": "Pro-Palestinian protests sweep US college campuses following mass arrests at Columbia  —  Biden says he condemns ‘the anti-Semitic protests’ on college campuses  —  Columbia canceled in-person classes, dozens of protesters were arrested at New York University and Yale … ",
    "url": "https://apnews.com/article/columbia-yale-israel-palestinians-protests-56c3d9d0a278c15ed8e4132a75ea9599"
  },
  {
    "text": "Minnesota state senator arrested on burglary charge  —  A Minnesota state senator has been charged with first-degree burglary after being arrested in the city of Detroit Lakes early Monday morning.  —  Democratic state Sen. Nicole Mitchell, 49, was arrested at a residence after police responded … ",
    "url": "https://thehill.com/homenews/state-watch/4615108-minnesota-state-senator-arrested-burglary-charge/"
  },
  {
    "text": "How Republicans castrated themselves … - Letting any member call a vote on removing the speaker. … - Surrendering authority of the Rules Committee, which sets the terms for how legislation will be handled during votes.",
    "url": "https://www.axios.com/2024/04/23/republicans-speaker-motion-vacate-rules-committee"
  },
  {
    "text": "No Soft Power Shake-Ups for Now  —  Germany is No. 1 in leadership approval ratings; Russia is unpopular  —  This article is the first in a series detailing the results from the latest Rating World Leaders report, which analyzes trends in approval ratings of the leadership of the U.S., Germany, Russia and China in over 130 countries.",
    "url": "https://news.gallup.com/poll/643853/no-soft-power-shake-ups.aspx"
  },
  {
    "text": "Biden's New Chopper Is Demoted After Scorching White House Lawn  — New presidential helicopters delayed under $5 billion program  — Marine One helicopter is iconic symbol of American president … The VH-92 Patriot is landing only on paved runways for now, flying missions … ",
    "url": "https://www.bloomberg.com/news/articles/2024-04-23/lockheed-still-can-t-solve-marine-one-s-scorched-grass-problem"
  },
  {
    "text": "Trump Calls for More Protests Outside Trial: ‘Rally Behind MAGA’  —  With support from demonstrators in Lower Manhattan spotty so far, Donald Trump issued a call to “rally behind MAGA,” and suggested the poor turnout was a result of a plot against his supporters.",
    "url": "https://www.nytimes.com/2024/04/22/us/politics/trump-trial-protests.html"
  },
  {
    "text": "You don't want immigrants?  Then tell grandma she can never retire.  —  Don't want more immigrants in this country?  Then tell grandma she can never retire.  —  As I've noted before, immigrants are driving the U.S. economic boom.  That is: The United States has escaped recession … ",
    "url": "https://www.washingtonpost.com/opinions/2024/04/23/immigration-jobs-economy/"
  },
  {
    "text": "Biden rule grants overtime pay to 4 million US workers  —  The administration of U.S. President Joe Biden on Tuesday unveiled a rule extending mandatory overtime pay to an estimated 4 million salaried workers, going even further than an Obama-era rule that was struck down in court.",
    "url": "https://www.reuters.com/world/us/biden-rule-grants-overtime-pay-4-million-us-workers-2024-04-23/"
  },
  {
    "text": "No one buys books  —  In 2022, Penguin Random House wanted to buy Simon & Schuster.  The two publishing houses made up 37 percent and 11 percent of the market share, according to the filing, and combined they would have condensed the Big Five publishing houses into the Big Four.",
    "url": "https://www.elysian.press/p/no-one-buys-books"
  },
  {
    "text": "US agency poised to ban worker ‘noncompete’ agreements  —  The U.S. Federal Trade Commission (FTC) is expected on Tuesday to approve a rule that would ban agreements commonly signed by workers not to join their employers' competitors, which it says limit worker mobility and suppress their pay.",
    "url": "https://www.reuters.com/world/us/us-agency-poised-ban-worker-noncompete-agreements-2024-04-23/"
  },
  {
    "text": "Melania Quietly Emerges From the Shadows—at a Sparse Event for Log Cabin Republicans  —  BACK IN BLACK  —  Melania Trump's return to the campaign trail is just beginning.  But it was notable that she chose a small gathering for Log Cabin Republicans for her first solo event.",
    "url": "https://www.thedailybeast.com/melania-trump-quietly-emerges-from-the-shadowsat-a-sparse-event-for-log-cabin-republicans"
  },
  {
    "text": "‘Plasmic Echo’ was FBI code name for Trump classified documents probe  —  The FBI's code name for its investigation into former President Trump's handling of classified documents was “Plasmic Echo,” according to court filings published Monday.  —  The name was listed in unredacted court … ",
    "url": "https://thehill.com/regulation/court-battles/4613537-plasmic-echo-was-fbi-code-name-for-trump-classified-documents-probe/"
  },
  {
    "text": "Few have heard about Biden's climate policies, even those who care most about issue — CBS News poll  —  President Joe Biden made addressing climate change a key issue in his 2020 campaign.  Three years into his presidency, what do those who care about the issue most think about what he's done?",
    "url": "https://www.cbsnews.com/news/climate-policies-biden-poll/"
  },
  {
    "text": "Republicans are starting to worry about RFK Jr.  —  Even Donald Trump acknowledged Monday that the independent candidate “probably hurts both” Biden and him.  —  Republicans are waking up to the reality that Robert F. Kennedy Jr. could sink their standard-bearer just as easily … ",
    "url": "https://www.politico.com/news/2024/04/22/republicans-are-starting-to-worry-about-rfk-jr-00153763"
  },
  {
    "text": "El Paso county judge dismisses border ‘riot’ charges against 140 migrants  —  A county court judge dismissed 140 cases against migrants charged in an April 12 “riot” at the U.S.-Mexico border after determining there was no probable cause for their arrests.  —  County Court at Law 7 Judge … ",
    "url": "https://www.elpasotimes.com/story/news/immigration/2024/04/22/el-paso-county-judge-no-probable-cause-of-border-riot-arrests-judge-ruben-morales/73418221007/"
  }
]