[
  {
    "text": "Trump's tax cuts are about to unleash chaos on the Hill.  Here's how.  —  Republicans are likely to face deep divisions in assembling a plan before — and after — it hits the floor.  —  Washington is geared up for a big debate over trillions of dollars in tax cuts.  It's going to be long, slow and messy.",
    "url": "https://www.politico.com/news/2025/01/04/trump-tax-cuts-congress-chaos-00195363"
  },
  {
    "text": "Washington Post Cartoonist Quits After Jeff Bezos Cartoon Is Killed  —  The cartoon, by Ann Telnaes, depicted the owner of The Post, Jeff Bezos, and other billionaires genuflecting toward a statue of President-elect Donald Trump.  —  Ann Telnaes, a Pulitzer Prize-winning cartoonist for The Washington Post … ",
    "url": "https://www.nytimes.com/2025/01/03/business/media/washington-post-cartoonist-quits-after-jeff-bezos-cartoon-is-killed.html?unlocked_article_code=1.mk4.6_zx.YOY8uSvF1m7i&smid=nytcore-ios-share&referringSource=articleShare&tgrp=ctr"
  },
  {
    "text": "Washington Post cartoonist resigns over paper's refusal to publish cartoon critical of Jeff Bezos  —  Pulitzer prize winner Ann Telnaes drew a cartoon of the paper's owner kneeling before Donald Trump  —  The Washington Post's Pulitzer prize-winning editorial cartoonist Ann Telnaes has resigned … ",
    "url": "https://www.theguardian.com/media/2025/jan/04/washington-post-cartoonist-resigns-jeff-bezos"
  },
  {
    "text": "A Pulitzer winner quits ‘Washington Post’ after a cartoon on Bezos is killed  —  A Pulitzer Prize-winning cartoonist for the Washington Post has resigned after its editorial page editor rejected a cartoon she created to mock media and tech titans abasing themselves before President-elect Donald Trump.",
    "url": "https://www.npr.org/2025/01/04/nx-s1-5248299/cartoonist-quits-wapo-over-bezos-trump-cartoon-washingtonpost"
  },
  {
    "text": "President Biden Announces Recipients of the Presidential Medal of Freedom  —  Today, President Biden named nineteen recipients of the Presidential Medal of Freedom.  —  The Presidential Medal of Freedom is the Nation's highest civilian honor, presented to individuals who have made exemplary contributions … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2025/01/04/president-biden-announces-recipients-of-the-presidential-medal-of-freedom-3/"
  },
  {
    "text": "Biden to present Hillary Clinton, George Soros and 17 others the Presidential Medal of Freedom  —  President Biden will award the Presidential Medal of Freedom, the nation's highest civilian honor, to former presidential candidate Hillary Clinton, billionaire Democratic megadonor George Soros … ",
    "url": "https://nypost.com/2025/01/04/us-news/biden-to-present-george-soros-hillary-clinton-and-17-others-the-presidential-medal-of-freedom/"
  },
  {
    "text": "Trump Has Reeled in More Than $200 Million Since Election Day  —  The president-elect has boasted about the donations for his inauguration, library and political activities from those seeking favor or perhaps in some cases, atonement.  —  Since his victory in November … ",
    "url": "https://www.nytimes.com/2025/01/04/us/politics/trump-inaugural-donations.html"
  },
  {
    "text": "Trump has taken in ‘a staggering sum’ in cash from donors since winning re-election: NYT  —  Donald Trump's re-election win in November has led to him being showered with cash from previous donors as well as corporate interests hoping to either stay on his good side or find future favor … ",
    "url": "https://www.rawstory.com/trump-cash-haul-inauguration/"
  },
  {
    "text": "The Militia and the Mole  —  Outraged by the Jan. 6 Capitol riot, a wilderness survival trainer spent years undercover climbing the ranks of right-wing militias.  He didn't tell police or the FBI.  He didn't tell family or friends.  The one person he told was a ProPublica reporter.",
    "url": "https://www.propublica.org/article/ap3-oath-keepers-militia-mole"
  },
  {
    "text": "Biden to block oil drilling across 625 million acres of U.S. waters  —  The president will sign memorandums prohibiting future oil and gas leasing across parts of the Atlantic Ocean, the Pacific Ocean, the eastern Gulf of Mexico and the Northern Bering Sea.  —  President Joe Biden … ",
    "url": "https://www.washingtonpost.com/climate-environment/2025/01/04/biden-offshore-oil-drilling/"
  },
  {
    "text": "US plans $8 billion arms sale to Israel, US official says  —  The administration of President Joe Biden has notified Congress of a proposed $8 billion arms sale to Israel, a U.S. official said on Friday, with Washington maintaining support for its ally whose war in Gaza has killed tens of thousands.",
    "url": "https://www.usatoday.com/story/news/world/2025/01/04/israel-arms-sale/77452408007/"
  },
  {
    "text": "Trump calls for New York judge to be disbarred after hush money conviction advances  —  President-elect Trump in a weekend rant turned his ire on the New York judge who ordered sentencing to begin next week in his hush money case, calling him “the most conflicted judge in New York State history.”",
    "url": "https://thehill.com/regulation/court-battles/5067038-donald-trump-juan-merchan-new-york-hush-money-conviction/"
  },
  {
    "text": "Why Are Publications Sugar-Coating Livilsberger's Political Minifestos?  —  Over the last four days the bizarre Cybertruck fire outside a Trump hotel in Las Vegas has run from comical interlude to possible terrorist incident to tragic suicide of another veteran of America's forever wars.",
    "url": "https://talkingpointsmemo.com/edblog/why-are-publications-sugar-coating-livilsbergers-political-minifestos"
  },
  {
    "text": "Former Capitol Police officers call Trump's vows to pardon Jan. 6 rioters ‘a betrayal’  —  Former Capitol Police officers present during the Jan. 6, 2021 insurrection said President-elect Trump's commitment to pardon rioters is “a betrayal.”  —  “It's a betrayal, a stab in the heart,” … ",
    "url": "https://thehill.com/homenews/administration/5067236-january-6-pardons-officers-donald-trump/"
  },
  {
    "text": "Driver who exploded Cybertruck in Las Vegas railed about ‘political grievances’ and domestic issues before suicide  —  Editor's Note: Help is available if you or someone you know is struggling with suicidal thoughts or mental health matters.  In the US: Call or text 988, the Suicide & Crisis Lifeline.",
    "url": "https://www.cnn.com/2025/01/03/us/las-vegas-cybertruck-explosion/"
  },
  {
    "text": "Trade in the Ruins (Wonkish)  —  On misunderstanding the postwar boom  —  I got a lot of comments in response to my post about the postwar boom, which conservative ideology says couldn't have happened.  I appreciate that — feedback is valuable in this new venture of mine, and so far there have been very few trolls on this platform.",
    "url": "https://paulkrugman.substack.com/p/trade-in-the-ruins-wonkish"
  }
]