[
  {
    "text": "Hamas announces it has accepted an Egyptian-Qatari cease-fire proposal  —  Israel's army has told Palestinians to temporarily evacuate from parts of Rafah in southern Gaza, signaling that a ground invasion is imminent.  People were told to move to Muwasi, an Israeli-declared humanitarian area near the coast.",
    "url": "https://apnews.com/article/israel-palestinians-gaza-hamas-war-humanitarian-aid-8659eae6e0a7362504f0aa4aa4be53e0"
  },
  {
    "text": "After Cease-Fire Talks Stall, Hamas Proposes New Terms … Israel and the U.S. say they are reviewing Hamas's response.  —  A day after Gaza cease-fire talks reached an impasse, Hamas on Monday laid out new terms for a cease-fire that its leaders said they would accept.",
    "url": "https://www.nytimes.com/live/2024/05/06/world/israel-gaza-war-hamas"
  },
  {
    "text": "Hamas says it agrees to cease-fire proposal with Israel  —  Hamas has accepted an offer for a temporary cease-fire with Israel, a Hamas official confirmed to The Hill.  —  The news comes amid rising fears that Israel is set to launch an invasion of Rafah, a southern city in Gaza where about a million Gazans are sheltering.",
    "url": "https://thehill.com/policy/international/4646609-hamas-agrees-ceasefire-proposal-israel/"
  },
  {
    "text": "Why I'm voting for Biden and other Republicans should, too  —  Donald Trump has disqualified himself through his conduct and his character,  —  It's disappointing to watch an increasing number of Republicans fall in line behind former president Donald Trump.",
    "url": "https://www.ajc.com/opinion/geoff-duncan-why-im-voting-for-biden-and-other-republicans-should-too/LFLE5YWCBBA6VDGJAJKMNPCDKQ/"
  },
  {
    "text": "Congressman praises racist heckling.  Will his corporate backers stand by him?  —  On Thursday, Jaylin Smith, a graduate student at the University of Mississippi, participated in a small, non-violent protest calling for a ceasefire in Gaza.  Smith and the other protesters were greeted … ",
    "url": "https://popular.info/p/congressman-praises-racist-heckling"
  },
  {
    "text": "GOP Rep. Collins responds to criticism of Ole Miss post  —  Rep. Mike Collins (R-Ga.) defended his decision to share a video of counterprotesters at the University of Mississippi harassing a Black woman at a pro-Palestine protest last week, responding to criticism that he was endorsing racist conduct.",
    "url": "https://thehill.com/homenews/house/4646786-gop-rep-collins-responds-to-criticism-of-ole-miss-post/"
  },
  {
    "text": "Kristi Noem's Team Told Her to Nix the Dog Story Two Years Ago  —  She violated the first rule of campaign memoirs: Do no harm.  —  Kristi Noem's story about killing her dog made headlines across America.  But it wasn't news to people who worked on her first book, where the tale … ",
    "url": "https://www.politico.com/news/magazine/2024/05/06/kristi-noem-dog-killing-story-00156290"
  },
  {
    "text": "Noem insists ‘I love dogs’ amid puppy-shooting controversy  —  South Dakota Gov. Kristi Noem (R) stressed her affection for dogs on Monday, as she sought to defend herself against an onslaught of criticism and mockery over the revelation in a new book that many years ago, she shot an ill-behaved 14-month-old puppy.",
    "url": "https://thehill.com/homenews/campaign/4646603-noem-i-love-dogs-puppy-shooting-controversy-cricket/"
  },
  {
    "text": "Trump interferes with House GOP messaging on Cuellar indictment … - The National Republican Congressional Committee plans to accuse Democrats of a double standard if they stay mum on Cuellar following their pressure on ex-Rep. George Santos (R-N.Y.) to resign, Politico reports.",
    "url": "https://www.axios.com/2024/05/06/trump-house-gop-cuellar-resign"
  },
  {
    "text": "Hunter Biden's revenge  —  Smear campaigns have consequences.  —  ∙ Paid … Have you noticed that after years of saturation coverage, Fox News hosts have suddenly cooled it on the Hunter Biden stuff?  There's a reason for that.  —  Last week, Fox News pulled the six-part series … ",
    "url": "https://www.publicnotice.co/p/hunter-biden-sues-fox-news-explained"
  },
  {
    "text": "U.S. soldier detained in Russia, officials say  —  The soldier, who was stationed in Korea and traveled to Russia on his own, is accused of stealing from a woman.  —  A U.S. soldier was detained in Russia over the weekend, according to four U.S. officials.",
    "url": "https://www.nbcnews.com/politics/politics-news/us-soldier-detained-russia-officials-say-rcna150928"
  },
  {
    "text": "400 Rich People Pay $40K to Hear Trump Glorify Cop Assailants  —  On Saturday, a bunch of people paid a lot of money — at least $40,0000 apiece, and one or two people took Trump up on an offer to speak if they gave $1 million — to hear Trump glorify cop assailants.",
    "url": "https://www.emptywheel.net/2024/05/06/400-rich-people-pay-40k-to-hear-trump-glorify-cop-assailants/"
  },
  {
    "text": "Behind the Curtain: 6% of six states … - Those were the battlegrounds disputed by Donald Trump after the 2020 election. … - A seventh state, North Carolina, is included in some swing-state polls. … Republicans think they're winning.  The swing-state map is a big reason why.",
    "url": "https://www.axios.com/2024/05/06/biden-trump-election-swing-states"
  },
  {
    "text": "Right-Wing Nonprofit Paid Millions to Companies With Ties to Insiders  —  The Conservative Partnership Institute's three highest-paid contractors had connections to the group's leaders or their relatives, raising concerns about self-dealing.  —  The Conservative Partnership Institute … ",
    "url": "https://www.nytimes.com/2024/05/06/us/politics/trump-conservative-partnership-institute-funds.html"
  },
  {
    "text": "Joe Kahn: ‘The newsroom is not a safe space’  —  The Scene  —  Q&A  —  Ben Smith: Dan Pfeiffer, who used to work for Barack Obama, recently wrote of the Times: “They do not see their job as saving democracy or stopping an authoritarian from taking power.”  Why don't you see your job as: “We've got to stop Trump?”",
    "url": "https://www.semafor.com/article/05/05/2024/joe-kahn-the-newsroom-is-not-a-safe-space"
  },
  {
    "text": "Bernie Sanders will run for re-election … - People around Sanders have not given any indication that he is retiring, and say they are approaching 2024 as an election year for the senator.  — There was doubt that Sanders would seek re-election given his age, and he has yet to publicly announce a decision.",
    "url": "https://www.axios.com/2024/05/06/bernie-sanders-re-election-us-senator-vermont"
  },
  {
    "text": "‘We deserve more’: US workers' share of the pie dwindles  —  Bureau of Labor Statistics releases latest estimate of how much labor receives of national income, showing bleak decline  —  When Jesse Motte began working at a Starbucks inside a Target store in Columbia, South Carolina, more than two years ago, $15 an hour sounded great.",
    "url": "https://www.theguardian.com/us-news/article/2024/may/06/workers-income-labor-"
  },
  {
    "text": "Congress voted against funding a cure for cancer just to block a win for Biden  —  Some Republicans, refusing to give President Joe Biden a ‘win,’ voted against the renewal of funding for cancer research.  Vote for those who do not politicize Americans' health.  —  I'm afraid I have some bad news.",
    "url": "https://www.usatoday.com/story/opinion/voices/2024/05/05/biden-cancer-moonshot-initiative-congress-funding/73525016007/"
  },
  {
    "text": "Kellyanne Conway, David Plouffe launching ‘The Campaign Managers’ podcast  —  A pair of campaign managers for former Presidents Trump and Obama are teaming up for an across-the-aisle podcast that promises to “engage rather than enrage” while diving into the 2024 White House race.",
    "url": "https://thehill.com/blogs/in-the-know/4646358-kellyanne-conway-david-plouffe-campaign-managers-podcast/"
  },
  {
    "text": "Former Senate Candidate Tiffany Smiley Will Challenge Pro-Impeachment GOP Representative Dan Newhouse  —  Former Senate candidate Tiffany Smiley will primary pro-impeachment Rep. Dan Newhouse in 2024.  —  Load More  —  LATEST ISSUE  —  HISTORY  —  It's 1892 All Over Again  —  By DAN MCLAUGHLIN",
    "url": "https://www.nationalreview.com/news/ex-senate-candidate-tiffany-smiley-will-primary-pro-impeachment-gop-rep-dan-newhouse/"
  },
  {
    "text": "Donald Trump Is “A Colossal A**hole,” Jeffrey Katzenberg Says; Hasn't Yet Reached Out To Taylor Swift To Endorse “Decent” Joe Biden  —  Jeffrey Katzenberg is a man known for choosing his words very carefully most of the time, and tonight the WndrCo boss was pretty candid when it came to Donald Trump and Joe Biden.",
    "url": "https://deadline.com/2024/05/donald-trump-jeffrey-katzenberg-interview-joe-biden-talyor-swift-1235905004/"
  }
]