[
  {
    "text": "144. The Supreme Court's Late-Night Alien Enemy Act Intervention  —  Welcome back to “One First,” an (increasingly frequent) newsletter that aims to make the U.S. Supreme Court more accessible to all of us.  If you're not already a subscriber, I hope you'll consider becoming one (and … ",
    "url": "https://www.stevevladeck.com/p/144-the-supreme-courts-late-night"
  },
  {
    "text": "The Supreme Court's Late-Night Rebuke to Trump Is Extraordinary in More Ways Than One  —  Shortly before 1 a.m. on Saturday, the Supreme Court issued an emergency order halting the Trump administration's reported efforts to fly Venezuelan migrants to an El Salvador prison before they could challenge their deportation.",
    "url": "https://slate.com/news-and-politics/2025/04/supreme-court-blocks-deportations-donald-trump-alito-dissent.html"
  },
  {
    "text": "The Naval Academy Thinks Midshipmen Can't Handle the Truth  —  For the past four years, I have been delivering a series of lectures on the virtues of Stoicism to midshipmen at the U.S. Naval Academy in Annapolis, Md., and I was supposed to continue this on April 14 to the entire sophomore class on the theme of wisdom.",
    "url": "https://www.nytimes.com/2025/04/19/opinion/naval-academy-speech-censorship.html?unlocked_article_code=1.A08.AsS5.lY2qmISxh4bo&smid=nytcore-ios-share&referringSource=articleShare&sgrp=c-cb"
  },
  {
    "text": "Pope Sends Deputy to Lecture Vance on Compassion at Vatican  —  SUNDAY SCHOOL  —  Vance had an “an exchange of opinions” with Cardinal Pietro Parolin that touched on migration, the Vatican said.  —  Pope Francis skipped the Vatican's official meeting with Vice President JD Vance Saturday … ",
    "url": "https://www.thedailybeast.com/pope-snubs-vance-and-gets-deputy-to-lecture-vp-on-compassion/"
  },
  {
    "text": "White House solicits corporate sponsors for its Easter Egg Roll event  —  The White House is for the first time soliciting corporate sponsors for the annual Easter Egg Roll event to be held Monday on the South Lawn.  This comes as billionaire tech executives have faced growing criticism for cozying up to the Trump administration.",
    "url": "https://www.npr.org/2025/04/19/g-s1-61377/white-house-easter-egg-roll-corporate-sponsors"
  },
  {
    "text": "Rampin' Up, Baby!  That Thiel Start Up Hunting the Motherlode Contract is Inside Treasury … One of the most important stories in some time came out two days ago.  But with so much else going it didn't get quite as much attention as it should have.  It's from ProPublica.",
    "url": "https://talkingpointsmemo.com/edblog/rampin-up-baby-that-thiel-start-up-hunting-the-motherlode-contract-is-inside-treasury"
  },
  {
    "text": "FSU shooting suspect's complex past comes to light — yet motive remains a mystery  —  In recent years, Phoenix Ikner became known for far-right, white supremacist rhetoric, classmates said.  It's unclear if that had any tie to the violence.  —  Years before he was named a suspect … ",
    "url": "https://www.nbcnews.com/news/amp/rcna201942"
  },
  {
    "text": "Indonesian man details surprise ICE arrest in Minnesota hospital; judge denies release  —  Critics condemn the “silent” nature of his arrest as part of an aggressive new trend in immigration enforcement. … Eight-month-old Adalet Harsono listens to the voice of her father, Aditya Harsono … ",
    "url": "https://www.startribune.com/indonesian-man-details-surprise-ice-arrest-in-minnesota-hospital-judge-denies-release/601332002"
  },
  {
    "text": "Protesters fill the streets in cities across the US to denounce Trump agenda  —  Organizers call for 11 million people to march and rally in this weekend's effort to ‘protect democracy’  —  Protesters poured into the streets of cities and towns across the United States again on Saturday … ",
    "url": "https://www.theguardian.com/us-news/2025/apr/19/anti-trump-rallies-protests"
  },
  {
    "text": "Former Trump Staff Members Liken His Actions to Those of ‘Royal Despot’  —  In an open letter, prominent Republicans criticized President Trump for using his power to punish two former administration officials who criticized him.  —  A number of prominent Republicans, including several former members … ",
    "url": "https://www.nytimes.com/2025/04/19/us/politics/trump-letter-ty-cobb.html?unlocked_article_code=1.A08.8U1Q.y_lTN8JPKMW9&smid=url-share"
  },
  {
    "text": "Losing International Students Could Devastate Many Colleges  —  Students could bypass the United States for friendlier countries as the Trump administration attacks universities and revokes visas.  Their loss could hurt schools and the economy.  —  Xiaofeng Wan, a former admissions officer … ",
    "url": "https://www.nytimes.com/2025/04/19/us/losing-international-students-could-devastate-many-colleges.html"
  },
  {
    "text": "How a defunct gang registry helped deliver Kilmar Abrego García to a Salvadoran prison  —  Federal officials have launched a full-throated effort to label Abrego García a gang member and “a terrorist,” an argument based on a gang survey that was decommissioned amid questions over racial profiling.",
    "url": "https://www.washingtonpost.com/immigration/2025/04/19/kilmar-abrego-garcia-ice-police-gang-registry/"
  },
  {
    "text": "Three ex-presidents denounce the current one in a two-week stretch  —  While presidents have been at odds before, there is often a sort of camaraderie among the small club of individuals who have served in the highest office in the land.  —  Barack Obama urged Americans to resist President Donald Trump's bullying.",
    "url": "https://www.washingtonpost.com/politics/2025/04/19/trump-presidency-obama-biden-clinton/"
  },
  {
    "text": "The 40-something single dad shaping liberal media from his laptop  —  Acyn Torabi dominates the internet with fast-cut clips of political mayhem.  Are they news, or something else?  —  The man behind the most influential progressive account on social media starts his days at 6 a.m. in front … ",
    "url": "https://www.washingtonpost.com/technology/2025/04/19/acyn-torabi-liberal-viral-video-clips/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ1MDM1MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ2NDE3NTk5LCJpYXQiOjE3NDUwMzUyMDAsImp0aSI6ImI2MzIwMDhiLTIyZjktNGFlMS1iNWVkLTlhYzVjYmQxYzE0OCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS90ZWNobm9sb2d5LzIwMjUvMDQvMTkvYWN5bi10b3JhYmktbGliZXJhbC12aXJhbC12aWRlby1jbGlwcy8ifQ.-0SnLztbUDD78cGrdqT6GuO5v3_tewwFfis0VXvI0kE&itid=gfta"
  },
  {
    "text": "US philanthropists warn against capitulating to Trump: ‘We need to step up’  —  Foundation leaders say charitable organisations could be next in the firing line - but must ‘stand together’ to resist  —  John Palfrey will not be obeying in advance.  —  At a moment when leaders of tech companies … ",
    "url": "https://www.theguardian.com/us-news/2025/apr/19/philanthropy-foundations-trump-resistance"
  },
  {
    "text": "Crowds gather peacefully at 250th anniversary celebrations despite divided political climate  —  In a country deeply divided and increasingly angry about politics, tens of thousands of people gathered peacefully around the Lexington Green on Saturday morning to witness the reenactment … ",
    "url": "https://www.bostonglobe.com/2025/04/19/business/echoes-rebellion-tyranny-18th-century-250th-anniversary-celebrations-today/"
  },
  {
    "text": "BYU doctorate student's visa reinstated after unexpected revocation  —  SALT LAKE CITY — A Japanese doctorate student at Brigham Young University will now be able to stay in the U.S. after his visa was revoked earlier this month.  —  BYU student Suguru Onda is a year away from finishing his doctorate.",
    "url": "https://kslnewsradio.com/shows-podcasts/jeff-caplans-afternoon-news/visa-byu-student/2204681/"
  }
]