[
  {
    "text": "Trump vetoed an Israeli plan to kill Iran's supreme leader, US officials say  —  President Donald Trump vetoed an Israeli plan in recent days to kill the Iran's Supreme Leader Ayatollah Ali Khamenei, two U.S. officials told Reuters on Sunday.  —  “Have the Iranians killed an American yet?",
    "url": "https://www.reuters.com/world/middle-east/trump-vetoed-an-israeli-plan-kill-irans-supreme-leader-us-officials-say-2025-06-15/"
  },
  {
    "text": "Trump ruled out Israeli assassination of Iran's Supreme Leader, U.S. officials say  —  Over the weekend, Israel had an operational window to assassinate Iran's Supreme Leader Ali Khamenei, but President Trump made it clear that he is against such a move, U.S officials told Axios.",
    "url": "https://www.axios.com/2025/06/15/trump-israel-iran-assassination-khamenei"
  },
  {
    "text": "Israeli strikes could cause regime change in Iran, Netanyahu says; Iran fires more missiles at Israel  —  Israeli Prime Minister Benjamin Netanyahu said Sunday that regime change in Iran “could certainly be the result” of Israel's military campaign.  “Because the Iran regime is very weak,” he said in an interview with Fox News.",
    "url": "https://www.washingtonpost.com/world/2025/06/15/israel-iran-attacks-live-tehran-tel-aviv/"
  },
  {
    "text": "Trump has not called Walz following shooting of Minnesota lawmakers  —  President Trump has not called Minnesota Gov. Tim Walz more than 24 hours after a prominent Minnesota state lawmaker and her husband were killed in what officials have described as a “politically motivated assassination.”",
    "url": "https://www.axios.com/2025/06/15/trump-walz-minnesota-shooting-lawmakers-call"
  },
  {
    "text": "Minnesota Sen. John Hoffman's wife shares update after shooting: “We are incredibly lucky to be alive”  —  Minnesota Sen. John Hoffman's wife shared an update after a shooting injured the couple at their home early Saturday morning.  —  U.S. Sen. Amy Klobuchar on Sunday afternoon shared … ",
    "url": "https://www.cbsnews.com/news/john-yvette-hoffman-minnesota-shooting-message/"
  },
  {
    "text": "Trump's Military Parade Was a Pathetic Event for a Pathetic President  —  Three dozen horses, 28 Abrams tanks, 6,700 soldiers, and millions of taxpayer dollars later, and Donald Trump's military birthday parade was still a flop at best.  —  A crowd that was well under the administration's … ",
    "url": "https://newrepublic.com/article/196850/trump-birthday-military-parade-pathetic"
  },
  {
    "text": "At ‘No Kings,’ millions of Americans show the flag is mightier than the tank  —  It would be a gross understatement to say it rained on Donald Trump's birthday parade Saturday night.  Man, it poured.The 47th president had hoped to rule over Flag Day by deploying the artillery of a strutting strongman … ",
    "url": "https://www.inquirer.com/opinion/commentary/no-kings-philadelphia-trump-parade-20250615.html"
  },
  {
    "text": "“No Kings Day” protests turn out millions, rebuking Trump  —  The “No Kings Day” nationwide rallies against Donald Trump/for democracy on Saturday turned out millions of people.  —  That's per a collective crowdsourcing effort led by Strength In Numbers, and involving many members of the independent data journalism community.",
    "url": "https://www.gelliottmorris.com/p/no-kings-day-protests-turn-out-millions"
  },
  {
    "text": "Sources: Vance Boelter's wife detained for questioning after traffic stop near Onamia  —  Vance Boelter's wife detained for questioning after traffic stop near Onamia  —  A manhunt is underway for Vance Boelter, who is suspected of shooting two Minnesota state lawmakers - one of them fatally - as well as their spouses.",
    "url": "https://kstp.com/kstp-news/top-news/sources-vance-boelters-wife-detained-for-questioning-after-traffic-stop-near-onamia/"
  },
  {
    "text": "MAGA Sen. Mocked for Absurdly Calling Dem Assassin ‘Marxist’  —  JUMPING THE SHARK  —  Senator Mike Lee joined Elon Musk in portraying the suspect in attacks on Minnesota lawmakers as a leftist.  —  Republican Senator Mike Lee faced ridicule for calling the suspect of fatal shootings in Minnesota a “Marxist.”",
    "url": "https://www.thedailybeast.com/maga-senator-mike-lee-mocked-for-absurdly-calling-dem-assassin-marxist/"
  },
  {
    "text": "Marcher wounded in Salt Lake City ‘No Kings’ protest shooting dies  —  Police chief says the victim was not shot by the suspect, who is in jail.  —  Note to readers  •The Salt Lake Tribune has made this story free to all.  —  A marcher critically wounded in a shooting … ",
    "url": "https://www.sltrib.com/news/2025/06/15/marcher-wounded-no-kings-protest/"
  },
  {
    "text": "Minnesota shootings spotlight growing safety risks facing lawmakers  —  The targeted shootings of two Minnesota state lawmakers this weekend underscore a grim trend: An increasingly volatile political climate has left state and local officials more exposed than ever to threats and harassment.",
    "url": "https://www.axios.com/local/twin-cities/2025/06/15/minnesota-melissa-hortman-shootings-political-threats"
  },
  {
    "text": "Trump's FAA pick has claimed ‘commercial’ pilot license he doesn't have  —  Bryan Bedford, the nominee to head the Federal Aviation Administration, for years erroneously stated in his Republic Airways bio that he is a pilot with a “commercial” rating.  —  President Donald Trump's nominee … ",
    "url": "https://www.politico.com/news/2025/06/15/trumps-faa-pick-has-claimed-commercial-pilot-license-he-doesnt-have-00406090"
  },
  {
    "text": "Padilla says FBI agent, Guard member escorted him to Noem's briefing before removal  —  Sen. Alex Padilla (D-Calif.) said Sunday that a member of the National Guard and an FBI agent escorted him into Homeland Security Secretary Kristi Noem's press conference last week before he was forcefully removed.",
    "url": "https://www.axios.com/2025/06/15/alex-padilla-kristi-noem-dhs-removal"
  },
  {
    "text": "How Kennedy's overhaul could make vaccines more expensive  —  Health and Human Services Secretary Robert F. Kennedy Jr.'s moves to upend decades of vaccine policy could hit patients hardest in their wallets, as shifting guidance over shots could make insurance coverage confusing and scattershot.",
    "url": "https://thehill.com/policy/healthcare/5350100-acip-replacement-vaccine-policy-impact/"
  },
  {
    "text": "Syrian General Questioned in Case of Missing American  —  The general, Bassam Hassan, is said to have shared grim news about the fate of Austin Tice, an American journalist and former Marine who went missing in 2012.  —  A top Syrian general under President Bashar al-Assad before his ouster … ",
    "url": "https://www.nytimes.com/2025/06/15/us/politics/syria-austin-tice-journalist.html"
  },
  {
    "text": "‘Golden Share’ in U.S. Steel Gives Trump Extraordinary Control  —  Administration officials secured a deal that will give the president unusual influence over a private company, and could serve as a model for other deals.  —  To save its takeover of U.S. Steel, Japan's Nippon Steel agreed … ",
    "url": "https://www.nytimes.com/2025/06/15/business/economy/golden-share-us-steel-nippon-trump.html?unlocked_article_code=1.PE8.vRQH.XDJWjFCELJOv&smid=url-share"
  },
  {
    "text": "How Amy Coney Barrett Is Confounding the Right and the Left  —  President Trump appointed her to clinch a conservative legal revolution.  But soon after arriving at the Supreme Court, she began surprising her colleagues.  —  As President Trump was leaning toward appointing Amy Coney Barrett … ",
    "url": "https://www.nytimes.com/2025/06/15/us/amy-coney-barrett-supreme-court.html?unlocked_article_code=1.PE8.kdNM.WoYABTX26wmc&smid=url-share"
  },
  {
    "text": "Randi Weingarten Quits D.N.C. Post in Dispute With Chairman  —  In a letter to the party's chairman, Ken Martin, Ms. Weingarten wrote, “I appear to be out of step with the leadership you are forging.”  —  Randi Weingarten, the longtime leader of one of the nation's most influential labor unions … ",
    "url": "https://www.nytimes.com/2025/06/15/us/politics/randi-weingarten-dnc-ken-martin.html"
  },
  {
    "text": "U.S. could lose more immigrants than it gains for first time in 50 years  —  Net migration could turn negative, some economists warn, weighing on economic growth and fueling inflation.  —  Summary1181  —  For the first time in at least half a century, more people may leave the United States … ",
    "url": "https://www.washingtonpost.com/business/2025/06/15/trump-immigration-impact-economy-inflation/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ5OTYwMDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzUxMzQyMzk5LCJpYXQiOjE3NDk5NjAwMDAsImp0aSI6IjJkMGNmNTFjLWFjZGYtNDM4Mi1iZTM4LTkyYWQ1YjZiZTUwNSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9idXNpbmVzcy8yMDI1LzA2LzE1L3RydW1wLWltbWlncmF0aW9uLWltcGFjdC1lY29ub215LWluZmxhdGlvbi8ifQ.rHKCwHE0llmadbqDjsSp6yVpLBym8nQ_ne4Nbn5aQ7k&itid=gfta"
  },
  {
    "text": "How Trump's Imposition of Massive Tariffs is Repeating the “Ship Money” Abuses of King Charles I  —  Yesterday, there were massive nationwide “No Kings” protests against Donald Trump and his authoritarian tendencies.  Like most political slogans, “No Kings” is an oversimplification.",
    "url": "https://reason.com/volokh/2025/06/15/how-trumps-imposition-of-massive-tariffs-is-repeating-the-ship-money-abuses-of-king-charles-i/"
  },
  {
    "text": "NBC's Jacob Soboroff reports from the Los Angeles protests as law enforcement fires flash bangs  —  NBC News correspondent Jacob Soboroff was reporting on the ground in Los Angeles when law enforcement started using crowd control tactics against protesters, including firing flash bangs.",
    "url": "https://www.msnbc.com/msnbc/amp-video/mmvo241608261886"
  }
]