[
  {
    "text": "Ex-FBI informant charged with lying about Bidens had Russian intelligence contacts, prosecutors say  —  LAS VEGAS (AP) — A former FBI informant charged with making up a multimillion-dollar bribery scheme involving President Joe Biden, his son Hunter and a Ukrainian energy company had contacts … ",
    "url": "https://apnews.com/article/hunter-biden-fbi-informant-joe-biden-ef48c7543e7a45cd3b8b671d0e2f60e5"
  },
  {
    "text": "DOJ: FBI informant said Russian intelligence involved in Hunter Biden story … - Smirnov was indicted by a federal grand jury in the Central District of California after being arrested at the Harry Reid International Airport in Las Vegas, Nevada.  — Prosecutors alleged Smirnov falsely told FBI agents … ",
    "url": "https://www.axios.com/2024/02/20/hunter-biden-fbi-informant-russian-intelligence"
  },
  {
    "text": "Man accused of lying to FBI about Hunter Biden claimed he got fake information from Russian intelligence  —  Washington —  The man accused last week of delivering false allegations to federal investigators about Hunter Biden and President Biden's business dealings told officials after his arrest … ",
    "url": "https://www.cbsnews.com/news/hunter-biden-alexander-smirnov-joe-biden-russia/"
  },
  {
    "text": "Letitia James says she's prepared to seize Trump's buildings if he can't pay his $354M civil fraud fine  —  The New York attorney general made the remarks in an interview with ABC News.  —  Attorney General Letitia James arrives for a press conference following a verdict … ",
    "url": "https://abcnews.go.com/US/letitia-james-shes-prepared-seize-trumps-assets-pay/story?id=107381482"
  },
  {
    "text": "Trump backs McCarthy's chosen successor for House seat  —  The race in California's 20th congressional district has been a hotly-contested fight over the direction of the Republican party.  —  Former President Donald Trump endorsed Kevin McCarthy's chosen successor for his House seat Tuesday … ",
    "url": "https://www.politico.com/news/2024/02/20/trump-vince-fong-california-mccarthy-00142257"
  },
  {
    "text": "Alito renews criticism of Supreme Court's same-sex marriage ruling in rejecting Missouri jury case  —  Supreme Court Justice Samuel Alito renewed his criticism Tuesday of the high court's landmark same-sex marriage ruling, addressing it in a five-page statement as part of an order explaining … ",
    "url": "https://thehill.com/regulation/court-battles/4479539-alito-renews-criticism-of-supreme-courts-same-sex-marriage-ruling-in-rejecting-missouri-jury-case/"
  },
  {
    "text": "Aileen Cannon Might Actually Get Herself Kicked Off the Trump Classified Docs Case  —  The recent news about possible Russian space nukes reminds us that we live in a very insecure world.  That is why perhaps none of Donald Trump's four criminal cases is more troubling than the federal prosecution brought … ",
    "url": "https://slate.com/news-and-politics/2024/02/aileen-cannon-trump-classified-disqualification.html"
  },
  {
    "text": "Scoop: GOP privately expects government shutdown … - “People are predicting a shutdown even if it's just for a few days,” a GOP lawmaker recently told Axios.  — They're either “close to reaching a deal or it's about to blow up,” one subcommittee chair recently told a fellow House Republican.",
    "url": "https://www.axios.com/2024/02/21/republicans-government-shutdown-mike-johnson"
  },
  {
    "text": "Trump's G.O.P. Is a Confederacy of Fakers  —  I've got a suggestion for the next Trump-G.O.P. fund-raising scheme.  You know how sports memorabilia stores sometimes sell basketballs autographed by an entire N.B.A. team?  Well, I was imagining that Donald Trump could sell white flags at $1,000 … ",
    "url": "https://www.nytimes.com/2024/02/20/opinion/ukraine-trump-republicans.html"
  },
  {
    "text": "Oklahoma banned trans students from bathrooms.  Now a bullied student is dead after a fight  —  Nex Benedict died one day after a fight in a school bathroom.  Their mother Sue Benedict tells Bevan Hurley that the gender fluid teenager endured more than a year of abuse simply for being who they were",
    "url": "https://www.independent.co.uk/news/world/americas/nex-benedict-dead-oklahoma-b2499332.html"
  },
  {
    "text": "Is the New York Times neutral on the future of democracy?  —  Does the New York Times care if democracy survives?  —  I ask this question sincerely, because the Times' political coverage sometimes makes me wonder.  —  On most subjects, the Times' values are transparent.",
    "url": "https://www.stopthepresses.news/p/is-the-new-york-times-neutral-on"
  },
  {
    "text": "House Judiciary Chair Jim Jordan subpoenas HHS Secretary Xavier Becerra  —  The Ohio Republican is seeking case files for unaccompanied child migrants who have been charged with crimes.  HHS says the committee is seeking “protected health information”  —  WASHINGTON — House Judiciary … ",
    "url": "https://www.nbcnews.com/politics/congress/house-judiciary-chair-jim-jordan-subpoenas-hhs-secretary-xavier-becerr-rcna139685"
  },
  {
    "text": "Alex Jones Estate Liquidation Gets Sandy Hook Families' Vote  —  Search by Law Firm Search by Topic  —  The families of Sandy Hook school shooting victims voted overwhelmingly in favor of a plan to wrap up Alex Jones' bankruptcy proceedings by liquidating the right wing talk show host's assets.",
    "url": "https://news.bloomberglaw.com/bankruptcy-law/sandy-hook-families-vote-to-liquidate-alex-jones-bankrupt-estate"
  },
  {
    "text": "Keep your phone number private with Signal usernames  —  Signal's mission and sole focus is private communication.  For years, Signal has kept your messages private, your profile information (like your name and profile photo) private, your contacts private, and your groups private - among much else.",
    "url": "https://signal.org/blog/phone-number-privacy-usernames/"
  },
  {
    "text": "Georgia Gov. Kemp reveals he was interviewed by special counsel in 2020 election interference case  —  Georgia Republican Gov. Brian Kemp, who resisted intense pressure from former President Donald Trump to overturn the 2020 election results in his state, revealed Tuesday that he has been interviewed … ",
    "url": "https://www.cnn.com/2024/02/20/politics/kemp-trump-special-counsel-2020-cnntv"
  },
  {
    "text": "Media Can't Stop Stoking Outrage  —  Taking their cues from the GOP, the mainstream press has devoted their front page coverage to “but her emails”-level scandals, like President Biden's age and DA Fani Willis's private life.  What will this mean come November?",
    "url": "https://www.damemagazine.com/2024/02/20/media-cant-stop-stoking-outrage/"
  },
  {
    "text": "Clarence Thomas has 30 days to resign if he wants millions from John Oliver  —  When it comes to Supreme Court reform, John Oliver is tired of just talking about term limits and ethics codes.  Instead, the late-night talk-show host said he's taking a page out of the playbook used by the rich and powerful … ",
    "url": "https://www.washingtonpost.com/style/2024/02/19/john-oliver-clarence-thomas-supreme-court-offer/"
  },
  {
    "text": "Abbott's Border Military Base Could Cost Texans $500 Million  —  Last Friday, Texas Governor Greg Abbott held a press conference in Eagle Pass, the border town he has turned into a militarized staging ground for his standoff with the feds.  It was his third such press conference in as many weeks.",
    "url": "https://www.texasobserver.org/abbott-border-military-base-millions/"
  },
  {
    "text": "Fani Willis turns the tables on her attackers  —  Fulton County, Ga., District Attorney Fani Willis took the stand last week under attack from Michael Roman, former henchman 0f four-times-indicted former president Donald Trump, and many in the media and legal community.",
    "url": "https://www.washingtonpost.com/opinions/2024/02/20/fani-willis-disqualification/"
  }
]