[
  {
    "text": "How to Force Justices Alito and Thomas to Recuse Themselves in the Jan. 6 Cases  —  Many people have gloomily accepted the conventional wisdom that because there is no binding Supreme Court ethics code, there is no way to force Associate Justices Samuel Alito and Clarence Thomas to recuse themselves … ",
    "url": "https://www.nytimes.com/2024/05/29/opinion/alito-thomas-recuse-trump-jan-6.html"
  },
  {
    "text": "Sam Alito believes you — and, perhaps, his colleagues — are stupid  —  Alito defiantly refused to recuse himself from January 6 or Trump-related cases in a letter sent to members of Congress on Wednesday.  —  Justice Sam Alito, who is a problem, went even further on Wednesday than I thought … ",
    "url": "https://www.lawdork.com/p/sam-alito-believes-you-and-perhaps"
  },
  {
    "text": "Trump congratulates Alito for rejecting recusal calls amid flag flap  —  He said the justice showed “INTELLIGENCE, COURAGE, and ‘GUTS.’”  —  Donald Trump praised Supreme Court Justice Samuel Alito for rejecting calls to recuse himself from two pending cases involving the former president … ",
    "url": "https://www.politico.com/news/2024/05/29/trump-samuel-alito-flags-00160484"
  },
  {
    "text": "Alito Refuses to Recuse: ‘My Wife Is Fond of Flying Flags’  —  The Supreme Court justice threw his wife under the bus after far-right flags were seen flying outside of his homes  —  Supreme Court Justice Samuel Alito has finally responded to concerns about his ability to remain impartial … ",
    "url": "https://www.rollingstone.com/politics/politics-news/samuel-alito-refuses-recuse-flags-1235029552/"
  },
  {
    "text": "Inside Donald Trump and Elon Musk's Growing Alliance  —  Donald Trump is weighing an advisory role for the Tesla leader in the event the former president reclaims the White House",
    "url": "https://www.wsj.com/politics/donald-trump-elon-musk-alliance-d1fe43e3"
  },
  {
    "text": "Florida sticks by social studies standard teaching ‘benefit’ of slavery  —  The updated standards include new required instruction surrounding the Sept. 11 attacks and the history of Asian Americans and Pacific Islanders, as well as several other more subtle changes.",
    "url": "https://www.politico.com/news/2024/05/29/florida-education-aapi-slavery-00160431"
  },
  {
    "text": "Indonesia court revises regional election rules, amid talk president's son may seek run  —  Indonesia's Supreme Court has approved regulatory changes on the age of candidates in regional elections, the court said on Thursday, amid speculation the president's 29-year-old son is seeking to run in upcoming Jakarta elections.",
    "url": "https://www.reuters.com/world/asia-pacific/indonesia-court-revises-regional-election-rules-amid-talk-presidents-son-may-2024-05-30/"
  },
  {
    "text": "Once a Sheriff's Deputy in Florida, Now a Source of Disinformation From Russia  —  In 2016, Russia used an army of trolls to interfere in the U.S. presidential election.  This year, an American given asylum in Moscow may be accomplishing much the same thing all by himself.",
    "url": "https://www.nytimes.com/2024/05/29/business/mark-dougan-russia-disinformation.html"
  },
  {
    "text": "Lauren Boebert lags challenger Ike McCorkle by double digits, Democrat's internal poll shows  —  One-third of voters in Colorado's reddest congressional district say they're undecided  —  An internal poll conducted last week for one of the three Democrats hoping to deny U.S … ",
    "url": "https://gazette.com/politics/elections/internal-poll-shows-mccorkle-leads-boebert/article_83de5307-b1a0-5c77-ac39-b4b576f8a9dc.html"
  },
  {
    "text": "Spain approves Catalan amnesty bill set to define PM's term  —  Spain's Congress on Thursday overturned an upper house veto with its final approval of a disputed amnesty for Catalan separatists that is expected to set the stage for Prime Minister Pedro Sanchez's second term and allow the return of an exiled pro-independence leader.",
    "url": "https://www.reuters.com/world/europe/spain-approves-catalan-amnesty-bill-set-define-pms-term-2024-05-30/"
  },
  {
    "text": "Fourteen Hong Kong democrats found guilty in landmark subversion trial  —  Fourteen Hong Kong pro-democracy activists were found guilty and two were acquitted on Thursday in a landmark subversion trial that critics say could deal another blow to the city's rule of law and its reputation as a global financial hub.",
    "url": "https://www.reuters.com/world/china/hong-kong-democrats-brace-landmark-subversion-trial-verdicts-2024-05-30/"
  },
  {
    "text": "Texas GOP Platform Endorses Death Penalty for Abortion Patients  —  We need to talk about Plank 35 in the Texas GOP platform.  Because while there's been lots of coverage about how extremist the state's Republican convention was, people seem to have missed the fact that delegates adopted … ",
    "url": "https://jessica.substack.com/p/texas-gop-platform-endorses-death"
  },
  {
    "text": "ACLU of Louisiana Denounces Governor Jeff Landry's Signing of Bill Restricting Public Observation of Police  —  NEW ORLEANS—Alanah Odoms, Executive Director of the ACLU of Louisiana, has released the following statement in response to Governor Jeff Landry's signing of HB 173.",
    "url": "https://www.laaclu.org/en/press-releases/aclu-louisiana-denounces-governor-jeff-landrys-signing-bill-restricting-public"
  },
  {
    "text": "RFK Jr. files complaint with Federal Election Commission over CNN debate criteria  —  Robert F. Kennedy Jr.'s campaign filed a complaint with the Federal Election Commission on Tuesday alleging President Joe Biden's campaign, former President Donald Trump's campaign and CNN violated federal campaign laws … ",
    "url": "https://www.cnn.com/2024/05/29/politics/rfk-jr-fec-complaint-cnn-debate/"
  },
  {
    "text": "Home Insurance Is Clobbering Consumers.  Yet It's Barely Counted in Inflation.  —  Skyrocketing premiums are hitting homeowners hard, but they barely factor into common price measures.  —  Holly Meyer Lucas estimates that as many as 30 of the 100 houses her real estate team sold in and around Jupiter … ",
    "url": "https://www.nytimes.com/2024/05/29/business/economy/home-insurance-inflation.html"
  }
]