[
  {
    "text": "The Sound of Fear on Air  —  This morning, I had an unsettling experience.  —  I was invited onto MSNBC's Morning Joe to talk from a studio in Washington, D.C., about an article I'd written on Trump's approach to foreign policy.  Before getting to the article, I was asked about the nomination … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/12/appeasement-new-age-trump/680871/?gift=9uyuYdwstDXmDRiaAfJXJfIYiXaq8Cd9ZNwP23K4jY0&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Hegseth nomination sinking fast in the Senate  —  Senate Republicans say Pete Hegseth, President-elect Trump's choice to head the Defense Department, faces a very tough path to confirmation in the Senate and his bleak prospects have been communicated directly to the Trump transition team, which is now mulling other options.",
    "url": "https://thehill.com/homenews/senate/5023165-hegseth-nomination-senate/"
  },
  {
    "text": "Hegseth Is Reportedly Vowing to Stop Drinking, Having His Mom Call Senators  —  Trump's pick to take over the Pentagon appears to be struggling to convince Republican senators he's fit for the job … The former Fox News host has been struggling to weather a firestorm of scrutiny stemming … ",
    "url": "https://www.rollingstone.com/politics/politics-news/pete-hegseth-vowing-stop-drinking-mom-call-senators-1235192656/"
  },
  {
    "text": "What's Happening at MSNBC?  —  David Frum just shared a disturbing anecdote from an appearance this morning on MSNBC's Morning Joe.  According to his short article at The Atlantic, he made a flippant reference to reporting that Pentagon nominee Pete Hegseth was known for drinking on the job at Fox News.",
    "url": "https://talkingpointsmemo.com/edblog/whats-happening-at-msnbc"
  },
  {
    "text": "Hegseth signed NDA, received six-figure severance payment after leaving veterans' group, sources say  —  Pete Hegseth, President-elect Donald Trump's embattled pick for secretary of defense, received a six-figure severance payment and signed a non-disclosure agreement when he exited the organization Concerned Veterans of America.",
    "url": "https://www.cbsnews.com/news/pete-hegseth-signed-nda-received-six-figure-payment-after-leaving-concerned-veterans-for-america/"
  },
  {
    "text": "Biden White House Is Discussing Preemptive Pardons for Those in Trump's Crosshairs  —  The nomination of Kash Patel, who has vowed to pursue Trump's critics, as FBI director has heightened concerns within the president's inner circle.  —  President Joe Biden's senior aides are conducting … ",
    "url": "https://www.politico.com/news/magazine/2024/12/04/biden-white-house-pardons-00192610"
  },
  {
    "text": "Jeffries stays out of the way as Dems mutiny against senior panel leaders  —  Democrats are increasingly anxious about the incoming Trump administration and are no longer bowing to seniority rules to pick their committee leaders.  —  House Democrats are poised to unseat several senior committee leaders … ",
    "url": "https://www.politico.com/news/2024/12/04/democrats-mutiny-against-leaders-jeffries-00192665"
  },
  {
    "text": "Nadler to Relinquish Democrats' Top Judiciary Post, Bowing to Calls for Change  —  Democrats' longtime leader on the panel faced a challenge from Representative Jamie Raskin, and pressure from colleagues who wanted a younger, more strategic figure at the helm.",
    "url": "https://www.nytimes.com/2024/12/04/us/politics/nadler-raskin-judiciary-committee.html"
  },
  {
    "text": "Jeff Bezos Says He Is “Proud” of Decision to End Endorsements at Washington Post, “Very Optimistic” About Second Trump Term  —  The Amazon founder said that he is working on a plan to turn around the Post: “We saved the Washington Post once, this will be the second time.”",
    "url": "https://www.hollywoodreporter.com/business/business-news/jeff-bezos-washington-post-amazon-trump-1236077799/"
  },
  {
    "text": "UnitedHealthcare CEO Brian Thompson fatally shot outside Hilton hotel in Midtown in possible targeted attack: sources  —  The CEO of UnitedHealth was fatally shot in the chest Wednesday morning outside the Hilton hotel in Midtown in what police say was a targeted attack.",
    "url": "https://nypost.com/2024/12/04/us-news/ceo-of-unitedhealthcare-fatally-shot-outside-of-hilton-hotel-in-nyc-in-possible-targeted-attack-sources/"
  },
  {
    "text": "Trump Replaces His White House Counsel Before He Even Started the Job  —  The shake-up is a sign that the new administration may see the same chaos and infighting that so often plagued President-elect Donald J. Trump's first term in office.  —  President-elect Donald J. Trump on Wednesday replaced … ",
    "url": "https://www.nytimes.com/2024/12/04/us/politics/trump-replaces-white-house-counsel.html"
  },
  {
    "text": "Donald Trump is ready to make Republicans touch the third rail  —  Without a voting public to face again, Trump is gearing up to cut Social Security and Medicare  —  There are a thousand election hot takes and post-mortems floating around these days and I'm sure we'll soon come to some consensus … ",
    "url": "https://www.salon.com/2024/12/04/donald-is-ready-to-make-touch-the-third-rail/"
  },
  {
    "text": "The Times They Are A-Changin'  —  The old Los Angeles Times building.  (Photo by David McNew/Getty Images)  —  Patrick Soon-Shiong is tightening his grip over the Los Angeles Times.  —  The MAGA-curious owner, who drew controversy when he blocked the newspaper's planned endorsement of Kamala Harris … ",
    "url": "https://www.status.news/p/los-angeles-times-patrick-soon-shiong"
  },
  {
    "text": "The Great DOGE Reversal  —  The project led by Elon Musk and Vivek Ramaswamy puts citizens back on top.  —  It is easy to mock or minimize DOGE.  Its name, the Department of Government Efficiency, reads like a Muskian stab at humor.  It may be an impossible dream.",
    "url": "https://www.wsj.com/opinion/the-great-doge-reversal-bureaucracy-cut-red-tape-government-spending-9c5f478b?st=UusTnM&reflink=article_copyURL_share"
  },
  {
    "text": "No-confidence vote topples French government, plunges country into chaos  —  The support of Marine Le Pen's far-right lawmakers was key to the motion, which made this the shortest-serving administration in the modern French republic.  —  A no-confidence vote in the French parliament … ",
    "url": "https://www.washingtonpost.com/world/2024/12/04/france-no-confidence-vote-government-collapse/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzMzMjg4NDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM0NjcwNzk5LCJpYXQiOjE3MzMyODg0MDAsImp0aSI6ImI1NjhhOWRkLTZlZjctNDYxMC05ZTY3LWY5NTI1ZTc0ZmExMiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS93b3JsZC8yMDI0LzEyLzA0L2ZyYW5jZS1uby1jb25maWRlbmNlLXZvdGUtZ292ZXJubWVudC1jb2xsYXBzZS8ifQ.10AazP0jicVUHfekB64dl9bU-10ny9xrq8j3jWmpUdo&itid=gfta"
  },
  {
    "text": "Hegseth Vows to Get Sober if Confirmed  —  The embattled Fox News host-turned-secretary of defense nominee denied ever having a drinking problem.  —  Satanic Temple To Host Public Elementary School Program  —  SEPARATION OF CHURCH AND STATE  —  A parent personally requested they offer … ",
    "url": "https://www.thedailybeast.com/hegseth-vows-to-stop-drinking-alcohol-if-confirmed/"
  },
  {
    "text": "Revealed: the Operators Behind Four Major Neo-Nazi X Accounts  —  Under owner Elon Musk, the social media site X, formerly known as Twitter, has become a hotbed of white supremacist and neo-Nazi content.  A recent headline in the Atlantic doesn't mince words: “X is a white supremacist site.”",
    "url": "https://www.texasobserver.org/revealed-operators-neo-nazi-x-accounts/"
  },
  {
    "text": "Trump's Project 2025 May Not Be What It Seemed.  It's Worse.  —  On Nov. 19, two weeks after Election Day, Elon Musk demonstrated perhaps the most brutal, if not sadistic, technique for making life in the federal civil service intolerable.  —  A Wall Street Journal headline from Nov. 22 captures … ",
    "url": "https://www.nytimes.com/2024/12/04/opinion/trump-patel-vought-project-2025.html?unlocked_article_code=1.e04.OpCA.DOsQmilnKOBY&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Trump Picks Cryptocurrency Advocate Paul Atkins For SEC Chair  —  Trump said Atkins, the CEO of Patomak Partners and a former SEC commissioner, was a “proven leader for common sense regulations.”  —  LOADING  —  President-elect Donald Trump announced Wednesday that he intends … ",
    "url": "https://www.huffpost.com/entry/paul-atkins-trump-sec-chair_n_67509b4fe4b033802ee4886a"
  },
  {
    "text": "Trump energy nominee misinterprets studies to support claims, scientists say  —  Chris Wright cites data to back his claim there is no climate crisis.  Authors of the papers he cites say he is misinterpreting their work.  —  Oil executive Chris Wright, President-elect Donald Trump's pick … ",
    "url": "https://www.washingtonpost.com/business/2024/12/04/trump-energy-climate-nominee-chris-wright/"
  },
  {
    "text": "South Korea just gave Donald Trump a warning — if his opponents are listening  —  Swiftly and decisively rebutting would-be authoritarians works better than hoping it works out for the best.  —  Just before 11 p.m. local time Tuesday, South Korean President Yoon Suk Yeol declared martial law in a televised address to the nation.",
    "url": "https://www.msnbc.com/opinion/msnbc-opinion/south-korea-martial-law-president-democracy-trump-rcna182732"
  },
  {
    "text": "Bill Maher Threatens to ‘Quit’ His Show Over Trump Win  —  REALLY?  —  The host told Jane Fonda he's “bored” with talking about the president-elect, but would have no choice.  —  Bill Maher “may quit,” his HBO show Real Time, he told Jane Fonda on the latest episode of his Club Random podcast … ",
    "url": "https://www.thedailybeast.com/bill-maher-threatens-to-quit-his-hbo-show-over-trump-win/"
  },
  {
    "text": "Wired for the GOP  —  This column, by Alexander Burns, the head of news at Politico, is a rich example of the DC logic that only Democrats have agency and it's only to Democrats that standards, norms, rules or whatever else apply.  “Joe Biden's Parting Insult: The president delivered a vote … ",
    "url": "https://talkingpointsmemo.com/edblog/wired-for-the-gop-2"
  },
  {
    "text": "Memphis police use excessive force and discriminate against Black people, Justice Department finds  —  The Memphis Police Department uses excessive force and discriminates against Black people, according to the findings of a U.S. Department of Justice investigation launched after the beating death … ",
    "url": "https://apnews.com/article/tyre-nichols-memphis-police-federal-investigation-beac021fcf8b5fd255ce79520cec86fa"
  },
  {
    "text": "Big Insurer Sets Time Limits On Anesthesia Coverage During Surgeries  —  One of the country's largest health insurance companies says it will no longer automatically pay for patients' anesthesia if a medical procedure takes longer than a predetermined time limit, regardless of complications or other factors that impact operation time.",
    "url": "https://www.levernews.com/big-insurer-sets-time-limits-on-anesthesia-coverage-during-surgeries/"
  },
  {
    "text": "Trump Nominee Pressured IRS To Crush The Humane Society  —  Donald Trump's pick to head the Internal Revenue Service pressed the agency to investigate and consider stripping the country's leading animal welfare group of its tax status after it supported an initiative to protect dogs, according to documents reviewed by The Lever.",
    "url": "https://www.levernews.com/trump-nominee-pressured-irs-to-crush-the-humane-society/"
  },
  {
    "text": "Texas judge blocks anti-money laundering law's enforcement nationwide  —  A federal judge in Texas has issued a nationwide injunction blocking the enforcement of an anti-money laundering law that requires corporate entities to disclose to the U.S. Treasury Department the identities of their real beneficial owners.",
    "url": "https://www.reuters.com/legal/government/texas-judge-blocks-anti-money-laundering-laws-enforcement-nationwide-2024-12-04/"
  },
  {
    "text": "UK uncovers vast crypto laundering scheme for gangsters and Russian spies  —  Multibillion-dollar ring across London, Moscow and Dubai connected cash-rich criminals with sanctions evaders  —  A UK-led operation has uncovered a multibillion-dollar money laundering scheme run out of London … ",
    "url": "https://www.ft.com/content/31b9053f-343e-4c47-ace9-2b0080ec8799"
  },
  {
    "text": "Russian General Calls U.S. Chairman of Joint Chiefs  —  In a highly unusual call, the two men “discussed a number of global and regional security issues, to include the ongoing conflict in Ukraine,” a spokesman said.  —  Gen. Valery V. Gerasimov, the architect of President Vladimir V. Putin's invasion … ",
    "url": "https://www.nytimes.com/2024/12/04/us/politics/russian-general-call.html"
  }
]