[
  {
    "text": "Playbook: The endorsement Kamala Harris was waiting for  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  NEW THIS MORNING — BARACK and MICHELLE OBAMA officially endorsed KAMALA HARRIS' presidential campaign this morning via a campaign video that captured … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/07/26/the-endorsement-kamala-harris-was-waiting-for-00171347"
  },
  {
    "text": "Barack and Michelle Obama endorse Kamala Harris for president  —  The Obamas are the final key leaders in the Democratic Party to unite behind Harris after President Biden ended his bid for a second term.  —  Former president Barack Obama and first lady Michelle Obama endorsed Vice President Harris … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/26/barack-michelle-obama-kamala-harris-endorse/"
  },
  {
    "text": "‘What happened to any time, any place?’:  Kamala Harris trolls Trump as he backs out of debate  —  Trump's campaign team won't commit to debating Harris - at least not yet - blaming Democratic instability  —  Support truly  —  independent journalism  —  Our mission is to deliver unbiased … ",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/kamala-harris-trump-debate-any-time-b2586303.html"
  },
  {
    "text": "Barack and Michelle Obama endorse Kamala Harris for president  —  Former President Barack Obama and former first lady Michelle Obama endorsed Vice President Kamala Harris' presidential bid in a video released Friday.  —  “Michelle and I couldn't be prouder to endorse you and to do everything … ",
    "url": "https://www.cnn.com/2024/07/26/politics/barack-michelle-obama-kamala-harris-endorsement/"
  },
  {
    "text": "Speculation Swirls About What Hit Trump.  An Analysis Suggests It was a Bullet  —  An absence of medical records or official accounts has stirred confusion, but a Times video and trajectory analysis indicates a bullet, not debris, wounded the former president.",
    "url": "https://www.nytimes.com/2024/07/26/us/politics/trump-shooter-bullet-trajectory-ear.html"
  },
  {
    "text": "Finally Word from the FBI -About The Trump Story The Press Has Refused To Question  —  As you know, I've been on this story for a while: why there was never any law enforcement briefing or qualified medical report on the Butler, PA shooting incident or information of how Donald Trump was injured.",
    "url": "https://talkingpointsmemo.com/edblog/finally-word-from-the-fbi-about-the-trump-story-the-press-has-refused-to-question/sharetoken/af3f7a96-9979-4384-a1cd-ba3189b6bd9d"
  },
  {
    "text": "F.B.I. Examining Bullet Fragments Found at Trump Rally Site  —  The bureau is assessing what caused the former president's wound during an assassination attempt.  The question has turned political.  —  The F.B.I. is examining numerous metal fragments found near the stage at a campaign rally in Butler … ",
    "url": "https://www.nytimes.com/2024/07/25/us/politics/fbi-bullet-trump-rally.html"
  },
  {
    "text": "Elon Musk's transgender daughter, in first interview, says he berated her for being queer as a child  —  In an exclusive interview, Vivian Jenna Wilson said her father's recent statements, including that she is “not a girl,” inspired her to speak out: “I'm not just gonna let that slide.”",
    "url": "https://www.nbcnews.com/tech/tech-news/elon-musk-transgender-daughter-vivian-wilson-interview-rcna163665"
  },
  {
    "text": "Can Harris Pull Off a Victory in Three Months?  Three Top Strategists Lay Out How  —  We convened a roundtable with former campaign managers and strategists to ask them about Harris and Trump's biggest vulnerabilities, how her entrance shakes up the electoral map and their Election Day predictions.",
    "url": "https://www.politico.com/news/magazine/2024/07/26/kamala-harris-campaign-manager-roundtable-00171138"
  },
  {
    "text": "Kevin Roberts, architect of Project 2025, has close ties to radical Catholic group Opus Dei  —  Heritage Foundation leader has long received spiritual guidance from group and his policy goals align with its teachings  —  Kevin Roberts, the Heritage Foundation president and the architect of Project 2025 … ",
    "url": "https://www.theguardian.com/us-news/article/2024/jul/26/kevin-roberts-project-2025-opus-dei"
  },
  {
    "text": "Kamala Harris' stepdaughter responds to ‘childless’ attack from JD Vance: ‘I love my three parents’  —  Ella Emhoff's mother, Kerstin Emhoff, also responded to Vance's 2021 remarks, which referred to the vice president as one of the “childless cat ladies” running the country.",
    "url": "https://www.nbcnews.com/politics/2024-election/kamala-harris-stepdaughter-responds-childless-attack-jd-vance-rcna163673"
  },
  {
    "text": "Giffords gun safety group commits $15 million to help Harris beat Trump  —  First to NBC News: The group is launching a push in swing states and House battlegrounds to help “gun safety champions” with ads, polling and staffing to reach key groups of voters.  —  WASHINGTON — The gun safety … ",
    "url": "https://www.nbcnews.com/politics/2024-election/giffords-gun-safety-group-commits-15-million-help-harris-beat-trump-rcna163424"
  },
  {
    "text": "Elon Musk's trans daughter Vivian Wilson slams his anti-LGBTQ+ comments as ‘ketamine-fueled haze’  —  Vivian Wilson is fact-checking own father after billionaire Elon Musk made bigoted comments about her gender.  —  The billionaire recently attacked gender-affirming care in an interview … ",
    "url": "https://www.advocate.com/elon-musk-trans-daughter-vivian-wilson"
  },
  {
    "text": "Former President Obama and Michelle Obama endorse Harris  —  Former President Obama and former first lady Michelle Obama gave their highly-anticipated endorsement for Vice President Harris on Friday.  —  The Harris campaign released a one-minute video entitled “Endorsement” featuring a phone call … ",
    "url": "https://thehill.com/homenews/4793874-president-obama-and-michelle-obama-endorse-harris/"
  },
  {
    "text": "Vance argued for higher tax rate on childless Americans in 2021 interview  —  Trump's running mate has faced criticism over other similar previous comments.  —  Republican vice-presidential nominee, Sen. J.D. Vance speaks at a campaign rally at Radford University, July 22, 2024, in Radford, Virginia.",
    "url": "https://abcnews.go.com/US/vance-argued-higher-tax-rate-childless-americans-2021/story?id=112284318"
  },
  {
    "text": "Elena Kagan calls for better enforcement of Supreme Court's ethics code  —  At a legal conference in California, the liberal justice suggested that lower-court judges could review alleged violations.  —  SACRAMENTO — The Supreme Court's effort to dig itself out of the ethics hole it finds itself … ",
    "url": "https://www.politico.com/news/2024/07/25/elena-kagan-supreme-court-ethics-reform-00171317"
  },
  {
    "text": "J.D. Vance didn't have sex with a couch.  But he's still extremely weird.  —  The 2024 election is already historic for a number of reasons, from an assassination attempt to a last-minute dropout, with the country's first Black woman candidate slated to secure the Democratic nomination.",
    "url": "https://www.vox.com/culture/363230/jd-vance-couch-sex-hillbilly-elegy-rumor-false"
  },
  {
    "text": "Judge throws out Gateway Pundit's bankruptcy claim  —  The denial paves the way for defamation suits against the site by two Georgia election workers and a former Dominion Voting Systems executive to continue.  —  A federal judge in Florida threw out a bankruptcy case filed by the Gateway Pundit … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/25/judge-throws-out-gateway-pundits-bankruptcy-claim/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzIxODgwMDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzIzMjYyMzk5LCJpYXQiOjE3MjE4ODAwMDAsImp0aSI6ImFkZmJlYTJjLTQ5MjEtNDg3Yy04ODQ0LWRjNDMxMjAxM2JhNiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzA3LzI1L2p1ZGdlLXRocm93cy1vdXQtZ2F0ZXdheS1wdW5kaXRzLWJhbmtydXB0Y3ktY2xhaW0vIn0.w-3lo68b3MMxV8ABadaJv7QxyYPrtTfzUr1uYl0QgbA"
  },
  {
    "text": "U.S. authorities arrest Sinaloa Cartel leaders, including El Chapo's son … - “Fentanyl is the deadliest drug threat our country has ever faced, and the Justice Department will not rest until every single cartel leader, member, and associate responsible for poisoning our communities is held accountable … ",
    "url": "https://www.axios.com/2024/07/26/sinaloa-cartel-leaders-arrested"
  },
  {
    "text": "Flipboard Brings Local News to the Fediverse  —  Has local news ever been more important?  Journalists who live in the communities they serve don't just keep residents informed on everything from wildfires and power outages to new businesses and upcoming events — though that's vital.",
    "url": "https://about.flipboard.com/fediverse/flipboard-brings-local-news-to-the-fediverse/"
  },
  {
    "text": "We bought everything needed to make $3 million worth of fentanyl.  —  All it took was $3,600 and a web browser  —  This fentanyl-making chemical was shipped by air from China to the United States.  Reuters purchased it as part of an investigation into the global chemical trade behind America's fentanyl crisis.",
    "url": "https://www.reuters.com/investigates/special-report/drugs-fentanyl-supplychain/"
  }
]