[
  {
    "text": "Trump Can't Go Home Again  —  It's not the site that it used to be.  And he's not the same man.  —  After surrendering on Thursday at an Atlanta jail to be booked on state felony charges alleging his involvement in a criminal conspiracy to void the 2020 presidential election … ",
    "url": "https://www.politico.com/news/magazine/2023/08/26/trump-twitter-return-00113080"
  },
  {
    "text": "Sununu says GOP hopefuls must ‘find separation’ from Trump: ‘They have to take it to him’  —  New Hampshire Gov. Chris Sununu (R) called on Republican presidential candidates to go on the offense against the GOP frontrunner, former President Trump.  —  “I think they have to take it to him … ",
    "url": "https://thehill.com/homenews/campaign/4172704-sununu-says-gop-hopefuls-must-find-separation-from-trump/"
  },
  {
    "text": "14th Amendment, Section 3: A new legal battle against Trump takes shape  —  Efforts to disqualify Trump from state ballots are starting to materialize.  —  Former President Donald Trump's legal battles are piling up: in Washington, Georgia, New York — the list goes on.",
    "url": "https://abcnews.go.com/Politics/14th-amendment-section-3-new-legal-battle-trump/story?id=102547316"
  },
  {
    "text": "GOP-backed groups fundraising off of Trump mug shot merchandise  —  Former President Trump and his allies are readily fundraising off of the former president's historic booking photo, taking advantage of the unprecedented image to bank capital for their causes.",
    "url": "https://thehill.com/homenews/campaign/4172628-gop-backed-groups-fundraising-off-of-trump-mug-shot-merchandise/"
  },
  {
    "text": "Biden chimes in on Trump mug shot: ‘Handsome guy’  —  President Biden on Friday chimed in on former President Trump's mug shot, saying his top political rival is a “handsome guy” after he was booked in Fulton County, Ga.  —  When asked about the mug shot, Biden told reporters, “I did see it on television.",
    "url": "https://thehill.com/homenews/administration/4171898-biden-on-trump-mug-shot/"
  },
  {
    "text": "Pentagon protested false Fox News report about fallen Marine, emails show  —  The network quietly removed the story based on false claims from a congressman but did not apologize or run a correction  —  The U.S. Marine Corps went up to the highest levels of Fox News last month to challenge … ",
    "url": "https://www.washingtonpost.com/media/2023/08/26/fox-news-retracts-marine-story-nicole-gee/"
  },
  {
    "text": "Michael Moritz, Reid Hoffman and Other Silicon Valley Titans Said to Be Behind Mysterious Land Deals  —  A mysterious company has spent $800 million in an effort to buy thousands of acres of San Francisco Bay Area land.  The people behind the deals are said to be a who's who of the tech industry.",
    "url": "https://www.nytimes.com/2023/08/25/business/land-purchases-solano-county.html"
  },
  {
    "text": "SpaceX, NASA launch four astronauts from four countries  —  Four astronauts — representing four nations and space agencies across the globe — launched aboard a SpaceX rocket toward the International Space Station, kicking off a mission expected to last more than six months.",
    "url": "https://www.cnn.com/2023/08/26/world/spacex-nasa-crew-7-launch-space-station-scn/"
  },
  {
    "text": "Former Ukraine prosecutor makes explosive claims against Joe and Hunter Biden in new interview  —  White House says Shokin not credible, was fired for being too soft on corruption  —  EXCLUSIVE: Former Ukrainian Prosecutor General Viktor Shokin told Fox News in an exclusive sit-down interview … ",
    "url": "https://www.foxnews.com/politics/former-ukraine-prosecutor-makes-explosive-claims-joe-hunter-biden-new-interview"
  },
  {
    "text": "DeSantis super PAC pumps more than $12 million into major ad buy  —  Never Back Down, the super PAC backing Ron DeSantis' presidential campaign, made major additions to its advertising reservations Friday, spending more than $12 million booking airtime in the fall, mostly in Iowa.",
    "url": "https://www.cnn.com/2023/08/26/politics/desantis-super-pac-ad-buy/"
  },
  {
    "text": "California judge shoots down Eastman bid to postpone disbarment proceedings  —  It's the latest setback for the attorney as he fights to preserve his law license while facing felony charges in Georgia.  —  Attorney John Eastman, an architect of Donald Trump's last-ditch bid to subvert the 2020 election … ",
    "url": "https://www.politico.com/news/2023/08/25/john-eastman-disbarment-hearings-georgia-00113101"
  },
  {
    "text": "Biden and Harris will meet with King family on 60th anniversary of the March on Washington  —  The Oval Office meeting will be held six decades after President John F. Kennedy and King met at the White House on the morning of the march on Aug. 28, 1963.  —  WASHINGTON — President Joe Biden … ",
    "url": "https://www.nbcnews.com/news/nbcblk/biden-harris-will-meet-king-family-60th-anniversary-march-washington-rcna101835"
  },
  {
    "text": "CPAC vice chair resigns amid turmoil  —  Charlie Gerow is calling for investigations into the group's top leader and its financial practices.  —  The vice chair of the Conservative Political Action Coalition has resigned from his longtime position on the organization's board and is calling … ",
    "url": "https://www.politico.com/news/2023/08/25/cpac-vice-chair-resigns-amid-turmoil-00113078"
  },
  {
    "text": "Vivek Ramaswamy Calls Rep. Ayanna Pressley And Ibram X. Kendi Part Of ‘Modern KKK’  —  It is “racist” to suggest that Ramaswamy's conservative views make him a race traitor, the Indian-American GOP Republican presidential hopeful said.  —  PELLA, Iowa ― Vivek Ramaswamy … ",
    "url": "https://www.huffpost.com/entry/vivek-ramaswamy-republican-modern-kkk_n_64e93333e4b099cf79a31a9d"
  },
  {
    "text": "In Iowa and elsewhere, bans on LGBTQ+ ‘conversion therapy’ become a conservative target  —  One of Iowa's largest cities repealed its ban on “conversion therapy” — the discredited practice of trying to change a person's sexual orientation or gender identity through counseling … ",
    "url": "https://apnews.com/article/lgbtq-gay-transgender-conversion-iowa-f6d220171feac884a42006c1b5a19b1b"
  }
]