[
  {
    "text": "Congress Has the Opportunity to Do the Funniest Thing Ever  —  The Speaker election looks tight.  The presidential election certification is just days away.  Could Republicans impose their own January 6th through sheer obstinacy?  —  House Speaker Mike Johnson (R-LA) … ",
    "url": "https://prospect.org/politics/2025-01-02-congress-republicans-speaker-mike-johnson-january-6/"
  },
  {
    "text": "Scoop: GOP moderates warn Johnson not to repeat McCarthy's deal … - Johnson said in a “Fox and Friends” interview Thursday that he has spoken with “every single one” of his detractors and that “we'll be talking about process reforms in the House.”  — GOP sources have told Axios … ",
    "url": "https://www.axios.com/2025/01/02/mike-johnson-mccarthy-moderates-speaker-deal"
  },
  {
    "text": "Republicans are once again staring down House speaker drama.  Here's what's at stake.  —  House Republicans could soon experience some serious déjà vu.  —  On Friday, January 3, the newly elected Congress will convene for the first time and vote for a House speaker.",
    "url": "https://www.vox.com/politics/393091/house-republican-speaker-drama-mike-johnson"
  },
  {
    "text": "FBI releases new video of a suspect planting a pipe bomb near DNC offices on eve of the Capitol riot  —  A harrowing chapter in American history remains shrouded in mystery: Who planted pipe bombs outside offices of the Democratic and Republican national committees in Washington on the eve of the attack on the Capitol?",
    "url": "https://apnews.com/article/capitol-riot-pipe-bombs-fbi-washington-ea85b6fe5fe9140f1c75b7ee8c0554b2"
  },
  {
    "text": "Cybertruck blast suspect was a ‘Rambo type’ who loved Trump, family says  —  Exclusive: Matthew Livelsberger's shocked uncle told The Independent that the Green Beret was a ‘supersoldier’  —  Your support helps us to tell the story  —  From reproductive rights to climate change to Big Tech … ",
    "url": "https://www.independent.co.uk/news/world/americas/cybertruck-explosion-suspect-matthew-livelsberger-vegas-b2672940.html"
  },
  {
    "text": "In striking down net-neutrality rule, Sixth Circuit asserts newfound judicial supremacy  —  A panel of three GOP appointees used their post-Chevron judicial power, blocking a rule backed by the Biden administration that aimed to protect open internet access.",
    "url": "https://www.lawdork.com/p/sixth-circuit-strikes-down-net-neutrality-rule"
  },
  {
    "text": "Judicial body won't refer Clarence Thomas to Justice Department over ethics lapses  —  The head of the Judicial Conference said there is legal uncertainty over whether it has the authority to refer complaints about Supreme Court justices.  —  A judicial organization that sets national policy … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/judicial-body-will-not-refer-clarence-thomas-justice-department-ethics-rcna186059"
  },
  {
    "text": "The New Orleans attack shows that ISIS hasn't gone away.  It's changed.  —  The deadly attack in New Orleans on New Year's Eve that left 15 people dead feels like a disturbing reminder of a past era, one when the transnational terrorist organization known as the Islamic State, or ISIS, dominated the nation's attention and resources.",
    "url": "https://www.vox.com/world-politics/393110/new-orleans-isis-jabbar"
  },
  {
    "text": "Biden to announce decision on U.S. Steel acquisition as early as Friday  —  President Biden is likely to announce a decision as soon as Friday on whether he will approve Nippon Steel's $14.9 billion acquisition of U.S. Steel, according to people familiar with the process.",
    "url": "https://www.cbsnews.com/news/biden-to-announce-decision-us-steel-nippon-as-early-as-friday/"
  },
  {
    "text": "Elon Musk and the right's war on Wikipedia  —  Listen to me read this post here (not an AI-generated voice!), subscribe to the feed in your podcast app, or download the recording for later.  —  When Elon Musk launched his latest crusade against Wikipedia this Christmas Eve … ",
    "url": "https://www.citationneeded.news/elon-musk-and-the-rights-war-on-wikipedia/"
  },
  {
    "text": "Eyeing Potential Bird Flu Outbreak, Biden Administration Ramps Up Preparedness  —  The administration is committing an additional $306 million toward battling the virus, and will distribute the money before President-elect Donald J. Trump takes office.  —  The Biden administration … ",
    "url": "https://www.nytimes.com/2025/01/02/us/politics/bird-flu-biden-trump.html"
  },
  {
    "text": "Siri “unintentionally” recorded private convos; Apple agrees to pay $95M … Apple has agreed to pay $95 million to settle a lawsuit alleging that its voice assistant Siri routinely recorded private conversations that were then sold to third parties for targeted ads.",
    "url": "https://arstechnica.com/tech-policy/2025/01/apple-agrees-to-pay-95m-delete-private-conversations-siri-recorded/"
  },
  {
    "text": "Governor seeks resignation of Western New Mexico University regents after spending revelations  —  New Mexico Gov. Michelle Lujan Grisham has asked for the immediate resignation of regents at Western New Mexico State University after revelations of wasteful spending and failures in financial oversight … ",
    "url": "https://apnews.com/article/western-new-mexico-regents-resignation-553678a0735d9bfbd5c60a6fd073827e"
  },
  {
    "text": "Why Don't the Tech Bros Just Hire from MAGA?  —  1. MSG  —  I remain fascinated by the intraparty MAGA-DOGE fight.  The MAGA position seems to be:  — Elite college-grad Americans are bad because they're woke or whatever.  — The Forgotten Men of MAGA are every bit as smart and capable … ",
    "url": "https://www.thebulwark.com/p/why-dont-the-tech-bros-just-hire"
  },
  {
    "text": "Biden to award Medal of Honor to 7 veterans of Vietnam and Korea wars  —  Richard Cavazos' name is already recognized across the U.S. Army.  He forged a path through service in Korea and Vietnam to become the first Hispanic four-star general, leading to a legacy that included the renaming of Texas' Fort Hood for him.",
    "url": "https://www.cbsnews.com/news/biden-medals-of-honor-7-veterans-vietnam-korea-wars/"
  },
  {
    "text": "Barrasso criticizes Cheney over the Presidential Citizens Award  —  President Joe Biden naming former Rep. Liz Cheney (R-Wyo.) as one of 20 recipients of the Presidential Citizens Award is already drawing backlash from her home state senator.  GOP Sen. John Barrasso of Wyoming, in a statement … ",
    "url": "https://www.politico.com/live-updates/2025/01/02/congress/liz-cheney-biden-award-00196271"
  },
  {
    "text": "Meta will appoint Republican Joel Kaplan to lead global policy team, as Nick Clegg steps down  —  THE SCOOP  —  Meta is revamping its global policy team, with President Nick Clegg stepping down and being replaced by Joel Kaplan, his deputy and the company's most prominent Republican, people familiar with the matter said.",
    "url": "https://www.semafor.com/article/01/02/2025/meta-will-appoint-joel-kaplan-to-lead-global-policy-team-replacing-nick-clegg"
  },
  {
    "text": "Kamala Harris Heads to Capitol to Swear-In Senators Who Won't Even Say Her Name Right  —  When Vice President Kamala Harris arrives at the Capitol on Friday to swear-in the new class of Senators, many of the smiling politicians handing her their family Bibles will be the same ones who for months … ",
    "url": "https://time.com/7204412/kamala-harris-congress-republicans/"
  }
]