[
  {
    "text": "CBS News poll: Haley gains on Trump in New Hampshire while he continues to dominate in Iowa  —  Donald Trump still leads in New Hampshire, but Nikki Haley has consolidated much of the non-Trump vote and has emerged as the top alternative to him there.  Among the top candidates … ",
    "url": "https://www.cbsnews.com/news/poll-haley-trump-new-hampshire-iowa/"
  },
  {
    "text": "Fox News Poll: Trump's lead in GOP primary widens  —  Voters split over whether impeachment of Biden is legit or bogus  —  Former President Donald Trump keeps gaining ground in the Republican presidential nomination contest, as fewer than one third of GOP primary voters now back all his rivals combined … ",
    "url": "https://www.foxnews.com/official-polls/fox-news-poll-trumps-lead-gop-primary-widens"
  },
  {
    "text": "Ron DeSantis wanted to change the way campaigns were funded.  Then the fights started.  —  With just weeks to go before the Iowa caucuses, the GOP candidate's bold strategy is now in tatters and its top architect has resigned  —  Florida Gov. Ron DeSantis entered the Republican presidential race … ",
    "url": "https://www.washingtonpost.com/politics/2023/12/16/desantis-super-pac-collapse/"
  },
  {
    "text": "Jeff Roe, Top Strategist for Star-Crossed DeSantis Super PAC, Resigns  —  Mr. Roe, who helped lead Never Back Down, the super PAC behind the Florida governor's presidential campaign, resigned Saturday, the latest shake-up in the group.  —  Jeff Roe, the chief strategist for the leading super PAC supporting … ",
    "url": "https://www.nytimes.com/2023/12/16/us/politics/desantis-never-back-down-jeff-roe-resigns.html"
  },
  {
    "text": "Trump quotes Putin condemning American democracy, praises autocrat Orban  —  Trump also called Jan. 6 defendants “hostages” and again demonized immigrants as “poisoning the blood of our country”  —  DURHAM, N.H. — Republican polling leader Donald Trump approvingly quoted autocrats Vladimir Putin … ",
    "url": "https://www.washingtonpost.com/elections/2023/12/16/trump-authoritarians-putin-orban-poisoning-blood/"
  },
  {
    "text": "Trump quotes Putin to call Biden ‘threat to democracy,’ reiterates anti-immigrant rhetoric at New Hampshire rally  —  Former President Donald Trump on Saturday quoted Russian President Vladimir Putin to attack President Joe Biden as a “threat to democracy” and doubled down on language condemned … ",
    "url": "https://www.cnn.com/2023/12/16/politics/new-hampshire-republican-primary-trump-immigration/"
  },
  {
    "text": "Israel invites journalists into a car-width tunnel beneath Gaza, not far from its border.  —  U.S. to Push Israel to Scale Back War … Amid anguish over the accidental killing of hostages, Netanyahu vows to keep fighting.  —  Prime Minister Benjamin Netanyahu vowed on Sunday to keep fighting in Gaza … ",
    "url": "https://www.nytimes.com/live/2023/12/17/world/israel-hamas-war-gaza-news"
  },
  {
    "text": "Sen. Van Hollen bemoans ‘unacceptably high’ number of civilian deaths in Gaza  —  The Maryland Democrat said Biden's call for restraint isn't being followed.  —  Sen. Chris Van Hollen attends a news conference outside the Addison Road-Seat Pleasant Metro Station to announce … ",
    "url": "https://abcnews.go.com/Politics/chris-van-hollen-bemoans-unacceptably-high-number-civilian/story?id=105717338"
  },
  {
    "text": "Majority of Americans 18-24 think Israel should ‘be ended and given to Hamas’  —  A majority of young Americans said they believe Israel should “be ended and given to Hamas,” according to a shocking poll.  —  The survey, conducted THIS WEEK by Harvard-Harris polling, found 51% of Americans between … ",
    "url": "https://nypost.com/2023/12/16/news/majority-of-americans-18-24-think-israel-should-be-ended-and-given-to-hamas/"
  },
  {
    "text": "James Biden's dealmaking caught on FBI tapes in unrelated bribery probe  —  While Joe Biden campaigned in Mississippi, his brother planned to build a powerful consulting business — a deal that brought him to the periphery of a federal case  —  OXFORD, Miss. — Richard “Dickie” Scruggs … ",
    "url": "https://www.washingtonpost.com/politics/2023/12/17/james-bidens-dealmaking-caught-fbi-tapes-unrelated-bribery-probe/"
  },
  {
    "text": "Senate GOP enters critical stretch for fending off bad candidates  —  With Joe Manchin's retirement, Republicans only need to lock up one more Senate seat.  They're not taking any chances on problematic nominees.  —  The GOP is escalating its push to head off problematic nominees in a slate … ",
    "url": "https://www.politico.com/news/2023/12/17/senate-gop-candidates-00131808"
  },
  {
    "text": "Trump lawyer blasts Jack Smith's urgency for ruling in immunity case: 'It's un-American'  —  Alina Habba, a lawyer for former President Trump, blasted Special Counsel Jack Smith for his urgency in asking the Supreme Court to take up Trump's federal 2020 election criminal case and weigh in on his immunity defense.",
    "url": "https://thehill.com/regulation/court-battles/4364070-trump-lawyer-blasts-jack-smiths-urgency-for-ruling-immunity-case/"
  },
  {
    "text": "An order blocking enforcement of Ohio's abortion ban stands after the high court dismissed an appeal  —  The Ohio Supreme Court has dismissed the state's challenge to a judge's order that has blocked enforcement of Ohio's near-ban on abortions for the past 14 months.",
    "url": "https://apnews.com/article/abortion-ban-ohio-constitution-9d8f9e75aecb1ce2dc98d2e9ff9b4071"
  },
  {
    "text": "Portugal's Socialists Pick Santos as Leader Before Snap Election  — Prime Minister Costa quit on Nov. 7 after an eight-year tenure  —  Portugal's ruling Socialists picked former minister Pedro Nuno Santos to be the new party leader ahead of a snap election in March that was called after his predecessor unexpectedly quit as premier.",
    "url": "https://www.bloomberg.com/news/articles/2023-12-16/portugal-s-socialists-pick-santos-as-party-leader-before-early-election-in-march"
  }
]