[
  {
    "text": "PROTECTING THE MEANING AND VALUE OF AMERICAN CITIZENSHIP  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:  —  Section 1.  Purpose.  The privilege of United States citizenship is a priceless and profound gift.",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/01/protecting-the-meaning-and-value-of-american-citizenship/"
  },
  {
    "text": "The Trump executive orders that threaten democracy  —  Ever since Donald Trump declared he'd act like a dictator on Day 1 during his presidential campaign, there have been real concerns that he'd be true to his word — that he'd take a series of unilateral actions that threaten the integrity of American democracy.",
    "url": "https://www.vox.com/policy/395860/trump-executive-orders-democracy-january-6-pardon-birthright-schedule-f"
  },
  {
    "text": "Trump declares border emergency to use US military to ‘repel forms of invasion’  —  President-elect Donald Trump signed nearly a dozen executive orders on border security Monday.  —  Lauren Villagran Bart JansenUSA TODAY  —  WASHINGTON − President Donald Trump on Monday declared … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2025/01/20/trump-executive-order-national-emergency-mexico-border-military/77557680007/"
  },
  {
    "text": "Actually, the 14th Amendment Still Exists  —  Trump signed an executive order purporting to rewrite birthright citizenship.  That's not how the Constitution works.  —  President Donald Trump signed an executive order Monday declaring that the federal government would no longer recognize … ",
    "url": "https://www.motherjones.com/politics/2025/01/trump-birthright-citizenship-executive-order-14th-amendment-still-exists/"
  },
  {
    "text": "GRANTING PARDONS AND COMMUTATION OF SENTENCES FOR CERTAIN OFFENSES RELATING TO THE EVENTS AT OR NEAR THE UNITED STATES CAPITOL ON JANUARY 6, 2021  —  BY THE PRESIDENT OF THE UNITED STATES OF AMERICA  —  This proclamation ends a grave national injustice that has been perpetrated upon … ",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/01/granting-pardons-and-commutation-of-sentences-for-certain-offenses-relating-to-the-events-at-or-near-the-united-states-capitol-on-january-6-2021/"
  },
  {
    "text": "Trump commutes sentences of Proud Boys and Oath Keepers leaders as he pardons over 1,000 January 6 US Capitol rioters  —  President Donald Trump on Monday pardoned more than 1,000 people charged in the January 6, 2021, attack on the US Capitol, and commuted the sentences of leaders of the Proud Boys and Oath Keepers.",
    "url": "https://www.cnn.com/2025/01/20/politics/january-6-2021-capitol-riot-pardons-trump/"
  },
  {
    "text": "Trump signs order seeking to rename Alaska's Denali and the Gulf of Mexico  —  President Donald Trump said the Gulf of Mexico will be called Gulf of America, while the Denali mountain peak will revert to its old name, Mount McKinley.  —  President Donald Trump on Monday issued … ",
    "url": "https://www.washingtonpost.com/politics/2025/01/21/trump-gulf-of-america-mexico-denali-mckinley/"
  },
  {
    "text": "Neo-Nazis Love the Nazi-Like Salutes Elon Musk Made at Trump's Inauguration  —  The far right is celebrating what it views as a clear signal from the X owner and Donald Trump associate, who made the gestures on stage Monday.  —  Neo-Nazis are celebrating Elon Musk making two Nazi … ",
    "url": "https://www.wired.com/story/neo-nazis-love-elon-musk-nazi-like-salutes-trumps-inauguration/"
  },
  {
    "text": "Initial Rescissions Of Harmful Executive Orders And Actions  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered as follows:  —  Section 1.  Purpose and Policy.  The previous administration has embedded deeply unpopular … ",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/01/initial-rescissions-of-harmful-executive-orders-and-actions/"
  },
  {
    "text": "WITHDRAWING THE UNITED STATES FROM THE WORLD HEALTH ORGANIZATION  —  WITHDRAWING THE UNITED STATES FROM THE WORLD  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:  —  Section 1.  Purpose.",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/01/withdrawing-the-united-states-from-the-worldhealth-organization/"
  },
  {
    "text": "Trump Withdraws U.S. from World Health Organization  —  Public health experts say U.S. withdrawal from the W.H.O. would undermine the nation's standing as a global health leader and make it harder to fight the next pandemic.  —  President Trump moved quickly on Monday to withdraw the United States … ",
    "url": "https://www.nytimes.com/2025/01/20/us/politics/trump-world-health-organization.html?unlocked_article_code=1.q04.6_VH.VcT84ufm4HK4&smid=url-share"
  },
  {
    "text": "DEFENDING WOMEN FROM GENDER IDEOLOGY EXTREMISM AND RESTORING BIOLOGICAL TRUTH TO THE FEDERAL GOVERNMENT  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, including section 7301 of title 5, United States Code, it is hereby ordered:",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/01/defending-women-from-gender-ideology-extremism-and-restoring-biological-truth-to-the-federal-government/"
  },
  {
    "text": "Portrait of General Milley Is Removed From Pentagon  —  The decision was an early salvo by the new administration against a military that President Trump has assailed for a variety of perceived offenses.  —  The Pentagon on Monday removed a portrait of Gen. Mark A. Milley … ",
    "url": "https://www.nytimes.com/2025/01/20/us/politics/general-mark-milley-portrait.html"
  },
  {
    "text": "APPLICATION OF PROTECTING AMERICANS FROM FOREIGN ADVERSARY CONTROLLED APPLICATIONS ACT TO TIKTOK  —  By the authority vested in me as President by the Constitution and the laws of the United States of America it is hereby ordered:  —  Section 1.  Policy.  The Protecting Americans … ",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/01/application-of-protecting-americans-from-foreign-adversary-controlled-applications-act-to-tiktok/"
  },
  {
    "text": "Trump: Biden family pardons make ‘him look very guilty’  —  President Trump criticized former President Biden for pardoning several members of his family during his last moments as commander in chief, with Trump arguing the actions make “him look very guilty.”",
    "url": "https://thehill.com/homenews/administration/5097618-donald-trump-criticizes-joe-biden-pardons/"
  },
  {
    "text": "Get out of DOGE: How Musk helped eject Ramaswamy  —  Ramaswamy is leaving the so-called Department of Government Efficiency and plans to run for Ohio governor.  —  Elon Musk has already achieved his first cut at the so-called Department of Government Efficiency: his co-leader Vivek Ramaswamy.",
    "url": "https://www.politico.com/news/2025/01/20/doge-musk-helped-eject-ramaswamy-00199487"
  },
  {
    "text": "Memorandum to Resolve the Backlog of Security Clearances for Executive Office of the President  —  Personnel  —  Clearances for Executive Office of the President  —  The Executive Office of the President requires qualified and trusted personnel to execute its mandate on behalf of the American people.",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/01/memorandum-to-resolve-the-backlog-of-security-clearances-for-executive-office-of-the-president-personnel/"
  },
  {
    "text": "Fetterman rips rumors he'll switch to GOP: ‘Rocket sled to Palookaville’  —  Sen. John Fetterman (D-PA) shot down rumors that he would switch to the Republican Party.  —  Speaking to Semafor, Fetterman dismissed such rumors as “amateur hour s***,” vowing to remain with the Democratic Party.",
    "url": "https://www.washingtonexaminer.com/news/senate/3294872/fetterman-rips-rumors-switch-republican/"
  },
  {
    "text": "Delivering Emergency Price Relief for American Families and Defeating the Cost-of-Living Crisis  —  Over the past 4 years, the Biden Administration's destructive policies inflicted an historic inflation crisis on the American people.  The Biden Administration not only exploded Government spending … ",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/01/delivering-emergency-price-relief-for-american-families-and-defeating-the-cost-of-living-crisis/"
  },
  {
    "text": "Trump signs order to end ‘government censorship’ of social media  —  President Donald Trump signed an executive order intended to stop “government censorship,” a sweeping action that could chill years of efforts to combat the proliferation of false information online.",
    "url": "https://www.washingtonpost.com/politics/2025/01/20/trump-free-speech-executive-order-censorship/"
  },
  {
    "text": "Coast Guard Commandant terminated over border lapses, recruitment, DEI focus: official  —  Senior DHS official confirms to Fox News Digital Coast Guard Adm. Linda Fagan has been relieved of her post  —  EXCLUSIVE: The Commandant of the U.S. Coast Guard has been terminated over concerns about the border … ",
    "url": "https://www.foxnews.com/politics/coast-guard-commandant-terminated-over-border-lapses-recruitment-dei-focus-official"
  }
]