[
  {
    "text": "Jimmy Carter votes for Kamala Harris  —  The former president, who turned 100 earlier this month, said he wanted to live long enough to vote for the Democratic presidential nominee.  —  Former President Jimmy Carter told his family he was more interested in voting for Vice President Kamala Harris … ",
    "url": "https://www.ajc.com/politics/jimmy-carter-just-turned-100-fulfilled-wish-to-vote-for-kamala-harris/HTE7BVP3AZDIJJNZE3XPYPNGXI/"
  },
  {
    "text": "Justice Department to monitor voting in Ohio county after sheriff's comment about Harris supporters  —  The U.S. Justice Department will send election monitors to an Ohio county where a sheriff was recently accused of intimidating voters in a social media post, federal officials announced Tuesday.",
    "url": "https://apnews.com/article/ohio-sheriff-harris-yard-signs-justice-department-279b00173bac36f4547f5ae69fe62403"
  },
  {
    "text": "‘Off the charts:’ How Trump tariffs would shock U.S., world economies  —  If implemented, the former president's tariff plans would lead to higher costs, stock market volatility and feuds with the rest of the world.  —  Former president Donald Trump is campaigning on the most significant increase … ",
    "url": "https://www.washingtonpost.com/business/2024/10/16/trump-tariffs-impact-economy/"
  },
  {
    "text": "Trump's campaign is trying to hide his sad state from voters  —  His decline is undeniable.  They're hoping you don't notice in time. … MAGA-friendly CNBC host Joe Kernen dropped an interesting nugget right as Squawk Box went to commercial break on Tuesday.  —  “Well, Trump canceled, and he was going to come on,” Kernen said.",
    "url": "https://www.publicnotice.co/p/trump-cancels-cnbc-cnn-debate"
  },
  {
    "text": "Republicans Tell Trump That Elon Musk's Super PAC Is Blowing It  —  Donald Trump's allies have been warning him that Musk's field operation is failing in key states — and that it's being led by DeSantis' failed team  —  Donald Trump has largely outsourced his 2024 campaign's … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-elon-musk-republicans-super-pac-election-2024-1235134877/"
  },
  {
    "text": "‘Pennsylvania is such a mess’: Inside Team Harris' unusual levels of finger-pointing  —  Many of the state's most well-connected Democrats have been worried about the operation for months.  —  PHILADELPHIA — Top Democrats in Pennsylvania are worried Vice President Kamala Harris' operation … ",
    "url": "https://www.politico.com/news/2024/10/16/kamala-harris-pennsylvania-campaign-drama-00183844"
  },
  {
    "text": "The Delusions of the Donald  —  We'll see you tomorrow, Philadelphia!  Happy Wednesday.  —  Uh, What Was That?  —  by Andrew Egger  —  Back in January, the great McKay Coppins wrote a piece for the Atlantic titled “You Should Go to a Trump Rally.”  The idea was that secondhand media accounts … ",
    "url": "https://www.thebulwark.com/p/the-delusions-of-the-donald"
  },
  {
    "text": "Think hard, Republicans.  You really want to do this again?  —  If Harris wins, the GOP would be sabotaging a bright future by not conceding that Trump lost.  —  Let me speak for a minute to all the longtime Republican lawmakers and strategists in Washington, a lot of whom I've known over the years.",
    "url": "https://www.washingtonpost.com/opinions/2024/10/16/gop-election-denial-liz-cheney-after-trump/"
  },
  {
    "text": "Trump Escalates Threats to Political Opponents He Deems the ‘Enemy’  —  Never before has a presidential nominee openly suggested turning the military on Americans simply because they oppose his candidacy.  With voting underway, Donald Trump has turned to dark vows of retribution.",
    "url": "https://www.nytimes.com/2024/10/15/us/politics/trump-opponents-enemy-within.html"
  },
  {
    "text": "Michelle Obama to headline get-out-the-vote rally in Georgia  —  Michelle Obama is headlining a get-out-the-vote rally in Georgia just days ahead of the presidential election.  —  The former first lady and founder of When We All Vote, a voter engagement and mobilization initiative … ",
    "url": "https://thehill.com/homenews/campaign/4936061-michelle-obama-georgia-voter-rally/"
  },
  {
    "text": "The U.S. Presidential Contest, October 16, 2024  —  Marist National Poll  —  Harris +5 Points Against Trump Nationally  —  In the presidential contest, Vice President Kamala Harris leads former President Donald Trump by five points among likely voters, including those who are undecided yet leaning toward a candidate.",
    "url": "https://maristpoll.marist.edu/polls/the-u-s-presidential-contest-october-16-2024/"
  },
  {
    "text": "Revealed: International ‘race science’ network secretly funded by US tech boss  —  Group promoting ‘dangerous’ scientific racism ideology teamed up with rightwing extremist, recordings reveal  —  An international network of “race science” activists seeking to influence public debate … ",
    "url": "https://www.theguardian.com/world/2024/oct/16/revealed-international-race-science-network-secretly-funded-by-us-tech-boss"
  },
  {
    "text": "Judge Blocks Hand-Counting of Election Ballots in Georgia  —  The ruling was confined to the current election, halting the measure from going into effect for 2024 while the judge further weighs its merits in the future.  —  A county judge in Georgia on Tuesday blocked a new rule mandating … ",
    "url": "https://www.nytimes.com/2024/10/15/us/elections/georgia-ballot-hand-count-ruling.html?unlocked_article_code=1.Sk4.22em.6WVg88W-IdP7&smid=nytcore-ios-share&referringSource=articleShare&sgrp=c-cb"
  },
  {
    "text": "Under Trump, U.S. Prisons Offered Gender-Affirming Care  —  The Trump administration's approach is notable in light of a campaign ad that slams Vice President Kamala Harris for supporting taxpayer-funded transgender surgeries for prisoners and migrants.  —  A campaign ad released … ",
    "url": "https://www.nytimes.com/2024/10/16/us/politics/trump-prisons-transgender-care-harris.html?unlocked_article_code=1.Sk4.Icqy.t3xXIaT4zrE5&smid=url-share"
  },
  {
    "text": "A TV station stopped playing pro-abortion rights ads after state's threats, lawsuit says, … Gabrielle Russon  —  Gabrielle Russon is an award-winning journalist based in Orlando.  She covered the business of theme parks for the Orlando Sentinel.  Her previous newspaper stops include … ",
    "url": "https://floridapolitics.com/archives/701815-a-tv-station-stopped-playing-pro-abortion-rights-ads-after-states-threats-lawsuit-says/"
  },
  {
    "text": "Transcript: Trump's Mental Decline Finally Becomes Big Media Story  —  The following is a lightly edited transcript of the October 16, 2024, episode of The Daily Blast podcast.  Listen to it here.  —  Greg Sargent: This is The Daily Blast from The New Republic, produced and presented by the DSR Network.",
    "url": "https://newrepublic.com/article/187197/transcript-trumps-mental-decline-finally-becomes-big-media-story"
  },
  {
    "text": "Ted Cruz Refuses to Say If He Supports Abortion Exceptions: ‘Why Do You Keep Asking?’  —  The Texas senator was given three chances to clarify his views on whether abortion bans should include any exceptions.  He did not answer  —  DURING A DEBATE against Rep. Colin Allred on Tuesday night … ",
    "url": "https://www.rollingstone.com/politics/politics-news/ted-cruz-colin-allred-debate-abortion-exceptions-1235134866/"
  },
  {
    "text": "Stealth Edit: FBI Quietly Revises Violent Crime Stats  —  When the FBI originally released the “final” crime data for 2022 in September 2023, it reported that the nation's violent crime rate fell by 2.1%.  This quickly became, and remains, a Democratic Party talking point to counter Donald Trump's claims of soaring crime.",
    "url": "https://www.realclearinvestigations.com/articles/2024/10/16/stealth_edit_fbi_quietly_revises_violent_crime_stats_1065396.html"
  },
  {
    "text": "Donald Trump, American Fascist  —  Please note: I will add an audio version of this piece by Wednesday morning.  Thank you for your patience.  —  Donald Trump's closing pitch to the American people is rage, intimidation, and vengeful violence.  He is threatening - or promising, if you ask his supporters - fascism.",
    "url": "https://thomaszimmer.substack.com/p/donald-trump-american-fascist"
  },
  {
    "text": "Italy passes anti-surrogacy law that effectively bars gay couples from becoming parents  —  The West's most restrictive law against international surrogacy threatens would-be parents who use birth mothers abroad with jail time and severe fines.  —  ROME — Italy on Wednesday passed the West's … ",
    "url": "https://www.washingtonpost.com/world/2024/10/16/italy-surrogacy-ban-gay-parents/"
  }
]