[
  {
    "text": "Ex-Trump aide Cassidy Hutchinson claims Rudy Giuliani groped her on January 6  —  Exclusive: in a new book, Hutchinson describes incident in which the former New York mayor put his hand ‘under my blazer, then my skirt’  —  Cassidy Hutchinson, the former Trump aide turned crucial January 6 witness … ",
    "url": "https://www.theguardian.com/us-news/2023/sep/20/rudy-giuliani-grope-cassidy-hutchinson-claim-january-6-trump-aide"
  },
  {
    "text": "Trump Privately Frets He Could Be Headed to Prison  —  Would he be sent to a “club fed” style prison — or a “bad” one?  Would he have Secret Service protection?  And what would they make him wear?  Those are some of the questions Donald Trump is asking his lawyers as his many trials loom",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-prison-conviction-trial-1234828231/"
  },
  {
    "text": "Cassidy Hutchinson Says Rudy Giuliani Groped Her During January 6 Rally  —  Rudy Giuliani has been accused of a staggering amount of untoward and even illegal behavior in recent years.  Worst among the allegations are his former employee's claims that he sexually assaulted and harassed her … ",
    "url": "https://nymag.com/intelligencer/2023/09/cassidy-hutchinson-says-giuliani-groped-her-on-january-6.html"
  },
  {
    "text": "Bipartisan McCarthy bailout talks gaining steam thanks to House chaos  —  Any Democratic participation in a plan to stop a shutdown — let alone save the speaker's gavel — would have huge conditions attached.  —  The long-shot idea that Democrats could bail out the beleaguered Speaker Kevin McCarthy is suddenly getting real.",
    "url": "https://www.politico.com/news/2023/09/20/bipartisan-mccarthy-bailout-talks-gaining-steam-thanks-to-house-chaos-00117179"
  },
  {
    "text": "House Speaker McCarthy to Hardliners: 'It's Like You're Walking Into a Fight Losing'  —  ‘I want to be able to win these battles,’ McCarthy says, blaming fellow Republicans for a blockade on government funding and diminishing his negotiating leverage with Democrats",
    "url": "https://themessenger.com/politics/house-speaker-mccarthy-to-hardliners-its-like-youre-walking-into-a-fight-losing"
  },
  {
    "text": "Why the White House is letting McCarthy flail  —  The administration has no plans to help as Kevin McCarthy and House Republicans inch closer to a government shutdown.  —  Speaker Kevin McCarthy is struggling to pass a bill to fund the government — and the White House isn't about to throw him a lifeline.",
    "url": "https://www.politico.com/news/2023/09/20/biden-white-house-mccarthy-shutdown-budget-00116965"
  },
  {
    "text": "Lin Wood: 'I didn't flip on President Trump'  —  X  —  Former Atlanta attorney Lin Wood pushed back Wednesday on the notion that he would testify against Donald Trump in Fulton County's racketeering case.  —  Wood's name turned up in a new filing by Fulton County District Attorney Fani Willis naming … ",
    "url": "https://www.ajc.com/news/lin-wood-i-didnt-flip-on-president-trump/K36BYKE4LRABFKAPTKCZCXPQLM/"
  },
  {
    "text": "Pro-Trump Lawyer Lin Wood Turned State's Witness in Georgia Racketeering Case, DA Reveals  —  A once-prominent defamation lawyer who represented Richard Jewell, Lin Wood surrendered his law license in July under the shroud of disciplinary proceedings  —  A Facebook icon representing … ",
    "url": "https://themessenger.com/politics/pro-trump-lawyer-lin-wood-witness-georgia-rico"
  },
  {
    "text": "Free COVID test kits are coming back.  Here's how to get them.  —  The Biden administration is preparing to resume taking orders for free at-home COVID-19 tests starting September 25, officials announced Wednesday.  The administration is also planning a new infusion of money to boost domestic manufacturing of the test kits.",
    "url": "https://www.cbsnews.com/news/free-covid-tests-how-to-order-online/"
  },
  {
    "text": "Democrats have been winning big in special elections  —  That could bode well for them in the 2024 election.  —  Democrats just scored a big win in an election on Tuesday: Democrat Hal Rafter defeated Republican James Guzofski 56 percent to 44 percent in a special election to fill … ",
    "url": "https://abcnews.go.com/538/democrats-winning-big-special-elections/story?id=103315703"
  },
  {
    "text": "Trumpism costs the GOP in a crucial election, again  —  The Republican Party's increasing Trump-era tendency toward more extreme nominees and its struggles to account for the Supreme Court's decision to overturn Roe v. Wade have already cost it plenty.  It's quite possible that these things cost … ",
    "url": "https://www.washingtonpost.com/politics/2023/09/20/trumpism-costs-gop-crucial-election-again/"
  },
  {
    "text": "CNN Poll: Trump leads in New Hampshire while Ramaswamy, Haley, Christie and DeSantis battle for second  —  Former President Donald Trump holds a sizable lead in the race for the 2024 Republican presidential nomination in New Hampshire, but a close contest for second place … ",
    "url": "https://www.cnn.com/2023/09/20/politics/cnn-poll-new-hampshire/"
  },
  {
    "text": "Merrick Garland faced fire from Republicans on Hunter Biden, Trump  —  House Republicans peppered Attorney General Merrick Garland with criticisms during the nearly six-hour House Judiciary Committee hearing.  The divide between Democratic and Republican lawmakers on a range of issues … ",
    "url": "https://www.washingtonpost.com/national-security/2023/09/20/merrick-garland-attorney-general-testimony-house-judiciary/"
  },
  {
    "text": "Federal Reserve issues FOMC statement  —  For release at 2:00 p.m. EDT  —  Recent indicators suggest that economic activity has been expanding at a solid pace.  Job gains have slowed in recent months but remain strong, and the unemployment rate has remained low.  Inflation remains elevated.",
    "url": "https://www.federalreserve.gov/newsevents/pressreleases/monetary20230920a.htm"
  },
  {
    "text": "The Untold Story of One Indicted Fake Trump Elector in Georgia  —  Before she was indicted for taking part in Trump's scheme to stay in power, Cathy Latham professed to hating politics for being a dirty business.  Now she's knee-deep in the mud. … In the weeks before she became … ",
    "url": "https://www.thedailybeast.com/the-untold-story-of-one-indicted-fake-trump-elector-in-georgia"
  },
  {
    "text": "FACT SHEET: Biden-Harris Administration Launches American Climate Corps to Train Young People in Clean Energy, Conservation, and Climate Resilience Skills, Create Good-Paying Jobs and Tackle the Climate Crisis  —  In its first year, the American Climate Corps will put more than 20,000 young people … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2023/09/20/fact-sheet-biden-harris-administration-launches-american-climate-corps-to-train-young-people-in-clean-energy-conservation-and-climate-resilience-skills-create-good-paying-jobs-and-tackle-the-clima/"
  },
  {
    "text": "Senate Poised to Confirm Military Chiefs, Sidestepping Tuberville Blockade  —  Three generals were on track for confirmation, but Senator Tommy Tuberville, the Alabama Republican who has been blocking them, said he would continue to hold up others over a Pentagon abortion policy.",
    "url": "https://www.nytimes.com/2023/09/20/us/politics/senate-military-nominations-tuberville.html"
  },
  {
    "text": "Kari Lake to launch Arizona Senate bid next month  —  The close ally of Trump is looking to run in the swing state again.  —  Arizona Republican Kari Lake will launch a Senate run as soon as early next month, according to three people familiar with her plans.",
    "url": "https://www.politico.com/news/2023/09/20/kari-lake-arizona-senate-bid-00117148"
  },
  {
    "text": "Exclusive: Pentagon to review cases of LGBTQ+ veterans denied honorable discharges under “don't ask, don't tell”  —  Thousands of LGBTQ+ veterans who were kicked out of the military because of their sexuality could see their honor restored under a new initiative the Defense Department is set … ",
    "url": "https://www.cbsnews.com/news/lgbtq-veterans-honorable-discharge-defense-department-announcement/"
  },
  {
    "text": "Florida's “War on Woke” Is Spurring a Brain Drain  —  Thanks to Ron DeSantis's education policies, the state is seeing an unprecedented exodus of teachers, professors, and college students.  —  Pocket  —  This article appears in the October 2/9, 2023 issue, with the headline “Florida's Brain Drain.”",
    "url": "https://www.thenation.com/article/society/desantis-florida-education/"
  },
  {
    "text": "The anti-vaccine movement is on the rise.  The White House is at a loss over what to do about it.  —  “They keep just hoping it'll go away.”  —  This is the first story of a five-part series diving into the rise of the anti-vaccine political movement.  —  A Biden administration that vowed … ",
    "url": "https://www.politico.com/news/2023/09/20/biden-anti-vax-movement-00116516"
  },
  {
    "text": "White House told U.S. ambassador to Japan to stop taunting China on social media  —  Rahm Emanuel has mocked Chinese President Xi Jingping, speculating about the recent disappearance of a top official.  —  WASHINGTON — President Joe Biden's aides have asked that Rahm Emanuel … ",
    "url": "https://www.nbcnews.com/politics/white-house/rahm-emanuel-mock-china-ambassador-rcna105982"
  },
  {
    "text": "Trump and Meadows joked about Covid on plane after Biden debate, book says  —  Exclusive: Ex-aide Cassidy Hutchinson says Trump ordered White House guests who tested positive to remove masks in Oval Office  —  Donald Trump and his chief of staff Mark Meadows joked about the then US president having Covid … ",
    "url": "https://www.theguardian.com/books/2023/sep/20/trump-meadows-joked-covid-biden-debate-cassidy-hutchinson-book"
  }
]