[
  {
    "text": "Trump has no immunity from Jan. 6 prosecution, appeals court rules  —  A federal appeals court has unanimously ruled that Donald Trump can be put on trial for trying to stay in power after losing the 2020 election, rejecting Trump's sweeping claim of presidential immunity and moving the case one step closer to a jury.",
    "url": "https://www.washingtonpost.com/dc-md-va/2024/02/06/trump-jan-6-immunity-appeal-denied/"
  },
  {
    "text": "Appeals court rules against Trump presidential immunity in 2020 election interference case  —  Trump is likely to ask the Supreme Court to intervene after the ruling, which would allow the trial to go ahead in the criminal case in Washington, D.C.  —  WASHINGTON — A federal appeals court … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/appeals-court-rules-trump-presidential-immunity-2020-election-interfer-rcna133234"
  },
  {
    "text": "Trump is not immune from prosecution for bid to subvert the 2020 election, appeals court rules  —  The unanimous 57-page decision is a major win for special counsel Jack Smith.  —  Former President Donald Trump — and indeed any other former president — may be prosecuted for alleged crimes … ",
    "url": "https://www.politico.com/news/2024/02/06/trump-is-not-immune-from-prosecution-for-bid-to-subvert-the-2020-election-appeals-court-rules-00139832"
  },
  {
    "text": "Donald Trump does not have presidential immunity, US court rules  —  Donald Trump does not have presidential immunity and can be prosecuted on charges of plotting to overturn the 2020 election, a US court has ruled.  —  Mr Trump had claimed in the landmark legal case that he was immune … ",
    "url": "https://www.bbc.com/news/world-us-canada-68026175"
  },
  {
    "text": "Judge Demands Trump Explain His Accountant's Apparent Lies  —  Trump accountant Allen Weisselberg is apparently working out a deal addressing lies he told on the stand in the New York bank fraud trial.  Now Trump is in even more trouble.  —  Donald Trump's expected massive loss … ",
    "url": "https://www.thedailybeast.com/judge-demands-trump-explain-his-accountant-allen-weisselbergs-apparent-lies"
  },
  {
    "text": "Trump Denied Immunity in DC Election Case by Appeals Court  — Three judge panel issues unanimous decision on Trump immunity  — Trump has until Feb. 12 to appeal ruling to Supreme Court  —  Donald Trump can be prosecuted for trying to overturn the 2020 US election, a federal appeals court ruled … ",
    "url": "https://www.bloomberg.com/news/articles/2024-02-06/trump-denied-immunity-in-dc-election-case-by-appeals-court"
  },
  {
    "text": "Playbook: ‘Everything is dead’  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  JUST POSTED — “Is Antony Blinken Too Nice to be Secretary of State?” by Nahal Toosi: “The secretary of State has shown ... quiet fury in private these last few months … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/02/06/everything-is-dead-00139805"
  },
  {
    "text": "Heritage Action urges ‘no’ vote on border security, foreign aid package  —  Heritage Action, the advocacy arm of the conservative Heritage Foundation think tank, is urging lawmakers to oppose the national security supplemental package, which includes the bipartisan border agreement and foreign aid … ",
    "url": "https://thehill.com/homenews/senate/4451005-heritage-action-no-vote-border-bill/"
  },
  {
    "text": "A Border Security Bill Worth Passing  —  The Senate bill has reforms Trump never came close to getting.  —  Do Republicans want to better secure the U.S. border, or do they want to keep what has become an open sore festering for another year as an election issue?",
    "url": "https://www.wsj.com/articles/senate-border-security-bill-james-lankford-republicans-immigration-biden-border-patrol-asylum-bc2f9543?mod=followamazon"
  },
  {
    "text": "The GOP's True Priority  —  The Republicans who won't take yes for an answer  —  Sometimes, a negotiation produces a deal.  —  Sometimes, a negotiation reveals the truth.  —  Negotiators in the Senate have produced a draft agreement on immigration and asylum.  The deal delivers on Republican priorities.",
    "url": "https://www.theatlantic.com/ideas/archive/2024/02/republicans-congress-immigration-deal/677357/"
  },
  {
    "text": "As a compromise border plan collapses, the GOP is in disarray  —  There can be little doubt that one of the major American political parties is in disarray, but it's not the Democratic Party.  —  For those familiar with online political commentary, the phrase “Dems in disarray” … ",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/compromise-border-plan-collapses-gop-disarray-rcna137424"
  },
  {
    "text": "Bluesky, a trendy rival to X, finally opens to the public  —  The upstart social network has been by invitation only since its launch last year  —  When Jack Dorsey, then Twitter's CEO, tweeted in 2019 that he planned to create a new, “decentralized” form of social media, most people scratched their heads.",
    "url": "https://www.washingtonpost.com/technology/2024/02/06/bluesky-launch-public-jay-graber/"
  },
  {
    "text": "Second GOP rep says he'll vote against Mayorkas impeachment  —  Rep. Tom McClintock (R-Calif.) announced Tuesday that he would vote against a resolution to impeach Homeland Security Secretary Alejandro Mayorkas, becoming the second Republican to buck the party and putting GOP plans in jeopardy.",
    "url": "https://thehill.com/homenews/house/4450627-gop-loses-second-vote-in-effort-to-impeach-mayorkas/"
  },
  {
    "text": "Toby Keith dead: Country singer dies following cancer battle at 62  —  Country music star Toby Keith has died at the age of 62, his family announced early Tuesday morning.  —  Keith, best known for songs such as “Red Solo Cup”, “Should've Been a Cowboy,” “Beer for My Horses,” … ",
    "url": "https://www.washingtonexaminer.com/news/2839288/toby-keith-dead-country-singer-dies-following-cancer-battle-at-62/"
  },
  {
    "text": "Biden, Obama and Bill Clinton fundraiser expected in New York City in late March  —  The fundraiser is expected to take place on March 28, possibly at Radio City Music Hall, three people familiar with the planning told NBC News.  —  WASHINGTON — The Biden campaign has zeroed in on a likely date … ",
    "url": "https://www.nbcnews.com/politics/2024-election/biden-obama-bill-clinton-fundraiser-late-march-new-york-city-rcna137495"
  },
  {
    "text": "Mattis secretly advised Arab monarch on Yemen war, records show  —  U.S. officials approved the retired Marine general's work for the UAE, then fought to conceal it from the public.  The Post sued for the documents and won.  —  Soon after his country began bombing Yemen in 2015 … ",
    "url": "https://www.washingtonpost.com/investigations/2024/02/06/mattis-advised-uae-yemen-war/"
  },
  {
    "text": "House Dem Brutally Hits Back at Marjorie Taylor Greene's Gross Bathroom Claim  —  The MAGA lawmaker was seemingly upset about Rep. Jim McGovern likening her to a clown.  —  A House Democrat got into a wild war of words with Rep. Marjorie Taylor Greene on Monday involving mutual accusations … ",
    "url": "https://www.thedailybeast.com/house-dem-brutally-hits-back-at-marjorie-taylor-greenes-gross-bathroom-claim"
  }
]