[
  {
    "text": "138. Abrego Garcia, Constructive Custody, and Federal Judicial Power  —  Federal courts don't have jurisdiction over foreign prisons.  That doesn't mean that they're powerless when the U.S. government wrongly removes someone from the United States.  —  Welcome back to “One First,” an … ",
    "url": "https://www.stevevladeck.com/p/138-abrego-garcia-constructive-custody"
  },
  {
    "text": "Trump Admin Dismisses Judge's Order to Bring Back Man Accidentally Sent to El Salvador  —  “We suggest the judge contact President Bukele,” said White House Press Secretary Karoline Leavitt … “We suggest the judge contact President Bukele because we are unaware of the judge having jurisdiction … ",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-admin-order-man-accidentally-deported-el-salvador-1235311289/"
  },
  {
    "text": "Trump administration argues judge can't order return of man mistakenly deported to El Salvador  —  A federal judge didn't have the authority to order the Trump administration to broker the return of a Maryland man who was mistakenly deported from the U.S. to a notorious El Salvador prison … ",
    "url": "https://apnews.com/article/trump-el-salvador-prison-kilmar-abrego-garcia-5a92d6bd7f893eed64c2607cc129a6f9"
  },
  {
    "text": "A scary quote for the GOP on Trump and tariffs  —  What if Trump is willing to go down with the tariff ship — and take his party with him?  —  Just now  —  Perhaps the most infamous quote Sen. Lindsey Graham (R-South Carolina) ever offered about Donald Trump came in May 2016.",
    "url": "https://www.washingtonpost.com/politics/2025/04/05/scary-quote-gop-trump-tariffs/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQzODI1NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ1MjA3OTk5LCJpYXQiOjE3NDM4MjU2MDAsImp0aSI6ImM5NzFhNGMyLTY5OWYtNGZkMC04MGFkLWMzZjU4YjU0YTMxMyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzA0LzA1L3NjYXJ5LXF1b3RlLWdvcC10cnVtcC10YXJpZmZzLyJ9.qILFID7XazPwCpviRzAaXadIhtQ_gdece8so77rUmMk&itid=gfta"
  },
  {
    "text": "Musk slams key Trump adviser Navarro as tariffs bite  —  Elon Musk blasted top Trump administration trade adviser Peter Navarro overnight, calling out his education and lack of corporate credentials.  —  Why it matters: The two-day rout in the stock market this week, after Trump announced sweeping … ",
    "url": "https://www.axios.com/2025/04/05/musk-trump-tariffs-navarro-tesla"
  },
  {
    "text": "President Trump's Tariff Formula Makes No Economic Sense.  It's Also Based on an Error.  —  President Trump on Wednesday announced tariffs on practically every foreign country (and some non-countries), ranging from a 10 percent minimum all the way up to 50 percent.",
    "url": "https://www.aei.org/economics/president-trumps-tariff-formula-makes-no-economic-sense-its-also-based-on-an-error/"
  },
  {
    "text": "Obama calls on citizens, colleges and law firms to resist Trump agenda  —  In a campus speech, the former president said universities should be prepared to lose federal funds to defend academic freedom, rather than be “intimidated.”  —  Just now  —  Former president Barack Obama called … ",
    "url": "https://www.washingtonpost.com/politics/2025/04/05/obama-trump-universities-intimidation/"
  },
  {
    "text": "Senate Approves G.O.P. Budget Plan After Overnight Vote-a-Thon  —  Republicans pushed through their blueprint for tax and spending cuts after Democrats forced them to cast politically painful votes into the early morning on every element of President Trump's agenda.",
    "url": "https://www.nytimes.com/2025/04/05/us/politics/senate-budget.html"
  },
  {
    "text": "Trump Weakens U.S. Cyberdefenses at a Moment of Rising Danger  —  The firing of the head of the National Security Agency was only the latest move that has eroded the country's fortifications against cyberattacks, especially those targeting elections.  —  When President Trump abruptly fired … ",
    "url": "https://www.nytimes.com/2025/04/05/us/politics/trump-loomer-haugh-cyberattacks-elections.html"
  },
  {
    "text": "Firing of National Security Agency Chief Rattles Lawmakers  —  Gen. Timothy D. Haugh, who was also the head of U.S. Cyber Command, was one of several national security officials fired on the advice of a conspiracy theorist.  —  As soon as word spread that President Trump had fired Gen. Timothy D. Haugh … ",
    "url": "https://www.nytimes.com/2025/04/05/us/politics/nsa-director-haugh-trump-loomer.html?unlocked_article_code=1.9U4.J3uJ.t8q903rxGTiy"
  },
  {
    "text": "DHS officials ask IRS to use tax data to locate up to 7 million immigrants  —  The agencies have still not reached an agreement on sharing information.  But immigration officials now say they're seeking records on millions of people suspected of being in the United States without authorization.",
    "url": "https://www.washingtonpost.com/business/2025/04/05/irs-tax-data-immigration-enforcement/"
  },
  {
    "text": "DOGE Is Planning a Hackathon at the IRS.  It Wants Easier Access to Taxpayer Data  —  DOGE operatives have repeatedly referred to the software company Palantir as a possible partner in creating a “mega API” at the IRS, sources tell WIRED.  —  Elon Musk's so-called Department of Government Efficiency … ",
    "url": "https://www.wired.com/story/doge-hackathon-irs-data-palantir/"
  },
  {
    "text": "I was a British tourist trying to leave America.  Then I was detained, shackled and sent to an immigration detention centre  —  Graphic artist Rebecca Burke was on the trip of a lifetime.  But as she tried to leave the US she was stopped, interrogated and branded an illegal alien by ICE.",
    "url": "https://www.theguardian.com/us-news/2025/apr/05/i-was-a-british-tourist-trying-to-leave-america-then-i-was-detained-shackled-and-sent-to-an-immigration-detention-centre"
  },
  {
    "text": "‘Hands Off!’ protests against Trump and Musk are planned across the US  —  Opponents of President Donald Trump and billionaire Elon Musk plan to rally across the U.S. on Saturday to protest the administration's actions on government downsizing, the economy, human rights and other issues.",
    "url": "https://apnews.com/article/trump-musk-doge-protests-hands-off-472c574303260cbac315367cc808960d"
  },
  {
    "text": "April 4, 2025  —  The stock market rout continued today.  As expected, China announced retaliatory tariffs in response to those President Donald Trump announced on Wednesday.  Chinese leaders say they will impose a 34% tariff on all U.S. goods imported into China next Thursday.",
    "url": "https://heathercoxrichardson.substack.com/p/april-4-2025"
  },
  {
    "text": "The History Books Purged From the Naval Academy's Library  —  We now have a list of the 381 books that have been removed from the U.S. Naval Academy's Nimitz Library in Annapolis, Maryland.  Many of the books in the list fall under categories such as Critical Race Theory, Gender and Ethnic Studies, LGBTQ Studies, etc.",
    "url": "https://kevinmlevin.substack.com/p/the-history-books-purged-from-the"
  },
  {
    "text": "Video Shows Aid Workers Killed in Gaza Under Gunfire Barrage, With Ambulance Lights On  —  The U.N. has said Israel killed the workers.  The video appears to contradict Israel's version of events, which said the vehicles were “advancing suspiciously” without headlights or emergency signals.",
    "url": "https://www.nytimes.com/2025/04/04/world/middleeast/gaza-israel-aid-workers-deaths-video.html?unlocked_article_code=1.9U4.ueq4.aNDLWwV-_2T3&smid=url-share"
  },
  {
    "text": "In the race to save lives after the Myanmar quake, US rescuers are notable by their absence  —  Day after day, Chinese rescue teams haul children and elderly people from collapsed buildings as cameras beam the thanks of grateful survivors around the world.  Russian medical teams show off … ",
    "url": "https://apnews.com/article/myanmar-quake-usaid-trump-musk-9a6599ea15a0def922a4cb66e114b23e"
  },
  {
    "text": "US embassy's response to Russia's Kryvyi Rih attack ‘surprisingly disappointing,’ Zelensky says.  —  The U.S. Embassy to Ukraine's response to Russia's attack on the Ukrainian city of Kryvyi Rih on April 4, which killed 19 people and injured 68, was “unpleasantly surprising,” President Volodymyr Zelensky said on April 5.",
    "url": "https://kyivindependent.com/us-embassys-response-to-russias-kryvyi-rih-attack-unpleasantly-surprising-zelensky-says/"
  },
  {
    "text": "Tariffs bring overnight economic chaos  —  In one 48-minute speech, President Trump scrambled every American's budget, every U.S. company's balance sheet and every global alliance.  — Tariffs, a sometimes obscure economic tool, have massive power, especially when enacted this expansively.",
    "url": "https://www.axios.com/2025/04/05/trump-tariffs-companies-inflation"
  },
  {
    "text": "Big Law Firms Struck a Truce With Trump—and Set Off a Clash With Recruits  —  Law students at top schools reconsider offers at Skadden and other firms while associates cancel interviews in protest  —  Campus recruiting is the newest front in the Trump-induced turmoil at some of the country's most prominent law firms.",
    "url": "https://www.wsj.com/lifestyle/careers/big-law-firms-struck-a-truce-with-trumpand-set-off-a-clash-with-recruits-bef68b62?st=qjTNhD&reflink=mobilewebshare_permalink"
  },
  {
    "text": "Jaguar Land Rover suspends shipments to US after Trump tariffs  —  The company, which exports almost a quarter of its production to the U.S., is pausing shipments in April as it works out longer-term solutions.  —  Jaguar Land Rover (JLR), U.K.-based luxury automaker, said it will “pause” … ",
    "url": "https://www.politico.eu/article/jaguar-land-rover-suspends-shipments-to-us-after-trump-tariffs/"
  },
  {
    "text": "You're Not Crazy.  America Has Gone Mad … This is an oft-quoted passage from Hannah Arendt's The Origins of Totalitarianism.  And it's one that has proven especially popular in the years since the rise of Trump and explosion of global authoritarianism.  —  I open with it here because I … ",
    "url": "https://www.liberalcurrents.com/youre-not-crazy-america-has-gone-mad/"
  }
]