[
  {
    "text": "Trump backs out of ‘60 Minutes’ primetime interview, CBS says  —  New York CNN  —  Former President Donald Trump has backed out of a previously scheduled interview with “60 Minutes,” the most-watched newsmagazine in the United States, CBS News said Tuesday evening.",
    "url": "https://www.cnn.com/2024/10/01/media/trump-backs-out-60-minutes-interview-cbs/"
  },
  {
    "text": "Trump rejects “60 Minutes” interview; Harris accepts … Steven Cheung, the Trump campaign communications director, told Axios:  — “There were discussions but nothing was ever scheduled or locked in. … - “For over half a century, 60 Minutes has invited the Democratic and Republican tickets … ",
    "url": "https://www.axios.com/2024/10/01/trump-harris-60-minutes-interview"
  },
  {
    "text": "Harris launches a new ad that hits Trump's age in criticizing Vance  —  The ad is timed to begin airing with the vice presidential debate on Tuesday.  —  WASHINGTON — Vice President Kamala Harris' campaign is launching a new digital ad Tuesday slamming Republican vice presidential nominee … ",
    "url": "https://www.nbcnews.com/politics/2024-election/harris-launches-new-ad-hits-trumps-age-criticizing-vance-rcna173526"
  },
  {
    "text": "Republicans Will Secretly Cheer Walz during Debate: Friend  —  SILENTLY ANTI-TRUMP  —  A congressman who served with Tim Walz predicts even more will come out of the woodwork.  —  Deputy Washington Bureau Chief  —  Tim Walz's former roommate and fellow lawmaker claims there's a secret cabal … ",
    "url": "https://www.thedailybeast.com/republicans-will-secretly-cheer-walz-during-debate-friend"
  },
  {
    "text": "Donald Trump Backs Out of Interview With ‘60 Minutes,’ Network Says  —  WALKOUT  —  The former president will not participate in the interview, though a representative for Trump said “nothing was ever scheduled or locked in.”  —  Former President Donald Trump has pulled out of a scheduled interview … ",
    "url": "https://www.thedailybeast.com/donald-trump-cancels-interview-with-60-minutes-network-says"
  },
  {
    "text": "Fact checking VP debate claims from Walz and Vance's 2024 showdown  —  The CBS News Confirmed team is fact checking the biggest claims made by Minnesota Gov. Tim Walz and Ohio Sen. JD Vance in tonight's 2024 vice presidential debate in New York City.  —  CBS News is hosting … ",
    "url": "https://www.cbsnews.com/news/fact-check-vp-debate-2024/"
  },
  {
    "text": "Olivia Nuzzi accuses ex-fiance of orchestrating blackmail campaign amid RFK relationship  —  New York magazine writer Olivia Nuzzi is publicly accusing her ex-fiancé Ryan Lizza, a prominent political journalist with Politico, of orchestrating a harassment and blackmail campaign … ",
    "url": "https://www.cnn.com/2024/10/01/media/olivia-nuzzi-ryan-lizza-rfk-relationship/"
  },
  {
    "text": "Cook Political Report shifts Texas Senate race toward Democrats  —  The Cook Political Report on Tuesday shifted Texas's Senate race from “likely Republican” to “lean Republican,” signaling momentum for Rep. Colin Allred's (D-Texas) challenge against incumbent Sen. Ted Cruz (R-Texas) in the red state.",
    "url": "https://thehill.com/homenews/campaign/4910340-texas-senate-cook-political-report/"
  },
  {
    "text": "Support Hurricane Helene Victims - Trump Authorized  —  Meredith ORourke is organizing this fundraiser. … President Donald J. Trump has launched this GoFundMe campaign as an official response for MAGA supporters to offer their financial assistance to their fellow Americans impacted by Hurricane Helene.",
    "url": "https://www.gofundme.com/f/support-hurricane-helene-victims-with-president-trump"
  },
  {
    "text": "JD Vance explains immigrant deportation priorities if Trump is elected … - “A lot of people will go home if they can't work for less than minimum wage in our own country,” Vance said. … - Vance said they would start with deporting the roughly one million undocumented immigrants … ",
    "url": "https://www.axios.com/2024/10/02/vp-debate-immigration-border-jd-vance-tim-walz"
  },
  {
    "text": "Iran Launches About 180 Ballistic Missiles at Israel  —  Many of the missiles were intercepted with the help of the United States, but some fell in central and southern Israel, the Israeli military said.  Israel vowed to retaliate.  —  Raja Abdulrahim/The New York Times Diego Ibarra Sanchez for The New York Times",
    "url": "https://www.nytimes.com/live/2024/10/01/world/israel-lebanon-hezbollah?unlocked_article_code=1.O04.WhtG.h_OxzNa9i6I_&smid=url-share"
  },
  {
    "text": "September 2024 Arizona and North Carolina Polls: Harris and Trump Neck-and-Neck in Key Swing States  —  Home Polls September 2024 Arizona and North Carolina Polls: Harris and Trump Neck-and-Neck in Key Swing States  —  Democratic Statewide Candidates Outperform Harris in Arizona & North Carolina",
    "url": "https://emersoncollegepolling.com/september-2024-arizona-and-north-carolina-polls-harris-and-trump-neck-and-neck-in-key-swing-states/"
  },
  {
    "text": "If Helene affects voting, Trump may pay the price  —  Nearly a quarter of 2020 Trump voters in Florida, Georgia and the Carolinas live in counties declared federal disaster areas.  —  Hurricane Helene is gone, fragmented into large cloud formations over the Eastern United States that folded into the rest of the country's weather.",
    "url": "https://www.washingtonpost.com/politics/2024/10/01/if-helene-affects-voting-trump-may-pay-price/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI3NzU1MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI5MTM3NTk5LCJpYXQiOjE3Mjc3NTUyMDAsImp0aSI6ImU2ZjlhZTRhLWI3NTUtNGJlMC04ZDk0LWNlYzM0NTEyMDEzNSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzEwLzAxL2lmLWhlbGVuZS1hZmZlY3RzLXZvdGluZy10cnVtcC1tYXktcGF5LXByaWNlLyJ9.0-SaeJejNowNKy9wlUMVFSavIZFzaPgmazpMTxPu75A&itid=gfta"
  },
  {
    "text": "Walz's claim that he was in Hong Kong during Tiananmen Square protests undercut by unearthed newspaper reports  —  Newly unearthed reports contradict previous claims made by Minnesota Gov. Tim Walz about his travel to China, including a claim that the Democratic vice presidential nominee … ",
    "url": "https://www.cnn.com/2024/10/01/politics/tim-walz-china-tiananmen-square/"
  },
  {
    "text": "Taylor Lorenz Exits Washington Post to Launch ‘User Mag’ on Substack (Exclusive)  —  Lorenz, who is leaving the newspaper to launch the publication, says that it will “cover technology from the user side,” in contrast to traditional coverage of social media.",
    "url": "https://www.hollywoodreporter.com/business/digital/taylor-lorenz-leaves-washington-post-launch-user-mag-substack-1236011888/"
  },
  {
    "text": "120 additional sexual assault lawsuits to be filed against Sean ‘Diddy’ Combs  —  Lawyers for dozens of new accusers allege that some assaults took place at Combs's infamous “White Parties,” and involved victims as young as 9 and 14.  —  A team of lawyers announced Tuesday that it would be filing … ",
    "url": "https://www.washingtonpost.com/style/2024/10/01/diddy-sexual-assault-lawsuit-victims-tony-buzbee/"
  },
  {
    "text": "John Amos, ‘Good Times’ Dad and ‘Roots’ Actor, Dies at 84  —  John Amos, the star of “Good Times,” “Roots” and more, died on Aug. 21 in Los Angeles of natural causes, his representative confirmed to Variety on Tuesday.  He was 84.  —  “It is with heartfelt sadness that I share … ",
    "url": "https://variety.com/2024/tv/obituaries-people-news/john-amos-dead-good-times-roots-1236161810/"
  },
  {
    "text": "Trump blasts Harris on Iran, says Biden administration is ‘leading us to brink of World War III’  —  It was his latest instance of using current events to slam the vice president — just one day after turning a visit to a community ravaged by Hurricane Helene into a political jab.",
    "url": "https://www.politico.com/news/2024/10/01/trump-blasts-harris-iran-biden-administration-leading-world-war-iii-00181938"
  },
  {
    "text": "Republican Senate challengers lag well behind Trump in public polls … - Its persistence is a warning for the Republican high command that a close Trump victory in any given swing state doesn't guarantee a GOP Senate seat — even if it also signals a bloc of still-persuadable voters.",
    "url": "https://www.axios.com/2024/10/02/trump-senate-republicans-polling"
  },
  {
    "text": "Speaker Johnson says Congress has provided funds for Helene response  —  Speaker Mike Johnson (R-La.) on Tuesday said Congress has already authorized the disaster relief funds needed for the immediate response to Helene, the storm that has ravaged multiple states from Florida up through western North Carolina and Tennessee.",
    "url": "https://thehill.com/homenews/house/4910535-mike-johnson-helene-funds/"
  },
  {
    "text": "America's Strategy of Renewal  —  Rebuilding Leadership for a New World  —  A fierce competition is underway to define a new age in international affairs.  A small number of countries—principally Russia, with the partnership of Iran and North Korea, as well as China … ",
    "url": "https://www.foreignaffairs.com/united-states/antony-blinken-americas-strategy-renewal-leadership-new-world"
  },
  {
    "text": "A deeper look at Walz's China ties ahead of Tuesday's debate  —  ListenA deeper look at Walz's China ties ahead of Tuesday's debate  —  Gov. Tim Walz and Sen. JD Vance descend on New York tomorrow for the first — and only — Vice Presidential debate.  Walz's campaign has introduced … ",
    "url": "https://www.mprnews.org/episode/2024/09/30/a-deeper-look-at-walzs-china-ties-ahead-of-tuesdays-debate"
  },
  {
    "text": "Vance: GOP has to earn America's trust back on abortion … - “I want us, as the Republican Party, to be pro-family in the fullest sense of the word,” he said. … - He added, “We can be a big and diverse country where we respect people's freedom of conscience and make the country more pro-baby and pro-family.”",
    "url": "https://www.axios.com/2024/10/02/abortion-jd-vance-tim-walz-debate"
  },
  {
    "text": "Georgia judge signals a need to clarify ‘vague’ new election certification rule  —  A Georgia judge signaled Tuesday that he sees a need to bring clarity to the meaning of a “vague” new election certification rule approved by Donald Trump allies that critics say will inject chaos into the battleground state after Election Day.",
    "url": "https://www.cnn.com/2024/10/01/politics/georgia-judge-signals-a-need-to-clarify-vague-new-election-certification-rule/"
  },
  {
    "text": "Trump's Team Is Trying to Stop — Or Heavily Redact — the Release of Jack Smith's Election Fraud Report  —  The former president's lawyers are trying to get ahead of what could be his campaign's October surprise.  — Copy  —  Donald Trump's lawyers are scrambling to get ahead … ",
    "url": "https://www.notus.org/trump-team-jack-smith-election-fraud-report-redaction"
  }
]