[
  {
    "text": "Following Trump indictment, agency moves on investigation of Lt. Gov. Jones  —  A state agency is moving ahead with plans that will determine whether Lt. Gov. Burt Jones faces criminal charges as part of a scheme to overturn the 2020 presidential election in Georgia.Jones is one of 30 people … ",
    "url": "https://www.ajc.com/politics/following-trump-indictment-agency-moves-on-investigation-of-lt-gov-jones/GCK6Q7HZABB5PEHAMSQGWGTNEQ/"
  },
  {
    "text": "Who is Scott McAfee, the judge assigned to oversee Trump case in Georgia?  —  The newly leveled case against former President Donald Trump and his co-defendants accusing them of engaging in a conspiracy to overturn the results of the 2020 presidential election in Georgia has been assigned to a judge who is a lifelong Georgian.",
    "url": "https://www.cnn.com/2023/08/15/politics/scott-mcafee-trump-judge-georgia-rico-case/"
  },
  {
    "text": "We Will Finally Get a Trump Mugshot With Georgia Indictment … Donald Trump has been indicted for a fourth time in Georgia—this time for helping to lead a “criminal racketeering enterprise” in his efforts to overturn the 2020 election.  —  This case is the first indictment where we may get a mugshot of the former president.",
    "url": "https://newrepublic.com/post/174993/will-finally-get-trump-mugshot-georgia-indictment"
  },
  {
    "text": "MAGA Talking Heads Want Georgia Republicans to Overhaul Laws to Pardon Trump  —  Trump's fourth indictment prompted dubious legal arguments from the right.  —  Dastardly Stalinist Democrats have made it illegal to watch television, leading the country “towards the greatest constitutional crisis since … ",
    "url": "https://www.thedailybeast.com/maga-talking-heads-want-georgia-republicans-to-overhaul-laws-to-pardon-trump"
  },
  {
    "text": "The indictment Trump feared most  —  “Most indicted president.”  That was our Axios AM headline on Aug. 2 — 13 days ago. … - Any one of them could send former President Trump to prison for years. … - Fulton County District Attorney Fani Willis used a mobster statute … ",
    "url": "https://www.axios.com/2023/08/15/indictment-trump-prison-rico"
  },
  {
    "text": "4 things revealed by Trump's Georgia indictment  —  Donald Trump has been criminally charged for the fourth time this year, with Fulton County District Attorney Fani T. Willis unveiling an indictment Monday night concerning Trump's attempts to overturn the 2020 presidential election result in Georgia.",
    "url": "https://www.washingtonpost.com/politics/2023/08/15/takeaways-trump-georgia-indictment/"
  },
  {
    "text": "Georgia court offers new explanation for ‘fictitious’ indictment posted before Trump charges  —  A document describing charges in the indictment against Trump and 18 others appeared briefly online before the grand jury voted  —  The Fulton County, Georgia Clerk's Office is offering … ",
    "url": "https://www.foxnews.com/politics/georgia-court-offers-new-explanation-fictitious-indictment-posted-before-trump-charges"
  },
  {
    "text": "Trump stiffed his alleged co-conspirators, whose false claims brought in $250 million  — Several of former President Donald Trump's allies who are now facing criminal charges for helping him try to overturn the results of the 2020 election were never paid by the Trump political operation for work they did in late 2020.",
    "url": "https://www.cnbc.com/2023/08/15/trump-co-conspirators-never-got-paid-by-trump-team.html"
  },
  {
    "text": "Rudy Giuliani, RICO Champion, Gets Indicted on Law He Made Famous  —  One-time nemesis of Mafia bosses and Wall Street scofflaws is key in sprawling indictment alleging criminal conspiracy to keep Trump in office  —  In the 1980s Rudy Giuliani all but reinvented an underused 1970 law against racketeering.",
    "url": "https://www.wsj.com/articles/rudy-giuliani-indicted-racketeering-trump-rico-e2339c94?mod=djemalertNEWS"
  },
  {
    "text": "Mark Meadows seeks to move Fulton County election case to federal court  —  The former chief of staff was indicted with Trump and 17 others on Monday.  —  Former White House Chief of Staff Mark Meadows officially filed Tuesday to move the case brought against him by Fulton County District … ",
    "url": "https://abcnews.go.com/US/meadows-seeks-move-fulton-county-election-case-federal/story?id=102295084"
  },
  {
    "text": "Elon Musk's X is throttling traffic to websites he dislikes  —  The site formerly known as Twitter has added a five-second delay when a user clicks on a shortened link to the New York Times, Facebook and other sites Musk commonly attacks, a Washington Post analysis found",
    "url": "https://www.washingtonpost.com/technology/2023/08/15/twitter-x-links-delayed/"
  },
  {
    "text": "Former Special Agent In Charge Of The New York FBI Counterintelligence Division Pleads Guilty to Conspiring To Violate U.S. Sanctions On Russia  —  For Immediate Release  —  U.S. Attorney's Office, Southern District of New York  —  Damian Williams, the United States Attorney … ",
    "url": "https://www.justice.gov/usao-sdny/pr/former-special-agent-charge-new-york-fbi-counterintelligence-division-pleads-guilty"
  },
  {
    "text": "Former high-level FBI official pleads guilty in connection to scheme working for sanctioned Russian oligarch  —  The former head of counterintelligence for the FBI's New York field office pleaded guilty Tuesday to one count of conspiracy in connection to a scheme working for a sanctioned Russian oligarch in 2021.",
    "url": "https://www.cnn.com/2023/08/15/politics/charles-mcgonigal-fbi/"
  },
  {
    "text": "Special counsel says Hunter Biden's gun deal is ‘withdrawn’ and invalid  —  Special counsel David Weiss said the deal his team previously reached with Hunter Biden to resolve a felony gun possession charge was never approved by a probation officer and is not binding.",
    "url": "https://www.cnn.com/2023/08/15/politics/special-counsel-hunter-biden-gun-deal/"
  },
  {
    "text": "Treasury Secretary Janet Yellen Says She Ate Magic Mushrooms During China Visit  —  “There was this delicious mushroom dish,” said Yellen.  —  LOADING  —  Janet Yellen said she thoroughly enjoyed her July trip to China — and a local meal that included magic mushrooms.",
    "url": "https://www.huffpost.com/entry/treasury-secretary-janet-yellen-says-she-ate-magic-mushrooms-during-recent-china-visit_n_64db4d9ce4b06b5d9bad6341"
  },
  {
    "text": "George Santos Missed the Deadline to Reveal His Finances.  Now What?  —  The filing of House financial disclosure reports each year is usually considered a routine affair.  But for Representative George Santos of New York, who is facing 13 felony charges related to his finances … ",
    "url": "https://www.nytimes.com/2023/08/15/nyregion/george-santos-financial-disclosure.html"
  },
  {
    "text": "Texas judge temporarily blocks state from dissolving Harris County elections chief position  —  Republican lawmakers targeted the Harris County elections department during this year's regular session after numerous issues arose out of the 2022 election.",
    "url": "https://www.texastribune.org/2023/08/15/harris-county-elections-changes-ruling/"
  }
]