[
  {
    "text": "Israeli missiles have hit a site in Iran  —  A U.S. official confirmed to ABC News Israeli missiles have hit a site in Iran.  The official could not confirm whether Syria and Iraq sites were hit as well.",
    "url": "https://abcnews.go.com/International/live-updates/israel-gaza-hamas-war/israeli-missiles-have-hit-a-site-in-iran-109405880?id=108860743&cid=social_twitter_abcn"
  },
  {
    "text": "Israel launches missile strikes into Iran in response to Tehran's attack Sunday  —  The Israeli military has conducted missile strikes against Iran, a senior U.S. military official told NPR on Thursday.  There are also reports of explosions in Iraq and Syria.",
    "url": "https://www.npr.org/2024/04/18/1245763498/israel-iran-missile-strikes"
  },
  {
    "text": "Iran fires at apparent Israeli attack drones near Isfahan air base and nuclear site  —  Iran has fired air defenses at a major air base and a nuclear site near its central city of Isfahan after spotting drones.  The commotion early Friday raised fears of a possible Israeli retaliatory strike … ",
    "url": "https://apnews.com/article/iran-israel-mideast-tensions-4-19-2024-a7ccbae2e2844bab089e8e4377a24ddb"
  },
  {
    "text": "Israel strikes Iran with a missile, U.S. officials say, as Tehran downplays Netanyahu's apparent retaliation  —  Two U.S. officials told CBS News on Thursday night that an Israeli missile had struck Iran.  The strike came just less than a week after Iran's unprecedented retaliatory drone … ",
    "url": "https://www.cbsnews.com/news/israel-iran-missile-strikes/"
  },
  {
    "text": "A New Foreign Policy Era Dawns  —  We have a jury.  The 12 men and women who will decide whether Donald Trump illegally falsified business records to cover up payments to porn performer Stormy Daniels—payments which in turn were intended to cover up their alleged affair ahead of the 2016 election … ",
    "url": "https://www.thebulwark.com/p/a-new-foreign-policy-era-dawns"
  },
  {
    "text": "In Unusual Vote, Democrats Rescue Measure to Allow Vote on Ukraine Bill  —  A resolution to pave the way for the foreign aid package was on track to die in committee amid Republican opposition when Democrats stepped in to save it.  —  House Republicans took a critical step late Thursday night toward bringing … ",
    "url": "https://www.nytimes.com/2024/04/18/us/politics/democrats-vote-ukraine-bill.html"
  },
  {
    "text": "Trump campaign says it will deploy thousands of election workers to monitor poll sites  —  The program underscores Trump's fixation with election security, which he deployed in an effort to undermine results of the 2020 election.  —  Former President Donald Trump's political operation … ",
    "url": "https://www.politico.com/news/2024/04/19/trump-campaign-election-monitoring-00153217"
  },
  {
    "text": "Statement from Columbia University President Minouche Shafik  —  To the Columbia University community:  —  This morning, I had to make a decision that I hoped would never be necessary.  I have always said that the safety of our community was my top priority and that we needed to preserve … ",
    "url": "https://president.columbia.edu/news/statement-columbia-university-president-minouche-shafik-4-18"
  },
  {
    "text": "Columbia University is colluding with the far-right in its attack on students  —  In her willingness to unleash state violence against student protestors, Minouche Shafik proved herself to be a willing ally to extremists  —  The students sat on the ground and sang as police in riot gear approached them.",
    "url": "https://www.theguardian.com/commentisfree/2024/apr/19/far-right-columbia-university-student-arrests"
  },
  {
    "text": "Consequences?  Ilhan Omar's Daughter Faces a Few  —  They were warned.  Multiple times.  But these students were so convinced that camping on a campus would remake the world that they stunningly and bravely refused to leave when ordered to by the college.  —  The NYPD showed them the error of their ways.",
    "url": "https://hotair.com/david-strom/2024/04/19/ilhan-omars-daughter-arrested-in-columbia-protest-n3786778"
  },
  {
    "text": "Emergency rooms refused to treat pregnant women, leaving one to miscarry in a lobby restroom  —  One woman miscarried in the restroom lobby of a Texas emergency room as front desk staff refused to admit her.  Another woman learned that her fetus had no heartbeat at a Florida hospital … ",
    "url": "https://apnews.com/article/pregnancy-emergency-care-abortion-supreme-court-roe-9ce6c87c8fc653c840654de1ae5f7a1c"
  },
  {
    "text": "Matt Gaetz attended 2017 party where minor and drugs were present, woman's sworn statement obtained by Congress claims  —  The Ethics panel is questioning witnesses about allegations involving Gaetz.  —  Rep. Matt Gaetz walks past reporters as he leaves a House GOP caucus meeting at the U.S Capitol … ",
    "url": "https://abcnews.go.com/US/matt-gaetz-attended-2017-party-minor-drugs-present/story?id=109324572"
  },
  {
    "text": "R.F.K. Jr.'s Environmental Colleagues Urge Him to Drop Presidential Bid  —  Nearly 50 leaders and activists who worked with Mr. Kennedy at an environmental nonprofit group will run ads calling on him to “Honor our planet, drop out.”  —  As an independent candidate for the White House … ",
    "url": "https://www.nytimes.com/2024/04/19/climate/rfk-jr-environment.html"
  },
  {
    "text": "Trump's covid response was even worse than you remember  —  In a sane country, it would disqualify him from ever again holding office. … As we approach the four-year anniversary of Donald Trump suggesting from the White House podium that bleach injections could be a miracle covid cure … ",
    "url": "https://www.publicnotice.co/p/trump-covid-response-revisited"
  },
  {
    "text": "Louisiana lawmakers vote to remove lunch breaks for child workers, cut unemployment benefits  —  A House committee approved the bill along with others to reduce unemployment benefits and workers' compensation wages.  — 3 min to read  —  A Louisiana House committee voted Thursday to repeal … ",
    "url": "https://www.nola.com/news/politics/legislature/la-lawmakers-vote-to-remove-lunch-breaks-for-child-workers/article_ef234692-fd9e-11ee-99f5-771c7366107a.html"
  },
  {
    "text": "A sheriff, a felon and a conspiracy theorist walk into a hotel.  They're there for the same conference.  —  The Constitutional Sheriffs and Peace Officers Association is urging lawmen to form posses, seize voting machines and investigate baseless claims of voter fraud.",
    "url": "https://www.nbcnews.com/news/us-news/constitutional-sheriffs-las-vegas-conference-rcna147487"
  },
  {
    "text": "'You Can't Govern By Shooting Yourself in the Head Every Day'  —  “You can't govern by shooting yourself in the head every day.”  —  As Speaker of the House Mike Johnson fends off another conservative rebellion over his four-part foreign aid plan, he's garnering support from former speaker … ",
    "url": "https://www.politico.com/news/magazine/2024/04/19/newt-gingrich-mike-johnson-speakership-qa-00153117"
  },
  {
    "text": "Trump's Trial Is Already Wreaking Havoc on His Campaign  —  THE DEFENSE IS RESTLESS  —  The hush money trial was never going to be good for Trump, but the first week in court proved just how disruptive and damaging it will be for his 2024 bid. … TRIAL AND ERROR",
    "url": "https://www.thedailybeast.com/trumps-trial-is-already-wreaking-havoc-on-his-campaign"
  },
  {
    "text": "Here's Something Southern Republican Governors Are Afraid Of  —  Last year, the United Auto Workers announced an ambitious plan to organize workers and unionize foreign-owned auto plants in the South.  —  “One of our biggest goals coming out of this historic contract victory is to organize … ",
    "url": "https://www.nytimes.com/2024/04/19/opinion/uaw-southern-republicans-unions.html"
  },
  {
    "text": "Donald Trump turns the GOP into a protection racket — and demands Republican candidates pay up  —  To “be seen favorably,” the Trump campaign threatens, Republicans must give 5 percent — or more — to the boss  —  For someone who frequently proclaims his innocence, Donald Trump sure loves to act like a two-bit gangster.",
    "url": "https://www.salon.com/2024/04/19/donald-turns-the-into-a-protection-racket--and-demands-candidates-pay-up/"
  },
  {
    "text": "Republicans Are Determined to Keep Credit Card Late Fees High  —  For all their complaining about Americans' financial struggles, Republicans seem keen to brand themselves as the pro-junk fee party  —  FOR ALL THE time Republicans spend complaining about the economic struggles faced by everyday Americans … ",
    "url": "https://www.rollingstone.com/politics/politics-news/republicans-block-credit-card-late-fees-1235006519/"
  },
  {
    "text": "Turning Point Action official resigns after accusation of election-related fraud  —  PHOENIX — A top leader of the national conservative group Turning Point Action, which has amplified false claims of election fraud by former president Donald Trump and others, resigned Thursday after being accused … ",
    "url": "https://www.washingtonpost.com/politics/2024/04/18/austin-smith-turning-point-action-election-fraud/"
  },
  {
    "text": "ICC considering issuing war crimes arrest warrants for Netanyahu, others - report  —  The surprising news could be inexact given ICC's jurisdictional rules  —  The International Criminal Court may be considering issuing international arrest warrants in the relatively near future … ",
    "url": "https://www.jpost.com/international/article-797820"
  },
  {
    "text": "Reince Priebus Was Pushed Out by Trump.  Now He's Raising Money for His Coronation.  —  The former White House chief of staff, with longtime Wisconsin ties, aims to bring in $70 million for the GOP convention in Milwaukee",
    "url": "https://www.wsj.com/politics/policy/reince-priebus-corporate-america-fund-trump-election-a357dcc7"
  }
]