[
  {
    "text": "Trump's youngest son Barron ‘declines’ to be RNC delegate, his mother Melania says  —  Barron Trump is declining to serve as a delegate on behalf of his father at the Republican National Convention, according to his mother's office.  —  The Florida Republican Party announced on Wednesday … ",
    "url": "https://www.bbc.com/news/world-us-canada-68992293"
  },
  {
    "text": "Melania Trump reveals son Barron, 18, has pulled out of being a delegate nominating his father for president because he has ‘prior commitments’  — ‘He regretfully declines to participate due to prior commitments,’ the Office of Melania Trump said to DailyMail.com",
    "url": "https://www.dailymail.co.uk/news/article-13405541/melania-trump-office-son-barron-delegates-president.html"
  },
  {
    "text": "Change of plan: Barron Trump will no longer be a delegate at the Republican convention  —  WASHINGTON - Barron Trump won't be an at-large convention delegate for his father after all.  —  “While Barron is honored to have been chosen as a delegate by the Florida Republican Party … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/05/10/barron-trump-delegate-gop-convention/73646811007/"
  },
  {
    "text": "Scoop: Trump quietly moves Haley off his blacklist … - Trump is scrambling to make up a fundraising disadvantage against President Biden and pay legal fees. … - A reconciliation with Haley, his former UN ambassador, also could help Trump cut attract some of the college-educated Republicans … ",
    "url": "https://www.axios.com/2024/05/11/trump-moves-haley-off-blacklist-2024-election"
  },
  {
    "text": "Giuliani Is Suspended by WABC, and His Radio Show Is Canceled  —  The radio station disciplined Rudolph W. Giuliani after he violated company policy by trying to discuss the legitimacy of the 2020 election on the air.  —  Rudolph W. Giuliani was suspended by WABC radio on Friday … ",
    "url": "https://www.nytimes.com/2024/05/10/nyregion/giuliani-radio-suspended.html"
  },
  {
    "text": "Trump's Sleazy $1 Billion Shakedown of Oil Execs Gives Dems an Opening … Ever since Donald Trump descended that golden escalator in 2015, a central tenet of his bond with his supporters has been a simple promise to them: I have seen elite corruption and self-dealing from the inside, and I will put that know-how to work for you.",
    "url": "https://newrepublic.com/article/181493/trump-big-oil-campaign"
  },
  {
    "text": "Clarence Thomas says critics are pushing ‘nastiness’ and calls Washington a ‘hideous place’  —  The Supreme Court justice said that “reckless” people in Washington, D.C., will “bomb your reputation.”  —  FAIRHOPE, Ala. — Supreme Court Justice Clarence Thomas told attendees … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/justice-clarence-thomas-calls-washington-hideous-place-rcna151782"
  },
  {
    "text": "Biden's isolation grows as Gaza report both criticizes and clears Israel  —  Like much of the president's, at times, halting approach toward the war, the report released to Congress on Friday drew criticism from across the political spectrum.",
    "url": "https://www.washingtonpost.com/politics/2024/05/10/biden-israel-human-rights-report/"
  },
  {
    "text": "Will You Accept the Election Results?  Republicans Dodge the Question.  —  Leading Republicans have refused to say flatly that they will accept the outcome of the presidential election if Donald Trump loses.  —  Less than six months out from the presidential contest, leading Republicans … ",
    "url": "https://www.nytimes.com/2024/05/11/us/politics/republicans-election-denial.html"
  },
  {
    "text": "Narrative of Trump snoozing in court takes hold — much to his annoyance  —  It's unclear if Donald Trump has actually been sleeping, and he vehemently denies it.  But Democrats and late-night hosts have seized on the reports anyway.  —  “Don Snoreleone.”  “Donnie Nappleseed.”  “Sleepy Don.”",
    "url": "https://www.washingtonpost.com/politics/2024/05/11/trump-sleeping-trial-court/"
  },
  {
    "text": "A guilty verdict?  Donald Trump and allies are bracing voters for the worst  —  WASHINGTON - When former president and 2024 candidate Donald Trump claims that the judicial system wants to put him in jail, he's not just protesting the ongoing hush money trial.  —  Trump is also bracing voters for the possibility of a guilty verdict.",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/05/11/trump-guilty-verdict-allies-prep-voters/73630657007/"
  },
  {
    "text": "Blinken sends Congress report on Israeli military's operations in Gaza  —  Secretary of State Antony Blinken delivered to Congress on Friday a highly anticipated report on the Israeli military's operations in Gaza, accusing its forces of potentially violating international humanitarian law … ",
    "url": "https://www.cbsnews.com/news/israeli-forces-in-gaza-u-s-assessment-says/"
  },
  {
    "text": "Kristi Noem's dog killing is pure Southern gothic  —  A literary critic's take on the South Dakota governor's memoir, “No Going Back.”  —  Toward the end of Fred Gipson's 1956 classic, “Old Yeller,” Travis says, “It was going to kill something inside me to do it, but I knew then that I had to shoot my big yeller dog.”",
    "url": "https://www.washingtonpost.com/books/2024/05/10/kristi-noem-dog-book-review/"
  },
  {
    "text": "Trump Campaign Hid Settlements With Women, New Complaint Says  —  UNDERCOVER  —  A former Trump 2016 aide claims to have “information and reason to believe” that the campaign settled with other women for discrimination or harassment. … A sex discrimination lawsuit against Donald Trump's campaign … ",
    "url": "https://www.thedailybeast.com/trump-campaign-hid-settlements-with-women-new-complaint-says"
  },
  {
    "text": "GOP escalates fight with Secret Service over convention protesters  —  Senior GOP representatives have been arguing for weeks with Secret Service officials, but the agency has not budged.  —  Top Republican Party officials are escalating their fight with the Secret Service over the party's convention … ",
    "url": "https://www.washingtonpost.com/politics/2024/05/10/republican-convention-milwaukee-protesters/"
  },
  {
    "text": "Virginia budget leaders reach compromise with governor on state spending plan  —  Virginia budget negotiators and Gov. Glenn Youngkin have reached a compromise on the next two-year state spending plan that would include 3% raises for state employees and teachers while not raising taxes and risking a potential veto by Youngkin.",
    "url": "https://apnews.com/article/budget-lawmakers-glenn-youngkin-virginia-2df36aa8ac4cb0dba0a12e63a483d872"
  },
  {
    "text": "Biden jokes Trump should have injected himself with bleach  —  U.S. President Joe Biden joked on Friday that he wished former President Donald Trump had injected himself with a little bleach, resurrecting one of Trump's more head-scratching moments from the early days of the coronavirus pandemic.",
    "url": "https://www.reuters.com/world/us/biden-jokes-trump-should-have-injected-himself-with-bleach-2024-05-10/"
  },
  {
    "text": "People leaving Rafah describe yet another fearful flight from Israeli assaults.  —  U.N. General Assembly Adopts Resolution Supporting Palestinian Statehood … The U.N. General Assembly adopts a resolution in support of Palestinian statehood.  —  The United Nations General Assembly … ",
    "url": "https://www.nytimes.com/live/2024/05/10/world/israel-gaza-war-hamas-rafah"
  },
  {
    "text": "Justice Kavanaugh touts transparency, consistency to build trust in high court  —  In a wide-ranging conversation at a judicial conference, Justice Brett M. Kavanaugh acknowledged polarization in the country over political and legal issues.  —  AUSTIN — Nearly two years after the Supreme Court eliminated … ",
    "url": "https://www.washingtonpost.com/politics/2024/05/10/kavanaugh-thomas-alito-supreme-court-speeches/"
  }
]