[
  {
    "text": "How Trump and Vance went from a ‘threat to democracy’ to ‘weird’  —  With Harris at the top of the ticket, Democrats shift to a simpler characterization of Trump.  —  In the days since Vice President Kamala Harris has taken over the campaign against former President Donald Trump … ",
    "url": "https://www.politico.com/news/2024/07/26/trump-vance-weird-00171470"
  },
  {
    "text": "Republicans are already souring on JD Vance  —  “I'm a little surprised they didn't vet him as thoroughly as they should have,” said one GOP strategist.  —  JD Vance has had a difficult week, and some Republicans aren't hiding their frustration.  —  Despite momentum after former President … ",
    "url": "https://www.politico.com/news/2024/07/26/republicans-jd-vance-attacks-00171473"
  },
  {
    "text": "The Perfect Storm  —  For Kamala Harris, timing is everything.  —  ∙ Paid  —  On the Secret Pod today, Sarah and I spun through the new polling numbers, looked at Kamala's upside potential, and had some carefully-couched thoughts about JD Vance.  —  You can catch the dolphin show right here.",
    "url": "https://www.thebulwark.com/p/the-perfect-storm"
  },
  {
    "text": "Harris Erases Trump's Lead, WSJ Poll Finds  —  Two candidates are effectively tied after Biden's exit shakes up race  —  The presidential race between Kamala Harris and Donald Trump is essentially tied, according to a new Wall Street Journal poll that shows heightened support … ",
    "url": "https://www.wsj.com/politics/elections/harris-erases-trumps-lead-wsj-poll-finds-e286144d"
  },
  {
    "text": "Donald Trump Gets No Black Votes vs. Kamala Harris in New Michigan Poll  —  received the support of no Black voters in a new Michigan survey.  —  The WDIV/Detroit News poll found that the presidential race is a dead heat between Trump, the  —  nominee, and Vice President  —  , the",
    "url": "https://www.newsweek.com/donald-trump-no-black-voters-michigan-poll-kamala-harris-1930542"
  },
  {
    "text": "Panicking Trump Loses It Over FBI Director's Bullet Injury Testimony … Donald Trump is seriously pissed that FBI Director Christopher Wray is asking questions about what really happened during the attempted assassination of the former president.  —  While appearing before the House Judiciary … ",
    "url": "https://newrepublic.com/post/184292/panicking-trump-fbi-director-bullet-injury-testimony"
  },
  {
    "text": "Donald Trump Seen Without Bandage For First Time Since Shooting, Seemingly Uninjured  —  DONALD TRUMP FORMER PREZ ALL EARS, NO BANDAGE ... Seemingly No Injury  —  Donald Trump's healing well after the attempt on his life, 'cause he's not wearing the bandage on his ear anymore — and … ",
    "url": "https://www.tmz.com/2024/07/26/donald-trump-seen-no-bandage-first-time-since-shooting-injury/"
  },
  {
    "text": "Trump Cryptically Declares, 'You Won't Have to Vote Anymore' If He Wins Second Term  —  Former President Donald Trump urged members of a crowd in Florida to vote and said that if he wins, they “won't have to vote anymore.”  —  Speaking at a Turning Point Action event in West Palm Beach on Friday … ",
    "url": "https://www.mediaite.com/trump/trump-cryptically-declares-you-wont-have-to-vote-anymore-if-he-wins-second-term/"
  },
  {
    "text": "Former FBI agent Peter Strzok reaches $1.2 million settlement with DOJ: Lawyers  —  He argued the Justice Department improperly released his text messages.  —  Deputy Assistant FBI Director Peter Strzok testifies before a joint committee hearing of the House Judiciary and Oversight … ",
    "url": "https://abcnews.go.com/Politics/former-fbi-agent-peter-strzok-reaches-12-million/story?id=112318094"
  },
  {
    "text": "Justice Department reaches $2M in settlements with FBI officials whose texts infuriated Trump  —  Other portions of Peter Strzok's lawsuit over his firing will continue as former FBI attorney Lisa Page's case is resolved.  —  The Justice Department has agreed to pay a total of $2 million … ",
    "url": "https://www.politico.com/news/2024/07/26/peter-strzok-lawsuit-settlement-00171498"
  },
  {
    "text": "Harris calls Sonya Massey's family  —  Massey was a 36-year-old Black woman who was shot by a sheriff's deputy in her Illinois home on July 6.  —  On Friday, Vice President Kamala Harris called the family of Sonya Massey, a 36-year-old Black woman who was fatally shot by a sheriff's deputy … ",
    "url": "https://www.nbcnews.com/politics/2024-election/kamala-harris-calls-sonya-massey-family-rcna163881"
  },
  {
    "text": "Trump greets Netanyahu at Mar-a-Lago, says World War III could happen if Harris wins  —  Netanyahu also shared a photograph of an Israeli toddler held captive by Hamas with Trump  —  Former President Trump claimed on Friday that conflicts in the Middle East could escalate into a third World War if he loses the 2024 election.",
    "url": "https://www.foxnews.com/politics/trump-greets-netanyahu-mar-a-lago-says-world-war-iii-could-happen-harris-wins"
  },
  {
    "text": "Spaceman, Senator, V.P. Pick?  Kamala Harris Sizes Up Mark Kelly. … In his short political career, Mark Kelly has won two elections to the Senate in Arizona.  Valerie Plesch for The New York Times  —  The rugged border lands around Douglas, Ariz., dip through precipitous canyons … ",
    "url": "https://www.nytimes.com/2024/07/26/us/politics/mark-kelly-kamala-harris-vp.html"
  },
  {
    "text": "A look at the 28 chaotic days between Biden's disastrous debate and his dropout  —  A complete timeline of events, from President Joe Biden's debate performance to his Oval Office address.  —  When America witnessed a pale, hoarse and feeble Joe Biden take the debate stage on June 27 … ",
    "url": "https://www.politico.com/news/2024/07/26/biden-campaign-dropout-30-days-timeline-00170935"
  },
  {
    "text": "Kamala Harris Has Brought the Joy  —  Why Republicans are so freaked out about a woman who laughs.  —  “I call her laughing Kamala,” Donald Trump recently said about his new opponent.  “You ever watch her laugh?  She's crazy.  You know, you can tell a lot by a laugh — she's crazy, she's nuts.”",
    "url": "https://paulwaldman.substack.com/p/kamala-harris-has-brought-the-joy"
  },
  {
    "text": "Fintech bullies stole your kid's lunch money (permalink)  —  Three companies control the market for school lunch payments.  They take as much as 60 cents out of every dollar poor kids' parents put into the system to the tune of $100m/year.  They're literally stealing poor kids' lunch money.",
    "url": "https://pluralistic.net/2024/07/26/taanstafl/#stay-hungry"
  },
  {
    "text": "Federal courts spike piece of DeSantis ‘Stop Woke’ law  —  A separate challenge surrounding how the anti-woke policies apply to colleges and universities is still under appeal.  —  TALLAHASSEE, Florida — A federal judge permanently shut down a significant piece of Florida's so-called Stop Woke Act … ",
    "url": "https://www.politico.com/news/2024/07/26/federal-courts-florida-stop-woke-law-00171451"
  },
  {
    "text": "JD Vance called for ‘federal response’ to block women from traveling for abortions  —  VP nominee pushed baseless warning in 2022 that George Soros would pack planes of Black women to get abortions  —  JD Vance, Ohio senator and Donald Trump's running mate, promoted a baseless rightwing talking point … ",
    "url": "https://www.theguardian.com/us-news/article/2024/jul/26/jd-vance-abortion-ban-travel"
  },
  {
    "text": "Trump ally who denies 2020 election results threatens law enforcement  —  Patrick Byrne, former CEO of Overstock, said officials would face ‘a piano wire and a blowtorch’ if a case against a former Colorado elections official continues.  —  Patrick Byrne, who has funded efforts to undermine … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/26/patrick-byrne-tina-peters-threats/"
  }
]