[
  {
    "text": "Trump's golf outings have long concerned Secret Service  —  Sunday's episode in West Palm Beach made gravely apparent the security challenges at the former president's private golf courses.  —  Soon after Donald Trump became president, authorities tried to warn him about the risks posed … ",
    "url": "https://www.washingtonpost.com/politics/2024/09/16/trump-golf-courses-secret-service-protection/"
  },
  {
    "text": "Trump blames Biden-Harris ‘rhetoric’ for latest assassination attempt, says he will ‘save the country’  —  Democrats have previously blamed Trump for raising the temperature and being a ‘threat to democracy’  —  EXCLUSIVE: Former President Trump said President Biden and Vice President Harris' … ",
    "url": "https://www.foxnews.com/politics/trump-blames-biden-harris-rhetoric-latest-assassination-attempt-says-he-save-country?intcmp=tw_pols"
  },
  {
    "text": "'The most complex, dynamic and dangerous threat environment I've experienced'  —  The second apparent assassination attempt of Donald Trump is the latest peril in a race that has been defined by anger and threats.  —  The toxic political climate and a complex web of threats … ",
    "url": "https://www.politico.com/news/2024/09/16/secret-service-threats-assassination-attempts-00179398"
  },
  {
    "text": "US Secret Service says it is aware of Musk post about Biden, Harris  —  The U.S. Secret Service said on Monday it was aware of a post by billionaire Elon Musk on the X social media platform musing about an absence of assassination attempts on President Joe Biden and Vice President Kamala Harris.",
    "url": "https://www.reuters.com/world/us/us-secret-service-says-it-is-aware-musk-post-about-biden-harris-2024-09-16/"
  },
  {
    "text": "Trump and Vance Are Harming the People They Claim to Care About  —  Springfield, Ohio, is just the sort of beleaguered heartland manufacturing town that Donald Trump and J. D. Vance say the MAGA movement wants to help.  Instead, the Republican ticket has chosen to make life miserable … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/09/trump-vance-springfield-ohio/679894/"
  },
  {
    "text": "House Dems' ‘sleeper’ seats suddenly in sight  —  With assists from POLITICO's Congress team  —  MIDWEST MOMENTUM ... OR MIRAGE?  —  The Kamala Harris effect has House Democrats thinking they can gain seats in a place they've been losing for years: the Midwest.",
    "url": "https://www.politico.com/newsletters/inside-congress/2024/09/16/house-dems-sleeper-seats-suddenly-in-sight-00179407"
  },
  {
    "text": "Omnipresent AI cameras will ensure good behavior, says Larry Ellison  —  “We're going to have supervision,” says billionaire Oracle co-founder Ellison.  —  On Thursday, Oracle co-founder Larry Ellison shared his vision for an AI-powered surveillance future during a company financial meeting, reports Business Insider.",
    "url": "https://arstechnica.com/information-technology/2024/09/omnipresent-ai-cameras-will-ensure-good-behavior-says-larry-ellison/"
  },
  {
    "text": "Vote for Kamala Harris to Support Science, Health and the Environment  —  Kamala Harris has plans to improve health, boost the economy and mitigate climate change.  Donald Trump has threats and a dangerous record  —  In the November election, the U.S. faces two futures.",
    "url": "https://www.scientificamerican.com/article/vote-for-kamala-harris-to-support-science-health-and-the-environment/"
  },
  {
    "text": "Portage County sheriff: ‘Write down the addresses’ of Kamala Harris supporters who display yard signs  —  Sheriff Bruce D. Zuchowski, who took office in 2021, made the remarks in Facebook posts shared to two separate accounts on the night of Sept. 13.  —  PORTAGE COUNTY, Ohio … ",
    "url": "https://www.wkyc.com/article/news/local/portage-county/portage-county-sheriff-write-down-addresses-of-kamala-harris-supporters-who-display-yard-signs/95-3d5f701d-01c2-4207-9c42-67d8aa0f01a4"
  },
  {
    "text": "Harris leads Trump in Pennsylvania — and two bellwether PA counties — exclusive poll finds  —  Joey Garrison Michael CollinsUSA TODAY  —  WASHINGTON - Democratic presidential nominee Kamala Harris narrowly leads former President Donald Trump in the critical battleground state of Pennsylvania … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/09/16/harris-trump-pennsylvania-poll/75236006007/"
  },
  {
    "text": "Mark Meadows's Arizona charges to stay in state court, federal judge rules  —  The ruling is a setback for the former Trump White House chief of staff, who unsuccessfully tried the same legal maneuver in a separate case in Georgia.  —  A judge has denied a request from Mark Meadows … ",
    "url": "https://www.washingtonpost.com/national-security/2024/09/16/mark-meadows-arizona-federal-court/"
  },
  {
    "text": "He's Jumped the Shark  —  A television analogy helps explain what's happening in Trumpland and how the ex-president has lost the narrative.  —  Toward the end of the fifth year of the popular TV series Happy Days, the writers had The Fonz put on water skis and jump over a live shark.",
    "url": "https://statuskuo.substack.com/p/hes-jumped-the-shark"
  },
  {
    "text": "Mark Robinson Waves Hand By Groin, Says Young Women Must ‘Get This Under Control’  —  In a newly resurfaced video from 2022, the North Carolina GOP gubernatorial nominee also criticizes “all this giving out of birth control.”  —  LOADING  —  WASHINGTON ― In a newly unearthed video from 2022 … ",
    "url": "https://www.huffpost.com/entry/mark-robinson-young-women-sex-birth-control_n_66e87182e4b06998fbec7ceb"
  },
  {
    "text": "Meta bans RT, days after U.S. accuses Russian outlet of disinformation  —  U.S. officials on Friday accused RT of carrying out covert information warfare operations around the world as an arm of Russia's spy agencies.  —  Social media giant Meta on Monday announced that it is banning Russian … ",
    "url": "https://www.nbcnews.com/news/us-news/meta-bans-rt-russian-disinformation-rcna171402"
  },
  {
    "text": "Heritage Foundation Admits KOSA Will Be Useful For Removing Pro-Abortion Content... If Trump Wins  —  It's no secret that Trump-administration-in-waiting at the Heritage Foundation supports KOSA because it thinks it will be useful in achieving some of the most extreme goals of Project 2025, a project Heritage created.",
    "url": "https://www.techdirt.com/2024/09/16/heritage-foundation-admits-kosa-will-be-useful-for-removing-pro-abortion-content-if-trump-wins/"
  },
  {
    "text": "Gen Z women are the future Republicans were so worried about  —  Since 2016, the views of young women have shifted sharply to the left.  —  Tucked into a fascinating article about partisanship and names in America, The Washington Post's Andrew Van Dam and Lenny Bronner included a chart … ",
    "url": "https://www.washingtonpost.com/politics/2024/09/16/gen-z-women-are-future-republicans-were-so-worried-about/"
  },
  {
    "text": "Giuliani Takes Another L in Court as Judge Tosses His Suit Against Biden  —  CAN'T CATCH A BREAK  —  Last October, Giuliani sued Biden for saying during a 2020 presidential debate that Giuliani was a “Russian pawn.”  —  Cash-strapped former Donald Trump adviser Rudy Giuliani's defamation lawsuit … ",
    "url": "https://www.thedailybeast.com/giuliani-takes-another-l-in-court-as-judge-tosses-his-suit-against-biden"
  },
  {
    "text": "It Sure Looks Like This GOP Senate Hopeful Doctored One Of His Campaign Ads  —  In a recent TV spot, the logo of a controversial think tank is mysteriously missing from Tim Sheehy's shirt.  —  The campaign of Montana GOP Senate candidate Tim Sheehy appears to have doctored a recent TV advertisement … ",
    "url": "https://www.huffpost.com/entry/tim-sheehy-perc-tv-ad_n_66e87bbfe4b0b7fef832280f"
  }
]