[
  {
    "text": "The totalitarian tell in Trump's “unity” speech  —  Kim Jung Un and Victor Orban are role models for a type of unity, but not the type you would enjoy  —  By now you have no doubt heard that Donald Trump (a man who, I should note, has spent years urging his supporters to commit violent acts … ",
    "url": "https://www.findinggravity.net/p/the-totalitarian-tell-in-trumps-unity"
  },
  {
    "text": "Why Did Trump Give a Bad Speech?  —  Why Did Trump Give a Bad Speech?  —  There may be more to the former president's turn at the RNC than meets the eye.  —  Donald Trump filibustered his own nomination Thursday night—and Friday morning, too: His 90-minute acceptance remarks didn't finish until well after midnight Eastern time.",
    "url": "https://www.theamericanconservative.com/why-did-trump-give-a-bad-speech/"
  },
  {
    "text": "Was That the Worst Convention Speech of All Time?  —  I hope that you were not, like me, required to watch Donald Trump's speech at the Republican National Convention on Thursday night (and into Friday morning), and were instead doing something more enjoyable: Going out with friends … ",
    "url": "https://jill.substack.com/p/was-that-the-worst-convention-speech"
  },
  {
    "text": "Secluded in Rehoboth, Biden Stews at Allies' Pressure to Drop Out of the Race  —  As he recovers from Covid, the president has grown resentful toward Democratic congressional leaders and former President Barack Obama.  —  Sick with Covid and abandoned by allies, President Biden has been fuming … ",
    "url": "https://www.nytimes.com/2024/07/19/us/politics/biden-drop-out-2024-election.html"
  },
  {
    "text": "Ohio Sen. Sherrod Brown calls for Biden to drop out of the 2024 race  —  Brown has a competitive race in November, and his defection — the fourth by a Democratic senator — is a significant one.  —  Sen. Sherrod Brown of Ohio called on President Joe Biden to end his re-election campaign Friday … ",
    "url": "https://www.nbcnews.com/politics/2024-election/ohio-sen-sherrod-brown-calls-biden-drop-2024-race-rcna162804"
  },
  {
    "text": "Sherrod Brown joins senators calling on Biden to step aside … - “These are the issues Ohioans care about and it is my job to keep fighting for them,” he said, adding, “I agree with the many Ohioans who have reached out to me.”  — “At this critical time, our full attention must return to these important issues.",
    "url": "https://www.axios.com/2024/07/19/sherrod-brown-joins-senators-calling-on-biden-to-step-aside"
  },
  {
    "text": "Alexandria Ocasio-Cortez warns anti-Biden Democrats about what comes next if they succeed  —  The progressive New Yorker spoke on Instagram about the potential risks of pressuring President Joe Biden to end his campaign.  —  Rep. Alexandria Ocasio-Cortez, D-N.Y., has issued a dire warning … ",
    "url": "https://www.msnbc.com/the-reidout/reidout-blog/aoc-biden-nomination-alexandria-ocasio-cortez-rcna162761"
  },
  {
    "text": "AOC Issues Dire Warning on Threats to Come if Biden Drops Out  —  On Instagram Live early Friday morning, Representative Alexandria Ocasio-Cortez discussed the ongoing debate over whether President Biden is fit to run for reelection.  —  Speaking for close to an hour, the New York progressive explained … ",
    "url": "https://newrepublic.com/post/184042/aoc-alexandria-ocasio-cortez-warning-biden-drop-out-instagram-live"
  },
  {
    "text": "Pelosi voiced support for an open nomination process if Biden drops out  —  Some California House Democrats don't want the process to replace the president on the ticket to seem like a Kamala Harris coronation.  —  In a meeting with fellow California Democrats last week … ",
    "url": "https://www.politico.com/news/2024/07/19/pelosi-support-open-nomination-biden-drop-out-00169893"
  },
  {
    "text": "Harris Struggles to Reassure Major Democratic Donors  —  On a call, Vice President Kamala Harris told about 300 donors that there was little to worry about.  Several listeners said they found the call to have little value.  —  Vice President Kamala Harris tried to buck … ",
    "url": "https://www.nytimes.com/2024/07/19/us/politics/kamala-harris-donors.html"
  },
  {
    "text": "Sheila Jackson Lee, long-serving Democratic congresswoman and advocate for Black Americans, dies at 74  —  Sheila Jackson Lee, a longtime Democratic congresswoman from Texas who was an outspoken advocate for Black Americans for decades, has died.  She was 74.",
    "url": "https://www.cnn.com/2024/07/19/politics/sheila-jackson-lee-texas-dies/"
  },
  {
    "text": "Rep. Sheila Jackson Lee dies after battle with cancer  —  The Texas Democrat announced in June that she had been diagnosed with pancreatic cancer and was undergoing treatment.  —  Rep. Sheila Jackson Lee, D-Texas, has died at the age of 74 after a battle with cancer, her family announced on Friday.",
    "url": "https://www.nbcnews.com/politics/congress/rep-sheila-jackson-lee-dies-battle-cancer-rcna162819"
  },
  {
    "text": "Florida OKs Misleading Statement To Print Next To Pro-Choice Ballot Measure  —  The supposedly nonpartisan committee that drafted it included an economist from the ultra-conservative Heritage Foundation, the group behind Project 2025.  —  LOADING  —  The advocates behind Florida's pro … ",
    "url": "https://www.huffpost.com/entry/florida-republicans-ok-misleading-statement-to-print-next-to-pro-choice-ballot-measure_n_669ad3d2e4b07f2755f4799a"
  },
  {
    "text": "Trump shooter flew drone over venue hours before attempted assassination, source says  —  The gunman was killed after he shot former President Donald Trump in the ear in an assassination attempt.  A motive remains unknown.  —  The gunman who shot former President Donald Trump in the ear … ",
    "url": "https://www.nbcnews.com/news/us-news/trump-shooter-flew-drone-venue-hours-attempted-assassination-source-sa-rcna162817"
  },
  {
    "text": "Confronting the hate, Phil Williams tells neo-Nazis: ‘When I look at you guys, I do not think master race.’  —  NASHVILLE, Tenn. (WTVF) — This is my town.  —  Nashville belongs to us — not the out-of-state neo-Nazis who have created havoc this week on our streets with their symbols of hate and vile words.",
    "url": "https://www.newschannel5.com/news/newschannel-5-investigates/franklin-politics/confronting-the-hate-phil-williams-tells-neo-nazis-when-i-look-at-you-guys-i-do-not-think-master-race"
  }
]