[
  {
    "text": "‘FRIENDS’ STAR MATTHEW PERRY DEAD AT 54 ... After Apparent Drowning  —  EXCLUSIVE  —  842.3K … UPDATE  —  6:02 PM PT — More details are surfacing about the circumstances surrounding Matthew Perry's death ... as sources tell us he actually died at his own house after some physical activity this morning.",
    "url": "https://www.tmz.com/2023/10/28/friends-star-matthew-perry-dead-dies-drowning/"
  },
  {
    "text": "After Fury, Netanyahu Deletes, Apologizes for Post Blaming Security Chiefs for Hamas Attack  —  In a post overnight Saturday, Netanyahu asserted that he never received forewarning about Hamas' deadly attack.  He earlier said ‘After the war everyone will have to answer to hard questions...Right now, my task is to save the country’",
    "url": "https://www.haaretz.com/israel-news/2023-10-29/ty-article/after-drawing-fury-netanyahu-deletes-tweet-blaming-security-chiefs-for-hamas-attack/0000018b-7a77-d4a8-a3cf-feff35d20000"
  },
  {
    "text": "A spiderweb of Hamas tunnels in Gaza Strip raises risks for an Israeli ground offensive  —  As an Israeli ground offensive in the Gaza Strip looms in its most devastating war yet with Hamas, one of the greatest threats to both its troops and the 2.3 million Palestinians trapped inside the seaside enclave is buried deep underground.",
    "url": "https://apnews.com/article/israel-palestinians-hamas-tunnels-warfare-15453b5729e38aeb55af5b419835a5eb"
  },
  {
    "text": "Israel-Hamas War  —  Netanyahu Says Israeli Troops Have Pushed Into Gaza  —  Prime Minister Benjamin Netanyahu of Israel called the incursion “the second stage of the war.”  He did not describe it as an invasion, and the maneuver appeared more limited than some experts had predicted.",
    "url": "https://www.nytimes.com/live/2023/10/28/world/israel-gaza-news-hamas-war"
  },
  {
    "text": "National security adviser defends Israel's efforts to defeat Hamas  —  “We have taken the position that Israel has a right to defend itself against terrorist attacks,” Sullivan said.  —  U.S. national security adviser Jake Sullivan defended Israel's campaign against Hamas on Sunday … ",
    "url": "https://www.politico.com/news/2023/10/29/national-security-advisor-defends-israel-hamas-00124113"
  },
  {
    "text": "Palestinian death toll has risen past 8,000, Gaza's Health Ministry says  —  Thousands of people broke into aid warehouses in Gaza to take flour and basic hygiene products, a U.N. agency said Sunday, in a mark of growing desperation and the breakdown of public order three weeks … ",
    "url": "https://apnews.com/article/israel-hamas-war-news-10-29-2023-de1a7d660ba2f6d80b3d7aeaae5bb0f3"
  },
  {
    "text": "The Devil's Bargain Mike Pence Could Not Escape  —  The former vice president tied himself to Donald Trump in the 2016 campaign and it may have cost him a political future.  —  The decision by Mike Pence to end his presidential campaign on Saturday was a bow to what had finally become inevitable.",
    "url": "https://www.nytimes.com/2023/10/29/us/politics/pence-trump-2024.html"
  },
  {
    "text": "Halloween weekend shootings leave at least 3 dead, over 40 injured after multiple mass shootings  —  Mass shootings in Indianapolis, Tampa and Chicago are being investigated by authorities.  —  At least 3 people are dead and over 40 have been injured after multiple mass shootings across … ",
    "url": "https://www.nbcnews.com/news/us-news/halloween-weekend-shootings-leave-least-3-dead-40-injured-multiple-mas-rcna122661"
  },
  {
    "text": "Andy Kim is making a big bet on breaking New Jersey Democratic politics  —  The mild-mannered congressmember has early momentum that will test the party's established power structure.  —  Andy Kim is trying to do something rare in New Jersey politics: win by casting himself as a soft-spoken outsider.",
    "url": "https://www.politico.com/news/2023/10/29/andy-kim-vs-the-jersey-machine-00124091"
  },
  {
    "text": "Jenna Ellis Could Become a Star Witness Against Trump  —  When Jenna Ellis last week became the most recent lawyer to join in an accelerating series of guilty pleas in the Fulton County, Ga., prosecution of Donald Trump and his co-conspirators, she offered a powerful repudiation of the … ",
    "url": "https://www.nytimes.com/2023/10/29/opinion/jenna-ellis-georgia-trump.html"
  },
  {
    "text": "Hutchinson's campaign manager to depart after disagreement over viable path to nomination  —  Asa Hutchinson's presidential campaign manager is leaving the campaign next week due to differences over direction and whether the former Arkansas governor still has a path to the 2024 Republican nomination, according to two sources.",
    "url": "https://www.cnn.com/2023/10/27/politics/hutchinson-campaign-manager-depart-campaign/"
  },
  {
    "text": "Mike Johnson Conducted Seminars Promoting the US as a “Christian Nation”  —  The new House speaker called for “Biblically-sanctioned government.”  —  Rep. Mike Johnson, the newly elected Republican House speaker, used to conduct a seminar in churches premised on the idea that the United States is a “Christian nation.”",
    "url": "https://www.motherjones.com/politics/2023/10/mike-johnson-seminars-christian-nation-speaker-far-right/"
  },
  {
    "text": "How Mike Johnson went from little-known to House speaker in 24 hours  —  Just hours after securing the Republican nomination for House speaker, Majority Whip Tom Emmer (R-Minn.) walked into a conference meeting Tuesday evening and bluntly informed his colleagues that he knew how to count votes … ",
    "url": "https://www.washingtonpost.com/politics/2023/10/28/how-mike-johnson-went-little-known-house-speaker-24-hours/"
  },
  {
    "text": "The deep inequity of the anti-college movement  —  I immigrated from Mexicali, Mexico, when I was 10 years old, the child of farm laborers.  I was still learning English when my high school teachers advised me to forgo any college dreams.  —  But there in the Imperial Valley of southeast California … ",
    "url": "https://thehill.com/opinion/congress-blog/4281108-the-deep-inequity-of-the-anti-college-movement/"
  },
  {
    "text": "Ramaswamy addresses Israel policy criticism at Jewish forum in Las Vegas  —  Since the Oct. 7 Hamas attack in Israel, Ramaswamy has increasingly generated controversy over his remarks about the U.S.'s role in the conflict.  —  Vivek Ramaswamy on Saturday addressed criticism of his Israel stance … ",
    "url": "https://www.politico.com/news/2023/10/28/vivek-ramaswamy-israel-policy-00124095"
  }
]