[
  {
    "text": "Trump says he was shot at rally in assassination attempt; spectator killed and shooter dead  —  A Trump spokesperson said the former president was “fine.”  —  Republican presidential candidate former President Donald Trump is surrounded by U.S. Secret Service agents at a campaign rally, Saturday, July 13, 2024, in Butler, Pa.",
    "url": "https://abcnews.go.com/Politics/trump-rushed-off-stage-disturbance-pennsylvania-rally/story?id=111913361"
  },
  {
    "text": "Trump rally shooting live updates: Shooter was a 20-year-old man from Pennsylvania, officials say  —  Donald Trump's campaign said in a statement that he was “fine” after being whisked off the stage at a rally in Butler, Pennsylvania after apparent gunshots rang through the crowd.",
    "url": "https://apnews.com/live/election-biden-trump-campaign-updates-07-13-2024"
  },
  {
    "text": "Trump ‘felt the bullet ripping through the skin’ during apparent assassination attempt  —  The former president was injured during a shooting at a rally in western Pennsylvania that killed one and injured two others.  —  Former President Donald Trump survived an apparent assassination attempt … ",
    "url": "https://www.politico.com/news/2024/07/13/trump-rushed-off-stage-at-pennsylvania-rally-after-possible-gunfire-00167977"
  },
  {
    "text": "Live updates: Shooter who opened fire at Trump rally dead; Trump injured and spectator killed  —  One spectator from the campaign rally in Pennsylvania is dead, and two are critically injured, the Secret Service said. … Federal investigators have tentatively identified Trump shooter  —  Kelly O'Donnell",
    "url": "https://www.nbcnews.com/politics/2024-election/live-blog/trump-biden-rnc-election-live-updates-rcna161404#rcrd45869"
  },
  {
    "text": "Trump is SHOT in the side of the head and left with blood strewn across his face in horrifying assassination attempt  —  Donald Trump was left bleeding from his ear after being shot on stage at a rally in a horrific attack by a would-be assassin.  —  A barrage of rifle rounds rained … ",
    "url": "https://www.dailymail.co.uk/news/article-13631849/Donald-Trump-shots-fired-Pennsylvania.html"
  },
  {
    "text": "‘He just won the election’: Hill Republicans predict Trump rally shooting will ease path to White House  —  The shooting is sending shockwaves into an already tumultuous election.  —  Congressional Republicans already believed Donald Trump was headed back to the White House.",
    "url": "https://www.politico.com/news/2024/07/13/hill-republicans-trump-rally-shooting-00167995"
  },
  {
    "text": "House launches “full investigation” into Trump rally shooting … - “US Secret Service quickly responded with protective measures and the former president is safe and being evaluated,” the agency said in a statement shortly after the shooting. … - “I have already contacted the Secret Service … ",
    "url": "https://www.axios.com/2024/07/14/trump-rally-shooting-oversight-comer-secret-service"
  },
  {
    "text": "Secret Service Rushed Donald Trump Offstage at His Pennsylvania Rally  —  The former president said he was shot and Secret Service said at least one attendee was killed at an event in Pennsylvania.  — Copy  —  Former President Donald Trump was wounded in a shooting at his campaign rally on Saturday night.",
    "url": "https://www.notus.org/trump-2024/donald-trump-pennsylvania-rally-secret-service"
  },
  {
    "text": "Biden, Democrats, Republicans denounce shooting at Trump rally  —  Politicians said “political violence” has no place in U.S. politics after at least one person was fatally shot at Donald Trump's rally in Butler, Pa. The shooter was also killed, authorities said.",
    "url": "https://www.washingtonpost.com/politics/2024/07/13/trump-rally-shooting-reactions/"
  },
  {
    "text": "Statement from President Joe Biden  —  I have been briefed on the shooting at Donald Trump's rally in Pennsylvania.  —  I'm grateful to hear that he's safe and doing well.  I'm praying for him and his family and for all those who were at the rally, as we await further information.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/07/13/statement-from-president-joe-biden-6/"
  },
  {
    "text": "Biden spoke with Trump: White House official  —  President Biden spoke with Trump, a White House official told ABC News.  —  Biden also spoke with Pennsylvania Gov. Josh Shapiro and Butler Mayor Bob Dandoy, the official said.  —ABC News' Mary Bruce  —  Male shooter was killed by Secret Service counter-sniper: Source",
    "url": "https://abcnews.go.com/Politics/live-updates/donald-trump-rally-shooting-assassination-attempt/?id=111916828&entryId=111920910&cid=social_twitter_tw"
  },
  {
    "text": "Here's What Is Known About the Suspected Gunman  —  Authorities identified the gunman as a 20-year-old man from Bethel Park, a town about an hour's drive from the site of the shooting.  —  The gunman who attempted to assassinate former President Donald J. Trump at a rally in Pennsylvania … ",
    "url": "https://www.nytimes.com/2024/07/14/us/politics/trump-gunman-thomas-crooks.html"
  },
  {
    "text": "Elon Musk Endorses Trump, Moments After Shooting at His Rally  —  Mr. Musk has drifted rightward considerably during the Biden era.  —  The tech billionaire Elon Musk endorsed former President Donald J. Trump's presidential campaign mere minutes after Mr. Trump was rushed from the stage at his rally in Pennsylvania.",
    "url": "https://www.nytimes.com/2024/07/13/us/politics/elon-musk-trump-endorsement.html"
  },
  {
    "text": "Joe Biden for President  —  I will do all that I can to see that President Biden is re-elected.  Why?  Despite my disagreements with him on particular issues, he has been the most effective president in the modern history of our country and is the strongest candidate to defeat Donald Trump — a demagogue and pathological liar.",
    "url": "https://www.nytimes.com/2024/07/13/opinion/joe-biden-president.html"
  },
  {
    "text": "Nikki Haley invited to speak at the Republican convention  —  As of Tuesday, an aide to the former Republican presidential candidate told NBC News that she had not yet received an invitation.  —  MILWAUKEE, Wis. — Former South Carolina Gov. Nikki Haley has been invited to speak … ",
    "url": "https://www.nbcnews.com/politics/2024-election/nikki-haley-invited-speak-republican-convention-rcna161730"
  }
]