[
  {
    "text": "My plan to reform the Supreme Court and ensure no president is above the law  —  We can and must prevent the abuse of presidential power and restore the public's faith in our judicial system.  —  The writer is president of the United States.  —  This nation was founded on a simple yet profound principle: No one is above the law.",
    "url": "https://www.washingtonpost.com/opinions/2024/07/29/joe-biden-reform-supreme-court-presidential-immunity-plan-announcement/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzIyMjI1NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzIzNjA3OTk5LCJpYXQiOjE3MjIyMjU2MDAsImp0aSI6IjI5ODkwY2VjLTYwZTItNDZmZi1hOWZkLWQwOTJjZmI5MGNjMSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9vcGluaW9ucy8yMDI0LzA3LzI5L2pvZS1iaWRlbi1yZWZvcm0tc3VwcmVtZS1jb3VydC1wcmVzaWRlbnRpYWwtaW1tdW5pdHktcGxhbi1hbm5vdW5jZW1lbnQvIn0.ZjQ4R9u8pwlIKd0l230VD0f20mb0V140Kw3gTFopyfM&itid=gfta"
  },
  {
    "text": "FACT SHEET: President Biden Announces Bold Plan to Reform the Supreme Court and Ensure No President Is Above the Law  —  From his first day in office—and every day since then—President Biden has taken action to strengthen American democracy and protect the rule of law.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/07/29/fact-sheet-president-biden-announces-bold-plan-to-reform-the-supreme-court-and-ensure-no-president-is-above-the-law/"
  },
  {
    "text": "Trump Just Had His Worst Week—Ever  —  IT MUST BE HARD TO TRANSITION from martyr anointed by God and positioned to win in a blowout to jealous old whiner grumbling about the misunderstood relevance of Hannibal Lecter.  —  Life came at Donald Trump fast when Sleepy Joe Biden took his name off … ",
    "url": "https://www.thebulwark.com/p/trump-just-had-his-worst-week-ever-vance-harris"
  },
  {
    "text": "Why, as a Republican mayor, I support Kamala Harris over Trump  —  Arizona Republicans like me can emulate Sen. John McCain's motto of ‘Country First’ and beat back Trump and his threat to democracy.  —  The time has come for my fellow Arizona Republicans to return to the core foundations of the Grand Old Party.",
    "url": "https://www.azcentral.com/story/opinion/op-ed/2024/07/29/mesa-mayor-republican-vote-kamala-harris/74583703007/"
  },
  {
    "text": "Harris is endorsed by border mayors in swing-state Arizona as she faces GOP criticism on immigration  —  Vice President Kamala Harris highlighted endorsements from mayors of border towns in swing-state Arizona Monday as she looks to blunt the impact of Republican criticism of her handling of illegal border crossings.",
    "url": "https://apnews.com/article/kamala-harris-border-endorsements-arizona-efee13f3415d42d952363ad364258af7"
  },
  {
    "text": "Elon Musk Drew Winces From Billionaires' Gathering With Trump Pitch  —  PALM BEACH CONFAB  —  Some people in the crowd of rich donors reportedly winced and shook their heads after the world's richest man told them they should tell their friends to vote for Donald Trump.",
    "url": "https://www.thedailybeast.com/elon-musk-told-private-gathering-of-billionaire-pals-why-hes-voting-trump"
  },
  {
    "text": "Fellow billionaires ‘visibly winced’ as Elon Musk went on conspiracy theory rant: report  —  In a recent private meeting with fellow billionaires, tech tycoon Elon Musk appeared to endorse the far-right Great Replacement Theory as an explanation for why he is backing former President Donald Trump, reported The Daily Beast on Monday.",
    "url": "https://www.rawstory.com/elon-musk-conspiracy-theorist/"
  },
  {
    "text": "The media fails to take Trump at his word.  Again.  —  There was a whole (faintly ridiculous) debate in media and politics circles during the 2016 campaign about whether to take Donald Trump “literally or seriously.”  —  Let's not reprise it here except to quote poet Maya Angelou … ",
    "url": "https://margaretsullivan.substack.com/p/the-media-fails-to-take-trump-at"
  },
  {
    "text": "“My Beautiful Christians:” Trump's Pandering to Christian Nationalists  —  The other day, during an address to a Turning Point conference, Trump implored, … Video  —  Horse race journalists didn't care.  They found it more important to repeat and therefore magnify Trump's latest slur on Vice President Harris.",
    "url": "https://www.emptywheel.net/2024/07/29/my-beautiful-christians-dont-talk-about-trumps-pandering-to-christian-nationalists/"
  },
  {
    "text": "Trump agrees to give a victim interview to the FBI after assassination attempt  —  Trump's attempted assassin was a highly intelligent “loner” with few friends and a growing interest in guns, the FBI told reporters in a briefing on Monday.  —  WASHINGTON — Former President Donald … ",
    "url": "https://www.nbcnews.com/politics/justice-department/trump-agrees-give-victim-interview-fbi-assassination-attempt-rcna164006"
  },
  {
    "text": "The Most Revealing Moment of a Trump Rally  —  A close reading of the prayers delivered before the former president speaks  —  A week before christmas, an evangelical minister named Paul Terry stood before thousands of Christians, their heads bowed, in Durham, New Hampshire, and pleaded with God for deliverance.",
    "url": "https://www.theatlantic.com/magazine/archive/2024/09/trump-rally-prayers/679152/?gift=ock9angvzzsfBB238buuXiJ6Z9iR5_wVRkWUrj_8f8Q&utm_source=twitter&utm_medium=social&utm_campaign=social"
  },
  {
    "text": "Elon Musk takes fire for posting fake video of Kamala Harris  —  Elon Musk is being accused of violating his own policies on X after he shared a fake video of Vice President Harris, which uses an artificial intelligence voice mimicking Harris to spew insults about her campaign and President Biden.",
    "url": "https://thehill.com/policy/technology/4797604-elon-musk-fake-ai-video-harris/"
  },
  {
    "text": "Trump's Bro-Pocalypse Advisers Got Him ‘Cat Lady’ Vance  —  THE FOUR DORKSMEN  —  Without Melania, Ivanka, Kellyanne, and Hope, the 2024 Trump Campaign is suffering from mood swings and brain fog.  Is it too late for estrogen replacement therapy? … Since assuming the mantle … ",
    "url": "https://www.thedailybeast.com/donald-trumps-real-crisis-a-dire-estrogen-shortage"
  },
  {
    "text": "Venezuela election live updates: Opposition claims victory after Maduro was declared the winner  —  Supporters of President Nicolás Maduro gather at Miraflores Palace in Caracas as Maduro is declared the winner in Venezuela's presidential election amid opposition claims of irregularities.",
    "url": "https://apnews.com/live/venezuela-election-updates-maduro-machado-gonzalez"
  },
  {
    "text": "Trump uses immunity ruling to try to blow up his conviction  —  And thanks to the Supreme Court's right-wing nihilists, it just might work. … On July 1, the last day of the Supreme Court's term, six conservative justices took a sledgehammer to democracy.",
    "url": "https://www.publicnotice.co/p/how-scotus-immunity-impacts-trump-ny-conviction"
  },
  {
    "text": "A comprehensive guide to J.D. Vance's views on women and children  —  On July 25, former President Donald Trump named Senator J.D. Vance (R-OH) as his running mate.  Vance has only been a U.S. Senator since 2023, and his rapid ascension to the Republican Vice Presidential nominee … ",
    "url": "https://popular.info/p/a-comprehensive-guide-to-jd-vances"
  },
  {
    "text": "Former US ambassador says US ‘asleep’ amid Russia threat  —  The News  —  Morgan Chalfant: What did you learn about Russian President Vladimir Putin on the job that you might not have known otherwise, or that people don't understand about him and the way that he operates?",
    "url": "https://www.semafor.com/article/07/28/2024/former-us-ambassador-says-us-asleep-amid-russia-threat"
  },
  {
    "text": "Silicon Valley parents are fuming over ethnic studies in schools.  It's a preview of battles to come across California  —  Parents in Palo Alto are fuming about the school district's plans for an upcoming ethnic studies class, saying they're worried the curriculum is too political … ",
    "url": "https://www.sfchronicle.com/bayarea/article/palo-alto-ethnic-studies-19588959.php"
  }
]