[
  {
    "text": "‘Justice Will Prevail,’ Mahmoud Khalil Says as He Goes Free on Bail  —  Mr. Khalil, a Columbia graduate, had been held in Louisiana for over three months as the Trump administration sought to deport him.  A judge found reason to believe it was retaliation for his pro-Palestinian speech.",
    "url": "https://www.nytimes.com/2025/06/20/nyregion/mahmoud-khalil-release-order.html?unlocked_article_code=1.QU8.jeEe._uZk1wmi4w62&smid=url-share"
  },
  {
    "text": "Judge says he will order Columbia University protester Mahmoud Khalil freed from detention  —  A federal judge says he'll order Palestinian activist Mahmoud Khalil released from immigration detention.  Judge Michael Farbiarz made the ruling from the bench in federal court in New Jersey on Friday.",
    "url": "https://apnews.com/article/mahmoud-khalil-release-columbia-protest-trump-immigration-69162d21ab22377b1c1c08cf2c83d6cd"
  },
  {
    "text": "Columbia activist Mahmoud Khalil released from ICE detention in Louisiana  —  Columbia University activist Mahmoud Khalil exited an Immigration and Customs Enforcement detention facility in Louisiana on Friday night, after a federal judge ordered his release while his immigration proceedings play out.",
    "url": "https://www.cbsnews.com/news/mahmoud-khalil-ordered-released-judge/"
  },
  {
    "text": "Pro-Palestinian activist Mahmoud Khalil released after months in detention  —  The Columbia University activist had been held in immigration agents' custody since March 8.  —  Pro-Palestinian activist and Columbia University graduate Mahmoud Khalil was released from detention Friday evening … ",
    "url": "https://www.nbcnews.com/news/us-news/mahmoud-khalil-ordered-released-federal-judge-rcna214163"
  },
  {
    "text": "Kari Lake follows through on Trump order, axes most of Voice of America's staff  —  After three months of legal battles and lobbying, the Voice of America network is officially being reduced to a fraction of its pre-Trump form.  —  Widespread layoffs took place Friday at VOA and its parent agency … ",
    "url": "https://cnn.com/2025/06/20/media/kari-lake-voa-trump-voice-of-america-staff"
  },
  {
    "text": "A judge sided with Trump.  Behind the scenes, he was lobbying for a nomination.  —  Ed Artau was already meeting with Senate staff about securing a nomination to the federal bench when he sided with Trump in a case, according to a new Senate disclosure obtained by POLITICO.",
    "url": "https://www.politico.com/news/2025/06/20/ed-artau-trump-judge-nomination-florida-00415408"
  },
  {
    "text": "Hundreds of U.S. citizens have fled Iran amid Israeli strikes  —  A State Department cable obtained by The Post acknowledges many Americans are in harm's way as Trump mulls military action against Tehran.  —  Summary19  —  Hundreds of U.S. citizens have left Iran through its land borders since … ",
    "url": "https://www.washingtonpost.com/national-security/2025/06/20/iran-us-citizens-israel-strikes-state-department/"
  },
  {
    "text": "Louisiana's Ten Commandments law in public schools blocked by federal appeals court  —  The law went into effect this year, but it's unclear how many, if any, school districts have begun to comply as litigation could ultimately land before the U.S. Supreme Court.",
    "url": "https://www.nbcnews.com/news/us-news/louisianas-ten-commandments-law-public-schools-blocked-federal-appeals-rcna189408"
  },
  {
    "text": "ICE agents scatter as SD Bishop Pham, other clergy visit immigration court  —  Eight immigration courts line the fourth-floor hallway of the downtown Edward J. Schwartz Federal Building.  On the walls: boot prints of ICE agents.  —  But on World Refugee Day, masked immigration agents … ",
    "url": "https://timesofsandiego.com/life/2025/06/20/ice-agents-scatter-as-sd-bishop-pham-other-clergy-visit-immigration-court/"
  },
  {
    "text": "EXCLUSIVE: Vance Boelter blamed Gov. Walz for shooting rampage in confession letter, sources say  —  Multiple sources with direct knowledge of the investigation confirmed to Alpha News that Boelter's so-called confession letter was intended for Kash Patel, the director of the FBI.",
    "url": "https://alphanews.org/exclusive-vance-boelter-blamed-gov-walz-for-shooting-rampage-in-confession-letter-sources-say/"
  },
  {
    "text": "Social Security stops reporting call wait times and other metrics  —  The changes are the latest sign of the agency's struggle with website crashes, overloaded servers and long lines at field offices amid Trump cutbacks.  —  Social Security has stopped publicly reporting its processing times for benefits … ",
    "url": "https://www.washingtonpost.com/politics/2025/06/20/social-security-wait-times-cuts/"
  },
  {
    "text": "Treasured Public Lands on the Auction Block in Trump's ‘Big Beautiful Bill’  —  250 million acres of federal land are at risk for sale to the highest bidder under Senate provision  —  Every Summer, my wife and I pack up our three kids and the family dog and drive an hour-and-a-half from our home … ",
    "url": "https://www.rollingstone.com/politics/politics-features/public-land-highest-bidder-trump-big-beautiful-bill-1235369151/"
  },
  {
    "text": "Top Pentagon spy pick rejected by White House  —  Army Lt. Gen. Richard Angle's name was put forward to lead the National Security Agency and U.S. Cyber Command.  —  The White House recently nixed the Pentagon's pick to head the country's top spy agency and command its elite hacking force … ",
    "url": "https://www.politico.com/news/2025/06/20/richard-angle-nsa-cyber-command-00415619"
  },
  {
    "text": "Japan scraps US meeting after Washington demands more defence spending  —  Allies' top defence and foreign policy officials were due to hold talks on July 1  —  Japan has cancelled a top-level meeting with the US after the Trump administration abruptly told Tokyo to spend more on defence … ",
    "url": "https://www.ft.com/content/53f646e7-b4e7-4bf4-8d5d-7142b4460080"
  },
  {
    "text": "Ireland shuts last coal plant, becomes 15th coal-free country in Europe  —  Moneypoint in County Clare, Ireland, joins the ranks of other European nations exiting coal by shutting off power generation at its sole remaining coal plant.  Industry observers say Ireland's increased renewable energy generation … ",
    "url": "https://www.pv-magazine.com/2025/06/20/ireland-coal-free-ends-coal-power-generation-moneypoint/"
  },
  {
    "text": "Rich People, Pundits Really Do Not Want Zohran Mamdani to Be Mayor  —  Allies of former NY Governor Andrew Cuomo are breaking New York City spending limits trying to make him mayor.  Mamdani is still closing the gap  —  The Democratic primary to unseat disgraced New York City Mayor Eric Adams is in full swing.",
    "url": "https://www.rollingstone.com/politics/politics-news/zohran-mamdani-andrew-cuomo-new-york-mayor-spending-1235369220/"
  },
  {
    "text": "‘All of Ukraine is ours’ — Putin on Russia's territorial ambitions in Ukraine  —  Editor's Note: This story was updated with comments from Foreign Minister Andrii Sybiha.  —  Russian President Vladimir Putin said “all of Ukraine” belonged to Russia in a speech on June 20 … ",
    "url": "https://kyivindependent.com/all-of-ukraine-is-ours/"
  },
  {
    "text": "ICE believes it will never face accountability again  —  The Trump administration is letting an unaccountable secret police form at the heart of our democracy. … Day by passing day, we are watching what amounts to a national police riot by ICE. … In recent days, ICE … ",
    "url": "https://www.doomsdayscenario.co/p/ice-believes-it-will-never-face-accountability-again"
  },
  {
    "text": "Trump ‘looking at’ immigration relief for farm workers after resuming ICE raids on them  —  “We can't put the farms out of business,” Trump said June 20 in discussing his immigration enforcement efforts.  —  President Donald Trump again is saying he wants to shield farmers from the effects … ",
    "url": "https://www.usatoday.com/story/news/politics/2025/06/20/trump-farmers-migrant-labor/84291870007/"
  },
  {
    "text": "Michelle Obama ‘So Glad’ Not to Have Son Who'd Have Been a Baby Barack  —  SHOTS FIRED  —  The former First Lady made the comments in an episode of her podcast.  —  Michelle Obama has revealed that she's “so glad” she didn't have a son with husband President Barack Obama because he would've been a clone of the former president.",
    "url": "https://www.thedailybeast.com/michelle-obama-so-glad-not-to-have-son-whod-have-been-a-baby-barack/"
  },
  {
    "text": "Community And Choice Are Not Bubbles  —  from the communities-aren't-bubbles dept  —  Disclosure: I am on the board of Bluesky and am inherently biased.  Adjust your skepticism of what I write on this topic accordingly.  —  It seems a bit odd: when something is supposedly dying or irrelevant … ",
    "url": "https://www.techdirt.com/2025/06/20/community-and-choice-are-not-bubbles/"
  },
  {
    "text": "A teen with no criminal background was deported by ICE, leaving his community aghast  —  Emerson Colindres' soccer coach says his case is an example of how those getting taken by ICE “are your friends and neighbors ... and then one day they're just gone.”  —  For 19-year-old Emerson Colindres … ",
    "url": "https://www.nbcnews.com/news/amp/rcna212566"
  },
  {
    "text": "‘RFK Jr is a disaster’: Staff describe chaos in ‘anti-science’ regime  —  Officials in US health agencies fear ‘people will get sick’ as programmes are slashed and scientists are fired under the constant surveillance of Doge  —  For the workers of Building 21, keeping a low profile is considered the best way to survive.",
    "url": "https://www.thetimes.com/us/american-politics/article/cdc-rfk-robert-f-kennedy-q5tv0300z"
  },
  {
    "text": "So, has anything actually gotten more expensive because of Trump's tariffs?  —  Predictions from mainstream economists were dire after President Donald Trump launched his tariff campaign just a couple weeks after he began his second term in office: Prices would rise — sharply — they said … ",
    "url": "https://cnn.com/2025/06/20/business/tariff-price-increases-inflation-explained"
  },
  {
    "text": "Ohio man arrested in investigation into GOP Rep. Max Miller being ‘run off the road’  —  Police arrested an Ohio man in their investigation into a Thursday road rage incident in which Rep. Max Miller (R-Ohio) said he was “run off the road” by a person with a Palestinian flag.",
    "url": "https://www.politico.com/live-updates/2025/06/20/congress/max-miller-investigation-arrest-00415398"
  },
  {
    "text": "Trump's Violent Cult and What to Do About It  —  The recent attacks in Minnesota are part of clear and troubling rise in political violence in the U.S. At the same time, President Trump and MAGA continue to normalize violence in political discourse.  How do the events of the past week reflect a changing political climate?",
    "url": "https://thedsrnetwork.com/trumps-violent-cult-and-what-to-do-about-it"
  },
  {
    "text": "Trump gripes he won't get Nobel Peace Prize ‘no matter what’ as global conflicts persist  —  President Trump on Friday celebrated a newly announced deal to end the conflict between Rwanda and the Democratic Republic of the Congo but lamented that he may not win a Nobel Peace Prize for his work in the deal … ",
    "url": "https://thehill.com/homenews/5361632-trump-gripes-he-wont-get-nobel-peace-prize-no-matter-what-as-global-conflicts-persist/"
  },
  {
    "text": "As Trump shuts out migrants, Spain opens its doors and fuels economic growth  —  Defying the anti-immigrant trend in the U.S., Spain is reaping economic benefits by granting citizenship to tens of thousands of newly-arrived workers.  —  MADRID — When night falls on the other side of the Atlantic … ",
    "url": "https://www.washingtonpost.com/world/2025/06/20/spain-immigrants-economy-progressive-policies/"
  },
  {
    "text": "Trump administration makes sweeping changes to ObamaCare, ends ‘Dreamer’ coverage  —  The Trump administration is shortening ObamaCare's annual open enrollment period and ending the law's coverage of immigrants that entered the U.S. illegally as children, according to a final rule announced Friday.",
    "url": "https://thehill.com/policy/healthcare/5361480-trump-obamacare-dreamer-coverage-ends/"
  },
  {
    "text": "Dodgers commit $1M to families impacted by immigration raids after pushback from community groups  —  Este artículo se ofrece en Español  —  The Los Angeles Dodgers announced Friday that the organization will donate $1 million to immigrant families impacted by recent raids.",
    "url": "https://abc7.com/post/dodgers-announcement-plans-assist-immigrant-communities-delayed/16796768/"
  },
  {
    "text": "Texas looks to enact restrictions on when and how students can protest  —  Gov. Greg Abbott may soon sign the measure, which would bar campus protesters from using microphones, putting up tents or demonstrating after 10 p.m.  —  Summary337  —  Texas's conservative governor may soon sign … ",
    "url": "https://www.washingtonpost.com/nation/2025/06/20/texas-campus-speech-law-palestine-protests/"
  },
  {
    "text": "Insurers Pledge to Ease Controversial Prior Approvals for Medical Care  —  Major companies had faced mounting pressure to stop denying or stalling authorization of coverage for treatments and prescriptions.  —  Facing regulatory crackdowns and intensifying criticism from patients and doctors … ",
    "url": "https://www.nytimes.com/2025/06/20/health/health-insurance-prior-authorization.html"
  }
]