[
  {
    "text": "Inside the Democratic rebellion against Biden over the Gaza war  —  The depth of Democratic Party anger over President Joe Biden's handling of the Gaza war has caught his campaign off guard and could depress support in November's election, according to Reuters interviews with more than a dozen senior party … ",
    "url": "https://www.reuters.com/world/us/inside-democratic-rebellion-against-biden-over-gaza-war-2024-02-27/"
  },
  {
    "text": "Playbook: What Joe Biden has to fear from Michigan  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  A NEWSY EPISODE OF ‘LATE NIGHT’ — President JOE BIDEN addressed prospects for a cease-fire in the Israel-Hamas war during his appearance on NBC's … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/02/27/what-joe-biden-has-to-fear-from-michigan-00143487"
  },
  {
    "text": "My Nikki Haley Theory  —  From the day she came in third in Iowa to her 20-point loss to Donald Trump on Saturday in South Carolina, Nikki Haley and her aims have been the subject of intense speculation.  Clearly, in the absence of a lightning bolt from the blue that strikes Donald Trump … ",
    "url": "https://www.commentary.org/john-podhoretz/my-nikki-haley-theory/"
  },
  {
    "text": "“Suicide for our country”: Nikki Haley goes scorched earth on Trump … - “This may be his survival mode to pay his legal fees and get out of some sort of legal peril, but this is like suicide for our country,” she said of the former president, who faces 91 criminal counts across four cases.",
    "url": "https://www.axios.com/2024/02/27/nikki-haley-trump-wall-street-journal-interview"
  },
  {
    "text": "Schumer, Jeffries say Ukraine discussion was ‘intense’  —  Senate Majority Leader Chuck Schumer (D-N.Y.) and House Minority Leader Hakeem Jeffries (D-N.Y.) both characterized a Tuesday meeting between President Biden and congressional leaders as “intense” amid tension over Ukraine aid.",
    "url": "https://thehill.com/homenews/4491739-schumer-jeffries-say-ukraine-discussion-was-intense/"
  },
  {
    "text": "Jack Smith Pounds Trump For His Unprecedented Conduct In MAL Case  —  A lot of things happened.  Here are some of the things.  This is TPM's Morning Memo.  —  No One Has Ever Done What Trump Did  —  Special Counsel Jack Smith unleashed a tight, targeted fusillade in the Mar-a-Lago case … ",
    "url": "https://morningmemo.talkingpointsmemo.com/p/jack-smith-pounds-trump-for-his-unprecedented"
  },
  {
    "text": "Pride flags would be largely banned in Tennessee classrooms in bill advanced by GOP lawmakers  —  The GOP-led Tennessee House has passed a bill that would largely ban displaying pride flags in public school classrooms  —  NASHVILLE, Tenn. — A bill that would largely ban displaying pride flags … ",
    "url": "https://abcnews.go.com/Politics/wireStory/pride-flags-largely-banned-tennessee-classrooms-bill-advanced-107568221"
  },
  {
    "text": "Duckworth to demand vote on IVF bill  —  The bill would establish federal protections that override any state policy restricting IVF access.  —  Sens. Tammy Duckworth (D-Ill.) and Patty Murray (D-Wash.) will hold a press conference Tuesday morning demanding a vote on their bill to federally protect … ",
    "url": "https://www.politico.com/news/2024/02/27/duckworth-ivf-senate-vote-00143509"
  },
  {
    "text": "The economy is roaring.  Immigration is a key reason.  —  Momentum in the job market picked up aggressively over the past year — all while Washington is deadlocked on a border deal.  —  Immigration has propelled the U.S. job market further than just about anyone expected … ",
    "url": "https://www.washingtonpost.com/business/2024/02/27/economy-immigration-border-biden/"
  },
  {
    "text": "Trump Has a Hilarious New Excuse for Why He Can't Put Up Bond  —  Donald Trump is arguing that he shouldn't have to post the massive bond in E. Jean Carroll's defamation case against him ... because he's simply too rich.  —  Trump owes Carroll $83.3 million for defaming her in 2019 when she first accused him of sexual assault.",
    "url": "https://newrepublic.com/post/179308/trump-excuse-cant-post-bond-e-jean-carroll"
  },
  {
    "text": "'The numbers right now aren't good.'  —  FOR YEARS, DONALD TRUMP'S CAMPAIGN STAFF struggled to get him to make donor calls and take fundraising seriously.  —  But that was before Trump faced an incumbent president and a primary opponent who was outraising him.",
    "url": "https://plus.thebulwark.com/p/trump-fundraising-more-than-ever"
  },
  {
    "text": "Former Australian PM: Trump acts like 12-year-old boy around Putin  —  Former Australian Prime Minister Malcolm Turnbull described former President Trump's rhetoric around Russian President Vladimir Putin as an admiring “12-year-old boy.”  —  Speaking on Australian ABC's “Q+A” show … ",
    "url": "https://thehill.com/policy/international/4491800-former-australian-pm-trump-acts-like-12-year-old-around-putin/"
  },
  {
    "text": "In leaked audio, Supreme Court Justice John Devine railed against “brainwashed” GOP colleagues  —  Devine, a former anti-abortion activist, faces a heated primary challenge that has focused on questions about his ethics.  —  Speaking to a group of East Texas voters in September … ",
    "url": "https://www.texastribune.org/2024/02/27/john-devine-texas-supreme-court-conservatives/"
  },
  {
    "text": "Two candidates for mayor of a Mexican city are shot dead within hours of each other  —  Candidates Armando Pérez and Miguel Ángel Zavala were found dead days before campaigning was set to formally begin.  —  MEXICO CITY — Two candidates for mayor in the Mexican city of Maravatio … ",
    "url": "https://www.nbcnews.com/news/latino/mexican-mayoral-candidates-shot-dead-hours-rcna140739"
  },
  {
    "text": "Kroger's “nefarious bargain”  —  This is a special joint edition of Popular Information and Fingers, a newsletter about drinking in America by journalist Dave Infante.  Fingers is a must-read for anyone who cares about the business, culture, and chaos of booze.  Sign up HERE.",
    "url": "https://popular.info/p/krogers-nefarious-bargain"
  },
  {
    "text": "US Army is slashing thousands of jobs in major revamp to prepare for future wars  —  WASHINGTON (AP) — The U.S. Army is slashing the size of its force by about 24,000, or almost 5%, and restructuring to be better able to fight the next major war, as the service struggles with recruiting shortfalls … ",
    "url": "https://apnews.com/article/army-cuts-soldiers-recruiting-shortfall-9f2f41cbe512f6330ce6008709e3435b"
  },
  {
    "text": "House GOP chairs subpoena DOJ for Biden special counsel investigation documents  —  A trio of House GOP chairs fired off a subpoena to Attorney General Merrick Garland Tuesday requesting documents related to special counsel Robert Hur's investigation into President Biden's mishandling of classified documents.",
    "url": "https://thehill.com/homenews/house/4492049-house-gop-subpoena-doj-biden-special-counsel-documents/"
  },
  {
    "text": "Johnson said to commit to avoiding shutdown during White House meeting  —  The speaker made “unequivocally” clear that he wants to avoid even a partial closure that's set to happen Saturday at midnight, Senate Majority Leader Chuck Schumer said.",
    "url": "https://www.politico.com/live-updates/2024/02/27/congress/johnson-at-meeting-00143561"
  }
]