[
  {
    "text": "Republicans fume as GOP absences help Democrats move judicial nominees  —  Senate Republicans aired frustrations Tuesday after Vice President-elect Vance and other party members skipped votes Monday, greasing the skids for Democratic-backed judicial nominees to be greenlighted as part … ",
    "url": "https://thehill.com/homenews/senate/4998960-senate-republicans-frustrated-judicial-nominees-vance/"
  },
  {
    "text": "In reversal, Thune seeks to slow down Biden's judicial nominees  —  In 2020, Thune touted the importance of confirming judges to the bench.  —  Senator John newly elected Senate Majority Leader for the upcoming 119th Congress, speaks to reporters at the U.S. Capitol, Nov. 13, 2024, in Washington.",
    "url": "https://abcnews.go.com/Politics/reversal-thune-seeks-slow-bidens-judicial-nominees/story?id=116010653"
  },
  {
    "text": "Harris lost to Trump.  She may have one last chance to defy him.  —  The vice president is prepared to provide tie-breaking votes in critical judicial appointments as Biden works to push through confirmations.  —  Fresh from a devastating loss to Donald Trump, Vice President Kamala Harris … ",
    "url": "https://www.nbcnews.com/politics/kamala-harris/kamala-harris-break-ties-biden-judicial-nominees-rcna180776"
  },
  {
    "text": "GOP No-Shows Help Dems Approve Judicial Nominees Against Trump's Wishes  —  UNFORCED ERROR  —  Trump also helped Democrats by taking a few Republicans on a field trip to see the SpaceX rocket launch.  —  Deputy Washington Bureau Chief  —  Republicans on Tuesday ripped JD Vance … ",
    "url": "https://www.thedailybeast.com/gop-no-shows-help-dems-approve-judicial-nominees-against-trumps-wishes/"
  },
  {
    "text": "Rep. Mace introduces measure to ban trans women from Capitol's female bathrooms  —  The South Carolina Republican's resolution comes two weeks after the historic election of Democrat Sarah McBride, a trans woman, to Congress.  —  CORRECTION  —  A previous version of this article misattributed … ",
    "url": "https://www.washingtonpost.com/politics/2024/11/19/nancy-mace-transgender-bathroom-ban/"
  },
  {
    "text": "Linda McMahon expected to be named Education secretary, sources say  —  Trump transition co-chair Linda McMahon is expected to be named as secretary of the Department of Education, four sources familiar with the matter told CNN.  —  The decision took shape after it became clear that McMahon would be passed over for Commerce secretary.",
    "url": "https://www.cnn.com/2024/11/19/politics/linda-mcmahon-education-secretary-trump"
  },
  {
    "text": "Trump expected to pick Linda McMahon, former wrestling executive, to head Department of Education, sources say  —  President-elect Donald Trump is expected to pick Linda McMahon, the former wrestling executive, to head the Department of Education, two sources familiar with the transition told CBS News Tuesday.",
    "url": "https://www.cbsnews.com/news/trump-to-pick-linda-mcmahon-head-department-of-education-sources/"
  },
  {
    "text": "Trump Is Calling Senators on Behalf of Matt Gaetz.  It's Not Going Well.  —  “Matt Gaetz is toxic among House Republicans.  Among Senate Republicans, he is radioactive,” one source familiar with the conversations told NOTUS.  — Copy  —  As Republicans circle the wagons around Matt Gaetz … ",
    "url": "https://www.notus.org/trump-transition/trump-calling-senators-matt-gaetz-not-going-well"
  },
  {
    "text": "‘100% on board’: Border state offers Trump massive plot of land to aid mass deportation operation  —  Texas has ramped up its own efforts to secure southern border  —  EXCLUSIVE: Texas is offering the incoming Trump administration a tract of more than 1,400 acres on which to stage … ",
    "url": "https://www.foxnews.com/politics/border-state-offers-trump-massive-plot-land-aid-mass-deportation-operation"
  },
  {
    "text": "Fetterman opens door to supporting ex-rival Oz as CMS administrator  —  Sen. John Fetterman (D-Pa.) opened the door on Tuesday to supporting ex-rival Mehmet Oz as the Centers for Medicare and Medicaid Services (CMS) administrator.  —  “If Dr. Oz is about protecting and preserving Medicare and Medicaid … ",
    "url": "https://thehill.com/homenews/senate/4999028-fetterman-opens-door-to-supporting-ex-rival-oz-as-cms-administrator/"
  },
  {
    "text": "Italian village offers $1 homes to Americans upset by the US election result  —  For travel tips, recipes and more insight on Italian culture, sign up for CNN's Unlocking Italy newsletter.  This eight-part guide will have you packing your bags in no time.  —  CNN  —",
    "url": "https://www.cnn.com/2024/11/19/travel/italian-village-ollolai-wants-americans-election-one-dollar-homes"
  },
  {
    "text": "Trump ignores transition rules.  It's a ‘hostile takeover,’ ally says.  —  Donald Trump's transition team has begun what a close ally calls a hostile takeover of the federal government, ignoring the rules for the handover of power in the process.  —  A thousand miles from the austere buildings … ",
    "url": "https://www.washingtonpost.com/politics/2024/11/19/trump-transition-fbi-state-gsa/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzMxOTkyNDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzMzMzc0Nzk5LCJpYXQiOjE3MzE5OTI0MDAsImp0aSI6IjBmZTE4ODlkLWQ3YmItNGI0NS1iOGZiLTZiNWIzNjhlMjRmYiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzExLzE5L3RydW1wLXRyYW5zaXRpb24tZmJpLXN0YXRlLWdzYS8ifQ.wVIZb_aXpYqSO7JbPVHOpVLuVUc_yRKPWMrwcuZXAxk&itid=gfta"
  },
  {
    "text": "Multiple election offices report receiving mailed ballots misdirected from other states  —  Terry Thompson had an election to run for voters in Cascade County, Montana.  Why then, she thought, was her office in Great Falls being sent mailed ballots completed by voters in places such as Wasilla … ",
    "url": "https://apnews.com/article/election-voting-mail-ballots-postal-service-7c942c832398d55843fbc20898d85385"
  },
  {
    "text": "Weak turnout in key cities hurt Harris in the ‘blue wall’ states  —  More people voted in 2024 than in 2020 in Michigan, Pennsylvania and Wisconsin, but that growth came from pro-Trump areas.  —  A new analysis of precinct-level data by the NBC News Decision Desk shows the extent … ",
    "url": "https://www.nbcnews.com/politics/2024-election/weak-turnout-key-cities-hurt-harris-blue-wall-states-rcna180669"
  },
  {
    "text": "Macron urges Putin to ‘be reasonable’ on nuclear weapons  —  RIO DE JANEIRO — French President Emmanuel Macron told Russian President Vladimir Putin on Tuesday to climb down from making nuclear threats after Russia lowered its threshold for launching a nuclear strike earlier in the day.",
    "url": "https://www.politico.eu/article/emmanuel-macron-france-vladimir-putin-russia-war-in-ukraine-nuclear-weapons/"
  },
  {
    "text": "Bucks County board chair says comment about violating election law has been misinterpreted  —  Bucks County Board of Commissioners Chair Diane Ellis-Marseglia said Monday that her comments about violating the Pennsylvania Supreme Court were taken out of context after they set off a national backlash … ",
    "url": "https://www.inquirer.com/politics/election/bucks-county-commissioner-diane-ellis-marseglia-20241118.html"
  },
  {
    "text": "Hacker Is Said to Have Gained Access to File With Damaging Testimony About Gaetz  —  The computer file is said to contain testimony from the woman who said she had sex with Matt Gaetz, President-elect Donald Trump's choice to be attorney general, when she was 17.",
    "url": "https://www.nytimes.com/2024/11/19/us/politics/matt-gaetz-hack-testimony.html?unlocked_article_code=1.bE4.f2SX.A-EoaFu8nQma&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Far-right militia targets US military over baseless hurricane ‘weather weapon’ claims  —  Veterans on Patrol believes government caused Helene with weather manipulation tech, Telegram chats reveal  —  A vigilante militia notorious for its patrols on America's border with Mexico has threatened … ",
    "url": "https://www.theguardian.com/us-news/2024/nov/19/far-right-militia-targets-military-weather-manipulation"
  },
  {
    "text": "State Board of Education signals support for Bible-infused curriculum  —  Critics say the curriculum overemphasizes Christianity.  The board is expected to officially vote on whether to approve the materials later this week.  —  A majority of the Texas State Board of Education signaled … ",
    "url": "https://www.texastribune.org/2024/11/19/texas-sboe-bible-christianity-curriculum/"
  },
  {
    "text": "LA enacts sanctuary city ordinance to prepare for potential mass deportations under Trump  —  The Los Angeles City Council on Tuesday approved a so-called “sanctuary city” ordinance that bars city resources from being used for immigration enforcement and city departments from sharing information … ",
    "url": "https://apnews.com/article/sanctuary-city-trump-deportations-immigrants-los-angeles-836cf68a756c64800bbeb0270e8a965c"
  },
  {
    "text": "Donald Trump Has NOT Won a Majority of the Votes Cast for President  —  Donald Trump's popular vote total has fallen below 50 percent, and his margin over Kamala Harris has narrowed considerably as all the votes are counted.  —  Pocket  —  “America has given us an unprecedented and powerful mandate … ",
    "url": "https://www.thenation.com/article/politics/donald-trump-vote-margin-narrowed/"
  },
  {
    "text": "Here's what to know about bacteria in Tom's of Maine's toothpaste  —  Tom's of Maine toothpaste was manufactured with water containing bacteria, while a “black mold-like substance” was found in a factory where the product was made, according to a warning letter from the U.S. Food and Drug Administration.",
    "url": "https://www.cbsnews.com/news/toms-of-maine-toothpaste-bacteria-water-black-mold-fda-details/"
  },
  {
    "text": "This Election's Surprising Bright Spot for Progressives Is a Very Big Deal  —  The 2024 election marked a painful setback for Democratic hopes of rebalancing the federal judiciary: When Donald Trump reenters the White House in January, he will have a pliant Republican Senate majority eager to confirm his hard-right judges.",
    "url": "https://slate.com/news-and-politics/2024/11/2024-election-progressives-judicial-races-allison-riggs.html"
  },
  {
    "text": "Spain to legalise about 300,000 undocumented immigrants per year  —  Spain will legalise about 300,000 undocumented immigrants per year over the next three years as it seeks to expand its labour force in the face of an ageing population, Migration Minister Elma Saiz told reporters on Tuesday.",
    "url": "https://www.reuters.com/world/europe/spain-regularise-about-300000-undocumented-migrants-per-year-2024-11-19/"
  },
  {
    "text": "The stunning success of vaccines in America, in one chart  —  Measles, mumps, and polio are supposed to be diseases of the past.  In the early to mid-20th century, scientists developed vaccines that effectively eliminated the risk of anyone getting sick or dying from illnesses that had killed millions over millennia of human history.",
    "url": "https://www.vox.com/future-perfect/386215/trump-rfk-jr-vaccines-health-measles-chart"
  }
]