[
  {
    "text": "Trump Cabinet Picks So Far Decried as ‘Nightmare Fuel’  —  Progressive advocates voiced alarm Monday over U.S. President-elect Donald Trump's initial leadership picks—including a border czar who oversaw the separation of migrant families during the Republican's first term … ",
    "url": "https://www.commondreams.org/news/trump-cabinet-picks"
  },
  {
    "text": "Who is Lee Zeldin?  Six things to know about Trump's selection for EPA chief  —  President-elect Trump on Monday announced former Rep. Lee Zeldin (R-N.Y.) as his nominee to lead the Environmental Protection Agency (EPA).  —  Zeldin has a fairly thin track record on environmental policy … ",
    "url": "https://thehill.com/policy/energy-environment/4985716-zeldin-epa-nominee-trump/"
  },
  {
    "text": "Oil Lobbyists Ask Trump for More Offshore Leases, LNG Approvals  —  A major US oil industry lobbying group is pushing for President-elect Donald Trump and the Republican-controlled Congress to boost offshore crude-lease sales, reform permitting and quickly process applications related to liquefied natural gas shipments.",
    "url": "https://www.bloomberg.com/news/articles/2024-11-12/oil-group-api-asks-trump-for-more-offshore-leases-lng-approvals"
  },
  {
    "text": "Trump picks Kristi Noem to serve as his Homeland Security secretary  —  President-elect Donald Trump has selected South Dakota Gov. Kristi Noem as his next secretary of the Department of Homeland Security, according to two people familiar with the selection.",
    "url": "https://www.cnn.com/2024/11/12/politics/kristi-noem-homeland-security-secretary/"
  },
  {
    "text": "Trump Expected to Name Marco Rubio as Secretary of State  —  The president-elect appears to have settled on the Florida senator to be the nation's top diplomat.  —  President-elect Donald J. Trump is expected to name Senator Marco Rubio of Florida as his secretary of state … ",
    "url": "https://www.nytimes.com/2024/11/11/us/politics/trump-rubio-secretary-of-state.html?unlocked_article_code=1.ZU4.El0L.6KFa6omup__S&smid=url-share"
  },
  {
    "text": "Judge delays decision on tossing Trump's hush money conviction  —  Trump's team wants the case dismissed, and the prosecution says it needs time to evaluate next steps.  —  The judge overseeing Donald Trump's New York criminal trial delayed a key ruling Tuesday on whether the president-elect's conviction … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/judge-trump-hush-money-case-delays-key-ruling-ahead-sentencing-rcna179763"
  },
  {
    "text": "Decision on whether to overturn Trump's New York hush money conviction is delayed  —  Donald Trump's lawyers and the Manhattan district attorney's office have agreed to delay activity in the hush money case until November 19 to give the president-elect's lawyers time to make new arguments on how his election victory impacts the case.",
    "url": "https://www.cnn.com/2024/11/12/politics/decision-on-trumps-new-york-hush-money-case-is-delayed"
  },
  {
    "text": "Federal judge blocks Louisiana law that requires classrooms to display Ten Commandments  —  A new Louisiana law that requires the Ten Commandments to be displayed in every public classroom by Jan. 1 has been temporarily blocked after a federal judge granted a preliminary injunction on Tuesday.",
    "url": "https://apnews.com/article/ten-commandments-law-blocked-public-schools-louisiana-87b3dde94e583fdbb9ecb26db42b0206"
  },
  {
    "text": "Russia Attempts to Collect Its Winnings  —  Russia has been engaged in a good deal of dick-wagging with Trump since the election.  —  After Trump won, Russia did not call to congratulate — at least as far as we know (though Viktor Orbán seems to be Trump's handler and he did).",
    "url": "https://www.emptywheel.net/2024/11/12/russia-attempts-to-collect-its-winnings/"
  },
  {
    "text": "Democrat Ruben Gallego wins Arizona US Senate race against Republican Kari Lake  —  Democrat Ruben Gallego has been elected Arizona's first Latino U.S. senator, defeating Republican Kari Lake and preventing Republicans from further padding their Senate majority.",
    "url": "https://apnews.com/article/arizona-senate-ruben-gallego-kari-lake-ea364326c93f9a8a32b7b9ca7ca696d4"
  },
  {
    "text": "Melania Trump declines to meet with Jill Biden at White House, citing Mar-a-Lago raid: source  —  Melania Trump declined an offer to head to the White House Wednesday and meet with Jill Biden, citing the Biden administration's past raid on Mar-a-Lago as part of the federal government's investigation into classified documents.",
    "url": "https://nypost.com/2024/11/11/us-news/melania-trump-declines-to-meet-with-jill-biden-at-white-house-citing-mar-a-lago-raid-source/"
  },
  {
    "text": "Supreme Court rejects Mark Meadows appeal in Georgia election interference case  —  Donald Trump's former White House chief of staff failed in his bid to move the case to federal court to mount immunity arguments.  —  WASHINGTON — The Supreme Court on Tuesday dealt a setback … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-rejects-mark-meadows-appeal-georgia-election-interferenc-rcna178727"
  },
  {
    "text": "No Trump bump: MSNBC hemorrhaging viewers since Election Day, sheds more than half of primetime audience  —  'It's a stale product no one will want to listen to going forward,' Curtis Houck says  —  MSNBC's reliably liberal audience has tuned out the anti-Trump network since Election … ",
    "url": "https://www.foxnews.com/media/msnbc-hemorrhaging-viewers-since-election-day-sheds-more-than-half-of-primetime-audience"
  },
  {
    "text": "The End of American Exceptionalism  —  Trump's Reelection Will Redefine U.S. Power  —  The only thing uncontroversial about Donald Trump is how he won his second term.  Despite polls showing a statistical dead heat and fears of a long, drawn-out wait for election results, Trump was declared the winner early last Wednesday morning.",
    "url": "https://www.foreignaffairs.com/united-states/end-american-exceptionalism"
  },
  {
    "text": "Will the American project survive the anger of white men?  —  At key moments throughout US history, white male anger has been privileged over national security, progress or basic welfare  —  A friend recently asked: “Do you think the United States will survive the anger of white men?”",
    "url": "https://www.theguardian.com/commentisfree/2024/nov/12/trump-white-men-anger-american-history"
  },
  {
    "text": "Justice Samuel Alito Plans to Remain on Supreme Court  —  Some Republicans suggest the veteran jurist could step down to let Trump appoint a younger conservative  —  WASHINGTON—Justice Samuel Alito has no plans to step down from the Supreme Court, people close to the justice said … ",
    "url": "https://www.wsj.com/us-news/law/justice-samuel-alito-plans-to-remain-on-supreme-court-f14aac9e?st=nuc6Zo"
  },
  {
    "text": "Trump Gears Up for Assault on Wokeness With Education Overhaul  —  President-elect lays out big changes for America's classrooms, including expanding school choice and closing Department of Education  —  President-elect Donald Trump has vowed to remake education in the U.S. … ",
    "url": "https://www.wsj.com/us-news/education/trump-policies-department-education-schools-965a7686?st=9kdVsE"
  },
  {
    "text": "John Paulson Drops Out of Running to Become Trump Treasury Secretary  —  Investor says his ‘complex financial obligations’ would prevent him from joining administration  —  Veteran investor John Paulson is dropping out of the running to become President-elect Donald Trump's Treasury secretary … ",
    "url": "https://www.wsj.com/politics/elections/john-paulson-treasury-secretary-trump-cabinet-f18b24e0?st=krLXPL&reflink=article_copyURL_share"
  },
  {
    "text": "Freedom Caucus's rogue procedural move raises questions about consequences  —  Key members of the House Freedom Caucus went rogue with parliamentary procedure on the House floor while GOP leaders were far away and focused on other matters on Election Day, raising questions about whether … ",
    "url": "https://thehill.com/homenews/house/4984692-house-freedom-caucus-rogue-move/"
  },
  {
    "text": "The Two Donald Trumps  —  The central contradiction of Donald Trump's reelection is this: He owes his victory to the fact that millions of voters appear to have seen him as the stability candidate who would usher in a return to pre-COVID normalcy.  But he has put forward a second-term agenda … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/11/trump-voters-stability-chaos/680635/"
  }
]