[
  {
    "text": "‘That son of a bitch’: New Woodward book reveals candid behind-the-scenes conversations of Biden, Trump, Harris and Putin  —  Editor's Note: The story below contains explicit language  —  In his new book, legendary journalist Bob Woodward offers a remarkable look behind the scenes … ",
    "url": "https://www.cnn.com/2024/10/08/politics/bob-woodward-book-war-joe-biden-putin-netanyahu-trump"
  },
  {
    "text": "Trump Secretly Stayed in Touch With Putin After Leaving Office, Book Says  —  A new book by the journalist Bob Woodward also reports that Donald J. Trump, while still in office, secretly sent Vladimir Putin what were then rare Covid-19 tests for the Russian's leader's personal use.",
    "url": "https://www.nytimes.com/2024/10/08/us/politics/trump-putin-woodward-book.html?unlocked_article_code=1.Qk4.F1eW.Nwd3PUmc0OtH&smid=url-share"
  },
  {
    "text": "Trump secretly sent covid tests to Putin during 2020 shortage, new book says  —  “War,” by Bob Woodward, traces how Trump and Biden responded to international crisis and concludes that Trump is worse than Nixon, the president exiled by the Watergate scandal.",
    "url": "https://www.washingtonpost.com/politics/2024/10/08/bob-woodward-new-book-war-trump-putin-biden/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI4MzYwMDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI5NzQyMzk5LCJpYXQiOjE3MjgzNjAwMDAsImp0aSI6IjAxNjY5ZDA1LTJlMjUtNGRiYy05YjlkLTBmYTg4NTJmMzE4MCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzEwLzA4L2JvYi13b29kd2FyZC1uZXctYm9vay13YXItdHJ1bXAtcHV0aW4tYmlkZW4vIn0.dYNij81BHmzri8NIu-iYeYRlmoLac_bjFsKsemYz85I&itid=gfta"
  },
  {
    "text": "Trump Lashes Out After Damning Report on His Close Ties to Putin  —  Donald Trump's campaign team is lashing out against a journalist following news that the former president secretly kept in touch with Russian President Vladimir Putin after leaving the Oval Office.",
    "url": "https://newrepublic.com/post/186915/trump-team-reaction-woodward-report-close-ties-putin"
  },
  {
    "text": "As Russia Overtly Helps Trump Get Elected, Trump Continues to Check in with Vladimir Putin  —  According to CNN, Bob Woodward's latest book reveals that Trump has spoken to Vladimir Putin as many as seven times since leaving the Presidency. … According to WaPo's version of the Woodward story … ",
    "url": "https://www.emptywheel.net/2024/10/08/as-russia-overtly-helps-trump-get-elected-trump-continues-to-check-in-with-vladimir-putin/"
  },
  {
    "text": "Eleven years later, Trump may finally have the best friend he wanted  —  In 2013, the future president mused that he might become BFFs with Russian President Vladimir Putin.  New reporting suggests that goal might have come to fruition.  —  In 2013, Donald Trump was just New York Businessman Donald Trump … ",
    "url": "https://www.washingtonpost.com/politics/2024/10/08/trump-putin-russia-ukraine/"
  },
  {
    "text": "Kamala Harris' Support Among Republicans Almost Doubles: NYT-Siena Poll  —  in November has nearly doubled over the past month according to a major new survey from  —  .  —  It found nine percent of likely voters who describe themselves as  —  plan to back the Democratic candidate in November … ",
    "url": "https://www.newsweek.com/kamala-harris-support-among-republicans-almost-doubles-nyt-siena-poll-1965611"
  },
  {
    "text": "Kamala Harris makes the case in 60 Minutes interview for why she should be president  —  Kamala Harris has been a candidate for president for just two-and-a-half months and the post convention “honeymoon” is over.  With the election just 29 days away, Harris and her running mate Minnesota … ",
    "url": "https://www.cbsnews.com/news/kamala-harris-2024-election-interview-60-minutes-transcript/"
  },
  {
    "text": "Poll Finds Harris Rising as She Challenges Trump on Change  —  A national Times/Siena poll found Kamala Harris with a slim lead over Donald J. Trump.  Voters were more likely to see her, not Mr. Trump, as a break from the status quo.  —  Voters are now more likely to credit Vice President Kamala Harris … ",
    "url": "https://www.nytimes.com/2024/10/08/us/politics/harris-trump-poll-national.html"
  },
  {
    "text": "Cesar's Conspicuous Call  —  Questions are mounting over why NBCU has opted to shelve the well-reviewed documentary from an Oscar-winning filmmaker until after the election.  —  NBCU News Group boss Cesar Conde is — yet again — facing questions about an eyebrow-raising editorial decision that was made within his palace's walls.",
    "url": "https://www.status.news/p/separated-documentary-airing-date"
  },
  {
    "text": "‘Eternally sorry’: Journalist confesses his biggest error in covering ‘buffoon’ Trump  —  Former President Donald Trump's behavior has been enabled by a mainstream press that “never took him seriously,” Lucian Truscott wrote for Salon on Tuesday in a damning indictment of the media's enabling … ",
    "url": "https://www.rawstory.com/donald-trump-normalized/"
  },
  {
    "text": "FBI probe of Kavanaugh constrained by Trump White House, report finds  —  A Democratic senator's report finds new evidence of the White House controlling an FBI investigation into sexual assault claims against the Supreme Court nominee.  —  In September 2018, as allegations of sexual misconduct … ",
    "url": "https://www.washingtonpost.com/politics/2024/10/08/kavanaugh-trump-white-house-fbi-report/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI4MzYwMDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI5NzQyMzk5LCJpYXQiOjE3MjgzNjAwMDAsImp0aSI6ImE2ZjA5OGI2LTBjNWItNDc0Yy04MGU5LTY3ODM1Mjg2MDU4NyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzEwLzA4L2thdmFuYXVnaC10cnVtcC13aGl0ZS1ob3VzZS1mYmktcmVwb3J0LyJ9.aIEU1sRoBfqZhsuYzFvGj3T2_sDO_WY4XKcyRE3wGGI&itid=gfta"
  },
  {
    "text": "Trump Gets Unhinged, Even for Him, Over Kamala Harris ‘60 Minutes’ Interview  —  CLUCK CLUCK  —  The former president claimed the vice president's sitdown with “60 Minutes”—something he bailed on after agreeing to—was “the WORST Interview.”  —  Donald Trump—who agreed to an interview … ",
    "url": "https://www.thedailybeast.com/trump-gets-unhinged-even-for-him-over-kamala-harris-60-minutes-interview"
  },
  {
    "text": "Harris proposes Medicare cover home care costs to help the ‘sandwich generation’  —  Vice President Harris on Tuesday laid out a proposal to expand Medicare coverage to help cover the costs of home health care aides for seniors.  —  Harris announced the plan — squarely aimed at … ",
    "url": "https://www.npr.org/2024/10/08/nx-s1-5144747/kamala-harris-sandwich-generation-home-care"
  },
  {
    "text": "I'm Behind the Trump-Russia Dossier.  We Gave the FBI More Than People Know  —  My wife Katherine called me up to the bedroom and told me that BuzzFeed had published our memos: The so-called “dossier” on  —  .  —  It was the night of January 10, 2017.  The publication of the news story … ",
    "url": "https://www.newsweek.com/christopher-steele-trump-russia-putin-election-dossier-fbi-1963717"
  },
  {
    "text": "The Cataclysmic Post-Election Scenario No One's Bracing For  —  At the start of the 118th Congress in January 2023, I sat in the press gallery of the House chamber and watched Republicans fail to elect a speaker, as Kevin McCarthy didn't have the votes.  What is traditionally accomplished … ",
    "url": "https://www.thebulwark.com/p/the-cataclysmic-post-election-scenario"
  },
  {
    "text": "Disaster Disinformation Is This Year's John Podesta Emails  —  I've already focused on these three paragraphs, but want to return to them.  They're from NYT's article anticipating how the apparently tied race will roll out in the next 30 (now 28) days.",
    "url": "https://www.emptywheel.net/2024/10/08/disaster-disinformation-is-this-years-john-podesta-emails/"
  },
  {
    "text": "A former aide to New York Mayor Eric Adams is charged with destroying evidence as top deputy quits  —  A former New York City official was charged Tuesday with witness tampering and destroying evidence in a federal investigation that led to Mayor Eric Adams' bribery indictment.",
    "url": "https://apnews.com/article/new-york-city-mayor-eric-adams-aide-eb8b63381e218419529b52eb8a1e0f04"
  },
  {
    "text": "Elon Musk is piling onto all the hurricane disinformation, hampering relief efforts  —  The billionaire is using the power of his social media platform to spread falsehoods that officials say are hampering recovery efforts.  —  Elon Musk is using his social media network … ",
    "url": "https://www.politico.com/news/2024/10/08/elon-musk-hurricane-disinformation-trump-00182769"
  },
  {
    "text": "Cook Political Report shifts Wisconsin Senate race toward GOP  —  The Cook Political Report on Tuesday shifted the Wisconsin Senate race from “lean Democrat” to “toss up,” handing Republican Eric Hovde a boost as he tries to unseat Sen. Tammy Baldwin (D-Wis.).",
    "url": "https://thehill.com/homenews/campaign/4921527-wisconsin-senate-toss-up-cook-political-report/"
  },
  {
    "text": "Google's new phones can't stop phoning home (permalink)  —  One of the most brazen lies of Big Tech is that people like commercial surveillance, a fact you can verify for yourself by simply observing how many people end up using products that spy on them.  If they didn't like spying, they wouldn't opt into being spied on.",
    "url": "https://pluralistic.net/2024/10/08/water-thats-not-wet/#pixelated"
  },
  {
    "text": "Report: Mark Robinson Skips Vote on Hurricane Helene Support—Again  —  The North Carolina lieutenant governor is failing to take the responsibility required of his position.  —  It appears as though Mark Robinson is hellbent on his apparent refusal to take emergency action in the aftermath of Hurricane Helene.",
    "url": "https://www.motherjones.com/politics/2024/10/mark-robinson-helene-vote-skip/"
  },
  {
    "text": "Oklahoma shifts Bible rules after accusations of pro-Trump bias, but will schools comply?  —  Oklahoma is shifting its requirements for which Bibles will be put in classrooms in the face of criticism that it was essentially feeding the contract to former President Trump … ",
    "url": "https://thehill.com/homenews/education/4922340-oklahoma-trump-bibles-schools-classrooms-ryan-walters/"
  },
  {
    "text": "Doug Emhoff was a foul-mouthed ‘a**hole’ and ‘misogynist’ who hired a ‘trophy secretary’ because she was ‘pretty’ and 'retaliated against women who didn't flirt back' at LA law firm, ex-staff claim  —  Kamala Harris's husband was ‘inappropriate’ and ‘misogynistic’ at work, his former colleagues tell DailyMail.com.",
    "url": "https://www.dailymail.co.uk/news/article-13925099/kamala-harris-husband-doug-emhoff-office-misogynist-flirt.html"
  },
  {
    "text": "DeSantis Threatening Jail Time for Running Abortion Rights Ads in Florida  —  Florida has become the state where elements of a future, second-Trump-presidency America already come into view.  We're seeing some of these things happening right now in Florida.  The example I'm about to share with you legitimately shocked me.",
    "url": "https://talkingpointsmemo.com/edblog/desantis-threatening-jail-time-for-running-abortion-rights-ads-in-florida"
  },
  {
    "text": "This Montana Senate candidate said his opponent ate ‘lobbyist steak.’ But he lobbied—with steak  —  During an October debate, Montana GOP Senate candidate Tim Sheehy denounced his Democratic opponent, Sen. Jon Tester, for \" eating lobbyist steak ″ while the Republican fought in Afghanistan.",
    "url": "https://apnews.com/article/montana-republican-tim-sheehy-jon-tester-senate-race-democrat-wildfire-steak-c1408993f0b93cd851ec1a1daba6b096"
  },
  {
    "text": "3% of American High Schoolers Identify as Transgender, First National Survey Finds  —  A survey by the C.D.C. found high rates of sadness, bullying and suicide attempts among transgender and gender-questioning teenagers.  —  About 3.3 percent of high school students identify as transgender … ",
    "url": "https://www.nytimes.com/2024/10/08/health/transgender-teenagers-cdc-survey.html"
  }
]