[
  {
    "text": "Congress has already disqualified Trump from the ballot  —  Editor's Note: Tristan Snell is author of the new book “Taking Down Trump: 12 Rules for Prosecuting Donald Trump by Someone Who Did it Successfully.”  He is a lawyer and legal commentator who has appeared on MSNBC and CNN … ",
    "url": "https://www.cnn.com/2024/02/08/opinions/trump-supreme-court-oral-arguments-election-snell/"
  },
  {
    "text": "What to know about the lawyers arguing the Trump ballot case at Supreme Court  —  The Supreme Court is hearing oral arguments Thursday as former President Trump's lawyers appear before the justices in an attempt to knock down lawsuits challenging the Republican front-runner's ballot eligibility under the 14th Amendment.",
    "url": "https://thehill.com/regulation/court-battles/4456001-what-to-know-about-lawyers-arguing-the-trump-ballot-case-at-supreme-court/"
  },
  {
    "text": "Loyalty is a one-way street in Donald Trump's GOP.  Just ask Ronna McDaniel  —  The Republican National Committee chair is expected to step down this spring.  —  For seven tumultuous years, Ronna McDaniel accomplished a feat that eluded almost everyone else in Donald Trump's orbit: She held on.",
    "url": "https://www.politico.com/news/2024/02/08/ronna-mcdaniel-trump-step-down-00140291"
  },
  {
    "text": "Trump's ‘Knock on the Door’  —  Confrontations over immigration and border security are moving to the center of the struggle between the two parties, both in Washington, D.C., and beyond.  And yet the most explosive immigration clash of all may still lie ahead.",
    "url": "https://www.theatlantic.com/politics/archive/2024/02/trumps-immigration-plan-is-even-more-aggressive-now/677385/"
  },
  {
    "text": "GOP leaders face unrest amid chaotic, bungled votes  —  Former president Donald Trump has used his perch as the GOP frontrunner to bend Congress to his political whims  —  Moments before pandemonium broke out on the House floor on Tuesday evening, House Majority Whip Tom Emmer approached Rep. Ken Buck … ",
    "url": "https://www.washingtonpost.com/politics/2024/02/07/republicans-disarray-house-senate-border/"
  },
  {
    "text": "Joe Biden is currently losing the election  —  I try not to spend my days being a doomer or a catastrophist, but in both casual and formal conversations I've come to think that there is one very basic point about politics in 2024 that is being broadly underrated — Joe Biden is currently … ",
    "url": "https://www.slowboring.com/p/joe-biden-is-currently-losing-the"
  },
  {
    "text": "Shocker: Republicans Admit in Private That They Killed a Good Deal … In an extraordinary spectacle, virtually all Senate Republicans joined together Wednesday to block a bipartisan bill that would have given Republicans much of what they wanted on border security.  Why?  Because Donald Trump told them to.",
    "url": "https://newrepublic.com/article/178860/republicans-border-deal-michael-bennet"
  },
  {
    "text": "Fox News praises vigilante group for a takedown of migrant “shoplifter.”  Law enforcement say the man was neither a shoplifter nor a recent migrant.  —  Update: Fox guest Curtis Sliwa told the AP that he had believed the man was a migrant because he was “speaking Spanish”",
    "url": "https://www.mediamatters.org/sean-hannity/fox-news-praises-vigilante-group-takedown-migrant-shoplifter-law-enforcement-say-man"
  },
  {
    "text": "An NYC vigilante group tackled what they claimed was a shoplifting ‘migrant’ live on Fox News.  They were wrong.  —  Fox News host Sean Hannity on Tuesday night was interviewing the founder of a New York City-based vigilante group known for its targeting of migrants when a disturbance suddenly broke out behind the live shot.",
    "url": "https://www.cnn.com/2024/02/07/media/new-york-city-vigilante-group-fox-news/"
  },
  {
    "text": "How Mark Meadows Became the Least Trusted Man in Washington  —  The untold story of the rise and fall of Trump's former chief of staff — and his role in the prosecutions that may determine the 2024 election.  —  On most Monday mornings, Mark Meadows commutes from his home in South Carolina to his workplace in Washington.",
    "url": "https://www.nytimes.com/2024/02/08/magazine/mark-meadows-trump-prosecution.html"
  },
  {
    "text": "Authorities investigating online threats made to potential witness related to Trump classified docs case  —  The threats are cited in a court filing from the special prosecutor.  —  Former President Donald Trump arrives at the New York State Supreme Court in New York, on Oct. 2, 2023.",
    "url": "https://abcnews.go.com/US/authorities-investigating-online-threats-made-potential-witness-trump/story?id=107057357"
  },
  {
    "text": "Bounced cheques and Trump's ‘unpaid fees’: Rudy Giuliani lays bare his finances in bankruptcy hearing  —  Over three hours in the fifth-floor room of a court building, Donald Trump's one-time attorney reeled off a list of assets that revealed the strained state of his finances, from a Bronx storage unit to a $1m tax bill.",
    "url": "https://www.the-independent.com/news/world/americas/us-politics/rudy-giuliani-bankruptcy-hearing-donald-trump-b2492575.html"
  },
  {
    "text": "Tucker Carlson's Fatal Attraction  —  The right-wing conspiracy monger shares Putin's worldview.  —  THE TITLE OF MY 2003 BOOK, Useful Idiots, was a reference to a perhaps apocryphal quote sometimes attributed to Lenin to the effect that gullible liberals in the West would prove useful idiots for the Soviet Union.",
    "url": "https://plus.thebulwark.com/p/tucker-carlsons-fatal-attraction"
  },
  {
    "text": "Biden Confuses European Leaders, Swaps Kohl and Merkel  — Mistake comes days after confusing France's Macron, Mitterrand  — Biden, 81, battling concerns over his age in reelection bid  —  President Joe Biden once again mixed up European leaders, twice conflating former German Chancellor Helmut Kohl … ",
    "url": "https://www.bloomberg.com/news/articles/2024-02-08/biden-again-confuses-european-leaders-swapping-kohl-and-merkel"
  },
  {
    "text": "Scientists just set a nuclear fusion record in a step toward unleashing the limitless, clean energy source  —  Scientists and engineers near the English city of Oxford have set a nuclear fusion energy record, they announced Thursday, bringing the clean, futuristic power source another step closer to reality.",
    "url": "https://www.cnn.com/2024/02/08/climate/nuclear-fusion-energy-milestone-climate"
  },
  {
    "text": "Zelensky Removes His Top General, in Major Shake-Up of Ukraine Military  —  Gen. Valery Zaluzhny led the effort that thwarted Russia's initial assault on Kyiv.  But his troops have struggled to make progress recently, and tensions have mounted with the civilian leadership.",
    "url": "https://www.nytimes.com/2024/02/08/world/europe/zelensky-general-valery-zaluzhny-ukraine-military.html"
  },
  {
    "text": "America's Favorite Cookie Takes a Hard Left Turn  —  Nothing is immune to woke ideology, not even cookies.  —  Oreo's latest partnership signifies a disturbing trend in U.S. corporations advancing the LGBTQ+ agenda, as far-left ideologues impose it on children through programs … ",
    "url": "https://townhall.com/tipsheet/miacathell/2024/02/07/oreo-pflag-campaign-n2634860"
  }
]