[
  {
    "text": "JD Vance got a former professor to delete a blog post Vance wrote in 2012 attacking GOP over anti-immigrant rhetoric  —  A week after President Barack Obama won reelection in November 2012, JD Vance, then a law student at Yale, wrote a scathing rebuke of the Republican Party's stance on migrants … ",
    "url": "https://www.cnn.com/2024/09/17/politics/jd-vance-delete-2012-blog-post-attacking-gop-anti-immigrant-rhetoric/"
  },
  {
    "text": "A quick explanation of how bomb threats work, to help JD Vance  —  There were a number of threats to people and places in Springfield, Ohio, after Vance and Trump made false claims about Haitian immigrants.  The media isn't to blame.  —  It's important to establish a timeline on what happened … ",
    "url": "https://www.washingtonpost.com/politics/2024/09/17/vance-trump-springfield-ohio-threats/"
  },
  {
    "text": "J.D. Vance's Admission Shouldn't Shock You—They've Done This for Years  —  There was some surprise on Sunday when vice presidential nominee J.D. Vance argued that the “American media totally ignored” the plight of Springfield and Vance's own claims about immigration “until Donald Trump and I started talking about cat memes.”",
    "url": "https://newrepublic.com/article/185992/jd-vance-springfield-ohio-spread-lies-haitians"
  },
  {
    "text": "Senate Republicans again block legislation to guarantee women's rights to IVF  —  Republicans have blocked for a second time this year legislation to establish a nationwide right to in vitro fertilization, arguing that the vote is an election-year stunt after Democrats forced a vote on the issue.",
    "url": "https://apnews.com/article/senate-ivf-vote-trump-harris-1bb3d09855a23802045fe7e6a5696561"
  },
  {
    "text": "Hezbollah hit by a wave of exploding pagers and blames Israel.  At least 9 dead, thousands injured … Pagers used by hundreds of members of the militant group Hezbollah exploded near simultaneously in Lebanon and Syria on Tuesday, killing at least nine people — including an 8-year-old girl … ",
    "url": "https://apnews.com/article/lebanon-hezbollah-israel-exploding-pagers-8893a09816410959b6fe94aec124461b"
  },
  {
    "text": "Dozens of Hezbollah members wounded in Lebanon when pagers exploded, sources and witnesses say  —  At least eight people were killed and 2,750 others including Hezbollah fighters, medics and Iran's envoy to Beirut were wounded on Tuesday when the pagers they use to communicate exploded across Lebanon … ",
    "url": "https://www.reuters.com/world/middle-east/dozens-hezbollah-members-wounded-lebanon-when-pagers-exploded-sources-witnesses-2024-09-17/"
  },
  {
    "text": "Hezbollah Pagers Explode in Apparent Attack Across Lebanon  —  Eight people were killed and 2,750 wounded, country's health minister says  —  BEIRUT—Pagers carried by thousands of Hezbollah operatives exploded at about the same time Tuesday afternoon in what appeared to be an unprecedented attack … ",
    "url": "https://www.wsj.com/world/middle-east/hundreds-of-hezbollah-operatives-pagers-explode-in-apparent-attack-across-lebanon-cf31cad4?st=trumvlry6nd9rff&reflink=article_copyURL_share"
  },
  {
    "text": "Judge Aileen Cannon Failed to Disclose a Right-Wing Junket  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up to receive our biggest stories as soon as they're published.  —  Federal Judge Aileen M. Cannon, the controversial jurist who tossed … ",
    "url": "https://www.propublica.org/article/judge-aileen-cannon-trump-documents-case-travel-disclosures"
  },
  {
    "text": "Judge Who Tossed Trump's Docs Case Repeatedly Violated Disclosure Rule: Report  —  Florida Judge Aileen Cannon failed to disclose lavish trips hosted by influential conservative law school  —  FLORIDA DISTRICT COURT Judge Aileen Cannon failed to disclose her attendance at several right-wing … ",
    "url": "https://www.rollingstone.com/politics/politics-news/aileen-cannon-disclosure-reports-trips-1235104678/"
  },
  {
    "text": "The FBI is investigating suspicious packages sent to election officials in more than 15 states  —  The FBI and the U.S. Postal Inspection Service on Tuesday were investigating the origin of suspicious packages that have been sent to or received by elections officials in more than 15 states … ",
    "url": "https://apnews.com/article/elections-workers-security-suspicious-packages-e3400b1e86bc02f7345d9970ef356bec"
  },
  {
    "text": "Russia propaganda group behind fake Kamala Harris hit-and-run story, says Microsoft  —  Microsoft researchers found that the group created a video, paid an actor to appear as the alleged victim, and spread the claim through a fake website  —  A false claim circulating on social media … ",
    "url": "https://www.theguardian.com/us-news/2024/sep/18/kamala-harris-fake-hit-run-story-russia-propaganda-storm-1516"
  },
  {
    "text": "Harris refuses to veer off script in her second high-profile interview  —  Harris' appearance at the NABJ event follows Donald Trump's combative sit-down interview with the association.  —  PHILADELPHIA — Kamala Harris largely stuck to her script during an interview Tuesday with a panel … ",
    "url": "https://www.politico.com/news/2024/09/17/kamala-harris-interview-nabj-00179695"
  },
  {
    "text": "Trump traps Senate GOP with flip-flop on taxes … - They'll have to harmonize their own positions — in real time — with a president who is constantly changing his.  —  Trump posted he would “get SALT back.”  — That's a strong indication he wants to let those in high-tax states deduct … ",
    "url": "https://www.axios.com/2024/09/18/trump-salt-tax-cuts-senate"
  },
  {
    "text": "A records flaw could block thousands in Arizona from voting in state and local races  —  Election officials in Arizona have discovered a flaw in the state's voter registration system that could disqualify nearly 100,000 people from voting in state and local races just weeks before early ballots will hit mailboxes.",
    "url": "https://www.npr.org/2024/09/17/nx-s1-5116592/arizona-election-citizenship-records-dmv"
  },
  {
    "text": "Trump: When I Win, The People Who Tried To Defeat Me Are Going To Prison  —  He's openly calling for rigging the election via voter intimidation, in a truly classic example of Every Accusation is a Confession: … To continue to treat this as a normal election, the media have to either ignore … ",
    "url": "https://www.lawyersgunsmoneyblog.com/2024/09/trump-when-i-win-the-people-who-tried-to-defeat-me-are-going-to-prison"
  },
  {
    "text": "J.D. Vance Reveals How Trump Will Use Musk to Target Social Security  —  J.D. Vance's recent comments regarding Elon Musk's potential role in a second Trump administration are ringing alarm bells for some.  —  In the past few weeks, Trump has confirmed that he plans to create … ",
    "url": "https://newrepublic.com/post/186059/jd-vance-reveals-trump-will-use-musk-target-social-security"
  },
  {
    "text": "Elon Musk Shared Memes Made by FSB Propaganda Machine  —  EGG ON YOUR FACE  —  A journalistic investigation has revealed that the content was generated by a Russian propaganda machine set up to sow discord over the war in Ukraine.  —  DENIED  —  A Manhattan court rejected Maxwell's argument that she was protected from prosecution.",
    "url": "https://www.thedailybeast.com/billionaire-tesla-ceo-elon-musk-shared-memes-made-by-fsb-propaganda-machine"
  }
]