[
  {
    "text": "On the Campaign Trail, Elon Musk Juggled Drugs and Family Drama  —  As Mr. Musk entered President Trump's orbit, his private life grew increasingly tumultuous and his drug use was more intense than previously known.  —  As Elon Musk became one of Donald J. Trump's closest allies last year … ",
    "url": "https://www.nytimes.com/2025/05/30/us/elon-musk-drugs-children-trump.html?unlocked_article_code=1.LE8.YA7T.1z0vkogrzeCV&smid=url-share"
  },
  {
    "text": "Trump's Angry New Tirade Over Tariff Ruling Accidentally Says Too Much  —  President Donald Trump's angry, unhinged rant on Truth Social over this week's judicial ruling against his tariffs is getting attention for its fury at Leonard Leo, the mastermind of the conservative takeover of the courts.",
    "url": "https://newrepublic.com/article/195931/trump-angry-tirade-tariff-ruling"
  },
  {
    "text": "A Victory for Separation of Powers … Wednesday's unanimous ruling against President Donald Trump's expansive “Liberation Day” tariffs by the United States Court of International Trade wasn't merely a victory for the businesses and consumers opposed to the policy.",
    "url": "https://www.theatlantic.com/ideas/archive/2025/05/trump-tariffs-separation-powers/682982/?gift=GETxgkzAqEYlT7d6KgZ8RSM3cShsuym5vtuMw0SqX0Q&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Supreme Court Allows Trump Administration, for Now, to End Biden-Era Migrant Program  —  The Trump administration had asked the court to allow it to end deportation protections for more than 500,000 people facing dire humanitarian crises in their home countries.",
    "url": "https://www.nytimes.com/2025/05/30/us/politics/trump-immigration-supreme-court.html"
  },
  {
    "text": "Supreme Court hands Trump win on revoking parole for 500K foreign nationals  —  The Supreme Court on Friday stayed a lower court order that blocked the Trump administration from deporting roughly 500,000 migrants from Cuba, Nicaragua, and Venezuela.  The decision is a near-term victory … ",
    "url": "https://www.foxnews.com/politics/supreme-court-hands-trump-win-revoking-parole-500k-foreign-nationals"
  },
  {
    "text": "Supreme Court allows Trump to revoke legal status of 500,000 immigrants  —  A federal judge had blocked the administration from immediately ending temporary status granted by the Biden administration to people from Cuba, Haiti, Nicaragua and Venezuela.  —  WASHINGTON — The Supreme Court … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-allows-trump-revoke-legal-status-500000-immigrants-rcna207271"
  },
  {
    "text": "Elon Musk's Legacy Is Disease, Starvation and Death  —  There is an Elon Musk post on X, his social media platform, that should define his legacy.  “We spent the weekend feeding USAID into the wood chipper,” he wrote on Feb. 3.  He could have “gone to some great parties.  Did that instead.”",
    "url": "https://www.nytimes.com/2025/05/30/opinion/elon-musk-doge-usaid.html?unlocked_article_code=1.LE8.M8Vw.raMdU_L48AEh&smid=bs-share"
  },
  {
    "text": "DOGE Is Busier Than Ever—and Trump Says Elon Musk Is ‘Really Not Leaving’  —  Federal workers from six agencies tell WIRED that DOGE-style work is escalating in their departments as both new and familiar DOGE faces have appeared in meetings and at new offices.",
    "url": "https://www.wired.com/story/doge-elon-musk-really-not-leaving/"
  },
  {
    "text": "Republican Sen. Joni Ernst defends proposed Medicaid cuts: ‘We all are going to die’  —  Her comment came in response to an attendee who yelled that proposed GOP cuts to Medicaid would cost lives.  —  Sen. Joni Ernst, R-Iowa, was repeatedly pressed on cuts to Medicaid in the House's budget bill … ",
    "url": "https://www.nbcnews.com/politics/congress/republican-sen-joni-ernst-defends-proposed-medicaid-cuts-are-going-die-rcna209972"
  },
  {
    "text": "Trump fires director of the National Portrait Gallery  —  It was unclear if Trump can dismiss Smithsonian leaders.  The termination of Kim Sajet marks the president's first action against an institution he has vowed to purge of “anti-American ideology.”",
    "url": "https://www.washingtonpost.com/entertainment/art/2025/05/30/trump-portrait-gallery-director/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ4NTc3NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ5OTU5OTk5LCJpYXQiOjE3NDg1Nzc2MDAsImp0aSI6IjlhY2M0YmY3LWU0NWMtNDc3Yi1iYWNiLTlhMWEzY2NlNTFjZCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9lbnRlcnRhaW5tZW50L2FydC8yMDI1LzA1LzMwL3RydW1wLXBvcnRyYWl0LWdhbGxlcnktZGlyZWN0b3IvIn0.JMNXcOKfpJPI6uL_EtSH2ZQHmJQJX189dqyYYepvb00&itid=gfta"
  },
  {
    "text": "Trump Administration Knew Vast Majority of Venezuelans Sent to Salvadoran Prison Had Not Been Convicted of U.S. Crimes  —  Homeland Security records reveal that officials knew that more than half of the 238 deportees were labeled as having no criminal record in the U.S. and had only violated immigration laws.",
    "url": "https://www.propublica.org/article/trump-el-salvador-deportees-criminal-convictions-cecot-venezuela"
  },
  {
    "text": "Trump Says He Will Consider Pardoning Diddy  —  BEG YOUR PARDON!  —  The president knows the shamed rap mogul and wants to know the facts of the case.  —  Donald Trump refused to dismiss the possibility of a pardon for Sean “Diddy” Combs, even though the rap tycoon is currently on trial on sex trafficking and other serious charges.",
    "url": "https://www.thedailybeast.com/trump-says-he-will-consider-pardoning-diddy/"
  },
  {
    "text": "Trump Taps Palantir to Compile Data on Americans … Alex Karp, a co-founder and the chief executive of Palantir, at a forum in Washington in April.  The Trump administration has expanded Palantir's work across the federal government.Caroline Gutman for The New York Times",
    "url": "https://www.nytimes.com/2025/05/30/technology/trump-palantir-data-americans.html?unlocked_article_code=1.LE8.jmh8.yvBmMb_-hjDt&smid=url-share"
  },
  {
    "text": "Contradicting RFK Jr., CDC keeps recommending covid vaccine for kids  —  Earlier this week, the Health and Human Services secretary said that healthy children did not need to get vaccinated for coronavirus.  —  Coronavirus vaccines are still recommended for healthy children if their doctors approve … ",
    "url": "https://www.washingtonpost.com/health/2025/05/30/covid-vaccines-children-pregnant-women/"
  },
  {
    "text": "California opens inquiry into Paramount and Trump  —  The Scoop  —  The California State Senate has invited two former top CBS figures to testify in a new inquiry into whether the network's parent company has violated state laws against bribery and unfair competition.",
    "url": "https://www.semafor.com/article/05/30/2025/california-opens-inquiry-into-paramount-and-trump"
  },
  {
    "text": "White House convenes meeting to brainstorm new Harvard measures  —  The push comes as the White House regroups after a federal judge blocked its move to bar Harvard from enrolling international students.  —  The Trump administration is escalating its campaign against Harvard University … ",
    "url": "https://www.politico.com/news/2025/05/30/white-house-convenes-meeting-to-brainstorm-new-harvard-measures-00376782"
  },
  {
    "text": "White House MAHA Report may have garbled science by using AI, experts say  —  The report, led by Health and Human Services Secretary Robert F. Kennedy Jr., was intended to address the reasons for the decline in Americans' life expectancy.  —  Some of the citations that underpin the science … ",
    "url": "https://www.washingtonpost.com/health/2025/05/29/maha-rfk-jr-ai-garble/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ4NDkxMjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ5ODczNTk5LCJpYXQiOjE3NDg0OTEyMDAsImp0aSI6ImRkYjA5MGM2LTMwOWYtNGM1Yy05ZjFhLTg5NGE5YTExYjI4YSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9oZWFsdGgvMjAyNS8wNS8yOS9tYWhhLXJmay1qci1haS1nYXJibGUvIn0.lM9qXGU1VCNEkRwoHXwttIMXn_8C1nzS0y01wlsLEeA"
  },
  {
    "text": "State begins rolling out expanded student visa vetting — starting with Harvard  —  The State Department issued instructions to consulates and embassies late Thursday telling them to start the vetting immediately.  —  The State Department has told U.S. consulates and embassies … ",
    "url": "https://www.politico.com/news/2025/05/30/state-implements-reviews-of-harvard-visa-applicants-social-media-accounts-00375921"
  },
  {
    "text": "USDA Employee and Others Charged in $66 Million SNAP Fraud Scheme  —  A U.S. Department of Agriculture (USDA) worker and five other individuals are accused in a massive food stamp fraud scheme.  —  The suspects in the case were identified as Michael Kehoe, Mohamad Nawafleh, Omar Alrawashdeh … ",
    "url": "https://www.breitbart.com/crime/2025/05/30/usda-employee-others-charged-66-million-snap-fraud-scheme/"
  },
  {
    "text": "Why Are Republicans Planning to Tax University Endowments More Heavily Than Other Forms of Private Wealth?  —  There isn't a legitimate public purpose.  The intent is punitive and political.  —  A view of the Harvard University campus on May 24, 2025, in Cambridge, Massachusetts",
    "url": "https://prospect.org/education/2025-05-30-why-republicans-planning-to-tax-university-endowments/"
  },
  {
    "text": "Federal Authorities Probe Effort to Impersonate White House Chief of Staff  —  An unknown individual impersonated Susie Wiles in calls and texts to prominent Republicans and business executives  —  WASHINGTON—Federal authorities are investigating a clandestine effort to impersonate White House chief … ",
    "url": "https://www.wsj.com/politics/policy/federal-authorities-probe-effort-to-impersonate-white-house-chief-of-staff-65da0d59?st=gJtJuu"
  },
  {
    "text": "Biden Responds To Book: “I'm Mentally Incompetent, I Can't Walk, And I Could Beat The Hell Outta Both Of Them”  —  Former President Biden spoke to reporters on Friday at a public event in Delaware, where he offered his first comments since announcing he has prostate cancer and the publication … ",
    "url": "https://www.realclearpolitics.com/video/2025/05/30/biden_to_cnn_prognosis_is_good_i_cant_walk_but_i_can_beat_the_hell_out_of_jake_tapper.html"
  },
  {
    "text": "Gov. Jared Polis vetoes bill that would have banned algorithm that White House said drove up Denver rents  —  Bill was one of 4 vetoed by Colorado governor on Thursday — and 11th this year  —  Gov. Jared Polis vetoed legislation Thursday that would have banned the use of rent-setting algorithms … ",
    "url": "https://www.denverpost.com/2025/05/30/rent-setting-algorithm-bill-veto-polis/"
  }
]