[
  {
    "text": "Trump suggests his plan for Gaza Strip is to ‘clean out the whole thing’  —  President Donald Trump indicated Saturday that he had spoken with the king of Jordan about a potential plan to construct housing and move more than 1 million Palestinians from the Gaza Strip to other countries … ",
    "url": "https://www.cnn.com/2025/01/25/politics/trump-gaza-strip-jordan-egypt/"
  },
  {
    "text": "Trump Says He Wants Jordan and Egypt to Take in Palestinians From Gaza  —  President Trump said he had spoken to Jordan's leader and planned to call Egypt's on Sunday.  Most of Gaza's two million residents have been displaced in 15 months of fighting.  —  President Trump said he told King Abdullah II … ",
    "url": "https://www.nytimes.com/2025/01/25/us/politics/trump-palestinians-jordan-egypt-refugees.html"
  },
  {
    "text": "Trump wants Jordan and Egypt to accept more Palestinian refugees and floats plan to ‘clean out’ Gaza  —  President Donald Trump said Saturday he would like to see Jordan, Egypt and other Arab nations increase the number of Palestinian refugees they are accepting from the Gaza Strip … ",
    "url": "https://apnews.com/article/trump-biden-israel-bomb-gaza-hamas-war-023b36984c6116c128b5e47f117bba2a"
  },
  {
    "text": "White House tells Republicans to get behind Trump's nominees — or face political ‘consequences’  —  More Trump nominees with potentially rocky paths to confirmation face hearings in the Senate this week, including Tulsi Gabbard, Robert F. Kennedy Jr. and Kash Patel.",
    "url": "https://www.nbcnews.com/politics/donald-trump/white-house-republicans-trump-nominees-political-consequences-rcna189288"
  },
  {
    "text": "South Korea's Impeached Leader Is Indicted on Insurrection Charges  —  President Yoon Suk Yeol will stand trial along with his former defense minister and others who participated in his short-lived imposition of martial law.  —  South Korea's impeached and arrested president, Yoon Suk Yeol … ",
    "url": "https://www.nytimes.com/2025/01/26/world/asia/south-korea-yoon-indicted-martial-law.html?unlocked_article_code=1.sE4.ff0C.GsJc_fv1QiPE&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "‘I am terrified’: Workers describe the dark mood inside federal agencies  —  “I would love to leave, but I don't know where I'd go,” said one staffer.  —  President Donald Trump's executive orders targeting the federal workforce have injected a fresh wave of anxiety among employees across the bureaucracy … ",
    "url": "https://www.politico.com/news/2025/01/25/federal-workers-trump-dei-00200588"
  },
  {
    "text": "The 12 Democrats who make the most sense for 2028  —  There's a vacuum atop an adrift Democratic Party.  Here's who could fill it.  —  Democrats are adrift.  —  The 2024 election was closer than many people realize — and a lot closer than President Donald Trump claims.",
    "url": "https://www.washingtonpost.com/politics/2025/01/25/2028-democrats-whitmer-shapiro-harris-buttigieg/"
  },
  {
    "text": "Musk tells Germans to get over ‘past guilt’ in speech to far-right AfD rally  —  The tech billionaire and Trump adviser has drawn rebukes for repeatedly endorsing the AfD in the leadup to Germany's snap election next month.  —  Elon Musk made a virtual appearance at a rally for the far-right Alternative … ",
    "url": "https://www.politico.com/news/2025/01/25/musk-german-afd-rally-weidel-00200620"
  },
  {
    "text": "Exclusive: White House in talks to have Oracle and U.S. investors take over TikTok  —  The Trump administration is working on a plan to save TikTok that involves tapping software company Oracle and a group of outside investors to effectively take control of the app's global operations … ",
    "url": "https://www.npr.org/2025/01/25/g-s1-44779/tiktok-ban-deal-trump-oracle"
  },
  {
    "text": "C.I.A. Now Favors Lab Leak Theory to Explain Covid's Origins  —  A new analysis that began under the Biden administration is released by the C.I.A.'s new director, John Ratcliffe, who wants the agency to get “off the sidelines” in the debate.  —  The C.I.A. has said for years … ",
    "url": "https://www.nytimes.com/2025/01/25/us/politics/cia-covid-lab-leak.html?unlocked_article_code=1.sE4.POa5.MspHars29YXa&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Meta's Free-Speech Shift Made It Clear to Advertisers: ‘Brand Safety’ Is Out of Vogue  —  Social-media giant's loosening of speech restrictions is unsettling advertisers, who say a decade of efforts to protect their reputations is at risk  —  When Meta Platforms Chief Executive Mark Zuckerberg … ",
    "url": "https://www.wsj.com/business/media/meta-brand-safety-content-moderation-policy-changes-17308d9e?st=ZtbXpV"
  },
  {
    "text": "Trump says he believes US will ‘get Greenland’  —  President Donald Trump has said he believes the US will gain control of Greenland, after showing renewed interest in acquiring the autonomous Danish territory in recent weeks.  —  “I think we're going to have it,” he told reporters on Air Force … ",
    "url": "https://www.bbc.com/news/articles/crkezj07rzro"
  },
  {
    "text": "Expect record-high egg prices for most of the year  —  Americans can continue to expect high prices for eggs this year, new estimates show, due to the ongoing avian flu outbreak and inflation.  —  Egg prices are estimated to increase about 20% in 2025, compared to about 2.2% for food prices in general … ",
    "url": "https://www.cnn.com/2025/01/25/business/egg-prices-avian-flu-outbreak/"
  },
  {
    "text": "Trump's executive actions have more muscle this time around, but many are just posturing  —  The president's early actions are already enacting sweeping changes across the federal government.  But not all of them are likely to result in tangible change.  —  President Donald Trump's first week … ",
    "url": "https://www.politico.com/news/2025/01/26/trump-orders-tangible-posturing-006590"
  },
  {
    "text": "Kansas tuberculosis outbreak is now America's largest in recorded history  —  An ongoing tuberculosis outbreak in Kansas has become the largest in recorded history in the United States.  —  “Currently, Kansas has the largest outbreak that they've ever had in history,” Ashley Goss … ",
    "url": "https://www.cjonline.com/story/news/politics/government/2025/01/24/kansas-tuberculosis-outbreak-is-largest-in-recorded-history-in-u-s/77881467007/"
  },
  {
    "text": "They Were Waiting for Flights.  Then Trump Closed a Door for Afghan Allies.  —  An executive order has halted refugee flights for Afghans who supported the American mission in Afghanistan and had been approved to resettle in the U.S.  —  Nasir, a legal adviser to the Afghan Air Force during the war … ",
    "url": "https://www.nytimes.com/2025/01/25/world/asia/trump-executive-order-immigration-afghanistan.html"
  },
  {
    "text": "House Speaker Invites Trump to Address Congress on March 4  —  House Speaker Mike Johnson invited President Donald Trump to address a joint session of Congress on March 4, seeking to set the stage for his first major speech to lawmakers since he returned to the White House.",
    "url": "https://www.bloomberg.com/news/articles/2025-01-25/house-speaker-invites-trump-to-address-congress-on-march-4"
  }
]