[
  {
    "text": "Biden Tells Allies He Knows He Has Only Days to Salvage Candidacy  —  The president's conversations are the first indication that he is seriously considering whether he can recover after a devastating performance on the debate stage in Atlanta.  The White House said the report was false.",
    "url": "https://www.nytimes.com/2024/07/03/us/politics/biden-withdraw-election-debate.html"
  },
  {
    "text": "Trump Caught on Video Claiming ‘Broken-Down’ Biden Has Quit: 'It's Kamala'  —  ‘SO F***ING BAD’  —  In a leaked video, Trump offers a frank analysis of his rival's performance in the first presidential debate, calling Biden a “broken-down pile of cr*p.”  —  Donald Trump delivered … ",
    "url": "https://www.thedailybeast.com/donald-trump-caught-on-video-claiming-broken-down-joe-biden-has-quit-its-kamala"
  },
  {
    "text": "Biden wins crucial support of Democratic governors to continue campaign: 'We're going to have his back' - as it happened  —  This blog is now closed  —  ABC to air full Joe Biden interview on Friday Newsom on Biden: 'He's all in - and so am I'  —  Whitmer gives backing to Biden: 'He's in it to win it and I support him'",
    "url": "https://www.theguardian.com/us-news/live/2024/jul/03/biden-debate-democrats-kamala-harris-election-updates"
  },
  {
    "text": "Trump Widens Lead After Biden's Debate Debacle, Times/Siena Poll Finds  —  Donald Trump is ahead of President Biden by six percentage points among likely voters in a new national survey.  Overall, 74 percent of voters view him as too old for the job, an uptick since the debate.",
    "url": "https://www.nytimes.com/2024/07/03/us/politics/poll-debate-biden-trump.html"
  },
  {
    "text": "ABC News Moves Biden-Stephanopoulos Interview to Friday Primetime  —  George Stephanopoulos' coming interview with President Biden is too hot to delay.  —  ABC News said it will move an interview between the anchor and President Joe Biden to Friday evening, rather than waiting until Sunday morning … ",
    "url": "https://variety.com/2024/tv/news/abc-news-joe-biden-george-stephanopoulos-interview-friday-primetime-1236060518/"
  },
  {
    "text": "Netflix Co-founder Becomes One of the Biggest Democratic Donors to Call for Biden to Step Aside  —  A public declaration from a megadonor is another crack in the armor in the president's foundation of support.  —  Reed Hastings, the Netflix co-founder who in recent years has become … ",
    "url": "https://www.nytimes.com/2024/07/03/us/politics/reed-hastings-netflix-biden-withdraw.html"
  },
  {
    "text": "Biden tells governors he got a medical checkup  —  Two governors also expressed concern over whether the president could still carry their blue-leaning states.  —  President Joe Biden on Wednesday evening told more than 20 Democratic governors in a private meeting that he underwent … ",
    "url": "https://www.politico.com/news/2024/07/03/biden-tells-governors-he-got-a-medical-check-up-00166579"
  },
  {
    "text": "Biden Tells Governors That He Is Staying in the Race  —  At a meeting with Democratic governors at the White House, the president was grilled about the path forward as he worked to solidify support from elected leaders.  —  President Biden told a group of Democratic governors on Wednesday … ",
    "url": "https://www.nytimes.com/2024/07/03/us/politics/biden-governors-presidential-election-debate.html"
  },
  {
    "text": "Forcing Biden Out Would Have Only One Beneficiary: Trump  —  Joe Biden refuses to drop out of the presidential race even as some liberals, rattled by the incumbent's frightening debate performance last week, keep pressuring him to do so.  —  Who's surprised by that?",
    "url": "https://www.nytimes.com/2024/07/03/opinion/biden-harris-trump-democrats.html"
  },
  {
    "text": "Biden privately remains torn between defiance and acceptance amid calls to step aside  —  In some discussions, Biden has acknowledged that the blowback may grow too large to overcome, while in others he's been dismissive of any notion that he might walk away.",
    "url": "https://www.nbcnews.com/politics/2024-election/biden-privately-remains-torn-defiance-acceptance-debate-rcna160274"
  },
  {
    "text": "Trump Expands Lead Over Biden as Age Worries Grow, WSJ Poll Finds  —  The former president is now ahead by 6 points, with 80% saying the incumbent is too old to run",
    "url": "https://www.wsj.com/politics/elections/trump-expands-lead-over-biden-after-debate-as-voters-age-worries-grow-wsj-poll-finds-c3a793ab"
  },
  {
    "text": "The spinelessness of John Roberts  —  Chief Justice John Roberts doesn't want to lead.  He is, though, carefully setting up a path to allow the right-wing court to respond to whatever comes its way in 2025.  —  When it comes to leading, Chief Justice John Roberts has chosen: No.",
    "url": "https://www.lawdork.com/p/the-spinelessness-of-john-roberts"
  },
  {
    "text": "White House Reporters: Biden Handlers' ‘Credibility’ Is Shot  —  TELL THE TRUTH  —  One journalist said while Biden press reps' credibility had been “eroding” for a while, the lack of transparency over his health “has kind of been a bit of an iceberg falloff.”",
    "url": "https://www.thedailybeast.com/white-house-reporters-biden-handlers-credibility-is-shot"
  },
  {
    "text": "Some Mississippi legislative districts dilute Black voting power and must be redrawn, judges say  —  Three federal judges are telling Mississippi to redraw some of its legislative districts, saying the current ones dilute the power of Black voters in three parts of the state.",
    "url": "https://apnews.com/article/mississippi-black-voters-redistricting-cba182639773cb69d0d312a549fff004"
  },
  {
    "text": "Romanian ruling coalition agrees parliamentary, presidential election dates  —  Romania's ruling coalition of leftist Social Democrats and centre-right Liberals has agreed to hold a presidential election on Nov. 24 and Dec. 8, with parliamentary polls in between, they said on Thursday.",
    "url": "https://www.reuters.com/world/europe/romanian-ruling-coalition-agrees-parliamentary-presidential-election-dates-2024-07-04/"
  },
  {
    "text": "The Supreme Court Term That Fundamentally Changed America  —  Trump v. United States is a legal earthquake that belongs alongside Shelby County v. Holder, Plessy v. Ferguson and Dred Scott, one expert said.  —  As the dust settles from Trump v. United States, those paying attention look … ",
    "url": "https://talkingpointsmemo.com/news/supreme-court-immunity-trump"
  }
]