[
  {
    "text": "Judge Aileen Cannon Could Get Herself Booted From Trump's Classified Documents Case  —  The Trump-friendly judge is so obviously putting her thumb on the scales of justice in favor of the ex-president that she might not end up adjudicating the trial at all.",
    "url": "https://www.thedailybeast.com/judge-aileen-cannon-could-get-herself-booted-from-trumps-classified-documents-case"
  },
  {
    "text": "Judge in Trump classified documents case proposes ‘insane’ jury instructions, experts say  —  U.S. District Judge Aileen Cannon proposed to instruct jurors a president has sole authority to declare records personal, which legal experts say would amount to dismissing the case against Trump.",
    "url": "https://www.usatoday.com/story/news/politics/2024/03/19/donald-trump-classified-documents-jury-instructions/73027873007/"
  },
  {
    "text": "Trump needs a $464m bond in six days.  What if he can't get it?  —  The former president must pay the full amount in cash or secure a bond by 25 March  —  Donald Trump's lawyers are asking a New York court to put a $464m (£365m) fine in a civil fraud case on hold … ",
    "url": "https://www.bbc.com/news/world-us-canada-68609685"
  },
  {
    "text": "Nelson Peltz to vote for Donald Trump over fears of Joe Biden's ‘mental condition’  —  Billionaire disavowed ex-president after January 6 riot but plans to back him again in November election  —  Billionaire investor Nelson Peltz plans to vote for Donald Trump, saying his assessment … ",
    "url": "https://www.ft.com/content/5c460531-f261-4828-a7ae-6180bb275147"
  },
  {
    "text": "Divided Supreme Court lifts stay on a Texas law giving police broad powers to arrest migrants  —  A divided Supreme Court on Tuesday allowed Texas to begin enforcing a law that gives police broad powers to arrest migrants suspected of crossing the border illegally while a legal battle over the measure plays out.",
    "url": "https://apnews.com/article/supreme-court-migrant-arrests-texas-13ffaed316d16f42e928f6958f0658f2"
  },
  {
    "text": "Mexico Condemns Texas Law, and Says It Will Not Accept Deportations From the State  —  Mexico's top diplomat for North America rejected the Supreme Court's ruling, saying that immigration policy was something to be negotiated between federal governments.  —  Mexico will not accept deportations … ",
    "url": "https://www.nytimes.com/2024/03/19/us/mexico-texas-border-immigration.html"
  },
  {
    "text": "Trump-backed Bernie Moreno wins Ohio GOP Senate primary  —  Trump-backed candidate Bernie Moreno has won the Republican nomination for Senate in Ohio to face off against incumbent Sen. Sherrod Brown (D) this November, according to Decision Desk HQ.  —  Moreno, a former car dealership owner … ",
    "url": "https://thehill.com/homenews/campaign/4542855-bernie-moreno-donald-trump-ohio-primary-senate-matt-dolan/"
  },
  {
    "text": "Trump-backed Moreno wins Ohio Senate primary  —  His victory is a relief for the former president.  —  WESTLAKE, Ohio — Bernie Moreno, a former car dealer endorsed by Donald Trump, has won a three-way GOP primary for the right to take on Democratic Sen. Sherrod Brown in Ohio.",
    "url": "https://www.politico.com/news/2024/03/19/trump-backed-moreno-wins-ohio-senate-primary-00147945"
  },
  {
    "text": "Half of Haley voters in Ohio say they'd back Biden  —  The extent of intraparty challenges may matter in November.  —  President Joe Biden speaks about the economy, on March 19, 2024, in Las Vegas.  —  Two in 10 to as many as three in 10 Republican primary voters in Ohio continue … ",
    "url": "https://abcnews.go.com/Politics/half-haley-voters-ohio-back-biden/story?id=108290136"
  },
  {
    "text": "McCaul apologizes after telling GOP colleague to ‘go f—’ himself at hearing  —  Rep. Michael McCaul (R-Texas) apologized for hurling an expletive at a GOP colleague after growing frustrated during a House committee hearing Tuesday.  —  McCaul told Rep. Darrell Issa (R-Calif.) to “go f … ",
    "url": "https://thehill.com/homenews/house/4543218-mccaul-apologizes-after-telling-gop-colleague-to-go-f-himself-at-hearing/"
  },
  {
    "text": "Arizona lawmaker says she announced plans to get abortion to underscore out-of-touch laws  —  Democratic Sen. Eva Burch of Mesa told fellow lawmakers in a floor speech she was going to get an abortion because her pregnancy is no longer viable.  —  PHOENIX — A pregnant Arizona lawmaker … ",
    "url": "https://www.politico.com/news/2024/03/19/arizona-lawmaker-says-she-announced-plans-to-get-abortion-to-underscore-out-of-touch-laws-00147899"
  },
  {
    "text": "Jared Kushner says Gaza's ‘waterfront property could be very valuable’  —  Donald Trump's son-in-law also says Israel should bulldoze an area of the Negev desert and move Palestinians there  —  Jared Kushner has praised the “very valuable” potential of Gaza's “waterfront property” … ",
    "url": "https://www.theguardian.com/us-news/2024/mar/19/jared-kushner-gaza-waterfront-property-israel-negev"
  },
  {
    "text": "Biden wins Kansas Democratic primary  —  President Biden will win the Kansas Democratic presidential primary, according to Decision Desk HQ.  —  The Sunflower State offers 33 pledged delegates to the winner, with 11 delegates allocated based on the statewide result and 22 based on the results … ",
    "url": "https://thehill.com/homenews/campaign/4542838-biden-wins-kansas-democratic-primary/"
  },
  {
    "text": "Radicalized by the right: Elon Musk puts his conspiratorial thinking on display for the world to see  —  Editor's Note: A version of this article first appeared in the “Reliable Sources” newsletter.  Sign up for the daily digest chronicling the evolving media landscape here.",
    "url": "https://ca.finance.yahoo.com/news/radicalized-elon-musk-puts-conspiratorial-055858883.html"
  },
  {
    "text": "Climate researcher on what's causing the record rise in ocean temperatures  —  The World Meteorological Organization issued a red alert warning Tuesday about warming and climate change, saying 2024 is shaping up to be another record year.  One of the many worries about how the planet is changing … ",
    "url": "https://www.pbs.org/newshour/show/climate-researcher-on-whats-causing-the-record-rise-in-ocean-temperatures"
  },
  {
    "text": "Obama-appointee and liberal Illinois federal judge rules illegal migrants can carry guns legally  — US District Judge Sharon Johnson Coleman ruled earlier this month that an illegal immigrant could not be charged for carrying a loaded firearm  — The ruling comes as the Biden administration continues … ",
    "url": "https://www.dailymail.co.uk/news/article-13214823/Obama-liberal-Illinois-judge-illegal-migrants-guns.html"
  },
  {
    "text": "David Weiss Does Not Contest He Reneged on Hunter Biden's Plea Agreement to Chase Russian Lies  —  David Weiss has now had five opportunities to contest former Hunter Biden attorney Chris Clark's declaration that on June 6, Weiss personally discussed language to provide Hunter immunity … ",
    "url": "https://www.emptywheel.net/2024/03/19/david-weiss-does-not-contest-he-reneged-on-hunter-bidens-plea-agreement-to-chase-russian-lies/"
  },
  {
    "text": "Washington Supreme Court Rules That Bar Exam No Longer A Requirement To Practice Law, Cites Impact On “Marginalized Groups”  —  The Washington State Supreme Court has ruled that the bar exam is no longer a requirement for prospective lawyers.  On Friday, The Bar Licensure Task Force explained that the bar is … ",
    "url": "https://www.thepublica.com/washington-supreme-court-rules-that-bar-exam-no-longer-a-requirement-to-practice-law-cites-impact-on-marginalized-groups/"
  },
  {
    "text": "Climate models can't explain 2023's huge heat anomaly — we could be in uncharted territory … By - Gavin Schmidt 0  —  Gavin Schmidt is a climatologist and director of NASA's Goddard Institute for Space Studies in New York City.  —  You can also search for this author in  —  PubMed Google Scholar",
    "url": "https://www.nature.com/articles/d41586-024-00816-z"
  },
  {
    "text": "US Air Force says it conducted successful hypersonic weapon test  —  The U.S. Air Force said on Tuesday it had conducted a successful test of an air-launched hypersonic weapon in the Pacific Ocean.  —  The test was conducted on Sunday after a B-52 bomber left the island of Guam carrying … ",
    "url": "https://www.reuters.com/world/us/us-air-force-says-it-conducted-successful-hypersonic-weapon-test-2024-03-19/"
  },
  {
    "text": "Manchin warns Ukraine could be ‘worst atrocity in history’  —  Sen. Joe Manchin (D-W.Va.) urged Congress to pass Ukraine aid and warned that lack of assistance could lead to the embattled country facing the “worst atrocity in history.”  —  Machin's call for passing foreign assistance comes … ",
    "url": "https://thehill.com/homenews/senate/4543449-manchin-warns-ukraine-could-be-worst-atrocity-in-history/"
  }
]