[
  {
    "text": "Federal judge blocks Musk's DOGE from access to Treasury Department material  —  The judge also ordered Musk and his team to “immediately destroy any and all copies of material downloaded from Treasury Department's records and systems, if any.”  —  NEW YORK — A federal judge issued … ",
    "url": "https://www.washingtonpost.com/national-security/2025/02/07/trump-musk-government-efficiency-attorneys-general-lawsuit/"
  },
  {
    "text": "Judge Halts Access to Treasury Payment Systems by Elon Musk's Team  —  The order came in response to a lawsuit filed by 19 attorneys general accusing the president of failing to faithfully execute the nation's laws when he let DOGE comb through federal computer systems.",
    "url": "https://www.nytimes.com/2025/02/07/nyregion/attorneys-general-trump-musk-suit.html"
  },
  {
    "text": "Judge orders sweeping restriction on DOGE access to sensitive Treasury payment systems  —  The judge limited access to “civil servants with a need for access” who have “passed all background checks and security clearances.”  —  A federal judge on Saturday issued a sweeping block … ",
    "url": "https://www.politico.com/news/2025/02/08/judge-blocks-doge-team-treasury-department-elon-musk-00203248"
  },
  {
    "text": "NIH cuts billions of dollars in biomedical funding, effective immediately  —  The move halts a large slice of money for most universities and research institutions virtually overnight, imperiling vital research in everything from cancer to heart disease.  —  The Trump administration … ",
    "url": "https://www.washingtonpost.com/health/2025/02/08/nih-cuts-billions-dollars-biomedical-funding-effective-immediately/"
  },
  {
    "text": "Did Trump Quietly Kill a Sensitive Pentagon Probe into Elon Musk?  —  In December, more than a month before Donald Trump took the presidential oath of office, The New York Times reported a blockbuster scoop: Elon Musk and his SpaceX company had repeatedly failed to meet federal reporting requirements designed … ",
    "url": "https://newrepublic.com/article/191330/trump-quietly-kill-sensitive-pentagon-probe-elon-musk"
  },
  {
    "text": "Why Trump's in-your-face campaign will never end … - On Jan. 31, the Rapid Response account posted a message portraying House Minority Leader Hakeem Jeffries (D-N.Y.) as violent for promising that Democrats will “fight” Trump's agenda “legislatively... in the courts, and ... in the streets.”",
    "url": "https://www.axios.com/2025/02/08/trump-strategy-messaging-insults"
  },
  {
    "text": "How spending $153M to pay its bills put USAID in DOGE's crosshairs  —  Aides to the president and Elon Musk suspected USAID officials were trying to go around a funding freeze.  —  Pete Marocco was furious.  —  It was Thursday, Jan. 23, and the Trump administration official had discovered … ",
    "url": "https://www.politico.com/news/2025/02/08/usaid-trump-musk-doge-00203191"
  },
  {
    "text": "The real lesson of the DOGE racist tweets scandal  —  On Thursday, the Wall Street Journal reported that a staffer at the Department of Government Efficiency (DOGE) resigned after the paper inquired about some racist social media posts from an account linked to him.",
    "url": "https://www.vox.com/politics/398985/musk-doge-staffer-racist-tweets-vance-free-speech"
  },
  {
    "text": "Russell Vought takes the helm at CFPB as Musk's DOGE accesses key systems  —  Russell Vought, an architect of Project 2025 and the new director at the Office of Management and Budget, is now also the acting leader of the Consumer Finance Protection Bureau, according to a source familiar with the situation.",
    "url": "https://www.npr.org/2025/02/08/nx-s1-5290914/russell-vought-cfpb-doge-access-musk"
  },
  {
    "text": "Trump chops away at the government and the fallout is felt in the Virginia governor's race  —  The Trump administration's aggressive push to cut government jobs is reverberating in the early stages of this year's race for governor in Virginia.  The fast-moving effort by Republican President Donald … ",
    "url": "https://apnews.com/article/virginia-governors-race-earlesears-spanberger-federal-workers-94ee683b86836d83f1fbd97411cedfc8"
  },
  {
    "text": "Advocate of Jan. 6 Rioters Now Runs Office That Investigated Them  —  Ed Martin, a loyal Trump soldier, oversees the U.S. attorney's office, which is likely to help turn the investigative powers of the government on several of the president's perceived enemies.",
    "url": "https://www.nytimes.com/2025/02/08/us/ed-martin-us-attorneys-office-trump.html"
  },
  {
    "text": "Trump halts aid to South Africa, claiming discrimination against Afrikaners  —  His executive order accuses South Africa's government of seizing property from White landowners and calls for their resettlement as “refugees” in the U.S.  —  President Donald Trump on Friday signed … ",
    "url": "https://www.washingtonpost.com/politics/2025/02/08/trump-south-africa-aid-afrikaners/"
  },
  {
    "text": "'It's a Circus': Trump Unleashes Chaos at Key US Science Agency  —  Muddled directives and early-morning emails at NOAA, one of the world's top weather and climate forecasters, have put the agency on edge.  —  The email arrived in US government workers' inboxes just after 1 a.m. East Coast time on Friday … ",
    "url": "https://www.bloomberg.com/news/features/2025-02-08/trump-unleashes-chaos-at-noaa-us-weather-and-climate-agency?accessToken=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzb3VyY2UiOiJTdWJzY3JpYmVyR2lmdGVkQXJ0aWNsZSIsImlhdCI6MTczOTAyMTE3NiwiZXhwIjoxNzM5NjI1OTc2LCJhcnRpY2xlSWQiOiJTUkQ4NTdEV1JHRzAwMCIsImJjb25uZWN0SWQiOiI2M0I1MDYzMjkwODY0OTRDQjIzMThFMDVCOTBGMkMwNiJ9.NSlU1N5cABXOWkZTZ4kUnXGHXVivsTdx9rgITsmja_A"
  },
  {
    "text": "Measles outbreak expands in West Texas around county with low vaccination rate  —  A measles outbreak is growing in a rural area of West Texas where vaccination rates are well below the recommended level.  —  In late January, two children in Gaines County were hospitalized for measles.",
    "url": "https://www.cnn.com/2025/02/07/health/west-texas-measles-outbreak/"
  },
  {
    "text": "Trudeau Caught on Hot Mic Revealing Trump's Plans for Canada  —  Canadian Prime Minister Justin Trudeau told business leaders that U.S. President Donald Trump's interest in annexing Canada was a very real plan aimed at controlling the country's vast mineral resources.Trudeau was caught … ",
    "url": "https://www.thedailybeast.com/justin-trudeau-caught-on-hot-mic-revealing-trumps-plans-for-canada/"
  },
  {
    "text": "Who is helping Elon Musk gut the US government?  —  The billionaire's cost-cutting ‘Doge’ staff includes wealthy executives, far-right ideologues and young engineers  —  Elon Musk's rapid attempt to defund and depopulate the federal government has thrown US politics into chaos while the billionaire's … ",
    "url": "https://www.theguardian.com/us-news/2025/feb/08/elon-musk-doge-team-staff"
  },
  {
    "text": "Teen on Musk's DOGE Team Graduated from ‘The Com’  —  Wired reported this week that a 19-year-old working for Elon Musk's so-called Department of Government Efficiency (DOGE) was given access to sensitive US government systems even though his past association with cybercrime communities … ",
    "url": "https://krebsonsecurity.com/2025/02/teen-on-musks-doge-team-graduated-from-the-com/"
  },
  {
    "text": "Washington Has Given Up the Fight Against Kleptocrats.  Here's What Democracies Should Do  —  On Feb. 6, new U.S. Attorney General Pam Bondi issued a series of new directives from President Donald Trump's administration outlining her office's priorities.  Taken together, they represent … ",
    "url": "https://www.themoscowtimes.com/2025/02/07/washington-has-given-up-the-fight-against-kleptocrats-heres-what-democracies-should-do-a87912"
  },
  {
    "text": "The Mood of the American Consumer is Souring  —  Tariff threats, market turbulence causing jitters early in Trump's second term  —  The Trump bump in consumer confidence is already over.  —  Tariff threats, stock market swings and rapidly reversing executive orders are causing Americans across … ",
    "url": "https://www.wsj.com/economy/consumers/americans-jittery-over-inflation-university-of-michigan-survey-suggests-1476cf39?st=TL8YwU&reflink=article_copyURL_share"
  },
  {
    "text": "Now Is Not the Time to Tune Out  —  Don't get distracted.  Don't get overwhelmed.  Don't get paralyzed and pulled into the chaos that President Trump and his allies are purposely creating with the volume and speed of executive orders; the effort to dismantle the federal government … ",
    "url": "https://www.nytimes.com/2025/02/08/opinion/trump-musk-public-attention.html?unlocked_article_code=1.vU4.PGv6.3q5Z-7BwVfAs&smid=url-share"
  },
  {
    "text": "30K tons of food ‘going to waste’ in Houston after Trump halted aid  —  About 30,000 tons of food is stuck at a port in Houston after Trump halted foreign aid for 90 days.  The food, intended to feed people overseas, is stalled at a warehouse,the Houston Chronicle reported.",
    "url": "https://www.rawstory.com/30k-tons-of-food-going-to-waste-in-houston-after-trump-halted-aid/"
  },
  {
    "text": "Trump fires archivist of the United States, official who oversees government records  —  President Trump has fired Archivist of the United States Colleen J. Shogan, the government official responsible for preserving and providing access to government records.",
    "url": "https://www.cbsnews.com/news/trump-fires-archivist-of-the-united-states-colleen-shogan/"
  },
  {
    "text": "German court orders X to hand over election data in legal blow to Musk's platform  —  Researchers win a legal battle against the platform formerly known as Twitter, securing crucial access to social media data to probe potential election interference.  —  BERLIN — A German court handed Elon Musk's X … ",
    "url": "https://www.politico.eu/article/berlin-court-orders-x-hand-over-election-data-legal-blow-elon-musk-platform/"
  }
]