[
  {
    "text": "Trump Officials Blame Mistake for Setting Off Confrontation With Harvard  —  An official on the administration's antisemitism task force told the university that a letter of demands had been sent without authorization.  —  Harvard University received an emailed letter from the Trump administration … ",
    "url": "https://www.nytimes.com/2025/04/18/business/trump-harvard-letter-mistake.html?unlocked_article_code=1.A08.Qu-Z.-WTNuuYLOA1n&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Trump White House Lashes Out At Senator Who Visited Wrongly Deported Man In El Salvador  —  “GRANDSTANDER!!!” the president wrote on social media.  He later smeared the Maryland immigrant's character, as well.  —  President Donald Trump accused Sen. Chris Van Hollen of political grandstanding … ",
    "url": "https://www.huffpost.com/entry/trump-white-house-lashes-out-at-maryland-senator-who-visited-constituent-in-el-salvador_n_68026c75e4b058dd5962e704"
  },
  {
    "text": "Maryland Deportee Told Senator He Had Been in Isolation in El Salvador Prison  —  Senator Chris Van Hollen said that Kilmar Armando Abrego Garcia,who was deported and incarcerated in El Salvador, reported having been transferred after weeks in a maximum-security prison.",
    "url": "https://www.nytimes.com/2025/04/18/us/politics/abrego-garcia-chris-van-hollen-el-salvador.html?unlocked_article_code=1.Ak8.C8GQ.bqaPyFjEQ4jn&smid=url-share"
  },
  {
    "text": "Trump Touts Seemingly Doctored Photo of Abrego Garcia's Hand in Attempt To Prove Maryland Man Is Gang Member  —  President Donald Trump posted a photo of himself holding a seemingly digitally altered image of the left hand of Kilmar Abrego Garcia, who was wrongly deported to El Salvador last month.",
    "url": "https://www.mediaite.com/trump/trump-touts-seemingly-doctored-photo-of-abrego-garcias-hand-in-attempt-to-prove-maryland-man-is-gang-member/"
  },
  {
    "text": "Head of I.R.S. Is Ousted in Treasury's Power Struggle With Elon Musk  —  Treasury Secretary Scott Bessent complained to President Trump that the acting commissioner had been installed without his knowledge.  —  President Trump has replaced the acting commissioner of the Internal Revenue Service … ",
    "url": "https://www.nytimes.com/2025/04/18/us/politics/irs-scott-bessent-elon-musk.html?unlocked_article_code=1.Ak8.73ER.apF4cHc5pdP_&smid=url-share"
  },
  {
    "text": "Pentagon turmoil deepens: Top Hegseth aide leaves post  —  Other Defense Department officials were placed on leave earlier this week.  —  Joe Kasper, Defense Secretary Pete Hegseth's chief of staff will leave his role in the coming days for a new position at the agency … ",
    "url": "https://www.politico.com/news/2025/04/18/defense-secretary-chief-of-staff-joe-kasper-departure-00299508"
  },
  {
    "text": "Trump Advisers Took Advantage of Navarro's Absence to Push for Tariff Pause  —  Peter Navarro, an adviser to Trump in favor of wide-ranging tariffs, had been a fixture on the president's side after ‘Liberation Day’  —  They needed to get the president alone.  —  On April 9, financial markets were going haywire.",
    "url": "https://www.wsj.com/politics/policy/trump-tariff-pause-navarro-bessent-lutnick-b9e864fb?st=44RMeA&reflink=article_copyURL_share"
  },
  {
    "text": "Trump-Allied Prosecutor Sends Letters to Medical Journals Alleging Bias  —  An interim U.S. attorney is demanding information about the selection of research articles and the role of N.I.H. Experts worry this will have a chilling effect on publications.  —  A federal prosecutor has sent letters … ",
    "url": "https://www.nytimes.com/2025/04/18/health/trump-martin-us-attorney-medical-journals.html?unlocked_article_code=1.Ak8.EMaq.FgyJDGc6D7I_&smid=url-share"
  },
  {
    "text": "‘Lab Leak,’ a flashy page on the virus' origins, replaces government COVID sites  —  The White House has taken down some government websites providing COVID-19 information and replaced them with a new boldly styled page dedicated to the controversial theory that the pandemic was caused … ",
    "url": "https://www.npr.org/sections/shots-health-news/2025/04/18/g-s1-61324/lab-leak-white-house-covid-origins"
  },
  {
    "text": "Trump administration may form task force to handle China tariff impact  —  Trump administration officials, anticipating supply chain strains due to steep tariffs on Chinese goods, have discussed forming a working group to deal with the problems with urgency if there's no breakthrough with Beijing, multiple sources told CBS News.",
    "url": "https://www.cbsnews.com/news/trump-administration-china-tariff-task-force/"
  },
  {
    "text": "DOGE Is Building a Master Database to Surveil and Track Immigrants  —  DOGE is knitting together data from the Department of Homeland Security, Social Security Administration, and IRS that could create a surveillance tool of unprecedented scope.  —  Operatives from Elon Musk's so-called Department … ",
    "url": "https://www.wired.com/story/doge-collecting-immigrant-data-surveil-track/"
  },
  {
    "text": "Top Trump econ adviser says White House is studying ways to fire Powell  —  President Trump's top economic adviser told reporters Friday the White House is exploring how to fire Federal Reserve Chair Jerome Powell despite the legal guardrails on his position.",
    "url": "https://thehill.com/business/5256173-trump-exploring-firing-fed-chair/"
  },
  {
    "text": "Supreme Court blocks Alien Enemies Act deportation of Venezuelan men  —  The Trump administration was planning to deport at least 30 Venezuelan men under a rarely invoked wartime statute before the court ruled to temporarily halt it.  —  The U.S. Supreme Court ordered the Trump administration early Saturday … ",
    "url": "https://www.washingtonpost.com/immigration/2025/04/18/aclu-alien-enemies-deportations-trump/"
  },
  {
    "text": "The New America: Federal (ICE) Agents Boarding Trains?  —  As an attorney I'm deeply alarmed by an incident that occurred just this week and feel compelled to share it—to raise awareness of the legal and constitutional crossroads we are rapidly approaching.",
    "url": "https://weknowwhatsup.blogspot.com/2025/04/the-new-america-federal-ice-agents.html"
  },
  {
    "text": "The Women Who Think the World Needs More Babies  —  At a convention of the pronatalist movement, the relatively few women in attendance agreed: Motherhood needs a rebrand.  —  “We're going to fix the birthrate decline in this room,” said the dating app entrepreneur Amanda Bradford … ",
    "url": "https://www.nytimes.com/2025/04/17/style/women-pronatalist-movement.html?unlocked_article_code=1.Ak8.FsEx.EXozGCYjEktU&smid=url-share"
  },
  {
    "text": "Trump moves to invoke Schedule F to make it easier to fire some federal workers  —  President Donald Trump has begun making one of the controversial personnel changes for government employees that was spelled out in the conservative Project 2025 blueprint for his second term.",
    "url": "https://apnews.com/article/donald-trump-civil-service-workforce-e6e4cf979b910b0f89877a9a09e7c4a4"
  },
  {
    "text": "Barbara Lee wins Oakland mayor's race  —  Former Rep. Barbara Lee (D-Calif.) was projected to win a special election to become the next mayor of Oakland, according to Decision Desk HQ, in what became a closer-than-expected race amid growing voter dissatisfaction over the direction of the city.",
    "url": "https://thehill.com/homenews/campaign/5250054-barbara-lee-elected-oakland/"
  },
  {
    "text": "DOGE Visits National Gallery of Art to Discuss Museum's Legal Status  —  The move is the latest from Elon Musk's unofficial cost-cutting agency to exert influence beyond traditional federal agencies.  —  Representatives from Elon Musk's Department of Government Efficiency met with leadership … ",
    "url": "https://www.bloomberg.com/news/articles/2025-04-18/washington-dc-national-gallery-of-art-gets-a-visit-from-doge"
  },
  {
    "text": "Immigrants prove they are alive, forcing Social Security to undo death label  —  The immigrants are among more than 6,000 who were falsely added to a deaths database by DHS and the U.S. DOGE Service in a bid to pressure them to leave the United States.  —  Immigrants falsely labeled dead … ",
    "url": "https://www.washingtonpost.com/politics/2025/04/18/immigrants-dead-social-security-alive/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ0OTQ4ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ2MzMxMTk5LCJpYXQiOjE3NDQ5NDg4MDAsImp0aSI6IjA1NWY5NGJiLWE1M2UtNDk2MC1hMmExLTI5OTJhYWRmMDM2ZiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzA0LzE4L2ltbWlncmFudHMtZGVhZC1zb2NpYWwtc2VjdXJpdHktYWxpdmUvIn0.oCvuSF9ChTLwF38H1DMe2vay7BCg9D6oTSC_paYochs&itid=gfta"
  },
  {
    "text": "Trump's Justice Department Steps In for Him on E. Jean Carroll Appeal  —  JOINT MOTION  —  A federal jury ordered Trump to pay Carroll $83.3 million after ruling he defamed her denying her sexual abuse allegations.  —  The Justice Department is looking to intervene on behalf … ",
    "url": "https://www.thedailybeast.com/trumps-justice-department-steps-in-for-him-on-e-jean-carroll-appeal/"
  },
  {
    "text": "Video shows doctor with measles treating kids.  RFK Jr later praised him as an ‘extraordinary’ healer  —  A Texas doctor who has been treating children in a measles outbreak was shown on video with a measles rash on his face in a clinic a week before Health Secretary Robert F. Kennedy Jr. met … ",
    "url": "https://apnews.com/article/texas-measles-outbreak-rfk-jr-ben-edwards-2dd7c79d47c64ad2e6d4a4ac3c87ec1f"
  },
  {
    "text": "Attorney General Bondi's Claim that ‘Courts’ Have ‘Ruled’ that Abrego Garcia Is a Member of MS-13  —  I've previously posted on the absurd commentary of Salvadoran President Nayib Bukele and Secretary of State Marco Rubio at Tuesday's Oval Office confab.  Now, let's turn to Attorney General Pam Bondi.",
    "url": "http://www.nationalreview.com/corner/attorney-general-bondis-claim-that-courts-have-ruled-that-abrego-garcia-is-a-member-of-ms-13/"
  },
  {
    "text": "Rep. Andy Biggs announces death of daughter after cancer battle  —  Rep. Andy Biggs (R-Ariz.) announced Friday that his adult daughter Cosette died after battling cancer.  —  “Earlier this week, our daughter Cosette lost her battle with cancer.  We are devastated by her passing, but take comfort knowing she is at peace with the Lord.",
    "url": "https://thehill.com/homenews/house/5256273-andy-biggs-daughter-cancer/"
  },
  {
    "text": "For now, Pentagon and DHS won't recommend that Trump invoke the Insurrection Act  —  Defense Secretary Pete Hegseth and Homeland Security Secretary Kristi Noem will not recommend invoking the Insurrection Act in a memo the Pentagon and the Department of Homeland Security are preparing to send … ",
    "url": "https://cnn.com/2025/04/18/politics/pentagon-dhs-wont-recommend-insurrection-act/"
  },
  {
    "text": "Judge blocks Trump administration from passport changes affecting some transgender Americans  —  A federal judge on Friday partially blocked the Trump administration from enacting a policy that bans the use of “X” marker used by many nonbinary people on passports as well as the changing of gender markers.",
    "url": "https://apnews.com/article/transgender-passports-trump-executive-order-ee211c3298f0c6f561f829cf5adca281"
  },
  {
    "text": "The Bukele Playbook Trump Is Following  —  In some ways, the core character of the Trump administration can be seen in two Oval Office press conferences with two young, informally-dressed foreign leaders.  The first was with Volodymyr Zelensky, president of a country invaded and now partly occupied … ",
    "url": "https://andrewsullivan.substack.com/p/the-bukele-playbook-trump-is-following"
  },
  {
    "text": "You Cannot Appease Someone Who Intends to Destroy You  —  Last month, the law firm of Paul Weiss struck a deal with the White House, promising to donate $40 million in pro bono legal services to Trump-approved causes in order to avoid a cartoonishly unconstitutional executive order targeting the firm and its clients.",
    "url": "https://ballsandstrikes.substack.com/p/you-cannot-appease-someone-who-intends"
  },
  {
    "text": "A US citizen was held for pickup by ICE even after proving he was born in the country  —  A U.S. citizen was arrested in Florida for allegedly being in the country illegally and held for pickup by immigration authorities even after his mother showed a judge her son's birth certificate and the judge dismissed charges.",
    "url": "https://apnews.com/article/us-citizen-held-ice-florida-law-4b5f5d9c754b56c87d1d8b39dfedfc6c"
  },
  {
    "text": "DHS Releases Bombshell Investigative Report on Kilmar Abrego Garcia Suspected Human Trafficking Incident  —  WASHINGTON - Today, the Department of Homeland Security released a Homeland Security Investigations' Combined Intelligence Unit (CIU) Investigative Referral report on Kilmar Abrego Garcia.",
    "url": "https://www.dhs.gov/news/2025/04/18/dhs-releases-bombshell-investigative-report-kilmar-abrego-garcia-suspected-human"
  }
]