[
  {
    "text": "Voters Doubt Biden's Leadership and Favor Trump, Times/Siena Poll Finds  —  The share of voters who strongly disapprove of President Biden's handling of his job has reached 47 percent, higher than in Times/Siena polls at any point in his presidency.  —  President Biden is struggling … ",
    "url": "https://www.nytimes.com/2024/03/02/us/politics/biden-trump-times-siena-poll.html"
  },
  {
    "text": "Closing This Gap May Be Biden's Key to a Second Term  —  The president still has time to improve his standing on the economy, but that time isn't unlimited.  —  Just since last November, the most closely watched measure of consumer confidence about the economy has soared by about 25 percent.",
    "url": "https://www.theatlantic.com/politics/archive/2024/03/why-an-improving-economy-hasnt-helped-biden/677631/"
  },
  {
    "text": "Biden Is Still the Democrats' Best Bet for November  —  Let's start with the obvious.  The concerns about Joe Biden are valid: He's old.  He talks slowly.  He occasionally bumbles the basics in public appearances.  —  Biden's age is so concerning that many Biden supporters now believe … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/03/case-biden/677591/"
  },
  {
    "text": "As Trump's Criminal Trial Approaches, He May Be His Own Worst Enemy  —  In civil cases, Donald J. Trump has ordered attorneys around from the defense table and insisted on testifying.  The stakes will get higher March 25, when his first criminal case begins.",
    "url": "https://www.nytimes.com/2024/03/02/nyregion/donald-trump-lawyers.html"
  },
  {
    "text": "U.S. military aircraft airdrop thousands of meals into Gaza in emergency humanitarian aid operation  —  U.S. military C-13 cargo planes on Saturday dropped food in pallets over Gaza, three U.S. officials said, two days after more than 100 Palestinians who had surged to pull goods off an aid convoy … ",
    "url": "https://www.cbsnews.com/news/us-military-aircraft-airdrop-thousands-of-meals-into-gaza/"
  },
  {
    "text": "Israel-Hamas war live updates: Injured from aid convoy violence had gunshot wounds, U.N. says … The U.S. Air Force Central Command completed its first airdrop of 66 food pallets, holding roughly 38,000 meals, in Gaza this morning using three C130 aircrafts, officials told NBC News.",
    "url": "https://www.nbcnews.com/news/world/live-blog/israel-hamas-war-live-updates-rcna141493"
  },
  {
    "text": "House Republicans often vote no on spending, but love to add pet projects  —  Of the four congressional caucuses, House GOP has most money set aside for members' earmarks  —  Despite their public posture of advocating for lower government spending, House Republicans have billions more at stake … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/02/house-republicans-earmarks-government-funding/"
  },
  {
    "text": "Lawmakers eye looming ‘problematic’ funding bills  —  Congressional leaders are moving quickly to pass their first batch of bills to fund the government for most of 2024 by next Friday, but negotiators are already looking to a March 22 deadline when they say their tougher bills come due.",
    "url": "https://thehill.com/homenews/house/4502154-lawmakers-eye-looming-problematic-funding-bills/"
  },
  {
    "text": "Protester thrown to the ground after calling Joe Manchin “a sick f**k” to his face  —  Things got heated at a Harvard Institute of Politics event on Friday, with Manchin himself squaring up  —  During a Harvard Institute of Politics event held on Friday morning, a man described by some outlets … ",
    "url": "https://www.salon.com/2024/03/01/thrown-to-the-ground-after-calling-joe-manchin-a-sick-fk-to-his-face/"
  },
  {
    "text": "Yes, the Supreme Court COULD have declined the case, but then what?  —  “They could have just declined the case” is the overly simplistic but misleading version of Supreme Court law and practice being fed to laypersons by many celebrity television commentators who were rushed on air … ",
    "url": "https://blog.stephaniejones.com/2024/03/01/yes-the-supreme-court-could-have-declined-the-case-but-then-what/"
  },
  {
    "text": "The Fani Willis Evidentiary Hearing Was a Joke  —  The hearing to determine whether the Fulton County DA should be disqualified is literally is a product of one of the people under indictment.  —  (Permanent musical accompaniment to the last post of the week from the shebeen's favourite living Canadian.)",
    "url": "https://www.esquire.com/news-politics/politics/a60051168/fani-willis-hearing-fulton-county-da/"
  },
  {
    "text": "“Department of Life”: Trump allies plot abortion crackdown for second term … - Heritage's detailed plans underscore conservatives' long-held grievances toward the Department of Health and Human Services — at a time when they are well-positioned to sway abortion policy if Trump wins again.",
    "url": "https://www.axios.com/2024/03/02/heritage-foundation-trump-allies-abortion"
  },
  {
    "text": "Price fixing by algorithm is still price fixing  —  Landlords and property managers can't collude on rental pricing.  Using new technology to do it doesn't change that antitrust fundamental.  Regardless of the industry you're in, if your business uses an algorithm to determine prices … ",
    "url": "https://www.ftc.gov/business-guidance/blog/2024/03/price-fixing-algorithm-still-price-fixing"
  },
  {
    "text": "“Like someone pulled the metaphorical plug”: Dr. John Gartner on Trump's “accelerating dementia”  —  “Trump looks blank, stops in mid-sentence (or mid-word), his jaw goes a little slack”  —  Since at least 2016, some of the world's leading mental health professionals have been sounding … ",
    "url": "https://www.salon.com/2024/03/01/like-someone-pulled-the-metaphorical-plug-dr-john-gartner-on-accelerating-dementia/"
  },
  {
    "text": "Scoop: Biden's migrant backlog to hit 8 million by October, data reveal … The backlog has left millions of people living in uncertainty about whether they'll be allowed to stay in the U.S. — or facing deportation — often for years.  — The data show that while the backlog has exploded … ",
    "url": "https://www.axios.com/2024/03/02/data-biden-border-crisis-immigration-8-million-detention"
  },
  {
    "text": "Appeals court ruling means over 100 Jan. 6 rioters may be resentenced  —  More than 100 people convicted of participation in the Jan. 6, 2021, riot at the Capitol may have to be resentenced after a federal appeals court Friday overturned a sentencing enhancement used to help determine their punishments.",
    "url": "https://www.washingtonpost.com/dc-md-va/2024/03/01/appeal-obstruction-trump-january-sixth/"
  },
  {
    "text": "University of Florida eliminates all DEI positions due to new state rules  —  The memo cites recent state restrictions on the use of public funds.  —  University of Florida Century Tower and University Auditorium, Gainesville, Florida.  —  The University of Florida has eliminated all diversity … ",
    "url": "https://abcnews.go.com/Politics/university-florida-eliminates-dei-positions-due-new-state/story?id=107728253"
  },
  {
    "text": "Activists Charged in Red Powder Attack on U.S. Constitution at the U.S. Archives  —  For Immediate Release  —  U.S. Attorney's Office, District of Columbia  —  Defendants Caused More Than $50,000 in Damage Within the Rotunda  —  WASHINGTON - Donald Zepeda, 35, of Maryland, and Jackson Green … ",
    "url": "https://www.justice.gov/usao-dc/pr/activists-charged-red-powder-attack-us-constitution-us-archives"
  }
]