[
  {
    "text": "Trump Leads Biden in Nearly Every Battleground State, New Poll Finds  —  Voters in battleground states said they trusted Donald J. Trump over President Biden on the economy, foreign policy and immigration, as Mr. Biden's multiracial base shows signs of fraying.",
    "url": "https://www.nytimes.com/2023/11/05/us/politics/biden-trump-2024-poll.html"
  },
  {
    "text": "William Lewis named publisher and CEO of The Washington Post  —  The veteran media executive, previously the publisher of the Wall Street Journal, was tapped by Washington Post owner Jeff Bezos to replace Fred Ryan, who stepped down in August.  —  William Lewis, a reporter-turned-executive … ",
    "url": "https://www.washingtonpost.com/style/media/2023/11/04/william-lewis-publisher-ceo-washington-post/"
  },
  {
    "text": "Obama Urges Americans to Take in ‘Whole Truth’ of Israel-Gaza War  —  The former president said everyone was “complicit to some degree” in the current bloodshed and acknowledged the points of view on both sides of the conflict.  —  Barack Obama offered a complex analysis of the conflict between Israel … ",
    "url": "https://www.nytimes.com/2023/11/04/us/politics/obama-israel-palestine.html"
  },
  {
    "text": "Scott: ‘Obama is dead wrong’ on Israel-Hamas conflict  —  “From Obama to Biden, Democrats have a problem: supporting Israel always has an asterisk,” the South Carolina senator and presidential contender said in a statement.  —  Tim Scott on Saturday slammed Barack Obama as “dead wrong” … ",
    "url": "https://www.politico.com/news/2023/11/04/tim-scott-obama-israel-hamas-00125401"
  },
  {
    "text": "Judge Cannon's Response  —  Thursday night, prosecutors alerted federal Judge Aileen Cannon in Southern Florida that after Trump's lawyers asked her to delay his trial there because it was too close in time to his trial in the District of Columbia, they turned around and asked the Judge in D.C. to delay the trial there as well.",
    "url": "https://joycevance.substack.com/p/judge-cannons-response"
  },
  {
    "text": "‘MAGA Mike Johnson’ and Our Broken Christian Politics  —  There are two moments from Mike Johnson's early days as speaker of the House that almost perfectly encapsulate the broken way that so many Republican evangelicals approach politics.  The first occurred just after the House elected Johnson.",
    "url": "https://www.nytimes.com/2023/11/05/opinion/maga-mike-johnson-christianity.html"
  },
  {
    "text": "Trump and allies plot revenge, Justice Department control in a second term  —  Advisers have also discussed deploying the military to quell potential unrest on Inauguration Day.  Critics have called the ideas under consideration dangerous and unconstitutional.",
    "url": "https://www.washingtonpost.com/politics/2023/11/05/trump-revenge-second-term/"
  },
  {
    "text": "Iowa Gov. Kim Reynolds to endorse Ron DeSantis for president  —  The governor's support could be a catalyst for DeSantis' campaign ahead of the first-in-the-nation caucuses in Iowa, where he trails Donald Trump in the polls.  —  Iowa Gov. Kim Reynolds will endorse Ron DeSantis for president … ",
    "url": "https://www.nbcnews.com/politics/2024-election/iowa-gov-kim-reynolds-endorse-ron-desantis-president-rcna123595"
  },
  {
    "text": "Barring Trump from office could bring closure for Jan. 6 riots, former officer says  —  Former U.S. Capitol Police Sergeant Aquilino Gonell said he thinks former President Trump being barred from office could bring closure for the Jan. 6 riots.  —  “What is closure for me?",
    "url": "https://thehill.com/homenews/campaign/4293802-barring-trump-from-office-could-bring-closure/"
  },
  {
    "text": "Israel minister suspended after calling nuking Gaza an option  —  Heritage Minister Amichai Eliyahu's statements ‘are not based in reality,’ Prime Minister Netanyahu says.  —  Israel's Heritage Minister Amichai Eliyahu was suspended indefinitely after he said in an interview that dropping … ",
    "url": "https://www.politico.eu/article/israel-minister-amichai-eliyahu-suspend-benjamin-netanyahu-nuclear-bomb-gaza-hamas-war/"
  },
  {
    "text": "Poor Josh Hawley Can't Help Himself  —  Josh Hawley is at it again.  Over a brief career in Washington, the elfin senator from Missouri—when he's not egging on and then fleeing from insurrectionists—has attempted one pseudo-populist or culture-war gimmick after another to propel … ",
    "url": "https://newrepublic.com/post/176624/josh-hawley-citizens-united-stunt"
  },
  {
    "text": "All The Ways Republicans Tried To Game The Ohio Abortion Vote  —  The future of abortion access in Ohio will be decided on Tuesday, when voters thumbs up or down a ballot proposal to enshrine abortion rights in the state constitution.  —  The abortion rights supporters have money … ",
    "url": "https://talkingpointsmemo.com/news/republicans-ohio-abortion-larose"
  },
  {
    "text": "Hit-and-run which injured Stanford Arab-Muslim student investigated as possible hate crime  —  California authorities are investigating a hit-and-run Friday afternoon which injured an Arab-Muslim student on the campus of Stanford University as a possible hate crime.",
    "url": "https://www.cbsnews.com/news/hit-and-run-injured-stanford-arab-muslim-student-investigated-possible-hate-crime-california/"
  },
  {
    "text": "Kamala Harris' stepdaughter Ella Emhoff is promoting an $8M Gaza fundraising campaign: ‘Abhorrent’  —  The stepdaughter of Vice President Harris is publicly raising money for Gaza, The Post has learned.  —  Ella Emhoff, 24 — whose father, First Gentleman Doug Emhoff, is Jewish … ",
    "url": "https://nypost.com/2023/11/04/news/kamala-harris-stepdaughter-ella-emhoff-raising-money-for-gaza/"
  }
]