[
  {
    "text": "Post-ABC poll: Biden faces criticism on economy, immigration and age  —  A finding that shows Trump leading Biden by a wide margin does not match other recent polling, however, suggesting it is an outlier  —  A Washington Post-ABC News poll finds President Biden struggling to gain approval … ",
    "url": "https://www.washingtonpost.com/politics/2023/09/24/biden-trump-poll-2024-election/"
  },
  {
    "text": "Troubles for Biden not just his age in reelection campaign: POLL  —  The president's job approval rating is 19 points underwater.  —  President Joe Biden's job approval rating is 19 points underwater, his ratings for handling the economy and immigration are at career lows.",
    "url": "https://abcnews.go.com/Politics/troubles-biden-age-reelection-campaign-poll/story?id=103436611"
  },
  {
    "text": "Poll: Overwhelming majorities express concerns about Biden, Trump ahead of 2024 race  —  Trump's lead has expanded in the GOP presidential contest, while Biden and Trump are tied in a hypothetical general election matchup.  —  Majority of Democratic voters express concerns about Biden in NBC News poll",
    "url": "https://www.nbcnews.com/meet-the-press/first-read/poll-overwhelming-majorities-express-concerns-biden-trump-ahead-2024-r-rcna111347"
  },
  {
    "text": "Biden disapproval rating hits highest mark of presidency: poll  —  President Biden's disapproval rating hit the highest mark of his presidency in a new poll also showing support by essential voting blocs is slipping.  —  Biden's disapproval rating ticked up to 56 percent with 41 percent saying they approve.",
    "url": "https://thehill.com/homenews/campaign/4220548-biden-disapproval-rating-hits-highest-mark-of-presidency-poll/"
  },
  {
    "text": "As Trump Prosecutions Move Forward, Threats and Concerns Increase  —  As criminal cases proceed against the former president, heated rhetoric and anger among his supporters have authorities worried about the risk of political dissent becoming deadly.  —  At the federal courthouse in Washington … ",
    "url": "https://www.nytimes.com/2023/09/24/us/politics/trump-prosecutions-threats-violence.html"
  },
  {
    "text": "Across GOP, many see Trump as likely nominee — including some rival supporters  —  Even some of his critics are moving toward that conclusion for 2024, as the former president continues to dominate the Republican presidential race  —  Republican Sen. Kevin Cramer of North Dakota is backing … ",
    "url": "https://www.washingtonpost.com/politics/2023/09/24/trump-republicans-presidential-primary/"
  },
  {
    "text": "GOP Rep Who Pushes ‘Traditional Values’ Is Accused of Affair With Lobbyist  —  SPLITSVILLE  —  Melody Duncan, wife of Rep. Jeff Duncan (R-SC), filed for a divorce on Friday, citing her husband's multiple alleged affairs and a particular mistress she identified as Liz Williams … ",
    "url": "https://www.thedailybeast.com/gop-rep-jeff-duncan-accused-of-multiple-affairs-while-pushing-traditional-values"
  },
  {
    "text": "Anti-vaxxers are now a modern political force  —  The once-fringe movement is now seeing an influx in cash after the Covid pandemic.  —  This is the final story of a five-part series diving into the rise of the anti-vaccine political movement.  —  For years, groups at the vanguard … ",
    "url": "https://www.politico.com/news/2023/09/24/anti-vaxxers-political-power-00116527"
  },
  {
    "text": "Ohio Republican on shutdown scenario: 'I'll bet on Kevin McCarthy any day'  —  But Democratic Rep. Maxine Waters only sees chaos in the GOP.  —  House Speaker Kevin McCarthy is in a very difficult position as Republicans this week are preparing to start debate on four government funding bills … ",
    "url": "https://www.politico.com/news/2023/09/24/waters-turner-mccarthy-government-shutdown-00117822"
  },
  {
    "text": "McCarthy ally dares critics to push vote ousting speaker, blasts hardliners over possible shutdown  —  Rep. Garret Graves, one of House Speaker Kevin McCarthy's closest allies, told CNN that he's fed up with conservative critics dangling the threat of McCarthy's ouster, saying that he's prepared … ",
    "url": "https://www.cnn.com/2023/09/23/politics/garret-graves-oust-mccarthy-vote/"
  },
  {
    "text": "After Florida restricts Black history, churches step up to teach it  —  MIAMI — They filed into the pews one after the other on a sweltering Wednesday night, clutching Bibles and notepads, ready to learn at church what they no longer trusted would be taught at school.",
    "url": "https://www.washingtonpost.com/nation/2023/09/24/florida-black-history-churches-teaching/"
  },
  {
    "text": "You've Persuaded Us Already  —  When it comes to the idea that conservatism has embraced fascism and supremacy, nobody is more persuasive than conservatives themselves.  An essay on bullies and the margins of permission in the USA.  —  In Missouri, a state Senator who's running for governor … ",
    "url": "https://armoxon.substack.com/p/youve-persuaded-us-already"
  },
  {
    "text": "Dana Perino of Fox News Is About to Face Her Biggest Test as a Journalist  —  The former press secretary in the Bush White House will moderate the next Republican debate.  She's managed to rise at Fox without being a Trump supplicant.  —  Dana Perino can punch and parry with the best of them.",
    "url": "https://www.nytimes.com/2023/09/24/business/dana-perino-fox-news.html"
  },
  {
    "text": "Local libraries can save democracy, one reader at a time  —  September is “Library Card Sign-Up Month.”  It is not widely known or celebrated, but it should be.  The tenor of our times requires those of us who understand the power of books to get involved.  The children of today need our help.",
    "url": "https://thehill.com/opinion/civil-rights/4214822-local-libraries-can-save-democracy-one-reader-at-a-time/"
  },
  {
    "text": "Burchett Says He Would Consider Ousting McCarthy, Should He Work With Democrats To Pass Funding  —  Burchett noted he is opposed to passing a short-term stopgap measure  —  A Facebook icon representing an external link to share the article on Facebook.A Twitter icon representing an external link … ",
    "url": "https://themessenger.com/politics/burchett-says-he-would-consider-ousting-mccarthy-should-he-work-with-democrats-to-pass-funding"
  },
  {
    "text": "Fetterman calls for Menendez to resign  —  Menendez was indicted for accepting bribes Friday.  —  Sen. John Fetterman (D-Penn.) called for Sen. Bob Menendez (D-N.J.) to resign from the Senate on Saturday, making him the first Democratic senator to call for his resignation.",
    "url": "https://www.politico.com/news/2023/09/23/fetterman-menendez-resign-00117800"
  }
]