[
  {
    "text": "Biden pardons Fauci and Milley in an effort to guard against potential revenge by Trump  —  President Joe Biden has pardoned Dr. Anthony Fauci, retired Gen. Mark Milley and members of the House committee that investigated the Jan. 6 attack on the Capitol, using the extraordinary powers … ",
    "url": "https://apnews.com/article/biden-trump-fauci-milley-pardons-january-6-3cba287f89051513fb48d7ae700ae747"
  },
  {
    "text": "Trump to take more than 200 executive actions on day one  —  EXCLUSIVE: President-elect Trump will sign more than 200 executive actions on Inauguration Day—a massive, first wave of policy priorities focused on border security, energy, reducing the cost of living for American families … ",
    "url": "https://www.foxnews.com/politics/trump-take-more-than-200-executive-actions-day-one"
  },
  {
    "text": "EXCLUSIVE: Trump's Day One Executive Order on ‘Male and Female’  —  The White House strikes out at gender ideology and pronouns.  Also: ends housing of biological men in women's prisons; self-ID on passports; and more.  —  Toward the end of the 2024 presidential campaign … ",
    "url": "https://www.thefp.com/p/trumps-day-one-executive-order-male-female-gender-ideology-pronouns"
  },
  {
    "text": "‘Disgrace’: Pope Francis revives feud with Trump just before inauguration  —  Pope Francis blasted Donald Trump's plans to deport millions of undocumented immigrants, calling the United States president-elect's proposal a “disgrace.”  —  “If true, this will be a disgrace … ",
    "url": "https://www.politico.eu/article/pope-francis-reviive-feud-donald-trumps-mass-deportation-plan-disgrace/"
  },
  {
    "text": "Playbook: Trump's second coming  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  Good Monday morning, and happy Inauguration Day.  This is Jack Blanchard on Playbook debut.  Stay warm out there.  —  DRIVING THE DAY  —  THE SECOND COMING: Donald Trump will today complete … ",
    "url": "https://www.politico.com/newsletters/playbook/2025/01/20/trumps-second-coming-00199239"
  },
  {
    "text": "Biden pardons Fauci, Jan. 6 committee ahead of Trump inauguration  —  President Biden granted pardons to several prominent public servants Monday who have faced attacks from President-elect Trump in one of his final acts in office.  —  Biden issued pardons for Dr. Anthony Fauci … ",
    "url": "https://thehill.com/homenews/5094948-joe-biden-pardons-mark-milley-anthony-fauci-january-sixth/"
  },
  {
    "text": "Trump plans barrage of Day 1 executive actions on border, energy, federal workforce  —  President-elect Trump is planning a barrage of executive actions on energy, the border and immigration enforcement on his first day in office, four sources told The Hill.",
    "url": "https://thehill.com/homenews/administration/5094573-trump-day-one-executive-orders/"
  },
  {
    "text": "Trump's honeymoon won't last  —  This is a very bleak moment for the United States and the world.  —  Donald Trump takes office today promising to immediately start in on a litany of human rights abuses and other efforts to harm marginalized people.  He's promised a sweeping assault … ",
    "url": "https://www.publicnotice.co/p/trump-inauguration-honeymoon-will-not-last"
  },
  {
    "text": "Trump to suspend security clearances of 51 intelligence officials who falsely implied Hunter Biden laptop was Russian fake  —  President-elect Donald Trump, on Day 1, plans to suspend security clearances of the 51 intelligence officials who claimed reporting tied to Hunter Biden's laptop had … ",
    "url": "https://nypost.com/2025/01/19/us-news/trump-to-suspend-security-clearances-of-51-former-cia-contractors-who-falsely-implied-hunter-biden-laptop-was-russian-fake/"
  },
  {
    "text": "It's ‘Just Begun’—Trump Meme Coin Suddenly Crashes Back As Melania Coin Shock Hits Crypto  —  Crypto markets have been rocked by the launch of an “official” Donald Trump memecoin this weekend—with traders braced for more mayhem this coming week.  —  Unlock over $3,000 in NFT, web3 and crypto perks — Apply now!",
    "url": "https://www.forbes.com/sites/digital-assets/2025/01/19/its-just-begun-trump-meme-coin-suddenly-crashes-back-as-melania-coin-shock-hits-crypto/"
  },
  {
    "text": "Trump's Cryptocurrency Surges to Become One of the World's Most Valuable  —  The new business venture by the Trump family is generating intensifying criticism, even as it has turned into an overnight phenomenon, generating a windfall on paper.  —  The Trump family's new crypto token surged … ",
    "url": "https://www.nytimes.com/2025/01/19/us/politics/trump-cryptocurrency-surges.html?unlocked_article_code=1.qk4.LdH6.reJymwrcjNgW&smid=url-share"
  },
  {
    "text": "Vivek Ramaswamy expected to depart DOGE  —  Vivek Ramaswamy, President-elect Donald Trump's choice to co-lead the Department of Government Efficiency (DOGE) with entrepreneur Elon Musk, is expected to soon step away from the task force, CBS News has learned.",
    "url": "https://www.cbsnews.com/news/vivek-ramaswamy-expected-to-depart-doge/"
  },
  {
    "text": "Scores of career State Dept. diplomats resign before Trump's inauguration  —  Trump's team requested the high-level resignations as the president-elect prepares a sharp break with the Biden administration.  —  Scores of senior career diplomats are resigning from the State Department effective … ",
    "url": "https://www.washingtonpost.com/national-security/2025/01/19/trump-state-department-resignations/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM3MjYyODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM4NjQ1MTk5LCJpYXQiOjE3MzcyNjI4MDAsImp0aSI6IjA3ZjJkZjU3LWRkODktNDFmMC1hMzc3LWVmN2IyN2ZmMzRmNyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb25hbC1zZWN1cml0eS8yMDI1LzAxLzE5L3RydW1wLXN0YXRlLWRlcGFydG1lbnQtcmVzaWduYXRpb25zLyJ9.F2w85PZoKMacD_JnaSMCeRKPTHY3NCBuVGx8blr8zTE&itid=gfta"
  },
  {
    "text": "Trump Vowed to End the Ukraine War Before Taking Office.  The War Rages On.  —  Donald J. Trump's promise to broker peace between Russia and Ukraine in 24 hours, “before I even become president,” proved to be hyperbole.  —  After they win elections and move into the White House … ",
    "url": "https://www.nytimes.com/2025/01/19/us/politics/trump-promise-ending-ukraine-war.html"
  },
  {
    "text": "Can Trump Be a Great President?  —  Donald Trump enters his second presidency, as he did his first, pledging to wield executive power in novel and aggressive ways.  This is neither new nor necessarily bad.  “Presidents who go down in the history books as ‘great’ are those who reach for power … ",
    "url": "https://www.nytimes.com/2025/01/20/opinion/trump-great-president.html"
  }
]