[
  {
    "text": "A guide to the coming attacks on Kamala Harris  —  On Sunday at 1:46 PM Eastern Time, President Joe Biden announced he would end his campaign for reelection.  Seconds later, the attacks on Vice President Kamala Harris began.  —  Harris is not yet the nominee.",
    "url": "https://popular.info/p/a-guide-to-the-coming-attacks-on"
  },
  {
    "text": "Trump and His Allies Are Freaking Out Over Biden Leaving Race  —  The former president is falling apart at the prospect of facing Kamala Harris instead of the president … “It's not over!  Tomorrow Crooked Joe Biden's going to wake up and forget that he dropped out of the race today!” … ",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-maga-allies-freak-out-biden-race-harris-1235064883/"
  },
  {
    "text": "This Is Exactly What the Trump Team Feared  —  On the evening of Super Tuesday, March 5, shortly before Donald Trump effectively ended the Republican primary and earned a general-election rematch with President Joe Biden, I asked the co-managers of Trump's presidential campaign what they feared most about Biden.",
    "url": "https://www.theatlantic.com/politics/archive/2024/07/trump-campaign-biden-dropping-out/679183/"
  },
  {
    "text": "Biden's Timing: Undercutting Bibi  —  There are many things that explain the timing of President Biden's decision to drop out of the race.  Most importantly, after staying reasonably steady with Trump in the polls, the combined weight of the Democratic firing squad, and — probably … ",
    "url": "https://www.emptywheel.net/2024/07/22/bidens-timing-undercutting-bibi/"
  },
  {
    "text": "Harris is quickly consolidating support among House Democrats … - A handful of Democratic lawmakers, donors and party officials have advocated for a genuinely contested process, but those voices have thus far largely been drowned out. … - House Democratic Caucus Chair Pete Aguilar … ",
    "url": "https://www.axios.com/2024/07/22/kamala-harris-2024-endorse-house-democrats"
  },
  {
    "text": "Playbook: The Kamala Harris juggernaut  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  INSIDE THE HARRIS BLITZ — In a matter of hours yesterday, VP KAMALA HARRIS garnered endorsements of a majority of House Democrats (153 as of this morning) … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/07/22/the-kamala-harris-juggernaut-00170254"
  },
  {
    "text": "Exclusive: All 50 Democratic party US state chairs back Harris -sources  —  All 50 Democratic party state chairs have thrown their weight behind Vice President Kamala Harris to be the party's new presidential nominee, according to sources familiar with the matter.",
    "url": "https://www.reuters.com/world/us/all-50-democratic-party-us-state-chairs-back-harris-sources-2024-07-21/"
  },
  {
    "text": "Scoop: Biden doubted Harris' election chances … - Biden, Bill and Hillary Clinton and many Democratic lawmakers quickly endorsed Harris, but others — including former House Speaker Nancy Pelosi, House Democratic leader Hakeem Jeffries, Senate Majority Leader Chuck Schumer … ",
    "url": "https://www.axios.com/2024/07/22/biden-kamala-harris-election-chances"
  },
  {
    "text": "Kamala Harris clears the path to the nomination as potential challengers fall in line  —  The rapid demonstration of support was a show of force — and unity — after weeks of unrest and anxiety.  —  It took less than 24 hours for Kamala Harris to all but clear the Democratic presidential field.",
    "url": "https://www.politico.com/news/2024/07/22/jb-pritzker-endorses-kamala-harris-2024-00170291"
  },
  {
    "text": "By Withdrawing in Favor of Kamala Harris, Joe Biden Proves That Only the GOP Is a Personality Cult  —  Democrats acted as a proper political party, while Republicans remain in thrall to a dangerous authoritarian.  —  Pocket  —  Joe Biden's decision on Sunday to withdraw from the presidential race … ",
    "url": "https://www.thenation.com/article/politics/trump-republican-personality-cult/"
  },
  {
    "text": "Democrats Forego the Iceberg  —  Did you all enjoy your weekend?  What weekend?  —  There ought to be a law against doing this sort of thing on a Sunday.  Nota bene to all future presidents mulling stepping aside: Save it for the work week!  Happy Monday.  —  Trump's Too Old",
    "url": "https://www.thebulwark.com/p/democrats-forego-the-iceberg"
  },
  {
    "text": "ActBlue rakes in nearly $50 million in 7 hours after Harris campaign launch  —  Correction: A total of $47 million was donated via ActBlue to all races in the seven hours after Harris launched her campaign Sunday.  A previous version of this article contained incorrect information.",
    "url": "https://thehill.com/elections/4785224-harris-campaign-fundraising-actblue/"
  },
  {
    "text": "Nikki Haley Voters PAC Announces Support for Kamala Harris  —  voters pledged their support for Democratic Vice President  —  ' presidential bid on Sunday, hours after President  —  announced that he was dropping out of the race.  —  Biden announced on Sunday afternoon in a letter … ",
    "url": "https://www.newsweek.com/nikki-haley-voters-pac-announces-support-kamala-harris-1928198"
  },
  {
    "text": "Voto Latino pledges $44M to support Harris  —  Voto Latino on Monday is endorsing Vice President Harris in her bid for the White House, pledging its entire 2024 campaign budget to her cause.  —  The civic engagement group, a key player in Latino campaign politics, supported President Biden's … ",
    "url": "https://thehill.com/latino/4785562-kamala-harris-2024-democratic-party-voto-latino/"
  },
  {
    "text": "Democrats Will Pay for the Biden Big Lie  —  By dropping out, he removes all doubt that Americans were played for suckers.  —  President Biden told ABC's George Stephanopoulos earlier this month that only “the Lord Almighty” could get him to abandon his failing bid for re-election.",
    "url": "https://www.wsj.com/articles/democrats-will-pay-for-the-biden-big-lie-coverup-election-2024-6d120e5c"
  },
  {
    "text": "Are Republicans ready for Kamala Harris, the queen of opposition research?  —  At some point in the next 100 days, something awful and potentially career-ending is going to come out about Sen. J.D. Vance (R-OH), former President Donald Trump's vice presidential pick.  It might involve a sexual scandal.",
    "url": "https://www.washingtonexaminer.com/restoring-america/fairness-justice/3093511/are-republicans-ready-for-kamala-harris-the-queen-of-opposition-research/"
  }
]