[
  {
    "text": "BREAKING: The Washington Post Has Died  —  Its stunning refusal to endorse Kamala Harris is the end of the venerable newspaper ...  D. Earl Stephens ✍️  —  1,021  —  I have been a subscriber of The Washington Post for 26 years.  —  I devoured it each day while riding … ",
    "url": "https://dearlstephens.substack.com/p/breaking-the-washington-post-has"
  },
  {
    "text": "LA Times Planned ‘Case Against Trump’ Series Alongside Kamala Harris Endorsement Before Owner Quashed It |  Exclusive  —  Patrick Soon-Shiong's interference with the paper's editorial freedom has sparked a crisis that includes canceled subscriptions and several high profile resignations",
    "url": "https://www.thewrap.com/la-times-case-against-trump-kamala-endorsement-canceled/"
  },
  {
    "text": "Post columnists respond  —  The newspaper's refusal to endorse a presidential candidate is a mistake.  —  By 11 Post Opinions columnists  —  The Washington Post's decision not to make an endorsement in the presidential campaign is a terrible mistake.  It represents an abandonment … ",
    "url": "https://www.washingtonpost.com/opinions/2024/10/25/post-columnist-no-endorsement-2024-trump-harris/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI5ODI4ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzMxMjE0Nzk5LCJpYXQiOjE3Mjk4Mjg4MDAsImp0aSI6IjAyYjE0MzFjLWE3NDItNGQxNi1iMWUxLTUxYWI3NTBiYjdjOCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9vcGluaW9ucy8yMDI0LzEwLzI1L3Bvc3QtY29sdW1uaXN0LW5vLWVuZG9yc2VtZW50LTIwMjQtdHJ1bXAtaGFycmlzLyJ9.KCWBtmo8IMrEBOJbSZfuDv38U6GLmgAaDDTifHmVGxw&itid=gfta"
  },
  {
    "text": "The Guardrails Are Already Crumpling  —  Editor's note: The Bulwark is supported not by a billionaire, but by the members who gather here every day to read, talk to, and learn from each other.  We believe that this is how you save democracy.  With the little platoons of a community.",
    "url": "https://www.thebulwark.com/p/bezos-kills-washington-post-endorsement-guardrails-falling"
  },
  {
    "text": "The Only Patriotic Choice for President  —  It is hard to imagine a candidate more unworthy to serve as president of the United States than Donald Trump.  He has proved himself morally unfit for an office that asks its occupant to put the good of the nation above self-interest.",
    "url": "https://www.nytimes.com/2024/09/30/opinion/editorials/kamala-harris-2024.html?unlocked_article_code=1.Ok4._1gk.0anPVHmRE6WK&smid=url-share"
  },
  {
    "text": "Cowardice and intimidation at The Washington Post and L.A. Times  —  I apologize for bothering you again today, but this is important.  Will Lewis, the chief executive of The Washington Post, announced today that the paper would not endorse a presidential candidate this year.  —  Why not?",
    "url": "https://robertreich.substack.com/p/cowardice-and-intimidation-at-the"
  },
  {
    "text": "Democracy Dies in Darkness.  Indeed.  —  Lesson One in Timothy Snyder's book On Tyranny is “Do not obey in advance.”  —  He writes: … Jeff Bezos has succumbed to the kind of anticipatory obedience Snyder was describing. about in order, it would seem, to protect his Amazon fortune … ",
    "url": "https://www.marytrump.org/p/democracy-dies-in-darkness-indeed"
  },
  {
    "text": "Harris Seeks Suburban Swing to Offset Trump Gains  —  America's political fault line now runs through the suburbs, where Trump has alienated some college-educated voters  —  MEQUON, Wis.—Vice President Kamala Harris's strategy to win a contest where polling shows she has stalled counts … ",
    "url": "https://www.wsj.com/politics/elections/kamala-harris-surburban-voters-election-strategy-ba658bfd?st=GDbjJv&reflink=desktopwebshare_permalink"
  },
  {
    "text": "October 2024 National Poll: Trump 49%, Harris 49%  —  Home Polls October 2024 National Poll: Trump 49%, Harris 49%  —  A new Emerson College Polling national survey of US likely voters finds both former president Donald Trump and Vice President Kamala Harris with 49% support in the 2024 presidential election.",
    "url": "https://emersoncollegepolling.com/october-2024-national-poll-trump-49-harris-49/"
  },
  {
    "text": "These Americans told our pollsters Trump is a fascist.  They'll still vote for him  —  Among registered voters who say Trump is a fascist, 8% support him anyway.  —  Republican presidential nominee, former U.S. President Donald Trump speaks at a Turning Point Action campaign rally, Oct. 24, 2024, in Las Vegas.",
    "url": "https://abcnews.go.com/Politics/americans-told-pollsters-trump-fascist-theyll-vote/story?id=115152532"
  },
  {
    "text": "Man In MAGA Hat Arrested For Allegedly Punching Election Worker  —  Officials called the episode “ugly” and urged calm.  —  LOADING  —  A man wearing a pro-Trump hat repeatedly punched an elderly election worker in San Antonio, Texas, Thursday evening, according to police … ",
    "url": "https://www.huffpost.com/entry/maga-hat-punch-elderly-election-worker-police_n_671c131be4b00589e7dd14df"
  },
  {
    "text": "Watch live: Harris expected to rally with Beyonce in Houston  —  Vice President Harris is campaigning Friday in Houston and may host a rumored special guest: Beyoncé.  —  The music sensation, who was raised in the city, is expected to attend the rally, according to sources familiar with the event.",
    "url": "https://thehill.com/homenews/4953868-harris-campaigning-houston-beyonce-watch/"
  },
  {
    "text": "October 25, 2024  —  A bombshell story last night from the Wall Street Journal reported that billionaire Elon Musk, one of the richest men in the world, who is backing the election of Republican presidential candidate Donald Trump with a daily million-dollar sweepstakes giveaway and gifts … ",
    "url": "https://heathercoxrichardson.substack.com/p/october-25-2024"
  },
  {
    "text": "Elon Musk, enemy of ‘open borders,’ launched his career working illegally  —  Investors in Musk's first company worried about “our founder being deported” and gave him a deadline for obtaining a work visa.  —  PALO ALTO, Calif. — Long before he became one of Donald Trump's biggest donors … ",
    "url": "https://www.washingtonpost.com/business/2024/10/26/elon-musk-immigration-status/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI5OTE1MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzMxMzAxMTk5LCJpYXQiOjE3Mjk5MTUyMDAsImp0aSI6IjQxZGVhY2ExLTg4NzQtNDAyYy05ZGU2LTMzYjZjODBjZDQwMiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9idXNpbmVzcy8yMDI0LzEwLzI2L2Vsb24tbXVzay1pbW1pZ3JhdGlvbi1zdGF0dXMvIn0.A_tsea6jQIWaQ1Q1Rp1WROrhBlr0IksHUlC4vxqZXY0&itid=gfta"
  },
  {
    "text": "Mike Johnson Can't Stop The House From Certifying The Election — But He Can Try  —  The conditions of the 2024 electoral certification don't hinge on Mike Johnson, but if Republicans take the House, he will be a formidable ally to Donald Trump.  —  When he was slinging french fries … ",
    "url": "https://www.huffpost.com/entry/mike-johnson-stop-election-certification_n_66fc7ecae4b0453dc1ee7025"
  },
  {
    "text": "Court rules ballots that arrive late shouldn't be counted despite postmarks  —  The 5th Circuit's ruling in a Mississippi case could have implications for other states with similar laws.  —  A federal appeals court Friday ruled invalid a Mississippi law that allows election officials … ",
    "url": "https://www.washingtonpost.com/politics/2024/10/25/late-ballots-fifth-circuit-mississippi/"
  },
  {
    "text": "Migrant families separated under Trump still feel the fallout and they fear his return to office  —  Sixteen-year-old Billy's friends at his rural high school in the South don't know he was one of thousands of children separated from their parents at the U.S.-Mexico border under … ",
    "url": "https://apnews.com/article/election-family-separation-trump-immigration-zero-tolerance-ef77a181712149bb5edbd8dae4df4604"
  },
  {
    "text": "The ‘Black Insurrectionist’ was actually white.  The deception did not stop there  —  “Black Insurrectionist,” the anonymous social media persona behind some of the most widely circulated conspiracy theories about the 2024 election, can be traced to a man from upstate New York.  He's also white.",
    "url": "https://apnews.com/article/black-trump-kamala-harris-tim-walz-aca31c66fe5bfef1e8827581e7919ece"
  },
  {
    "text": "Joint ODNI, FBI, and CISA Statement  —  WASHINGTON, D.C. - Today, the Office of the Director of National Intelligence (ODNI), the Federal Bureau of Investigation (FBI), and the Cybersecurity and Infrastructure Security Agency (CISA) released the following statement:",
    "url": "https://www.cisa.gov/news-events/news/joint-odni-fbi-and-cisa-statement-0"
  },
  {
    "text": "U.S. Department of Defense and Army Records Regarding Incident at Arlington National Cemetery … INQUIRIES PRESS@AMERICANOVERSIGHT.ORG  —  Records from the U.S. Department of Defense and Army in response to American Oversight's litigation seeking the expedited release of records regarding … ",
    "url": "https://americanoversight.org/featureddocument/u-s-department-of-defense-and-army-records-regarding-incident-at-arlington-national-cemetery/"
  }
]