[
  {
    "text": "Harris Puts Four Sun Belt States Back in Play, Times/Siena Polls Find  —  Kamala Harris and Donald Trump are in close races across Arizona, Georgia, Nevada and North Carolina, crucial swing states that Mr. Trump had seemed en route to run away with just a few weeks ago.",
    "url": "https://www.nytimes.com/2024/08/17/us/elections/kamala-harris-trump-az-nc-ga-nv.html?unlocked_article_code=1.Dk4.h1jB.r4PD8EvalJH3&smid=url-share"
  },
  {
    "text": "Democrats still might invoke the 25th Amendment to make Harris president  —  Politics aside, it's understandable that some now view President Joe Biden as a “broken man,” walking alone in a deep valley of depression, confusion and anger.  One day he is declaring that he is the Democratic nominee … ",
    "url": "https://thehill.com/opinion/campaign/4831471-democrats-might-invoke-the-25th-amendment-to-make-harris-president/"
  },
  {
    "text": "Harris reset the election, and congressional Dems are starting to shift strategies  —  Democrats are seeing new energy — and poll numbers.  But they also know they still have a serious fight on their hands in November.  —  Battleground Democrats are suddenly jumping at the chance to campaign with the top of the ticket.",
    "url": "https://www.politico.com/news/2024/08/17/house-senate-democrats-kamala-harris-congress-00174480"
  },
  {
    "text": "Harris Gains in Sun Belt as Demographic Patterns Start to Look ‘Normal’  —  Gains among Black, Hispanic and young voters lift her into a tie across four swing states, new Times/Siena polls show.  —  With Kamala Harris as the Democratic nominee, the presidential race is returning to “normal.”",
    "url": "https://www.nytimes.com/2024/08/17/upshot/poll-harris-trump-sun-belt.html?unlocked_article_code=1.Dk4.1SJ-.cuQi4y38ztAG&smid=url-share"
  },
  {
    "text": "You Should Know  —  I flagged this on social media.  But I wanted to make sure you knew.  Trump just announced a “crime and safety” rally for next Tuesday in Howell, Michigan, a town that has been heavily associated with the KKK for decades.  Indeed, just late last month White Supremacists marched … ",
    "url": "https://talkingpointsmemo.com/edblog/you-should-know"
  },
  {
    "text": "Armed and Underground: Inside the Turbulent, Secret World of an American Militia  —  This story discusses threats of violence and contains a racial slur.  —  Reporting Highlights  — Militias After Jan. 6: Internal messages reveal how AP3, one of the largest U.S. militias … ",
    "url": "https://www.propublica.org/article/inside-secret-ap3-militia-american-patriots-three-percent"
  },
  {
    "text": "Keep talking, JD!  Vance's creepy views on ‘females’ are repelling women voters  —  Does Donald Trump's running mate think there is any point to ‘postmenopausal females’ beyond free childcare?  —  JD Vance puts his futon in his mouth again  —  Consider, if you will, the mysterious role of the postmenopausal female.",
    "url": "https://www.theguardian.com/commentisfree/article/2024/aug/17/jd-vance-women"
  },
  {
    "text": "Donald Trump Has No Idea What Has Hit Him, and It's a Joy to Watch … It continues.  Six days ago, The New York Times ran a story under the headline “Inside the Worst Three Weeks of Donald Trump's 2024 Campaign.”  Usually, when the country's most important newspaper runs a story like that … ",
    "url": "https://newrepublic.com/article/184951/donald-trump-flailing-harris"
  },
  {
    "text": "Bronze statue of John Lewis replaces more than 100-year-old Confederate monument  —  A large bronze statue of the late civil rights icon leader and Georgia congressman John Lewis was installed Friday, at the very spot where a contentious monument to the confederacy stood for more than 110 years … ",
    "url": "https://apnews.com/article/john-lewis-bronze-statue-replaced-confederate-georgia-b0c51086a4b83750ff38b1af2167abde"
  },
  {
    "text": "‘Keyboard warrior’ jailed for part in UK disorder  —  A man who posted material on social media to stir up racial hatred during recent unrest across the UK has been jailed for three years.  —  Wayne O'Rourke, who had more than 90,000 followers to his X account, posted misinformation … ",
    "url": "https://www.bbc.com/news/articles/c5y3gre3y9yo"
  },
  {
    "text": "Experts: Pro-Trump officials could face “severe” punishments if they refuse to certify election  —  “The threat of disruption looms large in this year's election” — but anti-certification efforts likely to backfire  —  Pro-Trump local election officials may try to slow down the certification … ",
    "url": "https://www.salon.com/2024/08/17/experts-pro-officials-could-face-severe-punishments-if-they-refuse-to-certify/"
  },
  {
    "text": "Her name was on a signature petition to be a Cornel West elector.  Her question: What's an elector?  —  PHOENIX (AP) — When Denisha Mitchell was asked why she filled out paperwork to serve as an Arizona elector for the independent presidential candidate Cornel West, her first response was “What?!”",
    "url": "https://apnews.com/article/ballot-deception-cornel-west-conservatives-0d2c94da68bbd136442e63edadf14398"
  },
  {
    "text": "Fox News Flames Harris: Real Leaders Don't Eat Doritos  —  ARE YOU KIDDING ME?  —  “That's the emotional response of the leader of the free world—to binge-eat a bag of Doritos,” Elisabeth Hasselbeck asked Sean Hannity on Friday night.  —  Former The View host Elisabeth Hasselbeck tore … ",
    "url": "https://www.thedailybeast.com/fox-news-elisabeth-hasselbeck-flames-kamala-harris-on-sean-hannity-real-leaders-dont-eat-doritos"
  },
  {
    "text": "Deploying on U.S. Soil: How Trump Would Use Soldiers Against Riots, Crime and Migrants  —  The former president's vision of using the military to enforce the law domestically would carry profound implications for civil liberties.  —  Former President Donald J. Trump has made clear that he intends … ",
    "url": "https://www.nytimes.com/2024/08/17/us/politics/trump-2025-insurrection-act.html?unlocked_article_code=1.Dk4.WxfQ.b0MzywHvuCl-&smid=url-share"
  },
  {
    "text": "O'Reilly pushes back on RFK Jr's media criticism, calling his campaign ‘done’  —  Former Fox News host Bill O'Reilly pushed back on Independent presidential candidate Robert F Kennedy Jr.'s recent media criticism, arguing that his campaign is “done.”  —  “I told you from the very beginning … ",
    "url": "https://thehill.com/homenews/media/4832811-bill-oreilly-robert-f-kennedy-jr-media-campaign-2024/"
  },
  {
    "text": "Harris Campaign's Legal Team Takes Shape as Election Battles Heat Up  —  The campaign is adding Marc Elias, one of the party's top election lawyers, to help Democrats counter what they expect to be a contentious postelection period.  —  Amid threats of certification battles and mass voter challenges … ",
    "url": "https://www.nytimes.com/2024/08/17/us/elections/democrats-election-legal-challenges.html"
  },
  {
    "text": "George Santos to plead guilty to multiple charges in fraud case Monday  —  Video Player is loading.  —  Play Video  —  Unmute  —  Current Time 0:00 … Stream Type LIVE  —  Seek to live, currently behind liveLIVE  —  Playback Rate  —  Chapters  — Chapters  —  Descriptions",
    "url": "https://thehill.com/regulation/court-battles/4832761-george-santos-fraud-case-guilty-plea-expected/"
  },
  {
    "text": "Brutal New Poll for J.D. Vance Reveals a Big Trump-MAGA Weakness … No vice presidential running mate in recent memory has been scrutinized in quite the way that J.D. Vance has.  Because he presents himself as an intellectual standard-bearer of the MAGA movement—and has a long trail … ",
    "url": "https://newrepublic.com/article/184978/brutal-new-poll-jd-vance-reveals-big-trump-maga-weakness"
  },
  {
    "text": "VFW Admonishes Former President for Medal of Honor Remarks  —  The following is a message from VFW National Commander Al Lipphardt  —  WASHINGTON — “On Thursday, former President Donald Trump spoke at an event where he made some flippant remarks about the Medal of Honor and the heroes who have received it.",
    "url": "https://www.vfw.org/media-and-events/latest-releases/archives/2024/8/vfw-admonishes-former-president-for-medal-of-honor-remarks"
  },
  {
    "text": "Reality TV star wrongfully convicted by Kamala Harris's office will vote for Trump in November: ‘Life was good’  —  A wannabe filmmaker who was wrongfully convicted of murder by Kamala Harris' office when she was San Francisco's district attorney said he was bullied by Hollywood leftists … ",
    "url": "https://nypost.com/2024/08/16/us-news/man-wrongfully-convicted-by-kamala-harris-will-vote-trump/"
  }
]