[
  {
    "text": "IRS chief to quit over deal to share data with immigration authorities  —  Melanie Krause clashed with Treasury Department officials who sought to circumvent IRS executives so immigration authorities could access taxpayers' information.  —  The acting head of the Internal Revenue Service plans … ",
    "url": "https://www.washingtonpost.com/business/2025/04/08/irs-dhs-tax-data-immigrants/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ0MDg0ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ1NDY3MTk5LCJpYXQiOjE3NDQwODQ4MDAsImp0aSI6Ijk0OGIxYjYwLWJhMjEtNGY1ZC1iOWI3LTcyN2EyMmY3OTc5YyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9idXNpbmVzcy8yMDI1LzA0LzA4L2lycy1kaHMtdGF4LWRhdGEtaW1taWdyYW50cy8ifQ.pVamhXTS8KgTc8iTVzJe8CF1XrkHOxZYJ5aoOW6F_RI&itid=gfta"
  },
  {
    "text": "I.R.S. Agrees to Share Migrants' Tax Information With ICE  —  The agreement is a major departure from the Internal Revenue Service's efforts to gain the trust of migrants and encourage them to file their taxes.  —  The Internal Revenue Service has agreed to help homeland security officials find immigrants … ",
    "url": "https://www.nytimes.com/2025/04/08/us/politics/irs-ice-tax-data-deal.html?unlocked_article_code=1.-E4.sP9z.fhs_XNQmT6za&smid=url-share"
  },
  {
    "text": "DOGE to Shutter DOJ Tax Division … I didn't know this until this morning.  And I'm surprised it hasn't gotten more press attention.  We know that DOGE is in the process of gutting the IRS.  According to internal IRS estimates reviewed by The Washington Post this internal sabotage … ",
    "url": "https://talkingpointsmemo.com/edblog/doge-to-shutter-doj-tax-division/sharetoken/86f023ca-b4a0-4bb4-9e09-df7e05237d43"
  },
  {
    "text": "US stocks drop after another stunning day of reversals as uncertainty reigns about Trump's tariffs  —  U.S. stocks dropped after a second day of stunning reversals.  The S&P 500 fell 1.6% Tuesday after wiping out an early gain of 4.1%, which had it on track for its best day in years.",
    "url": "https://apnews.com/article/stocks-markets-tariffs-china-trump-b686ef0259c2f4894f9fcd1f3649a956"
  },
  {
    "text": "Scoop: A dozen House Republicans mull defying Trump on tariff bill  —  At least a dozen House Republicans are considering signing onto Rep. Don Bacon's (R-Neb.) bill to restrict the White House's ability to impose tariffs unilaterally, Axios has learned.  —  Why it matters … ",
    "url": "https://www.axios.com/2025/04/08/house-republicans-tariff-bill-trump-don-bacon"
  },
  {
    "text": "In Trump Cases, Supreme Court Retreats From Confrontation  —  In a series of narrow rulings, the justices have seemed to take pains to avoid a showdown with a president who has challenged the judiciary's legitimacy.  —  6 MIN READ  —  Justices Give Trump a Tentative Win in Push to Fire 16,000 Federal Workers",
    "url": "https://www.nytimes.com/2025/04/08/us/supreme-court-trump-confrontation.html"
  },
  {
    "text": "Federal judge says White House's punishment of Associated Press is unconstitutional  —  The White House's decision to punish the Associated Press by eliminating its access to President Donald Trump's events, the Oval Office and Air Force One is unconstitutional, a federal judge said Tuesday.",
    "url": "https://cnn.com/2025/04/08/politics/judge-restores-associated-press-access-to-white-house/"
  },
  {
    "text": "Trump Claims Nazis Treated Jewish Prisoners With “Love” … In his latest rewrite of European history, Donald Trump made a ridiculous and sympathetic declaration about the Nazis.  —  Amid the tariff chaos he spurred, Trump met with Israeli Prime Minister Benjamin Netanyahu in the Oval Office Monday … ",
    "url": "https://newrepublic.com/post/193725/donald-trump-israel-hostages-nazis-jewish-prisoners-love"
  },
  {
    "text": "Trump Officials Freeze $1 Billion for Cornell and $790 Million for Northwestern  —  The funding pause amid civil rights investigations into both universities sharply escalates the Trump administration's campaign against elite colleges.  —  The Trump administration has frozen more than $1 billion … ",
    "url": "https://www.nytimes.com/2025/04/08/us/politics/cornell-northwestern-university-funds-trump.html"
  },
  {
    "text": "Musk calls Navarro “moron” as trade spat intensifies  —  Elon Musk escalated his war of words with Trump trade adviser Peter Navarro on Tuesday, calling him “truly a moron” and “dumber than a sack of bricks” over comments about Musk's businesses.  —  Why it matters: The gloves are off … ",
    "url": "https://www.axios.com/2025/04/08/musk-navarro-moron-trump-tariffs-trade-war"
  },
  {
    "text": "DOJ: Some Jan. 6 defendants should be repaid money they sent to Congress  —  Prosecutors say those whose convictions were wiped out are entitled to reimbursement of the restitution they paid.  —  Jan. 6 defendants whose convictions were wiped out by President Donald Trump are entitled … ",
    "url": "https://www.politico.com/news/2025/04/08/doj-jan-6-congress-00280031"
  },
  {
    "text": "Trump Signs Orders Aimed at Reviving a Struggling Coal Industry  —  The moves include loosening environmental rules, but it is unclear how much they can help reverse the sharp decline in coal power over the last two decades.  —  President Trump signed four executive orders Tuesday aimed … ",
    "url": "https://www.nytimes.com/2025/04/08/climate/trump-order-coal-mining.html"
  },
  {
    "text": "Exclusive: Musk's DOGE using AI to snoop on U.S. federal workers, sources say  —  Trump administration officials have told some U.S. government employees that Elon Musk's DOGE team of technologists is using artificial intelligence to surveil at least one federal agency's communications … ",
    "url": "https://www.reuters.com/technology/artificial-intelligence/musks-doge-using-ai-snoop-us-federal-workers-sources-say-2025-04-08/"
  },
  {
    "text": "Live updates: Trump's approval hits new low after “Liberation Day” tariffs  —  His average economic approval also hits a new low (-13), and his tariffs are underwater by 30 points … As of midday April 8, 2025, two pollsters have published new polls of Trump's approval rating … ",
    "url": "https://www.gelliottmorris.com/p/trump-approval-slides-after-liberation-day-tariffs"
  },
  {
    "text": "White House Confirms Trump Is Exploring Ways To ‘Deport’ U.S. Citizens  —  The administration could try removing American citizens if it identifies a pathway it can claim to be legal.  —  Video  —  White House press secretary Karoline Leavitt said Tuesday that President Donald Trump … ",
    "url": "https://www.huffpost.com/entry/white-house-confirms-trump-is-exploring-ways-to-deport-us-citizens_n_67f580abe4b0a5ea5c7608d2"
  },
  {
    "text": "New Social Security rules will create hurdles for millions of seniors, report finds  —  Americans seeking retirement or survivor benefits from the Social Security Administration will no longer be able to apply over the phone, starting on Monday.  —  Instead, they will have to seek services online … ",
    "url": "https://www.npr.org/2025/04/08/nx-s1-5356476/social-security-new-rules"
  },
  {
    "text": "Dr. Oz Pushed for AI Health Care in First Medicare Agency Town Hall  —  Dr. Oz, who now controls the Centers for Medicare and Medicaid Services and its $1.5 trillion budget, promoted the idea that AI avatars could replace frontline health care workers.  —  Dr. Mehmet Oz, the new administrator … ",
    "url": "https://www.wired.com/story/dr-oz-ai-health-care-medicare-cms-town-hall/"
  },
  {
    "text": "Wall Street Bursts With Anger Over Tariff ‘Stupidity’  —  Billionaire investors are in an unfamiliar position, watching and cringing as tariffs roll on and the stock market reels.  —  Wall Street billionaires are not used to being on the outside looking in.",
    "url": "https://www.nytimes.com/2025/04/08/business/trump-tariff-wall-street-reaction.html"
  },
  {
    "text": "US expected a big travel year, but overseas visitors — angered by Trump — are heading elsewhere  —  Olja Ivanic looked forward to welcoming some cousins from Sweden to her Denver home in June.  Ivanic and the four travelers were planning to go hiking in Colorado and then visit Los Angeles and San Francisco.",
    "url": "https://apnews.com/article/tourism-us-travel-trump-visitors-international-14c31b490fd382d09ad5cae625ddc937"
  },
  {
    "text": "Video of arrest, new details in Trump administration's case targeting Georgetown postdoctoral fellow Dr. Khan Suri for speech on Palestinian rights  —  RICHMOND, Va. - Today Georgetown professor and postdoctoral fellow Dr. Badar Khan Suri filed an amended complaint in his case Khan Suri v. Trump challenging … ",
    "url": "https://ccrjustice.org/home/press-center/press-releases/video-arrest-new-details-trump-administration-s-case-targeting"
  },
  {
    "text": "FBI creates multiagent bodyguard team to protect Dan Bongino  —  The former pro-Trump podcaster is the first deputy director to have a security detail.  Full-time protection could require up to 20 agents, former officials said.  —  The FBI has issued a call for agents to voluntarily serve … ",
    "url": "https://www.nbcnews.com/politics/justice-department/fbi-creates-multiagent-bodyguard-team-protect-dan-bongino-rcna199861"
  },
  {
    "text": "Trump White House Won't Respond to Some Journalists Who Display Their Pronouns  —  Some Trump administration officials have declined to answer questions from several journalists on the basis of their email signatures.  —  The Trump administration formally barred federal workers from listing … ",
    "url": "https://www.nytimes.com/2025/04/08/business/media/white-house-journalists-pronouns.html"
  },
  {
    "text": "Trump admin cuts funding to Princeton University over climate programs  —  The Trump administration is pulling nearly $4 million in funding from Princeton University, the U.S. Department of Commerce announced Tuesday.  —  The big picture: The cuts come days after the administration already paused dozens … ",
    "url": "https://www.axios.com/2025/04/08/princeton-university-funding-cuts-climate-programs"
  },
  {
    "text": "Gabbard Starts a Task Force Focused on Politicization of the Intelligence Agencies  —  The director of national intelligence framed it as an effort to eliminate the politicization of the agencies and to investigate episodes where intelligence was “weaponized.”",
    "url": "https://www.nytimes.com/2025/04/08/us/politics/tulsi-gabbard-intelligence-task-force.html"
  },
  {
    "text": "Suspect in Trump's second alleged assassination attempt asks judge to suppress eyewitness  —  Ryan Routh, the suspect in the second alleged assassination attempt against President Trump, has formally asked a judge to suppress statements from the eyewitness who identified him to police … ",
    "url": "https://www.cbsnews.com/news/ryan-routh-trump-second-assassination-attempt-suspect-suppress-eyewitness/"
  },
  {
    "text": "Trump Is Trying to Deport Students Who Show Up in a ‘Criminal Records Check.’ But Many Have Never Been Convicted  —  What began with Mahmoud Khalil has now expanded into widespread immigration status revocations with no explanation and little apparent recourse.",
    "url": "https://zeteo.com/p/trump-is-trying-to-deport-students"
  },
  {
    "text": "Another Masterful Gambit: DOGE Moves From Secure, Reliable Tape Archives to Hackable Digital Records  —  The Department of Government Efficiency (DOGE) announced Monday that the General Services Administration converted 14,000 magnetic to digital records, and claimed the process saved a million dollars a year.",
    "url": "https://www.404media.co/doge-gsa-magnetic-tape-archives-digital-storage/"
  },
  {
    "text": "FAA's head of air traffic retires early as agency replaces senior managers at Reagan National Airport  —  Tim Arel, the head of the Federal Aviation Administration's Air Traffic Organization, will retire early as part of the second round of buyouts at the Department of Transportation.",
    "url": "https://www.cbsnews.com/news/tim-arel-faa-air-traffic-chief-retires-faa-replacing-dca-managers/"
  },
  {
    "text": "Trump plans to fine migrants $998 a day for failing to leave after deportation order  —  The Trump administration plans to fine migrants under deportation orders up to $998 a day if they fail to leave the United States and to seize their property if they do not pay, according to documents reviewed by Reuters.",
    "url": "https://www.reuters.com/world/us/trump-plans-fine-migrants-998-day-failing-leave-after-deportation-order-2025-04-08/"
  },
  {
    "text": "El Salvador Is Now Viewed as Safer to Visit Than France by the US  —  President Donald Trump's administration on Tuesday elevated El Salvador's travel safety designation to the best possible, putting it above countries in Western Europe, before President Nayib Bukele's visit to the White House next week.",
    "url": "https://www.bloomberg.com/news/articles/2025-04-09/us-grades-el-salvador-as-safer-to-visit-than-france"
  }
]