[
  {
    "text": "Israel's strike on Iran was 8 months in the making  —  Israel's stunning and sprawling operation overnight targeting Iran's nuclear facilities, missile sites, scientists and generals followed eight months of intensive clandestine preparations.  —  Why it matters: The operation launched … ",
    "url": "https://www.axios.com/2025/06/13/how-israel-executed-strike-iran-nuclear"
  },
  {
    "text": "How Israeli spies and pilots crippled an Iranian counterstrike  —  The U.S. and Israel were bracing for swift, fierce retaliation from Iran overnight.  — Thanks to intricately planned maneuvers by Israeli spies and pilots — and shock and disarray on the Iranian side — there was silence.",
    "url": "https://www.axios.com/2025/06/13/israel-mossad-attack-iran-response"
  },
  {
    "text": "In Twist, U.S. Diplomacy Served as Cover for Israeli Surprise Attack  —  Talks seen as a way to keep the peace gave Israel the opportunity to land heavy military blows  —  U.S. negotiations with Iran aimed at curbing Tehran's nuclear program were widely seen as an important way to preserve regional peace.",
    "url": "https://www.wsj.com/world/middle-east/in-twist-u-s-diplomacy-served-as-cover-for-israeli-surprise-attack-c79b2206?st=bbwzoM&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Trump Accidentally Reveals a Dark MAGA Truth—and Hands Dems an Opening  —  This week, President Donald Trump admitted on Truth Social that his mass deportations are hurting farmers and the economy.  Those removals are “taking very good, longtime workers away” from farms and hotels … ",
    "url": "https://newrepublic.com/article/196817/trump-deportations-house-republicans-memo"
  },
  {
    "text": "Trump's Military Crackdown Is Starting To Dent His Poll Numbers  —  Polls show that American voters don't seem to enjoy the threat of military occupation  —  As Donald Trump launched his militarized crackdown in Los Angeles, the president and many of his advisers were convinced that deploying troops … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-military-crackdown-immigration-bad-poll-numbers-1235364381/"
  },
  {
    "text": "All the polls on the LA protests and Trump's response so far  —  I have struggled to come up with more to say on the Los Angeles protests that isn't repetitive of some of the great things other people are writing on the subject.  But then it struck me that it may be useful to readers … ",
    "url": "https://www.gelliottmorris.com/p/all-the-polls-on-the-la-protests"
  },
  {
    "text": "Exclusive: US Marines carry out first known detention of civilian in Los Angeles, video shows  —  Marines deployed to Los Angeles carried out the detention of a civilian on Friday, the U.S. military confirmed after being presented with Reuters images, in the first known detention … ",
    "url": "https://www.reuters.com/world/us/us-marines-carry-out-first-known-detention-civilian-los-angeles-video-shows-2025-06-13/"
  },
  {
    "text": "Trump admin refuses to release Mahmoud Khalil, despite judge's order  —  The Trump administration is keeping Columbia University alumnus Mahmoud Khalil detained, despite a judge's Wednesday order for his release.  —  Why it matters: The administration's tug-of-war with courts over Khalil represents … ",
    "url": "https://www.axios.com/2025/06/13/trump-admin-refuses-to-release-mahmoud-khalil-despite-judges-order"
  },
  {
    "text": "Kristi Noem says the feds are coming to ‘liberate’ Los Angeles  —  We should take the Trump administration seriously when officials threaten a federal takeover of a Democratic-led city.  —  It's understandable that the headlines about the news conference Homeland Security Secretary Kristi Noem held … ",
    "url": "https://www.msnbc.com/opinion/msnbc-opinion/kristi-noem-alex-padilla-detained-los-angeles-ice-rcna212764"
  },
  {
    "text": "Willkie Farr Partners, Unhappy With the Firm's Deal With Trump, Depart for Cooley  —  The departures are the latest fallout for firms that cut deals with President Trump to avoid executive orders.  —  Seven partners at Willkie Farr & Gallagher, a prominent law firm that cut a deal … ",
    "url": "https://www.nytimes.com/2025/06/13/business/willkie-farr-cooley-trump-deal.html"
  },
  {
    "text": "Playing Secretary  —  As war looms, Pete Hegseth's Pentagon is beset by infighting over leaks, drugs, and socks.  How long will Trump stand by his man?  —  On Dan Caldwell's 87th day as a senior official at the Department of Defense, he read some intelligence reports and prepped … ",
    "url": "https://nymag.com/intelligencer/article/defense-secretary-pete-hegseth-pentagon-leaks-signalgate-trump.html"
  },
  {
    "text": "How MAGA Took Over America's 250th Birthday  —  Tanks, armored personnel carriers, and howitzers will roll through the streets of Washington, DC, on Saturday—coming to a halt just steps from where President Donald Trump once exhorted his supporters to “fight like hell” and march on the US Capitol.",
    "url": "https://www.motherjones.com/politics/2025/06/military-parade-army-trump-american250-a250/"
  },
  {
    "text": "Trump is Calling Handcuffed Senator Vile Racial Slur: Author  —  HE'S JUST SAYIN'...  The president found a way to justify the assault on Sen. Padilla in calls to confidants.  —  Donald Trump is trying to justify federal agents handcuffing California Senator Alex Padilla by suggesting that he … ",
    "url": "https://www.thedailybeast.com/trump-is-calling-handcuffed-senator-vile-racial-slur-author/"
  },
  {
    "text": "‘No Kings’ Protests, Citizen-Run ICE Trackers Trigger Intelligence Warnings  —  Army intelligence analysts are monitoring civilian-made ICE tracking tools, treating them as potential threats, as immigration protests spread nationwide.  —  As protests continue to swell across the United States … ",
    "url": "https://www.wired.com/story/no-kings-protests-citizen-run-ice-trackers-trigger-intelligence-warnings/"
  },
  {
    "text": "‘Shoot a couple, the rest will go home’: Far-right groups are sharing scary messages ahead of ‘No Kings’ protests  —  Accounts associated with extremist groups are sharing detailed information about protest organizers, including names and where they work  —  Far-right groups … ",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/trump-protests-no-kings-far-right-b2769812.html"
  },
  {
    "text": "California pastor says apparent immigration agents waved a weapon at her in church parking lot  —  (RNS) — The Rev. Tanya Lopez says a masked man pointed a weapon at her while she was filming a group of unidentified men detaining a man in her church's parking lot.",
    "url": "https://religionnews.com/2025/06/13/in-church-confrontation-apparent-immigration-agents-wave-a-weapon-at-pastor/"
  },
  {
    "text": "‘We will kill you’: Florida sheriff issues stern warning to protesters  —  As protests over the Trump administration's immigration raids continue in Los Angeles and other cities, Florida Attorney General James Uthmeier and law enforcement officials warned that demonstrators could face … ",
    "url": "https://www.cnn.com/2025/06/13/us/video/florida-sheriff-warns-protesters-we-will-kill-you-digvid"
  },
  {
    "text": "Andrew Cuomo for Mayor?  Bill de Blasio Has Thoughts, None of Them Good.  —  In a candid interview, former Mayor Bill de Blasio strenuously argued that former Gov. Andrew M. Cuomo should not be elected to lead New York City: “He is a vindictive person,” Mr. de Blasio said.",
    "url": "https://www.nytimes.com/2025/06/13/nyregion/de-blasio-cuomo-nyc-mayor.html"
  },
  {
    "text": "They Asked an A.I. Chatbot Questions.  The Answers Sent Them Spiraling.  —  Generative A.I. chatbots are going down conspiratorial rabbit holes and endorsing wild, mystical belief systems.  For some people, conversations with the technology can deeply distort reality.",
    "url": "https://www.nytimes.com/2025/06/13/technology/chatgpt-ai-chatbots-conspiracies.html?unlocked_article_code=1.Ok8.VBY-.s76GQpFar8r4&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "US tycoon pours $100mn into Trump crypto project after SEC reprieve  —  Chicago trader Don Wilson backs Trump family's bitcoin venture after administration drops lawsuit",
    "url": "https://www.ft.com/content/548161ee-0cfb-4f0c-90ea-b3ff3567f09d"
  },
  {
    "text": "Stop Looking for Red Lines.  You no Longer Live in a Full Democracy  —  People want to know when we have crossed the line from one state of existence to another.  In watching our democracy die, many people are wondering when we will have crossed the line from life to death, from democracy to autocracy.",
    "url": "https://ryandenos.substack.com/p/stop-looking-for-red-lines-you-no"
  },
  {
    "text": "Senate GOP Strips Provision From Tax Bill That Would Let Trump Rule As A King  —  They removed jarring language from the House GOP's “big, beautiful bill” that would have limited the ability of courts to enforce contempt orders.  —  WASHINGTON - Senate Republicans have quietly removed … ",
    "url": "https://www.huffpost.com/entry/senate-republicans-big-beautiful-bill-contempt-courts-trump_n_684b9b3be4b0c4fd78ff7f2e"
  },
  {
    "text": "The High-Flying Escalation of CBP's Predator Drone Flights Over LA  —  Custom and Border Protection flying powerful Predator B drones over Los Angeles further breaks the seal on federal involvement in civilian matters typically handled by state or local authorities.",
    "url": "https://www.wired.com/story/cbp-predator-drone-flights-la-protests/"
  },
  {
    "text": "Grammys add ‘traditional country’ category following Beyoncé's win  —  The Recording Academy has made a distinct change to its Country Album category — a change that is raising eyebrows online among Beyoncé fans.  —  The Recording Academy has made a distinct change … ",
    "url": "https://www.whatimreading.net/p/grammys-add-traditional-country-category-beyonce"
  }
]