[
  {
    "text": "‘Hands Off!’ protesters across US rally against President Donald Trump and Elon Musk  —  Millions of people took part in protests against President Donald Trump and Elon Musk across all 50 states and globally on Saturday, organized by a pro-democracy movement in response to what they call a … ",
    "url": "https://cnn.com/2025/04/05/us/hands-off-protests-trump-musk"
  },
  {
    "text": "PHOTOS: Check Out These Signs at the “Hands Off!”  Protest in DC  —  Tens of thousands of people rallied on the National Mall to vent frustration at Trump and Musk.  —  In what was billed as a “national day of action,” more than 1,300 “Hands Off!” protests took place in all 50 states … ",
    "url": "https://www.washingtonian.com/2025/04/05/photos-check-out-these-signs-at-the-hands-off-protest-in-dc/"
  },
  {
    "text": "You Can Stop Asking Where the Mass Opposition Is.  It's Everywhere.  —  It is a cliche to begin a story about a rally with a quote from a funny sign, but one small piece of floppy brown cardboard floating down 40th Street in Manhattan on Saturday seemed to capture the mood of this weekend's … ",
    "url": "https://www.motherjones.com/politics/2025/04/hands-off-donald-trump-fear-new-york-city/"
  },
  {
    "text": "Trump-Stronghold The Villages in Florida Holds Large ‘Hands Off!’  Rally  —  Nearly 2,000 residents of the retirement community known as  —  , 20 miles south of Ocala, Florida, joined thousands across the United States in a “Hands Off!” protest against President",
    "url": "https://www.newsweek.com/trump-stronghold-villages-florida-holds-large-hands-off-rally-2055912"
  },
  {
    "text": "Justice Dept. Accuses Top Immigration Lawyer of Failing to Follow Orders  —  Erez Reuveni conceded in court that the deportation last month of Kilmar Armando Abrego Garcia, who had a court order allowing him to stay in the United States, should never have taken place.",
    "url": "https://www.nytimes.com/2025/04/05/us/politics/justice-dept-immigration-lawyer-leave.html"
  },
  {
    "text": "Trump Administration Live Updates: Senior Justice Dept. Lawyer Put on Leave After Questioning Trump Administration  —  Where Things Stand  — Department of Justice: A senior Justice Department immigration lawyer was put on indefinite leave Saturday after questioning the Trump administration's decision … ",
    "url": "https://www.nytimes.com/live/2025/04/05/us/trump-news-tariffs?unlocked_article_code=1.9U4.-q1x.ChL4dqxoYAOa"
  },
  {
    "text": "DOJ places attorney on leave after struggling in Maryland migrant case  —  Pam Bondi said DOJ lawyers must “zealously advocate” for the administration.  —  Attorney General Pam Bondi speaks at a news conference at the Justice Department, Feb. 12, 2025, in Washington.",
    "url": "https://abcnews.go.com/Politics/doj-places-attorney-leave-after-struggling-maryland-migrant/story?id=120526466"
  },
  {
    "text": "DOGE Is Planning a Hackathon at the IRS.  It Wants Easier Access to Taxpayer Data  —  DOGE operatives have repeatedly referred to the software company Palantir as a possible partner in creating a “mega API” at the IRS, sources tell WIRED.  —  Elon Musk's so-called Department of Government Efficiency … ",
    "url": "https://www.wired.com/story/doge-hackathon-irs-data-palantir/"
  },
  {
    "text": "Trump Admin Dismisses Judge's Order to Bring Back Man Accidentally Sent to El Salvador  —  “We suggest the judge contact President Bukele,” said White House Press Secretary Karoline Leavitt … “We suggest the judge contact President Bukele because we are unaware of the judge having jurisdiction … ",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-admin-order-man-accidentally-deported-el-salvador-1235311289/"
  },
  {
    "text": "White House advisers have kept Laura Loomer at bay for months.  Then, Trump invited her in  —  President Donald Trump arranged for far-right activist Laura Loomer to join him in the Oval Office this week for an extraordinary meeting that preceded a shake-up of his national security leadership … ",
    "url": "https://cnn.com/2025/04/05/politics/laura-loomer-donald-trump-meeting"
  },
  {
    "text": "Musk Says He Hopes Europe and U.S. Move to a ‘Zero-Tariff Situation’  —  The billionaire adviser to the Trump administration appeared to part ways with the president in a videoconference appearance with Italy's far-right League party.  —  Only three days after President Trump announced sweeping tariffs … ",
    "url": "https://www.nytimes.com/2025/04/05/us/politics/musk-says-he-hopes-europe-and-us-move-to-a-zero-tariff-situation.html"
  },
  {
    "text": "Trump urges Americans to ‘hang tough’ on tariffs plan as markets tumble  —  Trump on Truth Social claimed that an ‘economic revolution’ is taking place  —  President Donald Trump is doubling down on his controversial tariffs program and has called on Americans to “hang tough” amid stock market turmoil over the last few days.",
    "url": "https://www.foxnews.com/politics/trump-urges-americans-hang-tough-tariffs-plan-markets-tumble"
  },
  {
    "text": "He Said He Would Ban Congressional Stock Trading.  Now in Office, He Trades Freely.  —  Representative Rob Bresnahan Jr., who campaigned on prohibiting stock trading by members of Congress, has emerged as one of the most active stock traders in the freshman class.",
    "url": "https://www.nytimes.com/2025/04/05/us/politics/congress-stock-trading-ban.html"
  },
  {
    "text": "Trump Family's Cash Registers Ring as Financial Meltdown Plays Out  —  The party was on at a Saudi-backed LIV Golf tournament at the president's Doral resort in Florida and a fund-raiser at Mar-a-Lago, even as markets tumbled.  —  The financial market meltdown was underway … ",
    "url": "https://www.nytimes.com/2025/04/05/us/politics/trump-family-saudi-golf.html?unlocked_article_code=1.9U4.Ja7s.tKXlCFXVIMDV"
  },
  {
    "text": "Al Green says he'll present articles of impeachment against Trump in next 30 days  —  Rep. Al Green (D-Texas) said he will bring articles of impeachment against President Trump in the next 30 days, telling protestors at an anti-Trump rally in Washington that he does not “deserve” to hold the executive office.",
    "url": "https://thehill.com/homenews/house/5234386-al-green-donald-trump-impeachment/"
  },
  {
    "text": "Doug Emhoff publicly criticizes his law firm for coming to agreement with Trump administration  —  Speaking at a charity gala dinner Thursday night in Los Angeles, former second gentleman Doug Emhoff condemned the decision by his law firm to preemptively come to an arrangement … ",
    "url": "https://cnn.com/2025/04/05/politics/doug-emhoff-criticizes-his-law-firm-for-coming-to-agreement-with-trump-administraiton"
  },
  {
    "text": "As Trump tariffs sink in, conservatives challenge whether they're legal  —  The New Civil Liberties Alliance, a legal nonprofit, has filed a complaint on behalf of a small stationery company in Florida.  —  Just now  —  A growing number of conservatives are challenging President Donald … ",
    "url": "https://www.washingtonpost.com/politics/2025/04/05/trump-tariffs-sink-conservatives-challenge-whether-theyre-legal/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQzODI1NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ1MjA3OTk5LCJpYXQiOjE3NDM4MjU2MDAsImp0aSI6IjAzOGNiZDdiLWFlMjEtNDNjYy1hZWQ0LTUxODY3NmI2OTM3OCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzA0LzA1L3RydW1wLXRhcmlmZnMtc2luay1jb25zZXJ2YXRpdmVzLWNoYWxsZW5nZS13aGV0aGVyLXRoZXlyZS1sZWdhbC8ifQ.jNnbp5kbkkl8LrF1f1gBodYMu82V9Wkny1h1Z4YM-wA&itid=gfta&sfnsn=mo"
  },
  {
    "text": "DHS officials ask IRS to use tax data to locate up to 7 million immigrants  —  The agencies have still not reached an agreement on sharing information.  But immigration officials now say they're seeking records on millions of people suspected of being in the United States without authorization.",
    "url": "https://www.washingtonpost.com/business/2025/04/05/irs-tax-data-immigration-enforcement/"
  },
  {
    "text": "I was a British tourist trying to leave America.  Then I was detained, shackled and sent to an immigration detention centre  —  Graphic artist Rebecca Burke was on the trip of a lifetime.  But as she tried to leave the US she was stopped, interrogated and branded an illegal alien by ICE.",
    "url": "https://www.theguardian.com/us-news/2025/apr/05/i-was-a-british-tourist-trying-to-leave-america-then-i-was-detained-shackled-and-sent-to-an-immigration-detention-centre"
  }
]