[
  {
    "text": "Trump Rules Out Vivek Ramaswamy as Running Mate as He Eyes New Team  — Former president eyeing loyalty, ideological agreement in pick  — Trump team aiming for smooth transition should he win election  —  Donald Trump has ruled out Vivek Ramaswamy as his running mate and is instead eyeing … ",
    "url": "https://www.bloomberg.com/news/articles/2024-03-18/trump-rules-out-ramaswamy-as-running-mate-as-he-eyes-new-team"
  },
  {
    "text": "Trump Says Jews Who Support Democrats ‘Hate Israel’ and ‘Their Religion’  —  The comments, on a conservative radio program, echo an antisemitic trope and escalate claims he made as president that were widely criticized.  —  Former president Donald J. Trump accused Jewish voters of hating … ",
    "url": "https://www.nytimes.com/2024/03/18/us/politics/trump-israel-jewish-voters.html"
  },
  {
    "text": "Trump is making the Jan. 6 attack a cornerstone of his bid for the White House  —  WASHINGTON (AP) — Republican Donald Trump has launched his general election campaign not merely rewriting the history of the Jan. 6, 2021, Capitol attack, but positioning the violent siege and its failed attempt … ",
    "url": "https://apnews.com/article/donald-trump-jan-6-pardons-2024-campaign-2401ead35cb1402a7b289c2c99761373"
  },
  {
    "text": "Context collapse  —  On Saturday, Donald Trump spoke at a rally in Ohio.  Before he began, an announcer instructed the crowd to rise in tribute to the insurrectionists who stormed the Capitol on January 6, and Trump himself stood and saluted the national anthem as recorded by the “J6 Prison Choir.”",
    "url": "https://www.cjr.org/the_media_today/trump_ohio_speech_bloodbath_media_broadcast_live.php"
  },
  {
    "text": "March 18, 2024  —  It seems to me that the news tends to be slow on weekends during the Biden administration, while Mondays are a firehose.  (In contrast, Trump's people tended to dump news in the middle of the night, after Fox News Channel personality Sean Hannity's show was over, which may or may not have been a coincidence.)",
    "url": "https://heathercoxrichardson.substack.com/p/march-18-2024"
  },
  {
    "text": "Is Donald Trump About to Go Bankrupt?  —  Debt is becoming a major campaign issue in 2024.  I don't mean the national debt, which today stands at 99 percent of gross domestic product and which, the Congressional Budget Office projects, will total 116 percent of GDP 10 years from now.",
    "url": "https://newrepublic.com/article/179879/trump-legal-debts-chubb-payment"
  },
  {
    "text": "Trump Golf Club Settlement Hangs Alina Habba Out to Dry  —  The former president's lawyer may still face fallout for her involvement in an ex-employee's hush money deal over harassment claims at Trump's Bedminster club. … Donald Trump's golf club in Bedminster, New Jersey … ",
    "url": "https://www.thedailybeast.com/trump-new-jersey-golf-club-settlement-hangs-lawyer-alina-habba-out-to-dry"
  },
  {
    "text": "Cannon tells lawyers to weigh if Trump conduct can't be reviewed by courts  —  In classified documents case, legal arguments over jury instructions seem to take precedence over numerous other pretrial issues  —  The judge overseeing Donald Trump's classified-documents case issued … ",
    "url": "https://www.washingtonpost.com/national-security/2024/03/18/trump-judge-cannon-jury-instructions-pra/"
  },
  {
    "text": "Peter Navarro Compares Prison Sentence to Dead American Soldiers  —  The day before heading to prison for contempt of Congress, the ex-Trump aide stood by his decision, describing it as a “much smaller sacrifice.”  —  On the eve of Peter Navarro's first day in prison, the former White House aide … ",
    "url": "https://www.thedailybeast.com/peter-navarro-compares-prison-sentence-to-dead-american-soldiers"
  },
  {
    "text": "Pro-Trump lawyer arrested on bench warrant in Washington, D.C.  —  Stefanie Lambert, a Michigan lawyer who has championed dubious claims of election fraud, was arrested in Washington, D.C., Monday afternoon because of a bench warrant, according to a spokesman for the U.S. Marshals Service.",
    "url": "https://www.detroitnews.com/story/news/politics/2024/03/18/pro-trump-lawyer-stefanie-lambert-arrested-on-bench-warrant-in-washington-dominion-voting-elections/73023957007/"
  },
  {
    "text": "The Left turns on Fani Willis after judge finds ‘an odor of mendacity remains’ in her case against Trump  —  Many of us were demoralized by Fulton County Judge Scott McAfee's decision on Friday to allow District Attorney Fani Willis to continue prosecuting the RICO case against former President Donald Trump and his co-defendants.",
    "url": "https://www.washingtonexaminer.com/restoring-america/2925716/left-turns-on-willis-judge-finds-odor-of-mendacity-case-against-trump/"
  },
  {
    "text": "Biden to target ‘rent gouging’ landlords as high housing costs factor into 2024 race  — President Biden plans to target landlords he claims are keeping rents artificially high.  — Biden's attack on ‘rent gouging’ seeks to shift the blame for stubbornly high housing costs partly onto … ",
    "url": "https://www.cnbc.com/2024/03/19/biden-targets-rent-gouging-landlords-as-high-housing-costs-2024-race.html"
  },
  {
    "text": "Trump sues ABC and Stephanopoulos, alleging defamation over Mace interview  —  Former President Trump sued ABC News and George Stephanopoulos, alleging defamation over the anchor's questioning of Rep. Nancy Mace (R-S.C.) about her endorsement of Trump.  —  The March 10 interview on “This Week” … ",
    "url": "https://thehill.com/regulation/court-battles/4541257-trump-sues-abc-stephanopoulos-alleging-defamation-mace-interview/"
  },
  {
    "text": "US Supreme Court justices, judges face new rules for disclosing free trips  —  U.S. Supreme Court justices and federal judges can no longer avoid disclosing the value of travel-related gifts they receive by classifying such free trips as “reimbursements” on their financial disclosure forms under new regulations now in effect.",
    "url": "https://www.reuters.com/world/us/us-supreme-court-justices-judges-face-new-rules-disclosing-free-trips-2024-03-18/"
  },
  {
    "text": "The Ego Has Crash-Landed  —  If Donald Trump loses November's election, it will be for one reason: He can't help making it all about himself.  —  Donald Trump dominated the news cycle this weekend.  Everybody's talking about the outrageous things he said at his rally in Dayton, Ohio … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/03/donald-trump-ego-election-2024/677797/"
  },
  {
    "text": "Tuberville says GOP leadership should have vetted claims in Katie Britt's speech  —  Sen. Tommy Tuberville (R-Ala.) said GOP leadership should have more carefully reviewed the claims in Sen. Katie Britt (R-Ala.)'s response to President Biden's State of the Union address as she faces criticism … ",
    "url": "https://thehill.com/homenews/senate/4540525-tuberville-says-gop-leadership-should-have-vetted-claims-in-katie-britts-speech/"
  },
  {
    "text": "Business Tax Breaks Face ‘Now or Never’ Moment in Senate  —  Republicans not budging amid warnings of dire consequences for small companies  —  WASHINGTON—U.S. businesses, big and small, have united behind a bipartisan bill to revive expired tax breaks for research and equipment spending … ",
    "url": "https://www.wsj.com/politics/policy/business-tax-breaks-face-now-or-never-moment-in-senate-e55906ee"
  },
  {
    "text": "Hong Kong Passes New Security Bill Cementing China's Control  — Article 23 was fastest bill passed in the city since 1997  — Critics say new law could diminish open economic discussion  —  Hong Kong has fast-tracked into law domestic security legislation that critics … ",
    "url": "https://www.bloomberg.com/news/articles/2024-03-19/hong-kong-passes-local-security-bill-cementing-china-s-control"
  },
  {
    "text": "Ohio 2024 GOP Poll: Moreno 38%, Dolan 29%, LaRose 12%  —  Home Polls Ohio 2024 GOP Poll: Moreno 38%, Dolan 29%, LaRose 12%  —  The final Emerson College Polling Ohio Republican Primary poll, fielded Sunday-Monday before the Tuesday election, finds 38% of likely voters support Bernie Moreno, 29% Matt Dolan, and 12% Frank LaRose.",
    "url": "https://emersoncollegepolling.com/ohio-2024-gop-poll-moreno-38-dolan-29-larose-12/"
  }
]