[
  {
    "text": "Mike Johnson Just Wrecked Trump's Ugly “Working-Class GOP” Scam  —  We keep hearing that the GOP is deeply, existentially conflicted over whether to evolve into a “working-class party.”  Senator Josh Hawley declared as much in The New York Times, urging his party not to slash the safety net to fund … ",
    "url": "https://newrepublic.com/article/195232/mike-johnson-trump-working-class-gop-scam"
  },
  {
    "text": "Republicans wrestle with possible failure of ‘big, beautiful bill’  —  The News  —  The last time one party tried cramming all of its priorities into one bill was four years ago, when the Democratic “Build Back Better” plan sank under its own weight.  —  Some Republicans are starting … ",
    "url": "https://www.semafor.com/article/05/14/2025/republicans-wrestle-with-the-possible-failure-of-their-big-beautiful-strategy-for-trumps-agenda"
  },
  {
    "text": "Gabbard fires leaders of intelligence group that wrote Venezuela assessment  —  The director of national intelligence fired top officials weeks after their group authored an assessment contradicting President Donald Trump's legal rationale for deporting alleged Venezuelan gang members.",
    "url": "https://www.washingtonpost.com/national-security/2025/05/14/gabbard-intelligence-venezuela-tren-de-aragua/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ3MTk1MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ4NTc3NTk5LCJpYXQiOjE3NDcxOTUyMDAsImp0aSI6IjRlZjM3ZGUxLWVlZTktNDljZS04Y2I4LWRkYjY1ODhmNzgxZCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb25hbC1zZWN1cml0eS8yMDI1LzA1LzE0L2dhYmJhcmQtaW50ZWxsaWdlbmNlLXZlbmV6dWVsYS10cmVuLWRlLWFyYWd1YS8ifQ.dhXbaQl0xEEhpOQNANxiWBUjscBSDUlXCxRWgGB6xHc&itid=gfta"
  },
  {
    "text": "Gabbard fires intel officials who oversaw memo contradicting White House claims on Venezuelan gang  —  Democratic lawmakers criticized the firings, suggesting they were punishment for providing information that didn't support the administration's agenda.  —  Director of National Intelligence … ",
    "url": "https://www.nbcnews.com/politics/national-security/gabbard-fires-intel-officials-oversaw-memo-contradicting-white-house-c-rcna206918"
  },
  {
    "text": "U.S. Charges Russian Scientist with Smuggling  —  A government lawyer told a federal judge on Wednesday that the intention is to deport Kseniia Petrova, a Harvard researcher, to Russia.  —  The Trump administration announced criminal smuggling charges on Wednesday against Kseniia Petrova … ",
    "url": "https://www.nytimes.com/2025/05/14/health/detained-russian-scientist-harvard.html?unlocked_article_code=1.HE8.eykt.Pn7-0lBqTsl3&smid=nytcore-android-share"
  },
  {
    "text": "Russian National Charged with Smuggling Biological Material Into Boston  —  For Immediate Release  —  U.S. Attorney's Office, District of Massachusetts  —  BOSTON - A Russian national has been arrested and charged for allegedly attempting to smuggle clawed frog embryos and embryonic samples into the United States.",
    "url": "https://www.justice.gov/usao-ma/pr/russian-national-charged-smuggling-biological-material-boston"
  },
  {
    "text": "Trump Admin Files Smuggling Charges Against Detained HMS Researcher, Plans To Deport Her To Russia  —  Government lawyers said the Trump administration plans to deport Kseniia Petrova, a Harvard Medical School researcher detained by Customs and Border Protection officials in February, back to Russia at a Wednesday hearing.",
    "url": "https://www.thecrimson.com/article/2025/5/15/petrova-vermont-massachusetts/"
  },
  {
    "text": "U.S. AG Pam Bondi Sold More than $1 Million in Trump Media Stock the Day Trump Announced Sweeping Tariffs  —  Attorney General Pam Bondi sold between $1 million and $5 million worth of shares of Trump Media the same day that President Donald Trump unveiled bruising new tariffs that caused … ",
    "url": "https://www.propublica.org/article/pam-bondi-trump-media-stock-tariffs"
  },
  {
    "text": "At Supreme Court, a Once-Fringe Birthright Citizenship Theory Takes the Spotlight  —  Before the Trump presidency, there was broad consensus that the 14th Amendment established birthright citizenship for children born in the United States.  —  Shortly after the Supreme Court announced … ",
    "url": "https://www.nytimes.com/2025/05/14/us/politics/supreme-court-birthright-citizenship.html?unlocked_article_code=1.HE8.Q410.yK0QeKrZnUKh&smid=url-share"
  },
  {
    "text": "White House eased China tariffs after warnings of harm to 'Trump's people'  —  The president has backtracked repeatedly on his tariff policies, creating a whiplash with downsides and few clear benefits so far.  —  Some of the president's top aides saw an opening.",
    "url": "https://www.washingtonpost.com/business/2025/05/14/trump-tariffs-china-trade/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ3MTk1MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ4NTc3NTk5LCJpYXQiOjE3NDcxOTUyMDAsImp0aSI6ImRmMzQxMjk1LTU3NzctNDM1NC05ZTA5LWY5OTZjNjFhNzc4MCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9idXNpbmVzcy8yMDI1LzA1LzE0L3RydW1wLXRhcmlmZnMtY2hpbmEtdHJhZGUvIn0.6SZXjyiHWbKuHY1WxFV7waUmh0lPBsYKNulE6VyklOk&itid=gfta"
  },
  {
    "text": "Democrats rattled again by fresh claims that Biden aides hid his frailty  —  A new book and Biden's public appearances are potential distractions as the party seeks to focus on Trump.  —  A growing number of Democrats are publicly second-guessing their party's handling of the last election … ",
    "url": "https://www.washingtonpost.com/politics/2025/05/14/biden-democrats-age-mental-health-book/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ3MTk1MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ4NTc3NTk5LCJpYXQiOjE3NDcxOTUyMDAsImp0aSI6Ijc3NjQ4MjI2LTgyOGMtNGQxMi04NDUzLWNmZTc4MWZlZGZjOSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzA1LzE0L2JpZGVuLWRlbW9jcmF0cy1hZ2UtbWVudGFsLWhlYWx0aC1ib29rLyJ9.Kku3CtC6KCXiDEB6hfgQAil2j1Oj-4j2oFWij8Ox6sY&itid=gfta"
  },
  {
    "text": "Ben & Jerry's co-founder among those arrested at RFK Jr.'s testimony  —  Ben & Jerry's co-founder Ben Cohen was among seven people arrested during Health Secretary Robert F. Kennedy Jr.'s testimony on Capitol Hill Wednesday, police confirmed.  —  The big picture: Cohen … ",
    "url": "https://www.axios.com/2025/05/14/ben-jerrys-co-founder-arrested-kennedy-hearing-protests"
  },
  {
    "text": "Mexican security chief confirms cartel family members entered US in a deal with Trump administration  —  Mexico's security chief confirmed Tuesday that 17 family members of cartel leaders crossed into the U.S. last week as part of a deal between a son of the former head of the Sinaloa Cartel and the Trump administration.",
    "url": "https://apnews.com/article/el-chapo-sinaloa-cartel-trump-border-harfuch-86572a31c88a216da7cd5f33006a0011"
  },
  {
    "text": "Lord Buffalo Drummer Yamal Said, a Legal U.S. Resident, Detained by Border Patrol  —  Band cancels tour to concentrate on bandmate's safety, freedom  —  The immigration crackdown that has been sweeping up documented U.S. residents and even U.S. citizens has seemingly hit the Austin music scene.",
    "url": "https://www.austinchronicle.com/daily/music/2025-05-14/lord-buffalo-drummer-yamal-said-a-legal-u-s-resident-detained-by-border-patrol/"
  },
  {
    "text": "The Situation: Abandoning America  —  Yale intellectuals congratulate themselves for moving to Canada.  —  benjaminwittes.lawfaremedia.org  —  Meet The Authors … The Situation on Monday pointed out some of the less obvious problems with the president accepting a $400 million flying palace from an authoritarian potentate.",
    "url": "https://www.lawfaremedia.org/article/the-situation--abandoning-america"
  },
  {
    "text": "Multiple Trump White House officials have ties to antisemitic extremists  —  President Trump campaigned on a pledge to fight antisemitism.  —  “Antisemitic bigotry has no place in a civilized society,” Trump said at an event in 2024.  —  However, the president's critics question whether antisemitism … ",
    "url": "https://www.npr.org/2025/05/14/nx-s1-5387299/trump-white-house-antisemitism"
  },
  {
    "text": "CFBP Quietly Kills Rule to Shield Americans From Data Brokers  —  Russell Vought, acting director of the Consumer Financial Protection Bureau, has canceled plans to more tightly regulate the sale of Americans' sensitive personal data.",
    "url": "https://www.wired.com/story/cfbp-quietly-kills-rule-to-shield-americans-from-data-brokers/"
  },
  {
    "text": "Judge Orders Georgetown Academic Released From Immigration Detention  —  The judge said that the government had offered no evidence that Badar Khan Suri represented a national security threat, and that efforts to deport him violated the First Amendment.  —  A federal judge on Wednesday ordered … ",
    "url": "https://www.nytimes.com/2025/05/14/us/politics/georgetown-academic-immigration-detention.html"
  },
  {
    "text": "Scoop: Trump impeachment called “idiotic” in House Dem meeting  —  A rogue Trump impeachment push was criticized as “idiotic” and “horrible” in a closed-door House Democratic meeting Wednesday, Axios has learned.  —  Why it matters: The comments from Rep. Jerry Nadler (D-N.Y.) … ",
    "url": "https://www.axios.com/2025/05/14/trump-impeachment-pelosi-thanedar-nadler"
  },
  {
    "text": "An Afrikaner Refugee Has Thoughts About the Jews  —  It's a Very Special Triad today, cowritten with my buddy Will Sommer, author of our False Flag newsletter.  —JVL  —  1. White Genocide?  —  Quick catchup: This week the State Department sent an official to Dulles International Airport … ",
    "url": "https://www.thebulwark.com/p/an-afrikaner-refugee-south-africa-has-thoughts-about-jews-antisemitism-trump"
  },
  {
    "text": "NOAA scrambles to fill forecasting jobs as hurricane season looms  —  The agency acknowledged “urgent action is needed to sustain mission-critical operations,” as peak severe weather and hurricane season approach.  —  Some National Weather Service forecasting teams are so critically understaffed … ",
    "url": "https://www.washingtonpost.com/weather/2025/05/14/national-weather-service-vacancies-hurricane-season/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ3MTk1MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ4NTc3NTk5LCJpYXQiOjE3NDcxOTUyMDAsImp0aSI6IjQzNjAyYjEwLTliZDMtNDZlNi1iMDVjLWQyOWRkMjY2MDcxZSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS93ZWF0aGVyLzIwMjUvMDUvMTQvbmF0aW9uYWwtd2VhdGhlci1zZXJ2aWNlLXZhY2FuY2llcy1odXJyaWNhbmUtc2Vhc29uLyJ9.GsCPkvCm_1M_9gGAJtJFq7WSd83JyBU4qars8wKkxxQ&itid=gfta"
  },
  {
    "text": "Uber to introduce fixed-route shuttles in major US cities designed for commuters  —  Ride-hail and delivery giant Uber is introducing cheap, fixed-route rides along busy corridors during weekday commute hours in major U.S. cities - one solution to a world that feels, for most people, more expensive everyday.",
    "url": "https://techcrunch.com/2025/05/14/uber-to-introduce-fixed-route-shuttles-in-major-us-cities-other-ways-to-save/"
  },
  {
    "text": "Murphy says ‘no doubt’ Biden suffered cognitive decline while in office  —  Few elected Democrats have so far been as direct in their criticism of the former president.  —  Democratic Sen. Chris Murphy said there's “no doubt” that former President Joe Biden suffered cognitive decline in office … ",
    "url": "https://www.politico.com/news/2025/05/14/murphy-biden-cognitive-decline-2028-00349025"
  },
  {
    "text": "Colorado prosecutor offers unlicensed and undocumented teen probation after deadly crash  —  The Arapahoe District Attorney's Office is defending its decision to give probation and community service to a teenager who was driving illegally and, in the country illegally, when he killed a woman.",
    "url": "https://www.cbsnews.com/colorado/news/colorado-prosecutor-offers-unlicensed-undocumented-teen-probation-deadly-crash/"
  },
  {
    "text": "Fabian Schmidt speaks out for the first time since his detention  —  Fabian Schmidt, who is originally from Germany, made it clear that he's proud to be in America, but said he's still reeling from his unexpected two-month detention that he described as “dehumanizing.”",
    "url": "https://www.wgbh.org/news/local/2025-05-13/fabian-schmidt-speaks-out-for-the-first-time-since-his-detention"
  },
  {
    "text": "Trump's egg price fiction has suddenly become reality  —  For months, President Donald Trump has falsely claimed that egg prices are tumbling.  It wasn't true then, but it's true now.  —  Egg prices fell 12.7% last month, the biggest monthly decline since 1984, the Bureau of Labor Statistics reported Tuesday.",
    "url": "https://cnn.com/2025/05/13/business/egg-prices-trump-inflation"
  },
  {
    "text": "They Were Waiting for Trump All Along  —  Of the endless torrent of illegal, unconstitutional — and anti-constitutional — actions flowing from the Trump administration, there are three that stand out for their contempt for the rule of law.  —  There is the president's ongoing assault … ",
    "url": "https://www.nytimes.com/2025/05/14/opinion/trump-due-process-habeas-corpus.html?unlocked_article_code=1.HE8.2sOh.ngpPdo-CmjI_&smid=url-share"
  },
  {
    "text": "Mar-a-Lago special prosecutor takes the fifth at ‘weaponized’ House committee  —  Jay Bratt asserted constitutional right to silence before panel pursuing people involved in prosecutions of Trump  —  The former special counsel prosecutor Jay Bratt asserted his fifth amendment right … ",
    "url": "https://www.theguardian.com/us-news/2025/may/14/jay-bratt-prosecutor-trump-congress-committee"
  },
  {
    "text": "John Ewing set to become Omaha's first Black mayor and flip the office for Democrats  —  Ewing faced GOP incumbent Jean Stothert, who was running for a fourth term.  —  John Ewing, right, speaks after the first round of results at the election night watch party for John Ewing for Omaha mayor … ",
    "url": "https://abcnews.go.com/Politics/john-ewing-set-become-omahas-black-mayor-flipping/story?id=121797978"
  },
  {
    "text": "The Professors Are Using ChatGPT, and Some Students Aren't Happy About It  —  Students call it hypocritical.  A senior at Northeastern University demanded her tuition back.  But instructors say generative A.I. tools make them better at their jobs.  —  In February, Ella Stapleton … ",
    "url": "https://www.nytimes.com/2025/05/14/technology/chatgpt-college-professors.html?unlocked_article_code=1.HE8.sJHw.KHcPd33Y7gfX"
  },
  {
    "text": "Ousted top federal prosecutor in Washington facing ethics probe  —  The lawyer President Donald Trump tapped to serve as Washington, D.C.'s top prosecutor and then dropped in the face of Senate opposition, said on Wednesday he is facing a professional ethics investigation, according to a letter seen by Reuters.",
    "url": "https://www.reuters.com/world/us/ousted-top-federal-prosecutor-washington-facing-ethics-probe-2025-05-14/"
  }
]