[
  {
    "text": "Obama tells allies Biden needs to seriously consider his viability  —  The former president, hugely influential in the party, has told associates that Biden's path to victory has significantly shrunk.  —  Former president Barack Obama has told allies in recent days that President Biden's path … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/18/obama-says-biden-must-consider-viability/"
  },
  {
    "text": "Behind the Curtain: Top Dems now believe Biden will exit … - The president is being told that if he stays in, former President Trump could win in a landslide and wipe away Biden's legacy and Democrats' hopes in November. … - Democrats fully expect polls after the Republican National Convention … ",
    "url": "https://www.axios.com/2024/07/18/president-biden-drop-out-election-democrats"
  },
  {
    "text": "'We're close to the end': Biden world braces for the possibility that the president steps aside  —  As Trump is about to give a major speech accepting the GOP nomination for president, Biden is off the campaign trail with COVID.  —  WASHINGTON — President Joe Biden's political world is collapsing.",
    "url": "https://www.nbcnews.com/politics/2024-election/biden-world-braces-possibility-president-steps-rcna162494"
  },
  {
    "text": "Sununu says ‘I told you so’ on Biden  —  New Hampshire Gov. Chris Sununu has been saying for a long time that President Joe Biden wouldn't be the Democratic nominee.  A lot of folks wrote that off.  But now, as pressure builds within the Democratic Party to get Biden off the ticket?",
    "url": "https://www.politico.com/live-updates/2024/07/18/rnc-live-updates-coverage/chris-sununu-joe-biden-drop-out-00169400"
  },
  {
    "text": "The End of Biden's Candidacy Approaches  —  At the start of the day yesterday, it was conceivable that Joe Biden might manage to hold on to the Democratic nomination for president.  But this morning, things seem to be slipping out of his grasp.  —  The blows to Biden were both procedural and political … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/07/democrats-push-biden-out/679079/"
  },
  {
    "text": "Biden allies retaliated against a Dem who called for him to step aside  —  The decision to remove battleground Democratic Rep. Hillary Scholten from a coordinated campaign was reversed after POLITICO contacted the Biden campaign.  —  Democrats in Michigan cut off a vulnerable House Democrat … ",
    "url": "https://www.politico.com/news/2024/07/18/biden-allies-retaliate-hillary-scholten-00169387"
  },
  {
    "text": "Pelosi privately told Biden polls show he cannot win and will take down the House; Biden responded with defensiveness  —  Former House Speaker Nancy Pelosi privately told President Joe Biden in a recent conversation that polling shows that the president cannot defeat Donald Trump and that Biden … ",
    "url": "https://www.cnn.com/2024/07/17/politics/nancy-pelosi-biden-conversation/"
  },
  {
    "text": "Biden in crisis  —  The president is isolating at his Delaware shore home as Democratic support appears to crumble around him.  —  REHOBOTH BEACH, Delaware — President Joe Biden's reelection bid appeared to be nearing the point of collapse on Thursday, amid a cascade of warnings … ",
    "url": "https://www.politico.com/news/2024/07/18/biden-in-crisis-00169415"
  },
  {
    "text": "DNC's mad dash to finalize virtual voting plan for Biden nomination … - The goal is to use their convention week to talk up their candidate and tear apart former President Trump.  —  Behind the nasty public debate on whether Biden should be nominated early, there are private conversations … ",
    "url": "https://www.axios.com/2024/07/18/dnc-biden-presidential-nomination-virtual-vote"
  },
  {
    "text": "America will never be the same after Milwaukee's tent revival for the cult of Donald Trump  —  MILWAUKEE — I came to the American Heartland to cover a political convention, but all I found was a tent revival, Brother Trump's Traveling Salvation Show.The Republican National Convention took … ",
    "url": "https://www.inquirer.com/opinion/milwaukee-rnc-cult-donald-trump-20240718.html"
  },
  {
    "text": "MAGA Enters Racist Meltdown Mode Over J.D. Vance's Wife … The past week has seen an outpouring of hate from the far right over the wife of Republican vice presidential nominee J.D. Vance.  The unremarkable fact that Vance is married to Usha Vance, a woman of Indian heritage, has become a fixation for white nationalists online.",
    "url": "https://newrepublic.com/post/183975/maga-racist-meltdown-jd-vance-wife-usha"
  },
  {
    "text": "J.D. Vance Left His Venmo Public.  Here's What It Shows  —  The Republican VP nominee's Venmo network reveals connections ranging from the architects of Project 2025 to enemies of Donald Trump—and the populist's close ties to the very elites he rails against.",
    "url": "https://www.wired.com/story/jd-vance-venmo/"
  },
  {
    "text": "What Secret Service and FBI told Congress about attempted Trump assassination … - FBI and Secret Service officials briefed House lawmakers on Wednesday on their preliminary findings.  — The Secret Service said they identified the building used in the assassination attempt as … ",
    "url": "https://www.axios.com/2024/07/18/secret-service-fbi-trump-assassination-attempt"
  },
  {
    "text": "Hunter Biden cites Trump ruling in seeking dismissal of gun and tax cases … Lawyers for Hunter Biden on Thursday asked federal judges in California and Delaware to dismiss the criminal tax and gun cases against him in their courts, citing a recent opinion by Supreme Court Justice Clarence Thomas … ",
    "url": "https://www.cnbc.com/2024/07/18/hunter-biden-seeks-gun-case-dismissal-cites-trump-classified-documents-ruling.html"
  },
  {
    "text": "Housing provider for unaccompanied migrant children engaged in sexual abuse and harassment, DOJ says  —  The largest housing provider for unaccompanied migrant children has engaged in the “severe, pervasive, and unwelcome” sexual abuse and harassment of children in its care, the Justice Department alleged Thursday.",
    "url": "https://apnews.com/article/migrant-children-provider-lawsuit-0bfd45735aa6d41a4233abe6059f0e1f"
  },
  {
    "text": "Macron wins shock vote to keep coalition hopes alive  —  PARIS — Emmanuel Macron's party formed a last-minute agreement with right-leaning lawmakers to win a key vote in parliament on Thursday that opens the door to the French president playing a greater-than-expected role in forming the country's next government.",
    "url": "https://www.politico.eu/article/emmanuel-macron-france-shock-vote-coalition-centrist-thursday-president-elections-2024-nfp/"
  },
  {
    "text": "Rally shooter had photos of Trump, Biden and other US officials on his phone, AP sources say  —  WASHINGTON (AP) — The 20-year-old Pennsylvania man who tried to assassinate Donald Trump had photos on his phone of the former Republican president, President Joe Biden and other officials … ",
    "url": "https://apnews.com/article/trump-assassination-attempt-shooting-federal-investigation-2a90bdfd23ba9c3569cb9c29a459e87b"
  },
  {
    "text": "July 2024 Swing State Polls  —  Trump Leads Biden in Swing States and National Poll as Biden's Support Declines  —  New polling conducted July 15-16 by Emerson College Polling and sponsored by Democrats for Next Generation finds former President Trump leading Biden in seven swing states and in a national poll.",
    "url": "https://emersoncollegepolling.com/july-2024-swing-state-polls/"
  },
  {
    "text": "A changed Trump?  Some allies detect an ‘existential’ shift after the shooting  —  The question is how long it lasts.  —  MILWAUKEE — In the days since he survived a would-be assassin's bullet, Republicans who have observed and spoken with former President Donald Trump say they have detected … ",
    "url": "https://www.politico.com/news/2024/07/18/trump-shooting-mood-elections-00169413"
  }
]