[
  {
    "text": "Zelensky invites Trump to Ukraine  —  President Volodymyr Zelensky has extended an invitation to Donald Trump to visit Kyiv, with a specific condition attached.  —  Speaking with U.K. broadcaster Channel 4 News, Zelensky said that Trump would be warmly received in the capital under one stipulation … ",
    "url": "https://kyivindependent.com/zelensky-invites-trump-to-ukraine/"
  },
  {
    "text": "Trump's feral close to the New Hampshire primary  —  The former president was magnanimous after winning Iowa.  He quickly returned to form.  —  For all of 17 minutes in Iowa, Donald Trump was magnanimous.  He thanked his campaign managers by name.  He praised Iowans for delivering him a victory.",
    "url": "https://www.politico.com/news/2024/01/20/trumps-feral-close-to-the-new-hampshire-primary-00136707"
  },
  {
    "text": "Trump Confuses Haley and Pelosi, Accusing Rival of Jan. 6 Lapse  —  Donald Trump has often accused former House Speaker Nancy Pelosi of failing to provide adequate security for the Capitol.  On Friday, he inexplicably substituted Nikki Haley's name for Ms. Pelosi's.",
    "url": "https://www.nytimes.com/2024/01/19/us/politics/trump-confuses-haley-and-pelosi-accusing-rival-of-jan-6-lapse.html"
  },
  {
    "text": "Nikki Haley questions whether Trump is ‘mentally fit’ after he confuses her with Nancy Pelosi  —  Haley told supporters in New Hampshire that “we can't have someone else that we question whether they're mentally fit to do this.”  —  MANCHESTER, N.H. — Nikki Haley questioned whether Donald Trump … ",
    "url": "https://www.nbcnews.com/politics/2024-election/nikki-haley-trump-mentally-fit-nancy-pelosi-rcna134887"
  },
  {
    "text": "Stefanik pushes back on reports Trump mixed up Haley, Pelosi  —  Rep. Elise Stefanik (R-N.Y.) pushed back on reports that former President Trump mixed up his GOP presidential primary rival Nikki Haley with former House Speaker Nancy Pelosi (D-Calif.), according to an NBC News report.",
    "url": "https://thehill.com/homenews/campaign/4419704-stefanik-pushes-back-reports-trump-mixed-up-haley-pelosi/"
  },
  {
    "text": "Haley needs a New Hampshire jolt to stop Trump.  But where's the energy?  —  Historically, New Hampshire has been abuzz in the final days before the presidential primary.  But not this time, with Trump on an apparent glide path to the nomination.  —  MANCHESTER, N.H. — Something is missing in New Hampshire.",
    "url": "https://www.washingtonpost.com/politics/2024/01/20/haley-new-hampshire-energy/"
  },
  {
    "text": "Science is revealing why American politics are so intensely polarized  —  Political psychologists say they see tribalism intensifying, fueled by contempt for the other side  —  ATKINSON, N.H. — They stood in line for hours, in steady snow that became steady sleet, to hear the leader of their tribe.",
    "url": "https://www.washingtonpost.com/science/2024/01/20/polarization-science-evolution-psychology/"
  },
  {
    "text": "Top Fani Willis ally calls for lead prosecutor Nathan Wade to step aside  —  A key ally of Fulton County District Attorney Fani Willis (D) said Saturday that the lead prosecutor of the election interference case against former president Donald Trump should step aside amid allegations … ",
    "url": "https://www.washingtonpost.com/national-security/2024/01/20/norm-eisen-fani-willis-nathan-wade/"
  },
  {
    "text": "Hostage families protest outside Netanyahu's home, ramping up pressure for a truce-for-hostages deal  —  JERUSALEM (AP) — Relatives of hostages held by Hamas in Gaza protested Saturday outside the home of Israeli Prime Minister Benjamin Netanyahu, expressing frustration over his government's seeming lack … ",
    "url": "https://apnews.com/article/israel-hamas-war-news-01-20-2024-ba66b165f3e5d1904d30b591199cface"
  },
  {
    "text": "Election-year politics threaten Senate border deal as Trump and his allies rally opposition  —  A politically treacherous dynamic is taking hold as negotiators in Congress work to strike a bipartisan deal on the border and immigration, with vocal opposition from the hard right … ",
    "url": "https://apnews.com/article/congress-border-security-trump-biden-2d2f804057a77bfaa41e64ab601f9b0e"
  },
  {
    "text": "DeSantis to New Hampshire voters: I'll bring ‘Live Free or Die’ motto to White House  —  Republican presidential candidate Ron DeSantis relayed a message to New Hampshire voters ahead of next Tuesday's primary that he will bring the “Live Free or Die” motto if elected president.",
    "url": "https://thehill.com/homenews/campaign/4419886-desantis-new-hampshire-voters-live-free-or-die-motto-white-house/"
  },
  {
    "text": "Trump, Rosendale, Sinema: The big decisions shaping the Senate GOP's odds  —  Republicans are feeling confident they can win back the Senate majority next year.  Some last-minute choices could still muddle their chances.  —  Senate Republicans have a solid shot in the battle for Senate control … ",
    "url": "https://www.politico.com/news/2024/01/20/senate-gop-landscape-00136336"
  },
  {
    "text": "After House Speaker Mike Johnson Pushed Through Israel Aid Package, AIPAC Cash Came Flowing In  —  The American Israel Public Affairs Committee, or AIPAC, donated around $95,000 to Rep. Mike Johnson, R-La., in November, according to The Intercept's analysis of Federal Election Commission records.",
    "url": "https://theintercept.com/2024/01/20/israel-aipac-house-mike-johnson/"
  },
  {
    "text": "Revealed: far-right figures try to create Christian nationalist ‘haven’ in Kentucky  —  Venture fund and real estate startup linked to far-right groups promote residential development as community for rightwingers  —  A venture fund and a real estate startup - both with links to far-right organizations … ",
    "url": "https://www.theguardian.com/us-news/2024/jan/20/kentucky-far-right-community-real-estate-development"
  },
  {
    "text": "Ohio Poised To Become 2nd State To Restrict Gender-Affirming Care For Adults  —  The changes would add bureaucratic hurdles to receiving care, trans advocates say.  —  LOADING  —  Ohio Gov. Mike DeWine announced proposals this month that transgender advocates say could block access … ",
    "url": "https://www.huffpost.com/entry/ohio-poised-to-become-2nd-state-to-restrict-gender-affirming-care-for-adults_n_65abf646e4b076abd7abc40b"
  }
]