[
  {
    "text": "Pardoned Jan. 6 Rioter Already Rearrested on Gun Charges  —  Trump granted clemency to hundreds of alleged or convicted violent criminals.  One is back behind bars … In May 2023, Daniel Ball of Homosassa, Florida, was indicted on 12 counts related to his participation in the attack on the Capitol.",
    "url": "https://www.rollingstone.com/politics/politics-news/jan-6-rioter-pardoned-trump-rearrested-gun-charges-1235243994/"
  },
  {
    "text": "Trump freed a Jan. 6 defendant charged with assaulting police.  DOJ had him arrested again on a gun charge.  —  The charges against Daniel Ball, unrelated to Jan. 6, had been pending since 2023.  —  A Jan. 6 defendant whose felony assault charges were dismissed a day earlier was arrested Wednesday … ",
    "url": "https://www.politico.com/news/2025/01/22/trump-jan-6-defendant-gun-charge-005863"
  },
  {
    "text": "Federal judge says Trump's pardons can't erase ‘immutable’ truth of Jan. 6  —  The judge is the first to speak out after Trump's sweeping clemency and dismissals of more than 1,500 Jan. 6 cases.  —  A federal judge sounded off Wednesday about President Donald Trump's decision to pardon … ",
    "url": "https://www.politico.com/news/2025/01/22/trump-pardons-jan-6-federal-judge-00199948"
  },
  {
    "text": "Trump Revokes Workplace Discrimination Rules Enacted By LBJ In 1965  —  The new president just unwound a landmark anti-discrimination measure implemented amid the height of the Civil Rights Movement.  —  LOADING  —  On Wednesday, President Donald Trump revoked a six-decade-old executive order designed … ",
    "url": "https://www.huffpost.com/entry/trump-executive-order-discrimination-lbj_n_67914b7ce4b0835f2b834b9c"
  },
  {
    "text": "Trump Revokes Order That Banned Discrimination in Federal Hiring  —  His order revokes one signed by President Lyndon B. Johnson in 1965 that prohibited discriminatory practices in hiring and employment in government contracting.  —  President Trump on Wednesday revoked … ",
    "url": "https://www.nytimes.com/2025/01/22/us/politics/trump-order-discrimination-federal-hiring.html?unlocked_article_code=1.rE4.SjUu.oqa6luN6dvDH&smid=url-share"
  },
  {
    "text": "Trump warns he'll adjourn Congress to make recess appointments.  How would that work?  —  President Trump is threatening to use his powers to adjourn Congress so he can make recess appointments for at least some of his top Cabinet nominees and their deputies, enabling them to begin running the largest federal departments.",
    "url": "https://www.cbsnews.com/news/trump-recess-appointments-adjourning-congress/"
  },
  {
    "text": "Justice Department orders investigation of local compliance with Trump immigration crackdown  —  The Justice Department has ordered federal prosecutors to investigate state or local officials who they believe are interfering with the Trump administration's crackdown on immigration … ",
    "url": "https://apnews.com/article/justice-department-immigration-enforcement-f0e3fc616da9746796378d1cd6385b1b"
  },
  {
    "text": "US military ordering thousands more troops to southern border  —  Thousands of additional active duty US troops are being ordered to the southern US border with Mexico, just two days after President Donald Trump mandated that the US military step up its presence there, according to officials familiar with the matter.",
    "url": "https://www.cnn.com/2025/01/22/politics/us-military-troops-southern-border/"
  },
  {
    "text": "CBS 58 weather reporter Sam Kuffel is out after criticizing Elon Musk arm gesture  —  Daniel Bice Mary SpicuzzaMilwaukee Journal Sentinel  —  A Milwaukee TV weather forecaster has been dropped by her station one day after she criticized Elon Musk on social media for his straight-arm gesture that many have likened to a Nazi salute.",
    "url": "https://www.jsonline.com/story/news/politics/2025/01/22/cbs-58s-sam-kuffel-is-out-after-criticizing-elon-musk-arm-gesture/77883983007/"
  },
  {
    "text": "Justice Department freezes all cases in civil rights division  —  The memo doesn't state how long the freeze will last, but it essentially shuts down the civil rights division for at least the first weeks of the Trump administration.  —  The Justice Department has ordered its civil rights division … ",
    "url": "https://www.washingtonpost.com/national-security/2025/01/22/justice-civil-rights-freeze-shutdown/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM3NTIyMDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM4OTA0Mzk5LCJpYXQiOjE3Mzc1MjIwMDAsImp0aSI6IjYzZDVhMjliLTFiODktNDhkOC1hODFkLWQwNzQyZDg4MTE4OSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb25hbC1zZWN1cml0eS8yMDI1LzAxLzIyL2p1c3RpY2UtY2l2aWwtcmlnaHRzLWZyZWV6ZS1zaHV0ZG93bi8ifQ.isWoVdxGAhzYxshHXI9pdB72Xbgq7MGVJsOcVBqTAOA&itid=gfta"
  },
  {
    "text": "CNN to lay off hundreds of employees as post-inauguration transformation begins, sources say … Warner Bros. Discovery's CNN plans to lay off hundreds of employees Thursday as it refocuses the business around a global digital audience, according to people familiar with the matter.",
    "url": "https://www.cnbc.com/2025/01/22/cnn-to-lay-off-hundreds-of-employees-post-inauguration.html"
  },
  {
    "text": "Mississippi politician files ‘Contraception Begins at Erection Act’  —  JACKSON, Miss. (WLBT) - A state senator in Mississippi has filed a bill entitled the “Contraception Begins at Erection Act.”  —  As written by Sen. Bradford Blackmon, the bill would make it “unlawful for a person … ",
    "url": "https://www.wlbt.com/2025/01/22/mississippi-politician-files-contraception-begins-erection-act/"
  },
  {
    "text": "Trump Actions to Undermine Drug Prices Will Cost Medicare Recipients Money  —  One of the nearly 200 executive orders that newly inaugurated President Donald Trump signed on Tuesday reversed several critical policies that President Biden had put in place.  Among those was lowering drug costs for Americans.",
    "url": "https://contrarian.substack.com/p/trump-actions-to-undermine-drug-prices"
  },
  {
    "text": "Trump administration freezes many health agency reports and posts  —  Agencies subject to the HHS directive include the CDC, the NIH, and the FDA  —  The Trump administration has put a freeze on many federal health agency communications with the public through at least the end of the month.",
    "url": "https://www.statnews.com/2025/01/22/trump-administration-orders-health-communications-pause-cdc-hhs-fda/"
  },
  {
    "text": "Trump Seeks to Paralyze Independent Privacy and Civil Liberties Watchdog  —  The Trump White House has told three Democratic-selected members of the Privacy and Civil Liberties Oversight Board to resign or be fired, which would stop the independent agency from functioning.",
    "url": "https://www.nytimes.com/2025/01/22/us/trump-privacy-civil-liberties-oversight-board.html"
  },
  {
    "text": "Bishop who made plea to Trump says she won't apologize  —  The reverend who called on President Trump to have mercy on transgender children and immigrants during a prayer service for his inauguration said in a new interview she would not apologize for her remarks.",
    "url": "https://thehill.com/homenews/administration/5101739-reverend-refuses-apologize-trump/"
  },
  {
    "text": "GOP leaders mull a big debt-and-funding deal with Democrats  —  The option would include an agreement that ties together government funding, border money, disaster aid and a debt-limit hike.  —  House and Senate GOP leaders are internally debating a possible deal with Democrats … ",
    "url": "https://www.politico.com/news/2025/01/22/gop-debt-funding-deal-democrats-00200101"
  },
  {
    "text": "How to Stop Trump in One Stupid Chart  —  For reasons I can't explain, this entire newsletter feels like it was written in ALL CAPS.  So maybe you'll imagine me shouting it at you, like a crazy person.  —  Because basically, that's how I feel right now: Like a crazy person.  Maybe you do, too?",
    "url": "https://www.thebulwark.com/p/how-to-stop-trump-in-one-stupid-chart"
  },
  {
    "text": "Trump's Immigration Plans Are Already Wrecking the Food Industry … Fear of increased ICE raids have already negatively affected the nation's agricultural sector, causing alarm that food prices could skyrocket in the near future as a result of Donald Trump's aggressive immigration policies.",
    "url": "https://newrepublic.com/post/190555/donald-trump-immigration-deportations-farm-workers"
  },
  {
    "text": "Biden's letter to Trump revealed: ‘May God bless you and guide you’  —  Trump teased he may release ‘very nice’ letter from Biden  —  The letter that former President Joe Biden wrote to President Donald Trump upon leaving office on Monday has been exclusively obtained by Fox News.",
    "url": "https://www.foxnews.com/politics/bidens-letter-trump-revealed-may-god-bless-you-guide-you"
  },
  {
    "text": "160 national security staffers are sent home as the White House aligns its team to Trump's agenda  —  President Donald Trump's national security adviser has sidelined about 160 National Security Council aides, sending them home while the administration reviews staffing and tries to align … ",
    "url": "https://apnews.com/article/trump-national-security-council-staffers-d167985d61c96dd278b0e58a402ff865"
  },
  {
    "text": "Former Navy SEAL Said to Be Interim Head of FEMA  —  Cameron Hamilton does not appear to have experience coordinating responses to large-scale disasters, like the wildfires in California.  —  The Trump administration has made a former member of the Navy SEALs who has spoken about the importance … ",
    "url": "https://www.nytimes.com/2025/01/22/climate/fema-announcement-cameron-hamilton.html"
  },
  {
    "text": "Convicted US Capitol rioter turns down Trump pardon  —  One of the people who served jail time for taking part in the US Capitol riot four years ago has refused a pardon from President Donald Trump, saying: “We were wrong that day.”  —  Pamela Hemphill, who pleaded guilty and was sentenced … ",
    "url": "https://www.bbc.com/news/articles/cvged988377o"
  }
]