[
  {
    "text": "Judge Chutkan denies Trump's request to recuse herself in federal election subversion case  —  U.S. District Judge Tanya Chutkan said Wednesday she won't recuse herself from Donald Trump's 2020 election interference case in Washington, rejecting the former president's claims … ",
    "url": "https://apnews.com/article/donald-trump-justice-department-special-counsel-jan-6-8439ca0fcae8e7cf2a15663f9888e75a"
  },
  {
    "text": "‘Let me be blunt’: UAW VP for GM has strong words about Trump's visit to Michigan  —  The UAW's lead negotiator in contract talks with General Motors on Wednesday issued a scathing assessment of former President Donald Trump hours before Trump was due to speak in Detroit.",
    "url": "https://www.freep.com/story/money/cars/general-motors/2023/09/27/mike-booth-gm-trump-uaw-strike/70981329007/"
  },
  {
    "text": "Trump Asked His Lawyers for Ways to Suppress His ‘Perfect Call’  —  The former president says his demand to ‘find’ votes in Georgia was absolutely pristine.  Some of his lawyers have a different view  —  IN PUBLIC, DONALD Trump says his conversation with the Georgia secretary of state asking to … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-georgia-perfect-call-1234832866/"
  },
  {
    "text": "Biden to Create Library Honoring His Friend and Rival John McCain  —  In a stop in Arizona, a key battleground state in next year's election, the president plans to embrace the longtime Republican senator and vocal Trump critic.  —  President Biden plans to announce on Thursday … ",
    "url": "https://www.nytimes.com/2023/09/28/us/politics/biden-mccain-library.html"
  },
  {
    "text": "Trump Tries to Court Blue-Collar Workers at a Nonunion Factory  —  A day after President Biden appeared on a union picket line, the former president will speak at an auto parts factory, but it's unclear whether any striking workers will be in the crowd.  —  Former President Donald J. Trump … ",
    "url": "https://www.nytimes.com/2023/09/27/us/politics/trump-autoworkers-detroit.html"
  },
  {
    "text": "Donald Trump: UAW negotiations 'don't mean as much as you think'  —  Clinton Township — Republican Donald Trump railed against electric vehicles during a campaign stop in suburban Detroit Wednesday night, saying they're too expensive, aren't capable of traveling far enough and would spur job losses for Americans.",
    "url": "https://www.detroitnews.com/story/news/politics/2023/09/27/donald-trump-returns-auto-industry-strike-uaw-ev-taking-center-stage-presidential-election-joe-biden/70960155007/"
  },
  {
    "text": "Republican congressman struggles to answer questions about allegations Biden has influenced the DOJ  —  The House Ways and Means Committee chairman was asked to explain how documents provided by his panel showed evidence of wrongdoing or a two-tiered justice system.",
    "url": "https://www.nbcnews.com/politics/congress/republican-congressman-struggles-answer-questions-biden-allegations-bi-rcna117742"
  },
  {
    "text": "Bombshell: Ways and Means Releases New Documents Revealing Hunter Biden Selling Access to White House, Investigators Blocked from Pursuing Evidence Related to President Biden  —  WASHINGTON, D.C. - New documents released by the Ways and Means Committee today reveal Joe Biden's connections to his son Hunter Biden's business dealings.",
    "url": "https://waysandmeans.house.gov/bombshell-ways-and-means-releases-new-documents-revealing-hunter-biden-selling-access-to-white-house-investigators-blocked-from-pursuing-evidence-related-to-president-biden/"
  },
  {
    "text": "The Second G.O.P. Debate  —  2nd Debate a Frenzy of Attacks as Non-Trump Rivals Try to Shake Up Race  —  The candidates repeatedly talked over and interrupted one another on a chaotic stage as each struggled to notch a breakout moment.  —  Hostile hopefuls sought to dent Trump's commanding lead.",
    "url": "https://www.nytimes.com/live/2023/09/27/us/republican-debate-presidential"
  },
  {
    "text": "Gen. Milley says he has “appropriate” safety measures after Trump social media threat  —  Outgoing Chairman of the Joint Chiefs of Staff Gen. Mark Milley has “appropriate measures” to ensure his safety, he said this week in his first public response to shocking comments made by former President … ",
    "url": "https://www.cbsnews.com/news/general-milley-responds-to-trump-social-media-post-60-minutes/"
  },
  {
    "text": "Mark Milley Taking ‘Safety Precautions’ After Trump Suggested He Deserves Execution  —  After the ex-president accused him of treason, the outgoing Joint Chiefs of Staff chairman said he “will never turn my back on the Constitution.”  —  LOADING  —  Gen. Mark Milley, the outgoing chairman … ",
    "url": "https://www.huffpost.com/entry/general-mark-milley-safety-trump-execution-comment_n_6514be83e4b087c5232043b9"
  },
  {
    "text": "House Votes to Strip Defense Secretary of Salary as Right Wing Flexes Muscles  —  Little more than three days before a government shutdown, the Republican-led House spent the day adding hard-right proposals to a series of doomed spending bills.  —  The Republican-led House voted on Wednesday … ",
    "url": "https://www.nytimes.com/2023/09/27/us/politics/house-republicans-lloyd-austin-salary.html"
  },
  {
    "text": "Donald Trump's Mar-a-Lago estate worth ‘at least’ $300M, not $18M as NY judge cites  —  A New York judge's Tuesday ruling valuing Donald Trump's sprawling, headline-making Florida estate at $18 million has left industry experts perplexed.  —  In his verdict, Manhattan Supreme Court Justice … ",
    "url": "https://nypost.com/2023/09/27/donald-trumps-mar-a-lago-worth-at-least-300m-sources/"
  },
  {
    "text": "Musk's X Cuts Half of Election Integrity Team After Promising to Expand It  —  Elon Musk's X, formerly known as Twitter, is cutting around half of the global team devoted to limiting disinformation and election fraud on the platform, including the head of the group, according to three people familiar with the situation.",
    "url": "https://www.theinformation.com/articles/musks-x-cuts-half-of-election-integrity-team-after-promising-to-expand-it"
  },
  {
    "text": "Four-Time Congressional Candidate Charged in Long-Running Misuse of Campaign Funds  —  For Immediate Release  —  U.S. Attorney's Office, Central District of California  —  LOS ANGELES - Federal prosecutors today unsealed a grand jury indictment that accuses a Torrance man who was a candidate … ",
    "url": "https://www.justice.gov/usao-cdca/pr/four-time-congressional-candidate-charged-long-running-misuse-campaign-funds"
  },
  {
    "text": "New law allows doctors living in ‘hostile’ red states to get abortion training in California  —  Gov. Gavin Newsom signed another round of reproductive health bills into law on Wednesday, including legislation that allows doctors living under “hostile” laws in states where abortion is banned to receive training in California.",
    "url": "https://www.latimes.com/california/story/2023-09-27/medical-residents-in-anti-abortion-states-can-travel-to-california-for-training-under-new-law"
  },
  {
    "text": "Senate adopts resolution requiring men to wear business attire on chamber floor  —  The Senate on Wednesday adopted a resolution requiring male senators to wear a coat, tie and slacks or other long pants on the chamber's floor following days of upheaval sparked by Senate Majority Leader Charles … ",
    "url": "https://www.washingtonpost.com/politics/2023/09/27/senate-dress-code-change/"
  },
  {
    "text": "Ramaswamy: Kids 16 and under shouldn't use ‘addictive’ social media  —  Republican presidential candidate Vivek Ramaswamy argued Wednesday night that children under 16 should not be using “addictive” social media platforms.  —  “This isn't a Republican point or a Democrat point,” … ",
    "url": "https://thehill.com/policy/technology/4227057-ramaswamy-kids-16-and-under-shouldnt-use-addictive-social-media/"
  }
]