[
  {
    "text": "Six States Move Toward Trump in Electoral College Ratings  —  As of July 9, the Democratic Party is living in a state of suspended animation.  Despite growing calls from many in his party to leave the contest, President Joe Biden has made clear he has no intention of dropping out.",
    "url": "https://www.cookpolitical.com/analysis/national/national-politics/six-states-move-toward-trump-electoral-college-ratings"
  },
  {
    "text": "Scoop: Biden rebels in Congress see their revolt crumbling … - One shell-shocked lawmaker who was present at the meeting would offer only one word to characterize it: “Intense.”  — Another described the mood as “pretty much unanimous” that Biden has “got to step down,” adding … ",
    "url": "https://www.axios.com/2024/07/09/biden-house-democrats-withdraw-nominee"
  },
  {
    "text": "Democrats lose ground in 6 states with election forecaster's postdebate shift  —  Former President Trump is gaining ground in key swing states and could threaten to take states once considered to be safe for Democrats, as President Biden struggles to regain ground after a shaky debate performance … ",
    "url": "https://thehill.com/homenews/campaign/4762860-democrats-lose-ground-post-debate-election-forecaster/"
  },
  {
    "text": "Supreme Court Justice Sotomayor's bodyguards shoot would-be carjacker outside her home  —  Two deputy US Marshals shot a would-be carjacker who pulled a gun on him while they were guarding Supreme Court Justice Sonia Sotomayor's home in Washington, DC, authorities said.",
    "url": "https://nypost.com/2024/07/09/us-news/supreme-court-justice-sotomayors-bodyguard-shoots-would-be-carjacker-outside-her-home/"
  },
  {
    "text": "Biden aimed to prove US and global doubters wrong with NATO speech  —  Biden's high-profile address served as both a political and geopolitical test for the president.  —  With the eyes of the world on him, President Joe Biden delivered a forceful speech to open the NATO summit in Washington … ",
    "url": "https://www.politico.com/news/2024/07/09/biden-nato-speech-00167186"
  },
  {
    "text": "Navy sailor tried to access Biden's medical records multiple times  —  A junior Navy sailor attempted to access the medical records of President Biden from a military medical database three times in February but was unable to do so, the U.S. Navy confirms to CBS News.",
    "url": "https://www.cbsnews.com/news/navy-sailor-tries-to-access-biden-medical-records/"
  },
  {
    "text": "President Joe Biden saw neurologist at White House for Jan. 17 exam, press secretary says  —  President Joe Biden saw a neurologist at the White House on Jan. 17 for a neurological exam, the results of which were later reported as part of his annual physical more than a month later, the White House said on Tuesday.",
    "url": "https://apnews.com/article/president-joe-biden-health-neurology-physical-da9e9af344898a74ef6227bf157a1be0"
  },
  {
    "text": "There's a Reason Trump Is Suddenly Lying About Project 2025  —  With all the focus in recent weeks on President Joe Biden's age-related limitations, it's worth remembering that Donald Trump's incessant falsehoods and self-proclaimed desire to be a dictator on Day 1 make him far more unfit for the presidency.",
    "url": "https://slate.com/news-and-politics/2024/07/why-donald-trump-lying-project-2025.html"
  },
  {
    "text": "George Stephanopoulos Says Biden Can't Serve Another 4 Years  —  GEORGE STEPHANOPOULOS BIDEN CAN'T SERVE 4 MORE YEARS … 6:28 PM PT — George Stephanopoulos tells TMZ, “Earlier today, I responded to a question from a passerby.  I shouldn't have.”  An ABC spokesperson tells TMZ … ",
    "url": "https://www.tmz.com/2024/07/09/george-stephanopoulos-president-joe-biden-cant-serve-4-more-years-sidewalk-election/"
  },
  {
    "text": "US Justice Department says it disrupted Russian social media influence operation  —  The U.S Justice Department said on Tuesday that it disrupted a Russian operation that used fake social media accounts enhanced by artificial intelligence to covertly spread pro-Kremlin messages in the United States and abroad.",
    "url": "https://www.reuters.com/world/us/us-justice-dept-says-it-disrupted-russian-social-media-influence-operation-2024-07-09/"
  },
  {
    "text": "House passes GOP bills aiming to block dishwasher and fridge efficiency standards  —  The House on Tuesday passed a pair of bills that aim to block efficiency standards for refrigerators and dishwashers — the latest in a series of Republican efforts to hit the administration on household appliance restrictions.",
    "url": "https://thehill.com/policy/energy-environment/4762579-house-bills-dishwasher-fridge-efficiency/"
  },
  {
    "text": "Former US Sen. Jim Inhofe, defense hawk who called human-caused climate change a ‘hoax,’ dies at 89  —  OKLAHOMA CITY (AP) — Former Sen. Jim Inhofe, a conservative firebrand known for his strong support of defense spending and his denial that human activity is responsible for the bulk of climate change, has died.",
    "url": "https://apnews.com/article/republican-senator-jim-inhofe-obit-2a3ac758737845c0aa2e05ae2036005b"
  },
  {
    "text": "Russia aims to undermine Biden in November election, intel officials say  —  Previous U.S. intelligence assessments dating to 2016 concluded that Russia sought to weaken support for the Democratic Party and boost Donald Trump's candidacy.  —  Russia's efforts to influence … ",
    "url": "https://www.nbcnews.com/investigations/russia-aims-undermine-biden-november-election-intel-officials-say-rcna161011"
  },
  {
    "text": "Josh Hawley: 'I'm advocating Christian nationalism'  —  U.S. Senator Josh Hawley (R-MO) declared Monday he is advocating for Christian nationalism, a far-right ideology that claims there is no separation of church and state in the Constitution, and promotes as a national religion Christian fundamentalism … ",
    "url": "https://www.rawstory.com/josh-hawley-im-advocating-christian-nationalism/"
  },
  {
    "text": "Chuck Schumer Has a New Plan to Throw Donald Trump in Jail  —  Senate Majority Leader Chuck Schumer has a new plan to ensure Donald Trump spends the rest of his days in prison.  Amid the battle over Joe Biden's senility among Democrats, Schumer moved to a different topic … ",
    "url": "https://redstate.com/bonchie/2024/07/09/chuck-schumer-has-a-new-plan-to-throw-donald-trump-in-jail-n2176551"
  },
  {
    "text": "Trident Exclusive: Trump VP hopeful Byron Donalds' ex-wife shares her story, says what he's doing is “super-dangerous”  —  When Bisa Hall met fellow Florida A&M University freshman Byron Donalds on campus in 1996, she believed the future Congressman and Donald Trump vice-presidential short-lister was from another country.",
    "url": "https://floridatrident.org/trident-exclusive-trump-vp-hopeful-byron-donalds-ex-wife-shares-her-story-says-what-hes-doing-is-super-dangerous/"
  },
  {
    "text": "Senators file official demand for criminal investigation of Clarence Thomas  —  Democratic senators are calling for the Justice Department to appoint a special counsel to investigate allegations that Supreme Court Justice Clarence Thomas violated federal ethics and tax laws.",
    "url": "https://www.rawstory.com/clarence-thomas-2668710003/"
  },
  {
    "text": "Pence slams RNC platform as ‘a profound disappointment’  —  Pence took aim at Trump's abortion stance in the statement Tuesday without mentioning him directly.  —  Former Vice President Mike Pence slammed the updated Republican National Committee platform Tuesday after GOP leaders abandoned … ",
    "url": "https://www.politico.com/news/2024/07/09/pence-slams-rnc-platform-abortion-00167169"
  },
  {
    "text": "What happened the last time Democrats swapped out nominees in high-profile races  —  Analysis: Two Senate contests from two decades ago shed some light on the weighty decisions confronting Democrats amid their doubts about President Joe Biden.  —  Gauging the fallout from a potential Joe Biden withdrawal … ",
    "url": "https://www.nbcnews.com/politics/2024-election/steve-kornacki-democrats-swapped-nominees-senate-biden-rcna160855"
  },
  {
    "text": "July 2024 National Poll: Trump 46%, Biden 43%  —  Home Polls July 2024 National Poll: Trump 46%, Biden 43%  —  The latest Emerson College Polling survey finds former President Donald Trump leading President Joe Biden in a national matchup, 46% to 43%; 11% are undecided.",
    "url": "https://emersoncollegepolling.com/july-2024-national-poll-trump-46-biden-43/"
  },
  {
    "text": "Don't Fall for the GOP's Platform Lie  —  A leaked draft of the new Republican party platform says that fetuses have a constitutional right to personhood, a radical stance in a moment when Americans overwhelmingly oppose bans and want abortion to be legal.  And despite headlines to the contrary … ",
    "url": "https://jessica.substack.com/p/dont-fall-for-the-gops-platform-lie"
  }
]