[
  {
    "text": "Jordan and the GOP find a new low point in speaker mess  —  There are few things Congress loves more than a short-term solution to a long-term problem — something to help it forestall difficult decisions and paper over divisions in hopes that, at some later date, these problems will magically disappear.",
    "url": "https://www.washingtonpost.com/politics/2023/10/19/jim-jordan-speaker-mchenry-speaker/"
  },
  {
    "text": "In the latest sign of House chaos, the temporary speaker is threatening to quit  —  Rep. Patrick McHenry, R-N.C., is resisting a push to get him to move legislation without an explicit vote to expand his powers.  —  WASHINGTON — In a closed-door meeting Thursday, Rep. Patrick McHenry … ",
    "url": "https://www.nbcnews.com/politics/congress/patrick-mchenry-house-speaker-pro-tempore-threaten-quit-rcna121314?taid=6531a4f91b640e000108b4c6"
  },
  {
    "text": "House GOP drowning as crisis reaches breaking point  —  It seems that every day without a speaker brings a new release of pent-up anger from Republicans who see no way out of their self-inflicted pain.  —  When Matt Gaetz stepped to the microphones during Thursday's three-hour private House GOP meeting … ",
    "url": "https://www.politico.com/news/2023/10/19/house-gop-speaker-mccarthy-gaetz-00122617"
  },
  {
    "text": "Jim Jordan tries again?  —  Good morning, Early Birds.  If you reading this newsletter hasn't slaked your interest in the speakership race, we encourage you to listen to our colleagues Marianna Sotomayor and Paul Kane break everything down on The Post's fabulous podcast, “Post Reports.”",
    "url": "https://www.washingtonpost.com/politics/2023/10/20/jim-jordan-tries-again/"
  },
  {
    "text": "Trump co-defendant Kenneth Chesebro rejected plea offer from Georgia prosecutors  —  The Trump campaign adviser turned down the offer last month, a source said.  Sidney Powell, who had been scheduled to stand trial with Chesebro, pleaded guilty on Thursday.",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-co-defendant-kenneth-chesebro-rejected-plea-offer-georgia-prosec-rcna121325"
  },
  {
    "text": "Team Trump Never Dreamed Sidney Powell Would Flip on Them  —  She was the ultimate MAGA conspiracy theorist.  Then she got charged with being part of a criminal conspiracy, and her tune started to change  —  Sidney Powell was the wildest of MAGA diehards — someone who swore long past … ",
    "url": "https://www.rollingstone.com/politics/politics-features/team-trump-sidney-powell-flip-rico-fulton-county-1234858576/"
  },
  {
    "text": "Jack Smith Slams Trump's Bid to Dismiss Jan. 6 Charges: ‘The Defendant Is Not Above The Law’  —  Donald Trump should not be exempt from prosecution on ‘presidential immunity’ grounds, prosecutors in the special counsel's office argued in a court filing Thursday night",
    "url": "https://themessenger.com/politics/trump-jack-smith-not-above-the-law"
  },
  {
    "text": "Christie Challenges Trump: 'You'll Have to Face Me One Way or Another.  Get Ready'  —  Christie says Trump's secret service detail makes it a little more ‘complicated’ for him to face Trump … GOP presidential hopeful and former New Jersey Gov. Chris Christie is telling former President Donald Trump to … ",
    "url": "https://themessenger.com/politics/christie-challenges-trump-youll-have-to-face-me-one-way-or-another-get-ready"
  },
  {
    "text": "Biden tries to make it a foreign policy election  —  Presented by With help from Eli Okun and Garrett Ross  —  DRIVING THE DAY  —  HAPPENING TODAY — AP: “Jury selection is set to begin Friday for the first defendant to go to trial in the Georgia case that accuses former President DONALD TRUMP … ",
    "url": "https://www.politico.com/newsletters/playbook/2023/10/20/biden-tries-to-make-it-a-foreign-policy-election-00122678"
  },
  {
    "text": "Full Transcript: Biden's Speech on Israel-Hamas and Russia-Ukraine Wars  —  The president laid out what he characterized as the stakes for democracy as he pleaded with Americans to stand firmly behind Israel and Ukraine. … Good evening, my fellow Americans.  —  We're facing an inflection point in history.",
    "url": "https://www.nytimes.com/2023/10/19/us/politics/transcript-biden-speech-israel-ukraine.html"
  },
  {
    "text": "Maryland circuit court judge killed in driveway of home, police say  —  Washington County Circuit Court Judge Andrew Wilkinson, 52, was found with apparent gunshot wounds and died at a hospital, authorities said.  —  A Maryland judge was found apparently shot in the driveway of his home Thursday evening and later died, officials say.",
    "url": "https://www.nbcnews.com/news/us-news/maryland-circuit-court-judge-killed-driveway-home-police-say-rcna121366"
  },
  {
    "text": "Judge Won't Let Alex Jones Use Bankruptcy to Avoid Sandy Hook Damages  —  A Texas court ruling means the Infowars broadcaster must pay most of the $1.4 billion he owes Sandy Hook families, regardless of whether his business survives.  —  The judge in Alex Jones's bankruptcy case ruled … ",
    "url": "https://www.nytimes.com/2023/10/19/us/politics/alex-jones-sandy-hook.html"
  },
  {
    "text": "Elon Musk's X removes the New York Times' verification badge  —  The unexplained decision removes the only symbol distinguishing the news organization from impostors and comes amid a flood of false information related to the Israel-Gaza war, some of which Musk has personally endorsed.",
    "url": "https://www.washingtonpost.com/technology/2023/10/19/x-twitter-nyt-dispute-musk/"
  },
  {
    "text": "Trump leads Biden, builds support among young voters: poll  —  Former President Trump leads President Biden in a hypothetical 2024 general election matchup by 2 points and is improving his standing among young voters, according to a new poll.  —  An Emerson College poll released Friday showed Trump ahead … ",
    "url": "https://thehill.com/homenews/campaign/4265622-trump-leads-biden-builds-support-among-young-voters-poll/"
  },
  {
    "text": "Dean Phillips has told lawmakers he's running against Joe Biden  —  But one person who talked to the representative said he was still being coy.  —  Rep. Dean Phillips has begun signaling to fellow House members that he plans to launch a challenge to President Joe Biden.",
    "url": "https://www.politico.com/news/2023/10/19/dean-phillips-biden-minnesota-democrat-00122642"
  },
  {
    "text": "Laphonza Butler Will Not Run for Senate in 2024  —  Ms. Butler, who was appointed by Gov. Gavin Newsom just weeks ago to fill Dianne Feinstein's seat, said she had realized that “this is not the greatest use of my voice.”  —  Laphonza Butler, who was appointed 18 days ago to fill … ",
    "url": "https://www.nytimes.com/2023/10/19/us/laphonza-butler-senate-california.html"
  },
  {
    "text": "Exclusive: US Army charges Private Travis King with desertion over dash into North Korea  —  The U.S. Army has charged Private Travis King with crimes ranging from desertion for running into North Korea in July to assault against fellow soldiers and solicitation of child pornography, according to documents obtained by Reuters.",
    "url": "https://www.reuters.com/world/us/us-army-charges-private-travis-king-with-desertion-over-dash-into-north-korea-2023-10-20/"
  }
]