[
  {
    "text": "Musk calls MAGA element “contemptible fools” as virtual civil war brews … - The schism may force Trump to ultimately take sides between the largely white, working-class supporters who first made MAGA succeed, and the techno-libertarian billionaires like Musk who are at the center of his new administration.",
    "url": "https://www.axios.com/2024/12/27/elon-musk-contemptible-fools-maga-doge"
  },
  {
    "text": "Elon Musk accused of censoring conservatives on X who disagree with him about immigration  —  The claims came after Elon Musk was involved in a public feud with some Republicans over immigration.  —  Tech billionaire Elon Musk faced accusations of censorship Friday from fellow conservatives … ",
    "url": "https://www.nbcnews.com/tech/social-media/elon-musk-accused-censoring-laura-loomer-maga-republicans-x-rcna185569"
  },
  {
    "text": "Maga v Musk: Trump camp divided in bitter fight over immigration policy  —  Feud flared up when president-elect chose Sriram Krishnan, an Indian-born entrepreneur, as his AI adviser  —  Bitter in-fighting has broken out between the tech billionaire Elon Musk and Donald Trump's hardline … ",
    "url": "https://www.theguardian.com/us-news/2024/dec/27/trump-elon-musk-sriram-krishnan"
  },
  {
    "text": "Janet Yellen tells Congress US could hit debt limit in mid-January  —  Treasury Secretary Janet Yellen said her agency will need to start taking “extraordinary measures,” or special accounting maneuvers intended to prevent the nation from hitting the debt ceiling, as early as January 14 … ",
    "url": "https://apnews.com/article/treasury-debt-limit-yellen-trump-elections-republicans-9c5d27c08feb744f5ee59dc2c87a06d5"
  },
  {
    "text": "Yellen: US will hit debt ceiling in mid- or late-January  —  Treasury Secretary Janet Yellen said Friday she expects the U.S. will officially run up against its borrowing limit in mid- to late-January, starting the clock on a major fiscal challenge facing President-elect Donald Trump in his first months in office.",
    "url": "https://www.politico.com/live-updates/2024/12/27/congress/yellen-sees-u-s-hitting-debt-ceiling-in-early-2025-00196091"
  },
  {
    "text": "Trump urges Supreme Court to hit pause on a law that could ban TikTok in the U.S. next month  —  The Supreme Court is scheduled to hear arguments in the case on Jan. 10.  The law is set to take effect on Jan. 19, one day before President-elect Donald Trump is sworn in.",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-urges-supreme-court-hit-pause-law-ban-tiktok-us-month-rcna185606"
  },
  {
    "text": "Trump Urges Supreme Court to Pause TikTok Ban  —  The president-elect took no position on the app's First Amendment challenge to the law, which sets a Jan. 19 deadline to sell or close the popular platform.  —  President-elect Donald J. Trump filed an unusual brief on Friday asking … ",
    "url": "https://www.nytimes.com/2024/12/27/us/politics/tiktok-ban-supreme-court-trump.html"
  },
  {
    "text": "US sanctions former Georgia prime minister amid political turmoil  —  The U.S. has imposed sanctions on Georgia's former prime minister and billionaire Bidzina Ivanishvili, accusing him and the ruling party he founded of “undermining” the country's “democratic and Euro-Atlantic future” to benefit Russia.",
    "url": "https://thehill.com/policy/international/5058366-bidzina-ivanishvili-georgia-sanctions/"
  },
  {
    "text": "Acute respiratory infections complicated by malaria (previously undiagnosed disease) - Democratic Republic of the Congo  —  Situation at a glance  —  This is an update to the Disease Outbreak News on Undiagnosed disease in the Democratic Republic of the Congo published on 8 December 2024 … ",
    "url": "https://www.who.int/emergencies/disease-outbreak-news/item/2024-DON547"
  },
  {
    "text": "Dean Phillips Was Right About Joe Biden.  He Finds It ‘Awfully Unsatisfying.’  —  The three-term lawmaker and presidential candidate is deeply disappointed with his fellow Democrats.  —  Outgoing Minnesota Rep. Dean Phillips poses for a portrait at his home in Capitol Hill in Washington on Dec. 16.",
    "url": "https://www.politico.com/news/magazine/2024/12/28/dean-phillips-congress-exit-interview-00195232"
  },
  {
    "text": "Statement from President Joe Biden on the Passing of Former Prime Minister Manmohan Singh of India  —  Jill and I join the people of India in grieving the loss of former Indian Prime Minister Manmohan Singh.  —  The unprecedented level of cooperation between the United States and India today … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/12/27/statement-from-president-joe-biden-on-the-passing-of-former-prime-minister-manmohan-singh-of-india/"
  },
  {
    "text": "'He's Not Going to Please Everyone.' John Thune's Delicate Task Under Trump  —  The small-town South Dakotan rose to the Senate's top post by deftly navigating spending fights and the ascent of MAGA",
    "url": "https://www.wsj.com/politics/john-thune-senate-majority-leader-profile-aa1eb7b1"
  },
  {
    "text": "US homelessness up 18% as affordable housing remains out of reach for many people  —  The United States saw an 18.1% increase in homelessness this year, a dramatic rise driven mostly by a lack of affordable housing as well as devastating natural disasters and a surge of migrants in several parts … ",
    "url": "https://apnews.com/article/homelessness-population-count-2024-hud-migrants-2e0e2b4503b754612a1d0b3b73abf75f"
  },
  {
    "text": "America Needs a National Healthcare System  —  The for-profit health insurance industry has attached itself to us like a giant, bloodsucking tick and “Scientific Racism” is part of the reason why  —  There's only one person in this photograph/video of a recent G7 meeting who represents … ",
    "url": "https://hartmannreport.com/p/america-needs-a-national-healthcare"
  },
  {
    "text": "Judge signals that contempt hearing for Rudy Giuliani over his assets might not go well for him  —  A federal judge is signaling that Rudy Giuliani's contempt hearing next Friday might not end so well for the former New York City mayor and onetime personal lawyer for President-elect Donald Trump … ",
    "url": "https://apnews.com/article/rudy-giuliani-defamation-georgia-election-workers-4bd622388a8ef296f6a8ead1bff59462"
  }
]