[
  {
    "text": "Georgia court website briefly publishes, removes document about potential Trump charges  —  The Fulton County, Georgia, court's website briefly posted a document on Monday listing several criminal charges against former U.S. President Donald Trump that appeared related to his attempts to overturn … ",
    "url": "https://www.reuters.com/legal/us-state-georgia-appears-set-file-charges-against-donald-trump-court-document-2023-08-14/"
  },
  {
    "text": "Exclusive: Former Republican legal officials endorse special counsel's speedy trial date proposal in Trump Jan. 6 case  —  Nearly a dozen Republican-appointed former judges and high-ranking federal senior legal officials on Monday endorsed the January 2, 2024, trial date proposed … ",
    "url": "https://www.cnn.com/2023/08/14/politics/republican-legal-officials-trump-interference-case/"
  },
  {
    "text": "Trump tells Georgia witness not to testify … - “He shouldn't. … - Duncan, who criticized Trump's false election fraud claims in 2020, said Saturday that he had been told to appear Tuesday before the Fulton County grand jury.  — “Republicans should never let honesty be mistaken for weakness,” he wrote in a post on X.",
    "url": "https://www.axios.com/2023/08/14/trump-georgia-witness-duncan-fulton-county"
  },
  {
    "text": "'He's going to be very surprised': Georgia DA Fani Willis prepares to face off with Trump  —  Legal watchers say the Fulton county district attorney's entire career has prepared her for the prosecution of Donald Trump  —  The fight for democracy is supported by",
    "url": "https://www.theguardian.com/us-news/2023/aug/14/donald-trump-prosecutor-fulton-county-georgia-district-attorney-fani-willis"
  },
  {
    "text": "Trump jabs at judge in election case, testing warning against ‘inflammatory’ statements  —  Overnight, Trump called Chutkan ‘biased and unfair’ for comments during 2022 sentencing of Jan. 6 defendant.  —  Donald Trump slammed the judge presiding over his newest criminal case early Monday … ",
    "url": "https://www.politico.com/news/2023/08/14/trump-inflammatory-comments-judge-chutkan-00111041"
  },
  {
    "text": "Trump ups the ante on going after judges and witnesses.  Where's the line?  —  Thrice-indicted former president Donald Trump seems intent on testing the rules that apply to tampering with witnesses and intimidating judges.  —  Despite being warned about such things, he shows no sign of slowing down … ",
    "url": "https://www.washingtonpost.com/politics/2023/08/14/trump-ups-ante-going-after-judges-witnesses-wheres-line/"
  },
  {
    "text": "Judge rules in favor of Montana youths in landmark climate decision  —  ‘This is a monumental decision,’ said a lawyer for the young plaintiffs, and could influence how judges handle similar cases in other states  —  In the first ruling of its kind nationwide, a Montana state court decided Monday … ",
    "url": "https://www.washingtonpost.com/climate-environment/2023/08/14/youths-win-montana-climate-trial/"
  },
  {
    "text": "She Wasn't Able to Get an Abortion.  Now She's a Mom.  Soon She'll Start 7th Grade.  —  Ashley just had a baby.  She's sitting on the couch in a relative's apartment in Clarksdale, Miss., wearing camo-print leggings and fiddling with the plastic hospital bracelets still on her wrists.",
    "url": "https://time.com/6303701/a-rape-in-mississippi/"
  },
  {
    "text": "Alabama Republicans defend not creating a second majority Black district in court  —  Hearings over a new map that defied the original court order kicked off in federal court in Alabama on Monday.  —  Alabama Republicans were ordered by a federal court to redraw their congressional maps … ",
    "url": "https://www.politico.com/news/2023/08/14/alabama-redistricting-map-court-00111100"
  },
  {
    "text": "How America Got Mean  —  In a culture devoid of moral education, generations are growing up in a morally inarticulate, self-referential world.  —  Over the past eight years or so, I've been obsessed with two questions.  The first is: Why have Americans become so sad?",
    "url": "https://www.theatlantic.com/magazine/archive/2023/09/us-culture-moral-education-formation/674765/"
  },
  {
    "text": "McConnell in Winter: Inside the GOP Leader's Attempt to Thwart Trump  —  The Kentucky Republican is doing all he can to bolster Ukraine, preserve NATO and help his party maintain its Reaganite roots.  —  From the Senate floor and Washington fundraisers to awards banquets … ",
    "url": "https://www.politico.com/news/magazine/2023/08/14/mitch-mcconnell-trump-00110969"
  },
  {
    "text": "DeSantis urges Bob Iger to drop Disney lawsuit, accept the end of ‘special privileges’  — Florida Gov. Ron DeSantis told CNBC that Disney CEO Bob Iger should drop his company's political retaliation lawsuit.  — The lawsuit centers on Walt Disney World's special tax district … ",
    "url": "https://www.cnbc.com/2023/08/14/desantis-urges-bob-iger-to-drop-disney-lawsuit-accept-the-end-of-special-privileges.html"
  },
  {
    "text": "Nevada jumps in front of South Carolina in GOP early voting  —  After announcing its caucuses will be Feb. 8, only one of the four early states is left to set its primary date.  —  Nevada's 2024 GOP presidential caucuses will be on Feb. 8 of next year, jumping ahead of the South Carolina primary … ",
    "url": "https://www.politico.com/news/2023/08/14/nevada-jumps-south-carolina-gop-early-voting-00111105"
  },
  {
    "text": "‘Fully expected the downfall’: Inside DeSantis's brawls with Fla. Republicans  —  Some who knew the Florida governor in Tallahassee say they expected him to have trouble translating his governance of the state into a coalition that could win him the presidency",
    "url": "https://www.washingtonpost.com/politics/2023/08/14/desantis-florida-republicans-2024-election/"
  },
  {
    "text": "Trump Leads Close Race For Second Place  —  FOR IMMEDIATE RELEASE  —  Kaplan Strategies Unveils Latest Nationwide Republican Primary Poll Results, Reflecting Continued Trends from July  —  Kaplan Strategies recently conducted a comprehensive poll of Likely Republican Primary voters across the nation … ",
    "url": "https://kaplanstrategies.com/2023/08/14/trump-leads-close-race-for-second-place/"
  },
  {
    "text": "Hunter Biden Says Prosecutors Reneged on Plea Deal  —  In brief filing, Biden legal team insists that deal to avoid charge on felony gun-possession should stand  —  Hunter Biden's legal team said late Sunday the Justice Department had decided to “renege on the previously agreed-upon plea agreement … ",
    "url": "https://www.wsj.com/articles/hunter-biden-says-prosecutors-reneged-on-plea-deal-d7a4cb1d?mod=djemalertNEWS"
  },
  {
    "text": "Trump's Bid to Sink the Manhattan DA's Case Has Already Made It Stronger  —  Trump tried to drag the Manhattan DA into federal court and failed.  Now a judge's order in that case can be used to persuade a state court that Trump's charges should stick.  —  Donald Trump's attempts this summer … ",
    "url": "https://www.thedailybeast.com/trumps-bid-to-sink-the-manhattan-da-alvin-braggs-case-has-already-made-it-stronger"
  },
  {
    "text": "The Media Still Doesn't Get Biden Voters  —  CONSERVATIVE AND MAINSTREAM MEDIA don't agree on much, but one point of consensus is that everyone should work harder to understand Trump supporters.  The implicit message: You don't have to agree with the populist right, but you should be listening to … ",
    "url": "https://plus.thebulwark.com/p/media-still-doesnt-get-biden-voters"
  }
]