[
  {
    "text": "Trump has no immunity from Jan. 6 prosecution, appeals court rules  —  A federal appeals court has unanimously ruled that Donald Trump can be put on trial for trying to stay in power after losing the 2020 election, rejecting Trump's sweeping claim of presidential immunity and moving the case one step closer to a jury.",
    "url": "https://www.washingtonpost.com/dc-md-va/2024/02/06/trump-jan-6-immunity-appeal-denied/"
  },
  {
    "text": "Accountant's Apparent Lies Further Dooms Trump's Bank Fraud Defense  —  Trump accountant Allen Weisselberg is apparently working out a deal addressing lies he told on the stand in the New York bank fraud trial.  Now Trump is in even more trouble.  —  Donald Trump's expected massive loss … ",
    "url": "https://www.thedailybeast.com/judge-demands-trump-explain-his-accountant-allen-weisselbergs-apparent-lies"
  },
  {
    "text": "D.C. Circuit panel unanimously rejects Trump's criminal immunity claim  —  On Tuesday morning, a three-judge panel of the U.S. Court of Appeals for the D.C. Circuit unanimously rejected Donald Trump's claims that he is immune from criminal prosecution for life for acts he took while president.",
    "url": "https://www.lawdork.com/p/dc-circuit-immunity-ruling-trump"
  },
  {
    "text": "4 takeaways from Trump's loss in his immunity case  —  Donald Trump suffered a significant setback Tuesday in his quest to escape criminal conviction, with a three-judge panel of the U.S. Court of Appeals for the D.C. Circuit ruling that he is not immune from charges for his acts as president.",
    "url": "https://www.washingtonpost.com/politics/2024/02/06/trump-immunity-takeaways/"
  },
  {
    "text": "The GOP's True Priority  —  The Republicans who won't take yes for an answer  —  Sometimes, a negotiation produces a deal.  —  Sometimes, a negotiation reveals the truth.  —  Negotiators in the Senate have produced a draft agreement on immigration and asylum.  The deal delivers on Republican priorities.",
    "url": "https://www.theatlantic.com/ideas/archive/2024/02/republicans-congress-immigration-deal/677357/"
  },
  {
    "text": "As a compromise border plan collapses, the GOP is in disarray  —  There can be little doubt that one of the major American political parties is in disarray, but it's not the Democratic Party.  —  For those familiar with online political commentary, the phrase “Dems in disarray” … ",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/compromise-border-plan-collapses-gop-disarray-rcna137424"
  },
  {
    "text": "The RNC's chief of staff is stepping down  —  The departure comes amid growing speculation that Donald Trump will push for changes at the committee.  —  Republican National Committee chief of staff Mike Reed is set to step down from his role later this month.  —  Reed had served as chief of staff at the committee since Jan. 2022.",
    "url": "https://www.politico.com/news/2024/02/06/rnc-chief-of-staff-stepping-down-trump-00139867"
  },
  {
    "text": "Trump campaign plans for its takeover of the Republican National Committee  —  Under one scenario, Ronna McDaniel would resign.  Under the other, she'd remain at the RNC, albeit in a weakened position.  —  Former President Donald Trump's campaign is quietly weighing options for how to reshuffle … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-campaign-plans-takeover-republican-national-committee-rcna137516"
  },
  {
    "text": "N.H. attorney general says he found source of fake Biden robocalls  —  New Hampshire's top law enforcement official said, “We have never seen...such a blatant attempt to mislead voters.”  —  New Hampshire's Attorney General on Tuesday named a Texas telecom company as the source … ",
    "url": "https://www.nbcnews.com/politics/2024-election/nh-attorney-general-says-found-source-fake-biden-robocalls-rcna137499"
  },
  {
    "text": "70 Current And Former NYCHA Employees Charged With Bribery And Extortion Offenses  —  For Immediate Release  —  U.S. Attorney's Office, Southern District of New York  —  In the Largest Number of Federal Bribery Charges on a Single Day in DOJ History, 70 Current and Former Employees … ",
    "url": "https://www.justice.gov/usao-sdny/pr/70-current-and-former-nycha-employees-charged-bribery-and-extortion-offenses"
  },
  {
    "text": "Rigger falls to death during production of Marvel's ‘Wonder Man’  —  The incident occurred Tuesday at the Radford Studio Center in Studio City, California.  —  LOS ANGELES — A rigger died after falling from rafters Tuesday during the production of Marvel Studios' “Wonder Man” in California, an official confirmed.",
    "url": "https://www.nbcnews.com/news/us-news/rigger-falls-death-production-marvels-wonder-man-rcna137598"
  },
  {
    "text": "Project Veritas, James O'Keefe settle suit over false claims of 2020 voter fraud in Pennsylvania  —  Project Veritas and conservative activist James O'Keefe have settled a lawsuit in Pennsylvania over false claims about voter fraud in the 2020 presidential election that were initially … ",
    "url": "https://thehill.com/regulation/court-battles/4451745-project-veritas-james-okeefe-settle-suit-over-false-claims-of-2020-voter-fraud-in-pennsylvania/"
  },
  {
    "text": "Jury finds Jennifer Crumbley guilty of manslaughter in son's school shooting  —  Ethan Crumbley killed four students at his high school in November 2021.  —  LIVE  —  Jennifer Crumbley, the mother of accused Oxford High School gunman Ethan Crumbley, listens on the stand in the courtroom … ",
    "url": "https://abcnews.go.com/US/jury-reaches-verdict-jennifer-crumbley-manslaughter-trial/story?id=106924349"
  },
  {
    "text": "Exclusive: FBI Arrests Would-Be Border Militia Member  —  As elected officials hotly debate new border security legislation, the FBI has arrested a Tennessee man they say was planning to join a militia border group, set off explosives, and act as a sniper at the Mexico/U.S. border.",
    "url": "https://www.courtwatch.news/p/exclusive-fbi-arrests-would-be-border"
  },
  {
    "text": "South Florida School Demands Parent Consent for Black History Month Events  —  Parents of students at the IPrep Academy in South Florida were shocked after being asked to sign permission slips to allow their children to participate in Black History Month.  —  Black History Month has now become an educational target in Florida schools.",
    "url": "https://www.thedailybeast.com/iprep-academy-school-in-miami-dade-county-demands-permissions-slips-for-black-history-month"
  },
  {
    "text": "Gina Carano Sues Disney Over ‘Mandalorian’ Firing—With Elon Musk's Help  —  Carano is seeking a court order that would force Lucasfilm to recast her on the Star Wars series.  —  Gina Carano, the actress who was fired from The Mandalorian for offensive and antisemitic posts … ",
    "url": "https://www.thedailybeast.com/gina-carano-sues-disney-over-mandalorian-firingwith-elon-musks-help"
  },
  {
    "text": "Second GOP rep says he'll vote against Mayorkas impeachment  —  Rep. Tom McClintock (R-Calif.) announced Tuesday that he would vote against a resolution to impeach Homeland Security Secretary Alejandro Mayorkas, becoming the second Republican to buck the party and putting GOP plans in jeopardy.",
    "url": "https://thehill.com/homenews/house/4450627-gop-loses-second-vote-in-effort-to-impeach-mayorkas/"
  },
  {
    "text": "DOJ report on Biden classified documents coming soon; no criminal charges  —  The special counsel report criticizes how Biden and aides handled sensitive material after his vice presidency but says those actions don't amount to crimes  —  The Justice Department is preparing to release … ",
    "url": "https://www.washingtonpost.com/national-security/2024/02/06/biden-classified-documents-probe/"
  },
  {
    "text": "Category 6?  Climate-boosted hurricanes push scientists to rethink classifications  —  The findings add to ongoing debates about how to better communicate to the public the threats of extreme weather events and the ways that climate change can multiply them.",
    "url": "https://www.nbcnews.com/science/science-news/category-6-climate-boosted-hurricanes-push-scientists-rethink-classifi-rcna137454"
  }
]