[
  {
    "text": "The Memo: Former Trump White House lawyer predicts crushing defeat at Supreme Court  —  A former attorney for the Trump White House predicts that the Supreme Court will rule unanimously against the 45th president on his claims to be immune from criminal prosecution.",
    "url": "https://thehill.com/regulation/court-battles/4451952-trump-immunity-ty-cobb-predicts-crushing-defeat-supreme-court/"
  },
  {
    "text": "Trump plans to press immunity defense in classified documents case despite defeat in appeals court  —  Donald Trump's legal team is outlining how he intends to fight the classified documents case against him in Florida, including by claiming presidential immunity, despite a significant defeat … ",
    "url": "https://www.cnn.com/2024/02/07/politics/trump-immunity-defense-classified-documents/"
  },
  {
    "text": "Inside Donald Trump's Incredible Cash Crunch  —  Two New York laws are about to smack Trump in the face, no matter if he plans to appeal two massive civil judgments that could wipe out all the cash in his pocket. … Donald Trump is just days away from getting slammed with a court judgment … ",
    "url": "https://www.thedailybeast.com/inside-donald-trumps-incredible-cash-crunch"
  },
  {
    "text": "Senate Republicans block bipartisan border package, scuttling deal they had demanded from Democrats  —  Senate Republicans blocked a bipartisan border package Wednesday, scuttling months of negotiations with Democrats on legislation intended to cut back record numbers of illegal border crossings.",
    "url": "https://apnews.com/article/congress-ukraine-aid-border-security-386dcc54b29a5491f8bd87b727a284f8"
  },
  {
    "text": "Senate Republicans officially block foreign aid bill with border changes  —  It marks the end of immigration negotiations that dragged on for four months.",
    "url": "https://www.politico.com/live-updates/2024/02/07/congress/senate-supplemental-ukraine-border-aid-00140187"
  },
  {
    "text": "Epic double debacle stings House GOP  —  It's 10 minutes of humiliation that will live in House lore. … - Speaker Mike Johnson lost by one vote — a Republican vote! — the first impeachment of a Cabinet official in 148 years. … - GOP lawmakers openly criticized leaders for bringing … ",
    "url": "https://www.axios.com/2024/02/07/house-republicans-mike-johnson-impeachment-israel"
  },
  {
    "text": "Putin interview with Tucker Carlson shows Kremlin outreach to Trump's GOP  —  MOSCOW — As Russian state television propagandists salivated over Tucker Carlson's interview with President Vladimir Putin, the first of Carlson's falsehoods about his visit to Moscow was punctured, fittingly enough … ",
    "url": "https://www.washingtonpost.com/world/2024/02/07/tucker-carlson-putin-russia-ukraine/"
  },
  {
    "text": "Exclusive: Tucker Carlson Could Face Sanctions Over Putin Interview  —  Tucker Carlson's interview with Russian President Vladimir Putin could see the conservative pundit targeted by European Union lawmakers, current and former members of the European Parliament have told Newsweek.",
    "url": "https://www.newsweek.com/tucker-carlson-sanctions-eu-putin-interview-1867655"
  },
  {
    "text": "Behind the border mess: Open GOP rebellion against McConnell  —  The Republican leader told POLITICO that his critics “had their shot” already.  But conservatives are not done whacking him over the immigration-for-Ukraine aid implosion.  —  Conservative hardliners once celebrated Mitch McConnell … ",
    "url": "https://www.politico.com/news/2024/02/07/mcconnell-gop-rebellion-border-deal-00139972"
  },
  {
    "text": "Speaker Johnson: We Were Counting on Democrat to Be In Emergency Surgery During Impeachment Vote  —  A ghoulish way to run the government.  —  Speaker Mike Johnson and House Republicans were shocked as their impeachment resolution against Homeland Security Secretary Alejandro Mayorkas went … ",
    "url": "https://www.meidastouch.com/news/speaker-johnson-we-were-counting-on-democrat-to-be-in-emergency-surgery-during-impeachment-vote"
  },
  {
    "text": "The Road to the General Election  —  NPR/PBS NewsHour/Marist National Poll  —  Biden Competitive with Trump, Haley... Biden Opens Up Lead if Trump is Convicted  —  President Joe Biden and former President Donald Trump remain in a statistical tie among registered voters nationally.",
    "url": "https://maristpoll.marist.edu/polls/the-road-to-the-general-election/"
  },
  {
    "text": "After Libs of TikTok posted, at least 21 bomb threats followed  —  The FBI and local law enforcement said bomb threats across the country have tied up government resources even when they turn out to be hoaxes.  —  Last March, police in Coralville, Iowa, investigated a bomb threat targeting a junior high school.",
    "url": "https://www.nbcnews.com/tech/internet/libs-tiktok-x-chaya-raichik-bomb-threat-twitter-of-libsoftiktok-rcna102784"
  },
  {
    "text": "Lankford Reveals Threat from ‘Popular Commentator’ Over Border Security Negotiations  —  ‘If you try to move a bill that solves the border crisis during this presidential year, I will do whatever I can to destroy you’  —  Senator James Lankford (R-OK), who has been the lead Republican negotiating … ",
    "url": "https://www.meidastouch.com/news/lankford-reveals-threat-from-popular-commentator-over-border-security-negotiations"
  },
  {
    "text": "The right-wing misreading of ‘Blazing Saddles’ is so telling  —  Editor's Note: Noah Berlatsky (@nberlat) is a freelance writer in Chicago.  The views expressed here are his own.  View more opinion on CNN.  —  CNN  —  On social media at least, Mel Brooks' classic “Blazing Saddles” … ",
    "url": "https://www.cnn.com/2024/02/07/opinions/blazing-saddles-50th-anniversary-politics-berlatsky/"
  },
  {
    "text": "Former GOP representative mulling comeback bid in Montana  —  Denny Rehberg, who served in the House from 2001 to 2013, is considering a run for the seat Matt Rosendale is expected to vacate.  —  A familiar name might be returning to the ballot in Montana — after an nearly 12-year absence from politics.",
    "url": "https://www.politico.com/news/2024/02/07/danny-rehberg-montana-election-00140171"
  },
  {
    "text": "Biden sets tighter standards for deadly soot pollution from tailpipes, smokestacks  —  WASHINGTON (AP) — The Biden administration is setting tougher standards for deadly soot pollution, saying that reducing fine particle matter from tailpipes, smokestacks and other industrial sources could prevent thousands of premature deaths a year.",
    "url": "https://apnews.com/article/epa-air-pollution-soot-biden-wildfires-d48a02362129ecda5be4d44dbd3442ed"
  },
  {
    "text": "Justice Department Announces Charges and Arrest in Two Separate Illicit Technology Transfer Schemes to Benefit Governments of China and Iran  —  For Immediate Release  —  Cases Mark One-Year Since Launch of Disruptive Technology Strike Force  —  In two separate cases out of U.S. Attorneys' Offices … ",
    "url": "https://www.justice.gov/opa/pr/justice-department-announces-charges-and-arrest-two-separate-illicit-technology-transfer"
  },
  {
    "text": "Man awarded $25 million after Oklahoma newspaper mistakenly identified him as sports announcer who made racist comments  —  An Oklahoma jury awarded a man $25 million on Monday after finding the state's largest newspaper defamed him when they mistakenly identified him as the announcer … ",
    "url": "https://www.cbsnews.com/news/scott-sapulpa-25-million-the-oklahoman-mistakenly-identified-him-racist-announcer/"
  },
  {
    "text": "Russia Is Boosting Calls for ‘Civil War’ Over Texas Border Crisis  —  An all-encompassing Russian disinformation campaign is using everything from bots to lifestyle influencers to powerful state-run media to sow division in the United States.  —  A Russian disinformation campaign … ",
    "url": "https://www.wired.com/story/russia-disinformation-campaign-civil-war-texas-border/"
  },
  {
    "text": "Jeanine Pirro Stuns Fox News Co-Hosts by Calling Black Colleague an ‘Oreo’  —  During a Fox News segment on how New York Mayor Eric Adams applauded his “chocolate” administration, things got a bit awkward.  —  Fox News host Jeanine Pirro called her Black colleague an “Oreo” … ",
    "url": "https://www.thedailybeast.com/jeanine-pirro-calls-black-colleague-an-oreo-during-fox-segment"
  },
  {
    "text": "Alleged aspiring militia “sniper” with plans to attack agents at border arrested  —  A Tennessee militia member who told an undercover federal agent that the U.S. is “being invaded” by migrants was planning to travel to the southern border with a stockpile of weapons and commit acts of violence … ",
    "url": "https://www.cbsnews.com/news/militia-sniper-paul-faye-southern-border-attack-federal-agents/"
  },
  {
    "text": "Inside the deadly new GOP plan to rapidly privatize Medicare  —  Want to invest in a scam that lets you make billions with virtually no risk?  If you're morbidly rich, all you have to do is to open or buy an insurance company that's offering Medicare Advantage plans.",
    "url": "https://www.rawstory.com/raw-investigates/medicare-advantage-2667187728/"
  },
  {
    "text": "Lauren Boebert's Ex-Husband Calls Restraining Order “Cruel and Unfair,” Says He Wasn't Served  —  Jayson Boebert believes the restraining order filed by Lauren was the congresswoman's way of further justifying her move to CD4. … Last week, Representative Lauren Boebert filed … ",
    "url": "https://www.westword.com/news/lauren-boeberts-ex-husband-calls-restraining-order-cruel-and-unfair-19241776"
  },
  {
    "text": "Pluralistic: The CHIPS Act treats the symptoms, but not the causes (07 Feb 2024)  — The CHIPS Act treats the symptoms, but not the causes: Monopoly destroyed America's high-tech capacity.  — Hey look at this: Delights to delectate.  — This day in history: 2004, 2009, 2014, 2019, 2023",
    "url": "https://pluralistic.net/2024/02/07/farewell-mr-chips/"
  }
]