[
  {
    "text": "MAGA “populism” was always an inch deep — Trump's billionaire-palooza proves it  —  The entirety of Donald Trump's con artist schtick to bamboozle his followers was perfectly illustrated in one recent photograph.  In it, the president-elect sits grinning maniacally next to fellow rich white guy James Quincey, CEO of Coca-Cola.",
    "url": "https://www.salon.com/2025/01/16/tech-billionaires-expose-magas-populism-con-job/"
  },
  {
    "text": "Full Transcript of President Biden's Farewell Address  —  The president delivered the 17-minute speech from the Oval Office in the White House. … My fellow Americans, I'm speaking to you tonight from the Oval Office.  Before I begin, let me speak to important news from earlier today.",
    "url": "https://www.nytimes.com/2025/01/15/us/politics/full-transcript-of-president-bidens-farewell-address.html"
  },
  {
    "text": "Joe Biden's tragic presidency  —  On January 6 of this year, the Washington Post ran an op-ed from President Joe Biden, who wrote that “four years ago, our democracy was put to the test — and prevailed.”  This feels like a declaration from another reality, one where Donald Trump was held accountable for his assault on democracy.",
    "url": "https://www.publicnotice.co/p/joe-biden-tragic-presidency-2025"
  },
  {
    "text": "The Purge Has Begun  —  As Biden exits stage left, Trump enters stage right—and promptly clears the stage.  —  Your regular newsletter-er, Andrew Egger, is taking some much-deserved time off as he welcomes a new member of his family into the world.  Congrats, Egger!  But the news doesn't stop, even if Andrew has.",
    "url": "https://www.thebulwark.com/p/the-purge-has-begun"
  },
  {
    "text": "Johnson Ousts Turner as Intelligence Chairman, Bowing to Trump  —  Representative Michael R. Turner, Republican of Ohio, had at times been critical of the president-elect.  He told people that he was axed after an edict from Mar-a-Lago.  —  Speaker Mike Johnson on Wednesday removed … ",
    "url": "https://www.nytimes.com/2025/01/15/us/politics/mike-turner-house-intelligence.html"
  },
  {
    "text": "Rep. Rick Crawford expected to serve as House Intelligence chair  —  Speaker Mike Johnson is expected to choose Rep. Rick Crawford (R-Ark.) as the next chair of the House Intelligence Committee, two people familiar with Johnson's intentions said.  Johnson on Wednesday removed former Chair Mike Turner … ",
    "url": "https://www.politico.com/live-updates/2025/01/16/congress/crawford-to-be-named-house-intel-chair-00198644"
  },
  {
    "text": "Biden administration looks for ways to keep TikTok available in the U.S.  —  Barring action by the Supreme Court, a ban in the U.S. on the popular app is set to begin on Sunday.  —  President Joe Biden's administration is considering ways to keep TikTok available in the U.S. if a ban that's scheduled … ",
    "url": "https://www.nbcnews.com/politics/joe-biden/biden-administration-keep-tiktok-available-us-rcna187902"
  },
  {
    "text": "TikTok C.E.O. Plans to Attend Trump Inauguration  —  Shou Chew will join tech moguls like Mark Zuckerberg and Elon Musk at President-elect Donald J. Trump's inauguration as the fate of the app hangs in the balance.  —  The chief executive of TikTok plans to attend President-elect Donald J … ",
    "url": "https://www.nytimes.com/2025/01/15/us/politics/tiktok-ceo-trump-inauguration.html?unlocked_article_code=1.pk4.1cxk.7kzd1sk3f5go&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Trump considers executive order hoping to ‘save TikTok’ from ban or sale in U.S. law  —  The self-styled master dealmaker is exploring unconventional ways to rescue the Chinese-owned video app from a nationwide ban, arguing it will help him reach an adoring audience throughout his second term.",
    "url": "https://www.washingtonpost.com/technology/2025/01/15/trump-tiktok-ban-executive-order/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM2OTE3MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM4Mjk5NTk5LCJpYXQiOjE3MzY5MTcyMDAsImp0aSI6ImJkNTk1YTExLTkzYmYtNGVlZC04NjlmLTZhZTFlNjZjM2QwOCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS90ZWNobm9sb2d5LzIwMjUvMDEvMTUvdHJ1bXAtdGlrdG9rLWJhbi1leGVjdXRpdmUtb3JkZXIvIn0.EocdDoRLKMsnJf40z2qKZrM9iD0C4P7tG16xyH3VxF0"
  },
  {
    "text": "The Washington Post's New Mission: Reach ‘All of America’  —  This week, The Post began trying out a new mission statement: “Riveting Storytelling for All of America.”  —  After Donald J. Trump entered the White House in 2017, The Washington Post adopted a slogan that underscored … ",
    "url": "https://www.nytimes.com/2025/01/16/business/media/the-washington-post-new-mission.html"
  },
  {
    "text": "A Euphoric Tech Industry Is Ready to Celebrate Trump and Itself  —  The elite of Silicon Valley are set to revel in their new clout during a long weekend of inaugural parties as President-elect Donald J. Trump is set to resume power.  —  A party at the Beaux-Arts mansion of the venture capitalist Peter Thiel.",
    "url": "https://www.nytimes.com/2025/01/16/us/politics/trump-tech-inauguration-parties.html?unlocked_article_code=1.pk4.RBH5.Oa0m4DY7KFu3&smid=url-share"
  },
  {
    "text": "'Everyone's trying to kiss the ring': Trump's inauguration devours corporate cash, smashing records  —  Donations are flying in from some of the world's biggest companies — and though many have contributed before, the checks this year are bigger.  —  Donald Trump's first White House victory caught corporate America flat-footed.",
    "url": "https://www.politico.com/news/2025/01/16/trump-inauguration-corporate-donors-004242"
  },
  {
    "text": "'Everything's on the table': Jordan mulls calling Jack Smith to Judiciary  —  House Judiciary Committee chair Jim Jordan says he is mulling whether to call Jack Smith, the special counsel who led the federal investigations into President-elect Donald Trump, to testify before his committee.",
    "url": "https://www.politico.com/live-updates/2025/01/15/congress/jim-jordan-jack-smith-trump-00198533"
  },
  {
    "text": "Ron DeSantis picks Florida Attorney General Ashley Moody to fill Marco Rubio's Senate seat  —  Moody, 49, has served as Florida attorney general since 2019, easily winning two statewide elections for the position.  —  Florida Gov. Ron DeSantis appointed state Attorney General Ashley Moody … ",
    "url": "https://www.nbcnews.com/politics/congress/ron-desantis-picks-florida-attorney-general-ashley-moody-fill-rubios-s-rcna187938"
  },
  {
    "text": "Outgoing FCC chair rejects high-profile TV petitions as attempt to ‘weaponize’ government  —  New York CNN  —  The outgoing Democratic chair of the Federal Communications Commission is taking bold action on the way out the door, rejecting what she described as four efforts to weaponize … ",
    "url": "https://www.cnn.com/2025/01/16/media/fcc-rosenworcel-petitions-trump-fox/"
  },
  {
    "text": "You Blamed DEI for Hurting Your Career.  Now What?  —  For people who pin their failures on diversity, corporate America's DEI retreat removes a barrier—or maybe an excuse  —  I hear from them all the time.  —  “Add one more to your list of aggrieved white males,” a reader wrote to me recently.",
    "url": "https://www.wsj.com/lifestyle/careers/you-blamed-dei-for-hurting-your-career-now-what-6150c575"
  },
  {
    "text": "Treasury pick Scott Bessent and Trump transition team deny allegations that he avoided taxes  —  In a new memo obtained by NBC News, Senate Finance Democratic tax staff found that Scott Bessent avoided over $950,000 of self-employment taxes.  —  In a review of the Treasury Secretary nominee's tax returns … ",
    "url": "https://www.nbcnews.com/politics/congress/live-blog/senate-confirmation-hearings-trump-transition-live-updates-rcna186869/rcrd68705"
  },
  {
    "text": "Biden warns of the rise of a new American ‘oligarchy’  —  From the White House he will soon cede to Trump, Biden likens the current crop of tech moguls to the ‘robber barons’ of the 19th century.",
    "url": "https://www.washingtonpost.com/politics/2025/01/15/biden-farewell-address-oval-office/"
  },
  {
    "text": "Jeff Bezos' Blue Origin launches massive New Glenn rocket into orbit on 1st flight (video)  —  New Glenn just earned its wings.  —  COCOA BEACH, Florida  —  Blue Origin's New Glenn rocket just earned its wings.  —  New Glenn launched for the first time ever this morning … ",
    "url": "https://www.space.com/space-exploration/launches-spacecraft/jeff-bezos-blue-origin-launches-massive-new-glenn-rocket-into-orbit-on-1st-flight-video"
  },
  {
    "text": "We Deserve Pete Hegseth  —  First let me hit you with some realities:  — The Secretary General of NATO, Mark Rutte, has said that the West is not prepared for the challenges that will come over the next five years and that it's time to “shift to a wartime mind-set.”",
    "url": "https://www.nytimes.com/2025/01/15/opinion/pete-hegseth-hearings-defense.html"
  },
  {
    "text": "U.S. Political Parties Historically Polarized Ideologically  —  In 2024, conservatives and moderates continued to outpace liberals  —  WASHINGTON, D.C. — Americans' ideological identification was steady in 2024, with an average of 37% describing their political views as “very conservative” … ",
    "url": "https://news.gallup.com/poll/655190/political-parties-historically-polarized-ideologically.aspx"
  },
  {
    "text": "Live Updates: Disputes Hold Up Israeli Cabinet Vote on Cease-Fire Deal  —  The agreement, which would include the release of hostages, was met with cautious optimism.  But Israel's cabinet needs to ratify the deal, and the prime minister's office said Hamas was reneging on parts of it, an accusation that the group rejected.",
    "url": "https://www.nytimes.com/live/2025/01/16/world/israel-hamas-gaza-cease-fire"
  },
  {
    "text": "End the Corporation for Public Broadcasting  —  With conservatives back in power, public media is getting back to what it really excels at.  No, not objective, impartial reporting.  If NPR and PBS focused on that, they wouldn't need to be so good at their side hustle: desperately lobbying Congress not to defund them.",
    "url": "https://www.washingtonexaminer.com/restoring-america/patriotism-unity/3288098/end-the-corporation-for-public-broadcasting/"
  },
  {
    "text": "UnitedHealth, employer of slain exec Brian Thompson, found to have overcharged some cancer patients for drugs by over 1,000%  — OptumRx, the group's pharmacy benefit manager, along with its two main peers, Express Scripts and CVS Caremark Rx, have pocketed an extra $7.3 billion over cost thanks … ",
    "url": "https://fortune.com/2025/01/15/ftc-pbms-unitedhealth-brian-thompson-cvs-caremark-cigna-pharmacy-benefit-managers/"
  },
  {
    "text": "Trump, Musk dined with Microsoft CEO at Mar-a-Lago  —  The Scoop  —  President-elect Donald Trump and his running mate JD Vance had lunch with Microsoft CEO Satya Nadella Wednesday, along with Elon Musk, according to people briefed on the meeting.  —  Microsoft President Brad Smith … ",
    "url": "https://www.semafor.com/article/01/15/2025/trump-musk-dined-with-microsoft-ceo-satya-nadella-at-mar-a-lago"
  },
  {
    "text": "Time Is Running Out to Recover Up to $135 Billion in Pilfered Jobless Benefits  —  Statute of limitations looms for what some lawmakers say might be ‘greatest heist’ of taxpayer dollars ever  —  In 2024, federal prosecutors filed charges in an alleged transnational scheme to launder tens … ",
    "url": "https://www.wsj.com/politics/policy/time-is-running-out-to-recover-up-to-135-billion-in-pilfered-jobless-benefits-39505ea7"
  },
  {
    "text": "Who does the EPA protect?  —  The Biden administration promised change for overpolluted communities in the South.  Four years later, they're still waiting.  —  When President Joe Biden announced his Justice40 Initiative, a week after he took office in January 2021, it had been almost 30 years since … ",
    "url": "https://grist.org/project/accountability/biden-environmental-justice-epa-tour-pollution-revisited-cancer-alley-houston-jackson/"
  },
  {
    "text": "Many Americans doubt Trump will be able to lower prices in his first year, an AP-NORC poll shows  —  Worries about everyday expenses helped return President-elect Donald Trump to the White House.  But with his second term quickly approaching, many U.S. adults are skeptical about his ability to bring down costs.",
    "url": "https://apnews.com/article/trump-inauguration-economy-inflation-prices-costs-immigration-35d8451c2a866b21776e50761b5634f3"
  },
  {
    "text": "These lawmakers made a fortune in the stock market last year  —  Federal government employees who own stock in a company are prohibited by law from being involved in any matter that may impact the financial interests of the company — whether or not the matter can plausibly impact the stock price.",
    "url": "https://popular.info/p/these-lawmakers-made-a-fortune-in"
  }
]