[
  {
    "text": "The Rick Scott backlash builds  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  LATEST RACE CALLS — Rep. YADIRA CARAVEO (D-Colo.) conceded to Republican GABE EVANS.  Rep. DAVID SCHWEIKERT (R-Ariz.) wins reelection.  —  SAME AS IT EVER WAS … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/11/11/the-rick-scott-backlash-builds-00188728"
  },
  {
    "text": "Trump presses next GOP Senate leader to allow ‘recess appointments’  —  It comes as Rick Scott has racked up support from prominent conservative backers, including Elon Musk.  —  President-elect Donald Trump on Sunday said Senate Republicans' next leader must embrace so-called “recess appointments … ",
    "url": "https://www.politico.com/news/2024/11/10/trump-presses-next-republican-senate-leader-recess-appointments-00188640"
  },
  {
    "text": "Rep. Dean Phillips tears into fellow Democrats over 2024 loss … - “We have a political system ... that really has incentives that actually are working against us. … - “Both parties are subject to it. … - “I think that's what frankly has led to Trumpism, people getting tired … ",
    "url": "https://www.axios.com/2024/11/10/dean-phillips-democrats-fox-news"
  },
  {
    "text": "Trump talked to Putin, told Russian leader not to escalate in Ukraine  —  President-elect Donald Trump spoke with Russian President Vladimir Putin on Thursday and discussed the war in Ukraine, according to people familiar with the call.  —  President-elect Donald Trump spoke … ",
    "url": "https://www.washingtonpost.com/national-security/2024/11/10/trump-putin-phone-call-ukraine/"
  },
  {
    "text": "Trump offers Rep. Elise Stefanik role of UN ambassador, sources say  —  President-elect Donald Trump has offered Republican Rep. Elise Stefanik the job as US ambassador to the United Nations, two sources familiar told CNN on Sunday.  —  The New York congresswoman, the fourth-ranking House Republican … ",
    "url": "https://www.cnn.com/2024/11/10/politics/elise-stefanik-trump-us-ambassador-to-un"
  },
  {
    "text": "2024's other big loser?  The mainstream media.  Is there any path forward?  —  The American mainstream media, and its vital watchdog role that once made it a trusted, major institution in a flawed yet functioning democracy, imploded in 2024, and it happened in two ways … ",
    "url": "https://www.inquirer.com/opinion/commentary/trust-mainstream-media-2024-election-20241110.html?id=bpjtJ3uwA0BYL"
  },
  {
    "text": "Jockeying kicks off to fill Vance vacancy in Senate  —  Ohio Gov. Mike DeWine (R) is facing a key decision on whom to tap to fill the term of Vice President-elect Vance as jockeying among Ohio Republicans for the coveted appointment is set to become a knife fight.",
    "url": "https://thehill.com/homenews/senate/4981631-senate-vacancy-vance-ohio-dewine/"
  },
  {
    "text": "‘The behind-the-scenes work starts today’: The 2028 shadow primary is underway  —  For Democrats' rising stars, there was a silver lining to the blow dealt to them by Donald Trump's victory.  —  Josh Shapiro is already fielding calls from Democratic Party leaders in Pennsylvania urging him to run for president.",
    "url": "https://www.politico.com/news/2024/11/11/2028-shadow-primary-underway-democratic-00188626"
  },
  {
    "text": "House Fast Tracks Bill That Would Give Trump Power to Target Nonprofits  —  The legislation would let the Treasury Department revoke tax-exempt status for any “terrorist supporting organization”  —  Donald Trump hasn't even taken office, and Congress is already moving to advance legislation to expand his ability to target his enemies.",
    "url": "https://www.rollingstone.com/politics/politics-news/house-bill-trump-power-target-nonprofits-1235161151/"
  },
  {
    "text": "Courts restrained Trump in first term.  Will they ‘check’ his power again?  —  Democratic governors and advocacy groups promise litigation over Trump's agenda.  —  Republican presidential nominee former President Donald Trump and his running mate Sen. JD Vance, R-Ohio … ",
    "url": "https://abcnews.go.com/Politics/courts-restrained-trump-term-check-power/story?id=115657129"
  },
  {
    "text": "Schumer withholds Senate orientation invite from McCormick  —  Democrats are holding out hope that Sen. Bob Casey can pick up enough votes to hold on to the Pennsylvania Senate seat.  —  Senate Majority Leader Chuck Schumer will not allow Sen.-elect Dave McCormick (R-Pa.) … ",
    "url": "https://www.politico.com/news/2024/11/10/schumer-casey-mccormick-senate-orientation-00188644"
  },
  {
    "text": "Will Trump's hush money conviction stand?  A judge will rule on the president-elect's immunity claim  —  A gut punch for most defendants, Donald Trump turned his criminal conviction into a rallying cry.  His supporters put “I'm Voting for the Felon” on T-shirts, hats and lawn signs.",
    "url": "https://apnews.com/article/trump-immunity-hush-money-merchan-stormy-daniels-02e54baf65b233ad7f6875536fb998ea"
  },
  {
    "text": "Round 2 in the Trump-vs-Mexico matchup looks ominous for Mexico  —  Mexico is facing a second Donald Trump presidency, and few countries can match its experience as a target of Trump's rhetoric: There have been threats to close the border, impose tariffs and even send U.S. forces … ",
    "url": "https://apnews.com/article/mexico-donald-trump-threats-tariffs-border-closing-deportations-b9f11e55911613cf72ac1d5695bba5ec"
  },
  {
    "text": "Trump announces Tom Homan as incoming border czar  —  Homan touts hard-line immigration views and has previously vowed to “run the biggest deportation force this country has ever seen.”  —  WASHINGTON — President-elect Donald Trump announced late Sunday that Tom Homan … ",
    "url": "https://www.nbcnews.com/politics/2024-election/trump-announces-tom-homan-incoming-border-czar-rcna179536"
  },
  {
    "text": "Former Georgia senator Kelly Loeffler to serve on Trump's inaugural committee  —  She will co-chair the committee with New York real estate investor Steve Witkoff  —  President-elect Donald J. Trump announced on Saturday that his inaugural committee will be led by former U.S. Sen. Kelly Loeffler of Georgia.",
    "url": "https://www.foxnews.com/politics/former-georgia-senator-kelly-loeffler-serve-trumps-inaugural-committee"
  }
]