[
  {
    "text": "Trump Just Broke the Law.  Blatantly.  And He Might Get Away With It.  —  Imagine that there were a particularly dirty NFL player—call him Thompson—who developed a habit of doing something new and possibly dangerous to opposing players.  Penalty flags didn't deter him.  On and on he went.",
    "url": "https://newrepublic.com/article/190704/trump-fires-inspectors-general-broke-law-blatantly"
  },
  {
    "text": "Transcript: Trump's Late-Night Purge Suddenly Becomes Bigger Scandal … Greg Sargent: This is The Daily Blast from The New Republic, produced and presented by the DSR network.  I'm your host, Greg Sargent.  —  On Friday night, President Donald Trump fired at least 15 independent inspectors general … ",
    "url": "https://newrepublic.com/article/190705/transcript-trumps-late-night-purge-suddenly-becomes-bigger-scandal"
  },
  {
    "text": "Democrats flip the script, eyeing debt limit to block Trump's agenda  —  Republicans have leveraged the debt ceiling for years to block Democrats' agenda.  Now liberals see an opening to stymie Trump.  —  DORAL, Florida — Democrats in Congress are considering forcing a showdown … ",
    "url": "https://www.washingtonpost.com/business/2025/01/27/trump-debt-ceiling-democrats/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM3OTU0MDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM5MzM2Mzk5LCJpYXQiOjE3Mzc5NTQwMDAsImp0aSI6IjQ3MzcwZTdjLTU3MzQtNDhiNi1hNDYyLWRmZWY1NzVjMWVkOCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9idXNpbmVzcy8yMDI1LzAxLzI3L3RydW1wLWRlYnQtY2VpbGluZy1kZW1vY3JhdHMvIn0.CeBmBdI_3R6YKWuAvfAu3bNJaA36oizBOCjo3MT5iOk&itid=gfta"
  },
  {
    "text": "DeepSeek FAQ  —  It's Monday, January 27.  Why haven't you written about DeepSeek yet?  —  I did!  I wrote about R1 last Tuesday.  —  I totally forgot about that.  —  I take responsibility.  I stand by the post, including the two biggest takeaways that I highlighted … ",
    "url": "https://stratechery.com/2025/deepseek-faq/"
  },
  {
    "text": "China's DeepSeek AI app sends U.S. tech stocks reeling  —  The tech-heavy Nasdaq index lost nearly 4 percent in early trading Monday, with chipmaker Nvidia down nearly 12 percent.  —  The sudden popularity of a Chinese artificial intelligence model called DeepSeek pummeled stocks Monday … ",
    "url": "https://www.washingtonpost.com/business/2025/01/27/deep-seek-ai-markets-nvidia/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM3OTU0MDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM5MzM2Mzk5LCJpYXQiOjE3Mzc5NTQwMDAsImp0aSI6ImMxYmRlNjA2LWQ4NDUtNDEzYy05Yzk1LTZmYmQxMTEwMmQwNSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9idXNpbmVzcy8yMDI1LzAxLzI3L2RlZXAtc2Vlay1haS1tYXJrZXRzLW52aWRpYS8ifQ.ZhGnYIYWV0ZO5LnShC4usjfCwZ95kPKrKe3NHBhUQR0&itid=gfta"
  },
  {
    "text": "Colombia yields on US deportation flights to avert trade war  —  A looming trade war between the US and Colombia appears to have been averted after the Colombian government agreed to allow US military flights carrying deported migrants to land in the Andean country.",
    "url": "https://www.bbc.com/news/articles/c20p36e62gyo"
  },
  {
    "text": "Chief Corruption Prosecutor Resigns From Justice Dept.  —  Corey Amundson chose to leave the department after being told he was being reassigned by the Trump administration to a position related to immigration enforcement.  —  The head of the Justice Department's public integrity section … ",
    "url": "https://www.nytimes.com/2025/01/27/us/politics/chief-corruption-prosecutor.html"
  },
  {
    "text": "Career US Justice Department official in charge of public corruption cases resigns  —  Corey Amundson, the U.S. Justice Department's senior career official in charge of overseeing public corruption and other politically sensitive investigations, resigned on Monday after the Trump administration tried … ",
    "url": "https://www.reuters.com/world/us/career-us-justice-department-official-charge-public-corruption-cases-resigns-2025-01-27/"
  },
  {
    "text": "Trump expected to sign executive orders to reshape the military, including banning transgender troops  —  President Donald Trump on Monday is expected to sign three executive orders that would reshape the military, including banning transgender service members from serving in the US armed forces … ",
    "url": "https://www.cnn.com/2025/01/27/politics/donald-trump-military-executive-orders/"
  },
  {
    "text": "Navajo Nation leaders raise alarm over reports of Indigenous people being questioned and detained during immigration sweeps  —  At least 15 Indigenous people in Arizona and New Mexico have reported being stopped at their homes and workplaces, questioned or detained by federal law enforcement … ",
    "url": "https://www.cnn.com/2025/01/27/us/navajo-detained-ice-indigenous-immigration-trump/"
  },
  {
    "text": "CDC ordered to stop working with WHO immediately, upending expectations of an extended withdrawal  —  U.S. public health officials have been told to stop working with the World Health Organization, effective immediately.  A U.S. Centers for Disease Control and Prevention official … ",
    "url": "https://apnews.com/article/cdc-who-trump-548cf18b1c409c7d22e17311ccdfe1f6"
  },
  {
    "text": "Quaker groups file suit over end of policy restricting ICE arrests in houses of worship  —  The suit appears to be the first from a faith-based organization challenging the change in court.  —  A group of Quaker congregations are suing the Department of Homeland Security for changing a policy … ",
    "url": "https://www.nbcnews.com/politics/national-security/quaker-groups-file-suit-end-policy-restricting-ice-arrests-houses-wors-rcna189471"
  },
  {
    "text": "Trump's Flaming Turd of an Argument for Ending Birthright Citizenship  —  My late father, an old-school seersucker-and-bow-tie Virginia lawyer, had his good days in court and his other days.  After one particularly fraught session in another city, he called my mother to report.  “I did just fine,” he said.",
    "url": "https://washingtonmonthly.com/2025/01/27/trumps-flaming-turd-of-an-argument-for-ending-birthright-citizenship/"
  },
  {
    "text": "Chris Hayes Made a Chamber of His Own  —  How Kierkegaard and a book contract saved the MSNBC host from smartphone addiction.  —  Chris Hayes cuts a peculiar figure in the media landscape.  He is omnivorously inquisitive, his owlish frames imparting the sense that he is always on the lookout … ",
    "url": "https://nymag.com/intelligencer/article/chris-hayes-msnbc-sirens-call-interview.html"
  },
  {
    "text": "Europe's Elon Musk Problem … During an american election, a rich man can hand out $1 million checks to prospective voters.  Companies and people can use secretly funded “dark money” nonprofits to donate unlimited money, anonymously, to super PACs, which can then spend it on advertising campaigns.",
    "url": "https://www.theatlantic.com/magazine/archive/2025/03/musk-tech-oligarch-european-election-influence/681453/?gift=hVZeG3M9DnxL4CekrWGK34_jHWNsAU1mvPsKLSJcYGQ&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "They Followed North Carolina Election Rules When They Cast Their Ballots.  Now Their Votes Could Be Tossed Anyway.  —  A Republican judge is trying to overturn his election loss by challenging more than 60,000 ballots.  These are some of those voters' stories.",
    "url": "https://www.propublica.org/article/north-carolina-voters-jefferson-griffin-supreme-court-challenge"
  },
  {
    "text": "It's pretty easy to cut $2 trillion from the federal budget, actually (permalink)  —  If Elon Musk wants to cut $2t from the US federal budget, there's a pretty straightforward way to get there - just eliminate all the beltway bandits who overcharge Uncle Sucker for everything from pharmaceuticals … ",
    "url": "https://pluralistic.net/2025/01/27/beltway-bandits/#henhouse-foxes"
  },
  {
    "text": "Some GOP senators want open committee vote on Gabbard  —  Any Republican opposition could doom the top intelligence nominee's confirmation.  —  Some Republican senators are pushing for the unusual step of making public a key vote on Tulsi Gabbard's nomination in the Senate Intelligence Committee … ",
    "url": "https://www.politico.com/news/2025/01/27/tulsi-gabbard-senate-intelligence-committee-vote-006977"
  },
  {
    "text": "US reports first outbreak of H5N9 bird flu in poultry  —  The United States has reported its first outbreak of H5N9 bird flu in poultry on a duck farm in California, the World Organisation for Animal Health (WOAH) said on Monday.  —  U.S. authorities also detected the more common H5N1 strain … ",
    "url": "https://www.reuters.com/business/healthcare-pharmaceuticals/us-reported-first-outbreak-h5n9-bird-flu-poultry-woah-says-2025-01-27/"
  },
  {
    "text": "No. We Should Not Move Beyond ‘That’  —  The Philadelphia Eagles are going to the Super Bowl.  (So are the Kansas City Chiefs, but who cares?)  The last time the Eagles won it all, in 2018, many of the players declined an invitation to the White House to celebrate with President Trump … ",
    "url": "https://www.thebulwark.com/p/no-we-should-not-move-beyond-that"
  },
  {
    "text": "Indiana man fatally shot by sheriff's deputy identified as Jan. 6 defendant  — A Jasper County sheriff's deputy fatally shot 42-year-old Matthew W. Huttle during a traffic stop in northwest Indiana on Sunday after an altercation in which Huttle reportedly resisted arrest and was armed.",
    "url": "https://www.fox32chicago.com/news/indiana-man-fatally-shot-deputy-identified-jan-6"
  },
  {
    "text": "Why Trump won't be deporting “millions” of criminals … - About 13,100 of those were convicted in homicides and are imprisoned in the U.S. They'll have deportation hearings after serving their sentences. … But being in the U.S. illegally is a civil violation, not a criminal one.",
    "url": "https://www.axios.com/2025/01/27/undocumented-immigrants-crime-deportations-trump"
  },
  {
    "text": "In Exacting Retribution, Trump Aims at the Future as Well as the Past  —  The president made good on promises to seek revenge against enemies during his first week back in power, signaling in the process that anyone who crosses him in the future could also suffer.",
    "url": "https://www.nytimes.com/2025/01/27/us/politics/trump-politics-enemies-pompeo-fauci.html?unlocked_article_code=1.sU4.-EdJ.cbOxwSY0f-20&smid=url-share"
  },
  {
    "text": "FBI insider raises concerns about Kash Patel's role in hostage rescue  —  Days before this week's high-stakes confirmation hearing of Kash Patel to be FBI director, a bureau insider has come forward with new information questioning Patel's judgment during sensitive hostage rescue missions, CBS News has learned.",
    "url": "https://www.cbsnews.com/news/fbi-insider-kash-patel-hostage-rescue/"
  },
  {
    "text": "Florida Legislature defies DeSantis on illegal immigration as Republican foes assert power  —  House Speaker Danny Perez and Senate President Ben Albritton pushed back in a way the governor hasn't seen before.  —  TALLAHASSEE, Florida — Gov. Ron DeSantis suffered a stunning defeat courtesy … ",
    "url": "https://www.politico.com/news/2025/01/27/florida-legislature-defies-desantis-00200715"
  }
]