[
  {
    "text": "Behind the Curtain: Trump's exponential power surge  —  Something shocking — and telling — has unfolded beyond Donald Trump's onstage, online and courtroom theatrics: He's running a professional, well-managed, disciplined presidential campaign.  — His 2024 operation is more sophisticated … ",
    "url": "https://www.axios.com/2024/01/25/trump-2024-campaign-republican-nominee"
  },
  {
    "text": "Trump opens up lead over Biden in rematch many Americans don't want  —  Donald Trump leads Democratic President Joe Biden by six percentage points in a Reuters/Ipsos poll that showed Americans are unhappy about an election rematch that came into sharper focus this week.",
    "url": "https://www.reuters.com/world/us/americans-dismayed-by-biden-trump-2024-rematch-reutersipsos-poll-finds-2024-01-25/"
  },
  {
    "text": "McConnell Casts Doubt on Border Deal, Saying Trump Opposition May Sink It  —  The minority leader privately told Republicans that the former president had put his party “in a quandary,” casting further doubt on the deal's chances and the fate of Ukraine aid that the G.O.P. has tied to it.",
    "url": "https://www.nytimes.com/2024/01/25/us/politics/mcconnell-border-deal-trump.html"
  },
  {
    "text": "As 2024 race advances, Trump eyes a new priority: blacklisting  —  Ten months ago, Donald Trump and his team let Republicans know they'd embrace blacklisting tactics as the race unfolded.  Evidently, they meant it.  —  Gov. Ron DeSantis launched his doomed presidential campaign in May 2023 … ",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/2024-race-advances-trump-eyes-new-priority-blacklisting-rcna135613"
  },
  {
    "text": "Ex-Trump adviser Peter Navarro sentenced to 4 months for contempt of Congress  —  Former Trump White House official Peter Navarro was sentenced Thursday to four months in prison for contempt of Congress for defying a subpoena from the House committee investigating the Jan. 6 U.S. Capitol attack.",
    "url": "https://www.npr.org/2024/01/25/1226836737/peter-navarro-sentence-contempt-congress"
  },
  {
    "text": "Ex-Trump aide Peter Navarro sentenced to 4 months for defying Jan. 6 committee subpoena  —  The former White House adviser was sentenced on Thursday.  —  In this Sept. 7, 2023 file photo, Peter Navarro, an advisor to former U.S. President Donald Trump, speaks to reporters as he arrives … ",
    "url": "https://abcnews.go.com/US/trump-aide-peter-navarro-sentenced-defying-jan-6/story?id=106653782"
  },
  {
    "text": "1/25/24 ☀️ Punchbowl News AM … Senate Minority Leader Mitch McConnell did four extraordinary things Wednesday afternoon, all of which we scooped in our PM edition Wednesday night. … McConnell told GOP senators that before border security talks began, immigration policy united Republicans and Ukraine aid divided them.",
    "url": "https://punchbowl.news/archive/12524-punchbowl-news-am/"
  },
  {
    "text": "‘A Warning Shot’: Maggie Haberman Explains Why Trump Attacked Kayleigh McEnany  —  The New York Times reporter shared her analysis after Trump lashed out at his former press secretary over her comments on Fox News.  —  LOADING  —  New York Times journalist Maggie Haberman said Donald Trump's outburst … ",
    "url": "https://www.huffpost.com/entry/maggie-haberman-kayleigh-mcenany-trump_n_65b242a1e4b074981636eb7d"
  },
  {
    "text": "Biden to deploy CIA director to help broker major Gaza deal  —  William Burns is looking to close gaps between Israel and Hamas on a deal that includes the release of all hostages in Gaza and a two-month cease-fire  —  President Biden plans to dispatch CIA Director William J. Burns … ",
    "url": "https://www.washingtonpost.com/national-security/2024/01/25/william-burns-cia-gaza-israel-hostages/"
  },
  {
    "text": "Tea with salt?  American scientist's “outrageous proposal” leaves U.S.-U.K. relations in “hot water,” embassy says  —  How do you take your tea?  One lump of sugar, two or maybe some milk?  Unless you're adding salt, one U.S. scientist says, your cup won't be perfect … ",
    "url": "https://www.cbsnews.com/news/tea-with-salt-american-scientists-outrageous-proposal-leaves-u-s-u-k-relations-in-hot-water-embassy-says/"
  },
  {
    "text": "U.S. economy booms with 3.3% growth in final quarter of 2023 … - The economy moderated in the September-December period compared to the previous quarter's 4.9% growth, which got a notable boost from companies building up inventories. … - That dynamic continued in the fourth quarter … ",
    "url": "https://www.axios.com/2024/01/25/us-gdp-fourth-quarter-economy-growth"
  },
  {
    "text": "Who are No Labels' donors?  Democratic groups file complaints in an attempt to find out  —  For months, the centrist group No Labels has stockpiled cash and diligently worked to secure ballot access for a potential third-party presidential bid, striking fear among allies of President Joe Biden … ",
    "url": "https://apnews.com/article/no-labels-campaign-finance-complaint-biden-trump-05062262e04b4bb346ab06eaea99630b"
  },
  {
    "text": "Housing is now unaffordable for a record half of all U.S. renters, study finds  —  Over the past two years, Genuine Campbell was shocked at how rent for her two-bedroom apartment in Philadelphia just kept going up — from $1,300 a month to $1,600.  She's a single mom of four … ",
    "url": "https://www.npr.org/2024/01/25/1225957874/housing-unaffordable-for-record-half-all-u-s-renters-study-finds"
  },
  {
    "text": "Penn Jillette Wants to Talk It All Out  —  Penn Jillette has a large, framed French-language poster of Renaldo and Clara behind him.  Most people wouldn't know what that is, but as a Bob Dylan fan, I do — it's his largely forgotten, widely panned 1978 film that he wrote, directed and starred in.",
    "url": "https://www.cracked.com/article_40871_penn-jillette-wants-to-talk-it-all-out.html"
  },
  {
    "text": "Intimidation of State and Local Officeholders  —  Left unchecked, abuse harms not only elected officials but also the public they serve.  —  The January 6 insurrection at the Capitol seemed to mark a new peak in extremist intimidation targeting public officials.",
    "url": "https://www.brennancenter.org/our-work/research-reports/intimidation-state-and-local-officeholders"
  },
  {
    "text": "An Iowa bill would make students sing the national anthem every day.  One lawmaker sang it  —  When it came time for her closing comments at Wednesday's Iowa House subcommittee meeting, Rep. Sue Cahill stood — and began singing the national anthem.  —  “O say can you see, by the dawn's early light … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/01/25/iowa-bill-require-students-sing-national-anthem-every-day/72349739007/"
  },
  {
    "text": "The Looming Contest Between Two Presidents and Two Americas  —  The general election matchup that seems likely between President Biden and former President Donald J. Trump is about fundamentally disparate visions of the nation.  —  Each of them has sat behind the Resolute Desk in the Oval Office … ",
    "url": "https://www.nytimes.com/2024/01/25/us/politics/two-presidents-two-americas.html"
  },
  {
    "text": "U.S. Secretly Alerted Iran Ahead of Islamic State Terrorist Attack  —  Washington passed actionable intelligence to Tehran about the plot that killed 84 and wounded many more  —  WASHINGTON—The U.S. secretly warned Iran that Islamic State was preparing to carry out the terrorist attack early … ",
    "url": "https://www.wsj.com/world/middle-east/u-s-secretly-alerted-iran-ahead-of-islamic-state-terrorist-attack-af77a19a?mod=followamazon"
  },
  {
    "text": "SCOTUS is poised to take a sledgehammer to federal agencies  —  Why overturning the Chevron precedent would be very big (and bad) deal.  —  ∙ Paid … Since conservatives fully captured the US Supreme Court during the Trump administration, right-wingers have been racking up wins.",
    "url": "https://www.publicnotice.co/p/scotus-chevron-precedent-overturned-explained"
  },
  {
    "text": "MoMA Sued by Artist Who Performed Nude in Marina Abramovic Work  —  The artist, John Bonafede, says museum officials failed to prevent visitors from sexually assaulting performers in the 2010 show.  —  A performance artist has sued the Museum of Modern Art, saying that officials neglected … ",
    "url": "https://www.nytimes.com/2024/01/24/arts/design/moma-lawsuit-nude-artist-marina-abramovic.html"
  },
  {
    "text": "Democrats Are Having a Blast Making a Circus of the GOP's Hunter Biden Probe  —  “We're calling out their bullshit like every single time, and I think they're surprised by it,” one Democrat on the Oversight Committee said. … When Rep. Jared Moskowitz (D-FL) arrived at the Hunter Biden contempt hearing … ",
    "url": "https://www.thedailybeast.com/democrats-are-having-a-blast-making-a-circus-of-the-gops-hunter-biden-probe"
  },
  {
    "text": "What are the best pollsters in America?  —  538's new pollster ratings quantify each firm's error, bias and transparency.  —  538 has new pollster ratings.  —  With former President Donald Trump's recent Republican presidential primary victories in Iowa and New Hampshire … ",
    "url": "https://abcnews.go.com/538/best-pollsters-america/story?id=105563951"
  },
  {
    "text": "Outrage as New Restaurant Opens Called ‘October 7’  —  “We expect the Jordanian government to condemn this publicly and unequivocally,” wrote Israeli opposition leader Yair Lapid.  —  A new restaurant apparently named after the brutal massacre of Israelis by Hamas militants on Oct. 7 has opened in Jordan, sparking outrage in Israel.",
    "url": "https://www.thedailybeast.com/outrage-as-new-restaurant-opens-called-october-7"
  }
]