[
  {
    "text": "Trump Tells Inner Circle That Musk Will Leave Soon  —  The president is pleased with Musk but the decision comes as the tech mogul increasingly looks like a political liability.  —  President Donald Trump has told his inner circle, including members of his Cabinet, that Elon Musk will be stepping … ",
    "url": "https://www.politico.com/news/magazine/2025/04/02/trump-musk-leaving-political-liability-00265784"
  },
  {
    "text": "Republicans reel as Dem over-performances hit a swing state and MAGA country  —  Democrats clinched a landslide victory in Wisconsin and made inroads in two deep-red Florida districts, spelling trouble for Republicans.  —  Republicans emerged from Tuesday's elections on shaky footing.",
    "url": "https://www.politico.com/news/2025/04/02/republicans-florida-special-wisconsin-supreme-court-midterms-029963"
  },
  {
    "text": "The MAGA Backlash Arrives  —  Republicans hold two Florida House seats despite a sharp swing to the Democrats, but Democrats easily keep their Wisconsin Supreme Court majority.  —  Democrats solidified their 4-3 progressive majority on the Wisconsin Supreme Court on Tuesday, and the ramifications are nationwide.",
    "url": "https://www.wsj.com/opinion/wisconsin-supreme-court-election-susan-crawford-brad-schimel-florida-house-gop-jimmy-patronis-randy-fine-38db797f"
  },
  {
    "text": "Waltz's team set up at least 20 Signal group chats for crises across the world  —  It's a more extensive use of the app than previously reported and sheds new light on how commonly the Trump administration's national security team relies on Signal.  —  National security adviser Mike Waltz's … ",
    "url": "https://www.politico.com/news/2025/04/02/waltzs-team-set-up-at-least-20-signal-group-chats-for-crises-across-the-world-00266845"
  },
  {
    "text": "McConnell breaks with party to reject Trump's Canada tariffs  —  Sen. Mitch McConnell privately indicated to Sen. Tim Kaine he would back the Virginia Democrat's resolution to undo President Donald Trump's Canada tariffs.  Kaine told reporters Wednesday that the former GOP leader told … ",
    "url": "https://www.politico.com/live-updates/2025/04/02/congress/mcconnell-breaks-with-party-to-reject-trumps-canada-tariffs-00266037"
  },
  {
    "text": "Stop Looking for Methods in the Madness  —  From Apocalypse Now: … Today, according to Trump and co., is Liberation Day — the day Trump will announce big new tariffs on top of the substantial tariffs he's already slapped on steel, aluminum and autos.  —  Nobody knows much about the details … ",
    "url": "https://paulkrugman.substack.com/p/stop-looking-for-methods-in-the-madness"
  },
  {
    "text": "Frank Luntz: Booker marathon speech ‘may have changed the course of political history’  —  Longtime GOP pollster Frank Luntz said Sen. Cory Booker (D-N.J.) “may have changed the course of political history” with his marathon speech breaking the Senate's record for the longest floor speech in its history.",
    "url": "https://thehill.com/homenews/senate/5227463-cory-booker-senate-record/"
  },
  {
    "text": "Hunter Biden tax informant set to control IRS criminal division  —  The Trump administration has placed a political appointee in charge of tax investigations, in a break with longtime precedent.  —  Just now  —  The Trump administration is amassing influence over criminal investigations at the IRS … ",
    "url": "https://www.washingtonpost.com/business/2025/04/02/trump-administration-irs-politicization/"
  },
  {
    "text": "NYC Mayor Eric Adams corruption case dismissed with prejudice, judge rules  —  New York City Mayor Eric Adams' historic federal corruption case has been dropped.  —  Judge Dale Ho has agreed to the U.S. Department of Justice's request to drop the charges against Adams, but he did so “with prejudice.”",
    "url": "https://www.cbsnews.com/newyork/news/nyc-mayor-eric-adams-corruption-case-dropped/"
  },
  {
    "text": "‘We were lied to:’ Two women the Trump administration tried to send to El Salvador prison speak out  —  The women's accounts raise questions about the thoroughness of the administration's vetting of migrants it has sent to the notorious prison.  —  On March 15, the Trump administration loaded … ",
    "url": "https://www.nbcnews.com/politics/national-security/two-women-trump-admin-tried-send-el-salvador-prison-speak-rcna198958"
  },
  {
    "text": "Inside Elite Law Firms, Protests and Quitting After Trump Deals  —  The discontent does not appear to be resonating with leaders at Paul Weiss and Skadden, but it could hamstring their recruitment efforts.  —  Ever since the elite law firms Paul Weiss and Skadden reached deals with President Trump … ",
    "url": "https://www.nytimes.com/2025/04/02/business/trump-law-firms-skadden-paul-weiss.html?unlocked_article_code=1.8k4.kQod.UHbkab4JqXr6&smid=url-share"
  },
  {
    "text": "Emails Confirm Social Security Administration Canceled Maine Contracts As Political Payback  —  Acting commissioner Leland Dudek called Maine Gov. Janet Mills a “petulant child” for defying Donald Trump.  —  WASHINGTON ― Emails show that the Social Security Administration canceled contracts … ",
    "url": "https://www.huffpost.com/entry/janet-mills-social-security-maine-leland-dudek_n_67ed2d99e4b0b937ab8f135c"
  },
  {
    "text": "Tesla sales plunge: Biggest decline in history  —  Tesla sales plunged 13% in the first three months of this year, as the company reported the largest drop in deliveries in its history by far, amid backlash against CEO Elon Musk ﻿and as growing competition from other automakers' electric vehicles took … ",
    "url": "https://cnn.com/2025/04/02/business/tesla-sales/"
  },
  {
    "text": "How the Trump administration took aim at Maine  —  Maine has faced investigations and arbitrary reversals of funding, turning it into a test case for the Trump administration's approach to perceived adversaries.",
    "url": "https://www.washingtonpost.com/nation/2025/04/02/maine-governor-trump-transgender/"
  },
  {
    "text": "Fauci allies, Covid vaccine officials get ax at NIH  —  The removals have gutted FDA and NIH leadership.  —  As an anti-vaccine activist, Robert F. Kennedy Jr. spent years attacking Anthony Fauci and sowing doubts about the successful effort he led to develop a Covid vaccine.",
    "url": "https://www.politico.com/news/2025/04/02/fauci-allies-covid-vaccine-officials-dismissed-nih-00265714"
  },
  {
    "text": "Val Kilmer, Film Star Who Played Batman and Jim Morrison, Dies at 65  —  A wide-ranging leading man who earned critical praise, he was known to be charismatic but unpredictable.  At one point he dropped out of Hollywood for a decade.  —  Val Kilmer, a homegrown Hollywood actor … ",
    "url": "https://www.nytimes.com/2025/04/01/movies/val-kilmer-dead.html?unlocked_article_code=1.8k4.kU71.-KagT79moRR2&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Elon Musk Can't Take the Heat  —  The numbers say anti-Tesla protests are working.  So do Musk's increasingly unhinged actions.  —  Elon Musk has a simple diagnosis of what's ailing America: It's being destroyed by empathy.  In a long interview with Joe Rogan, in numerous tweets … ",
    "url": "https://www.motherjones.com/politics/2025/04/elon-musk-cant-take-the-heat-wisconsin-supreme-court-empathy-doge/?_thumbnail_id=1124572"
  },
  {
    "text": "Costa Rican former President Oscar Arias says US revoked his visa  —  Former Costa Rican President and Nobel Prize winner Oscar Arias said on Tuesday that the U.S. had revoked his visa to enter the country, weeks after he criticized U.S. President Donald Trump on social media saying he was behaving like “a Roman emperor.”",
    "url": "https://www.reuters.com/world/americas/costa-rican-former-president-oscar-arias-says-us-revoked-his-visa-2025-04-01/"
  },
  {
    "text": "Trump team has weighed deal to save TikTok that would leave algorithm in Chinese ownership  —  The White House has examined a menu of options to avert a TikTok ban deadline set for Saturday.  One proposal — letting TikTok's Chinese owner lease the algorithm to a TikTok spinoff in the U.S. … ",
    "url": "https://www.washingtonpost.com/technology/2025/04/02/tiktok-ban-deal-trump-bytedance-sale/"
  },
  {
    "text": "US officials object to European push to buy weapons locally  —  U.S. officials have told European allies they want them to keep buying American-made arms, amid recent moves by the European Union to limit U.S. manufacturers' participation in weapons tenders, five sources familiar with the matter told Reuters.",
    "url": "https://www.reuters.com/world/us-officials-object-european-push-buy-weapons-locally-2025-04-02/"
  },
  {
    "text": "ICE Raids Idaho Lawmaker's Farm  —  State Rep. Stephanie Mickelsen was reported to ICE for speaking out against Trump's immigration policies.  —  An Idaho Republican state representative has accused her own party of weaponizing federal immigration authorities against her after she publicly … ",
    "url": "https://migrantinsider.com/p/ice-raids-idaho-lawmakers-farm"
  },
  {
    "text": "Unmarked Vans.  Secret Lists.  Public Denunciations.  Our Police State Has Arrived.  —  “It's the unmarked cars,” a friend who grew up under an Argentine dictatorship said.  He had watched the video of the Columbia graduate student Mahmoud Khalil's abduction.",
    "url": "https://www.nytimes.com/2025/04/02/opinion/trump-ice-immigrants.html?unlocked_article_code=1.8k4._TCy.84aV5ShdRuAk&smid=url-share"
  },
  {
    "text": "Princeton considers issuing bonds same day as federal government pauses grants  —  The University has announced that it is considering selling approximately $320 million of taxable bonds.  The sale, first reported on by Bloomberg on Tuesday afternoon, follows the Trump administration's freezing … ",
    "url": "https://www.dailyprincetonian.com/article/2025/04/princeton-news-adpol-issuing-bonds-same-day-federal-government-pauses-grants"
  },
  {
    "text": "Inside Trump and RFK Jr.'s Health Agency ‘Bloodbath’  —  Current and former staffers say that after thousands of people were laid off, the future of agencies like the CDC and FDA are uncertain: ‘Shitshow is an understatement’  —  The Trump administration gutted federal health agencies on Tuesday morning … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-rfk-health-agency-cuts-cdc-fda-1235308888/"
  },
  {
    "text": "‘He repels people’: DeSantis tears into Fine after Florida special election underperformance  —  The governor called Fine a “squish” and blamed policies he supported for an underperformance in the special election.  —  Florida Gov. Ron DeSantis escalated his attacks against Randy Fine on Wednesday … ",
    "url": "https://www.politico.com/news/2025/04/02/desantis-fine-florida-election-underperformance-00266106"
  }
]