[
  {
    "text": "Trump has pulled Fauci's security detail, source says  —  President Donald Trump has terminated Dr. Anthony Fauci's security detail that was being provided and paid for by the National Institutes of Health, a source familiar with the situation tells CNN.  It was pulled on Thursday night.",
    "url": "https://www.cnn.com/2025/01/24/politics/anthony-fauci-security-detail-trump/"
  },
  {
    "text": "Trump returns — and so does his astounding ignorance  —  If you feel off-kilter, you're in good company.  The president seems downright bewildered.  —  “I think we're going to do things that people would be shocked at,” President Donald Trump declared on his second day in office.",
    "url": "https://www.washingtonpost.com/opinions/2025/01/24/trump-first-week-executive-orders-actions/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM3Njk0ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM5MDc3MTk5LCJpYXQiOjE3Mzc2OTQ4MDAsImp0aSI6IjIyZjFmMWE1LTQxODItNGI0NC05OTAwLWE3NWVmOTc2YTgzNSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9vcGluaW9ucy8yMDI1LzAxLzI0L3RydW1wLWZpcnN0LXdlZWstZXhlY3V0aXZlLW9yZGVycy1hY3Rpb25zLyJ9.xrsS0Gz-9j51U1tG3NRSGQlzjZgZJMuHGufcCB7prd0&itid=gfta"
  },
  {
    "text": "Trump enlists attorney general to investigate Biden administration  —  President has thrown weight of justice department behind two politically charged reviews into his personal grievances  —  Donald Trump has tasked the attorney general in two executive orders to conduct far-reaching investigations … ",
    "url": "https://www.theguardian.com/us-news/2025/jan/24/trump-executive-orders-justice-department"
  },
  {
    "text": "ICE agents ‘showed up’ at Chicago school amid heightened concerns of raids  —  Schools across the Chicago area have released guidance about potential situations after the Trump Administration revoked previous guidance prohibiting immigration arrests at schools, churches and hospitals",
    "url": "https://www.nbcchicago.com/news/local/ice-agents-showed-up-at-chicago-school-amid-heightened-concerns-of-raids/3655459/"
  },
  {
    "text": "ICE agents denied entry to South Side elementary school, Chicago Public Schools claims  —  CPS and CTU officials claim ICE agents were denied entry to a school Friday.  —  CHICAGO (WLS) — Chicago Public Schools officials claim U.S. Immigration and Customs Enforcement agents were denied entry … ",
    "url": "https://abc7chicago.com/post/us-immigration-customs-enforcement-agents-denied-entry-hamline-elementary-school-back-yards-cps-officials/15833738/"
  },
  {
    "text": "Newark mayor: ICE raided business without a warrant, detained U.S. citizens  —  U.S. Immigration and Customs Enforcement agents carried out a raid on a Newark business Thursday, detaining non-citizens and citizens alike, according to Mayor Ras J. Baraka.  —  The incident, which could not immediately … ",
    "url": "https://www.nj.com/essex/2025/01/newark-mayor-ice-raided-business-without-a-warrant-detained-us-citizens.html"
  },
  {
    "text": "Donald Trump in fiery call with Denmark's prime minister over Greenland  —  US president insisted he wants to take over Arctic island  —  Donald Trump insisted he was serious in his determination to take over Greenland in a fiery telephone call with Denmark's prime minister, according to senior European officials.",
    "url": "https://www.ft.com/content/ace02a6f-3307-43f8-aac3-16b6646b60f6"
  },
  {
    "text": "Experts saw Samoa's plunging vaccination rates as a crisis.  RFK Jr. saw an opportunity.  —  New details show how Robert F. Kennedy Jr., then chair of an anti-vaccine group and now Trump's pick for health secretary, sought to exploit a deadly vaccine accident.",
    "url": "https://www.nbcnews.com/news/us-news/rfk-jr-samoa-measles-vaccine-crisis-rcna187787"
  },
  {
    "text": "State Department issues immediate, widespread pause on foreign aid  —  The “stop-work orders” appear to apply to US aid for all countries except Israel and Egypt.  —  Secretary of State Marco Rubio on Friday issued new guidance halting spending on most existing foreign aid grants for 90 days.",
    "url": "https://www.politico.com/news/2025/01/24/state-department-foreign-aid-pause-00200510"
  },
  {
    "text": "Trump Says States Should Manage Disasters.  Former FEMA Leaders Agree.  —  “I'd rather see the states take care of their own problems,” the president said.  Federal emergency managers from both parties have made the same argument.  —  President Trump plans to tour damage on Friday … ",
    "url": "https://www.nytimes.com/2025/01/24/climate/trump-says-states-should-manage-disasters-former-fema-leaders-agree.html"
  },
  {
    "text": "Trump's Plan to Crush the Academic Left  —  Last year, Chris Rufo, the influential right-wing strategist who spearheaded the campaign against diversity, equity and inclusion, or D.E.I., initiatives, told me about his ambitions for a second Trump presidency.  He hoped, he said … ",
    "url": "https://www.nytimes.com/2025/01/24/opinion/trump-dei-education-harvard.html?unlocked_article_code=1.rk4.tqup.HyOsQkRyhSgl&smid=url-share"
  },
  {
    "text": "Rutgers Center Cancels Conference in Response to Trump DEI Orders  —  The Rutgers University Center for Minority Serving Institutions announced Thursday that it has canceled an upcoming virtual conference about registered apprenticeship programs as a result of President Trump's executive … ",
    "url": "https://www.insidehighered.com/news/quick-takes/2025/01/24/rutgers-cancels-hbcu-event-align-trump-dei-orders"
  },
  {
    "text": "Paul Krugman on Leaving the New York Times  —  The paper wanted to take away his newsletter or make him write less frequently, he says.  —  For two and a half decades, Paul Krugman's columns in the New York Times were beacons of intelligence and common sense.",
    "url": "https://www.cjr.org/analysis/paul-krugman-leaving-new-york-times-heavy-hand-editing-less-frequent-columns-newsletter.php"
  },
  {
    "text": "Elon Musk doesn't deserve the benefit of the doubt  —  Since Donald Trump's rise to power, some liberals have developed a bad habit of seeing secret Nazi imagery everywhere on the right.  —  Be it Laura Ingraham allegedly sieg-heiling at the 2016 Republican National Convention … ",
    "url": "https://www.vox.com/politics/396535/elon-musk-nazi-salute-trump-inauguration"
  },
  {
    "text": "DOJ asks judge to drop order barring Oath Keepers from visiting Capitol  —  Stewart Rhodes, previously sentenced to 18 years for seditious conspiracy, was at the Capitol Wednesday chatting up lawmakers and reporters.  —  The Justice Department is asking a federal judge to drop … ",
    "url": "https://www.politico.com/news/2025/01/24/oath-keepers-stewart-rhodes-capitol-006453"
  },
  {
    "text": "Dems Worry Sen. Whitehouse Considering Vote for RFK Jr  —  Wanted to share some information on the RFK Jr. nomination before the Senate.  —  It probably won't surprise you that RFK Jr., along with Tulsi Gabbard, are among the few Trump nominees who might actually not get confirmed.",
    "url": "https://talkingpointsmemo.com/edblog/dems-worry-sen-whitehouse-considering-vote-for-rfk-jr"
  },
  {
    "text": "Team Trump Says Mark Zuckerberg Has ‘More Ass-Kissing’ to Do  —  Trump's aides and allies aren't ready to buy the Facebook chief's right-wing conversion.  “He can't just snap his fingers and make the past not happen” … The Meta CEO and Facebook co-founder reportedly promised the administration … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-mark-zuckerberg-facebook-meta-right-wing-1235245769/"
  },
  {
    "text": "Trump administration tests the power to email every federal employee at once  —  The new feature, announced by the Office of Personnel Management, aligns with the goals of DOGE.  —  WASHINGTON — President Donald Trump's administration is testing a new capability that would allow officials … ",
    "url": "https://www.nbcnews.com/politics/white-house/trump-administration-tests-power-email-every-federal-employee-rcna189126"
  },
  {
    "text": "Sensing Political Support, Abortion Opponents Raise Ambitions  —  The March for Life on Friday will bring together a movement invigorated by some early moves of the second Trump administration.  —  Anti-abortion activists are charging ahead with their ultimate mission to end all abortions nationwide … ",
    "url": "https://www.nytimes.com/2025/01/24/us/abortion-march-for-life.html"
  },
  {
    "text": "Supreme Court to hear church-state fight over Oklahoma bid to launch first publicly funded religious school  —  An attempt to authorize the Catholic school was challenged as a violation of the First Amendment, which limits government involvement in religion.",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-hear-church-state-fight-oklahoma-bid-launch-first-public-rcna186031"
  },
  {
    "text": "RFK Jr. skipped meeting where officials planned fight against a future pandemic  —  The session between Trump and Biden administration officials is required of transitions and included other Trump Cabinet nominees.  —  As Biden officials packed up the White House last week … ",
    "url": "https://www.washingtonpost.com/politics/2025/01/24/rfk-jr-trump-biden-pandemic/"
  },
  {
    "text": "Two Words and a World of Trouble  —  Let me tell you a story about clowns evolving into velociraptors.  —  ∙ Paid  —  Bill Kristol sat in for Sarah on the Secret Pod today and it was dark.  Just a warning.  If you're not in good head-space to begin with today, maybe skip this episode?",
    "url": "https://www.thebulwark.com/p/two-words-and-a-world-of-trouble"
  },
  {
    "text": "Inside the room: Where House Republicans are looking to slash … We got our hands on the presentations that House committee chairs made during a closed-door Republican conference meeting this week.  —  They lay out a road map of where the GOP's hunt for spending cuts is heading right now.",
    "url": "https://punchbowl.news/article/house/gop-seeks-places-to-slash-spending/"
  },
  {
    "text": "New GOP bill would let Trump (but not Obama) run for a third term  —  Rep. Andy Ogles' bill to amend the Constitution and empower Donald Trump to seek a third term will inevitably fail.  That doesn't mean it's irrelevant.  —  About a week after Donald Trump was elected to a second term … ",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/new-gop-bill-let-trump-not-obama-run-third-term-rcna189099"
  },
  {
    "text": "Target rolls back DEI initiatives, the latest big company to retreat … Target on Friday said it's rolling back diversity, equity and inclusion programs — including some that aim to make its workforce and merchandise better reflect its customers.  —  In a memo sent to its employees … ",
    "url": "https://www.cnbc.com/2025/01/24/target-rolls-back-major-dei-initiatives.html"
  },
  {
    "text": "Fetterman touts new federal rule boosting wages for thousands of federal workers in Pa.  —  Sen. John Fetterman, D-Pa., is hailing a new rule that ends a longstanding pay disparity between hourly and salaried federal workers.  (Chip Somodevilla/Getty Images)",
    "url": "https://penncapital-star.com/government-politics/fetterman-touts-new-federal-rule-boosting-wages-for-thousands-of-federal-workers-in-pa/"
  },
  {
    "text": "DOGE Will Allow Elon Musk to Surveil the US Government From the Inside  —  A former USDS employee called the repurposing of the Digital Service into DOGE an “A+ bureaucratic jiujitsu move.”  It will give Musk and his associates access to unclassified data in every government agency.",
    "url": "https://www.wired.com/story/doge-elon-musk/"
  }
]