[
  {
    "text": "Playbook: Jim Jordan's day of reckoning  —  Presented by With help from Eli Okun and Garrett Ross  —  DRIVING THE DAY  —  STILL TAKING APPLICATIONS — “How House Speaker Became Washington's Most Miserable Job,” by Ian Ward: “'You basically have a tied House with no operational majority,' said [political scientist MATTHEW] GREEN.",
    "url": "https://www.politico.com/newsletters/playbook/2023/10/17/jim-jordans-day-of-reckoning-00121910"
  },
  {
    "text": "The Apotheosis of Jim Jordan Is a Sight to Behold  —  No problem in the American system at this moment is as acute and disruptive as the one posed by the Republican Party.  —  Yes, of course, there are any number of structural problems facing American politics.",
    "url": "https://www.nytimes.com/2023/10/17/opinion/jim-jordan-house-speaker.html"
  },
  {
    "text": "Democrats prepare to chain GOP to ‘far-right’ Jordan in 2024  —  If the hardline Trump ally becomes speaker, “it's not like putting a fox in the henhouse,” one prominent Dem said.  “It's like blowing up the henhouse.”  —  As House Republicans gear up for yet another chaotic fight to choose a leader … ",
    "url": "https://www.politico.com/news/2023/10/17/democrats-gop-jim-jordan-2024-00121933"
  },
  {
    "text": "Democrats craft strategy to make GOP pay at the ballot box if Jim Jordan is elected speaker  —  A memo first shared with NBC News advises Democrats about how to cast Republicans as beholden to Donald Trump and “extremism” should Jordan become speaker.  —  WASHINGTON — Democrats … ",
    "url": "https://www.nbcnews.com/politics/congress/democrats-craft-strategy-make-gop-pay-jim-jordan-speaker-rcna120720"
  },
  {
    "text": "‘Everything Is Just Stuck.’ No Matter What Happens to Jim Jordan, the Next Speaker Is In For a World of Trouble.  —  An expert on House speakers explains how changes in campaign finance, media, and the type of people who get elected created the current debacle.",
    "url": "https://www.politico.com/news/magazine/2023/10/17/matthew-green-interview-jim-jordan-00121803"
  },
  {
    "text": "10/17/23 ☀️ Punchbowl News AM  —  Jim Jordan has problems.  —  The Ohio Republican plans to head to the floor today for a speaker election with more than a dozen GOP lawmakers saying they'll vote against him or are undecided about his candidacy.",
    "url": "https://punchbowl.news/archive/101723-punchbowl-news-am/"
  },
  {
    "text": "Jim Jordan's day of reckoning  —  Good morning, Early Birds.  We appreciate that Rep. Derek Kilmer (D-Wash.) has apologized for making puns on Twitter (sorry, X) but fear he might not be entirely sincere.  Tips: earlytips@washpost.com.  Was this forwarded to you?  Sign up here.  Thanks for waking up with us.",
    "url": "https://www.washingtonpost.com/politics/2023/10/17/jim-jordans-day-reckoning/"
  },
  {
    "text": "House likely to vote today on Jim Jordan for speaker  —  The House is expected to vote Tuesday afternoon on whether to make Rep. Jim Jordan (R-Ohio) its next speaker.  Jordan, a conservative firebrand who is allied with former president Donald Trump, was chosen by fellow Republicans on Friday … ",
    "url": "https://www.washingtonpost.com/politics/2023/10/17/house-speaker-vote/"
  },
  {
    "text": "Rep Jasmine Crockett Says Dems are ‘the Adults’ Amid GOP Speaker Battle: ‘They Always Expect Us To Fix Their Mess’  —  The Texas lawmaker claimed there's a ‘double standard’ for the two major parties as Jim Jordan attempts to replace Kevin McCarthy … Rep. Jasmine Crockett, D-Texas … ",
    "url": "https://themessenger.com/politics/rep-jasmine-crockett-says-dems-are-the-adults-amid-gop-speaker-battle-they-always-expect-us-to-fix-their-mess"
  },
  {
    "text": "Israel bombs Gaza region where civilians were told to seek refuge, as mediators try to unlock aid  —  Israel bombed areas of southern Gaza where it had told Palestinians to flee to ahead of an expected ground invasion, killing dozens of people on Tuesday in attacks it says are targeted … ",
    "url": "https://apnews.com/article/israel-palestinians-gaza-hamas-war-biden-rafah-e062825a375d9eb62e95509cab95b80c"
  },
  {
    "text": "Ukraine uses secretly shipped U.S. missiles to launch surprise strike  —  The delivery and use on the battlefield marks a major ramp up of the administration's defense of Ukraine.  —  The Ukrainian military on Tuesday used U.S.-supplied longer-range missiles to strike nine Russian helicopters … ",
    "url": "https://www.politico.com/news/2023/10/17/ukraine-uses-secretly-shipped-u-s-missiles-to-launch-surprise-strike-00121932"
  },
  {
    "text": "Lawyers, Trump and money: Ex-president spends millions in donor cash on attorneys as legal woes grow  —  Donald Trump's political fundraising machine is raking in donations at a prodigious pace, but he's spending tens of millions of dollars he's bringing in to pay attorneys to deal … ",
    "url": "https://apnews.com/article/trump-lawyers-millions-payments-2024-campaign-2e06de2a8a90b3752e7758dfea56a509"
  },
  {
    "text": "'We can't wait for the House'  —  Chuck Schumer is instructing three top Democratic committee leaders to hammer out a deal with Republicans on an aid package for Israel that could pass in the coming weeks.  The leading Democratic negotiators: Appropriations Chair Patty Murray … ",
    "url": "https://www.politico.com/live-updates/2023/10/17/congress/schumer-senate-leaders-israel-aid-house-00121943"
  },
  {
    "text": "'There's just no excitement': Retail politics takes a nosedive in a Trump-dominated campaign  —  Operatives and activists can't recall a recent cycle with so little grassroots campaigning.  The numbers back them up.  —  If the Republican presidential primary this year is putting you half to sleep, you're not alone.",
    "url": "https://www.politico.com/news/2023/10/17/retail-politics-2024-election-00121851"
  },
  {
    "text": "America's zombie “crime wave”  —  Judd Legum, Tesnim Zekeria, and Rebecca Crosby  —  The outset of the pandemic in 2020 coincided with a surge in violent crime in the United States, with murder rates rising particularly dramatically.  According to a lot of people with large megaphones, this crime wave continues today.",
    "url": "https://popular.info/p/americas-zombie-crime-wave"
  },
  {
    "text": "Pentagon Orders 2,000 More U.S. Troops to Be Ready to Deploy to the Middle East  —  If deployed, they would likely not serve in combat roles but would provide advice and medical support to Israeli forces, the official added.  —  Defense Secretary Lloyd J. Austin III has ordered about 2,000 … ",
    "url": "https://www.nytimes.com/2023/10/17/world/middleeast/pentagon-us-troops.html"
  },
  {
    "text": "Why a Conflicts Hearing For Trump Co-Defendant Waltine Nauta Imploded  —  The government sprung a new Garcia argument on Judge Cannon.  She wasn't pleased.  —  Meet The Authors … Last Thursday afternoon, U.S. District Judge Aileen Cannon of the Southern District of Florida had scheduled … ",
    "url": "https://www.lawfaremedia.org/article/why-a-conflicts-hearing-for-trump-co-defendant-waltine-nauta-imploded"
  },
  {
    "text": "President Joe Biden will visit Israel in high-stakes trip  —  US President Joe Biden will visit Israel on Wednesday, US Secretary of State Antony Blinken announced in the early hours of Tuesday from Tel Aviv.  —  Biden had been deliberating whether to make a wartime visit to Israel … ",
    "url": "https://www.cnn.com/2023/10/16/politics/joe-biden-israel-visit/"
  },
  {
    "text": "Judge imposes gag order on Donald Trump in D.C. trial  —  Judge Tanya Chutkan said Trump's “presidential candidacy does not give him carte blanche to vilify ... public servants who are simply doing their job.”  —  A federal judge has barred Donald Trump from attacking witnesses … ",
    "url": "https://www.politico.com/news/2023/10/16/judge-imposes-gag-order-on-donald-trump-in-d-c-trial-00121743"
  }
]