[
  {
    "text": "Here's How Biden Can Turn It Around  —  Top Democrats agree that the president needs more aggressiveness, more help from his friends and a few more friends.  Liz Cheney, Rahm Emanuel and Mitt Romney can help.  —  Just under one year before the presidential election, Democrats should be concerned … ",
    "url": "https://www.politico.com/news/magazine/2023/11/13/biden-2024-reelection-challenges-strategy-00126776"
  },
  {
    "text": "MAGA-dominated state Republican parties plagued by infighting, money woes  —  National Republicans fear the cash crunch could hamper field operations in key swing states come 2024  —  In Arizona, the state GOP chairman has been begging the Republican National Committee for a financial bailout.",
    "url": "https://www.washingtonpost.com/politics/2023/11/13/republican-state-parties-struggles-maga/"
  },
  {
    "text": "I Was Obama's 2012 Campaign Manager.  There's No Need to Panic Over Biden.  —  Don't sweat the doom and gloom polling.  We've been here before.  —  As you walk into my office, the first thing you see is a framed magazine cover.  It's not from the days of triumph — like in November 2012 … ",
    "url": "https://www.politico.com/news/magazine/2023/11/13/obama-2012-campaign-manager-advice-00126736"
  },
  {
    "text": "Maryanne Trump Barry, Donald Trump's Older Sister, Dies at 86  —  A retired federal judge in New Jersey, she supported her brother but, as secret audio recordings revealed in 2019, she could also be scathingly critical of him.  —  Maryanne Trump Barry, a former federal judge who was an older sister … ",
    "url": "https://www.nytimes.com/2023/11/13/us/politics/maryanne-trump-barry-dead.html"
  },
  {
    "text": "Behind the Curtain: Trump allies pre-screen loyalists for unprecedented power grab … - His top obsession will be the Justice Department, the FBI and the intelligence community — all of which he thinks conspired to investigate him, thwart him, screw him.",
    "url": "https://www.axios.com/2023/11/13/trump-loyalists-2024-presidential-election"
  },
  {
    "text": "Playbook PM: The Johnson CR whip count begins  —  RESOLVING THE RESOLUTION — With just four days until a government shutdown, the race is on to see whether Speaker MIKE JOHNSON's plan for a two-pronged clean continuing resolution can peel off enough House Democrats to make up for Republican defections.",
    "url": "https://www.politico.com/newsletters/playbook-pm/2023/11/13/the-johnson-cr-whip-count-begins-00126855"
  },
  {
    "text": "Historian Meacham links Trump ‘vermin’ comments to ‘most ghastly kinds of crimes’  —  Presidential historian Jon Meacham on Monday linked former President Trump's recent comments pledging to “root out” the “vermin” of the U.S. to fascist dictators of the 1930s.",
    "url": "https://thehill.com/blogs/blog-briefing-room/4306953-meacham-trump-vermin-ghastly-crimes-morning-joe/"
  },
  {
    "text": "Secret Service agents protecting Biden's granddaughter open fire when 3 people try to break into SUV  —  Secret Service agents protecting President Joe Biden's granddaughter opened fire after three people tried to break into an unmarked Secret Service vehicle in the nation's capital, a law enforcement official told The Associated Press.",
    "url": "https://apnews.com/article/naomi-biden-secret-service-shooting-washington-georgetown-997126378e864c5acd0c9a1c6618c4e2"
  },
  {
    "text": "New book details Trump lawyers' secret meeting with Jack Smith ahead of DC indictment  —  ABC's Jonathan Karl offers an account of a fateful July 27 meeting in his forthcoming book.  —  Jack Smith's public image, shaped by his near invisibility since taking over the federal criminal cases … ",
    "url": "https://www.politico.com/news/2023/11/13/book-trump-lawyers-meeting-jack-smith-00126681"
  },
  {
    "text": "Scoop: Trump hung up on Kim Kardashian, new Jonathan Karl book says  —  Former President Trump hung up on Kim Kardashian when she called for help with a clemency case — because he assumed she voted for President Biden, ABC News' Jonathan Karl writes in “Tired of Winning,” out Tuesday.",
    "url": "https://www.axios.com/2023/11/13/trump-biden-white-house-kim-kardashian-book"
  },
  {
    "text": "South Carolina Sen. Tim Scott abruptly ends 2024 presidential bid, shocking even his campaign staff  —  Republican presidential candidate Tim Scott abruptly announced late Sunday that he was dropping out of the 2024 race, a development that surprised his donors and stunned his campaign staff … ",
    "url": "https://apnews.com/article/tim-scott-drops-out-2024-race-b9cc8fbeba57a123789d8d0484164e38"
  },
  {
    "text": "Supreme Court adopts code of conduct amid ethics scrutiny  —  The court has been under pressure to act ever since a series of reports raised questions about whether justices were following ethics rules.  —  WASHINGTON — The Supreme Court on Monday announced it has adopted what it called … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-code-of-conduct-rcna124951"
  },
  {
    "text": "Why pro-China David Cameron is the UK's new foreign secretary  —  In a shocking development, British Prime Minister Rishi Sunak appointed David Cameron as the nation's foreign minister (the equivalent position to the U.S. secretary of state) on Monday.  —  A fellow member of the Conservative Party … ",
    "url": "https://www.washingtonexaminer.com/opinion/why-pro-china-david-cameron-is-the-uks-new-foreign-secretary"
  },
  {
    "text": "Stephen Miller's “America First Legal” is more dangerous than you think  —  This free edition of Public Notice is made possible by paid subscribers.  If you aren't one already, please consider signing up.  Just click the button below.  —  Click for Public Notice free trial",
    "url": "https://www.publicnotice.co/p/stephen-miller-america-first-legal-explained"
  },
  {
    "text": "Sinema left the Democratic Party.  Democratic donors left her too.  —  A POLITICO analysis of campaign finance data reveals a tough road ahead if the Arizona independent runs for reelection.  —  Democratic donors have fled Sen. Kyrsten Sinema since she left the party … ",
    "url": "https://www.politico.com/news/2023/11/13/kyrsten-sinema-donors-democrats-00126676"
  },
  {
    "text": "Pro-Hitler and Holocaust denier account: X has paid me $3,000 in ad revenue sharing  —  Musk and Yaccarino's X has been placing ads for BetMGM, DraftKings, and FanDuel on the pro-Hitler account  —  There's more bad news for brands that advertise on X (formerly Twitter): They're helping financially reward pro-Adolf Hitler propaganda.",
    "url": "https://www.mediamatters.org/twitter/pro-hitler-and-holocaust-denier-account-x-has-paid-me-3000-ad-revenue-sharing"
  },
  {
    "text": "Vivek Ramaswamy calls the most coveted endorsement in New Hampshire a ‘kiss of death’  —  Gov. Chris Sununu, who has high favorability ratings, has been sought after by other candidates.  But he also criticized Ramaswamy's debate behavior.  —  MERRIMACK, N.H. — Vivek Ramaswamy called … ",
    "url": "https://www.nbcnews.com/meet-the-press/meetthepressblog/vivek-ramaswamy-calls-coveted-endorsement-new-hampshire-kiss-death-rcna124938"
  },
  {
    "text": "Capitol rioter plans 2024 run as a Libertarian candidate in Arizona's 8th congressional district  —  Jacob Chansley, the spear-carrying rioter whose horned fur hat, bare chest and face paint made him one of the more recognizable figures in the Jan. 6, 2021, assault on the U.S. Capitol, apparently aspires to be a member of Congress.",
    "url": "https://apnews.com/article/capitol-rioter-arizona-congress-chansley-33de9a9f4ff1ea35cd12d9719a2f2987"
  },
  {
    "text": "We were interviewing a Palestinian farmer.  Then the drone and soldiers appeared  —  WEST BANK - There are days when you head out to report a story, and you think you know where it's going.  And then it spins in an entirely different direction.  —  This is the story of one such day last Tuesday … ",
    "url": "https://www.npr.org/2023/11/13/1211987812/israel-hamas-west-bank-gaza-war-conflict-idf"
  }
]