[
  {
    "text": "How Trump's Election Lies Left the Michigan G.O.P. Broken and Battered  —  Infighting between Trump acolytes and traditionalists has driven away donors and voters.  Can the Michigan Republican Party rebuild in time for the presidential election?  —  The Michigan Republican Party is starving for cash.",
    "url": "https://www.nytimes.com/2023/08/29/us/politics/trump-michigan-republican-party.html"
  },
  {
    "text": "AJC poll: Trump leads Republicans in Georgia despite Fulton County charges  —  X  —  Former President Donald Trump has a dominant lead over Republican rivals in Georgia despite his electoral setbacks in the state, according to an Atlanta Journal-Constitution poll that suggests … ",
    "url": "https://www.ajc.com/politics/ajc-poll-trump-leads-republicans-in-georgia-despite-fulton-county-charges/3YXEW4VA7NBNBKJVM6RIE777V4/"
  },
  {
    "text": "These are the first 10 drugs subject to Medicare price negotiations  —  The Biden administration unveiled Tuesday the names of the first 10 drugs subject to price negotiations in Medicare.  —  They are: Eliquis, Jardiance, Xarelto, Januvia, Farxiga, Entresto, Enbrel, Imbruvica, Stelara … ",
    "url": "https://www.cnn.com/2023/08/29/politics/medicare-drug-price-negotiations/"
  },
  {
    "text": "FACT SHEET: Biden-Harris Administration Announces First Ten Drugs Selected for Medicare Price Negotiation  —  This action is on top of progress previously made in reducing the cost of insulin to $35 a month for people with Medicare  —  For far too long, Americans have paid more for prescriptions drugs than any major economy.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2023/08/29/fact-sheet-biden-harris-administration-announces-first-ten-drugs-selected-for-medicare-price-negotiation/"
  },
  {
    "text": "A shutdown wouldn't halt Trump's trials, so Republicans seek to rein in his prosecutors  —  Federal criminal proceedings are exempted from shutdowns.  But GOP House members want to use a must-pass funding bill to defund or limit law enforcement investigating Trump.",
    "url": "https://www.nbcnews.com/politics/donald-trump/shutdown-wouldnt-halt-trumps-trials-republicans-seek-rein-prosecutors-rcna102152"
  },
  {
    "text": "GOP salivates at the biggest campaign finance win since Citizens United  —  It could be a seismic shift in how tens of millions of campaign dollars are spent.  —  Republicans have waged a decades-long battle to blow up the campaign-finance laws that rein in big-money spending.",
    "url": "https://www.politico.com/news/2023/08/29/gop-campaign-finance-citizens-united-00113235"
  },
  {
    "text": "GOP silences ‘Tennessee Three’ Democrat on House floor for day on ‘out of order’ rule; crowd erupts  —  Republican lawmakers voted Monday to temporarily silence a Democratic member of the so-called Tennessee Three during an already tense House floor session after determining … ",
    "url": "https://apnews.com/article/tennessee-special-session-gun-control-f0af470eb6f377633735c5a1dcefa66f"
  },
  {
    "text": "EXCLUSIVE: Eminem sends Vivek Ramaswamy a cease and desist letter demanding he stop rapping his music on the campaign trail  — Rapper Eminem has objected to Republican candidate Vivek Ramaswamy using his music on the campaign trail, DailyMail.com can exclusively report",
    "url": "https://www.dailymail.co.uk/news/article-12453955/Im-REAL-Slim-Shady-Eminem-sends-skinny-Vivek-Ramaswamy-cease-desist-letter-demanding-stop-rapping-music-campaign-trail.html"
  },
  {
    "text": "Supreme Court Justice Amy Coney Barrett Says She Welcomes Public Scrutiny Of Court  —  U.S. Supreme Court Justice Amy Coney Barrett did not offer any opinion, or speak directly about, recent calls for the justices to institute an official code of conduct.  —  LOADING",
    "url": "https://www.huffpost.com/entry/supreme-court-barrett_n_64edc1e4e4b05b73949dea39"
  },
  {
    "text": "Faculty member shot and killed in a campus building, says University of North Carolina official  —  A University of North Carolina faculty member was shot and killed in a campus building, officials said Monday.  A suspect was arrested about an hour and a half after shots were reported … ",
    "url": "https://apnews.com/article/university-north-carolina-chapel-hill-shooting-9a264145d183eeb7c28bb7d6a467ab39"
  },
  {
    "text": "More than 60 people arrested at a gay wedding in southern Nigeria  —  Arrests of gay people are common in Nigeria, where the Same Sex Marriage Prohibition Act carries up to 10 years in jail for gay individuals.  —  ABUJA, Nigeria — Police in Nigeria said Tuesday they detained … ",
    "url": "https://www.nbcnews.com/nbc-out/out-news/60-people-arrested-gay-wedding-southern-nigeria-rcna102302"
  },
  {
    "text": "Afghans who fought in secret CIA-trained force face legal uncertainty in the U.S.  —  Fighters from the “Zero Units” got work permits when they escaped to the U.S. Those permits expire soon, and now some fighters worry their CIA pasts might be working against them.",
    "url": "https://www.nbcnews.com/politics/national-security/afghans-fought-secret-cia-trained-force-face-legal-uncertainty-us-rcna102105"
  },
  {
    "text": "Old Clip Shows Vivek Ramaswamy Asking Candidate Question That Now Applies To Self  —  Video from 2003 shows 18-year-old Ramaswamy asking the Rev. Al Sharpton why he should vote for an inexperienced politician.  —  LOADING  —  Vivek Ramaswamy once asked a rather prescient question that applies to himself today.",
    "url": "https://www.huffpost.com/entry/vivek-ramaswamy-al-sharpton-inexperienced-politician_n_64edc0bce4b0e32801d610e3"
  },
  {
    "text": "Playbook: A first look at the big new Biden book  —  Presented by With help from Eli Okun and Garrett Ross  —  DRIVING THE DAY  —  IDALIA LATEST — From the National Hurricane Center's 5 a.m. update: “IDALIA NOW A HURRICANE ... EXPECTED TO RAPIDLY INTENSIFY INTO AN EXTREMELY DANGEROUS MAJOR HURRICANE BEFORE LANDFALL ON WEDNESDAY.”",
    "url": "https://www.politico.com/newsletters/playbook/2023/08/29/a-first-look-at-the-big-new-biden-book-00113271"
  },
  {
    "text": "Former Trump adviser Peter Navarro's testimony in contempt case is ‘weak sauce,’ judge says  —  The federal judge overseeing Peter Navarro's contempt of Congress criminal case on Monday called his defense arguments “pretty weak sauce,” injecting last-minute uncertainty into how the former Donald Trump adviser … ",
    "url": "https://www.cnn.com/2023/08/28/politics/peter-navarro-testimony-contempt-of-congress-case/"
  },
  {
    "text": "How Vivek Ramaswamy makes money from climate denial  —  At Wednesday's debate, Ramaswamy said he was the “only candidate who's not bought and paid for.”  That couldn't be further from the truth.  —  At the first Republican presidential debate last week, most of the candidates struggled … ",
    "url": "https://heated.world/p/how-vivek-ramaswamy-makes-money-from"
  },
  {
    "text": "Mark Meadows takes stand in bid to derail Georgia criminal charges  —  The former top Trump aide testified that he viewed nearly everything as part of his official duties — an argument he hopes will give him immunity.  —  ATLANTA — Former Trump White House Chief of Staff Mark Meadows took … ",
    "url": "https://www.politico.com/news/2023/08/28/meadows-testimony-georgia-hearing-00113215"
  },
  {
    "text": "Biden is ‘old,’ Trump is ‘corrupt’: AP-NORC poll has ominous signs for both in possible 2024 rematch  —  WASHINGTON (AP) — Old.  Confused.  Corrupt.  Dishonest.  —  Those are among the top terms Americans use when they're asked to describe President Joe Biden and former President Donald Trump … ",
    "url": "https://apnews.com/article/biden-trump-2024-poll-old-corrupt-12b806876e2072790f9a67793761c688"
  },
  {
    "text": "Ramaswamy Fires At Nikki Haley On Campaign Website: ‘Keep Lying, Namrata Randhawa’  —  The 2024 hopeful's website referenced the former ambassador's birth name to dispel a ‘myth’ about his support of Israel  —  A Facebook icon representing an external link to share the article on Facebook … ",
    "url": "https://themessenger.com/politics/ramaswamy-fires-at-nikki-haley-on-campaign-website-keep-lying-namrata-randhawa"
  }
]