[
  {
    "text": "The Trump-Zelensky blowup, broken down by body-language analysts  —  The decision not to use an interpreter, the power imbalance, Trump's misstatements and Zelensky's “warrior energy” helped fuel the unusual public flap.  —  just now  —  President Donald Trump and Vice President JD Vance … ",
    "url": "https://www.washingtonpost.com/world/2025/03/01/zelensky-trump-video-body-language/"
  },
  {
    "text": "Norway fuel giant ‘refuses to fill US submarines’ after Trump-Zelensky clash  —  Norwegian petroleum giant Haltbakk Bunkers has declared it will no longer help the US Navy.  —  A petrol giant in Norway has announced a ban on fuel sales to all US forces following Donald Trump's treatment … ",
    "url": "https://www.express.co.uk/news/world/2021304/norway-fuel-giant-refuses-fill"
  },
  {
    "text": "Murkowski rebukes Trump over Ukraine: ‘Walking away from our allies’  —  The Alaska senator's statement was a rare note of dissent from a Republican.  —  Sen. Lisa Murkowski delivered a scorching rebuke Saturday of President Donald Trump's explosive exchange with Ukrainian President Volodymyr Zelenskyy … ",
    "url": "https://www.politico.com/news/2025/03/01/trump-zelenskyy-meeting-lisa-murkowski-00206874"
  },
  {
    "text": "The War Trump Chooses  —  That wasn't Trump against Zelens'kyi.  It was Americans against reason  —  The Americans claim that their attempt to humiliate the Ukrainian president in the White House yesterday was about peace.  On that premise, nothing they said makes any sense.",
    "url": "https://snyder.substack.com/p/the-war-trump-chooses"
  },
  {
    "text": "A Day of American Infamy  —  In August 1941, about four months before the Japanese attack on Pearl Harbor, Franklin Roosevelt met with Winston Churchill aboard warships in Newfoundland's Placentia Bay and agreed to the Atlantic Charter, a joint declaration by the world's leading democratic powers on … ",
    "url": "https://www.nytimes.com/2025/02/28/opinion/a-day-of-american-infamy.html?unlocked_article_code=1.0k4.2WNT.xlHiyZ4L5Pwy&smid=bs-share"
  },
  {
    "text": "Good Trouble: JD Vance Chastised by Vermont Snow Reporter  —  JD Vance, fresh off of helping his boss ambush & insult a foreign leader in the White House yesterday afternoon, is on vacation in Vermont with his family this weekend and will be skiing at Sugarbush Resort in Warren, VT, a 15-minute drive from where I live.",
    "url": "https://kottke.org/25/03/jd-vance-chastised-by-vermont-snow-reporter"
  },
  {
    "text": "A letter to the American People:  —  For over 11 years, 18F has been proudly serving you to make government technology work better.  We are non-partisan civil servants.  18F has worked on hundreds of projects, all designed to make government technology not just efficient but effective, and to save money for American taxpayers.",
    "url": "https://18f.org/"
  },
  {
    "text": "Andrew Cuomo for Mayor?  His “First Accuser” Says New York City Deserves Better  —  Taxpayers have paid millions defending the former governor and top aides against accusers' allegations.  —  New York City deserves better than Andrew Cuomo.  As frustrated as city residents rightfully … ",
    "url": "https://www.vanityfair.com/news/story/new-york-city-deserves-better-than-andrew-cuomo"
  },
  {
    "text": "The Trump Administration Said These Aid Programs Saved Lives.  It Canceled Them Anyway.  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up to receive our biggest stories as soon as they're published.  —  After the Trump administration moved to freeze nearly $60 billion … ",
    "url": "https://www.propublica.org/article/trump-usaid-rubio-marocco-canceled-programs-gaza-syria-congo-hiv-ebola"
  },
  {
    "text": "Pentagon orders up to 3,000 troops and Stryker combat vehicles to border  —  Defense Secretary Pete Hegseth approved orders on Friday to further militarize the U.S. southern border with Mexico, officials said.  —  Just now  —  Defense Secretary Pete Hegseth has ordered an additional 2,500 … ",
    "url": "https://www.washingtonpost.com/national-security/2025/03/01/hegseth-border-troops-mexico-stryker/"
  },
  {
    "text": "Musk's Purges Suddenly Take a Horrific Turn—and Wreck an Ugly MAGA Lie  —  It has a dry, bureaucratic name, but Ready to Use Therapeutic Food has functioned for over a decade as a lifeline for countless starving children around the globe.  Manufactured in the United States and distributed … ",
    "url": "https://newrepublic.com/article/192193/musk-usaid-purge-horrific-turn-maga-lie"
  },
  {
    "text": "Francis Collins Retires From N.I.H., Saying Colleagues ‘Deserve the Utmost Respect’  —  Dr. Collins, a renowned geneticist, ran the National Institutes of Health for 12 years.  His parting statement offered a pointed, if veiled, message to the Trump administration.",
    "url": "https://www.nytimes.com/2025/03/01/us/politics/francis-collins-nih-retires.html"
  },
  {
    "text": "Ex-Chicago mayor rips current city leaders for focus on bathroom and locker room instead of crime, education  —  'I don't want to hear another word about the bathroom.  You better start focusing on the classroom,' Rahm Emanuel told Bill Maher on Friday  —  Former Democratic Chicago Mayor … ",
    "url": "https://www.foxnews.com/media/ex-chicago-mayor-rips-current-city-leaders-focus-bathroom-locker-room-instead-crime-education"
  },
  {
    "text": "We tried to quantify the impact of abrupt PEPFAR cuts.  The results startled even us  —  These policy decisions put lives at risk  —  In May 2023, about a year before the President's Emergency Plan for AIDS Relief was up for congressional renewal, a  —  alleged that PEPFAR funding … ",
    "url": "https://www.statnews.com/2025/03/01/pepfar-usaid-funding-cuts-trump-hiv-aids/"
  },
  {
    "text": "Trump says he'll posthumously pardon baseball legend Pete Rose  —  President Trump said that he will posthumously pardon baseball legend Pete Rose and hammered Major League Baseball (MLB) for preventing the all-time hits leader from being inducted into the Baseball Hall of Fame over betting on games.",
    "url": "https://thehill.com/blogs/in-the-know/5171117-trump-says-hell-posthumously-pardon-baseball-legend-pete-rose/"
  },
  {
    "text": "DOGE presses to check federal benefits payments against IRS tax records  —  Officials with Elon Musk's group say they want to search for fraud.  Privacy law bars the IRS from disclosing tax information to other parts of the government.  —  Just now  —  Officials from Elon Musk's U.S. DOGE Service … ",
    "url": "https://www.washingtonpost.com/business/2025/03/01/doge-irs-tax-records-benefits/"
  },
  {
    "text": "US auto industry could be collateral damage in Trump's trade wars  —  President Donald Trump's trade wars threaten to claim a casualty on the home front: the American auto industry.  If the president goes ahead with 25% taxes on imports from Canada and Mexico on Tuesday … ",
    "url": "https://apnews.com/article/tariffs-cars-automakers-trump-canada-mexico-7d34c3ba8b96864ea77c6b16780cf349"
  },
  {
    "text": "Trump takes seized boxes back to Florida on Air Force One  —  President Donald Trump on Friday transported back to Florida with him boxes of documents that the FBI had seized from Mar-a-Lago after executing a court-ordered search warrant in August 2022.  —  “The Department of Justice … ",
    "url": "https://www.cnn.com/2025/02/28/politics/trump-seized-boxes-returned-air-force-one/"
  }
]