[
  {
    "text": "First on CNN: Federal prosecutors file new criminal case against Hunter Biden  —  Federal prosecutors have filed a new criminal case against Hunter Biden, people briefed on the matter said.  —  The exact nature of the charges couldn't immediately be learned because court documents have not been made public.",
    "url": "https://www.cnn.com/2023/12/07/politics/hunter-biden-criminal-case/"
  },
  {
    "text": "Hunter Biden faces new indictment in California  —  President Biden's son Hunter Biden was indicted in California Thursday on a litany of tax charges, according to documents made public.  —  The indictment Hunter Biden's failure to pay nearly $200,000 of income tax in the year 2019.",
    "url": "https://www.foxnews.com/politics/hunter-biden-faces-new-indictment-california"
  },
  {
    "text": "Hunter Biden Says Republicans Are Trying To ‘Kill’ Him To Destroy His Father's Presidency  —  Joe Biden's son sat down for a rare podcast interview with Moby.  —  LOADING  —  WASHINGTON ― Hunter Biden said in a podcast interview published Friday that Republicans and the right-wing media … ",
    "url": "https://www.huffpost.com/entry/hunter-biden-moby-interview_n_65723b4ee4b001ec86a76319"
  },
  {
    "text": "GOP's Brutal Math: Trump Could Secure Nomination Before Conviction  —  Looking at the primary schedule, Republicans see the party handcuffing itself to a candidate on the verge of politically toxic criminal convictions. … ‘People need to wake up’  —  There's a scenario many Republicans are dreading … ",
    "url": "https://www.thedailybeast.com/gops-brutal-math-donald-trump-could-secure-2024-nomination-before-criminal-conviction"
  },
  {
    "text": "Where Are All the Anti-Trump Republicans?  —  A vast array of GOP power brokers detest and disdain the former president.  So why are they keeping so quiet?  —  Here's a portrait of how Donald Trump reclaims power.  —  At a Hoover Institution conference here last week … ",
    "url": "https://www.politico.com/news/magazine/2023/12/08/the-stop-trump-effort-has-been-abysmal-00130751"
  },
  {
    "text": "UPenn board chair expected to speak with president Liz Magill about stepping down  —  New York CNN  —  The University of Pennsylvania's board of trustees held an emergency meeting Thursday as school president Liz Magill faces scathing criticism over her performance at a House hearing earlier this week.",
    "url": "https://www.cnn.com/2023/12/07/business/penn-emergency-meeting-liz-magill/"
  },
  {
    "text": "Wharton board calls on Penn president Liz Magill to resign  —  University of Pennsylvania President Liz Magill is being asked to resign by the board of Penn's Wharton business school, according to a letter obtained by Axios. … - Earlier today, Axios reported that a wealthy donor pulled … ",
    "url": "https://www.axios.com/2023/12/08/penn-antisemitism-wharton-magill-resign"
  },
  {
    "text": "Penn loses $100 million donation over antisemitism hearing  —  A wealthy donor to the University of Pennsylvania is withdrawing a gift worth around $100 million in protest of the school's response to antisemitism on campus.  —  The big picture: The final straw for Ross Stevens … ",
    "url": "https://www.axios.com/2023/12/07/upenn-antisemitism-magill-100-million-donation"
  },
  {
    "text": "Woman tried to burn down Martin Luther King Jr.'s birth home, police say  —  A woman was arrested Thursday afternoon after attempting to burn down Martin Luther King Jr.'s childhood home in Atlanta, police said.  —  The Atlanta Police Department said the woman poured gasoline … ",
    "url": "https://thehill.com/regulation/court-battles/4349371-woman-tried-to-burn-down-martin-luther-king-jr-s-birth-home-police-say/"
  },
  {
    "text": "North Dakota senator's son charged with manslaughter after officer killed in police chase  —  Sen. Kevin Cramer's son, Ian Cramer, was charged in connection with a police chase on Wednesday that led to the death of a sheriff's deputy in Mercer County, North Dakota.",
    "url": "https://www.nbcnews.com/politics/politics-news/north-dakota-senators-son-charged-manslaughter-police-chase-killed-off-rcna128653"
  },
  {
    "text": "Exclusive: Pro-Trump lawyer Kenneth Chesebro cooperating in multiple state probes into 2020 fake electors plot  —  The pro-Trump lawyer who helped devise the 2020 fake electors plot and already pleaded guilty to the conspiracy in Georgia is now cooperating with Michigan and Wisconsin state investigators … ",
    "url": "https://www.cnn.com/2023/12/08/politics/kenneth-chesebro-cooperating-multiple-investigations"
  },
  {
    "text": "GOP lawmaker: Ousted aides targeted my daughter for OnlyFans account  —  Rep. Brandon Williams, who represents a battleground seat, says his altercation stemmed from a threat to expose his daughter's OnlyFans account.  —  A Republican member of Congress is alleging that a former top aide spearheaded a … ",
    "url": "https://www.politico.com/news/2023/12/08/brandon-williams-interview-video-former-aides-00130713"
  },
  {
    "text": "Alan Hostetter, ex-police chief who brought hatchet to Capitol on Jan. 6, sentenced to 11 years in prison  —  A former California police chief who brought a hatchet to the Capitol on Jan. 6, 2021, has been sentenced to more than 11 years in prison for his role in the siege.",
    "url": "https://www.cbsnews.com/news/alan-hostetter-sentenced-january-6-capitol-attack-11-years/"
  },
  {
    "text": "Police have recovered video of Florida GOP chair and alleged victim in rape investigation  —  Disclaimer: This story contains explicit sexual content and details involving an alleged sexual assault.  —  Sarasota police have recovered a cell phone video taken by Florida GOP chairman Christian Ziegler … ",
    "url": "https://flcga.org/police-have-recovered-video-of-florida-gop-chair-and-alleged-victim-in-rape-investigation/"
  },
  {
    "text": "Hochul condemns man who fired shotgun outside temple on first day of Hanukkah  —  Gov. Kathy Hochul (D-NY) denounced a man who fired a shotgun outside a Jewish temple on the first day of Hanukkah.  —  A 28-year-old man was accused on Thursday of firing a shotgun outside of Temple Israel in Albany … ",
    "url": "https://www.washingtonexaminer.com/news/hochul-condemns-man-shotgun-outside-temple-hanukkah"
  },
  {
    "text": "Texas progressive group previously bailed out suspect charged in deadly Austin, San Antonio shooting rampage  —  Shane James, 34, previously served as a U.S. Army infantry officer before he was discharged in August 2015, the Army said  —  A suspect accused of six murders across Texas during … ",
    "url": "https://www.foxnews.com/politics/texas-progressive-group-previously-bailed-suspect-charged-deadly-austin-san-antonio-shooting-rampage?intcmp=tw_fnc"
  },
  {
    "text": "U.S. political ad market projected to reach record $16 billion in 2024 … New projections from GroupM, one of the world's largest paid advertising agencies, suggest that political ad revenue will reach $15.9 billion in 2024, or $17.1 billion including direct mail.",
    "url": "https://www.axios.com/2023/12/08/us-political-ad-market-2024-spending"
  },
  {
    "text": "Lauren Boebert used campaign funds to buy tickets to cheer boyfriend Quinn Gallagher on to 774th place in grueling Colorado bike race - weeks before the couple were kicked out of Beetlejuice performance  — Records obtained by DailyMail.com show Lauren Boebert used campaign funds to watch … ",
    "url": "https://www.dailymail.co.uk/news/article-12806843/Lauren-Boebert-campaign-funds-tickets-Colorado-race.html"
  },
  {
    "text": "N.Y. appeals court upholds Judge Engoron's ruling that Trump committed ‘widespread fraud’  —  Former President Donald Trump was dealt a major blow by the New York Court of Appeals on Thursday in the midst of his ongoing civil fraud trial in the Empire State.",
    "url": "https://www.rawstory.com/trump-organization-fraud-2666475449/"
  }
]