[
  {
    "text": "President Biden Upends the GOP Narrative  —  It's difficult to tell who was more surprised by President Biden's State of the Union performance Thursday night: Democrats in the chamber, whose emotions ranged from relieved to almost giddy.  Or Republicans, who have been selling the president as doddering … ",
    "url": "https://steady.substack.com/p/president-biden-upends-the-gop-narrative"
  },
  {
    "text": "Biden said Republicans oppose women's rights — Katie Britt's “tradwife” response proved him right  —  The “pro-life” lie gives way to GOP leaders denouncing women's suffrage and attacking birth control  —  Politicians love to talk about their families, but in her Thursday night response … ",
    "url": "https://www.salon.com/2024/03/09/biden-said-oppose-womens-rights--katie-britts-tradwife-response-proved-him-right/"
  },
  {
    "text": "Why It's Hard to Explain Joe Biden's Unpopularity  —  Joe Biden is one of the most unpopular presidents in modern American history.  In Gallup polling, his approval ratings are lower than those of any president embarking on a re-election campaign, from Dwight Eisenhower to Donald Trump.",
    "url": "https://www.nytimes.com/2024/03/09/opinion/joe-biden-approval-unpopular.html"
  },
  {
    "text": "Gingrich: Biden's most inspirational State of the Union moment was ‘when he left’  —  Former House Speaker Newt Gingrich (R-Ga.) said President Biden's most inspirational moment of his State of the Union address was “when he left” Friday.  “I think at the end when he left,” … ",
    "url": "https://thehill.com/homenews/media/4521016-gingrich-bidens-most-inspirational-state-of-the-union-moment-was-when-he-left/"
  },
  {
    "text": "New Biden Ad Pokes Fun at His Age: 'I'm Not a Young Guy.  That's No Secret.'  —  The ad, which will target a youthful demographic, represents a shift in tone, trying to turn one of the president's greatest perceived liabilities into an asset.  —  In a new advertisement for his re-election campaign … ",
    "url": "https://www.nytimes.com/2024/03/09/us/politics/biden-ad-age.html"
  },
  {
    "text": "Biden Shrugs Off ‘Illegal’ Remark That Drew Democrats' Ire  — Unscripted exchange with Marjorie Taylor Greene led to remark  — ‘Let me be clear: No human being is illegal,’ Omar responds  —  President Joe Biden brushed off criticism after referring to the alleged killer of a Georgia woman as an … ",
    "url": "https://www.bloomberg.com/news/articles/2024-03-08/biden-shrugs-off-illegal-remark-that-drew-democrats-ire"
  },
  {
    "text": "Immigrants are less likely to commit crimes than U.S.-born Americans, studies find  —  The murder of Laken Riley took center stage during Thursday night's State of The Union.  Riley was a 22-year-old student who was killed last month at the University of Georgia.",
    "url": "https://npr.org/2024/03/08/1237103158/immigrants-are-less-likely-to-commit-crimes-than-us-born-americans-studies-find"
  },
  {
    "text": "Is Katie Britt for real?  —  This is an opinion column.  —  Don't adjust your television.  What we saw wasn't an AI deepfake.  That was Katie Britt.  That speech happened.  —  But don't call it real.  —  The junior Senator from Alabama gave up being genuine a while back … ",
    "url": "https://www.al.com/news/2024/03/whitmire-is-katie-britt-for-real.html"
  },
  {
    "text": "Exclusive: US prepared ‘rigorously’ for potential Russian nuclear strike in Ukraine in late 2022, officials say  —  In late 2022, the US began “preparing rigorously” for Russia potentially striking Ukraine with a nuclear weapon, in what would have been the first nuclear attack in war since … ",
    "url": "https://www.cnn.com/2024/03/09/politics/us-prepared-rigorously-potential-russian-nuclear-strike-ukraine/"
  },
  {
    "text": "Trump Getting DESTROYED on Truth Social Over His Vaccine Post  —  His cultists are irate.  —  Donald Trump posted a response last night on Truth Social to Joe Biden's remarks about the pandemic, and he is getting absolutely destroyed in the replies by his own MAGA supporters.  —  MAGA is almost 100% anti-vax.",
    "url": "https://www.meidastouch.com/news/trump-getting-destroyed-on-truth-social-over-his-vaccine-post"
  },
  {
    "text": "Trump hosts hard-line Hungarian leader Viktor Orbán at Mar-a-Lago  —  It is highly unusual for a visiting head of state to travel to the U.S. and meet with a political opponent of the president without also meeting top officials at the White House.  —  Former President Donald Trump … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-hosts-hard-line-hungarian-leader-viktor-orban-mar-lago-rcna142581"
  },
  {
    "text": "Leaked Audio Shows No Labels Has Zero Idea If It'll Find a Candidate  —  The centrist group No Labels held a vote of delegates Friday and announced plans to move forward in seeking candidates for a third-party presidential run.  Multiple news organizations have treated this as a significant event … ",
    "url": "https://newrepublic.com/article/179706/leaked-audio-no-labels-zero-idea-candidate"
  },
  {
    "text": "National Guard helicopter crashes near border, killing three  —  (Nexstar) — A National Guard helicopter crashed near Rio Grande City on Friday afternoon, leaving three people dead, according to multiple reports.  —  The helicopter went down in La Grulla, a small town in east Starr County … ",
    "url": "https://www.kxan.com/news/texas/sources-national-guard-helicopter-crashes-near-border-killing-two/"
  },
  {
    "text": "Congressional probe finds communications gear in Chinese cranes, raising spying concerns  —  Some Chinese-made cranes used at US ports contain communications equipment with no clear purpose or record of their installation, according to a new congressional investigation that will heighten US concerns … ",
    "url": "https://www.cnn.com/2024/03/07/politics/congressional-probe-communications-gear-chinese-cranes/"
  },
  {
    "text": "RNC installs Trump's chosen leaders in merger with his campaign  —  Top advisers from Trump's campaign will steer a party committee facing a dramatic fundraising shortfall  —  HOUSTON — Former president Donald Trump, who is again likely to be the Republican nominee, commenced a fresh overhaul … ",
    "url": "https://www.washingtonpost.com/elections/2024/03/08/rnc-vote-lara-trump-whatley/"
  }
]