[
  {
    "text": "Former FBI official: Similarities between Biden and Hillary Clinton reports ‘nauseating’  —  Former FBI Deputy Director Andrew McCabe argued Friday that the special counsel's report on President Biden's retention of classified documents while vice president has “nauseating similarities” … ",
    "url": "https://thehill.com/homenews/administration/4460524-former-fbi-official-similarities-between-biden-clinton-reports-nauseating/"
  },
  {
    "text": "Can Biden emerge from his ‘cocoon’?  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  WORKING WEEKEND — The Senate remains in session today as it grinds through a series of procedural hoops toward passage of the $95 billion supplemental spending bill delivering aid to Ukraine, Israel and Taiwan.",
    "url": "https://www.politico.com/newsletters/playbook/2024/02/10/can-biden-emerge-from-his-cocoon-00140821"
  },
  {
    "text": "February 9, 2024  —  Yesterday, Special Counsel Robert Hur, appointed by Attorney General Merrick Garland in January 2023 to investigate President Joe Biden's handling of classified documents before he was president, released his report.  It begins: “We conclude that no criminal charges are warranted in this matter.",
    "url": "https://heathercoxrichardson.substack.com/p/february-9-2024"
  },
  {
    "text": "The Question Is Not If Biden Should Step Aside.  It's How.  —  Joe Biden should not be running for re-election.  That much was obvious well before the special prosecutor's comments on the president's memory lapses inspired a burst of age-related angst.  And Democrats who are furious … ",
    "url": "https://www.nytimes.com/2024/02/10/opinion/joe-biden-convention-2024.html"
  },
  {
    "text": "‘Cheap shot’: Biden allies go on the attack against the special counsel and the media  —  The White House depicted the report as partisan and the media coverage as unfair.  —  WASHINGTON — The Biden campaign and the White House have landed on an initial strategy for responding … ",
    "url": "https://www.nbcnews.com/politics/joe-biden/cheap-shot-biden-allies-go-attack-special-counsel-media-rcna138123?taid=65c757381ba9b100015eceee"
  },
  {
    "text": "Verbal gaffe or sign of trouble?  Mixing up names like Biden and Trump have done is pretty common  —  Report intensifies concerns over President Biden's age  —  White House fights back over special counsel's comments on Biden's age, memory  —  Any parent who's ever called one of their children … ",
    "url": "https://apnews.com/article/biden-trump-age-concerns-analysis-verbal-gaffes-66c361880c9365b4d75ee82a8acced1b"
  },
  {
    "text": "Trump argues he should ‘not be charged’ in classified docs case if Biden isn't  —  Former President Trump argued Friday night that he should “not be charged” in his federal classified documents case since a special counsel announced this week that President Biden would not face charges for Biden's handling of classified materials.",
    "url": "https://thehill.com/homenews/campaign/4460164-trump-argues-should-not-be-charged-classified-docs-case-biden-is-not/"
  },
  {
    "text": "White House frustration with Garland grows  —  The president believes the special counsel investigating his handling of classified documents went beyond his remit.  And part of the blame is being placed on the AG.  —  Joe Biden has told aides and outside advisers that Attorney General Merrick Garland … ",
    "url": "https://www.politico.com/news/2024/02/09/white-house-frustration-with-garland-grows-00140813"
  },
  {
    "text": "Haley to troll Trump in South Carolina with mobile billboard highlighting his age  —  The mobile billboard will appear outside a Trump rally on Saturday.  —  Nikki Haley is stepping up her attacks on Donald Trump's age — this time at his own rally in South Carolina.",
    "url": "https://www.politico.com/news/2024/02/10/nikki-haley-billboard-donald-trump-age-00140815"
  },
  {
    "text": "History confirms Republicans rejected a once-in-a-lifetime immigration opportunity  —  Immigration politics may be the most important to winning and losing elections in America.  Add the substance around immigration reform and border security and it is one of the most complicated policy issues facing America as well.",
    "url": "https://thehill.com/opinion/immigration/4458612-history-confirms-republicans-rejected-a-once-in-a-lifetime-immigration-opportunity/"
  },
  {
    "text": "Republicans see Latino voters in Nevada as key to retaking the White House in 2024  —  LAS VEGAS - Shuffling through jeans on a clothing rack in her small store at a Latino market, Christy Rosales says she hopes Trump returns to office.  —  The 40-year-old native of Colombia complains … ",
    "url": "https://www.npr.org/2024/02/10/1230546093/republicans-see-latino-voters-in-nevada-as-key-to-retaking-the-white-house-in-20"
  },
  {
    "text": "New Jan. 6 footage appears to show rioter firing a gun in the air during Capitol attack  —  John Emanuel Banuelos was previously identified by NBC News as a Jan. 6 rioter who told police he had a weapon that day.  New footage appears to show him firing it.  —  WASHINGTON — Newly unearthed footage … ",
    "url": "https://www.nbcnews.com/politics/justice-department/new-jan-6-footage-appears-show-rioter-firing-gun-air-capitol-attack-rcna138137"
  },
  {
    "text": "What the Long Island special election tells us about the battle over the suburbs  —  The race between former Rep. Tom Suozzi and Mazi Melesa Pilip could provide clues for both parties on immigration and crime as they gear up for 2024.  —  The nation's suburbs are moving toward Democrats.",
    "url": "https://www.politico.com/news/2024/02/10/new-york-special-election-suburbs-00140796"
  },
  {
    "text": "Helicopter crashes in California with 6 people on board  —  The Eurocopter EC 130 helicopter crashed Friday around 10 p.m. local time.  —  A helicopter crashed Friday night near Nipton, California, with six people on board, the Federal Aviation Administration said.",
    "url": "https://www.nbcnews.com/news/us-news/helicopter-crashes-california-6-people-onboard-rcna138224"
  }
]