[
  {
    "text": "Houthis Say They're Improving Military Might in Defiance of US  —  Yemen's Houthis vowed they would keep attacking ships in the Red Sea, even after the US launched a fourth round of missiles strikes against them.  —  “It is an honor for our people to be in such a confrontation with these evil forces … ",
    "url": "https://www.bloomberg.com/news/articles/2024-01-18/houthis-say-they-re-improving-military-might-in-defiance-of-us"
  },
  {
    "text": "The GOP Is Already Clashing Over Trump's VP Pick  —  While Trump tries to sew up the nomination, his camp is already feuding about his future running mate — and hoping it isn't Nikki Haley.  —  As the vice-presidential field continues to develop, many consider what a Nikki Haley vice presidency could mean for the GOP.",
    "url": "https://www.politico.com/news/magazine/2024/01/18/maga-nightmare-trump-loyalists-move-to-head-off-haley-vp-pick-00136282"
  },
  {
    "text": "Why Joe Biden Thinks He Can Flip North Carolina Blue in 2024  —  North Carolina's growing ranks of college-educated and Black voters are seen as key to snatching the state from Trump  —  JWPlayer  —  Joe Biden's trip to North Carolina on Thursday is an official White House visit … ",
    "url": "https://themessenger.com/politics/why-joe-biden-thinks-he-can-flip-north-carolina-blue-in-2024"
  },
  {
    "text": "Florida bill could lead to ban on pride flags in schools, government buildings  —  Florida lawmakers are mulling legislation that would ban gay pride flags and flags representing other political movements from flying on public properties, including schools and college campuses.",
    "url": "https://thehill.com/homenews/state-watch/4415582-florida-bill-ban-pride-flags-schools-government-buildings/"
  },
  {
    "text": "“Here's why that's bad news for Biden”: A chat with NYT Pitchbot  —  The legend himself speaks to Public Notice.  —  ∙ Paid … If you're active on twitter — or were before Elon Musk started making everyone more progressive than Steve Bannon think about deleting their account … ",
    "url": "https://www.publicnotice.co/p/doug-balloon-new-york-times-pitchbot-interview"
  },
  {
    "text": "Texas refuses to comply with Biden administration's cease-and-desist letter on border access  —  The Department of Homeland Security had directed the state to stop blocking the U.S. Border Patrol's access to roughly 2½ miles of the U.S.-Mexico border.",
    "url": "https://www.nbcnews.com/politics/immigration/texas-refuses-comply-biden-administrations-cease-desist-letter-border-rcna134423"
  },
  {
    "text": "Donald Trump Has Chosen to Pay Millions to Trash Rule of Law  —  I have a standing complaint that reporters serially fall into Donald Trump's trap of reporting on his courtroom tantrums rather than the evidence of his fraud and crime presented therein.  But I'm going to do just that … ",
    "url": "https://www.emptywheel.net/2024/01/18/donald-trump-has-chosen-to-pay-millions-to-trash-rule-of-law/"
  },
  {
    "text": "Loose bolts open door to racism  —  On January 5th, a Boeing 737 Max 9 aircraft operated by Alaska Airlines was forced to make an emergency landing after a door panel flew off mid-air.  No deaths were reported, but multiple passengers required medical attention, officials said.",
    "url": "https://popular.info/p/loose-bolts-open-door-to-racism"
  },
  {
    "text": "Conservative justices, lawyers ready a path for ending agency deference  —  In nearly four hours of arguments on Wednesday, the justices of the U.S. Supreme Court debated who should be deciding how are laws in our country are implemented.  By the end of the arguments, the six-justice … ",
    "url": "https://www.lawdork.com/p/scotus-chevron-deference-arguments"
  },
  {
    "text": "Trump warns campaigns: Do not hire ex-DeSantis operative Jeff Roe  —  The admonition is another example of the former president's penchant for punishing people perceived as disloyal.  —  Former President Donald Trump and people in his inner circle have told down-ballot Republican candidates … ",
    "url": "https://www.politico.com/news/2024/01/18/trump-jeff-roe-republican-strategist-00136240"
  },
  {
    "text": "This GOP Rep.'s Anti-Abortion Stances Keep Vanishing From Her Website  —  Rep. Monica De La Cruz (R-TX) initially ran for Congress with an unabashed anti-abortion stance.  Ever since then, abortion has quietly been disappearing from her campaign website.",
    "url": "https://www.thedailybeast.com/rep-monica-de-la-cruzs-anti-abortion-stances-keep-vanishing-from-her-website"
  },
  {
    "text": "Justice Department report finds ‘critical failures’ in response to Uvalde attack  —  Listen To Our Podcast  —  Every weekday, NPR's best political reporters are there to explain the big news coming out of Washington and the campaign trail.  They don't just tell you what happened.",
    "url": "https://www.npr.org/2024/01/18/1225340219/uvalde-report"
  },
  {
    "text": "United States of Ozempic: Where anti-obesity drugs are taking off  —  For every 1,000 people in Kentucky, roughly 21 were prescribed a drug that belongs to a buzzy class of diabetes and anti-obesity medications last year — the highest rate of any state, according to insurance claims data provided … ",
    "url": "https://www.axios.com/2024/01/18/ozempic-wegovy-weight-loss-drugs-states-map"
  },
  {
    "text": "Missouri Could Become the Latest State to Put Abortion on the Ballot in 2024  —  Abortion rights activists have scored a series of wins since the Supreme Court overturned Roe v. Wade, and voters in more states could weigh in on the issue this year  —  Missouri could become the latest state … ",
    "url": "https://themessenger.com/politics/missouri-could-become-the-latest-state-to-put-abortion-on-the-ballot-in-2024"
  },
  {
    "text": "John Fetterman Endorses Andy Kim in High-Stakes New Jersey Senate Primary  —  The Pennsylvania senator, the first among his colleagues to weigh in on the primary battle to oust the indicted Senator Robert Menendez, said he had concerns about Tammy Murphy's G.O.P. history.",
    "url": "https://www.nytimes.com/2024/01/18/us/politics/john-fetterman-andy-kim-new-jersey-senate.html"
  },
  {
    "text": "Florida Governor Ron DeSantis On The Border Wall v. The Supplemental As Proposed; His Path To Super Tuesday  —  Florida Governor Ron DeSantis joined me this AM:  —  Audio:  —  01-18hhs-desantis  —  Transcript:  —  HH: Governor Ron DeSantis of Florida joins me.  Good morning, Governor.",
    "url": "https://hughhewitt.com/florida-governor-ron-desantis-on-the-border-wall-v-the-supplemental-as-proposed-his-path-to-super-tuesday"
  },
  {
    "text": "White House: GOP's Mayorkas impeachment push is unconstitutional  —  The White House argued on Thursday that the House GOP's push to impeach Homeland Security Secretary Alejandro Mayorkas is unconstitutional, urging them to drop it and work with President Biden on immigration reform.",
    "url": "https://thehill.com/homenews/administration/4415438-white-house-republicans-mayorkas-impeachment-push-is-unconstitutional/"
  },
  {
    "text": "State Board of Education Passes Rule to Permanently Prohibit DEI in the Florida College System  —  ~ State Board also replaced “Principles of Sociology” with an American History course as an option on the list of social studies general education core courses ~",
    "url": "https://www.fldoe.org/newsroom/latest-news/state-board-of-education-passes-rule-to-permanently-prohibit-dei-in-the-florida-college-system.stml"
  }
]