[
  {
    "text": "Trump Fires Official Over Jobs Report, Echoing an Authoritarian Playbook  —  In firing the head of the agency that collects employment statistics, the president underscored his tendency to suppress facts he doesn't like and promote his own version of reality.",
    "url": "https://www.nytimes.com/2025/08/03/us/politics/trump-bls-jobs-facts.html?unlocked_article_code=1.bU8.ulCL.4xAvX3InbWBC&smid=url-share"
  },
  {
    "text": "U.S. jobs data “very unreliable,” top Trump econ adviser says  —  The labor statistics chief that President Trump fired Friday is a “terrific person, but the jobs data her agency produced has become “very unreliable,” National Economic Council director Kevin Hassett said Sunday.",
    "url": "https://www.axios.com/2025/08/03/trump-jobs-labor-statistics-fired"
  },
  {
    "text": "“Nuclear option” lingers over Senate as members leave for August recess  —  Senate leaders failed to reach a bipartisan deal to speed through more of President Trump's nominees — so senators are heading home with a GOP promise of changing the rules when they return in September.",
    "url": "https://www.axios.com/2025/08/03/senate-confirmations-nominations-rules-trump"
  },
  {
    "text": "Senate confirms Jeanine Pirro as U.S. Attorney for the District of Columbia  —  Washington - The Senate on Saturday approved the nomination of Jeanine Pirro, an ardent loyalist of President Trump and a FOX News fixture, confirming the cable news personality to a top prosecutor post in Washington, D.C.",
    "url": "https://www.cbsnews.com/news/senate-confirms-jeanine-pirro-dc-us-attorney/"
  },
  {
    "text": "DOJ is walking back the White House's goal to arrest 3,000 immigrants per day … It's not the only case that has featured the 3,000-arrest-per-day target as a crucial piece of evidence that the administration's single-minded drive to rack up arrests may have prompted immigration authorities to cut corners or break the law.",
    "url": "https://www.politico.com/news/2025/08/03/white-house-doj-immigration-quota-mismatch-00490406"
  },
  {
    "text": "Trump's Tariffs Are Making Money.  That May Make Them Hard to Quit. … Shipping containers at the Port of Baltimore.  Even before the latest tariffs set in, revenue from taxes collected on imported goods grew drastically this year.Alyssa Schukar for The New York Times",
    "url": "https://www.nytimes.com/2025/08/03/business/trump-tariffs-how-much-money-debt.html"
  },
  {
    "text": "Trump And Miller Compel Colleges Not To Enroll International Students  —  Stuart Anderson writes about immigration, business and globalization.  —  SaveComment  —  The Trump administration is using rules, policies and formal agreements to compel and discourage U.S. universities from enrolling international students.",
    "url": "https://www.forbes.com/sites/stuartanderson/2025/08/03/trump-and-miller-compel-colleges-not-to-enroll-international-students/"
  },
  {
    "text": "Smithsonian will again include Trump in impeachment exhibit in ‘coming weeks’  —  The museum's decision to remove a placard referencing President Donald Trump from an impeachments exhibit sparked concerns over Trump's influence on the cultural institution.  —  The Smithsonian's National Museum … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/smithsonian-will-include-trump-impeachment-exhibit-coming-weeks-rcna222690"
  },
  {
    "text": "White House has no plan to mandate IVF care, despite campaign pledge  —  President Donald Trump has said he wants a “baby boom,” but critics say his administration has yet to make significant family policy changes — and that Medicaid cuts will hurt.  —  Just now",
    "url": "https://www.washingtonpost.com/business/2025/08/03/trump-administration-ivf-care/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzU0MTkzNjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzU1NTc1OTk5LCJpYXQiOjE3NTQxOTM2MDAsImp0aSI6ImYzOTU5ODNjLWM1ZTEtNDNhYS1iYTUxLTY2ODcxYzE5YzNkNyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9idXNpbmVzcy8yMDI1LzA4LzAzL3RydW1wLWFkbWluaXN0cmF0aW9uLWl2Zi1jYXJlLyJ9.YSK9HByFcgPcpwi455pAFHYsR16Mkpk0DjGtyL5AQTU&itid=gfta"
  },
  {
    "text": "Laura Loomer Attack on West Point Appointee Reflects Larger Fight Over Trump  —  Jen Easterly, who had served in Republican and Democratic administrations, was headed to the academy.  Then a right-wing activist stepped in.  —  Hours after West Point pulled its offer to have her teach cadets … ",
    "url": "https://www.nytimes.com/2025/08/03/us/politics/west-point-easterly-trump-loomer.html"
  },
  {
    "text": "‘They roll right over’: Many Democrats call their party weak and ineffective, AP-NORC poll finds  —  Many Democrats see their political party as “weak” or “ineffective,” according to a poll that finds considerable pessimism within Democratic ranks.  Republicans are more complimentary of their party … ",
    "url": "https://apnews.com/article/ap-poll-democrats-republican-political-parties-d41141f4a0af53c223620af0fc3fc319"
  },
  {
    "text": "After 47 years on the political beat for The Post, it's transition time  —  Dan Balz writes on his retirement from full-time work at The Washington Post after 47 years.  —  Just now  —  About two months ago, my wife was out for a walk and stopped to talk with a man working in his yard.",
    "url": "https://www.washingtonpost.com/politics/2025/08/03/washington-post-dan-balz-political-column-final-sunday-take/"
  },
  {
    "text": "Dream turns to nightmare for midwest town in grip of US migrant crackdown  —  An imam's detention, firings and police violence have sown fear among immigrants who helped revive an Ohio town  —  For 50 long years, life in Hamilton, a town of 63,000 people a half-hour north of Cincinnati, was in decline.",
    "url": "https://www.theguardian.com/us-news/2025/aug/02/immigration-crackdown-hamilton-ohio"
  },
  {
    "text": "Prince Andrew and Donald Trump's Sick ‘P***y’ Conversations Revealed  —  GROSS  —  An explosive new book heaps more shame on the disgraced prince.  —  Donald Trump allegedly handed Prince Andrew a list of masseuses after the two men engaged in a sick conversation about “p—y.”",
    "url": "https://www.thedailybeast.com/prince-andrew-and-donald-trumps-sick-py-conversations-revealed/"
  },
  {
    "text": "Curtis Sliwa Wants to Be Mayor.  He's Taking Off His Beret to Prove It.  —  The Guardian Angels founder and Republican nominee for mayor has long been a New York curiosity.  Can he become a serious contender?  —  Curtis Sliwa, the Guardian Angels founder, flamboyant radio host … ",
    "url": "https://www.nytimes.com/2025/08/03/nyregion/sliwa-beret-mayor-republican.html"
  },
  {
    "text": "Democratic governors throw support behind Newsom, back partisan redistricting  —  “There's a bigger risk in doing nothing,” DGA Chair Laura Kelly said.  —  California Gov. Gavin Newsom, accompanied by several members of the Texas state Legislature, calls for a new way for California … ",
    "url": "https://abcnews.go.com/Politics/democratic-governors-throw-support-newsom-back-partisan-redistricting/story?id=124295711"
  }
]