[
  {
    "text": "Trump tells rally-goers not to die in searing Vegas heat: 'I don't care about you, I just want your vote'  —  Remark get laughs at rally - but also draws raised eyebrows on social media as critics argue Trump was being truthful  —  Donald Trump is no stranger to accusations that he has little regard … ",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/trump-voters-heat-las-vegas-b2559547.html"
  },
  {
    "text": "Playbook: Kamala Harris sizes up her competition  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  EURO EARTHQUAKE — Voters in the European Parliament elections veered sharply to the right in results announced yesterday, with many of the continent's ruling centrist parties making major retreats.",
    "url": "https://www.politico.com/newsletters/playbook/2024/06/10/kamala-harris-sizes-up-her-competition-00162458"
  },
  {
    "text": "A crucial demographic for Biden: White voters without college degrees  —  Good morning, Early Birds.  The Senate voted 60 years ago today to cut off debate of the Civil Rights Act of 1964, ending a filibuster that lasted more than two months.  “Stronger than all the armies is an idea whose time has come … ",
    "url": "https://www.washingtonpost.com/politics/2024/06/10/crucial-demographic-biden-white-voters-without-college-degrees/"
  },
  {
    "text": "Biden admin has discussed potentially negotiating unilateral deal with Hamas to free U.S. hostages  —  Such talks, if they begin, would not include Israel and would be conducted through Qatari interlocutors.  —  WASHINGTON — Biden administration officials have discussed potentially negotiating … ",
    "url": "https://www.nbcnews.com/news/investigations/biden-administration-discussed-potentially-negotiating-unilateral-deal-rcna156266"
  },
  {
    "text": "Scholz Heading for Another Election Rout in Eastern Germany  — Ruling parties were trounced in the former communist regions  — Three states where AfD is strongest force vote in September  —  Scholz's SPD Sees Worst-Ever Result in Germany's EU Vote  —  Chancellor Olaf Scholz's … ",
    "url": "https://www.bloomberg.com/news/articles/2024-06-10/scholz-heading-for-another-election-debacle-in-eastern-germany"
  },
  {
    "text": "Donald Trump's Last (We Hope) Grift … Have you been to the Trump Ocean Resort Baja Mexico?  It's absolutely lovely; you must visit one of these days.  I did, a little while back.  Let me tell you all about it.  The resort is in Mexico, just over the border with the United States and southwest of … ",
    "url": "https://newrepublic.com/article/182345/donald-trump-last-grift"
  },
  {
    "text": "Trump Demands Biden Remove Ad of Him Calling Dead Soldiers ‘Suckers’ and ‘Losers’  —  WAGING WAR  —  The former president said only a “psycho” or a “very stupid person” would've made such statements.  —  Donald Trump on Sunday called for President Joe Biden to take down an attack ad featuring … ",
    "url": "https://www.thedailybeast.com/trump-demands-biden-remove-ad-of-him-calling-dead-soldiers-suckers-and-losers"
  },
  {
    "text": "Hunter Biden's Lawyers Are Expected to Rest Their Case in Gun Trial  —  The defense team seems more likely to avoid taking the risky step of putting Mr. Biden on the stand, setting the stage for the jury to begin deliberations by day's end.  —  Hunter Biden's defense team is expected to wrap … ",
    "url": "https://www.nytimes.com/2024/06/10/us/politics/hunter-biden-gun-trial-defense.html"
  },
  {
    "text": "Never mind: Wall Street titans shake off qualms and embrace Trump  —  Many high-dollar donors had turned their backs on Trump after the stolen election lie and Jan. 6, but now have returned.  —  NEW YORK — Wall Street executives spent three years doing everything they could to distance themselves from former President Donald Trump.",
    "url": "https://www.politico.com/news/2024/06/10/billionaires-learned-to-stop-worrying-and-love-trump-00162219"
  },
  {
    "text": "Trump Endorses Sam Brown in Nevada's Key Senate Race  —  Mr. Brown, a former Army captain, is the leading candidate in a crowded field of Republicans vying to take on Senator Jacky Rosen, a vulnerable Democratic incumbent in a presidential battleground.  —  Former President Donald J. Trump … ",
    "url": "https://www.nytimes.com/2024/06/09/us/politics/trump-endorsement-sam-brown.html"
  },
  {
    "text": "Kamala Harris mourns death of Palestinians in raid that rescued 4 Israeli hostages  —  An unknown number of Palestinian innocents were killed in Israel's rescue op  —  Vice President Harris mourned the Palestinians who were killed in a successful Israeli hostage rescue operation this weekend during an address delivered Saturday.",
    "url": "https://www.foxnews.com/politics/kamala-harris-mourns-death-palestinians-raid-rescued-4-israeli-hostages"
  },
  {
    "text": "Trump probation interview set for Monday after hush money conviction  —  The former president was convicted last month on 34 felony counts of falsifying business records in the hush money case against him.  —  Former President Trump is scheduled to sit for a virtual interview on Monday … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-probation-interview-monday-hush-money-conviction-rcna156219"
  },
  {
    "text": "Chinese Premier Li Qiang to Visit New Zealand This Week  —  Chinese Premier Li Qiang will visit New Zealand later this week amid rising tensions between Beijing and its western trading partners.  —  The visit, announced by New Zealand Prime Minister Christopher Luxon Monday in Wellington … ",
    "url": "https://www.bloomberg.com/news/articles/2024-06-10/chinese-premier-li-qiang-to-visit-new-zealand-this-week"
  },
  {
    "text": "Putin to visit North Korea, Vietnam in coming weeks, Vedomosti newspaper says  —  Russian President Vladimir Putin will visit North Korea and Vietnam in the coming weeks, the Vedomosti newspaper reported on Monday, citing a diplomatic source.  —  Russian ambassador to North Korea Alexander … ",
    "url": "https://www.reuters.com/world/putin-visit-north-korea-vietnam-coming-weeks-vedomosti-newspaper-says-2024-06-10/"
  },
  {
    "text": "DNC invests $2M in 11 non-battleground state parties, targeting down-ballot races  —  The DNC says the investment is the first-of-its-kind.  —  The Democratic National Committee announced Monday it will give nearly $2 million to state parties in 11 non-battleground states in the months ahead … ",
    "url": "https://abcnews.go.com/Politics/dnc-invests-2m-11-battleground-state-parties-targeting/story?id=110930284"
  }
]