[
  {
    "text": "Would-be Trump assassin's sniper's nest revealed: Photos show AK-47 rifle, GoPro and backpack in hidden spot  —  Authorities have released the first photos from the assassination attempt on former President Donald Trump at his golf course earlier Sunday.  —  The photos show alleged gunman … ",
    "url": "https://nypost.com/2024/09/15/us-news/would-be-trump-assassins-snipers-nest-revealed-photos-show-ak-47-rifle-gopro-and-backpack-in-hidden-spot/"
  },
  {
    "text": "Trump was the subject of an apparent assassination attempt at his Florida golf club, the FBI says … The FBI said Donald Trump was the target of “what appears to be an attempted assassination” at his golf club in West Palm Beach, Florida, on Sunday, just nine weeks after the Republican … ",
    "url": "https://apnews.com/article/trump-shooting-gunshots-florida-f62f8378d3a8ce7b2e99d6a8fb40aba9"
  },
  {
    "text": "Harris expresses relief Trump safe after gunshots  —  Vice President Harris on Sunday expressed relief that former President Trump was safe following what the FBI said appeared to be a new assassination attempt on him in Florida.  —  “I have been briefed on reports of gunshots fired near … ",
    "url": "https://thehill.com/homenews/campaign/4881018-vice-president-harris-briefed-gunshots/"
  },
  {
    "text": "Trump rushed to safety as Secret Service opens fire on man with AK-47 near golf course  —  Donald Trump was rushed to safety by the Secret Service after agents spotted a man with an AK-47 near his golf course and agents opened fire, law enforcement sources said.",
    "url": "https://nypost.com/2024/09/15/us-news/shooting-reported-at-donald-trumps-golf-club-while-ex-president-was-on-grounds/"
  },
  {
    "text": "Martin County Sheriff: Suspect in shooting near Trump in Palm Beach was ‘relatively calm’ during arrest  —  Martin County Sheriff William D. Snyder said his department's deputies arrested a suspect in a shooting the FBI described as a likely attempted assassination against former President Donald Trump on Sunday in Palm Beach County.",
    "url": "https://www.local10.com/news/politics/2024/09/15/martin-county-sheriff-suspect-in-shooting-near-trump-in-palm-beach-was-relatively-calm-during-arrest/"
  },
  {
    "text": "Suspect ‘Ryan Routh’ in custody following second assassination attempt on Trump at Florida golf club  —  Donald Trump is safe following an incident involving gunshots at the Trump International Golf Club in West Palm Beach, Florida.  —  Covered by: Stepheny Price, Greg Wehner and Bradford Betz",
    "url": "https://www.foxnews.com/live-news/donald-trump-shots-fired-golf-club"
  },
  {
    "text": "Biden on Trump shooting incident: “There is no place for political violence” … - “I am relieved that the former President is unharmed. … - “As I have said many times, there is no place for political violence or for any violence ever in our country, and I have directed my team to continue … ",
    "url": "https://www.axios.com/2024/09/16/trump-assassination-attempt-biden-violence-no-place"
  },
  {
    "text": "Trump safe after being targeted in second apparent assassination attempt  —  West Palm Beach, Florida CNN  —  The FBI is investigating what it said is an apparent assassination attempt on Donald Trump at his Florida golf club Sunday, the second time in two months there's been an apparent attempt on the former president's life.",
    "url": "https://www.cnn.com/2024/09/15/politics/donald-trump-safe-shots/"
  },
  {
    "text": "Trump assassination attempt Sunday under investigation: What to know  —  James Powel Phillip M. BaileyUSA TODAY  —  Update: This story has been updated with information from a press conference  —  The Federal Bureau of Investigation said Sunday that it is investigating … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/09/15/trump-assassination-attempt-florida-golf-course-investigation-news/75239826007/"
  },
  {
    "text": "FBI Says It's Investigating a Possible ‘Attempted Assassination’ Aimed at Trump  —  Former President Donald Trump's campaign said he's safe “following gunshots in his vicinity.”  The FBI said it's investigating an apparent Trump assassination attempt.  — Copy",
    "url": "https://www.notus.org/trump-2024/fbi-investigating-possible-attempted-assassination-aimed-at-trump"
  },
  {
    "text": "JD Vance admits he is willing to ‘create stories’ to get media attention  —  Republican vice-presidential candidate defends spreading false, racist claims demonizing Haitian immigrants  —  In a stunning admission, Republican vice-presidential candidate JD Vance said he is willing … ",
    "url": "https://www.theguardian.com/us-news/2024/sep/15/jd-vance-lies-haitian-immigrants"
  },
  {
    "text": "John Roberts' Secret Trump Help Revealed in Huge SCOTUS Leak  —  BOMBSHELL  —  A memo obtained by The New York Times indicated the chief justice wanted to act quick—and decisively—on Donald Trump's presidential immunity.  —  The Supreme Court was hit by a flurry of damaging new leaks Sunday … ",
    "url": "https://www.thedailybeast.com/john-roberts-secret-trump-memo-revealed-in-huge-scotus-leak"
  },
  {
    "text": "Mike Lindell Group Accused of ‘Impersonating’ Election Cybersecurity Initiative  —  Lindell's Election Crime Bureau emailed election officials requesting their home addresses and info about how they monitor security threats … Lindell is a prolific supporter of election denial causes … ",
    "url": "https://www.rollingstone.com/politics/politics-features/mike-lindell-group-accused-impersonating-election-cybersecurity-1235102625/"
  },
  {
    "text": "Suspected Gunman Said He Was Willing to Fight and Die in Ukraine  —  Ryan Wesley Routh, 58, told The New York Times in 2023 that he had traveled to Ukraine and wanted to recruit Afghan soldiers to fight there.  —  Ryan Wesley Routh, the 58-year-old man who was arrested on Sunday in connection … ",
    "url": "https://www.nytimes.com/2024/09/15/us/politics/trump-shooting-suspect-routh.html"
  },
  {
    "text": "Ohio Gov. Mike DeWine says baseless claims about Haitian immigrants are ‘garbage’  —  DeWine, a Republican, stopped short of condemning the former president and his running mate, Sen. JD Vance, for amplifying the false rumors.  —  Ohio Gov. Mike DeWine on Sunday decried former President … ",
    "url": "https://www.nbcnews.com/politics/2024-election/ohio-gov-dewine-defends-haitian-migrants-springfield-trump-vance-rcna171198"
  }
]