[
  {
    "text": "Trump says he will rename the Gulf of Mexico.  Can he do that?  —  The president-elect told reporters Tuesday that he wanted the body of water called the Gulf of America, but he provided no details on how the change would be enacted.  —  Donald Trump on Tuesday said the United States … ",
    "url": "https://www.washingtonpost.com/politics/2025/01/07/trump-gulf-of-mexico-america/"
  },
  {
    "text": "Trump Blurs Lines in $20 Billion Data Center Announcement and Other Deals  —  Even before the start of the new administration, there has been repeated blurring of lines between the federal government efforts and Trump family businesses.  —  President-elect Donald J. Trump … ",
    "url": "https://www.nytimes.com/2025/01/07/us/politics/trump-hussain-sajwani-damac-crypto-deals.html"
  },
  {
    "text": "Zuckerberg Achieves Trump Lap Monkey Badge And Other Platform News  —  You've likely seen that Mark Zuckerberg, newly re-branded as Donald Trump's fluffy lap monkey, has announced that Facebook and Meta's other properties are getting out of the content moderation business.",
    "url": "https://talkingpointsmemo.com/edblog/zuckerberg-achieves-trump-lap-monkey-badge-and-other-platform-news/sharetoken/f5db6ef4-9cba-4d0d-a7a0-d168f20079e1"
  },
  {
    "text": "Mark Zuckerberg's MAGA makeover will reshape the entire internet  —  New York CNN  —  Meta CEO Mark Zuckerberg is making sweeping changes to the social internet, all in line with the desires of President-elect Donald Trump and his supporters.  —  Out with the fact-checkers that conservatives deride.",
    "url": "https://www.cnn.com/2025/01/07/media/mark-zuckerberg-meta-fact-checking-analysis/"
  },
  {
    "text": "Transcript: Mark Zuckerberg Announces Major Changes to Meta's Content Moderation Policies and Operations  —  In a video posted on Facebook and text posted to Threads, today Meta founder and CEO Mark Zuckerberg announced sweeping changes to the company's approach to content moderation.",
    "url": "https://www.techpolicy.press/transcript-mark-zuckerberg-announces-major-changes-to-metas-content-moderation-policies-and-operations/"
  },
  {
    "text": "Scoop: Heritage Foundation plans to ‘identify and target’ Wikipedia editors  —  The Heritage Foundation plans to “identify and target” volunteer editors on Wikipedia who it says are “abusing their position” by publishing content the group believes to be antisemitic, according to documents obtained by the Forward.",
    "url": "https://forward.com/news/686797/heritage-foundation-wikipedia-antisemitism/"
  },
  {
    "text": "What banning medical debt from your credit score actually means  —  In the final days of its tenure, the Biden administration has banned credit reporting agencies from including medical debts in their reports, aiming to make it easier for people to access credit, including loans and mortgages.",
    "url": "https://www.vox.com/policy/393810/medical-debt-biden-credit-report-cfpb"
  },
  {
    "text": "Biden Administration Moves to Ban Medical Debt From Credit Reports  —  The future of the new rule remains in question, however, with President-elect Donald J. Trump set to return to the White House this month.  —  The Consumer Financial Protection Bureau moved on Tuesday to ban medical debt … ",
    "url": "https://www.nytimes.com/2025/01/07/us/politics/biden-medical-debt-credit-report.html"
  },
  {
    "text": "Zuckerberg wears $900,000 watch to announce end of Meta fact checks  —  Mark Zuckerberg wore a rare Swiss watch worth about $900,000 in a video explaining his company's decision to end third-party fact checking on its social media platforms in the U.S.  —  Play Video",
    "url": "https://torontosun.com/business/money-news/zuckerberg-wears-900000-watch-to-announce-end-of-meta-fact-checks"
  },
  {
    "text": "Here are some of the horrible things that you can now say on Instagram and Facebook  —  Meta's policy changes allow calling gay and trans people ‘mentally ill’ while removing a ban on referring to women as ‘household objects.’ … As reported by Wired, a lot of text has been updated, added … ",
    "url": "https://www.theverge.com/2025/1/7/24338471/meta-hate-speech-hateful-conduct-policy-moderation"
  },
  {
    "text": "Facebook Deletes Internal Employee Criticism of New Board Member Dana White  —  Meta's HR team is deleting internal employee criticism of new board member, UFC president and CEO Dana White, at the same time that CEO Mark Zuckerberg announced to the world that Meta will “get back to our roots … ",
    "url": "https://www.404media.co/facebook-deletes-internal-employee-criticism-of-new-board-member-dana-white/"
  },
  {
    "text": "GOP-controlled North Carolina Supreme Court blocks certification of Democrat as winner of close high court race  —  The order allows the state Supreme Court to hear a challenge by the Republican candidate in the race — who trails by just 734 votes — to have 60,000 ballots thrown out.",
    "url": "https://www.nbcnews.com/politics/elections/north-carolina-supreme-court-blocks-certification-democrat-winner-clos-rcna186662"
  },
  {
    "text": "SALT emerges as redline for blue state Republicans in reconciliation negotiations  —  As House Republicans grapple with intraparty disagreements over what to include in President-elect Donald Trump's reconciliation bill, some GOP lawmakers are making specific tax provision demands they say will be necessary for their support.",
    "url": "https://www.washingtonexaminer.com/news/house/3279360/salt-emerges-redline-blue-state-republicans-reconciliation/"
  },
  {
    "text": "California governor says Pacific Palisades wildfire has destroyed many structures as winds kick up  —  A wildfire whipped up by extreme winds swept through a Los Angeles hillside dotted with celebrity residences Tuesday, burning homes in Pacific Palisades and prompting evacuation orders for tens of thousands.",
    "url": "https://apnews.com/article/wildfire-southern-california-santa-ana-winds-c48661615061eb631784b666cddfa4ac"
  },
  {
    "text": "Sunny Hostin Accidently Exposed Her Husband's Alleged Insurance Scam, Now He's a Defendant in a RICO Case  —  Is Sunny Hostin the most empty-headed person on the planet?  That's a legitimate question given some of the things she's said on “The View” over the years.",
    "url": "https://redstate.com/bonchie/2025/01/07/sunny-hostin-accidently-exposed-her-husbands-alleged-insurance-scam-now-hes-a-defendent-in-a-rico-case-n2184072"
  },
  {
    "text": "Judge Cannon Blocks Release of Special Counsel's Final Report on Trump Documents Investigation  —  Judge Aileen M. Cannon, a Trump appointee who dismissed the documents case in its entirety this summer, on Tuesday temporarily barred the special counsel, Jack Smith, from releasing the results of his investigation to the public.",
    "url": "https://www.nytimes.com/2025/01/07/us/politics/trump-documents-case-jack-smith-report.html?unlocked_article_code=1.nU4.owQZ.ld7D9HbGiGFl&smid=url-share"
  },
  {
    "text": "Man who exploded Tesla Cybertruck outside Trump hotel in Las Vegas used generative AI, police say  —  The highly decorated soldier who exploded a Tesla Cybertruck outside the Trump hotel in Las Vegas used generative AI including ChatGPT to help plan the attack, Las Vegas police said Tuesday.",
    "url": "https://apnews.com/article/tesla-cybertruck-explosion-trump-hotel-las-vegas-248b41d87287170aa7b68d27581fdb4d"
  },
  {
    "text": "The Great Crypto Crash  —  Trump will usher in a speculative frenzy.  —  “The countdown clock on the next catastrophic crash has already started,” Dennis Kelleher, the president of the nonprofit Better Markets, told me.  —  In the past few weeks, I have heard that sentiment or similar from economists … ",
    "url": "https://www.theatlantic.com/ideas/archive/2025/01/cryptocurrency-deregulation-future-crash/681202/"
  },
  {
    "text": "We're getting the social media crisis wrong  —  This post lays out some ideas that I've been thinking about for a long while.  You should treat my claims with appropriate skepticism - I'm saying that a lot of public thinking and academic research about social media is chasing after the wrong target … ",
    "url": "https://www.programmablemutter.com/p/were-getting-the-social-media-crisis"
  },
  {
    "text": "Scoop: Senate Dems delay Tulsi Gabbard nomination … - Sen. Mark Warner (D-Va.), the vice chair of the Senate Intelligence Committee, is balking at GOP requests to hold a hearing for Gabbard early next week, according to multiple sources familiar with the conversations.",
    "url": "https://www.axios.com/2025/01/07/tulsi-gabbard-senate-democrats-delay-hearing"
  },
  {
    "text": "Canadian Politician Fires Back at Trump: We'll Buy Two of YOUR States  —  THEM APPLES  —  “How about if we buy Alaska.  And we'll throw in Minnesota and Minneapolis at the same time.”",
    "url": "https://www.thedailybeast.com/ontario-premier-fires-back-at-trump-well-buy-two-of-your-states/"
  },
  {
    "text": "Carter Carried Into Capitol to Lie in State  —  The coffin of former President Jimmy Carter was transported on a horse-drawn caisson to the Capitol Rotunda, where Vice President Kamala Harris said his works “speak for him louder than any tribute we can offer.”  —  Haiyun Jiang for The New York Times",
    "url": "https://www.nytimes.com/live/2025/01/07/us/jimmy-carter-us-capitol-washington"
  },
  {
    "text": "Biden administration withdraws old-growth forest plan after getting pushback from industry and GOP  —  The Biden administration on Tuesday abruptly dropped its nascent plan to protect old-growth forests after getting pushback from Republicans and the timber industry.",
    "url": "https://apnews.com/article/biden-old-growth-forests-climate-change-e365debe64acf791f16de2ce75cb9342"
  }
]