[
  {
    "text": "Biden won't accept an Austin resignation if offered  —  The president is not considering sacking his defense secretary, officials say.  —  President Joe Biden is not considering firing Defense Secretary Lloyd Austin after he did not tell the White House about his emergency hospitalization … ",
    "url": "https://www.politico.com/news/2024/01/08/biden-austin-resignation-00134280"
  },
  {
    "text": "Trump wants Georgia election subversion case dismissed, arguing he has presidential immunity  —  Former President Donald Trump is seeking to have the sweeping criminal conspiracy case against him in Georgia thrown out by arguing he is protected from prosecution under presidential immunity.",
    "url": "https://www.cnn.com/2024/01/08/politics/trump-fulton-county-georgia-immunity/"
  },
  {
    "text": "The GOP's post-Trump lesson: Power isn't dependent on voting  —  Rep. Elise Stefanik (R-N.Y.) serves as Republican Conference chair, the party's third-highest leadership position in the House.  She earned that position in part by doing what her predecessor, former Wyoming congresswoman Liz Cheney … ",
    "url": "https://www.washingtonpost.com/politics/2024/01/08/stefanik-trump-election-results/"
  },
  {
    "text": "Trump urges Georgia judge to dismiss election interference case over presidential immunity  —  Former President Trump urged a Georgia judge to dismiss the election interference case against him there Monday, arguing he was acting in his role as president and is therefore immune from criminal prosecution.",
    "url": "https://thehill.com/regulation/court-battles/4395175-trump-urges-georgia-judge-to-dismiss-election-interference-case-over-presidential-immunity/"
  },
  {
    "text": "Democrats question whether Biden should agree to debate Trump  —  Democratic lawmakers are leery about the prospect of President Biden debating former President Trump, fearing that putting the two on stage together would only elevate the likely GOP nominee.  —  Trump has skipped every … ",
    "url": "https://thehill.com/homenews/senate/4392333-democrats-question-whether-biden-should-agree-to-debate-trump/"
  },
  {
    "text": "Business Insider story on Harvard antagonist's wife draws owner's scrutiny  —  The news site's German owner, Axel Springer, plans to review a story about alleged plagiarism by former MIT professor Neri Oxman, whose billionaire husband, Bill Ackman, sought to oust Harvard's president for similar academic transgressions.",
    "url": "https://www.washingtonpost.com/style/media/2024/01/08/neri-oxman-ackman-axel-springer-business-insider/"
  },
  {
    "text": "Exactly one proposition  —  Whaddya know, a rich asshole who can dish it out but can't take it: … Let's stop where this discussion should have ended.  If the journalism was solid, everyone at Axel Springer should tell Ackman to piss up a rope.  It was Ackman's choice to spend days … ",
    "url": "https://www.lawyersgunsmoneyblog.com/2024/01/exactly-one-proposition-2"
  },
  {
    "text": "Biden campaign raises $1M online in 24 hours after Jan. 6 speech  —  President Biden's reelection campaign raised more than $1 million through online fundraising alone in the 24 hours after the president's Jan. 6 anniversary speech, according to numbers exclusively provided to The Hill.",
    "url": "https://thehill.com/homenews/campaign/4394598-biden-campaign-raises-1m-online-in-24-hours-after-jan-6-speech/"
  },
  {
    "text": "Trump Is Connecting With a Different Type of Evangelical Voter  —  They are not just the churchgoing, conservative activists who once dominated the G.O.P.  —  Karen Johnson went to her Lutheran church so regularly as a child that she won a perfect attendance award.  As an adult, she taught Sunday school.",
    "url": "https://www.nytimes.com/2024/01/08/us/politics/donald-trump-evangelicals-iowa.html"
  },
  {
    "text": "‘Impossible’ to create AI tools like ChatGPT without copyrighted material, OpenAI says  —  Pressure grows on artificial intelligence firms over the content used to train their products  —  The developer OpenAI has said it would be impossible to create tools like its groundbreaking chatbot … ",
    "url": "https://www.theguardian.com/technology/2024/jan/08/ai-tools-chatgpt-copyrighted-material-openai"
  },
  {
    "text": "To disqualify or not to disqualify: The Supreme Court confronts the ‘laugh test’  —  The reactionary Supreme Court is in a quandary as to how to decide the Trump disqualification case while retaining whatever credibility it has left.  The court just voted to review the Colorado Supreme Court decision, but it really didn't want to.",
    "url": "https://thehill.com/opinion/judiciary/4394601-to-disqualify-or-not-to-disqualify-the-supreme-court-confronts-the-laugh-test/"
  },
  {
    "text": "House Republicans plot swift impeachment of Homeland Security Secretary Mayorkas as moderates signal support  —  House Republicans are plotting to swiftly impeach Homeland Security Secretary Alejandro Mayorkas early this year, as key swing-district Republicans express fresh openness … ",
    "url": "https://www.cnn.com/2024/01/08/politics/house-republicans-plot-swift-mayorkas-impeachment-as-moderates-signal-support"
  },
  {
    "text": "Rightwing Billionaires & Trump Want a Nation Where Everything is For Sale  —  Donald Trump and his fellow rightwing billionaires have a plan for America.  They want to turn the United States from a prosperous, middle-class nation into a country of paupers, where bribery is common and the wealthy can get away with anything.",
    "url": "https://hartmannreport.com/p/rightwing-billionaires-and-trump-77b"
  },
  {
    "text": "House Republicans release report recommending Hunter Biden be held in contempt of Congress  —  The report comes after the president's son defied a subpoena to testify behind closed doors and offered to testify at a public hearing instead.  —  House Republicans on the Judiciary and Oversight … ",
    "url": "https://www.nbcnews.com/politics/congress/house-republicans-release-report-recommending-hunter-biden-held-contem-rcna132800"
  },
  {
    "text": "US company says its moon landing attempt is in jeopardy because of an engine problem  —  The ashes and DNA of ‘Star Trek’ cast members and fans are being sent to space  —  A private company said Monday its moon landing is in jeopardy after a propulsion problem prevented the newly launched spacecraft … ",
    "url": "https://apnews.com/article/moon-landing-launch-private-nasa-0987b31b201b78c3935f1bfbf9a7cade"
  },
  {
    "text": "Supreme Court rejects taking up Alaska challenge to EPA's Pebble Mine decision  —  The Supreme Court won't take up a case that would have sought to revive a proposed gold and copper mine that was blocked by the Environmental Protection Agency (EPA) in 2021.  —  The court did not comment on its decision not to take up the case.",
    "url": "https://thehill.com/policy/energy-environment/4395196-supreme-court-rejects-taking-up-alaska-challenge-to-epas-pebble-mine-decision/"
  },
  {
    "text": "Johnson strikes his first bipartisan deal — a $1.7T funding accord  —  Ahead of a government shutdown cliff on Jan. 19, angst among House Republicans could still derail efforts to avert a funding lapse.  —  Congressional leaders have clinched a deal on overall budget totals that could pave … ",
    "url": "https://www.politico.com/news/2024/01/07/congress-spending-deal-shutdown-00134200"
  }
]