[
  {
    "text": "Jack Smith puts Judge Aileen Cannon on notice  —  Judge Aileen M. Cannon has left many legal experts dumbfounded with her handling of the criminal classified documents case against former president Donald Trump, the man who nominated her to the federal bench.  —  And special counsel Jack Smith appears to be losing patience with her.",
    "url": "https://www.washingtonpost.com/politics/2024/04/03/jack-smith-puts-judge-aileen-cannon-notice/"
  },
  {
    "text": "Why Judge Aileen Cannon is on thin ice in Trump's Mar-a-Lago case  —  Editor's Note: Norman Eisen, who served as counsel to House Democrats in the first Trump impeachment, is a senior fellow at Brookings.  E. Danya Perry, a founding partner of Perry Guha LLP, formerly served as a federal prosecutor … ",
    "url": "https://www.cnn.com/2024/04/03/opinions/aileen-cannon-trump-mar-a-lago-case-eisen-perry-kolb"
  },
  {
    "text": "Playbook: How Mike Johnson boxed himself in  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  WHAT JEN O'MALLEY DILLON IS READING — The GOP-backed bid to change Nebraska's presidential elector system to a winner-take-all setup — likely giving DONALD TRUMP … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/04/04/how-mike-johnson-boxed-himself-in-00150544"
  },
  {
    "text": "Nebraska legislators buck Trump by blocking Electoral College vote change — for now  —  Former President Donald Trump and Republican Gov. Jim Pillen have called on lawmakers to change the state's Electoral College vote allocation to a winner-take-all system.",
    "url": "https://www.nbcnews.com/politics/2024-election/nebraska-legislators-buck-trump-blocking-electoral-college-vote-change-rcna146321"
  },
  {
    "text": "Chef Jose Andres says Israel targeted his aid workers ‘systematically, car by car’  —  Celebrity chef Jose Andres told Reuters in an emotional interview on Wednesday that an Israeli attack that killed seven of his food aid workers in Gaza had targeted them “systematically, car by car.”",
    "url": "https://www.reuters.com/world/middle-east/chef-jose-andres-says-israel-targeted-his-aid-workers-systematically-car-by-car-2024-04-03/"
  },
  {
    "text": "Man who used megaphone to lead attack on police during Capitol riot gets more than 7 years in prison  —  A Washington state man who used a megaphone to orchestrate a mob's attack on police officers guarding the U.S. Capitol was sentenced on Wednesday to more than seven years in prison.",
    "url": "https://apnews.com/article/taylor-johnatakis-capitol-riot-sentencing-f97acd68b8860d36b212e408ac80abd4"
  },
  {
    "text": "Judge Won't Delay Trump's Criminal Trial to Wait for Immunity Ruling  —  The former president had asked the judge to push back his Manhattan criminal trial, slated to begin April 15, until after the Supreme Court decides whether he is immune from prosecution.",
    "url": "https://www.nytimes.com/2024/04/03/nyregion/trump-merchan-immunity-ruling.html"
  },
  {
    "text": "Rejected and ‘returned for correction’: Docs for Trump's $175M bond get bounced  —  A review of the New York County Supreme Court docket on Wednesday shows that paperwork for former President Donald Trump's newly-secured bond of $175 million was temporarily rejected and “returned for correction.”",
    "url": "https://lawandcrime.com/high-profile/rejected-and-returned-for-correction-docs-for-trumps-175m-bond-get-bounced/"
  },
  {
    "text": "Biden moves to defang political assaults on federal workforce  —  The move is widely seen as a response to former President Donald Trump's efforts to root out what he called a “deep state” that thwarted his policies.  —  The Biden administration put the finishing touches Thursday on a plan … ",
    "url": "https://www.politico.com/news/2024/04/04/biden-moves-to-defang-political-assaults-on-federal-workforce-00150446"
  },
  {
    "text": "Trump Spoke Recently With Saudi Leader  —  It is not clear what the former president discussed with Prince Mohammed bin Salman, but news of their call came amid Biden administration negotiations with the Saudis over a Middle East peace plan.  —  Former President Donald J. Trump spoke recently … ",
    "url": "https://www.nytimes.com/2024/04/03/us/politics/trump-spoke-recently-with-saudi-leader.html"
  },
  {
    "text": "How Biden's White House Gathering for Ramadan Unraveled Over Gaza  —  Some Muslim community leaders said it would be wrong to attend an iftar meal with President Biden while Gaza is under siege.  —  When the White House invited Muslim community leaders for a dinner this week celebrating … ",
    "url": "https://www.nytimes.com/2024/04/03/us/politics/biden-white-house-ramadan-israel-gaza.html"
  },
  {
    "text": "Top Israeli official Ron Dermer began yelling during a meeting with U.S. officials about Gaza, officials say  —  The meeting grew tense after the Americans questioned an Israeli plan to evacuate more than 1 million Palestinian civilians from Rafah and house them in tents.",
    "url": "https://www.nbcnews.com/politics/national-security/top-israeli-official-ron-dermer-yelling-meeting-us-officials-gaza-rcna146293"
  },
  {
    "text": "Biden extends some immigrant work permits, potentially saving thousands of jobs  —  The Biden administration on Thursday is announcing an extension of work permits for certain categories of immigrants, potentially preventing hundreds of thousands of people from losing their jobs overnight.",
    "url": "https://thehill.com/latino/4573404-biden-immigrant-work-permits/"
  },
  {
    "text": "Two Individuals Plead Guilty To Participating In Insider Trading Scheme Based On SPAC Merger With Trump Media & Technology Group  —  For Immediate Release  —  U.S. Attorney's Office, Southern District of New York  —  Michael Shvartsman and Gerald Shvartsman Made More Than $22 Million … ",
    "url": "https://www.justice.gov/usao-sdny/pr/two-individuals-plead-guilty-participating-insider-trading-scheme-based-spac-merger"
  },
  {
    "text": "Democratic tactics against RFK Jr. are rattling his campaign  —  Recent digital and in-person protests have prompted the independent campaign to enact some evasive maneuvers.  —  A billboard truck paid for by the DNC has been circling Robert F. Kennedy Jr.'s campaign events.",
    "url": "https://www.politico.com/news/2024/04/03/rfk-jr-democrats-third-party-00150497"
  },
  {
    "text": "EPA awards $20 billion in green bank grants for clean energy projects nationwide  —  DETROIT (AP) — The Environmental Protection Agency on Thursday awarded $20 billion in federal “green bank” grants to eight community development banks and nonprofit organizations to use on projects combating climate change … ",
    "url": "https://apnews.com/article/epa-billions-clean-green-energy-community-grants-8f6c76cb41783a5e838ac4f7f7cce086"
  },
  {
    "text": "GOP Senate candidates cash out at Mar-a-Lago  —  Republican Senate candidates have flocked to Mar-a-Lago in recent months to raise funds for their campaigns, and the results have been lucrative, Axios has learned. … - Republican Bernie Moreno, who won a contentious GOP Senate primary in Ohio last month … ",
    "url": "https://www.axios.com/2024/04/03/trump-mar-a-lago-fundraising-republicans"
  },
  {
    "text": "New Bill Clinton memoir coming after November election … - “I knew as I entered this new chapter of my life that I'd keep score the way I always have,” Clinton says in the announcement.  — “Are people better off when you quit than when you started?",
    "url": "https://www.axios.com/2024/04/04/bill-clinton-book-citizen-november-2024-release"
  },
  {
    "text": "Elon Musk's viral lie about the 2024 election uses bogus data  —  In October 2022, Elon Musk completed his purchase of Twitter.  He then dramatically changed the algorithm to boost his own tweets.  The new algorithm, according to a February 2023 report by Platformer, “artificially boosted Musk's tweets … ",
    "url": "https://popular.info/p/elon-musks-viral-lie-about-the-2024"
  }
]