[
  {
    "text": "Obama Urges Americans to Take in ‘Whole Truth’ of Israel-Gaza War  —  The former president said everyone was “complicit to some degree” in the current bloodshed and acknowledged the points of view on both sides of the conflict.  —  Barack Obama offered a complex analysis of the conflict between Israel … ",
    "url": "https://www.nytimes.com/2023/11/04/us/politics/obama-israel-palestine.html"
  },
  {
    "text": "Scott: ‘Obama is dead wrong’ on Israel-Hamas conflict  —  “From Obama to Biden, Democrats have a problem: supporting Israel always has an asterisk,” the South Carolina senator and presidential contender said in a statement.  —  Tim Scott on Saturday slammed Barack Obama as “dead wrong” … ",
    "url": "https://www.politico.com/news/2023/11/04/tim-scott-obama-israel-hamas-00125401"
  },
  {
    "text": "Asa Hutchinson Booed After Predicting ‘Significant Likelihood’ Of Trump Conviction  —  “There is a significant likelihood that Donald Trump will be found guilty by a jury on a felony offense,” said the former Arkansas governor and 2024 hopeful.  —  LOADING",
    "url": "https://www.huffpost.com/entry/asa-hutchinson-booed-predicts-trump-conviction_n_6546a8bee4b06bc01e247399"
  },
  {
    "text": "Barring Trump from office could bring closure for Jan. 6 riots, former officer says  —  Former U.S. Capitol Police Sergeant Aquilino Gonell said he thinks former President Trump being barred from office could bring closure for the Jan. 6 riots.  —  “What is closure for me?",
    "url": "https://thehill.com/homenews/campaign/4293802-barring-trump-from-office-could-bring-closure/"
  },
  {
    "text": "Boos Rain Down on Chris Christie During Florida GOP Speech  —  JWPlayer  —  Another Republican event.  Another round of boos for Chris Christie.  —  The boos rained down on the former New Jersey governor Saturday almost as soon as he took the stage at the Republican Party … ",
    "url": "https://themessenger.com/politics/boos-rain-down-on-chris-christie-during-florida-gop-speech"
  },
  {
    "text": "William Lewis named publisher and CEO of The Washington Post  —  The veteran media executive, previously the publisher of the Wall Street Journal, was tapped by Washington Post owner Jeff Bezos to replace Fred Ryan, who stepped down in August.  —  William Lewis, a reporter-turned-executive … ",
    "url": "https://www.washingtonpost.com/style/media/2023/11/04/william-lewis-publisher-ceo-washington-post/"
  },
  {
    "text": "Kamala Harris' stepdaughter Ella Emhoff is promoting an $8M Gaza fundraising campaign: ‘Abhorrent’  —  The stepdaughter of Vice President Harris is publicly raising money for Gaza, The Post has learned.  —  Ella Emhoff, 24 — whose father, First Gentleman Doug Emhoff, is Jewish … ",
    "url": "https://nypost.com/2023/11/04/news/kamala-harris-stepdaughter-ella-emhoff-raising-money-for-gaza/"
  },
  {
    "text": "All The Ways Republicans Tried To Game The Ohio Abortion Vote  —  The future of abortion access in Ohio will be decided on Tuesday, when voters thumbs up or down a ballot proposal to enshrine abortion rights in the state constitution.  —  The abortion rights supporters have money … ",
    "url": "https://talkingpointsmemo.com/news/republicans-ohio-abortion-larose"
  },
  {
    "text": "Hit-and-run which injured Stanford Arab-Muslim student investigated as possible hate crime  —  California authorities are investigating a hit-and-run Friday afternoon which injured an Arab-Muslim student on the campus of Stanford University as a possible hate crime.",
    "url": "https://www.cbsnews.com/news/hit-and-run-injured-stanford-arab-muslim-student-investigated-possible-hate-crime-california/"
  },
  {
    "text": "Scoop: Biden's 2024 team roiled by Israel-Hamas war … - Those divisions are chiefly between older pro-Israel Democrats and younger progressives who are more sympathetic to the plight of Palestinians.  — Their differences have been exposed by the war in Gaza that began Oct. 7 … ",
    "url": "https://www.axios.com/2023/11/04/biden-2024-team-israel-hamas-war-election-dnc"
  },
  {
    "text": "Injury in Massachusetts field hockey game renews debate about co-ed sports  —  DIGHTON, Mass. —  A student-athlete suffered a significant injury during a field hockey game played Thursday between two Massachusetts high schools, and the incident is renewing a debate about co-ed sports.",
    "url": "https://www.wcvb.com/article/field-hockey-injury-co-ed-sports-massachusetts/45737242"
  },
  {
    "text": "How Speaker Mike Johnson's plans for a Christian law school unraveled  —  Johnson vouched for the school — and agreed to serve as its dean — without seeing a key feasibility study, he would ultimately admit  —  In February 2012, Mike Johnson sent an aide on an urgent mission at the college … ",
    "url": "https://www.washingtonpost.com/politics/2023/11/04/mike-johnson-law-school-louisiana-college-shreveport/"
  },
  {
    "text": "New York Times Writer Resigns After Signing Letter Protesting the Israel-Gaza War  —  The writer, Jazmine Hughes, who has won awards for her work, had signed another letter of protest this year.  —  Jazmine Hughes, an award-winning New York Times Magazine staff writer … ",
    "url": "https://www.nytimes.com/2023/11/03/business/media/new-york-times-writer-resign-israel-gaza-war.html"
  },
  {
    "text": "Trump Scores More Florida Lawmaker Endorsements, Including DeSantis Defectors (Exclusive)  —  The endorsements of Trump come as the presidential candidates travel to Florida for a GOP summit  —  JWPlayer  —  Seven more Republican Florida legislators are endorsing Donald Trump's presidential campaign … ",
    "url": "https://themessenger.com/news/trump-scores-more-florida-lawmaker-endorsements-including-desantis-defectors-exclusive"
  }
]