[
  {
    "text": "Ruling Against Trump Cuts to the Heart of His Identity  —  The finding by a judge in a New York civil case that Donald Trump committed fraud in valuing his real estate properties undermined the narrative of the business career that launched him in politics.  —  Nearly every aspect … ",
    "url": "https://www.nytimes.com/2023/09/27/us/politics/trump-fraud-ruling.html"
  },
  {
    "text": "Judge Gives Trump Organization the Corporate Death Penalty  —  Donald Trump is no longer in business.  —  Worse, the self-proclaimed multibillionaire may soon be personally bankrupt as a result, stripped of just about everything because for years he engaged in calculated bank fraud … ",
    "url": "https://www.dcreport.org/2023/09/26/donald-trump-liable-for-fraud/"
  },
  {
    "text": "How much would your house be worth if the Trump Organization owned it?  —  A year offering no shortage of bad news for Donald Trump outdid itself Tuesday afternoon, with New York Supreme Court Justice Arthur Engoron ruling that the former president's namesake business, the Trump Organization … ",
    "url": "https://www.washingtonpost.com/politics/2023/09/27/trump-property-inflated-values/"
  },
  {
    "text": "New York judge finds Donald Trump liable for fraud  —  A New York judge found Donald Trump and his adult sons liable for fraud and canceled the Trump Organization's business certification, a shocking ruling that poses an existential threat to the former president's financial empire as he runs for a second term in the White House.",
    "url": "https://www.cnn.com/2023/09/26/politics/trump-organization-business-fraud/"
  },
  {
    "text": "McCarthy's new shutdown strategy: Shifting the blame  —  Good morning, Early Birds.  The New York Times's Vanessa Friedman says it's “a cliché” to wear a Patagonia fleece vest in the office if you don't work in outdoor recreation — but it's so cold in The Post's newsroom.  What's a man to do?",
    "url": "https://www.washingtonpost.com/politics/2023/09/27/mccarthys-new-shutdown-strategy-shifting-blame/"
  },
  {
    "text": "McCarthy told conference he won't allow vote on Senate stopgap: GOP lawmakers  —  Speaker Kevin McCarthy (R-Calif.) told members of the House GOP conference Wednesday morning that he will not bring the Senate's bipartisan continuing resolution to the floor for a vote.",
    "url": "https://thehill.com/homenews/house/4225849-mccarthy-told-conference-he-wont-allow-vote-on-senate-stopgap-gop-lawmakers/"
  },
  {
    "text": "Shutdown odds grow as House GOP leaders reject Senate's spending bill  —  A federal government shutdown looked increasingly likely as House Republicans indicated Wednesday they would not consider a bipartisan Senate plan to fund the government past the weekend deadline.",
    "url": "https://www.washingtonpost.com/business/2023/09/27/government-shutdown-house-rejects-senate-spending-bill/"
  },
  {
    "text": "Poll: Republicans see Trump as a ‘person of faith’ ... more so than Mitt Romney, Mike Pence and others  —  Sen. Mitt Romney tops the list for independents, while more Democrats say President Biden is a man of faith  —  More than half of Republicans see former President Donald Trump as a person of faith … ",
    "url": "https://www.deseret.com/2023/9/26/23891360/trump-biden-man-of-faith-religious-mitt-romney-vivek-ramaswamy"
  },
  {
    "text": "President Drink Bleach says what?  Trump now claims he beat George W. Bush and Barack Obama  —  The press should cover his decline anyway  —  Donald Trump is skipping another GOP primary debate this week and the theories abound as to why.  Some paint it as a smart strategy … ",
    "url": "https://www.salon.com/2023/09/27/drink-bleach-says-what-now-claims-he-beat-george-w-bush-and-barack-obama/"
  },
  {
    "text": "Trump Tries to Court Blue-Collar Workers at a Nonunion Factory  —  A day after President Biden appeared on a union picket line, the former president will speak at an auto parts factory, but it's unclear whether any striking workers will be in the crowd.  —  Former President Donald J. Trump … ",
    "url": "https://www.nytimes.com/2023/09/27/us/politics/trump-autoworkers-detroit.html"
  },
  {
    "text": "My President Joined a Picket Line  —  No matter what you think of Joe Biden, his decision to stand with UAW workers is historic.  And it might just get him reelected.  —  Pocket  —  Abraham Lincoln, arguably the most class-conscious president in American history, declared in his first annual message to the US Congress,",
    "url": "https://www.thenation.com/article/politics/biden-picket-line-uaw-strike/"
  },
  {
    "text": "Jared Kushner pressured Washington Post to fire editor over Russia, book says  —  Marty Baron says Trump's son-in-law leaned on Post publisher to withdraw support of Russia election interference investigation  —  Donald Trump's son-in-law and senior White House adviser, Jared Kushner … ",
    "url": "https://www.theguardian.com/books/2023/sep/27/jared-kushner-editor-washington-post-trump-russia-election-interference-2016"
  },
  {
    "text": "Biden tops Trump by 5 points in new survey  —  President Biden tops former President Trump by 5 points among registered voters in a 2024 hypothetical matchup, new polling shows.  —  Asked who they'd back if Trump and Biden were their respective party's nominees, 45 percent of registered voters … ",
    "url": "https://thehill.com/homenews/campaign/4225778-biden-tops-trump-by-5-points-in-new-survey/"
  },
  {
    "text": "The impeachment inquiry is starting exactly as might have been expected  —  When the Democratic majority in the House held the first public hearing in its 2019 impeachment inquiry targeting President Trump, it heard testimony from members of Trump's administration who could speak to the central allegation … ",
    "url": "https://www.washingtonpost.com/politics/2023/09/27/comer-biden-impeachment-hearing/"
  },
  {
    "text": "At least 20 arrested in night of looting throughout Philly, police say  —  Large crowds — mostly consisting of juveniles — looted multiple stores and damaged property across Philadelphia Tuesday night, police said.  —  It was around 8 p.m. when, officials said, police started receiving calls … ",
    "url": "https://www.nbcphiladelphia.com/news/local/large-crowds-of-juveniles-loot-multiple-stores-in-center-city-police-say/3654732/"
  },
  {
    "text": "Menendez ordered to turn over personal passport at arraignment  —  Sen. Bob Menendez (D-N.J.), who pleaded not guilty to federal bribery charges Wednesday, must turn over his personal passport as a condition for his release, multiple reports indicated following the senator's arraignment in Manhattan.",
    "url": "https://thehill.com/regulation/court-battles/4225703-menendez-ordered-to-turn-over-personal-passport-at-arraignment/"
  },
  {
    "text": "Court rulings poised to play pivotal role in battle for Congress  —  The Supreme Court's Alabama decision was just one among a series of redistricting cases expected to influence the balance of power on Capitol Hill  —  The Supreme Court's order Tuesday clearing the way for a second Alabama … ",
    "url": "https://www.washingtonpost.com/politics/2023/09/27/supreme-court-alabama-redistricting/"
  },
  {
    "text": "Musk's X disabled feature for reporting electoral misinformation - researcher  —  Elon Musk's X, formerly called Twitter, disabled a feature that let users report misinformation about elections, a research organisation said on Wednesday, throwing fresh concern about false claims spreading just before major U.S. and Australian votes.",
    "url": "https://www.reuters.com/technology/musks-x-disabled-feature-reporting-electoral-misinformation-researcher-2023-09-27/"
  },
  {
    "text": "With shutdown looming, Carter library moves up birthday celebration for 39th president  —  The Jimmy Carter Presidential Library and Museum has moved up planned festivities for the former president's 99th birthday amid the possibility of a government shutdown by the end of the week.",
    "url": "https://www.cnn.com/2023/09/27/politics/jimmy-carter-birthday-celebration-government-shutdown/"
  },
  {
    "text": "Amazon Is the Apex Predator of Our Platform Era  —  The Federal Trade Commission's chair, Lina Khan, has brought her long-awaited, audacious case against Amazon, signaling the Biden administration's determination to restore an approach to competition law that has been in decline since the Carter administration.",
    "url": "https://www.nytimes.com/2023/09/27/opinion/amazon-ftc-antitrust-monopoly.html"
  }
]