[
  {
    "text": "Judge rescinds permission for Trump to give his own closing argument at his civil fraud trial  —  Donald Trump won't make his own closing argument in his New York civil business fraud trial after his lawyers objected to the judge's insistence that the former president would stick to “relevant” matters.",
    "url": "https://apnews.com/article/trump-fraud-trial-closing-arguments-420997f889922423dbce8a0945f0c348"
  },
  {
    "text": "Republican Voters Can — and Should — Rethink Nominating Trump  —  To say Donald Trump is the front-runner for the Republican nomination is an understatement.  He is above 60 percent in national polling averages and leads by roughly 30 points in Iowa.  His lead is much narrower in New Hampshire … ",
    "url": "https://www.nationalreview.com/2024/01/republican-voters-can-and-should-rethink-nominating-trump/"
  },
  {
    "text": "Trump's Bad Day in Court  —  The first of many to come  —  Following Tuesday morning's oral argument in the District of Columbia, Donald Trump made some predictable comments to the press from a Washington, D.C., hotel.  As he finished, a reporter shouted out a request that he use the moment to tell his followers, “No violence.”",
    "url": "https://joycevance.substack.com/p/trumps-bad-day-in-court"
  },
  {
    "text": "Trump vowed he'd ‘never’ help Europe if it's attacked, top EU official says  —  ‘By the way NATO is dead,’ the former (and potential future) US president added in private meeting.  —  BRUSSELS — One of Europe's most senior politicians recounted how former U.S. President Donald Trump privately warned … ",
    "url": "https://www.politico.eu/article/donald-trump-vow-never-help-europe-attack-thierry-breton/"
  },
  {
    "text": "‘You have no balls’: Hunter Biden derails GOP vote to hold him in contempt  —  The president's son made his second straight surprise appearance designed to rattle the Republicans investigating him.  It seemed to work.",
    "url": "https://www.politico.com/live-updates/2024/01/10/congress/hunter-biden-appears-at-contempt-me-00134740"
  },
  {
    "text": "Hunter Biden makes surprise appearance at House contempt hearing  —  President's son also made an unexpected appearance last December to blast House Republicans who have subpoenaed him  —  Hunter Biden made an unexpected appearance on Capitol Hill on Wednesday morning … ",
    "url": "https://www.washingtonpost.com/politics/2024/01/10/biden-surprise-appearance-contempt-hearing/"
  },
  {
    "text": "Hunter Biden makes surprise appearance at contempt of Congress hearing  —  Hunter Biden made a surprise appearance at a markup of the House Oversight Committee on Wednesday as the panel considers a resolution to hold the president's son in contempt of Congress for defying a subpoena last month.",
    "url": "https://thehill.com/homenews/house/4400047-hunter-biden-contempt-of-congress-hearing/"
  },
  {
    "text": "Trump promotes ‘totally baseless’ birther conspiracy theory against Nikki Haley  —  The former U.N. ambassador was born in South Carolina and is a U.S. citizen.  —  DES MOINES, Iowa — Donald Trump, the chief propagator of false birther claims first against then-President Barack Obama … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-promotes-baseless-birther-conspiracy-theory-nikki-haley-rcna133166"
  },
  {
    "text": "Speaker Johnson, Desperate To Avoid Mutiny, To Call Trump For Approval Check  —  'He and I have a very close relationship.  He's been an enthusiastic supporter of my leadership here,\" Johnson said of Trump  —  House Speaker Mike Johnson is reaching for the ultimate lifeline on Wednesday … ",
    "url": "https://themessenger.com/politics/speaker-johnson-desperate-to-avoid-mutiny-to-call-trump-for-approval-check"
  },
  {
    "text": "Florida school district removes dictionaries from libraries, citing law championed by DeSantis  —  The Escambia County School District, located in the Florida panhandle, has removed several dictionaries from its library shelves over concerns that making the dictionaries available to students would violate Florida law.",
    "url": "https://popular.info/p/florida-school-district-removes-dictionaries"
  },
  {
    "text": "Trump prosecutor accused of ‘improper’ relationship with Georgia DA Fani Willis billed $4K for meetings with WH officials  —  The special prosecutor that Georgia District Attorney Fani Willis is accused of having an “improper” relationship with billed the Fulton County DA's office $4,000 … ",
    "url": "https://nypost.com/2024/01/10/news/trump-prosecutor-nathan-wade-billed-georgia-da-4000-for-white-house-meetings/"
  },
  {
    "text": "Republican governors in 15 states reject summer food money for kids  —  Moving beyond efforts to block expansion of health care for the poor and disabled, Republican governors in 15 states are now rejecting a new, federally funded summer program to give food assistance to hungry children.",
    "url": "https://www.washingtonpost.com/nation/2024/01/10/republican-governors-summer-lunch-program/"
  },
  {
    "text": "Bosses in the Biden admin are pressed over young staffers' anonymous letters  —  Protest letters, like those over Israel, were rare in past administrations.  White House veterans can barely contain their disdain over how times have changed.  —  Protest culture is shattering the last remaining barriers … ",
    "url": "https://www.politico.com/news/2024/01/10/white-house-biden-staffers-00134688"
  },
  {
    "text": "Fox News ran a conspiratorial segment saying the Pentagon wanted to use Taylor Swift as a psy-op  — Fox News' Jesse Watters floated a brand new theory about Taylor Swift on Tuesday night.  — He said the Pentagon had planned to make her an “asset” in a pro-President Joe Biden “psyop.”",
    "url": "https://www.businessinsider.com/taylor-swift-pentagon-psyop-fox-news-jesse-watters-conspiratorial-segment-2024-1"
  },
  {
    "text": "TSA found a record number of guns at airport security checkpoints in 2023.  Almost all of them were loaded.  —  The Transportation Security Administration found a record-setting 6,737 guns at airport security checkpoints in 2023, the agency announced Wednesday.",
    "url": "https://www.cbsnews.com/news/tsa-guns-airport-checkpoints-loaded-2023/"
  },
  {
    "text": "New Arizona Poll Finds Sinema Trails Gallego, Lake in Three-Way Matchup (Exclusive)  —  Biden and Trump are also locked in a dead heat in the state  —  A new poll from Arizona found that Independent Sen. Kyrsten Sinema is far behind her potential general election opponents.",
    "url": "https://themessenger.com/politics/new-arizona-poll-finds-sinema-trails-gallego-lake-in-three-way-matchup-exclusive"
  },
  {
    "text": "Two Biden judicial nominees withdraw from consideration  —  A state court judge in Washington state and a law clerk to a federal judge in Rochester, New York who were both nominated by President Joe Biden to become federal trial court judges have withdrawn their names from further consideration.",
    "url": "https://www.reuters.com/legal/government/law-clerk-nominated-by-biden-judgeship-withdraws-consideration-2024-01-09/"
  },
  {
    "text": "Why Haley Won't Break Through  —  Today's GOP is split along class lines, and her college-grad supporters aren't the majority.  —  WAUKEE, Iowa —  Nikki Haley's Tuesday rally outside Des Moines was a fittingly pedestrian event in this desultory excuse of a presidential primary.",
    "url": "https://www.politico.com/news/magazine/2024/01/10/haley-iowa-2024-primary-trump-00134703"
  },
  {
    "text": "Lauren Boebert's Ex-Husband Arrested on Weapons and Assault Charges  —  In addition to the assault and weapons counts, Boebert was also charged with harassment (\"strikes shoves, kicks\"), disorderly conduct, and trespassing, jail records show.  —  Jayson Boebert, the former husband of Rep. Lauren Boebert … ",
    "url": "https://www.thedailybeast.com/lauren-boeberts-ex-husband-arrested-on-weapons-and-assault-charges"
  },
  {
    "text": "Al Shabab Terrorist Group Captures U.N. Helicopter in Somalia  —  Somali officials said the helicopter was carrying nine passengers, one of whom was killed.  —  A United Nations helicopter carrying nine passengers was captured in Somalia on Wednesday by the terrorist group Al Shabab … ",
    "url": "https://www.nytimes.com/2024/01/10/world/africa/al-shabab-un-helicopter-somalia.html"
  },
  {
    "text": "Adopting rightwing policies ‘does not help centre-left win votes’  —  Study of European electoral data suggests social democratic parties alienate supporters by moving towards the political centre  —  Adopting rightwing policies on issues such as immigration and the economy does … ",
    "url": "https://www.theguardian.com/politics/2024/jan/10/adopting-rightwing-policies-does-not-help-centre-left-win-votes"
  }
]