[
  {
    "text": "Fetterman to be first sitting Democratic U.S. senator to visit Trump at Mar-a-Lago  —  Democratic Sen. John Fetterman of Pennsylvania has accepted an invitation from President-elect Donald Trump to meet with him at his Mar-a-Lago estate, according to multiple sources familiar with the plans.",
    "url": "https://www.cbsnews.com/news/fetterman-trump-mar-a-lago/"
  },
  {
    "text": "Democrats Are About to Surrender to Trump in a Hugely Damaging Way  —  By all indications, at least nine Senate Democrats will vote to advance the Laken Riley Act, a sweeping measure that mandates the detention of undocumented immigrants who have committed nonviolent crimes, all but ensuring that it will move forward.",
    "url": "https://newrepublic.com/article/190043/laken-riley-immigration-bill-trump-democrats-surrender"
  },
  {
    "text": "Scoop: Trump's 100 executive orders … - Senators were given previews of some of what they were told would be 100 executive orders, two sources who were in the room told Axios.  — Stephen Miller, Trump's longtime immigration adviser, dove into how they intend to use executive power … ",
    "url": "https://www.axios.com/2025/01/09/trump-immigration-executive-orders-stephen-miller"
  },
  {
    "text": "Wildfire response threatens to end Karen Bass' extended honeymoon  —  The Los Angeles mayor returned home from Ghana on Wednesday and said she was in “constant contact” while abroad.  —  LOS ANGELES — Karen Bass probably has second thoughts about that trip to Ghana.",
    "url": "https://www.politico.com/news/2025/01/08/wildfire-threatens-karen-bass-extended-honeymoon-00197228"
  },
  {
    "text": "New York appeals court denies Trump's bid to halt Friday's hush money sentencing  —  Trump has also asked the U.S. Supreme Court to block his sentencing.  —  President-elect Donald Trump speaks during a news conference at Mar-a-Lago, Jan. 7, 2024, in Palm Beach, Fla.",
    "url": "https://abcnews.go.com/US/trump-claim-immunity-halt-fridays-hush-money-sentencing/story?id=117502080"
  },
  {
    "text": "CNN's Scott Jennings Makes L.A. Fire Hell All About DEI  —  Scott Jennings felt the ire of Rep. Jasmine Crockett (D-TX), who took a blowtorch to him after he appeared to suggest on CNN NewsNight that the southern California wildfires are worse because there are not enough white men working … ",
    "url": "https://www.thedailybeast.com/scott-jennings-says-la-firefighters-too-busy-promoting-diversity/"
  },
  {
    "text": "Karen Pence Snubs Donald Trump At Jimmy Carter's Funeral  —  This was the first time Mike Pence and Donald Trump have been together publicly since the insurrection.  —  LOADING  —  Former second lady Karen Pence appeared to snub President-elect Donald Trump on Thursday at former President Jimmy Carter's funeral.",
    "url": "https://www.huffpost.com/entry/karen-pence-snubs-donald-trump-jimmy-carter-funeral_n_677ff987e4b0dc0efd13adb0"
  },
  {
    "text": "Elon Musk says DOGE probably won't find $2 trillion in federal budget cuts  —  Musk previously said his Department of Government Efficiency would be able to recommend cuts to the federal budget of “at least $2 trillion.”  —  Tech billionaire Elon Musk said Wednesday that his budget-cutting effort … ",
    "url": "https://www.nbcnews.com/politics/politics-news/elon-musk-says-doge-probably-wont-find-2-trillion-federal-budget-cuts-rcna186924"
  },
  {
    "text": "'Can't Even Respond': Gavin Newsom Reacts To Trump's Los Angeles Wildfires Attack  —  The California governor wasn't having it with the president-elect blaming him for the devastating fires.  —  LOADING  —  California Gov. Gavin Newsom (D) swiftly dismissed Donald Trump's efforts to … ",
    "url": "https://www.huffpost.com/entry/gavin-newsom-donald-trump-politicize-los-angeles-wildfires_n_677f6a02e4b018662a3bdc11"
  },
  {
    "text": "Candy Crush, Tinder, MyFitnessPal: See the Thousands of Apps Hijacked to Spy on Your Location  —  This article was produced with support from WIRED.  —  Some of the world's most popular apps are likely being co-opted by rogue members of the advertising industry to harvest sensitive location data … ",
    "url": "https://www.404media.co/candy-crush-tinder-myfitnesspal-see-the-thousands-of-apps-hijacked-to-spy-on-your-location/"
  },
  {
    "text": "Judge Rejects Biden's Title IX Rules, Scrapping Protections for Trans Students  —  The decision threw out the administration's proposed regulations, which prohibited discrimination based on gender identity.  —  A federal judge in Kentucky on Thursday struck down President Biden's effort … ",
    "url": "https://www.nytimes.com/2025/01/09/us/politics/biden-title-ix-ruling.html"
  },
  {
    "text": "Donald Trump Jr.'s visit was ‘staged,’ says Greenland lawmaker  —  A senior Greenlandic politician slammed Donald Trump Jr.'s visit to the island as “staged,” and warned the United States not to “invade us” given its historical treatment of Alaska's indigenous people.",
    "url": "https://www.politico.eu/article/donald-trump-junior-visit-was-staged-says-greenland-lawmaker/"
  },
  {
    "text": "Taking Trump's imperialist trolling seriously (for a moment)  —  We've come a long way from bringing down egg prices.  —  ∙ Paid  —  Speaking as someone who's been covering Trump for nine years now, paying attention to what he's doing instead of obsessing over what he's saying is generally a good rule of thumb.",
    "url": "https://www.publicnotice.co/p/trump-greenland-canada-paul-frymer-interview"
  },
  {
    "text": "More than 15,000 doctors sign letter urging Senate to reject RFK Jr. as health secretary  —  Their letter calls the choice of Robert F. Kennedy Jr., who is known for promoting false medical claims, “a slap in the face” to health care professionals.  —  More than 15,000 doctors have signed … ",
    "url": "https://www.nbcnews.com/news/us-news/rfk-jr-health-secretary-doctors-urge-senate-block-trump-administration-rcna186807"
  },
  {
    "text": "Inside Trump's Search for a Health Threat to Justify His Immigration Crackdown  —  President-elect Donald J. Trump's advisers have spent months trying to identify a disease that will help them build their case for closing the border.  —  President-elect Donald J. Trump is likely to justify … ",
    "url": "https://www.nytimes.com/2025/01/09/us/politics/trump-title-42-migrants.html?unlocked_article_code=1.n04.MOeP.WMVO9O2AF_cF&smid=url-share"
  },
  {
    "text": "Reality bites Trump … - “I do think that you kind of have to have some overage,” Musk, co-head of the Department of Governmental Efficiency (DOGE), told former Clinton pollster Mark Penn on X.  — “I think if we try for $2 trillion, we've got a good shot at getting $1 trillion,” he added … ",
    "url": "https://www.axios.com/2025/01/09/trump-musk-campaign-promises"
  },
  {
    "text": "Falsehoods around the L.A. fires are proliferating on the right  —  Anything to keep the realities of climate change from spreading.  —  There is nothing political about the wildfires that have annihilated thousands of buildings around Los Angeles this week, with two exceptions.",
    "url": "https://www.washingtonpost.com/politics/2025/01/09/los-angeles-fires-politics/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM2Mzk4ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM3NzgxMTk5LCJpYXQiOjE3MzYzOTg4MDAsImp0aSI6ImE3N2IyYWJkLTVjYjItNDY3Yi04ZDBhLTBhNDI2Mjk0YmUzMiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzAxLzA5L2xvcy1hbmdlbGVzLWZpcmVzLXBvbGl0aWNzLyJ9.joiSOVPm4sJK4Jtpvl0AmoakhBImvm0g3Bf3RYSuR3c&itid=gfta"
  },
  {
    "text": "FBI informant who made up Biden bribe story gets 6 years in prison  —  Alexander Smirnov pleaded guilty to lying to the FBI about the Bidens accepting $10M in bribes from Ukrainian gas company Burisma  —  A former FBI informant who prosecutors say fabricated a phony story of President Biden … ",
    "url": "https://www.foxnews.com/politics/fbi-informant-who-made-up-biden-bribe-story-gets-6-years-prison"
  },
  {
    "text": "Readout of President Joe Biden's Call with President Joseph Aoun of Lebanon  —  President Joseph R. Biden, Jr. spoke today with President Joseph Aoun of Lebanon to congratulate him on his election victory.  The Presidents agreed that the time is now to fully implement the cessation … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2025/01/09/readout-of-president-joe-bidens-call-with-president-joseph-aoun-of-lebanon/"
  },
  {
    "text": "Elon Musk is the new emperor of misinformation  —  Here's the latest from Elon Musk about the LA wildfires:  —  Every single thing on this list is either badly misleading or flat-out wrong:  — Reservoirs and emergency water tanks were all full before the fires started.",
    "url": "https://jabberwocking.com/elon-musk-is-the-new-emperor-of-misinformation/"
  },
  {
    "text": "The '90s weren't that great  —  Today's guest post is from the author of Cartoons Hate Her, a Substack about social dynamics (including parenting, marriage, sex and friendship) from the hybrid mind of a terminally online sicko and a normie liberal mom.  —  Subscribe to Cartoons Hate Her",
    "url": "https://www.slowboring.com/p/the-90s-werent-that-great"
  },
  {
    "text": "Can Trump buy Greenland?  Technically, yes.  Here are his options.  —  Here is what the president-elect can do with the autonomous territory.  —  Donald Trump's gambit to buy Greenland may sound ridiculous, but it's not impossible.  —  If the president-elect is really determined to control … ",
    "url": "https://www.politico.com/news/2025/01/09/can-america-buy-another-country-00197197"
  },
  {
    "text": "Pennsylvania GOP Rep. Meuser considering run for governor  —  Rep. Dan Meuser (R-Pa.) signaled he is seriously considering challenging Pennsylvania Gov. Josh Shapiro (D) for his post in 2026.  —  “I'm considering it,” Meuser told The Hill on Thursday.  “I mean if I get in it's … ",
    "url": "https://thehill.com/homenews/house/5077570-pennsylvania-meuser-considering-governor/"
  }
]