[
  {
    "text": "Musk associates sought to use critical Treasury payment system to shut down USAID spending, emails show  —  Four days after Donald Trump's inauguration, Elon Musk's top lieutenants at the Treasury Department asked its acting secretary, a career civil servant, to immediately shut off … ",
    "url": "https://www.cnn.com/2025/02/06/politics/elon-musk-treasury-department-payment-system/"
  },
  {
    "text": "Treasury Sought to Freeze Foreign Aid Payments, Emails Show  —  Trump administration appointees and allies of Elon Musk wanted to use the Treasury's sensitive payment system to block payments.  —  In the days after President Trump took office, as Elon Musk's team began pressing for access … ",
    "url": "https://www.nytimes.com/2025/02/06/us/politics/trump-musk-usaid.html?unlocked_article_code=1.u04.p2X0.ZI_szXqrqAzZ&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Elon Musk's DOGE is feeding sensitive federal data into AI to target cuts  —  At the Department of Education, the tech billionaire's team has turned to artificial intelligence to hunt for potential spending cuts —  part of a broader plan to deploy the technology across the federal government.",
    "url": "https://www.washingtonpost.com/nation/2025/02/06/elon-musk-doge-ai-department-education/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM4ODE4MDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQwMjAwMzk5LCJpYXQiOjE3Mzg4MTgwMDAsImp0aSI6ImQ5ODQzODVkLTBlMTItNDJjNi1iNWE0LWZhOWEzZmYzY2UzMyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb24vMjAyNS8wMi8wNi9lbG9uLW11c2stZG9nZS1haS1kZXBhcnRtZW50LWVkdWNhdGlvbi8ifQ.b0SqsMdUOLZwTDLjLXDMh_15BHPto1JGxkf68AwGOZE"
  },
  {
    "text": "Musk's DOGE agents access sensitive personnel data, alarming security officials  —  The highly restricted data includes personally identifiable information for millions of federal employees maintained by the Office of Personnel Management.",
    "url": "https://www.washingtonpost.com/national-security/2025/02/06/elon-musk-doge-access-personnel-data-opm-security/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM4ODE4MDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQwMjAwMzk5LCJpYXQiOjE3Mzg4MTgwMDAsImp0aSI6IjMzY2FjZGU4LTk2YzUtNDMwNy1hYzhkLTU4NDE2NDE5NmY2YyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb25hbC1zZWN1cml0eS8yMDI1LzAyLzA2L2Vsb24tbXVzay1kb2dlLWFjY2Vzcy1wZXJzb25uZWwtZGF0YS1vcG0tc2VjdXJpdHkvIn0.nWJSbAT-3T8RS0msHLffPMldiE4oia6wMlED6HyqDdk&itid=gfta"
  },
  {
    "text": "Trump announces task force to ‘eradicate anti-Christian bias’  —  President Trump announced plans Thursday to establish a task force and a presidential commission to protect Christians from religious discrimination.  —  Trump addressed the National Prayer Breakfast in Washington, D.C. … ",
    "url": "https://thehill.com/homenews/administration/5130103-trump-national-prayer-breakfast-religious-discrimination-task-force-anti-christian-bias/"
  },
  {
    "text": "Deadline for Trump's federal worker buyout proposal temporarily blocked by judge  —  Washington — A federal judge on Thursday temporarily blocked the Office of Personnel Management's deadline for federal employees to accept the Trump administration's “deferred resignation” offer.",
    "url": "https://www.cbsnews.com/news/judge-temporarily-blocks-implementation-deferred-resignation-program/"
  },
  {
    "text": "Musk aims to hobble federal workers ahead of ‘buyout’ deadline  —  Countless staffers in the government are now grappling with what to do.  —  Elon Musk has declared war on the bureaucracy.  And as a Thursday deadline nears for federal employees to take a “buyout,” he is looking to demoralize and wear down his enemy.",
    "url": "https://www.politico.com/news/2025/02/06/federal-workers-musk-buyout-fears-00202768"
  },
  {
    "text": "A.G. Pam Bondi says Trump sets DOJ policy, all DOJ lawyers are “his lawyers”  —  Shortly after being sworn into office on Wednesday, Attorney General Pam Bondi went from the Oval Office to the Justice Department to do President Donald Trump's bidding.  —  Immediately issuing a series of orders … ",
    "url": "https://www.lawdork.com/p/ag-pam-bondi-says-trump-sets-doj"
  },
  {
    "text": "Pam Bondi Instructs Trump DOJ to Criminally Investigate Companies That Do DEI  —  On Wednesday evening, newly installed Attorney General Pam Bondi sent staff in several divisions of the Department of Justice more than a dozen memos within a 15-minute span, laying out the agency's new policies … ",
    "url": "https://slate.com/news-and-politics/2025/02/pam-bondi-trump-doj-memo-prosecute-dei-companies.html"
  },
  {
    "text": "Rubio acting director of the National Archives  —  In addition to being the Secretary of State and the acting director of USAID, Marco Rubio is also the acting archivist of the United States, according to a high-level official.  —  Per the official, Rubio has been the acting archivist since shortly … ",
    "url": "https://abcnews.go.com/Politics/live-updates/trump-second-term-live-updates/?id=118389757&entryId=118517407&cid=social_twitter_abcn"
  },
  {
    "text": "National Archives Workers Unsure If Marco Rubio Has Secretly Been Their Boss for Weeks  —  Wednesday night, ABC News reported that Secretary of State Marco Rubio “has been the acting archivist” at the National Archives and Records Administration “since shortly after President Trump's inauguration.”",
    "url": "https://www.404media.co/national-archives-workers-unsure-if-marco-rubio-has-secretly-been-their-boss-for-weeks/"
  },
  {
    "text": "Trump team considers housing detained migrants in container offices  —  The Scoop  —  The Trump administration is in talks with a private shipping-container company to provide temporary space to house and process thousands of migrants slated for deportation, according to people familiar with the matter.",
    "url": "https://www.semafor.com/article/02/06/2025/trump-administration-container-company-to-provide-temporary-migrant-housing"
  },
  {
    "text": "DOGE Teen Owns ‘Tesla.Sexy LLC’ and Worked at Startup That Has Hired Convicted Hackers  —  Experts question whether Edward Coristine, a DOGE staffer who has gone by “Big Balls” online, would pass the background check typically required for access to sensitive US government systems.",
    "url": "https://www.wired.com/story/edward-coristine-tesla-sexy-path-networks-doge/"
  },
  {
    "text": "White House Preparing Order to Cut Thousands of Federal Health Workers  —  The executive order could come as soon as next week, if the Trump administration goes ahead with plans  —  The White House is working on an executive order to fire thousands of U.S. Department of Health and Human Services workers … ",
    "url": "https://www.wsj.com/health/healthcare/white-house-preparing-order-to-cut-thousands-of-federal-health-workers-bd1e0b7f?st=jRECP9&reflink=article_copyURL_share"
  },
  {
    "text": "Gutting USAID threatens billions of dollars for U.S. farms, businesses  —  U.S. businesses that sold goods and services to USAID are in limbo, including American farms dealing in rice, wheat and soybeans purchased as food aid.",
    "url": "https://www.washingtonpost.com/politics/2025/02/06/trump-usaid-money-american-farms/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM4ODE4MDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQwMjAwMzk5LCJpYXQiOjE3Mzg4MTgwMDAsImp0aSI6IjYwZGFiZDMzLWE4M2YtNGUyNS04ODc0LTdlNmQ1MTRjZjQyZCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzAyLzA2L3RydW1wLXVzYWlkLW1vbmV5LWFtZXJpY2FuLWZhcm1zLyJ9.IzZA6sOcleD0rgo0U0wUkl9lwBWO80i7ZXuywtWQkaM"
  },
  {
    "text": "JD Vance accidentally directed us to a crucial moral question  —  Theology isn't usually part of the job description for America's vice president, but that's not stopping JD Vance from giving it a try just a couple of weeks into his new position.  —  In a Fox News segment on immigration … ",
    "url": "https://www.vox.com/future-perfect/398460/jd-vance-ordo-amoris-order-love-christianity-catholic-charity"
  },
  {
    "text": "Why CBS stands at the epicenter of Trump's assault on the media  —  The television news magazine 60 Minutes — the most storied and profitable show in the history of CBS News — currently finds itself as the avatar of President Trump's onslaught against the media in the courts and the court of public opinion.",
    "url": "https://www.npr.org/2025/02/06/nx-s1-5288181/why-cbs-stands-at-the-epicenter-of-trumps-assault-on-the-media"
  },
  {
    "text": "US immigration is gaming Google to create a mirage of mass deportations  —  Thousands of press releases about decade-old enforcement actions topped search results, all updated with a timestamp from after Trump's inauguration  —  News of mass immigration arrests has swept across the US over the past couple of weeks.",
    "url": "https://www.theguardian.com/us-news/2025/feb/06/ice-us-immigration-deportations-google"
  },
  {
    "text": "Memory-Holing Jan. 6: What Happens When You Try to Make History Vanish?  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up to receive our biggest stories as soon as they're published.  —  On Jan. 10, the U.S. Department of Justice released a 123-page report … ",
    "url": "https://www.propublica.org/article/january-6-erasure-doj-database-trump-history"
  },
  {
    "text": "Trump to sign an executive order sanctioning the International Criminal Court  —  The order will include financial sanctions and visa restrictions against ICC officials found to have assisted in ICC investigations of U.S. citizens or allies.  —  WASHINGTON — President Donald Trump on Thursday … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-executive-order-sanctioning-international-criminal-court-rcna191018"
  },
  {
    "text": "Trump's Attacks on DEI Get Approval From Some in the Left Wing  —  Many Democrats and activists are rallying to defend diversity programs, but others say they distract from deeper efforts to address inequality.  —  A few days after President Trump issued an order urging the private sector to end … ",
    "url": "https://www.nytimes.com/2025/02/06/business/economy/trump-dei-democrats-left-unions.html"
  },
  {
    "text": "The Oligarchs Who Came to Regret Supporting Hitler  —  They helped him in pursuit of profit.  Many ended up in concentration camps.  —  he was among the richest men in the world.  He made his first fortune in heavy industry.  He made his second as a media mogul.",
    "url": "https://www.theatlantic.com/ideas/archive/2025/02/hitler-oligarchs-hugenberg-nazi/681584/"
  },
  {
    "text": "Judge rails against Trump in blocking birthright executive order for second time  —  A second federal judge blocked President Trump's executive order that would restrict birthright citizenship, harshly condemning the administration for attempting to do so at a Thursday hearing.",
    "url": "https://thehill.com/regulation/court-battles/5130744-trump-judge-birthright-order-blocked/"
  },
  {
    "text": "The Senate's Dilemma: Kash Patel and the Purging of the FBI  —  In the days since Kash Patel's nomination hearing for F.B.I. director, a crisis of historic proportions has engulfed the Justice Department and the Bureau.  The idea of Patel leading the F.B.I. through this period … ",
    "url": "https://www.justsecurity.org/107507/senates-confirmation-patel-purge-fbi/"
  },
  {
    "text": "Treasury Targets Oil Network Generating Hundreds of Millions of Dollars for Iran's Military  —  WASHINGTON — Today, the Department of the Treasury's Office of Foreign Assets Control (OFAC) is sanctioning an international network for facilitating the shipment of millions of barrels … ",
    "url": "https://home.treasury.gov/news/press-releases/sb0015"
  }
]