[
  {
    "text": "Trump's Truth Social is going public after winning DWAC merger vote … - As Axios reported earlier today, this ends a multiyear saga that's included civil lawsuits, criminal lawsuits, closing extensions and vote postponements.",
    "url": "https://www.axios.com/2024/03/22/trump-truth-social-dwac-merger-public"
  },
  {
    "text": "Why Trump's big Wall Street payday won't bail him out of financial trouble  —  The approval from investors would come as Trump faces a severe financial crunch: He's been hit with more than $500 million in civil penalties, not to mention ongoing legal fees as he appeals verdicts against him.",
    "url": "https://www.politico.com/news/2024/03/22/trump-truth-social-money-financial-troubles-00148456"
  },
  {
    "text": "Trump's lawsuit against ABC is not the flex he thinks it is  —  In a sane world, the underlying facts would be disqualifying. … As if Trump wasn't already spending enough donor money defending himself against a truly staggering number of civil and criminal lawsuits, he just inexplicably decided … ",
    "url": "https://www.publicnotice.co/p/trump-defamation-lawsuit-abc-stephanopoulos"
  },
  {
    "text": "The Publicly-Traded Presidential Candidate  —  We've all been focused lately on a question appropriate for Schadenfriday: How is Donald Trump going to post a $450+ million bond to cover his appeal in the New York civil fraud case?  The clock is ticking, and Trump claims he doesn't have the ability to post it.",
    "url": "https://statuskuo.substack.com/p/the-publicly-traded-presidential"
  },
  {
    "text": "The Case For 2024 Optimism  —  Biden's got a lot of upside potential, Trump's got a lot of downside risk.  —  The short version is that over the past couple weeks President Biden has caught up with Donald Trump, as depicted in the Economist's polling average above.",
    "url": "https://www.offmessage.net/p/case-for-2024-optimism-biden-trump"
  },
  {
    "text": "CNN Polls: Majority of voters in Michigan and Pennsylvania are dissatisfied with their presidential choices  —  Voters in Michigan and Pennsylvania - two states that flipped from red to blue in the 2020 presidential election - begin this year's general election campaign more dissatisfied … ",
    "url": "https://www.cnn.com/2024/03/22/politics/cnn-poll-michigan-pennsylvania/"
  },
  {
    "text": "Ken Buck's parting gift to GOP: Signing Democrats' Ukraine discharge petition … - The measure needs 218 signatures to force a vote, however, and many progressives have said they won't sign onto it.  — Rep. Brian Fitzpatrick (R-Pa.) has a competing discharge petition on a $66 billion munitions … ",
    "url": "https://www.axios.com/2024/03/21/ken-buck-ukraine-discharge-petition"
  },
  {
    "text": "House passes $1.2 trillion spending bill, sending it to Senate hours before shutdown  —  Conservatives in the House Freedom Caucus were furious about the legislation and blamed Speaker Mike Johnson, but stopped short of threatening his job.  —  WASHINGTON — The House voted 286-134 Friday … ",
    "url": "https://www.nbcnews.com/politics/congress/house-senate-shutdown-vote-rcna144440"
  },
  {
    "text": "They don't want want this miracle™ to exist  —  It was four years ago today.  After about 34 hours inside Ann Arbor's St. Joseph Mercy Hospital and a lifetime of heroic pushing by my wife, my daughter was born.  She, like every newborn, was a miracle™.  That's the cliche™.",
    "url": "https://thecause.substack.com/p/they-dont-want-want-my-daughter-to"
  },
  {
    "text": "Marjorie Taylor Greene files motion to remove Speaker Mike Johnson … - Johnson's predecessor, Rep. Kevin McCarthy (R-Calif.), became the first House speaker to be ousted after hardline Republicans triggered a motion to vacate against him last year.  — Greene's move came after she voiced … ",
    "url": "https://www.axios.com/2024/03/22/majorie-taylor-greene-mike-johnson-vacate-motion"
  },
  {
    "text": "Congressman apologizes for using racial slur instead of saying ‘bugaboo’  —  U.S. Senate hopeful Rep. David Trone (D-Md.) made the comment while discussing tax rates in a budget hearing  —  Senate hopeful Rep. David Trone (D) used a racial slur during a congressional budget hearing Thursday … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2024/03/21/david-trone-congress-racial-insult/"
  },
  {
    "text": "Inside Garland's Effort to Prosecute Trump  —  In trying to avoid even the smallest mistakes, Attorney General Merrick B. Garland might have made one big one: ending up in a race against the clock.  —  After being sworn in as attorney general in March 2021, Merrick B. Garland gathered … ",
    "url": "https://www.nytimes.com/2024/03/22/us/politics/trump-jan-6-merrick-garland.html"
  },
  {
    "text": "Ronna McDaniel, Former R.N.C. Chair, Joins NBC News  —  Her new role as a commentator on NBC and MSNBC programs comes shortly after she stepped down as the leader of the Republican National Committee.  —  Ronna McDaniel, who stepped down as chairwoman of the Republican National Committee this month … ",
    "url": "https://www.nytimes.com/2024/03/22/business/media/ronna-mcdaniel-nbc-msnbc.html"
  },
  {
    "text": "Obama Feared a ‘One-Term Presidency’ After Passing Health Care Law  —  A set of oral histories released on Friday documents the behind-the-scenes drama of President Barack Obama's drive to pass the Affordable Care Act, his most important legislative achievement.",
    "url": "https://www.nytimes.com/2024/03/22/us/politics/obama-obamacare-oral-history.html"
  },
  {
    "text": "Trump Would Break the Budget  —  No one is talking enough about one of the most important policy choices at stake in this election.  —  A decision Donald Trump made in his first presidential term has triggered one of the most important policy choices at stake in this year's election.",
    "url": "https://www.theatlantic.com/ideas/archive/2024/03/trump-2017-tax-cuts-2025-expiration/677846/"
  },
  {
    "text": "Candace Owens Stumped by Basic Black History Quiz  —  The conservative commentator missed an opportunity to score a few likability points with the Black community this week on ‘The Breakfast Club.’  —  The day before Daily Wire ended their relationship with the often controversial right-wing commentator … ",
    "url": "https://www.thedailybeast.com/candace-owens-stumped-by-basic-black-history-quiz-on-the-breakfast-club"
  },
  {
    "text": "Farah Griffin: There's ‘no question’ Trump would accept money from Russian oligarchs  —  Former White House communications director Alyssa Farah Griffin said there is “no question” that former President Trump would accept money from foreign sources to secure the funds needed in his civil fraud case.",
    "url": "https://thehill.com/regulation/court-battles/4549368-farah-griffin-theres-no-question-trump-would-accept-money-from-russian-oligarchs/"
  },
  {
    "text": "Blinken unloads on Bibi: “You need a coherent plan” or face disaster in Gaza … - But he warned that on the current trajectory, without a clear plan for the day after the war, Israel will be left with a major insurgency it can't handle.  — “You need a coherent plan … ",
    "url": "https://www.axios.com/2024/03/22/israel-gaza-netanyahu-blinken-insurgency-warning"
  },
  {
    "text": "US urged Ukraine to halt strikes on Russian oil refineries  —  Washington told Kyiv that drone attacks risk driving up crude prices and provoking retaliation  —  The US has urged Ukraine to halt attacks on Russia's energy infrastructure, warning the drone strikes risk driving up global oil prices … ",
    "url": "https://www.ft.com/content/98f15b60-bc4d-4d3c-9e57-cbdde122ac0c"
  }
]