[
  {
    "text": "Trump attorney who became a crucial witness against him has departed legal team  —  Evan Corcoran, an attorney for Donald Trump who became a critical witness in the classified documents case against the former president, no longer represents him, CNN has learned.",
    "url": "https://www.cnn.com/2024/04/11/politics/evan-corcoran-trump-legal"
  },
  {
    "text": "Playbook: Harris takes the gloves off in Arizona  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  BIG PRETRIAL READ — “How Donald Trump Gets Special Treatment in the Legal System,” by James Romoser in POLITICO Magazine: “He denigrates prosecutors.",
    "url": "https://www.politico.com/newsletters/playbook/2024/04/12/harris-takes-the-gloves-off-in-arizona-00151930"
  },
  {
    "text": "How Donald Trump Gets Special Treatment in the Legal System  —  The former president rails against a “two-tiered system of justice.”  But he's the one benefiting from it.  —  A firebrand politician named Donald is about to stand trial.  Just a few days before jury selection, he goes on TV to slam the charges as baseless and biased.",
    "url": "https://www.politico.com/news/magazine/2024/04/12/trump-trial-special-treatment-justice-system-00151814"
  },
  {
    "text": "Leo rejects Senate subpoena from panel probing gifts to Supreme Court justices  —  The conservative judicial activist called the move ‘politically motivated,’ and the committee chair said Leo had left them ‘no other choice’ but to move forward with the compulsory process",
    "url": "https://www.washingtonpost.com/politics/2024/04/11/leonard-leo-subpoena-senate-supreme-court-gifts/"
  },
  {
    "text": "Senate Republicans furious over Trump trying to derail FISA bill  —  Senate Republicans vented their frustration after former President Trump helped derail a compromise House bill to extend Foreign Intelligence Surveillance Act (FISA) authority, sending lawmakers scrambling to find a Plan B … ",
    "url": "https://thehill.com/homenews/senate/4589449-senate-republicans-furious-over-trump-derailing-fisa-bill/"
  },
  {
    "text": "A Trump raising money off election lies?  Now we've seen everything.  —  A phone call on behalf of the overhauled Republican National Committee again turns false claims about 2020 into a sales pitch  —  Donald Trump managed to vacuum up hundreds of millions of dollars of donations as a lame-duck president.",
    "url": "https://www.washingtonpost.com/politics/2024/04/11/trump-election-fraud-fundraising/"
  },
  {
    "text": "Republicans say a late convention could keep Biden off some ballots.  It hasn't mattered before.  —  Technical conflicts between ballot deadlines and convention dates have been handled quietly in the past.  Some GOP officials are taking a different tack this year.",
    "url": "https://www.nbcnews.com/politics/2024-election/republicans-say-late-convention-keep-biden-ballots-hasnt-mattered-rcna147213"
  },
  {
    "text": "Trump's Brain Is Not Okay  —  An expert's view of Trump's mental slide into dementia.  —  The Big Picture and Jay Kuo … When Duty to Warn began in 2017, our mission as mental health professionals was to warn the world that Trump was dangerously unfit and a malignant narcissist.",
    "url": "https://thinkbigpicture.substack.com/p/john-gartner-trump-cognitive-decline"
  },
  {
    "text": "Republican state representative left a loaded handgun in Colorado Capitol bathroom  —  A Republican state representative left a loaded, semiautomatic handgun in a bathroom at the Colorado Capitol on Tuesday night, an incident that comes as Democrats are trying to ban firearm possession in the building — and the GOP is fighting them.",
    "url": "https://coloradosun.com/2024/04/11/colorado-capitol-gun-don-wilson/"
  },
  {
    "text": "What Donald Trump wants in his next vice president — and who he's considering  —  Donald Trump's perfect vice president looks the part: attractive and telegenic.  They are ideally Black or a woman, though that's not required.  And they are most certainly not taller than Trump himself.",
    "url": "https://www.washingtonpost.com/politics/2024/04/12/trump-vice-president-running-mate/"
  },
  {
    "text": "Colorado group says it has enough signatures for abortion rights ballot measure this fall  —  A Colorado campaign that's trying to enshrine abortion rights into the state's constitution has gathered enough signatures to put the issue on the ballot this November, CBS News has learned.",
    "url": "https://www.cbsnews.com/news/colorado-abortion-access-ballot-measure-signatures/"
  },
  {
    "text": "Republicans remain terrible at picking Senate candidates  —  Tim Sheehy and Kari Lake are the new Blake Masters and Herschel Walker. … Republican Montana Senate candidate Tim Sheehy spent last week confirming that he's a liar, which is not exactly how you want to spend your week as a Senate candidate.",
    "url": "https://www.publicnotice.co/p/tim-sheehy-republican-candidate-quality-2024"
  },
  {
    "text": "Security Alert:  U.S. Embassy Jerusalem (April 11, 2024)  —  Location:  Israel, the West Bank, and Gaza  —  The U.S. Embassy in Jerusalem reminds U.S. citizens of the continued need for caution and increased personal security awareness as security incidents often … ",
    "url": "https://il.usembassy.gov/security-alert-u-s-embassy-jerusalem-april-11-2024/"
  },
  {
    "text": "Harvard and Caltech Will Require Test Scores for Admission  —  The universities are the latest highly selective schools to end their policies that made submitting SAT or ACT scores optional.  —  Harvard will reinstate standardized testing as a requirement of admission, the university announced Thursday … ",
    "url": "https://www.nytimes.com/2024/04/11/us/harvard-test-scores-admissions.html"
  },
  {
    "text": "An Honest Assessment of Rural White Resentment Is Long Overdue … Something remarkable happened among rural whites between the 2016 and 2020 elections: According to the Pew Research Center's validated voter study, as the rest of the country moved away from Donald Trump … ",
    "url": "https://newrepublic.com/article/180570/trump-rural-white-resentment-honest-assessment"
  },
  {
    "text": "Trump Meeting With Johnson Is Meant to Quell House GOP Disarray  —  Speaker's job is on the line amid revolt by conservatives.  'We don't need any more reason to be polarized.'  —  WASHINGTON—House Speaker Mike Johnson, with no shortage of problems at the Capitol, is taking a quick spring break to Florida.",
    "url": "https://www.wsj.com/politics/policy/trump-house-speaker-johnson-meeting-91b78284"
  },
  {
    "text": "Covid vaccines not linked to fatal heart problems in young people, CDC finds  —  The new report debunks widespread misinformation that the mRNA shots were connected to sudden cardiac death in young athletes.  —  There is no evidence that mRNA Covid vaccines cause fatal cardiac arrest … ",
    "url": "https://www.nbcnews.com/health/health-news/cdc-finds-covid-vaccines-not-linked-sudden-death-young-people-rcna147188"
  },
  {
    "text": "Measles could once again become endemic in the US, the CDC warns  —  This year's measles cases are over 17x higher than cases seen in the first quarters of 2000 to 2023.  —  In 2000, after a decadeslong public health battle and a Herculean vaccination program, the US won a coveted status: measles elimination.",
    "url": "https://arstechnica.com/science/2024/04/measles-could-once-again-become-endemic-in-the-us-the-cdc-warns/"
  },
  {
    "text": "Third South Dakota tribal nation bans Noem from reservation  —  The Standing Rock Sioux Tribe has become the third tribal nation to ban South Dakota Kristi Noem (R) from its reservation land.  —  On Wednesday, the Standing Rock Tribal Council voted to ban Noem from its land for “racially charged” … ",
    "url": "https://thehill.com/homenews/state-watch/4589622-third-south-dakota-tribal-nation-bans-noem-from-reservation/"
  },
  {
    "text": "Former Obama adviser: Kushner engaged in 'level of corruption that we've just never seen' with foreign relations  —  Former Obama deputy national security adviser Ben Rhodes said President Trump's son-in-law Jared Kushner engaged in a “level of corruption that we've just never seen” … ",
    "url": "https://thehill.com/policy/international/4589465-former-obama-advisor-kushner-engaged-in-level-of-corruption-that-weve-just-never-seen-with-foreign-relations/"
  },
  {
    "text": "Scoop: DNC covered Biden legal bills in special counsel probe … - In January 2023, special counsel Robert Hur began investigating Biden's handling of classified documents after papers from Biden's vice presidency were found at his office and home.  — From July 2023 to February 2024 … ",
    "url": "https://www.axios.com/2024/04/12/dnc-covered-biden-legal-bills-special-counsel-probe"
  },
  {
    "text": "Man on terror watchlist was released by Border Patrol  —  With border security funding blocked in Congress, the case illustrates the challenges U.S. officials face in identifying migrants who may pose national security threats.  —  SAN ANTONIO — An Afghan migrant on the terrorist watchlist spent nearly … ",
    "url": "https://www.nbcnews.com/investigations/man-terror-watchlist-remains-us-released-border-patrol-rcna147192"
  },
  {
    "text": "Facebook's AI failure wiped out Kansas Reflector links.  Even Facebook may not know what went wrong.  —  When Kansas Reflector tried to share Dave Kendall's opinion column about a climate change movie, Facebook responded with a cascade of failures.  Facebook apologized for blocking Kansas Reflector … ",
    "url": "https://kansasreflector.com/2024/04/11/facebooks-ai-failure-wiped-out-kansas-reflector-links-even-facebook-may-not-know-what-went-wrong/"
  },
  {
    "text": "House Speaker Mike Johnson is negotiating with White House to advance Ukraine aid  —  House Speaker Mike Johnson is negotiating with the White House as he prepares for the treacherous task of advancing wartime funding for Ukraine and Israel through the House, a top House Republican said Thursday.",
    "url": "https://apnews.com/article/ukraine-aid-congress-white-house-speaker-johnson-97e33b40a1fc244f8c001715b974d1f9"
  },
  {
    "text": "Trump's Big Lie About Biden Implodes After MAGA Ally Admits Truth  —  Steve Bannon no doubt thought he was being deviously clever.  Speaking with The New York Times this week, he elaborated on a sophisticated plan that Donald Trump's allies have developed for boosting third-party candidates, so they siphon votes from President Biden.",
    "url": "https://newrepublic.com/article/180617/steve-bannon-trump-lies-biden-jill-stein"
  },
  {
    "text": "Maine Reps Ruled Out of Order for Blaming Mass Shooting on Abortion Bill  —  ‘EXTREMELY OFFENSIVE’  —  The House Democratic office called the comments “as asinine as they are reprehensible.”  —  A pair of Republican lawmakers in Maine were ruled out of order on Thursday after one of them tried … ",
    "url": "https://www.thedailybeast.com/maine-reps-ruled-out-of-order-for-blaming-lewiston-shooting-on-abortion-bill"
  }
]