[
  {
    "text": "Trump White House reverses course, rescinds freeze on federal grants  —  The budget office came under immense pressure over the impacts on a sudden pause in key government spending  —  The White House budget office on Wednesday rescinded an order freezing federal grants … ",
    "url": "https://www.washingtonpost.com/business/2025/01/29/white-house-budget-office-spending-freeze/"
  },
  {
    "text": "Another judge is preparing to block Trump's spending freeze, despite White House cleanup  —  U.S. District Judge Jack McConnell said a bid by the White House to rescind a “hugely ambiguous” order implementing the freeze appeared to be undercut by White House press secretary Karoline Leavitt's … ",
    "url": "https://www.politico.com/news/2025/01/29/spending-freeze-blocked-trump-judge-00201341"
  },
  {
    "text": "White House rescinds Trump's funding freeze after massive backlash  —  The White House Office of Management and Budget (OMB) rescinded a memo Wednesday that had ordered a “temporary pause” on federal funding and unleashed major confusion across the country.",
    "url": "https://www.axios.com/2025/01/29/federal-funding-freeze-memo-rescinded"
  },
  {
    "text": "White House says Trump funding freeze remains in effect despite rescinding OMB memo … The White House on Wednesday said a “federal funding freeze” remains in “full force and effect” despite it rescinding a controversial memo ordering that freeze on grants and loans to give agencies … ",
    "url": "https://www.cnbc.com/2025/01/29/white-house-rescinds-federal-funds-freeze-memo.html"
  },
  {
    "text": "Tracker: Legal Challenges to Trump Administration Actions  —  This public resource tracks legal challenges to Trump administration actions.  If you think we are missing anything, you can email us at lte@justsecurity.org.  Special thanks to Just Security Student Staff Editors Rick Da and Jeremy Venook.",
    "url": "https://www.justsecurity.org/107087/tracker-legal-challenges-trump-administration-actions/"
  },
  {
    "text": "Trump administration rescinds order attempting to freeze federal aid spending  —  The move comes just one day after the order was issued and a federal district judge temporarily halted it.  —  President Donald Trump's administration on Wednesday rescinded an order that attempted to freeze … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-administration-rescinds-order-attempting-freeze-federal-aid-spen-rcna189852"
  },
  {
    "text": "The Trump White House Wants A Court Challenge Over Frozen Funds  —  An internal OMB document shows that it is official administration policy to block funding to provoke a constitutional challenge.  —  LOADING  —  The Trump administration's federal government funding freeze instituted Monday … ",
    "url": "https://www.huffpost.com/entry/donald-trump-omb-funding-freeze-courts_n_679a8d92e4b02e7053bf8d23"
  },
  {
    "text": "New memo, White House response adds to confusion on federal funding freeze  —  The Office of Management and Budget has rescinded its call for a pause on federal assistance, according to the agency's memo shared by Democracy Forward, which led a legal challenge over the effort.",
    "url": "https://www.npr.org/2025/01/29/g-s1-45313/trump-federal-funding-freeze-reversed"
  },
  {
    "text": "Trump Signs Agreement Calling for Meta to Pay $25 Million to Settle Suit  —  The president had sued the social-media company after his accounts were suspended  —  President Trump has signed settlement papers that are expected to require Meta Platforms to pay roughly $25 million to resolve … ",
    "url": "https://www.wsj.com/us-news/law/trump-signs-agreement-calling-for-meta-to-pay-25-million-to-settle-suit-6f734c8c?st=7ms8uR&reflink=article_imessage_share"
  },
  {
    "text": "Trump signs settlement agreement with Meta, source says  —  President Trump signed a settlement agreement at the White House Wednesday to end the lawsuit he brought against Meta after the company suspended his account in the aftermath of the January 6 attack on the Capitol, according to a person familiar with the matter.",
    "url": "https://www.cnn.com/2025/01/29/business/trump-meta-settlement/"
  },
  {
    "text": "X and Meta Scramble to Settle With Trump  —  Facebook's parent company has reached a $25 million deal with the president, and Elon Musk's platform says it's negotiating its own settlement.  —  Donald Trump spent decades in business gleefully suing and angrily being sued by his adversaries in civil court.",
    "url": "https://www.theatlantic.com/politics/archive/2025/01/trump-meta-x-settlements/681503/"
  },
  {
    "text": "Trump to build mass detention camp for deportees at Guantánamo Bay  —  The president said he will issue an executive order to construct a detention camp with room for 30,000 migrants on the U.S. naval base in Cuba.  —  President Donald Trump said he will order the construction … ",
    "url": "https://www.washingtonpost.com/immigration/2025/01/29/guantanamo-cuba-el-salvador-deportations/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM4MTI2ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM5NTA5MTk5LCJpYXQiOjE3MzgxMjY4MDAsImp0aSI6Ijc5NTk4MzkyLTdkMzctNGM3YS1hZWI3LThmYWM3YTZiYmExNSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9pbW1pZ3JhdGlvbi8yMDI1LzAxLzI5L2d1YW50YW5hbW8tY3ViYS1lbC1zYWx2YWRvci1kZXBvcnRhdGlvbnMvIn0.p6vAFrI-7mf90ewNMEqKF2Ey47OMu5V1dELEze-eXwM&itid=gfta"
  },
  {
    "text": "Trump plans to sign the Laken Riley Act into law as his administration's first piece of legislation  —  President Donald Trump said Wednesday that he is directing the opening of a detention center at Guantanamo Bay to hold up to 30,000 migrants who are living illegally in the United States.",
    "url": "https://apnews.com/article/trump-signs-laken-riley-act-immigration-crackdown-30a34248fa984d8d46b809c3e6d8731a"
  },
  {
    "text": "USDA inspector general escorted out of her office after defying White House  —  Security agents escorted the inspector general of the U.S. Department of Agriculture out of her office on Monday after she refused to comply with her firing by the Trump administration, sources familiar with the matter told Reuters.",
    "url": "https://www.usatoday.com/story/news/politics/2025/01/29/usda-inspector-general-escorted-office-trump-white-house/78024513007/"
  },
  {
    "text": "Trump's First Big Fiasco Triggers Stephen Miller's Rage—Take Note Dems  —  Admitting failure is anathema to the authoritarian leader, who is perpetually in danger of being diminished by those who are resentful of his glory—which is why White House adviser Stephen Miller is frantically searching … ",
    "url": "https://newrepublic.com/article/190875/trump-stephen-miller-rage-democratss"
  },
  {
    "text": "Throw Biden under the bus  —  When Joe Biden stepped aside in favor of Kamala Harris, the overwhelming majority of Democrats praised him for the decision and painted an overall flattering portrait of Biden's presidency and his career.  I think that was the right way to approach the situation.",
    "url": "https://www.slowboring.com/p/throw-biden-under-the-bus"
  },
  {
    "text": "Justice Dept. Is Said to Discuss Dropping Case Against Eric Adams  —  Senior officials under President Trump have talked with prosecutors in Manhattan about the possibility of abandoning the corruption case against Mr. Adams, the mayor of New York City.  —  Senior Justice Department officials … ",
    "url": "https://www.nytimes.com/2025/01/29/us/politics/justice-department-trump-charges-eric-adams.html?unlocked_article_code=1.s04.B-oP.OpKu5OrpcZNe&smid=url-share"
  },
  {
    "text": "Federal-Worker Buyouts May Make Government As Broken As X  —  In the latest episode of what MAGA nihilist Steve Bannon joyfully predicted would be “Days of Thunder” from the new Trump administration, on Tuesday the United States Office of Personnel Management offered all federal employees a buyout offer wrapped in menacing threats.",
    "url": "https://nymag.com/intelligencer/article/federal-worker-buyouts-may-make-government-as-broken-as-x.html"
  },
  {
    "text": "RFK Jr. Completely Fumbles Basic Medicaid Facts at Hearing  —  That is not quite how Medicaid works, Mr. Kennedy.Robert F. Kennedy Jr. said Wednesday “most Americans are not happy” with Medicaid because “the premiums are too high,” suggesting he may be oblivious to the fact that Medicaid overwhelmingly does … ",
    "url": "https://www.thedailybeast.com/rfk-jr-completely-fumbles-basic-medicaid-facts-in-confirmation-hearing/"
  },
  {
    "text": "Former Sen. Bob Menendez sentenced to 11 years corruption and bribery case  —  Menendez resigned from the Senate after his conviction last year  —  Former U.S. Sen. Bob Menendez was sentenced Wednesday to 11 years in prison for selling his once-considerable clout in Washington for gold bars … ",
    "url": "https://www.nbcnewyork.com/new-jersey/former-new-jersey-senator-bob-menendez-sentence/6126544/"
  },
  {
    "text": "Declassified CIA Guide to Sabotaging Fascism Is Suddenly Viral  —  The World War II-era “Simple Sabotage Field Manual” is full of steps that office workers can take to resist leadership. … A declassified World War II-era government guide to “simple sabotage” is currently one of the most popular open source books on the internet.",
    "url": "https://www.404media.co/declassified-cia-guide-to-sabotaging-fascism-is-suddenly-viral/"
  },
  {
    "text": "DOJ moves to drop charges against former GOP lawmaker in case criticized by Trump  —  The step likely ends a legal saga that drove ex-Rep. Jeff Fortenberry from Congress over foreign donations.  —  The Justice Department has moved to drop its criminal prosecution of former Rep. Jeff Fortenberry … ",
    "url": "https://www.politico.com/news/2025/01/29/jeff-fortenberry-dismiss-charges-00201274"
  },
  {
    "text": "Trump administration to cancel student visas of pro-Palestinian protesters  —  U.S. President Donald Trump will sign an executive order on Wednesday to combat antisemitism and pledge to deport non-citizen college students and others who took part in pro-Palestinian protests, a White House official said.",
    "url": "https://www.reuters.com/world/us/trump-administration-cancel-student-visas-all-hamas-sympathizers-white-house-2025-01-29/"
  },
  {
    "text": "Governor Leaves Indiana's Predominantly Black University Out of Budget  —  Martin University had a short-lived burst of state funding.  But those funds disappeared in Governor Mike Braun's budget proposal, unveiled on the heels of an anti-DEI executive order.  One lawmaker calls it racist.",
    "url": "https://www.insidehighered.com/news/government/state-policy/2025/01/29/no-funds-black-university-indiana-governors-budget"
  },
  {
    "text": "$50 million for condoms in Gaza?  There's no evidence for the White House claim.  —  The figure would rain 1.5 billion condoms on an area only double the size of the District of Columbia.",
    "url": "https://www.washingtonpost.com/politics/2025/01/29/gaza-condoms-fact-checker-trump/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM4MTI2ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM5NTA5MTk5LCJpYXQiOjE3MzgxMjY4MDAsImp0aSI6Ijc2YTlkMWJkLWE2N2ItNDRmZS04ZGE0LWQyMWYyZTQzZWNhMiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzAxLzI5L2dhemEtY29uZG9tcy1mYWN0LWNoZWNrZXItdHJ1bXAvIn0.dHIfXdcSemgAnxCW-BESYD7j5dy2OEJtMvYvknK7tsg"
  },
  {
    "text": "Senate Democrats rip into RFK Jr.  —  Democrats on the Senate Finance Committee went on offense against Robert F. Kennedy Jr.'s past statements about vaccines, infectious disease and other health-related conspiracy theories.  In a heated exchange, Sen. Michael Bennet (D-Colo.) … ",
    "url": "https://www.politico.com/live-updates/2025/01/29/congress/senate-democrats-rfk-jr-hearing-00201229"
  },
  {
    "text": "Trump Begins Second Term Stronger Than The First, 6 In 10 Voters Approve Of Sending U.S. Troops To Southern Border, Quinnipiac University National Poll Finds; Majority Disapprove Of Elon Musk's Role In Trump Administration  —  mail_outline  —  President Donald Trump is starting his second term … ",
    "url": "https://poll.qu.edu/poll-release?releaseid=3918"
  },
  {
    "text": "The long-planned return of two astronauts from space is now a political issue … On Thursday NASA astronauts Suni Williams and Butch Wilmore are scheduled to don spacesuits to exit the International Space Station.  However, despite a plea from President Trump to bring them home as soon as possible … ",
    "url": "https://arstechnica.com/space/2025/01/the-long-planned-return-of-two-astronauts-from-space-is-now-a-political-issue/"
  }
]