[
  {
    "text": "Colorado Supreme Court bans Trump from the state's ballot under Constitution's insurrection clause  —  DENVER (AP) — The Colorado Supreme Court on Tuesday declared former President Donald Trump ineligible for the White House under the U.S. Constitution's insurrection clause and removed … ",
    "url": "https://apnews.com/article/trump-insurrection-14th-amendment-2024-colorado-d16dd8f354eeaf450558378c65fd79a2"
  },
  {
    "text": "Donald Trump is barred from Colorado's 2024 primary ballot, the state Supreme Court rules  —  In a historic decision Tuesday, the Colorado Supreme Court barred Donald Trump from running in the state's presidential primary after determining that he had engaged in insurrection on Jan. 6, 2021.",
    "url": "https://www.washingtonpost.com/politics/2023/12/19/trump-off-colorado-ballot/"
  },
  {
    "text": "Colorado Supreme Court kicks Trump off the state's 2024 ballot for violating the U.S. Constitution  —  The ruling marks the first time a 14th Amendment challenge to Trump's candidacy has been successful.  —  In a bombshell decision, Colorado's Supreme Court on Tuesday ruled … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/colorado-supreme-court-kicks-trump-states-2024-ballot-violating-us-con-rcna130484"
  },
  {
    "text": "Disqualifying Trump from the Ballot is a Step Too Far  —  The political case against Colorado's legal ruling  —  Colorado's Supreme Court ruled that Donald Trump can be disqualified from the presidential ballot on the basis of the 14th Amendment to the Constitution, which bars people … ",
    "url": "https://nymag.com/intelligencer/2023/12/colorado-court-trump-disqualified-ballot-insurrection-case-against.html"
  },
  {
    "text": "Will the U.S.Supreme Court Keep Donald Trump Off the Ballot ?  Some Initial Thoughts  —  I am traveling and so I offer only some brief and initial thoughts here about what the United States Supreme Court may and should do in light of the Colorado Supreme Court's determination that Donald Trump … ",
    "url": "https://electionlawblog.org/?p=140303"
  },
  {
    "text": "Playbook: SCOTUS steps into the 2024 spotlight  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  FIRST IN PLAYBOOK — DEAN PHILLIPS' presidential campaign is launching a new minutelong ad in New Hampshire starting today, titled “The New Hampshire Way,” … ",
    "url": "https://www.politico.com/newsletters/playbook/2023/12/20/scotus-steps-into-the-2024-spotlight-00132636"
  },
  {
    "text": "Sen. Thom Tillis moves to block other states from disqualifying Trump after Colorado decision  —  Sen. Thom Tillis, R-N.C., is moving to give the U.S. Supreme Court sole power to review presidential candidate qualifications after a controversial Colorado Supreme Court's decision … ",
    "url": "https://www.usatoday.com/story/news/politics/2023/12/20/tillis-bill-colorado-disqualifies-trump/71982452007/"
  },
  {
    "text": "How Ron DeSantis' $100 Million ‘Death Star’ Collapsed  —  The super PAC Never Back Down was supposed to win DeSantis the GOP nomination.  Instead, it became a political cautionary tale.  —  Long before Ron DeSantis' presidential ambitions began to falter, it was clear to anyone paying close attention … ",
    "url": "https://www.thedailybeast.com/how-ron-desantis-dollar100-million-death-star-never-back-down-super-pac-collapsed"
  },
  {
    "text": "How Christie became a ‘monumental problem’ for Haley - and a potential boon to Trump  —  The former New Jersey governor could complicate Nikki Haley's math in New Hampshire, some prominent Republicans say.  —  Chris Christie has singularly devoted his presidential campaign to tearing down Donald Trump.",
    "url": "https://www.politico.com/news/2023/12/20/chris-christie-nikki-haley-trump-spoiler-00132567"
  },
  {
    "text": "'Trump Knows What He's Doing': The Creator of Godwin's Law Says the Hitler Comparison Is Apt  —  The internet legend explains why the Biden campaign isn't wrong to compare Trump to Hitler.  —  Any time people start fighting on the internet, someone will inevitably reach for the Hitler comparison.",
    "url": "https://www.politico.com/news/magazine/2023/12/19/godwins-law-trump-hitler-00132427"
  },
  {
    "text": "Judge again turns over Rep. Perry's phone records to DOJ Jan. 6 probe  —  A federal judge turned over 75 percent instead of 90 percent of records the FBI seized from Perry's phone, after a U.S. appeals court set a new precedent defining limits on Congress's immunity from criminal investigation",
    "url": "https://www.washingtonpost.com/national-security/2023/12/19/rep-perry-records-jan6/"
  },
  {
    "text": "Giuliani's Money Woes Were a Focus of Ukraine Inquiry, Records Reveal  —  F.B.I. agents scrutinizing Rudolph W. Giuliani's efforts to oust the American ambassador to Ukraine thought financial problems might be motivating his actions.  —  Before Rudolph W. Giuliani was ordered to pay $148 million … ",
    "url": "https://www.nytimes.com/2023/12/19/nyregion/giuliani-trump-ukraine-fbi.html"
  },
  {
    "text": "Xi warned Biden during summit that Beijing will reunify Taiwan with China  —  The Chinese leader's message in San Francisco got the attention of U.S. officials because it was delivered at a meeting that was intended to reduce tensions.  —  WASHINGTON — Chinese President Xi Jinping bluntly … ",
    "url": "https://www.nbcnews.com/news/china/xi-warned-biden-summit-beijing-will-reunify-taiwan-china-rcna130087"
  },
  {
    "text": "Judge reverses earlier decision and allows removal of Confederate memorial at Arlington Cemetery  —  The allegations that the removal efforts amounted to grave desecration “were, at best, ill-informed and, at worst, inaccurate,” the judge wrote.  —  ALEXANDRIA, Va. — A federal judge … ",
    "url": "https://www.nbcnews.com/politics/politics-news/judge-reverses-earlier-decision-allows-removal-confederate-memorial-ar-rcna130566"
  },
  {
    "text": "America has a McGonigal problem  —  A retired FBI boss got 4 years in prison.  But Charles McGonigal is not the only US official taking money from sketchy foreign oligarchs.  —  2023-12-20T12:00:01Z  —  An curved arrow pointing right.  —  A bookmark Save",
    "url": "https://www.businessinsider.com/america-charles-mcgonigal-problem-russia-kremlin-deripaska-fbi-sentencing-corruption-2023-12"
  },
  {
    "text": "Rite Aid Banned from Using AI Facial Recognition After FTC Says Retailer Deployed Technology without Reasonable Safeguards  —  FTC says Rite Aid technology falsely tagged consumers, particularly women and people of color, as shoplifters; Ban will last five years",
    "url": "https://www.ftc.gov/news-events/news/press-releases/2023/12/rite-aid-banned-using-ai-facial-recognition-after-ftc-says-retailer-deployed-technology-without"
  },
  {
    "text": "Israel offers Hamas one-week pause in fighting as part of a new hostage deal  —  Israel is offering to pause the fighting in Gaza for at least one week as part of a new deal to get Hamas to release more than three dozen hostages the terror group is holding, two Israeli officials and another source … ",
    "url": "https://www.axios.com/2023/12/19/israel-offer-hamas-pause-fighting-hostages"
  }
]