[
  {
    "text": "Trump Fires Official Over Jobs Report, Echoing an Authoritarian Playbook  —  In firing the head of the agency that collects employment statistics, the president underscored his tendency to suppress facts he doesn't like and promote his own version of reality.",
    "url": "https://www.nytimes.com/2025/08/03/us/politics/trump-bls-jobs-facts.html?unlocked_article_code=1.bU8.ulCL.4xAvX3InbWBC&smid=url-share"
  },
  {
    "text": "Trump Fired America's Economic Data Collector.  History Shows the Perils. … President Trump said he ousted the head of the Bureau of Labor Statistics because the numbers produced by her agency were “rigged” to hurt him politically.Haiyun Jiang/The New York Times",
    "url": "https://www.nytimes.com/2025/08/03/business/trump-bls-firing-economic-reports.html?unlocked_article_code=1.bU8.rRDw.MHENewXzaxZX&smid=url-share"
  },
  {
    "text": "Why Trump's Meddling in the Bureau of Labor Statistics Matters  —  Imagine a group of 5-year-olds playing a board game.  The rules are clear, the goal is fair, and one child edges ahead — until, suddenly, another child starts losing.  That's when the trouble begins.  “He cheated!” the losing child yells.",
    "url": "https://www.nytimes.com/2025/08/03/opinion/trump-bls-fired-labor-jobs-data.html?unlocked_article_code=1.bU8.iLX3.cvxds1pXUGP_&smid=nytcore-android-share"
  },
  {
    "text": "To Live Inside a Lie  —  President Trump fired Bureau of Labor Statistics (BLS) Director Erika McEntarfer because the latest monthly jobs report looks bad and Trump wanted it to look good.  He accused McEntarfer of “faked” numbers, but that's almost certainly a lie.",
    "url": "https://www.arcdigital.media/p/to-live-inside-a-lie"
  },
  {
    "text": "U.S. jobs data “very unreliable,” top Trump econ adviser says  —  The labor statistics chief that President Trump fired Friday is a “terrific person, but the jobs data her agency produced has become “very unreliable,” National Economic Council director Kevin Hassett said Sunday.",
    "url": "https://www.axios.com/2025/08/03/trump-jobs-labor-statistics-fired"
  },
  {
    "text": "White House economic adviser Kevin Hassett defends Trump's firing of labor statistics head  —  In an interview on NBC News' “Meet the Press,” Hassett called for a “fresh set of eyes” at the Bureau of Labor Statistics.  —  White House economic adviser Kevin Hassett on Sunday defended President … ",
    "url": "https://www.nbcnews.com/politics/economics/economic-adviser-kevin-hassett-defends-trumps-firing-labor-jobs-report-rcna222725"
  },
  {
    "text": "Trump Is Very Mad at Charlamagne Tha God for Talking About Epstein  —  “I think this Epstein thing is going to be a way for traditional conservatives to take their party back,” the radio host said on Lara Trump's Fox News show  —  Donald Trump is angry and lashing out at radio host … ",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-charlamagne-tha-god-epstein-1235399362/"
  },
  {
    "text": "White House has no plan to mandate IVF care, despite campaign pledge  —  President Donald Trump has said he wants a “baby boom,” but critics say his administration has yet to make significant family policy changes — and that Medicaid cuts will hurt.  —  Just now",
    "url": "https://www.washingtonpost.com/business/2025/08/03/trump-administration-ivf-care/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzU0MTkzNjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzU1NTc1OTk5LCJpYXQiOjE3NTQxOTM2MDAsImp0aSI6ImYzOTU5ODNjLWM1ZTEtNDNhYS1iYTUxLTY2ODcxYzE5YzNkNyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9idXNpbmVzcy8yMDI1LzA4LzAzL3RydW1wLWFkbWluaXN0cmF0aW9uLWl2Zi1jYXJlLyJ9.YSK9HByFcgPcpwi455pAFHYsR16Mkpk0DjGtyL5AQTU&itid=gfta"
  },
  {
    "text": "DOJ is walking back the White House's goal to arrest 3,000 immigrants per day … It's not the only case that has featured the 3,000-arrest-per-day target as a crucial piece of evidence that the administration's single-minded drive to rack up arrests may have prompted immigration authorities to cut corners or break the law.",
    "url": "https://www.politico.com/news/2025/08/03/white-house-doj-immigration-quota-mismatch-00490406"
  },
  {
    "text": "Trump And Miller Compel Colleges Not To Enroll International Students  —  Stuart Anderson writes about immigration, business and globalization.  —  SaveComment  —  The Trump administration is using rules, policies and formal agreements to compel and discourage U.S. universities from enrolling international students.",
    "url": "https://www.forbes.com/sites/stuartanderson/2025/08/03/trump-and-miller-compel-colleges-not-to-enroll-international-students/"
  },
  {
    "text": "The Mothership Vortex: An Investigation Into the Firm at the Heart of the Democratic Spam Machine  —  How a single consulting firm extracted $282 million from a network of spam PACs while delivering just $11 million to actual campaigns.  —  The digital deluge is a familiar annoyance for anyone on a Democratic fundraising list.",
    "url": "https://data4democracy.substack.com/p/the-mothership-vortex-an-investigation"
  },
  {
    "text": "Trump's Tariffs Are Making Money.  That May Make Them Hard to Quit. … Shipping containers at the Port of Baltimore.  Even before the latest tariffs set in, revenue from taxes collected on imported goods grew drastically this year.Alyssa Schukar for The New York Times",
    "url": "https://www.nytimes.com/2025/08/03/business/trump-tariffs-how-much-money-debt.html"
  },
  {
    "text": "The rise of AI tools that write about you when you die  —  Families and funeral directors are using AI obituary generators to more efficiently memorialize the dead.  What happens when they get it wrong?  —  Two days after Jeff Fargo's mother died, he lay in bed, crying, at home in Nevada and opened his laptop to ChatGPT.",
    "url": "https://www.washingtonpost.com/technology/2025/08/03/ai-obituaries-funeral-homes/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzU0MTkzNjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzU1NTc1OTk5LCJpYXQiOjE3NTQxOTM2MDAsImp0aSI6IjBiNTk1NmY1LWU4MDUtNDBkNC1hNzA0LTIzNjk4NWE4MjM0ZCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS90ZWNobm9sb2d5LzIwMjUvMDgvMDMvYWktb2JpdHVhcmllcy1mdW5lcmFsLWhvbWVzLyJ9.76hnvtuQDy7BamNKDbYGEsCCvQi3VTlxmf6BphsNwLg&itid=gfta"
  },
  {
    "text": "Laura Loomer Attack on West Point Appointee Reflects Larger Fight Over Trump  —  Jen Easterly, who had served in Republican and Democratic administrations, was headed to the academy.  Then a right-wing activist stepped in.  —  Hours after West Point pulled its offer to have her teach cadets … ",
    "url": "https://www.nytimes.com/2025/08/03/us/politics/west-point-easterly-trump-loomer.html"
  },
  {
    "text": "‘They roll right over’: Many Democrats call their party weak and ineffective, AP-NORC poll finds  —  Many Democrats see their political party as “weak” or “ineffective,” according to a poll that finds considerable pessimism within Democratic ranks.  Republicans are more complimentary of their party … ",
    "url": "https://apnews.com/article/ap-poll-democrats-republican-political-parties-d41141f4a0af53c223620af0fc3fc319"
  },
  {
    "text": "McCloskeys win back AR-15 rifle 5 years after Black Lives Matter protest confrontation  —  The St. Louis couple who went viral in 2020 for wielding guns as Black Lives Matter protesters marched outside their property have regained possession of their semiautomatic rifle.",
    "url": "https://nypost.com/2025/08/03/us-news/st-louis-mccloskeys-win-back-ar-15-rifle-5-years-after-black-lives-matter-protest-confrontation/"
  },
  {
    "text": "A Tiny Conservative News Outlet Pioneered the Attack on Higher Education  —  Campus Reform was founded years ago to expose what it calls leftist bias on college campuses.  The online site's cause has gone from fringe to mainstream.  —  Around the height of the pro-Palestinian campus protests last year … ",
    "url": "https://www.nytimes.com/2025/08/03/us/campus-reform-college-protests-antisemitism-zachary-marschall.html"
  },
  {
    "text": "Ghislaine Maxwell, Elizabeth Holmes, And Jen Shah Are At The Same Texas Prison  —  Jeffrey Epstein's famous confidante, the disgraced founder of Theranos, and the former Real Housewives of Salt Lake City are all serving time at Bryan Federal Prison Camp.  —  As demands for President Donald Trump … ",
    "url": "https://www.vanityfair.com/style/story/ghislaine-maxwell-elizabeth-holmes-jen-shah-prison"
  },
  {
    "text": "You know who loves the Epstein scandal?  President-in-waiting JD Vance.  —  So is it that hard to believe Vance is watching Trump digging his Epstein hole deeper and deeper and thanking his lucky stars for the president's incompetence and history of loutish behavior?",
    "url": "https://www.usatoday.com/story/opinion/columnist/2025/08/03/trump-epstein-scandal-vance-president/85481602007/"
  },
  {
    "text": "The problem is far bigger than Jeffrey Epstein  —  Treating the scandal as an aberration misunderstands the global epidemic of violence against women  —  On 2 July, the jury delivered a guilty verdict on some of the charges against the music mogul Sean Combs, accused of horrific sexual abuse … ",
    "url": "https://www.theguardian.com/commentisfree/2025/aug/03/jeffrey-epstein-violence-women"
  },
  {
    "text": "Wall St and Silicon Valley ride high as tariffs hit Main Street  —  Banks and Big Tech are booming but slowing US growth is hurting other companies across the board  —  A divide is widening in the US economy as the biggest banks and technology groups shrug off Donald Trump's tariffs … ",
    "url": "https://www.ft.com/content/aefad7d1-e809-4a16-8acd-6e2ef9f28ebe"
  },
  {
    "text": "Transcript: Dr. Mehmet Oz on “Face the Nation with Margaret Brennan,” Aug. 3, 2025  —  The following is the transcript of an interview with Dr. Mehmet Oz, Centers for Medicare & Medicaid Services administrator, that aired on “Face the Nation with Margaret Brennan” on Aug. 3, 2025.",
    "url": "https://www.cbsnews.com/news/dr-mehmet-oz-cms-administrator-face-the-nation-08-03-2025/"
  },
  {
    "text": "‘He has trouble completing a thought’: bizarre public appearances again cast doubt on Trump's mental acuity  —  Joe Biden was hounded for his age-related gaffs, but Trump's increasingly strange behavior has largely been ignored  —  Donald Trump's frequently bizarre public appearances … ",
    "url": "https://www.theguardian.com/us-news/2025/aug/03/donald-trump-mental-fitness"
  },
  {
    "text": "‘Knives out’: Switzerland descends into blame game after US tariff shock  —  President Karin Keller-Sutter under fire for failed trade talks with Trump administration  —  A blame game has erupted in Switzerland after the US announced an unexpected 39 per cent tariff rate on the Alpine country on its national day.",
    "url": "https://www.ft.com/content/6804c076-4961-4373-a4f8-1e59ab5d7f8b"
  },
  {
    "text": "Tequila, Drugs and Torture: The Spending Binge of Two Crypto Bros That Ended Behind Bars  —  William Duplessie and John Woeltz hatched grandiose plans in business and politics but instead drew charges in an alleged kidnap scheme  —  A private jet lifted off on a night in February … ",
    "url": "https://www.wsj.com/us-news/crypto-duplessie-woeltz-kidnap-torture-aae24e88?st=vzAxS3&reflink=desktopwebshare_permalink"
  }
]