[
  {
    "text": "The Self-Immolation of the AZ GOP  —  Inflation is still running a little hot, according to the Department of Labor.  Overall inflation was at 3.5 percent year-over-year, with more stable “core” inflation at 3.8 percent.  While it's moving in the right direction, it's not returning … ",
    "url": "https://www.thebulwark.com/p/the-self-immolation-of-the-az-gop"
  },
  {
    "text": "‘Shame!  Shame!’:  Arizona Republican leaders block effort to repeal abortion ban  —  Democrats stymied after state supreme court rules that 1864 law with no exceptions for rape or incest can go into effect  —  Arizona's state Republican leadership halted an effort by Democrats on Wednesday … ",
    "url": "https://www.theguardian.com/us-news/2024/apr/10/arizona-republicans-block-repeal-state-abortion-ban"
  },
  {
    "text": "Abortion ruling is a full-on disaster for Arizona Republicans  —  Opinion: With the return of an 1864 abortion ban, Republicans now face a five-alarm fire that could consume their grip on Arizona.  If you are Trump or Kari Lake, you are freaking out right now.",
    "url": "https://www.azcentral.com/story/opinion/op-ed/laurieroberts/2024/04/09/abortion-ruling-disaster-arizona-republicans/73263944007/"
  },
  {
    "text": "Arizona Republicans Thwart Attempts to Repeal 1864 Abortion Ban  —  Democrats in both houses of the Legislature were blocked from advancing bills to roll back a reinstated 160-year-old ban on nearly all abortions in the state.  —  A decision by Arizona's highest court upholding an 1864 ban … ",
    "url": "https://www.nytimes.com/2024/04/10/us/abortion-ban-arizona-democrats-repeal.html"
  },
  {
    "text": "Arizona Republicans condemn their own abortion policy  —  On Tuesday, the Arizona Supreme Court issued a bombshell decision banning virtually all abortions in the state.  The majority found that since the Supreme Court overturned Roe v. Wade, a near-total ban from 1864 — before Arizona was a state — was back in effect.",
    "url": "https://popular.info/p/arizona-republicans-condemn-their"
  },
  {
    "text": "Playbook: Why Trump is Johnson's best friend right now  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  JUST POSTED — “Matt Gaetz Is Winning,” by The Atlantic's Elaine Godfrey: Rep. MATT GAETZ (R-Fla.) “is a creature of our time: versed in the art … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/04/11/why-trump-is-johnsons-best-friend-right-now-00151686"
  },
  {
    "text": "Matt Gaetz Is Winning … Usually, you need about 10 minutes to walk from the Rayburn House Office Building to the House Chamber.  But if you're running from a reporter, it'll only take you five.  —  When Matt Gaetz spotted me outside his office door one afternoon early last November … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/04/matt-gaetz-house-republican-congress-profile/677915/"
  },
  {
    "text": "Florida 2024 Poll: Plurality Plan to Vote “Yes” on Abortion Protection Ballot Measure  —  A new Emerson College Polling survey in Florida finds 42% of voters plan to vote yes on the November ballot measure that will provide a constitutional right to abortion before fetal viability, 32% are unsure, and 25% will vote no.",
    "url": "https://emersoncollegepolling.com/florida-2024-poll-plurality-plan-to-vote-yes-on-abortion-protection-ballot-measure/"
  },
  {
    "text": "RNC under Lara Trump spreads ‘massive fraud’ claims about 2020 election  —  The Republican National Committee last week sent out a scripted call to voters' phones on behalf of new co-chair Lara Trump saying Democrats committed “massive fraud” in the 2020 election.",
    "url": "https://www.cnn.com/2024/04/10/politics/lara-trump-rnc-2020-election-fraud-claims/"
  },
  {
    "text": "Biden Administration Approves Expansion of Background Checks on Gun Sales  —  The new rule, which is likely to face legal challenges, is an attempt to regulate a fast-growing shadow market of weapons that has fueled gun violence.  —  The Biden administration has approved the broadest expansion … ",
    "url": "https://www.nytimes.com/2024/04/11/us/politics/biden-guns-background-checks.html"
  },
  {
    "text": "US will require background checks for gun shows and online firearm sales  —  ‘Historic’ action by justice department closes ‘doggone dangerous’ loophole in Biden administration's fight against gun violence  —  The sale of firearms on the internet and at gun shows in the US will in future … ",
    "url": "https://www.theguardian.com/us-news/2024/apr/11/gun-show-internet-sale-mandatory-background-check"
  },
  {
    "text": "Trump loses third bid this week to delay hush money trial  —  A New York appeals judge on Wednesday denied Donald Trump's third last-ditch attempt this week to delay his April 15 criminal trial on charges stemming from hush money paid to a porn star, paving the way for the first-ever trial of a former U.S. president.",
    "url": "https://www.reuters.com/legal/trump-tries-delay-hush-money-trial-third-time-this-week-2024-04-10/"
  },
  {
    "text": "Truong My Lan: Vietnamese billionaire sentenced to death for $44bn fraud  —  Truong My Lan is accused of looting one of Vietnam's largest banks over a period of 11 years  —  It was the most spectacular trial ever held in Vietnam, befitting one of the greatest bank frauds the world has ever seen.",
    "url": "https://www.bbc.com/news/world-asia-68778636"
  },
  {
    "text": "Before He Died in Prison, Aleksei Navalny Wrote a Memoir.  It's Coming This Fall.  —  In the book, Navalny tells his story in his own words, chronicling his life, his rise as an opposition leader, and the attempts on his life.  —  During the years leading up to his death in a Russian prison … ",
    "url": "https://www.nytimes.com/2024/04/11/books/booksupdate/aleksei-navalny-memoir.html"
  },
  {
    "text": "Trump lawyers set to return court with another challenge to his impending criminal trial in New York  —  The former president's filing at the state Appellate Division is his third challenge to the case in three days.  —  Lawyers for former President Donald Trump were heading … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-lawyers-return-court-another-challenge-criminal-trial-new-york-rcna147209"
  },
  {
    "text": "The Trump donor whom Biden can't fire is running the U.S. Postal Service directly into the ground—just what everyone warned about when he was confirmed during the pandemic  —  Technology has afforded us the ability to connect with nearly anyone, anytime—and free of charge.",
    "url": "https://fortune.com/2024/04/10/usps-dejoy-price-hikes-customer-dissatisfaction/"
  },
  {
    "text": "Biden Loses Support Among Black Men, WSJ Poll Finds  —  New survey of seven battleground states also shows some Black women are weighing other options",
    "url": "https://www.wsj.com/politics/elections/biden-trump-black-men-support-election-2024-poll-a7d9da22"
  },
  {
    "text": "Police Report: Trump County Chair Threatened To Rape Boss's Wife, Then Kill Him  —  Jonathan Stone, a former New Hampshire police officer, has been a part of Trump's campaign since 2016, when he gave Trump an inscribed AR-15 assault rifle.  —  LOADING  —  One of Donald Trump's county campaign chairs … ",
    "url": "https://www.huffpost.com/entry/trump-fired-police-officer-new-hampshire_n_6616de8ce4b0999df35397ba"
  },
  {
    "text": "Alabama Man Charged with Detonating an Explosive Device Outside of Alabama Attorney General's Office  —  For Immediate Release  —  An Alabama man was indicted for his alleged role in detonating an explosive device in downtown Montgomery, Alabama.  —  On April 10, law enforcement arrested … ",
    "url": "https://www.justice.gov/opa/pr/alabama-man-charged-detonating-explosive-device-outside-alabama-attorney-generals-office"
  },
  {
    "text": "How Biden's campaign plans to pummel Trump on abortion  —  The reelect is going to spend the next half year publicizing the testimonials of those affected by harsh new state abortion laws.  —  Joe Biden's campaign plans to hammer Donald Trump for his role in erasing abortion rights largely … ",
    "url": "https://www.politico.com/news/2024/04/11/biden-campaign-trump-abortion-00151656"
  }
]