[
  {
    "text": "Body shaming, IQ insults and cross talk: House committee meeting devolves into chaos amid personal insults  —  The hearing was derailed when Rep. Marjorie Taylor Greene, R-Ga., responded to a question from Rep. Jasmine Crockett, D-Texas, by saying, “I think your fake eyelashes are messing up what you're reading.”",
    "url": "https://www.nbcnews.com/politics/congress/house-committee-meeting-devolves-chaos-personal-insults-marjorie-taylo-rcna152698"
  },
  {
    "text": "House committee hearing disrupted as Marjorie Taylor Greene and AOC clash over ‘fake eyelashes’ jibe  — House committee hearing disrupted as Rep. Taylor Greene and Rep. Ocasio-Cortez clashed.  — Greene criticized Jasmine Crockett's appearance, prompting AOC to demand her words be struck.",
    "url": "https://www.businessinsider.com/house-oversight-hearing-erupts-chaos-aoc-and-greene-clash-2024-5"
  },
  {
    "text": "MAGA Rage at Trump's Trial Just Got Darker and More Dangerous  —  In recent days, a parade of Republicans have shown up at the Manhattan courthouse where Donald Trump faces criminal charges related to the hush-money scheme he concocted to deceive American voters during the 2016 election.",
    "url": "https://newrepublic.com/article/181682/trump-trial-maga-rage-dark-dangerous"
  },
  {
    "text": "Man convicted of attacking ex-Speaker Nancy Pelosi's husband with a hammer sentenced to 30 years  —  The man convicted of attempting to kidnap then-House Speaker Nancy Pelosi and attacking her husband with a hammer was sentenced Friday to 30 years in prison.",
    "url": "https://apnews.com/article/paul-pelosi-nancy-hammer-attack-depape-sentence-b41b6c776fb27f62913e3754afa1ceac"
  },
  {
    "text": "Nancy Pelosi asks for “very long” sentence for David DePape, who attacked husband Paul Pelosi with hammer  —  Former House Speaker Nancy Pelosi is asking the court for a “very long” sentence for the man who attacked her husband in their home over a year ago, and Paul Pelosi … ",
    "url": "https://www.cbsnews.com/news/nancy-pelosi-paul-pelosi-victim-statement-david-depape/"
  },
  {
    "text": "'A Governor Who Doesn't Seem to Have Much Interest in Governing Arkansas'  —  Sarah Huckabee Sanders' increasing number of critics think she's too worried about her national profile.  —  Gov. Sarah Huckabee Sanders assumed a podium on a recent spring morning in Arkansas … ",
    "url": "https://www.politico.com/news/magazine/2024/05/17/sarah-huckabee-sanders-arkansas-maga-trump-00156647"
  },
  {
    "text": "Exclusive: Sean ‘Diddy’ Combs seen physically assaulting Cassie Ventura in 2016 surveillance video obtained by CNN  —  A 2016 surveillance video obtained exclusively by CNN shows Sean “Diddy” Combs grab, shove, drag and kick his then-girlfriend Cassie Ventura during an altercation … ",
    "url": "https://www.cnn.com/2024/05/17/entertainment/sean-combs-cassie-ventura/"
  },
  {
    "text": "Why Trump keeps dreaming he can flip Minnesota  —  The state hasn't gone for a Republican nominee for president since Richard Nixon in 1972.  —  Donald Trump has fixated on the idea he can expand the map in a general election that's likely to be decided in six swing states.",
    "url": "https://www.politico.com/news/2024/05/17/donald-trump-flip-minnesota-00158551"
  },
  {
    "text": "Why Is N.Y.U. Forcing Protesters to Write Apology Letters?  —  The university calls it a “restorative practice”; the students call it a coerced confession.  —  At one point during the demonstrations at Columbia University in 1968, protesters took the acting dean of the liberal arts college hostage.",
    "url": "https://www.nytimes.com/2024/05/17/nyregion/nyu-protests-apology-letters.html"
  },
  {
    "text": "Glamorous GOP Rep. Beth Van Duyne breaks her silence on love affair with married Georgia Republican Rich McCormick  — McCormick was seen stroking Van Duyne's arm during the State of the Union  —  By JON MICHAEL RAASCH, POLITICAL REPORTER ON CAPITOL HILL, FOR DAILYMAIL.COM and MORGAN PHILLIPS, CONGRESS REPORTER FOR DAILYMAIL.COM",
    "url": "https://www.dailymail.co.uk/news/article-13430725/beth-van-duyne-confirms-affair-rich-mccormick.html"
  },
  {
    "text": "Trump-linked dark-money group spent $90m on racist and transphobic ads in 2022, records show  —  Revealed: Citizens for Sanity was one of top political spenders last election cycle and is back for 2024 with more extreme messaging  —  A dark money group with ties to Trump's inner circle dropped … ",
    "url": "https://www.theguardian.com/us-news/article/2024/may/17/trump-citizens-sanity-election-ads"
  },
  {
    "text": "Trump's corrupt offer to Big Oil executives almost entirely ignored in top local newspapers and TV markets in battleground states  —  Trump's promise to repeal climate action and solicitation of campaign donations from oil executives is vital information for voters",
    "url": "https://www.mediamatters.org/local-news/trumps-corrupt-offer-big-oil-executives-almost-entirely-ignored-top-local-newspapers-and"
  },
  {
    "text": "‘Stand Back And Stand By’: Matt Gaetz Parrots Trump's Call To Violent Extremists At His Trial  —  The House Republican, one of several who joined Trump at his criminal trial in New York, repeated a line hailed by the neo-fascist Proud Boys.  —  LOADING  —  Rep. Matt Gaetz (R-Fla.) … ",
    "url": "https://www.huffpost.com/entry/matt-gaetz-stand-back-stand-by-proud-boys_n_66462d52e4b0dd63cd2ba653"
  },
  {
    "text": "Wokeness Is Dying.  We Might Miss It.  —  A protester at an encampment at U.C.L.A. this month.Philip Cheung for The New York Times  —  In her new book “Morning After the Revolution: Dispatches From the Wrong Side of History,” Nellie Bowles, a former New York Times journalist grown disillusioned … ",
    "url": "https://www.nytimes.com/2024/05/17/opinion/wokeness-is-dying-we-might-miss-it.html"
  },
  {
    "text": "Biden's team had a few demands for a Trump debate.  A major one: No crowd.  —  “Trump feeds off the crowd, they give him life.  We wanted to take that away.”  —  When Donald Trump took the stage at a CNN town hall in Manchester, New Hampshire, one year ago, a crowd of his supporters roared … ",
    "url": "https://www.politico.com/news/2024/05/17/biden-trump-debate-2024-demands-00158586"
  }
]