[
  {
    "text": "Trump approval sinks as Americans criticize his major policies, poll finds  —  After high expectations before he returned to office, most Americans say the president has made the economy worse.  —  As he nears the end of his first 100 days in office, President Donald Trump is facing growing opposition … ",
    "url": "https://www.washingtonpost.com/politics/2025/04/27/trump-poll-approval-rating-100-days/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ1NzI2NDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ3MTA4Nzk5LCJpYXQiOjE3NDU3MjY0MDAsImp0aSI6ImM4MDVkM2Y0LWU1ZDAtNGY1Yi05MmMwLTkzNWZhMWUwYzhhNiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzA0LzI3L3RydW1wLXBvbGwtYXBwcm92YWwtcmF0aW5nLTEwMC1kYXlzLyJ9.9JTGanwIHAx27t6faYMkGv66fWprICpdIDGOupOvm8k"
  },
  {
    "text": "CNN Poll: Trump's approval at 100 days lower than any president in at least seven decades  —  Donald Trump won back the Oval Office and took charge of the government amid the strongest poll numbers of his political career, but as the 100-day mark of his presidency approaches … ",
    "url": "https://cnn.com/2025/04/27/politics/approval-rating-trump-100-days/"
  },
  {
    "text": "Trump has lowest 100-day approval rating in 80 years: POLL  —  Majorities of voters disapprove of many of Trump's policies, the poll found.  —  President Donald Trump talks to reporters in the Oval Office of the White House in Washington, April 23, 2025.  —  Donald Trump has the lowest 100 … ",
    "url": "https://abcnews.go.com/Politics/trump-lowest-100-day-approval-rating-80-years/story?id=121165473"
  },
  {
    "text": "Man arrested in theft of DHS chief Kristi Noem's purse is in the U.S. illegally, official says  —  Noem's bag was stolen by a masked man Sunday night while she was having dinner with her family in Washington, D.C.  —  The suspect who was arrested Saturday in the theft of Secretary Kristi Noem's purse … ",
    "url": "https://www.nbcnews.com/politics/national-security/man-believed-stolen-dhs-chief-kristi-noems-purse-custody-rcna203176"
  },
  {
    "text": "ICE promises bystanders who challenged Charlottesville raid will be prosecuted  —  After ICE raided a downtown Charlottesville courthouse and arrested two men, the federal agency is promising to prosecute the bystanders who challenged their authority.  —  ×  —  Week in Virginia",
    "url": "https://dailyprogress.com/news/local/crime-courts/article_e6ce6e4a-4161-476f-8d28-94150a891092.html"
  },
  {
    "text": "Cory Booker and Hakeem Jeffries Are Sitting in to Stand up for Medicaid  —  The lawmakers are having “An Urgent Conversation with the American People” on the Capitol steps to oppose Republican plans to cut public healthcare benefits  —  Sen. Cory Booker and House Minority Leader Hakeem Jeffries … ",
    "url": "https://www.rollingstone.com/politics/politics-news/booker-jeffries-capitol-sit-in-medicaid-1235326047/"
  },
  {
    "text": "Nine dead and multiple injured as driver plows into Vancouver crowd  —  The attack happened during a block party celebrating Filipino culture.  The crowd took the suspect into custody at the scene, and police say they are “confident” it was not an act of terrorism.",
    "url": "https://www.nbcnews.com/world/canada/multiple-dead-injured-driver-plows-vancouver-crowd-police-say-rcna203182"
  },
  {
    "text": "Trump's first 100 days: Steamrolling government, strong-arming allies, igniting trade wars  —  In his first 100 days, President Donald Trump exerted his power in a sweep and scale that has no easy historical comparison.  —  His actions target the architecture of the New Deal and the Great Society, but they hardly stop there.",
    "url": "https://apnews.com/politics/trumps-first-100-days-steamrolling-government-strong-arming-allies-igniting-trade-wars-000001965daeda12a1b77fee99900000"
  },
  {
    "text": "Trump's Newest IRS Chief Tries to Steer a Leaner Agency Through Turmoil  —  Michael Faulkender, fourth interim leader since January, promises modernization of agency systems in two years  —  WASHINGTON—It's Michael Faulkender's turn in the hot seat atop the Internal Revenue Service … ",
    "url": "https://www.wsj.com/politics/policy/michael-faulkender-acting-irs-commissioner-5f910134"
  },
  {
    "text": "Transcript: Gary Cohn on “Face the Nation with Margaret Brennan,” April 27, 2025  —  The following is the transcript of an interview with Gary Cohn, IBM vice chairman and former director of the U.S. National Economic Council, that aired on “Face the Nation with Margaret Brennan” on April 27, 2025.",
    "url": "https://www.cbsnews.com/news/gary-cohn-ibm-face-the-nation-transcript-04-27-2025/"
  },
  {
    "text": "Your Home Without China  —  It's hard to imagine an American home without Chinese products.  —  Many essentials are imported almost entirely from China — and with new tariffs, they're likely to become more expensive.  —  We analyzed import data to show where Americans may see product shortages, fewer choices and price increases.",
    "url": "https://www.nytimes.com/interactive/2025/04/27/world/asia/china-products-us-tariffs-trump.html?unlocked_article_code=1.C08.2JdV.9cofYH6YYyNC&smid=url-share"
  },
  {
    "text": "Meta's ‘Digital Companions’ Will Talk Sex With Users—Even Children  —  Chatbots on Instagram, Facebook and WhatsApp are empowered to engage in ‘romantic role-play’ that can turn explicit.  Some people inside the company are concerned.  —  Across Instagram, Facebook and WhatsApp … ",
    "url": "https://www.wsj.com/tech/ai/meta-ai-chatbots-sex-a25311bf?st=Miw57t&reflink=article_copyURL_share"
  },
  {
    "text": "Democrats seize on a new issue to use against the GOP: Social Security  —  As Democrats link Trump to Social Security's struggles, he reiterates his promise to protect the agency's benefits while also carrying out sweeping staff and spending cuts.  —  Democrats, after weeks of struggling … ",
    "url": "https://www.washingtonpost.com/politics/2025/04/27/social-security-cuts-democrats-trump-republicans/"
  },
  {
    "text": "Federal work shaped a Black middle class.  Now it's destabilized by Trump's job cuts  —  Shirley Hopkins built careers for herself and countless other Black workers through a federal government job.  —  While working in the National Institutes of Health's human resources office, she became known as the “recruitment lady.”",
    "url": "https://www.npr.org/2025/04/27/nx-s1-5349442/black-federal-employees-trump-cuts"
  },
  {
    "text": "Drug bust at ‘underground illegal’ nightclub in Colorado Springs  —  COLORADO SPRINGS, Colo. (KKTV) - Law enforcement conducted a large-scale operation at what they are calling an underground illegal nightclub early Sunday morning, according to the Rocky Mountain Drug Enforcement Administration (DEA).",
    "url": "https://www.kktv.com/2025/04/27/drug-bust-underground-illegal-nightclub-colorado-springs/"
  },
  {
    "text": "Tyrants like Trump always fall - and we can already predict how he will be dethroned  —  The US constitution protects incompetence.  But don't underestimate the self-destructive power of the president's own hubris  —  Tyrants come to a sticky end, or so history suggests.  Richard III and Coriolanus made bloody exits.",
    "url": "https://www.theguardian.com/commentisfree/2025/apr/27/donald-trump-us-constitution-president"
  },
  {
    "text": "Three U.S. citizens, ages 2, 4 and 7, swiftly deported from Louisiana  —  The cases have renewed concerns that the Trump administration's expedited deportations are violating the rights of both citizens and noncitizens.  —  Three U.S. citizen children from two different families were deported … ",
    "url": "https://www.washingtonpost.com/immigration/2025/04/26/us-citizen-children-deported-ice/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ1NjQwMDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ3MDIyMzk5LCJpYXQiOjE3NDU2NDAwMDAsImp0aSI6IjM5MjZlNWYyLTg2NDYtNDM4Yi05YTViLTI5YjRlNzM4ZjExYiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9pbW1pZ3JhdGlvbi8yMDI1LzA0LzI2L3VzLWNpdGl6ZW4tY2hpbGRyZW4tZGVwb3J0ZWQtaWNlLyJ9.Rm7u0rjPmi8MkPr9rnhg_-oGfcj8fu1tJP7dscz3WEs&itid=gfta"
  },
  {
    "text": "As Musk gained power in Washington, his popularity has fallen, an AP-NORC poll finds  —  Elon Musk spent years building cachet as a business titan and tech visionary, brushing aside critics and skeptics to become the richest person on the planet.  But as Musk gained power in Washington in recent months … ",
    "url": "https://apnews.com/article/musk-trump-doge-tesla-d1206a96983b30b9cef7b18eaa8c48a7"
  },
  {
    "text": "Transcript: Russian Foreign Minister Sergey Lavrov on “Face the Nation with Margaret Brennan,” April 27, 2025  —  The following is the full transcript of an interview with Russian Foreign Minister Sergey Lavrov, a portion of which aired on “Face the Nation with Margaret Brennan” on April 27, 2025.",
    "url": "https://www.cbsnews.com/news/sergey-lavrov-russian-foreign-minister-face-the-nation-transcript-04-27-2025/"
  },
  {
    "text": "Bernie Sanders: Americans Know What ‘Oligarchy’ Means, They Aren't ‘Dumb’  —  “They understand very well, when the top one percent owns more wealth than the bottom 90 percent... they are living in an oligarchy,” the senator said  —  Sen. Bernie Sanders has faith that the American people understand what … ",
    "url": "https://www.rollingstone.com/politics/politics-news/bernie-sanders-americans-arent-dumb-oligarchy-1235326101/"
  },
  {
    "text": "Ron and Casey DeSantis were plotting a political dynasty in Florida.  Then came a scandal  —  A year after his presidential ambitions collapsed, Gov. Ron DeSantis and his wife Casey can no longer lay claim to the future of the Republican Party.  And in Florida, even their present is in jeopardy.",
    "url": "https://cnn.com/2025/04/27/politics/ron-casey-desantis-florida-scandal/"
  }
]