[
  {
    "text": "Dean Phillips hits Biden over handling of Hamas hostages: ‘Absurd, shocking and dismaying’  —  Rep. Dean Phillips (D-Minn.) bashed President Biden Tuesday for the recently negotiated hostage deal between the militant group Hamas and Israel.  —  “No, because we have nine Americans held hostage right … ",
    "url": "https://thehill.com/homenews/campaign/4323140-dean-phillips-hits-biden-over-handling-of-hamas-hostages-absurd-shocking-and-dismaying/"
  },
  {
    "text": "Statement from President Joe Biden on the Hostage Release in Gaza  —  I welcome the deal to secure the release of hostages taken by the terrorist group Hamas during its brutal assault against Israel on October 7th.  —  Jill and I have been keeping all those held hostage and their loved ones close … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2023/11/21/statement-from-president-joe-biden-on-the-hostage-release-in-gaza/"
  },
  {
    "text": "Why Trump Represents a ‘Trifecta of Danger’  —  Brian Klaas, a political scientist at University College London, captures the remarkable nature of the 2024 presidential election in an Oct. 1 essay, “The Case for Amplifying Trump's Insanity.”  —  Klaas argues that the presidential contest now pits",
    "url": "https://www.nytimes.com/2023/11/22/opinion/trump-danger-rage-psychology.html"
  },
  {
    "text": "‘Openly authoritarian campaign’: Trump's threats of revenge fuel alarm  —  Trump's talk of seeking to ‘weaponize’ the DoJ and ‘retribution’ for opponents poses a direct threat to the rule of law and democracy in the US should he win a second term, experts say",
    "url": "https://www.theguardian.com/us-news/2023/nov/22/trump-revenge-game-plan-alarm"
  },
  {
    "text": "Nikki Haley is consolidating the ‘Never Trump’ vote  —  The former South Carolina governor is drawing support from Trump-skeptical donors and activists in early nominating states.  —  Two years after Nikki Haley vowed not to challenge Donald Trump for the presidential nomination … ",
    "url": "https://www.politico.com/news/2023/11/22/nikki-haley-never-trump-voters-00128398"
  },
  {
    "text": "Record percentage says they or someone in household owns a gun: Survey  —  More than half of American voters, a record-high number, say they or someone in their household owns a gun, a new NBC News poll found.  —  According to the survey, which has polled voters since 1999 … ",
    "url": "https://thehill.com/blogs/blog-briefing-room/4322944-american-gun-ownership-record-survey/"
  },
  {
    "text": "November 2023 National Poll: Trump Maintains Lead Over Biden  —  A new Emerson College Polling national survey of registered voters finds former President Donald Trump with a four-point lead over President Biden in a hypothetical 2024 matchup, 47% to 43%, within the poll's margin of error.",
    "url": "https://emersoncollegepolling.com/november-2023-national-poll-trump-maintains-lead-over-biden/"
  },
  {
    "text": "Woodbury County supervisor's wife found guilty of 52 counts of voter fraud  —  Prosecutors say Kim Phuong Taylor wanted her husband to win elections in 2020 “by any means necessary.”  —  A jury spent about five hours deliberating before convicting Kim Phuong Taylor on 52 counts of voter fraud in federal court Tuesday in Sioux City.",
    "url": "https://www.iowapublicradio.org/ipr-news/2023-11-21/woodbury-county-supervisors-wife-found-guilty-of-52-counts-of-voter-fraud"
  },
  {
    "text": "‘Scream VII’ Star Axed Over Pro-Palestine Posts  —  Melissa Barrera wrote on Instagram that “Western media only shows the [Israeli] side.  Why do they do that, I will let you deduce for yourself.”  —  Scream VII actress Melissa Barrera has been “quietly” dropped by Spyglass Studios … ",
    "url": "https://www.thedailybeast.com/scream-vii-star-axed-over-pro-palestine-posts"
  },
  {
    "text": "75% of New Yorkers Think Santos Should Resign From Congress: Poll  —  Only 22% of respondents say they want to see the Republican finish out his freshman term  —  Three-quarters of New Yorkers want Rep. George Santos, R-N.Y., to step down from his Congressional seat, according to a new survey.",
    "url": "https://themessenger.com/politics/george-santos-marist-poll-resign"
  },
  {
    "text": "How one judge is slowing down one of Trump's biggest criminal cases  —  The May 2024 trial in Trump's classified documents case appears headed for a politically precarious postponement.  —  Judge Aileen Cannon seems to be in no hurry.  —  On paper, she has scheduled a trial to open next … ",
    "url": "https://www.politico.com/news/2023/11/22/aileen-cannon-trump-trial-slow-00128391"
  },
  {
    "text": "US thwarted plot to kill Sikh separatist on American soil  —  Washington warned India over concerns of government involvement in assassination conspiracy  —  US authorities thwarted a conspiracy to assassinate a Sikh separatist on American soil and issued a warning to India's government … ",
    "url": "https://www.ft.com/content/56f7d6d6-6a93-4172-a49e-d8a91991e29d"
  },
  {
    "text": "Roman emperor was trans, says museum  —  Elagabalus will be referred to as she after claims in classical texts that the emperor asked to be called ‘lady’  —  A Roman emperor has been declared transgender by a UK museum, The Telegraph can reveal.  —  The North Hertfordshire Museum has said it will be … ",
    "url": "https://www.telegraph.co.uk/news/2023/11/20/trans-roman-emperor-hitchin-museum-claim-pronouns-woke/"
  },
  {
    "text": "How Many Abortions Did the Post-Roe Bans Prevent?  —  The first estimate of births since Dobbs found that almost a quarter of women who would have gotten abortions carried their pregnancies to term.  —  The first data on births since Roe v. Wade was overturned shows how much abortion bans … ",
    "url": "https://www.nytimes.com/2023/11/22/upshot/abortion-births-bans-states.html"
  },
  {
    "text": "MSNBC's Claire McCaskill Argues Trump ‘Even More Dangerous’ Than Hitler: ‘The Only Philosophy He Has’ is Self-Interest  —  MSNBC political analyst Claire McCaskill posited that Donald Trump is “even more dangerous” than Benito Mussolini and Adolf Hitler because the only thing he cares about is himself … ",
    "url": "https://www.mediaite.com/tv/msnbcs-claire-mccaskill-argues-trump-even-more-dangerous-than-hitler-the-only-philosophy-he-has-is-self-interest/"
  },
  {
    "text": "Abortion rights groups seek ballot measures in 9 more states in 2024  —  Despite an unbroken winning streak since Roe v. Wade was overturned, some of the efforts to enshrine abortion rights in state constitutions face substantial challenges.  —  Seeking to extend their unbroken winning streak … ",
    "url": "https://www.nbcnews.com/politics/2024-election/abortion-rights-groups-seek-ballot-measures-9-states-2024-rcna125177"
  },
  {
    "text": "Susan Sarandon dumped by Hollywood agency UTA over anti-Jewish rant  —  Oscar winner Susan Sarandon has been dropped by top Hollywood agency UTA after saying frightened Jews are “getting a taste of how it feels to be Muslim in America,” Page Six can reveal.  —  The 77-year-old actress … ",
    "url": "https://pagesix.com/2023/11/21/celebrity-news/susan-sarandon-dropped-by-uta-over-anti-jewish-rant/"
  },
  {
    "text": "The Red State Brain Drain Isn't Coming.  It's Happening Right Now.  —  On Memorial Day weekend in 2022, Kate Arnold and her wife, Caroline Flint, flew from Oklahoma City to Cabo San Lucas for a little R&R. They had five kids, the youngest of them five-year-old twin girls, and demanding jobs as obstetrician-gynecologists.",
    "url": "https://newrepublic.com/article/176854/republican-red-states-brain-drain"
  },
  {
    "text": "Colorado Supreme Court to take up appeals in Trump ballot case  —  A state judge ruled last week that Trump “engaged in insurrection” but that the U.S. Constitution's ban on insurrectionists' holding office didn't apply to presidents.  —  The Colorado Supreme Court agreed Tuesday … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/colorado-supreme-court-agrees-take-appeal-trump-ballot-case-rcna126293"
  }
]