[
  {
    "text": "Fox News Poll: Harris is ahead of Trump by 3 points in Georgia  —  Georgians trust Harris over Trump on helping the middle class by 7 points  —  In a head-to-head matchup, Vice President Kamala Harris tops former President Trump by 3 percentage points in a Fox News survey of Georgia voters.",
    "url": "https://www.foxnews.com/official-polls/fox-news-poll-harris-ahead-trump-3-points-georgia"
  },
  {
    "text": "Harris narrowly beating Trump in six key battleground states: Polling  —  Vice President Harris is narrowly leading former President Trump in six critical battleground states, while the candidates are tied in Georgia, according to new polling.  —  The survey, published late Thursday … ",
    "url": "https://thehill.com/homenews/campaign/4902948-kamala-harris-donald-trump-swing-state-polling/"
  },
  {
    "text": "Kamala Harris Holds Razor-Thin Lead Across Swing States in Tight 2024 Race  —  About a month before the election, the vice president is eroding Trump's advantage on the economy, the latest Bloomberg News/Morning Consult Poll finds. … Vice President Kamala Harris has all but neutralized … ",
    "url": "https://www.bloomberg.com/news/features/2024-09-26/harris-holds-thin-lead-over-trump-in-swing-state-poll-election-2024"
  },
  {
    "text": "Donald Trump holds lead over Kamala Harris in Arizona, exclusive poll finds  —  With less than six weeks until the general election, former President Donald Trump holds an edge over Vice President Kamala Harris in the key battleground state of Arizona, according to an exclusive new USA TODAY/Suffolk University poll.",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/09/27/exclusive-poll-arizona-trump-leads-harris/75385504007/"
  },
  {
    "text": "Read the JD Vance Dossier  —  We publish what others won't.  Subscribe to support our work and for updates on this breaking story.  —  Behold the dossier.  —  It reportedly comes from an alleged Iranian government hack of the Trump campaign, and since June, the news media has been sitting on it … ",
    "url": "https://www.kenklippenstein.com/p/read-the-jd-vance-dossier"
  },
  {
    "text": "Jack Smith files evidence in Trump 2020 election subversion case  —  The special counsel's submission is being kept under wraps, for now.  —  Special counsel Jack Smith has filed a detailed compilation of evidence he's assembled to support charges that former President Donald Trump broke federal law … ",
    "url": "https://www.politico.com/news/2024/09/26/jack-smith-election-subversion-brief-00181331"
  },
  {
    "text": "Trump to meet Zelensky, opening new chapter in a fraught relationship  —  The meeting will be their first since 2019 and will happen in the final stage of a U.S. presidential race that has put a spotlight on partisan divisions over the war in Ukraine.  —  NEW YORK — Donald Trump will meet … ",
    "url": "https://www.washingtonpost.com/politics/2024/09/27/trump-zelensky-ukraine-war-harris/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI3NDA5NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI4NzkxOTk5LCJpYXQiOjE3Mjc0MDk2MDAsImp0aSI6IjA5M2UyYzk1LTQ2NjctNDc0MC1hYzUyLWU4MTM3ZDhkODNhMiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzA5LzI3L3RydW1wLXplbGVuc2t5LXVrcmFpbmUtd2FyLWhhcnJpcy8ifQ.Awrm8co4y6wxsaQaMoZ-49J8yQIIXLCAc1K4pbk370w&itid=gfta"
  },
  {
    "text": "DNC will send funding to all state parties to support down-ballot races  —  The nearly $2.5 million investment is the first time the national party has sent funding to every one of its state counterparts.  —  The Democratic National Committee is sending money to every state Democratic party … ",
    "url": "https://www.politico.com/news/2024/09/27/dnc-state-party-legislative-races-00181312"
  },
  {
    "text": "JD Vance, in 2020 messages, said Trump ‘thoroughly failed to deliver’  —  In previously undisclosed messages, the future vice-presidential nominee said Trump had not fulfilled his economic agenda and predicted he would lose to Biden.  —  Vice-presidential nominee JD Vance has a go-to explanation … ",
    "url": "https://www.washingtonpost.com/politics/2024/09/27/jd-vance-messages-trump-criticism-2020/"
  },
  {
    "text": "Newsmax and Smartmatic settle 2020 election defamation case on eve of trial  —  CNN  —  The pro-Trump cable channel Newsmax has settled a major 2020 election defamation lawsuit with Smartmatic in a last-minute agreement to avoid a high-stakes trial that posed a significant risk to the small outlet, according to a court official.",
    "url": "https://www.cnn.com/2024/09/26/business/newsmax-smartmatic-settle-defamation-case"
  },
  {
    "text": "Election 2024 Video of the Week: Trump's Bonkers Economic Plan  —  This week's Election 2024 Video of the Week focuses on Trump's bizarre economic plan.  —  To remind you, the goal of this series is not to preach to the converted but to give you facts, analysis, and arguments to share with those who aren't.",
    "url": "https://robertreich.substack.com/p/election-2024-video-of-the-week-trumps"
  },
  {
    "text": "Trump's Huge Civil Fraud Penalty Draws Skepticism From Appeals Court  —  A five-judge New York appellate panel questioned both the size and validity of a judgment of more than $450 million against Donald J. Trump at a hearing.  —  A New York appeals court expressed skepticism on Thursday … ",
    "url": "https://www.nytimes.com/2024/09/26/nyregion/trump-civil-fraud-penalty-appeals-court.html?unlocked_article_code=1.N04.mHHh.bwmpFr4ojaZH&smid=url-share"
  },
  {
    "text": "A dual win for consumers: Inflation cooled last month, paving way for borrowing costs to come down more  —  New York CNN  —  Americans and Federal Reserve officials have news to celebrate: Inflation cooled significantly last month, likely giving central bankers more confidence to continue cutting interest rates.",
    "url": "https://www.cnn.com/2024/09/27/economy/us-pce-inflation-august"
  },
  {
    "text": "Ex-Kansas GOP senator backs Harris  —  Former Kansas Republican Sen. Nancy Kassebaum (R-Kan.) is endorsing Vice President Harris in the 2024 presidential election, stating the White House contest “presents a stark choice that is not easy for any of us.”  —  Kassebaum, who served three terms … ",
    "url": "https://thehill.com/homenews/campaign/4902704-former-kansas-gop-senator-nancy-kassebaum-endorses-kamala-harris/"
  },
  {
    "text": "RFK Jr's chaos campaign to support Trump  —  He says he doesn't want to be a spoiler, but he's spoiling pretty hard. … On August 23, Robert F. Kennedy, Jr. suspended his presidential campaign.  Citing the war in Ukraine and the “war on our children,” as well as “relentless … ",
    "url": "https://www.publicnotice.co/p/rfk-jr-chaos-campaign-to-support-trump"
  },
  {
    "text": "North Carolina removes 747,000 from voter rolls, citing ineligibility  —  North Carolina's State Board of Elections has removed 747,000 people from its list of registered voters within the last 20 months, officials announced Thursday in a press release.  —  The State Board of Elections … ",
    "url": "https://thehill.com/homenews/campaign/4901476-north-carolina-purges-747k-voters/"
  },
  {
    "text": "Doug Emhoff Gives Unequivocal Reply To Question About Trump's Threat To Jews  —  “He lies about a lot of things, but you gotta take him at his word on things like this,” the second gentleman said of the former president.  —  LOADING  —  MSNBC's Jen Psaki asked second gentleman Doug Emhoff … ",
    "url": "https://www.huffpost.com/entry/doug-emhoff-donald-trump-jewish-americans_n_66f68349e4b027bd43856089"
  },
  {
    "text": "Millions of Vehicles Could Be Hacked and Tracked Thanks to a Simple Website Bug  —  Researchers found a flaw in a Kia web portal that let them track millions of cars, unlock doors, and start engines at will—the latest in a plague of web bugs that's affected a dozen carmakers.",
    "url": "https://www.wired.com/story/kia-web-vulnerability-vehicle-hack-track/"
  },
  {
    "text": "Trump Media shareholder UAV dumped nearly 11 million shares … United Atlantic Ventures LLC, a major shareholder in Trump Media, has sold or otherwise gotten rid of nearly 11 million shares in the company, according to a regulatory filing Thursday.  —  The move left UAV, a partnership of former … ",
    "url": "https://www.cnbc.com/2024/09/26/trump-media-shareholder-dumped-more-than-7point5-million-shares.html"
  },
  {
    "text": "Just Stop Oil protesters jailed for throwing soup at van Gogh's ‘Sunflowers’  —  LONDON — Two Just Stop Oil climate protesters who threw soup over Vincent van Gogh's “Sunflowers” were sentenced to prison Friday, the latest in a series of hefty punishments for activists in the U.K.",
    "url": "https://www.politico.eu/article/just-stop-oil-protesters-jailed-throwing-soup-van-gogh-sunflowers-climate-activists/"
  }
]