[
  {
    "text": "Finally, the Democrats Have Found Trump's Achilles' Heel: Ridicule Him  —  Donald Trump is in free fall.  Read this description from Sunday's Washington Post of how the GOP nominee spent last week: “[A]ides did not want a situation where he was watching the convention every night, getting angry … ",
    "url": "https://newrepublic.com/article/185270/democrats-harris-trump-achilles-heel-ridicule"
  },
  {
    "text": "Trump campaign casts fresh doubt on September debate with Harris over microphone dispute  —  Former President Donald Trump's campaign is casting fresh doubt on whether a September 10 debate will take place on ABC amid a dispute over the rules, a source familiar with the matter tells CNN.",
    "url": "https://www.cnn.com/2024/08/26/politics/trump-harris-september-debate"
  },
  {
    "text": "Is this thing on?  Harris and Trump battle over hot mics at debate.  —  Negotiations over the Sept. 10 spectacle have hit an impasse over whether to leave the microphones on.  —  With just 15 days left until the scheduled Sept. 10 presidential debate between Vice President Kamala Harris … ",
    "url": "https://www.politico.com/news/2024/08/26/kamala-harris-donald-trump-debate-abc-microphones-00176294"
  },
  {
    "text": "Trump Can Win on Character  —  With the defenestration of Joe Biden and the ascent of Kamala Harris, conventional wisdom has gone from asking, “How can Donald Trump lose?” to, “How can he win?”  —  It's basically a tossup race, but a successful Harris rollout and convention … ",
    "url": "https://www.nytimes.com/2024/08/26/opinion/advice-for-trump-win.html?unlocked_article_code=1.F04.cXyO.TvoG0z6u3iWU&smid=url-share"
  },
  {
    "text": "“He's now terrified of debating her”: Trump's debate flip-flop is a sign Harris has him figured out  —  The former president suggested Sunday that he would not attend his scheduled Sept. 10 debate with Kamala Harris  —  Donald Trump is not feeling great.  This year alone he's been found liable … ",
    "url": "https://www.salon.com/2024/08/26/hes-now-terrified-of-debating-her-debate-flip-flop-is-a-sign-harris-has-him-figured-out/"
  },
  {
    "text": "Former Democrat Tulsi Gabbard endorses Trump in the 2024 presidential race  —  Gabbard has been an outspoken critic of the Democratic Party since switching her party affiliation  —  Democrat-turned Independent Tulsi Gabbard, the former congresswoman from Hawaii, has endorsed former President Donald Trump … ",
    "url": "https://www.foxnews.com/politics/former-democrat-tulsi-gabbard-endorses-trump-2024-presidential-race"
  },
  {
    "text": "Texas officers raid house of 87-year-old woman who complained about poor ballot access  —  An 87-year-old Texas woman who complained about local seniors not being sent mail-in ballots had her house raided by officers for the state's election integrity unit.  —  The New York Times reported … ",
    "url": "https://www.rawstory.com/texas-election-raid/"
  },
  {
    "text": "Texas AG raids homes of Latino civil rights group members, setting up a voting rights showdown  —  The raids have triggered outrage and cries of voter suppression in a state with a long history of discrimination against citizens of Mexican descent, which helped give rise to LULAC.",
    "url": "https://www.nbcnews.com/news/latino/house-raids-texas-democrats-ken-paxton-voting-rights-lulac-rcna168216"
  },
  {
    "text": "‘Laugh-out-loud funny’: Experts guffaw as Times op-ed asserts Trump can win ‘on character’  —  A New York Times headline has political pundits rolling in the proverbial aisles with an assertion about Donald Trump's best bet on winning in 2024.  —  Rich Lowry, editor of the conservative National Review … ",
    "url": "https://www.rawstory.com/trumps-character/"
  },
  {
    "text": "Kamala Harris Has Left the Building  —  Gail Collins: Bret, I can't wait to hear your impression of Kamala Harris's big Chicago speech.  Tell, tell.  —  Bret Stephens: As rhetoric?  I thought it was strong.  She told Americans who she was, where she came from, what her values and dreams are made of … ",
    "url": "https://www.nytimes.com/2024/08/26/opinion/harris-walz-democratic-convention.html"
  },
  {
    "text": "Harris' momentum continues as she ties with Trump in these swing states  —  The good news keeps coming for Vice President Harris.  —  She has now not only made up ground in public polls in the swing states in her campaign for president, but has now actually taken narrow leads in three critical states … ",
    "url": "https://www.npr.org/2024/08/26/nx-s1-5088061/harris-trump-swing-states-electoral-map"
  },
  {
    "text": "Trump clemency recipient's arrest draws attention of judge in old drug case … A New York federal judge has ordered U.S. probation officials to investigate the recent arrest of a convicted drug dealer who was released from prison in early 2021 when his 10-year sentence was commuted by former President Donald Trump.",
    "url": "https://www.cnbc.com/2024/08/26/trump-clemency-recipient-jonathan-braun-judge.html"
  },
  {
    "text": "Biden mourns US service members killed in Kabul airport attack 3 years ago  —  President Biden mourned the three-year anniversary of the terrorist attack at the Kabul airport, when 13 U.S. service members were killed.  —  He named the 13 service members in a statement on Monday … ",
    "url": "https://thehill.com/homenews/administration/4847503-biden-honors-afghanistan-attack-anniversary/"
  },
  {
    "text": "Shouldn't Trump release his latest tax returns right about now?  —  Vice President Kamala Harris released her tax returns.  Shouldn't Donald Trump do the same?  Even if we know the answer, shouldn't he at least be asked?  —  Donald Trump's history of unfortunate money-making schemes took … ",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/shouldnt-trump-release-latest-tax-returns-right-now-rcna168192"
  },
  {
    "text": "“Proving them wrong”: After raising minimum wage, California has more fast-food jobs than ever  —  In April, California fast-food workers went from earning $15.50 per hour to $20 per hour  —  Last year, California Governor Gavin Newsom signed the state's fast-food minimum wage increase into law … ",
    "url": "https://www.salon.com/2024/08/26/proving-them-wrong-after-raising-minimum-wage-california-has-more-fast-jobs-than-ever/"
  },
  {
    "text": "Police officers are starting to use AI chatbots to write crime reports.  Will they hold up in court?  —  A body camera captured every word and bark uttered as police Sgt. Matt Gilmore and his K-9 dog, Gunner, searched for a group of suspects for nearly an hour.",
    "url": "https://apnews.com/article/ai-writes-police-reports-axon-body-cameras-chatgpt-a24d1502b53faae4be0dac069243f418"
  },
  {
    "text": "Michelle Obama's secret feud with Biden... what Nancy Pelosi thinks of Kamala Harris... and why the president was left physically shaking: EMILY GOODIN's dispatch reveals what REALLY went down at the DNC  —  As Joe Biden disembarked Air Force One in the early hours of Tuesday morning in California last week, he was visibly shaking.",
    "url": "https://www.dailymail.co.uk/news/article-13778321/Michelle-Obama-feud-Biden-Kamala-Harris-DNC.html"
  },
  {
    "text": "Donald Trump is not exactly Nostradamus  —  The former president predicts a hellscape under Kamala Harris.  He did the same with Biden — saying many of the same things, in fact — and his forecasts were consistently wrong.  —  As his polls have soured in recent weeks … ",
    "url": "https://www.washingtonpost.com/politics/2024/08/26/trump-predictions-kamala-harris-biden/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI0NjQ0ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI2MDI3MTk5LCJpYXQiOjE3MjQ2NDQ4MDAsImp0aSI6IjVhMmFlYjliLTIzMzItNDdjOS05ZDcwLTVkY2M2ZDJmNzA2MiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzA4LzI2L3RydW1wLXByZWRpY3Rpb25zLWthbWFsYS1oYXJyaXMtYmlkZW4vIn0.uQKTkfE61y7c9PBzQoE1Kkx7Z__lhm8j-q3dBp7ZtnA&itid=gfta"
  },
  {
    "text": "The Proud Boys' Reliance on Telegram Didn't Save Them, But It Thwarted Preventing the Attack  —  At 8:06PM on January 4, 2021, shortly after the arrest of Enrique Tarrio, a Proud Boy named Travis instructed everyone on the Proud Boys' Ministry of Self Defense Telegram list to “nuke everything.”",
    "url": "https://www.emptywheel.net/2024/08/26/the-proud-boys-reliance-on-telegram-didnt-save-them-but-it-thwarted-preventing-the-attack/"
  },
  {
    "text": "Father of Trump shooter Thomas Matthew Crooks hires powerhouse criminal lawyer as FBI intensifies investigation into his role in son's assassination attempt  —  The parents of Trump shooter Thomas Crooks have hired a team of powerhouse attorneys as the FBI continues to investigate … ",
    "url": "https://www.dailymail.co.uk/news/article-13765351/Father-Trump-shooter-Thomas-Matthew-Crooks-hires-criminal-attorney.html"
  },
  {
    "text": "Meet the megadonors pumping millions into the 2024 election  —  The 50 biggest donors this cycle have collectively pumped $1.5 billion into political committees and other groups competing in the election, according to a Washington Post analysis of Federal Election Commission data.",
    "url": "https://www.washingtonpost.com/elections/interactive/2024/biggest-campaign-donors-election-2024/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI0NjQ0ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI2MDI3MTk5LCJpYXQiOjE3MjQ2NDQ4MDAsImp0aSI6Ijk3NmZiYTVkLWU4ZDgtNGVjZC1iZWZhLWJmYjU1ZWI2OGQ4OSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9lbGVjdGlvbnMvaW50ZXJhY3RpdmUvMjAyNC9iaWdnZXN0LWNhbXBhaWduLWRvbm9ycy1lbGVjdGlvbi0yMDI0LyJ9.MF7AZpm-FyvjoJvaIGdDJrgQghac8j_1skYgqh0sOpo&itid=gfta"
  }
]