[
  {
    "text": "Automaker CEO Elon Musk Strips UAW Twitter Verification as Union Strikes Against Big Three  —  After members of the United Auto Workers walked off the job at midnight, Twitter stripped the union of its account verification without notice, according to a UAW official.",
    "url": "https://theintercept.com/2023/09/15/uaw-strike-twitter-verification-elon-musk/"
  },
  {
    "text": "Workers strike at all 3 Detroit automakers in a battle for a bigger share of industry profits  —  About 13,000 U.S. auto workers stopped making vehicles and went on strike Friday after their leaders couldn't bridge a giant gap between union demands in contract talks and what Detroit's three automakers are willing to pay.",
    "url": "https://apnews.com/article/auto-uaw-workers-strike-gm-ford-stellantis-7ce3ca9d94b911250d07556b7af376c7"
  },
  {
    "text": "Evidence of Biden's wrongdoing is considerable  —  Rep. Jamie Raskin (D-MD) claimed this week that “there is precisely zero evidence of any wrongdoing whatsoever” by President Joe Biden.  The Associated Press asserted Republicans are “claiming without evidence that [Joe and Hunter Biden] engaged in an influence-peddling scheme.”",
    "url": "https://www.washingtonexaminer.com/opinion/editorials/evidence-bidens-wrongdoing-considerable"
  },
  {
    "text": "Rep. Comer is the Biden impeachment inquiry's wild card  —  Rep. James Comer, the leader of House Republicans' impeachment inquiry into President Biden, has repeatedly exaggerated and distorted the findings of his investigation into the Biden family this year.",
    "url": "https://www.axios.com/2023/09/15/comer-biden-impeachment-inquiry-wild-card"
  },
  {
    "text": "Congress is in crisis.  There's no clear escape.  —  “We've been seeing this coming ... I just didn't think we were dumb enough to get there,” Rep. Mike Simpson (R-Idaho) said.  —  The government is barreling toward a shutdown.  House Republicans threaten to impeach the president — though some of them don't see the evidence.",
    "url": "https://www.politico.com/news/2023/09/15/government-shutdown-congress-gop-00116066"
  },
  {
    "text": "EXCLUSIVE: Married South Dakota governor Kristi Noem and Trump advisor Corey Lewandowski have been having a years-long clandestine affair  — DailyMail.com uncovered evidence of Lewandowski and Noem's fling: Dozens of trips that mixed business with pleasure, private flights and luxury resort stays",
    "url": "https://www.dailymail.co.uk/news/article-12509093/Kristin-Noem-Corey-Lewandowski-secret-affair.html"
  },
  {
    "text": "Biden Administration Aims to Trump-Proof the Federal Work Force  —  If Donald Trump wins a second term, he and his allies want to revive a plan to allow a president to fire civil service workers who are supposed to be hired on merit.  The Biden administration is trying to thwart it.",
    "url": "https://www.nytimes.com/2023/09/15/us/politics/trump-biden-schedule-f.html"
  },
  {
    "text": "Trump says he'd testify under oath he never ordered Mar-a-Lago security video deleted  —  In a wide-ranging interview with NBC's “Meet the Press with Kristen Welker,” Trump said, “They were my tapes.  I could have fought them.”  —  Former President Donald Trump said Thursday that he did not order … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-mar-lago-staffer-delete-security-footage-tapes-false-rcna104781"
  },
  {
    "text": "Man helping deer cross a busy street shot, killed by ‘scared’ driver  —  A man who was trying to slow traffic in his neighborhood because deer were crossing the street was shot and killed by another man who was driving past, authorities in western Washington state said.",
    "url": "https://www.washingtonpost.com/nation/2023/09/14/deer-street-shooting/"
  },
  {
    "text": "Trump, His Kids, and His Bankers: New York AG Lays Out Witnesses in Case  —  The world will soon hear from Donald Trump's long-silent bankers at Deutsche Bank, his insurers at Zurich, property appraisers at Cushman and Wakefield, and his children. … The New York Attorney General plans … ",
    "url": "https://www.thedailybeast.com/trump-his-kids-and-his-bankers-new-york-ag-lays-out-witnesses-in-case"
  },
  {
    "text": "The spectacular downfall of a common, useless cold medicine  —  This week's unanimous vote on phenylephrine's ineffectiveness was decades in the making.  —  After spending decades on pharmacy shelves, the leading nasal decongestant in over-the-counter cold and allergy medicines has met its downfall.",
    "url": "https://arstechnica.com/health/2023/09/the-spectacular-downfall-of-a-common-useless-cold-medicine/"
  },
  {
    "text": "Some small businesses caught in culture wars face financial woes, employee fears: ‘Never been as bad’  —  Target and Bud Light draw attention but backlash also hurts small companies.  —  When Republican Texas Gov. Greg Abbott declared a war on “woke” earlier this year with a proposal … ",
    "url": "https://abcnews.go.com/Business/small-businesses-caught-culture-wars-face-financial-woes/story?id=102834758"
  },
  {
    "text": "What I saw at the Texas border shocked me  —  On Sept. 6, a federal judge in Austin ordered Texas to remove a floating “buoy barrier” wall in the Rio Grande outside Eagle Pass, which has become a symbol of Governor Greg Abbott's (R) Operation Lone Star border program.",
    "url": "https://thehill.com/opinion/immigration/4200808-what-i-saw-at-the-texas-border-shocked-me/"
  },
  {
    "text": "With democracy on the ballot, the mainstream press must change its ways  —  US news organizations have turned Biden's age into a scandal and continue to cover Trump as an entertaining side show  —  Christiane Amanpour has reported all over the world, so she recognizes a democracy on the brink when she sees one.",
    "url": "https://www.theguardian.com/commentisfree/2023/sep/15/trump-biden-mainstream-politics-news-coverage"
  },
  {
    "text": "Fox News Poll: Trump expands lead in GOP primary race  —  DeSantis continues to lose ground as Ramaswamy holds steady  —  Three weeks after the first Republican presidential primary debate, the latest Fox News survey finds Donald Trump has increased both his lead in the race and his strength of support.",
    "url": "https://www.foxnews.com/official-polls/fox-news-poll-trump-expands-lead-gop-primary-race"
  },
  {
    "text": "Arkansas Department of Health  —  PRESS RELEASES  —  If you have media inquiries, please contact the Office of Health Communications at adh.communications@arkansas.gov.  —  « Go Back  —  Case of rare infection identified in Arkansas  —  Little Rock, Ark. - An Arkansas resident … ",
    "url": "https://www.healthy.arkansas.gov/news/detail/case-of-rare-infection-identified-in-arkansas"
  },
  {
    "text": "By Asking for Tanya Chutkan's Recusal, Trump Invited a Lesson in His Centrality to January 6  —  Trump's motion for Tanya Chutkan to recuse was not designed to work.  Rather, it was designed as a messaging vehicle, to establish the basis for Trump to claim that a Black Judge was biased … ",
    "url": "https://www.emptywheel.net/2023/09/15/by-asking-for-tanya-chutkans-recusal-trump-invited-a-lesson-in-his-centrality-to-january-6/"
  },
  {
    "text": "The secret thoughts of moderate Republicans  —  As a potential shutdown looms, Rep. Dave Joyce (R-Ohio), Chairman of the Republican Governance Group, explains why he and other moderates aren't panicking - yet.  —  It would be easy to look at the House of Representatives and assume … ",
    "url": "https://www.politico.com/news/2023/09/15/pbdd-david-joyce-house-gop-interview-00116052"
  },
  {
    "text": "The fate of hundreds of thousands of immigrants is caught in an endless court fight  —  The high stakes of the latest DACA decision, explained.  —  This week, DACA — or the Deferred Action for Childhood Arrivals program — was dealt another blow in court after a federal judge deemed the program illegal … ",
    "url": "https://www.vox.com/politics/2023/9/15/23874992/daca-immigration-ruling-biden-regulation-dreamers"
  }
]