[
  {
    "text": "‘No more games’: Biden rejects additional debates against Trump  —  Both campaigns agreed to two debates this week.  The Biden campaign said it wasn't interested in two additional face-offs that Trump has accepted.  —  President Joe Biden's campaign rejected two additional debates on Friday … ",
    "url": "https://www.nbcnews.com/politics/2024-election/biden-rejects-debates-trump-nbc-telemundo-fox-news-rcna152860"
  },
  {
    "text": "‘Never Trump?’  ‘Never Biden’ voters might loom larger.  —  Biden's ceiling of support is actually lower than Trump's right now.  It's a stark reversal from 2020 — with major implications.  —  Certain Democrats trying to cope with President Biden's continually underwhelming 2024 poll numbers share … ",
    "url": "https://www.washingtonpost.com/politics/2024/05/18/never-trump-never-biden-voters-might-loom-larger/"
  },
  {
    "text": "‘Political Malpractice’: The Debate Commission Chief Thinks Trump Blew It  —  Frank J. Fahrenkopf Jr. lets loose on the potentially mortal wound to the Commission on Presidential Debates, and why Biden got the better of Trump.  —  Despite all the talk that Joe Biden killed the Commission … ",
    "url": "https://www.politico.com/news/magazine/2024/05/17/debate-commission-chief-trump-00158689"
  },
  {
    "text": "AOC Reveals Darker Intentions Behind MTG Hearing Chaos … Representative Alexandria Ocasio-Cortez revealed Friday that the GOP-led House Oversight Committee abdicated normal procedures after the panel devolved into mudslinging, sparked by a characteristically bizarre outburst by Marjorie Taylor Greene.",
    "url": "https://newrepublic.com/post/181718/aoc-darker-intentions-mtg-hearing-chaos"
  },
  {
    "text": "GOP, Dems Round on MTG After Outburst: ‘Her Brand Is Chaos’  —  ‘ABSOLUTELY A RACIST THING’  —  Rep. Jasmine Crockett said Greene mentioning her eyelashes was an attempt to make her look “ghetto,” while even Rep. Lauren Boebert said she was embarrassed by her GOP colleague.",
    "url": "https://www.thedailybeast.com/gop-dems-round-on-mtg-after-committee-outburst-her-brand-is-chaos"
  },
  {
    "text": "Rudy Giuliani served with Arizona ‘fake electors’ indictment during 80th birthday bash in Palm Beach  —  Rudy Giuliani's 80th birthday bash in Palm Beach was stormed “like it was Normandy” as the former New York City mayor was served with notice of his Arizona indictment, sources told The Post.",
    "url": "https://nypost.com/2024/05/18/us-news/rudy-giuliani-served-with-arizona-fake-electors-indictment-during-80th-birthday-bash-in-palm-beach/"
  },
  {
    "text": "Rudy Giuliani served Arizona indictment same day as his 80th birthday party … - She also posted an X photo from Giuliani Friday.  — “If Arizona authorities can't find me by tomorrow morning: 1. … - Roger Stone and Steve Bannon, strategists for the former president, were also at the party, per ABC15.",
    "url": "https://www.axios.com/2024/05/18/rudy-giuliani-indicted-arizona-election-trump"
  },
  {
    "text": "Alito's Explanation for the Upside-Down American Flag Honestly Makes It Worse  —  We have known for some time now that the current Supreme Court is not comprised of “conservatives” and “liberals,” or even “jurists” and “reactionaries.”  It has split into those who care about the future … ",
    "url": "https://slate.com/news-and-politics/2024/05/alito-flag-supreme-court-justices-stop-the-steal-ethics-rules-pitiful.html"
  },
  {
    "text": "Justice Sam Alito Blames His Wife for Flying a Very Sedition-y Flag Outside Their House in 2021  —  Seems like a great thing for someone who is currently deliberating the concept of sweeping presidential immunity to have lying around.  —  Sometimes, there is no place else to go except deep … ",
    "url": "https://www.esquire.com/news-politics/politics/a60825069/supreme-court-alito-inverted-flag/"
  },
  {
    "text": "Biden Likens MAGA Movement to Segregationists in Speech to NAACP  —  President Biden drew a parallel on Friday between Donald Trump “and his MAGA Republican allies” and segregationists in the 1950s who tried to prevent Black and white Americans from going to school together.",
    "url": "https://time.com/6979631/biden-likens-maga-to-segregationists/"
  },
  {
    "text": "Bridget and Christian Ziegler ‘Prowled’ Florida Bars for Women, Police Memo Says  —  PREDATORY  —  “Don't come home until your d*ck is wet,” Moms For Liberty founder Bridget Ziegler allegedly told her husband.  —  Newly released documents say Moms For Liberty co-founder Bridget Ziegler … ",
    "url": "https://www.thedailybeast.com/bridget-and-christian-ziegler-prowled-florida-bars-in-search-of-women-to-have-sex-with-docs"
  },
  {
    "text": "Unpacking the presidential money machines  —  A POLITICO analysis of campaign finance filings shows clear contrasts between Trump's and Biden's sprawling political operations.  —  Donald Trump's political operation had a startling weakness as the general election kicked off this year … ",
    "url": "https://www.politico.com/news/2024/05/18/trump-biden-2024-campaign-spending-00158758"
  },
  {
    "text": "Rich, Loyal and Good Looking: Why Little-Known Doug Burgum Is in Trump's VP Mix  —  The presumptive Republican nominee likes North Dakota's governor—and his rich friends  —  WASHINGTON—As court adjourned for lunch Tuesday in Donald Trump's hush-money trial, the former president's lawyers … ",
    "url": "https://www.wsj.com/politics/elections/doug-burgum-trump-vp-shortlist-e41a2b45"
  },
  {
    "text": "Senior Mike Johnson Staffer Resigns Over Behavioral Complaints … A senior communications staffer in Speaker Mike Johnson's office abruptly resigned this week after he was presented with complaints about his behavior, sources confirmed to NOTUS.  —  Anang Mittal, who was Johnson's head of digital … ",
    "url": "https://www.notus.org/congress/senior-mike-johnson-staffer-resigns-over-behavioral-complaints"
  }
]