[
  {
    "text": "Trump shares cryptic ‘dictatorship’ word cloud on Truth Social  —  It's not the first time Trump has called himself a dictator, but it's the first time he's said it via word cloud.  —  Voters surveyed by the Daily Mail described former President Donald Trump's political goals as “corruption,” “revenge” and “dictatorship.”",
    "url": "https://www.politico.com/news/2023/12/26/trump-cryptic-dictatorship-truth-social-00133219"
  },
  {
    "text": "Voters describe their 2024 choice between a Trump second term and a Biden second term as a choice between REVENGE or NOTHING in Daily Mail poll  — JL Partners asked 1000 voters for a word to sum up Biden and Trump's plans  — The results suggest the nation has a bleak view of the 2024 candidates",
    "url": "https://www.dailymail.co.uk/news/article-12890411/Voters-2024-choice-Trump-second-term-Biden-second-term-choice-REVENGE-Daily-Mail-poll.html"
  },
  {
    "text": "Vivek Ramaswamy's campaign stops all TV ad spending less than a month before Iowa and New Hampshire  —  A spokesperson for the GOP candidate's presidential campaign said it has “the ability to be nimble and hyper targeted” in ad spending going forward.  —  Vivek Ramaswamy's presidential campaign … ",
    "url": "https://www.nbcnews.com/politics/2024-election/vivek-ramaswamys-campaign-stops-tv-ad-spending-less-month-iowa-new-ham-rcna131240"
  },
  {
    "text": "Ramaswamy campaign stops TV ad spending  —  The biotech entrepreneur's campaign for the Republican nomination has been sputtering in recent months.  —  Vivek Ramaswamy's presidential campaign has ceased spending on television advertising ahead of next month's Republican presidential contests, NBC News reported Tuesday.",
    "url": "https://www.politico.com/news/2023/12/26/ramaswamy-campaign-stops-tv-ad-spending-00133221"
  },
  {
    "text": "Melania Thinks It's Time to ‘Leave Her Mark on History’  —  OUT OF THE SHADOWS  —  Melania Trump is reportedly ready for her moment in the spotlight.  The former first lady, who's made only a handful of public appearances since Donald Trump left office, was reportedly encouraged by her … ",
    "url": "https://www.thedailybeast.com/melania-trump-thinks-its-time-to-leave-her-mark-on-history"
  },
  {
    "text": "Hunt to Announce UK Budget March 6 as Tories Push for Giveaways  — Treasury announces budget date in emailed statement Wednesday  — Timing gives Conservatives leeway over when to call election  —  Chancellor of the Exchequer Jeremy Hunt will announce the UK's next budget on March 6 … ",
    "url": "https://www.bloomberg.com/news/articles/2023-12-27/hunt-to-announce-uk-budget-march-6-as-tories-push-for-giveaways"
  },
  {
    "text": "1st Amendment claim struck down in Project Veritas case focused on diary of Biden's daughter  —  Criminal prosecutors may soon get to see over 900 documents pertaining to the alleged theft of a diary belonging to President Joe Biden's daughter after a judge rejected the conservative group Project Veritas' First Amendment claim.",
    "url": "https://apnews.com/article/project-veritas-okeefe-first-amendment-biden-2eebae06ea33abdf1bb130e93e486755"
  },
  {
    "text": "The DEI Rollback of 2023  —  States start to limit programs that sow racial and political division.  —  The diversity, equity and inclusion (DEI) bureaucracy on campus has proliferated in recent years, but there are signs it's finally meeting resistance.  The latest good news is from Wisconsin … ",
    "url": "https://www.wsj.com/articles/dei-wisconsin-oklahoma-state-universities-88ecc684?mod=followamazon"
  },
  {
    "text": "Schaeuble, German Minister and Fiscal Guardian, Dies at 81  — Schaeuble oversaw balanced budgets, helped in reunification  — Merkel appointed him as German finance minister in 2009  —  Wolfgang Schaeuble, who helped forge German reunification before being toppled from party leadership … ",
    "url": "https://www.bloomberg.com/news/articles/2023-12-27/schaeuble-who-helped-forge-german-reunification-dies-at-81"
  },
  {
    "text": "Prosecutors oppose Sen. Bob Menendez's effort to delay May bribery trial until July  —  NEW YORK (AP) — Federal prosecutors on Tuesday urged a judge to reject U.S. Sen. Bob Menendez's request to delay his bribery trial scheduled for next spring by two months, until July.",
    "url": "https://apnews.com/article/bob-menendez-wife-defendants-bribery-indictment-af5d97b5b9c1371cf48eebde10fb33c9"
  },
  {
    "text": "After Nashville School Shooting, Parents Push for Gun Control Action  —  A group of parents reeling from a mass shooting at their children's private Christian school believed no one was in a better position to persuade the G.O.P. to enact limited gun control.  —  Mary Joyce told herself she would be kind, just as she always had been.",
    "url": "https://www.nytimes.com/2023/12/26/us/politics/nashville-school-shooting-covenant-parents.html"
  },
  {
    "text": "U.S. strikes Iran-backed militias in Iraq after troops are wounded in drone attack  —  U.S. forces launched retaliatory airstrikes against Iranian-backed militias in Iraq on Monday after a drone attack that injured three service members, the Pentagon said, the latest response to dozens … ",
    "url": "https://www.washingtonpost.com/national-security/2023/12/26/us-airstrike-iraq-kataib-hezbollah/"
  },
  {
    "text": "Israeli military says Gaza ground offensive has expanded into urban refugee camps  —  Gaza's more than 54,500 wounded include a growing number of amputees.  Health officials say overwhelmed hospitals at times had to amputate limbs, which in normal times could have been saved.",
    "url": "https://apnews.com/article/israel-hamas-war-news-12-26-2023-698c895797ccb057d13fe4f68690c98b"
  },
  {
    "text": "An avalanche of money is coming to kick Lauren Boebert out of Congress  — Lauren Boebert was nearly unseated in 2022 by Adam Frisch, a Democrat who's running again in 2024.  — He's raised more money than all but two members of Congress and the most of any nonincumbent.",
    "url": "https://www.businessinsider.com/lauren-boebert-fundraising-adam-frisch-congress-2023-12"
  }
]