[
  {
    "text": "Back in their districts, GOP lawmakers get an earful on DOGE and Musk  —  Town halls from Wisconsin to Oregon grew testy this week as concerned voters showed up to vent  —  ROSWELL, Georgia — The crowd packed into City Hall and filled an overflow room with one question, above all … ",
    "url": "https://www.washingtonpost.com/politics/2025/02/21/doge-georgia-town-hall-gop/"
  },
  {
    "text": "French leader cancels CPAC speech after Bannon's apparent Nazi salute … - Bannon did not immediately respond to Axios' request for comment.  — A CPAC representative did not respond to a request for comment Friday. … - “As a result, I have taken the immediate decision to cancel … ",
    "url": "https://www.axios.com/2025/02/21/steve-bannon-cpac-nazi-salute-french-leader"
  },
  {
    "text": "Stock Market Sees Biggest Declines of Trump's Presidency So Far  —  Fueling a 1.7 percent decline on Friday was an unexpected drop in the University of Michigan's consumer sentiment index, as Americans worried about stubborn inflation.  —  Stocks slumped on Friday, with the S&P 500 wiping … ",
    "url": "https://www.nytimes.com/2025/02/21/business/stock-market-declines-trump.html"
  },
  {
    "text": "US consumer sentiment plunges over tariff and inflation fears  —  Inflation is picking up again and President Donald Trump said this week it's all his predecessor's fault.  But no matter who Trump blames for inflation, America's economic mood is now souring — and Trump is getting the heat for it.",
    "url": "https://www.cnn.com/2025/02/21/economy/consumer-sentiment-inflation-tariffs?Date=20250221&Profile=cnnbrk"
  },
  {
    "text": "Trump administration reassigning acting ICE director  —  Caleb Vitello, who the administration had chosen to run ICE on an interim basis, is out amid anger from the president and border czar over the pace of deportations.  —  The Trump administration has removed Caleb Vitello … ",
    "url": "https://www.nbcnews.com/politics/national-security/trump-administration-reassigning-acting-ice-director-rcna193225"
  },
  {
    "text": "‘Precision is the priority’?  Trump administration pauses some mass firings  —  One White House official says there is now a reluctance to fire veterans.  —  After a chaotic first wave of mass firings, Trump administration officials say they are slowing the pace of gutting certain agencies … ",
    "url": "https://www.politico.com/news/2025/02/21/trump-administration-federal-employees-firing-slowdown-00205540"
  },
  {
    "text": "Ex-Proud Boys leader Enrique Tarrio arrested on assault charge outside U.S. Capitol  —  Tarrio was released from prison last month after President Donald Trump cut short his 22 year prison sentence for seditious conspiracy related to the Jan. 6, 2021 attack on the Capitol.",
    "url": "https://www.nbcnews.com/politics/politics-news/ex-proud-boys-leader-enrique-tarrio-arrested-assault-charge-us-capitol-rcna193246"
  },
  {
    "text": "AP sues 3 Trump administration officials, citing freedom of speech  —  The Associated Press sued three Trump administration officials Friday over access to presidential events, citing freedom of speech in asking a federal judge to stop the 10-day blocking of its journalists.",
    "url": "https://apnews.com/article/ap-lawsuit-trump-administration-officials-0352075501b779b8b187667f3427e0e8"
  },
  {
    "text": "Trump's Firing Spree at FAA Was Even More Terrible Than He Admitted  —  The Trump administration's Federal Aviation Administration firings are much worse than they initially let on.  —  Politico has reported that the 130 terminated FAA workers last month included critical employees who directly … ",
    "url": "https://newrepublic.com/post/191818/trump-firing-spree-faa"
  },
  {
    "text": "Trump and Elon's ‘Pointless Bloodbath’ at the FAA Is Even Worse Than You Think  —  The Trump administration fired several FAA lawyers tasked with helping keep reckless and drunk pilots out of the skies — and officials are baffled  —  Late last week, just as Presidents' Day weekend was starting … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-elon-musk-faa-air-planes-pointless-bloodbath-1235274324/"
  },
  {
    "text": "Supreme Court maintains pause on Trump bid to immediately fire watchdog agency head  —  The Supreme Court, which has a 6-3 conservative majority, weighs in on a case involving the new Trump administration for the first time.  —  WASHINGTON — The Supreme Court on Friday for now prevented President Donald … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-maintains-pause-trump-bid-immediately-fire-watchdog-agen-rcna192643"
  },
  {
    "text": "Inside DOGE's Dumbest Cut Yet  —  Andrew had meant to spend yesterday soaking in the sights and sounds at CPAC, but found himself tied up reporting our lead story below.  So he missed Vice President JD Vance's culture-war ruminations, Steve Bannon's calls for a third Trump term in 2028 … ",
    "url": "https://www.thebulwark.com/p/inside-doges-dumbest-cut-yet"
  },
  {
    "text": "Rep. Cory Mills Is Under Investigation for Alleged Assault, Police Say  —  The Florida lawmaker, who intends to run for the Senate, is being investigated by D.C.'s Metropolitan Police Department for an incident reported at a residential address.  — Copy",
    "url": "https://www.notus.org/congress/rep-cory-mills-under-investigation-for-assault-police-say"
  },
  {
    "text": "‘See You In Court’: Maine Gov. Goes Head-To-Head With Trump Over Trans Athlete Ban  —  Democrat Janet Mills had a heated exchange with Trump after he threatened to withhold federal funds to states that don't obey his executive order.  —  LOADING  —  Maine Gov. Janet Mills (D) … ",
    "url": "https://www.huffpost.com/entry/janet-mills-spars-trump-trans-athlete-order_n_67b8d114e4b09eb9377046ee"
  },
  {
    "text": "The University of Pittsburgh pauses its Ph.D. admissions process amid research funding uncertainty  —  Amid uncertainty about frozen research aid from the National Institutes of Health, the University of Pittsburgh has put its Ph.D. admissions on ice.  The school confirmed Friday … ",
    "url": "https://www.wesa.fm/health-science-tech/2025-02-21/university-pittsburgh-phd-pause-research-funding-uncertainty"
  },
  {
    "text": "Trump Issued Perhaps His Most Terrifying Executive Order on Tuesday  —  Over the past month, many have warned that President Donald Trump is trying to make himself king or dictator.  Trump's defenders wave off such warnings as hysterical hyperbole.  The past week has shown that they are very much not.",
    "url": "https://slate.com/news-and-politics/2025/02/king-donald-trump-terrifying-executive-order.html"
  },
  {
    "text": "Richard Grenell: There will be conditions on Los Angeles fire aid  —  The Trump administration special envoy said the White House is talking about what the conditions will be.  —  President Donald Trump's special envoy Richard Grenell said there will be strings attached to California wildfire aid.",
    "url": "https://www.politico.com/news/2025/02/21/california-wildfire-aid-conditions-trump-administration-00205479"
  },
  {
    "text": "MAGA takes aim at the Republican hawks  —  Trump loyalists are sending a message to the GOP's foreign policy traditionalists.  —  Top allies of President Donald Trump are in an escalating clash with the Republican Party's once-powerful defense hawks, viewing them as key obstacles standing … ",
    "url": "https://www.politico.com/news/2025/02/21/trump-gop-foreign-policy-hawks-00002463"
  },
  {
    "text": "The foundations of America's prosperity are being dismantled  —  Federal scientists warn that Americans could feel the effects of the new administration's devastating cuts for decades to come  —  Ever since World War II, the US has been the global leader in science and technology—and benefited immensely from it.",
    "url": "https://www.technologyreview.com/2025/02/21/1112274/the-foundations-of-americas-prosperity-are-being-dismantled/"
  },
  {
    "text": "I cannot describe how strange Elon Musk's CPAC appearance was  —  So here's a literal transcript, instead. … Elon Musk spoke at the Conservative Political Action Conference (CPAC) on Thursday, giving a strange and often inarticulate on-stage interview to Newsmax presenter Rob Schmitt.",
    "url": "https://www.theverge.com/elon-musk/617090/elon-musk-cpac-2025-transcript"
  },
  {
    "text": "Melania Trump's Astonishing Verdict on Her Husband Revealed  —  A bombshell new book makes some startling new revelations about Donald Trump's bizarre marriage to Melania.  “She f—ing hates him,” a “Mar-a-Lago patio confidant” of Trump and his family told Michael Wolff.",
    "url": "https://www.thedailybeast.com/melania-trumps-astonishing-verdict-on-her-husband-revealed-in-bombshell-book/"
  },
  {
    "text": "Trump Administration Stalls Scientific Research Despite Court Ruling  —  Using an arcane law, officials have effectively delayed funding from the National Institutes of Health, leaving medical studies in jeopardy.  —  The Trump administration has blocked key parts of the federal government's apparatus … ",
    "url": "https://www.nytimes.com/2025/02/21/science/nih-research-funding-delays.html?unlocked_article_code=1.yk4.qNQA.zVPAsVztAZ3p&smid=url-share"
  },
  {
    "text": "Texas Measles Outbreak Nears 100 Cases, Raising Concerns About Undetected Spread  —  Some private schools have shut down because of a rapidly escalating measles outbreak in West Texas.  Local health departments are overstretched, pausing other important work as they race to limit the spread of this highly contagious virus.",
    "url": "https://kffhealthnews.org/news/article/texas-measles-outbreak-escalates-undetected-cases-vaccinations/"
  },
  {
    "text": "Trump to shut down all 8,000 EV charging ports at federal govt buildings  —  The Trump administration is shutting down EV chargers at all federal government buildings and is also expected to sell off the General Services Administration's (GSA) newly bought EVs.",
    "url": "https://electrek.co/2025/02/21/trump-to-shut-down-all-8000-ev-charging-ports-at-federal-govt-buildings/"
  },
  {
    "text": "DOGE hits a roadblock at the IRS  —  Welcome to The Logoff.  Today I have an update on the fight over your tax data, where the Trump administration has backed off a plan to give a DOGE staffer access to ultra-sensitive tax information.  —  Wait, what did the White House want?",
    "url": "https://www.vox.com/the-logoff-newsletter-trump/400819/doge-elon-musk-trump-irs"
  },
  {
    "text": "Census Bureau stopped work on data for protecting trans rights, former director says  —  After President Trump put out an executive order targeting gender identity, the U.S. Census Bureau stopped work on producing statistics that could help protect the rights of transgender people, the bureau's recently departed leader tells NPR.",
    "url": "https://www.npr.org/2025/02/21/nx-s1-5305265/census-lgbtq-sogi-data-robert-santos"
  },
  {
    "text": "Europe targets homegrown nuclear deterrent as Trump sides with Putin  —  Germany's Merz says Britain and France may need to “share” their nuclear weapons as America can't be relied on to defend NATO.  —  Europe's politicians are openly discussing how they could tackle the threat … ",
    "url": "https://www.politico.eu/article/europe-nuclear-weapons-nato-donald-trump-vladimir-putin-friedrich-merz/"
  },
  {
    "text": "Former Intelligence Officer Claims KGB Recruited Trump  —  A former Soviet intelligence officer has alleged that Donald Trump was recruited by the KGB in 1987 and given the codename “Krasnov.”  Alnur Mussayev, 71, a former head of intelligence in Kazakhstan and before that a Soviet KGB officer … ",
    "url": "https://www.thedailybeast.com/former-intelligence-officer-alnur-mussayev-claims-kgb-recruited-donald-trump-under-codename-krasnov/"
  },
  {
    "text": "This Executive Order Reveals the Trump-Musk Endgame  —  A recent order aimed at destroying independent regulatory agencies isn't just about taking control of the state—it's a giant cash-grab in disguise.  —  Bluesky  —  Pocket  —  The orders and actions of Donald Trump and his co-president Elon Musk are all part of a piece.",
    "url": "https://www.thenation.com/article/politics/executive-order-independent-agencies-trump/"
  },
  {
    "text": "DOGE Put Him in the Treasury Department.  His Company Has Federal Contracts Worth Millions  —  Experts say the conflicts posed by Tom Krause's dual roles are unprecedented in the modern era.  —  Over the past couple of decades, a number of US government officials have left their roles for lucrative jobs at tech companies.",
    "url": "https://www.wired.com/story/krause-doge-cloud-software-treasury/"
  },
  {
    "text": "Here Are the Digital Clues to What Musk Is Really Up To  —  Watching Elon Musk and his band of young acolytes slash their way through the federal government, many observers have struggled to understand how such a small group could do so much damage in so little time.",
    "url": "https://www.nytimes.com/2025/02/21/opinion/musk-doge-personal-data.html?unlocked_article_code=1.yk4.O2ww.EqSwpkYxIUSl&smid=nytcore-ios-share&referringSource=articleShare"
  }
]