[
  {
    "text": "Donald Trump has a big problem ahead  —  A whole swath of GOP voters appears firmly committed to not voting for Trump in November.  —  Donald Trump has a problem no matter what happens in New Hampshire on Tuesday night: There's a whole swath of the Republican electorate and a good chunk … ",
    "url": "https://www.politico.com/news/2024/01/23/trump-moderate-republicans-problem-00137112"
  },
  {
    "text": "Trump's surprise fan club: Why many Dems want him to win big in N.H. … Many Democrats are rooting for the same thing. … - The president's campaign has internal data indicating that most of the undecided voters Biden is targeting don't think Trump will be the Republican nominee … ",
    "url": "https://www.axios.com/2024/01/23/why-many-dems-want-trump-win-new-hampshire"
  },
  {
    "text": "The gamble Republicans are about to take on Trump  —  In a little more than 24 hours, New Hampshire Republican primary voters could effectively bring the 2024 nominating contest to a close.  —  Nikki Haley now has Donald Trump in the one-on-one race she had hoped for, but she trails in every poll in the state.",
    "url": "https://www.washingtonpost.com/politics/2024/01/22/trump-gamble-republicans/"
  },
  {
    "text": "Playbook: How Trump is winning on the issues  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  BREAKING OVERNIGHT — “21 Israeli troops are killed in the deadliest attack on the military since the Gaza offensive began,” by AP's Josef Federman and Najib Jobain … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/01/23/how-trump-is-winning-on-the-issues-00137155"
  },
  {
    "text": "Biden's age may be hurting him with independents in New Hampshire  —  And former U.N. ambassador Nikki Haley is leaning into that opening  —  MANCHESTER, N.H. — When Claire Preece went to see Nikki Haley speak this week, the registered independent was still conflicted over whether … ",
    "url": "https://www.washingtonpost.com/politics/2024/01/23/biden-age-new-hampshire-democratic-primary/"
  },
  {
    "text": "Florida plan to have taxpayers pay Trump's legal bills nixed after DeSantis veto threat  —  DeSantis suggested he would veto the proposal.  —  TALLAHASSEE, Florida — A push by some Florida Republicans to use taxpayer money to help pay for former President Donald Trump's multiple legal … ",
    "url": "https://www.politico.com/news/2024/01/22/florida-trump-legal-bills-00136984"
  },
  {
    "text": "Doomsday Clock time update says humanity is as close as ever to global catastrophe  —  We're still as close as ever to global catastrophe, according to the annual update of the Doomsday Clock, announced Tuesday morning.  —  The time on the symbolic clock is the same as last year … ",
    "url": "https://www.usatoday.com/story/news/nation/2024/01/23/doomsday-clock-announcement-2024/72311076007/"
  },
  {
    "text": "Jamie Dimon's MAGA warning to Dems is right on target  —  Call it a “road to Davos” moment: Jamie Dimon has seen the light.  —  The J.P. Morgan Chase CEO had liberals clutching at their pearls when he copped to a simple but (in some circles) unutterable truth: Former President Donald Trump … ",
    "url": "https://nypost.com/2024/01/22/opinion/jamie-dimons-maga-warning-to-dems-is-right-on-target/"
  },
  {
    "text": "Germany's surging far right provokes a reckoning  —  You're reading an excerpt from the Today's WorldView newsletter.  Sign up to get the rest free, including news from around the globe and interesting ideas and opinions to know, sent to your inbox every weekday.",
    "url": "https://www.washingtonpost.com/world/2024/01/23/germany-far-right-alternative-for-germany-afd-reckoning-protest-future/"
  },
  {
    "text": "How Steve Garvey became a punchline at the first California Senate debate  —  The Republican and former Dodger was an easy target for House Democrats on Thursday night.  —  LOS ANGELES — Steve Garvey was less a heavy hitter on Thursday night's Senate debate stage and more often a punchline.",
    "url": "https://www.politico.com/news/2024/01/23/steve-garvey-ca-senate-debate-punchline-00137143"
  },
  {
    "text": "The Rise of the American Oligarchy  —  What targeting Russia's wayward billionaires revealed about our own. … For the last 18 months one of the most opulent and unnecessary vessels ever constructed has been floating in a narrow channel next to a jungle gym and a fleet of industrial cranes at the Port of San Diego.",
    "url": "https://www.motherjones.com/politics/2024/01/american-oligarchy-introduction-essay-russia-ukraine-capitalism/"
  },
  {
    "text": "Immigration Wasn't Always a Divisive Issue in America  —  Why have Republicans and Democrats moved so far apart on immigration?  That's the question that drives the Opinion video above.  —  We are publishing this as President Biden comes under extraordinary pressure to curb surging illegal immigration at the southwestern border.",
    "url": "https://www.nytimes.com/2024/01/23/opinion/immigration-migrants-border-crisis.html"
  },
  {
    "text": "Exclusive: Israel's spy chief proposed Hamas leaders leave Gaza as part of broader ceasefire talks  —  Israel has proposed that Hamas senior leaders could leave Gaza as part of a broader ceasefire agreement, two officials familiar with the ongoing international discussions told CNN.",
    "url": "https://www.cnn.com/2024/01/22/politics/israel-proposal-hamas-leaders-leave-gaza"
  },
  {
    "text": "The tide turns on Florida book bans  —  For years, Florida has been at the vanguard of removing books from school libraries.  Florida Republicans, including Governor Ron DeSantis (R), insisted that school librarians were seeking to “groom” children with pornographic materials.",
    "url": "https://popular.info/p/the-tide-turns-on-florida-book-bans"
  },
  {
    "text": "U.S. Supreme Court says Texas can't block federal agents from the border  —  The high court's order effectively maintains long-running precedent that the federal government — not individual states — has authority to enforce border security.  —  The U.S. Supreme Court on Monday ordered Texas … ",
    "url": "https://www.texastribune.org/2024/01/22/texas-border-supreme-court-immigration/"
  }
]