[
  {
    "text": "NYPD Officer Fired Gun Inside Columbia's Hamilton Hall, Manhattan DA's Office Confirms  —  An officer inside Columbia University's Hamilton Hall Tuesday evening to break up a pro-Palestinian student demonstration fired his gun, in an incident that is now under review by Manhattan District … ",
    "url": "https://www.thecity.nyc/2024/05/02/nypd-officer-fired-gun-columbia-hamilton-hall-raid/"
  },
  {
    "text": "Police officer fired gun while clearing protesters from Columbia building, prosecutors say  —  Body camera video shows police cutting chains, moving furniture at Columbia University  —  Demonstrators detained at UCLA as police dismantle encampment  —  Protesters arrested at Dartmouth College",
    "url": "https://apnews.com/article/israel-palestinian-campus-student-protests-war-ec3f62c51c08599f8fcecd99f7cf9e33"
  },
  {
    "text": "Biden Calls Ally Japan ‘Xenophobic’ Along With China, Russia  — Remarks come weeks after Biden welcomed Japan's PM Kishida  — Immigration inches up in Japan, population still shrinking  —  US President Joe Biden included ally Japan along with rivals China and Russia in a list of countries he called … ",
    "url": "https://www.bloomberg.com/news/articles/2024-05-02/biden-now-calls-ally-japan-xenophobic-along-with-china-russia"
  },
  {
    "text": "In interview, Trump doesn't commit to accepting Wisconsin election results if he loses  —  Alison Dirr Molly BeckMilwaukee Journal Sentinel  —  WAUKESHA - Former President Donald Trump on Wednesday didn't commit to accepting the results of Wisconsin's presidential election in November … ",
    "url": "https://www.jsonline.com/story/news/politics/elections/2024/05/02/trump-doesnt-commit-to-accepting-wisconsin-election-results/73520131007/"
  },
  {
    "text": "Kristi Noem's VP chances appear as dead as the dog she killed.  There are other reasons too.  —  Noem had long ago been all but cast aside as a likely running mate, according to six people close to Donald Trump.  —  Kristi Noem's damage-control tour is in full swing.",
    "url": "https://www.politico.com/news/2024/05/02/kristi-noem-dog-trump-2024-00155856"
  },
  {
    "text": "Lawmakers announce dog lovers caucus in wake of Noem news  —  Bipartisan lawmakers on Tuesday announced the start of a dog lovers caucus on Capitol Hill in the wake of a story about South Dakota Gov. Kristi Noem (R-S.D.) shooting and killing a family dog.  —  “In light of recent events … ",
    "url": "https://thehill.com/homenews/house/4638846-lawmakers-announce-dog-lovers-caucus-in-wake-of-noem-news/"
  },
  {
    "text": "Sen. Lindsey Graham's phone being investigated for potential hack  —  The South Carolina senator said on Wednesday that the FBI was in possession of his phone.  —  WASHINGTON — Sen. Lindsey Graham said on Wednesday that the FBI was in possession of his phone after he received a message … ",
    "url": "https://www.nbcnews.com/politics/congress/sen-lindsey-grahams-phone-investigated-potential-hack-rcna150507"
  },
  {
    "text": "Schumer poised to join Johnson invite for Netanyahu address to Congress  —  Senate Majority Leader Chuck Schumer (D-N.Y.) is poised to join Speaker Mike Johnson (R-La.) in inviting Israeli Prime Minister Benjamin Netanyahu to deliver an address to Congress, despite tensions between … ",
    "url": "https://thehill.com/homenews/senate/4640068-schumer-johnson-netanyahu-invite/"
  },
  {
    "text": "Man who bragged that he ‘fed’ an officer to the mob of Capitol rioters gets nearly 5 years in prison  —  Jack Whitton expressed remorse for his ‘horrible’ actions.  —  A Georgia business owner who bragged that he “fed” a police officer to a mob of rioters storming the U.S. Capitol on Jan. 6 … ",
    "url": "https://www.politico.com/news/2024/05/02/jack-whitton-5-year-prison-sentence-00155868"
  },
  {
    "text": "Former Michigan House leader, wife plead not guilty to misusing political funds  —  The former leader of the Michigan House and his wife pleaded not guilty Thursday to financial charges arising from an investigation of how they spent money from unregulated political funds.",
    "url": "https://apnews.com/article/michigan-house-exlawmaker-charged-913f125eee550fadf896edbc9e06a5a9"
  },
  {
    "text": "Alarm in Israel at reports of possible ICC legal action over Gaza  —  Israeli officials are increasingly concerned that the UN's top criminal court is planning to seek arrest warrants for their military and political leaders on suspicion of war crimes.  —  Reports suggest Prime Minister Benjamin Netanyahu could be among them.",
    "url": "https://www.bbc.com/news/world-middle-east-68938022"
  },
  {
    "text": "Extremist Militias Are Coordinating in More Than 100 Facebook Groups  —  After lying low for years in the aftermath of January 6, exclusive reporting shows, militia extremist groups and profiles have been quietly reorganizing and ramping up recruitment and rhetoric on Facebook.",
    "url": "https://www.wired.com/story/extremist-militias-are-coordinating-on-facebook/"
  },
  {
    "text": "Arizona Gov. Katie Hobbs signs repeal of 1864 abortion ban  —  The near-total abortion ban is still likely to go into effect for a period of time due to unique aspects of state law.  —  Arizona Gov. Katie Hobbs signed on Thursday a repeal of the state's near-total abortion ban … ",
    "url": "https://www.nbcnews.com/politics/arizona-governor-signs-repeal-1864-abortion-ban-rcna150364"
  },
  {
    "text": "Don't Forget the Backlash to the '60s  —  Today's campus chaos carries a grim warning for Biden.  —  Mark Rudd, a leader of the student protest at Columbia University in New York, is interviewed outside Low Memorial Library, background, on April 25, 1968.  Students had occupied the building.  AP",
    "url": "https://www.politico.com/news/magazine/2024/05/02/why-campus-chaos-should-give-democrats-ptsd-00155537"
  },
  {
    "text": "Arkansas governor says state won't comply with new federal rules on treatment of trans students  —  Arkansas Gov. Sarah Huckabee Sanders declared Thursday that the state won't comply with a federal regulation that seeks to protect the rights of transgender students in the nation's schools … ",
    "url": "https://apnews.com/article/arkansas-title-ix-transgender-huckabee-sanders-bf44e0e7c6dc8f1e03149a790be3d2ef"
  },
  {
    "text": "Biden, speaking on campus protests, says both free speech and rule of law ‘must be upheld’  —  The president faced pressure from Republicans to step up his response.  —  President Joe Biden speaks about the protests over Israel's war against Hamas in Gaza in the Roosevelt Room of the White House, May 2, 2024, in Washington.",
    "url": "https://abcnews.go.com/Politics/biden-speaks-college-protests-israel-gaza-war/story?id=109870179"
  }
]