[
  {
    "text": "Judge orders Trump administration to halt indiscriminate immigration stops, arrests in California  —  A federal judge on Friday ordered the Trump administration to halt indiscriminate immigration stops and arrests in seven California counties, including Los Angeles.",
    "url": "https://apnews.com/article/california-immigration-stops-arrests-b4d59afc4aa6be4944e67f773aa34096"
  },
  {
    "text": "Judge Blocks Trump Administration Tactics in L.A. Immigration Raids  —  A federal judge temporarily halted the administration from making indiscriminate arrests based on race and denying detainees access to lawyers, in a lawsuit that could have national repercussions.",
    "url": "https://www.nytimes.com/2025/07/11/us/immigration-raids-judge-injunction.html?unlocked_article_code=1.V08._vUp.Dehy8cnOg4sa&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Judge orders halt to indiscriminate immigration operations in California  —  A federal judge ordered the Trump administration to halt arrests based on racial profiling and denying access to lawyers, saying the tactics are unconstitutional.  —  Summary993  —  A federal judge … ",
    "url": "https://www.washingtonpost.com/immigration/2025/07/11/judge-blocks-trump-immigration-raids/"
  },
  {
    "text": "Trump announces 30% tariffs against Mexico, EU to begin on Aug. 1  —  President Trump on Saturday announced he is levying 30% tariffs against Mexico and the European Union.  They are set to begin on August 1.  —  He announced the tariffs on two of the United States' biggest trade partners … ",
    "url": "https://www.cbsnews.com/news/trump-announcement-tariffs-mexico-european-union/"
  },
  {
    "text": "Trump Threatens Steep Tariffs on Goods From E.U. and Mexico  —  European leaders had been trying to negotiate more favorable terms for months.  They may retaliate with tariffs of their own.  —  President Trump announced in letters posted to social media on Saturday that he would place … ",
    "url": "https://www.nytimes.com/2025/07/12/us/politics/europe-eu-tariffs-trade.html"
  },
  {
    "text": "Trump unveils 30 percent tariff for EU, Mexico  —  President Trump on Saturday announced his administration would levy a 30 percent tariff on goods from Mexico and members of the European Union beginning Aug. 1, targeting two of the U.S.'s top trading partners.",
    "url": "https://thehill.com/business/5398099-donald-trump-tariffs-mexico-european-union-30-percent/"
  },
  {
    "text": "Trump says he'll slap 30% tariffs on Mexico, European Union on Aug. 1  —  Trump has spent the past several days sending letters to various world leaders about new tariffs the United States would be imposing on them.  —  President Donald Trump threatened Saturday morning to impose 30 percent tariffs … ",
    "url": "https://www.washingtonpost.com/politics/2025/07/12/trump-tariffs-mexico-european-union/"
  },
  {
    "text": "FEMA Didn't Answer Thousands of Calls From Flood Survivors, Documents Show  —  Two days after deadly Texas floods, the agency struggled to answer calls from survivors because of call center contracts that weren't extended.  —  Two days after catastrophic floods roared through Central Texas … ",
    "url": "https://www.nytimes.com/2025/07/11/climate/fema-missed-calls-texas-floods.html?unlocked_article_code=1.Vk8.HZRd.zn6zK44YkS7l&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Tech billionaire Trump adviser Marc Andreesen says universities will ‘pay the price’ for DEI  —  The investor in a private group chat also criticized Stanford and said colleges are biased against Trump voters: “My people are furious.”  —  Influential tech investor and Trump adviser Marc Andreessen recently … ",
    "url": "https://www.washingtonpost.com/technology/2025/07/12/marc-andreessen-private-chat-universities-diversity/"
  },
  {
    "text": "US Justice fires nine more employees from Jack Smith's team, sources say  —  U.S. Attorney General Pam Bondi on Friday fired at least nine more Justice Department employees who worked for Special Counsel Jack Smith to investigate President Donald Trump's retention of classified records … ",
    "url": "https://www.reuters.com/world/us/us-justice-fires-nine-more-employees-jack-smiths-team-sources-say-2025-07-12/"
  },
  {
    "text": "Deputy FBI Director Bongino has told people he is considering resigning amid Epstein files fallout  —  Deputy FBI Director Dan Bongino has told people he is considering resigning amid a major clash between the FBI and Justice Department over the continued fallout from the release of the Jeffrey Epstein memo … ",
    "url": "https://cnn.com/2025/07/11/politics/bongino-consider-resigning-epstein-files"
  },
  {
    "text": "Contrarians to the Rescue on Birthright Citizenship!  —  Publisher's Roundup 26  —  A couple of weeks ago, when the Roberts Court struck down some nationwide injunctions protecting birthright citizenship in the Casa case, we here at The Contrarian told you not to panic.",
    "url": "https://contrarian.substack.com/p/contrarians-to-the-rescue-on-birthright"
  },
  {
    "text": "David Gergen, political insider who advised four presidents of both parties, dies at 83  —  David Gergen, who served as a presidential adviser to four presidents of both parties and educated generations of Americans about leadership and civic engagement, has died.  He was 83.",
    "url": "https://cnn.com/2025/07/11/politics/david-gergen-dead"
  },
  {
    "text": "Lights Out: U.S. Withdraws Support for Global Media  —  Foreign aid cuts to USAID, other outlets, cast a long shadow over journalism around the world  —  In the 12 years since Radio Rozana's first broadcast, founder Lina Chawaf has worked tirelessly to expand the outlet's coverage of her native Syria.",
    "url": "https://niemanreports.org/usaid-ned-usagm-cuts-doge-trump/"
  },
  {
    "text": "Columbia Has Discussed $200 Million Payment in Civil-Rights Settlement With Trump Administration  —  The Ivy League school has been locked in battle with the government for months  —  Columbia University has discussed paying roughly $200 million as part of a deal with the Trump administration … ",
    "url": "https://www.wsj.com/us-news/education/trump-columbia-civil-rights-settlement-86f64531?st=aMeaJX&reflink=desktopwebshare_permalink"
  },
  {
    "text": "US demands to know what allies would do in event of war over Taiwan  —  Trump administration raises eyebrows by calling for commitments from Australia and Japan  —  Unlock the White House Watch newsletter for free  —  The Pentagon is pressing Japan and Australia to make clear what role … ",
    "url": "https://www.ft.com/content/41e272e4-5b25-47ee-807c-2b57c1316fe4"
  },
  {
    "text": "Trump's Crypto Firm Raised $52 Million—Likely Sending Millions To His Family, New Disclosure Reveals  —  Topline  —  President Donald Trump's decentralized finance venture, World Liberty Financial, raised $52.1 million through private sales of its crypto token—likely sending tens of millions … ",
    "url": "https://www.forbes.com/sites/zacheverson/2025/07/12/trump-world-liberty-financial-crypto-sec-tokens-wlfi-usd1/"
  },
  {
    "text": "Why Trump's Admin Insists on Terrorizing Kilmar Abrego Garcia  —  A Trump adviser says officials worry about “a domino effect of decisions where suddenly you're admitting you're wrong about everything” … Trump officials refused to bring Abrego Garcia back to the U.S., as the Supreme Court had ordered … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-kilmar-abrego-garcia-el-salvador-south-sudan-1235384278/"
  },
  {
    "text": "Donald Trump could trigger another market shock, investors warn  —  Fund managers and bankers cast doubt on bets US president will back down from most severe threats  —  Kate Duguid, Harriet Clarfelt and James Fontanella-Khan in New York, and Amelia Pollard in London",
    "url": "https://www.ft.com/content/d3f2510b-f4df-4df3-a289-43fa7c167308?accessToken=zwAGObyoqePIkdPT8lEL9N9N89OiiUP6fBZzCA.MEYCIQC18U8h3CaEYp-sn_46zTv0spgvfXZ5MSlJLROs9vBPOAIhAJkKawxoxyg10sFT_o5863zbp2twKalqj6FwN4NFm4g6&sharetype=gift&token=09f1ca9c-ac67-4a39-8486-bd317fb19bb1"
  },
  {
    "text": "“Behind the Curtain” Extra: Trump's great immigration peril … The politics of immigration are shifting fast — again. … But now, with the border secure and deportations surging along with self-deportations, a strong majority are opposed to President Trump's tough-guy, kick-them-all-out approach to illegal immigration.",
    "url": "https://www.axios.com/2025/07/12/trump-immigration-peril-behind-the-curtain-extra"
  },
  {
    "text": "The Administration's Contempt for the Rule of Law Has Roots in the Pre-Civil Rights Era  —  Defenders of liberal democracy cannot succumb to Donald Trump's attempts to scare them into inaction  —  America is supposed to be the land of the brave, but under the second administration of Donald Trump, it's fallen under a climate of fear.",
    "url": "https://www.theunpopulist.net/p/the-administrations-contempt-for"
  },
  {
    "text": "Scoop: Putin urges Iran to take “zero enrichment” nuclear deal with U.S., sources say  —  Russian President Vladimir Putin has told both President Trump and Iranian officials that he supports the idea of a nuclear deal in which Iran is unable to enrich uranium, sources familiar with those discussions tell Axios.",
    "url": "https://www.axios.com/2025/07/12/putin-iran-nuclear-deal-uranium-enrichment"
  }
]