[
  {
    "text": "Exclusive: The White House is looking to replace Pete Hegseth as defense secretary  —  The White House has begun the process of looking for a new secretary of defense, according to a U.S. official who was not authorized to speak publicly.  —  This comes as Defense Secretary Pete Hegseth continues to find himself mired in controversy.",
    "url": "https://www.npr.org/2025/04/21/nx-s1-5371312/trump-white-house-pete-hegseth-defense-department"
  },
  {
    "text": "‘An amateur person’: GOP Rep. Bacon says Hegseth should go  —  The Nebraska lawmaker is the first House Republican to recommend the president fire the secretary of Defense.  —  Rep. Don Bacon, a prominent Republican on the House Armed Services Committee, became the first sitting GOP lawmaker Monday … ",
    "url": "https://www.politico.com/news/2025/04/21/don-bacon-recommends-firing-hegseth-00301057"
  },
  {
    "text": "Playbook PM: Trump backs Hegseth  —  FOR PETE'S SAKE: The Trump administration held steady in defense of Pete Hegseth today and instead went after his critics in the wake of this weekend's revelations.  —  Never back down: President Donald Trump said consternation about the Defense secretary was a … ",
    "url": "https://www.politico.com/newsletters/playbook-pm/2025/04/21/trump-backs-hegseth-00132333"
  },
  {
    "text": "White House backs Hegseth, Leavitt says ‘entire Pentagon’ is resisting him  —  Hegseth “is doing phenomenal leading the Pentagon,” Leavitt said during a Monday “Fox & Friends” appearance.  —  President Donald Trump “stands strongly behind Pete Hegseth,” press secretary Karoline Leavitt said Monday morning … ",
    "url": "https://www.politico.com/news/2025/04/21/leavitt-trump-stands-strongly-behind-embattled-hegseth-00300749"
  },
  {
    "text": "Homeland Security Secretary Kristi Noem's bag, including $3,000 in cash, is stolen from DC restaurant  —  Department of Homeland Security Secretary Kristi Noem fell victim to a thief while eating dinner at a downtown Washington, DC, restaurant Sunday night, two sources familiar with the incident … ",
    "url": "https://cnn.com/2025/04/21/politics/homeland-security-kristi-noem-purse-stolen/"
  },
  {
    "text": "Kristi Noem's Bag, With Security Badge and $3,000, Is Stolen  —  The homeland security secretary was dining at a Washington, D.C., restaurant.  She also lost her passport and keys.  —  A handbag belonging to the homeland security secretary Kristi Noem containing her passport … ",
    "url": "https://www.nytimes.com/2025/04/21/us/politics/kristi-noem-purse-stolen.html"
  },
  {
    "text": "Pope Francis, first Latin American pontiff who ministered with a charming, humble style, dies at 88  —  Pope Francis, history's first Latin American pontiff who charmed the world with his humble style and concern for the poor but alienated conservatives with critiques of capitalism and climate change, died Monday.",
    "url": "https://apnews.com/article/vatican-pope-francis-dead-01ca7d73c3c48d25fd1504ba076e2e2a"
  },
  {
    "text": "Trump Aides Solicit Ideas to Raise Birthrate, From Baby Bonuses to Fertility Planning … “We need to channel the MAHA spirit and really dive deep into infertility,” said Emma Waters, a policy analyst at the Heritage Foundation, referring to Robert F. Kennedy Jr.'s Make America Healthy Again campaign.Rebecca Kiger for The New York Times",
    "url": "https://www.nytimes.com/2025/04/21/us/politics/trump-birthrate-proposals.html"
  },
  {
    "text": "My Dinner With Adolf  —  Imagine my surprise when in the spring of 1939 a letter arrived at my house inviting me to dinner at the Old Chancellery with the world's most reviled man, Adolf Hitler.  I had been a vocal critic of his on the radio from the beginning, pretty much predicting everything … ",
    "url": "https://www.nytimes.com/2025/04/21/opinion/larry-david-hitler-dinner.html?unlocked_article_code=1.BU8.iA11.gp0VbsxPOiVa&smid=url-share"
  },
  {
    "text": "145. Justice Alito's Misbegotten Dissent in A.A.R.P.  —  Justice Alito's after-the-fact opinion dissenting from the Court's early-Saturday-morning Alien Enemy Act ruling rests on a revealing array of misrepresentations, misstatements, and non-sequiturs.  —  Welcome back to “One First,” … ",
    "url": "https://www.stevevladeck.com/p/145-justice-alitos-misbegotten-dissent"
  },
  {
    "text": "House Dems travel to El Salvador to secure Maryland man's return  —  More Democrats are making the trip abroad to raise awareness for what they call a “constitutional crisis” surrounding Kilmar Abrego Garcia's deportation.  —  Four more Democratic lawmakers have landed in El Salvador … ",
    "url": "https://www.politico.com/news/2025/04/21/house-democrats-el-salvador-maryland-man-return-00300733"
  },
  {
    "text": "How Democrats Won Wisconsin In 2025: Turnout.  —  Democrats swelled with confidence after their victory in the State Supreme Court race in Trump-won Wisconsin.  It seemed that public opinion swung sharply against Donald Trump and the GOP despite Elon Musk's eight-figure investment in the state.",
    "url": "https://split-ticket.org/2025/04/21/how-did-democrats-win-wisconsin-in-2025/"
  },
  {
    "text": "The “sell America” trade has reached levels not seen since the 1980s  —  Traders are dumping US assets like mullets are back in style and “Endless Love” is topping the Billboard Hot 100.  —  Rising recession risks thanks to onerous tariffs have catalyzed a global downgrade of US stocks … ",
    "url": "https://sherwood.news/markets/the-sell-america-trade-has-reached-levels-not-seen-since-the-1980s/"
  },
  {
    "text": "Tesla Slides as Analyst Warns of ‘Code Red’ Ahead of Earnings … Wedbush Securities analyst Dan Ives said Tesla's chief executive officer should step back from his controversial work at the Department of Government Efficiency and re-focus his attention on the carmaker.",
    "url": "https://www.bloomberg.com/news/articles/2025-04-21/tesla-bull-calls-code-red-saying-musk-needs-to-leave-doge?accessToken=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzb3VyY2UiOiJTdWJzY3JpYmVyR2lmdGVkQXJ0aWNsZSIsImlhdCI6MTc0NTE5Nzg1OCwiZXhwIjoxNzQ1ODAyNjU4LCJhcnRpY2xlSWQiOiJTVjFIMkdUMEFGQjQwMCIsImJjb25uZWN0SWQiOiIxNTI1ODQyQjlGOEY0MDMzQUVGNjI4MTNFMkIxMEY0OSJ9.0SEG4_7ieov83Km6AwnbBGaF7ByqtOnsaRNTNGuFtuo"
  },
  {
    "text": "Pope's death due to stroke and irreversible cardiocirculatory collapse  —  The Director of the Directorate of Health and Hygiene of the Vatican City State, Dr. Andrea Arcangeli, releases the official medical report on the death of Pope Francis, which was confirmed through electrocardiographic thanatography.",
    "url": "https://www.vaticannews.va/en/pope/news/2025-04/pope-francis-death-due-to-stroke-and-irreversible-cardiocircula.html"
  },
  {
    "text": "The ‘5 things’ emails are going by the wayside as Musk readies his exit  —  After the DOGE leader demanded federal workers list accomplishments, agencies applied an inconsistent patchwork of policies.  —  When Elon Musk and President Donald Trump commanded all federal workers … ",
    "url": "https://www.washingtonpost.com/politics/2025/04/21/doge-musk-trump-federal-employees-emails/"
  },
  {
    "text": "Delta plane engine catches fire at Orlando airport, passengers evacuate on slides  —  A Delta passenger jet caught fire on the tarmac at Orlando International Airport Monday and passengers had to evacuate via the emergency slides, the Federal Aviation Authority said Monday.",
    "url": "https://www.cbsnews.com/news/delta-plane-engine-fire-orlando-airport-passengers-evacuate/"
  },
  {
    "text": "First House Republican calls for Pete Hegseth's ouster  —  Rep. Don Bacon (R-Neb.) on Monday became the first Republican member of Congress to openly indicate support for Secretary of Defense Pete Hegseth's removal from office.  —  Why it matters: Hegseth is under fire for a series … ",
    "url": "https://www.axios.com/2025/04/21/don-bacon-pete-hegseth-signal"
  },
  {
    "text": "Trump Gives New York ‘One Last Chance’ to End Congestion Pricing  —  The Trump administration is threatening to stop future federal approvals for transportation projects in Manhattan and may withhold funding if New York City's congestion pricing program continues.",
    "url": "https://www.bloomberg.com/news/articles/2025-04-21/trump-gives-new-york-one-last-chance-to-end-congestion-pricing"
  },
  {
    "text": "Gunman who killed 23 in a racist attack at a Walmart in El Paso pleads guilty to capital murder  —  The gunman who killed 23 people when he targeted Hispanic shoppers at a Walmart in Texas in 2019 pleaded guilty Monday to capital murder and was scolded by a judge over the racist attack in El Paso near the U.S.-Mexico border.",
    "url": "https://apnews.com/article/el-paso-walmart-massacre-plea-deal-433bf2a50443a184c4f4e1ed003820dc"
  },
  {
    "text": "Dow drops 1,200 points, S&P 500 loses 3% as Trump again attacks Powell and sows investor doubt: Live updates  —  Stocks fell again on Monday as President Donald Trump ramped up his attacks on Federal Reserve Chair Jerome Powell, raising questions about the central bank's independence … ",
    "url": "https://www.cnbc.com/2025/04/20/stock-market-today-live-updates.html"
  },
  {
    "text": "Walmart, Target Executives to Meet Trump as Tariff Angst Spreads … President Donald Trump is set to meet with major retailers at the White House, as business executives seek relief from sweeping tariffs that have destabilized global supply chains and rattled US consumers.",
    "url": "https://www.bloomberg.com/news/articles/2025-04-21/trump-to-meet-walmart-target-execs-as-tariff-angst-spreads"
  },
  {
    "text": "'There's a reckoning to be had': San Francisco Dems move to push the national party to the center.  —  Local party leaders are advancing an ideology they call “new pragmatism.”  —  SAN FRANCISCO — Democrats in San Francisco — who for decades pushed their party down an increasingly progressive path … ",
    "url": "https://www.politico.com/news/2025/04/21/san-francisco-democrats-push-to-center-00299814"
  },
  {
    "text": "STAT+: NIH moving to ban all future grants to universities with DEI programs or Israel boycotts, document suggests  —  The National Institutes of Health appears to be preparing to prohibit the awarding of new grants to any institutions that have DEI programs or boycott Israeli companies … ",
    "url": "https://www.statnews.com/2025/04/21/trump-nih-grants-draft-rule-would-prohibit-university-dei-programs-israel-boycott/"
  }
]