[
  {
    "text": "'I'm a black NAZI!':  NC GOP nominee for governor made dozens of disturbing comments on porn forum  —  Editor's Note: The below story contains offensive language.  —  Mark Robinson, the controversial and socially conservative Republican nominee for governor of North Carolina … ",
    "url": "https://www.cnn.com/2024/09/19/politics/kfile-mark-robinson-black-nazi-pro-slavery-porn-forum"
  },
  {
    "text": "Robinson under pressure to withdraw from gubernatorial race  —  North Carolina Republicans are bracing Thursday morning as word spreads about a damning news story looming regarding Lt. Gov. Mark Robinson.  —  Sources with direct knowledge have spoken with Carolina Journal on the condition … ",
    "url": "https://www.carolinajournal.com/robinson-under-pressure-to-withdraw-from-gubernatorial-race/"
  },
  {
    "text": "Robinson vows to continue campaign as Republicans in N.C. brace for damaging story  —  Mark Robinson, the Republican nominee for governor in North Carolina, vowed to continue his campaign Thursday as he and others in the GOP braced for what they expected to be a damaging CNN story, less than two months until the election.",
    "url": "https://www.washingtonpost.com/elections/2024/09/19/mark-robinson-north-carolina-governor/"
  },
  {
    "text": "Harris Had Stronger Debate, Polls Find, but the Race Remains Deadlocked  —  Kamala Harris holds an edge over Donald J. Trump in the battleground state of Pennsylvania.  But new surveys found that the race remains a tossup nationally.  —  Kamala Harris overwhelmingly impressed voters … ",
    "url": "https://www.nytimes.com/2024/09/19/us/politics/harris-trump-times-siena-poll-pennsylvania.html?unlocked_article_code=1.L04.HUvZ.5bd8BZkuEXk8&smid=url-share"
  },
  {
    "text": "The Actual Electoral Map Is Three States  —  If the former president wins the East Coast trio of Pennsylvania, North Carolina and Georgia, he will go back to the White House.  —  Former President Donald Trump at a campaign rally in Asheboro, North Carolina, on Aug. 21.",
    "url": "https://www.politico.com/news/magazine/2024/09/19/trump-three-swing-states-election-win-00179648"
  },
  {
    "text": "“Delusional and unsettling”: Trump forgets there was no debate audience, claims crowd “went crazy”  —  Appearing on Fox News, the 78-year-old Republican claimed that he won over an audience that did not exist  —  Former President Donald Trump appeared on a taped segment of Fox News' “Gutfeld!”",
    "url": "https://www.salon.com/2024/09/19/delusional-and-unsettling-forgets-there-was-no-debate-audience-claims-crowd-went-crazy/"
  },
  {
    "text": "With one exaggerated anecdote, Trump kneecaps his Jan. 6 defense  —  Appearing on Fox News on Wednesday, Trump told a story he's told before — one in which a politician is threatened by angry Trump boosters and he calls them off.  —  Donald Trump's tough-guy shtick plays well on Fox News … ",
    "url": "https://www.washingtonpost.com/politics/2024/09/19/with-one-exaggerated-anecdote-trump-kneecaps-his-jan-6-defense/"
  },
  {
    "text": "J.D. Vance's Weak Excuse for “Pet Eating” Lie Just Blew Up In His Face … Prepare to be shocked: At around the time J.D. Vance started dissembling about Haitians eating people's house pets, a Vance campaign staffer privately spoke with the city manager of Springfield, Ohio, where thousands of Haitians have settled.",
    "url": "https://newrepublic.com/series/48/jd-vances-weak-excuse-pet-eating-lie-just-blew-face"
  },
  {
    "text": "Trump and Johnson's Shocking Bid to Suppress Women's Votes  —  Republicans don't want women to vote.  They now think they may have a strategy that could help make that happen.  —  House Speaker Mike Johnson and former president Donald Trump were pushing the SAVE Act (Safeguard American Eligibility Act) … ",
    "url": "https://hartmannreport.com/p/trump-and-johnsons-shocking-bid-to-1f1"
  },
  {
    "text": "GOP lawmakers from Nebraska urge state to flip to winner-take-all electoral system  —  Republican members of Congress from Nebraska in a Wednesday letter called on their state to apportion all of its five electoral votes to the popular vote winner of the presidential election in the state.",
    "url": "https://thehill.com/homenews/campaign/4888350-nebraska-republicans-call-presidential-victor/"
  },
  {
    "text": "To Understand JD Vance, You Need to Meet the “TheoBros”  —  On July 15, when former President Donald Trump first appeared at the Republican National Convention in Milwaukee, he brought along two new accessories.  One was a large bandage covering his ear, which had been nicked by a would-be assassin's bullet.",
    "url": "https://www.motherjones.com/politics/2024/09/theobros-jd-vance-christian-nationalism/"
  },
  {
    "text": "Producers had to heavily edit The Apprentice to stop Trump from looking like a ‘complete moron’, authors claim  —  ‘That quality that was really bad for him in business was solid gold on the show,’ author says  —  Your support helps us to tell the story  —  As your White House correspondent … ",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/donald-trump-the-apprentice-lucky-loser-moron-b2615226.html"
  },
  {
    "text": "Alaska Man Arrested for Threatening U.S. Supreme Court Justices, Their Family Members  —  For Immediate Release  —  An Alaska man was arrested yesterday in Anchorage for allegedly threatening to injure and kill six U.S. Supreme Court Justices and some of their family members.",
    "url": "https://www.justice.gov/opa/pr/alaska-man-arrested-threatening-us-supreme-court-justices-their-family-members"
  },
  {
    "text": "Fact check: 12 completely fictional stories Trump has told in the last month  —  Former President Donald Trump is littering his public remarks with fictional stories.  —  This isn't run-of-the-mill political spin, the kind of statistic-twisting and accomplishment-exaggerating that political candidates of all stripes engage in.",
    "url": "https://www.cnn.com/2024/09/19/politics/fact-check-donald-trump-fictional-stories/"
  },
  {
    "text": "MAGA Boat Parade Dude Snaps At CNN Reporter: ‘Nobody Gave Me S**t!’  —  The journalist prodded the Trump supporter a bit and got a sassy earful.  —  LOADING  —  A MAGA boat parade participant got salty at a CNN correspondent's suggestion that he was well off and might not be so affected by economic concerns.",
    "url": "https://www.huffpost.com/entry/elle-reeve-maga-boat-parade-nobody-gave-me-shit-cnn_n_66ec05dae4b00648275c08e9"
  },
  {
    "text": "Ex-Trump advisers help to grow pro-Russia website that spreads misinformation  —  George Papadopoulos and others involved in Intelligencer, increasingly popular source of news in rightwing circles  —  Amid the recent crackdown on Russian influence in American media, a group of former Trump advisers … ",
    "url": "https://www.theguardian.com/us-news/2024/sep/19/intelligencer-pro-russia-website-trump"
  },
  {
    "text": "Georgia's abortion ban killed a young mother.  The Christian right now blames the victim  —  Anti-choice activists argue that if Amber Nicole Thurman had submitted to forced childbirth, she'd still be alive  —  Pro-choice activists warned in the immediate aftermath of Dobbs v. Jackson Women's Health … ",
    "url": "https://www.salon.com/2024/09/19/georgias-abortion-ban-a-young-mother-the-christian-right-now-the-victim/"
  },
  {
    "text": "Right-wing media have lavished praise on embattled Mark Robinson during his NC gubernatorial campaign  —  Right-wing media figures on Robinson: “Not afraid to say what he is thinking, which I think we need more of”; “he's got spirit, he's got gusto”; “he's like a hero of the internet”",
    "url": "https://www.mediamatters.org/donald-trump-jr/right-wing-media-have-lavished-praise-embattled-mark-robinson-during-his-nc"
  },
  {
    "text": "Secret Service Probing Musk's Post About Threats to Biden and Harris  —  The Secret Service is looking into Elon Musk's post on X that suggested it was strange no one attempted to assassinate President Joe Biden or Vice President Kamala Harris.  In response to a FOIA request … ",
    "url": "https://www.bloomberg.com/news/newsletters/2024-09-19/musk-x-post-about-biden-harris-threats-leads-to-secret-service-investigation"
  }
]