[
  {
    "text": "Trump's Dire Words Raise New Fears About His Authoritarian Bent  —  The former president is focusing his most vicious attacks on domestic political opponents, setting off fresh worries among autocracy experts.  —  Donald J. Trump rose to power with political campaigns that largely attacked external targets … ",
    "url": "https://www.nytimes.com/2023/11/20/us/politics/trump-rhetoric-fascism.html"
  },
  {
    "text": "‘Did Trump Change, or Did You?’:  We Asked a Pro-Impeachment Republican Why He'd Back Trump  —  In a new Q&A, former GOP Rep. Peter Meijer defends his decision to back Donald Trump if he's the Republican nominee.  —  Things have gotten complicated for Peter Meijer when it comes to his feelings about Donald Trump.",
    "url": "https://www.politico.com/news/magazine/2023/11/20/peter-meijer-senate-donald-trump-00128137"
  },
  {
    "text": "Trump calls to ‘revamp the RNC’ if GOP debates go ahead  —  “GREAT POLLS JUST RELEASED - BEST EVER!  Harvard/Harris TRUMP 67%, DeSanctimonious 9%, Birdbrain 8%, Ramaswamy 5%, Christie - dead in the water, a total loser!  TRUMP UP 7% to 10% on CROOKED JOE BIDEN,” Trump wrote on his Truth Social platform … ",
    "url": "https://thehill.com/homenews/campaign/4319600-trump-calls-to-revamp-the-rnc-if-gop-debates-go-ahead/"
  },
  {
    "text": "What happens after Donald Trump's ‘final battle’?  —  I was driving with my kids on Sunday, mind wandering as I steered.  I was looking at a cluster of leafless trees when the first words from a social media post by Donald Trump popped into my mind.  —  “2024 is our final battle.”",
    "url": "https://www.washingtonpost.com/politics/2023/11/20/trump-final-battle-evangelicals/"
  },
  {
    "text": "Maria Bartiromo Floats Bonkers New COVID Conspiracy About Trump and China  —  While “just asking questions,” the once-respected anchor suggested China unleashed COVID-19 on the world just to destroy Trump.  —  Fox Business Network anchor Maria Bartiromo was once again just asking questions … ",
    "url": "https://www.thedailybeast.com/foxs-maria-bartiromo-floats-bonkers-new-covid-conspiracy-about-trump-and-china"
  },
  {
    "text": "Elon Musk's X sues media watchdog Media Matters over report on pro-Nazi content on the social media site  —  After a devastating advertiser exodus last week involving some of the world's largest media companies, X owner Elon Musk is suing the progressive watchdog group Media Matters … ",
    "url": "https://www.cnn.com/2023/11/20/tech/x-sues-media-matters/"
  },
  {
    "text": "America's most unhinged, unelected official  —  Stephen Miller, the notorious advisor to former president Donald Trump, suggested on X yesterday that a “conservative state Attorney[] General” should pursue civil and criminal charges against Media Matters.  Miller claims that Media Matters committed … ",
    "url": "https://popular.info/p/americas-most-unhinged-unelected"
  },
  {
    "text": "Appeals court judges express skepticism as Trump lawyer fights to reverse gag order in Jan. 6 case  —  At oral arguments debating whether a temporarily-lifted gag order on Donald Trump in his election subversion case in Washington, D.C., is warranted, it was a question of the First Amendment and faith … ",
    "url": "https://lawandcrime.com/high-profile/appeals-court-judges-express-skepticism-as-trump-lawyer-fights-to-reverse-gag-order-in-jan-6-case/"
  },
  {
    "text": "Large military aircraft overshoots runway, ends up in Kaneohe Bay  —  HONOLULU (HawaiiNewsNow) - A large U.S. Navy aircraft ended up in shallow waters of Kaneohe Bay on Monday afternoon after overshooting the runway at Marine Corps Base Hawaii.  —  The incident happened about 1:57 p.m. when the P-8 Poseidon aircraft was landing.",
    "url": "https://www.hawaiinewsnow.com/2023/11/21/emergency-crews-responding-after-reported-downed-military-aircraft-kaneohe-bay/"
  },
  {
    "text": "The Way Nevada Will Pick the GOP Presidential Nominee Is a Mess  —  Dueling caucus and primary confuse voters  —  LAS VEGAS—In January, roughly half a million Republican voters in Nevada will receive presidential primary ballots in the mail.  Former President Donald Trump's name won't be on them.",
    "url": "https://www.wsj.com/politics/elections/the-way-nevada-will-pick-the-gop-presidential-nominee-is-a-mess-5d165f46?mod=followamazon"
  },
  {
    "text": "The ‘faith-based’ leader for Philly's Moms for Liberty chapter is a registered sex offender  —  Phillip Fisher Jr. is a pastor and Republican ward leader who coordinates faith-based outreach for Philadelphia's Moms for Liberty chapter.He's also a registered sex offender … ",
    "url": "https://www.inquirer.com/politics/philadelphia/moms-for-liberty-philadelphia-pastor-sex-offender-20231120.html"
  },
  {
    "text": "Federal appeals court ruling threatens enforcement of the Voting Rights Act  —  The decision from the 8th Circuit is likely headed to the Supreme Court.  —  A federal appeals court issued a ruling Monday that could gut the Voting Rights Act, saying only the federal government … ",
    "url": "https://www.politico.com/news/2023/11/20/federal-court-deals-devastating-blow-to-voting-rights-act-00128069"
  },
  {
    "text": "House GOP's Biden impeachment effort heads into final stage  —  The conference plans to depose Hunter Biden in December and is working to tie up other threads before January — when advocates hope they can start moving toward a vote.  —  House Republicans are closing in on a make-or-break moment … ",
    "url": "https://www.politico.com/news/2023/11/21/house-republicans-biden-impeachment-00128154"
  },
  {
    "text": "‘Congratulations, Birds’: Biden Pardons a Pair of Turkeys  —  The president celebrated his 81st birthday on the same day he spared two turkeys in the annual pre-Thanksgiving tradition.  —  For the 76th year in a row on Monday, an American president took part in the pre-Thanksgiving ritual of pardoning a turkey.",
    "url": "https://www.nytimes.com/2023/11/20/us/politics/biden-turkey-pardon.html"
  },
  {
    "text": "After the Civil War, Robert E. Lee Couldn't Run for President, but Trump Can?  —  In 1865, when the 39th Congress assembled in Washington, D.C., lawmakers faced an unusual problem: The former Confederate states, decisively defeated on the battlefield and having surrendered, were poised to return to the Union and take it over.",
    "url": "https://washingtonmonthly.com/2023/11/20/after-the-civil-war-robert-e-lee-couldnt-run-for-president-but-trump-can/"
  },
  {
    "text": "The Real Reason Why Biden Shouldn't Drop Out  —  Panicked Democrats, vibrating with anxiety over the polls, continue to nurture an unlikely fantasy: Joe Biden looks at his family across the Thanksgiving table on Nantucket and says with a weary sigh, “I can't do this for another five years.",
    "url": "https://newrepublic.com/article/177020/real-reason-biden-shouldnt-drop"
  },
  {
    "text": "Beavercreek Walmart mass shooting: 4 injured, gunman kills self, police say  —  Captain: 'There's no immediate threat to the community.'  —  Four people were wounded and one person dead following a mass shooting Monday night inside the Beavercreek Walmart.  —  Explore",
    "url": "https://www.daytondailynews.com/local/crews-respond-to-active-shooter-at-beavercreek-walmart/Q24SROW5F5DNPJLTHJQUVXIAB4/"
  },
  {
    "text": "Trump's Retribution … The New York Times political correspondent Maggie Haberman tells Jamie that a second Trump will be defined by unfettered score settling.  Plus:  —Trump's social media strategy  —Bannon friction -Trump/Carlson 24?  —Trump's totalitarian rhetoric -The trials are happening",
    "url": "https://thedispatch.com/podcast/dispatch-podcast/trumps-retribution/"
  }
]