[
  {
    "text": "Scoop: Kamala Harris' brother-in-law emerges as key campaign adviser … - But some Democratic advisers in close contact with the campaign worry West's prominent role could re-create the same family dynamics that at times caused unnecessary drama in her 2020 campaign.",
    "url": "https://www.axios.com/2024/08/01/kamala-harris-tony-west-president-campaign"
  },
  {
    "text": "Kamala Harris' veepstakes races toward the finish line  —  The vetting team has met with several contenders as Harris prepares to pick a running mate in the next few days.  —  Kamala Harris is preparing for the final stage of selecting a running mate: face-to-face interviews.",
    "url": "https://www.politico.com/news/2024/08/01/kamala-harris-vp-search-00172401"
  },
  {
    "text": "Harris campaign has met with 6 potential VP picks as the selection process nears its end  —  The top contenders include governors, a senator in a key battleground state and a member of President Joe Biden's Cabinet.  —  WASHINGTON — Vice President Kamala Harris' campaign has met … ",
    "url": "https://www.nbcnews.com/politics/2024-election/harris-campaign-met-6-potential-vp-picks-selection-process-nears-end-rcna164706"
  },
  {
    "text": "Women's Group to Harris: Dump Shapiro Over Sex Case Failings  —  VEEPSTAKES  —  Pennsylvania Gov. Shapiro's involvement in a sexual harassment claim against a longtime aide may hit his VP chances.  —  Deputy Washington Bureau Chief  —  Pennsylvania Gov. Josh Shapiro is the betting favorite … ",
    "url": "https://www.thedailybeast.com/womens-group-to-harris-dump-shapiro-over-sex-case-cover-up"
  },
  {
    "text": "Harris VP mystery: Signs point to Shapiro … While Harris could surprise everyone, she seems to be headed toward a pick that a wide variety of sources — Republicans and Democrats — think is both shrewd and straightforward.  — It's a combination of math and logic … ",
    "url": "https://www.axios.com/2024/08/02/josh-shapiro-harris-vp-running-mate"
  },
  {
    "text": "Trump's Racist Attack on Kamala Harris Was No Accident  —  Is it, perhaps, a sign that the Vice-President's swift rise in the polls has him panicked?  —  Spoiler alert: he meant it.  When Donald Trump claimed, on Wednesday afternoon, in a combative onstage interview at the National Association … ",
    "url": "https://www.newyorker.com/news/letter-from-bidens-washington/trumps-racist-attack-on-kamala-harris-was-no-accident"
  },
  {
    "text": "Trump hits back at Dem attacks: 'They're the weird ones'  —  “Nobody's ever called me weird.  I'm a lot of things, but weird I'm not,” Trump said.  —  After over a week of Vice President Kamala Harris and her surrogates calling Donald Trump and running mate JD Vance “weird,” the former president attempted to play an Uno reverse card.",
    "url": "https://www.politico.com/news/2024/08/01/trump-dem-attacks-weird-00172386"
  },
  {
    "text": "Vance defends Trump over former president's false claims about Harris' racial identity  —  Republican vice presidential nominee JD Vance on Thursday defended Donald Trump's false comments about Kamala Harris' racial identity, saying that it was “totally reasonable” for his ticket mate to describe … ",
    "url": "https://www.cnn.com/2024/08/01/politics/chameleon-trump-vance-harris-ethnicity/"
  },
  {
    "text": "‘That had to be bittersweet’ — how Biden managed a historic prisoner swap as his campaign was disintegrating  —  Just as President Biden was deciding to step off the ticket, he pulled off one of the biggest and most complex prisoner deals in U.S. history.  —  President Joe Biden's mind … ",
    "url": "https://www.politico.com/news/2024/08/01/biden-campaign-prisoner-swap-00172408"
  },
  {
    "text": "JD Vance Is An Investor In A Far Right Video Platform Filled With Neo-Nazi Content  —  This is your TPM evening briefing.  —  Sen. J.D. Vance (R-OH) has been making headlines for his “rocky rollout” since being named former President Donald Trump's running mate last month.",
    "url": "https://talkingpointsmemo.com/where-things-stand/jd-vance-is-an-investor-in-a-far-right-video-platform-filled-with-neo-nazi-content"
  },
  {
    "text": "$10M cash withdrawal drove secret probe into whether Trump took money from Egypt  —  Political appointees rejected efforts to search for additional evidence investigators believed might provide answers, then closed the case.  —  This story is based partly on research that Davis and Leonnig conducted … ",
    "url": "https://www.washingtonpost.com/investigations/2024/08/02/trump-campaign-egypt-investigation/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzIyNTcxMjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzIzOTUzNTk5LCJpYXQiOjE3MjI1NzEyMDAsImp0aSI6IjRiNzI0ZGZiLWY2NDItNDQzZi04ZmNjLTBjNDYzOTQ3MGM5MCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9pbnZlc3RpZ2F0aW9ucy8yMDI0LzA4LzAyL3RydW1wLWNhbXBhaWduLWVneXB0LWludmVzdGlnYXRpb24vIn0.ypaqtPM-b3YjnqwBgiZoYyFTfbHakuQf0APCEAvVDE4&itid=gfta"
  },
  {
    "text": "Harris Campaign Says It Raised $310 Million in July, More Than Double Trump's Haul  —  In the seven days after President Biden stepped down as the presumptive Democratic nominee, the Harris campaign raked in $200 million.  —  Vice President Kamala Harris's campaign survived a brutal few weeks … ",
    "url": "https://www.nytimes.com/2024/08/02/us/politics/harris-campaign-fundraising-july.html?unlocked_article_code=1._00.r-ew.PCn68jTvNozl&smid=url-share"
  },
  {
    "text": "Republicans Want Someone Younger Than Donald Trump as President: New Poll  —  voters have said they would prefer a president who is younger than the 78-year-old former commander-in-chief.  —  In a YouGov poll conducted between July 25-29, 59 percent of  —  surveyed said they would prefer a president under the age of 75.",
    "url": "https://www.newsweek.com/donald-trump-too-old-age-2024-election-president-poll-1932983"
  },
  {
    "text": "The presidential election is a toss-up  —  Kamala Harris is giving Democrats the race that Joe Biden couldn't.  —  I don't want to get in the habit of making a huge ruckus every time the election model passes a certain arbitrary probabilistic threshold.  There are still a very long 96 days … ",
    "url": "https://www.natesilver.net/p/the-presidential-election-is-a-toss"
  },
  {
    "text": "What happened to JD Vance?  —  The 2014 version had a lot more to offer than the guy who now exemplifies the toxicity of Trumpism. … Americans have been waiting for decades, since the assassination of Sen. Robert F. Kennedy, for a political leader who offered the promise of bringing … ",
    "url": "https://www.publicnotice.co/p/jd-vance-what-happened-2014-2024-trumpism"
  },
  {
    "text": "Recount confirms Bob Good's loss after GOP rallies to oust one of their own  —  A recount on Thursday confirmed that state Sen. John McGuire beat Good in the June election by just a few hundred votes, according to The Associated Press.  —  Rep. Bob Good (R-Va.), the chair … ",
    "url": "https://www.politico.com/news/2024/08/01/recount-confirms-bob-goods-loss-after-gop-rallies-to-oust-one-of-their-own-00172424"
  },
  {
    "text": "CBP officers in Arizona seize more than half a ton of fentanyl in largest seizure in agency history  —  TUCSON, Ariz. - U.S. Customs and Border Protection officers at the Port of Lukeville recently seized approximately 4 million blue fentanyl pills — weighing more than 1,000 pounds … ",
    "url": "https://www.cbp.gov/newsroom/local-media-release/cbp-officers-arizona-seize-more-half-ton-fentanyl-largest-seizure"
  },
  {
    "text": "The Man Behind Project 2025's Most Radical Plans  —  In January 2023, a group of about 15 people gathered for three days at the Heritage Foundation, the conservative Washington think tank a few blocks from the Capitol.  Their aim was ambitious and farsighted: to start building … ",
    "url": "https://www.propublica.org/article/project-2025-trump-campaign-heritage-foundation-paul-dans"
  },
  {
    "text": "Former CIA chief: Prisoner swap a ‘remarkable display’ of ‘successful’ diplomacy by Biden administration  —  Video Player is loading.  —  Play Video  —  Unmute  —  Current Time 0:00 … Stream Type LIVE  —  Seek to live, currently behind liveLIVE  —  Playback Rate  —  Chapters",
    "url": "https://thehill.com/policy/international/4807096-former-cia-chief-john-brennan-russia-prisoner-swap/"
  },
  {
    "text": "U.S. prepares to counter Iranian attack on Israel within days, U.S. officials say … - Iranian Supreme Leader Ayatollah Ali Khamenei and other senior Iranian political and military officials said Iran is going to retaliate for Haniyeh's assassination.  — Hezbollah leader Hassan Nasrallah … ",
    "url": "https://www.axios.com/2024/08/01/us-iran-israel-attack-preparation"
  },
  {
    "text": "‘We Are Hungry,’ Chant Nigerian Protesters as 13 People Die  — ‘Fierce clampdown’ by Nigerian authorities, Amnesty says  — At least three states declare 24-hour curfew after violence  —  Nigerians Protest Against Cost of Living  —  A clampdown by Nigerian security forces on protests … ",
    "url": "https://www.bloomberg.com/news/articles/2024-08-02/-we-are-hungry-chant-nigerian-protesters-as-13-people-killed"
  }
]