[
  {
    "text": "5 key details in special counsel Jack Smith's Trump election case filing  —  Breaking down the key details from Smith's latest court filing  —  A federal judge on Wednesday unsealed a key filing from special counsel Jack Smith's updated election interference case against former President Donald Trump.",
    "url": "https://www.foxnews.com/politics/5-key-details-special-counsel-jack-smiths-trump-election-case-filing"
  },
  {
    "text": "Former Colorado county clerk Tina Peters sentenced to 9 years for voting data scheme  —  A judge excoriated a Colorado county clerk for her crimes and lies before sentencing her Thursday to nine years behind bars for a data-breach scheme spawned from the rampant false claims about voting machine fraud in the 2020 presidential race.",
    "url": "https://apnews.com/article/tina-peters-colorado-clerk-election-vote-fraud-b456ce4f80dc97f4b967eb6297311a51"
  },
  {
    "text": "Trump election conspiracist Tina Peters sentenced to 9 years in prison by Colorado judge … - CNBC Councils  — CNBC on Peacock  — Join the CNBC Panel  — Supply Chain Values  — Select Shopping  — Ad Choices  — News Tips  —  Got a confidential news tip?  We want to hear from you.",
    "url": "https://www.cnbc.com/2024/10/03/trump-election-conspiracist-tina-peters-sentenced.html"
  },
  {
    "text": "Biden administration can move forward with student loan forgiveness, federal judge rules … A federal judge will let expire a temporary restraining order against the Biden administration's sweeping new student loan forgiveness plan, which could deliver relief to tens of millions of Americans.",
    "url": "https://www.cnbc.com/2024/10/03/student-loan-forgiveness-plan-goes-ahead-biden.html"
  },
  {
    "text": "Helene isn't the first time Trump inserted politics into a natural disaster … In the aftermath of Hurricane Helene, former President Donald Trump has blasted the Biden administration for its handling of the disaster — going so far as to accuse Democratic leaders of ignoring the needs of Republican storm victims.",
    "url": "https://www.eenews.net/articles/helene-isnt-the-first-time-trump-inserted-politics-into-a-natural-disaster/"
  },
  {
    "text": "When moderator Margaret Brennan noted during last night's vice presidential debate that Republican nominee J.D. Vance had, once again, lied about the legal status of migrants in Springfield, Ohio, Vance retorted: “The rules were that you guys weren't going to fact-check!”",
    "url": "https://heathercoxrichardson.substack.com/p/october-2-2024"
  },
  {
    "text": "CNN requested an interview with Melania Trump.  Her book publisher asked for $250,000 in exchange  —  Nearly two months ago, CNN reached out to Melania Trump's book publisher to request an interview with the former first lady ahead of her upcoming memoir.  After several exchanges … ",
    "url": "https://www.cnn.com/2024/10/03/politics/melania-trump-book-cnn-interview/"
  },
  {
    "text": "John Roberts' Sordid Legacy: 14 Pages of Mean Tweets  —  “One of the ways Trump” disseminated false claims of election fraud, Jack Smith's immunity briefing describes, “was by Tweet, day in and day out.”  —  I'm still wading through Jack Smith's immunity briefing.",
    "url": "https://www.emptywheel.net/2024/10/03/john-roberts-sordid-legacy-14-pages-of-mean-tweets/"
  },
  {
    "text": "Wisconsin GOP group launches pro-Harris campaign with open letter  —  Republican lapel buttons.  Photo by U.S. Consulate General Barcelona via Flickr CC BY-NC 2.0  —  Two dozen Wisconsin Republicans, including former lawmakers, other former elected officials and a GOP sitting district attorney … ",
    "url": "https://wisconsinexaminer.com/briefs/wisconsin-gop-group-launches-pro-harris-campaign-with-open-letter/"
  },
  {
    "text": "Revealed: ports-strike CEO's crude attacks on Biden and Democrats  —  David Adam of USMX made coarse remarks about president and appeared to endorse rightwing conspiracy theory  —  An executive representing ports where tens of thousands of workers went on strike this week made a series … ",
    "url": "https://www.theguardian.com/business/2024/oct/03/port-strike-usmx-biden-democrats"
  },
  {
    "text": "Trump campaign hands out signs with white supremacist slogan at rally  —  Former President Donald Trump's campaign distributed signs with a phrase often used by white supremacists.  —  Before Trump spoke in Saginaw, Michigan, Thursday, campaign staff could be seen handing out pre-printed signs with the words “Reclaim America.”",
    "url": "https://www.rawstory.com/trump-reclaim-america/"
  },
  {
    "text": "Dozens of San Fernando Valley white supremacist gang members charged in federal indictment, DOJ says  —  Federal prosecutors said 42 members and associates of a San Fernando Valley white supremacist gang were arrested and indicted.  —  LOS ANGELES (CNS) — Forty-two members of what prosecutors call … ",
    "url": "https://abc7.com/post/dozens-san-fernando-valley-white-supremacist-gang-members-arrested-charged-federal-indictment/15385105/"
  },
  {
    "text": "The Rise of the Right-Wing Tattletale … Last year, in Texas, a deteriorating marriage became the testing ground for a novel legal strategy favored by some of the country's most prominent right-wing lawyers and politicians.  —  Marcus and Brittni Silva's divorce had just been finalized … ",
    "url": "https://www.theatlantic.com/magazine/archive/2024/11/texas-red-state-surveillance-book-bans-abortion/679950/?gift=mBLCHcnsd_Gd3EecvWSKTZzZWZD1Wbdv4igJqyg6P5A&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Walz says he ‘speaks like everybody else.’ And it's not working for the campaign.  —  Key members of Harris' circle weren't aware of some of Walz's inaccurate statements until they became public, despite the vetting process.  —  Tim Walz has a problem misspeaking.",
    "url": "https://www.politico.com/news/2024/10/03/tim-walz-misspeak-00182350"
  },
  {
    "text": "Harris holds a 66-electoral-vote lead over Trump, calculates prominent data scientist  —  Kamala Harris turned the tables on Trump, according to betting markets, and hasn't looked back.  —  Data scientist Thomas Miller has crafted a model for forecasting the 2024 presidential election that … ",
    "url": "https://fortune.com/2024/10/03/kamala-harris-trump-latest-polls-swing-states/"
  },
  {
    "text": "Scott leads Democratic challenger in Florida Senate race: Poll  —  Sen. Rick Scott (R-Fla.) has a 6-point lead against former Rep. Debbie Mucarsel-Powell (D-Fla.) in the Florida Senate race, according to a new poll by Napolitan News Service.  —  The same poll shows former President Trump … ",
    "url": "https://thehill.com/homenews/senate/4914244-florida-senate-race-poll-scott/"
  },
  {
    "text": "Three Mile Island owner seeks taxpayer backing for Microsoft AI deal  —  Energy Department weighing a $1.6 billion loan guarantee for a plan to reopen the nuclear plant with Microsoft as its sole customer.  —  The owner of the shuttered Three Mile Island nuclear plant is pursuing … ",
    "url": "https://www.washingtonpost.com/business/2024/10/03/nuclear-microsoft-ai-constellation/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI3OTI4MDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI5MzEwMzk5LCJpYXQiOjE3Mjc5MjgwMDAsImp0aSI6Ijc0ZmI0NWNhLTdlM2QtNDUyYy05MDk1LTc1NWFkN2IwMWZkZSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9idXNpbmVzcy8yMDI0LzEwLzAzL251Y2xlYXItbWljcm9zb2Z0LWFpLWNvbnN0ZWxsYXRpb24vIn0.xfmfqO3etriCYxJHlBQ63dGdq0OnXhxRMpAoigGR2nw&itid=gfta"
  },
  {
    "text": "Trump Promised to Release His Medical Records.  He Still Won't Do It.  —  If elected again, he would become the oldest president by the end of his term.  Yet he is refusing to disclose even basic health information.  —  As a presidential candidate in 2015, Donald J. Trump declined to release … ",
    "url": "https://www.nytimes.com/2024/10/03/health/trump-health-records.html?unlocked_article_code=1.PU4.iSJc.mCk7EGGiSozC&smid=re-share"
  },
  {
    "text": "I Know What His Mamaw Would Tell JD Vance About Hillbilly Values  —  NO MIGRANT HATE  —  I'm a real hillbilly like Vance claims to be.  He should learn about immigrants from how his family were treated when they moved for a better life. … JD Vance had a lot to say about immigrants at Tuesday night's debate.",
    "url": "https://www.thedailybeast.com/i-know-what-mamaw-would-tell-jd-vance-about-hating-immigrants-at-vice-presidential-debate"
  },
  {
    "text": "Photos Show New York Congressman in Blackface as Michael Jackson  —  Representative Mike Lawler, a Republican locked in a tight race for re-election, dressed as the pop star for Halloween as a college student in 2006.  —  Representative Mike Lawler of New York wore blackface as part … ",
    "url": "https://www.nytimes.com/2024/10/03/nyregion/lawler-blackface-michael-jackson.html?unlocked_article_code=1.PU4.QjF5.v5JniminTZBb&smid=url-share"
  }
]