[
  {
    "text": "Trump's latest about-face: He now says 2020 election was ‘long over’  —  It's a new piece of rhetoric that Trump hopes will help him win immunity from his criminal charges.  —  In the months after the 2020 election, Donald Trump leaned on his campaign to launch ad blitzes and legal challenges … ",
    "url": "https://www.politico.com/news/2024/01/12/trump-2020-election-legal-00135230"
  },
  {
    "text": "Kinzinger says he'd vote for Biden instead of Trump ‘in a heartbeat’  —  Former Rep. Adam Kinzinger (R-Ill.) said he would vote for President Biden instead of former President Trump “in a heartbeat.”  —  Kinzinger, an outspoken critic of Trump, was asked by CNN's Kaitlan Collins … ",
    "url": "https://thehill.com/homenews/campaign/4404785-kinzinger-says-hed-vote-for-biden-instead-of-trump-in-a-heartbeat/"
  },
  {
    "text": "Democratic group plans $140 million voter testimonial onslaught against Donald Trump  —  The effort will focus on appealing to working class women in the northern swing states of Pennsylvania, Michigan and Wisconsin  —  Democrats began the search last summer, fanning out through … ",
    "url": "https://www.washingtonpost.com/politics/2024/01/12/biden-ads-american-bridge/"
  },
  {
    "text": "‘This to Him Is the Grand Finale’: Donald Trump's 50-Year Mission to Discredit the Justice System  —  The former president is in unparalleled legal peril, but he has mastered the ability to grind down the legal system to his advantage.  It's already changing our democracy.",
    "url": "https://www.politico.com/news/magazine/2024/01/12/donald-trump-indictments-legal-system-00135151"
  },
  {
    "text": "US, British militaries launch massive retaliatory strike against Iranian-backed Houthis in Yemen  —  WASHINGTON (AP) — The U.S. and British militaries were bombing more than a dozen sites used by the Iranian-backed Houthis in Yemen on Thursday, in a massive retaliatory strike using warship … ",
    "url": "https://apnews.com/article/yemen-houthis-biden-retaliation-attacks-0804b93372cd5e874a0dd03513fe36a2"
  },
  {
    "text": "Statement from President Joe Biden on Coalition Strikes in Houthi-Controlled Areas in Yemen  —  Today, at my direction, U.S. military forces—together with the United Kingdom and with support from Australia, Bahrain, Canada, and the Netherlands—successfully conducted strikes against a number … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/01/11/statement-from-president-joe-biden-on-coalition-strikes-in-houthi-controlled-areas-in-yemen/"
  },
  {
    "text": "Elise Stefanik's Ugly “Hostages” Barb Points to Serious GOP Mayhem Ahead  —  GOP Representative Elise Stefanik no doubt thought it was shrewd to describe the rioters who attacked the Capitol as “January 6 hostages.”  This sort of talk hits a sweet trifecta for a GOP leader with seemingly limitless ambition.",
    "url": "https://newrepublic.com/article/178044/elise-stefanik-jan-6-hostages-gop-mayhem"
  },
  {
    "text": "Jan. 6 ‘hostage’ comments fuel House GOP divisions in tough election year  —  Now members of Republican leadership are echoing conspiracy theorists and the ex-president's rhetoric  —  Congressional bureau chief  —  Just before 2 p.m. Wednesday, the campaign of Rep. Jen Kiggans (R-Va.) … ",
    "url": "https://www.washingtonpost.com/politics/2024/01/11/jan-6-hostage-comments-elise-stefanik/"
  },
  {
    "text": "Statement from President Joe Biden on Early Student Debt Cancellation for Borrowers Enrolled in SAVE  —  From Day One of my Administration, I vowed to fix the student loan system and make sure higher education is a pathway to the middle class - not a barrier to opportunity.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/01/12/statement-from-president-joe-biden-on-early-student-debt-cancellation-for-borrowers-enrolled-in-save/"
  },
  {
    "text": "Live updates Closing statements conclude in Trump's N.Y. civil fraud trial  —  Closing statements concluded Thursday in New York state's $370 million civil fraud trial against Donald Trump, his company and others.  Show more  —  Key updates  —  Trump rails against trial, judge from courtroom seat",
    "url": "https://www.washingtonpost.com/national-security/2024/01/11/trump-new-york-fraud-trial-closing-arguments/"
  },
  {
    "text": "Why Platformer is leaving Substack  —  After much consideration, we have decided to move Platformer off of Substack.  Over the next few days, the publication will migrate to a new website powered by the nonprofit, open-source publishing platform Ghost.  If you already subscribe to Platformer … ",
    "url": "https://www.platformer.news/p/why-platformer-is-leaving-substack"
  },
  {
    "text": "Don't Turn Away From the Charges of Genocide Against Israel  —  With the question of whether Israel is committing genocide in Gaza now before the International Court of Justice, the Biden administration has struck a tone of glib dismissal.  —  “Meritless” seems to be the agreed-upon term among U.S. officials.",
    "url": "https://www.nytimes.com/2024/01/12/opinion/israel-icj-genocide-south-africa.html"
  },
  {
    "text": "The AMA wants a Medicare cut reversed - and lawmakers to stay out of care  —  Good morning.  I'm Julie Rovner, chief Washington correspondent at KFF Health News and host of its weekly news podcast, “What the Health?”  Listen here or wherever you get your podcasts, and send tips to JulieR@kff.org.",
    "url": "https://www.washingtonpost.com/politics/2024/01/11/ama-wants-medicare-cut-reversed-lawmakers-stay-out-care/"
  },
  {
    "text": "Johnson confronts biggest test yet: Whether to walk away from his own funding deal  —  Conservatives are pushing him to renege.  Most of the rest of his party wants him to stand firm.  Whichever path he chooses carries real risks.  —  Speaker Mike Johnson's grip on his fractious conference slipped … ",
    "url": "https://www.politico.com/news/2024/01/12/johnson-funding-conservatives-00135152"
  },
  {
    "text": "FAA to increase oversight of Boeing production and manufacturing following Alaska Airlines emergency landing  —  The FAA will audit Boeing's 737-9 MAX production line and its suppliers to evaluate Boeing's compliance with its approved quality procedures.  —  The Federal Aviation Administration … ",
    "url": "https://www.nbcnews.com/news/us-news/faa-increase-oversight-boeing-production-manufacturing-alaska-airlines-rcna133640"
  },
  {
    "text": "Schiff would abolish filibuster, end the Electoral College in his pro-democracy plan  —  The proposal dovetails with Rep. Adam Schiff's campaign focus on the threats of Trumpism.  —  California Senate candidate and Congressmember Adam Schiff is calling for a major overhaul of American institutions … ",
    "url": "https://www.politico.com/news/2024/01/12/schiff-pro-democracy-plan-filibuster-electoral-college-00135232"
  },
  {
    "text": "Congress approves resolution against Biden EV charger plans  —  The measure targets a limited waiver from Buy America rules.  Democrats and the White House say it would backfire.  —  The House approved legislation Thursday to undo a Biden administration rule meant to facilitate the proliferation of electric vehicle charging stations.",
    "url": "https://www.politico.com/news/2024/01/11/congress-resolution-biden-ev-charger-plans-00134788"
  }
]