[
  {
    "text": "New Orleans attack suspect named, accused of killing at least 10, injuring dozens  —  The suspect accused of plowing a truck through a crowd on Bourbon Street early Wednesday morning has been identified by a law enforcement source as 42-year-old Shamsud Din Jabbar.",
    "url": "https://www.nola.com/news/crime_police/new-orleans-suspect-bourbon-street-attack/article_d90e3452-c85f-11ef-a68f-f30b3ad49828.html"
  },
  {
    "text": "New Orleans updates: 10 dead in ‘terrorist attack’ with pickup in New Orleans, local officials say  —  The driver remained at large after the Bourbon Street incident, police said.  —  Emergency vehicles are seen near Bourbon Street in New Orleans on Wednesday, Jan. 1, 2025.",
    "url": "https://abcnews.go.com/US/1-dead-vehicle-strikes-crowd-new-orleans-police/story?id=117246329"
  },
  {
    "text": "FBI Statement on the Attack in New Orleans  —  Today, at approximately 3:15 a.m. CST, an individual drove a pickup truck into a crowd of people on Bourbon Street in New Orleans, killing at least 10 and injuring dozens of others.  After hitting the crowd, he exited the vehicle and fired upon local law enforcement.",
    "url": "https://www.fbi.gov/news/press-releases/fbi-statement-on-the-attack-in-new-orleans"
  },
  {
    "text": "Driver rams New Year's revelers in New Orleans, killing 10.  FBI investigating as ‘act of terrorism’  —  A driver wrought carnage on New Orleans' famed French Quarter early on New Year's Day, ramming a pickup truck into a crowd and killing 10 people before being shot to death by police, authorities said.",
    "url": "https://apnews.com/article/new-orleans-car-bourbon-street-63a1b43d615af365cb8ba6f5f0583eca"
  },
  {
    "text": "The attack was the deadliest in the U.S. in more than a year.  —  Officials postponed the Sugar Bowl and said they were hunting for possible connections between the suspect, who rammed into New Year's revelers, and terrorist organizations.  —  TRANSCRIPT  —  Back  —  Deadly New Year's Day Attack in New Orleans",
    "url": "https://www.nytimes.com/live/2025/01/01/us/new-orleans-vehicle-crash?unlocked_article_code=1.l04.NOtM.UNls5FGSFORo&smid=bs-share"
  },
  {
    "text": "Man intentionally slams truck into crowd in New Orleans, killing 10 and injuring dozens; suspect dead  —  Ten people were killed and dozens injured early Wednesday when a man intentionally drove a pickup truck into a crowd on Bourbon Street in New Orleans' French Quarter as revelers were celebrating the new year, officials said.",
    "url": "https://www.cbsnews.com/news/new-orleans-vehicle-crash-bourbon-street-crowd-casualties-shooting/"
  },
  {
    "text": "Police treating vehicle explosion at Trump Las Vegas hotel as possible act of terror: Official  —  Police are also probing the Cybertruck incident as a possible criminal act.  —  General views of the Trump International Hotel Las Vegas on April 15, 2024 in Las Vegas, Nevada.",
    "url": "https://abcnews.go.com/Politics/police-investigating-vehicle-explosion-trump-hotel-las-vegas/story?id=117252987"
  },
  {
    "text": "1 person dies when Tesla truck catches fire and explodes outside Trump's Las Vegas hotel  —  One person died and seven others were injured Wednesday when a Tesla Cybertruck that appeared to be carrying fireworks caught fire and exploded outside President-elect Donald Trump's Las Vegas hotel, authorities said.",
    "url": "https://apnews.com/article/trump-hotel-vehicle-fire-las-vegas-ad4c171c7a6af64f08db93d9fdc2d749"
  },
  {
    "text": "BREAKING: Cybertruck blows up outside Trump International Hotel Las Vegas  —  Witnesses reported a “massive explosion” near the 64-story luxury building owned by President-elect Donald Trump. … Minute Read  —  Authorities are investigating a vehicle explosion that occurred Wednesday outside … ",
    "url": "https://thepostmillennial.com/breaking-cybertruck-blows-up-outside-trump-international-hotel-las-vegas"
  },
  {
    "text": "Tesla Cybertruck bursts into flames outside Trump hotel in Las Vegas, killing one  —  The Clark County Fire Department confirmed that it responded to a vehicle fire early Wednesday.  —  A Tesla Cybertruck burst into flames Wednesday morning just outside the entrance of Trump International Hotel … ",
    "url": "https://www.nbcnews.com/news/us-news/tesla-cybertruck-appears-burst-flames-trump-hotel-las-vegas-rcna185932"
  },
  {
    "text": "Johnson protected, diversity office scrapped in new House rules … - Instead of any single House Republican being able to force such a vote, now the motion will have to have eight additional GOP co-sponsors.  — The change is the result of a deal struck between House Republican factions … ",
    "url": "https://www.axios.com/2025/01/01/house-republican-rules-diversity-motion-to-vacate"
  },
  {
    "text": "Trump uses New Orleans attack to rant about ‘Democrats and the Fake News Media’  —  Hours after a man drove an F-150 truck through barriers in New Orleans' Bourbon Street district killing at least ten revelers and injuring at three dozen, Donald Trump weighed in on Truth Social.",
    "url": "https://www.rawstory.com/new-orleans-driver/"
  },
  {
    "text": "Enshittification Comes to Washington  —  My experiences with private-sector package delivery are, to put it mildly, not the best.  As I write this, I'm watching and fretting over a package that is supposed to be delivered to my apartment by FedEx, which only occasionally manages to locate … ",
    "url": "https://newrepublic.com/article/189701/trump-2025-enshittification-civil-service"
  },
  {
    "text": "John Roberts Absurdly Suggests the Supreme Court Has No ‘Political Bias’  —  The chief justice bashed “public officials” who criticize judges for their partisan rulings “without a credible basis for such allegations”  —  In his first term as president, Donald Trump built a conservative 6-3 supermajority on the Supreme Court.",
    "url": "https://www.rollingstone.com/politics/politics-news/john-roberts-supreme-court-political-bias-1235223174/"
  },
  {
    "text": "Elon Musk changes his name to Kekius Maximus on X  —  The world's richest man, Elon Musk, has sparked speculation after changing his name on his social media platform X to “Kekius Maximus”.  —  The tech mogul - and close confidant of US President-Elect Donald Trump - offered no immediate explanation … ",
    "url": "https://www.bbc.com/news/articles/cy53vz1qpx1o"
  },
  {
    "text": "5 storylines to watch in 2025  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  TRAGEDY IN NEW ORLEANS — “10 killed, dozens injured on Bourbon Street in New Orleans as car plows into crowd,” by the Times-Picayune's Ben Myers: “Ten people were killed … ",
    "url": "https://www.politico.com/newsletters/playbook/2025/01/01/5-storylines-to-watch-in-2025-00196183"
  },
  {
    "text": "John Roberts attacks court criticism that he decides lacks a “credible basis” as “illegitimate”  —  Conflating violence against judges with broad criticism the court faces for its extremism, the chief justice ultimately sends a chilling end-of-year report.  —  Chief Justice John Roberts decided … ",
    "url": "https://www.lawdork.com/p/john-roberts-attacks-court-criticism"
  }
]