[
  {
    "text": "House Republicans hit the brakes on town halls after blowback over Trump's cuts  —  A number of Republican lawmakers faced significant pushback in their home districts over Trump and Elon Musk's slashing of the federal government.  —  WASHINGTON — House Republicans are becoming weary … ",
    "url": "https://www.nbcnews.com/politics/congress/house-republicans-town-halls-blowback-trump-cuts-rcna193766"
  },
  {
    "text": "Trump and Musk's slash-and-burn tactics are a sticking point in talks to prevent a shutdown  —  Sen. Patty Murray, the top Democratic appropriator, urged Republicans to help stop Trump from usurping Congress' spending powers and not to “follow Elon towards a shutdown.”",
    "url": "https://www.nbcnews.com/politics/congress/trump-musk-tactics-sticking-point-government-shutdown-rcna193639"
  },
  {
    "text": "Senate Republicans say House budget won't fly with them  —  Tuesday's big win for Speaker Mike Johnson might not last long.  —  House Republicans spent weeks in painstaking negotiations before delivering a budget blueprint for “one big, beautiful bill.”  Now Senate Republicans are preparing to tear it apart.",
    "url": "https://www.politico.com/news/2025/02/26/senate-republicans-reject-house-budget-00206244"
  },
  {
    "text": "Unvaccinated Child Dies of Measles in Texas, Officials Say  —  At least 124 cases of measles have been identified in Texas since late January, mostly among children and teenagers who are either unvaccinated or whose vaccination status is unknown, officials say.",
    "url": "https://www.nytimes.com/2025/02/26/us/texas-measles-outbreak-death.html"
  },
  {
    "text": "First measles death is reported in the West Texas outbreak that's infected more than 120 people  —  A person who was hospitalized has died from measles in West Texas, the first death in an outbreak that began late last month.  Texas Tech University Health Sciences Center spokesperson Melissa Whitfield confirmed the death Wednesday.",
    "url": "https://apnews.com/article/measles-outbreak-west-texas-death-rfk-41adc66641e4a56ce2b2677480031ab9"
  },
  {
    "text": "Washington Post Opinion Editor Exits as Bezos Steers Pages in New Direction  —  Jeff Bezos, the owner of The Post, said that the newspaper's opinion section would focus on “personal liberties and free markets.”  —  The Washington Post's opinion editor, David Shipley, is exiting as the newspaper's owner … ",
    "url": "https://www.nytimes.com/2025/02/26/business/media/washington-post-bezos-shipley.html?unlocked_article_code=1.z04.AaIb.kaTV8X7xSNaN&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Legendary WaPo Editor Slams Bezos' ‘Disgusting’ MAGA Makeover  —  BETRAYAL  —  Former executive editor Marty Baron told the Daily Beast there was “no doubt in my mind” that Bezos was prioritizing his business interests over The Washington Post.",
    "url": "https://www.thedailybeast.com/ex-wapo-editor-marty-baron-sad-and-disgusted-at-bezos-opinions-overhaul/"
  },
  {
    "text": "Bezos directs Washington Post opinion pages to promote ‘personal liberties and free markets’  —  Amazon executive and newspaper owner says in letter that ‘viewpoints opposing those pillars will be left to be published by others’  —  Jeff Bezos, the self-proclaimed “hands-off” … ",
    "url": "https://www.theguardian.com/media/2025/feb/26/jeff-bezos-washington-post-opinion"
  },
  {
    "text": "Trump faces Truth Social backlash over AI video of Gaza with topless Netanyahu and bearded bellydancers  —  Users of president's own social media site criticise video showing reimagined Gaza featuring Trump and Israeli PM sipping cocktails  —  Donald Trump is facing a backlash … ",
    "url": "https://www.theguardian.com/us-news/2025/feb/26/backlash-trump-shares-ai-created-video-reimagined-gaza"
  },
  {
    "text": "Trump Press Sec Seethes at Media over Musk as More Bad Econ News Hits … At Tuesday's media briefing, White House press secretary Karoline Leavitt announced that the White House will now decide who attends briefings, an effort to insulate President Trump from tough scrutiny.",
    "url": "https://newrepublic.com/article/191984/trump-press-sec-seethes-media-musk-bad-econ-news-hits"
  },
  {
    "text": "Elon Musk's business empire is built on $38 billion in government funding  —  Government infusions at key moments helped Tesla and SpaceX flourish, boosting Musk's wealth  —  Elon Musk and his cost-cutting U.S. DOGE Service team have been on a mission to trim government largesse.",
    "url": "https://www.washingtonpost.com/technology/interactive/2025/elon-musk-business-government-contracts-funding/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQwNTQ2MDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQxOTI0Nzk5LCJpYXQiOjE3NDA1NDYwMDAsImp0aSI6IjhhMjk0Y2FkLTNmYmEtNGQ1My05M2EyLTI0YWMzMzE0YjM0NyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS90ZWNobm9sb2d5L2ludGVyYWN0aXZlLzIwMjUvZWxvbi1tdXNrLWJ1c2luZXNzLWdvdmVybm1lbnQtY29udHJhY3RzLWZ1bmRpbmcvIn0.UyTYCuA-0TwC9Vi8zaD2o8wWdlGLS3GU1wZxGDSH58s&itid=gfta"
  },
  {
    "text": "The Trump administration sets the stage for large-scale federal worker layoffs in a new memo  —  Federal agencies must develop plans to eliminate employee positions, according to a memo distributed by President Donald Trump 's administration that sets in motion what could become a sweeping realignment of American government.",
    "url": "https://apnews.com/article/trump-elon-musk-federal-workers-layoffs-d295d4bb2cdd5023c27d9cb03754e81b"
  },
  {
    "text": "Who Is the Anonymous Data Expert Telling Elon Which Cuts to Make?  —  Conservatives have used DataRepublican to spread misinformation about federal agencies.  She's been working at a tech firm that's battled the CFPB … The account, and its alleged findings of mismanaged government agency spending … ",
    "url": "https://www.rollingstone.com/politics/politics-features/elon-musk-data-republican-anonymous-data-expert-doge-tech-1235280817/"
  },
  {
    "text": "White House Kicks Out HuffPost Reporter From Press Pool  —  Breaking with decades of precedent, the Trump White House is insisting on the ability to choose which reporters cover the president.  —  Donald Trump's White House kicked a HuffPost reporter out of the pool of journalists set … ",
    "url": "https://www.huffpost.com/entry/white-house-kicks-out-huffpost-reporter-from-press-pool_n_67be9224e4b0d509934aa224"
  },
  {
    "text": "Social Security Administration Could Cut Half Its Workforce  —  Sources tell the Prospect that a meeting called for a 50 percent reduction in an agency that millions rely on for benefit implementation.  —  There are more than 1,200 Social Security field offices across the country.",
    "url": "https://prospect.org/health/social-security-administration-could-cut-half-its-workforce/"
  },
  {
    "text": "Musk's Ex-Twitter Workers Win Severance Over ‘Fork in the Road’ Email  — Ex-employees prevail in challenges to ‘Fork in the Road’ email  — Billionaire has Trump's support using similar tactics at DOGE  —  Former Twitter employees are scoring early victories in legal challenges … ",
    "url": "https://www.bloomberg.com/news/articles/2025-02-26/musk-s-ex-twitter-workers-win-severance-over-layoff-after-email?accessToken=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzb3VyY2UiOiJTdWJzY3JpYmVyR2lmdGVkQXJ0aWNsZSIsImlhdCI6MTc0MDU5Nzg2MywiZXhwIjoxNzQxMjAyNjYzLCJhcnRpY2xlSWQiOiJTUzdEVElEV0xVNjgwMCIsImJjb25uZWN0SWQiOiJGNDZBMzg1RkE3NTA0NTlCQTEzQ0MxNEZCRUU4ODRERiJ9.Oi3-5sm5GgXyKTCsXgMnap3zJSRZzWfZwVJW0Nr9iJo"
  },
  {
    "text": "“A woman is like a child”: MAGA quickly turns its sights on stripping Republican women of power  —  Conservative women believe complicity will save them.  But an emboldened far-right is gunning for their rights  —  For decades, the anti-abortion movement has aggressively promoted women into visible leadership roles.",
    "url": "https://www.salon.com/2025/02/26/a-woman-is-like-a-child-maga-quickly-turns-its-sights-on-stripping-women-of-power/"
  },
  {
    "text": "White House point man at Homeland Security shared ‘martial law option’ post to keep Trump in office  —  The Trump administration's new point man for dealings with the Department of Homeland Security is a former far-right podcast host and election denier who once shared an article calling for … ",
    "url": "https://www.cnn.com/2025/02/26/politics/paul-ingrassia-trump-administration-liaison-dhs-kfile/"
  },
  {
    "text": "American Airlines flight from Boston aborts landing at D.C. airport to avoid departing plane  —  An American Airlines flight from Boston aborted its landing at Reagan National Airport in Washington, D.C. Tuesday morning to avoid another plane that was taking off on the same runway, authorities said.",
    "url": "https://www.cbsnews.com/boston/news/american-airlines-flight-boston-dc-aborted-landing/"
  },
  {
    "text": "Donald Trump threatens to impose 25% tariffs on EU goods  —  US president warns levies will target auto sector and be applied ‘generally’  —  Donald Trump has threatened to slap 25 per cent tariffs on imports from the EU, as he lashed out at the bloc, saying it “was formed to screw the United States”.",
    "url": "https://www.ft.com/content/2f0288f6-3f6a-4334-b666-3f0122981842"
  },
  {
    "text": "Trump's nominee for solicitor general won't rule out ignoring court orders in ‘extreme cases’  —  President Donald Trump's nominee to be solicitor general told the Senate Judiciary Committee Wednesday that presidents might rightfully defy court orders in “extreme cases.”",
    "url": "https://www.politico.com/live-updates/2025/02/26/congress/trumps-nominee-for-solicitor-general-00206266"
  },
  {
    "text": "Not known for political coverage, Wired takes a leading role in tracking Elon Musk's team  —  Shortly after becoming Wired's global editorial director in 2023, Katie Drummond acted on an early-morning idea.  With a presidential election coming, the tech-focused news outlet needed a team … ",
    "url": "https://apnews.com/article/elon-musk-wired-doge-trump-1f3988a459d39f39e7be6c598aa3d710"
  },
  {
    "text": "Bluesky Deletes AI Protest Video of Trump Sucking Musk's Toes, Calls It ‘Non-Consensual Explicit Material’  —  Update: After this article was published, Bluesky restored Kabas' post and told 404 Media the following: “This was a case of our moderators applying the policy for non-consensual AI content strictly.",
    "url": "https://www.404media.co/bluesky-deletes-ai-protest-video-of-trump-sucking-musks-toes-calls-it-non-consensual-explicit-material/"
  },
  {
    "text": "With his reelection chances in doubt, Adams to skip signature campaign event  —  The mayor has decided not to attend a candidate forum hosted by a union that endorsed him in 2021, citing legal advice.  —  NEW YORK — Mayor Eric Adams will skip a candidate forum hosted by a union central to his 2021 victory … ",
    "url": "https://www.politico.com/news/2025/02/26/adams-reelection-skip-campaign-event-00206207"
  },
  {
    "text": "Supreme Court leans toward reviving straight woman's reverse discrimination claim  —  Marlean Ames sued Ohio officials claiming she was treated unfairly at work because she is straight.  —  WASHINGTON — The Supreme Court on Wednesday appeared likely to allow a woman to pursue a claim … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-weighs-straight-womans-reverse-discrimination-claim-rcna193705"
  },
  {
    "text": "Exclusive: GOP staffers told to call occupied West Bank Judea and Samaria … - Changing the terminology the committee uses is a symbolic move that reflects the support among many Republicans in Congress for recognizing Israeli sovereignty there.  — The occupation in the West Bank … ",
    "url": "https://www.axios.com/2025/02/26/west-bank-judea-samaria-name-change-gop"
  },
  {
    "text": "Following executive orders, 'The President's Own' Marine Band scraps concert  —  The canceled collaboration with Equity Arc was to feature high-school musicians of color who competed for spots to perform with the U.S. Marine Band.  —  There is perhaps no band closer to the president's ear … ",
    "url": "https://www.washingtonpost.com/entertainment/music/2025/02/26/presidents-own-marine-band-cancels-concert/"
  }
]