[
  {
    "text": "Trump's Racist Attack on Kamala Harris Was No Accident  —  Is it, perhaps, a sign that the Vice-President's swift rise in the polls has him panicked?  —  Spoiler alert: he meant it.  When Donald Trump claimed, on Wednesday afternoon, in a combative onstage interview at the National Association … ",
    "url": "https://www.newyorker.com/news/letter-from-bidens-washington/trumps-racist-attack-on-kamala-harris-was-no-accident"
  },
  {
    "text": "Trump hits back at Dem attacks: 'They're the weird ones'  —  “Nobody's ever called me weird.  I'm a lot of things, but weird I'm not,” Trump said.  —  After over a week of Vice President Kamala Harris and her surrogates calling Donald Trump and running mate JD Vance “weird,” the former president attempted to play an Uno reverse card.",
    "url": "https://www.politico.com/news/2024/08/01/trump-dem-attacks-weird-00172386"
  },
  {
    "text": "Vance defends Trump over former president's false claims about Harris' racial identity  —  Republican vice presidential nominee JD Vance on Thursday defended Donald Trump's false comments about Kamala Harris' racial identity, saying that it was “totally reasonable” for his ticket mate to describe … ",
    "url": "https://www.cnn.com/2024/08/01/politics/chameleon-trump-vance-harris-ethnicity/"
  },
  {
    "text": "Trump campaign says it raised $138.7 million in July  —  Trump's war chest now sits at $327 million, according to the campaign.  —  Former President Donald Trump pulled in nearly $140 million in July, his campaign announced Thursday, a major haul coming off of the Republican National Convention and an assassination attempt.",
    "url": "https://www.politico.com/news/2024/08/01/trump-campaign-july-fundraising-00172345"
  },
  {
    "text": "‘That had to be bittersweet’ — how Biden managed a historic prisoner swap as his campaign was disintegrating  —  Just as President Biden was deciding to step off the ticket, he pulled off one of the biggest and most complex prisoner deals in U.S. history.  —  President Joe Biden's mind … ",
    "url": "https://www.politico.com/news/2024/08/01/biden-campaign-prisoner-swap-00172408"
  },
  {
    "text": "Former CIA chief: Prisoner swap a ‘remarkable display’ of ‘successful’ diplomacy by Biden administration  —  Video Player is loading.  —  Play Video  —  Unmute  —  Current Time 0:00 … Stream Type LIVE  —  Seek to live, currently behind liveLIVE  —  Playback Rate  —  Chapters",
    "url": "https://thehill.com/policy/international/4807096-former-cia-chief-john-brennan-russia-prisoner-swap/"
  },
  {
    "text": "Harris campaign has met with 6 potential VP picks as the selection process nears its end  —  The top contenders include governors, a senator in a key battleground state and a member of President Joe Biden's Cabinet.  —  WASHINGTON — Vice President Kamala Harris' campaign has met … ",
    "url": "https://www.nbcnews.com/politics/2024-election/harris-campaign-met-6-potential-vp-picks-selection-process-nears-end-rcna164706"
  },
  {
    "text": "Women's Group to Harris: Dump Shapiro Over Sex Case Failings  —  VEEPSTAKES  —  Pennsylvania Gov. Shapiro's involvement in a sexual harassment claim against a longtime aide may hit his VP chances.  —  Deputy Washington Bureau Chief  —  Pennsylvania Gov. Josh Shapiro is the betting favorite … ",
    "url": "https://www.thedailybeast.com/womens-group-to-harris-dump-shapiro-over-sex-case-cover-up"
  },
  {
    "text": "JD Vance Is An Investor In A Far Right Video Platform Filled With Neo-Nazi Content  —  This is your TPM evening briefing.  —  Sen. J.D. Vance (R-OH) has been making headlines for his “rocky rollout” since being named former President Donald Trump's running mate last month.",
    "url": "https://talkingpointsmemo.com/where-things-stand/jd-vance-is-an-investor-in-a-far-right-video-platform-filled-with-neo-nazi-content"
  },
  {
    "text": "Republicans Want Someone Younger Than Donald Trump as President: New Poll  —  voters have said they would prefer a president who is younger than the 78-year-old former commander-in-chief.  —  In a YouGov poll conducted between July 25-29, 59 percent of  —  surveyed said they would prefer a president under the age of 75.",
    "url": "https://www.newsweek.com/donald-trump-too-old-age-2024-election-president-poll-1932983"
  },
  {
    "text": "Scoop: Kamala Harris' brother-in-law emerges as key campaign adviser … - But some Democratic advisers in close contact with the campaign worry West's prominent role could re-create the same family dynamics that at times caused unnecessary drama in her 2020 campaign.",
    "url": "https://www.axios.com/2024/08/01/kamala-harris-tony-west-president-campaign"
  },
  {
    "text": "The presidential election is a toss-up  —  Kamala Harris is giving Democrats the race that Joe Biden couldn't.  —  I don't want to get in the habit of making a huge ruckus every time the election model passes a certain arbitrary probabilistic threshold.  There are still a very long 96 days … ",
    "url": "https://www.natesilver.net/p/the-presidential-election-is-a-toss"
  },
  {
    "text": "Recount confirms Bob Good's loss after GOP rallies to oust one of their own  —  A recount on Thursday confirmed that state Sen. John McGuire beat Good in the June election by just a few hundred votes, according to The Associated Press.  —  Rep. Bob Good (R-Va.), the chair … ",
    "url": "https://www.politico.com/news/2024/08/01/recount-confirms-bob-goods-loss-after-gop-rallies-to-oust-one-of-their-own-00172424"
  },
  {
    "text": "CBP officers in Arizona seize more than half a ton of fentanyl in largest seizure in agency history  —  TUCSON, Ariz. - U.S. Customs and Border Protection officers at the Port of Lukeville recently seized approximately 4 million blue fentanyl pills — weighing more than 1,000 pounds … ",
    "url": "https://www.cbp.gov/newsroom/local-media-release/cbp-officers-arizona-seize-more-half-ton-fentanyl-largest-seizure"
  },
  {
    "text": "Trump co-defendant Jeff Clark barred from practicing law after fake elector charges  —  The Washington D.C. Bar Association has suspended former acting Assistant Attorney General Jeffrey Clark from practicing law for two years, Politico's Kyle Cheney reported Thursday.",
    "url": "https://www.rawstory.com/jeffrey-clark-bar-association-2668860887/"
  },
  {
    "text": "U.S. Recognizes Maduro's Rival as Winner of Venezuelan Election  —  Secretary of State Antony J. Blinken said there was “overwhelming evidence” that Edmundo González had won, despite President Nicolás Maduro's claim of victory.  —  The United States on Thursday night recognized … ",
    "url": "https://www.nytimes.com/2024/08/01/world/americas/venezuela-election-gonzalez-maduro.html"
  }
]