[
  {
    "text": "Trump rages as former acolytes turn against him under legal heat  —  Donald Trump's wealth, power and fame acted like a magnet for new associates keen to enter his orbit.  But now, key figures who sought a share of his reflected glory are turning against him to save themselves.",
    "url": "https://www.cnn.com/2023/10/25/politics/trump-former-aides-turn-against-him/"
  },
  {
    "text": "A Coup on His Resume  —  A note for historians (and psychologists): … The Bulwark is a reader-supported publication.  To receive new posts and support my work, consider becoming a free or paid subscriber.  —  Trump reminded the GOP that he remains the apex predator in the party.",
    "url": "https://plus.thebulwark.com/p/a-coup-on-his-resume"
  },
  {
    "text": "Mitt Romney sounds one last alarm on Trump  —  Ever since the rise of Donald Trump, many folks involved in politics have theorized about how we got here — and done a little introspection about whether anyone could have stopped him.  —  But my assumption is that there are three people alive today … ",
    "url": "https://www.nbcnews.com/politics/elections/chuck-todd-mitt-romney-sounds-one-last-alarm-trump-rcna121771"
  },
  {
    "text": "Ex-Chief of Staff Mark Meadows granted immunity, tells special counsel he warned Trump about 2020 claims: Sources  —  Meadows said Trump was “dishonest” on election night, according to sources.  —  Former President Donald Trump's final chief of staff in the White House, Mark Meadows … ",
    "url": "https://abcnews.go.com/US/chief-staff-mark-meadows-granted-immunity-tells-special/story?id=104231281"
  },
  {
    "text": "Live updates House expected to vote on Republican Mike Johnson as speaker  —  The House is expected to vote Wednesday on whether to install Rep. Mike Johnson (R-La.) as its speaker.  Late Tuesday, Johnson became the fourth Republican pick for the post since the ouster of Rep. Kevin McCarthy (R-Calif.) three weeks ago.",
    "url": "https://www.washingtonpost.com/politics/2023/10/25/house-speaker-vote/"
  },
  {
    "text": "5 things to know about Mike Johnson, the GOP's latest House speaker nominee  —  Republicans in the House of Representatives picked Rep. Mike Johnson (La.), who serves as vice chairman of the House Republican Conference, as their fourth nominee for the speakership.",
    "url": "https://www.washingtonpost.com/politics/2023/10/25/who-is-mike-johnson-house-speaker/"
  },
  {
    "text": "GOP speaker nominee Mike Johnson played a key role in efforts to overturn the 2020 election  —  Johnson, the latest Republican nominee for House speaker, led an amicus brief in support of a Texas lawsuit seeking to overturn Joe Biden's 2020 victory in four battleground states.",
    "url": "https://www.nbcnews.com/politics/congress/mike-johnson-january-6-house-speaker-nominee-rcna122081"
  },
  {
    "text": "Take four: Can Mike Johnson get 217?  —  The wonkish Louisiana conservative appears poised to break the House GOP's speaker stalemate.  —  Twenty-two days.  Fourteen candidates.  Four nominees.  Three floor votes (and counting).  —  Could House Republicans finally be on the cusp of a breakthrough in their search for a speaker?",
    "url": "https://www.politico.com/news/2023/10/25/mike-johnson-speaker-votes-00123421"
  },
  {
    "text": "Israel Agrees to Delay Invasion of Gaza So U.S. Can Rush Missile Defenses to Region  —  Israel has agreed, for now, to a request from the U.S. to get its air defenses in place to protect U.S. troops in the region ahead of an expected ground invasion of Gaza, U.S. and Israeli officials said.",
    "url": "https://www.wsj.com/livecoverage/israel-hamas-war-palestinians-news/card/israel-agrees-to-delay-invasion-of-gaza-so-u-s-can-rush-missile-defenses-to-region-wFU3kduhruPhm6e8OM7b?mod=followamazon"
  },
  {
    "text": "Israel-Hamas War Updates: Israel Agrees to Delay Gaza Invasion for U.S. Military to Prepare Defenses  —  Lebanon's Hezbollah reported a meeting with militant leaders from Gaza, while pressure grew on Israel over humanitarian needs in Gaza.  —  Israel Intensifies Bombing in Gaza, Hits West Bank with Airstrike",
    "url": "https://www.wsj.com/livecoverage/israel-hamas-war-palestinians-news?mod=followamazon"
  },
  {
    "text": "Voters soundly reject Gabrielle Hanson, other MAGA candidates in historic Franklin, Tennessee election  —  FRANKLIN, Tenn. (WTVF) — In perhaps the most bizarre race that this picturesque Middle Tennessee community has ever experienced, Franklin voters resoundingly rejected a candidate for mayor … ",
    "url": "https://www.newschannel5.com/news/newschannel-5-investigates/franklin-politics/voters-soundly-reject-gabrielle-hanson-other-maga-candidates-in-historic-franklin-tennessee-election"
  },
  {
    "text": "It's the culture war, stupid: How Republicans view the presidency  —  One of the central refrains of Donald Trump's campaign for the 2024 Republican presidential nomination — a refrain focused, justifiably, on a general election rematch against President Biden — is that the economy was more robust during his tenure in the White House.",
    "url": "https://www.washingtonpost.com/politics/2023/10/25/republicans-trump-economy-issues/"
  },
  {
    "text": "Threats to American Democracy Ahead of an Unprecedented Presidential Election  —  Introduction  —  In this divided era of American politics, the nation turns its eyes toward an unprecedented presidential election, with two of the oldest leading candidates in history … ",
    "url": "https://www.prri.org/research/threats-to-american-democracy-ahead-of-an-unprecedented-presidential-election/"
  },
  {
    "text": "Republicans pray for an early voting reversal in Virginia  —  The Republican Party under President Donald Trump has abandoned the practice.  Glenn Youngkin is betting Virginia Republicans can be convinced otherwise.  —  GLEN ALLEN, Va. — Gov. Glenn Youngkin is trying to get Republican voters … ",
    "url": "https://www.politico.com/news/2023/10/25/republicans-early-voting-virginia-youngkin-trump-00123376"
  },
  {
    "text": "Hillary Clinton Repeatedly Snaps At Heckler In Bonkers Exchange  —  A protester got in the face of the former secretary of state, and she just wanted him to shut up during a panel at Columbia University.  —  LOADING  —  Hillary Clinton attempted to quiet a theatrical heckler this week in a tense exchange that lasted several minutes.",
    "url": "https://www.huffpost.com/entry/hillary-clinton-heckler-columbia_n_6538ea9ee4b0c8556103621c"
  },
  {
    "text": "A Close Look at Some Key Evidence in the Gaza Hospital Blast  —  A widely cited missile video does not shed light on what happened, a Times analysis concludes.  —  The video shows a projectile streaking through the darkened skies over Gaza and exploding in the air.  Seconds later, another explosion is seen on the ground.",
    "url": "https://www.nytimes.com/2023/10/24/world/middleeast/gaza-hospital-israel-hamas-video.html"
  },
  {
    "text": "Florida's DeSantis bans pro-Palestinian group from state campuses  —  Florida's university system, working with Governor Ron DeSantis, ordered colleges on Tuesday to shut down a pro-Palestinian student organization, marking the first U.S. state to outlaw the group whose national leadership backed Hamas' attack on Israel.",
    "url": "https://www.reuters.com/world/us/floridas-desantis-bans-pro-palestinian-student-group-2023-10-25/"
  }
]