[
  {
    "text": "Israel and Hamas reach tentative U.S.-brokered deal to pause conflict, free dozens of hostages  —  A five-day pause in fighting, monitored by aerial surveillance, could see dozens of women and children freed from captivity in Gaza, according to people familiar with the terms of the agreement",
    "url": "https://www.washingtonpost.com/national-security/2023/11/18/us-israel-hamas-reach-tentative-deal-pause-conflict-free-dozens-hostages/"
  },
  {
    "text": "PM says bucking int'l pressure against Gaza op, stresses no hostage deal ‘as of now’  —  Netanyahu, Gallant vow IDF will track down Hamas operatives in south of Strip, outside enclave; Gantz: ‘Everything we are doing is aimed first and foremost’ at return of hostages",
    "url": "https://www.timesofisrael.com/pm-says-bucking-intl-pressure-against-gaza-op-stresses-as-of-now-no-hostage-deal/"
  },
  {
    "text": "Poll: Biden's standing hits new lows amid Israel-Hamas war  —  Young voters are breaking from Biden, helping give Trump a narrow lead for the first time in NBC News polling, though the gap is within the margin of error.  —  President Joe Biden's approval rating has declined to the lowest level … ",
    "url": "https://www.nbcnews.com/politics/2024-election/poll-bidens-standing-hits-new-lows-israel-hamas-war-rcna125251"
  },
  {
    "text": "Biden campaign works to ease Democratic anxiety over reelection chances  —  The president and his team are facing calls to become more active and aggressive in highlighting the contrast with his most likely opponent, Donald Trump  —  Over the last full weekend of September … ",
    "url": "https://www.washingtonpost.com/politics/2023/11/19/biden-campaign-democrats-anxiety-trump/"
  },
  {
    "text": "Gov. Evers says ‘Neo-Nazis, antisemitism, and white supremacy have no home in Wisconsin’ after demonstration on state Capitol grounds  —  MADISON — A group of nearly two dozen people waving swastika flags and chanting antisemitic rhetoric marched on the Wisconsin state Capitol grounds Saturday afternoon … ",
    "url": "https://www.jsonline.com/story/news/politics/2023/11/18/neo-nazi-group-marches-on-state-capital/71636061007/"
  },
  {
    "text": "Neo-Nazis March Through Madison Yelling ‘There Will Be Blood’  —  They wore masks, of course.  —  A group of masked neo-Nazis marched through the capital of Wisconsin on Saturday afternoon waving swastikas around, shouting racial slurs at onlookers, and chanting “there will be blood.”",
    "url": "https://www.thedailybeast.com/neo-nazis-march-through-madison-yelling-there-will-be-blood"
  },
  {
    "text": "Ron DeSantis refuses to condemn Elon Musk's endorsement of antisemitic conspiracy theory  —  WASHINGTON — 2024 Republican presidential hopeful and Florida Gov. Ron DeSantis refused on Sunday to condemn Elon Musk over his endorsement of an antisemitic conspiracy theory that falsely accused Jewish people … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2023/11/19/ron-desantis-elon-musk-antisemitism-2024-gop/71645125007/"
  },
  {
    "text": "The U.S. won't back down from the challenge of Putin and Hamas  —  Joe Biden, a Democrat, is president of the United States.  —  Today, the world faces an inflection point, where the choices we make — including in the crises in Europe and the Middle East — will determine the direction of our future for generations to come.",
    "url": "https://www.washingtonpost.com/opinions/2023/11/18/joe-biden-gaza-hamas-putin/"
  },
  {
    "text": "Militants believed to be Houthi rebels use helicopter to seize Japanese tanker in Red Sea  —  The attack off the coast of Yemen comes just days after the Houthis issued a graphic with captions in Hebrew, Arabic and English that said, “We will sink your ships.”",
    "url": "https://www.nbcnews.com/news/world/militants-believed-houthi-rebels-use-helicopter-seize-japanese-tanker-rcna125883"
  },
  {
    "text": "A Jan. 6 Defendant Pleads His Case to the Son Who Turned Him In  —  The Capitol attacks ruptured their mutual trust.  In the weeks before Brian Mock's sentencing, could he mend the divide with his son A.J.?  —  By Eli SaslowPhotographs by Erin Schaff  —  The trial was over and the verdict was in … ",
    "url": "https://www.nytimes.com/2023/11/19/us/politics/jan-6-trial-father-son.html"
  },
  {
    "text": "EU Commissioner Urpilainen Joins Race to Be Finland's President  — Sauli Niinisto hits term limit after serving for 12 years  —  Finland's representative on the European Commission, Jutta Urpilainen, plans to enter the race to become president of the Nordic country.",
    "url": "https://www.bloomberg.com/news/articles/2023-11-19/eu-commissioner-jutta-urpilainen-joins-race-for-finland-s-president"
  },
  {
    "text": "I Read Mike Johnson's Legal Filings.  They Reveal a Distinctive Pattern.  —  The new speaker's view is “the First Amendment for me but not for thee.”  —  The newly elected speaker of the House of Representatives, J. Michael Johnson (R-La.), spent years as a practicing lawyer before his election … ",
    "url": "https://www.politico.com/news/magazine/2023/11/19/mike-johnson-legal-filings-00127832"
  },
  {
    "text": "Newsom TV ad hits DeSantis on abortion as Fox debate looms  —  California's Democratic governor is airing a new ad in Florida and Washington criticizing his Florida Republican nemesis over his state's six-week abortion ban.  —  SAN FRANCISCO — California Gov. Gavin Newson is sending … ",
    "url": "https://www.politico.com/news/2023/11/19/newsom-desantis-tv-ad-debate-00127932"
  },
  {
    "text": "You shouldn't be driving over 100 mph—and your car shouldn't let you  —  The NTSB recommended that automakers be required to install technology to prevent reckless speeding.  —  The traffic signal on North Las Vegas's North Commerce Street had been red for at least 29 seconds, but the Dodge Challenger did not slow down.",
    "url": "https://www.fastcompany.com/90985257/you-shouldnt-be-driving-over-100-mph-and-your-car-shouldnt-let-you"
  }
]