[
  {
    "text": "A Troubling Trump Pardon and a Link to the Kushners  —  A commutation for a drug smuggler named Jonathan Braun had broader implications than previously known.  It puts new focus on how Donald Trump would use his clemency powers in a second term.  —  Even amid the uproar … ",
    "url": "https://www.nytimes.com/2023/11/26/us/politics/trump-pardon-braun.html"
  },
  {
    "text": "Trump's Pardoning of a Loan Shark Derailed a Federal Investigation: Report  —  The former president undermined negotiations between Jonathan Braun and prosecutors who hoped Braun would testify against other predatory lenders in exchange for his release",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-pardon-loan-shark-jonathan-braun-1234897002/"
  },
  {
    "text": "Chris Christie plays down risk to Republicans if Trump loses primary but won't leave the race  —  He argued “the public en masse will begin to ignore” the former president  —  Republican presidential candidate and former Governor of New Jersey Chris Christie speaks at the Hudson Institute, on Nov. 15, 2023, in Washington, D.C.",
    "url": "https://abcnews.go.com/Politics/chris-christie-plays-risk-republicans-trump-loses-primary/story?id=105156248"
  },
  {
    "text": "To Beat Trump, Nikki Haley Is Trying to Speak to All Sides of a Fractured G.O.P.  —  Her campaign will test what political strategists and observers of her rise in politics have said is among her greatest political skills: an ability to massage her message to the moment.",
    "url": "https://www.nytimes.com/2023/11/26/us/politics/haley-trump-issues-2024.html"
  },
  {
    "text": "From Niagara Falls to Texas to Gaza, a horrifying look into the abyss of a post-truth future  —  “There was truth and there was untruth, and if you clung to the truth even against the whole world, you were not mad.”  — George Orwell, 1984In the ever-shrinking world of a free and fair media … ",
    "url": "https://www.inquirer.com/opinion/commentary/free-press-right-wing-authoritarianism-20231126.html"
  },
  {
    "text": "A doctor tried to renew his passport.  Now he's no longer a citizen.  —  The Northern Virginia doctor was born in D.C. and given a U.S. birth certificate.  At 61, he learned his citizenship was granted by mistake.  —  Siavash Sobhani is stateless.  —  The Northern Virginia doctor knows at least that much about his situation.",
    "url": "https://www.washingtonpost.com/dc-md-va/2023/11/25/virginia-doctor-passport-citizenship-nightmare/"
  },
  {
    "text": "Why Trump's Trials Should Be on TV  —  The conduct of the trials, their fairness, and their possibly damning verdicts will be at the center of the 2024 election.  Transparency is crucial.  —  On November 6th, Donald Trump emerged from a New York City courtroom, where he had testified … ",
    "url": "https://www.newyorker.com/magazine/2023/12/04/why-trumps-trials-should-be-on-tv?currentPage=all"
  },
  {
    "text": "A Jewish professor at USC confronted pro-Palestinian students.  He's now barred from campus  —  Homepage News,Israel-Hamas,Education  —  Until recently, USC professor John Strauss was known mostly for his research on the economics of developing countries, with decades of fieldwork in Indonesia and China.",
    "url": "https://www.latimes.com/california/story/2023-11-26/a-usc-professor-called-for-hamas-to-be-killed-hes-now-banned-from-campus"
  },
  {
    "text": "Gaza: Findings on October 17 al-Ahli Hospital Explosion  —  Evidence Points to Misfired Rocket but Full Investigation Needed  —  (Jerusalem) - The explosion that killed and injured many civilians at al-Ahli Arab Hospital in Gaza on October 17, 2023, resulted from an apparent rocket-propelled munition … ",
    "url": "https://www.hrw.org/news/2023/11/26/gaza-findings-october-17-al-ahli-hospital-explosion"
  },
  {
    "text": "Biden Asked If He's Too Old to Run in 2024: 'That's Stupid!'  —  He didn't respond to a question about his standing in polls against Trump  —  President Joe Biden dismissed concerns about his age as “stupid” while shopping in Nantucket, Massachusetts over the weekend.",
    "url": "https://themessenger.com/politics/joe-biden-nantucket-2024-age-fox-news"
  },
  {
    "text": "4-year-old Israeli American hostage is released  —  Abigail Edan, the 4-year-old American dual citizen abducted by Hamas on October 7, has been released - marking the first successful release of an American hostage since the start of a truce between Israel and Hamas.  Edan is one of the 17 hostages released Sunday.",
    "url": "https://www.cnn.com/2023/11/26/politics/abigail-edan-jake-sullivan-national-security-adviser-israel-gaza-hostages-cnntv/"
  },
  {
    "text": "Attackers seize an Israel-linked tanker off Yemen in a third such assault during the Israel-Hamas war  —  Attackers seized a tanker linked to Israel off the coast of Yemen on Sunday, authorities said.  While no group immediately claimed responsibility, it comes as at least two other maritime attacks … ",
    "url": "https://apnews.com/article/israel-palestinians-hamas-war-yemen-ship-attack-526842504dc9f6bb7ca6e1d5104f77a3"
  },
  {
    "text": "Argentina's Milei Heads to US, Invites Lula to Inauguration  — Milei to meet Biden administration officials in Washington  — Envoy traveled to Brazil to invite Lula to swearing-in  —  Argentina President-elect Javier Milei on Sunday night will head to the US while his incoming foreign … ",
    "url": "https://www.bloomberg.com/news/articles/2023-11-26/argentina-s-milei-traveling-to-ny-washington-for-meetings"
  },
  {
    "text": "Members of Congress Head for the Exits, Many Citing Dysfunction  —  More than three dozen incumbents have announced they will not seek re-election next year.  Some are running for other offices, while others intend to leave Congress altogether.  —  Eleven are running for the Senate.",
    "url": "https://www.nytimes.com/2023/11/26/us/politics/congress-retirement-republicans-democrats.html"
  }
]