[
  {
    "text": "Israeli minister Benny Gantz resigns from war cabinet in blow to Netanyahu  —  Israeli war cabinet member Benny Gantz has resigned from Benjamin Netanyahu's government, delivering a blow to the prime minister who has been celebrating the rare rescue of hostages held in Gaza.",
    "url": "https://www.cnn.com/2024/06/09/middleeast/benny-gantz-resignation-post-war-plan-gaza-intl-latam/"
  },
  {
    "text": "Benny Gantz Quits Israel's Emergency Government in Dispute Over Gaza  —  Gantz threatened to resign last month.  —  The Israeli politician Benny Gantz, a key member of the country's war cabinet, quit the government on Sunday over Prime Minister Benjamin Netanyahu's handling of the war in Gaza.",
    "url": "https://www.nytimes.com/live/2024/06/09/world/israel-gaza-war-hamas"
  },
  {
    "text": "Gaza's Health Ministry says 274 Palestinians were killed in Israeli raid that rescued 4 hostages  —  Police use water cannon to disperse protesters at anti-government rally in Tel Aviv  —  At least 274 Palestinians, including dozens of children, were killed, and hundreds more were wounded … ",
    "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-06-09-2024-61eb1be9a9d0cf2dbf250cd4a8ed4dbf"
  },
  {
    "text": "One day after dramatic hostage rescue, Israeli War Cabinet minister Benny Gantz resigns  —  Militant-held Israeli hostages were among the more than 200 people killed in the raid that freed four captives and has been lauded as heroic in Israel but described as a massacre across much of the Middle East, Hamas officials said Sunday.",
    "url": "https://www.usatoday.com/story/news/world/israel-hamas/2024/06/09/israeli-war-updates-gaza-hamas/74035396007/"
  },
  {
    "text": "Trump and Biden neck and neck nationally and in battlegrounds — CBS News poll  —  Among all the factors on voters' minds this election, former President Donald Trump's guilty verdict pales in comparison to issues like the economy, inflation, and the border — all items on which Trump maintains advantages.",
    "url": "https://www.cbsnews.com/news/poll-trump-biden-neck-and-neck-06-09-2024/"
  },
  {
    "text": "Europe swings to the right — led by France  —  Center-right and far-right parties are leading the way in the EU election.  —  Europe's center of political gravity is veering to the right.  —  Center-right and far-right parties are set to take the largest number of seats … ",
    "url": "https://www.politico.eu/article/eu-european-election-results-2024-swings-right-france/"
  },
  {
    "text": "EU projection shows far-right parties making big gains in European elections as Greens suffer losses  —  European Commission President Ursula von der Leyen cast her ballot on the final day of the EU election on Sunday.  Von der Leyen voted in the village of Beinhorn in her home country of Germany.",
    "url": "https://apnews.com/article/eu-election-right-migration-climate-polls-vote-0fbfcb7bd987008e802d70f759fa870b"
  },
  {
    "text": "Macron dissolves parliament after EU defeat, calls election  —  French President Emmanuel Macron dissolved parliament on Sunday, following his party's crushing defeat at the hands of the far-right National Rally in the European election.  —  The first round of the election will take place on June 30.",
    "url": "https://www.politico.eu/article/eu-european-election-results-2024-emmanuel-macron-dissolve-parliament-france/"
  },
  {
    "text": "The most important sentence you will read about the 2024 election  —  Messaging expert Anat Shenker-Osorio explains that victory in November depends on convincing low-information voters that the MAGA threat is real.  —  Donald Trump's greatest advantage is that he is treated like a clown.",
    "url": "https://i-know-how-much-you-care.ghost.io/the-most-important-sentence-you-will-read-about-the-2024-election/"
  },
  {
    "text": "Trump will hold outdoor Las Vegas rally in scorching heat.  His campaign has extra medics and water  —  Former President Donald Trump 's campaign is hiring extra medics, loading up on fans and water bottles and allowing supporters to carry umbrellas to an outdoor rally Sunday in Las Vegas … ",
    "url": "https://apnews.com/article/donald-trump-nevada-rally-heat-las-vegas-90b0c766b9bfc41b370953834b70f7c9"
  },
  {
    "text": "The Day My Old Church Canceled Me Was a Very Sad Day  —  This week, the leaders of the Presbyterian Church in America will gather in Richmond, Va., for their annual General Assembly.  The Presbyterian Church in America is a small, theologically conservative Christian denomination that was my family's church home for more than 15 years.",
    "url": "https://www.nytimes.com/2024/06/09/opinion/presbyterian-church-evangelical-canceled.html"
  },
  {
    "text": "Trump probation interview set for Monday after hush money conviction  —  The former president was convicted last month on 34 felony counts of falsifying business records in the hush money case against him.  —  Former President Trump is scheduled to sit for a virtual interview on Monday … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-probation-interview-monday-hush-money-conviction-rcna156219"
  },
  {
    "text": "Republicans pitch tax cuts for corporations, the wealthy in 2025  —  Trump has asked wealthy donors for donations, promising large tax breaks in return if he retakes the White House  —  Republicans in Congress are preparing to not just extend former president Donald Trump's 2017 tax cuts … ",
    "url": "https://www.washingtonpost.com/business/2024/06/09/biden-trump-taxes-election/"
  },
  {
    "text": "Bipartisanship or Republican meddling?  AIPAC is biggest source of GOP donations in Dem primaries  —  AIPAC sees support for Israel as bipartisan, and its donors come from both parties.  But its practice of sending money from GOP donors into Democratic races has enraged progressives.",
    "url": "https://www.politico.com/news/2024/06/09/aipac-republican-donors-democratic-primaries-00162404"
  },
  {
    "text": "Far-right fossil fuel company allies pressure US supreme court to shield firms in unprecedented campaign  —  Groups linked to billionaire Leonard Leo, who seems to have ties to Chevron, are pressing the court to intervene in lawsuits that could cost billions",
    "url": "https://www.theguardian.com/us-news/article/2024/jun/09/fossil-fuel-allies-pressuring-supreme-court"
  }
]