[
  {
    "text": "Playbook: How Mike Johnson boxed himself in  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  WHAT JEN O'MALLEY DILLON IS READING — The GOP-backed bid to change Nebraska's presidential elector system to a winner-take-all setup — likely giving DONALD TRUMP … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/04/04/how-mike-johnson-boxed-himself-in-00150544"
  },
  {
    "text": "Attempt to consolidate Electoral College votes fails in Nebraska Legislature  —  ‘Winner-take-all’ change would eliminate Democrats' opportunity to repeat the 2020 ‘blue dot’ win for Biden  —  LINCOLN, Neb. (WOWT) - An attempt to turn Nebraska into a “winner-take-all” state … ",
    "url": "https://www.wowt.com/2024/04/03/nebraska-lawmakers-pushing-consolidate-states-electoral-college-votes/"
  },
  {
    "text": "Nebraska legislators buck Trump by blocking Electoral College vote change — for now  —  Former President Donald Trump and Republican Gov. Jim Pillen have called on lawmakers to change the state's Electoral College vote allocation to a winner-take-all system.",
    "url": "https://www.nbcnews.com/politics/2024-election/nebraska-legislators-buck-trump-blocking-electoral-college-vote-change-rcna146321"
  },
  {
    "text": "Biden moves to defang political assaults on federal workforce  —  The move is widely seen as a response to former President Donald Trump's efforts to root out what he called a “deep state” that thwarted his policies.  —  The Biden administration put the finishing touches Thursday on a plan … ",
    "url": "https://www.politico.com/news/2024/04/04/biden-moves-to-defang-political-assaults-on-federal-workforce-00150446"
  },
  {
    "text": "Jack Smith puts Judge Aileen Cannon on notice  —  Judge Aileen M. Cannon has left many legal experts dumbfounded with her handling of the criminal classified documents case against former president Donald Trump, the man who nominated her to the federal bench.  —  And special counsel Jack Smith appears to be losing patience with her.",
    "url": "https://www.washingtonpost.com/politics/2024/04/03/jack-smith-puts-judge-aileen-cannon-notice/"
  },
  {
    "text": "Missouri's ridiculous lawfare against Media Matters  —  AG Andrew Bailey is punishing the watchdog group for making Elon Musk sad. … Move over Ken Paxton!  There's a new crazy state attorney general in town, and he's coming for your crooked crown.  —  Last week, Missouri Attorney General … ",
    "url": "https://www.publicnotice.co/p/missouri-media-matters-lawsuit-ag-andrew-bailey"
  },
  {
    "text": "Judge Won't Delay Trump's Criminal Trial to Wait for Immunity Ruling  —  The former president had asked the judge to push back his Manhattan criminal trial, slated to begin April 15, until after the Supreme Court decides whether he is immune from prosecution.",
    "url": "https://www.nytimes.com/2024/04/03/nyregion/trump-merchan-immunity-ruling.html"
  },
  {
    "text": "‘The machine did it coldly’: Israel used AI to identify 37,000 Hamas targets  —  Israeli intelligence sources reveal use of ‘Lavender’ system in Gaza war and claim permission given to kill civilians in pursuit of low-ranking militants  —  The Israeli military's bombing campaign in Gaza used … ",
    "url": "https://www.theguardian.com/world/2024/apr/03/israel-gaza-ai-database-hamas-airstrikes"
  },
  {
    "text": "Judge Orders Timely Housing for Migrant Children Waiting at Border  —  The decision established that minors at open-air sites were in legal custody of the Department of Homeland Security and thus must receive safe shelter, even if they had not yet been formally processed.",
    "url": "https://www.nytimes.com/2024/04/04/health/migrant-children-border-housing.html"
  },
  {
    "text": "Elon Musk's viral lie about the 2024 election uses bogus data  —  In October 2022, Elon Musk completed his purchase of Twitter.  He then dramatically changed the algorithm to boost his own tweets.  The new algorithm, according to a February 2023 report by Platformer, “artificially boosted Musk's tweets … ",
    "url": "https://popular.info/p/elon-musks-viral-lie-about-the-2024"
  },
  {
    "text": "Trump Spoke Recently With Saudi Leader  —  It is not clear what the former president discussed with Prince Mohammed bin Salman, but news of their call came amid Biden administration negotiations with the Saudis over a Middle East peace plan.  —  Former President Donald J. Trump spoke recently … ",
    "url": "https://www.nytimes.com/2024/04/03/us/politics/trump-spoke-recently-with-saudi-leader.html"
  },
  {
    "text": "John Eastman Asks for Delay in Disbarment Citing Hefty Legal Fees  —  BILLS TO PAY  —  The former Trump lawyer says he could be facing a total outlay of $3 million.  —  Former Donald Trump lawyer John Eastman is asking a judge to pause his disbarment so he can continue to work and earn income … ",
    "url": "https://www.thedailybeast.com/john-eastman-asks-for-delay-in-disbarment-citing-hefty-legal-fees"
  },
  {
    "text": "Has televising Congress dumbed it down?  —  During the 1970s, the U.S. House debated whether to televise its floor proceedings and, if so, how best to do it.  Should there be a network pool of cameras, or should they use an House-owned and operated system?  With the strong guidance of Speaker Thomas … ",
    "url": "https://thehill.com/opinion/congress-blog/4573756-has-televising-congress-dumbed-it-down/"
  },
  {
    "text": "As Elections Loom, Congressional Maps Challenged as Discriminatory Will Remain in Place  —  With control of the House of Representatives hanging in the balance, the time-consuming appeals process means elections in multiple districts will take place using maps that have been challenged as discriminatory to voters of color.",
    "url": "https://www.propublica.org/article/elections-district-maps-deemed-discriminatory-south-carolina-florida"
  },
  {
    "text": "Rejected and ‘returned for correction’: Docs for Trump's $175M bond get bounced  —  A review of the New York County Supreme Court docket on Wednesday shows that paperwork for former President Donald Trump's newly-secured bond of $175 million was temporarily rejected and “returned for correction.”",
    "url": "https://lawandcrime.com/high-profile/rejected-and-returned-for-correction-docs-for-trumps-175m-bond-get-bounced/"
  },
  {
    "text": "New Bill Clinton memoir coming after November election … - “I knew as I entered this new chapter of my life that I'd keep score the way I always have,” Clinton says in the announcement.  — “Are people better off when you quit than when you started?",
    "url": "https://www.axios.com/2024/04/04/bill-clinton-book-citizen-november-2024-release"
  },
  {
    "text": "Biden extends some immigrant work permits, potentially saving thousands of jobs  —  The Biden administration on Thursday is announcing an extension of work permits for certain categories of immigrants, potentially preventing hundreds of thousands of people from losing their jobs overnight.",
    "url": "https://thehill.com/latino/4573404-biden-immigrant-work-permits/"
  },
  {
    "text": "Top Israeli official Ron Dermer began yelling during a meeting with U.S. officials about Gaza, officials say  —  The meeting grew tense after the Americans questioned an Israeli plan to evacuate more than 1 million Palestinian civilians from Rafah and house them in tents.",
    "url": "https://www.nbcnews.com/politics/national-security/top-israeli-official-ron-dermer-yelling-meeting-us-officials-gaza-rcna146293"
  },
  {
    "text": "Man who used megaphone to lead attack on police during Capitol riot gets more than 7 years in prison  —  A Washington state man who used a megaphone to orchestrate a mob's attack on police officers guarding the U.S. Capitol was sentenced on Wednesday to more than seven years in prison.",
    "url": "https://apnews.com/article/taylor-johnatakis-capitol-riot-sentencing-f97acd68b8860d36b212e408ac80abd4"
  },
  {
    "text": "Minority Contracting Comes to Medicine  —  When public hospitals purchase medical equipment or rely on outside doctors, they typically consider the price and quality of each vendor.  —  In Tarrant County, Texas, they consider something else, too: the race and gender of the vendor's owners.",
    "url": "https://freebeacon.com/policy/minority-contracting-comes-to-medicine/"
  },
  {
    "text": "How Steve Bannon guided the MAGA movement's rebound from Jan. 6  —  A shroud of black mesh fence closed around the bright marble colonnades of the U.S. Capitol campus.  The twelve‐foot barrier, topped with razor wire and guarded by troops in combat fatigues with flak vests and long rifles … ",
    "url": "https://www.washingtonpost.com/politics/2024/04/04/steve-bannon-maga-january-6/"
  }
]