[
  {
    "text": "Woman testified to House Ethics Committee that Gaetz had sex with her when she was 17: Sources  —  Trump tapped Florida Rep. Matt Gaetz to be the new attorney general.  —  Rep. Matt Gaetz speaks during the Conservative Political Action Conference in Oxon Hill, Md., Feb. 23, 2024.",
    "url": "https://abcnews.go.com/US/woman-testified-house-ethics-committee-gaetz-sex-17/story?id=115867555"
  },
  {
    "text": "Senators want details of Matt Gaetz ethics probe before his confirmation vote for attorney general  —  Sen. John Cornyn, R-Texas, says he's open to subpoenaing the House Ethics Committee for information about Trump's pick.  Others say the confirmation process will bring things to light.",
    "url": "https://www.nbcnews.com/politics/congress/senators-want-details-matt-gaetz-ethics-probe-vote-attorney-general-rcna180164"
  },
  {
    "text": "Gaetz Begins Lobbying Lawmakers, Hoping He Hasn't Burned All the Bridges  —  MATT GAETZ EARNED A REPUTATION IN CONGRESS as an acid-tongued, anti-establishment knife fighter who didn't come to Washington to make friends.  —  But now Gaetz wants to become the next attorney general of the United States.",
    "url": "https://www.thebulwark.com/p/gaetz-begins-lobbying-lawmakers-hoping"
  },
  {
    "text": "How Trump Picked Gaetz  —  President-elect Donald J. Trump appeared to have gained some clarity on what he wanted in an attorney general while he was in Washington, the city he left in 2020 after weeks of his election lies.  —  President-elect Donald J. Trump still hadn't settled on his pick … ",
    "url": "https://www.nytimes.com/2024/11/14/us/politics/trump-gaetz-decision-plane.html"
  },
  {
    "text": "Trump to select Robert F. Kennedy Jr. to lead HHS  —  The choice will roil many public health experts after his years of touting debunked claims that vaccines cause autism.  —  President-elect Donald Trump will nominate former presidential candidate and anti-vaccine activist Robert F. Kennedy Jr … ",
    "url": "https://www.politico.com/news/2024/11/14/robert-f-kennedy-jr-trump-hhs-secretary-pick-00188617"
  },
  {
    "text": "Gov. Jared Polis cheers RFK Jr.'s nomination for health post despite anti-vaccine statements  —  Colorado Gov. Jared Polis on Thursday cheered anti-vaccine advocate Robert F. Kennedy Jr.'s nomination to lead the nation's top public health agency, highlighting the controversial nominee's stances on “big pharma” and “corporate ag.”",
    "url": "https://www.denverpost.com/2024/11/14/jared-polis-rfk-jr-trump-hhs-endorsement-tweet/"
  },
  {
    "text": "The Sanewashing of RFK Jr.  —  Let's call a crank a crank.  —  Is Robert F. Kennedy Jr., Donald Trump's improbable nominee for secretary of Health and Human Services, actually such a crank?  Short answer: yes.  But two opinion pieces published in just the past few days argue that although Kennedy … ",
    "url": "https://www.theatlantic.com/health/archive/2024/11/rfk-jr-hhs-sanewashing/680663/?gift=hVZeG3M9DnxL4CekrWGK3-z8QcWNs4NTh20aH6uhb2U&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Trump picks Robert F. Kennedy Jr. to be his Department of Health and Human Services secretary  —  West Palm Beach, Florida CNN  —  President-elect Donald Trump has picked Robert F. Kennedy Jr. to be his next secretary of the Department of Health and Human Services … ",
    "url": "https://www.cnn.com/2024/11/14/politics/robert-f-kennedy-donald-trump-hhs/"
  },
  {
    "text": "Trump picks RFK Jr. to oversee the Department of Health and Human Services  —  President-elect Donald Trump has tapped Robert F. Kennedy Jr. — a former independent presidential candidate who has a history of spreading conspiracy theories, including about vaccines — to oversee the Department of Health and Human Services.",
    "url": "https://www.npr.org/2024/11/14/nx-s1-5188411/robert-kennedy-trump-administration-health"
  },
  {
    "text": "Scoop: Manchin signals willingness to back Biden's final push on judges … - Manchin told Axios that “we're in different times right now” when asked about his previous pledge, adding that “my Republican friends are under the microscope.” … - Manchin's vote is critical … ",
    "url": "https://www.axios.com/2024/11/14/manchin-judges-biden-senate"
  },
  {
    "text": "Trump's Defense Secretary Pick Pete Hegseth Said to Face Previous Sexual Misconduct Allegation  —  Sources say Donald Trump's transition team leadership met with the former Fox News host, who is a left-field pick to head the Department of Defense, about the claims on Thursday.",
    "url": "https://www.vanityfair.com/news/story/pete-hegseth-misconduct-allegation-meeting"
  },
  {
    "text": "Trump's intelligence chief pick Tulsi Gabbard is 'Russia's girlfriend'  —  Ukraine accused the president-elect's choice for cabinet of being on the Kremlin's payroll  —  Donald Trump's pick for US national intelligence chief was accused by Ukraine of being on the Kremlin's payroll after the start of Russia's invasion.",
    "url": "https://www.thetimes.com/world/russia-ukraine-war/article/tulsi-gabbard-trump-russia-connection-cabinet-national-intelligence-d3ttgsjfq"
  },
  {
    "text": "Elon Musk Met With Iran's U.N. Ambassador, Iranian Officials Say  —  The tech billionaire, a top adviser to President-elect Donald J. Trump, was reported to have discussed ways to defuse tensions between Iran and the United States.  —  Elon Musk, a close adviser to President-elect Donald J. Trump … ",
    "url": "https://www.nytimes.com/2024/11/14/world/middleeast/elon-musk-iran-trump.html?unlocked_article_code=1.Z04.HPHF.ruu6mJ2mPOQz&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Trump picks North Dakota governor to lead Interior  —  The move puts Trump's one-time primary rival in charge of the department.  —  President-elect Donald Trump plans to nominate Doug Burgum, a one-time rival for the Republican presidential nomination, to run the Interior Department, Trump said.",
    "url": "https://www.politico.com/news/2024/11/14/doug-burgum-interior-secretary-trump-00188590"
  },
  {
    "text": "Steve Bannon Threatens Ari Melber, Says Matt Gaetz's DOJ Is Coming For Him And ‘All The Producers of MSNBC’  —  Former Trump White House advisor Steve Bannon told MSNBC's Ari Melber and “all you hosts” and producers at the network that they had better “lawyer up” because Matt Gaetz's Justice Department would soon be coming for them.",
    "url": "https://www.mediaite.com/news/steve-bannon-threatens-ari-melber-says-matt-gaetzs-doj-is-coming-for-him-and-all-the-producers-of-msnbc/"
  },
  {
    "text": "Trump Threatens New York Times, Penguin Random House over Critical Coverage  —  Legal letter follows complaints aimed at CBS News, the Washington Post, and the Daily Beast.  —  The letter, addressed to lawyers at the New York Times and Penguin Random House, arrived a week before the election.",
    "url": "https://www.cjr.org/the_trump_reader/trump-threatens-new-york-times-penguin-random-house-critical-coverage.php"
  },
  {
    "text": "Go bags, passports, foreign assets: Preparing to be a target of Trump's revenge  —  Some prominent critics of Donald Trump, and those he has vilified as “deep state” saboteurs, are taking seriously his vow of retribution.  —  A retired U.S. Army officer who clashed with senior officials … ",
    "url": "https://www.washingtonpost.com/politics/2024/11/14/trump-critics-enemies-presidency-preparations/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzMxNTYwNDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzMyOTQyNzk5LCJpYXQiOjE3MzE1NjA0MDAsImp0aSI6IjgzM2QwN2M2LThjMTUtNDQyYy1iMjA0LTlhYWUwY2QyODE1ZCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzExLzE0L3RydW1wLWNyaXRpY3MtZW5lbWllcy1wcmVzaWRlbmN5LXByZXBhcmF0aW9ucy8ifQ.0jWIHqXUIyjYo1-tjnFuyKzoYIs8SRps5G04jpX1-0Q&itid=gfta"
  },
  {
    "text": "Tim Scott's New NRSC Hire Is Ruffling Feathers Even Before It's Official  —  Sources told NOTUS that Scott is tapping Mike Pence's former campaign manager to be executive director of the Senate GOP's campaign arm.  —  Reese Gorman and  Alex Roarty  — Copy",
    "url": "https://www.notus.org/2026-election/tim-scott-new-nrsc-hire-ruffling-feathers-stephen-demaura"
  },
  {
    "text": "Exclusive: Trump's transition team aims to kill Biden EV tax credit  —  President-elect Donald Trump's transition team is planning to kill the $7,500 consumer tax credit for electric-vehicle purchases as part of broader tax-reform legislation, two sources with direct knowledge of the matter told Reuters.",
    "url": "https://www.reuters.com/business/autos-transportation/trumps-transition-team-aims-kill-biden-ev-tax-credit-2024-11-14/"
  },
  {
    "text": "Should the Democratic Party be listening to John Fetterman?  —  The Pennsylvania senator on the ‘bros’ vote, where he thinks he can work with Trump and the problem with Democrats calling Trump a fascist.  —  John Fetterman often has an uncanny sense of which presidential candidate is going to win Pennsylvania.",
    "url": "https://www.politico.com/news/2024/11/14/john-fetterman-democratic-party-trump-00189595"
  }
]