[
  {
    "text": "World Central Kitchen Says U.S. Citizen Among 7 Staff Killed in ‘Targeted’ Triple Israeli Attack  —  ‘UNFORGIVABLE’  —  José Andrés' international aid organization said it would pause its work in Gaza in the wake of the killings.  —  A dual U.S.-Canadian citizen … ",
    "url": "https://www.thedailybeast.com/world-central-kitchen-says-us-citizen-among-7-staff-killed-in-targeted-triple-israeli-attack"
  },
  {
    "text": "House Republicans push to rename DC international airport after Trump  —  ‘In my lifetime, our nation has never been greater than under the leadership of President Donald J Trump’: Reschenthaler  —  FIRST ON FOX: A group of House Republicans is pushing to rename Washington, D.C.'s … ",
    "url": "https://www.foxnews.com/politics/house-republicans-push-rename-dc-international-airport-trump"
  },
  {
    "text": "Gag Order Against Trump Is Expanded to Bar Attacks on Judge's Family  —  Donald Trump had in recent days targeted the daughter of Juan Merchan, the judge overseeing his criminal trial in Manhattan, in blistering social media posts.  —  The New York judge overseeing Donald J. Trump's upcoming … ",
    "url": "https://www.nytimes.com/2024/04/01/nyregion/trump-gag-order-juan-merchan.html"
  },
  {
    "text": "The Republican party has become a full-fledged anti-sex movement  —  The conservative obsession with purity and control is being achieved by increasingly punitive means  —  The US supreme court justices Samuel Alito and Clarence Thomas cited the Comstock Act, named after the 19th-century … ",
    "url": "https://www.theguardian.com/commentisfree/2024/apr/02/the-republican-party-has-become-a-full-fledged-anti-sex-movement"
  },
  {
    "text": "Iran vows response after strike it blames on Israel demolishes consulate in Syria  —  Iran and one of its key proxies vowed Tuesday to respond to a strike widely attributed to Israel that demolished Iran's consulate in the Syrian capital of Damascus and killed eight people, including two Iranian generals.",
    "url": "https://apnews.com/article/iran-syria-israel-hezbollah-gaza-damascus-f7a1af3a9fc67de1962d4f1589d7e9f0"
  },
  {
    "text": "RFK Jr. rebuked for calling Biden bigger threat to democracy than Trump  —  Independent presidential candidate Robert F. Kennedy Jr. repeatedly advanced an argument Monday that President Biden poses a greater threat to democracy than Donald Trump, a comment that drew swift rebukes from several historians and experts.",
    "url": "https://www.washingtonpost.com/elections/2024/04/02/rfk-jr-biden-trump-democracy/"
  },
  {
    "text": "Trump Media auditor warns that losses ‘raise substantial doubt’ about company's ability to continue  —  The Truth Social parent, which trades under the stock ticker DJT, said it lost more than $58 million last year.  —  An auditor has raised doubts about the ability of Donald Trump's publicly traded company … ",
    "url": "https://www.nbcnews.com/business/business-news/trump-media-auditor-warns-losses-raise-doubt-company-rcna145831"
  },
  {
    "text": "Trump secures $175 million bond in New York civil fraud case  —  An appeals court last week reduced the amount of bond he was required to post.  —  Former President Donald Trump speaks at a campaign rally in Rome, GA, March 9, 2024.  —  Former President Donald Trump and his co-defendants … ",
    "url": "https://abcnews.go.com/US/trump-secures-175-million-bond-new-york-civil/story?id=108715465"
  },
  {
    "text": "Manufacturing discontent  —  How Dems can fight back against Republican resentment politics. … It's become something of a cottage industry to explore how white rural animus gives much-needed support to Republican candidates in local, state, and national elections.",
    "url": "https://www.publicnotice.co/p/white-maga-rural-rage-how-to-counter-it"
  },
  {
    "text": "Florida Supreme Court upholds state's 15-week abortion ban, but voters will soon have a say  —  The Florida Supreme Court on Monday cleared the way for the state to ban abortions after six weeks of pregnancy, before many women know they are pregnant, while also giving voters a chance to remove restrictions in November.",
    "url": "https://apnews.com/article/florida-abortion-ban-supreme-court-ruling-6a4949fc7459afe9b5e298086a793126"
  },
  {
    "text": "The Russian Army Just Launched The Biggest Tank Assault Of The War  —  Forty-eight tanks and fighting vehicles attacked along a single road west of Avdiivka—and got massacred  —  On Saturday, the Russian army launched what may have been one of the largest-scale tank assaults of Russia's 25-month wider war on Ukraine.",
    "url": "https://www.forbes.com/sites/davidaxe/2024/03/31/the-russian-army-just-launched-the-biggest-tank-assault-of-the-war/"
  },
  {
    "text": "Arizona abortion rights amendment backers says they've gathered signatures needed for 2024 ballot  —  First to NBC News: Arizona for Abortion Access says it's exceeded the state petition signature threshold by over 120,000, with plans to keep gathering until a July 3 deadline.",
    "url": "https://www.nbcnews.com/politics/2024-election/arizona-abortion-rights-amendment-backers-says-gathered-signatures-nee-rcna145922"
  },
  {
    "text": "Corporate profit bonanza  —  In the last three months of 2023, after-tax corporate profits reached an all-time high of $2.8 trillion.  This is part of a long-term growth in corporate profits that began in the 1980s, picked up steam at the turn of the millennium, and exploded since 2020.",
    "url": "https://popular.info/p/corporate-profit-bonanza"
  },
  {
    "text": "Video shows California police fatally shooting teenager who was reported kidnapped  —  Revealed: Savannah Graziano, 15, shot by sheriff's deputies in 2022 while unarmed and following instructions to move toward them  —  Newly released law enforcement footage captures the moment California police fatally shot … ",
    "url": "https://www.theguardian.com/us-news/2024/apr/01/california-police-video-shooting-15-year-old-girl-savannah-graziano"
  },
  {
    "text": "Pair of Warner Bros. Discovery board members resign amid DOJ antitrust probe  —  Two members of Warner Bros. Discovery's (WBD) board have resigned amid an investigation from the Department of Justice into whether their presence on the body violated antitrust law.",
    "url": "https://thehill.com/homenews/media/4569503-warnerbros-discovery-doj-antitrust-probe/"
  },
  {
    "text": "Fake right-wing panic about “trans” Easter is part of Trump's push for Christian nationalism  —  Phony claims that Democrats “mock your faith” are a cynical excuse to strip Americans of religious freedom  —  Most Americans spent Easter weekend with traditional activities like church or egg hunts … ",
    "url": "https://www.salon.com/2024/04/02/fake-right-wing-panic-about-trans-easter-is-part-of-push-for-christian-nationalism/"
  },
  {
    "text": "A federal judge says migrants can sue the company that flew them to Martha's Vineyard  —  MIAMI — A federal judge in Boston has ruled that migrants flown from Texas to Martha's Vineyard in 2022 can proceed with a lawsuit against the Florida company that took them there.",
    "url": "https://www.npr.org/2024/04/01/1242131130/migrants-lawsuit-flown-marthas-vineyard-texas-florida-governor-ron-desantis"
  }
]