[
  {
    "text": "Trump Says He Might Have to Sell Properties to Pay $454 Million Penalty  —  The ex-president, who is appealing the penalty in his civil fraud case, offered a bond of only $100 million to pause the judgment.  —  Donald J. Trump offered a New York appeals court on Wednesday a bond … ",
    "url": "https://www.nytimes.com/2024/02/28/nyregion/trump-bond-civil-fraud.html"
  },
  {
    "text": "Trump must come up with the full bond amount to cover the $454 million civil fraud trial judgment, appeals court judge rules  —  Former President Donald Trump must come up with the full bond amount to cover the $454 million verdict in the civil fraud trial, an appeals court judge ruled Wednesday.",
    "url": "https://www.cnn.com/2024/02/28/politics/donald-trump-appeals-court-new-york/"
  },
  {
    "text": "Supreme Court to decide Trump's immunity claim in election interference case  —  Even if the justices ultimately rule against Trump, the court's intervention adds a further delay, meaning his trial will not start for weeks, if not months.  —  WASHINGTON — The Supreme Court on Wednesday agreed … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-decide-trumps-immunity-claim-election-interference-case-rcna139026"
  },
  {
    "text": "Trump Wants a Break on $464 Million Judgment.  The AG Says Trump Is Sneaking Assets to Florida.  —  Donald Trump was ordered to pay $464 million for bank fraud, but he only wants to front $100 million.  Now the AG says investigators have caught him moving his business assets.",
    "url": "https://www.thedailybeast.com/trump-wants-a-break-on-dollar464-million-judgment-the-ag-says-trump-is-sneaking-assets-to-florida"
  },
  {
    "text": "Supreme Court Agrees to Hear Trump's Immunity Claim, Setting Arguments for April  —  The former president's trial on charges of plotting to subvert the 2020 election will remain on hold while the justices consider the matter.  —  The Supreme Court on Wednesday agreed to decide whether former … ",
    "url": "https://www.nytimes.com/2024/02/28/us/supreme-court-trump-immunity-trial.html"
  },
  {
    "text": "New York appeals judge denies Trump bid to pay $100m of $454m judgment  —  Ex-president's lawyers had asked court to halt collection of rest of amount plus ban on securing new loans from New York banks  —  A New York appeals judge has denied Donald Trump's request to pay just $100m of the $454m judgment for his New York fraud trial.",
    "url": "https://www.theguardian.com/us-news/2024/feb/28/trump-appeal-bond-fraud-case"
  },
  {
    "text": "Judge declines to pause Trump's $454 million fraud penalty, but halts some sanctions  —  A New York appellate judge on Wednesday refused to halt collection of Donald Trump's $454 million civil fraud penalty while he appeals, rejecting the former president's request that he be allowed to post … ",
    "url": "https://www.cbsnews.com/news/trump-fraud-appeal-bond-new-york/"
  },
  {
    "text": "Court denies Trump's bid to freeze $464M judgment, after his lawyers say he'd have to sell properties to pay  —  The former president had sought to post a fraction of the bond amount.  —  Republican presidential candidate and former President Donald Trump speaks during a campaign event … ",
    "url": "https://abcnews.go.com/US/trump-plans-post-100-million-bond-asks-stay/story?id=107634579"
  },
  {
    "text": "NY AG: Trump Doesn't Have the Cash to Stay Judgment Pending Appeal  —  The House of Cards is getting exposed.  —  Just like in the Wizard of Oz, we are getting a look behind the curtain on Donald Trump's business empire and learning that it isn't what he portrays.",
    "url": "https://www.meidastouch.com/news/ny-ag-trump-doesnt-have-the-cash-to-stay-judgment-pending-appeal"
  },
  {
    "text": "Mitch McConnell to step down from Republican Senate leadership  —  Mitch McConnell's legacy as the longest-serving leader of Senate Republicans  —  Mitch McConnell, the longest-serving Senate leader in history who maintained his power in the face of dramatic convulsions in the Republican Party … ",
    "url": "https://apnews.com/article/mitch-mcconnell-senate-republican-leader-stepping-down-ba478d570a4561aa7baf91a204d7e366"
  },
  {
    "text": "Biden ‘fit for duty,’ doctor writes after latest physical exam  —  President Biden is “fit for duty” and does not have any new health concerns, his doctor wrote after a physical exam conducted Wednesday that was closely watched amid voter concerns about Biden's age while seeking reelection.",
    "url": "https://thehill.com/regulation/court-battles/4495504-biden-fit-for-duty-doctor-writes-after-latest-physical-exam/"
  },
  {
    "text": "Lauren Boebert's son was arrested over a spate of thefts as his mom tries to convince voters to look past her chaotic family life  — Lauren Boebert's son Tyler Boebert was arrested on Tuesday afternoon.  — He's facing 22 charges in connection with a series of crimes in Rifle, Colorado.",
    "url": "https://www.businessinsider.com/lauren-boebert-son-tyler-arrested-family-drama-2024-republican-campaign-2024-2"
  },
  {
    "text": "CDC advisory panel says people 65 and older should get a Covid spring booster shot  —  An expert panel advising the Centers for Disease Control and Prevention on vaccines on Wednesday recommended that people 65 and older should get an additional Covid-19 vaccine shot this spring.",
    "url": "https://www.statnews.com/2024/02/28/covid-spring-booster-recommendation/"
  },
  {
    "text": "How Panera Bread ducked California's new $20 minimum wage law  —  Billionaire Greg Flynn, who made his fortune running one of the world's largest restaurant franchise operations, is getting a new boost from sourdough loaves and brioche buns.  —  That's because a California law that's … ",
    "url": "https://www.mercurynews.com/2024/02/28/how-panera-bread-ducked-californias-new-20-minimum-wage-law/"
  },
  {
    "text": "SCOTUS Justice Jackson Just Said the Dumbest Thing About Guns and I Can't Stop Laughing  —  Supreme Court Justice Ketanji Brown Jackson must have fallen asleep last night watching a vintage '80s Chuck Norris movie as part of her preparation to hear oral arguments today in the Garland v. Cargill … ",
    "url": "https://pjmedia.com/vodkapundit/2024/02/28/scotus-justice-jackson-just-said-the-dumbest-thing-about-guns-and-i-cant-stop-laughing-n4926851"
  },
  {
    "text": "Supreme Court Appears Split Over Ban on Bump Stocks Enacted Under Trump  —  In a wide-ranging argument, the justices wrestled with the mechanics of gun triggers and the larger implications of the ban both for bump stock owners and the public.  —  The Supreme Court wrestled on Wednesday … ",
    "url": "https://www.nytimes.com/2024/02/28/us/politics/bump-stock-ban-supreme-court-trump.html"
  },
  {
    "text": "Smoking cannabis linked to increased risk of heart attack, stroke  —  Smoking cannabis is associated with an increased risk of a heart attack or stroke, according to a new study.  —  The study, published Wednesday in the Journal of the American Heart Association, found daily use of cannabis … ",
    "url": "https://thehill.com/policy/healthcare/4495227-smoking-cannabis-link-heart-attack-stroke/"
  },
  {
    "text": "Republicans block bill to protect access to IVF  —  Senate Republicans blocked an effort Wednesday to pass legislation that would federally protect access to in vitro fertilization (IVF).  —  Sen. Tammy Duckworth (D-Ill.) sought to pass the bill by unanimous consent, which meant … ",
    "url": "https://thehill.com/policy/healthcare/4494243-republicans-block-bill-to-protect-access-to-ivf/"
  },
  {
    "text": "Witness calls out Sen. Kennedy in abortion hearing: ‘Nothing but fearmongering’  —  Sen. John Kennedy (R-La.) gave a graphic description of an abortion procedure during a Senate hearing Wednesday, leading one witness to say his statements did not reflect her experience and were “nothing but fearmongering.”",
    "url": "https://thehill.com/policy/healthcare/4495250-witness-john-kennedy-abortion-hearing/"
  },
  {
    "text": "Exxon CEO blames public for failure to fix climate change  —  The world isn't on track to meet its climate goals — and it's the public's fault, a leading oil company CEO told journalists.  —  Exxon CEO Darren Woods told editors from Fortune that the world has “waited too long” … ",
    "url": "https://thehill.com/policy/energy-environment/4494543-exxon-ceo-blames-public-for-failure-to-fix-climate-change/"
  },
  {
    "text": "GOP Rep. Maria Salazar Takes Credit For Children's Hospital Funding She Opposed  —  “I am thrilled to have secured over $1.4 million to provide cutting-edge medicine to children,” said the Florida congresswoman, who voted against this money.  —  LOADING  —  Rep. Maria Salazar (R-Fla.) … ",
    "url": "https://www.huffpost.com/entry/maria-salazar-childrens-hospital-funding_n_65df4e9ce4b005b858327234"
  },
  {
    "text": "Pluralistic: When private equity destroys your hospital (28 Feb 2024)  — When private equity destroys your hospital: Looters literally want to kill you.  — Hey look at this: Delights to delectate.  — This day in history: 2009, 2014, 2019, 2022  — Colophon: Recent publications … ",
    "url": "https://pluralistic.net/2024/02/28/5000-bats/"
  },
  {
    "text": "Democrats Pass a N.Y. House Map That Modestly Benefits Them  —  Democrats in New York adopted a new congressional map on Wednesday, using their supermajorities in the State Legislature to draw district lines that would improve their chances of winning the House majority in November, but not drastically.",
    "url": "https://www.nytimes.com/2024/02/28/nyregion/redistricting-ny-house-democrats.html"
  }
]