[
  {
    "text": "Here's What My Gut Says About the Election, but Don't Trust Anyone's Gut, Even Mine  —  In an election where the seven battleground states are all polling within a percentage point or two, 50-50 is the only responsible forecast.  Since the debate between Kamala Harris and Donald Trump … ",
    "url": "https://www.nytimes.com/2024/10/23/opinion/election-polls-results-trump-harris.html?unlocked_article_code=1.UU4.M0l1.AcCc5_9jpjz2&smid=url-share"
  },
  {
    "text": "Three Reasons I'm Certain Kamala Harris Will Win  —  There is a palpable anxiety wailing on the winds of American life right now.  More than in any other election in my lifetime, I've been consistently asked by people of all stripes and creeds: “Can Kamala Harris win this thing?  Are we going to be OK?”",
    "url": "https://www.nytimes.com/2024/10/23/opinion/kamala-harris-win-election.html?unlocked_article_code=1.UU4.Dppr.wIh0xy1BzQfE&smid=nytcore-ios-share&referringSource=articleShare&tgrp=cpy"
  },
  {
    "text": "The Sad, Pathetic Spectacle of John Kelly's Critics  —  WHEN GEN. JOHN KELLY WENT PUBLIC about Trump's praise for Hitler and his fears about a dictatorial second Trump term, he joined a growing list of former Trump officials ringing the alarm.  —  He also sparked what has become a pathetic … ",
    "url": "https://www.thebulwark.com/p/the-sad-pathetic-spectacle-of-john"
  },
  {
    "text": "Fox Host Says Maybe Trump Didn't Realize Hitler's Generals Were Nazis  —  Trump's former chief of staff said on Tuesday that the former president said he needed “the kind of generals that Hitler had” … On Tuesday, Kelly told The New  York Times that the former president meets the established definition of fascism.",
    "url": "https://www.rollingstone.com/politics/politics-news/fox-host-maybe-trump-hitler-generals-nazis-1235140921/"
  },
  {
    "text": "Justice Department warns Elon Musk that his $1 million giveaway to registered voters may be illegal  —  The Justice Department warned Elon Musk's America PAC in recent days that his $1 million sweepstakes to registered voters in swing states may violate federal law, people briefed on the matter told CNN.",
    "url": "https://www.cnn.com/2024/10/23/politics/elon-musk-justice-department-letter/"
  },
  {
    "text": "Justice Department Warns Musk That His $1 Million Giveaway Might Be Illegal  —  Elon Musk's super PAC, which supports Donald Trump's presidential bid, is giving cash prizes to registered voters who sign a petition.  —  The Justice Department sent a letter to the super PAC founded by Elon Musk … ",
    "url": "https://www.nytimes.com/2024/10/23/us/politics/elon-musk-department-of-justice-giveaway.html"
  },
  {
    "text": "Justice Department warns Musk's PAC that $1M voter giveaway could be illegal  —  Pressure has mounted on prosecutors in recent days to scrutinize the lottery-style stunt.  —  The Justice Department has sent a letter to tech billionaire Elon Musk's super PAC, America PAC … ",
    "url": "https://www.nbcnews.com/tech/tech-news/doj-warns-musk-1m-petition-giveaway-illegal-rcna176911"
  },
  {
    "text": "Harris to deliver closing argument speech Tuesday on the National Mall  —  The vice president is slated to present her final case to the American people in D.C. exactly one week before Election Day.  —  Vice President Kamala Harris is planning to deliver her closing argument Tuesday in a speech … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2024/10/23/kamala-harris-campaign-rally-dc-national-mall-election/"
  },
  {
    "text": "Claiming ‘Extreme Power’ of President, Trump Says He Will Close US Border by Fiat  —  U.S. Vice President Kamala Harris' campaign said Tuesday that her Republican opponent, former President Donald Trump, would be “unchecked” and “unhinged” in a potential second term, pointing to his comments … ",
    "url": "https://www.commondreams.org/news/trump-border"
  },
  {
    "text": "Judge's ultimatum forces deal to shelve subpoena fight in House GOP probe of Hunter Biden  —  'Don't test me on this,' Judge Ana Reyes intoned, betting her dog that the subpoenas wouldn't yield the info Republicans are seeking.  —  A highly unusual ultimatum from a frustrated judge caused … ",
    "url": "https://www.politico.com/news/2024/10/23/subpoena-fight-hunter-biden-00185119"
  },
  {
    "text": "“Not Medically Necessary”: Inside the Company Helping America's Biggest Health Insurers Deny Coverage for Care  —  Co-published with The Capitol Forum  —  Uncovered: How the Insurance Industry Denies Coverage to Patients  — Dialing for Dollars: America's largest insurers hire EviCore … ",
    "url": "https://www.propublica.org/article/evicore-health-insurance-denials-cigna-unitedhealthcare-aetna-prior-authorizations"
  },
  {
    "text": "It's Possible to Track Someone's Personal Phone to an Abortion Clinic.  And It's Legal Too.  —  A company got access to a mobile phone-tracking tool used by law enforcement and U.S. government agencies across the country.  They found significant privacy vulnerabilities.  — Copy",
    "url": "https://www.notus.org/technology/cell-phone-tracking-law-enforcement-abortion-clinic"
  },
  {
    "text": "Los Angeles Times editorials editor resigns after owner blocks presidential endorsement  —  Mariel Garza, the editorials editor of the Los Angeles Times, resigned on Wednesday after the newspaper's owner blocked the editorial board's plans to endorse Vice President Kamala Harris for president.",
    "url": "https://www.cjr.org/business_of_news/los-angeles-times-editorials-editor-resigns-after-owner-blocks-presidential-endorsement.php"
  },
  {
    "text": "U.S. Study on Puberty Blockers Goes Unpublished Because of Politics, Doctor Says  —  The leader of the long-running study said that the drugs did not improve mental health in children with gender distress and that the finding might be weaponized by opponents of the care.",
    "url": "https://www.nytimes.com/2024/10/23/science/puberty-blockers-olson-kennedy.html?unlocked_article_code=1.UU4.1SEh.eaaVvaj1FXOT&smid=url-share"
  },
  {
    "text": "FBI finds hundreds of weapons at home of suspected shooter of Arizona Democratic Party office  —  Lauren De Young Richard RuelasArizona Republic  —  (This story was updated with new information.)  —  Federal agents on Wednesday morning hauled more than 100 firearms, including “machine guns … ",
    "url": "https://www.azcentral.com/story/news/local/tempe-breaking/2024/10/23/suspect-identified-tempe-democratic-party-office-shootings/75806849007/"
  },
  {
    "text": "Democrat raises alarm over Trump campaign's failure to enter into transition agreements  —  Rep. Jamie Raskin (D-Md.) is raising concerns about the Trump campaign's failure to enter into presidential transition agreements with the federal government, cautioning that the delay could negatively impact … ",
    "url": "https://thehill.com/homenews/house/4949533-raskin-trump-transition-agreement/"
  },
  {
    "text": "Donald Trump campaign manager shared posts in 2021 saying Trump's lies caused the violence on January 6  —  In the immediate aftermath of the January 6, 2021, attack on the US Capitol, a number of conservatives and Republicans broke ranks with then-President Donald Trump and blamed him for the violence that day.",
    "url": "https://www.cnn.com/2024/10/23/politics/trump-campaign-manager-january-6/"
  },
  {
    "text": "Her billionaire marriage broke up.  Her VP campaign fizzled.  Now she's a Trump-world star.  —  With a massive divorce settlement from Google co-founder Sergey Brin, Nicole Shanahan is remaking herself as a pro-Trump wellness guru — raising alarm in Silicon Valley.",
    "url": "https://www.washingtonpost.com/technology/2024/10/23/nicole-shanahan-maga-make-america-healthy-trump-rfk-jr/"
  },
  {
    "text": "Georgia election official says battleground state fended off cyberattack likely from a foreign country  —  Georgia's secretary of state's office this month fended off a cyberattack believed to have come from a foreign country against the website voters use to request absentee ballots, the office told CNN.",
    "url": "https://www.cnn.com/2024/10/23/politics/georgia-election-official-cyber-attack/"
  }
]