[
  {
    "text": "Ghislaine Maxwell received limited immunity during meetings with deputy attorney general: Sources  —  “She didn't hold anything back,” Maxwell's attorney said earlier.  —  Attorney General Pam Bondi and Deputy Attorney General Todd Blanche look on as US President Donald Trump (not on frame) … ",
    "url": "https://abcnews.go.com/US/deputy-ag-blanche-set-meet-2nd-day-ghislaine/story?id=124064062"
  },
  {
    "text": "After Ghislaine Maxwell Interview, Concerns Mount Over Possibility of Pardon  —  President Trump, asked whether he would consider pardoning her, said, “I'm allowed to do it, but it's something I haven't thought about.”  —  The yellowjacket buzz of a plane circling above the federal courthouse … ",
    "url": "https://www.nytimes.com/2025/07/25/us/politics/ghislaine-maxwell-trump-pardon.html"
  },
  {
    "text": "Gabbard and White House ‘lying’ about intel on Russian interference in 2016, ex-CIA official says  —  “We definitely had the intel,” Susan Miller, who helped oversee the 2017 intelligence assessment of Russia's efforts in the 2016 election, told NBC News.  —  The former senior CIA officer … ",
    "url": "https://www.nbcnews.com/politics/national-security/gabbard-white-house-lying-intel-russian-interference-2016-ex-cia-offic-rcna220870"
  },
  {
    "text": "Trump's distraction methods fall flat against Epstein uproar  —  President Donald Trump's super powers as a public figure have long included the ability to redirect, evade and deny.  —  But the Republican's well-worn methods of changing the subject when a tough topic stings politically … ",
    "url": "https://www.reuters.com/world/us/trumps-distraction-methods-fall-flat-against-epstein-uproar-2025-07-26/"
  },
  {
    "text": "Academic with history of incendiary remarks to lead US Institute of Peace … “We look forward to seeing him advance President Trump's America First agenda in this new role,” the statement said.  —  USIP has been in turmoil in recent months as the administration and its Department … ",
    "url": "https://www.politico.com/news/2025/07/25/darren-beattie-institute-of-peace-00478133"
  },
  {
    "text": "Fired Speechwriter From First Trump Term Appointed to Lead the Institute of Peace  —  In 2018, the White House fired Darren Beattie for attending a gathering of white supremacists.  Mr. Beattie will head the institute while keeping his senior State Department position.",
    "url": "https://www.nytimes.com/2025/07/25/admin/darren-beattie-institute-of-peace.html"
  },
  {
    "text": "Venezuelan Little League team denied entry into US amid Trump travel ban … The tournament, which starts Saturday, features 13- to 16-year-old baseball players from the U.S. and around the world competing in Easley, South Carolina.  —  Little League International called the news … ",
    "url": "https://www.politico.com/news/2025/07/25/trump-travel-ban-little-league-00477894"
  },
  {
    "text": "Venezuelan Little League team denied travel visas to U.S. for World Series  —  The Cacique Mara team from Maracaibo won the Latin American championship last month and had been set to travel to South Carolina for its next round of games.  —  A Little League team from Venezuela was denied entry … ",
    "url": "https://www.washingtonpost.com/sports/2025/07/26/venezuela-little-league-travel-ban-visa/"
  },
  {
    "text": "Immigration agents told a teenage US citizen: 'You've got no rights.' He secretly recorded his brutal arrest  —  Video from Kenny Laynez-Ambrosio, 18, puts fresh scrutiny on the harsh tactics used to reach the Trump administration's ambitious enforcement targets",
    "url": "https://www.theguardian.com/us-news/2025/jul/25/florida-teen-immigration-arrest"
  },
  {
    "text": "July 25, 2025  —  “We're going to end up shooting some of them.”  —  At 9:00 on the morning of May 2, 2025, a Florida Highway Patrol officer pulled over a van with 18-year-old U.S. citizen Kenny Laynez-Ambrosio and two undocumented men in it.  Laynez-Ambrosio's mother was driving the men to their landscaping job.",
    "url": "https://heathercoxrichardson.substack.com/p/july-25-2025"
  },
  {
    "text": "No Proof Hamas Routinely Stole U.N. Aid, Israeli Military Officials Say  —  Israel has long restricted or completely blocked aid to Gaza on the argument that Hamas steals it to use as a weapon of control over the population.  —  For nearly two years, Israel has accused Hamas of stealing aid provided … ",
    "url": "https://www.nytimes.com/2025/07/26/world/middleeast/hamas-un-aid-theft.html?unlocked_article_code=1.ZU8.BMtS.urROP7_VFXU7&smid=url-share"
  },
  {
    "text": "RFK Jr. to Oust Advisory Panel on Cancer Screenings, HIV Prevention Drugs  —  The task force determines which preventive services insurers must cover at no cost to patients  —  Health and Human Services Secretary Robert F. Kennedy Jr. is planning to remove all the members of an advisory panel … ",
    "url": "https://www.wsj.com/health/healthcare/rfk-health-screening-panel-members-c308cbb0"
  },
  {
    "text": "Cracks widen in Japan and US's interpretation of tariff trade deal  —  Tokyo officials contest Washington's claim that American investors assured of vast share of profits from joint investment  —  The US will secure 90 per cent of profits from joint investments with Japan only if it takes … ",
    "url": "https://t.co/0oMSSetSP7"
  },
  {
    "text": "FCC to Appoint a Babysitter to Make Sure CBS Isn't Anti-Trump  —  FCC commissioner Brendan Carr says CBS will have a “bias monitor” who reports directly to the president. … The Federal Communications Commission finally approved an $8 billion merger between Paramount and Skydance on Thursday … ",
    "url": "https://gizmodo.com/fcc-to-appoint-a-babysitter-to-make-sure-cbs-isnt-anti-trump-2000634566"
  },
  {
    "text": "A Clash Over a Promotion Puts Hegseth at Odds With His Generals … Defense Secretary Pete Hegseth has fostered an environment of uncertainty and mistrust that threatens to undermine the readiness and effectiveness of the military, officials said.Haiyun Jiang/The New York Times",
    "url": "https://www.nytimes.com/2025/07/26/us/politics/hegseth-pentagon-leadership.html"
  },
  {
    "text": "Southwest Airlines jet dives as a fighter jet crosses its path near Los Angeles  —  Alarms sounded in the cockpit of a Southwest Airlines jet shortly after taking off from Hollywood Burbank airport near Los Angeles on Friday, prompting evasive maneuvers, the airline said in a statement.",
    "url": "https://cnn.com/2025/07/25/us/southwest-fighter-jet-close-call"
  },
  {
    "text": "US states to get $608 million from FEMA to build migrant detention centers  —  The Federal Emergency Management Agency is preparing to send $608 million to states to construct immigrant detention centers as part of the Trump administration's push to expand capacity to hold migrants.",
    "url": "https://www.reuters.com/legal/government/us-states-get-608-million-fema-build-migrant-detention-centers-2025-07-25/"
  },
  {
    "text": "Trump flees Washington controversies for golf-heavy trip to Scotland  —  Fleeing Washington's oppressive humidity and nonstop questions over heated controversies, President Donald Trump is once again taking weekend refuge at his golf clubs — this time more than 3,000 miles away in Scotland.",
    "url": "https://cnn.com/2025/07/26/politics/trump-scotland-golf-epstein-scandal"
  },
  {
    "text": "Wyden secures data privacy deal to shield Oregonians from out-of-state abortion, immigration surveillance  —  The agreement is with Flock safety, which provides cameras to read vehicle license plates for law enforcement use and store data afterwards. … PORTLAND, Ore. … ",
    "url": "https://www.kgw.com/article/news/state/wyden-secures-data-privacy-deal-shield-oregonians-out-of-state-abortion-immigration-surveillance/283-aa03cae2-4dc1-427a-8159-086bdf267118"
  },
  {
    "text": "Two in five arrested for last summer's UK riots had been reported for domestic abuse  —  Police data indicates overlaps between public violent disorder and domestic violence and abuse  —  Two out of every five people arrested after participating in last summer's riots had been previously reported … ",
    "url": "https://www.theguardian.com/society/2025/jul/26/two-in-five-arrested-for-last-summers-uk-riots-had-been-reported-for-domestic-abuse"
  },
  {
    "text": "David Valadao battles backlash in his swing district after voting for Medicaid cuts that hit close to home  —  Democrats are planning to make the California Republican's support for Trump's “big, beautiful bill” a focal point of their campaign in a key midterm race.",
    "url": "https://www.nbcnews.com/politics/2026-election/david-valadao-backlash-swing-district-voting-medicaid-cuts-rcna219992"
  },
  {
    "text": "DOGE builds AI tool to cut 50 percent of federal regulations  —  An internal proposal suggests how the Trump administration is planning to slash federal regulations, but obstacles loom.  —  The U.S. DOGE Service is using a new artificial intelligence tool to slash federal regulations … ",
    "url": "https://www.washingtonpost.com/business/2025/07/26/doge-ai-tool-cut-regulations-trump/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzUzNTAyNDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzU0ODg0Nzk5LCJpYXQiOjE3NTM1MDI0MDAsImp0aSI6IjAxNWQ1NzRmLTRmNDAtNDBjYS04M2YwLWY0NGFmZmZkYzkxZSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9idXNpbmVzcy8yMDI1LzA3LzI2L2RvZ2UtYWktdG9vbC1jdXQtcmVndWxhdGlvbnMtdHJ1bXAvIn0.z17OUPzuSx-jtQATWZcaOwF5JZehWDvi6fXB2jr-rbE&itid=gfta"
  },
  {
    "text": "Judge dismisses DOJ lawsuit against Illinois, Chicago over ‘sanctuary city’ policies  —  U.S. District Court Judge Lindsay C. Jenkins for the Northern District of Illinois Eastern Division said the Trump administration “lacks standing” to invalidate the state, city and county laws … ",
    "url": "https://www.washingtonpost.com/politics/2025/07/25/judge-dismisses-doj-illinois-chicago-immigration-lawsuit/"
  },
  {
    "text": "AOC broke House rules to attend Met Gala with beau Riley Roberts, is told to pay additional $2,700 for ‘Tax The Rich’ gown, other accessories  —  WASHINGTON — Far-left Rep. Alexandria Ocasio-Cortez flouted House ethics rules by accepting more than $3,700 in rented apparel and other gifts … ",
    "url": "https://nypost.com/2025/07/25/us-news/aoc-broke-house-rules-to-attend-met-gala-with-beau-riley-roberts-told-to-pay-additional-2700-for-tax-the-rich-gown-other-accessories/"
  }
]