[
  {
    "text": "Judge severs Trump's Georgia election interference case, and 16 others, from trial starting in October  —  Kenneth Chesebro and Sidney Powell will be tried starting Oct. 23.  —  The judge overseeing the Georgia election interference case has severed the case, ordering that 17 defendants … ",
    "url": "https://abcnews.go.com/US/judge-severs-17-defendants-including-trump-oct-23/story?id=103185589"
  },
  {
    "text": "Judge rejects request to try all Trump Georgia defendants together next month  —  A state judge on Thursday rejected prosecutors' request to try all 19 defendants together in the Georgia 2020 election interference case next month.  —  “The Court joins the skepticism expressed by several federal courts … ",
    "url": "https://thehill.com/regulation/court-battles/4204049-judge-rejects-request-to-try-all-trump-georgia-defendants-together-next-month/"
  },
  {
    "text": "Fulton judge splits Fulton Trump defendants into two groups  —  X  —  The Fulton County judge overseeing the sprawling election interference probe involving former President Donald Trump on Thursday split the case's 19 defendants into two groups for trial — and suggested that more divisions could be merited.",
    "url": "https://www.ajc.com/politics/fulton-judge-splits-fulton-trump-defendants-into-two-groups/OH2BJFAB6FAKVCY6HIPWTGZBZI/"
  },
  {
    "text": "Fani Willis Agrees to Share Names of All 30 Unindicted Co-Conspirators with Trump and Other Georgia Defendants  —  That was the first and most immediate result of a hearing before Fulton County Superior Court Judge Scott McAfee  —  A Facebook icon representing an external link to share … ",
    "url": "https://themessenger.com/news/fani-willis-agrees-to-share-names-of-all-30-unindicted-co-conspirators-with-trump-and-other-georgia-defendants"
  },
  {
    "text": "Biden planning speech on threats to democracy in coming weeks, sources say  —  President Joe Biden plans to deliver a speech focused on threats to democracy in the coming weeks, according to two sources familiar with the plans.  —  Democratic donors gathered in Chicago for a fundraising retreat learned … ",
    "url": "https://www.cnn.com/2023/09/14/politics/democracy-speech-joe-biden/"
  },
  {
    "text": "Kim Davis must pay $100,000 to US same-sex couple she denied marriage license  —  Jury awards damages to David Ermold and David Moore, who sued former Kentucky county clerk over 2015 incident  —  A former Kentucky county clerk is being ordered to pay $100,000 to a local couple who sued … ",
    "url": "https://www.theguardian.com/us-news/2023/sep/14/kim-davis-damages-same-sex-marriage-license-kentucky"
  },
  {
    "text": "White House Strategy on Impeachment: Fight Politics With Politics  —  The White House says it is battling the inquiry in the court of public opinion since House Republicans have not issued any new subpoenas or laid out any potential articles of impeachment.  —  As House Republicans kick off … ",
    "url": "https://www.nytimes.com/2023/09/14/us/politics/white-house-strategy-impeachment.html"
  },
  {
    "text": "DeSantis took undisclosed private flights and lodging through wealthy donors  —  The trips included a private flight to the prestigious home of the Masters tournament, with an overnight stay and a round of golf  —  Florida Gov. Ron DeSantis took at least six undisclosed trips on private jets … ",
    "url": "https://www.washingtonpost.com/politics/2023/09/14/ron-desantis-private-flights/"
  },
  {
    "text": "Republican Primary Divide  —  Voters split between Trump and the rest of the field on nomination, issues  —  West Long Branch, NJ - It is a tale of two electorates in the South Carolina Republican presidential primary.  The Monmouth (\"Mon-muth\") University-Washington Post Poll … ",
    "url": "https://www.monmouth.edu/polling-institute/reports/monmouthpoll_sc_091423/"
  },
  {
    "text": "'You're screwed': Romney's exit threatens a collapse of Senate's middle  —  If Joe Manchin and Kyrsten Sinema follow the Utahn out the door, they'll leave a void in a chamber that's handed Joe Biden remarkable bipartisan deals.  —  Mitt Romney's retirement shines a glaring spotlight … ",
    "url": "https://www.politico.com/news/2023/09/14/romney-exit-senate-middle-dealmakers-00115785"
  },
  {
    "text": "The Morning Briefing: Get Ready for an Onslaught of Saint Romney Hot Takes From the Dems  —  Top O' the Briefing  —  Happy Thursday, dear Kruiser Morning Briefing friends.  Shellebryn and her service chinchilla were often seen gallivanting far too close to the Tilt-A-Whirl.",
    "url": "https://pjmedia.com/columns/stephen-kruiser/2023/09/14/the-morning-briefing-get-ready-for-an-onslaught-of-saint-romney-hot-takes-from-the-dems-n1726801"
  },
  {
    "text": "DeSantis discourages latest covid boosters, contradicting federal guidance  —  Florida Gov. Ron DeSantis (R) and the state's surgeon general are warning residents under age 65 against the new covid-19 booster, going against the advice of federal health officials who have recommended the shots.",
    "url": "https://www.washingtonpost.com/politics/2023/09/14/florida-covid-vaccine-desantis-ladapo/"
  },
  {
    "text": "Video appears to show Lauren Boebert giving the middle finger to an usher after being kicked out of a performance of ‘Beetlejuice’  — Rep. Lauren Boebert was escorted out of a performance of “Beetlejuice” in Denver over the weekend.  — Surveillance footage appears to show her giving … ",
    "url": "https://www.businessinsider.com/footage-shows-lauren-boebert-giving-middle-finger-beetlejuice-usher-2023-9?op=1"
  },
  {
    "text": "A mistress almost takes the stand in Texas AG's impeachment trial  —  AUSTIN — The star witness swept into the Texas Capitol on Wednesday, red coat and flashy Balenciaga-emblazoned handbag tucked under her arms, her white sheath, red lipstick and signature platinum pixie all a dramatic contrast … ",
    "url": "https://www.washingtonpost.com/nation/2023/09/13/paxton-texas-attorney-general-mistress/"
  },
  {
    "text": "Threats mount against prosecutors and FBI agents working on Hunter Biden probe  —  The FBI has created a stand-alone unit to investigate threats from members of the public who think agents and prosecutors haven't been tough enough on the president's son.  —  Prosecutors and FBI agents involved … ",
    "url": "https://www.nbcnews.com/politics/justice-department/prosecutors-fbi-agents-hunter-biden-investigation-threatened-rcna104932"
  },
  {
    "text": "Elon Musk Slammed by Second Country in Disastrous Week for Diplomacy  —  The world's richest man drew a rebuke from Taiwan's foreign ministry just days after being called out by Ukrainian officials.  —  The foreign minister of Taiwan has called out Elon Musk directly after the billionaire appeared … ",
    "url": "https://www.thedailybeast.com/elon-musk-slammed-by-taiwan-over-china-comments"
  },
  {
    "text": "Charges: Man held girlfriend captive in St. Kate's dorm room, beat and raped her for days  —  A Granite Falls man has been arrested and charged after he allegedly held his girlfriend captive in her dorm room at St. Catherine University and raped and assaulted her throughout the weekend.",
    "url": "https://kstp.com/kstp-news/top-news/charges-man-held-girlfriend-captive-in-st-kates-dorm-room-beat-and-raped-her-for-days/"
  }
]