[
  {
    "text": "Trump White House victory called ‘the greatest political comeback in American history’  —  Trump will be the first president to serve two nonconsecutive terms in the White House since Grover Cleveland in 1892  —  From political pariah to the presidency.  —  Four years after Americans booted … ",
    "url": "https://www.foxnews.com/politics/trump-white-house-victory-called-the-greatest-political-comeback-american-history"
  },
  {
    "text": "With Harris' path to victory narrowing, Trump declares victory  —  ABC News has not projected a winner in the presidential race.  —  Republican presidential nominee, former U.S. President Donald Trump arrives to speak during an election night event, Nov. 6, 2024, in West Palm Beach, Florida.",
    "url": "https://abcnews.go.com/Politics/harris-path-victory-narrowing-trump-declares-victory/story?id=115543903"
  },
  {
    "text": "Harris defeats Trump in Virginia  —  Vice President Harris has won Virginia, maintaining Democrats' control of the state at the presidential level despite some Republican inroads in recent years, according to a projection from Decision Desk HQ.  —  Polls in the run-up to Election … ",
    "url": "https://thehill.com/homenews/campaign/4964243-kamala-harris-wins-virginia/"
  },
  {
    "text": "Trump Won.  Now What?  —  Donald Trump has won, and will become president for the second time.  Those who voted for him will now celebrate their victory.  The rest of us need to prepare to live in a different America: a country where millions of our fellow citizens voted for a president … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/11/trump-wins-second-term-presidency/680546/"
  },
  {
    "text": "Election Live Updates: A Caustic and Turbulent Race Is in Voters' Hands  — Polls in parts of Indiana and Kentucky have closed, and voting ends in six more states including Georgia, a key battleground, at 7 p.m. Eastern time.  Turnout looked strong in an election that Vice President Kamala Harris … ",
    "url": "https://www.nytimes.com/live/2024/11/05/us/trump-harris-election"
  },
  {
    "text": "Exit poll results 2024 |  CNN Politics  —  See all exit polls data for the 2024 US elections.  For more information on voting and election results, visit cnn.com/election.",
    "url": "https://www.cnn.com/election/2024/exit-polls/national-results/general/president/0"
  },
  {
    "text": "Exit polls show Trump making inroads with Black and Latino men  —  If Donald Trump wins the two Southeastern battleground states of Georgia and North Carolina, he'll likely be able to credit his support with an unlikely demographic: Black men.  Voter surveys — the network exit polls and AP Votecast … ",
    "url": "https://www.politico.com/live-updates/2024/11/05/2024-election-results-live-coverage-updates-analysis/trumps-surprising-inroads-00187563"
  },
  {
    "text": "NBC News Exit Poll: Voters express deep concern about America's democracy and economy  —  Women are twice as likely as men to rank abortion as their top issue, according to preliminary results from the national survey.  —  The state of democracy and the economy in the United States … ",
    "url": "https://www.nbcnews.com/politics/2024-election/nbc-news-exit-poll-voters-express-concern-democracy-economy-rcna178602"
  },
  {
    "text": "Live Presidential Forecast  —  Our election model estimates the outcome of the race in real time based on polling data, the votes reported so far and what we expect from remaining votes.  Read how it works ›  —  Chance of winning  —  No estimates yet",
    "url": "https://www.nytimes.com/interactive/2024/11/05/us/elections/results-president-forecast-needle.html"
  },
  {
    "text": "Democrats feel 2016 all over again in Harris-Trump battle  —  Democrats started election night feeling genuinely optimistic about Vice President Harris's chance of becoming the nation's first female president.  —  But as the evening wore on and former President Trump began to surpass 200 electoral votes … ",
    "url": "https://thehill.com/homenews/campaign/4975404-democrats-optimistic-vice-president-harris/"
  },
  {
    "text": "What a GOP congressional majority could mean for a Trump presidency  —  One senator said voters are giving Republicans “an extraordinary opportunity.”  —  Ohio Republican Senate candidate Bernie Moreno during a watch party on election night, Nov. 5, 2024, in Westlake, Ohio, with his wife Bridget.",
    "url": "https://abcnews.go.com/Politics/gop-congressional-majority-trump-presidency/story?id=115548853"
  },
  {
    "text": "Moreno ousts Brown in Ohio Senate race  —  Republican businessman Bernie Moreno has defeated incumbent Sen. Sherrod Brown (D-Ohio), the chair of the Senate Banking Committee, boosting Republican chances of taking back control of the Senate.  —  Moreno, 57, who built up a successful network … ",
    "url": "https://thehill.com/homenews/senate/4973460-moreno-defeats-brown-senate-race/"
  },
  {
    "text": "Who is Bernie Moreno, Ohio's new GOP senator-elect and crypto entrepreneur?  —  Republican businessman Bernie Moreno beat longtime incumbent Sherrod Brown (D) with the support of Trump and the cryptocurrency industry.  —  Republican businessman Bernie Moreno has ousted longtime Democratic incumbent … ",
    "url": "https://www.washingtonpost.com/politics/2024/11/06/who-is-bernie-moreno-ohio-senate-2024/"
  },
  {
    "text": "Election Day bomb threats disrupt voting in multiple states  —  The U.S. saw a rash of discredited bomb threats called in at polling places in multiple states on Election Day, in some cases spurring the need for extended voting hours.  —  Faulty bomb threats were called into at least five states … ",
    "url": "https://thehill.com/homenews/campaign/4975024-russia-bomb-threats-polling-places/"
  },
  {
    "text": "Sarah McBride becomes the first out transgender person elected to Congress  —  McBride, a Democrat who served two terms as a state senator, wins Delaware's only House seat, NBC News projects.  —  WILMINGTON, Del. — Delaware state Sen. Sarah McBride won the state's only House seat Tuesday … ",
    "url": "https://www.nbcnews.com/nbc-out/out-politics-and-policy/sarah-mcbride-first-transgender-congress-delaware-rcna177878"
  },
  {
    "text": "Reflections On America's New Autocracy  —  We should brace ourselves for immense depravity, but remain prepared to guide and stiffen the spines of the last bastions of resistance.  —  ∙ Paid  —  The United States and the world will soon be in the hands of mercurial, vindictive … ",
    "url": "https://www.offmessage.net/p/reflections-on-americas-new-autocracy"
  },
  {
    "text": "Florida's abortion amendment fails, leaving 6-week ban in place  —  Florida's abortion-rights ballot initiative fell short of passing on Tuesday, leaving in place a six-week abortion ban that has helped restrict access across almost all of the Southern U.S.  —  The measure's defeat … ",
    "url": "https://thehill.com/policy/healthcare/4969765-florida-abortion-rights-ballot/"
  },
  {
    "text": "Andy Kim Wins in New Jersey to Become the First Korean American Senator  —  Mr. Kim, a Democrat, will take the seat previously held by Robert Menendez, who resigned after being convicted of taking bribes.  —  Representative Andy Kim was elected on Tuesday to the U.S. Senate … ",
    "url": "https://www.nytimes.com/2024/11/05/nyregion/nj-senate-kim-bradshaw.html"
  },
  {
    "text": "California voters approve measure making some shoplifting, drug offenses felonies  —  California voters approved a ballot measure Tuesday seeking harsher punishment for retail crimes including shoplifting and theft.  —  Repeat offenders may now be charged with felonies under Proposition 36 … ",
    "url": "https://thehill.com/homenews/state-watch/4976161-california-ballot-measure-shoplifting-theft/"
  },
  {
    "text": "Israel's Netanyahu dismisses his defense minister as wars rage.  Protests erupt across country  —  Israeli Prime Minister Benjamin Netanyahu on Tuesday dismissed his popular defense minister, Yoav Gallant, in a surprise announcement that came as the country is embroiled in wars on multiple fronts across the region.",
    "url": "https://apnews.com/article/israel-netanyahu-gallant-gaza-war-lebanon-3810d3adb1603e8485b4be46a5b79f8b"
  },
  {
    "text": "Fox News projects Mike Kehoe to win Missouri governor's race  —  The Republican defeated Democrat Crystal Quade and two third-party challengers  —  The Fox News Decision Desk projects Republican Lt. Gov. Mike Kehoe to win the open Missouri governor's race, defeating Democratic challenger Crystal Quade.",
    "url": "https://www.foxnews.com/politics/fox-news-projects-mike-kehoe-win-missouri-governors-race"
  }
]