[
  {
    "text": "Johnson says Ukraine aid and border policy reform ‘likely’ to be split  —  House Speaker Mike Johnson (R-La.) told the three leaders of the Baltic parliaments that President Biden's national security supplemental that includes aid for Ukraine is “likely” to be split up over concerns … ",
    "url": "https://thehill.com/policy/international/4440281-johnson-ukraine-aid-border-likely-split/"
  },
  {
    "text": "Republican Senator Stunningly Slams Trump for Killing Border Deal  —  At least one Republican has reached a breaking point over Donald Trump's border security chicanery.  —  On Tuesday, North Dakota Senator Kevin Cramer had swing voters at the front of his mind, lobbing his own mud at Trump … ",
    "url": "https://newrepublic.com/post/178596/republican-senator-cramer-whacks-trump-killing-border-deal"
  },
  {
    "text": "2024 Matchups: Biden Opens Up Lead Over Trump In Head-To-Head, Quinnipiac University National Poll Finds; Haley Leads Biden 1 On 1, But Trails When Third Party Candidates Are Added  —  mail_outline  —  As signs point to the 2024 presidential election being a repeat of the 2020 race between … ",
    "url": "https://poll.qu.edu/poll-release?releaseid=3889"
  },
  {
    "text": "The Surprising Twist That Saved Fani ... for Now  —  As the late, great Wilford Brimley declared in Absence of Malice: “Wonderful thing, subpoenas.”  In a divorce action that had dragged out for over two years, Jocelyn Wade had sent a subpoena to Fani Willis to explain why Wade's estranged husband Nathan … ",
    "url": "https://hotair.com/ed-morrissey/2024/01/31/the-surprising-twist-that-saved-fani-for-now-n608587"
  },
  {
    "text": "Fulton DA Willis, Wade subpoenaed to testify at Feb. 15 hearing  —  Fulton County District Attorney Fani Willis and special prosecutor Nathan Wade have been subpoenaed to testify at a Feb. 15 hearing involving motions to disqualify them from the election interference case, according to a lawsuit filed Tuesday.",
    "url": "https://www.ajc.com/politics/fulton-da-willis-wade-subpoenaed-to-testify-at-feb-15-hearing/T3J2ETVR4NCIRB3V6IMGJNW67M/"
  },
  {
    "text": "Judge dismisses Disney's lawsuit alleging retaliation by Florida Gov. Ron DeSantis  — A judge dismissed a lawsuit Disney filed against Florida Gov. Ron DeSantis that alleged he retaliated against the company for publicly criticizing a controversial parental rights law the governor backed.",
    "url": "https://www.cnbc.com/2024/01/31/judge-dismisses-disney-lawsuit-against-florida-gov-ron-desantis-alleging-retaliation.html"
  },
  {
    "text": "Federal judge throws out Disney's lawsuit against DeSantis  —  “This is an important case with serious implications for the rule of law, and it will not end here,” Disney said Wednesday.  —  TALLAHASSEE, Florida — Disney lost a major battle in its bitter struggle with Florida Gov. Ron DeSantis … ",
    "url": "https://www.politico.com/news/2024/01/31/federal-judge-throws-out-disneys-lawsuit-against-desantis-00138852"
  },
  {
    "text": "Mark Zuckerberg apologizes to parents at online child safety hearing  —  “I'm sorry for everything you've all gone through,” the Meta CEO said at a Senate Judiciary Committee Hearing called “Big Tech and the Online Child Sexual Exploitation Crisis.”  —  Meta CEO Mark Zuckerberg apologized Wednesday … ",
    "url": "https://www.nbcnews.com/tech/social-media/mark-zuckerberg-apologizes-parents-online-child-safety-hearing-rcna136578"
  },
  {
    "text": "Pennsylvania man arrested after allegedly decapitating his father and displaying his head on YouTube  —  In the video, which has since been removed, Justin Mohn says his father was a federal employee and refers to him as a traitor while voicing right-wing conspiracy theories.",
    "url": "https://www.nbcnews.com/news/us-news/pa-man-arrested-decapitating-father-youtube-video-rcna136509"
  },
  {
    "text": "Why Trumpers are losing it over Taylor Swift  —  Swift goes to football games to support her boyfriend, shattering MAGA brains. … MAGA this week at last found its true, final, most hated enemy.  Not Barack Obama.  Not Hilary Clinton.  Not Joe Biden.  Not even Hunter Biden.",
    "url": "https://www.publicnotice.co/p/taylor-swift-causes-trumpers-to-lose-it-kelce"
  },
  {
    "text": "John Podesta to succeed John Kerry as top U.S. climate diplomat  —  The veteran Democratic political strategist will add the role to his duties at a crucial time for President Biden's climate agenda  —  President Biden will tap senior adviser John D. Podesta to replace outgoing U.S. special … ",
    "url": "https://www.washingtonpost.com/climate-environment/2024/01/31/podesta-john-kerry-climate-envoy/"
  },
  {
    "text": "House Republican reported for doing pull-ups at the top of Capitol dome  —  The Capitol Visitor's Center reported Rep. Rich McCormick to the sergeant at arms for “unsafe actions” while on a tour, according to an email reviewed by POLITICO.",
    "url": "https://www.politico.com/live-updates/2024/01/31/congress/republican-reported-for-unsafe-actions-00138833"
  },
  {
    "text": "Scoop: State Department reviewing options for possible recognition of Palestinian state  —  Secretary of State Tony Blinken asked the State Department to conduct a review and present policy options on possible U.S. and international recognition of a Palestinian state after the war in Gaza … ",
    "url": "https://www.axios.com/2024/01/31/palestine-statehood-biden-israel-gaza-war"
  },
  {
    "text": "California introduces first-in-nation slavery reparations package  —  The set of bills notably excludes direct cash payments.  —  SACRAMENTO, California — California state lawmakers introduced a slate of reparations bills on Wednesday, including a proposal to restore property taken by … ",
    "url": "https://www.politico.com/news/2024/01/31/california-black-reparations-bills-00138854"
  },
  {
    "text": "The ‘Profound Influence’ of Christian Extremists on Mike Johnson  —  Speaker Mike Johnson's spiritual journey reveals ties to Christian fundamentalists who support slavery.  Johnson's office won't say where he stands on that issue. … If you want to know where Republican House Speaker Mike Johnson stands … ",
    "url": "https://www.thedailybeast.com/the-profound-influence-of-christian-extremists-on-mike-johnson"
  },
  {
    "text": "Nikki Haley says Texas can secede from US if it wants but 'isn't going to'  —  That view contradicts centuries of history and precedent.  —  Republican presidential candidate Nikki Haley attends a Lady Hawkeyes Tailgate campaign event in Coralville, Iowa, December 30, 2023.",
    "url": "https://abcnews.go.com/Politics/nikki-haley-texas-secede-us-isnt/story?id=106837677"
  },
  {
    "text": "Even Jefferson Davis recognized Section III ‘automatically disqualified him’: Dozens of historians urge Supreme Court to remove Trump from 2024 ballot  —  Even Jefferson Davis, leader of the Confederacy — and his lawyer — knew the insurrection clause in the U.S. Constitution not only disqualified … ",
    "url": "https://lawandcrime.com/high-profile/even-jefferson-davis-recognized-section-iii-automatically-disqualified-him-dozens-of-historians-urge-supreme-court-to-remove-trump-from-2024-ballot/"
  },
  {
    "text": "Elon Musk cannot keep Tesla pay package worth more than $55 billion, judge rules  —  Elon Musk is not entitled to a landmark compensation package awarded by Tesla's board of directors that is potentially worth more than $55 billion, a Delaware judge ruled Tuesday.",
    "url": "https://apnews.com/article/elon-musk-tesla-compensation-pay-shareholders-e75687178d1175fba36ca55bd9c4c805"
  },
  {
    "text": "US veteran accused of tearing down Satanic Temple idol in Iowa Capitol charged with hate crime  —  A U.S. Navy veteran who is accused of tearing down a Satanic Temple statue within the Iowa state Capitol has been charged with a hate crime.  —  Michael Cassidy, a conservative Christian veteran … ",
    "url": "https://www.washingtonexaminer.com/news/2828416/news-veteran-tore-down-idol-iowa-capital-charged-hate-crime/"
  },
  {
    "text": "Trump's big NY fraud verdict won't come until next week: source  — A verdict in Trump's NY fraud trial won't come until February, a source told Business Insider.  — Judge Arthur Engoron had said he'd try to get it done by the end of January.  That won't happen.",
    "url": "https://www.businessinsider.com/trump-verdict-judge-engoron-ny-fraud-case-due-in-february-2024-1"
  },
  {
    "text": "Chinese hackers are determined to ‘wreak havoc’ on US critical infrastructure, FBI director warns  —  Chinese government hackers are busily targeting water treatment plants, the electrical grid, transportation systems and other critical infrastructure inside the United States … ",
    "url": "https://apnews.com/article/fbi-china-espionage-hacking-db23dd96cfd825e4988852a34a99d4ea"
  },
  {
    "text": "A State Supreme Court Just Issued the Most Devastating Rebuke of Dobbs Yet  —  The Supreme Court's eradication of the constitutional right to abortion in 2022's Dobbs v. Jackson Women's Health Organization had an immediate and devastating impact on gender equality in the United States.",
    "url": "https://slate.com/news-and-politics/2024/01/pennsylvania-supreme-court-dobbs-sam-alito-abortion.html"
  },
  {
    "text": "Gaetz's measure on Trump and Jan. 6  —  Rep. Matt Gaetz is rounding up support for a measure that says Donald Trump did not “engage in insurrection or rebellion against the United States, or give aid or comfort to the enemies thereof,” according to a copy reviewed by POLITICO.",
    "url": "https://www.politico.com/live-updates/2024/01/31/congress/gaetzs-measure-on-trump-and-jan-6-00138846"
  },
  {
    "text": "Trump's mobilizing his “prayer warriors”: Religion scholar on what MAGA means by “spiritual warfare”  —  Professor André Gagné explains that MAGA's “adoption of aggressive spiritual warfare language” is a warning sign  —  Donald Trump may control the Republican Party — but his power is not 100 percent absolute.",
    "url": "https://www.salon.com/2024/01/31/mobilizing-his-prayer-warriors-religion-scholar-on-what-maga-means-by-spiritual-warfare/"
  }
]