[
  {
    "text": "White House Correspondents' Association cancels comedian headliner for annual dinner  —  The group's board unanimously decided it would no longer feature a comedic performance, WHCA President Eugene Daniels wrote in an email Saturday  —  The White House Correspondents' Association … ",
    "url": "https://www.politico.com/news/2025/03/29/white-house-correspondents-dinner-trump-00259299"
  },
  {
    "text": "Trump says he 'couldn't care less' if automakers raise prices due to tariffs, says he believes it will make people buy American-made cars  —  In an interview with NBC News, President Donald Trump also said he would not fire anyone involved in the Signal group chat.",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-says-couldnt-care-less-automakers-raise-prices-tariffs-rcna198731"
  },
  {
    "text": "Trump pushes aides to go bigger on tariffs as key deadline nears  —  The president privately tells advisers that import duties represent a generational opportunity to transform the U.S. economy.  —  Just now  —  President Donald Trump is pushing senior advisers to go bigger on tariff policy … ",
    "url": "https://www.washingtonpost.com/business/2025/03/29/republicans-trump-tariffs-trade-war/"
  },
  {
    "text": "The Imperialism Has no Clothes  —  “No one would allow that he could not see these much-admired clothes; because, in doing so, he would have declared himself either a simpleton or unfit of his office.”  Hans Christian Andersen, “The Emperor's New Clothes”  —  Musk-Trump inherited a state … ",
    "url": "https://snyder.substack.com/p/vance-in-greenland"
  },
  {
    "text": "‘Should I Fire Him?’  Inside Trump's Deliberations Over the Fate of Michael Waltz  —  In public, President Trump has defended his national security adviser.  But behind the scenes, he has been casting around for advice.  —  For much of this week, President Trump was consumed by a single question.",
    "url": "https://www.nytimes.com/2025/03/29/us/politics/trump-signal-michael-waltz.html?unlocked_article_code=1.7k4.mPYh.-3zVC5P5UD8M&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "DOGE fires nearly all staff at U.S. Institute of Peace headquarters  —  Employees who worked at the headquarters of the institute, founded and funded by Congress, received late-night termination notices, though most of its overseas staff were left in place.  —  Just now",
    "url": "https://www.washingtonpost.com/national-security/2025/03/29/doge-usip-peace-institute-fired/"
  },
  {
    "text": "Secret Pentagon memo on China, homeland has Heritage fingerprints  —  An internal guidance memo from Defense Secretary Pete Hegseth focuses on deterring China's seizure of Taiwan and shoring up homeland defense.  In some instances, the document is nearly a word-for-word facsimile of a report … ",
    "url": "https://www.washingtonpost.com/national-security/2025/03/29/secret-pentagon-memo-hegseth-heritage-foundation-china/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQzMjIwODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ0NjAzMTk5LCJpYXQiOjE3NDMyMjA4MDAsImp0aSI6IjYyOTVlOGVmLTI2MTgtNGVjMC04ZWI1LWVjMWFkY2Q5YmUyZiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb25hbC1zZWN1cml0eS8yMDI1LzAzLzI5L3NlY3JldC1wZW50YWdvbi1tZW1vLWhlZ3NldGgtaGVyaXRhZ2UtZm91bmRhdGlvbi1jaGluYS8ifQ.O7lt8b5w3iNyhAEn8NUezugixhGd3QZzjekjJ4C6mas&itid=gfta"
  },
  {
    "text": "“Spiraling Deeper and Deeper Into Danger”: RFK Jr. Forces Out Top Vaccine Official  —  “It has become clear that truth and transparency are not desired by the secretary, but rather he wishes subservient confirmation of his misinformation and lies.”  —  Robert F. Kennedy's Jr. war on vaccines … ",
    "url": "https://www.motherjones.com/politics/2025/03/robert-kennedy-jr-forces-out-peter-marks-vaccines-measles-fda/"
  },
  {
    "text": "Hundreds of international students wake up to an email asking them to self deport for campus activism  —  Hundreds of international students in the US are getting an email from the US Department of State (DOS) asking them to self-deport owing to campus activism.",
    "url": "https://timesofindia.indiatimes.com/world/us/hundreds-of-international-students-are-waking-up-to-an-email-asking-them-to-self-deport-for-campus-activism-or-even-sharing-posts-on-social-media/articleshow/119679695.cms"
  },
  {
    "text": "Pete Hegseth's wife reportedly attended meetings with foreign defense officials  —  Defense secretary, already under fire for chat group blunder, faces new scrutiny for having wife in high-level meetings  —  The wife of the US defense secretary, Pete Hegseth, attended two meetings … ",
    "url": "https://www.theguardian.com/us-news/2025/mar/29/pete-hegseth-wife-jennifer-foreign-defense-official-meetings"
  },
  {
    "text": "The Democrats Are in Denial About 2024  —  Last year's election was close, despite President Trump's hyperbolic claims about his margin of victory.  Still, the Democratic Party clearly lost — and not only the presidential race.  It also lost control of the Senate and failed to recapture the House of Representatives.",
    "url": "https://www.nytimes.com/2025/03/29/opinion/democrats-strategy-2024.html"
  },
  {
    "text": "Over 200 ‘Tesla Takedown’ protests take place throughout US on ‘Global Day of Action’ against Elon Musk's role with DOGE  —  Hundreds of “Tesla Takedown” demonstrations are taking place in the United States, Canada and Europe as activists ramp up their opposition to CEO Elon Musk's efforts … ",
    "url": "https://cnn.com/2025/03/29/business/tesla-takedown-elon-musk-doge/"
  },
  {
    "text": "How Colleges Are Cracking Down on Students Now  —  Colleges are using surveillance videos and search warrants to investigate students involved in pro-Palestinian protests.  Experts say it's a new frontier in campus security that could threaten civil liberties.",
    "url": "https://www.nytimes.com/2025/03/29/us/universities-students-search-warrants.html"
  },
  {
    "text": "Wisconsin judge won't stop Musk's $1 million payments to voters.  Attorney general appeals  —  A Wisconsin judge on Saturday declined to stop billionaire Elon Musk from handing over $1 million checks to two voters in the state at a planned rally days before the closely contested Supreme Court election.",
    "url": "https://apnews.com/article/wisconsin-supreme-court-musk-million-dollar-checks-43fa79215e16c333a1079a86cb9aab08"
  },
  {
    "text": "Taxpayers' Tab For Trump's Second-Term Golf Excursions Crosses $26 Million Mark  —  He has now traveled to one of his golf resorts on nine of the ten weekends since taking office in January.  It is his seventh trip to his Palm Beach, Florida, country club.  —  WASHINGTON — American taxpayers … ",
    "url": "https://www.huffpost.com/entry/trump-golf-again-26-million_n_67e6c885e4b0f69ef1d3886c"
  },
  {
    "text": "Kristi Noem refused to say who financed some of her travel.  It was taxpayers who were on the hook  —  As then-Gov. Kristi Noem crisscrossed the country — stumping for President Donald Trump and boosting her political profile beyond her home state — she refused to reveal what her extensive travel was costing taxpayers.",
    "url": "https://apnews.com/article/noem-travel-taxpayers-south-dakota-homeland-security-c2655e00a16d44bba46c60a14a638f5d"
  },
  {
    "text": "Utah Bans Most Flags, Including Pride, at Schools and Government Buildings  —  The new law is among the most restrictive governing displays of flags, and is part of a polarizing debate focused on the Pride flag and other expressions of L.G.B.T.Q. support.  —  The Utah State Legislature approved … ",
    "url": "https://www.nytimes.com/2025/03/29/us/utah-flag-pride-ban.html"
  },
  {
    "text": "Alarm as Florida Republicans move to fill deported workers' jobs with children: 'It's insane, right?'  —  Governor Ron DeSantis leads push to loosen child labor laws as immigration crackdown leads to workforce shortage  —  Beneath the smugness of Ron DeSantis, at Florida leading the nation … ",
    "url": "https://www.theguardian.com/us-news/2025/mar/29/florida-republicans-immigrant-jobs-child-labor"
  },
  {
    "text": "DOGE's Marko Elez is back on U.S. payroll  —  The software engineer fired over racist social media posts is now a Labor Department aide detailed to multiple agencies, according to a new court filing.  —  A member of Elon Musk's DOGE team — fired from the Treasury Department after the discovery … ",
    "url": "https://www.politico.com/news/2025/03/29/doge-marco-elez-software-engineer-us-payroll-00259303"
  }
]