[
  {
    "text": "'I'm a black NAZI!':  NC GOP nominee for governor made dozens of disturbing comments on porn forum  —  Editor's Note: The below story contains offensive language.  —  Mark Robinson, the controversial and socially conservative Republican nominee for governor of North Carolina … ",
    "url": "https://www.cnn.com/2024/09/19/politics/kfile-mark-robinson-black-nazi-pro-slavery-porn-forum"
  },
  {
    "text": "North Carolina GOP defends Robinson following explosive CNN report  —  The North Carolina Republican Party released a statement Thursday evening defending its gubernatorial nominee, Lt. Gov. Mark Robinson, after an explosive report about him was released.  —  “Mark Robinson has categorically denied … ",
    "url": "https://thehill.com/homenews/campaign/4889881-north-carolina-gop-mark-robinson-cnn-report/"
  },
  {
    "text": "Robinson comments leave North Carolina Republicans reeling  —  An explosive report Thursday that North Carolina GOP gubernatorial candidate Mark Robinson made many offensive statements on a porn site's message board has Republicans in the state reeling and Democrats on offense.",
    "url": "https://thehill.com/homenews/campaign/4889585-north-carolina-gop-candidate-mark-robinson-scandal/"
  },
  {
    "text": "Nuzzi's RFK Relationship  —  “Had the magazine been aware of this relationship, she would not have continued to cover the presidential campaign,” the spokesperson said. … “Recently our Washington Correspondent Olivia Nuzzi acknowledged to the magazine's editors that she had engaged … ",
    "url": "https://www.status.news/p/olivia-nuzzi-rfk-new-york-magazine"
  },
  {
    "text": "New Court Filings Place Matt Gaetz at a Party at the Center of the Sex Trafficking Scandal  —  This is the first public filing that cites sworn testimony alleging that Gaetz attended one of the long-rumored parties with a teenage girl.  — Copy  —  Rep. Matt Gaetz attended a drug-fueled sex party … ",
    "url": "https://www.notus.org/florida/new-court-filings-matt-gaetz-dorworth-sex-party"
  },
  {
    "text": "Matt Gaetz Was at Sex and Drugs Party With High School Junior: Court Docs  —  BOMBSHELL  —  Filings cite sworn statements from three witnesses.  —  Rep. Matt Gaetz was at a 2017 party with a 17-year-old girl at the heart of an alleged sex trafficking scandal, according to legal documents filed Thursday.",
    "url": "https://www.thedailybeast.com/matt-gaetz-was-at-sex-and-drugs-party-with-high-school-junior-court-docs"
  },
  {
    "text": "Kentucky sheriff charged in killing of judge at courthouse  —  A judge in a rural Kentucky county was shot and killed in his courthouse chambers Thursday, and the local sheriff was charged with murder, police said.  The preliminary investigation indicates Letcher County Sheriff Shawn M. Stines … ",
    "url": "https://apnews.com/article/courthouse-shooting-kentucky-f93419fff14202a88e28b5ea49b26810"
  },
  {
    "text": "Kentucky judge shot and killed in his chambers, suspect in custody: Officials  —  District Judge Kevin Mullins was killed at the Letcher County Courthouse.  —  Kentucky judge Kevin Mullins was shot and killed in his chambers on Thursday, according to officials.",
    "url": "https://abcnews.go.com/US/kentucky-judge-shot-killed-in-chambers/story?id=113856879"
  },
  {
    "text": "Mike Johnson bypassed a second time with rare maneuver … - In May, a discharge petition led by Rep. Greg Steube (R-Fla.) attained the necessary 218 signatures to force a House vote on legislation providing tax relief to victims of natural disasters.  — The last time a discharge petition succeeded … ",
    "url": "https://www.axios.com/2024/09/19/discharge-petition-social-security-mike-johnson"
  },
  {
    "text": "Trump Electoral-Vote Heist Underway in Nebraska  —  With the major-party presidential candidates in close battles in a sparse landscape of battleground states, every electoral vote matters.  There are scenarios where either Kamala Harris or Donald Trump wins 269 or 270 electoral votes.",
    "url": "https://nymag.com/intelligencer/article/trump-electoral-vote-heist-underway-in-nebraska.html"
  },
  {
    "text": "With abortion in focus, Harris's event with Oprah prompts cheers and tears  —  Winfrey introduced celebrities and shepherded an audience that was both live and on Zoom between energetic applause and somber reflection.  —  FARMINGTON HILLS, Mich. — A star-studded online rally designed … ",
    "url": "https://www.washingtonpost.com/politics/2024/09/20/harris-oprah-winfrey-zoom-rally/"
  },
  {
    "text": "Former Longtime Teamsters President Blasts Successor For Not Backing Harris  —  Jim Hoffa accused the union's current president, Sean O'Brien, of “a failure of leadership,” saying he boosted Trump's campaign with a non-endorsement.  —  LOADING  —  Former longtime Teamsters President Jim Hoffa blasted … ",
    "url": "https://www.huffpost.com/entry/jim-hoffa-sean-obrien-teamsters_n_66ed5a0de4b051cb4d2d3b54"
  },
  {
    "text": "Trump tells Jewish audience Israel will be ‘eradicated’ if he doesn't win  —  Trump spoke at a campaign event on “Fighting Anti-Semitism in America.”  —  Former President and Republican presidential candidate Donald Trump speaks at the Israeli-American Council National Summit in Washington, D.C., on Sept. 19, 2024.",
    "url": "https://abcnews.go.com/Politics/trump-israel-eradicated-win/story?id=113853150"
  },
  {
    "text": "I'm the Governor of Ohio.  I Don't Recognize the Springfield That Trump and Vance Describe.  —  I was born in Springfield, Ohio.  My wife, Fran, and I have lived our entire lives less than 10 miles from this city.  —  When we were dating in high school, we would go there to see movies … ",
    "url": "https://www.nytimes.com/2024/09/20/opinion/springfield-haitian-migrants-ohio.html?unlocked_article_code=1.ME4.GXDA.7LLopMRyJqap&smid=url-share"
  },
  {
    "text": "Trump's Deranged Plan to Lower Food Prices by Raising Them  —  If you wish grocery stores were more expensive and offered less variety, then you'll love his tariff proposal.  —  At a campaign event on Tuesday night, Donald Trump vowed to lower the price of groceries by ... taxing them?",
    "url": "https://www.theatlantic.com/politics/archive/2024/09/trump-tariffs-grocery-prices/679942/"
  },
  {
    "text": "Jason Stanley on how authoritarians rewrite the past  —  “Authoritarian regimes must erase any history of social movements for democracy.”  —  ∙ Paid … “Fascist politics invokes a pure mythic past tragically destroyed,” Jason Stanley wrote at the very beginning of his 2018 book … ",
    "url": "https://www.publicnotice.co/p/jason-stanley-interview-fascism-erasing-history"
  },
  {
    "text": "North Carolina Judge Denies Republicans' Request To Block UNC Mobile Voter ID  —  A North Carolina judge denied a request from the Republican National Committee (RNC) and North Carolina Republican Party to prohibit University of North Carolina-Chapel Hill students and employees from using … ",
    "url": "https://www.democracydocket.com/news-alerts/north-carolina-judge-denies-republicans-request-to-block-unc-mobile-voter-id/"
  },
  {
    "text": "Trump Falsely Accusing Harris Of Using Hacked Material - Which Is Exactly What He Did In 2016  —  Trump has successfully persuaded many Americans that his campaign's collusion with Russia in 2016 was a “hoax.”  It was not.  —  WASHINGTON — Donald Trump on Thursday falsely accused Vice … ",
    "url": "https://www.huffpost.com/entry/trump-harris-hack-iran-russia_n_66ec6351e4b083d40a2c8910"
  },
  {
    "text": "UH-OH: The slowest mail in the country is in key swing states, NBC investigations finds  —  Tens of thousands of voters were disenfranchised by slow mail in 2020  —  In 2020, when the United States Postal Service began an ambitious plan to modernize and consolidate services … ",
    "url": "https://www.nbcnewyork.com/news/national-international/slowest-mail-in-country-key-swing-states-nbc-investigation/5810571/"
  }
]