[
  {
    "text": "It's Time To Unite Behind Donald Trump  —  An open border with terrorists, criminals, and drugs pouring into our country.  A botched withdrawal from Afghanistan that stranded thousands of Americans and our allies behind enemy lines, left billions of dollars' worth of U.S. military equipment … ",
    "url": "https://www.newsweek.com/rick-scott-its-time-unite-behind-donald-trump-opinion-1840060"
  },
  {
    "text": "Barbara Lee hits California Senate opponents Schiff, Porter on Santos expulsion vote  —  Rep. Barbara Lee is calling out two of her fellow Democratic California Senate hopefuls — Reps. Adam Schiff and Katie Porter — over the House vote to expel embattled Rep. George Santos (R-N.Y.).",
    "url": "https://thehill.com/homenews/campaign/4289593-barbara-lee-california-senate-schiff-porter-santos-expulsion/"
  },
  {
    "text": "George Santos finds unlikely protectors in House Democrats … - Santos faces two federal indictments and a likely reelection loss if he manages to stay in Congress through 2024. … - The resolution would have failed even if all Democrats had voted for it: Just 24 Republicans voted for it … ",
    "url": "https://www.axios.com/2023/11/02/george-santos-expulsion-vote-house-democrats"
  },
  {
    "text": "Will the haters once again decide the presidential election?  —  One of the unusual dynamics of the 2016 presidential race was that neither candidate was particularly well-liked.  Donald Trump and Hillary Clinton were viewed more unfavorably than favorably by Election Day, with perceptions of each candidate at historic lows.",
    "url": "https://www.washingtonpost.com/politics/2023/11/02/trump-biden-dislike-polls/"
  },
  {
    "text": "It's a one-candidate race — with two backups  —  IT'S A ONE-CANDIDATE RACE — WITH TWO BACKUPS.  Some Republicans have long wanted the GOP presidential field to narrow.  They hoped the also-ran candidates would drop out.  So far, there hasn't been much of that.  Instead, the field has effectively narrowed itself.",
    "url": "https://www.washingtonexaminer.com/opinion/its-a-one-candidate-race-with-two-backups"
  },
  {
    "text": "The brutal GOP attacks on Tuberville — and what they could mean  —  An undersold cause of the gridlock in Congress is that it's often allowed to fester quietly.  Nowhere is that more true than in the Senate.  Not only can members effectively wage a filibuster without actually having to speak … ",
    "url": "https://www.washingtonpost.com/politics/2023/11/02/brutal-gop-attacks-tuberville-what-they-could-mean/"
  },
  {
    "text": "BREAKING: US to Demand Pause as IDF Declares Gaza City Surrounded  —  That didn't take long.  What comes next will take much longer.  Especially if Israel takes its military and political advice from the author of the Kabul Collapse.  We'll get to that scoop from the New York Times shortly.",
    "url": "https://hotair.com/ed-morrissey/2023/11/02/breaking-us-to-demand-pause-as-idf-declares-gaza-city-surrounded-n589532"
  },
  {
    "text": "Nancy Mace's Staff Guide Shows Her True Priority: Nancy Mace  —  A lengthy internal handbook for aides to the Republican lawmaker—obtained by The Daily Beast—demonstrates Mace's thirst for the spotlight. … Well before her fateful vote to remove Kevin McCarthy from the House speakership … ",
    "url": "https://www.thedailybeast.com/nancy-maces-staff-guide-shows-her-true-priority-nancy-mace"
  },
  {
    "text": "MTG attacks ‘vaping groping’ Boebert and Chip Roy after Republicans vote against her  —  Killing the resolution to censure Rep. Rashida Tlaib (D-MI) sparked Republican infighting between Rep. Chip Roy (R-TX) and Rep. Marjorie Taylor Greene (R-GA), who introduced the measure last week … ",
    "url": "https://www.washingtonexaminer.com/news/house/roy-defends-voting-table-feckless-tlaib-censure-motion"
  },
  {
    "text": "What we still don't know about Paul Pelosi attack  —  THE BUZZ: An unheralded San Francisco court hearing has offered new hints about California's preeminent political case.  —  We're coming up on the federal trial of David DePape, who is accused of assaulting Paul Pelosi and plotting … ",
    "url": "https://www.politico.com/newsletters/california-playbook/2023/11/02/what-we-still-dont-know-about-paul-pelosi-attack-00124936"
  },
  {
    "text": "Eric and Donald Trump Jr to testify in NY civil fraud trial: Live  —  Don Trump Jr, Eric Trump, Ivanka Trump, and the former president himself are all expected to take the stand in the New York civil fraud trial over the coming days  —  Donald Trump Jr arrives at New York court to take stand in father's fraud trial",
    "url": "https://www.independent.co.uk/news/world/americas/donald-trump-jr-testimony-trial-latest-news-b2440252.html"
  },
  {
    "text": "Tuberville staffer asks anti-abortion groups to float primaries against Republicans who oppose military holds  —  The GOP senator's communications director said the email to those groups reflected his personal opinion, and was not endorsed by his boss.",
    "url": "https://www.politico.com/live-updates/2023/11/02/congress/tuberville-staffers-anti-abortion-group-ask-00124994"
  },
  {
    "text": "I fought to get sober.  Political weaponization of my addiction hurts more than me.  —  My struggles and my mistakes have been fodder for a vile and sustained disinformation campaign against my father, President Joe Biden, and an all-out annihilation of my reputation.",
    "url": "https://www.usatoday.com/story/opinion/voices/2023/11/02/hunter-biden-addiction-substance-abuse-not-political-ploy/71332255007/"
  },
  {
    "text": "F.B.I. Raids Home of Eric Adams's Fund-Raising Chief  —  The raid of the home of Brianna Suggs, a consultant with close ties to the mayor, came as Mr. Adams canceled a series of meetings in Washington, D.C., on Thursday.  —  Agents from the Federal Bureau of Investigation on Thursday searched … ",
    "url": "https://www.nytimes.com/2023/11/02/nyregion/eric-adams-brianna-suggs-fbi-raid.html"
  },
  {
    "text": "Alabama court says state can execute inmate with nitrogen gas  —  The decision moves Alabama closer to being the first state to attempt an execution with nitrogen gas, although there is likely to be additional litigation.  —  MONTGOMERY, Ala. — A divided Alabama Supreme Court said the state … ",
    "url": "https://www.nbcnews.com/news/us-news/alabama-court-says-state-can-execute-inmate-nitrogen-gas-rcna123295"
  },
  {
    "text": "Ady Barkan, Health Care Activist, Dies at 39  —  Mr. Barkan campaigned for Medicare for all while struggling with A.L.S., the terminal neurodegenerative disease.  —  Ady Barkan, a well-known activist who campaigned for Medicare for all while struggling with the terminal neurodegenerative disease A.L.S., has died.",
    "url": "https://www.nytimes.com/2023/11/02/us/politics/ady-barkan-dead.html"
  }
]