[
  {
    "text": "Now Republicans Have to Sell Trump's Megabill to Voters  —  Control of Congress in next year's election could turn on how Americans view the sweeping tax and domestic-policy package  —  Republicans had a hard time persuading some of their own lawmakers to support the party's big tax-cutting and domestic-policy bill.",
    "url": "https://www.wsj.com/politics/policy/republican-tax-spending-bill-midterm-elections-e6928d5f"
  },
  {
    "text": "A Road Map for Undoing the Damage of the Big, Awful Bill  —  In the 30 years I have been a part of fiscal policymaking I don't think I have ever seen a legislative push as impressive as the passage of President Trump's big, dubious tax and policy bill.  —  Don't get me wrong … ",
    "url": "https://www.nytimes.com/2025/07/05/opinion/democrats-budget-bill-trump.html"
  },
  {
    "text": "Conservatives Are Prisoners of Their Own Tax Cuts  —  Aside from hype artists and White House spokespeople, it's hard to find true enthusiasm for the sweeping new policy law, even among Republicans who voted for its passage.  But because almost all Republicans did vote for it … ",
    "url": "https://www.nytimes.com/2025/07/05/opinion/trump-republicans-taxes-bill.html"
  },
  {
    "text": "Don't call it ‘Alligator Alcatraz.’ Call it a concentration camp.  —  This facility's purpose fits the classic model, and its existence points to serious dangers ahead for the country.  —  By Andrea Pitzer, author of “One Long Night: A Global History of Concentration Camps”",
    "url": "https://www.msnbc.com/opinion/msnbc-opinion/immigration-alligator-alcatraz-concentration-camp-rcna216874"
  },
  {
    "text": "Trump's Politicized F.B.I. Has Made Americans Less Safe  —  Only 11 days after President Trump was inaugurated for a second term, his administration began a purge of the F.B.I. that now threatens some of the bureau's most important missions.  His appointees ousted eight of its most experienced managers … ",
    "url": "https://www.nytimes.com/2025/07/05/opinion/trump-fbi-politics-safety.html?unlocked_article_code=1.UE8.Yfuj.CKxvuUSBwEgg&smid=url-share"
  },
  {
    "text": "Critical Read About the BBB, Federalism and the Future of American Democracy … TPM Reader TS (Harvard sociologist/political scientist Theda Skocpol) and I often compared notes on the news of the day and I am always particularly attentive to her thoughts on state structure and power.",
    "url": "https://talkingpointsmemo.com/edblog/critical-read-about-the-bbb-federalism-and-the-future-of-american-democracy"
  },
  {
    "text": "Texas Officials Blame Agency Gutted by Trump for Results of Deadly Storm  —  Experts warned for months about cuts to NWS and NOAA  —  As the best and the brightest were being fired at the National Weather Service and the National Oceanic and Atmospheric Administration by senseless … ",
    "url": "https://www.meidasplus.com/p/texas-officials-blame-agency-gutted"
  },
  {
    "text": "Justice Ketanji Brown Jackson Makes Herself Heard, Prompting a Rebuke  —  In solo dissents this term, the justice accused the conservative majority of lawless bias.  On the term's last day, Justice Amy Coney Barrett fired back.  —  Justice Ketanji Brown Jackson wrote just five majority opinions … ",
    "url": "https://www.nytimes.com/2025/07/05/us/supreme-court-ketanji-brown-jackson.html"
  },
  {
    "text": "‘The vehicle suddenly accelerated with our baby in it’: the terrifying truth about why Tesla's cars keep crashing  —  Elon Musk is obsessive about the design of his supercars, right down to the disappearing door handles.  But a series of shocking incidents - from drivers trapped in burning vehicles … ",
    "url": "https://www.theguardian.com/technology/2025/jul/05/the-vehicle-suddenly-accelerated-with-our-baby-in-it-the-terrifying-truth-about-why-teslas-cars-keep-crashing"
  },
  {
    "text": "Frantic Search for the Missing After At Least Six Killed in Texas Flood  —  The authorities confirmed that people had died as a result of the flooding along the Guadalupe River, but the scope of the disaster was not immediately clear.  —  At least six people were killed and frantic searches … ",
    "url": "https://www.nytimes.com/2025/07/04/us/texas-flooding-kerr-county-san-angelo.html"
  },
  {
    "text": "Trump ramps up deportation spectacle with new stunts and ICE funding … - It's an extraordinary shift from Trump's first term, when nationwide backlash and the appearance of cruelty forced the administration to abandon its family separation policy for unauthorized immigrants.",
    "url": "https://www.axios.com/2025/07/05/trump-migrants-alligator-alcatraz-denaturalize"
  },
  {
    "text": "Trump tariff letters going to a dozen countries Monday  —  President Trump said the U.S. will begin sending letters Monday to other countries setting a tariff rate on their imports. … - For businesses craving certainty, who've had a period of relative calm of late, the move could once again upset that balance.",
    "url": "https://www.axios.com/2025/07/05/trump-tariffs-letters"
  },
  {
    "text": "Trump DOJ Drops Cases Against Top MS-13 Leaders  —  The deal with Bukele comes with significant strings attached, it turns out.  —  When foreign criminals commit serious crimes in the United States, and particularly if they are leaders of violent transnational organizations who orchestrate … ",
    "url": "https://www.nationalreview.com/2025/07/trump-doj-drops-cases-against-top-ms-13-leaders/"
  },
  {
    "text": "Congo Braces for HIV Surge After U.S. Funding Stops  —  The virus is quickly spreading in what should be the country's most economically productive regions  —  The mineral-rich provinces of South and North Kivu along the eastern flank of the Democratic Republic of Congo should be among its most productive.",
    "url": "https://www.wsj.com/world/africa/us-funding-cuts-aids-congo-c3c35e56?st=fZuQUP&reflink=article_copyURL_share"
  },
  {
    "text": "No One is ‘Gutting’ the Safety Net  —  The GOP will have to rebut the Democratic and media distortions about their reforms or lose the 2026 election.  —  Democrats and their media collaborators always distort GOP policy, but the coverage about the big budget bill has kicked free of the earth.",
    "url": "https://www.wsj.com/opinion/no-one-is-gutting-the-safety-net-e3029eb4?st=juWtpC"
  },
  {
    "text": "What Trump—And the U.S.—Can't Understand About Air Strikes  —  American leaders refuse to learn from allies and overestimate the benefits of showy tactical attacks.  —  When Donald Trump ordered air strikes on key Iranian nuclear-enrichment sites last month and immediately declared … ",
    "url": "https://www.theatlantic.com/ideas/archive/2025/07/trump-iran-air-strikes/683428/?gift=BQHDq1p24LRO8cUUEyLQ6xjgX9LTp4pLeixFVIVpsTo"
  },
  {
    "text": "Judge transfers new case challenging South Sudan deportations  —  An administrative stay issued Friday morning will last until 4:30 p.m. Further action would have to come from Massachusetts.  Read the new claims at Law Dork.  —  After a hearing on Friday, U.S. District Judge Randolph Moss transferred … ",
    "url": "https://www.lawdork.com/p/breaking-judge-issues-administrative"
  },
  {
    "text": "CIA admits shadowy officer monitored Oswald before JFK assassination, new records reveal … - The linchpin document: A Jan. 17, 1963, CIA memo showing Joannides was directed to have an alias and fake driver's license bearing the name “Howard Gebler.”  — Until Thursday … ",
    "url": "https://www.axios.com/2025/07/05/cia-agent-oswald-kennedy-assassination"
  }
]