[
  {
    "text": "California Democrats Look to Redraw House Map Amid Texas Redistricting War  —  It was unclear how the agency would respond.  Democratic lawmakers left the state to stop Republicans from redrawing district maps to their advantage.  —  Senator John Cornyn of Texas asked the F.B.I. on Tuesday … ",
    "url": "https://www.nytimes.com/2025/08/05/us/politics/california-texas-redistricting-maps.html?unlocked_article_code=1.b08.u43x.4GJZQTkcORvw&smid=url-share"
  },
  {
    "text": "F.B.I. Is Asked to Arrest Texas Democrats in Battle Over House Seats  —  It was unclear how the agency would respond.  Democratic lawmakers left the state to stop Republicans from redrawing district maps to their advantage.  —  Senator John Cornyn of Texas asked the F.B.I. on Tuesday … ",
    "url": "https://www.nytimes.com/2025/08/05/us/politics/fbi-texas-democrats.html"
  },
  {
    "text": "RFK Jr. pulls $500 million in funding for vaccine development  —  The Department of Health and Human Services will cancel contracts and pull funding for some vaccines that are being developed to fight respiratory viruses like COVID-19 and the flu.  Robert F. Kennedy Jr. … ",
    "url": "https://apnews.com/article/kennedy-vaccines-mrna-pfizer-moderna-1fb5b9436f2957075064c18a6cbbe3c9"
  },
  {
    "text": "STAT+: Health secretary RFK Jr. shuts door on U.S. investment in mRNA vaccine research  —  Health secretary Robert F. Kennedy Jr. on Tuesday announced that the government's emergency preparedness agency will no longer fund work on messenger RNA vaccines, delivering a crippling blow … ",
    "url": "https://www.statnews.com/2025/08/05/mrna-vaccine-development-canceled-by-kennedy-hhs/"
  },
  {
    "text": "Chairman Comer Subpoenas Bill and Hillary Clinton, Former U.S. Attorneys General and FBI Directors, and Records Related to Jeffrey Epstein  —  WASHINGTON—House Committee on Oversight and Government Reform Chairman James Comer (R-Ky.) today issued deposition subpoenas to Bill and Hillary Clinton … ",
    "url": "https://oversight.house.gov/release/chairman-comer-subpoenas-bill-and-hillary-clinton-former-u-s-attorneys-general-and-fbi-directors-and-records-related-to-jeffrey-epstein/"
  },
  {
    "text": "Trump administration debating releasing transcript of Ghislaine Maxwell interview with DOJ, sources say  —  The Justice Department has an audio recording of the interview it conducted with Jeffrey Epstein associate Ghislaine Maxwell last month, and the administration is considering releasing … ",
    "url": "https://cnn.com/2025/08/05/politics/trump-blanche-epstein-maxwell-interview-transcript"
  },
  {
    "text": "Trump threatens federal takeover of D.C. after attack on DOGE worker  —  Trump floats taking federal control of the city after the man known online as ‘Big Balls’ was injured in a carjacking.  Elon Musk also says city should be taken over.  —  A protégé of Elon Musk … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2025/08/05/trump-doge-worker-washington-dc-crime/"
  },
  {
    "text": "Trump “happy to hear” DOJ launched grand jury probe of Obama officials  —  President Trump on Tuesday said he was “happy to hear” that Attorney General Pam Bondi directed federal prosecutors to launch a grand jury probe into the Obama administration's handling of the investigation into Russia's involvement in the 2016 election.",
    "url": "https://www.axios.com/2025/08/05/trump-obama-russia-bondi-grand-jury"
  },
  {
    "text": "There Is an Information Blackout at Florida's ‘Alligator Alcatraz’ Migrant Detention Camp  —  Public records related to Florida's so-called “Alligator Alcatraz” migrant detention camp have essentially disappeared into what one expert called a “black hole.”  Over 90 pages of contracts reviewed … ",
    "url": "https://talkingpointsmemo.com/muckraker/there-is-an-information-blackout-at-floridas-alligator-alcatraz-migrant-detention-camp"
  },
  {
    "text": "Exclusive: Trump administration to formally axe Elon Musk's ‘five things’ email  —  The Trump administration plans as soon as Tuesday to formally axe a program launched by billionaire former Trump adviser Elon Musk requiring federal employees to summarize their five workplace achievements from the prior week … ",
    "url": "https://www.reuters.com/legal/litigation/trump-administration-formally-axe-elon-musks-five-things-email-2025-08-05/"
  },
  {
    "text": "E.P.A. Moves to Cancel $7 Billion in Grants for Solar Energy  —  If finalized, the move would escalate the Trump administration's efforts to claw back billions of dollars in climate grants awarded under President Biden.  —  The Trump administration is preparing to terminate $7 billion … ",
    "url": "https://www.nytimes.com/2025/08/05/climate/epa-cancels-solar-energy-grants.html"
  },
  {
    "text": "ICE Offers, Then Quickly Withdraws, Cash Bonuses for Swiftly Deporting Immigrants  —  The short-lived effort underscores the mounting pressure on ICE to meet President Trump's aggressive deportation targets.  —  On Tuesday morning, Immigration and Customs Enforcement announced in an internal email … ",
    "url": "https://www.nytimes.com/2025/08/05/us/politics/ice-bonuses-immigrants-deportations.html?unlocked_article_code=1.b08.1O9s.-Sfp3uSMLawg&smid=url-share"
  },
  {
    "text": "Weather Service is now hiring back hundreds of positions that got cut in the DOGE chaos  —  The National Weather Service has received permission to hire 450 meteorologists, hydrologists and radar technicians just months after being hit hard by Department of Government Efficiency-related cuts and early retirement incentives.",
    "url": "https://cnn.com/2025/08/05/weather/nws-rehiring-doge-layoffs-climate"
  },
  {
    "text": "Watch CNBC's full interview with President Donald Trump  —  President Donald Trump joins ‘Squawk Box’ via phone to discuss the latest news affecting markets and the country's economic goals.  —  WATCH NOW  —  WATCH NOW  —  WATCH NOW  —  WATCH NOW  —  President Trump … ",
    "url": "https://www.cnbc.com/video/2025/08/05/watch-cnbcs-full-interview-with-president-donald-trump.html"
  },
  {
    "text": "A Look Inside Jeffrey Epstein's Manhattan Lair … A sculpture of a bride clinging to a rope dangled in a central atrium of Jeffrey Epstein's mansion.  —  As a gift for Jeffrey Epstein's 63rd birthday, friends sent letters in tribute to the wealthy financier and convicted sex offender.",
    "url": "https://www.nytimes.com/2025/08/05/us/jeffrey-epstein-mansion-photos.html?unlocked_article_code=1.b08.dOob.ioSkJfE1u_Fc&smid=url-share"
  },
  {
    "text": "Mike Flood Heckled at Town Hall Over Trump's Domestic Policy Bill … Representative Mike Flood, Republican of Nebraska, was booed almost as soon as he took the stage at the University of Nebraska-Lincoln on Monday night.Terry Ratzlaff for The New York Times",
    "url": "https://www.nytimes.com/2025/08/05/us/politics/mike-flood-town-hall.html"
  },
  {
    "text": "Trump plans to “take over” Gaza aid effort, U.S. officials say  —  Special envoy Steve Witkoff and President Trump discussed plans for the U.S. to significantly increase its role in providing humanitarian aid to Gaza in a meeting Monday evening at the White House, according to two U.S. officials … ",
    "url": "https://www.axios.com/2025/08/05/trump-gaza-aid-takeover-witkoff-meeting"
  },
  {
    "text": "Columbia and Brown to Disclose Admissions and Race Data in Trump Deal  —  A widely overlooked part of a settlement with the two universities could profoundly alter how elite schools determine who gets accepted.  —  As part of the settlements struck with two Ivy League universities in recent weeks … ",
    "url": "https://www.nytimes.com/2025/08/05/nyregion/columbia-brown-admissions-trump.html?unlocked_article_code=1.b08.5DME.vNLN-MVuy5Z2&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "White House Orders NASA to Destroy Important Satellite  —  The White House has instructed NASA employees to terminate two major, climate change-focused satellite missions.  —  As NPR reports, Trump officials reached out to the space agency to draw up plans for terminating the two missions, called the Orbiting Carbon Observatories.",
    "url": "https://futurism.com/white-house-orders-nasa-destroy-important-satellite"
  },
  {
    "text": "Miss United States Files Restraining Order Against GOP Rep. Cory Mills  —  Lindsey Langston, a Florida Republican state committeewoman and the reigning Miss United States, has filed a restraining order against Florida Republican Rep. Cory Mills, after reporting him to local and state law enforcement … ",
    "url": "https://www.dropsitenews.com/p/miss-united-states-lindsey-langston-files-restraining-order-rep-cory-mills"
  },
  {
    "text": "High-ranking FBI job losses disproportionately hurt women, people of color  —  Leaders are undertaking an unprecedented campaign to force senior officials off the job.  —  An unprecedented campaign by FBI leaders to force senior bureau officials out of their jobs has disproportionately hit women … ",
    "url": "https://www.msnbc.com/opinion/analysis/fbi-women-minorities-job-losses-kash-patel-rcna222988"
  },
  {
    "text": "What makes an American?  Three in 10 Republicans say: Being White.  —  There's a car in my neighborhood (and perhaps in yours, too) that sports a confounding pair of bumper stickers.  One advocates for making America great again, an idea recently popularized by marketing mogul Donald Trump.",
    "url": "https://www.pbump.net/o/what-makes-an-american-three-in-10-republicans-say-being-white/"
  },
  {
    "text": "New National UMass Amherst Poll Finds President Trump's Job Approval Gap Slides 6 Points Since April  —  The survey finds Trump's net approval drops to -20 six months into his term, while his approval rating on immigration falls 9 points since April; additionally, 70% say he has not handled Epstein situation … ",
    "url": "https://www.umass.edu/news/article/new-national-umass-amherst-poll-finds-president-trumps-job-approval-gap-slides-6"
  },
  {
    "text": "Pentagon keeps a lid on Golden Dome … The Space and Missile Defense Symposium in Huntsville this week typically showcases the Pentagon's missile defense priorities.  Organizers expect it will draw 7,300 attendees and 300 exhibitors this year, with Missile Defense Agency Director Lt. Gen. Heath Collins among the headliners.",
    "url": "https://www.politico.com/news/2025/08/05/pentagon-golden-dome-silence-00494365"
  },
  {
    "text": "Two Chinese Nationals Arrested on Complaint Alleging they Illegally Shipped to China Sensitive Microchips Used in AI Applications  —  For Immediate Release  —  Two Chinese nationals - one of them an illegal alien - have been arrested on a federal criminal complaint alleging they knowingly exported … ",
    "url": "https://www.justice.gov/opa/pr/two-chinese-nationals-arrested-complaint-alleging-they-illegally-shipped-china-sensitive"
  },
  {
    "text": "Trump administration violated impoundment law by canceling NIH grants, slowing new awards, GAO finds  —  Congressional watchdog concludes agency illegally failed to disburse billions in research funds  —  In a scathing report issued Tuesday, the Government Accountability Office found … ",
    "url": "https://www.statnews.com/2025/08/05/gao-says-nih-cuts-violated-impoundment-control-act/"
  },
  {
    "text": "Federal judge rules Trump administration cannot reallocate billions meant for disaster mitigation  —  A federal judge on Tuesday blocked the Trump administration from reallocating $4 billion meant to help communities protect against natural disasters.  U.S. District Judge Richard G. Stearns … ",
    "url": "https://apnews.com/article/fema-bric-grants-lawsuit-climate-disaster-b10c8d2783543f61c8e8562befdd8fa7"
  },
  {
    "text": "Trump ceded leverage over Putin by pausing sanctions, Democratic report says  —  Senate Democrats released the findings of their inquiry ahead of Trump's fast-approaching deadline for Russia to halt its fighting in Ukraine or face severe financial penalties.",
    "url": "https://www.washingtonpost.com/national-security/2025/08/05/trump-russia-putin-ukraine-democrats-report/"
  },
  {
    "text": "White House Upends Puerto Rico Oversight Board With Mass Firings  —  Takeaways by Bloomberg AI  —  Hide … Tell us how AI is shaping your news experience.  Share your feedback  —  The White House fired five of the seven board members of the federal watchdog that oversees Puerto Rico's finances … ",
    "url": "https://www.bloomberg.com/news/articles/2025-08-05/white-house-fires-most-of-puerto-rico-s-oversight-board-members"
  },
  {
    "text": "How ethnic stereotypes underlie Trump's agricultural vision  —  The Trump administration promises to spell out its vision for America's agriculture, but in the meantime, the president indicated on Tuesday that land should be owned by some Americans and farmed by migrant workers.",
    "url": "https://www.axios.com/2025/08/05/trump-farmland-workers-racial-stereotypes"
  }
]