[
  {
    "text": "Trump's Trade War Escalates as China Retaliates With 34% Tariffs  —  The Chinese government said it would match President Trump's tariff, and also barred a group of American companies from doing business in China.  —  China has struck back at President Trump on Friday.",
    "url": "https://www.nytimes.com/2025/04/04/business/china-trump-tariffs-retaliation.html"
  },
  {
    "text": "Breaking |  China hits back at US with 34% tariff on American imports in retaliation for Trump's duties  —  The tariff comes into effect on April 10 and is part of a raft of measures that includes more rare earths controls  —  China will impose a 34 per cent tariff on imported American goods … ",
    "url": "https://www.scmp.com/economy/china-economy/article/3305260/china-hits-back-us-34-tariff-american-imports-retaliation-trumps-move"
  },
  {
    "text": "“Horrifying”: Trump's Weird, Confused Rant to Media as Markets Tanked  —  After President Trump imposed sweeping tariffs on imports from all over the globe, prompting the markets to implode, he took a question about it on Thursday.  He ranted and rambled delusionally about how everything is just great.",
    "url": "https://newrepublic.com/article/193604/horrifying-trump-weird-confused-rant-media-markets-tanked"
  },
  {
    "text": "America's astonishing act of self-harm  —  Trump's tariffs will upend the global economic order and tarnish US prosperity  —  If it endures, Donald Trump's decision on April 2 2025 to enact sweeping “reciprocal” tariffs on US trade partners will go down as one of the greatest acts of self-harm in American economic history.",
    "url": "https://www.ft.com/content/21454c08-8e1c-4335-84f9-ef2d0e1aeb14?accessToken=zwAGMfCHA-tIkc8hRUwIjhxDNdOE-e8tDhrrFA.MEQCIGhK1gB2002a3MjTH8ZGlP57OOpCPySxTvb08L0yFkJGAiA_21H7smKf6t649nYXuNNgzKsk9oeiQLO16XZvy8guiw&sharetype=gift&token=fe91e897-3c4b-40a8-86d2-14854ac1023f"
  },
  {
    "text": "Transcript: Trump's Tariff Madness Can Be Stopped.  Here's How.  —  The following is a lightly edited transcript of the April 4 episode of the Daily Blast podcast.  Listen to it here.  —  Greg Sargent: This is The Daily Blast from The New Republic, produced and presented by the DSR network.",
    "url": "https://newrepublic.com/article/193607/transcript-trump-tariff-madness-can-stopped-here-how"
  },
  {
    "text": "Republicans play powerless as Trump tariff fears sweep across the globe  —  While GOP lawmakers could stop the presidential levies, they made clear they would not do so anytime soon.  —  Faced with President Donald Trump's sweeping new tariffs, Wall Street traders voted with their dollars Thursday … ",
    "url": "https://www.politico.com/news/2025/04/03/trump-tariffs-congress-republicans-powerless-00271537"
  },
  {
    "text": "China to impose 34% retaliatory tariff on all goods imported from the U.S. … WATCH NOW  —  China's Finance Ministry on Friday said it will impose a 34% tariff on all goods imported from the U.S. starting on April 10, following duties imposed by U.S. President Donald Trump's administration earlier this week.",
    "url": "https://www.cnbc.com/2025/04/04/china-to-impose-34percent-retaliatory-tariff-on-all-goods-imported-from-the-us.html"
  },
  {
    "text": "National Security Agency and Cyber Command chief Gen. Timothy Haugh ousted  —  The director of the NSA, the powerful wiretapping and cyber espionage service, was fired and reassigned Thursday, according to U.S. officials.  —  just now  —  The director of the powerful wiretapping … ",
    "url": "https://www.washingtonpost.com/national-security/2025/04/03/nsa-director-fired-tim-haugh/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQzNjUyODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ1MDM1MTk5LCJpYXQiOjE3NDM2NTI4MDAsImp0aSI6ImU5MGYyZTIyLTZlMWUtNDI5Ny1iODVmLTRkMmNhNTM5ZDJhMiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb25hbC1zZWN1cml0eS8yMDI1LzA0LzAzL25zYS1kaXJlY3Rvci1maXJlZC10aW0taGF1Z2gvIn0.7AVXq6PGEYYtSiu9nV1l4fhRg0-IrJpb6HtYrKyQ0Yo&itid=gfta"
  },
  {
    "text": "Head of National Security Agency and Cyber Command Is Ousted  —  No reason was given for the removal of Gen. Timothy D. Haugh, but the far-right activist Laura Loomer had called for his ouster in a meeting with President Trump, an official said.  —  The head of the National Security Agency … ",
    "url": "https://www.nytimes.com/2025/04/03/us/politics/nsa-cyber-command-chief-fired.html?unlocked_article_code=1.9E4.h78r.muOL8d3IxEvb&smid=url-share"
  },
  {
    "text": "South Korean court removes president from office, says he violated duties  —  The Constitutional Court upheld the impeachment of President Yoon Suk Yeol over his attempt to impose martial law, a decision expected to exacerbate political divisions.  —  Just now",
    "url": "https://www.washingtonpost.com/world/2025/04/03/south-korea-president-removed-martial-law/"
  },
  {
    "text": "Jubilation in South Korea After President Who Declared Martial Law Is Ousted  —  The nation's top court unanimously upheld the impeachment of Yoon Suk Yeol, clearing the way for the election of a new president.  —  Here's the latest.  —  South Korea's top court voted unanimously to dismiss … ",
    "url": "https://www.nytimes.com/live/2025/04/03/world/south-korea-yoon?unlocked_article_code=1.9E4.i2b6.EEITEAhitQBA&smid=url-share"
  },
  {
    "text": "Social Security faces thousands more job cuts even with service in tailspin  —  The agency has already seen 7,000 job losses from dramatic cost-cutting efforts by Trump and Musk — even as they promise no benefit reductions.  —  Just now  —  The Social Security Administration … ",
    "url": "https://www.washingtonpost.com/politics/2025/04/04/social-security-layoffs-trump-musk/"
  },
  {
    "text": "The American Age Is Over  —  1. Canada  —  Fittingly, it was the Canadian prime minister, Mark Carney, who declared the official time of death. … And just like that, the age of American empire, the great Pax Americana, ended.  —  Share  —  We cannot overstate what has just happened.",
    "url": "https://www.thebulwark.com/p/the-american-age-is-over"
  },
  {
    "text": "Poll: AOC leads Schumer in head-to-head New York primary matchup by double digits  —  The liberal group Data For Progress conducted the survey of likely Democratic voters.  —  Alexandria Ocasio-Cortez is leading Chuck Schumer by double digits in a new head-to-head poll of the 2028 New York primary.",
    "url": "https://www.politico.com/news/2025/04/04/schumer-aoc-poll-primary-new-york-030621"
  },
  {
    "text": "Trump's VA is ending a rescue program that's saved 17,000 military veterans' homes  —  The U.S. Department of Veterans Affairs said Thursday that it will end a mortgage-rescue program designed to help veterans who have fallen behind on their mortgages keep their homes.",
    "url": "https://www.npr.org/2025/04/03/nx-s1-5351768/trumps-va-is-ending-a-rescue-program-thats-saved-17-000-military-veterans-homes"
  },
  {
    "text": "Which jobs were cut at CDC?  Here's a list.  —  The Trump administration wants the agency to focus on infectious disease.  Other areas of public health were hit hardest.  —  The layoffs at CDC this week hit global and environmental health as well as HIV prevention programs especially hard … ",
    "url": "https://www.politico.com/news/2025/04/03/which-jobs-were-cut-at-cdc-heres-a-list-00271509"
  },
  {
    "text": "Boasberg signals he may hold Trump officials in contempt over deportation flights  —  The federal judge grilled a DOJ lawyer about whether the administration had tried to evade a court order.  —  A frustrated federal judge is strongly considering holding Trump administration officials … ",
    "url": "https://www.politico.com/news/2025/04/03/judge-boasberg-contempt-trump-deportations-00271484"
  },
  {
    "text": "Republicans want to move on tax cuts.  The world keeps intervening.  —  If you talk to Speaker Mike Johnson or Senate Majority Leader John Thune, one thing becomes immediately evident: they wish they could devote all of their time and energy to passing President Donald Trump's tax-and-spending-cut agenda.",
    "url": "https://punchbowl.news/article/policy/gop-tax-cuts-trump-washington/"
  },
  {
    "text": "Trump layoffs begin to erode FDA drug review system  —  The Trump administration's mass firings at the U.S. Food and Drug Administration have removed employees critical to reviewing new medicines, setting back years of effort to bring promising treatments to patients more quickly, former and current FDA sources told Reuters.",
    "url": "https://www.reuters.com/business/healthcare-pharmaceuticals/trump-layoffs-begin-erode-fda-drug-review-system-2025-04-04/"
  },
  {
    "text": "Trump Administration Set to Pause $510 Million for Brown University  —  The administration has now targeted five schools' federal funding as part of a pledge to combat what it considers to be antisemitism on university campuses.  —  The Trump administration intends to block $510 million … ",
    "url": "https://www.nytimes.com/2025/04/03/us/trump-administration-brown-university-funding-pause.html"
  },
  {
    "text": "The Failed Ideas That Drive Elon Musk  —  President Trump has reportedly told cabinet members that Elon Musk may soon leave the administration.  If and when he goes, what will he leave behind?  —  Mr. Musk has long presented himself to the world as a futurist.",
    "url": "https://www.nytimes.com/2025/04/04/opinion/elon-musk-doge-technocracy.html"
  }
]