[
  {
    "text": "Fox News is helping Trump plan another Jan. 6-style assault on democracy  —  Five months before the election, claims that only fraud could explain a future Trump defeat are already common in the right-wing media ecosystem.  —  The cycle of lies that drove the Jan. 6, 2021, insurrection is again underway.",
    "url": "https://www.msnbc.com/opinion/msnbc-opinion/fox-news-trump-election-2024-disinformation-rcna157770"
  },
  {
    "text": "Fox News Poll: Three-point shift in Biden-Trump matchup since May  —  32% give the economy positive marks, a record-high during Biden's presidency  —  Join Fox News for access to this content  —  President Biden is the frontrunner in a hypothetical matchup against former President Trump … ",
    "url": "https://www.foxnews.com/official-polls/fox-news-poll-three-point-shift-biden-trump-matchup-since-may"
  },
  {
    "text": "Why Dictators Want Trump … We're big fans both of decarbonization and of reliable electricity, so two thumbs up on this one from us!  (One assumes the Democrats don't mind the job creation, either?)  Happy Thursday.  —  The Real World  —  Things are hopping in American politics.",
    "url": "https://www.thebulwark.com/p/why-dictators-want-trump"
  },
  {
    "text": "CNN debate stage set with Trump and Biden going head-to-head  —  President Joe Biden and former President Donald Trump are set for a historic showdown, with the stage now set for CNN's June 27 presidential debate.  —  The showdown will make history as the first debate between a sitting president and a former president.",
    "url": "https://www.cnn.com/2024/06/20/politics/cnn-debate-trump-biden/"
  },
  {
    "text": "Supreme Court Upholds Trump-Era Tax Provision  —  The tax dispute, which was closely watched by experts, involved a one-time foreign income tax, but many saw it as a broader challenge to pre-emptively block Congress from passing a wealth tax.  —  The Supreme Court on Thursday upheld a tax … ",
    "url": "https://www.nytimes.com/2024/06/20/us/politics/supreme-court-tax-case-trump.html"
  },
  {
    "text": "Illinois Republican Chair Resigns, Slams Colleagues Weeks Before Convention  —  Party Chair Don Tracy is resigning from his political post, and has condemned colleagues for choosing to fight each other rather than the  —  , in a letter explaining his decision.",
    "url": "https://www.newsweek.com/illinois-republican-chair-resigns-slams-colleagues-weeks-before-convention-1915090"
  },
  {
    "text": "Trump Media shares sink 12% as DJT slide accelerates … A sell-off of Trump Media picked up speed Thursday, with shares of former President Donald Trump's company falling about 12% shortly after the opening bell.  —  The company behind the conservative social media app Truth Social … ",
    "url": "https://www.cnbc.com/2024/06/20/djt-trump-media-stock-price-today.html"
  },
  {
    "text": "The Delusion of “Advanced” Plastic Recycling  —  LAST YEAR, I became obsessed with a plastic cup.  —  It was a small container that held diced fruit, the type thrown into lunch boxes.  And it was the first product I'd seen born of what's being touted as a cure for a crisis.",
    "url": "https://www.propublica.org/article/delusion-advanced-chemical-plastic-recycling-pyrolysis"
  },
  {
    "text": "June 2024 State Polls: Trump Maintains Edge over Biden  —  Democratic US Senate Candidates Outperforming Biden  —  New Emerson College Polling/The Hill state polls find former President Donald Trump with a slight edge on President Joe Biden in Arizona (47% to 43%), Georgia (45% to 41%) … ",
    "url": "https://emersoncollegepolling.com/june-2024-state-polls-trump-maintains-edge-over-biden/"
  },
  {
    "text": "These 25 rainbow-flag waving companies donated $18 million to anti-gay politicians since the last election  —  At the pride parade in Washington, D.C., earlier this month, accounting giant Deloitte promoted its support of the LGBTQ community:  —  In June 2023, Deloitte produced a report on “LGBT+ Inclusion @ Work.”",
    "url": "https://popular.info/p/these-25-rainbow-flag-waving-companies"
  },
  {
    "text": "Wikipedia now labels the top Jewish civil rights group as an unreliable source  —  Wikipedia's editors declared that the Anti-Defamation League cannot be trusted to give reliable information on the Israel-Palestine conflict, and they overwhelmingly said the ADL is an unreliable source on antisemitism.",
    "url": "https://www.cnn.com/2024/06/19/media/wikipedia-adl/"
  },
  {
    "text": "Supreme Court gets ready to drop its bombshells … - The court has 23 cases left to decide, and will likely hand down all of those opinions by the end of the month, give or take a few days — meaning the next week or so may redefine the limits of presidential power for generations to come.",
    "url": "https://www.axios.com/2024/06/20/supreme-court-rulings-trump-abortion"
  },
  {
    "text": "Democrats seek to repeal Comstock abortion rule, fearing Trump crackdown  —  The Comstock Act, an 1873 law that bans abortion-related materials from being sent through the mail, could be used by the GOP to restrict abortion nationwide.  —  Democrats are seeking to overhaul an 1873 federal law … ",
    "url": "https://www.washingtonpost.com/health/2024/06/20/comstock-abortion-repeal-tina-smith-senate/"
  },
  {
    "text": "Trump's Favorite Judge Puts Mar-a-Lago Prosecutor on Trial  —  ADVANTAGE: TRUMP  —  Judge Aileen Cannon stalled the ex-president's trial for hoarding classified documents.  Now she's making Special Counsel Jack Smith prove the case should be brought at all.  —  The tables have turned.",
    "url": "https://www.thedailybeast.com/trumps-favorite-judge-puts-mar-a-lago-prosecutor-on-trial"
  },
  {
    "text": "U.S. to Redirect Air-Defense Missile Deliveries to Ukraine  —  Other American allies and partners with contracts for interceptor missiles will face delays  —  The Biden administration will rush the delivery of air-defense interceptors to Ukraine by halting delivery to allied nations, U.S. administration officials said.",
    "url": "https://www.wsj.com/politics/national-security/u-s-to-redirect-air-defense-missile-deliveries-to-ukraine-e2753a20"
  },
  {
    "text": "Putin Once Tried to Curb North Korea's Nuclear Program.  That's Now Over.  —  Vladimir Putin promised unspecified technological help to North Korea, which could allow it to advance its nuclear weapons program.  —  阅读.体中文.閱讀.體中文.",
    "url": "https://www.nytimes.com/2024/06/19/us/politics/putin-kim-russia-nuclear.html"
  }
]