[
  {
    "text": "The Proud Boys and Militias Come to Tesla's Defense  —  After weeks of “Tesla Takedown” protests, extremist groups are showing up to back Elon Musk's beleaguered car company.  —  Over the weekend, thousands of people joined the “Tesla Takedown” protest movement at the company's showrooms across the country.",
    "url": "https://www.wired.com/story/proud-boys-and-militias-come-to-teslas-defense/"
  },
  {
    "text": "Estimates Imply That Burden of Tariffs Could Fall Heavily on Consumers  —  A White House trade adviser projected that tariffs would raise about $6 trillion over the next decade.  But raising so much revenue for the government conflicts with the administration's goal of reshoring manufacturing.",
    "url": "https://www.nytimes.com/2025/03/31/us/politics/tariffs-estimates-consumers.html"
  },
  {
    "text": "Trump to Unveil Country-Based Tariffs April 2 in Rose Garden … President Donald Trump will announce his reciprocal tariff push on Wednesday during an event in the White House Rose Garden, his top spokeswoman said.  —  White House Press Secretary Karoline Leavitt said Monday the announcement would feature “country-based” tariffs.",
    "url": "https://www.bloomberg.com/news/articles/2025-03-31/trump-to-unveil-country-based-tariffs-april-2-in-rose-garden"
  },
  {
    "text": "Marine Le Pen barred from running for French presidency in 2027  —  Far-right leader found guilty of embezzlement of European funds and immediately barred from running for office  —  The French far-right leader Marine Le Pen has been barred from running for president in 2027 after a court found … ",
    "url": "https://www.theguardian.com/world/2025/mar/31/marine-le-pen-barred-from-running-for-french-presidency-in-2027"
  },
  {
    "text": "France's far-right leader Le Pen sentenced to prison and banned from office in embezzlement trial  —  Le Pen may still appeal the four-year sentence, two years of it suspended, and five-year political ban, which came after she was found guilty of misusing $3 million to pay party staff.",
    "url": "https://www.nbcnews.com/news/world/france-le-pen-marine-guilty-right-national-rally-paris-embezzlement-rcna198816"
  },
  {
    "text": "Republican Operative Nicholas Jacobs Locks Twitter After Elon Musk Check Controversy  —  Jacobs received a $1M check from Musk at a rally in support of Brad Schimel  —  Nicholas Jacobs, chair of the Wisconsin College Republicans and a rising GOP operative, has locked his Twitter account … ",
    "url": "https://meidasnews.com/news/republican-operative-nicholas-jacobs-locks-twitter-after-elon-musk-check-controversy"
  },
  {
    "text": "John Roberts created a monster.  It's about to eat him.  —  ✍️ ⚖️ ✍️ With corporate outlets obeying in advance, supporting independent political media is more important right now than ever.  Public Notice is possible thanks to paid subscribers.",
    "url": "https://www.publicnotice.co/p/john-roberts-trump-supreme-court-2025"
  },
  {
    "text": "I'm tired of being mocked and hated because I'm a conservative woman  —  As a conservative woman living in Texas, I often feel like I'm living a dual reality.  I'm a mom and a writer, but that's not all.  I go to church, laugh with friends and wave at my neighbors while we are walking our dogs.",
    "url": "https://www.yahoo.com/news/im-tired-being-mocked-hated-090530234.html"
  },
  {
    "text": "DOGE Accesses Federal Payroll System Over Objections of Career Staff  —  Elon Musk's team gains visibility into sensitive information about hundreds of thousands of government workers despite security concerns raised by IT officials.  —  Members of Elon Musk's cost-cutting Department … ",
    "url": "https://www.nytimes.com/2025/03/31/us/politics/doge-musk-federal-payroll.html?unlocked_article_code=1.8E4.xODT.4Bkvc9BGqcL4&smid=url-share"
  },
  {
    "text": "American progress in peril  —  The U.S. is freezing research funding, canceling projects, firing thousands of federal scientists and creating an atmosphere of uncertainty that scientists warn could slam the brakes on progress.  —  Why it matters: America has enjoyed decades of dominance … ",
    "url": "https://www.axios.com/2025/03/31/us-science-china-trump"
  },
  {
    "text": "The Pragmatic And Moral Case To Sell Your Tesla  —  If you were waiting for a sign, this is it.  It's time to sell.  —  When I tell strangers my job is to review cars for a living, the most common response is “What do you think of Tesla?”  For well over a decade, Tesla has been the strange … ",
    "url": "https://insideevs.com/features/755057/tesla-sell-victoria-scott-musk/"
  },
  {
    "text": "Trump Commutes the Sentence of Another Hunter Biden Business Associate  —  Jason Galanis had pleaded guilty to his role in two fraud schemes before cooperating with Republican congressional investigations into the Bidens.  —  President Trump last week commuted the lengthy fraud sentence … ",
    "url": "https://www.nytimes.com/2025/03/31/us/politics/trump-hunter-biden-jason-galanis.html"
  },
  {
    "text": "New FDA commissioner agreed to oust top vaccine regulator after private swearing-in  —  The forced resignation of Peter Marks has unsettled scientists and researchers.  —  Food and Drug Administration Commissioner Marty Makary signed off on the ouster of top vaccine official Peter Marks shortly … ",
    "url": "https://www.politico.com/news/2025/03/31/new-fda-commissioner-signed-off-on-ousting-top-vaccine-regulator-after-private-swearing-in-00260582"
  },
  {
    "text": "Transcript: Trump Text Fiasco Worsens as Knives Come Out for Hegseth  —  The following is a lightly edited transcript of the March 31 episode of the Daily Blast podcast.  Listen to it here.  —  Greg Sargent: This is The Daily Blast from The New Republic, produced and presented by the DSR network.",
    "url": "https://newrepublic.com/article/193361/transcript-trump-text-fiasco-worsens-knives-come-hegseth"
  },
  {
    "text": "America's Future Is Hungary  —  MAGA conservatives love Viktor Orbán.  But he's left his country corrupt, stagnant, and impoverished.  —  flashy hotels and upmarket restaurants now dominate the center of Budapest, a city once better known for its shabby facades.",
    "url": "https://www.theatlantic.com/magazine/archive/2025/05/viktor-orban-hungary-maga-corruption/682111/?gift=hVZeG3M9DnxL4CekrWGK3x9sHVa0LDGR9gcTv0mlsRo&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "How to Save a Democracy  —  Americans Can Learn From Opponents of Authoritarianism Elsewhere  —  The first few weeks of Donald Trump's second presidency have accelerated a process of democratic erosion in the United States.  In just two months, the president and his allies have issued executive orders … ",
    "url": "https://www.foreignaffairs.com/united-states/how-save-democracy-trump"
  },
  {
    "text": "Where Do You Draw the Line?  —  While I concede the legality of the administration's move against Rumeysa Öztürk, I reject its morality and prudence.  —  Last year, a Turkish graduate student at Tufts University named Rumeysa Öztürk co-wrote an op-ed … ",
    "url": "https://www.nationalreview.com/2025/03/where-do-you-draw-the-line/"
  },
  {
    "text": "136. Setting the Record Straight on the Anti-Trump Injunctions  —  Welcome back to “One First,” a weekly newsletter that aims to make the U.S. Supreme Court more accessible to all of us.  —  Every Monday morning, I'll be offering an update on goings-on at the Court (\"On the Docket\"); … ",
    "url": "https://www.stevevladeck.com/p/136-setting-the-record-straight-on"
  },
  {
    "text": "How the Social Security Administration and DOGE are gaslighting Americans  —  The Social Security Administration (SSA) sent an email on March 27 to beneficiaries saying that reports that field offices were closing was an invention of fake news media.  “Recent reports in the media that the … ",
    "url": "https://popular.info/p/how-the-social-security-administration-fff"
  },
  {
    "text": "Chuck Schumer Is Pushing Young People Away From the Democratic Party With His Toothless Leadership  —  In this op-ed, a former Schumer staffer explains why they blame their former boss for the party's failures.  —  I walked away from my job as a writer for Senator Chuck Schumer after realizing … ",
    "url": "https://www.teenvogue.com/story/chuck-schumer-young-people-democratic-party"
  },
  {
    "text": "U.S. Has Spent $40 Million to Jail About 400 Migrants at Guantánamo  —  The disclosure of the tab so far came after a visit by five senators to the offshore operation, who condemned it as a waste of resources.  —  Five senators who visited the U.S. base at Guantánamo Bay … ",
    "url": "https://www.nytimes.com/2025/03/31/us/politics/migrants-guantanamo-costs.html"
  },
  {
    "text": "Bodies of missing aid workers found in Gaza ‘mass grave’ following Israeli attacks  —  The bodies of more than a dozen aid workers have been recovered in southern Gaza from what a United Nations agency described as a “mass grave,” a week after they went missing following attacks by Israeli forces.",
    "url": "https://cnn.com/2025/03/31/middleeast/aid-workers-found-gaza-mass-grave-intl-hnk/"
  },
  {
    "text": "China, Japan, South Korea will jointly respond to US tariffs, Chinese state media says  —  China, Japan and South Korea agreed to jointly respond to U.S. tariffs, a social media account affiliated with Chinese state broadcaster CCTV said on Monday.  —  The comments came after the three countries held … ",
    "url": "https://www.reuters.com/world/china-japan-south-korea-will-jointly-respond-us-tariffs-chinese-state-media-says-2025-03-31/"
  },
  {
    "text": "MAGA is Bad for Business  —  One odd feature of U.S. politics is that businesspeople, especially small business owners, always seems to believe that they will do better under Republicans, even though history shows that business does better under Democrats.  Small business owners supported Trump … ",
    "url": "https://paulkrugman.substack.com/p/autocracy-is-bad-for-business"
  },
  {
    "text": "Most Americans Say They Are Tuned In to News About the Trump Administration  —  Far fewer are hearing about the administration's relationship with the media than was the case early in Trump's first term  —  Table of Contents Table of Contents  —  Far fewer are hearing … ",
    "url": "https://www.pewresearch.org/journalism/2025/03/31/most-americans-say-they-are-tuned-in-to-news-about-the-trump-administration/"
  },
  {
    "text": "‘Obstructing justice’: Judge holds ICE agent in contempt over detention of defendant mid-trial  —  A Boston Municipal Court judge has held an Immigration and Customs Enforcement agent in contempt for allegedly obstructing justice when agents arrested a defendant in the middle of his jury trial last week.",
    "url": "https://www.bostonglobe.com/2025/03/31/metro/ice-detention-defendant-trial-judge-investigation/"
  },
  {
    "text": "The issues where Trump's approval is strongest and weakest, according to a new AP-NORC poll  —  Immigration remains a strength for President Donald Trump, but his handling of tariffs is getting more negative feedback, according to a poll from The Associated Press-NORC Center for Public Affairs Research.",
    "url": "https://apnews.com/article/trump-poll-immigration-tariffs-trade-b7a430909606d6b8b27cfbc5049a32b4"
  },
  {
    "text": "Lucy McBath suspends bid for governor as husband battles cancer  —  Georgia Democrat leaves door open for a bid for Georgia's top job, but her decision adds uncertainty to 2026 race to replace Brian Kemp  —  Democratic U.S. Rep. Lucy McBath is stepping back from a run for Georgia governor … ",
    "url": "https://www.ajc.com/politics/lucy-mcbath-suspends-bid-for-governor-as-husband-battles-cancer/WK3WBT2BA5EGDHXSKDXTXIS6ZA/"
  },
  {
    "text": "Louisiana voters reject constitutional amendments championed by Republican governor  —  Louisiana voters soundly rejected four constitutional amendments championed by Republican Gov. Jeff Landry related to crime, courts and finances.  Voters said no to each amendment by margins exceeding 60% … ",
    "url": "https://apnews.com/article/louisiana-constitutional-amendments-landry-c9a48606790251bdddb84978eea382ea"
  },
  {
    "text": "Why Trump Says He's ‘Not Joking’ About a Third Term  —  Donald Trump's interest in seeking an unconstitutional third term as president, like many of his most dangerous or illegal ideas, began as a joke.  Trump would muse on the stump that he deserved an extra term because he was robbed of his first … ",
    "url": "https://www.theatlantic.com/politics/archive/2025/03/trump-third-term/682243/"
  },
  {
    "text": "White House says Signal controversy is ‘closed’  —  The White House said Monday that its probe into how a journalist was added to a group chat of officials discussing military strikes is closed, as the administration seeks to move past the controversy.  —  “This case has been closed … ",
    "url": "https://thehill.com/homenews/administration/5223852-white-house-probe-journalist/"
  }
]