[
  {
    "text": "'It's very possible': Trump floats imprisoning his political opponents  —  Discussing his guilty verdict, Trump said his opponents were going down a “terrible path.”  —  Fresh off last week's historic guilty verdict, former President Donald Trump had a warning for his political opponents on Tuesday.",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-floats-imprisoning-political-opponents-rcna155543"
  },
  {
    "text": "Behind the Curtain: MAGA's jail plan … Nowhere would that be truer than at the Justice Department, which Trump wants to make his fief and retribution arm.  —  Bannon told us Bragg could be targeted using the 14th Amendment (equal protection) and Fourth Amendment (outlawing unreasonable searches … ",
    "url": "https://www.axios.com/2024/06/05/trump-alvin-bragg-election-2024-jail"
  },
  {
    "text": "Judge Cannon expands hearing on Trump's request to declare special counsel's appointment invalid  —  Judge Aileen Cannon is planning on holding a sprawling hearing on Donald Trump's request to declare Jack Smith's appointment as special counsel invalid, signaling the judge could be more willing … ",
    "url": "https://www.cnn.com/2024/06/04/politics/cannon-trump-special-counsel-hearing"
  },
  {
    "text": "Scoop: Senate Dem campaigns ready abortion rights blitz … - Campaigns in all battleground states will partake, a Democratic Senatorial Campaign Committee aide told Axios.  — The blitz will include paid advertising from the DSCC, events hosted by campaigns and local organizations, and social media activity.",
    "url": "https://www.axios.com/2024/06/05/abortion-rights-blitz-democrats"
  },
  {
    "text": "Israel Secretly Targets U.S. Lawmakers With Influence Campaign on Gaza War  —  Israel's Ministry of Diaspora Affairs ordered the operation, which used fake social media accounts urging U.S. lawmakers to fund Israel's military, according to officials and documents about the effort.",
    "url": "https://www.nytimes.com/2024/06/05/technology/israel-campaign-gaza-social-media.html"
  },
  {
    "text": "Behind Closed Doors, Biden Shows Signs of Slipping  —  Participants in meetings said the 81-year-old president performed poorly at times.  The White House said Biden is sharp and his critics are playing partisan politics.  —  WASHINGTON—When President Biden met with congressional leaders … ",
    "url": "https://www.wsj.com/politics/policy/joe-biden-age-election-2024-8ee15246"
  },
  {
    "text": "The facts about Biden's new immigration policy  —  On Tuesday, President Joe Biden announced executive actions that would impose sweeping changes to how the nation treats asylum seekers.  Anyone who attempts to cross the border outside of a designated port of entry will be considered presumptively ineligible … ",
    "url": "https://popular.info/p/the-facts-about-bidens-new-immigration"
  },
  {
    "text": "Trump's VP search accelerates  —  Prospective running mates have received vetting materials as the race for the No. 2 spot on Trump's ticket narrows to three or four candidates, sources tell NBC News.  —  Donald Trump's search for a running mate is intensifying, as the former president awaits sentencing … ",
    "url": "https://www.nbcnews.com/politics/2024-election/trumps-vp-search-accelerates-rcna155607"
  },
  {
    "text": "Russia's Gas Giant Reports Costly Impact of Putin's War  —  The gas giant Gazprom, which has been an engine of Russia's economy, will pay a decadelong price for Russian leader  —  's invasion of Ukraine.  —  The U.K. newspaper Financial Times reported Wednesday that it had seen research commissioned … ",
    "url": "https://www.newsweek.com/gas-gazprom-putin-war-costly-impact-1908467"
  },
  {
    "text": "NY's Dem governor indefinitely halts congestion pricing plan, putting party over climate  —  Democrats reportedly concerned about how New York congestion pricing plan could hurt the party in November elections  —  Join Fox News for access to this content  —  New York Gov. Kathy Hochul … ",
    "url": "https://www.foxnews.com/politics/ny-dem-governor-indefinitely-halts-congestion-pricing-plan-putting-party-over-climate"
  },
  {
    "text": "MSNBC Host Chris Hayes Guffaws At Matt Gaetz's ‘Law’ Defense Of Trump  —  The cable news channel has been yukking it up lately at Republican antics.  —  LOADING  —  MSNBC's Chris Hayes on Tuesday nearly busted a gut laughing at Rep. Matt Gaetz (R-Fla.) for his declaration that he loves the law and has given his life for it.",
    "url": "https://www.huffpost.com/entry/chris-hayes-laughs-matt-gaetz_n_666046dfe4b0f507c438bed6"
  },
  {
    "text": "Gunman captured after shootout outside US Embassy in Lebanon  —  The Lebanese army said Wednesday a gunman attempted to attack the U.S. embassy near Beirut.  The Lebanese military in a statement said that soldiers shot an assailant, who they only described as a Syrian national.",
    "url": "https://apnews.com/article/lebanon-us-embassy-attack-mideast-gaza-war-437056f046228d5ef6004ca46adb68c0"
  },
  {
    "text": "Most young people aren't liberals  —  We have the same concerns as the rest of the electorate … Joe Biden is losing ground with young voters.  —  In 2020, Biden won 60% of voters aged 18-29, compared to 37% for Trump and 3% for third parties, according to figures from Catalist.",
    "url": "https://www.slowboring.com/p/most-young-people-arent-liberals"
  },
  {
    "text": "What Donald Trump's Criminal Trial Reveals About a Potential Second Trump Administration  —  The picture that emerged in the New York courtroom was of a person on top of details, aware of what his team is doing.  Along with outside events, it suggests Trump will be even less constricted by rules and norms than he was before.",
    "url": "https://www.propublica.org/article/donald-trump-criminal-trial-second-term"
  },
  {
    "text": "Conservative attacks on birth control could threaten access  —  Far-right conservatives are sowing misinformation that inaccurately characterizes IUDs, emergency contraception, even birth-control pills as causing abortions  —  Republican lawmakers in Missouri blocked a bill to widen access … ",
    "url": "https://www.washingtonpost.com/health/2024/06/05/birth-control-access-abortion-ban/"
  },
  {
    "text": "Gaps and Forms: Hunter Biden's Defense  —  The first day of the Hunter Biden trial revealed a lot about gaps in the prosecution's case and Abbe Lowell's plan to mount a defense.  —  As this post will show, it will be easier for prosecutors to prove Count 3, Possession of a Firearm by a Drug User … ",
    "url": "https://www.emptywheel.net/2024/06/05/gaps-and-forms-hunter-bidens-defense/"
  },
  {
    "text": "Playbook: Inside Dems' Bibi breach  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  IN MEMORIAM — Ben White, a longtime POLITICO reporter and Morning Money author who also worked for CNBC, the NYT, the FT, WaPo and The Messenger, died Saturday at 52 … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/06/05/inside-dems-bibi-breach-00161702"
  },
  {
    "text": "Alabama federal judges forced LGBTQ advocates into a long, secretive “inquiry”  —  This is Part 1 of a two-part report.  Part 2 was published Wednesday.  —  In the midst of the wave of anti-LGBTQ laws being passed across the nation in recent years, many of the nation's leading LGBTQ civil rights lawyers … ",
    "url": "https://www.lawdork.com/p/alabama-judges-lgbtq-lawyers-inquiry-part-1"
  },
  {
    "text": "US maternal mortality rate far higher than in peer nations, report finds  —  Alarming disparities persist, particularly between white and Black mothers, according to new report by Commonwealth Fund  —  The US has a far higher rate of maternal mortality than other peer wealthy nations … ",
    "url": "https://www.theguardian.com/global-development/article/2024/jun/05/maternal-mortality-rate"
  },
  {
    "text": "NYC's Job Boom Is Fueled by Taxpayer-Funded $38,280 Health Gigs  — Almost all the gains were in publicly funded home health care  — Construction, manufacturing, retail lag behind 2020 levels  —  New York Mayor Eric Adams likes to boast that since he took office in January 2022 … ",
    "url": "https://www.bloomberg.com/news/articles/2024-06-05/nyc-s-job-boom-is-fueled-by-taxpayer-funded-38-280-health-gigs"
  }
]