[
  {
    "text": "Kamala Harris Has an Unexpected Ally  —  Bret Stephens: Please don't tell me you're going to ask how I'm going to vote.  —  Gail Collins: Well, Bret, why would you imagine such a thing?  Just because I keep getting stopped by people on the street, demanding to know whether you're going to support Kamala Harris.",
    "url": "https://www.nytimes.com/2024/10/21/opinion/kamala-harris-ally.html"
  },
  {
    "text": "“Election protection” activist says he plans to flag voters with “Hispanic-sounding” names as “suspicious”  —  In a video obtained by CBS News, the leader of an “election protection” activist group of 1,800 volunteers in North Carolina is seen instructing attendees at a virtual meeting to flag voters with … ",
    "url": "https://www.cbsnews.com/news/election-integrity-north-carolina-voters-hispanic-sounding-names/"
  },
  {
    "text": "Harris leads Trump 2-1 among the earliest voters, many driven by abortion access: new poll  —  Democrat Kamala Harris has a sweeping lead over Republican Donald Trump − among voters who have already cast their ballots, that is.  —  A new USA TODAY/Suffolk University Poll shows … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/10/21/harris-leads-trump-early-voting-abortion/75763483007/"
  },
  {
    "text": "The difference between work and Trump's staged McDonald's theatrics  —  There were reports suggesting Trump “worked” at a McDonald's, but that's not quite right — because there's a difference between work and staged theatrics.  —  As Donald Trump handed a bag of food to people … ",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/difference-work-trumps-staged-mcdonalds-theatrics-rcna176365"
  },
  {
    "text": "McDonald's is distancing itself from Donald Trump after a high-profile visit to the fryer  —  The fast food giant said it did not facilitate Trump's visit to a Pennsylvania restaurant and “does not endorse candidates for elected office”  —  McDonald's is distancing itself … ",
    "url": "https://qz.com/mcdonalds-donald-trump-kamala-harris-election-2024-1851677492"
  },
  {
    "text": "Trump's genius McDonald's stunt will fry Kamala at the ballot box  —  “Even if you flippin' fries at McDonald's,” Oprah Winfrey once said, “if you are excellent, everybody wants to be in your line.”  —  I thought of this quote when Donald Trump turned up yesterday at a McDonald's restaurant … ",
    "url": "https://nypost.com/2024/10/21/opinion/trumps-genius-mcdonalds-stunt-will-fry-kamala-at-the-ballot-box/"
  },
  {
    "text": "McDonald's Donald Trump Worked at Failed Last Health Inspection  —  briefly worked on Sunday failed its last health inspection, documents show.  —  and served takeout to people in the drive-thru lane in Feasterville-Trevose in Bucks County, a key swing voter area in battleground Pennsylvania.",
    "url": "https://www.newsweek.com/mcdonalds-donald-trump-worked-failed-last-health-inspection-1971998"
  },
  {
    "text": "What Would the Trump Campaign Plans Mean for Social Security?  —  The Social Security trust funds will be insolvent by Fiscal Year (FY) 2034, according to projections by the Congressional Budget Office (CBO), at which point the law calls for a 23 percent cut in benefits.",
    "url": "https://www.crfb.org/blogs/what-would-trump-campaign-plans-mean-social-security"
  },
  {
    "text": "Viral attack on Walz features fake former student making false claim  —  Hawaii man who attended a school where Walz taught — but says they never met — was dismayed to see person in video using his name to make a false allegation against the vice presidential candidate  —  Using a stolen identity to attack Tim Walz",
    "url": "https://www.washingtonpost.com/investigations/2024/10/21/tim-walz-matthew-metro-video/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI5NDgzMjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzMwODY5MTk5LCJpYXQiOjE3Mjk0ODMyMDAsImp0aSI6IjFhOTZkYmE3LWIwNzgtNDE3ZS1hMGM1LWRiMGRhNDk0NjA5NCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9pbnZlc3RpZ2F0aW9ucy8yMDI0LzEwLzIxL3RpbS13YWx6LW1hdHRoZXctbWV0cm8tdmlkZW8vIn0.6q4iQjY18B5szkeHTmlNBUL2fh9AYnPzTjlPOPZCGbE&itid=gfta"
  },
  {
    "text": "Russian Propaganda Unit Appears to Be Behind Spread of False Tim Walz Sexual Abuse Claims  —  The Russian-aligned network Storm-1516 has a long history of posting fake whistleblower videos—including deepfakes—to push Kremlin talking points.  —  A Russian-aligned propaganda network notorious … ",
    "url": "https://www.wired.com/story/russian-propaganda-unit-storm-1516-false-tim-walz-sexual-abuse-claims/"
  },
  {
    "text": "Arnold Palmer's daughter on what he would think of Donald Trump today: 'I think he'd cringe'  —  Donald Trump's opening at his rally Saturday in Latrobe, Pa., birthplace of the late Arnold Palmer, was a boast about how close he was to the legendary golfer.  —  But that relationship … ",
    "url": "https://www.palmbeachpost.com/story/sports/pga/2024/10/20/donald-trump-latrobe-pennsylvania-arnold-palmer/75763112007/"
  },
  {
    "text": "Infants died at higher rates after abortion bans in the US, research shows  —  In the year and a half following the Supreme Court Dobbs decision that revoked the federal right to an abortion, hundreds more infants died than expected in the United States, new research shows.",
    "url": "https://www.cnn.com/2024/10/21/health/infant-deaths-increase-post-dobbs-abortion-bans"
  },
  {
    "text": "Vance: Trump is ‘unfiltered’  —  JD Vance said Donald Trump's recent warnings about the “enemy from within” is just part of Trump being an “unfiltered” candidate, when pressed on Fox News about why his comments were necessary.  “Donald Trump is unfiltered.  This is one of the reasons … ",
    "url": "https://www.politico.com/live-updates/2024/10/21/2024-elections-live-coverage-updates-analysis/vance-trump-enemy-from-within-00184672"
  },
  {
    "text": "Trump Faces Defamation Suit From Exonerated ‘Central Park Five’  — Trump is sued over comments he made in presidential debate  — Five teenagers wrongfully convicted in 1989 jogger rape case  —  Donald Trump is facing a defamation lawsuit over comments he made during … ",
    "url": "https://www.bloomberg.com/news/articles/2024-10-21/trump-faces-defamation-suit-from-exonerated-central-park-five"
  },
  {
    "text": "With Two Weeks to Go, Pennsylvania Senate Shifts to Toss Up, Nebraska Senate Moves to Lean Republican  —  With two weeks to go until Election Day, the Senate map still favors Republicans.  Montana Sen. Jon Tester remains the likeliest Democrat to lose reelection, which along with the GOP's certain pickup … ",
    "url": "https://www.cookpolitical.com/analysis/senate/senate-overview/two-weeks-go-pennsylvania-senate-shifts-toss-nebraska-senate-moves"
  },
  {
    "text": "Trump distances himself from Mark Robinson: 'I'm not familiar'  —  With early voting underway and two weeks until Election Day, Donald Trump is still trying to keep distance between himself and North Carolina's embattled Republican nominee for governor.  Asked by POLITICO at a campaign stop … ",
    "url": "https://www.politico.com/live-updates/2024/10/21/2024-elections-live-coverage-updates-analysis/trump-mark-robinson-north-carolina-00184689"
  },
  {
    "text": "Inside the Bungled Bird Flu Response, Where Profits Collide With Public Health  —  When dairy cows in Texas began falling ill with H5N1, alarmed veterinarians expected a fierce response to contain an outbreak with pandemic-sparking potential.  Then politics—and, critics say … ",
    "url": "https://www.vanityfair.com/news/story/inside-the-bungled-bird-flu-response"
  },
  {
    "text": "Gerald Ford's daughter endorses Kamala Harris for president  —  GRAND RAPIDS, MI - The daughter of Michigan's only president, Gerald R. Ford, has endorsed Vice President Kamala Harris.The youngest child of the late Republican president, Susan Ford Bales, issued the endorsement Monday, Oct. 21 … ",
    "url": "https://www.mlive.com/politics/2024/10/gerald-fords-daughter-endorses-kamala-harris-for-president.html"
  },
  {
    "text": "Musk, putting up over $70M US to help Trump, raises legal questions with million-dollar giveaways  —  It is a federal crime to pay people with intention to induce them to cast a vote or register to vote  —  Pennsylvania's Democratic governor Josh Shapiro is among those calling for an investigation … ",
    "url": "https://www.cbc.ca/news/world/musk-election-giveaways-legal-questions-1.7357898"
  },
  {
    "text": "Arizona county official who delayed certifying election results accepts plea deal  —  Peggy Judd, who helps lead Cochise County, was indicted a year ago for allegedly flouting the state's deadlines to formally accept the results of the 2022 midterm general election.",
    "url": "https://www.washingtonpost.com/politics/2024/10/21/peggy-judd-cochise-county-arizona-midterm-election/"
  },
  {
    "text": "He Runs Fox News' Decision Desk.  Here's How He Sees Election Night Coming.  —  In a new interview, Arnon Mishkin opens up about controversial election calls and makes some predictions for what's to come.  —  Arnon Mishkin poses for a photo at the Fox News headquarters on Oct. 16 in New York.",
    "url": "https://www.politico.com/news/magazine/2024/10/21/fox-news-decision-desk-2024-election-00184396"
  }
]