[
  {
    "text": "Hillary Clinton: I've Debated Trump and Biden.  Here's What I'm Watching For.  —  Last week, I had the time of my life at the Tony Awards introducing a song from “Suffs,” the Broadway musical I co-produced about the suffragists who won women the right to vote.",
    "url": "https://www.nytimes.com/2024/06/25/opinion/hillary-clinton-trump-biden-debate.html"
  },
  {
    "text": "Speaker Johnson wants to lower the debate bar for Trump  —  The GOP leader suggested this weekend that host network CNN will “rig” the debate for President Joe Biden.  —  Speaker Mike Johnson, the highest-ranking Republican in government, has been leaning hard into former President Donald Trump's embrace lately.",
    "url": "https://www.msnbc.com/opinion/msnbc-opinion/mike-johnson-cnn-debate-trump-biden-rcna158626"
  },
  {
    "text": "Clinton to Biden: Rebutting Trump's debate “blather” is a “waste of time” … - “He starts with nonsense and then digresses into blather,” she said of the presumptive GOP nominee for president, who defeated her in the 2016 election.  — “Yet expectations for him are so low … ",
    "url": "https://www.axios.com/2024/06/25/trump-biden-2024-debate-hillary-clinton"
  },
  {
    "text": "The Nuclear Weapons Document Trump Stashed under Bubble Wrap and a Christmas Pillow  —  As noted, Jack Smith has filed his response to Trump's bid to throw out his stolen document indictment because the order of certain boxes was not retained.  —  A key part of Smith's response argues … ",
    "url": "https://www.emptywheel.net/2024/06/25/the-nuclear-weapons-document-trump-stashed-under-bubble-wrap-and-a-christmas-pillow/"
  },
  {
    "text": "Trump expressed concern that returning classified docs after subpoena could result in criminal charges, according to sealed notes  —  Judge Aileen Cannon is considering tossing out the notes as evidence.  —  This image contained in a court filing by the Department of Justice on Aug. 30 … ",
    "url": "https://abcnews.go.com/US/trump-expressed-concern-returning-classified-docs-after-subpoena/story?id=111383032"
  },
  {
    "text": "“Nobody ever slept on that side of the bed usually so he would have it all full of boxes”  —  The government has filed their response to Trump's argument that, because some of the contents of Trump's boxes have shifted during the investigation, the entire indictment must be dismissed.",
    "url": "https://www.emptywheel.net/2024/06/25/nobody-ever-slept-on-that-side-of-the-bed-usually-so-he-would-have-it-all-full-of-boxes/"
  },
  {
    "text": "Donald Trump May ‘Reignite’ Inflation, Nobel Prize-Winning Economists Warn  —  A coalition of Nobel Prize-winning economists has warned about inflation if former President  —  wins the presidential election.  —  President  —  and Trump are set to face off in the November election, and inflation remains a key issue in the race.",
    "url": "https://www.newsweek.com/donald-trump-inflation-nobel-economists-warning-1917046"
  },
  {
    "text": "Infant mortality rate rose 8% in wake of Texas abortion ban, study shows  —  In the wake of Texas' abortion ban, the state's infant death rate increased and more died of birth defects, a study published Monday shows.  —  The analysis out of Johns Hopkins University is the latest research … ",
    "url": "https://apnews.com/article/abortion-texas-infant-mortality-birth-defects-b055ac35cdbc9ec13f400b4c3e1056e7"
  },
  {
    "text": "Conservatives win longtime Liberal stronghold Toronto-St. Paul's in shock byelection result  —  Stunning result raises questions about Prime Minister Justin Trudeau's future  —  Conservative candidate Don Stewart has won the longtime federal Liberal stronghold of Toronto-St. Paul's … ",
    "url": "https://www.cbc.ca/news/politics/byelection-polls-liberal-conservative-ballot-vote-1.7243748"
  },
  {
    "text": "Wikileaks founder Julian Assange to plead guilty, return to Australia  —  WASHINGTON (AP) — WikiLeaks founder Julian Assange will plead guilty to a felony charge in a deal with the U.S. Justice Department that will free him from prison and resolve a long-running legal saga that spanned multiple continents … ",
    "url": "https://apnews.com/article/assange-plea-deal-wikileaks-justice-department-d329ba4614dbfa77b5eb968d07fd9bd0"
  },
  {
    "text": "Conservative US lawmakers are pushing for an end to no-fault divorce  —  Republicans in Louisiana, Oklahoma, Nebraska and Texas have discussed eliminating or restricting such cases  —  Some prominent conservative lawmakers and commentators are advocating for ending no-fault divorce … ",
    "url": "https://www.theguardian.com/us-news/article/2024/jun/25/republicans-no-fault-divorce"
  },
  {
    "text": "Ethics investigation adds to troubles for GOP's Ronny Jackson  —  Rep. Ronny Jackson didn't need another controversy.  The Texas Republican is nevertheless facing an advancing investigation from the House Ethics Committee.  —  During his relatively brief tenure as a political figure … ",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/ethics-investigation-adds-troubles-gops-ronny-jackson-rcna158760"
  },
  {
    "text": "Exclusive: Trump reviews plan to halt US military aid to Ukraine unless it negotiates peace with Moscow  —  Two key advisers to Donald Trump have presented him with a plan to end Russia's war in Ukraine — if he wins the presidential election — that involves telling Ukraine … ",
    "url": "https://www.reuters.com/world/us/trump-reviews-plan-halt-us-military-aid-ukraine-unless-it-negotiates-peace-with-2024-06-25/"
  },
  {
    "text": "Oklahoma Supreme Court Says No to State Funding for a Religious Charter School  —  In a closely watched case, Oklahoma's highest court blocked what was set to become the nation's first religious charter school.  An appeal is likely.  —  The Oklahoma Supreme Court blocked on Tuesday … ",
    "url": "https://www.nytimes.com/2024/06/25/us/oklahoma-supreme-court-religious-charter-school.html"
  },
  {
    "text": "Israel supreme court rules religious seminary students must be drafted to military  —  Israel's Supreme Court ruled on Tuesday that the state must begin drafting ultra-Orthodox Jewish seminary students into the military, a decree which creates new political strains for embattled Prime Minister Benjamin Netanyahu.",
    "url": "https://www.reuters.com/world/middle-east/israel-supreme-court-rules-religious-seminary-students-must-be-drafted-military-2024-06-25/"
  },
  {
    "text": "One question Trump must be asked in the debate  —  On April 12, 2024, former president Donald Trump sat down for an interview with Time Magazine.  During the interview, Trump was asked explicitly about whether he would allow women to obtain abortion pills if he won another term as president.",
    "url": "https://popular.info/p/one-question-trump-must-be-asked"
  },
  {
    "text": "Fox News returns to “migrant crime” fixation as migrant crossings, crime plummet  —  Fox News is flooding its airwaves with incendiary coverage blaming President Joe Biden for a handful of abhorrent crimes allegedly committed by migrants, as the network doubles down on its effort to use … ",
    "url": "https://www.mediamatters.org/fox-news/fox-news-returns-migrant-crime-fixation-migrant-crossings-crime-plummet"
  },
  {
    "text": "From Virginia to Colorado, MAGA infighting during primaries puts the GOP into disarray  —  Far-right Republicans in Arizona threaten revolt against Donald Trump for being too “deep state”  —  Because the MAGA movement made kookiness a competitive sport, it was inevitable that some Republican activists … ",
    "url": "https://www.salon.com/2024/06/25/from-virginia-to-colorado-maga-infighting-during-primaries-puts-the-into-disarray/"
  },
  {
    "text": "Surgeon General Declares Gun Violence a Public Health Crisis  —  Dr. Vivek Murthy is calling for a multipronged effort to reduce gun deaths, modeled on campaigns against smoking and traffic fatalities.  —  The U.S. surgeon general, Dr. Vivek Murthy, on Tuesday declared gun violence in America … ",
    "url": "https://www.nytimes.com/2024/06/25/health/gun-violence-surgeon-general.html"
  },
  {
    "text": "Introducing Our 2024 Poll Tracker  —  It starts by showing a very close race nationally and in critical battleground states.  —  What do the polls say about the race for the White House?  —  With less than five months to go, new poll averages from The New York Times, which debut today … ",
    "url": "https://www.nytimes.com/2024/06/25/upshot/introducing-2024-poll-tracker.html"
  },
  {
    "text": "World War II POW from Louisiana accounted for 82 years after Bataan Death March  —  A 20-year-old soldier from Louisiana who died as a prisoner of war during World War II has been accounted for, the Defense POW/MIA Accounting Agency said Monday.  —  U.S. Army Pfc. Joseph C. Murphy was serving … ",
    "url": "https://www.cbsnews.com/news/world-war-ii-pow-accounted-for-joseph-murphy-bataan-death-march/"
  },
  {
    "text": "Playbook: Jamaal Bowman might need a miracle  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  Israel's Supreme Court on Tuesday ruled unanimously that the military must begin drafting ultra-Orthodox men for military service, a decision that could lead … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/06/25/jamaal-bowman-might-need-a-miracle-00164804"
  },
  {
    "text": "RFK Jr. border fixes: Wall, 2,600 more agents, ‘Remain in Mexico’  —  Independent presidential candidate Robert F. Kennedy Jr. told America's sheriffs he would introduce a tougher, Trump-style border policy to curb illegal immigration and ease pressure on asylum courts if he wins the presidency.",
    "url": "https://www.washingtonexaminer.com/news/washington-secrets/3057924/rfk-jr-border-fixes-wall-2600-agents-remain-mexico/"
  }
]