[
  {
    "text": "Biden faces treacherous political choices in answering deadly attack  —  Republicans demand that Biden attack Iran.  Some warn that risks a wider Middle East conflagration.  —  President Biden met with top aides Monday to review potential American responses to a drone attack … ",
    "url": "https://www.washingtonpost.com/politics/2024/01/29/biden-attacks-iran-mideast/"
  },
  {
    "text": "A Gaza Ceasefire Deal Is the Only Way to Avoid a Wider War  —  If the war between Israel and Hamas rages on indefinitely, the conflict will spread.  It doesn't have to be that way. … It is inevitable that much of the discussion in Washington, D.C. regarding the drone attack … ",
    "url": "https://www.thedailybeast.com/gaza-ceasefire-deal-is-the-only-way-to-avoid-wider-war"
  },
  {
    "text": "House Republicans poised to torpedo GOP's best chance in years to pass border bill  —  House Republicans appear to be on the precipice of torpedoing their best opportunity in years of passing border legislation.  —  Republicans had long insisted on changes to border and migration policy … ",
    "url": "https://thehill.com/homenews/house/4436245-house-republicans-border-deal/"
  },
  {
    "text": "Republicans Who Screamed About A Crisis On The Border Now Oppose A Plan To Fix It  —  Many on the right claim the U.S. is being “invaded” by migrants but also want to wait until Donald Trump is elected president again to stop it.  —  LOADING  —  WASHINGTON ― For months … ",
    "url": "https://www.huffpost.com/entry/republicans-border-deal-donald-trump_n_65b80899e4b0102bd2d5c0d4"
  },
  {
    "text": "1/30/24 ☀️ Punchbowl News AM … The House Homeland Security Committee will mark up a resolution today to impeach DHS Secretary Alejandro Mayorkas, the first time in nearly 150 years that the chamber will try to remove a member of the president's Cabinet. … Meaning this all will have achieved nothing.",
    "url": "https://punchbowl.news/archive/13024-punchbowl-news-am/"
  },
  {
    "text": "Nikki Haley banking on Trump's legal dramas as key to lasting in primary race  —  Former President Donald Trump's escalating legal drama could be former U.N. Ambassador Nikki Haley's justification to fend off pressure to drop her White House bid.  —  Haley claims her campaign will last through … ",
    "url": "https://www.washingtonexaminer.com/news/campaigns/2823837/nikki-haley-running-president-trump-legal-drama/"
  },
  {
    "text": "It's not that MAGA doesn't believe E. Jean Carroll — they just don't care that Trump abuses women  —  Trump verdict and new Vince McMahon allegations are a dark reminder that red state America cultivates rape culture  —  Not that she'll ever bring herself to use words like “rapist” or … ",
    "url": "https://www.salon.com/2024/01/30/its-not-that-maga-doesnt-believe-e-jean-carroll--they-just-dont-care-that-abuses-women/"
  },
  {
    "text": "Retired conservative federal judge urges Supreme Court to disqualify Trump from office  —  A former conservative federal appellate judge is urging the Supreme Court to keep Donald Trump off the ballot, arguing the ex-president's effort to cling to power after his 2020 election loss was … ",
    "url": "https://www.cnn.com/2024/01/29/politics/luttig-conway-supreme-court-trump-insurrection/"
  },
  {
    "text": "Republicans now say it might be okay to ignore the Supreme Court  —  A consequential development of the Trump era is what increasingly looks like the Republicans' acrimonious divorce from the rule of law.  —  The party that once prided itself as the law-and-order side has leaped headlong … ",
    "url": "https://www.washingtonpost.com/politics/2024/01/29/republicans-now-say-it-might-be-okay-ignore-supreme-court/"
  },
  {
    "text": "The anti-abortion plan ready for Trump on Day One  —  The stakes of the election go far beyond whether a GOP president signs a bill banning the procedure.  —  Anti-abortion groups have not yet persuaded Donald Trump to commit to signing a national ban if he returns to the White House.",
    "url": "https://www.politico.com/news/2024/01/29/trump-abortion-ban-2024-campaign-00138417"
  },
  {
    "text": "Party feud breaks out ahead of RNC meeting in Las Vegas  —  GOP county chairs and local activists warned the party isn't doing enough to compete in November.  —  LAS VEGAS — Days before the Republican National Committee was set to convene here, hundreds of Republican officials gathered … ",
    "url": "https://www.politico.com/news/2024/01/29/republican-party-feud-turning-point-las-vegas-00138493"
  },
  {
    "text": "Israeli undercover forces dressed as women and medics storm West Bank hospital, killing 3 militants  —  Israeli forces disguised as civilian women and medical workers stormed a hospital Tuesday in the occupied West Bank, killing three Palestinian militants in a dramatic raid that underscored … ",
    "url": "https://apnews.com/article/israel-hamas-war-news-01-30-2024-b1ba33c7c0c5c62f85932a20c2a0bc92"
  },
  {
    "text": "Texas AG seeks transgender records in Georgia as part of his wider probe  —  Texas Attorney General Ken Paxton has requested medical records from a Georgia telehealth clinic that provides gender-affirming care, a newly discovered move that shows the Republican official is looking in multiple states … ",
    "url": "https://www.washingtonpost.com/nation/2024/01/29/texas-ag-transgender-records-georgia/"
  },
  {
    "text": "Right-Wingers Say Super Bowl Is Rigged So Taylor Swift Can Endorse Biden  —  It's all really stupid  —  Taylor Swift has shattered virtually every major record in the music industry, and as she lives her best life supporting her boyfriend, Kansas City Chiefs tight end Travis Kelce, she's also breaking the brains of right-wingers.",
    "url": "https://www.rollingstone.com/politics/politics-news/taylor-swift-targeted-conspiracies-chiefs-super-bowl-1234955940/"
  },
  {
    "text": "TheBlaze's Jason Whitlock Quietly Deletes Promo of Antisemitic Interview  —  But TheBlaze host said he didn't regret inviting the guest, who spewed vile conspiracy theories, on his show.  —  After coming under fire for hosting virulent antisemite E. Michael Jones, who claimed … ",
    "url": "https://www.thedailybeast.com/theblazes-jason-whitlock-quietly-deletes-promotion-of-antisemitic-interview"
  },
  {
    "text": "Merrick Garland to transfer power during back surgery  —  The Justice Department's No. 2 official will briefly take over as the attorney general undergoes a procedure on his spine this weekend.  —  Attorney General Merrick Garland will be out of commission this weekend due to back surgery … ",
    "url": "https://www.politico.com/news/2024/01/29/merrick-garland-to-transfer-power-during-back-surgery-00138461"
  },
  {
    "text": "Prisoners in the US are part of a hidden workforce linked to hundreds of popular food brands  —  A hidden path to America's dinner tables begins here, at an unlikely source - a former Southern slave plantation that is now the country's largest maximum-security prison.",
    "url": "https://apnews.com/article/prison-to-plate-inmate-labor-investigation-c6f0eb4747963283316e494eadf08c4e"
  },
  {
    "text": "Apple warns proposed UK law will affect software updates around the world  —  Apple may leave the UK if required to provide advance notice of product updates.  —  Apple is “deeply concerned” that proposed changes to a United Kingdom law could give the UK government unprecedented power to … ",
    "url": "https://arstechnica.com/tech-policy/2024/01/apple-accuses-uk-of-power-grab-enabling-secret-veto-over-security-updates/"
  }
]