[
  {
    "text": "Sources say two Minnesota lawmakers have been shot  —  Sources have told 5 EYEWITNESS NEWS' Tom Hauser that two Minnesota Lawmakers have been shot.  —  Minnesota state senator John Hoffman in Champlin and Minnesota state representative Melissa Hortman in Brooklyn Park were reportedly shot … ",
    "url": "https://kstp.com/kstp-news/top-news/sources-say-two-minnesota-lawmakers-have-been-shot/"
  },
  {
    "text": "Rep. Melissa Hortman, Sen. John Hoffman shot in ‘targeted’ shootings: Sources  — Two Minnesota lawmakers were shot by someone impersonating a police officer early Saturday morning.  — Sen. John Hoffman and Rep. Melissa Hortman, as well as their spouses, were shot, sources told FOX 9.",
    "url": "https://www.fox9.com/news/melissa-hortman-john-hoffman-lawmakers-shot-minnesota"
  },
  {
    "text": "Brooklyn Park police searching for suspect in ‘multiple targeted shootings’  —  Gov. Tim Walz said there were targeted shootings in both Brooklyn Park and Champlin on Saturday. … Emergency vehicles were on the scene of a reported shooting in Brooklyn Park on Saturday morning.",
    "url": "https://www.startribune.com/brooklyn-park-police-searching-for-suspect-in-multiple-targeted-shootings/601372993"
  },
  {
    "text": "2 Minnesota lawmakers shot in apparent ‘targeted’ incidents, in grave condition; manhunt underway  —  The shootings took place in Champlin and Brooklyn Park, Minnesota.  —  Minnesota State Representative Melissa Hortman and Minnesota State Senator John Hoffman are shown in these undated file photos.",
    "url": "https://abcnews.go.com/US/2-minnesota-lawmakers-shot-targeted-incident-officials/story?id=122840751"
  },
  {
    "text": "Minnesota lawmaker shootings: Legislators targeted by suspect impersonating police  — A shelter-in-place order is in effect in Brooklyn Park after two state lawmakers and their spouses were shot by someone impersonating a police officer.  — Sources say Sen. John Hoffman and Rep. Melissa Hortman were shot.",
    "url": "https://www.fox9.com/news/brooklyn-park-champlin-shootings-suspect-impersonating-police"
  },
  {
    "text": "‘Targeted shootings’ in eastern Minnesota, Gov. Walz says  —  The Brooklyn Park Police Department issued a shelter-in-place alert for an area surrounding the Edinburgh Golf Course Saturday morning in its quest for a suspect.  —  There have been “targeted shootings” in eastern Minnesota, according to Gov. Tim Walz.",
    "url": "https://www.nbcnews.com/news/us-news/targeted-shootings-minnesota-rcna212831"
  },
  {
    "text": "Two Democratic lawmakers in Minnesota shot in their separate homes  —  Governor Tim Walz was briefed on ‘ongoing situation’ in which Minneapolis-area state senator and representative were attacked  —  Two Minnesota lawmakers have been shot in their separate homes.",
    "url": "https://www.theguardian.com/us-news/2025/jun/14/democratic-lawmakers-minnesota-shot"
  },
  {
    "text": "Rep. Melissa Hortman killed, Sen. John Hoffman shot in ‘targeted’ shootings: Sources  —  Loading Video...  This browser does not support the Video element.  —  The Brief  — Two Minnesota lawmakers and their spouses were shot by someone impersonating a police officer early Saturday morning.",
    "url": "https://www.fox9.com/news/melissa-hortman-john-hoffman-lawmakers-shot-minnesota.amp"
  },
  {
    "text": "Trump Relishes Troops in American Streets While Shunning Conflict Overseas  —  The seemingly disparate postures of recent days speak to the president's complicated relationship with the military.  —  When President Trump first sought to stage a military parade in Washington … ",
    "url": "https://www.nytimes.com/2025/06/14/us/politics/trump-military-parade-israel-iran.html?unlocked_article_code=1.O08.TJl2.yA3aClTP65su&smid=bs-share"
  },
  {
    "text": "Tucker Carlson Blasts Trump for Being ‘Complicit’ in Israel's Attack on Iran  —  CALLED OUT  —  The former Fox News star broke ranks to call on the president to put America first and drop Israel as an ally.  —  Conservative commentator Tucker Carlson made waves on Friday when he criticized … ",
    "url": "https://www.thedailybeast.com/tucker-carlson-blasts-trump-for-being-complicit-in-israels-attack-on-iran/"
  },
  {
    "text": "Trump Shifts Deportation Focus, Pausing Raids on Farms, Hotels and Eateries  —  The abrupt pivot on an issue at the heart of Mr. Trump's presidency suggested his broad immigration crackdown was hurting industries and constituencies he does not want to lose.  —  The Trump administration … ",
    "url": "https://www.nytimes.com/2025/06/13/us/politics/trump-ice-raids-farms-hotels.html?unlocked_article_code=1.O08.-3wV.Z_Osb56HSwak&smid=url-share"
  },
  {
    "text": "A Miscalculation by Iran Led to Israeli Strikes' Extensive Toll, Officials Say  —  Interviews with half a dozen senior Iranian officials show that they were not expecting Israel to strike before another round of talks.  —  Iran's senior leaders had been planning for more than a week … ",
    "url": "https://www.nytimes.com/2025/06/13/world/middleeast/iran-israel-strikes-nuclear-talks.html"
  },
  {
    "text": "Exclusive: US Marines carry out first known detention of civilian in Los Angeles, video shows  —  Marines deployed to Los Angeles carried out the detention of a civilian on Friday, the U.S. military confirmed after being presented with Reuters images, in the first known detention … ",
    "url": "https://www.reuters.com/world/us/us-marines-carry-out-first-known-detention-civilian-los-angeles-video-shows-2025-06-13/"
  },
  {
    "text": "Extremist's Advice for ‘No Kings’ Protests: ‘Shoot a Couple, the Rest Will Go Home ’  —  Proud Boys and other far-right groups capitalize on planned demonstrations against Trump policies  —  “Shoot a couple, the rest will go home,” said a meme circulating on Telegram channels of groups affiliated with the far-right Proud Boys.",
    "url": "https://www.wsj.com/politics/policy/no-kings-protest-proud-boys-df066df0?st=93NAgP&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Police arrest roughly 60 veterans and military family members protesting outside US Capitol after group crosses police line  —  A group of roughly 60 individuals were arrested outside the US Capitol on Friday evening after breaching a police line of bike racks and moving toward steps leading … ",
    "url": "https://cnn.com/2025/06/13/politics/protesters-arrested-us-capitol"
  },
  {
    "text": "Trump brought in $57 million from crypto venture, millions from sneakers and bibles  —  President Donald Trump's sources of income range from luxury properties around the world to royalty payments and license fees for using his name and likeness on everything from sneakers to bibles … ",
    "url": "https://www.usatoday.com/story/news/politics/2025/06/13/trump-crypto-bible-guitar-sneakers/84197257007/"
  },
  {
    "text": "REGARDING THE PROPOSED ACQUISITION OF UNITED STATES STEEL CORPORATION BY NIPPON STEEL CORPORATION  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, including section 721 of the Defense Production Act of 1950, as amended (section 721), 50 U.S.C. 4565, it is hereby ordered:",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/06/regarding-the-proposed-acquisition-of-the-united-states-steel-corporation-by-nippon-steel-corporation/"
  },
  {
    "text": "An old Capitol Hill troublemaker is trying to clinch a megabill deal  —  Mark Meadows has re-emerged as a behind-the-scenes sounding board for Republican hard-liners.  —  It's a scene jarringly familiar to many Republicans on Capitol Hill: a high-stakes piece of legislation … ",
    "url": "https://www.politico.com/news/2025/06/14/mark-meadows-gop-megabill-00405984"
  },
  {
    "text": "Trump Tried to Destroy Meidas... KARMA STRIKES!  —  It's over, Donald.  —  You failed.  —  Today was going to be your big moment.  —  Your dictator parade.  —  You thought all opposition would be destroyed.  —  You were wrong.  —  The awful weather in D.C. The war engulfing the Middle East because of your weakness.",
    "url": "https://www.meidasplus.com/p/trump-tried-to-destroy-meidas-karma"
  },
  {
    "text": "Hiding in the fields - farm workers fearing deportation stay in California's shadows  —  The women crouch down motionless, kneeling between endless rows of fruit bushes, almost hidden from view.  —  “Are you from ICE?” one of the women, a farm worker in a hat and purple bandana, asks us fearfully.",
    "url": "https://www.bbc.com/news/articles/c989zrggn14o"
  },
  {
    "text": "More Americans support than oppose Trump's Army celebration parade: Poll  —  Still, six in 10 Americans are concerned about the cost of the parade  —  As President Donald Trump hosts events on Saturday to celebrate the U.S. Army's 250th anniversary, a new national poll indicates more Americans … ",
    "url": "https://www.foxnews.com/politics/more-americans-support-than-oppose-trumps-army-celebration-parade-poll"
  },
  {
    "text": "Scoop: Every Senate Dem demands Trump withdrawal military from Los Angeles  —  Sen. Alex Padilla (D-Calif.) led the entire Senate Democratic in writing to President Trump Sunday, demanding he remove all military forces from Los Angeles and cease threats to further deploy troops, Axios has learned.",
    "url": "https://www.axios.com/2025/06/14/senate-democrats-trump-withdrawal-military-los-angeles"
  },
  {
    "text": "Demonstrators Are Trying to Make Sure ICE Agents Can't Sleep  —  “Time to pull out the trumpet.”  —  Car horns.  Tambourines.  Trumpets.  Call-and-response chants.  Wacking a spoon against a metal folding chair.  Demonstrators outside Los Angeles-area hotels—where Immigration … ",
    "url": "https://www.motherjones.com/politics/2025/06/demonstrators-are-trying-to-make-sure-ice-agents-cant-sleep/"
  },
  {
    "text": "‘No Kings’ Protests, Citizen-Run ICE Trackers Trigger Intelligence Warnings  —  Army intelligence analysts are monitoring civilian-made ICE tracking tools, treating them as potential threats, as immigration protests spread nationwide.  —  As protests continue to swell across the United States … ",
    "url": "https://www.wired.com/story/no-kings-protests-citizen-run-ice-trackers-trigger-intelligence-warnings/"
  },
  {
    "text": "Stop Looking for Red Lines.  You no Longer Live in a Full Democracy  —  People want to know when we have crossed the line from one state of existence to another.  In watching our democracy die, many people are wondering when we will have crossed the line from life to death, from democracy to autocracy.",
    "url": "https://ryandenos.substack.com/p/stop-looking-for-red-lines-you-no"
  }
]