[
  {
    "text": "Biden advisers brainstorm best policy pitch to halt Trump's rise  —  Prescription drug caps, taxing the wealthy and reining in corporate price-gouging eyed as potent advantages in president's reelection bid  —  In private conversations over the past several weeks, aides to President Biden … ",
    "url": "https://www.washingtonpost.com/business/2024/01/20/trump-biden-2024-policy/"
  },
  {
    "text": "The Absurdity of No Labels  —  A dangerous date for politics in the United States is approaching: March 5.  Not only is that when Super Tuesday will occur, with a slew of Republican primaries likely to anoint Donald Trump as the presumptive GOP presidential nominee.",
    "url": "https://link.motherjones.com/public/34061597"
  },
  {
    "text": "Stefanik's Fierce Support for Trump Puts Her in the VP Conversation  —  New York lawmaker has drawn criticism for Jan. 6 remarks, political shift  —  WASHINGTON—The political evolution of Rep. Elise Stefanik from a moderate into a strong defender of Donald Trump helped catapult her into House GOP leadership.",
    "url": "https://www.wsj.com/politics/elections/stefaniks-fierce-support-for-trump-puts-her-in-the-vp-conversation-ab15176b?mod=followamazon"
  },
  {
    "text": "A ‘whale’ of a tale: Trump continues to distort cognitive test he took  —  The Montreal Cognitive Assessment, a test aimed at detecting dementia or cognitive decline, never included the combination of animals Trump identified this week  —  Donald Trump this week bragged about purportedly acing … ",
    "url": "https://www.washingtonpost.com/politics/2024/01/19/trump-cognitive-test/"
  },
  {
    "text": "Trump maintains 17% lead over Haley in latest NH poll  —  Ron DeSantis is still a distant third at 7% with three days until the state's first-in-the-nation primary  —  Republican presidential frontrunner Donald Trump maintained his 17% lead over challenger Nikki Haley with three days remaining until … ",
    "url": "https://www.nbcboston.com/news/local/trump-maintains-17-lead-over-haley-in-latest-nh-poll/3252999/"
  },
  {
    "text": "Iranian and Hezbollah commanders help direct Houthi attacks in Yemen  —  Commanders from Iran's Islamic Revolutionary Guards Corps (IRGC) and Lebanon's Hezbollah group are on the ground in Yemen helping to direct and oversee Houthi attacks on Red Sea shipping, four regional and two Iranian sources told Reuters.",
    "url": "https://www.reuters.com/world/middle-east/iranian-hezbollah-commanders-help-direct-houthi-attacks-yemen-sources-say-2024-01-20/"
  },
  {
    "text": "Iran's IRGC says 4 members killed in Israeli attack on Syria's Damascus  —  Iran's Islamic Revolutionary Guard Corps (IRGC) says four of its “military advisers” have been killed in an Israeli air strike on a residential building in Syria's capital, Damascus.",
    "url": "https://www.aljazeera.com/news/2024/1/20/israeli-strike-hits-residential-building-in-damascus-syrian-state-media"
  },
  {
    "text": "DC Bar Association files disciplinary charges against lawyers over 2020 election fraud claims  —  The Bar association in Washington, D.C., filed disciplinary charges against three lawyers associated with former President Trump's alleged attempt to overturn the 2020 presidential election results.",
    "url": "https://thehill.com/regulation/court-battles/4419415-dc-bar-files-disciplinary-charges-lawyers-2020-election-fraud-claims/"
  },
  {
    "text": "Zelensky invites Trump to Ukraine  —  President Volodymyr Zelensky has extended an invitation to Donald Trump to visit Kyiv, with a specific condition attached.  —  Speaking with U.K. broadcaster Channel 4 News, Zelensky said that Trump would be warmly received in the capital under one stipulation … ",
    "url": "https://kyivindependent.com/zelensky-invites-trump-to-ukraine/"
  },
  {
    "text": "Revealed: far-right figures try to create Christian nationalist ‘haven’ in Kentucky  —  Venture fund and real estate startup linked to far-right groups promote residential development as community for rightwingers  —  A venture fund and a real estate startup - both with links to far-right organizations … ",
    "url": "https://www.theguardian.com/us-news/2024/jan/20/kentucky-far-right-community-real-estate-development"
  },
  {
    "text": "Microsoft Actions Following Attack by Nation State Actor Midnight Blizzard  —  The Microsoft security team detected a nation-state attack on our corporate systems on January 12, 2024, and immediately activated our response process to investigate, disrupt malicious activity, mitigate the attack, and deny the threat actor further access.",
    "url": "https://msrc.microsoft.com/blog/2024/01/microsoft-actions-following-attack-by-nation-state-actor-midnight-blizzard/"
  },
  {
    "text": "Growing number of Senate Democrats question Biden's Israel strategy  —  Discomfort with Israel's onslaught, which started with the party's liberals, is moving to the Democratic mainstream  —  Five Senate Democrats on Friday signed onto a measure that would condition aid to Israel on its compliance … ",
    "url": "https://www.washingtonpost.com/politics/2024/01/19/senate-democrats-question-biden-israel/"
  },
  {
    "text": "Palestinian-American teenager killed by Israeli forces in West Bank- Palestinian officials  —  A Palestinian-American teenager was killed by Israeli security forces on Friday in the occupied West Bank, Palestinian health officials said.  —  The Israeli military did not immediately respond to a request for comment.",
    "url": "https://www.reuters.com/world/middle-east/palestinian-american-teenager-killed-by-israeli-forces-west-bank-palestinian-2024-01-19/"
  },
  {
    "text": "S&P 500 hits new record high amid signs of easing US economic gloom  —  Index climbs to all-time high of 4,838, clearing record set two years ago, as US consumer confidence rises while inflation concerns ease  —  The S&P 500 scaled a new all-time high on Friday amid signs that the economic despondency … ",
    "url": "https://www.theguardian.com/business/2024/jan/19/us-economy-consumer-sentiment-rises"
  },
  {
    "text": "Bank records: DA Willis and special prosecutor traveled together during Trump probe  —  Bank records show that special prosecutor Nathan Wade purchased airline tickets in his and Fulton County District Attorney Fani Willis' name for trips to San Francisco and Miami, according to a court motion filed Friday.",
    "url": "https://www.ajc.com/live-updates/politics/bank-records-da-wills-and-special-prosecutor-traveled-together-during-trump-probe/ZNDCH5RHDFGC5CKRWNS7HI2R5M/"
  },
  {
    "text": "Robb grand jury forms to examine investigation  —  Editor's note: This story was updated at 5:20 p.m. on Jan. 19 to clarify how the jury will operate.  —  A jury has been convened in Uvalde to determine if law enforcement officers will face criminal charges related to the attack at Robb Elementary School.",
    "url": "https://www.uvaldeleadernews.com/articles/grand-jury-begins-examining-robb-school-investigation/"
  }
]