[
  {
    "text": "The Israeli Right May Soon Be Disenchanted With Trump  —  The most interesting detail of the hostage-cease fire deal that Israeli and Hamas officials agreed to on Wednesday lies neither in its terms, which mainly resemble what's been on the table for months, nor in the fact that Benjamin Netanyahu … ",
    "url": "https://www.nytimes.com/2025/01/15/opinion/trump-ceasefire-israel-hamas.html"
  },
  {
    "text": "Hostage families are celebrating the cease-fire deal — with a dose of trepidation.  —  The Israeli cabinet still has to ratify the deal, and some details remained unresolved.  President Biden said hostages were to be released over 42 days.  —  Here are the latest developments.",
    "url": "https://www.nytimes.com/live/2025/01/15/world/israel-hamas-cease-fire-deal-gaza?unlocked_article_code=1.pU4.RX8a.tvGIXHe5ZsnS&smid=url-share"
  },
  {
    "text": "A Year of Empty Threats and a “Smokescreen” Policy: How the State Department Let Israel Get Away With Horrors in Gaza  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up to receive our biggest stories as soon as they're published.",
    "url": "https://www.propublica.org/article/biden-blinken-state-department-israel-gaza-human-rights-horrors"
  },
  {
    "text": "Live updates: Multiple officials tout Gaza ceasefire deal; Israel says details are still in flux  —  Israeli Prime Minister Benjamin Netanyahu's office says ceasefire deal with Hamas has still not been reached and that the final details were still being sorted out.",
    "url": "https://apnews.com/live/israel-hamas-ceasefire-updates"
  },
  {
    "text": "Israel and Hamas agree to ceasefire deal, including hostage release, Biden says  —  Qatar announces Gaza ceasefire  —  A hostage and ceasefire deal between Hamas and Israel has been reached Wednesday following more than 15 months of extraordinary bloodshed and violence in Gaza, President Joe Biden said Wednesday.",
    "url": "https://www.washingtonpost.com/world/2025/01/15/israel-war-gaza-ceasefire-hostages-news-hamas/"
  },
  {
    "text": "Israel, Hamas reach ceasefire deal designed to end 15-month Gaza war  —  Israel and Hamas agreed to a deal to halt fighting in Gaza and exchange Israeli hostages for Palestinian prisoners, an official briefed on the deal told Reuters on Wednesday, opening the way to a possible end to a 15-month war that has upended the Middle East.",
    "url": "https://www.reuters.com/world/middle-east/israel-hamas-reach-ceasefire-agreement-designed-end-15-month-gaza-war-official-2025-01-15/"
  },
  {
    "text": "Democrats Call On Merrick Garland To Preserve Records On Trump Prosecutions  —  The letter signed by 10 senators who sit on the upper chamber's Judiciary Committee comes a week ahead of Trump taking office.  —  LOADING  —  Democratic senators on the upper chamber's Judiciary Committee … ",
    "url": "https://www.huffpost.com/entry/senate-dems-garland-letter-trump-cases_n_67864c64e4b02348137a6804"
  },
  {
    "text": "Zuckerberg Will Host a Party for Trump's Inauguration  —  Mark Zuckerberg, the Meta chief executive, is one of several tech leaders expected to play a high-profile role in celebrating the new administration next week.  —  Mark Zuckerberg, the Meta chief executive who has tried to keep … ",
    "url": "https://www.nytimes.com/2025/01/15/us/politics/mark-zuckerberg-donald-trump-inauguration.html"
  },
  {
    "text": "Biden Cites Threat From ‘Extreme Wealth’ in Farewell Address  — President sees ‘dangerous concentration of power’ in the US  — Biden offers direct critique of Trump and his allies  —  President Joe Biden warned Americans of a “dangerous concentration of power” in the hands of a … ",
    "url": "https://www.bloomberg.com/news/articles/2025-01-16/biden-warns-of-threat-from-extreme-wealth-in-farewell-address"
  },
  {
    "text": "Johnson removes Mike Turner as House Intelligence chair  —  The Ohio Republican has been an outspoken advocate for Ukraine funding and other hawkish national security stances.  —  Speaker Mike Johnson has removed Rep. Mike Turner as chair of the House Permanent Select Committee on Intelligence … ",
    "url": "https://www.politico.com/news/2025/01/15/johnson-removes-mike-turner-as-intel-chair-00198522"
  },
  {
    "text": "Nonprofit Founded by Stacey Abrams Admits Secretly Aiding Her 2018 Campaign  —  The New Georgia Project, whose leaders also included Raphael Warnock, now a senator, admitted violating campaign finance laws.  It agreed to a $300,000 penalty.  —  A nonprofit founded by Stacey Abrams … ",
    "url": "https://www.nytimes.com/2025/01/15/us/politics/nonprofit-stacey-abrams.html"
  },
  {
    "text": "UnitedHealth, employer of slain exec Brian Thompson, found to have overcharged some cancer patients for drugs by over 1,000%  — OptumRx, the group's pharmacy benefit manager, along with its two main peers, Express Scripts and CVS Caremark Rx, have pocketed an extra $7.3 billion over cost thanks … ",
    "url": "https://fortune.com/2025/01/15/ftc-pbms-unitedhealth-brian-thompson-cvs-caremark-cigna-pharmacy-benefit-managers/"
  },
  {
    "text": "Trump's pick for energy secretary rejects linking climate change and wildfires  —  Chris Wright's arguments drew scrutiny from Senate Democrats during his confirmation hearing for the Energy Department post.  —  Oil executive Chris Wright, President-elect Donald Trump's pick to lead the Energy Department … ",
    "url": "https://www.washingtonpost.com/climate-environment/2025/01/15/wildfires-chris-wright-trump-energy/"
  },
  {
    "text": "Biden warns of the rise of a new American ‘oligarchy’  —  From the White House he will soon cede to Trump, Biden likens the current crop of tech moguls to the ‘robber barons’ of the 19th century.",
    "url": "https://www.washingtonpost.com/politics/2025/01/15/biden-farewell-address-oval-office/"
  },
  {
    "text": "Exclusive: Trump team asks three US senior career diplomats to resign, sources say  —  Aides to President-elect Donald Trump have asked three senior career diplomats who oversee the U.S. State Department's workforce and internal coordination to step down from their roles … ",
    "url": "https://www.reuters.com/world/us/trump-team-asks-three-us-senior-career-diplomats-resign-sources-say-2025-01-15/"
  },
  {
    "text": "CNN Poll: Biden leaves office with his approval rating matching the lowest of his term  —  President Joe Biden will leave office with his approval rating remaining at the lowest level of his term and his favorability rating close to his personal low, according to a new CNN poll conducted by SSRS.",
    "url": "https://www.cnn.com/2025/01/15/politics/cnn-poll-biden-presidency/"
  },
  {
    "text": "Trump encourages Vivek Ramaswamy to seek Ohio's open Senate seat  —  The co-leader of the “Department of Government Efficiency” may move to replace JD Vance, though other contenders remain.  —  President-elect Donald Trump has encouraged billionaire biotech entrepreneur Vivek Ramaswamy … ",
    "url": "https://www.washingtonpost.com/business/2025/01/15/vivek-ramaswamy-ohio-senate-trump/"
  },
  {
    "text": "Trump considers executive order hoping to ‘save TikTok’ from ban or sale in U.S. law  —  The self-styled master dealmaker is exploring unconventional ways to rescue the Chinese-owned video app from a nationwide ban, arguing it will help him reach an adoring audience throughout his second term.",
    "url": "https://www.washingtonpost.com/technology/2025/01/15/trump-tiktok-ban-executive-order/"
  },
  {
    "text": "White House Reporters Fear a Return of Fire and Fury  —  Anxiety is running high in the press corps given the (soon-to-be) 47th president's history of demonizing, threatening, suing—and courting!—journalists.  “I don't think he intends to pack reporters off to Guantánamo,” says one cable news vet, “but who the hell knows.”",
    "url": "https://www.vanityfair.com/news/story/white-house-reporters-donald-trump"
  },
  {
    "text": "Biden administration looks for ways to keep TikTok available in the U.S.  —  Barring action by the Supreme Court, a ban in the U.S. on the popular app is set to begin on Sunday.  —  President Joe Biden's administration is considering ways to keep TikTok available in the U.S. if a ban that's scheduled … ",
    "url": "https://www.nbcnews.com/politics/joe-biden/biden-administration-keep-tiktok-available-us-rcna187902"
  },
  {
    "text": "Musk Said to Have Intervened to Help Free Italian Jailed in Iran  —  The Italian journalist was released soon after Elon Musk met with an Iranian ambassador, officials in Iran said.  So was an Iranian detained in Italy who was wanted by the U.S.  —  When an Italian journalist was arrested … ",
    "url": "https://www.nytimes.com/2025/01/15/world/middleeast/musk-italy-iran-prisoner-exchange.html?unlocked_article_code=1.pU4.YwNr.l-8Qfmz2MJD5&smid=tw-share"
  },
  {
    "text": "FDA to Revoke Authorization for the Use of Red No. 3 in Food and Ingested Drugs  —  Constituent Update  —  The FDA is revoking the authorization for the use of FD&C Red No. 3 as a matter of law, based on the Delaney Clause of the Federal Food, Drug, and Cosmetic Act (FD&C Act).",
    "url": "https://www.fda.gov/food/hfp-constituent-updates/fda-revoke-authorization-use-red-no-3-food-and-ingested-drugs"
  },
  {
    "text": "Rep. Byron Donalds makes his move ahead of expected 2026 Florida gubernatorial bid  —  The Republican congressman has told donors and other Florida political players that he is running to replace Gov. Ron DeSantis, who is term-limited.  —  WEST PALM BEACH, Fla. — Rep. Byron Donalds, R-Fla. … ",
    "url": "https://www.nbcnews.com/politics/politics-news/rep-byron-donalds-gubernatorial-bid-2026-rcna187721"
  },
  {
    "text": "The Supreme Court seems eager to curb First Amendment protections for porn  —  On Wednesday, the Supreme Court heard the first major First Amendment case involving pornography — or, for that matter, sexual speech of any kind — in more than two decades.  It's also the first such case since … ",
    "url": "https://www.vox.com/scotus/395057/supreme-court-porn-free-speech-paxton"
  },
  {
    "text": "Jill Biden still hopes for a good ending  —  The first lady, after a half-century in public life, reflects on the past year — and looks to the future.  —  The first lady says she's at peace with this ending.  But.  —  “Let's just say I was disappointed with how it unfolded.”  —  Why?",
    "url": "https://www.washingtonpost.com/style/power/2025/01/15/jill-biden-interview-first-lady/"
  },
  {
    "text": "Meta's pivot to the right sparks boycotts and a user exodus  —  Some users are fleeing Meta platforms to alternatives like Bluesky.  —  After Meta and its CEO Mark Zuckerberg announced a series of changes that shifted the company and its policies to the right ahead of President-elect Donald … ",
    "url": "https://www.nbcnews.com/tech/social-media/meta-boycott-facebook-instagram-users-delete-accounts-policy-changes-rcna187480"
  },
  {
    "text": "For LA water issues, misinformation spreads nearly as fast as the wildfires  —  A billionaire couple was accused of withholding water that could help stop Los Angeles' massive wildfires.  Democratic leadership was blamed for fire hydrants running dry and for an empty reservoir.",
    "url": "https://apnews.com/article/california-los-angeles-wildfires-water-misinformation-27b0059719e8b475d452030c221fe544"
  }
]