[
  {
    "text": "Trump's team shows growing pains in pivot to general election … - It's the latest in a series of reversals by Trump's team at the RNC, now led by chair Michael Whatley and Lara Trump, his daughter-in-law.  — Those who've been rehired include most of the RNC's staff in key states … ",
    "url": "https://www.axios.com/2024/04/06/trump-campaign-rnc-2024-election"
  },
  {
    "text": "Trump in ‘full sprint’ to close Biden's money lead as legal bills mount  —  Donald Trump is in a “full sprint” to narrow President Biden's substantial fundraising advantage, and talked to or met with big-money donors almost every day this week ahead of a planned blowout gala in Palm Beach on Saturday night … ",
    "url": "https://www.washingtonpost.com/politics/2024/04/06/trump-fundraising-dinner/"
  },
  {
    "text": "Biden campaign announces pulling in $90M in March  —  The president's war chest swamps that of former President Donald Trump — even if Biden is still struggling in the polls.  —  President Joe Biden's campaign said it raised $90 million in March, a sum that's likely to grow … ",
    "url": "https://www.politico.com/news/2024/04/06/biden-campaign-march-fundraising-90-million-00150868"
  },
  {
    "text": "Biden campaign raises $90M in March, enters second quarter with $192M on hand  —  The Biden campaign on Saturday announced a staggering haul of $90 million in the month of March, buoyed by a major New York City fundraiser and another strong month of grassroots donations.",
    "url": "https://thehill.com/homenews/campaign/4577260-biden-campaign-march-fundraising/"
  },
  {
    "text": "Trump's bizarre, vindictive incoherence has to be heard in full to be believed  —  Excerpts from his speeches do not do justice to Trump's smorgasbord of vendettas, non sequiturs and comparisons to famous people  —  Donald Trump's speeches on the 2024 campaign trail so far have been focused … ",
    "url": "https://www.theguardian.com/us-news/2024/apr/06/donald-trump-speech-analysis"
  },
  {
    "text": "When a top Republican says Russian propaganda has infected the GOP  —  House Foreign Affairs Committee Chairman Michael McCaul is the latest to point out such a problem in his party  —  During the first impeachment inquiry into President Donald Trump in 2019, former Trump national security aide Fiona Hill made an extraordinary plea.",
    "url": "https://www.washingtonpost.com/politics/2024/04/06/when-top-republican-says-russian-propaganda-has-infected-gop/"
  },
  {
    "text": "Trump's Lawyers Told the Court That No One Would Give Him a Bond.  Then He Got a Lifeline, but They Didn't Tell the Judges.  —  An appeals court reduced Trump's bond by more than 60% after his attorneys claimed it was a “practical impossibility” to pay the full amount.",
    "url": "https://www.propublica.org/article/trump-bond-disclosure-appeals-court-hankey"
  },
  {
    "text": "The Trump Docket: A window into Trump's ‘private’ acts on Jan. 6 may soon be opened by a federal judge  —  Very soon, a federal judge in Washington, D.C., is expected to issue a ruling that could expose key pieces of discovery that some lawyers say prove Donald Trump acted in his “private” … ",
    "url": "https://lawandcrime.com/high-profile/the-trump-docket-a-window-into-trumps-private-acts-on-jan-6-may-soon-be-opened-by-a-federal-judge/"
  },
  {
    "text": "Do our leaders, ‘experts’ and pundits want World War III?  —  At least within the circles I run, people who encounter purposely-created insanity and danger openly acknowledge the insanity and danger and, for reasons of self-protection and survival, want it stopped as fast as possible.",
    "url": "https://thehill.com/opinion/international/4577779-do-our-leaders-experts-and-pundits-want-world-war-iii/"
  },
  {
    "text": "NATO chief's final battle: Protecting Ukraine from Trump, US  —  NATO Secretary-General Jens Stoltenberg is putting his legacy behind a final push to shore up international support for Ukraine in its fight against Russia.  —  The secretary-general, who will step down later this year … ",
    "url": "https://thehill.com/policy/international/4574642-nato-stoltenberg-ukraine-aid-europe-trump-us/"
  },
  {
    "text": "Trump relies on a doctor who is a member of his golf club to vouch for his health  —  Former president has declined to release details about his own condition beyond a short letter from his physician, contrasting with Biden's detailed report  —  BEDMINSTER, N.J. — As former president Donald Trump escalated … ",
    "url": "https://www.washingtonpost.com/politics/2024/04/06/trump-doctor-bruce-aronwald-bedminster-golf-club/"
  },
  {
    "text": "Lauren Boebert secures top spot on Republican primary ballot in Colorado's 4th Congressional District  —  PUEBLO — U.S. Rep. Lauren Boebert's name will be first on the June 25 Republican primary ballot in Colorado's 4th Congressional District after she won the district's GOP nominating assembly Friday.",
    "url": "https://coloradosun.com/2024/04/05/lauren-boebert-4th-congressional-district/"
  },
  {
    "text": "Major mail delivery delays raise concerns about voting in the 2024 elections  —  Residents and businesses nationwide have been reporting slowdowns in mail and package delivery by the U.S. Postal Service, raising concerns that mail-in ballots could be affected in the upcoming election.",
    "url": "https://www.nbcnews.com/politics/2024-election/major-mail-delivery-delays-raise-concerns-voting-2024-elections-rcna146479"
  },
  {
    "text": "Marjorie Taylor Greene Is Leading the Charge to Oust Mike Johnson.  Will Anyone Follow?  —  'Drama's inconvenient,' lightning-rod Georgia Republican says.  ‘But the people are fed up.’",
    "url": "https://www.wsj.com/politics/marjorie-taylor-greene-mike-johnson-congress-ousting-threat-65f3ccdc"
  },
  {
    "text": "Voter ID and absentee-ballot limits: the South tightens key voting laws ahead of election  —  When Michael McClanahan was growing up, his grandmother would tell him stories about what it was like to vote during the pre-Civil Rights era in their small town in northwest Louisiana.",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/04/06/alabama-louisiana-mississippi-target-ballot-harvesting-2024/73106732007/"
  },
  {
    "text": "Verdict: Colorado Springs-area resident found guilty on all charges in Capitol breach trial in D.C.  —  After a lengthy deliberation that's been rare for Capitol breach cases, Falcon resident Rebecca Lavrenz, known on social media as the “J6 Praying Grandma,” was convicted … ",
    "url": "https://gazette.com/news/crime/verdict-colorado-springs-area-resident-found-guilty-on-all-charges-in-capitol-breach-trial-in/article_41e439fe-f0fc-11ee-9887-4fc0904851b5.html"
  }
]