[
  {
    "text": "What Mitt Romney Saw in the Senate  —  In an exclusive excerpt from my forthcoming biography of the senator, Romney: A Reckoning, he reveals what drove him to retire.  —  For most of his life, Mitt Romney has nursed a morbid fascination with his own death, suspecting that it might assert itself one day suddenly and violently.",
    "url": "https://www.theatlantic.com/magazine/archive/2023/11/mitt-romney-retiring-senate-trump-mcconnell/675306/"
  },
  {
    "text": "Mitt Romney says he will not seek a second term in the Senate  —  In a Post interview, Romney is critical of both Trump and Biden, and says most Republicans are drawn to a ‘populist demagogue message.’ His decision not to seek reelection is likely to be the end of the 2012 GOP presidential nominee's political career.",
    "url": "https://www.washingtonpost.com/politics/2023/09/13/mitt-romney-senate-reelection/"
  },
  {
    "text": "Mitch McConnell told Mitt Romney that Trump is an ‘idiot’ who 'doesn't think when he says things:' book  — An upcoming Sen. Mitt Romney biography details his relationship with his fellow GOP senators.  — Romney, who's been a vocal critic of Trump for years, said GOP lawmakers told him they envy him.",
    "url": "https://www.businessinsider.com/mitch-mcconnell-told-mitt-romney-that-trump-is-an-idiot-2023-9?op=1"
  },
  {
    "text": "Fact-checking McCarthy's claims while launching Biden impeachment inquiry  —  House Speaker Kevin McCarthy made several unproven claims Tuesday while announcing the opening of a formal impeachment inquiry into President Joe Biden.  —  The Republican-led investigation will focus on … ",
    "url": "https://www.cnn.com/2023/09/13/politics/fact-check-mccarthy-biden-impeachment-claims/"
  },
  {
    "text": "RFK Jr. Getting Republican Support For His Democratic Primary Bid To Unseat Biden  —  Former GOP Sen. Scott Brown hosts a “No BS” barbecue series for GOP presidential candidates and, most recently, Robert F. Kennedy Jr.  —  LOADING  —  RYE, N.H. — As Robert F. Kennedy Jr. tries … ",
    "url": "https://www.huffpost.com/entry/robert-f-kennedy-republican-support_n_65021080e4b01f6f9b9b9032"
  },
  {
    "text": "A House GOP attempt to advance abortion measure backfires in funding fight  —  House GOP leaders wanted more leverage in the spending wars.  So far, they have less.  —  House GOP leaders have abandoned efforts to pass an agriculture funding bill amid an intraparty row over abortion policy.",
    "url": "https://www.politico.com/news/2023/09/13/abortion-policy-funding-agriculture-bill-00115529"
  },
  {
    "text": "Florida surgeon general rejects FDA guidance, urges people under 65 not to get Covid booster  —  Previous guidance by Joe Ladapo has been widely rejected by the medical community.  —  TALLAHASSEE, Fla. — Gov. Ron DeSantis' hand-picked surgeon general on Wednesday warned healthy adults under … ",
    "url": "https://www.politico.com/news/2023/09/13/florida-surgeon-general-fda-covid-booster-00115781"
  },
  {
    "text": "DeSantis and top Fla. health official warn against COVID shots for people under 65  —  Florida Gov. Ron DeSantis (R) and the state's surgeon general are advising against the use of updated COVID-19 vaccines for anyone under the age of 65, a move that counters a new recommendation from the Centers … ",
    "url": "https://thehill.com/policy/healthcare/4203200-desantis-and-top-fla-health-official-warn-against-covid-shots-for-people-under-65/"
  },
  {
    "text": "Wisconsin Republican leader asks former state Supreme Court justices to review impeachment  —  Wisconsin's Republican Assembly leader announced Wednesday that he's created a panel to investigate the criteria for impeachment as he mulls taking that unprecedented step against a liberal state Supreme Court justice.",
    "url": "https://apnews.com/article/wisconsin-supreme-court-justice-impeachment-03d6f56ef7d27c6c45913a4310df7953"
  },
  {
    "text": "What Republicans are doing to Wisconsin is a warning sign to all Americans  —  The state's so gerrymandered that Republicans can lose the popular vote and win supermajorities.  Now they want to impeach a liberal justice before she's ruled on a single case  —  f you need a reminder … ",
    "url": "https://www.theguardian.com/commentisfree/2023/sep/13/wisconsin-warning-democracy-gerrymandering"
  },
  {
    "text": "Federal judge again declares Obama-era DACA program unlawful  —  A federal judge in Texas ruled Wednesday that a regulation intended to preserve the Obama-era Deferred Action for Childhood Arrivals program is unlawful, delivering a major blow to the Biden administration.",
    "url": "https://www.cnn.com/2023/09/13/politics/daca-program-unlawful/"
  },
  {
    "text": "DeSantis says he does not support criminalizing women who get abortions  —  Florida Gov. Ron DeSantis said he does not support criminalizing women who receive abortions even after he signed a six-week abortion ban into law earlier this year that includes language that could be interpreted as such.",
    "url": "https://www.cbsnews.com/news/ron-desantis-abortion-florida-law-women-penalities/"
  },
  {
    "text": "Ramaswamy Says He Would Fire Most of the Federal Work Force if Elected  —  Vivek Ramaswamy, whose campaign for the Republican nomination has gained attention in recent months, has vowed to dismantle much of the federal government and shutter key agencies.  —  Vivek Ramaswamy … ",
    "url": "https://www.nytimes.com/2023/09/13/us/politics/vivek-ramaswamy-dismantle-government.html"
  },
  {
    "text": "Court blocks Jack Smith's access to many of Rep. Scott Perry's contacts about 2020 election  —  The appeals panel concluded that prosecutors' effort to access cellphone communications with colleagues officials violated the lawmaker's constitutional immunity.",
    "url": "https://www.politico.com/news/2023/09/13/court-smith-perry-2020-election-00115682"
  },
  {
    "text": "Trump, Meadows offer quid pro quo on speedy trial to sever Georgia election case from co-defendants  — Donald Trump offered to “exchange” his right to a speedy trial in his Georgia election-conspiracy case for an Atlanta judge ruling that would have the former president tried separately from 18 other defendants.",
    "url": "https://www.cnbc.com/2023/09/13/trump-waives-georgia-election-speedy-trial-to-sever-from-co-defendants.html"
  },
  {
    "text": "The Right-Wing Conspiracy-Fest Is More Openly Bloodthirsty Than Before  —  The first thing I noticed at the latest stop on the ReAwaken America Tour in Las Vegas in mid-August was that the T-shirts are getting nastier.  “Size Matters” blared one man's shirt over enlarged images of bullets of various calibers.",
    "url": "https://newrepublic.com/article/175514/reawaken-america-political-violence-conference"
  },
  {
    "text": "Sean Penn's Crusade: Why He's Risking It All for Ukraine, Furious at Will Smith and Ready to Call Bulls— on Studios' AI Proposals  —  Summer light fades to gold in Malibu.  Surfers carve tasty waves just down the road.  A beautiful woman wanders toward the pool house.",
    "url": "https://variety.com/2023/film/features/sean-penn-slams-will-smith-slap-ai-oscars-1235720417/"
  },
  {
    "text": "Milley disputes claim he recommended Trump attack Iran  —  You can watch the full interview with Gen. Mark Milley on “Fareed Zakaria GPS” on Sunday at 10 a.m. ET.  —  CNN  —  Chairman of the Joint Chiefs of Staff Gen. Mark Milley told CNN's Fareed Zakaria in an interview Wednesday … ",
    "url": "https://www.cnn.com/2023/09/13/politics/milley-cnn-interview-trump-iran/"
  },
  {
    "text": "Jury's fresh-air break could upend Navarro conviction  —  The former Donald Trump adviser was on trial for defying a subpoena from the Jan. 6 select committee.  —  An unusual outdoor excursion by the jury that convicted Peter Navarro — just 30 minutes before delivering its verdict last week … ",
    "url": "https://www.politico.com/news/2023/09/13/navarro-conviction-jury-fresh-air-break-00115556"
  },
  {
    "text": "Jury awards $100,000 to Kentucky gay couple denied marriage license  —  The couple sued former county clerk Kim Davis, who was briefly jailed in 2015 over her refusal to issue marriage licenses to same-sex couples.  —  A federal jury has awarded $100,000 to a Kentucky couple … ",
    "url": "https://www.nbcnews.com/nbc-out/out-news/jury-awards-100000-kentucky-gay-couple-denied-marriage-license-rcna104971"
  },
  {
    "text": "Is AOC Married?  Her Office Says No. Her Legal Filings in Congress Say Otherwise.  —  Rep. Alexandria Ocasio-Cortez's (D., N.Y.) office says she isn't married.  But she has described her fiancé, Riley Roberts, as her “spouse” in forms filed with the House Ethics Committee in 2023 … ",
    "url": "https://freebeacon.com/democrats/aoc-cites-longtime-partner-as-spouse-but-keeps-his-finances-under-wraps-a-potential-breach-of-ethics-rules/"
  },
  {
    "text": "Michael Gerson's words make the case for saving PEPFAR  —  The writer was the 43rd president of the United States.  —  When I took office in 2001, the situation with HIV/AIDS on the African continent and elsewhere was dire.  A group of advisers including Condi Rice, Josh Bolten … ",
    "url": "https://www.washingtonpost.com/opinions/2023/09/13/george-bush-pepfar-michael-gerson-words/"
  },
  {
    "text": "Judge restricts Trump's access to classified info in docs case and limits what he can say  —  U.S. District Judge Aileen Cannon set specific parameters for how and when the former president can review the evidence in case against him in Florida.  —  The judge presiding over the federal … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/judge-restricts-trumps-access-classified-info-docs-case-limits-can-say-rcna104742"
  },
  {
    "text": "Calif. passes strongest right-to-repair bill yet, requiring 7 years of parts  —  Repair shops must disclose if they're using “non-authorized” parts.  —  California, the home to many of tech's biggest companies and the nation's most populous state, is pushing ahead with a right-to-repair bill for consumer electronics and appliances.",
    "url": "https://arstechnica.com/gadgets/2023/09/calif-passes-strongest-right-to-repair-bill-yet-requiring-7-years-of-parts/"
  }
]