[
  {
    "text": "CNN Poll: Biden faces negative job ratings and concerns about his age as he gears up for 2024  —  President Joe Biden faces continued headwinds from broadly negative job ratings overall, widespread concerns about his age and decreased confidence among Democratic-aligned voters, according to a new CNN Poll conducted by SSRS.",
    "url": "https://www.cnn.com/2023/09/07/politics/cnn-poll-joe-biden-headwinds/"
  },
  {
    "text": "CNN Poll: A majority of Americans believe Joe Biden, as VP, was involved with son's business dealings  —  Most Americans say they think President Joe Biden was involved in his son's business dealings with Ukraine and China while he served as vice president under Barack Obama, according to a CNN poll conducted by SSRS.",
    "url": "https://www.cnn.com/2023/09/07/politics/poll-hunter-biden/"
  },
  {
    "text": "The Best Anti-Trump Argument Can't Be Used  —  GOP primary voters don't want to hear it.  —  Donald Trump is winning the Republican nomination race in a walk, and it's been quite the pleasant stroll.  —  That's because his opponents can't make the most compelling argument against Trump … ",
    "url": "https://www.politico.com/news/magazine/2023/09/07/gop-trump-truth-00114366"
  },
  {
    "text": "CNN Exclusive: ‘How am I in this war?’:  New Musk biography offers fresh details about the billionaire's Ukraine dilemma  —  Elon Musk secretly ordered his engineers to turn off his company's Starlink satellite communications network near the Crimean coast last year to disrupt a Ukrainian sneak attack … ",
    "url": "https://www.cnn.com/2023/09/07/politics/elon-musk-biography-walter-isaacson-ukraine-starlink/"
  },
  {
    "text": "Musk Secretly Used Starlink to Foil Ukrainian Drone Attack on Russian Ships: Report  —  ULTIMATE CONTROL  —  Elon Musk secretly ordered SpaceX engineers to switch off the Starlink satellite communications network near the coast of occupied Crimea in order to thwart a Ukrainian surprise attack … ",
    "url": "https://www.thedailybeast.com/musk-secretly-used-starlink-to-foil-ukrainian-drone-attack-on-russian-ships-report"
  },
  {
    "text": "Willis blasts congressman's ‘interference’ in Fulton Trump probe  —  X  —  Fulton County District Attorney Fani Willis Thursday blasted a congressman who has pledged to investigate her handling of an indictment of former President Donald Trump and others.  —  U.S. Rep. Jim Jordan … ",
    "url": "https://www.ajc.com/politics/willis-blasts-congressmans-interference-in-fulton-trump-probe/IU5USCA3H5A3RJKTMT2WFCL3VU/"
  },
  {
    "text": "13 Presidential Libraries Issue Rare Joint Warning About U.S. Democracy  —  Their statement stopped short of slamming individuals as it called for a recommitment to the country's bedrock principles.  —  LOADING  —  Concern for U.S. democracy amid deep national polarization has prompted … ",
    "url": "https://www.huffpost.com/entry/presidential-centers-warning_n_64f9bb3de4b04a65c3cc1bfa"
  },
  {
    "text": "Abortions Rose in Most States This Year, New Data Shows  —  Legal abortions most likely increased in the United States in the first six months of the year compared with 2020, an analysis of new estimates shows, as states with more permissive abortion laws absorbed patients traveling … ",
    "url": "https://www.nytimes.com/interactive/2023/09/07/us/abortion-data-bans-laws.html"
  },
  {
    "text": "Michigan fake elector described planning with Trump campaign attorneys: ‘Mike Pence and Congress [to] make that decision’  —  One of the fake electors put forward by Republicans in Michigan said in December 2020 that the plan to use a slate of fake electors to help Donald Trump win … ",
    "url": "https://www.cnn.com/2023/09/07/politics/kfile-meshawn-maddock-fake-elector-planning-trump-attorneys/"
  },
  {
    "text": "John Eastman declines to elaborate on Trump world discussions about Grassley presiding on Jan. 6  —  He asserted attorney-client privilege when asked to discuss evidence that Trump's allies considered the Iowa senator playing a role to keep Trump in power.  —  John Eastman, testifying … ",
    "url": "https://www.politico.com/news/2023/09/07/john-eastman-disbarment-chuck-grassley-00114416"
  },
  {
    "text": "Ramaswamy: Former felons should be allowed to carry guns  —  The GOP presidential candidate fleshes out what it means to be a “Second Amendment absolutist” on a podcast.  —  Vivek Ramaswamy says convicted felons should be allowed to carry weapons.  —  Appearing on former New York … ",
    "url": "https://www.politico.com/news/2023/09/07/vivek-ramaswamy-former-felons-guns-00114457"
  },
  {
    "text": "Rescuers race to save ill US cave explorer trapped 3,000 feet underground  —  More than 150 rescuers raced on Thursday to reach an American man who fell ill and became trapped some 1,000 metres (3,280 ft) underground in a cave he was exploring in southern Turkey.",
    "url": "https://www.reuters.com/world/rescuers-race-save-ill-us-cave-explorer-trapped-3000-feet-underground-2023-09-07/"
  },
  {
    "text": "China, North Korea pursue new targets while honing cyber capabilities  —  Clint Watts - General Manager, Digital Threat Analysis Center  —  In the past year, China has honed a new capability to automatically generate images it can use for influence operations meant to mimic U.S. voters across … ",
    "url": "https://blogs.microsoft.com/on-the-issues/2023/09/07/digital-threats-cyberattacks-east-asia-china-north-korea/"
  },
  {
    "text": "Pennsylvania school district requires social studies classes to incorporate right-wing propaganda  —  Last Monday, the Pennridge School Board, located outside of Philadelphia, imposed a new social studies curriculum that will require teachers to incorporate lessons from the 1776 Curriculum … ",
    "url": "https://popular.info/p/pennsylvania-school-district-requires"
  },
  {
    "text": "Republicans Narrow in on Bribery Charge for Biden Impeachment Probe (Exclusive)  —  ‘There was money flowing to the son of the vice president turned president,’ Rep. Chip Roy, R-Texas, tells The Messenger on why he wants to impeach Biden  —  A Facebook icon representing an external link … ",
    "url": "https://themessenger.com/politics/republicans-narrow-in-on-bribery-charge-for-biden-impeachment-probe"
  },
  {
    "text": "Trump Plans $1M ‘Family Style’ Mar-a-Lago Dinner to Raise Money for His Co-Defendants (Exclusive)  —  The exact date of the candlelight event is still being ironed out, but Trump's sons will attend  —  A Facebook icon representing an external link to share the article on Facebook … ",
    "url": "https://themessenger.com/politics/trump-plans-family-style-mar-a-lago-dinner-to-raise-money-for-his-co-defendants"
  },
  {
    "text": "Adriana Kugler Confirmed as First Hispanic Fed Governor in Nearly 110-Year History  — Kugler confirmation caps Democratic diversity push under Biden  — Menendez had long pressed for Hispanic leadership at the Fed  —  The Senate confirmed Adriana Kugler to the Federal Reserve Board … ",
    "url": "https://www.bloomberg.com/news/articles/2023-09-07/adriana-kugler-becomes-first-hispanic-to-win-senate-confirmation-to-fed-board"
  },
  {
    "text": "Biden Rejects Proposed Conditions for Plea Deals in Sept. 11 Case  —  Five Guantánamo detainees accused of aiding the attacks wanted a promise of care for torture-related trauma and to avoid solitary confinement.  —  President Biden has rejected a list of proposed conditions sought … ",
    "url": "https://www.nytimes.com/2023/09/06/us/sept-11-trial-plea-biden-guantanamo.html"
  },
  {
    "text": "Trump's border wall caused ‘significant’ cultural, environmental damage, watchdog finds  —  The 450 miles of barrier waived or disregarded environmental and historic preservation laws and interfered with endangered species, diverted water sources and caused other environmental damage, GAO said.",
    "url": "https://www.politico.com/news/2023/09/07/watchdog-environmental-harms-trumps-wall-00114467"
  },
  {
    "text": "VP Harris says it would be ‘huge mistake’ for North Korea to give military support to Russia  —  North Korea's Kim Jong Un may soon meet with Russian President Vladimir Putin  —  Vice President Kamala Harris said in an interview broadcast Thursday that it would be a “huge mistake” … ",
    "url": "https://www.foxnews.com/politics/vp-harris-huge-mistake-north-korea-give-military-support-russia"
  }
]