[
  {
    "text": "What a Weekend for Putin!  —  It was a hell of a weekend for bad men getting what they paid for out of Donald Trump.  And while we'll focus on Vladimir Putin here, we don't want to fully ignore venture capitalist David Sacks, Donald Trump's “crypto czar,” who seemingly stands … ",
    "url": "https://www.thebulwark.com/p/what-a-weekend-for-putin"
  },
  {
    "text": "Washington now ‘largely aligns’ with Moscow's vision, Kremlin says  —  Tension between the United States and Ukraine, laid bare in the Oval Office meeting of Trump and Zelensky, is seen in Moscow as a “gift.”  —  MOSCOW — The Trump administration's rewrite of decades of U.S. foreign policy on Russia … ",
    "url": "https://www.washingtonpost.com/world/2025/03/02/russia-ukraine-trump-zelensky-clash/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQwODkxNjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQyMjcwMzk5LCJpYXQiOjE3NDA4OTE2MDAsImp0aSI6IjFjNjE2YTc5LWIzM2UtNDE1Zi1hMjRiLTA5ZDI3OTlkZmQ1NCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS93b3JsZC8yMDI1LzAzLzAyL3J1c3NpYS11a3JhaW5lLXRydW1wLXplbGVuc2t5LWNsYXNoLyJ9.DRtHRu1YRJtS00MBp5WSQv6SH7HP45VF-evySDShuYA&itid=gfta"
  },
  {
    "text": "Car Prices Are Poised for $12,000 Surge on Trump's New Tariffs  — Auto bosses warn Trump administration of economic consequences  — Companies rush to stockpile parts, engines in US warehouses  —  Impending tariffs on Canada and Mexico risk driving up US car prices by as much as $12,000 … ",
    "url": "https://www.bloomberg.com/news/articles/2025-03-03/car-prices-are-poised-for-12-000-surge-on-trump-s-new-tariffs?accessToken=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzb3VyY2UiOiJTdWJzY3JpYmVyR2lmdGVkQXJ0aWNsZSIsImlhdCI6MTc0MTAxMDM3NSwiZXhwIjoxNzQxNjE1MTc1LCJhcnRpY2xlSWQiOiJTU0VGV0dUMEFGQjQwMCIsImJjb25uZWN0SWQiOiJDNjVGQzRGMzI5QkU0ODE2QkZFRTI0MEY1NEU5RkQ1NyJ9.iaz4vgPss3-P_g-ff7O8LYkywbP9hrJ-SqP4tHIJlAQ"
  },
  {
    "text": "Trump Turns Up Trade Pressure on China After Beijing Fails to Come Running  —  China is still cautiously trying to figure out what Trump wants.  The president has threatened big tariffs in response to the inaction.  —  When President Trump threatened tariffs on Canada, Mexico and China in January … ",
    "url": "https://www.nytimes.com/2025/03/03/us/politics/trump-tariffs-china.html"
  },
  {
    "text": "It's not Dickens—it's the MAGA agenda  —  Given the scope of the MAGA assault on the foundations of our democracy, many Democrats, responsible media outlets, and concerned Americans have (understandably) been focused on its attempt to obliterate the rule of law, the separation of powers, and the First Amendment.",
    "url": "https://contrarian.substack.com/p/its-not-dickensits-the-maga-agenda"
  },
  {
    "text": "Hegseth Orders Pentagon to Stop Offensive Cyberoperations Against Russia  —  The defense secretary's instructions, which were given before President Trump's blowup with the Ukrainian president, are apparently part of an effort to draw Russia into talks on the war.",
    "url": "https://www.nytimes.com/2025/03/02/us/politics/hegseth-cyber-russia-trump-putin.html?unlocked_article_code=1.004.B7lh.Cy2TjG3-0IlO&smid=url-share"
  },
  {
    "text": "France has ‘trouble understanding’ US halt on cyber operations against Russia  —  PARIS — French Foreign Affairs Minister Jean-Noël Barrot voiced his confusion over reports that the United States' Defense Secretary Pete Hegseth has ordered a halt of offensive cyber operations against Russia.",
    "url": "https://www.politico.eu/article/france-has-trouble-understanding-us-halt-on-cyber-operations-against-russia/"
  },
  {
    "text": "Defense Secretary Pete Hegseth has paused cyber offensive against Russia  —  Multiple U.S. officials tell CBS News that Defense Secretary Pete Hegseth has issued a directive to U.S. Cyber Command to pause planning against Russia, including offensive digital actions.",
    "url": "https://www.cbsnews.com/news/pete-hegseth-russia-cyber-command-pause/"
  },
  {
    "text": "RFK Jr. urges people to get vaccinated amid deadly Texas outbreak … - He has previously repeated debunked claims about vaccines and provided elusive answers to senators on his stance on vaccinations ahead of being confirmed. … - Kennedy wrote that before the introduction of the measles … ",
    "url": "https://www.axios.com/2025/03/03/kennedy-jr-measles-outbreak-vaccine"
  },
  {
    "text": "U.S.A.I.D. Memos Detail Human Costs of Cuts to Foreign Aid  —  The world is likely to see millions more malaria infections and 200,000 cases of paralytic polio each year, according to an agency whistle-blower.  —  The Trump administration's decision to withdraw foreign aid and dismantle … ",
    "url": "https://www.nytimes.com/2025/03/02/health/usaid-cuts-deaths-infections.html?unlocked_article_code=1.1E4.lGCw.EBGGOENXCAzY&smid=url-share"
  },
  {
    "text": "USAID official placed on leave after saying barriers to lifesaving programs will cause ‘preventable death’  —  Nick Enrich, acting assistant administrator for USAID Global Health, said in a memo that “lifesaving humanitarian assistance” has not been implemented under a waiver to cuts targeting foreign aid.",
    "url": "https://www.nbcnews.com/news/us-news/usaid-official-leave-barriers-life-saving-programs-preventable-death-rcna194455"
  },
  {
    "text": "Zelensky must mend the breach with Trump — or resign  —  Zelensky's stubbornness has badly hurt Ukraine.  —  On Thursday, President Donald Trump was publicly pledging to help Ukrainian President Volodymyr Zelensky regain Russian-occupied territory at the peace table.",
    "url": "https://www.washingtonpost.com/opinions/2025/03/02/zelensky-trump-ukraine-clash-vance/"
  },
  {
    "text": "The Trump administration may exclude government spending from GDP, obscuring the impact of DOGE cuts  —  Commerce Secretary Howard Lutnick said Sunday that government spending could be separated from gross domestic product reports in response to questions about whether the spending cuts pushed … ",
    "url": "https://apnews.com/article/trump-gdp-economy-government-spending-lutnick-7414ba1bd441bd4bf64620bfd66923b2"
  },
  {
    "text": "Macron urges Europe to boost defense spending to over 3 percent of GDP  —  The EU needs to find ways to massively ramp up defense spending, the French president says.  —  PARIS — French President Emmanuel Macron called on Europeans to dramatically increase their yearly defense spending … ",
    "url": "https://www.politico.eu/article/macron-urges-europe-to-boost-defense-spending-to-over-3-percent-of-gdp/"
  },
  {
    "text": "The roots of Trump's realpolitik Uncle Sam always drives a hard bargain  —  President Trump's attempt to end the war in Ukraine has enraged liberal internationalists on both sides of the Atlantic.  Dealing directly with the Kremlin and going over the heads of America's European allies … ",
    "url": "https://unherd.com/2025/03/the-roots-of-trumps-realpolitik/"
  },
  {
    "text": "Trump credit card freeze crippling cancer and Alzheimer's research  —  On February 26, President Trump issued an executive order expanding the power of the United States DOGE Service (DOGE), the government initiative controlled by Elon Musk.  The purpose of the order is to limit any spending … ",
    "url": "https://popular.info/p/trump-credit-card-freeze-crippling"
  },
  {
    "text": "The Democrats' young man problem is real  —  On a random Tuesday in February, a conservative provocateur and talk radio host made a bold proclamation about the state of the Democratic Party.  Donald Trump had won over young men, and nearly a majority of young voters overall in November, because “Democrats, for men, are pussies.”",
    "url": "https://www.vox.com/politics/402055/democrats-young-man-problem-gen-z-republican-shift-vote-trump"
  },
  {
    "text": "NYT v. Sullivan: Will the Landmark Defamation Ruling Survive? … In any given year, the United States Supreme Court hears only 80 or so cases.  That means that — in a nation with more than 1.3 million attorneys — the group of lawyers who get to argue before the nine justices is an exclusive club.",
    "url": "https://www.nytimes.com/2025/03/03/magazine/nyt-sullivan-defamation-press-freedom-ruling.html?unlocked_article_code=1.1E4.DJSh.NIzMw_wnXVc7&smid=url-share"
  },
  {
    "text": "The Casey DeSantis question  —  Presented by Good morning and welcome to Monday.  —  Florida first Lady CASEY DESANTIS hasn't done anything to tamp down speculation that she may run for governor in 2026.  —  Asked about her plans ahead of the weekend, she played coy by quoting baseball legend YOGI BERRA … ",
    "url": "https://www.politico.com/newsletters/florida-playbook/2025/03/03/the-casey-desantis-question-00206943"
  }
]