[
  {
    "text": "Trump fires commissioner of labor statistics to be fired after weaker-than-expected jobs figures slam markets  —  President Donald Trump on Friday fired the Bureau of Labor Statistics commissioner, hours after the agency reported that job growth in the U.S. had slowed to a near-halt.",
    "url": "https://www.cnbc.com/2025/08/01/trump-erika-mcentarfer-jobs-report-fired.html"
  },
  {
    "text": "Trump fires labor statistics boss hours after weak jobs report  —  The president implied that the BLS commissioner, longtime federal employee Erika McEntarfer, manipulated the data “for political purposes.”  —  President Donald Trump on Friday ordered the firing of the head of the Bureau … ",
    "url": "https://www.nbcnews.com/business/economy/trump-orders-firing-bls-commissioner-weak-jobs-report-rcna222531"
  },
  {
    "text": "US employers slash hiring as Trump advances a punishing trade agenda  —  U.S. hiring is slowing sharply as President Donald Trump's erratic and radical trade policies paralyze businesses and raise doubts about the outlook for the world's largest economy.  The Labor Department reported Friday … ",
    "url": "https://apnews.com/article/jobs-unemployment-economy-trump-federal-reserve-68a15f89d68793a6cf88a522ff33246c"
  },
  {
    "text": "U.S. added just 73,000 jobs in July and numbers for prior months were revised much lower … Nonfarm payroll growth was slower than expected in July and the unemployment rate ticked higher, raising potential trouble signs for the U.S. labor market as President Donald Trump ramps up tariffs.",
    "url": "https://www.cnbc.com/2025/08/01/jobs-report-july-2025.html"
  },
  {
    "text": "Trump Says He'll Fire BLS Head After Weak Jobs Data  —  Corrected  —  President Donald Trump said he was directing officials to fire Erika McEntarfer, the commissioner of the Bureau of Labor Statistics, hours after a report showed US job growth cooled sharply over the last three months.",
    "url": "https://www.bloomberg.com/news/articles/2025-08-01/trump-says-he-ll-fire-labor-statistics-head-after-weak-jobs-data?accessToken=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzb3VyY2UiOiJTdWJzY3JpYmVyR2lmdGVkQXJ0aWNsZSIsImlhdCI6MTc1NDA3NDM2MSwiZXhwIjoxNzU0Njc5MTYxLCJhcnRpY2xlSWQiOiJUMEJSTUFHUTdMSkYwMCIsImJjb25uZWN0SWQiOiI2NjMxNUMzNzNDNzE0NzFGQkU1ODZBQjMzQ0JERDc0RCJ9.e3rVAaqzqse7-37uRxQ2TeaQ375p_eZty8vdi10OD7Q"
  },
  {
    "text": "EXCLUSIVE: Someone Waived Ghislaine Maxwell's Sex Offender Status to Move Her to a Minimum Security Camp in Texas  —  About an hour ago, CNN and NBC reported that Ghislaine Maxwell was moved to a minimum security camp in Texas.  —  According to sources who have spoken on the condition of anonymity … ",
    "url": "https://www.muellershewrote.com/p/exclusive-someone-waived-ghislaine"
  },
  {
    "text": "EXCLUSIVE: Ghislaine Maxwell, Jeffrey Epstein's Longtime Associate, Is Moved From Florida to a Prison in Texas  —  The quiet transfer comes as her attorneys are seeking for her to receive a pardon or commutation from President Trump in exchange for her cooperation in the Jeffrey Epstein investigation.",
    "url": "https://www.nysun.com/article/ghislaine-maxwell-jeffrey-epsteins-longtime-associate-is-moved-from-florida-to-a-prison-in-texas"
  },
  {
    "text": "Ghislaine Maxwell is quietly moved to cushy new Texas prison as she pushes for deal to tell all on Epstein, his associates  —  Ghislaine Maxwell has quietly been moved to a far more favorable Texas prison camp as she hashes out a possible deal to divulge secrets about her sex-crimes accomplice Jeffrey Epstein.",
    "url": "https://nypost.com/2025/08/01/us-news/ghislaine-maxwell-quietly-moved-to-cushy-new-texas-prison-as-she-pushes-for-deal-to-tell-all-on-epstein-his-associates/?utm%C2%A7source=nypost&utm%C2%A7campaign=android%C2%A7nyp&utm%C2%A7medium=social"
  },
  {
    "text": "Ghislaine Maxwell Moved to Minimum-Security Women's Prison in Texas  —  The longtime Epstein associate, now serving a 20-year sentence, was relocated from a federal prison in Florida about a week after being interviewed by a Justice Department official.  —  Ghislaine Maxwell … ",
    "url": "https://www.nytimes.com/2025/08/01/us/politics/ghislaine-maxwell-prison-texas.html"
  },
  {
    "text": "Corporation for Public Broadcasting Addresses Operations Following Loss of Federal Funding  —  The Corporation for Public Broadcasting (CPB) announced today that it will begin an orderly wind-down of its operations following the passage of a federal rescissions package and the release … ",
    "url": "https://cpb.org/pressroom/Corporation-Public-Broadcasting-Addresses-Operations-Following-Loss-Federal-Funding"
  },
  {
    "text": "The FBI Redacted Trump's Name in the Epstein Files  —  The bureau's FOIA team tasked with conducting a final review of the records blacked out the names before higher-ups said last month that releasing the documents ‘would not be appropriate or warranted.’ … ‘The most transparent administration in history’",
    "url": "https://www.bloomberg.com/news/newsletters/2025-08-01/epstein-files-trump-s-name-was-redacted-by-the-fbi?accessToken=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzb3VyY2UiOiJTdWJzY3JpYmVyR2lmdGVkQXJ0aWNsZSIsImlhdCI6MTc1NDA1OTE1MiwiZXhwIjoxNzU0NjYzOTUyLCJhcnRpY2xlSWQiOiJUMEJLSjNHUTdMOEUwMCIsImJjb25uZWN0SWQiOiIyQjE3NzFFOTlEODc0QzRDOTY1Njg1RTZBQkJGM0QwRCJ9.3ALPrarxmje8f879sHyUxeFbyg60ntxdgX4Ar8jOZLQ"
  },
  {
    "text": "Trump orders nuclear submarines closer to Russia over “provocative statements”  —  President Trump said Friday that he'd ordered to nuclear submarines close to Russian waters in response to nuclear bluster from former Russian President Dmitry Medvedev.  —  Why it matters: Trump accused … ",
    "url": "https://www.axios.com/2025/08/01/trump-nuclear-submarines-russia-medvedev"
  },
  {
    "text": "Trump Says He Ordered Subs Repositioned in Rare Nuclear Threat to Russia  —  In a social media post, the president described the move as a deterrent prompted by threats by a former Russian leader.  It is unclear if any submarines did actually change position.",
    "url": "https://www.nytimes.com/2025/08/01/us/politics/trump-nuclear-submarines-russia.html?unlocked_article_code=1.a08.pxCU.44vq5oqwJQ6O&smid=url-share"
  },
  {
    "text": "Trump Administration Cuts Funds to U.C.L.A., Chancellor Says  —  The university is the latest to be targeted by the federal government over accusations that it has not done enough to fight antisemitism on campus.  —  The federal government is cutting research funds for the University of California … ",
    "url": "https://www.nytimes.com/2025/08/01/us/politics/trump-cuts-ucla-funding-federal-research.html?unlocked_article_code=1.a08.sKlF.D1UD296a_zyu&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "‘Clinton Plan’ Emails Were Likely Made by Russian Spies, Declassified Report Shows  —  An annex to a report by the special counsel John H. Durham was the latest in a series of disclosures about the Russia inquiry, as the Trump team seeks to distract from the Jeffrey Epstein files.",
    "url": "https://www.nytimes.com/2025/07/31/us/politics/trump-clinton-emails-russia-investigation.html?unlocked_article_code=1.a08.WmHr.TWoZEuTvFEKm&smid=url-share"
  },
  {
    "text": "Palantir Is Extending Its Reach Even Further Into Government  —  Palantir has become one of the few winners in the Trump administration's cost-cutting efforts, offering other contractors a lifeline while consolidating its own reach and power.  —  President Donald Trump's administration … ",
    "url": "https://www.wired.com/story/palantir-government-contracting-push/"
  },
  {
    "text": "Inside the Crisis at the Anti-Defamation League  —  The group used to fight for justice for all.  Its war against anti-Zionism has changed everything.  —  On June 4, an executive at the Anti-Defamation League, which was founded with a mission to defend the Jewish people and … ",
    "url": "https://nymag.com/intelligencer/article/inside-adl-anti-defamation-league-greenblatt-zionism-trump-gaza.html"
  },
  {
    "text": "Trump's Bad-to-Worse Options on Epstein … The Trump administration has been flailing as it struggles to contain the fallout from its handling of the so-called Epstein files.  Is there a way out?  —  Even on an overseas trip, President Donald Trump couldn't escape persistent queries … ",
    "url": "https://www.politico.com/news/magazine/2025/08/01/trump-epstein-decisions-ankush-khardori-column-00484918"
  },
  {
    "text": "Tesla found partially liable for fatal 2019 crash, hit with $243 million in damages  —  The outcome, including $200 milliion in punitive damages, is a stunning rebuke for Tesla, which for years has fought to absolve itself of responsibility when its driver-assistance technology is involved in a crash.",
    "url": "https://www.washingtonpost.com/technology/2025/08/01/tesla-found-partially-liable-fatal-2019-crash-involving-driver-assistance-technology-jury-orders-200-million-damages/"
  },
  {
    "text": "I spent decades at Columbia.  I'm withdrawing my fall course due to its deal with Trump  —  The university's draconian policies and new definition of antisemitism make much teaching impossible  —  I am writing you an open letter since you have seen fit to communicate the recent decisions … ",
    "url": "https://www.theguardian.com/commentisfree/2025/aug/01/columbia-historian-rashid-khalidi-open-letter"
  },
  {
    "text": "‘Can We Extradite Him?’  How U.S. Officials Grappled With the Release of a Triple Murderer  —  The decision to free an American convicted of murder in a prisoner swap with Venezuela threatened to undercut President Trump's claims of keeping the worst of the worst out of the United States.",
    "url": "https://www.nytimes.com/2025/08/01/us/politics/triple-murderer-release-trump-venezuela.html?unlocked_article_code=1.a08.nTgS.vyexzAkw9xzk&smid=url-share"
  },
  {
    "text": "White House Forges Ahead With Plan to Escalate Global Trade War  —  An executive order explaining the new rates is the latest move by President Trump to remake the global trading system.  —  Here is the latest.  —  Hours before President Trump's long-threatened tariffs on dozens of countries … ",
    "url": "https://www.nytimes.com/live/2025/07/31/business/tariffs-trump-trade?unlocked_article_code=1.a08.2cxw.YXfTWiMZtDxp&smid=url-share"
  },
  {
    "text": "Scoop: Dems threaten investigation if Harvard cuts deal with Trump  —  A group of House and Senate Democrats who attended Harvard are threatening their alma mater with a “rigorous” investigation if the school cuts a deal to end hostilities with President Trump, Axios has learned.",
    "url": "https://www.axios.com/2025/08/01/harvard-trump-deal-congress-democrats-investigate"
  }
]