[
  {
    "text": "House Ethics Committee releases report on George Santos  —  Washington — The House Ethics Committee released a long-awaited report on its investigation into embattled Rep. George Santos on Thursday, finding that there was “substantial evidence” of wrongdoing by the congressman.",
    "url": "https://www.cbsnews.com/news/house-ethics-committee-george-santos-report/"
  },
  {
    "text": "Rep. George Santos likely committed fraud, House Ethics panel says  — Republican Rep. George Santos of New York likely committed campaign fraud and other ethical violations, a House Ethics subcommittee unanimously concluded.  — Santos “blatantly stole from his campaign” and … ",
    "url": "https://www.cnbc.com/2023/11/16/rep-george-santos-likely-committed-fraud-house-ethics-panel-says.html"
  },
  {
    "text": "‘Signs of life’ on longshot Senate border deal  —  Good morning, Early Birds.  Dwayne Johnson, a.k.a. The Rock, was on Capitol Hill on Wednesday.  We wonder if he and Sen. Joe Manchin III (D-W.Va.) met up to discuss a potential presidential unity ticket.  Tips: earlytips@washpost.com.",
    "url": "https://www.washingtonpost.com/politics/2023/11/16/signs-life-longshot-senate-border-deal/"
  },
  {
    "text": "Rudy's Ukraine caper looks even worse now  —  This free edition of Public Notice is made possible by paid subscribers.  If you aren't one already, please consider signing up.  Just click the button below.  —  Click for Public Notice free trial  —  There's something so utterly predictable … ",
    "url": "https://www.publicnotice.co/p/giuliani-ukraine-kulyk-derkach-dubinsky-treason"
  },
  {
    "text": "Elon Musk faces scrutiny after calling antisemitic X post the ‘absolute truth’  —  Tech billionaire Elon Musk is facing a wave of backlash after engaging with an antisemitic social media post on Wednesday, calling it the “absolute truth.”  —  The antisemitic post that Musk seemed to endorse came … ",
    "url": "https://thehill.com/homenews/media/4312813-elon-musk-facing-scrutiny-antisemitic-post/"
  },
  {
    "text": "Trumpworld Is Already at War Over Staffing a New Trump White House  —  A year out from Election Day, Trumpworld is tearing itself apart over different groups claiming they have the inside track on staffing the White House. … The America First Policy Institute was supposed to add … ",
    "url": "https://www.thedailybeast.com/trumpworld-is-already-at-war-over-staffing-a-new-trump-white-house"
  },
  {
    "text": "‘Same clown car with a different driver’: House GOP goes off the rails  —  Mike Johnson may have avoided a shutdown, but the House GOP is still emotionally raw from its 22-day speakership fight.  —  The House GOP has descended, as one member put it, into “schoolyard bully bullshit.”",
    "url": "https://www.politico.com/news/2023/11/15/the-house-gop-is-stuck-on-a-failure-loop-00127418"
  },
  {
    "text": "More pandas will be coming to the U.S., China's president signals  —  SAN FRANCISCO — Chinese President Xi Jinping signaled that China will send new pandas to the United States, calling them “envoys of friendship between the Chinese and American peoples.”  —  “We are ready to continue … ",
    "url": "https://www.npr.org/2023/11/16/1213443655/pandas-us-china-xi"
  },
  {
    "text": "Last Post, Please Read  —  Good morning.  This is Zandar's Dad.  I am sorry to tell you that he passed away over the weekend, peacefully in his sleep.  Fortunately, his computer was on and open to this page but I don't know if I will be able to post again.  This blog was Jon's passion.",
    "url": "http://zandarvts.blogspot.com/2023/11/last-post-please-read.html"
  },
  {
    "text": "A rare look at the devastation caused by AR-15 shootings  —  Editor's note: The photos, videos and personal accounts below are extremely disturbing and may be too upsetting for some people.  Read why The Post is publishing this story.  —  When a gunman fires an AR-15 ...",
    "url": "https://www.washingtonpost.com/nation/interactive/2023/ar-15-force-mass-shootings/"
  },
  {
    "text": "Judge to issue protective order in Georgia Trump case  —  Lawyer acknowledges sharing videos that prompted dispute.  —  A Fulton County judge Wednesday said he would draft an order protecting some evidence from pre-trial disclosure in the Donald Trump election interference case … ",
    "url": "https://www.ajc.com/politics/judge-to-issue-protective-order-in-georgia-trump-case/D5SWV2HPXND4VDMZNWYK3UDE5M/"
  },
  {
    "text": "How Trump plays the media on abortion  —  Since the fall of Roe v. Wade, abortion has been a losing issue for Republicans.  This was evident in this year's election: in Ohio, voters approved a constitutional amendment to enshrine abortion rights.  In Kentucky, pro-choice Governor Andy Beshear … ",
    "url": "https://popular.info/p/how-trump-plays-the-media-on-abortion"
  },
  {
    "text": "The Morning Briefing: So Much for ‘Nikkimentum’  —  Top O' the Briefing  —  Happy Thursday, dear Kruiser Morning Briefing friends.  Dalyxes was gaining quite the reputation for being able to delicately flavor moonshine whilst pairing it with nonpareils.  —  One of the most tiring things … ",
    "url": "https://pjmedia.com/stephen-kruiser/2023/11/16/the-morning-briefing-so-much-for-nikkimentum-n4923948"
  },
  {
    "text": "Where efforts to disqualify Trump from 2024 ballot stand  —  Former President Trump is set to soon learn his fate in a Colorado legal challenge seeking to remove him from the 2024 presidential ballot, after a judge heard closing arguments on Wednesday.",
    "url": "https://www.axios.com/2023/11/16/trump-efforts-disqualify-2024-ballot-14th-amendment"
  },
  {
    "text": "Biden Expected to Face Harsh Criticism in Classified-Document Probe  —  Special counsel isn't likely to bring a criminal case over handling of records from Biden's time as vice president and in the Senate  —  The prosecutor investigating why classified documents ended up at President Biden's home … ",
    "url": "https://www.wsj.com/politics/national-security/biden-expected-to-face-harsh-criticism-in-classified-document-probe-39c3c27f?mod=followamazon"
  },
  {
    "text": "Christie warns Trump's ‘vermin’ remark could incite others: 'He doesn't care'  —  GOP presidential candidate Chris Christie warned Wednesday that former President Trump's rhetoric, including his recent ‘vermin’ comment, could incite others,  —  “Well, I think that what he's done with his use of language … ",
    "url": "https://thehill.com/elections/4312705-christie-warns-trumps-vermin-remark-could-incite-others/"
  },
  {
    "text": "Starbucks Workers Plan Walkout During Red Cup Giveaway Day  —  Unionized employees say promotional events like Thursday's exacerbate staffing and scheduling problems at the chain's stores.  —  Thousands of unionized Starbucks workers plan to walk off the job on Thursday to press their demands … ",
    "url": "https://www.nytimes.com/2023/11/16/business/starbucks-strike-red-cup-day.html"
  },
  {
    "text": "Playbook: Biden and Xi clear the air  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  THE TRUTH IS OUT THERE — Garrett Graff for POLITICO Mag: “We Have a UFO Problem.  What We Don't Have (Yet) is a Serious Answer.”  —  SHOWDOWN ON SOUTH CAPITOL STREET … ",
    "url": "https://www.politico.com/newsletters/playbook/2023/11/16/bidens-one-two-step-with-china-00127542"
  },
  {
    "text": "Gavin Newsom Gave Millions to Mosques that Cheer the Annihilation of Jews  —  California Gov. Gavin Newsom (D.) has awarded millions of dollars in taxpayer funds to mosques whose leaders have preached anti-Semitic hate and called for violence against Israel.",
    "url": "https://freebeacon.com/california/gavin-newsom-gave-millions-to-mosques-that-cheer-the-annihilation-of-jews/"
  },
  {
    "text": "Scoop: U.S. warns Israel it's violating visa waiver deal with West Bank closure  —  The Biden administration warned Israel that it is violating the visa waiver agreement with the U.S. by preventing Palestinian Americans who live in the occupied West Bank from entering Israel since … ",
    "url": "https://www.axios.com/2023/11/16/israel-visa-waiver-palestinian-americans-us-violation"
  },
  {
    "text": "Ronna McDaniel is under siege — and, her critics concede, likely to survive  —  The RNC chair faces criticism from lawmakers, candidates and activists.  But the committee members themselves don't have much appetite for a change at this juncture.  —  Republican National Committee Chair Ronna McDaniel … ",
    "url": "https://www.politico.com/news/2023/11/16/ronna-mcdaniel-republican-national-committee-00127506"
  },
  {
    "text": "Trump's new Latino strategy casts him as victim of socialists … - Hialeah is more than 95% Hispanic, and the vast majority of those residents are Cuban Americans, a conservative electorate that identifies more with Republicans than many other Latino groups.",
    "url": "https://www.axios.com/2023/11/16/trump-new-latino-strategy-victim-socialists-florida"
  },
  {
    "text": "Capitol Police clash with group protesting ‘violently’ outside DNC  —  Capitol police say all members have been evacuated from the area.  —  Police officers wear gas masks as they keep watch outside the Democratic National Headquarters during a multi-denominational event hosted … ",
    "url": "https://abcnews.go.com/Politics/capitol-police-working-back-150-people-protesting-dnc/story?id=104930336"
  },
  {
    "text": "Once Florida's favorite son, Floridians turn on DeSantis in his bid for president  —  The Republican presidential field continues to narrow and former President Donald Trump has held on to a commanding lead ahead of primary contests.  That includes a sizable lead in Florida … ",
    "url": "https://www.npr.org/2023/11/16/1213355557/desantis-florida-president-candidate-voters-trump"
  }
]