[
  {
    "text": "Mark Meadows struggles to distance himself from Trump's plot  —  The many prosecutions involving former president Donald Trump effectively began in earnest Monday — and with a bang.  Former Trump White House chief of staff Mark Meadows opted to take the stand in Georgia with a bold … ",
    "url": "https://www.washingtonpost.com/politics/2023/08/29/mark-meadows-struggles-distance-himself-trumps-plot/"
  },
  {
    "text": "The testimony from Trump's White House chief of staff could change everything  —  Former White House chief of staff Mark Meadows rolled the dice on Monday with his opening move in the sprawling Fulton County election subversion trial: he took the stand himself.",
    "url": "https://www.cnn.com/2023/08/29/politics/mark-meadows-gamble-trump-fani-willis/"
  },
  {
    "text": "Here's how Trump may try to challenge Jack Smith and delay his March 4 trial  —  Attorneys for former President Donald Trump have previewed that they will be seeking to launch several legal maneuvers to gum up the federal election subversion case that has been brought against him by special counsel Jack Smith.",
    "url": "https://www.cnn.com/2023/08/29/politics/trump-election-case-legal-challenges/"
  },
  {
    "text": "‘Go after it’: GOP strategists say Republicans need to hit Biden on drug pricing  —  Republicans are working to persuade Americans that the Biden plan will stifle innovation and lead to price controls.  —  As President Joe Biden touts the first 10 drugs subject to Medicare price talks … ",
    "url": "https://www.politico.com/news/2023/08/29/biden-drug-prices-gop-00113404"
  },
  {
    "text": "Secretaries of state get ready for possible challenges to Trump's ballot access  —  Arizona's secretary of state is the latest to say his office is grappling with the potential effects of a move to block Trump from the ballot.  —  Arizona Secretary of State Adrian Fontes said Tuesday … ",
    "url": "https://www.nbcnews.com/politics/2024-election/secretaries-state-get-ready-possible-challenges-trumps-ballot-access-rcna102440"
  },
  {
    "text": "Over 100 former clerks of Justice Thomas sign open letter defending his integrity, independence  —  112 of Justice Thomas' former clerks say news stories attacking him are ‘part of larger attack on the Court’ and its ‘legitimacy’  —  EXCLUSIVE - Over 100 former clerks of Supreme Court Justice … ",
    "url": "https://www.foxnews.com/politics/over-100-former-clerks-justice-thomas-sign-open-letter-defending-his-integrity-independence"
  },
  {
    "text": "Recently indicted John Eastman is among those vouching for Clarence Thomas' integrity  —  Eastman was indicted in Georgia in connection with efforts to keep former President Donald Trump in office after his 2020 election loss.  He also faces disbarment proceedings.",
    "url": "https://www.nbcnews.com/politics/supreme-court/john-eastman-vouching-clarence-thomas-integrity-rcna102466"
  },
  {
    "text": "Supporting people's right to accurate and safe political discourse on X  —  More than half a billion people from around the world gather on X to talk about their interests in real-time, and that includes elections.  X enables people to directly engage on important topics with elected representatives … ",
    "url": "https://blog.twitter.com/en_us/topics/company/2023/supporting-peoples-right-to-accurate-and-safe-political-discourse-on-x"
  },
  {
    "text": "Florida reviewers of AP African American Studies sought ‘opposing viewpoints’ of slavery  —  When Florida rejected a new Advanced Placement course on African American Studies, state officials said they objected to the study of several concepts — like reparations, the Black Lives Matter movement and “queer theory.”",
    "url": "https://www.miamiherald.com/news/local/education/article278582149.html"
  },
  {
    "text": "Jack Smith's Team Grilled Witnesses About Rudy Giuliani's Drinking  —  The special counsel's interest in Rudy's drinking could play a role in undermining one of Trump's key legal defenses … In their questioning of multiple witnesses, Smith's team of federal investigators have asked questions … ",
    "url": "https://www.rollingstone.com/politics/politics-features/rudy-giuliani-jack-smith-donald-trump-jan6-1234814129/"
  },
  {
    "text": "When I Tell You Nikki Haley Is Pathetic, That's an Understatement  —  I wish it were as simple as that one Republican debate.  —  I wish the Nikki Haley onstage in Milwaukee last week — who called out Donald Trump for his profligate government spending, who implored her fellow Republicans … ",
    "url": "https://www.nytimes.com/2023/08/29/opinion/nikki-haley-trump-2024.html"
  },
  {
    "text": "GOP lawmaker arrested again after domestic violence charges: report  —  A Republican state representative in Ohio has been arrested for violating a protective order — while awaiting trial for a prior arrest for domestic violence.  —  According to Fox 8 News, Rep. Bob Young allegedly breached … ",
    "url": "https://www.rawstory.com/gop-lawmaker-arrested-again/"
  },
  {
    "text": "Scoop: Trumpworld sees Haley surging toward DeSantis  —  Trump pollster Tony Fabrizio is telling Republican donors that Nikki Haley “has surged” in Iowa since last week's GOP presidential debate — and that she and Vivek Ramaswamy are essentially tied with Florida Gov. Ron DeSantis in New Hampshire … ",
    "url": "https://www.axios.com/2023/08/29/trump-nikki-haley-desantis-debate-poll"
  },
  {
    "text": "America Is Using Up Its Groundwater Like There's No Tomorrow  —  Overuse is draining and damaging aquifers nationwide, a New York Times data investigation revealed.  —  A wealth of underground water helped create America, its vast cities and bountiful farmland.  Now, Americans are squandering that inheritance.",
    "url": "https://www.nytimes.com/interactive/2023/08/28/climate/groundwater-drying-climate-change.html"
  },
  {
    "text": "The Christian home-schooler who made ‘parental rights’ a GOP rallying cry  —  On a private call with Christian millionaires, home-schooling pioneer Michael Farris pushed for a strategy aimed at siphoning billions of tax dollars from public schools  —  The message Michael Farris had come … ",
    "url": "https://www.washingtonpost.com/education/2023/08/29/michael-farris-homeschoolers-parents-rights-ziklag/"
  },
  {
    "text": "A shutdown wouldn't halt Trump's trials, so Republicans seek to rein in his prosecutors  —  Federal criminal proceedings are exempted from shutdowns.  But GOP House members want to use a must-pass funding bill to defund or limit law enforcement investigating Trump.",
    "url": "https://www.nbcnews.com/politics/donald-trump/shutdown-wouldnt-halt-trumps-trials-republicans-seek-rein-prosecutors-rcna102152"
  },
  {
    "text": "Canada, citing potential dangers, warns LGBTQ travelers of US risks  —  Canada, citing the risk of potential dangers, is advising LGBTQ travelers planning trips to the United States to check how they might be affected by recently passed laws in some states, Ottawa said on Tuesday.",
    "url": "https://www.reuters.com/world/americas/canada-citing-potential-dangers-warns-lgbtq-travelers-us-risks-2023-08-29/"
  },
  {
    "text": "Texas Guardsmen spied on migrants via WhatsApp, mishandled secret docs  —  Senior leaders allegedly ignored oversight officials' concerns.  —  This article is co-published and co-reported with The Texas Tribune, a nonprofit newsroom that informs Texans about state policy and politics.",
    "url": "https://www.armytimes.com/news/your-army/2023/08/29/texas-guardsmen-spied-on-migrants-via-whatsapp-mishandled-secret-docs/"
  },
  {
    "text": "Anti-abortion activists who blockaded DC clinic found guilty on all counts  —  A jury deliberated for a day-and-a-half before convicting activist Lauren Handy and four co-defendants.  —  WASHINGTON — A jury convicted five anti-abortion activists Tuesday of conspiring to blockade a D.C. clinic in 2020 in violation of federal law.",
    "url": "https://www.wusa9.com/article/news/crime/anti-abortion-activists-who-blockaded-dc-clinic-found-guilty-on-all-counts-lauren-handy-john-hinshaw-heather-idoni-herb-geraghty-william-goodman/65-9101a154-5631-4ed6-96d1-767049b42bb1"
  },
  {
    "text": "Record-setting wildfires are burning across Louisiana, fueled by heat and drought  —  “It's just like all these things came together, creating the worst summer conceivably possible in south Louisiana,” one climatologist said.  —  Record-breaking heat, flash droughts and a high-pressure heat … ",
    "url": "https://www.nbcnews.com/news/us-news/louisiana-fire-tiger-island-rcna102362"
  },
  {
    "text": "Hurricane heads for state still recovering from 2022 storm  —  An “extremely dangerous” Hurricane Idalia is projected to bring lethal flooding and winds to a low-income, poorly insured region of Florida.  —  Hurricane Idalia is threatening to brush parts of Florida that still bear the damage … ",
    "url": "https://www.politico.com/news/2023/08/29/hurricane-idalia-florida-danger-00113332"
  },
  {
    "text": "Wisconsin Supreme Court chief justice accuses liberal majority of staging a ‘coup’  —  The conservative chief justice of the Wisconsin Supreme Court on Monday told the new liberal majority in a scathing email that they had staged a “coup” and conducted an “illegal experiment” … ",
    "url": "https://apnews.com/article/wisconsin-supreme-court-liberals-conservative-chief-justice-81d040f7a59c210c8ba2a4c8007834b5"
  },
  {
    "text": "The Final Days  —  Joe Biden was determined to get out of Afghanistan—no matter the cost.  —  august is the month when oppressive humidity causes the mass evacuation of official Washington.  In 2021, White House Press Secretary Jen Psaki piled her family into the car for a week at the beach.",
    "url": "https://www.theatlantic.com/magazine/archive/2023/10/afghanistan-withdrawal-biden-decision/675116/"
  }
]