[
  {
    "text": "McConnell endorses Trump after years of acrimony between the two men  —  The Senate minority leader is the highest-ranking Republican to back Trump, and the move could help the former president with major donors  —  Senate Minority Leader Mitch McConnell (R-Ky.) endorsed Donald Trump … ",
    "url": "https://www.washingtonpost.com/elections/2024/03/06/mcconnell-trump-endorse-2024/"
  },
  {
    "text": "Supreme Court sets Trump immunity claim in D.C. trial for April 25  —  The Supreme Court has scheduled argument for April 25 to review Donald Trump's claim that he is immune from criminal prosecution on charges of trying to overturn the results of the 2020 election.",
    "url": "https://www.washingtonpost.com/politics/2024/03/06/trump-immunity-supreme-court-argument-date/"
  },
  {
    "text": "It's not money that Elon Musk is contributing to Donald Trump  —  News that Elon Musk met with Donald Trump over the weekend prompted not gasps of surprise but, instead, the sort of “oh, sure, of course” response that comes from figuring out a mystery story written for children.",
    "url": "https://www.washingtonpost.com/politics/2024/03/06/trump-musk-2024-contributions/"
  },
  {
    "text": "Trump is degenerating before our eyes — MAGA voters don't notice or don't care  —  GOP base is now so consumed by incoherent QAnon babble that Trump's obvious deterioration doesn't even register  —  Despite the best efforts of the Beltway press to present him as a spry young man next … ",
    "url": "https://www.salon.com/2024/03/06/is-degenerating-before-our-eyes--maga-dont-notice-or-dont-care/"
  },
  {
    "text": "Pro-Haley super PAC relaunches as ‘Haley Voters for Biden’  —  The News  —  A super PAC that urged non-Republicans to cast primary votes for Nikki Haley is pivoting to November, urging Haley's voters to support President Joe Biden.  Starting today, Primary Pivot will become Haley Voters for Biden … ",
    "url": "https://www.semafor.com/article/03/06/2024/pro-haley-super-pac-relaunches-as-haley-voters-for-biden"
  },
  {
    "text": "Dean Phillips suspends 2024 presidential campaign … - “I am going to suspend my campaign, and I will be right now endorsing President Biden,” Phillips said in an interview with WCCO Radio on Wednesday. … - “Congratulations to Joe Biden, Uncommitted, Marianne Williamson … ",
    "url": "https://www.axios.com/2024/03/06/dean-phillips-suspends-campaign-2024-presidential"
  },
  {
    "text": "Mark Robinson: 'I Absolutely Want To Go Back To The America Where Women Couldn't Vote'  —  In a newly unearthed video, North Carolina's GOP nominee for governor says America was better then because Republicans “fought for real social change.”  —  LOADING  —  On Tuesday, Lt. Gov. Mark Robinson won … ",
    "url": "https://www.huffpost.com/entry/north-carolina-gop-mark-robinson-women-vote_n_65e7d899e4b0f9d26cacc002"
  },
  {
    "text": "House passes $460 billion package of spending bills.  Senate expected to act before shutdown deadline  —  The House passed a $460 billion package of spending bills Wednesday that would keep money flowing to key federal agencies through the remainder of the budget year.",
    "url": "https://apnews.com/article/government-shutdown-funding-deadline-congress-2533c1a6b6eb25cc63e78f089e27d3a0"
  },
  {
    "text": "National Guard and State Police Will Patrol the Subways and Check Bags  —  Gov. Kathy Hochul, amid a series of violent crimes on the subway, said she would deploy 1,000 members of the State Police and National Guard to the transit system.  —  Gov. Kathy Hochul said on Wednesday … ",
    "url": "https://www.nytimes.com/2024/03/06/nyregion/subway-national-guard-police.html"
  },
  {
    "text": "Ex-Congressional candidate Daniel Rodimer wanted for murder in Las Vegas  —  LAS VEGAS (KSNV) — Former professional wrestler and congressional candidate Daniel Rodimer is wanted for murder in connection with a homicide on the Las Vegas Strip last year, authorities have confirmed.",
    "url": "https://news3lv.com/news/local/ex-congressional-candidate-daniel-rodimer-wanted-for-murder-in-las-vegas-lvjc-lvmpd-homicide-investigation-cops-courts"
  },
  {
    "text": "Ex-GOP Candidate and Former WWE Wrestler Is Wanted for Vegas Murder  —  Daniel Rodimer, a former wrestler who ran for Congress in 2020, is accused of killing someone at a resort on the Las Vegas Strip.  —  Daniel Rodimer, the disgraced GOP congressional candidate who was endorsed … ",
    "url": "https://www.thedailybeast.com/ex-gop-congressional-candidate-and-former-wwe-wrestler-daniel-rodimer-is-wanted-for-murder"
  },
  {
    "text": "Scoop: House GOP tries to shut down State of the Union heckling … - Johnson told members, “we should be professional, we should maintain a high standard of decorum,” said Rep. Don Bacon (R-Neb.).  — “He's reminding us to be respectful of the institution ... and to the president … ",
    "url": "https://www.axios.com/2024/03/06/biden-sotu-republicans-heckling-johnson"
  },
  {
    "text": "Chinese National Residing in California Arrested for Theft of Artificial Intelligence-Related Trade Secrets from Google  —  For Immediate Release  —  Defendant Allegedly Pilfered Technology from Google While Secretly Working for Two PRC-Based Technology Companies  —  View the indictment here.",
    "url": "https://www.justice.gov/opa/pr/chinese-national-residing-california-arrested-theft-artificial-intelligence-related-trade"
  },
  {
    "text": "A federal agency has told rural counties and small towns how to safeguard their elections, but not all can afford the fixes  —  Local officials said that amid baseless claims of stolen and rigged elections, they worry about the physical safety of election workers and the sites where votes are counted.",
    "url": "https://www.nbcnews.com/politics/2024-election/rural-counties-small-towns-need-money-protect-elections-november-2024-rcna141918"
  },
  {
    "text": "Black couple rented to a Chinese American family when nobody would.  Now, they're donating $5M to Black community.  —  The Dongs are selling the home their family rented and eventually bought from Gus Thompson, a former slave, and his wife, Emma.  The Dongs will donate the proceeds to Black students.",
    "url": "https://www.nbcnews.com/news/us-news/black-chinese-family-coronado-california-rcna140717"
  },
  {
    "text": "Bernie Sanders Tells Colbert He Won't Miss Kyrsten Sinema ‘At All’  —  The Arizona senator announced yesterday that she won't be seeking re-election, and Bernie Sanders is just fine with that: “I will not miss working with Senator Sinema.”  —  Senator Bernie Sanders (I-VT) … ",
    "url": "https://www.thedailybeast.com/bernie-sanders-tells-colbert-he-wont-miss-kyrsten-sinema-at-all"
  },
  {
    "text": "Crew members killed for first time in Houthi attack on commercial ship near Yemen, US officials say  —  A Houthi ballistic missile attack on a commercial ship in the Gulf of Aden resulted in at least two fatalities among the crew members, two US officials told CNN, marking … ",
    "url": "https://www.cnn.com/2024/03/06/politics/crew-members-killed-houthi-attack/"
  },
  {
    "text": "The Outrage Machine Strikes Again (14th Amendment, Section 3)  —  In Part III of the Misinformation-Outrage Cycle, I analyzed the DOJ investigation and history of the attacks on Merrick Garland.  If you missed it, please start there.  I concluded with this:  —  People without intellectual humility rarely admit they were wrong.",
    "url": "https://terikanefield.com/the-outrage-machine-strikes-again-14th-amendment-section-3/"
  },
  {
    "text": "Trump co-defendant's lawyer presents argument for disqualifying Fani Willis to Georgia state senators  —  The state Senate committee does not have any power to disqualify Willis from prosecuting the election interference case against Trump and his co-defendants.",
    "url": "https://www.nbcnews.com/politics/politics-news/trump-co-defendants-lawyer-presents-argument-disqualifying-fani-willis-rcna142015"
  },
  {
    "text": "Keller high school backtracks, students will perform ‘The Laramie Project’  —  Keller high school students will perform The Laramie Project, a play that explores the aftermath of the 1998 murder of a gay student in Wyoming.The Timber Creek High School production is expected to go on in May.\"Now we can tell … ",
    "url": "https://www.dallasnews.com/news/education/2024/03/06/keller-high-school-backtracks-will-perform-the-laramie-project/"
  }
]