[
  {
    "text": "Trump's criminal trial is off to a bad start for him  —  PN is a reader-supported publication made possible by paid subscribers.  If you aren't one, please click the button to support our independent journalism.  —  ⚖️ Subscribe to Public Notice ⚖️",
    "url": "https://www.publicnotice.co/p/trump-criminal-hush-money-trial-pecker-stormy"
  },
  {
    "text": "The gag “trap” of Manhattan's hush-money trial: “Trump will take the bait”  —  Will Donald Trump take the stand in his own defense?  Experts weigh in on his first criminal trial  —  The second week of Donald Trump's historic criminal trial in Manhattan for allegedly paying “hush money” … ",
    "url": "https://www.salon.com/2024/04/29/the-gag-trap-of-manhattans-hush-money-trial-trump-will-take-the-bait/"
  },
  {
    "text": "Trump says 4 words about anti-Israel protests on college campuses as arrests skyrocket  —  Former President Trump's post came as the number of students and antisemitic agitators arrested has approached 900 since April 18  —  Former President Trump weighed in on Monday about the anti-Israel demonstrations … ",
    "url": "https://www.foxnews.com/politics/trump-says-anti-israel-protests-college-campuses-arrests-skyrocket"
  },
  {
    "text": "Playbook: Will MTG put up or shut up?  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  LIVE FROM RIYADH — AP's Matthew Lee: “U.S. Secretary of State ANTHONY BLINKEN said Monday that Israel must still do more to increase the flow of humanitarian aid … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/04/29/will-mtg-put-up-or-shut-up-00154883"
  },
  {
    "text": "On Friday, in an interview with CNN anchor Kaitlan Collins, Trump's former attorney general William Barr brushed off the recent news that Trump, furious that the story he had taken refuge in a bunker during the Black Lives Matter protests in summer 2020 had leaked, called for the White House leaker to be executed.",
    "url": "https://heathercoxrichardson.substack.com/p/april-28-2024"
  },
  {
    "text": "An assassination plot on American soil reveals a darker side of Modi's India  —  The White House went to extraordinary lengths last year to welcome Indian Prime Minister Narendra Modi in a state visit meant to bolster ties with an ascendant power and potential partner against China.",
    "url": "https://www.washingtonpost.com/world/2024/04/29/india-assassination-raw-sikhs-modi/"
  },
  {
    "text": "Gaetz gets last-minute Florida GOP primary challenger in boost to McCarthy allies  —  .  —  Former California Rep. Kevin McCarthy has a chance for revenge against Rep. Matt Gaetz (R-FL) in the form of a GOP primary challenger in the 2024 election.  —  Former naval officer … ",
    "url": "https://www.washingtonexaminer.com/news/house/2982877/gaetz-florida-gop-primary-challenger-boost-mccarthy-allies/"
  },
  {
    "text": "Statement from Columbia University President Minouche Shafik  —  Dear fellow members of the Columbia community,  —  Our University is committed to four core principles, which underpin all of our work and our shared values as a community:  —  First, we must keep all members of our community physically safe on campus.",
    "url": "https://president.columbia.edu/news/statement-columbia-university-president-minouche-shafik-4-29"
  },
  {
    "text": "Why millions of Americans may lose internet access tomorrow  —  In 2024, reliable access to high-speed internet is no longer a luxury; it is a basic necessity.  From job applications to managing personal finances and completing school work, internet access is an essential part of daily life.",
    "url": "https://popular.info/p/why-millions-of-americans-may-lose"
  },
  {
    "text": "This congresswoman was born and raised in Ukraine.  She just voted against aid for her homeland  —  SHERIDAN, Ind. (AP) — U.S. Rep. Victoria Spartz, the first and only Ukrainian-born member of Congress, emerged early on as a natural advocate for supporting her native country in its war with Russia.",
    "url": "https://apnews.com/article/indiana-primary-election-victoria-spartz-ukraine-57fb403caa6a9bbe459639baacfdb7fa"
  },
  {
    "text": "Court says state health-care plans can't exclude gender-affirming surgery  —  A federal appellate court in Richmond became the first in the country to rule that state health-care plans must pay for gender-affirming surgeries, a major win for transgender rights amid a nationwide wave of anti-trans activism and legislation.",
    "url": "https://www.washingtonpost.com/dc-md-va/2024/04/29/gender-affirming-surgery-state-health-care-plans/"
  },
  {
    "text": "Tensions grow between Trump and Lake in Arizona race for Senate  —  The former president fears that GOP candidate Kari Lake might not win and will drag down his own prospects in the battleground state  —  Former president Donald Trump has long had a soft spot for his acolyte Kari Lake … ",
    "url": "https://www.washingtonpost.com/politics/2024/04/29/trump-kari-lake-arizona-tensions/"
  },
  {
    "text": "Peter Navarro's get-out-of-jail request is again rejected by the Supreme Court  —  The Supreme Court on Monday for a second time shot down a request from former Trump adviser Peter Navarro to avoid further prison time over his contempt of Congress conviction.",
    "url": "https://www.cnn.com/2024/04/29/politics/supreme-court-rejects-peter-navarros-get-of-jail-request-again/"
  },
  {
    "text": "George Santos hawking Cameo videos with his drag queen alter ego: 'I've decided to bring Kitara out of the closet'  —  Former Rep. George Santos says he's bringing Kitara “out of the closet,” offering Cameo videos with his apparent drag queen persona for money.",
    "url": "https://thehill.com/blogs/in-the-know/4629388-george-santos-cameo-drag-queen-kitara/"
  },
  {
    "text": "Lawyers for Hunter Biden plan to sue Fox News ‘imminently’  —  A letter obtained by NBC News says action is pending because of Fox's alleged “conspiracy and subsequent actions to defame Mr. Biden and paint him in a false light.”  —  Lawyers for Hunter Biden plan to sue Fox News “imminently … ",
    "url": "https://www.nbcnews.com/politics/politics-news/lawyers-hunter-biden-plan-sue-fox-news-rcna149707"
  },
  {
    "text": "Surprise Tactics and Legal Threats: Inside R.F.K. Jr.'s Ballot Access Fight  —  Robert F. Kennedy Jr.'s effort to get on the ballot in 50 states has already cost millions, federal campaign finance records show.  —  As Robert F. Kennedy Jr.'s independent presidential campaign mounts … ",
    "url": "https://www.nytimes.com/2024/04/29/us/politics/rfk-jr-ballot-access.html"
  },
  {
    "text": "Biden Inc: Jim Biden's Secret Partnership with Qatar  —  Some have warned about billions of dollars in Qatari money flooding American campuses as a means to radicalize students.  Perhaps we should worry more about the campus at 1600 Pennsylvania Avenue.  Politico reported yesterday … ",
    "url": "https://hotair.com/ed-morrissey/2024/04/29/biden-inc-jim-bidens-secret-partnership-with-qatar-n3787411"
  },
  {
    "text": "Trump to Attend Las Vegas Fundraiser with $844,600 Tickets  — Trump increasingly courting wealthy donors to close money gap  — Recent poll shows Trump up over Biden in swing-state Nevada  —  Presumptive Republican nominee Donald Trump is slated to attend a fundraiser in swing-state Nevada … ",
    "url": "https://www.bloomberg.com/news/articles/2024-04-29/trump-to-attend-las-vegas-fundraiser-with-844-600-tickets"
  },
  {
    "text": "Supreme Court rejects Elon Musk over agreement with SEC to vet social media posts  —  Lawyers for the billionaire businessman say that the “Twitter sitter” provision in an agreement with the Securities and Exchange commission violated his free speech rights.",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-rejects-elon-musk-agreement-sec-vet-social-media-posts-rcna149579"
  }
]