[
  {
    "text": "Trump exempts phones, computers, chips from new tariffs … Smartphones and computers will be exempted from President Donald Trump's reciprocal tariffs, according to new guidance from U.S. Customs and Border Protection.  —  The guidance comes after Trump earlier this month imposed 125% tariffs … ",
    "url": "https://www.cnbc.com/2025/04/12/trump-exempts-phones-computers-chips-tariffs-apple-dell.html"
  },
  {
    "text": "Trump Exempts Phones, Computers, Chips From ‘Reciprocal’ Tariffs  —  President Donald Trump's administration exempted smartphones, computers and other electronics from its so-called reciprocal tariffs, potentially cushioning consumers from sticker shock while benefiting electronics giants including Apple Inc. and Samsung Electronics Co.",
    "url": "https://www.bloomberg.com/news/articles/2025-04-12/trump-exempts-phones-computers-chips-from-reciprocal-tariffs"
  },
  {
    "text": "Trump excludes smartphones from reciprocal tariffs  —  Tech including routers and selected computers get reprieve after a week of turbulence in US markets  —  The Trump administration has excluded smartphones from its steep “reciprocal” tariffs as it battles to calm global markets by tempering … ",
    "url": "https://www.ft.com/content/3eb48a07-7cb0-4a44-9159-eb5b402c2fec"
  },
  {
    "text": "Trump Wants to Be Impeached Again  —  It's already in the cards thanks to his ill-founded trade war, no matter how that war plays out.  —  This week the system worked.  Donald Trump blinked.  The unwinding is still just beginning.  It will be painful and tumultuous.",
    "url": "https://www.wsj.com/opinion/trump-wants-to-be-impeached-again-6f4ea931?st=pE1obU&reflink=article_copyURL_share"
  },
  {
    "text": "CSMS # 64724565 - UPDATED GUIDANCE - Reciprocal Tariff Exclusion for Specified Products; April 5, 2025 Effective Date  —  The purpose of this message is to provide further guidance on the additional duties due on imported merchandise which were imposed by Executive Order 14257, issued April 2 … ",
    "url": "https://content.govdelivery.com/bulletins/gd/USDHSCBP-3db9e55?wgt_ref=USDHSCBP_WIDGET_2"
  },
  {
    "text": "Trump administration overrode Social Security staff to list immigrants as dead  —  A senior executive who objected was marched out of his office and put on leave, while earlier warnings about the agency's deaths database were ignored.  —  Just now  —  Two days after the Social Security … ",
    "url": "https://www.washingtonpost.com/politics/2025/04/12/trump-immigrants-dead-social-security/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ0NDMwNDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ1ODEyNzk5LCJpYXQiOjE3NDQ0MzA0MDAsImp0aSI6ImRkOWI5MzkzLWFmMWUtNGQ5Zi04NzVkLWU5NWYwNDViMTIyZiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzA0LzEyL3RydW1wLWltbWlncmFudHMtZGVhZC1zb2NpYWwtc2VjdXJpdHkvIn0.hgTD0d-mBwWvUvRMgm_JeeYh4t2iZSGyg8tbs0wg8BU&itid=gfta"
  },
  {
    "text": "Team Trump Is Gaming Out How to Ship U.S. Citizens to El Salvador  —  Trump officials are talking internally about denaturalizing American citizens — and potentially sending some to El Salvador  —  Donald Trump and his White House have moved to deport green-card holders for espousing pro-Palestinian views … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-el-salvador-us-citizens-denaturalization-1235315975/"
  },
  {
    "text": "Columbia anti-Israel protester Mahmoud Khalil can be deported, judge rules  —  Mahmoud Khalil faces deportation for his role in Columbia University campus protests against Israel  —  An immigration judge has ruled that Mahmoud Khalil can be deported from the U.S. due to his involvement … ",
    "url": "https://www.foxnews.com/us/columbia-anti-israel-protester-mahmoud-khalil-can-deported-judge-rules"
  },
  {
    "text": "Staffers Walk Out of RFK Jr.'s Slur-Ridden Speech About Deep State  —  LOSING HEARTS AND MINDS  —  In Kennedy's bonkers speech to FDA employees on Friday, he accused agency employees of being shills for the industries they regulate.  —  Robert F. Kennedy Jr. stunned FDA staff Friday … ",
    "url": "https://www.thedailybeast.com/staffers-walk-out-of-rfk-jrs-slur-ridden-speech-about-deep-state/"
  },
  {
    "text": "Musk's Latest Fraud Finding Isn't What It Seems  —  His team found cases of seemingly fake people receiving unemployment benefits.  But that fake data exists for a reason.  —  Elon Musk and his Department of Government Efficiency announced this week that they had found something especially startling … ",
    "url": "https://www.nytimes.com/2025/04/12/upshot/musk-doge-fraud-claims.html?unlocked_article_code=1._E4.Zcxe.kxPDVObvHH55&smid=bs-share"
  },
  {
    "text": "Trump grants military control over strip of federal land along US southern border  —  It marks an escalation in the president's use of the military to facilitate his sweeping immigration agenda.  —  A 60-foot wide strip of land along three southwestern border states will be placed under … ",
    "url": "https://www.politico.com/news/2025/04/11/trump-grants-military-control-over-strip-of-federal-land-along-us-southern-border-00287606"
  },
  {
    "text": "Pennsylvania Man Charged with Making Threats to Assault and Murder President Donald J. Trump, Other U.S. Officials, and Immigration and Customs Enforcement Agents  —  For Immediate Release  —  Shawn Monper, 32, a resident of Butler, Pennsylvania, has been charged by federal criminal complaint … ",
    "url": "https://www.justice.gov/opa/pr/pennsylvania-man-charged-making-threats-assault-and-murder-president-donald-j-trump-other-us"
  },
  {
    "text": "Trump envoy's embrace of Russian demands worries Republicans, U.S. allies  —  Less than 48 hours after dining with a negotiator sent by Russian President Vladimir Putin in Washington last week, Steve Witkoff, the U.S. special envoy leading talks with Moscow, sat down with President Donald Trump … ",
    "url": "https://www.reuters.com/world/trump-envoys-embrace-russian-demands-worries-republicans-us-allies-2025-04-11/"
  },
  {
    "text": "Five More Big Law Firms Reach Deals With Trump  —  Kirkland & Ellis, Latham & Watkins, A&O Shearman, Simpson Thacher & Bartlett and Cadwalader, Wickersham & Taft agreed to do free legal work on causes the White House supports.  —  Five more prominent law firms facing potential punitive action … ",
    "url": "https://www.nytimes.com/2025/04/11/business/trump-law-firms-kirkland-ellis-latham-watkins.html"
  },
  {
    "text": "DOGE takes over federal grants website, wresting control of billions  —  A DOGE engineer removed users' access to grants.gov, threatening to further slow the process of awarding thousands of federal grants per year.  —  U.S. DOGE Service employees have inserted themselves … ",
    "url": "https://www.washingtonpost.com/politics/2025/04/11/doge-controls-federal-grant-postings/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ0MzQ0MDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ1NzI2Mzk5LCJpYXQiOjE3NDQzNDQwMDAsImp0aSI6Ijk3MWVjOTI5LTgwYjktNGM0Zi1hNzdjLTc2Y2ZhNzE2OGE4YiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzA0LzExL2RvZ2UtY29udHJvbHMtZmVkZXJhbC1ncmFudC1wb3N0aW5ncy8ifQ.v43T-h7cb-PB9d8KuXfxz3q0Ste7SjxuYeRdrNFgHHc&itid=gfta"
  },
  {
    "text": "F.B.I. Suspends Bureau Employee on Patel's So-Called Enemies List  —  The employee was a longtime counterintelligence analyst who had worked on the F.B.I.'s investigation examining Russian meddling in the 2016 presidential election.  —  The F.B.I. has suspended an analyst on Kash Patel's … ",
    "url": "https://www.nytimes.com/2025/04/11/us/politics/fbi-suspends-employee-patel-enemies.html"
  },
  {
    "text": "“Slow Pay, Low Pay or No Pay”  —  Uncovered: How the Insurance Industry Denies Coverage to Patients  — Shortchanged: Blue Cross Louisiana OK'd mastectomies and breast reconstructions for women with cancer but refused to pay a hospital's full bills.  For some claims, it paid nothing.",
    "url": "https://www.propublica.org/article/blue-cross-blue-shield-louisiana-insurance-lawsuit-breast-cancer-doctors"
  },
  {
    "text": "Palantir Is Helping DOGE With a Massive IRS Data Project  —  For the last three days, DOGE and a handful of Palantir representatives, along with dozens of career IRS engineers, have been collaborating to build a “mega API,” WIRED has learned.  —  Palantir, the software company cofounded by Peter Thiel … ",
    "url": "https://www.wired.com/story/palantir-doge-irs-mega-api-data/"
  },
  {
    "text": "‘A new golden age’: how rightwing media stuck by Trump as global markets collapsed  —  Trump's tariffs were sometimes played down, sometimes cheered but rarely seriously questioned by the right  —  While Donald Trump recently instituted and paused hefty tariffs, sparking a trade war and chaos … ",
    "url": "https://www.theguardian.com/us-news/2025/apr/12/trump-tariffs-rightwing-media-fox-news"
  },
  {
    "text": "Freak sell-off of ‘safe haven’ US bonds raises fear that confidence in America is fading  —  The upheaval in stocks has been grabbing all the headlines, but there is a bigger problem looming in another corner of the financial markets that rarely gets headlines: Investors are dumping U.S. government bonds.",
    "url": "https://apnews.com/article/treasurys-bond-market-yield-tariff-46b4818710f01b8cc93fd002081167b0"
  },
  {
    "text": "Trump Cuts Funds for Boston's Museum of African American History  —  When people ask me to take them to the most important historic site in Boston, I take them to the Museum of African American History (MAAH) on Beacon Hill.  The museum, located in Smith Court along Joy Street … ",
    "url": "https://kevinmlevin.substack.com/p/trump-cuts-funds-for-bostons-museum"
  },
  {
    "text": "Bessent Takes Tricky Center Stage as Trade Wars Roil U.S. Economy  —  The Treasury secretary received counsel and criticism from some of his predecessors over President Trump's policies.  —  The traditional gathering of former Treasury secretaries to welcome a newly minted one into the fold … ",
    "url": "https://www.nytimes.com/2025/04/12/us/politics/bessent-trump-treasury-tariffs.html"
  },
  {
    "text": "‘Completely out of touch’: golf and dinners for ‘king’ Trump as economy melts down  —  Casual attitude as markets fall suggests man detached from anxieties of ordinary voters - and surrounded by yes men  —  After lighting a fuse under global financial markets, Donald Trump stepped back - all the way to a Florida golf course.",
    "url": "https://www.theguardian.com/us-news/2025/apr/12/trump-king-economy-golf"
  }
]