[
  {
    "text": "DeSantis booed at vigil for victims of racist shooting in Florida  —  Florida Gov. Ron DeSantis, a GOP presidential candidate, was met with boos while speaking late Sunday at a vigil held for the three victims of a racially motivated shooting in Jacksonville.",
    "url": "https://thehill.com/homenews/state-watch/4174426-desantis-booed-at-vigil-for-victims-of-racist-shooting-in-florida/"
  },
  {
    "text": "Jacksonville gunman in racially motivated attack legally bought two weapons earlier this year, sheriff says  —  The White gunman who killed three Black people in a racially motivated attack at a Dollar General store in Jacksonville, Florida, on Saturday legally purchased the two firearms … ",
    "url": "https://www.cnn.com/2023/08/27/us/jacksonville-florida-shooting-sunday/"
  },
  {
    "text": "The Federalist Society's mugshots  —  This entirely free edition of Public Notice is made possible by paid subscribers.  If you appreciate our work and aren't already one, please support us by signing up.  Just click the button below for a free trial.  —  Sign up for Public Notice free trial",
    "url": "https://www.publicnotice.co/p/jeffrey-clark-eastman-charges-federalist-society"
  },
  {
    "text": "Meadows heads to federal court for first skirmish in Trump Georgia case  —  Former White House chief of staff will ask federal judge to take over the case — and then to dismiss charges against him related to the 2020 election  —  Lawyers for Donald Trump's former chief of staff Mark Meadows … ",
    "url": "https://www.washingtonpost.com/national-security/2023/08/28/mark-meadows-federal-court-trump-georgia-election-case/"
  },
  {
    "text": "Trump lawyers back in D.C. federal court as judge prepares to schedule trial date  —  Washington — A federal judge in Washington, D.C. is set to decide on Monday when former President Donald Trump will stand trial in the 2020 election-related case brought by special counsel Jack Smith … ",
    "url": "https://www.cbsnews.com/news/trump-dc-trial-date-to-be-scheduled-judge/"
  },
  {
    "text": "Trump's indictments: Polling shows half of Americans want him to suspend his campaign, and more takeaways  —  Despite what he claims, he isn't getting a continued bounce in support.  —  The most recent ABC News/Ipsos poll, conducted Aug. 15-17, showed some problems for former President Donald Trump … ",
    "url": "https://abcnews.go.com/Politics/trumps-indictments-polling-shows-half-americans-suspend-campaign/story?id=102342093"
  },
  {
    "text": "French education minister announces ban on Islamic dress in schools  —  PARIS — French Education Minister Gabriel Attal announced on Sunday that France will ban the Islamic garment known as the abaya in schools.  —  “The school of the Republic was built around strong values, secularism is one of them. ...",
    "url": "https://www.politico.eu/article/french-education-minister-announces-ban-on-islamic-dress-in-schools/"
  },
  {
    "text": "We must keep marching toward Dr. King's dream  —  Joe Biden is president of the United States.  —  Sixty years ago, the Rev. Martin Luther King Jr. and hundreds of thousands of fellow Americans marched on Washington for jobs and freedom.  In describing his dream for us all … ",
    "url": "https://www.washingtonpost.com/opinions/2023/08/27/joe-biden-king-march-on-washington-jobs-freedom/"
  },
  {
    "text": "House Republicans' road to power runs through New York.  Stefanik is driving  —  Elise Stefanik insists she has a plan that will allow the party to hold off a Democratic offensive.  —  POTSDAM, N.Y. — Elise Stefanik is betting big on 2024.  —  The No. 3 House Republican says she convinced … ",
    "url": "https://www.politico.com/news/2023/08/28/stefanik-plans-100m-campaign-push-in-home-state-new-york-00113073"
  },
  {
    "text": "August 2023 National Poll: Trump Debate Snub May Open Door for Other Candidates  —  Home Polls August 2023 National Poll: Trump Debate Snub May Open Door for Other Candidates  —  Hunter Biden Legal Issues Offsetting Trump Indictments for Independents  —  A new Emerson College Polling survey … ",
    "url": "https://emersoncollegepolling.com/august-2023-national-poll-trump-debate-snub-may-open-door-for-other-candidates/"
  },
  {
    "text": "If the U.S. economy is doing well, why do so many Americans say it's terrible?  —  The leading economic indicators show the U.S. economy is performing well, but most Americans still believe economic conditions are extremely poor — as if the country was mired in a deep recession.  What explains this discrepancy?",
    "url": "https://popular.info/p/if-the-us-economy-is-doing-well-why"
  },
  {
    "text": "Republicans seize on gasoline prices, but the U.S. is pumping oil faster than ever  —  GOP presidential candidates are blaming pump prices on President Joe Biden's clean energy policies, even though the U.S. is churning out record amounts of oil.  —  The late-summer surge in gasoline prices … ",
    "url": "https://www.politico.com/news/2023/08/28/republicans-gas-prices-oil-production-00111626"
  },
  {
    "text": "Americans Still Put Their Trust in Juries.  Will Trump's Trials Break That Faith?  —  A new survey provides a portrait of the type of American who serves on a jury and a rare window into the thoughts of the kinds of people who may decide Donald Trump's fate.",
    "url": "https://www.nytimes.com/2023/08/28/us/juries-trust-trump-trials.html"
  },
  {
    "text": "The Real Story Behind Ron DeSantis' Newest Fired Prosecutor  —  Ron DeSantis bragged at the GOP debate about firing two prosecutors in his state.  His latest conquest is now speaking out. … When Florida Gov. Ron DeSantis finally spoke to a national audience on stage at last week's … ",
    "url": "https://www.thedailybeast.com/the-real-story-behind-ron-desantis-newest-fired-prosecutor"
  }
]