[
  {
    "text": "Metadata Shows the FBI's ‘Raw’ Jeffrey Epstein Prison Video Was Likely Modified  —  There is no evidence the footage was deceptively manipulated, but ambiguities around how the video was processed may further fuel conspiracy theories about Epstein's death.  —  The United States Department … ",
    "url": "https://www.wired.com/story/metadata-shows-the-dojs-raw-jeffrey-epstein-prison-video-was-likely-modified/"
  },
  {
    "text": "Scoop: FBI's Dan Bongino clashes with AG Bondi over handling of Epstein files  —  FBI deputy director Dan Bongino took a day off from work Friday after clashing at the White House with Attorney General Pam Bondi over their handling of the Jeffrey Epstein files, four sources familiar with the conflict told Axios.",
    "url": "https://www.axios.com/2025/07/11/epstein-files-dan-bongino-pam-bondi-trump"
  },
  {
    "text": "Deputy FBI Director Bongino has told people he is considering resigning amid Epstein files fallout  —  Deputy FBI Director Dan Bongino has told people he is considering resigning amid a major clash between the FBI and Justice Department over the continued fallout from the release of the Jeffrey Epstein memo … ",
    "url": "https://cnn.com/2025/07/11/politics/bongino-consider-resigning-epstein-files"
  },
  {
    "text": "Surge in U.S. Concern About Immigration Has Abated  —  WASHINGTON, D.C. — Americans have grown markedly more positive toward immigration over the past year, with the share wanting immigration reduced dropping from 55% in 2024 to 30% today.  At the same time, a record-high 79% of U.S. adults … ",
    "url": "https://news.gallup.com/poll/692522/surge-concern-immigration-abated.aspx"
  },
  {
    "text": "Skydance Is in Early Talks to Acquire The Free Press  —  David Ellison, the founder of Skydance, and Bari Weiss, the co-founder of The Free Press, are attending the annual Allen & Co. conference in Sun Valley this week.  —  David Ellison, the chief executive of the media company Skydance … ",
    "url": "https://www.nytimes.com/2025/07/11/business/free-press-skydance-acquisition-talks.html?unlocked_article_code=1.Vk8.m5g6.IJC2jLmbvLKm&smid=bs-share"
  },
  {
    "text": "Harvard Explores New Center for Conservative Scholarship Amid Trump Attacks  —  The Ivy League school has discussed an effort to ‘support viewpoint diversity’ with potential donors, says it ‘will not be partisan’  —  Harvard leaders have discussed creating a program that people briefed … ",
    "url": "https://www.wsj.com/us-news/education/harvard-conservative-scholarship-center-trump-attacks-a187242a?st=XRTSgQ&reflink=article_copyURL_share"
  },
  {
    "text": "Trump administration moves away from abolishing FEMA  —  As the president heads to Texas to see the impact of last week's deadly flash floods, the White House has backed away from plans to abolish the agency, officials said.  —  For months, President Donald Trump and his homeland security secretary … ",
    "url": "https://www.washingtonpost.com/politics/2025/07/11/trump-fema-texas-floods/"
  },
  {
    "text": "Emil Bove declines to rule out 3rd Trump term or denounce Jan. 6 rioters in Senate questionnaire  —  Washington — Emil Bove, a top Justice Department official who previously served as President Trump's criminal defense attorney, declined to rule out the possibility of the president running … ",
    "url": "https://www.cbsnews.com/news/emil-bove-senate-questionnaire-trump-third-term-january-6/"
  },
  {
    "text": "Shunned Myanmar leader thrilled at US contact after Trump tariff letter  —  Min Aung Hlaing expresses ‘sincere appreciation’ for letter from US president threatening 40% tariff  —  Myanmar's military leader has praised Donald Trump and asked him to lift sanctions, as the junta sought … ",
    "url": "https://www.theguardian.com/world/2025/jul/11/myanmar-military-leader-min-aung-hlaing-praises-donald-trump"
  },
  {
    "text": "Behind Trump's Decision to Tax Brazil to Save Bolsonaro  —  Right-wing Brazilians wanted sanctions against the judge prosecuting Brazil's former president.  President Trump opted for something far bigger — tariffs.  —  Since March, the son of the former Brazilian president Jair Bolsonaro … ",
    "url": "https://www.nytimes.com/2025/07/11/world/americas/brazil-trump-tariffs.html"
  },
  {
    "text": "Start Budgeting Now  —  Households will pay an average of $2,400 more for goods this year, thanks to Trump's policies.  —  You might have forgotten about the trade war, but the trade war has not forgotten about you.  —  This week, Donald Trump reignited the global financial conflict he started in January … ",
    "url": "https://www.theatlantic.com/economy/archive/2025/07/trump-tariffs-trade-war-ongoing/683476/?gift=201cWZnM2XBz2eP81zy0pKYtZV9EJpXFW-u3H7C4b2k&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "George Mason Is the Latest University Under Fire From Trump.  Its President Fears an “Orchestrated” Campaign.  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up to receive our biggest stories as soon as they're published.  —  When the Education Department's Office … ",
    "url": "https://www.propublica.org/article/george-mason-university-antisemitism-investigation-trump"
  },
  {
    "text": "Undocumented minors found in raid of California cannabis farm, DHS says  —  (KTLA) — Federal immigration agents, assisted by members of the National Guard, carried out raids at two Southern California cannabis farms Thursday, arresting dozens, including undocumented minors … ",
    "url": "https://thehill.com/homenews/state-watch/5396741-dhs-california-cannabis-farm-trum-immigration-raid/"
  },
  {
    "text": "State Department is firing over 1,300 employees under Trump administration plan  —  The State Department is firing more than 1,300 employees on Friday in line with a dramatic reorganization plan unveiled by the Trump administration earlier this year, a move that critics say will damage America's … ",
    "url": "https://apnews.com/article/layoffs-diplomats-state-department-trump-rubio-bfdb86767b7bd5b6570819d404a7782e"
  },
  {
    "text": "Whistleblower Documents Implicate Emil Bove in Criminal Contempt Order by Chief Judge Boasberg  —  A whistleblower's documents provided to Congress implicate Emil Bove in the administration's violation of a court order that prohibited the transfer of more than 100 Venezuelans to El Salvador's CECOT prison.",
    "url": "https://www.justsecurity.org/116777/bove-criminal-contempt-boasberg/"
  },
  {
    "text": "How Netanyahu Prolonged the War in Gaza to Stay in Power  —  When Hamas raided Israel in 2023, setting off the Gaza war, Benjamin Netanyahu seemed set to lose power once the war ended.  Two years on, the war is still going.  Netanyahu still leads Israel.  Many Israelis ask: Did he prolong the war to stay in power?",
    "url": "https://www.nytimes.com/2025/07/11/magazine/benjamin-netanyahu-gaza-war.html?unlocked_article_code=1.Vk8.khSS.frmunMArZFM1&smid=url-share"
  },
  {
    "text": "Trump Voter Andrew Schulz Can't Believe Trump Isn't Doing What He Campaigned On  —  Hoodwinked, bamboozled, led astray, run amok, and flat out deceived!  —  Andrew Schulz, the controversial comedian and podcaster who proudly voted for Donald Trump in the 2024 election … ",
    "url": "https://www.rollingstone.com/politics/politics-news/andrew-schulz-trump-epstein-campaign-promises-1235383715/"
  },
  {
    "text": "Mike Lee Can't Stop Throwing Social Media Grenades.  His Church Isn't Happy.  —  The Utah senator's online persona has further damaged his already frayed relationship with The Church of Jesus Christ of Latter-day Saints.  —  It was Father's Day morning, but Mike Lee was still hard at work on social media.",
    "url": "https://www.politico.com/news/magazine/2025/07/11/mike-lee-utah-mormon-church-profile-00437296"
  },
  {
    "text": "Senate GOP campaign arm hits Paxton over divorce filing  —  The Senate GOP's campaign committee swung at Texas Attorney General Ken Paxton on Thursday after news broke that his wife, Angela Paxton, had filed for divorce.  —  “What Ken Paxton has put his family through is truly repulsive and disgusting … ",
    "url": "https://thehill.com/homenews/campaign/5396340-nrsc-official-criticizes-ken-paxton/"
  },
  {
    "text": "Man on life support from injury during immigration raid in Ventura County, family says  —  Este artículo se ofrece en Español  —  A man is on life support after he was injured during an immigration raid at an agricultural area of Camarillo, according to a family member.",
    "url": "https://abc7.com/post/man-life-support-injury-during-ventura-county-immigration-raid-family-says/17070197/"
  },
  {
    "text": "Justice Department Files Statement of Interest on Suppression of Competition in the Marketplace of Ideas Through Deplatforming of Rival Viewpoints  —  For Immediate Release  —  Today, the Justice Department filed a statement of interest in the United States District Court for the District … ",
    "url": "https://www.justice.gov/opa/pr/justice-department-files-statement-interest-suppression-competition-marketplace-ideas"
  },
  {
    "text": "Missouri Governor Signs Bill Rolling Back Voter-Approved Minimum Wage and Sick Leave  —  The reversal reflected a growing struggle over the use of ballot measures to answer policy questions in Republican-led states.  —  When Missouri voters were asked last year whether they wanted to increase … ",
    "url": "https://www.nytimes.com/2025/07/10/us/missouri-minimum-wage-leave.html"
  },
  {
    "text": "New poll delivers troubling signs for Democrats  —  The Democratic Party's credibility with voters has plummeted even further since the 2024 election, raising alarm bells as the party looks to rebuild ahead of the midterms and the next presidential election, according to a new poll obtained by The Hill.",
    "url": "https://thehill.com/homenews/campaign/5395563-democrats-losing-support-white-voters/"
  },
  {
    "text": "Who would vote for Elon Musk's America Party?  —  Will Elon Musk be the next Ross Perot, or Cornel West?  —  For those getting caught up: After being frustrated by the increase in the federal budget deficit that Republicans have caused with their “One Big Beautiful Bill,” … ",
    "url": "https://www.gelliottmorris.com/p/who-would-vote-for-elon-musks-america"
  },
  {
    "text": "Zohran Mamdani Is Making History.  When Will Top Democrats Catch On?  —  Mamdani won a record-setting primary victory, and unions, grassroots Democratic groups, and savvy elected officials are rushing to back him.  Now it's the establishment's turn.  —  Bluesky  —  Pocket",
    "url": "https://www.thenation.com/article/politics/zohran-mamdani-primary-votes-record-union/"
  },
  {
    "text": "HHS facing billion-dollar backlog of delayed grants after DOGE  —  The Department of Health and Human Services has asked some laid-off staff if they could return to work temporarily, as the department grapples with a backlog of grants that has swelled to more than a billion dollars in the wake of hurdles set up by DOGE.",
    "url": "https://www.cbsnews.com/news/hhs-facing-billion-dollar-backlog-of-delayed-grants-after-doge/"
  },
  {
    "text": "Iowa's Joni Ernst May Just Hang It Up and Go Home  —  If there's anyone in the U.S. Senate who typifies the adaptability of Republicans to the Donald Trump Era up until recently, it's probably Iowa Senator Joni Ernst.  She was first elected as sort of a classic Tea Party Republican in the pre-Trump cycle of 2014.",
    "url": "https://nymag.com/intelligencer/article/iowas-joni-ernst-may-just-hang-it-up-and-go-home.html"
  },
  {
    "text": "Trump weighs new Ukraine aid package … The money would come from a fund Congress approved last year under President Joe Biden that allows the Defense Department to take weapons out of U.S. military's stockpiles for Ukraine.  The fund, known as presidential drawdown authority, still holds about $3.8 billion.",
    "url": "https://www.politico.com/news/2025/07/11/trump-new-ukraine-aid-package-00448547"
  },
  {
    "text": "The Paramount and Global Law Firm Settlements With Trump Don't Constitute Bribery  —  Bribery law requires an unambiguous intent to influence a public official's action through money or something else of value.  —  Meet The Authors … Last week, Paramount Global agreed to pay $16 million … ",
    "url": "https://www.lawfaremedia.org/article/the-paramount-and-global-law-firm-settlements-with-trump-don-t-constitute-bribery"
  },
  {
    "text": "Why You Should Fear a MAGAfied Fed  —  Jerome Powell's term as chairman of the Federal Reserve Board will end in May 2026.  We don't know who Donald Trump will choose to replace him, but we already know that his successor will be a disaster.  —  How can I say that without knowing who will get the nod?",
    "url": "https://paulkrugman.substack.com/p/why-you-should-fear-a-magafied-fed"
  }
]