[
  {
    "text": "Donald Trump may not pay bond — and instead let Letitia James seize Trump Tower: insiders  —  As Donald Trump faces a Monday deadline to post a $454 million bond in the civil fraud case against him in New York, insiders said he may be weighing a little-discussed option: Do nothing.",
    "url": "https://nypost.com/2024/03/20/business/donald-trump-may-not-pay-bond-and-instead-let-letitia-james-seize-trump-tower-insiders/"
  },
  {
    "text": "Shadowing Trump's attacks on mental fitness — his own father's dementia  —  Trump avoids mention of his father's Alzheimer's disease as he lashes Biden for being ‘cognitively impaired’  —  Donald Trump invited his extended family to Mar-a-Lago in the mid-1990s.",
    "url": "https://www.washingtonpost.com/politics/2024/03/20/donald-trump-dementia-father-fred-alzheimers-biden/"
  },
  {
    "text": "Panic mode sets in for Trump as he faces deadline for massive bond  —  Former President Donald Trump is in panic mode as the deadline approaches to secure a half-billion-dollar bond to appeal his civil fraud case in New York, according to multiple sources familiar with his thinking.",
    "url": "https://www.cnn.com/2024/03/19/politics/trump-bond-deadline-panic"
  },
  {
    "text": "Is Trump Cracking Under the Pressure of the Election?  —  Trump has repeatedly stumbled during the first couple of weeks of the general election  —  Donald Trump made it through the Republican primary largely unscathed.  He never had to get on a debate stage or adopt a position to outflank a rival.",
    "url": "https://www.messageboxnews.com/p/is-trump-cracking-under-the-pressure"
  },
  {
    "text": "Donald Trump Isn't Running A Presidential Campaign  —  It's a campaign for immunity from the law, and Democrats aren't doing nearly enough to counter it.  —  ∙ Paid  —  Every now and again it's fun to hold the unfiltered public comments of normal politicians up against the Donald Trump's ravings on social media.",
    "url": "https://www.offmessage.net/p/donald-trump-isnt-running-presidential-campaign"
  },
  {
    "text": "New York AG urges appeals court to make Trump pay full bond  —  The New York attorney general's office urged a state appeals court to make former President Trump put up a full bond before pausing the multimillion-dollar judgment in his civil fraud case.  —  The state's filing follows claims … ",
    "url": "https://thehill.com/regulation/court-battles/4544391-ny-ag-urges-appeals-court-to-make-trump-pay-full-bond-in-fraud-case/"
  },
  {
    "text": "Trump's “crazies” are back in his mix … - They're returning as Trump more aggressively touts Jan. 6 rioters as “patriots,” ramps up his racist, incendiary rhetoric — and embraces some of his most provocative loyalists. … - Trump's team is in talks to hire 2016 campaign advisers Paul Manafort … ",
    "url": "https://www.axios.com/2024/03/20/trump-far-righters-return"
  },
  {
    "text": "Liz Cheney still plans to make a difference in the election  —  Liz Cheney doesn't mince words about Donald Trump.  She calls the former president a “liar,” a “con man” and a potential “tyrant” who, if elected again, would “torch the Constitution” and its guarantees of free speech and rule of law.",
    "url": "https://www.washingtonpost.com/opinions/2024/03/19/liz-cheney-trump-biden-election-2024-difference/"
  },
  {
    "text": "Divided Supreme Court lifts stay on a Texas law giving police broad powers to arrest migrants  —  A divided Supreme Court on Tuesday allowed Texas to begin enforcing a law that gives police broad powers to arrest migrants suspected of crossing the border illegally while a legal battle over the measure plays out.",
    "url": "https://apnews.com/article/supreme-court-migrant-arrests-texas-13ffaed316d16f42e928f6958f0658f2"
  },
  {
    "text": "Playbook: Sherrod Brown's dilemma  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  ABOUT LAST NIGHT — The biggest story from yesterday's elections was in Ohio, where former car dealer BERNIE MORENO … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/03/20/sherrod-browns-dilemma-00147970"
  },
  {
    "text": "BREAKING: Trump, others can appeal Fani Willis removal ruling, judge allows  —  Judge Scott McAfee says he'll continue work on other aspects of case  —  Fulton Superior Court Judge Scott McAfee on Wednesday granted permission for former President Donald Trump and seven others to appeal … ",
    "url": "https://www.ajc.com/politics/breaking-fulton-judge-allows-trump-others-to-appeal-fani-willis-removal-ruling/Z7NZGYJVXRDGDFEBMCWPSTBIEQ/"
  },
  {
    "text": "Users ditch Glassdoor, stunned by site adding real names without consent  —  Anonymous review site Glassdoor now consults public sources to identify users.  —  Glassdoor, where employees go to leave anonymous reviews of employers, has recently begun adding real names to user profiles without users' consent … ",
    "url": "https://arstechnica.com/tech-policy/2024/03/glassdoor-adding-users-real-names-job-info-to-profiles-without-consent/"
  },
  {
    "text": "Johnson may invite Netanyahu to address Congress after Schumer comments  —  Speaker Mike Johnson (R-La.) said Wednesday that he is considering inviting Prime Minister Benjamin Netanyahu to address Congress amid rising tensions between Democrats and the Israeli government leader — a sign of the partisanship edging into the Gaza war.",
    "url": "https://thehill.com/homenews/house/4544704-johnson-may-invite-netanyahu-to-address-congress-after-schumer-comments/"
  },
  {
    "text": "No Labels can't get a ‘yes’ on a candidate for 2024 — and there's a good reason why  —  It's tough to understand what's going on at No Labels, the centrist political group that is trying — and repeatedly failing — to find a candidate for its presidential ticket this year.",
    "url": "https://thehill.com/opinion/campaign/4544313-no-labels-cant-get-a-yes-on-a-candidate-for-2024-and-theres-a-good-reason-why/"
  },
  {
    "text": "Three Points Separate Trump and Biden in Presidential Re-Match in North Carolina...Stein and Robinson Competitive in North Carolina Governor's Race  —  In North Carolina, former President Donald Trump edges President Joe Biden by three percentage points among, both, the statewide electorate … ",
    "url": "https://maristpoll.marist.edu/polls/the-battleground-2024-north-carolina/"
  },
  {
    "text": "Gloomy youth pull US and western Europe down global happiness ranking  —  Rising unhappiness among younger people has caused the United States and some large western European countries to fall down a global wellbeing index, while Nordic nations retain their grip on the top spots.",
    "url": "https://www.reuters.com/lifestyle/gloomy-youth-pull-us-western-europe-down-global-happiness-ranking-2024-03-20/"
  },
  {
    "text": "Banning abortion was the first step, not the last  —  They also won't stop with ending privacy rights. … When the United States Supreme Court overturned Roe v. Wade in 2022's Dobbs v. Jackson Women's Health Organization, Justice Samuel Alito's majority opinion smugly declared that … ",
    "url": "https://www.publicnotice.co/p/scotus-banning-abortion-was-the-first-step"
  },
  {
    "text": "Lev Parnas, ex-Giuliani associate, testifies allegations against Bidens are false and ‘spread by the Kremlin’  —  In his opening statement, Parnas maintained there is no evidence showing that Joe Biden and his son Hunter Biden were linked to corruption in Ukraine.",
    "url": "https://www.nbcnews.com/politics/joe-biden/lev-parnas-ex-giuliani-associate-testifies-allegations-bidens-are-fals-rcna144250"
  },
  {
    "text": "Biden wins endorsement from US steelworkers' union a week after opposing sale of company  —  Swapna Venugopal Ramaswamy Joey GarrisonUSA TODAY  —  WASHINGTON — Less than a week after President Joe Biden came out in opposition of the planned sale of U.S. Steel to Japanese-based Nippon Steel Corporation … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/03/20/biden-us-steel-union-endorsement-opposing-sale/73039734007/"
  },
  {
    "text": "Biden-Harris Administration finalizes strongest-ever pollution standards for cars that position U.S. companies and workers to lead the clean vehicle future, protect public health, address the climate crisis, save drivers money  —  WASHINGTON - Today, March 20, the U.S. Environmental Protection … ",
    "url": "https://www.epa.gov/newsreleases/biden-harris-administration-finalizes-strongest-ever-pollution-standards-cars-position"
  },
  {
    "text": "Biden to tout government investing $8.5B in Intel's computer chip plants in four states  —  Biden plans to talk up the investment on Wednesday as he visits Intel's campus in Chandler, Arizona, which could be a decisive swing state in November's election.  —  WASHINGTON — The Biden administration … ",
    "url": "https://www.nbcnews.com/politics/economics/biden-tout-government-investing-85b-intels-computer-chip-plants-four-s-rcna144216"
  }
]