[
  {
    "text": "Two Elections: “The rules were that you guys weren't going to fact-check”  —  I want to elaborate on something I said on Nicole Sandler's show on Friday.  There were really two elections last Tuesday.  —  In one, politics worked.  —  In the other, propaganda worked far better.",
    "url": "https://www.emptywheel.net/2024/11/10/two-elections-the-rules-were-that-you-guys-werent-going-to-fact-check/"
  },
  {
    "text": "More Democrats fear the party's image isn't just damaged - it's broken  —  Everyone agrees they lost the working class, but they're deeply divided on where to place the blame — and what to do about it.  —  Democrats are having a full-blown identity crisis.",
    "url": "https://www.politico.com/news/2024/11/10/democratic-party-crisis-mode-00188547"
  },
  {
    "text": "Bernie vs. Nancy: Dems' working-class reckoning … - “While the Democratic leadership defends the status quo, the American people are angry and want change. … - “Will the big money interests and well-paid consultants who control the Democratic Party learn any real lessons from this disastrous campaign?”",
    "url": "https://www.axios.com/2024/11/10/democrats-working-class-voters-trump"
  },
  {
    "text": "Who is allowed to practice identity politics?  —  I don't really know why Kamala Harris lost.  The best explanation I've seen is that Harris ran into a buzzsaw of anti-incumbent post-pandemic disillusionment that has played out across the developed world.  You can add more strategic … ",
    "url": "https://donmoynihan.substack.com/p/who-is-allowed-to-practice-identity"
  },
  {
    "text": "The Democrats Need an Honest Conversation on Gender Identity  —  One of the mysteries of this election is how the Democrats approached polling day with a set of policies on gender identity that they were neither proud to champion—nor prepared to disown.  —  Although most Americans agree … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/11/democrats-dishonest-gender-conversation-2024-election/680604/"
  },
  {
    "text": "Trump Won, So Jim Jordan Is No Longer Worried About Election Fraud  —  The Republican congressman admitted the 2024 election was “free and fair.”  But what changed between 2020 and now?  —  Rep. Jim Jordan was a key figure in Jan. 6 and the attempt to overturn the results of the 2020 election … ",
    "url": "https://www.rollingstone.com/politics/politics-news/jim-jordan-election-fraud-2024-trump-won-1235159908/"
  },
  {
    "text": "Sen. Bernie Sanders says he does not support urging Justice Sonia Sotomayor to step down  —  In an interview on “Meet the Press,” the senator said it would not be “sensible” to ask Sotomayor to step down while Biden is still in office.  —  Sen. Bernie Sanders, I-Vt., on Sunday defended … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/bernie-sanders-doesnt-support-urging-sotomayor-step-down-rcna179494"
  },
  {
    "text": "Trump Is Expected to Upend Biden Labor Policies Favoring Unions  —  After gains by organized labor under President Biden, a second Trump administration is likely to change course on regulation and enforcement.  —  Joseph R. Biden Jr. promised to be the most pro-labor president in history.",
    "url": "https://www.nytimes.com/2024/11/10/business/economy/trump-biden-labor-unions.html?unlocked_article_code=1.Y04.0nsf.Pfn8UrowauNH"
  },
  {
    "text": "Dearborn's Arab Americans feel vindicated by Harris' loss  —  Dearborn residents swung toward Trump.  It was a protest vote against Harris and Biden.  —  DEARBORN, Michigan — Arab American leaders for months warned Vice President Kamala Harris that she needed to separate herself … ",
    "url": "https://www.politico.com/news/2024/11/10/dearborn-vote-kamala-harris-trump-00188618"
  },
  {
    "text": "Donald Trump says he won't ask Nikki Haley, Mike Pompeo to join his second administration  —  President-elect Donald Trump said Saturday he will not ask his former United Nations Ambassador Nikki Haley or his former Secretary of State Mike Pompeo to serve in his incoming administration.",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/11/10/trump-haley-pompeo-2024-election/76176249007/"
  },
  {
    "text": "Democrats' $1.9 trillion bet that blew up  —  Nearly four years ago, the Biden administration and Congressional Democrats made a $1.9 trillion bet in the form of the American Rescue Plan.  They lost, as it contributed to a surge in inflation that fueled massive voter discontent and Donald Trump's return to the White House.",
    "url": "https://www.axios.com/2024/11/10/trump-policy-stimulus-inflation"
  },
  {
    "text": "Scoop: Tom Cotton locks down the votes for Senate GOP's #3 job … - Cotton had been a serious contender for top positions in a Trump administration, but he decided to remain in the Senate, as Axios first reported.  — Cotton's expected win on Wednesday would box out Sen. Joni Ernst (R-Iowa) from leadership entirely.",
    "url": "https://www.axios.com/2024/11/10/tom-cotton-senate-republican-leadership-election"
  },
  {
    "text": "A new era dawns.  America's tech bros now strut their stuff in the corridors of power  —  The era that began with the Great Disruptor's first term is over.  Beware the emerging elite  —  In hindsight, 2016 was the beginning of the beginning.  And 2024 is the end of that beginning and the start of something much, much worse.",
    "url": "https://www.theguardian.com/commentisfree/2024/nov/11/a-new-era-dawns-americas-tech-bros-now-strut-their-stuff-in-the-corridors-of-power"
  },
  {
    "text": "For legal disputes, Elon Musk's X picked a venue far from Texas HQ  —  By changing his company's terms of service, Elon Musk has ensured that lawsuits against X will be heard in courthouses that are a hub for conservative judges.  —  Tech billionaire Elon Musk has chosen a sprawling federal court district … ",
    "url": "https://www.washingtonpost.com/national-security/2024/11/10/twitter-x-elon-musk-lawsuits/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzMxMjE0ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzMyNTk3MTk5LCJpYXQiOjE3MzEyMTQ4MDAsImp0aSI6IjBiYTdiZTE5LTUzODMtNGY4Mi1hN2MzLWUyNGRjMDhkYTEwMiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb25hbC1zZWN1cml0eS8yMDI0LzExLzEwL3R3aXR0ZXIteC1lbG9uLW11c2stbGF3c3VpdHMvIn0.zx5rx1KKR5Dke9AJFpMIpKSqn_8X8vXeeLtS7yhpnmo&itid=gfta"
  },
  {
    "text": "Can Trump be the New Reagan?  —  A clear victory gives the president-elect a strength and credibility on the world stage that he lacked eight years ago.  —  Eight years ago, at a post-election breakfast party we threw in POLITICO's Brussels offices, I watched Donald Trump claim victory … ",
    "url": "https://www.politico.com/news/magazine/2024/11/10/trump-world-international-affairs-00188476"
  }
]