[
  {
    "text": "Trump tried to ignore Haley.  He barely lasted a day.  —  The former president was back to his old ways in no time.  —  For a full 24 hours on Saturday, Donald Trump did not mention Nikki Haley by name, ignoring her both in a freewheeling address to the Conservative Political Action Conference … ",
    "url": "https://www.politico.com/news/2024/02/28/trump-nikki-haley-attacks-00143710"
  },
  {
    "text": "Michigan Primary Takeaways: ‘Uncommitted’ Makes Itself Heard  —  President Biden endured a protest vote, Donald Trump fended off Nikki Haley again, and both may face challenges with their party coalitions as they start to look toward November.  —  Joseph R. Biden Jr. and Donald J. Trump won … ",
    "url": "https://www.nytimes.com/2024/02/28/us/politics/michigan-primary-biden-trump.html"
  },
  {
    "text": "Biden won the Michigan primary decisively — but not by enough to calm Democratic angst  —  President Joe Biden scored a decisive win in the Michigan primary on Tuesday evening, clearing an organized protest vote against his handling of the Israel-Hamas war though not necessarily by enough to calm Democratic jitters.",
    "url": "https://www.politico.com/news/2024/02/27/michigan-primary-trump-biden-haley-00143773"
  },
  {
    "text": "Biden wins Michigan primary but faces notable showing by ‘uncommitted’  —  Activists urged Democrats to vote ‘uncommitted’ to register a protest of Biden's handling of the Gaza war  —  President Biden won Michigan's Democratic primary on Tuesday but faced a notable challenge from voters selecting … ",
    "url": "https://www.washingtonpost.com/politics/2024/02/27/michigan-primary-biden-trump-haley-uncommitted/"
  },
  {
    "text": "Lauren Boebert's son was arrested over a spate of thefts as his mom tries to convince voters to look past her chaotic family life  — Lauren Boebert's son Tyler Boebert was arrested on Tuesday afternoon.  — He's facing 22 charges in connection with a series of crimes in Rifle, Colorado.",
    "url": "https://www.businessinsider.com/lauren-boebert-son-tyler-arrested-family-drama-2024-republican-campaign-2024-2"
  },
  {
    "text": "Lauren Boebert's son arrested, faces 22 charges  —  GRAND JUNCTION, Colo. (KJCT) - Lauren Boebert's 18-year-old son was arrested in Garfield County February 27, 2024, and faces 22 charges.  —  According to the Rifle Police Department's Facebook page Tyler Boebert was arrested at around 2:30 in the afternoon.",
    "url": "https://www.kjct8.com/2024/02/28/lauren-boeberts-son-arrested-faces-22-charges/"
  },
  {
    "text": "Lauren Boebert's Son, 18, Busted Over Wild Alleged Crime Wave  —  Tyler Boebert faces a total of 22 charges after a “string of vehicle trespass and property thefts.”  —  Rep. Lauren Boebert's son was arrested Tuesday and now faces 22 charges relating to an alleged crime wave in Colorado, authorities said.",
    "url": "https://www.thedailybeast.com/lauren-boeberts-son-tyler-busted-over-wild-alleged-crime-wave"
  },
  {
    "text": "They're coming for birth control next  —  Banning IVF is a natural result of anti-choice zealots running the GOP, and they won't stop there. … Earlier this month, the Alabama Supreme Court issued an opinion, complete with a wildly theocratic concurrence from Chief Justice Thomas Parker … ",
    "url": "https://www.publicnotice.co/p/alabama-ivf-ban-explained"
  },
  {
    "text": "Hunter Biden testifies that he never involved his father in business  —  President's son opens with a defiant statement accusing Republicans of “partisan house of cards” built on “lies”  —  Hunter Biden testified on Wednesday that he never involved his father, President Biden … ",
    "url": "https://www.washingtonpost.com/politics/2024/02/28/hunter-biden-accuses-house-republicans-innuendo-lies/"
  },
  {
    "text": "Biden to issue executive order aimed at protecting Americans' sensitive data from China and other ‘hostile countries’  —  The measure targets the business of selling people's personal information, which the White House said could be used “to track Americans (including military service members) … ",
    "url": "https://www.nbcnews.com/politics/joe-biden/biden-issue-executive-order-aimed-protecting-americans-sensitive-data-rcna140869"
  },
  {
    "text": "How the Senate G.O.P. Scored a Top Recruit and Widened Its Path to a Majority  —  The recruitment of Larry Hogan in Maryland served as a capstone to months of quiet success for Senate Republicans, after years of recruiting disappointments.  —  Larry Hogan might not be running for Senate … ",
    "url": "https://www.nytimes.com/2024/02/28/us/politics/gop-senate-recruitment-hogan.html"
  },
  {
    "text": "Poll: Most Americans cool to Christian nationalism as its influence grows … - This once-fringe ideology has become prevalent in some deeply red states at a time when the nation overall is increasingly diverse and less religious. … - In California, New York and Virginia … ",
    "url": "https://www.axios.com/2024/02/28/poll-christian-nationalism-americans-reject"
  },
  {
    "text": "Williamson ‘unsuspending’ presidential campaign  —  Author Marianne Williamson announced Wednesday that she is “unsuspending” her presidential campaign, claiming American voters are “watching a car crash in slow motion” with the current candidates.  —  “Hey, I have an important announcement to make.",
    "url": "https://thehill.com/homenews/campaign/4493677-williamson-unsuspending-presidential-campaign/"
  },
  {
    "text": "‘Star witness’ testifies his claims about Fani Willis were only ‘speculation’  —  ATLANTA — A lawyer billed as the “star witness” in the case to disqualify Fulton County District Attorney Fani T. Willis (D) testified Tuesday that it was mere “speculation” when he told a defense attorney … ",
    "url": "https://www.washingtonpost.com/national-security/2024/02/27/fani-willis-nathan-wade-trump-georgia-hearing/"
  },
  {
    "text": "Mike Johnson cornered at “intense” White House meeting … - Senate Majority Leader Chuck Schumer (D-N.Y.) said Johnson “said unequivocally he wants to avoid a government shutdown.”  — “We made it clear that means not letting any of the ... appropriations bills lapse, which means you need some [stopgap bills],” Schumer added.",
    "url": "https://www.axios.com/2024/02/27/white-house-meeting-mike-johnson-shutdown"
  },
  {
    "text": "What the Alabama Supreme Court's Decision Says About Our Failing Democracy  —  The high court ruling that the “wrongful death of a minor” law could be applied to an embryo created through in vitro fertilization is another extremist strategy in the criminalization of pregnant people.",
    "url": "https://www.huffpost.com/entry/opinion-alabama-supreme-court-personhood-democracy_n_65dd5cc6e4b0189a6a7f324b"
  },
  {
    "text": "4 Times Melania and Donald Trump Clashed at the White House, According to New Book  —  A historical book about U.S. first ladies claims that while Melania was always publicly supportive of her husband during his presidency, the two often disagreed behind the scenes",
    "url": "https://people.com/melania-donald-trump-clashed-white-house-new-book-8597949"
  },
  {
    "text": "Israel Is Losing Its Greatest Asset: Acceptance  —  I've spent the past few days traveling from New Delhi to Dubai and Amman, and I have an urgent message to deliver to President Biden and the Israeli people: I am seeing the increasingly rapid erosion of Israel's standing among friendly nations … ",
    "url": "https://www.nytimes.com/2024/02/27/opinion/israel-gaza-peace-thomas-friedman.html"
  },
  {
    "text": "Leaked Russian military files reveal criteria for nuclear strike  —  Doctrine for tactical nuclear weapons outlined in training scenarios for an invasion by China  —  Vladimir Putin's forces have rehearsed using tactical nuclear weapons at an early stage of conflict with a major world power … ",
    "url": "https://www.ft.com/content/f18e6e1f-5c3d-4554-aee5-50a730b306b7"
  },
  {
    "text": "Federal judge in Texas rules congressional passage of 2022 spending bill unconstitutional  —  The judge called the scope of his ruling “limited,” and said it did not block all of the spending law.  —  A federal judge in Texas on Tuesday ruled that a $1.7 trillion government funding bill … ",
    "url": "https://www.nbcnews.com/politics/politics-news/federal-judge-texas-rules-congressional-passage-2022-spending-bill-unc-rcna140829"
  }
]