[
  {
    "text": "Congress has the power to block Trump from taking office, but lawmakers must act now  —  The Constitution provides that an oath-breaking insurrectionist is ineligible to be president.  This is the plain wording of Section 3 of the 14th Amendment to the Constitution.",
    "url": "https://thehill.com/opinion/congress-blog/5055171-constitution-insurrection-trump-disqualification/"
  },
  {
    "text": "MAGA in Total Mayhem as Laura Loomer Goes to War With Elon Musk  —  Right-wing influencer and Donald Trump gadfly Laura Loomer is attacking Elon Musk, seemingly over his desire for more immigrants to work and study in science and technology fields in the United States.",
    "url": "https://newrepublic.com/post/189682/maga-laura-loomer-elon-musk-fight"
  },
  {
    "text": "‘Should MAGA stay home in 2026?’  Laura Loomer wages ‘racist’ war against ‘tech bros’ over Indian migrants  —  The far-right provocateur is taking aim at Elon Musk and Vivek Ramaswamy over their support of highly skilled workers from India, claiming that the country's residents have a low IQ … ",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/laura-loomer-trump-maga-b2670324.html"
  },
  {
    "text": "Musk, Ramaswamy defend Silicon Valley's foreign-born hires  —  Elon Musk and Vivek Ramaswamy, co-chairs of President-elect Trump's new “Department of Government Efficiency,” are defending the tech industry's reliance on foreign-born engineers as the incoming Trump administration prepares to crack down on immigration.",
    "url": "https://thehill.com/policy/technology/5056699-elon-musk-vivek-ramaswamy-immigration/"
  },
  {
    "text": "These MAGA farmers could be ruined if Trump follows through with mass deportations  —  California's farm owners bet on President-elect Donald Trump and won.  His campaign promise of mass deportations could ruin them.  —  SACRAMENTO, California — California farmers could soon enjoy bumper crops thanks … ",
    "url": "https://www.politico.com/news/2024/12/26/california-farmers-trump-water-workers-00195839"
  },
  {
    "text": "Breaking news.  Exclusive: Preliminary investigation confirms Russian missile caused Azerbaijan Airlines crash  —  38 passengers were killed on Wednesday after Azerbaijan Airlines Flight 8432 crashed as it attempted to make an emergency landing near the city of Aktau in Kazakhstan.",
    "url": "https://www.euronews.com/2024/12/26/exclusive-preliminary-investigation-confirms-russian-missile-over-grozny-caused-aktau-cras"
  },
  {
    "text": "Republicans Quietly Axed IRS Funding Amid Government Shutdown Chaos  —  During last week's negotiations to avert a government shutdown, Congress quietly slashed $20 billion from the Internal Revenue Service.  —  Republicans have long targeted the tax agency, and their cuts will hurt its efforts … ",
    "url": "https://newrepublic.com/post/189672/republicans-cut-irs-funding-government-shutdown"
  },
  {
    "text": "Behind Closed Doors: The Spy-World Scientists Who Argued Covid Was a Lab Leak  —  The idea that the pandemic's origins lie with a research facility in China was once labeled a conspiracy theory",
    "url": "https://www.wsj.com/politics/national-security/fbi-covid-19-pandemic-lab-leak-theory-dfbd8a51?st=oZiMmz&reflink=article_copyURL_share"
  },
  {
    "text": "Former FBI and CIA head prods Senate to reject Patel, Gabbard  —  A former head of the FBI and CIA is raising objections over whether Kash Patel and Tulsi Gabbard, President-elect Donald Trump's picks to be directors of the FBI and national intelligence, respectively, are qualified to serve in the Cabinet.",
    "url": "https://www.politico.com/live-updates/2024/12/26/congress/tulsi-gabbard-kash-patel-fbi-cia-trump-00196055"
  },
  {
    "text": "The Bald Eagle Is (Finally) the National Bird of the United States  —  The bird of brown and white feathers has long represented the United States as a majestic and soaring symbol, but only this week did a law make it official.  —  The bald eagle received a title this week that many may have assumed … ",
    "url": "https://www.nytimes.com/2024/12/26/us/bald-eagle-national-bird.html"
  },
  {
    "text": "In reporting on hate and extremism, ‘while the attacks are personal, so is the cause’  —  “Journalists like myself have a choice: surrender to the fascist mob that wants to intimidate the truth-tellers - or rededicate ourselves to doing what's right no matter the cost.”",
    "url": "https://www.newschannel5.com/news/newschannel-5-investigates/confronting-hate/phil-williams-in-reporting-on-hate-and-extremism-while-the-attacks-are-personal-so-is-the-cause"
  },
  {
    "text": "Head of WHO was in Yemen airport during Israeli air strikes, with crew member injured  —  Summary  — Israel has launched air strikes in Yemen, targeting several sites controlled by the Houthis  — At least three people have been killed and 14 injured.  It is unclear if they were civilians",
    "url": "https://www.bbc.com/news/live/cevj4nrx9zzt"
  },
  {
    "text": "Last survivor of USS Utah, sunk during Pearl Harbor attack, dies at age 105  —  Warren “Red” Upton, the last surviving veteran of the battleship USS Utah, which sank in Pearl Harbor during the 1941 Japanese surprise attack and remains there as a memorial, died Wednesday in San Jose, Calif. He was 105.",
    "url": "https://www.stripes.com/veterans/2024-12-26/uss-utah-pearl-harbor-survivor-upton-16288074.html"
  },
  {
    "text": "I'M RUNNING FOR DNC CHAIR!  —  To Democratic National Committee Members,  —  This year's election of a DNC Chair feels different than in past years.  Before now, the party had faced defeats to be sure.  But our playbook still basically worked.  The waters were turbulent at times, but our ship was steady.",
    "url": "https://www.transformarticles.com/p/im-running-for-dnc-chair"
  },
  {
    "text": "Elon Musk reveals he's taking drug for weight loss in bizarre ‘Ozempic Santa’ post  —  The world's richest man has clashed with incoming Health and Human Services chief Robert F. Kennedy Jr. over the role weight-loss medications should play in making Americans healthier and thinner.",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/elon-musk-weight-loss-mounjaro-b2670186.html"
  },
  {
    "text": "South Korea's Acting President Faces Impeachment Vote  —  As the president awaits an impeachment trial, the country's interim leader may face an ousting of his own.  The currency has plunged as the crisis has deepened.  —  Opposition lawmakers in South Korea were planning to vote on Friday … ",
    "url": "https://www.nytimes.com/2024/12/26/world/asia/south-korea-impeach-president-han.html"
  },
  {
    "text": "The US says it pushed retraction of a famine warning for north Gaza.  Aid groups express concern  —  A lead organization monitoring for food crises around the world withdrew a new report this week warning of imminent famine in north Gaza under what it called Israel's “near-total blockade,” … ",
    "url": "https://apnews.com/article/gaza-israel-famine-biden-trump-fews-89b4a0d3ab684669ee4456566b406621"
  },
  {
    "text": "Trump to restore White House Diet Coke button as Bidens move out in whirlwind Inauguration Day turnaround  — Staff will have about five hours on Inauguration Day to move Trumps in  — Staff liked Trump in his first term; he would tip them with $50s  —  When Donald and Melania Trump enter … ",
    "url": "https://www.dailymail.co.uk/news/article-14207005/trump-biden-inauguration-day-diet-coke-button.html"
  },
  {
    "text": "Trump's top border adviser says he will bring back family detention  —  Tom Homan oversaw implementation of the “zero tolerance” policy that separated more than 4,000 children from their parents during Trump's first term.  —  U.S. immigration authorities will once more put families with children … ",
    "url": "https://www.washingtonpost.com/immigration/2024/12/26/immigration-border-tom-homan-trump/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM1MTg5MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM2NTcxNTk5LCJpYXQiOjE3MzUxODkyMDAsImp0aSI6Ijk0ODdiMTM5LWYyYTgtNDU3Zi04NjZjLWZjNDU5YzlhZDdkMSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9pbW1pZ3JhdGlvbi8yMDI0LzEyLzI2L2ltbWlncmF0aW9uLWJvcmRlci10b20taG9tYW4tdHJ1bXAvIn0.iuWuZkZoFh7kuZyqfHOQ3GPSgGn2hB-7fUtq-rubSEo&itid=gfta"
  }
]