[
  {
    "text": "Trump complains about campaign as advisers try to focus on attacking Harris  —  The GOP nominee has grown increasingly upset about Kamala Harris's surging poll numbers and media coverage since replacing Joe Biden on the ticket.  —  Donald Trump's candidacy appeared all but destined for victory only weeks ago.",
    "url": "https://www.washingtonpost.com/politics/2024/08/07/trump-election-campaign/"
  },
  {
    "text": "Biden “not confident” Trump will accept 2024 election results  —  President Biden said he is “not confident at all” that there will be a peaceful transfer of power in January 2025 if former President Donald Trump is defeated.  —  “He means what he says.  We don't take him seriously.  He means it.",
    "url": "https://www.cbsnews.com/news/biden-on-dropping-out-2024-race-donald-trump-cbs-sunday-morning-exclusive-interview/"
  },
  {
    "text": "J.D. Vance Awkwardly Retreats After Bizarre Attempt to Storm Harris' Empty Plane  —  NO, NOT WEIRD  —  The made-for-TV moment was so weird that it could have been a page taken right out of the script of political TV show “Veep”.  —  J.D. Vance briskly marched up to Air Force 2 … ",
    "url": "https://www.thedailybeast.com/jd-vance-awkwardly-retreats-from-confronting-kamala-harris-on-air-force-2-after-realizing-she-wasnt-around"
  },
  {
    "text": "Harris Shuts Down Trumpian ‘Lock Him Up’ Chants  —  CROWD CONTROL  —  Supporters in Wisconsin were just winding up against Donald Trump when Kamala Harris told them to “hold on.”  —  Democratic presidential nominee Kamala Harris stopped her fans from getting too wild with their Trump bashing … ",
    "url": "https://www.thedailybeast.com/kamala-harris-shuts-down-trumpian-lock-him-up-chants"
  },
  {
    "text": "Trump Says He'll Focus on Issues.  His Allies Are Not Holding Their Breath.  —  Donald J. Trump has attacked Kamala Harris with racially loaded insults and a new, confusing nickname.  “I would stick to the price of groceries,” one Republican said.  —  Former President Donald J. Trump dialed into … ",
    "url": "https://www.nytimes.com/2024/08/08/us/politics/trump-harris-campaign.html"
  },
  {
    "text": "BREAKING: The New York Times helps JD Vance Swiftboat Tim Walz  —  Tim Walz “enlisted Army National Guard in Nebraska in 1981 and retired honorably in 2005,” according to his military records.  Months after Tim Walz retired from the Army National Guard in 2005, his unit received orders to deploy to Iraq.",
    "url": "https://www.findinggravity.net/p/breaking-the-new-york-times-helps"
  },
  {
    "text": "Vance reopens line of attack into Walz's military record as two veterans now vie to be vice president  —  Donald Trump's running mate Ohio Sen. JD Vance stepped up his attacks on Minnesota Gov. Tim Walz's portrayal of his military career, accusing him of ducking service in Iraq when he left … ",
    "url": "https://www.cnn.com/2024/08/07/politics/tim-walz-military-record-vance-attack"
  },
  {
    "text": "Right-wing media push old debunked smear of Walz's military record despite his 24 years of service  —  National Guards members who served with Walz praised him and supported his decision to retire to run for Congress, where he helped veterans  —  Right-wing media are reviving old smears pushed … ",
    "url": "https://www.mediamatters.org/tim-walz/right-wing-media-push-old-debunked-smear-walzs-military-record-despite-his-24-years"
  },
  {
    "text": "Tim Walz's Sudden Rise in the Democratic Party Was No Accident  —  More than a year ago, Tim Walz and his aides decided to be ready in case an irresistible opportunity arose.  Their tightly held strategy helped them catch political lightning in a bottle.  —  Shortly after the 2022 midterms … ",
    "url": "https://www.nytimes.com/2024/08/07/us/politics/tim-walz-kamala-harris-2024.html"
  },
  {
    "text": "Steve Martin turns down Walz role on ‘SNL’: 'I'm not an impressionist'  —  Comedian and actor Steve Martin has reportedly turned down the role of Minnesota Gov. Tim Walz (D) on “Saturday Night Live” (SNL).  —  Martin, according to the Los Angeles Times, was reached out to by the show's executive producer … ",
    "url": "https://thehill.com/blogs/in-the-know/4818107-steve-martin-tim-walz-saturday-night-live-role/"
  },
  {
    "text": "Trump took a private flight with Project 2025 leader in 2022  —  Trump took the flight to speak at a Heritage Foundation conference, where he said, “They're going to lay the groundwork and detail plans for exactly what our movement will do.”  —  Republican presidential nominee Donald Trump … ",
    "url": "https://www.washingtonpost.com/elections/2024/08/07/trump-heritage-project-2025-roberts/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzIzMDAzMjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI0Mzg1NTk5LCJpYXQiOjE3MjMwMDMyMDAsImp0aSI6IjU5YWFlZjcyLWU1ZDgtNGE1NC04MWZiLTdkYWVjNDIxOGU1ZiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9lbGVjdGlvbnMvMjAyNC8wOC8wNy90cnVtcC1oZXJpdGFnZS1wcm9qZWN0LTIwMjUtcm9iZXJ0cy8ifQ.2HhqEQNVoqvh9Bm-KPcK5zwpQDNFngVH67ucIvuc1uY&itid=gfta"
  },
  {
    "text": "Presidential Campaign Reset: Arizona, Georgia and Nevada Move From Lean Republican to Toss Up  —  Three weeks ago, Donald Trump was leading President Joe Biden in the Cook Political Report national vote tracker by about 2.5%.  Today, Kamala Harris leads Trump by less than one point … ",
    "url": "https://www.cookpolitical.com/analysis/national/national-politics/presidential-campaign-reset-arizona-georgia-and-nevada-move"
  },
  {
    "text": "Elon Musk shares fake news claiming UK rioters will be sent to ‘detainment camps’  —  LONDON — Elon Musk is at it again.  —  Amid an ongoing feud with the British government about unrest on the country's streets, the billionaire X owner boosted, and then deleted, an entirely-manufactured … ",
    "url": "https://www.politico.eu/article/elon-musk-share-fake-news-uk-rioters-detainment-camp/"
  },
  {
    "text": "‘I think this settles it’: Vance busted over resurfaced post jabbing ‘undisputed war hero’  —  A two-year-old social media post written by Sen. J.D. Vance (R-OH) resurfaced on Wednesday, and it's not helping his campaign for vice president.  —  During his candidacy for the Senate in 2022 … ",
    "url": "https://www.rawstory.com/news/j-d-vance-2668920972/"
  },
  {
    "text": "Elon Musk's X accused of bias after pro-Harris accounts labeled as ‘spam’  —  A string of incidents raises questions about whether X is restricting accounts that oppose Musk's political views, or just mishandling a rush of political speech.  —  SAN FRANCISCO — Prominent X accounts advocating … ",
    "url": "https://www.washingtonpost.com/technology/2024/08/07/musk-x-harris-bias/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzIzMDAzMjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI0Mzg1NTk5LCJpYXQiOjE3MjMwMDMyMDAsImp0aSI6ImYwYTQxYzg5LTkxM2YtNDQzZS1iMDFhLThmZGYxZGZjMWI5YiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS90ZWNobm9sb2d5LzIwMjQvMDgvMDcvbXVzay14LWhhcnJpcy1iaWFzLyJ9.3zf8AO3IHgMKLhayUjTwOQKod87Pm481Pn5P6j8v0y0&itid=gfta"
  },
  {
    "text": "Why the Harris Walz Camo Hat Is Becoming a Status Symbol for Liberals  —  Nearly $1 million worth of Walz inspired hats have been sold through the Harris campaign.  —  Before 2015, a red hat was just a red hat.  A bold choice, sure, but not one that made everyone look twice to read what was embroidered on the front of it.",
    "url": "https://www.teenvogue.com/story/why-the-harris-walz-camo-hat-is-becoming-a-status-symbol-for-liberals"
  },
  {
    "text": "New Marquette Law School Poll national survey finds Harris leading Trump and outperforming Biden against Trump; enthusiasm to vote among Democrats having risen substantially  —  MILWAUKEE - A new Marquette Law School Poll national survey finds Vice President Kamala Harris is the choice … ",
    "url": "https://law.marquette.edu/poll/2024/08/07/mlspsc21-release/"
  }
]