[
  {
    "text": "Chief justice gives Jack Smith one week to respond to Trump's bid to stave off trial  —  Trump wants the Supreme Court to keep his federal election trial on hold while he appeals a decision denying him immunity.  —  Chief Justice John Roberts is giving prosecutors a week to respond … ",
    "url": "https://www.politico.com/news/2024/02/13/chief-justice-gives-jack-smith-one-week-to-respond-to-trumps-bid-to-stave-off-trial-00141163"
  },
  {
    "text": "An Infuriating Poll Finding About Trump Should Galvanize Democrats  —  You've probably heard that Donald Trump has “tightened his grip on the Republican Party,” or that he's “bent the party to his will.”  Pundits repeat such formulations constantly, because, well, it's true … ",
    "url": "https://newrepublic.com/article/178951/poll-biden-blamed-border-deal-galvanize-democrats"
  },
  {
    "text": "Republicans Are No Longer a Political Party  —  It's become yet another subsidiary of Trump Inc.  —  When historians chronicle the end of the Grand Old Party, they may mark 2024 as the turning point.  Something called the Republican Party will surely exist for years to come … ",
    "url": "https://www.theatlantic.com/ideas/archive/2024/02/republicans-are-no-longer-political-party/677437/"
  },
  {
    "text": "Biden condemns Trump's Nato comments as ‘dumb, shameful, dangerous and un-American’ - as it happened  —  This blog is now closed.  You can read our full reports on Biden's remarks and the Senate foreign aid bill below:  —  Key events  —  Today in US politics  —  Biden: Trump ‘bows down to a Russian dictator’",
    "url": "https://www.theguardian.com/us-news/live/2024/feb/13/congress-foreign-aid-bill-new-york-election-politics-latest-updates"
  },
  {
    "text": "After facing off with Senate ‘Freedom Caucus’, McConnell urges Johnson on Ukraine  —  But the GOP leader did not push the speaker to bring up the Senate-passed foreign aid bill, specifically.  —  The Ukraine fight has been a painful one for Mitch McConnell, fueling conservative calls … ",
    "url": "https://www.politico.com/news/2024/02/13/mcconnell-johnson-ukraine-aid-senate-00141201"
  },
  {
    "text": "McConnell urges Mike Johnson to allow vote on Ukraine aid … - “What I do think is appropriate is for the House to be able to work its will on Ukraine, which obviously was the most controversial part of what we did,” McConnell said. … - The debate over the package has taken months … ",
    "url": "https://www.axios.com/2024/02/13/mcconnell-mike-johnson-ukraine-aid-vote"
  },
  {
    "text": "Exclusive: Trump adviser proposes new tiered system for NATO members who don't pay up  —  A leading national security adviser to Donald Trump told Reuters on Tuesday that he would push for changes to NATO if the former president returns to power that could result in some member nations losing protection against an outside attack.",
    "url": "https://www.reuters.com/world/trump-adviser-proposes-new-tiered-system-nato-members-who-dont-pay-up-2024-02-13/"
  },
  {
    "text": "Tesla worker killed in fiery crash may be first ‘Full Self-Driving’ fatality  —  Evidence suggests the advanced driver-assistance system was engaged during a fatal crash that killed recruiter Hans von Ohain in 2022  —  The following footage obtained by The Washington Post shows Colorado … ",
    "url": "https://www.washingtonpost.com/technology/interactive/2024/tesla-full-self-driving-fatal-crash/"
  },
  {
    "text": "Marjorie Taylor Greene's Rant At ‘Curb Your Enthusiasm’ Is Comedy Gold  —  The far-right congresswoman better watch out for those “nasty commies” from California.  —  LOADING  —  Rep. Marjorie Taylor Greene (R-Ga.) took her far-right views to another dimension Tuesday in a wild screed against HBO's “Curb Your Enthusiasm.”",
    "url": "https://www.huffpost.com/entry/marjorie-taylor-greene-curb-your-enthusiasm_n_65cb92bfe4b01f4a8b026670"
  },
  {
    "text": "Marjorie Taylor Greene rips ‘Curb Your Enthusiasm’: HBO show depicts Trump supporters as ‘racists and red necks’  —  Rep. Marjorie Taylor Greene (R-Ga.) is blasting a politically charged episode of “Curb Your Enthusiasm,” saying it “lied” and painted conservatives in her state and supporters … ",
    "url": "https://thehill.com/blogs/in-the-know/4465171-marjorie-taylor-greene-curb-your-enthusiasm-hbo-georgia/"
  },
  {
    "text": "It took me three tries to register to vote in Texas — and I'm an elections reporter  —  Moments after I became a naturalized citizen in 2023, I registered to vote.  Here's what happened next. … When I started working at Votebeat more than a year ago, I knew little about elections.",
    "url": "https://www.texastribune.org/2024/02/13/exas-voter-registration-election-2024/"
  },
  {
    "text": "Scoop: Inside the GOP plan to stoke fear on Biden's age … - The GOP planning includes hearings and possibly even subpoenas for documents and recordings. … These sources think that any fight will make the White House look bad — and keep a huge Biden vulnerability in the headlines.",
    "url": "https://www.axios.com/2024/02/13/biden-age-republicans-robert-hur-report"
  },
  {
    "text": "Percentage of Americans expecting improved financial situation highest in almost 4 years: Survey  —  Americans were more optimistic about their financial situations in January 2024 than they have been at any time since the pandemic began nearly four years ago, according to new data released Monday.",
    "url": "https://thehill.com/business/economy/4465785-americans-expecting-improved-financial-situation-highest-4-years/"
  },
  {
    "text": "CDC plans to drop five-day covid isolation guidelines  —  Americans who test positive for the coronavirus no longer need to routinely stay home from work and school for five days under new guidance planned by the Centers for Disease Control and Prevention.  —  The agency is loosening … ",
    "url": "https://www.washingtonpost.com/health/2024/02/13/covid-isolation-guidelines-cdc-change/"
  },
  {
    "text": "On Capitol Hill, Republicans Use Bigoted Attacks Against Political Foes  —  House and Senate Republicans have denigrated fellow lawmakers, Biden administration officials and witnesses in racist ways, both in casual comments and in official settings.  —  When Representative Marjorie Taylor Greene … ",
    "url": "https://www.nytimes.com/2024/02/13/us/politics/republicans-racist-language.html"
  },
  {
    "text": "Bloodbath at CBS News claims senior correspondent embroiled in First Amendment case — and another who weathered HR probe: sources  —  Several CBS News reporters were caught up in layoffs at Paramount Global that claimed 800 jobs, including one who is embroiled in a high-stakes First Amendment fight … ",
    "url": "https://nypost.com/2024/02/13/media/bloodbath-at-cbs-news-includes-reporter-fighting-first-amendment-case/"
  },
  {
    "text": "The ‘scandal penalty’ that George Santos could impose on NY-03  —  A POLITICO analysis shows voters typically punish the party associated with a scandal in the proceeding special election, which could be bad news for Republicans in New York on Tuesday.  —  The Republican in Tuesday's special election … ",
    "url": "https://www.politico.com/news/2024/02/13/george-santos-scandal-new-york-election-00141174"
  },
  {
    "text": "GOP State Rep. Josh Schriver loses staff, committee post after sharing racist conspiracy  —  Arpan Lobo Clara HendricksonDetroit Free Press  —  State Rep. Josh Schriver, R-Oxford, lost his staff and his spot on a legislative committee as punishment for sharing a social media post amplifying a racist conspiracy theory.",
    "url": "https://www.freep.com/story/news/politics/2024/02/12/michigan-josh-schriver-racist-theory/72569870007/"
  }
]