[
  {
    "text": "Ford says Trump's tariff threat ‘like a family member stabbing you in the heart’  —  Premier Doug Ford says tariff would be ‘devastating’ to both economies  —  Ontario Premier Doug Ford said Tuesday that U.S. president-elect Donald Trump's threat to slap a 25 per cent tariff on all Canadian goods is … ",
    "url": "https://www.cbc.ca/news/canada/toronto/ford-trump-tariffs-canada-reaction-1.7393414"
  },
  {
    "text": "'I can't pay my bills,' Rudy Giuliani says in courtroom outburst  —  Rudy Giuliani was rebuked by a federal judge on Tuesday after the former New York City mayor interrupted a court hearing, pleading he could not pay his bills because two Georgia election workers to whom he owes $148 million have tied up his assets.",
    "url": "https://www.reuters.com/world/us/i-cant-pay-my-bills-rudy-giuliani-says-courtroom-outburst-2024-11-26/"
  },
  {
    "text": "Angry Rudy Giuliani argues with judge overseeing defamation payout: 'I can't pay my bills'  —  The former New York City mayor was chastised by the judge for failing to comply with court orders to turn over his assets to the two former Georgia election workers he defamed.",
    "url": "https://www.nbcnews.com/politics/politics-news/angry-rudy-giuliani-argues-judge-overseeing-defamation-payout-cant-pay-rcna181723"
  },
  {
    "text": "Rudy Giuliani draws rebuke for a courtroom outburst accusing judge in assets case of being unfair  —  In an angry outburst in a New York courtroom, Rudy Giuliani accused a judge Tuesday of making wrong assumptions about him as he tries to comply with an order requiring him to turn … ",
    "url": "https://apnews.com/article/giuliani-defamation-georgia-election-workers-415367da295e8aa5f7cfb3862f087ed6"
  },
  {
    "text": "Trump Picks Stanford Physician Who Opposed Lockdowns to Head N.I.H.  —  As the director of the National Institutes of Health, Dr. Jay Bhattacharya would oversee the world's premier medical research agency, with a $47 billion budget and 27 separate institutes and centers.",
    "url": "https://www.nytimes.com/2024/11/26/us/politics/jay-bhattacharya-nih-trump.html"
  },
  {
    "text": "Kamala Harris Campaign Aides Suggest Campaign Was Just Doomed  —  The Harris campaign's internal polling apparently never had her ahead of Trump.  —  LOADING  —  Senior advisers to Vice President Kamala Harris' failed presidential campaign suggested this week that there just wasn't much else Harris … ",
    "url": "https://www.huffpost.com/entry/kamala-harris-campaign-polls_n_67462013e4b0fffc5a469baf"
  },
  {
    "text": "Harris aides say internal polling never had her ahead of Trump  —  The leadership of outgoing Vice President Kamala Harris's 2024 presidential campaign said that internal polling never had her ahead of President-elect Donald Trump.  —  After President Joe Biden began lagging heavily behind … ",
    "url": "https://www.washingtonexaminer.com/news/campaigns/3243646/harris-aides-internal-polling-never-had-her-ahead-trump/"
  },
  {
    "text": "Trump transition signs White House agreement  —  The Trump team's unprecedented delay in signing these agreements had alarmed former officials and ethics experts.  —  The Trump transition has signed a memorandum of understanding with the Biden White House, incoming chief of staff Susie Wiles announced … ",
    "url": "https://www.politico.com/news/2024/11/26/trump-signs-transition-agreement-white-house-00191754"
  },
  {
    "text": "Trump signs transition agreement with Biden, but it lacks key guardrails  —  The Trump team is still refusing to accept several typical trappings of the presidential transition process, including federal funding, equipment, office space or security.  —  The Trump transition team said Tuesday … ",
    "url": "https://www.washingtonpost.com/politics/2024/11/26/trump-transition-agreement-ethics-pledge-security-clearances/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzMyNTk3MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzMzOTc5NTk5LCJpYXQiOjE3MzI1OTcyMDAsImp0aSI6ImJhYWRlYTU0LTU5NGUtNGFiNC04ODM0LTdlZTNkNGQ1YmE1NCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzExLzI2L3RydW1wLXRyYW5zaXRpb24tYWdyZWVtZW50LWV0aGljcy1wbGVkZ2Utc2VjdXJpdHktY2xlYXJhbmNlcy8ifQ.Bf1hQRokVBEgqSjeIALOkQPjNdmEMd1fO4YtmN8EKVo&itid=gfta"
  },
  {
    "text": "Appeals court agrees to end Trump's classified documents case  —  The 11th Circuit Court of Appeals on Tuesday granted a request from special counsel Jack Smith to drop President-elect Trump's Florida documents case, ending the battle to charge him over retaining records with classified markings after leaving office.",
    "url": "https://thehill.com/regulation/court-battles/5010990-trump-classified-documents-case-dropped/"
  },
  {
    "text": "X's Objection to the Onion Buying InfoWars Is a Reminder You Do Not Own Your Social Media Accounts  —  “X CORP. OWNS THE X ACCOUNTS.” … On Monday, X filed an objection in The Onion's bid to buy InfoWars out of bankruptcy.  In the objection, Elon Musk's lawyers argued that X has … ",
    "url": "https://www.404media.co/xs-objection-to-the-onion-buying-infowars-is-a-reminder-you-do-not-own-your-social-media-accounts/"
  },
  {
    "text": "Katie Porter alleges ‘persistent abuse,’ files domestic violence restraining order against ex-boyfriend  —  Julian Willis' alleged threats to leak “false” information to the press “poses a serious risk to my career and personal reputation,” Porter wrote.  Willis said the filing was an effort to preempt his own claims against her.",
    "url": "https://www.politico.com/news/2024/11/26/katie-porter-ex-boyfriend-restraining-order-00191716"
  },
  {
    "text": "Trump Has Late-Night Meltdown Over New York Times Story on Close Aide  —  Donald Trump took to Truth Social in the early hours of Tuesday to go on a lengthy rant about Maggie Haberman, likely set off by a recent article in The New York Times on his weird relationship with aide Natalie Harp.",
    "url": "https://newrepublic.com/post/188825/trump-meltdown-new-york-times-story-personal-aide-natalie-harp"
  },
  {
    "text": "Trump taps financier and donor Phelan to be Navy secretary  —  John Phelan did not serve in the military and does not have a long track record with the Navy.  —  President-elect Donald Trump has selected businessman John Phelan as his nominee to lead the Navy, according to a statement released on Tuesday night.",
    "url": "https://www.politico.com/news/2024/11/26/trump-taps-phelan-navy-secretary-00191825"
  },
  {
    "text": "Don Jr. Says They're Discussing Replacing Some Journalists at the White House Press Briefing with Podcast Bros  —  MEET THE NEW PRESS  —  “That's gonna blow up some heads, so we'll see,” said President-elect Donald Trump's eldest son.  —  President-elect Donald Trump discussed giving podcast bros … ",
    "url": "https://www.thedailybeast.com/don-trmp-jr-were-discussing-replacing-some-journalists-at-the-white-house-press-briefing-with-podcast-bros/"
  },
  {
    "text": "Trump team eyes funding showdown with ‘sanctuary cities’ over immigration  —  Allies of the president-elect discuss pulling funding from Chicago; mayor says the city is “not intimidated” by threats.  —  President-elect Donald Trump's advisers are discussing how to unilaterally strip federal resources … ",
    "url": "https://www.washingtonpost.com/business/2024/11/26/trump-mass-deportation-sanctuary-cities-doge-immigration/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzMyNTk3MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzMzOTc5NTk5LCJpYXQiOjE3MzI1OTcyMDAsImp0aSI6ImY1M2Q4MzU1LWFlZjUtNDJiMS05NjY0LWE2ZGI1MzhkNjUwNCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9idXNpbmVzcy8yMDI0LzExLzI2L3RydW1wLW1hc3MtZGVwb3J0YXRpb24tc2FuY3R1YXJ5LWNpdGllcy1kb2dlLWltbWlncmF0aW9uLyJ9.vHf-PRLgsSHZ5RJputtSGC7lVIX3Pc8YByhAbHFw-wg&itid=gfta"
  },
  {
    "text": "Sharon Stone: Trump Won Because of ‘Uneducated’ Americans Who Don't Travel Abroad  —  Basic Instinct star Sharon Stone has blamed President-elect Donald Trump's victory on what she called “uneducated” Americans who don't have passports and have never traveled abroad.",
    "url": "https://www.breitbart.com/entertainment/2024/11/26/sharon-stone-trump-won-because-of-uneducated-americans-who-dont-travel-abroad/"
  },
  {
    "text": "Biden Administration Wants To Protect IRS Funding As Budget Deadline Nears  —  Treasury's deputy secretary warned that the U.S. could lose $140 billion over a decade if it ends a recent funding boost to the IRS.  —  LOADING  —  President Joe Biden's administration wants Congress … ",
    "url": "https://www.huffpost.com/entry/biden-administration-protect-irs-funding-budget-deadline_n_67462341e4b0fffc5a469d1f"
  },
  {
    "text": "Trump to Name Hassett National Economic Council Chief  — Hassett chaired Council of Economic Advisers under Trump  — Top economic aide will help steer tax and tariff agenda  —  President-elect Donald Trump is said to have selected Kevin Hassett to lead the National Economic Council … ",
    "url": "https://www.bloomberg.com/news/articles/2024-11-26/trump-poised-to-name-hassett-to-lead-national-economic-council"
  },
  {
    "text": "Kash Patel and Cliff Sims are jostling for the deputy director gig at the CIA  —  Two Trump transition insiders, Cliff Sims and Kash Patel, are angling to be deputy director of the CIA — and angering others who feel they're using their roles on the transition to undermine any would-be contenders … ",
    "url": "https://www.politico.com/live-updates/2024/11/26/congress/kash-patel-cliff-sims-deputy-director-cia-00191715"
  },
  {
    "text": "Donald Trump Is a Weakling.  That's the Problem.  —  The pithiest summary of Donald Trump's last presidency was by the comedian John Mulaney.  He compared it to a horse being set loose in a hospital.  “No one knows what the horse is gonna do next,” Mulaney said, “least of all the horse.",
    "url": "https://newrepublic.com/article/188785/donald-trump-weak-second-administration-chaos"
  }
]