[
  {
    "text": "Trump readies blanket tariffs as he brushes off inflation worries  —  In a wide-ranging interview with NBC News, Trump talked about tariffs, sending Patriot missiles to NATO for Ukraine and how he'll sell his recently passed “big, beautiful bill.”  —  President Donald Trump on Thursday … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-tariffs-inflation-hasbro-ukraine-patriot-missiles-nato-russia-rcna218125"
  },
  {
    "text": "Sen. Angela Paxton files for divorce from Attorney General Ken Paxton  —  In a statement, Angela Paxton said she moved to end her 38-year marriage “on biblical grounds,” citing “recent discoveries.”  —  State Sen. Angela Paxton announced Thursday she has filed for divorce from her husband, Texas Attorney General Ken Paxton.",
    "url": "https://www.texastribune.org/2025/07/10/angela-paxton-divorce-texas-attorney-general-ken/"
  },
  {
    "text": "Joni Ernst is the next GOP senator on retirement watch … Many will be watching closely for clues next week when Ernst files new campaign fundraising totals.  She raised just over $1 million in the first quarter of 2025, a solid but not overwhelming number for an in-cycle senator.",
    "url": "https://www.politico.com/news/2025/07/10/joni-ernst-retirement-watch-iowa-senate-seat-00447670"
  },
  {
    "text": "ICE handcuffs 71-year-old grandmother, a U.S. citizen, at San Diego immigration court … A grandmother planning to document ICE arrests at the San Diego courthouse instead became the story Tuesday after video of her own arrest began circulating.  —  An ICE agent accused the woman of pushing her.",
    "url": "https://www.nbcsandiego.com/news/local/ice-arrests-71-year-old-grandmother-a-us-citizen-at-san-diego-immigration-court/3865098/"
  },
  {
    "text": "Internal DOJ messages bolster claim that Trump judicial nominee spoke of defying court orders … Bove has said that he never advised anyone to violate court orders.  DOJ and the Department of Homeland Security did not immediately respond to requests for comment.",
    "url": "https://www.politico.com/news/2025/07/10/emil-bove-whistleblower-documents-00446225"
  },
  {
    "text": "State Department to Soon Begin Mass Layoffs  —  Secretary of State Marco Rubio's plan to downsize a “bloated” department had been on hold after a court ruling.  —  The State Department formally notified employees on Thursday that it was about to begin layoffs as part of a consolidation plan … ",
    "url": "https://www.nytimes.com/2025/07/10/us/politics/state-department-mass-layoffs.html"
  },
  {
    "text": "A Baseball Coach Says He Fended Off ICE Agents Questioning Kids on the Upper West Side  —  After coaching baseball on the west side of Manhattan for more than 20 years, Youman Wilder says he had a first-of-a-kind experience at the end of last month.  —  Wilder was leading a group … ",
    "url": "https://www.westsiderag.com/2025/07/10/a-baseball-coach-says-he-fended-off-ice-agents-questioning-kids-on-the-uws"
  },
  {
    "text": "Cops Probed Trump Terror Chief, 22, Over Teen Love Triangle  —  EYEBROW-RAISING  —  Police were called in after a threatening message was sent to a child by the ex-gardener chosen by the president to lead a key homeland security post, The Daily Beast has learned.  —  EXCLUSIVE",
    "url": "https://www.thedailybeast.com/cops-probed-thomas-fugate-trump-terror-chief-22-over-teen-love-triangle/"
  },
  {
    "text": "The F.B.I. Is Using Polygraphs to Test Officials' Loyalty  —  Some senior officials who have taken the test have been asked whether they said anything negative about the F.B.I. director, Kash Patel, in a highly unusual use of the tool.  —  Typically, the F.B.I. has turned to polygraph tests … ",
    "url": "https://www.nytimes.com/2025/07/10/us/politics/fbi-polygraph-kash-patel.html?unlocked_article_code=1.VU8.AnJL.I4rSD7g8Hmop&smid=url-share"
  },
  {
    "text": "Trump to use presidential authority to send weapons to Ukraine, sources say  —  President Donald Trump for the first time since returning to office will send weapons to Kyiv under a presidential power frequently used by his predecessor, two sources familiar with the decision said on Thursday … ",
    "url": "https://www.reuters.com/world/europe/trump-use-presidential-authority-send-weapons-ukraine-sources-say-2025-07-10/"
  },
  {
    "text": "Fired Justice Department official warns we are “driving straight into an abyss”  —  A 17-year former Justice Department official is warning of a wave of retribution inside the agency.  —  Patty Hartman, who served as a top public affairs specialist at the FBI and federal prosecutors' offices … ",
    "url": "https://www.cbsnews.com/news/fired-justice-department-official-we-are-falling-into-an-abyss/"
  },
  {
    "text": "Grok 4 seems to consult Elon Musk to answer controversial questions  —  During xAI's launch of Grok 4 on Wednesday night, Elon Musk said — while live-streaming the event on his social media platform, X — that his AI company's ultimate goal was to develop a “maximally truth-seeking AI.”",
    "url": "https://techcrunch.com/2025/07/10/grok-4-seems-to-consult-elon-musk-to-answer-controversial-questions/"
  },
  {
    "text": "DHS Cancels Extreme Weather Comms Grant While Bodies Still Being Recovered in Texas … As more than a hundred fatalities have been confirmed in Texas flash floods and some 170 remain missing, Department of Homeland Security Secretary Kristi Noem has both denied that DOGE cuts … ",
    "url": "https://talkingpointsmemo.com/edblog/dhs-cancels-extreme-weather-comms-grant-while-bodies-still-being-recovered-in-texas/sharetoken/1ae01ce6-3274-4b56-8da4-74a64b9ca750"
  },
  {
    "text": "Federal immigration agents carry out sweep at Ventura County cannabis farm  —  Federal immigration agents were carrying out immigration sweeps in Ventura County Thursday, prompting a standoff between authorities and immigrant rights groups.  —  Videos shared on social media show nearly … ",
    "url": "https://www.latimes.com/california/story/2025-07-10/federal-immigration-sweep-ventura-county-farms"
  },
  {
    "text": "When power is not currently an option, you might as well tell the truth  —  Amy Coney Barrett's pissy response to Ketanji Brown Jackson's CASA dissent is a real hit dog hollers moment:  —  As Jay Willis observes, it is...convenient that Barrett did not choose to “dwell” … ",
    "url": "https://www.lawyersgunsmoneyblog.com/2025/07/when-power-is-not-currently-an-option-you-might-as-well-tell-the-truth"
  },
  {
    "text": "Some of Iran's Enriched Uranium Survived Attacks, Israeli Official Says  —  The assessment came as experts are trying to determine how long it would take Iran to rebuild its nuclear program in the aftermath of U.S. and Israeli strikes.  —  Israel has concluded that some of Iran's underground stockpile … ",
    "url": "https://www.nytimes.com/2025/07/10/us/politics/iran-attacks-damage.html?unlocked_article_code=1.VU8.AVO7.Y4BNHAZtAqfU&smid=url-share"
  },
  {
    "text": "California surgical center staff demand to see warrant as ICE agents detain landscaper  —  Federal immigration agents seeking to detain a Honduran landscaper chased him into a Southern California surgical center and quickly found themselves in a tense standoff as clinic staff demanded to see identification and a warrant.",
    "url": "https://apnews.com/article/ice-arrest-california-surgery-center-c827038f1a40227dc05ab1c28b048035"
  },
  {
    "text": "Trump's EPA Chief Tried to Debunk Chemtrails, but Nobody Actually Read the Report  —  Lee Zeldin's social media posts about weather phenomena confused many into thinking he had endorsed conspiracy theories … Unfortunately, he seems to have left many people confused as to the agency's actual policies and actions.",
    "url": "https://www.rollingstone.com/politics/politics-news/chemtrail-conspiracy-theory-epa-lee-zeldin-1235382905/"
  },
  {
    "text": "Justice Dept. Demands Patient Details From Trans Medicine Providers  —  Doctors and hospitals were subpoenaed for private information on gender-related care for minors, the latest move by the Trump administration to stop the treatments.  —  The Justice Department has issued subpoenas demanding … ",
    "url": "https://www.nytimes.com/2025/07/10/health/transgender-medicine-minors-trump-subpoena.html?unlocked_article_code=1.VU8.-jw7.Tu6IpFti68dH&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "DHS Tells Police That Common Protest Activities Are ‘Violent Tactics’  —  DHS is urging law enforcement to treat even skateboarding and livestreaming as signs of violent intent during a protest, turning everyday behavior into a pretext for police action.  —  The Department of Homeland Security … ",
    "url": "https://www.wired.com/story/dhs-tells-police-that-common-protest-activities-are-violent-tactics/"
  },
  {
    "text": "Freed from ICE detention, Mahmoud Khalil files $20 million claim against Trump administration  —  On a recent afternoon, Mahmoud Khalil sat in his Manhattan apartment, cradling his 10-week-old son as he thought back to the pre-dawn hours spent pacing a frigid immigration jail in Louisiana, awaiting news of the child's birth in New York.",
    "url": "https://apnews.com/article/mahmoud-khalil-ice-release-trump-columbia-protests-570f7af32010c16b1a00dd7e78f4c687"
  },
  {
    "text": "Firings without explanation create culture of fear at Justice Dept., FBI  —  Widespread, abrupt terminations have left Justice Department and FBI employees wondering if they will be next, people familiar with the matter say.  —  Summary364  —  The Trump administration is firing and pushing … ",
    "url": "https://www.washingtonpost.com/national-security/2025/07/10/fbi-justice-dept-firings-trump-bondi/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzUyMTIwMDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzUzNTAyMzk5LCJpYXQiOjE3NTIxMjAwMDAsImp0aSI6IjQ5MDg4NDFiLWQ4N2EtNGQ0OS04ZGIyLWViOTkwMWZkMDJlZSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb25hbC1zZWN1cml0eS8yMDI1LzA3LzEwL2ZiaS1qdXN0aWNlLWRlcHQtZmlyaW5ncy10cnVtcC1ib25kaS8ifQ.2fLmfU7zuM9FyQn1f88ACqrFpYU7E2vdWAuRRZHqdXc&itid=gfta"
  },
  {
    "text": "Judge blocks Trump's birthright citizenship order despite Supreme Court ruling  —  A federal judge on Thursday has again barred President Donald Trump's administration from enforcing his executive order limiting birthright citizenship nationwide after the U.S. Supreme Court restricted the ability … ",
    "url": "https://www.reuters.com/legal/government/judge-weigh-blocking-trump-birthright-citizenship-despite-supreme-court-ruling-2025-07-10/"
  },
  {
    "text": "U.S. Department of Education Opens Title VI Investigation into George Mason University  —  A Complaint Filed with OCR Alleges that the University Has Widespread Policies in Hiring and Promotion That Discriminate on the Basis of Race  —  Today, the U.S. Department of Education's Office for Civil Rights … ",
    "url": "https://www.ed.gov/about/news/press-release/us-department-of-education-opens-title-vi-investigation-george-mason-university"
  },
  {
    "text": "They took away Linda Yaccarino's blue check!  —  Ex-CEO of X, Linda Yaccarino, seems to have left the company on good terms.  That is to say, Elon Musk has not disparaged her yet, and we know that he is not known to mince words about his adversaries.  But now, we have the teeniest … ",
    "url": "https://techcrunch.com/2025/07/10/they-took-away-linda-yaccarinos-blue-check/"
  },
  {
    "text": "Dean Phillips says there isn't room for ‘socialists’ like Mamdani in Democratic Party  —  Former Democratic congressman for Minnesota Dean Phillips warned the Democratic Party against embracing nominees like New York City mayoral candidate Zohran Mamdani, saying a victory in the general election would be a … ",
    "url": "https://www.washingtonexaminer.com/news/campaigns/3467878/dean-phillips-says-there-isnt-room-for-socialists-like-zohran-mamdani-in-democratic-party/"
  },
  {
    "text": "Trump Held Talks on Pardon for Ghislaine Maxwell: Biographer  —  WHITE HOUSE JITTERS  —  The president agonized over what Jeffrey Epstein's accomplice would reveal upon her arrest, author Michael Wolff said.  —  President Donald Trump weighed pardoning Ghislaine Maxwell for fear … ",
    "url": "https://www.thedailybeast.com/donald-trump-held-talks-on-pardon-for-jeffrey-epstein-associate-ghislaine-maxwell-biographer/"
  },
  {
    "text": "Democracy  —  If you want to know where Republican politics is heading, look at the memes.  Since the start of its second term, the Trump administration and its G.O.P. surrogates have been crashing out online.  —  Like an unhinged Zoomer, they've relentlessly posted sadistic memes … ",
    "url": "https://www.nytimes.com/2025/07/10/opinion/trolling-democracy.html?unlocked_article_code=1.VU8.2-lm.fH6PDZzOolyT&smid=bs-share"
  },
  {
    "text": "U.S. Department of Education Ends Taxpayer Subsidization of Postsecondary Education for Illegal Aliens  —  The U.S. Department of Education today announced it will end taxpayer subsidization of illegal aliens in career, technical, and adult education programs.",
    "url": "https://www.ed.gov/about/news/press-release/us-department-of-education-ends-taxpayer-subsidization-of-postsecondary-education-illegal-aliens"
  },
  {
    "text": "Billy Bush Says He Warned of ‘Animal’ Trump Comments Years Before Scandal  —  BUS BEAST  —  The host phoned a producer in 2005 after the president bragged about seducing co-anchor Nancy O'Dell.  —  Former Access Hollywood anchor Billy Bush says he warned NBC that President Donald Trump … ",
    "url": "https://www.thedailybeast.com/billy-bush-says-he-warned-of-animal-trump-comments-years-before-scandal/"
  },
  {
    "text": "FEMA leader is a no-show after deadly Texas flooding … As the Federal Emergency Management Agency responds to the deadly flooding in Texas, one key resource is missing: the FEMA leader.  —  David Richardson, the agency's acting administrator, has not been to the site of one of the nation's deadliest floods … ",
    "url": "https://www.eenews.net/articles/fema-leader-is-a-no-show-after-deadly-texas-flooding/"
  }
]