[
  {
    "text": "Trump Rails Against ‘Shylocks And Bad People’ In Iowa Speech  —  President Donald Trump employed a term often used as a slur against Jewish people as he blasted bankers during a speech in Iowa on Thursday evening.  The remark came as he was touting tax cuts in his so-called “Big Beautiful Bill … ",
    "url": "https://talkingpointsmemo.com/news/trump-rails-against-shylocks-and-bad-people-in-iowa-speech"
  },
  {
    "text": "What Trump Told Me About His Complete Domination of Congress  —  Demanding a bill by Independence Day was a telling flourish for someone with zero tolerance for independence in the legislative branch.  —  When I reached President Donald Trump by phone Tuesday night, with his “big, beautiful” … ",
    "url": "https://www.politico.com/news/magazine/2025/07/03/trump-interview-megabill-rachael-bade-00438195"
  },
  {
    "text": "Republicans Are Cutting Medicare.  Not Only Medicaid, Medicare.  —  Passage of the Big Beautiful Bill will force mandatory sequestration that will mean half a trillion dollars in Medicare cuts.  —  House Speaker Mike Johnson (R-LA) speaks with reporters ahead of a final vote … ",
    "url": "https://prospect.org/politics/2025-07-03-republicans-cutting-medicare-not-only-medicaid/"
  },
  {
    "text": "House passes sprawling domestic policy bill, sending it to Trump's desk  —  The Republican package would slash taxes, boost spending on immigration enforcement and the military, and impose steep cuts to Medicaid, SNAP and clean energy funding.  —  WASHINGTON — The Republican-controlled House … ",
    "url": "https://www.nbcnews.com/politics/congress/house-final-vote-trump-big-beautiful-bill-republicans-rcna216626"
  },
  {
    "text": "They Savaged Their Party's Bill.  Then They Voted for It.  —  Many Republicans had harshly criticized President Trump's marquee bill extending tax cuts and slashing social safety net programs — almost right up until the moment they voted for it.  —  In the days leading up to House passage … ",
    "url": "https://www.nytimes.com/2025/07/03/us/politics/republican-criticism-trump-policy-bill.html"
  },
  {
    "text": "After House Republicans ignored her appeals, Lisa Murkowski's vote looks even worse  —  The Alaska Republican cast an indefensible vote in favor of the GOP's megabill.  After the House approved the same package, her vote now looks even worse.  —  Three Senate Republicans balked … ",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/house-republicans-ignored-appeals-lisa-murkowskis-vote-looks-even-wors-rcna216750"
  },
  {
    "text": "Trump ignored GOP warnings to gamble on a politically risky bill  —  In Trump's eagerness to score a win and extend tax cuts, he walked away from a key campaign promise on Medicaid.  —  Sen. Thom Tillis (R-North Carolina) told President Donald Trump he was making a mistake.",
    "url": "https://www.washingtonpost.com/politics/2025/07/03/trump-republicans-medicaid-tax-bill/"
  },
  {
    "text": "Trump Claims Sweeping Power to Nullify Laws, Letters on TikTok Ban Show  —  In purporting to license otherwise illegal conduct by tech firms, President Trump set a precedent expanding executive power, legal experts warned.  —  Attorney General Pam Bondi told tech companies … ",
    "url": "https://www.nytimes.com/2025/07/03/us/politics/trump-bondi-tiktok-executive-power.html?unlocked_article_code=1.Tk8.cwes.GGYdG9AILg_A&smid=url-share"
  },
  {
    "text": "SCOTUS allows Trump admin to send eight men to South Sudan with no process  —  The U.S. Supreme Court issued an order on Thursday that will empower the Trump administration to send people subject to deportation to countries they have no connection with that are so dangerous the Trump administration advises Americans not to travel there.",
    "url": "https://www.lawdork.com/p/scotus-allows-trump-admin-to-send"
  },
  {
    "text": "Supreme Court paves the way for Trump to send migrants to South Sudan  —  The Justice Department had sought clarification of a recent Supreme Court decision that cleared the path for the administration to quickly deport immigrants to “third countries.”  —  WASHINGTON — The Supreme Court … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-trump-send-migrants-south-sudan-djibouti-rcna214952"
  },
  {
    "text": "Mamdani Identified as Asian and African American on College Application  —  Zohran Mamdani, the Democrat running for mayor of New York City, was born in Uganda.  He doesn't consider himself Black but said the application didn't allow for the complexity of his background.",
    "url": "https://www.nytimes.com/2025/07/03/nyregion/mamdani-columbia-black-application.html?unlocked_article_code=1.Tk8.dq-_.OgG4Ktak82Hp&smid=url-share"
  },
  {
    "text": "US military says 200 Marines being sent to support ICE in Florida  —  The U.S. military said on Thursday it will send 200 Marines to Florida to provide administrative and logistical support to Immigrations and Customs Enforcement.  —  The Marines are the first wave of U.S. Northern Command's support … ",
    "url": "https://www.reuters.com/world/us/us-military-says-200-marines-being-sent-support-ice-florida-2025-07-03/"
  },
  {
    "text": "200 Marines among those being sent to Florida to help ICE  —  ICE will determine the duties assigned to the Marines.  —  Marines from the Marine Corps Air Ground Combat Center (MCAGCC) at Twentynine Palms guard the Wilshire Federal Building as people protest the involvement of the U.S … ",
    "url": "https://abcnews.go.com/Politics/200-marines-florida-ice/story?id=123466361"
  },
  {
    "text": "Roughly 140 EPA staffers who signed ‘dissent’ letter are put on leave  —  Trump officials have placed 139 employees who signed a letter of dissent protesting the Environmental Protection Agency's current direction and policies on leave Thursday.  —  The Trump administration has placed … ",
    "url": "https://www.washingtonpost.com/climate-environment/2025/07/03/epa-dissent-letter-employees-leave/"
  },
  {
    "text": "Rural southwest Nebraska clinic closes, blaming expected Medicaid cuts  —  LINCOLN, Neb. (KLKN) — A clinic in southwest Nebraska announced Wednesday that it is closing due to financial challenges, including anticipated Medicaid cuts.  —  McCook-based Community Hospital said it is shutting … ",
    "url": "https://www.klkntv.com/rural-southwest-nebraska-clinic-closes-blaming-expected-medicaid-cuts/"
  },
  {
    "text": "Fact Sheet: President Donald J. Trump Makes Our National Parks Great Again  —  PUTTING AMERICANS FIRST: Today, President Donald J. Trump signed an Executive Order investing in our national treasures by increasing fees for foreign tourists visiting our national parks to improve services, access, and affordability for Americans.",
    "url": "https://www.whitehouse.gov/fact-sheets/2025/07/fact-sheet-president-donald-j-trump-makes-our-national-parks-great-again/"
  },
  {
    "text": "CBS News anchor swipes at parent company for settling Trump lawsuit ‘it said is without basis in law and fact’  —  'Can you hold power to account after paying it millions?  Can an audience trust you when it thinks you've traded away that trust?'  John Dickerson asked viewers on Wednesday.",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/cbs-john-dickerson-paramount-trump-settlement-b2782199.html"
  },
  {
    "text": "L.A. activist indicted after handing out face shields to anti-ICE protesters  —  A local activist who handed out protective face shields to protesters last month during demonstrations against the Trump administration's chaotic immigration raids was indicted by a federal grand jury Wednesday.",
    "url": "https://www.latimes.com/california/story/2025-07-03/activist-indicted-face-shields-protests"
  },
  {
    "text": "Alina Habba Has Been Under an Ethics Investigation for Over a Year  —  Documents obtained by NOTUS detail an investigation into Trump's pick for U.S. attorney for New Jersey.  — Copy  —  Alina Habba, once President Donald Trump's personal attorney and now the interim U.S. attorney for New Jersey … ",
    "url": "https://www.notus.org/donald-trump/alina-habba-ethics-investigation"
  },
  {
    "text": "DHS Announces ICE Arrest of Mexican Boxer, Sinaloa Cartel Affiliate with Active Criminal Arrest Warrant Julio Cesar Chavez Jr.  —  Despite Chavez being flagged as a public safety threat, the Biden administration indicated in internal records he was not an immigration enforcement priority",
    "url": "https://www.dhs.gov/news/2025/07/03/dhs-announces-ice-arrest-mexican-boxer-sinaloa-cartel-affiliate-active-criminal"
  }
]