[
  {
    "text": "Americans are divided along party lines over Trump's actions in election cases, AP-NORC poll shows  —  Americans are deeply divided along party lines in their views of President Donald Trump's actions in the most recent criminal cases brought against him, a new poll shows … ",
    "url": "https://apnews.com/article/trump-indictment-poll-georgia-elections-b6140eed88b3153e41dbf9e008d5a21b"
  },
  {
    "text": "BREAKING: Trump, allies will be booked at Fulton County Jail, sheriff says  —  X  —  Former President Donald Trump and his 18 co-defendants will be booked at the Fulton County Jail, the sheriff's office said Tuesday.  —  “At this point, based on guidance received from the District Attorney's office … ",
    "url": "https://www.ajc.com/news/crime/breaking-trump-allies-will-be-booked-at-fulton-county-jail-sheriff-says/TVA75MWN3ZG4DBSS4TLO7EB4WE/"
  },
  {
    "text": "Pence: ‘The Georgia election was not stolen’  —  The former vice president is leaning into his resistance to Trump's efforts to overturn the election.  —  INDIANAPOLIS — Mike Pence said Wednesday that the Georgia election was not stolen in 2020, leaning into his role on Jan. 6 … ",
    "url": "https://www.politico.com/news/2023/08/16/pence-georgia-election-trump-indictment-00111430"
  },
  {
    "text": "The Fulton County Indictment: An Initial Examination  —  The document is unlike anything else pending against Trump in the scope of its allegations of criminality.  —  S_R_Anders  —  SaraphinD  —  TylerMcBrien  —  katherinepomps  —  Meet The Authors",
    "url": "https://www.lawfaremedia.org/article/the-fulton-county-indictment-an-initial-examination"
  },
  {
    "text": "Trump Plans to Release 100-Page Report on Georgia Election Fraud Claims  —  Liz Harrington, a communications aide described as a true believer in the former president's lies about a stolen election, helped prepare the report.  Mr. Trump said he would release it on Monday.",
    "url": "https://www.nytimes.com/2023/08/15/us/politics/trump-election-report-georgia-indictment.html"
  },
  {
    "text": "Why the Fani Willis Prosecution of Donald Trump Is Indispensable  —  Mr. Eisen is a co-author of “Fulton County, Georgia's Trump Investigation,” a Brookings report on the Fulton County district attorney's investigation.  Ms. Copeland is a criminal defense and appellate attorney in Savannah, Ga.",
    "url": "https://www.nytimes.com/2023/08/15/opinion/trump-indictment-georgia-fani-willis.html"
  },
  {
    "text": "The Jolt: Marjorie Taylor Greene blasts Kemp and floats VP, Senate bids  —  Since Fulton County District Attorney Fani Willis indicted former President Donald Trump for interfering in Georgia's 2020 election, U.S. Rep. Marjorie Taylor Greene has been on the attack.The conservative firebrand … ",
    "url": "https://www.ajc.com/politics/politics-blog/the-jolt-marjorie-taylor-greene-blasts-kemp-and-floats-vp-senate-bids/YKTNGG7QRJDBTH4RSVTV37PZPI/"
  },
  {
    "text": "Special counsel obtained Trump DMs despite ‘momentous’ bid by Twitter to delay, unsealed filings show  —  Judge Beryl Howell lit into Twitter for taking steps to give Donald Trump advance notice about the search warrant.  —  Special counsel Jack Smith obtained an extraordinary array of data … ",
    "url": "https://www.politico.com/news/2023/08/15/special-counsel-obtained-trump-twitter-howell-00111410"
  },
  {
    "text": "Special Counsel Obtained Trump's Direct Messages on Twitter  —  The nature of the messages or who exactly wrote them remained unclear, but it was a revelation that such messages were associated with the former president's account.  —  The federal prosecutors who charged former President Donald J. Trump … ",
    "url": "https://www.nytimes.com/2023/08/15/us/politics/trump-twitter-direct-messages-warrant.html"
  },
  {
    "text": "Trump's Social Media Posts Test Conditions of His Release in Jan. 6 Case  —  Some lawyers have said that if the former president were an ordinary citizen issuing these attacks, he would be in jail by now.  The question is whether he will face similar consequences.",
    "url": "https://www.nytimes.com/2023/08/16/us/politics/trump-chutkan-2020-election-truth-social.html"
  },
  {
    "text": "Mark Meadows seeks to move Fulton County election case to federal court  —  The former chief of staff was indicted with Trump and 17 others on Monday.  —  Former White House Chief of Staff Mark Meadows officially filed Tuesday to move the case brought against him by Fulton County District … ",
    "url": "https://abcnews.go.com/US/meadows-seeks-move-fulton-county-election-case-federal/story?id=102295084"
  },
  {
    "text": "California Sen. Dianne Feinstein alleges financial abuse in lawsuit over her husband's estate  —  WASHINGTON — Sen. Dianne Feinstein, D-Calif., has called to remove the trustees of her late husband's estate, alleging that they committed financial abuse against her, according to a lawsuit filed earlier this month.",
    "url": "https://www.usatoday.com/story/news/politics/2023/08/16/dianne-feinstein-alleges-financial-abuse-california-estate/70601091007/"
  },
  {
    "text": "Trump refusal to sign loyalty pledge puts RNC in bind  —  Former President Trump's refusal to sign the Republican National Committee's loyalty pledge is putting the organization in a bind as next week's GOP primary debate approaches.  —  Trump said he wouldn't sign the pledge last week … ",
    "url": "https://thehill.com/homenews/campaign/4154142-trump-refusal-to-sign-loyalty-pledge-puts-rnc-in-bind/"
  },
  {
    "text": "Democrats' climate distraction won't stop Hawaii wildfires  —  President Joe Biden can't be bothered to disrupt his beach vacation to even comment on, let alone visit, the most deadly wildfires in over 100 years, but that didn't stop other Democrats from blaming the carnage in Maui on climate change.",
    "url": "https://www.washingtonexaminer.com/opinion/editorials/democrats-climate-distraction-wont-stop-hawaii-wildfires"
  },
  {
    "text": "Statement from White House Press Secretary Karine Jean-Pierre on the President and First Lady Traveling to Hawaii  —  The President and First Lady will travel to Maui on Monday, August 21 to meet with first responders, survivors, as well as federal, state, and local officials, in the wake of deadly wildfires on the island.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2023/08/16/statement-from-white-house-press-secretary-karine-jean-pierre-on-the-president-and-first-lady-traveling-to-hawaii/"
  },
  {
    "text": "Dems start laughing off House GOP's Trump protection push  —  FOUR INDICTMENTS AND AN EXPUNGEMENT?  —  House Republicans first flirted with nullifying Donald Trump's impeachments back when the former president faced only two indictments.  Now that number has doubled, and the manager … ",
    "url": "https://www.politico.com/newsletters/huddle/2023/08/16/dems-start-laughing-off-house-gops-trump-protection-push-00111426"
  },
  {
    "text": "Entire police department resigns in Minnesota city, leaves mayor ‘blindsided’: ‘Zero applicants’  —  Goodhue's police chief said in July that he had ‘zero applicants’ to join force  —  Goodhue, Minnesota, a small city in the southeastern part of the state, lost its entire police force … ",
    "url": "https://www.foxnews.com/media/entire-police-department-resigns-minnesota-town-leaves-mayor-blindsided-zero-applicants"
  }
]