[
  {
    "text": "Speaker Johnson announces policy barring trans women from Capitol bathrooms  —  Speaker Mike Johnson (R-La.) announced on Wednesday that transgender women are not permitted to use bathrooms in the Capitol that match their gender identity, taking a stance on the hot-button issue that has overtaken the Capitol in recent days.",
    "url": "https://thehill.com/homenews/house/5000006-speaker-johnson-transgender-bathroom-policy/"
  },
  {
    "text": "Mike Johnson Announces Transgender Bathroom Ban In Capitol  —  The speaker's announcement is aimed in particular at incoming transgender congresswoman Sarah McBride.  —  LOADING  —  WASHINGTON ― House Speaker Mike Johnson (R-La.) announced Wednesday that transgender lawmakers and staff … ",
    "url": "https://www.huffpost.com/entry/mike-johnson-trans-women-capitol-bathrooms_n_673e19fbe4b09ddca792b130"
  },
  {
    "text": "House Ethics panel does not agree to release the Gaetz report  —  The House Ethics Committee on Wednesday did not agree to release the long-anticipated report into Matt Gaetz.  “There was not an agreement by the committee to release the report,” Chair Michael Guest (R-Miss.) told reporters after the meeting ended.",
    "url": "https://www.politico.com/live-updates/2024/11/20/congress/ethics-panel-does-not-agree-to-release-gaetz-report-00190655"
  },
  {
    "text": "Musk, Ramaswamy lay out plans for ‘mass’ federal layoffs, rule rollbacks under Trump  —  Tech entrepreneurs Elon Musk and Vivek Ramaswamy said Wednesday that their brand-new government efficiency panel will identify “thousands” of regulations for President-elect Trump to eliminate … ",
    "url": "https://thehill.com/policy/technology/5000448-elon-musk-vivek-ramaswamy-government-efficiency/"
  },
  {
    "text": "Elon Musk and Vivek Ramaswamy: The DOGE Plan to Reform Government  —  Following the Supreme Court's guidance, we'll reverse a decadeslong executive power grab.  —  Our nation was founded on the basic idea that the people we elect run the government.  That isn't how America functions today.",
    "url": "https://www.wsj.com/opinion/musk-and-ramaswamy-the-doge-plan-to-reform-government-supreme-court-guidance-end-executive-power-grab-fa51c020"
  },
  {
    "text": "Morning Digest: In stunning turnaround, Democrat takes lead in North Carolina Supreme Court race  —  Leading Off  —  NC Supreme Court  —  A critical race for North Carolina's Supreme Court is headed to a recount after late-counted votes gave Democratic incumbent Allison Riggs the slimmest … ",
    "url": "https://www.the-downballot.com/p/morning-digest-in-stunning-turnaround"
  },
  {
    "text": "Republicans in North Carolina push sweeping changes to consolidate power  —  The last-minute inclusions in a lame-duck bill would strip the incoming Democratic governor and attorney general of significant authority before the GOP loses its legislative supermajority.",
    "url": "https://www.washingtonpost.com/politics/2024/11/20/north-carolina-legislature-governor-elections/"
  },
  {
    "text": "Raimondo's urgent mission: Leave no cash for Trump  —  With a massive legacy program hanging in the balance, the Commerce secretary wants to get billions in microchip money out the door in the next two months.  —  Commerce Secretary Gina Raimondo is on an urgent mission … ",
    "url": "https://www.politico.com/news/2024/11/20/raimondo-commerce-trump-legacy-00190538"
  },
  {
    "text": "Gaetz sent over $10K in Venmo payments to 2 women who testified in House probe, records suggest  —  House investigators also obtained a $750 check from Gaetz, said sources.  —  Matt Gaetz talks before President-elect Donald Trump speaks during an America First Policy Institute gala at his Mar-a-Lago estate … ",
    "url": "https://abcnews.go.com/US/gaetz-10k-venmo-payments-2-women-testified-house/story?id=116019367"
  },
  {
    "text": "House panel was told Gaetz paid two women $10,000, in part for sex  —  The House Ethics Committee is expected to vote on whether to release its investigation into the former congressman.  —  House Ethics Committee investigators probing sexual misconduct allegations against former congressman … ",
    "url": "https://www.washingtonpost.com/politics/2024/11/20/gaetz-investigation-house-ethics-committee-vance/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzMyMDc4ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzMzNDYxMTk5LCJpYXQiOjE3MzIwNzg4MDAsImp0aSI6IjRlYTViZWFkLWYwMzQtNDdmMi05ODY4LThjZWFhNzAwMWJkYiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzExLzIwL2dhZXR6LWludmVzdGlnYXRpb24taG91c2UtZXRoaWNzLWNvbW1pdHRlZS12YW5jZS8ifQ.o1PgFbLKGf0CqtqEG-mbI1PuHPHGdGT_ai02B06f2l0&itid=gfta"
  },
  {
    "text": "Ukraine Fires UK Cruise Missiles at Russia for First Time  — Comes day after Western-supplied ATACMS were used by Ukraine  — Ukraine's Zelenskiy has said weapons critical to the conflict  —  Ukrainian forces fired British cruise missiles at military targets inside Russia for the first time … ",
    "url": "https://www.bloomberg.com/news/articles/2024-11-20/ukraine-fires-uk-storm-shadow-missiles-at-russia-for-first-time"
  },
  {
    "text": "Past Nominees Have Been Undone by Far Less Than What Surrounds Trump Picks  —  Back taxes, youthful pot smoking and undocumented nannies scuttled previous presidential choices.  Some of President-elect Donald J. Trump's candidates face bigger questions.  —  A Supreme Court prospect bowed … ",
    "url": "https://www.nytimes.com/2024/11/20/us/politics/trump-cabinet-matt-gaetz-sexual-misconduct.html"
  },
  {
    "text": "Please, Mr. President, ditch this dreadful duo — Gabbard and Gaetz  —  In January 2017, shortly after taking office for the first time, President Donald Trump had already issued 19 executive actions, and this paper dubbed him DON NONSTOP.  —  To which second-term Trump says: “Hold my Diet Coke.”",
    "url": "https://nypost.com/2024/11/19/opinion/donald-trump-please-get-rid-of-matt-gaetz-and-tulsi-gabbard-from-your-cabinet/"
  },
  {
    "text": "Harris Loss Has Democrats Fighting Over How to Talk About Transgender Rights  —  Kamala Harris left Donald J. Trump's anti-transgender attack ads largely unanswered.  Some Democrats call it political malpractice.  —  In the weeks before Election Day, aides to Kamala Harris could see in campaign polling … ",
    "url": "https://www.nytimes.com/2024/11/20/us/politics/presidential-campaign-transgender-rights.html"
  },
  {
    "text": "Trump's education pick once incorrectly claimed to have education degree  —  Linda McMahon, in a questionnaire for a 2009 post on a Connecticut state education board, incorrectly said she had a bachelor's degree in education, according to news reports.  —  Linda McMahon, President-elect … ",
    "url": "https://www.washingtonpost.com/politics/2024/11/20/mcmahon-trump-education-degree/"
  },
  {
    "text": "Morning Joe Hemorrhaged Viewers After Announcing Meeting With Trump  —  Based on Monday morning's hour-by-hour ratings, Morning Joe viewers were not happy with Joe Scarborough and Mika Brzezinski's announcement that they met privately with President-Elect Donald Trump at Mar-a-Lago on Friday.",
    "url": "https://www.mediaite.com/tv/new-morning-joe-hemorrhaged-viewers-after-announcing-meeting-with-trump/"
  },
  {
    "text": "How 2024 may shift our understanding of the political generation gap  —  Data from the election remains incomplete, but we can already assess how the generational divide has changed — and how it hasn't.  —  Hours after polls closed — or even before polls closed in some states … ",
    "url": "https://www.washingtonpost.com/politics/2024/11/20/how-2024-may-shift-our-understanding-political-generation-gap/"
  },
  {
    "text": "Trump lawyers demand judge ‘immediately’ throw out hush money case  —  Letting the conviction stand would threaten to “hamstring the operation of the whole governmental apparatus,” lawyers Todd Blanche and Emil Bove argued in a letter to the judge.  —  Donald Trump's attorneys are demanding … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-lawyers-demand-judge-immediately-throw-hush-money-case-rcna180961"
  },
  {
    "text": "Court extends hold on Louisiana law requiring the Ten Commandments in classrooms  —  Louisiana's plan to make all of the state's public school classrooms post the Ten Commandments remains blocked under an order Wednesday by a federal appeals court in New Orleans.",
    "url": "https://apnews.com/article/louisiana-schools-ten-commandments-cf59c57adfa049111c67a6cda1efb796"
  },
  {
    "text": "Entering Our Crank Era  —  The TV-guy administration grows: Yesterday, Donald Trump tapped Dr. Mehmet Oz as his administrator for the Centers for Medicare and Medicaid Services.  “Dr. Oz will work closely with Robert F. Kennedy Jr. to take on the illness industrial complex … ",
    "url": "https://www.thebulwark.com/p/rfk-jr-entering-our-crank-era"
  }
]