[
  {
    "text": "How Republicans castrated themselves … - Letting any member call a vote on removing the speaker. … - Surrendering authority of the Rules Committee, which sets the terms for how legislation will be handled during votes.",
    "url": "https://www.axios.com/2024/04/23/republicans-speaker-motion-vacate-rules-committee"
  },
  {
    "text": "House Republican infighting getting worse after foreign aid vote  —  One GOP lawmaker said he serves with “some real scumbags,” while others fought over Speaker Mike Johnson's strategy for bringing up the aid package  —  The House came together Saturday to pass a sweeping $95 billion foreign aid package … ",
    "url": "https://www.washingtonpost.com/politics/2024/04/22/house-republicans-infighting-foreign-aid/"
  },
  {
    "text": "Live Updates: Jurors in Trump Criminal Case Told That He Lied ‘Over and Over and Over’  —  Donald J. Trump is charged with falsifying business records to cover up a sex scandal that threatened to derail his 2016 campaign.  A lawyer for Mr. Trump insisted that the former president “did not commit any crimes.”",
    "url": "https://www.nytimes.com/live/2024/04/22/nyregion/trump-hush-money-trial"
  },
  {
    "text": "NASA's Voyager 1 Resumes Sending Engineering Updates to Earth  —  For the first time since November, NASA's Voyager 1 spacecraft is returning usable data about the health and status of its onboard engineering systems.  The next step is to enable the spacecraft to begin returning science data again.",
    "url": "https://blogs.nasa.gov/voyager/2024/04/22/nasas-voyager-1-resumes-sending-engineering-updates-to-earth/"
  },
  {
    "text": "Statement from Columbia University President Minouche Shafik  —  Dear Members of the Columbia Community,  —  I am deeply saddened by what is happening on our campus.  Our bonds as a community have been severely tested in ways that will take a great deal of time and effort to reaffirm.",
    "url": "https://president.columbia.edu/news/statement-columbia-university-president-minouche-shafik-4-22"
  },
  {
    "text": "‘Plasmic Echo’ was FBI code name for Trump classified documents probe  —  The FBI's code name for its investigation into former President Trump's handling of classified documents was “Plasmic Echo,” according to court filings published Monday.  —  The name was listed in unredacted court … ",
    "url": "https://thehill.com/regulation/court-battles/4613537-plasmic-echo-was-fbi-code-name-for-trump-classified-documents-probe/"
  },
  {
    "text": "Minnesota Sen. Nicole Mitchell arrested on suspicion of burglary after being found in home  —  Mitchell, a Democrat, was arrested after being found inside a home in Detroit Lakes, Minnesota, police say.  She was booked into Becker County jail on a burglary charge.",
    "url": "https://www.usatoday.com/story/news/nation/2024/04/22/minnesota-senator-burglary-arrest-nicole-mitchell/73419507007/"
  },
  {
    "text": "Republicans are starting to worry about RFK Jr.  —  Even Donald Trump acknowledged Monday that the independent candidate “probably hurts both” Biden and him.  —  Republicans are waking up to the reality that Robert F. Kennedy Jr. could sink their standard-bearer just as easily … ",
    "url": "https://www.politico.com/news/2024/04/22/republicans-are-starting-to-worry-about-rfk-jr-00153763"
  },
  {
    "text": "A historic victory for unions  —  On April 19, the National Labor Relations Board (NLRB) announced that workers at a Volkswagen auto plant in Chattanooga, Tennessee, voted to join the United Auto Workers (UAW) union.  The union won by a 73% majority, with more than 2,600 votes - a historic feat.",
    "url": "https://popular.info/p/a-historic-victory-for-unions"
  },
  {
    "text": "Xavier Becerra plots political future after Biden administration  —  The Health and Human Services secretary is making moves to run again in California.  Maybe even too many moves.  —  Health and Human Services Secretary Xavier Becerra's plans to leave the Biden administration and run … ",
    "url": "https://www.politico.com/news/2024/04/23/xavier-becerra-biden-administration-future-00153737"
  },
  {
    "text": "Greene faces uphill battle to oust Johnson  —  Rep. Marjorie Taylor Greene (R-Ga.) is escalating her threat to remove Speaker Mike Johnson (R-La.) from power, but she faces a steep climb if she hopes to achieve that goal.  —  Not only has the Speaker recently received a glowing review … ",
    "url": "https://thehill.com/homenews/house/4612735-greene-vow-motion-vacate-johnson/"
  },
  {
    "text": "Trump Calls for More Protests Outside Trial: ‘Rally Behind MAGA’  —  With support from demonstrators in Lower Manhattan spotty so far, Donald Trump issued a call to “rally behind MAGA,” and suggested the poor turnout was a result of a plot against his supporters.",
    "url": "https://www.nytimes.com/2024/04/22/us/politics/trump-trial-protests.html"
  },
  {
    "text": "Unpacking the alleged crime that made Trump's alleged crime a felony  —  Attorneys offered opening arguments in the criminal trial of Donald Trump on Monday in Manhattan, beginning the process of presenting to the jury the state's case against the former president.",
    "url": "https://www.washingtonpost.com/politics/2024/04/22/trump-hush-money-trial-charges/"
  },
  {
    "text": "Next Ukraine package to be larger than normal, include armored vehicles  —  The Senate could approved more than $60 billion for Kyiv as soon as Tuesday.  —  The Biden administration is preparing a larger-than-normal package of military aid for Ukraine that will include armored vehicles … ",
    "url": "https://www.politico.com/news/2024/04/22/ukraine-package-armored-vehicles-00153672"
  },
  {
    "text": "Thailand to replace military-appointed Senate, reduce its powers  —  Thailand's cabinet on Tuesday approved a plan to select a new slate of senators who will no longer be allowed to vote on who becomes prime minister, removing what has effectively served as a veto for the powerful military on who leads the country.",
    "url": "https://www.reuters.com/world/asia-pacific/thailand-replace-military-appointed-senate-reduce-its-powers-2024-04-23/"
  },
  {
    "text": "Biden moves to block abortion records from investigators  —  The Biden administration on Monday updated federal health privacy rules to protect patients seeking abortion and providers involved in the procedure. … The big picture: Health plans and providers will be barred from disclosing … ",
    "url": "https://www.axios.com/2024/04/22/biden-abortion-records-patients-hipaa-investigations"
  },
  {
    "text": "The GOP's Worst Fears About the End of Roe v. Wade Have Come True  —  Nearly two years after the leak of Supreme Court Justice Samuel Alito's draft opinion overturning Roe v Wade, abortion refuses to step out of the spotlight on center stage in American politics.",
    "url": "https://newrepublic.com/article/180812/gops-worst-fears-end-roe-v-wade-come-true"
  },
  {
    "text": "Melania Quietly Emerges From the Shadows—at a Sparse Event for Log Cabin Republicans  —  BACK IN BLACK  —  Melania Trump's return to the campaign trail is just beginning.  But it was notable that she chose a small gathering for Log Cabin Republicans for her first solo event.",
    "url": "https://www.thedailybeast.com/melania-trump-quietly-emerges-from-the-shadowsat-a-sparse-event-for-log-cabin-republicans"
  }
]