[
  {
    "text": "Senior U.S. prosecutor resigns, citing demands to open probe into Biden-era contract  —  The top federal prosecutor who supervised criminal cases at the Washington, D.C. U.S. Attorney's office resigned on Tuesday, citing what she described as an improper demand by officials appointed … ",
    "url": "https://ca.news.yahoo.com/senior-u-prosecutor-resigns-citing-150420249.html"
  },
  {
    "text": "Head of Justice Department's Washington, DC, criminal division quits  —  The head of the criminal division within the DC US Attorney's Office has left her post, according to four sources.  —  The sudden departure of Justice Department veteran Denise Cheung comes a day after President Donald … ",
    "url": "https://www.cnn.com/2025/02/18/politics/justice-department-dc-criminal-division"
  },
  {
    "text": "High-ranking D.C. federal prosecutor resigns in protest  —  The leader of the criminal division has stepped down following a dispute over freezing Biden-era environmental grants.  —  The head of the criminal division in the U.S. attorney's office in D.C. resigned Tuesday morning after declining … ",
    "url": "https://www.washingtonpost.com/investigations/2025/02/18/federal-prosecutor-dc-resigns/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM5ODU0ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQxMjM3MTk5LCJpYXQiOjE3Mzk4NTQ4MDAsImp0aSI6ImIxY2MyZTAyLTY1YWUtNDg5ZS1iMTBiLWIzNzYwYmI4MGZmZiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9pbnZlc3RpZ2F0aW9ucy8yMDI1LzAyLzE4L2ZlZGVyYWwtcHJvc2VjdXRvci1kYy1yZXNpZ25zLyJ9.qO8Nbo3eH7L7qqiJiGL7va_FWw9RTBni2zBb7t1InN4&itid=gfta"
  },
  {
    "text": "“This Is Some New and Very Dangerous Development.”  Inside the Bloody Battle Over the DOJ's Crown Jewel  —  Current and former SDNY colleagues of Emil Bove, Danielle Sassoon, and Hagan Scotten describe an office fighting to keep its independence under Trump as its stars wage war against one another.",
    "url": "https://www.vanityfair.com/news/story/trump-adams-emil-bove-sdny-justice-dept"
  },
  {
    "text": "Who's in charge of DOGE?  Not Elon Musk, White House says  —  A Trump administration personnel official says Musk has “no actual or formal authority to make government decisions.”  —  Elon Musk is not the leader of DOGE — the mysterious Trump administration operation overseeing an effort to break and remake the federal bureaucracy.",
    "url": "https://www.politico.com/news/2025/02/17/doge-administrator-elon-musk-00204639"
  },
  {
    "text": "Top Social Security official exits after clash with Musk's DOGE over data  —  Yet another top career staffer is leaving the administration amid a disagreement over a request by Elon Musk's team for sensitive government information.",
    "url": "https://www.washingtonpost.com/politics/2025/02/17/doge-social-security-musk/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM5NzY4NDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQxMTUwNzk5LCJpYXQiOjE3Mzk3Njg0MDAsImp0aSI6Ijc5N2IyNDA4LTg2YjMtNDgyYS1hZDlmLTg4ZWUzOTNlODM1MSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzAyLzE3L2RvZ2Utc29jaWFsLXNlY3VyaXR5LW11c2svIn0.daGls0KNeZgZ7r2NbGG7PZ88Va-QLs-d_GVYjFblJLs&itid=gfta"
  },
  {
    "text": "Senator says GOP's hands are tied on DOGE cuts — ‘except complain’  —  Senate Judiciary Chair Chuck Grassley said Congress is powerless in the face of cuts from Elon Musk's Department of Government Efficiency.  “Congress can't do anything except complain” about the slashing of the federal government … ",
    "url": "https://www.politico.com/live-updates/2025/02/18/congress/chuck-grassley-musk-doge-trump-00204687"
  },
  {
    "text": "Food head at FDA quits citing Trump administration's mass staff cuts  —  Jim Jones, who joined Food and Drug Administration in 2023, says layoffs would make it ‘fruitless’ to continue in role  —  The head of the food division at the US Food and Drug Administration has quit in protest … ",
    "url": "https://www.theguardian.com/us-news/2025/feb/18/fda-food-head-quits-trump"
  },
  {
    "text": "Under Trump's Mass Deportation Plan, Some Migrants Are Being Sent to Panama  —  Migrants deported from the United States are being held at the Decapolis Hotel Panama in Panama City.  The deportees come from Afghanistan, Iran, China and other nations.  —  They arrived at the United States border … ",
    "url": "https://www.nytimes.com/2025/02/18/world/americas/trump-migrant-deportation-panama.html?unlocked_article_code=1.x04.R5ag.BfOOWT0b5lvs&smid=url-share"
  },
  {
    "text": "‘Good luck with that.’ Trump administration terminates privacy officials at agency overseeing government hiring and firing  —  The Trump administration has quietly fired multiple members of the “privacy team” and other officials from the office that oversees the hiring of federal workers … ",
    "url": "https://www.cnn.com/2025/02/18/politics/opm-privacy-team-fired/"
  },
  {
    "text": "As U.S. and Putin negotiate, intel shows he's not interested ‘in a real peace deal,’ sources say  —  Intelligence suggests Russian President Vladimir Putin is going through the motions and still thinks he can eventually control all of Ukraine, the sources told NBC News.",
    "url": "https://www.nbcnews.com/politics/national-security/us-putin-negotiate-intel-shows-s-not-interested-real-peace-deal-source-rcna192524"
  },
  {
    "text": "‘I Am Finally Free!’:  Leonard Peltier Released From Prison After Nearly 50 Years  —  Joe Biden granted clemency to the Native American rights activist literally minutes before his presidency ended.  —  LOADING  —  WASHINGTON — Native American rights activist Leonard Peltier was released … ",
    "url": "https://www.huffpost.com/entry/leonard-peltier-released-from-prison-biden_n_67afb3fce4b053b7510ff211"
  },
  {
    "text": "Trump Ally Elon Musk Is Not Actually In Charge Of DOGE, White House Says  —  The court filing raises further questions about the operation that has wreaked havoc across the federal government.  —  LOADING  —  President Donald Trump's billionaire ally Elon Musk is not actually in charge … ",
    "url": "https://www.huffpost.com/entry/elon-musk-not-in-charge-of-doge-white-house_n_67b45de0e4b063a7b19aabcd"
  },
  {
    "text": "Birthright Citizenship  —  Since the publication of our opinion piece on birthright citizenship in the New York Times (\"Trump Might Have a Case on Birthright Citizenship\"), we have received numerous critiques, some quite thoughtful (others less so), both in this and other venues.",
    "url": "https://reason.com/volokh/2025/02/18/birthright-citizenship/"
  },
  {
    "text": "A quarter of US shoppers have dumped favorite stores over political stances  —  A new poll also found that four in 10 Americans have shifted spending to align with moral views in recent months  —  Americans are changing their shopping habits and even dumping their favorite stores in a backlash … ",
    "url": "https://www.theguardian.com/us-news/2025/feb/18/shoppers-political-boycotts-spending-patterns-poll"
  },
  {
    "text": "Hamas says it will release bodies of four hostages, including Bibas children, on Thursday and six living hostages on Saturday  —  Hamas on Tuesday said that it will release the dead bodies of four Israeli hostages on Thursday, including the two youngest people held by the group, Kfir and Ariel Bibas.",
    "url": "https://www.cnn.com/2025/02/18/middleeast/hamas-israel-hostages-to-release-bibas-family-intl"
  },
  {
    "text": "After claiming remote workers are actually golfing, Trump again hits the links in Florida  —  Palm Beach, Florida CNN  —  As President Donald Trump orders federal workers to return to the office, he spent the fourth straight day at home here at his Mar-a-Lago resort.",
    "url": "https://www.cnn.com/2025/02/18/politics/mar-a-lago-trump-remote-work-golf/"
  },
  {
    "text": "C.I.A. Expands Secret Drone Flights Over Mexico  —  The covert program, begun during the Biden administration and stepped up by President Trump, is hunting for the location of fentanyl labs.  —  The United States has stepped up secret drone flights over Mexico to hunt for fentanyl labs … ",
    "url": "https://www.nytimes.com/2025/02/18/us/politics/cia-drone-flights-mexico.html"
  },
  {
    "text": "Musk Ally Demands Admin Access to System That Lets Government Text the Public  —  A worker resigned in protest rather than giving Thomas Shedd access to Notify.gov, which they said would allow him to see “all personally identifiable information moving through the Notiy system, including phone numbers,” 404 Media has learned.",
    "url": "https://www.404media.co/musk-ally-demands-admin-access-to-system-that-lets-government-text-the-public/"
  },
  {
    "text": "FAA Employees Say Trump and Musk's Purge Is a ‘Threat’ to Air Safety  —  After firing hundreds of Federal Aviation Administration employees, the Trump administration is now attempting to downplay safety concerns  —  Donald Trump and Elon Musk fired hundreds of Federal Aviation Administration … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-musk-faa-firings-purge-air-safety-1235271233/"
  },
  {
    "text": "Meta removes Facebook ad criticizing Musk  —  Meta removed an advertisement earlier this month criticizing Elon Musk's use of the Department of Government Efficiency (DOGE) to seize Americans' private information.  “A single individual now controls sensitive U.S. data, risking our national security.",
    "url": "https://www.muskwatch.com/p/meta-removes-facebook-ad-criticizing"
  },
  {
    "text": "Wokeness Is Not to Blame for Trump  —  How a misdiagnosis of the 2024 election has calcified into self-defeating conventional wisdom.  —  In the midst of chaos and cataclysm, it's rare to find agreement across partisan divides, but in the months since Donald Trump won his second presidential election … ",
    "url": "https://nymag.com/intelligencer/article/wokeness-is-not-to-blame-for-trump.html"
  },
  {
    "text": "Trump Administration Wants to Let Banks Jack Up Overdraft Fees  —  The administration's assault on the Consumer Financial Protection Bureau is turning into a direct attack on consumers  —  The Trump administration is looking to overturn a Biden-era rule limiting major banks' ability … ",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-admininstration-banks-raise-overdraft-fees-1235271368/"
  },
  {
    "text": "Judge calls prosecutors into court to explain reasons for abandoning Eric Adams case  —  Judge Dale Ho scheduled a hearing for Wednesday.  —  NEW YORK — The federal judge overseeing the criminal case against New York City Mayor Eric Adams ordered the mayor and federal prosecutors to appear … ",
    "url": "https://www.politico.com/news/2025/02/18/eric-adams-judge-orders-prosecutors-00204658"
  },
  {
    "text": "National Science Foundation Fires 168 Workers as Federal Purge Continues  —  Firings at the NSF included permanent employees who had already completed their one-year probationary period, as well as at-will workers.  —  The National Science Foundation fired nearly 170 workers in a Zoom call … ",
    "url": "https://www.wired.com/story/national-science-foundation-february-2025-firings/"
  },
  {
    "text": "Seven Myths Shattered by Trump 2.0 (and One True Thing)  —  THE PAST FEW WEEKS have been a master class in myth-busting, starting with the fantasy that the government should be run like a business and the corollary delusion that winning candidates don't follow through on their campaign agendas.",
    "url": "https://www.thebulwark.com/p/seven-myths-shattered-by-trump-musk-and-one-true-thing"
  },
  {
    "text": "Delta Plane Overturns at Toronto Airport While Landing  —  The airport said on social media that emergency teams were responding and that all passengers and crew were accounted for.  —  A Delta Air Lines flight arriving at Toronto Pearson Airport from Minneapolis appears to have overturned … ",
    "url": "https://www.nytimes.com/2025/02/17/world/canada/delta-toronto-plane-crash.html?unlocked_article_code=1.xk4.UE47.jx1FYaRcA_lv&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Placebo's Brian Molko Charged With Defamation for Calling Italian Prime Minister “Fascist, Racist”  —  Molko was sued in 2023 for his onstage remarks about Italy's hard-right government  —  In August 2023, Placebo's Brian Molko was sued by Italian prime minister Giorgia Meloni for calling her a … ",
    "url": "https://pitchfork.com/news/placebos-brian-molko-charged-with-defamation-for-calling-italian-prime-minister-fascist-racist/"
  },
  {
    "text": "How COVID Pushed a Generation of Young People to the Right  —  Research suggests that pandemics are more likely to reduce rather than build trust in scientific and political authorities.  —  For decades, America's young voters have been deeply—and famously—progressive.",
    "url": "https://www.theatlantic.com/ideas/archive/2025/02/covid-youth-conservative-shift/681705/?gift=o6MjJQpusU9ebnFuymVdsHrkCe1QULWZ3ae-yZ_tiEo&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Meet Kevin Hassett: Conservatism's Invincible Ignoramus  —  Programming note: Today on WTF 2.0 I'm going to be joined by 's Ed Condon to talk about Catholic Church inside baseball: What's happening with Catholic Charities and USAID and the Trump administration and JD Vance?",
    "url": "https://www.thebulwark.com/p/meet-kevin-hassett-conservatisms"
  }
]