[
  {
    "text": "Is Trump OK?  Unhinged reaction to rise of Harris worries supporters  —  Rambling speeches peppered with insults, narcissism and an obsession with crowd size have raised questions about the former president's fitness for office  —  Even some of Donald Trump's supporters are now asking … ",
    "url": "https://www.theguardian.com/us-news/article/2024/aug/24/donald-trump-mental-fitness-campaign"
  },
  {
    "text": "A Manufactured Fight over Incumbency Hides Trump's Fascism  —  Thinking of Trump in terms of presidential administrations — reading this race as a fight over incumbency — is a category error that serves to hide the threat Trump poses to democracy.  —  Yet a slew of reviews of the DNC … ",
    "url": "https://www.emptywheel.net/2024/08/24/a-manufactured-fight-over-incumbency-hides-trumps-fascism/"
  },
  {
    "text": "Trump's Carefully Scripted Week Kept Veering Off Script  —  Despite calls by his advisers to focus on the issues, former President Donald J. Trump has made it clear that he intends to keep running his campaign his way.  —  Donald J. Trump's political endurance this year has been attributed … ",
    "url": "https://www.nytimes.com/2024/08/24/us/politics/trump-campaign-2024.html?unlocked_article_code=1.FU4.F6Z6.d5lNA8CP3hx6&smid=url-share"
  },
  {
    "text": "GOP strategist cautions Trump on joining forces with RFK Jr: 'He's kind of a looney tune'  —  Video Player is loading.  —  Play Video  —  Unmute  —  Current Time 0:00  —  Loaded: 0%  —  Stream Type LIVE  —  Seek to live, currently behind liveLIVE  —  Playback Rate  —  Chapters",
    "url": "https://thehill.com/homenews/campaign/4845776-gop-strategist-scott-jennings-on-donald-trump-robert-f-kennedy-jr-joining-forces/"
  },
  {
    "text": "RFK Jr.'s out.  Does it change the race?  —  EXIT STAGE RIGHT — Some third-party presidential campaigns are noble endeavors driven by the loftiest of principles.  Others are vanity projects, exercises in cynicism that leave our politics slightly more soiled for the experience.",
    "url": "https://www.politico.com/newsletters/politico-nightly/2024/08/23/rfk-jr-s-out-does-it-change-the-race-00176256"
  },
  {
    "text": "We removed RFK Jr. from our model.  But it didn't hurt Kamala.  —  Harris's convention bounce has offset any impact — so far.  —  ∙ Paid  —  Like everything else about his presidential campaign, Robert F. Kennedy's withdrawal from the presidential race was weird.",
    "url": "https://www.natesilver.net/p/we-removed-rfk-jr-from-our-model"
  },
  {
    "text": "RFK Jr. Was My Drug Dealer  —  he leading third-party candidate for president—an environmental lawyer and activist, a son and nephew of legendary liberal Democratic politicians—just quit the race and announced that he is joining the campaign of the most anti-environment president … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/08/rfk-jr-endorse-trump-execute-drug-dealers/679597/?gift=_YJWRO9sT6lILBJDbj6IXBARrGSL_SiqmR7eWDgV4og"
  },
  {
    "text": "Democratic convention energy, Harris hot streak making Republicans nervous  —  Video Player is loading.  —  Play Video  —  Unmute  —  Current Time 0:00  —  Loaded: 0%  —  Stream Type LIVE  —  Seek to live, currently behind liveLIVE  —  Playback Rate  —  Chapters  — Chapters",
    "url": "https://thehill.com/homenews/campaign/4844833-republicans-nervous-harris-dnc-surge/"
  },
  {
    "text": "Foo Fighters Say Trump Didn't Have Permission to Use ‘My Hero’ at Arizona Rally  —  Band will take “appropriate action” as well as donate royalties from usage to Harris/Walz campaign",
    "url": "https://www.rollingstone.com/music/music-news/foo-fighters-trump-unauthorized-use-my-hero-arizona-rally-1235087493/"
  },
  {
    "text": "Fauci recovering after hospitalization for West Nile virus  —  Dr. Anthony Fauci, former director of the National Institute of Allergy and Infectious Diseases, is recovering at home after being hospitalized with West Nile virus, a spokesperson said.  —  Fauci, a longtime public health official … ",
    "url": "https://www.cnn.com/2024/08/24/health/fauci-west-nile-virus"
  },
  {
    "text": "For Tim Walz, a Pattern of Prevarications Stretches Back Almost Two Decades  —  When Tim Walz launched his 2006 campaign for Congress in rural Minnesota, he boasted in his public biography that in 1993, he “was named the Outstanding Young Nebraskan by the Nebraska Chamber of Commerce … ",
    "url": "https://freebeacon.com/democrats/for-tim-walz-a-pattern-of-prevarications-stretches-back-almost-two-decades/"
  },
  {
    "text": "Are Republicans losing the culture wars?  —  School board candidates who ran on parental rights in classrooms are suffering defeats in states like Florida, once a leader in the “anti-woke” movement.  —  Republicans are confronting a decisive moment in the battle over public education: proving they can still win a culture war.",
    "url": "https://www.politico.com/news/2024/08/24/republicans-culture-war-races-00176166"
  },
  {
    "text": "Two versions of masculinity are on the 2024 ballot … - But now rather than an aging President Biden, he's running against the potential first woman president.  — Vice President Kamala Harris rarely mentions her gender, but the men at her side have embraced their second-fiddle roles in supporting a woman's rise to power.",
    "url": "https://www.axios.com/2024/08/24/walz-trump-emhoff-masculinity-fatherhood"
  },
  {
    "text": "Kristi Noem rejects more than $70 million in federal funds  —  Governor Kristi Noem's administration recently turned down more than $70 million of federal funds from energy efficiency and environmental programs, according to her top budget official.  —  The Home Energy Rebates program … ",
    "url": "https://www.rawstory.com/kristi-noem-rejects-more-than-70-million-in-federal-funds/"
  },
  {
    "text": "Islamic State claims responsibility for knife attack in Germany's Solingen  —  The Islamic State group claimed responsibility on Saturday for a knife attack in the western German city of Solingen that killed three people on Friday.  —  The militant group said in a statement on its Telegram account … ",
    "url": "https://www.reuters.com/world/europe/islamic-state-claims-responsibility-knife-attack-germanys-solingen-2024-08-24/"
  }
]