[
  {
    "text": "Volkswagen workers in Tennessee pass historic vote to unionize  —  Victory marks the first win in the United Auto Workers campaign to organize the Southern factories of a dozen automakers  —  Volkswagen workers in Chattanooga, Tenn., passed a historic vote to join the United Auto Workers on Friday … ",
    "url": "https://www.washingtonpost.com/business/2024/04/19/vw-uaw-tennessee-vote/"
  },
  {
    "text": "UAW clinches watershed union victory at Volkswagen Tennessee factory  —  Workers at Volkswagen's (VOWG_p.DE) Tennessee plant have voted to join the United Auto Workers, in a seismic victory for the union as it drives beyond its Detroit base into the U.S. South and West.",
    "url": "https://www.reuters.com/business/autos-transportation/uaw-clinches-watershed-union-victory-volkswagen-tennessee-factory-2024-04-20/"
  },
  {
    "text": "House to vote on Ukraine, Israel aid bills  —  The House plans to vote Saturday on a $95 billion package of foreign aid bills that would provide funding for Ukraine, Israel and Taiwan, among other priorities.  The bills have moved forward despite a far-right threat to oust House Speaker Mike Johnson (R-La.) if he advances Ukraine aid.",
    "url": "https://www.washingtonpost.com/politics/2024/04/20/house-vote-ukraine-israel-aid-johnson/"
  },
  {
    "text": "NY AG asks Trump civil fraud judge to declare $175M bond ‘without effect’  —  The New York attorney general's office has asked a judge to void the $175 million bond former President Trump secured to put off paying the larger monetary damage award in his civil fraud case.",
    "url": "https://thehill.com/regulation/court-battles/4606053-ny-ag-trump-civil-fraud-judge-declare-175m-bond-without-effect/"
  },
  {
    "text": "New York AG says $175 million Trump fraud bond isn't properly backed, should be voided … Former President Donald Trump returns from a lunch break at Manhattan criminal court as jury selection continues in New York, NY on Thursday, April 18, 2024. … - CNBC Councils  — CNBC on Peacock",
    "url": "https://www.cnbc.com/2024/04/19/new-york-ag-says-175-million-trump-fraud-bond-isnt-properly-backed-should-be-voided.html"
  },
  {
    "text": "Man Sets Himself on Fire Near Courthouse Where Trump Is on Trial  —  Onlookers screamed as fire engulfed the man, who had thrown pamphlets in the air before he set himself aflame.  A police officer tried to extinguish the flames before the man was taken away in an ambulance.",
    "url": "https://www.nytimes.com/2024/04/19/nyregion/man-on-fire-trump.html"
  },
  {
    "text": "Twitter alternative Post News is shutting down … Post News, a Twitter alternative that emerged in the wake of Elon Musk's takeover, is shutting down.  Noam Bardin, the platform's founder and former CEO of Waze, writes that Post News “is not growing fast enough to become a real business or a significant platform.”",
    "url": "https://www.theverge.com/2024/4/19/24135011/twitter-alternative-post-news-shutdown"
  },
  {
    "text": "The Greatest Book a Politician Ever Wrote  —  The late Bob Graham's book is everything politics should be.  —  The bellhop at the Orlando hotel delivered a large red bag to the Cypress Penthouse, where he was met at the door by a woman in a green-and-white dress with a green-and-white “Shevin for Governor” sash around her neck.",
    "url": "https://www.politico.com/news/magazine/2024/04/20/bob-graham-political-book-00153402"
  },
  {
    "text": "Republicans Just Found a Loophole to Answer Their Abysmal Fundraising  —  AND THE LAW WON  —  Republicans finally had a good fundraising quarter.  But underneath the good headlines are some stark truths—and an FEC rule that could give Republicans a big boost.",
    "url": "https://www.thedailybeast.com/republicans-just-found-a-loophole-to-answer-their-abysmal-fundraising"
  },
  {
    "text": "Donald and Melania Trump to headline dueling fundraisers in North Carolina and Palm Beach  —  Rarely seen, Melania Trump is hosting Log Cabin Republicans at Mar-a-Lago.  —  Former President Donald Trump, right, stands with Melania Trump, left, as they arrive for a GOP fundraiser, on April 6, 2024, in Palm Beach, Fla.",
    "url": "https://abcnews.go.com/Politics/donald-melania-trump-headline-dueling-fundraisers-north-carolina/story?id=109431722"
  },
  {
    "text": "In Pa., Biden's challenge is highlighted by protests from both sides  —  Democrats are hopeful in the state, given recent wins.  But on Biden's recent Pennsylvania trip, he faced chants of ‘Genocide Joe’ and 'You're fired.'  —  As President Biden visited his childhood home in Scranton … ",
    "url": "https://www.washingtonpost.com/politics/2024/04/20/biden-protests-pennsylvania-election/"
  },
  {
    "text": "How R.F.K. Jr. Got on the Michigan Ballot, With Only Two Votes  —  The independent candidate persuaded a tiny party to give him its line on the ballot in a key 2024 battleground state, sparing him a costly, arduous organizing effort.  —  In January, when Doug Dern, the state chairman … ",
    "url": "https://www.nytimes.com/2024/04/20/us/politics/rfk-jr-michigan-ballot.html"
  },
  {
    "text": "Judge locks up ‘Three Percenter’ militia members in Jan. 6 obstruction case  —  The obstruction of an official proceeding charge is in jeopardy before the Supreme Court, meaning that some of the defendants could ultimately only serve a year in prison.  —  WASHINGTON — Three California men … ",
    "url": "https://www.nbcnews.com/politics/justice-department/judge-locks-three-percenter-militia-members-jan-6-obstruction-case-rcna148456"
  },
  {
    "text": "Trump's Trial and Campaign Collide as Historic Prosecution Begins  —  Former president and critics agree New York hush-money case is about more than his alleged crimes; ‘Democracy is on trial’  —  NEW YORK—As he walked into court for the first day of his first criminal prosecution … ",
    "url": "https://www.wsj.com/politics/elections/trumps-trial-and-campaign-collide-as-historic-prosecution-begins-b3877aec"
  },
  {
    "text": "Whiplash as Russia Toasts Derided Marjorie Taylor Greene as Their Top New Hero  —  FROM FOOL TO TOOL  —  Speaker Mike Johnson is no longer Russia's No.1 favorite, he's been replaced by a congresswoman who was once roundly mocked on Russian TV.  —  In recent years, clips from Tucker Carlson's shows … ",
    "url": "https://www.thedailybeast.com/whiplash-as-russia-toasts-derided-marjorie-taylor-greene-as-their-top-new-hero"
  }
]