[
  {
    "text": "U.S. Officials Concede They Don't Know Whereabouts of Iran's Uranium Stockpile  —  Rafael Mariano Grossi, the director of general of the International Atomic Energy Agency, said he believed Tehran's stockpile of near-bomb-grade nuclear material had been moved before the strikes.",
    "url": "https://www.nytimes.com/2025/06/22/us/politics/iran-uranium-stockpile-whereabouts.html"
  },
  {
    "text": "‘There Is No Intel’: Trump's Attacks on Iran Were Based on Vibes, Sources Say  —  Following Trump's attacks on Iran, an admin official tells Rolling Stone, “The intelligence assessments have not really changed” … Just months ago, Trump's Director of National Intelligence Tulsi Gabbard testified … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-iran-attack-no-intel-nuclear-1235369641/"
  },
  {
    "text": "What Satellite Images Reveal About the US Bombing of Iran's Nuclear Sites  —  The US concentrated its attack on Fordow, an enrichment plant built hundreds of feet underground.  Aerial photos give important clues about what damage the “bunker-buster” bombs may have caused.",
    "url": "https://www.wired.com/story/iran-fordow-nuclear-site-satellite-images-damage/"
  },
  {
    "text": "Oil futures surge following US strikes in Iran  —  Oil prices surged late Sunday in Wall Street's first reaction to the United States' strikes on three Iranian nuclear Saturday evening — a major escalation of the Iran-Israel conflict.  —  US oil futures jumped 3.6% to about $76.47 per barrel.",
    "url": "https://cnn.com/2025/06/22/business/oil-futures-stocks-iran"
  },
  {
    "text": "Early assessments raise questions over whether US destroyed bulk of enriched Iranian nuclear material  —  President Donald Trump declared that Iran's nuclear enrichment facilities were “completely and totally obliterated” following this weekend's air strikes, but the US appears to have held … ",
    "url": "https://cnn.com/2025/06/22/politics/iran-strike-analysis-raises-questions"
  },
  {
    "text": "No matter what Trump says, the US has gone to war - and there will be profound and lasting consequences  —  Trump has fallen slap bang into the trap laid for him by Netanyahu.  His reckless gamble makes a nuclear weapon for Iran more, not less, likely  —  Bombing will not make Iran go away.",
    "url": "https://www.theguardian.com/commentisfree/2025/jun/22/donald-trump-usa-iran-israel-war-bombing"
  },
  {
    "text": "A mad king's pointless war is where Donald Trump was always heading  —  “We will measure our success not only by the battles we win, but also by the wars that we end, and perhaps most importantly, the wars we never get into.”  — Donald Trump's second inaugural address, Jan. 20In a sense, you gotta hand it to Donald Trump.",
    "url": "https://www.inquirer.com/opinion/donald-trump-bombs-iran-20250622.html"
  },
  {
    "text": "Scoop: Trump launches MAGA PAC in effort to oust Rep. Massie from Congress  —  President Trump's political operation has launched an aggressive effort to unseat Kentucky Rep. Thomas Massie, its first such effort to defeat a sitting Republican incumbent, Axios has learned.",
    "url": "https://www.axios.com/2025/06/22/trump-massie-congress-2026"
  },
  {
    "text": "Trump's team launches group to unseat GOP Rep. Thomas Massie  —  Trump has heavily criticized Massie, of Kentucky, who has opposed his strikes on Iran and his “big, beautiful bill” in Congress.  —  Two key advisers to President Donald Trump are launching a group to unseat Rep. Thomas Massie … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-thomas-massie-criticism-us-strikes-iran-kentucky-maga-rcna214387"
  },
  {
    "text": "Senate parliamentarian rejects GOP's attempt to limit courts' contempt powers  —  The Senate parliamentarian has ruled against a controversial provision in the Senate Republicans' megabill that would have made it significantly more difficult for courts to enforce contempt findings against the Trump administration.",
    "url": "https://thehill.com/homenews/senate/5363225-senate-parliamentarian-rules-out-contempt-provision/"
  },
  {
    "text": "US urges China to dissuade Iran from closing Strait of Hormuz  —  U.S. Secretary of State Marco Rubio on Sunday called on China to encourage Iran to not shut down the Strait of Hormuz after Washington carried out strikes on Iranian nuclear sites.  —  Rubio's comments on Fox News' … ",
    "url": "https://www.reuters.com/world/china/us-urges-china-dissuade-iran-closing-strait-hormuz-2025-06-22/"
  },
  {
    "text": "Bill Clinton Endorses Andrew Cuomo for New York City Mayor  —  The former president's endorsement is the latest example of how establishment Democrats seem to prefer Mr. Cuomo to his prime rival, Zohran Mamdani.  —  Former President Bill Clinton will offer a last-minute boost of support … ",
    "url": "https://www.nytimes.com/2025/06/22/nyregion/bill-clinton-endorse-cuomo-mayor.html?unlocked_article_code=1.Q08.tGef.ms0hR8bCURNQ&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Republican's Life-Threatening Pregnancy Collided With Florida's Abortion Politics  —  Due in August with her first child, Rep. Kat Cammack says doctors last year hesitated to treat her ectopic pregnancy  —  Rep. Kat Cammack arrived at the emergency room in May 2024 terrified by what she had just learned … ",
    "url": "https://www.wsj.com/politics/policy/republicans-life-threatening-pregnancy-collided-with-floridas-abortion-politics-ad96f8d4"
  },
  {
    "text": "What Did Elon Musk Accomplish at DOGE?  —  Even before Musk fell out with Donald Trump, the agency's projected savings had plummeted.  But he nevertheless managed to inflict lasting damage to the federal government.  —  On March 27th, Sahil Lavingia walked into the Secretary of War Suite … ",
    "url": "https://www.newyorker.com/magazine/2025/06/23/what-did-elon-musk-accomplish-at-doge?currentPage=all"
  },
  {
    "text": "EXCLUSIVE: The Onion calls out ‘cowardice’ of Congress in full-page NYT ad  —  The ad features a scathing editorial, a physical copy of which was sent to all House and Senate members.  —  If you want to support The Handbasket's 100% independent journalism, become a paid subscriber or leave a tip.",
    "url": "https://www.thehandbasket.co/p/exclusive-the-onion-nyt-ad-congress-cowardice"
  },
  {
    "text": "Judge orders Kilmar Abrego Garcia's release from jail before trial, but ICE plans to detain him  —  A Tennessee judge on Sunday ordered the release of Kilmar Abrego Garcia, whose mistaken deportation has become a flashpoint in President Donald Trump's immigration crackdown, while he awaits a federal trial on human smuggling charges.",
    "url": "https://apnews.com/article/abrego-garcia-deportation-error-c0a515baffdf54baba412edf4cdbd310"
  },
  {
    "text": "Bees are collapsing in the U.S. A key to their secrets might vanish.  —  The top federal lab on native bees is set to close under President Trump's budget.  —  LAUREL, Maryland — Sam Droege, sporting worn hiking boots and blue jeans, walked through a lush field of tall grass and poison ivy … ",
    "url": "https://www.washingtonpost.com/climate-environment/2025/06/22/bee-disappear-pollinator-federal-lab/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzUwNTY0ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzUxOTQ3MTk5LCJpYXQiOjE3NTA1NjQ4MDAsImp0aSI6IjIwZTAxNmEwLThlNGQtNDIxOS1iYTY5LWRiYjNiNDNkMTM4ZiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9jbGltYXRlLWVudmlyb25tZW50LzIwMjUvMDYvMjIvYmVlLWRpc2FwcGVhci1wb2xsaW5hdG9yLWZlZGVyYWwtbGFiLyJ9.LntYuHdlIZzR_A8kzU2uksRc_vKIiFt0mb_pT6WUqVo&itid=gfta"
  }
]