[
  {
    "text": "Australia re-elects Anthony Albanese as Labor rides anti-Trump wave to seal crushing win  —  Opposition leader Peter Dutton fails to dissociate himself from Trump-like rhetoric and policies - and loses his seat  —  Australia's centre-left prime minister, Anthony Albanese … ",
    "url": "https://www.theguardian.com/australia-news/2025/may/03/australia-election-anthony-albanese-labor-party-peter-dutton"
  },
  {
    "text": "Australia opposition leader Dutton loses seat in shock vote defeat  —  Australia's opposition leader Peter Dutton said on Saturday he had lost his own parliamentary seat as he conceded his conservative Liberals had been defeated in national elections by the incumbent Labor Party.",
    "url": "https://www.reuters.com/world/asia-pacific/australia-state-broadcaster-abc-projects-opposition-leader-dutton-lose-seat-2025-05-03/"
  },
  {
    "text": "First Canada, Now Australia: The Trump Factor Boosts Another World Leader in an Election  —  Australian Prime Minister Anthony Albanese returned to power as voters sought stability  —  SYDNEY—Australian Prime Minister Anthony Albanese was returned to power in an election Saturday … ",
    "url": "https://www.wsj.com/world/first-canada-now-australia-the-trump-factor-boosts-another-world-leader-in-a-close-election-bef1c5a1?st=6yDFJK&reflink=mobilewebshare_permalink"
  },
  {
    "text": "Australia's center-left Labor Party retains power in vote seen as test of anti-Trump sentiment  —  Brisbane and Sydney, Australia CNN  —  Australia's Prime Minister Anthony Albanese has secured a second term in office in a disastrous night for his conservative rivals … ",
    "url": "https://cnn.com/2025/05/03/australia/australia-election-results-albanese-dutton-intl-hnk"
  },
  {
    "text": "Live Updates: Trump Administration Begins Pulling Back Money for the Arts  —  Where Things Stand  — National Endowment for the Arts: The endowment told arts organizations that it was withdrawing or canceling current grants just hours after President Trump proposed eliminating the agency in the next fiscal year.",
    "url": "https://www.nytimes.com/live/2025/05/03/us/trump-news-updates"
  },
  {
    "text": "White House posts AI image of Trump as pope  —  The White House on Saturday posted an AI-generated image of U.S. President Donald Trump depicted as the leader of the Catholic Church, a couple of days after he jokingly said “I'd like to be pope.”  —  The picture, which was first posted … ",
    "url": "https://www.politico.eu/article/white-house-post-ai-generated-picture-donald-trump-pope/"
  },
  {
    "text": "Inside Waltz's ouster: Before Signalgate, talks with Israel angered Trump  —  The fired national security adviser engaged in intense coordination with Israeli Prime Minister Benjamin Netanyahu about military options against Iran ahead of an Oval Office meeting between the Israeli leader and Trump, two people said.",
    "url": "https://www.washingtonpost.com/politics/2025/05/03/waltz-trump-israel/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ2MjQ0ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ3NjI3MTk5LCJpYXQiOjE3NDYyNDQ4MDAsImp0aSI6ImMzNzJhNDgyLTlhYjAtNGMzZS04N2M3LWFkYTQyYzYxZGM1NiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzA1LzAzL3dhbHR6LXRydW1wLWlzcmFlbC8ifQ.bWnAb6nqV9dU4waDOYJNMC1mMAT_ARkp-wQGqajQfEo&itid=gfta"
  },
  {
    "text": "Company Boasts Spending Up To $20 Million On Trump Crypto Coin To Buy Influence  —  The arrangement puts money in Trump's pocket in return for the opportunity to change policy — exactly the sort of pay-to-play scheme critics warned about.  —  WASHINGTON — An international trucking logistics firm … ",
    "url": "https://www.huffpost.com/entry/trump-coins-freight-influence_n_68153967e4b03d516aad99d3"
  },
  {
    "text": "More than 15,000 USDA employees take Trump's offer to resign  —  Their departures will affect how the department administers food safety and nutrition programs, conducts research and offers services to farmers.  —  At least 15,000 Agriculture Department employees have taken … ",
    "url": "https://www.politico.com/news/2025/05/03/more-than-15000-employees-resign-agriculture-department-trump-00324834"
  },
  {
    "text": "Harvard's President Alan Garber Talks About His Legal Fight With Trump  —  Alan Garber became a hero to liberals after Harvard resisted the federal government.  At the same time, he is trying to remake campus culture in ways the Trump administration might appreciate.",
    "url": "https://www.nytimes.com/2025/05/03/us/harvard-alan-garber-trump-administration.html"
  },
  {
    "text": "Voice of America staff can resume reporting next week, DOJ says  —  An email from the Justice Department said VOA staff can begin a “phased return” to the office and programming.  The broadcaster has been shut down since March.",
    "url": "https://www.washingtonpost.com/style/2025/05/03/voice-of-america-voa-return-usagm/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ2MjQ0ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ3NjI3MTk5LCJpYXQiOjE3NDYyNDQ4MDAsImp0aSI6IjYzNzdmYTMwLTc0ZTItNGNmMS04OGVkLWE2MzM4MTQ5MWJiZSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9zdHlsZS8yMDI1LzA1LzAzL3ZvaWNlLW9mLWFtZXJpY2Etdm9hLXJldHVybi11c2FnbS8ifQ.mfAXankRgVnZ8DSPDwRqQa4jSezqX5q2bqaNMSc4V_4&itid=gfta"
  },
  {
    "text": "Don't Look at Stock Markets.  Look at the Ports.  —  A drop in maritime traffic suggests that the worst is yet to come.  —  Stock markets plunged for days after President Donald Trump announced steep tariffs on imports from around the world.  The sell-off ebbed only when he suspended most … ",
    "url": "https://www.theatlantic.com/economy/archive/2025/05/trump-tariff-shipping-ports/682673/"
  },
  {
    "text": "Lawsuit Against Humanities Endowment Offers Details on DOGE  —  Three scholarly groups are challenging the recent cancellation of most grants by the National Endowment for the Humanities.  —  Three major scholarly groups have sued the National Endowment for the Humanities and Elon Musk's Department … ",
    "url": "https://www.nytimes.com/2025/05/02/arts/humanities-endowment-doge-grants.html"
  },
  {
    "text": "Airliners abort landings as Army helicopter makes ‘scenic’ loop around Pentagon  —  The incident occurred a week after the Army unit involved in the deadly Jan. 29 crash said it was resuming flights.  —  Two airliners abandoned landing attempts at Washington's Reagan National Airport … ",
    "url": "https://www.washingtonpost.com/transportation/2025/05/02/national-dca-airliners-helicopter-danger/"
  },
  {
    "text": "‘Do I Look Like I Care?’:  AOC Shreds Trump's Border Czar In Blunt Free Speech Reminder  —  The congresswoman slammed Tom Homan after he claimed she could be in “trouble” over her “know your rights” advice.  —  Rep. Alexandria Ocasio-Cortez (D-N.Y.) tore apart White House border czar Tom Homan … ",
    "url": "https://www.huffpost.com/entry/aoc-alexandria-ocasio-cortez-trump-tom-homan-immigration_n_68155361e4b08215e5f69edd"
  },
  {
    "text": "Trump Rages at Own Judge After Ruling Halting Deportations Under Wartime Act  —  DID IT TO YOURSELF  —  “Our Country, as we know it, is finished!” the president wrote after a court ruled he could not deport migrants without due process.  —  President Donald Trump had a meltdown Saturday … ",
    "url": "https://www.thedailybeast.com/trump-rages-at-own-judge-after-ruling-halting-deportations-under-wartime-act/"
  },
  {
    "text": "Budgets as Propaganda  —  If you are wonky enough to be reading this blog, you have probably heard the expression, “a budget is a moral document”.  Budgets are not just pages of numbers, they are also statements of values.  It is one of those insights, once learned, that seems indisputable and never to be forgotten.",
    "url": "https://donmoynihan.substack.com/p/budgets-as-propaganda"
  },
  {
    "text": "I Teach Computer Science, and That Is All  —  On Oct. 8, 2023, I was on the steps of Harvard's Widener Library, taking part in a vigil for the victims of Hamas's terrorist attack.  I'm an Israeli American tenured professor, and I felt it was my duty to stand up for Jewish and Israeli students.",
    "url": "https://www.nytimes.com/2025/05/02/opinion/work-school-classroom-politics-harvard.html?unlocked_article_code=1.EU8.39-w.pxGCfn3MzuuF&smid=nytcore-android-share"
  },
  {
    "text": "Car Prices Expected to Rise as Tariffs on Parts Kick In  —  Tariffs on imported parts will have a broad impact because all vehicles use components made abroad.  —  The United States imposed 25 percent tariffs on imported auto parts on Saturday that could sharply raise prices for new and used vehicles … ",
    "url": "https://www.nytimes.com/2025/05/03/business/trump-auto-parts-tariffs.html?unlocked_article_code=1.EU8.SeDp.iaVS7xI5PDdZ&smid=url-share"
  },
  {
    "text": "C.I.A. to Cut More Than 1,000 Positions Over Several Years  —  The agency plans, for now, to use attrition, including retirements and voluntary resignations, to reduce the size of the C.I.A. instead of more mass firings.  —  The C.I.A. plans to cut more than 1,000 staff positions through attrition … ",
    "url": "https://www.nytimes.com/2025/05/02/us/politics/trump-cia-cuts.html"
  },
  {
    "text": "How Trump Accidentally Sabotaged His Own Case Against Abrego Garcia  —  He has now said it right out in the open—not once but twice.  In two major interviews, President Donald Trump openly declared that he has the power to bring the wrongfully deported Kilmar Abrego Garcia back to the United States.",
    "url": "https://newrepublic.com/article/194815/trump-accidentally-sabotaged-case-abrego-garcia"
  }
]