[
  {
    "text": "Right-Wing Riots Erupt in Dublin After Stabbing Attack  —  Garda Commissioner Drew Harris blamed the unrest on a “lunatic, hooligan faction driven by far-right ideology,” following horrific stabbing of three children and a woman.  —  DUBLIN—Right-wing rioters turned a usually bustling district … ",
    "url": "https://www.thedailybeast.com/right-wing-riots-erupt-in-dublin-after-stabbing-attack"
  },
  {
    "text": "Heroic Immigrant Actually Stopped the Dublin Stabbing That Led to Far-Right Riot  —  Far right ‘hooligans’ whipped up outrage after reports the attacker in the shocking Dublin school stabbing was an immigrant.  It turns out, the man who stopped him was Brazilian.",
    "url": "https://www.thedailybeast.com/caio-benicio-heroic-brazilian-stopped-the-dublin-stabbing-that-led-to-far-right-riot"
  },
  {
    "text": "34 people arrested in Dublin as riots erupt over stabbing attack  —  Irish police arrested 34 people in Dublin on Thursday night after rioters stormed across the capitol city, torching cars and clashing with police in response to a stabbing attack near a school.",
    "url": "https://thehill.com/policy/international/4325577-34-people-arrested-in-dublin-as-riots-erupt-over-stabbing-attack/"
  },
  {
    "text": "Judge rejects attempt to enshrine abortion rights on Nevada ballot  —  A judge in Nevada rejected a proposed 2024 ballot initiative that sought to enshrine reproductive rights, including abortion, in the state's Constitution.  —  Siding with a newly established PAC — the Coalition for Parents … ",
    "url": "https://thehill.com/homenews/state-watch/4325295-judge-rejects-nevada-attempt-enshrine-abortion-ballot/"
  },
  {
    "text": "Voters See American Dream Slipping Out of Reach, WSJ/NORC Poll Shows  —  Fewer believe that anyone who works hard can get ahead  —  The American dream—the proposition that anyone who works hard can get ahead, regardless of their background—has slipped out of reach in the minds of many Americans.",
    "url": "https://www.wsj.com/us-news/american-dream-out-of-reach-poll-3b774892?mod=followamazon"
  },
  {
    "text": "Ex-Trump Staffer A.J. Delgado Now Says Her Boss, Jason Miller, Raped Her  —  Jason Miller has been dogged by allegations that he preyed on former fellow 2016 Trump campaign employee A.J. Delgado—and left her alone with their kid.  Now she says he raped her.",
    "url": "https://www.thedailybeast.com/ex-trump-staffer-aj-delgado-now-says-her-boss-jason-miller-raped-her"
  },
  {
    "text": "Growing Numbers of Chinese Migrants Are Crossing the Southern Border  —  More than 24,000 Chinese citizens have been apprehended crossing into the United States from Mexico in the past year.  That is more than in the preceding 10 years combined.  —  The surge of migrants entering … ",
    "url": "https://www.nytimes.com/2023/11/24/us/politics/china-migrants-us-border.html"
  },
  {
    "text": "Trump Lawyers Say New York Filing Is ‘Irrelevant’ to DC Gag Order Hearing  —  The back-and-forth concerns a filing submitted by prosecutors on Thanksgiving  —  JWPlayer  —  Donald Trump's lawyers on Friday filed a response to prosecutors' Thursday filing, arguing that any threats … ",
    "url": "https://themessenger.com/politics/trump-lawyers-say-new-york-filing-is-irrelevant-to-d-c-gag-order-hearing"
  },
  {
    "text": "Could Haley Really Beat Trump?  Big Donors Are Daring to Dream.  —  Powerful players in the business world have gravitated toward Nikki Haley, aware that she remains an underdog but beginning to believe she has a chance.  —  Late last month, Nikki Haley, the former U.S. ambassador to the United Nations … ",
    "url": "https://www.nytimes.com/2023/11/24/us/politics/nikki-haley-trump-2024.html"
  },
  {
    "text": "Annual net migration to UK hits 672,000 in year to June 2023  —  Annual net migration to the United Kingdom hit a record of 745,000 last year and has stayed at elevated levels since, data showed on Thursday, heaping pressure on Prime Minister Rishi Sunak to act to reduce it in the run up to an election.",
    "url": "https://www.reuters.com/world/uk/annual-net-migration-uk-hits-672000-year-june-2023-2023-11-23/"
  },
  {
    "text": "Israel-Hamas war live updates: 25 hostages released as cease-fire holds  — Thirteen Israeli hostages held captive in the Gaza Strip since the Hamas attack have been released as a pause in fighting that began this morning continues to hold.  Israel has also begun the process of releasing 39 Palestinian prisoners.",
    "url": "https://www.nbcnews.com/news/world/live-blog/israel-hamas-war-live-updates-rcna126500"
  },
  {
    "text": "Dutch Election Results Deliver a Turn to the Far Right  —  In an election result that sent shock waves across Europe, Geert Wilders, a longtime far-right provocateur, is closer than ever to becoming prime minister.  —  The Netherlands, long regarded as one of Europe's most socially liberal countries … ",
    "url": "https://www.nytimes.com/2023/11/23/world/europe/dutch-election-results-far-right-geert-wilders.html"
  },
  {
    "text": "Democratic cities brace for a nightmare winter housing migrants  —  “As the temperature starts to drop, it is crucial — now more than ever — that the federal government finish the job they started,” said a spokesperson for NYC Mayor Eric Adams.  —  Migrants in Chicago huddle on the floors … ",
    "url": "https://www.politico.com/news/2023/11/24/migrants-weather-democratic-citites-00128546"
  },
  {
    "text": "OpenAI researchers warned board of AI breakthrough ahead of CEO ouster, sources say  —  Ahead of OpenAI CEO Sam Altman's four days in exile, several staff researchers wrote a letter to the board of directors warning of a powerful artificial intelligence discovery that they said could threaten humanity … ",
    "url": "https://www.reuters.com/technology/sam-altmans-ouster-openai-was-precipitated-by-letter-board-about-ai-breakthrough-2023-11-22/"
  },
  {
    "text": "Statement from President Joe Biden on the Arrest of Néstor Isidro Pérez Salas (\"El Nini\")  —  On November 22, Mexican security forces captured Néstor Isidro Pérez Salas (\"El Nini\"), the notorious head of security for the Chapitos wing of the Sinaloa Cartel.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2023/11/23/statement-from-president-joe-biden-on-the-arrest-of-nestor-isidro-perez-salas-el-nini/"
  }
]