[
  {
    "text": "Live Updates: Stormy Daniels Is Expected to Testify in Trump's Trial  —  Ms. Daniels, who received $130,000 in hush money to keep silent about her story of having had sex with Donald J. Trump, is at the center of the case against him.  —  Here's the latest on the trial.",
    "url": "https://www.nytimes.com/live/2024/05/07/nyregion/trump-trial-hush-money-stormy-daniels"
  },
  {
    "text": "Trump trial live updates as Stormy Daniels testifies today  —  Stormy Daniels, the adult film star who received $130,000 in 2016 in exchange for her silence about an alleged sexual encounter with Donald Trump, has been called to the stand to testify in the former president's trial.",
    "url": "https://www.cbsnews.com/live-updates/trump-trial-testimony-bookkeeping-gag-order-contempt/"
  },
  {
    "text": "NY v Trump: Judge denies motion for mistrial amid Stormy Daniels testimony  —  Stormy Daniels has been testifying in Trump's criminal trial  —  Former President Trump's defense attorneys are moving for a mistrial amid the testimony of pornographic actress Stormy Daniels.",
    "url": "https://www.foxnews.com/politics/trump-defense-attorneys-motion-mistrial-amid-stormy-daniels-testimony"
  },
  {
    "text": "Judge Pushes Back Critical Filing Deadline in Trump Documents Case  —  Judge Aileen M. Cannon did not immediately set a new date, but the delay increases the chance that the trial will not happen before the November election.  —  Reversing one of her own decisions, the federal judge overseeing … ",
    "url": "https://www.nytimes.com/2024/05/06/us/politics/trump-classified-documents-trial-delay.html"
  },
  {
    "text": "Donald Trump to Attend Fundraiser on Day of Barron's Graduation  —  Donald Trump is scheduled to give the keynote address at the Minnesota Republican Party's annual Lincoln Reagan Dinner on May 17, the same day he requested off court to attend his son Barron Trump's graduation ceremony.",
    "url": "https://www.newsweek.com/donald-trump-attend-fundraiser-day-barrons-graduation-1897759"
  },
  {
    "text": "US concerns over Israel's Gaza policy led to weapons holdup  —  The munitions were ready to be shipped to Israel when the administration placed the hold.  —  The Biden administration is holding up shipments of two types of Boeing-made precision bombs to send a political message to Israel … ",
    "url": "https://www.politico.com/news/2024/05/07/us-concerns-over-israels-gaza-policy-led-to-weapons-holdup-00156528"
  },
  {
    "text": "Trump privately urged Greene to drop push to oust Speaker Johnson  —  Trump told Greene that the party needs to be unified, a source said.  —  Speaker of the House Rep. Mike Johnson and Rep. Marjorie Taylor Greene both seen leaving their meeting at the US Capitol, May 6, 2024.",
    "url": "https://abcnews.go.com/Politics/trump-privately-urges-greene-drop-push-oust-speaker/story?id=109990543"
  },
  {
    "text": "Judge Cannon's secret right-wing getaway: Why didn't we know about this?  —  Federal judge in Trump's documents trial didn't tell us about those right-wing conferences at a Montana resort  —  Let me ask you a question: How many all-expenses-paid vacations at luxury hunting and fishing lodges have you enjoyed over the last few years?",
    "url": "https://www.salon.com/2024/05/07/cannons-secret-right-wing-getaway-why-didnt-we-know-about-this/"
  },
  {
    "text": "Boy Scouts of America Gets New Name to Reflect Its Newest Members  —  REBRAND  —  This isn't the first time the organization has sought to change its moniker.  —  After more than 100 years, the Boy Scouts of America are getting a rebrand.  —  On Tuesday, the organization announced … ",
    "url": "https://www.thedailybeast.com/boy-scouts-of-america-gets-new-name-to-reflect-its-newest-members"
  },
  {
    "text": "Newly unsealed grand jury testimony from Trump's valet helps explain FBI's desire to search Mar-a-Lago  —  Donald Trump's valet told investigators before the FBI searched Mar-a-Lago in 2022 that he randomly chose boxes of documents to return to the National Archives and Trump himself directed … ",
    "url": "https://www.cnn.com/2024/05/07/politics/mar-a-lago-trump-nauta-classified-documents/"
  },
  {
    "text": "Hochul slammed for saying black kids in the Bronx don't know what the word ‘computer’ means  —  Bronx politicians ripped Gov. Kathy Hochul after she asserted that some black children in the borough don't know what the word “computer” means.  —  Hochul, speaking at an on-stage forum in California Monday … ",
    "url": "https://nypost.com/2024/05/06/us-news/hochul-says-black-kids-in-the-bronx-dont-know-what-the-word-computer-is/"
  },
  {
    "text": "Trump tries to privately mediate Johnson-Greene fight  —  The former president had a lengthy phone call with the Georgia firebrand over the weekend, telling her to stand down from her ouster threat, according to three Republicans familiar with the matter.",
    "url": "https://www.politico.com/live-updates/2024/05/07/congress/trump-tells-greene-to-stand-down-00156509"
  },
  {
    "text": "Trump on going to jail over gag order: 'I'll do that sacrifice'  —  The judge has threatened the former president with possible jail time, something Trump and his supporters think may bolster his campaign.  —  Donald Trump said he would rather risk imprisonment than comply with a gag order … ",
    "url": "https://www.politico.com/news/2024/05/06/trump-jail-time-gag-order-hush-money-trial-00156388"
  },
  {
    "text": "Israelis frustrated with U.S. handling of hostage talks … - The U.S. official said “this is an extremely difficult process with negotiations conducted through intermediaries in Doha and Cairo.”  — He added that the U.S. believes Israel has engaged in the talks in good faith … ",
    "url": "https://www.axios.com/2024/05/07/us-israel-hamas-hostage-ceasefire-talks"
  },
  {
    "text": "Abortion bans drive away up to half of young talent, new CNBC/Generation Lab youth survey finds … Young people are seen on the Emory University campus in Atlanta, Georgia on October 14, 2022.  —  The youngest generation of American workers is prepared to move away from states … ",
    "url": "https://www.cnbc.com/2024/05/07/abortion-bans-drive-away-up-to-half-of-young-talent-new-cnbc/generation-lab-youth-survey-finds.html"
  },
  {
    "text": "Biden to condemn current antisemitism in Holocaust remembrance amid college protests and Gaza war  —  President Joe Biden is set to issue a forceful condemnation of antisemitism during a Tuesday ceremony to remember victims of the Holocaust at a time when the Hamas attack on Israel and controversy … ",
    "url": "https://apnews.com/article/biden-gaza-israel-jewish-congress-f2f84c9e7c52345c35e5cb4c2d00a417"
  },
  {
    "text": "Report: Bernie Moreno closed down local roads to test drive $3.4M imported car  —  In 2015, Ohio Republican Senate candidate Bernie Moreno used taxpayer dollars to shut down local roads so he could take a joy ride in an Aston Martin car that he purchased for $2.3 million.",
    "url": "https://heartlandsignal.com/2024/05/06/report-bernie-moreno-closed-down-local-roads-to-test-drive-3-4m-imported-car/"
  },
  {
    "text": "GOP Pays the Price for Booting Kevin McCarthy  —  HOUSE BROKE  —  Kevin McCarthy couldn't keep his job, but he could raise gobs of cash.  With the House majority on the line, his successor is struggling to keep up.  —  Former Speaker of the House Kevin McCarthy (R-CA) failed at many things … ",
    "url": "https://www.thedailybeast.com/gop-pays-the-price-for-booting-kevin-mccarthy"
  },
  {
    "text": "Why is the simplest explanation of campus protests so hard to accept?  —  Young people were sympathetic to Palestinians even before the war began.  Why is that ignored?  —  Over the weekend, New York Police Chief of Patrol John Chell took to social media to offer thoughts on the college campus protests … ",
    "url": "https://www.washingtonpost.com/politics/2024/05/06/campus-protests-explanation-nypd/"
  },
  {
    "text": "TikTok Sues to Block U.S. Ban  —  Chinese-controlled app claims new federal law violates First Amendment and unlawfully singles out company for punishment  —  TikTok said it filed a federal lawsuit Tuesday challenging the constitutionality of a new law that requires a sale or ban … ",
    "url": "https://www.wsj.com/politics/policy/tiktok-sues-to-block-u-s-ban-6ec6e17f"
  },
  {
    "text": "How a drilling project and Israel-Hamas overshadow Biden's climate record for young voters  —  President Biden spent his Earth Day in a national forest this year with an explicit pitch to young people: a climate jobs corps intended to excite Gen Z the way John F. Kennedy's Peace Corps inspired their grandparents.",
    "url": "https://www.latimes.com/politics/story/2024-05-07/biden-climate-bill-young-voters"
  }
]