[
  {
    "text": "CSMS # 64724565 - UPDATED GUIDANCE - Reciprocal Tariff Exclusion for Specified Products; April 5, 2025 Effective Date  —  The purpose of this message is to provide further guidance on the additional duties due on imported merchandise which were imposed by Executive Order 14257, issued April 2 … ",
    "url": "https://content.govdelivery.com/bulletins/gd/USDHSCBP-3db9e55?wgt_ref=USDHSCBP_WIDGET_2"
  },
  {
    "text": "Trump exempts phones, computers, chips from new tariffs … Smartphones and computers will be exempted from President Donald Trump's reciprocal tariffs, according to new guidance from U.S. Customs and Border Protection.  —  The guidance comes after Trump earlier this month imposed 125% tariffs … ",
    "url": "https://www.cnbc.com/2025/04/12/trump-exempts-phones-computers-chips-tariffs-apple-dell.html"
  },
  {
    "text": "Apple, Nvidia Score Relief From US Tariffs With Exemptions  —  President Donald Trump's administration exempted smartphones, computers and other electronics from its so-called reciprocal tariffs, representing a major reprieve for global technology manufacturers including Apple Inc. and Nvidia Corp. even if it proves a temporary one.",
    "url": "https://www.bloomberg.com/news/articles/2025-04-12/trump-exempts-phones-computers-chips-from-reciprocal-tariffs?accessToken=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzb3VyY2UiOiJTdWJzY3JpYmVyR2lmdGVkQXJ0aWNsZSIsImlhdCI6MTc0NDQ2NDkyNCwiZXhwIjoxNzQ1MDY5NzI0LCJhcnRpY2xlSWQiOiJTVUxUU1VUMEFGQjQwMCIsImJjb25uZWN0SWQiOiI2RjBCMUFFQTQyOEI0RjhFQTVGQ0FDRUZCRjAzQjkzMCJ9.8zuBSNQRg3bMXIiiZxTSqO_Gy5nKuCb8ajtGSiBsh7o&leadSource=uverify%20wall"
  },
  {
    "text": "Trump Administration Live Updates: New Rule Exempts Smartphones and Computers From Most Tariffs  —  Where Things Stand  — Smartphone reprieve: The Trump administration published a rule late Friday night that appears to exempt many electronic parts and devices from most of the president's punishing tariffs … ",
    "url": "https://www.nytimes.com/live/2025/04/12/us/trump-administration-news?unlocked_article_code=1._E4.6ssB.n5XTc-HOMq-b&smid=url-share"
  },
  {
    "text": "Trump excludes smartphones from reciprocal tariffs  —  Tech including routers and selected computers get reprieve after a week of turbulence in US markets  —  The Trump administration has excluded smartphones from its steep “reciprocal” tariffs as it battles to calm global markets by tempering … ",
    "url": "https://www.ft.com/content/3eb48a07-7cb0-4a44-9159-eb5b402c2fec"
  },
  {
    "text": "Smartphones and computers are now spared from Trump's reciprocal tariffs  —  The Trump administration has amended its list of imports that will be affected by sweeping global tariffs in order to exempt certain electronics, including smartphones and computers.",
    "url": "https://www.npr.org/2025/04/12/nx-s1-5363025/apple-iphone-tariff-exemption-china"
  },
  {
    "text": "Team Trump Is Gaming Out How to Ship U.S. Citizens to El Salvador  —  Trump officials are talking internally about denaturalizing American citizens — and potentially sending some to El Salvador  —  Donald Trump and his White House have moved to deport green-card holders for espousing pro-Palestinian views … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-el-salvador-us-citizens-denaturalization-1235315975/"
  },
  {
    "text": "Trump administration overrode Social Security staff to list immigrants as dead  —  A senior executive who objected was marched out of his office and put on leave, while earlier warnings about the agency's deaths database were ignored.  —  Just now  —  Two days after the Social Security … ",
    "url": "https://www.washingtonpost.com/politics/2025/04/12/trump-immigrants-dead-social-security/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ0NDMwNDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ1ODEyNzk5LCJpYXQiOjE3NDQ0MzA0MDAsImp0aSI6ImRkOWI5MzkzLWFmMWUtNGQ5Zi04NzVkLWU5NWYwNDViMTIyZiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzA0LzEyL3RydW1wLWltbWlncmFudHMtZGVhZC1zb2NpYWwtc2VjdXJpdHkvIn0.hgTD0d-mBwWvUvRMgm_JeeYh4t2iZSGyg8tbs0wg8BU&itid=gfta"
  },
  {
    "text": "HHS officials did not know how many people have been fired  —  Department of Health and Human Services officials during a closed-door briefing could not give a full accounting of the number of people who have been fired from the agency, a Democratic aide for the House Energy and Commerce Committee said Friday.",
    "url": "https://thehill.com/policy/healthcare/5245999-hhs-officials-lack-clarity-sweeping-layoffs/"
  },
  {
    "text": "F.B.I. Suspends Bureau Employee on Patel's So-Called Enemies List  —  The employee was a longtime counterintelligence analyst who had worked on the F.B.I.'s investigation examining Russian meddling in the 2016 presidential election.  —  The F.B.I. has suspended an analyst on Kash Patel's … ",
    "url": "https://www.nytimes.com/2025/04/11/us/politics/fbi-suspends-employee-patel-enemies.html"
  },
  {
    "text": "“Slow Pay, Low Pay or No Pay”  —  Uncovered: How the Insurance Industry Denies Coverage to Patients  — Shortchanged: Blue Cross Louisiana OK'd mastectomies and breast reconstructions for women with cancer but refused to pay a hospital's full bills.  For some claims, it paid nothing.",
    "url": "https://www.propublica.org/article/blue-cross-blue-shield-louisiana-insurance-lawsuit-breast-cancer-doctors"
  },
  {
    "text": "Musk's Latest Fraud Finding Isn't What It Seems  —  His team found cases of seemingly fake people receiving unemployment benefits.  But that fake data exists for a reason.  —  Elon Musk and his Department of Government Efficiency announced this week that they had found something especially startling … ",
    "url": "https://www.nytimes.com/2025/04/12/upshot/musk-doge-fraud-claims.html?unlocked_article_code=1._E4.Zcxe.kxPDVObvHH55&smid=bs-share"
  },
  {
    "text": "‘Why are high fertility people always so weird?’:  A weekend with the pronatalists  —  CNN's Meena Duerson travels to Austin to join roughly 200 “pronatalists” for the second-ever Natal Conference, an event devoted to discussing the world's declining birth rates and potential solutions.",
    "url": "https://cnn.com/2025/04/11/us/video/natalism-conference-population-decline-natalcon-digvid"
  },
  {
    "text": "Trump Cuts Funds for Boston's Museum of African American History  —  When people ask me to take them to the most important historic site in Boston, I take them to the Museum of African American History (MAAH) on Beacon Hill.  The museum, located in Smith Court along Joy Street … ",
    "url": "https://kevinmlevin.substack.com/p/trump-cuts-funds-for-bostons-museum"
  },
  {
    "text": "Trump Wants to Be Impeached Again  —  It's already in the cards thanks to his ill-founded trade war, no matter how that war plays out.  —  This week the system worked.  Donald Trump blinked.  The unwinding is still just beginning.  It will be painful and tumultuous.",
    "url": "https://www.wsj.com/opinion/trump-wants-to-be-impeached-again-6f4ea931?st=pE1obU&reflink=article_copyURL_share"
  },
  {
    "text": "‘One million.’ The private goal driving Trump's push for mass deportations.  —  Immigration officers and analysts are increasingly skeptical the Trump administration can deport that many immigrants in a single year.  —  Just now  —  As the Trump administration aggressively pushes to deport … ",
    "url": "https://www.washingtonpost.com/immigration/2025/04/12/one-million-deportations-goal/"
  },
  {
    "text": "So You Want to Be a Dissident?  —  A practical guide to courage in Trump's age of fear.  —  Once upon a time—say, several weeks ago—Americans tended to think of dissidents as of another place, perhaps, and another time.  They were overseas heroes—names like Alexei Navalny and Jamal Khashoggi … ",
    "url": "https://www.newyorker.com/news/the-weekend-essay/so-you-want-to-be-a-dissident"
  },
  {
    "text": "Federal judge orders USDA to unfreeze funds to Maine  —  A federal judge ordered the Trump administration to unfreeze federal funding that was allocated to Maine from the U.S. Department of Agriculture — funds that had been withheld following President Trump's clash with Maine Gov. Janet Mills over the issue of transgender athletes.",
    "url": "https://www.npr.org/2025/04/12/nx-s1-5362976/maine-usda-unfreeze-janet-mills-trump"
  },
  {
    "text": "Whitmer Shows How Democrats Are Playing With Fire in Cozying Up to Trump  —  The Michigan governor's awkward Oval Office appearance reflected how several Democratic state leaders are cultivating cordial but politically risky relationships with the president.",
    "url": "https://www.nytimes.com/2025/04/12/us/politics/gretchen-whitmer-trump-democrats.html?unlocked_article_code=1._E4.ZKo8.mwpBvyOIe_dU&smid=url-share"
  },
  {
    "text": "USDA's $1B bird flu plan uses money intended for schools, food banks  —  The move tees up a major political fight over the Trump administration's priorities — and the small pot of money USDA has to spread around.  —  Agriculture Secretary Brooke Rollins' $1 billion plan for fighting bird flu … ",
    "url": "https://www.politico.com/news/2025/04/12/usdas-bird-flu-plan-uses-money-for-schools-food-banks-00287557"
  },
  {
    "text": "Forget tariffs — Beijing is already choking off US exports on the sly  —  China juices trade war with nontariff barriers targeting MAGA-friendly U.S. export sectors.  —  Beijing is showing the Trump administration that tariffs aren't the only weapon in a trade war.",
    "url": "https://www.politico.com/news/2025/04/12/china-trade-war-exports-00287123"
  },
  {
    "text": "‘Completely out of touch’: golf and dinners for ‘king’ Trump as economy melts down  —  Casual attitude as markets fall suggests man detached from anxieties of ordinary voters - and surrounded by yes men  —  After lighting a fuse under global financial markets, Donald Trump stepped back - all the way to a Florida golf course.",
    "url": "https://www.theguardian.com/us-news/2025/apr/12/trump-king-economy-golf"
  },
  {
    "text": "Judge relaxes ban on DOGE access to sensitive US Treasury information  —  A federal judge ruled at least one DOGE worker can have access if he goes through training and submits disclosures.  —  A New York judge has relaxed a ban she'd put on Elon Musk's Department of Government Efficiency preventing … ",
    "url": "https://www.politico.com/news/2025/04/12/doge-ban-treasury-department-information-00287642"
  },
  {
    "text": "US ‘demands control’ from Ukraine of key pipeline carrying Russian gas  —  Senior Kyiv economist describes latest postion of Trump administration in talks as ‘colonial-type’ bullying  —  The US has demanded control of a crucial pipeline in Ukraine used to send Russian gas to Europe … ",
    "url": "https://www.theguardian.com/world/2025/apr/12/us-demands-control-from-ukraine-of-key-pipeline-carrying-russian-gas"
  },
  {
    "text": "For some students who protested war in Gaza, fear and silence is a new campus reality  —  Last spring, Cornell University was home to a student encampment, where dozens slept in tents on the quad to protest Israel's war in Gaza.  The demonstration lasted more than two weeks.",
    "url": "https://www.npr.org/2025/04/11/nx-s1-5343940/college-students-say-trump-administrations-crackdown-on-activism-incites-fear"
  }
]