[
  {
    "text": "Donald Trump: ‘I Hate My Opponent’  —  He's ready to go personal in next month's debate against Harris.  Advisers are urging restraint.  —  DONALD TRUMP HAS NO PLANS TO HEED the advice of his aides and limit himself to policy contrasts when he debates Kamala Harris.  He wants to make it personal.",
    "url": "https://www.thebulwark.com/p/donald-trump-i-hate-my-opponent-harris-debate-prep"
  },
  {
    "text": "I worked in Trump's White House.  Here's why I'm voting for Kamala Harris.  —  There is only one choice this November, and that candidate is Vice President Kamala Harris.  —  I am a lifelong Republican who worked in the Trump White House, and the truth is that I'd rather be backing a candidate from my own party for president.",
    "url": "https://www.msnbc.com/opinion/msnbc-opinion/former-trump-white-house-staffer-olivia-troye-voting-kamala-harris-rcna167352"
  },
  {
    "text": "Democrats Use the Convention to Try to Define Trump as a Self-Interested Fraud  —  Speeches and videos seek to shrink Donald Trump in order to rise above him, as Kamala Harris and her allies work to minimize him and disengage from him.  —  How to attack former President Donald Trump?",
    "url": "https://www.nytimes.com/2024/08/21/us/politics/harris-attack-lines-trump.html"
  },
  {
    "text": "Harris builds 13-point lead over Trump with women: Poll  —  Vice President Harris boasts a 13-point lead over former President Trump among women voters in a new poll, a notable edge with a major voting bloc that could be critical for her ticket in November.  —  An Economist/YouGov poll taken … ",
    "url": "https://thehill.com/homenews/campaign/4840233-vice-president-harris-lead-women/"
  },
  {
    "text": "Trump speaks from behind bulletproof glass at first outdoor rally since his attempted assassination  —  At his first outdoor rally since last month's attempted assassination, Donald Trump spoke from behind bulletproof glass Wednesday in North Carolina at an event focused on national security.",
    "url": "https://apnews.com/article/trump-vance-north-carolina-60de08931c1a964e8e1fb21d3778d35e"
  },
  {
    "text": "Barack and Michelle Obama are done turning the other cheek — and Democrats couldn't be happier  —  Barack and Michelle Obama resurfaced, with a vengeance.  —  Doug Emhoff, the nation's second gentleman, turned on the goofy charm.  —  A number of rhetorical torches were passed.",
    "url": "https://www.latimes.com/california/story/2024-08-21/dnc-barack-michelle-obama-kamala-harris-doug-emhoff-night-two-democratic-convention"
  },
  {
    "text": "A DNC Trend Emerges: Republican Officials Backing Harris  —  SWITCHING SIDES  —  Trump's counterterrorism adviser Olivia Troye and former Georgia Lt. Gov. Geoff Duncan both urged Republicans to vote for Kamala Harris Wednesday night.  —  A day after Donald Trump's former White House press … ",
    "url": "https://www.thedailybeast.com/a-dnc-trend-emerges-republican-officials-backing-harris"
  },
  {
    "text": "Michelle Obama Absolutely Takes Apart Donald Trump  —  In 2007, a young biracial senator from Illinois named Barack Obama was trying to convince Black voters that he was one of them.  I traveled to South Carolina to see a set of speeches that would become a historic inflection point … ",
    "url": "https://www.nytimes.com/2024/08/20/opinion/michelle-obama-dnc-speech.html"
  },
  {
    "text": "Trump slams Obamas' DNC speeches for ‘getting personal’  —  “They're getting personal all night, these people,” Trump said, referring to Barack and Michelle Obama.  —  Former President Donald Trump responded Wednesday to the Obamas' heated criticism of him at the Democratic National Convention … ",
    "url": "https://www.politico.com/news/2024/08/21/trump-barack-michelle-obama-dnc-speech-00175433"
  },
  {
    "text": "Michelle Obama Is a Master of Politics Because She Hates Politics  —  The former first lady delivers an emotional barnstormer that reaches beyond ideology.  —  Pocket  —  When Barack Obama took the stage at the Democratic National Convention late on Tuesday, he immediately paid tribute … ",
    "url": "https://www.thenation.com/article/politics/michelle-obama-dnc-speech/"
  },
  {
    "text": "RFK Jr. plans to drop out of presidential race by end of week: Sources  —  Sources say Kennedy is leaning toward endorsing former President Trump.  —  Robert F. Kennedy Jr. speaks at the Bitcoin 2024 conference in Nashville, July 26, 2024.  —  Robert Kennedy Jr. is planning to drop … ",
    "url": "https://abcnews.go.com/US/rfk-jr-plans-drop-presidential-race-end-week/story?id=113028999"
  },
  {
    "text": "Jonathan Braun, Whose Sentence Was Commuted by Trump, Is Charged With Assault  —  Jonathan Braun, whose drug sentence was commuted by Donald Trump shortly before he left office, was charged on Long Island, the latest incident to raise questions of how clemency applications were vetted.",
    "url": "https://www.nytimes.com/2024/08/21/us/politics/jonathan-braun-assault.html"
  },
  {
    "text": "Threatening Revenge Against Nancy Pelosi Is a Bad Idea … The precise allocation of responsibility for persuading President Biden to step down as Democratic nominee remains somewhat contested, but Nancy Pelosi has come to be seen as the mastermind of the plot.",
    "url": "https://nymag.com/intelligencer/article/threatening-revenge-against-nancy-pelosi-is-a-bad-idea.html"
  },
  {
    "text": "Beyoncé Threatens Legal Action Over Trump's ‘Freedom’ Video  —  CEASE-AND-DESIST  —  It would be just the latest in a long line of lawsuits against Trump for illegally using artists' music to promote his candidacy.  —  Beyoncé is, predictably, not down with Donald Trump using the song … ",
    "url": "https://www.thedailybeast.com/beyonce-threatens-trump-with-cease-and-desist-over-use-of-freedom-song"
  },
  {
    "text": "FBI probes insect attack on Democratic breakfast in Chicago  —  CHICAGO − Chicago Police and the FBI are investigating if saboteurs placed bugs in a breakfast buffet prepared for delegates at the Democratic National Convention on Wednesday.  —  “Multiple unknown female offenders … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/08/21/maggots-chicago-democrats-hotel/74892695007/"
  },
  {
    "text": "DNC Crushes RNC's Ratings Again on Night No. 2 by 39 Percent  —  THANKS, OBAMA  —  Over 20.5 million people tuned in to watch the Democratic National Convention's second night, according to Nielsen.  —  The Democratic National Convention again surpassed its Republican counterpart … ",
    "url": "https://www.thedailybeast.com/dnc-crushes-rncs-ratings-again-on-night-no-2"
  },
  {
    "text": "U.S. Investigating Americans Who Worked With Russian State Television  —  The F.B.I. raided the homes of two prominent commentators on Russian state television channels as part of an effort to blunt attempts to influence November's election.  —  The Department of Justice has begun … ",
    "url": "https://www.nytimes.com/2024/08/21/technology/us-fbi-russia-election-disinformation.html?unlocked_article_code=1.Ek4.RFBV.l1VKhQQQPmUT&smid=nytcore-ios-share&referringSource=articleShare&sgrp=c-cb"
  },
  {
    "text": "Donald Trump Accused of Committing ‘Massive Crime’ With Reported Phone Call  —  Donald Trump has been accused of violating federal law by allegedly calling Israeli Prime Minister  —  to discuss the ceasefire deal the U.S. is helping negotiate between Israel and  —  .",
    "url": "https://www.newsweek.com/donald-trump-accused-crime-benjamin-netanyahu-call-ceasefire-hamas-1942248"
  },
  {
    "text": "Gus Walz wins over social media with emotion for father  —  An emotional Gus Walz was seen in the crowd at the DNC on Wednesday night, as his father formally accepted the nomination for vice president.  —  Walz, standing with his mother Gwen and sister Hope, had tears streaming down his face … ",
    "url": "https://thehill.com/homenews/campaign/4841002-gus-walz-dnc-emotion-tim-walz/"
  },
  {
    "text": "Vladimir Putin manipulated Donald Trump's ‘ego and insecurities’, book says  —  Former US national security adviser HR McMaster claims Russian president had a hold over Trump in new memoir  —  Vladimir Putin exploited Donald Trump's “ego and insecurities” to exert an almost mesmeric hold … ",
    "url": "https://www.theguardian.com/books/article/2024/aug/21/trump-putin-hr-mcmaster-memoir"
  },
  {
    "text": "Florida quietly removes LGBTQ+ travel info from state website  —  Key West, Fort Lauderdale, Wilton Manors and St. Petersburg are among several Florida cities that have long been top U.S. destinations for LGBTQ+ tourists.  So it came as a surprise this week when travelers learned … ",
    "url": "https://apnews.com/article/florida-lgbtq-tourism-desantis-c16c8ad8c057331a7f43d14c141c5d78"
  },
  {
    "text": "How Kamala intends to bring prices down  —  I don't want to alarm you, but the Labor Department today revised downward its monthly payroll numbers over the past year by about 818,000 jobs: Employers added roughly 174,000 jobs per month instead of the previously reported 242,000 — or about 28 percent fewer than thought.",
    "url": "https://robertreich.substack.com/p/how-kamala-intends-to-bring-prices"
  },
  {
    "text": "Trump Isn't Finished  —  The damage inflicted on the nation during Donald Trump's first term in office pales in comparison with what he will do if he is elected to a second term.  How can we know this?  The best evidence is Trump himself.  He has repeatedly demonstrated his willingness to tear the country apart.",
    "url": "https://www.nytimes.com/2024/08/21/opinion/trump-second-term-2025.html?unlocked_article_code=1.Ek4.MGLi.HFM1Ziql-h-t&smid=em-share"
  },
  {
    "text": "Why Can't Fact Checkers Handle Donald Trump?  —  Fact checkers' reviews of DNC speeches about Trump have routinely botched the facts — earning one correction so far and a community note on X  —  FACT CHECKING COLUMNS have been around for some time but gained new popularity with the rise … ",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-fact-checkers-dnc-1235084868/"
  },
  {
    "text": "What anxious parents of neurodivergent children can learn from Tim and Gwen Walz  —  The Walzes' words and their embrace of their son may seem utterly unremarkable.  But that's the point.  —  Minnesota Gov. Tim Walz's open acknowledgement that he and his wife used fertility treatments … ",
    "url": "https://www.msnbc.com/opinion/msnbc-opinion/tim-walz-children-gus-neurodivergent-rcna166748"
  },
  {
    "text": "Wes Moore dings Trump's ‘bone spurs’ and lack of military service at DNC  —  Gov. Wes Moore (D-MD) used his Wednesday night speech at the Democratic National Convention to highlight both his and Gov. Tim Walz's (D-MN) military service, and knock former president Donald Trump for his lack of it.",
    "url": "https://www.washingtonexaminer.com/news/campaigns/3130351/wes-moore-trump-bone-spurs-dnc-speech/"
  },
  {
    "text": "At M.I.T., Black and Latino Enrollment Drops Sharply After Affirmative Action Ban  —  Asian American students made up almost half of the 2028 class — the first admitted since the end of affirmative action.  —  The Massachusetts Institute of Technology's incoming class of 2028 saw … ",
    "url": "https://www.nytimes.com/2024/08/21/us/mit-black-latino-enrollment-affirmative-action.html?unlocked_article_code=1.Ek4.m5ZL.kgbqIDRY8h0U&smid=url-share"
  }
]