[
  {
    "text": "Bannon, Patel say Trump ‘dead serious’ about revenge on media: 'We're going to come after you'  —  Steve Bannon and Kash Patel claimed that former President Trump is “dead serious” about exacting revenge on his political enemies if he wins a second term as president, and they warned members … ",
    "url": "https://thehill.com/homenews/4344065-bannon-patel-trump-revenge-on-media/"
  },
  {
    "text": "Jack Smith wants to tell jury about Trump's earlier attempts to sow doubt about elections  —  The special counsel is seeking a judge's permission to introduce evidence that may help jurors assess Trump's intent in the weeks leading to Jan. 6.  —  Special counsel Jack Smith wants a Washington … ",
    "url": "https://www.politico.com/news/2023/12/05/jack-smith-trump-elections-jan-6-00130200"
  },
  {
    "text": "Biden tells donors he's 'not sure I'd be running' in 2024 if Trump wasn't in the race  —  President Joe Biden told Democratic donors Tuesday he wasn't confident he'd be seeking another term if his predecessor Donald Trump wasn't running for the White House, a notably candid assessment … ",
    "url": "https://www.cnn.com/2023/12/05/politics/biden-fundraising-sprint/"
  },
  {
    "text": "Trump Refuses to Tell Hannity He Will Not Abuse Power if Re-Elected  —  When asked a very simple question, Trump refused to rule out acting illegally and abusing his power.  —  Donald Trump, in a Fox News town hall Wednesday, did not rule out breaking the law if re-elected president.",
    "url": "https://www.thedailybeast.com/trump-refuses-to-tell-sean-hannity-that-he-will-not-abuse-power-if-re-elected"
  },
  {
    "text": "Senate confirms 425 military nominees after Sen. Tommy Tuberville drops his hold  —  Tuberville “has nothing to show for his 10 months of delay,” Senate Majority Leader Chuck Schumer said in a scathing speech after the nominees were confirmed.  Tuberville has retained his holds on roughly 11 other promotions.",
    "url": "https://www.nbcnews.com/politics/congress/sen-tommy-tuberville-drops-hold-hundreds-military-nominees-rcna128138"
  },
  {
    "text": "Tommy Tuberville announces end to blanket military holds  —  ‘We fought hard,’ he said after telling his Republican colleagues he was lifting his holds  —  Sen. Tommy Tuberville (R-Ala.) announced Tuesday that he would lift his blanket hold on military promotions, ending a nearly 10-month standoff … ",
    "url": "https://www.washingtonpost.com/politics/2023/12/05/tuberville-lifts-military-promotions-hold/"
  },
  {
    "text": "GOP Decision to Blur Jan. 6 Faces Has Democrats ‘Deeply Troubled’  —  'They don't get a chance to alter that footage for the American people to be the best judge,' Rep. Annie Kuster told The Messenger  —  JWPlayer  —  House Democrats excoriated House Speaker Mike Johnson's decision to blur … ",
    "url": "https://themessenger.com/politics/gop-decision-to-blur-jan-6-faces-has-democrats-deeply-troubled"
  },
  {
    "text": "Mike Johnson's Office Walks Back Reason For Blurring Insurrectionists' Faces  —  After saying faces were blurred in security footage to shield alleged Jan. 6 rioters from prosecution, a spokesperson confirmed the DOJ already has access to the unedited clips.",
    "url": "https://www.thedailybeast.com/mike-johnsons-office-walks-back-reason-for-blurring-insurrectionists-faces"
  },
  {
    "text": "Hamas raped men as well as women during October 7 attack: Investigators reveal how sex assault victims were tied up, stripped and mutilated as Israel launches its ‘biggest ever criminal investigation’  — Advocacy group said sexual violence was perpetrated against both sexes",
    "url": "https://www.dailymail.co.uk/news/article-12822271/Hamas-raped-men-women-October-7-attack-Investigators-reveal-sex-assault-victims.html"
  },
  {
    "text": "Top Democratic Donor, Reid Hoffman, Gives $250,000 to a Nikki Haley Super PAC  —  Mr. Hoffman, the co-founder of LinkedIn, has funded an array of anti-Trump candidates and causes.  —  When Jamie Dimon, the chief executive of JPMorgan Chase, urged Democratic donors last week to rally behind Nikki Haley … ",
    "url": "https://www.nytimes.com/2023/12/05/us/politics/nikki-haley-reid-hoffman-donation.html"
  },
  {
    "text": "Inside the Secret Meeting That Cleared the Way for Tom Suozzi's Return  —  Gov. Kathy Hochul had been toying with blocking the former congressman's nomination for the crucial special election to replace George Santos.  Then a phone call came.  —  With his successor, George Santos … ",
    "url": "https://www.nytimes.com/2023/12/05/nyregion/suozzi-santos-hochul-special-election.html"
  },
  {
    "text": "Marjorie Taylor Greene alleged a male Republican got physically aggressive with her  —  In a private meeting with House Speaker Mike Johnson last week, Rep. Marjorie Taylor Greene accused fellow Georgia Republican Rep. Richard McCormick of getting physically aggressive with her … ",
    "url": "https://www.cnn.com/2023/12/05/politics/marjorie-taylor-greene/"
  },
  {
    "text": "Giuliani's no-show prevents courtroom confrontation with Georgia election workers  —  Rudy Giuliani is facing money damages in the election workers' defamation lawsuit.  —  Ruby Freeman and Shaye Moss, two Georgia election workers who have been tormented by harassment and threats since 2020 … ",
    "url": "https://www.politico.com/news/2023/12/05/rudy-giuliani-georgia-defamation-hearing-00130156"
  },
  {
    "text": "Rep. Nancy Mace has lost three senior staff members in past week  —  Rep. Nancy Mace (R-SC) has lost three of her senior staffers in the past week, according to a source with direct knowledge of the matter.  —  Her three senior staffers include her former chief of staff Dan Hanlon … ",
    "url": "https://www.washingtonexaminer.com/news/house/rep-nancy-mace-senior-staff-members-week"
  },
  {
    "text": "Senate lawmakers careen toward failed vote on Ukraine  —  Billions in additional aid stuck as Republicans push border security, walk out of classified briefing  —  Senators began blaming each other Tuesday for the looming potential failure to provide additional aid to Ukraine as fragile negotiations … ",
    "url": "https://www.washingtonpost.com/politics/2023/12/05/senate-ukraine-immigration-defeat/"
  },
  {
    "text": "Liz Cheney says Nancy Pelosi didn't care about any of the bad things she said about Pelosi before she appointed Cheney to the Jan. 6 committee  — Liz Cheney said she had barely talked to then-Speaker Nancy Pelosi before a critical phone call.  — Pelosi, Cheney wrote in her new book … ",
    "url": "https://www.businessinsider.com/liz-cheney-nancy-pelosi-10-worst-things-list-january-6-2023-12"
  },
  {
    "text": "Riley Gaines hits back at ‘Squad’ Dem calling her testimony ‘transphobic’: You're a ‘misogynist’  —  Lee called a point of order, urging Gaines' remarks be struck from the record, but it was withdrawn  —  NCAA swimming legend and women's sports advocate Riley Gaines hit back against a … ",
    "url": "https://www.foxnews.com/politics/riley-gaines-hits-back-squad-dem-calling-her-testimony-transphobic-youre-misogynist"
  },
  {
    "text": "Al Gore calls social media algorithms ‘digital’ AR-15s  —  Former Vice President Al Gore took aim at social media algorithms on Tuesday, saying sites that are “dominated by algorithms” are the “digital equivalent of AR-15s.”  —  Gore, speaking at the the Bloomberg Green at COP28 event … ",
    "url": "https://thehill.com/policy/technology/4344366-al-gore-calls-social-media-algorithms-digital-ar-15s/"
  },
  {
    "text": "Statement from Congressman Patrick McHenry  —  WASHINGTON — Congressman Patrick McHenry (NC-10) released the following statement:",
    "url": "https://mchenry.house.gov/news/documentsingle.aspx?DocumentID=404652"
  },
  {
    "text": "Amid planned protests, Gov. Newsom won't hold public Capitol Christmas tree lighting ceremony  —  With multiple protests planned near the state Capitol, Gov. Gavin Newsom has decided to not hold the annual public Christmas tree lighting live and in person as originally planned on Tuesday.",
    "url": "https://www.kcra.com/article/california-capitol-christmas-tree-lighting-ceremony-virtual/46042922"
  }
]