[
  {
    "text": "Republicans say a late convention could keep Biden off some ballots.  It hasn't mattered before.  —  Technical conflicts between ballot deadlines and convention dates have been handled quietly in the past.  Some GOP officials are taking a different tack this year.",
    "url": "https://www.nbcnews.com/politics/2024-election/republicans-say-late-convention-keep-biden-ballots-hasnt-mattered-rcna147213"
  },
  {
    "text": "A Trump raising money off election lies?  Now we've seen everything.  —  A phone call on behalf of the overhauled Republican National Committee again turns false claims about 2020 into a sales pitch  —  Donald Trump managed to vacuum up hundreds of millions of dollars of donations as a lame-duck president.",
    "url": "https://www.washingtonpost.com/politics/2024/04/11/trump-election-fraud-fundraising/"
  },
  {
    "text": "Mike Johnson and Donald Trump will propose bill to prevent non-citizens from voting  —  WASHINGTON - House Speaker Mike Johnson will introduce a bill with former President Donald Trump at his Mar-a-Lago residence aimed at preventing non-citizens from voting.",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/04/11/mike-johnson-donald-trump-election-integrity-bill/73289385007/"
  },
  {
    "text": "Trump's Brain Is Not Okay  —  An expert's view of Trump's mental slide into dementia.  —  The Big Picture and Jay Kuo … When Duty to Warn began in 2017, our mission as mental health professionals was to warn the world that Trump was dangerously unfit and a malignant narcissist.",
    "url": "https://thinkbigpicture.substack.com/p/john-gartner-trump-cognitive-decline"
  },
  {
    "text": "Trump's Big Lie About Biden Implodes After MAGA Ally Admits Truth  —  Steve Bannon no doubt thought he was being deviously clever.  Speaking with The New York Times this week, he elaborated on a sophisticated plan that Donald Trump's allies have developed for boosting third-party candidates, so they siphon votes from President Biden.",
    "url": "https://newrepublic.com/article/180617/steve-bannon-trump-lies-biden-jill-stein"
  },
  {
    "text": "Leo rejects Senate subpoena from panel probing gifts to Supreme Court justices  —  The conservative judicial activist called the move ‘politically motivated,’ and the committee chair said Leo had left them ‘no other choice’ but to move forward with the compulsory process",
    "url": "https://www.washingtonpost.com/politics/2024/04/11/leonard-leo-subpoena-senate-supreme-court-gifts/"
  },
  {
    "text": "Leonard Leo says he's ‘not capitulating’ after Durbin subpoena  —  .  —  EXCLUSIVE — Federalist Society co-Chairman Leonard Leo said Thursday he is “not capitulating” after he announced Sen. Dick Durbin (D-IL) filed a subpoena against him.  —  “Today, I received an unlawful … ",
    "url": "https://www.washingtonexaminer.com/news/justice/2963325/leonard-leo-not-capitulating-durbin-subpoena/"
  },
  {
    "text": "Jeffries: Democrats won't help Johnson break FISA impasse  —  House Minority Leader Hakeem Jeffries (D-N.Y.) said Thursday that Democrats will not help GOP leaders with a procedural vote to advance legislation extending the government's surveillance powers.  —  Nineteen conservative Republicans … ",
    "url": "https://thehill.com/homenews/house/4588868-jeffries-johnson-fisa-impasse/"
  },
  {
    "text": "Biden administration expands background checks for gun sales … - Due to those loopholes, around 20,000 dealers currently operate without licenses and are thus not required to conduct background checks, per AP.  — President Biden said in a statement that the new rules will … ",
    "url": "https://www.axios.com/2024/04/11/biden-administration-gun-purchases-background-check"
  },
  {
    "text": "Harvard and Caltech Will Require Test Scores for Admission  —  The universities are the latest highly selective schools to end their policies that made submitting SAT or ACT scores optional.  —  Harvard will reinstate standardized testing as a requirement of admission, the university announced Thursday … ",
    "url": "https://www.nytimes.com/2024/04/11/us/harvard-test-scores-admissions.html"
  },
  {
    "text": "An Honest Assessment of Rural White Resentment Is Long Overdue … Something remarkable happened among rural whites between the 2016 and 2020 elections: According to the Pew Research Center's validated voter study, as the rest of the country moved away from Donald Trump … ",
    "url": "https://newrepublic.com/article/180570/trump-rural-white-resentment-honest-assessment"
  },
  {
    "text": "Republican state representative left a loaded handgun in Colorado Capitol bathroom  —  A Republican state representative left a loaded, semiautomatic handgun in a bathroom at the Colorado Capitol on Tuesday night, an incident that comes as Democrats are trying to ban firearm possession in the building — and the GOP is fighting them.",
    "url": "https://coloradosun.com/2024/04/11/colorado-capitol-gun-don-wilson/"
  },
  {
    "text": "Measles could once again become endemic in the US, the CDC warns  —  This year's measles cases are over 17x higher than cases seen in the first quarters of 2000 to 2023.  —  In 2000, after a decadeslong public health battle and a Herculean vaccination program, the US won a coveted status: measles elimination.",
    "url": "https://arstechnica.com/science/2024/04/measles-could-once-again-become-endemic-in-the-us-the-cdc-warns/"
  },
  {
    "text": "Trump attorney who became a crucial witness against him has departed legal team  —  Evan Corcoran, an attorney for Donald Trump who became a critical witness in the classified documents case against the former president, no longer represents him, CNN has learned.",
    "url": "https://www.cnn.com/2024/04/11/politics/evan-corcoran-trump-legal"
  },
  {
    "text": "Security Alert:  U.S. Embassy Jerusalem (April 11, 2024)  —  Location:  Israel, the West Bank, and Gaza  —  The U.S. Embassy in Jerusalem reminds U.S. citizens of the continued need for caution and increased personal security awareness as security incidents often … ",
    "url": "https://il.usembassy.gov/security-alert-u-s-embassy-jerusalem-april-11-2024/"
  },
  {
    "text": "Georgia's Lieutenant Governor to Face Inquiry for Role as Fake Trump Elector  —  Fani T. Willis, the district attorney of Fulton County, Ga., had been disqualified from pursuing the case against Lt. Gov. Burt Jones, but another prosecutor said he would now take it over.",
    "url": "https://www.nytimes.com/2024/04/11/us/burt-jones-trump-georgia.html"
  },
  {
    "text": "Trump campaign demands Biden debate him ‘much earlier’ and more often  —  The Trump campaign is asking for additional debates and for the showdowns to begin much earlier than initially scheduled  —  EXCLUSIVE: The Trump campaign is calling for additional 2024 presidential debates and for them to take place … ",
    "url": "https://www.foxnews.com/politics/trump-campaign-debates-biden-much-earlier-more-often"
  },
  {
    "text": "RFK Jr. Campaign Fires Staffer Who Said the Quiet Part Out Loud  —  RFK Jr.'s campaign has dismissed a staffer who said a Trump reelection was all right because her “number one priority” was defeating Biden … On Wednesday, the Kennedy camp quietly announced that Rita Palma had been removed from their roster.",
    "url": "https://www.rollingstone.com/politics/politics-news/rfk-fires-staffer-endorsed-trump-reelection-1235002839/"
  },
  {
    "text": "Facebook's AI failure wiped out Kansas Reflector links.  Even Facebook may not know what went wrong.  —  When Kansas Reflector tried to share Dave Kendall's opinion column about a climate change movie, Facebook responded with a cascade of failures.  Facebook apologized for blocking Kansas Reflector … ",
    "url": "https://kansasreflector.com/2024/04/11/facebooks-ai-failure-wiped-out-kansas-reflector-links-even-facebook-may-not-know-what-went-wrong/"
  },
  {
    "text": "Bill to make marrying your first cousin illegal in Tennessee passes but not without a fight  —  Two Republican lawmakers voted against making marriage between first cousins illegal in Tennessee.  —  NASHVILLE, Tenn. (WSMV) - The Tennessee House passed a bill on Thursday that would make it illegal … ",
    "url": "https://www.wsmv.com/2024/04/11/bill-make-marrying-your-first-cousin-illegal-tennessee-passes-not-without-fight/"
  },
  {
    "text": "Fired reporter to testify CBS News crossed ‘red line’ by taking her files  —  .  —  A longtime journalist laid off by CBS News this year will speak out about her firing for the first time on Thursday at a hearing in Congress and plans to criticize the network for taking files containing confidential source information.",
    "url": "https://www.washingtonexaminer.com/news/house/2962315/fired-reporter-to-testify-cbs-news-crossed-red-line-by-taking-her-files/"
  },
  {
    "text": "Many Patients Don't Survive End-Stage Poverty  —  He has an easy smile, blue eyes and a life-threatening bone infection in one arm.  Grateful for treatment, he jokes with the medical intern each morning.  A friend, a fellow doctor, is supervising the man's care.",
    "url": "https://www.nytimes.com/2024/04/11/opinion/doctor-safety-net-hospital.html"
  },
  {
    "text": "Former Star Wars actress criticizes double standard for her ‘absurd’ cancellation  —  .  —  Former Star Wars actress Gina Carano criticized the Walt Disney Company for firing her in a new interview, arguing the company had a double standard when she shared her political views.",
    "url": "https://www.washingtonexaminer.com/news/business/2962835/former-star-wars-actress-criticizes-double-standard-for-her-absurd-cancellation/"
  },
  {
    "text": "HPU Poll: N.C. Registered Voters Say Inflation and National Security Are Top Issues for D.C.  —  The latest High Point University Poll finds that a large majority of self-identified registered voters in North Carolina (76%) believe inflation is a very important issue for policymakers in Washington … ",
    "url": "https://www.highpoint.edu/blog/2024/04/hpu-poll-n-c-registered-voters-say-inflation-and-national-security-are-top-issues-for-d-c/"
  },
  {
    "text": "Maine Reps Ruled Out of Order for Blaming Mass Shooting on Abortion Bill  —  ‘EXTREMELY OFFENSIVE’  —  The House Democratic office called the comments “as asinine as they are reprehensible.”  —  A pair of Republican lawmakers in Maine were ruled out of order on Thursday after one of them tried … ",
    "url": "https://www.thedailybeast.com/maine-reps-ruled-out-of-order-for-blaming-lewiston-shooting-on-abortion-bill"
  },
  {
    "text": "O.J. Simpson, Football Star Whose Trial Riveted the Nation, Dies at 76  —  He ran to football fame and made fortunes in movies.  His trial for the murder of his former wife and her friend became an inflection point on race in America.  —  O.J. Simpson, who ran to fame on the football field … ",
    "url": "https://www.nytimes.com/2024/04/11/sports/oj-simpson-dead.html"
  },
  {
    "text": "Republican leaders go to the mat to protect judge shopping  —  When you've lost John Roberts ...  Besides the fact that Trump was able to stuff the federal courts with Federalist Society hard-line judges, conservatives have another tool at their disposal: rampant judge shopping.",
    "url": "https://www.publicnotice.co/p/judge-shopping-new-judicial-conference-policy"
  },
  {
    "text": "Florida can't ban teacher from asking students to use her preferred pronouns, judge rules  —  Katie Wood, a transgender algebra teacher, has long gone by ‘Ms Wood’ but the law required students to say ‘Teacher Wood’  —  Florida cannot prohibit a 10th-grade math teacher from asking her students … ",
    "url": "https://www.theguardian.com/us-news/2024/apr/11/florida-pronouns-teacher"
  }
]