[
  {
    "text": "Speaker Mike Johnson's appearance at Trump's felony trial marks a remarkable moment in US politics  —  U.S. House Speaker Mike Johnson assailed the U.S. judicial system on Tuesday, becoming the highest-ranking Republican to show up at court with Donald Trump and using his powerful position … ",
    "url": "https://apnews.com/article/donald-trump-speaker-mike-johnson-court-09aef3de395fa77843f2600f40da6ac3"
  },
  {
    "text": "Mike Johnson acts as proxy for ‘friend’ Trump as he bashes judge's daughter and ‘sham trial’ outside court  —  The Republican speaker's defense of Trump comes in the midst of Michael Cohen's testimony  —  Republican House Speaker Mike Johnson vocally defended former president Donald Trump outside … ",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/trump-mike-johnson-cohen-trial-b2544905.html"
  },
  {
    "text": "Biden Moves Forward on $1 Billion in New Arms for Israel  —  The administration notifies Congress of a large arms package after withholding shipment of bombs last week  —  The Biden administration notified Congress on Tuesday that it was moving forward with more than $1 billion in new weapons deals … ",
    "url": "https://www.wsj.com/politics/national-security/biden-moves-forward-on-1-billion-in-new-arms-for-israel-844b761c"
  },
  {
    "text": "DOJ: Boeing breached 2021 safety agreement that prevented charges for crashes … - “As we do so, we will engage with the Department with the utmost transparency, as we have throughout the entire term of the agreement, including in response to their questions following the Alaska Airlines 1282 accident,” the statement continued.",
    "url": "https://www.axios.com/2024/05/15/boeing-doj-737-max-breached-agreement"
  },
  {
    "text": "US says Boeing breached 2021 737 MAX criminal prosecution deal  —  The U.S. Justice Department said late on Tuesday that Boeing Co (BA.N) had breached its obligations in a 2021 agreement that shielded the planemaker from criminal prosecution over fatal 737 MAX crashes in 2018 and 2019 that killed 346 people.",
    "url": "https://www.reuters.com/business/aerospace-defense/us-says-boeing-breached-2021-deferred-prosecution-737-max-agreement-2024-05-14/"
  },
  {
    "text": "Trump blasts his trial judges.  Then his fans call for violence  —  When Donald Trump attacks the integrity of judges hearing cases against him, his followers often respond with posts urging that the jurists be beaten, tortured and killed.  —  On a recent Tuesday morning … ",
    "url": "https://www.reuters.com/investigates/special-report/usa-election-threats-courts/"
  },
  {
    "text": "Jan. 6 felony rioter Derrick Evans loses Republican House primary in West Virginia  —  GOP Rep. Carol Miller fended off a challenge from Evans, who was sentenced to three months in prison for his role in the Capitol attack.  —  WASHINGTON — Derrick Evans, a Jan. 6 rioter who admitted … ",
    "url": "https://www.nbcnews.com/politics/2024-election/derrick-evans-west-virginia-january-6-primary-election-rcna151980"
  },
  {
    "text": "Ben Carson calls for making divorce harder  —  Carson, who is often mentioned as a potential Trump VP, writes in his new book that the U.S. should end no-fault divorce laws.  —  Ben Carson, who is often named as a potential running mate for Donald Trump, is out with a new book in which he calls … ",
    "url": "https://www.nbcnews.com/politics/2024-election/ben-carson-making-no-fault-divorce-harder-rcna152069"
  },
  {
    "text": "Ukraine presses Biden to lift ban on using US weapons to strike Russia  —  Kyiv watched as Russians massed on the border, but they weren't allowed to use long-range missiles provided by Washington.  —  Ukrainian officials are making a new push to get the Biden administration to lift its ban … ",
    "url": "https://www.politico.com/news/2024/05/14/ukraine-weapons-russia-00157970"
  },
  {
    "text": "Eric Adams suggests migrants could fill NYC's lifeguard shortage — because 'they're excellent swimmers'  —  Mayor Eric Adams on Tuesday suggested migrants should be hired to fill the city's lifeguard shortage — because “they're excellent swimmers.”  —  Hizzoner dropped the comment … ",
    "url": "https://nypost.com/2024/05/14/us-news/mayor-eric-adams-suggests-migrants-could-fill-nycs-lifeguard-shortage-because-theyre-excellent-swimmers/"
  },
  {
    "text": "Sports Illustrated Hates You  —  Sports Illustrated went woke long ago, and the editor who made it happen has clearly said she was happy to jettison her audience.  —  “We didn't care.  We thought that the right reader would come along with us and the wrong ones we didn't want.”",
    "url": "https://hotair.com/david-strom/2024/05/14/sports-illustrated-hates-you-n3788374"
  },
  {
    "text": "Harvard Out of Occupied Palestine Ends Harvard Yard Encampment  —  Garber will encourage schools to reinstate protesters from involuntary leave  —  Harvard Out of Occupied Palestine announced early Tuesday morning that it would peacefully end the encampment in Harvard Yard … ",
    "url": "https://www.thecrimson.com/article/2024/5/14/harvard-encampment-ends/"
  },
  {
    "text": "Rudy Giuliani still hasn't been served his Arizona indictment  —  The former Trump attorney must appear before a judge on May 21 or he could be held in contempt.",
    "url": "https://www.washingtonpost.com/national-security/2024/05/14/rudy-giuliani-arizona-charges/"
  },
  {
    "text": "Top California Democrats come out against rent control ballot measure  —  State Sen. Toni Atkins and Assembly Appropriations Chair Buffy Wicks confirmed they're fighting the initiative.  —  A pair of top California Democrats and powerful unions are lining up against a ballot initiative … ",
    "url": "https://www.politico.com/news/2024/05/14/california-rent-control-ballot-measure-00157950"
  },
  {
    "text": "Teen gunman who ‘sprayed DC neighborhood with 26 rounds from an AR-15’ is released on bail by self-confessed ‘woke’ judge  — Judge Lloyd Nolan Jr. sparked backlash after freeing Amonte Moody, 18  — Moody is accused of spraying a sleepy neighborhood with bullets from an AR-15",
    "url": "https://www.dailymail.co.uk/news/article-13413621/teen-gunman-washington-dc-ar-15-bail-soros-judge-nolan.html"
  },
  {
    "text": "The Ivy League Hypocrites Who Want to Be Trump's MAGA VP  —  POISON IVY LEAGUE  —  In the race to be Trump's sidekick, ambitious Republicans are distancing themselves from the uber-elite universities they attended. … “I love the poorly educated,” then-candidate Donald Trump declared … ",
    "url": "https://www.thedailybeast.com/the-ivy-league-hypocrites-who-want-to-be-trumps-maga-vp"
  },
  {
    "text": "Mike Pence Sought Public Funds as 2024 Presidential Bid Collapsed  —  The former vice president found little traction in his campaign and still had more than $1.3 million in unpaid bills at the end of March.  —  Former Vice President Mike Pence sought public financing for his failed … ",
    "url": "https://www.nytimes.com/2024/05/14/us/politics/mike-pence-public-funds.html"
  },
  {
    "text": "Laura Ingraham Scolded for Using Binoculars at Trump Trial  —  I SPY  —  The Fox star, who appeared to spend much of the afternoon tapping away at her opening monologue, was repeatedly reprimanded for having her phone and a pair of binoculars out.  —  Never let it be said that Laura Ingraham isn't prepared.",
    "url": "https://www.thedailybeast.com/laura-ingraham-scolded-for-using-binoculars-at-trump-trial"
  },
  {
    "text": "Trump's Boeing 757 clipped parked plane after landing at Florida airport Sunday, FAA says … The wing of the Boeing jet owned by former President Donald Trump struck a parked plane at a Florida airport after landing safely and taxiing early Sunday morning, the Federal Aviation Administration said on Tuesday.",
    "url": "https://www.cnbc.com/2024/05/14/trump-jet-clipped-parked-plane-after-landing-at-florida-airport-faa-says-.html"
  },
  {
    "text": "DC mayor ripped for private jet flight to golf tournament while crime persists, approval ratings nosedive  —  Washington, D.C. Mayor Muriel Bowser flew in a donor's private plane to Augusta, Georgia, on April 13  —  Democrat Washington, D.C. Mayor Muriel Bowser has faced the ire of critics … ",
    "url": "https://www.foxnews.com/politics/dc-mayor-ripped-private-jet-flight-masters-approval-rating-hits-free-fall-crime-issues-persist"
  },
  {
    "text": "Anti-abortion activist who led a clinic blockade is sentenced to nearly 5 years in prison  —  An anti-abortion activist who led others on an invasion and blockade of a reproductive health clinic in the nation's capital was sentenced on Tuesday to nearly five years in prison.",
    "url": "https://apnews.com/article/lauren-handy-abortion-clinic-blockade-ab461332b6c83d1c4d7f4d6175d04fbc"
  },
  {
    "text": "Former Diversity Program Manager at Facebook and Nike Sentenced to Federal Prison for $5 Million Fraud  —  For Immediate Release  —  U.S. Attorney's Office, Northern District of Georgia  —  ATLANTA - Barbara Furlow-Smiles, a former diversity program manager at Facebook and Nike … ",
    "url": "https://www.justice.gov/usao-ndga/pr/former-diversity-program-manager-facebook-and-nike-sentenced-federal-prison-5-million"
  },
  {
    "text": "Do Americans Remember the Actual Trump Presidency?  —  One of the remarkable things about the 2024 presidential election is that for the first time since 1912 voters will have a choice between presidents who served back-to-back in the immediately preceding eight years.",
    "url": "https://nymag.com/intelligencer/article/do-americans-remember-the-actual-trump-presidency.html"
  }
]