[
  {
    "text": "Trump Is Removing I.R.S. Chief 2 Months After He Was Confirmed  —  Billy Long, a former Republican congressman, will no longer serve as the tax agency's head.  Treasury Secretary Scott Bessent will oversee the agency as acting commissioner.  —  Billy Long, the former auctioneer … ",
    "url": "https://www.nytimes.com/2025/08/08/us/politics/trump-billy-long-irs-commissioner.html?unlocked_article_code=1.ck8.z44y.Gr0LF8rc5uU0&smid=url-share"
  },
  {
    "text": "Putin Tells U.S. He'll Halt War in Exchange for Eastern Ukraine  —  The proposal prompted the Trump administration to begin preparing for a summit with the Russian leader, but European officials expressed skepticism over its viability  —  Russian President Vladimir Putin presented … ",
    "url": "https://www.wsj.com/world/putin-russia-ukraine-ceasefire-proposal-0021453b?st=f9qBWc&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Trump, Putin meeting set for next week in Alaska  —  Trump said Friday a deal between Russia and Ukraine would include “some swapping of territories to the betterment of both” countries.  —  President Donald Trump said he and Russian President Vladimir Putin will meet next week in the United States … ",
    "url": "https://www.washingtonpost.com/politics/2025/08/08/trump-putin-ukraine-meeting/"
  },
  {
    "text": "Judge blocks Beto O'Rourke from financially supporting Texas Democrats who left the state  —  The order came at the request of Attorney General Ken Paxton, who O'Rourke accused in a separate lawsuit of going on a “fishing expedition, constitutional rights be damned.”",
    "url": "https://www.texastribune.org/2025/08/08/beto-orourke-texas-democrats-ken-paxton-fundraising-quorum-break/"
  },
  {
    "text": "Trump administration seeking $1 billion settlement from UCLA  —  The Trump administration is seeking a $1 billion settlement from the University of California, Los Angeles, CNN has exclusively learned, marking the latest effort by the White House to shape higher education and extract significant concessions from universities.",
    "url": "https://cnn.com/2025/08/08/politics/ucla-trump-administration-settlement"
  },
  {
    "text": "Trump Administration Threatens to Take Over Harvard's Patents  —  Move is latest escalation in White House's battle with Ivy League school  —  The Trump administration is warning Harvard University that it could take over its patents, worth hundreds of millions of dollars … ",
    "url": "https://www.wsj.com/us-news/education/harvard-patents-trump-d4297409?st=pDue15&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Trump Administration Threatens to Seize Valuable Harvard Patents  —  Takeaways by Bloomberg AI  —  Hide … Tell us how AI is shaping your news experience.  Share your feedback  —  The Trump administration threatened to assume ownership of hundreds of millions of dollars worth of patents … ",
    "url": "https://www.bloomberg.com/news/articles/2025-08-08/trump-administration-threatens-to-seize-valuable-harvard-patents"
  },
  {
    "text": "Suspect and Officer Are Dead After Shooting Outside C.D.C. in Atlanta  —  The gunman fired at the headquarters of the Centers for Disease Control and Prevention because he blamed the Covid vaccine for his maladies, an official said.  —  A gunman who believed the coronavirus vaccine was to blame … ",
    "url": "https://www.nytimes.com/2025/08/08/us/emory-university-cdc-shooting.html"
  },
  {
    "text": "Officer injured responding to active shooter at Emory University, near CDC headquarters in Atlanta  —  (NEXSTAR) - A police officer was injured responding to an active shooter at Emory University in Atlanta Friday.  —  The university alerted students to “RUN, HIDE, FIGHT” … ",
    "url": "https://thehill.com/homenews/state-watch/5444051-active-shooter-reported-at-emory-university-in-atlanta-school-says/"
  },
  {
    "text": "Supreme Court approval rating sinks to a new low, poll finds.  What caused shift?  —  The U.S. Supreme Court's approval rating has sunk to an all-time low, dropping below 40% for the first time ever, according to a new Gallup poll.  —  The decline was driven by record-low shares of Democrats … ",
    "url": "https://www.miamiherald.com/news/nation-world/national/article311637428.html?link_source=ta_bluesky_link&taid=6896a4a3f074e90001079230"
  },
  {
    "text": "William H. Webster, Who Ran Both the F.B.I. and the C.I.A., Dies at 101  —  A former federal judge, he first came to the F.B.I. just as two of the worst spies in American history were running rampant.  —  William H. Webster, the only person ever to lead both the Federal Bureau of Investigation … ",
    "url": "https://www.nytimes.com/2025/08/08/us/william-h-webster-dead.html?unlocked_article_code=1.ck8.0Vo4.yVuaXjkgXXtF&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Justice Dept. Abruptly Escalates Pressure Campaign on a Trump Adversary  —  Letitia James, New York's attorney general and a longtime nemesis of the president, is being investigated in two separate inquiries, in a remarkable use of executive power to pursue a foe.  —  Glenn Thrush and Santul Nerkar",
    "url": "https://www.nytimes.com/2025/08/08/nyregion/letitia-james-subpoena-trump-doj.html?unlocked_article_code=1.ck8.D31J.Mhe8N2Ecw9Hc&smid=url-share"
  },
  {
    "text": "Acting NASA Administrator Reflects on Legacy of Astronaut Jim Lovell  —  The following is a statement from acting NASA Administrator Sean Duffy on the passing of famed Apollo astronaut Jim Lovell.  He passed away Aug. 7, in Lake Forest, Illinois.  He was 97 years old.",
    "url": "https://www.nasa.gov/news-release/acting-nasa-administrator-reflects-on-legacy-of-astronaut-jim-lovell/"
  },
  {
    "text": "Cartels may be able to target witnesses after major court hack … At least a dozen district courts across several U.S. states are believed to have been directly impacted by the ongoing compromise of the digital case filing system, known as CM/ECF, according to the first two people.",
    "url": "https://www.politico.com/news/2025/08/08/federal-court-hack-cartels-00500391"
  },
  {
    "text": "DHS is delaying millions in already approved North Carolina recovery funds, documents show  —  Communities across the region still need to be reimbursed for about a hundred projects including debris removal, waste water treatment repairs, roads and bridges, damaged buildings and parks, as well as for emergency protective measures.",
    "url": "https://www.washingtonpost.com/climate-environment/2025/08/08/dhs-fema-north-carolina-helene-recovery-funds/"
  },
  {
    "text": "Man caught on video attacking pro-life protesters gets slap on wrist by judge  —  Patrick Brice gets home detention after assault left 73-year-old victim with permanent eye damage, report says  —  A 28-year-old man who was caught on video attacking two pro-life activists outside … ",
    "url": "https://www.foxnews.com/us/man-caught-video-attacking-pro-life-protesters-gets-slap-wrist-judge"
  },
  {
    "text": "Dreamers Face ‘Greatest Threat’ Yet in Trump Immigrant Crackdown  —  A PERSON'S LEGAL AUTHORIZATION TO WORK in the United States isn't worth the paper it's printed on—literally.  That's the upshot of actions taken by border patrol agents this week.  —  This past Sunday, Catalina … ",
    "url": "https://www.thebulwark.com/p/dreamers-face-greatest-threat-yet-arrests-deportations"
  },
  {
    "text": "US appeals court blocks Trump contempt proceedings ordered by Boasberg  —  The 2-1 ruling in President Donald Trump's favor will likely go to the full court for review, or be appealed directly to the Supreme Court  —  The U.S. Court of Appeals for the D.C. Circuit ruled 2-1 Friday … ",
    "url": "https://www.foxnews.com/politics/us-appeals-court-blocks-boasberg-contempt-proceedings-against-trump-admin"
  },
  {
    "text": "The Race to Find a Measles Treatment as Infections Surge  —  Vaccine was so effective the disease was considered eliminated in the U.S., but resurgence of outbreaks spurs need for drugs  —  As a record number of people in the U.S. are sickened with measles, researchers are resurrecting … ",
    "url": "https://www.wsj.com/health/healthcare/measles-treatment-vaccine-infection-numbers-c8327637?st=U4LzFx&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Trump Just Shrugs as Kennedy Undermines His Vaccine Legacy  —  President Trump's laissez-faire approach is notable, given that the development of the Covid vaccine was seen as one of his first term's most notable achievements.  —  During the early days of the coronavirus pandemic in the spring of 2020 … ",
    "url": "https://www.nytimes.com/2025/08/08/us/politics/trump-kennedy-vaccines.html?unlocked_article_code=1.c08.P4k_.V0HI4L5cjLDb&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "James A. Lovell Jr., Commander of Apollo 13, Is Dead at 97 … James A. Lovell Jr., right, and Fred W. Haise Jr., two of the three Apollo 13 crew members, appeared at a news conference in Cape Kennedy, Fla., before their ill-fated journey to the moon.Associated Press",
    "url": "https://www.nytimes.com/2025/08/08/science/space/james-a-lovell-jr-dead.html"
  },
  {
    "text": "Trump Weighs Reclassifying Marijuana as Less Dangerous Drug  —  The president told donors earlier this month he was interested in reclassifying the drug  —  President Trump is considering reclassifying marijuana as a less dangerous drug, according to people familiar with the matter … ",
    "url": "https://www.wsj.com/politics/policy/trump-marijuana-federal-drug-classification-01a73b8c"
  },
  {
    "text": "Appeals court denies Trump bid to make federal government defendant in E. Jean Carroll case  —  A federal appeals court on Friday rejected President Donald Trump's attempt to make the United States government the defendant in writer E. Jean Carroll's successful defamation lawsuit against him … ",
    "url": "https://www.washingtonexaminer.com/news/justice/3495463/appeals-court-denies-trump-bid-federal-government-defendant-e-jean-carroll-case/"
  },
  {
    "text": "Gerrymandering by Both Parties Is Deepening America's Political Divide  —  Less than 20% of Americans live in a state where the minority party has a meaningful voice in governance.  —  America's identity as a unified nation is eroding, with Republican- and Democratic-led states dividing … ",
    "url": "https://www.wsj.com/politics/us-gerrymandering-political-divide-a2a83a28"
  }
]