[
  {
    "text": "Read the JD Vance Dossier  —  We publish what others won't.  Subscribe to support our work and for updates on this breaking story.  —  Behold the dossier.  —  It reportedly comes from an alleged Iranian government hack of the Trump campaign, and since June, the news media has been sitting on it … ",
    "url": "https://www.kenklippenstein.com/p/read-the-jd-vance-dossier"
  },
  {
    "text": "X blocks links to hacked JD Vance dossier … X is preventing users from posting links to a newsletter containing a hacked document that's alleged to be the Trump campaign's research into vice presidential candidate JD Vance.  The journalist who wrote the newsletter, Ken Klippenstein, has been suspended from the platform.",
    "url": "https://www.theverge.com/2024/9/26/24255298/elon-musk-x-blocks-jd-vance-dossier"
  },
  {
    "text": "Iranians indicted in connection with Trump campaign hack  —  The federal charges stem from an Iranian operation that allegedly stole internal Trump campaign communications this summer.  —  A grand jury has indicted multiple Iranians on charges related to hacking Donald Trump's 2024 presidential campaign.",
    "url": "https://www.politico.com/news/2024/09/26/trump-campaign-hack-iran-indictment-00181321"
  },
  {
    "text": "Fox News suddenly changes its tune after Eric Adams indictment unsealed  —  Fox claimed it was an act of retaliation from Biden's DOJ, but that conspiracy theory took a hit after the indictment was unsealed  —  After the indictment of New York Mayor Eric Adams was unsealed … ",
    "url": "https://www.mediamatters.org/fox-news/fox-news-suddenly-changes-its-tune-after-eric-adams-indictment-unsealed"
  },
  {
    "text": "Newsmax and Smartmatic settle 2020 election defamation case on eve of trial  —  CNN  —  The pro-Trump cable channel Newsmax has settled a major 2020 election defamation lawsuit with Smartmatic in a last-minute agreement to avoid a high-stakes trial that posed a significant risk to the small outlet, according to a court official.",
    "url": "https://www.cnn.com/2024/09/26/business/newsmax-smartmatic-settle-defamation-case"
  },
  {
    "text": "Sweeping bill to overhaul Supreme Court would add six justices  —  The legislation by Sen. Ron Wyden (D-Ore.) is one of the most ambitious efforts to date to remake the Supreme Court following controversies over rulings and ethics.  —  A sweeping bill introduced by a Democratic senator Wednesday … ",
    "url": "https://www.washingtonpost.com/politics/2024/09/26/supreme-court-reform-15-justices-wyden/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI3MzIzMjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI4NzA1NTk5LCJpYXQiOjE3MjczMjMyMDAsImp0aSI6IjNjY2FjYjk2LTQ3ZjgtNDQ5OC1iZDRjLWYxNTdiM2RkM2Q1YSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzA5LzI2L3N1cHJlbWUtY291cnQtcmVmb3JtLTE1LWp1c3RpY2VzLXd5ZGVuLyJ9.HukdfS6VYXwKk7dIAfDHtJ6wAz077lgns4NrAKqFvfs&itid=gfta"
  },
  {
    "text": "Ron Wyden unveils plan to overhaul and expand the “power hungry” Supreme Court  —  The sweeping plan would add six new judges to the high court, appointed over three successive presidential terms  —  A new bill proposed by Sen. Ron Wyden, D-Ore., would dramatically overhaul the Supreme Court … ",
    "url": "https://www.salon.com/2024/09/26/ron-wyden-unveils-plan-to-overhaul-and-expand-the-power-hungry/"
  },
  {
    "text": "For young men who grew up in the Trump era, the 2024 election is about one big thing  —  In two focus groups with skeptical young male voters, virtually everyone described their vote as based more about backing or opposing Trump than anything about Harris.  —  New focus groups … ",
    "url": "https://www.nbcnews.com/politics/2024-election/young-men-grew-trump-era-2024-election-one-big-thing-rcna172321"
  },
  {
    "text": "North Carolina removes 747,000 from voter rolls, citing ineligibility  —  North Carolina's State Board of Elections has removed 747,000 people from its list of registered voters within the last 20 months, officials announced Thursday in a press release.  —  The State Board of Elections … ",
    "url": "https://thehill.com/homenews/campaign/4901476-north-carolina-purges-747k-voters/"
  },
  {
    "text": "A New York Court Questioned If Trump Was Correctly Nailed For Bank Fraud  —  The state appeals court is evaluating whether Letitia James went too far in the case that has Trump facing a half-billion-dollar judgment.  — Copy  —  As Donald Trump's lawyers tried on Thursday to overturn … ",
    "url": "https://www.notus.org/courts/new-york-appeals-court-trump-bank-fraud"
  },
  {
    "text": "Gaetz says he will no longer voluntarily cooperate with House Ethics probe  —  Rep. Matt Gaetz (R-Fla.) said Thursday he will no longer voluntarily cooperate with a House Ethics Committee investigation into his conduct, calling the probe “uncomfortably nosey.”",
    "url": "https://www.politico.com/live-updates/2024/09/26/congress/gaetz-done-with-ethics-probe-00181219"
  },
  {
    "text": "Trump Media shareholder UAV dumped nearly 11 million shares … United Atlantic Ventures LLC, a major shareholder in Trump Media, has sold or otherwise gotten rid of nearly 11 million shares in the company, according to a regulatory filing Thursday.  —  The move left UAV, a partnership of former … ",
    "url": "https://www.cnbc.com/2024/09/26/trump-media-shareholder-dumped-more-than-7point5-million-shares.html"
  },
  {
    "text": "Trump Would Totally Demolish Economy With His Plans, Says New Report  —  Donald Trump says he has a plan for the economy, but that doesn't mean it's any good.  —  According to independent nonprofit nonpartisan researchers, Trump's policies on tariffs, deportations, and the Federal Reserve would … ",
    "url": "https://newrepublic.com/post/186413/trump-demolish-economy-hike-inflation-report"
  },
  {
    "text": "Secret Service staffing shortage prompts Trump campaign to move Wisconsin rally  —  Former President Donald Trump's campaign scrapped plans for an upcoming outdoor rally in Wisconsin after the Secret Service said it did not have the personnel needed to secure the site, multiple sources told CBS News.",
    "url": "https://www.cbsnews.com/news/trump-wisconsin-rally-secret-service/"
  },
  {
    "text": "Millions of Vehicles Could Be Hacked and Tracked Thanks to a Simple Website Bug  —  Researchers found a flaw in a Kia web portal that let them track millions of cars, unlock doors, and start engines at will—the latest in a plague of web bugs that's affected a dozen carmakers.",
    "url": "https://www.wired.com/story/kia-web-vulnerability-vehicle-hack-track/"
  },
  {
    "text": "House Democrats likely to force action on measure formally reprimanding Clay Higgins  —  Rep. Clay Higgins (R-La.) infuriated many of his House colleagues with his since-deleted racist X post about Haitian migrants, prompting a top Black Democrat to introduce a measure to formally reprimand him that will likely see a floor vote.",
    "url": "https://www.politico.com/live-updates/2024/09/26/congress/dems-seek-censure-of-clay-higgins-00181204"
  },
  {
    "text": "Why Kamala Harris Has Won Me Over  —  Some deeply consequential decisions are starkly simple.  That is how I view our upcoming presidential election.  And that is why I have already cast my ballot for character — and voted for Vice President Kamala Harris.",
    "url": "https://www.nytimes.com/2024/09/26/opinion/kamala-harris-president.html?unlocked_article_code=1.Nk4.hflF.s-X4z_pN-b8c&smid=nytcore-ios-share&referringSource=articleShare&sgrp=c-cb"
  },
  {
    "text": "The fruits of Jack Smith's 2-year investigation into Trump will land on Tanya Chutkan's desk today  —  It may be the final inflection point in the case before Nov. 5.  —  Special counsel Jack Smith, stymied at every turn by federal courts from putting Donald Trump on trial … ",
    "url": "https://www.politico.com/news/2024/09/26/jack-smith-trump-investigation-dossier-00181108"
  },
  {
    "text": "Trump voter turnout program now largely run by Elon Musk-backed group  —  Exclusive: America Pac has up to 400 employees in each of the seven key states, with the campaign dependent on it  —  Donald Trump's mass voter turnout program in crucial battleground states is now principally being run … ",
    "url": "https://www.theguardian.com/us-news/2024/sep/26/trump-voter-turnout-elon-musk-pac"
  },
  {
    "text": "RFK Jr.'s tour with Jordan Peterson: “Make America Healthy Again” shows why “alt medicine” went MAGA  —  Despite a crunchy exterior, “alternative medicine” has always been rooted in opposition to social progress  —  In his endorsement of Donald Trump, Robert Kennedy Jr. continued to insist he remains … ",
    "url": "https://www.salon.com/2024/09/26/rfk-jrs-tour-with-jordan-peterson-make-america-healthy-again-shows-why-alt-medicine-went-maga/"
  },
  {
    "text": "China's Newest Nuclear Submarine Sank, Setting Back Its Military Modernization  —  Pierside accident came as Beijing attempts to expand its navy  —  WASHINGTON—China's newest nuclear-powered attack submarine sank in the spring, a major setback for one of the country's priority weapons programs, U.S. officials said.",
    "url": "https://www.wsj.com/world/china/chinas-newest-nuclear-submarine-sank-setting-back-its-military-modernization-785b4d37?st=zHoxBT"
  },
  {
    "text": "Trump fatigue has set: Post-election disruption plans suggests the pressure is getting to MAGA  —  Trump — realizing he has nowhere to hide — looks to disrupt  —  Donald Trump can be defeated.  —  He was in 2020, although he'll never admit it.  He was defeated by E. Jean Carroll in court … ",
    "url": "https://www.salon.com/2024/09/26/fatigue-has-set-post-disruption-plans-suggests-the-pressure-is-getting-to-maga/"
  },
  {
    "text": "Former Republican U.S. senator endorses Kamala Harris, says election offers ‘stark choice’  —  Retired Sen. Nancy Kassebaum chaired the Senate Labor Committee  —  EXCLUSIVE: Three more Republicans are crossing the aisle to endorse Vice President Kamala Harris for the White House.",
    "url": "https://www.foxnews.com/politics/former-republican-us-senator-endorses-kamala-harris-says-election-stark-choice"
  },
  {
    "text": "FACT SHEET: President Biden and Vice President Harris Announce Additional Actions to Reduce Gun Violence and Save Lives  —  New Executive Order Directs Federal Agencies to Combat Emerging Firearms Threats and  —  Improve School-Based Active Shooter Drills  —  Today, President Biden … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/09/26/fact-sheet-president-biden-and-vice-president-harris-announce-additional-actions-to-reduce-gun-violence-and-save-lives/"
  },
  {
    "text": "Pro-Harris sticky notes pop up in women's restrooms and gyms and on tampon boxes  —  Word about the grassroots campaign has spread on social media, primarily on Facebook, with women putting “Woman to woman” notes in places where other women will see them.  —  In the weeks before Election Day … ",
    "url": "https://www.nbcnews.com/politics/2024-election/harris-sticky-notes-women-restrooms-gyms-tampon-boxes-rcna172570"
  },
  {
    "text": "Vance keeps gaffing by actually detailing Trump's policies  —  “Concepts of a plan” is an easier sell than what they really want to do. … Donald Trump is a scam artist.  He promises voters everything and delivers almost nothing.  That's worked for him in the past, but Trump's current running mate … ",
    "url": "https://www.publicnotice.co/p/jd-vance-gaffes"
  },
  {
    "text": "Donald Trump opens up big lead in our election model: Are Kamala Harris' best weeks behind her and where are the 27,000 voters who could decide who wins?  — Latest update to our election model shows which voters could decide election  —  Kamala Harris may have enjoyed her most successful campaign weeks … ",
    "url": "https://www.dailymail.co.uk/news/article-13890931/Donald-Trump-opens-big-lead-election-model-Kamala-Harris-best-weeks-27-000-voters-decide-wins.html"
  },
  {
    "text": "We asked 10-year-olds about the election.  Here's what we learned  —  A version of this story appears in CNN's What Matters newsletter.  To get it in your inbox, sign up for free here.  —  CNN  —  It is jarring to hear American kids talk about politics and see the country's often … ",
    "url": "https://www.cnn.com/2024/09/26/politics/kids-politics-trump-harris-what-matters/"
  },
  {
    "text": "Mark Cuban Rejects Accusations Media Leans Liberal, Says Conservatives Control the Space Today: ‘Mainstream Media Is Not Who You Think It Is’  —  Mark Cuban pushed back against accusations that the “mainstream media” leans to the left, declaring that it is conservatives who dominate the media space today.",
    "url": "https://www.mediaite.com/tv/mark-cuban-rejects-accusations-media-leans-liberal-says-conservatives-control-the-space-today-mainstream-media-is-not-who-you-think-it-is/"
  }
]