[
  {
    "text": "How Mark Meadows Pursued a High-Wire Legal Strategy in Trump Inquiries  —  The former White House chief of staff, a key witness to Donald J. Trump's efforts to remain in power after his 2020 election loss, maneuvered to provide federal prosecutors only what he had to.",
    "url": "https://www.nytimes.com/2023/08/22/us/politics/mark-meadows-trump-legal-strategy.html"
  },
  {
    "text": "Trump attorneys guided false electors in Georgia, GOP chair says  —  The false electors were later used by Trump allies to attempt to foment a conflict on Jan. 6, 2021 and derail the transfer of power to President Joe Biden.  —  Former Georgia Republican Party Chair David Shafer said attorneys … ",
    "url": "https://www.politico.com/news/2023/08/22/trump-indictment-false-electors-00112229"
  },
  {
    "text": "Attorney John Eastman surrenders on charges in Trump's Georgia 2020 election subversion case  —  John Eastman, the conservative attorney who pushed a plan to keep Donald Trump in power, turned himself in to authorities Tuesday on charges in the Georgia case alleging an illegal plot to overturn the former president's 2020 election loss.",
    "url": "https://apnews.com/article/trump-georgia-election-indictment-fulton-county-clark-7641b5c61dbcc39ee3f0edbe51558925"
  },
  {
    "text": "Legal Battles Begin in Case Against Trump and Allies in Georgia  —  Several of Mr. Trump's co-defendants in the state racketeering case over election interference are seeking to have the matter transferred to federal court or dismissed entirely.  —  Some of Donald J. Trump's co-defendants … ",
    "url": "https://www.nytimes.com/2023/08/22/us/trump-georgia-meadows-booking.html"
  },
  {
    "text": "Trump ex-chief Mark Meadows asks judge to protect him from arrest as he seeks to move Georgia case to federal court  — Former Trump chief of staff Mark Meadows asked a federal judge to immediately move the Georgia election case out of state court in order to protect him from being arrested.",
    "url": "https://www.cnbc.com/2023/08/22/trump-ex-aide-meadows-asks-judge-to-protect-him-from-arrest-in-ga-case.html"
  },
  {
    "text": "Why do Republicans disproportionately believe health misinformation?  —  Rep. Marjorie Taylor Greene (R-Ga.) had only one comment to add when sharing a wildly conspiratorial article alleging that the recent surge in covid cases could be a way to force compliance with vaccination efforts … ",
    "url": "https://www.washingtonpost.com/politics/2023/08/22/republicans-vaccines-polls/"
  },
  {
    "text": "Trump vows massive new tariffs if elected, risking global economic war  —  Former president floats 10 percent tax on all foreign imports and calls for ‘ring around the collar’ of U.S. economy  —  Even in the face of growing personal legal peril, Donald Trump summoned his top economic advisers … ",
    "url": "https://www.washingtonpost.com/business/2023/08/22/trump-trade-tariffs/"
  },
  {
    "text": "Scoop: Fox News restricts Trump team's access to debate “spin room”  —  Fox News hit back at former President Trump late Monday after he declined to appear at the GOP presidential debate the network will host Wednesday in Milwaukee. … - Trump senior aides who had indicated they'd be in the spin room … ",
    "url": "https://www.axios.com/2023/08/22/fox-news-restricts-trump-campaign-access-debate-spin-room"
  },
  {
    "text": "US businessman is wannabe ‘warlord’ of secretive far-right men's network  —  Revealed: Charles Haywood, creator of the Society for American Civic Renewal, has said he might serve as ‘warlord’ at the head of an ‘armed patronage network’  —  The founder and sponsor of a far-right network of secretive … ",
    "url": "https://www.theguardian.com/world/2023/aug/22/charles-haywood-claremont-institute-sacr-far-right"
  },
  {
    "text": "D.C. Attorney General is probing Leonard Leo's network  —  The Federalist Society co-chair and ex-Trump judicial adviser has utilized nonprofit groups to collect more than $1 billion for conservative causes.  —  Washington D.C. Attorney General Brian Schwalb is investigating judicial activist Leonard Leo … ",
    "url": "https://www.politico.com/news/2023/08/22/d-c-attorney-general-is-probing-leonard-leos-network-00112331"
  },
  {
    "text": "Elon Musk plans to remove headlines from news articles shared on X  —  X, the social media platform previously known as Twitter, is planning a major change in how news articles appear on the service, stripping out the headline and other text so that tweets with links display only an article's lead image … ",
    "url": "https://fortune.com/2023/08/21/elon-musk-plans-remove-headlines-news-articles-link-shared-on-x-twitter/"
  },
  {
    "text": "Conservative activist sues law firms for ‘racially discriminating’ against fellowship candidates  —  A conservative activist who scored a major victory this summer when the Supreme Court ruled in favor of ending race-conscious admissions policies at colleges and universities is now working … ",
    "url": "https://www.washingtonexaminer.com/policy/courts/conservative-activist-sues-law-firms-racially-discriminating-fellowship-candidates"
  },
  {
    "text": "State of 2024 Utah GOP Presidential Primary  —  Trump has a Double-Digit Lead in a State that Once Rejected Him  —  Toplines and Crosstabs can be Found Here  —  The 2024 Republican presidential primary is in full swing, and Noble Predictive Insights (NPI) has new data on the state of the race.",
    "url": "https://www.noblepredictiveinsights.com/post/state-of-2024-utah-gop-presidential-primary"
  },
  {
    "text": "Shaker Heights attorney who supported Trump jailed for felony voter fraud  —  CLEVELAND, Ohio — A Shaker Heights attorney who donated to ex-President Donald Trump's campaign was convicted Tuesday of election fraud for voting twice in the last two general elections.",
    "url": "https://www.cleveland.com/court-justice/2023/08/shaker-heights-attorney-who-supported-trump-jailed-for-felony-voter-fraud.html"
  },
  {
    "text": "DNC to troll GOP debate by flying anti-MAGA banner  —  The Democratic National Committee (DNC) has plans to troll the Republican presidential primary debate in Milwaukee on Wednesday by flying a plane pulling a banner that knocks the “Make America Great Again” (MAGA) movement around the venue.",
    "url": "https://thehill.com/homenews/campaign/4164334-dnc-to-troll-gop-debate-by-flying-anti-maga-banner/"
  },
  {
    "text": "Majority of likely Iowa GOP caucusgoers believe Trump won the 2020 election  —  The new NBC News/Des Moines Register/Mediacom poll shows Trump's unfounded claims he won the last election remain salient ahead of the Iowa GOP caucus.  —  More than half of likely Iowa Republican caucusgoers … ",
    "url": "https://www.nbcnews.com/politics/2024-election/majority-likely-iowa-gop-caucusgoers-say-trump-won-2020-election-rcna100955"
  },
  {
    "text": "Sen. Rick Scott picks up a Democratic challenger for 2024  —  Former Rep. Debbie Mucarsel-Powell announced Tuesday that she's taking on the incumbent Republican in what's considered an uphill climb for Democrats.  —  Former Democratic Rep. Debbie Mucarsel-Powell announced Tuesday … ",
    "url": "https://www.nbcnews.com/politics/2024-election/rep-debbie-mucarsel-powell-challening-rick-scott-senate-2024-rcna101023"
  },
  {
    "text": "John Eastman Statement Upon Self-Surrender in Fulton County  —  I am here today to surrender to an indictment that should never have been brought.  It represents a crossing of the Rubicon for our country, implicating the fundamental First Amendment right to petition the government for redress of grievances.",
    "url": "https://www.burnhamgorokhov.com/john-eastman-statement-upon-self-surrender-in-fulton-county/"
  },
  {
    "text": "Supreme Court Asked To Hear Case Testing Scope of Affirmative Action Ban  —  A parents group backed by a conservative legal organization asked the U.S. Supreme Court on Monday to consider whether an admissions policy aimed at diversifying an elite Virginia high school is racially discriminatory.",
    "url": "https://freebeacon.com/latest-news/supreme-court-asked-to-hear-case-testing-scope-of-affirmative-action-ban/"
  },
  {
    "text": "Man Guilty in Attack on Black Lives Matter Protest With Claw and Car  —  Frank Cavalluzzi, wearing a glove fitted with serrated blades, accosted a peaceful group of demonstrators in Whitestone, Queens, in June 2020.  —  A Queens man who menaced a peaceful group of Black Lives Matter protesters … ",
    "url": "https://www.nytimes.com/2023/08/21/nyregion/claw-attack-blm-protest-nyc-guilty.html"
  },
  {
    "text": "Inside the text-for-pay campaign that got Asa Hutchinson on the debate stage  —  Students were paid $20 a pop for every $1 donation they found for the former Arkansas governor.  —  Live from a Des Moines television studio, Asa Hutchinson, the longshot presidential candidate … ",
    "url": "https://www.politico.com/news/2023/08/22/text-for-pay-campaign-asa-hutchinson-00112298"
  },
  {
    "text": "Audio: Vivek Ramaswamy Says He Wants ‘the Truth About 9/11’  —  The GOP presidential candidate claimed The Atlantic misquoted him.  Listen for yourself.  —  This summer, I set out to write about Vivek Ramaswamy because I thought that his public-speaking skills set him apart from his GOP presidential rivals.",
    "url": "https://www.theatlantic.com/politics/archive/2023/08/vivek-ramaswamy-audio-recording/675076/"
  },
  {
    "text": "Rep. Van Orden says eldest daughter died after battle with cancer  —  Rep. Derrick Van Orden (R-Wis.) said Tuesday that his oldest daughter, Sydney Marie (Van Orden) Martenis, died after a yearlong battle with an aggressive form of cancer.  —  Van Orden said she died “peacefully surrounded by her family” … ",
    "url": "https://thehill.com/blogs/blog-briefing-room/news/4165225-rep-van-orden-says-eldest-daughter-died-after-battle-with-cancer/"
  },
  {
    "text": "DeSantis, Ramaswamy to stand center stage at first GOP presidential debate  —  Fox News is hosting the first Republican presidential nomination debate on Wednesday at 9 pm ET in Milwaukee, Wisconsin  —  Florida Gov. Ron DeSantis and biotech entrepreneur Vivek Ramaswamy will stand center stage … ",
    "url": "https://www.foxnews.com/politics/desantis-ramaswamy-stand-center-stage-first-gop-presidential-debate"
  }
]