[
  {
    "text": "Pete Hegseth's Mother Accused Her Son of Mistreating Women for Years  —  Penelope Hegseth made the accusation in an email to her son in 2018, amid his contentious divorce.  She said on Friday that she regretted the email and had apologized to him.  —  The mother of Pete Hegseth … ",
    "url": "https://www.nytimes.com/2024/11/29/us/politics/pete-hegseth-mother-email.html?unlocked_article_code=1.d04.hkIK.QnXcVaptGbvi&smid=url-share"
  },
  {
    "text": "Text of the Email That Pete Hegseth's Mother Sent Him  —  Penelope Hegseth sent the email to her son in 2018 as he was in the middle of divorcing his wife, Samantha. … Son,  —  I have tried to keep quiet about your character and behavior, but after listening to the way you made Samantha feel today, I cannot stay silent.",
    "url": "https://www.nytimes.com/2024/11/29/us/politics/hegseth-email-text.html?unlocked_article_code=1.d04.9f-K.N-9gETW23a9n&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Ranking the Democrats: Here's who the party could nominate next as president  —  Democrats are licking their wounds after Vice President Harris's defeat to President-elect Trump, but already are looking toward who might lead their party in a 2028 presidential contest.  —  It's a fight that looks wide open.",
    "url": "https://thehill.com/homenews/campaign/5013304-democrats-2028-presidential-contenders/"
  },
  {
    "text": "Corporate America Launches Unorthodox Campaign to Gain Trump's Attention  —  Companies look at scrubbing left-leaning policies from their websites and scoping out appearances on conservative podcasts  —  Corporate America is unleashing an unorthodox campaign to influence Donald Trump's agenda … ",
    "url": "https://www.wsj.com/politics/trump-transition-lobbying-company-image-ffd42d2e?st=JPBsv7&reflink=article_copyURL_share"
  },
  {
    "text": "Democrats Weigh Dumping Nadler, Regrouping to Counter Trump  —  Some House Democrats want to oust aging committee leaders like Representative Jerrold Nadler in favor of younger lawmakers who they see as better suited to take on the president.  —  House Democrats are considering pushing aside … ",
    "url": "https://www.nytimes.com/2024/11/30/us/politics/democrats-nadler-raskin.html"
  },
  {
    "text": "Trump Vowed to Kill Biden's Climate Law.  Republicans Say Not So Fast.  —  Billions of dollars and tens of thousands of jobs are at stake in red states  —  WASHINGTON—Donald Trump's campaign-trail vow to end President Biden's signature climate law is running into a cold reality: Too many Republican lawmakers want to keep it.",
    "url": "https://www.wsj.com/politics/policy/trump-biden-climate-bill-renewable-energy-b3e5fe03"
  },
  {
    "text": "Trudeau in Florida to meet with Donald Trump in wake of tariff threat  —  U.S. president-elect said earlier this week he would impose hefty tariffs on Canada and Mexico  —  Prime Minister Justin Trudeau is in Palm Beach, Fla. to meet with U.S. president-elect Donald Trump, according to senior government sources.",
    "url": "https://www.cbc.ca/news/politics/trudeau-trump-tariff-1.7397564"
  },
  {
    "text": "Emboldened ‘manosphere’ accelerates threats and demeaning language toward women after US election  —  In the days after the presidential election, Sadie Perez began carrying pepper spray with her around campus.  Her mom also ordered her and her sister a self-defense kit that included keychain spikes … ",
    "url": "https://apnews.com/article/trump-harris-election-womens-rights-social-media-d5cea53480437ac8bf837aaa821e5681"
  },
  {
    "text": "Musk could use the ‘Department of Government Efficiency’ for self-enrichment  —  He's said $42.45bn spent by the US for rural internet isn't efficient.  His Starlink company stands to benefit if he reduces that investment  —  Elon Musk, named by Donald Trump to co-lead a commission aimed … ",
    "url": "https://www.theguardian.com/technology/2024/nov/30/elon-musk-government-efficiency-self-enrichment"
  },
  {
    "text": "How Kennedy Has Worked Abroad to Weaken Global Public Health Policy  —  The health secretary pick and his organization have worked around the world to undermine longstanding policies on measles, AIDS and more.  —  Robert F. Kennedy Jr., who is in line to lead the Department of Health … ",
    "url": "https://www.nytimes.com/2024/11/30/world/africa/rfk-jr-kennedy-international-work-public-health-policies.html"
  },
  {
    "text": "What women veterans think of Pete Hegseth's views about combat roles  —  Donald Trump's nominee for defense secretary says women shouldn't serve in combat.  These vets say his attitude is outdated, uninformed and inaccurate.  —  The Army veteran and Fox News Channel host … ",
    "url": "https://www.washingtonpost.com/national-security/2024/11/30/pete-hegseth-military-women-combat/"
  },
  {
    "text": "How Our Messed-Up Dating Culture Leads to Loneliness, Anger and Donald Trump  —  Joe Rogan.  Elon Musk.  Representatives of bro culture are on the ascent, bringing with them an army of disaffected young men.  But where did they come from?  Many argue that a generation of men are resentful … ",
    "url": "https://www.nytimes.com/2024/11/30/opinion/dating-bro-culture-manosphere-trump-cinderella.html?unlocked_article_code=1.d04.pcRs.Jt6MhG9ZzSMz&smid=url-share"
  },
  {
    "text": "Exclusive: Trump wants Gaza ceasefire deal before inauguration, Graham says … - Israeli officials believe the Trump administration might take a different approach to Gaza, specifically on what the “day after” the war would look like.  — But Graham — who speaks with Trump frequently … ",
    "url": "https://www.axios.com/2024/11/29/trump-gaza-ceasefire-hostage-deal"
  },
  {
    "text": "Republicans headed for a $4.6 trillion brawl over Trump tax cuts  —  Whether to pay for extending provisions of the Tax Cuts and Jobs Act — and even figuring out the cost — is dividing GOP lawmakers.  —  As discussions intensify on Capitol Hill over reupping President-elect Donald Trump's … ",
    "url": "https://www.politico.com/news/2024/11/29/republicans-major-fight-cost-tax-cuts-00191006"
  },
  {
    "text": "Zelenskiy Open to Cease-Fire If NATO Protects Unoccupied Areas  — Signals openness to cease-fire without winning back territory  — NATO membership unlikely soon or to cover only part of country  —  Ukraine President Volodymyr Zelenskiy suggested he'd accept a cease-fire with Russia … ",
    "url": "https://www.bloomberg.com/news/articles/2024-11-29/zelenskiy-suggests-cease-fire-if-nato-protects-unoccupied-land"
  }
]