[
  {
    "text": "Secret Service shoots armed man near White House  —  The U.S. Secret Service shot an armed man near the White House around midnight on Sunday, the agency said in a statement.  —  The big picture: While there has been no reported threat to President Trump, the Secret Service has been under … ",
    "url": "https://www.axios.com/2025/03/09/secret-service-shoots-man-white-house"
  },
  {
    "text": "Secret Service Shoots Armed Man Near the White House  —  President Trump was in Florida at the time of the episode, during which a man held a gun and a confrontation ensued, the agency said.  —  The Secret Service shot a man near the White House early Sunday after an “armed confrontation” … ",
    "url": "https://www.nytimes.com/2025/03/09/us/politics/secret-service-shooting-white-house.html"
  },
  {
    "text": "Rage Against Elon Musk Turns Tesla Into a Target  —  The backlash against the electric vehicle company has turned violent at times, as its billionaire chief executive parlays his support for President Trump into consequential influence over the federal government.",
    "url": "https://www.nytimes.com/2025/03/08/business/elon-musk-tesla-violence-protests-vandalism.html"
  },
  {
    "text": "Chinese investors privately take stakes in Elon Musk's companies  —  Asset managers have been promoting tech mogul's ties to Donald Trump to lure capital to xAI, Neuralink and SpaceX  —  Wealthy Chinese investors are quietly funnelling tens of millions of dollars into private companies controlled … ",
    "url": "https://www.ft.com/content/66857e1e-a217-4ddd-8332-d9f0f75aa459"
  },
  {
    "text": "Fear of Trump Has Elite Law Firms in Retreat  —  Executive orders against Perkins Coie and Covington & Burling have chilled industry  —  Elite law firms formed a proud part of the opposition to the first Trump administration.  This time around, the industry is fearful of taking on a president … ",
    "url": "https://www.wsj.com/us-news/law/fear-of-trump-has-elite-law-firms-in-retreat-6f251dec?st=y1T1Ya&reflink=article_copyURL_share"
  },
  {
    "text": "Top US health agency makes $25,000 buyout offer to most of its employees  —  Most of the 80,000 federal workers responsible for researching diseases, inspecting food and administering Medicare and Medicaid under the auspices of the Health and Human Services Department were emailed an offer … ",
    "url": "https://apnews.com/article/hhs-employee-buyouts-kennedy-cdc-nih-medicaid-bf5a746518b2b3fe967ab95a8e2a1a65"
  },
  {
    "text": "Trump touted sweeping tariff, DOGE plans — then adjusted as backlash grew  —  Adjustments on DOGE, tariffs suggest the president isn't immune to political pressure, despite the scale of his proposals.  —  Just now  —  President Donald Trump on Tuesday night touted his administration's early work … ",
    "url": "https://www.washingtonpost.com/business/2025/03/09/trump-tariffs-doge-politics/"
  },
  {
    "text": "DOGE's $1 spending card limit touches everything from military research to trash pickup  —  The crackdown on routine expenses is part of a campaign by the president and billionaire Elon Musk to reset the scope and mission of America's sprawling bureaucracy.  —  Just now",
    "url": "https://www.washingtonpost.com/politics/2025/03/09/doge-government-credit-card-limits/"
  },
  {
    "text": "A US-run system alerts the world to famines.  It's gone dark after Trump slashed foreign aid  —  A vital, US-run monitoring system focused on spotting food crises before they turn into famines has gone dark after the Trump administration slashed foreign aid.",
    "url": "https://www.cnn.com/2025/03/09/world/us-foreign-aid-freeze-famine-fewsnet-intl"
  },
  {
    "text": "DHS has begun performing polygraph tests on employees to find leakers  —  DHS Secretary Kristi Noem and border czar Tom Homan have blamed lower-than-expected ICE arrest numbers on recent leaks about planned operations.  —  The Department of Homeland Security has begun performing polygraph tests … ",
    "url": "https://www.nbcnews.com/politics/national-security/dhs-begun-performing-polygraph-tests-employees-find-leakers-rcna195485"
  },
  {
    "text": "The FAA's Troubles Are More Serious Than You Know  —  On January 29, American Airlines Flight 5342 collided with a U.S. Army helicopter near Washington's Ronald Reagan National Airport, killing 67 people, in the deadliest U.S. air disaster in recent history.",
    "url": "https://www.theatlantic.com/politics/archive/2025/03/faa-trump-elon-plane-crash/681975/"
  },
  {
    "text": "German lawmakers float ‘Euro Eyes’ spy network amid uncertainty on US intel  —  Senior German lawmakers sound alarm bells that a sudden cutoff could leave Europe dangerously exposed.  —  BERLIN — The Bundestag's top intelligence experts are calling for a European spy network … ",
    "url": "https://www.politico.eu/article/germany-russia-bundestag-lawmakers-float-euro-spy-network-us-intel/"
  },
  {
    "text": "The US is ending support for Ukrainian F-16s, but there is a way out  —  Читати українською  —  US President Donald Trump's team has ordered the termination of vital support for F-16 fighter jet jamming equipment that Ukraine has.",
    "url": "https://news.online.ua/en/the-us-is-ending-support-for-ukrainian-f-16s-but-there-is-a-way-out-891472/"
  },
  {
    "text": "The Populist vs. the Billionaire: Bannon, Musk and the Battle Within MAGA  —  President Trump has made clear he wants to keep both men and their allies within his movement, but the tensions are growing.  —  After word leaked out about a clash at the White House where members … ",
    "url": "https://www.nytimes.com/2025/03/09/us/politics/stephen-bannon-elon-musk-maga.html"
  },
  {
    "text": "US ‘to cease all future military exercises in Europe’  —  Nato countries could be forced to plan manoeuvres without US as Trump continues pivot away from bloc  —  The United States has told its allies that it does not plan to participate in military exercises in Europe, according to reports.",
    "url": "https://www.telegraph.co.uk/us/politics/2025/03/08/us-to-cease-all-future-military-exercises-in-europe-reports/"
  },
  {
    "text": "FEMA cancels classes at national fire training academy amid federal funding cuts  —  The country's preeminent federal fire training academy canceled classes, effective immediately, on Saturday amid the ongoing flurry of funding freezes and staffing cuts by President Donald Trump's administration.",
    "url": "https://apnews.com/article/national-fire-academy-fema-trump-cuts-doge-9cec46a638d66f19c5b8fe695e721bd6"
  },
  {
    "text": "There Is a Liberal Answer to the Trump-Musk Wrecking Ball  —  I keep seeing Democrats say the resistance failed.  On these pages, James Carville counseled Democrats to “roll over and play dead” until the Trump administration collapses beneath its own weight.",
    "url": "https://www.nytimes.com/2025/03/09/opinion/musk-trump-doge-abundance-agenda.html"
  },
  {
    "text": "March 8, 2025  —  Yesterday, Treasury Secretary Scott Bessent made it clear that the Trump administration's goal is to slash the federal government and to privatize its current services.  As the stock market has dropped and economists have warned of a dramatic slowdown in the economy … ",
    "url": "https://heathercoxrichardson.substack.com/p/march-8-2025"
  },
  {
    "text": "‘Gut punch’: Democrats decry Trump's plan to cut 80,000 at Veterans Affairs  —  Democrat lawmakers and veterans' groups are fuming over the Department of Veterans Affairs' (VA) plans to cut roughly 80,000 employees in the coming months, decrying the lack of transparency and lack of pushback from their colleagues across the aisle.",
    "url": "https://thehill.com/policy/defense/5183668-va-plans-cut-employees/"
  },
  {
    "text": "Trump wants to see more than just a minerals deal to restart aid and intel to Ukraine  —  U.S. and Ukrainian officials are set to meet in Saudi Arabia this week, with Trump focused on Zelenskyy's willingness to make concessions in negotiations.  —  WASHINGTON — As U.S. and Ukrainian officials prepare … ",
    "url": "https://www.nbcnews.com/politics/national-security/trump-wants-see-just-minerals-deal-restart-aid-intel-ukraine-rcna195508"
  },
  {
    "text": "Trump Pulled $400 Million From Columbia.  Other Schools Could Be Next.  —  The administration has circulated a list that includes nine other campuses, accusing them of failure to address antisemitism.  —  The Trump Administration's abrupt withdrawal of $400 million in federal funding … ",
    "url": "https://www.nytimes.com/2025/03/08/us/columbia-trump-colleges-antisemitism.html"
  },
  {
    "text": "‘A disruptive effect’: How slashing staff at the Social Security Administration is sparking fears the system could collapse  —  Millions of Americans could soon feel the impact of the deep staffing cuts being planned at the Social Security Administration, which is undergoing a massive reorganization … ",
    "url": "https://www.cnn.com/2025/03/08/politics/social-security-administration-staff-cuts/"
  },
  {
    "text": "USDA eliminates two food safety advisory committees  —  The U.S. Department of Agriculture has eliminated two committees that advise it on food safety, the agency said on Friday, raising concerns about government oversight of the food supply as the Trump administration seeks to downsize the federal bureaucracy and slash costs.",
    "url": "https://www.reuters.com/business/healthcare-pharmaceuticals/usda-eliminates-two-food-safety-advisory-committees-members-say-2025-03-07/"
  },
  {
    "text": "Undocumented Workers, Fearing Deportation, Are Staying Home  —  Fearing roundups, many immigrants are staying home.  Construction, agriculture, senior care and hospitality employers say labor shortages will worsen.  —  The railroad tracks that slice through downtown Freehold, N.J., used to be lined by dozens of men, waiting for work.",
    "url": "https://www.nytimes.com/2025/03/09/business/economy/immigrant-workers-deportation-fears.html"
  },
  {
    "text": "Trump's speech showed Democrats at low ebb.  A comeback will take work.  —  Democrats are seeking cohesion in their opposition to President Donald Trump and a message that resonates with voters.  —  Just now  —  The Democrats showed last week that presidential addresses to Congress are no place to formulate a resistance.",
    "url": "https://www.washingtonpost.com/politics/2025/03/09/democrats-seek-comeback-message/"
  },
  {
    "text": "Invading Canada would spark guerrilla fight lasting decades, expert says  —  Canadian ‘niceness’ is a myth that would vanish overnight in the face of invasion  —  An expert on insurgency says an American military incursion into Canada would be a disaster — for the United States.",
    "url": "https://calgaryherald.com/opinion/columnists/braid-invading-canada-would-spark-guerrilla-fight-lasting-decades-expert-says"
  },
  {
    "text": "Trump's Florida golf weekends are costing taxpayers $18m, report says - as he hits the links again  —  President has played golf on six out of seven weekends since returning to White House  —  Your support helps us to tell the story  —  From reproductive rights to climate change to Big Tech … ",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/trump-playing-golf-florida-cost-b2711532.html"
  },
  {
    "text": "HHS grants DOGE access to child support database, overriding objections  —  An HHS official said the associates of Elon Musk's group had sought ‘read-only’ access.  —  just now  —  The Department of Health and Human Services has granted associates of the U.S. DOGE Service access … ",
    "url": "https://www.washingtonpost.com/business/2025/03/08/hhs-doge-child-support/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQxNDEwMDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQyNzg4Nzk5LCJpYXQiOjE3NDE0MTAwMDAsImp0aSI6IjhkNzNkMWI2LTVmNTAtNGZiYy04ODM3LWYyMGU2NWE3ZmU0ZSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9idXNpbmVzcy8yMDI1LzAzLzA4L2hocy1kb2dlLWNoaWxkLXN1cHBvcnQvIn0.LevW59hwW9p_U4Nzr9-Z0wnvYLJe7p0-1bo2Kn1RsMs&itid=gfta"
  },
  {
    "text": "US vetoes G7 proposal to combat Russia's shadow fleet of oil tankers  —  US pushes to remove references to sanctions and Russia's war in Ukraine from a Canadian draft statement  —  The US has rejected a Canadian proposal to establish a task force that would tackle Russia's so-called … ",
    "url": "https://www.theguardian.com/us-news/2025/mar/08/america-vetoes-g7-proposal-to-combat-russias-shadow-fleet-of-oil-tankers"
  }
]