[
  {
    "text": "Don't let MAGA theatrics fool you: Donald Trump's 34 felony convictions are not helping him  —  Many people mistake cynicism for savviness.  So, of course, it took no time at all for some political pundits to rush forward to declare that Donald Trump's historic 34 felony convictions would somehow “help” him.",
    "url": "https://www.salon.com/2024/06/04/dont-let-maga-theatrics-fool-you-donald-34-felony-convictions-are-not-helping-him/"
  },
  {
    "text": "Biden Twists the ‘Convicted Felon’ Knife  —  Joe Biden called Donald Trump a “convicted felon,” and you know what?  The Trump campaign just can't believe a U.S. president would say something so low-down and mean.  —  That word is “shameful,” campaign spokeswoman Karoline Leavitt … ",
    "url": "https://www.thebulwark.com/p/biden-twists-the-convicted-felon"
  },
  {
    "text": "Read the Full Transcript of President Joe Biden's Interview With TIME  —  President Joe Biden sat down for an interview with TIME at the White House on May 28.  —  Over the course of the interview, Biden spoke at length about his foreign policy agenda, including his views on China, Taiwan … ",
    "url": "https://time.com/6984968/joe-biden-transcript-2024-interview/"
  },
  {
    "text": "Biden: ‘Every reason’ to think Netanyahu wants war with Hamas to go on  —  Biden also said that Israel made the “mistake” of conducting a Gaza campaign in similar ways to the U.S. invasions of Afghanistan and Iraq.  —  There is “every reason” for people in Israel to conclude their prime minister … ",
    "url": "https://www.politico.com/news/2024/06/04/biden-netanyahu-hamas-war-00161414"
  },
  {
    "text": "How politics, timing shaped Biden's border gambit … - He's also using the power of the presidency to stare down his critics in Congress, confident that voters want to see action — not just rhetoric — on the border.  — Biden's willing to risk a defeat in the courts and anger … ",
    "url": "https://www.axios.com/2024/06/04/biden-border-gambit-trump-2024-election"
  },
  {
    "text": "Biden Issues Executive Order to Temporarily Seal the Border to Asylum Seekers  —  The order reflects how drastically immigration politics have shifted in the United States as the number of people crossing into the country has surged.  —  President Biden issued an executive order on Tuesday … ",
    "url": "https://www.nytimes.com/2024/06/04/us/politics/biden-executive-order-border-asylum.html"
  },
  {
    "text": "Chief Financial Officer Of Multinational Media Company Charged With Participating In Scheme To Launder At Least $67 Million In Fraud Proceeds  —  For Immediate Release  —  U.S. Attorney's Office, Southern District of New York  —  Damian Williams, the United States Attorney for the Southern District … ",
    "url": "https://www.justice.gov/usao-sdny/pr/chief-financial-officer-multinational-media-company-charged-participating-scheme"
  },
  {
    "text": "‘I will not be intimidated’: Garland to rebut contempt threats from House GOP  —  House Republicans are expected to grill the attorney general about the federal prosecutions of Donald Trump and Hunter Biden.  —  Attorney General Merrick Garland will use an appearance on Capitol Hill on Tuesday … ",
    "url": "https://www.washingtonpost.com/national-security/2024/06/04/merrick-garland-testimony-judiciary-fbi-trump/"
  },
  {
    "text": "Garland slams attacks on the Justice Department, telling lawmakers: ‘I will not be intimidated’  —  Attorney General Merrick Garland testifies before the House Judiciary Committee in a hearing on “Oversight of the U.S. Department of Justice.”  —  Photos  —  Attorney General Merrick Garland rebuked … ",
    "url": "https://apnews.com/article/merrick-garland-congress-republicans-justice-department-02ed2ff53f75e3ed9bc955f9f15d87bb"
  },
  {
    "text": "Wisconsin AG Josh Kaul charges Kenneth Chesebro, other Trump aides, in fake elector scheme  —  MADISON - Wisconsin Attorney General Josh Kaul has filed felony forgery charges against an aide and two attorneys who worked for former President Donald Trump in 2020 for their part in designing … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/06/04/wisconsin-charges-chesebro-trump-aides-fake-elector-scheme/73970288007/"
  },
  {
    "text": "Lawmakers expensed millions in 2023 under new program that doesn't require receipts  —  Critics say the program's lack of transparency and record-keeping opens it up to abuse.  Matt Gaetz was the program's top spender.  —  More than 300 House lawmakers were reimbursed at least $5.2 million … ",
    "url": "https://www.washingtonpost.com/politics/2024/06/04/house-representatives-expenses-receipts-lodging/"
  },
  {
    "text": "Feds raid corporate landlord, escalating nationwide criminal probe of rent increases  —  Over the last four years, rents have skyrocketed by an average of over 30% nationwide and are a major factor in the overall inflation rate.  There are a variety of factors behind the increases, including an overall housing shortage.",
    "url": "https://popular.info/p/feds-raid-corporate-landlord-escalating"
  },
  {
    "text": "The $64 million mystery: How a wave of anonymous donations is fueling the 2024 presidential campaign  —  Washington hates a secret.  —  Yet in the summer of 2020, when a blandly named entity called the Impetus Fund received a $64 million donation from a single anonymous source … ",
    "url": "https://www.cbsnews.com/news/the-64-million-mystery-anonymous-donations-2024-presidential-campaign/"
  },
  {
    "text": "Scoop: CIA director, Biden adviser head to Mideast to push for hostage/ceasefire deal  —  CIA director Bill Burns and Brett McGurk, President Biden's top Middle East adviser, are traveling to the Middle East to push for a Gaza hostage and ceasefire deal, according to a U.S. official … ",
    "url": "https://www.axios.com/2024/06/04/burns-cia-hostages-ceasefire-gaza"
  },
  {
    "text": "Nigel Farage Immediately Takes a Milkshake to the Face on His First Day of Campaigning  —  STRAW POLL  —  It's not the first time this has happened.  —  Nigel Farage's surprise campaign for the upcoming British general election got off to a sticky start Tuesday when someone chucked a milkshake in his face.",
    "url": "https://www.thedailybeast.com/nigel-farage-immediately-takes-a-milkshake-to-the-face-on-his-first-day-of-campaigning"
  },
  {
    "text": "How a Drop in Small-Dollar Donations Is Shaking Up Both Parties … For years, Anna Cypert responded to the daily texts, calls and letters that she received from Democrats asking for money, often marked URGENT or SOS.  The former nurse sent what she could: $5 to the Democratic Congressional Campaign Committee … ",
    "url": "https://www.notus.org/2024-election/small-dollar-donations"
  },
  {
    "text": "Biden calls Trump a ‘convicted felon’ who ‘snapped’ after the 2020 election  —  The president also called Trump, who was found guilty last week in his New York criminal trial, “unhinged.”  —  President Joe Biden called former President Donald Trump a “convicted felon” who “snapped” … ",
    "url": "https://www.nbcnews.com/politics/2024-election/biden-trump-convicted-felon-snapped-rcna155327"
  },
  {
    "text": "Michael Cohen's family doxed in wake of testimony in Trump criminal trial  —  Former Trump fixer laments ‘sad times we are living through’ as addresses and phone numbers of wife and children posted online  —  Donald Trump's former fixer Michael Cohen has become the latest target of doxing efforts … ",
    "url": "https://www.theguardian.com/us-news/article/2024/jun/04/michael-cohen-family-doxed-trump-trial"
  },
  {
    "text": "Biden and his media hagiographers can't stop lying about inflation outpacing wage gains  —  .  —  President Joe Biden's inability to stop lying about his record may be compulsive, but the lies spun by his hagiographers in the media are a calculated defense for the president's flailing reelection bid.",
    "url": "https://www.washingtonexaminer.com/opinion/beltway-confidential/3027245/biden-inflation-outpacing-wage-gains/"
  },
  {
    "text": "House Democrats Begin Bid to Force Contraceptive Vote, Pressuring G.O.P.  —  By starting a discharge petition on legislation to codify the right to contraceptive access, Democrats aim to spotlight Republican opposition to the bill, part of a broader push to highlight the issue for voters.",
    "url": "https://www.nytimes.com/2024/06/04/us/politics/house-democrats-contraceptive-vote.html"
  },
  {
    "text": "Ticketmaster jacks us for billions so it can pocket millions (permalink)  —  Corruption is a system of concentrated gains and diffused costs: cheaters make a lot of money, and their victims each lose a little.  The cheater has a much larger pool of money to spend on keeping the scam going … ",
    "url": "https://pluralistic.net/2024/06/03/aoi-aoi-oh/#concentrated-gains-vast-diffused-losses"
  },
  {
    "text": "‘Antihero’ or ‘Felon’: 11 Undecided Voters Struggle With How to See Trump Post-Verdict ‘Antihero’ or ‘Felon’: 11 Undecided Voters Struggle With How to See Trump Post-Verdict  —  “How the heck can you be undecided at this point?”  Four hours after the conviction of Donald Trump … ",
    "url": "https://www.nytimes.com/interactive/2024/06/04/opinion/trump-verdict-focus-group.html"
  },
  {
    "text": "New Washington Post editor Matt Murray meets staff after abrupt Buzbee exit  —  Executive editor Sally Buzbee urged a delay of William Lewis's plan to restructure the newsroom.  Her abrupt replacement by a veteran Wall Street Journal editor triggered questions from staff.",
    "url": "https://www.washingtonpost.com/style/media/2024/06/03/matt-murray-sally-buzbee-washington-post/"
  }
]