[
  {
    "text": "Justice Alito Caught on Tape Discussing How Battle for America 'Can't Be Compromised'  —  In a new, secret recording, the Supreme Court justice says he “agrees” that the U.S. should return to a place of godliness  —  Justice Samuel Alito spoke candidly about the ideological battle between … ",
    "url": "https://www.rollingstone.com/politics/politics-features/samuel-alito-supreme-court-justice-recording-tape-battle-1235036470/"
  },
  {
    "text": "Samuel Alito Gets Remarkably Candid in Secret Audio Recording  —  'CAN'T BE COMPROMISED'  —  “One side or the other is going to win,” the Supreme Court justice says at one point.  —  Embattled U.S. Supreme Court Justice Samuel Alito was thrust into the middle of yet another controversy Monday … ",
    "url": "https://www.thedailybeast.com/justice-samuel-alito-gets-remarkably-candid-in-secret-audio-recording"
  },
  {
    "text": "Fox News Edited Out Trump Saying He Might Keep Epstein Files Sealed  —  But a later release of the interview included his full response.  —  LOADING  —  The initial airing of a Fox News interview with Donald Trump last week cut out the former president saying he may not declassify federal files … ",
    "url": "https://www.huffpost.com/entry/donald-trump-jeffrey-epstein-fox-news_n_6667330de4b019027bc727f4"
  },
  {
    "text": "Canada's Parliament rocked by allegations of treason  —  Foreign interference probe exposes links to “witting” lawmakers in Ottawa.  —  OTTAWA — The capital of one of the world's most stable democracies is gripped by growing panic about foreign agents working in elected office.",
    "url": "https://www.politico.com/news/2024/06/10/canada-parliament-treason-allegations-00162163"
  },
  {
    "text": "Georgia Republican convicted in Jan. 6 riot walks out during televised congressional primary debate  —  A Georgia congressional candidate convicted of a misdemeanor for illegally demonstrating inside the U.S. Capitol on Jan. 6, 2021, walked out of a televised debate",
    "url": "https://apnews.com/article/georgia-january-6-congress-chuck-hand-johnson-8d13db524ed68f265c8183654597926f"
  },
  {
    "text": "The Mooch's warning to Trump's new pals on Wall Street  —  Editor's note: Morning Money is a free version of POLITICO Pro Financial Services morning newsletter, which is delivered to our subscribers each morning at 5:15 a.m. The POLITICO Pro platform combines the news you need with tools … ",
    "url": "https://www.politico.com/newsletters/morning-money/2024/06/10/the-moochs-warning-to-trumps-new-pals-on-wall-street-00162439"
  },
  {
    "text": "John Fetterman and wife Gisele are hospitalized after Democratic senator rear-ended car on the highway  — Fetterman and his wife were driving in northern Maryland at the time  —  Pennsylvania Democrat Sen. John Fetterman and his wife Gisele were hospitalized after a car crash Sunday morning.",
    "url": "https://www.dailymail.co.uk/news/article-13515011/john-fetterman-wife-gisele-hospitalized-car-accident.html"
  },
  {
    "text": "Donald Trump and Byron Donalds racial stunts are for white racists, not “outreach” to Black voters  —  Trump's alliances with rappers and Donalds praising Jim Crow are about validating MAGA's racist stereotypes  —  Because we keep hearing so much about how convicted felon Donald Trump is doing … ",
    "url": "https://www.salon.com/2024/06/10/donald-and-byron-donalds-racial-stunts-are-for-racists-not-outreach-to-black/"
  },
  {
    "text": "Donald Trump Calls Taylor Swift ‘Unusually Beautiful’ but ‘Liberal’ in New ‘Apprentice’ Book (EXCLUSIVE)  —  Donald Trump is in his “Reputation” era.  —  The former president muses about pop princess Taylor Swift in a new book about his years as a reality star, “Apprentice in Wonderland … ",
    "url": "https://variety.com/2024/tv/news/donald-trump-taylor-swift-beautiful-liberal-apprentice-1236030425/"
  },
  {
    "text": "Trump to meet with Republican senators  —  Trump will meet with GOP senators in Washington on Thursday, to discuss an agenda for 2025 if they win in the fall, according to plans first shared with NBC News.  —  Former President Donald Trump will meet with a group of Republican senators in Washington … ",
    "url": "https://www.nbcnews.com/politics/congress/trump-meet-republican-senators-rcna156438"
  },
  {
    "text": "The Future is Terror  —  Robespierre, a central architect of the French revolution, may seem like an unlikely reference point for modern American politics, and Donald Trump in particular.  But in one way he articulated a theory of governing that Trump is enacting today:",
    "url": "https://donmoynihan.substack.com/p/the-future-is-terror"
  },
  {
    "text": "Things to know about FDA warning on paralytic shellfish poisoning in Pacific Northwest  —  The U.S. Food and Drug Administration says consumers should avoid eating shellfish from Oregon and Washington state as they may be contaminated with toxins that cause paralytic shellfish poisoning.",
    "url": "https://apnews.com/article/fda-warning-shellfish-oregon-washington-f5724c1b91fb78ed16c3f98a7c9e8cae"
  },
  {
    "text": "Donald Trump Mocked Over ‘Bizarre Rant’ About Sharks  —  Donald Trump has been mocked online after going on a tirade against sharks and sinking boats during his recent campaign rally in Las Vegas.  —  During his speech  —  in the key swing state of Nevada on Sunday, the former president posed … ",
    "url": "https://www.newsweek.com/donald-trump-mocked-rally-sharks-rant-las-vegas-boats-1910275"
  },
  {
    "text": "Trump won't mention abortion in brief, virtual remarks to anti-abortion group  —  The former president will deliver a pre-recorded message to a Christian advocacy group that calls abortion “child sacrifice.”  —  Hours before Donald Trump was expected to make a virtual address … ",
    "url": "https://www.politico.com/news/2024/06/10/trump-virtual-remarks-to-anti-abortion-group-00162500"
  },
  {
    "text": "Trump's Liquor Licenses Under Scrutiny After Felony Conviction  —  States across the country have laws restricting felons from selling alcohol.  What does that mean for Donald Trump, who does not drink but sells plenty of booze?  —  The State of New Jersey is reviewing whether Donald Trump's … ",
    "url": "https://www.forbes.com/sites/zacheverson/2024/06/10/donald-trump-liquor-licenses-felony-conviction-new-jersey-new-york-california/"
  },
  {
    "text": "Trump Demands Biden Remove Ad of Him Calling Dead Soldiers ‘Suckers’ and ‘Losers’  —  WAGING WAR  —  The former president said only a “psycho” or a “very stupid person” would've made such statements.  —  Donald Trump on Sunday called for President Joe Biden to take down an attack ad featuring … ",
    "url": "https://www.thedailybeast.com/trump-demands-biden-remove-ad-of-him-calling-dead-soldiers-suckers-and-losers"
  },
  {
    "text": "Ukraine strikes Moscow's most advanced fighter jet inside Russia … - The attack took place at the Akhtubinsk airfield in Russia's Astrakhan region, about 366 miles behind the front lines, GUR added.  — “The Su-57 is Moscow's most advanced fighter” jet that can carry two different types of cruise missiles.",
    "url": "https://www.axios.com/2024/06/10/ukraine-strike-russian-fighter-jet-su57"
  },
  {
    "text": "FBI Releases 2024 Quarterly Crime Report and Use-of-Force Data Update  —  the FBI's Uniform Crime Reporting (UCR) Program released the Quarterly Uniform Crime Report (Q1), January-March, 2024 and the National Use-of-Force Data Collection Update, March 2024, on the FBI's Crime Data Explorer (CDE) at https://cde.ucr.cjis.gov.",
    "url": "https://www.fbi.gov/news/press-releases/fbi-releases-2024-quarterly-crime-report-and-use-of-force-data-update"
  },
  {
    "text": "Increase in Liberal Views Brings Ideological Parity on Social Issues  —  But the long-term increase is not as pronounced on economic issues, on which Americans still lean conservative  —  WASHINGTON, D.C. — Americans have become significantly more likely to identify as liberal in their views … ",
    "url": "https://news.gallup.com/poll/645776/increase-liberal-views-brings-ideological-parity-social-issues.aspx"
  },
  {
    "text": "Minnesota Poll: Biden holds narrow lead over Trump, but GOP voters more enthusiastic  —  Biden leads Trump 45%-41% in Minnesota, according to a new Star Tribune/MPR News/KARE 11 poll.  —  President Joe Biden holds a narrow lead over former President Donald Trump among likely voters in Minnesota … ",
    "url": "https://www.startribune.com/new-minnesota-poll-shows-close-presidential-race/600371666/?refresh=true"
  },
  {
    "text": "The U.S. Economy Reaches Superstar Status  —  No, really.  —  If the United States' economy were an athlete, right now it would be peak LeBron James.  If it were a pop star, it would be peak Taylor Swift.  Four years ago, the pandemic temporarily brought much of the world economy to a halt.",
    "url": "https://www.theatlantic.com/ideas/archive/2024/06/us-economy-excellent/678630/"
  },
  {
    "text": "Pew: Most Black Americans say police, government plot against them … - The survey of nearly 5,000 Black adults found that most Black Americans are familiar with specific racial ideologies about U.S. institutions and believe they are true. … A substantial majority of Black adults (74%) … ",
    "url": "https://www.axios.com/2024/06/10/black-americans-police-government-beliefs"
  },
  {
    "text": "The Success Narratives of Liberal Life Leave Little Room for Having Children  —  For young, secular, politically progressive men and women, having children has become something of an afterthought.  Liberal conventional wisdom encourages people to spend their 20s on journeys of personal … ",
    "url": "https://www.nytimes.com/2024/06/10/opinion/natalism-liberalism-parenthood.html"
  },
  {
    "text": "Dockworkers Cancel Bargaining, Threaten Strike at U.S. Seaports  —  Union that represents workers at ports from Maine to Texas cancels labor talks in row over use of automated machinery  —  Dockworkers at America's East Coast and Gulf Coast seaports canceled labor talks that were due to start … ",
    "url": "https://www.wsj.com/articles/dockworkers-cancel-bargaining-threaten-strike-at-u-s-seaports-b5712a1a"
  },
  {
    "text": "GOP overwhelmingly supports a Trump conspiracy theory, yet again  —  There remains no evidence that Biden was behind the Manhattan prosecution of the former president, but 80 percent of Republicans say otherwise.  —  Stop me if you've heard this before: Donald Trump is unhappy about the outcome of a proceeding.",
    "url": "https://www.washingtonpost.com/politics/2024/06/10/gop-overwhelmingly-supports-trump-conspiracy-theory-yet-again/"
  },
  {
    "text": "Jill Biden's 3,600-mile round trip from France to Delaware to spend two days at Hunter's trial could cost up to $345,000... and taxpayers could be on the hook for a huge bill  — It costs $13,816 per hour to operate the first lady's government plane  —  Taxpayers will pick up the majority … ",
    "url": "https://www.dailymail.co.uk/news/article-13513343/democrat-donor-jill-france-delaware-hunter-biden-trial.html"
  },
  {
    "text": "The brazen GOP plan to launder cash to the nation's most radical gubernatorial candidate  —  One of the country's most hotly contested gubernatorial contests is taking place in North Carolina, where Lt. Governor Mark Robinson (R) — known for his extremist views on LGBTQ rights, abortion … ",
    "url": "https://popular.info/p/the-brazen-gop-plan-to-launder-cash"
  }
]