[
  {
    "text": "Could McCarthy really lose his job?  —  Good morning, Early Birds.  If you're looking to brush up on Bibi ahead of President Biden's meeting with him in New York on Wednesday, allow us to suggest David Remnick's 1998 profile in which Benjamin Netanyahu smokes a Davidoff in his office without offering Remnick one.",
    "url": "https://www.washingtonpost.com/politics/2023/09/18/could-mccarthy-really-lose-his-job/"
  },
  {
    "text": "9/18/23 ☀️ Punchbowl News AM  —  This is an enormous week for Speaker Kevin McCarthy and House Republicans.  —  The federal government will shut down in 13 days unless Congress greenlights more funding.  And House Republicans are pushing a partisan stopgap spending bill … ",
    "url": "https://punchbowl.news/archive/91823-punchbowl-news-am/"
  },
  {
    "text": "Playbook: McCarthy's latest gambit falls flat  —  Presented by With help from Eli Okun and Garrett Ross  —  DRIVING THE DAY  —  BREAKING OVERNIGHT — “Iran-US prisoner swap likely set in motion as $6 billion of once-frozen Iranian assets reaches Qatar,” by AP's Jon Gambrell … ",
    "url": "https://www.politico.com/newsletters/playbook/2023/09/18/mccarthys-latest-gambit-falls-flat-00116484"
  },
  {
    "text": "Rep. Jennifer Wexton will not seek reelection as diagnosis changes  —  Wexton was diagnosed this summer with progressive supranuclear palsy, a rare neurological condition for which there is no cure  —  Rep. Jennifer Wexton (D-Va.) promised this spring to persevere as she revealed … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2023/09/18/jennifer-wexton-parkinsons-diagnosis-progressive-supranuclear-palsy/"
  },
  {
    "text": "Jennifer Wexton will not seek reelection, citing health concerns  —  Democratic Rep. Jennifer Wexton of Virginia announced Monday morning she will finish out her term in Congress but will not seek reelection, citing health concerns.  —  Wexton was diagnosed with Parkinson's disease a few months ago … ",
    "url": "https://www.cnn.com/2023/09/18/politics/jennifer-wexton-not-running-reelection/"
  },
  {
    "text": "How not to interview Trump  —  This free edition of Public Notice is made possible by paid subscribers.  If you aren't one already, please sign up to support our work.  We're currently offering free trials for all new signups.  Just click the button below.  —  Subscribe now",
    "url": "https://www.publicnotice.co/p/kristen-welker-trump-interview-meet-the-press"
  },
  {
    "text": "I Was Attacked by Trump and Musk.  It Was a Strategy to Change What You See Online.  —  When I worked at Twitter, I led the team that placed a fact-checking label on one of Donald Trump's tweets for the first time.  Following the violence of Jan. 6, I helped make the call to ban his account from Twitter altogether.",
    "url": "https://www.nytimes.com/2023/09/18/opinion/trump-elon-musk-twitter.html"
  },
  {
    "text": "Five Americans detained in Iran are freed and on flight out of country, officials tell CNN  —  Doha and Washington CNN  —  Five Americans who had been imprisoned in Iran have been freed and are on a flight out of the country, a senior Biden administration official and a Qatari official briefed … ",
    "url": "https://www.cnn.com/2023/09/18/politics/iran-us-prisoner-release-intl/"
  },
  {
    "text": "U.S. asks for help finding missing F-35 fighter jet after pilot ejects during ‘mishap’  —  Joint Base Charleston in South Carolina appealed to the public for information in its bid to “locate an F-35 that was involved in a mishap” on Sunday afternoon.  —  A U.S. fighter jet's stealth abilities appear … ",
    "url": "https://www.nbcnews.com/news/us-news/f-35-fighter-jet-missing-pilot-ejects-mishap-rcna105534"
  },
  {
    "text": "Mark Meadows's Testimony in Georgia Case May Have Done Him No Favors  —  Mark Meadows, a former top Trump aide, took the witness stand in hopes of having his election interference case moved to federal court.  So far, the strategy has not paid off.  —  One morning last month … ",
    "url": "https://www.nytimes.com/2023/09/18/us/mark-meadows-georgia-trump-case.html"
  },
  {
    "text": "Hunter Biden sues IRS over disclosures  —  The lawsuit over IRS agent interviews with Congress and the press comes as a special counsel weighs charging him with tax crimes  —  President Biden's son Hunter Biden filed a lawsuit Monday against the Internal Revenue Service … ",
    "url": "https://www.washingtonpost.com/national-security/2023/09/18/hunter-biden-lawsuit-irs/"
  },
  {
    "text": "Billionaire Ken Griffin, former DeSantis donor, sits out GOP presidential primary  — Billionaire and Citadel CEO Ken Griffin says he is sitting on the sidelines for the 2024 Republican presidential primary.  — Griffin explained that so far he's not impressed with what he's seeing … ",
    "url": "https://www.cnbc.com/2023/09/18/billionaire-ken-griffin-former-desantis-donor-sits-out-gop-primary.html"
  },
  {
    "text": "Trump shares post bashing ‘liberal Jews who voted to destroy America’  —  Former President Donald Trump late Sunday shared an image on Truth Social telling “liberal Jews” to “make better choices” amid celebrations of the Jewish New Year.  —  Trump shared a photo on Sunday evening without any caption of his own.",
    "url": "https://thehill.com/homenews/campaign/4209650-trump-shares-post-bashing-liberal-jews-who-voted-to-destroy-america/"
  },
  {
    "text": "Trump moves to put the nail in DeSantis' campaign coffin  —  The ex-president is upping his presence in Iowa in an attempt to close any door on a comeback by the Florida governor.  —  Donald Trump's campaign believes Ron DeSantis is flatlining.  Now, they want to bury him.",
    "url": "https://www.politico.com/news/2023/09/18/trump-desantis-campaign-iowa-00116452"
  },
  {
    "text": "Republicans who objected to a Biden impeachment inquiry now say they're fine with it  —  The shift in tone after Speaker Kevin McCarthy launched the inquiry by himself reflects the continued reluctance of House Republicans in swing districts to buck their party leaders.",
    "url": "https://www.nbcnews.com/politics/congress/republicans-objected-biden-impeachment-inquiry-now-say-fine-rcna104871"
  },
  {
    "text": "Scoop: How GOP pressured Texas senators over Paxton's impeachment trial  —  Following a secret campaign coordinated by top Trump allies, Texas state senators yesterday acquitted Attorney General Ken Paxton of all impeachment charges, allowing him to return to his post.",
    "url": "https://www.axios.com/2023/09/17/ken-paxton-texas-impeachment-gop"
  }
]