[
  {
    "text": "RNC Moving to Declare Trump Its Presumptive Nominee  —  An RNC committeeman has submitted the proposal despite Nikki Haley's vow to stay in the race.  —  The Republican National Committee (RNC) is reviewing a draft resolution that, if approved, would declare Donald Trump … ",
    "url": "https://thedispatch.com/newsletter/dispatch-politics/rnc-moving-to-declare-trump-its-presumptive-nominee/"
  },
  {
    "text": "Republican National Committee considering move that would declare Trump the presumptive nominee  —  A draft resolution circulating among the Republican National Committee would formally declare Donald Trump the Republican Party's 2024 presumptive nominee.  —  While the former president … ",
    "url": "https://www.cnn.com/2024/01/25/politics/rnc-trump-presumptive-nominee-resolution"
  },
  {
    "text": "GOP senators seethe as Trump blows up delicate immigration compromise  —  Senior Senate Republicans are furious that Donald Trump may have killed an emerging bipartisan deal over the southern border, depriving them of a key legislative achievement on a pressing national priority and offering … ",
    "url": "https://www.cnn.com/2024/01/25/politics/gop-senators-angry-trump-immigration-deal/"
  },
  {
    "text": "Trump-Carroll Defamation Trial  —  Trump Briefly Takes Stand in Civil Case  —  E. Jean Carroll seeks at least $10 million from the former president in a second defamation trial.  A jury last year found that he had sexually abused her in the 1990s.  —  Benjamin Weiser and Maria CramerReporting from the courthouse",
    "url": "https://www.nytimes.com/live/2024/01/25/nyregion/trump-carroll-defamation-trial"
  },
  {
    "text": "Trump White House official convicted of defying Jan. 6 congressional subpoena will be sentenced  —  WASHINGTON (AP) — Trump White House official Peter Navarro, who was convicted of contempt of Congress for refusing to cooperate with a congressional investigation into the Jan. 6, 2021 … ",
    "url": "https://apnews.com/article/trump-navarro-white-house-contempt-jan-6-2d6efbc6e15e52eeaa1559d80e7e904c"
  },
  {
    "text": "McConnell casts doubt on border and Ukraine aid deal as GOP fury threatens both  —  The Senate minority leader's shift comes as Trump pushes Republicans to oppose the immigration pact, seeking instead to wield border chaos as a political weapon against Biden.",
    "url": "https://www.nbcnews.com/politics/congress/mcconnell-doubt-ukraine-aid-immigration-border-deal-trump-republicans-rcna135626"
  },
  {
    "text": "Ex-Trump adviser Peter Navarro sentenced to 4 months for contempt of Congress  —  Former Trump White House official Peter Navarro was sentenced Thursday to four months in prison for contempt of Congress for defying a subpoena from the House committee investigating the Jan. 6 U.S. Capitol attack.",
    "url": "https://www.npr.org/2024/01/25/1226836737/peter-navarro-sentence-contempt-congress"
  },
  {
    "text": "‘Preposterous’: Federal judge decries efforts to downplay Jan. 6 violence, label perpetrators ‘hostages’  —  Judge Royce Lamberth, who has handled dozens of Jan. 6 cases, lamented the false rhetoric spread by Donald Trump and his allies.  —  The longest-serving district judge on the federal bench … ",
    "url": "https://www.politico.com/news/2024/01/25/judge-lamberth-jan-6-trump-00137960"
  },
  {
    "text": "Reagan-appointed judge warns GOP's ‘preposterous’ claims about Jan. 6 could pose threat  —  Judge Royce Lamberth says he's “shocked” that “meritless justifications of criminal activity have gone mainstream,” as some Republican politicans defend Jan. 6 rioters.",
    "url": "https://www.nbcnews.com/politics/justice-department/reagan-appointed-judge-warns-gops-preposterous-claims-jan-6-pose-threa-rcna135754"
  },
  {
    "text": "Matt Gaetz Privately Told Colleagues His Real Motivation for Kevin McCarthy Ouster Was Ethics Probe  —  In private communications reviewed by The Daily Beast, Matt Gaetz indicated his vendetta against Kevin McCarthy was rooted in the Ethics Committee investigation against Gaetz.",
    "url": "https://www.thedailybeast.com/matt-gaetz-privately-told-colleagues-his-real-motivation-for-mccarthy-ouster-was-ethics-probe"
  },
  {
    "text": "Exclusive: China presses Iran to rein in Houthi attacks in Red Sea, sources say  —  Chinese officials have asked their Iranian counterparts to help rein in attacks on ships in the Red Sea by the Iran-backed Houthis, or risk harming business relations with Beijing, four Iranian sources and a diplomat familiar with the matter said.",
    "url": "https://www.reuters.com/world/middle-east/china-presses-iran-rein-houthi-attacks-red-sea-sources-say-2024-01-26/"
  },
  {
    "text": "EXCLUSIVE: Willis, Wade and others expected to be subpoenaed for hearing on Fulton County DA affair allegations  —  A current and former law partner to Nathan Wade, the special prosecutor leading the 2020 election subversion case in Georgia, have been told to expect a subpoena to testify … ",
    "url": "https://www.cnn.com/2024/01/25/politics/fulton-county-subpoenas-willis-wade-election-subversion/"
  },
  {
    "text": "Trump's courtroom appearances force Arizona GOP to cancel ‘Freedom Fest’: report  —  The Arizona Republican Party has pulled the plug on their upcoming “Freedom Fest” event after former President Donald Trump, who was set to headline the gathering, ditched it to attend to legal matters in court.",
    "url": "https://www.rawstory.com/trump-freedom-fest-court/"
  },
  {
    "text": "Eagle Pass is today's Fort Sumter.  Biden must federalize the Texas National Guard.  —  The high-stakes game of Texas Hold 'Em taking place on the banks of the Rio Grande between the tin soldiers of that state's Republican Gov. Greg Abbott and the U.S. Border Patrol has reached a tension level … ",
    "url": "https://www.inquirer.com/opinion/texas-border-abbott-biden-national-guard-20240125.html"
  },
  {
    "text": "Pennsylvania's governor says he wants to ‘get s— done.’ He's made it his slogan, profanity and all  —  Gov. Josh Shapiro has a new slogan for how he wants to run Pennsylvania.  And it's profane.  (Jan.25)  —  Photos  —  Gov. Josh Shapiro has a new slogan for how he wants to run Pennsylvania — and it's not fit for kids' ears.",
    "url": "https://apnews.com/article/josh-shapiro-pennsylvania-swear-word-slogan-45db6d5d09a3a1e39bd13f4af70d1e23"
  },
  {
    "text": "Larry Kudlow Agrees Biden Economy ‘Not as Bad’ as He's Been Saying  —  “So he gets his due.  If I were he, I would be out slinging that hash,” Kudlow declared on Thursday about the better-than-expected economic growth.  —  Former Trump economic adviser Larry Kudlow conceded on Thursday … ",
    "url": "https://www.thedailybeast.com/larry-kudlow-agrees-biden-economy-not-as-bad-as-hes-been-saying"
  },
  {
    "text": "Vince McMahon Accused of Sex Trafficking by WWE Staffer He Paid to Keep Quiet  —  Janel Grant files lawsuit saying McMahon pressured her into sex with him and other men at wrestling business, raising questions about 2022 board probe into CEO's payouts  —  A woman who received a payout … ",
    "url": "https://www.wsj.com/business/vince-mcmahon-accused-of-sex-trafficking-by-wwe-staffer-he-paid-to-keep-quiet-0b19b21c?mod=followamazon"
  }
]