[
  {
    "text": "U.S. votes against U.N. resolution condemning Russia for Ukraine war  —  BREAKING NEWS: U.S. sides with Russia to vote against a U.N. resolution condemning Moscow for the Ukraine  —  Washington's dramatic shift on the conflict marks a major break with its European allies and coincides … ",
    "url": "https://www.washingtonpost.com/national-security/2025/02/24/united-nations-ukraine-russia-trump/"
  },
  {
    "text": "U.S. Clashes With European Allies at the U.N. Over Ukraine  —  The United States voted against a resolution, backed by most of Europe, demanding Russian withdrawal from Ukraine — a deep fissure between allies, and a sharp shift in American policy.  —  A showdown over Ukraine between … ",
    "url": "https://www.nytimes.com/2025/02/24/world/middleeast/us-eurpe-russia-ukraine-un.html?unlocked_article_code=1.zU4.zd2_.IHXjZnPY4Q1L&smid=url-share"
  },
  {
    "text": "US joins Russia to vote against UN resolution condemning Russia's war against Ukraine  —  The United States joined Russia to vote against a UN General Assembly resolution condemning Russia's war against Ukraine Monday in a stunning shift from years of US policy.",
    "url": "https://www.cnn.com/2025/02/24/politics/us-joins-russia-ukraine-un-vote/"
  },
  {
    "text": "Trump administration tells agencies they can ignore Musk order on email reply  —  The Office of Personnel Management told HR officials that employees wouldn't be let go for not replying to an email asking what they did last week.  —  The Trump administration has told federal agency leaders … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2025/02/24/musk-email-government-confusion/"
  },
  {
    "text": "Trump backs off Musk's 5 things threat — sort of  —  An administration official said it is “not a one-size-fits-all” approach.  —  President Donald Trump on Monday defended the decision by some of his Cabinet to order their agencies to ignore Elon Musk's weekend edict that all federal … ",
    "url": "https://www.politico.com/news/2025/02/24/trump-back-off-musk-five-things-threat-00205743"
  },
  {
    "text": "Federal workers and agencies push back against Elon Musk's email ultimatum  —  The revelation comes as federal workers face a midnight deadline to respond.  —  WASHINGTON — Responses to the Elon Musk-directed email to government employees about what work they'd accomplished over the past week … ",
    "url": "https://www.nbcnews.com/politics/doge/federal-workers-agencies-push-back-elon-musks-email-ultimatum-rcna193439"
  },
  {
    "text": "Trump backs Musk as he roils the federal workforce with demands and threats  —  President Donald Trump voiced support for Elon Musk's demand that federal employees explain their recent accomplishments by the end of Monday or risk getting fired, an edict that has spawned new litigation and added … ",
    "url": "https://apnews.com/article/musk-trump-federal-workers-firings-email-9785e7f74eb2a8b8fde5e01ff0c7717f"
  },
  {
    "text": "Rep. Mark Alford tells fired KC federal workers ‘God has a plan’ at hostile town hall  —  Ariel Mollhagen couldn't hear what U.S. Rep. Mark Alford was saying but she didn't really need to.  The crowd's reaction told the story.  —  During an extraordinarily heated town hall on Monday … ",
    "url": "https://www.kansascity.com/news/politics-government/article300885874.html"
  },
  {
    "text": "AI video of Trump kissing Musk's feet plays on TVs in HUD building  —  An artificial intelligence (AI) produced video depicting President Trump rubbing and kissing Elon Musk's feet played on television screens in the Housing and Urban Development (HUD) building on Monday, in an apparent mocking of the relationship between the two men.",
    "url": "https://thehill.com/homenews/administration/5160998-trump-kissing-musk-feet-video-hud/"
  },
  {
    "text": "AI Video of Trump Kissing Elon's Bare Feet Plays Throughout HUD Office  —  Federal workers are becoming increasingly incensed over DOGE's attacks on their departments  —  As Donald Trump and Elon Musk prepare to bring their next round of arbitrary cuts to the Department of Housing and Urban Development … ",
    "url": "https://www.rollingstone.com/politics/politics-news/ai-video-trump-kissing-elon-musk-feet-plays-hud-office-1235278135/"
  },
  {
    "text": "Oversight agency finds Trump's federal worker firings unlawful, asks for some employees to be reinstated  —  An independent federal oversight agency has deemed at least some of President Trump's mass firings of probationary period employees unlawful, creating a pathway for those employees to regain their jobs.",
    "url": "https://www.govexec.com/workforce/2025/02/oversight-agency-finds-trumps-federal-worker-firings-unlawful-asks-some-employees-be-reinstated/403218/"
  },
  {
    "text": "Budget won't be changed to address Medicaid concerns, Johnson says  —  Speaker Mike Johnson said Monday that he isn't planning to make any changes to his budget plan to placate Republicans concerned about possible Medicaid cuts.  “No,” Johnson replied when asked if he would offer any concessions … ",
    "url": "https://www.politico.com/live-updates/2025/02/24/congress/mike-johnson-medicaid-cuts-00205771"
  },
  {
    "text": "Trump names podcaster Dan Bongino as deputy FBI director  —  US President Donald Trump has appointed podcaster and commentator Dan Bongino as deputy director of the FBI.  —  Trump posted on social media that Bongino was “a man of incredible love and passion for our Country” … ",
    "url": "https://www.bbc.com/news/articles/cpwd2qrn1e2o"
  },
  {
    "text": "A new document undercuts Trump admin's denials about $400 million Tesla deal  —  The controversy started in a very Washington way: as a line item in a government spreadsheet buried on the State Department's website.  —  It appeared as if the State Department was taking steps to award Elon Musk's Tesla … ",
    "url": "https://www.npr.org/2025/02/24/nx-s1-5305269/tesla-state-department-elon-musk-trump"
  },
  {
    "text": "LGBTQ Federal Workers Brace for a McCarthyist Purge  —  “They're not asking people, ‘Are you gay?  Are you lesbian?’  They're asking, ‘Who is participating in DEI?’”  —  When Michael first started working in the Department of the Interior over a decade ago, he hid the fact that he was gay from his co-workers.",
    "url": "https://www.motherjones.com/politics/2025/02/queer-trans-federal-workers-fear-lgbtq-purge-lavender-scare/"
  },
  {
    "text": "Federal judge declines to temporarily restore AP's full access to White House  —  A federal judge declined on Monday to temporarily restore the Associated Press' access to some of President Donald Trump's events, the Oval Office and Air Force One.  —  US District Judge Trevor McFadden turned … ",
    "url": "https://www.cnn.com/2025/02/24/politics/ap-white-house-access-ruling"
  },
  {
    "text": "FDA rehires staff to its medical devices division after mass layoffs  —  Around 180 FDA medical device workers were laid off this month by Elon Musk's Department of Government Efficiency.  —  The Trump administration is reinstating some employees in the Food and Drug Administration's medical devices division … ",
    "url": "https://www.nbcnews.com/health/health-news/fda-rehires-staff-medical-devices-division-mass-layoffs-rcna193501"
  },
  {
    "text": "MSNBC drama intensifies as network axes shows hosted by 3 more lefty anchors in wake of Joy Reid's ouster: sources  —  MSNBC's new president continued to overhaul the embattled network Monday — canceling shows hosted by anchors left-wing anchors Ayman Mohyeldin, Katie Phang and Jonathan Capehart, The Post has learned.",
    "url": "https://nypost.com/2025/02/24/media/msnbc-drama-intensifies-as-network-axes-shows-hosted-by-3-more-lefty-anchors-in-wake-of-joy-reids-ouster-sources/"
  },
  {
    "text": "DeSantis Trashes MAGA Lawmaker Trump Endorsed Over His Wife  —  Ron DeSantis trashed Donald Trump's endorsement to succeed him as Florida's governor—a shocking rebuke of the president as rumors swirl that his wife, Casey, is teeing up a gubernatorial run of her own.DeSantis claimed Monday … ",
    "url": "https://www.thedailybeast.com/desantis-trashes-trump-for-endorsing-maga-lawmaker-over-his-wife/"
  },
  {
    "text": "Jordan uses first subpoena of new Congress to target Biden admin  —  House Judiciary Chair Jim Jordan subpoenaed the FBI for a trove of new materials related to the Biden administration's activities, including investigations around the Jan. 6 Capitol riot and communications with Big Tech companies.",
    "url": "https://www.politico.com/live-updates/2025/02/24/congress/jordan-subpoena-biden-capitol-attack-00205815"
  },
  {
    "text": "CEO Devin Nunes Made $47 Million While Truth Social Parent Company Reported $401 Million In Losses In 2024  —  Devin Nunes earned $47 million in total compensation as CEO of Trump Media & Technology Group last year, although he won't be able to get his hands on all of it until March 2027 … ",
    "url": "https://www.forbes.com/sites/zacheverson/2025/02/24/truth-social-devin-nunes-donald-trump-media-salary/"
  },
  {
    "text": "New Idaho bill would cost you $100K, five years in jail for lying about someone  —  BOISE — House Speaker Mike Moyle on Friday introduced a bill to make it a felony crime to knowingly communicate a false statement about another person.  —  “I'm a firm believer in our First Amendment right … ",
    "url": "https://bonnercountydailybee.com/news/2025/feb/23/new-idaho-bill-would-cost-you-100k-5-years-in-jail/"
  },
  {
    "text": "The NSA's Secret Sex Chats  —  Intelligence officials maintained a chatroom to discuss polyamory and transgender surgeries, internal documents reveal.  —  / Eye on the News / Politics and law, The Social Order  —  The “intelligence community” is one of the most powerful parts of the American national security apparatus.",
    "url": "https://www.city-journal.org/article/national-security-agency-internal-chatroom-transgender-surgeries-polyamory"
  },
  {
    "text": "DOGE is the Theranos of Cost-Cutting  —  And other notes from the Chaos  —  Today's post will really be two short posts on different but related topics: The failure of DOGE to make any progress on its stated goals, and what's beginning to look like a rapid loss of confidence in Donald Trump's economic policies.",
    "url": "https://paulkrugman.substack.com/p/doge-is-the-theranos-of-cost-cutting"
  },
  {
    "text": "One Word Describes Trump  —  A century ago, a German sociologist explained precisely how the president thinks about the world.  —  What exactly is donald trump doing?  —  Since taking office, he has reduced his administration's effectiveness by appointing to essential agencies people … ",
    "url": "https://www.theatlantic.com/ideas/archive/2025/02/corruption-trump-administration/681794/"
  },
  {
    "text": "Exclusive: US SEC plans to cut regional directors as agency prepares for DOGE scrutiny, sources say  —  The U.S. Securities and Exchange Commission plans to remove the top leaders at regional offices across the country as part of its cost-cutting recommendations to the Trump administration … ",
    "url": "https://www.reuters.com/world/us/us-securities-regulator-plans-cut-regional-directors-due-trump-administration-2025-02-24/"
  },
  {
    "text": "Stonewall, UK's Largest Trans Rights Organization, Turned Out to Be a USAID Front  —  Stonewall UK, which in recent years has been at the tip of the spear in the fight to transify the UK, is slashing their staffing by 50% and even then may be in trouble.  —  Why?  USAID cuts.",
    "url": "https://hotair.com/david-strom/2025/02/24/stonewall-uks-largest-trans-rights-organization-turned-out-to-be-a-usaid-front-n3800132"
  },
  {
    "text": "City of New York v. Trump (1:25-cv-01510)  —  District Court, S.D. New York  —  Citation: City of New York v. Trump, 1:25-cv-01510, (S.D.N.Y.)  —  Cause: 05:551 Administrative Procedure Act  —  Nature of Suit: 899 Other Statutes: Administrative Procedures Act/Review or Appeal of Agency Decision",
    "url": "https://www.courtlistener.com/docket/69663207/city-of-new-york-v-trump/?order_by=desc"
  },
  {
    "text": "White House says Eagles have not rejected Super Bowl celebration invite  —  A White House official said reports that the Eagles have snubbed President Donald Trump are false.  —  A Philadelphia Eagles trip to the White House may still be in the works.  —  Over the weekend … ",
    "url": "https://www.politico.com/news/2025/02/24/philadelphia-eagles-trump-white-house-super-bowl-visit-00205768"
  },
  {
    "text": "Warner, Who Said CIA Stole Election, Now Leads DOJ Civil Rights  —  The Justice Department has inserted Mac Warner, who last year espoused false claims that the CIA stole Trump's 2020 presidential victory with the FBI's help, to run the civil rights division, replacing an ousted career official … ",
    "url": "https://news.bloomberglaw.com/us-law-week/warner-who-said-cia-stole-election-now-leads-doj-civil-rights"
  }
]