[
  {
    "text": "Suspect in Colorado attack told police he researched for a year and targeted ‘Zionist group’  —  A man accused of using a makeshift flamethrower and an incendiary device to attack a group in Boulder, Colorado, that had gathered to bring attention to Israeli hostages in Gaza … ",
    "url": "https://apnews.com/article/boulder-colorado-attack-israel-palestine-flamethrower-pearl-street-7e680648371c3d1cb7c026d888d99279"
  },
  {
    "text": "Scoop: U.S. nuclear deal offer allows Iran to enrich uranium  —  The nuclear deal proposal the U.S. gave Iran on Saturday would allow limited low-level uranium enrichment on Iranian soil for a to-be-determined period of time, Axios has learned, contradicting public statements from top officials.",
    "url": "https://www.axios.com/2025/06/02/iran-nuclear-deal-proposal-enrich-uranium"
  },
  {
    "text": "Curtis Yarvin's Plot Against America  —  The reactionary blogger's call for a monarch to rule the country once seemed like a joke.  Now the right is ready to bend the knee.  —  In the spring and summer of 2008, when Donald Trump was still a registered Democrat, an anonymous blogger known … ",
    "url": "https://www.newyorker.com/magazine/2025/06/09/curtis-yarvin-profile?currentPage=all"
  },
  {
    "text": "A surprising coalition of GOP senators holds all the megabill leverage  —  An ideologically diverse clutch of Republicans have found rare alignment — and significant leverage.  —  The Senate's deficit hawks might be raising the loudest hue and cry over the GOP's “big, beautiful bill.”",
    "url": "https://www.politico.com/news/2025/06/02/medicaid-moderates-gop-megabill-senate-00378510"
  },
  {
    "text": "A 23-Year-Old Crypto Bro Is Now Vetoing NSF Grants While Staring At His Water Bottle  —  Picture this: You're a researcher who has spent years developing a grant proposal, gone through layers of expert review, and received National Science Foundation (NSF) approval.",
    "url": "https://www.techdirt.com/2025/06/02/a-23-year-old-crypto-bro-is-now-vetoing-nsf-grants-while-staring-at-his-water-bottle/"
  },
  {
    "text": "An astonishing raid deep inside Russia rewrites the rules of war  —  Ukraine's high-risk strikes damage over 40 top-secret strategic bombers  —  Shortly after noon on June 1st, Russian social media began flashing, alerting the world to Ukraine's most audacious operation on Russian territory to date.",
    "url": "https://www.economist.com/europe/2025/06/01/an-astonishing-raid-deep-inside-russia-rewrites-the-rules-of-war"
  },
  {
    "text": "Ukraine's Stunning Assault Roils Russia's Global Military Strategy  —  Surprise drone attack hit warplanes vital to Russia's war with its neighbor  —  KYIV, Ukraine—Ukraine's unprecedented drone strikes on Russian air force bases weaken Moscow's ability to wage war on its smaller neighbor … ",
    "url": "https://www.wsj.com/world/ukraines-stunning-assault-upends-russias-global-military-strategy-094f8c1c?st=HELFiE&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Trump Arrest of Immigrant Triggers Shock and Regret in Small MAGA Town  —  Ming Li Hui, who goes by the name of “Carol,” has lived for 20 years in the town of Kennett, Missouri, after coming here from Hong Kong.  She has been raising a family there and works as a waitress … ",
    "url": "https://newrepublic.com/article/195952/trump-arrest-immigrant-triggers-shock-regret-small-maga-town"
  },
  {
    "text": "Trump and his crew are nuts  —  According to a jaw-dropping New York Times report, during the 2024 campaign, Elon Musk “told people he was taking so much ketamine, a powerful anesthetic, that it was affecting his bladder, a known effect of chronic use.”  He allegedly took a smorgasbord of drugs … ",
    "url": "https://contrarian.substack.com/p/trump-and-his-crew-are-nuts"
  },
  {
    "text": "Exclusive: China's global favorability rising, views of the U.S. turn negative  —  U.S. trade policy is making China great again — at the United States' expense, per an analysis from Morning Consult that looks at global favorability ratings, and finds China's rising while America's falls.",
    "url": "https://www.axios.com/2025/06/02/china-us-global-opinions"
  },
  {
    "text": "The Secret History of Trump's Private Cellphone  —  This article was featured in the One Story to Read Today newsletter.  Sign up for it here.  —  Just before Election Day, a disturbing piece of information made its way to Donald Trump.  Whenever he takes or makes calls on his personal cellphone … ",
    "url": "https://www.theatlantic.com/politics/archive/2025/06/trump-private-cellphone-china-hackers/683006/"
  },
  {
    "text": "“Out Of His Depth,” “Sold His Soul,” “Clueless”: NIH Staffers Speak Out About Director Bhattacharya  —  Jay Bhattacharya's stint as director of the National Institutes of Health is off to a rocky start.  At his first town hall last month, the former Stanford University health economist … ",
    "url": "https://www.importantcontext.news/p/out-of-his-depth-sold-his-soul-clueless"
  },
  {
    "text": "The Law Firms That Appeased Trump—and Angered Their Clients  —  After firms struck deals to avoid punitive executive orders, some big clients decided to take their business elsewhere  —  At a recent luncheon at Cipriani in Midtown Manhattan, a top lawyer for Citadel delivered a message … ",
    "url": "https://www.wsj.com/us-news/law/law-firms-trump-deals-clients-71b3616d?st=DLhauf&reflink=article_copyURL_share"
  },
  {
    "text": "Supreme Court Turns Down Challenge to Ban on Semiautomatic Rifles  —  The case from Maryland was the court's latest opportunity to apply its recently announced history-based test for assessing the constitutionality of gun control laws.  —  The Supreme Court announced on Monday that it would not hear … ",
    "url": "https://www.nytimes.com/2025/06/02/us/supreme-court-semiautomatic-rifle-ban.html"
  },
  {
    "text": "The Secret Police Are Here  —  Trump is losing on policy and the law.  But he's winning on power.  —  ∙ Paid  —  1. Masked Men  —  Dan Goldman represents the 10th Congressional District of New York.  Before he entered Congress he was an assistant U.S. attorney in the Southern District of New York.",
    "url": "https://www.thebulwark.com/p/the-secret-police-are-here"
  },
  {
    "text": "Trump asks the Supreme Court to clear the way for federal downsizing plans  —  President Donald Trump's administration on Monday renewed its request for the Supreme Court to clear the way for plans to downsize the federal workforce, while a lawsuit filed by labor unions and cities proceeds.",
    "url": "https://apnews.com/article/trump-mass-firings-supreme-court-doge-0ea25bf33376bda2434992587c7f3143"
  },
  {
    "text": "Meet Josh Divine, the Trump Judicial Nominee Who Argued Christians Are “Obligated Ethically to Impose Their Beliefs On Others”  —  The highlights of the résumé of Josh Divine, President Donald Trump's nominee to a federal district court vacancy in Missouri … ",
    "url": "https://ballsandstrikes.org/nominations/josh-divine-trump-nominee-missouri-columnist/"
  },
  {
    "text": "Exclusive: US pushes countries for best offers by Wednesday as tariff deadline looms  —  The Trump administration wants countries to provide their best offer on trade negotiations by Wednesday as officials seek to accelerate talks with multiple partners ahead of a self-imposed deadline in just five weeks … ",
    "url": "https://www.reuters.com/business/us-pushes-countries-best-offers-by-wednesday-tariff-deadline-looms-2025-06-02/"
  },
  {
    "text": "Supreme Court to consider reviving case over counting ballots after Election Day  —  President Donald Trump's allies have brought a series of cases seeking to exclude votes received after Election Day from official results.  —  The Supreme Court has agreed to hear a Republican lawmaker's challenge … ",
    "url": "https://www.politico.com/news/2025/06/02/supreme-court-mail-in-ballots-illinois-00380101"
  },
  {
    "text": "Ukraine, Russia conclude talks in Istanbul, a 1,200-for-1,200 prisoner exchange is in the works, Zelensky says  —  Editor's note: The story is being updated.  —  The Ukrainian and Russian delegations concluded peace talks in Istanbul on June 2, agreeing on a new prisoners of war (POWs) exchange but failing to reach a ceasefire.",
    "url": "https://kyivindependent.com/istanbul-talks-june-2/"
  },
  {
    "text": "BREAKING: Trump admin can't avoid First Amendment trial on student protesters  —  A federal judge kept a trial on track for July to determine whether he will block the Trump administration from retaliating against students based on speech.  —  Find out the breaking legal news in real time, right in your inbox.",
    "url": "https://www.allrisenews.com/p/aaup-rubio-trial"
  },
  {
    "text": "A Fiery Brief Fueled by Conservatives Helped Put Trump's Tariffs in Peril  —  A coalition including leading figures on the right said the president's program did violence to the Constitution.  One judge cited it eight times.  —  A powerful sign that President Trump's tariff-driven trade war … ",
    "url": "https://www.nytimes.com/2025/06/02/us/trump-tariffs-court-brief.html?unlocked_article_code=1.L08.Bi5y.RGNCQ6H3Fkaw&smid=url-share"
  },
  {
    "text": "Arizona's Water Is Vanishing Before AI Gets a Crack at It  —  Actual farms, not the data center variety, are sucking up groundwater more quickly than surface water from reservoirs such as Lake Mead and Lake Powell.  —  While we worry about the growing threat of robots guzzling up America's groundwater … ",
    "url": "https://www.bloomberg.com/opinion/articles/2025-06-02/arizona-s-water-is-vanishing-before-ai-gets-a-crack-at-it?accessToken=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzb3VyY2UiOiJTdWJzY3JpYmVyR2lmdGVkQXJ0aWNsZSIsImlhdCI6MTc0ODg3MTU5OSwiZXhwIjoxNzQ5NDc2Mzk5LCJhcnRpY2xlSWQiOiJTWDg2S0FUMVVNMFcwMCIsImJjb25uZWN0SWQiOiIxMkE1QzVFRUNERDg0NUJEQjVFOTM1MUE0Mzk4QTAxNCJ9.SCsqcYaCRQ5bEJbmT9QXvBRQ9asNzbCpWm5sM3iP5OA&leadSource=uverify%20wall"
  },
  {
    "text": "Republicans are trying to repeal Obamacare again.  Sort of.  —  They're not branding it an Obamacare repeal this time around, but congressional Republicans are pursuing cuts to programs that are part of the 15-year-old health-care law.  —  Congressional Republicans are pursuing changes … ",
    "url": "https://www.washingtonpost.com/health/2025/06/02/shhh-republicans-are-trying-repeal-obamacare-again-sort/"
  },
  {
    "text": "Hating New York  —  MAGA and MAGA-adjacent types are very good at finding things and people to hate.  They hate immigrants (unless they're white South Africans), LGBTQ people and wokeness.  They hate universities and are doing their best to destroy American science.  The New York Times reports that they hate Europe.",
    "url": "https://paulkrugman.substack.com/p/hating-new-york"
  },
  {
    "text": "ICE, federal partners arrest nearly 1,500 illegal aliens in Massachusetts during immigration enforcement operation  —  ICE Boston targeted criminal alien offenders during month-long surge operation  —  BOSTON — U.S. Immigration and Customs Enforcement and federal law enforcement partners … ",
    "url": "https://www.ice.gov/news/releases/ice-federal-partners-arrest-nearly-1500-illegal-aliens-massachusetts-during"
  },
  {
    "text": "Medicaid cuts will harm rural Republican communities most  —  Though President Trump promised a “big beautiful” budget bill, what narrowly passed the House of Representatives in the early morning hours of May 22 will be anything but a big beautiful win for millions of marginalized Americans … ",
    "url": "https://thehill.com/opinion/healthcare/5325977-trump-budget-impact-rural-medicaid/"
  },
  {
    "text": "Conservative Karol Nawrocki wins Poland's presidential election  —  Conservative Karol Nawrocki won Poland's weekend presidential runoff election, according to the final vote count on Monday.  Nawrocki won 50.89% of votes in a very tight race against liberal Warsaw Mayor Rafał Trzaskowski, who received 49.11%.",
    "url": "https://apnews.com/article/poland-presidential-election-karol-nawrocki-80a99eeb7a2f3ae64260a9263e7028ee"
  },
  {
    "text": "Teachers Are Not OK  —  Last month, I wrote an article about how schools were not prepared for ChatGPT and other generative AI tools, based on thousands of pages of public records I obtained from when ChatGPT was first released.  As part of that article, I asked teachers to tell me how AI has changed how they teach.",
    "url": "https://www.404media.co/teachers-are-not-ok-ai-chatgpt/"
  },
  {
    "text": "Secret Syrian intelligence files show missing US journalist was imprisoned by Assad regime  —  Fort Worth Star-Telegram/Tribune News Service via Getty Images  —  Top secret intelligence files uncovered by the BBC confirm for the first time that missing American journalist Austin Tice … ",
    "url": "https://www.bbc.com/news/articles/cn84z5e8jjzo"
  },
  {
    "text": "A Showdown Over The Power Of The Courts Is Headed To The Senate  —  The One Big Beautiful Bill Act has a provision buried halfway through its 1,000-plus pages that would take away power from the courts.  —  In the House of Representatives' recently passed One Big Beautiful Bill Act, something ugly lurks beneath the surface.",
    "url": "https://www.huffpost.com/entry/a-showdown-over-the-power-of-the-courts-is-headed-to-the-senate_n_683da629e4b08b77a460d021"
  }
]