[
  {
    "text": "Trump Leads Biden in Nearly Every Battleground State, New Poll Finds  —  Voters in battleground states said they trusted Donald J. Trump over President Biden on the economy, foreign policy and immigration, as Mr. Biden's multiracial base shows signs of fraying.",
    "url": "https://www.nytimes.com/2023/11/05/us/politics/biden-trump-2024-poll.html"
  },
  {
    "text": "Trump and allies plot revenge, Justice Department control in a second term  —  Advisers have also discussed deploying the military to quell potential unrest on Inauguration Day.  Critics have called the ideas under consideration dangerous and unconstitutional.",
    "url": "https://www.washingtonpost.com/politics/2023/11/05/trump-revenge-second-term/"
  },
  {
    "text": "The 2024 Election Rematch Americans Are Dreading Looks Likely  —  One year before voting, a weakened Biden and a criminally indicted Trump appear to be on a collision course  —  A year before the 2024 election, a divided nation is stuck in a political loop: President Trump's weaknesses … ",
    "url": "https://www.wsj.com/politics/elections/the-2024-election-rematch-americans-are-dreading-looks-likely-c89a6630?mod=followamazon"
  },
  {
    "text": "If Trump wins, more voters foresee better finances, staying out of war — CBS News poll  —  With views of things in America continuing to be bad and now hitting their most negative marks of the year, one might expect an incumbent president to trail in a pre-election poll — as Joe Biden does in this one.",
    "url": "https://www.cbsnews.com/news/trump-vs-biden-poll-2024-presidential-election-year-out/"
  },
  {
    "text": "Mike Johnson Admits He and His Son Monitor Each Other's Porn Intake in Resurfaced Video  —  “I'm proud to tell ya, my son has got a clean slate,” Speaker of the House says of his “accountability partner”  —  SPEAKER OF THE House Mike Johnson admitted that he and his son monitored each other's porn intake … ",
    "url": "https://www.rollingstone.com/politics/politics-news/mike-johnson-son-monitor-porn-intake-covenant-eyes-1234870634/"
  },
  {
    "text": "Top House Republicans defend IRS cuts in GOP-led Israel aid bill  —  Democrats have called the bill dead on arrival in the Senate and President Joe Biden has vowed to veto it.  —  Speaker Mike Johnson, R-La., and Majority Leader Steve Scalise, R-La., on Sunday defended the cuts to IRS funding … ",
    "url": "https://www.nbcnews.com/politics/congress/top-house-republicans-defend-irs-cuts-gop-led-israel-aid-bill-rcna123723"
  },
  {
    "text": "Ukrainian President Zelensky Calls Putin a ‘F—ing Terrorist’ in Interview  —  TOP ENEMY  —  Ukrainian President Volodymyr Zelensky did not mince words when discussing his Russian opponent Vladimir Putin during a Meet the Press interview on Sunday.  “I have a lot of power, back even feeling strong.",
    "url": "https://www.thedailybeast.com/ukrainian-president-volodymyr-zelensky-calls-vladimir-putin-a-f-ing-terrorist-in-interview"
  },
  {
    "text": "A Glimpse Inside Israel's Invasion of Gaza  —  Blinken Travels to Israeli-Occupied West Bank … Blinken and Abbas discussed efforts to restore calm in the West Bank, the State Department says.  —  Secretary of State Antony J. Blinken made an unannounced visit on Sunday to the Israeli-occupied West Bank … ",
    "url": "https://www.nytimes.com/live/2023/11/05/world/israel-hamas-war-gaza-news"
  },
  {
    "text": "Netanyahu backed down from firing minister who called to nuke Gaza  —  The far-right lawmaker later said on X that ‘any sensible person’ knew the comments that Israel could use a nuclear weapon in the Gaza Strip were ‘metaphorical.’  —  Heritage Minister Amichai Eliyahu from Otzma Yehudit … ",
    "url": "https://www.jpost.com/israel-news/article-771766"
  },
  {
    "text": "Stephanopoulos presses Scalise on whether 2020 election was stolen: ‘Yes or no?’  —  House Majority Leader Steve Scalise (R-La.) refused to answer whether the 2020 election was stolen when pressed eight separate times in a Sunday interview with ABC News's George Stephanopoulos.",
    "url": "https://thehill.com/homenews/house/4294554-stephanopoulos-presses-scalise-on-whether-2020-election-was-stolen-yes-or-no/"
  },
  {
    "text": "Iowa Gov. Kim Reynolds to endorse Ron DeSantis for president at Monday rally in Des Moines  —  Gov. Kim Reynolds' decision to endorse Ron DeSantis is likely to anger Donald Trump, who has already accused Reynolds of being insufficiently loyal.  —  After months of quietly signaling her support … ",
    "url": "https://www.desmoinesregister.com/story/news/elections/presidential/caucus/2023/11/05/iowa-gov-kim-reynolds-to-endorse-ron-desantis-president-monday-rally-des-moines-caucuses-2024-trump/71438016007/"
  },
  {
    "text": "Sen. John Fetterman swipes at California Gov. Gavin Newsom  —  During a speech in Iowa, Fetterman said Newsom is “running for president right now” but doesn't have the “guts to announce it.”  —  ALTOONA, IA — Sen. John Fetterman, D-Pa., on Saturday evening criticized California Gov. Gavin Newsom … ",
    "url": "https://www.nbcnews.com/meet-the-press/meetthepressblog/sen-john-fetterman-swipes-california-gov-gavin-newsom-rcna123698"
  },
  {
    "text": "Virginia's Youngkin says Biden is ‘legitimately elected president’  —  Virginia Gov. Glenn Youngkin (R) on Sunday acknowledged President Biden was “legitimately elected president” as Republicans continue to be peppered with questions about whether the 2020 election was legitimate.",
    "url": "https://thehill.com/homenews/state-watch/4294515-virginias-youngkin-says-biden-is-legitimately-elected-president/"
  },
  {
    "text": "House Speaker Mike Johnson Skirts Question on Personal Bank Account  —  The newfound Speaker said he was a “man of modest means” in a Fox interview.  —  House Speaker Mike Johnson (R-LA) responded on Sunday to a report by The Daily Beast that highlighted his apparent lack of a bank account on his financial disclosure.",
    "url": "https://www.thedailybeast.com/house-speaker-mike-johnson-skirts-question-on-personal-bank-account"
  },
  {
    "text": "Trump 2.0: The climate cannot survive another Trump term  —  This op-ed is part of a series exploring what a second term would look like for either President Biden or former President Trump.  —  Back in the home stretch of the 2020 presidential election, I stated that a second Trump term would be “game over for the climate.”",
    "url": "https://thehill.com/opinion/energy-environment/4290467-trump-2-0-the-climate-cannot-survive-another-trump-term/"
  }
]