[
  {
    "text": "Sunny Hostin Makes Disgusting, Offensive Comparison to January 6th, Then Gets Launched Into Orbit  —  With another January 6th upon us, it was just a matter of time before someone delivered the worst take of the day, and no one will be shocked to learn that it came out of Sunny Hostin's mouth.",
    "url": "https://redstate.com/bonchie/2025/01/06/sunny-hostin-makes-disgustingly-offensive-comparison-to-january-6th-then-gets-launched-into-orbit-n2184014"
  },
  {
    "text": "He Got Away With It  —  Donald Trump instigated a violent attack on the Capitol.  In two weeks, he'll be sworn in as president at the very same building  —  Aaron Thacker is a veteran of the wars in Afghanistan and Iraq.  He's served as military police, been posted at a detention facility … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-got-away-with-instigating-jan-6-capitol-attack-1235226493/"
  },
  {
    "text": "Rudy Giuliani is in contempt of court in $148 million defamation case  —  Rudy Giuliani was found in contempt of court Monday for failing to properly respond to requests for information as he turned over assets to satisfy a $148 million defamation judgment granted to two Georgia election workers.",
    "url": "https://apnews.com/article/rudy-giuliani-defamation-georgia-election-workers-5fe7787f42b4b89ef9d6df50bcde2efb"
  },
  {
    "text": "Danish king changes coat of arms amid row with Trump over Greenland  —  Design shows intent to keep control of Faroe Islands and Greenland - which Trump says he would like the US to buy  —  The Danish king has shocked some historians by changing the royal coat of arms to more prominently feature Greenland … ",
    "url": "https://www.theguardian.com/world/2025/jan/06/danish-king-changes-coat-of-arms-in-apparent-rebuke-to-donald-trump"
  },
  {
    "text": "Donald Trump Jr. to visit Greenland as his father muses anew about the US taking control of it  —  Donald Trump Jr. is heading to Greenland, visiting the Danish territory as his father has continued to stoke seemingly far-fetched suggestions that the U.S. could take control of it.",
    "url": "https://apnews.com/article/donald-trump-junior-greenland-renewed-calls-us-control-7a235a1e756c48ffdb4a3158ced35514"
  },
  {
    "text": "How will replacing Trudeau work?  Breaking down a Liberal leadership contest  —  Parliament is prorogued until March 24, buying the Liberals time to find a new leader  —  Prime Minister Justin Trudeau announced Monday morning that he plans to step down once his party picks a successor.",
    "url": "https://www.cbc.ca/news/politics/trudeau-replacement-leadership-contest-1.7423254"
  },
  {
    "text": "Trump, Who Incited Insurrection, Accuses Biden Of Making Transition ‘As Difficult As Possible’  —  Four years after trying to stop the peaceful transfer of power, the president-elect claimed Biden is engaging in “lawfare such as has never been seen before.”  —  LOADING",
    "url": "https://www.huffpost.com/entry/trump-insurrection-accuses-biden-difficult-transition_n_677c2708e4b0da20062b766e"
  },
  {
    "text": "McDonald's is the latest company to roll back diversity goals  —  Four years after launching a push for more diversity in its ranks, McDonald's is ending some of its diversity practices, citing a U.S. Supreme Court's decision that outlawed affirmative action in college admissions.",
    "url": "https://apnews.com/article/mcdonalds-diversity-dei-goals-845d94cd46511341a43e98e057b0fa8e"
  },
  {
    "text": "Trump urges Garland to block release of Jack Smith's final report  —  His lawyers wrote to Attorney General Merrick Garland.  —  Donald Trump and two of his allies are making a last-minute push to block special counsel Jack Smith from issuing his final report on his two dismissed criminal cases against the president-elect.",
    "url": "https://www.politico.com/news/2025/01/06/trump-garland-jack-smith-filing-00196786"
  },
  {
    "text": "Biden admin sends 11 Guantanamo detainees to Oman for resettlement  —  Two detainees were accused of working as bodyguards for bin Laden in Afghanistan  —  The Biden administration on Monday announced the transfer of 11 Yemeni detainees, including two former bodyguards for Osama bin Laden … ",
    "url": "https://www.foxnews.com/politics/biden-admin-sends-11-guantanamo-detainees-oman-resettlement"
  },
  {
    "text": "January 6th was Successful  —  A Slow-Motion Coup  —  Today is January 6th and I feel a certain tedium and impatience about marking the anniversary of the Capitol Hill attack four years later.  There seems to be a growing consensus that it, along with all of Trump's other menaces to constitutional rule, is not worth taking seriously.",
    "url": "https://www.unpopularfront.news/p/january-6th-was-successful"
  },
  {
    "text": "Private equity to lobby Donald Trump for access to savers' retirement funds  —  Industry hopes incoming administration will open long-restricted private investments to individual investors  —  The private equity industry is preparing to lobby the incoming Donald Trump administration to give … ",
    "url": "https://www.ft.com/content/dddd1752-789a-40b6-9aa8-d7cf6f408c81"
  },
  {
    "text": "Axios interview: Susie Wiles vows to block West Wing troublemakers … Wiles, who was co-campaign manager, gets much of the credit.  Two weeks from today, she'll bring her formula to Washington. … - The veteran Florida political operative — a former lobbyist who worked for Trump's GOP primary rival … ",
    "url": "https://www.axios.com/2025/01/06/axios-interview-susie-wiles-trump"
  },
  {
    "text": "Dana White, UFC CEO and Trump ally, to join Meta's board of directors  — Meta on Monday announced Dana White will join the company's board of directors.  — White said he'd “never been interested” in joining a company's board before Meta's offer.  — White is the CEO … ",
    "url": "https://www.businessinsider.com/ufc-ceo-dana-white-join-meta-board-directors-donald-trump-2025-1"
  },
  {
    "text": "The Bogus Case Against Birthright Citizenship for the Children of Undocumented Immigrants  —  As Inauguration Day approaches, President-elect Donald Trump's promise of mass deportation at an unprecedented scale and the infighting within his own movement over H-1B visas have understandably taken center stage.",
    "url": "https://www.theunpopulist.net/p/the-bogus-case-against-birthright"
  },
  {
    "text": "Biden permanently bans offshore drilling in 625 million acres of ocean, making a Trump reversal difficult  —  President Joe Biden on Monday announced an executive action that will permanently ban future offshore oil and gas development in parts of the Atlantic and Pacific oceans … ",
    "url": "https://www.cnn.com/2025/01/06/business/biden-offshore-drilling-ban-trump"
  },
  {
    "text": "No, John Roberts, You Are Not a Civil Rights Hero  —  At the top of Page One of Chief Justice John Roberts' “Year End Report on the Federal Judiciary” is a photograph of a courthouse—the J. Waties Waring Judicial Center in Charleston, South Carolina.  The picture is part of Roberts' effort … ",
    "url": "https://slate.com/news-and-politics/2025/01/john-roberts-compares-extremist-judges-civil-rights-heroes.html"
  },
  {
    "text": "Trump says he'll replace National Archives leader  —  President-elect Trump said on Monday that he'll replace the National Archives and Records Administration (NARA) leader.  —  “We will [have a] new archivist,” Trump told conservative radio host Hugh Hewitt on his show.",
    "url": "https://thehill.com/homenews/administration/5070619-trump-says-hell-replace-national-archives-leader/"
  },
  {
    "text": "Elon Musk's Dishonest Demagogy on Grooming Gangs  —  Over a decade ago, a horrific sex trafficking scandal rocked Britain.  Starting in the late 1990s, thousands of mostly white girls in the postindustrial north of England, many from struggling families, were groomed by networks of mostly Pakistani men … ",
    "url": "https://www.nytimes.com/2025/01/06/opinion/elon-musk-britain-sex-trafficking.html"
  },
  {
    "text": "Newsom proposes ‘balanced’ budget with no deficits  —  California Gov. Gavin Newsom (D) on Monday proposed a $322 billion budget that he said would be “balanced” and without deficits — marking a significant turnaround after two years of shortfalls.  —  Newsom delivered a “top-line” … ",
    "url": "https://thehill.com/homenews/state-watch/5070250-california-budget-gavin-newsom/"
  },
  {
    "text": "Gigantic SUVs are a public health threat.  Why don't we treat them like one?  —  The anti-tobacco playbook could help turn the US public against their beloved oversized cars. … With an annual toll of 40,000 American lives, the deadliness of secondhand smoke is now common knowledge.",
    "url": "https://www.vox.com/future-perfect/391733/gigantic-suvs-are-a-public-health-threat-why-dont-we-treat-them-like-one"
  },
  {
    "text": "The oppressive goal at the top of Speaker Mike Johnson's to-do list  —  making Democrats look bad by defending trans women — or look bad by not defending trans women — isn't Republicans' end goal here.  —  Not bringing down the cost of groceries or making housing more affordable, or even giving tax cuts to the rich.",
    "url": "https://www.msnbc.com/opinion/msnbc-opinion/republicans-congress-trans-women-sports-bill-rcna186195"
  }
]