[
  {
    "text": "My expectations for the debate were low, but holy crap  —  Republican also-rans put their unreadiness for prime time on full display. … The first thing to understand about the Republican primary is that it's not really a contest.  It's over.  It's been over for months now.  It was never even really in doubt.",
    "url": "https://www.publicnotice.co/p/gop-debate-fox-business-simi-valley-yikes"
  },
  {
    "text": "Donald Trump: UAW negotiations 'don't mean as much as you think'  —  Clinton Township — Republican Donald Trump railed against electric vehicles during a campaign stop in suburban Detroit Wednesday night, saying they're too expensive, aren't capable of traveling far enough and would spur job losses for Americans.",
    "url": "https://www.detroitnews.com/story/news/politics/2023/09/27/donald-trump-returns-auto-industry-strike-uaw-ev-taking-center-stage-presidential-election-joe-biden/70960155007/"
  },
  {
    "text": "The biggest loser of last night's debate was ...  ... not any of the seven candidates on the stage.  It wasn't even one of the candidates who weren't on the stage — Donald Trump, Asa Hutchinson, and an assortment of also rans.  The biggest loser of the debate was Fox Business Channel, with the RNC that arranged it a close runner-up.",
    "url": "https://hotair.com/ed-morrissey/2023/09/28/the-biggest-loser-of-last-nights-debate-was-n581045"
  },
  {
    "text": "EXCLUSIVE: Trump Rips RNC, Says They Have To Stop Debates … In an exclusive sit-down interview with the Daily Caller, Trump said there would not be a breakout candidate and the debates are bad for the Republican Party.  —  “They have to stop the debates.  Because it is just bad for the Republican Party.",
    "url": "https://dailycaller.com/2023/09/28/exclusive-trump-rips-rnc-stop-debates/"
  },
  {
    "text": "The Fear Factor in Republican Politics  —  IN THE HUNDRED THOUSANDTH EXAMPLE of his disordered psyche, former president Trump stated on his social network that Gen. Mark Milley is guilty of “treason.” … This is not new, but that shouldn't diminish our outrage.",
    "url": "https://plus.thebulwark.com/p/the-fear-factor-in-republican-politics-trump"
  },
  {
    "text": "Whose Side Is Fox on Anyway?  —  The Fox Business GOP presidential debate was a total trainwreck—and that's putting it mildly.  —  If you watched, you were treated to nearly two hours of left-wing talking points from the moderators, who not only had no control of the debate but ignored … ",
    "url": "https://pjmedia.com/columns/paula-bolyard/2023/09/28/whose-side-is-fox-on-anyway-n1730536"
  },
  {
    "text": "It's not just a shutdown — Congress has no plan for the FAA either  —  The airline sector is staring down an authorization and funding lapse amid congressional paralysis.  —  It's not just a broader government shutdown.  By Sunday, the aviation system could also have almost … ",
    "url": "https://www.politico.com/news/2023/09/28/congress-faa-lapse-government-shutdown-00118718"
  },
  {
    "text": "AOC accuses Republicans of fabricating Biden impeachment evidence - live  —  Ocasio-Cortez also noted the witnesses were under oath, while the lawmakers on the panel could say what they want - including lies  —  Democratic congresswoman accused Republicans of fabricating impeachment evidence",
    "url": "https://www.theguardian.com/us-news/live/2023/sep/28/republican-debate-candidates-trump-biden-impeachment-latest"
  },
  {
    "text": "Biden to deliver speech on democracy, legacy of Sen. John McCain in Arizona  — President Joe Biden is speaking at Arizona State University, home of the McCain Institute, in Phoenix where he will announce that funding from the American Rescue Plan will be used to build a McCain Library in partnership with the Institute.",
    "url": "https://www.cnbc.com/2023/09/28/biden-to-deliver-speech-in-arizona-on-democracy-sen-john-mccain.html"
  },
  {
    "text": "Christie defends attack on Jill Biden: 'That's the truth'  —  “I am standing by the wording,” Chrstie said.  —  Chris Christie stood by his attack on first lady Jill Biden the morning after the second GOP debate, saying that his remarks were “the truth.”  —  On Wednesday night … ",
    "url": "https://www.politico.com/news/2023/09/28/republican-debate-christie-jill-biden-00118712"
  },
  {
    "text": "Kari Lake to Announce Senate Run, Setting Up High-Stakes Arizona Race  —  Republican will launch her campaign at Oct. 10 rally; three-way race with independent Kyrsten Sinema and Democrat Ruben Gallego is likely  —  PHOENIX—Kari Lake will announce a run for Kyrsten Sinema's Senate seat next month … ",
    "url": "https://www.wsj.com/politics/elections/kari-lake-to-announce-senate-run-setting-up-high-stakes-arizona-race-30ff1594?mod=followamazon"
  },
  {
    "text": "New data on ultra-rich tax cheats wrecks the ‘working-class GOP’ ruse  —  Republicans have been amplifying the claim lately that their party has undergone a “populist” makeover, rendering it both anti-elite and pro-working class.  One way Republicans purport to illustrate … ",
    "url": "https://www.washingtonpost.com/opinions/2023/09/28/wealthy-tax-avoidance-ron-wyden-data/"
  },
  {
    "text": "Senate adopts resolution requiring men to wear business attire on chamber floor  —  The Senate on Wednesday adopted a resolution requiring male senators to wear a coat, tie and slacks or other long pants on the chamber's floor following days of upheaval sparked by Senate Majority Leader Charles … ",
    "url": "https://www.washingtonpost.com/politics/2023/09/27/senate-dress-code-change/"
  },
  {
    "text": "Manchin snarls top VA nominee over abortion  —  Manchin and Republicans say the agency has overstepped its authority.  —  Sen. Joe Manchin has stalled President Joe Biden's nominee to serve as the VA's general counsel for more than a year to pressure the agency to stop providing abortions … ",
    "url": "https://www.politico.com/news/2023/09/28/manchin-snarls-top-va-nominee-over-abortion-00118753"
  },
  {
    "text": "Why not Nikki Haley?  —  Of the Republican 2024 contenders, Nikki Haley, former ambassador to the United Nations and former governor of South Carolina, sticks out for all the right reasons.  Haley carries with her the kind of experience that is invaluable and not easily replicated.",
    "url": "https://www.washingtonexaminer.com/opinion/why-not-nikki-haley"
  },
  {
    "text": "An appeals court has blocked the redrawing of Louisiana's congressional map  —  A federal appeals court has stopped the redrawing of Louisiana's map of congressional voting districts, further complicating a long-running legal fight over the voting strength of the state's Black voters.",
    "url": "https://www.npr.org/2023/09/28/1201969253/louisiana-congressional-districts"
  },
  {
    "text": "Solomon Islands Plays Pacific Summit Spoiler  —  Decoding transatlantic relations with Beijing.  —  with STUART LAU  —  Hi, China Watchers.  Today we unpack the takeaways from the U.S.-Pacific Island leaders' summit, chat with a lawmaker who's not hawkish on China (!) … ",
    "url": "https://www.politico.eu/newsletter/china-watcher/solomon-islands-plays-pacific-summit-spoiler/"
  },
  {
    "text": "Watchdog Urges Extending Surveillance Law With New Limits  —  In a report about an expiring law that has generated intense debate in Congress, a government panel split over requiring court permission to view Americans' communications.  —  An independent watchdog agency that investigates … ",
    "url": "https://www.nytimes.com/2023/09/28/us/watchdog-surveillance-law-extension.html"
  },
  {
    "text": "Donald Trump, Don Jr., Ivanka and Eric Trump, Plus Michael Cohen, Listed as New York AG's Witnesses in Civil Fraud Case  —  Donald Trump and his company are expected to stand trial starting Monday in a $250 million civil case brought by AG Letitia James  —  A Facebook icon representing … ",
    "url": "https://themessenger.com/politics/trump-ivanka-eric-donjr-michael-cohen-civil-fraud-trial-witnesses"
  }
]