[
  {
    "text": "Trump executive order will attempt to end birthright citizenship  —  The incoming president plans to take at least 10 actions related to the border or immigration, including ramping up deportations and suspending refugee resettlement.  —  The U.S. government will no longer recognize … ",
    "url": "https://www.washingtonpost.com/immigration/2025/01/20/trump-immigration-executive-orders/"
  },
  {
    "text": "Here Are Trump's Expected Executive Orders  —  The incoming president's team said he would take unilateral action on a variety of fronts during his first hours in office, including 10 executive orders cracking down on immigration and immigrants.  —  President-elect Donald J. Trump on Monday … ",
    "url": "https://www.nytimes.com/2025/01/20/us/politics/trump-executive-orders-list.html"
  },
  {
    "text": "EXCLUSIVE: Trump's Day One Executive Order on ‘Male and Female’  —  The White House strikes out at gender ideology and pronouns.  Also: ends housing of biological men in women's prisons; self-ID on passports; and more.  —  Toward the end of the 2024 presidential campaign … ",
    "url": "https://www.thefp.com/p/trumps-day-one-executive-order-male-female-gender-ideology-pronouns"
  },
  {
    "text": "Trump to Call for ‘Revolution of Common Sense’ in Inaugural Address  —  In his speech, excerpts of which were shared with The Wall Street Journal, the incoming president will proclaim a ‘new era of national success’  —  WASHINGTON—President-elect Donald Trump will call for a … ",
    "url": "https://www.wsj.com/politics/trump-to-call-for-revolution-of-common-sense-in-inaugural-address-a6d94c59?st=oCx76U"
  },
  {
    "text": "‘Disgrace’: Pope Francis revives feud with Trump just before inauguration  —  Pope Francis blasted Donald Trump's plans to deport millions of undocumented immigrants, calling the United States president-elect's proposal a “disgrace.”  —  “If true, this will be a disgrace … ",
    "url": "https://www.politico.eu/article/pope-francis-reviive-feud-donald-trumps-mass-deportation-plan-disgrace/"
  },
  {
    "text": "Trump's honeymoon won't last  —  This is a very bleak moment for the United States and the world.  —  Donald Trump takes office today promising to immediately start in on a litany of human rights abuses and other efforts to harm marginalized people.  He's promised a sweeping assault … ",
    "url": "https://www.publicnotice.co/p/trump-inauguration-honeymoon-will-not-last"
  },
  {
    "text": "Biden in Final Hours Pardons Cheney, Fauci and Milley to Thwart Reprisals  —  Acting on the day he leaves office, President Biden used his executive clemency power to protect people targeted by his incoming successor, Donald J. Trump, who has vowed “retribution.”",
    "url": "https://www.nytimes.com/2025/01/20/us/politics/biden-pardons-fauci-milley-cheney-jan-6.html"
  },
  {
    "text": "Biden pardons Fauci and Milley in an effort to guard against potential ‘revenge’ by Trump  —  President Joe Biden on Monday pardoned Dr. Anthony Fauci, retired Gen. Mark Milley and members of the House committee that investigated the Jan. 6 attack on the Capitol, in an extraordinary use … ",
    "url": "https://apnews.com/article/biden-trump-fauci-milley-pardons-january-6-3cba287f89051513fb48d7ae700ae747"
  },
  {
    "text": "Don't Be Shocked.  Don't Be Awed.  —  Welcome to Inauguration Day.  We'll be here for the next four years—at least.  If you've been reading Morning Shots for a while but haven't joined Bulwark+ yet, today's the day.  —  If you join Bulwark+ today, you'll get 60 days free to try it out.",
    "url": "https://www.thebulwark.com/p/dont-be-shocked-dont-be-awed"
  },
  {
    "text": "Cecile Richards, former Planned Parenthood president and feminist activist, has died  —  Richards died Monday of an aggressive brain cancer.  She was 67.  —  Cecile Richards, the former president of Planned Parenthood and feminist activist, died Monday of an aggressive brain cancer, her family confirmed in a statement.",
    "url": "https://19thnews.org/2025/01/cecile-richards-former-planned-parenthood-president-and-feminist-activist-has-died/"
  },
  {
    "text": "Former head of Planned Parenthood Cecile Richards has died  —  Cecile Richards, a prominent advocate for women's rights and other progressive causes, died Monday.  In a statement, her family confirmed her death, saying she passed away at home, “surrounded by family and her ever-loyal dog, Ollie.”",
    "url": "https://www.npr.org/2025/01/20/nx-s1-5199767/cecile-richards-planned-parenthood-brain-cancer"
  },
  {
    "text": "Elon Musk's DOGE to be sued within minutes of Trump inauguration  —  The legal status of Musk's government waste panel will be challenged in federal court almost as soon as the president-elect is sworn in.",
    "url": "https://www.washingtonpost.com/business/2025/01/20/doge-trump-musk-ramaswamy/"
  },
  {
    "text": "Statement from President Joe Biden  —  I am issuing pardons to Gerald G. Lundergan and Ernest William Cromartie.  I am also commuting the life sentence imposed on Leonard Peltier so that he serves the remainder of his sentence in home confinement.  —  My family has been subjected … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2025/01/20/statement-from-president-joe-biden-16/"
  },
  {
    "text": "Joe Biden Grants Clemency To Leonard Peltier  —  The ailing Native American rights activist has been in prison for nearly 50 years after the U.S. government lied to put him there.  —  LOADING  —  WASHINGTON ― With literally minutes left in his presidency, Joe Biden on Monday granted clemency … ",
    "url": "https://www.huffpost.com/entry/joe-biden-leonard-peltier-clemency_n_67608b04e4b0d06419ec6367"
  },
  {
    "text": "It's ‘Just Begun’—Trump Meme Coin Suddenly Crashes Back As Melania Coin Shock Hits Crypto  —  Crypto markets have been rocked by the launch of an “official” Donald Trump memecoin this weekend—with traders braced for more mayhem this coming week.  —  Unlock over $3,000 in NFT, web3 and crypto perks — Apply now!",
    "url": "https://www.forbes.com/sites/digital-assets/2025/01/19/its-just-begun-trump-meme-coin-suddenly-crashes-back-as-melania-coin-shock-hits-crypto/"
  },
  {
    "text": "Heather Cox Richardson & Jen Rubin in conversation  —  Two of the boldest, most powerful voices of our time—a historian and a journalist—discuss the precedent for arriving at this day and where we go from here  —  Heather Cox Richardson is a professor of American history and a prolific author.",
    "url": "https://contrarian.substack.com/p/heather-cox-richardson-and-jen-rubin"
  }
]