[
  {
    "text": "Senators receive affidavit containing new allegations against Pete Hegseth, who denies the claims  —  The former sister-in-law of Trump's defense secretary pick said that Hegseth made his second wife fear for her safety.  Hegseth's second wife said, “There was no physical abuse in my marriage.”",
    "url": "https://www.nbcnews.com/politics/national-security/senators-received-affidavit-containing-new-allegations-pete-hegseth-de-rcna188342"
  },
  {
    "text": "Hegseth Ex-Sister-in-Law Tells Senators He Was ‘Abusive’ to Second Wife  —  A woman once married to the brother of Pete Hegseth, the defense secretary nominee, submitted a sworn statement to the Senate in a late-hour complication to his confirmation.  His attorney denied her account.",
    "url": "https://www.nytimes.com/2025/01/21/us/politics/hegseth-senators-affidavit.html?unlocked_article_code=1.q04.WqU2.FjpnG4Psf5Uq&smid=url-share"
  },
  {
    "text": "Hegseth Routinely Passed Out from Alcohol Abuse, Witness Says  —  Trump's Pentagon pick has denied allegations, calling them part of a ‘smear campaign’  —  Pete Hegseth, President Trump's pick to run the Pentagon, regularly abused alcohol to the point that he passed out at family gatherings … ",
    "url": "https://www.wsj.com/politics/policy/pete-hegseth-affidavit-witness-drunk-passing-out-e216ca85?st=TXviBX"
  },
  {
    "text": "Senate learns of new allegations against Hegseth  —  The Defense secretary nominee's former sister-in-law, in an affidavit, said she witnessed his drunken aggression and that his second wife worried about her safety.  —  Pete Hegseth's former sister-in-law, in an affidavit given to senators on Tuesday … ",
    "url": "https://www.politico.com/news/2025/01/21/hegseth-new-allegations-00199730"
  },
  {
    "text": "Bishop Calls Out Trump and Vance To Their Face  —  This stunning video highlights the first direct call out received by Trump and Vance since taking office.  —  This afternoon, Bishop Mariann Edgar Budde fearlessly called out Donald Trump and JD Vance to their faces at a national prayer service.",
    "url": "https://meidasnews.com/news/bishop-calls-out-trump-and-vance-to-their-face"
  },
  {
    "text": "Twenty-two States Sue to Stop Trump's Birthright Citizenship Order  —  The lawsuit to block the president's executive order is the first salvo in what is likely to be a long-running legal fight over immigration policy.  —  Attorneys general from 22 states sued President Trump in two federal district courts … ",
    "url": "https://www.nytimes.com/2025/01/21/us/trump-birthright-citizenship.html?unlocked_article_code=1.q04.hfP-.SAqdJ8-Ey02w"
  },
  {
    "text": "Trump says ICE can arrest people at churches and schools, directs agency to use ‘common sense’  —  Federal immigration authorities will be permitted to arrest people and carry out enforcement actions in and near places such as churches and schools, marking a departure from long-standing policy to avoid so-called sensitive areas.",
    "url": "https://www.cnn.com/2025/01/21/politics/ice-can-arrest-people-at-churches-and-schools/"
  },
  {
    "text": "AOC slams ADL for excusing Elon Musk's ‘awkward gesture:’ 'You're defending a Heil Hitler salute'  —  Musk spoke at an inauguration event for President Trump after he was sworn in on Monday  —  Rep. Alexandria Ocasio-Cortez, D-N.Y., attacked the Anti-Defamation League (ADL) … ",
    "url": "https://www.foxnews.com/media/aoc-slams-adl-excusing-elon-musks-awkward-gesture-youre-defending-heil-hitler-salute"
  },
  {
    "text": "Musk responds to backlash over gesture at Trump rally  —  Elon Musk has caused outrage over a one-armed gesture he gave during a speech celebrating the inauguration of Donald Trump.  —  Musk thanked the crowd for “making it happen”, before placing his right hand over his heart and then thrusting … ",
    "url": "https://www.bbc.com/news/articles/cy48v1x4dv4o"
  },
  {
    "text": "Trump picks fights with his party  —  The Scoop  —  As jubilant as Republican lawmakers are over Donald Trump's second term, they're facing a familiar reality: The president is back to picking fights with them and trying to bend them to his will.  —  From pardoning Jan. 6 offenders … ",
    "url": "https://www.semafor.com/article/01/21/2025/mcconnell-criticizes-trumps-broad-pardon-of-capitol-riot-defendants"
  },
  {
    "text": "Trump to announce up to $500 billion in private sector AI infrastructure investment  —  President Trump is set to announce billions of dollars in private sector investment to build artificial intelligence infrastructure in the United States, CBS News has learned.",
    "url": "https://www.cbsnews.com/news/trump-announces-private-sector-ai-infrastructure-investment/"
  },
  {
    "text": "Restoring Names That Honor American Greatness  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:  —  Section 1.  Purpose and Policy.  It is in the national interest to promote the extraordinary heritage … ",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/01/restoring-names-that-honor-american-greatness/"
  },
  {
    "text": "Trump terminates John Bolton's security detail within hours of taking office  —  Within hours of taking office, President Donald Trump terminated the Secret Service detail that was assigned to his former national security adviser John Bolton, Bolton confirmed to CNN on Tuesday.",
    "url": "https://www.cnn.com/2025/01/21/politics/john-bolton-security-detail-trump"
  },
  {
    "text": "Coast Guard Commandant terminated over border lapses, recruitment, DEI focus: official  —  Senior DHS official confirms to Fox News Digital Coast Guard Adm. Linda Fagan has been relieved of her post  —  EXCLUSIVE: The Commandant of the U.S. Coast Guard has been terminated over concerns about the border … ",
    "url": "https://www.foxnews.com/politics/coast-guard-commandant-terminated-over-border-lapses-recruitment-dei-focus-official"
  },
  {
    "text": "Ex-Proud Boys leader Enrique Tarrio expected Wednesday in Miami, family says  —  MIAMI - On his first day back in office, President Donald Trump issued pardons for approximately 1,500 individuals convicted in connection with the Jan. 6, 2021, Capitol riot, including Enrique Tarrio … ",
    "url": "https://www.cbsnews.com/miami/news/trump-pardons-enrique-tarrio-former-proud-boys-chairman/"
  },
  {
    "text": "Donald Trump's Medicare Executive Order Explained  —  's executive order 14087, which was put in place to lower the cost of prescription drugs for Americans.  —  Newsweek has reached out to the Trump transition team outside of regular working hours via email for comment.  —  Why It Matters",
    "url": "https://www.newsweek.com/donald-trump-medicare-executive-order-explained-2018138"
  },
  {
    "text": "Sheinbaum Calls for ‘Cool Head’ as Trump Sends Peso Tumbling  — Trump tariff pledge reignites fears he'll target Mexico  — Sheinbaum says she's focused on details rather than rhetoric  —  President Claudia Sheinbaum called for cool heads to prevail after Donald Trump's vow … ",
    "url": "https://www.bloomberg.com/news/articles/2025-01-21/mexico-must-keep-cool-head-on-trump-orders-sheinbaum-says-m66jyfvz"
  },
  {
    "text": "‘All Americans legally female’: Trump invites mockery with sloppy executive order  —  President Donald Trump published two executive orders late Monday that targeted transgender people, but critics couldn't help but note that the clunky language declared all Americans legally female.",
    "url": "https://www.rawstory.com/trump-transgender-2670902521/"
  },
  {
    "text": "Instagram hides search results for ‘Democrats’  —  Meta says its working urgently to fix a problem with Instagram which results in a “results hidden” message when users search for the terms “Democrat” or “Democrats”.  —  Some social media users have accused the company of political bias … ",
    "url": "https://www.bbc.com/news/articles/c4g32yxpdz0o"
  },
  {
    "text": "Decentralized Social Media Is the Only Alternative to the Tech Oligarchy  —  If it wasn't already obvious, the last 72 hours have made it crystal clear that it is urgent to build and mainstream alternative, decentralized social media platforms that are resistant to government censorship and control … ",
    "url": "https://www.404media.co/decentralized-social-media-is-the-only-alternative-to-the-tech-oligarchy/"
  },
  {
    "text": "Federal Workers Sue Trump Administration Over Schedule F Executive Order  —  Amid a flurry of executive orders President Donald Trump signed in the first few hours of retaking the White House is one that strips employment protections for tens of thousands of federal workers.",
    "url": "https://www.democracydocket.com/news-alerts/federal-workers-sue-trump-administration-over-schedule-f-executive-order/"
  },
  {
    "text": "A Trump Executive Order Sets Out What Could Be a Road Map for Retribution  —  The order is titled “Ending the Weaponization of the Federal Government,” but it asserts that the Biden administration might have acted illegally and directs agencies to seek evidence.",
    "url": "https://www.nytimes.com/2025/01/21/us/politics/trump-executive-order-retribution.html"
  },
  {
    "text": "The Land of Greater Fools  —  Successful criminals and politicians both understand the wisdom of going big.  It's a felony to steal a thousand bucks.  It's still a felony to steal a billion.  Might as well steal the billion.  Likewise, it takes about the same amount of political capital … ",
    "url": "https://www.hamiltonnolan.com/p/the-land-of-greater-fools"
  }
]