[
  {
    "text": "Lawyer tells ABC News his 2 clients told House Ethics Committee that Gaetz paid them for sex  —  Trump has tapped Gaetz, a former congressman, to be the new attorney general.  —  Rep. Matt Gaetz departs after speaking during the Conservative Political Action Conference, CPAC 2024 … ",
    "url": "https://abcnews.go.com/US/lawyer-tells-abc-news-2-clients-told-house/story?id=115863675"
  },
  {
    "text": "Scoop: Trump personally squeezes senators on Matt Gaetz … - “He clearly wants Matt Gaetz,” said Sen. Kevin Cramer (R-N.D.), who received a call from Trump. … - “One thing about Donald Trump, people should never confuse his support for one of his nominees as a tactical or strategic tool for somebody else,” Cramer said.",
    "url": "https://www.axios.com/2024/11/18/trump-gaetz-confirmation-senate"
  },
  {
    "text": "Two women testified that Matt Gaetz paid them for sex, lawyer says  —  An attorney representing two witnesses in the House Ethics Committee investigation goes public  —  A woman testified to the House Ethics Committee that former Rep. Matt Gaetz paid her for sex and that she witnessed … ",
    "url": "https://www.washingtonpost.com/politics/2024/11/18/matt-gaetz-ethics-report-allegations/"
  },
  {
    "text": "Trump says media is ‘vital’ to making America ‘great again,’ vows to work with ‘free, fair and open’ press  —  EXCLUSIVE: PALM BEACH, Fla. — President-elect Donald Trump said on Monday that in order to “Make America Great Again,” it is “vital” to have a “free, fair and open media,” … ",
    "url": "https://www.foxnews.com/politics/trump-says-media-vital-making-america-great-again-vows-work-free-fair-open-press"
  },
  {
    "text": "Trump taps ex-congressman and Fox Business host Sean Duffy as transportation secretary  —  President-elect Donald Trump on Monday announced that he would nominate Sean Duffy to lead the Transportation Department.  Duffy, a former reality-TV star who was elected to the House in 2010 and served … ",
    "url": "https://www.washingtonpost.com/politics/2024/11/18/trump-administration-transition/"
  },
  {
    "text": "MSNBC ‘Morning Joe’ Hosts Joe Scarborough and Mika Brzezinski Meet With Trump in Bid for “New Approach” to Coverage  —  The hosts traveled to Mar-a-Lago over the weekend, where they agreed to “restart communications” with the President-Elect.  —  Seven years after they last spoke to him … ",
    "url": "https://www.hollywoodreporter.com/news/politics-news/msnbc-morning-joe-hosts-joe-scarborough-mika-brzezinski-meet-donald-trump-coverage-1236064734/"
  },
  {
    "text": "Ken Griffin Says He's ‘Very Anxious’ About Trump's Tariff Policy  — Hedge fund founder said US will ‘return’ to creating jobs  — Griffin said talent at Citadel is his single-best investment  —  Hedge-fund titan Ken Griffin said he's anxious about Donald Trump's potential tariff policies … ",
    "url": "https://www.bloomberg.com/news/articles/2024-11-18/ken-griffin-says-he-s-very-anxious-about-trump-s-tariff-policy"
  },
  {
    "text": "Trump taps former lawmaker and reality TV star for Transportation  —  Sean Duffy served in Congress as a Wisconsin Republican.  —  President-elect Donald Trump plans to nominate former lawmaker and Fox News contributor Sean Duffy, who also had a turn on MTV's “Real World,” to be the next secretary of Transportation.",
    "url": "https://www.politico.com/news/2024/11/18/trump-taps-former-lawmaker-and-reality-tv-star-for-transportation-00190275"
  },
  {
    "text": "Potential Trump picks for DOT: A reality TV star, a rail antagonist — and a former Uber exec  —  President-elect Donald Trump's transition effort is continuing to churn through potential picks for the next head of the Transportation Department, with the current crop of names including … ",
    "url": "https://www.politico.com/live-updates/2024/11/18/congress/whos-got-trumps-ear-for-dot-00190209"
  },
  {
    "text": "House Ethics chair: Panel's decision on Gaetz report won't be influenced by Johnson  —  House Ethics Chair Michael Guest said Monday that his panel will make its own decision about releasing the report into Matt Gaetz, regardless of Speaker Mike Johnson's opinion that it should be kept under wraps.",
    "url": "https://www.politico.com/live-updates/2024/11/18/congress/guest-speaks-to-johnson-on-gaetz-report-00190214"
  },
  {
    "text": "Top Democrat on Ethics panel says she wants to publish Gaetz report  —  Rep. Susan Wild, the top Democrat on the House Ethics Committee, said Monday she wants her panel's report on former Rep. Matt Gaetz to be released to the public.  “It should certainly be released to the Senate … ",
    "url": "https://www.politico.com/live-updates/2024/11/18/congress/top-ethics-dem-wants-gaetz-report-out-00190256"
  },
  {
    "text": "Mace introduces bill to bar trans women from Capitol restrooms  —  Rep. Nancy Mace (R-S.C.) on Monday introduced a bill to bar transgender women from facilities on Capitol Hill that match their gender identity.  —  The resolution, which would prohibit members, officers and employees … ",
    "url": "https://thehill.com/homenews/house/4997024-mace-introduces-bill-transgender/"
  },
  {
    "text": "Transgender women to be banned from Capitol Hill female bathrooms under new House GOP proposal  —  Rep Nancy Mace wants provision included in next House rules package  —  FIRST ON FOX: Rep. Nancy Mace, R-S.C., is introducing a resolution to ban transgender women from using women's restrooms at the U.S. Capitol.",
    "url": "https://www.foxnews.com/politics/transgender-women-banned-from-capitol-hill-female-bathrooms-under-new-house-gop-proposal"
  },
  {
    "text": "Trump's War With the Press Takes a Terrifying Turn  —  Donald Trump has announced that the next Federal Communications Commission chair would be Brendan Carr, the senior-most Republican on the FCC and a contributor to Project 2025.  —  “Commissioner Carr is a warrior for free speech … ",
    "url": "https://newrepublic.com/post/188529/donald-trump-war-press-fcc-project-2025"
  },
  {
    "text": "Trump allies eye overhauling Medicaid, food stamps in tax legislation  —  Republican leaders, looking for ways to offset the cost of lower taxes, are considering changes to safety net programs for the poor.  —  President-elect Donald Trump's economic advisers and congressional Republicans … ",
    "url": "https://www.washingtonpost.com/business/2024/11/18/gop-targets-medicaid-food-stamps/"
  },
  {
    "text": "Musk, top Trump adviser clash over Cabinet picks … - Musk — who fueled Trump's election effort by giving at least $119 million — has questioned whether Epshteyn has had too much influence in Trump's selections, especially his top Justice Department picks and the White House counsel … ",
    "url": "https://www.axios.com/2024/11/18/trump-cabinet-musk-adviser-clash"
  },
  {
    "text": "The Transitional Oligarchy: Democracy's Last Stand?  —  The road ahead could lead to dictatorship or renewed liberty, as the American people confront the corrosive power of wealth in politics...  Oligarchy is a form of government where the richest people in a country have captured its political system … ",
    "url": "https://hartmannreport.com/p/the-transitional-oligarchy-democracys-d2f"
  },
  {
    "text": "Democrats won ‘highly engaged’ voters and struggled with everyone else in 2024  —  The final NBC News poll showed Vice President Kamala Harris losing voters who don't follow politics closely by double digits.  —  Vice President Kamala Harris and Democrats convinced frequent voters … ",
    "url": "https://www.nbcnews.com/politics/2024-election/democrats-won-highly-engaged-voters-struggled-everyone-else-2024-rcna179957"
  },
  {
    "text": "Health care organization launches ‘Stop RFK War Room’  —  Democratic-aligned health care advocacy groups are putting together a strategy to fight Robert F. Kennedy Jr.'s nomination to be HHS secretary.  During an organizing call on Monday, the details of which have not been reported publicly … ",
    "url": "https://www.politico.com/live-updates/2024/11/18/congress/health-groups-aim-to-stop-rfk-00190215"
  },
  {
    "text": "How to Stop President-Elect Trump's Potentially Abusive Domestic Deployments of the Military  —  Dear Readers:  —  President-elect Donald Trump has not been coy about his desire to deploy the American military for all kinds of domestic purposes.  Early this morning, he reaffirmed his intentions … ",
    "url": "https://www.theunpopulist.net/p/how-to-stop-president-elect-trumps"
  },
  {
    "text": "Bob Menendez attorneys question prosecutors over ‘deeply troubling’ error showing jurors improper evidence  —  Lawyers for former Sen. Bob Menendez (D-N.J.) are questioning the government's conduct after federal prosecutors admitted last week that jurors were accidentally shown improper evidence … ",
    "url": "https://thehill.com/regulation/court-battles/4996385-bob-menendez-attorneys-question-prosecutors-over-deeply-troubling-error-showing-jurors-improper-evidence/"
  },
  {
    "text": "Sweden issues pamphlet telling citizens what to do if Russia attacks  —  Norway and Finland also launched a campaign to advise people what they should do in the event of an invasion.  —  Sweden on Monday started to distribute copies of a booklet advising its citizens how to prepare for war … ",
    "url": "https://www.politico.eu/article/sweden-issues-pamphlet-warning-citizens-what-to-do-in-case-of-war/"
  }
]