[
  {
    "text": "Mark Meadows takes stand in bid to derail Georgia criminal charges  —  The former top Trump aide testified that he viewed nearly everything as part of his official duties — an argument he hopes will give him immunity.  —  ATLANTA — Former Trump White House Chief of Staff Mark Meadows took … ",
    "url": "https://www.politico.com/news/2023/08/28/meadows-testimony-georgia-hearing-00113215"
  },
  {
    "text": "Trump vows to appeal after judge set federal election trial for March 4, 2024  — A federal judge set a March 4, 2024, trial date in former President Donald Trump's criminal election interference case.  — Judge Tanya Chutkan delivered that ruling after rejecting two wildly different … ",
    "url": "https://www.cnbc.com/2023/08/28/trump-special-counsel-to-clash-over-trial-date-in-dc-election-case.html"
  },
  {
    "text": "Meadows testifies in Atlanta; March trial date for Trump in D.C.  —  Trump D.C. trial set to begin in March amid GOP primaries and other trial dates  —  U.S. prosecutor says Trump's social media posts show need for quick trial  —  'Let's take the temperature down,' judge says in D.C. hearing",
    "url": "https://www.washingtonpost.com/dc-md-va/2023/08/28/trump-jan-6-trial-date/"
  },
  {
    "text": "Samuel Wurzelbacher, Celebrated as ‘Joe the Plumber,’ Dies at 49  —  For Republicans in 2008, he briefly became a symbol of Middle America when he questioned the presidential candidate Barack Obama in an impromptu televised encounter.  —  Samuel Joseph Wurzelbacher, who briefly became … ",
    "url": "https://www.nytimes.com/2023/08/28/us/politics/samuel-wurzelbacher-joe-the-plumber-dead.html"
  },
  {
    "text": "‘Joe The Plumber,’ who rose to fame after confronting Barack Obama on the 2008 campaign trail, dead at 49  —  Joe Wurzelbacher, a plumber by trade, became a key part of Republican John McCain's presidential campaign  —  Samuel Joseph Wurzelbacher, who became known as “Joe the Plumber” … ",
    "url": "https://www.foxnews.com/politics/joe-plumber-rose-fame-confronting-obama-2008-campaign-trail-dead-49"
  },
  {
    "text": "EXCLUSIVE: Eminem sends Vivek Ramaswamy a cease and desist letter demanding he stop rapping his music on the campaign trail  — Rapper Eminem has objected to Republican candidate Vivek Ramaswamy using his music on the campaign trail, DailyMail.com can exclusively report",
    "url": "https://www.dailymail.co.uk/news/article-12453955/Im-REAL-Slim-Shady-Eminem-sends-skinny-Vivek-Ramaswamy-cease-desist-letter-demanding-stop-rapping-music-campaign-trail.html"
  },
  {
    "text": "Ramaswamy Fires At Nikki Haley On Campaign Website: ‘Keep Lying, Namrata Randhawa’  —  The 2024 hopeful's website referenced the former ambassador's birth name to dispel a ‘myth’ about his support of Israel  —  A Facebook icon representing an external link to share the article on Facebook … ",
    "url": "https://themessenger.com/politics/ramaswamy-fires-at-nikki-haley-on-campaign-website-keep-lying-namrata-randhawa"
  },
  {
    "text": "A federal hate crime probe is underway after 3 people were killed in a racist rampage in Jacksonville, officials say.  Here's what we know  —  A federal hate crime investigation is underway after a White gunman with a swastika-emblazoned assault rifle killed three Black people at a Dollar General store … ",
    "url": "https://www.cnn.com/2023/08/28/us/jacksonville-florida-shooting-what-we-know/"
  },
  {
    "text": "Peter Navarro says Trump told him to assert privilege during Jan. 6 committee investigation  —  Washington — Former top Trump White House economic adviser Peter Navarro told a federal judge that Donald Trump made it “very clear” that he wanted Navarro to invoke certain privileges and not respond … ",
    "url": "https://www.cbsnews.com/news/trump-aide-peter-navarro-trump-assert-privilege-jan-6-committee/"
  },
  {
    "text": "GOP activist, lawyer stabbed to death in his Durham, NH, home  —  A suspicious death investigation that was underway this weekend in Durham, New Hampshire, has been ruled a homicide after an autopsy was completed on the victim.  —  The New Hampshire Attorney General's Office said in a statement Sunday … ",
    "url": "https://www.nbcboston.com/news/local/41-year-old-man-fatally-stabbed-in-durham-nh-identified/3122099/"
  },
  {
    "text": "The administration's love letter to unions  —  A new Treasury Department report found unions help to raise wages and benefits for workers and can lead to positive economic “spillover effects.”  —  Treasury Secretary Janet Yellen described her agency's report Monday as “the administration's latest action … ",
    "url": "https://thehill.com/newsletters/business-economy/4175613-the-administrations-love-letter-to-unions/"
  },
  {
    "text": "Faculty member shot and killed in a campus building, says University of North Carolina official  —  A University of North Carolina faculty member was shot and killed in a campus building, officials said Monday.  A suspect was arrested about an hour and a half after shots were reported … ",
    "url": "https://apnews.com/article/university-north-carolina-chapel-hill-shooting-9a264145d183eeb7c28bb7d6a467ab39"
  },
  {
    "text": "Burning Man 2023: Nevada Rangers plow truck through Extinction Rebellion protest after the activists blocked road into festival causing ‘miles-long gridlock’  — Officers from the Pyramid Lake Paiute Tribal Police drove through the blockade  —  Rangers have smashed through a climate protest blocking … ",
    "url": "https://www.dailymail.co.uk/news/article-12453081/Nevada-Rangers-Extinction-Rebellion-protest-activists-blocked-road-Burning-Man.html"
  },
  {
    "text": "Riley Gaines Wrecks Nebraska Democrat for Tone-Deaf Statement About Women's Sports  —  For a party that claims to be the women looking out for women, the Democrats sure are doing a lot to erase them in favor of some transgender agenda.  —  While you can see a demonstration a day … ",
    "url": "https://redstate.com/brandon_morse/2023/08/28/riley-gaines-wrecks-nebraska-democrat-for-tone-deaf-statement-about-womens-sports-n2163132"
  },
  {
    "text": "MAGA attorney gets three years after voter fraud conviction in Ohio  —  A Trump-supporting tax attorney in Shaker Heights, Ohio has been sentenced to three years for illegally voting twice, reported the Cleveland Scene.  —  This comes a week after the attorney, 53-year-old James Saunders, was convicted.",
    "url": "https://www.rawstory.com/voter-fraud-maga-attorney/"
  },
  {
    "text": "How the ‘urban doom loop’ could pose the next economic threat  —  A commercial real estate apocalypse — especially in midsize cities — could spiral into the broader economy  —  In Indianapolis, the technology giant Salesforce is paring back a quarter of its office space in the tallest building in Indiana … ",
    "url": "https://www.washingtonpost.com/business/2023/08/28/commercial-real-estate-economy-urban-doom-loop/"
  },
  {
    "text": "Journalism fails miserably at explaining what is really happening to America  —  They stood on an arena stage in Milwaukee under a massive sign that read “Democracy” — the metaphorical 800-pound gorilla that loomed over this strange political event but was never really discussed.",
    "url": "https://www.inquirer.com/opinion/commentary/media-2020-election-trump-authoritarianism-20230827.html"
  },
  {
    "text": "McCarthy starts to plot Biden impeachment strategy while GOP skeptics remain  —  House Speaker Kevin McCarthy and top Republicans have begun to strategize about how to move forward with an impeachment inquiry into President Joe Biden this fall - the latest sign that the House GOP is seriously laying … ",
    "url": "https://www.cnn.com/2023/08/28/politics/mccarthy-biden-impeachment-strategy/"
  }
]