[
  {
    "text": "Birthright Citizenship - A Response to Barnett and Wurman  —  In a recent New York Times op ed, legal scholars Randy Barnett and Ilan Wurman offer a partial defense of President Trump's executive order denying birthright citizenship to children of undocumented immigrants, and migrants in the US on temporary visas.",
    "url": "https://reason.com/volokh/2025/02/15/birthright-citizenship-a-response-to-barnett-and-wurman/"
  },
  {
    "text": "Trump Official Destroying USAID Secretly Met With Christian Nationalists Abroad in Defiance of U.S. Policy  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up to receive our biggest stories as soon as they're published.  —  Before Peter Marocco was selected … ",
    "url": "https://www.propublica.org/article/usaid-peter-marocco-state-department-bosnia-serbia-diplomacy-trump-foreign-policy"
  },
  {
    "text": "Justice Department fires multiple immigration judges amid case backlog  —  A union representing the judges said it “makes no sense” to make cuts to immigration courts as Trump promises to carry out mass deportations, which must go through the courts.  —  WASHINGTON — The Department … ",
    "url": "https://www.nbcnews.com/politics/justice-department/justice-department-fires-multiple-immigration-judges-case-backlog-rcna192365"
  },
  {
    "text": "Trump administration fires 20 immigration judges with no explanation  —  Courts are currently backlogged with 3.7m cases as US president demands more deportations  —  The Trump administration fired 20 immigration judges without explanation, a union official said on Saturday amid sweeping moves … ",
    "url": "https://www.theguardian.com/us-news/2025/feb/15/trump-administration-fires-immigration-judges"
  },
  {
    "text": "Trump Suggests No Laws Are Broken if He's ‘Saving His Country’  —  President Trump shared a quotation on social media, making it clear it was one he wanted people to absorb: “He who saves his Country does not violate any Law.”  —  President Trump on Saturday posted on social media … ",
    "url": "https://www.nytimes.com/2025/02/15/us/politics/trump-saves-country-quote.html?unlocked_article_code=1.xU4.tdxZ.LL3LjMZXrLPw"
  },
  {
    "text": "Trump Officials Attack a German Consensus on Nazis and Speech  —  Vice President JD Vance and Elon Musk have challenged decades-long approaches to political extremism that were designed to prevent another Hitler.  —  The American vice president visited a concentration camp on Thursday afternoon.",
    "url": "https://www.nytimes.com/2025/02/15/world/europe/vance-musk-nazis-afd-munich.html"
  },
  {
    "text": "ICE struggles to boost arrest numbers despite infusion of resources  —  Trump has ordered a wartime effort to increase deportations, but ICE statistics show arrests have dipped so far this month.  —  Since taking office, President Donald Trump has launched an all-of-government immigration crackdown … ",
    "url": "https://www.washingtonpost.com/immigration/2025/02/15/ice-arrests-immigration-deportations/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM5NTk1NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQwOTc3OTk5LCJpYXQiOjE3Mzk1OTU2MDAsImp0aSI6ImM0YzA0NjEyLWY0YTUtNGEzNi1hNDMxLTg3YmI1ZTQ1MTc4OSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9pbW1pZ3JhdGlvbi8yMDI1LzAyLzE1L2ljZS1hcnJlc3RzLWltbWlncmF0aW9uLWRlcG9ydGF0aW9ucy8ifQ.3Dr1GN4zhqE1TUP74Zj_Iw4b6kMqBFfSsqko4zTe0wo&itid=gfta"
  },
  {
    "text": "Hegseth's Bruising 72-Hour Debut Overseas  —  It was a crash course in geopolitical realities as the new defense secretary stepped onto the world stage.  —  Defense Secretary Pete Hegseth has had a rocky trip to Europe this week.  —  In his debut on the world stage, Mr. Hegseth told NATO … ",
    "url": "https://www.nytimes.com/2025/02/15/us/politics/hegseth-ukraine-russia.html"
  },
  {
    "text": "NAACP lists companies that dump DEI in its tactical spending guide for Black Americans  —  The NAACP wants Black Americans to steer their buying power toward companies that haven't pulled back from diversity, equity and inclusion programs under conservative pressure, and the nation's oldest … ",
    "url": "https://apnews.com/article/black-consumers-dei-buying-guide-naacp-34664d8af92e2dc1ba787a498348b7a4"
  },
  {
    "text": "Ed Department: DEI Violates Civil Rights Law  —  In a sweeping and unprecedented letter issued over the weekend, the Office for Civil Rights declared race-based scholarships, cultural centers and even graduation ceremonies illegal.  —  The Education Department's Office for Civil Rights declared … ",
    "url": "https://www.insidehighered.com/news/diversity/race-ethnicity/2025/02/15/trump-admin-threatens-rescind-federal-funds-over-dei"
  },
  {
    "text": "Musk accused Reuters of ‘social deception.’ The deception was his.  —  Trump's DOGE chief mischaracterizes a contract as he marshals “deep state” conspiracy theories to justify cuts to federal agencies.  —  The actor and director Ron Howard posted Wednesday on X an article … ",
    "url": "https://www.washingtonpost.com/technology/2025/02/15/musk-doge-deception-reuters/"
  },
  {
    "text": "US Forest Service and National Park Service to fire thousands of workers  —  Agencies say Trump's latest push to trim government could impede firefighting efforts and create crises at national parks  —  The US Forest Service is firing about 3,400 recent hires while the National Park Service … ",
    "url": "https://www.theguardian.com/us-news/2025/feb/15/us-forest-service-national-park-service-layoffs"
  },
  {
    "text": "Musk, Trump Establish New Era of Kleptocracy in America  —  A third dispatch comparing how the US media would cover this moment if it was happening overseas  —  American institutions, from the media to civil society to Congress and state capitals, continue to underreact to the unraveling of our democracy.",
    "url": "https://www.doomsdayscenario.co/p/musk-trump-establish-new-era-of-kleptocracy-in-america"
  },
  {
    "text": "Trump administration wants to un-fire nuclear safety workers but can't figure out how to reach them  —  The workers, whose agency oversees the nation's nuclear stockpile, had been fired on Thursday and lost access to their federal government email accounts.  —  WASHINGTON — National Nuclear … ",
    "url": "https://www.nbcnews.com/politics/national-security/trump-administration-wants-un-fire-nuclear-safety-workers-cant-figure-rcna192345"
  },
  {
    "text": "Musk and Trump are stopping the distribution of live-saving aid and firing anybody who tells the public about it  —  These people are just cartoonishly evil:  —  A new internal memo circulating inside the U.S. Agency for International Development neatly captures this split.",
    "url": "https://www.lawyersgunsmoneyblog.com/2025/02/musk-and-trump-are-stopping-the-distribution-of-live-saving-aid-and-firing-anybody-who-tells-the-public-about-it"
  },
  {
    "text": "European leaders to hold emergency summit on Ukraine as Trump-Putin call strains ties  —  British Prime Minister Keir Starmer is set to join European leaders at an emergency summit in Paris on Monday, Britain's PA media reported, after the relationship of the continent with Washington … ",
    "url": "https://www.cnn.com/2025/02/15/europe/europe-emergency-summit-ukraine-intl-latam"
  },
  {
    "text": "Home Builders Say Trump Tariffs Are Raising Construction Costs  —  Some developers describe an unpredictable climate that could drive up building costs and home prices.  —  Days after President Trump enacted 10 percent trade tariffs on all Chinese goods in early February … ",
    "url": "https://www.nytimes.com/2025/02/15/realestate/trump-tariffs-home-builders-construction.html"
  },
  {
    "text": "Internal DOGE documents lay out plans for ‘Phase 3’ to begin on Wednesday: report  —  According to the Department of Government Efficiency (DOGE) documents obtained by the Washington Post, Elon Musk's unofficial agency is set to launch what they have labeled as “Phase 3” of their drive to dismantle the government on Wednesday.",
    "url": "https://www.rawstory.com/doge-musk-government/"
  },
  {
    "text": "Top state Democrat calls on Adams to resign as party leaders convene for caucus weekend  —  Pressure is mounting on Gov. Kathy Hochul to remove Adams as thousands of Democrats gather in Albany for annual convention.  —  ALBANY, New York — Mayor Eric Adams didn't attend the annual caucus weekend in Albany … ",
    "url": "https://www.politico.com/news/2025/02/15/democrats-adams-new-york-00204540"
  },
  {
    "text": "Ahead of Workers' Union Vote, “Amazon Mobilized an Army”  —  Today 4,000 Amazon workers at a North Carolina warehouse will finish voting on a union.  Employees say the company “mobilized an army” ahead of the election, siccing local police on organizers and trying to pit black and Hispanic workers against each other.",
    "url": "https://jacobin.com/2025/02/amazon-union-north-carolina-racism/"
  },
  {
    "text": "Ramaswamy files campaign paperwork for anticipated Ohio governor bid  —  Former presidential candidate Vivek Ramaswamy has officially begun the process of running for governor of Ohio as he filed the necessary paperwork with the Ohio secretary of state on Friday.",
    "url": "https://thehill.com/homenews/5147700-ramaswamy-files-campaign-paperwork-for-anticipated-ohio-governor-bid/"
  },
  {
    "text": "‘Acting Like a King’: Michigan's Attorney General on the Lawsuit to Undo Musk's Damage  —  Dana Nessel explains the state-led effort to declare DOGE's actions null and void  —  Elon Musk and the so-called Department of Government Efficiency are operating unconstitutionally, and their actions must be reversed.",
    "url": "https://www.rollingstone.com/politics/politics-features/elon-musk-doge-lawsuit-dana-nessel-michigan-attorney-general-1235269515/"
  },
  {
    "text": "Trans migrant charged with raping 14-year-old boy in NYC bathroom  —  A migrant transgender woman wanted by federal immigration officials allegedly stalked and raped a boy in Manhattan this week, The Post has learned.  —  Nicol Suarez allegedly followed the 14-year-old into the bathroom … ",
    "url": "https://nypost.com/2025/02/15/us-news/trans-migrant-arrested-for-raping-boy-in-nyc-park-bathroom/"
  },
  {
    "text": "Trump promises to treat VAT systems like Europe's like a tariff … - The impact could be most immediate in the European Union, which has standardized value added taxes with an average rate of almost 22%. … - That follows a memo he issued Thursday, ordering trade officials … ",
    "url": "https://www.axios.com/2025/02/15/trump-vat-tariff-europe"
  },
  {
    "text": "Trump team to start Russia-Ukraine peace talks in Saudi Arabia  —  Negotiators from Kyiv will be joining the talks that launch in the coming days.  —  EXCLUSIVE … MUNICH — Senior Trump administration officials are heading to Saudi Arabia to start peace talks with Russian and Ukrainian negotiators … ",
    "url": "https://www.politico.eu/article/trump-team-to-start-russia-ukraine-peace-talks-saudi-arabia-putin-zelenskyy/"
  }
]