[
  {
    "text": "Exclusive: Early US intel assessment suggests strikes on Iran did not destroy nuclear sites, sources say  —  The US military strikes on three of Iran's nuclear facilities last weekend did not destroy the core components of the country's nuclear program and likely only set it back by months … ",
    "url": "https://cnn.com/2025/06/24/politics/intel-assessment-us-strikes-iran-nuclear-sites"
  },
  {
    "text": "Strike Set Back Iran's Nuclear Program by Only a Few Months, U.S. Report Says  —  Classified findings indicate that the attack sealed off the entrances to two facilities but did not collapse their underground buildings.  —  A preliminary classified U.S. report says the American bombing … ",
    "url": "https://www.nytimes.com/2025/06/24/us/politics/iran-nuclear-sites.html?unlocked_article_code=1.RU8.3ALC.LpnGMmyLfpyW&smid=url-share"
  },
  {
    "text": "Live Updates: Mamdani Holds Lead Over Cuomo in Democratic Primary for N.Y.C. Mayor  —  Zohran Mamdani, a 33-year-old state assemblyman, built a significant advantage over former Gov. Andrew Cuomo thanks to a strong showing in Brooklyn and Manhattan.  A winner might not be declared until ranked-choice ballots are tabulated next week.",
    "url": "https://www.nytimes.com/live/2025/06/24/nyregion/nyc-democratic-primary-election-mayor?unlocked_article_code=1.Rk8.JmS3.B_aryLPg6Yny&smid=url-share"
  },
  {
    "text": "Zohran Mamdani topples Andrew Cuomo in NYC mayoral race  —  The 33-year-old Democratic Socialist lawmaker outpaced the former governor, who has conceded, in a stunning primary, signaling generational change in the Democratic Party.  —  NEW YORK — Zohran Mamdani, a 33-year-old democratic socialist lawmaker … ",
    "url": "https://www.politico.com/news/2025/06/24/mamdani-leads-cuomo-nyc-mayor-race-00422363"
  },
  {
    "text": "Andrew Cuomo concedes to Zohran Mamdani in NYC mayoral primary  —  Former New York Gov. Andrew Cuomo conceded to state assemblyman Zohran Mamdani in New York City's Democratic mayoral primary on Tuesday night.  —  Why it matters: Mamdani, a 33-year-old democratic socialist … ",
    "url": "https://www.axios.com/2025/06/25/zohran-mamdani-new-york-city-primary-election-cuomo-concedes"
  },
  {
    "text": "‘Big Balls’ No Longer Works for the US Government  —  The technologist Edward Coristine, a key operative in Elon Musk's so-called Department of Government Efficiency who's gone by the name “Big Balls” online, has resigned, the White House tells WIRED.  —  Edward “Big Balls” Coristine … ",
    "url": "https://www.wired.com/story/big-balls-coristine-doge-resigned-us-government/"
  },
  {
    "text": "Edward Coristine, Key Player on Elon Musk's DOGE Team, Resigns  —  Edward Coristine, the 19-year-old who was hired by Elon Musk to help slash the government bureaucracy, became a public symbol of his team.  —  Edward Coristine, the 19-year-old high-profile operative for the Department … ",
    "url": "https://www.nytimes.com/2025/06/24/us/politics/big-balls-edward-coristine-musk-doge.html"
  },
  {
    "text": "Trump Complains Biden Let Thunderstorms Into the U.S.  —  FORCE OF NATURE  —  The president made an embarrassing flub aboard Air Force One while en route to a summit where he will discuss mounting global instability with other NATO leaders.  —  President Donald Trump got a little tongue-tied speaking … ",
    "url": "https://www.thedailybeast.com/trump-complains-joe-biden-let-thunderstorms-into-the-united-states/"
  },
  {
    "text": "Devastating Poll Shows Trump What Americans Think of His Bombings  —  REALITY CHECK  —  The president launched a tirade against CNN right after the poll aired.  —  A bombshell CNN poll found that a clear majority of Americans disapprove of President Trump's decision to launch airstrikes in Iran.",
    "url": "https://www.thedailybeast.com/devastating-poll-shows-trump-what-americans-think-of-his-bombings/"
  },
  {
    "text": "The National Archives at College Park, Maryland  —  We hold permanent records created by Federal agencies that include:  — Textual records from civilian agencies  — Army unit records dating from WW1  — Navy unit records dating from WW2  — Berlin Documents Center microfilm",
    "url": "https://www.archives.gov/college-park"
  },
  {
    "text": "Justice Dept. Leader Suggested Violating Court Orders, Whistle-Blower Says  —  Emil Bove III, a Trump judicial nominee, voiced his intent to disobey court orders as others stonewalled and misled judges, according to a complaint.  —  A senior Justice Department official, Emil Bove III … ",
    "url": "https://www.nytimes.com/2025/06/24/us/politics/justice-department-emil-bove-trump-deportations-reuveni.html?unlocked_article_code=1.RU8.o_g5.739ROt8Cpqgp&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Thomas Massie Tells Theo Von U.S. Gets ‘a Lot of Countries That Hate Us’ in Exchange for Support for Israel  —  Rep. Thomas Massie (R-KY) told podcaster and comedian Theo Von that the United States gets “a lot of countries that hate us” in exchange for its support of Israel.",
    "url": "https://www.mediaite.com/media/podcasts/thomas-massie-tells-theo-von-u-s-gets-a-lot-of-countries-that-hate-us-in-exchange-for-support-for-israel/"
  },
  {
    "text": "House GOP moderates tell leadership they won't back Senate tax bill over Medicaid cuts  —  More than a dozen House Republicans warned they won't support the Senate's version of the tax and spending bill because the proposed Medicaid cuts are too steep.  —  Led by Rep. David Valadao (R-Calif.) … ",
    "url": "https://thehill.com/policy/healthcare/5367133-house-gop-moderates-senate-tax-bill-medicaid-cuts/"
  },
  {
    "text": "This Is the Worst Supreme Court Decision of Trump's Second Term  —  On Monday, the Supreme Court lifted an injunction that had protected immigrants from removal to dangerous countries where they could face torture and death.  The Trump administration argues that it can expel immigrants to … ",
    "url": "https://slate.com/news-and-politics/2025/06/worst-supreme-court-decision-trump-second-term.html"
  },
  {
    "text": "Democrat tells RFK Jr.: ‘You lied to Sen. Cassidy’  —  Rep. Kim Schrier (D-Wash.) accused Health and Human Services Secretary Robert F. Kennedy Jr. of lying to Sen. Bill Cassidy (R-La.) when he told the senator he would maintain a key federal vaccine advisory committee “without changes.”",
    "url": "https://thehill.com/policy/healthcare/5366537-schrier-rfk-jr-cassidy-vaccines-health-hearing/"
  },
  {
    "text": "Donald Trump Nobel Peace Prize Nomination Withdrawn  —  A senior Ukrainian lawmaker who nominated U.S. President Donald Trump for a Nobel Peace Prize has withdrawn it, as peace talks between Kyiv and Moscow slip under the radar and the president keeps his sights fixed on the Middle East.",
    "url": "https://www.newsweek.com/donald-trump-nobel-peace-prize-nomination-withdrawn-ukraine-russia-2089818"
  },
  {
    "text": "Neera Tanden testifies in Biden mental acuity probe  —  Neera Tanden, the former director of President Joe Biden's Domestic Policy Council, testified Tuesday as part of the House Oversight Committee's investigation into Biden's mental acuity while in office.",
    "url": "https://www.politico.com/live-updates/2025/06/24/congress/tanden-biden-mental-oversight-00421656"
  },
  {
    "text": "Mike Johnson says War Powers Act is unconstitutional  —  Speaker Mike Johnson (R-La.) on Tuesday asserted that the War Powers Act is unconstitutional, pushing back forcefully against the lawmakers in both parties who are invoking the law in an effort to block President Trump from further military action in Iran.",
    "url": "https://thehill.com/homenews/house/5367102-speaker-johnson-war-powers-act/"
  },
  {
    "text": "Masked Terror  —  At this point, we have all seen the videos.  Men dressed in plaid shirts, jeans and boots descending on constructions sites, chasing migrants in fields, lurking in courthouse hallways at courthouses, knocking on doors of homes, and surrounding cars.  We see them wrestling men and women to the ground.",
    "url": "https://sherrilyn.substack.com/p/masked-terror"
  },
  {
    "text": "Guardsmen sent to LA are 130 miles east of the city doing drug busts  —  California National Guard soldiers operating under federal orders helped the Drug Enforcement Agency and other federal personnel carry out a raid on a large marijuana growth operation in the eastern Coachella Valley last week, 130 miles from downtown Los Angeles.",
    "url": "https://taskandpurpose.com/news/national-guard-drug-busts-la-area/"
  },
  {
    "text": "Toys are getting pricier as tariffs kick in  —  Toy and game prices jumped by a record amount in May. The industry, which relies heavily on China, has been hit hard by new import taxes.  —  Summary99  —  Toy prices are rising at their fastest pace on record, the result of stiff new tariffs … ",
    "url": "https://www.washingtonpost.com/business/2025/06/24/toy-prices-tariffs-inflation/"
  },
  {
    "text": "Disgusting  —  Don't pour yourself a whiskey and get too comfortable, settling in for protracted Slack Tide goodness.  This isn't a real piece, where I tap dance and dazzle you with wordplay, as is our custom around these parts.  It's just a short, blunt, angry cry.",
    "url": "https://mattlabash.substack.com/p/disgusting"
  },
  {
    "text": "Stephen Miller Has Financial Stake in Company Helping ICE With Deportations: Report  —  The president's chief immigration hawk has a substantial amount of stock in Palantir, one of ICE's most prominent contractors … According to ethics disclosure reports released by the White House … ",
    "url": "https://www.rollingstone.com/politics/politics-news/stephen-miller-financial-stake-palantir-ice-contractor-1235371343/"
  },
  {
    "text": "‘Who are these people?’  Masked immigration agents challenge local police, sow fear in L.A.  —  Increasingly aggressive immigration raids carried out by masked federal agents, sometimes using unmarked vehicles, are creating problems for local law enforcement agencies.",
    "url": "https://www.latimes.com/california/story/2025-06-24/masked-immigration-agents-local-law-enforcement-tension"
  }
]