[
  {
    "text": "Can the GOP ever come to grips with the lies of 2020?  —  Mike Johnson's election, and the process getting there, showed a party not willing to address the fundamental question facing it.  —  Rep. Mike Johnson (R-La.) was hours away from winning the speakership when a reporter asked … ",
    "url": "https://www.politico.com/news/2023/10/26/donald-trump-january-6-mike-johnson-00123714"
  },
  {
    "text": "Chris Christie on What Mark Meadows Immunity Deal Means for Trump: ‘The Walls Are Closing In Around Him’  —  Republican presidential candidate Chris Christie determined that Mark Meadows' cooperation with special counsel Jack Smith represents a major blow to Donald Trump in his election interference case.",
    "url": "https://www.mediaite.com/politics/chris-christie-on-what-mark-meadows-immunity-deal-means-for-trump-the-walls-are-closing-in-around-him/"
  },
  {
    "text": "Colo. judge rejects Trump's bid to toss lawsuit aimed at keeping him off 2024 ballot  —  The lawsuit seeks to bar the former president from the state's 2024 ballot over his connection to the Jan. 6, 2021, riot at the U.S. Capitol.  —  A Colorado judge on Wednesday denied the latest attempt … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/colo-judge-rejects-trumps-bid-toss-lawsuit-aimed-keeping-2024-ballot-rcna122281"
  },
  {
    "text": "Before Mike Johnson Was Speaker, He Was Blaming Abortion for School Shootings  —  What is it about Representative Mike Johnson that ended Republicans' spasms of disunity, electing him Speaker of the House on Wednesday?  The initial response was befuddlement, a collective who?",
    "url": "https://nymag.com/intelligencer/2023/10/mike-johnson-abortion-school-shootings.html"
  },
  {
    "text": "Here's Why Mike Johnson Is More Dangerous Than Donald Trump  —  The former president only cares about himself.  The new Speaker of the House actually wants to make America a Christian theocracy. … The most dangerous movement in American politics today is not Trumpism.  It is Christofascism.",
    "url": "https://www.thedailybeast.com/heres-why-mike-johnson-is-more-dangerous-than-donald-trump"
  },
  {
    "text": "Republican Speaker Nominee Mike Johnson Has a Plan to Avoid a November Shutdown  —  House Republican speaker nominee Mike Johnson is working to convince ultraconservatives to avert a Nov. 18 government shutdown, a signal that even hardliners in the GOP may be willing to compromise on a short-term spending deal.",
    "url": "https://www.bloomberg.com/news/articles/2023-10-25/gop-speaker-nominee-johnson-has-plan-to-avoid-november-shutdown"
  },
  {
    "text": "Family Reveals Suspected Gunman's Link to Maine Massacre Sites  —  “He just has to reach out and do the right thing,” Robert Card's sister-in-law told The Daily Beast. … The family of Robert Card—who is suspected of killing 18 people in double mass shootings in Maine on Wednesday night … ",
    "url": "https://www.thedailybeast.com/family-reveals-suspected-gunman-robert-cards-link-to-maine-massacre-sites"
  },
  {
    "text": "Robert Card: What we know about Maine shooting person of interest  —  Maine police have identified a person of interest in the mass shootings across the state Wednesday night that left at least 18 dead and dozens injured.  —  The Lewiston Maine Police Department identified 40-year-old Robert Card as a … ",
    "url": "https://www.washingtonexaminer.com/news/robert-card-maine-shooting-person-of-interest"
  },
  {
    "text": "DeSantis sending drones, weapons, ammunition to Israel  —  Florida Gov. Ron DeSantis (R) has sent drones, weapons and ammunition to Israel to support its war against Hamas, a move that bolsters his pro-Israel stance in the battle for the GOP presidential nomination.",
    "url": "https://thehill.com/homenews/campaign/4277339-desantis-sending-drones-weapons-ammunition-to-israel/"
  },
  {
    "text": "Senate Voted to Let Vets With Mental Issues Keep Guns Hours Before Maine Shooting  —  Five senators who caucus with Democrats joined Republicans in voting to adopt the amendment  —  ROBERT CARD, AN Army reservist with a history of mental health issues, is suspected of killing at least 18 people … ",
    "url": "https://www.rollingstone.com/politics/politics-news/senate-adopts-amendment-veterans-mental-issues-guns-1234863402/"
  },
  {
    "text": "At least 16 dead, dozens wounded in Lewiston shootings; police give few details on overnight search for gunman  —  A commercial man lift falls off trailer and blocks Route 4 in Rangeley  —  Hundreds of new laws take effect in Maine Wednesday.  Here's what you need to know",
    "url": "https://www.sunjournal.com/2023/10/25/multiple-victims-reported-following-shootings-in-lewiston/"
  },
  {
    "text": "The inmates elect their new asylum leader  —  Also: Bellingcat's Eliot Higgins on the golden age of Twitter disinformation.  —  ∙ Paid … The latter part of this newsletter features a Q&A with Bellingcat's Eliot Higgins.  But before we get to that, I want to share some quick thoughts on the new House speaker.",
    "url": "https://www.publicnotice.co/p/speaker-maga-mike-johnson-explained"
  },
  {
    "text": "U.S., Qatar to revisit Doha's ties to Hamas after Gaza hostage crisis  —  The agreement strives to balance the Biden administration's goal of rescuing as many captives as possible with its desire to isolate the militants after their rampage in Israel  —  The United States and Qatar have agreed … ",
    "url": "https://www.washingtonpost.com/national-security/2023/10/26/qatar-hamas-hostage-negotiations/"
  },
  {
    "text": "New York Republicans Offer Motion to Expel George Santos From Congress  —  His fellow New York Republicans in Congress have seen enough.  They want him gone.  —  New York Republicans have finally had enough of Rep. George Santos (R-NY).  —  A group of GOP lawmakers from the state started … ",
    "url": "https://www.thedailybeast.com/new-york-republicans-offer-motion-to-expel-george-santos-from-congress"
  },
  {
    "text": "Thomas lawyer disputes Senate Democrats' claim on loan forgiveness  —  An attorney for Supreme Court Justice Clarence Thomas is disputing Senate Democrats' claim that his client did not pay back a “significant portion” of a loan used to purchase a luxury motorcoach.",
    "url": "https://thehill.com/regulation/court-battles/4277075-thomas-lawyer-disputes-senate-democrats-claim-on-loan-forgiveness/"
  },
  {
    "text": "Numerous verified X accounts are claiming that the Maine mass shootings were a “false flag”  —  When X (formerly Twitter) owner Elon Musk changed his platform's verification system, he ushered in a new reality where fringe conspiracy theorists could easily promote false claims about breaking news.",
    "url": "https://www.mediamatters.org/twitter/numerous-verified-x-accounts-are-claiming-maine-mass-shootings-were-false-flag"
  },
  {
    "text": "Charlottesville's Lee statue meets its end, in a 2,250-degree furnace  —  Melted down in secret, the divisive Confederate monument will be turned into a new piece of public art … SOMEWHERE IN THE U.S. SOUTH — It was a choice to melt down Robert E. Lee.  But it would have been a choice to keep him intact, too.",
    "url": "https://www.washingtonpost.com/dc-md-va/interactive/2023/civil-war-monument-melting-robert-e-lee-confederate/"
  }
]