[
  {
    "text": "Wayne LaPierre announces resignation as NRA chief  —  FIRST ON FOX: Longtime National Rifle Association (NRA) chief Wayne LaPierre on Friday announced his resignation, Fox News Digital has learned.  —  “With pride in all that we have accomplished, I am announcing my resignation from the NRA … ",
    "url": "https://www.foxnews.com/politics/wayne-lapierre-announces-resignation-nra-chief"
  },
  {
    "text": "Wayne LaPierre Resigns From N.R.A. With Trial Set to Open  —  The resignation of Mr. LaPierre, the National Rifle Association's longtime leader, came as he faced a corruption trial in Manhattan.  —  On the eve of a legal battle in New York, Wayne LaPierre told board members on Friday … ",
    "url": "https://www.nytimes.com/2024/01/05/nyregion/wayne-lapierre-resigns-nra.html"
  },
  {
    "text": "Wayne LaPierre resigns as NRA head  —  National Rifle Association (NRA) head Wayne LaPierre will resign from the organization at the end of the month, the group announced Friday.  —  LaPierre's resignation, first r e ported by Fox News, comes as the organization defends itself … ",
    "url": "https://thehill.com/business/4391519-wayne-lapierre-resigns-nra/"
  },
  {
    "text": "NRA Chief Wayne LaPierre to Step Down  —  The gun-rights group's longtime leader is resigning days before the start of his civil corruption trial  —  Wayne LaPierre, the embattled longtime leader of the National Rifle Association, is resigning from the nation's largest gun-rights group … ",
    "url": "https://www.wsj.com/us-news/law/nra-chief-wayne-lapierre-to-step-down-e282083e?mod=followamazon"
  },
  {
    "text": "Trump Shares New Ad: ‘God Made Trump’  —  The ad, which has a run-time of two minutes and 44 seconds, alleges that God created the former president for the purpose of leading the nation  —  “God Made Trump,” a new nearly three minute ad from former President Donald Trump's campaign claims.",
    "url": "https://themessenger.com/politics/trump-shares-new-ad-god-made-trump"
  },
  {
    "text": "'These people know what they're doing': Why Trump is attacking Haley in NH  —  What if it is closer than expected in the Granite state?  —  Donald Trump may be up by 20 percentage points in New Hampshire, but he and his team have moved swiftly to cut down any opponent they see rising.",
    "url": "https://www.politico.com/news/2024/01/05/trump-is-attacking-haley-in-nh-his-real-problem-is-the-expectations-game-00133929"
  },
  {
    "text": "If Trump Is Not an Insurrectionist, What Is He?  —  Last month the states of Colorado and Maine moved to disqualify Donald Trump as a candidate in the 2024 presidential election, citing Section 3 of the 14th Amendment.  In response, Trump has asked the Supreme Court to intervene on his behalf … ",
    "url": "https://www.nytimes.com/2024/01/05/opinion/trump-insurrections-disqualification-14th-amendment.html"
  },
  {
    "text": "Trump attorney says Kavanaugh will ‘step up’ in ballot cases  —  An attorney for former President Trump, Alina Habba, said late Thursday that she has faith in the Supreme Court and believes that Justice Brett Kavanaugh will “step up” in Trump's ballot cases in Maine and Colorado.",
    "url": "https://thehill.com/homenews/campaign/4390774-trump-attorney-kavanaugh-will-step-up-ballot-cases/"
  },
  {
    "text": "What January 6 Made Clear to Me  —  Our democratic institutions are only as strong as the courage of those entrusted with their care.  —  The sixth of january is the date prescribed in United States law for Congress to count the electoral votes in the presidential election.",
    "url": "https://www.theatlantic.com/ideas/archive/2024/01/three-years-after-january-6-capitol-insurrection-trump/677024/"
  },
  {
    "text": "N.Y. AG calls for $370 million fine against Trump and lifetime ban from real estate industry  —  Attorneys from James's office requested the punishment in post-trial motions filed Friday in the Trump fraud case.  —  New York Attorney General Letitia James is calling for a $370 million fine … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/ny-ag-calls-370-million-fine-trump-lifetime-ban-real-estate-industry-rcna132540"
  },
  {
    "text": "The White House's tense podium battle  —  They share a podium — and a mutual frustration.  White House press secretary Karine Jean-Pierre and the National Security Council's John Kirby frequently split the podium at media briefings, but behind the scenes their relationship is fraught with tension, White House sources tell Axios.",
    "url": "https://www.axios.com/2024/01/05/white-house-press-secretary-jean-pierre-kirby-tension"
  },
  {
    "text": "CDC map shows dramatic increase in illness nationwide: See where it's worst  —  (NEXSTAR) - What a difference a week can make.  New data released by the Centers for Disease Control and Prevention Friday shows an 18% jump in people testing positive for influenza last week.",
    "url": "https://thehill.com/homenews/nexstar_media_wire/4391183-cdc-map-shows-dramatic-increase-in-illness-nationwide-see-where-its-worst/"
  },
  {
    "text": "Why this jobs report matters  —  Editor's note: Morning Money is a free version of POLITICO Pro Financial Services morning newsletter, which is delivered to our subscribers each morning at 5:15 a.m. The POLITICO Pro platform combines the news you need with tools you can use to take action on the day's biggest stories.",
    "url": "https://www.politico.com/newsletters/morning-money/2024/01/05/why-this-jobs-report-matters-00133966"
  },
  {
    "text": "FDA Authorizes Florida's Drug Importation Program  —  For Immediate Release:  —  Today, the U.S. Food and Drug Administration authorized Florida's Agency for Health Care Administration's drug importation program under section 804 of the Federal Food, Drug, and Cosmetic Act (FD&C Act).",
    "url": "https://www.fda.gov/news-events/press-announcements/fda-authorizes-floridas-drug-importation-program"
  },
  {
    "text": "Trump's China Scandal Is Way Worse Than What Biden Is Getting Impeached Over … House Democrats have produced a report showing that, during his presidency, Donald Trump accepted $7.8 million from foreign countries, most of which were from China.  This serves as another illustration … ",
    "url": "https://nymag.com/intelligencer/2024/01/biden-getting-impeached-for-less-than-trumps-china-scandal.html"
  },
  {
    "text": "Scalise to work remotely until February as he recovers from cancer treatment … - “Once the procedure is completed, he will be recovering under the supervision of his medical team and will work remotely until returning to Washington next month.” … He said in a statement at the time the disease … ",
    "url": "https://www.axios.com/2024/01/05/scalise-work-remotely-cancer-treatment"
  },
  {
    "text": "Court says even passive members of Jan. 6 mob can be convicted of disorderly conduct  —  The decision is a victory for the Justice Department on one of the most common charges lodged against Jan. 6 defendants.  —  A federal appeals court ruled Friday that Jan. 6 defendants can be found culpable of … ",
    "url": "https://www.politico.com/news/2024/01/05/court-says-even-passive-members-of-jan-6-mob-can-be-convicted-of-disorderly-conduct-00134030"
  },
  {
    "text": "U.S. Moves Closer to Filing Sweeping Antitrust Case Against Apple  —  Justice Department officials are in the late stages of investigating the iPhone maker, focusing on how Apple has used its other products and services to defend against threats to its core business.",
    "url": "https://www.nytimes.com/2024/01/05/technology/antitrust-apple-lawsuit-us.html"
  },
  {
    "text": "Florida ready to follow Ohio and secure abortion rights  —  A measure has reached the threshold to qualify for this year's ballot.  —  TALLAHASSEE, Florida — Florida abortion rights advocates, who have seen access to the procedure erode in the state and nationally in recent years … ",
    "url": "https://www.politico.com/news/2024/01/05/florida-abortion-rights-amendment-00133938"
  },
  {
    "text": "Ramaswamy wants the US out of NATO  —  It's the furthest any presidential candidate has gone on potentially severing America's decadeslong role in the storied alliance.  —  Republican candidate Vivek Ramaswamy has told multiple people he would withdraw the U.S. from NATO as president … ",
    "url": "https://www.politico.com/news/2024/01/05/ramaswamy-wants-the-us-out-of-nato-00134068"
  },
  {
    "text": "Billionaire Mark Cuban Fires Back at Bill Ackman Over Diversity at Harvard  —  Cuban disputes Ackman's 4,000-word screed against diversity, equity, and inclusion initiatives.  —  In the wake of Claudine Gay's resignation as president of Harvard, billionaire investor Bill Ackman posted … ",
    "url": "https://www.thedailybeast.com/billionaire-mark-cuban-fires-back-at-bill-ackman-over-diversity-at-harvard"
  }
]