[
  {
    "text": "EXCLUSIVE: Trump's Day One Executive Order on ‘Male and Female’  —  The White House strikes out at gender ideology and pronouns.  Also: ends housing of biological men in women's prisons; self-ID on passports; and more.  —  Toward the end of the 2024 presidential campaign … ",
    "url": "https://www.thefp.com/p/trumps-day-one-executive-order-male-female-gender-ideology-pronouns"
  },
  {
    "text": "‘Disgrace’: Pope Francis revives feud with Trump just before inauguration  —  Pope Francis blasted Donald Trump's plans to deport millions of undocumented immigrants, calling the United States president-elect's proposal a “disgrace.”  —  “If true, this will be a disgrace … ",
    "url": "https://www.politico.eu/article/pope-francis-reviive-feud-donald-trumps-mass-deportation-plan-disgrace/"
  },
  {
    "text": "Trump's honeymoon won't last  —  This is a very bleak moment for the United States and the world.  —  Donald Trump takes office today promising to immediately start in on a litany of human rights abuses and other efforts to harm marginalized people.  He's promised a sweeping assault … ",
    "url": "https://www.publicnotice.co/p/trump-inauguration-honeymoon-will-not-last"
  },
  {
    "text": "Trump to Call for ‘Revolution of Common Sense’ in Inaugural Address  —  In his speech, excerpts of which were shared with The Wall Street Journal, the incoming president will proclaim a ‘new era of national success’  —  WASHINGTON—President-elect Donald Trump will call for a … ",
    "url": "https://www.wsj.com/politics/trump-to-call-for-revolution-of-common-sense-in-inaugural-address-a6d94c59"
  },
  {
    "text": "Trump to take more than 200 executive actions on day one  —  EXCLUSIVE: President-elect Trump will sign more than 200 executive actions on Inauguration Day—a massive, first wave of policy priorities focused on border security, energy, reducing the cost of living for American families … ",
    "url": "https://www.foxnews.com/politics/trump-take-more-than-200-executive-actions-day-one"
  },
  {
    "text": "Live Updates: Trump Plans to Sign ‘Close to 100’ Executive Orders  —  Once inaugurated, President Trump plans to sharply redirect federal policy on immigration, the federal work force, energy and the environment, the economy and trade, gender issues and diversity, equity and inclusion programs.",
    "url": "https://www.nytimes.com/live/2025/01/20/us/trump-executive-orders"
  },
  {
    "text": "Biden in Final Hours Pardons Cheney, Fauci and Milley to Thwart Reprisals  —  Acting on the day he leaves office, President Biden used his executive clemency power to protect people targeted by his incoming successor, Donald J. Trump, who has vowed “retribution.”",
    "url": "https://www.nytimes.com/2025/01/20/us/politics/biden-pardons-fauci-milley-cheney-jan-6.html"
  },
  {
    "text": "Biden pardons Fauci and Milley in an effort to guard against potential ‘revenge’ by Trump  —  President Joe Biden on Monday pardoned Dr. Anthony Fauci, retired Gen. Mark Milley and members of the House committee that investigated the Jan. 6 attack on the Capitol, in an extraordinary use … ",
    "url": "https://apnews.com/article/biden-trump-fauci-milley-pardons-january-6-3cba287f89051513fb48d7ae700ae747"
  },
  {
    "text": "Statement from President Joe Biden  —  Our nation relies on dedicated, selfless public servants every day.  They are the lifeblood of our democracy.  —  Yet alarmingly, public servants have been subjected to ongoing threats and intimidation for faithfully discharging their duties.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2025/01/20/statement-from-president-joe-biden-15/"
  },
  {
    "text": "Gen. Mark Milley ‘deeply grateful’ for Biden pardon on morning of Trump's inauguration  —  Former Joint Chiefs chairman clashed with Trump over Constitution  —  WASHINGTON − The former top officer of the U.S. military said he was “deeply grateful” to receive a preemptive pardon from outgoing President Joe Biden Monday.",
    "url": "https://www.usatoday.com/story/news/politics/elections/2025/01/20/gen-mark-milley-grateful-for-biden-pardon/77835231007/"
  },
  {
    "text": "Elon Musk's DOGE to be sued within minutes of Trump inauguration  —  The legal status of Musk's government waste panel will be challenged in federal court almost as soon as the president-elect is sworn in.",
    "url": "https://www.washingtonpost.com/business/2025/01/20/doge-trump-musk-ramaswamy/"
  },
  {
    "text": "Vivek Ramaswamy expected to depart DOGE  —  Vivek Ramaswamy, President-elect Donald Trump's choice to co-lead the Department of Government Efficiency (DOGE) with entrepreneur Elon Musk, is expected to soon step away from the task force, CBS News has learned.",
    "url": "https://www.cbsnews.com/news/vivek-ramaswamy-expected-to-depart-doge/"
  },
  {
    "text": "Cecile Richards, former Planned Parenthood president and feminist activist, has died  —  Richards died Monday of an aggressive brain cancer.  She was 67.  —  Cecile Richards, the former president of Planned Parenthood and feminist activist, died Monday of an aggressive brain cancer, her family confirmed in a statement.",
    "url": "https://19thnews.org/2025/01/cecile-richards-former-planned-parenthood-president-and-feminist-activist-has-died/"
  },
  {
    "text": "It's ‘Just Begun’—Trump Meme Coin Suddenly Crashes Back As Melania Coin Shock Hits Crypto  —  Crypto markets have been rocked by the launch of an “official” Donald Trump memecoin this weekend—with traders braced for more mayhem this coming week.  —  Unlock over $3,000 in NFT, web3 and crypto perks — Apply now!",
    "url": "https://www.forbes.com/sites/digital-assets/2025/01/19/its-just-begun-trump-meme-coin-suddenly-crashes-back-as-melania-coin-shock-hits-crypto/"
  },
  {
    "text": "Heather Cox Richardson & Jen Rubin in conversation  —  Two of the boldest, most powerful voices of our time—a historian and a journalist—discuss the precedent for arriving at this day and where we go from here  —  Heather Cox Richardson is a professor of American history and a prolific author.",
    "url": "https://contrarian.substack.com/p/heather-cox-richardson-and-jen-rubin"
  },
  {
    "text": "Trump Plans to Declare National Emergency at US Border  — Trump seeks to end birthright citizenship, asylum program  — New administration will also target refugee admissions  —  President-elect Donald Trump is planning sweeping new executive actions designed to crack … ",
    "url": "https://www.bloomberg.com/news/articles/2025-01-20/trump-plans-sweeping-executive-action-designed-to-close-border"
  },
  {
    "text": "Scores of career State Dept. diplomats resign before Trump's inauguration  —  Trump's team requested the high-level resignations as the president-elect prepares a sharp break with the Biden administration.  —  Scores of senior career diplomats are resigning from the State Department effective … ",
    "url": "https://www.washingtonpost.com/national-security/2025/01/19/trump-state-department-resignations/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM3MjYyODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM4NjQ1MTk5LCJpYXQiOjE3MzcyNjI4MDAsImp0aSI6IjA3ZjJkZjU3LWRkODktNDFmMC1hMzc3LWVmN2IyN2ZmMzRmNyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb25hbC1zZWN1cml0eS8yMDI1LzAxLzE5L3RydW1wLXN0YXRlLWRlcGFydG1lbnQtcmVzaWduYXRpb25zLyJ9.F2w85PZoKMacD_JnaSMCeRKPTHY3NCBuVGx8blr8zTE&itid=gfta"
  }
]