[
  {
    "text": "Sen. Mark Warner seeks to assemble group of Democratic senators to ask Biden to exit race  —  There's increasing sentiment among Democratic senators that Biden cannot stay in the race.  —  Sen. Mark R. Warner (D-Va.) is attempting to assemble a group of Democratic senators to ask Joe Biden … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/05/mark-warner-joe-biden-exit-race-democratic-senators/"
  },
  {
    "text": "‘Exhausted,’ ‘bad episode’: Biden doubles down on debate explanations in ABC News exclusive  —  : Speaking with George Stephanopoulos, he dismissed concerns about mental fitness.  —  President Joe Biden speaks with George Stephanopoulus on July 5, 2024, in an ABC News exclusive.",
    "url": "https://abcnews.go.com/Politics/exhausted-bad-episode-biden-doubles-debate-explanations-abc/story?id=111695168"
  },
  {
    "text": "ABC's George Stephanopoulos' exclusive interview with President Biden: Full transcript  —  Full transcript of the ABC News exclusive interview with President Joe Biden.  —  President Joe Biden speaks with George Stephanopoulos on July 5, 2024, in an ABC News exclusive.",
    "url": "https://abcnews.go.com/Politics/abc-news-anchor-george-stephanopoulos-exclusive-interview-biden/story?id=111695695"
  },
  {
    "text": "Jeffries Plans to Meet Virtually With Top House Democrats on Biden's Path Ahead  —  The House minority leader scheduled a virtual meeting for Sunday.  —  Representative Hakeem Jeffries, Democrat of New York and the minority leader, has scheduled a virtual meeting on Sunday with senior House Democrats … ",
    "url": "https://www.nytimes.com/2024/07/05/us/politics/hakeem-jeffries-biden-democrats.html"
  },
  {
    "text": "Biden refuses cognitive test, denies he's losing to Trump  —  President Biden tonight flatly ruled out taking a cognitive test or submitting to an independent medical examination to determine if he has any nuerologial conditions, insisting he had the energy and ability to run for president and defeat former President Trump.",
    "url": "https://www.axios.com/2024/07/06/abc-biden-cognitive-test-denies-polls"
  },
  {
    "text": "Biden at peace if he loses to Trump: “As long as I gave it my all” … - Many Democrats believe Biden has been an excellent president — but that his refusal to give up power at his advantaged age could risk throwing the country into turmoil after November's election.",
    "url": "https://www.axios.com/2024/07/06/biden-abc-interview-trump-election-peace"
  },
  {
    "text": "Behind the Curtain: Biden's credibility crisis … Some top Democrats told us Biden made matters worse Friday with his ABC interview, where he denied bad poll numbers and widespread Democratic panic.  — “All the pollsters I talk to tell me it's a tossup,” Biden told George Stephanopoulos.",
    "url": "https://www.axios.com/2024/07/06/biden-abc-interview-democrats-support"
  },
  {
    "text": "Healey, a top Biden ally, urges him to consider dropping out of the race  —  “The best way forward right now is a decision for the President to make,” she says.  —  BOSTON — One of Joe Biden's high-profile campaign surrogates is publicly urging him to consider exiting the presidential race.",
    "url": "https://www.politico.com/news/2024/07/05/maura-healey-biden-debate-consider-dropping-out-00166654"
  },
  {
    "text": "Warner organizing discussion for Senate Democrats to assess Biden's path forward  —  Sen. Mark Warner (D-Va.) has approached Senate Democrats to organize a discussion on Joe Biden's path forward as the party's presidential nominee, according to a source familiar.",
    "url": "https://www.politico.com/live-updates/2024/07/05/congress/warners-monday-meeting-senate-democrats-biden-election-00166679"
  },
  {
    "text": "Some of Biden's Upcoming Fund-Raising Events Face New Uncertainty  —  Plans for a late July fund-raiser in Wisconsin are now off, and it's unclear whether another event in Texas will proceed, following President Biden's disastrous debate performance.  —  Some of President Biden's fund-raising events … ",
    "url": "https://www.nytimes.com/2024/07/05/us/politics/biden-fund-raising-campaign.html"
  },
  {
    "text": "ABC interview proves that Joe Biden is in complete senile denial  —  George Stephanopoulos, former Bill Clinton adviser and the ultimate Democratic insider, held an intervention masquerading as an interview Friday night.  —  Rather than ask tough questions about President Biden's mental deficiencies … ",
    "url": "https://nypost.com/2024/07/05/opinion/abc-interview-proves-that-joe-biden-is-in-complete-senile-denial/"
  },
  {
    "text": "Trump torches Heritage Foundation's Project 2025 … - Trump's disavowal comes two days after Heritage Foundation president Kevin Roberts drew outrage from Democrats with his comments about a “second American Revolution” on Steve Bannon's radio show.  — “[W]e are in the process … ",
    "url": "https://www.axios.com/2024/07/05/trump-project-2025-heritage-foundation"
  },
  {
    "text": "Trump Jumps on Immunity Ruling to Ask Favorite Judge to Gut Secrets Case  —  WORTH A SHOT  —  Trump's attorneys asked Judge Aileen Cannon to lay out a new schedule so they can pounce on the Supreme Court's decision.  —  Donald Trump seized on the Supreme Court's presidential immunity ruling Friday … ",
    "url": "https://www.thedailybeast.com/trump-jumps-on-immunity-ruling-to-ask-favorite-judge-to-gut-secrets-case"
  },
  {
    "text": "Whoever the Democratic Candidate Is, Americans Have Already Lost  —  I watched the debate from a pub in Ireland.  A man sitting next to me pegged me for a Yank.  “Sorry about all that — screwed no matter what you do,” he said before the final minutes of the debate ended.",
    "url": "https://www.nytimes.com/2024/07/06/opinion/biden-debate-scotus-immunity.html"
  },
  {
    "text": "A ‘scared’ Biden aide sounds an alarm  —  The Scoop  —  Midday on the Fourth of July, I received a call from a government official with regular access to the West Wing, who said they had reached a breaking point and wanted to sound the alarm.  —  The person insisted on careful ground rules … ",
    "url": "https://www.semafor.com/article/07/05/2024/a-scared-biden-aide-sounds-an-alarm"
  },
  {
    "text": "Trump's Far-Right Army Is Threatening Bloodshed.  Believe Them.  —  We must not only resist, but prevail.  If we do not, it will be nearly impossible to reverse the course that America's right-wing billionaires have set us on.  —  Kevin Roberts, who heads the Heritage Foundation … ",
    "url": "https://www.commondreams.org/opinion/far-right-violence-trump-supporters"
  }
]