[
  {
    "text": "White House to brief lawmakers as House chairman warns of ‘serious national security threat’  —  Lawmakers said the issue is serious but shouldn't cause immediate alarm.  —  National Security Advisor Jake Sullivan speaks during a press briefing at the White House in Washington, Feb. 14, 2024.",
    "url": "https://abcnews.go.com/Politics/white-house-plans-brief-lawmakers-house-chairman-warns/story?id=107232293"
  },
  {
    "text": "Russia's Advances on Space-Based Nuclear Weapon Draw U.S. Concerns  —  A congressman's cryptic statement about new intelligence set Washington abuzz and infuriated White House officials.  —  The United States has informed Congress and its allies in Europe about Russian advances on a new … ",
    "url": "https://www.nytimes.com/2024/02/14/us/politics/intelligence-russia-nuclear.html"
  },
  {
    "text": "The ‘disturbing’ intel roiling the Hill is about Russian nukes in space  —  The U.S. has for more than a year been concerned about Russia's potentially creating and deploying an antisatellite nuclear weapon, one of the people familiar with the intelligence said.",
    "url": "https://www.politico.com/news/2024/02/14/house-intel-national-security-threat-russia-space-power-00141473"
  },
  {
    "text": "House Intel Chairman announces ‘serious national security threat,’ sources say it is related to Russia  —  House Intelligence Committee Chair Mike Turner has made information concerning a “serious national security threat” available to all members of Congress to review, the committee said on Wednesday.",
    "url": "https://www.cnn.com/2024/02/14/politics/house-intel-chairman-serious-national-security-threat/"
  },
  {
    "text": "Powerful House GOP chair retiring after Mayorkas impeachment … - Green's decision to retire comes on the same week as the House voted to impeach Homeland Security Secretary Alejandro Mayorkas.  — Green joins House Appropriations Committee Chair Kay Granger (R-Texas) … ",
    "url": "https://www.axios.com/2024/02/14/mark-green-retire-congress-mayorkas-impeachment"
  },
  {
    "text": "Republicans admit it.  Kevin McCarthy has never looked so good.  —  House GOP insiders view the new speaker as a man perpetually without a plan.  —  For nine months in his speakership, Kevin McCarthy seemed like a man with a title but no power — desperately improvising to keep … ",
    "url": "https://www.politico.com/news/2024/02/14/johnson-faces-waves-of-buyers-remorse-00141407"
  },
  {
    "text": "Special counsel asks Supreme Court to let Trump's 2020 election case proceed to trial without delay  —  Special counsel Jack Smith urged the U.S. Supreme Court on Wednesday to let former President Donald Trump's 2020 election interference case proceed to trial without further delay.",
    "url": "https://apnews.com/article/trump-special-counsel-election-interference-january-6-c2dcc83e56a541804d4785f6bb6cd45c"
  },
  {
    "text": "Special counsel Jack Smith urges Supreme Court to reject Trump bid to delay election trial  —  The court filing is in response to Trump's effort to prevent a court ruling that rejected his broad immunity claim from going into effect.  —  WASHINGTON — Special counsel Jack Smith on Wednesday asked … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/special-counsel-jack-smith-urges-supreme-court-reject-trump-bid-delay-rcna138906"
  },
  {
    "text": "George Santos Mercilessly Trolls GOP After Democrats Win His Old Seat  —  He even took the time to text his former colleagues to call them “f***ing idiots.”  —  Disgraced former congressman George Santos tore into the Republican Party on Tuesday night after a Democrat won his old House seat … ",
    "url": "https://www.thedailybeast.com/george-santos-mercilessly-trolls-gop-after-democrats-win-his-old-seat"
  },
  {
    "text": "Biden attacked Hur for asking him when Beau died.  That didn't happen, sources say.  —  The president raised his son's death after being asked about his workflow at a Virginia rental home, where he said he found classified materials, two sources said.  —  President Joe Biden lashed … ",
    "url": "https://www.nbcnews.com/politics/justice-department/biden-attacked-hur-asking-beau-died-didnt-happen-sources-say-rcna138709"
  },
  {
    "text": "ASSISTANT DEMOCRATIC LEADER CLYBURN STATEMENT ON HOUSE LEADERSHIP ROLE  —  WASHINGTON, D.C. — Today, U.S. House Assistant Democratic Leader James E. Clyburn released the following statement on his decision to step down from House Democratic leadership:  —  “I have informed Leader Hakeem Jeffries … ",
    "url": "https://assistantdemocraticleader.house.gov/media/press-releases/assistant-democratic-leader-clyburn-statement-house-leadership-role"
  },
  {
    "text": "Conservative group tells judge it has no evidence to back its claims of Georgia ballot stuffing  —  A conservative group has told a Georgia judge that it doesn't have evidence to support its claims of illegal ballot stuffing during the the 2020 general election and a runoff two months later.",
    "url": "https://apnews.com/article/georgia-elections-true-vote-ballot-stuffing-199113b47bc2df79c63fdf007cd23115"
  },
  {
    "text": "Military says Russian landing ship sunk in Black Sea  —  Editor's Note: This is a developing story and will continue to be updated.  —  The Russian landing ship Caesar Kunikov was sunk in the Black Sea in the morning of Feb. 14, the General Staff of Ukraine's Armed Forces confirmed.",
    "url": "https://kyivindependent.com/media-russian-landing-ship-allegedly-sunk-by-drones-in-black-sea/"
  },
  {
    "text": "National Archives closes to public after activists dump red powder on case holding Constitution  —  Washington — The National Archives closed its galleries to the public on Wednesday after two apparent climate activists dumped red powder on the protective encasement surrounding the U.S. Constitution.",
    "url": "https://www.cbsnews.com/news/national-archives-closes-climate-activists-red-powder-constitution/"
  },
  {
    "text": "Nearly 1 in 5 Believe Taylor Swift Election Conspiracy Theory  —  But 2 in 3 Americans approve of the singer encouraging voter turnout  —  West Long Branch, NJ - Just under 1 in 5 Americans believe the singer Taylor Swift is part of a covert effort to help President Joe Biden win the 2024 election.",
    "url": "https://www.monmouth.edu/polling-institute/reports/monmouthpoll_us_021424"
  },
  {
    "text": "Putin says Biden would be better for Russia as president than Trump  —  Russian president also dismissed criticism of Joe Biden's mental fitness.  —  Russian President Vladimir Putin said Wednesday Joe Biden would be better for Russia as president than Donald Trump, ahead of a potential rematch between … ",
    "url": "https://www.politico.eu/article/biden-would-be-a-better-president-than-trump-says-putin/"
  },
  {
    "text": "House panel obtains texts allegedly showing Gaetz setting up 2017 Florida Keys trip with woman his associate paid for sex: Sources  —  The House Ethics Committee is reviewing the messages, sources tell ABC News.  —  Rep. Matt Gaetz is shown at the U.S. Capitol in Washington, D.C., on Feb. 6, 2024.",
    "url": "https://abcnews.go.com/US/house-panel-obtains-texts-allegedly-showing-gaetz-setting/story?id=107126493"
  },
  {
    "text": "Senior Republicans fear Trump will tap the RNC to cover legal bills again  —  The president is going to put his people in place on the committee.  Major changes are in store.  —  Several senior Republican officials are concerned that Donald Trump's expected takeover of the RNC will ultimately pave … ",
    "url": "https://www.politico.com/news/2024/02/14/trump-rnc-legal-bills-00141540"
  },
  {
    "text": "McCarthy says Mace needs help ‘to straighten out her life’  —  Former Speaker Kevin McCarthy (R-Calif.) went after Rep. Nancy Mace (R-S.C.) during a Capitol Hill visit on Tuesday, saying she needs to “straighten out her life.”  —  Mace, one of the eight GOP members who voted to oust McCarthy … ",
    "url": "https://thehill.com/homenews/house/4468105-mccarthy-says-mace-needs-help-to-straighten-out-her-life/"
  },
  {
    "text": "Nikki Haley: ‘Diminished,’ ‘unhinged’ Trump has changed since she backed him  —  In an interview with NBC News' Craig Melvin, Haley explained away her past support for Trump while knocking his recent conduct and his age.  —  Former U.N. Ambassador Nikki Haley defended her past support … ",
    "url": "https://www.nbcnews.com/politics/2024-election/nikki-haley-diminished-unhinged-trump-changed-backed-rcna138667"
  },
  {
    "text": "House Democrat says Trump setting stage for World War III  —  Rep. Jared Moskowitz (D-Fla.) in a Thursday interview slammed former President Trump's remarks about Russia, saying he is effectively giving Russian President Vladimir Putin a green light and setting the stage for World War III.",
    "url": "https://thehill.com/homenews/house/4467594-house-democrat-says-trump-setting-stage-for-world-war-iii/"
  }
]