[
  {
    "text": "EU's Breton warns Musk on hate speech ahead of Trump interview; receives profane response  —  The European Union's digital enforcer wrote an open letter to tech mogul Elon Musk on Monday ahead of a planned interview with former United States President Donald Trump to remind him of the EU's rules on promoting hate speech.",
    "url": "https://www.politico.eu/article/eu-warns-elon-musk-hate-speech-donald-trump-interview-breton-x/"
  },
  {
    "text": "The Elon / Trump interview on X started with an immediate tech disaster … Elon Musk's “conversation” with former President Donald Trump got off to a rocky start.  The interview, which was hosted on X Spaces and scheduled to begin at 8PM ET Monday night, crashed almost immediately and didn't begin until 42 minutes later",
    "url": "https://www.theverge.com/2024/8/12/24219121/donald-trump-elon-musk-interview-x-twitter-crashes"
  },
  {
    "text": "Trump makes X return with Musk interview  —  Trump posted on X for the first time in nearly a year ahead of the interview.  —  Tesla and SpaceX CEO Elon Musk speaks at the SATELLITE Conference and Exhibition in Washington, March 9, 2020.  —  Former President Donald Trump is making another return … ",
    "url": "https://abcnews.go.com/Politics/trump-makes-return-musk-interview/story?id=112776019"
  },
  {
    "text": "In Which Ian Miles Cheong Understands Trump's Campaign Better than NYT  —  The second I saw video of Vice President Harris rolling up to a hangar at Detroit's airport on Air Force Two, then alighting with Tim Walz in front of cheering crowds, I knew it would break Donald Trump's brain.",
    "url": "https://www.emptywheel.net/2024/08/12/in-which-ian-miles-cheong-understands-trumps-campaign-better-than-nyt/"
  },
  {
    "text": "Trump campaign office in Virginia burglarized, police say  —  The Loudoun County Sheriff's Office said it's investigating whether anything was stolen, as well as the identity of the alleged suspect who was captured on surveillance video.  —  Police in a Virginia suburb of Washington, D.C. … ",
    "url": "https://www.nbcnews.com/politics/2024-election/trump-campaign-office-virginia-burglarized-police-say-rcna166306"
  },
  {
    "text": "Donald Trump's Campaign Admits It Rented Jeffrey's Epstein's Jet  —  OOPS!  —  A campaign official told The Daily Beast that it instructed a charter jet company to never lease them the infamous Gulfstream G550 ever again.  —  Donald Trump's campaign confirmed the former president chartered … ",
    "url": "https://www.thedailybeast.com/trump-campaign-confirms-he-chartered-epsteins-old-jet"
  },
  {
    "text": "Judge Rules That Robert F. Kennedy Jr. Cannot Appear on New York Ballot  —  The ruling was a blow to Mr. Kennedy's independent campaign for president.  The judge said that he had used a “sham” address to claim residency in New York.  —  Robert F. Kennedy Jr.'s independent presidential campaign … ",
    "url": "https://www.nytimes.com/2024/08/12/nyregion/robert-f-kennedy-jr-new-york-residency.html?unlocked_article_code=1.CU4.IiCR.z-qs3g6uU31W&smid=url-share"
  },
  {
    "text": "Donald Trump Is Freaked Out in Ways He Never Imagined Were Possible  —  The Harris-Walz campaign proved two important things last week.  First, it proved that sometimes all you really have to do is answer attacks—the mere fact of answering them deflates their momentum.",
    "url": "https://newrepublic.com/article/184754/donald-trump-freaked-out-harris-walz-attacks"
  },
  {
    "text": "Dozens of pregnant women, some bleeding or in labor, being turned away from ERs despite federal law  —  WASHINGTON (AP) — Bleeding and in pain, Kyleigh Thurman didn't know her doomed pregnancy could kill her.  —  Emergency room doctors at Ascension Seton Williamson in Texas handed … ",
    "url": "https://apnews.com/article/pregnant-women-emergency-room-ectopic-er-edd66276d2f6c412c988051b618fb8f9"
  },
  {
    "text": "Tina Peters guilty: Former Mesa County clerk convicted on 7 charges  —  Twelve Mesa County jurors found Tina Peters guilty of four felonies on Monday after a lengthy criminal trial, marking yet another conviction tied to post-2020 election conspiracy theories.",
    "url": "https://www.cpr.org/2024/08/12/tina-peters-trial-verdict/"
  },
  {
    "text": "Should You Get Another Covid Shot Now?  —  The virus is spreading, but new vaccines coming this fall could offer better protection.  We asked experts about the right time for a booster.  —  Patients keep asking Dr. Peter Chin-Hong, an infectious disease specialist at the University of California … ",
    "url": "https://www.nytimes.com/2024/08/12/well/coronavirus-vaccine-booster.html?unlocked_article_code=1.CU4.ILY9.CIpw6MLSPVRn&smid=nytcore-ios-share&referringSource=articleShare&sgrp=c-cb"
  },
  {
    "text": "Suspected Iranian hackers breached Roger Stone's personal email as part of effort to target Trump campaign, sources say  —  The FBI and other investigators probing the apparent hack-and-leak of Trump campaign documents, which Donald Trump has blamed on Iran, suspect that the hackers were able … ",
    "url": "https://www.cnn.com/2024/08/12/politics/trump-campaign-hack-personal-email-account-fbi/"
  },
  {
    "text": "NYC migrants — including one charged in sex assault 4 months ago — raped woman at knifepoint, beat her boyfriend: sources  —  Two migrants were arrested for a knifepoint rape in Coney Island - including one who was released from jail less than two months ago after sexually assaulting … ",
    "url": "https://nypost.com/2024/08/12/us-news/nyc-migrants-allegedly-raped-woman-at-knifepoint-in-coney-island/"
  },
  {
    "text": "Sasse's spending spree: Former UF president channeled millions to GOP allies, secretive contracts  —  The former UF president tripled his office's spending compared to predecessor  —  In his 17-month stint as UF president, Ben Sasse more than tripled his office's spending … ",
    "url": "https://www.alligator.org/article/2024/08/sasse-s-spending-spree-former-uf-president-channeled-millions-to-gop-allies-secretive-contracts"
  },
  {
    "text": "Arizona certifies abortion-rights initiative for the November ballot  —  Arizona's secretary of state's office announced that the 24-week limit will go up for a vote in the battleground state later this year.  —  PHOENIX — Arizona's ballot will include a major reproductive rights measure … ",
    "url": "https://www.nbcnews.com/politics/2024-election/arizona-certifies-abortion-rights-initiative-november-ballot-rcna166321"
  },
  {
    "text": "Silver Bulletin 2024 presidential election forecast  —  All the numbers for Trump vs. Harris.  —  ∙ Paid … Let's cut to the chase: So, who's gonna win the election?  —  Well, honestly, we don't know — but we can give you our best probabilistic guess.",
    "url": "https://www.natesilver.net/p/nate-silver-2024-president-election-polls-model?triedRedirect=true"
  },
  {
    "text": "Former FBI deputy chief lays out path for prosecution of Clarence Thomas  —  Former FBI deputy director Andrew McCabe gave tips on how to make Supreme Court Justice Clarence Thomas answer allegations about gifts received by rich donors when he joined legal analyst Allison Gill for their weekly\"Jack\" … ",
    "url": "https://www.rawstory.com/clarence-thomas-2668949416/"
  },
  {
    "text": "Broadcast news and major papers failed to cover report of possible Egyptian bribery involving Trump  —  NBC, ABC, CBS, as well as the LA Times, USA Today, and Wall Street Journal, all ignored the reporting … According to an August 2 report in The Washington Post, the U.S. Department … ",
    "url": "https://www.mediamatters.org/donald-trump/broadcast-news-and-major-papers-failed-cover-report-possible-egyptian-bribery"
  },
  {
    "text": "Trump to sue DOJ for $100M over Mar-a-Lago raid, alleging ‘political persecution’  —  Trump attorney says ‘unconstitutional’ raid should never have been approved by Garland, Wray  —  Join Fox News for access to this content  —  EXCLUSIVE: Former President Donald Trump is set to sue … ",
    "url": "https://www.foxnews.com/politics/trump-sue-doj-100m-over-mar-a-lago-raid-alleging-political-persecution"
  }
]