[
  {
    "text": "A Battered Iran Signals It Wants to De-Escalate Hostilities With Israel and Negotiate  —  Messages passed by Tehran through intermediaries seek a return to talks if the U.S. stays out of the fight  —  DUBAI—Iran has been urgently signaling that it seeks an end to hostilities and resumption … ",
    "url": "https://www.wsj.com/world/middle-east/a-battered-iran-signals-it-wants-to-de-escalate-hostilities-with-israel-and-negotiate-9feab4ae?st=474Qou&reflink=article_copyURL_share"
  },
  {
    "text": "Israel bombs Iranian state TV during live broadcast  —  Iranian state television was broadcasting live on Monday when a massive explosion rocked the studio, with the anchor fleeing her desk amid smoke and rubble.  The broadcast then went dark.  —  The big picture: Israel's strike … ",
    "url": "https://www.axios.com/2025/06/16/iran-state-tv-bombed-israel-strike"
  },
  {
    "text": "How Tough Is Iran?  A String of Military Losses Raises Questions.  —  Iran is often portrayed as one of the world's most dangerous actors, but with its attacks on Iranian defenses, nuclear sites and proxy militias, Israel has exposed a compromised and weakened adversary.",
    "url": "https://www.nytimes.com/2025/06/16/world/middleeast/iran-military-defense.html"
  },
  {
    "text": "Mike Lee confronted by Minnesota colleague over shooting comments  —  Sen. Mike Lee of Utah was confronted by a Senate colleague Monday over his social media post that blamed the Minnesota shootings over the weekend that killed a former Democratic legislative leader on “Marxists.”",
    "url": "https://www.politico.com/live-updates/2025/06/16/congress/tina-smith-confronts-mike-lee-00409329"
  },
  {
    "text": "Mike Lee Draws Outrage for Posts Blaming Assassination on the Far Left  —  The Republican senator from Utah suggested in social media posts that the killings were the work of “Marxists,” and mocked Minnesota's Democratic governor.  He later issued a more sober condemnation of the violence.",
    "url": "https://www.nytimes.com/2025/06/16/us/politics/mike-lee-minnesota-assassination-democrats.html"
  },
  {
    "text": "‘This is not a joke’: Sen. Amy Klobuchar rips Mike Lee for posts about a deadly Minnesota shooting  —  “This isn't funny,” Sen. Klobuchar says of Lee's misleading posts about targeted slaying.  —  After spending the weekend on lockdown to protect against a gunman who shot … ",
    "url": "https://www.sltrib.com/news/politics/2025/06/16/mineesota-shootinig-sen-amy/"
  },
  {
    "text": "The Trump Mobile T1 Phone looks both bad and impossible  —  It's supposedly made in the US, cheap, and coming this fall.  I doubt it all. … It costs $499, and you can reserve one now with a $100 down payment.  It is, according to the website, coming in September.  —  That's about all I feel confident saying.",
    "url": "https://www.theverge.com/gadgets/687492/trump-mobile-phone-t1"
  },
  {
    "text": "Sean Duffy to withhold transportation funds from cities with anti-ICE protests  —  Transportation Secretary Sean Duffy said Monday his department would withhold funding from cities where anti-ICE demonstrations were allowed to take place.  —  In a Monday post on X, Duffy responded … ",
    "url": "https://www.rawstory.com/sean-duffy-withhold-dot-funding/"
  },
  {
    "text": "Minnesota lawmaker shootings: Who was on Vance Boelter's hit list?  — Vance Boelter's “hit list” of lawmakers included prominent state and federal Democrats, Lt. Gov. Peggy Flanagan and Attorney General Keith Ellison.  — The list also named Sen. Nicole Mitchell (DFL-Woodbury).",
    "url": "https://www.fox9.com/news/minnesota-lawmaker-bca-shooting-suspects-list-lawmakers-not-manifesto"
  },
  {
    "text": "‘Extremely disturbing and unethical’: new rules allow VA doctors to refuse to treat Democrats, unmarried veterans  —  Department of Veterans Affairs says the changes come in response to a Trump executive order ‘defending women’  —  Doctors at Department of Veterans Affairs (VA) … ",
    "url": "https://www.theguardian.com/us-news/2025/jun/16/va-doctors-refuse-treat-patients"
  },
  {
    "text": "Senate unveils trickiest text of Trump's “big, beautiful bill”  —  Senate Finance Committee Republicans published their text of President Trump's “one big, beautiful bill” Monday evening, which includes major tax reforms and even steeper Medicaid cuts than the House called for.",
    "url": "https://www.axios.com/2025/06/16/senate-gop-one-big-beautiful-bill-text-taxes-medicaid-cuts"
  },
  {
    "text": "Terminated National Institute of Heath grants must be restored, judge orders  —  A federal judge Monday ordered the National Institutes of Health to restore grants that the agency cut based on gender ideology or diversity, equity and inclusion, calling the move illegal.",
    "url": "https://www.axios.com/local/boston/2025/06/16/nih-grants-ordered-restored"
  },
  {
    "text": "MAGA Whips Up Conspiracy Theories To Muddy An Act Of Right-Wing Violence  —  It took only hours after an allegedly Trump-supporting gunman shot multiple Democratic state lawmakers and their spouses for the right-wing misinformation machine to chug into action.",
    "url": "https://talkingpointsmemo.com/news/minnesota-shooting-maga-conspiracy-theory"
  },
  {
    "text": "Jury finds MyPillow founder defamed former employee for a leading voting equipment company  —  A federal jury in Colorado on Monday found that MyPillow founder Mike Lindell defamed a former employee for a leading voting equipment company after the 2020 presidential election.",
    "url": "https://www.denver7.com/news/local-news/jury-finds-mypillow-founder-defamed-former-employee-for-a-leading-voting-equipment-company"
  },
  {
    "text": "FIFA Club World Cup Ticket Sales TANK After DHS Says Agents Will Be At Stadium  —  Tickets to the opening match that were once $349 (and up) could be had for just $4.  —  Turns out authoritarianism can be bad for business.  —  Sales for the FIFA Club World Cup, a series of precursor games ahead … ",
    "url": "https://www.huffpost.com/entry/fifa-club-world-cup-ticket-prices-dhs_n_68505826e4b043333688af81"
  },
  {
    "text": "The Tyrant Test  —  A leader who uses military force to suppress his political opposition ought to lose the right to govern.  —  For as long as I've been alive, American presidents have defined tyrants by their willingness to use military force against their own people in reprisal for political opposition.",
    "url": "https://www.theatlantic.com/ideas/archive/2025/06/trump-military-force-protests/683198/?gift=Je3D9AQS-C17lUTOnl2W8Cdfor12GRVOUysWoqfjmig"
  },
  {
    "text": "Trump to return to Washington early from G7 summit for ‘important matters’  —  U.S. President Donald Trump will return to Washington from the G7 summit in Canada on Monday night to attend to many “important matters,” White House Press Secretary Karoline Leavitt said.",
    "url": "https://www.reuters.com/world/trump-return-washington-early-g7-summit-important-matters-2025-06-16/"
  },
  {
    "text": "The Bureaucrat and the Billionaire: Inside DOGE's Chaotic Takeover of Social Security … Elon Musk stood before a giant American flag at a Wisconsin political rally in March and rolled out an eye-popping allegation of rampant fraud at the Social Security Administration.",
    "url": "https://www.nytimes.com/2025/06/16/us/politics/doge-social-security.html?unlocked_article_code=1.PU8._ycH.u2Hz0TOdPxWv&smid=url-share"
  },
  {
    "text": "New poll: Trump and deportations unpopular, Dems up 8 in House vote  —  Summary:  —  Americans broadly disapprove of the job Donald Trump is doing as president and favor Democratic U.S. House candidates for the 2026 midterms by 8 points, a new Strength In Numbers/Verasight poll finds.",
    "url": "https://www.gelliottmorris.com/p/trump-approval-at-42-democrats-up"
  },
  {
    "text": "Many Exporters No Longer Want Dollars, US Bank Executive Says  —  When Paula Comings, the head of currency sales for US Bancorp, talks to US importers, she increasingly hears the same message: Their foreign counterparties no longer want to be paid in dollars.",
    "url": "https://www.bloomberg.com/news/articles/2025-06-16/many-exporters-no-longer-want-dollars-us-bank-executive-says"
  },
  {
    "text": "36 More Countries May Be Added to Trump's Travel Ban  —  The administration gave the nations 60 days to fix concerns, according to a State Department cable.  The president already imposed a full or partial ban on citizens of 19 countries.  —  The Trump administration is considering expanding … ",
    "url": "https://www.nytimes.com/2025/06/16/us/politics/trump-travel-ban.html"
  }
]