[
  {
    "text": "Trump offers Rep. Elise Stefanik role of UN ambassador, sources say  —  President-elect Donald Trump has offered Republican Rep. Elise Stefanik the job as US ambassador to the United Nations, two sources familiar told CNN on Sunday.  —  The New York congresswoman, the fourth-ranking House Republican … ",
    "url": "https://www.cnn.com/2024/11/10/politics/elise-stefanik-trump-us-ambassador-to-un"
  },
  {
    "text": "Trump offers Rep. Elise Stefanik ambassador to United Nations post after NY ally's aggressive defense of his policies: report  —  WASHINGTON — New York Rep. Elise Stefanik has accepted President-elect Donald Trump's offer to be his enforcer as United Nations ambassador, The Post can reveal.",
    "url": "https://nypost.com/2024/11/10/us-news/trump-offers-rep-elise-stefanik-ambassador-to-united-nations-post-report/"
  },
  {
    "text": "Stop Handwringing, Start Fighting  —  Plus: The next GOP Senate gears up to hand Trump more of its power.  —  Donald Trump, as everyone knows, is no neocon.  He's so not a neocon that he recently spent days insisting he didn't actually want to see Liz Cheney shot—he just wanted her to have a reckoning with her “war hawk” views!",
    "url": "https://www.thebulwark.com/p/stop-handwringing-start-fighting"
  },
  {
    "text": "The Rick Scott backlash builds  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  LATEST RACE CALLS — Rep. YADIRA CARAVEO (D-Colo.) conceded to Republican GABE EVANS.  Rep. DAVID SCHWEIKERT (R-Ariz.) wins reelection.  —  SAME AS IT EVER WAS … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/11/11/the-rick-scott-backlash-builds-00188728"
  },
  {
    "text": "Trump announces Tom Homan, his former acting ICE director, will be administration's ‘border czar’  —  President-elect Donald Trump announced Sunday night that Tom Homan, who served as the acting director of Immigration and Customs Enforcement in his last administration, will be in charge of the nation's borders.",
    "url": "https://www.cnn.com/2024/11/10/politics/tom-homan-border-czar-ice-donald-trump"
  },
  {
    "text": "Trump taps former immigration official Thomas Homan as border czar  —  President-elect says Homan will oversee deportation of illegal immigrants  —  President-elect Donald Trump has picked former acting Immigration and Customs Enforcement Director Thomas Homan to serve as a “border czar” for the incoming administration.",
    "url": "https://www.politico.com/news/2024/11/11/trump-taps-former-immigration-official-thomas-homan-as-border-czar-00188726"
  },
  {
    "text": "Trump announces Tom Homan as incoming border czar  —  Homan touts hard-line immigration views and has previously vowed to “run the biggest deportation force this country has ever seen.”  —  WASHINGTON — President-elect Donald Trump announced late Sunday that Tom Homan … ",
    "url": "https://www.nbcnews.com/politics/2024-election/trump-announces-tom-homan-incoming-border-czar-rcna179536"
  },
  {
    "text": "Fighters, Failures, and Freaks: The Definitive List of Winners and Losers of the 2024 Election  —  The 2024 election is over.  Donald Trump and the Republicans won a stunning and decisive victory.  Kamala Harris and the Democrats suffered a thoroughly deserved defeat.",
    "url": "https://freebeacon.com/author/stiles/politics/fighters-failures-and-freaks-the-definitive-list-of-winners-and-losers-of-the-2024-election/"
  },
  {
    "text": "Biden appears to struggle while walking on beach with first lady  —  President Biden to meet with successor President-elect Trump at White House on Wednesday  —  A video clip making the rounds online shows President Biden appearing to struggle while walking on the beach with first lady Jill Biden.",
    "url": "https://www.foxnews.com/politics/biden-appears-struggle-while-walking-beach-first-lady"
  },
  {
    "text": "Will Trump's hush money conviction stand?  A judge will rule on the president-elect's immunity claim  —  A gut punch for most defendants, Donald Trump turned his criminal conviction into a rallying cry.  His supporters put “I'm Voting for the Felon” on T-shirts, hats and lawn signs.",
    "url": "https://apnews.com/article/trump-immunity-hush-money-merchan-stormy-daniels-02e54baf65b233ad7f6875536fb998ea"
  },
  {
    "text": "Protecting the rule of law under Trump is going to be precarious  —  The justices must decide, in the wake of last term's decisions, whether they will play any role in that aim.  And, for paid subscribers: Closing my tabs.  —  ∙ Paid  —  The coming period is one that will be difficult for the rule of law.",
    "url": "https://www.lawdork.com/p/the-justices-must-decide-whether"
  },
  {
    "text": "Trump talked to Putin, told Russian leader not to escalate in Ukraine  —  President-elect Donald Trump spoke with Russian President Vladimir Putin on Thursday and discussed the war in Ukraine, according to people familiar with the call.  —  President-elect Donald Trump spoke … ",
    "url": "https://www.washingtonpost.com/national-security/2024/11/10/trump-putin-phone-call-ukraine/"
  },
  {
    "text": "Dems roll the dice with another SCOTUS seat  —  What could possibly go wrong? … ⚖️  —  After the shock of Donald Trump's victory last week, Democrats are trying to figure out whether it's possible to Trump-proof a Supreme Court seat.  Though conservatives already hold … ",
    "url": "https://www.publicnotice.co/p/sotomayor-retire-2024-trump-administration"
  },
  {
    "text": "Republicans' First Tax-Cut Challenge: How Much Red Ink Can They Live With?  —  To pass a bill without Democrats, GOP lawmakers seek agreement on the deficit number  —  WASHINGTON—As Republicans prepare the party-line tax bill at the core of their 2025 agenda, the key to everything is, simply, “The Number.”",
    "url": "https://www.wsj.com/politics/republican-tax-cuts-congress-7b0eb428"
  },
  {
    "text": "Against Panic: A Survival Kit  —  I had an elaborate itinerary for Election Day that I took to calling the Panic Abatement Plan.  I'd walk in the woods early because temperatures are still breaking records down here.  I'd stop by Parnassus Books, which would be full of kindred souls … ",
    "url": "https://www.nytimes.com/2024/11/11/opinion/against-panic-a-survival-kit.html"
  },
  {
    "text": "2024's other big loser?  The mainstream media.  Is there any path forward?  —  The American mainstream media, and its vital watchdog role that once made it a trusted, major institution in a flawed yet functioning democracy, imploded in 2024, and it happened in two ways … ",
    "url": "https://www.inquirer.com/opinion/commentary/trust-mainstream-media-2024-election-20241110.html?id=bpjtJ3uwA0BYL"
  }
]