[
  {
    "text": "Republicans push Musk to let Congress vote on DOGE cuts  —  Republicans pushed Elon Musk on Wednesday in a pair of private meetings to move his efforts to slash federal spending and the federal workforce through Congress, as lawmakers vie for a seat at the table in the sweeping effort to overhaul government.",
    "url": "https://www.cnn.com/2025/03/05/politics/musk-doge-republicans/"
  },
  {
    "text": "Musk promises better communication between Republican lawmakers, DOGE  —  “With all due respect to Mr. Musk, he doesn't have a vote up here,” one lawmaker said.  —  Billionaire Trump adviser Elon Musk stepped up his congressional outreach on Wednesday, taking questions from Republican lawmakers … ",
    "url": "https://www.washingtonpost.com/politics/2025/03/05/musk-congress-anger-doge/"
  },
  {
    "text": "Draft of Trump Executive Order Aims to Eliminate Education Department  —  Secretary Linda McMahon would be directed to ‘take all necessary steps to facilitate the closure’  —  President Trump is expected to issue an executive order as soon as Thursday aimed at abolishing the Education Department … ",
    "url": "https://www.wsj.com/politics/policy/draft-of-trump-executive-order-aims-to-eliminate-education-department-5315c3a4?st=i92oTT"
  },
  {
    "text": "Exclusive: Trump plans to revoke legal status of Ukrainians who fled to US, sources say  —  U.S. President Donald Trump's administration is planning to revoke temporary legal status for some 240,000 Ukrainians who fled the conflict with Russia, a senior Trump official and three sources familiar … ",
    "url": "https://www.reuters.com/world/us/trump-plans-revoke-legal-status-ukrainians-who-fled-us-sources-say-2025-03-06/"
  },
  {
    "text": "DOGE is driving Social Security cuts and will make mistakes, acting head says privately  —  The Social Security Administration's acting commissioner said members of Elon Musk's cost-cutting team are outsiders who are unfamiliar with the nuances of the agency's programs.  —  Just now",
    "url": "https://www.washingtonpost.com/politics/2025/03/06/doge-is-driving-social-security-cuts-will-make-mistakes-acting-head-says-privately/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQxMjM3MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQyNjE1OTk5LCJpYXQiOjE3NDEyMzcyMDAsImp0aSI6ImI1NWM2ODdkLWYyNGYtNGRiMy1iZDEzLTVjN2I2YWQwMjNhYSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzAzLzA2L2RvZ2UtaXMtZHJpdmluZy1zb2NpYWwtc2VjdXJpdHktY3V0cy13aWxsLW1ha2UtbWlzdGFrZXMtYWN0aW5nLWhlYWQtc2F5cy1wcml2YXRlbHkvIn0.YuFgrKQpIsfmrFc7hUR5Q9nksxXiarod42OowD2eJVw&itid=gfta"
  },
  {
    "text": "Gavin Newsom breaks with Democrats on trans athletes in sports  —  The Democratic California governor made the stunning remarks in his debut podcast with conservative guest Charlie Kirk.  —  California Gov. Gavin Newsom, a pioneer for LGBTQ+ rights who decades ago upset leaders in his own party … ",
    "url": "https://www.politico.com/news/2025/03/06/gavin-newsom-breaks-with-democrats-on-trans-athletes-in-sports-00215436"
  },
  {
    "text": "House Speaker Mike Johnson's chief of staff arrested on DUI charge after Trump speech  —  Hayden Haynes is a longtime top aide to Mike Johnson, both in the speaker's office and his personal office.  —  WASHINGTON — Hayden Haynes, the chief of staff to House Speaker Mike Johnson, R-La. … ",
    "url": "https://www.nbcnews.com/politics/congress/speaker-mike-johnson-chief-staff-arrested-dui-charge-trump-speech-rcna194986"
  },
  {
    "text": "The Advice Elissa Slotkin Didn't Take  —  The Michigan senator wants to set a new tone for the Democratic resistance.  —  Right around the time that Donald Trump was arriving at the U.S. Capitol to address a joint session of Congress—the longest such speech, it would turn out … ",
    "url": "https://www.theatlantic.com/politics/archive/2025/03/elissa-slotkin-democratic-resistance/681933/?gift=Anx5_Gw2ocfAXDdTqoOT9zh7SzkF8bra1oqZ4EHCuyg&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "US employers cut more jobs last month than any February since 2009  —  The Trump administration's massive federal cuts and swelling feelings of economic uncertainty helped fuel a recession-level spike in layoffs last month, new data showed Thursday.  —  US-based employers last month announced plans … ",
    "url": "https://www.cnn.com/2025/03/06/economy/us-jobs-report-february-preview/"
  },
  {
    "text": "Trump Press Sec Accidentally Blurts Out Real Goal of His Tariff Scam  —  In his speech to Congress, President Trump kept lying about his tariffs, falsely claiming that Canada is letting huge amounts of fentanyl into our country and suggesting the trade wars will only get worse.",
    "url": "https://newrepublic.com/article/192391/trump-press-sec-accidentally-reveals-ugly-scam-behind-tariffs"
  },
  {
    "text": "Pentagon deputy press secretary Kingsley Wilson is a prolific purveyor of antisemitic conspiracy theories  —    Kingsley Wilson, the Pentagon's new deputy press secretary, is facing backlash over a series of recent social media comments in which she has promoted antisemitic conspiracy theories … ",
    "url": "https://jewishinsider.com/2025/03/pentagon-deputy-press-secretary-kingsley-wilson-is-a-prolific-purveyor-of-antisemitic-conspiracy-theories-online/"
  },
  {
    "text": "As Trump pivots to Russia, allies weigh sharing less intel with U.S.  —  Members of the so-called Five Eyes spy alliance, as well as Israeli and Saudi officials, fear the identities of foreign assets could inadvertently be shared with Moscow.  —  Some U.S. allies are considering scaling … ",
    "url": "https://www.nbcnews.com/politics/national-security/trump-pivots-russia-allies-weigh-sharing-less-intel-us-rcna194420"
  },
  {
    "text": "D.C. U.S. attorney tells Georgetown he won't hire from any school with ‘DEI’  —  Trump appointee Ed Martin made the claim in a letter to the Georgetown University law school dean.  Martin has called the school a “locus” of anti-Trump activity.  —  Interim D.C. U.S. Attorney Ed Martin demanded … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2025/03/05/dc-us-attorney-ed-martin-georgetown-law-dei/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQxMTUwODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQyNTI5NTk5LCJpYXQiOjE3NDExNTA4MDAsImp0aSI6ImE0OTNmYTMwLTJhZDUtNGU3My04M2RmLTM2NzJmNGRjNzM2ZiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9kYy1tZC12YS8yMDI1LzAzLzA1L2RjLXVzLWF0dG9ybmV5LWVkLW1hcnRpbi1nZW9yZ2V0b3duLWxhdy1kZWkvIn0.Uujxg57xqPkIGE-3fDop4fwqrWHG5T8Mcm_JRXzFTLA&itid=gfta"
  },
  {
    "text": "Trump may have already planted the seeds of his political collapse  —  Over the last six weeks, President Trump has been spending political capital like a drunk at a casino who insists he's got “a system.”  If history is any predictor, his second term trajectory may already be set — right off a cliff, pedal to the floor.",
    "url": "https://thehill.com/opinion/campaign/5178643-trump-may-have-already-planted-the-seeds-of-his-political-collapse/"
  },
  {
    "text": "Trump Decried Millions Spent ‘Making Mice Transgender.’ It Was Cancer and Asthma Research  —  The president's State of the Union address included a line designed to go viral in the right-wing misinformation machine … The chief executive of the United States told the country … ",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-transgender-mice-medical-research-1235289439/"
  },
  {
    "text": "As Trump Goes After Universities, Students Are Now on the Chopping Block  —  Uncertainty about how much money colleges and universities stand to lose has led some schools to reduce the number of doctoral students, in some cases reneging on offers.  —  In the early weeks of the Trump administration's push … ",
    "url": "https://www.nytimes.com/2025/03/06/us/politics/trump-university-funding-grad-student-cuts.html"
  },
  {
    "text": "Top Trump allies hold secret talks with Zelenskyy's Ukrainian opponents  —  As Washington ramps up its pressure on Zelenskyy to step aside, his rivals are talking to Trump's team.  —  KYIV — Four senior members of Donald Trump's entourage have held secret discussions with some of Kyiv's … ",
    "url": "https://www.politico.eu/article/donald-trump-allies-secret-talks-volodymyr-zelenskyy-opposition-ukraine-elections-yulia-tymoshenko-petro-poroshenko/"
  },
  {
    "text": "Trump's overhauled Kennedy Center loses upcoming run of ‘Hamilton’  —  The cancellation of the popular musical drew a sharp rebuke from Richard Grenell, the new interim director.  —  The producers of the hit Broadway musical “Hamilton” are canceling an upcoming run at the Kennedy Center … ",
    "url": "https://www.politico.com/news/2025/03/05/trump-kennedy-center-hamilton-canceled-00215237"
  },
  {
    "text": "Texas Rep. Al Green unrepentant as he faces censure vote in House for disrupting Trump speech  —  The House is expected to vote on censuring an unrepentant Rep. Al Green, D-Texas, on Thursday for his outburst during President Donald Trump's address to Congress.",
    "url": "https://apnews.com/article/house-censure-green-trump-joint-address-61d82026983c99a269209bbeb32b45a5"
  },
  {
    "text": "US to Name Morgan Stanley Banker to Lead Sovereign Wealth Fund  —  The Commerce Department is tapping former Morgan Stanley banker Michael Grimes to lead a planned sovereign wealth fund, part of President Donald Trump's effort to give the US a stake in projects he considers critical to national security.",
    "url": "https://www.bloomberg.com/news/articles/2025-03-06/us-to-name-morgan-stanley-banker-to-lead-sovereign-wealth-fund"
  },
  {
    "text": "KDA Statement On “Retaliatory Tariffs” On Bourbon  —  Kentucky Distillers' Association President Eric Gregory released the following statement today on what the KDA calls “retaliatory tariffs” against bourbon: … About the Kentucky Distillers' Association",
    "url": "https://whiskeynetwork.net/2025/03/kda-statement-on-retaliatory-tariffs-on-bourbon/"
  },
  {
    "text": "Harvard Must Take a Stand for Democracy  —  Democracy is in greater peril today than at any time in modern U.S. history.  President Donald Trump ran an openly authoritarian campaign in 2024, pledging to prosecute his rivals, punish media critics, and deploy the military to repress protest.",
    "url": "https://www.thecrimson.com/article/2025/3/6/enos-levitsky-harvard-trump-democracy-fight/"
  },
  {
    "text": "Why Trump Thanked John Roberts  —  The conservative justices are frequently accomplices to Trump's assault on democracy.  —  The exchange was so awkward, it should have been followed by the Curb Your Enthusiasm theme song.  While President Donald Trump was shaking hands down the aisle … ",
    "url": "https://www.theatlantic.com/ideas/archive/2025/03/congressional-address-supreme-court/681926/?gift=Je3D9AQS-C17lUTOnl2W8DvuvqMwTWi-iRV7fuziWg0&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "How Trump Is Dividing and Conquering the White House Press Corps  —  Last week, the White House invited a handful of giddy conservative influencers to “policy briefings” with top administration officials like Attorney General Pam Bondi and FBI director Kash Patel.",
    "url": "https://nymag.com/intelligencer/article/trump-is-dividing-and-conquering-the-white-house-press-corps.html"
  },
  {
    "text": "We Found Elon Musk's DOGE Email Address and We're Fighting to Reveal His Messages  —  The Intercept is publishing Elon Musk's government email address to aid those seeking information on DOGE in the public interest.  —  THE FREEDOM OF Information Act is a vital tool to expose … ",
    "url": "https://theintercept.com/2025/03/06/elon-musk-doge-email-address-foia/"
  },
  {
    "text": "Who Paid for Trump's Transition to Power?  The Donors Are Still Unknown.  —  President Trump has not made good on a promise to disclose who contributed to his transition effort.  —  After six weeks in office, President Trump has not disclosed the names of the donors who paid for his transition planning … ",
    "url": "https://www.nytimes.com/2025/03/06/us/politics/donald-trump-2024-campaign-transition.html?unlocked_article_code=1.104.jBrS.B4bRpiai9qrq&smid=url-share"
  },
  {
    "text": "At the Voice of America, the Trump administration is moving swiftly to assert its vision  —  As it has with other government agencies, the Trump administration is moving swiftly to assert its vision at the Voice of America.  As it does so, a question hangs in the air: Is the news organization's … ",
    "url": "https://apnews.com/article/voice-of-america-trump-administration-kari-lake-15b585b58f5a510374344b50b1a131b5"
  },
  {
    "text": "US plans to fire 80,000 Veterans Affairs workers as part of Trump cuts, sparking backlash  —  The Department of Veterans Affairs is planning to cut more than 80,000 workers from the agency, according to an internal memo seen by Reuters, drawing condemnation from military veteran groups and Democrats.",
    "url": "https://www.reuters.com/world/us/department-veterans-affairs-cut-80000-jobs-part-trump-cuts-2025-03-05/"
  }
]