[
  {
    "text": "Statement from President Joe Biden on the Hostage Release in Gaza  —  I welcome the deal to secure the release of hostages taken by the terrorist group Hamas during its brutal assault against Israel on October 7th.  —  Jill and I have been keeping all those held hostage and their loved ones close … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2023/11/21/statement-from-president-joe-biden-on-the-hostage-release-in-gaza/"
  },
  {
    "text": "Ron DeSantis' team was going after Nikki Haley.  They turned on each other instead.  —  Haley's rise has posed an existential threat to DeSantis' candidacy, and his team has struggled in how to counter it.  —  Leaders of Ron DeSantis' Never Back Down super PAC met privately last Tuesday … ",
    "url": "https://www.nbcnews.com/politics/2024-election/ron-desantis-nikki-haley-fight-right-never-back-down-rcna126102"
  },
  {
    "text": "How one judge is slowing down one of Trump's biggest criminal cases  —  The May 2024 trial in Trump's classified documents case appears headed for a politically precarious postponement.  —  Judge Aileen Cannon seems to be in no hurry.  —  On paper, she has scheduled a trial to open next … ",
    "url": "https://www.politico.com/news/2023/11/22/aileen-cannon-trump-trial-slow-00128391"
  },
  {
    "text": "UK Museum Determines Roman Emperor Was Trans, Changes Pronouns to She/Her  —  Elagabalus only ruled for 4 years before being assassinated  —  A UK museum has reclassified a Roman emperor as a transgender woman after doing research.  —  The North Hertfordshire Museum will use her and she when referring to Elagabalus.",
    "url": "https://themessenger.com/news/roman-emperor-elagabalus-transgender-woman-uk-museum-she-her-pronouns"
  },
  {
    "text": "Colorado Supreme Court to take up appeals in Trump ballot case  —  A state judge ruled last week that Trump “engaged in insurrection” but that the U.S. Constitution's ban on insurrectionists' holding office didn't apply to presidents.  —  The Colorado Supreme Court agreed Tuesday … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/colorado-supreme-court-agrees-take-appeal-trump-ballot-case-rcna126293"
  },
  {
    "text": "Woodbury County supervisor's wife found guilty of 52 counts of voter fraud  —  Prosecutors say Kim Phuong Taylor wanted her husband to win elections in 2020 “by any means necessary.”  —  A jury spent about five hours deliberating before convicting Kim Phuong Taylor on 52 counts of voter fraud in federal court Tuesday in Sioux City.",
    "url": "https://www.iowapublicradio.org/ipr-news/2023-11-21/woodbury-county-supervisors-wife-found-guilty-of-52-counts-of-voter-fraud"
  },
  {
    "text": "Poll: Gun ownership reaches record high with American electorate  —  A record share of voters in NBC News' latest poll say that they or someone in their household owns a gun.  —  More than half of American voters — 52% — say they or someone in their household owns a gun, per the latest NBC News national poll.",
    "url": "https://www.nbcnews.com/meet-the-press/meetthepressblog/poll-gun-ownership-reaches-record-high-american-electorate-rcna126037"
  },
  {
    "text": "‘Scream VII’ Star Axed Over Pro-Palestine Posts  —  Melissa Barrera wrote on Instagram that “Western media only shows the [Israeli] side.  Why do they do that, I will let you deduce for yourself.”  —  Scream VII actress Melissa Barrera has been “quietly” dropped by Spyglass Studios … ",
    "url": "https://www.thedailybeast.com/scream-vii-star-axed-over-pro-palestine-posts"
  },
  {
    "text": "Dean Phillips supporters launch ads attacking Biden's electability  —  The spots, focused on generational change and the president's current polling, will initially run in New Hampshire and the Washington area  —  A new super PAC supporting the presidential campaign of Minnesota … ",
    "url": "https://www.washingtonpost.com/politics/2023/11/21/dean-phillips-joe-biden-ads/"
  },
  {
    "text": "Republican Celeste Maloy wins Utah special House election  —  Republican Celeste Maloy was projected to win a Thanksgiving-week special election for the open U.S. House seat in Utah left vacant by her former boss, Rep. Chris Stewart (R-Utah), according to Decision Desk HQ.",
    "url": "https://thehill.com/homenews/campaign/4321766-utah-special-house-election-celeste-maloy-kathleen-riebe-trump-abortion/"
  },
  {
    "text": "Why Trump Represents a ‘Trifecta of Danger’  —  Brian Klaas, a political scientist at University College London, captures the remarkable nature of the 2024 presidential election in an Oct. 1 essay, “The Case for Amplifying Trump's Insanity.”  —  Klaas argues that the presidential contest now pits",
    "url": "https://www.nytimes.com/2023/11/22/opinion/trump-danger-rage-psychology.html"
  },
  {
    "text": "WOKE ALERT: BEST BUY, ACTIVISION, TARGET, NORDSTROM, & HOME DEPOT  —  FIVE WOKE COMPANIES TO WATCH THIS BLACK FRIDAY AND CYBER MONDAY  —  These five companies went Woke, and now they're vying for your business on Black Friday and Cyber Monday.  Keep these companies' woke antics in mind when you're shopping for deals.",
    "url": "https://consumersresearch.org/woke-alert/woke-alert-best-buy-activision-target-nordstrom-home-depot/"
  },
  {
    "text": "North Philadelphia shooting leaves 2 men dead, 5 injured: police  —  PHILADELPHIA (CBS) — A shooting in North Philadelphia has left two men dead and five others injured on Tuesday night, police said.  —  The shooting happened in the area of 6th Street and Allegheny Avenue at around 8:30 p.m., according to police.",
    "url": "https://www.cbsnews.com/philadelphia/news/philadelphia-shooting-6th-street-allegheny-avenue-crime/"
  },
  {
    "text": "Biden admin quietly developing settlement with groups seeking to tear down key power source  —  ‘Congress alone has the authority’ to breach federal dams, lawmakers write in letter to White House  —  The Biden administration is quietly discussing a potentially far-reaching settlement … ",
    "url": "https://www.foxnews.com/politics/biden-admin-quietly-developing-settlement-groups-seeking-tear-down-key-power-source"
  },
  {
    "text": "Virginia State University Makes History As The First HBCU In The Country Selected To Host A General Election Presidential Debate  —  VSU has been chosen by the Commission on Presidential Debates to host a 2024 Presidential Debate.  —  Virginia State University is proud to announce … ",
    "url": "https://www.vsu.edu/news/2023/vsu-hbcu-history-election-presidential-debate.php"
  },
  {
    "text": "Cassidy Hutchinson Gives Dark Reason Why ‘Everybody Should Vote For Joe Biden’  —  The former Trump White House aide would not confirm who she's putting on her ballot, but she did say who she won't be voting for.  —  LOADING  —  Former White House aide Cassidy Hutchinson urged Americans … ",
    "url": "https://www.huffpost.com/entry/cassidy-hutchinson-vote-joe-biden_n_655c989ee4b0c91d82787586"
  },
  {
    "text": "Cuomo weighs run for NYC mayor amid Adams' woes  —  Former Gov. Andrew Cuomo wouldn't try to compete in a primary against Eric Adams  —  NEW YORK — Former Gov. Andrew Cuomo is indicating to allies he may want to run for New York City mayor if fellow Democrat Eric Adams sinks under the weight of a federal investigation.",
    "url": "https://www.politico.com/news/2023/11/21/cuomo-mayor-adams-00128380"
  },
  {
    "text": "Maryland Hate Crime Commission Official Likens Israel to Nazi Germany  —  A Maryland state official tasked with addressing hate crimes compared Israel to Nazi Germany.  —  “That moment when you become what you hated most,” wrote Zainab Chaudry in an Oct. 17 Facebook post accompanied … ",
    "url": "https://freebeacon.com/latest-news/maryland-hate-crime-commission-official-likens-israel-to-nazi-germany/"
  },
  {
    "text": "Democrats nearly double Republicans in October fundraising  —  The Democratic National Committee (DNC) far outperformed its Republican National Committee (RNC) counterpart in fundraising in October.  —  The latest Federal Election Commission (FEC) campaign filings show the DNC … ",
    "url": "https://thehill.com/homenews/campaign/4321630-democrats-nearly-double-republicans-in-october-fundraising/"
  },
  {
    "text": "Jan. 6 Rioter Gets 3 Months in Jail After Ditching Court, Berating Judge  —  ‘ABSOLUTE CLOWN SHOW’  —  Frank Giustino, a New York massage therapist, was only ever supposed to get a maximum of 21 days in prison for his role in storming the Capitol on Jan. 6.",
    "url": "https://www.thedailybeast.com/jan-6-rioter-frank-giustino-gets-3-months-in-jail-after-ditching-court-and-deriding-prosecution"
  },
  {
    "text": "US hits Iran-backed militants with fourth round of retaliatory airstrikes  —  Iran-backed groups have attacked US forces more than 60 times since mid-Oct.  —  United States fighter jets struck two sites in Iraq used by Iran-linked militants on Wednesday morning local time, according to U.S. Central Command and defense officials.",
    "url": "https://abcnews.go.com/Politics/us-hits-iran-backed-militants-fourth-round-retaliatory/story?id=105081095"
  },
  {
    "text": "Donald Trump has worst day yet in NY civil fraud trial as underling's scribbled note ties him to conspiracy  — The Trump civil fraud trial is now in its eighth week in New York.  — The defense called Trump's former spreadsheet czar, Jeffrey McConney, to testify.",
    "url": "https://www.businessinsider.com/trump-worst-day-ny-fraud-trial-thanks-to-defense-witness-2023-11"
  }
]