[
  {
    "text": "Biden Narrows Gap With Trump in Swing States Despite Debate Loss  —  The incumbent trails his GOP rival by just 2 points across key states, a Bloomberg News/Morning Consult shows, even as three in 10 Democrats say he should leave the race.  —  President Joe Biden registered his best showing yet … ",
    "url": "https://www.bloomberg.com/news/features/2024-07-06/biden-narrows-trump-s-election-lead-in-key-states-after-debate-poll"
  },
  {
    "text": "President Biden's physician met with Parkinson's disease specialist in White House  —  A top Washington D.C. neurologist had a meeting with President Biden's personal doctor at the White House earlier this year, visitor logs reviewed by The Post show.  —  Dr. Kevin Cannard … ",
    "url": "https://nypost.com/2024/07/06/us-news/president-bidens-physician-met-with-parkinsons-disease-specialist-in-white-house/"
  },
  {
    "text": "Biden's team drafted the questions for his first post-debate interviews … - WURD is the only African-American owned and operated talk radio station in Pennsylvania, but the White House's director of Black media was not part of the process.  — It is the latest instance of the White House continuing … ",
    "url": "https://www.axios.com/2024/07/06/biden-interview-draft-questions-wurd"
  },
  {
    "text": "White House Provided the Questions in Advance for Biden's Radio Interviews  —  The host of “The Source” on WURD in Philadelphia said the president's aides provided her with a list of eight questions to choose from.  —  The questions asked of President Biden by two radio interviewers this week … ",
    "url": "https://www.nytimes.com/2024/07/06/us/politics/biden-radio-interviews-questions.html"
  },
  {
    "text": "American allies fear Biden is finished and can't beat Trump  —  “We're not sure that, even if he wins, he can survive four years more,” said one official from a European NATO country.  —  Diplomats and world leaders preparing for next week's NATO summit are privately expressing acute concern … ",
    "url": "https://www.politico.com/news/2024/07/06/american-allies-fear-biden-trump-00166700"
  },
  {
    "text": "As Biden Digs In, More Supporters Look to Push Him Out  —  Interviews with dozens of Democrats illustrated an imminent clash between a defiant president and those who question his ability to win.  Many rank-and-file party officials remain supportive.  —  Numerous officials … ",
    "url": "https://www.nytimes.com/2024/07/06/us/politics/biden-campaign-democrats.html"
  },
  {
    "text": "Live Election Updates: Biden Will Return to the Trail, Seeking to Salvage His Campaign  —  With his candidacy on the line, Biden will visit Pennsylvania.  —  President Biden will campaign in Pennsylvania on Sunday, his second trip to a battleground state in recent days as part of a crucible … ",
    "url": "https://www.nytimes.com/live/2024/07/06/us/biden-trump-election"
  },
  {
    "text": "Behind the Curtain: Biden's credibility crisis … Some top Democrats told us Biden made matters worse Friday with his ABC interview, where he denied bad poll numbers and widespread Democratic panic.  — “All the pollsters I talk to tell me it's a tossup,” Biden told George Stephanopoulos.",
    "url": "https://www.axios.com/2024/07/06/biden-abc-interview-democrats-support"
  },
  {
    "text": "Jeffries Plans to Meet Virtually With Top House Democrats on Biden's Path Ahead  —  The House minority leader scheduled a virtual meeting for Sunday.  —  Representative Hakeem Jeffries, Democrat of New York and the minority leader, has scheduled a virtual meeting on Sunday with senior House Democrats … ",
    "url": "https://www.nytimes.com/2024/07/05/us/politics/hakeem-jeffries-biden-democrats.html"
  },
  {
    "text": "We should all be terrified of Trump's Project 2025  —  The presumptive Republican nominee has promised to give rightwing evangelical Christians what they want - and more  —  “Project 2025” is nothing short of a 900-page blueprint for guiding Donald Trump's second term of office if he's re-elected.",
    "url": "https://www.theguardian.com/commentisfree/article/2024/jul/06/trump-project-2025-robert-reich"
  },
  {
    "text": "Trump wins delay in classified documents case … - It's an opinion that Trump has used to throw a wrench in prosecutors' plans although the SCOTUS decision on July 1 failed to clarify whether his alleged conduct on Jan. 6 was protected. … - Trump's attorneys have also used presidential immunity … ",
    "url": "https://www.axios.com/2024/07/06/donald-trump-classified-documents-delay"
  },
  {
    "text": "Why is the pundit class so desperate to push Biden out of the race?  —  Yes, Biden had a bad debate - but so did Trump.  The media is once again repeating the mistakes of 2016  —  I am not usually one to offer diagnoses of people I've never met, but it does seem like the pundit class … ",
    "url": "https://www.theguardian.com/commentisfree/article/2024/jul/06/biden-trump-race-rebecca-solnit"
  },
  {
    "text": "The Supreme Court folds  —  The Supreme Court's ruling in Trump v. United States is its worst decision of my lifetime.  John Roberts's sloppy, arrogant, contradictory majority opinion provides license for any future president to lie, cheat, steal, suppress dissent, and — if they have the stomach for it — assassinate.",
    "url": "https://radleybalko.substack.com/p/the-supreme-court-folds"
  },
  {
    "text": "The French republic is under threat.  We are 1,000 historians and we cannot remain silent  —  Patrick Boucheron, Antoine Lilti and others  —  We implore voters not to turn their backs on our nation's history.  Go out and defeat the far right in Sunday's vote",
    "url": "https://www.theguardian.com/commentisfree/article/2024/jul/06/french-republic-voters-election-far-right"
  }
]