[
  {
    "text": "Donald Trump may not pay bond — and instead let Letitia James seize Trump Tower: insiders  —  As Donald Trump faces a Monday deadline to post a $454 million bond in the civil fraud case against him in New York, insiders said he may be weighing a little-discussed option: Do nothing.",
    "url": "https://nypost.com/2024/03/20/business/donald-trump-may-not-pay-bond-and-instead-let-letitia-james-seize-trump-tower-insiders/"
  },
  {
    "text": "Panic mode sets in for Trump as he faces deadline for massive bond  —  Former President Donald Trump is in panic mode as the deadline approaches to secure a half-billion-dollar bond to appeal his civil fraud case in New York, according to multiple sources familiar with his thinking.",
    "url": "https://www.cnn.com/2024/03/19/politics/trump-bond-deadline-panic"
  },
  {
    "text": "New York AG urges appeals court to make Trump pay full bond  —  The New York attorney general's office urged a state appeals court to make former President Trump put up a full bond before pausing the multimillion-dollar judgment in his civil fraud case.  —  The state's filing follows claims … ",
    "url": "https://thehill.com/regulation/court-battles/4544391-ny-ag-urges-appeals-court-to-make-trump-pay-full-bond-in-fraud-case/"
  },
  {
    "text": "What Trump Supporters Think When He Mocks People With Disabilities  —  Last weekend, I stood among thousands of Donald Trump supporters in a windy airfield, watching them watch their candidate.  I traveled to the former president's event just outside Dayton, Ohio, because I couldn't stop thinking … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/03/trump-disabilities-supporters-responses/677812/"
  },
  {
    "text": "Shadowing Trump's attacks on mental fitness — his own father's dementia  —  Trump avoids mention of his father's Alzheimer's disease as he lashes Biden for being ‘cognitively impaired’  —  Donald Trump invited his extended family to Mar-a-Lago in the mid-1990s.",
    "url": "https://www.washingtonpost.com/politics/2024/03/20/donald-trump-dementia-father-fred-alzheimers-biden/"
  },
  {
    "text": "Is Trump Cracking Under the Pressure of the Election?  —  Trump has repeatedly stumbled during the first couple of weeks of the general election  —  Donald Trump made it through the Republican primary largely unscathed.  He never had to get on a debate stage or adopt a position to outflank a rival.",
    "url": "https://www.messageboxnews.com/p/is-trump-cracking-under-the-pressure"
  },
  {
    "text": "Nostalgic for the Trump years?  That's because his draconian budget cuts never passed.  —  A New York Times poll released this month revealed that more voters believe Donald Trump's policies benefitted them personally than feel that way about Joe Biden's policies.  We have news for these Americans.",
    "url": "https://thehill.com/opinion/white-house/4545202-nostalgic-for-the-trump-years-thats-because-his-draconian-budget-cuts-never-passed/"
  },
  {
    "text": "‘Very, very troubling’: Judges, lawyers flummoxed by Judge Cannon  —  The jurist overseeing Donald Trump's classified documents case in Florida has raised eyebrows and alarms with her latest order  —  Lawyers and former judges said they are baffled by an order issued this week … ",
    "url": "https://www.washingtonpost.com/national-security/2024/03/20/trump-cannon-judge-pra-jury-instructions/"
  },
  {
    "text": "Biden wanders off stage after spotting baby in crowd at Arizona campaign event: 'Couldn't resist'  —  President Biden on Tuesday wandered off stage, beelined toward a baby and sat in the crowd as he was being introduced at a campaign event in Phoenix.  —  “Well, folks, I have to tell you straight up … ",
    "url": "https://nypost.com/2024/03/19/us-news/biden-wanders-off-stage-after-seeing-baby-at-arizona-event/"
  },
  {
    "text": "Biden Administration Announces Rules Aimed at Expanding Electric Vehicles  —  The regulations would require automakers to sell more electric vehicles and hybrids by gradually tightening limits on tailpipe pollution.  —  The Biden administration on Wednesday issued one of the most significant … ",
    "url": "https://www.nytimes.com/2024/03/20/climate/biden-phase-out-gas-cars.html"
  },
  {
    "text": "MUST-SEE: AOC Has a Mental Breakdown After Bobulinski Runs Circles Around Her  —  Hunter Biden demanded a hearing on Capitol Hill and then didn't show up.  Perhaps he should have because his allies in the Democratic caucus aren't handling things well.  —  In the gift that just keeps on giving … ",
    "url": "https://redstate.com/bonchie/2024/03/20/aoc-has-a-mental-breakdown-during-hearing-after-bobulinski-runs-circles-around-her-n2171655"
  },
  {
    "text": "Lev Parnas, ex-Giuliani associate, testifies allegations against Bidens are false and ‘spread by the Kremlin’  —  In his opening statement, Parnas maintained there is no evidence showing that Joe Biden and his son Hunter Biden were linked to corruption in Ukraine.",
    "url": "https://www.nbcnews.com/politics/joe-biden/lev-parnas-ex-giuliani-associate-testifies-allegations-bidens-are-fals-rcna144250"
  },
  {
    "text": "Elon Musk's X Is Suspending Accounts That Reveal a Neo-Nazi Cartoonist's Alleged Identity  —  Researchers and journalists have been blocked on X from sharing the alleged identity of the neo-Nazi cartoonist Stonetoss.  —  X has locked and suspended the accounts of journalists and researchers … ",
    "url": "https://www.wired.com/story/elon-musk-x-blocked-journalists-researchers-neo-nazi-cartoonist/"
  },
  {
    "text": "BREAKING: Trump, others can appeal Fani Willis removal ruling, judge allows  —  Judge Scott McAfee says he'll continue work on other aspects of case  —  Fulton Superior Court Judge Scott McAfee on Wednesday granted permission for former President Donald Trump and seven others to appeal … ",
    "url": "https://www.ajc.com/politics/breaking-fulton-judge-allows-trump-others-to-appeal-fani-willis-removal-ruling/Z7NZGYJVXRDGDFEBMCWPSTBIEQ/"
  },
  {
    "text": "Parnas calls out GOP rep at hearing for ‘doing the bidding’ of Russia  —  Lev Parnas, a convicted former aide to Rudy Giuliani, named members of Congress Wednesday who he alleged were “doing the bidding” of Russia by attempting to dig up “dirt” on President Biden during his 2020 campaign.",
    "url": "https://thehill.com/homenews/house/4545008-parnas-calls-out-gop-rep-hearing-doing-bidding-russia/"
  },
  {
    "text": "USW Endorses Joe Biden for Reelection as President  —  Contact: Jess Kamm Broomell, (412) 562-2444, jkamm@usw.org  —  (PITTSBURGH) - The United Steelworkers (USW) union today proudly endorsed Joe Biden for a second term as president of the United States.  —  “President Biden proved … ",
    "url": "https://www.usw.org/news/media-center/releases/2024/usw-endorses-joe-biden-for-reelection-as-president"
  },
  {
    "text": "No Labels can't get a ‘yes’ on a candidate for 2024 — and there's a good reason why  —  It's tough to understand what's going on at No Labels, the centrist political group that is trying — and repeatedly failing — to find a candidate for its presidential ticket this year.",
    "url": "https://thehill.com/opinion/campaign/4544313-no-labels-cant-get-a-yes-on-a-candidate-for-2024-and-theres-a-good-reason-why/"
  },
  {
    "text": "Users ditch Glassdoor, stunned by site adding real names without consent  —  Anonymous review site Glassdoor now consults public sources to identify users.  —  Glassdoor, where employees go to leave anonymous reviews of employers, has recently begun adding real names to user profiles without users' consent … ",
    "url": "https://arstechnica.com/tech-policy/2024/03/glassdoor-adding-users-real-names-job-info-to-profiles-without-consent/"
  },
  {
    "text": "Kennedy family set to step up its efforts to help Biden's campaign  —  The Kennedys recent visit to the White House, and big family photo with the president, previewed the coming push.  —  WASHINGTON — For President Joe Biden's re-election campaign, Robert F. Kennedy Jr.'s independent candidacy looms as a potential political spoiler.",
    "url": "https://www.nbcnews.com/politics/2024-election/kennedy-family-rfk-biden-2024-election-rcna144163"
  },
  {
    "text": "Scoop: House GOP weighs inviting Netanyahu to address Congress … - Netanyahu is slated to address the Senate Republican lunch on Wednesday virtually. … - “It was suggested by several folks” to House Speaker Mike Johnson (R-La.), one House Republican said.",
    "url": "https://www.axios.com/2024/03/20/scoop-house-gop-weighs-inviting-netanyahu-to-address-congress"
  },
  {
    "text": "Judge Rips Into Michael Cohen for Bank Fraud Trial ‘Perjury’  —  A federal judge has undermined the credibility of former Trump fixer Michael Cohen, the Manhattan District Attorney's top witness in the Stormy Daniels hush money case.  —  A federal judge on Wednesday refused … ",
    "url": "https://www.thedailybeast.com/federal-judge-rips-into-michael-cohen-for-trump-bank-fraud-trial-perjury"
  }
]