[
  {
    "text": "Exclusive: Harris leads Trump 44% to 42% in US presidential race, Reuters/Ipsos poll finds  —  Vice President Kamala Harris opened up a marginal two-percentage-point lead over Republican Donald Trump after President Joe Biden ended his re-election campaign and passed the torch to her, a Reuters/Ipsos poll found.",
    "url": "https://www.reuters.com/world/us/harris-leads-trump-44-42-us-presidential-race-reutersipsos-poll-finds-2024-07-23/"
  },
  {
    "text": "The Kamala Harris Effect  —  As the conversation about Joe Biden stepping aside ramped up after the June 27th debate, it was pretty clear, at least to me, that if he did so it could only be Kamala Harris to rise in his place.  This was true not just for logistical reasons such as access … ",
    "url": "https://thinkbigpicture.substack.com/p/kamala-harris-biden-trump-2024"
  },
  {
    "text": "Hillary Clinton: How Kamala Harris Can Win and Make History  —  History has its eye on us.  President Biden's decision to end his campaign was as pure an act of patriotism as I have seen in my lifetime.  It should also be a call to action to the rest of us to continue his fight for the soul of our nation.",
    "url": "https://www.nytimes.com/2024/07/23/opinion/kamala-harris-donald-trump.html?unlocked_article_code=1.9k0.sOUJ.pWhQjZtDH1oK&smid=nytcore-ios-share&referringSource=articleShare&sgrp=c-cb"
  },
  {
    "text": "Historic flood of cash pours into Harris campaign and allied groups  —  Democrats reported raising more than $250 million since Biden announced he was leaving the presidential race and endorsed Harris.  —  Weeks of pent-up Democratic panic gave way to a historic flood of campaign cash … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/23/kamala-harris-donations-election/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzIxNzA3MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzIzMDg5NTk5LCJpYXQiOjE3MjE3MDcyMDAsImp0aSI6IjcyOWYzNjE4LTc4NTctNDQ4Mi04N2JiLTY0MWFlNjNjYWFiNiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzA3LzIzL2thbWFsYS1oYXJyaXMtZG9uYXRpb25zLWVsZWN0aW9uLyJ9.hHmas7GgO13_Tsjjpge36Am8fZygmZ96ZOXbj38yazE&itid=gfta"
  },
  {
    "text": "Poll: Presidential race hits a reset with Harris vs. Trump  —  The 2024 presidential campaign has hit a reset with more voters moving into the undecided camp now that Kamala Harris is potentially the Democratic nominee, a new NPR/PBS News/Marist poll finds.  —  Harris and former President Donald Trump … ",
    "url": "https://www.npr.org/2024/07/23/nx-s1-5048890/elections-poll-biden-harris-trump"
  },
  {
    "text": "Clip resurfaces of Vance criticizing Harris for being ‘childless,’ testing Trump's new running mate  —  Comments Donald Trump's running mate JD Vance made in 2021 questioning Vice President Kamala Harris' leadership because she did not have biological children have resurfaced … ",
    "url": "https://apnews.com/article/jd-vance-kamala-harris-childless-trump-0a37e991097b66c52bff5bf7ecf8de7b"
  },
  {
    "text": "How Kamala Harris Locked Up the Nomination in Two Days  —  The vice president moved quickly after Biden's exit to sew up delegates' support, as potential challengers backed her instead  —  WASHINGTON—Kamala Harris completed her takeover of the Democratic Party within 48 hours.",
    "url": "https://www.wsj.com/politics/elections/how-kamala-harris-locked-up-nomination-b5ccf4e6"
  },
  {
    "text": "The simple reason why Kamala Harris has Donald Trump running scared  —  Trump is terrified of Kamala Harris because she will put his violent misogyny in the spotlight  —  It was mere moments after President Joe Biden announced he would not run for re-election when the new narrative … ",
    "url": "https://www.salon.com/2024/07/23/the-simple-reason-why-kamala-harris-has-donald-running-scared/"
  },
  {
    "text": "Live Election Updates: Harris Rallies Exuberant Wisconsin Crowd, Saying ‘When We Fight, We Win’  —  Vice President Kamala Harris visited a key battleground state and quickly went on the offensive against former President Donald J. Trump, casting the race as a contest between a prosecutor and a felon.",
    "url": "https://www.nytimes.com/live/2024/07/23/us/harris-trump-news-election-biden"
  },
  {
    "text": "Democratic foreign policy heavyweights endorse Harris in open letter  —  John Kerry, Susan Rice and others in the Democratic foreign policy establishment are lining up behind Kamala Harris for president, noting her international leadership.  —  Some of the most senior foreign policy leaders … ",
    "url": "https://www.washingtonpost.com/national-security/2024/07/23/kamala-harris-foreign-policy-endorsement/"
  },
  {
    "text": "Elon Musk backs down from $45 million a month pledge to Trump, says he doesn't ‘subscribe to cult of personality’ … Elon Musk is not spending $45 million a month to elect former President Donald Trump, though he has created a new super political action committee (PAC) to fund the Republican candidate … ",
    "url": "https://fortune.com/2024/07/23/elon-musk-backs-down-from-45-million-a-month-pledge-to-trump-says-he-doesnt-subscribe-to-cult-of-personality/"
  },
  {
    "text": "Senators Should Support Bill to Codify Chevron Deference, Modernize Rulemaking  —  Contact: David Rosen, drosen@citizen.org  —  WASHINGTON, D.C. - Senators should support the Stop Corporate Capture Act, introduced today by U.S. Sen. Elizabeth Warren (D-Mass.), the Coalition for Sensible Safeguards said.",
    "url": "https://sensiblesafeguards.org/press/senators-should-support-bill-to-codify-chevron-deference-modernize-rulemaking/"
  },
  {
    "text": "House GOP leaders urge members: Stop making race comments about Harris  —  Leadership warned lawmakers during a closed-door meeting to focus on the vice president's record, not her race.  —  House Republican leaders told lawmakers to focus on criticizing Vice President Kamala Harris' record without reference … ",
    "url": "https://www.politico.com/news/2024/07/23/gop-race-comments-harris-00170735"
  },
  {
    "text": "Secret Service Director Cheatle resigns with ‘heavy heart’ after Trump rally shooting  —  Secret Service Director Kimberly Cheatle faced scrutiny after the attempted assassination of former president Donald Trump at a rally in Pennsylvania.  —  U.S. Secret Service Director Kimberly Cheatle resigned Tuesday … ",
    "url": "https://www.washingtonpost.com/nation/2024/07/23/secret-service-director-cheatle-scrutiny/"
  },
  {
    "text": "Michigan man kills himself after running over 80-year-old Trump supporter  —  The man called police to confess to a crime and then killed himself before authorities arrived at the scene  —  A Michigan man suspected of using an all-terrain vehicle to run over an elderly man … ",
    "url": "https://www.theguardian.com/us-news/article/2024/jul/23/hancock-michigan-man-death-"
  },
  {
    "text": "Inside the two-year fight to bring charges against school librarians in Granbury, Texas  —  An 824-page investigative file offers a visceral picture of an officer's attempt to prosecute librarians amid a nationwide movement to criminalize books.  —  The law enforcement officer spent months methodically gathering evidence.",
    "url": "https://www.nbcnews.com/news/us-news/school-librarians-banned-books-investigation-texas-rcna161444"
  },
  {
    "text": "Secret Service encourages Trump campaign to stop outdoor rallies  —  Trump campaign is scouting indoor venues, such as basketball arenas and other large spaces where thousands of people can fit, people familiar with the request said.  —  Secret Service officials encouraged Donald Trump's campaign … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/23/trump-rallies-secret-service-change/"
  },
  {
    "text": "A Reader's Guide To MAGA's Racist And Misogynistic Attacks On Kamala Harris  —  A lot of things happened.  Here are some of the things.  This is TPM's Morning Memo.  Sign up for the email version.  —  Throw Everything Against The Wall And See What Sticks",
    "url": "https://talkingpointsmemo.com/morning-memo/racist-and-misogynistic-attacks-on-kamala-harris"
  },
  {
    "text": "Sunday was the hottest day ever recorded on Earth, scientists say  —  The historic day comes on the heels of 13 straight months of unprecedented temperatures and the hottest year scientists have ever seen.  —  Global temperatures hit the highest levels in recorded history on Sunday … ",
    "url": "https://www.washingtonpost.com/climate-environment/2024/07/23/hottest-day-ever-recorded-climate-change/"
  }
]