[
  {
    "text": "A Weary Trump Appears to Doze Off in Courtroom Ahead of Criminal Trial  —  The former president flashed signs of irritation at times, but also seemed to fall asleep, before jolting back awake.  —  Former President Donald J. Trump seemed alternately irritated and exhausted Monday morning … ",
    "url": "https://www.nytimes.com/2024/04/15/nyregion/trump-asleep-criminal-trial.html"
  },
  {
    "text": "Live Updates: Trump Trial Poised to Begin, a Criminal Case Without Precedent  —  Jury selection is set to start as Donald J. Trump faces charges he faked business records to cover up a sex scandal before winning the presidency.  The judge declined Mr. Trump's request to recuse himself.",
    "url": "https://www.nytimes.com/live/2024/04/15/nyregion/trump-hush-money-trial"
  },
  {
    "text": "I Was a Skeptic of the Stormy Daniels Prosecution.  I Was Wrong.  —  The prosecution of Donald Trump starting in New York this week is on firm legal ground.  —  When Manhattan District Attorney Alvin Bragg brought criminal charges against Donald Trump in 2023, I was highly skeptical of his decision.",
    "url": "https://slate.com/news-and-politics/2024/04/stormy-daniels-prosecution-stronger-than-i-thought.html"
  },
  {
    "text": "How to pick a jury that can judge Donald Trump  —  Tailoring questions to probe prospective jurors' political biases and opinions of the former president is more art than science.  —  Former President Donald Trump's criminal trial in New York begins Monday with an immediate and fundamental challenge … ",
    "url": "https://www.politico.com/news/2024/04/14/jury-selection-donald-trump-00151962"
  },
  {
    "text": "As hush money trial begins, Trump's sex life emerges as key theme  —  Before jurors are questioned, judge spends hours hashing out what a jury should know about allegations involving women other than Stormy Daniels  —  NEW YORK — The opening day of Donald Trump's criminal trial delved deep … ",
    "url": "https://www.washingtonpost.com/politics/2024/04/15/trump-hush-money-trial-sex-tabloids/"
  },
  {
    "text": "Justice Clarence Thomas misses Supreme Court arguments  —  The conservative justice was not present for oral arguments on Monday, but the court did not provide a reason why.  —  WASHINGTON — Conservative Supreme Court Justice Clarence Thomas was not present at the court for oral arguments on Monday … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/justice-clarence-thomas-misses-supreme-court-arguments-rcna147826"
  },
  {
    "text": "Justice Thomas misses Supreme Court session Monday with no explanation  —  Supreme Court Justice Clarence Thomas was absent from the court Monday with no explanation.  Thomas, 75, also was not participating remotely in arguments, as justices sometimes do when they are ill or otherwise can't be there in person.",
    "url": "https://thehill.com/homenews/ap/ap-politics/ap-justice-thomas-misses-supreme-court-session-monday-with-no-explanation/"
  },
  {
    "text": "The Supreme Court effectively abolishes the right to mass protest in three US states  —  It is no longer safe to organize a protest in Louisiana, Mississippi, or Texas.  —  The Supreme Court announced on Monday that it will not hear Mckesson v. Doe.  The decision not to hear Mckesson leaves … ",
    "url": "https://www.vox.com/scotus/24080080/supreme-court-mckesson-doe-first-amendment-protest-black-lives-matter"
  },
  {
    "text": "Biden counsels Netanyahu to ‘slow things down’ after Iranian attack  —  Administration officials said the U.S. would not join any response to Tehran's assault, and suggested Israel ‘take the win’ and avoid escalation  —  The Biden administration on Sunday congratulated Israel … ",
    "url": "https://www.washingtonpost.com/national-security/2024/04/14/biden-netanyahu-israel-iran/"
  },
  {
    "text": "Trump Media closes down more than 18% after filing plans to issue more DJT stock … This photo illustration shows an image of former President Donald Trump reflected in a phone screen that is displaying the Truth Social app, in Washington, DC, on February 21, 2022.",
    "url": "https://www.cnbc.com/2024/04/15/trump-media-shares-plunge-after-company-files-to-issue-additional-djt-stock.html"
  },
  {
    "text": "Federal criminal investigation opened into Key Bridge crash  —  The FBI has opened a criminal investigation focusing on the massive container ship that brought down the Francis Scott Key Bridge in Baltimore last month — a probe that will look at least in part at whether the crew left … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2024/04/15/balitmore-key-bridge-criminal-investigation/"
  },
  {
    "text": "Tesla lays off more than 10% of staff globally as sales fall  —  Tesla (TSLA.O) told staff it is laying off more than 10% of its global workforce, an internal memo seen by Reuters on Monday shows, as it grapples with falling sales and an intensifying price war for electric vehicles (EVs).",
    "url": "https://www.reuters.com/business/autos-transportation/tesla-lay-off-more-than-10-its-staff-electrek-reports-2024-04-15/"
  },
  {
    "text": "Nikki Haley Joins Hudson  —  WASHINGTON—Hudson Institute today announced that Nikki Haley, the former governor of South Carolina and US ambassador to the United Nations, will be the next Walter P. Stern Chair.  —  “When our policymakers fail to call out our enemies or acknowledge the importance … ",
    "url": "https://www.hudson.org/nikki-haley-joins-hudson"
  },
  {
    "text": "Supreme Court snubs House Republicans who dodged metal detectors in Congress after Jan. 6  —  What happens in Congress stays in Congress, the Supreme Court signaled on Monday, as it turned away an appeal by three Republican congressmen who were fined $5,000 each by the House … ",
    "url": "https://www.usatoday.com/story/news/politics/2024/04/15/supreme-court-republicans-house-security-jan-6/73281636007/"
  },
  {
    "text": "Swalwell accuses Clay Travis of jury tampering in Trump trial  —  Rep. Eric Swalwell (D-Calif.) accused conservative media personality Clay Travis of jury tampering as former President Trump heads to trial this week in New York regarding an alleged hush money payment to adult film star Stormy Daniels.",
    "url": "https://thehill.com/homenews/media/4594964-trump-hush-money-trial-swalwell-clay-travis/"
  },
  {
    "text": "Former Trump staffer who said to ‘fan the flame’ after 2020 loss hired to lead Wisconsin GOP  —  MADISON, Wis. (AP) — The director of Donald Trump's 2020 presidential campaign in Wisconsin, who pushed allegations of widespread fraud that were ultimately debunked, has been hired to run … ",
    "url": "https://apnews.com/article/wisconsin-republican-donald-trump-2020-election-46463044d8c07f1660673c9f5b299eff"
  },
  {
    "text": "Trump's right to fear Stormy Daniels — she could be a devastating witness  —  Women have consistently offered the most compelling testimony against Trump — now it's Stormy's turn  —  As a lifelong lover of the English language, I'm being slowly driven mad by one word that haunts the news coverage these days: “affair.”",
    "url": "https://www.salon.com/2024/04/15/right-to-fear-stormy-daniels--she-could-be-a-devastating-witness/"
  },
  {
    "text": "Rick Scott supports 15-week Florida abortion ban over 6-week limit  —  Sen. Rick Scott (R-Fla.) says he would support replacing Florida's six-week state abortion ban with a 15-week statewide ban that he believes would reflect broader consensus within the Sunshine State over how to protect unborn life.",
    "url": "https://thehill.com/homenews/senate/4595381-rick-scott-florida-abortion-ban/"
  },
  {
    "text": "Trump trade advisers plot dollar devaluation  —  Advisers close to the former president — particularly his former trade chief Robert Lighthizer — are considering policies that would weaken the dollar relative to other currencies, which could juice U.S. exports but also fuel inflation.",
    "url": "https://www.politico.com/news/2024/04/15/devaluing-dollar-trump-trade-war-00152009"
  },
  {
    "text": "Kelly Clarkson tells Hillary Clinton: Arizona abortion ruling is ‘insane to me’  —  Kelly Clarkson says she finds Arizona's recent abortion ruling “insane,” telling Hillary Clinton that the country's “going backwards.”  —  “Did you ever think in your lifetime that we would see that happen?",
    "url": "https://thehill.com/blogs/in-the-know/4595799-kelly-clarkson-hillary-clinton-arizona-abortion-ruling/"
  },
  {
    "text": "New rules for Pregnant Workers Fairness Act includes divisive accommodations for abortion  —  NEW YORK (AP) — Workers are entitled to workplace accommodations for abortions — along with other pregnancy-related medical conditions like miscarriage, stillbirth and lactation … ",
    "url": "https://apnews.com/article/pregnant-workers-fairness-act-abortion-d2a25371e09a20734803b1b9cce53c85"
  },
  {
    "text": "Transgender Veterans Sue V.A. Over Gender-Affirming Surgeries  —  An advocacy group for transgender veterans has filed a lawsuit over the failure of the Department of Veterans Affairs to provide or pay for gender-affirming surgeries.  —  The federal lawsuit, filed on Monday … ",
    "url": "https://www.nytimes.com/2024/04/15/us/politics/veterans-transgender-lawsuit.html"
  }
]