[
  {
    "text": "Trump, without evidence, blames ‘rhetoric’ of Biden, Harris for possible assassination attempt  —  Former president Trump, who has a long history of inflammatory rhetoric, repeated the claim on his social media platform Truth Social.  —  Former president Donald Trump on Monday blamed the … ",
    "url": "https://www.washingtonpost.com/politics/2024/09/16/trump-blames-biden-harris-rhetoric-potential-assassination-attempt/"
  },
  {
    "text": "After possible assassination attempt, Trump decries ‘rhetoric’?  Spare me the sanctimony.  —  The idea that Harris or her campaign should stop talking about the threat Trump poses to our democracy is absurd.  Democrats are not encouraging any form of violence against him or anyone else.",
    "url": "https://www.usatoday.com/story/opinion/columnist/2024/09/16/trump-assassination-attempt-golf-course-shooting-violence-hypocrisy/75251537007/"
  },
  {
    "text": "Harris leads Trump in Pennsylvania — and two bellwether PA counties — exclusive poll finds  —  Joey Garrison Michael CollinsUSA TODAY  —  WASHINGTON - Democratic presidential nominee Kamala Harris narrowly leads former President Donald Trump in the critical battleground state of Pennsylvania … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/09/16/harris-trump-pennsylvania-poll/75236006007/"
  },
  {
    "text": "Harris soars to record 6-point lead over Trump in post-debate poll … - “A majority of likely voters — including 1 in 5 Republicans — believe Harris won the debate, and performance appears to be crystalizing her national lead over the former president,” said Eli Yokley, political analyst at Morning Consult, in an emailed statement.",
    "url": "https://www.axios.com/2024/09/17/harris-leads-trump-poll-after-debate-record"
  },
  {
    "text": "Elon Musk Is a National Security Risk  —  Musk's now-deleted post questioning why no one has attempted to assassinate Joe Biden and Kamala Harris renews concerns over his work for the US government—and potential to inspire extremist violence.  —  Shortly following reports … ",
    "url": "https://www.wired.com/story/elon-musk-biden-harris-assassination-post-x/"
  },
  {
    "text": "Playbook: The next Jan. 6  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  APPOINTMENT VIEWING — We're excited to note Eugene is among the reporters who will question VP KAMALA HARRIS later today in Philadelphia at an event organized by the National Association of Black Journalists.",
    "url": "https://www.politico.com/newsletters/playbook/2024/09/17/the-next-jan-6-00179476"
  },
  {
    "text": "The other Jan. 6 Democrats are worried about  —  Democrats expect Mike Johnson won't be speaker if Kamala Harris wins.  But they fear they might be wrong.  —  Democrats have spent much of the 2024 campaign reminding Americans of what happened on Jan. 6, 2021.",
    "url": "https://www.politico.com/news/2024/09/17/johnson-jan6-2025-vote-count-00179473"
  },
  {
    "text": "Trump Is No Gerald Ford  —  No other president has used an assassination attempt to inflame American politics the way Donald Trump does.  —  Every American has the right to participate in public life without violence, and that includes Donald Trump.  Personally, I think he probably belongs in jail … ",
    "url": "https://www.theatlantic.com/newsletters/archive/2024/09/trump-is-no-gerald-ford/679900/"
  },
  {
    "text": "Omnipresent AI cameras will ensure good behavior, says Larry Ellison  —  “We're going to have supervision,” says billionaire Oracle co-founder Ellison.  —  On Thursday, Oracle co-founder Larry Ellison shared his vision for an AI-powered surveillance future during a company financial meeting, reports Business Insider.",
    "url": "https://arstechnica.com/information-technology/2024/09/omnipresent-ai-cameras-will-ensure-good-behavior-says-larry-ellison/"
  },
  {
    "text": "Mehdi Hasan sounds off  —  “The media is too timid, too cautious, too cowardly.”  —  ∙ Paid … Mehdi Hasan thinks elite media institutions are failing us, which is why he founded Zeteo, an “independent and unfiltered” news and commentary site that has grown exponentially since its debut earlier this year.",
    "url": "https://www.publicnotice.co/p/mehdi-hasan-interview-2024"
  },
  {
    "text": "In an Unprecedented Move, Ohio Is Funding the Construction of Private Religious Schools  —  The state is giving millions in taxpayer dollars directly to private schools to help them renovate and expand their campuses.  It may be the next frontier in the push to increase the use of school vouchers, proponents say.",
    "url": "https://www.propublica.org/article/ohio-taxpayer-money-funding-private-religious-schools"
  },
  {
    "text": "Megyn Kelly owes Taylor Swift an apology  —  Megyn Kelly, formerly of NBC and Fox News, is enraged that Taylor Swift endorsed Kamala Harris for president.  The global superstar endorsed Harris in an Instagram post on September 10, immediately after the debate between Harris and Donald Trump.",
    "url": "https://popular.info/p/megyn-kelly-owes-taylor-swift-an"
  },
  {
    "text": "Is 2024 the year of the ‘pro-choice’ Republican?  —  Good morning, Early Birds.  Tonight the sky will showcase a “super harvest moon.”  Here's when you can see it.  Send tips to earlytips@washpost.com.  Thanks for waking up with us.  —  In today's edition ... What's next for the Secret Service … ",
    "url": "https://www.washingtonpost.com/politics/2024/09/17/is-2024-year-pro-choice-republican/"
  },
  {
    "text": "U.S. Authorities Were Warned About Suspected Trump Gunman  —  Ryan Routh criticized Trump and threatened to kill Vladimir Putin, setting off alarm bells among those involved in Ukraine assistance efforts  —  in West Palm Beach, Fla., and Vera Bergengruen in Washington",
    "url": "https://www.wsj.com/us-news/u-s-authorities-were-warned-about-suspected-trump-gunman-153dab6f?st=dHi5Ft&reflink=article_copyURL_share"
  },
  {
    "text": "Senate Republicans losing patience with Johnson as shutdown nears  —  Republican senators are fast losing patience with Speaker Mike Johnson's (R-La.) inability to muster the votes to avoid a government shutdown at the end of September, and are warning they will take matters into their own hands if the House fails to act by Thursday.",
    "url": "https://thehill.com/homenews/senate/4883059-senate-republicans-losing-patience-with-johnson-as-shutdown-nears/"
  },
  {
    "text": "Mark Meadows's Arizona charges to stay in state court, federal judge rules  —  The ruling is a setback for the former Trump White House chief of staff, who unsuccessfully tried the same legal maneuver in a separate case in Georgia.  —  A judge has denied a request from Mark Meadows … ",
    "url": "https://www.washingtonpost.com/national-security/2024/09/16/mark-meadows-arizona-federal-court/"
  },
  {
    "text": "Reggaeton Star Nicky Jam Deletes Endorsement After Donald Trump Misgendering  —  HOT TO COLD  —  Jam, who was introduced by Trump as a “hot” woman, disabled the comment section of a recent Instagram post after being mocked by commentators.  —  Reggaeton star Nicky Jam seems to be rolling … ",
    "url": "https://www.thedailybeast.com/reggaeton-star-nicky-jam-deletes-trump-post-amid-misgendering-backlash"
  },
  {
    "text": "Meta bans RT, days after U.S. accuses Russian outlet of disinformation  —  U.S. officials on Friday accused RT of carrying out covert information warfare operations around the world as an arm of Russia's spy agencies.  —  Social media giant Meta on Monday announced that it is banning Russian … ",
    "url": "https://www.nbcnews.com/news/us-news/meta-bans-rt-russian-disinformation-rcna171402"
  },
  {
    "text": "Giuliani Takes Another L in Court as Judge Tosses His Suit Against Biden  —  CAN'T CATCH A BREAK  —  Last October, Giuliani sued Biden for saying during a 2020 presidential debate that Giuliani was a “Russian pawn.”  —  Cash-strapped former Donald Trump adviser Rudy Giuliani's defamation lawsuit … ",
    "url": "https://www.thedailybeast.com/giuliani-takes-another-l-in-court-as-judge-tosses-his-suit-against-biden"
  },
  {
    "text": "TikTok faces skeptical judges in hearing over potential ban  —  The two-hour hearing allowed TikTok and the government to give Appeals Court judges their opinions on a potential TikTok ban.  —  A three-judge panel of the D.C. Circuit U.S. Court of Appeals sounded unconvinced Monday that the TikTok … ",
    "url": "https://www.nbcnews.com/tech/tech-news/tiktok-faces-skeptical-judges-hearing-potential-ban-rcna171173"
  },
  {
    "text": "14% of Republicans would ‘take action to overturn’ the election if Trump loses, study finds  —  Nearly half of Republicans say they won't accept the results of the presidential election if their candidate loses, and some of them say they would “take action to overturn” the results, according to data released Tuesday.",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/09/17/half-republicans-wont-accept-trump-loss-2024/75142477007/"
  },
  {
    "text": "Who's who in top picks for European Commission  —  European Commission President Ursula von der Leyen on Tuesday nominated her candidates for posts in the EU executive.  —  Each of the EU's 27 member states gets a seat at the Commission table.  Here are some of the key posts and nominees:",
    "url": "https://www.reuters.com/world/europe/whos-who-top-picks-european-commission-2024-09-17/"
  },
  {
    "text": "New details of Trump family crypto project released, including who can buy in … More than two hours into Republican former President Donald Trump's World Liberty Financial launch event on X Monday night, the team behind the Trump family's new crypto project finally unveiled a key detail … ",
    "url": "https://www.cnbc.com/2024/09/16/trump-crypto-world-liberty-financial.html"
  },
  {
    "text": "House Dems' ‘sleeper’ seats suddenly in sight  —  With assists from POLITICO's Congress team  —  MIDWEST MOMENTUM ... OR MIRAGE?  —  The Kamala Harris effect has House Democrats thinking they can gain seats in a place they've been losing for years: the Midwest.",
    "url": "https://www.politico.com/newsletters/inside-congress/2024/09/16/house-dems-sleeper-seats-suddenly-in-sight-00179407"
  },
  {
    "text": "Sean ‘Diddy’ Combs arrested at NYC hotel by Homeland Security amid sex trafficking investigation  —  Embattled rapper and hip hop mogul Sean “Diddy” Combs was arrested at a New York City hotel Monday night amid a federal sex trafficking investigation, officials said.",
    "url": "https://nypost.com/2024/09/16/us-news/sean-diddy-combs-arrested-in-nyc-amid-sex-trafficking-investigation/"
  },
  {
    "text": "J.D. Vance Admits He's Telling Racist Lies for Attention … J.D. Vance seemingly admitted that he and Donald Trump have been spreading racist lies about Haitian immigrants in Springfield, Ohio.  —  During an interview Sunday with CNN's Dana Bash, Vance flailed as he attempted to downplay … ",
    "url": "https://newrepublic.com/post/185986/jd-vance-admits-migrants-conspiracy-racist-lies"
  },
  {
    "text": "EU plans to raise up to €40bn in loans for Ukraine without US  —  Brussels drafts alternative funding solution to circumvent a Hungary veto on extending Russian assets freeze  —  The EU is preparing to provide up to €40bn in new loans for Ukraine by the end of the year regardless … ",
    "url": "https://www.ft.com/content/0684416f-58c6-4c76-ae54-140d34e30f67"
  }
]