[
  {
    "text": "Trump's co-defendants are already starting to turn against him  —  There's a nascent courtroom strategy by some people close to Donald Trump: Heap blame on the former president.  —  The finger-pointing among Donald Trump's inner circle has begun.  —  And as his four criminal cases march toward trials … ",
    "url": "https://www.politico.com/news/2023/09/05/trump-cases-defendants-flipping-00113910"
  },
  {
    "text": "Appeals court limits special counsel's effort to access Rep. Scott Perry's phone  —  Investigators have long been fighting to obtain records from Perry, who aided Donald Trump's effort to remain in power after the 2020 election.  —  A federal appeals court panel has partially blocked efforts … ",
    "url": "https://www.politico.com/news/2023/09/05/scott-perry-phone-court-ruling-00114005"
  },
  {
    "text": "BREAKING: More than 60 Atlanta training center activists named in RICO Indictment  —  The Georgia Attorney General's Office is prosecuting the case  —  X  —  More than five dozen activists were indicted on RICO charges last week over the ongoing efforts to halt construction of the city … ",
    "url": "https://www.ajc.com/news/crime/breaking-more-than-60-training-center-activists-named-in-rico-indictment/DQ6B6GHTAJAJRH4SLGIIBAMXR4/"
  },
  {
    "text": "Consistent Signs of Erosion in Black and Hispanic Support for Biden  —  It's a weakness that could manifest itself as low Democratic turnout even if Trump and Republicans don't gain among those groups.  —  President Biden is underperforming among nonwhite voters in New York Times/Siena College national polls … ",
    "url": "https://www.nytimes.com/2023/09/05/upshot/biden-trump-black-hispanic-voters.html"
  },
  {
    "text": "George Santos Insists He Is Not Working On A Plea Deal  —  The U.S. attorney prosecuting the case against freshman Rep. George Santos (R-N.Y.) has indicated they are involved in discussions on how to resolve the case.  However, in a series of texts to TPM, Santos insisted those talks … ",
    "url": "https://talkingpointsmemo.com/news/george-santos-insists-he-is-not-working-on-a-plea-deal"
  },
  {
    "text": "Alabama's congressional map is struck down again for diluting Black voters' power  —  A panel of three federal judges has struck down Alabama's latest map of congressional election districts for not following a court order to comply with the landmark Voting Rights Act.",
    "url": "https://www.npr.org/2023/09/05/1193749552/alabama-congressional-map"
  },
  {
    "text": "A Huge Threat to the U.S. Budget Has Receded.  And No One Is Sure Why.  —  For decades, runaway Medicare spending was the story of the federal budget.  —  Now, flat Medicare spending might be a bigger one.  —  Something strange has been happening in this giant federal program.",
    "url": "https://www.nytimes.com/interactive/2023/09/05/upshot/medicare-budget-threat-receded.html"
  },
  {
    "text": "New York AG asks judge to sanction Trump for rehashing failed legal arguments  — New York Attorney General Letitia James asked a judge Tuesday to sanction Donald Trump, other defendants, and their lawyers for rehashing the same legal arguments in James' big civil fraud lawsuit against the former president.",
    "url": "https://www.cnbc.com/2023/09/05/new-york-ag-asks-judge-to-sanction-trump-for-rehashing-failed-legal-arguments.html"
  },
  {
    "text": "Sen. Sheldon Whitehouse files ethics complaint over Justice Samuel Alito interview  —  The Rhode Island Democrat asked Chief Justice John Roberts to investigate comments made by Alito in a Wall Street Journal interview.  —  WASHINGTON — Democratic Sen. Sheldon Whitehouse is demanding … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/sen-sheldon-whitehouse-files-ethics-complaint-justice-samuel-alito-int-rcna103394"
  },
  {
    "text": "United Airlines requests nationwide ground stop, FAA says  —  The exact cause for grounding its fleet is unknown, but could be because of technological problems, according to authorities.  —  United Airlines has requested grounding its fleet nationwide, according to the Federal Aviation Administration.",
    "url": "https://www.nbcnews.com/news/us-news/united-airlines-requests-nationwide-ground-stop-faa-says-rcna103470"
  },
  {
    "text": "Why Hunter Biden might not be the slam dunk issue GOP commentators hoped  —  The controversy surrounding Hunter Biden is falling flat in the GOP primary.  —  Aides to President Joe Biden had braced for the Republican candidates to pile on the Hunter Biden attacks during the first primary debate.",
    "url": "https://www.politico.com/news/2023/09/05/hunter-biden-gop-primary-00113820"
  },
  {
    "text": "CNN Exclusive: Special counsel election probe continues with focus on fundraising, voting equipment breaches  —  Special counsel Jack Smith is still pursuing his investigation into efforts to overturn the 2020 election a month after indicting Donald Trump for orchestrating a broad conspiracy … ",
    "url": "https://www.cnn.com/2023/09/05/politics/special-counsel-election-probe-continues-fundraising-voting-equipment-breaches-sidney-powell/"
  },
  {
    "text": "CNN Poll: GOP voters' broad support for Trump holds, with less than half seriously worried criminal charges will harm his 2024 chances  —  Former President Donald Trump continues to hold what has proven to be an unshakeable position atop the Republican field of candidates vying … ",
    "url": "https://www.cnn.com/2023/09/05/politics/cnn-poll-trump-primary-criminal-charges/"
  },
  {
    "text": "Americans Are Losing Faith in the Value of College.  Whose Fault Is That?  —  For most people, the new economics of higher ed make going to college a risky bet.  —  A decade or so ago, Americans were feeling pretty positive about higher education.  Public-opinion polls in the early 2010s all told the same story.",
    "url": "https://www.nytimes.com/2023/09/05/magazine/college-worth-price.html"
  },
  {
    "text": "US says 52 mln air bag inflators should be recalled over rupture threat  —  U.S. auto safety regulators said Tuesday that 52 million air bag inflators produced by auto suppliers ARC Automotive and Delphi Automotive need to be recalled because they may rupture and send dangerous metal fragments flying.",
    "url": "https://www.reuters.com/business/autos-transportation/us-says-52-million-air-bag-inflators-are-unsafe-should-be-recalled-2023-09-05/"
  },
  {
    "text": "Capitol Hill doctor: McConnell did not have a stroke or seizure when freezing before cameras  —  The Capitol's attending physician, Brian Monahan, said in a new letter that Senate GOP Leader Mitch McConnell did not suffer a stroke or seizure - and is not suffering from Parkinson's disease … ",
    "url": "https://www.cnn.com/2023/09/05/politics/mitch-mcconnell-health-latest/"
  },
  {
    "text": "Judge Chutkan is The Boss  —  Trump's Day of Judgment in a D.C. court is coming, and a Black female jurist will be critical to his fate.  —  John Lauro was in a predicament last week that bodes well for the survival of the Republic.  Lauro is Donald Trump's lead attorney in the most important trial … ",
    "url": "https://washingtonmonthly.com/2023/09/05/judge-chutkan-is-the-boss/"
  },
  {
    "text": "How Democrats are bracing for a ‘MAGA shutdown’  —  Presented by DEMS STRIVE TO STICK TOGETHER  —  There's still a month to go, but Capitol Hill is girding for an appropriations breakdown — and Democrats are already strategizing over how to make Republicans pay for what some have already started calling a “MAGA shutdown.”",
    "url": "https://www.politico.com/newsletters/huddle/2023/09/05/how-democrats-are-bracing-for-a-maga-shutdown-00113940"
  },
  {
    "text": "Hispanic Democrats want Biden to cut the red tape for migrants  —  A group of Democrats is calling on the Biden administration to make a series of policy adjustments to help nationals of El Salvador, Honduras, Nepal and Nicaragua keep or obtain work permits.",
    "url": "https://thehill.com/latino/4188140-hispanic-democrats-tps-migrants-biden/"
  },
  {
    "text": "Famed hacker and Twitter whistleblower Peiter ‘Mudge’ Zatko is joining the Biden administration  —  Welcome to The Cybersecurity 202!  What were you all up to over our break?  I made it back to Indiana for a lovely wedding between two dear friends.  —  Was this forwarded to you?  Sign up here.",
    "url": "https://www.washingtonpost.com/politics/2023/09/05/cisa-makes-big-name-hire-its-crusade-against-insecure-products/"
  },
  {
    "text": "Biden tests negative for COVID-19 on Tuesday, will mask around others  —  President Biden tested negative for COVID-19 on Tuesday and will wear a mask while around others indoors after first lady Jill Biden tested positive for the virus a day earlier, the White House said.",
    "url": "https://thehill.com/homenews/administration/4187813-joe-biden-tests-negative-covid-tuesday/"
  },
  {
    "text": "Climate-linked ills threaten humanity  —  The floods came, and then the sickness.  —  Muhammad Yaqoob stood on his concrete porch and watched the black, angry water swirl around the acacia trees and rush toward his village last September, the deluge making a sound that was like nothing he had ever heard.",
    "url": "https://www.washingtonpost.com/climate-environment/interactive/2023/pakistan-extreme-heat-health-impacts-death/"
  },
  {
    "text": "Warnock Filed False Financial Disclosure In Violation Of Federal Law, Watchdog Charges  —  ‘This would be a major breach of Senate ethics laws that must immediately be investigated’  —  Sen. Raphael Warnock (D., Ga.) may have violated federal law by claiming a sketchy accounting loophole … ",
    "url": "https://freebeacon.com/democrats/warnock-filed-false-financial-disclosure-in-violation-of-federal-law-watchdog-charges/"
  }
]