[
  {
    "text": "EXCLUSIVE: Trump Makes Aggressive New Claim of Executive Power To Circumvent The Senate  —  In email obtained by TPM, White House claims that Trump can appoint whoever he wants - absent Congress.  —  The Trump White House has taken its attempt to seize direct control over the entire executive branch … ",
    "url": "https://talkingpointsmemo.com/news/exclusive-trump-makes-aggressive-new-claim-of-executive-power-to-circumvent-the-senate"
  },
  {
    "text": "For some federal workers, Trump and Musk offer a career springboard  —  Much of the U.S. civil service has recoiled at DOGE's attempts to revamp the government.  Others have been promoted.  —  Just now  —  Before Donald Trump returned to the White House, Charles Ezell had a mid-level IT job for a Macon … ",
    "url": "https://www.washingtonpost.com/business/2025/03/08/trump-musk-doge-workforce/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQxNDEwMDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQyNzg4Nzk5LCJpYXQiOjE3NDE0MTAwMDAsImp0aSI6Ijk4NWMwZGI1LTg3ZTgtNDIwYS1hZDdiLTdhZWI1NWQyYjQwNyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9idXNpbmVzcy8yMDI1LzAzLzA4L3RydW1wLW11c2stZG9nZS13b3JrZm9yY2UvIn0.9SguV22Wbc66q_fDCIM5PNy9wuiJD9rE-u6GzAthGAA&itid=gfta"
  },
  {
    "text": "'I don't trust a word of it': Federal workers deeply skeptical that Trump will rein in Musk  —  The president and Republicans have faced political blowback over steep cuts to the workforce.  —  Federal workers, Democrats and even some Republican lawmakers want to believe that President Donald … ",
    "url": "https://www.politico.com/news/2025/03/07/musk-trump-federal-workers-firing-00218733"
  },
  {
    "text": "I'm sad to share that I was fired today from the job I have poured my heart and soul into for the last three years.  I am so proud of the team we built in the Office of the Pardon Attorney, who will carry on our important work.  I'm very grateful for the many extraordinary people I've had the opportunity to connect with on this journey.",
    "url": "https://www.linkedin.com/posts/liz-oyer-245042206_im-sad-to-share-that-i-was-fired-today-from-activity-7303903623426560002-CneR"
  },
  {
    "text": "Republican Infighting Stalls Trump's ‘Big, Beautiful’ Tax Bill  —  Disagreements on spending cuts, the process and the debt limit combine to slow House-Senate agreement  —  WASHINGTON—President Trump's tax-cut plans are grinding through Congress in slow motion.  The tax cuts themselves aren't really the reason why.",
    "url": "https://www.wsj.com/politics/policy/trump-tax-bill-cuts-senate-roadblocks-c6a150fd"
  },
  {
    "text": "U.S. suspends commercial satellite imagery service to Ukraine  —  Maxar, a leading provider of orbital imagery, said that the U.S. government has decided to temporarily suspend services to Ukraine.  Soldiers on the ground are feeling the effects already.  —  The United States … ",
    "url": "https://www.washingtonpost.com/national-security/2025/03/07/maxar-ukraine-sateliite-imagery/"
  },
  {
    "text": "With Drones and North Korean Troops, Russia Pushes Back Ukraine's Offensive  —  Russia has retaken about two-thirds of the territory Ukraine seized last summer in the Kursk region of Russia, but at a fearful cost in lives.  —  Russian and North Korean forces have made significant battlefield advances … ",
    "url": "https://www.nytimes.com/2025/03/08/world/europe/ukraine-russia-north-korea-kursk.html"
  },
  {
    "text": "A Europe in Emotional Shock Grapples With a New Era  —  It remains to be seen how far President Trump's embrace of Russia and abandonment of traditional allies will go.  But “the West” may be gone.  —  For decades a core objective of the Soviet Union was to “decouple” the United States from Europe.",
    "url": "https://www.nytimes.com/2025/03/08/world/europe/a-europe-in-emotional-shock-grapples-with-a-new-era.html"
  },
  {
    "text": "Wisconsin Gov. Tony Evers joins lawsuit against President Trump, calls widespread federal workforce firings illegal  —  Natalie Eilbert Mary SpicuzzaMilwaukee Journal Sentinel  —  Gov. Tony Evers announced Friday that Wisconsin has joined a multistate lawsuit against President Donald … ",
    "url": "https://www.jsonline.com/story/news/politics/2025/03/07/evers-sues-trump-over-reckless-mass-firings-of-federal-workers/81982085007/"
  },
  {
    "text": "States sue Trump administration over mass firings of federal employees  —  The attorneys general of Washington D.C., Maryland, and 18 other states are suing the Trump administration over the mass firing of federal employees.  —  Their lawsuit joins several other legal challenges seeking relief for tens of thousands of fired workers.",
    "url": "https://www.npr.org/2025/03/08/nx-s1-5321864/trump-federal-employees-lawsuit-states"
  },
  {
    "text": "Fox News Suddenly Starts Panicking about Trump's Economy: “Weakening!” … Fox News figures are willing to propagandize on President Trump's behalf on pretty much every horror that he throws our way.  Do Fox personalities back Trump when he sells out our allies in tandem with murderous tyrant Vladimir Putin?",
    "url": "https://newrepublic.com/article/192505/fox-news-panicking-trump-economy"
  },
  {
    "text": "Trump Tightens Grip on FBI and Justice Department  —  FBI Director Kash Patel's early requests at agency included how to securely contact the Oval Office  —  WASHINGTON—Among Kash Patel's first questions as FBI director was one that underscored who was now in charge.",
    "url": "https://www.wsj.com/politics/policy/trump-fbi-doj-control-84785a0e?st=YcLpm8&reflink=mobilewebshare_permalink"
  },
  {
    "text": "Federal prosecutors who investigated Eric Adams put on leave by Justice Department: Sources  —  Two of three put on leave worked on the prosecution of Mayor Eric Adams.  —  Outside the U.S. District Court - Southern District of New York, Feb. 20, 2024, in New York.",
    "url": "https://abcnews.go.com/US/federal-prosecutors-investigated-eric-adams-put-leave-justice/story?id=119565695"
  },
  {
    "text": "Homeland Security ends TSA collective bargaining agreement, in effort to dismantle union protections  —  The Department of Homeland Security said Friday that it is ending the collective bargaining agreement with the tens of thousands of frontline employees at the Transportation Security Administration … ",
    "url": "https://apnews.com/article/collective-bargaining-agreement-tsa-homeland-security-e3eb1d5e0ae8e1b4a6fdb87cd7f6bd39"
  },
  {
    "text": "Trump Allies Seek Pardons From an Emboldened White House  —  The new administration has created a system for awarding clemency that underscores the president's grievances about what he sees as the political weaponization of the justice system.  —  On the morning of Jan. 6, 2021 … ",
    "url": "https://www.nytimes.com/2025/03/08/us/politics/trump-pardons-clemency.html"
  },
  {
    "text": "Killing PEPFAR means killing millions of people  —  All to save 0.08 percent of the budget. … A lot has happened in the last six weeks, to put it mildly, and it can be hard to see through the dust and tell what's actually ongoing.  —  The government threatened tariffs, backed off … ",
    "url": "https://www.vox.com/future-perfect/402944/pepfar-hiv-donald-trump-elon-musk-global-health"
  },
  {
    "text": "Trump names Fox News's Laura Ingraham, Maria Bartiromo to Kennedy Center board  —  President Trump announced Friday he's appointing Fox News hosts Laura Ingraham and Maria Bartiromo to the board of the Kennedy Center, after naming himself chair of the performing arts center last month.",
    "url": "https://thehill.com/blogs/in-the-know/5183864-trump-laura-ingraham-maria-bartiromo-kennedy-center/"
  },
  {
    "text": "DOGE Has Deployed Its GSAi Custom Chatbot for 1,500 Federal Workers  —  Elon Musk's DOGE team is automating tasks as it continues its purge of the federal workforce.  —  Elon Musk's so-called Department of Government Efficiency has deployed a proprietary chatbot called GSAi to 1,500 federal workers … ",
    "url": "https://www.wired.com/story/gsai-chatbot-1500-federal-workers/"
  },
  {
    "text": "Entire Phoenix field office of General Services Administration fired, says court executive  —  The entire Phoenix field office of the U.S. General Services Administration has been fired, according to a federal court administrator.  —  The field office “was the subject of a reduction in force … ",
    "url": "https://www.azcentral.com/story/news/local/phoenix/2025/03/07/phoenix-field-office-firings-major-impact-federal-courts/81953179007/"
  },
  {
    "text": "Many Fulbright scholars say they feel stranded after the Trump administration suspended their funding  —  ATHENS, Ohio (WOUB) - When an Ohio University international student woke up last Friday, he was expecting to see a deposit in his bank account, but he found an email in his inbox instead.",
    "url": "https://woub.org/2025/03/07/fulbright-scholars-feel-stranded-trump-administration-suspends-funding/"
  },
  {
    "text": "Charlie Kirk warns “all these campuses that don't treat us well at Turning Point USA” may have their funding cut  —  Pro-Trump podcaster Kyle Forgeard talks about YouTube's event during Trump's inauguration weekend  —  Media Matters weekly newsletter, March 7  —  Broadcast correspondents covering climate change in 2024",
    "url": "https://www.mediamatters.org/charlie-kirk/charlie-kirk-warns-all-these-campuses-dont-treat-us-well-turning-point-usa-may-have"
  },
  {
    "text": "Meet Amy Gleason, the DOGE administrator who may — or may not — be wielding extraordinary power  —  When her daughter was diagnosed with a rare autoimmune disease in 2010, Amy Gleason attacked the challenge.  —  She carried binders of medical records to doctors' appointments across six … ",
    "url": "https://apnews.com/article/doge-amy-gleason-musk-trump-caresync-62a0c13b8ecf153d449f09537d45e630"
  }
]