[
  {
    "text": "Trump says he'd ‘fire’ special counsel Jack Smith in ‘two seconds’ if elected again  —  Smith has led the Justice Department's investigations into Donald Trump's efforts to overturn the 2020 presidential election and the hoarding of classified documents.  —  Former president Donald Trump … ",
    "url": "https://www.washingtonpost.com/elections/2024/10/24/trump-fire-jack-smith/"
  },
  {
    "text": "Waukesha mayor endorses Kamala Harris; red city mayor plans to vote blue  —  WAUKESHA, Wis. - The mayor of Waukesha, a key Republican stronghold, exclusively told FOX6 News he's voting for Democrat Kamala Harris for president.  —  It's a Republican city in Wisconsin's largest Republican county.",
    "url": "https://www.fox6now.com/news/waukesha-mayor-endorses-kamala-harris"
  },
  {
    "text": "Fox News edited Trump's rambling answers and false claims in barbershop interview, full video shows  —  New York CNN  —  The Fox News Channel's recent segment about Donald Trump's “surprise” visit to a barbershop in the Bronx resembled a campaign ad for the former president's reelection.",
    "url": "https://www.cnn.com/2024/10/24/media/fox-news-edit-trump-barbershop-interview/"
  },
  {
    "text": "Washington Post staffers suspect owner Jeff Bezos holding up Kamala Harris endorsement: report  —  Washington Post staffers are growing restless over the left-leaning paper's silence on endorsing Vice President Kamala Harris for president — with many suspecting that owner Jeff Bezos is behind the delay, according to a report.",
    "url": "https://nypost.com/2024/10/24/media/washington-post-staffers-suspect-jeff-bezos-holding-up-harris-endorsement/"
  },
  {
    "text": "Did the ‘L.A. Times’ and other news outlets pull punches to appease Trump?  —  Recent episodes involving major U.S. news organizations have stoked fears that outlets are preemptively self-censoring coverage that could offend former President Donald Trump, who remains neck-and-neck in the polls … ",
    "url": "https://www.npr.org/2024/10/24/nx-s1-5163293/la-times-editor-resigns-trump-msnbc-washington-post"
  },
  {
    "text": "Marist North Carolina Poll: U.S. Presidential Contest in North Carolina, October 2024  —  Trump +2 Points in North Carolina  —  Two points separate former President Donald Trump and Vice President Kamala Harris among North Carolina likely voters including those who are undecided yet leaning toward a candidate.",
    "url": "https://maristpoll.marist.edu/polls/marist-north-carolina-poll-u-s-presidential-contest-in-north-carolina-october-2024/"
  },
  {
    "text": "NEW WSJ POLL: TRUMP TAKES LEAD NATIONALLY  —  Former President Donald Trump has taken a narrow lead over Vice President Kamala Harris with less than two weeks until election day, according to a Wall Street Journal poll published Thursday. … The two percentage points are within the poll's margin of error.",
    "url": "https://dailycaller.com/2024/10/24/wsj-wall-street-journal-poll-donald-trump-leads-kamala-harris-october/"
  },
  {
    "text": "Musk's super PAC skips daily $1 million swing state giveaway after DOJ warning … - The SpaceX CEO had pledged to give away $1 million every day to registered voters in swing states who sign the super PAC's petition in favor of the First and Second Amendments.",
    "url": "https://www.axios.com/2024/10/24/elon-musk-million-dollar-giveaway-doj-warning"
  },
  {
    "text": "Arrest made after Phoenix USPS collection mailbox fire damages ballots overnight  —  Phoenix Fire Department's arson task force now investigating the fire  —  PHOENIX — An arrest has reportedly been made after a Phoenix United States Postal Service mailbox was believed to have been set on fire overnight … ",
    "url": "https://www.abc15.com/news/region-phoenix-metro/central-phoenix/ballots-damaged-after-usps-mail-collection-box-fire-near-7th-avenue-and-indian-school-road"
  },
  {
    "text": "Gay voters are smitten with Kamala Harris  —  Republicans are uninterested in, or hostile to, a growing voter bloc  —  In the days after President Joe Biden announced his withdrawal from the election, a short clip from 2013 went viral on Twitter.  It showed the then attorney-general … ",
    "url": "https://www.economist.com/united-states/2024/10/24/gay-voters-are-smitten-with-kamala-harris"
  },
  {
    "text": "Walz called Upton.  But the former GOP lawmaker said he decided to endorse Harris on his own.  —  Former Rep. Fred Upton isn't abandoning his party — he says he plans to vote for Rep. Mike Rogers for Michigan's open Senate seat.  —  Retired GOP Rep. Fred Upton got a phone call … ",
    "url": "https://www.politico.com/news/2024/10/24/upton-dishes-on-harris-endorsement-00185332"
  },
  {
    "text": "There Are Four Anti-Trump Pathways We Failed to Take.  There Is a Fifth.  —  Democratic self-rule contains a paradox.  It is a system premised on openness and competition.  Any ambitious party or politician should have a shot at running for office and winning.  But what if a major candidate seeks to dismantle that very system?",
    "url": "https://www.nytimes.com/2024/10/24/opinion/democracy-defense-us-authoritarian.html?unlocked_article_code=1.Uk4.fPjE.y_WhudBhUHpo&smid=url-share"
  },
  {
    "text": "Franklin & Marshall Poll Release: October 2024  —  I'm writing to share our summary report for the October 2024 Franklin & Marshall College Poll.  I've highlighted a few of the key findings below, but I encourage you to read the full report, which is also included.",
    "url": "https://www.fandmpoll.org/franklin-marshall-poll-release-october-2024/"
  },
  {
    "text": "Kamala Harris' husband Doug Emhoff slapped me in the face so hard I spun around ... I'm disgusted by his fake ‘perfect spouse’ persona  — Second Gentleman's accuser bravely breaks her silence on ‘slap’  —  Doug Emhoff's ex-girlfriend has spoken exclusively to DailyMail.com claiming … ",
    "url": "https://www.dailymail.co.uk/news/article-13981101/doug-emhoff-ex-girlfriend-slap-flirt-allegations-kamala-harris.html"
  },
  {
    "text": "Trump Flirts With the Ultimate Tax Cut: No Income Taxes at All  —  The former president has repeatedly praised a period in American history when there was no income tax, and the country relied on tariffs to fund the government.  —  Former President Donald J. Trump has spent … ",
    "url": "https://www.nytimes.com/2024/10/24/us/politics/donald-trump-tax-policy.html?unlocked_article_code=1.Uk4.SGjJ.N1oLDWOGe53P&smid=url-share"
  },
  {
    "text": "'There's People That Are Absolutely Ready to Take on a Civil War'  —  Tucker Carlson's eyes narrowed as he conjured the image.  A Donald Trump victory, he said at a campaign event in Gwinnett County, Georgia, last night, “will be a middle finger wagging in the face of the worst people in the English-speaking world.”",
    "url": "https://www.theatlantic.com/politics/archive/2024/10/trump-duluth-georgia-rally/680354/"
  },
  {
    "text": "Trump says he's open to pardoning Hunter Biden  —  Donald Trump said Thursday he's open to pardoning Hunter Biden if he's reelected — a significant reversal after years of lobbing attacks at the legal issues faced by the president's son as part of his “Biden crime family” talking point.",
    "url": "https://www.politico.com/live-updates/2024/10/24/2024-elections-live-coverage-updates-analysis/donald-trump-pardon-hunter-biden-00185320"
  },
  {
    "text": "Stevie Nicks: ‘I Believe in the Church of Stevie’  —  In a nearly four-hour interview, the legendary singer goes deep on longevity, Kamala Harris, why Fleetwood Mac are finished and much more  —  E  —  VERY SECOND FEELS like an eternity when you're hovering four inches from Stevie Nicks, noodling around with her blouse.",
    "url": "https://www.rollingstone.com/music/music-features/stevie-nicks-fleetwood-mac-kamala-harris-new-music-1235140437/"
  },
  {
    "text": "What Is Usha Vance Thinking?  —  The veep candidate's wife is the child of immigrants, a former Democrat, a highly skilled lawyer — and a total mystery.  —  In the fall of 2018, during the convulsive, unformed days after Christine Blasey Ford went public to accuse Brett Kavanaugh of sexual assault … ",
    "url": "https://www.thecut.com/article/usha-vance-trump-jd-vance-interview.html"
  },
  {
    "text": "‘Take Back the States’: The Far-Right Sheriffs Ready to Disrupt the Election  —  Constitutional Sheriffs are duly elected lawmen who believe they answer only to god.  They've spent the last six months preparing to stop a “stolen” election—by any means necessary.",
    "url": "https://www.wired.com/story/constitutional-sheriffs-disrupt-election/"
  },
  {
    "text": "Trump ignored disaster aid request from political rival … In early September 2020, wildfires tore through eastern Washington state, obliterating tens of millions of dollars of property, displacing hundreds of rural residents and killing a 1-year-old boy.  —  But then-President Donald Trump refused … ",
    "url": "https://www.eenews.net/articles/trump-ignored-disaster-aid-request-from-political-rival/"
  },
  {
    "text": "Trying to Find Trump's Ground Game in Pennsylvania  —  Four and eight years ago, there was a major Republican get-out-the-vote effort.  This time is different.  —  Elon Musk speaks at Life Center Church in Harrisburg, Pennsylvania, October 19, 2024.  Musk and his super PAC have taken over Donald Trump's national canvassing effort.",
    "url": "https://prospect.org/politics/2024-10-24-trump-ground-game-pennsylvania/"
  },
  {
    "text": "Election-Betting Site Polymarket Says Trump Whale Identified as French Trader  — User hasn't attempted to manipulate the market, probe shows  — Betting platform shows higher chance of Trump win than rivals  —  A trader who spent more than $45 million on Polymarket bets that Donald Trump … ",
    "url": "https://www.bloomberg.com/news/articles/2024-10-24/polymarket-says-trump-whale-identified-as-french-trader"
  },
  {
    "text": "Former (and Future) President Donald Trump On Chairman Xi, VP Harris, And The Closing Days Of Campaign 2024  —  Former President Trump joined me this morning:  —  Audio:  —  10-24hhs-trump  —  Transcript:  —  HH: Good morning.  I am back now with Former President, and I believe future President Donald Trump.",
    "url": "https://hughhewitt.com/former-and-future-president-donald-trump-on-chairman-xi-vp-harris-and-the-closing-days-of-campaign-2024"
  },
  {
    "text": "What's Preventing Harris From Crushing Trump Is Shockingly Simple  —  As Elon Musk's rabid pro-Trump mania makes clear, billionaires are wielding their financial might in this year's presidential election far more than in any previous campaign—and far more openly, too.",
    "url": "https://slate.com/news-and-politics/2024/10/trump-kamala-harris-election-elon-musk-gates-polls-2024.html"
  }
]