[
  {
    "text": "Biden Cites Threat From ‘Extreme Wealth’ in Farewell Address  — President sees ‘dangerous concentration of power’ in the US  — Biden offers direct critique of Trump and his allies  —  President Joe Biden warned Americans of a “dangerous concentration of power” in the hands of a … ",
    "url": "https://www.bloomberg.com/news/articles/2025-01-16/biden-warns-of-threat-from-extreme-wealth-in-farewell-address"
  },
  {
    "text": "Full Transcript of President Biden's Farewell Address  —  The president delivered the 17-minute speech from the Oval Office in the White House. … My fellow Americans, I'm speaking to you tonight from the Oval Office.  Before I begin, let me speak to important news from earlier today.",
    "url": "https://www.nytimes.com/2025/01/15/us/politics/full-transcript-of-president-bidens-farewell-address.html"
  },
  {
    "text": "Biden administration looks for ways to keep TikTok available in the U.S.  —  Barring action by the Supreme Court, a ban in the U.S. on the popular app is set to begin on Sunday.  —  President Joe Biden's administration is considering ways to keep TikTok available in the U.S. if a ban that's scheduled … ",
    "url": "https://www.nbcnews.com/politics/joe-biden/biden-administration-keep-tiktok-available-us-rcna187902"
  },
  {
    "text": "Trump considers executive order hoping to ‘save TikTok’ from ban or sale in U.S. law  —  The self-styled master dealmaker is exploring unconventional ways to rescue the Chinese-owned video app from a nationwide ban, arguing it will help him reach an adoring audience throughout his second term.",
    "url": "https://www.washingtonpost.com/technology/2025/01/15/trump-tiktok-ban-executive-order/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM2OTE3MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM4Mjk5NTk5LCJpYXQiOjE3MzY5MTcyMDAsImp0aSI6ImJkNTk1YTExLTkzYmYtNGVlZC04NjlmLTZhZTFlNjZjM2QwOCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS90ZWNobm9sb2d5LzIwMjUvMDEvMTUvdHJ1bXAtdGlrdG9rLWJhbi1leGVjdXRpdmUtb3JkZXIvIn0.EocdDoRLKMsnJf40z2qKZrM9iD0C4P7tG16xyH3VxF0"
  },
  {
    "text": "Google CEO to attend inauguration  —  Google CEO Sundar Pichai will join the growing list of tech executives sitting on the dais as President-elect Donald Trump is sworn into office on Monday, according to a person familiar with the company's plans who was not authorized to speak publicly.",
    "url": "https://www.politico.com/live-updates/2025/01/15/congress/google-ceo-to-attend-inauguration-00198516"
  },
  {
    "text": "'Everything's on the table': Jordan mulls calling Jack Smith to Judiciary  —  House Judiciary Committee chair Jim Jordan says he is mulling whether to call Jack Smith, the special counsel who led the federal investigations into President-elect Donald Trump, to testify before his committee.",
    "url": "https://www.politico.com/live-updates/2025/01/15/congress/jim-jordan-jack-smith-trump-00198533"
  },
  {
    "text": "Johnson Ousts Turner as Intelligence Chairman, Bowing to Trump  —  Representative Michael R. Turner, Republican of Ohio, had at times been critical of the president-elect.  He told people that he was axed after an edict from Mar-a-Lago.  —  Speaker Mike Johnson on Wednesday removed … ",
    "url": "https://www.nytimes.com/2025/01/15/us/politics/mike-turner-house-intelligence.html"
  },
  {
    "text": "Johnson removes Mike Turner as House Intelligence chair  —  The Ohio Republican has been an outspoken advocate for Ukraine funding and other hawkish national security stances.  —  Speaker Mike Johnson has removed Rep. Mike Turner as chair of the House Permanent Select Committee on Intelligence … ",
    "url": "https://www.politico.com/news/2025/01/15/johnson-removes-mike-turner-as-intel-chair-00198522"
  },
  {
    "text": "A Euphoric Tech Industry Is Ready to Celebrate Trump and Itself  —  The elite of Silicon Valley are set to revel in their new clout during a long weekend of inaugural parties as President-elect Donald J. Trump is set to resume power.  —  A party at the Beaux-Arts mansion of the venture capitalist Peter Thiel.",
    "url": "https://www.nytimes.com/2025/01/16/us/politics/trump-tech-inauguration-parties.html"
  },
  {
    "text": "Jeff Bezos' Blue Origin launches massive New Glenn rocket into orbit on 1st flight (video)  —  New Glenn just earned its wings.  —  COCOA BEACH, Florida  —  Blue Origin's New Glenn rocket just earned its wings.  —  New Glenn launched for the first time ever this morning … ",
    "url": "https://www.space.com/space-exploration/launches-spacecraft/jeff-bezos-blue-origin-launches-massive-new-glenn-rocket-into-orbit-on-1st-flight-video"
  },
  {
    "text": "UnitedHealth, employer of slain exec Brian Thompson, found to have overcharged some cancer patients for drugs by over 1,000%  — OptumRx, the group's pharmacy benefit manager, along with its two main peers, Express Scripts and CVS Caremark Rx, have pocketed an extra $7.3 billion over cost thanks … ",
    "url": "https://fortune.com/2025/01/15/ftc-pbms-unitedhealth-brian-thompson-cvs-caremark-cigna-pharmacy-benefit-managers/"
  },
  {
    "text": "Live Updates: Disputes Hold Up Israeli Cabinet Vote on Cease-Fire Deal  —  The agreement, which would include the release of hostages, was met with cautious optimism.  But Israel's cabinet needs to ratify the deal, and the prime minister's office said Hamas was reneging on parts of it, an accusation that the group rejected.",
    "url": "https://www.nytimes.com/live/2025/01/16/world/israel-hamas-gaza-cease-fire"
  },
  {
    "text": "We Deserve Pete Hegseth  —  First let me hit you with some realities:  — The Secretary General of NATO, Mark Rutte, has said that the West is not prepared for the challenges that will come over the next five years and that it's time to “shift to a wartime mind-set.”",
    "url": "https://www.nytimes.com/2025/01/15/opinion/pete-hegseth-hearings-defense.html"
  },
  {
    "text": "These lawmakers made a fortune in the stock market last year  —  Federal government employees who own stock in a company are prohibited by law from being involved in any matter that may impact the financial interests of the company — whether or not the matter can plausibly impact the stock price.",
    "url": "https://popular.info/p/these-lawmakers-made-a-fortune-in"
  },
  {
    "text": "House Democrat To Introduce Bill Against Trans Military Ban  —  The legislation from Rep. Sara Jacobs of California would seek to counter a move Donald Trump has promised to make as early as his first day back in office.  —  LOADING  —  President-elect Donald Trump has promised to sign … ",
    "url": "https://www.huffpost.com/entry/democrat-california-bill-countering-trump-ban-trans-military-members_n_67886630e4b086654c6ecc26"
  },
  {
    "text": "Trump, Musk dined with Microsoft CEO at Mar-a-Lago  —  The Scoop  —  President-elect Donald Trump and his running mate JD Vance had lunch with Microsoft CEO Satya Nadella Wednesday, along with Elon Musk, according to people briefed on the meeting.  —  Microsoft President Brad Smith … ",
    "url": "https://www.semafor.com/article/01/15/2025/trump-musk-dined-with-microsoft-ceo-satya-nadella-at-mar-a-lago"
  },
  {
    "text": "CNN Poll: Biden leaves office with his approval rating matching the lowest of his term  —  President Joe Biden will leave office with his approval rating remaining at the lowest level of his term and his favorability rating close to his personal low, according to a new CNN poll conducted by SSRS.",
    "url": "https://www.cnn.com/2025/01/15/politics/cnn-poll-biden-presidency/"
  },
  {
    "text": "Trump Unveils His White House Blacklist  —  Christmas may be over, but President-elect Donald Trump still has quite a few names on his naughty list.  In a Truth Social post published Wednesday night, the incoming 47th president of the United States named a handful of former White House staffers as … ",
    "url": "https://www.thedailybeast.com/trump-unveils-his-white-house-blacklist/"
  },
  {
    "text": "Rep. Byron Donalds makes his move ahead of expected 2026 Florida gubernatorial bid  —  The Republican congressman has told donors and other Florida political players that he is running to replace Gov. Ron DeSantis, who is term-limited.  —  WEST PALM BEACH, Fla. — Rep. Byron Donalds, R-Fla. … ",
    "url": "https://www.nbcnews.com/politics/politics-news/rep-byron-donalds-gubernatorial-bid-2026-rcna187721"
  },
  {
    "text": "Trump encourages Vivek Ramaswamy to seek Ohio's open Senate seat  —  The co-leader of the “Department of Government Efficiency” may move to replace JD Vance, though other contenders remain.  —  President-elect Donald Trump has encouraged billionaire biotech entrepreneur Vivek Ramaswamy … ",
    "url": "https://www.washingtonpost.com/business/2025/01/15/vivek-ramaswamy-ohio-senate-trump/"
  },
  {
    "text": "Time Is Running Out to Recover Up to $135 Billion in Pilfered Jobless Benefits  —  Statute of limitations looms for what some lawmakers say might be ‘greatest heist’ of taxpayer dollars ever  —  In 2024, federal prosecutors filed charges in an alleged transnational scheme to launder tens … ",
    "url": "https://www.wsj.com/politics/policy/time-is-running-out-to-recover-up-to-135-billion-in-pilfered-jobless-benefits-39505ea7"
  },
  {
    "text": "Former Presidents Obama, Clinton and Bush won't attend Trump's inaugural lunch  —  The three former presidents will attend the swearing-in ceremony earlier in the day.  —  Former Presidents Barack Obama, Bill Clinton and George W. Bush will not attend President-elect Donald Trump's traditional inaugural lunch.",
    "url": "https://www.nbcnews.com/politics/white-house/obama-clinton-bush-skip-trump-inauguration-lunch-rcna187899"
  },
  {
    "text": "For LA water issues, misinformation spreads nearly as fast as the wildfires  —  A billionaire couple was accused of withholding water that could help stop Los Angeles' massive wildfires.  Democratic leadership was blamed for fire hydrants running dry and for an empty reservoir.",
    "url": "https://apnews.com/article/california-los-angeles-wildfires-water-misinformation-27b0059719e8b475d452030c221fe544"
  },
  {
    "text": "Will Lewis's first year at ‘Washington Post’: Cancellations, red ink and an exodus  —  One debacle after another has engulfed The Washington Post since veteran newspaper executive Will Lewis became CEO and publisher a year ago this month, with the charge from owner Jeff Bezos to make the storied newspaper financially sustainable.",
    "url": "https://www.npr.org/2025/01/15/nx-s1-5258221/washington-post-will-lewis-jeff-bezos-year-one"
  },
  {
    "text": "A Year of Empty Threats and a “Smokescreen” Policy: How the State Department Let Israel Get Away With Horrors in Gaza  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up to receive our biggest stories as soon as they're published.",
    "url": "https://www.propublica.org/article/biden-blinken-state-department-israel-gaza-human-rights-horrors"
  },
  {
    "text": "Trump's pick for energy secretary rejects linking climate change and wildfires  —  Chris Wright's arguments drew scrutiny from Senate Democrats during his confirmation hearing for the Energy Department post.  —  Oil executive Chris Wright, President-elect Donald Trump's pick to lead the Energy Department … ",
    "url": "https://www.washingtonpost.com/climate-environment/2025/01/15/wildfires-chris-wright-trump-energy/"
  }
]