[
  {
    "text": "Behind the Curtain: Unbendable Biden vs. breaking-point Dems … Both plan fierce public and private campaigns to see who buckles.  — It won't be him, Biden says publicly and privately. … These Democrats, further deflated by Biden's high-stakes ABC interview, believe there's nothing … ",
    "url": "https://www.axios.com/2024/07/07/biden-democrats-drop-election-campaign"
  },
  {
    "text": "Sen. Graham thinks Biden will “be replaced” as Democratic nominee … - “If she does become the nominee, this is a dramatically different race than it is right now, today. … - Trump advisers told Axios the campaign would launch scathing attacks on Harris should she pick up the baton … ",
    "url": "https://www.axios.com/2024/07/07/trump-biden-graham-cognitive-tests"
  },
  {
    "text": "French left set to beat Le Pen's far right in election shock  —  PARIS  —  The left-wing alliance in France is on course to win the most seats in parliament in a dramatic election upset, dealing a surprise blow to the far-right party of Marine Le Pen, according to early estimates.",
    "url": "https://www.politico.eu/article/france-legislative-election-2024-second-round-front-populaire-jean-luc-melenchon-raphael-glucksmann-shock-victory/"
  },
  {
    "text": "2024 France election live updates: Prime Minister Attal plans to resign as projections show leftists lead  —  The first projections in the 2024 French legislative election say leftists have won most seats.  The surprise projections put President Emmanuel Macron's centrist alliance in second and the far right in third.",
    "url": "https://apnews.com/live/france-election-results-updates-round-2-macron-le-pen"
  },
  {
    "text": "The world wasn't ready for Trump in 2016.  It's not making that mistake this time.  —  In 2016, no one in the world was ready for President Trump.  America's NATO allies aren't making the same mistake this time.  —  In Brussels, NATO officials have devised a plan to lock in long-term military support … ",
    "url": "https://www.politico.com/news/2024/07/07/nato-prepare-trump-2024-00165522"
  },
  {
    "text": "Playbook: Biden's lesson in political first aid  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  MUST READ — “Secret Meetings, Private Threats and a Massive Arms Race: How the World is Preparing for Trump,” by Paul McLeary, Christoph Schiltz, Stefanie Bolzen, Jacopo Barigazzi and Philipp Fritz:",
    "url": "https://www.politico.com/newsletters/playbook/2024/07/07/bidens-lesson-in-political-first-aid-00166719"
  },
  {
    "text": "Trump running mate decision nears, with Vance, Rubio at center of talks  —  The campaign is eyeing an announcement by July 15th and internal talks have focused heavily on the two senators.  —  Former president Donald Trump's campaign is aiming to announce his running mate by July 15 … ",
    "url": "https://www.washingtonpost.com/elections/2024/07/06/trump-running-mate-vance-rubio-republicans/"
  },
  {
    "text": "House Republicans request interview with White House physician  —  The GOP investigation is the latest sign of the growing political fallout from President Biden's debate performance.  —  House Republicans are opening an investigation into President Joe Biden's doctor in the wake … ",
    "url": "https://www.politico.com/news/2024/07/07/house-republicans-biden-physician-00166725"
  },
  {
    "text": "NY Times reporter hilariously sticks it to ‘sex abuser’ Trump after Truth Social attack  —  The New York Times' Peter Baker got the last laugh on Sunday after former president Donald Trump smeared Baker and his wife, Susan Glasser of the New Yorker, early Sunday morning on Truth Social.",
    "url": "https://www.rawstory.com/trump-abuser/"
  },
  {
    "text": "‘I have to hit pause here’: J.D. Vance flips out on NBC host as she fact-checks him  —  In just the first half of Sen. J.D. Vance's interview with “Meet the Press” host Kristen Welker, the Ohio Republican waved his hands and snapped at her as she attempted to fact-check him.",
    "url": "https://www.alternet.org/jd-vance-2668697406/"
  },
  {
    "text": "Rep. Adam Schiff says Biden needs to ‘win overwhelmingly’ or ‘pass the torch’: Full interview  —  Democratic Rep. Adam Schiff (Calif.) exclusively joins Meet the Press to talk about the state of President Joe Biden's re-election campaign.",
    "url": "https://www.nbcnews.com/meet-the-press/video/biden-needs-to-win-overwhelmingly-or-pass-the-torch-rep-adam-schiff-says-full-interview-214352965535"
  },
  {
    "text": "The lingering focus on Biden's shaky debate obscures Trump's major verbal miscues  —  President Joe Biden dug himself a hole and now he is trying to climb out.  But many fellow Democrats and some in the media keep shoveling dirt on him.One 20-minute TV interview was never going to swing … ",
    "url": "https://www.inquirer.com/opinion/editorials/trump-verbal-miscues-presidential-debate-20240706.html"
  },
  {
    "text": "Wildlife Protections Take a Back Seat to SpaceX's Ambitions … Starship, the upper stage of SpaceX's new rocket, at its launchpad in Boca Chica, Texas.  Conservationists are concerned with the environmental impact space operations have on the area.  —  As Elon Musk's Starship … ",
    "url": "https://www.nytimes.com/2024/07/07/us/politics/spacex-wildlife-texas.html"
  },
  {
    "text": "Hawaii governor says Biden could decide within days whether to remain in the presidential race  —  U.S. President Joe Biden could make a decision within days whether to remain a candidate for reelection, said Hawaii's governor who participated in a recent meeting with Biden and other Democratic governors … ",
    "url": "https://apnews.com/article/biden-hawaii-governor-election-decision-6da41f7987622fd838858a6535e9ad34"
  },
  {
    "text": "Mike Lee spreads fake claim of Biden medical emergency on Air Force One  —  Utah Senator then attacked media for being untrustworthy, during frenzied posting on social media  —  On Friday evening, Utah Sen. Mike Lee used his personal X/Twitter account to amplify a baseless claim … ",
    "url": "https://www.sltrib.com/news/politics/2024/07/06/mike-lee-spreads-fake-claim-biden/"
  }
]