[
  {
    "text": "Federal Court Again Strikes Down Alabama's Congressional Map  —  Republicans failed to comply with a court order to create a second majority-Black district or something “close to it,” the judicial panel said.  —  A panel of federal judges rejected Alabama's latest congressional map on Tuesday … ",
    "url": "https://www.nytimes.com/2023/09/05/us/politics/alabama-congressional-map.html"
  },
  {
    "text": "Alabama's congressional map is struck down again for diluting Black voters' power  —  A panel of three federal judges has struck down Alabama's latest map of congressional election districts for not following a court order to comply with the landmark Voting Rights Act.",
    "url": "https://www.npr.org/2023/09/05/1193749552/alabama-congressional-map"
  },
  {
    "text": "Trump's co-defendants are already starting to turn against him  —  There's a nascent courtroom strategy by some people close to Donald Trump: Heap blame on the former president.  —  The finger-pointing among Donald Trump's inner circle has begun.  —  And as his four criminal cases march toward trials … ",
    "url": "https://www.politico.com/news/2023/09/05/trump-cases-defendants-flipping-00113910"
  },
  {
    "text": "Three service secretaries to Tuberville: Stop this dangerous hold on senior officers  —  Carlos Del Toro is secretary of the Navy.  Frank Kendall is secretary of the Air Force.  Christine Wormuth is secretary of the Army.  —  As the civilian leaders of the Navy, Air Force, Space Force and Army … ",
    "url": "https://www.washingtonpost.com/opinions/2023/09/04/army-navy-air-force-secretaries-tuberville-military-hold/"
  },
  {
    "text": "CNN Exclusive: Special counsel election probe continues with focus on fundraising, voting equipment breaches  —  Special counsel Jack Smith is still pursuing his investigation into efforts to overturn the 2020 election a month after indicting Donald Trump for orchestrating a broad conspiracy … ",
    "url": "https://www.cnn.com/2023/09/05/politics/special-counsel-election-probe-continues-fundraising-voting-equipment-breaches-sidney-powell/"
  },
  {
    "text": "Why Hunter Biden might not be the slam dunk issue GOP commentators hoped  —  The controversy surrounding Hunter Biden is falling flat in the GOP primary.  —  Aides to President Joe Biden had braced for the Republican candidates to pile on the Hunter Biden attacks during the first primary debate.",
    "url": "https://www.politico.com/news/2023/09/05/hunter-biden-gop-primary-00113820"
  },
  {
    "text": "Consistent Signs of Erosion in Black and Hispanic Support for Biden  —  It's a weakness that could manifest itself as low Democratic turnout even if Trump and Republicans don't gain among those groups.  —  President Biden is underperforming among nonwhite voters in New York Times/Siena College national polls … ",
    "url": "https://www.nytimes.com/2023/09/05/upshot/biden-trump-black-hispanic-voters.html"
  },
  {
    "text": "Disney tickets, PS5s, and big-screen TVs: Florida parents exploit DeSantis' school vouchers  —  Florida parents are taking advantage of an expanded school voucher program championed by Governor Ron DeSantis (R), according to messages from private Facebook groups obtained by Popular Information.",
    "url": "https://popular.info/p/disney-tickets-ps5s-and-big-screen"
  },
  {
    "text": "The 14th Amendment Trump Panic  —  Banning Trump from the ballot under Section 3 of the post-Civil War constitutional amendment would harm U.S. law and democracy.  —  You'd think Donald Trump's opponents would learn.  When they fight the former President in the voting booth … ",
    "url": "https://www.wsj.com/articles/the-14th-amendment-donald-trump-panic-election-ballot-constitution-amendment-candidate-president-fb3d65?mod=followamazon"
  },
  {
    "text": "First lady Jill Biden tests positive for Covid-19  —  First lady Jill Biden tested positive for Covid-19 Monday, the White House announced.  —  “This evening, the First Lady tested positive for COVID-19.  She is currently experiencing only mild symptoms.  She will remain at their home … ",
    "url": "https://www.cnn.com/2023/09/04/politics/jill-biden-covid/"
  },
  {
    "text": "Fan thrown out of U.S. Open after German star says they used ‘famous Hitler phrase’  —  Alexander Zverev, who won the match against Jannik Sinner, said that the fan had started “singing the anthem of Hitler that was back in the day.”  —  A fan was removed from a U.S. Open tennis match … ",
    "url": "https://www.nbcnews.com/news/us-news/us-open-fan-thrown-out-zverev-match-famous-hitler-phrase-rcna103338"
  },
  {
    "text": "How Democrats are bracing for a ‘MAGA shutdown’  —  Presented by DEMS STRIVE TO STICK TOGETHER  —  There's still a month to go, but Capitol Hill is girding for an appropriations breakdown — and Democrats are already strategizing over how to make Republicans pay for what some have already started calling a “MAGA shutdown.”",
    "url": "https://www.politico.com/newsletters/huddle/2023/09/05/how-democrats-are-bracing-for-a-maga-shutdown-00113940"
  },
  {
    "text": "Inside MTG and Kari Lake's ‘Death Race’ To Become Trump's VP  —  His allies say they'd be “stupid” choices, but Trump has repeatedly discussed with senior staffers Marjorie Taylor Greene and Kari Lake as potential #2s  —  MARJORIE TAYLOR GREENE and Kari Lake have been locked in what one source close … ",
    "url": "https://www.rollingstone.com/politics/politics-features/marjorie-taylor-greene-kari-lake-trump-vice-president-1234817930/"
  },
  {
    "text": "Schumer: A government shutdown depends on McCarthy  —  Good morning, Early Birds.  We hope you had a good Labor Day weekend.  We're excited to be back in your inboxes after a week off — and we're wishing first lady Jill Biden a quick recovery from covid after she tested positive on Monday evening.",
    "url": "https://www.washingtonpost.com/politics/2023/09/05/schumer-government-shutdown-depends-mccarthy/"
  }
]