[
  {
    "text": "Judge indefinitely delays Trump's classified documents trial in Florida  —  U.S. Judge Aileen M. Cannon said there are too many pre-trial issues to address to set a new trial date now  —  Donald Trump's Florida trial for allegedly mishandling classified documents and obstructing government efforts … ",
    "url": "https://www.washingtonpost.com/national-security/2024/05/07/trump-classified-documents-trial-delayed-cannon-florida/"
  },
  {
    "text": "Trump's federal classified docs trial date postponed indefinitely … - Trump has successfully pushed for delays in multiple criminal trials ahead of November's election.",
    "url": "https://www.axios.com/2024/05/07/trump-classified-documents-trial-date-court"
  },
  {
    "text": "Judge Cannon indefinitely postpones Trump's classified docs trial  —  The date had been widely expected to move amid a tangle of pretrial conflicts between special counsel Jack Smith and Trump's attorneys.  —  The judge presiding over Donald Trump's criminal case in Florida … ",
    "url": "https://www.politico.com/news/2024/05/07/trump-classified-docs-trial-delay-florida-00156680"
  },
  {
    "text": "Shameless Judge Cannon May Have Killed Trump's Classified Docs Case … Judge Aileen Cannon has handed another reprieve to Donald Trump in his Mar-a-Lago classified documents case.  —  The case was expected to be one of Trump's first criminal trials to go to court, but any trial date … ",
    "url": "https://newrepublic.com/post/181351/judge-aileen-cannon-killed-trump-classified-docs-case"
  },
  {
    "text": "Stormy Daniels testifies, Trump curses in an angry day in court  —  Judge expresses alarm at Trump's cursing amid disturbing testimony about sex.  —  NEW YORK — Stormy Daniels, the adult-film actress at the center of Donald Trump's hush money trial, testified Tuesday about a disturbing sexual encounter … ",
    "url": "https://www.washingtonpost.com/politics/2024/05/07/stormy-daniels-testimony-trump-hush-money-trial/"
  },
  {
    "text": "NY v Trump: Judge denies motion for mistrial amid Stormy Daniels testimony  —  Stormy Daniels has been testifying in Trump's criminal trial  —  Former President Trump's defense attorneys are moving for a mistrial amid the testimony of pornographic actress Stormy Daniels.",
    "url": "https://www.foxnews.com/politics/trump-defense-attorneys-motion-mistrial-amid-stormy-daniels-testimony"
  },
  {
    "text": "Live Updates: Stormy Daniels Is Expected to Testify in Trump's Trial  —  Ms. Daniels, who received $130,000 in hush money to keep silent about her story of having had sex with Donald J. Trump, is at the center of the case against him.  —  Here's the latest on the trial.",
    "url": "https://www.nytimes.com/live/2024/05/07/nyregion/trump-trial-hush-money-stormy-daniels"
  },
  {
    "text": "Boy Scouts of America to Become Scouting America  —  This rebranding reflects the continuing efforts to welcome everyone to experience the benefits of Scouting  —  The Boy Scouts of America today announced that it will rebrand to Scouting America, reflecting the organization's ongoing commitment … ",
    "url": "https://www.scoutingnewsroom.org/press-releases/boy-scouts-of-america-to-become-scouting-america/"
  },
  {
    "text": "Boy Scouts of America changing name to more inclusive Scouting America after years of woes  —  The Boy Scouts of America is changing its name for the first time in its 114-year history.  The Texas-based organization is announcing at its annual meeting in Florida on Tuesday that it will become Scouting America.",
    "url": "https://apnews.com/article/boy-scouts-new-name-scouting-america-d583f5712680f155b4f6b762128734d3"
  },
  {
    "text": "US concerns over Israel's Gaza policy led to weapons holdup  —  The munitions were ready to be shipped to Israel when the administration placed the hold.  —  The Biden administration is holding up shipments of two types of Boeing-made precision bombs to send a political message to Israel … ",
    "url": "https://www.politico.com/news/2024/05/07/us-concerns-over-israels-gaza-policy-led-to-weapons-holdup-00156528"
  },
  {
    "text": "TikTok sues US to block law that could ban the social media platform  —  TikTok and its Chinese parent company ByteDance are suing the U.S. over a law that would ban the popular video-sharing app unless it's sold to another company, arguing that it vaguely paints it as a threat to national security to get around the First Amendment.",
    "url": "https://apnews.com/article/tiktok-3b4c1fa44c89d4568d26f1c7caf303ec"
  },
  {
    "text": "New York governor regrets saying Black kids in the Bronx don't know what a computer is  —  New York Gov. Kathy Hochul says she regrets making an offhand remark that suggested Black children in the Bronx do not know what the word “computer” means.  Hochul, a Democrat, made the extemporaneous comment Monday … ",
    "url": "https://apnews.com/article/hochul-black-kids-bronx-computer-comment-e0c3c69b1ebf9639d8f9e402096f8446"
  },
  {
    "text": "Donald Trump to Attend Fundraiser on Day of Barron's Graduation  —  Donald Trump is scheduled to give the keynote address at the Minnesota Republican Party's annual Lincoln Reagan Dinner on May 17, the same day he requested off court to attend his son Barron Trump's graduation ceremony.",
    "url": "https://www.newsweek.com/donald-trump-attend-fundraiser-day-barrons-graduation-1897759"
  },
  {
    "text": "Semi-automatic gun ban nixed in Colorado's Democratic-controlled statehouse after historic progress  —  DENVER (AP) — A bill to ban the sale and transfer of semi-automatic firearms was nixed in Colorado's Democratic-controlled Legislature on Tuesday as lawmakers pressed forward with a slew … ",
    "url": "https://apnews.com/article/colorado-semiautomatic-gun-ban-519bbc3271f148aa00e35e32530789d7"
  },
  {
    "text": "House Republicans turn to K-12 schools after months of rattling colleges  —  “Trying to create gotcha moments and viral moments is not how you ultimately solve problems that you deeply care about,” the chancellor of New York City schools said.  —  Republican lawmakers incensed over antisemitism … ",
    "url": "https://www.politico.com/news/2024/05/07/republicans-k-12-schools-antisemitism-colleges-00156644"
  },
  {
    "text": "New York Times editor Joe Kahn says defending democracy is a partisan act and he won't do it  —  He had an extraordinary opportunity, upon taking over from Dean Baquet, to right the ship: to recognize that the Times was not warning sufficiently of the threat to democracy presented by a second Trump presidency.",
    "url": "https://presswatchers.org/2024/05/new-york-times-editor-joe-kahn-says-defending-democracy-is-a-partisan-act-and-he-wont-do-it/"
  },
  {
    "text": "Newly unsealed grand jury testimony from Trump's valet helps explain FBI's desire to search Mar-a-Lago  —  Donald Trump's valet told investigators before the FBI searched Mar-a-Lago in 2022 that he randomly chose boxes of documents to return to the National Archives and Trump himself directed … ",
    "url": "https://www.cnn.com/2024/05/07/politics/mar-a-lago-trump-nauta-classified-documents/"
  },
  {
    "text": "Trump privately urged Greene to drop push to oust Speaker Johnson  —  Trump told Greene that the party needs to be unified, a source said.  —  Speaker of the House Rep. Mike Johnson and Rep. Marjorie Taylor Greene both seen leaving their meeting at the US Capitol, May 6, 2024.",
    "url": "https://abcnews.go.com/Politics/trump-privately-urges-greene-drop-push-oust-speaker/story?id=109990543"
  }
]