[
  {
    "text": "Is Trump OK?  Unhinged reaction to rise of Harris worries supporters  —  Rambling speeches peppered with insults, narcissism and an obsession with crowd size have raised questions about the former president's fitness for office  —  Even some of Donald Trump's supporters are now asking … ",
    "url": "https://www.theguardian.com/us-news/article/2024/aug/24/donald-trump-mental-fitness-campaign"
  },
  {
    "text": "A Manufactured Fight over Incumbency Hides Trump's Fascism  —  Thinking of Trump in terms of presidential administrations — reading this race as a fight over incumbency — is a category error that serves to hide the threat Trump poses to democracy.  —  Yet a slew of reviews of the DNC … ",
    "url": "https://www.emptywheel.net/2024/08/24/a-manufactured-fight-over-incumbency-hides-trumps-fascism/"
  },
  {
    "text": "Trump's Carefully Scripted Week Kept Veering Off Script  —  Despite calls by his advisers to focus on the issues, former President Donald J. Trump has made it clear that he intends to keep running his campaign his way.  —  Donald J. Trump's political endurance this year has been attributed … ",
    "url": "https://www.nytimes.com/2024/08/24/us/politics/trump-campaign-2024.html?unlocked_article_code=1.FU4.F6Z6.d5lNA8CP3hx6&smid=url-share"
  },
  {
    "text": "RFK Jr. Was My Drug Dealer  —  he leading third-party candidate for president—an environmental lawyer and activist, a son and nephew of legendary liberal Democratic politicians—just quit the race and announced that he is joining the campaign of the most anti-environment president … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/08/rfk-jr-endorse-trump-execute-drug-dealers/679597/?gift=_YJWRO9sT6lILBJDbj6IXBARrGSL_SiqmR7eWDgV4og"
  },
  {
    "text": "RFK Jr.'s out.  Does it change the race?  —  EXIT STAGE RIGHT — Some third-party presidential campaigns are noble endeavors driven by the loftiest of principles.  Others are vanity projects, exercises in cynicism that leave our politics slightly more soiled for the experience.",
    "url": "https://www.politico.com/newsletters/politico-nightly/2024/08/23/rfk-jr-s-out-does-it-change-the-race-00176256"
  },
  {
    "text": "GOP strategist cautions Trump on joining forces with RFK Jr: 'He's kind of a looney tune'  —  Video Player is loading.  —  Play Video  —  Unmute  —  Current Time 0:00  —  Loaded: 0%  —  Stream Type LIVE  —  Seek to live, currently behind liveLIVE  —  Playback Rate  —  Chapters",
    "url": "https://thehill.com/homenews/campaign/4845776-gop-strategist-scott-jennings-on-donald-trump-robert-f-kennedy-jr-joining-forces/"
  },
  {
    "text": "Democratic convention energy, Harris hot streak making Republicans nervous  —  Video Player is loading.  —  Play Video  —  Unmute  —  Current Time 0:00  —  Loaded: 0%  —  Stream Type LIVE  —  Seek to live, currently behind liveLIVE  —  Playback Rate  —  Chapters  — Chapters",
    "url": "https://thehill.com/homenews/campaign/4844833-republicans-nervous-harris-dnc-surge/"
  },
  {
    "text": "Foo Fighters Say Trump Didn't Have Permission to Use ‘My Hero’ at Arizona Rally  —  Band will take “appropriate action” as well as donate royalties from usage to Harris/Walz campaign",
    "url": "https://www.rollingstone.com/music/music-news/foo-fighters-trump-unauthorized-use-my-hero-arizona-rally-1235087493/"
  },
  {
    "text": "Dave Grohl and Foo Fighters Slam Trump for Using Hit Song at Rally  —  KILL THE MUSIC  —  The band said that any royalties generated by Trump's use of “My Hero” would go to Kamala Harris' presidential campaign.  —  Journalist  —  The Foo Fighters called out Donald Trump … ",
    "url": "https://www.thedailybeast.com/dave-grohl-and-foo-fighters-slam-donald-trump-for-using-hit-song-at-rally"
  },
  {
    "text": "Fauci recovering after hospitalization for West Nile virus  —  Dr. Anthony Fauci, former director of the National Institute of Allergy and Infectious Diseases, is recovering at home after being hospitalized with West Nile virus, a spokesperson said.  —  Fauci, a longtime public health official … ",
    "url": "https://www.cnn.com/2024/08/24/health/fauci-west-nile-virus"
  },
  {
    "text": "Are Republicans losing the culture wars?  —  School board candidates who ran on parental rights in classrooms are suffering defeats in states like Florida, once a leader in the “anti-woke” movement.  —  Republicans are confronting a decisive moment in the battle over public education: proving they can still win a culture war.",
    "url": "https://www.politico.com/news/2024/08/24/republicans-culture-war-races-00176166"
  },
  {
    "text": "Kristi Noem rejects more than $70 million in federal funds  —  Governor Kristi Noem's administration recently turned down more than $70 million of federal funds from energy efficiency and environmental programs, according to her top budget official.  —  The Home Energy Rebates program … ",
    "url": "https://www.rawstory.com/kristi-noem-rejects-more-than-70-million-in-federal-funds/"
  },
  {
    "text": "These Young Women Didn't Want to Vote for Biden.  They're All In on Harris.  —  In new polls, a large majority of young women plan to vote for the vice president.  We talked with eight of them.  —  Constance Lancelle, 22, of Milwaukee, was “definitely not interested in voting for Biden,” she said.",
    "url": "https://www.nytimes.com/2024/08/24/upshot/harris-polling-young-women.html"
  },
  {
    "text": "Raphael Warnock Told the DNC to “Keep the Faith.”  He Restored Mine in the Process.  —  The senator from Georgia made space for hope—and righteous cynicism.  —  This week, at the Democratic National Convention, the speeches of Michelle Obama and the Second Gentleman Doug Emhoff … ",
    "url": "https://www.motherjones.com/politics/2024/08/raphael-warnock-dnc-speech/"
  }
]