[
  {
    "text": "Estimated Budgetary Effects of H.R. 1, the One Big Beautiful Bill Act  —  As passed by the House of Representatives on May 22, 2025  —  Estimated budgetary effects of H.R. 1, the One Big Beautiful Bill Act, as passed by the House of Representatives on May 22, 2025.",
    "url": "https://www.cbo.gov/publication/61461"
  },
  {
    "text": "Republicans Try to Discredit Experts Warning About the Cost of Tax Cuts … President Trump's allies were trying to discredit the findings of experts even before the new forecast that their signature legislation would add $2.4 trillion to the federal debt.Kenny Holston/The New York Times",
    "url": "https://www.nytimes.com/2025/06/04/us/politics/trump-budget-bill-republicans-tax-cuts.html?unlocked_article_code=1.MU8.evNn.1RAlPy5n0MYJ"
  },
  {
    "text": "After Muscling Their Bill Through the House, Some Republicans Have Regrets  —  The sprawling legislation carrying President Trump's domestic agenda squeaked through the House with one vote to spare, but some Republicans now say they didn't realize what they voted for.",
    "url": "https://www.nytimes.com/2025/06/03/us/politics/house-republicans-policy-bill-regrets.html?unlocked_article_code=1.MU8.tMWQ.omif1j6IpCdO&smid=url-share"
  },
  {
    "text": "Trump Officials Target Columbia Accreditation Over Pro-Palestine Protests  —  The Education Department said Columbia University no longer appeared to meet accreditation standards after concluding that the school is in violation of anti-discrimination laws, the latest effort by the Trump administration … ",
    "url": "https://www.bloomberg.com/news/articles/2025-06-04/white-house-threatens-columbia-s-accreditation-over-protests"
  },
  {
    "text": "Columbia failed to meet accreditation standards, US government says  —  The U.S. Department of Education said on Wednesday it has notified a university accreditation body that Columbia University had violated federal anti-discrimination laws by its alleged failure to protect Jewish students on its campus.",
    "url": "https://www.reuters.com/world/us/us-education-department-says-columbia-university-violated-federal-anti-2025-06-04/"
  },
  {
    "text": "Elon Musk privately expresses frustration on a range of recent moves by Trump administration: Sources  —  Multiple people who have spoken to Trump and Musk described a widening rift.  —  President Donald Trump and Elon Musk attend a press conference in the Oval Office of the White House in Washington, May 30, 2025.",
    "url": "https://abcnews.go.com/Politics/elon-musk-privately-expresses-frustration-range-recent-moves/story?id=122485920"
  },
  {
    "text": "Karine Jean-Pierre is leaving the Democratic Party.  Her former White House colleagues have some thoughts.  —  Several who worked alongside the former press secretary responded to her book announcement with derision and contempt.  —  Karine Jean-Pierre's announcement that she's leaving … ",
    "url": "https://www.politico.com/news/2025/06/04/karine-jean-pierre-leaving-democratic-party-00385060"
  },
  {
    "text": "Publicly announced cancellations  —  N.I.H. grants, awarded in a competitive process, are typically paid out in installments.  A researcher with a $1 million four-year grant, for instance, will get about $250,000 a year.  Scientists can use this money to buy equipment and supplies and to pay … ",
    "url": "https://www.nytimes.com/interactive/2025/06/04/health/trump-cuts-nih-grants-research.html?unlocked_article_code=1.MU8.fooD.09Zw0Ce5H7UE&smid=nytcore-ios-share&referringSource=articleShare&sgrp=g"
  },
  {
    "text": "Trump officials delayed farm trade report over deficit forecast  —  Administration officials blocked publication of written analysis that normally accompanies the report because they disliked what it said about the deficit.  —  Trump administration officials delayed and redacted … ",
    "url": "https://www.politico.com/news/2025/06/04/trump-officials-farm-product-trade-deficit-forecast-00382549"
  },
  {
    "text": "What's next for the Iowan who shouted ‘people will die’ at Joni Ernst over Medicaid cuts  — India May, a 33-year-old Democrat from Charles City, is running for the Iowa House after sparking a viral moment at U.S. Sen. Joni Ernst's town hall.  — May interrupted Ernst's answer on Medicaid cuts to shout, “people will die!”",
    "url": "https://eu.desmoinesregister.com/story/news/politics/2025/06/04/meet-india-may-whose-shout-evoked-iowa-senator-joni-ernst-viral-medicaid-comment/83994580007/"
  },
  {
    "text": "The First Casualty of the Big Beautiful Bill?  —  Iowa Republican Sen. Joni Ernst told a constituent, who feared health care cuts would lead to mass death, that ‘We all are going to die.’ That's prompted a formidable challenge to her re-election.  —  Sen. Joni Ernst (R-IA) at the Capitol in Washington, April 10, 2025",
    "url": "https://prospect.org/politics/2025-06-04-first-casualty-of-the-big-beautiful-bill/"
  },
  {
    "text": "‘Big Balls’ Is Officially a Full-Time Government Employee  —  The first wave of DOGE staffers was supposed to be gone after 130 days.  Instead, core members of the team have signed on for the long haul.  —  Although Elon Musk has said that he is largely exiting his role at the so-called Department … ",
    "url": "https://www.wired.com/story/big-balls-young-doge-converted-into-full-time-government-employees/"
  },
  {
    "text": "Democrats set out to study young men.  Here are their findings.  —  A widely mocked project to get under the hood about why Democrats are losing young men has sobering results.  —  The Democrats trying to understand young American men know people are roasting their plan.",
    "url": "https://www.politico.com/news/2025/06/03/democrats-young-men-study-00384370"
  },
  {
    "text": "Economists Raise Questions About Quality of U.S. Inflation Data  —  Labor Department says staffing shortages reduced its ability to conduct its massive monthly survey  —  Some economists are beginning to question the accuracy of recent U.S. inflation data after the federal government … ",
    "url": "https://www.wsj.com/economy/cpi-inflation-data-accuracy-8bd2a8ae?st=2BJ3Ti"
  },
  {
    "text": "Trump Rescinds Biden Policy Requiring Hospitals to Provide Emergency Abortions  —  At issue is how to interpret a federal law barring hospitals from turning away poor or uninsured patients.  —  The Trump administration announced on Tuesday that it had revoked a Biden administration requirement … ",
    "url": "https://www.nytimes.com/2025/06/03/us/politics/trump-emergency-abortion-rule.html"
  },
  {
    "text": "Is There a Tariff End Game?  —  On May 12 Donald Trump suddenly reduced the tariff on China from 145 percent to 30 percent.  This may seem like a big reduction.  But while the higher rate would have completely cut off trade with China, even the lower tariff rate, by my estimates, would cut U.S.-China trade by two-thirds.",
    "url": "https://paulkrugman.substack.com/p/is-there-a-tariff-end-game"
  },
  {
    "text": "Trump calls for scrapping debt limit  —  President Trump on Wednesday doubled down on calls to scrap the nation's debt ceiling, pressing for bipartisan action to abolish it and finding common ground with Democrat Sen. Elizabeth Warren (Mass.).  —  “I am very pleased to announce that … ",
    "url": "https://thehill.com/homenews/administration/5332843-trump-calls-for-scrapping-debt-limit/"
  },
  {
    "text": "Iran rejects any nuclear deal that makes its program reliant on other countries  —  Iran's Supreme Leader Ali Khamenei criticized the U.S. proposal for a nuclear deal on Wednesday and stressed Iran won't accept an agreement that makes its nuclear program dependent on other countries.",
    "url": "https://www.axios.com/2025/06/04/iran-nuclear-deal-trump"
  },
  {
    "text": "FBI discovers cache of guns, armor and Nazi paraphernalia while raiding home in Washington state  —  Law enforcement discovered a cache of weaponry and armor, including a machine gun and grenade launchers, along with Nazi paraphernalia during a raid of a home in Washington state, authorities said Tuesday.",
    "url": "https://apnews.com/article/nazi-white-supremacist-guns-fbi-washington-2246cf68af02d592d192a9b52d8941e3"
  },
  {
    "text": "Months after detaining 47 people accused of being Tren de Aragua in Austin, authorities offer no evidence of gang ties  —  People at the raided house say they rented it for a birthday party and deny any connection to the gang.  One man says law enforcement accused him of being in Tren de Aragua because of his tattoo.",
    "url": "https://www.texastribune.org/2025/06/04/texas-immigration-raid-hays-county-austin-venezuelan-gang/"
  },
  {
    "text": "After Delays and Public Blowback, Chapel Hill Board Votes Outside Meeting to Award Tenure  —  After faculty raised alarm over the board's delay on the decisions, trustees finally debated and voted by email.  A couple of them said they generally opposed tenure.",
    "url": "https://www.insidehighered.com/news/faculty-issues/tenure/2025/06/04/after-delay-chapel-hill-board-votes-award-tenure"
  },
  {
    "text": "FBI sent anti-Catholic memo to over 1,000 employees, new records show  —  The FBI circulated an anti-Catholic intelligence memo to more than 1,000 employees nationwide during the Biden administration — a much broader internal reach than what former FBI Director Christopher Wray acknowledged … ",
    "url": "https://www.washingtonexaminer.com/news/3430094/fbi-anti-catholic-memo-sent-to-over-1000-employees-new-records-show/"
  },
  {
    "text": "Brown Disciplined a Student Who Asked Questions in the Style of Elon Musk and DOGE  —  A conservative student newspaper had DOGE-style questions about the work of Brown University staff.  Its writers were summoned to disciplinary hearings.  —  Thousands of administrative employees … ",
    "url": "https://www.nytimes.com/2025/06/04/us/politics/brown-university-newspaper-musk-doge.html"
  },
  {
    "text": "The fascinating backstory behind a bizarre State Department Substack post  —  Last week, the State Department published a strikingly radical screed on its official Substack.  Titled “The Need for Civilizational Allies in Europe,” the piece accused Europe's governments of waging … ",
    "url": "https://www.vox.com/on-the-right-newsletter/415360/state-department-substack-samuel-samson-adrian-vermeule-integralism"
  }
]