[
  {
    "text": "Porn site user linked to Mark Robinson also praised Hitler's Mein Kampf  —  The Republican nominee for governor in North Carolina has denied writing the posts, which have upended his campaign in the battleground state.  —  A porn site user linked to North Carolina gubernatorial nominee Mark … ",
    "url": "https://www.washingtonpost.com/politics/2024/09/20/mark-robinson-mein-kampf-porn-posts/"
  },
  {
    "text": "Trump has no plan to pull his endorsement of Mark Robinson after alleged porn site scandal  —  Trump is facing pressure from some allies and staff to break with the gubernatorial candidate after a report on his past comments, but so far he does not plan to drop him.",
    "url": "https://www.nbcnews.com/politics/2024-election/trump-no-plan-pull-endorsement-mark-robinson-alleged-porn-site-scandal-rcna171988"
  },
  {
    "text": "Nebraska switch to winner-take-all electoral votes unlikely before election, despite pressure  —  How a bill becomes a law in the Nebraska Legislature  —  LINCOLN — Nebraska appears unlikely to adopt a winner-take-all model of awarding Electoral College votes, despite renewed pressure … ",
    "url": "https://omaha.com/news/state-regional/government-politics/elections/nebraska-switch-to-winner-take-all-electoral-votes-unlikely-before-election-despite-pressure/article_f5019672-76b6-11ef-bc6b-07ad1d5a3030.html"
  },
  {
    "text": "Trump ramps up push for Nebraska to change electoral vote allocation  —  Nebraska is one of two states that award some of its electoral votes by congressional district.  A vote from the Omaha area is part of Harris's easiest path to victory.  —  Former president Donald Trump spoke by phone … ",
    "url": "https://www.washingtonpost.com/politics/2024/09/20/nebraska-electoral-college-trump-omaha/"
  },
  {
    "text": "Ramaswamy shrugs off GOP ‘mistakes’ in Springfield migrant claims  —  Former Republican presidential candidate Vivek Ramaswamy shrugged off Republicans' “mistakes” in making false claims about Haitians in Springfield, Ohio, attacking the media for focusing on a “fringe aspect” of a larger story.",
    "url": "https://thehill.com/homenews/state-watch/4891803-ramaswamy-springfield-haitians-false-claims/"
  },
  {
    "text": "Trump Media skids to new low on the first day the former president can sell his shares  —  Shares of Trump Media & Technology Group slumped to their lowest level ever Friday, the first trading day that its biggest shareholder, former President Donald Trump, is free to sell his stake in the company behind the Truth Social platform.",
    "url": "https://apnews.com/article/trump-media-shares-donald-trump-truth-social-82d8839bb5f5a96e93e2404399ead072"
  },
  {
    "text": "Constellation Energy to restart Three Mile Island nuclear plant, sell the power to Microsoft for AI … WATCH NOW  —  Constellation Energy plans to restart the Three Mile Island nuclear plant and will sell the power to Microsoft, demonstrating the immense energy needs of the tech sector … ",
    "url": "https://www.cnbc.com/2024/09/20/constellation-energy-to-restart-three-mile-island-and-sell-the-power-to-microsoft.html"
  },
  {
    "text": "The Teamsters President Is Out of His Depth  —  “We are not beholden to anyone, or any party,” Teamsters President Sean O'Brien said two months ago at the Republican National Convention.  Perhaps he meant it, because on Wednesday the Teamsters announced that, for the first time in 28 years … ",
    "url": "https://newrepublic.com/article/186185/teamsters-sean-obrien-trump-endorsement"
  },
  {
    "text": "Trump's Alarming Use Of A Word With A Deep Fascist History  —  Most people didn't notice when the former president used the term in a Truth Social post.  But white nationalists did.  —  Last weekend, former President Donald Trump posted another anti-immigrant screed to Truth Social.",
    "url": "https://www.huffpost.com/entry/trump-remigration-fascist-martin-sellner-europe_n_66ed912be4b07a173e51416d"
  },
  {
    "text": "Scoop: Bill O'Reilly Ends Interview, Threatens Host Margaret Hoover Over Questions on Sexual Harassment Settlements  —  Bill O'Reilly abruptly ended an interview with PBS host Margaret Hoover after being questioned on the allegations of sexual harassment against him, Mediaite has learned.",
    "url": "https://www.mediaite.com/media/scoop-bill-oreilly-ends-interview-threatens-host-margaret-hoover-over-questions-on-sexual-harassment-settlements/"
  },
  {
    "text": "FDA Approves Nasal Spray Influenza Vaccine for Self- or Caregiver-Administration  —  First Influenza Vaccine That Does Not Need to be Administered by a Health Care Provider  —  For Immediate Release:  —  Today, the U.S. Food and Drug Administration approved FluMist for self- or caregiver-administration.",
    "url": "https://www.fda.gov/news-events/press-announcements/fda-approves-nasal-spray-influenza-vaccine-self-or-caregiver-administration"
  },
  {
    "text": "9th Circuit Reinstates Arizona Voter Suppression Law  —  Arizona's 2022 controversial voter registration and mail-in voting law will be reinstated due to a ruling from the 9th U.S. Circuit Court of Appeals.  —  Signed into law in June 2022, Senate Bill 1260 includes three harmful provisions … ",
    "url": "https://www.democracydocket.com/news-alerts/9th-circuit-reinstates-arizona-voter-suppression-law/"
  },
  {
    "text": "Self-Proclaimed ‘Black Nazi’ Mark Robinson Even Started Learning German  —  HE'S THE WURST!  —  The same email of Robinson's that was used to set up an Ashley Madison account was also used to start a Duolingo account to learn the language of Goethe (and Hitler).",
    "url": "https://www.thedailybeast.com/black-nazi-mark-robinsons-email-used-to-sign-up-for-german-lessons-on-duolingo"
  },
  {
    "text": "US SEC intends to seek sanctions against Elon Musk in Twitter probe  —  The U.S. Securities and Exchange Commission said on Friday it intends to seek sanctions against Elon Musk after he failed to appear for court-ordered testimony for the regulator's probe into his $44 billion takeover of Twitter.",
    "url": "https://www.reuters.com/technology/us-sec-intends-seek-sanctions-against-elon-musk-twitter-probe-2024-09-20/"
  },
  {
    "text": "Harris tells Wisconsin rally: 'Let's not pay too much attention to the polls'  —  Vice President Harris on Friday night told rallygoers in Wisconsin not to pay too much attention to the polls, which paint the presidential race as largely neck-and-neck against former President Trump, while she still considers herself the underdog.",
    "url": "https://thehill.com/homenews/campaign/4891791-harris-rally-wisconsin-polls/"
  },
  {
    "text": "Arizona's top court says voters missing citizenship proof can receive full ballots  —  Nearly 100,000 voters will receive regular ballots this fall even though there is no record that they submitted citizenship documentation, as is required to vote in state and local elections.",
    "url": "https://www.washingtonpost.com/politics/2024/09/20/arizona-citizenship-voters/"
  },
  {
    "text": "New York City sheriff under investigation as Adams' inner circle faces federal probes  —  Anthony Miranda oversees the city's enforcement of unlicensed cannabis shops.  —  NEW YORK — The New York City Department of Investigation is probing the city Sheriff's Office and the man who leads it … ",
    "url": "https://www.politico.com/news/2024/09/20/new-york-city-sheriff-investigation-eric-adams-inner-circle-00180334"
  },
  {
    "text": "Johnson says Trump “understands the situation” as House weighs next steps on funding bill  —  Washington — House Speaker Mike Johnson signaled that former President Donald Trump could soften on his calls to shut down the federal government if a measure requiring proof of citizenship to register … ",
    "url": "https://www.cbsnews.com/news/mike-johnson-donald-trump-government-shutdown-spending-bill/"
  }
]