[
  {
    "text": "Two RT Employees Indicted for Covertly Funding and Directing U.S. Company that Published Thousands of Videos in Furtherance of Russian Interests  —  For Immediate Release  —  Employees of Russian State-Controlled Media Outlet Deployed Nearly $10 Million to Publish RT-Curated Content … ",
    "url": "https://www.justice.gov/opa/pr/two-rt-employees-indicted-covertly-funding-and-directing-us-company-published-thousands"
  },
  {
    "text": "Don Jr's Online Buddies Allegedly Demand $5 Million from Russian Shell Companies to Say Nice Things about His Daddy  —  When DOJ announced today it would unseal legal actions against Russian influence operations, the former President's failson complained, “Here we go again.  LOL”",
    "url": "https://www.emptywheel.net/2024/09/04/don-jrs-online-buddies-allegedly-demand-5-million-from-russian-shell-companies-to-say-nice-things-about-his-daddy/"
  },
  {
    "text": "Media start-up from Benny Johnson, Tim Pool, and Dave Rubin was secret Russian influence campaign, indictment alleges  —  A media start-up from reactionary luminaries such as Tim Pool, Benny Johnson, Dave Rubin, Lauren Southern, and others secretly received funding from Russia, a new federal indictment alleges.",
    "url": "https://www.dailydot.com/debug/russia-tenet-benny-johnson-tim-pool-indictment/"
  },
  {
    "text": "Indictment: Russian propagandists used Tennessee content company to push disinformation  —  Evan Mealins Kirsten FiscusNashville Tennessean  —  An indictment unsealed Wednesday alleges a Tennessee content creation company was the tool a team of Russian propagandists used to infiltrate U.S. audiences with Kremlin-backed messaging.",
    "url": "https://www.tennessean.com/story/news/crime/2024/09/04/indictment-russians-tennessee-company-tenet/75074263007/"
  },
  {
    "text": "Russian money was funneled to right-wing creators through a pro-Trump media outlet: prosecutors  —  The indictment on Wednesday of two RT employees includes allegations that the duo implemented a nearly $10 million plan to fund an unnamed Tennessee-based company as one of their “covert projects”",
    "url": "https://www.nbcnews.com/politics/justice-department/russian-money-was-funneled-right-wing-creators-trump-media-outlet-pros-rcna169611"
  },
  {
    "text": "Injuries reported in shooting at Georgia high school  —  WINDER, Ga. (AP) — Injuries have been reported after a school shooting at a Georgia high school, which was put on lockdown Wednesday and students gathered in its football stadium, the local sheriff's office said.",
    "url": "https://apnews.com/article/georgia-high-school-lockdown-3969d34cf6a7adc787facf21c469ef4d"
  },
  {
    "text": "Georgia school shooting suspect previously investigated for threats, FBI says  —  A teenager accused of killing four people at Apalachee High School in Barrow County was previously investigated for threats about a shooting, the FBI Atlanta office said late Wednesday.",
    "url": "https://www.ajc.com/news/crime/barrow-school-shooting-suspect-previously-investigated-for-threats-fbi-says/URBYIRVIN5CBRFUDDTWV2HNNQE/"
  },
  {
    "text": "At least 4 killed, approximately 30 injured in school shooting, sources say  —  At least four people are believed to have been killed and approximately 30 more injured in a shooting at Apalachee High School in Winder, Georgia, according to law enforcement sources in the state.",
    "url": "https://www.cnn.com/2024/09/04/us/winder-ga-shooting-apalachee-high-school/"
  },
  {
    "text": "Liz Cheney, a Top G.O.P. Trump Critic, Says She Will Vote for Harris  —  The Wyoming Republican, once a member of House leadership, lost her post and then her seat after she voted to impeach President Donald J. Trump following the Jan. 6, 2021, attack on the Capitol.",
    "url": "https://www.nytimes.com/2024/09/04/us/politics/liz-cheney-kamala-harris-vote.html"
  },
  {
    "text": "Liz Cheney endorses Harris for president  —  It's the latest high-profile Republican endorsement for Vice President Kamala Harris' presidential bid.  —  WASHINGTON — Former Rep. Liz Cheney, R-Wyo., on Wednesday endorsed Vice President Kamala Harris for president, the latest high-profile Republican endorsement for Democrats.",
    "url": "https://www.nbcnews.com/politics/2024-election/liz-cheney-endorses-kamala-harris-president-rcna169654"
  },
  {
    "text": "Trump and Harris campaigns agree to rules for ABC debate  —  Both sides initially agreed to a debate on Sept. 10, but Trump later threatened to back out, and Harris sought to change one of the ground rules.  —  Vice President Kamala Harris and former President Donald Trump are set to debate each … ",
    "url": "https://www.nbcnews.com/politics/2024-election/trump-harris-campaigns-agree-rules-abc-debate-rcna168683"
  },
  {
    "text": "Trump Questions Fairness of Next Week's Debate at a Town Hall  —  Former President Donald J. Trump, at a Fox News event, insisted without evidence that Vice President Kamala Harris was “going to get the questions in advance.”  —  Hours after the Trump and Harris campaigns agreed to rules … ",
    "url": "https://www.nytimes.com/2024/09/04/us/politics/trump-fox-news-town-hall.html"
  },
  {
    "text": "Record measles outbreak in Oregon blamed on vaccine exemptions  —  Vaccine exemptions at nearly 9% in the state, enabling sustained transmission.  —  With one of the highest vaccine exemption rates in the country, Oregon is experiencing its largest measles outbreak in decades.",
    "url": "https://arstechnica.com/science/2024/09/record-measles-outbreak-in-oregon-blamed-on-vaccine-exemptions/"
  },
  {
    "text": "Harris goes off script to address Georgia school shooting: ‘It does not have to be this way’  —  Video Player is loading.  —  Play Video  —  Unmute  —  Current Time 0:00  —  Loaded: 0%  —  Stream Type LIVE  —  Seek to live, currently behind liveLIVE  —  Playback Rate  —  Chapters",
    "url": "https://thehill.com/homenews/administration/4861972-georgia-shooting-harris-condemns-gun-violence/"
  },
  {
    "text": "Justice Department Disrupts Covert Russian Government-Sponsored Foreign Malign Influence Operation Targeting Audiences in the United States and Elsewhere  —  For Immediate Release  —  Influence Operation Relied on Influencers, AI-Generated Content, Paid Social Media Advertisements … ",
    "url": "https://www.justice.gov/opa/pr/justice-department-disrupts-covert-russian-government-sponsored-foreign-malign-influence"
  },
  {
    "text": "The Internet Archive just lost its appeal over ebook lending … The Internet Archive has lost its appeal in a fight to lend out scanned ebooks without the approval of publishers.  In a decision on Wednesday, the Second Circuit Court of Appeals ruled that permitting the Internet Archive's digital library … ",
    "url": "https://www.theverge.com/2024/9/4/24235958/internet-archive-loses-appeal-ebook-lending"
  },
  {
    "text": "Trump campaign says the former president believes ‘anyone convicted of a crime’ should be jailed  —  The comment was in response to reports of a Trump clemency recipient being convicted of a domestic violence-related charge.  Trump was convicted this year in his hush money case.",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-campaign-says-believes-anyone-convicted-crime-jailed-rcna169635"
  },
  {
    "text": "Biden preparing to block Nippon Steel purchase of U.S. Steel  —  The move would pose a setback for relations with Japan.  —  President Joe Biden is preparing to announce that he will formally block Nippon Steel's proposed $14.9 billion acquisition of U.S. Steel, according to three people … ",
    "url": "https://www.washingtonpost.com/business/2024/09/04/biden-prepares-reject-us-steel-deal/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI1NDIyNDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI2ODA0Nzk5LCJpYXQiOjE3MjU0MjI0MDAsImp0aSI6ImQxNGEyNzNiLTUyODctNGU3NC05YzUwLWIwMTJiZDg4MzE1MyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9idXNpbmVzcy8yMDI0LzA5LzA0L2JpZGVuLXByZXBhcmVzLXJlamVjdC11cy1zdGVlbC1kZWFsLyJ9.PP55NWyK3q3sUrSHQes3Ep8d13B-HoketReHAX-TOaY&itid=gfta"
  },
  {
    "text": "Barron Trump arrives at NYU for first day at college  —  Former President Donald Trump's youngest child, Barron Trump, was spotted arriving at New York University Wednesday to kick off his first day of college life.  —  The towering 18-year-old was flanked by Secret Service agents … ",
    "url": "https://nypost.com/2024/09/04/us-news/barron-trump-arrives-at-nyu-for-first-day-at-college/"
  },
  {
    "text": "Netanyahu derailed a potential Gaza hostage deal in July, Israeli newspaper reports  —  Israeli Prime Minister Benjamin Netanyahu in July effectively spiked a draft hostage and ceasefire deal by introducing a raft of new, 11th-hour demands, according to a report by the Israeli newspaper Yedioth Ahronoth citing a document it obtained.",
    "url": "https://www.cnn.com/2024/09/04/middleeast/netanyahu-derailed-hostage-deal-in-july-intl/"
  },
  {
    "text": "One urgent reason the justices need a credible ethics code?  Ginni Thomas.  —  And you thought she couldn't do any more to cast disrepute on the Supreme Court.  —  Just when you think Virginia “Ginni” Thomas can't do any more to cast disrepute on the institution where her husband has served … ",
    "url": "https://www.washingtonpost.com/opinions/2024/09/04/ginni-clarence-thomas-ethics-court-jan6/"
  },
  {
    "text": "Stock plunge wipes out Trump Media's extraordinary market gains  —  Truth Social shares closed below $17 on Wednesday, reversing all gains since the company's rapid rise from January  —  Donald Trump's tiny social media empire has seen its extraordinary stock market rally wiped out by a steep sell-off.",
    "url": "https://www.theguardian.com/business/article/2024/sep/04/trump-media-djt-stock"
  }
]