[
  {
    "text": "Secluded in Rehoboth, Biden Stews at Allies' Pressure to Drop Out of the Race  —  As he recovers from Covid, the president has grown resentful toward Democratic congressional leaders and former President Barack Obama.  —  Sick with Covid and abandoned by allies, President Biden has been fuming … ",
    "url": "https://www.nytimes.com/2024/07/19/us/politics/biden-drop-out-2024-election.html"
  },
  {
    "text": "The totalitarian tell in Trump's “unity” speech  —  Kim Jung Un and Victor Orban are role models for a type of unity, but not the type you would enjoy  —  By now you have no doubt heard that Donald Trump (a man who, I should note, has spent years urging his supporters to commit violent acts … ",
    "url": "https://www.findinggravity.net/p/the-totalitarian-tell-in-trumps-unity"
  },
  {
    "text": "Sheila Jackson Lee, long-serving Democratic congresswoman and advocate for Black Americans, dies at 74  —  Sheila Jackson Lee, a longtime Democratic congresswoman from Texas who was an outspoken advocate for Black Americans for decades, has died.  She was 74.",
    "url": "https://www.cnn.com/2024/07/19/politics/sheila-jackson-lee-texas-dies/"
  },
  {
    "text": "Rep. Sheila Jackson Lee dies after battle with cancer  —  The Texas Democrat announced in June that she had been diagnosed with pancreatic cancer and was undergoing treatment.  —  Rep. Sheila Jackson Lee, D-Texas, has died at the age of 74 after a battle with cancer, her family announced on Friday.",
    "url": "https://www.nbcnews.com/politics/congress/rep-sheila-jackson-lee-dies-battle-cancer-rcna162819"
  },
  {
    "text": "U.S. Rep. Sheila Jackson Lee is dead at 74  —  The Houston Democrat announced earlier this year that she had cancer.  —  WASHINGTON — Sheila Jackson Lee, a Houston Democrat who was one of the longest serving members of Texas' Congressional delegation and a longtime advocate for progressive causes … ",
    "url": "https://www.texastribune.org/2024/07/19/sheila-jackson-lee-dies/"
  },
  {
    "text": "Pelosi voiced support for an open nomination process if Biden drops out  —  Some California House Democrats don't want the process to replace the president on the ticket to seem like a Kamala Harris coronation.  —  In a meeting with fellow California Democrats last week … ",
    "url": "https://www.politico.com/news/2024/07/19/pelosi-support-open-nomination-biden-drop-out-00169893"
  },
  {
    "text": "Alexandria Ocasio-Cortez warns anti-Biden Democrats about what comes next if they succeed  —  The progressive New Yorker spoke on Instagram about the potential risks of pressuring President Joe Biden to end his campaign.  —  Rep. Alexandria Ocasio-Cortez, D-N.Y., has issued a dire warning … ",
    "url": "https://www.msnbc.com/the-reidout/reidout-blog/aoc-biden-nomination-alexandria-ocasio-cortez-rcna162761"
  },
  {
    "text": "Trump's GOP is no country for MAGA women  —  At the Republican National Convention, MAGA women learn there's no place for them in Trump's GOP  —  MILWAUKEE — On the third night of the Republican National Convention, Donald Trump's WWE-inspired entrance to the came complete with a trollish musical cue … ",
    "url": "https://www.salon.com/2024/07/20/the-clearest-message-of-the-convention-is-no-country-for-maga-women/"
  },
  {
    "text": "Trump is poised to bypass his legal woes thanks to judges he appointed  —  The string of victories reflects luck and timing.  —  Donald Trump is on the cusp of emerging unscathed from his four criminal prosecutions — thanks almost entirely to the decisions of four judges he appointed.",
    "url": "https://www.politico.com/news/2024/07/20/trump-legal-woes-judges-appointed-00169875"
  },
  {
    "text": "Trump shooter flew drone over venue hours before attempted assassination, source says  —  The gunman was killed after he shot former President Donald Trump in the ear in an assassination attempt.  A motive remains unknown.  —  The gunman who shot former President Donald Trump in the ear … ",
    "url": "https://www.nbcnews.com/news/us-news/trump-shooter-flew-drone-venue-hours-attempted-assassination-source-sa-rcna162817"
  },
  {
    "text": "JD Vance's wife faces racist online backlash from far-right social media posts  —  Usha Chilukuri Vance is the daughter of Indian immigrants.  —  Republican vice presidential candidate Sen. J.D. Vance and his wife Usha Chilukuri Vance during the Republican National Convention in Milwaukee, WI, July 17, 2024.",
    "url": "https://abcnews.go.com/Politics/jd-vances-wife-faces-racist-online-backlash-social/story?id=112096897"
  },
  {
    "text": "Florida OKs Misleading Statement To Print Next To Pro-Choice Ballot Measure  —  The supposedly nonpartisan committee that drafted it included an economist from the ultra-conservative Heritage Foundation, the group behind Project 2025.  —  LOADING  —  The advocates behind Florida's pro … ",
    "url": "https://www.huffpost.com/entry/florida-republicans-ok-misleading-statement-to-print-next-to-pro-choice-ballot-measure_n_669ad3d2e4b07f2755f4799a"
  },
  {
    "text": "Confronting the hate, Phil Williams tells neo-Nazis: ‘When I look at you guys, I do not think master race.’  —  NASHVILLE, Tenn. (WTVF) — This is my town.  —  Nashville belongs to us — not the out-of-state neo-Nazis who have created havoc this week on our streets with their symbols of hate and vile words.",
    "url": "https://www.newschannel5.com/news/newschannel-5-investigates/franklin-politics/confronting-the-hate-phil-williams-tells-neo-nazis-when-i-look-at-you-guys-i-do-not-think-master-race"
  },
  {
    "text": "RNC calls for unity ring hollow for some in LGBTQ community  —  “I am running to be president for all of America,” Trump said.  —  Republican presidential candidate former President Donald Trump stands on stage with his family, vice presidential candidate Sen. J.D. Vance and his wife Usha Chilukuri Vance … ",
    "url": "https://abcnews.go.com/Politics/rnc-calls-unity-ring-hollow-lgbtq-community/story?id=112096917"
  },
  {
    "text": "JD Vance Leads Trump's Push to Win Key ‘Blue Wall’ States  — Biden's path runs through Pennsylvania, Wisconsin and Michigan  — GOP chairs bullish about Trump support in those battlegrounds  —  Donald Trump and JD Vance are set to make their campaign-trail debut as the official Republican ticket … ",
    "url": "https://www.bloomberg.com/news/articles/2024-07-20/jd-vance-leads-trump-2024-race-to-win-key-blue-wall-states-from-biden"
  }
]