[
  {
    "text": "Florida surgeon general calls for halt on mRNA covid vaccines, citing debunked claim  —  Florida's top health official called for a halt to using mRNA coronavirus vaccines on Wednesday, contending that the shots could contaminate patients' DNA — a claim that has been roundly debunked … ",
    "url": "https://www.washingtonpost.com/health/2024/01/03/florida-surgeon-general-ladapo-covid-vaccine/"
  },
  {
    "text": "Florida State Surgeon General Calls for Halt in the Use of COVID-19 Mrna Vaccines  —  Contact:  —  Communications Office  —  NewsMedia@flhealth.gov  —  850-245-4111  —  Tallahassee, Fla. — On December 6, 2023, State Surgeon General Dr. Joseph A. Ladapo sent a letter to the United States Food … ",
    "url": "https://www.floridahealth.gov/newsroom/2024/01/20240103-halt-use-covid19-mrna-vaccines.pr.html"
  },
  {
    "text": "The True Danger of Florida Surgeon General's Bogus mRNA Claims  —  Dr. Joseph Ladapo seems confused about the differences between DNA and mRNA vaccines. … This week, Florida's Surgeon General Dr. Joseph Ladapo took the drastic step of calling for a halt to the administration of mRNA COVID-19 vaccines … ",
    "url": "https://www.thedailybeast.com/the-true-danger-of-florida-surgeon-generals-bogus-mrna-claims"
  },
  {
    "text": "Trump asks Supreme Court to keep his name on Colorado ballot  —  Former president, who is the 2024 GOP frontrunner, is also appealing a Maine official's decision to bar him from the ballot in that state  —  Donald Trump asked the U.S. Supreme Court on Wednesday to ensure he can appear … ",
    "url": "https://www.washingtonpost.com/politics/2024/01/03/trump-colorado-ballot-appeal/"
  },
  {
    "text": "FBI calls bomb threats that led to brief lockdowns and evacuations of some state capitols a hoax  —  A bomb threat emailed to officials in several states early Wednesday briefly disrupted government affairs and prompted some state capitol evacuations, but no explosives were found … ",
    "url": "https://apnews.com/article/state-capitol-threat-evacuation-lockdown-dfef5fbb98ec6572474807c260533b05"
  },
  {
    "text": "Former Harvard President Claudine Gay: This Is About More Than My Mistakes  —  On Tuesday, I made the wrenching but necessary decision to resign as Harvard's president.  For weeks, both I and the institution to which I've devoted my professional life have been under attack.",
    "url": "https://www.nytimes.com/2024/01/03/opinion/claudine-gay-harvard-president.html"
  },
  {
    "text": "Justice Department Files Lawsuit Against the State of Texas Regarding Unconstitutional SB 4 Immigration Law  —  For Immediate Release  —  The Justice Department today filed suit against the State of Texas to challenge Senate Bill 4 (SB 4) under the U.S. Constitution's Supremacy Clause and Foreign Commerce Clause.",
    "url": "https://www.justice.gov/opa/pr/justice-department-files-lawsuit-against-state-texas-regarding-unconstitutional-sb-4"
  },
  {
    "text": "The names of more than 170 Jeffrey Epstein associates were just revealed in unsealed court documents.  Here's what we know.  — The names of more than 170 Jeffrey Epstein associates were just unsealed.  — Powerful associates like Bill Clinton, Prince Andrew, Glenn Dubin, and Jean Luc Brunel are in the documents.",
    "url": "https://www.businessinsider.com/jeffrey-epstein-list-names-unsealed-doe-court-documents-2024-1"
  },
  {
    "text": "Harvard agitators turn their ire toward Penny Pritzker  —  The Dem mega-donor pushes back at hedge-funder Bill Ackman's call for her to resign.  —  The leadership turmoil engulfing Harvard University is putting a major Democratic Party figure on the defensive.",
    "url": "https://www.politico.com/news/2024/01/03/harvard-antisemitism-billionaires-00133742"
  },
  {
    "text": "The Polls Prove It: Many Republicans Love Fascism  —  It is no longer controversial to speak plainly about the authoritarian shift of the Republican Party, led by Donald Trump.  Hillary Clinton was dragged in 2016 for saying, “You could put half of Trump's supporters into what I call the basket … ",
    "url": "https://newrepublic.com/article/177796/polls-republicans-trump-maga-fascism"
  },
  {
    "text": "Former U.S. Rep. Mayra Flores accused of cribbing others' pictures of Mexican food as her own cooking  —  Flores, who is challenging U.S. Rep. Vicente Gonzalez for her old seat, is being accused of routinely stealing stylish photos of Mexican campfire cooking and passing them off as her own idyllic life on a ranch.",
    "url": "https://www.texastribune.org/2024/01/03/mayra-flores-mexican-food-photos/"
  },
  {
    "text": "This is how I will end Joe Biden's border disaster on day one  —  We do not have time for on-the-job training.  Unlike every other candidate, with me, there is no question.  I promise you that I will get this job done.  —  The most urgent task facing the next president … ",
    "url": "https://www.desmoinesregister.com/story/opinion/columnists/caucus/2024/01/03/donald-trump-joe-biden-border-disaster/72093156007/"
  },
  {
    "text": "A Constitution-flouting ‘authoritarian’ is already in the White House  —  Overcaffeinated Cassandras continue to forecast an “authoritarian” and anti-constitutional Donald Trump dictatorship.  They are mistaken about the near future because, among other reasons, they misread the recent past.",
    "url": "https://www.washingtonpost.com/opinions/2024/01/03/biden-disdain-constitution-senate/"
  },
  {
    "text": "Florida man arrested and accused of threatening to kill Rep. Eric Swalwell and his kids  —  Prosecutors say a 72-year-old man from Greenacres left voicemail messages that included threats to “come after you and kill you” and “come and kill your children.”  —  A Florida man was arrested Wednesday … ",
    "url": "https://www.nbcnews.com/politics/congress/florida-man-arrested-allegedly-threatening-kill-rep-eric-swalwell-kids-rcna132198"
  },
  {
    "text": "GOP Rep Calls Jesse Watters a ‘Fucking Hack,’ Claims Fox News Canceled Interview in Retaliation  —  Crenshaw brought up Watters' past infidelity and blasted him as a “f*cking clown” after the Fox star suggested he may have been involved in unethical stock transactions.",
    "url": "https://www.thedailybeast.com/gop-rep-dan-crenshaw-calls-jesse-watters-a-fucking-hack-claims-fox-news-canceled-interview-in-retaliation"
  },
  {
    "text": "New Jersey Used COVID Relief Funds to Buy Banned Chinese Surveillance Cameras  —  Join the newsletter to get the latest updates.  —  Success  —  Great!  Check your inbox and click the link.  —  Error  —  Please enter a valid email address.  —  This article was produced in collaboration … ",
    "url": "https://www.404media.co/new-jersey-used-covid-relief-funds-to-buy-banned-dahua-chinese-surveillance-cameras/"
  },
  {
    "text": "A Joint Statement from the Governments of the United States, Australia, Bahrain, Belgium, Canada, Denmark, Germany, Italy, Japan, Netherlands, New Zealand, Singapore, and the United Kingdom  —  Recognizing the broad consensus as expressed by 44 countries around the world on December 19, 2023 … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/01/03/a-joint-statement-from-the-governments-of-the-united-states-australia-bahrain-belgium-canada-denmark-germany-italy-japan-netherlands-new-zealand-and-the-united-kingdom/"
  }
]