[
  {
    "text": "Biden set to announce support for major Supreme Court changes  —  Plans include proposals for legislation to establish term limits for the justices and an enforceable ethics code  —  President Biden is finalizing plans to endorse major changes to the Supreme Court in the coming weeks … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/16/biden-supreme-court-reforms/"
  },
  {
    "text": "Schiff Warned of Wipeout for Democrats if Biden Remains in Race  —  Representative Adam B. Schiff of California told attendees at a Democratic fund-raiser that the party would lose the Senate and miss a chance to take the House if the president did not drop out.",
    "url": "https://www.nytimes.com/2024/07/16/us/politics/schiff-biden-democrats.html"
  },
  {
    "text": "Scoop: Biden rebellion resurfaces on Capitol Hill … - “People are back to being angry at Biden and a push to sign on to this letter is going around ... the ‘replace Biden’ movement is back,” a House Democrat told Axios. … - “We respectfully but emphatically request that you cancel … ",
    "url": "https://www.axios.com/2024/07/16/congress-democrats-biden-dnc-early-roll-call-vote"
  },
  {
    "text": "Pelosi privately fields battleground Dem calls as she works to address Biden crisis  —  The former speaker gave the distinct impression that she wanted the president to take himself off the ticket, according to a battleground House Democrat who spoke to Nancy Pelosi recently.",
    "url": "https://www.politico.com/news/2024/07/16/pelosi-biden-2024-elections-00168767"
  },
  {
    "text": "Determined to push forward, Biden tightens his circle and grows combative  —  President Joe Biden's patience has quickly been running out for questions about his mental acuity after his rough debate.  —  WASHINGTON — President Joe Biden spent more than a week in meetings … ",
    "url": "https://www.nbcnews.com/politics/2024-election/biden-tightens-circle-grows-combative-rcna162154"
  },
  {
    "text": "Exclusive: Secret Service ramped up security after receiving intel of Iranian plot to assassinate Trump; no known connection to shooting  —  US authorities obtained intelligence from a human source in recent weeks on a plot by Iran to try to assassinate Donald Trump, a development that led … ",
    "url": "https://www.cnn.com/2024/07/16/politics/iran-plot-assassinate-trump-secret-service/"
  },
  {
    "text": "U.S. Detected Potential Iranian Plot to Kill Trump Separate From Saturday's Shooting  —  American intelligence agencies were tracking an Iranian threat even before the attack on former President Donald J. Trump.  But officials said the two were unrelated.  —  U.S. intelligence agencies … ",
    "url": "https://www.nytimes.com/2024/07/16/us/politics/trump-iran-assassination-plot.html"
  },
  {
    "text": "Security Detail for Ex-Top Trump Official Denied by Biden Administration  —  Former national security adviser Robert O'Brien wanted his government protection extended amid ‘credible’ threats from Iran  —  WASHINGTON—The Biden administration has declined for almost a year to provide security … ",
    "url": "https://www.wsj.com/politics/national-security/security-detail-for-top-trump-official-denied-by-biden-administration-0db6c0f4"
  },
  {
    "text": "Trump on Taxes, Tariffs, Jerome Powell and More … It's late June, and Donald Trump is plotting his next presidency in the gilded offseason isolation of the Mar-a-Lago Club.  The adoring club members may have decamped to cooler climates, but Trump is still in a good mood.",
    "url": "https://www.bloomberg.com/features/2024-trump-interview/"
  },
  {
    "text": "Cop Fatally Shoots ‘Armed’ Suspect Just Outside RNC  —  CHILLING  —  The officer who opened fire was from Columbus, Ohio, and was attending the RNC.  —  An Ohio cop dispatched to help secure the RNC fatally shot an “armed” man just outside the convention's perimeter in Milwaukee on Tuesday afternoon … ",
    "url": "https://www.thedailybeast.com/rnc-shooting-cop-fatally-shoots-armed-suspect-just-outside-convention"
  },
  {
    "text": "Bob Menendez is guilty.  Here's what happens next.  —  When will he be sentenced?  Can he remain in Congress?  Can he vote as a convicted felon?  —  The guilty verdict of Sen. Bob Menendez marks the end of a dramatic nine-week trial — but the New Jersey Democrat's legal and political odyssey will continue.",
    "url": "https://www.politico.com/news/2024/07/16/bob-menendez-guilty-what-next-00168682"
  },
  {
    "text": "In Private Speech, J.D. Vance Said the “Devil Is Real” and Praised Alex Jones as a Truth-Teller  —  Vance gave the speech to the secretive Teneo Network.  The GOP vice presidential nominee has been a member of the Leonard Leo-backed group, which seeks to cultivate conservative influence in business and culture.",
    "url": "https://www.propublica.org/article/jd-vance-alex-jones-leonard-leo-teneo-maddow-video"
  },
  {
    "text": "‘They’ didn't shoot Donald Trump  —  Despite the lack of any clear motive, the actions of Thomas Crooks have been attributed to the Democratic Party at large.  —  On Saturday afternoon, Thomas Crooks, 20, climbed onto the roof of a building in Butler, Pa., carrying an AR-style rifle purchased … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/16/they-didnt-shoot-donald-trump/"
  },
  {
    "text": "Biden, in 1st major speech after Trump shooting, accuses him of ‘lying like hell’  —  He hit back his rival's claims and policies but avoided personal attacks.  —  President Joe Biden speaks at the 115th NAACP National Convention at the Mandalay Bay Convention Center, on July 16, 2024, in Las Vegas.",
    "url": "https://abcnews.go.com/Politics/biden-1st-major-speech-after-trump-shooting-accuses/story?id=111998836"
  },
  {
    "text": "‘Whoa whoa whoa!’  CNN host stops GOP rep for suggesting Secret Service set Trump up  —  Rep. Cory Mills (R-FL) stunned CNN anchor Kate Bolduan on Tuesday morning by insinuating that Democrats or the Biden administration might have gotten the Secret Service to set up former President Donald Trump … ",
    "url": "https://www.rawstory.com/kate-bolduan-cory-mills/"
  },
  {
    "text": "Trump endorses vaccine conspiracy theory in leaked call with RFK Jr. … Republican presidential nominee Donald Trump repeated false conspiracy theories about childhood vaccinations during a recent call with the third-party presidential candidate Robert F. Kennedy Jr., according to a video of the call leaked Tuesday.",
    "url": "https://www.cnbc.com/2024/07/16/trump-vaccines-rfk-jr.html"
  },
  {
    "text": "After Trump Assassination Attempt, Right Points Finger at Female Agents  —  The rush by conservatives to pin blame for the shooting on women in the protective detail reflects a broader opposition among Republicans to diversity efforts in hiring.  —  In the hours after the attempted assassination … ",
    "url": "https://www.nytimes.com/2024/07/16/us/politics/secret-service-female-agents.html"
  },
  {
    "text": "Yale Law School Snubs J.D. Vance-But Does Mention Taylor Swift  —  SHAKE HIM OFF  —  Donald Trump's running mate is a distinguished Ivy League graduate.  But his alma mater is mum about it.  —  J.D. Vance, the junior senator from Ohio selected on Monday to be Donald Trump's running mate, is a graduate of Yale Law School.",
    "url": "https://www.thedailybeast.com/yale-law-school-snubs-jd-vancebut-does-mention-taylor-swift"
  },
  {
    "text": "Ted Cruz pushes the GOP's immigrant-voting lie deeper into the slime  —  The Republican Party has tried to stoke baseless fears of non-citizen voting.  At the party convention, Cruz took the falsehood much further.",
    "url": "https://www.washingtonpost.com/politics/2024/07/16/ted-cruz-rnc-speech-immigration-voting/"
  },
  {
    "text": "Armed man in ski mask arrested while approaching Republican National Convention perimeter in Milwaukee  —  Man had AK-47 pistol, ski mask, tactical bag and full magazine  —  A man armed with an AK-47 pistol and wearing a ski mask was arrested on Monday just blocks from Fiserv Forum … ",
    "url": "https://www.foxnews.com/politics/armed-man-ski-mask-arrested-while-approaching-republican-national-convention-perimeter-milwaukee"
  },
  {
    "text": "A Trump-owned company sells $299 sneakers with an image of his bloodied face after rally shooting  —  A company is now selling sneakers showing the iconic image of Donald Trump with streaks of blood on his cheek and pumping his fist in the air after he was the target of an assassination attempt",
    "url": "https://abcnews.go.com/Politics/wireStory/trump-owned-company-sells-299-sneakers-image-bloodied-111999710"
  },
  {
    "text": "Arguments in Fani Willis appeal set for after election  —  Fulton's Trump election interference case remains in limbo  —  The Georgia Court of Appeals on Tuesday set a date a month after the presidential election to hear oral arguments in the appeal to disqualify District Attorney Fani Willis … ",
    "url": "https://www.ajc.com/politics/court-sets-dec-5-for-arguments-in-fulton-da-disqualification-in-trump-case/VN2RO2Z4QVF3HFJ3YEQDZDJP7U/"
  },
  {
    "text": "School Vouchers Were Supposed to Save Taxpayer Money.  Instead They Blew a Massive Hole in Arizona's Budget.  —  Arizona, the model for voucher programs across the country, has spent so much money paying private schoolers' tuition that it's now facing hundreds of millions in budget cuts to critical state programs and projects.",
    "url": "https://www.propublica.org/article/arizona-school-vouchers-budget-meltdown"
  },
  {
    "text": "Supporters of scaling back Arkansas abortion ban sue state for rejecting ballot measure petitions  —  LITTLE ROCK, Ark. (AP) — Supporters of a proposal to ask voters to scale back Arkansas' abortion ban sued the state on Tuesday for rejecting their petitions to get the measure on the November ballot.",
    "url": "https://apnews.com/article/arkansas-abortion-ban-lawsuit-ballot-measure-f5b8125263212437e9b5b2afd80906bc"
  },
  {
    "text": "Rupert Murdoch Shows Up at Republican Convention  —  The media titan's attendance in Milwaukee was another extraordinary turn in his contorted relationship with Donald J. Trump.  —  He confided to friends in the fall of 2020 that he thought Donald J. Trump was going “increasingly mad” … ",
    "url": "https://www.nytimes.com/2024/07/16/business/media/rupert-murdoch-rnc.html"
  }
]