[
  {
    "text": "House Dems go into “complete meltdown” as Schumer folds  —  House Democrats erupted into apoplexy Thursday night after Senate Minority Leader Chuck Schumer (D-N.Y.) said he would support Republicans' stopgap government funding measure.  —  Why it matters: House Democrats feel like they “walked the plank,” in the words of one member.",
    "url": "https://www.axios.com/2025/03/14/house-democrats-angry-chuck-schumer-shutdown"
  },
  {
    "text": "Trump and Musk Would Love a Shutdown.  We Must Not Give Them One.  —  Over the past two months, the United States has confronted a bitter truth: The federal government has been taken over by a nihilist.  —  President Trump has taken a blowtorch to our country and wielded chaos like a weapon.",
    "url": "https://www.nytimes.com/2025/03/13/opinion/trump-musk-shutdown-senate.html?unlocked_article_code=1.304.vyIR.3Ib7Aj9iPg_I&smid=url-share"
  },
  {
    "text": "Ocasio-Cortez mobilizes Democrats against Schumer plan as colleagues privately urge her to consider primary challenge  —  New York Rep. Alexandria Ocasio-Cortez said Thursday that she plans to mobilize her massive base of followers to oppose what she described as an “acquiesce” … ",
    "url": "https://www.cnn.com/2025/03/13/politics/ocasio-cortez-schumer-democratic-shutdown-plan/"
  },
  {
    "text": "Trump lauds Schumer's ‘guts’ in backing bill to avoid shutdown  —  President Donald Trump on Friday congratulated Senate Minority Leader Chuck Schumer for “doing the right thing” by backing the Republican-led bill to avert a government shutdown, a choice that's put the New York Democrat at odds with many in his party.",
    "url": "https://www.politico.com/live-updates/2025/03/14/congress/trump-congratulates-schumer-00230577"
  },
  {
    "text": "Under G.O.P., Congress Cedes Power to Trump, Eroding Its Influence  —  On spending, oversight and other issues, Republican lawmakers have willingly ceded power traditionally reserved for Congress to the Trump White House.  —  The Republican-led Congress isn't just watching the Trump administration gobble up its constitutional powers.",
    "url": "https://www.nytimes.com/2025/03/14/us/politics/trump-republicans-congress-power.html?unlocked_article_code=1.304.mZPG.1zyMTvLk3lG0&smid=url-share"
  },
  {
    "text": "My Vote on the GOP Spending Bill  —  I'm a hard NO on the Republican spending bill.  On cloture.  On all of it.  When a wannabe dictator is trying to seize power, it must not be given to him.  Not without a fight.  —  Sen. Adam Schiff  —  Transcript  —  Tomorrow, the U.S. Senate … ",
    "url": "https://schiffnotes.substack.com/p/my-vote-on-the-gop-spending-bill"
  },
  {
    "text": "Democrats Have to Stop Making Political Decisions with an Eye Towards 2026  —  I've been out of pocket as events moved towards today's cloture vote on the dogshit continuing resolution Republicans have written.  It's not yet clear whether seven Democrats (in addition to John Fetterman) … ",
    "url": "https://www.emptywheel.net/2025/03/14/democrats-have-to-stop-making-political-decisions-with-an-eye-towards-2026/"
  },
  {
    "text": "Universities Scramble to Avoid Being Trump's Next Target  —  Amid DEI backlash and funding threats, universities nationwide cancel events, rescind grad school offers  —  Ohio University suspended next month's Black alumni reunion.  The University of Massachusetts revoked admission offers to biomedical graduate students.",
    "url": "https://www.wsj.com/us-news/education/colleges-trump-dei-funding-changes-4b60c0bb?st=Zn4Bhf&reflink=mobilewebshare_permalink"
  },
  {
    "text": "First They Came for Columbia  —  Like many autocrats before him, Donald Trump has launched what could be a devastating attack on universities.  —  Over the last week, the Trump administration has cancelled $400 million in grants and contracts to Columbia University and $800 million in grants to Johns Hopkins University.",
    "url": "https://www.thecrimson.com/article/2025/3/14/enos-levitsky-harvard-columbia-trump/"
  },
  {
    "text": "More than 50 universities face federal investigations as part of Trump's anti-DEI campaign  —  More than 50 universities are being investigated for alleged racial discrimination as part of President Donald Trump's campaign to end diversity, equity and inclusion programs that his officials say exclude white and Asian American students.",
    "url": "https://apnews.com/article/trump-dei-universities-investigated-f89dc9ec2a98897577ed0a6c446fae7b"
  },
  {
    "text": "Federal Agents Search Two Dorm Rooms at Columbia University  —  Department of Homeland Security officials conducted the search as the Trump administration sought to deport a former student and pro-Palestinian activist.  —  Department of Homeland Security officials searched two dorm rooms … ",
    "url": "https://www.nytimes.com/2025/03/14/us/politics/dorm-search-columbia-university-dhs.html"
  },
  {
    "text": "Vance booed at Kennedy Center after Trump board takeover  —  Vice President Vance was met by a chorus of boos from audience members at the Kennedy Center while attending a National Symphony Orchestra performance late Thursday.  —  The former Ohio senator responded to the jeers with a smile … ",
    "url": "https://thehill.com/homenews/administration/5194668-jd-vance-booed-kennedy-center/"
  },
  {
    "text": "Stocks Tumble Into Correction as Investors Sour on Trump  —  The S&P 500 is now more than 10% below its last record high — a line in the sand for investors worried about a sell-off gathering steam.  —  The world's most widely followed stock-market benchmark slid into a correction on Thursday … ",
    "url": "https://www.nytimes.com/2025/03/13/business/sp-500-stocks-market-correction.html"
  },
  {
    "text": "Judge orders thousands of probationary employees fired by Trump be reinstated  —  U.S. District Judge James Bredar granted a temporary restraining order against numerous agencies and departments affected by the administration's reduction in workforce efforts.",
    "url": "https://www.nbcnews.com/politics/trump-administration/judge-orders-thousands-probationary-employees-fired-trump-reinstated-rcna196366"
  },
  {
    "text": "Fear and Loathing in the West Wing  —  Inside the revolt against Elon Musk...  Welcome back to The Red Letter.  —  The tolerance for Elon Musk inside of the White House is wearing thin, as they deal with the fallout of his calamitous interview with Larry Kudlow when he touched the third rail - entitlements.",
    "url": "https://www.tarapalmeri.com/p/fear-and-loathing-in-the-west-wing"
  },
  {
    "text": "Democratic Rep. Raúl M. Grijalva Of Arizona Dies From Complications From Cancer Treatment  —  Rep. Raúl Grijalva, a 12-term Democrat from Arizona, has died after complications from cancer treatment, his office says.  —  Democratic U.S. Rep. Raúl M. Grijalva of Arizona … ",
    "url": "https://www.huffpost.com/entry/raul-grijalva-democrat-dead-arizona-cancer_n_67d34c3fe4b0e72dd7ff058a"
  },
  {
    "text": "Parents Sue Trump Administration for Allegedly Sabotaging Education Department's Civil Rights Division  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up to receive our biggest stories as soon as they're published.  —  Saying the Trump administration … ",
    "url": "https://www.propublica.org/article/department-of-education-civil-rights-lawsuit-trump-parents"
  },
  {
    "text": "Fiasco for Musk as He Craters in New Polls and DOGE Cuts Lose in Court  —  Elon Musk is suddenly facing lots of bad news.  A judge just ordered the Trump administration to reinstate thousands of fired federal workers, a blow to Musk's so-called Department of Government Efficiency.",
    "url": "https://newrepublic.com/article/192747/fiasco-musk-craters-new-polls-doge-cuts-lose-court"
  },
  {
    "text": "Farmers face steep losses in the middle of Trump's trade war and funding cuts  —  From funding cuts to tariffs, farmers have found themselves struggling to find markets for their products and facing the risk of steep losses for the year ahead.  —  Jennifer Gilkerson never imagined … ",
    "url": "https://www.nbcnews.com/politics/economics/farmers-face-steep-losses-middle-trumps-trade-war-funding-cuts-rcna195967"
  },
  {
    "text": "Judge rejects DOJ's effort to expand reach of Trump's Jan. 6 pardon  —  U.S. District Judge Dabney Friedrich, a Trump appointee, called the Justice Department's position irrational.  —  A federal judge has denied the Justice Department's attempt to apply President Donald Trump's blanket pardon … ",
    "url": "https://www.politico.com/news/2025/03/13/judge-rejects-trump-pardon-expansion-00230518"
  },
  {
    "text": "These Are the 10 DOGE Operatives Inside the Social Security Administration  —  The team working at the Social Security Administration appears to be among the largest DOGE units deployed to any government agency.  —  At least 10 people associated with Elon Musk's so-called Department of Government Efficiency … ",
    "url": "https://www.wired.com/story/doge-operatives-access-social-security-administration/"
  },
  {
    "text": "Focus group: Trump swing voters in Michigan have buyers' remorse  —  Most Michigan swing voters in our latest Engagious/Sago focus groups said that although they voted for President Trump in November, they have objections, frustrations and fears about his behavior since he returned to power.",
    "url": "https://www.axios.com/2025/03/14/trump-harris-michigan-focus-group"
  },
  {
    "text": "North Carolina GOP town hall gets rowdy as attendees hurl scathing questions on Trump  —  Before answering an attendee's question about President Donald Trump's “destructive and disastrous trade war,” Rep. Chuck Edwards made a plea to the rowdy crowd at his Thursday town hall in Asheville, North Carolina.",
    "url": "https://apnews.com/article/republicans-town-hall-north-carolina-trump-ba90438a9265bc868cf1e3ade150a943"
  },
  {
    "text": "Hundreds of federal offices could begin closing this summer at DOGE's behest, internal records show  —  Federal agencies will begin to vacate hundreds of offices across the country this summer under a frenetic and error-riddled push by Elon Musk's budget-cutting advisers to terminate leases that they say waste money.",
    "url": "https://apnews.com/article/doge-federal-buildings-leases-canceled-offices-closed-92974159f6c29a76a90238e8794c7467"
  },
  {
    "text": "Trump's fantastical claim of a $200 billion ‘subsidy’ to Canada  —  No matter how we do the math, the numbers don't add up.  —  Just now  —  “We're spending $200 billion a year to subsidize Canada.”  — President Donald Trump, during remarks with NATO Secretary General Mark Rutte, March 13",
    "url": "https://www.washingtonpost.com/politics/2025/03/14/trump-canada-subsidy-claim-false/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQxOTI0ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQzMzA3MTk5LCJpYXQiOjE3NDE5MjQ4MDAsImp0aSI6IjJkZDg4MzZkLTUwYjEtNGI0Ni1iZGY1LTcxNWE0MDJmYjk5YSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzAzLzE0L3RydW1wLWNhbmFkYS1zdWJzaWR5LWNsYWltLWZhbHNlLyJ9.h1O_zTG0Z8JulWZdmfIordFPZxP-75hL-Y3lzfq4ufw"
  },
  {
    "text": "Everybody Hates Elon  —  And other tales of collapsing confidence  —  After Donald Trump won the 2024 election, progressives had one great fear about his economic policies — namely, that he wouldn't do much.  Oh, he'd slap on a few tariffs, make a big show of eliminating “woke” spending … ",
    "url": "https://paulkrugman.substack.com/p/everybody-hates-elon"
  },
  {
    "text": "AP Exclusive: US and Israel look to Africa for resettling Palestinians uprooted from Gaza  —  The U.S. and Israel have reached out to officials of three East African governments to discuss using their territories as potential destinations for resettling Palestinians uprooted … ",
    "url": "https://apnews.com/article/israel-palestinians-gaza-trump-somaliland-sudan-somalia-575e03aaa0c487bae2fbadfdef8f5ca3"
  },
  {
    "text": "Johns Hopkins to Cut More Than 2,000 Workers Funded by Federal Aid  —  The university, a leader in scientific research, has been hard hit by the Trump administration's cuts, which will slash at least $800 million from its budget.  —  Johns Hopkins University, one of the country's leading centers … ",
    "url": "https://www.nytimes.com/2025/03/13/us/trump-cuts-johns-hopkins-university-layoffs.html?unlocked_article_code=1.3k4.oksp.IRgzd1wp37Ic"
  },
  {
    "text": "Germans Reach Deal to Spend Big on Defense, Climate and More  —  The agreement between centrist parties, led by the likely next chancellor, Friedrich Merz, was billed as a response to America's shrinking security guarantees.  —  Friedrich Merz, the likely next chancellor of Germany … ",
    "url": "https://www.nytimes.com/2025/03/14/world/europe/germany-defense-climate-spending-deal.html"
  },
  {
    "text": "Insurers warn that US weather agency mass firings will hit climate risk data  —  Reinsurance trade group appeals to US commerce secretary Lutnick to preserve data collection after thousands of jobs axed  —  Insurers have warned that mass firings at US science agencies could threaten … ",
    "url": "https://www.ft.com/content/33a4d1f6-848f-4b63-86c6-9330fe6f6d89"
  },
  {
    "text": "Musk Retweets 'Hitler Didn't Murder Millions' Message Amid Ongoing Nazi Controversy  —  Tesla chief and presidential adviser Elon Musk shared a post Thursday that said public sector workers, not Nazi dictator Adolf Hitler, murdered millions of people, marking the billionaire's latest Nazi-related post … ",
    "url": "https://www.forbes.com/sites/antoniopequenoiv/2025/03/13/musk-retweets-hitler-didnt-murder-millions-message-amid-ongoing-nazi-controversy/"
  }
]