[
  {
    "text": "Dow tumbles more than 600 points, S&P 500 posts biggest loss since December as Trump says tariffs will proceed  —  The S&P 500 retreated on Monday, extending February's rout and turning red for the year after President Donald Trump's confirmation of forthcoming tariffs ratcheted up economic concerns.",
    "url": "https://www.cnbc.com/2025/03/02/stock-futures-rise-slightly-in-overnight-trading-as-investors-await-tariff-news-live-updates.html"
  },
  {
    "text": "Canadian premier says he will cut off electricity exports to US ‘with a smile on my face’  —  Ontario Premier Doug Ford said Monday he is prepared to cut off electricity exports to the U.S. if President Trump's 25 percent tariffs on Canadian goods go through.",
    "url": "https://thehill.com/policy/international/5173914-ontario-premier-doug-ford-tariff-threat/"
  },
  {
    "text": "Exclusive: Honda to produce next Civic in Indiana, not Mexico, due to US tariffs, sources say  —  Honda (7267.T) has decided to produce its next-generation Civic hybrid in the U.S. state of Indiana, instead of Mexico, to avoid potential tariffs on one of its top-selling car models, according to three people familiar with the matter.",
    "url": "https://www.reuters.com/business/autos-transportation/honda-produce-next-civic-indiana-not-mexico-due-us-tariffs-sources-say-2025-03-03/"
  },
  {
    "text": "Dow tumbles 650 points as Trump confirms tariffs on Mexico and Canada will start Tuesday  —  New York CNN  —  US stocks slid Monday as investors braced for President Donald Trump's proposed tariffs on Canada and Mexico to go into effect by the midnight deadline.",
    "url": "https://www.cnn.com/2025/03/03/investing/us-stocks-tariffs-loom"
  },
  {
    "text": "Car Prices Are Poised for $12,000 Surge on Trump's New Tariffs  — Auto bosses warn Trump administration of economic consequences  — Companies rush to stockpile parts, engines in US warehouses  —  Impending tariffs on Canada and Mexico risk driving up US car prices by as much as $12,000 … ",
    "url": "https://www.bloomberg.com/news/articles/2025-03-03/car-prices-are-poised-for-12-000-surge-on-trump-s-new-tariffs?accessToken=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzb3VyY2UiOiJTdWJzY3JpYmVyR2lmdGVkQXJ0aWNsZSIsImlhdCI6MTc0MTAxMDM3NSwiZXhwIjoxNzQxNjE1MTc1LCJhcnRpY2xlSWQiOiJTU0VGV0dUMEFGQjQwMCIsImJjb25uZWN0SWQiOiJDNjVGQzRGMzI5QkU0ODE2QkZFRTI0MEY1NEU5RkQ1NyJ9.iaz4vgPss3-P_g-ff7O8LYkywbP9hrJ-SqP4tHIJlAQ"
  },
  {
    "text": "Trump Pauses Military Aid to Ukraine After Clash With Zelenskiy  — Move halts all aid currently in transit to help Ukraine  — Pause comes after Trump and Zelenskiy sparred in Oval Office  —  President Donald Trump ordered a pause to all military aid to Ukraine … ",
    "url": "https://www.bloomberg.com/news/articles/2025-03-03/trump-pauses-military-aid-to-ukraine-after-clash-with-zelenskiy"
  },
  {
    "text": "U.S. Hitting Brakes on Flow of Arms to Ukraine  —  Military financing has been stopped, and officials are meeting to consider suspending another type of assistance  —  The Trump administration has stopped financing new weapons sales to Ukraine and is considering freezing weapons shipments … ",
    "url": "https://www.wsj.com/politics/national-security/u-s-hitting-brakes-on-flow-of-arms-to-ukraine-980a71d1"
  },
  {
    "text": "Top FBI official forced out after criticizing Trump pursuit of agents who investigated Jan. 6  —  James Dennehy, the head of the FBI's New York office, is out one month after he urged colleagues to “dig in” after the new administration requested the names of all agents who worked on Capitol riot cases.",
    "url": "https://www.nbcnews.com/politics/justice-department/top-fbi-official-forced-criticizing-trump-pursuit-agents-investigated-rcna194610"
  },
  {
    "text": "Majority disapproves of Trump job performance ahead of address to Congress: Survey  —  A majority in a new survey disapprove of President Trump's job performance ahead of his scheduled address to Congress.  —  In the CNN poll released Sunday, which was conducted between Feb. 24 and 28 … ",
    "url": "https://thehill.com/homenews/administration/5172580-trump-job-performance-survey/"
  },
  {
    "text": "Struggling With Errors, DOGE Deletes Billions More From List of Savings  —  For the second time in a week, Elon Musk's government overhaul effort updated its “wall of receipts” to remove mistakes that inflated its success.  —  Elon Musk's Department of Government Efficiency has deleted hundreds … ",
    "url": "https://www.nytimes.com/2025/03/03/us/politics/doge-musk-contracts-wall.html"
  },
  {
    "text": "Ukraine's Zelenskyy says end of war with Russia is ‘very, very far away’  —  A deal to end the war between Ukraine and Russia “is still very, very far away,” Ukrainian President Volodymyr Zelenskyy said, adding that he expects to keep receiving American support despite his recent fraught relations with U.S. President Donald Trump.",
    "url": "https://apnews.com/article/russia-ukraine-war-zelenskyy-starmer-trump-b025877c40ffe0ddf2a92adad1715231"
  },
  {
    "text": "Trump slams Zelenskyy for saying the end of the Russia war ‘is still very, very far away’  —  President Donald Trump slammed Ukrainian President Volodymyr Zelenskyy on Monday for suggesting that the end of Russia's war against Ukraine likely “is still very, very far away.”",
    "url": "https://apnews.com/article/trump-zelenskyy-russia-ukraine-a15a459c9a3a393d040478ebbe250a9e"
  },
  {
    "text": "DOGE moves to cancel NOAA leases on key weather buildings … - It was designed to integrate multiple forecasting centers in one building to improve operating efficiency. … - Two ex-National Oceanic and Atmospheric Administration officials also confirmed the list.",
    "url": "https://www.axios.com/2025/03/03/doge-noaa-weather-building-leases-trump"
  },
  {
    "text": "Top HHS spokesperson quits after clashing with RFK Jr.  —  Thomas Corry resigned over disagreements with the HHS secretary and his approach to the measles outbreak.  —  The top spokesperson at the Health and Human Services Department has abruptly quit after clashing with Secretary Robert F. Kennedy Jr … ",
    "url": "https://www.politico.com/news/2025/03/03/top-hhs-spokesperson-quits-00207000"
  },
  {
    "text": "Poll: Majorities say state of the union is not strong, and Trump is rushing change  —  Majorities say the state of the union is not strong, that the country is headed in the wrong direction and President Trump is rushing to make changes without considering their impact, a new NPR/PBS News/Marist poll finds.",
    "url": "https://www.npr.org/2025/03/03/nx-s1-5312033/trump-poll-doge-economy-favorability"
  },
  {
    "text": "Trump orders swathes of US forests to be cut down for timber  —  President's move to expand tree cutting across 280m acres evades rules to protect endangered species  —  Donald Trump has ordered that swathes of America's forests be felled for timber, evading rules to protect endangered species … ",
    "url": "https://www.theguardian.com/us-news/2025/mar/03/trump-national-forest-executive-order"
  },
  {
    "text": "CFPB to Employees: When We Said Stop Work, We Didn't Mean Stop Work!  —  The illegal plan to dismantle the consumer agency is failing.  So Russ Vought and his charges are engaging in some CYA.  —  Russell Vought speaks during a Senate Budget Committee hearing on his nomination to lead … ",
    "url": "https://prospect.org/economy/2025-03-03-cfpb-we-didnt-mean-stop-work-russell-vought/"
  },
  {
    "text": "What a Weekend for Putin!  —  It was a hell of a weekend for bad men getting what they paid for out of Donald Trump.  And while we'll focus on Vladimir Putin here, we don't want to fully ignore venture capitalist David Sacks, Donald Trump's “crypto czar,” who seemingly stands … ",
    "url": "https://www.thebulwark.com/p/what-a-weekend-for-putin"
  },
  {
    "text": "Negotiations to avert a shutdown sputter as disputes persist over DOGE cuts  —  Trump and congressional leaders have lost hope in a full government funding deal and pivoted toward a stopgap bill for the rest of the fiscal year.  Even that is proving difficult.",
    "url": "https://www.nbcnews.com/politics/congress/negotiations-avert-shutdown-sputter-disputes-persist-doge-cuts-rcna194498"
  },
  {
    "text": "Trump Orders Permanent Govt Shutdown - No, Really ...  It hasn't gotten a lot of attention but Donald Trump's February 11th “workforce optimization” executive order provides a very clear framework for the end stage goal of all the cutting.  After a bunch of specific imperatives listed under Section 3-C … ",
    "url": "https://talkingpointsmemo.com/edblog/trump-orders-permanent-govt-shutdown-no-really"
  },
  {
    "text": "Trump Bid to Take Over Postal Service Could Threaten Mail Voting  —  President Donald Trump may soon attempt to absorb the U.S. Postal Service (USPS), an independent agency, into his administration by issuing an executive order that reportedly would dissolve the service's leadership.",
    "url": "https://www.democracydocket.com/analysis/trump-postal-service-executive-order-mail-voting-threat/"
  },
  {
    "text": "Donald Trump Is Backed by the Business Elite  —  Over lunch last week with a friend of mine — a major technology investor who has been an ardent Democrat — the talk quickly turned to politics.  Like many businessmen, he refuses to air his views publicly to avoid drawing fire.  In private, he's more forthcoming.",
    "url": "https://www.nytimes.com/2025/03/03/opinion/trump-wall-street-biden-big-business.html"
  },
  {
    "text": "Atlanta Fed's GDPNow Estimate Falls Again  —  The Federal Reserve Bank of Atlanta's running forecast for first-quarter gross domestic product slid again on Monday.  —  The Atlanta Fed's GDPNow estimate now calls for a first-quarter GDP decline of 2.8%, down from a decline of 1.5% on Friday.",
    "url": "https://www.barrons.com/livecoverage/stock-market-today-030325/card/atlanta-fed-s-gdpnow-estimate-falls-again-kv9ZZAC5h68mreyNgjBk"
  },
  {
    "text": "DC Police reinstates officers convicted in police chase that killed Karon Hylton-Brown  —  President Donald Trump pardoned Officer Terence Sutton and Lt. Andrew Zabavsky during his first week in office. … WASHINGTON — The DC Police Department has agreed to rehire two officers … ",
    "url": "https://www.wusa9.com/article/news/crime/dc-police-reinstate-officers-convicted-in-police-chase-that-killed-karon-hylton-brown-terence-sutton-andrew-zabavsky/65-0e74349e-21e5-4187-afc9-c87e91fefc02"
  },
  {
    "text": "Flights to Reagan National Airport in D.C. receive false collision alerts while landing  —  The Federal Aviation Administration is investigating after several airliners on approach to land at Washington Reagan National Airport Saturday morning received what appear to be false alarms from their onboard Traffic Collision Avoidance System.",
    "url": "https://www.cbsnews.com/news/dc-airport-false-collision-alerts/"
  },
  {
    "text": "Treasury Department Announces Suspension of Enforcement of Corporate Transparency Act Against U.S. Citizens and Domestic Reporting Companies  —  The Treasury Department is announcing today that, with respect to the Corporate Transparency Act, not only will it not enforce any penalties … ",
    "url": "https://home.treasury.gov/news/press-releases/sb0038"
  }
]