[
  {
    "text": "‘Start the Steal’: Trump Once Again Planning to Overturn an Election  —  THERE IS A PLAN AFOOT to overturn the results of the November election, and for both parties it is fast becoming a major concern.  The scheme is being hatched by Republicans on behalf of Donald Trump, who seeks to steal the election if Joe Biden defeats him again.",
    "url": "https://plus.thebulwark.com/p/start-the-steal-trump-november-2024"
  },
  {
    "text": "Ex-Trump Election Lawyer John Eastman Has Lost His Law License  —  John Eastman, the former Donald Trump election lawyer behind the so-called “fake electors” scheme, officially lost his ability to practice law in the state of California on Tuesday.  —  The California State Bar recommended … ",
    "url": "https://www.mediaite.com/politics/just-in-ex-trump-election-lawyer-john-eastman-has-been-disbarred/"
  },
  {
    "text": "Why the strike killing World Central Kitchen workers is different  —  With help from Alex Ward, Paul McLeary, Lara Seligman and Phelim Kine  —  The Israeli airstrike that killed aid workers in Gaza is resonating especially in Washington national security circles for two reasons … ",
    "url": "https://www.politico.com/newsletters/national-security-daily/2024/04/02/why-the-strike-killing-world-central-kitchen-workers-is-different-00150205"
  },
  {
    "text": "World Central Kitchen Says U.S. Citizen Among 7 Staff Killed in ‘Targeted’ Triple Israeli Attack  —  ‘UNFORGIVABLE’  —  José Andrés' international aid organization said it would pause its work in Gaza in the wake of the killings.  —  A dual U.S.-Canadian citizen … ",
    "url": "https://www.thedailybeast.com/world-central-kitchen-says-us-citizen-among-7-staff-killed-in-targeted-triple-israeli-attack"
  },
  {
    "text": "Amazon Ditches ‘Just Walk Out’ Checkouts at Its Grocery Stores  —  Amazon Fresh is moving away from a feature of its grocery stores where customers could skip checkout altogether.  —  Amazon is phasing out its checkout-less grocery stores with “Just Walk Out” technology, first reported by The Information Tuesday.",
    "url": "https://gizmodo.com/amazon-reportedly-ditches-just-walk-out-grocery-stores-1851381116"
  },
  {
    "text": "Virginia Democrat slams proposal to name airport after Trump: 'I'd suggest they find a federal prison'  —  Rep. Gerry Connolly (D-Va.) on Tuesday criticized a recently-introduced GOP bill that would rename Washington Dulles International Airport after former President Trump.",
    "url": "https://thehill.com/homenews/house/4570261-virginia-democrat-slams-trump-airport-prison/"
  },
  {
    "text": "Trump vows he'll have a ‘statement’ on abortion ‘next week’  —  The former president addressed a question from NBC News about whether he supports Florida's six-week abortion ban.  —  GRAND RAPIDS, Mich. — Former President Donald Trump on Tuesday announced that his campaign would address … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-statement-abortion-week-rcna146107"
  },
  {
    "text": "Sources: UT lays off at least 60 employees previously in DEI-related position, closes DCCE  —  A week after state Sen. Brandon Creighton warned Texas university system administrators about the state's expectations for higher education institutions to comply with Senate Bill 17 … ",
    "url": "https://www.statesman.com/story/news/politics/state/2024/04/02/texas-senate-bill-17-anti-dei-ut-fires-four-staff-related-positions-two-sources-confirm/73179902007/"
  },
  {
    "text": "UT-Austin announces round of firings in latest step to comply with Texas' DEI ban  —  The firings come after state leaders criticized universities for not doing enough to enforce the ban.  Students say UT-Austin has already overcorrected.  —  The University of Texas at Austin … ",
    "url": "https://www.texastribune.org/2024/04/02/university-texas-austin-firings-dei-ban/"
  },
  {
    "text": "Democratic senator eyeing bill to repeal Comstock Act  —  Congressional Democrats are strategizing over legislation to repeal the Comstock Act, the 19th century anti-vice law that's being eyed by conservative activists to potentially enact a national abortion ban.",
    "url": "https://thehill.com/homenews/senate/4570689-democratic-bill-repeal-comstock-act-abortion/"
  },
  {
    "text": "Taylor Swift among 141 new billionaires in ‘amazing year for rich people’  —  Combined assets of $14.2tn are more than the GDP of every country except China and the US  —  There are more billionaires than ever before.  The world has 2,781 people with fortunes exceeding $1bn (£800m) … ",
    "url": "https://www.theguardian.com/business/2024/apr/02/world-gains-141-new-billionaires-in-amazing-year-for-rich-people"
  },
  {
    "text": "'It's clearly strategic': Why Trump kept attacking judges' families  —  Late on Monday, Justice Juan Merchan tried to crack down on Trump's latest vitriol.  —  NEW YORK — Every time prosecutors and judges tried to muzzle Donald Trump, he lashed out at their families.",
    "url": "https://www.politico.com/news/2024/04/02/trump-attacks-judges-families-gag-order-00150080"
  },
  {
    "text": "REI Fired A Popular Manager For Not Immediately Reporting Union Chatter  —  The incident shows how aggressively the liberal-branded retailer is responding to union organizing — and how low-level managers are caught in the middle.  —  When William Littig showed up for work at his REI store on Feb. 21 … ",
    "url": "https://www.huffpost.com/entry/rei-fired-manager-union-campaign_n_660b0c31e4b007c08f9e7a99"
  },
  {
    "text": "The Supreme Court May Give Us Another 2008 Financial Crisis  —  A new case could decimate state-level consumer protections against predatory banking practices.  —  The United States Supreme Court will soon decide a case that could decimate consumer protections against abusive banking practices … ",
    "url": "https://www.levernews.com/the-supreme-court-may-give-us-another-2008-financial-crisis/"
  },
  {
    "text": "With enthusiasm, Raffensperger advises Larry David to curb attacks on voter law  —  Top elections official responds to HBO show's brush with Georgia ban on distribution of food or drink to voters with pretty, pretty, pretty cutting letter  —  Larry David, heading into his final episode of HBO's … ",
    "url": "https://www.ajc.com/politics/with-enthusiasm-raffensperger-advises-larry-david-to-curb-attacks-on-voter-law/GW5XLU53EFE6BIOYRTLSZW2S7Y/"
  },
  {
    "text": "President Biden is now posting into the fediverse  —  POTUS puts the ‘fed’ in ‘fediverse.’  —  The official US president Threads account, currently helmed by President Joe Biden, has begun using Meta's ActivityPub integration, making Biden the first sitting US president to post on the decentralized networking protocol.",
    "url": "https://www.theverge.com/2024/4/2/24119353/joe-biden-threads-mastodon-activitypub-fediverse"
  },
  {
    "text": "Tommy Tuberville accuses Dems of being part of ‘a Satanic cult’  —  Republican Sen. Tommy Tuberville of Alabama has now declared, more than once, his belief that Democrats are “a Satanic cult.”  This isn't normal.  —  Sen. Tommy Tuberville recently campaigned for an ally in Utah … ",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/tommy-tuberville-accuses-dems-part-satanic-cult-rcna146033"
  },
  {
    "text": "Rep. Grijalva Statement on Cancer Diagnosis  —  TUCSON, Ariz. - Today, U.S. Representative Raúl M. Grijalva (AZ-07) issued the following statement:  —  “A few weeks ago, I sought medical treatment for a persistent cough which was initially diagnosed as pneumonia.",
    "url": "https://grijalva.house.gov/rep-grijalva-statement-on-cancer-diagnosis/"
  },
  {
    "text": "Microsoft faulted for ‘cascade’ of failures in Chinese hack  —  The independent Cyber Safety Review Board's report knocks the tech giant for shoddy cybersecurity practices, lax corporate culture and a deliberate lack of transparency  —  A review board, mandated by President Biden … ",
    "url": "https://www.washingtonpost.com/national-security/2024/04/02/microsoft-cyber-china-hack-report/"
  },
  {
    "text": "Donald Trump doubles down on ‘bloodbath’ warning as he criticizes Joe Biden's handling of the border  —  WASHINGTON - Former President Donald Trump returned to the campaign trail Tuesday and again employed the violent imagery of a “bloodbath,” this time to describe crime and illegal border crossings.",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/04/02/trump-bloodbath-biden/73105362007/"
  },
  {
    "text": "Mandatory DEI Statements Are Ideological Pledges of Allegiance.  Time to Abandon Them.  —  Council on Academic Freedom at Harvard  —  On a posting for a position as an assistant professor in international and comparative education at the Harvard Graduate School of Education … ",
    "url": "https://www.thecrimson.com/column/council-on-academic-freedom-at-harvard/article/2024/4/2/kennedy-abandon-dei-statements/"
  },
  {
    "text": "Gov. Tony Evers vetoes bill aimed at trans and non-binary athletes  —  MADISON - Gov. Tony Evers vetoed a bill Tuesday that would have banned transgender and gender nonconforming youth from participating on school athletic teams that align with their gender identity.",
    "url": "https://www.jsonline.com/story/news/politics/2024/04/02/tony-evers-vetoes-wisconsin-bill-aimed-at-trans-non-binary-athletes/73177911007/"
  }
]