[
  {
    "text": "Trump defends dictator comments amid NYC soiree filled with MAGA diehards  —  At an event with key figures within the MAGA movement, the former president repeated comments that he wants to be a dictator on “day one.”  —  NEW YORK — The chairman of an Austrian political party founded by ex-Nazis … ",
    "url": "https://www.politico.com/news/2023/12/10/trump-defends-dictator-comments-amid-nyc-soiree-filled-with-extremists-maga-diehards-00130968"
  },
  {
    "text": "Playbook: Trump doubles down on ‘dictator’ desire  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  At an event last night sponsored by the New York Young Republican Club, DONALD TRUMP unsurprisingly defended his comments at a Fox News town hall … ",
    "url": "https://www.politico.com/newsletters/playbook/2023/12/10/trump-doubles-down-on-dictator-desire-00130973"
  },
  {
    "text": "Trump the ‘human gumball machine’ will ‘impose his will’ on the nation if elected, Romney says  —  “A thought or a notion comes in and it comes out of his mouth.  There's not a lot of filter that goes on,” he said of Trump.  —  Some Republicans have read former President Donald Trump's comment … ",
    "url": "https://www.politico.com/news/2023/12/10/trump-romney-election-2024-00130972"
  },
  {
    "text": "Liz Cheney's plea: ‘Our focus has got to be on defeating Donald Trump’ in 2024  —  She sat down with “This Week” co-anchor Jonathan Karl to discuss her new book.  —  “This Week” co-anchor Jonathan Karl interviews former Wyoming Rep. Liz Cheney.  —  Former Republican Rep. Liz Cheney … ",
    "url": "https://abcnews.go.com/Politics/liz-cheneys-plea-focus-defeating-donald-trump-2024/story?id=105524368"
  },
  {
    "text": "Mitt Romney Says Joe Manchin Is the 'Joe I'd Like to Vote For' in 2024  —  The Utah senator, a vocal Trump critic, did not rule out voting for President Joe Biden  —  Sen. Mitt Romney, R-Utah, on Sunday said he would prefer to vote for Sen. Joe Manchin, D-W.Va., come 2024.",
    "url": "https://themessenger.com/politics/mitt-romney-says-joe-manchin-is-the-joe-id-like-to-vote-for-in-2024"
  },
  {
    "text": "Republicans to meet allies of Hungary's Viktor Orbán on ending Ukraine aid  —  Hungarian appearance at two-day event part of Orbán's transatlantic attempt to bolster Russia's war  —  Allies of Hungary's far-right prime minister Viktor Orbán will hold a closed-door meeting … ",
    "url": "https://www.theguardian.com/us-news/2023/dec/10/hungary-viktor-orban-republicans-ukraine-aid"
  },
  {
    "text": "As Fury Erupts Over Campus Antisemitism, Conservatives Seize the Moment  —  Republicans have been attacking elite universities for years.  After a tense congressional hearing last week, many on the left are joining them.  —  For years, conservatives have struggled to persuade American voters … ",
    "url": "https://www.nytimes.com/2023/12/10/us/universities-antisemitism-conservatives-liberals.html"
  },
  {
    "text": "Jack Smith reveals sweeping scope of bid to debunk Trump election machine claims  —  In a new filing, his team described interviewing more than a dozen of the top intelligence officials in Trump's administration.  —  Special counsel Jack Smith on Saturday sharply rejected Donald Trump's contention … ",
    "url": "https://www.politico.com/news/2023/12/09/jack-smith-reveals-sweeping-scope-of-bid-to-debunk-trump-election-machine-claims-00130965"
  },
  {
    "text": "Giuliani spread lies about Georgia election workers.  A jury will decide what he owes them.  —  A damages trial begins Monday in a case in which a judge has already ruled that Rudy Giuliani is liable for defamation.  —  When Rudy Giuliani steps into federal court on Monday … ",
    "url": "https://www.politico.com/news/2023/12/10/rudy-giuliani-georgia-election-workers-trial-00130990"
  },
  {
    "text": "Less appetite — and opportunity — to serve as fake Trump electors in 2024  —  Amid a growing number of criminal investigations into the 2020 election, some who once cast electoral college votes for the former president say they would not do it again  —  Republican Party activist Ken Carroll thought … ",
    "url": "https://www.washingtonpost.com/politics/2023/12/10/trump-fake-electors-charges/"
  },
  {
    "text": "In a reversal, Donald Trump says he will not testify in his own defense in New York fraud trial  —  Trump was scheduled to take the stand Monday as the months-long $250 million civil fraud trial against him and his company enters its final week.  —  In an 11th hour reversal … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/reversal-donald-trump-says-will-not-testify-defense-new-york-fraud-tri-rcna128749"
  },
  {
    "text": "She's with him: Hillary Clinton steps out as a key player in Biden's re-election effort  —  Clinton hosted a $1 million fundraiser at her Georgetown home.  —  WASHINGTON — On the final Monday in November, in a Washington home stately enough to have a name — Whitehaven … ",
    "url": "https://www.nbcnews.com/politics/2024-election/hillary-clinton-joe-biden-campaign-rcna128190"
  },
  {
    "text": "I Covered Joe Manchin for Years.  He Might Not Care If He Sinks Joe Biden.  —  The senator's brand of centrism helped him survive West Virginia's rapid transformation from blue to red.  But it also helped sow the seeds of the Democratic Party's demise back home.",
    "url": "https://www.politico.com/news/magazine/2023/12/10/democrats-manchin-2024-00130910"
  },
  {
    "text": "Biden's primary challenger steps up attacks, prompting Trump comparisons  —  Long-shot Dean Phillips has called Biden a threat to democracy.  It is exasperating to some Democrats who are rebuking similar criticisms from Trump, who has tried to deflect from his own embrace of authoritarian stances.",
    "url": "https://www.washingtonpost.com/politics/2023/12/08/dean-phillips-biden-threat-democracy/"
  }
]