[
  {
    "text": "U.S. Deploys B-2 Bombers as Trump Plans to Meet National Security Team  —  President Trump announced the United States had struck Fordo, Iran's heavily fortified nuclear facilities, as well as two other sites.  —  Here are the latest developments.  —  The United States has entered Israel's war against Iran.",
    "url": "https://www.nytimes.com/live/2025/06/21/world/iran-israel-trump?unlocked_article_code=1.Q08.70nJ.4dnQ-xScDwbt&smid=url-share"
  },
  {
    "text": "Exclusive: Israel seeks swift action on Iran, sources say, with a split U.S. administration  —  Israeli officials have told the Trump administration they do not want to wait two weeks for Iran to reach a deal to dismantle key parts of its nuclear program and Israel could act alone before the deadline is up … ",
    "url": "https://www.reuters.com/world/middle-east/israel-seeks-swift-action-iran-sources-say-with-split-us-administration-2025-06-21/"
  },
  {
    "text": "American Democracy Might Not Survive a War With Iran  —  The United States is well down the road to dictatorship.  Imagine what Trump would do with a state of war.  —  The current debate over bombing Iran is surreal.  To begin with, bombardment is unlikely to lead to a satisfactory outcome.",
    "url": "https://www.theatlantic.com/international/archive/2025/06/democracy-iran-israel-war-trump/683269/?gift=5aUYI8dJ_4U5JTdJqsIAqwzbXk7nlcFLPaxDqLj0C5E"
  },
  {
    "text": "B-2 bombers moving to Guam amid Middle East tensions, US officials say  —  The United States is moving B-2 bombers to the Pacific island of Guam, two U.S. officials told Reuters on Saturday, as President Donald Trump weighs whether the United States should take part in Israel's strikes against Iran.",
    "url": "https://www.reuters.com/business/aerospace-defense/b-2-bombers-moving-guam-amid-middle-east-tensions-us-officials-say-2025-06-21/"
  },
  {
    "text": "B-2 stealth bombers appear to be on the move hours before Trump expected at White House  —  America's unique bunker-buster bombs could target Iran's heavily fortified nuclear facility  —  Six B-2 stealth bombers from Whiteman Air Force Base in Missouri appear to be en route to a U.S. Air Force base in Guam … ",
    "url": "https://www.foxnews.com/world/b-2-stealth-bombers-appear-move-hours-before-trump-expected-white-house"
  },
  {
    "text": "U.S. strikes Iran's nuclear facilities  —  The U.S. military conducted air strikes on Iran's nuclear facilities in Fordow, Natanz and Isfahan on Sunday morning local time, President Trump announced on Truth Social.  —  Why it matters: Trump's decision to intervene directly in support … ",
    "url": "https://www.axios.com/2025/06/21/us-strike-iran-nuclear-israel-trump"
  },
  {
    "text": "Diplomatic breakthrough elusive as Israel-Iran war stretches into second week  —  President Donald Trump said Saturday that the U.S. military struck three sites in Iran, directly joining Israel 's effort to decapitate the country's nuclear program in a risky gambit to weaken … ",
    "url": "https://apnews.com/article/israel-iran-war-nuclear-talks-geneva-news-06-21-2025-a7b0cdaba28b5817467ccf712d214579"
  },
  {
    "text": "Trump and GOP's tax bill would sell off USPS's brand-new EVs  —  Postal Service officials told lawmakers the proposal would cause “substantial harm” to “our customers, your constituents.”  —  A little-noticed provision of President Donald Trump and Republicans' massive tax and immigration legislation … ",
    "url": "https://www.washingtonpost.com/business/2025/06/21/trump-usps-trucks-taxes/"
  },
  {
    "text": "A White Nationalist Wrote a Law School Paper Promoting Racist Views.  It Won Him an Award.  —  The University of Florida student won an academic honor after he argued in a paper that the Constitution applies only to white people.  From there, the situation spiraled.",
    "url": "https://www.nytimes.com/2025/06/21/us/white-supremacist-university-of-florida-paper.html?unlocked_article_code=1.Qk8.Zdse.9h3KhkfNOqv2&smid=url-share"
  },
  {
    "text": "Abandoned by Trump, a farmer and a migrant search for a better future  —  For this story, John Woodrow Cox interviewed more than 40 farmers across the country.  He and photographer Matt McClain reported from Colorado while Sarah Blaskey talked to more than two dozen employees … ",
    "url": "https://www.washingtonpost.com/investigations/interactive/2025/trump-farmers-grants-freeze-usda-migrants"
  },
  {
    "text": "New insight into Texas family detention reveals adults fighting kids for clean water  —  Adults fighting kids for clean water, despondent toddlers and a child with swollen feet denied a medical exam — these first-hand accounts from immigrant families at detention centers included in a motion filed … ",
    "url": "https://apnews.com/article/migrants-child-supervision-texas-e4994b2b6786717ea79a4be230e476bf"
  },
  {
    "text": "New Texas law will require Ten Commandments to be posted in every public school classroom  —  Texas will require all public school classrooms to display the Ten Commandments under a new law that will make the state the nation's largest to attempt to impose such a mandate.",
    "url": "https://apnews.com/article/texas-ten-commandments-law-3f1ea84acd67a028ad9b7c01c3c2368c"
  },
  {
    "text": "Harvard hired a researcher to uncover its ties to slavery.  He says the results cost him his job: ‘We found too many slaves’  —  When the extent of the university's involvement with slavery was unearthed, a scholar tracking descendants of enslaved workers was suddenly fired",
    "url": "https://www.theguardian.com/news/2025/jun/21/harvard-slavery-decendants-of-the-enslaved"
  },
  {
    "text": "Health care workers on alert for ICE raids in hospitals  —  President Trump's whittling away of protected places for immigrants has fueled fears among health care workers that Immigration and Customs Enforcement (ICE) agents will arrest patients in or around hospitals.",
    "url": "https://thehill.com/policy/healthcare/5360046-trump-immigration-raid-hospitals/"
  },
  {
    "text": "Administration to phase out NIH support of HIV clinical guidelines  —  Doctors and advocates worry the move is a first step toward ending federal guidance for HIV treatment.  —  The National Institutes of Health's support for federal guidelines that steer the treatment of more than a million HIV patients … ",
    "url": "https://www.washingtonpost.com/science/2025/06/21/hiv-aids-rfk-guidelines-nih/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzUwNDc4NDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzUxODYwNzk5LCJpYXQiOjE3NTA0Nzg0MDAsImp0aSI6IjNhMjA5ZGQ5LWJjOGEtNDIwYS1hODAzLWYyZWE1ZWJmZTc4NyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9zY2llbmNlLzIwMjUvMDYvMjEvaGl2LWFpZHMtcmZrLWd1aWRlbGluZXMtbmloLyJ9.lDiPGD1eiH4kzdhegonY6TbI1wUQ-c4iXRYlDHjFNuI&itid=gfta"
  },
  {
    "text": "Armstrong declares disaster for tornado damage, extends sympathy to victims' families  —  BISMARCK, N.D. (KFYR) - Gov. Kelly Armstrong today declared a statewide disaster and activated the State Emergency Operations Plan after multiple tornadoes, strong winds and hail caused widespread damage … ",
    "url": "https://www.kfyrtv.com/2025/06/21/armstrong-declares-disaster-tornado-damage-extends-sympathy-victims-families/"
  }
]