[
  {
    "text": "Trump crowd goes silent as he confuses Biden and Obama again  —  'Putin has so little respect for Obama that he's starting to throw around the nuclear word,' Trump says  —  The crowd of Trump supporters gathered in Richmond, Virginia to hear Donald Trump speak on Saturday night went silent … ",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/donald-trump-biden-obama-b2506194.html"
  },
  {
    "text": "Biden says Trump wouldn't concede next time: “Losers are never graceful” … “Trump had not just tried to steal the presidency — he had tried to steal it from him,” Osnos writes.  —  During the interview, Biden tossed a white note card on the Resolute Desk.",
    "url": "https://www.axios.com/2024/03/04/biden-trump-2024-election-concede"
  },
  {
    "text": "Nikki Haley wins the District of Columbia's Republican primary and gets her first 2024 victory  —  Fresh off her first GOP primary win in Washington, DC, Nikki Haley heads into Super Tuesday hoping for new momentum.  But with Donald Trump favored to win all upcoming contests … ",
    "url": "https://apnews.com/article/nikki-haley-republicans-donald-trump-dc-primary-7b5eec7a5398379b0f1c9ed9f50b6ce3"
  },
  {
    "text": "Haley wins DC GOP primary  —  Nikki Haley will win the Washington, D.C., Republican presidential primary, netting her first victory of the GOP nominating process, Decision Desk HQ projects.  —  Haley garnered 1,274 votes to former President Trump's 676 with all precincts reporting, according to DDHQ.",
    "url": "https://thehill.com/homenews/campaign/4503364-haley-takes-the-victory-in-dc-gop-primary/"
  },
  {
    "text": "A Supreme Court decision could come Monday in a case about barring Trump from the 2024 ballot  —  A Supreme Court decision could come as soon as Monday in the case about whether former President Donald Trump can be kicked off the ballot over his efforts to undo his defeat in the 2020 election.",
    "url": "https://apnews.com/article/supreme-court-trump-capitol-riot-colorado-maine-d784759ab9376d4c3a6e3ae72465f448"
  },
  {
    "text": "Supreme Court to post a decision Monday, possibly on Trump ballot access  —  The outcome of Donald Trump's challenge to a Colorado ruling barring him from the ballot is highly anticipated ahead of Super Tuesday  —  The Supreme Court is set to announce at least one opinion Monday morning … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/03/trump-colorado-ballot-supreme-court-decision/"
  },
  {
    "text": "Trump's White House Was ‘Awash in Speed’ — and Xanax  —  Under Trump, the White House Medical Unit was “like the Wild West,” and staffers had easy access to powerful stimulants and sedatives, sources tell Rolling Stone  —  IF YOU EVER looked at the actions of the Trump White House and wondered, ‘Are they on drugs?’",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-white-house-drugs-speed-xanax-1234979503/"
  },
  {
    "text": "Trump supporters target black voters with faked AI images  —  Donald Trump supporters have been creating and sharing AI-generated fake images of black voters to encourage African Americans to vote Republican.  —  BBC Panorama discovered dozens of deepfakes portraying black people as supporting the former president.",
    "url": "https://www.bbc.com/news/world-us-canada-68440150"
  },
  {
    "text": "Mitch McConnell is the arsonist who set America on fire and ran away  —  The lyrics to Kenny Rogers' “The Gambler” are branded onto my brain.  In the summer of 1979, I was a 20-year-old so eager to break into journalism I took a job at a tiny paper in Peoria, Ill., and lived there with my grandparents.",
    "url": "https://www.inquirer.com/opinion/commentary/mitch-mcconnell-destroyed-america-runs-away-20240303.html"
  },
  {
    "text": "Ex-Trump Org.  CFO to plead guilty to perjury charges  —  The former chief financial officer of the Trump Organization is expected to plead guilty to perjury charges on Monday related to testimony he gave in a civil investigation into the real estate company's finances, a person familiar with the investigation said.",
    "url": "https://www.cnn.com/2024/03/04/politics/allen-weisselberg-trump-org-cfo-plea-perjury/"
  },
  {
    "text": "Kamala Harris says there must be an ‘immediate ceasefire’ in Gaza  —  Vice president says pause in fighting ‘for at least six weeks’ needed to save hostages, ensure aid for besieged civilians  —  Kamala Harris demands ‘immediate ceasefire’ in Gaza: ‘The condition is inhumane’",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/kamala-harris-ceasefire-gaza-b2506271.html"
  },
  {
    "text": "‘Five-alarm fire’: Trump's latest public schools threat causes experts to panic  —  Donald Trump said something about public schools that got no media coverage, yet it's causing political analysts, ex-prosecutors, and other onlookers to sound the alarm.  —  Trump began hinting last year that … ",
    "url": "https://www.rawstory.com/trump-public-school-threat-vaccines/"
  },
  {
    "text": "The apocalypse we choose  —  In four months as Speaker of the House, Mike Johnson has given Russia a chance to win its war in Ukraine, and thereby turn the world towards tyranny.  —  Subscribe now  —  Johnson's term of office consists of stratagems to avoid funding Ukraine.",
    "url": "https://snyder.substack.com/p/the-apocalypse-we-choose"
  },
  {
    "text": "Kari Lake Switches Her Abortion Stance Ahead of Arizona Senate Contest  —  ‘ANYTHING TO GET ELECTED’  —  Kari Lake has appeared to soften her stance on abortion on Saturday, walking back past praise for aggressive restrictions in a move that reflected how much of a poisoned arrow the issue has become for the Republican Party.",
    "url": "https://www.thedailybeast.com/kari-lake-switches-up-abortion-stance-ahead-of-arizona-senate-contest"
  },
  {
    "text": "How the media failed Nex Benedict  —  On February 21, 2024, the Owasso Police Department issued a statement on Nex Benedict, the non-binary Oklahoma high school student who was assaulted in a school bathroom and died the following day.  It included this passage on the cause of Nex's death:",
    "url": "https://popular.info/p/how-the-media-failed-nex-benedict"
  },
  {
    "text": "AG Garland pledges to fight voter ID laws, election integrity measures  —  Garland appeared in Selma, Alabama Sunday alongside Vice President to mark the 59th anniversary of Blood Sunday  —  Attorney General Merrick Garland appeared alongside Vice President Kamala Harris in Selma … ",
    "url": "https://www.foxnews.com/politics/ag-garland-pledges-fight-voter-id-laws-election-integrity-measures"
  }
]