[
  {
    "text": "Ron DeSantis Is Afraid of Questions From a 15-Year-Old  —  The Florida governor's operation went to extraordinary lengths to intimidate a high school sophomore—all for a question about Donald Trump. … Quinn Mitchell has seen at least 35 presidential candidates in person since 2019 … ",
    "url": "https://www.thedailybeast.com/republican-president-candidate-ron-desantis-is-afraid-of-questions-from-15-year-old-quinn-mitchell"
  },
  {
    "text": "Nevada's primary debacle has some GOP campaigns threatening to write-off the state  —  A pro-Ron DeSantis super PAC has already ended door-knocking there.  Now, another campaign says it may write off the state, accusing Trump of trying to “rig” the primary.",
    "url": "https://www.nbcnews.com/politics/2024-election/nevadas-primary-caucus-debacle-gop-campaigns-rcna102883"
  },
  {
    "text": "How Trump's loyal pen pals spread his message … They're meant to keep him informed — but perhaps just as important, to boost his spirits.  — Trump, signature black Sharpie in hand, often scrawls responses on them and has his aides text a photo of the comments back to the writers.",
    "url": "https://www.axios.com/2023/09/01/trump-loyal-network-pen-pals-notes"
  },
  {
    "text": "Proud Boy convicted of helping spearhead Capitol attack ties Jan. 6 sentence record with 18 years  —  A one-time leader in the Proud Boys far-right extremist group has been sentenced to 18 years in prison for his role in the Jan. 6 riot at the U.S. Capitol, tying the record for the longest sentence in the attack.",
    "url": "https://apnews.com/article/capitol-riot-jan-6-proud-boys-prison-sentence-58173200af1664716cbaec8ed2c2a145"
  },
  {
    "text": "DeSantis will not meet with Biden in Florida on Saturday  —  “The security preparations alone that would go into setting up such a meeting would shut down ongoing recovery efforts,” said a spokesperson for the governor.  —  Ron DeSantis will not meet Joe Biden on Saturday when the president comes … ",
    "url": "https://www.politico.com/news/2023/09/01/desantis-biden-hurricane-idalia-00113815"
  },
  {
    "text": "Biden says he'll meet DeSantis on Florida trip, DeSantis' spokesman suggests not  —  U.S. President Joe Biden will travel to Florida on Saturday to survey damage from this week's Hurricane Idalia, but a visit with the state's Republican governor, Ron DeSantis, is not scheduled, despite the president's assertion that they would meet.",
    "url": "https://www.reuters.com/world/us/biden-says-hell-meet-desantis-florida-trip-desantis-spokesman-suggests-not-2023-09-01/"
  },
  {
    "text": "It seems like everyone has Covid-19.  Here's why this wave is probably worse than official data suggests  —  Covid-19 certainly didn't take a vacation this summer.  Virus levels in the US have been on the rise for weeks, but it's hard to know exactly how widely it's spreading.",
    "url": "https://www.cnn.com/2023/09/01/health/covid-case-data-wave/"
  },
  {
    "text": "Exclusive — McCarthy on Possible Impeachment Inquiry: Would Be House Vote  —  House Speaker Kevin McCarthy made clear to Breitbart News on Friday that if House Republicans move forward with an impeachment inquiry into Democrat President Joe Biden, the move would come not as an announcement … ",
    "url": "https://www.breitbart.com/politics/2023/09/01/mccarthy-details-impeachment-inquiry-process-if-we-move-forward-would-occur-vote-house-floor/amp/"
  },
  {
    "text": "The sleeper legal fight that could define 2024: Is Trump even eligible to run?  —  Some scholars say Trump is disqualified under the 14th Amendment's insurrection clause.  Here's how the courts might wade in.  —  If Donald Trump wants to be on the ballot next year in all 50 states … ",
    "url": "https://www.politico.com/news/2023/09/01/fourteenth-amendment-insurrection-clause-trump-00113790"
  },
  {
    "text": "For All Rudy's Troubles, There's Much More Still There  —  THE BACKCHANNEL  —  Where to start?  Dan Friedman and David Corn have a piece up this morning at Mother Jones detailing a whistleblower complaint from an FBI agent, Johnathan Buma, who says he was stopped from investigating whether Giuliani was … ",
    "url": "https://talkingpointsmemo.com/edblog/for-all-rudys-troubles-theres-much-more-still-there"
  },
  {
    "text": "Canadian churches burned over bodies that weren't buried in the yard  —  Oh, the headlines two years ago were horrific - HORRIFIC.  —  It was every racist, oppressive, creepy boarding school nightmare scenario come to life, and just one more baseball bat to the reputation of a colonizing, supremacist Roman Catholic Church.",
    "url": "https://hotair.com/tree-hugging-sister/2023/09/01/canadian-churches-burned-over-bodies-that-werent-buried-in-the-yard-n575218"
  },
  {
    "text": "Feds Accuse Former Marine of Spreading Bogus Purple Heart Tale  —  Paul John “P.J.” Herbert also bilked the government of $344,040 in disability benefits for injuries he never sustained, prosecutors said.  —  A Marine Corps veteran who falsely claimed to have been the sole survivor … ",
    "url": "https://www.thedailybeast.com/feds-accuse-ex-marine-paul-john-herbert-of-bogus-purple-heart-tale"
  },
  {
    "text": "Kentucky's governor won't commit to appointing Republican if McConnell resigns  —  After Senate Minority Leader Mitch McConnell (R-Ky.) experienced his second freezing episode in five weeks, Kentucky Gov. Andy Beshear (D) is declining to say whether he would follow a state law requiring … ",
    "url": "https://www.washingtonpost.com/politics/2023/09/01/kentucky-governor-beshear-mcconnell/"
  },
  {
    "text": "West Virginia Poll: Justice has edge in Senate race; Moore Capito out ahead in race for governor  —  In the race for U.S. Senate, Gov. Jim Justice has a strong advantage over Congressman Alex Mooney in the Republican primary and an edge over incumbent Joe Manchin in a possible General Election matchup.",
    "url": "https://wvmetronews.com/2023/09/01/west-virginia-poll-justice-has-edge-in-senate-race-moore-capito-out-ahead-in-race-for-governor/"
  },
  {
    "text": "Angela Paxton's Ties to a Shell Company … MODE:  —  In July 2022, Texas Attorney General Ken Paxton and his wife, state Senator Angela Paxton, took a mysterious multi-country trip to European destinations in Italy, Greece, Malta, and Albania with a protective detail from the Texas Department of Public Safety tagging along.",
    "url": "https://www.texasobserver.org/angela-ken-paxton-frinzi-multiband/"
  },
  {
    "text": "Mitch McConnell May Be Experiencing Small Seizures, Doctors Suggest  —  Two episodes, where the Republican senator froze and did not respond to some questions, may be symptoms of a serious illness, according to neurologists not involved in his medical care.  —  A four-line letter … ",
    "url": "https://www.nytimes.com/2023/09/01/health/mitch-mcconnell-health-seizures.html"
  }
]