[
  {
    "text": "Obama tells allies Biden needs to seriously consider his viability  —  The former president, hugely influential in the party, has told associates that Biden's path to victory has significantly shrunk.  —  Former president Barack Obama has told allies in recent days that President Biden's path … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/18/obama-says-biden-must-consider-viability/"
  },
  {
    "text": "Behind the Curtain: Top Dems now believe Biden will exit … - The president is being told that if he stays in, former President Trump could win in a landslide and wipe away Biden's legacy and Democrats' hopes in November. … - Democrats fully expect polls after the Republican National Convention … ",
    "url": "https://www.axios.com/2024/07/18/president-biden-drop-out-election-democrats"
  },
  {
    "text": "People Close to Biden Say He Appears to Accept He May Have to Leave the Race  —  One person familiar with President Biden's thinking cautioned that he had not yet made up his mind to leave the race, after three weeks of insisting that almost nothing would drive him out.",
    "url": "https://www.nytimes.com/2024/07/18/us/politics/biden-election-drop-out.html"
  },
  {
    "text": "Once defiant, Biden is now ‘soul searching’ about dropping out of race, source says  —  U.S. President Joe Biden is taking calls to step aside as the Democratic presidential candidate seriously and multiple Democratic officials think an exit is a matter of time, according to sources familiar with the matter.",
    "url": "https://www.reuters.com/world/us/once-defiant-biden-is-now-soul-searching-about-dropping-out-race-source-says-2024-07-18/"
  },
  {
    "text": "'We're close to the end': Biden world braces for the possibility that the president steps aside  —  As Trump is about to give a major speech accepting the GOP nomination for president, Biden is off the campaign trail with COVID.  —  WASHINGTON — President Joe Biden's political world is collapsing.",
    "url": "https://www.nbcnews.com/politics/2024-election/biden-world-braces-possibility-president-steps-rcna162494"
  },
  {
    "text": "Pelosi has told House Democrats that Biden may soon be persuaded to exit race  —  The former House speaker has stepped up her behind-the-scenes role in working to persuade the president to bow out of campaign  —  Former House speaker Nancy Pelosi has told some House Democrats … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/18/nancy-pelosi-biden-close-to-dropping-out/"
  },
  {
    "text": "Sen. Jon Tester calls on Biden to drop 2024 presidential bid … - “While I appreciate his commitment to public service and our country, I believe President Biden should not seek re-election to another term,” Tester said in a statement Thursday.  — Tester is facing re-election in deep-red Montana … ",
    "url": "https://www.axios.com/2024/07/19/jon-tester-montana-senate-biden-president-2024"
  },
  {
    "text": "DNC's mad dash to finalize virtual voting plan for Biden nomination … - The goal is to use their convention week to talk up their candidate and tear apart former President Trump.  —  Behind the nasty public debate on whether Biden should be nominated early, there are private conversations … ",
    "url": "https://www.axios.com/2024/07/18/dnc-biden-presidential-nomination-virtual-vote"
  },
  {
    "text": "Jamie Raskin, a Key Democrat, Urged Biden to Reconsider Campaign  —  Mr. Raskin, a congressman from Maryland, was a key member of the panel that investigated the Capitol riot.  In a lengthy letter, he compared President Biden to a tiring baseball pitcher.  —  Representative Jamie Raskin of Maryland … ",
    "url": "https://www.nytimes.com/2024/07/18/us/politics/jamie-raskin-biden-letter.html"
  },
  {
    "text": "Biden allies retaliated against a Dem who called for him to step aside  —  The decision to remove battleground Democratic Rep. Hillary Scholten from a coordinated campaign was reversed after POLITICO contacted the Biden campaign.  —  Democrats in Michigan cut off a vulnerable House Democrat … ",
    "url": "https://www.politico.com/news/2024/07/18/biden-allies-retaliate-hillary-scholten-00169387"
  },
  {
    "text": "J.D. Vance Left His Venmo Public.  Here's What It Shows  —  The Republican VP nominee's Venmo network reveals connections ranging from the architects of Project 2025 to enemies of Donald Trump—and the populist's close ties to the very elites he rails against.",
    "url": "https://www.wired.com/story/jd-vance-venmo/"
  },
  {
    "text": "What Secret Service and FBI told Congress about attempted Trump assassination … - FBI and Secret Service officials briefed House lawmakers on Wednesday on their preliminary findings.  — The Secret Service said they identified the building used in the assassination attempt as … ",
    "url": "https://www.axios.com/2024/07/18/secret-service-fbi-trump-assassination-attempt"
  },
  {
    "text": "Hunter Biden cites Trump ruling in seeking dismissal of gun and tax cases … Lawyers for Hunter Biden on Thursday asked federal judges in California and Delaware to dismiss the criminal tax and gun cases against him in their courts, citing a recent opinion by Supreme Court Justice Clarence Thomas … ",
    "url": "https://www.cnbc.com/2024/07/18/hunter-biden-seeks-gun-case-dismissal-cites-trump-classified-documents-ruling.html"
  },
  {
    "text": "‘Treated like a convict’: NFL legend Terrell Davis describes getting handcuffed on a plane near his kids after asking for ice  —  Terrell Davis and his family were looking forward to vacationing in California when pro football Hall of Famer was handcuffed and removed from a United Airlines plane - for no apparent reason.",
    "url": "https://www.cnn.com/2024/07/17/us/terrell-davis-united-flight-attendant/"
  },
  {
    "text": "America will never be the same after Milwaukee's tent revival for the cult of Donald Trump  —  MILWAUKEE — I came to the American Heartland to cover a political convention, but all I found was a tent revival, Brother Trump's Traveling Salvation Show.The Republican National Convention took … ",
    "url": "https://www.inquirer.com/opinion/milwaukee-rnc-cult-donald-trump-20240718.html"
  },
  {
    "text": "Investigators now believe account on gaming site in would-be assassin's name is fake  —  Investigators now believe that the Steam account in the name of the man who shot at former President Donald Trump over the weekend is fake, a US official briefed on the matter told CNN.",
    "url": "https://www.cnn.com/2024/07/18/politics/thomas-matthew-crooks-steam/"
  },
  {
    "text": "MAGA Enters Racist Meltdown Mode Over J.D. Vance's Wife … The past week has seen an outpouring of hate from the far right over the wife of Republican vice presidential nominee J.D. Vance.  The unremarkable fact that Vance is married to Usha Vance, a woman of Indian heritage, has become a fixation for white nationalists online.",
    "url": "https://newrepublic.com/post/183975/maga-racist-meltdown-jd-vance-wife-usha"
  },
  {
    "text": "Brutal: ‘The Boys’ Season Finale Violently Kills a Shocking Character  —  SPOILER ALERT!  —  As is its wont, the gruesome “The Boys” season finale let loose a geyser of fake blood.  But the fate of one young, progressive character is particularly shocking.  —  (Warning: Spoilers for The Boys season finale.)",
    "url": "https://www.thedailybeast.com/obsessed/the-boys-finale-a-violent-act-against-alexandria-ocasio-cortez-stand-in"
  },
  {
    "text": "Anti-party in a ghost town: Trump's undead GOP holds an un-convention  —  Donald Trump's Republican Party has no history, no principles and no ideology — because it's just a front  —  MILWAUKEE — I don't know whether the folks who tried to sell “vegan barbecue” from a booth in the strip … ",
    "url": "https://www.salon.com/2024/07/18/anti-party-in-a-ghost-town-soulless-holds-an-un-convention/"
  },
  {
    "text": "A rash of tech billionaires are pivoting to Trump — but not because they're MAGA bros  —  A version of this story appeared in CNN Business' Nightcap newsletter.  To get it in your inbox, sign up for free, here.  —  New York CNN  —  The Bay Area has long been, and remains … ",
    "url": "https://www.cnn.com/2024/07/18/business/silicon-valley-tech-billionaires-trump/"
  },
  {
    "text": "Housing provider for unaccompanied migrant children engaged in sexual abuse and harassment, DOJ says  —  The largest housing provider for unaccompanied migrant children has engaged in the “severe, pervasive, and unwelcome” sexual abuse and harassment of children in its care, the Justice Department alleged Thursday.",
    "url": "https://apnews.com/article/migrant-children-provider-lawsuit-0bfd45735aa6d41a4233abe6059f0e1f"
  }
]