[
  {
    "text": "Courting the Kook Vote in Iowa, Vivek Draws the Ire of Trump  —  Ramaswamy is fourth in the polls, but top-of-mind for the former president.  —  ANKENY, Iowa—Vivek Ramaswamy was just going through his implausible plan for firing 75 percent of the federal workforce—\"the first four agencies we're … ",
    "url": "https://thedispatch.com/article/courting-the-kook-vote-in-iowa-vivek-draws-the-ire-of-trump/"
  },
  {
    "text": "Iowa Pandering Has Been Scarce in This Unusual Republican Primary  —  Presidential candidates often enmesh themselves in the state's politics to woo voters, but the nature of this race means much less focus on local issues.  —  Campaigning in Iowa in the months leading up to the caucuses … ",
    "url": "https://www.nytimes.com/2024/01/15/us/politics/iowa-caucus-state-politics.html"
  },
  {
    "text": "Playbook: Iowa enters the spin zone  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  HISTORY LESSON, PART 1 — “Martin Luther King Jr. Was a Radical,” by Sheryll Cashin for POLITICO Magazine: “The civil rights icon's image has been sanitized to Kumbaya, feel-good platitudes.",
    "url": "https://www.politico.com/newsletters/playbook/2024/01/15/iowa-enters-the-spin-zone-00135582"
  },
  {
    "text": "Vivek Ramaswamy Crosses Trump Just in Time for Iowa Caucus  —  Trump and his team finally recognized the grandest conspiracy of all: If you were trying to steal votes directly from Trump, you'd run a campaign like Ramaswamy.  —  URBANDALE, Iowa—Before talking to a crowd of Iowa retirees … ",
    "url": "https://www.thedailybeast.com/vivek-ramaswamy-crosses-trump-just-in-time-for-iowa-caucus"
  },
  {
    "text": "DeSantis says Trump taking Iowa ‘for granted,’ brushes off Rubio  —  Ron DeSantis on Monday slammed former President Trump for taking Iowa “for granted,” while brushing off Sen. Marco Rubio (R-Fla.)'s endorsement of the former president shortly ahead of the Hawkeye State's caucuses.",
    "url": "https://thehill.com/homenews/campaign/4409739-desantis-says-trump-taking-iowa-for-granted-bushes-off-rubio/"
  },
  {
    "text": "Former Trump Aide Scaramucci Says He Will Campaign for Biden Against Trump in 2024  —  ‘This really is going to be a battle for the democracy,’ the ex-Trump official told CNN ahead of the Iowa caucus  —  Former Donald Trump White House official Anthony Scaramucci will be campaigning … ",
    "url": "https://themessenger.com/politics/anthony-scaramucci-campaigning-for-biden-2024"
  },
  {
    "text": "Key Trump Lawyer Withdraws as Manhattan Criminal Trial Nears  —  Joseph Tacopina brought extensive experience with high-profile cases to former president Donald J. Trump's legal team.  —  Joseph Tacopina, the trial lawyer on Donald J. Trump's legal team with the most successes defending high-profile clients … ",
    "url": "https://www.nytimes.com/2024/01/15/us/politics/tacopina-trump-lawyer.html"
  },
  {
    "text": "Trump lawyer Joe Tacopina withdraws from ex-president's cases  —  Joe Tacopina, one of former President Trump's New York trial lawyers who is known for representing high-profile clients, is withdrawing from Trump's cases.  —  Tacopina had represented Trump in both his criminal hush money case … ",
    "url": "https://thehill.com/regulation/court-battles/4409344-trump-lawyer-joe-tacopina-withdraws-from-ex-presidents-cases/"
  },
  {
    "text": "Nikki Haley Refuses to Say a Man Cannot Become a Woman During Campaign Event  —  The Iowa Caucus is just hours away and social issues seem to be top of mind for at least some voters in the Hawkeye State.  —  Extreme weather conditions in Iowa limited the 2024 GOP hopefuls to mostly virtual events … ",
    "url": "https://www.megynkelly.com/2024/01/15/nikki-haley-can-a-man-become-a-woman-iowa/"
  },
  {
    "text": "A person called 911 falsely reporting a fire at the White House in apparent ‘swatting’ event  —  President Joe Biden was at Camp David when the call to 911 was made early Monday morning.  —  WASHINGTON — A person called 911 Monday morning falsely claiming that there was a fire at the White House and that someone was trapped inside.",
    "url": "https://www.nbcnews.com/politics/white-house/person-called-911-falsely-reporting-fire-white-house-apparent-swatting-rcna133964"
  },
  {
    "text": "Iran's Guards attack ‘espionage centers’ in Iraq's Erbil - state media  —  Iran's Revolutionary Guards said they attacked espionage centers and “gatherings of anti-Iranian terrorist groups” near Iraq's northern city of Erbil with ballistic missiles, Iranian state media said late on Monday.",
    "url": "https://www.reuters.com/world/middle-east/irans-revolutionary-guards-say-they-have-attacked-espionage-centers-iraqs-erbil-2024-01-15/"
  },
  {
    "text": "Explosions reported near US Consulate in Iraq; Iran claims responsibility  —  Iran's Revolutionary Guard claimed it was targeting “the headquarters of spies.”  —  This is a breaking news story please check back for updates.  —  Several explosions were reported near the U.S. Consulate in Erbil … ",
    "url": "https://abcnews.go.com/International/explosions-reported-us-consulate-iraq-iran-claims-responsibility/story?id=106390671"
  },
  {
    "text": "Why The World Is Betting Against American Democracy  —  Ambassadors to Washington warn that the GOP-Democratic divide is endangering America's national security.  —  Foreign diplomats are aghast that so many U.S. leaders let their zeal for partisan politics prevent the basic functions of government.",
    "url": "https://www.politico.com/news/magazine/2024/01/15/what-foreign-diplomats-say-about-u-s-politics-behind-closed-doors-00135326"
  },
  {
    "text": "Secretary of Defense Lloyd J. Austin III Released From Hospital  —  Following consultation with medical staff, Secretary Austin was released from Walter Reed National Military Medical Center today.  —  The Secretary continues to recover well and, on the advice of doctors … ",
    "url": "https://www.defense.gov/News/Releases/Release/Article/3645144/secretary-of-defense-lloyd-j-austin-iii-released-from-hospital/"
  },
  {
    "text": "How the Iowa caucuses work  —  Here's how the first Republican presidential nominating contest of 2024 will work on the ground Monday night.  —  On Monday evening, Iowa Republicans will head to schools and community centers to participate in their first-in-the-nation caucuses … ",
    "url": "https://www.nbcnews.com/politics/2024-election/iowa-caucuses-explained-2024-elections-rcna133550"
  },
  {
    "text": "Nota Bene  —  Keep an eye on how the national press covers this.  The White House, as you know, has been under immense pressure to offer concessions to address the continuing large number of migrants coming to the US-Mexico border.  Now there's a bipartisan compromise bill in the Senate.",
    "url": "https://talkingpointsmemo.com/edblog/nota-bene-7"
  },
  {
    "text": "Views of MAGA movement correspond to Iowa caucus support, poll finds  —  Asked to describe how “MAGA” they are, 60% of Trump's supporters call themselves “Ultra” or “Regular” MAGA, while 50% of Haley backers are anti-MAGA.  —  Views of former President Donald Trump's “Make America Great Again” … ",
    "url": "https://www.nbcnews.com/meet-the-press/meetthepressblog/views-maga-movement-correspond-iowa-caucus-support-poll-finds-rcna133878"
  },
  {
    "text": "‘Huge Economic Damage’: Anti-Semitic Activists Arrested Over Plot To Shut Down London Stock Exchange  —  Six members of a notorious anti-Semitic activist group were arrested in the United Kingdom after plotting to inflict “significant disruption to Israel's weapons trade” by shutting down the London Stock Exchange.",
    "url": "https://freebeacon.com/israel/huge-economic-damage-anti-semitic-activists-arrested-over-plot-to-shut-down-london-stock-exchange/"
  }
]