[
  {
    "text": "Jim Jordan to force floor vote for House speaker on Tuesday after consolidating Republican support - as it happened  —  This live blog has now closed.  Read our latest US politics stories here:  —  Key events  —  Closing summary  —  Biden and Harris condemn murder of six-year-old Palestinian in Illinois",
    "url": "https://www.theguardian.com/us-news/live/2023/oct/16/trump-gag-order-jan-6-trial-biden-israel-politics-live-updates"
  },
  {
    "text": "Jim Jordan skeptics begin lining up behind his House speaker bid  —  Rep. Jim Jordan (R-Ohio) is shoring up support from detractors for his bid for House speaker as he prepares to go to the floor for a vote on Tuesday. … - “Jim Jordan and I have had two cordial, thoughtful … ",
    "url": "https://www.axios.com/2023/10/16/jim-jordan-house-speaker-endorsements"
  },
  {
    "text": "Vulnerable Republicans face a moment of reckoning with Jim Jordan speaker vote  —  A former GOP congressman from a swing district warns a Jordan speakership would “be enormously problematic for the Republicans in those districts that Joe Biden won.”  —  WASHINGTON — Centrist … ",
    "url": "https://www.nbcnews.com/politics/congress/centrist-republicans-face-reckoning-jim-jordan-speaker-vote-rcna120607"
  },
  {
    "text": "Jordan builds Speakership momentum as opposition falls  —  Opposition to House GOP Speaker nominee Rep. Jim Jordan (Ohio) is crumbling as Republicans return to Washington for a House vote to try to officially elect him.  —  Four key lawmakers who signaled opposition to Jordan last week fell … ",
    "url": "https://thehill.com/homenews/house/4258693-jordan-speakership-momentum-opposition-falls/"
  },
  {
    "text": "Trump placed under limited gag order in federal election case in D.C.  —  No ‘carte blanche’ for a candidate who is also a defendant, the judge said at a hearing  —  A federal judge issued a limited gag order Monday against Donald Trump, saying the former president must stop disparaging prosecutors … ",
    "url": "https://www.washingtonpost.com/national-security/2023/10/16/trump-gag-order-chutkan/"
  },
  {
    "text": "Live updates Judge to hear argument over Trump gag order in Jan. 6 case  —  Special counsel Jack Smith's office is in federal court in D.C. today asking for a gag order that would bar former president Donald Trump from maligning the judge, prosecutors, witnesses and potential jurors in his election obstruction case.",
    "url": "https://www.washingtonpost.com/national-security/2023/10/16/trump-court-hearing-judge-gag-order-jan-6/"
  },
  {
    "text": "Biden campaign to launch account on Trump's Truth Social  —  'There's very little ‘truth’ happening on Truth Social, but at least now it'll be a little fun,' Biden campaign tells Fox News Digital  —  EXCLUSIVE: The Biden campaign is launching an account on former President Trump's Truth Social, Fox News Digital has learned.",
    "url": "https://www.foxnews.com/politics/biden-campaign-launch-account-trumps-truth-social"
  },
  {
    "text": "PLAINFIELD TOWNSHIP HOMICIDE UPDATE  —  On 10/14/2023 at approximately 11:38 AM, deputies with the Will County Sheriff's Office were sent to a residence located near the 16200 block of S. Lincoln Highway in Unincorporated Plainfield Township regarding a stabbing that occurred involving a landlord and renter.",
    "url": "https://www.facebook.com/WillCountySheriff/posts/pfbid0KUUoQZaZb6KPoVG3EUy3sdoENpoyb7rk9FDV7GFJ9iZ3FUPDapMj3gMnhvrCMiRGl"
  },
  {
    "text": "21 species removed from endangered list due to extinction, U.S. wildlife officials say  —  Nearly two dozen species are being taken off the endangered species list because they are extinct, the U.S. Fish and Wildlife Service said Monday.  —  Most of the species were listed under … ",
    "url": "https://www.cbsnews.com/news/21-species-removed-from-endangered-list-due-to-extinction-us-wildlife-officials-say/"
  },
  {
    "text": "Federal government declares 21 species extinct  —  The U.S. Fish and Wildlife Service (FWS) declared 21 species extinct Monday, including 10 birds and two freshwater fish.  —  The species, which the agency removed from the list of those protected under the Endangered Species Act (ESA) … ",
    "url": "https://thehill.com/policy/energy-environment/4258766-21-species-extinct-birds-freshwater-fish/"
  },
  {
    "text": "Huntsman family, longtime Penn supporters, will halt donations to ‘unrecognizable’ University  —  This story is developing and will continue to be updated.  —  1987 College graduate Jon Huntsman Jr. told Penn President Liz Magill that his family will stop donating to Penn … ",
    "url": "https://www.thedp.com/article/2023/10/penn-jon-huntsman-jr-wharton-halts-donations-magill"
  },
  {
    "text": "Scott's super PAC cancels TV ad reservations as campaign sputters  —  The super PAC supporting Tim Scott's presidential campaign said Monday it will cancel “all of our Fall media inventory.”  —  The super PAC supporting Tim Scott's presidential bid is canceling most of its remaining TV spending … ",
    "url": "https://www.politico.com/news/2023/10/16/scott-super-pac-cancels-tv-ad-reservations-00121745"
  },
  {
    "text": "Trump, under fire for Israel comments, proposes fresh crackdown on Muslim immigrants  —  The Republican polling leader responded to backlash for calling Hezbollah ‘very smart’ by reviving a proposal for screening immigrants by ideology  —  CLIVE, Iowa — Former president Donald Trump … ",
    "url": "https://www.washingtonpost.com/politics/2023/10/16/trump-muslim-immigrants-crackdown/"
  },
  {
    "text": "Is crime going up in America?  Some types are, new FBI data shows  —  (NEXSTAR) - A massive data dump of 11 million criminal offenses reported to the FBI paints a complicated picture of crime in the United States.  The data, released Monday, shows that while violent crime dropped nationwide in 2022, property crime jumped.",
    "url": "https://thehill.com/homenews/nexstar_media_wire/4258799-is-crime-going-up-in-america-some-types-are-new-fbi-data-shows/"
  },
  {
    "text": "U.S. Picks Troops to Prepare for Potential Deployment to Middle East  —  The U.S. military has selected roughly 2,000 troops to prepare for a potential deployment to support Israel, U.S. defense officials said.  The troops are tasked with missions like advising and medical support … ",
    "url": "https://www.wsj.com/livecoverage/israel-hamas-war-gaza-palestinians/card/u-s-picks-troops-to-prepare-for-potential-deployment-to-middle-east-0pYNLxiZ7dmUbN6NxCML?mod=followamazon"
  },
  {
    "text": "Iran says Hamas ready to release hostages if Israel stops airstrikes as at least 199 now known taken  —  Iran tried to pressure Israel into ending its revenge airstrikes on Gaza by claiming Monday that the Hamas terrorists long sponsored by Tehran would be willing to free the 199 hostages … ",
    "url": "https://nypost.com/2023/10/16/iran-says-hamas-will-free-hostages-if-air-strikes-end/"
  },
  {
    "text": "Justice Department Seeking Stronger Prison Sentences for Proud Boys Members  —  DOJ filed notice it wants the U.S. Court of Appeals in D.C., to help impose longer sentences for Enrique Tarrio, Joseph Biggs, Zachary Rehl, Dominic Pezzola and Ethan Nordean",
    "url": "https://themessenger.com/politics/proud-boys-prison-sentences-justice-department-appeal-tarrio-biggs-jan6"
  },
  {
    "text": "George Santos' campaign loses $16,500 in three months  —  Rep. George Santos' (R-N.Y.) campaign saw a net loss of more than $16,500 in campaign contribution between July and September, according to Federal Election Commission filings. … - At the same time, his campaign spent $42,000 … ",
    "url": "https://www.axios.com/2023/10/15/george-santos-campaign-16500-net-loss-three-months"
  },
  {
    "text": "Former Navajo Nation president challenges Arizona Republican who ousted McCarthy  —  Former Navajo Nation President Jonathan Nez is challenging Republican Rep. Eli Crane for his seat in Arizona's 2nd Congressional District.  —  Nez, in his announcement on X, the website formerly known as Twitter … ",
    "url": "https://thehill.com/homenews/campaign/4258625-ex-navajo-nation-president-challenges-arizona-republican-who-ousted-mccarthy/"
  },
  {
    "text": "Marjorie Taylor Greene and the lingering belief that truth is partisan  —  Paul Hodgkins was one of the first people to plead guilty to charges stemming from the riot at the Capitol on Jan. 6, 2021.  Hodgkins made it to the floor of the Senate, where he was photographed next to the “QAnon Shaman” and others.",
    "url": "https://www.washingtonpost.com/politics/2023/10/16/greene-jan6-election/"
  }
]