[
  {
    "text": "Trump Has Reached the Mountaintop  —  Big day for Mike Johnson, whose job and reputation are on the line, to say nothing of his role as dedicated MAGA selfie background guy.  The speaker told reporters this morning he feels confident he can retain his gavel, and do so on the first ballot.",
    "url": "https://www.thebulwark.com/p/trump-has-reached-the-mountaintop"
  },
  {
    "text": "House GOP tensions erupt ahead of speaker vote … - Johnson is struggling to secure the support he needs to retain his gavel, with Rep. Thomas Massie (R-Ky.) digging in in opposition and claiming to reporters several of his colleagues will join him in voting no.",
    "url": "https://www.axios.com/2025/01/03/mike-johnson-republican-tensions-speaker-election"
  },
  {
    "text": "Will Matt Gaetz Try to Participate in the House Speaker Vote?  —  The Florida Republican, who resigned his House seat during his short-lived bid for attorney general, has publicly flirted with the idea of showing up in Congress on Friday.  —  As Speaker Mike Johnson labors to lock … ",
    "url": "https://www.nytimes.com/2025/01/03/us/politics/matt-gaetz-house-speaker-vote-congress.html"
  },
  {
    "text": "Mike Johnson on track to fall short in first vote for House speaker  —  Mike Johnson appears likely to fall short of the needed votes Friday in a first vote for House speaker.  With a roll call ongoing, several fellow Republicans have already voted against the Louisiana lawmaker in a chamber … ",
    "url": "https://www.washingtonpost.com/politics/2025/01/03/house-speaker-vote-live-updates/"
  },
  {
    "text": "Nippon Steel Corporation and U. S. Steel Condemn U.S. Government's Unlawful Decision to Block Proposed Acquisition of U. S. Steel  —  Companies will take all appropriate action to protect their legal rights  —  Nippon Steel Corporation (\"Nippon Steel\") (TSE: 5401) and United States Steel Corporation … ",
    "url": "https://investors.ussteel.com/news-events/news-releases/detail/708/nippon-steel-corporation-and-u-s-steel-condemn-u-s"
  },
  {
    "text": "Order Regarding the Proposed Acquisition of United States Steel Corporation by Nippon Steel Corporation  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, including section 721 of the Defense Production Act of 1950, as amended … ",
    "url": "https://www.whitehouse.gov/briefing-room/presidential-actions/2025/01/03/order-regarding-the-proposed-acquisition-of-united-states-steel-corporation-by-nippon-steel-corporation/"
  },
  {
    "text": "Meta's AI Profiles Are Indistinguishable From Terrible Spam That Took Over Facebook  —  Earlier this week, Meta executive Connor Hayes told the Financial Times that the company is going to roll out AI character profiles on Instagram and Facebook that “exist on our platforms … ",
    "url": "https://www.404media.co/metas-ai-profiles-are-indistinguishable-from-terrible-spam-that-took-over-facebook/"
  },
  {
    "text": "Alabama mom hit by truck, then shot in Bourbon Street attack: 'It's just so disturbing'  —  A night of revelry was coming to a close for Alexis Scott-Windham and her friends in the early hours of New Year's Eve after they came from Mobile, Alabama to ring in the new year on Bourbon Street.",
    "url": "https://www.nola.com/news/crime_police/alabama-mom-is-hit-by-truck-then-shot-in-new-orleans-attack/article_f985df4e-c965-11ef-8ec3-a3bc378dd1ae.html"
  },
  {
    "text": "Fox News keeps linking the New Orleans truck attack to border security despite no apparent link  —  The network featured future Trump officials who emphasized border security, even when they noted the suspect was American … - On January 1, a truck rammed into a New Year's celebration along Bourbon Street … ",
    "url": "https://www.mediamatters.org/fox-news/fox-news-keeps-linking-new-orleans-truck-attack-border-security-despite-no-apparent-link"
  },
  {
    "text": "John Thune Takes Charge in the Senate, Ushering in a New Leadership Era  —  The affable traditional conservative from South Dakota is the first new chief of the Senate G.O.P. in nearly two decades.  He will confront a challenge managing President-elect Donald J. Trump's expectations.",
    "url": "https://www.nytimes.com/2025/01/03/us/politics/john-thune-senate-leadership.html"
  },
  {
    "text": "Rudy Giuliani, Slow to Transfer Assets to Election Workers, Could Be Held in Contempt  —  The former mayor of New York City could be held in contempt of court after failing to fully comply with orders to surrender millions of dollars in assets to election workers he defamed.",
    "url": "https://www.nytimes.com/2025/01/03/nyregion/rudy-giuliani-assets-court-contempt.html?unlocked_article_code=1.mU4.VaBZ.Gww2Us27hTRI&smid=bs-share"
  },
  {
    "text": "You're In Woke Hands With Allstate  —  Remember when insurance companies tried very, very hard to be boring?  Recall the days when all we wanted to hear from insurers was, “Your claim will be paid right now?”  —  Instead, these days insurance companies act more like comedy clubs than financial underwriters.",
    "url": "https://hotair.com/ed-morrissey/2025/01/03/with-allstate-youre-in-woke-hands-n3798444"
  },
  {
    "text": "I Want Your Attention.  I Need Your Attention.  Here Is How I Mastered My Own.  —  I try to hold people's attention for a living.  For more than 13 years, I've been hosting a cable news show, and when I'm not doing that, I spend a lot of time alternating between reading the internet … ",
    "url": "https://www.nytimes.com/2025/01/03/opinion/chris-hayes-msnbc-attention.html"
  },
  {
    "text": "UK Right Warns Trump Allies That Musk's Posts Have Gone Too Far  — Billionaire calls for release of far-right activist Robinson  — Reform leader Nigel Farage has distanced himself from Robinson  —  Senior politicians on the UK right have privately contacted Donald Trump's allies … ",
    "url": "https://www.bloomberg.com/news/articles/2025-01-03/uk-right-warns-trump-allies-that-musk-s-posts-have-gone-too-far"
  },
  {
    "text": "Yoon's team claims immunity from insurrection charges, citing Trump ruling  —  The legal team of suspended President Yoon Suk Yeol claimed Friday that Yoon's impeachment trial does not warrant a ruling as he should have immunity from prosecution, citing the U.S. Supreme Court's ruling on Donald Trump.",
    "url": "https://m-en.yna.co.kr/view/AEN20250103011400320"
  },
  {
    "text": "Near midnight, Ohio Gov. DeWine signs bill into law to charge public for police video  —  COLUMBUS, Ohio — Ohio Gov. Mike DeWine has signed a controversial bill into law that could charge the public hundreds of dollars for footage from law enforcement agencies, including body cameras.",
    "url": "https://www.news5cleveland.com/news/politics/ohio-politics/near-midnight-ohio-gov-dewine-signs-bill-into-law-to-charge-public-for-police-video"
  },
  {
    "text": "FBI releases new video of a suspect planting a pipe bomb near DNC offices on eve of the Capitol riot  —  A harrowing chapter in American history remains shrouded in mystery: Who planted pipe bombs outside offices of the Democratic and Republican national committees in Washington on the eve of the attack on the Capitol?",
    "url": "https://apnews.com/article/capitol-riot-pipe-bombs-fbi-washington-ea85b6fe5fe9140f1c75b7ee8c0554b2"
  },
  {
    "text": "Surgeon General Calls for Cancer Warnings on Alcohol  —  Dr. Vivek Murthy's report cites studies linking alcoholic beverages to at least seven malignancies, including breast cancer.  But to add warning labels, Congress would have to act.  —  Alcohol is a leading preventable cause of cancer … ",
    "url": "https://www.nytimes.com/2025/01/03/health/alcohol-surgeon-general-warning.html"
  },
  {
    "text": "Liz Cheney Should Be Criminally Investigated For Her Corruption, Not Rewarded  —  The House Administration Subcommittee on Oversight has recommended that Liz Cheney face a criminal probe for ‘witness tampering.’  —  President Joe Biden rewarded disgraced ex-Wyoming Congresswoman Liz Cheney … ",
    "url": "https://thefederalist.com/2025/01/03/liz-cheney-should-be-criminally-investigated-for-her-corruption-not-rewarded/"
  }
]