[
  {
    "text": "Trump Ordered to Pay $355 Million and Barred From New York Business  —  The ruling in Donald J. Trump's civil fraud case could cost him all his available cash.  The judge said that the former president's “complete lack of contrition” bordered on pathological.",
    "url": "https://www.nytimes.com/2024/02/16/nyregion/trump-civil-fraud-trial-ruling.html"
  },
  {
    "text": "Trump Privately Expresses Support for a 16-Week Abortion Ban  —  In supporting a 16-week ban with exceptions, Donald Trump appears to be trying to satisfy social conservatives who want to further restrict abortion access and voters who want more modest limits.",
    "url": "https://www.nytimes.com/2024/02/16/us/politics/trump-abortion-ban.html"
  },
  {
    "text": "Trump is suddenly in need of a lot of cash.  That's everyone's problem.  —  The former president was just ordered to pay $355 million in his New York fraud case, bringing the tally this year to nearly half a billion dollars in civil damages.  —  Two recent verdicts have now left Donald Trump … ",
    "url": "https://www.vox.com/24073920/trump-financial-new-york-trouble-fraud-e-jean-carroll-civil-suit-damages-debt"
  },
  {
    "text": "Donald Trump ordered to pay over $350m in New York financial fraud case  —  Trump also banned from running any New York corporation or entity for three years in devastating blow for ex-president  —  Donald Trump, his eldest sons and associates have been ordered to pay over $350m by a New York judge … ",
    "url": "https://www.theguardian.com/us-news/2024/feb/16/donald-trump-financial-fraud-case"
  },
  {
    "text": "Judge: Trump Org defendants' ‘complete’ lack of contrition ‘borders on pathological’  —  A New York judge called out former President Trump and other Trump Organization executives Friday for their lack of remorse in a civil fraud case over the company's business dealings.",
    "url": "https://thehill.com/regulation/court-battles/4473251-engoron-trump-org-defendants-lack-of-contrition-pathological/"
  },
  {
    "text": "Trump campaign scrambles over abortion ban report as Democrats seize the moment  —  The Trump campaign said it was “fake news” that he supports a 16-week abortion ban, as Democrats were quick to hit him on it.  —  WASHINGTON — President Joe Biden's campaign and abortion rights advocates ripped … ",
    "url": "https://www.nbcnews.com/politics/2024-election/trump-campaign-scrambles-abortion-ban-report-democrats-16-weeks-rcna139223"
  },
  {
    "text": "U.S. outrage at Navalny's death turns into a rallying cry  —  From Washington to Munich, the world reacted to news of Navalny's death at a precarious time for transatlantic relations.  —  The shock waves of Alexei Navalny's death rippled across the Atlantic.",
    "url": "https://www.politico.com/news/2024/02/16/kamala-harris-russia-navalny-00141888"
  },
  {
    "text": "Russian opposition leader Alexei Navalny dies in prison  —  Navalny, 47, a prominent critic of President Vladimir Putin, spent his final years behind bars as the Russian leader reshaped the country to rally behind his war in Ukraine.  —  Russian opposition leader Alexei Navalny has died in prison … ",
    "url": "https://www.nbcnews.com/news/world/russian-opposition-leader-alexei-navalny-dies-prison-rcna79718"
  },
  {
    "text": "The majority of traffic from Elon Musk's X may have been fake during the Super Bowl, report suggests  —  These numbers are legitimately shocking. … Also riding high from the big game?  Elon Musk's X. The company formerly known as Twitter published its own press release … ",
    "url": "https://mashable.com/article/x-twitter-elon-musk-bots-fake-traffic"
  },
  {
    "text": "Witness Told Feds She Was Paid for Sex Parties With Matt Gaetz  —  The Ethics Committee is investigating Gaetz—and has text messages between the congressman and a woman who claims she had sex with Gaetz at parties she was paid to attend. … When ABC News reported on Wednesday … ",
    "url": "https://www.thedailybeast.com/witness-told-feds-she-was-paid-for-sex-parties-with-matt-gaetz"
  },
  {
    "text": "James Comer Faces Potential Investigation Over Lying FBI Source  —  Republican Representative James Comer is facing calls for an investigation of his efforts to impeach President Joe Biden after a key witness in the probe was charged with lying to the FBI.  —  Special counsel David Weiss … ",
    "url": "https://www.newsweek.com/james-comer-faces-potential-investigation-over-lying-fbi-source-1870518"
  },
  {
    "text": "I've reported on the health of every president since Reagan.  Here's what I think about Trump and Biden  —  When I interviewed Ronald Reagan about his health in 1980, he was 69 and poised to become the oldest person to be elected president.  During our conversation, Reagan was mentally sharp.",
    "url": "https://www.statnews.com/2024/02/16/trump-biden-dementia-cognitive-health-lawrence-altman-presidential-history/"
  },
  {
    "text": "A chaotic US House is losing three Republican committee chairs to retirement in the span of a week  —  In a single week, the Republican chairs of three House committees announced they would not be seeking reelection, raising questions about whether the chaos that has reigned this Congress is driving out some of the GOP's top talent.",
    "url": "https://apnews.com/article/congress-retirements-republican-chairs-1fa6864ba5ea80eb8dad88ddcc59cac8"
  },
  {
    "text": "Students lose out as cities and states give billions in property tax breaks to businesses − draining school budgets and especially hurting the poorest students  —  Built in 1910, James Elementary is a three-story brick school in Kansas City, Missouri's historic Northeast neighborhood … ",
    "url": "https://theconversation.com/students-lose-out-as-cities-and-states-give-billions-in-property-tax-breaks-to-businesses-draining-school-budgets-and-especially-hurting-the-poorest-students-222940"
  },
  {
    "text": "Foxx Subpoenas Harvard  —  WASHINGTON - Today, Education and the Workforce Committee Chairwoman Virginia Foxx (R-NC) issued the following statement regarding serving subpoenas to Harvard Corporation Senior Fellow Penny Pritzker, Interim President Dr. Alan Garber, and Harvard Management Company's … ",
    "url": "https://edworkforce.house.gov/news/documentsingle.aspx?DocumentID=410149"
  },
  {
    "text": "Simon Rosenberg on Trump the electoral albatross  —  “You can dye his hair, paint his face, strap a girdle and a diaper on him and pump him full of speed, and he's still not going to look like a presidential candidate.”  —  ∙ Paid … Tom Suozzi's victory in NY-03 was a big win for Democrats.",
    "url": "https://www.publicnotice.co/p/simon-rosenberg-interview-trump-biden-polling"
  }
]