[
  {
    "text": "Ukraine Aid Bill Clears Critical Hurdle in the House as Democrats Supply the Votes  —  Democrats stepped in to support bringing the aid package to the floor, in a remarkable breach of custom on a key vote that paved the way for its passage.  —  The House took a critical step on Friday toward approving … ",
    "url": "https://www.nytimes.com/2024/04/19/us/politics/congress-vote-ukraine-bill-house.html"
  },
  {
    "text": "A New Foreign Policy Era Dawns  —  We have a jury.  The 12 men and women who will decide whether Donald Trump illegally falsified business records to cover up payments to porn performer Stormy Daniels—payments which in turn were intended to cover up their alleged affair ahead of the 2016 election … ",
    "url": "https://www.thebulwark.com/p/a-new-foreign-policy-era-dawns"
  },
  {
    "text": "Third Republican joins motion to remove Mike Johnson … - Gosar cited the passage of the foreign aid bill, which includes aid to Ukraine that right-wing hardliners staunchly oppose, as well as Republicans' recent difficulty in passing border legislation.  — “We need a Speaker who puts America … ",
    "url": "https://www.axios.com/2024/04/19/gosar-joins-motion-to-vacate-mike-johnson"
  },
  {
    "text": "House advances Ukraine, Israel aid as Dems help Speaker Johnson, GOP  —  The House advanced legislation Friday to send aid to Ukraine and other embattled U.S. allies overseas, clearing a key procedural hurdle after Democrats stepped in to back the measure — a rare move by the minority party … ",
    "url": "https://thehill.com/homenews/house/4604948-house-advances-ukraine-israel-aid-as-dems-help-speaker-johnson-gop/"
  },
  {
    "text": "Israel strikes Iran with a missile, U.S. officials say, as Tehran downplays Netanyahu's apparent retaliation  —  Two U.S. officials told CBS News on Thursday night that an Israeli missile had struck Iran.  The strike came just less than a week after Iran's unprecedented retaliatory drone … ",
    "url": "https://www.cbsnews.com/news/israel-iran-missile-strikes/"
  },
  {
    "text": "Israeli missiles have hit a site in Iran  —  A U.S. official confirmed to ABC News Israeli missiles have hit a site in Iran.  The official could not confirm whether Syria and Iraq sites were hit as well.",
    "url": "https://abcnews.go.com/International/live-updates/israel-gaza-hamas-war/israeli-missiles-have-hit-a-site-in-iran-109405880?id=108860743&cid=social_twitter_abcn"
  },
  {
    "text": "Iran fires at apparent Israeli attack drones near Isfahan air base and nuclear site  —  Iran has fired air defenses at a major air base and a nuclear site near its central city of Isfahan after spotting drones.  The commotion early Friday raised fears of a possible Israeli retaliatory strike … ",
    "url": "https://apnews.com/article/iran-israel-mideast-tensions-4-19-2024-a7ccbae2e2844bab089e8e4377a24ddb"
  },
  {
    "text": "Emergency rooms refused to treat pregnant women, leaving one to miscarry in a lobby restroom  —  One woman miscarried in the restroom lobby of a Texas emergency room as front desk staff refused to admit her.  Another woman learned that her fetus had no heartbeat at a Florida hospital … ",
    "url": "https://apnews.com/article/pregnancy-emergency-care-abortion-supreme-court-roe-9ce6c87c8fc653c840654de1ae5f7a1c"
  },
  {
    "text": "Statement from Columbia University President Minouche Shafik  —  To the Columbia University community:  —  This morning, I had to make a decision that I hoped would never be necessary.  I have always said that the safety of our community was my top priority and that we needed to preserve … ",
    "url": "https://president.columbia.edu/news/statement-columbia-university-president-minouche-shafik-4-18"
  },
  {
    "text": "Columbia University is colluding with the far-right in its attack on students  —  In her willingness to unleash state violence against student protestors, Minouche Shafik proved herself to be a willing ally to extremists  —  The students sat on the ground and sang as police in riot gear approached them.",
    "url": "https://www.theguardian.com/commentisfree/2024/apr/19/far-right-columbia-university-student-arrests"
  },
  {
    "text": "Trump turns his legal woes into a campaign fundraising machine  —  The prospect of having his assets seized led to the former president's biggest online fundraising day last quarter.  —  Former President Donald Trump has long used the legal cases against him to drive money to his campaign.",
    "url": "https://www.politico.com/news/2024/04/19/trump-trial-campaign-fundraising-00153185"
  },
  {
    "text": "Matt Gaetz attended 2017 party where minor and drugs were present, woman's sworn statement obtained by Congress claims  —  The Ethics panel is questioning witnesses about allegations involving Gaetz.  —  Rep. Matt Gaetz walks past reporters as he leaves a House GOP caucus meeting at the U.S Capitol … ",
    "url": "https://abcnews.go.com/US/matt-gaetz-attended-2017-party-minor-drugs-present/story?id=109324572"
  },
  {
    "text": "Trump's covid response was even worse than you remember  —  In a sane country, it would disqualify him from ever again holding office. … As we approach the four-year anniversary of Donald Trump suggesting from the White House podium that bleach injections could be a miracle covid cure … ",
    "url": "https://www.publicnotice.co/p/trump-covid-response-revisited"
  },
  {
    "text": "R.F.K. Jr.'s Environmental Colleagues Urge Him to Drop Presidential Bid  —  Nearly 50 leaders and activists who worked with Mr. Kennedy at an environmental nonprofit group will run ads calling on him to “Honor our planet, drop out.”  —  As an independent candidate for the White House … ",
    "url": "https://www.nytimes.com/2024/04/19/climate/rfk-jr-environment.html"
  },
  {
    "text": "Tell the truth about Biden's economy  —  Exaggerating the harms of inflation doesn't help working people.  —  American workers' wages have been rising faster than prices for more than a year now.  Their nation's economy, meanwhile, is the envy of the wealthy world: Since the Covid recession … ",
    "url": "https://www.vox.com/24134257/biden-economy-inflation-wages-interest-rate"
  },
  {
    "text": "Louisiana lawmakers vote to remove lunch breaks for child workers, cut unemployment benefits  —  A House committee approved the bill along with others to reduce unemployment benefits and workers' compensation wages.  — 3 min to read  —  A Louisiana House committee voted Thursday to repeal … ",
    "url": "https://www.nola.com/news/politics/legislature/la-lawmakers-vote-to-remove-lunch-breaks-for-child-workers/article_ef234692-fd9e-11ee-99f5-771c7366107a.html"
  },
  {
    "text": "Vote.org planning its largest voter-registration campaign ever  —  Vote.org is launching its largest-ever voter registration campaign, aimed at adding 8 million voters for the 2024 cycle, the nonpartisan voter engagement organization announced on Friday.  —  “With near daily reporting … ",
    "url": "https://thehill.com/homenews/campaign/4605066-vote-org-planning-its-largest-voter-registration-campaign-ever/"
  }
]