[
  {
    "text": "Police treating vehicle explosion at Trump Las Vegas hotel as possible act of terror: Official  —  Police are also probing the Cybertruck incident as a possible criminal act.  —  General views of the Trump International Hotel Las Vegas on April 15, 2024 in Las Vegas, Nevada.",
    "url": "https://abcnews.go.com/Politics/police-investigating-vehicle-explosion-trump-hotel-las-vegas/story?id=117252987"
  },
  {
    "text": "Fireworks, gas tanks and camping fuel used in Tesla cybertruck explosion outside Las Vegas Trump Hotel  —  Authorities believe fireworks, gas tanks and camping fuel were connected to a detonation system controlled by the driver in the Tesla Cybertruck that exploded outside a Trump Hotel in Las Vegas Wednesday morning.",
    "url": "https://www.cnn.com/2025/01/01/us/cybertruck-fire-trump-hotel-las-vegas/"
  },
  {
    "text": "Firework mortars, gas cannisters stuffed inside Tesla that exploded outside Trump's Las Vegas hotel  —  Firework mortars and camp fuel canisters were found stuffed into the back of the Tesla Cybertruck that exploded outside President-elect Donald Trump's Las Vegas hotel early Wednesday … ",
    "url": "https://apnews.com/article/trump-hotel-vehicle-fire-las-vegas-ad4c171c7a6af64f08db93d9fdc2d749"
  },
  {
    "text": "1 Dead After a Cybertruck Explodes Outside the Trump Hotel in Las Vegas  —  At least seven people were injured, the authorities said.  The authorities said they believed it to be “an isolated incident” but have not ruled out a connection to the attack in New Orleans.",
    "url": "https://www.nytimes.com/2025/01/01/us/car-fire-trump-hotel-las-vegas.html"
  },
  {
    "text": "Tesla Cybertruck bursts into flames outside Trump hotel in Las Vegas, killing one  —  The Clark County Fire Department confirmed that it responded to a vehicle fire early Wednesday.  —  A Tesla Cybertruck burst into flames Wednesday morning just outside the entrance of Trump International Hotel … ",
    "url": "https://www.nbcnews.com/news/us-news/tesla-cybertruck-appears-burst-flames-trump-hotel-las-vegas-rcna185932"
  },
  {
    "text": "New Orleans attack suspect named, accused of killing at least 10, injuring dozens  —  The suspect accused of plowing a truck through a crowd on Bourbon Street early Wednesday morning has been identified by a law enforcement source as 42-year-old Shamsud Din Jabbar.",
    "url": "https://www.nola.com/news/crime_police/new-orleans-suspect-bourbon-street-attack/article_d90e3452-c85f-11ef-a68f-f30b3ad49828.html"
  },
  {
    "text": "Biden vows to keep public informed about investigation into ‘despicable’ New Orleans attack  —  “Our nation grieves with you,” the president said Wednesday after the deadly attack that killed at least 15.  “We're going to stand with you as you mourn and as you heal.”",
    "url": "https://www.nbcnews.com/politics/white-house/biden-new-orleans-attack-rcna185938"
  },
  {
    "text": "FBI Statement on the Attack in New Orleans  —  Today, at approximately 3:15 a.m. CST, an individual drove a pickup truck into a crowd of people on Bourbon Street in New Orleans, killing at least 10 and injuring dozens of others.  After hitting the crowd, he exited the vehicle and fired upon local law enforcement.",
    "url": "https://www.fbi.gov/news/press-releases/fbi-statement-on-the-attack-in-new-orleans"
  },
  {
    "text": "Trump Falsely Suggested New Orleans Suspect Was an Immigrant  —  The president-elect said on social media that he was right about fearing criminals on the other side of the border.  Officials later identified the suspect as a U.S.-born citizen and Army veteran.",
    "url": "https://www.nytimes.com/2025/01/01/us/politics/trump-new-orleans.html?unlocked_article_code=1.mE4.ofuV.W-VZBHgqNYIp&smid=url-share"
  },
  {
    "text": "The attack was the deadliest in the U.S. in more than a year.  —  Officials postponed the Sugar Bowl and said they were hunting for possible connections between the suspect, who rammed into New Year's revelers, and terrorist organizations.  —  TRANSCRIPT  —  Back  —  Deadly New Year's Day Attack in New Orleans",
    "url": "https://www.nytimes.com/live/2025/01/01/us/new-orleans-vehicle-crash?unlocked_article_code=1.l04.NOtM.UNls5FGSFORo&smid=bs-share"
  },
  {
    "text": "Inside terrorist Shamsud-Din Jabbar's squalid home where sheep and goats roam his yard — after his financial ruin  —  HOUSTON — The terrorist who killed 15 people when he plowed his truck down crowded Bourbon Street in New Orleans was an American-born military veteran who was living in a run … ",
    "url": "https://nypost.com/2025/01/01/us-news/inside-shamsud-din-jabbar-jabbars-squalid-home-where-sheep-and-goats-roam/"
  },
  {
    "text": "Trump to hold DC rally day before inauguration  —  President-elect Trump will hold a rally in Washington the day before he is set to be inaugurated for a second term.  —  The president-elect will hold what is being dubbed a “victory rally” at Capital One Arena on Jan. 19 … ",
    "url": "https://thehill.com/homenews/campaign/5062614-trump-washington-rally-inaguration/"
  },
  {
    "text": "Johnson protected, diversity office scrapped in new House rules … - Instead of any single House Republican being able to force such a vote, now the motion will have to have eight additional GOP co-sponsors.  — The change is the result of a deal struck between House Republican factions … ",
    "url": "https://www.axios.com/2025/01/01/house-republican-rules-diversity-motion-to-vacate"
  },
  {
    "text": "Enshittification Comes to Washington  —  My experiences with private-sector package delivery are, to put it mildly, not the best.  As I write this, I'm watching and fretting over a package that is supposed to be delivered to my apartment by FedEx, which only occasionally manages to locate … ",
    "url": "https://newrepublic.com/article/189701/trump-2025-enshittification-civil-service"
  },
  {
    "text": "“Largest” explosives cache “in FBI history” seized from farm, prosecutors say … - The 36-year-old Spafford allegedly used pictures of President Biden “for target practice,” prosecutors said in the memorandum of support, filed Monday in U.S. federal court in Norfolk, seeking to keep Spafford in detention.",
    "url": "https://www.axios.com/2025/01/02/homemade-bombs-virginia-fbi"
  },
  {
    "text": "Pornhub Is Now Blocked In Almost All of the U.S. South  —  Almost two years ago, Louisiana passed a law that started a wave that's since spread across the entire U.S. south, and has changed the way people there can access adult content.  As of today, Florida, Tennessee … ",
    "url": "https://www.404media.co/pornhub-is-now-blocked-in-almost-all-of-the-u-s-south/"
  }
]