[
  {
    "text": "“It appears to be a payoff”: Expert says Kushner's Saudi cash an “egregious” national security worry  —  Senate Finance Committee Chairman Ron Wyden is investigating Saudi support for Jared Kushner's private equity firm  —  Based on his prior experience and demonstrated abilities … ",
    "url": "https://www.salon.com/2024/06/12/it-appears-to-be-a-payoff-expert-says-kushners-saudi-cash-an-egregious-national-security-worry/"
  },
  {
    "text": "Mike Johnson Weaponizes Government in Fight Against Biden  —  House Speaker Mike Johnson has a tendency to think that when things go bad for his party, it's the product of gross legislative mismanagement, judicial weaponization, and a vast executive conspiracy.",
    "url": "https://newrepublic.com/post/182638/mike-johnson-hypocritical-quest-merrick-garland-contempt"
  },
  {
    "text": "Hunter Biden Was Convicted.  His Dad's Reaction Was Remarkable.  —  The president's response is another stark reminder and important contrast with Donald Trump.  —  On one of the worst days of his life, President Joe Biden showed the best of who he is.  He affirmed his faith in his son … ",
    "url": "https://www.bloomberg.com/opinion/articles/2024-06-12/biden-shows-his-best-after-hunter-biden-gun-conviction"
  },
  {
    "text": "Trump Rants About Sharks, and Everyone Just Pretends It's Normal  —  Hours before meeting with his probation officer about his recent felony convictions, a leading candidate for U.S. president went on a bizarre rant about sharks.  —  Sharks, Donald Trump claimed, were attacking more frequently than usual … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/06/trump-shark-rant/678666/"
  },
  {
    "text": "Why the Southern Baptists' vote opposing IVF could change national politics  —  The move may signal the beginning of a broad turn on the right against IVF, an issue that many social conservatives see as the “pro-life” movement's next frontier.  —  INDIANAPOLIS — The Southern Baptist Convention … ",
    "url": "https://www.politico.com/news/2024/06/12/ivf-southern-baptist-convention-evangelical-00162994"
  },
  {
    "text": "Ohio Election Shock as Republican District Shifts 20 Points to Democrats  —  district in Ohio has shifted 20 points to the  —  .  —  Republican state Senator Michael Rulli defeated Democrat Michael Kripchak to win the election held in eastern Ohio's 6th District on Tuesday to fill … ",
    "url": "https://www.newsweek.com/ohio-special-election-congress-results-1911576"
  },
  {
    "text": "Transgender swimmer Lia Thomas loses legal challenge in CAS ruling  —  The Court of Arbitration for Sport (CAS) has dismissed a challenge from transgender swimmer Lia Thomas, who had asked the Swiss-based court to reject a policy that would prevent her from competing in women's races at elite competitions.",
    "url": "https://ca.sports.yahoo.com/news/transgender-swimmer-lia-thomas-loses-163220668.html"
  },
  {
    "text": "Senate Republicans block Democrats' Supreme Court ethics bill  —  The legislation would establish a code of conduct for the justices, as well as recusal rules and new requirements for disclosing gifts and travel.  Republicans blocked it from advancing.  —  WASHINGTON — Senate Republicans … ",
    "url": "https://www.nbcnews.com/politics/congress/senate-gop-blocks-democrats-supreme-court-ethics-bill-rcna156738"
  },
  {
    "text": "Oklahoma Supreme Court dismisses lawsuit of last Tulsa Race Massacre survivors seeking reparations  —  The Oklahoma Supreme Court on Wednesday dismissed a lawsuit by survivors of the 1921 Tulsa Race Massacre, dampening the hope of advocates for racial justice that the city would make financial amends … ",
    "url": "https://apnews.com/article/1921-race-massacre-tulsa-black-survivors-b7a4c83514ce79640a8490d49efb9006"
  },
  {
    "text": "Appeals court rejects DeSantis push for executive privilege  —  The state court refused to engage with the governor's arguments, which could have amounted to a significant expansion of his power.  —  TALLAHASSEE, Florida — A Florida appeals court on Wednesday refused to go along … ",
    "url": "https://www.politico.com/news/2024/06/12/court-rejects-desantis-executive-privilege-00163015"
  },
  {
    "text": "Eugene Young withdraws from US House race  —  Nearly one year after beginning his campaign, Eugene Young is stepping out of the race for Delaware's seat in the U.S. House.  —  The former Delaware State Housing Authority Director has suspended his campaign for the Democratic nomination.",
    "url": "https://www.wdel.com/news/eugene-young-withdraws-from-us-house-race/article_0aff1eac-28df-11ef-a66a-136e551ceb89.html"
  },
  {
    "text": "Congressional Baseball Game descends into chaos after protesters storm field  —  Eight people were arrested after storming the field at Nationals Park during the annual Congressional Baseball Game  —  Several arrests were made at the Congressional Baseball Game for Charity Wednesday night … ",
    "url": "https://www.foxnews.com/politics/congressional-baseball-game-descends-chaos-after-protesters-storm-field"
  },
  {
    "text": "Sen. John Fetterman ‘at fault’ for recent car accident, police report reveals  —  Riley Beggin Nick PenzenstadlerUSA TODAY  —  WASHINGTON - Sen. John Fetterman, D-Pa., was speeding and “at fault” for the car accident that landed him, his wife and another driver in the hospital on Sunday … ",
    "url": "https://www.usatoday.com/story/news/politics/2024/06/12/john-fetterman-car-accident-police-report/74073994007/"
  },
  {
    "text": "Abused by the badge  —  A Washington Post investigation found hundreds of law enforcement officers in the United States have sexually exploited kids.  Many avoid prison time.  —  They served in police departments big and small.  They were new recruits and seasoned veterans, patrol officers and chiefs of police.",
    "url": "https://www.washingtonpost.com/investigations/interactive/2024/police-officers-child-sexual-abuse-in-america/"
  },
  {
    "text": "What Happened to Hunter Biden's Plea Agreement  —  Because people who ignored the motion to dismiss proceedings have now decided to weigh in on what happened with Hunter Biden's failed plea agreement last year, I wanted to lay out what is actually known to have happened … ",
    "url": "https://www.emptywheel.net/2024/06/12/what-happened-to-hunter-bidens-plea-agreement/"
  },
  {
    "text": "Elon Musk sued by SpaceX engineers claiming they were illegally fired  —  Musk ordered firings after engineers raised concerns about alleged sexual harassment and discrimination, lawsuit says  —  SpaceX and its chief executive, Elon Musk, have been sued on Wednesday by eight engineers … ",
    "url": "https://www.theguardian.com/science/article/2024/jun/12/elon-musk-spacex-lawsuit"
  },
  {
    "text": "Hillary Clinton endorses George Latimer in challenge to unseat Jamaal Bowman  —  Nod from Democratic heavyweight comes as Bowman's reelection prospects look increasingly grim.  —  NEW YORK — Hillary Clinton helped deal another blow to vulnerable Rep. Jamaal Bowman on Wednesday … ",
    "url": "https://www.politico.com/news/2024/06/12/hillary-clinton-endorses-george-latimer-challenger-jamaal-bowman-00163037"
  },
  {
    "text": "Live Updates: Fed Keeps Rates Steady and Forecasts Only One Cut This Year  —  The Federal Reserve left interest rates unchanged on Wednesday and signaled one cut in 2024, with more to come in 2025.  Earlier, inflation data for May came in cooler than expected.  —  What to know about the Fed's decision.",
    "url": "https://www.nytimes.com/live/2024/06/12/business/fed-rates-inflation-cpi"
  },
  {
    "text": "Protesters expected to be moved away from park near GOP convention  —  The likely shift comes after months of debate among the Republican Party, the Secret Service and the city of Milwaukee on where to allow protests.  —  Protesters are no longer expected to be allowed in a large Milwaukee park near … ",
    "url": "https://www.washingtonpost.com/politics/2024/06/12/republican-convention-protests-milwaukee/"
  },
  {
    "text": "Neil Goldschmidt, Oregon former governor who sexually abused young girl, dies at 83  —  Neil Goldschmidt, the Oregon governor and Portland mayor credited with turning a frumpish city into a thriving metropolis only to see his record forever stained by revelations that he had sexually abused a young teen girl … ",
    "url": "https://www.oregonlive.com/politics/2024/06/neil-goldschmidt-former-governor-forever-tainted-by-scandal-dies.html"
  },
  {
    "text": "Alabama GOP chair used homemade ID to vote.  AG doesn't seem to care.  —  This is an opinion column.  —  Alabama Attorney General Steve Marshall has some thoughts on voter fraud and election integrity, and, under the right circumstances, he'll share them.",
    "url": "https://www.al.com/news/2024/06/alabama-gop-chair-used-homemade-id-to-vote-ag-doesnt-seem-to-care.html"
  },
  {
    "text": "Southern Baptist Convention narrowly rejects total ban on female pastors  —  The ban on women in a lesser pastoral roles won support of 61 percent of the convention but required a two-thirds vote.  —  The Southern Baptist Convention on Wednesday narrowly rejected a constitutional amendment barring women … ",
    "url": "https://www.washingtonpost.com/nation/2024/06/12/southern-baptists-ivf-women-pastors/"
  },
  {
    "text": "White House Takes a Tiny Bite From Giant Pile of Food Waste  —  The government will look at ways to extend the shelf life of foods and to create more composting and other facilities, as well as urge companies to donate more food.  —  The Biden administration has issued, for the first time … ",
    "url": "https://www.nytimes.com/2024/06/12/climate/white-house-food-waste-strategy.html"
  },
  {
    "text": "Hill GOP leaders eye new tax cuts if they can sweep in November  —  Speaker Mike Johnson told Senate Republicans on Wednesday that he wants to go big in a possible GOP-run Washington next year.  So far, a fresh round of tax cuts is at the top of his wish list.",
    "url": "https://www.politico.com/live-updates/2024/06/12/congress/hill-gop-leaders-scheme-tax-cuts-00162977"
  }
]