[
  {
    "text": "Kamala Harris mourns death of Palestinians in raid that rescued 4 Israeli hostages  —  An unknown number of Palestinian innocents were killed in Israel's rescue op  —  Vice President Harris mourned the Palestinians who were killed in a successful Israeli hostage rescue operation this weekend during an address delivered Saturday.",
    "url": "https://www.foxnews.com/politics/kamala-harris-mourns-death-palestinians-raid-rescued-4-israeli-hostages"
  },
  {
    "text": "One day after dramatic hostage rescue, Israeli War Cabinet minister Benny Gantz resigns  —  Militant-held Israeli hostages were among the more than 200 people killed in the raid that freed four captives and has been lauded as heroic in Israel but described as a massacre across much of the Middle East, Hamas officials said Sunday.",
    "url": "https://www.usatoday.com/story/news/world/israel-hamas/2024/06/09/israeli-war-updates-gaza-hamas/74035396007/"
  },
  {
    "text": "Benny Gantz Quits Israel's Emergency Government in Dispute Over Gaza  —  Gantz threatened to resign last month.  —  The Israeli politician Benny Gantz, a key member of the country's war cabinet, quit the government on Sunday over Prime Minister Benjamin Netanyahu's handling of the war in Gaza.",
    "url": "https://www.nytimes.com/live/2024/06/09/world/israel-gaza-war-hamas"
  },
  {
    "text": "Gaza's Health Ministry says 274 Palestinians were killed in Israeli raid that rescued 4 hostages  —  Police use water cannon to disperse protesters at anti-government rally in Tel Aviv  —  At least 274 Palestinians, including dozens of children, were killed, and hundreds more were wounded … ",
    "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-06-09-2024-61eb1be9a9d0cf2dbf250cd4a8ed4dbf"
  },
  {
    "text": "Trump and Biden neck and neck nationally and in battlegrounds — CBS News poll  —  Among all the factors on voters' minds this election, former President Donald Trump's guilty verdict pales in comparison to issues like the economy, inflation, and the border — all items on which Trump maintains advantages.",
    "url": "https://www.cbsnews.com/news/poll-trump-biden-neck-and-neck-06-09-2024/"
  },
  {
    "text": "When it comes to the law, Donald Trump believes the rules don't apply  —  The former president's criminal conviction and broadsides aimed at the legal system further demonstrate why he is unfit for any office, let alone the Oval Office.  —  By The Inquirer Editorial Board  —  Published Jun 9, 2024",
    "url": "https://www.inquirer.com/opinion/editorials/inq2/when-it-comes-law-donald-trump-believes-rules-dont-apply-editorial-20240609.html"
  },
  {
    "text": "Macron gambles on snap election to fight far-right surge  —  PARIS — European elections are meant to be worthy but boring exercises in centrist coalition building.  Not this time.  —  A surge in far-right populism in France provoked President Emmanuel Macron into calling a high-risk national election … ",
    "url": "https://www.politico.eu/article/eu-european-election-results-2024-emmanuel-macron-dissolve-parliament-france/"
  },
  {
    "text": "Europe swings to the right — led by France  —  Center-right and far-right parties are leading the way in the EU election.  —  Europe's center of political gravity is veering to the right.  —  Center-right and far-right parties are set to take the largest number of seats … ",
    "url": "https://www.politico.eu/article/eu-european-election-results-2024-swings-right-france/"
  },
  {
    "text": "EU elections 2024 live: Emmanuel Macron dissolves French parliament and calls snap election after huge far-right gains  —  Emmanuel Macron makes shock decision to call election for 30 June after National Rally makes huge gains in France  —  Turnout across EU at 51% Estimates for Portugal Estimate for Romania Estimate for Poland",
    "url": "https://www.theguardian.com/world/live/2024/jun/09/eu-europe-elections-2024-results-news-updates-live-latest"
  },
  {
    "text": "Trump tells rally-goers not to die in searing Vegas heat: 'I don't care about you, I just want your vote'  —  Remark get laughs at rally - but also draws raised eyebrows on social media as critics argue Trump was being truthful  —  Donald Trump is no stranger to accusations that he has little regard … ",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/trump-voters-heat-las-vegas-b2559547.html"
  },
  {
    "text": "Trump probation interview set for Monday after hush money conviction  —  The former president was convicted last month on 34 felony counts of falsifying business records in the hush money case against him.  —  Former President Trump is scheduled to sit for a virtual interview on Monday … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-probation-interview-monday-hush-money-conviction-rcna156219"
  },
  {
    "text": "Unaired footage shows chaos, anger of congressional leaders amid Jan. 6 evacuation  —  POLITICO reviewed the 45 minutes of video, shot by Nancy Pelosi's daughter Alexandra, that was recently obtained by House GOP investigators.  —  As then-Speaker Nancy Pelosi fled the Capitol after it was overrun … ",
    "url": "https://www.politico.com/news/2024/06/09/chaos-anger-congressional-leaders-jan-6-evacuation-00162424"
  },
  {
    "text": "Democratic-leaning doctors flex political muscle in abortion debate … - Their push coincides with the erosion of the historical alliance between Republicans and the American Medical Association, which has staked out progressive stances on topics including trans care and gun violence.",
    "url": "https://www.axios.com/2024/06/09/abortion-restrictions-democratic-doctors"
  },
  {
    "text": "The most important sentence you will read about the 2024 election  —  Messaging expert Anat Shenker-Osorio explains that victory in November depends on convincing low-information voters that the MAGA threat is real.  —  Donald Trump's greatest advantage is that he is treated like a clown.",
    "url": "https://i-know-how-much-you-care.ghost.io/the-most-important-sentence-you-will-read-about-the-2024-election/"
  }
]