[
  {
    "text": "Trump allies prepare to infuse ‘Christian nationalism’ in second administration  —  Spearheading the effort is Russell Vought, president of The Center for Renewing America, part of a conservative consortium preparing for Trump's return to power.  —  Russell Vought is president of The Center … ",
    "url": "https://www.politico.com/news/2024/02/20/donald-trump-allies-christian-nationalism-00142086"
  },
  {
    "text": "Trump's Final Hours in Office Were Consumed With Fury at Snoop Dogg  —  Trump's rage at Snoop Dogg created “chaos” in his administration's last moments — and nearly killed clemency for Harry-O … The source of the then-outgoing president's anger had nothing to do with his failed attempts … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trumps-snoop-dogg-pardon-final-hours-president-1234969914/"
  },
  {
    "text": "Why Nikki Haley isn't dropping out of the GOP presidential race  —  Nikki Haley's team is bracing for a home state embarrassment in South Carolina's Republican presidential primary on Saturday.  Conventional wisdom suggests she'll be forced to drop out.  But that may not apply in 2024.",
    "url": "https://apnews.com/article/nikki-haley-president-trump-interview-takeaways-b1eeeab91bd644d39ae575200592ceb2"
  },
  {
    "text": "Trump's RNC Takeover Is on the Brink of Becoming a ‘Purge’  —  From top to bottom, the national GOP organization could soon be rid of anyone seen as insufficiently MAGA.  —  First came the internal grumbling about Ronna McDaniel, the chairwoman of the Republican National Committee.",
    "url": "https://www.thedailybeast.com/trumps-rnc-takeover-is-on-the-brink-of-becoming-a-purge"
  },
  {
    "text": "Supreme Court won't review admissions at Va.'s Thomas Jefferson HS  —  The Supreme Court will not review a challenge to the admissions system for a prestigious Northern Virginia magnet school, the Thomas Jefferson High School for Science and Technology, which administrators said opened … ",
    "url": "https://www.washingtonpost.com/politics/2024/02/20/supreme-court-affirmative-action-thomas-jefferson-high-school/"
  },
  {
    "text": "Supreme Court won't review sanctions against pro-Trump lawyers who filed frivolous 2020 election suits  —  The Supreme Court on Tuesday declined to revisit sanctions levied against two pro-Trump attorneys who filed frivolous lawsuits challenging the outcome of the 2020 election in Michigan.",
    "url": "https://www.cnn.com/2024/02/20/politics/sidney-powell-lin-wood-supreme-court/"
  },
  {
    "text": "Supreme Court declines to undo sanctions on pro-Trump 2020 campaign lawyers  —  The Supreme Court on Tuesday declined to undo sanctions against several lawyers allied with former President Trump for filing a meritless lawsuit challenging Michigan's 2020 presidential election results.",
    "url": "https://thehill.com/regulation/court-battles/4478279-supreme-court-sanctions-pro-trump-2020-campaign-lawyers/"
  },
  {
    "text": "Russia adds Lindsey Graham to list of ‘terrorists’ after he pushes consequences for Navalny's death  —  The South Carolina Republican has publicly blamed Vladimir Putin for the Russian dissident's death.  —  Sen. Lindsey Graham has been added to Russia's list of “extremists and terrorists” … ",
    "url": "https://www.politico.com/news/2024/02/20/lindsey-graham-russia-terrorist-navalny-00142234"
  },
  {
    "text": "“That makes him a mark”: Experts warn Trump could get desperate as his fraud appeal appears doomed  —  Experts worry what Trump may do as he is “scrambling to pay his bills” after $400+ million in judgments  —  Former President Donald Trump faces long odds if he tries to appeal the $355 fraud ruling against him, legal experts say.",
    "url": "https://www.salon.com/2024/02/20/that-makes-him-a-mark-experts-warn-could-get-desperate-as-his-fraud-appeal-appears-doomed/"
  },
  {
    "text": "Judge threatens ex-Trump aide Navarro with contempt in records fight  —  Trump's former trade adviser has claimed the documents were personal, but a federal judge says at least some of them must be returned to the government.  —  A federal judge threatened Tuesday to hold former Trump White … ",
    "url": "https://www.politico.com/news/2024/02/20/judge-trump-navarro-legal-00142196"
  },
  {
    "text": "Kari Lake can't say who ‘stole’ her election, says criticism of McCain was meant as a joke  —  In a radio interview, Lake also said she wouldn't support a federal abortion ban and characterized Ukraine's war against Russia as a lost cause.  —  A defensive Kari Lake acknowledged … ",
    "url": "https://www.azcentral.com/story/news/politics/elections/2024/02/20/kari-lake-news-senate-candidate-talks-elections-ukraine-and-abortion/72665895007/"
  },
  {
    "text": "'You're both traitors': Speaker Johnson's thumbs-up photo-op with Trump doesn't go well  —  House Speaker Mike Johnson made his pilgrimage to Mar-a-Lago for a photo-op with former President Donald Trump — but when he took it X Monday, it didn't get the kind of reception he'd hoped.",
    "url": "https://www.rawstory.com/trump-johnson-2667318263/"
  },
  {
    "text": "Scoop: Mayorkas impeachment sparks new Senate GOP fight … - 13 Republicans, led by Sens. Mike Lee (Utah) and Ted Cruz (Texas), plan to send a letter to McConnell on Tuesday morning, demanding they “fully engage our Constitutional duty and hold a trial.”  — A Democratic effort to dismiss … ",
    "url": "https://www.axios.com/2024/02/20/mayorkas-impeachment-senate-gop-mcconnell-cruz-lee"
  },
  {
    "text": "Oops!  DeSantis says book challenges have gone too far  —  In an extraordinary press conference last week, Florida Governor Ron DeSantis (R) acknowledged that challenges to books in the state's school libraries are out of control.  Over the course of the event, DeSantis blamed teachers … ",
    "url": "https://popular.info/p/oops-desantis-says-book-challenges"
  },
  {
    "text": "Frozen embryos are children, Ala. high court says in unprecedented ruling  —  The Alabama Supreme Court ruled Friday that frozen embryos are people and someone can be held liable for destroying them, a decision that reproductive rights advocates say could imperil in vitro fertilization (IVF) … ",
    "url": "https://www.washingtonpost.com/politics/2024/02/19/alabama-supreme-court-embryos-children-ivf/"
  },
  {
    "text": "As Harvard Warns of Disciplinary Action, Pro-Palestine Groups Apologize for Antisemitic Image  —  The University announced Monday evening that it is investigating social media posts that contained an antisemitic image from two pro-Palestine student groups and would refer the matter to the Harvard College Administrative Board.",
    "url": "https://www.thecrimson.com/article/2024/2/20/harvard-antisemitic-image-apology/"
  },
  {
    "text": "US blocks ceasefire call with third UN veto in Israel-Hamas war  —  The United States on Tuesday again vetoed a draft United Nations Security Council resolution on the Israel-Hamas war, blocking a demand for an immediate humanitarian ceasefire as it instead pushes the 15-member body to call … ",
    "url": "https://www.reuters.com/world/us-casts-third-veto-un-action-since-start-israel-hamas-war-2024-02-20/"
  },
  {
    "text": "Supreme Court turns away House GOP lawmakers' appeal over mask rule violations  —  The Supreme Court on Tuesday refused to revive a lawsuit from three House Republicans after their pay was docked for not complying with a pandemic-era mask requirement on the chamber floor.",
    "url": "https://thehill.com/homenews/house/4478298-supreme-court-turns-away-house-gop-lawmakers-appeal-over-mask-rule-violations/"
  },
  {
    "text": "Biden admin was working behind closed doors to dissuade Russia from testing space weapon  —  Administration officials say last week's revelations might have jeopardized U.S. efforts to dissuade Russia from moving forward.  —  One reason U.S. officials didn't widely disseminate intelligence … ",
    "url": "https://www.politico.com/news/2024/02/20/biden-white-house-russia-space-weapon-00142172"
  },
  {
    "text": "DNC intervenes in GOP effort to nullify Arizona election manual  —  Democrats are challenging a Republican effort to nullify the manual used to oversee Arizona election rules and results.  —  The Democratic National Committee is looking to jump into a pair of Arizona election lawsuits Tuesday morning … ",
    "url": "https://www.politico.com/news/2024/02/20/dnc-challenge-rnc-arizona-election-manual-00142156"
  },
  {
    "text": "Liberal Media Meltdowns Reach Critical Mass  —  On this full episode of LARRY, we discuss just how deranged the lefty late-night hosts have become, the attacks on Justice Clarence Thomas, panic at “The View,” Fox News hosts getting SCRAPPY, and MUCH, much more!",
    "url": "https://hotair.com/videos/2024/02/20/liberal-media-meltdowns-reach-critical-mass-n3783277"
  }
]