[
  {
    "text": "Harris' doctor reports she's in ‘excellent health.’ Her campaign wants to draw a contrast with Trump  —  Vice President Kamala Harris is in “excellent health” and “possesses the physical and mental resiliency” required to serve as president, her doctor said in a letter released Saturday that summarizes her medical history and status.",
    "url": "https://apnews.com/article/harris-medical-records-trump-903d7c1654ca0236a4b08f9b59b4e2b8"
  },
  {
    "text": "Harris and Trump take divergent paths in a tied race  —  Trump says he's winning.  Harris says she could lose.  But polls show a dead heat.  —  Aspiring members of Donald Trump's potential second administration gathered Thursday at Washington's Royal Sands Social Club … ",
    "url": "https://www.washingtonpost.com/politics/2024/10/12/harris-trump-strategy-tied/"
  },
  {
    "text": "Trump, after mocking Harris over teleprompter use, stops rally to remove sign that fell on his  —  Former president often mocks Kamala Harris for using a teleprompter  —  Your support helps us to tell the story  —  This election is still a dead heat, according to most polls.",
    "url": "https://www.the-independent.com/news/world/americas/us-politics/trump-teleprompter-harris-reno-rally-b2628157.html"
  },
  {
    "text": "Vice president Harris is in ‘excellent health,’ according to detailed letter from her physician  —  Vice President Kamala Harris is in “excellent health,” her doctor, US Army physician Joshua R. Simmons, said in a letter summarizing her medical history that was released by the White House on Saturday.",
    "url": "https://www.cnn.com/2024/10/12/politics/kamala-harris-health-records"
  },
  {
    "text": "Daring Trump, Harris's Campaign Releases Medical Information  —  Vice President Kamala Harris released a letter from her doctor saying that she is in “excellent health,” as her campaign tries to capitalize on the lack of health information shared by her rival.",
    "url": "https://www.nytimes.com/2024/10/12/us/politics/harris-medical-records-trump.html"
  },
  {
    "text": "A Frustrated Trump Lashes Out Behind Closed Doors Over Money  —  Donald J. Trump is feeling aggrieved, unappreciated by donors and fenced in by security concerns in the final stretch of the race.  —  Donald J. Trump took his seat at the dining table in his triplex penthouse apartment atop Trump Tower … ",
    "url": "https://www.nytimes.com/2024/10/12/us/politics/trump-gop-donors.html?unlocked_article_code=1.Rk4.43tn.hsPavZdYfmGB&smid=url-share"
  },
  {
    "text": "Black Voters Drift From Democrats, Imperiling Harris's Bid, Poll Shows  —  Vice President Kamala Harris is on track to win a majority of Black voters, and has brought many back to her party since taking over for President Biden.  Still, a significant gap in support persists.",
    "url": "https://www.nytimes.com/2024/10/12/us/politics/poll-black-voters-harris-trump.html"
  },
  {
    "text": "Justice Department Sues Virginia for Violating Federal Law's Prohibition on Systematic Efforts to Remove Voters Within 90 Days of an Election  —  For Immediate Release  —  The Justice Department announced today that it has filed a lawsuit against the State of Virginia … ",
    "url": "https://www.justice.gov/opa/pr/justice-department-sues-virginia-violating-federal-laws-prohibition-systematic-efforts"
  },
  {
    "text": "Justice Department Sues Virginia Officials Over State's Noncitizen Voter Roll Purge  —  The U.S. Department of Justice (DOJ) is suing Virginia over its voter roll maintenance program, alleging that the state is illegally removing voters from the rolls too close to the 2024 general election.",
    "url": "https://www.democracydocket.com/news-alerts/justice-department-sues-virginia-officials-over-states-noncitizen-voter-roll-purge/"
  },
  {
    "text": "A Conversation With JD Vance  —  Philip Montgomery for The New York Times  —  From the moment JD Vance came onto the national stage, he was inextricably linked to Donald Trump.  As the author of the best-selling book “Hillbilly Elegy,” Vance was initially the Trump whisperer … ",
    "url": "https://www.nytimes.com/2024/10/12/magazine/jd-vance-interview.html"
  },
  {
    "text": "Trump's top general calls ex-president ‘fascist to the core’ and ‘most dangerous person to this country,’ new book says  —  Your support helps us to tell the story  —  This election is still a dead heat, according to most polls.  In a fight with such wafer-thin margins … ",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/trump-fascist-general-woodward-book-b2627972.html"
  },
  {
    "text": "Six GOP congressmen sue to have Pa. military and overseas ballots set aside in November election  —  Six Republican members of Congress are suing the Pennsylvania Department of State, arguing that ballots from overseas voters — including members of the U.S. military — are susceptible to fraud … ",
    "url": "https://www.inquirer.com/politics/overseas-ballots-pennsylvania-20241010.html"
  },
  {
    "text": "GOP senator touts ‘support’ of colleague — who didn't endorse her  —  Sen. Deb Fischer (R-NE) is facing a competitive election for the first time in years — and she's trying to whip out bipartisan credentials to stave off the threat.  —  The problem is, the senator whose “support” … ",
    "url": "https://www.rawstory.com/deb-fischer/"
  },
  {
    "text": "Why is Donald Trump campaigning in California, a state he's almost certain to lose?  —  With the presidency on the line in battlegrounds like Wisconsin and Pennsylvania, why would Donald Trump venture into California, one of the most solidly Democratic states, just weeks before Election Day?",
    "url": "https://apnews.com/article/trump-california-coachella-nevada-arizona-newsom-4557c2f98ffc179178fe5b6ec5bcf8aa"
  },
  {
    "text": "Trump Plans to Amp Up His Violent, Bigoted Rhetoric in Closing Pitch to Voters  —  In recent weeks, Trump reiterated he wants to be “dictator” for a day, urged police to be more violent, and claimed migrants are predisposed to murder … And as he makes his closing argument … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-violent-rhetoric-immigrant-dictator-police-election-2024-1235131086/"
  },
  {
    "text": "Trump Is Said to Consider Brooke Rollins for White House Chief of Staff  —  Ms. Rollins, a conservative lawyer who ran domestic policy in the Trump administration, is said to be under consideration for the role should Donald J. Trump win the election.  —  Former President Donald J. Trump … ",
    "url": "https://www.nytimes.com/2024/10/11/us/politics/trump-brooke-rollins-chief-of-staff.html"
  },
  {
    "text": "Trump Leads in Arizona as Harris Holds an Edge in Pennsylvania, New Polls Show  —  The latest Times/Inquirer/Siena polls found Donald Trump with a six-point advantage in Arizona, and Kamala Harris with a four-point lead in Pennsylvania.  —  Two of the nation's most-contested battleground states … ",
    "url": "https://www.nytimes.com/2024/10/12/us/politics/times-siena-arizona-pennsylvania-polls.html"
  },
  {
    "text": "Trump Has Clear Edge on Handling Israel, Ukraine Wars, WSJ Poll Shows  —  By double-digit margins, swing-state voters prefer the former president over Harris when it comes to dealing with both conflicts",
    "url": "https://www.wsj.com/politics/elections/trump-harris-foreign-policy-poll-46540a9a"
  },
  {
    "text": "What if Trump Wins Like This?  —  If Donald Trump wins, the people who voted for him would have a range of reasons for putting him in office.  There are a lot of potential Trump voters who don't like him that much, or who really like only parts of his personality or platform and tolerate the rest.",
    "url": "https://www.nytimes.com/2024/10/12/opinion/trump-second-term.html"
  },
  {
    "text": "This Election Will Need More Heroes  —  True political courage — the principled stand, the elevation of country over party pressure, the willingness to sacrifice a career to protect the common good — has become painfully rare in a polarized world.  It deserves to be celebrated and nurtured whenever … ",
    "url": "https://www.nytimes.com/2024/10/12/opinion/election-2024-voter-suppression.html"
  },
  {
    "text": "California officials reject more SpaceX rocket launches, with some citing Musk's X posts  —  SpaceX's plans to launch more rockets from the California coast were rejected by a state commission this week, with some officials citing Elon Musk's political posts on X and raising concerns … ",
    "url": "https://www.latimes.com/california/story/2024-10-11/la-me-spacex-coastal-commission"
  },
  {
    "text": "Trump campaign connected with Elon Musk's X before it blocked links to hacked materials  —  New York CNN  —  Former President Donald Trump's campaign connected with Elon Musk's X last month to discuss hacked Trump campaign materials circulating on the social media platform before X blocked links … ",
    "url": "https://www.cnn.com/2024/10/11/media/trump-elon-musk-x-hack-materials/"
  },
  {
    "text": "Kremlin confirms Trump sent Russia Covid-19 tests, after former president denied Bob Woodward claim  —  Russia has confirmed that Donald Trump sent the Kremlin sample Covid-19 tests in the early days of the pandemic, after revelations in veteran journalist Bob Woodward's new book raised further questions … ",
    "url": "https://www.cnn.com/2024/10/11/europe/kremlin-confirms-trump-covid-tests-intl/"
  },
  {
    "text": "Inside Donald Trump's Shadow Presidency  —  In the years since he left the White House, former President Donald J. Trump has remained a force in international politics, meeting with a number of foreign leaders and operating out of his Mar-a-Lago estate in Florida.",
    "url": "https://www.nytimes.com/2024/10/11/us/politics/donald-trumps-presidency.html"
  },
  {
    "text": "Tim Walz faces new question: How many ‘misspeaks’ can a ‘knucklehead’ get away with?  —  MINNEAPOLIS — What started as an appealing character trait has quickly become one of Tim Walz's biggest problems: His way with words.  —  Exaggerations from the 60-year-old Minnesota governor's past … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/10/12/tim-walz-gaffes-2024-election-impact/75478078007/"
  }
]