[
  {
    "text": "Live Updates: Iran Said It Fired Missiles at U.S. Base in Qatar  —  The target was Al Udeid Air Base, the largest American military installation in the Middle East.  —  Here are the latest developments.  —  Iran said it launched a military attack on an American base in Qatar … ",
    "url": "https://www.nytimes.com/live/2025/06/23/world/iran-trump-israel-news?unlocked_article_code=1.RE8.1Y8j.-EXJAcAWlC0p&smid=url-share"
  },
  {
    "text": "Trump announces Israel-Iran ceasefire  —  U.S. President Donald Trump said on Monday that a “complete and total” ceasefire between Israel and Iran will go into force with a view to ending the conflict between the two nations.  —  Trump appeared to suggest that Israel and Iran … ",
    "url": "https://www.reuters.com/world/middle-east/trump-announces-israel-iran-ceasefire-2025-06-23/"
  },
  {
    "text": "Here's how Iran could retaliate against the US if diplomacy fails  —  President Trump expressed optimism Monday that the war between Iran and Israel was coming to an end, just hours after Iran launched largely symbolic strikes on a U.S. military base in Qatar that were intercepted.",
    "url": "https://thehill.com/policy/defense/5365222-iran-israel-war-tensions-iran-us/"
  },
  {
    "text": "Trump wants to take out Iran's nuclear program.  His attacks may backfire.  —  Over the weekend, the United States bombed three nuclear facilities in Iran.  Iran has been considered a political risk to America since the 1979 revolution, and President Donald Trump has repeatedly stated … ",
    "url": "https://www.vox.com/politics/417505/iran-war-trump-nuclear-strategy-foreign-policy"
  },
  {
    "text": "Trump's Cease-Fire Announcement Catches His Own Top Officials by Surprise  —  Before asserting that Iran and Israel had agreed to a cease-fire, President Trump spoke to Prime Minister Benjamin Netanyahu of Israel and Iranian officials, with Qatar helping to mediate.",
    "url": "https://www.nytimes.com/2025/06/23/world/middleeast/trump-ceasefire-israel-iran.html"
  },
  {
    "text": "Supreme Court eases rapid deportations to countries where immigrants have no ties  —  The high court's majority offered no explanation for its ruling.  —  The Supreme Court on Monday cleared the way for the Trump administration to swiftly deport foreigners to countries where they have no previous ties.",
    "url": "https://www.politico.com/news/2025/06/23/supreme-court-third-party-country-deporations-00419210"
  },
  {
    "text": "161. The Court's Disastrous Ruling in the Third-Country Removal Case  —  Welcome back to “One First,” an (increasingly frequent) newsletter that aims to make the U.S. Supreme Court more accessible to all of us.  If you're not already a subscriber, I hope you'll consider becoming one (and … ",
    "url": "https://www.stevevladeck.com/p/161-the-courts-disastrous-ruling"
  },
  {
    "text": "Supreme Court allows Trump to swiftly deport certain immigrants to ‘third countries’  —  The Trump administration sought to overturn a judge's ruling that imposed a legal process for deporting convicted criminals to places other than their countries of origin.",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-allows-trump-deport-certain-immigrants-third-countries-rcna209419"
  },
  {
    "text": "The Chaos and Cruelty of DVD v. DHS  —  The litigation over third-country removals highlights the Trump administration's pattern of legalistic noncompliance.  —  qjurecic.bsky.social  —  Meet The Authors … In a March interview on MSNBC, Senate Minority Leader Chuck Schumer (D-N.Y.) … ",
    "url": "https://www.lawfaremedia.org/article/the-chaos-and-cruelty-of-dvd-v.-dhs"
  },
  {
    "text": "Trump Administration to End Protections for 58 Million Acres of National Forests  —  Agriculture Secretary Brooke Rollins said the Clinton-era rule barring road construction and logging was outdated and “absurd.”  —  The Trump administration said on Monday that it would open up 58 million acres … ",
    "url": "https://www.nytimes.com/2025/06/23/climate/trump-end-protections-for-58-million-acres-of-national-forests.html?unlocked_article_code=1.RU8.Dnq0.qdqpUIK2gLwu&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Florida Builds ‘Alligator Alcatraz’ Detention Center for Migrants in Everglades  —  Immigrant advocates said the move creates a whole new form of detention outside the scope of the federal government.  —  The Dade-Collier Training and Transition Airport, in the Florida Everglades, in 2019.",
    "url": "https://www.nytimes.com/2025/06/23/us/politics/florida-alligator-alcatraz-migrant-detention-center.html"
  },
  {
    "text": "Murkowski suggests she could become an Independent in the right circumstance  —  Alaska Sen. Lisa Murkowski, one of President Donald Trump's most vocal critics in the Senate GOP, said in a podcast on Monday that there are certain situations in which she'd consider becoming an independent and caucusing with Democrats.",
    "url": "https://www.politico.com/live-updates/2025/06/23/congress/murkowski-as-independent-00419045"
  },
  {
    "text": "Republican attempt to rein in federal judges is stripped from Trump's big bill  —  The provision was aimed at curbing nationwide injunctions imposed by judges that have blocked some high-profile Trump administration policies.  —  WASHINGTON — Senate Democrats forced the removal of a provision … ",
    "url": "https://www.nbcnews.com/politics/congress/republican-attempt-rein-federal-judges-stripped-trumps-big-bill-rcna214483"
  },
  {
    "text": "ICE detains Marine Corps veteran's wife who was still breastfeeding their baby  —  Marine Corps veteran Adrian Clouatre doesn't know how to tell his children where their mother went after U.S. Immigration and Customs Enforcement officers detained her last month.",
    "url": "https://apnews.com/article/ice-detains-marine-veteran-wife-clouatre-802305fe0a364ef86a7cb61805129ee1"
  },
  {
    "text": "Tesla Robotaxi Incidents Draw Scrutiny From US Safety Agency … The US National Highway Traffic Safety Administration is aware of the incidents that were captured in videos posted on social media and is gathering additional information from the company, the agency said in a statement to Bloomberg.",
    "url": "https://www.bloomberg.com/news/articles/2025-06-23/tesla-robotaxi-videos-show-speeding-driving-into-wrong-lane"
  },
  {
    "text": "US judge blocks Trump plan to close Harvard's doors to international students  —  A federal judge on Monday blocked President Donald Trump's administration from implementing his plan to bar foreign nationals from entering the United States to study at Harvard University.",
    "url": "https://www.reuters.com/world/us/us-judge-blocks-trump-plan-close-harvards-doors-international-students-2025-06-24/"
  },
  {
    "text": "Vance Hints Uranium Was Moved After Trump Tipped Off Tehran  —  BOMBS AWAY!  —  The vice president's remarks appeared to suggest the Iranians took precautions before the U.S. strikes.  —  Vice President JD Vance raised major questions about the success of the U.S. strikes on Iran's nuclear facilities … ",
    "url": "https://www.thedailybeast.com/vance-hints-uranium-was-moved-after-trump-tipped-off-tehran/"
  },
  {
    "text": "Israeli warning call to top Iranian general: ‘You have 12 hours to escape’  —  An audio recording obtained by The Washington Post is a window into the covert campaign by Israeli intelligence to intimidate and divide Iranian military officials.  —  In the hours after Israel launched … ",
    "url": "https://www.washingtonpost.com/national-security/2025/06/23/exclusive-israel-intelligence-iran-call-audio/"
  },
  {
    "text": "Judge chastises Trump administration in Voice of America hearing  —  “What would be the point of Voice of America if there is no voice?”  Judge Royce Lamberth asked in court.  —  In a hearing Monday to determine the future of Voice of America, U.S. District Judge Royce Lamberth scolded … ",
    "url": "https://www.washingtonpost.com/style/media/2025/06/23/voa-lamberth-judge-staff-cuts-injunction/"
  },
  {
    "text": "OCR Complaint: Smith College  —  On June 20th, 2025 Defending Education (DE) filed a complaint against Smith College (Smith) for discrimination on the basis of sex in programs or activities that receive federal financial assistance in violation of Title IX of the Education Amendments of 1972 (Title IX), 20 U.S.C.",
    "url": "https://defendinged.org/complaints/ocr-complaint-smith-college/"
  },
  {
    "text": "Media Matters files suit in federal court to block retaliatory FTC investigation and protect its First Amendment rights  —  Investigation into Media Matters the latest example of Trump administration abusing power to target perceived political opponents  —  Media Matters for America filed suit today … ",
    "url": "https://www.mediamatters.org/justice-civil-liberties/media-matters-files-suit-federal-court-block-retaliatory-ftc-investigation"
  }
]