[
  {
    "text": "Federal judge blocks Musk's DOGE from access to Treasury Department material  —  The judge also ordered Musk and his team to “immediately destroy any and all copies of material downloaded from Treasury Department's records and systems, if any.”  —  NEW YORK — A federal judge issued … ",
    "url": "https://www.washingtonpost.com/national-security/2025/02/07/trump-musk-government-efficiency-attorneys-general-lawsuit/"
  },
  {
    "text": "A US Treasury Threat Intelligence Analysis Designates DOGE Staff as ‘Insider Threat’  —  An internal email reviewed by WIRED calls DOGE staff's access to federal payments systems “the single biggest insider threat risk the Bureau of the Fiscal Service has ever faced.”",
    "url": "https://www.wired.com/story/treasury-bfs-doge-insider-threat/"
  },
  {
    "text": "Treasury was warned DOGE access to payments marked an ‘insider threat’  —  The assessment, done by the contractor Booz Allen Hamilton, came before Treasury tapped an ally of Elon Musk to oversee the sensitive payment system.  —  The Treasury Department was warned in a confidential assessment … ",
    "url": "https://www.washingtonpost.com/national-security/2025/02/07/doge-treasury-payments-system-warning/"
  },
  {
    "text": "Judge Halts Access to Treasury Payment Systems by Elon Musk's Team  —  The order came in response to a lawsuit filed by 19 attorneys general accusing the president of failing to faithfully execute the nation's laws when he let DOGE comb through federal computer systems.",
    "url": "https://www.nytimes.com/2025/02/07/nyregion/attorneys-general-trump-musk-suit.html"
  },
  {
    "text": "Trump says he's ending Biden's classified intelligence briefings in payback move  —  President Donald Trump said Friday that he's revoking former President Joe Biden's access to government secrets and ending the daily intelligence briefings he's receiving in payback for Biden doing the same to him in 2021.",
    "url": "https://apnews.com/article/trump-biden-security-clearance-revoked-be82cd4f185f01404718fcc69e074fbf"
  },
  {
    "text": "Supplemental Guidance to the 2024 NIH Grants Policy Statement: Indirect Cost Rates  —  Related Announcements  —  Issued by  —  Office of The Director, National Institutes of Health (OD)  —  Purpose  —  The National Institutes of Health (NIH) awards a large number of grants providing … ",
    "url": "https://grants.nih.gov/grants/guide/notice-files/NOT-OD-25-068.html"
  },
  {
    "text": "Deep Cuts to Medical Research Funds Could Hobble University Budgets  —  Grants from the National Institutes of Health come with additional money for overhead.  Proposed funding cuts would leave colleges with large budget gaps.  —  The National Institutes of Health announced a new policy Friday … ",
    "url": "https://www.nytimes.com/2025/02/07/us/politics/medical-research-funding-cuts-university-budgets.html"
  },
  {
    "text": "Trump fires archivist of the United States, official who oversees government records  —  President Trump has fired Archivist of the United States Colleen J. Shogan, the government official responsible for preserving and providing access to government records.",
    "url": "https://www.cbsnews.com/news/trump-fires-archivist-of-the-united-states-colleen-shogan/"
  },
  {
    "text": "Trump Says He Will Dismiss Kennedy Center Board Members and Install Himself as Chair  —  The move by the president, whose authority to make the changes was not clear, is the latest attempt to bring a Washington institution under his control.  —  President Trump announced his intention … ",
    "url": "https://www.nytimes.com/2025/02/07/us/politics/trump-kennedy-center.html?unlocked_article_code=1.vE4.ztf6.xFI6kA7RgBnV&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Musk's DOGE Teen Was Fired By Cybersecurity Firm for Leaking Company Secrets  —  Edward Coristine posted online that he had retained access to the firm's servers.  Now he has access to sensitive government information.  —  Edward Coristine, a 19-year-old member of Elon Musk's squad that's … ",
    "url": "https://www.bloomberg.com/news/articles/2025-02-07/musk-s-doge-teen-was-fired-by-cybersecurity-firm-for-leaking-company-secrets?accessToken=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzb3VyY2UiOiJTdWJzY3JpYmVyR2lmdGVkQXJ0aWNsZSIsImlhdCI6MTczODk1NzQyNCwiZXhwIjoxNzM5NTYyMjI0LCJhcnRpY2xlSWQiOiJTUkJXMTlUMVVNMFcwMCIsImJjb25uZWN0SWQiOiIyQjE3NzFFOTlEODc0QzRDOTY1Njg1RTZBQkJGM0QwRCJ9.vxGv4ncXEbIrUGmUYpTUdxLmCVDwzmEWp-VRWV9otME"
  },
  {
    "text": "Kash Patel Took $25,000 From Russia-Linked Firm to Appear on an Anti-FBI TV Series  —  Last year, Kash Patel, the MAGA provocateur whom Donald Trump has nominated to head the FBI, received $25,000 from a Russia-linked production company to participate in a documentary in which he assailed the FBI and called for closing its headquarters.",
    "url": "https://www.motherjones.com/politics/2025/02/kash-patel-fbi-trump-tucker-carlson-russia-ukraine-putin/"
  },
  {
    "text": "Lawmakers flooded with calls about Elon Musk: ‘It is a deluge on DOGE’  —  “We can hardly answer the phones fast enough,” one senator said.  —  Constituents have flooded the phone lines at the U.S. Capitol this week, many of them asking questions about billionaire Elon Musk … ",
    "url": "https://www.washingtonpost.com/politics/2025/02/07/musk-congress-doge-angry-calls/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM4OTA0NDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQwMjg2Nzk5LCJpYXQiOjE3Mzg5MDQ0MDAsImp0aSI6IjIzNDhlMmVhLTNkMGQtNGM5Zi05MWNlLWEzMWU5MDZiYzQ3ZSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzAyLzA3L211c2stY29uZ3Jlc3MtZG9nZS1hbmdyeS1jYWxscy8ifQ.DU9hKQhK7fZE73DSD2Xv_YR0Px3B7KSmx-2-7YWnqrg&itid=gfta"
  },
  {
    "text": "Measles outbreak expands in West Texas around county with low vaccination rate  —  A measles outbreak is growing in a rural area of West Texas where vaccination rates are well below the recommended level.  —  In late January, two children in Gaines County were hospitalized for measles.",
    "url": "https://www.cnn.com/2025/02/07/health/west-texas-measles-outbreak/"
  },
  {
    "text": "Did Trump Quietly Kill a Sensitive Pentagon Probe into Elon Musk?  —  In December, more than a month before Donald Trump took the presidential oath of office, The New York Times reported a blockbuster scoop: Elon Musk and his SpaceX company had repeatedly failed to meet federal reporting requirements designed … ",
    "url": "https://newrepublic.com/article/191330/trump-quietly-kill-sensitive-pentagon-probe-elon-musk"
  },
  {
    "text": "Teen on Musk's DOGE Team Graduated from ‘The Com’  —  Wired reported this week that a 19-year-old working for Elon Musk's so-called Department of Government Efficiency (DOGE) was given access to sensitive US government systems even though his past association with cybercrime communities … ",
    "url": "https://krebsonsecurity.com/2025/02/teen-on-musks-doge-team-graduated-from-the-com/"
  },
  {
    "text": "They still want ‘one big, beautiful bill.’ They're nowhere close.  —  GOP leaders are trying to lasso various factions as the Senate races ahead with its own plan for President Donald Trump's tax cuts and other priorities.  —  House Republicans are still far from finalizing several key details … ",
    "url": "https://www.politico.com/news/2025/02/07/house-gop-leaders-scramble-to-extinguish-tax-cut-fires-00203092"
  },
  {
    "text": "30K tons of food ‘going to waste’ in Houston after Trump halted aid  —  About 30,000 tons of food is stuck at a port in Houston after Trump halted foreign aid for 90 days.  The food, intended to feed people overseas, is stalled at a warehouse,the Houston Chronicle reported.",
    "url": "https://www.rawstory.com/30k-tons-of-food-going-to-waste-in-houston-after-trump-halted-aid/"
  },
  {
    "text": "The real lesson of the DOGE racist tweets scandal  —  On Thursday, the Wall Street Journal reported that a staffer at the Department of Government Efficiency (DOGE) resigned after the paper inquired about some racist social media posts from an account linked to him.",
    "url": "https://www.vox.com/politics/398985/musk-doge-staffer-racist-tweets-vance-free-speech"
  },
  {
    "text": "Washington Has Given Up the Fight Against Kleptocrats.  Here's What Democracies Should Do  —  On Feb. 6, new U.S. Attorney General Pam Bondi issued a series of new directives from President Donald Trump's administration outlining her office's priorities.  Taken together, they represent … ",
    "url": "https://www.themoscowtimes.com/2025/02/07/washington-has-given-up-the-fight-against-kleptocrats-heres-what-democracies-should-do-a87912"
  },
  {
    "text": "1. Trump's second term: Early ratings and expectations  —  Table of Contents Table of Contents  —  Americans are deeply divided over Donald Trump's plans and the way he is handling his job in the early weeks of his return to the presidency.  —  Overall, 47% of U.S. adults approve … ",
    "url": "https://www.pewresearch.org/politics/2025/02/07/trumps-second-term-early-ratings-and-expectations/#trump-s-jan-6-pardons"
  },
  {
    "text": "Trump officials exerting unprecedented control over CDC scientific journal  —  Trump administration political appointees have taken steps in recent weeks to exert unprecedented influence over the Centers for Disease Control and Prevention's flagship medical research publication … ",
    "url": "https://www.cbsnews.com/news/trump-officials-influence-cdc-mmwr/"
  },
  {
    "text": "Falsehoods Fuel the Right-Wing Crusade Against U.S.A.I.D.  —  As the Trump administration works to dismantle the aid agency, right-wing influencers have flooded the internet with falsehoods about its work.  —  The video falsely claiming that the United States Agency for International … ",
    "url": "https://www.nytimes.com/2025/02/07/business/usaid-conspiracy-theories-disinformation.html"
  },
  {
    "text": "Will a Time Magazine Cover Drive a Wedge Between Trump and Musk?  —  The cover of the venerable newsweekly, long an object of fixation for the president, put Elon Musk behind the Resolute Desk.  —  The president did not look amused.  He was meeting the Japanese prime minister … ",
    "url": "https://www.nytimes.com/2025/02/07/us/politics/trump-musk-time-magazine-cover.html"
  },
  {
    "text": "Is Donald Trump Afraid of Elon Musk?  —  The president has long operated without anything resembling worry when it comes to appointments or executive action, but as his most powerful—and richest—political ally chainsaws his way through the federal government, some observers wonder if Trump might be tasting his own medicine.",
    "url": "https://www.vanityfair.com/news/story/is-donald-trump-afraid-of-elon-musk"
  },
  {
    "text": "The Elite Lawyers Working for Elon Musk's DOGE Include Former Supreme Court Clerks  —  Much attention has been paid to the young Silicon Valley engineers working for Musk's Department of Government Efficiency, but the group has also hired high-powered legal talent.",
    "url": "https://www.propublica.org/article/elon-musk-doge-lawyers-supreme-court"
  },
  {
    "text": "RFK Jr. had up to $1.2 million in credit card debt — what experts say about tackling high balances … Americans' credit card balances soared to a record $1.17 trillion in 2024 — and even the wealthy are not immune from carrying these balances.  —  One example is Robert F. Kennedy Jr. … ",
    "url": "https://www.cnbc.com/2025/02/07/what-rfk-jrs-financial-disclosures-may-teach-us-about-managing-debt.html"
  },
  {
    "text": "Trump and Musk Attack Journalists by Name in Social Media Posts  —  Since his inauguration, the president has been quick to demonize what he calls “the fake news media.”  On Friday, both men demanded that individuals be fired.  —  President Trump has made clear his animus toward mainstream media organizations.",
    "url": "https://www.nytimes.com/2025/02/07/business/media/trump-musk-attack-journalists.html"
  },
  {
    "text": "The Mood of the American Consumer is Souring  —  Tariff threats, market turbulence causing jitters early in Trump's second term  —  The Trump bump in consumer confidence is already over.  —  Tariff threats, stock market swings and rapidly reversing executive orders are causing Americans across … ",
    "url": "https://www.wsj.com/economy/consumers/americans-jittery-over-inflation-university-of-michigan-survey-suggests-1476cf39"
  }
]