[
  {
    "text": "A federal judge temporarily blocks Trump's executive order ending birthright citizenship  —  A federal judge on Thursday temporarily blocked President Donald Trump's executive order redefining birthright citizenship, calling it “blatantly unconstitutional” during the first hearing in a multi-state effort challenging the order.",
    "url": "https://apnews.com/article/birthright-citizenship-donald-trump-lawsuit-immigration-9ac27b234c854a68a9b9f8c0d6cd8a1c"
  },
  {
    "text": "Judge Temporarily Blocks Trump's Plan to End Birthright Citizenship  —  A federal judge in Seattle has issued a temporary order halting the president's plan.  —  A federal judge on Thursday temporarily blocked President Trump's executive order to end automatic citizenship to babies born on American soil … ",
    "url": "https://www.nytimes.com/2025/01/23/us/politics/judge-blocks-birthright-citizenship.html"
  },
  {
    "text": "Trump administration defends his birthright citizenship order in court for the first time  —  A federal district court hearing Thursday in Seattle will be the first action in what promises to be a protracted and wide-ranging battle over the new administration's agenda.",
    "url": "https://www.nbcnews.com/politics/immigration/trump-administration-defends-birthright-citizenship-order-court-first-rcna188851"
  },
  {
    "text": "Johnson aide advised against Hutchinson subpoena over concerns about lawmakers' ‘sexual texts’  —  The move was intended in part to prevent the release of sexually explicit texts that lawmakers sent Cassidy Hutchinson.",
    "url": "https://www.washingtonpost.com/politics/2025/01/23/cassidy-hutchinson-lawmakers-texts/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM3NjA4NDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM4OTkwNzk5LCJpYXQiOjE3Mzc2MDg0MDAsImp0aSI6Ijc0NWQyMGVmLTIwNDEtNDEyNi1iYjNkLTJkNjM5NmU2ZjMwMCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzAxLzIzL2Nhc3NpZHktaHV0Y2hpbnNvbi1sYXdtYWtlcnMtdGV4dHMvIn0.7Ls-g5QQAxsT3ZwpfrOAlVcnD6OWWF6dR_ihLvpdR94&itid=gfta"
  },
  {
    "text": "Trump Revokes Security Detail for Pompeo and Others Despite Threats From Iran  —  The officials had been part of an aggressive posture against Iran during President Trump's first term.  —  President Trump revoked security protection for his former secretary of state, Mike Pompeo … ",
    "url": "https://www.nytimes.com/2025/01/23/us/politics/trump-pompeo-security-iran.html"
  },
  {
    "text": "Senate confirms John Ratcliffe to be Trump's CIA director  —  Ratcliffe becomes the second Trump nominee to be approved by the Republican-led Senate.  —  WASHINGTON — The Senate voted Thursday to confirm John Ratcliffe as the next CIA director under President Donald Trump … ",
    "url": "https://www.nbcnews.com/politics/congress/senate-confirms-john-ratcliffe-trumps-cia-director-rcna188588"
  },
  {
    "text": "Hegseth's ex-wife gives new statement to FBI amid scrutiny over his nomination  —  Pete Hegseth's ex-wife recently gave a new statement to the FBI about the defense nominee's alcohol use, according to two sources familiar with the matter, an issue that has become a source of controversy during his confirmation process.",
    "url": "https://www.cnn.com/2025/01/22/politics/pete-hegseth-ex-wife-fbi-briefing/"
  },
  {
    "text": "CNN Plots Major Overhaul as It Enters a New Trump Era  —  Mark Thompson has promised to reinvent CNN since he arrived in 2023.  Now, he is remaking the network's TV lineup and its work force.  —  Give people news when and where they want it.  —  That, says Mark Thompson, CNN's chief executive … ",
    "url": "https://www.nytimes.com/2025/01/23/business/media/cnn-layoffs-mark-thompson.html?unlocked_article_code=1.rU4.Ktql.gY13zafutkB6&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Trump Administration Temporarily Mutes Federal Health Officials  —  Scientific meetings were canceled, and research data on the bird flu outbreak was delayed, amid confusion over the directive.  —  The Trump administration, moving quickly to clamp down on health and science agencies … ",
    "url": "https://www.nytimes.com/2025/01/22/health/trump-health-communications.html?unlocked_article_code=1.rU4.ebZH.piselgtAibJA&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "President Donald Trump says he'll ‘demand that interest rates drop immediately’  —  WATCH NOW  —  President Donald Trump lobbed his first volley at the Federal Reserve, saying Thursday that he will apply pressure to bring down interest rates.  —  Speaking to an assembly of global leaders … ",
    "url": "https://www.cnbc.com/2025/01/23/president-donald-trump-says-hell-demand-that-interest-rates-drop-immediately.html"
  },
  {
    "text": "Immigrants rush to prepare for Trump deportation raids … - Trump's executive orders that began laying the groundwork for his mass deportations reversed several longstanding policies. … - The New Mexico-based immigrant rights advocacy group Somos Un Pueblo Unido said it's launching a … ",
    "url": "https://www.axios.com/2025/01/23/immigrants-scramble-trump-deportation-raids"
  },
  {
    "text": "Musk mocks Nazi salute accusations with puns  —  Elon Musk referenced Adolf Hitler and other Nazi leaders in a social media post filled with puns early Thursday taunting those who accused him of doing a Nazi salute at an event after President Trump's inauguration.  —  “Don't say Hess to Nazi accusations!",
    "url": "https://thehill.com/homenews/administration/5102198-elon-musk-nazi-salute-controversy/"
  },
  {
    "text": "Mississippi lawmaker introduces ‘Contraception Begins at Erection Act’  —  The bill, which is unlikely to pass, would make it unlawful for “a person to discharge genetic material without the intent to fertilize an embryo.”  —  Mississippi state Sen. Bradford Blackmon, a Democrat … ",
    "url": "https://www.nbcnews.com/politics/politics-news/mississippi-lawmaker-introduces-contraception-begins-erection-act-rcna188938"
  },
  {
    "text": "CNN's Jim Acosta Reminds Pardon-Dodging GOP Lawmaker That He Isn't On Fox News  —  The anchor and Tim Burchett kept up their animosity for quite a long time.  —  LOADING  —  CNN's Jim Acosta repeatedly grilled Rep. Tim Burchett (R-Tenn.) over his refusal to condemn President Donald Trump's pardon … ",
    "url": "https://www.huffpost.com/entry/jim-acosta-tim-burchett-pardon-fox-news_n_67925825e4b0c94316ec7f36"
  },
  {
    "text": "What Republicans Could Cut to Pay for Trump's Tax Cuts: Medicaid and More  —  President Trump wants a massive tax cut and immigration crackdown bill.  Now Republicans must decide what to cut to help pay for it.  —  Top Republicans are passing around an extensive menu of ideas to cover … ",
    "url": "https://www.nytimes.com/2025/01/23/us/politics/trump-tax-cuts-immigration-house-republicans.html"
  },
  {
    "text": "Donald Trump Is Running Riot  —  I have never been more concerned about the rule of law in the United States.  —  I was born in 1969 — five years after the Civil Rights Act was passed — and I have no memory of the legal system operated in the Jim Crow South, when there was one code … ",
    "url": "https://www.nytimes.com/2025/01/23/opinion/trump-pardons-bolton-jan-6.html"
  },
  {
    "text": "F.B.I. Pick Pushed False and Misleading Claims About Trump Investigations  —  Kash Patel, Donald J. Trump's choice to run the bureau, has made a series of spurious assertions about the Russia, Jan. 6 and classified documents inquiries.  —  Kash Patel, President Trump's pick to lead the F.B.I. … ",
    "url": "https://www.nytimes.com/2025/01/23/us/politics/kash-patel-trump-fbi-inquiries.html?unlocked_article_code=1.rU4.nZac.SEjrzjog9XgN&smid=url-share"
  },
  {
    "text": "Justice Dept. Cancels Entry-Level Job Offers in Honors Program  —  The program, which has functioned quietly for decades, is the latest target of Trump administration appointees who are eager to exert more control over who gets government jobs.  —  The Justice Department has abruptly rescinded job offers … ",
    "url": "https://www.nytimes.com/2025/01/23/us/politics/justice-honors-program-trump.html"
  },
  {
    "text": "ChatGPT down: AI chat app not working as website goes offline  —  Your support helps us to tell the story  —  From reproductive rights to climate change to Big Tech, The Independent is on the ground when the story is developing.  Whether it's investigating the financials of Elon Musk's pro … ",
    "url": "https://www.the-independent.com/tech/chatgpt-down-not-working-ai-openai-latest-b2684993.html"
  },
  {
    "text": "Trump, Energy and MAGA Brain  —  One key to understanding many of the destructive policies coming down the pike is to realize that Donald Trump suffers from what I've been calling MAGA brain, although it actually predates Trump.  I'd define it as the belief that effective governance comes … ",
    "url": "https://paulkrugman.substack.com/p/trump-energy-and-maga-brain"
  },
  {
    "text": "Donald Trump's war on DEI is not about “merit”  —  Executive orders attacking DEI are about promoting unqualified white men over diverse candidates  —  Donald Trump lies about everything, but the lies strewn throughout his executive order shutting down diversity, equity, and inclusion (DEI) … ",
    "url": "https://www.salon.com/2025/01/23/donald-on-dei-is-not-about-merit/"
  },
  {
    "text": "USCP Arrests Man with Gun  —  “On Tuesday, January 21, the United States Capitol Police (USCP) received a lookout for a man with reported mental health issues and suicidal thoughts who was believed to be armed and in the area.  At approximately 1:15 p.m., USCP officers spotted the man's car on First Street … ",
    "url": "https://www.uscp.gov/media-center/press-releases/uscp-arrests-man-gun"
  },
  {
    "text": "Trump's D.E.I. Order Creates ‘Fear and Confusion’ Among Corporate Leaders  —  The executive order signals that private businesses and organizations could be investigated over their diversity policies.  —  More than 200 diversity officers, some from Fortune 500 companies and some from nonprofits … ",
    "url": "https://www.nytimes.com/2025/01/23/business/trump-dei-corporate-reaction.html"
  },
  {
    "text": "A Trump movie that Trump hates is going to get a lot more attention, courtesy of the Oscars  — You probably didn't see “The Apprentice,” a Trump biopic that came out last year — very few people did.  — That could be uncomfortable for Trump and Hollywood, which shied away from the movie last year.",
    "url": "https://www.businessinsider.com/trump-movie-apprentice-oscar-awards-2025-1"
  },
  {
    "text": "Security breach at US Capitol: ABC News exclusive  —  : A man who toured the Capitol was found with a gun on Tuesday, officials said.  —  The US Capitol in Washington, DC, Dec. 10, 2024.  —  A Massachusetts man was found to be carrying a gun after attending a tour of the U.S. Capitol … ",
    "url": "https://abcnews.go.com/Politics/security-breach-us-capitol-abc-news-exclusive/story?id=118027006"
  },
  {
    "text": "Jeffries draws red line on debt-for-aid deal: ‘Nonstarter’  —  Top House Democrats are pouring cold water on a Republican proposal to trade a debt limit increase for California wildfire aid, with House Minority Leader Hakeem Jeffries telling reporters it was a “nonstarter.”",
    "url": "https://www.politico.com/live-updates/2025/01/23/congress/dems-fire-aid-debt-limit-00200221"
  },
  {
    "text": "The shitcoin presidency  —  $TRUMP is taking corruption to new levels.  —  Donald Trump declared on the campaign trail that he'd be a “crypto president” during his second term.  He said he'd make America “the crypto capital of the planet” and a “bitcoin superpower.”",
    "url": "https://www.publicnotice.co/p/trumps-memecoin-grift-explained"
  },
  {
    "text": "Trump Administration Live Updates: Justice Department Halts New Civil Rights Cases  —  Where Things Stand  — Civil rights: The Justice Department has ordered an immediate halt to all new civil rights cases or investigations — and signaled that it might back out of Biden-era agreements … ",
    "url": "https://www.nytimes.com/live/2025/01/23/us/trump-news"
  },
  {
    "text": "First images of ICE mass deportation efforts show arrests of MS-13 gang members, murder suspects  —  Trump administration moving rapidly to fulfill mass deportation promise  —  Fox News embedded exclusively with Immigration and Customs Enforcement (ICE) in Boston as the agency targeted … ",
    "url": "https://www.foxnews.com/politics/first-images-ice-mass-deportation-efforts-show-arrests-ms-13-gang-members-murder-suspects"
  },
  {
    "text": "The Vibes They Are a-Shiftin'  —  But it's really not clear what they are shifting to  —  Donald Trump winning a presidential election is, obviously, nothing new.  It literally happened in 2016.  What I think is new, eight years later, is the “vibe shift” first named by Tyler Cowen in July of 2024 and confirmed by Trump's victory.",
    "url": "https://www.slowboring.com/p/the-vibes-they-are-a-shiftin"
  }
]