[
  {
    "text": "Disaster for Trump as Truth Social Crashes at Critical SOTU Moment  —  The former president heavily promoted his live reactions prior to President Joe Biden's SOTU speech.  But when it came time, Trump's promises crashed and burned.  —  Donald Trump may have rage-posted … ",
    "url": "https://www.thedailybeast.com/disaster-for-trump-as-truth-social-crashes-at-critical-sotu-moment"
  },
  {
    "text": "Biden chatted for so long after State of the Union, the lights went down  —  President Biden didn't seem to want State of the Union night to end.  —  Biden took about 35 minutes between finishing his speech and exiting the House chamber — shaking hands, chatting with members of Congress … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/08/biden-sotu-exit-walk-lights-off-house/"
  },
  {
    "text": "Truth Social Suffers Outage in Middle of Trump's Furious Live-Tweeting About Biden Speech  —  “THE DRUGS ARE WEARING OFF!”  Trump wrote without any further context, making it's unclear if he was talking about Biden or himself.  —  Truth Social, the social media platform launched by Donald Trump in 2022 … ",
    "url": "https://gizmodo.com/truth-social-down-outage-trump-biden-state-of-the-union-1851318732"
  },
  {
    "text": "Biden electrifies Democrats, spars with Republicans in fiery State of the Union address  — President Joe Biden delivered a fiery, partisan State of the Union address fit for an election year.  — When Republicans booed a bipartisan immigration security bill, “Oh, you don't think so?",
    "url": "https://www.cnbc.com/2024/03/07/biden-state-of-the-union-address-to-lay-out-economic-vision-.html"
  },
  {
    "text": "Trump loses bid to delay $83.3 million E. Jean Carroll defamation judgment  — Donald Trump lost a bid to delay paying an $83.3 million civil defamation judgment to writer E. Jean Carroll.  — Trump had asked Manhattan federal Judge Lewis Kaplan to delay the judgment from taking effect until … ",
    "url": "https://www.cnbc.com/2024/03/07/trump-loses-bid-to-delay-83point3-million-e-jean-carroll-judgment.html"
  },
  {
    "text": "Trump is ordered to pay legal fees after failed lawsuit over the Steele dossier  —  Former U.S. President Donald Trump has been ordered to pay legal fees to a company founded by a former British spy that he sued for making what he claimed were false claims that harmed his reputation",
    "url": "https://abcnews.go.com/International/wireStory/trump-ordered-pay-legal-fees-after-failed-lawsuit-107891658"
  },
  {
    "text": "Trump's Money Problems Are Very Real and Very Bad  —  His political fortunes may be looking up, but his business problems are dire.  —  The danger posed to Donald Trump's finances by two recent judgments against him has been, if anything, underappreciated.",
    "url": "https://www.theatlantic.com/ideas/archive/2024/03/trump-financial-legal-troubles/677662/"
  },
  {
    "text": "Remarks of President Joe Biden — State of the Union Address As Prepared for Delivery  —  Good evening.  —  Mr. Speaker.  Madam Vice President.  Members of Congress.  My Fellow Americans.  —  In January 1941, President Franklin Roosevelt came to this chamber to speak to the nation.",
    "url": "https://www.whitehouse.gov/briefing-room/speeches-remarks/2024/03/07/remarks-of-president-joe-biden-state-of-the-union-address-as-prepared-for-delivery-2/"
  },
  {
    "text": "Father of Marine Killed in Afghanistan Is Arrested During Biden's Address  —  Steve Nikoui yelled “Abbey Gate, Abbey Gate” during the speech, a reference to where his son, Lance Cpl. Kareem Nikoui, and 12 other troops were killed during the chaotic final days of the U.S. presence in Kabul.",
    "url": "https://www.nytimes.com/2024/03/08/us/politics/abbey-gate-yelling-state-of-union.html"
  },
  {
    "text": "Official GOP Response to SOTU Has Republicans ‘Losing It’  —  Sen. Katie Britt of Alabama gave the GOP response to President Biden's annual address—which got panned by some in her own party.  —  As President Joe Biden mingled on the House floor following his State of the Union address Thursday night … ",
    "url": "https://www.thedailybeast.com/official-katie-britt-gop-response-to-state-of-the-union-has-republicans-losing-it"
  },
  {
    "text": "It's not just Israeli bombs that have killed children in Gaza.  Now some are dying of hunger too  —  It's not just Israeli bombs that have killed children in war-ravaged Gaza — now some are dying of hunger too.  Officials have long warned over the risk of famine in the Palestinian territory that's … ",
    "url": "https://apnews.com/article/gaza-malnutrition-famine-children-dying-israel-palestinians-2f938b1a82d7822c7da67cc162da1a37"
  },
  {
    "text": "Indicted Serial Liar George Santos Announces New Run for Congress During State of the Union  —  In typically dramatic fashion, Santos announced his run while President Joe Biden delivered his State of the Union speech.  —  Three months after former Rep. George Santos' colleagues expelled … ",
    "url": "https://www.thedailybeast.com/indicted-serial-liar-george-santos-announces-new-run-for-congress-during-state-of-the-union"
  },
  {
    "text": "US gained 275k jobs in February, beating expectations  —  The U.S. added 275,000 jobs in February as the unemployment rate rose to 3.9 percent, according to data released Friday by the Labor Department.  —  The February jobs report defied the expectations of economists … ",
    "url": "https://thehill.com/business/4518600-us-gained-275k-jobs-in-february-as-jobless-rate-ticked-higher/"
  },
  {
    "text": "Big oil's big deception: That plastics are recyclable  —  Plastic pollution is everywhere.  We eat it.  We drink it.  We breathe it.  It is on the summit of Mount Everest and at the bottom of the oceans.  Not only is it in human breast milk, but, according to one study … ",
    "url": "https://thehill.com/opinion/energy-environment/4513908-big-oils-big-deception-that-plastics-are-recyclable/"
  },
  {
    "text": "Hiring Boom Continues With 275,000 Jobs Added  —  Unemployment ticked higher to 3.9%  —  Hiring kept booming in February, extending a red-hot start to the year that has renewed fears that inflation could remain stubbornly high.  —  Employers added a seasonally adjusted 275,000 jobs last month … ",
    "url": "https://www.wsj.com/economy/jobs/jobs-report-february-unemployment-dc181052"
  },
  {
    "text": "Trump's takeover of Republican National Committee set to become official Friday  —  Donald Trump is wasting little time putting his imprint on the Republican Party just days after becoming its presumptive presidential nominee.  —  As the Republican National Committee meets here Friday … ",
    "url": "https://www.cnn.com/2024/03/08/politics/trump-republican-national-committee/"
  },
  {
    "text": "Thune on Ukraine: ‘America cannot retreat from the world stage’  —  Sen. John Thune (R-S.D.) pressed the House on Thursday to pass a Ukraine aid bill, as he launches a campaign to replace outgoing Senate GOP Leader Mitch McConnell (Ky.).  —  “I think that the challenge, of course, right now … ",
    "url": "https://thehill.com/homenews/senate/4517922-thune-on-ukraine-america-cannot-retreat-from-the-world-stage/"
  },
  {
    "text": "Mar-a-Lago V.P. Soul-Searching  —  While many think Trump will select his vice president based on their appeal to voters, the emerging consensus among campaign insiders is that his choice will come down to who can perform best with wealthy donors—his greatest vulnerability.",
    "url": "https://puck.news/mar-a-lago-v-p-soul-searching/"
  }
]