[
  {
    "text": "A Weary Trump Appears to Doze Off in Courtroom Ahead of Criminal Trial  —  The former president flashed signs of irritation at times, but also seemed to fall asleep, before jolting back awake.  —  Former President Donald J. Trump seemed alternately irritated and exhausted Monday morning … ",
    "url": "https://www.nytimes.com/2024/04/15/nyregion/trump-asleep-criminal-trial.html"
  },
  {
    "text": "As hush money trial begins, Trump's sex life emerges as key theme  —  Before jurors are questioned, judge spends hours hashing out what a jury should know about allegations involving women other than Stormy Daniels  —  NEW YORK — The opening day of Donald Trump's criminal trial delved deep … ",
    "url": "https://www.washingtonpost.com/politics/2024/04/15/trump-hush-money-trial-sex-tabloids/"
  },
  {
    "text": "Live Updates: Trump Trial Poised to Begin, a Criminal Case Without Precedent  —  Jury selection is set to start as Donald J. Trump faces charges he faked business records to cover up a sex scandal before winning the presidency.  The judge declined Mr. Trump's request to recuse himself.",
    "url": "https://www.nytimes.com/live/2024/04/15/nyregion/trump-hush-money-trial"
  },
  {
    "text": "I Was a Skeptic of the Stormy Daniels Prosecution.  I Was Wrong.  —  The prosecution of Donald Trump starting in New York this week is on firm legal ground.  —  When Manhattan District Attorney Alvin Bragg brought criminal charges against Donald Trump in 2023, I was highly skeptical of his decision.",
    "url": "https://slate.com/news-and-politics/2024/04/stormy-daniels-prosecution-stronger-than-i-thought.html"
  },
  {
    "text": "Trump rages at judge hours before hush money case begins  —  Former President Trump railed against the judge in his criminal hush money case early Monday, just hours before the first criminal trial against a former president is set to begin.  —  Recalling complaints he has made for months … ",
    "url": "https://thehill.com/regulation/court-battles/4594517-trump-posts-hush-money-trial-judge/"
  },
  {
    "text": "Trump Media closes down more than 18% after filing plans to issue more DJT stock … This photo illustration shows an image of former President Donald Trump reflected in a phone screen that is displaying the Truth Social app, in Washington, DC, on February 21, 2022.",
    "url": "https://www.cnbc.com/2024/04/15/trump-media-shares-plunge-after-company-files-to-issue-additional-djt-stock.html"
  },
  {
    "text": "Trump's Truth Social Stock Is Plummeting — Again  —  The company's stock value tanked 18% after it announced a plan to add more shares.  —  LOADING  —  Shares of Trump Media & Technology Group, the parent company of Donald Trump's Truth Social platform, plummeted Monday … ",
    "url": "https://www.huffpost.com/entry/trump-truth-social-stock-tanks_n_661d658fe4b015646f789caa"
  },
  {
    "text": "The Supreme Court effectively abolishes the right to mass protest in three US states  —  It is no longer safe to organize a protest in Louisiana, Mississippi, or Texas.  —  The Supreme Court announced on Monday that it will not hear Mckesson v. Doe.  The decision not to hear Mckesson leaves … ",
    "url": "https://www.vox.com/scotus/24080080/supreme-court-mckesson-doe-first-amendment-protest-black-lives-matter"
  },
  {
    "text": "Justice Clarence Thomas misses Supreme Court arguments  —  The conservative justice was not present for oral arguments on Monday, but the court did not provide a reason why.  —  WASHINGTON — Conservative Supreme Court Justice Clarence Thomas was not present at the court for oral arguments on Monday … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/justice-clarence-thomas-misses-supreme-court-arguments-rcna147826"
  },
  {
    "text": "Biden counsels Netanyahu to ‘slow things down’ after Iranian attack  —  Administration officials said the U.S. would not join any response to Tehran's assault, and suggested Israel ‘take the win’ and avoid escalation  —  The Biden administration on Sunday congratulated Israel … ",
    "url": "https://www.washingtonpost.com/national-security/2024/04/14/biden-netanyahu-israel-iran/"
  },
  {
    "text": "Tesla lays off more than 10% of staff globally as sales fall  —  Tesla (TSLA.O) told staff it is laying off more than 10% of its global workforce, an internal memo seen by Reuters on Monday shows, as it grapples with falling sales and an intensifying price war for electric vehicles (EVs).",
    "url": "https://www.reuters.com/business/autos-transportation/tesla-lay-off-more-than-10-its-staff-electrek-reports-2024-04-15/"
  },
  {
    "text": "Federal criminal investigation opened into Key Bridge crash  —  The FBI has opened a criminal investigation focusing on the massive container ship that brought down the Francis Scott Key Bridge in Baltimore last month — a probe that will look at least in part at whether the crew left … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2024/04/15/balitmore-key-bridge-criminal-investigation/"
  },
  {
    "text": "Freedom Caucus: Iran attack on Israel sets up ‘bogus’ reason to pass Ukraine aid  —  The House Freedom Caucus is warning GOP leadership not to use Iran's attack on Israel over the weekend as “justification” to send additional aid to Ukraine, as lawmakers in both parties and chambers call … ",
    "url": "https://thehill.com/homenews/house/4595464-freedom-caucus-iran-attack-on-israel-sets-up-bogus-reason-to-pass-ukraine-aid/"
  },
  {
    "text": "Swalwell accuses Clay Travis of jury tampering in Trump trial  —  Rep. Eric Swalwell (D-Calif.) accused conservative media personality Clay Travis of jury tampering as former President Trump heads to trial this week in New York regarding an alleged hush money payment to adult film star Stormy Daniels.",
    "url": "https://thehill.com/homenews/media/4594964-trump-hush-money-trial-swalwell-clay-travis/"
  },
  {
    "text": "Nikki Haley Joins Hudson  —  WASHINGTON—Hudson Institute today announced that Nikki Haley, the former governor of South Carolina and US ambassador to the United Nations, will be the next Walter P. Stern Chair.  —  “When our policymakers fail to call out our enemies or acknowledge the importance … ",
    "url": "https://www.hudson.org/nikki-haley-joins-hudson"
  },
  {
    "text": "Santos' threatened comeback bid hasn't raised a single dime  —  The former House member announced last month he planned to challenge Rep. Nick LaLota.  —  A new campaign committee from disgraced former Rep. George Santos raised no money and reported no activity in March, calling into question his plans to return to Congress.",
    "url": "https://www.politico.com/news/2024/04/15/santos-comeback-bid-funds-00152217"
  },
  {
    "text": "Supreme Court snubs House Republicans who dodged metal detectors in Congress after Jan. 6  —  What happens in Congress stays in Congress, the Supreme Court signaled on Monday, as it turned away an appeal by three Republican congressmen who were fined $5,000 each by the House … ",
    "url": "https://www.usatoday.com/story/news/politics/2024/04/15/supreme-court-republicans-house-security-jan-6/73281636007/"
  },
  {
    "text": "Crickets from Chirp Systems in Smart Lock Key Leak  —  The U.S. government is warning that “smart locks” securing entry to an estimated 50,000 dwellings nationwide contain hard-coded credentials that can be used to remotely open any of the locks.  The lock's maker Chirp Systems remains unresponsive … ",
    "url": "https://krebsonsecurity.com/2024/04/crickets-from-chirp-systems-in-smart-lock-key-leak/"
  },
  {
    "text": "Former Trump staffer who said to ‘fan the flame’ after 2020 loss hired to lead Wisconsin GOP  —  MADISON, Wis. (AP) — The director of Donald Trump's 2020 presidential campaign in Wisconsin, who pushed allegations of widespread fraud that were ultimately debunked, has been hired to run … ",
    "url": "https://apnews.com/article/wisconsin-republican-donald-trump-2020-election-46463044d8c07f1660673c9f5b299eff"
  },
  {
    "text": "Supreme Court allows enforcement of Idaho ban on gender-affirming care for transgender minors  —  The Idaho measure, which seeks to block treatments such as puberty blockers and hormone therapy, is one of more than 20 enacted by conservative states targeting care for transgender youth.",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-allows-enforcement-idaho-ban-gender-affirming-care-trans-rcna141209"
  },
  {
    "text": "Trump's right to fear Stormy Daniels — she could be a devastating witness  —  Women have consistently offered the most compelling testimony against Trump — now it's Stormy's turn  —  As a lifelong lover of the English language, I'm being slowly driven mad by one word that haunts the news coverage these days: “affair.”",
    "url": "https://www.salon.com/2024/04/15/right-to-fear-stormy-daniels--she-could-be-a-devastating-witness/"
  },
  {
    "text": "California sues city of Huntington Beach over voter ID law  —  The state of California sued the city of Huntington Beach over its voter identification law on Monday, saying the measure violates state law and that state election integrity is already protected by robust voter ID requirements.",
    "url": "https://www.reuters.com/legal/california-sues-city-huntington-beach-over-voter-id-law-2024-04-15/"
  },
  {
    "text": "Bidens report nearly $620K in income, Harris and her husband report over $450K  —  President Biden and first lady Jill Biden made a combined income of $619,976 last year, and Vice President Harris and her husband made $450,299, according to the couples' 2023 tax returns the White House released Monday.",
    "url": "https://thehill.com/homenews/administration/4595783-bidens-report-nearly-620k-in-income-harris-and-her-husband-report-over-450k/"
  },
  {
    "text": "RFK Jr. says Trump allies asked him to be VP  —  Robert F. Kennedy Jr. on Monday alleged in a social media post that allies of former President Trump reached out to him about joining the Republican presidential ticket as Trump's running mate, something the former president's campaign has denied.",
    "url": "https://thehill.com/homenews/campaign/4595085-rfk-jr-trump-vp-2024-campaign/"
  }
]