[
  {
    "text": "GOP senators push back but can't get past Tuberville on military blockade  —  The Alabama senator is not backing down in the face of the most significant challenge to his hold within the party so far.  —  Republican senators pushed to confirm more than 100 military nominees Wednesday evening … ",
    "url": "https://www.politico.com/news/2023/11/01/gop-senator-to-confront-tuberville-on-military-blockade-00124877"
  },
  {
    "text": "GOP frustration with Tuberville's military freeze erupts in Senate  —  The Alabama Republican's long-running protest of the Pentagon's abortion policy has blocked hundreds of senior officer promotions  —  The war in Gaza and a serious medical emergency suffered by the Marine Corps's top officer forced … ",
    "url": "https://www.washingtonpost.com/national-security/2023/11/01/tuberville-military-promotion-hold/"
  },
  {
    "text": "Second effort to expel George Santos from House fails  —  A motion to expel Rep. George Santos (R-N.Y.) from the House failed Wednesday evening, with New York Republicans taking the helm in an attempt to remove him over his public false statements and ongoing federal criminal case.",
    "url": "https://www.washingtonpost.com/politics/2023/11/01/george-santos-house-vote-fails/"
  },
  {
    "text": "Republicans help torpedo resolution to censure Tlaib over Israel criticism  —  House lawmakers voted Wednesday to torpedo a resolution censuring Rep. Rashida Tlaib (D-Mich.) for her harsh criticisms of Israel in the wake of Hamas's deadly attacks last month.",
    "url": "https://thehill.com/homenews/house/4288542-house-kills-rashida-tlaib-censure-vote/"
  },
  {
    "text": "Democrats scrap plans to vote on Greene censure resolution  —  House Democrats scrapped plans to vote on a resolution to censure Rep. Marjorie Taylor Greene (R-Ga.) on Wednesday, a last-minute move that came immediately after a coalition of Republicans joined with Democrats in torpedoing … ",
    "url": "https://thehill.com/homenews/house/4288627-democrats-scrap-plans-to-vote-on-greene-censure-resolution/"
  },
  {
    "text": "Trump 14th Amendment Disqualification Trial Can Continue, Judge Rules  —  Former President Donald J. Trump's team had argued that his words and actions leading up to the attack on the Capitol were protected by the First Amendment, and asked that the Colorado case be thrown out.",
    "url": "https://www.nytimes.com/2023/11/01/us/politics/trump-14th-amendment-case.html"
  },
  {
    "text": "What Is Happening With Mike Johnson's Money?  —  House Speaker Mike Johnson makes hundreds of thousands of dollars a year but apparently does not have a bank account, a new report revealed Wednesday.  —  Johnson was first elected in 2016 and has served on the Hill ever since.",
    "url": "https://newrepublic.com/post/176550/where-mike-johnson-money-bank-account"
  },
  {
    "text": "HBO Bosses Used ‘Secret’ Fake Accounts to Troll TV Critics  —  Casey Bloys ordered staffers to create fake accounts to fire back at critics, according to text conversations reviewed by Rolling Stone as part of a new lawsuit  —  I … Bloys — who was named HBO's CEO and chairman in October 2022 … ",
    "url": "https://www.rollingstone.com/tv-movies/tv-movie-features/hbo-casey-bloys-secret-twitter-trolls-tv-critics-leaked-texts-lawsuit-the-idol-1234867722/"
  },
  {
    "text": "Nancy Pelosi served subpoena related to California criminal case  —  It's unclear of the subpoena is related to the case concerning Paul Pelosi's 2022 home invasion attacker  —  Former House Speaker Nancy Pelosi, D-Calif., informed the House of Representatives on Wednesday that she was served a subpoena … ",
    "url": "https://www.foxnews.com/politics/nancy-pelosi-served-subpoena-california-criminal-case"
  },
  {
    "text": "IRS announces changes to 2024 retirement contribution limits  —  (NEXSTAR) - The Internal Revenue Service delivered good news for retirement savers Wednesday, announcing that the limit on contributions to 401(k) and other popular accounts will be higher in 2024.",
    "url": "https://thehill.com/homenews/nexstar_media_wire/4288041-irs-announces-changes-to-2024-retirement-contribution-limits/"
  },
  {
    "text": "A Virginia GOP State Rep. Built Her Political Career On A Story That Doesn't Add Up  —  Tara Durant claims an “angry mob” of Black Lives Matter protesters “assaulted” her car in 2020.  Newly obtained police reports suggest something different.  —  LOADING",
    "url": "https://www.huffpost.com/entry/tara-durant-black-lives-matter-protest-exaggerated_n_654143aae4b0ae2dc0b5a243"
  },
  {
    "text": "Netanyahu may not last, Biden and aides increasingly believe  —  The Israeli prime minister's political obituary has been written before.  But U.S. officials are already gauging potential successors.  —  Joe Biden and top aides have discussed the likelihood that Benjamin Netanyahu's political days … ",
    "url": "https://www.politico.com/news/2023/11/01/biden-administration-thinks-netanyahu-may-not-last-politically-00124849"
  },
  {
    "text": "Trump's Florida case timeline may need to be pushed back, Cannon says  —  FORT PIERCE, Fla. — The federal judge overseeing Donald Trump's indictment for allegedly mishandling national security secrets suggested at a hearing Wednesday that she might push back the planned trial timeline … ",
    "url": "https://www.washingtonpost.com/national-security/2023/11/01/trump-florida-trial-delay-cannon/"
  },
  {
    "text": "G.O.P.'s Buck Won't Seek Re-Election, Citing His Party's Election Denialism  —  Representative Ken Buck, one of eight Republicans who moved to oust Kevin McCarthy as speaker, said his split with his party was too wide to remain in the House.  Others are likely to follow.",
    "url": "https://www.nytimes.com/2023/11/01/us/politics/ken-buck-election-republicans.html"
  },
  {
    "text": "GOP senators told that Peter Meijer will launch a Michigan Senate bid  —  Sen. Todd Young (R-Ind.) told colleagues that he's heard the former House Republican will announce a campaign this week.",
    "url": "https://www.politico.com/live-updates/2023/11/01/congress/meijer-senate-todd-young-michigan-00124728"
  },
  {
    "text": "2024 Presidential Race Stays Static In The Face Of Major Events, Quinnipiac University National Poll Finds; RFK Jr. Receives 22% As Independent Candidate In 3-Way Race  —  mail_outline  —  Following a month marked by a war breaking out between Israel and Hamas, global tensions ratcheting up … ",
    "url": "https://poll.qu.edu/poll-release?releaseid=3881"
  },
  {
    "text": "Hamas Official Ghazi Hamad: We Will Repeat The October 7 Attack, Time And Again, Until Israel Is Annihilated; We Are Victims - Everything We Do Is Justified  —  Ghazi Hamad of the Hamas political bureau said in an October 24, 2023 show on LBC TV (Lebanon) that Hamas is prepared to repeat the October 7 … ",
    "url": "https://www.memri.org/tv/hamas-official-ghazi-hamad-we-will-repeat-october-seven-until-israel-annihilated-victims-everything-we-do-justified"
  },
  {
    "text": "Bob Knight Dies at 83: Donald Trump, Mike Woodson And Others React to Legendary Coach's Death  —  The legendary coach, who won three championship with Indiana, was known for his intensity, and his eccentric behavior on the sidelines  —  Former college basketball coach Bob Knight died at age 83, his family announced on Wednesday.",
    "url": "https://themessenger.com/sports/bob-knight-dies-donald-trump-mike-woodson-and-others-react-to-legendary-coachs-death"
  },
  {
    "text": "American Ornithological Society Will Change the English Names of Bird Species Named After People … FOR IMMEDIATE RELEASE  —  Contact:  media@americanornithology.org  —  CHICAGO (November 1, 2023)—Today the American Ornithological Society (AOS) announced that in an effort to address past wrongs … ",
    "url": "https://americanornithology.org/american-ornithological-society-will-change-the-english-names-of-bird-species-named-after-people/"
  },
  {
    "text": "Migrants are behind boom in NYC's red-light district, Eric Adams says  —  Mayor Eric Adams has blamed the rise in prostitution in a Queens neighborhood on an influx of female Venezuelan migrants who are struggling to find other work in the Big Apple.  —  Hizzoner said the surge in “illegal” … ",
    "url": "https://nypost.com/2023/11/01/news/migrants-are-behind-boom-in-queens-red-light-district-adams-says/"
  },
  {
    "text": "After Years of Vowing to Destroy Israel, Iran Faces a Dilemma  —  With Israel bent on crushing Iran's ally Hamas, Tehran must decide whether it and the proxy militias it arms and trains will live up to its fiery rhetoric.  —  For more than four decades, Iran's rulers have pledged to destroy Israel.",
    "url": "https://www.nytimes.com/2023/11/01/world/middleeast/iran-israel-hamas.html"
  }
]