[
  {
    "text": "Donald Trump: UAW negotiations 'don't mean as much as you think'  —  Clinton Township — Republican Donald Trump railed against electric vehicles during a campaign stop in suburban Detroit Wednesday night, saying they're too expensive, aren't capable of traveling far enough and would spur job losses for Americans.",
    "url": "https://www.detroitnews.com/story/news/politics/2023/09/27/donald-trump-returns-auto-industry-strike-uaw-ev-taking-center-stage-presidential-election-joe-biden/70960155007/"
  },
  {
    "text": "EXCLUSIVE: Trump Rips RNC, Says They Have To Stop Debates … In an exclusive sit-down interview with the Daily Caller, Trump said there would not be a breakout candidate and the debates are bad for the Republican Party.  —  “They have to stop the debates.  Because it is just bad for the Republican Party.",
    "url": "https://dailycaller.com/2023/09/28/exclusive-trump-rips-rnc-stop-debates/"
  },
  {
    "text": "Trump demands union support for nationalist vision, warns of doom otherwise  —  Trump's speech in Michigan opposite the GOP debate marked the unofficial kickoff of a general election rematch with President Biden  —  CLINTON TOWNSHIP, Mich. — Former president Donald Trump sharpened … ",
    "url": "https://www.washingtonpost.com/politics/2023/09/27/trump-detroit-strike-autoworkers/"
  },
  {
    "text": "It's not just a shutdown — Congress has no plan for the FAA either  —  The airline sector is staring down an authorization and funding lapse amid congressional paralysis.  —  It's not just a broader government shutdown.  By Sunday, the aviation system could also have almost … ",
    "url": "https://www.politico.com/news/2023/09/28/congress-faa-lapse-government-shutdown-00118718"
  },
  {
    "text": "McCarthy's Hail Mary: Strip Ukraine aid and finally pass Pentagon spending bill  —  Pulling the funding marks another reversal for the speaker, who opted to keep it in over the weekend.  —  House Republicans are making another run at yanking Ukraine aid from a Pentagon spending bill … ",
    "url": "https://www.politico.com/news/2023/09/28/kevin-mccarthy-ukraine-aid-pentagon-bill-00118723"
  },
  {
    "text": "My expectations for the debate were low, but holy crap  —  Republican also-rans put their unreadiness for prime time on full display. … The first thing to understand about the Republican primary is that it's not really a contest.  It's over.  It's been over for months now.  It was never even really in doubt.",
    "url": "https://www.publicnotice.co/p/gop-debate-fox-business-simi-valley-yikes"
  },
  {
    "text": "Why not Nikki Haley?  —  Of the Republican 2024 contenders, Nikki Haley, former ambassador to the United Nations and former governor of South Carolina, sticks out for all the right reasons.  Haley carries with her the kind of experience that is invaluable and not easily replicated.",
    "url": "https://www.washingtonexaminer.com/opinion/why-not-nikki-haley"
  },
  {
    "text": "Kari Lake to Announce Senate Run, Setting Up High-Stakes Arizona Race  —  Republican will launch her campaign at Oct. 10 rally; three-way race with independent Kyrsten Sinema and Democrat Ruben Gallego is likely  —  PHOENIX—Kari Lake will announce a run for Kyrsten Sinema's Senate seat next month … ",
    "url": "https://www.wsj.com/politics/elections/kari-lake-to-announce-senate-run-setting-up-high-stakes-arizona-race-30ff1594?mod=followamazon"
  },
  {
    "text": "Justice Dept. Accuses Trump Lawyers of Dragging Their Feet in Documents Case  —  Prosecutors said the former president's defense team was trying to use an arcane law to derail the scheduled start of his trial on charges of mishandling classified material and obstructing justice.",
    "url": "https://www.nytimes.com/2023/09/28/us/politics/trump-documents-justice-department.html"
  },
  {
    "text": "Bombshell: Ways and Means Releases New Documents Revealing Hunter Biden Selling Access to White House, Investigators Blocked from Pursuing Evidence Related to President Biden  —  WASHINGTON, D.C. - New documents released by the Ways and Means Committee today reveal Joe Biden's connections to his son Hunter Biden's business dealings.",
    "url": "https://waysandmeans.house.gov/bombshell-ways-and-means-releases-new-documents-revealing-hunter-biden-selling-access-to-white-house-investigators-blocked-from-pursuing-evidence-related-to-president-biden/"
  },
  {
    "text": "Christie defends attack on Jill Biden: 'That's the truth'  —  “I am standing by the wording,” Chrstie said.  —  Chris Christie stood by his attack on first lady Jill Biden the morning after the second GOP debate, saying that his remarks were “the truth.”  —  On Wednesday night … ",
    "url": "https://www.politico.com/news/2023/09/28/republican-debate-christie-jill-biden-00118712"
  },
  {
    "text": "Donald Trump, Don Jr., Ivanka and Eric Trump, Plus Michael Cohen, Listed as New York AG's Witnesses in Civil Fraud Case  —  Donald Trump and his company are expected to stand trial starting Monday in a $250 million civil case brought by AG Letitia James  —  A Facebook icon representing … ",
    "url": "https://themessenger.com/politics/trump-ivanka-eric-donjr-michael-cohen-civil-fraud-trial-witnesses"
  },
  {
    "text": "New data on ultra-rich tax cheats wrecks the ‘working-class GOP’ ruse  —  Republicans have been amplifying the claim lately that their party has undergone a “populist” makeover, rendering it both anti-elite and pro-working class.  One way Republicans purport to illustrate … ",
    "url": "https://www.washingtonpost.com/opinions/2023/09/28/wealthy-tax-avoidance-ron-wyden-data/"
  },
  {
    "text": "Senate adopts resolution requiring men to wear business attire on chamber floor  —  The Senate on Wednesday adopted a resolution requiring male senators to wear a coat, tie and slacks or other long pants on the chamber's floor following days of upheaval sparked by Senate Majority Leader Charles … ",
    "url": "https://www.washingtonpost.com/politics/2023/09/27/senate-dress-code-change/"
  },
  {
    "text": "Germany bans decades-old neo-Nazi group Artgemeinschaft, accused of trying to “raise new enemies” of the state  —  Berlin — German police raided the homes of 39 members of an extremist far-right group with neo-Nazi links Wednesday after it was banned in the country.",
    "url": "https://www.cbsnews.com/news/germany-neo-nazi-artgemeinschaft-group-banned-police-raid-homes/"
  },
  {
    "text": "Majority of voters oppose Biden impeachment hearings as GOP inquiry begins  —  A new national NBC News survey finds 56% of registered voters believe Congress should not move forward with impeachment hearings.  —  House Republicans kick off their impeachment inquiry against President Joe Biden on Thursday … ",
    "url": "https://www.nbcnews.com/politics/2024-election/majority-voters-oppose-biden-impeachment-hearings-gop-inquiry-begins-rcna117668"
  }
]