[
  {
    "text": "Trump's lawsuit against ABC is not the flex he thinks it is  —  In a sane world, the underlying facts would be disqualifying. … As if Trump wasn't already spending enough donor money defending himself against a truly staggering number of civil and criminal lawsuits, he just inexplicably decided … ",
    "url": "https://www.publicnotice.co/p/trump-defamation-lawsuit-abc-stephanopoulos"
  },
  {
    "text": "Letitia James Is Prepared to Seize One of Trump's Favorite Assets  —  Donald Trump has just days left to post the nearly half-billion-dollar bond in his New York civil fraud case before the state attorney general can start seizing his assets, and Letitia James seems to know exactly where she wants to start: Westchester.",
    "url": "https://newrepublic.com/post/180032/new-york-letitia-james-seize-trump-assets-westchester"
  },
  {
    "text": "CNN Polls: Majority of voters in Michigan and Pennsylvania are dissatisfied with their presidential choices  —  Voters in Michigan and Pennsylvania - two states that flipped from red to blue in the 2020 presidential election - begin this year's general election campaign more dissatisfied … ",
    "url": "https://www.cnn.com/2024/03/22/politics/cnn-poll-michigan-pennsylvania/"
  },
  {
    "text": "Trump canceled a rally in Arizona because his campaign was too broke: report  —  Former President Donald Trump is facing mounting financial difficulties in his campaign — to the point where he is reportedly being forced to triage which states he can afford to hold rallies in.",
    "url": "https://www.rawstory.com/trump-rally-cost/"
  },
  {
    "text": "Trump's invite to major donors prioritizes the committee paying his legal bills over the RNC  —  Donald Trump's new joint fundraising agreement with the Republican National Committee directs donations to his campaign and a political action committee that pays the former president's legal bills … ",
    "url": "https://apnews.com/article/trump-campaign-fundraising-rnc-c0e8f1e7b59f70c5237e13a3462e5790"
  },
  {
    "text": "Joint committee allows Trump to raise money for legal bills, huge checks for RNC  —  The Trump 47 Committee can raise up to $814,600, according to a donor form obtained by The Washington Post  —  New Federal Election Commission filings this week illustrated the tremendous burden … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/21/trump-joint-fundraising-committee-rnc/"
  },
  {
    "text": "Inside Garland's Effort to Prosecute Trump  —  In trying to avoid even the smallest mistakes, Attorney General Merrick B. Garland might have made one big one: ending up in a race against the clock.  —  After being sworn in as attorney general in March 2021, Merrick B. Garland gathered … ",
    "url": "https://www.nytimes.com/2024/03/22/us/politics/trump-jan-6-merrick-garland.html"
  },
  {
    "text": "House Republicans Want to Ban Universal Free School Lunches  —  On Wednesday, the Republican Study Committee, of which some three-quarters of House Republicans are members, released its 2025 budget entitled “Fiscal Sanity to Save America.”  Tucked away in the 180-page austerity manifesto … ",
    "url": "https://theintercept.com/2024/03/21/house-republicans-ban-universal-school-lunches/"
  },
  {
    "text": "Ken Buck becomes first Republican to sign Democrats' discharge petition for Ukraine aid  —  Rep. Ken Buck (Colo.) became the first GOP member to sign the House Democrats' aid discharge position on Thursday, just one day before he is set to retire from Congress.",
    "url": "https://thehill.com/homenews/house/4548713-ken-buck-becomes-first-republican-to-sign-democrats-discharge-petition-for-ukraine-aid/"
  },
  {
    "text": "Congressman apologizes for using racial slur instead of saying ‘bugaboo’  —  U.S. Senate hopeful Rep. David Trone (D-Md.) made the comment while discussing tax rates in a budget hearing  —  Senate hopeful Rep. David Trone (D) used a racial slur during a congressional budget hearing Thursday … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2024/03/21/david-trone-congress-racial-insult/"
  },
  {
    "text": "US urged Ukraine to halt strikes on Russian oil refineries  —  Washington told Kyiv that drone attacks risk driving up crude prices and provoking retaliation  —  The US has urged Ukraine to halt attacks on Russia's energy infrastructure, warning the drone strikes risk driving up global oil prices … ",
    "url": "https://www.ft.com/content/98f15b60-bc4d-4d3c-9e57-cbdde122ac0c"
  },
  {
    "text": "House Republicans Resurrect Plan to Gut Social Security and Medicare  —  While progressive politicians and unions are fighting to grant Americans four-day workweeks, Republicans are looking to achieve the complete opposite.  —  On Wednesday, the Republican Study Committee … ",
    "url": "https://newrepublic.com/post/180029/house-republicans-plan-raise-retirement-age-social-security"
  },
  {
    "text": "House Republicans sue Justice Department tax attorneys in Hunter Biden probe  —  The lawsuit seeks to compel Mark Daly and Jack Morgan to take part in interviews with a Republican-led panel.  —  The House Judiciary Committee sued a pair of Justice Department attorneys Thursday in an effort … ",
    "url": "https://www.nbcnews.com/politics/congress/house-republicans-sue-justice-department-attorneys-hunter-biden-probe-rcna144567"
  },
  {
    "text": "Leonard Leo, Koch networks pour millions into groups prepping for potential second Trump administration  —  A review by the progressive advocacy group Accountable.US shows $55 million flowing from Leo- and Koch-backed groups.  —  WASHINGTON — Huge funding from influential conservative donor networks … ",
    "url": "https://www.nbcnews.com/politics/2024-election/leonard-leo-koch-networks-pour-millions-prep-potential-second-trump-ad-rcna144360"
  },
  {
    "text": "U.S. to Present Gaza Cease-Fire Resolution at U.N. Security Council  —  A resolution for the U.N. that American diplomats are circulating was notable for its strong language in seeking a cease-fire in Gaza and the release of hostages.  —  Secretary of State Antony J. Blinken … ",
    "url": "https://www.nytimes.com/2024/03/21/world/middleeast/gaza-blinken-ceasefire.html"
  },
  {
    "text": "Sen. Menendez, who is facing corruption charges, won't seek reelection as a Democrat  —  Sen. Bob Menendez, D-N.J., who is fighting federal corruption charges, said Thursday that he will not file to run for reelection in the Democratic primary but added he hopes to be exonerated and run as an independent.",
    "url": "https://npr.org/2024/03/21/1240044252/robert-menendez-reelection"
  }
]