[
  {
    "text": "The Truth About Trump's RNC Shakeup—and Why the GOP Will Suffer  —  A shakeup at the RNC may mean less money for anyone not named Donald Trump.  And that's terrible news for state parties desperate for cash. … Donald Trump doesn't want his snowballing legal troubles to just be his problem … ",
    "url": "https://www.thedailybeast.com/the-truth-about-trumps-rnc-shakeupand-why-the-gop-will-suffer"
  },
  {
    "text": "Republicans Are Acting Like 2024 Is Their Last Campaign  —  It's understandable that Donald Trump regards the 2024 election as his final shot at redemption after a 2020 defeat he still cannot admit.  In August, he will very likely become a three-time presidential nominee at the age of 78.",
    "url": "https://nymag.com/intelligencer/article/republicans-are-acting-like-the-2024-election-is-their-last.html"
  },
  {
    "text": "Spare Us Lara Trump  —  Well, that was fast!  Donald Trump is not yet the Republican nominee for president, but already we're witnessing a resurgence of the in-your-face nepotism that brought us last decade's cringe-worthy reality show: Javanka in the West Wing.",
    "url": "https://www.nytimes.com/2024/02/15/opinion/donald-trump-family.html"
  },
  {
    "text": "McConnell defends push for Ukraine aid amid attacks from Trump wing of GOP: ‘Every argument against this is wrong’  —  Senate GOP Leader Mitch McConnell strongly defended his handling of a foreign aid package and bipartisan border security deal under heavy criticism from his right flank … ",
    "url": "https://www.cnn.com/2024/02/14/politics/mitch-mcconnell-foreign-aid/"
  },
  {
    "text": "Scoop: Hur making plans to testify to GOP panel about Biden … - Biden, his White House and his personal lawyer have been bashing Hur over his report, which cleared Biden of criminal wrongdoing but painted the president, 81, as having “diminished faculties” and a “poor memory.”",
    "url": "https://www.axios.com/2024/02/15/robert-hur-congress-testimony-biden-memory"
  },
  {
    "text": "Biden Must Win.  But How?  —  Like many Democrats, I'm stuck on a doomsday merry-go-round: Joe Biden shouldn't be running for president.  Joe Biden is running for president.  Donald Trump shouldn't be running for president.  Donald Trump is running for president.  —  But this isn't 2020.",
    "url": "https://www.nytimes.com/2024/02/15/opinion/biden-2024-election.html"
  },
  {
    "text": "Trump's first criminal trial will start March 25, judge says  —  The schedule means Trump will spend weeks in court instead of on the campaign trail.  —  Former President Donald Trump's first criminal trial will start on March 25 as scheduled, a judge said in New York on Thursday as he denied Trump's attempts to throw out the charges.",
    "url": "https://www.politico.com/news/2024/02/15/trump-hush-money-criminal-case-hearing-update-00141621"
  },
  {
    "text": "The investigation that led to the charges spanned nearly five years.  —  Ruling that the case against Donald J. Trump can proceed, Justice Juan M. Merchan said he planned to begin the trial on March 25.  —  A judge rejected a bid to toss the hush-money case.  Here's the latest.",
    "url": "https://www.nytimes.com/live/2024/02/15/nyregion/trump-manhattan-criminal-case"
  },
  {
    "text": "Judge Rules Full Speed Ahead on Trump's Manhattan Criminal Trial  —  Donald Trump tried to avoid trial in Manhattan for covering up his hush money payment to Stormy Daniels, but a judge on Thursday said it's going forward in March as planned.  —  Donald Trump will face trial next month … ",
    "url": "https://www.thedailybeast.com/judge-rules-full-speed-ahead-on-trumps-manhattan-criminal-trial"
  },
  {
    "text": "2/15/24 ☀️ Punchbowl News AM … Just this week, Speaker Mike Johnson has: … This is the most chaotic, inefficient and ineffective majority we've seen in decades covering Congress.  It started this way under former Speaker Kevin McCarthy and has gotten worse under Johnson.",
    "url": "https://punchbowl.news/archive/21524-punchbowl-news-am/"
  },
  {
    "text": "Conservative group tells judge it has no evidence to back its claims of Georgia ballot stuffing  —  A conservative group has told a Georgia judge that it doesn't have evidence to support its claims of illegal ballot stuffing during the the 2020 general election and a runoff two months later.",
    "url": "https://apnews.com/article/georgia-elections-true-vote-ballot-stuffing-199113b47bc2df79c63fdf007cd23115"
  },
  {
    "text": "The final repudiation of ‘2000 Mules’  —  Since Donald Trump left office in January 2021, there has been no more influential presentation of his theory that the election was stolen than the film “2000 Mules,” created by activist — and Trump pardon recipient — Dinesh D'Souza.",
    "url": "https://www.washingtonpost.com/politics/2024/02/15/dsouza-2000-mules-repudiation/"
  },
  {
    "text": "Tucson school district drops instructor after OnlyFans exposure  —  The woman who resigned as head of an NAACP chapter in 2015 after mispresenting herself as Black, Rachel Dolezal, was working for the Catalina Foothills Unified School District until its officials learned Tuesday of social media content under her current name.",
    "url": "https://tucson.com/news/local/education/precollegiate/rachel-dolezal-tucson-catalina-foothills-school-district-onlyfans/article_7adc55f6-cb6e-11ee-8803-3bcd55b84f0c.html"
  },
  {
    "text": "The Trauma of the Trump Years Is Being Rewritten  —  Americans rehabilitate ex-presidents all the time.  —  It was fascinating to see the rebranding of George W. Bush — the man who took us into the disastrous Iraq war and horribly bungled the response to Hurricane Katrina … ",
    "url": "https://www.nytimes.com/2024/02/14/opinion/trump-years-rewritten.html"
  },
  {
    "text": "Trump hearings in N.Y., Georgia on Thursday as trial schedule comes into focus  —  The former president is expected at a pre-trial conference in Manhattan, while some of his lawyers will be at Atlanta hearing focused on D.A. Fani Willis  —  Donald Trump is expected at the defendant's table … ",
    "url": "https://www.washingtonpost.com/politics/2024/02/14/trump-hearings-new-york-atlanta-fani-willis/"
  },
  {
    "text": "Democrats look to Nebraska to shore up Biden's blue wall  —  Population shifts since 2020 have decreased the power of Wisconsin, Michigan and Pennsylvania to guarantee Democratic victory  —  The Democratic Party's blue wall around the Great Lakes has sprung a leak since the 2020 Census.",
    "url": "https://www.washingtonpost.com/politics/2024/02/15/nebraska-biden-electoral-college/"
  },
  {
    "text": "Adam Schiff steps out on climate  —  He's the first of the leading candidates for California's open Senate seat to release a detailed platform.  —  Rep. Adam Schiff on Thursday proposed ending federal subsidies for oil and gas production, offering federal wildfire insurance … ",
    "url": "https://www.politico.com/news/2024/02/15/schiff-steps-out-on-climate-00141599"
  },
  {
    "text": "US Cancels Multibillion-Dollar Classified Military Satellite Program  — Contractor discloses Space Force ‘termination for convenience’  — Cancellation driven by cost, payload performance, people say  —  The US Space Force canceled a multibillion-dollar Northrop Grumman Corp. program … ",
    "url": "https://www.bloomberg.com/news/articles/2024-02-15/us-space-force-cancels-northrop-s-multibillion-dollar-military-satellite"
  },
  {
    "text": "Updated: Incident at National Archives Rotunda Closes Galleries to Public  —  Press Release  —  The National Archives Rotunda and galleries in Washington, DC, closed to the public today after two individuals dumped red powder on the encasement protecting the U.S. Constitution at approximately 2:30 pm.",
    "url": "https://www.archives.gov/press/press-releases/2024/nr24-14"
  }
]