[
  {
    "text": "Court hears arguments on whether Steve Bannon should be begin prison sentence  —  The former Trump adviser was sentenced to four months in prison for refusing to comply with Jan. 6 Committee subpoenas, but it had been put on hold while he appealed.  —  WASHINGTON — A federal judge … ",
    "url": "https://www.nbcnews.com/politics/justice-department/court-hears-arguments-whether-steve-bannon-begin-prison-sentence-rcna155209"
  },
  {
    "text": "Exclusive: Biden tells Muir he wouldn't pardon son Hunter, says Trump got ‘fair trial’  —  Biden is in Normandy commemorating the 80th anniversary of D-Day.  —  ABC News' David Muir sat down exclusively with President Joe Biden in Normandy, France, on the 80th anniversary of D-Day on June 6, 2024.",
    "url": "https://abcnews.go.com/Politics/biden-tells-muir-wouldnt-pardon-son-hunter/story?id=110904482"
  },
  {
    "text": "Alex Jones agrees to liquidate his assets to pay Sandy Hook families, in move that would end his ownership of Infowars  —  Right-wing conspiracy theorist Alex Jones on Thursday moved to liquidate his personal assets, agreeing to demands from the families of Sandy Hook victims whom he owes … ",
    "url": "https://www.cnn.com/2024/06/06/media/alex-jones-assets-sandy-hook/"
  },
  {
    "text": "Revisiting “the biggest political crime in American history, by far”  —  Remember “Obamagate”?  You should. … It's tough to remember now as Donald Trump regularly wails about the need for total presidential immunity, but four years ago, the then-president was a huge proponent of prosecuting presidents.",
    "url": "https://www.publicnotice.co/p/trump-obamagate-revisited-presidential-immunity"
  },
  {
    "text": "Tesla CEO Elon Musk could leave if $56 billion pay package not approved, shareholders warned … Tesla board chair Robyn Denholm is calling on the company's shareholders to approve Elon Musk's massive $56 billion pay package or risk driving the billionaire CEO to greener pastures.",
    "url": "https://www.theverge.com/2024/6/6/24173064/tesla-board-chair-warn-elon-musk-leave-pay-shareholders"
  },
  {
    "text": "The Hunter Biden Case Is Solid.  There's Something Rotten About It Too.  —  WILMINGTON, Delaware — The line between criminal prosecution and public flogging was hard to detect this week when federal prosecutors began their case against Hunter Biden for allegedly buying a gun in 2018 while addicted to drugs.",
    "url": "https://www.politico.com/news/magazine/2024/06/07/hunter-biden-trial-truths-column-00162083"
  },
  {
    "text": "DeSantis high court majority: DeSantis can easily oust people's elected prosecutors  —  On a 6-1 vote Thursday, the Florida Supreme Court gave its governor all-but-unfettered power to remove locally elected prosecutors — a power that could quickly render Floridians' “freedom” to “vote” … ",
    "url": "https://www.lawdork.com/p/desantis-worrell-florida-supreme-court"
  },
  {
    "text": "ERO Boston apprehends Colombian national charged with sex crimes against Rhode Island resident  —  PROVIDENCE, R.I. — Enforcement and Removal Operations Boston arrested an unlawfully present Colombian national charged with four counts of sexual assault and one count of assaulting someone with a mental handicap.",
    "url": "https://www.ice.gov/news/releases/ero-boston-apprehends-colombian-national-charged-sex-crimes-against-rhode-island"
  },
  {
    "text": "Milwaukee-based retail giant Kohl's says ‘No’ to sponsoring Republican convention events … Milwaukee based department store giant Kohl's says it will not sponsor any events related to the Republican National Convention in that city this summer, where Donald Trump will be crowned the party's nominee for president.",
    "url": "https://www.cnbc.com/2024/06/06/kohls-donation-trump-republican-national-convention.html"
  },
  {
    "text": "Scoop: Justice Brett Kavanaugh plans legal memoir … - Kavanaugh originally signed a contract with Regnery Publishing, a leading conservative house.  — But after Regnery was sold to Skyhorse Publishing in December, the project moved to the Center Street imprint at Hachette Book Group.",
    "url": "https://www.axios.com/2024/06/06/scotus-brett-kavanaugh-writing-book-memoir"
  },
  {
    "text": "Biden's D-Day Speech Nailed the Threat of Modern Fascism  —  80 YEARS ON  —  Speaking on sacred ground in Normandy, the president correctly drew parallels between America's enemies in World War II and the threats we face domestically and globally today.",
    "url": "https://www.thedailybeast.com/bidens-d-day-speech-nailed-the-threat-of-modern-fascism"
  },
  {
    "text": "New York Democrat congressional candidate suggests MAGA supporters go to ‘re-education camp’  —  Democrat candidate Paula Collins is running against GOP Rep. Elise Stefanik for New York's 21st congressional district  —  EXCLUSIVE: The New York Democratic congressional candidate running … ",
    "url": "https://www.foxnews.com/politics/new-york-democrat-congressional-candidate-suggests-maga-supporters-go-re-education-camp?intcmp=tw_fnc"
  },
  {
    "text": "Rishi Sunak apologizes for skipping D-Day event to do TV interview  —  LONDON — Rishi Sunak apologized after he ditched D-Day commemorations in France to do a TV interview instead — sparking a furious backlash.  —  The Conservative prime minister, who is fighting to stay in office ahead … ",
    "url": "https://www.politico.eu/article/uk-rishi-sunak-apologizes-dday-80-years-commemorations-backlash-tv-interview/"
  },
  {
    "text": "Vermont GOP rules bar it from promoting any candidate who is a ‘convicted felon’  —  The party can vote to exempt a candidate, but it so far appears to be following the rule.  —  The Vermont Republican Party is prohibited from backing a candidate with a felony conviction, according to the party's publicly posted rules.",
    "url": "https://www.nbcnews.com/politics/2024-election/vermont-republican-party-rules-bar-convicted-felon-trump-rcna155918"
  },
  {
    "text": "Trump search for a VP candidate narrows, with senators dominating list  —  At least eight people have been asked to provide documents to the campaign.  —  Donald Trump's search for a vice-presidential running mate has reached a more intensive phase, with his campaign requesting documents … ",
    "url": "https://www.washingtonpost.com/politics/2024/06/06/trump-vice-president-list/"
  },
  {
    "text": "Trump Can't Carry a Gun, but He Might Have the Nuclear Codes Again  —  FEDERALISM FOLLIES  —  Donald Trump's losing his NYC concealed carry permit, an emblematic example of the wackiness of the American system. … Donald Trump's license to carry a gun is about to be revoked … ",
    "url": "https://www.thedailybeast.com/trump-cant-carry-a-gun-but-he-might-have-the-nuclear-codes-again"
  },
  {
    "text": "Mike Johnson is likely safe through the election, one of his GOP detractors says  —  Rep. Thomas Massie, R-Ky., told NBC News he doesn't expect another motion to oust the speaker to come up before the election, but maintained that he should be replaced.  —  WASHINGTON — Rep. Thomas Massie … ",
    "url": "https://www.nbcnews.com/politics/congress/mike-johnson-likely-safe-election-one-gop-detractors-says-rcna155744?taid=6662316bacd5750001e06236"
  },
  {
    "text": "Israeli Prime Minister Benjamin Netanyahu to address Congress on July 24  —  Washington — Israeli Prime Minister Benjamin Netanyahu will address a joint meeting of Congress on July 24, multiple sources told CBS News.  —  The top four leaders of the House and Senate formally invited Netanyahu last week … ",
    "url": "https://www.cbsnews.com/news/netanyahu-congress-address-july-24/"
  },
  {
    "text": "Supreme Court Justice Clarence Thomas accepted gifts worth millions of dollars over 20 years, analysis finds … Supreme Court Justice Clarence Thomas accepted millions of dollars' worth of gifts over the past two decades on the bench, a total nearly 10 times the value of all gifts received … ",
    "url": "https://www.cnbc.com/2024/06/06/supreme-court-justices-millions-dollars-gifts-clarence-thomas.html"
  },
  {
    "text": "George Clooney called White House to defend wife's work on Israel warrants  —  Biden had sharply criticized a move by the International Criminal Court to issue warrants for Israeli leaders.  —  Academy Award-winning actor George Clooney called one of President Biden's top aides last month … ",
    "url": "https://www.washingtonpost.com/politics/2024/06/06/george-clooney-biden-criminal-court-israel/"
  },
  {
    "text": "YouTuber's Wacko Lamborghini Stunt Ends in Federal Charges  —  FROM CLICKS TO CLINK  —  He took aim at a $300,000 Italian supercar from a helicopter with an arsenal of fireworks onboard.  —  What's more American than celebrating July 4 by taking aim at a $300,000 Italian supercar … ",
    "url": "https://www.thedailybeast.com/youtuber-alex-chois-wacko-lamborghini-stunt-ends-in-federal-charges"
  },
  {
    "text": "Alito's former neighbor says justice is ‘at best mistaken’ in flap over upside-down US flag  —  A former neighbor of Supreme Court Justice Samuel Alito on Wednesday disputed his account of a neighborhood spat that led to the hoisting of an upside-down US flag on his property in Virginia … ",
    "url": "https://www.cnn.com/2024/06/05/politics/alito-former-neighbor-flags-cnntv/"
  }
]