[
  {
    "text": "Trump lagging in early vote with seniors in Pennsylvania, a red flag for GOP  —  Democrats account for about 58 percent of the votes cast by seniors so far in Pennsylvania.  —  Donald Trump is lagging Kamala Harris in Pennsylvania early voting with a critical and once-reliably Republican constituency: seniors.",
    "url": "https://www.politico.com/news/2024/10/31/trump-lagging-early-votes-seniors-pennsylvania-00186612"
  },
  {
    "text": "Five of the Election's Biggest Unanswered Questions  —  Every presidential election appears to pose one big question—who will win?—that is in fact made up of countless smaller questions: How do voters really behave?  Which old rules of politics still apply, and which are obsolete?",
    "url": "https://www.theatlantic.com/politics/archive/2024/11/election-2024-five-questions/680474/"
  },
  {
    "text": "Conservatives in furor over Julia Roberts ad  —  A new Harris-Walz campaign ad voiced by actor Julia Roberts encourages women to vote for Vice President Harris in the presidential election, even if their husbands are backing former President Trump.  —  The Roberts ad also alludes to abortion rights … ",
    "url": "https://thehill.com/homenews/campaign/4964265-kamala-harris-ad-julia-roberts/"
  },
  {
    "text": "“It is so disastrous”: MAGA men are freaking out that wives may be secretly voting for Kamala Harris  —  “That's the same thing as having an affair,” Fox News host argues as women fuel early vote in key states  —  When you're a star, Donald Trump has said more than once, women will let you do whatever you want to them.",
    "url": "https://www.salon.com/2024/10/31/it-is-so-disastrous-maga-men-are-freaking-out-that-wives-may-be-secretly-voting-for-kamala-harris/"
  },
  {
    "text": "AP sources: White House altered record of Biden's ‘garbage’ remarks despite stenographer concerns  —  White House press officials altered the official transcript of a call in which President Joe Biden appeared to take a swipe at supporters of Donald Trump, drawing objections from the federal workers … ",
    "url": "https://apnews.com/article/biden-garbage-transcript-puerto-rico-trump-326e2f516a94a470a423011a946b6252"
  },
  {
    "text": "Trump's ‘grab them’ comment was history.  Now TikTok is showing it to young voters.  —  As the audio clip circulates on the popular video app, Gen Z users are expressing their shock.  —  It's been eight years since leaked audio from a conversation between Donald Trump and TV host Billy Bush … ",
    "url": "https://www.washingtonpost.com/technology/2024/10/31/tiktok-trump-access-hollywood-gen-z/"
  },
  {
    "text": "Trump picks one-judge Texas court for lawsuit over CBS Harris interview  —  A spokesperson for CBS News called the lawsuit “completely without merit” and said “60 Minutes” fairly presented the interview of Kamala Harris.  —  Republican nominee Donald Trump sued CBS News on Thursday … ",
    "url": "https://www.washingtonpost.com/politics/2024/10/31/trump-sues-60-minutes-cbs-kamala-harris/"
  },
  {
    "text": "A Pregnant Teenager Died After Trying to Get Care in Three Visits to Texas Emergency Rooms  —  It took three ER visits and 20 hours before a hospital admitted Nevaeh Crain, 18, as her condition worsened.  Doctors insisted on two ultrasounds to confirm “fetal demise.”",
    "url": "https://www.propublica.org/article/nevaeh-crain-death-texas-abortion-ban-emtala"
  },
  {
    "text": "'There's no white knight coming': Federal authorities will face limits responding to 2024 election lies  —  Federal law enforcement agencies are preparing for domestic and foreign election threats, but they're limited by law and already mistrusted by Donald Trump's supporters.",
    "url": "https://www.nbcnews.com/politics/2024-election/federal-authorities-face-limits-responding-2024-election-liesee-rcna177356?taid=67249e7461a8fb00017ee08c"
  },
  {
    "text": "Harris keeps bringing in new money as Trump struggles to grow his donor base  —  Kamala Harris' fundraising operation has been so dominant that she has brought in more new donors than Donald Trump every single day heading into the final stretch of the election.",
    "url": "https://www.politico.com/live-updates/2024/11/01/2024-elections-live-coverage-updates-analysis/trump-harris-donor-gap-00186687"
  },
  {
    "text": "Haley still on standby as clock ticks down  —  With only four days until the election, the clock is ticking for Donald Trump to engage Nikki Haley on the campaign trail — if he even wants to at all.  Haley, the last Republican candidate to drop out during the primaries, has said that she remains on “standby” for the Trump campaign.",
    "url": "https://www.politico.com/live-updates/2024/10/31/2024-elections-live-coverage-updates-analysis/haley-on-standby-00186641"
  },
  {
    "text": "Trump actually treats Puerto Rico like garbage  —  The disastrous “joke” was more than that. … ❄️ Subscribe to Public Notice ❄️  —  “Nobody loves our Latino community and our Puerto Rican community more than I do” Donald Trump blathered at a rally in Allentown, Pennsylvania, earlier this week.",
    "url": "https://www.publicnotice.co/p/trump-puerto-rico-garbage-maria-paper-towels"
  },
  {
    "text": "Listen to Jeffrey Epstein Spill Intel on Donald Trump's White House  —  OH LORDY  —  A new recording captures Epstein dishing on Trump.  —  Michael Wolff, the explosive chronicler of Donald Trump's four years in the White House, has released what he says is a recording of Jeffrey Epstein … ",
    "url": "https://www.thedailybeast.com/listen-to-jeffrey-epstein-spill-intel-on-donald-trumps-white-house-on-tape-released-by-author-michael-wolff/"
  },
  {
    "text": "Election fact check: Trump, Harris on transgender issues  —  Trans issues have played a key role in the Republican campaign.  —  Republican presidential nominee former President Donald Trump watches a video featuring Democratic presidential nominee Vice President Kamala Harris as he speaks … ",
    "url": "https://abcnews.go.com/Politics/election-fact-check-transgender-issues-trump-harris/story?id=115349047"
  },
  {
    "text": "Democrats have tried hard to block third-party candidates.  They could still be spoilers  —  “Democrats are taking nothing for granted,” one Democrat said.  —  Green Party presidential nominee Jill Stein speaks during a rally in Dearborn, Michigan, October 6, 2024.",
    "url": "https://abcnews.go.com/Politics/democrats-hard-block-party-candidates-spoilers/story?id=115273808"
  },
  {
    "text": "Johnson, facing uncertain future, seeks to save House GOP  —  BETHLEHEM, Pa. — Speaker Mike Johnson (R-La.), in an interview with The Hill from the campaign trail in Pennsylvania, said he “probably underestimated” just how much work it would be to lead the House GOP's massive political operation.",
    "url": "https://thehill.com/homenews/house/4964967-speaker-mike-johnson-house-majority-election/"
  },
  {
    "text": "Close races in Rust Belt states, polls show  —  More swing-state polls, more margin-of-error races.  Marist College is out Friday with new surveys in the three Blue Wall battlegrounds — Michigan, Pennsylvania and Wisconsin — showing neither Kamala Harris nor Donald Trump clearly ahead … ",
    "url": "https://www.politico.com/live-updates/2024/11/01/2024-elections-live-coverage-updates-analysis/blue-wall-polls-00186609"
  },
  {
    "text": "David Clements: The Evangelist of Election Refusal  —  Former law professor David Clements urges local election officials to refuse to certify elections—and trains citizens to pressure them to do so.  —  Meet The Authors … In the final moments of the training exercise … ",
    "url": "https://www.lawfaremedia.org/article/david-clements--the-evangelist-of-election-refusal"
  },
  {
    "text": "Elon Musk Could Have US Citizenship Revoked If He Lied on Immigration Forms  —  The richest man in the world appears to have worked in the US without authorization.  According to experts, if he did so and lied about it as part of the immigration process, he could be denaturalized.",
    "url": "https://www.wired.com/story/elon-musk-citizenship-revoked-denaturalized/"
  },
  {
    "text": "Vance suggests upper- and middle-class kids ‘become trans’ for college admissions, says Trump may earn ‘normal gay guy vote’  —  Republican vice presidential candidate JD Vance suggested in an interview with podcast host Joe Rogan that aired Thursday that White upper- and middle-class children … ",
    "url": "https://www.cnn.com/2024/10/31/politics/vance-transgender-college-admissions/"
  },
  {
    "text": "A Brief History of Trump's Violent Remarks  —  Here are 40 instances in which the former president incited or praised violence against his fellow citizens.  —  After the second attempt on his life, Donald Trump accused his political opponents of inspiring the attacks against him with their rhetoric.",
    "url": "https://www.theatlantic.com/politics/archive/2024/10/trump-violent-rhetoric-timeline/680403/?gift=mBLCHcnsd_Gd3EecvWSKTRHJyRSh4e6cpG5nsanEcr0&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Leopards Are Telling You That They Will Eat YOUR Face  —  Do you know this widely cited meme, introduced in a 2015 tweet? … It's hard to explain why this is perfect, but it is.  If Donald Trump wins, there will eventually be a lot of sobbing among people who voted for him.",
    "url": "https://www.nytimes.com/2024/10/31/opinion/trump-musk-mike-johnson.html?unlocked_article_code=1.Wk4.duhW.K0tYG-e4y7vD&smid=url-share"
  }
]