[
  {
    "text": "House GOP moves swiftly to impeach judge targeted by Trump  —  Just hours after President Trump called for the impeachment of a federal judge who ruled against his deportation of hundreds of Venezuelans over the weekend, House Republicans introduced a measure to do just that.",
    "url": "https://www.axios.com/2025/03/18/donald-trump-impeach-judge-house-republicans"
  },
  {
    "text": "Trump Moves to Settle the Fascism Debate  —  Plus: A supposedly fun thing Chuck Schumer will never do again.  —  President Donald Trump took another step in an openly fascist direction over the weekend when he skirted a federal court order to cancel or turn back deportation flights carrying … ",
    "url": "https://www.thebulwark.com/p/trump-moves-to-settle-the-fascism"
  },
  {
    "text": "Chief justice pushes back against calls to impeach judges who rule against Trump  —  Chief Justice John Roberts issued a statement following President Donald Trump's call for a judge to be impeached for ruling against the administration.  —  WASHINGTON — Chief Justice John Roberts issued … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/chief-justice-pushes-back-calls-impeach-judges-rule-trump-rcna196922"
  },
  {
    "text": "Exclusive: Trump fires both Democratic commissioners at FTC, sources say  —  President Donald Trump fired the two Democratic commissioners at the U.S. Federal Trade Commission on Tuesday, two sources familiar with the situation said, in another major test of the independence of regulatory agencies.",
    "url": "https://www.reuters.com/world/us/trump-fires-both-democratic-commissioners-ftc-sources-say-2025-03-18/"
  },
  {
    "text": "Judge finds Elon Musk and DOGE's shutdown of USAID likely unconstitutional  —  Washington — A federal judge on Tuesday found that Elon Musk and the White House's Department of Government Efficiency likely violated the Constitution when they unilaterally acted to shut down the U.S. Agency for International Development.",
    "url": "https://www.cbsnews.com/news/judge-finds-doges-usaid-shutdown-likely-unconstitutional/"
  },
  {
    "text": "Judge says dismantling of USAID was unconstitutional, orders Musk to restore access for employees  —  The judge ordered a pause on any efforts to shut down USAID.  —  Elon Musk's attempt to unilaterally dismantle the U.S. Agency for International Development likely violated the United States Constitution … ",
    "url": "https://abcnews.go.com/Politics/judge-dismantling-usaid-unconstitutional-orders-musk-restore-access/story?id=119923733"
  },
  {
    "text": "Kennedy's Alarming Prescription for Bird Flu on Poultry Farms  —  The health secretary has suggested allowing the virus to spread, so as to identify birds that may be immune.  Such an experiment would be disastrous, scientists say.  —  Robert F. Kennedy Jr., the nation's top health official … ",
    "url": "https://www.nytimes.com/2025/03/18/health/kennedy-bird-flu.html?unlocked_article_code=1.404.zYYP.HXW7t7VL8EuF&smid=url-share"
  },
  {
    "text": "GOP leaders call on Sen. Eichorn to resign after arrest for allegedly soliciting a minor  —  Minnesota state Sen. Justin Eichorn was arrested Monday in Bloomington for allegedly soliciting a minor for prostitution.  —  Bloomington police said Eichorn was arrested near the 8300 block … ",
    "url": "https://www.mprnews.org/story/2025/03/18/state-senator-eichorn-arrested-suspicion-of-soliciting-a-minor"
  },
  {
    "text": "Federal judge indefinitely blocks Trump's ban on transgender service members, saying it's ‘soaked in animus’  —  A federal judge has indefinitely blocked President Donald Trump's ban on transgender service members, dealing a major defeat to a controversial policy the president resurrected from his first term.",
    "url": "https://www.cnn.com/2025/03/18/politics/transgender-military-court-ruling/"
  },
  {
    "text": "Trump to declare “illicit” fentanyl “Weapon of Mass Destruction,” per draft EO  —  The Handbasket is subscriber-funded.  If you want to support independent media during these dark times for democracy, become a paid subscriber today!  —  Video  —  The heads of the US Departments of Commerce … ",
    "url": "https://www.thehandbasket.co/p/trump-fentanyl-weapon-of-mass-destruction-executive-order-draft-scoop"
  },
  {
    "text": "This is why Kamala Harris really lost  —  Democrats have spent months debating how and why they lost the 2024 election.  But the full picture of what happened on Election Day is only now coming into view.  —  The most authoritative election analyses draw on a variety of different data sources … ",
    "url": "https://www.vox.com/politics/403364/tik-tok-young-voters-2024-election-democrats-david-shor"
  },
  {
    "text": "JFK Assassination Records - 2025 Documents Release  —  In accordance with President Donald Trump's directive of March 17, 2025, all records previously withheld for classification that are part of the President John F. Kennedy Assassination Records Collection are released.",
    "url": "https://www.archives.gov/research/jfk/release-2025"
  },
  {
    "text": "Wired is dropping paywalls for FOIA-based reporting.  Others should follow  —  The news business isn't just any business — it serves a vital role in our democracy, recognized by the First Amendment.  But media outlets can't serve that role if they're bankrupt.",
    "url": "https://freedom.press/issues/wired-is-dropping-paywalls-for-foia-based-reporting-others-should-follow/"
  },
  {
    "text": "‘Segregated facilities’ are no longer explicitly banned in federal contracts  —  After a recent change by the Trump administration, the federal government no longer explicitly prohibits contractors from having segregated restaurants, waiting rooms and drinking fountains.",
    "url": "https://www.npr.org/sections/shots-health-news/2025/03/18/nx-s1-5326118/segregation-federal-contracts-far-regulation-trump"
  },
  {
    "text": "U.S. could lose democracy status, says global watchdog  —  Trump has escalated an authoritarian turn in last few days  —  A just-released annual report on the global state of democracy makes for depressing reading.  But what's even more depressing is what might appear in next year's edition.",
    "url": "https://www.cbc.ca/news/world/trump-democracy-report-1.7486317"
  },
  {
    "text": "Some Americans Have Already Been Caught in Trump's Immigration Dragnet.  More Will Be.  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up to receive our biggest stories as soon as they're published.  —  About a week after President Donald Trump took office … ",
    "url": "https://www.propublica.org/article/more-americans-will-be-caught-up-trump-immigration-raids"
  },
  {
    "text": "Pentagon is cutting up to 60,000 civilian jobs.  About a third of those took voluntary resignations  —  Roughly 50,000 to 60,000 civilian jobs will be cut in the Defense Department, but fewer than 21,000 workers who took a voluntary resignation plan are leaving in the coming months, a senior defense official told reporters Tuesday.",
    "url": "https://apnews.com/article/pentagon-doge-civilian-job-cuts-fbcb154fbe9d5904f456aa3655e57c44"
  },
  {
    "text": "Trump admin considers giving up NATO command that has been exclusively American since Eisenhower  —  The move is being discussed as part of a possible restructuring of combatant commands that would help the Defense Department cut costs.  —  For nearly 75 years, it has been a distinctly … ",
    "url": "https://www.nbcnews.com/politics/national-security/trump-admin-considers-giving-nato-command-exclusively-american-eisenho-rcna196503"
  },
  {
    "text": "‘Airport Theory’ Will Make You Miss Your Flight  —  This delusional airport trend only appeals to those who have no concept of how time or space work.  Here's how to actually travel like a pro. … If airports weren't already a hellscape, TikTok has found a way to make them worse.",
    "url": "https://www.wired.com/story/airport-theory-aka-what-happens-if-you-miss-your-flight/"
  },
  {
    "text": "German man with green card ‘violently interrogated’ by US border officials  —  Berlin checking if US immigration policy has changed after Fabian Schmidt becomes third German to be detained  —  Berlin is investigating whether US immigration policy has changed, after a German national … ",
    "url": "https://www.theguardian.com/us-news/2025/mar/18/germany-investigates-after-national-with-green-card-arrested-at-us-border"
  },
  {
    "text": "DOGE Rampage May Have ‘Immediate,’ ‘Long-term’ Effects For Courts, Judicial Branch Warns  —  The federal court system warned its employees that DOGE's cuts to building services and to executive branch staff could cause “immediate and long-term effects on court operations,” according to a Monday memo obtained by TPM .",
    "url": "https://talkingpointsmemo.com/news/doge-rampage-may-have-immediate-long-term-effects-for-courts-judicial-branch-warns"
  },
  {
    "text": "Radio Free Europe sues after Trump administration halts funding  —  Radio Free Europe/Radio Liberty sued Kari Lake and the Trump administration Tuesday over efforts to defund the organization.  —  Last week, President Trump signed an executive order aimed at eliminating the U.S. Agency for Global Media … ",
    "url": "https://thehill.com/regulation/court-battles/5201834-radio-free-europe-trump-administration-kari-lake-funding-lawsuit/"
  },
  {
    "text": "For four Venezuelan friends, Alien Enemies Act cuts short an American dream  —  The men had just begun new lives in Dallas when officers arrived at their home and arrested them.  Their relatives deny that they have any connection to the Tren de Aragua gang.  —  Just now",
    "url": "https://www.washingtonpost.com/immigration/2025/03/18/trump-migrants-venezuelans-deportation-bukele/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQyMjcwNDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQzNjUyNzk5LCJpYXQiOjE3NDIyNzA0MDAsImp0aSI6ImUzNDc4YTAyLTdmZmEtNDBhYy05OWY5LThlZjU4MzRlNDUxOCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9pbW1pZ3JhdGlvbi8yMDI1LzAzLzE4L3RydW1wLW1pZ3JhbnRzLXZlbmV6dWVsYW5zLWRlcG9ydGF0aW9uLWJ1a2VsZS8ifQ.58UWY6jz_YvKWHmHZZUgOVSFOk0TtcxSGIdRFq8ns34&itid=gfta"
  },
  {
    "text": "Tesla investor calls for Elon Musk to step down as boss  —  Wealth manager Ross Gerber tells Sky News that Musk's time has become too stretched and his work alongside President Donald Trump too divisive.  —  Business and economics reporter @SkyNewsBiz  —  One of Tesla's earliest investors … ",
    "url": "https://news.sky.com/story/its-a-crisis-top-tesla-investor-wants-musk-gone-13331499"
  },
  {
    "text": "Tesla board members, executive sell off over $100 million of stock in recent weeks  —  Shares of Tesla have plunged nearly 50% since a peak in mid-December.  —  Stickers protesting Tesla CEO Elon Musk are shown on a Tesla Supercharger, on March 12, 2025, in San Anselmo, Calif.",
    "url": "https://abcnews.go.com/Business/tesla-board-members-executive-sell-off-100-million/story?id=119889047"
  },
  {
    "text": "Jordan demands testimony from prosecutors who went after Trump  —  It's the latest step in the House GOP's efforts to support the president's desires for political retribution.  —  House Judiciary Chair Jim Jordan is calling prosecutors who oversaw the criminal investigation into Donald … ",
    "url": "https://www.politico.com/news/2025/03/18/jordan-prosecutors-testimony-trump-00236878"
  },
  {
    "text": "The Faces of Trump's Anti-Immigrant Crusade  —  The government deported a 10-year-old American citizen with brain cancer.  —  ∙ Paid  —  First: I'll be live on Substack today at 1:00 p.m. EDT with epidemiologist Katelyn Jetelina to talk about measles, vaccines … ",
    "url": "https://www.thebulwark.com/p/the-faces-of-trumps-anti-immigrant"
  },
  {
    "text": "‘I am a political prisoner’: Mahmoud Khalil says he's being targeted for political beliefs  —  Exclusive: Palestinian activist and green card holder speaks out from Louisiana immigration detention for first time  — Never miss global breaking news.  Download our free app to keep up with key stories in real time.",
    "url": "https://www.theguardian.com/us-news/2025/mar/18/mahmoud-khalil-statement-columbia"
  }
]