[
  {
    "text": "A Gaza Ceasefire Deal Is the Only Way to Avoid a Wider War  —  If the war between Israel and Hamas rages on indefinitely, the conflict will spread.  It doesn't have to be that way. … It is inevitable that much of the discussion in Washington, D.C. regarding the drone attack … ",
    "url": "https://www.thedailybeast.com/gaza-ceasefire-deal-is-the-only-way-to-avoid-wider-war"
  },
  {
    "text": "Iranian Allies Brace for U.S. Response to Deadly Drone Strike  —  Enemy drone approached its target at the same time a U.S. drone was also returning to base  —  The U.S. failed to stop a deadly attack on an American military outpost in Jordan when the enemy drone approached its target … ",
    "url": "https://www.wsj.com/world/middle-east/iranian-allies-brace-for-u-s-response-to-deadly-drone-strike-99378749?mod=followamazon"
  },
  {
    "text": "Retired conservative federal judge urges Supreme Court to disqualify Trump from office  —  A former conservative federal appellate judge is urging the Supreme Court to keep Donald Trump off the ballot, arguing the ex-president's effort to cling to power after his 2020 election loss was … ",
    "url": "https://www.cnn.com/2024/01/29/politics/luttig-conway-supreme-court-trump-insurrection/"
  },
  {
    "text": "Retired Republican judge: “Absolutely damning” evidence in new bid to bar Trump from Illinois ballot  —  The “preponderance of evidence” shows that Trump engaged in insurrection, election officer says  —  A hearing officer for the Illinois State Board of Elections in a recommendation released … ",
    "url": "https://www.salon.com/2024/01/29/retired-judge-absolutely-damning-evidence-in-new-bid-to-bar-from-illinois-ballot/"
  },
  {
    "text": "GOP Senator Reveals the Sick Truth About the Trump-MAGA Border Scam  —  Republican Senator James Lankford, who is leading negotiations over a border security bill, is discovering to his great shock that Donald Trump and MAGA Republicans are not operating entirely in good faith.",
    "url": "https://newrepublic.com/article/178530/gop-senator-james-lankford-trump-maga-border-scam"
  },
  {
    "text": "Carroll says she would ‘absolutely’ sue Trump again if another case arises  —  Longtime advice columnist E. Jean Carroll on Monday said she is “more than willing” to sue former President Trump again if another case arose in the future.  —  A jury last week ordered Trump to pay … ",
    "url": "https://thehill.com/regulation/court-battles/4436549-carroll-says-she-would-absolutely-sue-trump-again-if-another-case-arises/"
  },
  {
    "text": "Merrick Garland to transfer power during back surgery  —  The Justice Department's No. 2 official will briefly take over as the attorney general undergoes a procedure on his spine this weekend.  —  Attorney General Merrick Garland will be out of commission this weekend due to back surgery … ",
    "url": "https://www.politico.com/news/2024/01/29/merrick-garland-to-transfer-power-during-back-surgery-00138461"
  },
  {
    "text": "Taylor Swift could sway 2024 election outcome, new poll finds with a FIFTH of voters ‘likely’ to back candidate endorsed by singer  — Eighteen percent of voters say they're ‘more likely’ or ‘significantly more likely’ to vote for a candidate endorsed by Taylor Swift",
    "url": "https://www.dailymail.co.uk/news/article-13016529/Taylor-Swift-election-new-poll.html"
  },
  {
    "text": "Vivek Ramaswamy Joins the Taylor Swift ‘Psy-Op’ Bandwagon (Update)  —  Vivek Ramaswamy was never my cup of tea and this is why.  Because, on the one hand he could occasionally do a solid job putting the progressive media back on its heels on the other hand he was also willing to indulge stupid conspiracy theories like this:",
    "url": "https://hotair.com/john-s-2/2024/01/29/vivek-ramaswamy-joins-the-taylor-swift-psy-op-bandwagon-n608247"
  },
  {
    "text": "Republicans now say it might be okay to ignore the Supreme Court  —  A consequential development of the Trump era is what increasingly looks like the Republicans' acrimonious divorce from the rule of law.  —  The party that once prided itself as the law-and-order side has leaped headlong … ",
    "url": "https://www.washingtonpost.com/politics/2024/01/29/republicans-now-say-it-might-be-okay-ignore-supreme-court/"
  },
  {
    "text": "Prisoners in the US are part of a hidden workforce linked to hundreds of popular food brands  —  A hidden path to America's dinner tables begins here, at an unlikely source - a former Southern slave plantation that is now the country's largest maximum-security prison.",
    "url": "https://apnews.com/article/prison-to-plate-inmate-labor-investigation-c6f0eb4747963283316e494eadf08c4e"
  },
  {
    "text": "One Iranian and Two Canadian Nationals Indicted in Murder-for-Hire Scheme  —  For Immediate Release  —  One Iranian and two Canadian nationals have been charged with conspiracy to use interstate commerce in the commission of a murder-for-hire plot.  —  According to court documents … ",
    "url": "https://www.justice.gov/opa/pr/one-iranian-and-two-canadian-nationals-indicted-murder-hire-scheme"
  },
  {
    "text": "TheBlaze's Jason Whitlock Quietly Deletes Promo of Antisemitic Interview  —  But TheBlaze host said he didn't regret inviting the guest, who spewed vile conspiracy theories, on his show.  —  After coming under fire for hosting virulent antisemite E. Michael Jones, who claimed … ",
    "url": "https://www.thedailybeast.com/theblazes-jason-whitlock-quietly-deletes-promotion-of-antisemitic-interview"
  },
  {
    "text": "This Mark Cuban Story is Too Good Not to Share  —  Credit to Twitchy which got to all of this about an hour ago (as I write this).  The basic story is as follows.  Billionaire Mark Cuban has spent weeks arguing online arguing on behalf of DEI with anyone who will listen.",
    "url": "https://hotair.com/john-s-2/2024/01/29/this-mark-cuban-story-is-too-good-not-to-share-n608280"
  },
  {
    "text": "Apple warns proposed UK law will affect software updates around the world  —  Apple may leave the UK if required to provide advance notice of product updates.  —  Apple is “deeply concerned” that proposed changes to a United Kingdom law could give the UK government unprecedented power to … ",
    "url": "https://arstechnica.com/tech-policy/2024/01/apple-accuses-uk-of-power-grab-enabling-secret-veto-over-security-updates/"
  },
  {
    "text": "‘I Cannot Really Remember’: GOP Rep. Busted For Taking Credit For Bills She Voted Against  —  “I need to ask my staff,” Florida Rep. Maria Salazar said as a reporter listed off times she bragged about getting money for her district that she opposed.  —  LOADING",
    "url": "https://www.huffpost.com/entry/maria-salazar-takes-credit-for-bills-she-opposes_n_65b7e556e4b01c5c3a37a8c4"
  },
  {
    "text": "Republicans are quietly deleting mentions of abortion from their websites.  We asked them why  —  Republicans who previously campaigned on a pro-life position are now ‘in a tough spot,’ experts say. , Kelly Rissman speaks to GOP strategists and campaign managers about what's going on behind the scenes",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/republicans-abortion-prolife-deleting-sites-election-2024-b2484955.html"
  },
  {
    "text": "Texas AG seeks transgender records in Georgia as part of his wider probe  —  Texas Attorney General Ken Paxton has requested medical records from a Georgia telehealth clinic that provides gender-affirming care, a newly discovered move that shows the Republican official is looking in multiple states … ",
    "url": "https://www.washingtonpost.com/nation/2024/01/29/texas-ag-transgender-records-georgia/"
  },
  {
    "text": "The anti-abortion plan ready for Trump on Day One  —  The stakes of the election go far beyond whether a GOP president signs a bill banning the procedure.  —  Anti-abortion groups have not yet persuaded Donald Trump to commit to signing a national ban if he returns to the White House.",
    "url": "https://www.politico.com/news/2024/01/29/trump-abortion-ban-2024-campaign-00138417"
  },
  {
    "text": "‘Seismic shift’: driving unaffordable for many in US amid push toward SUVs  —  Luxury vehicles, production cuts and soaring insurance prices have sent the cost of US car ownership out of control  —  At the start of the pandemic, Ceola Luna, a 45-year-old Lyft driver in Los Angeles … ",
    "url": "https://www.theguardian.com/business/2024/jan/29/us-car-costs-insurance-unaffordable"
  },
  {
    "text": "Nikki Haley might want to be careful calling Congress a ‘nursing home’  —  Former ambassador to the United Nations Nikki Haley would like to be president.  Step 1 of that plan is to become the Republican Party's nominee — a step that, as you know, isn't going terribly well.",
    "url": "https://www.washingtonpost.com/politics/2024/01/29/haley-congress-age-republicans/"
  },
  {
    "text": "Party feud breaks out ahead of RNC meeting in Las Vegas  —  GOP county chairs and local activists warned the party isn't doing enough to compete in November.  —  LAS VEGAS — Days before the Republican National Committee was set to convene here, hundreds of Republican officials gathered … ",
    "url": "https://www.politico.com/news/2024/01/29/republican-party-feud-turning-point-las-vegas-00138493"
  },
  {
    "text": "Justice Department Subpoenas House of Representatives For Documents  —  House of Representatives notified of grand jury subpoena  —  A notification was read on the floor of the U.S. House of Representatives, revealing that the office of the Sergeant at Arms received a grand jury subpoena … ",
    "url": "https://www.meidastouch.com/news/justice-department-subpoenas-house-of-representatives-for-documents"
  },
  {
    "text": "Ex-IRS contractor sentenced to 5 years in prison for leaking Trump tax records  —  Charles Littlejohn had pleaded guilty to leaking thousands of tax records, including for Trump and billionaires like Jeff Bezos and Elon Musk.  —  WASHINGTON — The former Internal Revenue Service contractor … ",
    "url": "https://www.nbcnews.com/politics/justice-department/former-irs-contractor-sentenced-5-years-prison-leaking-trump-tax-recor-rcna135908?taid=65b7daa9f47c880001ead0be"
  }
]