[
  {
    "text": "Jim Jordan loses first House speaker vote, prepares for second ballot  — Rep. Jim Jordan failed to win the 217 votes he needed to be elected House Speaker on the first vote of the day.  — The House has been leaderless for two weeks after eight GOP lawmakers ousted former speaker Kevin McCarthy.",
    "url": "https://www.cnbc.com/2023/10/17/house-speaker-vote-jim-jordan-intends-to-wear-down-gop-opposition-with-multiple-votes.html"
  },
  {
    "text": "Jim Jordan Won't Make A Scandal Of Himself  —  Democrats can make him one, but brace yourself for the Jim Jordan beat sweeteners  —  After Steve Saclise turned out not to be the hero they wanted, House Republicans will decide whether Joker Jim Jordan is the hero they need … ",
    "url": "https://www.offmessage.net/p/jim-jordan-wont-make-a-scandal-of"
  },
  {
    "text": "Normie GOP, R.I.P.  —  “Moderates always cave.  A tale as old as time.”  —GOP member of Congress  —  Happy Tuesday.  —  Let's start today with three stories:  — Eight years ago, former Louisiana Governor Bobby Jindal called then-candidate Donald Trump an “egomaniacal madman”; an … ",
    "url": "https://plus.thebulwark.com/p/normie-gop-rip"
  },
  {
    "text": "Here's what we know about Jim Jordan and the Ohio State University wrestling scandal  — Rep. Jim Jordan of Ohio could be the next speaker of the House following McCarthy's ouster.  — Questions are resurfacing about his role in the sexual abuse scandal at Ohio State University.",
    "url": "https://www.businessinsider.com/what-happened-jim-jordan-ohio-state-wrestling-sex-abuse-scandal-2023-10?op=1"
  },
  {
    "text": "Jordan fails to win Speakership on first ballot  —  House Judiciary Committee Chairman Jim Jordan (R-Ohio) failed to win the Speakership in the first round of voting on Tuesday after 20 Republicans withheld support from his bid, denying him the votes needed to secure the gavel.",
    "url": "https://thehill.com/homenews/house/4260442-jim-jordan-fails-to-win-speakership-first-ballot/"
  },
  {
    "text": "Playbook: Jim Jordan's day of reckoning  —  Presented by With help from Eli Okun and Garrett Ross  —  DRIVING THE DAY  —  STILL TAKING APPLICATIONS — “How House Speaker Became Washington's Most Miserable Job,” by Ian Ward: “'You basically have a tied House with no operational majority,' said [political scientist MATTHEW] GREEN.",
    "url": "https://www.politico.com/newsletters/playbook/2023/10/17/jim-jordans-day-of-reckoning-00121910"
  },
  {
    "text": "The Apotheosis of Jim Jordan Is a Sight to Behold  —  No problem in the American system at this moment is as acute and disruptive as the one posed by the Republican Party.  —  Yes, of course, there are any number of structural problems facing American politics.",
    "url": "https://www.nytimes.com/2023/10/17/opinion/jim-jordan-house-speaker.html"
  },
  {
    "text": "Israel-Hamas war: Israel bombs Gaza where civilians sought refuge  —  The Gaza Health Ministry said an Israeli airstrike Tuesday hit a Gaza City hospital packed with wounded and other Palestinians seeking shelter, killing hundreds.  If confirmed, the attack would be by far the deadliest Israeli airstrike in five wars fought since 2008.",
    "url": "https://apnews.com/article/israel-palestinians-gaza-hamas-war-biden-rafah-e062825a375d9eb62e95509cab95b80c"
  },
  {
    "text": "The Right's Latest Target: Unmarried Women  —  Archconservatives find single women threatening, and they're trying to browbeat them into submission.  —  Pocket  —  This article appears in the October 30/November 6, 2023 issue, with the headline “Scolds and the Single Girl.”",
    "url": "https://www.thenation.com/article/archive/taylor-swift-single-women-right-wing/"
  },
  {
    "text": "Man, Wrongfully Imprisoned for 16 Years, Is Fatally Shot During Traffic Stop  —  Leonard Allan Cure, who was exonerated in 2020 after being convicted of armed robbery, was shot and killed by a sheriff's deputy in Georgia after being pulled over for speeding.",
    "url": "https://www.nytimes.com/2023/10/17/us/leonard-allan-cure-georgia-deputy-shooting.html"
  },
  {
    "text": "Whatever unfolds in Gaza war, judgment day looms for Netanyahu  —  One Israeli cabinet minister was barred from a hospital visitors' entrance.  Another's bodyguards were drenched with coffee thrown by a bereaved man.  A third had “traitor” and “imbecile” shouted at her as she came to comfort families evacuated during the horror.",
    "url": "https://www.reuters.com/world/middle-east/whatever-unfolds-gaza-war-judgment-day-looms-netanyahu-2023-10-17/"
  },
  {
    "text": "Ukraine uses secretly shipped U.S. missiles to launch surprise strike  —  The delivery and use on the battlefield marks a major ramp up of the administration's defense of Ukraine.  —  The Ukrainian military on Tuesday used U.S.-supplied longer-range missiles to strike nine Russian helicopters … ",
    "url": "https://www.politico.com/news/2023/10/17/ukraine-uses-secretly-shipped-u-s-missiles-to-launch-surprise-strike-00121932"
  },
  {
    "text": "Former GOP gubernatorial candidate Ryan Kelley sentenced to prison on Jan. 6 charges  —  The former candidate for Michigan governor was arrested during the Republican primary last year.  —  WASHINGTON — A former Republican candidate for Michigan governor was sentenced Tuesday to 60 days … ",
    "url": "https://www.nbcnews.com/politics/justice-department/republican-candidate-ryan-kelley-sentenced-prison-jan-6-rcna120679"
  },
  {
    "text": "Lawyers, Trump and money: Ex-president spends millions in donor cash on attorneys as legal woes grow  —  Donald Trump's political fundraising machine is raking in donations at a prodigious pace, but he's spending tens of millions of dollars he's bringing in to pay attorneys to deal … ",
    "url": "https://apnews.com/article/trump-lawyers-millions-payments-2024-campaign-2e06de2a8a90b3752e7758dfea56a509"
  },
  {
    "text": "Supreme Court tells 5th Circuit to stop its defiance in ghost gun case  —  The U.S. Supreme Court on Monday once again stepped in to leave in place the federal government's ban on so-called “ghost guns.”  These are unassembled and unmarked guns that can be bought online and then assembled into fully operative guns.",
    "url": "https://www.npr.org/2023/10/16/1206245991/supreme-court-ghost-guns"
  },
  {
    "text": "'There's just no excitement': Retail politics takes a nosedive in a Trump-dominated campaign  —  Operatives and activists can't recall a recent cycle with so little grassroots campaigning.  The numbers back them up.  —  If the Republican presidential primary this year is putting you half to sleep, you're not alone.",
    "url": "https://www.politico.com/news/2023/10/17/retail-politics-2024-election-00121851"
  },
  {
    "text": "Trump's statements pose ‘grave threats’ to court proceedings, Judge Chutkan says in written gag order  —  US District Judge Tanya Chutkan has put into writing her limited gag order that bars Donald Trump from making public statements about witnesses who might testify against him in the federal … ",
    "url": "https://www.cnn.com/2023/10/17/politics/trump-gag-order-written-tanya-chutkan/"
  }
]