[
  {
    "text": "Judge orders Ivanka Trump to testify in $250 million fraud case  —  Judge Arthur Engoron agreed with the AG's office that her testimony is necessary, even though she's no longer a defendant in the case.  —  The judge overseeing the $250 million civil trial against Donald Trump and his company ordered … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/judge-orders-ivanka-trump-testify-250-million-fraud-case-rcna122482"
  },
  {
    "text": "Former President Trump Expected to Testify in Civil Trial on Nov. 6, New York AG Says  —  Donald Trump Jr., Eric Trump and Ivanka Trump also are expected to be called as witnesses starting Wednesday  —  Donald Trump is expected to take the witness stand on Nov. 6 in his civil fraud trial … ",
    "url": "https://themessenger.com/politics/trump-testify-new-york-civil-trial-attorney-general"
  },
  {
    "text": "Nine Takeaways From Mike Johnson's First Interview as Speaker  —  The Louisiana Republican spoke about how his worldview is dictated by the Bible, and discussed issues including abortion, gay marriage and aid for Ukraine.  —  Speaker Mike Johnson said on Thursday evening that his personal worldview … ",
    "url": "https://www.nytimes.com/2023/10/27/us/politics/mike-johnson-interview-hannity-takeaways.html"
  },
  {
    "text": "Mike Johnson points to a Biden impeachment, even if the facts do not  —  On Thursday, House Speaker Mike Johnson (R-La.) granted his first cable-news network interview since securing his new role.  He was not playing on “hard” mode, certainly; his interlocutor was Fox News's generally pliable Sean Hannity.",
    "url": "https://www.washingtonpost.com/politics/2023/10/27/mike-johnson-points-biden-impeachment-even-if-facts-dont/"
  },
  {
    "text": "Speaker Johnson: US 'can't allow Vladimir Putin to prevail in Ukraine'  —  New Speaker of the House Mike Johnson (R-La.) said a victory for Russian President Vladimir Putin in Ukraine could empower China in comments Thursday.  —  “We can't allow Vladimir Putin to prevail in Ukraine … ",
    "url": "https://thehill.com/homenews/house/4279587-speaker-johnson-us-cant-allow-vladimir-putin-to-prevail-in-ukraine/"
  },
  {
    "text": "A year later, Musk's X is tilting right.  And sinking.  —  The billionaire bought Twitter to revive its business and make it less “woke.”  He has succeeded at only one of those goals.  —  One year after billionaire Elon Musk bought Twitter for $44 billion, aiming to rid it of a … ",
    "url": "https://www.washingtonpost.com/technology/2023/10/27/elon-musk-twitter-x-anniversary/"
  },
  {
    "text": "Full Phillips: ‘If this election was held today, President Biden would lose’  —  Rep. Dean Phillips (D-Minn.), who launched a 2024 campaign challenging President Biden for the Democratic nomination, joins Meet the Press NOW after filing in New Hampshire.",
    "url": "https://www.nbcnews.com/meet-the-press/video/full-phillips-how-am-i-going-to-win-this-very-simply-american-voters-196571205758"
  },
  {
    "text": "U.S. urges Israel against Gaza ground invasion, pushes surgical campaign  —  U.S. officials say a full-scale ground invasion risks a wider Middle East war and jeopardizes the lives of hundreds of hostages  —  The Biden administration is urging Israel to rethink its plans for a major ground offensive … ",
    "url": "https://www.washingtonpost.com/politics/2023/10/27/us-urging-israel-rethinkg-gaza-ground-invasion/"
  },
  {
    "text": "Arizona prosecutors ask about 2020 pressure campaign by Trump allies  —  PHOENIX — The Arizona attorney general's investigation into the coordinated attempt to overturn the 2020 election results by creating and sending documents to the federal government falsely declaring Donald Trump … ",
    "url": "https://www.washingtonpost.com/politics/2023/10/27/arizona-investigation-2020-election-trump/"
  },
  {
    "text": "Joe Scarborough Delivers Blistering Takedown Of Mike Johnson's Gun Logic  —  “We have more mass shootings in America every year than we have days in the year,” the MSNBC host said.  —  LOADING  —  MSNBC's Joe Scarborough slammed House Speaker Mike Johnson's (R-La.) “preposterous” … ",
    "url": "https://www.huffpost.com/entry/joe-scarborough-mike-johnson-guns_n_653b9f08e4b05def8bc76270"
  },
  {
    "text": "Mike Johnson's conspiracy theories about ‘illegals’ mark a new GOP low  —  Rep. Mike Johnson, the newly elected House speaker, has repeatedly flirted with what's known as the “great replacement theory,” the idea that Democrats are scheming to supplant American voters with immigrants.",
    "url": "https://www.washingtonpost.com/opinions/2023/10/27/mike-johnson-great-replacement-theory-house-speaker/"
  },
  {
    "text": "US congressman Santos pleads not guilty to new felony charges  —  U.S. Representative George Santos pleaded not guilty on Friday to a 23-count indictment accusing him of an array of corruption, including 10 felony counts that federal prosecutors added this month.",
    "url": "https://www.reuters.com/world/us/us-congressman-santos-pleads-not-guilty-new-felony-charges-2023-10-27/"
  },
  {
    "text": "DeSantis points to ‘liberal, soft on crime policies’ in wake of Maine mass shooting  —  Florida Gov. Ron DeSantis (R) pointed to “liberal, soft on crime” policies in the wake of a mass shooting in Maine that left 18 people dead earlier this week.  —  “[Y]ou look, a lot of the guys who commit violent crime … ",
    "url": "https://thehill.com/homenews/campaign/4279364-desantis-liberal-soft-crime-policies-maine-mass-shooting/"
  },
  {
    "text": "Secretary of Defense Lloyd J. Austin III's Statement on U.S. Military Strikes in Eastern Syria  —  Today, at President Biden's direction, U.S. military forces conducted self-defense strikes on two facilities in eastern Syria used by Iran's Islamic Revolutionary Guard Corps (IRGC) and affiliated groups.",
    "url": "https://www.defense.gov/News/Releases/Release/Article/3570798/secretary-of-defense-lloyd-j-austin-iiis-statement-on-us-military-strikes-in-ea/"
  },
  {
    "text": "Kanye and Adidas: Money, Misconduct and the Price of Appeasement  —  The Adidas team was huddled with Kanye West, pitching ideas for the first shoe they would create together.  It was 2013, and the rapper and the sportswear brand had just agreed to become partners.",
    "url": "https://www.nytimes.com/2023/10/27/business/kanye-west-adidas-yeezy.html"
  },
  {
    "text": "Trump's Vanishing Act: Why Trump Rallies Are Going Extinct  —  Trump has been holding about two rallies per month.  That's way down from his previous campaigns, like in 2016 when he held 323 rallies, or 70 rallies during COVID. … Vanishing Act  —  DERRY, New Hampshire … ",
    "url": "https://www.thedailybeast.com/trumps-vanishing-act-why-trump-rallies-are-going-extinct"
  },
  {
    "text": "Hearings begin as Trump critics attempt to kick him off ballots  —  Lawsuits in Colorado and Minnesota center on the 14th Amendment, which bars those who engage in an insurrection from running for office  —  In two courtrooms 900 miles apart, judges next week will begin to weigh an unprecedented … ",
    "url": "https://www.washingtonpost.com/politics/2023/10/27/trump-14th-amendment-colorado-minnesota/"
  },
  {
    "text": "Federal prosecutor to Congress: I didn't hinder Hunter Biden probe  —  In a closed-door congressional interview, the U.S. attorney for central California defended his handling of potential tax charges against the president's son.  —  The top federal prosecutor in Los Angeles confirmed … ",
    "url": "https://www.politico.com/news/2023/10/27/hunter-biden-tax-charges-california-00124037"
  },
  {
    "text": "Jenna Ellis's long, strange trip to disgrace  —  In court, she's contrite.  On social media?  Not so much. … On November 19, 2020, Trump campaign lawyer Jenna Ellis stood on the stage at the RNC flanked by Rudy Giuliani and Sidney Powell and vowed that “an elite strikeforce team” … ",
    "url": "https://www.publicnotice.co/p/jenna-ellis-guilty-plea-statement-biography"
  },
  {
    "text": "Make Mike Johnson Famous  —  If Republicans vote for a medieval insurrectionist, and nobody knows, does it count?  —  I had hoped, without really expecting, that the 20-plus member GOP rebellion against Jim Jordan's efforts to shove himself down their throats would bloom into a greater struggle … ",
    "url": "https://www.offmessage.net/p/make-mike-johnson-famous"
  }
]