[
  {
    "text": "Schumer to force reading of 1,000-page GOP mega bill, delaying it by half a day  —  Senate Democratic Leader Chuck Schumer (N.Y.) told Democratic senators Saturday that he will force the clerks to read the 1,000-page Republican megabill on the Senate floor once Republicans vote to proceed to the legislation … ",
    "url": "https://thehill.com/homenews/senate/5375278-schumer-to-force-reading-of-1000-page-gop-mega-bill-delaying-it-by-half-a-day/"
  },
  {
    "text": "Trump megabill narrowly advances in Senate despite two GOP defections  —  Senate Republicans on Saturday narrowly voted to advance a sprawling 1,000-page bill to enact President Trump's agenda, despite the opposition of two GOP lawmakers.  —  The vote was 51-49.",
    "url": "https://thehill.com/homenews/senate/5375328-trump-megabill-senate-vote/"
  },
  {
    "text": "Senate Republicans prepare to take up Trump's tax bill this afternoon  —  Lawmakers are hoping to push the president's massive tax and immigration bill through a crucial procedural vote.  —  After months of fierce debate, Senate Republicans unveiled overnight their edition … ",
    "url": "https://www.washingtonpost.com/business/2025/06/28/trump-big-bill-senate/"
  },
  {
    "text": "Democrats will force out-loud reading of 940-page megabill  —  Senate Minority Leader Chuck Schumer told fellow Democrats they will force the out-loud reading of the GOP's “big, beautiful bill” if the Senate votes to start debate Saturday.  The maneuver, which was described by a person granted anonymity … ",
    "url": "https://www.politico.com/live-updates/2025/06/28/congress/megabill-reading-out-loud-00431381"
  },
  {
    "text": "PREMIUM ONLY - 6/27/25 - ⚡️ Punchbowl News Special Edition - Breaking  —  After five weeks of endless political posturing, high-stakes negotiations and late-night text releases, Senate Republicans - especially Majority Leader John Thune and GOP leaders - face a moment of truth.",
    "url": "https://punchbowl.news/archive/premium-only-62725-punchbowl-news-special-edition-breaking/"
  },
  {
    "text": "Star witness against Kilmar Abrego García was due to be deported.  Now he's being freed.  —  Jose Ramon Hernandez Reyes is a three-time felon who has been released early from federal prison to a halfway house in exchange for his cooperation in the case.",
    "url": "https://www.washingtonpost.com/immigration/2025/06/28/star-witness-against-kilmar-abrego-garca-was-due-be-deported-now-hes-being-freed/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzUxMDgzMjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzUyNDY1NTk5LCJpYXQiOjE3NTEwODMyMDAsImp0aSI6ImVkZTBmMDcyLWEyOTEtNGU5Zi04NGIwLWY5YzdiZGYwMmQxYiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9pbW1pZ3JhdGlvbi8yMDI1LzA2LzI4L3N0YXItd2l0bmVzcy1hZ2FpbnN0LWtpbG1hci1hYnJlZ28tZ2FyY2Etd2FzLWR1ZS1iZS1kZXBvcnRlZC1ub3ctaGVzLWJlaW5nLWZyZWVkLyJ9._Nch735ocr9BypFYB3Xw3tJUhhZe5g2iCY6LIT4QPPA&itid=gfta"
  },
  {
    "text": "Wyden Statement on New CBO Numbers Showing More than $930 Billion in Medicaid Cuts In New Senate Draft  —  Washington, D.C. — Senate Finance Committee Ranking Member Ron Wyden, D-Ore., today issued the following statement after the Congressional Budget Office (CBO) delivered a preliminary analysis … ",
    "url": "https://www.finance.senate.gov/ranking-members-news/wyden-statement-on-new-cbo-numbers-showing-more-than-930-billion-in-medicaid-cuts-in-new-senate-draft"
  },
  {
    "text": "Trump pollster warns Senate GOP against deeper Medicaid cuts  —  Jim McLaughlin, one of President Donald Trump's top pollsters, said Hill Republicans should nix Senate Republicans' deeper Medicaid cuts in the megabill or risk deep backlash from voters.  “The Senate needs to go back to the House version … ",
    "url": "https://www.politico.com/live-updates/2025/06/28/congress/trump-medicaid-cuts-poll-00431377"
  },
  {
    "text": "162. What Does the Birthright Citizenship Ruling Portend?  —  Welcome back to “One First,” an (increasingly frequent) newsletter that aims to make the U.S. Supreme Court more accessible to all of us.  If you're not already a subscriber, I hope you'll consider becoming one (and, if you already are … ",
    "url": "https://www.stevevladeck.com/p/162-what-does-the-birthright-citizenship"
  },
  {
    "text": "Louisiana hospitals warn Mike Johnson of ‘devastation’ from megabill  —  Every major health system in Louisiana is warning Speaker Mike Johnson and the rest of the state's congressional delegation that the Senate GOP's planned Medicaid cuts “would be historic in their devastation.”",
    "url": "https://www.politico.com/live-updates/2025/06/28/congress/louisiana-hospitals-warn-mike-johnson-of-devastation-from-megabill-00431385"
  },
  {
    "text": "Protesters line highway in Florida Everglades to oppose ‘Alligator Alcatraz’  —  A coalition of groups, ranging from environmental activists to Native Americans advocating for their ancestral homelands, converged outside an airstrip in the Florida Everglades Saturday to protest the imminent construction of an immigrant detention center.",
    "url": "https://apnews.com/article/alligator-alcatraz-florida-everglades-protest-db34866aae64a3ff6880310403be40fd"
  },
  {
    "text": "Fear of immigration raids force the cancellation of several July festivities in Los Angeles  —  Several communities in Los Angeles County have called off or postponed their previously scheduled Independence Day and July events, citing resident safety amid ongoing immigration enforcement raids.",
    "url": "https://www.latimes.com/california/story/2025-06-27/fear-of-immigration-raids-force-the-cancellation-of-several-july-festivities-in-los-angeles"
  },
  {
    "text": "Trump's Immigration Arrests Are Seeing A Wave Of Resistance  —  The mass deportation agenda relies upon some key choke points.  —  Recent weeks have seen the Trump administration's “mass deportation” program kick into overdrive.  —  Militarized federal agents are working hard to meet … ",
    "url": "https://www.huffpost.com/entry/donald-trump-mass-deportation-resistance-choke-points_n_685d882fe4b01b4b31df992f"
  },
  {
    "text": "People whose lives were permanently altered by disease send a warning as vaccine opposition grows  —  In the time before widespread vaccination, death often came early.  Devastating infectious diseases ran rampant in America, killing millions of children and leaving others with lifelong health problems.",
    "url": "https://apnews.com/article/vaccines-measles-polio-whooping-cough-rubella-af4cd1aef8f408a960601df6372f9c32"
  },
  {
    "text": "Iran reportedly bans IAEA chief, surveillance cameras from nuclear plants  —  Tehran claims Israel's government obtained “sensitive facility data,” according to media reports.  —  Iran decided to ban the head of the International Atomic Energy Agency from its nuclear facilities … ",
    "url": "https://www.politico.eu/article/iran-ban-iaea-chief-rafael-grossi-surveillance-camera-nuclear-plant/"
  },
  {
    "text": "Nancy Mace privately asks Trump aides to unfreeze Mercedes EV funds  —  The program, set up through President Joe Biden's climate law, would benefit a Mercedes-Benz plant in South Carolina.  —  Rep. Nancy Mace (R-South Carolina) privately asked the Trump administration on Tuesday … ",
    "url": "https://www.washingtonpost.com/business/2025/06/28/nancy-mace-trump-mercedes/"
  },
  {
    "text": "Estimated Budgetary Effects of an Amendment in the Nature of a Substitute to H.R. 1, the One Big Beautiful Bill Act, Relative to the Budget Enforcement Baseline for Consideration in the Senate  —  As posted on the website of the Senate Committee on the Budget on June 27, 2025",
    "url": "https://www.cbo.gov/publication/61533"
  },
  {
    "text": "US sees spate of arrests of civilians impersonating Ice officers  —  Experts say trend of agents detaining people while masking and wearing plainclothes increases risk  —  Police in southern California arrested a man suspected of posing as a federal immigration officer this week … ",
    "url": "https://www.theguardian.com/us-news/2025/jun/28/civilians-impersonating-ice-officers"
  },
  {
    "text": "Hamas leader and Oct. 7 mastermind Hakham Muhammad Issa Al-Issa killed in airstrike, IDF says  —  Israel's military “eliminated” a founding Hamas military leader and mastermind behind the Oct. 7 attack, Tel Aviv officials said Saturday.  —  Hakham Muhammad Issa Al-Issa was killed during … ",
    "url": "https://nypost.com/2025/06/28/world-news/hamas-leader-hakham-muhammad-issa-al-issa-killed-in-airstrike-idf-says/"
  }
]