[
  {
    "text": "On political endorsement  —  A note from the publisher:  —  William Lewis is publisher and chief executive officer of The Washington Post.  —  The Washington Post will not be making an endorsement of a presidential candidate in this election.  Nor in any future presidential election.",
    "url": "https://www.washingtonpost.com/opinions/2024/10/25/washington-post-endorsement/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI5ODI4ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzMxMjE0Nzk5LCJpYXQiOjE3Mjk4Mjg4MDAsImp0aSI6ImMwYjA4OGU5LTM4YmQtNDg4NS05Y2ExLWY4ZTBjYzFlNjI4MyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9vcGluaW9ucy8yMDI0LzEwLzI1L3dhc2hpbmd0b24tcG9zdC1lbmRvcnNlbWVudC8ifQ.QytUuqJxYTcrn1R5eJrfxbNGtWzcRD0bPDrI-mjUMOo"
  },
  {
    "text": "‘Washingon Post’ won't endorse in White House race for first time since 1980s  —  Even though the presidential race between former President Donald Trump and Vice President Kamala Harris remains neck and neck, The Washington Post editorial page has decided not to make a presidential endorsement … ",
    "url": "https://www.npr.org/2024/10/25/nx-s1-5165353/washingon-post-presidential-endorsement-trump-harris"
  },
  {
    "text": "Jeff Bezos killed Washington Post endorsement of Kamala Harris, paper reports … The Washington Post said Friday that it will not endorse a candidate in the presidential election for the first time since 1976.  —  The newspaper also on Friday ran an article by two staff reporters saying … ",
    "url": "https://www.cnbc.com/2024/10/25/jeff-bezos-killed-washington-post-endorsement-of-kamala-harris-.html"
  },
  {
    "text": "Editor resigns, subscribers cancel as Washington Post non-endorsement prompts crisis at Bezos paper  —  The Scoop  —  The Washington Post's leadership recently sought meetings with the Democratic and Republican nominees for president, Kamala Harris and Donald Trump, people familiar with the requests said.",
    "url": "https://www.semafor.com/article/10/25/2024/editor-resign-subscribers-cancel-as-washington-post-non-endorsement-prompts-crisis-at-bezos-paper"
  },
  {
    "text": "The Washington Post says it will not endorse a candidate for president  —  Publisher William Lewis explained the decision as a return to the newspaper's roots.  —  The Washington Post's editorial board announced Friday that it will not make an endorsement in this year's presidential contest … ",
    "url": "https://www.washingtonpost.com/style/media/2024/10/25/washington-post-endorsement-president/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI5ODI4ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzMxMjE0Nzk5LCJpYXQiOjE3Mjk4Mjg4MDAsImp0aSI6IjA0ODQ3ZmEwLTc2N2EtNDMwMi04ZTIzLTI5YzFmNmE2ZGFiYSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9zdHlsZS9tZWRpYS8yMDI0LzEwLzI1L3dhc2hpbmd0b24tcG9zdC1lbmRvcnNlbWVudC1wcmVzaWRlbnQvIn0.KpwHmXGXy0IaqEhSAi-TN0t93LrI0WnuWuywQv9k6DM&itid=gfta"
  },
  {
    "text": "‘Washington Post’ won't endorse in White House race for first time since 1980s  —  Even though the presidential race between former President Donald Trump and Vice President Kamala Harris is neck and neck, The Washington Post has decided not to make a presidential endorsement for the first time in 36 years … ",
    "url": "https://www.npr.org/2024/10/25/nx-s1-5165353/washington-post-presidential-endorsement-trump-harris"
  },
  {
    "text": "Washington Post reels from Bezos decision to not endorse  —  The Washington Post is reeling from a decision to abstain from endorsing a presidential candidate in the 2024 election, a move that was reportedly made by billionaire owner Jeff Bezos after its editorial board drafted an endorsement of Vice President Harris.",
    "url": "https://thehill.com/homenews/media/4954196-bezos-decision-post-endorsement/"
  },
  {
    "text": "Playing It Safe Is Risking Democracy: Media's Silent Endorsement of Authoritarianism  —  I woke up this morning thinking about authoritarianism.  —  In his 2017 book On Tyranny, historian Timothy Snyder introduced the concept of “anticipatory obedience,” warning that “most of the power of authoritarianism is freely given.”",
    "url": "https://www.readtpa.com/p/playing-it-safe-is-risking-democracy"
  },
  {
    "text": "The Washington Post opinion editor approved a Harris endorsement.  A week later, Jeff Bezos killed it.  —  On Friday, the Washington Post's publisher, Will Lewis, announced that the paper would no longer make endorsements for president—after its journalists had already drafted an endorsement of Vice President Kamala Harris.",
    "url": "https://www.cjr.org/political_press/the-washington-post-opinion-editor-approved-a-harris-endorsement-a-week-later-the-papers-publisher-killed-it.php"
  },
  {
    "text": "13 former Trump administration officials sign open letter backing up John Kelly's criticism of Trump  —  Kelly told the New York Times that Trump meets the definition of a fascist and also said he observed the former president on multiple occasions praising Adolf Hitler.",
    "url": "https://www.nbcnews.com/politics/2024-election/13-former-trump-administration-officials-sign-open-letter-backing-john-rcna177227"
  },
  {
    "text": "Ex-Trump aides emerge to back Kelly's harsh warnings  —  The letter from former White House officials comes as Harris is leaning into her closing argument that Trump is a threat to democracy.  —  More than a dozen former Trump administration officials on Friday came out in support of former chief … ",
    "url": "https://www.politico.com/news/2024/10/25/never-trump-former-officials-back-kelly-warning-00185435"
  },
  {
    "text": "“Extreme Danger”: Harris Earns a Stunning Endorsement Over Trump … More than 100 Arizona Palestinian, Arab, Muslim, and progressive Democrats and community leaders have signed a letter making the case for those reluctant to support Kamala Harris against Donald Trump.",
    "url": "https://newrepublic.com/post/187537/kamala-harris-donald-trump-stunning-endorsement"
  },
  {
    "text": "Freedom Caucus leader endorses radical proposal for North Carolina to hand its electoral votes to Trump  —  Rep. Andy Harris said the damage caused by Hurricane Helene in pro-Trump counties would justify the extraordinary maneuver.  —  The chair of the conservative House Freedom Caucus … ",
    "url": "https://www.politico.com/news/2024/10/25/trump-freedom-caucus-north-carolina-electors-00185520"
  },
  {
    "text": "NASA chief calls for investigation into report that Musk and Putin have spoken regularly  —  NASA Administrator Bill Nelson on Friday called for an investigation into a Wall Street Journal report that SpaceX founder and Donald Trump ally Elon Musk and Russian President Vladimir Putin have been in “regular contact” since late 2022.",
    "url": "https://www.cnn.com/2024/10/25/politics/elon-musk-vladimir-putin/"
  },
  {
    "text": "Chinese Hackers Are Said to Have Targeted Phones Used by Trump and Vance  —  The Trump campaign was informed this week that hackers may have gained access to data from the phones through a breach of American telecommunications systems.  —  Chinese hackers who are believed to have burrowed deep … ",
    "url": "https://www.nytimes.com/2024/10/25/us/politics/trump-vance-hack.html?unlocked_article_code=1.U04.Qlq4.J0iSftVgPdec&smid=url-share"
  },
  {
    "text": "U.S. Department of Defense and Army Records Regarding Incident at Arlington National Cemetery … INQUIRIES PRESS@AMERICANOVERSIGHT.ORG  —  Records from the U.S. Department of Defense and Army in response to American Oversight's litigation seeking the expedited release of records regarding … ",
    "url": "https://americanoversight.org/featureddocument/u-s-department-of-defense-and-army-records-regarding-incident-at-arlington-national-cemetery/"
  },
  {
    "text": "Judge blocks Virginia from purging voter rolls of alleged noncitizens … A federal judge on Friday blocked Virginia from purging its voter rolls of alleged noncitizens and ordered the state to reinstate more than 1,600 people who had already been bounced from those voter lists.",
    "url": "https://www.cnbc.com/2024/10/25/judge-blocks-virginia-from-purging-voter-rolls-of-alleged-noncitizens.html"
  },
  {
    "text": "New ‘RBG PAC’ Spending $19 Million From Secret Donors to Aid Trump on Abortion  —  A new Republican super PAC is running ads invoking the name of Ruth Bader Ginsburg to help Donald Trump win over voters who favor abortion rights.  —  A new Republican super PAC is invoking the name … ",
    "url": "https://www.nytimes.com/2024/10/25/us/politics/trump-ruth-bader-ginsberg-abortion-ad.html"
  },
  {
    "text": "Kamala Harris for president |  Endorsement  —  Voters face an easy but tectonic choice in the race for the White House.Will they choose the first woman or the oldest man to be the next president?  Will they choose the prosecutor or the convict?  Will they choose the candidate … ",
    "url": "https://www.inquirer.com/opinion/editorials/a/endorsement-president-kamala-harris-democracy-20241025.html"
  },
  {
    "text": "Biden becomes first president to apologize for Native American boarding school policy  —  President Biden apologized Friday for Native American boarding schools that were part of U.S. policy for 150 years and stripped children away from their tribes and culture.",
    "url": "https://thehill.com/homenews/education/4953809-joe-biden-apology-native-american-boarding-school-policy/"
  }
]