[
  {
    "text": "Americans are divided along party lines over Trump's actions in election cases, AP-NORC poll shows  —  Donald Trump and 18 allies have been indicted in Georgia over efforts to overturn his 2020 election loss in the state.  There is no shortage of logistical challenges raised by the sprawling racketeering indictment.",
    "url": "https://apnews.com/article/trump-indictment-poll-georgia-elections-b6140eed88b3153e41dbf9e008d5a21b"
  },
  {
    "text": "The Jolt: Marjorie Taylor Greene blasts Kemp and floats VP, Senate bids  —  Since Fulton County District Attorney Fani Willis indicted former President Donald Trump for interfering in Georgia's 2020 election, U.S. Rep. Marjorie Taylor Greene has been on the attack.The conservative firebrand … ",
    "url": "https://www.ajc.com/politics/politics-blog/the-jolt-marjorie-taylor-greene-blasts-kemp-and-floats-vp-senate-bids/YKTNGG7QRJDBTH4RSVTV37PZPI/"
  },
  {
    "text": "Dems start laughing off House GOP's Trump protection push  —  FOUR INDICTMENTS AND AN EXPUNGEMENT?  —  House Republicans first flirted with nullifying Donald Trump's impeachments back when the former president faced only two indictments.  Now that number has doubled, and the manager … ",
    "url": "https://www.politico.com/newsletters/huddle/2023/08/16/dems-start-laughing-off-house-gops-trump-protection-push-00111426"
  },
  {
    "text": "The ‘brains’ behind fake Trump electors was once a liberal Democrat  —  Kenneth Chesebro, a Harvard-trained lawyer, may be the least well known of the main players in Trump's federal and Georgia indictments  —  VEGA ALTA, Puerto Rico — The blinds were drawn at a handsome villa … ",
    "url": "https://www.washingtonpost.com/national-security/2023/08/16/kenneth-cheseboro-trump-indictment-fake-electors/"
  },
  {
    "text": "Pence: ‘The Georgia election was not stolen’  —  The former vice president is leaning into his resistance to Trump's efforts to overturn the election.  —  INDIANAPOLIS — Mike Pence said Wednesday that the Georgia election was not stolen in 2020, leaning into his role on Jan. 6 … ",
    "url": "https://www.politico.com/news/2023/08/16/pence-georgia-election-trump-indictment-00111430"
  },
  {
    "text": "Feds Indict George Santos Campaign Aide Over Shady Fundraising Tactic  —  Samuel Miele posed as McCarthy's chief of staff, Dan Meyer, while communicating with more than a dozen potential donors, an indictment alleges.  —  A campaign fundraiser for indicted Rep. George Santos (R-NY) … ",
    "url": "https://www.thedailybeast.com/feds-indict-george-santos-campaign-fundraiser-samuel-miele"
  },
  {
    "text": "Santos fundraiser charged with impersonating House leadership aide  —  Samuel Miele, a fundraiser for embattled Rep. George Santos (R-N.Y.), was indicted on allegations he had impersonated a top aide to a member of House leadership while soliciting donations for Santos's campaign.",
    "url": "https://thehill.com/regulation/court-battles/4155311-george-santos-fundraiser-accused-of-impersonating-house-leadership-aide/"
  },
  {
    "text": "Feds indict paid fundraiser for Rep. George Santos for allegedly impersonating Speaker McCarthy aide  — A man who was a paid campaign fundraiser for Rep. George Santos was indicted in New York on federal charges related to his allegedly impersonating a top aide to House Speaker Kevin McCarthy.",
    "url": "https://www.cnbc.com/2023/08/16/feds-indict-paid-fundraiser-for-rep-george-santos-for-allegedly-impersonating-speaker-mccarthy-aide.html"
  },
  {
    "text": "What the Heck Happened in Coffee County, Georgia?  —  A detailed look back at the computer intrusion that features prominently in Fulton County District Attorney Fani Willis's election interference indictment  —  Meet The Authors  —  Published by The Lawfare Institute in Cooperation With",
    "url": "https://www.lawfaremedia.org/article/what-the-heck-happened-in-coffee-county-georgia"
  },
  {
    "text": "Special counsel obtained Trump DMs despite ‘momentous’ bid by Twitter to delay, unsealed filings show  —  Judge Beryl Howell lit into Twitter for taking steps to give Donald Trump advance notice about the search warrant.  —  Special counsel Jack Smith obtained an extraordinary array of data … ",
    "url": "https://www.politico.com/news/2023/08/15/special-counsel-obtained-trump-twitter-howell-00111410"
  },
  {
    "text": "Ohio Secretary of State Frank LaRose fires press secretary over tweets criticizing Trump  —  The dismissal of Rob Nichols comes as LaRose seeks Trump's endorsement in a competitive GOP Senate primary.  —  CLEVELAND — An official spokesperson for Ohio Secretary of State Frank LaRose is out of a job … ",
    "url": "https://www.nbcnews.com/meet-the-press/meetthepressblog/ohio-secretary-state-frank-larose-fires-press-secretary-tweets-critici-rcna100222"
  },
  {
    "text": "GOP lawmaker apologizes for ‘religious freedom’ tweet  —  A Republican lawmaker apologized Tuesday for a “religious freedom” tweet he posted earlier that day after receiving backlash from both sides of the aisle.  —  Rep. Max Miller (R-Ohio) asked Lizzie Marbach, director of communications … ",
    "url": "https://thehill.com/homenews/house/4155171-gop-lawmaker-apologizes-for-religious-freedom-tweet/"
  },
  {
    "text": "Sinema takes on Schumer, Jeffries and the White House over the border  —  Border-state Democrats are frustrated to see New York claim most of a recent migrant relief infusion.  But Arizona's formerly Democratic senator is speaking out the loudest.  —  When the Biden administration doled … ",
    "url": "https://www.politico.com/news/2023/08/16/sinema-takes-on-schumer-jeffries-border-00111355"
  },
  {
    "text": "Exclusive: Ron DeSantis on Fatherhood, Parents' Rights, and the 2024 Campaign  —  To hear Ron DeSantis tell it, his message hasn't changed.  “I think we were viewed, really from Day One, as the candidate that had the strong record on the issues important to parents,” he tells me … ",
    "url": "https://time.com/6305193/ron-desantis-interview-education-parents-2024/"
  },
  {
    "text": "Giuliani struggling under massive legal bills after defending Trump  —  Rudy Giuliani is staring down hundreds of thousands of dollars in legal bills and sanctions amid numerous lawsuits in addition to the new criminal charges - related to his work for Donald Trump after the 2020 election.",
    "url": "https://www.cnn.com/2023/08/15/politics/giuliani-money-lawsuits-trump/"
  },
  {
    "text": "Statement from White House Press Secretary Karine Jean-Pierre on the President and First Lady Traveling to Hawaii  —  The President and First Lady will travel to Maui on Monday, August 21 to meet with first responders, survivors, as well as federal, state, and local officials, in the wake of deadly wildfires on the island.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2023/08/16/statement-from-white-house-press-secretary-karine-jean-pierre-on-the-president-and-first-lady-traveling-to-hawaii/"
  }
]