[
  {
    "text": "Playbook: Scalise vs. Jordan vs. 218  —  Presented by With help from Eli Okun and Garrett Ross  —  DRIVING THE DAY  —  OVERNIGHT FROM THE WSJ — “Rising Interest Rates Mean Deficits Finally Matter,” by WSJ's Greg Ip: “[T]he scale and upward trajectory of U.S. borrowing and absence … ",
    "url": "https://www.politico.com/newsletters/playbook/2023/10/05/scalise-vs-jordan-vs-218-00120088"
  },
  {
    "text": "Hours After Gag Order, Trump Launches Fresh Vitriol Against New York Judge  —  Donald Trump on Wednesday launched fresh vitriol against the judge and prosecuting attorney in his New York business fraud trial, carefully skirting a gag order imposed on him just a day prior.",
    "url": "https://newrepublic.com/post/175971/trump-gag-order-attack-new-york-judge-attorney-general"
  },
  {
    "text": "Florida Rep. Frederica Wilson calls out John Kelly: 'He knew Mr. Trump's record'  —  She's considering suing him for defamation.  —  Rep. Frederica Wilson has many things to say about former White House chief of staff John Kelly.  None are very nice.  —  “Mr. Kelly is an idiot,” she said in an interview Wednesday.",
    "url": "https://www.politico.com/news/2023/10/04/florida-frederica-wilson-john-kelly-trump-00120029"
  },
  {
    "text": "Bidens' dog, Commander, involved in more White House biting incidents than previously reported  —  President Joe Biden and first lady Dr. Jill Biden's 2-year-old German shepherd, Commander, has been involved in more biting incidents than previously reported at the White House, multiple sources familiar with the matter told CNN.",
    "url": "https://www.cnn.com/2023/10/04/politics/commander-biden-white-house/"
  },
  {
    "text": "From a Capitol Hill Basement, Bannon Stokes the Republican Party Meltdown  —  The former Trump adviser has helped create the spectacle of G.O.P. dysfunction, using it to build his own following and those of the right-wing House rebels who took down Kevin McCarthy.",
    "url": "https://www.nytimes.com/2023/10/04/us/politics/bannon-republicans-gaetz-mace.html"
  },
  {
    "text": "What Can Patrick McHenry, the Interim Speaker, Do?  —  Representative Patrick T. McHenry of North Carolina, who took the gavel, may oversee the election of a new speaker.  But he does not have the power to run the chamber.  —  Moments after the House voted to boot Representative Kevin McCarthy … ",
    "url": "https://www.nytimes.com/2023/10/04/us/politics/patrick-mchenry-interim-speaker.html"
  },
  {
    "text": "Trump Announces $45.5 Million Fund-Raising Haul, Tripling DeSantis  —  The Trump campaign's total, which cannot be independently verified until later this month, was built in part by an outpouring of money after his mug shot in Georgia was released.  —  Donald J. Trump's campaign announced … ",
    "url": "https://www.nytimes.com/2023/10/04/us/politics/trump-campaign-fund-raising-desantis.html"
  },
  {
    "text": "Officiant fires gun to welcome bride, shoots grandson — and wedding goes on  —  Michael Gardner wanted to start his nephew's wedding with a bang.  —  His plan involved shooting a blank from a revolver into the air to signal to the roughly 200 people gathered on Saturday that the outdoor ceremony … ",
    "url": "https://www.washingtonpost.com/nation/2023/10/04/wedding-officiant-shoots-grandson-michael-gardner-nebraska/"
  },
  {
    "text": "GOP candidate says he smeared ‘fecal matter’ on daycare center because of Obama: report  —  A Republican candidate for New Jersey Assembly has admitted to being convicted in a criminal incident where he smeared “fecal matter” on the door of a daycare facility he was feuding with in 2009 … ",
    "url": "https://www.rawstory.com/gop-2665797669/"
  },
  {
    "text": "Biden administration waives 26 federal laws to allow border wall construction in South Texas  —  It marks the administration's first use of a sweeping executive power employed often during the Trump presidency.  —  McALLEN, Texas — The Biden administration announced on Wednesday … ",
    "url": "https://www.politico.com/news/2023/10/04/biden-administration-waives-26-federal-laws-to-allow-border-wall-construction-in-south-texas-00120045"
  },
  {
    "text": "Russia Withdraws Black Sea Fleet Vessels From Crimea Base After Ukrainian Attacks  —  Pullout represents painful setback for the Kremlin, which seized Crimea in 2014  —  Russia has withdrawn the bulk of its Black Sea Fleet from its main base in occupied Crimea, a potent acknowledgment … ",
    "url": "https://www.wsj.com/world/russia-withdraws-black-sea-fleet-vessels-from-crimea-base-after-ukrainian-attacks-51d6d4f5?mod=followamazon"
  },
  {
    "text": "Imagine If Democrats Had Done It  —  The Republican party is sustained by two fundamental asymmetries.  And there's no cure for either of them.  —  ∙ Paid  —  We did an emergency live show last night about the McCarthy ouster.  You can find it here.  (There won't be a Thursday night show this week.)",
    "url": "https://thetriad.thebulwark.com/p/imagine-if-democrats-had-done-it"
  },
  {
    "text": "‘The Drew Barrymore Show’ Writers Decline to Return (Exclusive)  —  The daytime talk show is coming back Oct. 16, but the show's three WGA writers — Chelsea White, Cristina Kinon and Liz Koe — have turned down an offer to return with it.  —  The Drew Barrymore Show is once again readying its return … ",
    "url": "https://www.hollywoodreporter.com/tv/tv-news/drew-barrymore-show-writers-decline-return-1235606269/"
  },
  {
    "text": "20 GOP senators led by Rick Scott vow to block bills not related to funding government  —  Facing a pileup of spending bills and a possible government shutdown, 20 Republican senators led by Sen. Rick Scott (Fla.) say they will delay any legislation moving on the Senate floor that does not relate directly to funding the government.",
    "url": "https://thehill.com/homenews/senate/4238926-20-gop-senators-led-by-rick-scott-vow-to-block-bills-not-related-to-funding-government/"
  },
  {
    "text": "‘Fixin’ to ride the lightning': Soldier who was handcuffed, hit, pepper-sprayed during traffic stop appeals case after jury mostly sides with police  —  A U.S. Army soldier who sued police after being pepper-sprayed, beaten and threatened with firearms during a traffic stop in a rural southern Virginia town … ",
    "url": "https://lawandcrime.com/civil-rights/fixin-to-ride-the-lightning-soldier-who-was-handcuffed-hit-pepper-sprayed-during-traffic-stop-appeals-case-after-jury-mostly-sides-with-police/"
  },
  {
    "text": "Even some RNC members are fed up with ‘embarrassing,’ Trump-less debates  —  Top RNC officials aren't actively trying to court Trump to participate in future debates, as they did previously.  —  With Donald Trump boycotting and viewership falling off, some Republican National Committee members … ",
    "url": "https://www.politico.com/news/2023/10/05/trump-presidential-debates-rnc-future-00120012"
  },
  {
    "text": "Colorado high court to hear case against Christian baker who refused to make trans-themed cake  —  The baker previously won a case before the U.S. Supreme Court on a technicality in 2018, after refusing to make a gay couple's wedding cake.  —  On the heels of a U.S. Supreme Court victory … ",
    "url": "https://www.nbcnews.com/nbc-out/out-politics-and-policy/colorado-high-court-hear-case-christian-baker-refused-make-trans-theme-rcna118815"
  },
  {
    "text": "Matt Gaetz Says He's Fueled By Small Dollars.  A Leaked Video Shows Him Courting GOP Megadonors.  —  Rep. Matt Gaetz (R-FL) says he's fueled by small donations.  A recent video obtained by The Daily Beast shows him holding an event with megadonors. … Pay Dirt is a weekly foray into the pigpen of political funding.",
    "url": "https://www.thedailybeast.com/matt-gaetz-says-hes-fueled-by-small-dollars-a-leaked-video-shows-him-courting-gop-megadonors"
  },
  {
    "text": "PA 2024 Elections: Casey Leads McCormick In U.S. Senate Race, Quinnipiac University Pennsylvania Poll Finds; Race For The White House: Biden vs. Trump Matchup Barely Budges  —  mail_outline  —  Roughly two weeks after Republican David McCormick announced he would challenge incumbent Democratic … ",
    "url": "https://poll.qu.edu/poll-release?releaseid=3879"
  },
  {
    "text": "Giuliani to lose 2nd attorney in Georgia, leaving him without local legal team  —  Several of Giuliani's former lawyers have sued him for failure to pay his bills.  —  A second lawyer for Rudy Giuliani is seeking to depart his legal team in Georgia, sources familiar with the matter tell ABC News … ",
    "url": "https://abcnews.go.com/US/2nd-giuliani-attorney-leaving-legal-team-georgia/story?id=103703276"
  }
]