[
  {
    "text": "Trump urges Garland to block release of Jack Smith's final report  —  His lawyers wrote to Attorney General Merrick Garland.  —  Donald Trump and two of his allies are making a last-minute push to block special counsel Jack Smith from issuing his final report on his two dismissed criminal cases against the president-elect.",
    "url": "https://www.politico.com/news/2025/01/06/trump-garland-jack-smith-filing-00196786"
  },
  {
    "text": "Trump's lawyers ask AG Garland not to release special counsel report  —  Attorney General Merrick Garland has indicated he would make public any special counsel report — with the necessary redactions — that reaches his desk.  —  Donald Trump's lawyers have read special counsel Jack Smith's … ",
    "url": "https://www.washingtonpost.com/national-security/2025/01/07/jack-smith-trump-special-counsel-report-garland/"
  },
  {
    "text": "Release Jack Smith's Report  —  You can never really tell which of the wacky ideas that Trump spins up will end up forgotten in a few days and which will lodge like a splinter in his brain forever.  During his first term, “We're gonna buy Greenland” seemed like it belonged to the former category.",
    "url": "https://www.thebulwark.com/p/release-jack-smiths-report"
  },
  {
    "text": "More Speech and Fewer Mistakes  —  Joel Kaplan, Chief Global Affairs Officer  —  https://about.fb.com/wp-content/ uploads/2025/01/V2.Single-Take-CS25_MZ_ JanAnnouncement_v09_16x9.mp4  —  Takeaways  — Starting in the US, we are ending our third party fact-checking program and moving to a Community Notes model.",
    "url": "https://about.fb.com/news/2025/01/meta-more-speech-fewer-mistakes/"
  },
  {
    "text": "Meta is ending its fact-checking program in favor of a ‘community notes’ system similar to X  —  Meta CEO Mark Zuckerberg announced a series of major changes to the company's moderation policies and practices, saying that the election felt like a “cultural tipping point.”",
    "url": "https://www.nbcnews.com/tech/social-media/meta-ends-fact-checking-program-community-notes-x-rcna186468"
  },
  {
    "text": "Meta is getting rid of fact checkers.  Zuckerberg acknowledged more harmful content will appear on the platforms now  —  New York CNN  —  In a number of sweeping changes that will significantly alter the way that posts, videos and other content are moderated online … ",
    "url": "https://www.cnn.com/2025/01/07/tech/meta-censorship-moderation/"
  },
  {
    "text": "Former French far-right leader Jean-Marie Le Pen dies aged 96  —  Jean-Marie Le Pen, founder of the far-right National Front party who tapped into working class concerns over immigration and globalisation, shaking up the French political establishment, has died, sources close to his daughter Marine Le Pen said on Tuesday.",
    "url": "https://www.reuters.com/world/europe/former-french-far-right-leader-jean-marie-le-pen-dies-aged-96-media-reports-2025-01-07/"
  },
  {
    "text": "Jean-Marie Le Pen, French far-right leader known for fiery rhetoric against immigration, dies at 96  —  Jean-Marie Le Pen, the founder of France's far-right National Front who was known for fiery rhetoric against immigration and multiculturalism that earned him both staunch supporters and widespread condemnation, has died.",
    "url": "https://apnews.com/article/jean-marie-le-pen-france-obituary-67c1f95b9c864374b2bcba20f746d530"
  },
  {
    "text": "Melania Trump Documentary Scores Massive Amazon Payday  —  It's 2025, and even the Walt Disney Co. is kissing Donald Trump's ring.  But it's still stunning that Amazon is paying a whopping $40 million to license the Brett Ratner-directed Melania Trump documentary.",
    "url": "https://puck.news/melania-trump-documentary-scores-massive-amazon-payday/"
  },
  {
    "text": "Mark Carney Says He's Considering Running to Succeed Trudeau  —  Mark Carney, the former governor of the Bank of Canada and Bank of England, said he's considering entering the race to replace Justin Trudeau as Canada's prime minister.  —  Carney said he's “encouraged and honored by the support … ",
    "url": "https://www.bloomberg.com/news/articles/2025-01-07/mark-carney-says-he-s-considering-running-to-succeed-trudeau"
  },
  {
    "text": "Trump's one-bill two-step perplexes GOP senators  —  GOP senators are questioning the president-elect's commitment to “one powerful bill.”  —  If Donald Trump thought he was settling the GOP's most important strategy dispute, Senate Republicans are not getting the message.",
    "url": "https://www.politico.com/news/2025/01/07/trump-gop-confusion-reconciliation-plan-00196745"
  },
  {
    "text": "Danish king changes coat of arms amid row with Trump over Greenland  —  Design shows intent to keep control of Faroe Islands and Greenland - which Trump says he would like the US to buy  —  The Danish king has shocked some historians by changing the royal coat of arms to more prominently feature Greenland … ",
    "url": "https://www.theguardian.com/world/2025/jan/06/danish-king-changes-coat-of-arms-in-apparent-rebuke-to-donald-trump"
  },
  {
    "text": "FACT SHEET: President Biden Establishes Chuckwalla and Sáttítla Highlands National Monuments in California  —  President Biden has now conserved more lands and waters than any President in history and has created the largest corridor of protected lands in the lower 48 states, the Moab to Mojave Conservation Corridor",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2025/01/07/fact-sheet-president-biden-establishes-chuckwalla-and-sattitla-highlands-national-monuments-in-california/"
  },
  {
    "text": "How Democrats should talk about Trump's corruption  —  “There's really a need for a whole new set of reforms,” Noah Bookbinder says.  —  ∙ Paid  —  Donald Trump is the most brazenly self-dealing president in history.  He's surrounded these days by an obscene cast of billionaires … ",
    "url": "https://www.publicnotice.co/p/noah-bookbinder-2025-interview-trump-corruption"
  },
  {
    "text": "McDonald's is the latest company to roll back diversity goals  —  Four years after launching a push for more diversity in its ranks, McDonald's is ending some of its diversity practices, citing a U.S. Supreme Court's decision that outlawed affirmative action in college admissions.",
    "url": "https://apnews.com/article/mcdonalds-diversity-dei-goals-845d94cd46511341a43e98e057b0fa8e"
  },
  {
    "text": "Dana White, John Elkann and Charlie Songhurst to Join Meta Board of Directors  —  Meta today announced that Dana White, John Elkann and Charlie Songhurst have been elected to the company's board of directors.  —  Mark Zuckerberg, Founder and CEO of Meta, said, “Dana, John and Charlie will add … ",
    "url": "https://about.fb.com/news/2025/01/dana-white-john-elkann-charlie-songhurst-meta-board-of-directors/"
  },
  {
    "text": "U.S. in Talks to Swap Detained Americans in Afghanistan for Guantanamo Prisoner  —  Biden administration negotiates for the release of three Americans in exchange for an alleged Osama bin Laden associate—and seeks to avoid political blowback  —  WASHINGTON—The Biden administration … ",
    "url": "https://www.wsj.com/politics/national-security/u-s-in-talks-to-swap-detained-americans-in-afghanistan-for-guantanamo-prisoner-c2fe0df9?st=HweNmK"
  },
  {
    "text": "Why Mike Johnson's fake “Jefferson prayer” matters  —  Replacing facts with phony history is a linchpin of the Christian nationalist movement  —  One cannot say for certain that Rep. Mike Johnson was deliberately lying during his acceptance speech to return as Speaker of the House.",
    "url": "https://www.salon.com/2025/01/07/why-mike-johnsons-fake-jefferson-prayer-matters/"
  },
  {
    "text": "Statement from President Joe Biden on Prime Minister Justin Trudeau of Canada  —  The last time I visited Ottawa, I said that the United States chooses to link our future with Canada because we know that we'll find no better ally, no closer partner, and no steadier friend.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2025/01/07/statement-from-president-joe-biden-on-prime-minister-justin-trudeau-of-canada/"
  },
  {
    "text": "Rudy Giuliani is in contempt of court in $148 million defamation case  —  Rudy Giuliani was found in contempt of court Monday for failing to properly respond to requests for information as he turned over assets to satisfy a $148 million defamation judgment granted to two Georgia election workers.",
    "url": "https://apnews.com/article/rudy-giuliani-defamation-georgia-election-workers-5fe7787f42b4b89ef9d6df50bcde2efb"
  },
  {
    "text": "Biden admin sends 11 Guantanamo detainees to Oman for resettlement  —  Two detainees were accused of working as bodyguards for bin Laden in Afghanistan  —  The Biden administration on Monday announced the transfer of 11 Yemeni detainees, including two former bodyguards for Osama bin Laden … ",
    "url": "https://www.foxnews.com/politics/biden-admin-sends-11-guantanamo-detainees-oman-resettlement"
  },
  {
    "text": "Biden admin finalizes rule to ban medical debt from credit reports … - The CFPB estimates that for Americans with medical debt, the new rule could raise their credit scores by an average of 20 points.  — “People who get sick shouldn't have their financial future upended,” CFPB Director Rohit Chopra said in the press release.",
    "url": "https://www.axios.com/2025/01/07/medical-debt-ban-credit-reports-bidn-cfpb-rule"
  },
  {
    "text": "Virginia Holds the First Elections of the New Trump Era  —  Voters are going to the polls on Tuesday in three special elections for the legislature that will serve as barometers of political energy for both parties.  —  The first special elections since President-elect Donald J. Trump won … ",
    "url": "https://www.nytimes.com/2025/01/07/us/politics/virginia-elections-legislature.html"
  },
  {
    "text": "Musk plays politics abroad as world leaders brace for Trump's return  —  Elon Musk's personal foreign policy of promoting far-right parties is sparking outrage among leaders in Europe and handing them a dilemma: How do they rebuke the tech titan without angering his new patron — Donald Trump?",
    "url": "https://www.cnn.com/2025/01/07/politics/the-dangers-of-elon-musks-personal-foreign-policy/"
  },
  {
    "text": "Pressure mounts on EU to use legal weapons against Musk's interference  —  European Commission says it will study whether X gives unfair boost to far right in German election.  —  What are you waiting for, Brussels?  —  Elon Musk's decision to host German far-right leader Alice Weidel … ",
    "url": "https://www.politico.eu/article/elon-musk-interference-alice-weidel-x-livestream-afd-germany-eu-digital-services-act/"
  },
  {
    "text": "Carter to Lie in State in Capitol Starting Tuesday  —  Former President Jimmy Carter, who once banned the playing of “Hail to the Chief,” will be honored with three days of elaborate ceremonies in the nation's capital.  —  Former President Jimmy Carter, who disavowed the trappings … ",
    "url": "https://www.nytimes.com/2025/01/07/us/politics/jimmy-carter-washington-events.html"
  },
  {
    "text": "10 corporations that kept their promises after January 6, 2021  —  After a violent mob stormed the Capitol building on January 6, 2021, hundreds of corporations took action to communicate to the public that democracy itself was more important than maximizing their political influence.",
    "url": "https://popular.info/p/10-corporations-that-kept-their-promises"
  }
]