[
  {
    "text": "Texas Supreme Court Rules Against Woman Who Sought Court-Approved Abortion  —  Hours before the ruling, a group representing the woman, whose fetus received a fatal diagnosis, said she was leaving Texas for an abortion.  —  The Texas Supreme Court on Monday overturned a lower court order allowing … ",
    "url": "https://www.nytimes.com/2023/12/11/us/texas-abortion-kate-cox.html"
  },
  {
    "text": "Texas Supreme Court rules against woman at center of abortion battle  —  Kate Cox had already decided to go out of state for procedure after learning that carrying the pregnancy to term could jeopardize her future fertility  —  Kate Cox, a Dallas-area woman who petitioned a judge … ",
    "url": "https://www.washingtonpost.com/politics/2023/12/11/kate-cox-texas-abortion/"
  },
  {
    "text": "Special counsel reveals plans to use Trump's phone data at trial  —  Jack Smith indicated that he plans to call an expert witness who extracted and reviewed data copied from Trump's phone.  —  Special counsel Jack Smith has extracted data from the cell phone Donald Trump used while in the White House … ",
    "url": "https://www.politico.com/news/2023/12/11/special-counsel-trump-phone-data-trial-00131196"
  },
  {
    "text": "10 alarming things Trump has promised to do in a second term  —  This is reality: Donald Trump will almost certainly be the Republican nominee for President for the third consecutive election.  Given the United State's polarized political climate, either major party nominee has a realistic chance … ",
    "url": "https://popular.info/p/10-alarming-things-trump-has-promised"
  },
  {
    "text": "Rep. Bob Good, DeSantis backer, elected new Freedom Caucus chair  —  The Virginia Republican's selection underscores the far-right group's independent streak, especially at a time Republicans are reluctant to break with the mercurial Donald Trump.  —  WASHINGTON — Rep. Bob Good, R-Va. … ",
    "url": "https://www.nbcnews.com/politics/congress/rep-bob-good-desantis-backer-elected-new-freedom-caucus-chair-rcna129241"
  },
  {
    "text": "Scoop: House Freedom Caucus drama erupts over its next leader  —  An influential member of the House Freedom Caucus won't run for a leadership spot, citing a recommendation by the group's board that Rep. Bob Good (R-Va.) serve as its next chairman. … - “I ask that we consider how to best increase … ",
    "url": "https://www.axios.com/2023/12/12/house-freedom-caucus-leader-drama-bob-good"
  },
  {
    "text": "Freedom Caucus elects new chair: Bob Good, who voted to boot McCarthy  —  There was some last-minute drama, as another member publicly questioned the Virginia conservative's ability to “increase our influence.”",
    "url": "https://www.politico.com/live-updates/2023/12/11/congress/good-gets-ahead-00131226"
  },
  {
    "text": "How a US Partisan Clash Over Immigration Has Stalled Ukraine Aid  — Republicans sense political advantage over surging migration  — Despite Zelenskiy visit, aid bill not likely to pass this year  —  Republican lawmakers sense political advantage on immigration and are pressing Democrats … ",
    "url": "https://www.bloomberg.com/news/articles/2023-12-12/how-a-us-partisan-clash-over-immigration-has-stalled-ukraine-aid"
  },
  {
    "text": "‘This is Definitely Plagiarism’: Harvard University President Claudine Gay Copied Entire Paragraphs From Others' Academic Work and Claimed Them as Her Own  —  Harvard University president Claudine Gay plagiarized numerous academics over the course of her academic career … ",
    "url": "https://freebeacon.com/campus/this-is-definitely-plagiarism-harvard-university-president-claudine-gay-copied-entire-paragraphs-from-others-academic-work-and-claimed-them-as-her-own/"
  },
  {
    "text": "President Claudine Gay Will Remain in Office, Harvard Corporation to Issue Statement in Support  —  Harvard President Claudine Gay will remain in office with the support of the Harvard Corporation — the University's highest governing body — following the conclusion of the board's meeting on Monday … ",
    "url": "https://www.thecrimson.com/article/2023/12/12/gay-stays-in-office-corporation-support/"
  },
  {
    "text": "Gov. Chris Sununu to announce endorsement in Republican presidential race at Tuesday event, sources tell WMUR  —  Governor to endorse Nikki Haley, sources say  —  MANCHESTER, N.H. —  Republican presidential candidates have been competing for Gov. Chris Sununu's endorsement for months.",
    "url": "https://www.wmur.com/article/chris-sununu-new-hampshire-primary-endorsement/46101497"
  },
  {
    "text": "Statement from the Harvard Corporation: Our President  —  As members of the Harvard Corporation, we today reaffirm our support for President Gay's continued leadership of Harvard University.  Our extensive deliberations affirm our confidence that President Gay is the right leader to help … ",
    "url": "https://www.harvard.edu/blog/2023/12/12/statement-from-the-harvard-corporation-our-president/"
  },
  {
    "text": "Supreme Court Could Gift Trump a Trial-Free Super Tuesday  —  The Supreme Court now has full control of whether or not Donald Trump's 2020 coup trial in D.C. starts in early March—and interrupts the biggest state primary elections.  —  It's now entirely up to the Supreme Court whether … ",
    "url": "https://www.thedailybeast.com/supreme-court-could-gift-trump-a-trial-free-super-tuesday"
  },
  {
    "text": "Google's App Store Ruled an Illegal Monopoly, as a Jury Sides With Epic Games  —  A jury in San Francisco unanimously found that Google stifled competition for its app store.  A judge will now decide on what fixes to require at the company, but appeals could delay the impact of the case for years.",
    "url": "https://www.wired.com/story/googles-app-store-monopoly-ruled-illegal-jury-epic/"
  },
  {
    "text": "Exclusive: Former Mar-a-Lago employee-turned-witness repeatedly contacted by Trump and associates before documents charges  —  West Palm Beach, FL CNN  —  Three months after the FBI seized classified records from Mar-a-Lago last August, a longtime employee of Donald Trump's private club quit his job.",
    "url": "https://www.cnn.com/2023/12/11/politics/former-mar-a-lago-employee-special-counsel-trump/"
  },
  {
    "text": "It's ‘insulting’ to have ‘nonsense Republicans’ on Biden impeachment inquiry panel, Democrat says  —  Rep. Jasmine Crockett (D-Texas) dubbed some of her Republican colleagues “idiots” and “a-holes” alongside criticism of the House Oversight Committee's attempts to launch a formal impeachment inquiry into President Biden.",
    "url": "https://thehill.com/homenews/house/4355290-jasmine-crockett-nonsense-republicans-biden-impeachment-inquiry-panel/"
  },
  {
    "text": "Giuliani's Defense Says $43 Million in Damages Would Be ‘Death Penalty’  —  The bizarre remark came in opening statements of a trial to determine how much he'll owe in damages to two Georgia poll workers.  —  On day one of Rudy Giuliani's trial to determine how much he'll owe a pair … ",
    "url": "https://www.thedailybeast.com/rudy-giulianis-defense-says-awarding-dollar43-million-in-damages-would-be-death-penalty"
  },
  {
    "text": "A deadly delivery highlights ‘falsified’ heat records at USPS  —  The Postal Service allegedly doctored heat training records of thousands of mail carriers.  One of them died on a blistering day in June.  —  Eugene Gates, a Dallas letter carrier for the Postal Service, died of heat exposure in June.",
    "url": "https://www.politico.com/news/2023/12/11/usps-major-heat-deaths-00128875"
  },
  {
    "text": "A Democratic campaign deploys the first synthetic AI caller  —  A candidate in a competitive Pennsylvania congressional race is using “Ashley,” an AI campaign volunteer, stretching the bounds of how technology shapes retail politics.  —  Voters in south-central Pennsylvania began getting calls … ",
    "url": "https://www.politico.com/news/2023/12/12/democratic-campaign-ai-caller-00131180"
  },
  {
    "text": "Biden's Hunter trigger: Their bond is deep, complicated  —  In private, no issue is more likely to anger or sadden President Biden than attacks on his son Hunter, according to people close to the president who have seen his moods shift when there's bad news about Hunter.",
    "url": "https://www.axios.com/2023/12/12/biden-hunter-trigger-bond-deep-complicated"
  },
  {
    "text": "Biden Warns Israel That Public Opinion Can Shift in Hamas War  — President calls on Israel to be ‘careful’ as death toll mounts  — Biden calls surge in antisemitism around globe ‘sickening’  —  President Joe Biden cautioned that public opinion in support of Israel in its war … ",
    "url": "https://www.bloomberg.com/news/articles/2023-12-12/biden-warns-israel-that-public-opinion-can-shift-in-hamas-war"
  }
]