[
  {
    "text": "‘Dead heat’: Trump pulls even with Harris in NBC News poll  —  A close election has never looked more tightly divided, with Harris' popularity declining from its previous high and abortion atop voters' issue list.  —  Former President Donald Trump and Vice President Kamala Harris are deadlocked … ",
    "url": "https://www.nbcnews.com/politics/2024-election/dead-heat-trump-pulls-even-harris-nbc-news-poll-rcna174201"
  },
  {
    "text": "Economic discontent, issue divisions add up to tight presidential contest: POLL  —  Harris has 50% support to Trump's 48% among likely voters, the poll finds.  —  Republican presidential nominee former President Donald Trump, left, and Democratic presidential nominee Vice President Kamala Harris during … ",
    "url": "https://abcnews.go.com/Politics/economic-discontent-issue-divisions-add-tight-presidential-contest/story?id=114723390"
  },
  {
    "text": "CBS News Trump-Harris poll shows one election, two worlds: How information, beliefs shape tight campaign  —  The 2024 presidential contest between Kamala Harris and Donald Trump is more than just two ideologies competing over what should happen.  It's two groups of voters that look … ",
    "url": "https://www.cbsnews.com/news/trump-harris-poll-how-information-beliefs-shape-tight-2024-campaign/"
  },
  {
    "text": "Why Is Trump Gaining With Black and Hispanic Voters?  —  Five possible explanations for the increases in support, particularly among young men.  —  In 2016, Donald J. Trump became the Republican nominee and ultimately won the presidency after calling many Mexican immigrants rapists … ",
    "url": "https://www.nytimes.com/2024/10/13/upshot/trump-black-hispanic-voters-harris.html"
  },
  {
    "text": "Tensions rise between Harris and Biden teams as election nears … - “They're too much in their feelings,” one close Harris ally said of the president's team — a sentiment shared even by some White House aides. … - Biden gave an impromptu press conference in the White House briefing room Friday … ",
    "url": "https://www.axios.com/2024/10/13/kamala-harris-biden-campaign-tension"
  },
  {
    "text": "Liz Cheney issues dire warning about ‘fundamentally cruel’ Trump, agrees he's a ‘fascist’  —  The former GOP representative from Wyoming said Vice President Kamala Harris, if elected, “will lead with a sincere heart” as “someone who's dedicated her life to public service.”",
    "url": "https://www.nbcnews.com/politics/2024-election/liz-cheney-issues-dire-warning-fundamentally-cruel-trump-agrees-s-fasc-rcna175193"
  },
  {
    "text": "Trump suggests heckler should ‘get the hell knocked out of her’ after rally  —  The remarks were part of a dark speech at a California rally where Trump called the U.S. an “occupied country.”  —  COACHELLA, Calif- Former president Donald Trump suggested that a heckler would later get … ",
    "url": "https://www.washingtonpost.com/politics/2024/10/12/trump-heckler-violence/"
  },
  {
    "text": "Machine for Fascism: The Two Stephens  —  When I saw the news that Trump is planning a rally at Madison Square Garden — as the Nazis did in 1939 — I checked the date to see whether that was before or after Steve Bannon gets out of prison.  —  Bannon is due to get out on October 29; the rally is two days earlier, on October 27.",
    "url": "https://www.emptywheel.net/2024/10/13/machine-for-fascism-the-two-stephens/"
  },
  {
    "text": "Donald Trump's Niece Says He Is Now ‘Owned’ by Elon Musk  —  'DEVIL'S BARGAIN'  —  Mary Trump described the Tesla CEO, who also owns X, formerly Twitter, as “the world's richest fascist” and a “South African jumping bean.”  —  Donald Trump is now “owned” by MAGA super-fan Elon Musk … ",
    "url": "https://www.thedailybeast.com/donald-trumps-niece-says-he-is-now-owned-by-tesla-boss-elon-musk"
  },
  {
    "text": "Here are the states we could be waiting on to declare a Harris-Trump winner  —  Voters are increasingly likely to have to wait past Election Day to find out who will become their next president.  —  Among the battleground states, Georgia could be the first to be called, even as early as midnight, some experts predict.",
    "url": "https://thehill.com/homenews/campaign/4927322-voters-wait-presidential-election/"
  },
  {
    "text": "California Denies Launching Rights to SpaceX Because Musk Supports Trump—Really  —  The Commissars of California are so concerned about enforcing political uniformity that they are denying the military's right to launch from Vandenburg Air Force Base using SpaceX rockets.  —  Why?",
    "url": "https://hotair.com/david-strom/2024/10/13/california-denies-launching-rights-to-spacex-because-musk-supports-trump-really-n3795732"
  },
  {
    "text": "Mystery Drones Swarmed a U.S. Military Base for 17 Days.  The Pentagon Is Stumped.  —  U.S. officials don't know who is behind the drones that have flown unhindered over sensitive national-security sites—or how to stop them",
    "url": "https://www.wsj.com/politics/national-security/drones-military-pentagon-defense-331871f4"
  },
  {
    "text": "‘As serious as it gets’: Trump ally stuns with ‘petrifying’ answer about executing enemies  —  Former Lt. Gen. Mike Flynn, the controversial figure Donald Trump named to be his White House national security adviser, stunned observers with his answer to a question about potentially executing political enemies.",
    "url": "https://www.rawstory.com/mike-flynn-executing-swamp-petrifying/"
  },
  {
    "text": "Podcasts become politician magnets … - “We all have insane information overload, so if you try to spread yourself too thin and you're saying 10 different things to appeal to everyone, people are just going to forget about it,” Lulu Cheng Meservey, founder of strategic comms firm Rostra told Axios' Eleanor Hawkins last year.",
    "url": "https://www.axios.com/2024/10/13/trump-harris-podcasts-call-her-daddy"
  },
  {
    "text": "America First Policy Institute, a group advising Trump, says its systems were breached  —  A group helping to lay the groundwork for a future Donald Trump administration said its computer systems were breached, marking the second known instance that people supporting the former president have been the target of a cyberattack.",
    "url": "https://apnews.com/article/america-first-policy-institute-breach-2626d34b7426c4917f11052dafc7041c"
  },
  {
    "text": "“Threatening to cancel votes”: Florida officials allege fraud to kneecap abortion rights amendment  —  The last-minute report threatens to “cancel” votes for an amendment to restore abortion rights in the state  —  In a last-minute effort to kill a proposed ballot amendment … ",
    "url": "https://www.salon.com/2024/10/12/threatening-to-cancel-votes-florida-officials-allege-fraud-to-kneecap-abortion-rights-amendment/"
  }
]