[
  {
    "text": "Louisiana Legislature approves bill classifying abortion pills as controlled dangerous substances  —  Two abortion-inducing drugs could soon be reclassified as controlled and dangerous substances in Louisiana under a first-of-its-kind bill that received final legislative passage Thursday … ",
    "url": "https://apnews.com/article/abortion-pills-louisiana-legislature-controlled-substance-06ea3e8df86b72b473efe8fc71054ddf"
  },
  {
    "text": "Louisiana Lawmakers Vote to Make Abortion Pills Controlled Substances  —  The legislation would make possession of the drugs without a prescription a crime in Louisiana, punishable with jail time.  —  Louisiana lawmakers passed legislation on Thursday to make the state the first in the nation … ",
    "url": "https://www.nytimes.com/2024/05/23/us/politics/louisiana-abortion-pills-controlled-substances.html"
  },
  {
    "text": "Louisiana is set to make possessing abortion pills without a prescription punishable by up to 10 years in prison  —  It now heads to the desk of GOP Gov. Jeff Landry, who has not publicly weighed in on the legislation but is expected to sign it.  —  Louisiana lawmakers on Thursday approved … ",
    "url": "https://www.politico.com/news/2024/05/23/louisiana-abortion-pill-criminal-penalties-00159735"
  },
  {
    "text": "The White House to the left: We told you so on crime  —  ‘Well-meaning ideas have gone too far, and we need a sensible approach.’  —  The defeat of a liberal Portland prosecutor at the hands of a tough-on-crime challenger has hardened a view among top White House officials that Democrats need … ",
    "url": "https://www.politico.com/news/2024/05/23/white-house-oregan-turn-towards-center-00159588"
  },
  {
    "text": "Supreme Court allows disputed South Carolina voting map, a win for GOP  —  At issue was whether the map was an unconstitutional attempt to divvy voters up by race — or was permitted partisan gerrymandering.  —  The Supreme Court on Thursday allowed the use of a South Carolina congressional map … ",
    "url": "https://www.washingtonpost.com/politics/2024/05/23/supreme-court-ruling-south-carolina-voting-map-gerrymander/"
  },
  {
    "text": "Supreme Court Sides With Republicans Over South Carolina Voting Map  —  The case concerned a constitutional puzzle: how to distinguish the roles of race and partisanship in drawing voting maps when Black voters overwhelmingly favor Democrats.  —  The Supreme Court cleared the way on Thursday … ",
    "url": "https://www.nytimes.com/2024/05/23/us/supreme-court-south-carolina-voting-map.html"
  },
  {
    "text": "“No blaming it on his spouse”: Critics say seditious Alito flags expose his “Christian nationalism”  —  The Supreme Court justice isn't hiding his far-right sympathies, but at least this time he's not blaming his wife  —  When Supreme Court Justice Samuel Alito was caught raising an upside … ",
    "url": "https://www.salon.com/2024/05/23/no-blaming-it-on-his-spouse-critics-say-seditious-alito-flags-expose-his-christian-nationalism/"
  },
  {
    "text": "A Unique Election Driven by a Traditional Issue  —  There are a lot of unique and untested variables in this upcoming presidential election.  It is the first race in more than 100 years between an incumbent and former incumbent president (both of whom would be the oldest ever to be inaugurated).",
    "url": "https://www.cookpolitical.com/survey-research/2024-swing-state-project/unique-election-driven-traditional-issue"
  },
  {
    "text": "Steven Kramer Charged with Voter Suppression Over AI-Generated President Biden Robocalls  —  Concord, NH - Attorney General John M. Formella announces that today, Steven Kramer, age 54, of New Orleans, LA, has been indicted on charges of felony voter suppression and misdemeanor impersonation of a candidate.",
    "url": "https://www.doj.nh.gov/news/2024/20240523-kramer-voter-suppression.html"
  },
  {
    "text": "Clarence Thomas attacks Brown v. Education ruling amid 70th anniversary … - Those remedies came through “extravagant uses of judicial power” to end racial segregation in the 1950s and 60s, Thomas wrote.  — Federal courts have limited power to grant equitable relief … ",
    "url": "https://www.axios.com/2024/05/23/clarence-thomas-supreme-court-racial-segregation"
  },
  {
    "text": "Justice Department Sues Live Nation-Ticketmaster for Monopolizing Markets Across the Live Concert Industry  —  For Immediate Release  —  Live Nation-Ticketmaster's Exclusionary Conduct and Dominance Across the Live Concert Ecosystem Harms Fans, Innovation, Artists, and Venues",
    "url": "https://www.justice.gov/opa/pr/justice-department-sues-live-nation-ticketmaster-monopolizing-markets-across-live-concert"
  },
  {
    "text": "Top Biden campaign official held Zoom call with Haley supporters hours after she endorsed Trump  —  “The common theme was, they feel homeless and they need a reason to vote for Biden.  A lot of them are just not there yet.”  —  A top official with Joe Biden's presidential campaign held … ",
    "url": "https://www.politico.com/news/2024/05/23/biden-nikki-haley-supporters-trump-endorsement-00159692"
  },
  {
    "text": "Garland calls Trump's false claim of Biden DOJ plan to potentially assassinate him during FBI's Mar-a-Lago search ‘extremely dangerous’  —  He noted the FBI had a similar policy during the search of Biden's home.  —  A police car is seen outside former President Donald Trump's residence in Mar-A-Lago … ",
    "url": "https://abcnews.go.com/Politics/garland-calls-trumps-false-claim-biden-doj-plan/story?id=110504598"
  },
  {
    "text": "Revelation of secret Obama-era program casts doubt on stated reason for Trump Mar-a-Lago raid  —  ‘The law protects only those who follow the norms of one party,’ America First Legal Vice President Dan Epstein says  —  FIRST ON FOX: A purportedly never-before-seen Department of Defense memo … ",
    "url": "https://www.foxnews.com/politics/revelation-secret-obama-era-program-casts-doubt-stated-reason-trump-mar-a-lago-raid"
  },
  {
    "text": "US preparing $275 million weapons package for Ukraine, officials say  —  The United States is preparing a $275 million military aid package for Ukraine, which will include 155mm artillery shells, precision aerial munitions and ground vehicles, three U.S. officials told Reuters on Thursday.",
    "url": "https://www.reuters.com/world/europe/us-preparing-275-million-weapons-package-ukraine-officials-2024-05-23/"
  },
  {
    "text": "Natalie Harp: Gatekeeper to the Reich  —  I want to unpack a Marc Caputo story about Natalie Harp, who he says is the person who posted the Reich meme video to Trump's Truth Social account this week.  —  Trump's account posted the Reich video on Monday.  —  On Tuesday, AP identified a troll … ",
    "url": "https://www.emptywheel.net/2024/05/23/natalie-harp-gatekeeper-to-the-reich/"
  },
  {
    "text": "Congressman Andy Ogles admits his claims to have loaned $320,000 to his campaign were not true  —  GOP opponent Courtney Johnston: 'If Andy Ogles is willing to lie about his own money, what won't he lie about?'  —  NASHVILLE, Tenn. (WTVF) — Tennessee Congressman Andy Ogles filed 11 amendments … ",
    "url": "https://www.newschannel5.com/news/newschannel-5-investigates/revealed/congressman-andy-ogles-admits-his-claims-to-have-loaned-320-000-to-his-campaign-were-not-true"
  },
  {
    "text": "North Carolina public universities board repeals policy in vote that likely cuts diversity jobs  —  North Carolina's public university system board voted Thursday to repeal a nearly five-year-old diversity, equity and inclusion policy, meaning its 17 schools will likely join other major universities … ",
    "url": "https://apnews.com/article/north-carolina-diversity-dei-board-of-governors-dc23328c84b9005fc1e916164e44c3fa"
  },
  {
    "text": "Russia denies Trump's claim he can free US journalist if he wins election  —  Spokesman says 'there aren't any contacts' with former president regarding Evan Gershkovich's release from Russia  —  Donald Trump boasted on Thursday he would quickly free the jailed US journalist Evan Gershkovich … ",
    "url": "https://www.theguardian.com/us-news/article/2024/may/23/russia-denies-trump-claim-us-journalist"
  },
  {
    "text": "Florida attorney general says state will investigate Starbucks for DEI practices  —  Florida's top legal officer on Wednesday said the state will investigate Starbucks, the multinational chain of coffeehouses, for its diversity, equity and inclusion practices.",
    "url": "https://www.usatoday.com/story/news/nation/2024/05/23/florida-investigates-dei-starbucks/73816554007/"
  },
  {
    "text": "Spain, Ireland to recognize Palestinian state  —  with ZOYA SHEFTALOVICH  —  PALESTINIAN STATEHOOD  —  SPAIN AND IRELAND TO RECOGNIZE PALESTINIAN STATE TODAY: The governments of Spain and Ireland will today move to recognize Palestinian statehood, in an announcement coordinated with at least … ",
    "url": "https://www.politico.eu/newsletter/brussels-playbook/spain-ireland-to-recognize-palestinian-state/"
  },
  {
    "text": "Will RFK Jr. Swing the Election to Biden?  —  Third parties never win, but on occasion they've been known to determine the loser.  —  No third-party candidate will win the 2024 presidential election or even a single state.  But a third-party candidate could decide the election's outcome.",
    "url": "https://www.wsj.com/articles/will-rfk-jr-swing-the-election-to-biden-307b113e"
  }
]