[
  {
    "text": "Trump Moves to Overturn Manhattan Conviction, Citing Immunity Decision  —  Former President Donald J. Trump took the action hours after a U.S. Supreme Court ruling granted him immunity for official acts committed in office.  —  Donald J. Trump began an effort on Monday to throw … ",
    "url": "https://www.nytimes.com/2024/07/01/nyregion/trump-sentence-hush-money.html"
  },
  {
    "text": "A five-alarm fire for democracy  —  On Monday, six members of the Supreme Court granted Donald Trump — and every future president — broad criminal immunity.  The court found that, as president, Trump was free to use his “official” powers to commit crimes.",
    "url": "https://popular.info/p/a-five-alarm-fire-for-democracy"
  },
  {
    "text": "Ruling Further Slows Trump Election Case but Opens Door to Airing of Evidence  —  The Supreme Court's immunity decision directed the trial court to hold hearings on what portions of the indictment can survive — a possible chance for prosecutors to set out their case in public before Election Day.",
    "url": "https://www.nytimes.com/2024/07/01/us/politics/supreme-court-immunity-trump-jan-6.html"
  },
  {
    "text": "The President Can Now Assassinate You, Officially  —  Under this new standard, a president can go on a four-to-eight year crime spree and then retire from public life, never to be held accountable.  —  Pocket  —  Welp, Donald Trump won.  The Supreme Court today ruled that presidents are entitled to … ",
    "url": "https://www.thenation.com/article/society/trump-immunity-supreme-court/"
  },
  {
    "text": "Supreme Court Impeachment Plan Released by Alexandria Ocasio-Cortez  —  announced plans to introduce articles of impeachment against the U.S.  —  justices on Monday after the court ruled that presidents have immunity for official actions.  —  The court on Monday ruled that former presidents … ",
    "url": "https://www.newsweek.com/supreme-court-justices-impeachment-aoc-1919728"
  },
  {
    "text": "Playbook: Dems' SCOTUS split-screen  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  WHAT'S NEXT FOR THE TRUMP CASES — “How to Salvage the Jan. 6 Case Against Trump,” by Ankush Khardori: “Special counsel JACK SMITH and Judge TANYA CHUTKAN have a narrow path to move forward with a trial.” ...",
    "url": "https://www.politico.com/newsletters/playbook/2024/07/02/dems-scotus-split-screen-00166202"
  },
  {
    "text": "The Supreme Court's disastrous Trump immunity decision, explained  —  The Court's Trump immunity decision is a blueprint for dictatorship. … The Court's six Republicans handed down a decision on Monday that gives Donald Trump such sweeping immunity from prosecution that there are unlikely … ",
    "url": "https://www.vox.com/scotus/358292/supreme-court-trump-immunity-dictatorship"
  },
  {
    "text": "Behind the Curtain: The imperial presidency in waiting … - A re-elected Trump would quickly set up vast camps and deport millions of people in the U.S. illegally. … - In Washington, Trump would move to fire potentially tens of thousands of civil servants using a controversial interpretation of law and procedure.",
    "url": "https://www.axios.com/2024/07/02/trump-2025-imperial-us-presidency"
  },
  {
    "text": "Biden Reads Teleprompter For 5 Minutes, Takes No Questions In First Major Post-Debate Appearance  —  President Joe Biden made his first major appearance since his panic-inspiring debate performance Monday to give brief remarks on the Supreme Court's presidential immunity decision that was released earlier in the day.",
    "url": "https://dailycaller.com/2024/07/01/joe-biden-speech-supreme-court-presidential-immunity-decision-debate-teleprompter/"
  },
  {
    "text": "SCOTUS gives Trumpian autocrats a map for abusing power  —  The imperial court sides with their king.  —  ∙ Paid … Not content to utterly upend the separation of powers as it did last week by gutting the administrative state, the right-wingers on the US Supreme Court yesterday further unbalanced … ",
    "url": "https://www.publicnotice.co/p/scotus-immunity-ruling-trump-dictatorship"
  },
  {
    "text": "Rep. Spartz charged with weapons violation at DC airport  —  U.S. Rep. Spartz charged with airport weapons violation  —  (WISH) — U.S. Rep. Victoria Spartz has been charged with a weapons violation at Dulles International Airport in Washington, D.C.  —  A spokesperson for Metropolitan … ",
    "url": "https://www.wishtv.com/news/politics/rep-spartz-charged-with-weapons-violation-at-dc-airport/"
  },
  {
    "text": "Trump Amplifies Calls to Jail Top Elected Officials, Invokes Military Tribunals  —  A post that Mr. Trump circulated on Sunday called for Liz Cheney to be prosecuted by a military court reserved for enemy combatants and war criminals.  —  Former President Donald J. Trump over the weekend escalated … ",
    "url": "https://www.nytimes.com/2024/07/01/us/politics/trump-liz-cheney-treason-jail.html"
  },
  {
    "text": "Unsealed: Jeffrey Epstein's grand jury records now viewable online  —  The records have long been sealed due to state limitations on exposing grand jury evidence.  Lawmakers passed narrowly tailored legislation in February to circumvent those restrictions.  —  More than 150 transcript pages … ",
    "url": "https://floridapolitics.com/archives/682400-unsealed-jeffrey-epsteins-grand-jury-records-now-viewable-online/"
  },
  {
    "text": "The Radical Roberts Court  —  The current Supreme Court of the United States has just cemented its place in history as the most radical Supreme Court ever.  —  For a century and a half, that dishonor has gone to the antebellum court led by Chief Justice Roger Taney, whose pro-slavery perversions … ",
    "url": "https://kevinmkruse.substack.com/p/the-radical-roberts-court"
  },
  {
    "text": "Apocalypse Not  —  The great operational question before us is not “Is Joe Biden too old?”  The question is “Do you trust the delegates to the Democratic convention in Chicago to replace the present ticket with a supposedly more winning ticket without ripping their party apart in catastrophic ways?”",
    "url": "https://www.theatlantic.com/politics/archive/2024/07/joe-biden-democrats-convention/678863/"
  },
  {
    "text": "The US will pay for migrants' flights out of Panama to close a route used by over 700,000 people to reach the US-Mexico border  — The US is trying to shut down the Darién Gap, a land route used by thousands to reach its borders.  — It's paying for migrants' repatriation … ",
    "url": "https://www.businessinsider.com/us-paying-migrants-flights-panama-darien-gap-illegal-entering-2024-7"
  },
  {
    "text": "Supreme Court lets a truck stop sue the Federal Reserve in latest threat to agency regulations  —  The Supreme Court on Monday revived a lawsuit by a North Dakota truck stop that is challenging the fees banks can charge for debit-card transactions in a ruling that could have deeper implications for other government regulations.",
    "url": "https://www.cnn.com/2024/07/01/politics/corner-post-sec-supreme-court/"
  }
]