[
  {
    "text": "Live Updates: Jurors in Trump Criminal Case Told That He Lied ‘Over and Over and Over’  —  Donald J. Trump is charged with falsifying business records to cover up a sex scandal that threatened to derail his 2016 campaign.  A lawyer for Mr. Trump insisted that the former president “did not commit any crimes.”",
    "url": "https://www.nytimes.com/live/2024/04/22/nyregion/trump-hush-money-trial"
  },
  {
    "text": "Unpacking the alleged crime that made Trump's alleged crime a felony  —  Attorneys offered opening arguments in the criminal trial of Donald Trump on Monday in Manhattan, beginning the process of presenting to the jury the state's case against the former president.",
    "url": "https://www.washingtonpost.com/politics/2024/04/22/trump-hush-money-trial-charges/"
  },
  {
    "text": "“The alternate reality Trump lives in is crumbling” with first criminal trial: ex-federal prosecutor  —  “I think that Donald Trump is probably trying to get himself thrown into prison”  —  With a jury now impaneled, Donald Trump's hush-money trial can finally begin in earnest.",
    "url": "https://www.salon.com/2024/04/22/the-alternate-reality-lives-in-is-crumbling-with-first-criminal-trial-ex-prosecutor/"
  },
  {
    "text": "House Republican infighting getting worse after foreign aid vote  —  One GOP lawmaker said he serves with “some real scumbags,” while others fought over Speaker Mike Johnson's strategy for bringing up the aid package  —  The House came together Saturday to pass a sweeping $95 billion foreign aid package … ",
    "url": "https://www.washingtonpost.com/politics/2024/04/22/house-republicans-infighting-foreign-aid/"
  },
  {
    "text": "The Accidental Speaker  —  This article was featured in the One Story to Read Today newsletter.  Sign up for it here.  —  You could be forgiven for thinking it was Mike Johnson's idea to host the House Republicans' annual policy retreat at the Greenbrier resort in West Virginia … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/04/mike-johnson-speaker-ukraine-trump/678108/"
  },
  {
    "text": "The winner of this Congress?  Joe Biden  —  House Republicans came into the 118th Congress with big plans.  They were going to cut taxes and spending, impeach President Joe Biden and members of his Cabinet and use their leverage to force Democrats to accept stringent new border security and immigration policies.",
    "url": "https://punchbowl.news/article/joe-biden-winning-this-congress/"
  },
  {
    "text": "Statement from Columbia University President Minouche Shafik  —  Dear Members of the Columbia Community,  —  I am deeply saddened by what is happening on our campus.  Our bonds as a community have been severely tested in ways that will take a great deal of time and effort to reaffirm.",
    "url": "https://president.columbia.edu/news/statement-columbia-university-president-minouche-shafik-4-22"
  },
  {
    "text": "NASA's Voyager 1 Resumes Sending Engineering Updates to Earth  —  For the first time since November, NASA's Voyager 1 spacecraft is returning usable data about the health and status of its onboard engineering systems.  The next step is to enable the spacecraft to begin returning science data again.",
    "url": "https://blogs.nasa.gov/voyager/2024/04/22/nasas-voyager-1-resumes-sending-engineering-updates-to-earth/"
  },
  {
    "text": "Republicans are starting to worry about RFK Jr.  —  Even Donald Trump acknowledged Monday that the independent candidate “probably hurts both” Biden and him.  —  Republicans are waking up to the reality that Robert F. Kennedy Jr. could sink their standard-bearer just as easily … ",
    "url": "https://www.politico.com/news/2024/04/22/republicans-are-starting-to-worry-about-rfk-jr-00153763"
  },
  {
    "text": "Minnesota State Senator Nicole Mitchell Arrested On Suspicion Of Burglary  —  Democratic Sen. Nicole Mitchell, 49, of Woodbury, is being held in the Becker County Jail on suspicion of first-degree burglary.  —  Video  —  A state senator and former broadcast meteorologist was arrested … ",
    "url": "https://www.huffpost.com/entry/ap-us-minnesota-state-senator-arrested_n_6626ed5ae4b06e0c2709ae2c"
  },
  {
    "text": "Next Ukraine package to be larger than normal, include armored vehicles  —  The Senate could approved more than $60 billion for Kyiv as soon as Tuesday.  —  The Biden administration is preparing a larger-than-normal package of military aid for Ukraine that will include armored vehicles … ",
    "url": "https://www.politico.com/news/2024/04/22/ukraine-package-armored-vehicles-00153672"
  },
  {
    "text": "The GOP's Worst Fears About the End of Roe v. Wade Have Come True  —  Nearly two years after the leak of Supreme Court Justice Samuel Alito's draft opinion overturning Roe v Wade, abortion refuses to step out of the spotlight on center stage in American politics.",
    "url": "https://newrepublic.com/article/180812/gops-worst-fears-end-roe-v-wade-come-true"
  },
  {
    "text": "Biden moves to block abortion records from investigators  —  The Biden administration on Monday updated federal health privacy rules to protect patients seeking abortion and providers involved in the procedure. … The big picture: Health plans and providers will be barred from disclosing … ",
    "url": "https://www.axios.com/2024/04/22/biden-abortion-records-patients-hipaa-investigations"
  },
  {
    "text": "Trump Calls for More Protests Outside Trial: ‘Rally Behind MAGA’  —  With support from demonstrators in Lower Manhattan spotty so far, Donald Trump issued a call to “rally behind MAGA,” and suggested the poor turnout was a result of a plot against his supporters.",
    "url": "https://www.nytimes.com/2024/04/22/us/politics/trump-trial-protests.html"
  },
  {
    "text": "Why Trump Will Likely be Held in Contempt and What Then  —  Trial in The People of the State of New York vs. Donald J. Trump, the first-ever criminal prosecution of a former U.S. president, began on Monday, April 15.  Although the trial is still in its early stages, Trump has already run … ",
    "url": "https://www.justsecurity.org/94878/why-trump-will-likely-be-held-in-contempt-and-what-then/"
  },
  {
    "text": "DeSantis has one of the highest governor disapproval ratings, poll finds  —  However, DeSantis is popular overall, and beloved by Republicans.  —  Gov. Ron DeSantis has one of the highest disapproval ratings among governors in the country, according to a new survey conducted by Morning Consult … ",
    "url": "https://www.tampabay.com/news/florida-politics/2024/04/22/desantis-has-one-highest-governor-disapproval-ratings-poll-finds/"
  },
  {
    "text": "President Joe Biden to visit Syracuse following $6.1 billion Micron grant news  —  SYRACUSE, N.Y. — It's official: President Joe Biden will be visiting Syracuse this Thursday following the news that Micron will receive a $6.1 billion grant under the CHIPS & Science Act.",
    "url": "https://cnycentral.com/news/local/president-joe-biden-to-visit-syracuse-following-61-billion-micron-grant-news-administration-chips-and-science-act-clay-new-york-mega-fab-site-chip-fabrication"
  },
  {
    "text": "‘Plasmic Echo’ was FBI code name for Trump classified documents probe  —  The FBI's code name for its investigation into former President Trump's handling of classified documents was “Plasmic Echo,” according to court filings published Monday.  —  The name was listed in unredacted court … ",
    "url": "https://thehill.com/regulation/court-battles/4613537-plasmic-echo-was-fbi-code-name-for-trump-classified-documents-probe/"
  },
  {
    "text": "Solar for All  —  Under the $7 billion Solar for All program, the 60 selected applicants will create new or expand existing low-income solar programs, which will enable over 900,000 households in low-income and disadvantaged communities to benefit from distributed solar energy.",
    "url": "https://www.epa.gov/greenhouse-gas-reduction-fund/solar-all"
  },
  {
    "text": "Trump continues his reversal on TikTok, accusing Biden of wanting to ban it  —  Trump worked to force a sale of TikTok when he was in the White House.  On Monday he called Biden ‘responsible for banning TikTok.’  —  Former president Donald Trump is digging in against a potential ban … ",
    "url": "https://www.washingtonpost.com/politics/2024/04/22/trump-tiktok-ban-reversal-biden/"
  }
]