[
  {
    "text": "Trump Wins NH Primary, But Not Quite the Victory He Wanted  —  Trump secured a win in the New Hampshire primary, but it was hardly what he was looking for.  —  CONCORD, New Hampshire—If Donald Trump ever had a chance of having his march to the Republican presidential nomination sidetracked … ",
    "url": "https://www.thedailybeast.com/trump-wins-nh-primary-but-not-quite-the-victory-he-wanted"
  },
  {
    "text": "Trump Says He Lost 15 Pounds ‘The Hard Way’  —  “You look like you're in fighting shape!”  Fox host Brian Kilmeade gushed while aboard the indicted former president's plane.  —  Fox & Friends co-host Brian Kilmeade spoke with former President Donald Trump ahead of his final rally … ",
    "url": "https://www.thedailybeast.com/trump-says-he-lost-15-pounds-the-hard-way"
  },
  {
    "text": "The irony of Trump's angry reaction to his N.H. primary victory  —  So let me get this straight.  Donald Trump, of all people, is outraged by the very idea of a candidate presenting a second-place finish as a success?  —  For speechwriters, remarks after a primary victory are an easy lift.",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/irony-trumps-angry-reaction-nh-primary-victory-rcna135420"
  },
  {
    "text": "After Trump's NH win, Biden gets the opponent he wants  —  The president's campaign gears up for a Trump rematch  —  MANCHESTER, New Hampshire — The general election has all but begun — and it's the race President Joe Biden's team wanted.  —  Former President Donald Trump's victory … ",
    "url": "https://www.politico.com/news/2024/01/24/trumps-win-biden-gets-opponent-he-wants-00137429"
  },
  {
    "text": "Why Republicans are (still) humiliating themselves for Trump  —  Even Nikki Haley will eventually have to kiss the ring. … With close to 90 percent of the vote counted early Wednesday morning evening, Donald Trump had beaten Nikki Haley by just over 10 points in the New Hampshire Republican presidential primary.",
    "url": "https://www.publicnotice.co/p/trump-wins-new-hampshire-primary-24-endorsements"
  },
  {
    "text": "Most N.H. GOP primary voters say Trump fit for presidency even if convicted  —  Trump and Biden won their respective New Hampshire primary elections.  Here are the results, biggest takeaways and what exit polls showed.  —  Learn more about the GOP presidential candidates: Donald Trump and Nikki Haley.",
    "url": "https://www.washingtonpost.com/politics/2024/01/23/new-hampshire-voters-trump-trials-2020-election/"
  },
  {
    "text": "Playbook: 'That's the guy we will beat'  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  WITH ENDORSEMENTS LIKE THESE — “DeSantis sees ‘big warning signs’ for Trump's candidacy,” by Kimberly Leonard: “Speaking to conservative radio host Steve Deace … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/01/24/thats-the-guy-we-will-beat-00137517"
  },
  {
    "text": "How Trump crushed Haley's momentum — and came closer to clinching the nomination  —  The former president and his allies trained their attacks on the former U.N. ambassador in the week before the N.H. primary, which Trump won easily on Tuesday  —  NASHUA, N.H. — Donald Trump and his team … ",
    "url": "https://www.washingtonpost.com/politics/2024/01/23/trump-haley-new-hampshire-republican-nominee/"
  },
  {
    "text": "New Hampshire exit poll: Majority of GOP primary voters aren't MAGA, but most would be satisfied with Trump nomination  —  The voters who turned out for New Hampshire's GOP presidential primary on Tuesday were less staunchly conservative and less closely tied to the Republican Party … ",
    "url": "https://www.cnn.com/2024/01/23/politics/exit-poll-new-hampshire-primary/"
  },
  {
    "text": "Biden wins the New Hampshire primary after Democrats write him on the ballot  —  MANCHESTER, N.H. — President Biden won the New Hampshire Democratic primary on Tuesday, an unusual race that he skipped after the party changed its rules in favor of seeing South Carolina hold the first nominating contest of the year.",
    "url": "https://www.npr.org/2024/01/23/1225663027/joe-biden-wins-nh-primary-results"
  },
  {
    "text": "Turkey's parliament approves Sweden's NATO membership, lifting a key hurdle  —  Turkish legislators on Tuesday endorsed Sweden's membership in NATO, lifting a major hurdle on the previously nonaligned country's entry into the military alliance.  Lawmakers ratified Sweden's accession protocol 287 to 55 … ",
    "url": "https://apnews.com/article/turkey-sweden-nato-kurdish-militants-quran-ff81aa2d36160428d766579963f97fce"
  },
  {
    "text": "The White House has its own pharmacy—and, boy, was it shady under Trump  —  It wasted $750K during the Trump years and freely handed out Ambien and Provigil.  —  The White House has its own pharmacy that, until recently, could perhaps best be described as a hot mess, according … ",
    "url": "https://arstechnica.com/science/2024/01/the-white-house-has-its-own-pharmacy-and-boy-was-it-shady-under-trump/"
  },
  {
    "text": "The least we can do  —  The pandemic created a unique political environment where, for a brief period of time, there was a working consensus that the government should try to help people.  This resulted in a historic expansion of the Child Tax Credit (CTC) in 2021.",
    "url": "https://popular.info/p/the-least-we-can-do"
  },
  {
    "text": "Delta Boeing plane loses wheel while taxiing for takeoff  —  A Delta Air Lines Boeing plane lost a nose wheel before it took off Saturday from the Hartsfield-Jackson Atlanta International Airport.  —  A spokesperson for the Federal Aviation Administration (FAA) said in a statement … ",
    "url": "https://thehill.com/regulation/transportation/4425300-delta-boeing-plane-loses-wheel/"
  },
  {
    "text": "The LA Times lays off 115 people, with the De Los and Washington, D.C. teams especially hard-hit  —  “We are not in turmoil.  We have a real plan,” the paper's owner, billionaire businessman Dr. Patrick Soon-Shiong, said.  —  The Los Angeles Times laid off 23% of its newsroom on Tuesday … ",
    "url": "https://www.niemanlab.org/2024/01/the-la-times-lays-off-115-people-with-the-de-los-and-washington-d-c-teams-especially-hard-hit/"
  },
  {
    "text": "Alaska Airlines CEO: We found ‘many’ loose bolts on our Max 9s following near-disaster  —  “I'm angry,” said Alaska CEO Ben Minicucci.  “This happened to Alaska Airlines.  It happened to our guests and happened to our our people.”  —  The CEO of Alaska Airlines said new … ",
    "url": "https://www.nbcnews.com/business/business-news/alaska-airlines-found-more-loose-bolts-boeing-737-max-9-ceo-says-rcna135316"
  }
]