[
  {
    "text": "Exclusive: All 50 Democratic party US state chairs back Harris -sources  —  All 50 Democratic party state chairs have thrown their weight behind Vice President Kamala Harris to be the party's new presidential nominee, according to sources familiar with the matter.",
    "url": "https://www.reuters.com/world/us/all-50-democratic-party-us-state-chairs-back-harris-sources-2024-07-21/"
  },
  {
    "text": "Nikki Haley Voters PAC Announces Support for Kamala Harris  —  voters pledged their support for Democratic Vice President  —  ' presidential bid on Sunday, hours after President  —  announced that he was dropping out of the race.  —  Biden announced on Sunday afternoon in a letter … ",
    "url": "https://www.newsweek.com/nikki-haley-voters-pac-announces-support-kamala-harris-1928198"
  },
  {
    "text": "My Statement on President Biden's Announcement  —  Joe Biden has been one of America's most consequential presidents, as well as a dear friend and partner to me.  Today, we've also been reminded — again — that he's a patriot of the highest order.  —  Sixteen years ago … ",
    "url": "https://t.co/Bs2ZumFXxe"
  },
  {
    "text": "Why Biden finally quit  —  The Saturday night decision that ended Biden's reelection campaign.  —  For 23 days, President Joe Biden insisted on pushing forward with his reelection bid in the face of calls from Democratic lawmakers and donors for him to step aside.  —  And then, almost on a dime, things changed.",
    "url": "https://www.politico.com/news/2024/07/21/why-biden-dropped-out-00170106"
  },
  {
    "text": "A guide to the coming attacks on Kamala Harris  —  On Sunday at 1:46 PM Eastern Time, President Joe Biden announced he would end his campaign for reelection.  Seconds later, the attacks on Vice President Kamala Harris began.  —  Harris is not yet the nominee.",
    "url": "https://popular.info/p/a-guide-to-the-coming-attacks-on"
  },
  {
    "text": "Biden's exit leads to the biggest day for Democratic donations online in years — $30 million and counting.  —  Democrats greeted President Biden's departure from the presidential race with an avalanche of cash, donating more than $30 million online on Sunday and making it the single biggest … ",
    "url": "https://www.nytimes.com/2024/07/21/us/politics/bidens-exit-leads-to-the-biggest-day-for-democratic-donations-online-in-years.html"
  },
  {
    "text": "This Is Exactly What the Trump Team Feared  —  On the evening of Super Tuesday, March 5, shortly before Donald Trump effectively ended the Republican primary and earned a general-election rematch with President Joe Biden, I asked the co-managers of Trump's presidential campaign what they feared most about Biden.",
    "url": "https://www.theatlantic.com/politics/archive/2024/07/trump-campaign-biden-dropping-out/679183/"
  },
  {
    "text": "Heartbreak and relief  —  Reflections on Joe Biden's extraordinary decision. … After a long RNC week and a Trump rally on Saturday, I went to the Twins game yesterday with my wife and kids hoping to unplug for a few hours.  We had just entered the ballpark when my phone blew up with the news that President Biden was stepping aside.",
    "url": "https://www.publicnotice.co/p/biden-steps-aside-kamala-harris"
  },
  {
    "text": "Gretchen Whitmer joins campaign call with Harris for President staff  —  Michigan Gov. Gretchen Whitmer joined a call of Harris for President staff on Sunday, throwing her support to the vice president in a crucial battleground state and adding to the flood of endorsements.",
    "url": "https://www.politico.com/live-updates/2024/07/21/joe-biden-drops-out-election/gretchen-whitmer-joins-harris-campaign-call-00170209"
  },
  {
    "text": "EXCLUSIVE: New AJC poll finds Trump leads Harris in Georgia matchup  —  In survey conducted July 9-18, Republican led vice president by 5 percentage points  —  Former President Donald Trump holds a slight lead over Vice President Kamala Harris in Georgia in an Atlanta Journal-Constitution … ",
    "url": "https://www.ajc.com/politics/exclusive-new-ajc-poll-finds-trump-leads-harris-in-georgia-head-to-head-matchup/XCR4MTGSJJHOFHLPUUZLYLCFPE/"
  },
  {
    "text": "How Biden landed at the decision to drop out  —  Holed up in his Delaware shore home and still recovering from Covid, President Joe Biden on Saturday night began to come to terms with the end of his reelection bid.  Biden had spent the last few days consulting with his senior aides as they tried … ",
    "url": "https://www.politico.com/live-updates/2024/07/21/joe-biden-drops-out-election/biden-drop-out-decision-00170115"
  },
  {
    "text": "With honor and decency, Joe Biden exits the race  —  In the end, President Joe Biden did the right thing for the country.Age caught up to him.  Democrats turned on him.  And the media piled on, helping to drive Biden from the 2024 presidential race, while largely ignoring the danger … ",
    "url": "https://www.inquirer.com/opinion/editorials/biden-leaves-presidential-race-20240721.html"
  },
  {
    "text": "The Week Ahead  —  President Biden: “I believe it is in the interest of my party and the country to stand down and to focus solely on fulfilling my duties as president.”  He followed up minutes later endorsing Kamala Harris.  He is a splendid man, a splendid human being … ",
    "url": "https://joycevance.substack.com/p/the-week-ahead-fc5"
  },
  {
    "text": "Mayorkas names panel to review Trump rally shooting … - The announcement comes after GOP lawmakers confronted USSS director Kimberly Cheatle at the Republican National Convention in Milwaukee, Wisconsin, last Wednesday to demand answers over the assassination attempt on former President Trump.",
    "url": "https://www.axios.com/2024/07/22/trump-secret-service-review-shooting-mayorkas"
  },
  {
    "text": "Manchin ends his brief flirtation with presidential bid  —  Well, that was fast.  Sen. Joe Manchin's (I-W.Va.) brief flirtation with a bid for the Democratic nomination for president ended between two cable news interviews Monday morning.  “I am not running for office,” Manchin told “CBS Mornings” Gayle King.",
    "url": "https://www.politico.com/live-updates/2024/07/22/kamala-harris-campaign-biden-drop-out/joe-manchin-run-for-president-00170269"
  },
  {
    "text": "Manchin weighs options after Biden exits presidential race  —  Sen. Joe Manchin (W.Va.) is considering re-registering as a Democrat in order to compete for Democratic presidential nomination.  —  Sen. Joe Manchin III (I-W. Va.) is considering re-registering as a Democrat to compete … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/21/manchin-weighs-options-after-biden-exits-presidential-race/"
  }
]