[
  {
    "text": "My plan to reform the Supreme Court and ensure no president is above the law  —  We can and must prevent the abuse of presidential power and restore the public's faith in our judicial system.  —  The writer is president of the United States.  —  This nation was founded on a simple yet profound principle: No one is above the law.",
    "url": "https://www.washingtonpost.com/opinions/2024/07/29/joe-biden-reform-supreme-court-presidential-immunity-plan-announcement/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzIyMjI1NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzIzNjA3OTk5LCJpYXQiOjE3MjIyMjU2MDAsImp0aSI6IjI5ODkwY2VjLTYwZTItNDZmZi1hOWZkLWQwOTJjZmI5MGNjMSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9vcGluaW9ucy8yMDI0LzA3LzI5L2pvZS1iaWRlbi1yZWZvcm0tc3VwcmVtZS1jb3VydC1wcmVzaWRlbnRpYWwtaW1tdW5pdHktcGxhbi1hbm5vdW5jZW1lbnQvIn0.ZjQ4R9u8pwlIKd0l230VD0f20mb0V140Kw3gTFopyfM&itid=gfta"
  },
  {
    "text": "FACT SHEET: President Biden Announces Bold Plan to Reform the Supreme Court and Ensure No President Is Above the Law  —  From his first day in office—and every day since then—President Biden has taken action to strengthen American democracy and protect the rule of law.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/07/29/fact-sheet-president-biden-announces-bold-plan-to-reform-the-supreme-court-and-ensure-no-president-is-above-the-law/"
  },
  {
    "text": "Playbook: After the sugar high  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  EYES ON CARACAS — “Venezuela's Maduro, opposition each claim presidential victory,” by Reuters' Vivian Sequera, Deisy Buitrago and Mayela Armas: “The country's electoral authority said just after midnight … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/07/29/after-the-sugar-high-00171595"
  },
  {
    "text": "Trump's insult trap: Republicans hunt for elusive Harris attack line … - Black voters could be sensitive to attacks on Harris' identity, including quotes from multiple Republican lawmakers last week labeling her a “DEI vice president.”  — Years-old comments from J.D. Vance calling Harris a … ",
    "url": "https://www.axios.com/2024/07/29/trump-attacks-harris-dei-gop-election"
  },
  {
    "text": "Harris Camp Warns Supporters: Don't Get Duped by ‘Scam PACs’  —  KAMALA HARRIS'S TEAM IS WARNING DONORS not to fall prey to “financial scams” from groups sending email and text messages that suggest they're raising money for the vice president.  —  Those messages came rapidly last week … ",
    "url": "https://www.thebulwark.com/p/harris-camp-warns-of-democratic-scam-pacs"
  },
  {
    "text": "Harris Looks to Maintain Momentum as ‘Honeymoon Phase’ Winds Down  —  Democrats could formally make Kamala Harris their nominee this week, as she narrows her running mate choices and attacks her rivals, Donald Trump and JD Vance, while they hit the trail.  —  When President Biden … ",
    "url": "https://www.nytimes.com/2024/07/29/us/politics/harris-nomination-vice-president.html?unlocked_article_code=1.-00.EjPf.Hb-bqdYCVJVB&smid=url-share"
  },
  {
    "text": "Harris sees opening in Vance as she considers her own pick for vice president  —  Kamala Harris' plan as a running mate was to brush past JD Vance as nothing but a rubber stamp for Donald Trump.  But now that she's the presumptive Democratic nominee, her campaign is seizing on the Ohio senator … ",
    "url": "https://www.cnn.com/2024/07/29/politics/kamala-harris-jd-vance-vp-pick/"
  },
  {
    "text": "Venezuela election live updates: Opposition claims victory after Maduro was declared the winner  —  Supporters of President Nicolás Maduro gather at Miraflores Palace in Caracas as Maduro is declared the winner in Venezuela's presidential election amid opposition claims of irregularities.",
    "url": "https://apnews.com/live/venezuela-election-updates-maduro-machado-gonzalez"
  },
  {
    "text": "Elon Musk retweets altered Kamala Harris campaign ad  —  In the video, Harris seemingly exposes herself as an incompetent candidate for president.  The origin of the video isn't known yet.  —  Elon Musk, the owner of X, retweeted a parody Kamala Harris campaign ad Friday without labeling it as misleading … ",
    "url": "https://www.nbcnews.com/news/us-news/elon-musk-retweets-altered-kamala-harris-campaign-ad-rcna163985"
  },
  {
    "text": "A comprehensive guide to J.D. Vance's views on women and children  —  On July 25, former President Donald Trump named Senator J.D. Vance (R-OH) as his running mate.  Vance has only been a U.S. Senator since 2023, and his rapid ascension to the Republican Vice Presidential nominee … ",
    "url": "https://popular.info/p/a-comprehensive-guide-to-jd-vances"
  },
  {
    "text": "Buttigieg Tells Fox Viewers that MAGA Is a Cult  —  “We don't have that kind of warped reality on our side,” the Biden transportation secretary said, calling Trump “older and stranger” than he was in 2016  —  Pete Buttigieg offered a dose of reality for viewers on Fox, pointing out the lies and “cult of personality” of Donald Trump.",
    "url": "https://www.rollingstone.com/politics/politics-news/buttigieg-fox-viewers-maga-cult-1235069586/"
  },
  {
    "text": "Schumer: Vance VP pick helps Democrats  —  “I'll bet President Trump is sitting there, scratching his head, and wondering, ‘Why did I pick this guy?’”  Schumer said.  “The choice may be one of the best things he ever did for Democrats.”  —  Senate Majority Leader Chuck Schumer (D-N.Y.) … ",
    "url": "https://www.politico.com/news/2024/07/28/schumer-vance-vp-pick-helps-democrats-00171535"
  },
  {
    "text": "Trump's falling legal fees free up campaign cash … - Trump and the RNC had been catching up to Biden and the DNC in fundraising, but Biden's extraordinary decision to drop out gave the party a jolt of enthusiasm and an influx of donations, Axios' Erin Doherty reports.",
    "url": "https://www.axios.com/2024/07/29/trump-falling-legal-costs-fundraising"
  },
  {
    "text": "Trump uses immunity ruling to try to blow up his conviction  —  And thanks to the Supreme Court's right-wing nihilists, it just might work. … On July 1, the last day of the Supreme Court's term, six conservative justices took a sledgehammer to democracy.",
    "url": "https://www.publicnotice.co/p/how-scotus-immunity-impacts-trump-ny-conviction"
  },
  {
    "text": "‘An Inspiration to Me Always’: Meet Kamala Harris's Radical Pastor  —  ‘America, what did you do?’ pastor Amos Brown said six days after 9/11  —  After President Joe Biden stepped aside on Sunday and Vice President Kamala Harris became the presumptive Democratic nominee … ",
    "url": "https://freebeacon.com/democrats/an-inspiration-to-me-always-meet-kamala-harriss-radical-pastor/"
  },
  {
    "text": "“My Beautiful Christians:” Trump's Pandering to Christian Nationalists  —  The other day, during an address to a Turning Point conference, Trump implored, … Video  —  Horse race journalists didn't care.  They found it more important to repeat and therefore magnify Trump's latest slur on Vice President Harris.",
    "url": "https://www.emptywheel.net/2024/07/29/my-beautiful-christians-dont-talk-about-trumps-pandering-to-christian-nationalists/"
  },
  {
    "text": "Former US ambassador says US ‘asleep’ amid Russia threat  —  The News  —  Morgan Chalfant: What did you learn about Russian President Vladimir Putin on the job that you might not have known otherwise, or that people don't understand about him and the way that he operates?",
    "url": "https://www.semafor.com/article/07/28/2024/former-us-ambassador-says-us-asleep-amid-russia-threat"
  },
  {
    "text": "America's New Political War Pits Young Men Against Young Women  —  A majority of men under 30 support former President Trump and Republican control of Congress, a sharp reversal from the 2020 race; young women strongly favor Democrats",
    "url": "https://www.wsj.com/politics/policy/men-women-vote-republican-democrat-election-7f5f726c"
  }
]