[
  {
    "text": "Administration Officials Believe Order Lets Immigration Agents Enter Homes Without Warrants  —  It remains unclear whether the Trump administration will apply the law in this way.  But such an interpretation, experts say, would infringe on basic civil liberties.",
    "url": "https://www.nytimes.com/2025/03/20/us/politics/trump-alien-enemies-immigration-agents.html?unlocked_article_code=1.5U4.I-az.c2sJMDGTtLCE&smid=url-share"
  },
  {
    "text": "We're Finally Seeing the “Evidence” Against the Migrants Deported by Trump.  It's Unbelievable.  —  After the Trump administration rounded up hundreds of Venezuelan migrants around the country—without notice or court hearings—and sent them off to a prison in El Salvador, we're finally getting details on who was deported and why.",
    "url": "https://slate.com/news-and-politics/2025/03/immigration-trump-news-mass-deportations-tren-de-aragua.html"
  },
  {
    "text": "Here are the names of the Venezuelans deported by the U.S. to El Salvador  —  CBS News has obtained an internal government list of the names of the Venezuelan men the Trump administration deported to El Salvador as part of a secretive operation last week that has triggered a legal standoff in the U.S. and a debate around the world.",
    "url": "https://www.cbsnews.com/news/venezuelans-deported-el-salvador-names/"
  },
  {
    "text": "In Deportations, Trump Tied Gang to Venezuela's Government.  Intelligence Contradicts Him.  —  To invoke wartime deportation powers, President Trump asserted that Venezuela's government controls a gang.  U.S. intelligence analysts think that is not true.  —  President Trump's assertion … ",
    "url": "https://www.nytimes.com/2025/03/20/us/politics/intelligence-trump-venezuelan-gang-alien-enemies.html"
  },
  {
    "text": "Trump signs executive order to dismantle the Education Department  —  The complete elimination of the department would require the approval of Congress.  —  WASHINGTON — President Donald Trump signed an executive order Thursday directing Education Secretary Linda McMahon to start dismant l ing the Department of Education.",
    "url": "https://www.nbcnews.com/politics/white-house/trump-signs-executive-order-dismantle-education-department-white-house-rcna197251"
  },
  {
    "text": "Big Law Firm Reaches Deal With Trump Over Executive Order  —  Paul, Weiss — one of three law firms targeted by President Trump as part of his retribution campaign — said it resolved the conflict by agreeing to a range of commitments.  —  President Trump and the head of the law firm Paul … ",
    "url": "https://www.nytimes.com/2025/03/20/us/politics/paul-weiss-deal-trump-executive-order-withdrawn.html?unlocked_article_code=1.5k4.pcXA.4YnmBISIg_JL&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Trump Rescinds Order Targeting Law Firm Paul Weiss  —  Major firm, facing potential loss of clients, agreed to support certain White House initiatives  —  President Trump on Thursday rescinded an executive order targeting Paul Weiss, as one of the nation's top law firms bent to White House pressure … ",
    "url": "https://www.wsj.com/politics/policy/trump-rescinds-order-targeting-law-firm-paul-weiss-2bda2791"
  },
  {
    "text": "Musk Set to Get Access to Top-Secret U.S. Plan for Potential War With China  —  Giving Elon Musk access to some of the nation's most closely guarded military secrets is a major expansion of his role as an adviser to President Trump and highlights his conflicts of interest.",
    "url": "https://www.nytimes.com/2025/03/20/us/politics/musk-pentagon-briefing-china-war-plan.html?unlocked_article_code=1.5k4.kMNN.sJA8l_XR5dFL&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Judge bars Musk's DOGE team from Social Security records in scathing ruling … A federal judge Thursday issued a temporary restraining order barring Elon Musk's so-called Department of Government Efficiency team from having access to personally identifiable information from the Social Security Administration.",
    "url": "https://www.cnbc.com/2025/03/20/judge-bars-musks-doge-team-from-social-security-records.html"
  },
  {
    "text": "Judge blocks DOGE from accessing Social Security data of millions of people  —  “The DOGE Team is essentially engaged in a fishing expedition at SSA, in search of a fraud epidemic, based on little more than suspicion,” said U.S. District Judge Ellen Hollander in a 137-page ruling.",
    "url": "https://www.politico.com/news/2025/03/20/judge-blocks-doge-from-accessing-social-security-data-of-millions-of-people-00241204"
  },
  {
    "text": "Tesla Recalls Every Single Cybertruck Over Stainless Steel Trims Falling Off  — Tesla recalls 46,000 Cybertrucks due to roof panels potentially detaching during driving.  — Issue stems from cant rail panel using a faulty structural adhesive prone to embrittlement.",
    "url": "https://www.carscoops.com/2025/03/tesla-recalls-every-single-cybertruck-over-stainless-steel-trims-falling-off/"
  },
  {
    "text": "Republicans Once Championed Free Speech on Campus.  Now, Not So Much.  —  President Trump and state politicians are pushing new laws and policies that crack down on curriculum, protests and speakers.  —  As conservatives fought against cancel culture on college campuses, they developed a particular fondness for the First Amendment.",
    "url": "https://www.nytimes.com/2025/03/20/us/politics/trump-republicans-gop-free-speech-college-campus-protest.html"
  },
  {
    "text": "Judge rips DOJ's ‘woefully insufficient’ response to questions on Alien Enemies Act case  —  The government's response to U.S. District Judge James Boasberg was filed under seal after days of heated back-and-forth.  —  A federal judge Thursday blasted the Justice Department's latest response … ",
    "url": "https://www.nbcnews.com/politics/trump-administration/judge-rips-dojs-woefully-insufficient-response-questions-alien-enemies-rcna197288"
  },
  {
    "text": "Vivian Jenna Wilson on Being Elon Musk's Estranged Daughter, Protecting Trans Youth and Taking on the Right Online  —  In Teen Vogue's special issue cover story, the estranged 20-year-old daughter of Elon Musk talks about the “cartoonishly evil” Trump administration and being a young trans woman today.",
    "url": "https://www.teenvogue.com/story/vivian-jenna-wilson-elon-musk-trans-youth"
  },
  {
    "text": "Attorney General Pamela Bondi Announces Severe Charges Against Violent Tesla Arsonists  —  For Immediate Release  —  Today, Attorney General Pamela Bondi announced charges against three individuals responsible for the violent destruction of Tesla properties.",
    "url": "https://www.justice.gov/opa/pr/attorney-general-pamela-bondi-announces-severe-charges-against-violent-tesla-arsonists"
  },
  {
    "text": "Georgetown University scholar has been detained by immigration officials, prompting legal fight  —  A Georgetown University researcher who is married to a Palestinian American was detained by immigration agents who told him his visa had been revoked, prompting another high-profile legal fight … ",
    "url": "https://apnews.com/article/georgetown-trump-deportation-immigration-homeland-security-21fc205cebbbbba2ed260050df04702a"
  },
  {
    "text": "Britain Issues Travel Warning for US  —  The United Kingdom has updated its travel advice for British citizens planning to visit the United States, warning of potential arrest or detention if travelers fail to comply with entry requirements.  —  It comes amid President",
    "url": "https://www.newsweek.com/britain-issues-travel-warning-us-deportations-2047878"
  },
  {
    "text": "We ran the wrong headline about Trump firing the FTC commissioners  —  The unlawful removals of Alvaro Bedoya and Rebecca Kelly Slaughter pushed journalistic writing to its limit. … On Tuesday, the president of the United States fired the Democratic commissioners of the Federal Trade Commission … ",
    "url": "https://www.theverge.com/policy/633397/ftc-bedoya-slaughter-democrat-media"
  },
  {
    "text": "MAGA Influencer And Fox News Guest Indicted On Child Sex Abuse Charges  —  The right-wing personality known as Raw Ricci built his following by filming homeless people in San Francisco.  —  A MAGA influencer known for posting sensationalized videos of homeless people in San Francisco … ",
    "url": "https://www.huffpost.com/entry/maga-raw-ricci-wynne-homeless_n_67dc47a6e4b038b4d0a69941"
  },
  {
    "text": "DOJ pushes FBI to review, release more Epstein files amid mounting pressure from Trump supporters: Sources  —  Attorney General Pam Bondi is pushing for more to be released, sources say.  —  People walk out of the West Wing and show “The Epstein Files: Phase 1” binders, at the White House in Washington, D.C., February 27, 2025.",
    "url": "https://abcnews.go.com/US/doj-pushes-fbi-review-release-epstein-files-amid/story?id=119982513"
  },
  {
    "text": "How a Free-Speech University Sidles Up to Orbán's Strongman Rule How a Free-Speech University Sidles Up to Orbán's Strongman Rule  —  Bari Weiss's University of Austin, touted as a haven for free academic inquiry, has a dozen scholars and officials with ties to Hungary's speech-suppressing regime",
    "url": "https://www.thenation.com/article/society/how-a-free-speech-university-sidles-up-to-orbans-strongman-rule/"
  },
  {
    "text": "NATO to Ask Europe and Canada for 30% Boost in Military Capacity … NATO plans to ask European allies and Canada to increase their stocks of weaponry and equipment by about 30% in the next few years, according to a senior alliance official.  —  New targets for the military capabilities of NATO allies … ",
    "url": "https://www.bloomberg.com/news/articles/2025-03-20/nato-to-ask-europe-and-canada-for-30-boost-in-military-capacity"
  },
  {
    "text": "Pentagon spokesman sidelined after uproar over Jackie Robinson article  —  John Ullyot, who served in communications roles throughout President Trump's first term, had faced criticism for his aggressive defense of anti-DEI policies.  —  Just now  —  The Trump administration has sidelined … ",
    "url": "https://www.washingtonpost.com/national-security/2025/03/20/john-ullyot-pentagon-jackie-robinson/"
  },
  {
    "text": "Finland is again ranked the happiest country in the world.  The US falls to its lowest-ever position  —  HELSINKI (AP) — Finland is the happiest country in the world for the eighth year in a row, according to the World Happiness Report 2025 published Thursday.",
    "url": "https://apnews.com/article/world-happiness-report-ranking-finland-afghanistan-us-b41c1712448762d98fe9e4f80233c15f"
  }
]