[
  {
    "text": "Live updates Judge to hear argument over Trump gag order in Jan. 6 case  —  Special counsel Jack Smith's office is in federal court in D.C. today asking for a gag order that would bar former president Donald Trump from maligning the judge, prosecutors, witnesses and potential jurors in his election obstruction case.",
    "url": "https://www.washingtonpost.com/national-security/2023/10/16/trump-court-hearing-judge-gag-order-jan-6/"
  },
  {
    "text": "Trump faces reckoning as D.C. judge mulls gag order  —  At a court hearing Monday, a judge will consider special counsel Jack Smith's demand that Trump be formally ordered to stop attacking potential witnesses against him.  —  Can Donald Trump be gagged?  —  That's the question at the heart … ",
    "url": "https://www.politico.com/news/2023/10/16/trump-gag-order-hearing-00121626"
  },
  {
    "text": "How Trump's Team Twisted His Bank Fraud Trial Into a Farce  —  The former president's lawyers may not be trying to win his New York trial—instead, they're dragging it out in hopes of solving his other political and legal problems.  —  Two weeks into Donald Trump's bank fraud trial in New York … ",
    "url": "https://www.thedailybeast.com/how-donald-trumps-team-twisted-his-new-york-bank-fraud-trial-into-a-farce"
  },
  {
    "text": "Inside Jim Jordan's uphill battle to win the speaker's gavel  —  Good morning, Early Birds.  Rite Aid has filed for bankruptcy.  Tips: earlytips@washpost.com.  Thanks for waking up with us. … In today's edition ... What we're watching: Potential Biden trip to Israel … ",
    "url": "https://www.washingtonpost.com/politics/2023/10/16/inside-jim-jordans-uphill-battle-win-speakers-gavel/"
  },
  {
    "text": "Moderate Democrats get behind temporary speaker fix  —  The News  —  With the House still paralyzed in the absence of a speaker, the idea of giving Speaker Pro Tempore Patrick McHenry more power to conduct normal business is picking up growing bipartisan support.",
    "url": "https://www.semafor.com/article/10/16/2023/moderate-democrats-get-behind-temporary-speaker-fix"
  },
  {
    "text": "More on Disastrous Biden Interview: Scott Pelley Has to Help Him Finish Sentence, Says President ‘Tired’  —  I wrote earlier about a couple of the teaser clips from the “60 Minutes” interview with Joe Biden.  —  Those were bad, but the complete interview was even worse.",
    "url": "https://redstate.com/nick-arama/2023/10/15/more-on-disastrous-biden-interview-throws-israel-under-the-bus-and-shows-he-has-no-idea-whats-going-on-n2165104"
  },
  {
    "text": "President Joe Biden: The 2023 60 Minutes interview transcript  —  Rarely does a president confront so much peril; the catastrophe in Israel—the war in Ukraine—and no help from a paralyzed Congress.  Late Thursday, we met President Biden at the White House.  It had been a rough week and we could see it on him.",
    "url": "https://www.cbsnews.com/news/president-joe-biden-2023-60-minutes-transcript/"
  },
  {
    "text": "Biden admin reaches deal with migrants separated from their families under Trump  —  The families also sought financial compensation from the U.S. government, but the Biden DOJ walked away from those negotiations two years ago.  —  The Biden administration and more than 4,000 migrants … ",
    "url": "https://www.nbcnews.com/politics/immigration/biden-admin-reaches-deal-migrants-separated-families-trump-rcna120587"
  },
  {
    "text": "Scholastic's “bigot button”  —  Scholastic, the popular publisher of children's books, is a big business.  It is a publicly-traded company with a market capitalization of $1.15 billion.  Its CEO, Peter Warwick, collected a total compensation of $3,300,361 in 2023, and at least four other executives were paid over $1.3 million.",
    "url": "https://popular.info/p/scholastics-bigot-button"
  },
  {
    "text": "Scoop: Oprah pitched a White House run with Mitt Romney, book reveals … - Romney tells Coppins he dismissed the idea, believing that such a campaign would inadvertently help Trump.",
    "url": "https://www.axios.com/2023/10/16/oprah-mitt-romney-trump-2020"
  },
  {
    "text": "Two of the Trump Grand Jurors in Georgia Agree to Sit for Interviews With Defense Attorneys, Judge Says  —  Fulton County Superior Court Judge Scott McAfee said counsel for Sidney Powell and Kenneth Chesebro will do the interviews on the record but not in public",
    "url": "https://themessenger.com/politics/trump-special-grand-jurors-georgia-agree-interviews-chesebro-powell"
  },
  {
    "text": "Jordan to face a challenger in floor vote Tuesday  —  ‘There will be an alternative for the rational part of the Republican conference,’ an opponent of the hard-right congressman says.",
    "url": "https://www.politico.com/live-updates/2023/10/15/congress/jordan-gets-a-challenger-00121640"
  },
  {
    "text": "Statement from President Joe Biden  —  Jill and I were shocked and sickened to learn of the brutal murder of a six-year-old child and the attempted murder of the child's mother in their home yesterday in Illinois.  —  The child's Palestinian Muslim family came to America seeking what we all seek … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2023/10/15/statement-from-president-joe-biden-4/"
  },
  {
    "text": "Iran says Hamas ready to release hostages if Israel stops airstrikes as at least 199 now known taken  —  Iran tried to pressure Israel into ending its revenge airstrikes on Gaza by claiming Monday that the Hamas terrorists long sponsored by Tehran would be willing to free the 199 hostages … ",
    "url": "https://nypost.com/2023/10/16/iran-says-hamas-will-free-hostages-if-air-strikes-end/"
  }
]