[
  {
    "text": "Supreme Court rules Trump cannot be kicked off ballot  —  The decision swiftly ended the legal fight over whether states could bar Trump from state ballots based on the Constitution's 14th Amendment.  —  WASHINGTON — The Supreme Court on Monday handed a sweeping win to former President Donald Trump … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-rules-trump-cannot-kicked-colorado-ballot-rcna132291"
  },
  {
    "text": "Supreme Court keeps Trump on ballot, rejects Colorado voter challenge  —  Decision comes a day before Super Tuesday and as justices weigh other key cases affecting Donald Trump  —  The Supreme Court on Monday unanimously sided with Donald Trump, allowing the former president to remain … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/04/supreme-court-trump-ballot-decision/"
  },
  {
    "text": "Supreme Court to post a decision Monday, possibly on Trump ballot access  —  The outcome of Donald Trump's challenge to a Colorado ruling barring him from the ballot is highly anticipated ahead of Super Tuesday  —  The Supreme Court is set to announce at least one opinion Monday morning … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/03/trump-colorado-ballot-supreme-court-decision/"
  },
  {
    "text": "The Supreme Court saves Trump's bacon  —  This free edition of PN is made possible by paid subscribers.  If you aren't one already, hit the button and sign up to support our independent journalism.  —  ⚖️ Subscribe to Public Notice ⚖️",
    "url": "https://www.publicnotice.co/p/supreme-court-trump-immunity-explained"
  },
  {
    "text": "Joe Biden's Last Campaign  —  Trailing Trump in polls and facing doubts about his age, the President voices defiant confidence in his prospects for reëlection.  —  “I'll show you where Trump sat and watched the revolution,” Joe Biden said, stepping out from behind his desk in the Oval Office.",
    "url": "https://www.newyorker.com/magazine/2024/03/11/joe-bidens-last-campaign?currentPage=all"
  },
  {
    "text": "Across the Board, Voters Give Better Marks to Trump's Policies Than Biden's  —  Times/Siena polls highlight how comparatively well-regarded Donald J. Trump's policies are, even by groups that were affected by policies that Democrats hope will be motivating issues in 2024.",
    "url": "https://www.nytimes.com/2024/03/04/us/politics/trump-biden-policies-help-hurt.html"
  },
  {
    "text": "What the Information Operation about Joe Biden's Age Looks Like  —  One reason Joe Biden is behind in the polls, I'm fairly convinced, is because Democrats relentlessly participate in an organized campaign to use Biden's age to dehumanize him.  —  Whether it involves making reasonable critiques … ",
    "url": "https://www.emptywheel.net/2024/03/04/what-the-information-operation-about-joe-bidens-age-looks-like/"
  },
  {
    "text": "Trump supporters target black voters with faked AI images  —  Donald Trump supporters have been creating and sharing AI-generated fake images of black voters to encourage African Americans to vote Republican.  —  BBC Panorama discovered dozens of deepfakes portraying black people as supporting the former president.",
    "url": "https://www.bbc.com/news/world-us-canada-68440150"
  },
  {
    "text": "AI-generated images of Trump with Black voters being spread by supporters  —  No evidence to tie fake images, including one created by Florida radio host, to Trump campaign, BBC Panorama investigation finds  —  Dozens of fake, artificial intelligence-generated photos showing Donald Trump … ",
    "url": "https://www.theguardian.com/us-news/2024/mar/04/trump-ai-generated-images-black-voters"
  },
  {
    "text": "Another GOP senator announces she won't vote for Trump in 2024  —  And then there were two: Lisa Murkowski and Mitt Romney are incumbent Republican senators who've publicly said they won't vote for Donald Trump in 2024.  —  After launching her Republican presidential campaign in February 2023 … ",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/another-gop-senator-announces-wont-vote-trump-2024-rcna141606"
  },
  {
    "text": "Key Figure in Trump's Business Pleads Guilty to Felony Perjury  —  Allen H. Weisselberg, the former Trump Organization finance chief, has already spent time at the Rikers Island jail complex.  The perjury plea will send him back.  —  Allen H. Weisselberg, a longtime lieutenant … ",
    "url": "https://www.nytimes.com/2024/03/04/nyregion/weisselberg-guilty-trump-business.html"
  },
  {
    "text": "Trump's White House Was ‘Awash in Speed’ — and Xanax  —  Under Trump, the White House Medical Unit was “like the Wild West,” and staffers had easy access to powerful stimulants and sedatives, sources tell Rolling Stone  —  IF YOU EVER looked at the actions of the Trump White House and wondered, ‘Are they on drugs?’",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-white-house-drugs-speed-xanax-1234979503/"
  },
  {
    "text": "Fury after Exxon chief says public to blame for climate failures  —  Darren Woods tells Fortune consumers not willing to pay for clean-energy transition, prompting backlash from climate experts  —  The world is off track to meet its climate goals and the public is to blame, Darren Woods … ",
    "url": "https://www.theguardian.com/us-news/2024/mar/04/exxon-chief-public-climate-failures"
  },
  {
    "text": "Trump's Tax Cut Fueled Investment but Did Not Pay for Itself, Study Finds  —  The most detailed research yet on corporate response to the 2017 Republican tax law shows modest gains for workers and high cost to the federal debt.  —  The corporate tax cuts that President Donald J. Trump signed … ",
    "url": "https://www.nytimes.com/2024/03/04/us/politics/trump-corporate-tax-cut.html"
  },
  {
    "text": "Mitch McConnell is the arsonist who set America on fire and ran away  —  The lyrics to Kenny Rogers' “The Gambler” are branded onto my brain.  In the summer of 1979, I was a 20-year-old so eager to break into journalism I took a job at a tiny paper in Peoria, Ill., and lived there with my grandparents.",
    "url": "https://www.inquirer.com/opinion/commentary/mitch-mcconnell-destroyed-america-runs-away-20240303.html"
  },
  {
    "text": "Abortion is Running Out of Babies  —  Whom do you abort when no one is pregnant?  —  [Make sure to read Daniel Greenfield's contributions in Jamie Glazov's new book: Barack Obama's True Legacy: How He Transformed America.]  —  The Biden administration is preparing to run the 2024 election on abortion.",
    "url": "https://www.frontpagemag.com/abortion-is-running-out-of-babies/"
  },
  {
    "text": "Map: 29 million Americans live under new voter ID laws put in place since 2020  —  One in nine voting-age adults live in a state with a new identification law.  —  Super Tuesday voters in North Carolina and Arkansas will encounter stricter voter ID requirements when they head to the polls … ",
    "url": "https://www.nbcnews.com/politics/2024-election/voter-identification-states-law-map-rcna137555"
  }
]