[
  {
    "text": "Preventing Abuses of the Legal System and the Federal Court  —  MEMORANDUM FOR THE ATTORNEY GENERAL THE SECRETARY OF HOMELAND SECURITY  —  Lawyers and law firms that engage in actions that violate the laws of the United States or rules governing attorney conduct must be efficiently and effectively held accountable.",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/03/preventing-abuses-of-the-legal-system-and-the-federal-court/"
  },
  {
    "text": "White House buoyed by submission of major law firm attacked by Trump  —  Paul, Weiss's chair hung former partner out to dry after a series of attacks on US legal community by president  —  Inside the White House, advisers to Donald Trump reveled in their ability to bully Paul, Weiss … ",
    "url": "https://www.theguardian.com/us-news/2025/mar/22/white-house-paul-weiss"
  },
  {
    "text": "Trump hangs sword of Damocles over the American legal system  —  Trump is directing Attorney General Pam Bondi to target lawyers and law firms “who engage in frivolous, unreasonable, and vexatious litigation against the United States.”  —  President Donald Trump is doubling down on his threats … ",
    "url": "https://www.politico.com/news/2025/03/22/donald-trump-law-firms-threat-027250"
  },
  {
    "text": "How a Major Democratic Law Firm Ended Up Bowing to Trump  —  Paul Weiss was targeted by an executive order from President Trump.  Its chairman, who had worked against Mr. Trump during his first term, then went to the Oval Office and cut a deal.  —  Since President Trump's first term … ",
    "url": "https://www.nytimes.com/2025/03/21/us/politics/paul-weiss-trump.html?unlocked_article_code=1.504.utfQ.HGMFILgYaAoj&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "What the Venezuelans Deported to El Salvador Experienced  —  On the night of Saturday, March 15, three planes touched down in El Salvador, carrying 261 men deported from the United States. … I was there to document their arrival.  —  For more than a year, I have been embedded throughout … ",
    "url": "https://time.com/7269604/el-salvador-photos-venezuelan-detainees/"
  },
  {
    "text": "Sen. Ruben Gallego: Trump set political ‘trap’ for Dems on deportation issue  —  U.S. Sen. Ruben Gallego said President Donald Trump has set a political “trap” for Democrats with his controversial deportations of Venezuelans to El Salvador.  In an interview with the Arizona Daily Star … ",
    "url": "https://tucson.com/news/local/subscriber/article_14958188-72e9-402c-9d63-268f231ef2e8.html"
  },
  {
    "text": "Tax revenue could drop by 10 percent amid turmoil at IRS  —  Staff cuts and disruptions related to the U.S. DOGE Service have officials bracing for a sharp loss of revenue.  —  Just now  —  Senior tax officials are bracing for a sharp drop in revenue collected this spring … ",
    "url": "https://www.washingtonpost.com/business/2025/03/22/irs-tax-revenue-loss-federal-budget/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQyNjE2MDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQzOTk4Mzk5LCJpYXQiOjE3NDI2MTYwMDAsImp0aSI6ImJmZDZkMGEzLTQ2YTQtNGUyYS1iNzNjLTFjYWZhZjVmN2JmMCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9idXNpbmVzcy8yMDI1LzAzLzIyL2lycy10YXgtcmV2ZW51ZS1sb3NzLWZlZGVyYWwtYnVkZ2V0LyJ9.tMXjcX_pKifjKRlyEVAIL4NFdmci1E2QPG0wdt1rpyE&itid=gfta"
  },
  {
    "text": "IRS nears deal with ICE to share addresses of suspected undocumented immigrants  —  The move toward information-sharing comes as President Donald Trump pushes his administration to use every resource to conduct what he hopes will be the largest mass deportation of immigrants in U.S. history.",
    "url": "https://www.washingtonpost.com/us-policy/2025/03/22/ice-irs-immigrants-deport/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQyNjE2MDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQzOTk4Mzk5LCJpYXQiOjE3NDI2MTYwMDAsImp0aSI6ImVlZDViMjExLTkwZDYtNDRkNi1iODA3LTJkOTQyNzRhZjJiOSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS91cy1wb2xpY3kvMjAyNS8wMy8yMi9pY2UtaXJzLWltbWlncmFudHMtZGVwb3J0LyJ9.YYErFt49qsNUlix8F8-roAlWjN9SrzqvpFYjc-wOiXs&itid=gfta"
  },
  {
    "text": "Musk's X suspends opposition accounts in Turkey amid civil unrest  —  Suspensions affect accounts spreading information about the widespread demonstrations.  —  Elon Musk's social media platform X has suspended several accounts belonging to opposition figures in Turkey amid widespread civil unrest in the country.",
    "url": "https://www.politico.eu/article/musks-x-suspends-opposition-accounts-turkey-protest-civil-unrest-erdogan-imamoglu-istanbul-mayor/"
  },
  {
    "text": "Elon Musk lashes out at US judges as they rule against Doge  —  Musk lambastes judges as leftwing activists in more than 20 posts as Trump administration's judiciary clash intensifies  —  In the days after a federal judge ruled Elon Musk's dismantling of USAID likely violated the constitution … ",
    "url": "https://www.theguardian.com/technology/2025/mar/22/elon-musk-doge-judges-usaid"
  },
  {
    "text": "CDC Clone Site, Rife with False Vaccine Claims, Hosted by Group Previously Led by HHS Secretary  —  A CDC clone site with false vaccine claims is hosted by an NGO once led by the current HHS Secretary.  With CDC logos, real social media links, and a near-identical design, it may violate federal laws.",
    "url": "https://infoepi.substack.com/p/cdc-clone-site-rife-with-false-vaccine"
  },
  {
    "text": "Trump's Latest Stunt: Revoking a Clearance I Don't Even Have  —  While I was enjoying the company of friends, Trump was trembling with rage.  Ha  —  3,268  —  Well, it looks like Donald Trump has done it again—another petty, performative move designed to punish his perceived enemies, regardless of reality.",
    "url": "https://adamkinzinger.substack.com/p/trumps-latest-stunt-revoking-a-clearance"
  },
  {
    "text": "Trump demands Maine governor apologize — or the state will face consequences  —  The Trump administration has sparred with Maine and singled out its governor in recent weeks over his order banning trans athletes from playing in women's sports.  —  President Donald Trump is demanding a … ",
    "url": "https://www.politico.com/news/2025/03/22/donald-trump-trans-athletes-maine-00003871"
  },
  {
    "text": "Trump said he didn't sign the Alien Enemies Act proclamation.  So who — or what — did?  —  Did Trump misspeak?  Is he trying to deflect a decision under heavy legal scrutiny onto Secretary of State Marco Rubio?  —  Joe Davidson",
    "url": "https://www.washingtonpost.com/politics/2025/03/22/trump-deportations-autopen/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQyNjE2MDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQzOTk4Mzk5LCJpYXQiOjE3NDI2MTYwMDAsImp0aSI6IjJhMWRkMmE5LTAyOWQtNDQ2My04YjhkLTQ1YTRmY2JiNzc3NCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzAzLzIyL3RydW1wLWRlcG9ydGF0aW9ucy1hdXRvcGVuLyJ9.j08sZRqoDJ5V9MhTC4jgUjYkZ1MYzQUERJVxZ-uyXE4&itid=gfta"
  },
  {
    "text": "US decision to limit Canadian access to border-straddling library prompts outpouring of emotion  —  For more than 100 years, people in Stanstead, Quebec have been able to walk into Derby Line, Vermont to enter the border-straddling Haskell Free Library and Opera House - no passport required.",
    "url": "https://apnews.com/article/canada-america-library-vermont-quebec-7c4851c705d18e0cc891c3ce085e15e4"
  },
  {
    "text": "Trump's Social Security chief backs down from ‘shutting down’ agency  —  The head of the U.S. Social Security Administration has backed down from “shutting down the agency” after a federal judge rebuked him for misinterpreting a court ruling that limited billionaire Elon Musk's access to agency information.",
    "url": "https://www.reuters.com/world/us/trumps-social-security-chief-backs-down-shutting-down-agency-2025-03-22/"
  },
  {
    "text": "Exclusive: Thousands of agents diverted to Trump immigration crackdown  —  Federal agents who usually hunt down child abusers are now cracking down on immigrants who live in the U.S. illegally.  —  Homeland Security investigators who specialize in money laundering are raiding restaurants … ",
    "url": "https://www.reuters.com/world/us/thousands-agents-diverted-trump-immigration-crackdown-2025-03-22/"
  },
  {
    "text": "Voice of America journalists sue Trump officials for dismantling the outlet  —  The lawsuit, filed in the Southern District of New York, asks a federal judge to order officials to restore the outlet.",
    "url": "https://www.washingtonpost.com/politics/2025/03/22/voice-america-lawsuit-trump-kari-lake/"
  },
  {
    "text": "Former federal prosecutor found dead in Virginia home  —  A former federal prosecutor was found dead Saturday morning at a home in Alexandria, Virginia, authorities said.  —  Officers with the Alexandria Police Department were dispatched to the home at 9:18 a.m. Eastern Time on a report of an unresponsive woman.",
    "url": "https://www.cbsnews.com/news/jessica-aber-former-federal-prosecutor-found-dead-virginia-home/"
  },
  {
    "text": "Elon Musk Returns to His Trump Playbook in a Big Wisconsin Race  —  The billionaire, now a White House official and no longer a private citizen, is spending millions of dollars to elect a conservative judge, and making himself a main character in the race.  —  Much has changed since … ",
    "url": "https://www.nytimes.com/2025/03/22/us/politics/elon-musk-brad-schimel-wisconsin-state-supreme-court.html?unlocked_article_code=1.504.PFPv.LVXKMkIq67Oe&smid=url-share"
  },
  {
    "text": "Homeland Security revokes temporary status for 532,000 Cubans, Haitians, Nicaraguans and Venezuelans  —  The Department of Homeland Security said Friday that it will revoke legal protections for hundreds of thousands of Cubans, Haitians, Nicaraguans and Venezuelans, setting them up for potential deportation in about a month.",
    "url": "https://apnews.com/article/immigration-humanitarian-parole-china-haiti-nicaragua-venezuela-c10f422939934cf8d1cf8a6f4dfc4610"
  },
  {
    "text": "Kitty Dukakis, humanitarian and activist for mental health, dies at 88  —  She campaigned fiercely for her husband, Michael Dukakis, in the 1988 presidential election, spoke openly about her struggles with addiction and later promoted electroconvulsive therapy as a treatment for depression.",
    "url": "https://www.washingtonpost.com/obituaries/2025/03/22/kitty-dukakis-michael-alcoholism-mental-health-dead/"
  },
  {
    "text": "CNN analyst says ‘big problem’ if Trump didn't sign deportation orders  —  CNN political analyst Elie Honig is questioning President Trump over his recent deflection on how the 1798 Alien Enemies Act was invoked by the administration to speed up the deportation of Venezuelan migrants allegedly linked to gang activity.",
    "url": "https://thehill.com/homenews/administration/5208986-cnn-elie-honig-donald-trump-deportation-flight-fight/"
  },
  {
    "text": "An airport, Mount Rushmore and the $100 bill: Inside the GOP effort to venerate Trump while he's still in office  —  House Republicans say they're honoring the sitting president with their unprecedented bills.  Historians see something darker.  —  Benjamin Franklin might have made scientific breakthroughs … ",
    "url": "https://www.politico.com/news/2025/03/22/trump-honors-still-in-office-republican-bills-00244107"
  },
  {
    "text": "Pentagon announces investigation into leaks that could include lie detector tests  —  The Pentagon's intelligence and law enforcement arms are investigating what it says are leaks of national security information.  Defense Department personnel could face polygraphs in the latest such inquiry by the Trump administration.",
    "url": "https://www.cbsnews.com/news/pentagon-announces-investigation-leaks-polygraph-tests-pete-hegseth/"
  },
  {
    "text": "Terrorizing our fellow Americans  —  Don't say you weren't warned  —  Donald Trump, J.D. Vance, Elon Musk, and Project 2025 promised to do a lot of really terrible things.  True to their word, they are implementing them all while the media watches and tries to make it normal … ",
    "url": "https://fpwellman.substack.com/p/terrorizing-our-fellow-americans"
  }
]