[
  {
    "text": "Henry Kissinger, War Criminal Beloved by America's Ruling Class, Finally Dies  —  The infamy of Nixon's foreign-policy architect sits, eternally, beside that of history's worst mass murderers.  A deeper shame attaches to the country that celebrates him  —  Henry Kissinger died on Wednesday … ",
    "url": "https://www.rollingstone.com/politics/politics-news/henry-kissinger-war-criminal-dead-1234804748/"
  },
  {
    "text": "Henry Kissinger, who shaped world affairs under two presidents, dies at 100  —  The diplomat exercised an unparalleled control over U.S. international affairs and policymaking.  He was also the target of relentless critics, who deemed him unprincipled and amoral.",
    "url": "https://www.washingtonpost.com/obituaries/2023/11/29/henry-kissinger-dead-obituary/"
  },
  {
    "text": "Henry Kissinger, the Hypocrite  —  Henry Kissinger, who died on Wednesday, exemplified the gap between the story that America, the superpower, tells and the way that we can act in the world.  At turns opportunistic and reactive, his was a foreign policy enamored with the exercise of power … ",
    "url": "https://www.nytimes.com/2023/11/30/opinion/henry-kissinger-the-hypocrite.html"
  },
  {
    "text": "Henry Kissinger Is Dead at 100; Shaped Nation's Cold War History  —  The most powerful secretary of state of the postwar era, he was both celebrated and reviled.  His complicated legacy still resonates in relations with China, Russia and the Middle East.  —  Henry A. Kissinger … ",
    "url": "https://www.nytimes.com/2023/11/29/us/henry-kissinger-dead.html"
  },
  {
    "text": "Henry Kissinger, America's Most Notorious War Criminal, Dies At 100  —  The titan of American foreign policy was complicit in millions of deaths — and never showed remorse for his decisions.  —  Henry Kissinger — who as a top American foreign policy official oversaw … ",
    "url": "https://www.huffpost.com/entry/henry-kissinger-dies_n_6376933ae4b0afce046cb44f"
  },
  {
    "text": "McCarthy privately recounts terse phone call with Trump after ouster  —  During the call, former president detailed the reasons he hadn't intervened during the effort to remove McCarthy as speaker  —  In the weeks after the Jan. 6, 2021, attack on the U.S. Capitol, then-House Minority Leader Kevin McCarthy … ",
    "url": "https://www.washingtonpost.com/politics/2023/11/30/donald-trump-kevin-mccarthy-phone-call/"
  },
  {
    "text": "GOP speculation mounts that McCarthy will exit Congress early … - “I have another week or so to decide because if I decide to run again, I have to know in my heart I'm giving 110%,” McCarthy said at The New York Times DealBook Summit on Wednesday, referring to California's Dec. 8 filing deadline.",
    "url": "https://www.axios.com/2023/11/30/kevin-mccarthy-speaker-might-leave-congress-gop"
  },
  {
    "text": "Majority of Florida Voters Support Abortion Amendment to State Constitution: Poll  —  If enough signatures are obtained, the Florida Supreme Court would then review the amendment and determine if it can be put on the ballot  —  A majority of Florida voters say they would vote yes … ",
    "url": "https://themessenger.com/politics/majority-of-florida-voters-support-abortion-amendment-to-state-constitution-poll"
  },
  {
    "text": "Arizona Governor Endorses Abortion Ballot Initiative  —  Arizona Governor Katie Hobbs endorsed an abortion ballot initiative that could appear on the November 2024 ballot earlier this week.  Hobbs signed a petition form for the “Arizona Abortion Access Act,” which would guarantee the right … ",
    "url": "https://themessenger.com/politics/arizona-governor-endorses-abortion-ballot-initiative"
  },
  {
    "text": "Defiant Santos announces effort to oust colleague ahead of his own likely expulsion  —  Rep. George Santos (R-N.Y.) may be getting pushed out of Congress, but he's making it clear that he won't be leaving quietly.  —  The embattled lawmaker announced Thursday morning that he will move … ",
    "url": "https://thehill.com/homenews/house/4334916-santos-bowman-house-expulsion/"
  },
  {
    "text": "He doesn't report having checking or savings.  So where did Andy Ogles get $320,000 for his campaign?  —  Watchdog: ' It's not clear from his financial disclosure reports where he got the money' that he claims to have loaned campaign  —  NASHVILLE, Tenn. (WTVF) — Where did Congressman Andy Ogles … ",
    "url": "https://www.newschannel5.com/news/newschannel-5-investigates/revealed/he-doesnt-report-having-checking-or-savings-so-where-did-andy-ogles-get-320-000-for-campaign"
  },
  {
    "text": "Americans Back Israel's Military Action in Gaza by 50% to 45%  —  WASHINGTON, D.C. — Half of Americans approve of Israel's military action in the Hamas-led Gaza Strip, and 45% disapprove, according to a Gallup poll conducted several weeks after Hamas launched a deadly attack on Israel that led to a major military operation by Israel.",
    "url": "https://news.gallup.com/poll/545045/americans-back-israel-military-action-gaza.aspx"
  },
  {
    "text": "Biden, Trump and ObamaCare  —  Democrats distort the issue, but the GOP offers no alternative.  —  Donald Trump handed his opponents another gift over the weekend by vowing to “terminate” ObamaCare—or at least that's how Democrats are translating his blunderbuss comments.",
    "url": "https://www.wsj.com/articles/donald-trump-obamacare-biden-republicans-healthcare-7fafda6a?mod=followamazon"
  },
  {
    "text": "Meta says it broke up Chinese influence operation looking to exploit U.S. political divisions  —  The company said it has taken down five different networks with ties to China, a sign that the country could be ramping up its propaganda efforts ahead of the U.S. election.",
    "url": "https://www.nbcnews.com/tech/security/meta-says-broke-chinese-influence-operation-looking-exploit-us-politic-rcna127181"
  },
  {
    "text": "Hollywood Goes Home: How Celebrity Endorsements Are Helping Dems Win Down Ballot  —  The Hometown Project is finding success in pairing celebrities with down-ballot candidates from the areas they call home  —  In towns across the nation, there is that person - the kid who made it big … ",
    "url": "https://themessenger.com/politics/hollywood-goes-home-how-celebrity-endorsements-are-helping-dems-win-down-ballot"
  },
  {
    "text": "Pro-Palestinian protesters, one carrying swastika, swarm Midtown in bid to derail Rockefeller Center Christmas tree lighting  —  Hundreds of pro-Palestinian protesters swarmed the streets surrounding Rockefeller Center on Wednesday, clashing with NYPD cops and chanting “River to the sea,” … ",
    "url": "https://nypost.com/2023/11/29/metro/pro-palestinian-protesters-swarm-nyc-to-derail-rockefeller-center-christmas-tree-lighting/"
  },
  {
    "text": "Court filing reveals Rep. Scott Perry's vast web of contacts in bid to reverse 2020 election  —  A federal appeals court on Wednesday released previously secret text messages from Perry — only to remove them from the public docket later in the day.  —  At 11:08 p.m. on Dec. 30, 2020 … ",
    "url": "https://www.politico.com/news/2023/11/29/scott-perry-texts-unsealed-00129195"
  },
  {
    "text": "There are now more land mines in Ukraine than almost anywhere else on the planet  —  Ukraine is staring down a massive humanitarian challenge — now and into the future.  —  The sign is red, marked with a skull and crossbones and a warning: “Danger mines!”",
    "url": "https://www.vox.com/world-politics/2023/11/30/23979758/ukraine-war-russia-land-mines-artillery-humantarian-crisis"
  },
  {
    "text": "Attorney warned Trump 'it's going to be a crime' if he didn't comply with subpoena for classified docs: Sources  —  Trump attorney Jennifer Little spoke with federal investigators, sources said.  —  This image contained in a court filing by the Department of Justice on Aug. 30, 2022 … ",
    "url": "https://abcnews.go.com/US/attorney-warned-trump-crime-comply-subpoena-classified-docs/story?id=105228569"
  },
  {
    "text": "Fox Co-Hosts Call Out Jesse Watters After Remarks on Women, Cars  —  Watters also claimed that only “liberal, suburban house husbands” are in the market for electric vehicles.  —  Jesse Watters was called out Wednesday by his female colleagues during a discussion on electric vehicles … ",
    "url": "https://www.thedailybeast.com/fox-co-hosts-call-out-jesse-watters-after-remarks-on-women-cars"
  },
  {
    "text": "Anthony Fauci to Testify in House on Covid-19 Pandemic's Origins, U.S. Response  —  Former White House medical adviser is expected to be grilled in private and public sessions  —  WASHINGTON—After months of negotiations, former chief White House medical adviser Anthony Fauci has agreed … ",
    "url": "https://www.wsj.com/politics/anthony-fauci-to-testify-in-house-on-covid-19-pandemics-origins-u-s-response-297bbf41?mod=followamazon"
  },
  {
    "text": "Speaker Johnson singed by a blast of conservative fury  —  The right's ire toward the Louisiana Republican isn't universal.  But it's growing: One member called him a “joke,” and another deemed his performance “plummeting.”  —  Speaker Mike Johnson is edging closer to the same sort of clash … ",
    "url": "https://www.politico.com/news/2023/11/29/speaker-johnson-singed-by-a-blast-of-conservative-fury-00129180"
  }
]