[
  {
    "text": "Iowa Poll: Kamala Harris leapfrogs Donald Trump to take lead near Election Day.  Here's how  —  The nationally recognized Iowa Poll shows Kamala Harris picking up support from women to surpass Donald Trump in a ruby-red state he has won twice … Kamala Harris now leads Donald Trump in Iowa … ",
    "url": "https://www.desmoinesregister.com/story/news/politics/iowa-poll/2024/11/02/iowa-poll-kamala-harris-leads-donald-trump-2024-presidential-race/75354033007/"
  },
  {
    "text": "Trump ahead of Harris in Iowa in new Emerson College poll  —  Former President Trump is ahead of Vice President Harris by 10 points in Iowa, according to a new poll released on Saturday.  —  The new survey, from Emerson College Polling/RealClearDefense, found the Republican nominee leading by 10 points … ",
    "url": "https://thehill.com/homenews/campaign/4968006-trump-ahead-harris-iowa-new-poll/"
  },
  {
    "text": "Trump Losing Sleep Over Polling Numbers Days Before Election  —  SLEEPLESS IN MAR-A-LAGO  —  The GOP nominee is growing obsessive in the last mad dash to Election Day.  —  Donald Trump is reportedly losing sleep, battling anxiety, and obsessing over his polling numbers as the GOP nominee hopes … ",
    "url": "https://www.thedailybeast.com/trump-losing-sleep-over-polling-numbers-days-before-election/"
  },
  {
    "text": "October surprise: Trump just blew a huge lead, and the Madison Square Garden rally started the drop, says top data scientist  —  Donald Trump speaks during a campaign rally at Madison Square Garden in New York on Oct. 27.  —  Donald Trump is suffering an historic descent in the campaign's final days … ",
    "url": "https://fortune.com/2024/11/02/election-odds-donald-trump-lead-kamala-harris-madison-square-garden-rally-electoral-votes/"
  },
  {
    "text": "Donald Trump's freakshow continues unabated  —  Trump insists on posing as the salient question of the election: are you crazier today than you were four years ago?  —  Donald Trump's threat to execute Liz Cheney, “with a rifle standing there with nine barrels shooting at her”, is the apogee so far of his Hitlerian rhetoric.",
    "url": "https://www.theguardian.com/commentisfree/2024/nov/02/trumps-behavior-election"
  },
  {
    "text": "Trump Needs Help  —  Last night he simulated oral sex in public.  —  I do not know how to put this gently or tastefully, so I will factually describe what happened last night in Milwaukee: A former president of the United States held a rally, during which he used a microphone holder … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/11/trump-pantomimes-oral-sex-at-rally/680511/?gift=mBLCHcnsd_Gd3EecvWSKTdY-sV8z3C4QU-jpQ797nnw&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Donald Trump Weirdly Simulates Sex Act on Microphone Stand  —  NUT JOB  —  The former president had a meltdown at a rally in Milwaukee Friday night over a faulty mic, which culminated in him simulating fellatio.  —  Donald Trump had a full meltdown during his rally in Milwaukee on Friday night … ",
    "url": "https://www.thedailybeast.com/donald-trump-weirdly-simulates-sex-act-on-microphone-stand/"
  },
  {
    "text": "Listen To The Jeffrey Epstein Tapes: 'I Was Donald Trump's Closest Friend'  —  THE PREDATOR AND THE PRESIDENT  —  Explosive tapes recorded by author Michael Wolff show Epstein claiming Trump liked to “f—” his friends' wives and first slept with Melania on the Lolita Express.  —  EXCLUSIVE",
    "url": "https://www.thedailybeast.com/listen-to-the-jeffrey-epstein-tapes-i-was-donald-trumps-closest-friend/"
  },
  {
    "text": "Harris Will Make Surprise Appearance on ‘Saturday Night Live’  —  After a campaign rally in Charlotte, N.C., she was heading north to New York, where she was expected to appear on the late-night sketch comedy show.  —  Vice President Kamala Harris will make a surprise appearance on … ",
    "url": "https://www.nytimes.com/2024/11/02/us/politics/kamala-harris-snl.html"
  },
  {
    "text": "AP Sources: Kamala Harris will appear on SNL in last episode before presidential election  —  Vice President Kamala Harris has made an unannounced trip to New York to appear on “ Saturday Night Live,” briefly stepping away from the battleground states where she's been campaigning with just three days to go before the election.",
    "url": "https://apnews.com/article/harris-unscheduled-new-york-visit-f58069ca1db9ec077b092a52bd118ac5"
  },
  {
    "text": "'We can't take a chance': Trump barnstorms North Carolina in the final stretch  —  “If one state could bite us in the ass, it's North Carolina,” said a Trump campaign official.  —  GREENSBORO, North Carolina — Nowhere is Trump spending more time in his final three days on the campaign trail … ",
    "url": "https://www.politico.com/news/2024/11/02/trump-north-carolina-campaigning-00186944"
  },
  {
    "text": "Early voting numbers are in  —  ADAMS' TRIAL DATE: A Manhattan judge has set Mayor Eric Adams' federal trial to start on April 21, 2025, just two months before the Democratic primary where the mayor plans to stand for reelection.  —  “I do think it's important for the public to have an answer … ",
    "url": "https://www.politico.com/newsletters/new-york-playbook-pm/2024/11/01/early-voting-new-york-house-congressional-districts-00186820"
  },
  {
    "text": "Robert F. Kennedy Jr. Says Trump Will Seek to Remove Fluoride From Drinking Water  —  Donald J. Trump has said he would give Mr. Kennedy, a former rival who has long promoted unproven medical theories, a prominent health role if he wins.  —  Robert F. Kennedy Jr. said Saturday that among … ",
    "url": "https://www.nytimes.com/2024/11/02/us/politics/robert-f-kennedy-jr-trump-fluoride-water.html"
  },
  {
    "text": "Trump Media Outsourced Jobs to Mexico Even as Trump Pushes “America First”  —  On the campaign trail, Donald Trump threatened businesses that send jobs south of the border, while his own company that runs the Truth Social platform outsourced coding jobs to workers in Mexico, outraging some staff members.",
    "url": "https://www.propublica.org/article/donald-trump-media-outsourced-jobs-mexico-truth-social"
  },
  {
    "text": "Issue 69 - Nice  —  Coinbase threatens me that continuing to report on their activities would be “.... unwise”.  Also, election spending hits a fever pitch, with several new crypto PACs coming out of the woodwork.  —  1×  —  My previous issue about facing legal threats … ",
    "url": "https://www.citationneeded.news/issue-69/"
  },
  {
    "text": "Mike Johnson adds to Democrats' 11th hour arsenal … - “This is really deadly for them in the Midwest. … - The lawmaker added that there is “chatter among colleagues already” about incorporating the episode into their closing message and using it to argue “how little they care about ... older industrial cities.”",
    "url": "https://www.axios.com/2024/11/02/mike-johnson-chips-act-repeal-democrats"
  },
  {
    "text": "New York Times editorial board urges voters to choose Harris  —  The New York Times editorial board published an opinion piece on Saturday urging people not to vote for former President Trump.  —  “You already know Donald Trump.  He is unfit to lead.  Watch him.",
    "url": "https://thehill.com/homenews/campaign/4967701-new-york-times-editorial-board-urges-voters-to-choose-harris/"
  },
  {
    "text": "Why I am Setting out on a Journey and Inviting You Along  —  I'm back from my 4-month blogging sabbatical.  Today I plan to talk about what's wrong with our politics and why so many people are tuning it out.  Also a new piece by political psychologist Karen Stenner, some lessons from the past five years … ",
    "url": "https://terikanefield.com/why-i-am-setting-out-on-a-journey-and-inviting-you-along/"
  },
  {
    "text": "Harris campaign launches closing ad  —  The Harris campaign released its closing ad on Saturday — “Brighter Future” — which will air nationally across NFL games on CBS and Fox this weekend, including during the Detroit Lions vs. Green Bay Packers game — a matchup of swing-state teams … ",
    "url": "https://www.politico.com/live-updates/2024/11/02/2024-elections-live-coverage-updates-analysis/harris-closing-ad-football-00186908"
  }
]