[
  {
    "text": "Heavily armed immigration agents descend on MacArthur Park in L.A.  —  Dozens of immigration agents, some on horseback, others carrying rifles in armored vehicles, swept through MacArthur Park on Monday in an extraordinary show of force at the heart of Los Angeles' immigrant community.",
    "url": "https://www.latimes.com/california/story/2025-07-07/immigration-agents-descend-on-macarthur-park"
  },
  {
    "text": "Humvees, Mounted ICE Officers And Soldiers Descend On LA's ‘Ellis Island,’ Face Protesters And Mayor  —  Around 100 soldiers and federal agents convened at the Los Angeles park Monday morning for an immigration enforcement operation.  —  LOS ANGELES, CA — Over 100 members … ",
    "url": "https://patch.com/california/los-angeles/humvees-mounted-ice-officers-soldiers-descend-las-ellis-island-face"
  },
  {
    "text": "Troops and federal agents briefly descend on LA's MacArthur Park in largely immigrant neighborhood  —  Dozens of federal officers in tactical gear and about 90 members of the California National Guard were deployed for about an hour Monday to a mostly empty park in a Los Angeles neighborhood with a large immigrant population.",
    "url": "https://apnews.com/article/california-immigration-raid-troops-military-2d81f5c35f9d11db9e32234e03480497"
  },
  {
    "text": "Four Fears about ICE, Trump's New Masked Monster  —  We're about to pour $200 billion into immigration enforcement—but understanding specifically why this is a bad idea is important. … There are many reasons Trump's new giant domestic agenda, the so-called one big beautiful bill … ",
    "url": "https://www.doomsdayscenario.co/p/four-fears-about-ice-trump-s-new-masked-monster-bf1f7205365d4b27"
  },
  {
    "text": "Are We About to Have Labor Camps in the United States of America? … One aspect of the Republicans' big, ugly bill that didn't get enough attention until Representative Alexandria Ocasio-Cortez elevated it over the last few days is the massive amounts of money it directs to the apprehension and detention of immigrants.",
    "url": "https://newrepublic.com/article/197619/trump-immigration-labor-camps"
  },
  {
    "text": "Ted Cruz Kept Sightseeing as Desperate Rescue Crews Searched for Missing Kids in Texas Floods  —  GREEK TRAGEDY  —  The Texas senator was visiting the Parthenon in Athens while a massive rescue mission was under way to find flood victims, our must-read newsletter, The Swamp, reveals.  —  EXCLUSIVE",
    "url": "https://www.thedailybeast.com/ted-cruz-was-vacationing-in-europe-as-emergency-crews-desperately-searched-for-texas-flood-survivors/"
  },
  {
    "text": "Texas floods live updates: At least 90 dead or missing, including Camp Mystic campers and counselors, as storms continue  —  Forecasters warn slow-moving thunderstorms could cause more flash flooding over Texas today. … Couple search for five missing family members",
    "url": "https://www.nbcnews.com/news/us-news/live-blog/texas-floods-live-updates-search-for-survivors-rcna217165"
  },
  {
    "text": "Epstein ‘client list’ doesn't exist, Justice Department says, walking back theory Bondi had promoted  —  Jeffrey Epstein did not maintain a “client list,” the Justice Department acknowledged Monday as it said no more files related to the wealthy financier's sex trafficking investigation … ",
    "url": "https://apnews.com/article/jeffrey-epstein-justice-department-pam-bondi-03fbcd024f631440f7ed62b3c6927db3"
  },
  {
    "text": "The sad, sad state of the New York Times  —  The sad fact is that there is nothing terribly out of character about the New York Times's decision to publish a deceptive hit piece about New York mayoral candidate Zohran Mamdani, based on hacked data supplied by a noted eugenicist to whom they granted anonymity.",
    "url": "https://presswatchers.org/2025/07/the-sad-sad-state-of-the-new-york-times/"
  },
  {
    "text": "Veterans Affairs reverses course on large-scale layoffs  —  The agency says it is on pace to reduce its total staff by nearly 30,000 employees by the end of this fiscal year through retirements, attrition and deferred resignations after previously saying it would need to cull 83,000.",
    "url": "https://www.washingtonpost.com/politics/2025/07/07/veterans-affairs-layoffs-doge-cuts/"
  },
  {
    "text": "U.S. measles cases reach 33-year record high as outbreaks spread  —  Johns Hopkins University data reflects the public health reversal in defeating the vaccine-preventable disease since measles was officially eliminated from the U.S. in 2000.  —  Summary564",
    "url": "https://www.washingtonpost.com/health/2025/07/07/measles-cases-hit-record/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzUxODYwODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzUzMjQzMTk5LCJpYXQiOjE3NTE4NjA4MDAsImp0aSI6IjEwNjdiZjdhLTY4MTItNDdkNi1iNjQ0LTRlZDU4NDllZjBhZSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9oZWFsdGgvMjAyNS8wNy8wNy9tZWFzbGVzLWNhc2VzLWhpdC1yZWNvcmQvIn0.tv8FpqIoeefEzhyt_TLm-jcydb3Vb7Mxkj3Q45UzS74&itid=gfta"
  },
  {
    "text": "Debate erupts over role job cuts played in weather forecasts ahead of deadly Texas floods  —  Former federal officials and outside experts have warned for months that President Donald Trump's deep staffing cuts to the National Weather Service could endanger lives.",
    "url": "https://apnews.com/article/weather-texas-floods-trump-doge-cuts-noaa-nws-commerce-hurricane-4740019969a6b7a1b566e98dcb85562b"
  },
  {
    "text": "Who Is Scott Ruskan?  Coast Guard Hero Saves 165 People From Texas Floods  —  Scott Ruskan, a 26-year-old rescue swimmer with the U.S. Coast Guard, is being applauded as an “American hero” after his first mission saw him save 165 people affected by the flash floods in Texas.",
    "url": "https://www.newsweek.com/scott-ruskan-kristi-noem-texas-flash-floods-trump-2095390"
  },
  {
    "text": "Here Are Trump's New Tariff Threats  —  President Trump has told 14 countries that they will face tariffs of at least 25 percent on Aug. 1 if they don't reach agreements by then.  —  President Trump informed Japan, South Korea and 12 other nations on Monday that they will face significantly … ",
    "url": "https://www.nytimes.com/2025/07/07/business/trump-tariffs-trade-deals-august-1.html"
  },
  {
    "text": "Musk and Yang have connected on the billionaire's third party threat … He did not respond to follow-up questions about when they spoke and what else they discussed.  Yang amped up his denunciation of America's two-party system after his failed run for New York City mayor in 2021 as a Democrat.",
    "url": "https://www.politico.com/news/2025/07/07/musk-and-yang-have-connected-on-the-billionaires-third-party-threat-00441702"
  },
  {
    "text": "Democrats told to “get shot” for the anti-Trump resistance  —  At town halls in their districts and in one-on-one meetings with constituents and activists, Democratic members of Congress are facing a growing thrum of demands to break the rules, fight dirty — and not be afraid to get hurt.",
    "url": "https://www.axios.com/2025/07/07/democrats-trump-resistance-violence-congress"
  },
  {
    "text": "Planned Parenthood sues over Trump megabill ‘defunding’ provision  —  Planned Parenthood sued the Trump administration Monday over a provision in the new tax and spending law that would strip Medicaid funding from its health centers because the organization also provides abortions.",
    "url": "https://thehill.com/policy/healthcare/5388133-planned-parenthood-sues-medicaid-funding/"
  },
  {
    "text": "An Elderly Lawmaker's Staff Keeps Walking Back Things She Tells Reporters.  Should They Keep Quoting Her?  —  A media conundrum for the age of gerontocracy.  —  A few weeks ago, my POLITICO colleague Nicholas Wu and NBC's Sahil Kapur ran into D.C. Del. Eleanor Holmes Norton in the Capitol.",
    "url": "https://www.politico.com/news/magazine/2025/07/07/capitol-hill-gerontocracy-eleanor-holmes-norton-dianne-feinstein-joe-biden-00437318"
  },
  {
    "text": "I.R.S. Says Churches Can Endorse Candidates From the Pulpit  —  In a court filing, the tax agency said a decades-old ban on campaigning by tax-exempt groups should not apply to houses of worship speaking to their own members.  —  The I.R.S. said on Monday that churches and other houses … ",
    "url": "https://www.nytimes.com/2025/07/07/us/politics/irs-churches-politics-endorse-candidates.html"
  },
  {
    "text": "Trump Fired Them.  Now They're Plotting to Stop Him.  —  Former USAID and State Department officials worried about the future of democracy in America say they're actively organizing to resist Trump, inside and outside of government.  — Copy  —  Some of the democracy-building experts … ",
    "url": "https://www.notus.org/donald-trump/usaid-state-department-employees-fired-organize"
  },
  {
    "text": "Trump Told Zelensky He Wasn't Responsible for Weapons Holdup  —  The assurance in a call last week keeps open the option that Trump will continue military aid to Kyiv  —  WASHINGTON—President Trump told Ukrainian President Volodymyr Zelensky that he wasn't responsible for a halt … ",
    "url": "https://www.wsj.com/politics/national-security/trump-told-zelensky-he-wasnt-responsible-for-weapons-holdup-f684444b"
  },
  {
    "text": "El Salvador Contradicts Trump, Says It Has No Authority Over Migrants Held in Megaprison  —  El Salvador told the United Nations that it has no legal authority over hundreds of Venezuelan men that President Donald Trump sent to a Salvadoran megaprison earlier this year.",
    "url": "https://www.democracydocket.com/news-alerts/el-salvador-contradicts-trump-no-authority-venezuelans-alien-enemies-act-cecot/"
  },
  {
    "text": "Pediatrician fired for vile post suggesting Texas flood victims were Trump supporters who got ‘what they voted for’  —  A pediatrician has been fired over a vile post suggesting that the more than 80 killed in the horrific Texas floods — including dozens of kids — were President Trump supporters who got “what they voted for.”",
    "url": "https://nypost.com/2025/07/07/us-news/pediatrician-fired-for-vile-post-politicizing-devastating-texas-floods-may-they-get-what-they-voted-for/"
  },
  {
    "text": "Court Strikes Down ‘Unconstitutional’ Kansas Ballot Application Law  —  In a major win for voters, a federal court ruled that a Kansas law banning prefilled mail-in ballot applications is unconstitutional and violates the First Amendment.  —  The law, known as the “Personalized Application Prohibition … ",
    "url": "https://www.democracydocket.com/news-alerts/court-strikes-down-unconstitutional-kansas-ballot-application-law/"
  },
  {
    "text": "Take Off the Mask, ICE … From 2011 to 2013, I commanded the New York City Police Department's 6th Precinct, which covers Greenwich Village.  We had a team of plainclothes officers who went out looking for serious crimes in progress.  Sometimes they worked out of a dilapidated unmarked van … ",
    "url": "https://www.theatlantic.com/ideas/archive/2025/07/face-covering-masks-ice-officers/683392/?gift=mRAZp9i2kzMFnMrqWHt67cDDc8pkttMdE6DeU88MowA"
  },
  {
    "text": "Former Houston appointee claims flood-ravaged Camp Mystic is ‘Whites-only’ in viral video  —  Houston mayor condemns ‘deeply inappropriate’ comments as officials search for missing children  —  A former appointee to a Houston city board recently came under fire for claiming … ",
    "url": "https://www.foxnews.com/us/former-houston-appointee-claims-flood-ravaged-camp-mystic-whites-only-viral-video"
  }
]