[
  {
    "text": "Where Harris has improved the most on Biden  —  She's doing much better than Biden in every swing state.  —  ∙ Paid  —  I'll have a story forthcoming for you later this week — if I can find the time in between the zillion podcasts I'm doing — on renewed GOP efforts to “unskew the polls”.",
    "url": "https://www.natesilver.net/p/where-harris-has-improved-the-most"
  },
  {
    "text": "Trump Allies Fear He's Sabotaging His Own Campaign  —  The former president can't get over feeling “cheated” by Joe Biden's exit from the race, says one source, while another speculates he might “have PTSD” following last month's assassination attempt.  —  In the hierarchy of Donald Trump's put-downs … ",
    "url": "https://www.vanityfair.com/news/story/trump-allies-fear-sabotaging-campaign"
  },
  {
    "text": "The Fight To Redefine the 2024 Race for President  —  A new Cook Political Report Swing State Project Survey conducted by BSG and GS Strategy Group shows Vice President Kamala Harris leading or tied with former President Donald Trump in all but one of the seven battleground states.",
    "url": "https://www.cookpolitical.com/survey-research/2024-swing-state-project/fight-redefine-2024-race-president"
  },
  {
    "text": "J.D. Vance Is Bombing His Audition As Trump Heir Apparent  —  One of the many interesting things about the abrupt change in the trajectory of the 2024 presidential election since Kamala Harris replaced Joe Biden as the Democratic presidential nominee is that once very lively questions that had fallen by the wayside are returning.",
    "url": "https://nymag.com/intelligencer/article/jd-vance-audition-trump-heir-apparent.html"
  },
  {
    "text": "Former Trump aides claim Donald is in ‘meltdown’ and ‘feels the election is slipping from him’... so is ‘lighting up the campaign’  —  Donald Trump is ‘lighting up’ his campaign staffers as he hunkers down at Mar-a-Lago, two former aides have claimed.  —  The former president's reported meltdown comes … ",
    "url": "https://www.dailymail.co.uk/news/article-13741377/Inside-Trumps-meltdown-Ex-president-lighting-staff-hes-p-ssed-picking-JD-Vance-insiders-fear-hes-going-fire-two-extremely-talented-campaign-gurus.html"
  },
  {
    "text": "Jump in Enthusiasm for 2024 Race  —  Harris picks up support among young voters and ‘double haters’  —  West Long Branch, NJ - Democrats' enthusiasm has skyrocketed since they swapped their presidential nominee.  The latest national Monmouth (\"Mon-muth\") University Poll finds voter support … ",
    "url": "https://www.monmouth.edu/polling-institute/reports/monmouthpoll_us_081424/"
  },
  {
    "text": "Prepare for Trump to be sentenced to prison on September 18  —  The objective here is to enable VP Kamala Harris and the media-Democratic complex to label Trump ‘a convicted felon sentenced to prison’ as voting begins  —  To the surprise of no one, Judge Juan Merchan has yet again denied … ",
    "url": "https://www.foxnews.com/opinion/andrew-mccarthy-prepare-trump-sentenced-prison-september-18"
  },
  {
    "text": "Arizona court: Fetus can be referred to as ‘unborn human being’ in abortion measure voter pamphlet  —  PHOENIX (AP) — An informational pamphlet for voters who will decide whether to guarantee the constitutional right to an abortion can refer to a fetus as an “unborn human being,” the Arizona Supreme Court ruled Wednesday.",
    "url": "https://apnews.com/article/arizona-abortion-rights-ballot-measure-b0ea37c92692533da109fd74a07b25f7"
  },
  {
    "text": "Donald Trump rally in Asheville live updates: Thomas Wolfe Auditorium is full  —  Former President Donald Trump is in Asheville today, Aug. 14, to hold a campaign rally in his bid to regain the presidency in the Nov. 5 general election.  It is Trump's first campaign visit to Asheville since September 2016 … ",
    "url": "https://www.citizen-times.com/story/news/local/2024/08/14/trump-asheville-rally-republican-live-coverage/74787771007/"
  },
  {
    "text": "Google says Iranian efforts to hack US presidential campaigns are ongoing and wide-ranging  —  Google said Wednesday that an alleged Iranian hacking operation aimed at US presidential campaigns is ongoing and more wide-ranging than previously known as the hackers continue to target … ",
    "url": "https://www.cnn.com/2024/08/14/politics/google-iran-hacking-presidential-election"
  },
  {
    "text": "Biden harbors lingering frustration at Pelosi, Obama, Schumer  —  Ahead of the convention that's meant to unify the party, tensions still remain.  —  President Joe Biden is frustrated that Barack Obama wouldn't tell him to his face that he should leave the race.",
    "url": "https://www.politico.com/news/2024/08/14/biden-frustration-obama-pelosi-00173883"
  },
  {
    "text": "Ukraine says it has taken more ground and prisoners during its advance into Russia border region  —  Russia says it thwarted Ukrainian charge to expand its incursion across border  —  Remnants of war left in border area as Ukraine claims more advances in Russia incursion",
    "url": "https://apnews.com/article/russia-ukraine-war-kursk-incursion-6f65e2d6b295e898f4a59118a2c0c735"
  },
  {
    "text": "GOP pollster on Trump-Harris: 'I haven't seen anything like this'  —  Republican pollster Frank Luntz appears stunned at the current state of the Kamala Harris-Donald Trump matchup and this year's presidential election.  —  Luntz, who's been called “The Nostradamus of pollsters” … ",
    "url": "https://www.nj.com/politics/2024/08/gop-pollster-on-trump-harris-i-havent-seen-anything-like-this.html"
  },
  {
    "text": "Reporter grills Trump over ‘false’ crowd size claim: 'There's all kinds of video evidence'  —  Former President Donald Trump continued to falsely claim this week that he had spoken to the largest crowds in history.  —  After casting his ballot during early voting in the Florida primary Wednesday … ",
    "url": "https://www.rawstory.com/trump-harris-crowd-size/"
  },
  {
    "text": "Inflation is easing.  Now, Harris has an even bigger problem with the economy.  —  Fissures are forming in the economy just as the Fed's long-running fight against inflation looks to be nearing its conclusion.  —  Federal Reserve policymakers and top economists say the U.S. has turned the corner on inflation.",
    "url": "https://www.politico.com/news/2024/08/14/inflation-harris-economy-feds-00173962"
  },
  {
    "text": "The big question touching a nerve this election: “Can my husband find out who I am voting for?”  —  November may come down to a battle between controlling men and women who just want their freedom  —  “Can my husband find out who I am voting for in the Presidential Election?”",
    "url": "https://www.salon.com/2024/08/14/can-my-husband-find-out-i-am-voting-for-the-big-question-touching-a-nerve-this/"
  },
  {
    "text": "Tampa Voters Get Their Say Two Years After DeSantis Axed Their Democratic Prosecutor  —  Andrew Warren is running to win back his old job as Tampa's top prosecutor.  Since the Democrat joined the race in April, he has released campaign videos, basked in endorsements, and raised hundreds … ",
    "url": "https://boltsmag.org/hillsborough-county-tampa-state-attorney-2024-election/"
  },
  {
    "text": "Turnout in Wisconsin election tops 26%, highest in 60 years for fall primary in presidential year  —  Turnout in Wisconsin's election Tuesday was the highest in 60 years for a presidential year partisan primary, with over 26% of the state's voting-age population casting ballots, based on unofficial results.",
    "url": "https://apnews.com/article/wisconsin-election-turnout-senate-24ac974d995a286fb79eb9a277e8435e"
  },
  {
    "text": "Ex-US air force specialist with Christian nationalist ties leads combat trainings  —  Michael Caughran's history raises questions about extent to which his far-right and survivalist activities overlapped with his enlistment  —  A former US air force survival expert with militia … ",
    "url": "https://www.theguardian.com/us-news/article/2024/aug/14/former-air-force-christian-nationalism-combat-courses"
  },
  {
    "text": "Daily on Energy: Central Atlantic offshore wind sale results, Nord Stream escape, ‘problematic’ permitting  —  WIND IN THEIR SALES: The Interior Department announced the winners of its fifth offshore wind lease sale on Wednesday, which resulted in $92.7 million in winning bids.",
    "url": "https://www.washingtonexaminer.com/daily-on-energy/3121920/daily-on-energy-central-atlantic-offshore-wind-sale-results-nord-stream-escape-problematic-permitting/"
  },
  {
    "text": "FTC bans fake online reviews, inflated social media influence; rule takes effect in October … The Federal Trade Commission on Wednesday voted unanimously to ban marketers from using fake reviews, like those generated with AI technology, and other misleading practices to promote their products and services.",
    "url": "https://www.cnbc.com/2024/08/14/ftc-bans-fake-reviews-social-media-influence-markers.html"
  }
]