[
  {
    "text": "Tennessee House advances bill to ban reappointing lawmakers booted for behavior  —  One of the Legislature's staff attorneys expressed concerns about the bill last week, telling House lawmakers during a committee hearing that it raises constitutional questions.",
    "url": "https://www.nbcnews.com/politics/politics-news/tennessee-house-advances-bill-ban-reappointing-lawmakers-booted-behavi-rcna140641"
  },
  {
    "text": "Pride flags would be largely banned in Tennessee classrooms in bill advanced by GOP lawmakers  —  The GOP-led Tennessee House has passed a bill that would largely ban displaying pride flags in public school classrooms  —  NASHVILLE, Tenn. — A bill that would largely ban displaying pride flags … ",
    "url": "https://abcnews.go.com/Politics/wireStory/pride-flags-largely-banned-tennessee-classrooms-bill-advanced-107568221"
  },
  {
    "text": "Jack Smith Pounds Trump For His Unprecedented Conduct In MAL Case  —  A lot of things happened.  Here are some of the things.  This is TPM's Morning Memo.  —  No One Has Ever Done What Trump Did  —  Special Counsel Jack Smith unleashed a tight, targeted fusillade in the Mar-a-Lago case … ",
    "url": "https://morningmemo.talkingpointsmemo.com/p/jack-smith-pounds-trump-for-his-unprecedented"
  },
  {
    "text": "Senate GOP fears Speaker Johnson headed toward shutdown wreck  —  Senate Republicans are trying to wave their House GOP counterparts away from blundering into a partial government shutdown at week's end, something that looks increasingly likely given Speaker Mike Johnson's (R-La.) unstable grip on power over a narrow majority.",
    "url": "https://thehill.com/homenews/senate/4490424-senate-gop-fears-speaker-johnson-headed-toward-shutdown-wreck/"
  },
  {
    "text": "The economy is roaring.  Immigration is a key reason.  —  Momentum in the job market picked up aggressively over the past year — all while Washington is deadlocked on a border deal.  —  Immigration has propelled the U.S. job market further than just about anyone expected … ",
    "url": "https://www.washingtonpost.com/business/2024/02/27/economy-immigration-border-biden/"
  },
  {
    "text": "Duckworth to demand vote on IVF bill  —  The bill would establish federal protections that override any state policy restricting IVF access.  —  Sens. Tammy Duckworth (D-Ill.) and Patty Murray (D-Wash.) will hold a press conference Tuesday morning demanding a vote on their bill to federally protect … ",
    "url": "https://www.politico.com/news/2024/02/27/duckworth-ivf-senate-vote-00143509"
  },
  {
    "text": "'The numbers right now aren't good.'  —  FOR YEARS, DONALD TRUMP'S CAMPAIGN STAFF struggled to get him to make donor calls and take fundraising seriously.  —  But that was before Trump faced an incumbent president and a primary opponent who was outraising him.",
    "url": "https://plus.thebulwark.com/p/trump-fundraising-more-than-ever"
  },
  {
    "text": "Kroger's “nefarious bargain”  —  This is a special joint edition of Popular Information and Fingers, a newsletter about drinking in America by journalist Dave Infante.  Fingers is a must-read for anyone who cares about the business, culture, and chaos of booze.  Sign up HERE.",
    "url": "https://popular.info/p/krogers-nefarious-bargain"
  },
  {
    "text": "Letter With White Powder Mailed to Donald Trump Jr.'s Florida Home: Sources  —  Multiple fire trucks and men in hazmat suits were spotted outside Donald Trump Jr.'s home in Jupiter, Florida, on Monday evening. … Multiple fire trucks and men in hazmat suits were spotted outside Donald Trump Jr.'s home … ",
    "url": "https://www.thedailybeast.com/hazmat-teams-spotted-at-don-jrs-florida-home-after-white-powder-discovered"
  },
  {
    "text": "Nazis at CPAC is a frog-in-boiling-water moment for the right  —  The white supremacist right is penetrating the mainstream right with increasing ease.  —  The Conservative Political Action Conference is the premier gathering of right-wing activists and politicians in America every year … ",
    "url": "https://www.msnbc.com/opinion/msnbc-opinion/nazis-cpac-2024-response-rcna140521"
  },
  {
    "text": "Mouse-infested warehouse lands Family Dollar Stores with record $41M fine  —  An investigation found “live rodents, dead and decaying rodents, rodent feces, urine and odors,” at a warehouse in Arkansas.  —  Family Dollar Stores was this week ordered to pay $41.6 million for using … ",
    "url": "https://www.nbcnews.com/news/us-news/mouse-infested-warehouse-lands-family-dollar-stores-record-41m-fine-rcna140635"
  },
  {
    "text": "Trump Says He's Too Rich To Post Bond In Carroll Defamation Case  —  Bitch better have my money.  —  E. Jean Carroll would like her $83 million dollars, please.  —  On January 26, a jury in Manhattan returned its verdict in the advice columnist's second defamation trial against the former president.",
    "url": "https://abovethelaw.com/2024/02/trump-says-hes-too-rich-to-post-bond-in-carroll-defamation-case/"
  },
  {
    "text": "Emhoff unveiling $1.7B in new commitments to Biden anti-hunger initiative  —  Second gentleman Doug Emhoff is unveiling nearly $1.7 billion in new commitments to the Biden administration's efforts to end hunger by the end of the decade.  —  The list includes more than 140 commitments from nonprofits … ",
    "url": "https://thehill.com/homenews/administration/4491163-emhoff-unveiling-1-7b-in-new-commitments-to-biden-anti-hunger-initiative/"
  },
  {
    "text": "Wisconsin 2024 Poll: Trump 45%, Biden 42%  —  Home Polls Wisconsin 2024 Poll: Trump 45%, Biden 42%  —  Incumbent Democratic Sen. Baldwin Leads Potential GOP Opponent Hovde, 46% to 39%  —  A new Emerson College Polling/The Hill survey in Wisconsin finds 45% of voters support former President Donald Trump … ",
    "url": "https://emersoncollegepolling.com/wisconsin-2024-poll-trump-45-biden-42/"
  },
  {
    "text": "Trump's Ex-Press Aide Makes Surprising Admission About How She Voted In 2016  —  “I think I knew full well what kind of man he was when I went to go work for him,” Sarah Matthews told MSNBC's Nicolle Wallace.  —  LOADING  —  Sarah Matthews said Monday she did not vote for Donald Trump … ",
    "url": "https://www.huffpost.com/entry/sarah-matthews-vote-trump-2016_n_65dda6d4e4b0e4346d53d18f"
  },
  {
    "text": "DC court backs Clark's bid to block subpoena from bar investigators  —  Clark, who backed Trump's efforts to contest the 2020 election, is trying to avoid being disbarred.  —  An attempt by D.C. bar authorities to force former Justice Department attorney Jeff Clark to fork over documents … ",
    "url": "https://www.politico.com/news/2024/02/26/jeff-clark-subpoena-trump-bar-investigation-00143469"
  },
  {
    "text": "A Wild and Dangerous 2024 Experiment  —  “We are in this to win it,” No Labels' chief strategist, Ryan Clancy, told me one morning earlier this month.  Clancy and 16 other representatives of the beleaguered centrist group were staring at me through their respective Zoom boxes during a private briefing … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/02/no-labels-2024-election/677570/"
  },
  {
    "text": "Project 2025: The “Cowboy Catholic” & the Conservative Counter-Reformation  —  “Mandate for Leadership,” a totalitarian tome produced by the Heritage Foundation and its partners, is a how-to guide for ending the United States as we know it.  —  I. The “Cowboy Catholic”",
    "url": "https://gregolear.substack.com/p/project-2025-the-cowboy-catholic"
  },
  {
    "text": "Media Working Overtime to Bury Details of Laken Hope Riley's Murder  —  The media — most notably the Associated Press — are under fire from the right and sensible Americans for deliberately omitting the immigration status of the suspect in the murder of Laken Hope Riley, a 22-year-old college student out for a run in Athens, Georgia.",
    "url": "https://hotair.com/videos/2024/02/27/media-working-overtime-to-bury-details-of-laken-hope-rileys-murder-n3783678"
  },
  {
    "text": "Zelenskiy In Riyadh For Talks on Path to Ending Russia War  — Ukraine president will meet Mohammed Bin Salman for talks  — Sides will discuss peace formula, prisoner swaps, economy  —  Ukrainian President Volodymyr Zelenskiy arrived in Saudi Arabia for talks with Crown Prince Mohammed Bin Salman … ",
    "url": "https://www.bloomberg.com/news/articles/2024-02-27/zelenskiy-arrives-in-saudi-arabia-for-talks-with-crown-prince"
  },
  {
    "text": "Airman who set self on fire grew up on religious compound, had anarchist past  —  Less than two weeks before Aaron Bushnell walked toward the gates of the Israeli Embassy on Sunday, he and a friend talked by phone about their shared identities as anarchists and what kinds of risks and sacrifices were needed to be effective.",
    "url": "https://www.washingtonpost.com/dc-md-va/2024/02/26/israeli-embassy-airman-fire-death-gaza/"
  },
  {
    "text": "Democrats Reject Bipartisan Map and Will Redraw N.Y. House Districts  —  With the battle for House control likely to run through New York, Democrats in the State Legislature voted down a plan drawn by a bipartisan commission.  —  Democrats seized control over drawing New York's congressional districts … ",
    "url": "https://www.nytimes.com/2024/02/26/nyregion/redistricting-maps-ny-congress.html"
  }
]