[
  {
    "text": "First on CNN: Burgum suffered high-grade Achilles tear playing basketball, throwing debate participation into question  —  North Dakota governor and Republican presidential candidate Doug Burgum suffered a high-grade tear of his Achilles tendon while playing a game of pick-up basketball … ",
    "url": "https://www.cnn.com/2023/08/23/politics/doug-burgum-injured/"
  },
  {
    "text": "Emails reveal Secret Service contacts with Oath Keepers  —  Internal Secret Service emails obtained by CREW show special agents in close communication with Oath Keepers leader Stewart Rhodes, while failing to acknowledge the group's ties to white nationalists and clashes with law enforcement.",
    "url": "https://www.citizensforethics.org/reports-investigations/crew-investigations/emails-reveal-secret-service-contacts-with-oath-keepers/"
  },
  {
    "text": "The GOP debate shows that Trump's hostile takeover is complete  —  He's thoroughly humiliated everyone involved, including Fox News and the RNC. … The first Republican presidential primary debate of 2024 is tonight.  Usually the events are chances to shape the future of a party by introducing voters to new ideas and faces.",
    "url": "https://www.publicnotice.co/p/fox-news-gop-debate-trump-2024"
  },
  {
    "text": "Recent obstruction charges against Trump, others followed cooperation from Mar-a-Lago IT worker: Sources  —  The IT staffer is set to be a central witness in the case against Trump.  —  A Mar-a-Lago Information Technology worker's decision to cooperate with special counsel Jack Smith … ",
    "url": "https://abcnews.go.com/US/recent-obstruction-charges-trump-cooperation-mar-lago-worker/story?id=102431568"
  },
  {
    "text": "Prosecutors: Trump Mar-a-Lago security aide flipped after changing lawyers  —  Special counsel Jack Smith's team revealed the details of the employee's about-face in a new filing.  —  A Trump employee who monitored security cameras at Donald Trump's Mar-a-Lago estate abruptly retracted … ",
    "url": "https://www.politico.com/news/2023/08/22/trump-witness-reversal-testimony-jack-smith-00112355"
  },
  {
    "text": "Poll: DeSantis's support collapses ahead of 1st GOP debate  —  Last month, Florida Gov. Ron DeSantis launched a heavily hyped campaign “reboot,” in hopes of saving his struggling bid for the 2024 Republican presidential nomination.  —  It hasn't worked, according to a new Yahoo News/YouGov poll.",
    "url": "https://news.yahoo.com/poll-desantiss-support-collapses-ahead-of-1st-gop-debate-214353402.html"
  },
  {
    "text": "South Carolina Supreme Court Upholds Abortion Law, Reversing Earlier Decision  —  The ruling, by a newly all-male bench, allows the state's new six-week abortion ban to take effect.  —  The South Carolina Supreme Court on Wednesday upheld the state's new near-total ban on abortion by a 4-1 vote … ",
    "url": "https://www.nytimes.com/2023/08/23/us/south-carolina-abortion-supreme-court.html"
  },
  {
    "text": "‘Dark Brandon’ Appears on Fox News' Homepage on Day of Republican Debates: 'I'm Bringing Roe Back' (Exclusive)  —  President Joe Biden's 2024 reelection campaign is sending Milwaukee — and Fox News readers — a pro-choice message from the president's satirical alter-ego",
    "url": "https://people.com/dark-brandon-fox-news-homepage-ads-gop-debate-exclusive-7734825"
  },
  {
    "text": "Rudy Giuliani Set to Meet With Fani Willis in Georgia: Report  —  SO IT BEGINS...  Rudy Giuliani is expected to travel to Georgia on Wednesday to meet with Fulton County prosecutors—including District Attorney Fani Willis—according to CNN.  Giuliani, a former federal prosecutor himself … ",
    "url": "https://www.thedailybeast.com/rudy-giuliani-set-to-meet-with-fani-willis-in-georgia-report-says"
  },
  {
    "text": "How Oklahoma's schools superintendent became the state's top culture warrior  —  Ryan Walters, who called a teachers union a “terrorist organization” and pushed for prayer in public schools, offers a preview of what could be coming in other Republican-led states.",
    "url": "https://www.nbcnews.com/news/us-news/ryan-walters-oklahoma-schools-superintendent-tulsa-rcna101235"
  },
  {
    "text": "Trump gravitates to fringe figures despite efforts to limit their influence  —  The former president has resumed consulting with and embracing supporters whom other Republicans shun  —  On Aug. 13, former president Donald Trump spent the day at his New Jersey golf club with former congressional … ",
    "url": "https://www.washingtonpost.com/politics/2023/08/23/trump-fringe-advisers-campaign/"
  },
  {
    "text": "Raffensperger expected to be subpoenaed for Meadows' Fulton hearing  —  Two attorneys involved in Trump-Raffensperger call also summoned  —  X  —  Secretary of State Brad Raffensperger has been told he will be subpoenaed to provide testimony at a court hearing in which former White House chief … ",
    "url": "https://www.ajc.com/politics/raffensperger-expected-to-be-subpoenaed-for-meadows-fulton-hearing/AS6L3M3FJVA4ZKSUXRZ63PF4SU/"
  },
  {
    "text": "Man flees China by riding jet ski hundreds of miles to South Korea  —  The man, who has been detained since washing up in the port city of Incheon last week, is believed to be a dissident who was previously jailed for criticizing President Xi Jinping.  —  Video shows jet ski ‘Chinese man used to travel to South Korea’",
    "url": "https://www.nbcnews.com/news/world/china-dissident-jet-ski-south-korea-xi-jinping-rcna101343"
  },
  {
    "text": "Russia-Ukraine War: Prigozhin Listed as Passenger on Plane That Crashed, Killing All Aboard  —  The authorities did not confirm whether the Wagner mercenary leader, Yevgeny V. Prigozhin, was on board when a private jet crashed north of Moscow on Wednesday, killing 10 people.",
    "url": "https://www.nytimes.com/live/2023/08/23/world/prigozhin-russia-ukraine-war-news"
  },
  {
    "text": "Fake electors, Trump attorneys surrender in Trump Georgia case  —  More defendants charged alongside former President Trump in Georgia are surrendering, including two of the three indicted fake electors and two Trump attorneys.  —  David Shafer and Cathy Latham, both of whom signed documents purporting … ",
    "url": "https://thehill.com/regulation/court-battles/4166131-two-accused-fake-electors-surrender-in-trump-georgia-case/"
  }
]