[
  {
    "text": "More Speech and Fewer Mistakes  —  Meta's platforms are built to be places where people can express themselves freely.  That can be messy.  On platforms where billions of people can have a voice, all the good, bad and ugly is on display.  But that's free expression.",
    "url": "https://about.fb.com/news/2025/01/meta-more-speech-fewer-mistakes/"
  },
  {
    "text": "Meta is ending its fact-checking program in favor of a ‘community notes’ system similar to X  —  Meta CEO Mark Zuckerberg announced a series of major changes to the company's moderation policies and practices, saying that the election felt like a “cultural tipping point.”",
    "url": "https://www.nbcnews.com/tech/social-media/meta-ends-fact-checking-program-community-notes-x-rcna186468"
  },
  {
    "text": "Meta to get rid of factcheckers and recommend more political content  —  Mark Zuckerberg says company will ‘dramatically reduce censorship’ across Facebook, Instagram and Threads  —  Meta will get rid of factcheckers, “dramatically reduce the amount of censorship” and recommend … ",
    "url": "https://www.theguardian.com/technology/2025/jan/07/meta-facebook-instagram-threads-mark-zuckerberg-remove-fact-checkers-recommend-political-content"
  },
  {
    "text": "Live Updates: Meta to End Fact-Checking Program in Shift Ahead of Trump Term  —  The social networking giant will stop using third-party fact-checkers on Facebook, Threads and Instagram and instead rely on users to add notes to posts.  It is likely to please President-elect Trump and his allies.",
    "url": "https://www.nytimes.com/live/2025/01/07/business/meta-fact-checking"
  },
  {
    "text": "Meta is getting rid of fact checkers.  Zuckerberg acknowledged more harmful content will appear on the platforms now  —  New York CNN  —  In a number of sweeping changes that will significantly alter the way that posts, videos and other content are moderated online … ",
    "url": "https://www.cnn.com/2025/01/07/tech/meta-censorship-moderation/"
  },
  {
    "text": "Cannon temporarily blocks report on Trump classified-documents probe  —  Two Trump employees charged alongside him in the classified documents case separately asked Judge Aileen Cannon to block the release.  —  The federal judge in Florida who dismissed the case against Donald Trump … ",
    "url": "https://www.washingtonpost.com/national-security/2025/01/07/jack-smith-trump-special-counsel-report-garland/"
  },
  {
    "text": "Cannon temporarily blocks release of Jack Smith report  —  U.S. District Judge Aileen Cannon has temporarily blocked the Justice Department from releasing special counsel Jack Smith's final report on his two criminal investigations into Donald Trump.  —  The extraordinary move … ",
    "url": "https://www.politico.com/news/2025/01/07/aileen-cannon-blocks-jack-smith-report-release-00196863"
  },
  {
    "text": "Judge blocks release of special counsel report on Trump's criminal cases  —  The injunction lasts until three days after the 11th Circuit rules on a pending request to block the release of the report over a separate matter involving Trump's co-defendants.  —  The federal judge who oversaw … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/judge-blocks-release-special-counsel-report-trumps-criminal-cases-rcna186604"
  },
  {
    "text": "Trump's one-bill two-step perplexes GOP senators  —  GOP senators are questioning the president-elect's commitment to “one powerful bill.”  —  If Donald Trump thought he was settling the GOP's most important strategy dispute, Senate Republicans are not getting the message.",
    "url": "https://www.politico.com/news/2025/01/07/trump-gop-confusion-reconciliation-plan-00196745"
  },
  {
    "text": "Trump refuses to rule out use of military force to take control of Greenland and the Panama Canal  —  President-elect Donald Trump on Tuesday said he would not rule out the use of military force to seize control of the Panama Canal and Greenland, as he declared U.S. control of both to be vital to American national security.",
    "url": "https://apnews.com/article/trump-biden-offshore-drilling-gulf-of-america-fa66f8d072eb39c00a8128a8941ede75"
  },
  {
    "text": "How Democrats should talk about Trump's corruption  —  “There's really a need for a whole new set of reforms,” Noah Bookbinder says.  —  ∙ Paid  —  Donald Trump is the most brazenly self-dealing president in history.  He's surrounded these days by an obscene cast of billionaires … ",
    "url": "https://www.publicnotice.co/p/noah-bookbinder-2025-interview-trump-corruption"
  },
  {
    "text": "Trump could be setting himself up for a ‘powerful’ early failure  —  Trump wants to go big with his first legislative priority, but major pitfalls await — if he even recognizes them.  —  President-elect Donald Trump has never been terribly concerned with the legitimate obstacles in front of him or the finer points of legislating.",
    "url": "https://www.washingtonpost.com/politics/2025/01/07/trump-reconciliation-one-bill-congress-senate/"
  },
  {
    "text": "Melania Trump Documentary Scores Massive Amazon Payday  —  It's 2025, and even the Walt Disney Co. is kissing Donald Trump's ring.  But it's still stunning that Amazon is paying a whopping $40 million to license the Brett Ratner-directed Melania Trump documentary.",
    "url": "https://puck.news/melania-trump-documentary-scores-massive-amazon-payday/"
  },
  {
    "text": "New York appeals court denies halting Trump's sentencing  —  A New York appellate judge on Tuesday declined to suspend President-elect Trump's Friday sentencing on his hush money criminal conviction.  —  Judge Ellen Gesmer of the state's midlevel appeals court rejected Trump's emergency petition … ",
    "url": "https://thehill.com/regulation/court-battles/5071977-appeals-court-trump-sentencing/"
  },
  {
    "text": "Biden admin finalizes rule to ban medical debt from credit reports … - The CFPB estimates that for Americans with medical debt, the new rule could raise their credit scores by an average of 20 points.  — “People who get sick shouldn't have their financial future upended,” CFPB Director Rohit Chopra said in the press release.",
    "url": "https://www.axios.com/2025/01/07/medical-debt-ban-credit-reports-bidn-cfpb-rule"
  },
  {
    "text": "Former French far-right leader Jean-Marie Le Pen dies aged 96  —  Jean-Marie Le Pen, founder of the far-right National Front party who tapped into working class concerns over immigration and globalisation, shaking up the French political establishment, has died, sources close to his daughter Marine Le Pen said on Tuesday.",
    "url": "https://www.reuters.com/world/europe/former-french-far-right-leader-jean-marie-le-pen-dies-aged-96-media-reports-2025-01-07/"
  },
  {
    "text": "Why Mike Johnson's fake “Jefferson prayer” matters  —  Replacing facts with phony history is a linchpin of the Christian nationalist movement  —  One cannot say for certain that Rep. Mike Johnson was deliberately lying during his acceptance speech to return as Speaker of the House.",
    "url": "https://www.salon.com/2025/01/07/why-mike-johnsons-fake-jefferson-prayer-matters/"
  },
  {
    "text": "Washington Post Lays Off 4 Percent of Its Work Force  —  The layoffs will affect employees across The Post's business operations, not its newsroom.  —  The Washington Post has started laying off roughly 4 percent of its work force, the company said on Tuesday, as the newspaper struggles to stem millions of dollars in annual losses.",
    "url": "https://www.nytimes.com/2025/01/07/business/media/washington-post-layoffs.html"
  },
  {
    "text": "Trump announces $20 billion foreign investment to build new U.S. data centers … President-elect Donald Trump on Tuesday announced a $20 billion foreign investment to build new data centers across the United States.  —  Emirati billionaire Hussain Sajwani, a Trump associate and founder … ",
    "url": "https://www.cnbc.com/2025/01/07/trump-investment-hussain-sajwani-damac-data-centers.html"
  }
]