[
  {
    "text": "‘Dead heat’: Trump pulls even with Harris in NBC News poll  —  A close election has never looked more tightly divided, with Harris' popularity declining from its previous high and abortion atop voters' issue list.  —  Former President Donald Trump and Vice President Kamala Harris are deadlocked … ",
    "url": "https://www.nbcnews.com/politics/2024-election/dead-heat-trump-pulls-even-harris-nbc-news-poll-rcna174201"
  },
  {
    "text": "Economic discontent, issue divisions add up to tight presidential contest: POLL  —  Harris has 50% support to Trump's 48% among likely voters, the poll finds.  —  Republican presidential nominee former President Donald Trump, left, and Democratic presidential nominee Vice President Kamala Harris during … ",
    "url": "https://abcnews.go.com/Politics/economic-discontent-issue-divisions-add-tight-presidential-contest/story?id=114723390"
  },
  {
    "text": "CBS News Trump-Harris poll shows one election, two worlds: How information, beliefs shape tight campaign  —  The 2024 presidential contest between Kamala Harris and Donald Trump is more than just two ideologies competing over what should happen.  It's two groups of voters that look … ",
    "url": "https://www.cbsnews.com/news/trump-harris-poll-how-information-beliefs-shape-tight-2024-campaign/"
  },
  {
    "text": "‘Totally illegal’: Trump escalates rhetoric on outlawing political dissent and criticism  —  “This is out of the autocratic playbook.  As autocrats consolidate their power once they're in office, anything that threatens their power ... becomes illegal,” historian Ruth Ben-Ghiat said.",
    "url": "https://www.nbcnews.com/politics/2024-election/totally-illegal-trump-escalates-rhetoric-outlawing-political-dissent-c-rcna174280"
  },
  {
    "text": "Liz Cheney issues dire warning about ‘fundamentally cruel’ Trump, agrees he's a ‘fascist’  —  The former GOP representative from Wyoming said Vice President Kamala Harris, if elected, “will lead with a sincere heart” as “someone who's dedicated her life to public service.”",
    "url": "https://www.nbcnews.com/politics/2024-election/liz-cheney-issues-dire-warning-fundamentally-cruel-trump-agrees-s-fasc-rcna175193"
  },
  {
    "text": "Trump suggests heckler should ‘get the hell knocked out of her’ after rally  —  The remarks were part of a dark speech at a California rally where Trump called the U.S. an “occupied country.”  —  COACHELLA, Calif- Former president Donald Trump suggested that a heckler would later get … ",
    "url": "https://www.washingtonpost.com/politics/2024/10/12/trump-heckler-violence/"
  },
  {
    "text": "Machine for Fascism: The Two Stephens  —  When I saw the news that Trump is planning a rally at Madison Square Garden — as the Nazis did in 1939 — I checked the date to see whether that was before or after Steve Bannon gets out of prison.  —  Bannon is due to get out on October 29; the rally is two days earlier, on October 27.",
    "url": "https://www.emptywheel.net/2024/10/13/machine-for-fascism-the-two-stephens/"
  },
  {
    "text": "About those New York Times headlines  —  Twitter, which is what I prefer to call Elon Musk's disaster, is still interesting and useful at times, despite its decay.  —  And the other day, there was a dustup there over two New York Times headlines.  One was about Kamala Harris, the other about Donald Trump.",
    "url": "https://margaretsullivan.substack.com/p/about-those-new-york-times-headlines"
  },
  {
    "text": "Johnson says hurricane aid “can wait” until after House recess … - The Federal Emergency Management Agency has said it has enough funds to manage recovery operations for now, though it is expected to need additional funds in the long term.  — President Biden also warned congressional leaders earlier … ",
    "url": "https://www.axios.com/2024/10/13/mike-johnson-hurricane-aid-milton-helene"
  },
  {
    "text": "Donald Trump's Niece Says He Is Now ‘Owned’ by Elon Musk  —  'DEVIL'S BARGAIN'  —  Mary Trump described the Tesla CEO, who also owns X, formerly Twitter, as “the world's richest fascist” and a “South African jumping bean.”  —  Donald Trump is now “owned” by MAGA super-fan Elon Musk … ",
    "url": "https://www.thedailybeast.com/donald-trumps-niece-says-he-is-now-owned-by-tesla-boss-elon-musk"
  },
  {
    "text": "Vance doesn't say where patients will get care if Planned Parenthood is defunded  —  Ohio Sen. JD Vance (R), former President Trump's running mate, on Sunday didn't say where patients would go for health screenings, check-ups and more if Planned Parenthood is defunded.",
    "url": "https://thehill.com/homenews/campaign/4930869-jd-vance-planned-parenthood/"
  },
  {
    "text": "Tensions rise between Harris and Biden teams as election nears … - “They're too much in their feelings,” one close Harris ally said of the president's team — a sentiment shared even by some White House aides. … - Biden gave an impromptu press conference in the White House briefing room Friday … ",
    "url": "https://www.axios.com/2024/10/13/kamala-harris-biden-campaign-tension"
  },
  {
    "text": "Netanyahu mulls plan to empty northern Gaza of civilians and cut off aid to those left inside  —  Israeli Prime Minister Benjamin Netanyahu is examining a plan to seal off humanitarian aid to northern Gaza in an attempt to starve out Hamas militants, a plan that, if implemented … ",
    "url": "https://apnews.com/article/hamas-israel-generals-plan-eiland-gaza-219d7eb9a3050e281ccc032d5a56263c"
  },
  {
    "text": "Trump tested the limits on using the military at home.  If elected again, he plans to go further  —  During his first term as president, Donald Trump tested the limits of how he could use the military to achieve policy goals.  If given a second term, the Republican and his allies are preparing … ",
    "url": "https://apnews.com/article/trump-military-border-civil-unrest-domestic-use-a136c69cc85184b07f161c4c09b46c50"
  },
  {
    "text": "Colorado's Elections Chief Took on Trump.  She Needed Extra Security As She Gave Birth  —  Jena Griswold, Colorado's secretary of state, can say with certainty: “The MAGA threat environment follows us through every step of life” … They had gone through unsuccessful IVF treatments … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-jena-griswold-colorado-elections-security-birth-1235132716/"
  },
  {
    "text": "America First Policy Institute, a group advising Trump, says its systems were breached  —  A group helping to lay the groundwork for a future Donald Trump administration said its computer systems were breached, marking the second known instance that people supporting the former president have been the target of a cyberattack.",
    "url": "https://apnews.com/article/america-first-policy-institute-breach-2626d34b7426c4917f11052dafc7041c"
  }
]