[
  {
    "text": "The Prosecution of Trump May Have Terrible Consequences  —  Mr. Goldsmith served in the George W. Bush administration as an assistant attorney general and as special counsel to the general counsel of the Department of Defense.  —  It may be satisfying now to see Special Counsel Jack Smith … ",
    "url": "https://www.nytimes.com/2023/08/08/opinion/trump-indictment-cost-danger.html"
  },
  {
    "text": "Trump Turned the GOP Into the Party of Wishful Thinking  —  Its leaders assumed he was a joke, tried to make peace with him, and reckoned he was finished after 2020.  —  For a political class that likes to think of itself as a hardened cadre of cold-eyed realists, the leadership … ",
    "url": "https://www.wsj.com/articles/trump-turned-the-gop-into-the-party-of-wishful-thinking-2024-indictment-jack-smith-7c849bfa?mod=djemalertNEWS"
  },
  {
    "text": "Ex-Pence Adviser Trashes Former Boss, Backs Trump Instead  —  ‘UNWORTHY’  —  Mike Pence's former national security adviser Keith Kellogg released a statement Monday calling his old boss “unworthy of the presidency” and expressing admiration for Donald Trump.",
    "url": "https://www.thedailybeast.com/ex-pence-adviser-keith-kellogg-trashes-former-boss-backs-trump-instead"
  },
  {
    "text": "DeSantis Replaces Campaign Manager with Florida Chief of Staff As He ‘Reloads’ (Exclusive)  —  James Uthmeier has earned the governor's trust as an always-on-offense political fixer, but he has no campaign experience  —  A Facebook icon representing an external link to share the article … ",
    "url": "https://themessenger.com/politics/desantis-new-campaign-manager-exclusive"
  },
  {
    "text": "Ron DeSantis replaces campaign manager as he struggles to gain on Trump  —  The change comes amid a rough stretch of layoffs and budget woes as the Florida governor fails to make headway in the polls  —  Ron DeSantis is replacing his presidential campaign manager and making other changes … ",
    "url": "https://www.washingtonpost.com/politics/2023/08/08/ron-desantis-campaign-manager/"
  },
  {
    "text": "High turnout, long lines: A look at Ohio's last weekend of early voting on Issue 1  —  Saturday and Sunday were the last days to vote early in-person on Issue 1 and turnout was high across Ohio with lines stretching around buildings in some counties.  —  While many projected low turnout … ",
    "url": "https://www.dispatch.com/story/news/politics/elections/state/2023/08/07/issue-1-early-voting-closes-in-ohio-bringing-high-turnout-ahead-of-aug-8/70512342007/"
  },
  {
    "text": "Playbook: What Ohio might tell us about 2024  —  With help from Eli Okun and Garrett Ross  —  DRIVING THE DAY  —  HE'S IN — “Mike Pence qualifies for first GOP debate,” by Zach Montellaro and Adam Wren  —  WEATHER REPORT — “Thousands of flight cancellations, 1.1 million lose power … ",
    "url": "https://www.politico.com/newsletters/playbook/2023/08/08/what-ohio-might-tell-us-about-2024-00110229"
  },
  {
    "text": "House GOP eyes fall push for Biden impeachment inquiry  —  Speaker Kevin McCarthy has been insistent: House Republicans are still gathering evidence and have yet to decide whether to open up a formal impeachment inquiry against President Joe Biden.  —  “I didn't say I was doing an impeachment inquiry … ",
    "url": "https://www.cnn.com/2023/08/08/politics/house-republicans-impeachment-inquiry-biden/"
  },
  {
    "text": "DeSantis' Florida approves classroom videos that compare climate activists to Nazis  —  Florida Gov. Ron DeSantis has already come under fire after the administration formally approved the use of far-right PragerU videos as educational material in K-12 schools, owing to these videos' distorted takes … ",
    "url": "https://www.rawstory.com/prageru-florida-2662923106/"
  },
  {
    "text": "Press Release SEC Charges 11 Wall Street Firms with Widespread Recordkeeping Failures  —  Firms admit to wrongdoing and agree to pay penalties totaling $289 million  —  The Securities and Exchange Commission today announced charges against 10 firms in their capacity as broker-dealers … ",
    "url": "https://www.sec.gov/news/press-release/2023-149"
  },
  {
    "text": "EXCLUSIVE POLL: Trump Holds Big Lead in NH, DeSantis Drops to Tie With Christie  —  When Donald Trump returns to New Hampshire on Tuesday, he will be greeted by a Republican base that is overwhelmingly loyal to the former president.  —  How loyal?  In an exclusive new NHJournal/co-efficient poll … ",
    "url": "https://nhjournal.com/exclusive-poll-trump-holds-big-lead-in-nh-desantis-drops-to-tie-with-christie/"
  },
  {
    "text": "Why the Montgomery Riverfront Uprising is making Black people so damn happy  —  OPINION: Black people came to the defense of a Black man being beaten by a white mob.  What's not to like?  —  Editor's note: The following article is an op-ed, and the views expressed are the author's own.",
    "url": "https://thegrio.com/2023/08/07/why-the-montgomery-riverfront-uprising-is-making-black-people-so-damn-happy/"
  },
  {
    "text": "State Republicans formally oppose new national monument near Grand Canyon  —  KINGMAN, Ariz. — Top Republican leaders in Arizona held an emergency joint committee meeting in Kingman Monday night where they voted to formally oppose the creation of a new national monument near the Grand Canyon.",
    "url": "https://www.azcentral.com/story/news/local/arizona/2023/08/07/arizona-republicans-formally-oppose-new-grand-canyon-national-monument/70546687007/"
  },
  {
    "text": "Florida school board reverses decision nixing access to children's book about a male penguin couple  —  “And Tango Makes Three” recounts the true story of two male penguins who were devoted to each other at the Central Park Zoo in New York.  —  Months after access to a popular children's book … ",
    "url": "https://www.nbcnews.com/nbc-out/out-news/florida-school-board-reverses-decision-nixing-access-childrens-book-ma-rcna98763"
  },
  {
    "text": "Global child sexual abuse probe that was launched after two FBI agents were killed leads to almost 100 arrests  —  The Australian Federal Police announced Tuesday that at least 13 children were rescued from further harm as a result of a joint operation with the FBI, dubbed “Operation Bakis.”",
    "url": "https://www.nbcnews.com/news/world/child-sex-abuse-australia-arrests-fbi-agents-murder-rcna98707"
  },
  {
    "text": "CNN Poll: Abortion's role as an electoral litmus test hasn't faded a year after Supreme Court decision overturning Roe  —  Americans' discontent with the Supreme Court's decision overturning Roe v. Wade remains as potent as it was a year ago, according to a new CNN poll conducted by SSRS … ",
    "url": "https://www.cnn.com/2023/08/08/politics/cnn-poll-abortion-electoral-litmus-test-supreme-court/"
  },
  {
    "text": "Numb to Trump: Data shows drop in scandal interest  —  The public's attention to former President Trump's legal drama has declined with each subsequent indictment, according to new data pulled across television, social media and search activity. … - Searches spiked with all three indictments … ",
    "url": "https://www.axios.com/2023/08/08/trumps-indictments-traffic-ratings"
  },
  {
    "text": "House Republicans are adding dozens of anti-LGBTQ+ measures to must-pass bills  —  Advocates are sounding the alarm about the high number of attacks against gender-affirming care, marriage protections and discrimination prevention. … House Republicans have embedded at least 45 anti-LGBTQ+ provisions … ",
    "url": "https://19thnews.org/2023/08/house-republicans-anti-lgbtq-measures-federal-spending-bills/"
  },
  {
    "text": "Appeals court halts new Biden rules on debt relief for defrauded students  —  The future of the Biden administration's rules to ease the path to student loan forgiveness for people who were defrauded borrowers by their college or whose schools abruptly close is in doubt.",
    "url": "https://www.washingtonpost.com/education/2023/08/07/student-loan-forgiveness-defrauded-borrowers-court-injunction/"
  },
  {
    "text": "Dwindling Blue Dog Democrats look to stage a comeback for moderates  —  The new leaders of the once-powerful group are working to change its perception and grow their ranks  —  Rep. Jared Golden (D-Maine) has never really been into labels.  —  His liberal colleagues have called … ",
    "url": "https://www.washingtonpost.com/politics/2023/08/08/blue-dog-democrats-congress-new-leaders/"
  }
]