[
  {
    "text": "FEMA official ignores judge's latest order, demands freeze on grant funding  —  Federal workers are being swept into the fight between Donald Trump and federal courts, with four FEMA aides fired Tuesday for being “deep state activists.”  —  WASHINGTON — A senior official … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/fema-official-ignores-judge-order-freeze-grant-funding-rcna191674"
  },
  {
    "text": "Top FEMA Official Is Fired Over Payments for N.Y.C. Migrant Shelters  —  The Trump administration fired the Federal Emergency Management Agency's chief financial officer and three others after Elon Musk misleadingly claimed the agency had used disaster-relief funds for migrant services.",
    "url": "https://www.nytimes.com/2025/02/11/nyregion/fema-fired-nyc-migrant-hotels.html"
  },
  {
    "text": "Trump maintains funding freeze at NIH, defying court order  —  The Trump administration is still prohibiting National Institutes of Health (NIH) staff from issuing virtually all grant funding, an NIH official tells Popular Information.  The ongoing funding freeze is also reflected … ",
    "url": "https://popular.info/p/trump-maintains-funding-freeze-at"
  },
  {
    "text": "The Danger of Trump Disobeying Court Orders [Updated]  —  The new Trump administration may be heading in the direction of disobeying court orders that go against it.  If they do so and get away with it, there are likely to be dire consequences for our constitutional system.",
    "url": "https://reason.com/volokh/2025/02/11/the-danger-of-trump-disobeying-court-orders/"
  },
  {
    "text": "AP statement on Oval Office access  —  The Associated Press issued this statement on Tuesday from Executive Editor Julie Pace:  —  As a global news organization, The Associated Press informs billions of people around the world every day with factual, nonpartisan journalism.",
    "url": "https://www.ap.org/the-definitive-source/announcements/ap-statement-on-oval-office-access/"
  },
  {
    "text": "Live Updates: Musk Asserts Without Proof That He's Fixing a Bureaucracy Rife With Fraud  —  The billionaire, chosen by President Trump to lead a federal overhaul, insisted he was working transparently, but his team's secretive actions have delivered shocks across the government.",
    "url": "https://www.nytimes.com/live/2025/02/11/us/president-trump-news?unlocked_article_code=1.wE4.WfgP.YTN1EGV1bPtM&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Donald Trump Is Delusional  —  AMONG THE REALITY-BASED COMMUNITY—those of us who acknowledge Donald Trump's prodigious history of false statements—there's a longstanding debate.  Some think Trump knows better and is simply lying.  Others think he's sincerely delusional.",
    "url": "https://www.thebulwark.com/p/donald-trump-delusional-fox-news-interview-lies-gaza-tariffs-canada-usaid"
  },
  {
    "text": "Judge orders HHS, CDC and FDA to restore deleted webpages with health information  —  Washington — A federal judge on Tuesday ordered the Department of Health and Human Services, Centers for Disease Control and Prevention and Food and Drug Administration to restore webpages and data … ",
    "url": "https://www.cbsnews.com/news/judge-orders-hhs-cdc-fda-restore-deleted-webpages-health-information/"
  },
  {
    "text": "Senator Accuses F.B.I. Nominee of Covertly Directing Dismissals  —  A top Democrat demanded an investigation and suggested that the nominee, Kash Patel, may have lied under oath, citing what he described as multiple sources.  —  The top Democrat on the Senate Judiciary Committee … ",
    "url": "https://www.nytimes.com/2025/02/11/us/politics/kash-patel-fbi-durbin.html"
  },
  {
    "text": "Russia Releases U.S. Prisoner After Talks With Trump Envoy  —  The Kremlin freed Marc Fogel, a teacher held for more than three years on drug charges, in a deal negotiated by Steve Witkoff, President Trump's Middle East envoy.  —  President Trump on Tuesday secured the release … ",
    "url": "https://www.nytimes.com/2025/02/11/us/politics/russia-releases-us-prisoner-after-talks-with-trump-envoy.html"
  },
  {
    "text": "DOGE teen ran image-sharing site linked to URLs referencing pedophilia and the KKK  —  Edward Coristine, a 19-year-old member of Elon Musk's Department of Government Efficiency (DOGE), launched an image-sharing website in 2021 that featured custom “shitposting” web addresses that redirected to content hosted on his site.",
    "url": "https://www.muskwatch.com/p/doge-teen-ran-image-sharing-site"
  },
  {
    "text": "Elon Musk's Business Empire Scores Benefits Under Trump Shake-Up … Elon Musk controls six companies, including Tesla.  Mr. Musk's companies secured $13 billion in federal contracts over the past five years.Carly Zavala for The New York Times  —  President Trump has been in office less than a month … ",
    "url": "https://www.nytimes.com/2025/02/11/us/politics/elon-musk-companies-conflicts.html?unlocked_article_code=1.wE4.xICu.jhbVQ9KvEjCg&smid=url-share"
  },
  {
    "text": "Hegseth's visit to U.S. base in Germany met with student walkout  —  The civil disobedience by dozens of middle schoolers — and some adults — was aimed at the Trump administration's rollback of DEI initiatives.  —  February 11, 2025  —  Live updates: Trump signs executive order calling on agencies to work with Elon Musk-led group",
    "url": "https://www.washingtonpost.com/national-security/2025/02/11/hegseth-dei-protests-germany/"
  },
  {
    "text": "Defense Secretary Hegseth booed and heckled by military families protesting against DEI push  —  Last week, Hegseth wrote a memo in which he banned transgender people from joining the military and restricted the use of some learning materials in Defense Department schools.",
    "url": "https://www.nbcnews.com/politics/national-security/hegseth-protest-dei-transgender-germany-military-rcna191636"
  },
  {
    "text": "Appeals court rejects Trump administration bid to reinstate funding freeze  —  The 1st U.S. Circuit Court of Appeals denied the Justice Department's request to pause a judge's order while it challenges the order in court.  —  A federal appeals court on Tuesday rejected the Trump administration's bid … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/appeals-court-rejects-trump-administration-bid-reinstate-funding-freez-rcna191671"
  },
  {
    "text": "Pope rebukes Trump administration over migrant deportations, and appears to take direct aim at Vance  —  Pope Francis issued a major rebuke Tuesday to the Trump administration's mass deportation of migrants, warning that the forceful removal of people purely because of their illegal status deprives … ",
    "url": "https://apnews.com/article/pope-trump-migration-09a89091f8e7dc3270099f0947d04e90"
  },
  {
    "text": "Apple Is Renaming Gulf of Mexico to Gulf of America on Maps App  — Change to occur for US users and then roll out globally later  — Move follows Google; Microsoft and MapQuest haven't made shift  —  Apple Inc. is renaming the Gulf of Mexico to Gulf of America on its Maps app … ",
    "url": "https://www.bloomberg.com/news/articles/2025-02-11/apple-is-renaming-gulf-of-mexico-to-gulf-of-america-on-maps-app"
  },
  {
    "text": "President Elon Musk Suddenly Realizes He Might Not Know How to Govern  —  A weekend interaction between Vanity Fair's Molly Jong-Fast and Elon Musk unexpectedly showcased just how little the world's richest man understands about the effects of his slashing spree at the top of the federal government.",
    "url": "https://newrepublic.com/post/191402/president-elon-musk-not-know-cancer-research"
  },
  {
    "text": "Implementing The President's “Department of Government Efficiency” Workforce Optimization Initiative  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:  —  Section 1.  Purpose.",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/02/implementing-the-presidents-department-of-government-efficiency-workforce-optimization-initiative/"
  },
  {
    "text": "Carter introduces bill renaming Greenland  —  WASHINGTON, D.C. - Rep. Earl L.  “Buddy” Carter (R-GA) released the following statement today after introducing a bill authorizing President Trump to acquire Greenland and renaming it Red, White, and Blueland:  —  “America is back and will soon … ",
    "url": "https://buddycarter.house.gov/news/documentsingle.aspx?DocumentID=15398"
  },
  {
    "text": "LETTER OF THE HOLY FATHER FRANCIS TO THE BISHOPS OF THE UNITED STATES OF AMERICA  —  I am writing today to address a few words to you in these delicate moments that you are living as Pastors of the People of God who walk together in the United States of America.",
    "url": "https://www.vatican.va/content/francesco/en/letters/2025/documents/20250210-lettera-vescovi-usa.html"
  },
  {
    "text": "Musk Team Announces Millions in Cuts to Education Dept. Amid Legal Pushback  —  Elon Musk's cost-cutting team said that it had “terminated” 89 of the department's contracts, apparently targeting its research arm.  —  Elon Musk's cost-cutting effort announced a variety of cuts … ",
    "url": "https://www.nytimes.com/2025/02/11/us/politics/musk-doge-education-data.html"
  },
  {
    "text": "Statement from the American Bar Association  —  Lawyers have a professional obligation not to be complicit in undermining democracy. … The ABA Supports the Rule of Law  —  It has been three weeks since Inauguration Day.  Most Americans recognize that newly elected leaders bring change.",
    "url": "https://asharangappa.substack.com/p/statement-from-the-american-bar-association"
  },
  {
    "text": "USAID IG fired day after report critical of impacts of Trump administration's dismantling of the agency  —  The inspector general of the US Agency for International Development was fired on Tuesday, a day after his office released a report critical of the Trump administration's efforts … ",
    "url": "https://www.cnn.com/2025/02/11/politics/usaid-inspector-general-fired-trump/"
  },
  {
    "text": "Google Calendar removes Black History Month, Pride and other cultural events  —  Company says listed holidays were not ‘sustainable’ for their model in latest move to roll back diversity efforts  —  Google's online and mobile calendars are no longer including references to Black History Month … ",
    "url": "https://www.theguardian.com/us-news/2025/feb/11/google-calendar-black-history-pride-month"
  },
  {
    "text": "Trump's Plan Comes Into Focus: Make America Corrupt Again  —  The deal to spring Eric Adams caps a broad effort to functionally legalize bribery and covert foreign influence.  We're all going to pay for it  —  Give Eric Adams some credit: He put his back into this one.",
    "url": "https://www.rollingstone.com/politics/political-commentary/trump-eric-adams-make-america-corrupt-again-1235263142/"
  },
  {
    "text": "Almost $500 million in food is at risk of spoilage after USAID pause, report says  —  Almost $500 million in food aid is at risk of spoilage as it sits in ports, ships and warehouses after funding for the U.S. Agency for International Development, or USAID, was paused by the Trump administration … ",
    "url": "https://www.cbsnews.com/news/usaid-trump-funding-pause-500-million-food-spoilage-risk/?linkId=744832809"
  },
  {
    "text": "The Right to be Woke  —  Two programming notes for today: At 1 p.m. ET today, JVL will go live on the site with Jim Acosta in the first chat for our pop-up series, WTF 2.0.  Jim recently left CNN and has joined the ranks of independent media here on Substack.",
    "url": "https://www.thebulwark.com/p/the-right-to-be-woke"
  },
  {
    "text": "GSA staff facing massive cuts and fears of ‘nonstop’ surveillance  —  The General Services Administration, which manages federal real estate and contracts, plans to slash its budget in half and ramp up monitoring of remaining staff—a model that might soon be deployed across most of the rest of the federal government.",
    "url": "https://www.npr.org/2025/02/11/nx-s1-5293258/trump-gsa-budget-cuts-doge"
  }
]