[
  {
    "text": "Kristi Noem Cries ‘Fake News’ After Disastrous Interview on CBS  —  DOGGED BY SCANDAL  —  The South Dakota governor complained that the host of “Face the Nation” had interrupted her “once every 25 seconds”—something that would never happen to, say, Gretchen Whitmer.",
    "url": "https://www.thedailybeast.com/kristi-noem-cries-fake-news-after-disastrous-interview-on-cbs"
  },
  {
    "text": "Kristi Noem Suggests Biden's Dog Should Have Been Killed, Too  —  The South Dakota governor, defending her tale of shooting and killing her family's dog, suggested that President Biden's German shepherd, Commander, had merited a similar fate.  —  Gov. Kristi Noem of South Dakota … ",
    "url": "https://www.nytimes.com/2024/05/05/us/politics/kristi-noem-biden-dog.html"
  },
  {
    "text": "Scoop: House GOP homes in on Biden as top 2024 punching bag … - In addition to citing Biden's underwater national approval, the memo posits that he is unpopular in evenDemocratic-leaning swing districts.  — “We expect Democrats to wake up and furiously backpedal away from Biden in the fall.",
    "url": "https://www.axios.com/2024/05/06/scoop-house-gop-homes-in-on-biden-as-top-2024-punching-bag"
  },
  {
    "text": "‘If Roe v. Wade can fall, anything can fall,’ says Jeffries in stressing importance of elections  —  House Minority Leader Hakeem Jeffries (D-N.Y.) emphasized the stakes of the 2024 election in a “60 Minutes” interview on Sunday, warning that much more than abortion rights are at risk if former President Trump gets a second term.",
    "url": "https://thehill.com/homenews/campaign/4645264-if-roe-v-wade-can-fall-anything-can-fall-says-jeffries-in-stressing-importance-of-elections/"
  },
  {
    "text": "Who believes the most “taboo” conspiracy theories?  It might not be who you think  —  White men with graduate degrees, a new study finds, are highly likely to hold especially noxious beliefs  —  Like Henry Ford before him, Elon Musk has emerged as America's top conspiracy spreader.  But he's hardly alone.",
    "url": "https://www.salon.com/2024/05/05/believes-the-most-taboo-conspiracy-theories-it-might-not-be-you-think/"
  },
  {
    "text": "It's a tie: Biden 37%-Trump 37% as Hispanic, Black and younger voters shift - Exclusive  —  Susan Page Sudiksha Kochi Rachel BarberUSA TODAY  —  It couldn't be closer.  —  Six months before Election Day, President Joe Biden and former President Donald Trump are tied 37%-37% … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/05/06/biden-trump-tie-hispanic-black-younger-voters/73504174007/"
  },
  {
    "text": "Trump's real-time reviews of 2024 VP possibles and other surrogates … - Sen. Tim Scott (R-S.C.) — “As a candidate he did a good job, but as a surrogate he's unbelievable.”  — Sen. J.D. Vance (R-Ohio) — “He wasn't a supporter of mine at the very beginning... He was saying things … ",
    "url": "https://www.axios.com/2024/05/05/trump-vice-president-audio-mar-a-lago"
  },
  {
    "text": "Biden Races to Trump-Proof His Agenda  —  Trump made unprecedented use of a 1996 law to overturn Obama-era regulations.  Biden's aides hope to stop the Republican from doing it again if he wins.",
    "url": "https://www.wsj.com/politics/policy/biden-races-to-trump-proof-his-agenda-92f38239"
  },
  {
    "text": "Scoop: U.S. put a hold on an ammunition shipment to Israel … - The incident raised serious concerns inside the Israeli government and sent officials scrambling to understand why the shipment was held, Israeli officials said.  — President Biden is facing sharp criticism among Americans who oppose his support of Israel.",
    "url": "https://www.axios.com/2024/05/05/israel-us-ammunition-shipment-hold"
  },
  {
    "text": "The GOP's deep generational split on immigration … - Gen Z Republicans are more likely to support more legal immigration pathways.  — They're more likely to question negative narratives about immigrants than older generations, the survey found.  — They're less likely than Boomer … ",
    "url": "https://www.axios.com/2024/05/05/republicans-immigration-age-gen-z-boomers"
  },
  {
    "text": "RNC chief counsel resigns after two months  —  The Republican National Committee's chief counsel Charlie Spies has resigned two months after accepting the position.  —  Spies' departure follows weeks of growing tension with RNC officials, a source familiar with the situation told CNN.",
    "url": "https://www.cnn.com/2024/05/05/politics/rnc-chief-counsel/"
  },
  {
    "text": "White House: Trump Gestapo comment echoes ‘appalling rhetoric of fascists’  —  The White House on Sunday slammed former President Trump after he compared the Biden administration to the Gestapo police force in Nazi Germany.  —  “Instead of echoing the appalling rhetoric of fascists … ",
    "url": "https://thehill.com/homenews/campaign/4645186-white-house-trump-gestapo-comment-echoes-appalling-rhetoric-of-fascists/"
  },
  {
    "text": "Three soldiers killed in Hamas rocket barrage toward Kerem Shalom, aid crossing closed  —  The rockets were reportedly launched from the Rafah area.  The Kerem Shalom crossing was closed after the attack.  —  Three IDF soldiers were killed and at least three others were seriously wounded … ",
    "url": "https://www.jpost.com/breaking-news/article-799923"
  },
  {
    "text": "Ex-Fulton County prosecutor Nathan Wade speaks out: ‘Workplace romances are as American as apple pie ... it happened to the two of us’  —  Wade conceded he had certain regrets.  —  Fulton County District Attorney Fani Willis speaks at a press conference next to prosecutor Nathan Wade … ",
    "url": "https://abcnews.go.com/US/fulton-county-prosecutor-nathan-wade-speaks-workplace-romances/story?id=109939216"
  },
  {
    "text": "Sen. Tim Scott dodges on whether he would accept 2024 election results  —  The senator, who ran for the Republican nomination for president last year, repeatedly refused to say whether he'd accept this year's presidential election results, regardless of who wins.",
    "url": "https://www.nbcnews.com/politics/2024-election/sen-tim-scott-dodges-whether-accept-2024-election-results-rcna150758"
  }
]