[
  {
    "text": "Trump trade advisor says stock market plunge ‘No big deal’: Live updates … WATCH NOW … CNBC's reporters are covering the tariffs and their effects, live on air and online from our bureaus in Washington; London; Singapore; San Francisco; and Englewood Cliffs, New Jersey.  —  16 MIN AGO",
    "url": "https://www.cnbc.com/2025/04/10/china-trump-tariffs-live-updates.html"
  },
  {
    "text": "Supreme Court says Trump administration must work to bring back mistakenly deported Maryland man  —  The Supreme Court on Thursday said the Trump administration must work to bring back a Maryland man who was mistakenly deported to prison in El Salvador, rejecting the administration's emergency appeal.",
    "url": "https://apnews.com/article/supreme-court-maryland-deportation-trump-9f46dd62890befdc321ed1ab56107470"
  },
  {
    "text": "Supreme Court Sides With Wrongly Deported Migrant  —  A trial judge had ordered the Trump administration to take steps to return the migrant, Kilmar Armando Abrego Garcia, from a notorious prison in El Salvador.  —  The Supreme Court on Thursday instructed the government to take steps … ",
    "url": "https://www.nytimes.com/2025/04/10/us/politics/supreme-court-trump-deported-migrant.html"
  },
  {
    "text": "US Supreme Court tells Trump administration to facilitate return of Salvadoran man deported in error  —  The U.S. Supreme Court directed President Donald Trump's administration on Thursday to facilitate the return to the United States of a Salvadoran man who the government has acknowledged was deported in error to El Salvador.",
    "url": "https://www.reuters.com/legal/us-supreme-court-upholds-order-facilitate-return-deportee-sent-el-salvador-error-2025-04-10/"
  },
  {
    "text": "Breaking: SCOTUS says Trump admin must “facilitate” Kilmar Abrego Garcia's return  —  The U.S. Supreme Court on Thursday evening upheld a district court's order that the Trump administration “facilitate and effectuate” the return of Kilmar Abrego Garcia, the man sent to a prison El Salvador illegally … ",
    "url": "https://www.lawdork.com/p/breaking-scotus-says-trump-admin"
  },
  {
    "text": "Pressuring Migrants to ‘Self-Deport,’ White House Moves to Cancel Social Security Numbers … Migrants who arrived in New York last year waited for shelter assignments at the Roosevelt Hotel.Todd Heisler/The New York Times  —  Since taking office, the Trump administration has moved aggressively … ",
    "url": "https://www.nytimes.com/2025/04/10/us/politics/migrants-deport-social-security-doge.html?unlocked_article_code=1.-k4.T5Nf.m-Dm8UB0A62d&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Social Security classifies thousands of immigrants as dead, as part of Trump crackdown  —  The tactic is aimed at putting pressure on undocumented immigrants to self-deport from the country.  —  just now  —  The Social Security Administration this week entered the names and Social Security numbers … ",
    "url": "https://www.washingtonpost.com/politics/2025/04/10/self-deportation-immigrants-social-security-dead/"
  },
  {
    "text": "Six people have died in a helicopter crash in the Hudson River in New York City, an AP source says  —  A helicopter broke apart in midair and crashed upside-down into the Hudson River between Manhattan and the New Jersey waterfront Thursday, killing all six people aboard in the latest high … ",
    "url": "https://apnews.com/article/new-york-helicopter-crash-e0368ea529659ee1513d92dcbf05a28d"
  },
  {
    "text": "Pilot, family of 5 from Spain killed after helicopter crashes into Hudson River  —  Stream New York's #1 news - Accuweather - original content 24/7  —  JERSEY CITY, New Jersey (WABC) — Six people were killed after a helicopter believed to be carrying a family of tourists from Spain crashed into the Hudson River on Thursday afternoon.",
    "url": "https://abc7ny.com/post/nypd-responding-helicopter-hudson-river/16153664/"
  },
  {
    "text": "Pressed for evidence against Mahmoud Khalil, government cites its power to deport people for beliefs  —  Facing a deadline from an immigration judge to turn over evidence for its attempted deportation of Columbia University activist Mahmoud Khalil, the federal government has instead submitted a brief memo … ",
    "url": "https://apnews.com/article/mahmoud-khalil-columbia-university-trump-c60738368171289ae43177660def8d34"
  },
  {
    "text": "Trump Administration Wants to Install Federal Oversight of Columbia University  —  Government is aiming to legally bind the school to changes as they negotiate over federal funding  —  The Trump administration is planning to pursue a legal arrangement that would put Columbia University … ",
    "url": "https://www.wsj.com/us-news/education/columbia-consent-decree-trump-federal-funding-2f4c4690?st=8cAJuH&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Judge allows requirement that everyone in the US illegally must register to move forward  —  A federal judge is allowing the Trump administration to move forward with a requirement that everyone in the U.S. illegally must register with the federal government, in a move that could have far … ",
    "url": "https://apnews.com/article/illegal-immigration-immigrant-registry-trump-homeland-security-329d9b1523792aaf5940f72948d8b48b"
  },
  {
    "text": "House passes bill that could make it harder for married women to vote  —  Voting rights groups warn that the SAVE Act, which requires documentation proving citizenship, adds a burden to people who have changed their last names.  —  The U.S. House has passed a bill that voting rights groups … ",
    "url": "https://19thnews.org/2025/04/save-act-house-voting/"
  },
  {
    "text": "Gay Venezuelan stylist sent to Salvadoran prison after a disgraced Milwaukee cop's report  —  A disgraced former Milwaukee cop with credibility issues helped seal the fate of a gay Venezuelan makeup artist sent to El Salvador's notorious prison, according to documents reviewed by USA TODAY.",
    "url": "https://eu.jsonline.com/story/news/investigations/2025/04/10/fired-milwaukee-cops-report-helped-send-gay-stylist-to-el-salvador/83023882007/"
  },
  {
    "text": "Space Force Commander in Greenland Sent Out Email Breaking with Vance After His Visit  —  Just days after Vice President JD Vance's March visit to Pituffik Space Base in Greenland, the installation commander sent out an email to the base distancing it from Vance's criticism of Denmark … ",
    "url": "https://www.military.com/daily-news/2025/04/10/space-force-commander-greenland-sent-out-email-breaking-vance-after-his-visit.html"
  },
  {
    "text": "CDC's cruise ship inspectors laid off amid bad year for outbreaks  —  All of the full-time employees in the Centers for Disease Control and Prevention's Vessel Sanitation Program are now off the job, multiple officials tell CBS News, gutting the agency's ability to investigate outbreaks and conduct health inspections on cruise ships.",
    "url": "https://www.cbsnews.com/news/cdc-cruise-ship-inspectors-layoffs-outbreaks-norovirus/"
  },
  {
    "text": "Scoop: Top Senate Dems propose emergency Social Security payment boost  —  Top Senate Democrats plan to unveil legislation that would provide an emergency $200 monthly increase in Social Security benefits through the end of the year, Axios has learned.  —  Why it matters: It's … ",
    "url": "https://www.axios.com/2025/04/10/chuck-schumer-elizabeth-warren-senate-democrats-social-security"
  },
  {
    "text": "Trump directs agencies to quietly repeal regulations — without public notice  —  The memo appears to rely on a misinterpretation of a recent Supreme Court ruling.  —  President Donald Trump has instructed federal agencies and their assigned DOGE teams to repeal any existing regulations … ",
    "url": "https://www.politico.com/news/2025/04/10/federal-agencies-public-notice-comment-trump-administration-00284499"
  },
  {
    "text": "Trump Close to Winning Concessions From More Law Firms  —  Four or five firms could soon agree to deals that would be unveiled as a package, in an escalation of the president's crackdown on an industry that has drawn his ire.  —  President Trump is planning to announce new deals with several … ",
    "url": "https://www.nytimes.com/2025/04/10/us/politics/trump-law-firms.html"
  },
  {
    "text": "Trump Deploys Justice Dept. to Scrutinize Ex-Officials and Perceived Foes  —  A presidential decree instructing the Justice Department to scrutinize whether a former official broke the law crosses a new line.  —  President Trump's first-term efforts to spur law enforcement officials to pursue … ",
    "url": "https://www.nytimes.com/2025/04/10/us/politics/trump-officials-justice-department.html?unlocked_article_code=1.-04.KKE9.o4jHlP9JIcuo&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Democrats, a Cabinet secretary and a DOGE chatbot tee off over another airport close-call  —  A commercial plane carrying several lawmakers bumped wings with another plane at Ronald Reagan Washington National Airport on Thursday, sparking a social media war over funding cuts, runway repairs — and DOGE.",
    "url": "https://www.politico.com/news/2025/04/10/democrats-doge-chatbot-airport-00285391"
  },
  {
    "text": "Surgery?  Yes.  Chainsaw?  No. How not to reform the U.S. government  —  Ready, fire, aim is never a good approach - most especially with matters of national importance.  Yet that is exactly the method Elon Musk's Department of Government Efficiency has taken to cutting waste, duplication, and inefficiencies in the U.S. Government.",
    "url": "https://eu.lubbockonline.com/story/opinion/columns/2025/04/10/ambassador-tibor-nagy-talks-doge-usaid-takeaways-from-2nd-trump-term/83020864007/"
  },
  {
    "text": "Trump moves to legally enforce 2020 election denialism  —  An official from the first Trump administration is being targeted for speaking the truth.  —  Just now  —  After the 2016 election, when it was understood that Russia had tried to influence the outcome, social media companies introduced … ",
    "url": "https://www.washingtonpost.com/opinions/2025/04/10/trump-krebs-election-denialism/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ0MjU3NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ1NjM5OTk5LCJpYXQiOjE3NDQyNTc2MDAsImp0aSI6ImI2YzBkNWU0LWJmNDMtNGE2Mi05OTY2LTJhMTUyZTU0MmNkNSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9vcGluaW9ucy8yMDI1LzA0LzEwL3RydW1wLWtyZWJzLWVsZWN0aW9uLWRlbmlhbGlzbS8ifQ.4hG1VD5bD_GYbn3zj04jLcjyipuaWo_9-3cXhP1lKiI&itid=gfta"
  },
  {
    "text": "In Cabinet Meeting, Musk Seems to Drastically Lower DOGE's Savings Goal  —  Musk said his group was on pace to cut $150 billion from the federal budget in one budget year.  That would be a sharp drop from his previous stated goal of $1 trillion.  —  While stumping for Donald J. Trump during … ",
    "url": "https://www.nytimes.com/2025/04/10/us/politics/musk-doge-drops-goal.html"
  },
  {
    "text": "America's financial system came close to the brink  —  Chaotic markets threatened to trigger a full-blown crisis  —  For a good few hours on April 9th, disaster beckoned.  Share prices had been falling for weeks.  Then the market for American Treasury bonds—normally among the safest assets available—started convulsing, too.",
    "url": "https://www.economist.com/finance-and-economics/2025/04/10/americas-financial-system-came-close-to-the-brink"
  },
  {
    "text": "How Trump 2.0 is slashing NIH-backed research — in charts … - Max Kozlov  —  You can also search for this author in  —  PubMed Google Scholar  — Chris Ryan  —  You can also search for this author in  —  PubMed Google Scholar  —  The US National Institutes of Health (NIH) … ",
    "url": "https://www.nature.com/articles/d41586-025-01099-8"
  },
  {
    "text": "Trump must face Central Park 5 defamation suit, judge rules  —  A federal judge declined to toss a defamation lawsuit against President Trump over his remarks last year about five Black and Hispanic men wrongly convicted of a 1989 rape, dubbed the Central Park Five.",
    "url": "https://thehill.com/regulation/court-battles/5243055-defamation-lawsuit-trump-central-park/"
  },
  {
    "text": "The University in Exile  —  I feel like we are witnessing a charade.  —  Federal agencies have frozen billions of dollars in grants and contracts that had previously been awarded to research universities, on the grounds that the latter have been insufficiently responsive to antisemitic harassment on campus.",
    "url": "https://rajivsethi.substack.com/p/the-university-in-exile"
  }
]