[
  {
    "text": "Behind the Curtain: “Getting shot in the face changes a man” … - He can unify the party. … - He could unify America. … - He could box out Democrats. … - He could show a different side of himself.",
    "url": "https://www.axios.com/2024/07/15/trump-convention-speech-rnc-milwaukee"
  },
  {
    "text": "Multiple things are true about Trump's shooting  —  PN is a reader-supported publication made possible by paid subscribers.  Appreciate our independent journalism?  Then please sign up to support us.  —  ✍️ Subscribe to Public Notice ✍️  —  I picked a hell of a night to log off.",
    "url": "https://www.publicnotice.co/p/trump-shooting-butler-pennsylvania"
  },
  {
    "text": "Grateful, defiant Trump recounts surviving ‘surreal’ assassination attempt at rally: 'I'm supposed to be dead'  —  A grateful and at times defiant Donald Trump told The Post Sunday he's “supposed to be dead” as he recalled the harrowing moment a would-be assassin shot him at a Pennsylvania campaign rally.",
    "url": "https://nypost.com/2024/07/14/us-news/grateful-defiant-trump-recounts-surreal-assassination-attempt-at-rally-im-supposed-to-be-dead/"
  },
  {
    "text": "Trump rewrites Republican convention speech to focus on unity not Biden  —  WORLD EXCLUSIVE — Former President Donald Trump has completely rewritten his convention speech in light of the assassination attempt against him on Saturday and will call on Thursday for a new effort at national unity.",
    "url": "https://www.washingtonexaminer.com/news/campaigns/presidential/3082180/trump-rewrites-republican-convention-speech-focus-unity-not-biden/"
  },
  {
    "text": "‘BlueAnon’ conspiracy theories flood social media after Trump rally shooting  —  Researchers who track online conspiracies say liberals are increasingly vulnerable to — and generating — QAnon-like bursts of misinformation.  —  Minutes after Saturday's shooting at a Trump rally in Butler … ",
    "url": "https://www.washingtonpost.com/technology/2024/07/14/blueanon-conspiracy-theories-trump-rally-shooting/"
  },
  {
    "text": "Trump Allies Try to Bully Dems, Media to Shut Up About His Fascist Plans  —  Republicans are seeking to capitalize on Trump's assassination attempt — using it to demand everyone stop talking about his threats to democracy  —  As Donald Trump recovers from an assassination attempt … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-allies-fascist-plans-dems-media-1235060142/"
  },
  {
    "text": "How not to respond to a political assassination attempt  —  On Saturday, a gunman attempted to assassinate Donald Trump during a political rally.  Trump avoided serious injury, but the gunman killed firefighter Corey Comperatore, who was attending the rally with his family.",
    "url": "https://popular.info/p/how-not-to-respond-to-a-political"
  },
  {
    "text": "Federal judge dismisses Trump classified documents case over concerns with prosecutor's appointment  —  The federal judge presiding over the classified documents case of former President Donald Trump in Florida dismissed the prosecution on Monday, siding with defense lawyers who said the special counsel … ",
    "url": "https://apnews.com/article/trump-classified-documents-smith-c66d5ffb7ba86c1b991f95e89bdeba0c"
  },
  {
    "text": "Judge dismisses classified documents case against Donald Trump  —  A federal judge on Monday dismissed the classified documents case against Donald Trump, a shock ruling that clears away one of the major legal challenges facing the former president.  —  In a 93-page ruling … ",
    "url": "https://www.cnn.com/2024/07/15/politics/classified-documents-case-trump-dismissed-aileen-cannon/"
  },
  {
    "text": "Trump's classified documents case dismissed by Judge Aileen Cannon  —  The Florida judge accepted a long-shot legal argument, embraced by conservatives, that special counsel Jack Smith was improperly appointed.  —  The federal judge overseeing the classified documents charges … ",
    "url": "https://www.washingtonpost.com/national-security/2024/07/15/trump-classified-trial-dismisssed-cannon/"
  },
  {
    "text": "Get a Grip, Democrats.  You Can Still Win This  —  “The presidential contest ended last night,” an unnamed “veteran Democratic political consultant” told NBC News the day after former President Donald Trump was grazed in the ear by an attempted assassin's bullet.",
    "url": "https://washingtonmonthly.com/2024/07/15/get-a-grip-democrats-you-can-still-win-this/"
  },
  {
    "text": "Democrats Need to Wake Up From Their ‘West Wing’ Fantasy  —  Ever since President Biden's debate performance sucked Democratic leaders and political operatives into a looping vortex of panic, people have been debating how we got here and who is responsible.  The president himself?  His handlers?",
    "url": "https://www.nytimes.com/2024/07/15/opinion/democrats-west-wing.html"
  },
  {
    "text": "Trump rally shooting upends Democrats' Biden crisis … - “We're all just focused on expressing condolences ... and keeping our teams safe,” said one House Democrat who has been fiercely critical of Biden.  — A senior House Democrat suggested the post shooting atmosphere in the party is too … ",
    "url": "https://www.axios.com/2024/07/14/house-democrats-biden-trump-rally-shooting"
  },
  {
    "text": "‘Morning Joe’ pulled from air Monday because of Trump shooting  —  New York CNN  —  MSNBC will not air “Morning Joe,” its celebrated politics roundtable program, on Monday, opting to instead air continued breaking news coverage of the attempted assassination of former President Donald Trump.",
    "url": "https://www.cnn.com/2024/07/14/media/msnbc-morning-joe-pulled-trump-assassination/"
  },
  {
    "text": "Why Thomas Matthew Crooks tried to assassinate Donald Trump is a mystery to investigators and his ex-classmates  —  BETHEL PARK, Pa. — In the sea of caps and gowns, Thomas Matthew Crooks hardly stood out.Few people clapped when his name was called.  A YouTube video of his graduation … ",
    "url": "https://www.inquirer.com/news/pennsylvania/thomas-matthew-crooks-trump-shooting-bethel-park-20240714.html"
  },
  {
    "text": "FBI investigating Trump rally shooting as potential domestic terrorism … - Wells confirmed the FBI was investigating the incident as both an “assassination attempt,” and a “potential domestic terrorism act,” according to reporters on the call.  — “Our counterterrorism division … ",
    "url": "https://www.axios.com/2024/07/14/fbi-investigating-trump-rally-shooting-as-potential-domestic-terrorism"
  },
  {
    "text": "Political Violence  —  Reflections from the 1920s and 1930s  —  What to make of the assassination attempt?  —  I am sharing a few thoughts about where we are, based on assassinations during the interwar period, the 1920s and 1930s.  It is distant enough that perhaps we can attend … ",
    "url": "https://snyder.substack.com/p/political-violence"
  },
  {
    "text": "Sen. Marsha Blackburn to deliver primetime speech at RNC  —  U.S. Sen. Marsha Blackburn will have a leading role at the Republican National Convention in Milwaukee this week with a primetime speaking slot.  — Blackburn is scheduled to speak Monday evening.",
    "url": "https://www.axios.com/local/nashville/2024/07/15/marsha-blackburn-speech-rnc"
  }
]