[
  {
    "text": "The Prosecution of Trump May Have Terrible Consequences  —  Mr. Goldsmith served in the George W. Bush administration as an assistant attorney general and as special counsel to the general counsel of the Department of Defense.  —  It may be satisfying now to see Special Counsel Jack Smith … ",
    "url": "https://www.nytimes.com/2023/08/08/opinion/trump-indictment-cost-danger.html"
  },
  {
    "text": "Special counsel still scrutinizing finances of Trump's PAC  —  A week after the newest indictment of the former president, Jack Smith's investigation remains ongoing.  —  Special counsel Jack Smith's probe of efforts by Donald Trump and others to subvert the 2020 election remains ongoing … ",
    "url": "https://www.politico.com/news/2023/08/08/jack-smith-donald-trump-pac-00110279"
  },
  {
    "text": "DeSantis Replaces Campaign Manager with Florida Chief of Staff As He ‘Reloads’ (Exclusive)  —  James Uthmeier has earned the governor's trust as an always-on-offense political fixer, but he has no campaign experience  —  A Facebook icon representing an external link to share the article … ",
    "url": "https://themessenger.com/politics/desantis-new-campaign-manager-exclusive"
  },
  {
    "text": "Is the Ron DeSantis slide reversible?  —  The presidential campaign of Florida Gov. Ron DeSantis announced on Tuesday that it was revamping its leadership team.  While such moves do not always augur a campaign's imminent demise, the demise of political campaigns often follow such shake-ups.",
    "url": "https://www.washingtonpost.com/politics/2023/08/08/desantis-campaign-struggles-trump/"
  },
  {
    "text": "House GOP eyes fall push for Biden impeachment inquiry  —  Speaker Kevin McCarthy has been insistent: House Republicans are still gathering evidence and have yet to decide whether to open up a formal impeachment inquiry against President Joe Biden.  —  “I didn't say I was doing an impeachment inquiry … ",
    "url": "https://www.cnn.com/2023/08/08/politics/house-republicans-impeachment-inquiry-biden/"
  },
  {
    "text": "High turnout, long lines: A look at Ohio's last weekend of early voting on Issue 1  —  Saturday and Sunday were the last days to vote early in-person on Issue 1 and turnout was high across Ohio with lines stretching around buildings in some counties.  —  While many projected low turnout … ",
    "url": "https://www.dispatch.com/story/news/politics/elections/state/2023/08/07/issue-1-early-voting-closes-in-ohio-bringing-high-turnout-ahead-of-aug-8/70512342007/"
  },
  {
    "text": "Roberts and Barrett join liberals as Supreme Court revives federal ghost gun restrictions  —  The Supreme Court on Tuesday agreed to freeze a lower court order that bars the government from regulating so-called ghost guns - untraceable homemade weapons - as firearms under federal law.",
    "url": "https://www.cnn.com/2023/08/08/politics/supreme-court-ghost-guns/"
  },
  {
    "text": "Supreme Court allows Biden ‘ghost gun’ regulations  —  The justices, divided 5-4, allowed rules that seek to regulate gun-making kits in the same way as firearms to remain in effect while litigation continues.  —  WASHINGTON — A divided Supreme Court on Tuesday allowed the Biden administration … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-allows-biden-ghost-gun-regulations-rcna97310"
  },
  {
    "text": "EXCLUSIVE POLL: Trump Holds Big Lead in NH, DeSantis Drops to Tie With Christie  —  When Donald Trump returns to New Hampshire on Tuesday, he will be greeted by a Republican base that is overwhelmingly loyal to the former president.  —  How loyal?  In an exclusive new NHJournal/co-efficient poll … ",
    "url": "https://nhjournal.com/exclusive-poll-trump-holds-big-lead-in-nh-desantis-drops-to-tie-with-christie/"
  },
  {
    "text": "DeSantis' Florida approves classroom videos that compare climate activists to Nazis  —  Florida Gov. Ron DeSantis has already come under fire after the administration formally approved the use of far-right PragerU videos as educational material in K-12 schools, owing to these videos' distorted takes … ",
    "url": "https://www.rawstory.com/prageru-florida-2662923106/"
  },
  {
    "text": "Arizona 2024: Senator Kyrsten Sinema's Independent Candidacy Could Help Democrats for U.S. Senate  —  Home Polls Arizona 2024: Senator Kyrsten Sinema's Independent Candidacy Could Help Democrats for U.S. Senate  —  Trump Pulling Away From GOP Field, Independents Shifting on President Biden",
    "url": "https://emersoncollegepolling.com/arizona-2024-senator-kyrsten-sinemas-independent-candidacy-could-help-democrats-for-u-s-senate/"
  },
  {
    "text": "Trump mocks ‘fat pig’ Chris Christie's weight  —  The former president made fun of the former New Jersey governor and 2024 Republican nomination rival during a speech in New Hampshire.  —  MANCHESTER, N.H. — Former President Donald Trump mocked Chris Christie, one of his rivals … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-mocks-fat-pig-chris-christies-weight-rcna98859"
  },
  {
    "text": "CNN Poll: Abortion's role as an electoral litmus test hasn't faded a year after Supreme Court decision overturning Roe  —  Americans' discontent with the Supreme Court's decision overturning Roe v. Wade remains as potent as it was a year ago, according to a new CNN poll conducted by SSRS … ",
    "url": "https://www.cnn.com/2023/08/08/politics/cnn-poll-abortion-electoral-litmus-test-supreme-court/"
  },
  {
    "text": "Exclusive: Former Coast Guard head covered up secret investigation into sexual assaults at the Coast Guard Academy  —  Tune into AC360 tonight at 8 pm ET for Chief Investigative Correspondent Pamela Brown's report.  —  CNN  —  The then-leader of the US Coast Guard covered … ",
    "url": "https://www.cnn.com/2023/08/08/politics/coast-guard-sexual-assault-coverup-invs/"
  },
  {
    "text": "Why the Montgomery Riverfront Uprising is making Black people so damn happy  —  OPINION: Black people came to the defense of a Black man being beaten by a white mob.  What's not to like?  —  Editor's note: The following article is an op-ed, and the views expressed are the author's own.",
    "url": "https://thegrio.com/2023/08/07/why-the-montgomery-riverfront-uprising-is-making-black-people-so-damn-happy/"
  },
  {
    "text": "Press Release SEC Charges 11 Wall Street Firms with Widespread Recordkeeping Failures  —  Firms admit to wrongdoing and agree to pay penalties totaling $289 million  —  The Securities and Exchange Commission today announced charges against 10 firms in their capacity as broker-dealers … ",
    "url": "https://www.sec.gov/news/press-release/2023-149"
  },
  {
    "text": "The GOP's meticulously laid plans for beating Jon Tester could go up in smoke  —  Rep. Matt Rosendale is moving closer to a Senate run despite some opposition from GOP leaders.  —  Top Republicans went all out to avoid a contentious primary in Montana's Senate race by urging GOP Rep. Matt Rosendale to stay in the House.",
    "url": "https://www.politico.com/news/2023/08/08/conservative-roadblock-to-ousting-tester-00110258"
  },
  {
    "text": "Cops ID and Charge White Antagonists in Wild Alabama Dock Brawl  —  Richard Roberts, Allen Todd and Zachery Shipman will face assault charges for sparking the viral melee.  —  Alabama cops have started cracking down on the agitators who sparked a viral melee on a Montgomery, Alabama … ",
    "url": "https://www.thedailybeast.com/cops-identify-and-charge-white-antagonists-in-montgomery-dock-brawl"
  },
  {
    "text": "Patriot Front Faces Default in Black History Vandalism Case  —  The group defaced a mural of Black tennis star Arthur Ashe.  Neither Patriot Front nor its founder has shown up in court.  —  The white nationalist group Patriot Front and its founder, Thomas Rousseau, are facing default … ",
    "url": "https://www.thedailybeast.com/patriot-front-faces-default-in-black-history-vandalism-case"
  },
  {
    "text": "Florida school board reverses decision nixing access to children's book about a male penguin couple  —  “And Tango Makes Three” recounts the true story of two male penguins who were devoted to each other at the Central Park Zoo in New York.  —  Months after access to a popular children's book … ",
    "url": "https://www.nbcnews.com/nbc-out/out-news/florida-school-board-reverses-decision-nixing-access-childrens-book-ma-rcna98763"
  }
]