[
  {
    "text": "China Hacked Treasury Dept. in ‘Major’ Breach, U.S. Says  —  The department notified lawmakers of the episode, which it said was linked to a state-sponsored actor in China.  —  A state-sponsored actor in China hacked the U.S. Treasury Department, gaining access to the workstations … ",
    "url": "https://www.nytimes.com/2024/12/30/us/politics/china-hack-treasury.html?unlocked_article_code=1.lU4.3ouC.FUER7YzQ1soF&smid=url-share"
  },
  {
    "text": "US Treasury says Chinese hackers stole documents in ‘major incident’  —  Chinese state-sponsored hackers broke into the U.S. Treasury Department earlier this month and stole documents from its workstations, according to a letter to lawmakers that was provided to Reuters on Monday.",
    "url": "https://www.reuters.com/technology/cybersecurity/us-treasurys-workstations-hacked-cyberattack-by-china-afp-reports-2024-12-30/"
  },
  {
    "text": "‘Major incident’: China-backed hackers breached US Treasury workstations  —  The US Treasury Department notified lawmakers on Monday that a China state-sponsored actor infiltrated Treasury workstations in what officials are describing as a “major incident.”  —  In a letter reviewed by CNN … ",
    "url": "https://www.cnn.com/2024/12/30/investing/china-hackers-treasury-workstations"
  },
  {
    "text": "How Elon Musk Has Planted Himself Almost Literally at Trump's Doorstep  —  For much of the period since Election Day, the billionaire has been staying at a $2,000-a-night cottage at Mar-a-Lago, giving him easy access to the president-elect.  —  Elon Musk plays many roles with President-elect Donald J. Trump.",
    "url": "https://www.nytimes.com/2024/12/30/us/politics/elon-musk-trump-mar-a-lago.html?unlocked_article_code=1.lU4.cT51.MJsMNCBUc8Zo&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Trump team orders ‘all intended nominees’ to stop posting on social media ahead of Senate confirmations  —  President-elect Donald Trump's chief of staff Susie Wiles sent a message Sunday ordering nominees to refrain from any posting on social media as Senate confirmation hearings are scheduled to start next week.",
    "url": "https://nypost.com/2024/12/30/us-news/trump-team-orders-all-intended-nominees-to-stop-posting-on-social-media-ahead-of-senate-confirmations/"
  },
  {
    "text": "Trump nominees ordered to stop posting on social media until confirmation: report  —  President-elect Donald Trump's team is instructing all his nominees to stop posting on social media before confirmation, reported the New York Post on Monday.  —  “While this instruction has been delivered previously … ",
    "url": "https://www.rawstory.com/trump-nominees-2670703316/"
  },
  {
    "text": "The MAGA Honeymoon Is Over  —  Silicon Valley and the nativist right worked together to elect Trump.  Now the infighting has begun.  —  Elon Musk spent Christmas Day online, in the thick of a particularly venomous culture war, one that would lead him to later make the un-Christmas-like demand … ",
    "url": "https://www.theatlantic.com/technology/archive/2024/12/elon-musk-maga-fight-h1b/681187/"
  },
  {
    "text": "Biden Exits Battling for His Legacy and Believing He Could Have Won  —  The 82-year-old president is spending his final weeks in office telling war stories—and facing criticism that he inadvertently ushered in a second Trump presidency.  —  The beginning of the end of Joe Biden's political life was off to a very slow start.",
    "url": "https://www.wsj.com/politics/elections/biden-legacy-age-election-572836be"
  },
  {
    "text": "Biden moves to bar oil, gas and geothermal development in a Nevada mountain range for 20 years  —  President Joe Biden's administration said Monday it is taking steps to bar oil, gas and geothermal development for 20 years in northeastern Nevada's Ruby Mountains.",
    "url": "https://apnews.com/article/nevada-ruby-mountains-oil-gas-development-503e0a2576ec5455d5c586df087f0c6a"
  },
  {
    "text": "United States Files Complaint Against Dave Inc. and CEO Jason Wilk Alleging Deceptive Practices in Violation of Federal Law  —  For Immediate Release  —  The Justice Department, together with the Federal Trade Commission (FTC), today announced a civil enforcement action against Dave Inc. … ",
    "url": "https://www.justice.gov/opa/pr/united-states-files-complaint-against-dave-inc-and-ceo-jason-wilk-alleging-deceptive"
  },
  {
    "text": "Trump Loses Appeal of Carroll's $5 Million Award in Sex-Abuse Case  —  The president-elect had asked a court to overturn the defamation judgment against him in the case, which centered on E. Jean Carroll's account of a sexual attack in a dressing room.  —  President-elect Donald J. Trump … ",
    "url": "https://www.nytimes.com/2024/12/30/nyregion/trump-carroll-appeal-denied.html?unlocked_article_code=1.lU4.yYYG.LxYNWlbTnumD&smid=url-share"
  },
  {
    "text": "Senator's son sentenced to 28 years for killing a North Dakota deputy during a car chase  —  The adult son of North Dakota Sen. Kevin Cramer was sentenced to serve 28 years in prison Monday in connection with a wild chase in which he fled from a hospital and drove into a deputy's vehicle, killing the deputy.",
    "url": "https://apnews.com/article/kevin-cramer-son-deputy-killed-chase-sentence-5f194f28c7df939cfdb666161e26e05c"
  },
  {
    "text": "UnitedHealth's Army of Doctors Helped It Collect Billions More From Medicare  —  The biggest Medicare Advantage insurer presented physicians with checklists of potential diagnoses; 'I didn't think I was obese'",
    "url": "https://www.wsj.com/health/healthcare/unitedhealth-medicare-payments-doctors-c2a343db"
  },
  {
    "text": "House Ethics Committee closes investigations into 4 members  —  The House Ethics Committee closed investigations into at least four members Monday for violating campaign finance rules.  The investigations involved Reps. Sanford Bishop (D-Ga.), Wesley Hunt (R-Tex.), Ronny Jackson (R-Tex.) … ",
    "url": "https://www.politico.com/live-updates/2024/12/30/congress/house-ethics-closes-investigations-00196146"
  },
  {
    "text": "Carter was the first president to move the needle, albeit slowly, on gay rights  —  Jimmy Carter, who died Sunday at age 100, stood out for his early support for pro-gay legislation and his embrace of LGBTQ advocates, historians say.  —  When Jimmy Carter was president from 1977 to 1981 … ",
    "url": "https://www.nbcnews.com/news/amp/rcna93119"
  },
  {
    "text": "Texas Gov. Greg Abbott mistakenly sends condolences to late Rosalynn Carter after Jimmy Carter's passing  —  Abbott sent condolences to the Carter family, and specifically extended prayers to Rosalynn Carter, who died in 2023.  —  AUSTIN, Texas — After former president Jimmy Carter died at 100 years old … ",
    "url": "https://www.wfaa.com/article/news/local/texas/texas-gov-greg-abbott-sends-condolences-late-first-lady-rosalynn-carter-after-jimmy-carter-death/287-3098b3ec-6ce2-4d8f-92b3-7f3960331e03"
  },
  {
    "text": "Whitehouse calls for ‘war machine’ to spar against GOP as DNC chair election looms  —  Rhode Island Sen. Sheldon Whitehouse is calling for DNC delegates to consider how the Democratic Party's infrastructure can support a “war machine” to lead attacks against Republicans.",
    "url": "https://www.politico.com/live-updates/2024/12/30/congress/whitehouses-dnc-plans-chair-election-00196137"
  },
  {
    "text": "In a war between tech bros and core MAGA, the winner is easy to spot  —  They are a selfish bunch who have shown time and again that what interests them most is themselves.  —  The spiteful bickering in recent days between Donald Trump's Silicon Valley enablers and his MAGA acolytes … ",
    "url": "https://www.washingtonpost.com/opinions/2024/12/30/musk-loomer-h1b-visas-trump-bannon/"
  },
  {
    "text": "Pentagon Appeals Court Upholds Plea Deals in Sept. 11 Case  —  The three-judge decision appeared, at least for now, to put plea proceedings for Khalid Shaikh Mohammed and two others back on track to take place in early January at Guantánamo Bay.  —  A Pentagon appeals panel … ",
    "url": "https://www.nytimes.com/2024/12/30/us/politics/911-case-plea-deals.html"
  }
]