[
  {
    "text": "Trump's free plane is not so free  —  The Boeing aircraft that Qatar may give the president would require a pricy and complicated overhaul to serve as Air Force One.  —  President Donald Trump insists he's getting a “free, very expensive airplane” from Qatar's royal family.",
    "url": "https://www.politico.com/news/2025/05/12/trump-qatar-air-force-one-taxpayer-costs-00342299"
  },
  {
    "text": "Donald Trump's Corruption Reaches New Heights  —  On Sunday, ABC News reported that President Donald Trump plans to accept a $400 million “flying palace” from the royal family of Qatar.  The deal, it appears, is that the super-luxury Boeing 747-8 jumbo jet will become the new Air Force … ",
    "url": "https://slate.com/news-and-politics/2025/05/qatar-air-force-one-scandal-trumps-corruption.html"
  },
  {
    "text": "Trump's Plan to Accept Luxury Jet From Qatar Strains Bounds of Propriety  —  The second Trump administration is blowing through limits on the mixing of public office and personal benefits.  —  During President Trump's first term, the idea that special interests and governments were buying meals … ",
    "url": "https://www.nytimes.com/2025/05/12/us/trump-qatar-jet-plane.html"
  },
  {
    "text": "Trump's gifted Qatari 747 would be a security problem, officials say  —  The luxury jet was moved five weeks ago to San Antonio International Airport, suggesting that preparations for improvements to the plane might already be underway.  —  President Donald Trump on Monday praised Qatar … ",
    "url": "https://www.washingtonpost.com/national-security/2025/05/12/trump-qatar-747-gift-security/"
  },
  {
    "text": "Trump is the most corrupt President in U.S. history.  Period.  —  There must be corrupt dictators in other countries jealous of Donald Trump.  After all, in just three months, Trump has turned the American presidency into a corrupt enterprise that has made himself—and his family—literally billions of dollars.",
    "url": "https://deanobeidallah.substack.com/p/trump-is-the-most-corrupt-president"
  },
  {
    "text": "Corruption and a Security Catastrophe in Plane Sight  —  Of course a foreign government would love to give the US president a plane....  I will admit that as a presidential historian and national security nerd one of my first thoughts last November after Donald Trump won office was, “Ugh” … ",
    "url": "https://www.doomsdayscenario.co/p/corruption-and-a-security-catastrophe-in-plane-sight-c5cd67a113caf678"
  },
  {
    "text": "Hill leaders question Trump's attempted Library of Congress takeover  —  Top congressional leaders are pushing back against President Donald Trump's attempt to replace to Library of Congress leaders, with the dispute over presidential powers over the institution leaving its future in question Monday.",
    "url": "https://www.politico.com/live-updates/2025/05/12/congress/donald-trump-library-of-congress-fight-00342326"
  },
  {
    "text": "Despite China trade deal, Trump maintains 120% tariff on cheap goods  —  Small packages from China are still subject to tariffs of 120%, a White House official confirmed Monday — a major blow for U.S. consumers seeking cheap goods from e-commerce retailers like Shein and Temu.",
    "url": "https://www.axios.com/2025/05/12/china-trade-deal-shein-temu-trump"
  },
  {
    "text": "Episcopal Church refuses to resettle white Afrikaners, ends partnership with US government  —  (RNS) — In a striking move that ends a nearly four-decades-old relationship between the federal government and the Episcopal Church, the denomination announced on Monday (May 12) … ",
    "url": "https://religionnews.com/2025/05/12/episcopal-church-ends-refugee-resettlement-citing-moral-opposition-to-resettling-white-afrikaners/"
  },
  {
    "text": "Letter from Presiding Bishop Sean Rowe on Episcopal Migration Ministries  —  Office of Public Affairs  —  English  —  Dear People of God in The Episcopal Church:  —  I am writing today with some significant news about Episcopal Migration Ministries, the organization that leads The Episcopal Church's refugee resettlement ministry.",
    "url": "https://www.episcopalchurch.org/publicaffairs/letter-from-presiding-bishop-sean-rowe-on-episcopal-migration-ministries/"
  },
  {
    "text": "Delivering Most-Favored-Nation Prescription Drug Pricing to American Patients  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:  —  Section 1.  Purpose.  The United States has less than five percent … ",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/05/delivering-most-favored-nation-prescription-drug-pricing-to-american-patients/"
  },
  {
    "text": "Trump Signs Executive Order Asking Companies to Lower Drug Prices  —  The president has long complained that the United States pays more for medicines than other wealthy countries.  But he offered no clear legal authority to mandate lower prices.  —  President Trump on Monday signed … ",
    "url": "https://www.nytimes.com/2025/05/12/health/trump-drug-prices.html"
  },
  {
    "text": "RFK Jr. Swims in Washington Creek That Flows With Sewage and Bacteria  —  Robert F. Kennedy Jr., the health secretary, shared photos of himself and his grandchildren swimming in waters that handle sewer overflow.  —  Robert F. Kennedy Jr., the health secretary, posted photos on Sunday … ",
    "url": "https://www.nytimes.com/2025/05/12/us/politics/rfk-jr-rock-creek-bacteria.html"
  },
  {
    "text": "Republicans Try to Cram Ban on AI Regulation Into Budget Reconciliation Bill  —  Republicans try to use the Budget Reconciliation bill to stop states from regulating AI entirely for 10 years.  —  Late last night, House Republicans introduced new language to the Budget Reconciliation bill … ",
    "url": "https://www.404media.co/republicans-try-to-cram-ban-on-ai-regulation-into-budget-reconciliation-bill/"
  },
  {
    "text": "Air Traffic Staffing Shortage Forces Delays at Newark Airport  —  The shortage on Monday forced the F.A.A. to delay flights to the busy airport for up to nearly seven hours, the latest problem to plague the airport.  —  As few as three air traffic controllers were scheduled to work … ",
    "url": "https://www.nytimes.com/2025/05/12/business/newark-airport-delays-staffing-shortage.html"
  },
  {
    "text": "Rule of law is ‘endangered,’ chief justice says  —  Speaking at Georgetown Law, Chief Justice John Roberts denounced “ad hominem” criticism of the justices.  —  Chief Justice John Roberts described the rule of law as “endangered” and warned against “trashing the justices,” … ",
    "url": "https://www.politico.com/news/2025/05/12/chief-justice-roberts-speech-georgetown-00343406"
  },
  {
    "text": "Why Trump Suddenly Declared Victory Over the Houthi Militia … President Trump has never bought into long-running military entanglements in the Middle East.Haiyun Jiang for The New York Times  —  When he approved a campaign to reopen shipping in the Red Sea by bombing the Houthi militant group … ",
    "url": "https://www.nytimes.com/2025/05/12/us/politics/trump-houthis-bombing.html"
  },
  {
    "text": "A VIP Seat at Donald Trump's Crypto Dinner Cost at Least $2 Million  —  The largest holders of Donald Trump's memecoin have secured spots at a private event with the US president himself.  WIRED tracked how they did it.  —  Ten days from now, 220 crypto investors will sit … ",
    "url": "https://www.wired.com/story/trumpcoin-dinner-ticket-bidding/"
  },
  {
    "text": "DHS terminates temporary protected status program for Afghans  —  The move follows the Trump administration's decision last month to not renew such protections for Afghans residing in the U.S.  —  Secretary of Homeland Security Kristi Noem announced on Monday that the U.S. will terminate … ",
    "url": "https://www.politico.com/news/2025/05/12/temporary-protected-status-afghans-00342250"
  },
  {
    "text": "Hasan Piker detained at the border and questioned for hours over politics  —  “They straight up tried to get something out of me that I think they could use to basically detain me permanently” … Hasan Piker, the biggest progressive political streamer in America, was detained by Customs … ",
    "url": "https://www.usermag.co/p/hasan-piker-detained-at-the-border-and-questioned-for-hours-over-politics-trump-immigration"
  },
  {
    "text": "Republicans Target Federal Anti-Hunger Program as They Prepare Trump Tax Package  —  Limiting funding for SNAP could help defray the costs of President Trump's tax plans, but could result in millions of low-income families losing access to aid.  —  House Republicans on Monday proposed … ",
    "url": "https://www.nytimes.com/2025/05/12/us/politics/trump-taxes-snap-program.html"
  },
  {
    "text": "Avelo Airlines Faces Backlash for Aiding Trump's Deportation Campaign  —  The company, which serves airports in liberal cities on the coasts, has agreed to operate chartered flights for Immigration and Customs Enforcement.  —  In the four years since its first flight, Avelo Airlines … ",
    "url": "https://www.nytimes.com/2025/05/12/business/trump-deportation-flights-avelo-airlines.html"
  }
]