[
  {
    "text": "Trump Allies Plan New Sweeping Abortion Restrictions  —  His supporters are seeking to attack abortion rights and abortion access from a variety of angles should he regain the White House, including using a long-dormant law from 1873.  —  Allies of former President Donald J. Trump and officials … ",
    "url": "https://www.nytimes.com/2024/02/17/us/politics/trump-allies-abortion-restrictions.html"
  },
  {
    "text": "Can Trump pay?  What if he doesn't?  Here's what to know about Trump's massive civil judgments.  —  He's now on the hook for nearly a half-billion dollars across three civil cases.  These are the rules for when and how he must pay.  —  NEW YORK — A seven-figure verdict, an eight-figure verdict and, now, a nine-figure verdict.",
    "url": "https://www.politico.com/news/2024/02/16/trump-civil-judgments-what-to-know-00142034"
  },
  {
    "text": "How to Make Trump's Fraud Verdict Matter to Voters  —  The verdict in the civil fraud case should cost Trump more than money.  —  Yesterday, a New York City judge fined Donald Trump more than $350 million for falsely inflating the value of assets to secure better terms from lenders and insurers.",
    "url": "https://www.messageboxnews.com/p/how-to-make-trumps-fraud-verdict"
  },
  {
    "text": "Trump's hubris has brought about the downfall of his family's business empire  —  Even the giant fortune Trump inherited from his father did not stop him from steering the family's dynasty on to the rocks  —  Judge Arthur Engoron's ruling on Friday concludes the nearly century-long history … ",
    "url": "https://www.theguardian.com/commentisfree/2024/feb/17/trump-hubris-family-empire-new-york"
  },
  {
    "text": "Asa Hutchinson: RNC leader should have to pledge not to pay Trump legal fees  —  Former Gov. Asa Hutchinson (R-Ark.) argued that the leader of the Republican National Committee (RNC) should pledge not to pay former President Trump's legal fees, as concerns rise over how the former president will fund his mounting bills.",
    "url": "https://thehill.com/regulation/court-battles/4474535-asa-hutchinson-rnc-should-pledge-not-to-pay-trump-legal-fees/"
  },
  {
    "text": "George Santos Sues Jimmy Kimmel for Pranking Him on Cameo  —  The Republican fraudster wants at least $750,000 in damages.  —  “Put up or shut up,” former congressman George Santos likes to tell his haters.  Now, he's adding late night host Jimmy Kimmel to that list.",
    "url": "https://www.thedailybeast.com/george-santos-sues-jimmy-kimmel-for-pranking-him-on-cameo"
  },
  {
    "text": "Lyin' expelled ex-Rep. George Santos makes Jimmy Kimmel's ‘wishes come true’ by suing host over misusing Cameo clips  —  This is no laughing matter.  —  Expelled ex-Rep. George Santos is suing television host Jimmy Kimmel for allegedly misusing his Cameo clips on his show, The Post has learned.",
    "url": "https://nypost.com/2024/02/17/us-news/lyin-expelled-ex-rep-george-santos-makes-jimmy-kimmels-wishes-come-true-by-suing-host-over-misusing-cameo-clips/"
  },
  {
    "text": "Haley presses Trump to call out Putin amid silence after Navalny death  —  GOP presidential candidate Nikki Haley pressed former President Trump to call out Russian President Vladimir Putin in the wake of opposition leader Alexei Navalny's death, while arguing that his silence is “a problem.”",
    "url": "https://thehill.com/homenews/campaign/4474409-haley-trump-putin-navalny-death-silence/"
  },
  {
    "text": "Justice Department Transfers Approximately $500,000 in Forfeited Russian Funds to Estonia for Benefit of Ukraine  —  For Immediate Release  —  Estonia to Support Ukraine Using Funds Forfeited by United States After Interception of Sophisticated Military-Grade Machinery Bound for Russia; Defendant in Scheme Separately Pleads Guilty",
    "url": "https://www.justice.gov/opa/pr/justice-department-transfers-approximately-500000-forfeited-russian-funds-estonia-benefit"
  },
  {
    "text": "National security experts criticize Biden's handling of classified documents  —  The disclosure that Biden told his ghostwriter he discovered classified documents in his Virginia home in 2017 but did not return them troubles some national security experts.  —  The controversy … ",
    "url": "https://www.nbcnews.com/politics/justice-department/national-security-experts-criticize-bidens-handling-classified-documen-rcna138689"
  },
  {
    "text": "Biden Administration Is Said to Slow Early Stage of Shift to Electric Cars  —  The change to planned rules was an election-year concession to labor unions and auto executives, according to people familiar with the plan.  —  In a concession to automakers and labor unions … ",
    "url": "https://www.nytimes.com/2024/02/17/climate/biden-epa-auto-emissions.html"
  },
  {
    "text": "Raise your privileged hand if you're willing to ‘fight to the last Ukrainian’  —  Hey, what's a million-plus dead and wounded when you live thousands of miles away in a bubble of arrogant privilege?  —  In August 2023, U.S. officials estimated that approximately 500,000 Russian and Ukrainian troops … ",
    "url": "https://thehill.com/opinion/national-security/4473663-raise-your-privileged-hand-if-youre-willing-to-fight-to-the-last-ukrainian/"
  },
  {
    "text": "‘All Hell Broke Loose’: How Congress Blabbed About Russia's Space Nukes  —  On Tuesday night, Rep. Mike Turner, the chair of the House Permanent Select Committee on Intelligence, showed Rep. Jim Himes, the committee's ranking Democrat, a short statement that he wanted to release.",
    "url": "https://www.politico.com/news/magazine/2024/02/17/congress-russia-intelligence-space-nuclear-weapons-00142026"
  },
  {
    "text": "‘Star witness’ mostly silent in hearing to disqualify Fani Willis  —  ATLANTA — A man billed as the “star witness” in the case to disqualify Fulton County District Attorney Fani T. Willis (D) took the stand Friday and acknowledged he exchanged text messages about Willis with the defense attorney … ",
    "url": "https://www.washingtonpost.com/national-security/2024/02/16/fani-willis-hearing-terrence-bradley-trump-georgia/"
  },
  {
    "text": "Jimmy Carter's Long Goodbye  —  The former president is on the verge of having spent a year in hospice care, once again confounding expectations in a life that has lasted nearly a century.  —  Practically no one ever thought he would be elected president in the first place.",
    "url": "https://www.nytimes.com/2024/02/17/us/politics/jimmy-carter-hospice-anniversary.html"
  }
]