[
  {
    "text": "Texas Officials Slam Trump's National Weather Service for Bad Forecast  —  BLAME GAME  —  The government weather forecaster has been hit with huge cuts by the president's administration.  —  Officials in Texas are casting blame on the National Weather Service (NWS) for failing … ",
    "url": "https://www.thedailybeast.com/texas-officials-slam-donald-trumps-national-weather-service-for-bad-forecast/"
  },
  {
    "text": "Texas flooding latest: 43 dead, including 15 children, as search for some two dozen girls continues - as it happened  —  Girls from Camp Mystic, a Christian summer camp along the Guadalupe River, are still missing, says city manager.  This blog is now closed.  —  Closing summary",
    "url": "https://www.theguardian.com/us-news/live/2025/jul/05/texas-flooding-latest-news-updates-guadalupe-river-flood-camp-mystic"
  },
  {
    "text": "In Texas region prone to catastrophic floods, questions grow about lack of warning  —  Water rose fast along the Guadalupe River, causing more than two dozen deaths.  Local officials said they couldn't have seen it coming.  —  The forecast began to look ominous in Texas Hill County on Thursday afternoon.",
    "url": "https://www.texastribune.org/2025/07/05/texas-hill-country-floods-warning-forecast-nws/"
  },
  {
    "text": "Here's a timeline of the catastrophic Texas floods  —  In the early hours of Friday, floods swept across Texas Hill Country.  The Guadalupe River rose 26 feet within 45 minutes, according to state officials.  —  The flooding killed at least 14 children and 18 adults, officials said at a press conference on Saturday afternoon.",
    "url": "https://www.npr.org/2025/07/05/nx-s1-5457759/texas-floods-timeline"
  },
  {
    "text": "Meteorologists Say the National Weather Service Did Its Job in Texas  —  DOGE cut hundreds of jobs at the NWS, but experts who spoke to WIRED say the agency accurately predicted the state's weekend flood risk.  —  At least 27 people, including nine children, are dead in central Texas … ",
    "url": "https://www.wired.com/story/meteorologists-say-the-national-weather-service-did-its-job-in-texas/"
  },
  {
    "text": "Musk says ‘America Party’ is formed in US  —  A day after asking his followers on X whether a new U.S. political party should be created, Elon Musk said on Saturday that the “America Party is formed.”  —  “By a factor of 2 to 1, you want a new political party and you shall have it!” he said in a post on X.",
    "url": "https://www.reuters.com/world/us/musk-says-america-party-is-formed-us-2025-07-05/"
  },
  {
    "text": "Elon Musk Says He Will Start a New Political Party  —  The tech billionaire, who has publicly feuded with President Trump, wrote on social media that he would be creating “the America Party,” though he hadn't yet filed paperwork.  —  Elon Musk, the world's wealthiest person … ",
    "url": "https://www.nytimes.com/2025/07/05/us/politics/elon-musk-third-party.html"
  },
  {
    "text": "Musk announces arrival of new ‘America Party’ after Trump split … “By a factor of 2 to 1, you want a new political party and you shall have it!  When it comes to bankrupting our country with waste & graft, we live in a one-party system, not a democracy,” he wrote.",
    "url": "https://www.politico.com/news/2025/07/05/elon-musk-third-party-00440033"
  },
  {
    "text": "Trump administration deports 8 migrants to South Sudan  —  The migrants were the subject of a lawsuit that halted their deportation.  —  In this Dec. 21, 2024, file photo, an aerial view of Djibouti, East Africa is shown.  —  The Trump administration deported eight migrants to South Sudan … ",
    "url": "https://abcnews.go.com/US/trump-administration-deports-8-migrants-south-sudan/story?id=123499255"
  },
  {
    "text": "Trump Admin Insider Blows Lid Off Tariffs: 'It's All Fake'  —  MADE FOR TV  —  A source close to the MAGA administration suggested the president's “deals” are all theatrics.  —  A source deeply embedded in the Trump administration's ongoing trade talks accused the Republican president of waging a tariff war for TV ratings.",
    "url": "https://www.thedailybeast.com/trump-admin-insider-blows-lid-off-tariffs-its-all-fake/"
  },
  {
    "text": "Joe Rogan Feels Trump Betrayed Him on Immigration  —  The podcast king, once a prominent supporter of Donald Trump, denounced the president's aggressive deportation tactics on his wildly popular podcast. … Joe Rogan, one of the most influential voices in American media, is turning on Donald Trump.",
    "url": "https://gizmodo.com/joe-rogan-feels-trump-betrayed-him-on-immigration-2000624426"
  },
  {
    "text": "Don't call it ‘Alligator Alcatraz.’ Call it a concentration camp.  —  This facility's purpose fits the classic model, and its existence points to serious dangers ahead for the country.  —  By Andrea Pitzer, author of “One Long Night: A Global History of Concentration Camps”",
    "url": "https://www.msnbc.com/opinion/msnbc-opinion/immigration-alligator-alcatraz-concentration-camp-rcna216874"
  },
  {
    "text": "The Supreme Court's timing couldn't be worse  —  Concentration camps are often compared to prisons, but that comparison is inaccurate.  In the United States, inmates arrive in penitentiaries only after they have been convicted of serious crimes, under criminal processes constrained by the US Constitution at all times.",
    "url": "https://www.alternet.org/roberts-trump/"
  },
  {
    "text": "Critical Read About the BBB, Federalism and the Future of American Democracy … TPM Reader TS (Harvard sociologist/political scientist Theda Skocpol) and I often compared notes on the news of the day and I am always particularly attentive to her thoughts on state structure and power.",
    "url": "https://talkingpointsmemo.com/edblog/critical-read-about-the-bbb-federalism-and-the-future-of-american-democracy"
  },
  {
    "text": "6-year-old Honduran boy with leukemia who had been seized by ICE is back in L.A.  —  The boy was arrested by Immigration and Customs Enforcement along with his mother and sister after an asylum hearing in May.  —  A 6-year-old Honduran boy with leukemia whose arrest sparked a public outcry after he … ",
    "url": "https://www.nbcnews.com/news/us-news/ice-releases-honduran-boy-leukemia-immigration-rcna216951"
  },
  {
    "text": "Tesla robotaxi incidents spark confusion and concerns in Austin  —  Two weeks into Tesla's invite-only ride-hailing service, CEO Elon Musk's die-hard fans are amazed, but it's not clear anyone else is.  —  Two weeks into Tesla's robotaxi prototype rollout on the streets of Austin, Texas … ",
    "url": "https://www.nbcnews.com/tech/innovation/tesla-robotaxi-incidents-spark-confusion-concerns-austin-rcna215909"
  },
  {
    "text": "Trump's Politicized F.B.I. Has Made Americans Less Safe  —  Only 11 days after President Trump was inaugurated for a second term, his administration began a purge of the F.B.I. that now threatens some of the bureau's most important missions.  His appointees ousted eight of its most experienced managers … ",
    "url": "https://www.nytimes.com/2025/07/05/opinion/trump-fbi-politics-safety.html?unlocked_article_code=1.UE8.Yfuj.CKxvuUSBwEgg&smid=url-share"
  },
  {
    "text": "Kamala Harris Sparks MAGA Meltdown With Fourth of July Post  —  FIREWORKS  —  President Donald Trump's supporters took the former vice president's holiday sentiments as a sign she'd be looking to run for office again.  —  Former Vice President Kamala Harris sent MAGA into a frenzy with her simple Fourth of July message.",
    "url": "https://www.thedailybeast.com/kamala-harris-sparks-maga-meltdown-with-fourth-of-july-post/"
  },
  {
    "text": "RFK's proposal to let bird flu spread through poultry could set us up for a pandemic, experts warn  —  HHS Secretary Robert F. Kennedy Jr. and Secretary of Agriculture Brooke Rollins have expressed interest in letting H5N1 outbreaks spread unchecked through U.S. poultry farms.",
    "url": "https://www.livescience.com/health/flu/rfks-proposal-to-let-bird-flu-spread-through-poultry-could-set-us-up-for-a-pandemic-experts-warn"
  },
  {
    "text": "What Trump—And the U.S.—Can't Understand About Air Strikes  —  American leaders refuse to learn from allies and overestimate the benefits of showy tactical attacks.  —  When Donald Trump ordered air strikes on key Iranian nuclear-enrichment sites last month and immediately declared … ",
    "url": "https://www.theatlantic.com/ideas/archive/2025/07/trump-iran-air-strikes/683428/?gift=BQHDq1p24LRO8cUUEyLQ6xjgX9LTp4pLeixFVIVpsTo"
  },
  {
    "text": "The next megabill Congress needs to worry about … It's not escaping the notice of Democrats.  House Minority Leader Hakeem Jeffries spent much of his marathon floor speech before the vote Thursday calling out GOP moderates in battleground seats, many of whom had swallowed their misgivings … ",
    "url": "https://www.politico.com/news/2025/07/05/gop-megabill-cliffs-tax-cuts-medicaid-00439973"
  },
  {
    "text": "Rep. Mark Green resigns from Congress, leaving Speaker Johnson with an even narrower Republican majority in the House … Rep. Mark Green, R-Tenn., announced his official resignation from Congress on Friday, a move that was expected but one that could, at least for now, shrink Republicans' already narrow majority in the House.",
    "url": "https://www.cnbc.com/2025/07/05/rep-mark-green-announces-resignation.html"
  },
  {
    "text": "‘The vehicle suddenly accelerated with our baby in it’: the terrifying truth about why Tesla's cars keep crashing  —  Elon Musk is obsessive about the design of his supercars, right down to the disappearing door handles.  But a series of shocking incidents - from drivers trapped in burning vehicles … ",
    "url": "https://www.theguardian.com/technology/2025/jul/05/the-vehicle-suddenly-accelerated-with-our-baby-in-it-the-terrifying-truth-about-why-teslas-cars-keep-crashing"
  }
]