[
  {
    "text": "Trump Ordered to Pay $355 Million and Barred From New York Business  —  The ruling in Donald J. Trump's civil fraud case could cost him all his available cash.  The judge said that the former president's “complete lack of contrition” bordered on pathological.",
    "url": "https://www.nytimes.com/2024/02/16/nyregion/trump-civil-fraud-trial-ruling.html"
  },
  {
    "text": "Trump is suddenly in need of a lot of cash.  That's everyone's problem.  —  The former president was just ordered to pay $355 million in his New York fraud case, bringing the tally this year to nearly half a billion dollars in civil damages.  —  Two recent verdicts have now left Donald Trump … ",
    "url": "https://www.vox.com/24073920/trump-financial-new-york-trouble-fraud-e-jean-carroll-civil-suit-damages-debt"
  },
  {
    "text": "Trump Privately Expresses Support for a 16-Week Abortion Ban  —  In supporting a 16-week ban with exceptions, Donald Trump appears to be trying to satisfy social conservatives who want to further restrict abortion access and voters who want more modest limits.",
    "url": "https://www.nytimes.com/2024/02/16/us/politics/trump-abortion-ban.html"
  },
  {
    "text": "Donald Trump ordered to pay over $350m in New York financial fraud case  —  Trump also banned from running any New York corporation or entity for three years in devastating blow for ex-president  —  Donald Trump, his eldest sons and associates have been ordered to pay over $350m by a New York judge … ",
    "url": "https://www.theguardian.com/us-news/2024/feb/16/donald-trump-financial-fraud-case"
  },
  {
    "text": "Trump and His Family Are Fined $355 Million for Fraud—and a Lack of Remorse That “Borders on Pathological”  —  The ruling, if upheld, marks the end of the Trump Organization as we know it.  —  New York Supreme Court Justice Arthur Engoron ordered Donald Trump to pay $355 million in fines … ",
    "url": "https://slate.com/news-and-politics/2024/02/donald-trump-civil-fraud-355-million-new-york-restrictions-trump-organization.html"
  },
  {
    "text": "Trump's legal debts top a half-billion dollars.  Will he have to pay?  —  NEW YORK (AP) — Donald Trump's legal debts might now exceed a half-billion dollars.  —  A New York judge ordered Trump and his companies Friday to pay $355 million in fines, plus interest, after ruling that he had manipulated … ",
    "url": "https://apnews.com/article/trump-fraud-carroll-fines-82d423b8e7a7f9a32470729c5f4410e5"
  },
  {
    "text": "Judge: Trump Org defendants' ‘complete’ lack of contrition ‘borders on pathological’  —  A New York judge called out former President Trump and other Trump Organization executives Friday for their lack of remorse in a civil fraud case over the company's business dealings.",
    "url": "https://thehill.com/regulation/court-battles/4473251-engoron-trump-org-defendants-lack-of-contrition-pathological/"
  },
  {
    "text": "Wisconsin fake elector tells ‘60 Minutes’ he was afraid of Trump supporters  —  MADISON - The former chairman of the Wisconsin Republican Party in a new interview claims he sent Congress paperwork he signed posing as an elector for Donald Trump following the former president's 2020 election loss … ",
    "url": "https://www.jsonline.com/story/news/politics/2024/02/16/wisconsin-fake-elector-tells-60-minutes-he-feared-trump-supporters/72617180007/"
  },
  {
    "text": "U.S. outrage at Navalny's death turns into a rallying cry  —  From Washington to Munich, the world reacted to news of Navalny's death at a precarious time for transatlantic relations.  —  The shock waves of Alexei Navalny's death rippled across the Atlantic.",
    "url": "https://www.politico.com/news/2024/02/16/kamala-harris-russia-navalny-00141888"
  },
  {
    "text": "The majority of traffic from Elon Musk's X may have been fake during the Super Bowl, report suggests  —  These numbers are legitimately shocking. … Also riding high from the big game?  Elon Musk's X. The company formerly known as Twitter published its own press release … ",
    "url": "https://mashable.com/article/x-twitter-elon-musk-bots-fake-traffic"
  },
  {
    "text": "James Comer Faces Potential Investigation Over Lying FBI Source  —  Republican Representative James Comer is facing calls for an investigation of his efforts to impeach President Joe Biden after a key witness in the probe was charged with lying to the FBI.  —  Special counsel David Weiss … ",
    "url": "https://www.newsweek.com/james-comer-faces-potential-investigation-over-lying-fbi-source-1870518"
  },
  {
    "text": "GOP suffers ‘most spectacular embarrassment imaginable’ in anti-Biden case  —  The GOP's impeachment crusade against Joe Biden will continue, even after their star witness was charged with lying to the FBI, but it really shouldn't.  —  It's not exactly a secret that the impeachment crusade … ",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/gop-suffers-spectacular-embarrassment-imaginable-anti-biden-case-rcna139159"
  },
  {
    "text": "GOP House chair: Johnson has no way out of Ukraine floor vote  —  The GOP chair of the House Foreign Affairs Committee was bullish Friday on the chamber delivering U.S. military assistance to Ukraine, Israel and Taiwan, despite the “brainwashing” of some within his caucus who oppose foreign spending … ",
    "url": "https://thehill.com/homenews/house/4473343-mccaul-johnson-ukraine-aid-floor-vote/"
  },
  {
    "text": "I've reported on the health of every president since Reagan.  Here's what I think about Trump and Biden  —  When I interviewed Ronald Reagan about his health in 1980, he was 69 and poised to become the oldest person to be elected president.  During our conversation, Reagan was mentally sharp.",
    "url": "https://www.statnews.com/2024/02/16/trump-biden-dementia-cognitive-health-lawrence-altman-presidential-history/"
  },
  {
    "text": "Students lose out as cities and states give billions in property tax breaks to businesses − draining school budgets and especially hurting the poorest students  —  Built in 1910, James Elementary is a three-story brick school in Kansas City, Missouri's historic Northeast neighborhood … ",
    "url": "https://theconversation.com/students-lose-out-as-cities-and-states-give-billions-in-property-tax-breaks-to-businesses-draining-school-budgets-and-especially-hurting-the-poorest-students-222940"
  },
  {
    "text": "A chaotic US House is losing three Republican committee chairs to retirement in the span of a week  —  In a single week, the Republican chairs of three House committees announced they would not be seeking reelection, raising questions about whether the chaos that has reigned this Congress is driving out some of the GOP's top talent.",
    "url": "https://apnews.com/article/congress-retirements-republican-chairs-1fa6864ba5ea80eb8dad88ddcc59cac8"
  },
  {
    "text": "House bipartisan group unveils $66 billion foreign aid bill … - The bill also blocks the use of federal funds to transfer migrants between detention centers or other locations unless it is for adjudicating their immigration case.  — It would also implement a Trump-era policy … ",
    "url": "https://www.axios.com/2024/02/16/house-foreign-aid-bill-ukraine-israel-border"
  }
]