[
  {
    "text": "Russell Brand accused of rape, sexual assaults and abuse  —  Four women, including one who was just 16, make allegations after an investigation by The Sunday Times, The Times and Channel 4 Dispatches  —  The comedian and actor Russell Brand has been accused of rape, sexual assaults … ",
    "url": "https://www.thetimes.co.uk/article/russell-brand-rape-sexual-assault-abuse-allegations-investigation-v5hxdlmb6"
  },
  {
    "text": "Russell Brand accused of rape and sexual assault  —  Comedian and actor Russell Brand has been accused of rape, sexual assaults and emotional abuse during a seven-year period at the height of his fame.  —  The allegations were made in a joint investigation by the Sunday Times, the Times and Channel 4's Dispatches.",
    "url": "https://www.bbc.com/news/uk-66831593"
  },
  {
    "text": "Texas Attorney General Ken Paxton acquitted in impeachment trial  —  Paxton was impeached for allegedly taking bribes, but ultimately members of his party chose not to vote for his conviction and removal from office.  —  Impeached Texas Attorney General Ken Paxton was acquitted … ",
    "url": "https://www.nbcnews.com/politics/politics-news/texas-attorney-general-ken-paxton-acquitted-impeachment-trial-rcna104816"
  },
  {
    "text": "Texas AG Ken Paxton Survives Fiery Impeachment Trial  —  Ken Paxton was accused of using his job as the state's top prosecutor to dish out favors to a big-donor friend.  —  The embattled Texas Attorney General Ken Paxton avoided an impeachment conviction on Saturday with Texas' Republican … ",
    "url": "https://www.thedailybeast.com/ken-paxton-impeachment-verdict-texas-ag-acquitted-of-16-charges-will-remain-in-office"
  },
  {
    "text": "Trump Plans Two Mar-a-Lago Fundraisers for Campaign, Legal Fees  — Separate events said to include a dinner for $100,000 per seat  — Former president has been fundraising on his four indictments  —  Former President Donald Trump is planning separate fundraisers at Mar-a-Lago in October … ",
    "url": "https://www.bloomberg.com/news/articles/2023-09-16/trump-plans-two-mar-a-lago-fundraisers-for-campaign-legal-fees"
  },
  {
    "text": "Pope Pius XII Likely Knew of Holocaust, Newly Discovered Letter Suggests  —  The newly discovered letter, written by a German Jesuit to Pope Pius XII's personal secretary, suggests that the pope knew of Hitler's atrocities but chose to remain silent.  —  A letter found among the private papers … ",
    "url": "https://www.nytimes.com/2023/09/16/world/europe/pope-pius-holocaust.html"
  },
  {
    "text": "Man groped by Lauren Boebert during frisky ‘Beetlejuice’ date owns gay-friendly bar that hosts drag shows  —  A bar owned by Rep. Lauren Boebert's apparent new beau has staged at least one drag show, according to a review of social media posts.  —  In January, the Hooch Craft Cocktail Bar in Aspen … ",
    "url": "https://nypost.com/2023/09/16/lauren-boeberts-new-man-owns-gay-friendly-bar-which-hosts-drag-shows/"
  },
  {
    "text": "Battle Over Electric Vehicles Is Central to Auto Strike  —  Carmakers are anxious to keep costs down as they ramp up electric vehicle manufacturing, while striking workers want to preserve jobs as the industry shifts to batteries.  —  A battle between Detroit carmakers and the United Auto Workers union … ",
    "url": "https://www.nytimes.com/2023/09/16/business/electric-vehicles-uaw-gm-ford-stellantis.html"
  },
  {
    "text": "Presidential Straw Poll Results: Pray Vote Stand Summit 2023  —  These are the results from the straw poll held at the Pray Vote Stand Summit 2023 in Washington, D.C.  —  Votes for President:  —  CandidateCountPercent  —  63.9%  —  27.3%  —  2.2%  —  1.9%  —  1.7%  —  1.5%  —  0.9%",
    "url": "https://washingtonstand.com/news/presidential-straw-poll-results-pray-vote-stand-summit-2023"
  },
  {
    "text": "Sore throat, then congestion: Common Covid symptoms follow a pattern now, doctors say  —  Doctors who treat Covid describe the ways the illness has gotten milder and shifted over time to mostly affect the upper respiratory tract.  —  How Covid symptoms have evolved since the pandemic",
    "url": "https://www.nbcnews.com/health/health-news/covid-symptoms-mild-follow-pattern-doctors-say-rcna105090"
  },
  {
    "text": "Military officers begin to speak out on the harm done by Sen. Tuberville's holds on promotions  —  In the months since a single senator froze military promotions over the Pentagon's abortion policy, the uniformed officers affected have been largely silent, wary of stepping into a political fray.",
    "url": "https://apnews.com/article/tuberville-holds-military-nominations-664c15d00d330b2b06b75ebeda8e3f01"
  },
  {
    "text": "California goes on offense against Big Oil  —  California is one of the country's top oil and gas producers, and Chevron, one of the defendants, is headquartered in the state.  —  Democratic California Gov. Gavin Newsom announced a lawsuit Saturday against five major oil companies and their subsidiaries … ",
    "url": "https://www.politico.com/news/2023/09/16/california-sues-oil-companies-00116398"
  },
  {
    "text": "GOP senators ask Biden to provide Ukraine with missiles needed to win war  —  A group of Republican senators on Saturday sent a letter to President Biden urging him to “immediately” provide the missiles Ukraine needs to win its war against Russia.  —  Sen. Tom Cotton (R-Ark.) … ",
    "url": "https://thehill.com/homenews/senate/4208276-gop-senators-ask-biden-to-provide-ukraine-with-missiles-needed-to-win-war/"
  },
  {
    "text": "COVID levels are so high, they're hovering near 2020's initial peak, as the WHO urges those at high risk to take any booster they can get their hands on  —  IRFAN KHAN, LOS ANGELES TIMES VIA GETTY IMAGES  —  U.S. COVID infections are hovering near levels of the pandemic's first peak in 2020 … ",
    "url": "https://fortune.com/well/2023/09/16/united-states-covid-levels-approach-first-pandemic-peak-2020-who-urges-vaccination-boosters-high-risk/"
  },
  {
    "text": "Iowa Democrats vote to approve Jan. 15 in-person caucus date — mail-in dates unresolved  —  The Iowa Democratic Party voted Saturday to hold the in-person portion of its 2024 presidential caucuses on Jan. 15 — the same day Iowa Republicans plan to caucus.  —  That will be when Democrats … ",
    "url": "https://www.desmoinesregister.com/story/news/elections/presidential/caucus/2023/09/16/iowa-democrats-approve-january-15-in-person-caucus-date-2024/70876412007/"
  }
]