[
  {
    "text": "Social Security: A Time for Outrage  —  Trump's policies attack his own base — but who will tell them?  —  Donald Trump is often described as a “populist.”  Yet his administration is stuffed with wealthy men who are clueless about how the other 99.99 percent lives, while his policies involve undermining … ",
    "url": "https://paulkrugman.substack.com/p/social-security-a-time-for-outrage"
  },
  {
    "text": "Why DOGE is struggling to find fraud in Social Security  —  Claims of massive problems by Elon Musk and President Trump are at odds with the agency's audits and reports.  —  Just now  —  Elon Musk put a big target on the Social Security Administration in the first weeks of the Trump administration … ",
    "url": "https://www.washingtonpost.com/business/2025/03/24/social-security-fraud-doge-cuts-dead/"
  },
  {
    "text": "Law firm targeted by Trump could have been ‘destroyed,’ chairman says in explaining deal with Trump  —  The chairman of a prominent law firm who cut a deal with President Donald Trump last week to avert the consequences of a White House executive order told colleagues in an email Sunday … ",
    "url": "https://apnews.com/article/trump-law-firm-retribution-2bd698e21528511bfa54506f0483ef5c"
  },
  {
    "text": "U.S. Could Run Out of Cash by July, Analysis Finds  —  The Bipartisan Policy Center estimates that the so-called X-date could fall between mid-July and early October if Congress does not lift or suspend the nation's debt limit.  —  The United States could run out of cash to continue paying … ",
    "url": "https://www.nytimes.com/2025/03/24/us/politics/x-date-debt-limit-treasury-republicans-trump.html"
  },
  {
    "text": "Fox's Brian Kilmeade: “It's not practical to think that we can do due process on 8 million people”  —  Co-host Lawrence Jones: Constitutional rights “are afforded to illegals in this country.  We should revisit that.”",
    "url": "https://www.mediamatters.org/brian-kilmeade/foxs-brian-kilmeade-its-not-practical-think-we-can-do-due-process-8-million-people"
  },
  {
    "text": "Trump's Most Dangerous Enabler Is Not Who You Think It Is  —  Who is President Donald Trump's most dangerous enabler?  As his second term got underway, it initially appeared that this coveted title might fall to FBI director Kash Patel, who'd vowed to investigate Trump's enemies.",
    "url": "https://newrepublic.com/article/193064/trump-dangerous-enabler-marco-rubio"
  },
  {
    "text": "Mia Love, Utah's history-making former congresswoman, dies at 49  —  A former City Council member, mayor and two-term member of Congress, she died after a three-year battle with brain cancer  —  Mia Love, the child of Haitian immigrants who went on to become a City Council member … ",
    "url": "https://www.sltrib.com/news/politics/2025/03/23/mia-love-utahs-history-making/"
  },
  {
    "text": "Second lady Usha Vance to visit Greenland as Trump pushes for ownership of the Danish territory  —  Vance will be joined by Energy Secretary Chris Wright and national security adviser Michael Waltz, two Trump administration sources told NBC News.  —  Second lady Usha Vance will travel … ",
    "url": "https://www.nbcnews.com/politics/trump-administration/second-lady-usha-vance-visit-greenland-trump-mike-waltz-chris-wright-rcna197708"
  },
  {
    "text": "The Abundance Agenda  —  I spent the last few days digesting Abundance by Ezra Klein and Derek Thompson and then reading twelve recent pieces commenting on the book, with the goal of getting a handle on this particular area of discourse and trying to determine what exactly to make of it all.",
    "url": "https://www.peoplespolicyproject.org/2025/03/24/the-abundance-agenda/"
  },
  {
    "text": "Man charged with assault at Tesla dealership after driving car at protesters  —  The protest was one of several across the country in opposition to Tesla founder Elon Musk, who has been slashing government costs and firing thousands of federal workers.  —  A man was arrested and charged … ",
    "url": "https://www.nbcnews.com/news/us-news/man-charged-assault-tesla-dealership-driving-car-protesters-rcna197746"
  },
  {
    "text": "The Supreme Court's new religion case could devastate American workers  —  Catholic Charities v. Wisconsin risks giving employers a sweeping new power to ignore laws protecting their workers. … The Court's Republican majority almost always rules in favor of Christian litigants who seek … ",
    "url": "https://www.vox.com/scotus/404678/supreme-court-catholic-charities-wisconsin-religious-liberty-workers"
  },
  {
    "text": "Trump demands Colorado take down ‘purposefully distorted’ painting  —  President Trump is demanding that Colorado take down it's “purposefully distorted” painting of him hanging in the State Capitol.  —  “Nobody likes a bad picture or painting of themselves, but the one in Colorado … ",
    "url": "https://thehill.com/homenews/state-watch/5210127-trump-demands-colorado-take-down-purposefully-distorted-painting/"
  },
  {
    "text": "Gulf of Fear  —  When news anchors tiptoe around the name Gulf of Mexico, it's not just semantics—it's a glimpse at how the press starts to flinch under political pressure.  —  In China, Taiwan doesn't exist—at least not as a country.  On official maps, it's a province.",
    "url": "https://www.status.news/p/gulf-of-mexico-tv-news-networks"
  },
  {
    "text": "Behind the Curtain: Dems' dark, deep hole  —  Top Democrats tell us their party is in its deepest hole in nearly 50 years — and they fear things could actually get worse:  — The party has its lowest favorability ever.  — No popular national leader to help improve it.",
    "url": "https://www.axios.com/2025/03/24/democrats-popularity-crisis-trump-elections"
  },
  {
    "text": "VICTORY: Federal court blocks Texas A&M's unconstitutional drag ban  —  A federal judge today upheld the First Amendment rights of a Texas A&M student group by blocking an attempt by officials to prohibit the group's upcoming drag show on the College Station campus.",
    "url": "https://www.thefire.org/news/victory-federal-court-blocks-texas-ams-unconstitutional-drag-ban"
  },
  {
    "text": "Supreme Court hears Louisiana racial gerrymandering claim - US politics live  —  Justices hear oral arguments in case that could upend state's congressional map  —  Trump to impose 25% tariff on countries that buy oil and gas from Venezuela  —  Venezuela receives hundreds of deported migrants from US after flights restart",
    "url": "https://www.theguardian.com/us-news/live/2025/mar/24/donald-trump-jd-vance-greenland-us-politics-latest-live-news"
  },
  {
    "text": "The frog of democracy is nearly boiled.  We can still jump out of the pot  —  I still remember, from when I was a politically precocious teen in the 1970s, my dog-eared paperback copy of one of that fraught decade's defining books: The Gulag Archipelago by the Soviet Nobel laureate, Aleksandr Solzhenitsyn.",
    "url": "https://www.inquirer.com/opinion/commentary/trump-dictatorship-universities-law-firms-20250323.html#loaded"
  },
  {
    "text": "Youngkin wants controversial U-Va. board member to resign, people familiar say  —  Bert Ellis, appointed by the governor in 2022, has so far refused to step down, the people said.  —  Virginia Gov. Glenn Youngkin (R) wants to remove one of his appointees on the governing board of the University of Virginia … ",
    "url": "https://www.washingtonpost.com/education/2025/03/24/youngkin-bert-ellis-resign-refuse/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQyNzg4ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ0MTcxMTk5LCJpYXQiOjE3NDI3ODg4MDAsImp0aSI6ImVhMjFhYmY2LWNiOWYtNGE3Ni1hMTEwLWIxMGNkNjNiOThkYiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9lZHVjYXRpb24vMjAyNS8wMy8yNC95b3VuZ2tpbi1iZXJ0LWVsbGlzLXJlc2lnbi1yZWZ1c2UvIn0.AyEkEQq3SDILjk0wVdOExn35IPcGAQsUYya043_J42U&itid=gfta"
  },
  {
    "text": "Trump administration asks Supreme Court to halt judge's order to rehire probationary federal workers  —  The Trump administration asked the Supreme Court on Monday to halt a ruling ordering the rehiring of thousands of federal workers let go in mass firings aimed at dramatically downsizing the federal government.",
    "url": "https://apnews.com/article/mass-firings-trump-administration-supreme-court-bfe86f68e9877bf58c64bbc3b01db9c6"
  },
  {
    "text": "Musk Inc is under serious threat  —  The world's richest man has lost focus.  His competitors are taking advantage  —  san francisco  —  Until recently Elon Musk had little need to look over his shoulder.  He once described competition for Tesla, his electric-vehicle (ev) company, as … ",
    "url": "https://www.economist.com/business/2025/03/23/musk-inc-is-under-serious-threat"
  },
  {
    "text": "‘Chaos and Confusion’ at the Crown Jewel of American Science  —  Senior scientists at the National Institutes of Health fear that research on conditions like obesity, heart disease and cancer will be undermined by President Trump's policies.  —  A week after Donald J. Trump was inaugurated … ",
    "url": "https://www.nytimes.com/2025/03/24/health/nih-doge-trump.html"
  },
  {
    "text": "Democrat Who Is an Army Veteran Enters Key N.Y. House Race  —  Cait Conley, a former National Security Council official, will run for the seat held by Mike Lawler, a second-term Republican.  —  Seven years ago, Democrats seized on a growing backlash against President Trump to flip the House … ",
    "url": "https://www.nytimes.com/2025/03/24/nyregion/cait-conley-lawler.html"
  },
  {
    "text": "Trump Says Nations Buying Venezuela Oil, Gas Face 25% Charge  —  President Donald Trump said he would seek a 25% tariff on any nation purchasing oil and gas from Venezuela, citing migration and criminal gang members in the US.  —  “Any Country that purchases Oil and/or Gas from Venezuela … ",
    "url": "https://www.bloomberg.com/news/articles/2025-03-24/trump-announces-25-charge-on-nations-buying-venezuelan-oil-gas"
  },
  {
    "text": "Bondi says Supreme Court ‘will get involved’ in migrant deportation flights case  —  Attorney General Pam Bondi said the Supreme Court “will get involved” in the case about the deportation of nearly 300 Venezuelan migrants.  —  “Oh, the Supreme Court will get involved,” Bondi said on Fox News's “Sunday Morning Futures.”",
    "url": "https://thehill.com/regulation/court-battles/5210416-bondi-boasberg-deportation-case/"
  },
  {
    "text": "Supreme Court turns away casino mogul Steve Wynn's challenge to defamation law  —  WASHINGTON - The U.S. Supreme Court on Monday turned away a bid by casino mogul Steve Wynn to roll back defamation protections established in the case New York Times v. Sullivan.",
    "url": "https://www.usatoday.com/story/news/politics/2025/03/24/supreme-court-steve-wynn-ny-times-v-sullivan/82634101007/"
  },
  {
    "text": "Stop Making Excuses for Not Fighting Trump  —  The capitulations and acquiescence we've seen so far will only make opposition more difficult down the road.  —  Last night, the Wall Street Journal reported that the White House is quietly narrowing the scope of the tariffs it plans to roll out on April 2 … ",
    "url": "https://www.thebulwark.com/p/stop-making-excuses-not-fighting-trump"
  },
  {
    "text": "Ed Martin Is Trampling the Rule of Law.  And He Won't Shut Up About It.  —  Trump's loyal prosecutor is weaponizing the DOJ—one typo at a time.  —  When Elon Musk ordered a government-wide email blast directing federal employees to list their recent accomplishments, most senior officials paused to consider their options.",
    "url": "https://www.motherjones.com/politics/2025/03/ed-martin-washingting-dc-us-attorney-january-6-trump/"
  }
]