[
  {
    "text": "Donald Trump Goes to Detroit and Insults the Entire City  —  READ THE ROOM  —  He suggested Michiganders should vote for him if they don't want America to mimic their largest city.  —  Donald Trump on Thursday addressed business leaders in Detroit, where he insulted their city and big companies.",
    "url": "https://www.thedailybeast.com/donald-trump-goes-to-detroit-and-insults-the-entire-city-in-his-speech"
  },
  {
    "text": "Kamala Harris agreed to CNN town hall  —  The cable network also extended an offer to former President Donald Trump.  —  Vice President Kamala Harris will participate in a town hall with CNN on Oct. 23, her campaign announced Thursday.  —  Harris' participation comes after former President Donald Trump … ",
    "url": "https://www.politico.com/news/2024/10/10/kamala-harris-cnn-town-hall-00183249"
  },
  {
    "text": "Trump Says He Was ‘Man of the Year.’ His Source Says It Isn't True.  —  Fact-checkers have found no evidence over the years that former President Donald J. Trump once received the honor in Michigan.  —  Former President Donald J. Trump expressed irritation on Thursday that anyone would challenge … ",
    "url": "https://www.nytimes.com/2024/10/10/us/politics/trump-man-of-year.html"
  },
  {
    "text": "Obama admonishes Black men for hesitancy in supporting Harris  —  Former president suggests some in the Black community are uncomfortable voting for a woman and are coming up with excuses  —  PITTSBURGH — Former president Barack Obama on Thursday made a direct, impassioned plea to black men … ",
    "url": "https://www.washingtonpost.com/politics/2024/10/10/obama-harris-rally-pittsburgh/"
  },
  {
    "text": "Trump Delivers Historically Illiterate Lecture on Tariffs … Donald Trump has grown increasingly fixated on tariffs, which he seems to think, contrary to the consensus among economists, are borne by foreigners.  Trump understands at some level that economists and most business owners disagree with him … ",
    "url": "https://nymag.com/intelligencer/article/trump-tariffs-detroit-economic-club-history-revenue-smoot-hawley.html"
  },
  {
    "text": "Taylor Lorenz leaves ‘Washington Post’ after rift with editors  —  When tech columnist Taylor Lorenz left the Washington Post last week, she did so with a splash: An interview with The Hollywood Reporter about launching her own digital magazine, called User Mag.",
    "url": "https://www.npr.org/2024/10/10/g-s1-27366/taylor-lorenz-leaves-washington-post-after-rift-with-editors"
  },
  {
    "text": "Gateway Pundit settles with Georgia election workers in defamation suit  —  The far-right publisher, which frequently reported false election-fraud claims, wrote repeatedly about Shaye Moss and her mother, Ruby Freeman.  —  The Gateway Pundit, a far-right news site that repeatedly published … ",
    "url": "https://www.washingtonpost.com/politics/2024/10/10/gateway-pundit-defamation-ruby-freeman/"
  },
  {
    "text": "Michigan Gov. Gretchen Whitmer feeds Doritos to left-wing influencer in deeply bizarre ‘communion’ video  —  DETROIT — Now that's weird.  —  Michigan Gov. Gretchen Whitmer raised eyebrows Thursday over a bizarre video in which she fed Doritos into the mouth of a liberal podcaster … ",
    "url": "https://nypost.com/2024/10/10/us-news/why-is-gretchen-whitmer-feeding-a-left-wing-influencer-doritos/"
  },
  {
    "text": "Federal judges decline to extend voter registration deadline in Georgia and Florida as states face hurricane damage  —  Two federal judges have rejected requests to immediately reopen voter registration in Georgia and Florida as the southeast continues to grapple with significant storm damage ahead of the November election.",
    "url": "https://www.cnn.com/2024/10/10/politics/georgia-florida-voter-registration-deadlines"
  },
  {
    "text": "The FBI conducted a sham investigation into Brett Kavanaugh.  Surprised?  —  The bureau shamefully allowed itself to be used as a prop in political theater, orchestrated by the Trump administration  —  Maybe it was always obvious that the whole thing was a sham.",
    "url": "https://www.theguardian.com/commentisfree/2024/oct/10/brett-kavanaugh-fbi-donald-trump-investigation-sham"
  },
  {
    "text": "They Served With Trump.  They Have a Warning.  —  Hurricane Milton, which slammed into Florida as a Category 3 storm last night, has been nearly as bad as advertised, although the absolute worst-case scenario—catastrophic storm surge throughout the city of Tampa—blessedly did not come to pass.",
    "url": "https://www.thebulwark.com/p/they-served-with-trump-they-have"
  },
  {
    "text": "More than 3 million without power as Hurricane Milton slams Florida, causes deaths and flooding  —  Florida residents returned to the familiar ritual of assessing hurricane damage Thursday, the day after Milton smashed through many coastal communities and spawned a barrage of tornadoes … ",
    "url": "https://apnews.com/article/hurricane-milton-tampa-florida-5f6a112986eb6e21720f0f17c504afe8"
  },
  {
    "text": "Jim Jordan warns FTC to back off suing car dealer accused of overcharging Latinos  —  House Judiciary Committee chairman Jim Jordan (R-OH) fired off a warning shot at Federal Trade Commission chair Lina Khan, according to the New York Post: stop investigating civil rights matters.",
    "url": "https://www.rawstory.com/jim-jordan-2669376570/"
  },
  {
    "text": "TD Bank Pleads Guilty to Bank Secrecy Act and Money Laundering Conspiracy Violations in $1.8B Resolution  —  For Immediate Release  —  WASHINGTON — TD Bank N.A. (TDBNA), the 10th largest bank in the United States, and its parent company TD Bank US Holding Company (TDBUSH) (together with TDBNA … ",
    "url": "https://www.justice.gov/opa/pr/td-bank-pleads-guilty-bank-secrecy-act-and-money-laundering-conspiracy-violations-18b"
  },
  {
    "text": "Plane with banner telling Trump to watch ‘The Apprentice’ flies near Pennsylvania rally  —  The distribution company behind the movie “The Apprentice” promoted the controversial film outside former President Trump's rally on Wednesday, flying a plane carrying a banner that urged the GOP nominee … ",
    "url": "https://thehill.com/blogs/in-the-know/4927482-plane-banner-trump-apprentice-movie/"
  },
  {
    "text": "Republican Farmers Featured in Harris Ad Are Not Actors, Not Democrats  —  Este artículo estará disponible en español en El Tiempo Latino.  —  Quick Take  —  An ad from Vice President Kamala Harris features a Pennsylvania farming couple who say they are “lifelong Republicans” but are voting for Harris.",
    "url": "https://www.factcheck.org/2024/10/republican-farmers-featured-in-harris-ad-are-not-actors-not-democrats/"
  },
  {
    "text": "GOP Rep. Lori Chavez-DeRemer Says She Didn't Support 6-Week Abortion Ban She Supported  —  The Oregon Republican is disputing something that's ... right there in plain sight.  —  LOADING  —  WASHINGTON ― Rep. Lori Chavez-DeRemer (R-Ore.) is in one of the most closely watched congressional races … ",
    "url": "https://www.huffpost.com/entry/lori-chavez-deremer-six-week-abortion-ban_n_6707f441e4b047df57070601"
  },
  {
    "text": "Marshawn Lynch hints at run for Oakland mayor  —  The former NFL and Cal Berkeley star hinted at a run on his podcast with Gavin Newsom and Doug Hendrickson.  —  Marshawn Lynch, the former star NFL running back and Super Bowl champ, hinted at a possible run for mayor of Oakland on the podcast … ",
    "url": "https://www.politico.com/news/2024/10/10/marshawn-lynch-oakland-mayor-00183302"
  }
]