[
  {
    "text": "Trump Inflated Property Values by Up to $2.2 Billion, New York A.G. Says  —  Letitia James, the attorney general, asked a judge to find, without a trial, that the former president had fraudulently overvalued his assets.  —  Before Donald J. Trump was indicted four times over … ",
    "url": "https://www.nytimes.com/2023/08/30/nyregion/trump-james-civil-lawsuit-trial.html"
  },
  {
    "text": "2 Trump co-defendants ask judge to break apart Georgia election interference case and hold separate trials  —  Two Trump co-defendants in Georgia who requested speedy trials asked a judge Wednesday to formally separate their cases from the sprawling overall indictment, a move … ",
    "url": "https://www.cnn.com/2023/08/30/politics/powell-chesebro-sever-georgia-2020-election-case/"
  },
  {
    "text": "Trump fraudulently inflated his net worth by billions of dollars, New York AG says  —  The estimates came in newly unsealed court filings ahead of an October trial in which Trump and his business empire are accused of fraud.  —  NEW YORK — Donald Trump fraudulently inflated his net worth … ",
    "url": "https://www.politico.com/news/2023/08/30/trump-net-worth-fraud-trial-00113541"
  },
  {
    "text": "McConnell quickly convenes with allies after second public freeze  —  Some senators were already seeking more information about McConnell's status Wednesday afternoon, according to one person familiar with the dynamics.  —  Mitch McConnell's latest health scare guarantees Republican senators … ",
    "url": "https://www.politico.com/news/2023/08/30/mcconnell-second-public-freeze-00113542"
  },
  {
    "text": "Donald Trump vows to lock up political enemies if he returns to White House  —  Former president tells Glenn Beck he would have ‘no choice’ but to lock up opponents 'because they're doing it to us'  —  Donald Trump says he will lock up his political enemies if he is president again.",
    "url": "https://www.theguardian.com/us-news/2023/aug/30/trump-interview-jail-political-opponents-glenn-beck"
  },
  {
    "text": "A Texas judge has declared unconstitutional a law championed by Gov. Greg Abbott that limits the power of Democrat-led cities  — A Texas judge declared a law that prevented cities from passing some local ordinances unconstitutional.  — The law, championed by Republican Gov. Greg Abbott … ",
    "url": "https://www.businessinsider.com/texas-judge-death-star-bill-greg-abbott-unconstitutional-2023-8?op=1"
  },
  {
    "text": "Giuliani sanctioned by judge in defamation case brought by 2 Georgia election workers  —  The ex-mayor is being sued by election workers Ruby Freeman and Shaye Moss.  —  A federal judge on Wednesday awarded a default judgment to a pair of Georgia election workers as part of their civil defamation suit … ",
    "url": "https://abcnews.go.com/US/giuliani-sanctioned-judge-defamation-case-brought-2-georgia/story?id=102723328"
  },
  {
    "text": "Blake Masters Plans to Enter Race for Kyrsten Sinema's Senate Seat  —  Arizona is seen as one of the most competitive states in 2024  —  Republican Blake Masters, who lost his Arizona Senate bid last year, is set to announce he is running again in 2024, according to people familiar with his plans … ",
    "url": "https://www.wsj.com/politics/elections/blake-masters-plans-to-enter-race-for-kyrsten-sinemas-senate-seat-886280ac?mod=followamazon"
  },
  {
    "text": "Trump advised Tudor Dixon to soften her line on abortion during Michigan governor's race  —  The conservative media personality came under fire in the campaign for failing to say whether she would allow the procedure for rape victims.  —  Michigan Republican Tudor Dixon … ",
    "url": "https://www.politico.com/news/2023/08/30/trump-tudor-dixon-abortion-michigan-race-00113557"
  },
  {
    "text": "A crackdown on ‘woke’ coverage is tearing Atlanta magazine apart  —  The publisher pushed back on their effort to present a modern picture of life in one of the Blackest, queerest cities in the South, calling it ‘divisive.’ Now, half the staff has quit.  —  On a hot Tuesday in late June … ",
    "url": "https://www.washingtonpost.com/media/2023/08/30/atlanta-magazine-woke-culture-war-sean-mcginnis/"
  },
  {
    "text": "Biden-Harris Administration Approves $72 Million in Borrower Defense Discharges for over 2,300 Borrowers who Attended Ashford University  —  Relief stems from evidence provided by the California Department of Justice during successful lawsuit brought against the college and its parent company",
    "url": "https://www.ed.gov/news/press-releases/biden-harris-administration-approves-72-million-borrower-defense-discharges-over-2300-borrowers-who-attended-ashford-university"
  },
  {
    "text": "Wallace confirms resignation as UK defence minister in letter to PM Sunak  —  Ben Wallace confirmed his resignation as defence minister on Thursday in a letter to Rishi Sunak, offering the government his continued support while warning the British prime minister not to see defence as a “discretionary spend”.",
    "url": "https://www.reuters.com/world/uk/wallace-confirms-resignation-uk-defence-minister-letter-pm-sunak-2023-08-31/"
  },
  {
    "text": "Trump Posts More than 30 Video Rants in One Day on Truth Social  —  BUCK WILD  —  Former President Donald Trump went absolutely buck wild online Wednesday, posting more than 30 angry videos railing against his 2020 opponent Joe Biden, the Department of Justice, Democrats in general, Fox News … ",
    "url": "https://www.thedailybeast.com/trump-posts-more-than-30-videos-in-one-day-on-truth-social"
  },
  {
    "text": "DOJ, SEC Investigate Tesla Over Secret Glass House Project  —  Federal prosecutors are seeking information about benefits paid to Elon Musk  —  Manhattan federal prosecutors are investigating  —  use of company funds on a secret project that had been described internally as a house … ",
    "url": "https://www.wsj.com/business/autos/tesla-elon-musk-glass-house-doj-sec-investigation-c723166b?mod=followamazon"
  },
  {
    "text": "Ex-cardinal McCarrick's sex abuse case is dismissed, without a ‘reckoning’  —  A Massachusetts judge on Wednesday dismissed a criminal charge against former high-ranking Catholic cleric Theodore McCarrick, ruling that the 93-year-old former archbishop of Washington is incompetent to stand trial for alleged child sexual abuse.",
    "url": "https://www.washingtonpost.com/religion/2023/08/30/theodore-mccarrick-cardinal-sexual-abuse-case/"
  },
  {
    "text": "Georgia Man Arrested on Felony and Misdemeanor Charges for Actions During Jan. 6 Capitol Breach  —  Defendant Accused of Illegally Entering Capitol and Lying to Investigators  —  WASHINGTON — A Georgia man has been arrested on felony and misdemeanor charges related to his actions during the breach of the U.S. Capitol on Jan. 6, 2021.",
    "url": "https://www.justice.gov/usao-dc/pr/georgia-man-arrested-felony-and-misdemeanor-charges-actions-during-jan-6-capitol-breach"
  },
  {
    "text": "Judge rejects former Trump aide Peter Navarro's executive privilege claim, paving way for trial in contempt case  —  U.S. District Court Judge Amit Mehta's ruling means Navarro's trial on charges he snubbed a congressional subpoena can begin next week.  —  A federal court judge in Washington … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/judge-rejects-former-trump-aide-peter-navarros-executive-privilege-cla-rcna102538"
  }
]