[
  {
    "text": "Trump says he'd ‘fire’ special counsel Jack Smith in ‘two seconds’ if elected again  —  Smith has led the Justice Department's investigations into Donald Trump's efforts to overturn the 2020 presidential election and the hoarding of classified documents.  —  Former president Donald Trump … ",
    "url": "https://www.washingtonpost.com/elections/2024/10/24/trump-fire-jack-smith/"
  },
  {
    "text": "Marist North Carolina Poll: U.S. Presidential Contest in North Carolina, October 2024  —  Trump +2 Points in North Carolina  —  Two points separate former President Donald Trump and Vice President Kamala Harris among North Carolina likely voters including those who are undecided yet leaning toward a candidate.",
    "url": "https://maristpoll.marist.edu/polls/marist-north-carolina-poll-u-s-presidential-contest-in-north-carolina-october-2024/"
  },
  {
    "text": "House GOP committee that oversees elections hired two former Trump officials involved in 2020 fake elector scheme  —  House Republicans on the committee with broad jurisdiction over national elections have hired at least two former Donald Trump campaign officials involved in the 2020 fake electors scheme … ",
    "url": "https://www.cnn.com/2024/10/24/politics/house-gop-committee-trump-fake-elector-scheme"
  },
  {
    "text": "Fox News edited Trump's rambling answers and false claims in barbershop interview, full video shows  —  New York CNN  —  The Fox News Channel's recent segment about Donald Trump's “surprise” visit to a barbershop in the Bronx resembled a campaign ad for the former president's reelection.",
    "url": "https://www.cnn.com/2024/10/24/media/fox-news-edit-trump-barbershop-interview/"
  },
  {
    "text": "Musk's super PAC skips daily $1 million swing state giveaway after DOJ warning … - The SpaceX CEO had pledged to give away $1 million every day to registered voters in swing states who sign the super PAC's petition in favor of the First and Second Amendments.",
    "url": "https://www.axios.com/2024/10/24/elon-musk-million-dollar-giveaway-doj-warning"
  },
  {
    "text": "Washington Post staffers suspect owner Jeff Bezos holding up Kamala Harris endorsement: report  —  Washington Post staffers are growing restless over the left-leaning paper's silence on endorsing Vice President Kamala Harris for president — with many suspecting that owner Jeff Bezos is behind the delay, according to a report.",
    "url": "https://nypost.com/2024/10/24/media/washington-post-staffers-suspect-jeff-bezos-holding-up-harris-endorsement/"
  },
  {
    "text": "Did the ‘L.A. Times’ and other news outlets pull punches to appease Trump?  —  Recent episodes involving major U.S. news organizations have stoked fears that outlets are preemptively self-censoring coverage that could offend former President Donald Trump, who remains neck-and-neck in the polls … ",
    "url": "https://www.npr.org/2024/10/24/nx-s1-5163293/la-times-editor-resigns-trump-msnbc-washington-post"
  },
  {
    "text": "Arrest made after Phoenix USPS collection mailbox fire damages ballots overnight  —  Phoenix Fire Department's arson task force now investigating the fire  —  PHOENIX — An arrest has reportedly been made after a Phoenix United States Postal Service mailbox was believed to have been set on fire overnight … ",
    "url": "https://www.abc15.com/news/region-phoenix-metro/central-phoenix/ballots-damaged-after-usps-mail-collection-box-fire-near-7th-avenue-and-indian-school-road"
  },
  {
    "text": "Waukesha mayor endorses Kamala Harris; red city mayor plans to vote blue  —  WAUKESHA, Wis. - The mayor of Waukesha, a key Republican stronghold, exclusively told FOX6 News he's voting for Democrat Kamala Harris for president.  —  It's a Republican city in Wisconsin's largest Republican county.",
    "url": "https://www.fox6now.com/news/waukesha-mayor-endorses-kamala-harris"
  },
  {
    "text": "CDC recommends second COVID vaccine dose for those 65 and older  —  Immunocompromised adults or those who are older than 65 should get a second dose of the latest COVID-19 vaccine, the Centers for Disease Control and Prevention (CDC) officially recommended.  —  The CDC on Wednesday adopted … ",
    "url": "https://thehill.com/policy/healthcare/4952052-cdc-recommends-covid-vaccine-second-dose-65-and-older-immunocompromised/"
  },
  {
    "text": "Trump Flirts With the Ultimate Tax Cut: No Income Taxes at All  —  The former president has repeatedly praised a period in American history when there was no income tax, and the country relied on tariffs to fund the government.  —  Former President Donald J. Trump has spent … ",
    "url": "https://www.nytimes.com/2024/10/24/us/politics/donald-trump-tax-policy.html?unlocked_article_code=1.Uk4.SGjJ.N1oLDWOGe53P&smid=url-share"
  },
  {
    "text": "Kamala Harris' husband Doug Emhoff slapped me in the face so hard I spun around ... I'm disgusted by his fake ‘perfect spouse’ persona  — Second Gentleman's accuser bravely breaks her silence on ‘slap’  —  Doug Emhoff's ex-girlfriend has spoken exclusively to DailyMail.com claiming … ",
    "url": "https://www.dailymail.co.uk/news/article-13981101/doug-emhoff-ex-girlfriend-slap-flirt-allegations-kamala-harris.html"
  },
  {
    "text": "‘Shameful’: Naval Academy cancels authoritarianism lecture After ‘MAGA pressure’  —  The U.S. Naval Academy is under fire after it invited — then uninvited — a distinguished expert on authoritarianism and fascism to give a lecture.  —  Dr. Ruth Ben-Ghiat is a professor of history … ",
    "url": "https://www.alternet.org/authoritarianism-maga-pressure/"
  },
  {
    "text": "Trying to Find Trump's Ground Game in Pennsylvania  —  Four and eight years ago, there was a major Republican get-out-the-vote effort.  This time is different.  —  Elon Musk speaks at Life Center Church in Harrisburg, Pennsylvania, October 19, 2024.  Musk and his super PAC have taken over Donald Trump's national canvassing effort.",
    "url": "https://prospect.org/politics/2024-10-24-trump-ground-game-pennsylvania/"
  },
  {
    "text": "Franklin & Marshall Poll Release: October 2024  —  I'm writing to share our summary report for the October 2024 Franklin & Marshall College Poll.  I've highlighted a few of the key findings below, but I encourage you to read the full report, which is also included.",
    "url": "https://www.fandmpoll.org/franklin-marshall-poll-release-october-2024/"
  },
  {
    "text": "GOP Rep. David Schweikert Said Women Who Get Abortions ‘Hate That Baby’ And America  —  “They hate that baby because it symbolizes a responsibility,” the Arizona Republican said in a newly unearthed 2022 interview.  —  LOADING  —  WASHINGTON — Rep. David Schweikert (R-Ariz.) … ",
    "url": "https://www.huffpost.com/entry/gop-david-schweikert-abortion-arizona_n_67194bd5e4b0ede6b2bff075"
  },
  {
    "text": "There Are Four Anti-Trump Pathways We Failed to Take.  There Is a Fifth.  —  Democratic self-rule contains a paradox.  It is a system premised on openness and competition.  Any ambitious party or politician should have a shot at running for office and winning.  But what if a major candidate seeks to dismantle that very system?",
    "url": "https://www.nytimes.com/2024/10/24/opinion/democracy-defense-us-authoritarian.html?unlocked_article_code=1.Uk4.fPjE.y_WhudBhUHpo&smid=url-share"
  },
  {
    "text": "‘Take Back the States’: The Far-Right Sheriffs Ready to Disrupt the Election  —  Constitutional Sheriffs are duly elected lawmen who believe they answer only to god.  They've spent the last six months preparing to stop a “stolen” election—by any means necessary.",
    "url": "https://www.wired.com/story/constitutional-sheriffs-disrupt-election/"
  },
  {
    "text": "Stevie Nicks: ‘I Believe in the Church of Stevie’  —  In a nearly four-hour interview, the legendary singer goes deep on longevity, Kamala Harris, why Fleetwood Mac are finished and much more  —  E  —  VERY SECOND FEELS like an eternity when you're hovering four inches from Stevie Nicks, noodling around with her blouse.",
    "url": "https://www.rollingstone.com/music/music-features/stevie-nicks-fleetwood-mac-kamala-harris-new-music-1235140437/"
  },
  {
    "text": "What Is Usha Vance Thinking?  —  The veep candidate's wife is the child of immigrants, a former Democrat, a highly skilled lawyer — and a total mystery.  —  In the fall of 2018, during the convulsive, unformed days after Christine Blasey Ford went public to accuse Brett Kavanaugh of sexual assault … ",
    "url": "https://www.thecut.com/article/usha-vance-trump-jd-vance-interview.html"
  },
  {
    "text": "'There's People That Are Absolutely Ready to Take on a Civil War'  —  Tucker Carlson's eyes narrowed as he conjured the image.  A Donald Trump victory, he said at a campaign event in Gwinnett County, Georgia, last night, “will be a middle finger wagging in the face of the worst people in the English-speaking world.”",
    "url": "https://www.theatlantic.com/politics/archive/2024/10/trump-duluth-georgia-rally/680354/"
  },
  {
    "text": "Trump Goes All In on Anti-Trans  —  IS IT THE ECONOMY STUPID?  Not for Donald Trump's presidential campaign.  These days, its closing message on TV may as well be “it's the trans, you fools.”  —  In the past five weeks, Trump's operation has spent more than $29 million … ",
    "url": "https://www.thebulwark.com/p/trump-goes-all-in-on-anti-trans"
  },
  {
    "text": "GOP maps out agenda for Trump's first 100 days  —  Senate and House Republicans are setting the table for what they hope — and increasingly expect — will be unified GOP control of the White House and Congress after the election.  —  Republican leaders in both chambers are mapping out an agenda … ",
    "url": "https://thehill.com/homenews/senate/4950270-republicans-agenda-trump-tax-cuts/"
  },
  {
    "text": "Obama, Springsteen join Harris to energize campaign's final sprint  —  In final days of tumultuous race, Democrats deploy star power in effort to motivate uncertain voters",
    "url": "https://www.washingtonpost.com/politics/2024/10/24/harris-obama-perry-springsteen/"
  },
  {
    "text": "Trump ignored disaster aid request from political rival … In early September 2020, wildfires tore through eastern Washington state, obliterating tens of millions of dollars of property, displacing hundreds of rural residents and killing a 1-year-old boy.  —  But then-President Donald Trump refused … ",
    "url": "https://www.eenews.net/articles/trump-ignored-disaster-aid-request-from-political-rival/"
  },
  {
    "text": "Without Knowledge or Consent  —  For years, America's most iconic gun-makers turned over sensitive personal information on hundreds of thousands of customers to political operatives.  —  Those operatives, in turn, secretly employed the details to rally firearm owners to elect pro-gun politicians running … ",
    "url": "https://www.propublica.org/article/gunmakers-owners-sensitive-personal-information-glock-remington-nssf"
  }
]