[
  {
    "text": "Trump's Detroit rally beset by audio problems  —  For nearly 20 minutes, Trump's audio didn't work — the second time this week one of his rallies has gone off the rails.  —  “Hello,” Donald Trump said to a packed house gathered to hear him speak.  —  The greeting came after a 17-minute audio failure … ",
    "url": "https://www.nbcnews.com/politics/2024-election/trumps-detroit-rally-beset-audio-problems-rcna176201"
  },
  {
    "text": "New evidence unsealed of how Trump's Jan. 6, 2021 rally was funded  —  Bart Jansen Josh Meyer Aysha BagchiUSA TODAY  —  WASHINGTON - A trove of new records released in the federal election-interference case against former President Donald Trump described how money was spent on Trump's … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/10/18/donald-trump-election-interference-case-new-evidence/75714784007/"
  },
  {
    "text": "More Jan. 6 Evidence That Trump Tried To Keep Hidden Is Out  —  A series of records now made public offers more insight into what Jack Smith will bring with him to Donald Trump's criminal election subversion trial.  —  LOADING  —  A four-part appendix detailing more about former President … ",
    "url": "https://www.huffpost.com/entry/more-jan-6-evidence-that-trump-tried-to-keep-hidden-is-out_n_671125ece4b0e33eefb211b9"
  },
  {
    "text": "Split-Ticket Voters Buoy Democrats in Key Senate Races  —  In the battleground state of Arizona and other important pockets of the country, polling suggests that voters backing the former president are eschewing Republican Senate candidates.  —  On matters of substance and style … ",
    "url": "https://www.nytimes.com/2024/10/19/us/politics/split-ticket-voters-trump-senate.html"
  },
  {
    "text": "Defense Secretary Tom Cotton?  Here's who could be in Trump's Cabinet.  —  Former President Donald Trump, who is in the throes of a tight campaign, has not engaged in formal conversations about a potential Cabinet.  But that hasn't stopped him from spitballing potential contenders during … ",
    "url": "https://www.politico.com/interactives/2024/potential-cabinets/trump-second-term-cabinet/"
  },
  {
    "text": "Harris mocks pro-life protesters ‘at the wrong rally’ hours before Catholic charity dinner snub  —  Harris responded to commotion in the audience at her Wisconsin rally  —  Vice President Kamala Harris didn't hold back on pro-life protesters as she talked to her supporters about expanding abortion rights … ",
    "url": "https://www.foxnews.com/politics/harris-mocks-pro-life-protesters-wrong-rally-hours-before-catholic-charity-dinner-snub"
  },
  {
    "text": "America's gullibility crisis … In the last few weeks alone:  — MAGA influencers breathlessly spread the false claim that Vice President Kamala Harris used a teleprompter during her Univision town hall, which the X algorithm then promoted in its trending topics as fact.",
    "url": "https://www.axios.com/2024/10/19/musk-ackman-election-misinformation"
  },
  {
    "text": "Exclusive: Pro-Trump group funded by Musk struggles with outreach targets, inflation of doorknocking figures  —  The political action committee funded by billionaire Elon Musk to help re-elect former U.S. President Donald Trump is struggling in some swing states to meet doorknocking goals … ",
    "url": "https://www.reuters.com/world/us/pro-trump-group-funded-by-musk-struggles-with-outreach-targets-inflation-2024-10-18/"
  },
  {
    "text": "Trump Too ‘Exhausted’ to Do Interviews With Unfriendly Outlets  —  Could Donald Trump — the man who memorably branded Jeb Bush “low energy,” claimed Hillary Clinton lacked the “stamina” to be president, and spent much of the current race hounding “Sleepy Joe” — finally have tuckered himself out?",
    "url": "https://nymag.com/intelligencer/article/exhausted-trump-cancels-interviews-with-unfriendly-media.html"
  },
  {
    "text": "Defense contractor Raytheon to pay almost $1B for defrauding DOD  —  Raytheon Co., part of parent defense contractor RTX, will pay more than $950 million to resolve Justice Department allegations that it defrauded the Defense Department (DOD) and paid bribes to a government official in Qatar to get business in the country.",
    "url": "https://thehill.com/homenews/4942259-raytheon-qatar-corruption-fraud-bribes/"
  },
  {
    "text": "3 ways you can push back against election misinformation  —  Election Day 2024 is quickly approaching and misinformation about candidates, issues and election processes poses a major issue, recognized by state election boards, elected officials and advocates.",
    "url": "https://thehill.com/opinion/technology/4941143-election-misinformation-public-action/"
  },
  {
    "text": "Cher endorses Harris, Walz: ‘She is fighting for all of us’  —  Singer Cher shared her endorsement of Vice President Harris and her running mate, Minnesota Gov. Tim Walz (D), on social media Friday night, saying she's been a follower of Harris's for years.  —  “I have followed Kamala Harris since … ",
    "url": "https://thehill.com/blogs/in-the-know/4942313-cher-endorses-harris-walz/"
  },
  {
    "text": "Tom Hanks, this coffee is too cheap!  —  Welcome to POLITICO's West Wing Playbook, your guide to the people and power centers in the Biden administration and Harris campaign.  —  We here at West Wing Playbook take our work very seriously.  Each day we ask ourselves: How can we serve our readers?",
    "url": "https://www.politico.com/newsletters/west-wing-playbook/2024/10/18/tom-hanks-this-coffee-is-too-cheap-00184437"
  },
  {
    "text": "Trump Thinks the Border Got Him Elected in 2016.  He's Convinced It Will Do So Again.  —  Voters rank the economy and high cost of living as their top issue.  Donald J. Trump believes immigration “beats out the economy,” and he's made it his closing message.",
    "url": "https://www.nytimes.com/2024/10/19/us/politics/trump-immigration-closing-message.html"
  },
  {
    "text": "Secretary of State Pete Buttigieg?  Here's who could be in Harris' Cabinet.  —  If Kamala Harris wins the election, she will likely approach the task of filling out her Cabinet and West Wing much like she did when she took over Joe Biden's campaign operation this summer.",
    "url": "https://www.politico.com/interactives/2024/potential-cabinets/harris-who-could-be-in-cabinet/"
  },
  {
    "text": "Pluralistic: Blue states should play “constitutional hardball” (18 Oct 2024)  — Blue states should play “constitutional hardball”: Scooping up medical professionals, teachers, doctors and anyone with a trans kid.  — Hey look at this: Delights to delectate.  — This day in history: 2004, 2014, 2019, 2023",
    "url": "https://pluralistic.net/2024/10/18/states-rights/"
  },
  {
    "text": "Harris and Liz Cheney Will Team Up for a Pitch to Blue-Wall Suburbs  —  The vice president and her top Republican surrogate will appear together for “moderated conversations” in the suburbs of Philadelphia, Detroit and Milwaukee.  —  Vice President Kamala Harris will travel through several … ",
    "url": "https://www.nytimes.com/2024/10/19/us/politics/harris-liz-cheney.html"
  },
  {
    "text": "Democrats eye voting rights bill as first priority in House majority  —  FREEPORT, N.Y. — A top House Democrat said this week that if the party wins the majority, its first priority in the next Congress will be election integrity — an issue that's been front-and-center throughout a campaign … ",
    "url": "https://thehill.com/homenews/house/4942046-voting-rights-bill-priority-house-democrats-majority/"
  }
]