[
  {
    "text": "An ‘Administrative Error’ Sends a Maryland Father to a Salvadoran Prison  —  The Trump administration acknowledged in a court filing Monday that it had grabbed a Maryland father with protected legal status and mistakenly deported him to El Salvador, but said that U.S. courts lack jurisdiction … ",
    "url": "https://www.theatlantic.com/politics/archive/2025/03/an-administrative-error-sends-a-man-to-a-salvadoran-prison/682254/?gift=Tsjgy5hc-Y7tsZCY3EHYrWOoNzx9Xi-w5fH-zT91Z90&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "The Makeup Artist Donald Trump Deported Under the Alien Enemies Act  —  The President has invoked the law to send Venezuelans to prison in El Salvador without due process—and, in many cases, under false pretenses.  —  Throughout the fall and winter, Alexis Romero de Hernández struggled to accept a grim new routine.",
    "url": "https://www.newyorker.com/news/annals-of-immigration/the-makeup-artist-donald-trump-deported-under-the-alien-enemies-act"
  },
  {
    "text": "Trump administration admits ‘error’ in deporting Maryland resident to El Salvador  —  The Department of Justice says it has no recourse now that the man is in his home country, where he'd previously feared torture and persecution.  —  The Trump administration acknowledged late Monday … ",
    "url": "https://www.politico.com/news/2025/04/01/salvador-man-maryland-deported-mistake-00262870"
  },
  {
    "text": "Live: Speaking on Trump, Musk, and America's Moral Moment on the Senate Floor  —  Senator Cory Booker (D-NJ) has taken the Senate floor and is speaking as long as he is physically able to lift the voices of Americans who are being harmed a...",
    "url": "https://youtube.com/live/v2utlMxAwtE?feature=share"
  },
  {
    "text": "Inside Cory Booker's Plan To Disrupt ‘Business As Usual’ On The Senate Floor  —  A member of the U.S. Senate took the floor at 7:00 p.m. on Monday evening — and he doesn't plan on leaving it any time soon.  In a text message to TPM, Sen. Cory Booker (D-NJ) said he was about to begin speaking for as long as he could stand.",
    "url": "https://talkingpointsmemo.com/news/inside-cory-bookers-plan-to-disrupt-business-as-usual-on-the-senate-floor"
  },
  {
    "text": "Senate Democrat will block Trump's VA nominees to protest cuts  —  Sen. Ruben Gallego (D-Ariz.) says he will put a hold on President Trump's nominees to lead the Department of Veterans Affairs to protest cuts at the agency that provides lifelong healthcare services to military veterans.",
    "url": "https://thehill.com/homenews/senate/5225064-gallego-trump-va-nominees/"
  },
  {
    "text": "Layoffs begin at US health agencies responsible for research, tracking disease and regulating food  —  Employees across the massive U.S. Health and Human Services Department began receiving notices of dismissal on Tuesday in an overhaul ultimately expected to lay off up to 10,000 people.",
    "url": "https://apnews.com/article/health-human-services-layoffs-restructuring-rfk-jr-ec4d7731695e4204970c7eab953b2289"
  },
  {
    "text": "Thousands laid off as Kennedy and Musk take aim at health agencies  —  Overnight notices hit civil service leaders as well as the rank and file.  —  Robert F. Kennedy Jr. is making good on his promise to lay off thousands of employees across the government's health care agencies.",
    "url": "https://www.politico.com/news/2025/04/01/kennedy-lays-off-thousands-across-the-health-bureaucracy-00262913"
  },
  {
    "text": "HHS starts layoffs of thousands of workers across its agencies  —  As many as 10,000 — one-quarter of the department — are expected to be let go  —  Layoff notices began arriving early Tuesday for thousands of employees of the sprawling Department of Health and Human Services and its subsidiary agencies, with",
    "url": "https://www.statnews.com/2025/04/01/hhs-layoffs-start-under-rfk-jr-trump-administration/"
  },
  {
    "text": "D-Day for Musk: Democrats in Special Elections Target Trump's DOGE Chief  —  Special Elections Reveal Trump's Weak Spot: Elon Musk  —  DAYTONA BEACH, Fla. — Trumpeting new tariffs he hopes will return industry to America, President Donald Trump has called April 2 “Liberation Day.”",
    "url": "https://www.politico.com/news/magazine/2025/04/01/special-elections-elon-musk-trump-weakness-00262007"
  },
  {
    "text": "4/1/25 ☀️ AM: … President Donald Trump is on the brink of levying a sweeping set of new tariffs against an unidentified number of countries.  Trump's actions are rattling financial markets, business leaders and foreign officials.  —  Now House and Senate Republicans are beginning … ",
    "url": "https://punchbowl.news/archive/4125-am/"
  },
  {
    "text": "DOGE Is Trying to Gift Itself a $500 Million Building, Court Filings Show  —  The documents reveal a DOGE affiliate is attempting to transfer the headquarters of an independent think tank, the United States Institute of Peace, to the government at no cost.  —  The DOGE-affiliated acting president … ",
    "url": "https://www.wired.com/story/doge-takes-control-usip-office-building/"
  },
  {
    "text": "Trump aides draft tariff plans as some experts warn of economic damage  —  The president's team is exploring using trillions of dollars in new import revenue for a tax dividend or refund, people familiar with the matter said.  —  White House aides have drafted a proposal to impose tariffs … ",
    "url": "https://www.washingtonpost.com/business/2025/04/01/trump-tariffs-draft-recession-projection/"
  },
  {
    "text": "Top Trump USAID Staffer Accused of Violent Outbursts, Racist Remarks  —  Ten people who knew Jeremy Lewin expressed concerns about his new position due to troubling behavior in his youth … Jeremy Lewin recently became deputy administrator for policy and programs for what's left of USAID … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-usaid-jeremy-lewin-accused-violence-racist-remarks-1235307731/"
  },
  {
    "text": "A $6 Trillion Trump Tax Increase?  —  Navarro says tariffs will raise $600 billion a year for the government, but he says this is a tax cut.  —  Click for Sound  —  Financial markets have the shakes as President Trump prepares to launch his next big tariff salvo on Wednesday.",
    "url": "https://www.wsj.com/opinion/donald-trump-tariffs-peter-navarro-6-trillion-tax-increase-2e5cc39d"
  },
  {
    "text": "As Republicans Target Colleges, Harvard Cower  —  Harvard, the wealthiest school in the world, sought compromise amid pressure to do more to combat antisemitism.  The Trump administration is examining its funding anyway.  —  The Trump administration has turned campaign promises … ",
    "url": "https://www.nytimes.com/2025/04/01/us/republicans-harvard-funding.html?unlocked_article_code=1.8U4.SCx3.HVXOQzI22jOd&smid=url-share"
  },
  {
    "text": "Control of the Wisconsin Supreme Court is at stake in race that's drawn powerful political interests  —  Majority control of the Wisconsin Supreme Court will be decided Tuesday in a race that broke records for spending and has become a proxy battle for the nation's political fights … ",
    "url": "https://apnews.com/article/wisconsin-supreme-court-elon-musk-trump-8fe006c7f8fa40b663eccd6751bada98"
  },
  {
    "text": "The Proud Boys and Militias Come to Tesla's Defense  —  After weeks of “Tesla Takedown” protests, extremist groups are showing up to back Elon Musk's beleaguered car company.  —  Over the weekend, thousands of people joined the “Tesla Takedown” protest movement at the company's showrooms across the country.",
    "url": "https://www.wired.com/story/proud-boys-and-militias-come-to-teslas-defense/"
  },
  {
    "text": "Massive layoffs, purge of leadership underway at U.S. health agencies  —  The move comes after Secretary Robert F. Kennedy Jr.'s announcement of a sweeping reduction of the Department of Health and Human Services.  —  April 1, 2025  —  The Fix  —  Analysis  —  Aaron Blake",
    "url": "https://www.washingtonpost.com/health/2025/04/01/hhs-senior-leaders-put-on-leave-nih/"
  },
  {
    "text": "The Coming Recession Will Be Self-Inflicted  —  The looming economic contraction will be unique in past-war America in that it will be the first directly caused by White House policy.  —  The US economy is plodding toward a recession, a result of the Trump administration's pursuit … ",
    "url": "https://www.bloomberg.com/opinion/articles/2025-04-01/tariffs-can-be-reversed-but-too-late-to-avoid-a-recession"
  },
  {
    "text": "Trump's “Art of the Deal” hits new hurdles  —  President Trump's global dealmaking blitz is facing new obstacles, with early optimism eclipsed by broken ceasefires, pissed-off allies and thinning patience at home and abroad.  —  Why it matters: Ten weeks isn't a long time in foreign policy.",
    "url": "https://www.axios.com/2025/04/01/trumps-deals-global-hurdles"
  },
  {
    "text": "EU readies counterstrike on Big Tech and US banks over Trump's mega tariffs  —  Brussels sees America's transatlantic trade surplus in services as its Achilles' heel.  —  BRUSSELS — It's one thing to hit Harley-Davidson motorbikes and bourbon whiskey.  It's another to go after Silicon Valley or Wall Street.",
    "url": "https://www.politico.eu/article/eu-tariffs-counter-strike-big-tech-us-banks-donald-trump/"
  }
]