[
  {
    "text": "Exclusive: Apple to pause advertising on X after Musk backs antisemitic post … - The left-leaning nonprofit Media Matters for America published a report Thursday that highlighted Apple, IBM, Amazon and Oracle as among those whose ads were shown next to far-right posts.",
    "url": "https://www.axios.com/2023/11/17/apple-twitter-x-advertising-elon-musk-antisemitism-ads"
  },
  {
    "text": "White House Condemns Elon Musk's ‘Abhorrent’ Endorsement of Antisemitism  — European Commission and IBM halt X ads, citing hate speech  — Antisemitic incidents have spiked amid Israel-Hamas war",
    "url": "https://www.bloomberg.com/news/articles/2023-11-17/white-house-hits-musk-s-abhorrent-endorsement-of-antisemitism"
  },
  {
    "text": "X Races to Contain Damage After Elon Musk Endorses Antisemitic Post  —  IBM, a major advertiser on X, has pulled its spending from the social media platform whose employees are grappling with what to tell its other advertisers, according to internal messages.",
    "url": "https://www.nytimes.com/2023/11/16/technology/elon-musk-endorses-antisemitic-post-ibm.html"
  },
  {
    "text": "Lionsgate Has Suspended All Advertising on X, Spokesman Says  —  Lions Gate Entertainment Corp. has suspended all advertising on X, effective immediately, a company spokesman said by email.  —  Lionsgate's decision to pull advertising from the social-media platform formerly known as Twitter comes … ",
    "url": "https://www.bloomberg.com/news/articles/2023-11-17/lionsgate-has-suspended-all-advertising-on-x-spokesman-says"
  },
  {
    "text": "No more ads on Elon's X, EU Commission tells staff  —  Ads on Musk-owned social media site risk causing ‘reputational damage’ to the EU, its executive says in internal note.  —  The European Commission has decided to stop advertising on social media platform X, owned by Elon Musk, over … ",
    "url": "https://www.politico.eu/article/no-more-ads-elon-musk-x-twitter-european-commission-tell-staff/"
  },
  {
    "text": "Trump says the quiet part out loud: He'll destroy democracy  —  This week, we talk about the enormous stakes for democracy in 2024, pick the person of the week and share some Thanksgiving Day pointers.  —  What caught my eye  —  Four-times-indicted former president Donald Trump declared on Truth Social … ",
    "url": "https://www.washingtonpost.com/opinions/2023/11/17/trump-2024-newsletter/"
  },
  {
    "text": "Donald Trump poses the biggest danger to the world in 2024  —  What his victory in America's election would mean  —  Enjoy more audio and podcasts on iOS or Android.  —  A shadow looms over the world.  In this week's edition we publish The World Ahead 2024, our 38th annual predictive guide … ",
    "url": "https://www.economist.com/leaders/2023/11/16/donald-trump-poses-the-biggest-danger-to-the-world-in-2024"
  },
  {
    "text": "Has Trump Gone Even Crazier?  —  Litigation under the Fourteenth Amendment is pending in 21 states to disqualify Donald Trump from the ballot on the ground that he “engaged in an insurrection” in and around January 6, 2021.  He's prevailed preliminarily in two states thus far.",
    "url": "https://washingtonmonthly.com/2023/11/17/has-trump-gone-even-crazier/"
  },
  {
    "text": "New Hampshire shows how deeply rooted Trump's fraud lies are  —  It's easy to forget, given what unfolded four years later, the extent to which Donald Trump once claimed that he'd been the victim of voter fraud when he won in 2016.  —  As was the case in 2020, his primary motivation was vanity.",
    "url": "https://www.washingtonpost.com/politics/2023/11/17/new-hampshire-poll-trump-fraud/"
  },
  {
    "text": "Chutkan denies Trump motion to strike Jan. 6 language from indictment  —  U.S. District Judge Tanya Chutkan denied a motion Friday by former President Trump to strike some language about Jan. 6 from the indictment in Special Counsel Jack Smith's case related to attempts to overturn the 2020 election.",
    "url": "https://thehill.com/regulation/court-battles/4315327-chutkan-denies-trump-motion-strike-jan-6-language-from-indictment/"
  },
  {
    "text": "CNN Airs New Tape of Trump Discussing Capitol Trip on Jan. 6  —  WON'T BACK DOWN  —  In a taped interview for ABC News reporter Jonathan Karl's book, Tired of Winning, former President Donald Trump said that if he had been allowed to go to the Capitol during the Jan. 6 insurrection … ",
    "url": "https://www.thedailybeast.com/cnn-airs-new-tape-of-trump-discussing-capitol-trip-on-jan-6"
  },
  {
    "text": "Damning Ethics Report Solves the Big George Santos Question: Where the Money Came From  —  Tucked into a footnote and two appendixes in the Ethics Committee's damning report on George Santos is the answer to one of the most puzzling and persistent questions about Santos.",
    "url": "https://www.thedailybeast.com/damning-ethics-report-solves-the-big-george-santos-question-where-the-money-came-from"
  },
  {
    "text": "'It feels like I'm not crazy.' Gardeners aren't surprised as USDA updates key map  —  Loading...  A newly updated government map has many of the nation's gardeners rushing online, Googling what new plants they can grow in their mostly warming regions.  —  It's called the U.S. Department … ",
    "url": "https://www.npr.org/2023/11/17/1213600629/-it-feels-like-im-not-crazy-gardeners-arent-surprised-as-usda-updates-key-map"
  },
  {
    "text": "Biden Faces Economic Challenges as Cost-of-Living Despair Floods TikTok  —  Economic despair dominates social media as young people fret about the cost of living.  It offers a snapshot of the challenges facing Democrats ahead of the 2024 election.  —  Look at economic data … ",
    "url": "https://www.nytimes.com/2023/11/17/business/economy/tiktok-biden-economy.html"
  },
  {
    "text": "‘Homosexuality’ is now legal in Murfreesboro, city leaders decide in response to lawsuit  —  The Murfreesboro City Council updated code prior to Oct. 28 BoroPride  — Court order tells city officials they shall not enforce enforce a code that includes ‘homosexuality’ within definition of ‘sexual conduct’",
    "url": "https://www.dnj.com/story/news/2023/11/16/boropride-aclu-wins-effort-remove-homosexuality-murfreesboro-city-code/71607166007/"
  },
  {
    "text": "Trump Adviser Stephen Miller's Legal Group Rakes in $44 Million  — America First Legal's revenue jumped 600%, tax filings show  — Group is part of a nonprofit network tied to Donald Trump … The increase came as the group, America First Legal, expanded its work filing lawsuits … ",
    "url": "https://www.bloomberg.com/news/articles/2023-11-17/stephen-miller-s-america-first-legal-group-raises-44-million"
  },
  {
    "text": "‘No Labels’ Tax Forms Reveal Execs Cashing In on 2024 Hype  —  According to tax documents obtained by The Daily Beast, the centrist group plotting a 2024 challenge is raising lots of dough, padding its leaders' paychecks. … No Labels, No Worries  —  As the centrist group No Labels gears … ",
    "url": "https://www.thedailybeast.com/no-labels-tax-forms-reveal-execs-cashing-in-on-centrist-2024-third-party-campaign-hype"
  },
  {
    "text": "Israel's Ludicrous Propaganda Wins Over the Only Audience That Counts  —  Why make an effort to be credible if you're going to be uncritically echoed by White House and the Western press?  —  Pocket  —  On November 11, an Arabic-language Twitter account maintained by Israel's Ministry … ",
    "url": "https://www.thenation.com/article/world/israel-gaza-propaganda-biden/"
  },
  {
    "text": "2 Michigan lawmakers trapped as police clash with pro-Palestinian protesters in D.C.  —  Washington ― Michigan Democratic U.S. Reps. Debbie Dingell and Hillary Scholten were briefly trapped with other lawmakers inside a Democratic National Committee building on Capitol Hill … ",
    "url": "https://www.detroitnews.com/story/news/politics/2023/11/16/police-clash-with-pro-palestinian-protesters-blocking-dnc-headquarters/71601487007/"
  },
  {
    "text": "Speaker Johnson to make all Jan. 6 tapes available to public ‘immediately’  —  Speaker Mike Johnson (R-LA) will make all surveillance footage of the Jan. 6 Capitol riot available for the public to access online starting “immediately,” the House leader announced Friday.",
    "url": "https://www.washingtonexaminer.com/news/house/speaker-mike-johnson-make-all-jan-6-tapes-available"
  },
  {
    "text": "List of Open Title VI Shared Ancestry Investigations  —  Protecting Students > Race, Color, or National Origin Discrimination > Issues >>  —  As a public service, the Office for Civil Rights (OCR) publishes this list of elementary-secondary and post-secondary institutions … ",
    "url": "https://www2.ed.gov/about/offices/list/ocr/sharedancestry-list.html"
  },
  {
    "text": "As the NRA fades, a more zealous US pro-gun group rises as a lobbying power  —  Gun Owners of America, formed in belief NRA was ‘too liberal’, spent $3.3m lobbying against gun control and boasts 2m members  —  A zealous gun rights group, even more uncompromising than the once formidable … ",
    "url": "https://www.theguardian.com/us-news/2023/nov/17/pro-gun-owners-america-goa-nra"
  },
  {
    "text": "Pro-Palestinian protesters enter Fox News building  —  A group of protesters supporting Palestine reportedly entered the News Corp building, which houses Fox News's headquarters, Friday morning in New York City.  —  NBC News reported protesters were in the lobby chanting “Fox News, Fox News … ",
    "url": "https://thehill.com/policy/international/4315151-pro-palestinian-protesters-enter-fox-news-building/"
  },
  {
    "text": "Georgia Judge in Trump RICO Case Slaps Protective Order on Subpoenaed 2020 Election Records  —  Trump co-defendant Harrison Floyd subpoenaed Georgia election records and those that are confidential and privileged cannot be made public  —  JWPlayer  —  ATLANTA - Fulton County Superior Court … ",
    "url": "https://themessenger.com/politics/georgia-judge-trump-rico-protective-election-records"
  }
]