[
  {
    "text": "Two-thirds of the DOJ unit defending Trump policies in court have quit  —  The U.S. Justice Department unit charged with defending against legal challenges to signature Trump administration policies - such as restricting birthright citizenship and slashing funding to Harvard University … ",
    "url": "https://www.reuters.com/legal/litigation/two-thirds-doj-unit-defending-trump-policies-court-have-quit-2025-07-14/"
  },
  {
    "text": "3 ways Trump might try to defuse the Epstein mess  —  President Trump isn't ready to course-correct over how his administration has handled the Jeffrey Epstein evidence.  — But officials and advisers are considering at least three ways Trump could try to defuse an issue that … ",
    "url": "https://www.axios.com/2025/07/14/trump-epstein-maga-defuse-mess"
  },
  {
    "text": "Tucker Carlson leads MAGA's worried warriors in questioning Trump  —  The former Fox News host and “America First” leader spoke with NBC News as MAGA influencers rebel over amnesty, Iran and the Epstein files.  —  As President Donald Trump weighed U.S. involvement in the conflict between Israel … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/tucker-carlson-maga-trump-rcna217473"
  },
  {
    "text": "Playbook: Trump's Epstein headache isn't going away  —  With help from Eli Okun, Bethany Irvine and Ali Bianco  —  Good Monday morning.  It's Adam Wren in the seat on what is shaping up to be a newsy week.  Let's get to it.  Get in touch.  —  In today's Playbook ...",
    "url": "https://www.politico.com/newsletters/playbook/2025/07/14/trumps-epstein-headache-isnt-going-away-00450756"
  },
  {
    "text": "Trump to announce “aggressive” Ukraine weapons plan  —  President Trump will announce a new plan to arm Ukraine on Monday that is expected to include offensive weapons, two sources with knowledge of the plans tell Axios. … - U.S., Ukrainian and European officials hope the weapons will shift … ",
    "url": "https://www.axios.com/2025/07/14/trump-ukraine-weapons-missiles-russia"
  },
  {
    "text": "The Young GOPer Behind “Alligator Alcatraz” Is the Dark Future of MAGA  —  The other day, Stephen Miller went on Fox News and offered a plea that got surprisingly little attention given its highly toxic and unnerving implications.  Miller urged politicians in GOP-run states to build their own versions of … ",
    "url": "https://newrepublic.com/article/197899/james-uthmeier-florida-alligator-alcatraz-maga-dark-future"
  },
  {
    "text": "Biden Says He Made the Clemency Decisions That Were Recorded With Autopen … Toward the end of his term as president, Joseph R. Biden Jr. reduced the sentences of nearly 4,000 federal convicts and pre-emptively pardoned dozens of politically prominent people he saw as potential targets … ",
    "url": "https://www.nytimes.com/2025/07/13/us/politics/biden-pardon-autopen-trump.html"
  },
  {
    "text": "Why Gov. Greg Abbott Won't Release His Emails With Elon Musk  —  We asked Abbott for his and his staff's emails with Elon Musk and Musk's companies.  The governor's office won't turn them over, saying some contain “intimate and embarrassing” information that is “not of legitimate concern to the public.”",
    "url": "https://www.propublica.org/article/texas-governor-greg-abbott-elon-musk-emails-foia"
  },
  {
    "text": "MAGA media's conspiracy theories put Trump in power — and now they're coming back to bite him  —  The conspiracy-soaked culture that propelled President Donald Trump to political power is now coming for him.  —  Some of the most influential voices in right-wing media are rejecting Trump's call … ",
    "url": "https://cnn.com/2025/07/14/media/trump-maga-media-epstein-files-conspiracy-bondi"
  },
  {
    "text": "EU warns Trump's 30% tariffs would eliminate transatlantic trade  —  Bloc's trade commissioner Maroš Šefčovič issues caution as ministers meet to consider retaliatory measures against US  —  Trade between the EU and US will be “almost impossible” … ",
    "url": "https://www.ft.com/content/2a1522b3-e515-488b-874a-e1d7eb8d9ecc"
  },
  {
    "text": "Chelsea put on show in Club World Cup final — only to have Trump steal their moment  —  EAST RUTHERFORD, N.J. — Chelsea star Cole Palmer was like much of the world wondering why President Donald Trump was obliviously standing in the middle of their trophy celebration after winning the FIFA Club World Cup.",
    "url": "https://www.usatoday.com/story/sports/soccer/2025/07/13/trump-chelsea-club-world-cup-trophy-celebration/85173092007/"
  },
  {
    "text": "Democrat demands House vote on ‘FULL Epstein files’ release  —  Rep. Ro Khanna (D-Calif.) is calling on House Republicans to hold a vote demanding the Trump administration release the “FULL Epstein files.”  —  “Why are the Epstein files still hidden?  Who are the rich & powerful being protected?”",
    "url": "https://thehill.com/homenews/house/5399532-epstein-files-trump-bondi-khanna/"
  },
  {
    "text": "Obama's blunt message for Democrats: ‘Toughen up’  —  Former President Barack Obama issued a call to action for Democrats at a private fundraiser in New Jersey on Friday evening, urging those frustrated by the state of the country under President Donald Trump to “stand up for the things that you think are right.”",
    "url": "https://cnn.com/2025/07/14/politics/obama-democrats-message"
  },
  {
    "text": "EXCLUSIVE: Jeffery Epstein's accomplice Ghislaine Maxwell is ready to reveal ‘truth’ of the pedophile client list, say insiders.  So, why are Republicans blocking her?  —  Ghislaine Maxwell is willing to speak in front of Congress about The Epstein Files, sources tell Daily Mail.",
    "url": "https://www.dailymail.co.uk/news/article-14901591/Jeffery-Epstein-Ghislaine-Maxwell-trump-congress.html"
  },
  {
    "text": "The markets are signalling a clear winner in the Middle East  —  Israel's stunning stock rally suggests the country is cementing its status as the regional economic superpower … Since the October 7 2023 attacks on Israel, the best-performing major stock market in the world is . . . Israel.",
    "url": "https://www.ft.com/content/78b2d760-f90a-4349-b9f7-aab8b19f7b6f"
  },
  {
    "text": "NYC Immigration Arrests Just Shot Through the Roof, New Data Shows  —  Immigration arrests in and around New York City have rapidly accelerated in recent weeks, according to a new analysis by THE CITY of federal records provided by the Deportation Data Project.",
    "url": "https://www.thecity.nyc/2025/07/14/ice-migrant-arrests-trump-administration-deportations-data/"
  },
  {
    "text": "Trump's megabill is creating a budget nightmare for states … “We don't put these budgets together that have a lot of fluff and rainy day funds that are easily accessible,” said Democratic Kansas Gov. Laura Kelly, who chairs the Democratic Governors Association.",
    "url": "https://www.politico.com/news/2025/07/14/trump-megabill-budget-nightmare-states-00449924"
  },
  {
    "text": "Bondi Fires Her Personal Ethics Chief as DOJ Purge Continues  —  Attorney General Pam Bondi has fired her personal ethics adviser, removing the Justice Department's top official responsible for counseling the most senior political appointees, according to two people familiar with the move.",
    "url": "https://news.bloomberglaw.com/us-law-week/bondi-fires-her-personal-ethics-chief-as-doj-purge-continues"
  },
  {
    "text": "House Democrat floats radical solution to Congress' age problem  —  Rep. Marie Gluesenkamp Perez is proposing something unprecedented: Having Congress' ethics office effectively adjudicate whether lawmakers are too cognitively impaired to do their jobs.",
    "url": "https://www.axios.com/2025/07/14/congress-age-mental-marie-gluesenkamp-perez"
  },
  {
    "text": "Texas just gutted free speech on college campuses.  Is your state next?  —  New laws in the Lone Star State will silence dissent and undermine faculty authority.  —  Laura Benitez is state policy manager and Jonathan Friedman is Sy Syms managing director for PEN America's U.S. free expression programs.",
    "url": "https://www.washingtonpost.com/opinions/2025/07/14/texas-campus-free-speech/"
  },
  {
    "text": "Camp Mystic's leader got a ‘life threatening’ flood alert.  They evacuated an hour later. … Camp Mystic Executive Director Richard “Dick” Eastland did not begin to evacuate the young campers asleep in cabins near the rapidly rising Guadalupe River for more than an hour after he received … ",
    "url": "https://www.washingtonpost.com/nation/interactive/2025/camp-mystic-alerts-texas-floods/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzUyNDY1NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzUzODQ3OTk5LCJpYXQiOjE3NTI0NjU2MDAsImp0aSI6ImEzNGQ1YmI0LTU3MGEtNDhiNi05MjgxLTc2OWE5MTQ0N2FjNyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb24vaW50ZXJhY3RpdmUvMjAyNS9jYW1wLW15c3RpYy1hbGVydHMtdGV4YXMtZmxvb2RzLyJ9.93Km1lh5WJveP02Liqa4tIDowgypIqujlKs8ktfMlEI&itid=gfta"
  },
  {
    "text": "Gov. Hobbs demands inquiry into federal response that led to Grand Canyon Lodge fire  — The Dragon Bravo Fire, sparked by lightning on July 4th, destroyed structures on the Grand Canyon's North Rim, including the historic Grand Canyon Lodge.  — Gov. Katie Hobbs questioned … ",
    "url": "https://eu.azcentral.com/story/news/local/arizona-breaking/2025/07/13/hobbs-inquiry-north-rim-fire/85145940007/"
  }
]