[
  {
    "text": "Scoop: Biden rebels in Congress see their revolt crumbling … - One shell-shocked lawmaker who was present at the meeting would offer only one word to characterize it: “Intense.”  — Another described the mood as “pretty much unanimous” that Biden has “got to step down,” adding … ",
    "url": "https://www.axios.com/2024/07/09/biden-house-democrats-withdraw-nominee"
  },
  {
    "text": "House Dems' ‘sad’ venting session yields no clear path forward on Biden's future  —  In a private Tuesday meeting, multiple House Democrats made the case for replacing the president at the top of the ticket, while House Minority Leader Hakeem Jeffries advised members to stay unified.",
    "url": "https://www.politico.com/news/2024/07/09/house-dems-vent-00167036"
  },
  {
    "text": "Poll finds Biden damaged by debate; with Harris and Clinton best positioned to win  —  Vice President Kamala Harris is now running ahead of Trump, 42 percent to 41 percent, the survey found.  —  A top Democratic pollster has a new survey showing President Joe Biden still in contention against Donald Trump … ",
    "url": "https://www.politico.com/news/2024/07/09/biden-clinton-harris-democrat-poll-00166937"
  },
  {
    "text": "Kamala Harris beats Donald Trump, new poll shows, performs better than Joe Biden  —  WASHINGTON — Vice President Kamala Harris could narrowly beat Donald Trump in November, according to a new national poll from a Democratic pollster.  —  Harris is ahead by 1 point in the poll conducted … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/07/09/harris-beat-trump-poll-biden/74333759007/"
  },
  {
    "text": "July 2024 National Poll: Trump 46%, Biden 43%  —  Home Polls July 2024 National Poll: Trump 46%, Biden 43%  —  The latest Emerson College Polling survey finds former President Donald Trump leading President Joe Biden in a national matchup, 46% to 43%; 11% are undecided.",
    "url": "https://emersoncollegepolling.com/july-2024-national-poll-trump-46-biden-43/"
  },
  {
    "text": "The Democratic Party Must Speak the Plain Truth to the President  —  For voters who held out hope that President Biden's failure to communicate during last month's debate was an aberration, the intervening days have offered little comfort.  —  Donald Trump's candidacy for a second term poses a grave threat to American democracy.",
    "url": "https://www.nytimes.com/2024/07/08/opinion/editorials/democrats-biden-truth.html"
  },
  {
    "text": "The Biden-Parkinson's mini-controversy, explained  —  One effect of Biden's poor debate performance?  New eagerness to uncover evidence of Biden's physical failings.  —  For some time, there had been little question that the White House was taking steps to protect President Biden from scrutiny.",
    "url": "https://www.washingtonpost.com/politics/2024/07/09/biden-debate-physical-issues/"
  },
  {
    "text": "How Biden's Inner Circle Worked to Keep Signs of Aging Under Wraps  —  Aides kept a tight rein on the president's travel plans, news conferences, public appearances and meetings with donors while Biden's stumbles became increasingly obvious",
    "url": "https://www.wsj.com/politics/policy/joe-biden-age-public-election-campaign-343a47bf"
  },
  {
    "text": "The media has been breathlessly attacking Biden.  What about Trump?  —  The bigger story is Donald Trump's appalling unfitness for office.  He tried to overturn a legitimate election and is a felon  —  It's possible for two conflicting ideas to be true at once.",
    "url": "https://www.theguardian.com/commentisfree/article/2024/jul/09/biden-media-attacks-trump-felon"
  },
  {
    "text": "The Double Standard in Trump-Biden Coverage  —  It's real, and it's not going anywhere.  —  After President Joe Biden's disastrous recent public appearances, he and his supporters are attacking media outlets for a double standard in coverage of him and his opponent.",
    "url": "https://www.theatlantic.com/newsletters/archive/2024/07/the-double-standard-in-trump-biden-coverage/678943/"
  },
  {
    "text": "Navy sailor tried to access Biden's medical records multiple times  —  A junior Navy sailor attempted to access the medical records of President Biden from a military medical database three times in February but was unable to do so, the U.S. Navy confirms to CBS News.",
    "url": "https://www.cbsnews.com/news/navy-sailor-tries-to-access-biden-medical-records/"
  },
  {
    "text": "J.D. Vance Has a Problem on His Face  —  J.D. VANCE IS THE BEST BET on the predictive markets to be Donald Trump's running mate.  But an only-in-MAGAville issue might stand in the Ohio Republican's way: facial hair.  —  “J.D. has a beard.  But Trump is a clean-shaven guy.",
    "url": "https://www.thebulwark.com/p/jd-vance-has-a-problem-on-his-face"
  },
  {
    "text": "House Freedom Caucus braces for an internal brawl  —  The leadership-bucking House Freedom Caucus is facing a watershed moment, as several internal clashes risk ripping the group apart.  The intense flare-up centers around the Monday night ouster of Rep. Warren Davidson (R-Ohio) … ",
    "url": "https://www.politico.com/live-updates/2024/07/09/congress/inside-the-freedom-caucus-blow-up-00167077"
  },
  {
    "text": "The alarming new power Trump will claim in a second term  —  Donald Trump says that if he returns to the White House in 2025, he will have the power to effectively cancel any federal program — or even an entire agency — by refusing to spend money appropriated by Congress.",
    "url": "https://popular.info/p/the-alarming-new-power-trump-will"
  },
  {
    "text": "Russian Missile Identified in Kyiv Children's Hospital Attack  —  An analysis of open source evidence, as well as missile experts, have pointed to a Russian launched Kh-101 cruise missile being the weapon that struck a children's hospital in Kyiv, debunking claims from pro-Russian accounts … ",
    "url": "https://www.bellingcat.com/news/2024/07/09/russian-missile-identified-in-kyiv-childrens-hospital-attack/"
  },
  {
    "text": "A Dangerous Double Standard  —  All our energies must go to defeating Trump  —  What a weekend.  You know I have seen some things in my seven decades covering American politics.  I have never seen anything quite like the wrangling, hand-wringing, and behind-the-scenes gamesmanship currently swirling around President Biden.",
    "url": "https://steady.substack.com/p/a-dangerous-double-standard"
  },
  {
    "text": "Marla Maples Is Reportedly Ready to Throw Her Hat in the Trump VP Ring  —  ALL IS FORGIVEN  —  The former president's second wife opened up on her relationship with Trump and 2024 in a new interview, and sources tell the Evening Standard she's ready to join the veepstakes.",
    "url": "https://www.thedailybeast.com/marla-maples-is-reportedly-ready-to-throw-her-hat-in-the-trump-vp-ring"
  },
  {
    "text": "Trump plans to block hearings in January 6 case before 2024 election  —  Lawyers for ex-president preparing to shut down possibility of high-profile officials testifying at evidentiary hearings  —  Donald Trump is expected to launch a new legal battle to suppress any damaging evidence … ",
    "url": "https://www.theguardian.com/us-news/article/2024/jul/09/trump-january-6-witnesses-election"
  }
]