[
  {
    "text": "Playbook: What Obama and Pelosi are doing about Biden  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  This morning, we have a look at how, at a moment of unprecedented crisis for the Democratic Party, two of its most powerful and popular personalities … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/07/11/what-obama-and-pelosi-are-doing-about-biden-00167520"
  },
  {
    "text": "The Bonfire of the Democrats  —  We were really hoping to make today's newsletter squarely about the implications of the Law of the Sea Treaty but, you know, this Biden storyline!  And so, we've decided to dutifully keep covering it, with a mix of some fresh reporting, exclusive focus group data … ",
    "url": "https://www.thebulwark.com/p/the-bonfire-of-the-democrats"
  },
  {
    "text": "Democratic Sen. Peter Welch: Biden should withdraw for the good of the country  —  The stakes this November could not be higher.  —  Peter Welch, a Democrat, represents Vermont in the U.S. Senate.  —  I have great respect for President Biden.  He saved our country from a tyrant.",
    "url": "https://www.washingtonpost.com/opinions/2024/07/10/welch-biden-withdraw/"
  },
  {
    "text": "What Obama and Pelosi are doing about Biden  —  Two of the party's most prominent figures have served as sounding boards for people seeking to push the president aside.  —  Two of the Democratic Party's most powerful and popular personalities have assumed quiet, behind-the scenes roles … ",
    "url": "https://www.politico.com/news/2024/07/11/obama-pelosi-democratic-party-biden-00167522"
  },
  {
    "text": "Most Democrats want Biden to drop out, but overall race is static, poll finds  —  More than half of Democrats say Biden should end his candidacy.  Overall, 2 in 3 adults say the president should step aside, including more than 7 in 10 independents.  —  Most Democrats nationwide … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/11/poll-biden-drop-out-election/"
  },
  {
    "text": "Democrats Turn to Their Deputy Leader  —  Influential Democrats see an urgent need to bolster Vice President Kamala Harris's position with the public, whether or not President Joe Biden withdraws from the presidential contest.  If Biden leaves the race, which appears less likely as he digs … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/07/biden-campaign-kamala-harris/678963/"
  },
  {
    "text": "Democratic Michigan congresswoman joins calls for Biden to ‘step aside’ as nominee  —  Washington ― West Michigan U.S. Rep. Hillary Scholten on Thursday called on President Joe Biden to “step aside” as the Democratic nominee for president “for the good of our democracy,” … ",
    "url": "https://www.detroitnews.com/story/news/politics/2024/07/11/michigan-congresswoman-hillary-scholten-joins-calls-for-joe-biden-to-step-aside-as-president-nominee/74361776007/"
  },
  {
    "text": "Scoop: Schumer open to dumping Biden in 2024 … - Over the last 12 days, Schumer has been listening to donors' ideas and suggestions about the best way forward for the party, according to three people familiar with the matter.  — The majority leader is one of several Democrats … ",
    "url": "https://www.axios.com/2024/07/10/schumer-biden-dump-donors-2024-election"
  },
  {
    "text": "Trump's Lead Just Got Scarier—but This Dem Still Sees a Path for Biden  —  With President Biden forcefully declaring that he isn't leaving the presidential race, the latest polling looks frightening.  The Cook Political Report just released new polling averages showing Donald Trump leading Biden nationally by three points.",
    "url": "https://newrepublic.com/article/183675/trumps-lead-just-got-scarierbut-dem-still-sees-path-biden"
  },
  {
    "text": "The Night President Biden Lost George Clooney's Support  —  Hollywood fundraiser meant to turbocharge the president's re-election bid was the beginning of the end for one of his staunchest supporters  —  Less than four weeks ago, George Clooney stood on a stage in downtown Los Angeles … ",
    "url": "https://www.wsj.com/politics/elections/the-night-president-biden-lost-george-clooneys-support-4bd459d5"
  },
  {
    "text": "Is Unfit to Lead Donald Trump Is Unfit to Lead  —  The editorial board is a group of opinion journalists  —  Next week, for the third time in eight years, Donald Trump will be nominated as the Republican Party's candidate for president of the United States.",
    "url": "https://www.nytimes.com/interactive/2024/07/11/opinion/editorials/donald-trump-2024-unfit.html"
  },
  {
    "text": "Trump rips Clooney over op-ed urging Biden to drop reelection bid  —  Former President Trump went after George Clooney Wednesday evening after the actor wrote an op-ed pushing for President Biden to leave the White House race.  “So now fake movie actor George Clooney, who never came close … ",
    "url": "https://thehill.com/homenews/campaign/4765706-donald-trump-george-clooney-joe-biden-withdraw-reelection-bid-2024/"
  },
  {
    "text": "Trump Is Expected to Meet With Orban, Hungary's Prime Minister, in Florida  —  The meeting would come after Prime Minister Viktor Orban, who has long been aligned with the former president, made unexpected trips to China, Russia and Ukraine.  —  Prime Minister Viktor Orban of Hungary will meet … ",
    "url": "https://www.nytimes.com/2024/07/11/us/politics/trump-orban-florida-meeting.html"
  },
  {
    "text": "Exclusive: US and Germany foiled Russian plot to assassinate CEO of arms manufacturer sending weapons to Ukraine  —  US intelligence discovered earlier this year that the Russian government planned to assassinate the chief executive of a powerful German arms manufacturer that has been producing … ",
    "url": "https://www.cnn.com/2024/07/11/politics/us-germany-foiled-russian-assassination-plot/"
  },
  {
    "text": "In a first, Republican majority on a Nevada county commission refuses to certify election  —  Three Republicans commissioners in a key Nevada swing county have refused to certify on an election recount, creating new turmoil in a community that since the 2020 election has been a hotbed for election skepticism … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/07/11/nevada-republicans-refuse-to-certify-reno-election/74352699007/"
  },
  {
    "text": "Thermonuclear Blasts and New Species: Inside Elon Musk's Plan to Colonize Mars  —  SpaceX employees are working on plans for a Martian city, including dome habitats, spacesuits and researching whether humans can procreate off Earth.  Mr. Musk has volunteered his sperm.  —  Gica Tam",
    "url": "https://www.nytimes.com/2024/07/11/technology/elon-musk-spacex-mars.html"
  },
  {
    "text": "Inflation falls 0.1% in June from prior month, helping case for lower rates … WATCH NOW  —  The monthly inflation rate dipped in June for the first time in more than four years, providing further cover for the Federal Reserve to start lowering interest rates later this year.",
    "url": "https://www.cnbc.com/2024/07/11/cpi-inflation-report-june-2024.html"
  }
]