[
  {
    "text": "MAGA speakers unleash ugly rhetoric at Trump's MSG rally … - The remarks at Trump's rally undermine his campaign's effort to soften the former president's image among voters who may like his policies but dislike his divisive and race-baiting rhetoric.",
    "url": "https://www.axios.com/2024/10/27/trump-madison-square-garden-rally"
  },
  {
    "text": "Speaker at Trump rally compares Puerto Rico to ‘island of garbage’  —  A speaker at former President Trump's Madison Square Garden rally on Sunday spent a portion of his time attacking Puerto Rico, drawing backlash from Democrats and the Harris campaign.  —  Comedian Tony Hinchcliffe … ",
    "url": "https://thehill.com/homenews/campaign/4956120-tony-hinchcliffe-kill-tony-trump-rally-puerto-rico/"
  },
  {
    "text": "Hochul says Trump's Madison Square Garden rally is a ‘white flag of surrender’  —  New York Gov. Kathy Hochul (D) said she thinks the Madison Square Garden rally former President Trump is hosting Sunday is a “white flag of surrender.”  —  “I think he's waving the white flag of surrender,” Hochul said Sunday on MSNBC's “The Weekend.”",
    "url": "https://thehill.com/homenews/campaign/4955966-hochul-trump-madison-square-garden-rally-white-flag-of-surrender/"
  },
  {
    "text": "Bad Bunny shares Kamala Harris's video on Puerto Rico on Instagram  —  Puerto Rican rapper and superstar Bad Bunny posted a video from Vice President Harris on his Instagram story Sunday.  —  In the video, Harris talks to Puerto Ricans, saying that “this election is not just a choice between Donald Trump … ",
    "url": "https://thehill.com/blogs/in-the-know/4956229-bad-bunny-kamala-harris-video-puerto-rico-instagram/"
  },
  {
    "text": "As Trump courts their vote, comedian at his rally makes racist jokes about Latinos and Puerto Rico  —  Comedian Tony Hinchcliffe made crude jokes about Latinos having babies and called Puerto Rico a “floating island of garbage.”  —  As former President Donald Trump courts the community's vote … ",
    "url": "https://www.nbcnews.com/politics/2024-election/comedian-trump-rally-makes-racist-jokes-latinos-puerto-rico-rcna177514?taid=671ebeec9303b30001fd3d81"
  },
  {
    "text": "Billionaire cowards at Washington Post, L.A. Times show what life under a dictator is really like  —  Do not obey in advance.  Most of the power of authoritarianism is freely given.  In times like these, individuals think ahead about what a repressive government will want, and then offer themselves without being asked.",
    "url": "https://www.inquirer.com/opinion/commentary/washington-post-la-times-endorsements-trump-harris-20241027.html?id=iRjwkouvkYlDw"
  },
  {
    "text": "‘Betrayal’: Marty Baron, former Washington Post editor, slams paper's non-endorsement  —  Jeff Bezos' decision to block the Washington Post's presidential endorsement has been met with a lot of strong reactions - including from the paper's own journalists and its legendary former Executive Editor Marty Baron.",
    "url": "https://www.msnbc.com/ali-velshi/watch/-betrayal-marty-baron-former-washington-post-editor-slams-paper-s-non-endorsement-222795333869"
  },
  {
    "text": "Ex-WaPo Editor: This Is a Straight Bezos-Trump ‘Quid Pro Quo’  —  DIRTY DEAL  —  Robert Kagan tells the Daily Beast that Donald Trump's meeting with Blue Origin executives the day its founder Jeff Bezos killed his paper's Kamala Harris endorsement is proof of a backroom deal.  —  EXCLUSIVE",
    "url": "https://www.thedailybeast.com/ex-washington-post-editor-robert-kagan-this-is-a-straight-jeff-bezos-donald-trump-quid-pro-quo/"
  },
  {
    "text": "Harris regains slight lead nationally yet Electoral College holds the cards: POLL  —  Harris has regained a slight lead with likely voters nationally, the poll finds.  —  Democratic presidential nominee Vice President Kamala Harris speaks at a campaign rally at James R. Hallford Stadium, Oct. 24, 2024, in Clarkston, Ga.",
    "url": "https://abcnews.go.com/Politics/harris-regains-slight-lead-nationally-electoral-college-holds/story?id=115083875"
  },
  {
    "text": "CBS News Harris-Trump poll has closer look inside gender gap as Trump, Harris draw even  —  Amid an election-defining gender gap that is now tied for the largest this year, the already close presidential race between Kamala Harris and Donald Trump has become closer still.",
    "url": "https://www.cbsnews.com/news/trump-harris-poll-gender-gap/"
  },
  {
    "text": "Four Lessons From Nine Years of Being ‘Never Trump’  —  I've been wrong about many things, but here are two of the bigger whiffs of my professional life.  —  I thought Donald Trump wouldn't find any meaningful support in the Republican Party.  I watched his strange campaign announcement … ",
    "url": "https://www.nytimes.com/2024/10/27/opinion/never-trump-maga-evangelicals.html?unlocked_article_code=1.VU4.7iHw.z7LMXQQYw6l9&smid=url-share"
  },
  {
    "text": "More than 1,000 faith leaders endorse Harris as vice president leans on her faith to turn out Black voters  —  More than a thousand religious leaders endorsed Kamala Harris on Sunday, bolstering the Democratic presidential nominee's push to emphasize how faith is informing her campaign ahead of next week's election.",
    "url": "https://www.cnn.com/2024/10/27/politics/faith-leaders-harris-endorsement/"
  },
  {
    "text": "The Media Started Capitulating to Trump with Russia Russia Russia  —  I took a few days to go wander around Paris.  —  In the meantime (as Nicole and I discussed on Friday), the WaPo has subjugated itself to Donald Trump by spiking an endorsement of Kamala Harris.",
    "url": "https://www.emptywheel.net/2024/10/27/the-media-started-capitulating-to-trump-with-russia-russia-russia/"
  },
  {
    "text": "Advisers Propose That Trump Give Security Clearances Without F.B.I. Vetting  —  A memo circulating in Donald Trump's orbit says that if elected he should use private firms to check appointees' backgrounds and give them immediate access to classified secrets after taking office.",
    "url": "https://www.nytimes.com/2024/10/27/us/politics/trump-security-clearances-fbi.html?unlocked_article_code=1.VU4.Fs3b.zE89AY4g-3Nz&smid=url-share"
  },
  {
    "text": "Republican battleground-state legal blitz falters ahead of election  —  Donald Trump's Republican allies have suffered a string of courtroom setbacks in battleground U.S. presidential election states as Election Day draws closer, losses which could boost voter turnout and speed certification of the eventual winner.",
    "url": "https://www.reuters.com/world/us/republican-battleground-state-legal-blitz-falters-ahead-us-presidential-election-2024-10-27/"
  },
  {
    "text": "‘Yes, I was in a cult’: J6 rioter backing Harris after admitting being ‘all in with MAGA’  —  As part of interviews with three Donald Trump supporters who headed off to Washington, D.C. to attend the post-election “Stop the Steal” rally, one woman called it the biggest mistake of her life … ",
    "url": "https://www.rawstory.com/jan-6-cult-2669490142/"
  },
  {
    "text": "I am my own legal department: the promise and peril of “just go independent”  —  Listen to a voiceover of this post, subscribe to the feed in your podcast app, or download the recording for later.  —  When a major legacy news publication does something controversial, I sometimes hear my name.",
    "url": "https://www.citationneeded.news/i-am-my-own-legal-department/"
  },
  {
    "text": "Donald Trump Will Never Be Done With New York  —  Sunday's rally at Madison Square Garden, the self-styled “world's most famous arena,” is a remarkable gambit, even by the former president's standards — and a show of force.  —  The seven-decade marriage between Donald J. Trump and New York City … ",
    "url": "https://www.nytimes.com/2024/10/27/us/politics/trump-new-york-msg.html"
  },
  {
    "text": "Donald Trump's Dogwhistles Are Unmistakable  —  When someone attacks the messenger rather than the message, they're usually revealing something.  —  Friday night in Austin, Texas, the Republican presidential nominee, Donald Trump, fiercely criticized The Atlantic's editor in chief … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/10/trump-attacks-atlantics-jeffrey-goldberg-over-hitler/680422/"
  },
  {
    "text": "Biden calls out Musk over a published report that the Tesla CEO once worked in the US illegally  —  President Joe Biden slammed Elon Musk for hypocrisy on immigration after a published report that the Tesla CEO once worked illegally in the United States.  The South Africa-born Musk denies the allegation.",
    "url": "https://apnews.com/article/biden-elon-musk-student-visa-work-fbd836b3de358148cda16c273ff904c4"
  },
  {
    "text": "Amid Talk of Fascism, Trump's Threats and Language Evoke a Grim Past … Former President Donald J. Trump at a rally in Las Vegas on Thursday.Kenny Holston/The New York Times  —  When former President Donald J. Trump's longest serving chief of staff said the other day that his old boss … ",
    "url": "https://www.nytimes.com/2024/10/27/us/politics/trump-fascism.html?unlocked_article_code=1.VU4.Pw9_.1CnxL7Iw_s9e&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Harris keeps Biden at a distance in the final stretch … - It's the latest example of Democrats, and even some of Biden's staff, tiptoeing around the 81-year-old president's ego and feelings.  — One person familiar with the situation compared it to a slow-moving break-up … ",
    "url": "https://www.axios.com/2024/10/27/harris-biden-distance-campaign"
  }
]