[
  {
    "text": "SCOTUS pushes Trump immunity decision to after debate … - Trump's two federal cases — one on his alleged efforts to undermine the results of the 2020 election and the other on his handling of classified documents after his time in the White House — hinge on the court's decision.",
    "url": "https://www.axios.com/2024/06/27/trump-immunity-decision-deabte-scotus"
  },
  {
    "text": "Watch?  Cringe?  Abstain?  All about tonight's high-stakes debate  —  Although a lot of people are adamant that they have no intention of looking in on tonight's presidential debate, I have a feeling they'll change their minds when 9 p.m. rolls around.  The Associated Press reported … ",
    "url": "https://margaretsullivan.substack.com/p/watch-cringe-abstain-all-about-tonights"
  },
  {
    "text": "Supreme Court allows emergency abortion access in Idaho for now  —  The decision is a temporary win for the Biden administration.  —  The Supreme Court, June 26, 2024, in Washington, D.C.  —  The Supreme Court on Thursday issued a ruling that will allow emergency abortion access in Idaho … ",
    "url": "https://abcnews.go.com/Politics/supreme-court-allows-emergency-abortion-access-idaho-now/story?id=111458290"
  },
  {
    "text": "Supreme Court Blocks EPA ‘Good Neighbor’ Ozone Emission Rule  — Delay of rule implementation during court cases may be lengthy  — Suit over rule was brought by Ohio, Indiana and West Virginia  —  The US Supreme Court blocked for the foreseeable a Biden administration rule … ",
    "url": "https://www.bloomberg.com/news/articles/2024-06-27/supreme-court-blocks-epa-s-good-neighbor-ozone-emissions-rule"
  },
  {
    "text": "Supreme Court blocks EPA's interstate air pollution regulation  —  The Environmental Protection Agency's “good neighbor” rule is aimed at reducing air pollution that crosses state lines and contributes to smog.  —  WASHINGTON — The Supreme Court on Thursday blocked a Biden administration … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-blocks-epas-interstate-air-pollution-reg-rcna141387"
  },
  {
    "text": "Scoop: Biden seizes debate limelight for “Project 2025” push … - The Trump campaign points instead to the Agenda47 website for policies explicitly endorsed by former President Trump. … - Google search interest in “Project 2025” surged earlier this month, and a John Oliver segment … ",
    "url": "https://www.axios.com/2024/06/27/biden-project-2025-trump-debate"
  },
  {
    "text": "Trump allies' 920 page plan to give Trump more power over your daily life, gut democratic checks and balances, and consolidate power in the Oval office.  —  Project 2025 is the plan by Donald Trump's MAGA Republican allies to give Trump more power over your daily life, gut democratic checks and balances … ",
    "url": "https://joebiden.com/project2025/"
  },
  {
    "text": "Debate day brings bad news for Biden  —  DEBATE DAY BRINGS BAD NEWS FOR BIDEN.  It's only natural for pollsters and other political professionals to try to take the public's temperature about a presidential race right before a big debate.  The debate might have little effect on the race … ",
    "url": "https://www.washingtonexaminer.com/daily-memo/3061070/debate-day-brings-bad-news-for-biden/"
  },
  {
    "text": "The Supreme Court strips the SEC of a critical enforcement tool in fraud cases  —  The Supreme Court on Thursday stripped the Securities and Exchange Commission of a major tool in fighting securities fraud in a decision that also could have far-reaching effects on other regulatory agencies.",
    "url": "https://apnews.com/article/supreme-court-regulatory-agencies-sec-36f16444b1d4fc52985fdb68896362bb"
  },
  {
    "text": "The Supreme Court rules that state officials can engage in a little corruption, as a treat  —  On a 6-3 party-line vote, the Supreme Court ruled on Wednesday that state officials may accept “gratuities” from people who wish to reward them for their official actions, despite a federal anti-corruption statute … ",
    "url": "https://www.vox.com/scotus/357170/supreme-court-snyder-united-states-corruption"
  },
  {
    "text": "Exclusive: Michelle Obama's private frustration with the Bidens … - Michelle Obama also was initially reluctant to campaign for Biden after he became the Democratic nominee in 2020, people familiar with the situation told Axios.  — Biden's team says the relationship between the families is strong … ",
    "url": "https://www.axios.com/2024/06/27/michelle-obama-private-frustration-bidens-2024-election"
  },
  {
    "text": "Supreme Court blocks Purdue Pharma opioid settlement  —  The justices ruled that a bankruptcy judge did not have the authority to let members of Sackler family evade facing future lawsuits.  —  WASHINGTON — The Supreme Court on Thursday blew up the massive bankruptcy reorganization … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-blocks-purdue-pharma-opioid-settlement-rcna139066"
  },
  {
    "text": "25+ Years of Daily Show Clips Gone as Paramount Axes Comedy Central Site  —  First on LateNighter: One of the richest repositories of late-night videos is no longer.  —  ComedyCentral.com had been home to clips from every episode of The Daily Show since 1999, and the entire run of The Colbert Report … ",
    "url": "https://latenighter.com/news/paramount-axes-comedy-central-website-show-clips-library/"
  },
  {
    "text": "Kari Lake skips out on Arizona Senate GOP primary debate as she looks ahead to November  —  The frontrunner for the Republican Senate nomination held a town hall instead Wednesday night, leaving her primary opponent, Mark Lamb, alone on the stage.  —  TUCSON, Ariz. — On the eve … ",
    "url": "https://www.nbcnews.com/politics/2024-election/kari-lake-skips-arizona-senate-gop-primary-debate-rcna158055"
  },
  {
    "text": "EXCLUSIVE: VA Senate candidate says he was ‘blown up’ in combat.  His record doesn't show that.  —  Elizabeth Beyer Tom Vanden BrookUSA TODAY  —  WASHINGTON — The Republican candidate for U.S. Senate in Virginia, a decorated Navy veteran, has made repeated references to becoming disabled after he was … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/06/26/hung-cao-military-record-purple-heart/74220141007/"
  },
  {
    "text": "How right-wing media is legitimizing a nonsensical and nonexistent lawsuit  —  This is a special joint edition of Public Notice and Judd Legum's Popular Information.  You can subscribe to Popular Information here.  —  On June 20, Missouri Attorney General Andrew Bailey announced on X … ",
    "url": "https://www.publicnotice.co/p/andrew-bailey-new-york-lawsuit-trump-sinclair"
  },
  {
    "text": "What Trump And Biden Really Mean When They Fight About Electric Vehicles  —  The argument is about a lot more than Detroit and cars.  —  LOADING  —  President Joe Biden sketched out his vision for the future of America's auto industry during a visit to Detroit in late 2021.",
    "url": "https://www.huffpost.com/entry/biden-trump-auto-industry-electric-vehicle-future_n_667c6d35e4b07cb66c6c9d74"
  },
  {
    "text": "What Kind of ‘Psycho’ Calls Dead Americans ‘Losers’ and ‘Suckers’?  —  Trump's denial of his own well-documented remarks is a tell.  —  Perhaps you've noticed lately that Donald Trump, a man not known for subtlety, has been testing the limits of the Streisand effect.",
    "url": "https://www.theatlantic.com/politics/archive/2024/06/what-kind-of-psycho-calls-dead-americans-losers-and-suckers/678807/"
  }
]