[
  {
    "text": "Joe Biden Is a Good Man and a Good President.  He Must Bow Out of the Race.  —  I watched the Biden-Trump debate alone in a Lisbon hotel room, and it made me weep.  I cannot remember a more heartbreaking moment in American presidential campaign politics in my lifetime … ",
    "url": "https://www.nytimes.com/2024/06/28/opinion/joe-biden-tom-friedman.html"
  },
  {
    "text": "Biden's debate is a “DEFCON 1” moment for Democrats … - With breathtaking speed, private discussions about Biden's expected performance against Donald Trump went from optimism to shock and even questions about whether Biden could continue his campaign. … - A “disaster,” one former Biden administration official called it.",
    "url": "https://www.axios.com/2024/06/28/biden-trump-debate-defcon1-2024-election"
  },
  {
    "text": "CNN Flash Poll: Majority of debate watchers say Trump outperformed Biden  —  Registered voters who watched CNN's presidential debate between Joe Biden and Donald Trump largely think Trump outperformed Biden, according to a CNN poll of debate watchers conducted by SSRS, with most saying … ",
    "url": "https://www.cnn.com/2024/06/28/politics/debate-poll-cnn-trump-biden/"
  },
  {
    "text": "CNN fails the nation  —  The signal failure of the American media during the Trump era has been the refusal to hold Donald Trump accountable for his behavior - and, in particular, his endless lies.  —  That has never been more obvious than it was at Thursday night's presidential debate.",
    "url": "https://presswatchers.org/2024/06/cnn-fails-the-nation/"
  },
  {
    "text": "How To Process Biden's Debate Disaster  —  A lot of things happened.  Here are some of the things.  This is TPM's Morning Memo.  —  Say It Ain't So, Joe  —  I loathe theater criticism-style debate coverage, but by any standard it was a disastrous performance by President Biden.",
    "url": "https://morningmemo.talkingpointsmemo.com/p/how-to-process-bidens-debate-disaster"
  },
  {
    "text": "Biden acknowledges bad debate performance and age … - The president appeared to address some of those criticisms head-on Friday in an attempt to assuage Democrats' concerns. … - “I don't walk as easy as I used to, I don't speak as smoothly as I used to, I don't debate as well as I used to, but I know what I do know.",
    "url": "https://www.axios.com/2024/06/28/biden-debate-rally-north-carolina"
  },
  {
    "text": "The true losers of this presidential debate were the American people  —  We didn't need this show.  Each candidate has had time to show us who they are, and one is a felon trying to destroy democracy  —  The American people lost the debate last night, and it was more painful than usual … ",
    "url": "https://www.theguardian.com/commentisfree/article/2024/jun/28/debate-losers-american-people"
  },
  {
    "text": "Playbook: Democrats wake up to a nightmare  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  The mass panic among Democrats began last night about 12 minutes into the debate.  —  President JOE BIDEN was answering a question about the national debt.",
    "url": "https://www.politico.com/newsletters/playbook/2024/06/28/democrats-wake-up-to-a-nightmare-00165710"
  },
  {
    "text": "Gavin Newsom Is Ready for the Biden Emergency  —  California's governor has fundraising chops, messaging skills and the campaign infrastructure to step up.  —  When cameras captured California Governor Gavin Newsom walking into CNN's spin room on Thursday evening, flashing his Hollywood smile … ",
    "url": "https://www.bloomberg.com/opinion/articles/2024-06-28/gavin-newsom-is-a-top-democrat-to-replace-joe-biden"
  },
  {
    "text": "Supreme Court says prosecutors improperly charged hundreds of Jan. 6 rioters  —  Supreme Court's decision on obstruction charge will impact trials of hundreds of Jan. 6 rioters and, potentially, former president Donald Trump.  —  Federal prosecutors improperly charged hundreds of Jan. 6 defendants … ",
    "url": "https://www.washingtonpost.com/politics/2024/06/28/supreme-court-obstruction-jan-6-trump/"
  },
  {
    "text": "Supreme Court makes it harder to charge Capitol riot defendants with obstruction, charge Trump faces  —  The Supreme Court on Friday limited a federal obstruction law that has been used to charge hundreds of Capitol riot defendants as well as former President Donald Trump.",
    "url": "https://apnews.com/article/supreme-court-capitol-riot-obstruction-2cdba47baa5cea8177d651de751760a6"
  },
  {
    "text": "What it means for the Supreme Court to throw out Chevron decision, undercutting federal regulators  —  WASHINGTON (AP) — Executive branch agencies will likely have more difficulty regulating the environment, public health, workplace safety and other issues under a far-reaching decision by the Supreme Court.",
    "url": "https://apnews.com/article/supreme-court-chevron-regulations-environment-4ae73d5a79cabadff4da8f7e16669929"
  },
  {
    "text": "Supreme Court allows Oregon city policy targeting homeless people  —  The justices ruled that ordinances in Grants Pass do not violate the Constitution's Eighth Amendment, which bars cruel and unusual punishment.  —  WASHINGTON — The Supreme Court on Friday rejected a constitutional challenge … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-rejects-challenge-oregon-city-laws-targeting-ho-rcna153249"
  },
  {
    "text": "Johnson says Biden's Cabinet should discuss invoking 25th Amendment  —  Speaker Mike Johnson said Friday that President Joe Biden's Cabinet should discuss invoking the 25th Amendment in the wake of a politically disastrous debate that compounded age and acuity questions.",
    "url": "https://www.politico.com/live-updates/2024/06/28/congress/johnson-on-the-debate-house-gop-biden-trump-00165777"
  },
  {
    "text": "Steve Bannon must report to prison by Monday after Supreme Court rejects last-minute appeal  —  Bannon, a former Trump adviser, was convicted of contempt of Congress in July 2022 for defying subpoenas from the House Jan. 6 committee and sentenced to four months.",
    "url": "https://www.nbcnews.com/politics/supreme-court/steve-bannon-must-report-prison-monday-supreme-court-rejects-last-minu-rcna158584"
  }
]