[
  {
    "text": "Pennsylvania Governor Says Arson Attack Targeted His Residence  —  Pennsylvania Governor Josh Shapiro said his official residence in the state capital was targeted in an arson attack while he and his family were asleep early Sunday morning, forcing them to evacuate.",
    "url": "https://www.bloomberg.com/news/articles/2025-04-13/pennsylvania-s-governor-says-arsonist-set-fire-to-his-residence"
  },
  {
    "text": "Police say they are investigating an arson attack at the Pennsylvania governor's residence  —  Police said Sunday that officers evacuated Gov. Josh Shapiro and his family from the official governor's residence after someone set fire to the building.  No one was injured and the fire was extinguished, according to authorities.",
    "url": "https://apnews.com/article/josh-shapiro-arson-police-fire-pennsylvania-governor-2d17ec60c48f7d4d15123dda60c88699"
  },
  {
    "text": "Gov. Shapiro and Family Evacuated After Arson at Pennsylvania Residence  —  The governor said the State Police banged on the door early on Sunday to wake him and his family after an arsonist set fire to the governor's official residence in Harrisburg.  —  The governor of Pennsylvania … ",
    "url": "https://www.nytimes.com/2025/04/13/us/politics/josh-shapiro-arson-attack-pennsylvania.html"
  },
  {
    "text": "Commerce Secretary Lutnick says tariff exemptions for electronics are only temporary  —  Lutnick said “semiconductor tariffs” will likely come in “a month or two.”  —  Secretary of Commerce Howard Lutnick speaks with ABC News while appearing on ‘This Week’ April 13, 2025.",
    "url": "https://abcnews.go.com/Politics/commerce-secretary-lutnick-tariff-exemptions-electronics-temporary/story?id=120752319"
  },
  {
    "text": "A Devastating Trade Spat With China Shows Few Signs of Abating  —  The Trump administration is in a standoff with the Chinese government as trade tensions escalate, leaving U.S. businesses in the cross hairs  —  President Trump abruptly paused his “reciprocal” tariffs on most countries … ",
    "url": "https://www.nytimes.com/2025/04/13/us/politics/trump-tariffs-trade-war-china.html"
  },
  {
    "text": "DOGE Is Far Short of Its Goal, and Still Overstating Its Progress  —  Elon Musk now says his group will produce only 15 percent of the savings it promised.  But even that estimate is inflated with errors and guesswork.  —  Last week, Elon Musk indicated for the first time that his Department … ",
    "url": "https://www.nytimes.com/2025/04/13/us/politics/doge-contracts-savings.html?unlocked_article_code=1._U4.jxBu.wPOiLoypY3tm"
  },
  {
    "text": "Russian Attack on Sumy in Ukraine Kills and Wounds Dozens  —  The midmorning strike hit as Ukrainians were celebrating Palm Sunday, officials said.  It appeared to be the deadliest attack on civilians this year and came as the Trump administration pushes for a cease-fire.",
    "url": "https://www.nytimes.com/2025/04/13/world/europe/sumy-ukraine-russia-strikes.html?unlocked_article_code=1._U4.VfkB.I1pmjfRa_ru_&smid=url-share"
  },
  {
    "text": "American Rendition: Rümeysa Öztürk's Journey From Ph.D. Scholar to Trump Target Languishing in Louisiana Cell  — Odyssey: Rümeysa Öztürk's arrest and detention reveal what President Donald Trump's deportation campaign looks like on the street level.",
    "url": "https://www.propublica.org/article/rumeysa-ozturk-best-friend-inside-story-tufts-trump-louisiana-ice"
  },
  {
    "text": "White House releases results from President Trump's physical  —  The White House released the results of President Trump's physical on Sunday, in which the White House physician detailed that the president “remains in excellent health.”  —  “His active lifestyle continues to contribute significantly … ",
    "url": "https://www.cbsnews.com/news/trump-physical-results-white-house-release/"
  },
  {
    "text": "Trump Has Added Risk to the Surest Bet in Global Finance … Investors buy U.S. Treasury bonds on the assumption that, come what may, the federal government will endure.Jason Andrew for The New York Times  —  There are not many certainties in the world of money, but this traditionally has been one of them … ",
    "url": "https://www.nytimes.com/2025/04/13/business/trump-risk-us-bonds.html?unlocked_article_code=1._U4.ESlJ.Av0nh-7KcMqJ"
  },
  {
    "text": "Nostalgia for manufacturing will make the US poorer  —  Donald Trump's vision to onshore factory jobs reverses decades of progress  —  Welcome back.  Now that Donald Trump has paused his “reciprocal” tariff plans (as predicted in last week's newsletter), this edition will unpick … ",
    "url": "https://www.ft.com/content/845917ed-41a5-449f-946f-70263adbaeb7"
  },
  {
    "text": "How Brexit, a Startling Act of Economic Self-Harm, Foreshadowed Trump's Tariffs  —  Britain's decision to leave the European Union in 2016 was sold to voters as a magic bullet that would revitalize the country's economy.  Its impact is still reverberating.  —  Britain has watched President … ",
    "url": "https://www.nytimes.com/2025/04/13/world/europe/how-brexit-a-startling-act-of-economic-self-harm-foreshadowed-trumps-tariffs.html"
  },
  {
    "text": "Cassidy praises Kennedy for promoting measles vaccination amid outbreak  —  Sen. Bill Cassidy (R-La.) applauded Health and Human Services (HHS) Secretary Robert F. Kennedy Jr. for promoting measles vaccination amid a deadly outbreak in Texas.  —  Since the start of the spread … ",
    "url": "https://thehill.com/homenews/senate/5246512-cassidy-praises-kennedy-for-promoting-measles-vaccination-amid-outbreak/"
  },
  {
    "text": "The Trump Tariffs Just Got Even Worse  —  Higher costs, uncertainty and crony capitalism, oh my  —  So no, I'm not up in the middle of the night obsessing about tariffs.  It's mid-morning here.  Still, I didn't plan a tariff post today; Part I of my financial crisis primer will be going up in a few hours.",
    "url": "https://paulkrugman.substack.com/p/the-trump-tariffs-just-got-even-worse"
  },
  {
    "text": "Homeland Security Email Tells a US Citizen to ‘Immediately’ Self-Deport  —  An email sent by the Department of Homeland Security instructs people in the US on a temporary legal status to leave the country.  But who the email actually applies to—and who actually received it—is far from clear.",
    "url": "https://www.wired.com/story/homeland-security-email-tells-a-us-citizen-to-immediately-self-deport/"
  },
  {
    "text": "The Attack on International Students  —  Marco Rubio's twitter bio used to boast that he was banned from China.  He won the honor partly for his criticism of how China suppressed pro-democracy advocates in Hong Kong and its dismal human rights record against Uyghur minorities.",
    "url": "https://donmoynihan.substack.com/p/the-attack-on-international-students"
  },
  {
    "text": "Trump Has Found His Class Enemy  —  The president unleashes a Marxist theory of power—but against knowledge workers, not billionaires.  —  even the educated mind, or perhaps especially the educated mind, is skilled at deflecting harsh realities.  That's why so many white-shoe lawyers … ",
    "url": "https://www.theatlantic.com/ideas/archive/2025/04/trump-waging-war-professional-class/682409/?gift=mBLCHcnsd_Gd3EecvWSKTeR6Io9f0AH7tqSBSiT4zDM&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "The rise of end times fascism  —  The governing ideology of the far right has become a monstrous, supremacist survivalism.  Our task is to build a movement strong enough to stop them  —  The movement for corporate city states cannot believe its good luck.",
    "url": "https://www.theguardian.com/us-news/ng-interactive/2025/apr/13/end-times-fascism-far-right-trump-musk"
  },
  {
    "text": "Trump redefines fraud in quest to crush “Deep State”  —  Bruised by years of civil suits, criminal charges and a historic felony fraud conviction, President Trump is using his second term to delegitimize the very concept of white-collar crime.  —  Why it matters: Trump's belief that he was a victim of … ",
    "url": "https://www.axios.com/2025/04/13/trump-redefines-fraud-corruption"
  },
  {
    "text": "Trump tariff plans bring concern about prices, financial impact, but GOP base sees jobs long-term — CBS News poll  —  Amid a tumultuous week in the markets, the outlook on President Trump's trade and tariff policy hinges not just on what Americans think will happen, but when.",
    "url": "https://www.cbsnews.com/news/poll-trump-tariffs-13-04-2025/"
  }
]