[
  {
    "text": "Judge in Trump Documents Case Rejected Suggestions to Step Aside  —  Two federal judges in South Florida privately urged Aileen M. Cannon to decline the case when it was assigned to her last year, according to two people briefed on the matter.  She chose to keep it.",
    "url": "https://www.nytimes.com/2024/06/20/us/politics/aileen-cannon-trump-classified-documents.html"
  },
  {
    "text": "Fox News Poll: Three-point shift in Biden-Trump matchup since May  —  32% give the economy positive marks, a record-high during Biden's presidency  —  Join Fox News for access to this content  —  President Biden is the frontrunner in a hypothetical matchup against former President Trump … ",
    "url": "https://www.foxnews.com/official-polls/fox-news-poll-three-point-shift-biden-trump-matchup-since-may"
  },
  {
    "text": "Donald Trump Hit by Devastating Poll From Fox News  —  2024 presidential poll for the first time since late last year.  —  A survey of 1,095 registered voters from the conservative news network showed that Biden is leading his presumptive  —  rival by two points (50 percent to 48 percent).",
    "url": "https://www.newsweek.com/donald-trump-devastating-poll-fox-news-joe-biden-election-economy-1915063"
  },
  {
    "text": "Why Dictators Want Trump … We're big fans both of decarbonization and of reliable electricity, so two thumbs up on this one from us!  (One assumes the Democrats don't mind the job creation, either?)  Happy Thursday.  —  The Real World  —  Things are hopping in American politics.",
    "url": "https://www.thebulwark.com/p/why-dictators-want-trump"
  },
  {
    "text": "CNN debate stage set with Trump and Biden going head-to-head  —  President Joe Biden and former President Donald Trump are set for a historic showdown, with the stage now set for CNN's June 27 presidential debate.  —  The showdown will make history as the first debate between a sitting president and a former president.",
    "url": "https://www.cnn.com/2024/06/20/politics/cnn-debate-trump-biden/"
  },
  {
    "text": "Supreme Court Upholds Trump-Era Tax Provision  —  The tax dispute, which was closely watched by experts, involved a one-time foreign income tax, but many saw it as a broader challenge to pre-emptively block Congress from passing a wealth tax.  —  The Supreme Court on Thursday upheld a tax … ",
    "url": "https://www.nytimes.com/2024/06/20/us/politics/supreme-court-tax-case-trump.html"
  },
  {
    "text": "June 2024 State Polls: Trump Maintains Edge over Biden  —  Democratic US Senate Candidates Outperforming Biden  —  New Emerson College Polling/The Hill state polls find former President Donald Trump with a slight edge on President Joe Biden in Arizona (47% to 43%), Georgia (45% to 41%) … ",
    "url": "https://emersoncollegepolling.com/june-2024-state-polls-trump-maintains-edge-over-biden/"
  },
  {
    "text": "Illinois Republican Chair Resigns, Slams Colleagues Weeks Before Convention  —  Party Chair Don Tracy is resigning from his political post, and has condemned colleagues for choosing to fight each other rather than the  —  , in a letter explaining his decision.",
    "url": "https://www.newsweek.com/illinois-republican-chair-resigns-slams-colleagues-weeks-before-convention-1915090"
  },
  {
    "text": "Top Florida law enforcement official sues DeSantis, alleging he was fired for blowing the whistle  —  The official says he warned of issues over migrants and public records.  —  Florida Gov. Ron DeSantis speaks at press conference at the Hollywood Fire Rescue Station 5, on June 14, 2024.",
    "url": "https://abcnews.go.com/US/top-florida-law-enforcement-official-sues-desantis-alleging/story?id=111258138"
  },
  {
    "text": "Fox News is helping Trump plan another Jan. 6-style assault on democracy  —  Five months before the election, claims that only fraud could explain a future Trump defeat are already common in the right-wing media ecosystem.  —  The cycle of lies that drove the Jan. 6, 2021, insurrection is again underway.",
    "url": "https://www.msnbc.com/opinion/msnbc-opinion/fox-news-trump-election-2024-disinformation-rcna157770"
  },
  {
    "text": "Democrats seek to repeal Comstock abortion rule, fearing Trump crackdown  —  The Comstock Act, an 1873 law that bans abortion-related materials from being sent through the mail, could be used by the GOP to restrict abortion nationwide.  —  Democrats are seeking to overhaul an 1873 federal law … ",
    "url": "https://www.washingtonpost.com/health/2024/06/20/comstock-abortion-repeal-tina-smith-senate/"
  },
  {
    "text": "FBI raids Oakland Mayor Sheng Thao's home, several other locations: source  —  Oakland Mayor Sheng Thao's home was among four locations raided by the FBI Thursday morning, a source told ABC7 News.  —  OAKLAND, Calif. (KGO) — A home associated with Oakland Mayor Sheng Thao … ",
    "url": "https://abc7news.com/post/fbi-raided-oakland-mayor-sheng-thaos-home-sources/14980538/"
  },
  {
    "text": "Trump Media shares sink 13% as DJT slide accelerates … A weekslong sell-off of Trump Media picked up speed Thursday afternoon, with shares of former President Donald Trump's company falling around 13% in another volatile trading session.  —  The company behind the conservative social media app Truth Social … ",
    "url": "https://www.cnbc.com/2024/06/20/djt-trump-media-stock-price-today.html"
  },
  {
    "text": "Bob Good Trails in Battle for His Virginia Seat, but Primary Remains Too Close to Call  —  Both the congressman and his Trump-backed challenger are election deniers, raising the question of whether either would accept an adverse result in his own race.  —  Representative Bob Good … ",
    "url": "https://www.nytimes.com/2024/06/20/us/politics/bob-good-virginia-primary.html"
  },
  {
    "text": "Glorifying Self Harm: Alphabet Activist Group Celebrates Teens ‘Cutting’ Themselves  —  Mermaids is a very prominent and very evil alphabet ideology promotion group that has had, up until very recently, outsized power in determining UK healthcare policies regarding transgender “healthcare.”",
    "url": "https://hotair.com/david-strom/2024/06/20/glorifying-self-harm-alphabet-activist-group-celebrates-teens-cutting-themselves-n3790599"
  },
  {
    "text": "US Diverts Patriot Missiles Ordered by Allies to Ukraine  — White House says move provides Ukraine help for next 16 months  — Shipments to other European allies could resume next year  —  The US is halting deliveries of key air defense missiles to allies, directing shipments … ",
    "url": "https://www.bloomberg.com/news/articles/2024-06-20/us-diverts-patriot-defense-systems-ordered-by-allies-to-ukraine"
  },
  {
    "text": "The Delusion of “Advanced” Plastic Recycling  —  LAST YEAR, I became obsessed with a plastic cup.  —  It was a small container that held diced fruit, the type thrown into lunch boxes.  And it was the first product I'd seen born of what's being touted as a cure for a crisis.",
    "url": "https://www.propublica.org/article/delusion-advanced-chemical-plastic-recycling-pyrolysis"
  },
  {
    "text": "Exclusive: Biden to ban US sales of Kaspersky software over Russia ties, source says  —  The Biden administration on Thursday will announce plans to bar the sale of antivirus software made by Russia's Kaspersky Labs in the United States, a person familiar with the matter said … ",
    "url": "https://www.reuters.com/technology/biden-ban-us-sales-kaspersky-software-over-ties-russia-source-says-2024-06-20/"
  }
]