[
  {
    "text": "Putin Wins the Trump-Zelensky Oval Office Spectacle  —  Vice President Vance starts a public fight that only helps Russia's dictator.  —  Toward the end of his on-camera, Oval Office brawl with Ukraine's Volodymyr Zelensky on Friday, President Trump quipped that it was “great television.”",
    "url": "https://www.wsj.com/opinion/putin-wins-the-trump-zelensky-oval-office-spectacle-e23e9b21?st=xfiJdB&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Why the Trump-Zelenskyy meeting imploded  —  The News  —  President Donald Trump's perception that Ukrainian President Volodymyr Zelenskyy was overtaking the day's planned emphasis on a US-Ukraine minerals deal partly set off Friday's Oval Office blowup, according to a White House official.",
    "url": "https://www.semafor.com/article/02/28/2025/why-the-trump-zelenskyy-meeting-imploded"
  },
  {
    "text": "The Real Reason Trump Berated Zelensky  —  Of the many bizarre and uncomfortable moments during today's Oval Office meeting between Donald Trump, J. D. Vance, and Volodymyr Zelensky—during which Trump finally shattered the American alliance with Ukraine—one was particularly revealing: What … ",
    "url": "https://www.theatlantic.com/politics/archive/2025/02/zelensky-trump-putin-ukraine/681883/?gift=HoRfrgrF5SCKopc-hfobxH_7JsfLZAjcZemEOkpwWa4&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "A Day of American Infamy  —  In August 1941, about four months before the Japanese attack on Pearl Harbor, Franklin Roosevelt met with Winston Churchill aboard warships in Newfoundland's Placentia Bay and agreed to the Atlantic Charter, a joint declaration by the world's leading democratic powers on … ",
    "url": "https://www.nytimes.com/2025/02/28/opinion/a-day-of-american-infamy.html?unlocked_article_code=1.0k4.2WNT.xlHiyZ4L5Pwy&smid=bs-share"
  },
  {
    "text": "At Least Now We Know the Truth  —  Sign up for Trump's Return, a newsletter featuring coverage of the second Trump presidency.  —  At least the Oval Office meeting held by President Donald Trump and Vice President J. D. Vance with Ukrainian President Volodymyr Zelensky was held in front of the cameras.",
    "url": "https://www.theatlantic.com/politics/archive/2025/02/least-now-we-know-truth-about-trump-and-vance/681872/?gift=hVZeG3M9DnxL4CekrWGK322xBEKOAOqJ6N2BuUzPwvw&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "A president just disrespected America in the Oval Office.  It wasn't Zelensky  —  It's time to say it plainly.  America's leadership has switched sides in the war.  The American people have not, and they should speak up.  —  In the past several weeks, the U.S. leadership … ",
    "url": "https://kyivindependent.com/editorial-a-president-just-disrespected-america-in-the-oval-office-it-wasnt-zelensky/"
  },
  {
    "text": "‘Free world needs a new leader’: Europe defends Zelenskyy after Trump attack  —  BRUSSELS ― European leaders on Friday rallied to defend Ukrainian President Volodymyr Zelenskyy after United States President Donald Trump and Vice President JD Vance subjected him to a tirade of withering and infantilizing abuse in the Oval Office.",
    "url": "https://www.politico.eu/article/volodymyr-zelenskyy-donald-trump-jd-vance-oval-office-white-house-us-ukraine-war-russia/"
  },
  {
    "text": "This Never Happened With an American President Before  —  What happened in the Oval Office on Friday — the obviously planned ambush of President Volodymyr Zelensky of Ukraine by President Trump and Vice President JD Vance — was something that had never happened in the nearly 250-year history … ",
    "url": "https://www.nytimes.com/2025/02/28/opinion/trump-zelensky.html?unlocked_article_code=1.0k4.2sm8.ttZh4jwwqklU"
  },
  {
    "text": "Behind the Collision: Trump Jettisons Ukraine on His Way to a Larger Goal  —  The president's explosive Oval Office encounter reflected his determination to put aside alliances and commitments to principles in favor of raw great power negotiations.  —  After five weeks in which President Trump … ",
    "url": "https://www.nytimes.com/2025/02/28/us/politics/trump-ukraine-zelensky.html"
  },
  {
    "text": "Trump And Vance Ambush Zelensky In Prelude To Betrayal  —  JD Vance egged on the president, setting the stage for the US to abandon a key American ally in televised Oval Office meeting.  —  President Donald Trump and Vice President J.D. Vance moved to betray a key U.S. ally that has lost hundreds … ",
    "url": "https://talkingpointsmemo.com/news/trump-and-vance-ambush-zelensky-in-prelude-to-betrayal"
  },
  {
    "text": "“The free world needs a new leader”: Allies defend Zelensky after Trump debacle … - “He disrespected the United States of America in its cherished Oval Office. … - The verbal clash was triggered when Zelensky asked Vice President Vance “what kind of diplomacy” he envisioned with Vladimir Putin … ",
    "url": "https://www.axios.com/2025/02/28/trump-zelensky-ukraine-europe-reactions"
  },
  {
    "text": "Excerpts From the Fiery Exchange Between Trump and Zelensky at the White House  —  During the Oval Office meeting, President Trump told the Ukrainian leader: “You're either going to make a deal or we're out.”  —  A meeting between President Trump and President Volodymyr Zelensky of Ukraine … ",
    "url": "https://www.nytimes.com/2025/02/28/us/politics/trump-zelensky-transcript.html"
  },
  {
    "text": "Exclusive: Hegseth orders Cyber Command to stand down on Russia planning  —  Defense Secretary Pete Hegseth last week ordered U.S. Cyber Command to stand down from all planning against Russia, including offensive digital actions, according to three people familiar with the matter.",
    "url": "https://therecord.media/hegseth-orders-cyber-command-stand-down-russia-planning"
  },
  {
    "text": "Georgia Nonprofit That Produces Life-Saving Food For Kids Has Federal Contract Cut  —  An estimated 300,000 children globally are expected to lose access to a nutrient-dense peanut butter that's specially formulated to treat severe acute malnutrition.  —  A Georgia nonprofit that produces emergency aid … ",
    "url": "https://www.huffpost.com/entry/mana-food-aid-producer-loses-usaid-contracts_n_67c1fdb7e4b0c96eb9312299"
  },
  {
    "text": "Voice of America Journalists Face Investigations for Trump Comments  —  The broadcaster placed a longtime journalist on leave amid growing concerns about its editorial independence.  —  Voice of America, the federally funded broadcaster to the world, has long prided itself on serving … ",
    "url": "https://www.nytimes.com/2025/02/28/business/voice-of-america-trump.html?unlocked_article_code=1.0k4.BEpe.u1SyCVNGvi61"
  },
  {
    "text": "Firings at US weather and oceans agency risk lives and economy, former agency heads warn  —  The federal weather and oceans agency touches people's daily lives in unnoticed ways, so massive firings there will likely cause needless deaths and a big hit to America's economy, according to the people who ran it.",
    "url": "https://apnews.com/article/noaa-doge-federal-cuts-musk-weather-danger-6f60e7c511989aeff8930ae87c9a5ee8"
  },
  {
    "text": "FBI Deputy Director Bongino repeatedly said pipe bombs planted ahead of Jan. 6 were ‘inside job’  —  Dan Bongino, the incoming deputy director of the FBI, suggested on his popular podcast in January that the agency he is now about to help lead was complicit in planting pipe bombs around Washington ahead … ",
    "url": "https://www.cnn.com/2025/03/01/politics/kfile-dan-bongino-january-6th-pipe-bomb-fbi/"
  },
  {
    "text": "Federal workers told once again to justify their work to DOGE  —  The late-night email created more anxiety for public-sector employees.  —  Federal workers are again being asked to justify their jobs to the Department of Government Efficiency overseen by billionaire Elon Musk.",
    "url": "https://www.politico.com/news/2025/02/28/federal-workers-told-once-again-to-justify-their-work-to-doge-00206853"
  },
  {
    "text": "FBI returns materials seized at Mar-a-Lago to Trump, White House says  —  The search was part of the federal investigation into Donald Trump's alleged mishandling of classified documents and obstruction of attempts to retrieve them.  —  Just now  —  The FBI on Friday returned at least … ",
    "url": "https://www.washingtonpost.com/national-security/2025/02/28/trump-fbi-classified-documents-mar-a-lago/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQwNzE4ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQyMDk3NTk5LCJpYXQiOjE3NDA3MTg4MDAsImp0aSI6IjY2NmE4YWIxLWQyYWUtNDkyNy05YTI0LWQzM2JjZDZmN2FlMyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb25hbC1zZWN1cml0eS8yMDI1LzAyLzI4L3RydW1wLWZiaS1jbGFzc2lmaWVkLWRvY3VtZW50cy1tYXItYS1sYWdvLyJ9.hC3Dkkr8H3jR6TZtPVTvKhgFoCONcGRUs6Ky6669Yc8&itid=gfta"
  },
  {
    "text": "Trump officials start dismantling civil rights offices, as part of DOGE's secret plan  —  Legal experts said that unwinding a civil-rights-era bulwark designed to safeguard employees' rights removes a crucial check on institutional power.  —  Agencies across the federal government … ",
    "url": "https://www.washingtonpost.com/nation/2025/02/28/doge-trump-civil-rights-office-closing-eeoc/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQwNzE4ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQyMDk3NTk5LCJpYXQiOjE3NDA3MTg4MDAsImp0aSI6IjQ2MWYzMWZmLTdjYmUtNDQxMS1iNzA4LWI3MTA2MmE3OWU3MSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb24vMjAyNS8wMi8yOC9kb2dlLXRydW1wLWNpdmlsLXJpZ2h0cy1vZmZpY2UtY2xvc2luZy1lZW9jLyJ9.QJkamYpMdxpDhqxZtHvtDS6vPHqc6K7-exiIMntAcwI&itid=gfta"
  }
]