[
  {
    "text": "Syrian rebels announce fall of Russia-backed Assad regime  —  Syrian rebels announced on Dec. 8 that they had ousted President Bashar al-Assad from the capital city of Damascus.  —  “The tyrant Bashar al-Assad has fled.  We declare the city of Damascus free from the tyrant Bashar al-Assad,” rebel leaders said in a statement.",
    "url": "https://kyivindependent.com/breaking-syrian-rebels-announce-fall-of-assad-regime/"
  },
  {
    "text": "Syria rebels celebrate in captured Homs, set sights on Damascus  —  Syrian President Bashar al-Assad flew out of Damascus for an unknown destination on Sunday, two senior army officers told Reuters, as rebels said they had entered the capital with no sign of army deployments.",
    "url": "https://www.reuters.com/world/middle-east/syria-rebels-celebrate-captured-homs-set-sights-damascus-2024-12-07/"
  },
  {
    "text": "Jubilation and gunfire as Syrians celebrate the end of the Assad family's half-century rule  —  Syrians poured into streets echoing with celebratory gunfire on Sunday after a stunning rebel advance reached the capital, ending the Assad family's 50 years of iron rule but raising questions … ",
    "url": "https://apnews.com/article/syria-assad-sweida-daraa-homs-hts-qatar-816e538565d1ae47e016b5765b044d31"
  },
  {
    "text": "Russia says Syria's Assad has left country and gave orders for peaceful power handover  —  Russia said on Sunday that Syrian President Bashar al-Assad had left office and departed his country after giving orders for a peaceful transfer of power, but did not say where he was now or whether the Russian military planned to stay in Syria.",
    "url": "https://www.reuters.com/world/russia-says-syrias-assad-has-left-country-given-orders-peaceful-power-handover-2024-12-08/"
  },
  {
    "text": "Syria's sudden uprising is a stark reminder of Obama's failed foreign policy  —  The stunning events that have unfolded in Syria over the past week have culminated in the sudden end to the regime of President Bashar al-Assad, more than a decade after he managed to hold on when civil war erupted.",
    "url": "https://www.washingtonexaminer.com/in_focus/3251408/renewed-carnage-syria-reminder-obama-foreign-policy/"
  },
  {
    "text": "Trump details sweeping changes he'll carry out on day one and beyond in an exclusive interview  —  Trump vowed to launch a mass deportation effort, impose tariffs and pardon many convicted in the Jan. 6 attack in an interview with “Meet the Press” moderator Kristen Welker.",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-details-sweeping-changes-ll-carry-day-one-exclusive-interview-rcna182858"
  },
  {
    "text": "Trump will ‘most likely’ pardon Capitol rioters on Day 1 and says Jan. 6 committee members should be jailed  —  The president-elect also said during an exclusive interview with “Meet the Press” that he won't request a special prosecutor to investigate outgoing President Joe Biden.",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-will-likely-pardon-capitol-rioters-day-1-says-jan-6-committee-me-rcna183275"
  },
  {
    "text": "Trump Transition Live Updates: Trump Gives First Televised Interview Since Election  —  Where Things Stand  — President-elect Donald J. Trump insisted in an interview with NBC's “Meet the Press” to air on Sunday that he would not direct his administration to seek retribution … ",
    "url": "https://www.nytimes.com/live/2024/12/08/us/trump-interview-news"
  },
  {
    "text": "Climate Activists Need to Radically Change Their Approach Under Trump  —  Donald Trump's return to Washington might seem like a terrifying moment for the fight against climate change.  The incoming administration is not just hostile to the energy transition; it's also expected to pull … ",
    "url": "https://www.nytimes.com/2024/12/08/opinion/climate-clean-energy-trump.html"
  },
  {
    "text": "Did Trump Drain Democrats' Energy?  These Races Will Be the First Test.  —  As Democrats try to fire up their fatigued base, two contests for the Virginia legislature will serve as the first measure of partisan enthusiasm since Donald J. Trump's victory.  —  Even as the exhausted nation recovers … ",
    "url": "https://www.nytimes.com/2024/12/08/us/politics/virginia-special-elections.html"
  },
  {
    "text": "What Doctors Like Myself Know About Americans' Health Care Anger  —  I rushed around the patient as he lay motionless with his eyes closed in the emergency room.  He was pale and sweaty, his T-shirt stained with vomit.  You didn't have to be a health-care worker to know that he was in a dire state.",
    "url": "https://www.nytimes.com/2024/12/08/opinion/health-care-anger.html"
  },
  {
    "text": "Federal employees scramble to insulate themselves from Trump's purge  —  Career civil servants are scrubbing social media, changing job titles and looking for private sector work over fear that Trump might fire them  —  Lisa Rein covers federal agencies and the management of government.",
    "url": "https://www.washingtonpost.com/politics/2024/12/08/federal-employees-trump-fear-purge/"
  },
  {
    "text": "Trump aims to end birthright citizenship, says American citizens with family here illegally may be deported  —  President-elect Donald Trump, in an exclusive interview with “Meet the Press,” also said he is open to working with Democrats on a legislative way to keep Dreamers in the United States.",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-aims-end-birthright-citizenship-says-american-citizens-family-il-rcna183274"
  },
  {
    "text": "Youngkin: Jordanians ‘crashed’ Quantico.  Feds: It was an Amazon delivery.  —  Virginia's governor has used the arrest of two undocumented men who misunderstood directions to stop at a check-in station to inflame fears over illegal immigration.  —  RICHMOND — There are two versions … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2024/12/07/youngkin-jordanians-crashed-quantico-feds-it-was-an-amazon-delivery/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzMzNTQ3NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM0OTI5OTk5LCJpYXQiOjE3MzM1NDc2MDAsImp0aSI6IjgzYWY1MTMyLTUzMWEtNGU2My04YzgzLWI4MTI5Y2YyZDg2ZCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9kYy1tZC12YS8yMDI0LzEyLzA3L3lvdW5na2luLWpvcmRhbmlhbnMtY3Jhc2hlZC1xdWFudGljby1mZWRzLWl0LXdhcy1hbi1hbWF6b24tZGVsaXZlcnkvIn0.1jJjTWfYv90NubfLGoqKzGOt_YV22RwoDeDyoEMQSMs&itid=gfta"
  },
  {
    "text": "The Tennessee Trans Treatment Case Is About Age, Not Sex  —  I cannot begin to imagine the pain of feeling that your body does not match your gender.  I cannot imagine the pain of parenting a child in such distress.  Americans should feel immense sympathy for individuals in those circumstances … ",
    "url": "https://www.nytimes.com/2024/12/08/opinion/tennessee-trans-supreme-court-case.html"
  },
  {
    "text": "US announces nearly $1 billion more in longer-term weapons support for Ukraine  —  The United States will provide nearly $1 billion more in longer-term weapons support to Ukraine, Defense Secretary Lloyd Austin said Saturday as the Biden administration rushes to spend all the congressionally approved money … ",
    "url": "https://apnews.com/article/ukraine-weapons-russia-trump-biden-himars-zelenskyy-7b2560ad6bd54a6275da0ceb5241c0e8"
  }
]