[
  {
    "text": "Trump says he'll vote no on Florida abortion-rights measure  —  Video Player is loading.  —  Play Video  —  Rising Reacts: Kamala Harris' first interview on CNN  —  Unmute  —  Current Time 0:00  —  Loaded: 0.00%  —  Stream Type LIVE  —  Seek to live, currently behind liveLIVE",
    "url": "https://thehill.com/homenews/campaign/4856299-donald-trump-florida-abortion-rights-measure/"
  },
  {
    "text": "Trump's latest waffling on reproductive health shows he's still struggling to find an answer for what he created  —  Donald Trump said Friday that he will not support a ballot referendum to expand abortion access in his home state of Florida just 24 hours after suggesting he might.",
    "url": "https://www.cnn.com/2024/08/30/politics/donald-trump-abortion-politics/"
  },
  {
    "text": "Cheney, on the Sidelines as Harris Courts Her Endorsement, Plans to Weigh In Soon  —  The former Wyoming congresswoman, the most prominent Republican critic of Donald J. Trump, did not speak at Democrats' convention, calculating that she could have more impact later in the race.",
    "url": "https://www.nytimes.com/2024/08/30/us/politics/liz-cheney-kamala-harris-endorsement.html"
  },
  {
    "text": "Trump in damage-control mode over abortion backlash from the right  —  The GOP nominee has landed in hot water on abortion agin after criticizing Florida's six-week ban and declining to take a stance on a state ballot measure.  —  WASHINGTON — Former President Donald Trump is in damage control … ",
    "url": "https://www.nbcnews.com/politics/2024-election/trump-damage-control-abortion-backlash-conservatives-rcna168922"
  },
  {
    "text": "Police use Taser to subdue man who stormed media area of Trump rally in Pennsylvania  —  JOHNSTOWN, Pa. (AP) — A man at Donald Trump's rally in Johnstown, Pennsylvania, stormed into the press area as the former president spoke Friday but was surrounded by police and sheriff's deputies and was eventually subdued with a Taser.",
    "url": "https://apnews.com/article/trump-rally-arrest-taser-media-68fe78b79ae65556c4efc850e142998c"
  },
  {
    "text": "Brazil Blocks X After Musk Ignores Court Orders  —  The social network will go dark in the nation of 200 million, the result of an escalating fight between Elon Musk and a Brazilian judge over what can be said online.  —  Brazil blocked the social network X on Friday after its owner … ",
    "url": "https://www.nytimes.com/2024/08/30/world/americas/brazil-elon-musk-x-blocked.html?unlocked_article_code=1.G04.OKhs.W4ME5jWBlTns&smid=em-share"
  },
  {
    "text": "Brazilian judge suspends X platform after it refuses to name a legal representative  —  SAO PAULO (AP) — A Brazilian Supreme Court justice on Friday ordered the suspension of Elon Musk's social media giant X in Brazil after the tech billionaire refused to name a legal representative in the country … ",
    "url": "https://apnews.com/article/brazil-musk-x-suspended-de-moraes-46c9d5c5c895e17d9adfac43e6ac20fd"
  },
  {
    "text": "Miss Teen USA Runner-Up Shames JD Vance for Cruel Video Post  —  ANOTHER HAPPY VOTER  —  Vance used a 17-year-old video of a stumbling Caitlin Upton to jibe at Kamala Harris before her CNN interview.  The video had led to years of mockery for Upton.  —  A one-time Miss Teen USA contestant mocked … ",
    "url": "https://www.thedailybeast.com/miss-teen-usa-2007-runner-up-caitlin-upton-shames-jd-vance-for-cruel-video-post-used-to-jibe-kamala-harris"
  },
  {
    "text": "Why Trump's Arlington Debacle Is So Serious  —  This article was featured in the One Story to Read Today newsletter.  Sign up for it here.  —  The section of Arlington National Cemetery that Donald Trump visited on Monday is both the liveliest and the most achingly sad part of the grand military graveyard … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/08/trump-arlington-cemetery/679659/"
  },
  {
    "text": "Tim Walz's political origin story does not add up  —  Gov. Tim Walz (D-MN) has long described the moment in 2004 that inspired him to run for public office.  In Walz's telling, the “folksy” high school teacher and two of his students attended a campaign rally for President George W. Bush as an educational experience.",
    "url": "https://www.washingtonexaminer.com/news/campaigns/presidential/3138767/tim-walz-political-origin-story/"
  },
  {
    "text": "So long, and thanks for all the fish  —  Before we go any further, I should note that this is my last newsletter for CJR, as I am moving on from my job as the magazine's chief digital writer.  (In case the headline doesn't make any sense, it comes from a Douglas Adams book … ",
    "url": "https://www.cjr.org/the_media_today/mathew_ingram_goodbye.php"
  },
  {
    "text": "FDA Authorizes Updated Novavax COVID-19 Vaccine to Better Protect Against Currently Circulating Variants  —  For Immediate Release:  —  Today, the U.S. Food and Drug Administration granted emergency use authorization (EUA) for an updated version of the Novavax COVID-19 vaccine … ",
    "url": "https://www.fda.gov/news-events/press-announcements/fda-authorizes-updated-novavax-covid-19-vaccine-better-protect-against-currently-circulating"
  },
  {
    "text": "Tim Walz Took a Big Step Toward Scrapping the Electoral College  —  As Minnesota Governor, he signed the National Popular Vote Interstate Compact that provides a path toward electing the president by majority vote.  —  Vice President Kamala Harris selected Minnesota Governor Tim Walz as her running mate … ",
    "url": "https://washingtonmonthly.com/2024/08/30/tim-walz-took-a-big-step-toward-scrapping-the-electoral-college/"
  },
  {
    "text": "After storms topple mature trees, city of Minneapolis reminds residents of low-cost tree program  —  The city of Minneapolis is offering residents, property owners and businesses low-cost trees in efforts to grow the city's tree canopy, at a time when the city has lost some mature trees to severe weather.",
    "url": "https://www.mprnews.org/story/2024/08/30/after-storms-topple-mature-trees-city-of-minneapolis-reminds-residents-of-tree-program"
  },
  {
    "text": "At 2 Elite Colleges, Shifts in Racial Enrollment After Affirmative Action Ban  —  Amherst College and Tufts University saw shifts in the racial makeup of students after a Supreme Court decision ending affirmative action.  At other schools, the picture is murkier.",
    "url": "https://www.nytimes.com/2024/08/30/us/black-enrollment-affirmative-action-amherst-tufts-uva.html"
  },
  {
    "text": "Harris-Walz Interview Ratings Nearly Double Trump's Last Big CNN Sit-Down  —  HUGE  —  The CNN interview also outpaced the ratings for Donald Trump and JD Vance's first joint interview on Fox News.  —  The first joint interview with Vice President Kamala Harris and her running mate Tim Walz … ",
    "url": "https://www.thedailybeast.com/harris-walz-interview-ratings-nearly-double-trumps-last-big-cnn-sit-down"
  },
  {
    "text": "Georgia election workers launch bid to seize Giuliani's assets as they try to collect $148 million defamation verdict  —  Ruby Freeman and Shaye Moss want to seize real estate, cash and jewelry.  —  NEW YORK — The two former Georgia election workers who won a $148 million defamation verdict … ",
    "url": "https://www.politico.com/news/2024/08/30/giuliani-lawsuit-seizure-assets-00176898"
  }
]