[
  {
    "text": "Why Pence's Refusal to Endorse Trump Matters (Seriously!)  —  A Vice President not endorsing his former boss should be a bigger deal  —  On Friday afternoon, Mike Pence announced during an interview with Fox News' Martha MacCallum that he would not endorse Donald Trump for President.",
    "url": "https://www.messageboxnews.com/p/why-pences-refusal-to-endorse-trump"
  },
  {
    "text": "Trump ramps up dark rhetoric in Ohio stump speech for Senate candidate Bernie Moreno  —  Former President Donald Trump claimed that he — not President Joe Biden — will protect Social Security and warned of a “bloodbath” if he loses in November as he campaigned for Senate candidate Bernie Moreno in Ohio.",
    "url": "https://apnews.com/article/trump-ohio-moreno-senate-social-security-3b450dcfc24a02c8cac3a3feb657ddc8"
  },
  {
    "text": "Trump says he'll decide ‘pretty soon’ on whether to support a national abortion ban  —  Former President Trump said Sunday that he will decide “pretty soon” on whether to back a national abortion ban.  —  Trump's comments come after reports surfaced last month that he is considering embracing … ",
    "url": "https://thehill.com/homenews/campaign/4537973-trump-says-hell-decide-pretty-soon-on-whether-to-support-a-national-abortion-ban/"
  },
  {
    "text": "Trump Says Some Migrants Are ‘Not People’ and Predicts a ‘Blood Bath’ if He Loses  —  In a caustic and discursive speech in Ohio, former President Donald J. Trump once again doubled down on a doomsday vision of the United States.  —  Former President Donald J. Trump, at an event … ",
    "url": "https://www.nytimes.com/2024/03/16/us/politics/trump-speech-ohio.html"
  },
  {
    "text": "Trump Economic Advisers Float Three Names for Fed Chair  —  Kevin Warsh, Kevin Hassett, Arthur Laffer on shortlist presented to Trump during meeting at Mar-a-Lago  —  WASHINGTON—Influential economic advisers to Donald Trump presented the former president with a shortlist of potential candidates … ",
    "url": "https://www.wsj.com/politics/policy/trump-economic-advisers-float-three-names-for-fed-chair-e3b694d8"
  },
  {
    "text": "How Trump's Allies Are Winning the War Over Disinformation  —  Their claims of censorship have successfully stymied the effort to filter election lies online.  —  In the wake of the riot on Capitol Hill on Jan. 6, 2021, a groundswell built in Washington to rein in the onslaught of lies … ",
    "url": "https://www.nytimes.com/2024/03/17/us/politics/trump-disinformation-2024-social-media.html"
  },
  {
    "text": "Two GOP senators won't commit to explicit Trump endorsement  —  Sens. Bill Cassidy (R-La.) and Mike Rounds (R-S.D.), in Sunday interviews, would not say whether they would endorse former President Trump's bid for the White House.  —  Rounds, in an interview on CNN's “State of the Union,” … ",
    "url": "https://thehill.com/homenews/senate/4537495-two-gop-senators-wont-commit-to-explicit-trump-endorsement/"
  },
  {
    "text": "Behind the scenes, Biden has grown angry and anxious about re-election effort  —  Biden locked up the Democratic nomination last week, but looking ahead to the general, anxiety has seemed to increase.  —  WASHINGTON — President Joe Biden was seething.  —  In a private meeting at the White House … ",
    "url": "https://www.nbcnews.com/politics/2024-election/biden-anger-rcna143729"
  },
  {
    "text": "Exclusive: Top Republican calls for canceling future Biden SOTU speeches … - “That was about the most divisive State of the Union — I wouldn't extend him an invitation next year, if that's what we're going to get,” Emmer said during an interview at the House GOP retreat.",
    "url": "https://www.axios.com/2024/03/17/biden-state-of-the-union-invitation-republicans"
  },
  {
    "text": "The Strongman Fantasy  —  And Dictatorship in Real Life  —  Quite a few Americans like the idea of strongman rule.  Why not a dictator who will get things done?  —  I lived in eastern Europe when memories of communism were fresh.  I have visited regions in Ukraine where Russia imposed its occupation regime.",
    "url": "https://snyder.substack.com/p/the-strongman-fantasy"
  },
  {
    "text": "Promo video for Texas dental practice poses new ethics issue for Noem  —  Sitting in front of a camera for a highly produced, well-lit vertical video with the kind of caption made to watch on mute while you're scrolling through social media, a patient for SmileTexas near Houston tells viewers … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/16/kristi-noem-dental-practice-video/"
  },
  {
    "text": "The education of a true believer  —  Linda Wenhold absorbed Patriot Academy's message that America is falling apart as it drifts from its biblical roots.  Then she won a seat on her local Pennsylvania school board.  —  BETHLEHEM, Pa. — Linda Wenhold closed her eyes, bowed her head and offered a prayer.",
    "url": "https://www.washingtonpost.com/politics/2024/03/17/patriot-academy-biblical-citizenship-school-board/"
  },
  {
    "text": "Illegal migrant from Lebanon caught at border admitted he's a Hezbollah terrorist hoping ‘to make a bomb’ — and was headed for NY  —  A Lebanese migrant who was caught sneaking over the border admitted he's a member of Hezbollah, he hoped to make a bomb, and his destination was New York, The Post can reveal.",
    "url": "https://nypost.com/2024/03/17/us-news/illegal-migrant-from-lebanon-admitted-terror-ties/"
  },
  {
    "text": "Ro Khanna says TikTok bill is not ‘actually addressing the issue’  —  Rep. Ro Khanna (D-Calif.) said the TikTok bill passed by the House last week is not “actually addressing the issue.”  —  Khanna, who voted against the bill, argued on ABC's “This Week” that while the two national security issues cited … ",
    "url": "https://thehill.com/homenews/house/4537706-ro-khanna-says-tiktok-bill-is-not-actually-addressing-the-issue/"
  }
]