[
  {
    "text": "Why Qatar is bribing Trump  —  On Sunday, President Trump announced that the government of Qatar would be giving the “Defense Department” a luxury 747 aircraft to replace Air Force One.  Critics of the deal, Trump said, were “World Class Losers.”  —  ABC News and other media outlets added a crucial detail.",
    "url": "https://popular.info/p/why-qatar-is-bribing-trump"
  },
  {
    "text": "GOP heavyweights join bipartisan bashing of Trump Qatar jet deal  —  Senate Majority Leader John Thune and GOP firebrand senators are among those voicing discomfort with the deal.  —  A number of Republican lawmakers are souring on President Donald Trump's plans to accept a luxury Boeing 747 aircraft … ",
    "url": "https://www.politico.com/news/2025/05/13/senate-republicans-qatar-trump-jet-00345435"
  },
  {
    "text": "Ben Shapiro, Laura Loomer lead rare MAGA backlash to Trump's Qatari jet  —  Top MAGA influencers Ben Shapiro, Laura Loomer and Mark Levin broke sharply with President Trump Monday over his decision to accept a $400 million private jet from the Qatari government.",
    "url": "https://www.axios.com/2025/05/13/trump-qatar-plane-ben-shapiro-loomer"
  },
  {
    "text": "Transcript: Jamie Raskin's Harsh Takedown of Trump's Qatar Plane Scam  —  The following is a lightly edited transcript of the May 13 episode of the Daily Blast podcast.  Listen to it here.  —  Greg Sargent: This is The Daily Blast from The New Republic, produced and presented by the DSR network.",
    "url": "https://newrepublic.com/article/195167/transcript-jamie-raskin-harsh-takedown-trump-qatar-plane-scam"
  },
  {
    "text": "Exclusive: Biden aides discussed wheelchair use if he were re-elected, new book says  —  This story is adapted from the forthcoming book “Original Sin: President Biden's Decline, Its Cover-Up, and His Disastrous Choice to Run Again,” by CNN's Jake Tapper and Axios' Alex Thompson.",
    "url": "https://www.axios.com/2025/05/13/biden-book-wheelchair-2024-campaign-original-sin"
  },
  {
    "text": "Trump's Middle East trip marked by potential private business conflicts  —  The Trump Organization has entered into real estate deals in all three countries Trump plans to visit this week.  —  President Donald Trump kicks off the first major international trip of his second term Tuesday … ",
    "url": "https://www.washingtonpost.com/politics/2025/05/13/trump-mideast-business-conflicts/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ3MTA4ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ4NDkxMTk5LCJpYXQiOjE3NDcxMDg4MDAsImp0aSI6Ijg3MDQ3NmRlLWQ1M2ItNGVmMy1iNmU4LWU0MjQyMmQ5YmJhNiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzA1LzEzL3RydW1wLW1pZGVhc3QtYnVzaW5lc3MtY29uZmxpY3RzLyJ9.rbl3fETbmtD-ylKDor0b_SjnpbkkdNpqaMy150eJuf8&itid=gfta"
  },
  {
    "text": "MAGA Attacks Church Over Donald Trump Rebuke: ‘Funds MUST Be Pulled’  —  A firestorm has erupted on the American right after the Episcopal Church said it is refusing a directive from the federal government to help resettle white South Africans who were granted refugee status.  —  Why It Matters",
    "url": "https://www.newsweek.com/episcopal-church-south-africa-reguees-maga-2071393"
  },
  {
    "text": "12-year-old boy left alone on sidewalk after ICE raid in Massachusetts  —  A 12-year-old boy was left behind on a street after an immigration raid in Waltham, Massachusetts.  —  United States Immigration and Customs Enforcement (ICE) agents were seen on camera leaving the boy by himself … ",
    "url": "https://www.cbsnews.com/boston/news/waltham-mass-ice-arrest-boy-left-alone/"
  },
  {
    "text": "How Joe Biden Handed the Presidency to Donald Trump  —  At a fateful event last summer, Barack Obama, George Clooney, and others were stunned by Biden's weakness and confusion.  Why did he and his advisers decide to conceal his condition from the public and campaign for reëlection?",
    "url": "https://www.newyorker.com/news/the-political-scene/how-joe-biden-handed-the-presidency-to-donald-trump"
  },
  {
    "text": "‘The bill is dead’: New York Republican blasts House GOP's chief tax writer  —  New York GOP Rep. Nick LaLota said he was “insulted” by how Ways and Means Chair Jason Smith presented a proposal for a key tax deduction on a Monday morning call.  —  New York Republican Rep. Nick LaLota … ",
    "url": "https://www.politico.com/news/2025/05/13/new-york-republican-blasts-house-gops-chief-tax-writer-00343816"
  },
  {
    "text": "Two more Fetterman aides leave embattled senator's office  —  The departures are the latest in a string of staff exits over the past year and a half.  —  Two more aides left John Fetterman's office in recent weeks, the latest in a stream of staff exits amid the Pennsylvania senator's shifting … ",
    "url": "https://www.politico.com/news/2025/05/13/fetterman-staff-00344618"
  },
  {
    "text": "Why are ICE agents such cowardly wusses?  —  Taking most of a week off, as I've just done, is impossible in the Trump 47 era.  Since I last attacked the keyboard, we got our first American pope, the mayor of Newark was arrested by federal agents, and Qatar is bribing the president with a $400 million plane, along with 57 other things.",
    "url": "https://www.inquirer.com/columnists/attytood/ice-immigration-arrests-trump-pope-leo-xiv-villanova-20250513.html"
  },
  {
    "text": "CBO: 7.6 million would go uninsured under GOP Medicaid bill  —  The Medicaid portions of the GOP megabill would lead to 10.3 million people losing coverage under the health safety net program and 7.6 million people going uninsured, according to estimates from the nonpartisan Congressional Budget Office.",
    "url": "https://www.politico.com/live-updates/2025/05/13/congress/cbo-megabill-medicaid-00345235"
  },
  {
    "text": "Why I'm Resigning from Positions at the National Science Foundation and Library of Congress  —  Today, I am resigning from the National Science Board and the Library of Congress Scholars Council.  —  Even as the White House threatens the foundational tenets of constitutional democracy … ",
    "url": "https://time.com/7285045/resigning-national-science-foundation-library-congress/"
  },
  {
    "text": "Mild April Inflation Captures Early Stages of Tariff Effects  —  CPI was up 0.2% over the month, while annual inflation was 2.3%  —  Inflation was relatively mild in April, but economists said tariffs will end a recent lull and push up more prices in the coming months.",
    "url": "https://www.wsj.com/economy/trade/cpi-inflation-april-2025-interest-rate-8febd2d2"
  },
  {
    "text": "Why does Alabama's GOP chairman have a Tennessee driver's license?  —  This is an opinion column.  —  Stories involving Alabama Republican Party chairman John Wahl tend to wind up in strange places.  —  Like, how did a butterfly farmer — real thing — become one of Alabama's most powerful political figures?",
    "url": "https://www.al.com/news/2025/05/why-does-alabamas-gop-chairman-have-a-tennessee-drivers-license-under-a-different-name.html"
  },
  {
    "text": "Small nodule found in Joe Biden's prostate during recent physical  —  The discovery “necessitated further evaluation,” officials said.  —  President Joe Biden speaks during a conference of the Advocates, Counselors and Representatives for the Disabled (ACRD) at the Sofitel Hotel in Chicago, Illinois, on April 15, 2025.",
    "url": "https://abcnews.go.com/US/small-nodule-found-joe-bidens-prostate-recent-physical/story?id=121743026"
  },
  {
    "text": "DNC moves toward nullifying election of David Hogg, Malcolm Kenyatta as vice chairs  —  The Democratic National Committee (DNC) has taken a first step toward possibly requiring a new election for two of its vice chairs, including David Hogg, who has stirred controversy with his call … ",
    "url": "https://thehill.com/homenews/campaign/5297387-dnc-vice-chair-election-david-hogg-malcolm-kenyatta/"
  },
  {
    "text": "How should U.S. media respond to Trump's attacks on the free press?  —  The president has made clear his dislike of the traditional independent media, which endeavors to cover him fairly but which he repeatedly accuses of bias against him.  So as the campaign against the media escalates … ",
    "url": "https://www.ilfoglio.it/esteri/2025/05/13/news/how-should-u-s-media-respond-to-trump-s-attacks-on-the-free-press--7716287/"
  },
  {
    "text": "Trump's Effort to become the Supreme Leader Has Roots in a Nazi Philosopher  —  His lawless view of his sovereign powers was articulated by Carl Schmitt  —  In a legal filing defending Donald Trump's use of the Alien Enemies Act (of “Alien and Sedition Acts” notoriety) … ",
    "url": "https://www.theunpopulist.net/p/trumps-effort-to-become-the-supreme"
  },
  {
    "text": "The Science I Would Be Doing if I Weren't in ICE Detention  —  When I moved to America from Russia to join a biology lab at Harvard Medical School in 2023, it felt as if I found my dream job.  America was a paradise for science.  Everything was flourishing.  There was freedom of discourse; conferences, seminars.",
    "url": "https://www.nytimes.com/2025/05/13/opinion/ice-detention-russian-scientist.html?unlocked_article_code=1.G08.LRTg.EZYpdd1G1Jus&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Mexican mayoral candidate gunned down during live broadcast of campaign rally  —  What began as a festive campaign march quickly turned into a scene of terror in the Mexican state of Veracruz on Sunday night when a mayoral candidate was gunned down alongside three other people.",
    "url": "https://cnn.com/2025/05/12/americas/mexico-mayoral-candidate-shot-dead-broadcast-intl-latam"
  },
  {
    "text": "Exclusive: Dems press Trump to divest from stablecoin  —  Senate Democrats are asking President Trump to divest from his cryptocurrency empire as he embarks on his Middle East trip this week, Axios has learned.  —  Why it matters: Democrats have raised corruption concerns over the Trump family's crypto dealings.",
    "url": "https://www.axios.com/2025/05/13/trump-stablecoin-crypto-divest-corruption-dems"
  },
  {
    "text": "Trump's ‘fear factor’: Scientists go silent as funding cuts escalate  —  Many worry about retribution.  But for others, speaking out is worth the risk  —  Play Pause  —  Skip backwardsGo ten seconds backward Skip forwardsGo ten seconds forward  —  Progress  —  1.0x  —  Mute Unmute",
    "url": "https://www.science.org/content/article/trump-s-fear-factor-scientists-go-silent-funding-cuts-escalate"
  },
  {
    "text": "Shame on the White House  —  If the White House wants to fire the librarian of Congress, it can.  But it was interesting to have recently had the experience of meeting this dynamic, dedicated person, and feeling so proud that she was our librarian of Congress, then reading the White House's sloppy … ",
    "url": "https://www.nytimes.com/2025/05/13/opinion/trump-firing-hayden.html?unlocked_article_code=1.G08.3IUt.2zZzIxqfwWG0&smid=url-share"
  },
  {
    "text": "RFK Jr. Swims in Washington Creek That Flows With Sewage and Bacteria  —  Robert F. Kennedy Jr., the health secretary, shared photos of himself and his grandchildren swimming in waters that handle sewer overflow.  —  Robert F. Kennedy Jr., the health secretary, posted photos on Sunday … ",
    "url": "https://www.nytimes.com/2025/05/12/us/politics/rfk-jr-rock-creek-bacteria.html"
  }
]