[
  {
    "text": "Iowa Poll: Donald Trump holds overwhelming lead; Ron DeSantis edges ahead of Nikki Haley  —  A new nationally renowned Iowa Poll shows that a shrinking field has only made Donald Trump's lead grow as Nikki Haley and Ron DeSantis fail to capitalize on powerful endorsements",
    "url": "https://www.desmoinesregister.com/story/news/politics/iowa-poll/caucus/2023/12/11/iowa-poll-ron-desantis-nikki-haley-unable-to-shrink-donald-trumps-overwhelming-lead-iowa-caucuses/71850893007/"
  },
  {
    "text": "Iowa poll: Trump surpasses 50% support ahead of first GOP contest  —  The former president leads Ron DeSantis among likely Iowa caucusgoers, 51% to 19%, with Nikki Haley at 16%.  —  Former President Donald Trump has expanded his lead over his GOP rivals with five weeks until … ",
    "url": "https://www.nbcnews.com/politics/2024-election/iowa-poll-trump-surpasses-50-support-ahead-first-gop-contest-rcna128217"
  },
  {
    "text": "U.S. has failed the Palestinian people, officials say after vetoed UN vote for Gaza Strip cease-fire  — Palestinian figureheads expressed disappointment after the United States vetoed a United Nations resolution calling for an immediate cease-fire in Gaza.",
    "url": "https://www.cnbc.com/2023/12/11/israel-hamas-us-has-failed-the-palestinian-people-officials-say.html"
  },
  {
    "text": "Trump Has Found a Dangerous Workaround to Gag Orders  —  Donald Trump will have a number of opportunities to violate gag orders in the coming months.  He may have just found a dangerous loophole.  —  Donald Trump is, once again, outmaneuvering the American court system.",
    "url": "https://www.thedailybeast.com/trump-has-found-a-dangerous-workaround-to-gag-orders"
  },
  {
    "text": "In a reversal, Donald Trump says he will not testify in his own defense in New York fraud trial  —  Trump was scheduled to take the stand Monday as the months-long $250 million civil fraud trial against him and his company enters its final week.  —  In an 11th hour reversal … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/reversal-donald-trump-says-will-not-testify-defense-new-york-fraud-tri-rcna128749"
  },
  {
    "text": "Organized journalistic crime  —  On July 19, the Washington Post Editorial Board published an impassioned column calling for an aggressive national response to organized retail crime (ORC).  The Editorial Board described ORC as “the term security specialists use to distinguish planned … ",
    "url": "https://popular.info/p/organized-journalistic-crime"
  },
  {
    "text": "House GOP chips away at centrist resistance on Biden impeachment inquiry  —  About a half-dozen members are still undecided, but there's only one public ‘no’ vote in POLITICO's whip count.  It's a rare sign of unity for the conference.  —  House Republicans are inches away … ",
    "url": "https://www.politico.com/news/2023/12/11/house-gop-chips-away-at-centrist-resistance-on-biden-impeachment-inquiry-00130909"
  },
  {
    "text": "Kevin McCarthy on Trump: America doesn't want “retribution”  —  California Republican Kevin McCarthy holds a place in history as the first-ever Speaker of the House to be voted out of that position.  Historic, but looking at how his tenure began, hardly a shock.",
    "url": "https://www.cbsnews.com/news/kevin-mccarthy-on-trump-america-doesnt-want-retribution/"
  },
  {
    "text": "Tucker Carlson Is Launching His Own Streaming Service  —  ‘Tucker Carlson Network’ is expected to go live on Monday and cost $9 a month  —  Tucker Carlson is launching his own subscription streaming service, people familiar with the matter said, the former Fox News host's official foray … ",
    "url": "https://www.wsj.com/business/media/tucker-carlson-is-launching-his-own-streaming-service-5fc2f9ba?mod=followamazon"
  },
  {
    "text": "Argentina Economic Chief to Announce First Measures Tuesday  — Spokesman Adorni didn't give specific time for announement  — Milei confirmed Sunday sharp fiscal adjustment coming soon  —  Argentina Economy Minister Luis Caputo will announce his first measures Tuesday as the government … ",
    "url": "https://www.bloomberg.com/news/articles/2023-12-11/argentina-economic-chief-to-announce-first-measures-tuesday"
  },
  {
    "text": "Former Rep. George Santos says no shortage of corruption in Congress after his expulsion on “The Point with Marcia Kramer”  —  The Point  —  George Santos has left the U.S. House of Representatives, but apparently not the public arena.  He's making personalized videos on Cameo … ",
    "url": "https://www.cbsnews.com/newyork/news/george-santos-interview-corruption-in-congress-the-point-with-marcia-kramer/"
  },
  {
    "text": "NBC News demands Trump campaign take down fake clip of reporter  —  The Scoop  —  NBC News has demanded that Donald Trump's campaign remove a video that includes audio deceptively edited to seem like it comes from an NBC correspondent after the third presidential debate, two people familiar with the exchange told Semafor.",
    "url": "https://www.semafor.com/article/12/10/2023/nbc-news-demands-trump-campaign-take-down-fake-clip-of-reporter"
  },
  {
    "text": "As Fury Erupts Over Campus Antisemitism, Conservatives Seize the Moment  —  Republicans have been attacking elite universities for years.  After a tense congressional hearing last week, many on the left are joining them.  —  For years, conservatives have struggled to persuade American voters … ",
    "url": "https://www.nytimes.com/2023/12/10/us/universities-antisemitism-conservatives-liberals.html"
  },
  {
    "text": "George Santos earning so much on Cameo, he picks up tab for political pals while hanging with Rep. Lauren Boebert in NYC  —  George Santos is making so much dough on Cameo — he picked up the tab for his political pals on Saturday night.  —  The ousted pol was hanging with “ball of energy” … ",
    "url": "https://pagesix.com/2023/12/10/gossip/george-santos-with-rep-lauren-boebert-at-late-night-nyc-bash/"
  }
]