[
  {
    "text": "John Dean: 'Trump's in trouble' after Maine ruling  —  Nixon White House attorney John Dean said Thursday he believes the Maine decision to remove former President Trump from the ballot will be difficult to overturn, calling it “very solid.”  —  Maine Secretary of State Shenna Bellows (D) … ",
    "url": "https://thehill.com/regulation/court-battles/4381399-john-dean-trump-main-ruling-in-trouble/"
  },
  {
    "text": "Maine Democrat Official *Decrees* Trump Disqualified?  —  And now there are two states which have claimed to disqualify Donald Trump from the Republican primary.  Colorado at least put on a pretense of due process with a civil lawsuit in state court that resulted in Trump being found guilty … ",
    "url": "https://hotair.com/ed-morrissey/2023/12/29/maine-democrat-official-decrees-trump-disqualified-n601766"
  },
  {
    "text": "Why Trump May Find Himself in Jail Sooner Than He Thinks  —  Donald Trump is doing his best to delay as many cases as possible.  But there's a simple reason Trump may find himself behind bars sooner than he thinks: Trump himself.  —  The countdown is on for Donald Trump's D.C. trial in March.",
    "url": "https://www.thedailybeast.com/why-trump-may-find-himself-in-jail-sooner-than-he-thinks"
  },
  {
    "text": "Deep blue California keeps Trump on the presidential ballot  —  Several leading Democratic officials had tried to remove him from the California ballot.  —  California Secretary of State Shirley Weber on Thursday included former President Donald Trump's name on the list of candidates certified … ",
    "url": "https://www.politico.com/news/2023/12/29/california-secretary-of-state-leaves-trump-on-presidential-ballot-00133304"
  },
  {
    "text": "GOP rep warns House has final say over election after states deem Trump ineligible for ballots  —  Rep. Thomas Massie (R-Ky.) issued a warning to states moving to keep former President Trump off the presidential ballot, saying the House of Representatives has the final say over whether electors … ",
    "url": "https://thehill.com/homenews/house/4382017-thomas-massie-house-2024-election-trump-ballots/"
  },
  {
    "text": "Michael Cohen Used Fake Cases Cited by A.I. to Seek an End to Court Supervision  —  Donald Trump's former fixer had sought an early end to court supervision after his 2018 campaign finance conviction.  He enlisted the help of Google Bard.  —  Michael D. Cohen, the onetime fixer … ",
    "url": "https://www.nytimes.com/2023/12/29/nyregion/michael-cohen-ai-fake-cases.html"
  },
  {
    "text": "Michael Cohen admits fake cases in early release bid came from Google AI program  —  The former Trump attorney pleaded guilty to campaign finance violations in 2018.  —  Michael Cohen, former personal lawyer to President Donald Trump, arrives at New York State Supreme Court, Oct. 25, 2023, in New York.",
    "url": "https://abcnews.go.com/US/michael-cohen-admits-fake-cases-early-release-bid/story?id=105994743"
  },
  {
    "text": "Magnetic balls sold by Walmart recalled due to choking and injury risks to kids  —  High-powered magnetic balls sold by Walmart are being recalled because similar products have led to serious injuries and even death for children who swallowed them.  —  The recall involves 5 millimeter … ",
    "url": "https://www.cbsnews.com/news/magnetic-balls-walmart-product-recall-relax/"
  },
  {
    "text": "After Rise in Murders During the Pandemic, a Sharp Decline in 2023  —  The country is on track for a record drop in homicides, and many other categories of crime are also in decline, according to the F.B.I.  —  Detroit is on track to record the fewest murders since the 1960s.",
    "url": "https://www.nytimes.com/2023/12/29/us/crime-data-fbi-homicides.html"
  },
  {
    "text": "Ohio's Republican governor vetoes trans care restriction and sports ban  —  Gov. Mike DeWine is one of only a few Republican governors to veto a restriction on transition-related care for minors or a ban on trans student athlete participation.  —  Ohio's governor vetoed a bill Friday … ",
    "url": "https://www.nbcnews.com/nbc-out/out-politics-and-policy/ohios-republican-governor-vetoes-trans-care-restriction-sports-ban-rcna131579"
  },
  {
    "text": "Public Christian schools?  Leonard Leo's allies advance a new cause  —  A tight-knit group of activists tied to Leo's non-profit network are rallying around an Oklahoma effort to create a public Catholic school.  —  POLITICO illustration by Emily Scherer/Photos by AP, Getty Images, iStock",
    "url": "https://www.politico.com/news/2023/12/29/oklahoma-public-christian-schools-00132534"
  },
  {
    "text": "Trump doesn't have immunity from Jan. 6 civil suit brought by U.S. Capitol Police officers, appeals court says  —  Washington — A federal appeals court on Friday allowed a lawsuit brought by a group of U.S. Capitol Police officers against former President Donald Trump to move forward … ",
    "url": "https://www.cbsnews.com/news/trump-jan-6-immunity-us-capitol-police-officers-civil-suit-appeals-court/"
  },
  {
    "text": "U.S. intelligence officials determined the Chinese spy balloon used a U.S. internet provider to communicate  —  An American intelligence assessment found that the balloon used a commercially available U.S. network to communicate, primarily for navigation, U.S. officials say.",
    "url": "https://www.nbcnews.com/news/investigations/us-intelligence-officials-determined-chinese-spy-balloon-used-us-inter-rcna131150"
  },
  {
    "text": "Russia unleashes huge barrage of drones and rockets on Ukraine  —  Cities across the country were hit in what Kyiv said was one of the biggest aerial attacks of the war.  —  Russia unleashed rockets and drones throughout Ukraine early Friday, damaging schools, hospitals and homes across … ",
    "url": "https://www.nbcnews.com/news/world/russian-ukraine-war-invasion-roccket-missile-attack-rcna131565"
  }
]