[
  {
    "text": "Majority of voters think Trump committed ‘serious federal crimes,’ according to NYT poll  —  The new poll comes as jury selection will begin in Trump's New York trial on Monday.  —  A majority of voters believe former President Donald Trump has committed “serious federal crimes,” … ",
    "url": "https://www.politico.com/news/2024/04/13/trump-crimes-poll-voters-00152110"
  },
  {
    "text": "Biden Shrinks Trump's Edge in Latest Times/Siena Poll  —  The president's popularity has ticked up slightly, though voters still view Donald J. Trump more favorably and have dour views of the economy.  —  President Biden has nearly erased Donald J. Trump's early polling advantage … ",
    "url": "https://www.nytimes.com/2024/04/13/us/politics/trump-biden-times-siena-poll.html"
  },
  {
    "text": "Voters think the nation is going off rails — just not in their state  —  Polls show voters believe their own state is doing much better than the country.  The size of that gap could determine who wins in November.  —  Voters are not shy about saying how bad they perceive things are.",
    "url": "https://www.washingtonpost.com/politics/2024/04/13/voter-perceptions-economy/"
  },
  {
    "text": "Vessel seized in Strait of Hormuz amid Iran tensions, shipping firms say  —  Iran's Revolutionary Guards seized an Israeli-linked cargo ship in the Strait of Hormuz on Saturday, days after Tehran said it could close the crucial shipping route and warned it would retaliate for an Israeli strike on its Syria consulate.",
    "url": "https://www.reuters.com/world/middle-east/ukmto-receives-report-incident-50nm-northeast-uaes-fujairah-2024-04-13/"
  },
  {
    "text": "Biden returns to the White House as imminent Iranian attack on Israel is possible … - Israel Defense Forces' home front command announced a state of alert starting 4pm ET Saturday and added that all schools and education institutions will be closed Sunday — another sign of an imminent attack.",
    "url": "https://www.axios.com/2024/04/13/biden-israel-iran-white-house"
  },
  {
    "text": "Iran launches hundreds of suicide drones in ‘significant escalation’ against Israel  —  Iran has launched an attack against Israel using hundreds of suicide drones, the Jewish state has confirmed.  —  Axios journalist Barak Ravid, citing a senior Israeli official, reported that hundreds of drones were headed for Israel.",
    "url": "https://nypost.com/2024/04/13/world-news/iran-launches-wave-of-drone-attacks-at-israel-report/"
  },
  {
    "text": "Biden cuts short weekend trip amid rising tensions in Middle East  —  The president returned a day earlier than planned from Delaware.  —  President Joe Biden cut short a weekend trip to his Delaware beach home to return to the White House where he will monitor events in the Middle East.",
    "url": "https://www.politico.com/news/2024/04/13/biden-cuts-trip-middle-east-00152111"
  },
  {
    "text": "Republicans in swing state Wisconsin unenthused by Trump: ‘A bad candidate’  —  Fervent Trump supporters from last elections air doubts over abortion and the man himself in state where turnout will be key  —  Terri Burl has come full circle.  —  The local Republican party official … ",
    "url": "https://www.theguardian.com/us-news/2024/apr/13/election-trump-wisconsin-republicans"
  },
  {
    "text": "Mike Pence pushes a post-Trump path for conservatives and GOP  —  The former vice president, who decided not to endorse his old running mate, believes many in the conservative movement have lost their way to populism  —  Mike Pence became vice president by bearing witness to Donald Trump … ",
    "url": "https://www.washingtonpost.com/politics/2024/04/13/mike-pence-trump-conservative-movement/"
  },
  {
    "text": "Trump the Front-Runner?  Not So Fast.  —  As foreign leaders trek to Mar-a-Lago to restore their ties to the once and future president, they might be surprised to learn that the election isn't as sealed as they seem to think.  —  Just as the stock market's record gains this year have been driven … ",
    "url": "https://www.politico.com/news/magazine/2024/04/13/trump-the-front-runner-not-so-fast-00152010"
  },
  {
    "text": "Biden wins Wyoming Democratic caucus  —  President Biden is the winner of the Wyoming Democratic presidential caucus, Decision Desk HQ has projected.  —  Biden is already the presumptive nominee of the Democratic Party, having mathematically clinched the nomination last month.",
    "url": "https://thehill.com/homenews/4591114-biden-wins-wyoming-democratic-caucuses/"
  },
  {
    "text": "Trump wields endorsement to try and remove one of two pro-impeachment Republicans left in the House  —  Former President Donald Trump wielded his endorsement in a Washington House race on Friday to try and remove one of the two Republicans left who tried to impeach him in 2021.",
    "url": "https://www.washingtonexaminer.com/news/house/2965301/trump-wields-endorsement-to-try-and-remove-one-of-two-pro-impeachment-republicans-left-in-the-house/"
  },
  {
    "text": "Trump will juggle appearances in courtroom and on campaign trail as hush money trial begins  —  Former President Donald Trump's appearance in a New York courthouse Monday for jury selection in his criminal hush money trial will kick off a weekslong juggling act between the courtroom … ",
    "url": "https://www.cnn.com/2024/04/13/politics/trump-trial-schedule/"
  },
  {
    "text": "Jordan Temporarily Closes Airspace, Citing Regional Risks  —  Jordan is temporarily closing its airspace to incoming, outgoing and transit flights on Saturday, citing growing risks in the region, the state-run Al Mamlaka news agency reported.  —  Jordan's Civil Aviation Regulatory Commission … ",
    "url": "https://www.bloomberg.com/news/articles/2024-04-13/jordan-temporarily-closes-airspace-citing-regional-risks"
  },
  {
    "text": "Donald Trump Says He Will Testify in Hush-Money Trial  —  Jury selection begins Monday in the prosecution of Donald J. Trump on charges of covering up a sex scandal.  He said he would try to sway jurors personally, though he has backed away in the past.  —  Donald J. Trump … ",
    "url": "https://www.nytimes.com/2024/04/12/nyregion/trump-trial-testify-hush-money-case.html"
  },
  {
    "text": "Judge rejects Hunter Biden's bid to dismiss the federal gun charges against him  —  The judge denied all of Biden's attempts to have the case thrown out.  —  The federal judge overseeing a case involving gun charges against Hunter Biden rejected efforts by the president's son to have the case dismissed.",
    "url": "https://www.nbcnews.com/politics/politics-news/judge-rejects-hunter-bidens-bid-dismiss-federal-gun-charges-rcna147675"
  }
]