[
  {
    "text": "Republicans Slip Nonprofit Killer Bill Into Budget Plan  —  House Republicans' draft budget bill includes a clause to give Donald Trump the ability to revoke the tax-exempt status of any group the Treasury Department says is a supporter of terrorism.  —  The move appears to be a revival … ",
    "url": "https://newrepublic.com/post/195192/republicans-trump-kill-nonprofits-tax-bill"
  },
  {
    "text": "Democrats just flipped Nebraska's biggest city  —  Democrat John Ewing unseated Republican Mayor Jean Stothert in Tuesday's officially nonpartisan election to lead Omaha, a victory that ends the GOP's 12-year hold on Nebraska's largest city.  —  Stothert conceded the race after 9 PM local … ",
    "url": "https://www.the-downballot.com/p/democrats-just-flipped-nebraskas"
  },
  {
    "text": "House Democrat forces vote on impeaching Trump  —  Rep. Shri Thanedar (D-Mich.) on Tuesday started the clock for the House to vote on his seven articles of impeachment against President Trump.  —  Why it matters: House Republicans will likely move to table — or kill — the Thanedar's motion … ",
    "url": "https://www.axios.com/2025/05/13/trump-impeachment-house-democrat-vote-thanedar"
  },
  {
    "text": "GOP heavyweights join bipartisan bashing of Trump Qatar jet deal  —  Senate Majority Leader John Thune and GOP firebrand senators are among those voicing discomfort with the deal.  —  A number of Republican lawmakers are souring on President Donald Trump's plans to accept a luxury Boeing 747 aircraft … ",
    "url": "https://www.politico.com/news/2025/05/13/senate-republicans-qatar-trump-jet-00345435"
  },
  {
    "text": "Republicans Raise Concerns Over Trump's Plane Gift as He Heads to Qatar  —  Some lawmakers flag potential security issues as the president doubles down on defending the offer, saying only a ‘fool’ would turn it down  —  WASHINGTON—Republican lawmakers on Tuesday expressed national-security concerns … ",
    "url": "https://www.wsj.com/politics/policy/republicans-raise-concerns-over-trumps-plane-gift-as-he-heads-to-qatar-0060bdec"
  },
  {
    "text": "Wisconsin Judge Indicted on Charges That She Helped Immigrant Evade Agents  —  Judge Hannah C. Dugan was accused of helping an undocumented immigrant elude federal agents who were waiting to arrest him outside her courtroom.  —  The Wisconsin judge arrested last month and accused of helping … ",
    "url": "https://www.nytimes.com/2025/05/13/us/milwaukee-judge-hannah-dugan-immigration.html"
  },
  {
    "text": "Federal grand jury indicts Milwaukee County Judge Hannah Dugan in ICE case  —  A federal grand jury indicted Milwaukee County Judge Hannah Dugan on May 13 on charges that she tried to assist an undocumented immigrant escape arrest from her courtroom last month.",
    "url": "https://eu.jsonline.com/story/news/2025/05/13/milwaukee-judge-hannah-dugan-federal-grand-jury/83459305007/"
  },
  {
    "text": "America Is the Land of Opportunity—For White South Africans  —  Sign up for Trump's Return, a newsletter featuring coverage of the second Trump presidency.  —  When the welcome ceremony was over, and the Trump officials drove off in their black SUVs, a dozen or so newly arrived South African … ",
    "url": "https://www.theatlantic.com/politics/archive/2025/05/south-african-migrants-trump/682790/"
  },
  {
    "text": "Pete Rose, ‘Shoeless’ Joe Jackson among players reinstated by MLB  —  In a historic, sweeping decision, baseball commissioner Rob Manfred on Tuesday removed Pete Rose, “Shoeless” Joe Jackson and other deceased players from Major League Baseball's permanently ineligible list.",
    "url": "https://www.espn.com/mlb/story/_/id/45115659/pete-rose-shoeless-joe-jackson-players-reinstated-mlb"
  },
  {
    "text": "First judge approves Trump invoking Alien Enemies Act to deport Venezuelans  —  A federal judge ruled Tuesday that President Trump can invoke the Alien Enemies Act (AEA) to remove Tren de Aragua members but determined the administration has provided insufficient notice before carrying out the deportations.",
    "url": "https://thehill.com/regulation/court-battles/5298369-trump-alien-enemies-act-venezuelans/"
  },
  {
    "text": "Millions Would Lose Health Coverage Under G.O.P. Bill.  But Not as Many as Democrats Say.  —  A widely circulated talking point about cuts to Medicaid inflates the legislation's effects by about five million people.  —  On Sunday, Republicans released their package of proposals to cut federal spending on Medicaid and Obamacare.",
    "url": "https://www.nytimes.com/2025/05/13/upshot/medicaid-cuts-democrats-republicans.html"
  },
  {
    "text": "Transportation Secretary Sean Duffy Changed His Wife's Flight to Avoid Newark Airport  —  Would you let your family fly out of Newark? … Transportation Secretary Sean Duffy keeps going on TV and insisting it's safe to fly in and out of Newark Liberty Airport in New Jersey … ",
    "url": "https://gizmodo.com/transportation-secretary-sean-duffy-changed-his-wifes-flight-to-avoid-newark-airport-2000601796"
  },
  {
    "text": "One of Congress' Wealthiest Members Made Stock Trades Worth Millions After Trump Announced Tariffs  —  Rep. Jefferson Shreve bought and sold millions in stocks between April 7 and April 17, according to a review of congressional records.  — Copy  —  A freshman Republican congressman … ",
    "url": "https://www.notus.org/congress/jefferson-shreve-post-tariff-stock-trades"
  },
  {
    "text": "Mild April Inflation Captures Early Stages of Tariff Effects  —  CPI was up 0.2% over the month, while annual inflation was 2.3%  —  Inflation was relatively mild in April, but economists said tariffs will end a recent lull and push up more prices in the coming months.",
    "url": "https://www.wsj.com/economy/trade/cpi-inflation-april-2025-interest-rate-8febd2d2?st=YDkNKz&reflink=desktopwebshare_permalink"
  },
  {
    "text": "How Joe Biden Handed the Presidency to Donald Trump  —  At a fateful event last summer, Barack Obama, George Clooney, and others were stunned by Biden's weakness and confusion.  Why did he and his advisers decide to conceal his condition from the public and campaign for reëlection?",
    "url": "https://www.newyorker.com/news/the-political-scene/how-joe-biden-handed-the-presidency-to-donald-trump"
  },
  {
    "text": "Tiny Company With China Ties Announces Big Purchase of Trump Cryptocurrency  —  The firm, which produces content for TikTok, recorded no revenue last year, but it announced this week that a mysterious stock sale would allow it to invest heavily in the $TRUMP memecoin.",
    "url": "https://www.nytimes.com/2025/05/13/us/politics/trump-crypto-purchase.html"
  },
  {
    "text": "A Free People Need a Free Press  —  This essay was originally delivered as a talk at the Notre Dame Kellogg Institute for International Studies on Tuesday.  —  The role of a free and independent press in a healthy democracy is under direct attack, with increasingly aggressive efforts to curtail and punish independent journalism.",
    "url": "https://www.nytimes.com/2025/05/13/opinion/ag-sulzberger-free-press.html?unlocked_article_code=1.G08.p46U.9_2oERVYRQuV&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Elon Musk's apparent power play at the Copyright Office completely backfired … What initially appeared to be a power play by Elon Musk and the Department of Government Efficiency (DOGE) to take over the US Copyright Office by having Donald Trump remove the officials in charge has now backfired … ",
    "url": "https://www.theverge.com/politics/666179/maga-elon-musk-sacks-copyright-office-perlmutter"
  },
  {
    "text": "DOGE Removes Dozens of Resurrected Contracts From Its List of Savings  —  Elon Musk's group is no longer claiming credit for canceling those contracts after The New York Times reported that they were revived.  —  Elon Musk's Department of Government Efficiency is no longer claiming credit … ",
    "url": "https://www.nytimes.com/2025/05/13/us/politics/doge-musk-contracts-trump.html"
  },
  {
    "text": "12-year-old boy left alone on sidewalk after ICE raid in Massachusetts  —  A 12-year-old boy was left behind on a street after an immigration raid in Waltham, Massachusetts.  —  United States Immigration and Customs Enforcement (ICE) agents were seen on camera leaving the boy by himself … ",
    "url": "https://www.cbsnews.com/boston/news/waltham-mass-ice-arrest-boy-left-alone/"
  },
  {
    "text": "DOJ ‘weaponization’ group will shame individuals it can't charge with crimes, new head says  —  As Jeanine Pirro prepares to become U.S. attorney in D.C., Trump loyalist Ed Martin is taking over the Justice Department's effort to investigate Trump's investigators.",
    "url": "https://www.nbcnews.com/politics/justice-department/doj-weaponization-group-will-shame-individuals-cant-charge-crimes-new-rcna206553"
  },
  {
    "text": "Trump's ICE Used a Woman's Kids and Grandchild as ‘Bait’ To Arrest Her  —  The president's crackdown on immigrants has roiled the town of Worcester, Massachusetts, following a chaotic arrest last week  —  When U.S. Immigration and Customs Enforcement (ICE) arrested Rosane Ferreira de Oliveira … ",
    "url": "https://www.rollingstone.com/politics/politics-features/ice-kids-bait-arrest-woman-worcester-massachusetts-1235338539/"
  },
  {
    "text": "Why are ICE agents such cowardly wusses?  —  Taking most of a week off, as I've just done, is impossible in the Trump 47 era.  Since I last attacked the keyboard, we got our first American pope, the mayor of Newark was arrested by federal agents, and Qatar is bribing the president with a $400 million plane, along with 57 other things.",
    "url": "https://www.inquirer.com/columnists/attytood/ice-immigration-arrests-trump-pope-leo-xiv-villanova-20250513.html"
  },
  {
    "text": "Trump officials take steps toward a radically different NSF  —  Efforts to shrink staff, budget, and focus have alarmed members of Congress  —  Skip backwardsGo ten seconds backward Skip forwardsGo ten seconds forward  —  Audio is AI-generated.  Report an issue|  Give feedback  —  Smaller.",
    "url": "https://www.science.org/content/article/trump-officials-take-steps-toward-radically-different-nsf"
  },
  {
    "text": "In High-Stakes Negotiations, Trump's Opponents Are Learning His Patterns  —  President Trump often takes maximalist positions, only to back down and declare a win.  His opponents are catching on.  —  President Trump has long reveled in his reputation as a maximalist, issuing a huge demand … ",
    "url": "https://www.nytimes.com/2025/05/13/us/politics/trump-ukraine-china-iran-negotations.html"
  },
  {
    "text": "2 more Fetterman aides leave embattled senator's office  —  The departures are the latest in a string of staff exits over the past year and a half.  —  Two more aides left John Fetterman's office in recent weeks, the latest in a stream of staff exits amid the Pennsylvania senator's shifting political persona … ",
    "url": "https://www.politico.com/news/2025/05/13/fetterman-staff-00344618"
  },
  {
    "text": "Live from Iowa...Pete Buttigieg!  —  We discuss 2028, Trump, AOC, the Democratic Party ghosting everyone, and more  —  We just talked with Pete Buttigieg, the former secretary of transportation and once (and future?) presidential candidate, (and 8,400 of you).  We got into EVERYTHING.",
    "url": "https://the.ink/p/live-from-iowapete-buttigieg"
  }
]