[
  {
    "text": "Defiant Biden tells donors: 'We're done talking about the debate'  —  A defiant President Joe Biden insisted to his donors on Monday that he is “done talking about the debate” and implored the party to ignore any further distractions and direct its attention back to Donald Trump.  “We need to move forward.",
    "url": "https://www.politico.com/live-updates/2024/07/08/congress/defiant-biden-tells-donors-were-done-with-the-debate-00166834"
  },
  {
    "text": "Read the letter President Biden sent to House Democrats telling them to support him in the election  —  President Joe Biden wants Democrats in Congress to know he has no intention of exiting this year's election, sending them a letter on Monday on his personal letterhead.",
    "url": "https://apnews.com/article/biden-letter-democrats-4562a72aa3a891e55261617d0d494d00"
  },
  {
    "text": "‘No one is picking up the phone’: Joe Biden's fundraising confronts new hurdles after debate … President Joe Biden's fundraising operation started showing cracks in its once formidable armor, almost 10 days after his disastrous presidential debate performance.",
    "url": "https://www.cnbc.com/2024/07/08/joe-biden-fundraising-debate.html"
  },
  {
    "text": "Hill Dems brace for party reckoning over Biden  —  The party's panic over the president's electability has spiraled behind the scenes — and is likely to spill more into public view in the coming days.  —  President Joe Biden's outreach efforts to congressional Democrats haven't quelled … ",
    "url": "https://www.politico.com/news/2024/07/08/hill-dems-brace-for-fight-over-bidens-future-to-get-worse-00166950"
  },
  {
    "text": "House Democrat joins donor discussion about replacing Biden on ballot  —  The donors say they have since raised $30,000 for Rep. Angie Craig's campaign as part of an effort to encourage other lawmakers to break with the president.  —  Rep. Angie Craig (D-Minn.) joined a Zoom call Sunday … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/08/house-democrat-joins-donor-discussion-about-replacing-biden-ballot/"
  },
  {
    "text": "White House doctor offers explanation for Parkinson's expert's visits  —  The doctor held regular Neurology clinics at the White House, she said  —  In a letter released late Monday night by the president's physician, Dr. Kevin O'Connor, he confirmed that Dr. Kevin Cannard … ",
    "url": "https://abcnews.go.com/Politics/white-house-doctor-offers-explanation-parkinsons-experts-visits/story?id=111764565"
  },
  {
    "text": "Parkinson's Expert Visited the White House Eight Times in Eight Months  —  The White House has said that President Biden has no signs of the disease and that there has been no reason to update the most recent testing, conducted in February.  —  An expert on Parkinson's disease … ",
    "url": "https://www.nytimes.com/2024/07/08/us/politics/parkinsons-expert-white-house.html"
  },
  {
    "text": "Peter Baker Argues Joe Biden Is Unfit because Peter Baker Is Too Lazy to Read the Homework  —  The NYT and ABC have now joined the insane mob tying the White House visits of a neurologist who has written papers on topics that include Parkinson's, Dr. Kevin Cannard, to their wild brays that Joe Biden is unfit to stay in the race.",
    "url": "https://www.emptywheel.net/2024/07/08/peter-baker-argues-joe-biden-is-unfit-because-peter-baker-is-too-lazy-to-read-the-homework/"
  },
  {
    "text": "Trump proposes scaled back platform that softens language on abortion, same sex marriage  —  The draft was circulated Monday among members of the 2024 Republican convention platform committee.  It will be discussed and voted on later this week.  —  The 2024 Republican convention platform aides … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/08/trump-abortion-republican-platform/"
  },
  {
    "text": "A Dangerous Double Standard  —  All our energies must go to defeating Trump  —  What a weekend.  You know I have seen some things in my seven decades covering American politics.  I have never seen anything quite like the wrangling, hand-wringing, and behind-the-scenes gamesmanship currently swirling around President Biden.",
    "url": "https://steady.substack.com/p/a-dangerous-double-standard"
  },
  {
    "text": "Ivanka Trump Resurfaces as Dad's Re-Election Fortunes Change  —  OH HEY THERE  —  The former White House adviser is inching her way back to the spotlight after exiting stage right following the Capitol riot.  —  Ivanka Trump's political intermission appears to be over.",
    "url": "https://www.thedailybeast.com/ivanka-resurfaces-as-donald-trumps-re-election-fortunes-change"
  },
  {
    "text": "Official Kristi Noem social media accounts appear to have been deleted  —  Error messages shown on Facebook and Twitter pages for South Dakota governor plagued by dog-killing admission  —  Kristi Noem, the Republican governor of South Dakota who has been dogged by controversy since recounting … ",
    "url": "https://www.theguardian.com/us-news/article/2024/jul/08/kristi-noem-social-media-deleted"
  },
  {
    "text": "The Enormous Risks a Second Trump Term Poses to Our Economy  —  Not long ago, one of us was having lunch with someone who manages a multibillion-dollar fund when the subject turned to the prospect of a second Trump term.  —  This person was disturbed by many of Donald Trump's actions … ",
    "url": "https://www.nytimes.com/2024/07/08/opinion/economic-risks-second-trump-term.html"
  },
  {
    "text": "Texas Governor Greg Abbott Jets Off to Asia as Hurricane Beryl Lashes His State  —  SOUND FAMILIAR?  —  Abbott departed for South Korea, Taiwan, and Japan on Friday as forecasts showed that Beryl was likely to hit Texas on Monday.  —  Texas Governor Greg Abbott boasted of having … ",
    "url": "https://www.thedailybeast.com/gov-greg-abbott-tours-jets-to-asia-as-hurricane-beryl-lashes-texas"
  },
  {
    "text": "Trump Says He Has Yet to Finalize Vice Presidential Pick  — Nominee says he'd ‘love’ to announce during the GOP convention  — Former president says he seeks someone to help him get elected  —  Donald Trump said he has yet to make a final decision on who his vice presidential pick … ",
    "url": "https://www.bloomberg.com/news/articles/2024-07-09/trump-says-he-has-yet-to-finalize-vice-presidential-pick"
  },
  {
    "text": "House Freedom Caucus ousts Warren Davidson  —  Members of the House Freedom Caucus ousted Rep. Warren Davidson (R-Ohio) on Monday night — less than a month after he started a firestorm within the group by endorsing Chair Bob Good's primary challenger.  The vote to oust Davidson took place during … ",
    "url": "https://www.politico.com/live-updates/2024/07/08/congress/another-freedom-caucus-ouster-00166978"
  },
  {
    "text": "Trump's campaign still owes El Paso over $500K for 2019 rally, other cities also unpaid  —  Donald Trump still owes several cities money from past campaign rallies, including El Paso.  —  Information compiled in 2019 from the Centers for Public Integrity shows that at least 12 cities were owed money, showing El Paso was owed the most.",
    "url": "https://kfoxtv.com/news/local/trumps-campaign-still-owes-el-paso-over-500k-for-2019-rally-other-cities-also-unpaid"
  }
]