[
  {
    "text": "Trump lagging in early vote with seniors in Pennsylvania, a red flag for GOP  —  Democrats account for about 58 percent of the votes cast by seniors so far in Pennsylvania.  —  Donald Trump is lagging Kamala Harris in Pennsylvania early voting with a critical and once-reliably Republican constituency: seniors.",
    "url": "https://www.politico.com/news/2024/10/31/trump-lagging-early-votes-seniors-pennsylvania-00186612"
  },
  {
    "text": "Men, get out and vote and don't let Harris lie her way into White House  —  What is the difference between men and women?  No - that's not one of those trick questions meant to trip-up a Democrat nominee for the Supreme Court.  —  It's an easy one.  And it's especially easy if you're … ",
    "url": "https://nypost.com/2024/10/31/opinion/men-get-out-and-vote-and-dont-let-harris-lie-her-way-into-white-house/"
  },
  {
    "text": "Liz Cheney Fires Back at Trump, Accuses Him of Threatening Her ‘With Death’ in Blistering Counter  —  Liz Cheney shot back at former President Donald Trump's comments from Thursday night, where he darkly floated a scenario where guns were firing at the former Republican Congressional leader and Kamala Harris supporter.",
    "url": "https://www.mediaite.com/politics/liz-cheney-fires-back-at-trumps-threatening-her-with-death-with-blistering-counter-attack/"
  },
  {
    "text": "AP sources: White House altered record of Biden's ‘garbage’ remarks despite stenographer concerns  —  White House press officials altered the official transcript of a call in which President Joe Biden appeared to take a swipe at supporters of Donald Trump, drawing objections from the federal workers … ",
    "url": "https://apnews.com/article/biden-garbage-transcript-puerto-rico-trump-326e2f516a94a470a423011a946b6252"
  },
  {
    "text": "When You Thought He Couldn't Sink Lower  —  Once more, with feeling: When Trump tells you who he is, believe him.  —  Donald Trump's two strongest personality traits each had a moment on the campaign trail yesterday.  —  At a rally in Albuquerque, New Mexico, the buffoon: “I'm here for one very simple reason.",
    "url": "https://www.thebulwark.com/p/when-you-thought-he-couldnt-sink"
  },
  {
    "text": "A Pregnant Teenager Died After Trying to Get Care in Three Visits to Texas Emergency Rooms  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up to receive our biggest stories as soon as they're published.  —  Candace Fails screamed for someone in the Texas hospital to help her pregnant daughter.",
    "url": "https://www.propublica.org/article/nevaeh-crain-death-texas-abortion-ban-emtala"
  },
  {
    "text": "J.Lo Claps Back at Trump Rally Puerto Rico Jab: ‘We Are Americans’  —  LET'S GET LOUD  —  “Our pain matters” the singer said at a Las Vegas event for Kamala Harris.  —  As promised, Jennifer Lopez took the stage at Kamala Harris's rally in Las Vegas on Thursday night … ",
    "url": "https://www.thedailybeast.com/jennifer-lopez-claps-back-at-trump-rally-puerto-rico-jab-we-are-americans/"
  },
  {
    "text": "Trump actually treats Puerto Rico like garbage  —  The disastrous “joke” was more than that. … ❄️ Subscribe to Public Notice ❄️  —  “Nobody loves our Latino community and our Puerto Rican community more than I do” Donald Trump blathered at a rally in Allentown, Pennsylvania, earlier this week.",
    "url": "https://www.publicnotice.co/p/trump-puerto-rico-garbage-maria-paper-towels"
  },
  {
    "text": "Listen to Jeffrey Epstein Spill Intel on Donald Trump's White House  —  OH LORDY  —  A new recording captures Epstein dishing on Trump.  —  Michael Wolff, the explosive chronicler of Donald Trump's four years in the White House, has released what he says is a recording of Jeffrey Epstein … ",
    "url": "https://www.thedailybeast.com/listen-to-jeffrey-epstein-spill-intel-on-donald-trumps-white-house-on-tape-released-by-author-michael-wolff/"
  },
  {
    "text": "Donald Trump's campaign of relentless lying  —  The United States that Donald Trump describes in his rally speeches would be pretty bad if it actually existed.  —  Schools secretly sending children for gender-affirming surgeries without parental consent.  Towns and even cities conquered by illegal immigrants.",
    "url": "https://www.cnn.com/2024/11/01/politics/analysis-donald-trumps-campaign-of-relentless-lying/"
  },
  {
    "text": "Newt Gingrich Goes Nuts Over Ad Reminding Women They Don't Have to Tell Husbands How They Voted: ‘That Is Sick!’  —  Fox News contributor Newt Gingrich went nuclear on an ad narrated by Julia Roberts in which the actress reminds women they don't have to tell people how they voted.",
    "url": "https://www.mediaite.com/tv/newt-gingrich-goes-nuts-over-ad-reminding-women-they-dont-have-to-tell-husbands-how-they-voted-that-is-sick/"
  },
  {
    "text": "Elon Musk's Machine for Fascism: A One-Stop Shop for Disinformation and Violence  —  Just over a year ago, I described how Twitter had been used as a way to sow false claims in support of Trump in 2016 and 2020.  —  I described how, in 2016, trolls professionalized their efforts … ",
    "url": "https://www.emptywheel.net/2024/11/01/elon-musks-machine-for-fascism-a-one-stop-shop-for-disinformation-and-violence/"
  },
  {
    "text": "Trump's ‘grab them’ comment was history.  Now TikTok is showing it to young voters.  —  As the audio clip circulates on the popular video app, Gen Z users are expressing their shock.  —  It's been eight years since leaked audio from a conversation between Donald Trump and TV host Billy Bush … ",
    "url": "https://www.washingtonpost.com/technology/2024/10/31/tiktok-trump-access-hollywood-gen-z/"
  },
  {
    "text": "Trump picks one-judge Texas court for lawsuit over CBS Harris interview  —  A spokesperson for CBS News called the lawsuit “completely without merit” and said “60 Minutes” fairly presented the interview of Kamala Harris.  —  Republican nominee Donald Trump sued CBS News on Thursday … ",
    "url": "https://www.washingtonpost.com/politics/2024/10/31/trump-sues-60-minutes-cbs-kamala-harris/"
  },
  {
    "text": "Europe's Greens ask Jill Stein to pull out of US election to prevent Trump victory  —  “The race for the White House is too close for comfort,” write parties from around Europe, calling on Stein to throw her support behind Democrat Kamala Harris.  —  Green politicians from across Europe … ",
    "url": "https://www.politico.eu/article/europes-greens-tell-jill-stein-to-pull-out-of-us-election-to-defeat-trump/"
  },
  {
    "text": "Trump's botched COVID response has been largely forgotten, but it's crucial we remember  —  “Post-pandemic amnesia” is a real phenomenon but experts say we shouldn't forget how Trump endangered public health  —  At a campaign event in Allentown, Pennsylvania on Wednesday … ",
    "url": "https://www.salon.com/2024/11/01/trumps-botched-response-has-been-largely-forgotten-but-its-crucial-we-remember/"
  },
  {
    "text": "Two Washington Post writers who resigned over Bezos' non-endorsement join The Atlantic  —  New York CNN  —  ﻿Two veteran writers who resigned from The Washington Post over its non-endorsement decision are joining The Atlantic.  —  Robert Kagan and Danielle Allen are coming aboard … ",
    "url": "https://www.cnn.com/2024/11/01/media/washington-post-writers-endorsement-atlantic/"
  },
  {
    "text": "Leopards Are Telling You That They Will Eat YOUR Face  —  Do you know this widely cited meme, introduced in a 2015 tweet? … It's hard to explain why this is perfect, but it is.  If Donald Trump wins, there will eventually be a lot of sobbing among people who voted for him.",
    "url": "https://www.nytimes.com/2024/10/31/opinion/trump-musk-mike-johnson.html?unlocked_article_code=1.Wk4.duhW.K0tYG-e4y7vD&smid=url-share"
  },
  {
    "text": "The Strongman Fantasy (text and audio)  —  I wrote this in March, with the text as below, and am posting this recording now, in the hopes that it can be useful.  Please share it.  TS 1/11/2024  —  Quite a few Americans like the idea of strongman rule.  Why not a dictator who will get things done?",
    "url": "https://snyder.substack.com/p/the-strongman-fantasy-text-and-audio"
  },
  {
    "text": "Georgia official says video of alleged voter fraud likely created by a Russian troll farm  —  Georgia Secretary of State Brad Raffensperger said a video purporting to show Haitians claiming that they illegally voted for Kamala Harris is fake and likely the work of a Russian troll farm.",
    "url": "https://www.cbsnews.com/news/georgia-video-fake-voter-fraud-russian-troll-farm/"
  },
  {
    "text": "‘All hell has broken loose’: Inside Elon Musk's high-stakes pro-Trump door-knocking effort  —  More than a half-dozen operatives and canvassers connected to America PAC described an inordinate number of suspect entries and having to canvass during Hurricane Helene.",
    "url": "https://www.nbcnews.com/politics/2024-election/elon-musks-high-stakes-trump-door-knocking-effort-america-pac-rcna176255?taid=6724d0249f2d880001f6fdb4"
  },
  {
    "text": "October jobs take a hit from hurricanes, strike  —  U.S. payrolls slumped sharply in October, weighed down by people not working as a result of two hurricanes and major labor disputes.  —  The U.S. added just 12,000 in October, well below economists' estimate of 100,000, marking the slowest month for hiring since December 2020.",
    "url": "https://www.cbsnews.com/news/october-jobs-take-hit-hurricane-strike/"
  }
]