[
  {
    "text": "Nikki Haley says she will only debate Donald Trump or Joe Biden  —  Nikki Haley said she wouldn't attend without Trump, who said he saw no point.  —  Republican presidential candidate former UN Ambassador Nikki Haley speaks at a caucus night party at the Marriott Hotel in West Des Moines, Iowa, Jan. 15, 2024.",
    "url": "https://abcnews.go.com/Politics/nikki-haley-debate-donald-trump-joe-biden/story?id=106409470"
  },
  {
    "text": "Judge Aileen Cannon Is Quietly Sabotaging the Trump Classified Documents Case  —  On Friday, District Judge Aileen Cannon issued a new order in the Donald Trump classified documents case adding to the mountain of evidence that she is firmly in the former president's pocket.",
    "url": "https://slate.com/news-and-politics/2024/01/judge-aileen-cannon-trump-classifed-sabotage.html"
  },
  {
    "text": "Trump Lawyers Allege Jack Smith Prosecutors are Withholding Records in Florida Case  —  In court filings totaling more than 200 pages filed on Tuesday night, Donald Trump's legal team alleged federal prosecutors are withholding records that should be turned over to the former president during … ",
    "url": "https://themessenger.com/politics/donald-trump-motion-compel-documents-florida-white-house"
  },
  {
    "text": "Trump signals intent to block testimony in Jeff Clark disciplinary proceedings  —  It's a move to shield a key Trump ally from losing his law license over his efforts to subvert the 2020 election.  —  Donald Trump has injected himself into disbarment proceedings against former Justice … ",
    "url": "https://www.politico.com/news/2024/01/16/trump-block-testimony-jeff-clark-00135931"
  },
  {
    "text": "Democrat Keen wins state House 35 special election over GOP's Booth  —  In a race seen as a bellwether for Democratic chances in November, Democrat Tom Keen flipped what had been a Republican state House seat in Central Florida in a special election held Tuesday.",
    "url": "https://www.orlandosentinel.com/2024/01/16/democrat-keen-wins-state-house-35-special-election-over-gops-booth/"
  },
  {
    "text": "Florida Democrats flip Republican House seat in Special Election  —  ORANGE COUNY, Fla. — Florida Democrats scored a win Tuesday night in a special election to fill a vacant House seat with Tom Keen defeating Erika Booth in a closely watched race that saw major outside spending and an avalanche of mailers and TV ads.",
    "url": "https://www.wftv.com/news/local/florida-democrats-flip-republican-house-seat-special-election/BDGBNIJ3CZECRMX6NTSZQVYZX4/"
  },
  {
    "text": "Grassley hospitalized to treat infection  —  Sen. Chuck Grassley (R-Iowa) has been admitted to a local Washington hospital to treat an infection, his office announced on Tuesday.  —  “Senator Chuck Grassley (R-Iowa) is receiving antibiotic infusions at an area hospital to treat an infection,” Grassley's office  said in a statement.",
    "url": "https://thehill.com/homenews/senate/4412288-grassley-hospitalized-to-treat-infection/"
  },
  {
    "text": "Iowa Sen. Chuck Grassley, oldest member of Senate, hospitalized with infection  —  WASHINGTON (AP) — Iowa Sen. Chuck Grassley, the oldest member of the U.S. Senate, has been hospitalized in the Washington area with an infection and is receiving antibiotic infusions, his office said Tuesday.",
    "url": "https://apnews.com/article/grassley-senate-hospital-infection-ad1b263dff2d9d081f22fb34b479ee92"
  },
  {
    "text": "Do You Remember the Ecstasy of Electing Joe Biden?  —  How the coalition that defeated Donald Trump crumbled.  —  We danced in the streets when Joe Biden was elected.  Do you remember?  American cities staged the greatest spontaneous outpouring of joy since V-J Day with cars honking … ",
    "url": "https://nymag.com/intelligencer/article/can-joe-biden-win-2024-presidential-election-anti-trump-coalition.html"
  },
  {
    "text": "Right-wing media mogul buys the Baltimore Sun  —  David D. Smith, the executive chairman of Sinclair Broadcast Group (Sinclair), purchased the Baltimore Sun — the largest newspaper in Maryland — for an undisclosed sum.  The acquisition means another powerful media outlet will be under … ",
    "url": "https://popular.info/p/right-wing-media-mogul-buys-the-baltimore"
  },
  {
    "text": "Haley says US has ‘never been a racist country’  —  Republican presidential candidate Nikki Haley claimed the US has “never been a racist country” during an interview with Fox News on Tuesday.  —  Haley's remarks were in response to MSNBC host Joy Reid's comments on whether Haley could win the GOP nomination as a woman of color.",
    "url": "https://www.cnn.com/2024/01/16/politics/nikki-haley-says-us-not-racist-country/"
  },
  {
    "text": "Johns Hopkins University weaponized DEI against ‘white, heterosexual, Christian males’  —  In the 21st century in the United States, we are supposed to be striving to put an end to racial discrimination.  This isn't true, however, if you are a white person, more specifically, a white male.",
    "url": "https://www.washingtonexaminer.com/opinion/2800982/johns-hopkins-universitys-bigoted-white-heterosexual-christian-people/"
  },
  {
    "text": "GOP backtracks on Mayorkas impeachment appearance, demanding written testimony  —  House Homeland Security Committee Chair Mark Green (R-Tenn.) demanded written testimony from Homeland Security Secretary Alejandro Mayorkas, abandoning plans to have the secretary's public testimony as part of his impeachment proceedings.",
    "url": "https://thehill.com/homenews/house/4413127-gop-backtracks-on-mayorkas-impeachment-appearance-demanding-written-testimony/"
  },
  {
    "text": "Shooter who killed 5 people at Colorado LGBTQ club is with hate crimes in federal court  —  The November 2022 attack shattered the sense of safety at Club Q, which served as a refuge for Colorado Springs' LGBTQ community.  —  DENVER — The shooter who killed five people and endangered … ",
    "url": "https://www.nbcnews.com/nbc-out/out-news/shooter-killed-5-people-colorado-lgbtq-club-charged-hate-crimes-federa-rcna134214"
  },
  {
    "text": "Netanyahu Accused of Risking WWIII to Save His Own Skin  —  Critics of the Israeli PM say he is so desperate to avoid political consequences that he is prolonging the crisis and raising the specter of a full-blown war.  —  The Middle East is sitting on a powder keg and the longer … ",
    "url": "https://www.thedailybeast.com/netanyahu-accused-of-risking-wwiii-to-save-his-own-skin"
  },
  {
    "text": "NEW: Capitol Police Investigating Roger Stone Remarks About Assassinating Members of Congress  —  The Capitol Police are investigating remarks made by pro-Trump political operative Roger Stone discussing the assassination of two prominent House Democrats.  A source told Mediaite the FBI is aiding with the investigation.",
    "url": "https://www.mediaite.com/trump/new-capitol-police-investigating-roger-stone-remarks-about-assassinating-members-of-congress/"
  }
]