[
  {
    "text": "Trump begins firings of FAA air traffic control staff just weeks after fatal DC plane crash  —  The Trump administration has begun firing several hundred Federal Aviation Administration employees, upending staff on a busy air travel weekend and just weeks after a January fatal mid-air collision … ",
    "url": "https://apnews.com/article/doge-faa-air-traffic-firings-safety-67981aec33b6ee72cbad8dcee31f3437"
  },
  {
    "text": "A team from SpaceX is being brought in to overhaul FAA's air traffic control system  —  The visit comes after a union representing FAA workers says hundreds are being laid off. … A team from Elon Musk's SpaceX is visiting the Air Traffic Control Command Center in Virginia Monday … ",
    "url": "https://www.theverge.com/news/614078/faa-air-traffic-control-spacex-elon-musk-layoff-staff-shortage"
  },
  {
    "text": "4 Top Officials to Resign Over Adams's Cooperation With Trump  —  Four deputy mayors to Eric Adams are leaving “to stay faithful to the oaths we swore to New Yorkers and our families,” they said in a statement.  —  Four top New York City officials said they would resign after the Justice Department moved … ",
    "url": "https://www.nytimes.com/2025/02/17/nyregion/adams-deputy-mayors-resign-trump-immigration.html"
  },
  {
    "text": "Judge seems unwilling to immediately bar Musk from meddling in federal agencies  —  Blue states have not provided enough initial evidence to justify a temporary restraining order, Judge Tanya Chutkan said at a court hearing.  —  U.S. District Judge Tanya Chutkan on Monday appeared poised … ",
    "url": "https://www.politico.com/news/2025/02/17/judge-chutkan-musk-lawsuit-hearing-00204590"
  },
  {
    "text": "Top Social Security official exits after clash with Musk's DOGE over data  —  Yet another top career staffer is leaving the administration amid a disagreement over a request by Elon Musk's team for sensitive government information.",
    "url": "https://www.washingtonpost.com/politics/2025/02/17/doge-social-security-musk/"
  },
  {
    "text": "Vance's real warning to Europe  —  Europeans need to reduce their dangerous dependence on an adversarial America  —  When JD Vance took the stage at the Munich Security Conference last week, he issued a stern warning.  The US vice-president told the assembled politicians and diplomats … ",
    "url": "https://www.ft.com/content/11f121f9-391c-4597-93f7-f12894e1b79d"
  },
  {
    "text": "No, 150-Year-Olds Aren't Collecting Social Security Benefits  —  Elon Musk claims to have found rampant fraud in the Social Security Administration.  There's a much simpler explanation.  —  Elon Musk has repeatedly claimed that his so-called Department of Government Efficiency (DOGE) … ",
    "url": "https://www.wired.com/story/elon-musk-doge-social-security-150-year-old-benefits/"
  },
  {
    "text": "Trump Voters Splinter Over His Rapid Shake-Up of Washington  —  Some core supporters love his no-holds-barred approach, but several swing voters are taken aback at his early moves",
    "url": "https://www.wsj.com/politics/policy/trump-voter-regrets-presidential-election-7b4fc43d?st=zk6sog"
  },
  {
    "text": "Thousands Gather on Presidents' Day to Call Trump a Tyrant  —  Thousands of protesters opposing broad swaths of President Trump's agenda took to the streets across the country, including outside the U.S. Capitol.  —  Thousands of protesters opposing broad swaths of President Trump's agenda took … ",
    "url": "https://www.nytimes.com/2025/02/17/us/politics/trump-musk-protests-50501-presidents-day.html"
  },
  {
    "text": "'It's gone': Elon Musk suggests without evidence that gold was ‘stolen’ from Fort Knox  —  Sen. Mike Lee (R-UT) and Department of Government Efficiency Chair Elon Musk demanded access to the gold stored at Fort Knox.  —  Writing on Musk's social media platform X, Lee said he was repeatedly denied access … ",
    "url": "https://www.rawstory.com/fort-knox/"
  },
  {
    "text": "Elon Musk ridiculed a blind person on X. Then a mob went to work.  —  Musk's unparalleled online reach on X has given him a powerful tool to attack individuals who criticize DOGE.  —  Dylan Hedtler-Gaudette works at the Project on Government Oversight, a nonpartisan watchdog group focused on reducing bureaucratic waste.",
    "url": "https://www.washingtonpost.com/technology/2025/02/17/elon-musk-x-target-critics-federal-employees/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM5NzY4NDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQxMTUwNzk5LCJpYXQiOjE3Mzk3Njg0MDAsImp0aSI6IjZmNWRhNjI3LTAzYmQtNGI2MC1iNzQ4LTFiNTFjNTMwNTA1OCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS90ZWNobm9sb2d5LzIwMjUvMDIvMTcvZWxvbi1tdXNrLXgtdGFyZ2V0LWNyaXRpY3MtZmVkZXJhbC1lbXBsb3llZXMvIn0.1OjimICgPEoOa7-8-pGolRc_WFgSdKNRV0QqcWsCLk8&itid=gfta"
  },
  {
    "text": "Trump casts psychiatric and weight-loss drugs as threats to children  —  Trump directed a panel headed by HHS Secretary Robert F. Kennedy Jr. to assess “the prevalence of and threat” posed by SSRIs, mood stabilizers, stimulants, and weight-loss drugs.",
    "url": "https://www.washingtonpost.com/health/2025/02/16/trump-psychiatric-medications-drugs-weight/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM5NzY4NDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQxMTUwNzk5LCJpYXQiOjE3Mzk3Njg0MDAsImp0aSI6IjEyMjcyZjU4LTY3NzUtNDc5Mi1hMzk1LWExMjIxMjczZWRmYiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9oZWFsdGgvMjAyNS8wMi8xNi90cnVtcC1wc3ljaGlhdHJpYy1tZWRpY2F0aW9ucy1kcnVncy13ZWlnaHQvIn0.9hLGS2XRTmRKIxWOtgOG8E39wCTyYX7bpUZ0_GCTGp4"
  },
  {
    "text": "Jewish man mistakes two Israeli tourists for Palestinians and opens fire on them in Miami  —  Victims reportedly posted ‘death to Arabs’ on social media after shooting while suspect held on attempted murder charges  —  A Jewish man in Miami Beach is facing charges of attempted murder following accusations … ",
    "url": "https://www.theguardian.com/us-news/2025/feb/17/miami-shooting-israeli-men"
  },
  {
    "text": "Argentina president faces impeachment calls over crypto crash  —  Argentine President Javier Milei is facing impeachment calls - and legal action accusing him of fraud - over his promotion of cryptocurrency on social media.  —  Milei posted on X, formerly Twitter, about the $LIBRA coin on Friday … ",
    "url": "https://www.bbc.com/news/articles/cp9x9j89evxo"
  },
  {
    "text": "Trump administration pressures Romania to lift restrictions on Tate brothers  —  Tristan and Andrew Tate have been charged with sexual misconduct, organised crime and money laundering  —  The Trump administration has pressured Romanian authorities to lift travel restrictions … ",
    "url": "https://www.ft.com/content/3f951e0b-a9cb-489a-be89-fdf9f996ed27?accessToken=zwAGLlfeunj4kc8_lR4LqctImtO-if35-ZbtJw.MEUCIFHlxjpPAtM8iekl5LfKacG7PuYyFU5hQa53CcplddekAiEAo9Un9ocX6-Ohw9c581qubZ16FDenSLBn3IpYc2261R8&sharetype=gift&token=24607851-8abe-4a5c-a23c-ca7eed8b8d9f"
  },
  {
    "text": "Bice: An Elon Musk-backed group buys at least $670,000 of TV time to support Brad Schimel  —  Conservative Supreme Court candidate Brad Schimel said just recently he was hoping conservative third-party groups would start buying up TV time in the state “very soon.”  —  Ask and you shall receive.",
    "url": "https://www.jsonline.com/story/news/politics/elections/2025/02/17/elon-musk-group-buys-tv-ads-backing-brad-schimel-for-supreme-court/78976985007/"
  },
  {
    "text": "In botched DEI purge, OSHA trashes workplace safety guidelines  —  The Occupational Safety and Health Administration (OSHA) has ordered the digital and physical destruction of 18 publications on workplace safety practices, according to an internal February 7 email obtained by Popular Information.",
    "url": "https://popular.info/p/in-botched-dei-purge-osha-trashes"
  },
  {
    "text": "Elon Musk's X blocks links to Signal, the encrypted messaging service  —  Signal has been a primary method of communication for federal workers looking to blow the whistle on DOGE.  —  Elon Musk's social media platform, X, is currently banning links to “Signal.me,” a URL used by the encrypted messaging service Signal.",
    "url": "https://www.disruptionist.com/p/elon-musks-x-blocks-links-to-signal"
  },
  {
    "text": "The Death of Government Expertise  —  Why Trump and Musk are on a firing spree  —  One of the greatest tricks that Donald Trump and Elon Musk ever pulled is to convince millions of people that DOGE, the self-styled Department of Government Efficiency, is about government efficiency.",
    "url": "https://www.theatlantic.com/ideas/archive/2025/02/career-civil-servant-end/681712/?gift=otEsSHbRYKNfFYMngVFweMfq5p_iTo295mc0_M3lQp8&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "‘Turned out the lights’: Fury hits Washington Post as it refuses to run $115K anti-Musk ad  —  The Washington Post canceled plans to run a front-and back-page advertisement that would have earned the paper $115,000 — and ran straight into fresh fury.  —  The ad, reportedly sponsored … ",
    "url": "https://www.rawstory.com/washington-post-elon-musk-2671168898/"
  },
  {
    "text": "Scoop: Why Trump targets AP … - “This isn't just about the Gulf of America,” White House deputy chief of staff Taylor Budowich told Axios. … - The dispute with AP is part of Trump's broader effort to discredit legacy media outlets and the public's trust in the press — already at a record low.",
    "url": "https://www.axios.com/2025/02/17/trump-ap-gulf-america-mexico"
  },
  {
    "text": "‘Five alarm warning’: Possible DOGE access to private taxpayer data sparks outcry  —  The Elon Musk-run effort wants to study a system that includes tax returns, Social Security numbers and other information.  —  Democrats and tax experts are sounding alarms about a plan by Elon Musk's DOGE team … ",
    "url": "https://www.politico.com/news/2025/02/17/elon-musk-doge-irs-00204579"
  }
]