[
  {
    "text": "Trump Shares New Ad: ‘God Made Trump’  —  The ad, which has a run-time of two minutes and 44 seconds, alleges that God created the former president for the purpose of leading the nation  —  “God Made Trump,” a new nearly three minute ad from former President Donald Trump's campaign claims.",
    "url": "https://themessenger.com/politics/trump-shares-new-ad-god-made-trump"
  },
  {
    "text": "'These people know what they're doing': Why Trump is attacking Haley in NH  —  What if it is closer than expected in the Granite state?  —  Donald Trump may be up by 20 percentage points in New Hampshire, but he and his team have moved swiftly to cut down any opponent they see rising.",
    "url": "https://www.politico.com/news/2024/01/05/trump-is-attacking-haley-in-nh-his-real-problem-is-the-expectations-game-00133929"
  },
  {
    "text": "Trump attorney says Kavanaugh will ‘step up’ in ballot cases  —  An attorney for former President Trump, Alina Habba, said late Thursday that she has faith in the Supreme Court and believes that Justice Brett Kavanaugh will “step up” in Trump's ballot cases in Maine and Colorado.",
    "url": "https://thehill.com/homenews/campaign/4390774-trump-attorney-kavanaugh-will-step-up-ballot-cases/"
  },
  {
    "text": "If Trump Is Not an Insurrectionist, What Is He?  —  Last month the states of Colorado and Maine moved to disqualify Donald Trump as a candidate in the 2024 presidential election, citing Section 3 of the 14th Amendment.  In response, Trump has asked the Supreme Court to intervene on his behalf … ",
    "url": "https://www.nytimes.com/2024/01/05/opinion/trump-insurrections-disqualification-14th-amendment.html"
  },
  {
    "text": "What January 6 Made Clear to Me  —  Our democratic institutions are only as strong as the courage of those entrusted with their care.  —  The sixth of january is the date prescribed in United States law for Congress to count the electoral votes in the presidential election.",
    "url": "https://www.theatlantic.com/ideas/archive/2024/01/three-years-after-january-6-capitol-insurrection-trump/677024/"
  },
  {
    "text": "The White House's tense podium battle  —  They share a podium — and a mutual frustration.  White House press secretary Karine Jean-Pierre and the National Security Council's John Kirby frequently split the podium at media briefings, but behind the scenes their relationship is fraught with tension, White House sources tell Axios.",
    "url": "https://www.axios.com/2024/01/05/white-house-press-secretary-jean-pierre-kirby-tension"
  },
  {
    "text": "Why this jobs report matters  —  Editor's note: Morning Money is a free version of POLITICO Pro Financial Services morning newsletter, which is delivered to our subscribers each morning at 5:15 a.m. The POLITICO Pro platform combines the news you need with tools you can use to take action on the day's biggest stories.",
    "url": "https://www.politico.com/newsletters/morning-money/2024/01/05/why-this-jobs-report-matters-00133966"
  },
  {
    "text": "Florida resort cancels Jan. 6 event featuring Marjorie Taylor Greene  —  A resort in Florida canceled an event set for Saturday featuring Rep. Marjorie Taylor Greene (R-Ga.) on the third anniversary of the Jan. 6, 2021, attack on the Capitol, claiming it was “not made aware” of its purpose.",
    "url": "https://thehill.com/homenews/house/4390040-florida-resort-cancels-jan-6-event-with-marjorie-taylor-greene/"
  },
  {
    "text": "Trump's China Scandal Is Way Worse Than What Biden Is Getting Impeached Over … House Democrats have produced a report showing that, during his presidency, Donald Trump accepted $7.8 million from foreign countries, most of which were from China.  This serves as another illustration … ",
    "url": "https://nymag.com/intelligencer/2024/01/biden-getting-impeached-for-less-than-trumps-china-scandal.html"
  },
  {
    "text": "FDA Authorizes Florida's Drug Importation Program  —  For Immediate Release:  —  Today, the U.S. Food and Drug Administration authorized Florida's Agency for Health Care Administration's drug importation program under section 804 of the Federal Food, Drug, and Cosmetic Act (FD&C Act).",
    "url": "https://www.fda.gov/news-events/press-announcements/fda-authorizes-floridas-drug-importation-program"
  },
  {
    "text": "Court says even passive members of Jan. 6 mob can be convicted of disorderly conduct  —  The decision is a victory for the Justice Department on one of the most common charges lodged against Jan. 6 defendants.  —  A federal appeals court ruled Friday that Jan. 6 defendants can be found culpable of … ",
    "url": "https://www.politico.com/news/2024/01/05/court-says-even-passive-members-of-jan-6-mob-can-be-convicted-of-disorderly-conduct-00134030"
  },
  {
    "text": "Florida ready to follow Ohio and secure abortion rights  —  A measure has reached the threshold to qualify for this year's ballot.  —  TALLAHASSEE, Florida — Florida abortion rights advocates, who have seen access to the procedure erode in the state and nationally in recent years … ",
    "url": "https://www.politico.com/news/2024/01/05/florida-abortion-rights-amendment-00133938"
  },
  {
    "text": "Doug Lamborn won't seek reelection in 2024, meaning all of Colorado's Republican-held congressional seats will be open  —  U.S. Rep. Doug Lamborn won't run for reelection this year to a 10th term in Congress, the Colorado Springs Republican announced Friday, a decision that's certain to ignite … ",
    "url": "https://coloradosun.com/2024/01/05/doug-lamborn-retire-colorado/"
  },
  {
    "text": "CDC map shows dramatic increase in illness nationwide: See where it's worst  —  (NEXSTAR) - What a difference a week can make.  New data released by the Centers for Disease Control and Prevention Friday shows an 18% jump in people testing positive for influenza last week.",
    "url": "https://thehill.com/homenews/nexstar_media_wire/4391183-cdc-map-shows-dramatic-increase-in-illness-nationwide-see-where-its-worst/"
  }
]