[
  {
    "text": "How Donald Trump's DOJ gave Biden a major assist in the coming impeachment probe  —  The department's 2020 opinion around Trump's impeachment trial could place some serious constraints on House Republicans now.  —  Joe Biden has a literal Trump card to play against the House's new impeachment inquiry.",
    "url": "https://www.politico.com/news/2023/09/12/trump-doj-assist-biden-impeachment-probe-00115393"
  },
  {
    "text": "Trump privately discussed Biden impeachment with House GOPers  —  The former president talked with House GOP Conference Chair Elise Stefanik on Tuesday.  —  Donald Trump has been weighing in behind the scenes in support of the House GOP push to impeach President Joe Biden … ",
    "url": "https://www.politico.com/news/2023/09/12/trump-privately-discussed-biden-impeachment-with-house-gopers-00115357"
  },
  {
    "text": "Assessing the allegations that triggered McCarthy's impeachment inquiry  —  On Tuesday morning, House Speaker Kevin McCarthy (R-Calif.) announced that he was authorizing an impeachment inquiry into President Biden.  —  In making the announcement, he delineated six predicates for taking the historic step.",
    "url": "https://www.washingtonpost.com/politics/2023/09/12/mccarthy-flawed-allegations-biden-impeachment/"
  },
  {
    "text": "Kevin McCarthy announces House will begin an impeachment inquiry into Biden  —  “This logical next step will give our committees the full power to gather all the facts and answers for the American public is exactly what we want to know the answers,” he said.  —  McCarthy endorses Biden impeachment inquiry",
    "url": "https://www.nbcnews.com/politics/joe-biden/kevin-mccarthy-plans-formally-endorse-impeachment-inquiry-biden-rcna104585"
  },
  {
    "text": "GOP lawyer with ties to three Trump rivals enters 14th Amendment fray  —  The attorney represents a private individual, not any of the campaigns, as he explores whether Trump should be ruled ineligible to run for president  —  A Republican election lawyer with ties to three … ",
    "url": "https://www.washingtonpost.com/politics/2023/09/12/trump-gop-lawyer-14th-amendment/"
  },
  {
    "text": "Judge rejects Trump's request to move Colorado ballot case to federal court  —  A lawsuit brought by a group of Colorado voters cited the Constitution's 14th Amendment in their effort to prevent Trump from getting on the state ballot in 2024.  —  A judge on Tuesday denied former President … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/judge-rejects-trump-request-move-colorado-ballot-case-federal-court-rcna104758"
  },
  {
    "text": "Fox Sued by New York City Pension Funds Over Election Falsehoods  —  The funds accuse the Fox Corporation board of neglecting its responsibility to shareholders by leaving the company open to defamation lawsuits.  —  New York City's pension funds sued the Fox Corporation and its board on Tuesday … ",
    "url": "https://www.nytimes.com/2023/09/12/business/media/fox-shareholder-lawsuit.html"
  },
  {
    "text": "Popular nasal decongestant doesn't actually relieve congestion, FDA advisers say  —  The leading decongestant used by millions of Americans looking for relief from a stuffy nose is likely no better than a dummy pill, according to government experts who reviewed the latest research on the long-questioned drug ingredient.",
    "url": "https://apnews.com/article/sudafed-decongestants-phenylephrine-pseudoephedrine-fda-0f140bafae9a500c5fba05fe764ecb66"
  },
  {
    "text": "The unconstitutional plan to stop women from traveling out of state for an abortion, explained  —  The age of travel bans is now upon us.  —  More than a year ago, anti-abortion activists appeared eager to prohibit anyone seeking an abortion in a state where it is banned from traveling to another state where it is legal.",
    "url": "https://www.vox.com/23868962/texas-abortion-travel-ban-unconstitutional"
  },
  {
    "text": "Up to $135B in unemployment aid stolen during pandemic: watchdog  —  The U.S. Government Accountability Office (GAO) estimated that the amount of unemployment insurance (UI) fraud during the pandemic is likely between $100 billion and $135 billion, according to a report released Tuesday.",
    "url": "https://thehill.com/homenews/administration/4200337-up-to-135b-in-unemployment-aid-stolen-during-pandemic-watchdog/"
  },
  {
    "text": "Lauren Boebert escorted out of “Beetlejuice” musical in Denver after “causing a disturbance”  —  Boebert campaign manager says congresswoman was just “enthusiastically” enjoying Sunday's show  —  U.S. Rep. Lauren Boebert was escorted out of a Sunday night performance of the “Beetlejuice” … ",
    "url": "https://www.denverpost.com/2023/09/12/lauren-boebert-removed-beetlejuice-musical-denver/"
  },
  {
    "text": "Senior FBI agent disputes some whistleblowers' claims about Hunter Biden probe  —  Thomas Sobocinski, who manages the FBI team investigating Hunter Biden, was interviewed by the House Judiciary Committee  —  The FBI agent overseeing the investigation into Hunter Biden disputed whistleblower claims … ",
    "url": "https://www.washingtonpost.com/politics/2023/09/12/hunter-biden-fbi-transcript-weiss-sobocinski/"
  },
  {
    "text": "Drug kingpin El Chapo's wife Emma Coronel set to be released, say US authorities  —  Emma Coronel, the wife of imprisoned Mexican drug lord Joaquin “El Chapo” Guzman, will be freed in Los Angeles on Wednesday following her arrest in 2021 on drug trafficking charges, according to the U.S. Bureau of Prisons.",
    "url": "https://www.reuters.com/world/americas/drug-kingpin-el-chapos-wife-emma-coronel-set-be-released-say-us-authorities-2023-09-12/"
  },
  {
    "text": "Trump and his cronies underestimated Fani Willis  —  Fulton County District Attorney Fani T. Willis has been the target of right-wing venom and legal second-guessing.  I was among those who doubted the wisdom of bringing a complex racketeering charge in Georgia, which complicated her opposition … ",
    "url": "https://www.washingtonpost.com/opinions/2023/09/12/fani-willis-underestimated/"
  },
  {
    "text": "Newsom announces climate-focused trip to China  —  “You better believe I coordinated with the White House,” he said.  —  SACRAMENTO, Calif. — Gov. Gavin Newsom (D) will go to China next month to meet with officials on climate change, he said Tuesday.  —  “The imperative of maintaining … ",
    "url": "https://www.politico.com/news/2023/09/12/newsom-climate-trip-to-china-00115495"
  },
  {
    "text": "CIA tried to pay off analysts to bury findings that COVID lab leak was likely: whistleblower  —  The Central Intelligence Agency offered to pay off analysts in order to bury their findings that COVID-19 most likely leaked from a lab in Wuhan, China, new whistleblower testimony to Congress alleges.",
    "url": "https://nypost.com/2023/09/12/cia-tried-to-pay-off-analysts-to-bury-covid-lab-leak-findings-whistleblower/"
  },
  {
    "text": "U.S. Incomes Fall for Third Straight Year  —  Rapid price increases hit household finances in 2022, cutting inflation-adjusted median income to $74,580  —  Surging inflation gobbled up household income gains last year, making 2022 the third straight year in which Americans saw … ",
    "url": "https://www.wsj.com/economy/u-s-incomes-fall-for-third-straight-year-7b8293c6?mod=followamazon"
  },
  {
    "text": "Alabama officials are working to restrict rights, up to SCOTUS and across the South  —  Alabama's leaders continue fighting against voting rights for Black Alabamians and medically necessary care for transgender Alabamians — with Floridians and Georgians affected, too.",
    "url": "https://www.lawdork.com/p/alabama-voting-rights-scotus-trans-care"
  },
  {
    "text": "Freedom Caucus digs in on spending demands of McCarthy  —  Members of the hard-line conservative House Freedom Caucus marked their return to Washington on Tuesday by digging in on their calls for policy conditions on a stopgap measure to fund the government past a Sept. 30 shutdown deadline.",
    "url": "https://thehill.com/homenews/house/4200678-freedom-caucus-digs-in-on-spending-demands-of-mccarthy/"
  },
  {
    "text": "InfoWars host sentenced to 60 days in Capitol riot case  —  Owen Shroyer, a right-wing conspiracy theorist and InfoWars host, was sentenced to 60 days in jail on Tuesday for his involvement in the January 6, 2021, attack on the US Capitol.  —  Shroyer pleaded guilty to one misdemeanor count … ",
    "url": "https://www.cnn.com/2023/09/12/politics/infowars-shroyer-capitol-riot/"
  },
  {
    "text": "Putin, Citing Trump ‘Persecution,’ Wades Back Into U.S. Politics  —  The Russian leader, whose government meddled in the American presidential election won by Donald J. Trump, also offered words of praise for Elon Musk.  —  The setting was an economic conference in far eastern Russia … ",
    "url": "https://www.nytimes.com/2023/09/12/world/europe/putin-trump-musk.html"
  },
  {
    "text": "Tim Scott's girlfriend … In June, as Sen. Tim Scott (R-S.C.) began to get a little momentum in the presidential primary, a person working on behalf of one of Scott's Republican opponents messaged me, asking to chat.  —  “Have you seen the video,” he asked over the phone, conspiratorially, “where he says he has a girlfriend?”",
    "url": "https://www.washingtonpost.com/style/2023/09/12/tim-scott-girlfriend-republican-presidential-candidate/"
  }
]