[
  {
    "text": "Trudeau says Trump would raise prices on Americans if he follows through on Canada tariff threat  —  Canadian Prime Minister Justin Trudeau said Friday that if President-elect Donald Trump follows through on this threat to impose sweeping tariffs on Canadian products, he would be raising prices … ",
    "url": "https://apnews.com/article/canada-us-trudeau-trump-tariffs-4129d793d8e1a60fd6d1f45697901a21"
  },
  {
    "text": "Trudeau in Florida to meet with Donald Trump in wake of tariff threat  —  U.S. president-elect said earlier this week he would impose hefty tariffs on Canada and Mexico  —  Prime Minister Justin Trudeau is in Palm Beach, Fla. to meet with U.S. president-elect Donald Trump, according to senior government sources.",
    "url": "https://www.cbc.ca/news/politics/trudeau-trump-tariff-1.7397564"
  },
  {
    "text": "Trump, Trudeau to meet at Mar-a-Lago amid tariff threats  —  Trudeau's plane reportedly landed in Palm Beach earlier Friday.  —  President Donald Trump welcomes Canadian Prime Minister Justin Trudeau at the White House in Washington, Oct. 11, 2017.  —  Canadian Prime Minister Justin Trudeau … ",
    "url": "https://abcnews.go.com/Politics/trump-trudeau-meet-mar-lago-amid-tariff-threats/story?id=116329095"
  },
  {
    "text": "Trump's Ukraine envoy has a plan to end the war that Putin may revel in  —  In a single post, the president-elect told the world what the end of the Ukraine war might look like.  And it is going to be a big diplomatic ask, to say the least.  —  “I am very pleased to nominate General Keith Kellogg … ",
    "url": "https://www.cnn.com/2024/11/29/europe/trump-new-ukraine-envoy-analysis-intl/"
  },
  {
    "text": "Trump Disavowed Project 2025 During the Campaign.  Not Anymore.  —  President-elect Donald J. Trump has filled his administration with people who have ties to the right-wing manifesto.  —  During the campaign, President-elect Donald J. Trump swore he had “nothing to do with” … ",
    "url": "https://www.nytimes.com/2024/11/29/us/politics/trump-project-2025.html"
  },
  {
    "text": "Zelenskiy Open to Cease-Fire If NATO Protects Unoccupied Areas  — Signals openness to cease-fire without winning back territory  — NATO membership unlikely soon or to cover only part of country  —  Ukraine President Volodymyr Zelenskiy suggested he'd accept a cease-fire with Russia … ",
    "url": "https://www.bloomberg.com/news/articles/2024-11-29/zelenskiy-suggests-cease-fire-if-nato-protects-unoccupied-land"
  },
  {
    "text": "Zelenskyy suggests ‘hot phase’ of Ukraine war could end in return for NATO membership if offered - even if seized land isn't returned immediately  —  The Ukrainian president told Sky News's chief correspondent Stuart Ramsay NATO membership would have to be offered to unoccupied parts … ",
    "url": "https://news.sky.com/story/zelenskyy-suggests-hes-prepared-to-end-ukraine-war-in-return-for-nato-membership-even-if-russia-doesnt-immediately-return-seized-land-13263085"
  },
  {
    "text": "CNN host visibly stunned by incoming border czar saying he'll ‘jail’ Denver mayor for refusing deportations  —  Denver mayor has said he's willing to go to jail in protest of Trump immigration policies  —  Join Fox News for access to this content  —  CNN host Kasie Hunt was visibly stunned … ",
    "url": "https://www.foxnews.com/media/cnn-host-stunned-incoming-border-czar-jail-denver-mayor-refusing-deportations"
  },
  {
    "text": "Exclusive: Trump wants Gaza ceasefire deal before inauguration, Graham says … - Israeli officials believe the Trump administration might take a different approach to Gaza, specifically on what the “day after” the war would look like.  — But Graham — who speaks with Trump frequently … ",
    "url": "https://www.axios.com/2024/11/29/trump-gaza-ceasefire-hostage-deal"
  },
  {
    "text": "Pete Hegseth's Mother Accused Her Son of Mistreating Women for Years  —  Penelope Hegseth made the accusation in an email to her son in 2018, amid his contentious divorce.  She said on Friday that she regretted the email and had apologized to him.  —  The mother of Pete Hegseth … ",
    "url": "https://www.nytimes.com/2024/11/29/us/politics/pete-hegseth-mother-email.html?unlocked_article_code=1.d04.hkIK.QnXcVaptGbvi&smid=url-share"
  },
  {
    "text": "Ranking the Democrats: Here's who the party could nominate next as president  —  Democrats are licking their wounds after Vice President Harris's defeat to President-elect Trump, but already are looking toward who might lead their party in a 2028 presidential contest.  —  It's a fight that looks wide open.",
    "url": "https://thehill.com/homenews/campaign/5013304-democrats-2028-presidential-contenders/"
  },
  {
    "text": "Former Senate counsels: FBI vetting of Trump Cabinet picks is ‘a must’  —  Two former Senate counsels agreed in a New York Times op-ed published Friday that President-elect Trump nominations for his Cabinet need to undergo FBI checks.  —  The essay comes as some Republicans are rejecting … ",
    "url": "https://thehill.com/homenews/senate/5015186-fbi-vetting-of-trump-cabinet-picks-nyt/"
  },
  {
    "text": "Elon Musk's DOGE partner Vivek Ramaswamy says they'll scrutinize $6.6 billion Biden loan to Tesla rival Rivian  —  Donald Trump's designated government efficiency co-czar, Vivek Ramaswamy, signaled his intention to scrutinize a loan granted by the Biden administration to EV manufacturer Rivian, a rival of Tesla.",
    "url": "https://fortune.com/2024/11/29/vivek-ramaswamy-elon-musk-doge-tesla-rivian-biden-federal-government-loan-trump/"
  },
  {
    "text": "With Ag secretary pick, Trump brushes back RFK Jr.  —  Trump's HHS pick Robert F. Kennedy Jr. and other Trump allies have been bitterly warring over the USDA chief role for weeks.  —  Robert F. Kennedy Jr. spent weeks lobbying Donald Trump to nominate an Agriculture secretary who would be his ally … ",
    "url": "https://www.politico.com/news/2024/11/27/trump-rollins-usda-rfk-influence-00191779"
  },
  {
    "text": "Tesla owners turn against Musk: 'I'm embarrassed driving this car around'  —  The electric car brand was once a liberal favourite - but the CEO's embrace of Trump has led to an angry backlash  —  As Elon Musk has embraced Donald Trump and various far-right conspiracy theories … ",
    "url": "https://www.theguardian.com/technology/2024/nov/29/tesla-owners-elon-musk"
  },
  {
    "text": "Gavin Newsom and his wife Jennifer's Thanksgiving Day message to Californians spectacularly backfires... and everyone is saying the same thing  —  Gavin Newsom has been slammed online for posting a turkey of a Thanksgiving video amid concerns the wealthy governor is out of touch with his state's problems.",
    "url": "https://www.dailymail.co.uk/news/article-14138821/Gavin-Newsom-wife-Thanksgiving-message-California-backfires.html"
  },
  {
    "text": "Putin praises ‘intelligent’ Trump amid assassination threats  —  Russian President Vladimir Putin praised President-elect Trump as an “intelligent” and “experienced” leader Thursday, while noting he does not believe the president-elect is “safe” following the two attempts on his life earlier this year.",
    "url": "https://thehill.com/policy/international/5014874-putin-trump-praise-intelligent-assassination-threats/"
  }
]