[
  {
    "text": "Elon Musk has said he plans to commit around $45 million a month to a new super political-action committee backing former President Donald Trump's presidential run, according to people familiar with the matter.  —  Other backers of the group, called America PAC, include Palantir Technologies … ",
    "url": "https://www.wsj.com/politics/elections/elon-musk-has-said-he-is-committing-around-45-million-a-month-to-a-new-pro-trump-super-pac-dda53823"
  },
  {
    "text": "JD Vance is Trump's gift to Putin  —  The GOP nominee may have picked the one American his second-biggest donor prefers over him.  —  1×  —  The pick of JD Vance, who underperformed Ohio's last Republican Senator by 15% and the entire Ohio GOP ticket by 11%, has made clear … ",
    "url": "https://i-know-how-much-you-care.ghost.io/jd-vance-is-donald-trumps-gift-to-putin/"
  },
  {
    "text": "Behind the Curtain: Why J.D. … - Youth & vigor: Vance, who turns 40 in two weeks, is half Trump's age. … - Smart: Vance can put an intellectual wrapper around Trump's red meat. … - American Dream bio: James David Vance grew up in a broken Rust Belt home in Middletown, Ohio, with deep ties to Appalachia.",
    "url": "https://www.axios.com/2024/07/16/trump-vp-pick-jd-vance-rnc"
  },
  {
    "text": "What J.D. Vance really believes  —  I met Sen. J.D. Vance (R-OH), Donald Trump's new choice for vice president, in the summer of 2022.  I was covering a conservative conference in Israel, and Vance was the surprise VIP attraction.  We chatted for a bit about the connections between right … ",
    "url": "https://www.vox.com/politics/360283/jd-vance-trump-vp-vice-president-authoritarian"
  },
  {
    "text": "The Authoritarian Ticket  —  Another one for the “weeks where decades happen” files: Hours before the Republican National Convention and Donald Trump's selection of J.D. Vance as his running mate took over the news cycle, Judge Aileen Cannon squeezed in a little news of her own … ",
    "url": "https://www.thebulwark.com/p/the-authoritarian-ticket"
  },
  {
    "text": "Musk pledges to give $45M a month to Trump super PAC: report  —  Tech billionaire Elon Musk said he will commit $45 million per month to a new political action committee backing former President Trump, The Wall Street Journal reported Monday.  Musk's announcement comes on the same day Trump … ",
    "url": "https://thehill.com/homenews/campaign/4774132-elon-musk-45m-a-month-trump-super-pac-report/"
  },
  {
    "text": "Special counsels are unconstitutional if they make Trump sad  —  So says Aileen Cannon, who makes a mockery of the rule of law. … It finally happened.  —  Judge Aileen Cannon, who has been telegraphing for months that she was committed to finding a way to get Trump off the hook … ",
    "url": "https://www.publicnotice.co/p/aileen-cannon-jack-smith-unconstitutional"
  },
  {
    "text": "Judge Aileen Cannon does Trump's bidding in dismissing Mar-a-Lago case  —  A day bookended by reminders that Donald Trump expects and rewards obedience — from Cannon's Florida ruling to Trump's VP pick, J.D. Vance.  —  U.S. District Judge Aileen Cannon is a Trump appointee who rules … ",
    "url": "https://www.lawdork.com/p/cannon-dismisses-mar-a-lago-case"
  },
  {
    "text": "Firefighter Corey Comperatore's widow refused Biden call after Trump rally shooting: 'Didn't want to talk to him'  —  SARVER, Pa. — The heartbroken widow of Corey Comperatore, the hero firefighter shot dead by a sniper at a Trump rally, wanted nothing to do with President Biden when he called after the tragedy, she told The Post.",
    "url": "https://nypost.com/2024/07/15/us-news/corey-comperatores-widow-refused-biden-call-after-trump-rally-shooting/"
  },
  {
    "text": "UK deputy PM dismisses ‘Islamist’ nuclear state jibe by Trump VP pick Vance  —  Britain's deputy prime minister on Tuesday played down comments by U.S. vice presidential contender J.D. Vance that Britain was an Islamist nuclear-armed country, saying he had a history of making “fruity” remarks.",
    "url": "https://www.reuters.com/world/uk-deputy-pm-dismisses-islamist-nuclear-state-jibe-by-trump-vp-pick-vance-2024-07-16/"
  },
  {
    "text": "Bandaged Trump defiantly appears at RNC 2024 just days after dodging assassin's bullet  —  MILWAUKEE - Republican presidential nominee Donald Trump made an appearance Monday at the GOP convention, two days after he was left bloodied by a sniper's bullet.  —  Most of the 78-year-old former … ",
    "url": "https://nypost.com/2024/07/15/us-news/bandaged-trump-appears-at-gop-convention-just-days-after-assassination-attempt/"
  },
  {
    "text": "Biden allies worry he is not getting complete information about race  —  Concern grows among Democrats that he is hearing from a shrinking number of aides.  —  Democratic lawmakers and strategists inside the effort to reelect President Biden have grown concerned in recent days that he is listening … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/15/biden-inner-circle-shrinking/"
  },
  {
    "text": "FBI, DHS warn of possible retaliation for attack on Trump  —  Intelligence bulletin raises alarm about election violence.  —  U.S. authorities are concerned about possible attacks in retaliation to the attempted assassination of Donald Trump, the FBI and Department of Homeland Security … ",
    "url": "https://www.politico.com/news/2024/07/15/fbi-dhs-possible-retaliation-trump-shooting-00168549"
  },
  {
    "text": "Kennedy and West third-party ballot drives are pushed by secretive groups and Republican donors  —  WASHINGTON (AP) — Libertarians in Colorado want to put Robert F. Kennedy Jr. on the ballot to create chaos.  —  Petition drives for Cornel West in Virginia and North Carolina are being run by groups with Republican ties.",
    "url": "https://apnews.com/article/kennedy-west-third-party-2024-election-10c4c166ad4d41cab73660c33a69a58a"
  },
  {
    "text": "Trump 2.0 could be bad news for global inflation, analysts say … A second presidential term for former President Donald Trump could reignite global inflation as his America-first policies drive up costs across the world, analysts warned.  —  The high tariff, low tax economic agenda … ",
    "url": "https://www.cnbc.com/2024/07/16/trump-2point0-could-be-bad-news-for-global-inflation-analysts-say.html"
  },
  {
    "text": "ABC Exclusive: Trump rally shooting ‘unacceptable,’ Secret Service director says  —  “The buck stops with me,” Kimberly Cheatle said in an ABC News interview.  —  U.S. Secret Service Director Kimberly Cheatle sat down with ABC News in her first network interview since the assassination attempt on former President Donald Trump.",
    "url": "https://abcnews.go.com/US/trump-rally-shooting-unacceptable-secret-service-director-abc-exclusive/story?id=111962314"
  },
  {
    "text": "Exclusive: In blow to Biden, Teamsters consider no endorsement in 2024 race  —  President Joe Biden is on the brink of failing to win a key labor endorsement as leaders of the 1.3 million-member Teamsters union consider backing no candidate at all in the U.S. presidential race, according to two people familiar with the matter.",
    "url": "https://www.reuters.com/world/us/blow-biden-teamsters-consider-no-endorsement-2024-race-2024-07-15/"
  },
  {
    "text": "School Vouchers Were Supposed to Save Taxpayer Money.  Instead They Blew a Massive Hole in Arizona's Budget.  —  Arizona, the model for voucher programs across the country, has spent so much money paying private schoolers' tuition that it's now facing hundreds of millions in budget cuts to critical state programs and projects.",
    "url": "https://www.propublica.org/article/arizona-school-vouchers-budget-meltdown"
  }
]