[
  {
    "text": "House speaker live updates: Republicans to vote behind closed-doors to pick leader  — Republicans Reps. Steve Scalise, of Louisiana, and Jim Jordan, of Ohio, are the two declared candidates for House speaker to replace Rep. Kevin McCarthy, R-Calif.  — House Republicans met Tuesday night … ",
    "url": "https://www.nbcnews.com/politics/congress/live-blog/house-speaker-live-updates-rcna119455"
  },
  {
    "text": "Initial US intelligence suggests Iran was surprised by the Hamas attack on Israel  —  The United States has collected specific intelligence that suggests senior Iranian government officials were caught by surprise by Saturday's bloody attack on Israel by Hamas, according to multiple sources familiar with the intelligence.",
    "url": "https://www.cnn.com/2023/10/11/politics/us-intelligence-iran-hamas-doubt/"
  },
  {
    "text": "9 UN staffers killed in airstrikes in Gaza  —  Nine United Nation staff members have been killed by Israeli airstrikes in Gaza since Saturday, the UN's agency for Palestinian refugees confirmed Wednesday.  —  The UN Relief and Works Agency (UNRWA) said nine staffers have been killed … ",
    "url": "https://thehill.com/policy/international/4249540-9-un-staffers-killed-in-airstrikes-in-gaza/"
  },
  {
    "text": "Hamas Seeds Violent Videos on Sites With Little Moderation  —  The strategy mirrors efforts by extremist groups like the Islamic State and Al Qaeda in years past.  —  A video of a Hamas gunman firing his assault rifle at a car full of Israeli civilians was viewed more than one million times on X … ",
    "url": "https://www.nytimes.com/2023/10/10/technology/hamas-violent-videos-online.html"
  },
  {
    "text": "NYU Student Bar Association President Loses Job Offer for Calling Israel Massacre ‘Necessary’ as School Distances Itself  —  ‘Israel bears full responsibility for this tremendous loss of life,’ wrote Ryna Workman of the terror attack that left at least 1,200 people dead",
    "url": "https://themessenger.com/news/nyu-student-bar-association-president-loses-job-offer-for-calling-israel-massacre-necessary-as-school-distances-itself"
  },
  {
    "text": "Crackpot fight!  Trump is worried about RFK Jr. running for president — and he should be scared  —  Trump depends on the crank vote that the anti-vaccine conspiracy theorist could siphon off  —  He may not have bolts sticking out of his neck, but Robert F. Kennedy Jr. is morphing into the MAGA version of Frankenstein's monster.",
    "url": "https://www.salon.com/2023/10/11/crackpot-fight-is-worried-about-rfk-jr-running-for-and-he-should-be-scared/"
  },
  {
    "text": "North Carolina Republicans enact election changes over Democratic governor's vetoes  —  RALEIGH, N.C. — North Carolina Republicans enacted vote-count restrictions and weakened the governor's ability to oversee elections and other state regulatory bodies on Tuesday by overriding Democratic Gov. Roy Cooper's vetoes.",
    "url": "https://www.npr.org/2023/10/10/1204941814/north-carolina-republican-election-laws"
  },
  {
    "text": "Republican lawmakers to introduce resolution to expel Rep. George Santos from Congress  —  The movement came a day after Santos, also a Republican, was charged with fraud and identity theft.  —  A group of House Republicans from New York are introducing a resolution to expel Rep. George Santos, R-N.Y., from Congress.",
    "url": "https://www.nbcnews.com/politics/congress/new-york-house-republicans-introduce-resolution-expel-rep-george-santo-rcna119917"
  },
  {
    "text": "Congressman George Santos Charged With Conspiracy, Wire Fraud, False Statements, Falsification of Records, Aggravated Identity Theft, and Credit Card Fraud  —  For Immediate Release  —  U.S. Attorney's Office, Eastern District of New York  —  Santos Allegedly Filed Fraudulent Fundraising Reports … ",
    "url": "https://www.justice.gov/usao-edny/pr/congressman-george-santos-charged-conspiracy-wire-fraud-false-statements-0"
  },
  {
    "text": "At least 40 babies, some beheaded, found by Israel soldiers in Hamas-attacked village  —  IDF Maj Gen Itai Veruv described scene in Kfar Aza as ‘a massacre’  —  Israel's military has discovered unspeakable horrors in an Israeli community that was attacked by Hamas on Saturday … ",
    "url": "https://www.foxnews.com/world/40-babies-some-beheaded-found-israel-soldiers-hamas-attacked-village"
  },
  {
    "text": "Trump demands trial delay to wade through classified docs he stole  —  And Judge Cannon might just let him get away with it. … Donald Trump has just one goal in his two federal criminal cases: push them off until after November 2024, so that he can either pardon himself or instruct … ",
    "url": "https://www.publicnotice.co/p/trump-judge-cannon-classified-docs-trial-delay"
  },
  {
    "text": "Charles Koch's audacious new $5 billion political scheme  —  Billionaire Charles Koch, who will turn 88 on November 1, is funneling his wealth into two secretive organizations that can continue his right-wing political advocacy for years.  Koch structured more than $5 billion in donations … ",
    "url": "https://popular.info/p/charles-kochs-5-billion-tax-loophole"
  },
  {
    "text": "Alarms sound in all of Israel's north, warnings of terrorist infiltrators in communities on Israeli-Lebanese border  —  Suspected infiltration of hostile aircrafts from Lebanon spike alarms across all northern Israel  —  Sirens were heard throughout the Golan Heights and the Galilee due … ",
    "url": "https://www.haaretz.com/israel-news/2023-10-11/ty-article-live/1-200-israelis-killed-2-400-wounded-as-israel-targets-hamas-leaders-in-airstrikes/0000018b-1d16-d08b-adef-1ff68d470000"
  },
  {
    "text": "Businesses are returning $140 million in surprise overdraft fees to consumers, according to a CFPB report  — Companies will refund $140 million to consumers following Consumer Financial Protection Bureau reporting on illegal junk fees.  — Surprise bank overdraft and nonsufficient fund fees account for $120 million of the amount.",
    "url": "https://www.cnbc.com/2023/10/11/businesses-will-return-140-million-in-overdraft-fees-cfpb-report.html"
  },
  {
    "text": "Former OSU wrestlers say Jim Jordan betrayed them and shouldn't be House speaker  —  “Do you really want a guy in that job who chose not to stand up for his guys?” said one former wrestler who attended OSU when Jordan was assistant coach.  —  Four of the former Ohio State University wrestlers … ",
    "url": "https://www.nbcnews.com/politics/politics-news/former-osu-wrestlers-say-jim-jordan-betrayed-shouldnt-house-speaker-rcna119116"
  },
  {
    "text": "The Senate is a problem in the Israel crisis.  Democrats are fed up.  —  The war in the Middle East means top military and diplomatic posts must be filled now, senators say.  —  As war breaks out in the Middle East, key ambassadorships in the region and top military promotions are languishing in the Senate.",
    "url": "https://www.politico.com/news/2023/10/11/hamas-israel-nominees-military-ambassadors-00120871"
  },
  {
    "text": "Olympic gold medalist Mary Lou Retton battling pneumonia in intensive care  —  Retton's daughter, McKenna Kelley, made an appeal for help, saying the legend does not have medical insurance.  —  Mary Lou Retton battling rare form of pneumonia, family says  —  Olympic gold medalist Mary Lou Retton … ",
    "url": "https://www.nbcnews.com/news/us-news/olympic-gold-medalist-mary-lou-retton-battling-pneumonia-intensive-car-rcna119828"
  },
  {
    "text": "Conservative Election Activists Use Virginia as a Dry Run for 2024  —  Inspired in part by Donald Trump's baseless rigged-election claims, the activists are trying to recruit supporters to serve as poll watchers and election workers in the state's legislative contests.",
    "url": "https://www.nytimes.com/2023/10/11/us/politics/virginia-election-integrity-activists.html"
  },
  {
    "text": "Trump dips into internet conspiracy theories with his latest lines about Obama  —  Donald Trump had been alluding to the idea that his predecessor, Barack Obama, is still in charge before he outright said it in New Hampshire this week.  —  WOLFEBORO, N.H. — Former President Donald Trump … ",
    "url": "https://www.nbcnews.com/politics/2024-election/trump-dips-internet-conspiracies-latest-lines-obama-rcna119571"
  }
]