[
  {
    "text": "Trump allegedly discussed US nuclear subs with foreign national after leaving White House: Sources  —  Trump allegedly discussed the information with an Australian billionaire.  —  Months after leaving the White House, former President Donald Trump allegedly discussed potentially sensitive information … ",
    "url": "https://abcnews.go.com/US/after-white-house-trump-allegedly-discussed-potentially-sensitive/story?id=103760456"
  },
  {
    "text": "Trump Said to Have Revealed Nuclear Submarine Secrets to Australian Businessman  —  Soon after leaving office, the former president shared sensitive information about American submarines with a billionaire member of Mar-a-Lago, according to people familiar with the matter.",
    "url": "https://www.nytimes.com/2023/10/05/us/politics/trump-nuclear-submarine-classified-documents.html"
  },
  {
    "text": "Trump moves to “temporarily” dismiss $500 million lawsuit against Michael Cohen  —  Former President Donald Trump moved Thursday to dismiss his $500 million lawsuit against his former lawyer, Michael Cohen, without prejudice, allowing him to refile the suit again in the future.",
    "url": "https://www.cbsnews.com/news/trump-moves-temporarily-dismiss-michael-cohen-lawsuit/"
  },
  {
    "text": "Trump drops suit against former lawyer Michael Cohen  —  The former president, facing a scheduling conflict with a campaign rally, ended his case seeking $500 million from the attorney who turned on him.  —  Former President Donald Trump late on Thursday abruptly dropped a lawsuit … ",
    "url": "https://www.politico.com/news/2023/10/05/trump-drops-michael-cohen-00120297"
  },
  {
    "text": "I.R.S. Puts Lien on Giuliani's Palm Beach Condo for $550,000 Tax Debt  —  The action by federal tax officials is the latest sign of Rudolph W. Giuliani's growing financial troubles.  —  The I.R.S. has placed a lien on a Florida property owned by Rudolph W. Giuliani, the former New York City mayor … ",
    "url": "https://www.nytimes.com/2023/10/05/us/politics/irs-lien-giuliani-palm-beach-condo.html"
  },
  {
    "text": "EXCLUSIVE: IRS claims Rudy Giuliani owes $550k in unpaid taxes and places a LIEN on his $4.5million Palm Beach penthouse  — The IRS claims Rudy Giuliani owes $549,435.26 in unpaid income taxes for 2021, DailyMail.com can reveal  — Now the federal tax agency has placed a lien … ",
    "url": "https://www.dailymail.co.uk/news/article-12594611/IRS-claims-Rudy-Giuliani-owes-550k-unpaid-taxes-places-LIEN-4-5million-Palm-Beach-penthouse.html"
  },
  {
    "text": "The next speaker's big challenge: Avoiding McCarthy's fate  —  Any one Republican still has the power to eject the House leader.  It's a problem that only some in the GOP want to solve.  —  Anyone who hopes to become the next speaker must first attempt to settle a raging debate inside the GOP conference … ",
    "url": "https://www.politico.com/news/2023/10/06/next-house-speaker-reform-mccarthy-00120178"
  },
  {
    "text": "Trump would accept House speakership for a ‘short period’ while Republicans decide on a permanent replacement  —  Trump told Fox News Digital he would serve as a ‘unifier’ until Republicans can rally around a new speaker  —  EXCLUSIVE: Former President Trump told Fox News Digital … ",
    "url": "https://www.foxnews.com/politics/trump-accept-speakership-for-short-period-republicans-decide-permanent-replacement"
  },
  {
    "text": "American Airlines is sorry for accusing David Ryan Harris, who was traveling with his kids, of child trafficking  —  Homepage News  —  American Airlines has apologized to musician David Ryan Harris for stopping and questioning him at LAX last month because they suspected he was trafficking children.",
    "url": "https://www.latimes.com/entertainment-arts/story/2023-10-05/american-airlines-apologizes-to-david-ryan-harris-after-falsely-accusing-him-of-trafficking-children"
  },
  {
    "text": "Fox News' Greg Gutfeld Floats Civil War Because 'Elections Don't Work'  —  The right-wing network's resident comedian went full fascist on Thursday, warning that the only thing that can save America is another civil war.  —  Fox News host Greg Gutfeld, supposedly the right-wing network's resident comedian … ",
    "url": "https://www.thedailybeast.com/fox-news-greg-gutfeld-floats-civil-war-because-elections-dont-work"
  },
  {
    "text": "Trump's violent rhetoric is getting muted coverage by the news media  —  After eight years of Trump in politics, is a ‘banality of crazy’ setting in?  —  Last week, the Republican Party's leading presidential candidate proposed executing suspected shoplifters.",
    "url": "https://www.washingtonpost.com/style/media/2023/10/05/trump-violent-shoplifters-milley-media/"
  },
  {
    "text": "The Attack on Wisconsin's Governor Perfectly Sums Up Our Gun Problem  —  A man tried this week to attack Democratic Wisconsin Governor Tony Evers, twice in one day, first with a handgun and then with an assault rifle after posting bail, a state spokesperson said Thursday.",
    "url": "https://newrepublic.com/post/176009/wisconsin-governor-tony-evers-armed-gunman-political-violence"
  },
  {
    "text": "The US may no longer avoid a recession  —  The economy is likely to weaken as markets internalise the significant likelihood that rates will stay higher for longer  —  The writer is president of Queens' College, Cambridge, and an adviser to Allianz and Gramercy",
    "url": "https://www.ft.com/content/02a899eb-e899-4b6f-8848-b5240a7127e9"
  },
  {
    "text": "Iranian human rights activist Narges Mohammadi wins Nobel Peace Prize for fight against ‘oppression of women’  —  The Nobel committee said “her brave struggle has come with tremendous personal cost.”  —  Iranian human rights activist Narges Mohammadi won the Nobel Peace Prize on Friday … ",
    "url": "https://www.nbcnews.com/news/world/iranian-human-rights-activist-narges-mohammadi-wins-nobel-peace-prize-rcna119156"
  },
  {
    "text": "Star Impeachment Witness Sued Cancer-Stricken Dad's Charity  —  Republicans are regrouping after their first impeachment hearing didn't go so well.  They're hoping this witness can do better.  But he has quite the past. … After a turbulent few days in the House and the astonishing backfire … ",
    "url": "https://www.thedailybeast.com/star-impeachment-witness-tony-bobulinski-sued-cancer-stricken-dads-charity"
  },
  {
    "text": "Twitter Is at Death's Door, One Year After Elon Musk's Takeover  —  Since the tech tycoon took over the platform last October, he's done everything he can to run it into the ground … Following a $44 billion acquisition he tried to scuttle but was legally forced into closing … ",
    "url": "https://www.rollingstone.com/culture/culture-commentary/elon-musk-killed-twitter-one-year-1234840622/"
  },
  {
    "text": "Rep. George Santos' former campaign treasurer will plead guilty to a federal felony, prosecutors say  —  The ex-campaign treasurer for U.S. Rep. George Santos will plead guilty on Thursday to an unspecified felony in connection with the sprawling federal investigation of financial irregularities surrounding … ",
    "url": "https://apnews.com/article/george-santos-nancy-marks-4d249e9d5e83fd25ed1a19a9e13d3246"
  },
  {
    "text": "Gun Deaths Rising Sharply Among Children, Study Finds  —  Firearm injuries are a leading cause of death among young children and teenagers in the United States.  —  Julvonnia McDowell was making dinner one evening when she got a call saying that her 14-year-old son, JaJuan … ",
    "url": "https://www.nytimes.com/2023/10/05/health/gun-deaths-children.html"
  },
  {
    "text": "Ramaswamy's car rammed by protesters in Iowa  —  The Republican presidential candidate was not in the vehicle at the time.  —  Protesters ran their vehicle into Republican presidential candidate Vivek Ramaswamy's car during a campaign stop in Grinnell, Iowa, on Thursday, his campaign confirmed to POLITICO.",
    "url": "https://www.politico.com/news/2023/10/05/ramaswamy-car-rammed-by-protesters-iowa-00120251"
  },
  {
    "text": "Exclusive: Justice Department and House Republicans in standoff over FBI witness testimony  —  The Justice Department has directed an FBI special agent not to testify before the Republican-led House Judiciary Committee in a dispute over the agent's request to have both his personal lawyer … ",
    "url": "https://www.cnn.com/2023/10/05/politics/justice-department-standoff-house-republicans-fbi-testimony/"
  },
  {
    "text": "Interviewing Biden ‘the saddest thing’ as he 'couldn't finish his sentences,' ex-ESPN host Sage Steele says  —  Former ESPN host Sage Steele said that interviewing President Biden was “the saddest thing” because he seemed confused and “couldn't finish his sentences.”",
    "url": "https://nypost.com/2023/10/05/interviewing-biden-the-saddest-thing-as-he-couldnt-finish-a-sentence-sage-steele/"
  },
  {
    "text": "How MAGA Corrupts the Culture of the White Working Class  —  I'm not exactly optimistic about human nature.  Yes, I certainly believe that human beings are capable of great good, but consider me in agreement with the Christian apologist G.K. Chesterton, who wrote that the doctrine of original sin was … ",
    "url": "https://www.nytimes.com/2023/10/05/opinion/trump-white-working-class-maga.html"
  }
]