[
  {
    "text": "Trump's invite to major donors prioritizes the committee paying his legal bills over the RNC  —  Donald Trump's new joint fundraising agreement with the Republican National Committee directs donations to his campaign and a political action committee that pays the former president's legal bills … ",
    "url": "https://apnews.com/article/trump-campaign-fundraising-rnc-c0e8f1e7b59f70c5237e13a3462e5790"
  },
  {
    "text": "Joint committee allows Trump to raise money for legal bills, huge checks for RNC  —  The Trump 47 Committee can raise up to $814,600, according to a donor form obtained by The Washington Post  —  New Federal Election Commission filings this week illustrated the tremendous burden … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/21/trump-joint-fundraising-committee-rnc/"
  },
  {
    "text": "Letitia James Is Prepared to Seize One of Trump's Favorite Assets  —  Donald Trump has just days left to post the nearly half-billion-dollar bond in his New York civil fraud case before the state attorney general can start seizing his assets, and Letitia James seems to know exactly where she wants to start: Westchester.",
    "url": "https://newrepublic.com/post/180032/new-york-letitia-james-seize-trump-assets-westchester"
  },
  {
    "text": "New York Attorney General takes initial step to prepare to seize Trump assets  —  The New York attorney general's office has filed judgments in Westchester County, the first indication that the state is preparing to try to seize Donald Trump's golf course and private estate north of Manhattan, known as Seven Springs.",
    "url": "https://www.cnn.com/2024/03/21/politics/trump-calls-ny-attorney-generals-bond-suggestions-impractical-and-unjust/"
  },
  {
    "text": "NY Gears Up to Seize Trump Westchester Assets If Fraud Fine Is Unpaid  — State registered $454 million judgment in Westchester County  — Area is home to a Trump golf course and Seven Springs estate  —  New York state's $454 million judgment against Donald Trump in a civil fraud lawsuit … ",
    "url": "https://www.bloomberg.com/news/articles/2024-03-21/ny-poised-to-seize-trump-westchester-assets-if-fraud-fine-unpaid"
  },
  {
    "text": "Trump canceled a rally in Arizona because his campaign was too broke: report  —  Former President Donald Trump is facing mounting financial difficulties in his campaign — to the point where he is reportedly being forced to triage which states he can afford to hold rallies in.",
    "url": "https://www.rawstory.com/trump-rally-cost/"
  },
  {
    "text": "Trump Told Pence Certifying Election Would Be ‘Career Killer,’ Valet Testified  —  President Donald J. Trump warned his vice president against failing to overturn the 2020 election results, according to an account by the White House valet by his side on Jan. 6.",
    "url": "https://www.nytimes.com/2024/03/21/us/trump-pence-jan-6-white-house-valet.html"
  },
  {
    "text": "The ex-Democrat catching Trump's and Robert F. Kennedy Jr.'s eyes  —  Former Rep. Tulsi Gabbard has gone from running for president as a Democrat in 2020 to interest in the open VP slots for Trump and Kennedy in 2024.  —  Tulsi Gabbard wanted to be president.  Now she wants to be vice president.",
    "url": "https://www.nbcnews.com/politics/2024-election/ex-democrat-catching-trumps-robert-f-kennedy-jrs-eyes-rcna143941"
  },
  {
    "text": "House Republicans Want to Ban Universal Free School Lunches  —  On Wednesday, the Republican Study Committee, of which some three-quarters of House Republicans are members, released its 2025 budget entitled “Fiscal Sanity to Save America.”  Tucked away in the 180-page austerity manifesto … ",
    "url": "https://theintercept.com/2024/03/21/house-republicans-ban-universal-school-lunches/"
  },
  {
    "text": "Ken Buck becomes first Republican to sign Democrats' discharge petition for Ukraine aid  —  Rep. Ken Buck (Colo.) became the first GOP member to sign the House Democrats' aid discharge position on Thursday, just one day before he is set to retire from Congress.",
    "url": "https://thehill.com/homenews/house/4548713-ken-buck-becomes-first-republican-to-sign-democrats-discharge-petition-for-ukraine-aid/"
  },
  {
    "text": "Leonard Leo, Koch networks pour millions into groups prepping for potential second Trump administration  —  A review by the progressive advocacy group Accountable.US shows $55 million flowing from Leo- and Koch-backed groups.  —  WASHINGTON — Huge funding from influential conservative donor networks … ",
    "url": "https://www.nbcnews.com/politics/2024-election/leonard-leo-koch-networks-pour-millions-prep-potential-second-trump-ad-rcna144360"
  },
  {
    "text": "Cannon Fodder: Law Clerks Quit On Judge Aileen Cannon  —  Welcome to Original Jurisdiction, the latest legal publication by me, David Lat.  You can learn more about Original Jurisdiction by reading its About page, and you can email me at davidlat@substack.com.",
    "url": "https://davidlat.substack.com/p/judge-aileen-cannon-law-clerks-quit-on-her"
  },
  {
    "text": "House Republicans Resurrect Plan to Gut Social Security and Medicare  —  While progressive politicians and unions are fighting to grant Americans four-day workweeks, Republicans are looking to achieve the complete opposite.  —  On Wednesday, the Republican Study Committee … ",
    "url": "https://newrepublic.com/post/180029/house-republicans-plan-raise-retirement-age-social-security"
  },
  {
    "text": "House Republicans sue Justice Department tax attorneys in Hunter Biden probe  —  The lawsuit seeks to compel Mark Daly and Jack Morgan to take part in interviews with a Republican-led panel.  —  The House Judiciary Committee sued a pair of Justice Department attorneys Thursday in an effort … ",
    "url": "https://www.nbcnews.com/politics/congress/house-republicans-sue-justice-department-attorneys-hunter-biden-probe-rcna144567"
  },
  {
    "text": "Sen. Menendez, who is facing corruption charges, won't seek reelection as a Democrat  —  Sen. Bob Menendez, D-N.J., who is fighting federal corruption charges, said Thursday that he will not file to run for reelection in the Democratic primary but added he hopes to be exonerated and run as an independent.",
    "url": "https://npr.org/2024/03/21/1240044252/robert-menendez-reelection"
  },
  {
    "text": "Exclusive: Georgia DA plans to press ahead in effort to put Trump on trial before election  —  Fani Willis, the embattled Fulton County District Attorney, plans to press ahead with her goal of putting Donald Trump on trial before the November election, and intends to ask the judge presiding … ",
    "url": "https://www.cnn.com/2024/03/21/politics/fani-willis-trump-georgia-trial"
  },
  {
    "text": "U.S. to Present Gaza Cease-Fire Resolution at U.N. Security Council  —  A resolution for the U.N. that American diplomats are circulating was notable for its strong language in seeking a cease-fire in Gaza and the release of hostages.  —  Secretary of State Antony J. Blinken … ",
    "url": "https://www.nytimes.com/2024/03/21/world/middleeast/gaza-blinken-ceasefire.html"
  },
  {
    "text": "Over 100 migrants break through razor wire, knock down guards as they illegally cross El Paso border in wild scene  —  EL PASO, TEXAS — A group of over 100 migrants attempted to enter the US illegally by rushing a border wall Thursday, breaking through razor wire and knocking over guards in the process.",
    "url": "https://nypost.com/2024/03/21/us-news/migrants-break-barriers-and-rush-border-guards-in-el-paso/"
  },
  {
    "text": "78,000 more public workers are getting student loans canceled through Biden administration changes  —  Another 78,000 Americans are getting their federal student loans canceled through a program that helps teachers, nurses, firefighters and other public servants, the Biden administration announced Thursday.",
    "url": "https://apnews.com/article/student-loan-cancellation-debt-forgiveness-public-service-d711e00aa4655745bccdff8a5a2625e6"
  }
]