[
  {
    "text": "Georgia Gov. Brian Kemp passes on running for Senate  —  The popular governor looked like a prime recruit against Sen. Jon Osoff.  —  Georgia Gov. Brian Kemp will not run for Senate in 2026, according to three people familiar with his decision.  —  Kemp, a popular Republican … ",
    "url": "https://www.politico.com/news/2025/05/05/georgia-gov-brian-kemp-passes-on-running-for-senate-00327843"
  },
  {
    "text": "Kemp will not run for U.S. Senate, igniting a GOP scramble in Georgia race  —  The governor's decision reshapes one of the nation's top Senate contests against Democrat Jon Ossoff.  —  Gov. Brian Kemp has decided not to run for U.S. Senate in 2026, dashing the hopes of Republicans in Georgia … ",
    "url": "https://www.ajc.com/politics/brian-kemp-will-not-run-for-us-senate-igniting-a-republican-scramble-in-georgia-race/ZX3U4RMYT5BODJJPR7DPAY2W2Q/"
  },
  {
    "text": "TeleMessage suspends services after hackers claim to have stolen files  —  The app was seemingly used by Mike Waltz in last week's Cabinet meeting, according to a photograph published by Reuters.  —  TeleMessage, the app that President Donald Trump's former national security adviser … ",
    "url": "https://www.nbcnews.com/tech/security/telemessage-suspends-services-hackers-say-breached-app-rcna204925"
  },
  {
    "text": "DHS Announces Historic Travel Assistance and Stipend for Voluntary Self-Deportation  —  The First Illegal Alien to Utilize Travel Assistance has Already Returned to Honduras  —  WASHINGTON, D.C.—Today, the Department of Homeland Security (DHS) announced a historic opportunity for illegal aliens … ",
    "url": "https://www.dhs.gov/news/2025/05/05/dhs-announces-historic-travel-assistance-and-stipend-voluntary-self-deportation"
  },
  {
    "text": "Hegseth Used Multiple Signal Chats for Official Pentagon Business  —  In at least one message, he asked aides to tell foreign countries about a military operation  —  Defense Secretary Pete Hegseth used Signal more extensively for official Pentagon business than previously disclosed … ",
    "url": "https://www.wsj.com/politics/national-security/pete-hegseth-signal-chats-defense-department-pentagon-ec9a4daa?st=T6CCqw&reflink=article_copyURL_share"
  },
  {
    "text": "Israel plans to occupy and flatten all of Gaza if no deal by Trump's trip  —  Israel has set President Trump's visit to the Middle East next week as a deadline for a new hostage and ceasefire deal, with a massive ground operation to commence if no deal is reached, Israeli officials say.",
    "url": "https://www.axios.com/2025/05/05/israel-gaza-destroy-trump-deal"
  },
  {
    "text": "Trump uttered ‘most important words ever spoken’ by a president: conservative ex-judge  —  Conservative former Judge Michael Luttig pointed to the recent interview President Donald Trump did and called it possibly the “most important” statement made by a U.S. president.",
    "url": "https://www.rawstory.com/trump-constitution-2671894980/"
  },
  {
    "text": "The Post wins Pulitzers for Trump rally shooting stories, editorial cartoons  —  The newpaper was recognized in the breaking news category for coverage of the attempted assassination of Donald Trump in July and for the illustrated work of Ann Telnaes.  The New York Times won four prizes.",
    "url": "https://www.washingtonpost.com/style/media/2025/05/05/washington-post-pulitzer-trump-shooting-telnaes/"
  },
  {
    "text": "A.I. Is Getting More Powerful, but Its Hallucinations Are Getting Worse … Last month, an A.I. bot that handles tech support for Cursor, an up-and-coming tool for computer programmers, alerted several customers about a change in company policy.  It said they were no longer allowed to use Cursor on more than just one computer.",
    "url": "https://www.nytimes.com/2025/05/05/technology/ai-hallucinations-chatgpt-google.html"
  },
  {
    "text": "Europe Seeks To Lure U.S. Scientists Disenfranchised Under Trump  —  Joshua Cohen is a Boston-based writer who covers health policy.  —  SaveComment  —  At a conference at Sorbonne University in Paris on Monday, May 5th, President Emmanuel Macron of France and the president of the European Commission … ",
    "url": "https://www.forbes.com/sites/joshuacohen/2025/05/05/europe-seeks-to-lure-us-scientists-disenfranchised-under-trump/"
  },
  {
    "text": "Trump Crypto Deals Provoke Senate Backlash and Calls for Investigation  —  Some Democrats who had supported legislation for so-called stablecoins are now demanding tougher language to prevent fraud and money laundering.  —  Senate Democrats are demanding changes to cryptocurrency legislation pending … ",
    "url": "https://www.nytimes.com/2025/05/05/us/politics/trump-crypto-senate-investigation.html?unlocked_article_code=1.E08.vWPU.fikxBeA7k1wc&smid=url-share"
  },
  {
    "text": "Trump announced Alcatraz reopening just hours after ‘Escape from Alcatraz’ aired on a South Florida PBS station  —  The 1979 film starring Clint Eastwood about the daring 1962 escape attempt aired on the local PBS channel just six hours before the president made his demand that the prison be reopened",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/trump-escape-from-alcatraz-pbs-b2745233.html"
  },
  {
    "text": "Trump ally Laura Loomer uses Nazi slogan to call for replacing Indian American congressperson  —  Loomer: “It'd be nice to have an American there, like a real blood and soil American”  —  Loomer's use of “blood and soil” is notable because the phrase is identified as a “Nazi rallying cry.”",
    "url": "https://www.mediamatters.org/laura-loomer/trump-ally-laura-loomer-uses-nazi-slogan-call-replacing-indian-american-congressperson"
  },
  {
    "text": "Industry Reacts To Trump's “Insane” Movie Tariff Threat: “This Would Destroy The Independent Film Sector”  —  The U.S. and international film sectors are reeling after Donald Trump's announcement last night that he is “authorizing” the Department of Commerce and the United States Trade Representative … ",
    "url": "https://deadline.com/2025/05/trump-movie-tariffs-hollywood-independent-film-destroy-1236385169/"
  },
  {
    "text": "White House urges patience on tariffs as anxiety over prices escalates  —  Port officials say they've yet to hear from the administration as their shipping volumes plunge.  —  President Donald Trump and his top aides have settled on a decidedly non-Trumpian message for American businesses … ",
    "url": "https://www.politico.com/news/2025/05/05/white-house-tariffs-anxiety-00330259"
  },
  {
    "text": "Donald Jr. and Eric Trump Pursue New Deals That Would Enrich President Trump  —  The president's older sons, Donald Trump Jr. and Eric Trump, spent the past two weeks traveling the world and announcing deals, many of which will financially benefit their father.",
    "url": "https://www.nytimes.com/2025/05/05/us/politics/eric-donald-jr-trump-family-deals.html?unlocked_article_code=1.E08.nanv.Y5MXMEQ7STnr&smid=url-share"
  },
  {
    "text": "US appeals court rejects Trump bid to revoke 400,000 migrants' legal status  —  A federal appeals court rejected on Monday a request by U.S. President Donald Trump's administration to allow it to revoke the temporary legal status of hundreds of thousand of Cubans, Haitians, Nicaraguans and Venezuelans living in the United States.",
    "url": "https://www.reuters.com/legal/us-appeals-court-rejects-trump-bid-revoke-400000-migrants-legal-status-2025-05-05/"
  },
  {
    "text": "Stephen Miller's Former Colleague Reveals Why He Is a ‘Horrible Human Being’  —  NO HOLDS BARRED  —  Former homeland security adviser Olivia Troye didn't hold back when asked about one of President Donald Trump's top aides.  —  A former White House colleague of Stephen Miller had some things … ",
    "url": "https://www.thedailybeast.com/stephen-millers-former-colleague-reveals-why-he-is-a-horrible-human-being/"
  },
  {
    "text": "Transcript: Fox News Visibly Rattled as Trump's Slide in Polls Worsens  —  The following is a lightly edited transcript of the May 5 episode of the Daily Blast podcast.  Listen to it here.  —  Greg Sargent: This is The Daily Blast from The New Republic, produced and presented by the DSR network.",
    "url": "https://newrepublic.com/article/194822/transcript-fox-news-visibly-rattled-trump-slide-polls-worsens"
  },
  {
    "text": "Inside the Most Politically Charged Met Gala in Years  —  The party and its related exhibition, about Black male style, land in a moment when anything to do with race and diversity is under added scrutiny.  —  Last October, when the Metropolitan Museum of Art's Costume Institute announced … ",
    "url": "https://www.nytimes.com/2025/05/05/style/met-gala-2025-black-dandy-politics.html"
  },
  {
    "text": "Proud Boys' Ex-Leader Thanks Trump for Pardon at Mar-a-Lago Encounter  —  Enrique Tarrio said he told Mr. Trump that he had saved his life by including him in a blanket grant of clemency for Jan. 6 defendants.  —  Enrique Tarrio, the former leader of the Proud Boys, said he personally thanked President Trump … ",
    "url": "https://www.nytimes.com/2025/05/04/us/politics/trump-tarrio-proud-boys-pardon.html"
  },
  {
    "text": "Judge Orders Elections Board to Certify Democrat's Victory in Contested N.C. Race  —  The federal ruling on Monday was the most significant legal victory yet for Justice Allison Riggs, the Democratic incumbent in a State Supreme Court race.  —  A federal judge on Monday ordered … ",
    "url": "https://www.nytimes.com/2025/05/05/us/north-carolina-supreme-court-federal-ruling.html"
  },
  {
    "text": "This Is Fascism: MAGA, Ashli Babbitt, and Derek Chauvin  —  The Trump cult loves police violence—except for when it doesn't.  —  1. Back the Blue  —  You may remember Ashli Babbitt as the only insurrectionist killed by law enforcement during the January 6th attack on the U.S. Capitol.1",
    "url": "https://www.thebulwark.com/p/deadly-force-maga-ashli-babbitt-and-derek-chauvin-police-and-fascism"
  },
  {
    "text": "Hegseth orders Pentagon to cut number of senior generals by 20%  —  US Secretary of Defense Pete Hegseth has ordered senior Pentagon leadership to cut the number of four-star generals and admirals by at least 20% across the military, according to a memo signed by Hegseth dated Monday and obtained by CNN.",
    "url": "https://cnn.com/2025/05/05/politics/hegseth-orders-pentagon-cut-senior-generals"
  },
  {
    "text": "Newark Airport Radar Loss Left Controllers Blind for 90 Seconds  —  Air traffic controllers guiding planes bound for Newark Liberty International Airport lost radar and radio communication for more than a minute early last week before flights at the key hub were snarled for days, according to people familiar with the matter.",
    "url": "https://www.bloomberg.com/news/articles/2025-05-05/newark-radar-loss-left-controllers-guiding-blind-for-90-seconds?accessToken=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzb3VyY2UiOiJTdWJzY3JpYmVyR2lmdGVkQXJ0aWNsZSIsImlhdCI6MTc0NjQ2NzkzMSwiZXhwIjoxNzQ3MDcyNzMxLCJhcnRpY2xlSWQiOiJTVlNONlJEV0xVNjgwMCIsImJjb25uZWN0SWQiOiJCNDAwNTQzMUFBMDI0OTA2OTU1NUVFRDI4MkVBNzg3NCJ9._LB5QofGo4z5HTe1qMb_5xEWqkbGn7JrU-zVEe3ROZI"
  },
  {
    "text": "Illinois Democrat Schakowsky won't seek Congress reelection in 2026 after 14 terms  —  U.S. Rep. Jan Schakowsky announced Monday that she won't seek reelection next year after 14 terms, making her the latest longtime Illinois Democrat to announce a retirement from Congress.",
    "url": "https://apnews.com/article/jan-schakowsky-election-2026-illinois-5dd0c8e53158efd29a58c3f157535c25"
  },
  {
    "text": "The New Yorker Wins Three 2025 Pulitzer Prizes  —  The awards honor Mosab Abu Toha's commentary on the devastation in Gaza, Moises Saman's photographs of Syria after Assad, and the third season of the investigative podcast In the Dark.  —  The New Yorker was named the winner of three Pulitzer Prizes … ",
    "url": "https://www.newyorker.com/news/press-room/the-new-yorker-wins-three-2025-pulitzer-prizes"
  },
  {
    "text": "As Backlash to Trump's Tariffs Grows, Europe Boycotts American Brands  —  A shifting perception of the United States amid President Trump's trade war is prompting Europeans to pivot decisively away from U.S. goods and services.  —  For motorcycle lovers in Sweden, Harley-Davidson is the hottest brand on the road.",
    "url": "https://www.nytimes.com/2025/05/05/business/tariffs-europe-boycott-american-goods.html"
  },
  {
    "text": "We need a way to aggregate what Donald Trump is doing to this country  —  News organizations, along with good-government groups and other interested parties, are doing a commendable job of chronicling the damage the Trump regime is doing to the government, the country, and the world.",
    "url": "https://presswatchers.org/2025/05/we-need-a-way-to-aggregate-what-donald-trump-is-doing-to-this-country/"
  },
  {
    "text": "Texas bill would monitor wastewater for the abortion medication mifepristone  —  Under a bill filed in the Legislature, Texas could begin monitoring wastewater for substances including the abortion drug mifepristone.The legislation is part of a broader push spearheaded by anti-abortion advocates … ",
    "url": "https://www.dallasnews.com/news/texas/2025/05/05/texas-bill-would-monitor-wastewater-for-the-abortion-medication-mifepristone/"
  },
  {
    "text": "Democratic Governors Should Not Paul Weiss Themselves  —  Everyone who fights comes out looking better, and in better shape.  —  ∙ Paid  —  Every person and every institution that has knuckled under Donald Trump's extortionate abuses of power has had a compelling reason to do so.",
    "url": "https://www.offmessage.net/p/democratic-governors-should-not-paul"
  },
  {
    "text": "‘60 Minutes’ Thumbs Its Nose at Trump With Scathing Segment  —  NOT SCARED OF YOU  —  The show brought on lawyers and firms targeted by President Donald Trump's sweeping executive orders.  —  60 Minutes examined Donald Trump's revenge tour against Big Law in a scathing episode on Sunday … ",
    "url": "https://www.thedailybeast.com/60-minutes-thumbs-its-nose-at-trump-with-scathing-segment-on-his-threats-to-law-firms/"
  }
]