[
  {
    "text": "CNN's Chris Wallace Notes Kamala Harris Convention Clobbering Trump's RNC Ratings: ‘People Are Watching This Convention’  —  CNN anchor Chris Wallace twisted the knife a little when he noted that former President Donald Trump's RNC ratings are getting eclipsed by Vice President Kamala Harris and the Democratic National Convention.",
    "url": "https://www.mediaite.com/news/cnns-chris-wallace-notes-kamala-harris-convention-clobbering-trumps-rnc-ratings-people-are-watching-this-convention/"
  },
  {
    "text": "Trumped in the Ratings  —  MSNBC is posting the strongest total viewership during the DNC.  Conversely, Fox News has struggled. … After night one of the DNC bested night one of the RNC (an average of 20 million viewers to 18.1 million), night two saw the gap open up even wider.",
    "url": "https://www.status.news/p/dnc-ratings-versus-rnc"
  },
  {
    "text": "Gus Walz broke the internet with his tearful love for his dad.  Then the bullying began  —  Michael Collins Sam WoodwardUSA TODAY  —  CHICAGO - A tearful, unscripted moment between Tim Walz and his 17-year-old son, Gus, has unleased a flood of praise and admiration - but also prompted ugly online bullying.",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/08/22/tim-walt-son-gus-walz-tears-melted-hearts-at-democratic-convention-dnc-critics-called-it-unmanly/74906490007/"
  },
  {
    "text": "Ann Coulter posted about Tim Walz's son.  The backlash was swift.  —  The sight of Tim Walz's 17-year-old son, Gus, weeping with pride Wednesday night during his father's speech accepting the vice presidential nomination instantly became an iconic feel-good moment of the convention.",
    "url": "https://www.politico.com/live-updates/2024/08/22/dnc-live-updates-coverage/ann-coulter-tweet-gus-walz-00175842"
  },
  {
    "text": "BEYONCÉ NOT AT DNC AFTER ALL  —  EXCLUSIVE  —  UPDATE  —  9:30 PM PT — To quote the great Beyonce: We gotta lay our cards down, down, down ... we got this one wrong.  —  Beyoncé is in Chicago, and getting ready to pop out for Kamala Harris on the final night of the Democratic National Convention ... TMZ has learned.",
    "url": "https://www.tmz.com/2024/08/22/beyonce-dnc-final-night-kamala-harris/"
  },
  {
    "text": "Trump campaign deletes Freedom video after Beyoncé blocks use of song  —  Freedom, the central song in the Kamala Harris campaign, appeared in a Trump campaign video but was contested by singer's label and publisher  —  Beyoncé has blocked Donald Trump from using her song Freedom … ",
    "url": "https://www.theguardian.com/music/article/2024/aug/22/beyonce-blocks-trump-use-of-her-song-freedom-kamala-harris"
  },
  {
    "text": "Supreme Court rejects GOP push to block 41K Arizona voters, but partly OKs proof of citizenship law  —  A divided Supreme Court on Thursday rejected a Republican push that could have blocked more than 41,000 Arizona voters from casting ballots for president in the closely contested swing state … ",
    "url": "https://apnews.com/article/supreme-court-citizenship-elections-arizona-62b7e777cfdbb99242510e562de00781"
  },
  {
    "text": "Trump Hosting Fundraiser For Domestic Terrorists Who Assaulted Cops On Jan. 6  —  The “J6 Awards Gala” is to take place at the coup-attempting criminal former president's New Jersey country club next month.  —  LOADING  —  WASHINGTON — Donald Trump is hosting a fundraiser … ",
    "url": "https://www.huffpost.com/entry/donald-trump-jan-6-awards-gala_n_66c77f6be4b0b9c7b3609dab"
  },
  {
    "text": "RFK Jr. will probably drop out.  Is that bearish for Harris?  —  Pun absolutely intended.  —  ∙ Paid  —  Greetings from charmingly overcast Seattle, Washington, where I'm here for a book event tonight.  Given the timing and that I have family I rarely get to see all the way up here 1 … ",
    "url": "https://www.natesilver.net/p/rfk-jr-will-probably-drop-out-is"
  },
  {
    "text": "Here Is the Speech That the Uncommitted Movement Wants to Give at the DNC  —  Read what Georgia State Rep. Ruwa Romman hopes to tell Democrats.  —  Delegates with the Uncommitted movement at the Democratic National Convention have continued pushing this week for either a Palestinian American … ",
    "url": "https://www.motherjones.com/politics/2024/08/dnc-speech-uncommitted-movement-harris-walz-ruwan-romman/"
  },
  {
    "text": "FDA Approves and Authorizes Updated mRNA COVID-19 Vaccines to Better Protect Against Currently Circulating Variants  —  For Immediate Release:  —  Today, the U.S. Food and Drug Administration approved and granted emergency use authorization (EUA) for updated mRNA COVID-19 vaccines … ",
    "url": "https://www.fda.gov/news-events/press-announcements/fda-approves-and-authorizes-updated-mrna-covid-19-vaccines-better-protect-against-currently"
  },
  {
    "text": "WATCH: Vivek Ramaswamy Chased Out By Angry Mob At Anti-Israel Protest Outside DNC  —  Former Republican presidential contender Vivek Ramaswamy was chased out of an anti-Israel protest a few blocks away from the DNC after making a surprise appearance.  —  Ramaswamy was noticed by the crowd … ",
    "url": "https://www.dailywire.com/news/watch-vivek-ramaswamy-chased-out-by-angry-mob-at-anti-israel-protest-outside-dnc"
  },
  {
    "text": "Most GOP-devastating statistic in Bill Clinton's DNC speech confirmed by fact checker  —  Former President Bill Clinton on Wednesday used part of his speech at the Democratic National Convention to hit back at the notion that Republican presidents were better on the economy than Democratic presidents.",
    "url": "https://www.rawstory.com/bill-clinton-dnc-speech/"
  },
  {
    "text": "The Taliban publish vice laws that ban women's voices and bare faces in public  —  Afghanistan's Taliban rulers have issued a ban on women's voices and bare faces in public under new laws approved by the supreme leader in efforts to combat vice and promote virtue.",
    "url": "https://apnews.com/article/afghanistan-taliban-vice-virtue-laws-women-9626c24d8d5450d52d36356ebff20c83"
  },
  {
    "text": "Arkansas Supreme Court upholds rejection of petitions to let voters decide on abortion access  —  The Arkansas Supreme Court upheld the state's rejection of signed petitions for an abortion rights ballot initiative on Thursday, keeping the proposal from going before voters in November.",
    "url": "https://apnews.com/article/abortion-ballot-arkansas-supreme-court-48c208d49d82b467fbcc4b9c2724617a"
  },
  {
    "text": "Greenville County Schools will not host in-person book fairs this year: Here's why  —  GREENVILLE, S.C. —  Greenville County Schools will not host in-person book fairs this school year.  —  (Video above: Morning headlines from WYFF News 4)  —  District Spokesman Tim Waller released the following statement about the pause:",
    "url": "https://www.wyff4.com/article/greenville-county-schools-no-book-fairs/61945606"
  },
  {
    "text": "Southern Arizona authorities search for man connected to threats to kill Trump  —  COCHISE COUNTY, AZ (AZFamily) — Authorities are searching for a southern Arizona man connected to a threat to kill former President Donald Trump on the same day that Trump will be at the Arizona border.",
    "url": "https://www.azfamily.com/2024/08/22/southern-arizona-authorities-search-man-connected-threats-kill-trump/"
  },
  {
    "text": "Ex-Congressional candidate and FTX executive's romantic partner indicted on campaign finance charges  —  NEW YORK (AP) — A one-time Congressional candidate and domestic partner of a convicted FTX executive was arrested Thursday on campaign finance charges.  —  Michelle Bond, 45, of Potomac … ",
    "url": "https://apnews.com/article/michelle-bond-congressional-candidate-arrest-aa144a622654b1c93243919a76087451"
  },
  {
    "text": "Trump says he will make ‘provisions’ for mixed-status families but doesn't rule out separations with mass deportations  —  The former president also told NBC News that spending billions to execute mass deportations of undocumented immigrants is justified because allowing them to remain would cost more.",
    "url": "https://www.nbcnews.com/politics/2024-election/trump-says-will-make-provisions-mixed-status-families-doesnt-rule-sepa-rcna167852"
  },
  {
    "text": "Kinzinger in DNC speech says GOP is “no longer conservative”  —  Former Rep. Adam Kinzinger (R-Ill.) said during a speech to the Democratic National Convention on Thursday that the Republican Party is “no longer conservative” under former President Trump.",
    "url": "https://www.axios.com/2024/08/23/adam-kinzinger-dnc-speech-harris-trump"
  },
  {
    "text": "Trump says he's refusing intel briefings so he won't be accused of leaks … - Briefings also help candidates ensure that they don't say anything that undermines U.S. national security, former acting CIA Director Michael Morell explained in a Q&A with the Center for Presidential Transition.",
    "url": "https://www.axios.com/2024/08/22/trump-decline-intelligence-briefings-leak"
  },
  {
    "text": "Trump is launching a cryptocurrency platform, and we have no idea what it does … Trump's post included few other details, but he and his sons have suggested it will target unbanked and underserved communities.  —  “For too long, the average American has been squeezed by the big banks and financial elites,” the post reads.",
    "url": "https://www.theverge.com/2024/8/22/24226184/trump-defiant-ones-cryptocurrency-platform"
  },
  {
    "text": "Here's who's speaking on the final night of the DNC  —  The NPR Network will be reporting live from Chicago throughout the week bringing you the latest on the Democratic National Convention.  —  The pep rally is coming to an end as Democrats continue to run a truncated race to the election.",
    "url": "https://www.npr.org/2024/08/22/g-s1-18861/dnc-speakers-day-4-thursday-harris-kelly-whitmer-warren"
  },
  {
    "text": "Democrats Give Harris Nearly Unanimous Positive Ratings  —  Biden receives a bump in his job approval rating after exiting the presidential race  —  WASHINGTON, D.C. — Americans' views of Vice President Kamala Harris have improved markedly in a Gallup poll conducted mostly before the Democratic National Convention began.",
    "url": "https://news.gallup.com/poll/649127/democrats-give-harris-nearly-unanimous-positive-ratings.aspx"
  }
]