[
  {
    "text": "Trump Says He Will Consider Exempting Some U.S. Companies From Tariffs  —  President Trump said Wednesday that he's considering granting some U.S. companies an exemption from his tariff program.  “There are some that have been hard,” Trump told reporters when asked about companies requesting exemptions.",
    "url": "https://www.wsj.com/livecoverage/stock-market-trump-tariffs-trade-war-04-09-25/card/trump-says-he-will-consider-exempting-some-u-s-companies-from-tariffs-BXfdUETG5o197ZivMbn0"
  },
  {
    "text": "Why Trump Blinked on Tariffs Just Hours After They Went Into Effect  —  Treasury secretary helped persuade president to take time to negotiate with trading partners in face of pressure from business leaders  —  President Trump finally blinked.  —  It took a week for the plunge in the stock … ",
    "url": "https://www.wsj.com/politics/policy/why-trump-blinked-on-tariffs-b588aea8?st=jQ73FX&reflink=desktopwebshare_permalink"
  },
  {
    "text": "From ‘Be Cool!’ to ‘Getting Yippy’: Inside Trump's Reversal on Tariffs  —  Economic turmoil, particularly a rapid rise in government bond yields, caused President Trump to reverse course on the steep levies.  —  For the past week, President Trump has been urging calm in the face … ",
    "url": "https://www.nytimes.com/2025/04/09/us/politics/trump-tariff-pause-be-cool.html"
  },
  {
    "text": "Trump Orders DOJ To Investigate Prominent Critic in Shocking Oval Office Remarks: 'I Think He's Guilty of Treason'  —  President Donald Trump directed the Justice Department to investigate former Homeland Security official Miles Taylor over his “anonymous” essay and book hammering Trump during his first term.",
    "url": "https://www.mediaite.com/news/trump-orders-doj-to-investigate-prominent-critic-in-shocking-oval-office-remarks-i-think-hes-guilty-of-treason/"
  },
  {
    "text": "Fact Sheet: President Donald J. Trump Addresses Risks from Chris Krebs and Government Censorship  —  RESTORING TRUST IN GOVERNMENT: Today, President Donald J. Trump signed a Presidential Memorandum revoking any active security clearance held by Chris Krebs and his associates.",
    "url": "https://www.whitehouse.gov/fact-sheets/2025/04/fact-sheet-president-donald-j-trump-addresses-risks-from-chris-krebs-and-government-censorship/"
  },
  {
    "text": "How Musk and Trump Are Working to Consolidate Government Data About You  —  Databases that Elon Musk's team is trying to access include more than 300 personal details about members of the U.S. public.  —  The federal government knows your mother's maiden name and your bank account number.",
    "url": "https://www.nytimes.com/2025/04/09/us/politics/trump-musk-data-access.html?unlocked_article_code=1.-U4.Iry8.1A4wKeGn4nWS&smid=url-share"
  },
  {
    "text": "US DOGE Service Agreement With Department of Labor Shows $1.3 Million Fee—and Details Its Mission  —  The unsigned agreement between the US DOGE Service and the Department of Labor provides significant insight into DOGE's work with federal agencies.  —  An unsigned agreement between the US DOGE Service … ",
    "url": "https://www.wired.com/story/department-of-labor-doge-usds-payment/"
  },
  {
    "text": "Elon Musk's DOGE Is Getting Audited  —  The General Accountability Office's audit examines DOGE's handling of data at a number of federal agencies, according to sources and records reviewed by WIRED.  —  The General Accountability Office (GAO) is auditing Elon Musk's so-called Department of Government Efficiency (DOGE).",
    "url": "https://www.wired.com/story/gao-audit-elon-musk-doge-government-agencies/"
  },
  {
    "text": "Newsmax defamed Dominion Voting Systems, judge rules  —  Right-wing cable channel Newsmax defamed Dominion Voting Systems by falsely reporting that the company was involved in rigging the 2020 presidential election, a Delaware judge ruled Wednesday.  —  Damages will be decided by a jury … ",
    "url": "https://www.latimes.com/entertainment-arts/business/story/2025-04-09/newsmax-defamed-dominion-voting-systems-judge-says"
  },
  {
    "text": "Maintaining Acceptable Water Pressure in Showerheads  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:  —  Section 1.  Purpose.  Overregulation chokes the American economy and stifles personal freedom.",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/04/maintaining-acceptable-water-pressure-in-showerheads/"
  },
  {
    "text": "Rejected at her door, ICE nabs a Maryland woman in her car after smashing her window  —  The arrest was captured on camera by her daughter  —  This Monday started off like any other day for Karen Cruz Berrios.  —  The 18-year-old and her mother — Elsy Noemi Berrios, 52 … ",
    "url": "https://www.thebaltimorebanner.com/community/local-news/video-ice-arrest-wesminster-elsy-noemi-berrios-QJ7CIME76ZGPZEBW5C3REEPZ6E/"
  },
  {
    "text": "Kash Patel Quietly Removed as Acting ATF Director After Ghosting Gig  —  CANNED  —  He has been replaced by Army Secretary Daniel Driscoll after he reportedly did not show face in an ATF facility for weeks.  —  FBI Director Kash Patel has been quietly removed as the acting director … ",
    "url": "https://www.thedailybeast.com/kash-patel-reportedly-removed-as-acting-atf-director-after-ghosting-gig/"
  },
  {
    "text": "Johnson Delays Budget Vote As G.O.P. Defectors Balk  —  After more than an hour of labored negotiations with conservative holdouts, House G.O.P. leaders yanked their blueprint for the president's tax and spending package, lacking the votes to pass it.  —  Speaker Mike Johnson on Wednesday … ",
    "url": "https://www.nytimes.com/2025/04/09/us/politics/house-budget-vote-republicans.html"
  },
  {
    "text": "The Pool Filter  —  Some White House pool reports are no longer making it to the official distribution list, Status has learned—an unsettling development in the Trump administration's escalating war on the press.  —  At approximately six-thirty on Tuesday evening, Joseph Morton … ",
    "url": "https://www.status.news/p/white-house-censors-pool-reports"
  },
  {
    "text": "H.R. McMaster receives accidental call from President Trump  —  Just over a month ago, retired Lt. Gen. H.R. McMaster received an unexpected call on his personal cell, four sources told CBS News.  It was from the White House and he was instructed by the voice on the other end to stand by for the president.",
    "url": "https://www.cbsnews.com/news/h-r-mcmaster-trump-accidental-call/"
  },
  {
    "text": "Tulsi Gabbard declared her residency in Texas.  Then she voted in Hawaii  —  As Tulsi Gabbard completed her transformation from a Hawaii Democratic politician to a MAGA surrogate last year, she put down stakes in a far redder state.  Gabbard and her husband bought a home outside of Austin … ",
    "url": "https://cnn.com/2025/04/09/politics/tulsi-gabbard-texas-hawaii-voting-residency-invs/"
  },
  {
    "text": "US Justice Dept bars its attorneys from participating in American Bar Association events  —  The U.S. Department of Justice on Wednesday barred its attorneys from traveling to or speaking at American Bar Association events, in the latest salvo by President Donald Trump's administration … ",
    "url": "https://www.reuters.com/legal/us-justice-dept-bars-its-attorneys-participating-american-bar-association-events-2025-04-09/"
  },
  {
    "text": "NIH freezes all research grants to Columbia University  —  Trump administration fires staff for flagship U.S. climate assessment  —  After April Fools' Day purge, U.S. health agencies spiral into chaos  —  Sifter  —  Gene editing fixes DNA—and treats incurable lung and liver disease",
    "url": "https://www.science.org/content/article/nih-freezes-all-research-grants-columbia-university"
  },
  {
    "text": "Social Security backs off cuts to phone services amid outcry  —  After weeks of confusion and outcry, the Social Security Administration said it is backing off its announced drastic cuts to phone services.  —  Why it matters: The changes would've strained an already backlogged agency … ",
    "url": "https://www.axios.com/2025/04/09/social-security-cuts-doge"
  },
  {
    "text": "U.S. says it is now monitoring immigrants' social media for antisemitism  —  U.S. Citizenship and Immigration Services has announced it will begin screening immigrant's social media for evidence of antisemitic activity as grounds for denying immigration benefit requests.",
    "url": "https://www.npr.org/2025/04/09/g-s1-59149/immigrants-social-media-antisemitism-dhs"
  },
  {
    "text": "Trans pilot falsely blamed in D.C. plane crash sues conservative influencer  —  Military pilot Jo Ellis said she had to hire private armed security for her family because of the false claims, which went viral on social media.  —  A transgender military pilot filed a defamation lawsuit Wednesday … ",
    "url": "https://www.nbcnews.com/feature/nbc-out/trans-pilot-falsely-blamed-potomac-plane-crash-sues-conservative-influ-rcna200474"
  },
  {
    "text": "Mixed Signals on Alleged Alien Enemies  —  The Supreme Court insists on due process but offers no specifics and leaves hundreds in a Salvadoran prison with no remedy.  —  Meet The Authors … The Supreme Court's decision Monday in Trump v. J.G.G. has sent a strange set of mixed messages … ",
    "url": "https://www.lawfaremedia.org/article/mixed-signals-on-alleged-alien-enemies"
  },
  {
    "text": "China Has Readied a Trade-War Arsenal That Takes Aim at U.S. Companies  —  Beijing's strategy to hit back at Trump goes well beyond tariffs, targeting companies who bank on their China ties  —  In the years since President Trump's first trade war with China, Beijing has built an arsenal of tools to hit the U.S. where it hurts.",
    "url": "https://www.wsj.com/world/china/china-trump-tariff-trade-war-response-1ac838b0?st=LsqcT6"
  }
]