[
  {
    "text": "The Only Patriotic Choice for President  —  It is hard to imagine a candidate more unworthy to serve as president of the United States than Donald Trump.  He has proved himself morally unfit for an office that asks its occupant to put the good of the nation above self-interest.",
    "url": "https://www.nytimes.com/2024/09/30/opinion/editorials/kamala-harris-2024.html?unlocked_article_code=1.Ok4.D1dZ.OfohLwh4zcQC&smid=nytcore-ios-share&referringSource=articleShare&sgrp=c-cb"
  },
  {
    "text": "The three phases of normalizing Trump's attack on Harris in Wisconsin  — The use of neutral language.  If you merely read about Donald Trump's deeply offensive rally this weekend in Prairie du Chien, Wisconsin, you probably thought it was about immigration.  And about Trump up to his usual tricks of disparaging his rivals.",
    "url": "https://margaretsullivan.substack.com/p/the-three-phases-of-normalizing-trumps"
  },
  {
    "text": "Legacy Media Is Failing Us Hard  —  Trump delivered some of his most terrifying remarks to date, but the press shrugged.  And now it's refusing to fact check Tuesday's debate.  —  Corporate media has consistently failed to meet the danger of rising fascism in the U.S. And there are two stark examples … ",
    "url": "https://statuskuo.substack.com/p/legacy-media-is-failing-us-hard"
  },
  {
    "text": "Oops, They Did It Again: The Mainstream Media Buries Trump's Outrage … It's a pretty sad commentary on the way our mainstream media cover Donald Trump that if you really want to know what Trump said at a given rally, you would be wasting your time going to The New York Times or The Washington Post … ",
    "url": "https://newrepublic.com/series/51/mainstream-media-sanewashing-trump-migrants"
  },
  {
    "text": "An Ohio Businessman Faces Death Threats for Praising His Haitian Workers  —  The lifelong Republican employs fewer Haitians than others in Springfield, but his life has been upended since Donald J. Trump spread falsehoods about immigrants in his hometown.  —  For Jamie McGregor … ",
    "url": "https://www.nytimes.com/2024/09/30/us/springfield-ohio-haitians-threats.html?unlocked_article_code=1.Ok4.owwF.bMbd9HfnWIJB&smid=url-share"
  },
  {
    "text": "The Coming Trump Revenge Tour  —  Trump has campaigned on a wave of retaliatory criminal prosecutions.  It's not the first time he's promised to lock up his rivals — but a second term would be different.  —  In the most volatile presidential campaign of the last 50 years … ",
    "url": "https://www.politico.com/news/magazine/2024/09/30/trump-doj-revenge-political-enemies-00178218"
  },
  {
    "text": "‘FAKE and STAGED’: Trump Responds to Kamala Harris' Bogus Post on Hurricane Helene  —  As Matt and Katie have been covering, former and potentially future President Donald Trump is traveling to the site of Hurricane Helene devastation, while the Biden-Harris administration has had a particularly lacking response.",
    "url": "https://townhall.com/tipsheet/rebeccadowns/2024/09/30/trump-responds-to-kamala-harris-bogus-post-on-hurricane-relief-n2645513"
  },
  {
    "text": "Trump Is Taking a Dark Turn  —  If you think that Donald Trump's speeches this campaign cycle are just more of the same, consider the analysis of the person who knows more about them than anyone else.  —  “They thought they'd be out there jumping up and down, ‘Make America great again,’” … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/09/trump-police-purge-violence-harris-mentally-deficient/680084/"
  },
  {
    "text": "Judge again strikes down Georgia abortion law, allowing abortions to resume … About the Author  —  Maya T. Prabhu is a government reporter for The Atlanta Journal-Constitution.  Born in Queens, New York, and raised in northern Virginia, Maya attended Spelman College and then the University of Maryland for a master's degree.",
    "url": "https://www.ajc.com/politics/judge-again-strikes-down-georgia-abortion-law-allowing-abortions-to-resume/4PWIUSQDMNAPRNRQ6HEA7LPQC4/"
  },
  {
    "text": "California bans legacy admissions at all colleges  —  Gov. Gavin Newsom on Monday signed a prohibition on the practice.  —  SACRAMENTO, California — It will soon be illegal for public and private universities in California to consider an applicant's relationship to alumni or donors when deciding whether to admit them.",
    "url": "https://www.politico.com/news/2024/09/30/california-bans-legacy-admissions-colleges-00181655"
  },
  {
    "text": "Arkansas Judge Mandates Early Voting in Majority Black City  —  Early voting will be held at Seventh Street Church of Christ in West Memphis, Arkansas after a judge granted part of a request from two voters.  The voters in the majority-Black city initially requested at least two early voting locations.",
    "url": "https://www.democracydocket.com/news-alerts/arkansas-voters-sue-board-for-refusing-to-hold-early-voting-in-majority-black-county/"
  },
  {
    "text": "Polls show big increase in Republicans planning to vote for abortion rights  —  In some states, that GOP number could even approach a majority.  —  The politics of abortion rights have shifted massively toward Democrats since the Supreme Court overturned Roe v. Wade in 2022.",
    "url": "https://www.washingtonpost.com/politics/2024/09/30/polls-show-big-increase-republicans-planning-vote-abortion-rights/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI3NjY4ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI5MDUxMTk5LCJpYXQiOjE3Mjc2Njg4MDAsImp0aSI6IjZlMDZmYWQzLTVhYjctNDk1ZC05ZDc2LTczMmYxYWE1MDJlOSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzA5LzMwL3BvbGxzLXNob3ctYmlnLWluY3JlYXNlLXJlcHVibGljYW5zLXBsYW5uaW5nLXZvdGUtYWJvcnRpb24tcmlnaHRzLyJ9.mcQ35smhLaFAhmquZPKR5JbtDfU07hmHz1GFnbTheFU&itid=gfta"
  },
  {
    "text": "FBI to pay $22 million to settle claims of sexual discrimination at training academy  —  The payout to 34 women dismissed from the FBI's training academy in Quantico, Virginia, would rank among the biggest lawsuit settlements in the history of the bureau.  —  The FBI has agreed to pay … ",
    "url": "https://www.nbcnews.com/politics/justice-department/fbi-pay-22-million-settle-claims-sexual-discrimination-training-academ-rcna173253"
  },
  {
    "text": "Trump, Magic Beans, and the $100,000 Watch  —  Trump's watch scheme is an arrangement specifically designed to defeat bribery laws.  —  ∙ Paid  —  Before we start: A reader with deep connections to Asheville sent me a note about a friend who is working to get meals to people from a food hub.",
    "url": "https://www.thebulwark.com/p/trump-magic-beans-and-the-100000"
  },
  {
    "text": "On overtime pay, Trump slips up by accidentally telling the truth  —  Donald Trump admitted that he concocted a private-sector scheme to avoid paying his own employees overtime compensation.  So much for his “pro-worker” pitch.  —  Five of the most interesting words in Donald Trump's rhetorical repertoire … ",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/overtime-pay-trump-slips-accidentally-telling-truth-rcna173223"
  },
  {
    "text": "As Kamala Harris Passes the Two-Thirds Mark, Trump Adopts Apocalyptic Language  —  I continue to track the asymmetric pace of the campaigns of Donald Trump and Kamala Harris.  Today is another milestone for the Vice President.  —  As of today, Donald Trump has <5% of his campaign left (36 days of 721).",
    "url": "https://www.emptywheel.net/2024/09/30/as-kamala-harris-passes-the-two-thirds-mark-trump-adopts-apocalyptic-language/"
  },
  {
    "text": "Hamas Commander Killed in Israeli Strike Led U.N. Refugee Agency Teachers' Union  —  A Hamas commander in Lebanon who was killed in an Israeli airstrike overnight was an accredited member of the United Nations Relief and Works Agency for Palestine Refugees in the Near East, the embattled agency confirmed after his death.",
    "url": "https://www.nationalreview.com/news/hamas-commander-killed-in-israeli-strike-led-u-n-refugee-agency-teachers-union/"
  },
  {
    "text": "1 storm, more than 100 dead and a 500-mile path of destruction.  Now comes the hard work of recovering from Helene  —  Short on supplies, power and patience, storm victims who saw the brutal force of Helene upend their lives have emerged to a new week, facing the daunting challenge of rebuilding.",
    "url": "https://www.cnn.com/2024/09/30/weather/hurricane-helene-recovery-cleanup-monday/"
  },
  {
    "text": "VA staff got into Vance, Walz medical files, sparking investigation  —  At least a dozen VA employees improperly accessed the medical records of vice presidential nominees JD Vance and Tim Walz this summer, investigators found.  —  At least a dozen employees at the Department … ",
    "url": "https://www.washingtonpost.com/politics/2024/09/30/vance-walz-medical-records-breach-va/"
  },
  {
    "text": "California faces ‘unprecedented’ local spread of dengue fever, possibly driven by climate change  —  California last week clocked its fourth case of locally transmitted dengue fever this year — an alarming rise in a sometimes-deadly disease that experts fear could be fueled by climate change.",
    "url": "https://thehill.com/policy/energy-environment/4907598-california-dengue-fever-climate-change/"
  },
  {
    "text": "The Secretive Alliance Between the New York Post and Eric Adams  —  Rupert Murdoch's paper helped elect Adams and hasn't quite given up on him yet.  —  The mayor even worked the coat-check line for a moment before taking selfies with staff members.  “We all thought it was a little bit bizarre … ",
    "url": "https://nymag.com/intelligencer/article/eric-adams-new-york-post-alliance.html"
  },
  {
    "text": "Where Americans Have Been Moving Into Disaster-Prone Areas … Note: Population changes shown on maps reflect domestic migration and do not include international migration or local births and deaths.  —  The country's vast population shift has left more people exposed to the risk … ",
    "url": "https://www.nytimes.com/interactive/2024/09/30/climate/americans-moving-hurricane-wildfire-risk.html"
  },
  {
    "text": "Actor Zachary Levi cites RFK Jr.'s endorsement in call to support Trump  —  Actor Zachary Levi called former President Donald Trump the best choice voters have ahead of the 2024 election, citing how Trump has been backed by Robert F. Kennedy Jr.  —  Levi explained that he grew … ",
    "url": "https://www.washingtonexaminer.com/news/campaigns/presidential/3170444/zachary-levi-cites-rfk-endorsement-call-to-support-trump/"
  },
  {
    "text": "Biden administration expands asylum restrictions at southern border  —  The Biden administration announced Monday it will expand its asylum restrictions at the U.S.-Mexico border, cementing tougher standards that will cut off access to protections for many migrants.",
    "url": "https://thehill.com/latino/4907482-biden-asylum-restrictions-southern-border-immigration/"
  }
]