[
  {
    "text": "Donald Trump shares image of Joe Biden with hands and feet tied  —  Former president Donald Trump disseminated on social media on Friday an image of President Biden with his hands and feet tied, the latest example of the Republican candidate's use of increasingly violent rhetoric and imagery this campaign season.",
    "url": "https://www.washingtonpost.com/politics/2024/03/29/donald-trump-joe-biden-bound-and-gagged/"
  },
  {
    "text": "Trump shares video with image depicting Biden tied up in the back of a pickup truck  —  The former president has previously used violent images and rhetoric as he seeks a return to the White House.  —  Former President Donald Trump shared a video on social media Friday that included an image … ",
    "url": "https://www.nbcnews.com/politics/2024-election/trump-shares-image-depicting-biden-tied-back-pickup-truck-rcna145712"
  },
  {
    "text": "Trump Posts Image of Joe Biden Kidnapped And Bound With Rope  —  Trump signals approval of violent imagery targeting his political opponents  —  On Truth Social, Trump posted a video of Trump themed vehicles driving in New York.  One of the trucks has an image of Joe Biden on the back bound with rope,.",
    "url": "https://www.meidastouch.com/news/trump-posts-image-of-joe-biden-kidnapped-and-bound-with-rope"
  },
  {
    "text": "Donald Trump faces backlash after sharing video featuring a hogtied Joe Biden  —  Former President Donald Trump is facing intense criticism for what Democrats say is a new low this weekend after sharing a video on his social media website that has an image of President Joe Biden hogtied.",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/03/30/trump-video-biden-hogtied/73154098007/"
  },
  {
    "text": "Republican-appointed judges raise alarm over Trump attacks on law  —  Federal D.C. Judge Reggie B. Walton warned Trump's attacks on hush-money trial judge and others could lead to violence.  Reagan, Bush-appointed judges decry Jan. 6 revisionism, threats.  —  A Republican-appointed judge … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2024/03/29/trump-judge-attacks-violence/"
  },
  {
    "text": "Revisiting Florida 2000 and the Butterfly Effect  —  The evidence is strong that Al Gore would have won had it not been for an infamous ballot design in Palm Beach County.  —  We're still in a post-primary lull before the campaign starts to heat up — and before Donald J. Trump goes on trial.",
    "url": "https://www.nytimes.com/2024/03/30/upshot/florida-2000-gore-ballot.html"
  },
  {
    "text": "The Unhinged Arguments the Supreme Court Is Fielding on Trump Immunity  —  BUNKER MENTALITY  —  “Friend of the court” arguments are coming from across the political spectrum—and are showing the potential consequences of siding with Trump on immunity.  —  Retired American generals vehemently … ",
    "url": "https://www.thedailybeast.com/the-unhinged-arguments-the-supreme-court-is-fielding-on-trump-immunity"
  },
  {
    "text": "Donald Trump, Blasphemous Bible Thumper  —  On this holy weekend, one man is taking the Resurrection personally.  —  Donald Trump is presenting himself as the Man on the Cross, tortured for our sins.  “I consider it a great badge of courage,” he tells crowds.  “I am being indicted for you.”",
    "url": "https://www.nytimes.com/2024/03/30/opinion/trump-god-religion-easter.html"
  },
  {
    "text": "Democrats Embrace IVF in Fight to Regain House in 2024  —  In Iowa contest, Democratic challenger Christina Bohannan highlights her personal story in pitch to voters  —  DEWITT, Iowa—A congressional race in Iowa is testing whether the national uproar surrounding in vitro fertilization … ",
    "url": "https://www.wsj.com/politics/policy/democrats-embrace-ivf-in-fight-to-regain-house-in-2024-1fdacc87"
  },
  {
    "text": "Arizona Republican lawmakers want to scrap early voting, question could be on November ballot  —  The Arizona state Legislature is considering asking Arizonans if they want to vote like it's 1990.  —  A measure before the state Senate would invite voters to abolish early voting and add … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/03/30/arizona-republicans-early-voting/73149008007/"
  },
  {
    "text": "Three gringos in Coral Gables launch Biden-Harris Latino campaign.  (Sad trombone.)  —  If a picture is worth a thousand words, then the one recently in the Miami Herald of Florida Democratic Party chair Nikki Fried, Second Gentleman Douglas Emhoff and Miami-Dade County Mayor Daniella Levine Cava … ",
    "url": "https://www.miamiherald.com/news/local/news-columns-blogs/fabiola-santiago/article287165135.html"
  },
  {
    "text": "Why there's no big wave of immigrants voting illegally … - “They are allowing these people to come in ... they are signing them up to vote,” Trump told a crowd at a campaign stop in Iowa in January.  — “That's why you are having millions of people pour into our country, and it could very well affect the next election.”",
    "url": "https://www.axios.com/2024/03/30/no-big-wave-immigrants-voting-illegally-trump"
  },
  {
    "text": "Best Buy offers to screen LGBTQ nonprofit donations after conservative pressure, filing shows  —  In an email exchange with a conservative think tank, tucked into an SEC filing, the electronics retailer offered to screen its employee groups' donations to LGBTQ causes.",
    "url": "https://www.nbcnews.com/nbc-out/out-news/best-buy-offers-screen-lgbtq-nonprofit-donations-conservative-pressure-rcna145603"
  },
  {
    "text": "‘In office forever’: Trump's Project 2025 partner calls for ending presidential term limit  —  Conservatives are advocating to repeal the U.S. Amendment that limits presidential terms, prompting President Joe Biden's campaign to warn an election year victory for former President Donald Trump … ",
    "url": "https://www.rawstory.com/trump-term-limits/"
  }
]