[
  {
    "text": "Julian Assange has reached a plea deal with the U.S., allowing him to go free  —  The WikiLeaks founder has been held in a prison outside London for the last five years and fought extradition to the United States.  —  WASHINGTON — WikiLeaks founder Julian Assange plans to plead guilty … ",
    "url": "https://www.nbcnews.com/politics/justice-department/julian-assange-reached-plea-deal-us-allowing-go-free-rcna158695"
  },
  {
    "text": "Wikileaks founder Julian Assange to plead guilty, return to Australia  —  WASHINGTON (AP) — WikiLeaks founder Julian Assange will plead guilty to a felony charge in a deal with the U.S. Justice Department that will free him from prison and resolve a long-running legal saga that spanned multiple continents … ",
    "url": "https://apnews.com/article/assange-plea-deal-wikileaks-justice-department-d329ba4614dbfa77b5eb968d07fd9bd0"
  },
  {
    "text": "WikiLeaks founder Julian Assange strikes plea deal with the U.S.  —  WikiLeaks founder Julian Assange has entered into a plea deal with the U.S. government, bringing an end to a years-long international saga over his handling of national security secrets.  —  Assange is preparing to plead guilty … ",
    "url": "https://www.npr.org/2024/06/24/nx-s1-5017953/julian-assange-plea-deal"
  },
  {
    "text": "Bankruptcy trustee discloses plan to shut down Alex Jones' Infowars and liquidate assets  —  A U.S. bankruptcy court trustee is planning to shut down conspiracy theorist Alex Jones' Infowars media platform and liquidate its assets to help pay the $1.5 billion in lawsuit judgments Jones owes … ",
    "url": "https://apnews.com/article/alex-jones-infowars-bankruptcy-sandy-hook-e8bf9a3d11b9506abb18c285d3e7b138"
  },
  {
    "text": "Alex Jones' court trustee plans to shut down his notorious conspiracy outlet Infowars  —  Conspiracy theorist Alex Jones' Infowars media empire will be shut down and sold off, a bankruptcy court-appointed trustee said in an emergency court filing Sunday, signalling the end of the notorious far-right outlet … ",
    "url": "https://www.cnn.com/2024/06/24/media/alex-jones-infowars-court-trustee/"
  },
  {
    "text": "How ‘Pro-Life’ Lost all Meaning  —  The anti-abortion movement may have won the battle with Dobbs, but the war is just getting started.  —  The pro-life movement may have won the battle two years ago today, but they're losing the war—and turning an entire generation away from their cause.",
    "url": "https://www.theatlantic.com/newsletters/archive/2024/06/how-pro-life-lost-all-meaning/678784/"
  },
  {
    "text": "Days before debate, Trump spokesperson clashes with CNN anchor on air  —  “We're going to stop this interview if you're going to keep attacking my colleagues,” Kasie Hunt said.  —  A Donald Trump spokesperson got into a tense exchange with CNN's Kasie Hunt over debate hosts Dana Bash … ",
    "url": "https://www.politico.com/news/2024/06/24/trump-debate-cnn-00164658"
  },
  {
    "text": "Special counsel falters in push to limit Trump's attacks on FBI agents  —  Judge Cannon does not seem likely to rule ahead of this week's presidential debate on whether to bar Donald Trump from attacking agents involved in his case  —  FORT PIERCE, Fla. — Federal prosecutors struggled … ",
    "url": "https://www.washingtonpost.com/national-security/2024/06/24/trump-cannon-fbi-false-threats/"
  },
  {
    "text": "Texas abortion ban linked to 13% increase in infant and newborn deaths  —  “This might foreshadow what is happening in other states,” said Johns Hopkins public health researcher Alison Gemmill.  “Texas is basically a year ahead.”  —  A Texas law that banned abortions in early pregnancy … ",
    "url": "https://www.nbcnews.com/health/health-news/texas-abortion-ban-linked-rise-infant-newborn-deaths-rcna158375"
  },
  {
    "text": "Inside Biden's Camp David Debate Prep  —  President Biden's aides are working to position him as a campaign-season fighter who can counterpunch on the fly and combat voters' concerns about his age.  —  At Camp David, a movie theater and an airplane hangar have been outfitted with lights … ",
    "url": "https://www.nytimes.com/2024/06/24/us/politics/biden-trump-debate-camp-david.html"
  },
  {
    "text": "“Months she wasted”: National security lawyer says Judge Cannon's “hubris” turned case into a “mess”  —  Trump judge already made “egregiously flawed ruling” and appears to be “in over her head,” Bradley Moss told Salon  —  With no trial date in sight for Donald Trump's classified documents case … ",
    "url": "https://www.salon.com/2024/06/24/months-she-wasted-national-security-lawyer-says-cannons-hubris-turned-case-into-a-mess/"
  },
  {
    "text": "The GOP's latest headache: A push to arrest Merrick Garland  —  This House GOP is about to add another item to their long list of abnormal events: voting to hold Attorney General Merrick Garland in “inherent contempt.”  Rep. Anna Paulina Luna (R-Fla.) said she will force a vote this week … ",
    "url": "https://www.politico.com/live-updates/2024/06/24/congress/explainer-inherent-contempt-garland-house-00164681"
  },
  {
    "text": "Journalist shot by Minneapolis police at George Floyd protest in hospice care  —  Linda Tirado 'is at life's end' due to eye injury sustained while covering a protest in 2020  —  A journalist who was shot in the eye by Minneapolis police while covering the 2020 protests following the murder … ",
    "url": "https://www.theguardian.com/us-news/article/2024/jun/24/linda-tirado-journalist-shot-police-protests-hospice"
  },
  {
    "text": "Lawsuit challenges new Louisiana law requiring classrooms to display the Ten Commandments  —  Civil liberties groups filed a lawsuit Monday to block Louisiana's new law that requires the Ten Commandments to be displayed in every public school classroom, a measure they contend is unconstitutional.",
    "url": "https://apnews.com/article/louisiana-ten-commandments-lawsuit-school-classroom-a1255c8383d06fc04c3bafe899b67816"
  },
  {
    "text": "Conservative-backed group is creating a list of federal workers it suspects could resist Trump plans  —  From his home office in small-town Kentucky, a seasoned political operative is quietly investigating scores of federal employees suspected of being hostile to the policies of Republican Donald Trump … ",
    "url": "https://apnews.com/article/trump-biden-president-project-2025-33d3fc2999a74f4aa424f1128dca2d16"
  },
  {
    "text": "Rapidan Dam breached by flood waters in southern Minnesota; nearby residents warned to potentially evacuate  —  RAPIDAN TOWNSHIP, Minn. — Flooding on the Blue Earth River breached the Rapidan Dam Monday morning and it's now in an “imminent failure condition,” officials said.",
    "url": "https://www.cbsnews.com/minnesota/news/rapidan-dam-fails-evacuation-blue-earth-county/"
  },
  {
    "text": "Tennessee ban on gender transition care to be reviewed by Supreme Court  —  More than 20 states have passed bans or restrictions on gender transition care for minors since 2021.  —  The Supreme Court on Monday agreed to review a Tennessee law that bans gender transition care for people younger than 18.",
    "url": "https://www.washingtonpost.com/politics/2024/06/24/scotus-trans-minors-gender-care/"
  },
  {
    "text": "Netanyahu walks back proposal for Gaza hostage-ceasefire deal endorsed by Biden … - More than 37,500 Palestinians have been killed in Gaza, according to local health officials.  — Netanyahu's comments contradicted statements by Biden administration officials who in recent days … ",
    "url": "https://www.axios.com/2024/06/24/netanyahu-walks-back-gaza-hostage-ceasefire-proposal"
  }
]