[
  {
    "text": "It's Official: With “Vermin,” Trump Is Now Using Straight-up Nazi Talk … We've all often wondered whether Donald Trump understands the historical import of what comes out of his mouth.  He's so ill-informed, so proudly ignorant, that it's easy to think that when he hurls a historical insult, he just doesn't know.",
    "url": "https://newrepublic.com/article/176877/trump-vermin-speech-nazi-language"
  },
  {
    "text": "In Veterans Day Speech, Trump Promises to ‘Root Out’ the Left  —  The former president said that threats from abroad were less concerning than liberal “threats from within” and that he was a “very proud election denier.”  —  Former President Donald J. Trump, on a day set aside to celebrate … ",
    "url": "https://www.nytimes.com/2023/11/11/us/politics/trump-new-hampshire-veterans.html"
  },
  {
    "text": "Trump Compares Political Foes To ‘Vermin’ On Veterans Day—Echoing Nazi Propaganda  —  Former President Donald Trump pledged to eliminate political extremist groups that “lie, steal and cheat on elections,” calling them “vermin” during a speech Saturday and in a Truth Social post commemorating Veterans Day … ",
    "url": "https://www.forbes.com/sites/saradorn/2023/11/12/trump-compares-political-foes-to-vermin-on-veterans-day-echoing-nazi-propaganda/"
  },
  {
    "text": "Biden shifts into campaign mode with more attacks on Trump  —  President Joe Biden is ramping up attacks on former President Trump after some allies privately urged him to do so in recent days.  —  WASHINGTON — President Biden is shifting more into campaign mode, with plans to increasingly attack … ",
    "url": "https://www.nbcnews.com/politics/2024-election/biden-shifts-campaign-mode-attacks-trump-rcna124777"
  },
  {
    "text": "What President Joe Biden plans to do if he gets a second term  —  President Joe Biden has a lot of unfinished business from his first term that he intends to continue if reelected.  It's a far different vision for the country than Donald Trump has outlined during his own campaign.  (Nov. 12)",
    "url": "https://apnews.com/article/joe-biden-second-term-agenda-election-2024-272bb9582df845cf9cd222ff2e9bd2f1"
  },
  {
    "text": "FBI Investigates Adams Over Turkish Consulate  —  After winning the 2021 Democratic mayoral primary, Eric Adams successfully pressed city officials to allow the opening of a Manhattan high-rise housing the Turkish Consulate General.  —  Federal authorities are investigating whether Mayor Eric Adams … ",
    "url": "https://www.nytimes.com/2023/11/12/nyregion/eric-adams-investigation-turkey-consulate.html"
  },
  {
    "text": "“Covering him as a normal candidate”: Extremism scholars say TV news “normalizing” Trump's threats  —  TV news outlets increasingly ignore Trump's “dehumanizing” rhetoric at rallies despite growing threat  —  Trump recently made alarming statements, including advocating for “ideological screening” … ",
    "url": "https://www.salon.com/2023/11/12/covering-him-as-a-normal-candidate-extremism-scholars-say-tv-news-normalizing-trumps/"
  },
  {
    "text": "Defying Democratic pushback, Dean Phillips vows to invest millions in his primary challenge to Biden  —  Rep. Dean Phillips is escalating his long-shot presidential primary challenge to President Joe Biden, vowing to invest as much of his multimillion-dollar fortune as it takes to win.",
    "url": "https://www.cnn.com/2023/11/12/politics/dean-phillips-joe-biden-democratic-primary-challenge/"
  },
  {
    "text": "Army Ammunition Plant Is Tied to Mass Shootings Across the U.S.  —  The site was built for the military, but commercial sales are booming with little public accountability.  Rounds have been bought by murderers, antigovernment groups and others.  —  By Ben DooleyVideos by Emily Rhyne",
    "url": "https://www.nytimes.com/2023/11/11/us/army-ammunition-factory-shootings.html"
  },
  {
    "text": "Voting group founded by Abrams, once led by Warnock, faces financial scrutiny  —  The New Georgia Project, which helped turn Georgia into a swing state, confronts allegations of mismanagement, undocumented spending.  —  The New Georgia Project, a voting rights organization founded … ",
    "url": "https://www.politico.com/news/2023/11/12/new-georgia-project-nse-ufot-00122485"
  },
  {
    "text": "Trump defense at New York fraud trial set to counter state attorney general  —  NEW YORK — Former Trump Organization insider Michael Cohen testified in state court that his ex-boss Donald Trump instructed him to fudge numbers on annual financial statements so that they would show his desired net worth.",
    "url": "https://www.washingtonpost.com/politics/2023/11/12/trump-new-york-fraud-trial-james/"
  },
  {
    "text": "Progressive Minnesota US Rep. Ilhan Omar draws prominent primary challenger  —  U.S. Rep. Ilhan Omar got a prominent Democratic primary challenger Sunday when former Minneapolis City Council member Don Samuels announced he'll try once again to unseat her after coming close in 2022.",
    "url": "https://apnews.com/article/ilhan-omar-don-samuels-minnesota-representative-election-11eeae5c91fedaac8b949319a7acf3eb"
  },
  {
    "text": "House GOP pursuing two-step plan to avert government shutdown  —  House Republicans are pursuing a two-step plan for funding the government, three sources familiar with the matter told CNN, as Congress barrels toward another spending deadline Friday.  —  Newly elected House Speaker Mike Johnson announced … ",
    "url": "https://www.cnn.com/2023/11/11/politics/house-speaker-mike-johnson-pitches/"
  },
  {
    "text": "Burgum vows to stick it out through the New Hampshire primary  —  After he failed to qualify for the third debate, the long-shot Republican presidential candidate said he won't suspend his campaign before the Iowa caucuses and New Hampshire primary.  —  DES MOINES — Long-shot Republican … ",
    "url": "https://www.nbcnews.com/meet-the-press/meetthepressblog/burgum-vows-stick-new-hampshire-primary-rcna124813"
  },
  {
    "text": "Scoop: Top Biden adviser to visit Israel, Qatar to discuss efforts to free hostages  —  Brett McGurk, President Biden's senior Middle East adviser, is expected to travel to Israel and several other countries in the region this coming week to discuss the war in Gaza and the efforts to secure … ",
    "url": "https://www.axios.com/2023/11/12/hamas-gaza-hostages-qatar-israel-netanyahu-biden"
  }
]