[
  {
    "text": "After a Blowout Week, Wall Street Decision Makers Brace for More Chaos  —  The financial titans who backed Trump are now dealing with the fallout from his tariffs.  They spent the weekend surveying the damage of last week's major sell-off.  —  There was little rest on Wall Street this weekend.",
    "url": "https://www.nytimes.com/2025/04/06/business/stock-market-plunge-investment-bank-impact.html?unlocked_article_code=1.9k4.thee.Qx6AABTI3Kyw"
  },
  {
    "text": "Dow futures fall 1,500 points Sunday as Trump tariff market rout escalates: Live updates  —  U.S. stock futures dropped on Sunday evening as the White House remained defiant even after a two-day historic stock market rout that followed President Donald Trump's rollout of shockingly high tariff rates on most key U.S. trading partners.",
    "url": "https://www.cnbc.com/2025/04/06/stock-market-today-live-updates.html"
  },
  {
    "text": "Trump not trying to crash market with tariffs, says White House economic advisor … A crashing stock market is not part of an intentional strategy by President Donald Trump, White House National Economic Council director Kevin Hassett told ABC's “This Week” on Sunday.",
    "url": "https://www.cnbc.com/2025/04/06/kevin-hassett-stock-market-crash-not-part-of-trumps-strategy.html"
  },
  {
    "text": "Trump administration deports gay makeup artist to prison in El Salvador  —  Andry Hernandez Romero, a gay makeup artist who came to the United States last year in search of asylum, is one of 238 Venezuelan migrants who were flown from the U.S. to a maximum security prison in El Salvador three weeks ago.",
    "url": "https://www.cbsnews.com/news/venezuelan-migrants-deportations-el-salvador-prison-60-minutes/"
  },
  {
    "text": "Judge says deportation of Maryland man to an El Salvador prison was ‘wholly lawless’  —  The U.S. government's decision to arrest a Maryland man and send him to a notorious prison in El Salvador appears to be “wholly lawless,” a federal judge wrote Sunday in a legal opinion explaining … ",
    "url": "https://apnews.com/article/ice-trump-immigration-el-savador-5d2f7b919cb1a4ed5ce31d44f391d8f5"
  },
  {
    "text": "Second measles death reported in Texas  —  Health Secretary Robert F. Kennedy Jr. is expected to attend the child's funeral, which is scheduled for Sunday.  —  Another child with measles in Texas has died, the Department of Health and Human Services confirmed late Saturday night, though the exact cause of death is under investigation.",
    "url": "https://www.nbcnews.com/health/health-news/second-measles-death-texas-child-kennedy-rcna199882"
  },
  {
    "text": "Second child dies of measles in Texas, media reports  —  A second child with measles has died in Texas as hundreds of cases of the infectious disease have been recorded in recent weeks, prompting U.S. Health Secretary Robert F. Kennedy Jr. to visit the state, media outlets reported on Sunday.",
    "url": "https://www.reuters.com/world/us/kennedy-travel-texas-after-second-measles-related-death-axios-reports-2025-04-06/"
  },
  {
    "text": "Treasury Sec. Bessent says 'there doesn't have to be a recession': Full interview  —  Treasury Sec. Scott Bessent exclusively joins Meet the Press days after President Donald Trump unveiled expansive tariffs on the United States' largest trading partners.",
    "url": "https://www.nbcnews.com/meet-the-press/video/treasury-sec-bessent-says-there-doesn-t-have-to-be-a-recession-full-interview-236654149913"
  },
  {
    "text": "Republican senator floats using violence against journalists who report ‘fake news’  —  Markwayne Mullin recounted how a reporter fatally shot a former congressman in 1890, adding there might be less “fake news ... if we could still handle our differences that way.”",
    "url": "https://www.nbcnews.com/politics/congress/markwayne-mullin-floats-using-violence-journalists-report-fake-news-rcna199922"
  },
  {
    "text": "Sen. Mullin suggests ‘fake news’ would decline if violence could ‘still’ settle disputes  —  Journalists would write fewer “fake news” stories if disputes over coverage could be handled through violence, U.S. Sen. Markwayne Mullin suggested on social media.  —  In a video posted over the weekend … ",
    "url": "https://eu.oklahoman.com/story/news/2025/04/06/markwayne-mullin-fake-news-remarks-us-senator-capitol/82963694007/"
  },
  {
    "text": "Exclusive: how the Atlantic's Jeffrey Goldberg got added to the White House Signal group chat  —  Internal investigation cleared the national security adviser Mike Waltz, but the mistake was months in the making  —  Donald Trump's national security adviser Mike Waltz included a journalist … ",
    "url": "https://www.theguardian.com/us-news/2025/apr/06/signal-group-chat-leak-how-it-happened"
  },
  {
    "text": "Amid anti-DEI push, National Park Service rewrites history of Underground Railroad  —  Since Trump took office, the park service — an agency charged with preserving American history — has changed how its website describes key moments from slavery to Jim Crow",
    "url": "https://www.washingtonpost.com/investigations/2025/04/06/national-park-service-underground-railroad-history-slavery/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQzOTEyMDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ1Mjk0Mzk5LCJpYXQiOjE3NDM5MTIwMDAsImp0aSI6IjRiMzYzMGM3LWY4YmQtNGM3NS05MjNjLTUwNzI4ZjNkMWQwYSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9pbnZlc3RpZ2F0aW9ucy8yMDI1LzA0LzA2L25hdGlvbmFsLXBhcmstc2VydmljZS11bmRlcmdyb3VuZC1yYWlscm9hZC1oaXN0b3J5LXNsYXZlcnkvIn0.NJeQgDttIclC-I8x1pFhlSfDIelzBtZ-mbICWqiPn68&itid=gfta"
  },
  {
    "text": "Trump Will Get His Showy (And Likely Expensive) Military Parade in D.C.  —  President Donald Trump for years has lusted after a big military parade over which he could preside—just like he sees leaders do in other mostly authoritative countries.  —  During his first term in 2018 … ",
    "url": "https://washingtoncitypaper.com/article/761814/trump-parade-military-dc/"
  },
  {
    "text": "The Cabinet Secretary Who Wants His Cookies Freshly Baked  —  Interior Secretary Doug Burgum likes chocolate-chip cookies—preferably freshly baked and still warm.  —  This peculiar fact became the talk of the Department of Interior in recent weeks after his chief of staff, JoDee Hanson … ",
    "url": "https://www.theatlantic.com/politics/archive/2025/04/burgum-cookies/682319/"
  },
  {
    "text": "NIH scientists have a cancer breakthrough.  Layoffs are delaying it.  —  A big step forward in cancer therapy has been slowed by layoffs and new restrictions at the National Institutes of Health, where it was developed.",
    "url": "https://www.washingtonpost.com/science/2025/04/06/nih-firings-cancer-immunotherapy-treatment/"
  },
  {
    "text": "Democrats see growing number of young progressive challengers  —  A growing number of Democratic incumbents are facing primary challenges from younger progressives, underscoring generational and ideological rifts within the party.  —  At least three long-serving members of the House … ",
    "url": "https://thehill.com/homenews/campaign/5233340-democrats-younger-advocates/"
  },
  {
    "text": "GOP Rep: Adversaries are “laughing at us” over NSA firings  —  Rep. Don Bacon (R-Neb.) slammed the decision to fire Gen. Timothy Haugh, the National Security Agency director and head of U.S. Cyber Command, without any explanation as “heartbreaking” Sunday.  —  The big picture: Haugh … ",
    "url": "https://www.axios.com/2025/04/06/nsc-nsa-firings-loomer"
  },
  {
    "text": "Chinese woman detained by US border patrol in Arizona dies by suicide  —  Officials reportedly didn't publicly acknowledge death until inquiries were made about woman, 52, who overstayed visa  —  A woman being detained in Arizona by US border patrol for overstaying her visa has died by suicide … ",
    "url": "https://www.theguardian.com/us-news/2025/apr/06/chinese-woman-border-patrol-arizona-suicide"
  },
  {
    "text": "Washington worries Trump could bail out Zuckerberg  —  With a historic antitrust suit looming against Meta, could the company get a reprieve from its new ally in the White House?  —  Less than two weeks before the start of a landmark antitrust trial against tech giant Meta … ",
    "url": "https://www.politico.com/news/2025/04/06/washington-worries-trump-could-bail-out-zuckerberg-00273712"
  }
]