[
  {
    "text": "Hillary Clinton Debated Trump.  Here's Her Advice for Kamala Harris.  —  The 2016 Democratic nominee fell short to Donald Trump, but she had strong debate moments against him.  In an interview, she offered some thoughts for Kamala Harris.  —  Hillary Clinton has as much experience as any Democrat in debating Donald J. Trump.",
    "url": "https://www.nytimes.com/2024/09/07/us/politics/hillary-clinton-debate-trump-harris.html"
  },
  {
    "text": "Why Kamala Isn't Preparing to Knock Out Trump at the Debate  —  To her campaign, something else is more important.  —  It's the stuff of #Resistance dreams: Kamala Harris, the prosecutor, gets onstage in Philadelphia next Tuesday across from Donald Trump, the felon, and proceeds to brutally expose … ",
    "url": "https://nymag.com/intelligencer/article/abc-debate-kamala-harris-strategy-donald-trump.html"
  },
  {
    "text": "Inside the Trump-Harris Debate Prep: Method Acting, Insults, Tough Questions  —  Kamala Harris is camped out at a Pittsburgh hotel.  Donald Trump is being peppered informally by aides.  Both sides share the same belief about why the debate is so crucial.  —  Vice President Kamala Harris … ",
    "url": "https://www.nytimes.com/2024/09/07/us/politics/trump-harris-debate-prep.html"
  },
  {
    "text": "YouTubers Are Almost Too Easy to Dupe  —  No wonder Russia finds its useful idiots among the extremely online.  —  Perhaps the most accurate cliché is that if a deal appears too good to be true, then it probably is.  —  To wit: If a “private investor” of unknown origin approaches … ",
    "url": "https://www.theatlantic.com/technology/archive/2024/09/tenet-media-indictment/679743/?gift=bQgJMMVzeo8RHHcE1_KM0VphL_8ZeL3_E3Ounhk8H3s&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Trump's incomprehensible child care comments appear to have broken a dam  —  In a “30 Rock” episode called “Governor Dunston,” the writing staff of the fictional sketch comedy show is confronted with a conundrum: The newly tapped Republican vice presidential candidate looks exactly … ",
    "url": "https://www.sfchronicle.com/politics/article/donald-trump-childcare-comments-19747778.php"
  },
  {
    "text": "Former Vice President Dick Cheney will vote for Harris, his daughter Liz Cheney says  —  The younger Cheney, one of former President Donald Trump's most prominent conservative critics, also said she was supporting Democratic Rep. Colin Allred for Senate in Texas.",
    "url": "https://www.nbcnews.com/politics/2024-election/dick-cheney-kamala-harris-liz-cheney-rcna169979"
  },
  {
    "text": "Pakistani National Charged for Plotting Terrorist Attack in New York City in Support of ISIS  —  For Immediate Release  —  Muhammad Shahzeb Khan, also known as Shazeb Jadoon, Attempted to Enter the United States to Carry Out a Mass Shooting at a Jewish Center in New York City  —  Note: View the complaint here.",
    "url": "https://www.justice.gov/opa/pr/pakistani-national-charged-plotting-terrorist-attack-new-york-city-support-isis-0"
  },
  {
    "text": "Trump's New E. Jean Carroll Defense Is That He Assaulted Other Women  —  Donald Trump on Friday inexplicably started detailing two horrific sexual assault allegations made against him, as part of a hapless attempt to discredit a completely different sexual assault allegation.",
    "url": "https://newrepublic.com/post/185680/donald-trump-new-e-jean-carroll-defense-assaulted-women"
  },
  {
    "text": "The far right actually hates America: Its dark ideology has foreign roots  —  Why do conservatives wrap themselves in the flag so desperately?  Maybe because their ideas are un-American  —  If there is one thing Republicans want you to know, it's how much they bleed red, white and blue for America.",
    "url": "https://www.salon.com/2024/09/07/the-far-right-actually-hates-america-its-dark-ideology-has-foreign-roots/"
  },
  {
    "text": "DNC to fly banners about Trump-Vance ticket, “Project 2025” over battleground state football games  —  Spectators at the University of Michigan football game against Texas on Saturday will be reminded of a different rival before the game: Ohio State.  —  At the Big House in Ann Arbor … ",
    "url": "https://www.cbsnews.com/news/dnc-banners-trump-vance-ticket-project-2025-over-battleground-state-football-games/"
  },
  {
    "text": "Speaker Mike Johnson Survived the Spring.  Now Comes the Fall.  —  GOP leader needs to thread the needle on funding the government this month and retaining the House majority in November  —  WASHINGTON—Mike Johnson's tightrope walk to remain House speaker starts this coming week.",
    "url": "https://www.wsj.com/politics/policy/speaker-mike-johnson-survived-the-spring-now-comes-the-fall-88f27df4"
  },
  {
    "text": "DeSantis' election police questioned people who signed abortion petitions  —  Two residents of Lee County said they were questioned at their homes about the validity of petition signatures.  —  Isaac Menasche remembers being at the Cape Coral farmer's market last year when someone asked … ",
    "url": "https://www.tampabay.com/news/florida-politics/elections/2024/09/06/florida-abortion-amendment-petition-signature-fraud-voters/"
  },
  {
    "text": "California state senator's former staffer sues lawmaker for alleged sexual harassment  —  Sen. Marie Alvarado-Gil recently changed her party registration from Democrat to Republican.  —  SACRAMENTO, California — State Sen. Marie Alvarado-Gil's former chief of staff has sued … ",
    "url": "https://www.politico.com/news/2024/09/06/california-sexual-harassment-discrimination-00177846"
  },
  {
    "text": "IRS joins investigation into NYPD's nightclub enforcement practices, commissioner's phone seized  —  The NYPD investigation is one of three News 4 learned are underway connected to top city officials  —  The Internal Revenue Service's Criminal Investigation division has joined … ",
    "url": "https://www.nbcnewyork.com/news/local/irs-joins-federal-investigation-into-nypd-nightclub-enforcement-practices-edward-caban/5771174/"
  },
  {
    "text": "Poll: Rick Scott and Debbie Mucarsel-Powell in heated race to win Florida Senate seat  —  WASHINGTON - Sen. Rick Scott, R-Fla., and former Rep. Debbie Mucarsel-Powell, D-Fla., are in a contentious neck to neck battle to win Florida's Senate seat in November, according to a new poll released Friday.",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/09/06/florida-senate-scott/75099632007/"
  },
  {
    "text": "Harris campaign unveils three ads targeting Trump on abortion ahead of debate  —  Vice President Harris's campaign on Saturday unveiled three new ads using former President Trump's comments on reproductive health care to target him ahead of the upcoming debate.",
    "url": "https://thehill.com/homenews/campaign/4866977-kamala-harris-donald-trump-abortion-rights-advertisements-2024/"
  },
  {
    "text": "Person infected with bird flu in Missouri had no contact with animals  —  The case adds to growing anxiety about the risk of the H5 virus spreading among humans.  —  A person in Missouri has been infected with bird flu, the Centers for Disease Control and Prevention said Friday.",
    "url": "https://www.nbcnews.com/health/health-news/person-infected-bird-flu-missouri-no-contact-animals-know-rcna170010"
  }
]