[
  {
    "text": "Send In the Troops, for Real  —  When local police can't restore order, the federal government has a duty to do so with a show of force.  —  Violent insurrectionists turned areas of Los Angeles into lawless hellscapes over the weekend, with anarchists setting fire to vehicles … ",
    "url": "https://www.wsj.com/opinion/send-in-the-troops-for-real-los-angeles-riots-ice-949c8ace"
  },
  {
    "text": "Democrats Enter Risky Political Terrain as Protests Grip California  —  Scenes of unrest in Southern California, stoked by President Trump as he tries to deport more immigrants, have left Democratic leaders worried the confrontation elevates a losing issue for the party.",
    "url": "https://www.nytimes.com/2025/06/10/us/politics/trump-immigration-ice-democrats.html"
  },
  {
    "text": "Troops deployed to LA will cost $134M, Pentagon predicts  —  The estimate came during a budget hearing with Defense Secretary Pete Hegseth, who said the president is enforcing “law and order.”  —  President Donald Trump's decision to deploy troops to Los Angeles amid mass deportation protests … ",
    "url": "https://www.politico.com/news/2025/06/10/troops-deployed-to-la-will-cost-134m-pentagon-official-says-00396632"
  },
  {
    "text": "Congresswoman Charged for Forcibly Impeding and Interfering With Federal Officers  —  For Immediate Release  —  U.S. Attorney's Office, District of New Jersey  —  NEWARK, N.J. - U.S. Representative LaMonica McIver was charged in a three-count indictment today for forcibly impeding … ",
    "url": "https://www.justice.gov/usao-nj/pr/congresswoman-charged-forcibly-impeding-and-interfering-federal-officers"
  },
  {
    "text": "Rep. LaMonica McIver indicted on federal charges over clash with law enforcement at ICE facility in New Jersey  —  Interim U.S. Attorney for New Jersey Alina Habba said the Democratic lawmaker, who plans to plead not guilty, was indicted on three counts of interfering with law enforcement.",
    "url": "https://www.nbcnews.com/politics/congress/lamonica-mciver-indicted-federal-charges-ice-new-jersey-rcna212221"
  },
  {
    "text": "Trump's border czar says protests are making immigration raids more ‘difficult’ and ‘dangerous’  —  In an interview with NBC News, Tom Homan described how protests in Los Angeles have affected Immigration and Customs Enforcement operations in recent days.  —  White House “border czar” … ",
    "url": "https://www.nbcnews.com/politics/immigration/trump-border-czar-tom-homan-los-angeles-protests-immigration-raids-rcna212212"
  },
  {
    "text": "Immigration raid rocks Nebraska meatpacking plant; protesters and law enforcement clash  —  A staffer for Rep. Don Bacon says between 75 and 80 workers at the Glenn Valley meatpacking plant have been detained.  The raid sparked confusion inside the plant, fury outside it and ignited fear of immigration raids around Nebraska.",
    "url": "https://flatwaterfreepress.org/ice-raids-hit-omaha-meatpacking-plants/"
  },
  {
    "text": "Trump Says Army Bases Will Revert to Confederate Names  —  The move would reverse a yearslong effort to remove names and symbols honoring the Confederacy from the military.  —  President Trump, during a speech at Fort Bragg, N.C., said on Tuesday that he would restore the names of all Army bases … ",
    "url": "https://www.nytimes.com/2025/06/10/us/politics/trump-army-base-rename-confederate.html"
  },
  {
    "text": "ABC News drops Terry Moran over late-night post attacking Trump and Stephen Miller  —  ABC News is parting ways with veteran correspondent Terry Moran, two days after he posted a missive on X calling President Donald Trump and deputy chief of staff Stephen Miller “world-class haters.”",
    "url": "https://cnn.com/2025/06/10/media/abc-news-terry-moran-exits-trump"
  },
  {
    "text": "Trump team plans to send thousands of migrants to Guantanamo starting as soon as this week  —  The use of the facility would send another signal of deterrence amid immigration crackdown.  —  The Trump administration is planning to dramatically ramp up sending undocumented migrants … ",
    "url": "https://www.politico.com/news/2025/06/10/trump-plans-migrants-guantanamo-bay-00396673"
  },
  {
    "text": "Trump to ramp up transfers to Guantánamo, including citizens of allies  —  The administration is preparing to send thousands of foreigners to the infamous detention facility, including people from Britain, France and Italy, with no plans to notify their home governments, officials said.",
    "url": "https://www.washingtonpost.com/national-security/2025/06/10/trump-guantanamo-deportations/"
  },
  {
    "text": "Do you approve or disapprove of deploying Marines to the Los Angeles area to respond to protests over the federal government's immigration enforcement?  —  YouGov surveyed 4309 US adults  —  Approve  —  34%  —  Disapprove  —  47%  —  Not sure  —  19%  —  Download Image",
    "url": "https://today.yougov.com/topics/politics/survey-results/daily/2025/06/10/50147/4"
  },
  {
    "text": "ECB's Lagarde gently urges China to change its ways  —  Central bank president used a speech in Beijing to stress China and the U.S. must share the burden of closing the massive trade gap threatening the global economy.  —  China must change its ways or it risks plunging the world into a new depression … ",
    "url": "https://www.politico.eu/article/ecbs-lagarde-gently-urges-china-to-change-its-ways/"
  },
  {
    "text": "Stephen Miller Behind Draconian Orders That Set Off L.A. Protests  —  Direct orders from Stephen Miller ignited the Los Angeles protests, leading to the precarious, highly militarized situation the city is currently facing.  —  The Wall Street Journal reported on Monday that Miller … ",
    "url": "https://newrepublic.com/post/196363/stephen-miller-los-angeles-protests-ice"
  },
  {
    "text": "Appeals Court Keeps Trump's Sweeping Tariffs in Place for Now  —  Court will hear fast-track oral arguments this summer  —  A federal appeals court on Tuesday granted the Trump administration's request to keep the president's far-reaching tariffs in effect for now but agreed to fast track its consideration of the case this summer.",
    "url": "https://www.wsj.com/economy/trade/appeals-court-keeps-trumps-sweeping-tariffs-in-place-for-now-5f5c7f35"
  },
  {
    "text": "Ousted CDC vaccine adviser says RFK Jr.'s message is clear: ‘Scientific expertise is no longer of use’  —  Q&A with Helen Chu on the termination of ACIP members and future vaccine policy  —  Helen Chu went through a multi-year process to finally gain a seat on the Centers for Disease Control … ",
    "url": "https://www.statnews.com/2025/06/10/cdc-vaccine-adviser-helen-chu-speaks-about-termination-of-acip-members/"
  },
  {
    "text": "Tulsi Gabbard Admits to Asking AI What to Classify in JFK Files  —  EASIER THAT WAY  —  Gabbard revealed that she fed tens of thousands of documents about the JFK assassination into an AI program for review.  —  Tulsi Gabbard relied on artificial intelligence to determine what to classify … ",
    "url": "https://www.thedailybeast.com/tulsi-gabbard-admits-to-asking-ai-what-to-classify-in-jfk-files/"
  },
  {
    "text": "Republicans Have a Revenue Problem  —  Locked in their embrace of tax-cutting orthodoxy, Republicans have no credible way to address the country's looming fiscal crisis.  —  Congressional republicans love to talk about the deficit and federal spending, particularly when Democrats are in power.",
    "url": "https://www.theatlantic.com/ideas/archive/2025/06/republicans-revenue-problem/683084/?gift=49wmX9XxesaxFXKJmFp0Pvjv21FLJdbw0MNISYSNu_w&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Is Trump's Birthday Parade a Celebration of the Army or a Funeral Cortege for Democracy?  —  ANYBODY WANT CAKE?  —  The president is, once again, disrespecting our armed forces by hijacking the U.S. Army's 250th birthday celebrations—and turning it into a party for himself.  —  OPINION",
    "url": "https://www.thedailybeast.com/is-trumps-birthday-parade-a-celebration-of-the-army-or-a-funeral-cortege-for-democracy/"
  },
  {
    "text": "Most GOP lawmakers plan to skip Trump's big parade  —  POLITICO surveyed 50 Hill Republicans.  Only six said they'd stick around Saturday for the big show.  —  President Donald Trump is celebrating the Army's 250th anniversary — and his own 79th birthday — with a massive, multimillion-dollar military parade Saturday in Washington.",
    "url": "https://www.politico.com/news/2025/06/10/trump-parade-congress-republicans-00398774"
  },
  {
    "text": "The Silence of the Generals  —  As President Donald Trump crossed a dangerous line at Fort Bragg, the brass failed to speak out in the Army's defense.  —  President Donald Trump continued his war against America's most cherished military traditions today when he delivered a speech at Fort Bragg.",
    "url": "https://www.theatlantic.com/ideas/archive/2025/06/silence-generals/683106/?gift=otEsSHbRYKNfFYMngVFweC9SKhWuL8c7oypTub1ifvo&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Bob Costas Condemns Mainstream Press for Doing ‘MAGA Media’: 'There Really Isn't Two Sides'  —  Legendary sportscaster Bob Costas criticized the media over its handling of President Donald Trump's second term during an awards ceremony on Monday night.  —  Costas took several major media organizations … ",
    "url": "https://www.mediaite.com/media/news/bob-costas-condemns-mainstream-press-for-doing-maga-media-there-really-isnt-two-sides/"
  },
  {
    "text": "Southern Baptists Endorse Effort to Overturn Same-Sex Marriage  —  The nation's largest Protestant denomination was motivated by conservative Christians' success in reversing Roe v. Wade.  —  Southern Baptists voted overwhelmingly on Tuesday to call for the overturning of the Supreme Court ruling … ",
    "url": "https://www.nytimes.com/2025/06/10/us/southern-baptist-obergefell-same-sex-marriage.html?unlocked_article_code=1.N08.H_A-.sZdzFMPfxrwc&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "New PRRI Poll: Three-Quarters of Americans Oppose Trump's Military Parade  —  As the 250th anniversary of the United States Army approaches, which also coincides with President Donald Trump's 79th birthday, Washington is preparing to mark the occasion with a large-scale military parade featuring thousands … ",
    "url": "https://prri.org/spotlight/military-parade-in-d-c-draws-public-opposition-ahead-of-army-and-trump-celebrations/"
  },
  {
    "text": "Eleanor Holmes Norton says she's seeking reelection amid age questions  —  Eleanor Holmes Norton, D.C.'s nonvoting House delegate, told reporters Tuesday she intends to seek reelection amid mounting questions about her ability to serve in Congress.  “Yeah, sure,” she said when asked about running for reelection.",
    "url": "https://www.politico.com/live-updates/2025/06/10/congress/eleanor-holmes-norton-reelection-00397248"
  },
  {
    "text": "Trump administration to end DHS program designed to thwart terror attacks  —  The $18 million program aims to prevent lone-wolf attacks like the ones that recently occurred in Boulder, Washington, D.C., New Orleans and New York.  —  The Trump administration is planning to eliminate a Department … ",
    "url": "https://www.nbcnews.com/politics/national-security/trump-administration-end-dhs-program-designed-thwart-terror-attacks-rcna212209"
  },
  {
    "text": "The Political Gap in Americans' News Sources  —  Exploring use of and trust in 30 sources across U.S. political lines  —  Table of Contents Table of Contents  —  Pew Research Center conducted this study to continue tracking news consumption and trust across a wide range of specific news sources.",
    "url": "https://www.pewresearch.org/journalism/2025/06/10/the-political-gap-in-americans-news-sources/"
  },
  {
    "text": "Trump Declares Dubious Emergencies to Amass Power, Scholars Say  —  In disputes over protests, deportations and tariffs, the president has invoked statutes that may not provide him with the authority he claims.  —  To hear President Trump tell it, the nation is facing a rebellion in Los Angeles … ",
    "url": "https://www.nytimes.com/2025/06/10/us/politics/trump-emergency-powers-invasion.html?unlocked_article_code=1.N08.PXpo.u8qk_3hI5IG2&smid=url-share"
  },
  {
    "text": "May was world's second-hottest on record, EU scientists say  —  The world experienced its second-warmest May since records began this year, a month in which climate change fuelled a record-breaking heatwave in Greenland, scientists said on Wednesday.  —  Last month was Earth's second-warmest … ",
    "url": "https://www.reuters.com/sustainability/cop/may-was-worlds-second-hottest-record-eu-scientists-say-2025-06-11/"
  }
]