[
  {
    "text": "Trump recorded pressuring Wayne County canvassers not to certify 2020 vote  —  Then-President Donald Trump personally pressured two Republican members of the Wayne County Board of Canvassers not to sign the certification of the 2020 presidential election, according to recordings reviewed … ",
    "url": "https://www.detroitnews.com/story/news/politics/2023/12/21/donald-trump-recorded-pressuring-wayne-canvassers-not-to-certify-2020-vote-michigan/72004514007/"
  },
  {
    "text": "Recordings reportedly show Trump pressuring Michigan canvassers to not certify 2020 vote: Detroit News  —  Former President Trump reportedly pushed Michigan canvassers to not certify the results of the 2020 during a phone call, according to recordings obtained by The Detroit News.",
    "url": "https://thehill.com/homenews/campaign/4372940-recordings-reportedly-show-trump-pressuring-michigan-canvassers-not-certify-2020-vote/"
  },
  {
    "text": "Washington Post Editorial Board: The Supreme Court Should Toss the Colorado Decision  —  People (including our own Ed Morrissey) have been saying this since the decision appeared Tuesday but I'm still a bit surprised to see the Washington Post's editorial board making the same case.",
    "url": "https://hotair.com/john-s-2/2023/12/21/washington-post-editorial-board-the-supreme-court-should-toss-the-colorado-decision-n600478"
  },
  {
    "text": "The Supreme Court Did This to Itself  —  The Supreme Court is on a collision course with itself, and it's not clear that the justices even know it.  We are now witnessing a five-car pileup of Trump-slash-Jan. 6 cases that will either be heard by the Supreme Court or land on their white marble steps in the coming weeks.",
    "url": "https://slate.com/news-and-politics/2023/12/supreme-court-trump-cases-democracy-disaster.html"
  },
  {
    "text": "New Hampshire Man Indicted for Threatening to Kill Three Presidential Candidates  —  For Immediate Release  —  A New Hampshire man has been indicted in connection with sending threatening text messages to three presidential candidates.  —  Tyler Anderson, 30, of Dover … ",
    "url": "https://www.justice.gov/opa/pr/new-hampshire-man-indicted-threatening-kill-three-presidential-candidates"
  },
  {
    "text": "Man Indicted for Allegedly Texting Death Threats to 3 GOP Candidates  —  The DOJ says Tyler Anderson wrote messages saying he'd “impale” and “disembowel” one candidate, and would “blow” the “head off” another.  —  A New Hampshire man was indicted Thursday on allegations he sent disturbing death threats … ",
    "url": "https://www.thedailybeast.com/new-hampshire-man-tyler-anderson-indicted-on-allegations-he-threatened-lives-of-gop-candidates"
  },
  {
    "text": "Former Trump lawyer Rudy Giuliani files for bankruptcy protection, lists more than $100 million in debts  — Rudy Giuliani filed for Chapter 11 bankruptcy protection in New York.  — The former New York City mayor listed debts that include a recent nearly $150 million civil judgment … ",
    "url": "https://www.cnbc.com/2023/12/21/former-trump-lawyer-rudy-giuliani-files-for-bankruptcy-protection.html"
  },
  {
    "text": "Rudy Giuliani files for Chapter 11 bankruptcy in New York after defamation case  —  Rudy Giuliani has filed for chapter 11 bankruptcy in New York, one day after a federal judge ruled that he must immediately pay the $148 million he owes two Georgia women he falsely accused of helping to steal the 2020 election.",
    "url": "https://www.washingtonpost.com/national-security/2023/12/21/rudy-giuliani-bankruptcy/"
  },
  {
    "text": "Young Voters Overwhelmingly Support Biden Over Trump, Finds Economist/YouGov Poll  —  The poll comes amid a series reports of low approval ratings among the younger generation for Biden, spurred by his administration's handling of the ongoing Israel-Hamas conflict",
    "url": "https://themessenger.com/politics/young-voters-overwhelmingly-support-biden-over-trump-finds-economist-yougov-poll"
  },
  {
    "text": "Harvard President Claudine Gay to Submit 3 Additional Corrections, Corporation Says Improper Citations Fall Short of Research Misconduct  —  Harvard President Claudine Gay will request three corrections to her 1997 Ph.D. dissertation in the latest series of updates Gay has submitted amid mounting allegations of plagiarism.",
    "url": "https://www.thecrimson.com/article/2023/12/21/gay-plagiarism-dissertation-corrections/"
  },
  {
    "text": "Khashoggi's widow wins political asylum in the United States  —  The decision may be the last act in a tragic chain of events that began in 2018, when Post columnist Jamal Khashoggi was strangled and dismembered in Turkey  —  Jamal Khashoggi's widow, who went into hiding after The Washington Post columnist … ",
    "url": "https://www.washingtonpost.com/nation/2023/12/21/khashoggi-hanan-political-asylum/"
  },
  {
    "text": "Substack says it will not remove or demonetize Nazi content … More than 200 Substack authors asked the platform to explain why it's “platforming and monetizing Nazis,” and now they have an answer straight from co-founder Hamish McKenzie: … While McKenzie offers no evidence to back these ideas … ",
    "url": "https://www.theverge.com/2023/12/21/24011232/substack-nazi-moderation-demonetization-hamish-mckenzie"
  },
  {
    "text": "Palestinian support for ‘armed struggle’ is rising as Gaza death estimate tops 20,000  —  “You cannot kill people into liking you,” a policy analyst said in response to a recent poll.  —  As the death toll in Gaza reached an estimated 20,000 on Thursday, the majority of them women and children … ",
    "url": "https://www.nbcnews.com/investigations/palestinian-support-armed-struggle-rising-gaza-death-estimate-tops-200-rcna130516"
  },
  {
    "text": "Jack Smith Swings Back at Trump in Push to Start Working on South Florida Jury Questionnaire  —  The special counsel's office on Thursday doubled down on its call for Judge Cannon to set an important Feb. 2 deadline that can kickstart the vetting of potential jurors",
    "url": "https://themessenger.com/politics/jack-smith-trump-judge-cannon-florida-jury-questionnaire"
  },
  {
    "text": "Ivanka Trump, Jared Kushner visit Israel to meet with leaders, families of hostages  —  Ivanka Trump and Jared Kushner traveled to Israel to meet with political leaders and families of those kidnapped during Hamas' Oct. 7 terrorist attacks.  —  “It's important to see with one's own eyes … ",
    "url": "https://thehill.com/blogs/in-the-know/4372238-ivanka-trump-jared-kushner-visit-israel-to-meet-with-leaders-families-of-hostages/"
  },
  {
    "text": "John Schneider Probe Opened By Secret Service After ‘Dukes Of Hazzard’ Star Urges Public Hanging Of Joe Biden  — Vin Diesel's Ex-Assistant Sues ‘Fast & Furious’ Star For Sexual Battery & Retaliation; Read Full Complaint  — ‘Warnamount’ Merger Talk Confounds Investors And Industry … ",
    "url": "https://deadline.com/2023/12/john-schneider-secret-service-joe-biden-hanging-comment-1235680080/"
  },
  {
    "text": "No Labels floats the possibility of a coalition government or Congress selecting the president in 2024  —  The group, which is trying to mount a third-party presidential campaign, could block a major party nominee from winning the Electoral College outright.",
    "url": "https://www.nbcnews.com/politics/2024-election/no-labels-coalition-government-electoral-college-rcna130709"
  },
  {
    "text": "Fetterman, Breaking With the Left on Israel, Rejects ‘Progressive’ Label  —  The Pennsylvania senator, who has angered liberal Democrats with his staunchly pro-Israel stance and position on immigration, assailed the left and said he no longer considers himself a progressive.",
    "url": "https://www.nytimes.com/2023/12/21/us/politics/john-fetterman-progressive-israel.html"
  },
  {
    "text": "Judge keeps Chris Christie off Maine's Republican primary ballot  —  Former New Jersey Gov. Chris Christie's latest attempt to get on the Maine Republican presidential primary ballot failed Thursday after his campaign tried to recover from a surprising setback in the Super Tuesday state.",
    "url": "https://www.cbsnews.com/news/judge-rules-chris-christie-must-remain-off-maine-republican-presidential-primary-ballot/"
  },
  {
    "text": "November shatters global temperature records, marking 6 record-warm months in a row  —  The planet has experienced an astounding six-month run of record-breaking temperatures, including the hottest November on record, federal officials announced Thursday.  —  Global average temperatures … ",
    "url": "https://www.latimes.com/environment/story/2023-12-21/november-shatters-global-temperature-records"
  }
]