[
  {
    "text": "The GOP debate shows that Trump's hostile takeover is complete  —  He's thoroughly humiliated everyone involved, including Fox News and the RNC. … The first Republican presidential primary debate of 2024 is tonight.  Usually the events are chances to shape the future of a party by introducing voters to new ideas and faces.",
    "url": "https://www.publicnotice.co/p/fox-news-gop-debate-trump-2024"
  },
  {
    "text": "The debate Ron DeSantis needs to win  —  MILWAUKEE — THE DEBATE RON DESANTIS NEEDS TO WIN.  The Republican presidential field that will take the stage here at the Fiserv Forum Wednesday night is made up of several subgroups.  There is the who-are-these-guys group, with Gov. Doug Burgum (R-ND) and former Arkansas Gov. Asa Hutchinson.",
    "url": "https://www.washingtonexaminer.com/opinion/the-debate-ron-desantis-needs-to-win"
  },
  {
    "text": "Tucker Carlson and Donald Trump reunite to try to upstage Fox News  —  The on-again, off-again partnership found mutual benefit in a pre-recorded interview to air during the first Republican presidential debate  —  Last Wednesday, Donald Trump welcomed Tucker Carlson and his small team … ",
    "url": "https://www.washingtonpost.com/politics/2023/08/22/tucker-carlson-donald-trump-reunite-try-upstage-fox-news/"
  },
  {
    "text": "Donald Trump to surrender at Fulton county jail on Thursday night  —  Exclusive: Trump had lawyers negotiate booking to take place during prime viewing hours to get maximum television ratings  —  Donald Trump is expected to surrender at the Fulton county jail on Thursday evening on racketeering … ",
    "url": "https://www.theguardian.com/us-news/2023/aug/22/donald-trump-surrender-fulton-county-jail-thursday-night"
  },
  {
    "text": "D.C. Attorney General is probing Leonard Leo's network  —  The Federalist Society co-chair and ex-Trump judicial adviser has utilized nonprofit groups to collect more than $1 billion for conservative causes.  —  Washington D.C. Attorney General Brian Schwalb is investigating judicial activist Leonard Leo … ",
    "url": "https://www.politico.com/news/2023/08/22/d-c-attorney-general-is-probing-leonard-leos-network-00112331"
  },
  {
    "text": "A key witness in the Trump classified docs case changed his testimony after switching lawyers, special counsel says  —  The man identified as “Trump Employee 4” had been represented by Stanley Woodward, who was being paid by the former president's Save America PAC.",
    "url": "https://www.nbcnews.com/politics/donald-trump/witness-trump-docs-case-changed-testimony-switching-lawyers-special-co-rcna101308"
  },
  {
    "text": "Rudy Giuliani Set to Meet With Fani Willis in Georgia: Report  —  SO IT BEGINS...  Rudy Giuliani is expected to travel to Georgia on Wednesday to meet with Fulton County prosecutors—including District Attorney Fani Willis—according to CNN.  Giuliani, a former federal prosecutor himself … ",
    "url": "https://www.thedailybeast.com/rudy-giuliani-set-to-meet-with-fani-willis-in-georgia-report-says"
  },
  {
    "text": "Trump vows massive new tariffs if elected, risking global economic war  —  Former president floats 10 percent tax on all foreign imports and calls for ‘ring around the collar’ of U.S. economy  —  Even in the face of growing personal legal peril, Donald Trump summoned his top economic advisers … ",
    "url": "https://www.washingtonpost.com/business/2023/08/22/trump-trade-tariffs/"
  },
  {
    "text": "Audio: Vivek Ramaswamy Says He Wants ‘the Truth About 9/11’  —  This summer, I set out to write about Vivek Ramaswamy because I thought that his public-speaking skills set him apart from his GOP presidential rivals.  Whereas most candidates were struggling to find their lane … ",
    "url": "https://www.theatlantic.com/politics/archive/2023/08/vivek-ramaswamy-audio-recording/675076/"
  },
  {
    "text": "The Secret Weapon Hackers Can Use to Dox Nearly Anyone in America for $15  —  Most Americans have very little choice but to provide their personal information to credit bureaus.  Hackers have found a way into that data supply chain, and are advertising access in group chats used by violent criminals who rob, assault, and shoot targets.",
    "url": "https://www.404media.co/the-secret-weapon-hackers-can-use-to-dox-nearly-anyone-in-america-for-15-tlo-usinfosearch-transunion/"
  },
  {
    "text": "3 red states will elect governors this fall.  Could Democrats have a chance?  —  Voters in 3 states — Louisiana, Kentucky, and Mississippi — will head to the polls this year to elect or reelect their governors.  —  Each state leans Republican when voting for national politicians … ",
    "url": "https://www.npr.org/2023/08/23/1194067774/louisiana-mississippi-kentucky-governor-gubernatorial-election-campaign"
  },
  {
    "text": "Alaska Gov. Mike Dunleavy endorses Donald Trump  —  Most Republican governors have been hesitant to endorse in the presidential race.  —  Alaska Gov. Mike Dunleavy is endorsing Donald Trump, giving the former president the support of a governor whose state is expected to hold its nominating contest … ",
    "url": "https://www.politico.com/news/2023/08/22/alaska-gov-mike-dunleavy-endorses-donald-trump-00112332"
  },
  {
    "text": "McCarthy: House could launch impeachment inquiry ‘when we come back into session’  —  Speaker Kevin McCarthy (R-Calif.) warned Tuesday that the House could launch an impeachment inquiry as soon as September if the Biden administration doesn't turn over documents — including some that were apparently never requested by the GOP.",
    "url": "https://thehill.com/homenews/house/4165602-mccarthy-house-could-launch-impeachment-inquiry-when-we-come-back-into-session/"
  },
  {
    "text": "Cigar Magnate and Former Florida House Speaker Is New DeSantis Campaign Adviser and Surrogate  —  DeSantis worked closely with Jose Oliva when he first became Florida governor  —  A Facebook icon representing an external link to share the article on Facebook.A Twitter icon representing … ",
    "url": "https://themessenger.com/news/cigar-magnate-and-former-florida-house-speaker-is-new-desantis-campaign-adviser-and-spokesman"
  },
  {
    "text": "‘Cherry-picking’: Candidates lash out at RNC after not making debate stage  —  Perry Johnson said he planned to take legal action.  So did Larry Elder.  And Will Hurd said he thought the RNC cherry-picked polls.  —  The Republican National Committee announced late Monday night … ",
    "url": "https://www.politico.com/news/2023/08/22/republican-debate-2024-participants-00112282"
  },
  {
    "text": "Child killed, over 20 injured in Ohio bus crash on first day of elementary school  —  One of the 23 children injured suffered serious, life-threatening injuries in the Tuesday morning crash.  Their condition was not immediately clear as of early Wednesday morning.",
    "url": "https://www.nbcnews.com/news/us-news/ohio-school-bus-crash-elementary-school-rcna101344"
  },
  {
    "text": "Why do Republicans disproportionately believe health misinformation?  —  Rep. Marjorie Taylor Greene (R-Ga.) had only one comment to add when sharing a wildly conspiratorial article alleging that the recent surge in covid cases could be a way to force compliance with vaccination efforts … ",
    "url": "https://www.washingtonpost.com/politics/2023/08/22/republicans-vaccines-polls/"
  }
]