[
  {
    "text": "DOGE Plans to Rebuild SSA Codebase in Months, Risking Benefits and System Collapse  —  Social Security systems contain tens of millions of lines of code written in COBOL, an archaic programming language.  Safely rewriting that code would take years—DOGE wants it done in months.",
    "url": "https://www.wired.com/story/doge-rebuild-social-security-administration-cobol-benefits/"
  },
  {
    "text": "They Are Going to Take Everything If We Don't Stop Them  —  The worst thing that the federal government has done to labor unions in my lifetime happened last night.  Donald Trump signed an executive order saying that the government will no longer recognize and bargain with a huge portion of the unions that represent federal workers.",
    "url": "https://www.hamiltonnolan.com/p/they-are-going-to-take-everything"
  },
  {
    "text": "Trump moves to strip unionization rights from most federal workers  —  It's the latest effort in his drive to disempower the federal bureaucracy.  —  President Donald Trump is trying to revoke collective bargaining rights from most federal employees — the latest move in his aggressive campaign to weaken the federal workforce.",
    "url": "https://www.politico.com/news/2025/03/28/union-rights-federal-workers-donald-trump-00257010"
  },
  {
    "text": "Vance, citing threats from Russia and China, urges Greenland to ‘cut a deal’ with the U.S.  —  “When the president says 'We've got to have Greenland,' he's saying this island is not safe,” the vice president said.  —  Vice President JD Vance on Friday did not rule out using military action … ",
    "url": "https://www.politico.com/news/2025/03/28/vance-greenland-military-deal-00005407"
  },
  {
    "text": "Live updates: Trump reiterates desire to control Greenland as Vance visits the country  —  Get the latest news on President Donald Trump's return to the White House and the new Congress.",
    "url": "https://www.washingtonpost.com/politics/2025/03/28/trump-presidency-news/"
  },
  {
    "text": "Secretary of State Marco Rubio Remarks to the Press  —  SECRETARY RUBIO:  Grant?  —  QUESTION:  The Ukrainian children who —  SECRETARY RUBIO:  Oh, the data.  The data is secured.  We secured the data.  We'll transfer it to the appropriate party.  We've ensured that.",
    "url": "https://www.state.gov/secretary-of-state-marco-rubio-remarks-to-the-press-3/"
  },
  {
    "text": "The Biggest Scandal of the Second Trump Term Isn't “Signalgate”  —  On March 26, 2024, Rumeysa Ozturk, a Turkish Ph.D. student at Tufts University, co-authored an op-ed criticizing the university's response to student demands for divestment from Israel, which was published in its student newspaper.",
    "url": "https://newrepublic.com/article/193291/trump-disappearing-students-rumeysa-ozturk-rubio-biggest-scandal"
  },
  {
    "text": "'If We Don't Get Our S—t Together, Then We Are Going to Be in a Permanent Minority'  —  It's been months since Democrats suffered a devastating defeat at the polls.  For all the talk about the party's need for change, few seem actually willing to make the leap.",
    "url": "https://www.politico.com/news/magazine/2025/03/28/2024-election-democrats-kamala-harris-00230631"
  },
  {
    "text": "Another law firm targeted by Trump sues to block punishing executive order  —  Jenner & Block is the second law firm to try to fight Trump in court over his executive orders.  —  A law firm targeted by President Donald Trump sued Friday to bar enforcement of his executive order that seeks … ",
    "url": "https://www.politico.com/news/2025/03/28/jenner-block-eo-lawsuit-trump-00256160"
  },
  {
    "text": "Trump gets $100M deal with Skadden law firm amid pressure campaign  —  President Trump on Friday announced a deal with the law firm Skadden, Arps, Slate, Meagher & Flom to provide at least $100 million in pro bono legal services “during the Trump administration and beyond.”",
    "url": "https://thehill.com/homenews/administration/5220137-trump-skadden-100-million-pro-bono/"
  },
  {
    "text": "Trump Administration Live Updates: Major Law Firm Makes Deal to Avoid Punishing Order, President Says  —  Where Things Stand  — Law firm deal: President Trump announced that the major law firm of Skadden, Arps, Slate, Meagher & Flom had agreed to provide $100 million in pro bono work … ",
    "url": "https://www.nytimes.com/live/2025/03/28/us/trump-greenland-vance-news"
  },
  {
    "text": "Musk butts up against Wisconsin state law with (now deleted) $1 million check giveaway  —  Election law experts were skeptical about the billionaire's move.  —  Elon Musk will visit Wisconsin on Sunday ahead of the state's high-profile Supreme Court election.",
    "url": "https://www.politico.com/news/2025/03/28/elon-musk-wisconsin-supreme-court-giveaway-00257082"
  },
  {
    "text": "Musk deletes post promising he'd go to Wisconsin to deliver $2 million to Supreme Court race voters  —  Billionaire Elon Musk on Friday clarified his reasons for visiting Wisconsin two days ahead of its hotly contested Supreme Court election after deleting a social media post saying he planned to … ",
    "url": "https://apnews.com/article/wisconsin-supreme-court-elon-musk-trump-d75807980ac311b87606fb4ec58cc466"
  },
  {
    "text": "This Is Just Dumb  —  It's not the hypocrisy that bothers me; it's the stupidity.  We're all shocked — shocked! — that President Trump and his team don't actually care about protecting classified information or federal record retention laws.  But we knew that already.",
    "url": "https://www.nytimes.com/2025/03/28/opinion/trump-hegseth-signal-chat.html?unlocked_article_code=1.7U4.TdAd.85izsorPgz31&smid=tw-share"
  },
  {
    "text": "Trump pardons Nikola founder Trevor Milton in securities fraud case … President Donald Trump pardoned Nikola Corp. founder Trevor Milton for his October 2022 conviction of federal crimes related to defrauding investors with false claims about the success of the electric and hydrogen-powered truck maker.",
    "url": "https://www.cnbc.com/2025/03/28/trump-pardons-nikola-trevor-milton-ceo-securities-fraud-electric-vehicle.html"
  },
  {
    "text": "Trump pardons three co-founders of BitMEX crypto exchange … President Donald Trump has granted pardons to three co-founders of the BitMEX cryptocurrency exchange, CNBC has learned.  —  The co-founders, former CEO Arthur Hayes, Benjamin Delo and Samuel Reed, previously pled guilty to a range … ",
    "url": "https://www.cnbc.com/2025/03/28/trump-pardon-bitmex-crypto-exchange-money-laundering.html"
  },
  {
    "text": "Trump Warned U.S. Automakers Not to Raise Prices in Response to Tariffs  —  Threat came in a call earlier this month, in which carmakers feared punishment if prices go up  —  When President Trump convened CEOs of some of the country's top automakers for a call earlier this month … ",
    "url": "https://www.wsj.com/business/autos/trump-tariffs-automaker-prices-warning-928bc7a9?st=FbeQ4v&reflink=article_copyURL_share"
  },
  {
    "text": "Restoring Truth and Sanity to American History  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:  —  Section 1.  Purpose and Policy.  Over the past decade, Americans have witnessed a concerted … ",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/03/restoring-truth-and-sanity-to-american-history/"
  },
  {
    "text": "Officials say texts sent by Waltz, Ratcliffe in Signal chat may have damaged US' ongoing ability to gather intel on Houthis  —  Current and former US officials have told CNN they believe two texts sent by national security adviser Mike Waltz and CIA Director John Ratcliffe … ",
    "url": "https://cnn.com/2025/03/28/politics/waltz-ratcliffe-concerns-houthi-intelligence/"
  },
  {
    "text": "The Everything Scandal  —  Democrats have shown real signs of life since The Atlantic exposed the amateurish inner-workings of the Trump administration.  But in the interests of keeping them bucked up so they don't return to hibernation (and, frankly, in the interest of fueling distrust between … ",
    "url": "https://www.offmessage.net/p/the-everything-scandal"
  },
  {
    "text": "North Carolina judge challenging outcome of race wore Confederate uniform in college photo  —  A judge challenging the outcome of his North Carolina Supreme Court race was photographed wearing Confederate military garb and posing before a Confederate battle flag when he was a member … ",
    "url": "https://apnews.com/article/confederate-republican-civil-war-north-carolina-judge-kappa-alpha-c2db5051f3201219e753bdf4c89c49e4"
  },
  {
    "text": "Bannon: Trump ‘going to prison’ if Democrat wins White House in 2028  —  President Trump's former adviser Steve Bannon predicted Thursday that President Trump will go to prison if a Democrat wins back the White House in 2028.  —  “God forbid we don't win in '28, President Trump is going to prison … ",
    "url": "https://thehill.com/homenews/5219377-trump-bannon-prison-warning/"
  },
  {
    "text": "Dow sinks 600 points.  Stocks are on track for their worst quarter since 2023  —  New York CNN  —  US stocks were lower Friday as investors digested souring consumer sentiment and inflation data that showed an uptick in one of the Federal Reserve's key gauges, underscoring the delicate state … ",
    "url": "https://cnn.com/2025/03/28/investing/us-stocks-tariff-uncertainty-volatility"
  },
  {
    "text": "Texas Never Wanted RFK Jr.'s Unproven Measles Treatment  —  Kennedy made a show of shipping vitamin A to measles-stricken communities.  The state's public-health department didn't take up the offer.  —  Robert F. Kennedy Jr., staring down his first major health crisis as the head of Health and Human Services, had a plan.",
    "url": "https://www.theatlantic.com/health/archive/2025/03/texas-never-wanted-rfk-jrs-unproven-measles-treatment/682222/?gift=TGmfF3jF0Ivzok_5xSjbx764WLmQqjDv8y7mQo7Gdfc&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Attorney General Pamela Bondi Launches Compliance Review Investigation into Admissions Policies at Stanford University and Several University of California Schools, Advancing President Trump's Mandate to End Illegal DEI Policies  —  For Immediate Release  —  Today, Attorney General Pamela Bondi directed … ",
    "url": "https://www.justice.gov/opa/pr/attorney-general-pamela-bondi-launches-compliance-review-investigation-admissions-policies"
  },
  {
    "text": "Trump threatens Iran with “bad things” unless it accepts nuclear deal  —  “Bad things” will happen to Iran unless it reaches a deal with the U.S. on its nuclear program, President Trump said Friday.  —  Why it matters: Trump's comments came after Iran responded to the letter the president sent … ",
    "url": "https://www.axios.com/2025/03/28/trump-iran-nuclear-weapons-deal-letter"
  },
  {
    "text": "U.S. Judge Orders Halt to Trump's Effort to Dismantle Voice of America  —  Voice of America journalists had argued in a lawsuit that the administration's actions violated their First Amendment rights.  —  A federal judge on Friday temporarily halted the Trump administration's efforts … ",
    "url": "https://www.nytimes.com/2025/03/28/business/media/voice-of-america-lawsuit-trump.html"
  },
  {
    "text": "Prime Minister Carney speaks with President of the United States Donald J. Trump  — Prime Minister Carney speaks with President of the United States Donald J. Trump  —  Today, the Prime Minister, Mark Carney, spoke with the President of the United States, Donald J. Trump.",
    "url": "https://www.pm.gc.ca/en/news/readouts/2025/03/28/prime-minister-carney-speaks-president-united-states-donald-j-trump"
  },
  {
    "text": "March 27, 2025  —  Today, Wired reported that it had found four more Venmo accounts associated with the Trump administration officials who participated in the now-infamous Signal chat about a planned military attack on the Houthis in Yemen.  A payment on one of them was identified … ",
    "url": "https://heathercoxrichardson.substack.com/p/march-27-2025"
  },
  {
    "text": "Strong earthquake strikes central Myanmar, panic in Bangkok  —  A powerful earthquake killed more than 140 people in Myanmar on Friday, authorities said, toppling buildings and wrecking infrastructure across a wide area, including a skyscraper under construction in neighbouring Thailand.",
    "url": "https://www.reuters.com/world/asia-pacific/strong-earthquake-central-myanmar-panic-bangkok-2025-03-28/"
  },
  {
    "text": "Secretary of Defense Pete Hegseth's ‘kafir’ tattoo draws criticism.  What does it mean?  —  Hegseth has previously attracted attention over his many tattoos.  This time, new photos show that he has the word ‘kafir’ on his upper arm.  What does that mean and what do critics say it's indicating?",
    "url": "https://www.usatoday.com/story/news/politics/2025/03/27/pete-hegseth-tattoo-kafir/82696572007/"
  },
  {
    "text": "Trump administration ‘proposing a silly new bureaucracy’: Former HHS secretary  —  Former Health and Human Services (HHS) Secretary Donna Shalala criticized the Trump administration's efforts to cut back the department she once led, calling it an insult that puts Americans' health at risk.",
    "url": "https://thehill.com/homenews/5219799-trump-hhs-cuts-donna-shalala/"
  }
]