[
  {
    "text": "The Most Unsettling Presidential Debate Spectacle Ever  —  A lot of things happened.  Here are some of the things.  This is TPM's Morning Memo.  Sign up for the email version.  —  What WAS That?  —  When one of America's two major political parties has become a cult of personality … ",
    "url": "https://talkingpointsmemo.com/morning-memo/gop-presidential-debate-surreal-spectacle"
  },
  {
    "text": "Nikki Haley Is the Best Trump Alternative  —  I have a bunch of friends and acquaintances who are Never Trump, maybe-Trump or kind-of-Trump Republicans.  They've been looking around for the candidate they can support and give their dollars to, somebody who is an antidote to Donald Trump and who can win a general election.",
    "url": "https://www.nytimes.com/2023/08/24/opinion/nikki-haley-republican-debate-winner.html"
  },
  {
    "text": "A Very Good Republican Presidential Debate  —  Without Trump, the candidates could fight about their policies.  —  Donald Trump ducked the first Republican presidential debate Wednesday night, and his absence did the party and country a favor.  Voters were able to hear eight other candidates … ",
    "url": "https://www.wsj.com/articles/gop-presidential-debate-republicans-donald-trump-ron-desantis-chris-christie-nikki-haley-a24af59d?mod=djemalertNEWS"
  },
  {
    "text": "The winners and losers from the first Republican debate  —  Eight Republican presidential candidates who sought some kind of traction against former president Donald Trump faced off Wednesday night at the first debate of the 2024 GOP primary race in Milwaukee.  Trump was absent.",
    "url": "https://www.washingtonpost.com/politics/2023/08/23/who-won-republican-debate/"
  },
  {
    "text": "US intelligence assessment shows intentionally caused explosion crashed Wagner chief's plane  —  A preliminary U.S. intelligence assessment has found that the plane crash presumed to have killed Wagner leader Yevgeny Prigozhin was intentionally caused by an explosion, according to U.S. and Western officials.",
    "url": "https://apnews.com/article/russia-wagner-prigozhin-jet-crash-382515214f691e47daa2e3635d64e612"
  },
  {
    "text": "Early Intelligence Suggests Prigozhin Was Assassinated, U.S. Officials Say  —  Preliminary findings indicate it wasn't surface-to-air missile that took down Wagner leader's plane  —  The plane carrying Yevgeny Prigozhin, the head of the Wagner paramilitary group, crashed as the result … ",
    "url": "https://www.wsj.com/world/russia/wagner-prigozhin-russia-assassinated-intelligence-3e456fab?mod=djemalertNEWS"
  },
  {
    "text": "Exclusive: US believes missile inside Russia likely shot down Prigozhin's presumed plane, US officials say  —  The United States believes a surface-to-air missile originating from inside Russia likely shot down the plane presumed to be carrying mercenary leader Yevgeny Prigozhin on Wednesday, two U.S. officials told Reuters on Thursday.",
    "url": "https://www.reuters.com/world/europe/us-believes-missile-inside-russia-likely-shot-down-prigozhins-presumed-plane-us-2023-08-24/"
  },
  {
    "text": "Prigozhin was likely killed in plane crash: Pentagon  —  Wagner Group founder Yevgeny Prigozhin was likely killed in the plane that crashed Wednesday about 100 miles from Moscow, the Pentagon said Thursday.  —  Pentagon press secretary Brig. Gen. Pat Ryder said the U.S. believes that Prigozhin died … ",
    "url": "https://thehill.com/policy/defense/4169773-prigozhin-was-likely-killed-in-plane-crash-pentagon/"
  },
  {
    "text": "Mark Meadows Surrenders to Jail After His Last-Minute Plea Fails  —  His bond was set at $100,000.  —  Mark Meadows, Donald Trump's former chief of staff, surrendered to authorities in Georgia on Thursday on allegations he—along with the former president and 17 others—schemed to keep Trump in power after losing the 2020 election.",
    "url": "https://www.thedailybeast.com/ex-trump-chief-of-staff-mark-meadows-surrenders-to-jail-in-georgia"
  },
  {
    "text": "Trump to be arrested in Georgia after last week's indictment: Live updates  — Former President Donald Trump is expected to surrender today at the Fulton County Jail on felony charges in connection with efforts to overturn the 2020 presidential election results in Georgia.",
    "url": "https://www.nbcnews.com/politics/donald-trump/live-blog/trump-arraignment-georgia-indictment-live-updates-rcna100652#rcrd17834"
  },
  {
    "text": "Trump replaces top Georgia lawyer ahead of surrender  —  Former President Donald Trump has replaced his top Georgia lawyer ahead of his surrender Thursday evening, sources tell CNN.  —  Drew Findling, the lawyer who has led Trump's defense in Georgia, is being replaced by Steven Sadow … ",
    "url": "https://www.cnn.com/2023/08/24/politics/trump-georgia-lawyer/"
  },
  {
    "text": "Jim Jordan launches probe into Georgia Trump prosecution  —  House Judiciary Chairman Jim Jordan (R-Ohio) fired off a sweeping request for documents dealing with former President Trump's prosecution for election interference in Georgia, asking Fulton County District Attorney Fani Willis (D) to turn over all records relating to the case.",
    "url": "https://thehill.com/regulation/court-battles/4169099-jim-jordan-launches-probe-into-georgia-trump-prosecution/"
  },
  {
    "text": "Judge schedules Trump codefendant Ken Chesebro for October trial in racketeering case  —  A trial just two months from now seems implausible given the torrent of anticipated pretrial motions and complex legal issues likely to be litigated before a jury can be seated.",
    "url": "https://www.politico.com/news/2023/08/24/fulton-county-prosecutors-ask-judge-to-set-oct-23-trial-on-trump-racketeering-charges-00112816"
  },
  {
    "text": "The First Republican Presidential Debate Was Rife With Abortion Misinformation  —  “Abortions on demand,” “born alive abortions” and other fact-free claims were on display at the first GOP debate.  —  LOADING  —  The first Republican presidential debate included a lot of fake news about abortion.",
    "url": "https://www.huffpost.com/entry/republican-presidential-debate-abortion-misinformation_n_64e6c58ee4b0306c321b6c5e"
  },
  {
    "text": "Justice Department Sues SpaceX for Discriminating Against Asylees and Refugees in Hiring  —  For Immediate Release  —  Asylees and Refugees With Relevant Information Should Contact the Justice Department  —  The Justice Department filed a lawsuit today against Space Exploration Technologies Corporation … ",
    "url": "https://www.justice.gov/opa/pr/justice-department-sues-spacex-discriminating-against-asylees-and-refugees-hiring"
  },
  {
    "text": "RSVP: … About the Stamp  —  The Ruth Bader Ginsburg stamp features an oil painting of her in her black judicial robe and iconic white collar.  The stamp captures her enduring spirit and tireless dedication to upholding the principles of the Constitution.",
    "url": "https://about.usps.com/newsroom/national-releases/2023/0824ma-usps-to-unveil-stamp-honoring-ruth-bader-ginsburg.htm"
  },
  {
    "text": "Some emperor penguin sites experienced ‘total breeding failure’ because of sea ice loss  —  Using satellite images, scientists at the British Antarctic Survey found that sea ice in 2022 broke up long before penguin chicks would have developed their waterproof feathers, making it unlikely they could survive.",
    "url": "https://www.nbcnews.com/science/environment/emperor-penguin-sites-experienced-total-breeding-failure-sea-ice-loss-rcna101011"
  },
  {
    "text": "Chaos Erupts When Republican Candidates Are Asked if They Believe in Climate Change  —  There is no scientific dispute on the question, but almost none of the Republican presidential candidates gave a straight answer.  —  It was an unusual litmus test for a Republican primary debate … ",
    "url": "https://www.nytimes.com/2023/08/23/us/republican-debate-climate-change.html"
  }
]