[
  {
    "text": "Deputy FBI Director Bongino has told people he is considering resigning amid Epstein files fallout  —  Deputy FBI Director Dan Bongino has told people he is considering resigning amid a major clash between the FBI and Justice Department over the continued fallout from the release of the Jeffrey Epstein memo … ",
    "url": "https://cnn.com/2025/07/11/politics/bongino-consider-resigning-epstein-files"
  },
  {
    "text": "Scoop: FBI's Dan Bongino clashes with AG Bondi over handling of Epstein files  —  FBI deputy director Dan Bongino took a day off from work Friday after clashing at the White House with Attorney General Pam Bondi over their handling of the Jeffrey Epstein files, four sources familiar with the conflict told Axios.",
    "url": "https://www.axios.com/2025/07/11/epstein-files-dan-bongino-pam-bondi-trump"
  },
  {
    "text": "Farmworker dies from injuries during immigration raid in Ventura County, union says  —  Este artículo se ofrece en Español  —  A farmworker has died after suffering injuries during an immigration raid at an agricultural area near Camarillo on Thursday, according to a family member.",
    "url": "https://abc7.com/post/man-life-support-injury-during-ventura-county-immigration-raid-family-says/17070197/"
  },
  {
    "text": "Undocumented minors found in raid of California cannabis farm, DHS says  —  (KTLA) — Federal immigration agents, assisted by members of the National Guard, carried out raids at two Southern California cannabis farms Thursday, arresting dozens, including undocumented minors … ",
    "url": "https://thehill.com/homenews/state-watch/5396741-dhs-california-cannabis-farm-trum-immigration-raid/"
  },
  {
    "text": "Metadata Shows the FBI's ‘Raw’ Jeffrey Epstein Prison Video Was Likely Modified  —  There is no evidence the footage was deceptively manipulated, but ambiguities around how the video was processed may further fuel conspiracy theories about Epstein's death.  —  The United States Department … ",
    "url": "https://www.wired.com/story/metadata-shows-the-dojs-raw-jeffrey-epstein-prison-video-was-likely-modified/"
  },
  {
    "text": "David Gergen, political insider who advised four presidents of both parties, dies at 83  —  David Gergen, who served as a presidential adviser to four presidents of both parties and educated generations of Americans about leadership and civic engagement, has died.  He was 83.",
    "url": "https://cnn.com/2025/07/11/politics/david-gergen-dead"
  },
  {
    "text": "David Gergen, Adviser to Presidents and Political Commentator, Dies at 83  —  He served under Nixon, Ford, Reagan and Clinton before becoming a top editor and a familiar TV pundit.  “Centrism doesn't mean splitting the difference,” he said.  —  David Gergen, an inside-the-Beltway veteran … ",
    "url": "https://www.nytimes.com/2025/07/11/us/politics/david-gergen-dead.html?unlocked_article_code=1.Vk8.00KC.n-q5BvHzfrhM&smid=url-share"
  },
  {
    "text": "Surge in U.S. Concern About Immigration Has Abated  —  WASHINGTON, D.C. — Americans have grown markedly more positive toward immigration over the past year, with the share wanting immigration reduced dropping from 55% in 2024 to 30% today.  At the same time, a record-high 79% of U.S. adults … ",
    "url": "https://news.gallup.com/poll/692522/surge-concern-immigration-abated.aspx"
  },
  {
    "text": "FEMA Didn't Answer Thousands of Calls From Flood Survivors, Documents Show  —  Two days after deadly Texas floods, the agency struggled to answer calls from survivors because of call center contracts that weren't extended.  —  Two days after catastrophic floods roared through Central Texas … ",
    "url": "https://www.nytimes.com/2025/07/11/climate/fema-missed-calls-texas-floods.html?unlocked_article_code=1.Vk8.HZRd.zn6zK44YkS7l&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Skydance Is in Early Talks to Acquire The Free Press  —  David Ellison, the founder of Skydance, and Bari Weiss, the co-founder of The Free Press, are attending the annual Allen & Co. conference in Sun Valley this week.  —  David Ellison, the chief executive of the media company Skydance … ",
    "url": "https://www.nytimes.com/2025/07/11/business/free-press-skydance-acquisition-talks.html?unlocked_article_code=1.Vk8.m5g6.IJC2jLmbvLKm&smid=bs-share"
  },
  {
    "text": "Emil Bove declines to rule out 3rd Trump term or denounce Jan. 6 rioters in Senate questionnaire  —  Washington — Emil Bove, a top Justice Department official who previously served as President Trump's criminal defense attorney, declined to rule out the possibility of the president running … ",
    "url": "https://www.cbsnews.com/news/emil-bove-senate-questionnaire-trump-third-term-january-6/"
  },
  {
    "text": "Trump tours devastation in Texas, meeting with families and first responders  —  Trump and first lady Melania Trump spoke about how difficult it was to find the right words for grieving parents, as they fulfilled a unifying public ritual for commanders in chief.  —  Summary0",
    "url": "https://www.washingtonpost.com/politics/2025/07/11/trump-texas-flooding-camp-mystic-visit/"
  },
  {
    "text": "Shunned Myanmar leader thrilled at US contact after Trump tariff letter  —  Min Aung Hlaing expresses ‘sincere appreciation’ for letter from US president threatening 40% tariff  —  Myanmar's military leader has praised Donald Trump and asked him to lift sanctions, as the junta sought … ",
    "url": "https://www.theguardian.com/world/2025/jul/11/myanmar-military-leader-min-aung-hlaing-praises-donald-trump"
  },
  {
    "text": "L.A. will provide cash assistance to immigrants affected by raids  —  Mayor Karen Bass announced a plan Friday to provide direct cash assistance to people who have been affected by the Trump administration's sweeping immigration raids.  —  The aid will be distributed using cash cards with a … ",
    "url": "https://www.latimes.com/california/story/2025-07-11/l-a-will-provide-cash-assistance-to-immigrants"
  },
  {
    "text": "Miami archbishop slams Everglades immigrant detention site as ‘unbecoming’ and ‘corrosive’  —  Archbishop Thomas Wenski criticized the remote location of the detention site called “Alligator Alcatraz” and the rhetoric surrounding it.  —  The Archdiocese of Miami is condemning … ",
    "url": "https://www.nbcnews.com/news/latino/miami-archbishop-slams-alligator-alcatraz-detention-site-rcna218245"
  },
  {
    "text": "Behind Trump's Decision to Tax Brazil to Save Bolsonaro  —  Right-wing Brazilians wanted sanctions against the judge prosecuting Brazil's former president.  President Trump opted for something far bigger — tariffs.  —  Since March, the son of the former Brazilian president Jair Bolsonaro … ",
    "url": "https://www.nytimes.com/2025/07/11/world/americas/brazil-trump-tariffs.html"
  },
  {
    "text": "Kerr County did not use its most far-reaching alert system in deadly Texas floods  —  Local officials used the system more than two days after the recorded height of the floods.  —  Summary684  —  The Texas county where nearly 100 people were killed and more than 160 remain missing … ",
    "url": "https://www.washingtonpost.com/investigations/2025/07/11/texas-flooding-alerts-kerr-county-emergency/"
  },
  {
    "text": "State Department lays off over 1,300 employees under Trump administration plan  —  The U.S. State Department fired more than 1,300 employees on Friday in line with a dramatic reorganization plan from the Trump administration that critics say will damage America's global leadership and efforts to counter threats abroad.",
    "url": "https://apnews.com/article/layoffs-diplomats-state-department-trump-rubio-bfdb86767b7bd5b6570819d404a7782e"
  },
  {
    "text": "Jamie Dimon on Democratic friends: ‘Big hearts and little brains’  —  JPMorgan Chase CEO Jamie Dimon on Thursday knocked Democrats for pushing diversity, equity and inclusion (DEI) policies instead of “real world” solutions.  —  “I have a lot of friends who are Democrats, and they're idiots … ",
    "url": "https://thehill.com/business/5397343-dimon-criticizes-democrats-dei-practices/"
  },
  {
    "text": "George Mason Is the Latest University Under Fire From Trump.  Its President Fears an “Orchestrated” Campaign.  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up to receive our biggest stories as soon as they're published.  —  When the Education Department's Office … ",
    "url": "https://www.propublica.org/article/george-mason-university-antisemitism-investigation-trump"
  },
  {
    "text": "AFSA Strongly Opposes State Department Reductions in Force  —  Washington, D.C. - At a moment of great global instability—with war raging in Ukraine, conflict between Israel and Iran, and authoritarian regimes testing the boundaries of international order—the United States has chosen to gut its frontline diplomatic workforce.",
    "url": "https://afsa.org/afsa-strongly-opposes-state-department-reductions-force"
  },
  {
    "text": "Trump administration sues California over egg prices and blames animal welfare laws  —  The Trump administration is suing the state of California to block animal welfare laws that it says unconstitutionally helped send egg prices soaring.  But a group that spearheaded the requirements pushed back … ",
    "url": "https://apnews.com/article/egg-prices-california-animal-welfare-trump-48296b0149580e5620d6bcdcdcce89d7"
  },
  {
    "text": "Justice Department Files Statement of Interest on Suppression of Competition in the Marketplace of Ideas Through Deplatforming of Rival Viewpoints  —  For Immediate Release  —  Today, the Justice Department filed a statement of interest in the United States District Court for the District … ",
    "url": "https://www.justice.gov/opa/pr/justice-department-files-statement-interest-suppression-competition-marketplace-ideas"
  },
  {
    "text": "How Netanyahu Prolonged the War in Gaza to Stay in Power  —  When Hamas raided Israel in 2023, setting off the Gaza war, Benjamin Netanyahu seemed set to lose power once the war ended.  Two years on, the war is still going.  Netanyahu still leads Israel.  Many Israelis ask: Did he prolong the war to stay in power?",
    "url": "https://www.nytimes.com/2025/07/11/magazine/benjamin-netanyahu-gaza-war.html?unlocked_article_code=1.Vk8.khSS.frmunMArZFM1&smid=url-share"
  }
]