[
  {
    "text": "Convicted US Capitol rioter turns down Trump pardon  —  One of the people who served jail time for taking part in the US Capitol riot four years ago has refused a pardon from President Donald Trump, saying: “We were wrong that day.”  —  Pamela Hemphill, who pleaded guilty and was sentenced … ",
    "url": "https://www.bbc.com/news/articles/cvged988377o"
  },
  {
    "text": "“F—k it: Release 'em all”: Why Trump embraced broad Jan. 6 pardons … - Trump vacillated during an internal debate over targeted clemency vs. a blanket decision according to two insiders.  — But as Trump's team wrestled with the issue, and planned a shock-and-awe batch of executive orders Day 1 … ",
    "url": "https://www.axios.com/2025/01/22/trump-pardons-jan6-clemency"
  },
  {
    "text": "Police union that endorsed Trump blasts Jan. 6 pardons … - “Allowing those convicted of these crimes to be released early diminishes accountability and devalues the sacrifices made by courageous law enforcement officers and their families,” per the statement.",
    "url": "https://www.axios.com/2025/01/22/police-union-trump-jan-6-pardons"
  },
  {
    "text": "Trump May Come to Regret His Jan. 6 Pardons.  Here's Why.  —  The potential for political backlash is real — now and in the future.  —  Even though President Donald Trump had vowed to deliver pardons to those who participated in the Jan. 6, 2021, siege of the Capitol, his sweeping clemency for roughly 1,500 people was stunning.",
    "url": "https://www.politico.com/news/magazine/2025/01/22/trump-jan-6-pardons-regrets-00199743"
  },
  {
    "text": "Trump Pardons the Jan. 6 Cop Beaters  —  Law and order?  Back the blue?  What happened to that GOP?  —  Republicans are busy denouncing President Biden's pre-emptive pardons for his family and political allies, and deservedly so.  But then it's a shame you don't hear many, if any … ",
    "url": "https://www.wsj.com/opinion/donald-trump-pardons-jan-6-capitol-rioters-police-gop-258a4a6e?st=hi9PtA&reflink=mobilewebshare_permalink"
  },
  {
    "text": "Trump launches savage attack on bishop who asked for ‘mercy’ for minorities  —  U.S. president calls the clergywoman a “Radical Left hard line Trump hater,” “ungracious,” “nasty” and “not compelling or smart.”  —  U.S. President Donald Trump hit out Wednesday at a bishop who directly called … ",
    "url": "https://www.politico.eu/article/donld-trump-launches-savage-attack-on-bishop-mariann-budde-who-asked-for-mercy-for-minorities-lgbtq-immigrants/"
  },
  {
    "text": "Justice Department directs prosecutors to probe local efforts to obstruct immigration enforcement  —  The Justice Department is directing its federal prosecutors to investigate any state or local officials who stand in the way of beefed-up enforcement of immigration laws under the Trump administration … ",
    "url": "https://apnews.com/article/justice-department-immigration-enforcement-f0e3fc616da9746796378d1cd6385b1b"
  },
  {
    "text": "Trump demands apology, criticizes bishop's prayer service remarks  —  President Trump early Wednesday morning slammed the reverend at a National Cathedral prayer service for the inauguration who called on him to have mercy on transgender children and immigrant families.",
    "url": "https://thehill.com/homenews/administration/5099730-donald-trump-criticizes-bishop-transgender-migrants/"
  },
  {
    "text": "Donald Trump Demands Apology From Bishop Who Hurt His Feelings  —  Right Rev. Mariann Budde had appealed to Trump to have mercy and compassion during an interfaith service.",
    "url": "https://www.thedailybeast.com/donald-trump-demands-apology-from-bishop-mariann-budde-after-she-hurt-his-feelings/"
  },
  {
    "text": "Trump threatens Russia, others with sanctions if Ukraine deal not reached  —  U.S. President Donald Trump on Wednesday threatened Russia “and other participating countries” with taxes, tariffs and sanctions if a deal to end the war in Ukraine is not struck soon.",
    "url": "https://www.reuters.com/world/trump-threatens-russia-others-with-sanctions-if-ukraine-deal-not-reached-2025-01-22/"
  },
  {
    "text": "Republican Senators Seem Willing to Endure the ‘Challenge’ of Trump's Proposed Tariffs  —  Trump suggested Monday he'd put 25% tariffs on goods from Canada and Mexico, two of the U.S's top trading partners.  — Copy  —  President Donald Trump is getting closer to blowing up the trade agreement … ",
    "url": "https://www.notus.org/policy/trump-trade-canada-mexico-tariffs"
  },
  {
    "text": "Trump administration directs all federal diversity, equity and inclusion staff be put on leave  —  President Donald Trump 's administration moved Tuesday to end affirmative action in federal contracting and directed that all federal diversity, equity and inclusion staff be put on paid leave and eventually be laid off.",
    "url": "https://apnews.com/article/dei-trump-executive-order-diversity-834a241a60ee92722ef2443b62572540"
  },
  {
    "text": "Ending Illegal Discrimination And Restoring Merit-Based Opportunity  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:  —  Section 1.  Purpose.  Longstanding Federal civil-rights laws protect individual Americans … ",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/01/ending-illegal-discrimination-and-restoring-merit-based-opportunity/"
  },
  {
    "text": "Elon Musk's salute falls flat: Why far-right trolling isn't working this time around  —  As Alexandria Ocasio-Cortez said to defenders of Musk's provocation, “People can officially stop listening to you”  —  One thing that's easy enough to see about Elon Musk's infamous hand gesture … ",
    "url": "https://www.salon.com/2025/01/22/elon-musks-salute-falls-flat-why-far-right-trolling-isnt-working-this-time/"
  },
  {
    "text": "US military ordering thousands more troops to southern border  —  Thousands of additional active duty US troops are being ordered to the southern US border with Mexico, just two days after President Donald Trump mandated that the US military step up its presence there, according to officials familiar with the matter.",
    "url": "https://www.cnn.com/2025/01/22/politics/us-military-troops-southern-border/"
  },
  {
    "text": "Trump officials pause health agencies' communications, citing review  —  The agencies are charged with making decisions that touch the lives of every American and are the source of crucial information to health-care providers.  —  The Trump administration has instructed federal health agencies … ",
    "url": "https://www.washingtonpost.com/health/2025/01/21/trump-hhs-cdc-fda-communication-pause/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM3NDM1NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM4ODE3OTk5LCJpYXQiOjE3Mzc0MzU2MDAsImp0aSI6ImEzODFhN2UxLTRhOGUtNGFjOS1hNGRmLTEyNDk5ZWIzNGFiOSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9oZWFsdGgvMjAyNS8wMS8yMS90cnVtcC1oaHMtY2RjLWZkYS1jb21tdW5pY2F0aW9uLXBhdXNlLyJ9.cY26hIDkmu_AWumnD7uJ1Ge-rGGy5hoacMYbVpbSyJM&itid=gfta"
  },
  {
    "text": "Trump pardons Ross Ulbricht, creator of the Silk Road dark web marketplace  —  President Trump fulfilled a campaign promise to Libertarian supporters on his second day back in office by pardoning the former creator and owner of an underground e-commerce website known for drug trafficking.",
    "url": "https://www.npr.org/2025/01/21/nx-s1-5270051/trump-pardons-dark-web-marketplace-creator-ross-ulbricht"
  },
  {
    "text": "LSU law professor removed from classes amid investigation into alleged political comments  —  A car passes in front of the LSU Law Center on Monday, March 20, 2023, on Highland Road in Baton Rouge, La. (Matthew Perschall for Louisiana Illuminator)  —  An LSU law school professor has been removed … ",
    "url": "https://lailluminator.com/2025/01/21/lsu-law-professor-reportedly-removed-from-classes-amid-investigation-into-political-comments/"
  },
  {
    "text": "Trump administration fires members of cybersecurity review board in “horribly shortsighted” decision  —  On Tuesday, a day after Donald Trump's inauguration as the new U.S. president, the Department of Homeland Security told members of several advisory committees that they were effectively fired.",
    "url": "https://techcrunch.com/2025/01/22/trump-administration-fires-members-of-cybersecurity-review-board-in-horribly-shortsighted-decision/"
  },
  {
    "text": "Jamie Dimon says Trump's tariff policy is positive for national security so people should ‘get over it’ … WATCH NOW  —  JPMorgan Chase CEO Jamie Dimon said Wednesday that the looming tariffs that President Donald Trump is expected to slap on U.S. trading partners could be viewed positively.",
    "url": "https://www.cnbc.com/2025/01/22/jamie-dimon-on-trumps-tariffs-get-over-it.html"
  }
]