[
  {
    "text": "Trump delivers profanity, below-the-belt digs at Catholic charity banquet  —  The only person off limits for Trump's roast was himself.  —  NEW YORK — Republican presidential nominee Donald Trump used his remarks at a Catholic charity banquet here on Thursday to skewer prominent Democrats, often in off-color terms.",
    "url": "https://www.washingtonpost.com/politics/2024/10/17/trump-harris-al-smith-dinner/"
  },
  {
    "text": "Scoop: Former GOP Rep. Charlie Dent voted for Kamala Harris … - Some are going as far as to actively campaign for Harris, with former Reps. Adam Kinzinger (R-Ill.) and Barbara Comstock (R-Va.) appearing with the vice president at a rally in the key battleground of Pennsylvania on Wednesday.",
    "url": "https://www.axios.com/2024/10/17/charlie-dent-2024-republicans-trump-harris"
  },
  {
    "text": "Critics Slam Al Smith Charity Dinner For Normalizing ‘Deranged Madman’ Donald Trump  —  Critics didn't find the former president's attendance at the white-tie event funny, with emcee Jim Gaffigan drawing ire too.  —  LOADING  —  Critics condemned the appearance of Donald Trump … ",
    "url": "https://www.huffpost.com/entry/donald-trump-al-smith-dinner-slammed_n_6711fdc4e4b069ea0f05fe71"
  },
  {
    "text": "Trump World in Talks With Haley for Eleventh-Hour Joint Campaign Event  —  DONALD TRUMP'S ONETIME U.N. ambassador and former primary rival, Nikki Haley, is in talks to join him on the campaign trail in an attempt to win over disaffected Republicans, sources familiar with the discussions tell The Bulwark.",
    "url": "https://www.thebulwark.com/p/trump-world-in-talks-with-haley-for"
  },
  {
    "text": "Even Fox News's Bret Baier Admits Harris Outsmarted Him in Interview  —  Fox News's Brett Baier went on the offensive during an interview with Kamala Harris Wednesday night, but even he had to admit she got the best of him.  —  In a segment reacting to his own contentious interview … ",
    "url": "https://newrepublic.com/post/187245/kamala-harris-fox-news-bret-baier-roasted-interview"
  },
  {
    "text": "Statement from President Joe Biden on the Death of Yahya Sinwar  —  Early this morning, Israeli authorities informed my national security team that a mission they conducted in Gaza likely killed Hamas leader Yahya Sinwar.  DNA tests have now confirmed that Sinwar is dead.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/10/17/statement-from-president-joe-biden-on-the-death-of-yahya-sinwar/"
  },
  {
    "text": "Biden tells Netanyahu it's time to end Gaza war after Sinwar's elimination … - Israeli and U.S. officials say Sinwar's death on Wednesday creates an opportunity to resume talks on a deal to release the 101 hostages still held by Hamas and establish a ceasefire in Gaza.",
    "url": "https://www.axios.com/2024/10/17/biden-netanyahu-sinwar-gaza-war"
  },
  {
    "text": "Biden tells Obama 'she's not as strong as me' — and ex-prez agrees 'that's true' at Ethel Kennedy service  —  WASHINGTON — President Biden griped to former President Barack Obama that “she” is “not as strong as me” — with Obama agreeing “that's true” — in a stunning off-mic conversation deciphered … ",
    "url": "https://nypost.com/2024/10/17/us-news/biden-told-obama-shes-not-as-strong-as-me-and-ex-prez-agreed-thats-true-at-ethel-kennedy-funeral/"
  },
  {
    "text": "Harris Will Campaign With the Obamas Next Week  —  Barack and Michelle Obama will make their first campaign appearances alongside Kamala Harris at rallies in Georgia and Michigan.  —  Here come the Obamas.  —  Former President Barack Obama and Michelle Obama, the former first lady … ",
    "url": "https://www.nytimes.com/2024/10/18/us/politics/kamala-harris-michelle-obama-barack-obama.html"
  },
  {
    "text": "JD Vance Campaign Event With Christian Right Leaders May Have Violated Tax and Election Laws, Experts Say  —  Ziklag and the Courage Tour, the far-right groups that hosted the Republican vice-presidential nominee, are charities that can't legally intervene in political campaigns.  —  Co-published with Documented",
    "url": "https://www.propublica.org/article/vance-ziklag-courage-tour-christian-right-tax-election-laws"
  },
  {
    "text": "Trump Is Speaking Like Hitler, Stalin, and Mussolini  —  To support The Atlantic's journalism, please consider subscribing today.  —  Rhetoric has a history.  The words democracy and tyranny were debated in ancient Greece; the phrase separation of powers became important in the 17th and 18th centuries.",
    "url": "https://www.theatlantic.com/politics/archive/2024/10/trump-authoritarian-rhetoric-hitler-mussolini/680296/?gift=hVZeG3M9DnxL4CekrWGK34vU4G4QMrQTKJxena1OKFY&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Trump has vowed to gut climate rules.  Oil lobbyists have a plan ready.  —  As companies fall short on methane emission reductions, a top trade group has crafted a road map for dismantling key Biden administration rules.  —  An influential oil and gas industry group whose members … ",
    "url": "https://www.washingtonpost.com/business/2024/10/17/oil-industry-trump-climate-lobbying/"
  },
  {
    "text": "When the Top General in the U.S. Says You're ‘Fascist to the Core’  —  Toward the end of his tenure, Gen. Mark Milley, who was the chairman of the Joint Chiefs of Staff from 2019 to 2023, told Bob Woodward of The Washington Post that Donald Trump was a fundamental threat to the safety and integrity of the United States.",
    "url": "https://www.nytimes.com/2024/10/18/opinion/trump-woodward-milley-mass-deportation.html?unlocked_article_code=1.TE4.aEQr.bu63SohLeWP4&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Majority of Americans Feel Worse Off Than Four Years Ago  —  Economic Confidence Index remains negative at -26  —  WASHINGTON, D.C. — More than half of Americans (52%) say they and their family are worse off today than they were four years ago, while 39% say they are better off and 8% volunteer that they are about the same.",
    "url": "https://news.gallup.com/poll/652250/majority-americans-feel-worse-off-four-years-ago.aspx"
  },
  {
    "text": "Harris Blankets Airwaves, Trump Bets on Pennsylvania in Final Stretch  —  The Democratic nominee is trying to defend the Blue Wall and remain competitive in the Sun Belt, while Trump battles for electoral vote-rich Pennsylvania. … Despite an election defined by surprises … ",
    "url": "https://www.bloomberg.com/news/articles/2024-10-18/harris-blankets-airwaves-trump-bets-on-pennsylvania-in-final-stretch"
  },
  {
    "text": "META/Facebook Engineer Admits That Company Is Rigging the Election  —  James O'Keefe strikes again.  —  At this rate, lefties are going to quit dating people since the technique he uses is the “honeypot” in which people open up on what they assume are legitimate dates.",
    "url": "https://hotair.com/david-strom/2024/10/17/metafacebook-engineer-admits-that-company-is-rigging-the-election-n3795933"
  },
  {
    "text": "The DC bureaucrat who could deliver billions to Elon Musk  —  The SpaceX billionaire is forging new ties with a federal telecom official who could help funnel billions of dollars to his company if Trump is elected.  —  Elon Musk has forged a relationship with a Republican figure who could open … ",
    "url": "https://www.politico.com/news/2024/10/18/elon-musk-brendan-carr-fcc-starlink-00184260"
  },
  {
    "text": "Julian Zelizer on Trump's increasingly dire rhetoric  —  “He doesn't even really use code words or anything.  He's just all in.”  —  ∙ Paid … In the closing days of the 2024 campaign, Donald Trump is talking a lot about “the enemy within.”  He's threatened to deploy the US military against his domestic political foes.",
    "url": "https://www.publicnotice.co/p/julian-zelizer-interview-trump"
  },
  {
    "text": "Jan. 6 rioter who attacked multiple officers sentenced to 17 months in prison  —  The widow of an MPD officer delivered an emotional victim impact statement.  —  Demonstrators swarm the U.S. Capitol building during a protest in Washington, D.C., Jan. 6, 2021.",
    "url": "https://abcnews.go.com/Politics/jan-6-rioter-attacked-multiple-officers-sentenced-17/story?id=114914567"
  }
]