[
  {
    "text": "Trump administration fires DOJ officials who worked on criminal investigations of the president  —  The DOJ employees had been involved in special counsel Jack Smith's investigation that led to Trump's classified documents and Jan. 6 cases.  —  WASHINGTON — The Department of Justice … ",
    "url": "https://www.nbcnews.com/politics/justice-department/trump-administration-fires-doj-officials-worked-criminal-investigation-rcna189512"
  },
  {
    "text": "Trump Justice Department fires officials who investigated Trump and launches ‘special project’ into January 6 cases  —  More than a dozen officials who worked on the criminal investigations into Donald Trump have been fired, according to sources familiar with the matter.",
    "url": "https://www.cnn.com/2025/01/27/politics/trump-special-project-january-6-prosecutors"
  },
  {
    "text": "Trump-Appointed Prosecutor Opens Review of Justice Department's Jan. 6 Cases  —  Lawyers who worked on the matters are asked to turn over files, notes and other records  —  WASHINGTON—A top Trump-appointed prosecutor has opened an internal review of the Justice Department's decision … ",
    "url": "https://www.wsj.com/us-news/law/trump-appointed-prosecutor-opens-review-of-justice-departments-jan-6-cases-72cd371c?st=7w92vg&reflink=article_copyURL_share"
  },
  {
    "text": "Justice Department fires more than a dozen key officials on former Special Counsel Jack Smith's team  —  Acting Attorney General James McHenry 'does not trust these officials to assist in faithfully implementing the President's agenda'  —  EXCLUSIVE: The Justice Department is firing … ",
    "url": "https://www.foxnews.com/politics/justice-department-fires-more-than-dozen-key-officials-former-special-counsel-jack-smiths-team?intcmp=tw_fnc"
  },
  {
    "text": "Trump Just Broke the Law.  Blatantly.  And He Might Get Away With It.  —  Imagine that there were a particularly dirty NFL player—call him Thompson—who developed a habit of doing something new and possibly dangerous to opposing players.  Penalty flags didn't deter him.  On and on he went.",
    "url": "https://newrepublic.com/article/190704/trump-fires-inspectors-general-broke-law-blatantly"
  },
  {
    "text": "Chief Corruption Prosecutor Resigns From Justice Dept.  —  Corey Amundson chose to leave the department after being told he was being reassigned by the Trump administration to a position related to immigration enforcement.  —  The head of the Justice Department's public integrity section … ",
    "url": "https://www.nytimes.com/2025/01/27/us/politics/chief-corruption-prosecutor.html"
  },
  {
    "text": "Trump Administration Live Updates: Prosecutors Who Aided Special Counsel Investigations Are Fired  —  Where things stand  — Special counsel firings: The acting attorney general, James McHenry, fired more than a dozen prosecutors who worked with Special Counsel Jack Smith … ",
    "url": "https://www.nytimes.com/live/2025/01/27/us/trump-news"
  },
  {
    "text": "Indiana man fatally shot by sheriff's deputy identified as Jan. 6 defendant  — A Jasper County sheriff's deputy fatally shot 42-year-old Matthew W. Huttle during a traffic stop in northwest Indiana on Sunday after an altercation in which Huttle reportedly resisted arrest and was armed.",
    "url": "https://www.fox32chicago.com/news/indiana-man-fatally-shot-deputy-identified-jan-6"
  },
  {
    "text": "Recently pardoned Jan. 6 rioter killed in officer-involved shooting in Northern Indiana  —  Noe Padilla Sarah NelsonIndianapolis Star  —  JASPER COUNTY — The Indiana State Police are investigating an officer-involved shooting which resulted in the death of Matthew Huttle, 42, from Hobart, who was a recently pardoned January 6 rioter.",
    "url": "https://www.indystar.com/story/news/crime/2025/01/27/pardoned-jan-6-rioter-killed-officer-involved-shooting-indiana-jasper-pulaski-county-state-police/77976517007/"
  },
  {
    "text": "Democrats flip the script, eyeing debt limit to block Trump's agenda  —  Republicans have leveraged the debt ceiling for years to block Democrats' agenda.  Now liberals see an opening to stymie Trump.  —  DORAL, Florida — Democrats in Congress are considering forcing a showdown … ",
    "url": "https://www.washingtonpost.com/business/2025/01/27/trump-debt-ceiling-democrats/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM3OTU0MDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM5MzM2Mzk5LCJpYXQiOjE3Mzc5NTQwMDAsImp0aSI6IjQ3MzcwZTdjLTU3MzQtNDhiNi1hNDYyLWRmZWY1NzVjMWVkOCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9idXNpbmVzcy8yMDI1LzAxLzI3L3RydW1wLWRlYnQtY2VpbGluZy1kZW1vY3JhdHMvIn0.CeBmBdI_3R6YKWuAvfAu3bNJaA36oizBOCjo3MT5iOk&itid=gfta"
  },
  {
    "text": "Trump to ink new executive orders today banning transgender service members, military DEI programs  —  WASHINGTON — President Trump is expected to sign two executive orders Monday booting transgender service members and eliminating Diversity, Equity and Inclusion programs from the military, The Post has learned.",
    "url": "https://nypost.com/2025/01/27/us-news/trump-to-ink-new-executive-orders-today-banning-trans-service-members-military-dei-programs/"
  },
  {
    "text": "Colombia yields on US deportation flights to avert trade war  —  A looming trade war between the US and Colombia appears to have been averted after the Colombian government agreed to allow US military flights carrying deported migrants to land in the Andean country.",
    "url": "https://www.bbc.com/news/articles/c20p36e62gyo"
  },
  {
    "text": "Quaker groups file suit over end of policy restricting ICE arrests in houses of worship  —  The suit appears to be the first from a faith-based organization challenging the change in court.  —  A group of Quaker congregations are suing the Department of Homeland Security for changing a policy … ",
    "url": "https://www.nbcnews.com/politics/national-security/quaker-groups-file-suit-end-policy-restricting-ice-arrests-houses-wors-rcna189471"
  },
  {
    "text": "Navajo Nation leaders raise alarm over reports of Indigenous people being questioned and detained during immigration sweeps  —  At least 15 Indigenous people in Arizona and New Mexico have reported being stopped at their homes and workplaces, questioned or detained by federal law enforcement … ",
    "url": "https://www.cnn.com/2025/01/27/us/navajo-detained-ice-indigenous-immigration-trump/"
  },
  {
    "text": "CDC ordered to stop working with WHO immediately, upending expectations of an extended withdrawal  —  U.S. public health officials have been told to stop working with the World Health Organization, effective immediately.  A U.S. Centers for Disease Control and Prevention official … ",
    "url": "https://apnews.com/article/cdc-who-trump-548cf18b1c409c7d22e17311ccdfe1f6"
  },
  {
    "text": "China's DeepSeek AI app sends U.S. tech stocks reeling  —  The tech-heavy Nasdaq index lost nearly 4 percent in early trading Monday, with chipmaker Nvidia down nearly 12 percent.  —  The sudden popularity of a Chinese artificial intelligence model called DeepSeek pummeled stocks Monday … ",
    "url": "https://www.washingtonpost.com/business/2025/01/27/deep-seek-ai-markets-nvidia/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM3OTU0MDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM5MzM2Mzk5LCJpYXQiOjE3Mzc5NTQwMDAsImp0aSI6ImMxYmRlNjA2LWQ4NDUtNDEzYy05Yzk1LTZmYmQxMTEwMmQwNSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9idXNpbmVzcy8yMDI1LzAxLzI3L2RlZXAtc2Vlay1haS1tYXJrZXRzLW52aWRpYS8ifQ.ZhGnYIYWV0ZO5LnShC4usjfCwZ95kPKrKe3NHBhUQR0&itid=gfta"
  },
  {
    "text": "Some GOP senators want open committee vote on Gabbard  —  Any Republican opposition could doom the top intelligence nominee's confirmation.  —  Some Republican senators are pushing for the unusual step of making public a key vote on Tulsi Gabbard's nomination in the Senate Intelligence Committee … ",
    "url": "https://www.politico.com/news/2025/01/27/tulsi-gabbard-senate-intelligence-committee-vote-006977"
  },
  {
    "text": "Inspector general fired by Trump has a warning for Americans  —  President Donald Trump fired the inspectors general from more than a dozen federal agencies in a Friday night purge, according to a Trump administration official, paving the way for him to install his own picks for the independent watchdog roles.",
    "url": "https://www.cnn.com/2025/01/27/politics/video/inspector-general-fired-trump-mark-greenblatt-digvid"
  },
  {
    "text": "DeepSeek FAQ  —  It's Monday, January 27.  Why haven't you written about DeepSeek yet?  —  I did!  I wrote about R1 last Tuesday.  —  I totally forgot about that.  —  I take responsibility.  I stand by the post, including the two biggest takeaways that I highlighted … ",
    "url": "https://stratechery.com/2025/deepseek-faq/"
  },
  {
    "text": "US reports first outbreak of H5N9 bird flu in poultry  —  The United States has reported its first outbreak of H5N9 bird flu in poultry on a duck farm in California, the World Organisation for Animal Health (WOAH) said on Monday.  —  U.S. authorities also detected the more common H5N1 strain … ",
    "url": "https://www.reuters.com/business/healthcare-pharmaceuticals/us-reported-first-outbreak-h5n9-bird-flu-poultry-woah-says-2025-01-27/"
  },
  {
    "text": "They Followed North Carolina Election Rules When They Cast Their Ballots.  Now Their Votes Could Be Tossed Anyway.  —  A Republican judge is trying to overturn his election loss by challenging more than 60,000 ballots.  These are some of those voters' stories.",
    "url": "https://www.propublica.org/article/north-carolina-voters-jefferson-griffin-supreme-court-challenge"
  },
  {
    "text": "FBI insider raises concerns about Kash Patel's role in hostage rescue  —  Days before this week's high-stakes confirmation hearing of Kash Patel to be FBI director, a bureau insider has come forward with new information questioning Patel's judgment during sensitive hostage rescue missions, CBS News has learned.",
    "url": "https://www.cbsnews.com/news/fbi-insider-kash-patel-hostage-rescue/"
  },
  {
    "text": "Polls show views souring on Elon Musk as Trump's wingman  —  Musk's numbers are down, and even some who like him don't seem to love him being so central.  —  There are already signs that Elon Musk's marriage of convenience to President Donald Trump could be a fraught union.",
    "url": "https://www.washingtonpost.com/politics/2025/01/27/polls-show-views-souring-elon-musk-trumps-wingman/"
  },
  {
    "text": "In Exacting Retribution, Trump Aims at the Future as Well as the Past  —  The president made good on promises to seek revenge against enemies during his first week back in power, signaling in the process that anyone who crosses him in the future could also suffer.",
    "url": "https://www.nytimes.com/2025/01/27/us/politics/trump-politics-enemies-pompeo-fauci.html?unlocked_article_code=1.sU4.-EdJ.cbOxwSY0f-20&smid=url-share"
  },
  {
    "text": "Europe's Elon Musk Problem … During an american election, a rich man can hand out $1 million checks to prospective voters.  Companies and people can use secretly funded “dark money” nonprofits to donate unlimited money, anonymously, to super PACs, which can then spend it on advertising campaigns.",
    "url": "https://www.theatlantic.com/magazine/archive/2025/03/musk-tech-oligarch-european-election-influence/681453/?gift=hVZeG3M9DnxL4CekrWGK34_jHWNsAU1mvPsKLSJcYGQ&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "It's pretty easy to cut $2 trillion from the federal budget, actually (permalink)  —  If Elon Musk wants to cut $2t from the US federal budget, there's a pretty straightforward way to get there - just eliminate all the beltway bandits who overcharge Uncle Sucker for everything from pharmaceuticals … ",
    "url": "https://pluralistic.net/2025/01/27/beltway-bandits/#henhouse-foxes"
  },
  {
    "text": "US: Order Halting Foreign Aid Work Puts Lives at Risk  —  Trump Administration Should Continue Programs While Reviewing Budgets  —  (Washington, DC) - The US government's suspension of most foreign aid is putting lives around the world at risk, Human Rights Watch said today.",
    "url": "https://www.hrw.org/news/2025/01/27/us-order-halting-foreign-aid-work-puts-lives-risk"
  }
]