[
  {
    "text": "JD Vance got a former professor to delete a blog post Vance wrote in 2012 attacking GOP over anti-immigrant rhetoric  —  A week after President Barack Obama won reelection in November 2012, JD Vance, then a law student at Yale, wrote a scathing rebuke of the Republican Party's stance on migrants … ",
    "url": "https://www.cnn.com/2024/09/17/politics/jd-vance-delete-2012-blog-post-attacking-gop-anti-immigrant-rhetoric/"
  },
  {
    "text": "A quick explanation of how bomb threats work, to help JD Vance  —  There were a number of threats to people and places in Springfield, Ohio, after Vance and Trump made false claims about Haitian immigrants.  The media isn't to blame.  —  It's important to establish a timeline on what happened … ",
    "url": "https://www.washingtonpost.com/politics/2024/09/17/vance-trump-springfield-ohio-threats/"
  },
  {
    "text": "Next year's massive tax battle has already started  —  Good morning, Early Birds.  Election Day is less than seven weeks away.  To our readers in swing states sick of all the TV ads: Stay strong.  (But if you can't get enough election coverage, check out our colleague Aaron Blake's newsletter, The Campaign Moment, for even more.)",
    "url": "https://www.washingtonpost.com/politics/2024/09/18/next-years-massive-tax-battle-has-already-started/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI2NjMyMDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI4MDE0Mzk5LCJpYXQiOjE3MjY2MzIwMDAsImp0aSI6IjE0YjIzNGQ2LWFhODQtNGZkOC1hZGQ3LTdlZjY0NjIwNDllYSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzA5LzE4L25leHQteWVhcnMtbWFzc2l2ZS10YXgtYmF0dGxlLWhhcy1hbHJlYWR5LXN0YXJ0ZWQvIn0.F8fBcNLQLntSJhPae8TDe83Ve9c5RZbhFRB0Cdr0mEc&itid=gfta"
  },
  {
    "text": "Johnson's colleagues baffled by his shutdown strategy … - “I don't know how he thinks it's going to pass ... where are the votes coming from?” said Rep. Troy Nehls (R-Texas).  — Another House Republican, speaking on the condition of anonymity, called Johnson's plan “puzzling” … ",
    "url": "https://www.axios.com/2024/09/18/johnsons-colleagues-baffled-by-his-shutdown-strategy"
  },
  {
    "text": "Hezbollah hit by a wave of exploding pagers and blames Israel.  At least 9 dead, thousands injured … Pagers used by hundreds of members of the militant group Hezbollah exploded near simultaneously in Lebanon and Syria on Tuesday, killing at least nine people — including an 8-year-old girl … ",
    "url": "https://apnews.com/article/lebanon-hezbollah-israel-exploding-pagers-8893a09816410959b6fe94aec124461b"
  },
  {
    "text": "The FBI is investigating suspicious packages sent to election officials in more than 15 states  —  The FBI and the U.S. Postal Inspection Service on Tuesday were investigating the origin of suspicious packages that have been sent to or received by elections officials in more than 15 states … ",
    "url": "https://apnews.com/article/elections-workers-security-suspicious-packages-e3400b1e86bc02f7345d9970ef356bec"
  },
  {
    "text": "Suspicious mail containing white powder sent to election offices in at least 16 states  —  None of the mail has been deemed hazardous so far but it has caused evacuations.  —  LIVE  —  A hazmat crew from the National Guard's Civilian Support Team investigates after a suspicious package … ",
    "url": "https://abcnews.go.com/Politics/suspicious-mail-white-powder-election-offices-16-states/story?id=113790813"
  },
  {
    "text": "Russia propaganda group behind fake Kamala Harris hit-and-run story, says Microsoft  —  Microsoft researchers found that the group created a video, paid an actor to appear as the alleged victim, and spread the claim through a fake website  —  A false claim circulating on social media … ",
    "url": "https://www.theguardian.com/us-news/2024/sep/18/kamala-harris-fake-hit-run-story-russia-propaganda-storm-1516"
  },
  {
    "text": "Judge Aileen Cannon Failed to Disclose a Right-Wing Junket  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up to receive our biggest stories as soon as they're published.  —  Federal Judge Aileen M. Cannon, the controversial jurist who tossed … ",
    "url": "https://www.propublica.org/article/judge-aileen-cannon-trump-documents-case-travel-disclosures"
  },
  {
    "text": "Scripps News/Ipsos poll: Majority supports mass deportation of undocumented immigrants  —  The poll also showcases major partisan divides between voters on how to address one of the biggest topics of the presidential race: immigration.  —  A majority of Americans support the mass deportation … ",
    "url": "https://www.scrippsnews.com/politics/path-to-the-white-house/scripps-news-ipsos-poll-majority-supports-mass-deportation-of-undocumented-immigrants"
  },
  {
    "text": "AJC poll finds Kamala Harris and Donald Trump are locked in a tight race in Georgia  —  The race has tightened since the AJC's poll in June when the former president held a 5-point lead over President Joe Biden.  —  Vice President Kamala Harris and former President Donald Trump are locked … ",
    "url": "https://www.ajc.com/politics/ajc-poll-finds-kamala-harris-and-donald-trump-are-locked-in-a-tight-race-in-georgia/C5CQ6742V5AHVIDUVQ77LQ7YMY/"
  },
  {
    "text": "Trump traps Senate GOP with flip-flop on taxes … - They'll have to harmonize their own positions — in real time — with a president who is constantly changing his.  —  Trump posted he would “get SALT back.”  — That's a strong indication he wants to let those in high-tax states deduct … ",
    "url": "https://www.axios.com/2024/09/18/trump-salt-tax-cuts-senate"
  },
  {
    "text": "Harris refuses to veer off script in her second high-profile interview  —  Harris' appearance at the NABJ event follows Donald Trump's combative sit-down interview with the association.  —  PHILADELPHIA — Kamala Harris largely stuck to her script during an interview Tuesday with a panel … ",
    "url": "https://www.politico.com/news/2024/09/17/kamala-harris-interview-nabj-00179695"
  },
  {
    "text": "Trump's delusional debate spin speaks volumes  —  The contrast with Biden is telling. … Kamala Harris clobbered Donald Trump during their first (and likely only) presidential debate on September 10.  She humiliated him by smirking and laughing at his offensive buffoonery.",
    "url": "https://www.publicnotice.co/p/trump-debate-spin-kamala-harris"
  },
  {
    "text": "Trump: When I Win, The People Who Tried To Defeat Me Are Going To Prison  —  He's openly calling for rigging the election via voter intimidation, in a truly classic example of Every Accusation is a Confession: … To continue to treat this as a normal election, the media have to either ignore … ",
    "url": "https://www.lawyersgunsmoneyblog.com/2024/09/trump-when-i-win-the-people-who-tried-to-defeat-me-are-going-to-prison"
  },
  {
    "text": "A records flaw could block thousands in Arizona from voting in state and local races  —  Election officials in Arizona have discovered a flaw in the state's voter registration system that could disqualify nearly 100,000 people from voting in state and local races just weeks before early ballots will hit mailboxes.",
    "url": "https://www.npr.org/2024/09/17/nx-s1-5116592/arizona-election-citizenship-records-dmv"
  },
  {
    "text": "A new government report reveals the fundamental flaw in the American economy  —  A little-noticed report by the non-partisan Congressional Budget Office (CBO) released this month reveals why, for most Americans, the economy is broken.  The report focuses on the American economy from 2019 to 2021.",
    "url": "https://popular.info/p/a-new-government-report-reveals-the"
  },
  {
    "text": "Elon Musk Shared Memes Made by FSB Propaganda Machine  —  EGG ON YOUR FACE  —  A journalistic investigation has revealed that the content was generated by a Russian propaganda machine set up to sow discord over the war in Ukraine.  —  DENIED  —  A Manhattan court rejected Maxwell's argument that she was protected from prosecution.",
    "url": "https://www.thedailybeast.com/billionaire-tesla-ceo-elon-musk-shared-memes-made-by-fsb-propaganda-machine"
  }
]