[
  {
    "text": "Key Bridge collapses into Patapsco River in Baltimore after vessel hits support column; state of emergency declared  —  Baltimore's Francis Scott Key Bridge collapsed early Tuesday after a container ship struck a support column, sending at least seven cars into the Patapsco River … ",
    "url": "https://www.baltimoresun.com/2024/03/26/key-bridge-collapses-into-patapsco/"
  },
  {
    "text": "Baltimore bridge collapses after powerless cargo ship rams into support column; 6 people are missing  —  A container ship lost power and rammed into a major bridge in Baltimore early Tuesday, causing it to snap and plunge into the river below.  Several vehicles fell into the chilly waters, and rescuers are searching for survivors.",
    "url": "https://apnews.com/article/baltimore-bridge-collapse-53169b379820032f832de4016c655d1b"
  },
  {
    "text": "Baltimore bridge collapse caused by DEI efforts, Utah Rep. Phil Lyman says  —  Lyman, who is also running for Utah governor, blamed diversity efforts for the disaster.  —  Phil Lyman, a Utah Republican lawmaker and candidate for governor, quickly used Baltimore's Francis Scott Key Bridge collapse … ",
    "url": "https://www.sltrib.com/news/politics/2024/03/26/baltimore-bridge-collapse-caused/"
  },
  {
    "text": "Misinformation runs rampant after Baltimore bridge collapse … - The crew of the Singapore-flagged Dali issued a mayday call before striking the bridge and notified authorities that it was experiencing a power issue, according to Maryland Gov. Wes Moore.  — Paul Wiedefeld … ",
    "url": "https://www.axios.com/2024/03/26/francis-scott-key-bridge-collapse-reasons-conspiracy"
  },
  {
    "text": "NBC News to drop ex-RNC chair Ronna McDaniel after Rachel Maddow, ‘Morning Joe’ revolt  —  NBC News plans to drop former Republican National Committee boss Ronna McDaniel as a paid contributor after network stars including MSNBC prime time headliner Rachel Maddow and the co-hosts of “Morning Joe” … ",
    "url": "https://nypost.com/2024/03/26/media/nbc-news-to-drop-ex-rnc-chair-ronna-mcdaniel-after-rachel-maddow-morning-joe-revolt/"
  },
  {
    "text": "Mick Mulvaney defends Ronna McDaniel amid NBC turmoil  —  Former White House chief of staff Mick Mulvaney is dismissing criticism NBC News is facing from some of the network's biggest stars over its decision to hire former Republican National Committee Chair Ronna McDaniel as a paid contributor.",
    "url": "https://thehill.com/homenews/media/4556337-mick-mulvaney-ronna-mcdaniel-nbc-news-msnbc/"
  },
  {
    "text": "Judge Imposes Gag Order on Trump in Manhattan Criminal Trial  —  The order limiting the former president's speech came the day after Justice Juan M. Merchan set an April 15 trial date for the hush-money case.  —  The New York judge presiding over one of Donald J. Trump's criminal trials imposed … ",
    "url": "https://www.nytimes.com/2024/03/26/nyregion/trump-trial-gag-order.html"
  },
  {
    "text": "‘Biden bump is real’: president gains on Trump in six battleground states  —  Biden now leads Trump in Wisconsin, Arizona, Georgia, Nevada and North Carolina, and is tied in Pennsylvania, new poll shows  —  Joe Biden had some good news on Tuesday as polling showed him gaining on Donald Trump … ",
    "url": "https://www.theguardian.com/us-news/2024/mar/26/election-trump-biden-latest-polls"
  },
  {
    "text": "Trump's Truth Social is now a public company.  Experts warn its multibillion-dollar valuation defies logic  —  New York CNN  —  For the first time in almost 30 years, part of Donald Trump's business empire has gone public.  Trading started with a bang, but the frenzy eased considerably … ",
    "url": "https://www.cnn.com/2024/03/26/markets/trump-media-stock-truth-social/"
  },
  {
    "text": "Erin Hawley: The Woman Arguing Against the Abortion Pill  —  Erin Hawley is best known as the wife of Senator Josh Hawley, but now the spotlight is on her in a Supreme Court case.  —  It was 2014, and Erin Morrow Hawley was fighting against the egg-laying hens of Missouri.",
    "url": "https://www.nytimes.com/2024/03/26/us/erin-hawley-abortion-pill-supreme-court.html"
  },
  {
    "text": "Ken Paxton agrees to community service, paying restitution to avoid trial in securities fraud case  —  Paxton, who will not have to enter a plea under the terms of the agreement, faced the prospect of decades in prison if he had been convicted of fraud.  —  HOUSTON — Prosecutors on Tuesday agreed … ",
    "url": "https://www.texastribune.org/2024/03/25/ken-paxton-plea-deal-securities-fraud-felony/"
  },
  {
    "text": "Qatari royal invested about $50 million in pro-Trump network Newsmax  —  Before and after the investment, senior newsroom leaders urged Newsmax staff to soften coverage of Qatar, current and former employees said  —  A member of the Qatari royal family invested roughly $50 million in Newsmax … ",
    "url": "https://www.washingtonpost.com/nation/2024/03/26/qatar-newsmax-investment/"
  },
  {
    "text": "Trump is selling $60 Bibles with ‘God Bless the U.S.A.’ singer Lee Greenwood … Republican presidential candidate and former President Donald Trump at a campaign rally in Rochester, New Hampshire on January 21, 2024 .  —  Donald Trump on Tuesday started promoting a line of pricey Bibles … ",
    "url": "https://www.cnbc.com/2024/03/26/trump-selling-60-god-bless-the-usa-bibles-with-lee-greenwood.html"
  },
  {
    "text": "G.O.P. Aide Drops Groping Lawsuit Against Matt Schlapp, a Powerful Conservative  —  The aide, Carlton Huffman, said the allegations were a misunderstanding and that he has not been paid by Mr. Schlapp or his group, the American Conservative Union.  —  A lawsuit has been dropped against Matt Schlapp … ",
    "url": "https://www.nytimes.com/2024/03/26/us/politics/matt-schlapp-groping-lawsuit.html"
  },
  {
    "text": "MyPillow founder Mike Lindell's attorneys bail on him as he fights $5M ‘Prove Mike Wrong’ challenge award  —  As two of his attorneys withdraw from his case, 2020 election denier and pillow magnate Mike Lindell has been greenlit to appeal a federal judge's ruling last month affirming … ",
    "url": "https://lawandcrime.com/high-profile/mypillow-founder-mike-lindells-attorneys-bail-on-him-as-he-fights-5m-prove-mike-wrong-challenge-award/"
  },
  {
    "text": "James Comer makes his final anti-Biden push ... to prospective donors  —  Rep. James Comer (R-Ky.) assumed leadership of the House Oversight Committee last year with a particularly ambitious goal: proving that President Biden had committed an act necessitating his removal from office.",
    "url": "https://www.washingtonpost.com/politics/2024/03/26/comer-impeachment-inquiry-criminal-referrals-fundraising/"
  },
  {
    "text": "The Supreme Court Is Shaming Itself  —  Donald Trump is determined to avoid accountability before the general election, and, so far, the U.S. Supreme Court is helping him.  —  Trump has no legal ground whatsoever to delay a ruling in his plea for presidential immunity.",
    "url": "https://www.theatlantic.com/politics/archive/2024/03/dc-trump-trial-speed/677862/"
  },
  {
    "text": "West Virginia governor vetoes bill expanding renewable energy to protect coal  —  West Virginia Gov. Jim Justice (R) on Tuesday vetoed a measure that would raise the allowable size for a solar plant operated by state utilities, citing concerns about its effects on the coal industry.",
    "url": "https://thehill.com/policy/energy-environment/4557868-w-va-governor-vetoes-bill-expanding-renewable-energy-to-protect-coal/"
  }
]