[
  {
    "text": "Trump administration wants to un-fire some nuclear safety workers but can't figure out how to reach them  —  The individuals, who work in an agency that oversees the nation's nuclear stockpile, had been fired on Thursday and lost access to their federal government email accounts.",
    "url": "https://www.nbcnews.com/politics/national-security/trump-administration-wants-un-fire-nuclear-safety-workers-cant-figure-rcna192345"
  },
  {
    "text": "Trump officials fired nuclear staff not realizing they oversee the country's weapons stockpile, sources say  —  Trump administration officials fired more than 300 staffers Thursday night at the National Nuclear Security Administration — the agency tasked with managing the nation's nuclear stockpile … ",
    "url": "https://www.cnn.com/2025/02/14/climate/nuclear-nnsa-firings-trump"
  },
  {
    "text": "Europe will not be part of Ukraine-Russia peace talks, US envoy says  —  Keith Kellogg tells countries to offer concrete solutions and boost spending instead of complaining about talks role  —  Europe will be consulted - but ultimately excluded - from the planned peace talks between Russia … ",
    "url": "https://www.theguardian.com/world/2025/feb/15/europe-will-not-take-part-in-us-russia-talks-ukraine-kellogg"
  },
  {
    "text": "Trump team to start Russia-Ukraine peace talks in Saudi Arabia  —  Negotiators from Kyiv will be joining the talks that launch in the coming days.  —  EXCLUSIVE … MUNICH — Senior Trump administration officials are heading to Saudi Arabia to start peace talks with Russian and Ukrainian negotiators … ",
    "url": "https://www.politico.eu/article/trump-team-to-start-russia-ukraine-peace-talks-saudi-arabia-putin-zelenskyy/"
  },
  {
    "text": "Trump strangles Europe … - Defense Secretary Pete Hegseth perplexed and perturbed allies on his first visit to NATO by seemingly taking some of Ukraine's bargaining chips off the table before those talks began. … - Back at home, Trump announced “reciprocal” tariffs on every country … ",
    "url": "https://www.axios.com/2025/02/15/trump-vance-europe-russia-ukraine-nato"
  },
  {
    "text": "Trump-Musk Scandal at USAID Takes Unnerving Turn With Vile Leaked Memo  —  Shockingly, it turns out that empowering the richest human being on the planet to maliciously and gratuitously heap additional misery on that planet's most poor, hungry, and desperate people might—just might … ",
    "url": "https://newrepublic.com/article/191578/trump-musk-scandal-usaid-leaked-memo"
  },
  {
    "text": "Records show how DOGE planned Trump's DEI purge — and who gets fired next  —  A DOGE team plans to fire federal workers who are not in DEI roles and employees in offices that protect equal rights, internal documents show.  —  A team of workers from the U.S. DOGE Service developed step … ",
    "url": "https://www.washingtonpost.com/nation/2025/02/15/doge-fire-federal-employees-trump-dei/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM5NTk1NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQwOTc3OTk5LCJpYXQiOjE3Mzk1OTU2MDAsImp0aSI6ImZjM2IwNWI5LWNjODUtNGRmYy1iYjM4LWM2NWNkZDg0M2UyZiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb24vMjAyNS8wMi8xNS9kb2dlLWZpcmUtZmVkZXJhbC1lbXBsb3llZXMtdHJ1bXAtZGVpLyJ9.qWJU35oN5qhQSXIFVU0OnfmsRXxEde6ezIeNf2mmTV0"
  },
  {
    "text": "As federal workers and aid recipients reel, Trump's team is unmoved  —  “They get the one starving kid in Sudan that isn't going to have a USAID bottle, and they make everything DOGE has done about the starving kid in Sudan,” a White House official said.  —  Federal and nonprofit employees … ",
    "url": "https://www.washingtonpost.com/politics/2025/02/15/federal-workers-aid-recipients-reel-trumps-team-says-so-what/"
  },
  {
    "text": "Ukraine rejects Trump bid to take rights to half its mineral reserves  —  Kyiv wants security guarantees to be tied to any natural resources deal  —  Ukrainian President Volodymyr Zelenskyy has rejected a US bid to take ownership of around 50 per cent of the rights to his country's rare earth minerals … ",
    "url": "https://www.ft.com/content/b08b7258-7ae0-4bae-9499-e6d3183d5894"
  },
  {
    "text": "Don't Assume Trump Is Wrong About Birthright Citizenship  —  On his first day in office, President Trump issued an executive order that purports to end birthright citizenship for certain children.  It does so despite Section 1 of the 14th Amendment, which declares, “All persons born … ",
    "url": "https://www.nytimes.com/2025/02/15/opinion/trump-birthright-citizenship.html?unlocked_article_code=1.xE4.OCZA.QtpiNIig_NCZ&smid=url-share"
  },
  {
    "text": "German Chancellor Rebukes Vance for Supporting Party That Downplays Nazis  —  At the Munich Security Conference, Olaf Scholz accused the U.S. vice president of unacceptable interference in Germany's coming elections.  —  Chancellor Olaf Scholz of Germany on Saturday accused Vice President JD Vance … ",
    "url": "https://www.nytimes.com/2025/02/15/world/europe/scholz-vance-munich-germany.html?unlocked_article_code=1.xE4.mulj.COUVBJ5qAg8m&smid=url-share"
  },
  {
    "text": "‘The Gulf of America’ Is the Wrong Fight to Pick  —  The more that politicians mess around with place names, the more important it is to respond according to consistent principles.  —  The executive order rechristening the body of water known internationally as the “Gulf of Mexico” is not an easy document to take seriously.",
    "url": "https://www.theatlantic.com/ideas/archive/2025/02/trump-gulf-renaming-order/681704/"
  },
  {
    "text": "Maryland National Guard out of Frederick Douglass parade after DoD order declares Black History Month ‘dead’  —  Strict guidance from the national defense department crushed plans for an Eastern Shore parade held in honor of Frederick Douglass' 207th birthday because it was being held during … ",
    "url": "https://www.thebaltimorebanner.com/politics-power/maryland-national-guard-frederick-douglass-parade-UM7PE6LNMZG5NNQ3Q3OHD6E47E/"
  },
  {
    "text": "Trump Supporters Shared How He Could Lose Their Support, And There's One Issue That's Verrrrry Important To Them  —  “We didn't vote for my husband to lose his government career and benefits.”  —  Ashley Holt— BuzzFeed … We recently asked people in the BuzzFeed Community who voted … ",
    "url": "https://www.huffpost.com/entry/trump-supporters-lose-support_n_67af70f2e4b014c4688dabb0"
  },
  {
    "text": "Georgia's First Jewish Senator Is Losing Jewish Support  —  Democratic donors and Jewish leaders are so unhappy with Jon Ossoff over his position on Israel that some have quietly urged Gov. Brian Kemp, a Republican, to run against him.  —  Four years ago, Senator Jon Ossoff was sworn in using … ",
    "url": "https://www.nytimes.com/2025/02/15/us/politics/jon-ossoff-georgia-jewish-democrats.html"
  },
  {
    "text": "How a Vermont border agent's death exposed violence linked to the cultlike Zizian group  —  In the wooded outskirts of Chapel Hill, North Carolina, a perplexed landlord noticed odd sights at two of his rental properties.  —  Tenants wore long black coats and parked box trucks outside the duplexes.",
    "url": "https://www.cbsnews.com/news/vermont-border-agent-death-exposed-violence-linked-cultlike-zizian-group/"
  },
  {
    "text": "Playbook: GOP confronts a continental divide  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  Happy Saturday from Indiana, where I have a bit of FOMO about not being in Munich at the POLITICO Pub.  I'll try to remedy that today by having the Hoosier classic breaded pork tenderloin sandwich … ",
    "url": "https://www.politico.com/newsletters/playbook/2025/02/15/gop-confronts-a-continental-divide-00204515"
  },
  {
    "text": "Trump's Threats and Statehood Taunts Reset Race to Lead Canada  — ‘The enemy is not in Ottawa, the enemy is in Washington’  — Conservatives pivot to ‘Canada First’ message as polls narrow  —  For over a year, Canada's Conservative Party seemed on track to win a decisive victory … ",
    "url": "https://www.bloomberg.com/news/articles/2025-02-15/trump-s-threats-and-statehood-taunts-reset-race-to-lead-canada"
  },
  {
    "text": "How Trump's MAGA Agenda Is Already Sticking It To Red America  —  The effects of DOGE and potential cuts to Medicaid are likely to hit communities where Donald Trump is popular.  —  LOADING  —  Early in Donald Trump's first term, Steve Bannon met with some House Republicans who were wavering … ",
    "url": "https://www.huffpost.com/entry/trump-musk-cuts-red-states_n_67af8d57e4b0513a8d77218b"
  },
  {
    "text": "Trump Media says it lost more than $400M last year  —  Trump Media is the parent company of the president's social media platform Truth Social.  —  The parent company of President Donald Trump's social networking site Truth Social says it lost $400.9 million last year and its annual revenue declined 12% to $3.6 million.",
    "url": "https://www.politico.com/news/2025/02/15/truth-social-losing-money-00204531"
  },
  {
    "text": "Penn scrubs diversity initiatives from its website to comply with Trump order  —  The University of Pennsylvania's medical school plans to dissolve committees having to do with diversity, equity, and inclusion and any roles that implement such efforts.That's what Roy Hamilton, vice dean for inclusion … ",
    "url": "https://www.inquirer.com/education/university-pennsylvania-dei-donald-trump-order-20250215.html"
  },
  {
    "text": "Don't Say “Chaotic” or “Transactional”  —  We're not living in Trump 1.0  —  I'm struck by the degree to which the mainstream media is still living in the Trump 1.0 world of 2017-2020, using words like “chaotic” or “transactional” to describe the new administration's behavior.",
    "url": "https://www.persuasion.community/p/dont-say-chaotic-or-transactional"
  },
  {
    "text": "RFK Jr. Is Already Taking Aim at Antidepressants  —  The new HHS secretary has made baseless claims that the drugs are addictive and cause violent behavior.  —  Hours after being confirmed as Secretary of the US Department of Health and Human Services, Robert F. Kennedy … ",
    "url": "https://www.motherjones.com/politics/2025/02/kennedy-rfk-antidepressants-ssri-school-shootings/"
  },
  {
    "text": "IRS will lay off thousands of probationary workers in the middle of tax season  —  The IRS will lay off thousands of probationary workers in the middle of tax season, according to two sources familiar with the agency's plans, and cuts could happen as soon as next week.",
    "url": "https://apnews.com/article/irs-treasury-layoffs-doge-tax-season-2be8db11fdd510b7ce6ac0db56f9a503"
  },
  {
    "text": "Federal workers are being rushed back to the office.  It's causing chaos.  —  Some need to win a coin flip to use a desk.  Others say they're killing time when workstations aren't available.  —  As the Federal Emergency Management Agency prepared for its full workforce to report in person this month … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2025/02/15/return-to-office-mandate-trump-desks/"
  },
  {
    "text": "Is corporate America already souring on Trump?  —  Optimism at the prospect of tax cuts and lighter regulation has given way to anxiety over trade policies",
    "url": "https://www.ft.com/content/a7c9376b-4cb2-4cf2-a665-66f75b72f4c2"
  }
]