[
  {
    "text": "Susan Rice: Trump's reported calls with Putin appear illegal  —  Former White House adviser and United Nations ambassador Susan Rice called out former President Trump over a report that he has spoken with Russian President Vladimir Putin at least seven times since leaving office, suggesting such calls would violate the Logan Act.",
    "url": "https://thehill.com/policy/international/4924145-susan-rice-trump-putin-logan-act/"
  },
  {
    "text": "Kremlin Says Trump Sent Putin Covid Tests While President  — Kremlin denies phone calls took place after Trump left office  — Trump campaign pushed back on claims in Bob Woodward's book  —  The Kremlin confirmed that former US President Donald Trump while in office sent Russian … ",
    "url": "https://www.bloomberg.com/news/articles/2024-10-09/kremlin-confirms-trump-sent-putin-covid-tests-while-president"
  },
  {
    "text": "Kremlin refutes Trump denial on sending Putin COVID tests … - Woodward also reported that Trump and Putin have had “as many as seven” personal conversations since Trump left office in 2021.  — Trump campaign spokesperson Steven Cheung said Tuesday that the allegations were “made up stories” … ",
    "url": "https://www.axios.com/2024/10/09/trump-putin-covid-testing-equipment-kremlin"
  },
  {
    "text": "Swing State Poll 2024: Pennsylvania, Michigan, Wisconsin: Blue Wall Shows Cracks As Race Tightens, Quinnipiac University Poll Finds; U.S. Senate Races: Michigan Moves To Toss-Up, Dems Lead In PA & WI  —  mail_outline  —  PENNSYLVANIA: Harris 49%, Trump 46%, other candidates 2%",
    "url": "https://poll.qu.edu/poll-release?releaseid=3913"
  },
  {
    "text": "EXCLUSIVE: Poll Finds Large Chunk of Haley Voters Ready to Ditch Trump  —  A SIGNIFICANT CHUNK OF SELF-IDENTIFIED Nikki Haley voters say they will support Kamala Harris for president, according to a new survey shared exclusively with The Bulwark.  —  If the election were held today … ",
    "url": "https://www.thebulwark.com/p/exclusive-poll-finds-large-chunk"
  },
  {
    "text": "Exclusive: Harris widens lead over Trump to 47%-40%, Reuters/Ipsos poll finds  —  Democratic Vice President Kamala Harris leads Republican Donald Trump 47% to 40% in the race to win the Nov. 5 U.S. presidential election, as she appeared to blunt Trump's edge on the economy and jobs, a Reuters/Ipsos poll published on Tuesday found.",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/10/09/harris-trump-lead-reuters-poll/75584172007/"
  },
  {
    "text": "As Milton misinformation swells, some Republicans try to course correct  —  As millions of Florida residents evacuate or hunker down in preparation for one of largest storms to ever make landfall in the state, some GOP lawmakers are urging them to check the facts.",
    "url": "https://www.politico.com/news/2024/10/09/florida-mtg-weather-posts-00183016"
  },
  {
    "text": "Kamala Harris Has Raised $1 Billion Since Entering 2024 Presidential Race  —  No presidential candidate is believed to have ever raised so much money so fast after entering a race.  The campaign has stopped trumpeting its fund-raising totals to keep Democrats from becoming complacent.",
    "url": "https://www.nytimes.com/2024/10/09/us/politics/harris-billion-dollar-fundraising.html"
  },
  {
    "text": "Trump has long blasted China's trade practices.  His ‘God Bless the USA’ Bibles were printed there  —  Thousands of copies of Donald Trump's “God Bless the USA” Bible were printed in a country that the former president has repeatedly accused of stealing American jobs and engaging in unfair trade practices — China.",
    "url": "https://apnews.com/article/trump-god-bless-usa-bible-china-32a80611605d4052d8238064bbcace4c"
  },
  {
    "text": "Trump plans rallies in solidly Democratic states in an unorthodox strategy for the election's final weeks  —  The stops will take him to Coachella in California and Madison Square Garden in New York.  —  Get ready for Donald Trump's blue state extravaganza.",
    "url": "https://www.nbcnews.com/politics/2024-election/trump-rallies-solidly-democratic-states-unorthodox-strategy-rcna174674"
  },
  {
    "text": "Scoop: Trump allies plan ad blitz around Harris' viral quote on Biden … - “Expect to see this clip every single time you turn on the television between now and Nov. 5,” a top Trump ally told Axios. … - “I've been a part of most of the decisions that have had impact,” Harris said on … ",
    "url": "https://www.axios.com/2024/10/09/trump-ad-harris-biden-quote-the-view"
  },
  {
    "text": "In the pantheon of first lady memoirs, Melania Trump's is something else  —  The dominant theme of “Melania” is one of graceful grievance.  —  Depending on how you define “memoir” — must it be a coherent narrative, or does a posthumous collection of diary entries suffice? … ",
    "url": "https://www.washingtonpost.com/books/2024/10/08/melania-trump-memoir-review/"
  },
  {
    "text": "Howard Stern endorses Kamala Harris during interview that touches on therapy, sexism and Trump  —  Stern revealed he is voting for the Democratic nominee halfway through an interview with the vice president  —  Vice President Kamala Harris has Howard Stern's vote, he announced during her appearance on his Sirius XM radio show Tuesday.",
    "url": "https://www.salon.com/2024/10/08/howard-stern-endorses-kamala-harris-during-interview-that-touches-on-therapy-sexism-and/"
  },
  {
    "text": "Democrats can't make Georgia governor investigate State Election Board, judge says  —  The Republican-led board recently passed changes to election rules, including an election night hand count of ballots and a rule requiring a “reasonable inquiry”  —  A Fulton County judge dismissed … ",
    "url": "https://www.ajc.com/politics/ethics-case-against-georgia-election-board-dismissed-by-fulton-judge/RKUMJ4DLGFEVBFRD3ZYN3YYUFQ/"
  },
  {
    "text": "“The righteous hate what is false”: Mike Johnson betrays his faith by lying about immigrants voting  —  House Speaker Mike Johnson admits he has no data to support his claim that “illegals” vote by the “thousands”  —  House Speaker Mike Johnson is a man of faith — a “Bible-believing Christian … ",
    "url": "https://www.salon.com/2024/10/09/the-righteous-hate-what-is-false-mike-johnson-betrays-his-faith-by-lying-about-voting/"
  },
  {
    "text": "Lawsuit filed against Jack Phillips dismissed by Colorado Supreme Court  —  The Colorado Supreme Court dismissed a lawsuit filed against Jack Phillips after he refused to bake a cake celebrating a gender transition.  —  In a 6-3 opinion, the court threw out the lawsuit on procedural grounds … ",
    "url": "https://www.washingtonexaminer.com/news/supreme-court/3182475/lawsuit-filed-against-jack-phillips-dismissed-colorado-supreme-court/"
  },
  {
    "text": "Vance's Fake Autoworkers Just Exposed the GOP's Big Con  —  During JD Vance's appearance in Michigan on Tuesday, several members of the audience came dressed rather conspicuously, sporting T-shirts that read “Auto Workers for Trump.”  But when Craig Mauger of The Detroit News interviewed them … ",
    "url": "https://newrepublic.com/article/186965/fake-autoworkers-trump-exposed-vance"
  },
  {
    "text": "Walz: ‘The Electoral College needs to go’  —  Minnesota Gov. Tim Walz, the Democratic Party's vice presidential nominee, suggested Tuesday night that the Electoral College should be abolished during two West Coast campaign stops.  —  Walz mentioned the concept during fundraisers in Seattle … ",
    "url": "https://thehill.com/homenews/campaign/4923526-minnesota-gov-walz-electoral-college/"
  },
  {
    "text": "Kamala's Media Blitz is Incredible, Press Coverage is Awful  —  We all deserve better  —  While Trump is spouting dangerous hurricane lies in a desperate bid to scare people into voting for him, Kamala Harris is out there absolutely crushing it.  —  With appearances this week on 60 Minutes … ",
    "url": "https://www.dworkinsubstack.com/p/kamalas-media-blitz-is-incredible"
  },
  {
    "text": "The Moment of Truth … Last november, during a symposium at Mount Vernon on democracy, John Kelly, the retired Marine Corps general who served as Donald Trump's second chief of staff, spoke about George Washington's historic accomplishments—his leadership and victory in the Revolutionary War … ",
    "url": "https://www.theatlantic.com/magazine/archive/2024/11/george-washington-nightmare-donald-trump/679946/?gift=mBLCHcnsd_Gd3EecvWSKTVWmBt18XO-ATC6rbb2Qz0s&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Biology Explains Why People Normalize Trump  —  How authoritarians hack our nervous systems to desensitize us to their assaults on democracy.  —  ∙ Paid  —  1. New Normal  —  America has been navigating a slow-rolling catastrophe for the better part of a decade.",
    "url": "https://www.thebulwark.com/p/biology-explains-why-people-normalize"
  },
  {
    "text": "Donald Trump mistakenly calls Maine Gov. Janet Mills ‘he’ during campaign call  —  WASHINGTON - Former President Donald Trump repeatedly referred to Maine Gov. Janet Mills as “he” during a Monday conference call with Republican backers in the state, according to a recording obtained by the Bangor Daily News.",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/10/09/trump-maine-governor-campaign-2024/75586700007/"
  },
  {
    "text": "Lawmakers vow to fight Trump if he restores Confederate base names  —  “The law was passed, it's not going to go backward,” GOP Rep. Don Bacon said.  —  Lawmakers from both parties are vowing to fight back if former President Donald Trump makes good on his pledge to put a Confederate general's name … ",
    "url": "https://www.politico.com/news/2024/10/09/lawmakers-trump-confederate-base-00183057"
  },
  {
    "text": "DeSantis vows to punish Floridians who leave dogs tied up amid hurricanes  —  Florida Gov. Ron DeSantis (R) vowed Wednesday to punish Floridians who leave dogs tied up amid hurricanes, as the threat of Hurricane Milton looms over the state's west coast.  —  “It is cruel for anyone to leave … ",
    "url": "https://thehill.com/homenews/state-watch/4924651-ron-desantis-florida-hurricane-milton-pets/"
  },
  {
    "text": "Senate Democrat: Trump White House controlled ‘flawed and incomplete’ FBI Kavanaugh investigation  —  Democratic Sen. Sheldon Whitehouse (R.I.) released a report Wednesday that accused the Trump administration's FBI of conducting in 2018 a “flawed and incomplete” investigation into the allegations … ",
    "url": "https://thehill.com/homenews/senate/4924439-senate-democrat-trump-white-house-controlled-flawed-and-incomplete-fbi-kavanaugh-investigation/"
  },
  {
    "text": "The Most Dramatic Shift in U.S. Public Opinion  —  America's immigration debate has taken a restrictionist turn.  Eight years ago, Donald Trump declared that “when Mexico sends its people, they're not sending their best,” and promised to build a “big, beautiful wall” on the southern border.",
    "url": "https://www.theatlantic.com/politics/archive/2024/10/immigration-public-opinion-reversal/680196/"
  },
  {
    "text": "Hadera terror stabbing leaves six wounded, terrorist eliminated  —  A stabbing attack in Hadera injured six people, including three in serious condition.  Police confirmed it was a terror attack.  —  Six people were wounded in a terror stabbing attack in Hadera, police reported Wednesday morning.",
    "url": "https://www.jpost.com/breaking-news/article-823875"
  }
]