[
  {
    "text": "Trump: Nobody Could Have Predicted a Hurricane Would Hit Mid-Hurricane Season  —  OUT OF THE BLUE  —  The former president opined that nobody could have predicted Hurricane Helene making landfall “so late” in the hurricane season, which is set to last another two months.",
    "url": "https://www.thedailybeast.com/donald-trump-thinks-nobody-could-have-predicted-a-hurricane-would-hit-mid-hurricane-season"
  },
  {
    "text": "Supplies arrive by plane and mule to North Carolina as Helene death toll tops 100  —  Widespread devastation left behind by Hurricane Helene came into light Monday across the South, revealing a wasteland of splintered houses, crushed cargo containers and mud-covered highways in one of the worst storms in U.S. history.",
    "url": "https://apnews.com/article/hurricane-helene-north-carolina-asheville-f02869c7d01e68f2d7f0553abb82252f"
  },
  {
    "text": "Hurricane Helene: Trump speaks in Georgia, bashes Harris for not traveling there … Republican presidential nominee Donald Trump traveled to hurricane-blasted Georgia to deliver remarks and help hand out supplies, one day after he leveraged the devastating storm as a political attack against Democratic nominee Kamala Harris.",
    "url": "https://www.cnbc.com/2024/09/30/hurricane-helene-trump-georgia-harris-biden.html"
  },
  {
    "text": "The Only Patriotic Choice for President  —  It is hard to imagine a candidate more unworthy to serve as president of the United States than Donald Trump.  He has proved himself morally unfit for an office that asks its occupant to put the good of the nation above self-interest.",
    "url": "https://www.nytimes.com/2024/09/30/opinion/editorials/kamala-harris-2024.html?unlocked_article_code=1.Ok4.D1dZ.OfohLwh4zcQC&smid=nytcore-ios-share&referringSource=articleShare&sgrp=c-cb"
  },
  {
    "text": "Rudy Giuliani's Daughter: Trump Took My Dad From Me.  Please Don't Let Him Take Our Country Too  —  “Nothing I have experienced prepared me for the very public and relentless implosion of my father's life,” writes Caroline Giuliani, announcing her support for Kamala Harris.",
    "url": "https://www.vanityfair.com/news/story/caroline-giuliani-trump-kamala-harris"
  },
  {
    "text": "Rudy Giuliani's daughter says she's voting for Harris, ‘grieving the loss of my dad’ to Trump  —  Former New York City Mayor Rudy Giuliani's (R) daughter said she's backing Vice President Harris in a Monday article for Vanity Fair and “grieving the loss of my dad to [former President] Trump.”",
    "url": "https://thehill.com/blogs/in-the-know/4908114-giuliani-daughter-backs-harris/"
  },
  {
    "text": "The three phases of normalizing Trump's attack on Harris in Wisconsin  — The use of neutral language.  If you merely read about Donald Trump's deeply offensive rally this weekend in Prairie du Chien, Wisconsin, you probably thought it was about immigration.  And about Trump up to his usual tricks of disparaging his rivals.",
    "url": "https://margaretsullivan.substack.com/p/the-three-phases-of-normalizing-trumps"
  },
  {
    "text": "Oops, They Did It Again: The Mainstream Media Buries Trump's Outrage … It's a pretty sad commentary on the way our mainstream media cover Donald Trump that if you really want to know what Trump said at a given rally, you would be wasting your time going to The New York Times or The Washington Post … ",
    "url": "https://newrepublic.com/series/51/mainstream-media-sanewashing-trump-migrants"
  },
  {
    "text": "The Coming Trump Revenge Tour  —  Trump has campaigned on a wave of retaliatory criminal prosecutions.  It's not the first time he's promised to lock up his rivals — but a second term would be different.  —  In the most volatile presidential campaign of the last 50 years … ",
    "url": "https://www.politico.com/news/magazine/2024/09/30/trump-doj-revenge-political-enemies-00178218"
  },
  {
    "text": "Judge again strikes down Georgia abortion law, allowing abortions to resume … About the Author  —  Maya T. Prabhu is a government reporter for The Atlanta Journal-Constitution.  Born in Queens, New York, and raised in northern Virginia, Maya attended Spelman College and then the University of Maryland for a master's degree.",
    "url": "https://www.ajc.com/politics/judge-again-strikes-down-georgia-abortion-law-allowing-abortions-to-resume/4PWIUSQDMNAPRNRQ6HEA7LPQC4/"
  },
  {
    "text": "Georgia judge strikes down state's six-week abortion ban  —  Georgia's “heartbeat” law banning abortion after six weeks is unconstitutional and can't be enforced, a Fulton County superior judge ruled Monday.  —  The ruling permanently enjoined the law and stated that abortions must … ",
    "url": "https://thehill.com/policy/healthcare/4907993-georgia-abortion-ban-unconstitutional/"
  },
  {
    "text": "An Ohio Businessman Faces Death Threats for Praising His Haitian Workers  —  The lifelong Republican employs fewer Haitians than others in Springfield, but his life has been upended since Donald J. Trump spread falsehoods about immigrants in his hometown.  —  For Jamie McGregor … ",
    "url": "https://www.nytimes.com/2024/09/30/us/springfield-ohio-haitians-threats.html?unlocked_article_code=1.Ok4.owwF.bMbd9HfnWIJB&smid=url-share"
  },
  {
    "text": "How CBS Will Fact Check the Walz-Vance VP Debate  —  CBS is experimenting with a novel way to offer real-time fact-checking of the vice-presidential debate on Tuesday.  Just don't expect the moderators to frequently jump in.  —  The journalistic dilemma of how to fact-check national candidates … ",
    "url": "https://www.nytimes.com/2024/09/30/business/media/cbs-vice-presidential-debate-fact-check-qr.html"
  },
  {
    "text": "Democrats Sue Georgia Election Board Over Ballot Hand Counting Rule  —  The Democratic National Committee (DNC) and the Georgia Democratic Party sued the State Election Board on Monday after three of its MAGA members approved a rule requiring poll workers to hand count all ballots, even after being tabulated by machines.",
    "url": "https://www.democracydocket.com/news-alerts/democrats-sue-georgia-election-board-over-ballot-hand-counting-rule/"
  },
  {
    "text": "California bans legacy admissions at all colleges  —  Gov. Gavin Newsom on Monday signed a prohibition on the practice.  —  SACRAMENTO, California — It will soon be illegal for public and private universities in California to consider an applicant's relationship to alumni or donors when deciding whether to admit them.",
    "url": "https://www.politico.com/news/2024/09/30/california-bans-legacy-admissions-colleges-00181655"
  },
  {
    "text": "Arkansas Judge Mandates Early Voting in Majority Black City  —  Early voting will be held at Seventh Street Church of Christ in West Memphis, Arkansas after a judge granted part of a request from two voters.  The voters in the majority-Black city initially requested at least two early voting locations.",
    "url": "https://www.democracydocket.com/news-alerts/arkansas-voters-sue-board-for-refusing-to-hold-early-voting-in-majority-black-county/"
  },
  {
    "text": "Giant naked Trump effigy is ‘deplorable’, say Republicans  —  Sculpture of former US president has been erected near Las Vegas purely for ‘shock value’, say local politicians  —  Republicans have condemned as “deplorable” a 43-foot effigy of a naked Donald Trump that has been erected near Las Vegas.",
    "url": "https://www.telegraph.co.uk/us/news/2024/09/30/naked-donald-trump-effigy-deplorable-say-republicans/"
  },
  {
    "text": "Polls show big increase in Republicans planning to vote for abortion rights  —  In some states, that GOP number could even approach a majority.  —  The politics of abortion rights have shifted massively toward Democrats since the Supreme Court overturned Roe v. Wade in 2022.",
    "url": "https://www.washingtonpost.com/politics/2024/09/30/polls-show-big-increase-republicans-planning-vote-abortion-rights/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI3NjY4ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI5MDUxMTk5LCJpYXQiOjE3Mjc2Njg4MDAsImp0aSI6IjZlMDZmYWQzLTVhYjctNDk1ZC05ZDc2LTczMmYxYWE1MDJlOSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzA5LzMwL3BvbGxzLXNob3ctYmlnLWluY3JlYXNlLXJlcHVibGljYW5zLXBsYW5uaW5nLXZvdGUtYWJvcnRpb24tcmlnaHRzLyJ9.mcQ35smhLaFAhmquZPKR5JbtDfU07hmHz1GFnbTheFU&itid=gfta"
  },
  {
    "text": "Video of Harris slurring words in Helene warning is edited |  Fact check  —  The claim: Video shows Kamala Harris slurred words in Helene remarks  —  A Sept. 27 Facebook post (direct link, archive link) shows Vice President Kamala Harris delivering a warning about Hurricane Helene and speaking in an unusually slow manner.",
    "url": "https://www.usatoday.com/story/news/factcheck/2024/09/30/kamala-harris-slur-speech-helene-fact-check/75447979007/"
  },
  {
    "text": "Hamas Commander Killed in Israeli Strike Led U.N. Refugee Agency Teachers' Union  —  A Hamas commander in Lebanon who was killed in an Israeli airstrike overnight was an accredited member of the United Nations Relief and Works Agency for Palestine Refugees in the Near East, the embattled agency confirmed after his death.",
    "url": "https://www.nationalreview.com/news/hamas-commander-killed-in-israeli-strike-led-u-n-refugee-agency-teachers-union/"
  },
  {
    "text": "Schumer dumping $1M in surprisingly competitive Maryland Senate race … - The Democratic PAC WinSenate has already spent some ad money on the race, but the new bookings for the first two weeks of October are a significant jump, according to AdImpact data.  — “[I]f Hogan's Washington GOP friends … ",
    "url": "https://www.axios.com/2024/09/30/maryland-senate-schumer-hogan-alsobrooks"
  },
  {
    "text": "FBI to pay $22 million to settle claims of sexual discrimination at training academy  —  The payout to 34 women dismissed from the FBI's training academy in Quantico, Virginia, would rank among the biggest lawsuit settlements in the history of the bureau.  —  The FBI has agreed to pay … ",
    "url": "https://www.nbcnews.com/politics/justice-department/fbi-pay-22-million-settle-claims-sexual-discrimination-training-academ-rcna173253"
  }
]