[
  {
    "text": "‘Same clown car with a different driver’: House GOP goes off the rails  —  Mike Johnson may have avoided a shutdown, but the House GOP is still emotionally raw from its 22-day speakership fight.  —  The House GOP has descended, as one member put it, into “schoolyard bully bullshit.”",
    "url": "https://www.politico.com/news/2023/11/15/the-house-gop-is-stuck-on-a-failure-loop-00127418"
  },
  {
    "text": "The unusual inability of the House GOP to win votes  —  You are probably aware that the Republican majority in the House is having a tough year.  —  It took them more than a dozen votes to elect a speaker in January, eventually settling on Rep. Kevin McCarthy (R-Calif.) after he agreed to let any member trigger a vote on his ouster.",
    "url": "https://www.washingtonpost.com/politics/2023/11/15/house-republicans-partisan-votes/"
  },
  {
    "text": "Last Post, Please Read  —  Good morning.  This is Zandar's Dad.  I am sorry to tell you that he passed away over the weekend, peacefully in his sleep.  Fortunately, his computer was on and open to this page but I don't know if I will be able to post again.  This blog was Jon's passion.",
    "url": "http://zandarvts.blogspot.com/2023/11/last-post-please-read.html"
  },
  {
    "text": "Ethics Committee will not recommend punishment for embattled Rep. George Santos  —  The New York Republican has pleaded not guilty to charges and defended himself.  —  Rep. George Santos walks back to his office after debate on the House floor on a resolution to expel him from Congress … ",
    "url": "https://abcnews.go.com/Politics/ethics-committee-recommend-punishment-embattled-rep-george-santos/story?id=104913312"
  },
  {
    "text": "Capitol Police clash with group protesting ‘violently’ outside DNC  —  Capitol police say all members have been evacuated from the area.  —  Police officers wear gas masks as they keep watch outside the Democratic National Headquarters during a multi-denominational event hosted … ",
    "url": "https://abcnews.go.com/Politics/capitol-police-working-back-150-people-protesting-dnc/story?id=104930336"
  },
  {
    "text": "The Squad Is About to Fight for Its Political Life  —  One of the biggest, bitterest, and most expensive political battles of the 2024 election cycle has emerged: The American Israel Public Affairs Committee, one of the most powerful, best-funded influence operations in Washington … ",
    "url": "https://slate.com/news-and-politics/2023/11/squad-primary-battle-israel-gaza-pacs.html"
  },
  {
    "text": "Biden judicial nominee fails to explain law terms when asked by Sen. John Kennedy  —  Sen. John Kennedy (R-LA) stumped one of President Joe Biden's judicial nominees while going through a speed round of questions about legal terms during a Senate Judiciary Committee hearing on Wednesday.",
    "url": "https://www.washingtonexaminer.com/news/senate/biden-judicial-nominee-fails-explain-law-terms-asked-kennedy"
  },
  {
    "text": "Nikki Haley suffers setback from conservatives after vowing to verify social media users  —  Republican presidential candidate Nikki Haley's recent comments on requiring social media users to verify their identity online have sparked conservative backlash to a campaign that has steadily gained momentum in the GOP primary race.",
    "url": "https://www.washingtonexaminer.com/news/campaigns/nikki-haley-suffers-setback-conservatives-social-media-users"
  },
  {
    "text": "Sen. Joe Manchin says he ‘absolutely’ would consider a presidential run  —  In an interview with NBC's Kristen Welker, the West Virginia Democrat said he first has to explore whether there's an appetite among voters for a moderate candidate like him.  —  WASHINGTON — Sen. Joe Manchin … ",
    "url": "https://www.nbcnews.com/politics/2024-election/sen-joe-manchin-says-absolutely-consider-presidential-run-rcna125368"
  },
  {
    "text": "Yet Another Pedophile Leftist Arrested  —  Yes, they really do want to diddle the kiddies.  —  It's hard to conclude anything else, given how insistent the Left is about sexualizing kids and the recurring stories about various people in the upper echelons of society who wind up in sex scandals having … ",
    "url": "https://hotair.com/david-strom/2023/11/15/yet-another-pedophile-leftist-arrested-n592644"
  },
  {
    "text": "Rep. Rashida Tlaib part of hidden Facebook group that glorifies Hamas, mocks hostages: report  —  Rep. Rashida Tlaib (D-Mich.), who says she is advocating for “peace” after Hamas' Oct. 7 terror attack against Israel, is part of a hidden Facebook group that has praised the jihadists who kidnapped … ",
    "url": "https://nypost.com/2023/11/15/news/rep-tlaib-part-of-hidden-facebook-group-that-glorifies-hamas-report/"
  },
  {
    "text": "‘Anti-establishment’ activist sought to incite Trump supporters on Jan. 6, DOJ argues  —  John Earle Sullivan, a self-proclaimed activist and journalist, only filmed the riot as a “ploy” to rile up the mob, federal prosecutors argued at his trial.  —  WASHINGTON — A man who previously held himself … ",
    "url": "https://www.nbcnews.com/politics/justice-department/anti-establishment-activist-sought-incite-trump-supporters-jan-6-doj-a-rcna125397"
  },
  {
    "text": "Georgia prosecutors ask judge to jail Trump RICO co-defendant for witness intimidation  —  Fulton County prosecutors asked a judge Wednesday to jail Harrison Floyd, a co-defendant in Donald Trump's 2020 election subversion case in Georgia, over alleged attempts to intimidate witnesses, according to a court filing.",
    "url": "https://www.washingtonexaminer.com/policy/courts/georgia-prosecutors-judge-jail-trump-codefendant-witness-intimidation"
  },
  {
    "text": "Kari Lake ‘drove a stake’ through the heart of McCain Republicans.  Now she wants a meeting.  —  The Senate candidate is making appeals to some of the very people she attacked in 2022.  —  Kari Lake is finally ready to move on from the 2022 election — or at least she wants her rivals to.",
    "url": "https://www.politico.com/news/2023/11/15/kari-lake-mccain-republicans-00127464"
  },
  {
    "text": "Trump's own fraud-trial expert testifies about ‘glaring’ problems in his financial statements — but blames the accountants  — Wednesday was Trump's third day of presenting defense witnesses at his civil fraud trial in NY.  — An ex-SEC accountant offered blunt testimony on Trump's net-worth statements.",
    "url": "https://www.businessinsider.com/trump-gets-beat-up-by-his-own-fraud-trial-expert-2023-11?op=1"
  },
  {
    "text": "Trump whistleblower running for key House seat … - He is the first Democrat set to launch a bid for Spanberger's seat following her announcement that she's entering the 2025 Virginia governor's race.  — Semafor first reported on his intention to run for the seat.",
    "url": "https://www.axios.com/2023/11/15/vindman-congress-virginia-spanberger-seat-democrat"
  },
  {
    "text": "Hamas agrees to tentative deal to free dozens of hostages, pending Israel's approval  —  Hamas wants a multiday pause in fighting, increased humanitarian aid, and freedom for an unknown number of Palestinians in Israeli jails in exchange for the release of at least 50 women and children being held in Gaza",
    "url": "https://www.washingtonpost.com/national-security/2023/11/15/hamas-israel-gaza-hostage-deal/"
  },
  {
    "text": "Nevada attorney general is investigating false electors who aided Trump in 2020  —  The attorney general of Nevada is quietly investigating Republican activists and operatives who falsely pledged the state's six electoral votes to Donald Trump in 2020, despite Joe Biden's victory in the state.",
    "url": "https://www.politico.com/news/2023/11/15/nevada-false-electors-trump-investigation-00127369"
  },
  {
    "text": "Republicans Are the Party of Asinine Toxic Masculinity  —  A GOP senator challenging a union boss to a fight and an alleged kidney punch in the hallway by a deposed leader—just a normal day for conservatives in the Capitol. … “You're a United States Senator, sit down!!”",
    "url": "https://www.thedailybeast.com/republicans-are-the-party-of-asinine-toxic-masculinity"
  },
  {
    "text": "Montgomery teacher denies Hamas raid, accuses Israel of organ theft  —  An educator at Tilden Middle School ‘may be on leave’ after screenshots showed a Facebook post of hers containing misinformation about Israel  —  A Montgomery County teacher “may be on leave” after screenshots … ",
    "url": "https://www.washingtonpost.com/education/2023/11/15/antisemitism-montgomery-county-teacher/"
  },
  {
    "text": "Leonard Leo's firm got nearly $500K from conservative nonprofit, tax filing shows  —  Leo is among the most prominent figures of the conservative legal movement.  —  Americans for Public Trust, a nonprofit conservative government watchdog group, transferred more than a quarter of its expenses … ",
    "url": "https://www.politico.com/news/2023/11/15/leonard-leo-firm-conservative-nonprofit-00127488"
  },
  {
    "text": "Donald's Desperate Demand: Trump Files for Mistrial in New York Bank Fraud Case  —  Trump's lawyers made a 30-page court filing on Wednesday seeking a mistrial, a move they've telegraphed for a while but still marks a new low in the case. … Seeing no way out of his bank fraud trial … ",
    "url": "https://www.thedailybeast.com/donalds-desperate-demand-trump-files-for-mistrial-in-new-york-bank-fraud-case"
  }
]