[
  {
    "text": "Playbook: Will Dems keep standing with Israel?  —  Presented by With help from Eli Okun and Garrett Ross  —  DRIVING THE DAY  —  ISRAEL LATEST — 11 Americans dead; some “likely” taken hostage ... IDF estimates 1,500 terrorists dead inside Israel ... U.S. begins arms shipments … ",
    "url": "https://www.politico.com/newsletters/playbook/2023/10/10/will-dems-keep-standing-with-israel-00120673"
  },
  {
    "text": "Biden will address the nation on the Israel attack  —  President Biden will address the American people Tuesday about the situation in Israel where Hamas militants attacked the country Saturday, killing more than 900 people, including at least 11 Americans.  Israel has responded with a siege and heavy bombing of the Gaza Strip.",
    "url": "https://www.npr.org/2023/10/10/1204861972/biden-will-address-the-nation-on-the-israel-attack"
  },
  {
    "text": "Biden faces a host of crises and a stress test for his theory of the presidency  —  The horrific attack in Israel has created new challenges for the president and his team.  They're keenly aware that they are under the microscope.  —  The White House is scrambling to react to a combination of crises that … ",
    "url": "https://www.politico.com/news/2023/10/10/joe-biden-steady-leadership-00120660"
  },
  {
    "text": "Former Dodgers star and Republican Steve Garvey enters U.S. Senate race  —  After nearly two decades of statewide Republican candidates being rejected by California's left-leaning electorate, former Dodger All-Star Steve Garvey hopes to drag the GOP back toward political relevance.",
    "url": "https://www.latimes.com/politics/story/2023-10-10/dodgers-star-steve-garvey-senate-race-feinstein-schiff-porter-lee"
  },
  {
    "text": "IDF says Gaza border finally sealed, bodies of 1,500 terrorists found inside Israel  —  Breaches in barrier being mined; military continues to notify relatives of those taken to Gaza; airstrikes target hundreds of sites in Strip, including Gaza City power base Rimal",
    "url": "https://www.timesofisrael.com/idf-says-gaza-border-finally-sealed-bodies-of-1500-terrorists-found-inside-israel/"
  },
  {
    "text": "Heat for NYC-DSA after pro-Palestine rally  —  HAPPENING TODAY: Former Rep. Tom Suozzi is expected to launch his comeback bid for the seat now held by Rep. George Santos, three people familiar with the plan told Playbook.  The Democrat — and many other challengers — are thinking … ",
    "url": "https://www.politico.com/newsletters/new-york-playbook/2023/10/10/heat-for-nyc-dsa-after-pro-palestine-rally-00120675"
  },
  {
    "text": "Gallego leads Lake, Sinema in Arizona Senate race: poll  —  Rep. Ruben Gallego (D-Ariz.) is leading both former Arizona gubernatorial candidate Kari Lake (R) and Sen. Krysten Sinema (I-Ariz.) in a hypothetical three-way race for Sinema's Arizona Senate seat, according to a new poll.",
    "url": "https://thehill.com/homenews/campaign/4246848-gallego-leads-lake-sinema-in-arizona-senate-race-poll/"
  },
  {
    "text": "After years of exaggerating his business assets, Trump confronts them in court  —  A civil case entering its second week threatens to put on display unprecedented details about how Trump's business operated  —  When Donald Trump needed to value his Trump Tower apartment for homeowner's insurance in 2010 … ",
    "url": "https://www.washingtonpost.com/politics/2023/10/10/trump-fraud-trial-property-value-wealth/"
  },
  {
    "text": "Fani Willis: Pro-Trump Lawyer Not Covered by Attorney-Client Privilege for Documents Allegedly Plotting ‘Fake Elector’ Plan  —  In a filing Tuesday, the Fulton County DA argued memos and emails are not covered by attorney-client privilege that allegedly show Kenneth Chesebro was the ‘architect’ of the fake electors plot",
    "url": "https://themessenger.com/politics/willis-chesebro-fake-electors-documents-exhibits-attorney-client-privilege"
  },
  {
    "text": "Former Maryland Governor Hogan Says He's Not Closing Door on 2024 Presidential Bid  — Former Maryland governor says Nikki Haley's on the ascent  — Hogan calls Matt Gaetz ‘a cancer’ on the GOP, Congress  —  Former Maryland Governor Larry Hogan said he hasn't ruled out running for president in 2024 … ",
    "url": "https://www.bloomberg.com/news/articles/2023-10-10/hogan-says-he-s-not-closing-door-on-2024-presidential-bid"
  },
  {
    "text": "Putin Offers Muted Response to Attack on Israel.  That Speaks Volumes.  —  Vladimir Putin has long projected friendly ties to Israel.  But his silence since Saturday's assault illustrates how the war in Ukraine has strained the relationship between the two countries.",
    "url": "https://www.nytimes.com/2023/10/10/world/europe/israel-hamas-russia-putin.html"
  },
  {
    "text": "Supreme Court turns away coal baron's defamation claim against news companies  —  The justices decline to consider overturning 1964 precedent that concluded there must be evidence of “actual malice” for a public figure to pursue a defamation claim.  —  WASHINGTON — The Supreme Court … ",
    "url": "https://www.nbcnews.com/politics/supreme-court-turns-away-coal-barons-defamation-claim-news-companies-rcna118036?taid=652559055b459d0001b020b2"
  },
  {
    "text": "North Carolina Republicans Are Creating a ‘Secret Police Force’  —  The euphemistically named “Gov Ops” is a civil liberties disaster waiting to happen. … Republican state legislators In North Carolina are establishing a new investigative body that Democratic critics have aptly compared to a “secret police force.”",
    "url": "https://www.thedailybeast.com/north-carolina-republicans-are-creating-a-secret-police-force"
  },
  {
    "text": "CNN Poll: Biden and Trump are in a dead heat in potential Nevada rematch  —  A new poll of registered voters in Nevada suggests the state is poised to reprise its role as a key battleground in the presidential election next November, while its first-in-the-West Republican caucuses in February … ",
    "url": "https://www.cnn.com/2023/10/10/politics/cnn-poll-nevada/"
  },
  {
    "text": "Universities are hotbeds for terrorist-sympathizing antisemitism  —  is the area of life most consumed by progressive left-wing ideology.  It is also, apparently, the biggest hotbed of antisemitism in the United States.  —  Harvard University, with the pristine reputation in higher education … ",
    "url": "https://www.washingtonexaminer.com/opinion/universities-are-hotbeds-for-terrorist-sympathizing-antisemitism"
  },
  {
    "text": "House Speaker chaos threatens GOP majority  —  The political chaos surrounding the vacant Speakership in the House threatens to upend Republican efforts to hold onto their slim majority in next year's elections.  —  Questions over who would succeed former House Speaker Kevin McCarthy … ",
    "url": "https://thehill.com/homenews/campaign/4246450-house-speaker-chaos-threatens-gop-majority/"
  },
  {
    "text": "Robert F. Kennedy Jr.'s Last Gasp  —  Three words told the story.  Robert F. Kennedy Jr.'s campaign had billed this afternoon's event in Philadelphia as a “much-anticipated announcement.”  Of course, that specific phrase may have been more true than intended.",
    "url": "https://www.theatlantic.com/politics/archive/2023/10/robert-f-kennedy-president-independent/675595/"
  }
]