[
  {
    "text": "Exclusive: FEMA staff confused after head said he was unaware of US hurricane season, sources say  —  Staff of the Federal Emergency Management Agency were left baffled on Monday after the head of the U.S. disaster agency said during a briefing that he had not been aware the country has a hurricane season … ",
    "url": "https://www.reuters.com/world/us/fema-staff-confused-after-head-said-he-was-unaware-us-hurricane-season-sources-2025-06-02/"
  },
  {
    "text": "A 23-Year-Old Crypto Bro Is Now Vetoing NSF Grants While Staring At His Water Bottle  —  Picture this: You're a researcher who has spent years developing a grant proposal, gone through layers of expert review, and received National Science Foundation (NSF) approval.",
    "url": "https://www.techdirt.com/2025/06/02/a-23-year-old-crypto-bro-is-now-vetoing-nsf-grants-while-staring-at-his-water-bottle/"
  },
  {
    "text": "Here's the latest.  —  The suspect is an Egyptian citizen who stayed in the United States after his tourist visa expired in 2023, an official said.  Eight people were injured in the attack in Boulder, Colo., on Sunday.  —  Here's the latest.  —  The suspect in the Boulder, Colo. … ",
    "url": "https://www.nytimes.com/live/2025/06/02/us/boulder-colorado-attack-suspect"
  },
  {
    "text": "Trump Tries to Blame Biden for Colorado Attack  —  The president and his administration are blaming “open borders” for an attack that injured eight by a suspect accused of overstaying a tourist visa  —  Following a horrific attack against Boulder, Colorado, protesters calling for the release … ",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-blames-biden-for-boulder-colorado-attack-1235352809/"
  },
  {
    "text": "Scoop: U.S. nuclear deal offer allows Iran to enrich uranium  —  The nuclear deal proposal the U.S. gave Iran on Saturday would allow limited low-level uranium enrichment on Iranian soil for a to-be-determined period of time, Axios has learned, contradicting public statements from top officials.",
    "url": "https://www.axios.com/2025/06/02/iran-nuclear-deal-proposal-enrich-uranium"
  },
  {
    "text": "Suspect in Colorado attack told police he researched for a year and targeted ‘Zionist group’  —  A man accused of using a makeshift flamethrower and an incendiary device to attack a group in Boulder, Colorado, that had gathered to bring attention to Israeli hostages in Gaza … ",
    "url": "https://apnews.com/article/boulder-colorado-attack-israel-palestine-flamethrower-pearl-street-7e680648371c3d1cb7c026d888d99279"
  },
  {
    "text": "Curtis Yarvin's Plot Against America  —  The reactionary blogger's call for a monarch to rule the country once seemed like a joke.  Now the right is ready to bend the knee.  —  In the spring and summer of 2008, when Donald Trump was still a registered Democrat, an anonymous blogger known … ",
    "url": "https://www.newyorker.com/magazine/2025/06/09/curtis-yarvin-profile?currentPage=all"
  },
  {
    "text": "Putin's Whole Trump Strategy Is in Tatters After Epic Drone Humiliation  —  Vladimir Putin might have thought he had succeeded in persuading Donald Trump that the Ukrainians had already lost the war against Russia.  But an ingenious sneak attack targeting Putin's most prized military assets proves otherwise … ",
    "url": "https://www.thedailybeast.com/putins-whole-trump-strategy-is-in-tatters-after-epic-drone-humiliation/"
  },
  {
    "text": "The Secret History of Trump's Private Cellphone  —  This article was featured in the One Story to Read Today newsletter.  Sign up for it here.  —  Just before Election Day, a disturbing piece of information made its way to Donald Trump.  Whenever he takes or makes calls on his personal cellphone … ",
    "url": "https://www.theatlantic.com/politics/archive/2025/06/trump-private-cellphone-china-hackers/683006/?gift=201cWZnM2XBz2eP81zy0pIjBkWA8VK0NF-8HfVdQTTY&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "'We're not going there': Thune vows not to overrule parliamentarian on megabill  —  Senate Majority Leader John Thune signaled Monday that Republicans won't move to overrule the chamber's parliamentarian during an upcoming debate on President Donald Trump's “big, beautiful bill.”",
    "url": "https://www.politico.com/live-updates/2025/06/02/congress/senate-parliamentarian-overrule-thune-00380848"
  },
  {
    "text": "Justice Dept. Capitol Siege Section head Greg Rosen resigns, says Trump Jan. 6 pardons sent “terrible message”  —  The federal prosecutor who helped lead the largest federal criminal case in American history has resigned his position in the Justice Department.",
    "url": "https://www.cbsnews.com/news/justice-department-capitol-siege-section-greg-rosen-resigns/"
  },
  {
    "text": "Ernst draws challenger after defending GOP megabill  —  State Rep. J.D. Scholten, who once challenged former Iowa Rep. Steve King, said: “I just felt, you know, I have to do this.”  —  After Sen. Joni Ernst (R-Iowa) told a town hall audience, “We're all going to die,” when responding … ",
    "url": "https://www.politico.com/news/2025/06/02/democrat-announces-run-against-joni-ernst-after-were-all-going-to-die-comments-00380630"
  },
  {
    "text": "F.T.C. Investigates Ad Groups and Watchdogs, Alleging Boycott Collusion  —  The regulator is looking into whether roughly a dozen groups violated antitrust law by coordinating boycotts among advertisers.  —  The Federal Trade Commission is investigating whether roughly a dozen prominent advertising … ",
    "url": "https://www.nytimes.com/2025/06/02/technology/ftc-investigation-advertising-boycotts.html?unlocked_article_code=1.L08.Zm0E.vxArA9JuHVMK&smid=url-share"
  },
  {
    "text": "BREAKING: Trump admin can't avoid First Amendment trial on student protesters  —  Find out the breaking legal news in real time, right in your inbox.  —  Upgrade now!  —  The Trump administration failed on Monday in its effort to avert a trial next month to determine whether a federal judge … ",
    "url": "https://www.allrisenews.com/p/aaup-rubio-trial"
  },
  {
    "text": "Exclusive: US pushes countries for best offers by Wednesday as tariff deadline looms  —  The Trump administration wants countries to provide their best offer on trade negotiations by Wednesday as officials seek to accelerate talks with multiple partners ahead of a self-imposed deadline in just five weeks … ",
    "url": "https://www.reuters.com/business/us-pushes-countries-best-offers-by-wednesday-tariff-deadline-looms-2025-06-02/"
  },
  {
    "text": "The Secret Police Are Here  —  Trump is losing on policy and the law.  But he's winning on power.  —  ∙ Paid  —  1. Masked Men  —  Dan Goldman represents the 10th Congressional District of New York.  Before he entered Congress he was an assistant U.S. attorney in the Southern District of New York.",
    "url": "https://www.thebulwark.com/p/the-secret-police-are-here"
  },
  {
    "text": "Fifth partner leaves Paul Weiss to join new firm  —  REUTERS/Eddie Keogh Purchase Licensing Rights  —  Another partner has left law firm Paul, Weiss, Rifkind, Wharton and Garrison, joining Karen Dunn and others who split to launch their own firm late last month.",
    "url": "https://www.reuters.com/legal/legalindustry/fifth-partner-leaves-paul-weiss-join-new-firm-2025-06-02/"
  },
  {
    "text": "‘Needlessly reckless’: Local leaders, community condemn South Park ICE raids  —  A popular Italian restaurant in South Park is receiving an overwhelming outpouring of support from the community after U.S. Immigration and Customs Enforcement agents detained a handful of their employees Friday night in a surprise raid.",
    "url": "https://www.nbcsandiego.com/news/local/community-speaks-after-ice-raids-at-south-park-italian-restaurant/3837706/"
  },
  {
    "text": "Teachers Are Not OK  —  Last month, I wrote an article about how schools were not prepared for ChatGPT and other generative AI tools, based on thousands of pages of public records I obtained from when ChatGPT was first released.  As part of that article, I asked teachers to tell me how AI has changed how they teach.",
    "url": "https://www.404media.co/teachers-are-not-ok-ai-chatgpt/"
  },
  {
    "text": "MAGA Launches Bonkers Hunt to ‘Prove’ Biden Is a Robot Clone  —  Trump's Truth Social post sent MAGA into a frenzied hunt for “evidence” proving that Biden is a robot.",
    "url": "https://www.thedailybeast.com/crazy-proof-maga-believes-shows-biden-is-a-robot-clone/"
  },
  {
    "text": "ICE, federal partners arrest nearly 1,500 illegal aliens in Massachusetts during immigration enforcement operation  —  ICE Boston targeted criminal alien offenders during month-long surge operation  —  BOSTON — U.S. Immigration and Customs Enforcement and federal law enforcement partners … ",
    "url": "https://www.ice.gov/news/releases/ice-federal-partners-arrest-nearly-1500-illegal-aliens-massachusetts-during"
  },
  {
    "text": "Trump Arrest of Immigrant Triggers Shock and Regret in Small MAGA Town  —  Ming Li Hui, who goes by the name of “Carol,” has lived for 20 years in the town of Kennett, Missouri, after coming here from Hong Kong.  She has been raising a family there and works as a waitress … ",
    "url": "https://newrepublic.com/article/195952/trump-arrest-immigrant-triggers-shock-regret-small-maga-town"
  },
  {
    "text": "“Out Of His Depth,” “Sold His Soul,” “Clueless”: NIH Staffers Speak Out About Director Bhattacharya  —  Jay Bhattacharya's stint as director of the National Institutes of Health is off to a rocky start.  At his first town hall last month, the former Stanford University health economist … ",
    "url": "https://www.importantcontext.news/p/out-of-his-depth-sold-his-soul-clueless"
  },
  {
    "text": "Immigration officials say they intended to arrest father of Milford teen instead  —  Officials did not say why they wanted to arrest the father.  —  Federal immigration officials on Monday said the Milford High School student who was arrested on his way to volleyball practice Saturday was not their intended target.",
    "url": "https://www.bostonglobe.com/2025/06/02/metro/milford-teen-arrested-ice/"
  },
  {
    "text": "Trump threatens to eviscerate NASA  —  Betelgeuse and its environs.  Credit: Adam Block /Steward Observatory/University of Arizona  —  June 2, 2025 Issue #885  —  Subscribers want to explore the universe, and I'm happy to help  —  Proposed White House budget will destroy NASA",
    "url": "https://badastronomy.beehiiv.com/p/trump-threatens-to-eviscerate-nasa-cb96"
  },
  {
    "text": "Exclusive: China's global favorability rising, views of the U.S. turn negative  —  U.S. trade policy is making China great again — at the United States' expense, per an analysis from Morning Consult that looks at global favorability ratings, and finds China's rising while America's falls.",
    "url": "https://www.axios.com/2025/06/02/china-us-global-opinions"
  },
  {
    "text": "Economists Question G.O.P. Bill: Why Increase the Deficit in Good Times? … There is a basic rule of thumb when it comes to the federal budget.  The government should spend heavily during times of crisis — recessions, wars, pandemics — and then get its fiscal house in order when the crisis passes.",
    "url": "https://www.nytimes.com/2025/06/02/business/government-debt-deficit-recession.html?unlocked_article_code=1.L08.qtmG.7ISaV3Se2Nv7&smid=re-share"
  },
  {
    "text": "STAT+: mRNA, once lauded as a scientific marvel, is now a government target  —  WASHINGTON — mRNA, a Nobel-winning technology harnessed by Trump officials to create Covid shots in record time, is becoming a political reject as the nation's leaders openly embrace vaccine skepticism.",
    "url": "https://www.statnews.com/2025/06/02/mrna-vaccines-covid-policy-critics-rise-to-power-concerted-attack-on-science/"
  },
  {
    "text": "Meet Josh Divine, the Trump Judicial Nominee Who Argued Christians Are “Obligated Ethically to Impose Their Beliefs On Others”  —  The highlights of the résumé of Josh Divine, President Donald Trump's nominee to a federal district court vacancy in Missouri … ",
    "url": "https://ballsandstrikes.org/nominations/josh-divine-trump-nominee-missouri-columnist/"
  },
  {
    "text": "Musk rips media over hypocrisy over Booker gesture  —  Tech billionaire Elon Musk slammed the “legacy media” over the weekend, alleging hypocrisy in how news outlets covered Sen. Cory Booker's (D-N.J.) recent arm gesture after he faced criticism for a similar gesture earlier this year.",
    "url": "https://thehill.com/media/5328855-musk-accuses-legacy-media-hypocrisy/"
  },
  {
    "text": "Medicaid cuts will harm rural Republican communities most  —  Though President Trump promised a “big beautiful” budget bill, what narrowly passed the House of Representatives in the early morning hours of May 22 will be anything but a big beautiful win for millions of marginalized Americans … ",
    "url": "https://thehill.com/opinion/healthcare/5325977-trump-budget-impact-rural-medicaid/"
  },
  {
    "text": "Elon Musk's failure in government  —  His legacy will be to make reform even harder  —  When donald trump announced last November that Elon Musk would be heading a government-efficiency initiative, many of his fellow magnates were delighted.  The idea, wrote Shaun Maguire … ",
    "url": "https://www.economist.com/united-states/2025/06/02/elon-musks-failure-in-government"
  },
  {
    "text": "Ukraine, Russia conclude talks in Istanbul, a 1,200-for-1,200 prisoner exchange is in the works, Zelensky says  —  Editor's note: The story is being updated.  —  The Ukrainian and Russian delegations concluded peace talks in Istanbul on June 2, agreeing on a new prisoners of war (POWs) exchange but failing to reach a ceasefire.",
    "url": "https://kyivindependent.com/istanbul-talks-june-2/"
  },
  {
    "text": "Federal judge blocks dissolution of union at TSA  —  Though the Transportation Security Administration has broad latitude to design and administer its own personnel system, U.S. District Judge Marsha Pechman found its contract with AFGE to be a “self-imposed restriction” on that power.",
    "url": "https://www.govexec.com/workforce/2025/06/federal-judge-blocks-dissolution-union-tsa/405751/"
  },
  {
    "text": "Trump administration asks Supreme Court to let it move forward with mass layoffs of federal workforce  —  Washington — President Trump's administration asked the Supreme Court on Monday to allow it to move forward with its plans to lay off thousands of federal workers at nearly two dozen agencies … ",
    "url": "https://www.cbsnews.com/news/trump-supreme-court-reductions-in-force-layoffs-federal-workers/"
  },
  {
    "text": "All international travelers should get measles vaccinations, CDC says  —  U.S. health officials have changed their advice to international travelers about measles, saying that Americans should be vaccinated against the virus no matter where they're going.  U.S. residents are recommended to get measles-mumps-rubella shots, anyway.",
    "url": "https://apnews.com/article/measles-international-travel-vaccine-980fdb9fcf8522fed01d23427eba4429"
  },
  {
    "text": "Supreme Court Turns Down Challenge to Ban on Semiautomatic Rifles  —  The case from Maryland was the court's latest opportunity to apply its recently announced history-based test for assessing the constitutionality of gun control laws.  —  The Supreme Court announced on Monday that it would not hear … ",
    "url": "https://www.nytimes.com/2025/06/02/us/supreme-court-semiautomatic-rifle-ban.html"
  }
]