[
  {
    "text": "The Tariff Beatings Will Continue Until Morale Improves  —  The video above has nothing to do with the subject of this post.  A big red-headed woodpecker got to work right in front of me yesterday, and I thought I'd give him a few seconds before getting to the dreary subject of tariffs.  —  Yes, tariffs.",
    "url": "https://paulkrugman.substack.com/p/the-tariff-beatings-will-continue"
  },
  {
    "text": "‘Tariff Man’ Is Back for More ‘Liberation’  —  Trump cranks up tariffs again, with 25% on Japan and South Korea.  —  Click for Sound  —  President Trump sure knows how to spoil an economic mood.  Three days after he signed the GOP's big budget bill, saving the economy … ",
    "url": "https://www.wsj.com/opinion/tariffs-south-korea-japan-donald-trump-trade-a9075145"
  },
  {
    "text": "A Marco Rubio impostor is using AI voice to call high-level officials  —  The unknown individual contacted at least five government officials, including three foreign ministers, a U.S. governor and a member of Congress, according to a State Department cable.  —  Summary167",
    "url": "https://www.washingtonpost.com/national-security/2025/07/08/marco-rubio-ai-imposter-signal/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzUxOTQ3MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzUzMzI5NTk5LCJpYXQiOjE3NTE5NDcyMDAsImp0aSI6IjhkYzljMTliLTQ4OTItNDU1Yy04ZWM1LTk3OTZkNDJhOWFhNCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb25hbC1zZWN1cml0eS8yMDI1LzA3LzA4L21hcmNvLXJ1YmlvLWFpLWltcG9zdGVyLXNpZ25hbC8ifQ.FXo72snQ4-mCIcX0ZziTprUYrRvc5av38deD9RnjkUc&itid=gfta"
  },
  {
    "text": "Top House Democrats demand release of Epstein files that mention Trump  —  Exclusive: Jamie Raskin and 15 others accuse justice department of withholding Epstein files to protect Trump  —  Hugo Lowell and Chris Stein in Washington  —  House Democrats on Tuesday demanded … ",
    "url": "https://www.theguardian.com/us-news/2025/jul/08/house-democrats-epstein-files-trump"
  },
  {
    "text": "Team Trump struggles to control the Epstein ‘client list’ fire it helped create  —  It was members of the president's own team who helped light the match and fan the flames, starting a political fire that they've clearly lost control over.  —  To know anything about contemporary conservative politics … ",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/team-trump-struggles-control-epstein-client-list-fire-helped-create-rcna217441"
  },
  {
    "text": "US Supreme Court lifts order that blocked Trump's mass federal layoffs  —  The U.S. Supreme Court cleared the way on Tuesday for President Donald Trump's administration to resume carrying out mass job cuts and the restructuring of agencies, elements of his campaign to downsize and reshape the federal government.",
    "url": "https://www.reuters.com/legal/litigation/us-supreme-court-lifts-order-that-blocked-trumps-mass-federal-layoffs-2025-07-08/"
  },
  {
    "text": "Supreme Court allows Trump to launch mass layoff and restructuring plans  —  The justices said they were not ruling on the legality of specific firing plans but simply allowing the administration to launch such efforts while litigation continues.  —  The Supreme Court on Tuesday cleared … ",
    "url": "https://www.washingtonpost.com/politics/2025/07/08/supreme-court-trump-mass-layoffs-federal-workers/"
  },
  {
    "text": "Trump Says He's Weighing Federal Takeover of Washington, DC  —  President Donald Trump said his administration is weighing whether to take control of the city of Washington, DC, to help combat crime, in a move that would represent a dramatic upheaval to the capital's half-century of home rule.",
    "url": "https://www.bloomberg.com/news/articles/2025-07-08/trump-says-he-s-weighing-federal-takeover-of-washington-dc"
  },
  {
    "text": "Ag secretary says able-bodied Medicaid recipients should replace immigrant farm workforce  —  Agriculture Secretary Brooke Rollins said millions of adult Medicaid participants who will face stricter work requirements under the GOP megabill should replace foreign farm workers deported under … ",
    "url": "https://www.politico.com/live-updates/2025/07/08/congress/rollins-says-able-bodied-medicaid-recipients-should-replace-immigrant-farm-workforce-00442065"
  },
  {
    "text": "Transcript: Trump Blurts Out Awkward Truth about ICE as MAGA Seethes  —  The following is a lightly edited transcript of the July 8 episode of the Daily Blast podcast.  Listen to it here.  —  Greg Sargent: This is The Daily Blast from The New Republic, produced and presented by the DSR network.",
    "url": "https://newrepublic.com/article/197676/transcript-trump-blurts-awkward-truth-ice-maga-seethes"
  },
  {
    "text": "Vacationing Ted Cruz's as ‘Fast as Humanly Possible’ Return Claim Crumbles  —  ACROPOL-OOPS  —  Cruz says he returned to Texas as quickly as he could after news of devastating floods broke.  Flight data tells a different story.  —  Ted Cruz could have booked numerous flights from Greece … ",
    "url": "https://www.thedailybeast.com/vacationing-ted-cruzs-as-fast-as-humanly-possible-return-claim-crumbles/"
  },
  {
    "text": "How Insularity Defined the Last Stages of Biden's Career … At the most perilous moment of his presidency, Joseph R. Biden Jr. was all but impossible for anyone outside his tight inner circle to reach.Eric Lee/The New York Times  —  Former President Joseph R. Biden Jr.'s aides did not want him to speak with me.",
    "url": "https://www.nytimes.com/2025/07/08/us/politics/biden-aides-election-age.html"
  },
  {
    "text": "FEMA response to deadly Texas floods delayed & deficient with Noem in charge  —  Staffers sound the alarm. … Disaster struck in Texas on July 4th when the Guadalupe River rapidly overflowed, resulting in lethal flash floods.  As of Monday, local officials said at least 104 were confirmed dead across six counties.",
    "url": "https://www.thehandbasket.co/p/fema-response-deadly-texas-floods-delayed-deficient-noem"
  },
  {
    "text": "Ex-NYPD chiefs sue Mayor Adams, top aides over alleged favoritism, corruption in department  —  Four high-ranking former NYPD chiefs are suing Mayor Adams, claiming they were forced to retire from the department after complaining that his “unqualified” friends were being placed … ",
    "url": "https://www.nydailynews.com/2025/07/08/ex-nypd-chiefs-sue-mayor-adams-top-aides-over-alleged-favoritism-corruption-in-department/"
  },
  {
    "text": "Trump on DOGE cuts: ‘I would have done it differently’ … Trump praised the Department of Government Efficiency for many of its cuts to the federal workforce, specifically citing the exodus at the Environmental Protection Agency, where more than 1,300 employees have left through the Trump administration's deferred resignation program.",
    "url": "https://www.politico.com/news/2025/07/08/trump-on-doge-cuts-i-would-have-done-it-differently-00442255"
  },
  {
    "text": "Alligator Alcatraz detainees allege inhumane conditions at immigration detention center  —  Cuban reggaeton artist Leamsy La Figura, arrested last week in Miami-Dade on assault charges, was transferred to South Florida's new immigration detention facility known as Alligator Alcatraz in the Everglades … ",
    "url": "https://www.cbsnews.com/miami/news/alligator-alcatraz-detainees-allege-inhumane-conditions-at-immigration-detention-center/"
  },
  {
    "text": "Major medical groups sue Health Secretary Robert F. Kennedy Jr. over vaccines  —  Kennedy's track record of undermining vaccine safety and effectiveness prompted the lawsuit.  “We've had enough,” one public health expert said.  —  Several major medical organizations are suing Health Secretary … ",
    "url": "https://www.nbcnews.com/health/health-news/rfk-jr-sued-pediatricians-medical-groups-covid-vaccines-rcna217218"
  },
  {
    "text": "TSA to End Shoe Removal Requirement at Airport Security Checkpoints  —  Most passengers had been required to remove their footwear at checkpoints since 2006, a policy later eased only for members of trusted traveler programs.  —  Travelers at some airports, including LaGuardia … ",
    "url": "https://www.nytimes.com/2025/07/07/travel/tsa-shoes-removal-airport-security.html"
  },
  {
    "text": "I.R.S. Says Churches Can Endorse Candidates From the Pulpit  —  In a court filing, the tax agency said a decades-old ban on campaigning by tax-exempt groups should not apply to houses of worship speaking to their own members.  —  The I.R.S. said on Monday that churches and other houses … ",
    "url": "https://www.nytimes.com/2025/07/07/us/politics/irs-churches-politics-endorse-candidates.html?unlocked_article_code=1.U08.vzbM.iyOIDMG2nBaU&smid=url-share"
  },
  {
    "text": "Trump Escalates Criticism of Putin After Restoring Arms Shipments to Ukraine  —  President Trump is increasingly suggesting that he believes his Russian counterpart had become an impediment to the peace deal he aims to make.  —  President Trump stepped up his criticism of President Vladimir V. Putin … ",
    "url": "https://www.nytimes.com/2025/07/08/us/politics/trump-putin-ukraine-weapons.html"
  },
  {
    "text": "Gabbard's team has sought spy agency data to enforce Trump's agenda  —  The Director's Initiative Group has expressed an interest in gaining access to emails and chat logs of the largest U.S. intelligence agencies to root out “weaponization,” according to multiple people familiar with the effort.",
    "url": "https://www.washingtonpost.com/national-security/2025/07/08/gabbard-dig-odni-weaponization-intelligence/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzUxOTQ3MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzUzMzI5NTk5LCJpYXQiOjE3NTE5NDcyMDAsImp0aSI6ImFmYjhjNDQ5LTc1NGUtNDY1NC04ZWE5LWVlYTMzNDM3YzkyMiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb25hbC1zZWN1cml0eS8yMDI1LzA3LzA4L2dhYmJhcmQtZGlnLW9kbmktd2VhcG9uaXphdGlvbi1pbnRlbGxpZ2VuY2UvIn0.7cdYrbt23E431Pjdhlelfx5i4jHkZ42yeoJFMPCZ6HA&itid=gfta"
  },
  {
    "text": "Bill would force ICE agents to ID themselves, ban most masks  —  Federal immigration agents would be banned from wearing most face coverings but be required to wear visible ID during public enforcement operations, according to a proposal from Democratic U.S. Sens. Alex Padilla (D-CA) and Cory Booker (D-NJ).",
    "url": "https://www.axios.com/2025/07/08/ice-agents-masks-democrats-id-bill"
  },
  {
    "text": "Texas flood exposed America's warped priorities  —  I've always believed there's a lifetime limit on excitement from fireworks — even on July 4 — and that I passed mine many years ago.  Maybe that's why I volunteered to pick up a family member at New York's JFK Airport last Friday night … ",
    "url": "https://www.inquirer.com/columnists/attytood/texas-flood-climate-change-camp-mystic-20250708.html"
  },
  {
    "text": "Exclusive: Top Trump Adviser Sergio Gor Was Born in the Soviet Union  —  The birthplace of U.S. President Donald Trump's director of personnel has been the subject of media speculation — fuelled by his refusal to answer the question. … When he was named director of the White House Office … ",
    "url": "https://www.occrp.org/en/news/exclusive-top-trump-advisor-sergio-gor-was-born-in-the-soviet-union"
  },
  {
    "text": "Alvarado ICE facility attack: 11 charged in ‘ambush’ on ICE officers, officials say  — 11 people have been arrested in what it calls a “planned ambush” on an ICE facility in Alvarado on July 4.  — Officials say 10-12 individuals in military-style clothing fired fireworks to lure officers out … ",
    "url": "https://www.fox4news.com/news/texas-ice-detention-center-attack-alvarado"
  },
  {
    "text": "Federal Agents March Through L.A. Park, Spurring Local Outrage  —  Federal officials said it was an immigration enforcement operation, though it was unclear if anyone had been arrested.  “It's the way a city looks before a coup,” Mayor Karen Bass said as she condemned the action.",
    "url": "https://www.nytimes.com/2025/07/07/us/la-macarthur-park-immigration.html?unlocked_article_code=1.U08.HIYe.Bru8LMI-LrEx&smid=url-share"
  },
  {
    "text": "Judge recommends that case against Wisconsin Judge Hannah Dugan proceed  —  A federal magistrate judge recommended Monday that the case proceed against a Wisconsin judge who was indicted on allegations that she helped a man who is in the country illegally evade U.S. immigration agents seeking to arrest him in her courthouse.",
    "url": "https://apnews.com/article/wisconsin-judge-arrested-immigration-trump-hannah-dugan-4886b1516116d11cd976c0fe6f4e278f"
  },
  {
    "text": "Who's Afraid of Zohran Mamdani?  —  To win the nomination for mayor, Zohran Mamdani outwitted and outworked the city's lethargic Democratic political Establishment.  And that seems to be driving the old guard mad.  —  Think of New York's Democratic Establishment as a network of political clubs … ",
    "url": "https://nymag.com/intelligencer/article/whos-afraid-of-zohran-mamdani.html"
  },
  {
    "text": "The Bleak Unifying Principle of This Supreme Court Term  —  It's an emergency whenever Trump says so. … On Thursday afternoon, the Supreme Court issued a brief order condemning eight migrants to banishment in South Sudan, where they face the very real possibility of torture and death.",
    "url": "https://slate.com/news-and-politics/2025/07/supreme-court-term-analysis-emergency-trump.html"
  },
  {
    "text": "CDC ends bird flu emergency  —  The Centers for Disease Control and Prevention (CDC) has ended its emergency response to the H5N1 avian flu.  —  A spokesperson for the Department of Health and Human Services (HHS) said that the emergency bird flu response was “deactivated to transition … ",
    "url": "https://thehill.com/policy/healthcare/5389863-cdc-ends-bird-flu-emergency/"
  },
  {
    "text": "How The New York Times is (still) getting gamed by the right … Lately, it has been difficult to ignore a tendency at The New York Times to make astonishingly bad news judgments.  The paper's obsession with a view from nowhere is long-standing, but as Republicans increasingly circulate … ",
    "url": "https://www.theverge.com/culture/700082/nyt-mamdani-news-judgment"
  },
  {
    "text": "Weeks after receiving Trump's endorsement, Pennsylvania Rep. Meuser opts against challenging Shapiro: Sources  —  Other Republicans are still in the mix for the race at the top of the ticket.  —  Rep. Dan Meuser leaves a meeting of the House Republican Conference at the Capitol Hill Club, June 10, 2025.",
    "url": "https://abcnews.go.com/Politics/weeks-after-receiving-trumps-endorsement-pennsylvania-rep-meuser/story?id=123579253"
  },
  {
    "text": "Trump's “tough cookie” call to Harris: New book “2024” on campaign aftermath … - “Phone service isn't what it used to be,” Trump quipped.  — “Aides ended up holding two phones together on speaker so that the rivals could talk,” the authors write.",
    "url": "https://www.axios.com/2025/07/08/campaign-book-2024-josh-dawsey-tyler-pager-isaac-arnsdorf-behind-scenes"
  },
  {
    "text": "60 Minutes Legend Tells Jon Stewart Paramount's $16 Million Trump Settlement Is a ‘Tribute to the King’  —  Longtime 60 Minutes correspondent Steve Kroft blasted Paramount's $16 million settlement with President Donald Trump as a “tribute to the king,” arguing that it had given in to a “shakedown.”",
    "url": "https://www.mediaite.com/media/60-minutes-legend-tells-jon-stewart-paramounts-16-million-trump-settlement-is-a-tribute-to-the-king/"
  }
]