[
  {
    "text": "Estimated Budgetary Effects of H.R. 1, the One Big Beautiful Bill Act  —  As passed by the House of Representatives on May 22, 2025  —  Estimated budgetary effects of H.R. 1, the One Big Beautiful Bill Act, as passed by the House of Representatives on May 22, 2025.",
    "url": "https://www.cbo.gov/publication/61461"
  },
  {
    "text": "Republicans Try to Discredit Experts Warning About the Cost of Tax Cuts … President Trump's allies were trying to discredit the findings of experts even before the new forecast that their signature legislation would add $2.4 trillion to the federal debt.Kenny Holston/The New York Times",
    "url": "https://www.nytimes.com/2025/06/04/us/politics/trump-budget-bill-republicans-tax-cuts.html?unlocked_article_code=1.MU8.evNn.1RAlPy5n0MYJ"
  },
  {
    "text": "Trump Is Losing Patience With Musk's Outbursts Over Megabill  —  Billionaire's attacks on Trump's tax bill are fraying his relationship with the president  —  WASHINGTON—President Trump is losing patience with Elon Musk after the billionaire attacked Republicans' sprawling tax-and-spending bill.",
    "url": "https://www.wsj.com/politics/policy/elon-musk-trump-tax-spending-republicans-5b779d6b?st=9sSzSr&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Columbia failed to meet accreditation standards, US government says  —  The U.S. Department of Education said on Wednesday it has notified a university accreditation body that Columbia University had violated federal anti-discrimination laws by its alleged failure to protect Jewish students on its campus.",
    "url": "https://www.reuters.com/world/us/us-education-department-says-columbia-university-violated-federal-anti-2025-06-04/"
  },
  {
    "text": "U.S. Department of Education Notifies Columbia University's Accreditor of Columbia's Title VI Violation  —  ED OCR and HHS OCR Found Columbia University Violated Federal Civil Rights Law  —  The U.S. Department of Education's Office for Civil Rights (OCR) today notified Middle States Commission … ",
    "url": "https://www.ed.gov/about/news/press-release/us-department-of-education-notifies-columbia-universitys-accreditor-of-columbias-title-vi-violation"
  },
  {
    "text": "Trump Officials Target Columbia Accreditation Over Pro-Palestine Protests  —  The Education Department said Columbia University no longer appeared to meet accreditation standards after concluding that the school is in violation of anti-discrimination laws, the latest effort by the Trump administration … ",
    "url": "https://www.bloomberg.com/news/articles/2025-06-04/white-house-threatens-columbia-s-accreditation-over-protests"
  },
  {
    "text": "Trump signs ban on entry from 12 countries, restrictions on 7 more  —  President Trump signed a proclamation to ban travel from certain countries on Wednesday evening, citing national security risks, administration officials told CBS News.  —  The ban will be targeted at specific countries, but will allow for exceptions.",
    "url": "https://www.cbsnews.com/news/trump-signs-travel-ban-multiple-countries/"
  },
  {
    "text": "Restricting The Entry of Foreign Nationals to Protect the United States from Foreign Terrorists and Other National Security and Public Safety Threats  —  BY THE PRESIDENT OF THE UNITED STATES OF AMERICA  —  During my first Administration, I restricted the entry of foreign nationals into the United States … ",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/06/restricting-the-entry-of-foreign-nationals-to-protect-the-united-states-from-foreign-terrorists-and-other-national-security-and-public-safety-threats/"
  },
  {
    "text": "Trump issues new multi-country travel ban  —  The president's executive order restricts bars people from 12 countries, while partially issuing restrictions against nationals from seven others.  —  President Donald Trump on Wednesday issued a sweeping new travel ban for people from several countries, citing national security risks.",
    "url": "https://www.politico.com/news/2025/06/04/trump-issues-new-multi-country-travel-ban-00388047"
  },
  {
    "text": "Trump Signs New Travel Ban on a Dozen Countries  —  He also placed partial travel restrictions on seven more nations.  — Copy  —  President Donald Trump on Wednesday signed an order banning travel from a dozen nations and partially restricting travel from seven more.",
    "url": "https://www.notus.org/trump-white-house/trump-travel-ban-sign"
  },
  {
    "text": "“The Intern in Charge”: Meet the 22-Year-Old Trump's Team Picked to Lead Terrorism Prevention  —  One year out of college and with no apparent national security expertise, Thomas Fugate is the Department of Homeland Security official tasked with overseeing the government's main hub for combating violent extremism.",
    "url": "https://www.propublica.org/article/trump-dhs-thomas-fugate-cp3-terrorism-prevention"
  },
  {
    "text": "Karine Jean-Pierre is leaving the Democratic Party.  Her former White House colleagues have some thoughts.  —  Several who worked alongside the former press secretary responded to her book announcement with derision and contempt.  —  Karine Jean-Pierre's announcement that she's leaving … ",
    "url": "https://www.politico.com/news/2025/06/04/karine-jean-pierre-leaving-democratic-party-00385060"
  },
  {
    "text": "‘Big Balls’ Is Officially a Full-Time Government Employee  —  The first wave of DOGE staffers was supposed to be gone after 130 days.  Instead, core members of the team have signed on for the long haul.  —  Although Elon Musk has said that he is largely exiting his role at the so-called Department … ",
    "url": "https://www.wired.com/story/big-balls-young-doge-converted-into-full-time-government-employees/"
  },
  {
    "text": "Publicly announced cancellations  —  N.I.H. grants, awarded in a competitive process, are typically paid out in installments.  A researcher with a $1 million four-year grant, for instance, will get about $250,000 a year.  Scientists can use this money to buy equipment and supplies and to pay … ",
    "url": "https://www.nytimes.com/interactive/2025/06/04/health/trump-cuts-nih-grants-research.html?unlocked_article_code=1.MU8.fooD.09Zw0Ce5H7UE&smid=nytcore-ios-share&referringSource=articleShare&sgrp=g"
  },
  {
    "text": "Trump calls for scrapping debt limit  —  President Trump on Wednesday doubled down on calls to scrap the nation's debt ceiling, pressing for bipartisan action to abolish it and finding common ground with Democrat Sen. Elizabeth Warren (Mass.).  —  “I am very pleased to announce that … ",
    "url": "https://thehill.com/homenews/administration/5332843-trump-calls-for-scrapping-debt-limit/"
  },
  {
    "text": "Economists Raise Questions About Quality of U.S. Inflation Data  —  Labor Department says staffing shortages reduced its ability to conduct its massive monthly survey  —  Some economists are beginning to question the accuracy of recent U.S. inflation data after the federal government … ",
    "url": "https://www.wsj.com/economy/cpi-inflation-data-accuracy-8bd2a8ae?st=2BJ3Ti"
  },
  {
    "text": "Trump officials delayed farm trade report over deficit forecast  —  Administration officials blocked publication of written analysis that normally accompanies the report because they disliked what it said about the deficit.  —  Trump administration officials delayed and redacted … ",
    "url": "https://www.politico.com/news/2025/06/04/trump-officials-farm-product-trade-deficit-forecast-00382549"
  },
  {
    "text": "Feds sue Texas over long-standing law allowing undocumented students to receive in-state tuition  —  The lawsuit comes just days after the Legislature adjourned without repealing the first-in-the-nation law, which passed in 2001.  —  The U.S. Department of Justice is suing Texas … ",
    "url": "https://www.texastribune.org/2025/06/04/texas-justice-department-lawsuit-undocumented-in-state-tuition/"
  },
  {
    "text": "Judge bars Trump administration from deporting family of Boulder attack suspect  —  A federal judge barred the Trump administration from deporting the wife and children of an Egyptian man accused of throwing Molotov cocktails at a pro-Israel demonstration in Colorado.",
    "url": "https://www.washingtonpost.com/immigration/2025/06/04/trump-boulder-family-deportation-colorado/"
  },
  {
    "text": "Guatemalan deportee arrives in US after judge orders Trump to facilitate return  —  A Guatemalan man who said he was deported to Mexico despite fearing he would be persecuted there was flown back to the United States on Wednesday after a judge ordered the Trump administration to facilitate his return, his lawyer said.",
    "url": "https://www.reuters.com/world/us/guatemalan-deportee-arrives-us-after-judge-orders-trump-facilitate-return-2025-06-04/"
  },
  {
    "text": "Top CDC covid vaccine adviser quits after RFK Jr. ended recommendations  —  Lakshmi Panagiotakopoulos said she could no longer help vulnerable people after officials removed recommendations to immunize children and pregnant women.  —  A top coronavirus vaccine adviser at the Centers … ",
    "url": "https://www.washingtonpost.com/health/2025/06/04/cdc-covid-vaccine-advisor-quits/"
  },
  {
    "text": "Trump launches investigation into whether Biden aides concealed alleged decline  —  The investigation will look into whether aides ‘conspired to deceive the public’ about his health.  —  President Donald Trump has ordered an investigation into whether aides to former President Joe Biden … ",
    "url": "https://www.politico.com/news/2025/06/04/trump-launches-investigation-into-whether-biden-aides-concealed-alleged-decline-00388025"
  },
  {
    "text": "Gov. Tim Walz backs transgender kids as Democrats grapple with debate over bans in sports  —  The Minnesota Democrat has been critical of other members of his party who are retreating at a time when the issue has become a political lightning rod nationally and in Minnesota.",
    "url": "https://www.startribune.com/gov-tim-walz-backs-transgender-kids-as-democrats-grapple-with-debate-over-sports-ban/601366472"
  },
  {
    "text": "Months after detaining 47 people accused of being Tren de Aragua in Austin, authorities offer no evidence of gang ties  —  People at the raided house say they rented it for a birthday party and deny any connection to the gang.  One man says law enforcement accused him of being in Tren de Aragua because of his tattoo.",
    "url": "https://www.texastribune.org/2025/06/04/texas-immigration-raid-hays-county-austin-venezuelan-gang/"
  },
  {
    "text": "After Delays and Public Blowback, Chapel Hill Board Votes Outside Meeting to Award Tenure  —  After faculty raised alarm over the board's delay on the decisions, trustees finally debated and voted by email.  A couple of them said they generally opposed tenure.",
    "url": "https://www.insidehighered.com/news/faculty-issues/tenure/2025/06/04/after-delay-chapel-hill-board-votes-award-tenure"
  },
  {
    "text": "Judge orders Trump administration to provide due process to some migrants deported to El Salvador  —  The ruling does not apply to Kilmar Abrego Garcia, the Salvadoran native who's deportation became a focal point of Democratic resistance to Trump's immigration policies.",
    "url": "https://www.nbcnews.com/politics/immigration/judge-orders-trump-administration-provide-due-process-migrants-deporte-rcna211059"
  }
]