[
  {
    "text": "First measles death is reported in the West Texas outbreak that's infected more than 120 people  —  A person who was hospitalized has died from measles in West Texas, the first death in an outbreak that began late last month.  Texas Tech University Health Sciences Center spokesperson Melissa Whitfield confirmed the death Wednesday.",
    "url": "https://apnews.com/article/measles-outbreak-west-texas-death-rfk-41adc66641e4a56ce2b2677480031ab9"
  },
  {
    "text": "RFK Jr. Has Horrific Response to Measles Death  —  An unvaccinated child in west Texas died of measles on Wednesday, marking the first time that someone has died from the viral illness in the U.S. in a decade.  —  So far, 18 people have been hospitalized for the disease around Lubbock … ",
    "url": "https://newrepublic.com/post/192025/robert-f-kennedy-jr-response-measles-death"
  },
  {
    "text": "Unvaccinated Child Dies of Measles in Texas Outbreak  —  At least 124 cases have been reported since late January, mostly among children and teenagers who were unvaccinated or whose vaccination status was unknown.  — 1.4k  —  A child has died of measles in West Texas … ",
    "url": "https://www.nytimes.com/2025/02/26/us/texas-measles-outbreak-death.html"
  },
  {
    "text": "Jeff Bezos' Directive for Washington Post Opinion Pages Leads to Editor David Shipley's Exit  —  David Shipley, The Post's opinion editor, is resigning after trying to persuade Jeff Bezos to reconsider the new direction.  — 1k  —  Jeff Bezos, the owner of The Washington Post … ",
    "url": "https://www.nytimes.com/2025/02/26/business/media/washington-post-bezos-shipley.html?unlocked_article_code=1.z04.AaIb.kaTV8X7xSNaN&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Legendary WaPo Editor Slams Bezos' ‘Disgusting’ MAGA Makeover  —  BETRAYAL  —  Former executive editor Marty Baron told the Daily Beast there was “no doubt in my mind” that Bezos was prioritizing his business interests over The Washington Post.",
    "url": "https://www.thedailybeast.com/ex-wapo-editor-marty-baron-sad-and-disgusted-at-bezos-opinions-overhaul/"
  },
  {
    "text": "Today I am ending my professional association with The Washington Post.  Since my decision to step down as senior managing editor in 2023, I have been privileged to work on contract as a senior associate editor, helping to oversee investigative projects and undertaking other tasks at the behest … ",
    "url": "https://www.linkedin.com/posts/cameron-barr-72093bb0_today-i-am-ending-my-professional-association-activity-7300598172819546112-TjW-"
  },
  {
    "text": "Trump and Musk's slash-and-burn tactics are a sticking point in talks to prevent a shutdown  —  Sen. Patty Murray, the top Democratic appropriator, urged Republicans to help stop Trump from usurping Congress' spending powers and not to “follow Elon towards a shutdown.”",
    "url": "https://www.nbcnews.com/politics/congress/trump-musk-tactics-sticking-point-government-shutdown-rcna193639"
  },
  {
    "text": "Senate Republicans say House budget won't fly with them  —  Tuesday's big win for Speaker Mike Johnson might not last long.  —  House Republicans spent weeks in painstaking negotiations before delivering a budget blueprint for “one big, beautiful bill.”  Now Senate Republicans are preparing to tear it apart.",
    "url": "https://www.politico.com/news/2025/02/26/senate-republicans-reject-house-budget-00206244"
  },
  {
    "text": "DOGE Staffers at HUD Are From an AI Real Estate Firm and a Mobile Home Operator  —  Elon Musk's men at HUD come from the real estate sector.  They have access to vast stores of personal and financial data—and control over who can access which HUD systems.  —  On February 10 … ",
    "url": "https://www.wired.com/story/doge-hud-systems-access-ai-proptech-real-estate-mobile-home/"
  },
  {
    "text": "Trump Press Sec Seethes at Media over Musk as More Bad Econ News Hits … At Tuesday's media briefing, White House press secretary Karoline Leavitt announced that the White House will now decide who attends briefings, an effort to insulate President Trump from tough scrutiny.",
    "url": "https://newrepublic.com/article/191984/trump-press-sec-seethes-media-musk-bad-econ-news-hits"
  },
  {
    "text": "DOGE reps will fan out across the government  —  Trump order requires every agency to have a direct line to Elon Musk's efficiency project.  —  All federal agencies will soon have their own Elon Musk.  —  An executive order handed down Wednesday by President Donald Trump directs all agencies … ",
    "url": "https://www.politico.com/news/2025/02/26/trump-order-federal-agencies-doge-representative-00206359"
  },
  {
    "text": "Musk claims DOGE ‘restored’ Ebola prevention effort.  Officials disagree.  —  USAID's initiatives to fight Ebola and other diseases have been gutted, current and former agency officials said  —  Elon Musk on Wednesday acknowledged that the U.S. DOGE Service “accidentally canceled” … ",
    "url": "https://www.washingtonpost.com/politics/2025/02/26/elon-musk-ebola-prevention-usaid-doge/"
  },
  {
    "text": "Social Security Administration Could Cut Half Its Workforce  —  Sources tell the Prospect that a meeting called for a 50 percent reduction in an agency that millions rely on for benefit implementation.  —  There are more than 1,200 Social Security field offices across the country.",
    "url": "https://prospect.org/health/social-security-administration-could-cut-half-its-workforce/"
  },
  {
    "text": "Trump administration cutting 90% of USAID foreign aid contracts, documents show  —  The Trump administration said Wednesday it is eliminating more than 90% of the U.S. Agency for International Development's foreign aid contracts and $60 billion in overall U.S. assistance around the world.",
    "url": "https://apnews.com/article/trump-usaid-foreign-aid-cuts-6292f48f8d4025bed0bf5c3e9d623c16"
  },
  {
    "text": "The Supreme Court is in “radical agreement” that a bizarre DEI rule needs to go  —  The proper term for a Supreme Court session where the justices hear verbal presentations by lawyers is an “oral argument,” but Wednesday's hearing in Ames v. Ohio Department of Youth Services hardly qualified as an argument.",
    "url": "https://www.vox.com/scotus/401450/supreme-court-ames-ohio-dei-background-circumstances"
  },
  {
    "text": "Justice Department tells judges it can't comply with court-ordered deadline to release frozen aid funding  —  In court filings, the DOJ contends it will take “weeks” to free the funding that a federal judge ordered to be released almost two weeks ago.  —  The Trump administration … ",
    "url": "https://www.nbcnews.com/politics/justice-department/justice-department-judges-cant-comply-deadline-usaid-funds-rcna193837"
  },
  {
    "text": "Musk's Ex-Twitter Workers Win Severance Over ‘Fork in the Road’ Email  — Ex-employees prevail in challenges to ‘Fork in the Road’ email  — Billionaire has Trump's support using similar tactics at DOGE  —  Former Twitter employees are scoring early victories in legal challenges … ",
    "url": "https://www.bloomberg.com/news/articles/2025-02-26/musk-s-ex-twitter-workers-win-severance-over-layoff-after-email?accessToken=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzb3VyY2UiOiJTdWJzY3JpYmVyR2lmdGVkQXJ0aWNsZSIsImlhdCI6MTc0MDU5Nzg2MywiZXhwIjoxNzQxMjAyNjYzLCJhcnRpY2xlSWQiOiJTUzdEVElEV0xVNjgwMCIsImJjb25uZWN0SWQiOiJGNDZBMzg1RkE3NTA0NTlCQTEzQ0MxNEZCRUU4ODRERiJ9.Oi3-5sm5GgXyKTCsXgMnap3zJSRZzWfZwVJW0Nr9iJo"
  },
  {
    "text": "Implementing the President's “Department of Government Efficiency” Cost Efficiency Initiative  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:  —  Section 1.  Purpose.  This order commences a transformation … ",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/02/implementing-the-presidents-department-of-government-efficiency-cost-efficiency-initiative/"
  },
  {
    "text": "Who Is the Anonymous Data Expert Telling Elon Which Cuts to Make?  —  Conservatives have used DataRepublican to spread misinformation about federal agencies.  She's been working at a tech firm that's battled the CFPB … The account, and its alleged findings of mismanaged government agency spending … ",
    "url": "https://www.rollingstone.com/politics/politics-features/elon-musk-data-republican-anonymous-data-expert-doge-tech-1235280817/"
  },
  {
    "text": "Elon Musk's business empire is built on $38 billion in government funding  —  Government infusions at key moments helped Tesla and SpaceX flourish, boosting Musk's wealth  —  Elon Musk and his cost-cutting U.S. DOGE Service team have been on a mission to trim government largesse.",
    "url": "https://www.washingtonpost.com/technology/interactive/2025/elon-musk-business-government-contracts-funding/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQwNTQ2MDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQxOTI0Nzk5LCJpYXQiOjE3NDA1NDYwMDAsImp0aSI6IjhhMjk0Y2FkLTNmYmEtNGQ1My05M2EyLTI0YWMzMzE0YjM0NyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS90ZWNobm9sb2d5L2ludGVyYWN0aXZlLzIwMjUvZWxvbi1tdXNrLWJ1c2luZXNzLWdvdmVybm1lbnQtY29udHJhY3RzLWZ1bmRpbmcvIn0.UyTYCuA-0TwC9Vi8zaD2o8wWdlGLS3GU1wZxGDSH58s&itid=gfta"
  },
  {
    "text": "Trump faces Truth Social backlash over AI video of Gaza with topless Netanyahu and bearded bellydancers  —  Users of president's own social media site criticise video showing reimagined Gaza featuring Trump and Israeli PM sipping cocktails  —  Donald Trump is facing a backlash … ",
    "url": "https://www.theguardian.com/us-news/2025/feb/26/backlash-trump-shares-ai-created-video-reimagined-gaza"
  },
  {
    "text": "F.D.A. Cancels Meeting of Vaccine Experts Scheduled to Advise on Flu Shots  —  The cancellation plays into fears among scientists who worry that Robert F. Kennedy Jr. will use his position as health secretary to sow doubts about vaccines.  —  A panel of scientific experts that advises … ",
    "url": "https://www.nytimes.com/2025/02/26/us/politics/fda-flu-vaccine.html?unlocked_article_code=1.0E4.BCg6.NQ9_8QTh2mFd&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "DOJ has abruptly broadened its view of Trump's Jan. 6 pardons.  A judge wants answers.  —  A Trump-appointed judge grilled a Justice Department prosecutor on the department's change in position.  —  Three weeks ago, the Justice Department was emphatic: Donald Trump may have pardoned Kentuckian Dan Wilson … ",
    "url": "https://www.politico.com/news/2025/02/26/trump-january-6-pardon-judge-00206301"
  },
  {
    "text": "Trump scraps Biden-era fair housing rule  —  Trump had weaponized an earlier version of the rule during the 2020 campaign, declaring that Democrats wanted to “abolish the suburbs.”  —  The Trump administration on Wednesday revoked a Biden-era fair housing proposed rule requiring localities … ",
    "url": "https://www.politico.com/news/2025/02/26/trump-scraps-fair-housing-initiative-00206274"
  },
  {
    "text": "Decline of Christianity in the U.S. Has Slowed, May Have Leveled Off  —  Findings from the 2023-24 Religious Landscape Study  —  Table of Contents Table of Contents  —  Findings from the 2023-24 Religious Landscape Study  —  Pew Research Center conducts the Religious Landscape Study … ",
    "url": "https://www.pewresearch.org/religion/2025/02/26/decline-of-christianity-in-the-us-has-slowed-may-have-leveled-off/"
  },
  {
    "text": "Trump's nominee for solicitor general won't rule out ignoring court orders in ‘extreme cases’  —  President Donald Trump's nominee to be solicitor general told the Senate Judiciary Committee Wednesday that presidents might rightfully defy court orders in “extreme cases.”",
    "url": "https://www.politico.com/live-updates/2025/02/26/congress/trumps-nominee-for-solicitor-general-00206266"
  },
  {
    "text": "DOGE barrels toward a fresh round of firings, the most widespread yet  —  Records show a Department of Labor component that enforces equal employment opportunity laws is developing a plan to reduce its workforce by 90 percent.  —  Elon Musk's U.S. DOGE Service is barreling toward a fresh round of firings … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2025/02/26/doge-federal-workforce-firings-job-cuts/"
  },
  {
    "text": "American Airlines flight from Boston aborts landing at D.C. airport to avoid departing plane  —  An American Airlines flight from Boston aborted its landing at Reagan National Airport in Washington, D.C. Tuesday morning to avoid another plane that was taking off on the same runway, authorities said.",
    "url": "https://www.cbsnews.com/boston/news/american-airlines-flight-boston-dc-aborted-landing/"
  },
  {
    "text": "Multimillion-dollar Biden-era COVID-19 vax project halted by Trump's HHS  —  FIRST ON FOX: Department of Health and Human Services Secretary Robert F. Kennedy Jr. has paused a multimillion-dollar contract from the Biden administration to create a new COVID-19 vaccine, Fox News Digital has learned.",
    "url": "https://www.aol.com/multimillion-dollar-biden-era-covid-222505162.html"
  },
  {
    "text": "RFK Dismisses Measles Outbreak That Killed Kid as No Biggie  —  “It is not unusual, we have measles outbreaks every year,” he claims.",
    "url": "https://www.thedailybeast.com/rfk-claims-measles-outbreak-that-killed-first-us-kid-in-decades-is-totally-normal/"
  },
  {
    "text": "Trump prepares to use controversial 1798 ‘Alien Enemies’ law to speed deportations  —  The Trump administration is preparing to invoke a sweeping wartime authority to speed up the president's mass deportation pledge, according to multiple sources familiar with the discussions.",
    "url": "https://www.cnn.com/2025/02/26/politics/trump-controversial-law-speed-deportations/"
  },
  {
    "text": "Economists are starting to worry about a serious Trump recession  —  Tariffs on America's neighbours and assault on federal government will hit US economy  —  Donald Trump's assault on the US federal government and the world's interlinked manufacturing system have together reached an economic tipping point.",
    "url": "https://www.telegraph.co.uk/business/2025/02/25/economists-starting-worry-serious-trump-recession/"
  },
  {
    "text": "Not known for political coverage, Wired takes a leading role in tracking Elon Musk's team  —  Shortly after becoming Wired's global editorial director in 2023, Katie Drummond acted on an early-morning idea.  With a presidential election coming, the tech-focused news outlet needed a team … ",
    "url": "https://apnews.com/article/elon-musk-wired-doge-trump-1f3988a459d39f39e7be6c598aa3d710"
  },
  {
    "text": "White House point man at Homeland Security shared ‘martial law option’ post to keep Trump in office  —  The Trump administration's new point man for dealings with the Department of Homeland Security is a former far-right podcast host and election denier who once shared an article calling for … ",
    "url": "https://www.cnn.com/2025/02/26/politics/paul-ingrassia-trump-administration-liaison-dhs-kfile/"
  },
  {
    "text": "White House bars AP, Reuters and other media from covering Trump cabinet meeting  —  The White House on Wednesday denied reporters from Reuters and other news organizations access to President Donald Trump's first cabinet meeting in keeping with the administration's new policy regarding media coverage.",
    "url": "https://www.reuters.com/world/us/white-house-bars-ap-reuters-other-media-covering-trump-cabinet-meeting-2025-02-26/"
  }
]