[
  {
    "text": "Exclusive: John Kelly goes on the record to confirm several disturbing stories about Trump  —  John Kelly, the longest-serving White House chief of staff for Donald Trump, offered his harshest criticism yet of the former president in an exclusive statement to CNN.",
    "url": "https://www.cnn.com/2023/10/02/politics/john-kelly-donald-trump-us-service-members-veterans/"
  },
  {
    "text": "John Bolton: It's ‘entirely possible’ Trump wants his supporters to kill Mark Milley  —  Former National Security Adviser John Bolton warned CNN's Jake Tapper on Monday that former President Donald Trump may actually want one of his followers to take matters into their own hands and mete … ",
    "url": "https://www.rawstory.com/trump-supporters-mark-milley/"
  },
  {
    "text": "New York Post pans Trump's ‘birdbrain’ attack on Haley  —  The editorial board of the New York Post dissed former President Trump after he attacked Nikki Haley, his former Ambassador to the United Nations and one of the candidates who is challenging him for the Republican nomination for president.",
    "url": "https://thehill.com/homenews/media/4234478-new-york-post-pans-trumps-birdbrain-attack-on-haley/"
  },
  {
    "text": "Trump says he would prefer to die by electrocution in bizarre campaign rant  —  Former president and frontrunner for the 2024 Republican nomination delivered the odd remarks during a speech in Iowa  —  Faced with a litany of criminal charges, Donald Trump on Sunday told a campaign rally … ",
    "url": "https://www.theguardian.com/us-news/2023/oct/02/donald-trump-electrocution-campaign-event-iowa"
  },
  {
    "text": "Trump fundraises off fraud trial: ‘Nothing can break me’  —  Former President Trump on Monday was quick to fundraise off of his fraud trial in New York after proceedings wrapped for the day.  —  Trump's campaign blasted out a fundraising email with a subject line of “I just left the courthouse” … ",
    "url": "https://thehill.com/homenews/campaign/4234676-trump-fundraises-off-fraud-trial-nothing-can-break-me/"
  },
  {
    "text": "Rep. Matt Gaetz files resolution to oust Kevin McCarthy as speaker of the House  —  Republican Rep. Matt Gaetz filed a resolution late Monday to oust Kevin McCarthy as speaker, setting up a likely showdown vote in the House in the days ahead.  The far-right Republican from Florida … ",
    "url": "https://apnews.com/article/kevin-mccarthy-matt-gaetz-speaker-vacate-congress-e7e5ccc6cf79ccbf5b4a7b73b9d5a3ae"
  },
  {
    "text": "Gaetz moves to oust Speaker McCarthy  —  Rep. Matt Gaetz (R-Fla.) on Monday moved to force a vote on ousting Speaker Kevin McCarthy (R-Calif.), following through with his pledge to do so after the Speaker put a “clean” continuing resolution (CR) to fund the government on the House floor.",
    "url": "https://thehill.com/homenews/house/4233982-gaetz-moves-to-oust-speaker-mccarthy/"
  },
  {
    "text": "Matt Gaetz files motion to oust Kevin McCarthy as House speaker  —  Rep. Matt Gaetz (R-Fla.) introduced a resolution Monday evening to remove Speaker Kevin McCarthy (R-Calif.) from his seat, triggering an expected intraparty clash and setting up a showdown for the House to decide whether to depose McCarthy likely within 48 hours.",
    "url": "https://www.washingtonpost.com/politics/2023/10/02/kevin-mccarthy-matt-gaetz/"
  },
  {
    "text": "Rep. Matt Gaetz triggers vote to oust Kevin McCarthy from speaker's office  —  Gaetz, a Florida Republican, is a conservative bomb thrower and top Trump ally on Capitol Hill.  —  Rep. Matt Gaetz, R-Fla., the Donald Trump ally and conservative bomb-thrower who has been a nagging thorn in leadership's side … ",
    "url": "https://www.nbcnews.com/politics/congress/rep-matt-gaetz-triggers-vote-oust-kevin-mccarthy-speakers-office-rcna118112"
  },
  {
    "text": "Democrats can't really save Kevin McCarthy  —  To become House speaker, Kevin McCarthy (R-Calif.) had to give away much of the store to a small group of House Republicans.  Less than nine months later, he could be looking for what's left to give Democrats if he wants to try to keep the job.",
    "url": "https://www.washingtonpost.com/politics/2023/10/02/democrats-cant-really-save-kevin-mccarthy/"
  },
  {
    "text": "Democrats Weigh Whether to Rescue McCarthy From G.O.P. Ouster Bid  —  Party officials said that without promises to address their policy priorities, the speaker should not count on Democratic votes to save him.  —  The hard-right threat to oust Speaker Kevin McCarthy from his post … ",
    "url": "https://www.nytimes.com/2023/10/02/us/politics/democrats-mccarthy-speaker.html"
  },
  {
    "text": "Putin's Pals Brag: Elon Musk ‘Really Is Our Agent!’  —  Kremlin propagandists are rejoicing after Congress omitted aid to Ukraine from its most recent government funding bill.  —  Russian experts have long predicted that it's only a matter of time before U.S. aid to Ukraine is jeopardized by war fatigue and domestic issues.",
    "url": "https://www.thedailybeast.com/russian-state-tv-brags-elon-musk-really-is-our-agent"
  },
  {
    "text": "EMILYs List Statements on Laphonza Butler's Appointment to the U.S. Senate  —  FOR IMMEDIATE RELEASE  —  WASHINGTON, D.C. - Today, in response to the news that Gov. Gavin Newsom will name EMILYs List President Laphonza Butler to the U.S. Senate from California, EMILYs List released the following statements:",
    "url": "https://emilyslist.org/news/emilys-list-statements-on-laphonza-butlers-appointment-to-the-u-s-senate/"
  },
  {
    "text": "Three in 10 Republicans don't think the Biden impeachment probe will be fair  —  Leaders of the House Republican conference would like Americans to be under the impression that the party's investigation into the possible impeachment of President Biden is a sober act, one undertaken solely … ",
    "url": "https://www.washingtonpost.com/politics/2023/10/02/biden-impeachment-inquiry-polling/"
  },
  {
    "text": "Clarence Thomas recuses himself as Supreme Court rejects ex-Trump lawyer John Eastman's appeal  —  Thomas, who is under fire over claims of ethical lapses, was criticized for not recusing himself from a separate Jan. 6-related case because his wife, Virginia “Ginni” Thomas … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/clarence-thomas-recuses-supreme-court-rejects-trump-lawyer-eastman-rcna117607"
  },
  {
    "text": "My Fellow Republicans: It's Time to Grow Up  —  Extremists in my party have threatened to try and remove Speaker Kevin McCarthy for relying on the votes of Democrats to keep the government open.  Some of them appear to be authoritarian separatists who reject pluralism … ",
    "url": "https://www.nytimes.com/2023/10/02/opinion/kevin-mccarthy-house-republicans-shutdown.html"
  },
  {
    "text": "Bowman camp slams ‘Nazi’ Republicans after fire alarm flap  —  Republicans have vowed to punish the progressive in the wake of the incident, with one member already introducing a motion to expel him from Congress.",
    "url": "https://www.politico.com/live-updates/2023/10/02/congress/bowmans-damage-control-00119493"
  },
  {
    "text": "Play it again, Sam  —  Inside Bankman-Fried's last year in the crypto game  —  Most of the people who went to work for Sam Bankman-Fried ended up in jobs for which they were not obviously qualified, and Natalie Tien was no exception.  She'd been raised in Taiwan by middle-class parents whose … ",
    "url": "https://www.washingtonpost.com/opinions/interactive/2023/michael-lewis-sam-bankman-fried-ftx-crypto/"
  },
  {
    "text": "Error in New York's Civil Fraud Case Against Trump Is Flagged by Industry Insiders, Who Say Valuation of Mar-a-Lago Cited by Judge Is Based on a Misunderstanding of Basic Real Estate Practice  —  Apparent mistake by Judge Engoron surfaces in his use of a Palm Beach County appraisal of Mar-a-Lago that … ",
    "url": "https://www.nysun.com/article/error-in-new-yorks-civil-fraud-case-against-trump-is-flagged-by-industry-insiders-who-say-valuation-of-mar-a-lago-cited-by-judge-is-based-on-a-misunderstanding-of-basic-real-estate-practice"
  },
  {
    "text": "Spartz says she'll consider resigning from Congress  —  Rep. Victoria Spartz (R-Ind.) announced that she'll consider resigning from her position if Congress does not create a debt commission by the end of this year.  —  “I've done many very difficult things being one woman standing many times … ",
    "url": "https://thehill.com/homenews/house/4234161-spartz-says-shell-consider-resigning-from-congress/"
  },
  {
    "text": "Elon Musk Hit With Lawsuit For Falsely Accusing Man Of Being Part Of Neo-Nazi Brawl  —  Ben Brody, 22, said he was forced to leave his home after Musk falsely accused him of being a federal agent pretending to be a neo-Nazi.  —  Elon Musk, the tech billionaire and far-right sympathizer … ",
    "url": "https://www.huffpost.com/entry/elon-musk-defamation-lawsuit-neo-nazi_n_65146bace4b05bd1c4d60d14"
  }
]