[
  {
    "text": "Trump's Middle East trip marked by potential private business conflicts  —  The Trump Organization has entered into real estate deals in all three countries Trump plans to visit this week.  —  President Donald Trump kicks off the first major international trip of his second term Tuesday … ",
    "url": "https://www.washingtonpost.com/politics/2025/05/13/trump-mideast-business-conflicts/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ3MTA4ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ4NDkxMTk5LCJpYXQiOjE3NDcxMDg4MDAsImp0aSI6Ijg3MDQ3NmRlLWQ1M2ItNGVmMy1iNmU4LWU0MjQyMmQ5YmJhNiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzA1LzEzL3RydW1wLW1pZGVhc3QtYnVzaW5lc3MtY29uZmxpY3RzLyJ9.rbl3fETbmtD-ylKDor0b_SjnpbkkdNpqaMy150eJuf8&itid=gfta"
  },
  {
    "text": "Trump's Plan to Take Jet From Qatar Heightens Corruption Concerns  —  The second Trump administration is blowing through limits on the mixing of public office and personal benefits.  —  阅读.体中文.閱讀.體中文.",
    "url": "https://www.nytimes.com/2025/05/12/us/trump-qatar-jet-plane.html?unlocked_article_code=1.G08._xec.MoeUlWNBwmQy&smid=url-share"
  },
  {
    "text": "Trump's gifted Qatari 747 would be a security problem, officials say  —  The luxury jet was moved five weeks ago to San Antonio International Airport, suggesting that preparations for improvements to the plane might already be underway.  —  President Donald Trump on Monday praised Qatar … ",
    "url": "https://www.washingtonpost.com/national-security/2025/05/12/trump-qatar-747-gift-security/"
  },
  {
    "text": "Trump's free plane is not so free  —  The Boeing aircraft that Qatar may give the president would require a pricy and complicated overhaul to serve as Air Force One.  —  President Donald Trump insists he's getting a “free, very expensive airplane” from Qatar's royal family.",
    "url": "https://www.politico.com/news/2025/05/12/trump-qatar-air-force-one-taxpayer-costs-00342299"
  },
  {
    "text": "May 12, 2025  —  The biggest news over the weekend was silence: the silence of Republicans.  They refused to disavow White House deputy chief of staff Stephen Miller's statement that the administration is looking at suspending the writ of habeas corpus, that is, essentially declaring martial law.",
    "url": "https://heathercoxrichardson.substack.com/p/may-12-2025"
  },
  {
    "text": "Donald Trump's gargantuan self-dealing  —  Federal ethics rules now seem little more than decoration  —  Unlock the White House Watch newsletter for free  —  Your guide to what Trump's second term means for Washington, business and the world  —  What can you give a person who already has everything?",
    "url": "https://www.ft.com/content/f1cf9453-8fc4-49d5-9781-e117f744c3c7"
  },
  {
    "text": "Exclusive: Biden aides discussed wheelchair use if he were re-elected, new book says  —  This story is adapted from the forthcoming book “Original Sin: President Biden's Decline, Its Cover-Up, and His Disastrous Choice to Run Again,” by CNN's Jake Tapper and Axios' Alex Thompson.",
    "url": "https://www.axios.com/2025/05/13/biden-book-wheelchair-2024-campaign-original-sin"
  },
  {
    "text": "The Congressional Budget Office Still Works  —  The nonpartisan CBO that scores legislation is giving an honest analysis of President Trump's “Big Beautiful Bill,” and that's a good thing.  —  On Sunday, House Republicans on the Energy and Commerce Committee released the details … ",
    "url": "https://washingtonmonthly.com/2025/05/13/the-congressional-budget-office-still-works/"
  },
  {
    "text": "MAGA Attacks Church Over Donald Trump Rebuke: ‘Funds MUST Be Pulled’  —  A firestorm has erupted on the American right after the Episcopal Church said it is refusing a directive from the federal government to help resettle white South Africans who were granted refugee status.  —  Why It Matters",
    "url": "https://www.newsweek.com/episcopal-church-south-africa-reguees-maga-2071393"
  },
  {
    "text": "The Great Trump Tariff Rollback  —  The President started a trade war with Adam Smith.  He lost.  —  Rarely has an economic policy been repudiated as soundly, and as quickly, as President Trump's Liberation Day tariffs—and by Mr. Trump's own hand.  Witness the agreement Monday morning … ",
    "url": "https://www.wsj.com/opinion/u-s-china-trade-deal-tariffs-donald-trump-xi-jinping-a561d16b?st=kXWx5w&reflink=mobilewebshare_permalink"
  },
  {
    "text": "Why I'm Resigning from Positions at the National Science Foundation and Library of Congress  —  Today, I am resigning from the National Science Board and the Library of Congress Scholars Council.  —  Even as the White House threatens the foundational tenets of constitutional democracy … ",
    "url": "https://time.com/7285045/resigning-national-science-foundation-library-congress/"
  },
  {
    "text": "D.N.C. Takes Step to Void Election of Hogg and Kenyatta as Vice Chairs  —  David Hogg has faced sharp criticism for his plan to fund challenges to incumbent Democrats, but a D.N.C. vote on Monday began with an earlier complaint about the procedures used in an internal party election.",
    "url": "https://www.nytimes.com/2025/05/12/us/politics/david-hogg-dnc-democrats.html"
  },
  {
    "text": "Republicans Target Federal Anti-Hunger Program as They Prepare Trump Tax Package  —  Limiting funding for SNAP could help defray the costs of President Trump's tax plans, but could result in millions of low-income families losing access to aid.  —  House Republicans on Monday proposed … ",
    "url": "https://www.nytimes.com/2025/05/12/us/politics/trump-taxes-snap-program.html"
  },
  {
    "text": "Rule of law is ‘endangered,’ chief justice says  —  Speaking at Georgetown Law, Chief Justice John Roberts denounced “ad hominem” criticism of the justices.  —  Chief Justice John Roberts described the rule of law as “endangered” and warned against “trashing the justices,” … ",
    "url": "https://www.politico.com/news/2025/05/12/chief-justice-roberts-speech-georgetown-00343406"
  },
  {
    "text": "Air Traffic Staffing Shortage Forces Delays at Newark Airport  —  The shortage on Monday forced the F.A.A. to delay flights to the busy airport for up to nearly seven hours, the latest problem to plague the airport.  —  As few as three air traffic controllers were scheduled to work … ",
    "url": "https://www.nytimes.com/2025/05/12/business/newark-airport-delays-staffing-shortage.html"
  },
  {
    "text": "RFK Jr. Swims in Washington Creek That Flows With Sewage and Bacteria  —  Robert F. Kennedy Jr., the health secretary, shared photos of himself and his grandchildren swimming in waters that handle sewer overflow.  —  Robert F. Kennedy Jr., the health secretary, posted photos on Sunday … ",
    "url": "https://www.nytimes.com/2025/05/12/us/politics/rfk-jr-rock-creek-bacteria.html"
  },
  {
    "text": "The Science I Would Be Doing if I Weren't in ICE Detention  —  When I moved to America from Russia to join a biology lab at Harvard Medical School in 2023, it felt as if I found my dream job.  America was a paradise for science.  Everything was flourishing.  There was freedom of discourse; conferences, seminars.",
    "url": "https://www.nytimes.com/2025/05/13/opinion/ice-detention-russian-scientist.html?unlocked_article_code=1.G08.LRTg.EZYpdd1G1Jus&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Elon Musk, Sam Altman and Other C.E.O.s Join Trump at U.S.-Saudi Lunch  —  Many of the executives — including representatives of four of the 10 biggest U.S. companies by market value — are seeking business from Saudi investors and a chance to lobby top Trump officials.",
    "url": "https://www.nytimes.com/2025/05/13/us/politics/trump-saudi-business-lunch-musk-altman.html"
  },
  {
    "text": "Why Trump Suddenly Declared Victory Over the Houthi Militia … President Trump has never bought into long-running military entanglements in the Middle East.Haiyun Jiang for The New York Times  —  When he approved a campaign to reopen shipping in the Red Sea by bombing the Houthi militant group … ",
    "url": "https://www.nytimes.com/2025/05/12/us/politics/trump-houthis-bombing.html?unlocked_article_code=1.G08.h2Tn.7vyvfE-XkZmY&smid=bs-share"
  },
  {
    "text": "Republicans Try to Cram Ban on AI Regulation Into Budget Reconciliation Bill  —  Republicans try to use the Budget Reconciliation bill to stop states from regulating AI entirely for 10 years.  —  Late last night, House Republicans introduced new language to the Budget Reconciliation bill … ",
    "url": "https://www.404media.co/republicans-try-to-cram-ban-on-ai-regulation-into-budget-reconciliation-bill/"
  },
  {
    "text": "Shame on the White House  —  If the White House wants to fire the librarian of Congress, it can.  But it was interesting to have recently had the experience of meeting this dynamic, dedicated person, and feeling so proud that she was our librarian of Congress, then reading the White House's sloppy … ",
    "url": "https://www.nytimes.com/2025/05/13/opinion/trump-firing-hayden.html?unlocked_article_code=1.G08.3IUt.2zZzIxqfwWG0&smid=url-share"
  },
  {
    "text": "As Foreign Tourists Stay Away, U.S. Could Lose $12.5 Billion This Year, Tourism Group Says  —  Border detentions and confusion over visas are deterring international visitors, according to the World Travel & Tourism Council, and the price tag for their hesitancy could be steep.",
    "url": "https://www.nytimes.com/2025/05/13/travel/united-states-international-visitors-decline.html"
  },
  {
    "text": "Elon Musk's Boring Company Is in Talks With Government Over Amtrak Project  —  The Federal Railroad Administration has brought in the tunneling company to see if it could help with a multibillion-dollar rail project.  —  The Federal Railroad Administration, the nation's railroad agency … ",
    "url": "https://www.nytimes.com/2025/05/12/technology/elon-musk-boring-company-amtrak.html"
  },
  {
    "text": "Avelo Airlines Faces Backlash for Aiding Trump's Deportation Campaign  —  The company, which serves airports in liberal cities on the coasts, has agreed to operate chartered flights for Immigration and Customs Enforcement.  —  In the four years since its first flight, Avelo Airlines … ",
    "url": "https://www.nytimes.com/2025/05/12/business/trump-deportation-flights-avelo-airlines.html"
  }
]