[
  {
    "text": "Trump Expected to Choose Brooke Rollins to Lead Agriculture Department  —  Rollins is a former domestic policy adviser to the president-elect  —  President-elect Donald Trump is expected to select Brooke Rollins, a former Trump administration policy adviser, to lead the Agriculture Department … ",
    "url": "https://www.wsj.com/politics/trump-expected-to-choose-brooke-rollins-to-lead-agriculture-department-50b6a3fd"
  },
  {
    "text": "Trump taps loyalist Rollins for USDA chief in surprise pick  —  President-elect Donald Trump has picked Brooke Rollins as his Agriculture secretary, after weeks of intense internal fighting over the role, according to two people familiar with the transition conversations.",
    "url": "https://www.politico.com/news/2024/11/23/trump-loyalist-brooke-rollins-usda-secretary-surprise-nomination-00191391"
  },
  {
    "text": "Behind the Curtain: Trump's liberal cabinet … - As Axios' Zachary Basu told you, Trump's Cabinet increasingly resembles a European-style coalition government, staffed with a dizzying array of ideological rivals united — for now — by a grand MAGA vision.",
    "url": "https://www.axios.com/2024/11/23/trump-liberal-cabinet-rfk-tulsi-gabbard-bessent"
  },
  {
    "text": "I Watched Orbán Destroy Hungary's Democracy.  Here's My Advice for the Trump Era.  —  To dismantle the machinery of autocracy, you first need to understand how it works.  —  Many believed that after his first term as president, Donald Trump would end up in the dustbin of history.",
    "url": "https://www.politico.com/news/magazine/2024/11/23/trump-autocrat-elections-00191281"
  },
  {
    "text": "Canada's top military commander calls out US senator for questioning a woman's role in combat  —  The first woman to command Canada's military called out a U.S. senator on Saturday for questioning the role of women in combat.  Gen. Jennie Carignan responded to comments made by Idaho Republican … ",
    "url": "https://apnews.com/article/woman-combat-canada-us-carignan-risch-23ad537fbfab4a63e41b5d4366f24d91"
  },
  {
    "text": "Trump AG Pick Pam Bondi Is About to Regret What She Just Signed Up For  —  Matt Gaetz's withdrawal from consideration as Donald Trump's attorney general is unquestionably a big victory for the rule of law.  But now that Trump has put forth Pam Bondi—the former Florida attorney general whose loyalty … ",
    "url": "https://newrepublic.com/article/188777/pam-bondi-trump-attorney-general-regret"
  },
  {
    "text": "Pete Hegseth's Army unit in Iraq was rocked by a war crimes case  —  Donald Trump's pick for defense secretary was not involved in the murder of detainees, but the formative experience appears to have influenced his advocacy for troops accused of war crimes.",
    "url": "https://www.washingtonpost.com/national-security/2024/11/23/pete-hegseth-army-iraq-war-crimes/"
  },
  {
    "text": "John Bolton Slams Trump Cabinet Pick Seb Gorka as a ‘Con Man’  —  NO CONFIDENCE  —  The former national security adviser called for a “full field FBI background investigation” into Gorka's academic credentials.  —  Never one to mince words, President-elect Donald Trump's former national … ",
    "url": "https://www.thedailybeast.com/john-bolton-slams-trumps-choice-of-con-man-seb-gorka-as-counterterrorism-director/"
  },
  {
    "text": "How Kamala Harris lost voters in the battlegrounds' biggest cities  —  In the swing states, turnout in the major cities trailed the rest of the state.  The drops weren't the same across neighborhoods, though.  —  Kamala Harris was banking on a robust turnout in Philadelphia … ",
    "url": "https://www.politico.com/news/2024/11/23/city-turnout-black-hispanic-neighborhoods-00191354"
  },
  {
    "text": "Trump fills out his team of randos  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  INTERACTIVE DATA DIVE — “Where Kamala Harris lost big city voters in the battlegrounds,” by Jessica Piper, Paroma Soni and Brakkton Booker: “Blue cities represent the core of the Democratic base. ...",
    "url": "https://www.politico.com/newsletters/playbook/2024/11/23/trump-fills-out-his-team-of-randos-00191387"
  },
  {
    "text": "Fox hosts, cable news regulars and entertainment pros: Trump is casting a made-for-TV Cabinet  —  A common thread weaves through many of Donald Trump's picks for his incoming administration, a quality the president-elect values as highly as loyalty and perhaps even more than conventional qualifications: a flair for television.",
    "url": "https://www.cnn.com/2024/11/23/politics/trump-tv-cabinet/"
  },
  {
    "text": "Trump Transition Updates: Cabinet Nearly Full With Flurry of Friday Picks  —  Where Things Stand  — President-elect Donald J. Trump picked Scott Bessent on Friday to serve as Treasury secretary, tapping a billionaire hedge fund manager to lead an economic agenda that is expected to be built around raising tariffs and cutting taxes.",
    "url": "https://www.nytimes.com/live/2024/11/22/us/trump-cabinet-news"
  },
  {
    "text": "Sharp elbows and raised voices: Inside Trump's bumpy transition  —  His freewheeling team has returned to the patterns of his first term in office — with shouting matches, expulsions from meetings and name-calling.  —  Donald Trump's attorney and adviser Boris Epshteyn showed up recently … ",
    "url": "https://www.washingtonpost.com/politics/2024/11/23/trump-team-rivals-mar-a-lago/"
  },
  {
    "text": "Giving Thanks to the Hands That Feed America: Immigrant Farmworkers  —  With the approach of Thanksgiving, when many families will be celebrating with food and gratitude, it's worth taking a moment to reflect on the people who help make Thanksgiving celebrations possible.",
    "url": "https://immigrationimpact.com/2024/11/22/giving-thanks-immigrant-farmworkers-feed-america/"
  },
  {
    "text": "Trump's deportation vow alarms Texas construction industry  —  Clear signals President-elect Donald Trump plans to make good on his campaign pledge to deport millions of undocumented immigrants in his second term has sparked concerns among some in Texas' business and economic sectors … ",
    "url": "https://www.npr.org/2024/11/23/g-s1-35465/trump-deportation-migrants-immigrants-texas-construction-industry-border-security"
  },
  {
    "text": "Supreme Court steps into fight over FCC's $8 billion subsidies for internet and phone services  —  The Supreme Court on Friday stepped into a major legal fight over the $8 billion a year the federal government spends to subsidize phone and internet services in schools, libraries and rural areas … ",
    "url": "https://apnews.com/article/supreme-court-fcc-subsidies-telecommunications-01fe0754c2bf71d17d34bde21a3825de"
  }
]