[
  {
    "text": "Exclusive: Meta kills DEI programs … - The moves come just three days after Meta ended many of its efforts to fact-check and police speech on Facebook, Instagram and Threads.  — The announcement also follows a host of public moves by tech companies and executives to align with the politics … ",
    "url": "https://www.axios.com/2025/01/10/meta-dei-programs-employees-trump"
  },
  {
    "text": "Read: Meta's memo to employees rolling back DEI programs",
    "url": "https://www.axios.com/2025/01/10/meta-dei-memo-employees-programs"
  },
  {
    "text": "Trump is planning 100 executive orders starting Day 1 on border, deportations and other priorities  —  President-elect Donald Trump is preparing more than 100 executive orders starting Day One of the new White House, in what amounts to a shock-and-awe campaign on border security, deportations and a rush of other policy priorities.",
    "url": "https://apnews.com/article/trump-day-one-border-executive-actions-30f78c3c983ae74555f281446fe22710"
  },
  {
    "text": "Trump's Hill weapon … - Miller has become instrumental as Senate GOP leader John Thune (R-S.D.) and House Speaker Mike Johnson (R-La.) haggle over how to pass MAGA priorities, fast.  — Miller also gets Congress: While he initially called for a two-bill approach to immigration and tax reform … ",
    "url": "https://www.axios.com/2025/01/10/trump-stephen-miller-congress-immigration"
  },
  {
    "text": "Biden Issues Sweeping Deportation Protections Before Trump Takes Office  —  The move allows hundreds of thousands of people from Sudan, Ukraine and Venezuela to stay in the country temporarily.  —  The Biden administration on Friday issued sweeping extensions of deportation protections … ",
    "url": "https://www.nytimes.com/2025/01/10/us/politics/biden-temporary-protected-status-immigration.html"
  },
  {
    "text": "Meta Deletes Trans and Nonbinary Messenger Themes  —  Meta deleted nonbinary and trans themes for its Messenger app this week, around the same time that the company announced it would change its rules to allow users to declare that LGBTQ+ people are “mentally ill,” 404 Media has learned.",
    "url": "https://www.404media.co/meta-deletes-trans-and-nonbinary-messenger-themes/"
  },
  {
    "text": "Inside Mark Zuckerberg's Sprint to Remake Meta for the Trump Era  —  After visiting President-elect Donald J. Trump in November, Mr. Zuckerberg decided to relax Meta's speech policies.  He asked a small team to carry out his goals within weeks.  The repercussions are just beginning.",
    "url": "https://www.nytimes.com/2025/01/10/technology/meta-mark-zuckerberg-trump.html?unlocked_article_code=1.oE4.jwD6.Qu-_MhilMnvv&smid=url-share"
  },
  {
    "text": "Rudy Giuliani held in contempt for second time this week  —  Federal judge rips into Guiliani over “fabricated lies.”  —  A federal judge has held Rudy Giuliani in contempt for continuing to falsely accuse two Georgia women of election fraud in 2020, breaching a court order against further attacking … ",
    "url": "https://www.politico.com/news/2025/01/10/rudy-giuliani-contempt-second-time-defamation-case-00197627"
  },
  {
    "text": "Federal judge slams Rudy Giuliani as ‘outrageous and shameful’ as she holds him in contempt in 2020 election defamation case  —  Rudy Giuliani has been held in contempt of court for the second time in a week, as the former New York mayor and top Donald Trump lawyer's fall from grace continues … ",
    "url": "https://www.cnn.com/2025/01/10/politics/rudy-giuliani-contempt-hearing-defamation-case"
  },
  {
    "text": "State to probe why Pacific Palisades reservoir was offline, empty when firestorm exploded  —  A large reservoir in Pacific Palisades that is part of the Los Angeles water supply system was out of use when a ferocious wildfire destroyed thousands of homes and other structures nearby, the Los Angeles Times found.",
    "url": "https://www.latimes.com/california/story/2025-01-10/as-flames-raged-in-palisades-a-key-reservoir-nearby-was-offline"
  },
  {
    "text": "Live Updates: Trump to Be Sentenced in N.Y. Criminal Case  —  The proceedings are set to begin at 9:30 a.m. in Manhattan.  Though the president-elect is expected to avoid jail time, his sentencing on 34 counts will formalize his status as a felon and make him the first to carry that distinction into the White House.",
    "url": "https://www.nytimes.com/live/2025/01/10/nyregion/trump-hush-money-sentencing?unlocked_article_code=1.oE4.Lfvj.59La0Pj1ELhH&smid=url-share"
  },
  {
    "text": "House GOP puts Medicaid, ACA, climate measures on chopping block  —  The menu of potential spending offsets has been circulated by House Budget Chair Jodey Arrington.  —  House Republicans are passing around a “menu” of more than $5 trillion in cuts they could use to bankroll President-elect … ",
    "url": "https://www.politico.com/news/2025/01/10/spending-cuts-house-gop-reconciliation-medicaid-00197541"
  },
  {
    "text": "Leaked memo reveals LA Mayor Karen Bass demanded her fire department cut an extra $49 million just ONE WEEK before wildfires broke out  —  Los Angeles Mayor Karen Bass demanded her Fire Department make an extra $49million of budget cuts last week, a leaked memo revealed.",
    "url": "https://www.dailymail.co.uk/news/article-14271021/los-angeles-mayor-karen-bass-fires-department-budget-cuts.html"
  },
  {
    "text": "ICE warns Laken Riley Act could force it to release detained migrants … - ICE warned that without emergency funding, they could be forced to release tens of thousands of immigrants — including potentially some deemed to be public safety threats. … - ICE currently only has funding for 42,000 detention beds.",
    "url": "https://www.axios.com/2025/01/10/laken-riley-act-ice-detentions-beds"
  },
  {
    "text": "Will Trump Just Let California Burn?  —  Right now, as Los Angeles deals with a horrendous wildfire emergency, Donald Trump is just an extremely unhelpful critic of the people trying to save lives and homes.  The torrent of abuse and misinformation he is spewing is unfortunate but not calamitous.",
    "url": "https://nymag.com/intelligencer/article/will-trump-just-let-california-burn.html"
  },
  {
    "text": "DOGE is dispatching agents across U.S. government  —  Federal officials are already dealing with surrogates from Elon Musk and Vivek Ramaswamy's nongovernmental body before Donald Trump is sworn in again.  —  Elon Musk and Vivek Ramaswamy are sending representatives to agencies across … ",
    "url": "https://www.washingtonpost.com/business/2025/01/10/musk-ramaswamy-doge-federal-agencies/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM2NDg1MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM3ODY3NTk5LCJpYXQiOjE3MzY0ODUyMDAsImp0aSI6ImRhY2Q0MmI5LWM5NjEtNGM1ZS05YWU4LWNiNTBlNjM3NTI0NyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9idXNpbmVzcy8yMDI1LzAxLzEwL211c2stcmFtYXN3YW15LWRvZ2UtZmVkZXJhbC1hZ2VuY2llcy8ifQ.SPfFh8QQmh7CW5xnX93Txv0_sUOA_AFxK_KUkCFRgO4&itid=gfta"
  },
  {
    "text": "Supreme Court to weigh reinstating Obamacare care requirements struck down by lower court  —  The Supreme Court agreed Friday to consider reinstating some preventative care coverage requirements under the Affordable Care Act that were struck down by a lower court.",
    "url": "https://apnews.com/article/affordable-care-act-preventative-care-supreme-court-3225f11fbb02f83dd29335d2c34885bb"
  },
  {
    "text": "Trump can still vote after sentencing, but can't own a gun and will have to turn over DNA sample  —  President-elect Donald Trump doesn't have to go to jail, pay a fine or perform community service as a result of his New York hush money conviction.  A judge ended the case Friday with a sentence … ",
    "url": "https://apnews.com/article/trump-hush-money-felon-rights-708d782fe985f2c08d7b82ef13f17dd9"
  },
  {
    "text": "The Trumps Are in Talks to Reclaim Their Prized D.C. Hotel  —  The family firm is looking for a hotel in the capital as Trump prepares to return to the White House  —  Donald Trump's real-estate company is in talks to reclaim its former Washington, D.C., hotel, a move that could offer … ",
    "url": "https://www.wsj.com/real-estate/trump-dc-hotel-sale-white-house-return-0a4ba019?st=qa9Bfg&reflink=article_copyURL_share"
  },
  {
    "text": "Drone collides with firefighting plane during Los Angeles wildfires  —  A drone crashed into a firefighting aircraft near the California Palisades fire Thursday, the Federal Aviation Administration announced.  —  The aircraft landed safely but sustained wing damage, and it is out of service.",
    "url": "https://www.washingtonexaminer.com/policy/energy-and-environment/3283207/drone-collides-firefighting-plane-los-angeles-wildfires/"
  },
  {
    "text": "Key senators receive Pete Hegseth's FBI background check days out from confirmation hearing  —  Democrats have expressed concern over the delay and how thorough the report on Trump's embattled defense secretary pick will be.  —  WASHINGTON — An FBI background check for Pete Hegseth … ",
    "url": "https://www.nbcnews.com/politics/congress/senators-receive-pete-hegseths-fbi-background-check-days-rcna187035"
  },
  {
    "text": "Vince McMahon, SEC reach $1.7M settlement over hush money payments  —  World Wrestling Entertainment (WWE) co-founder Vince McMahon reached a settlement with the Securities and Exchange Commission (SEC) on Friday for failing to disclose two payments made on behalf of himself and the company.",
    "url": "https://thehill.com/business/5080048-vince-mcmahon-sec-reach-1-7m-settlement-over-hush-money-payments/"
  },
  {
    "text": "Biden's legacy as president  —  In his final weeks in the White House, 39% approve of how Biden is handling his job.  Compared to his predecessors, fewer say he was a great or good president. … As President Biden prepares to leave the White House, only a quarter of the public view him as a great or good president.",
    "url": "https://apnorc.org/projects/bidens-legacy-as-president/"
  },
  {
    "text": "The 119th Congress opens to AI, SCOTUS dances around TikTok, and a celebration of the OGFAC  —  Good evening from Washington, where more snow is inbound later tonight.  If you're receiving this newsletter, it's because you subscribed to Civic Texts: so glad to see more of you in this new year!",
    "url": "https://civic-texts.ghost.io/119th-congress-ai-scotus-tiktok-ogfac/"
  },
  {
    "text": "The Architects Of L.A.'s Wildfire Devastation  —  Back in 2019, a California state climate task force issued a stark warning: Endless development in the state's high-risk wildfire zones was magnifying wildfires and putting more people in their path.  —  It was a call that has echoed … ",
    "url": "https://www.levernews.com/the-architects-of-l-a-s-wildfire-devastation/"
  },
  {
    "text": "We've Never Been Here Before: The Zero-Accountability Presidency … So here we are, at another one of those Trump moments that by now can only be called boringly surreal: The president-elect was sentenced Friday in New York in the hush-money trial, 10 days before taking the oath of office.",
    "url": "https://newrepublic.com/post/190086/trump-zero-accountability-presidency"
  }
]