[
  {
    "text": "Invocation of the Alien Enemies Act Regarding the Invasion of The United States by Tren De Aragua  —  BY THE PRESIDENT OF THE UNITED STATES OF AMERICA  —  Tren de Aragua (TdA) is a designated Foreign Terrorist Organization with thousands of members, many of whom have unlawfully infiltrated … ",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/03/invocation-of-the-alien-enemies-act-regarding-the-invasion-of-the-united-states-by-tren-de-aragua/"
  },
  {
    "text": "Court blocks deportations hours after Trump says he invoked Alien Enemies Act  —  A little before 7:00 p.m. Saturday, a federal judge issued an order temporarily stopping deportations set in motion by President Donald Trump hours earlier when he announced that he had invoked a law last used to justify Japanese internment camps.",
    "url": "https://www.lawdork.com/p/alien-enemies-act-venezuela-tro"
  },
  {
    "text": "Trump invokes 18th century law to speed deportations, judge stalls it hours later  —  A federal judge barred the Trump administration Saturday from carrying out deportations under a sweeping 18th century law that the president invoked hours earlier to speed removal of Venezuelan gang members from the United States.",
    "url": "https://apnews.com/article/trump-aclu-deportations-venezuelans-b2566f05b10bf1cde1caf467a3b001cc"
  },
  {
    "text": "Democratic Party hits new polling low, while its voters want to fight Trump harder  —  Unlike in Trump's first term, Democratic voters say 2-to-1 they want party leaders to fight rather than compromise, even at the risk of not getting things done, per the NBC News poll.",
    "url": "https://www.nbcnews.com/politics/politics-news/democratic-party-hits-new-polling-low-voters-want-fight-trump-harder-rcna196161"
  },
  {
    "text": "CNN Poll: Democratic Party's favorability drops to a record low  —  The Democratic Party's favorability rating among Americans stands at a record low, according to a new CNN poll conducted by SSRS, fueled in part by dimming views from its own frustrated supporters.",
    "url": "https://www.cnn.com/2025/03/16/politics/cnn-poll-democrats"
  },
  {
    "text": "Poll: Trump faces early challenges on the economy as a united GOP backs big change  —  A new NBC News poll shows Trump with a job approval rating as high as he's ever had.  But doubts loom in voters' minds, especially over the economy and government cuts.  —  Voters are starting 2025 sour … ",
    "url": "https://www.nbcnews.com/politics/trump-administration/poll-trump-faces-early-challenges-economy-united-gop-backs-big-change-rcna195860"
  },
  {
    "text": "Trump signs order to gut staff at Voice of America and other US-funded media organizations  —  President Donald Trump's administration on Saturday began making deep cuts to Voice of America and other government-run, pro-democracy programming, with the organization's director saying all VOA employees have been put on leave.",
    "url": "https://apnews.com/article/trump-voice-of-america-cuts-3faf72e620dbc5f42e5508a2b9d8c8da"
  },
  {
    "text": "He voted for Trump.  Now his wife sits in an ICE detention center.  —  Bradley Bartell and Camila Muñoz had a familiar small-town love story, before they collided with immigration politics.  —  They met through mutual friends, had a first date at the local steakhouse … ",
    "url": "https://www.usatoday.com/story/news/nation/2025/03/16/mass-deportation-ice-detains-non-criminals/82304354007/"
  },
  {
    "text": "Chuck Schumer on Democrats, Antisemitism and His Shutdown Retreat  —  Philip Montgomery for The New York Times  —  It has been quite a week for Chuck Schumer.  When I spoke to the Senate minority leader on Monday, we talked about a lot of things: the direction of his party … ",
    "url": "https://www.nytimes.com/2025/03/16/magazine/chuck-schumer-interview.html"
  },
  {
    "text": "A Title VI Demand Letter That Itself Violates Title VI (and the Constitution)  —  By Kate Andrias, Jessica Bulman-Pozen, Jamal Greene, Olatunde Johnson, Jeremy Kessler, Gillian Metzger, and David Pozen  —  On Thursday, the president of Columbia University received a remarkable letter … ",
    "url": "https://balkin.blogspot.com/2025/03/a-title-vi-demand-letter-that-itself.html"
  },
  {
    "text": "Trade War Retaliation Will Hit Trump Voters Hardest  —  The counties where tariffs could hit jobs, by presidential vote winner  —  Source: New York Times analysis of data from Lightcast and the Bureau of Labor Statistics' Quarterly Census of Employment and Wages.  Note: Vote results are for the 2024 U.S. presidential election.",
    "url": "https://www.nytimes.com/interactive/2025/03/15/business/economy/tariffs-trump-maps-voters.html?unlocked_article_code=1.4U4.ttEE.d5kGMuP3mV8b&smid=url-share"
  },
  {
    "text": "Trump's Moves Are Boosting Stocks ... Overseas  —  For years, the S&P 500 soared above the stock indexes of other countries.  But since Trump's inauguration, it has fallen 6 percent and is now trailing major markets in Europe and China.  —  President Trump has promised to create an age … ",
    "url": "https://www.nytimes.com/2025/03/16/business/trump-sp-500-stocks-europe-china.html"
  },
  {
    "text": "‘Maga since forever’: mercenary mogul Erik Prince pushes to privatize Trump deportation plans  —  Notorious Blackwater founder is lobbying allies in White House for private contractors to assist in mass deportations  — Never miss global breaking news.  Download our free app to keep up with key stories in real time.",
    "url": "https://www.theguardian.com/us-news/2025/mar/16/erik-prince-trump-immigration-enforcement"
  },
  {
    "text": "Angst pervades a pair of Republican town halls — one in Trump country, the other in a swing state  —  In two congressional districts and vastly different political environments, two Republican congressmen were met with far different reactions at public meetings they held late last week.",
    "url": "https://apnews.com/article/republican-town-halls-north-carolina-wyoming-c63270c2da6973a078982baa9717f42e"
  },
  {
    "text": "Brown Medicine doctor deported despite federal court order.  What we know.  —  A federal court order that would have halted the immediate deportation of a Rhode Island doctor was issued Friday evening while the doctor's departing plane sat on the tarmac at Boston Logan International Airport, said a family friend and colleague.",
    "url": "https://www.providencejournal.com/story/news/local/2025/03/15/rhode-island-doctor-rasha-alawieh-deported-despite-federal-court-order/82441360007/"
  },
  {
    "text": "Were companies ever serious about DEI?  —  The buzzwords “diversity, equity, and inclusion” are everywhere right now, but you can't be blamed if you don't quite have a handle on what they mean.  —  The origins of DEI date back to the civil rights era — but recently “DEI” … ",
    "url": "https://www.vox.com/explain-it-to-me/404013/dei-policies-companies-business"
  },
  {
    "text": "Trump orders strikes on Iran-backed Houthi rebels in Yemen and issues new warning  —  President Donald Trump said he ordered a series of airstrikes on the Houthi-held areas in Yemen on Saturday, promising to use “overwhelming lethal force” until the Iran-backed rebels cease their attacks on shipping along a vital maritime corridor.",
    "url": "https://apnews.com/article/trump-yemen-houthis-rebels-attack-airstrike-11b0e080b3982542dd621338a7b18afd"
  }
]