[
  {
    "text": "Trump Has a Master Plan for Destroying the ‘Deep State’  —  I study government bureaucracies.  This is not normally a key political issue.  Right now, it is, and everyone should be paying attention.  —  Donald Trump, the former president and current candidate, puts it in apocalyptic terms … ",
    "url": "https://www.nytimes.com/2023/11/27/opinion/trump-deep-state-schedule-f.html"
  },
  {
    "text": "Trump is fighting an uphill battle in his fraud trial.  But it could be years before penalties kick in.  —  A verdict is expected in December.  Here's how the case is going — and what comes next.  —  NEW YORK — Two months into Donald Trump's civil fraud trial, the case does not seem to be going well for him.",
    "url": "https://www.politico.com/news/2023/11/27/trump-civil-fraud-trial-penalties-00128639"
  },
  {
    "text": "With Trump moving closer to renomination, rewriting Jan. 6 attack gains urgency  —  There is no mystery about the Capitol riot.  There is nothing intangible, no unseen engine for what occurred.  There is no uncertainty about what happened and why.  —  But because everything about what unfolded … ",
    "url": "https://www.washingtonpost.com/politics/2023/11/27/jan6-donald-trump-truth-lies/"
  },
  {
    "text": "Trump hints at expanded role for the military within the US.  A legacy law gives him few guardrails  —  Campaigning in Iowa this year, Donald Trump said he was prevented during his presidency from using the military to quell violence in primarily Democratic cities and states.",
    "url": "https://apnews.com/article/trump-military-insurrection-act-2024-election-03858b6291e4721991b5a18c2dfb3c36"
  },
  {
    "text": "‘This guy is a charlatan’: University of Florida turns against Joe Ladapo  —  Colleagues say the state surgeon general rarely is on campus and has “sullied” the reputation of the flagship school.  —  TALLAHASSEE, Fla. — Professors at the University of Florida had high hopes for Joseph Ladapo.",
    "url": "https://www.politico.com/news/2023/11/27/joe-ladapo-university-of-florida-00128541"
  },
  {
    "text": "Matt Gaetz Is Miraculously More Hated Than Ever in Congress  —  And that's saying something for a man who was under FBI investigation for allegedly sex-trafficking a minor. … In this unsettled moment on Capitol Hill, truth is relative, chaos reigns, and virtually nothing is for certain.",
    "url": "https://www.thedailybeast.com/matt-gaetz-is-miraculously-more-hated-than-ever-in-congress"
  },
  {
    "text": "Matt Gaetz is 2023's ‘Politician of the Year’  —  Two numbers define the last year in politics.  The first is 15, for the 15 votes it took in January to confirm a Republican Speaker of the House.  The second is three, for when the House shut down in October for three weeks … ",
    "url": "https://thehill.com/opinion/campaign/4326000-matt-gaetz-is-the-2023-politician-of-the-year/"
  },
  {
    "text": "Donations to GOP drop as worries mount about the party's finances  —  Donors have not cut as many large checks to the RNC in recent years, and the party's small-dollar program has also suffered  —  The Republican Party's finances are increasingly worrisome to party members … ",
    "url": "https://www.washingtonpost.com/politics/2023/11/27/republican-party-finances-election/"
  },
  {
    "text": "COP28: UAE planned to use climate talks to make oil deals  —  The United Arab Emirates planned to use its role as the host of UN climate talks as an opportunity to strike oil and gas deals, the BBC has learned.  —  Leaked briefing documents reveal plans to discuss fossil fuel deals with 15 nations.",
    "url": "https://www.bbc.com/news/science-environment-67508331"
  },
  {
    "text": "Man pleads not guilty in shooting of 3 Palestinian American students in Vermont  —  The man accused of shooting three Palestinian American students in Vermont pleaded not guilty to charges at an arraignment hearing Monday.  —  Jason Eaton, 48, appeared in court virtually … ",
    "url": "https://thehill.com/homenews/state-watch/4328958-vermont-shooting-palestinian-american-students-man-charged/"
  },
  {
    "text": "Trump Rallies Aren't Even Really About Politics at This Point  —  Ron DeSantis and Nikki Haley have partisans.  Donald Trump has fans.  —  For all of Donald Trump's rhetorical innovations, personality quirks, and alleged criminal malfeasance, what has made him truly unique as a political figure … ",
    "url": "https://slate.com/news-and-politics/2023/11/trump-rallies-2024-presidential-campaign-biden-desantis-haley.html"
  },
  {
    "text": "We Spied on Trump's ‘Southern White House’ From Our Couches  —  Tracking people in-and-out of Mar-a-Lago was easy, thanks to commercial software.  Think your privacy is any better protected?  —  SPYING ON PRESIDENTS used to be a tough business.  One of the great unsung heroes of American history … ",
    "url": "https://www.rollingstone.com/culture/culture-features/data-brokers-trump-tech-spying-privacy-threat-1234897098/"
  },
  {
    "text": "Netanyahu Welcomes Elon Musk to Israel After Antisemitic Post  —  The editor of the Israeli newspaper Haaretz bashed the prime minister for giving the “blatant antisemite” X owner a “PR visit”  —  DAYS AFTER ENDORSING an antisemitic conspiracy theory on X, Elon Musk flew to Israel to meet … ",
    "url": "https://www.rollingstone.com/politics/politics-news/netanyahu-elon-musk-israel-kibbtz-tour-antisemitic-post-1234898183/"
  },
  {
    "text": "Why Biden's Weakness Among Young Voters Should Be Taken Seriously  —  Almost all the polling shows the same pattern.  Could the coming campaign restore Democrats' usual advantage?  —  Could President Biden and Donald J. Trump really be locked in a close race among young voters … ",
    "url": "https://www.nytimes.com/2023/11/27/upshot/poll-biden-young-voters.html"
  }
]