[
  {
    "text": "Vance Boelter taken into custody in lawmaker shootings in Minnesota  —  Vance Boelter, the man who authorities believe shot two Minnesota lawmakers and their spouses in politically motivated shootings early Saturday morning, is now in custody.  —  Multiple sources told WCCO on Sunday evening that Boelter … ",
    "url": "https://www.cbsnews.com/minnesota/news/vance-boelter-taken-into-custody-minnesota-lawmaker-shootings-sources/"
  },
  {
    "text": "How a manhunt works, according to security experts.  —  Police officers converged on an area where investigators said they found a vehicle belonging to the suspect in the shootings of two state lawmakers.  An emergency alert urged caution after officials said the man should be considered armed and dangerous.",
    "url": "https://www.nytimes.com/live/2025/06/15/us/minnesota-shootings-manhunt"
  },
  {
    "text": "Live: Dozens of officers and K-9s search woods near assassination suspect's abandoned car  —  (Jeff Wheeler/The Minnesota Star Tribune)  —  Officials asked the public for help finding suspect Vance Boelter. … Minnesota was on edge Sunday after House Democratic leader Melissa Hortman … ",
    "url": "https://www.startribune.com/melissa-hortman-shooting-vance-boelter-suspect/601373342"
  },
  {
    "text": "Suspect in Minnesota Lawmaker Killing Arrested After Manhunt  —  Vance Luther Boelter is taken into custody after two-day search  —  A man suspected of shooting two state Democratic lawmakers was arrested late Sunday after authorities tracked him into an area with crops and woodlands in rural Minnesota, authorities said.",
    "url": "https://www.wsj.com/us-news/manhunt-under-way-for-suspect-in-minnesota-lawmaker-killing-e3286fb0?st=Mm496q"
  },
  {
    "text": "Man suspected of shooting 2 Minnesota lawmakers caught, AP sources says  —  The man suspected of killing a Minnesota lawmaker and wounding another has been taken into custody, two law enforcement officials said, bringing an end to a nearly two-day search that put the state on edge.",
    "url": "https://apnews.com/article/minnesota-lawmakers-shot-8ce70a94c9eb90688baaa1a71faef6cc"
  },
  {
    "text": "Minnesota suspected assassin Vance Boelter captured alive after intense manhunt for fatal shooting of Dem pol, spouse  —  Suspected political assassin Vance Luther Boelter was captured Sunday following an intense manhunt for the gunman accused of murdering a Minnesota state lawmaker and wounding another, according to a report.",
    "url": "https://nypost.com/2025/06/15/us-news/minnesota-suspected-assassin-vance-luther-boelter-captured-by-police-after-allegedly-killing-rep-hortman-and-injuring-sen-hoffman/"
  },
  {
    "text": "Trump vetoed an Israeli plan to kill Iran's supreme leader, US officials say  —  President Donald Trump vetoed an Israeli plan in recent days to kill the Iran's Supreme Leader Ayatollah Ali Khamenei, two U.S. officials told Reuters on Sunday.  —  “Have the Iranians killed an American yet?",
    "url": "https://www.reuters.com/world/middle-east/trump-vetoed-an-israeli-plan-kill-irans-supreme-leader-us-officials-say-2025-06-15/"
  },
  {
    "text": "Randi Weingarten Quits D.N.C. Post in Dispute With Chairman  —  In a letter to the party's chairman, Ken Martin, Ms. Weingarten wrote, “I appear to be out of step with the leadership you are forging.”  —  Randi Weingarten, the longtime leader of one of the nation's most influential labor unions … ",
    "url": "https://www.nytimes.com/2025/06/15/us/politics/randi-weingarten-dnc-ken-martin.html"
  },
  {
    "text": "Teachers union president Randi Weingarten resigns from DNC  —  “I appear to be out of step with the leadership you are forging,” she wrote in a letter to DNC Chair Ken Martin.  —  American Federation of Teachers President Randi Weingarten, a longtime powerhouse member of the Democratic National Committee … ",
    "url": "https://www.politico.com/news/2025/06/15/weingarten-dnc-00407364"
  },
  {
    "text": "Trump directs ICE to expand deportations in Democratic-run cities, undeterred by protests  —  President Donald Trump on Sunday directed federal immigration officials to prioritize deportations from Democratic-run cities, a move that comes after large protests erupted in Los Angeles … ",
    "url": "https://apnews.com/article/trump-ice-deportations-protests-65fa8d64ea12a78a0ee0ebeea008ee4d"
  },
  {
    "text": "Trump orders ICE to step up deportation efforts in Democrat-run cities  —  President Trump ordered Immigration and Customs Enforcement to “expand efforts to detain and deport” undocumented immigrants in Democratic-run cities.  —  The big picture: The Trump's escalation in targeting Democrat-run cities comes … ",
    "url": "https://www.axios.com/2025/06/16/trump-ice-democrat-cities-immigration-deport"
  },
  {
    "text": "Marcher wounded in Salt Lake City ‘No Kings’ protest shooting dies  —  Police chief says the victim was not shot by the suspect, who is in jail.  —  Note to readers  •The Salt Lake Tribune has made this story free to all.  —  A marcher critically wounded in a shooting … ",
    "url": "https://www.sltrib.com/news/2025/06/15/marcher-wounded-no-kings-protest/"
  },
  {
    "text": "Trump's Military Parade Was a Pathetic Event for a Pathetic President  —  Three dozen horses, 28 Abrams tanks, 6,700 soldiers, and millions of taxpayer dollars later, and Donald Trump's military birthday parade was still a flop at best.  —  A crowd that was well under the administration's … ",
    "url": "https://newrepublic.com/article/196850/trump-birthday-military-parade-pathetic"
  },
  {
    "text": "‘Golden Share’ in U.S. Steel Gives Trump Extraordinary Control  —  Administration officials secured a deal that will give the president unusual influence over a private company, and could serve as a model for other deals.  —  To save its takeover of U.S. Steel, Japan's Nippon Steel agreed … ",
    "url": "https://www.nytimes.com/2025/06/15/business/economy/golden-share-us-steel-nippon-trump.html?unlocked_article_code=1.PE8.vRQH.XDJWjFCELJOv&smid=url-share"
  },
  {
    "text": "European leaders clamor to be the G7's Trump whisperer  —  KANANASKIS, Alberta — Keir Starmer's team fancy their man as the foremost Trump whisperer at this week's G7 summit in Kananaskis, Canada.  He's not the only one vying for the title.  —  The stakes could hardly be higher.",
    "url": "https://www.politico.eu/article/europe-g7-canada-kier-starmer-tariffs-middle-east/"
  },
  {
    "text": "MAGA Sen. Mocked for Absurdly Calling Dem Assassin ‘Marxist’  —  JUMPING THE SHARK  —  Senator Mike Lee joined Elon Musk in portraying the suspect in attacks on Minnesota lawmakers as a leftist.  —  Republican Senator Mike Lee faced ridicule for calling the suspect of fatal shootings in Minnesota a “Marxist.”",
    "url": "https://www.thedailybeast.com/maga-senator-mike-lee-mocked-for-absurdly-calling-dem-assassin-marxist/"
  },
  {
    "text": "Trump's FAA pick has claimed ‘commercial’ pilot license he doesn't have  —  Bryan Bedford, the nominee to head the Federal Aviation Administration, for years erroneously stated in his Republic Airways bio that he is a pilot with a “commercial” rating.  —  President Donald Trump's nominee … ",
    "url": "https://www.politico.com/news/2025/06/15/trumps-faa-pick-has-claimed-commercial-pilot-license-he-doesnt-have-00406090"
  },
  {
    "text": "Sources: Vance Boelter's wife detained for questioning after traffic stop near Onamia  —  Vance Boelter's wife detained for questioning after traffic stop near Onamia  —  A manhunt is underway for Vance Boelter, who is suspected of shooting two Minnesota state lawmakers - one of them fatally - as well as their spouses.",
    "url": "https://kstp.com/kstp-news/top-news/sources-vance-boelters-wife-detained-for-questioning-after-traffic-stop-near-onamia/"
  },
  {
    "text": "“No Kings Day” protests turn out millions, rebuking Trump  —  The “No Kings Day” nationwide rallies against Donald Trump/for democracy on Saturday turned out millions of people.  —  That's per a collective crowdsourcing effort led by Strength In Numbers, and involving many members of the independent data journalism community.",
    "url": "https://www.gelliottmorris.com/p/no-kings-day-protests-turn-out-millions"
  }
]