[
  {
    "text": "Trump faces a revolt from his MAGA base over the Epstein files  —  The Epstein files — and calls for Attorney General Pam Bondi to be fired — dominated a conservative conference in Tampa this weekend.  —  TAMPA, Fla. — On the weekend President Donald Trump decided to pick his biggest political fight … ",
    "url": "https://www.nbcnews.com/politics/trump-administration/trump-faces-revolt-maga-base-epstein-files-rcna218385"
  },
  {
    "text": "ICE memo outlines plan to deport migrants to countries where they are not citizens  —  The dramatic shift in policy could result in thousands of people being sent to places where they lack family ties or even a common language.  —  Federal immigration officers may deport immigrants … ",
    "url": "https://www.washingtonpost.com/immigration/2025/07/12/immigrants-deportations-trump-ice-memo/"
  },
  {
    "text": "Trump Is Gutting Weather Science and Reducing Disaster Response  —  As a warming planet delivers more extreme weather, experts warn that the Trump administration is dismantling the government's disaster capabilities.  —  In an effort to shrink the federal government, President Trump … ",
    "url": "https://www.nytimes.com/2025/07/13/climate/floods-trump-cuts-disaster-preparedness-fema.html"
  },
  {
    "text": "DHS Secretary Kristi Noem says Trump wants FEMA ‘remade,’ not dismantled  —  Noem and Trump have previously floated getting rid of the agency, which administers emergency relief.  —  Homeland Security Secretary Kristi Noem said Sunday that President Donald Trump wants the Federal Emergency Management Agency … ",
    "url": "https://www.nbcnews.com/politics/trump-administration/dhs-secretary-kristi-noem-trump-wants-fema-remade-not-dismantled-texas-rcna218507"
  },
  {
    "text": "DOJ drops charges against Utah doctor accused of throwing away COVID vaccines, distributing fake vaccination cards  —  The Justice Department moved to dismiss charges against a Utah plastic doctor charged in connection with a COVID-19 fraud scheme, Attorney General Pam Bondi announced on Saturday.",
    "url": "https://thehill.com/policy/healthcare/5398661-justice-department-drops-charges-against-doctor/"
  },
  {
    "text": "Charges dropped against Utah doctor accused of throwing away $28,000 in COVID vaccine doses  —  The federal government on Saturday dismissed charges against a Utah plastic surgeon accused of throwing away COVID-19 vaccines, giving children saline shots instead of the vaccine and selling faked vaccination cards.",
    "url": "https://apnews.com/article/utah-doctor-covid-fraud-charges-dropped-41927573624f0e8e2ee08822633ca5de"
  },
  {
    "text": "America Would Be Better Off If Trump Won in 2020  —  When Donald Trump's megabill passed the Senate, consummating nearly a half-year of aggressively reactionary policymaking by the 47th president, a colleague commented that “it's like the Biden presidency never happened.”",
    "url": "https://nymag.com/intelligencer/article/america-better-off-trump-won-2020.html"
  },
  {
    "text": "From Science to Diversity, Trump Hits the Reverse Button on Decades of Change  —  President Trump has moved aggressively to reopen long-settled issues and to dismantle long-established institutions as he tries to return to what he considers better times.  —  NEWS ANALYSIS",
    "url": "https://www.nytimes.com/2025/07/13/us/politics/trump-reversal-better-times.html"
  },
  {
    "text": "Justice Dept. fires more prosecutors, support staff involved in Trump prosecutions, AP sources say  —  The Justice Department has fired additional lawyers and support staff who worked on special counsel Jack Smith's prosecutions of President Donald Trump, according to two people familiar with the matter.",
    "url": "https://apnews.com/article/jack-smith-justice-department-fired-trump-af94503d10143f5464559fb503425f4f"
  },
  {
    "text": "Trump says he's considering revoking Rosie O'Donnell's citizenship, reigniting decades-long feud  —  President Donald Trump reignited a decades-long feud with comedian Rosie O'Donnell Saturday, taking to his Truth Social platform to write he was considering revoking her citizenship.",
    "url": "https://cnn.com/2025/07/12/politics/rosie-odonnell-donald-trump"
  },
  {
    "text": "Trump's paranoid security state  —  America's top national security agencies have been using polygraph tests, seeking employees' communications and threatening criminal investigations, all in the name of ferreting out leakers or ensuring loyalty. … - Patel and his deputy, Dan Bongino … ",
    "url": "https://www.axios.com/2025/07/13/trump-leak-hunts-polygraph-tests-fbi-pentagon"
  },
  {
    "text": "California farmworker dies after chaotic federal immigration raid, family says  —  Jaime Alanis Garcia died days after falling some 30 feet during a chaotic raid on Glass House Farms in Camarillo, California, according to his family.  —  A cannabis farmworker who was critically injured during … ",
    "url": "https://www.nbcnews.com/news/us-news/california-farmworker-dies-immigration-raid-rcna218467"
  },
  {
    "text": "Grok Chatbot Mirrored X Users' ‘Extremist Views’ in Antisemitic Posts, xAI Says  —  Elon Musk's artificial intelligence company said its Grok chatbot had also undergone a code update that caused it to share antisemitic messages this week.  —  Elon Musk's artificial intelligence company … ",
    "url": "https://www.nytimes.com/2025/07/12/technology/x-ai-grok-antisemitism.html"
  },
  {
    "text": "ICE Set to Vastly Expand Its Reach With New Funds … Thousands of new deportation agents deployed into American cities.  A doubling of detention space to hold tens of thousands of immigrants before they are expelled.  Miles of new border wall, along with surveillance towers equipped with artificial intelligence.",
    "url": "https://www.nytimes.com/2025/07/12/us/politics/ice-expansion-concerns.html"
  },
  {
    "text": "Trump could potentially fire Powell over Fed renovations, Hassett says  —  President Trump could possibly fire Federal Reserve chair Jerome Powell over questions about the renovation of Fed facilities, National Economic Council director Kevin Hassett said Sunday.",
    "url": "https://www.axios.com/2025/07/13/trump-powell-federal-reserve-hassett"
  },
  {
    "text": "Federal workers face mass firings this summer after Supreme Court ruling  —  It's shaping up to be a summer of firings for tens of thousands of federal workers, now that the Supreme Court cleared the way for agencies to conduct layoffs. … - The Trump administration says this is just a step toward better government efficiency.",
    "url": "https://www.axios.com/2025/07/13/federal-workers-rif"
  },
  {
    "text": "Trump wins big on the Supreme Court's “shadow docket”  —  The Supreme Court has handed President Trump a slew of major victories through an abbreviated process that doesn't require full-fledged briefings and arguments — and will likely continue to do so.",
    "url": "https://www.axios.com/2025/07/13/trump-supreme-court-shadow-emergency-docket"
  },
  {
    "text": "Trump Administration Poised to Ramp Up Deportations to Distant Countries  —  Eight men sent by the United States to South Sudan could presage a new approach to Trump-era deportations, even as critics say the practice could amount to “enforced disappearance.”",
    "url": "https://www.nytimes.com/2025/07/13/us/south-sudan-third-country-deportations.html"
  },
  {
    "text": "Democrats Lost Voters on Transgender Rights.  Winning Them Back Won't Be Easy.  —  The party's vanguard position got ahead of voters in 2024, and the internal debate now underway reveals an uncertainty on how to adapt.  —  OUT OF POWER  —  The party's vanguard position got ahead of voters in 2024 … ",
    "url": "https://www.nytimes.com/2025/07/13/us/politics/democrats-transgender-rights.html"
  }
]