[
  {
    "text": "Trump's Iowa lead shrinks significantly as Kamala Harris replaces Biden, Iowa Poll shows  —  The nationally recognized Iowa Poll's first test of Kamala Harris' strength against Donald Trump indicates she's a more formidable opponent than President Biden in solid-red Iowa",
    "url": "https://www.desmoinesregister.com/story/news/politics/iowa-poll/2024/09/15/iowa-poll-donald-trump-iowa-lead-shrinks-as-kamala-harris-replaces-joe-biden/75180245007/"
  },
  {
    "text": "Harris seen as debate winner while maintaining slight lead over Trump: POLL  —  Taylor Swift's endorsement of Harris shows little impact, the poll found.  —  Vice President Kamala Harris and former President Donald Trump attend a presidential debate in Philadelphia, Sept. 10, 2024.",
    "url": "https://abcnews.go.com/Politics/harris-debate-winner-maintaining-slight-lead-trump-poll/story?id=113673862"
  },
  {
    "text": "Swift endorsement turns more voters from Harris than it attracts: poll  —  It might not be such a “Love Story” after all.  —  Taylor Swift's endorsement of Vice President Kamala Harris and her running mate, Minnesota Gov. Tim Walz, may turn more voters away than it attracts.",
    "url": "https://nypost.com/2024/09/14/us-news/more-voters-to-vote-against-harris-than-for-after-swift-endorsement-poll/"
  },
  {
    "text": "Ronald Reagan's former staff back Harris-Walz ticket: “Today is a choice between integrity and demagoguery.”  —  Seventeen former staff members of the late Republican President Ronald Reagan are endorsing the Democratic nominee, Vice President Kamala Harris.",
    "url": "https://www.cbsnews.com/news/ronald-reagan-former-staff-back-harris-walz-ticket/"
  },
  {
    "text": "Trump can't accept his poor debate.  So he's spiraled into conspiracy theories.  —  Since Kamala Harris was widely seen as besting him at the debate, Donald Trump has spread conspiracy theories and spun false tales, losing focus on what polls say matters most to voters.",
    "url": "https://www.washingtonpost.com/politics/2024/09/14/trump-conspiracies-lies-analysis/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI2Mjg2NDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI3NjY4Nzk5LCJpYXQiOjE3MjYyODY0MDAsImp0aSI6IjIyYTI0YjE0LTViZjctNDYwMy1iMzYxLTkzYjUwZWZlODE1OSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzA5LzE0L3RydW1wLWNvbnNwaXJhY2llcy1saWVzLWFuYWx5c2lzLyJ9.K92q18FTQozl_3gOyecXSzZCuEcHQsjdoTD-iIxkAMQ&itid=gfta"
  },
  {
    "text": "'I don't like those comments': Vance responds to Laura Loomer's attack on Harris' Indian heritage  —  During an interview with NBC News' “Meet the Press” JD Vance said, “What Laura said about Kamala Harris is not what we should be focused on.”  —  Ohio GOP Sen. JD Vance on Sunday told NBC News' … ",
    "url": "https://www.nbcnews.com/politics/2024-election/vance-laura-loomer-comments-kamala-curry-haitian-migrants-pets-rcna171139"
  },
  {
    "text": "Loomer threatens to sue Maher over Trump affair rumor  —  Laura Loomer hit back over Bill Maher's assertion that she was having an affair with Donald Trump  —  Laura Loomer is threatening to lawyer up after Bill Maher joked about a possible affair between the far-right troll and Donald Trump.",
    "url": "https://www.salon.com/2024/09/14/loomer-threatens-to-maher-over-affair-rumor/"
  },
  {
    "text": "GOP Gov. DeWine defends Haitian immigrants: ‘They came to Springfield to work’  —  Ohio city has been subject of rumors and threats in the presidential race.  —  In this July 14, 2024, file photo, Ohio Governor Mike DeWine takes part in a sound check at the Fiserv Forum ahead … ",
    "url": "https://abcnews.go.com/Politics/gop-gov-dewine-defends-haitian-immigrants-springfield-work/story?id=113690058"
  },
  {
    "text": "How Roberts Shaped Trump's Supreme Court Winning Streak  —  Behind the scenes, the chief justice molded three momentous Jan. 6 and election cases that helped determine the former president's fate.  —  Last February, Chief Justice John G. Roberts Jr. sent his eight Supreme Court colleagues … ",
    "url": "https://www.nytimes.com/2024/09/15/us/justice-roberts-trump-supreme-court.html?unlocked_article_code=1.K04.Hw-C.FVxaHPVlsDTE&smid=url-share"
  },
  {
    "text": "The first graders who survived Sandy Hook will vote in their first presidential election  —  It's a monumental moment that has given some survivors hope for change, nearly 12 years after 26 first graders and educators were killed in the shooting.  —  Grace Fischer survived the massacre … ",
    "url": "https://www.nbcnews.com/news/us-news/first-graders-survived-sandy-hook-will-vote-first-presidential-electio-rcna170471"
  },
  {
    "text": "Hillary Clinton says Trump's conviction “looks like karma,” explains her “big responsibility” towards Harris' White House run, and more  —  When singer-songwriter Joni Mitchell sang at the Grammy Awards earlier this year, the song that made her a star more than fifty years ago struck a different chord for at least one person watching.",
    "url": "https://www.cbsnews.com/news/hillary-clinton-on-bill-clinton-election-loss-kamala-harris-and-donald-trump-conviction/"
  },
  {
    "text": "Republicans refuse debates hosted by League of Women Voters — here's why  —  The League of Women Voters has a history of organizing debates and forums from elections for U.S. president to Kentucky governor to local school boards.  But this year Republicans in Kentucky's largest city … ",
    "url": "https://www.rawstory.com/league-of-women-voters-2669209939/"
  },
  {
    "text": "Election Live Updates: After an Eventful Week, Trump and Harris Prepare for Renewed Battleground Push  —  The Harris and Trump campaigns will hold events in the South and the Midwest this week, in another frenzied run of campaigning.  —  Here's the latest on the presidential race.",
    "url": "https://www.nytimes.com/live/2024/09/15/us/harris-trump-election"
  },
  {
    "text": "Fact check: Harris campaign social media account has repeatedly deceived with misleading edits and captions  —  A social media account run by Vice President Kamala Harris' campaign has been repeatedly deceptive.  —  The @KamalaHQ account, which has more than 1.3 million followers … ",
    "url": "https://www.cnn.com/2024/09/14/politics/fact-check-harris-campaign-social-media/"
  }
]