[
  {
    "text": "House Speaker Mike Johnson's chief of staff arrested on DUI charge after Trump speech  —  Hayden Haynes is a longtime top aide to Mike Johnson, both in the speaker's office and his personal office.  —  WASHINGTON — Hayden Haynes, the chief of staff to House Speaker Mike Johnson, R-La. … ",
    "url": "https://www.nbcnews.com/politics/congress/speaker-mike-johnson-chief-staff-arrested-dui-charge-trump-speech-rcna194986"
  },
  {
    "text": "Musk promises better communication between Republican lawmakers, DOGE  —  “With all due respect to Mr. Musk, he doesn't have a vote up here,” one lawmaker said.  —  Billionaire Trump adviser Elon Musk stepped up his congressional outreach on Wednesday, taking questions from Republican lawmakers … ",
    "url": "https://www.washingtonpost.com/politics/2025/03/05/musk-congress-anger-doge/"
  },
  {
    "text": "GOP must cut Medicaid or Medicare to achieve budget goals, CBO finds  —  The nonpartisan bookkeeper said there's no other way to cut $1.5 trillion from the budget over the next decade.  —  Just now  —  Republicans in Congress cannot reach their goal of cutting at least $1.5 trillion … ",
    "url": "https://www.washingtonpost.com/business/2025/03/05/gop-budget-medicaid-cuts/"
  },
  {
    "text": "Republican Senators Warn Musk DOGE Cuts at Risk Without Congress  —  Republican senators told Elon Musk Wednesday that billionaire needs congressional approval for controversial spending cuts or they risk being overturned in court.  —  Elon Musk huddled privately with Republican senators Wednesday … ",
    "url": "https://www.bloomberg.com/news/articles/2025-03-05/elon-musk-to-meet-with-congressional-republicans-on-doge-cuts"
  },
  {
    "text": "Trump administration plans to cut 80,000 employees from Veterans Affairs, according to internal memo  —  The Department of Veterans Affairs is planning an “aggressive” reorganization that includes cutting 80,000 jobs from the sprawling agency that provides health care for retired military members … ",
    "url": "https://apnews.com/article/veterans-affairs-cuts-doge-musk-trump-f587a6bc3db6a460e9c357592e165712"
  },
  {
    "text": "Supreme Court rejects Trump's request to keep billions in foreign aid frozen  —  A divided Supreme Court on Wednesday rejected the Trump administration's request to keep billions of dollars in foreign aid approved by Congress frozen.  —  However, the court did not immediately say when the money must … ",
    "url": "https://www.cnn.com/2025/03/05/politics/supreme-court-usaid-foreign-aid/"
  },
  {
    "text": "Supreme Court rejects Trump administration's bid to avoid paying USAID contractors  —  The Trump administration's efforts to effectively dismantle the foreign aid agency led contractors to file suit claiming they are owed money.  —  WASHINGTON — The Supreme Court on Wednesday endorsed … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-rejects-trump-administrations-bid-avoid-paying-usaid-con-rcna194230"
  },
  {
    "text": "Trump pauses Canada, Mexico auto tariffs  —  “We spoke with the big three auto dealers,” White House spokesperson Karoline Leavitt told reporters.  “We are going to give a one-month exemption on any autos coming through [the U.S.-Mexico-Canada Agreement.”  —  President Donald Trump has decided … ",
    "url": "https://www.politico.com/news/2025/03/05/trump-auto-tariffs-pause-canada-mexico-00213949"
  },
  {
    "text": "This Pentagon Press Secretary Has a Long History of Bigoted and Xenophobic Posts  —  “Be unapologetically right-wing.  It will pay off.”  —  On Donald Trump's first day in office, the Department of Defense announced a spate of hires, including 26-year-old Kingsley Wilson, who will serve as the Pentagon's deputy press secretary.",
    "url": "https://www.motherjones.com/politics/2025/03/kingsley-cortes-wilson-defense-department/"
  },
  {
    "text": "Exclusive: U.S. holding secret talks with Hamas … - While the Trump administration consulted with Israel about the possibility of engaging with Hamas, Israel learned about aspects of the talks through other channels, one source said.  — The sources spoke with Axios on the condition … ",
    "url": "https://www.axios.com/2025/03/05/us-hamas-talks-gaza-war-israel"
  },
  {
    "text": "Why Trump Thanked John Roberts  —  The conservative justices are frequently accomplices to Trump's assault on democracy.  —  The exchange was so awkward, it should have been followed by the Curb Your Enthusiasm theme song.  While President Donald Trump was shaking hands down the aisle … ",
    "url": "https://www.theatlantic.com/ideas/archive/2025/03/congressional-address-supreme-court/681926/?gift=Je3D9AQS-C17lUTOnl2W8DvuvqMwTWi-iRV7fuziWg0&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Trump Decried Millions Spent ‘Making Mice Transgender.’ It Was Cancer and Asthma Research  —  The president's State of the Union address included a line designed to go viral in the right-wing misinformation machine … The chief executive of the United States told the country … ",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-transgender-mice-medical-research-1235289439/"
  },
  {
    "text": "Poll on Trump's 2025 joint address to Congress finds large majority of viewers approve  —  A large majority of speech watchers approved of what they heard from President Trump's joint address to Congress Tuesday night.  —  The viewership was heavily Republican — historically a president's party draws more of their own partisans.",
    "url": "https://www.cbsnews.com/news/trump-speech-joint-address-congress-poll-2025/"
  },
  {
    "text": "Jack Daniel's maker says Canada pulling U.S. alcohol off store shelves is ‘worse than a tariff’  —  /business/business/business// businessJack Daniel's maker Brown-Forman Corp.'s CEO Lawson Whiting said on Wednesday Canadian provinces taking American liquor off store shelves was “worse than a tariff” … ",
    "url": "https://www.theglobeandmail.com/business/international-business/article-jack-daniels-maker-says-canada-pulling-us-alcohol-off-store-shelves-is/"
  },
  {
    "text": "U.S. Suspends Costly Deportation Flights Using Military Aircraft  —  Trump administration had used C-17s to fly migrants abroad and to Guantanamo Bay  —  The Trump administration has stopped using military aircraft to fly migrants who entered the U.S. illegally to Guantanamo Bay or other countries, defense officials said.",
    "url": "https://www.wsj.com/politics/national-security/trump-deportation-flights-paused-cost-c37c577a?st=Gbg8UE"
  },
  {
    "text": "Trading Volume In This Nasdaq-Listed Firm Soared Before Don Jr. And Eric Trump Were Announced As Board Members—'Suspicious,' Experts Say  —  Trading in Dominari Holdings Inc. soared ahead of the February announcement that Donald Trump Jr. and Eric Trump had taken stakes in the company … ",
    "url": "https://www.forbes.com/sites/zacheverson/2025/03/05/donald-trump-jr-eric-dominari-holdings-stock-nasdaq-trading-volume/"
  },
  {
    "text": "The Simple Explanation for Why Trump Turned Against Ukraine  —  Donald Trump's highly public schism with Volodymyr Zelensky has yielded the kind of doublethink that is common in personality cults.  Those believers who approve of the policy hail the great leader's strategic genius.",
    "url": "https://www.theatlantic.com/politics/archive/2025/03/republican-theories-foreign-policy/681921/"
  },
  {
    "text": "Elon Musk suggests the U.S. should privatize the Postal Service and Amtrak  —  During a remote appearance at a technology conference in San Francisco, Musk told attendees the U.S. should privatize “as much as possible.”  —  Trump adviser and tech mogul Elon Musk suggested Wednesday … ",
    "url": "https://www.nbcnews.com/politics/doge/elon-musk-suggests-us-privatize-postal-service-amtrak-rcna194960"
  },
  {
    "text": "Here's a Map of the For-Sale Government Properties the GSA Pulled From Its Website  —  The General Services Administration plans to sell hundreds of government buildings, including FBI headquarters.  Use our interactive tools to see where they are—and the congressional districts they're in.",
    "url": "https://www.wired.com/story/map-for-sale-government-properties-gsa/"
  },
  {
    "text": "US cuts off intelligence sharing with Ukraine  —  Fresh blow to embattled government in Kyiv as Trump administration shifts on conflict  —  The US has cut off intelligence-sharing with Kyiv in a move that could seriously hamper the Ukrainian military's ability to target Russian forces, according to officials familiar with the matter.",
    "url": "https://www.ft.com/content/c58fccea-00c4-4fad-bc0a-0185b7415579"
  },
  {
    "text": "Let's Be Honest About The State Of The Union  —  It wasn't necessary to watch all of Trump's speech last night to understand where we are as a country.  The state of our union, as I noted Sunday night, is compromised.  And that comes as no surprise to any of us.",
    "url": "https://joycevance.substack.com/p/lets-be-honest-about-the-state-of"
  },
  {
    "text": "‘Read this e-mail immediately’: CDC tells about 180 fired employees to come back to work  —  The nation's top public health agency says about 180 employees who were laid off two weeks ago can come back to work.  Emails went out Tuesday to some Centers for Disease Control and Prevention probationary employees … ",
    "url": "https://apnews.com/article/cdc-reinstatements-c1f0b33d677e5a02a4df1210b82ca930"
  },
  {
    "text": "Trump administration ordered to reinstate thousands of fired USDA workers  —  The decision is a blow to the Trump administration's effort to drastically and quickly shrink the federal bureaucracy.  —  Thousands of fired workers at the Department of Agriculture must get their jobs back for at least … ",
    "url": "https://www.politico.com/news/2025/03/05/trump-doge-firings-agriculture-employees-reinstated-00214204"
  },
  {
    "text": "Trump's Rage Over “Low” Deportations Suddenly Gets More Unnerving  —  For weeks now, President Donald Trump's propagandists have relentlessly glorified his mass-deportations, even posting images of defeated-looking migrants getting frog-marched onto shiny military planes.",
    "url": "https://newrepublic.com/article/192318/trump-immigrant-deportations-low-rage-unnerving"
  },
  {
    "text": "Mayor Adams' Job Approval Rating Drops To All-Time Low Of 20%, Quinnipiac University New York City Poll Finds; 56% Of Voters Say Adams Should Resign From Office  —  mail_outline  —  As New York City Mayor Eric Adams faces legal uncertainty over federal corruption charges, as well as a re-election bid … ",
    "url": "https://poll.qu.edu/poll-release?releaseid=3920"
  },
  {
    "text": "Exclusive: Judges face rise in threats as Musk blasts them over rulings  —  U.S. Marshals have warned federal judges of unusually high threat levels as tech billionaire Elon Musk and other Trump administration allies ramp up efforts to discredit judges who stand in the way of White House efforts … ",
    "url": "https://www.reuters.com/world/us/judges-face-rise-threats-musk-blasts-them-over-rulings-2025-03-05/"
  }
]