[
  {
    "text": "Hard-right backtrack on spending levels leaves sour taste for colleagues  —  Fiscal fights have been at the heart of Republican conflict this year, including the debate over the top-line spending level for 2024  —  Under a sweltering July heat outside the Capitol, members … ",
    "url": "https://www.washingtonpost.com/politics/2023/12/02/house-freedom-caucus-spending-plan/"
  },
  {
    "text": "McCarthy, Laboring to Adjust to Life After the Speakership, Eyes Exiting Congress  —  The California Republican is still angry at his ouster and has struggled to acclimate.  His colleagues expect him to retire, but he has taken his time deciding.  —  At an emotional evening news conference immediately … ",
    "url": "https://www.nytimes.com/2023/12/02/us/politics/mccarthy-house-speaker-republicans.html"
  },
  {
    "text": "Trump attempts to spin anti-democracy, authoritarian criticism against Biden  —  The former president declared his 2024 campaign as a ‘righteous crusade’ against ‘tyrants and villains’  —  CEDAR RAPIDS, Iowa — Republican polling leader Donald Trump moved to deflect from criminal charges … ",
    "url": "https://www.washingtonpost.com/politics/2023/12/02/trump-speech-authoritarian-criticism-biden/"
  },
  {
    "text": "Muslim Americans in swing states launch anti-Biden campaign  —  Muslim Americans in the several swing states are scheduled to gather in Michigan on Saturday to start a campaign they're calling #AbandonBiden, a reflection of their outrage over President Biden's handling of the Israel-Hamas war.",
    "url": "https://www.axios.com/2023/12/02/muslim-americans-swing-states-anti-biden-campaign"
  },
  {
    "text": "Texas GOP executive committee rejects proposed ban on associating with Nazi sympathizers and Holocaust deniers  —  Some members of the committee said such a ban, proposed two months after a prominent conservative activist was caught meeting with a famous white supremacist, might be a “slippery slope” or too vague.",
    "url": "https://www.texastribune.org/2023/12/02/texas-gop-antisemitism-resolution/"
  },
  {
    "text": "Pro-DeSantis super PAC parts with CEO amid turmoil  —  Kristin Davison departs just 10 days after the previous chief executive resigned, the latest shake-up as fighting between the governor's allies has escalated and erupted into public view  —  A super PAC that has overseen … ",
    "url": "https://www.washingtonpost.com/politics/2023/12/02/kristin-davison-desantis-never-back-down/"
  },
  {
    "text": "What home schooling hides: A boy tortured and starved by his stepmom  —  Roman Lopez was 11 when he went missing.  His years of torment were concealed by home schooling.  —  Deep Reads features The Washington Post's best immersive reporting and narrative writing.  —  Nobody could find Roman Lopez.",
    "url": "https://www.washingtonpost.com/education/interactive/2023/homeschooling-child-abuse-torture-roman-lopez/"
  },
  {
    "text": "Chris Christie may not appear on Republican primary ballot in Maine  —  Former New Jersey Gov. Chris Christie is in danger of not appearing on Maine's primary ballot after he fell short of the minimum 2,000 signatures needed from Maine voters to qualify for the state's Republican presidential primary, state officials said Friday.",
    "url": "https://www.cbsnews.com/news/chris-christie-may-not-appear-on-republican-primary-ballot-in-maine/"
  },
  {
    "text": "Johnson says vote on Biden impeachment inquiry is ‘necessary step’ after WH ‘stonewalled’ GOP investigations  —  'I think it's something we have to do at this juncture,' House Speaker Mike Johnson told Fox News  —  House Speaker Mike Johnson, R-La., is looking to move forward … ",
    "url": "https://www.foxnews.com/politics/johnson-says-vote-biden-impeachment-inquiry-necessary-step-wh-stonewalled-gop-investigations"
  },
  {
    "text": "Drunk and Asleep on the Job: Air Traffic Controllers Pushed to the Brink  —  A nationwide shortage of controllers has resulted in an exhausted and demoralized work force that is increasingly prone to making dangerous mistakes.  —  One air traffic controller went into work drunk this summer and joked about “making big money buzzed.”",
    "url": "https://www.nytimes.com/2023/12/02/business/air-traffic-controllers-safety.html"
  },
  {
    "text": "Biden's EPA launches crackdown on planet-warming methane  —  The rule's 3 a.m. rollout was timed to coincide with the ongoing U.N. climate talks in Dubai.  —  The Environmental Protection Agency unveiled sweeping new regulations targeting methane emissions from the oil and gas sector on Saturday … ",
    "url": "https://www.politico.com/news/2023/12/02/bidens-epa-launches-crackdown-on-planet-warming-methane-00129433"
  },
  {
    "text": "Israel Risks ‘Strategic Defeat’ If It Doesn't Protect Civilians, Austin Says  — Defense secretary amplifies growing US concern as war resumes  — Protecting civilians is crucial in urban warfare, Austin says  —  US Defense Secretary Lloyd Austin said Israel risked “strategic defeat” … ",
    "url": "https://www.bloomberg.com/news/articles/2023-12-02/defense-secretary-austin-warns-of-risk-for-israel-over-civilian-deaths-in-gaza"
  },
  {
    "text": "Ohio Fails to Pass Restrictions on College Teaching About Climate Policies  —  The legislation, written to fight the “woke fiefdom” of higher education, doesn't have the votes to pass the Ohio House.  —  Ohio lawmakers have failed, at least for now, to pass a bill that would exert control over discussion of … ",
    "url": "https://insideclimatenews.org/news/02122023/ohio-higher-education-bill-fails/"
  },
  {
    "text": "Paris Terror Attack: One Killed, Two Injured by ‘Allahu Akbar’ Knifeman  —  Paris police arrested a man on Saturday evening after he allegedly killed one man and injured another two while shouting ‘Allahu Akbar’.  —  UPDATE 2350: The alleged attacker, referred to only Armand R … ",
    "url": "https://www.breitbart.com/europe/2023/12/02/paris-terror-attack-one-killed-two-injured-by-allahu-akbar-knifeman/"
  },
  {
    "text": "Address of His Holiness Pope Francis to the Conference of Parties to the United Nations Framework Convention on Climate Change (COP28)  —  I have the honour to read the Address that His Holiness Pope Francis prepared for this occasion:  —  Mr President,  —  Mr Secretary-General of the United Nations,",
    "url": "https://www.vatican.va/content/francesco/en/speeches/2023/december/documents/20231202-dubai-cop28.html"
  }
]