[
  {
    "text": "Where Are All the Anti-Trump Republicans?  —  A vast array of GOP power brokers detest and disdain the former president.  So why are they keeping so quiet?  —  Here's a portrait of how Donald Trump reclaims power.  —  At a Hoover Institution conference here last week … ",
    "url": "https://www.politico.com/news/magazine/2023/12/08/the-stop-trump-effort-has-been-abysmal-00130751"
  },
  {
    "text": "Trump Voters Are America Too  —  If Trump wins again, perhaps we can all finally abandon the delusion that his supporters do not represent the true America.  —  Editor's Note: This article is part of “If Trump Wins,” a project considering what Donald Trump might do if reelected in 2024.",
    "url": "https://www.theatlantic.com/magazine/archive/2024/01/trump-2024-win-american-identity/676143/"
  },
  {
    "text": "GOP's Brutal Math: Trump Could Secure Nomination Before Conviction  —  Looking at the primary schedule, Republicans see the party handcuffing itself to a candidate on the verge of politically toxic criminal convictions. … ‘People need to wake up’  —  There's a scenario many Republicans are dreading … ",
    "url": "https://www.thedailybeast.com/gops-brutal-math-donald-trump-could-secure-2024-nomination-before-criminal-conviction"
  },
  {
    "text": "First on CNN: Federal prosecutors file new criminal case against Hunter Biden  —  Federal prosecutors have filed a new criminal case against Hunter Biden, people briefed on the matter said.  —  The exact nature of the charges couldn't immediately be learned because court documents have not been made public.",
    "url": "https://www.cnn.com/2023/12/07/politics/hunter-biden-criminal-case/"
  },
  {
    "text": "Woman tried to burn down Martin Luther King Jr.'s birth home, police say  —  A woman was arrested Thursday afternoon after attempting to burn down Martin Luther King Jr.'s childhood home in Atlanta, police said.  —  The Atlanta Police Department said the woman poured gasoline … ",
    "url": "https://thehill.com/regulation/court-battles/4349371-woman-tried-to-burn-down-martin-luther-king-jr-s-birth-home-police-say/"
  },
  {
    "text": "Woman arrested for pouring gasoline, trying to burn down Martin Luther King Jr.'s birth home  —  ATLANTA — Atlanta police are investigating after a woman attempted to burn down Dr. Martin Luther King Jr.'s birth home.  —  Police told Channel 2 Action News they were called to King's birth home … ",
    "url": "https://www.wsbtv.com/news/local/police-investigating-after-person-tries-vandalize-martin-luther-king-jrs-home-near-king-center/NEBC6LEK4RABJNRYEKTFV6X7AU/"
  },
  {
    "text": "Wharton board calls on Penn president Liz Magill to resign  —  University of Pennsylvania President Liz Magill is being asked to resign by the board of Penn's Wharton business school, according to a letter obtained by Axios. … - Earlier today, Axios reported that a wealthy donor pulled … ",
    "url": "https://www.axios.com/2023/12/08/penn-antisemitism-wharton-magill-resign"
  },
  {
    "text": "UPenn board chair expected to speak with president Liz Magill about stepping down  —  New York CNN  —  The University of Pennsylvania's board of trustees held an emergency meeting Thursday as school president Liz Magill faces scathing criticism over her performance at a House hearing earlier this week.",
    "url": "https://www.cnn.com/2023/12/07/business/penn-emergency-meeting-liz-magill/"
  },
  {
    "text": "GOP lawmaker: Ousted aides targeted my daughter for OnlyFans account  —  Rep. Brandon Williams, who represents a battleground seat, says his altercation stemmed from a threat to expose his daughter's OnlyFans account.  —  A Republican member of Congress is alleging that a former top aide spearheaded a … ",
    "url": "https://www.politico.com/news/2023/12/08/brandon-williams-interview-video-former-aides-00130713"
  },
  {
    "text": "North Dakota senator's son charged with manslaughter after officer killed in police chase  —  Sen. Kevin Cramer's son, Ian Cramer, was charged in connection with a police chase on Wednesday that led to the death of a sheriff's deputy in Mercer County, North Dakota.",
    "url": "https://www.nbcnews.com/politics/politics-news/north-dakota-senators-son-charged-manslaughter-police-chase-killed-off-rcna128653"
  },
  {
    "text": "Exclusive: Pro-Trump lawyer Kenneth Chesebro cooperating in multiple state probes into 2020 fake electors plot  —  The pro-Trump lawyer who helped devise the 2020 fake electors plot and already pleaded guilty to the conspiracy in Georgia is now cooperating with Michigan and Wisconsin state investigators … ",
    "url": "https://www.cnn.com/2023/12/08/politics/kenneth-chesebro-cooperating-multiple-investigations"
  },
  {
    "text": "White House Disavows U.S. Islamic Group After Leader's Oct. 7 Remarks  —  The director of the Council on American-Islamic Relations said in a speech that he was “was happy to see” Palestinians break out of Gaza on the day Hamas attacked Israel.  —  The White House disavowed … ",
    "url": "https://www.nytimes.com/2023/12/08/us/politics/white-house-cair-nihad-awad.html"
  },
  {
    "text": "Police have recovered video of Florida GOP chair and alleged victim in rape investigation  —  Disclaimer: This story contains explicit sexual content and details involving an alleged sexual assault.  —  Sarasota police have recovered a cell phone video taken by Florida GOP chairman Christian Ziegler … ",
    "url": "https://flcga.org/police-have-recovered-video-of-florida-gop-chair-and-alleged-victim-in-rape-investigation/"
  },
  {
    "text": "Man federally charged after firing shots outside New York synagogue, officials say  —  The suspect was identified as Mufid Al Khader, 28, officials said.  —  A man arrested in connection with shots that were fired outside a synagogue in Albany, New York, on Thursday has been federally charged, officials said.",
    "url": "https://www.nbcnews.com/news/us-news/man-arrested-firing-shots-new-york-synagogue-officials-say-rcna128674"
  },
  {
    "text": "CNN poll: Large majority of US adults and half of Republicans agree with Biden's goal to slash climate pollution  —  Nearly two-thirds of US adults say they are worried about the threat of climate change in their communities, according to a new CNN poll conducted by SSRS.",
    "url": "https://www.cnn.com/2023/12/08/politics/cnn-poll-climate-change/"
  },
  {
    "text": "Lauren Boebert used campaign funds to buy tickets to cheer boyfriend Quinn Gallagher on to 774th place in grueling Colorado bike race - weeks before the couple were kicked out of Beetlejuice performance  — Records obtained by DailyMail.com show Lauren Boebert used campaign funds to watch … ",
    "url": "https://www.dailymail.co.uk/news/article-12806843/Lauren-Boebert-campaign-funds-tickets-Colorado-race.html"
  },
  {
    "text": "Until DEI offices are closed, don't expect better college presidents  —  The moral degeneracy of the presidents of three prestigious universities who recently refused to condemn calls for genocide clearly is symptomatic of a larger problem.  The long-term solution must be to eliminate diversity … ",
    "url": "https://www.washingtonexaminer.com/opinion/editorials/until-dei-offices-are-closed-dont-expect-better-college-presidents"
  },
  {
    "text": "U.S. political ad market projected to reach record $16 billion in 2024 … New projections from GroupM, one of the world's largest paid advertising agencies, suggest that political ad revenue will reach $15.9 billion in 2024, or $17.1 billion including direct mail.",
    "url": "https://www.axios.com/2023/12/08/us-political-ad-market-2024-spending"
  }
]