[
  {
    "text": "F.B.I. Seizes Eric Adams's Phones as Campaign Investigation Intensifies  —  Days after a raid at Mr. Adams's chief fund-raiser's home, federal agents took the mayor's phones and iPad, two people with knowledge of the matter said.  —  F.B.I. agents seized Mayor Eric Adams's electronic devices early … ",
    "url": "https://www.nytimes.com/2023/11/10/nyregion/adams-fbi-investigation-phones.html"
  },
  {
    "text": "The Key to Mike Johnson's Christian Extremism Hangs Outside His Office  —  The newly elected House Speaker has ties to the far-right New Apostolic Reformation — which is hell-bent on turning America into a religious state  —  THE AMERICAN PUBLIC has had much to learn about Mike Johnson over the past two weeks.",
    "url": "https://www.rollingstone.com/politics/political-commentary/mike-johnson-christian-nationalist-appeal-to-heaven-flag-1234873851/"
  },
  {
    "text": "Why Is Mike Johnson Flying a Christian Nationalist Flag Outside His Office?  —  House Speaker Mike Johnson has three flags hanging outside his office: the American flag, the Louisiana state flag, and a flag representing a movement that wants to turn the United States into a religious Christian nation.",
    "url": "https://newrepublic.com/post/176861/mike-johnson-flying-christian-nationalist-flag-outside-office"
  },
  {
    "text": "Sweeping Raids, Giant Camps and Mass Deportations: Inside Trump's 2025 Immigration Plans  —  If he regains power, Donald Trump wants not only to revive some of the immigration policies criticized as draconian during his presidency, but expand and toughen them.",
    "url": "https://www.nytimes.com/2023/11/11/us/politics/trump-2025-immigration-agenda.html"
  },
  {
    "text": "Trump's D.C. Trial Strategy: Do Everything to Delay Until After 2024 Election  —  Appellate courts could take up pre-trial appeals by Donald Trump in his federal election-subversion case, leading to uncertainty about the former president's Washington, D.C., trial date",
    "url": "https://themessenger.com/politics/trump-washington-dc-appeal-jack-smith-trial-date"
  },
  {
    "text": "Ohio Republicans Say It's Their ‘God Given Right’ to Restrict Abortion Access  —  Republicans in Ohio want to undermine the will of voters who approved a measure enshrining reproductive freedom into the state's constitution  —  Ohio Republicans are claiming a constitutional amendment … ",
    "url": "https://www.rollingstone.com/politics/politics-news/ohio-republicans-stop-issue-1-abortion-rights-1234875333/"
  },
  {
    "text": "Alarmed by Off-Year Losses, Mainstream Republicans Balk at Abortion Curbs  —  Worried about alienating critical blocs of voters, House Republicans from competitive districts are digging in against using spending bills for abortion and contraception restrictions.",
    "url": "https://www.nytimes.com/2023/11/10/us/politics/house-republicans-abortion.html"
  },
  {
    "text": "White House tried, and failed, to persuade Manchin to make another Senate run  —  And now, the question is, will he run against Biden?  —  As Sen. Joe Manchin struggled for several months over the next step he would take politically, President Joe Biden's top advisers privately tried … ",
    "url": "https://www.politico.com/news/2023/11/10/biden-manchin-senate-run-00126683"
  },
  {
    "text": "Joe Manchin hits the road to ‘save the nation’ amid 2024 speculation  —  Fresh off his announcement that he wouldn't seek a third term in his coveted Senate seat next year, Sen. Joe Manchin (D-WV) is taking his show on the road.  —  Manchin, who was widely viewed as the most vulnerable incumbent … ",
    "url": "https://www.washingtonexaminer.com/news/campaigns/joe-manchin-post-senate-2024-speculation"
  },
  {
    "text": "Macron calls on Israel to stop killing Gaza's women and babies  —  Israel must stop killing babies and women in Gaza, French President Emmanuel Macron has told the BBC.  —  In an exclusive interview at the Élysée Palace, he said there was “no justification” for the bombing, saying a ceasefire would benefit Israel.",
    "url": "https://www.bbc.com/news/world-europe-67356581"
  },
  {
    "text": "Moody's cuts U.S. outlook to negative, citing deficits and political polarization  — Moody's Investors Service lowered its ratings outlook on the United States' government to negative from stable, pointing to rising risks to the nation's fiscal strength.  — The ratings agency has affirmed … ",
    "url": "https://www.cnbc.com/2023/11/10/moodys-cuts-usa-outlook-to-negative-citing-higher-interest-rates-and-deficits.html"
  },
  {
    "text": "Moody's lowers U.S. credit outlook, citing political dysfunction  —  Moody's on Friday offered a sharp rebuke of political dysfunction in the United States, with the credit-rating agency changing its outlook for U.S. sovereign debt to negative from stable and warning that “continued political polarization” … ",
    "url": "https://www.washingtonpost.com/business/2023/11/10/moodys-credit-rating-deficit/"
  },
  {
    "text": "Statement From Gerald Rosberg, Chair of the Special Committee on Campus Safety  —  Columbia University is suspending Students for Justice in Palestine (SJP) and Jewish Voice for Peace (JVP) as official student groups through the end of the fall term.  This decision was made after the two … ",
    "url": "https://news.columbia.edu/news/statement-gerald-rosberg-chair-special-committee-campus-safety"
  },
  {
    "text": "Tennessee man admits to conspiring with Jan. 6 defendant to kill FBI agents  —  Austin Carter said that he plotted with Edward Kelley, who is awaiting trial on Jan. 6 charges, to kill as many as 37 people.  Kelley has pleaded not guilty to murder conspiracy charges.",
    "url": "https://www.nbcnews.com/politics/justice-department/tennessee-man-says-conspired-jan-6-defendant-kill-fbi-agents-rcna124683"
  },
  {
    "text": "Gaetz renews McCarthy fight with short film documenting his effort to take away the gavel  —  Rep. Matt Gaetz (R-FL) released a 13-minute short film documenting his journey to oust former House Speaker Kevin McCarthy (R-CA) from the chamber's top job.  —  Gaetz led the motion to vacate … ",
    "url": "https://www.washingtonexaminer.com/news/house/gaetz-renews-mccarthy-short-film-documenting-take-away-gavel"
  },
  {
    "text": "Trump spreads alleged shirtless photos of fraud trial judge  —  In a now-deleted post on his platform Truth Social, the former president shared a link to an article from The Gateway Pundit  —  Trump zips his lips to camera after leaving New York court during civil fraud trial",
    "url": "https://www.independent.co.uk/news/world/americas/donald-trump-judge-arthur-engoron-photos-b2444784.html"
  }
]