[
  {
    "text": "‘The vibes are really bad’  —  Welcome to POLITICO's West Wing Playbook, your guide to the people and power centers in the Biden administration.  —  RALEIGH, North Carolina — Several West Wing officials were so demoralized by President JOE BIDEN's poor performance in Thursday night's debate … ",
    "url": "https://www.politico.com/newsletters/west-wing-playbook/2024/06/28/the-vibes-are-really-bad-00165772"
  },
  {
    "text": "Behind the Curtain: Biden oligarchy will decide fate … These allies alone hold sway over decisions big and small in Biden's life and presidency.  — The president engaged in no organized process outside his family in deciding to run for a second term, the N.Y. Times' Peter Baker reports.",
    "url": "https://www.axios.com/2024/06/29/biden-debate-replace-advisers"
  },
  {
    "text": "Haley Warns Trump to Prepare for Younger Rival, Renews Call for Cognitive Tests  —  Former GOP presidential contender says Democrats should move on from Biden  —  Nikki Haley, the runner-up to Donald Trump in this year's GOP nomination race, said Democrats need to dump President Biden … ",
    "url": "https://www.wsj.com/politics/elections/haley-warns-trump-to-prepare-for-younger-rival-renews-call-for-cognitive-tests-5c6d7294"
  },
  {
    "text": "To Serve His Country, President Biden Should Leave the Race  —  President Biden has repeatedly and rightfully described the stakes in this November's presidential election as nothing less than the future of American democracy.  —  Donald Trump has proved himself to be a significant jeopardy … ",
    "url": "https://www.nytimes.com/2024/06/28/opinion/biden-election-debate-trump.html"
  },
  {
    "text": "Donald Trump Should Not Have Been on That Stage  —  DONALD TRUMP WON the first presidential debate the minute he walked onstage.  His win was cemented a few minutes later, when the moderators addressed him as Mr. President.  He had no business being there and his presence was stark evidence … ",
    "url": "https://www.thebulwark.com/p/donald-trump-should-not-have-been-debate-stage"
  },
  {
    "text": "Scoop: Schumer's pre-debate fears come true  —  Before Thursday night's debate, Senate Majority Leader Chuck Schumer (D-N.Y.) had signaled to political allies that he was open to options other than President Biden if his debate performance was disastrous, Axios has learned.",
    "url": "https://www.axios.com/2024/06/29/schumer-debate-fears-come-true-biden"
  },
  {
    "text": "Biden tries to calm nervous Democrats.  It won't happen instantly.  —  Distressed by President Biden's struggles in Thursday's debate, Democrats are divided over what to do next, and Biden has significant work to do to assuage their fears.  —  More than half a century ago … ",
    "url": "https://www.washingtonpost.com/politics/2024/06/29/biden-democratic-party-divide/"
  },
  {
    "text": "Biden campaign fundraises $27 million after first debate … The Biden campaign has raised $27 million starting from the day of the first presidential debate through Friday evening, a campaign spokesperson announced on Saturday.  —  The number comes in the middle of President Joe Biden's … ",
    "url": "https://www.cnbc.com/2024/06/29/biden-campaign-fundraises-27-million-post-debate.html"
  },
  {
    "text": "More Democratic Voters Than Not Want Biden Replaced After Debate Performance  —  3 in 10 Democrats say Harris should be the party's nominee if Biden drops bid … President Joe Biden's alarming performance in Thursday's presidential debate with former President Donald Trump hasn't changed … ",
    "url": "https://pro.morningconsult.com/analysis/biden-trump-debate-poll-june-2024"
  },
  {
    "text": "Democrats: Stop Panicking  —  As a former Republican who spent decades pointing out flaws in the Democratic Party, I watch the current Democratic panic over President Biden's debate performance with a mix of bafflement and nostalgia.  —  It's baffling that so many Democrats are failing … ",
    "url": "https://www.nytimes.com/2024/06/29/opinion/democrats-panic-joe-biden.html"
  },
  {
    "text": "‘People need to wake up’: Rep. Crockett pushes back against Biden debate criticism  —  Rep. Jasmine Crockett joins Ali Velshi to react to Biden's debate performance, urging Democrats to avoid unnecessary panicking.  “It's almost like we're scared of our shadow sometimes,” Crockett says.",
    "url": "https://www.msnbc.com/ali-velshi/watch/-people-need-to-wake-up-rep-jasmine-crockett-pushes-back-against-biden-debate-criticism-213947973853"
  },
  {
    "text": "Supreme Court Executes Massive Power Grab From Executive Branch In New Ruling  —  The Court's conservatives overruled Chevron Friday, a right-wing legal world quest years in the making.  —  The Supreme Court overruled a key pillar of federal agency authority Friday, appropriating a massive amount of executive branch power to itself.",
    "url": "https://talkingpointsmemo.com/news/supreme-court-chevron-overrule-agency"
  },
  {
    "text": "Biden team worries as Macron's election gamble looks doomed  —  France's main far right party appears poised to do well in the two-round parliamentary vote.  —  Before President Emmanuel Macron of France went on national television to announce his call for snap parliamentary elections … ",
    "url": "https://www.politico.com/news/2024/06/29/macron-french-election-biden-00165818"
  },
  {
    "text": "Supreme Court gives cities and towns power to criminalize homelessness  —  The Oregon case has been closely watched by Western cities and states.  —  On Friday, the U.S. Supreme Court ruled that cities and municipalities can punish people for sleeping outside, even when they have nowhere else to go.",
    "url": "https://www.hcn.org/articles/supreme-court-gives-cities-and-towns-power-to-criminalize-homelessness/"
  },
  {
    "text": "Attorney General Merrick B. Garland Statement on the Supreme Court's Decision in Fischer v. United States  —  For Immediate Release  —  The Justice Department issued the following statement from Attorney General Merrick B. Garland on the Supreme Court's decision in Fischer v. United States:",
    "url": "https://www.justice.gov/opa/pr/attorney-general-merrick-b-garland-statement-supreme-courts-decision-fischer-v-united-states"
  }
]