[
  {
    "text": "Senate to hold key test vote on Ukraine aid, Israel funding and TikTok ban  —  The package of foreign aid and legislation that would provide a pathway to banning TikTok in the U.S. is expected to be signed into law by President Joe Biden in the coming days.  —  WASHINGTON — The Senate … ",
    "url": "https://www.nbcnews.com/politics/congress/senate-hold-key-test-vote-ukraine-aid-israel-funding-tiktok-ban-rcna148685?taid=66279b0c8c42f20001faa778"
  },
  {
    "text": "Next Ukraine package to be larger than normal, include armored vehicles  —  The Senate could approved more than $60 billion for Kyiv as soon as Tuesday.  —  The Biden administration is preparing a larger-than-normal package of military aid for Ukraine that will include armored vehicles … ",
    "url": "https://www.politico.com/news/2024/04/22/ukraine-package-armored-vehicles-00153672"
  },
  {
    "text": "NASA's Voyager 1 Resumes Sending Engineering Updates to Earth  —  For the first time since November, NASA's Voyager 1 spacecraft is returning usable data about the health and status of its onboard engineering systems.  The next step is to enable the spacecraft to begin returning science data again.",
    "url": "https://blogs.nasa.gov/voyager/2024/04/22/nasas-voyager-1-resumes-sending-engineering-updates-to-earth/"
  },
  {
    "text": "Voyager 1 is sending data back to Earth for the first time in 5 months  —  For the first time in five months, NASA engineers have received decipherable data from Voyager 1 after crafting a creative solution to fix a communication problem aboard humanity's most distant spacecraft in the cosmos.",
    "url": "https://www.cnn.com/2024/04/22/world/voyager-1-communication-issue-cause-fix-scn/"
  },
  {
    "text": "Greene faces uphill battle to oust Johnson  —  Rep. Marjorie Taylor Greene (R-Ga.) is escalating her threat to remove Speaker Mike Johnson (R-La.) from power, but she faces a steep climb if she hopes to achieve that goal.  —  Not only has the Speaker recently received a glowing review … ",
    "url": "https://thehill.com/homenews/house/4612735-greene-vow-motion-vacate-johnson/"
  },
  {
    "text": "‘Plasmic Echo’ was FBI code name for Trump classified documents probe  —  The FBI's code name for its investigation into former President Trump's handling of classified documents was “Plasmic Echo,” according to court filings published Monday.  —  The name was listed in unredacted court … ",
    "url": "https://thehill.com/regulation/court-battles/4613537-plasmic-echo-was-fbi-code-name-for-trump-classified-documents-probe/"
  },
  {
    "text": "Live Updates: Jurors in Trump Criminal Case Told That He Lied ‘Over and Over and Over’  —  Donald J. Trump is charged with falsifying business records to cover up a sex scandal that threatened to derail his 2016 campaign.  A lawyer for Mr. Trump insisted that the former president “did not commit any crimes.”",
    "url": "https://www.nytimes.com/live/2024/04/22/nyregion/trump-hush-money-trial"
  },
  {
    "text": "Minnesota Sen. Nicole Mitchell arrested on suspicion of burglary after being found in home  —  Mitchell, a Democrat, was arrested after being found inside a home in Detroit Lakes, Minnesota, police say.  She was booked into Becker County jail on a burglary charge.",
    "url": "https://www.usatoday.com/story/news/nation/2024/04/22/minnesota-senator-burglary-arrest-nicole-mitchell/73419507007/"
  },
  {
    "text": "TikTok and the future of trade war  —  The TikTok bill that passed the House over the weekend isn't just a high-profile shot at an ultra-popular app — it's a historically unusual move that in itself could create problems for the law.  —  By naming a single company, and by seemingly reversing … ",
    "url": "https://www.politico.com/newsletters/digital-future-daily/2024/04/22/tiktok-and-the-future-of-trade-war-00153680"
  },
  {
    "text": "Republicans are starting to worry about RFK Jr.  —  Even Donald Trump acknowledged Monday that the independent candidate “probably hurts both” Biden and him.  —  Republicans are waking up to the reality that Robert F. Kennedy Jr. could sink their standard-bearer just as easily … ",
    "url": "https://www.politico.com/news/2024/04/22/republicans-are-starting-to-worry-about-rfk-jr-00153763"
  },
  {
    "text": "A historic victory for unions  —  On April 19, the National Labor Relations Board (NLRB) announced that workers at a Volkswagen auto plant in Chattanooga, Tennessee, voted to join the United Auto Workers (UAW) union.  The union won by a 73% majority, with more than 2,600 votes - a historic feat.",
    "url": "https://popular.info/p/a-historic-victory-for-unions"
  },
  {
    "text": "How Republicans castrated themselves … - Letting any member call a vote on removing the speaker. … - Surrendering authority of the Rules Committee, which sets the terms for how legislation will be handled during votes.",
    "url": "https://www.axios.com/2024/04/23/republicans-speaker-motion-vacate-rules-committee"
  },
  {
    "text": "Trump Calls for More Protests Outside Trial: ‘Rally Behind MAGA’  —  With support from demonstrators in Lower Manhattan spotty so far, Donald Trump issued a call to “rally behind MAGA,” and suggested the poor turnout was a result of a plot against his supporters.",
    "url": "https://www.nytimes.com/2024/04/22/us/politics/trump-trial-protests.html"
  },
  {
    "text": "Xavier Becerra plots political future after Biden administration  —  The Health and Human Services secretary is making moves to run again in California.  Maybe even too many moves.  —  Health and Human Services Secretary Xavier Becerra's plans to leave the Biden administration and run … ",
    "url": "https://www.politico.com/news/2024/04/23/xavier-becerra-biden-administration-future-00153737"
  },
  {
    "text": "Statement from Columbia University President Minouche Shafik  —  Dear Members of the Columbia Community,  —  I am deeply saddened by what is happening on our campus.  Our bonds as a community have been severely tested in ways that will take a great deal of time and effort to reaffirm.",
    "url": "https://president.columbia.edu/news/statement-columbia-university-president-minouche-shafik-4-22"
  },
  {
    "text": "Thailand to replace military-appointed Senate, reduce its powers  —  Thailand's cabinet on Tuesday approved a plan to select a new slate of senators who will no longer be allowed to vote on who becomes prime minister, removing what has effectively served as a veto for the powerful military on who leads the country.",
    "url": "https://www.reuters.com/world/asia-pacific/thailand-replace-military-appointed-senate-reduce-its-powers-2024-04-23/"
  },
  {
    "text": "Unpacking the alleged crime that made Trump's alleged crime a felony  —  Attorneys offered opening arguments in the criminal trial of Donald Trump on Monday in Manhattan, beginning the process of presenting to the jury the state's case against the former president.",
    "url": "https://www.washingtonpost.com/politics/2024/04/22/trump-hush-money-trial-charges/"
  },
  {
    "text": "Why Trump Will Likely be Held in Contempt and What Then  —  Trial in The People of the State of New York vs. Donald J. Trump, the first-ever criminal prosecution of a former U.S. president, began on Monday, April 15.  Although the trial is still in its early stages, Trump has already run … ",
    "url": "https://www.justsecurity.org/94878/why-trump-will-likely-be-held-in-contempt-and-what-then/"
  },
  {
    "text": "Biden moves to block abortion records from investigators  —  The Biden administration on Monday updated federal health privacy rules to protect patients seeking abortion and providers involved in the procedure. … The big picture: Health plans and providers will be barred from disclosing … ",
    "url": "https://www.axios.com/2024/04/22/biden-abortion-records-patients-hipaa-investigations"
  }
]