[
  {
    "text": "Caitlyn Jenner ‘Disgusted’ Over Trans Day Of Visibility Being On Easter  —  Transgender Day of Visibility has been on March 31 since its inception in 2009.  Easter is a different date each year, however.  —  LOADING  —  Caitlyn Jenner, a trans woman, wrote on social media Saturday that she is … ",
    "url": "https://www.huffpost.com/entry/caitlyn-jenner-trans-day-of-visibility-easter_n_6609992fe4b0c4621eb76bbd"
  },
  {
    "text": "“Trending: Easter Controversy,” or: How little lies pave the way for the next big lie  —  No-News Weekend Internet is stupid-dangerous in the Trump era — as this weekend's attack on the Transgender Day of Visibility shows.  —  This weekend's gaslighting from the right around Easter falling … ",
    "url": "https://www.lawdork.com/p/trending-easter-controversy-tdov"
  },
  {
    "text": "Here's what Trump and Biden said in their Easter messages  —  President Biden and former President Trump shared starkly different Easter messages Sunday.  —  Biden marked the holy day with a solemn message, while Trump lashed out at political opponents in an all-caps post on Truth Social.",
    "url": "https://thehill.com/homenews/campaign/4566351-heres-what-trump-and-biden-said-easter/"
  },
  {
    "text": "“Unit 29155's scope is global for conducting lethal operations and acts of sabotage.  Their mission is to find, fix, and finish, all in support of Vladimir Putin's imperial dreams.\"  —  Originally conceived as a training unit within the GRU, it was reorganized and expanded in 2008 … ",
    "url": "https://theins.press/en/politics/270425"
  },
  {
    "text": "Trump Launches Another Attack on Judge's Daughter, This Time with Photos  —  The former president accused Judge Juan Merchan's daughter of presenting a conflict of interest, possibly violating a gag order  —  Donald Trump launched yet another attack against the daughter … ",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-another-attack-judge-merchan-daughter-1234997020/"
  },
  {
    "text": "Exclusive: Iran alerted Russia to security threat before Moscow attack, sources say  —  Iran tipped off Russia about the possibility of a major “terrorist operation” on its soil ahead of the concert hall massacre near Moscow last month, three sources familiar with the matter said.",
    "url": "https://www.reuters.com/world/iran-alerted-russia-security-threat-before-moscow-attack-sources-say-2024-04-01/"
  },
  {
    "text": "New smear campaign puts first Muslim appellate nominee in jeopardy  —  Republicans first attempted to sink the nomination of Adeel Mangi, who would be the first Muslim American to serve on a federal appellate court, on allegations that he was an anti-semitic terrorist sympathizer.",
    "url": "https://popular.info/p/update-new-smear-campaign-puts-first"
  },
  {
    "text": "The anti-abortion movement is losing the battle on IVF.  It's preparing to win the war.  —  The groups are not advocating banning IVF but want new restrictions that would significantly curtail access to the procedure.  —  Anti-abortion advocates worked for five decades to topple Roe v. Wade.",
    "url": "https://www.politico.com/news/2024/04/01/anti-abortion-movement-ivf-war-00149766"
  },
  {
    "text": "Johnson sounds out key Republicans with speakership and Ukraine aid on line  —  Days after his speakership was put on notice by a far-right member, Mike Johnson strategized with a key - and perhaps surprising - source: firebrand GOP Rep. Matt Gaetz of Florida, the architect of the last effort to remove a speaker.",
    "url": "https://www.cnn.com/2024/03/31/politics/mike-johnson-motion-to-vacate-ukraine-funding"
  },
  {
    "text": "In setback to Turkey's Erdogan, opposition makes huge gains in local election  —  Turkey's main opposition party retained its control over key cities and made huge gains elsewhere in Sunday's local elections, in a major upset to President Recep Tayyip Erdogan, who had set his sights on retaking control of those urban areas.",
    "url": "https://apnews.com/article/turkey-local-elections-erdogan-popularity-test-8adc4df56cdbce24f78900e1d142ff21"
  },
  {
    "text": "GOP congressman tempers ‘Nagasaki and Hiroshima’ comments on Gaza: ‘I used a metaphor’  —  Rep. Tim Walberg said he really wasn't advocating using nuclear weapons.  —  Rep. Tim Walberg (R-Mich.) on Sunday said that his recent comment that the war in Gaza should “be like Nagasaki and Hiroshima” was not meant to be taken literally.",
    "url": "https://www.politico.com/news/2024/03/31/gop-congressman-nagasaki-hiroshima-comments-gaza-00149862"
  },
  {
    "text": "Embittered Republicans plot to knock off House GOP's hard-right leader in Virginia primary feud  —  Rep. Derrick Van Orden is done with Rep. Bob Good.  —  Good, the leader of the House Freedom Caucus and one of eight Republicans who voted to oust Kevin McCarthy from the speakership … ",
    "url": "https://www.cnn.com/2024/03/31/politics/bob-good-primary-fight-virginia/"
  },
  {
    "text": "El Paso judge orders release of migrants accused of ‘border riot’  —  An El Paso magistrate judge on Easter Sunday ordered the release of migrants accused in a “border riot” when a stampede overwhelmed National Guard troops along the Rio Grande.  —  Court officials noted that undocumented migrants … ",
    "url": "https://www.elpasotimes.com/story/news/immigration/2024/03/31/el-paso-border-riot-judge-orders-migrants-release/73161289007/"
  },
  {
    "text": "They came for Florida's sun and sand.  They got soaring costs and a culture war.  —  Florida has seen a population boom in recent years, but many longtime residents and recent transplants say rising costs and divisive politics have them fleeing the Sunshine State.",
    "url": "https://www.nbcnews.com/politics/economics/leaving-florida-rcna142316"
  }
]