[
  {
    "text": "Political reporters are actively covering up Trump's racism  —  Even as bodies were still being fished out of the Potomac River, Donald Trump went on a racist, partisan, and dishonest rant on Thursday, blaming diversity hires and Democrats for Wednesday's calamitous nighttime collision between … ",
    "url": "https://presswatchers.org/2025/01/political-reporters-are-actively-covering-up-trumps-racism/"
  },
  {
    "text": "The Day Trump Became Un-President  —  “We're so back,” one reporter whispered to another.  —  All of the chairs in the White House briefing room were filled, and reporters and photographers were crammed into every available nook and cranny.  I was standing in the back … ",
    "url": "https://www.theatlantic.com/politics/archive/2025/01/trump-airplane-crash/681521/"
  },
  {
    "text": "F.C.C. Chair Orders Investigation Into NPR and PBS Stations  —  Brendan Carr, the chairman of the Federal Communications Commission, recently expressed concern about NPR and PBS's sponsorships.  —  Brendan Carr, the chairman of the Federal Communications Commission, informed NPR and PBS … ",
    "url": "https://www.nytimes.com/2025/01/30/business/media/npr-pbs-fcc-investigation.html?unlocked_article_code=1.tE4.njGJ.s2ljEztrWYxy&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Paramount in Settlement Talks With Trump Over ‘60 Minutes’ Lawsuit  —  A settlement, if reached, would be an extraordinary concession by a major U.S. media company to a sitting president.  —  When Donald J. Trump sued CBS for $10 billion days before the 2024 election, accusing the company … ",
    "url": "https://www.nytimes.com/2025/01/30/business/media/paramount-trump-cbs-news-settlement.html?unlocked_article_code=1.tU4.TRir.c2EziAfO0_RQ&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "National Science Foundation suspends salary payments, leaving researchers unable to pay their bills  —  NSF payment system remained offline despite the lifting of Trump administration funding freeze  —  One scientist texted his landlord to say February rent would be late.",
    "url": "https://www.statnews.com/2025/01/30/trump-funding-freeze-national-science-foundation-suspends-salary-payments/"
  },
  {
    "text": "‘Everything I Say Leaks,’ Zuckerberg Says in Leaked Meeting Audio  —  Join the newsletter to get the latest updates.  —  Success  —  Great!  Check your inbox and click the link.  —  Error  —  Please enter a valid email address.  —  At an all hands meeting inside Meta Thursday … ",
    "url": "https://www.404media.co/zuckerberg-says-everything-i-say-leaks-in-leaked-meeting-audio/"
  },
  {
    "text": "The FAA is facing a major crisis without a leader because Elon Musk pushed him out  —  Musk has publicly clashed with the FAA and its former chief, Michael Whitaker.  —  Musk has publicly clashed with the FAA and its former chief, Michael Whitaker. … The Federal Aviation Administration … ",
    "url": "https://www.theverge.com/news/603113/faa-chief-musk-dc-plane-crash-crisis"
  },
  {
    "text": "Trump launched air controller diversity program that he now decries  —  At news conference, Trump read a list of disabilities he calls disqualifying, but his administration started such hiring in 2019  —  “All qualify for the position of a controller of airplanes pouring into our country … ",
    "url": "https://www.washingtonpost.com/politics/2025/01/30/faa-dei-trump-fact-checker/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM4MjEzMjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM5NTk1NTk5LCJpYXQiOjE3MzgyMTMyMDAsImp0aSI6IjYyMjM3ZWYxLWMzMjUtNDc1NC05ZWNjLTI0MGM3YmQ5ZGE3NCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzAxLzMwL2ZhYS1kZWktdHJ1bXAtZmFjdC1jaGVja2VyLyJ9.diYCYSEL5vSV01nfg83SDz8Ap72uBFG7Tb5MDf_KI8w&itid=gfta"
  },
  {
    "text": "Gabbard's Hearing Turns Tense Over Snowden Questions  —  Tulsi Gabbard, President Trump's nominee for director of national intelligence, refused to fully denounce the 2013 leaks by Edward J. Snowden, eliciting concern from both parties.  —  Senators of both parties sharply questioned Tulsi Gabbard … ",
    "url": "https://www.nytimes.com/2025/01/30/us/politics/tulsi-gabbard-confirmation-hearing-intelligence.html"
  },
  {
    "text": "Staffing Was ‘Not Normal’ at Reagan Airport Tower, According to F.A.A. Report  —  The report, reviewed by The New York Times, said that one controller was communicating with both helicopters and planes.  Those jobs are typically assigned to two people, not one.",
    "url": "https://www.nytimes.com/2025/01/30/business/air-traffic-control-staffing-plane-crash.html"
  },
  {
    "text": "Several top FBI officials are told to resign or face demotion as Trump continues federal purge  —  The affected employees include about a half dozen “executive assistant directors,” who are some of the bureau's top managers.  —  Several top FBI executives promoted by former Director Christopher Wray … ",
    "url": "https://www.nbcnews.com/politics/justice-department/several-top-fbi-officials-are-told-resign-face-demotion-trump-continue-rcna190095"
  },
  {
    "text": "Sam Bankman-Fried's Parents Explore Seeking Trump Pardon for Son  — They've met with lawyers and other figures in Trump's orbit  — FTX co-founder was sentenced to 25 years for fraud last year  —  The Impact of Trump's DEI Actions The Impact of Trump's DEI Actions The Impact of Trump's DEI Actions",
    "url": "https://www.bloomberg.com/news/articles/2025-01-30/sam-bankman-fried-s-parents-explore-seeking-trump-pardon-for-son"
  },
  {
    "text": "RFK Jr. stumbles over basics of Medicare, Medicaid during Senate confirmation hearings … Robert F. Kennedy Jr., President Donald Trump's pick to lead the Department of Health and Human Services, appeared to be unfamiliar with fundamental elements of the Medicare and Medicaid programs Thursday during … ",
    "url": "https://www.cnbc.com/2025/01/30/rfk-jr-struggles-with-medicare-medicaid-basics-in-senate-hearings.html"
  },
  {
    "text": "Several senior FBI leaders told to leave agency or be fired, people familiar say  —  The ultimatum was unusual for the FBI and suggested that President Donald Trump is purging leadership at an agency he has harshly criticized.  —  Multiple senior FBI officials have been ordered to leave … ",
    "url": "https://www.washingtonpost.com/national-security/2025/01/30/fbi-leadership-removed-kash-patel-trump/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM4MjEzMjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM5NTk1NTk5LCJpYXQiOjE3MzgyMTMyMDAsImp0aSI6ImNmMzI3NGM1LWRiNzEtNGQxYi04NjZiLWU0NTAxYmM0NmRjNyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb25hbC1zZWN1cml0eS8yMDI1LzAxLzMwL2ZiaS1sZWFkZXJzaGlwLXJlbW92ZWQta2FzaC1wYXRlbC10cnVtcC8ifQ.OP5Q6VTexNgVyZXgK5nuJxgkLioGP468FuCILcRANYA&itid=gfta"
  },
  {
    "text": "Trump Administration Orders Agencies to Find More DEI Workers to Ax  —  Government offices have cut dozens of positions and canceled millions of dollars in contracts  —  Trump administration officials are pressing federal agencies to dig deeper to find diversity workers to push out of the government … ",
    "url": "https://www.wsj.com/politics/policy/trump-administration-orders-agencies-to-find-more-dei-workers-to-ax-7b627c36?st=C86Rsx&reflink=desktopwebshare_permalink"
  },
  {
    "text": "DOJ's LGBTQ employee group shuts down after three decades  —  The board of DOJ Pride, founded in 1994, told members that the decision was made “in the interest and for the protection of all members.”  —  DOJ Pride, an LGBTQ employee resource group at the Department of Justice … ",
    "url": "https://www.nbcnews.com/feature/nbc-out/justice-department-doj-pride-lgbtq-erg-trump-rcna189866"
  },
  {
    "text": "Trump says US could soon put 25% tariffs on goods from Mexico, Canada  —  U.S. President Donald Trump on Thursday said he would likely decide by the end of the day whether to put a 25% tariff on imports of Mexican and Canadian oil that would take effect on Feb 1.  —  “We may or may not.",
    "url": "https://www.reuters.com/world/americas/trump-says-us-will-place-25-tariffs-goods-mexico-canada-2025-01-30/"
  },
  {
    "text": "Musk's Twitter Takeover Offers Trump a Blueprint  —  Federal agencies have offered exits to millions of employees and tested the prowess of engineers — just like when Elon Musk bought Twitter.  The similarities have been uncanny.  —  The email landed in employees' inboxes with the subject line: “Fork in the Road.”",
    "url": "https://www.nytimes.com/2025/01/30/technology/musk-doge-x-playbook.html?unlocked_article_code=1.tE4.AZid.crJmDInSppkd&smid=url-share"
  },
  {
    "text": "Civil rights attorney, former Miss Kansas contestant killed in plane crash near DC airport  —  WICHITA, Kan. (KWCH) - As families and communities identify victims in Wednesday night's plane crash near Washington, D.C., we're learning that a well-known civil rights attorney and former Miss Kansas contestant is among the 67 people dead.",
    "url": "https://www.kwch.com/2025/01/30/civil-rights-attorney-former-miss-kansas-contestant-killed-plane-crash-near-dc-airport/"
  },
  {
    "text": "The Logoff: Trump's plan to send deportees to Guantánamo, explained  —  The Logoff explains what you need to know about Trump's latest immigration move. … DonaldTrump's baseless accusations surrounding the Washington, DC, plane crash made headlines, but we promised you we'd focus … ",
    "url": "https://www.vox.com/donald-trump/397519/the-logoff-guantanamo-immigrant-detention-deportations-trump"
  },
  {
    "text": "MSU college abruptly cancels Lunar New Year event, citing Trump DEI orders  —  Michigan State University cancelled an annual Lunar New Year celebration following new executive orders targeting diversity, equity and inclusion policies and concerns from students, according to emails obtained by The State News.",
    "url": "https://statenews.com/article/2025/01/msu-college-abruptly-cancels-lunar-new-year-event-citing-trump-orders"
  },
  {
    "text": "FDA approves new type of nonopioid painkiller for acute pain  —  The drug, Journavx, from Vertex Pharmaceuticals, reduced pain after surgery in clinical trials.  Experts hope it can lead to fewer opioid prescriptions.  —  The Food and Drug Administration on Thursday approved a new type … ",
    "url": "https://www.nbcnews.com/health/health-news/fda-approves-new-type-nonopioid-painkiller-acute-pain-rcna189871"
  },
  {
    "text": "Trump Gutted Key Aviation Safety Committee Before D.C. Plane Crash  —  Last week, just days after his inauguration, Donald Trump eliminated the membership of a key committee that handles aviation security.  And on Wednesday night,  a passenger plane collided with a military helicopter in the Washington, D.C., area.",
    "url": "https://newrepublic.com/post/190934/trump-aviation-safety-committee-dc-plane-crash"
  },
  {
    "text": "Vera Rubin Was a Pioneering Female Astronomer.  Her Federal Bio Now Doesn't Mention Efforts to Diversify Science.  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up to receive our biggest stories as soon as they're published.",
    "url": "https://www.propublica.org/article/vera-rubin-astronomer-dei-trump"
  },
  {
    "text": "White House Stenographers Can't Keep Up With Trump  —  The president has already spoken 81,235 words just last week.  —  SHOP WITH SCOUTED  —  These Heated Chairs Are a Must-Have Cold Plunge Companion  —  HEAT CHECK  —  Athletes, fitness fanatics, and wellness enthusiasts … ",
    "url": "https://www.thedailybeast.com/white-house-stenographers-cant-keep-up-with-trump/"
  },
  {
    "text": "Census Bureau Director Robert Santos is resigning, making way for Trump's pick  —  The director of the U.S. Census Bureau, Robert Santos, announced Thursday he is resigning, giving President Trump an early opportunity to nominate a new political appointee to lead the agency.",
    "url": "https://www.npr.org/2025/01/30/nx-s1-5258393/census-bureau-director-robert-santos"
  },
  {
    "text": "Senate confirms Burgum as Interior secretary  —  The Senate easily confirmed Doug Burgum as secretary of the Interior Department Thursday, a job that positions him to act on President Donald Trump's energy strategy.  The 79-18 vote makes the wealthy former North Dakota governor the official … ",
    "url": "https://www.politico.com/live-updates/2025/01/30/congress/confirmed-burgum-interior-secretary-00201283"
  },
  {
    "text": "Trump Administration Considers Halting Congestion Pricing  —  The New York City tolling program began on Jan. 5 after defying obstacles for decades.  A move to stop it would likely touch off a legal battle between the state and federal government.  —  The Trump administration is considering … ",
    "url": "https://www.nytimes.com/2025/01/30/nyregion/nyc-trump-congestion-pricing.html?unlocked_article_code=1.tE4.p5Cn.mjMA4BYv5brH"
  },
  {
    "text": "Alsobrooks grills Kennedy on belief that Black Americans should get different vaccine schedules  —  Sen. Angela Alsobrooks (D-Md.) on Thursday grilled Department of Health and Human Services nominee Robert F. Kennedy, Jr.'s history of claiming Black Americans have a better immune system than white people.",
    "url": "https://thehill.com/homenews/race-politics/5118030-alsobrooks-grills-kennedy-on-belief-that-black-americans-should-get-different-vaccine-schedules/"
  },
  {
    "text": "Government Tech Workers Forced to Defend Projects to Random Elon Musk Bros  —  A recent high school graduate and former Neuralink intern has joined meetings to review lines of code and other work history of career public servants, sparking chaos at a major government agency.",
    "url": "https://www.wired.com/story/elon-musk-government-tech-workers-gsa-tts/"
  }
]