[
  {
    "text": "Isaac Hayes Estate Marks Victory in Suit Against Trump  —  ‘SEE YOU IN COURT’  —  Isaac Hayes' estate filed a lawsuit this month over Donald Trump's unauthorized use of “Hold On, I'm Coming.”  —  ‘ON THE MEND’  —  According to a statement from the venue, T-Boz suffered “severe nausea, vomiting, and intense abdominal cramps.”",
    "url": "https://www.thedailybeast.com/isaac-hayes-estate-marks-victory-in-suit-against-trump"
  },
  {
    "text": "Donald Trump Just Got Served In Federal Isaac Hayes Estate Lawsuit  —  Isaac Hayes III posted on Sunday that Donald Trump and his campaign have been served in their federal lawsuit alleging 134 instances of copyright infringement.  —  The civil lawsuit alleges that Trump and his campaign used … ",
    "url": "https://www.politicususa.com/2024/08/25/trump-served-isaac-hayes-estate.html"
  },
  {
    "text": "Kennedy Family Comes Out Swinging Against ‘Obscene’ RFK Jr. After Trump Defection  —  ‘WORSE THAN DISAPPOINTMENT’  —  Several prominent Kennedy siblings, including Kerry Kennedy and Max Kennedy, condemned their brother's decision to endorse the Republican nominee for president.",
    "url": "https://www.thedailybeast.com/kennedy-family-comes-out-swinging-against-obscene-rfk-jr"
  },
  {
    "text": "Scoop: Harris builds an army of House surrogates … - To many House members, the shift is evidence of their new importance under the leadership of Vice President Kamala Harris and Minnesota Gov. Tim Walz, a former House member. … - The center-left New Democrat Coalition polled … ",
    "url": "https://www.axios.com/2024/08/25/kamala-harris-campaign-biden-house-surrogates"
  },
  {
    "text": "Trump suggests he might skip ABC debate with Harris  —  The Sept. 10 debate with ABC is the only one both campaigns have agreed to do with one of the major networks.  —  Former president Donald Trump suggested Sunday evening that he might skip a Sept. 10 ABC News debate with Vice President Kamala Harris … ",
    "url": "https://www.washingtonpost.com/politics/2024/08/26/trump-harris-debate-abc/"
  },
  {
    "text": "Gen. McMaster's blistering account of the Trump White House  —  Until now, Lt. Gen. H.R. McMaster has held his fire about his stint in the Trump White House.  McMaster served with distinction in key American conflicts of the past decades: the Gulf War, the Iraq War and the war in Afghanistan … ",
    "url": "https://www.cnn.com/2024/08/25/politics/mcmaster-trump-book-account/"
  },
  {
    "text": "Trump Whines About Fox News as Poll Numbers Keep Dropping  —  ‘WRONG!!’  —  “I don't have to make calls to go on TV, or anything else — They call me!” the former president posted on Sunday.  —  Journalist  —  With 71 days until the election, Donald Trump spent Sunday morning ranting … ",
    "url": "https://www.thedailybeast.com/trump-whines-about-fox-news-as-poll-numbers-keep-dropping"
  },
  {
    "text": "Watch: Scott Jennings laughed at on CNN for claiming 'People don't want to feel joy'  —  It did not take long on Sunday morning for conservative CNN political commentator Scott Jennings to realize he had stepped in it when he claimed, “People don't want to feel joy” during his appearance on “State of the Union.”",
    "url": "https://www.rawstory.com/scott-jennings-cnn-joy/"
  },
  {
    "text": "McConnell's big fear on the next budget fight … - In a recent meeting with other GOP offices about a short-term spending bill strategy, top McConnell staffers argued that adding a non-citizen voting bill would backfire.  — One fear is such a move would open the door for Democrats to tack … ",
    "url": "https://www.axios.com/2024/08/25/mcconnell-republicans-save-act-immigrant-voting"
  },
  {
    "text": "The Latino Vote Could Decide the Election.  Kamala Harris Knows It.  —  The vice president inherited a campaign that was in danger of falling off a cliff with Latino voters.  —  By the turn of the year, it was getting harder and harder to deny the Biden campaign had a Latino problem.",
    "url": "https://www.politico.com/news/magazine/2024/08/26/kamala-harris-latino-voters-00173976"
  },
  {
    "text": "Explainer: How has Communist-run Vietnam's graft campaign shaken up its politics?  —  Vietnam's parliament appointed three new deputy prime ministers, as well as new ministers of environment and justice in a government reshuffle that follows months of political turbulence amid a sweeping anti-graft campaign.",
    "url": "https://www.reuters.com/world/asia-pacific/how-has-communist-run-vietnams-graft-campaign-shaken-up-its-politics-2024-08-26/"
  },
  {
    "text": "Trump is expected to tie Harris to chaotic Afghanistan War withdrawal in speech to National Guard  —  In a speech Monday to National Guard soldiers in Michigan, former President Donald Trump is expected to promote his foreign policy record and tie Vice President Kamala Harris … ",
    "url": "https://apnews.com/article/trump-michigan-afghanistan-war-46eb2b0861939bf022747920c0ee0234"
  },
  {
    "text": "They Served With Trump and Saw the Crazy.  They Should Endorse Harris.  —  THE MOMENT FROM THE DEMOCRATIC CONVENTION I kept coming back to this weekend wasn't from Oprah or the Obamas, Steph or Steve, Kamala or Doug—not even Gus Walz, America's proudest son.",
    "url": "https://www.thebulwark.com/p/republicans-who-served-with-trump-and-saw-the-crazy-should-endorse-kamala-harris"
  },
  {
    "text": "RFK Jr.'s Secret Service protection ends after campaign suspended  —  Washington —  Robert F. Kennedy Jr., who suspended his third-party presidential bid last week and endorsed former President Donald Trump, has lost his Secret Service protection following the decision to leave the race, his campaign said.",
    "url": "https://www.cbsnews.com/news/rfk-jr-secret-service-protection-over-campaign/"
  },
  {
    "text": "The DNC Gave Kamala Harris a Major Boost  —  The campaign raised over $80 million while attracting an army of volunteers.  —  The Democratic National Convention wasn't just four days of good vibes: It was also the cause of a major fundraising and volunteer boom for the Harris-Walz ticket.",
    "url": "https://www.motherjones.com/politics/2024/08/kamala-harris-post-dnc/"
  }
]