[
  {
    "text": "Statement of ICC Prosecutor Karim A.A. Khan KC: Applications for arrest warrants in the situation in the State of Palestine  —  Today I am filing applications for warrants of arrest before Pre-Trial Chamber I of the International Criminal Court in the Situation in the State of Palestine.",
    "url": "https://www.icc-cpi.int/news/statement-icc-prosecutor-karim-aa-khan-kc-applications-arrest-warrants-situation-state"
  },
  {
    "text": "EXCLUSIVE: ICC seeks arrest warrants against Sinwar and Netanyahu for war crimes over October 7 attack and Gaza war  —  The International Criminal Court is seeking arrest warrants for Hamas leader Yahya Sinwar and Israeli Prime Minister Benjamin Netanyahu on charges of war crimes and crimes … ",
    "url": "https://www.cnn.com/2024/05/20/middleeast/icc-israel-hamas-arrest-warrant-war-crimes-intl/"
  },
  {
    "text": "Why we support ICC prosecutions for crimes in Israel and Gaza  —  The attacks by Hamas in Israel on October 7 and the military response by Israeli forces in Gaza have tested the system of international law to its limits.  This is why, as international lawyers, we felt compelled to assist … ",
    "url": "https://www.ft.com/content/aa2089c5-6388-437d-bf5c-9268f3a788ce"
  },
  {
    "text": "Trump trial: Michael Cohen admits he ‘stole from the Trump Organization’ in testimony … Michael Cohen, the former fixer and personal lawyer for Donald Trump, admitted during cross-examination Monday that he stole from Trump's company by holding on to money given to him that should have gone to a tech contractor.",
    "url": "https://www.cnbc.com/2024/05/20/trump-trial-end-looms-in-hush-money-case.html"
  },
  {
    "text": "Trump claims he wants to testify at his trial.  No one else thinks he should.  —  “Anybody testifying for their own sake, it doesn't play out well,” said one Trump ally.  —  On the eve of his criminal trial, Donald Trump told reporters in Florida that he would take the stand and testify if necessary.",
    "url": "https://www.politico.com/news/2024/05/20/trump-testify-hush-money-trial-00158756"
  },
  {
    "text": "Closing Arguments in Trump's Trial Will Likely Be Next Week, Judge Says  —  Defense lawyers have the opportunity to call witnesses, including their client, former President Donald J. Trump, but whether he will testify is not clear.  Then the case goes to the jury.",
    "url": "https://www.nytimes.com/2024/05/20/nyregion/trump-trial-schedule.html"
  },
  {
    "text": "Iran's president, foreign minister and others found dead at helicopter crash site, state media says  —  Iranian President Ebrahim Raisi, the country's foreign minister and others have been found dead at the site of a helicopter crash Monday after an hourslong search through a foggy … ",
    "url": "https://apnews.com/article/iran-president-ebrahim-raisi-426c6f4ae2dd1f0801c73875bb696f48"
  },
  {
    "text": "Toxic Gaslighting: How 3M Executives Convinced a Scientist the Forever Chemicals She Found in Human Blood Were Safe  —  Decades ago, Kris Hansen showed 3M that its PFAS chemicals were in people's bodies.  Her bosses halted her work.  As the EPA now forces the removal of the chemicals from drinking water … ",
    "url": "https://www.propublica.org/article/3m-forever-chemicals-pfas-pfos-inside-story"
  },
  {
    "text": "Scared about America losing democracy?  Texas is already gone  —  “I might go to Dallas to murder looters,” a then-active duty U.S. Army sergeant named Daniel Perry texted a friend in the spring of 2020, as protest marches over the police murder of George Floyd swept across Texas and the nation.",
    "url": "https://www.inquirer.com/opinion/commentary/texas-abbott-pardon-murderer-blm-protester-20240519.html"
  },
  {
    "text": "Senate Banking Chair Brown calls on Biden to replace embattled FDIC head  —  FDIC Chair Martin Gruenberg testified at hearings before House and Senate lawmakers last week, where Democrats stopped just shy of calling for his ouster.  —  Senate Banking Chair Sherrod Brown on Monday called … ",
    "url": "https://www.politico.com/news/2024/05/20/brown-calls-on-biden-to-replace-embattled-fdic-head-00158864"
  },
  {
    "text": "Exclusive: Justice Alito sold Bud Light stock amidst anti-trans boycott effort  —  At 4:37 p.m. on Sunday, August 13, 2023, far-right, anti-LGBTQ influencer Chaya Raichik of Libs of TikTok posted a pre-transition photograph of transgender influencer Dylan Mulvaney, calling her “a dude,” on Twitter, now known as X.1",
    "url": "https://www.lawdork.com/p/alito-bud-light-stock-sale-anti-trans-boycott"
  },
  {
    "text": "Why isn't Donald Trump in jail already?  —  Donald Smith would be in a cell by now! … “Why isn't Donald Trump in jail already?”  —  It's a fair question, particularly in light of the flagrant gag order violations in Trump's Manhattan criminal trial, both by the man himself and his surrogates.",
    "url": "https://www.publicnotice.co/p/trump-merchan-gag-order-violations-jail-why-not"
  },
  {
    "text": "Biden bizarrely suggests he was VP during pandemic in latest blunder  —  President Biden bizarrely declared Sunday that things got “kinda bad” when he was vice president during the pandemic — even though COVID-19 hit three years after the Obama administration left office.",
    "url": "https://nypost.com/2024/05/20/us-news/biden-says-things-were-kinda-bad-when-he-was-vice-president-during-pandemic/"
  },
  {
    "text": "Biden: what would Trump have done if the Capitol riots had been led by Black Americans?  —  The US president Joe Biden asks at civil rights event: ‘what do you think he would have done ... if Black Americans had stormed the Capitol?’  —  Joe Biden has launched one of his most scathing attacks yet … ",
    "url": "https://www.theguardian.com/us-news/article/2024/may/20/joe-biden-donald-trump-january-6-capitol-riots-black-americans-naacp-dinner-speech-detroit"
  },
  {
    "text": "In Nevada, another GOP Senate contender downplays stance on abortion … - Brown is seeking the GOP nomination to unseat Sen. Jacky Rosen (D-Nev.) in a state that is a key battleground for the presidential race and the fight over which party will control the Senate.",
    "url": "https://www.axios.com/2024/05/20/nevada-senate-republicans-abortion-sam-brown"
  }
]