[
  {
    "text": "Bob Menendez, Al Franken, and the presumption of innocence  —  “Bob Menendez has been a dedicated public servant and is always fighting hard for the people of New Jersey.  He has a right to due process and a fair trial.”  —  That was the response of Senate Majority Leader Chuck Schumer … ",
    "url": "https://popular.info/p/bob-menendez-al-franken-and-the-presumption"
  },
  {
    "text": "Fetterman Plans to Give Back Menendez Donation In Cash-Filled Envelopes (Exclusive)  —  Fetterman is the only Senate Democrat to call on Menendez to resign after a federal bribery indictment  —  A Facebook icon representing an external link to share the article on Facebook.A Twitter icon representing … ",
    "url": "https://themessenger.com/politics/fetterman-plans-to-give-back-menendez-donation-in-cash-filled-envelopes-exclusive"
  },
  {
    "text": "Trump Floats the Idea of Executing Joint Chiefs Chairman Milley  —  The former president is inciting violence against the nation's top general.  America's response is distracted and numb.  —  Late Friday night, the former president of the United States—and a leading candidate to be the next president … ",
    "url": "https://www.theatlantic.com/ideas/archive/2023/09/trump-milley-execution-incitement-violence/675435/"
  },
  {
    "text": "Trump says he is buying Glock handgun at South Carolina event  — Former President Donald Trump said he was buying a Glock handgun at a campaign stop in South Carolina.  — A video posted on social media by Trump's spokesman, Steven Cheung, shows Trump being shown the firearm and commenting, “I want to buy one.”",
    "url": "https://www.cnbc.com/2023/09/25/trump-says-he-is-buying-glock-handgun-at-south-carolina-event.html"
  },
  {
    "text": "Trump pledges to investigate MSNBC parent company for ‘threatening treason’  —  Former President Trump pledged to investigate Comcast, the parent company for NBC and MSNBC, if he is elected in 2024, saying it “will be thoroughly scrutinized for their knowingly dishonest and corrupt coverage of people, things, and events.”",
    "url": "https://thehill.com/homenews/4221310-trump-pledges-to-investigate-msnbc-parent-for-threatening-treason/"
  },
  {
    "text": "Could a discharge petition keep the government open?  —  Good morning, Early Birds.  If you observe Yom Kippur, have an easy fast.  Tips: earlytips@washpost.com.  Was this forwarded to you?  Sign up here.  Thanks for waking up with us.  —  In today's edition ...  Sen. Bob Menendez holds … ",
    "url": "https://www.washingtonpost.com/politics/2023/09/25/could-discharge-petition-keep-government-open/"
  },
  {
    "text": "Writers Guild and studios reach tentative deal, potentially ending a monthslong strike that ground Hollywood to a halt  —  Los Angeles CNN  —  The major film and television studios and striking writers reached a tentative agreement on Sunday after days of marathon negotiating sessions … ",
    "url": "https://www.cnn.com/2023/09/24/business/wga-strike-ends-reaches-deal/"
  },
  {
    "text": "FOX NEWS CHANNEL'S SEAN HANNITY TO MODERATE THE RED STATE VS. BLUE STATE DEBATE BETWEEN FLORIDA GOVERNOR RON DESANTIS AND CALIFORNIA GOVERNOR GAVIN NEWSOM  —  NEW YORK - September 25, 2023 - FOX News Channel's Sean Hannity will moderate a red vs. blue state debate between Florida Governor … ",
    "url": "https://press.foxnews.com/2023/09/fox-news-channels-sean-hannity-to-moderate-the-red-state-vs-blue-state-debate-between-florida-governor-ron-desantis-and-california-governor-gavin-newsom"
  },
  {
    "text": "Newsom and DeSantis agree to debate on Fox News  —  Florida Gov. and Republican presidential candidate Ron DeSantis (R) and California Gov. Gavin Newsom (D) have agreed to participate in a televised debate in November that will be moderated by Fox News host Sean Hannity.",
    "url": "https://thehill.com/homenews/4221793-newsom-desantis-agree-fox-news-debate-nov-30/"
  },
  {
    "text": "GOP donor wants his money back after candidate hires Corey Lewandowski  —  An alleged unwanted advance causes ripples in Louisiana's gubernatorial primary two years later.  —  John Odom, a major Republican donor, has been a top backer of Louisiana gubernatorial candidate Jeff Landry.",
    "url": "https://www.politico.com/news/2023/09/25/john-odom-jeff-landry-corey-lewandowski-00117843"
  },
  {
    "text": "2 Looming Rulings Could Shape Trump's Fraud Trial in New York  —  Donald J. Trump has adopted a long-shot legal strategy to try to delay his upcoming civil trial and severely limit the case against him.  —  After four years of investigating and litigating, Letitia James was finally due for her day in court against Donald J. Trump.",
    "url": "https://www.nytimes.com/2023/09/25/nyregion/trump-letitia-james-fraud-lawsuit-trial.html"
  },
  {
    "text": "Biden is presiding over a labor renaissance  —  He's joining UAW workers on the picket line.  But his solidarity goes beyond symbolism. … President Joe Biden announced last week that he will join striking United Auto Workers (UAW) workers on the picket line in Michigan on Tuesday.",
    "url": "https://www.publicnotice.co/p/biden-labor-renaissance-uaw-strike-picketing"
  },
  {
    "text": "Leader of Canada's House of Commons apologizes for honoring man who fought for Nazis  —  The speaker of Canada's House of Commons apologized Sunday for recognizing a man who fought for a Nazi military unit during World War II.  Just after Ukrainian President Volodymyr Zelenskyy delievered … ",
    "url": "https://apnews.com/article/canada-parliament-apology-ukraine-nazi-eedc22e1d810011c412953168a4cee46"
  },
  {
    "text": "Kyrsten Sinema pitches donors on a ‘path to victory’ in Arizona by courting Republicans  —  A two-page document obtained by NBC News maps out a possible independent Senate bid, touting Sinema's record and suggesting she'd win over more Republicans than Democrats.",
    "url": "https://www.nbcnews.com/politics/2024-election/krysten-sinema-pitches-donors-arizona-senate-race-path-victory-rcna117002"
  },
  {
    "text": "Cardona wants a second term of his own  —  FOUR MORE YEARS?  — American schools are facing a moment of unique opportunity and peril.  That all sounds like a good challenge to Education Secretary Miguel Cardona, who is making it known he wants another term if President Joe Biden wins in 2024.",
    "url": "https://www.politico.com/newsletters/weekly-education/2023/09/25/cardona-wants-a-second-term-of-his-own-00117854"
  },
  {
    "text": "I served in the House for 28 years.  It's now more dysfunctional than ever.  —  I was back on Capitol Hill last week, where I had the dual experiences of meaningful memories of the past colliding with realities of the present.  —  Former staff members from my personal office … ",
    "url": "https://thehill.com/opinion/campaign/4221898-i-served-in-the-house-for-28-years-its-now-more-dysfunctional-than-ever/"
  },
  {
    "text": "Before Jan. 6, the FBI predicted extremists would be ‘very willing to take action’ over a 2020 election dispute  —  An FBI “red cell” report predicted that law enforcement action and a “lack of coordination” between groups would prevent widespread violence in response to a disputed election.",
    "url": "https://www.nbcnews.com/politics/justice-department/jan-6-fbi-predicted-extremists-willing-take-action-2020-election-dispu-rcna117173"
  }
]