[
  {
    "text": "Trump's Epstein Fiasco Worsens as Dems Suddenly Find Big New Weapon  —  Desperate times may call for desperate measures, but they also call for creative ones.  Faced with a criminal president and a GOP congressional majority that's wholly devoted to shutting down any and all transparency … ",
    "url": "https://newrepublic.com/article/198613/trump-epstein-fiasco-democrats-new-weapon"
  },
  {
    "text": "Democrats struggle against Trump-waged redistricting battle  —  The News  —  Democrats are struggling to respond to a White House-backed push to redraw Texas' congressional maps with five new safe GOP seats, which could short-circuit their entire midterm campaign effort.",
    "url": "https://www.semafor.com/article/07/30/2025/democrats-struggle-to-choose-their-weapons-in-a-trump-waged-redistricting-battle"
  },
  {
    "text": "Senate Confirms Conspiracy Theorist To Lead National Counterterrorism Center  —  You can't make it up, folks.  Senate Republicans voted Wednesday to confirm Joe Kent, a conspiracy theorist with alarming ties to white nationalists and far-right groups, to lead the National Counterterrorism Center.",
    "url": "https://www.huffpost.com/entry/trump-tariffs-white-house-latest_n_686ec29fe4b09bd98fe4be7e/liveblog_688aba56e4b015c1f1ba1ca7"
  },
  {
    "text": "Kamala Harris will not run for California governor, opening door for 2028 run  —  Harris has not ruled out another run for the White House, according to confidantes, while exploring the formation of a new group.  —  LOS ANGELES — Kamala Harris will not run for governor of California next year … ",
    "url": "https://www.washingtonpost.com/politics/2025/07/30/kamala-harris-governor-president-2028/"
  },
  {
    "text": "House Democrats Sue ICE for Barring Them From Detention Facilities  —  The 12 Democrats accused the Trump administration of violating the law when it turned them away from immigrant detention sites and imposed a new policy limiting congressional access.  —  A dozen House Democrats who were barred … ",
    "url": "https://www.nytimes.com/2025/07/30/us/politics/house-democrats-ice-lawsuit.html?unlocked_article_code=1.aU8.E5nf.s72A-xs4VIy0&smid=url-share"
  },
  {
    "text": "US sanctions Brazilian judge for prosecuting Trump ally Bolsonaro … “De Moraes is responsible for an oppressive campaign of censorship, arbitrary detentions that violate human rights, and politicized prosecutions — including against former President Jair Bolsonaro,” Bessent said in the statement.",
    "url": "https://www.politico.com/news/2025/07/30/us-sanctions-brazilian-judge-for-prosecuting-trump-ally-bolsonaro-00484538"
  },
  {
    "text": "Bessent says new Trump child savings accounts are ‘back door for privatizing Social Security’  —  Treasury Secretary Scott Bessent said Wednesday that the Trump administration was committed to protecting Social Security hours after he said in an interview that a new children's savings program … ",
    "url": "https://apnews.com/article/trump-child-savings-bessent-privatizing-social-security-97607050cfed0c423833ee7da88b4830"
  },
  {
    "text": "Congressional stock trading ban gets Senate panel's OK … “We have an opportunity here today to do something that the public has wanted us to do for decades, and that is to ban members of Congress from profiting on information that, frankly, only members of Congress have,” Hawley said.",
    "url": "https://www.politico.com/news/2025/07/30/senate-stock-trading-ban-pelosi-act-00484256"
  },
  {
    "text": "DHS Launches ‘Defend the Homeland’ Nationwide to Recruit Patriots to Join ICE Law Enforcement and Remove Worst of the Worst from U.S.  —  WASHINGTON - The Department of Homeland Security (DHS) today launched a new U.S. Immigration and Customs Enforcement (ICE) campaign to recruit brave … ",
    "url": "https://www.dhs.gov/news/2025/07/29/dhs-launches-defend-homeland-nationwide-recruit-patriots-join-ice-law-enforcement"
  },
  {
    "text": "Zohran Mamdani Scores 17-Point Lead with Jewish Voters in NYC Mayoral Race  —  New York State Assembly member Zohran Mamdani commands a 17-point lead among Jewish voters in the upcoming New York City mayoral race, according to newly released polling.  —  The survey from Zenith Research … ",
    "url": "https://www.newsweek.com/zohran-mamdani-has-17-point-jewish-voter-mayoral-race-lead-2106305"
  },
  {
    "text": "Army Secretary forces West Point to rescind appointment given to Easterly  —  The United States Military Academy abruptly ended the appointment of Jen Easterly to a high-profile academic position in West Point's Department of Social Sciences, according to a memorandum issued Wednesday by the Secretary of the Army.",
    "url": "https://cyberscoop.com/jen-easterly-west-point-mcdermott-chair-laura-loomer-dan-driscoll-army/"
  },
  {
    "text": "This Tuckahoe home won a $1.26 billion contract for an ICE detention center.  The owner isn't talking.  —  On July 18, the Acquisition Logistics Company received a contract worth a reported $1.26 billion from the federal government for the construction and operation of an immigrant detention center … ",
    "url": "https://www.richmonder.org/this-tuckahoe-home-won-a-1-26-billion-contract-for-an-ice-detention-center-the-owner-isnt-talking/"
  },
  {
    "text": "Judge Excoriates Trump Officials for Violations of Laws on Voice of America  —  The judge had ruled that the administration must restore news programming at Voice of America and has brought back only a fraction of the coverage it provided.  —  A federal judge said Wednesday that it was likely … ",
    "url": "https://www.nytimes.com/2025/07/30/us/politics/judge-excoriates-trump-officials-for-violations-of-laws-on-voice-of-america.html?unlocked_article_code=1.aU8.4Glp.95vCTqvAF7Jf&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Family of Epstein abuse survivor urges Trump not to pardon Ghislaine Maxwell: ‘A monster who deserves to rot in prison’  —  The family of Virginia Giuffre said any leniency extended to Maxwell would go down as “one of the highest travesties of justice” in history.",
    "url": "https://www.nbcnews.com/politics/donald-trump/jeffrey-epstein-virginia-giuffre-ghislaine-maxwell-trump-pardon-rcna222126"
  },
  {
    "text": "Patel found thousands of sensitive Trump-Russia probe docs inside ‘burn bags’ in secret room at FBI  —  EXCLUSIVE: FBI Director Kash Patel found a trove of sensitive documents related to the origins of the Trump-Russia probe buried in multiple “burn bags” in a secret room inside the bureau, sources told Fox News Digital.",
    "url": "https://www.foxnews.com/politics/patel-found-thousands-sensitive-trump-russia-probe-docs-inside-burn-bags-secret-room-fbi"
  },
  {
    "text": "Substack's “Nazi problem” won't go away after push notification apology … After Substack shocked an unknown number of users by sending a push notification on Monday to check out a Nazi blog featuring a swastika icon, the company quickly apologized for the “error,” tech columnist Taylor Lorenz reported.",
    "url": "https://arstechnica.com/tech-policy/2025/07/substacks-nazi-problem-wont-go-away-after-push-notification-apology/"
  },
  {
    "text": "High Noon Announces Recall of its Vodka Seltzer Beach Pack (12 Pack) Due to Inclusion of CELSIUS® ASTRO VIBE ™ Energy Drink Cans that were Inadvertently Filled with Vodka Seltzer  —  When a company announces a recall, market withdrawal, or safety alert, the FDA posts the company's announcement as a public service.",
    "url": "https://www.fda.gov/safety/recalls-market-withdrawals-safety-alerts/high-noon-announces-recall-its-vodka-seltzer-beach-pack-12-pack-due-inclusion-celsiusr-astro-vibe-tm"
  },
  {
    "text": "Report says radioactive wasp nest was found near South Carolina nuclear facility  —  AIKEN, S.C. (WCBD) - A radioactive wasp nest was recently found in South Carolina, according to a report from the Department of Energy.  —  The report says Radiological Control Operations … ",
    "url": "https://thehill.com/homenews/state-watch/5428259-radioactive-wasp-nest-south-carolina-nuclear-facility/"
  },
  {
    "text": "Scoop: Massie blindsided Mike Johnson on Trump truce  —  At Rep. Thomas Massie's request, House Speaker Mike Johnson successfully appealed directly to President Trump for a truce, multiple sources told Axios.  — But Massie broke the truce just days later, accusing top Republicans of covering up the Jeffrey Epstein files.",
    "url": "https://www.axios.com/2025/07/30/trump-truce-massie-johnson-epstein-files"
  },
  {
    "text": "I might lean left — but Marjorie Taylor Greene is winning my respect  —  The congresswoman, who represents my district, has shown genuine political courage lately.  —  Just now  —  I'm not a big fan of political labels.  They invite people to put you in a box, and the only box I want to be in is one labeled “open-minded.”",
    "url": "https://www.washingtonpost.com/opinions/2025/07/30/progressives-marjorie-taylor-greene-respect-israel/"
  },
  {
    "text": "Trump's DOJ rewrites inclusion rules for grant programs  —  The Trump administration is flipping language about inclusion and diversity on its head to the advantage of white Americans as a requirement to receive federal grants. … - The guidelines say that federal antidiscrimination laws apply … ",
    "url": "https://www.axios.com/2025/07/30/trumps-doj-dei-inclusion-rules-grant-programs"
  },
  {
    "text": "Brown University signs deal with Trump administration to restore funding  —  Brown University on Wednesday announced a deal with the Trump administration that ends three investigations into the institution and restores research funding that was withheld from it.",
    "url": "https://thehill.com/homenews/education/5428661-brown-university-trump-funding-mcmahon/"
  },
  {
    "text": "Musk's America Party can't get off the ground and was just to ‘blow off steam’ about Trump's bill … After his fallout with Trump and departure from the White House, Musk is transitioning back to focusing on his various companies and finding firmer footing in the political sphere.",
    "url": "https://ca.news.yahoo.com/musk-america-party-t-off-153643196.html"
  },
  {
    "text": "Personal Superintelligence  —  Over the last few months we have begun to see glimpses of our AI systems improving themselves.  The improvement is slow for now, but undeniable.  Developing superintelligence is now in sight.  —  It seems clear that in the coming years … ",
    "url": "https://www.meta.com/superintelligence/"
  },
  {
    "text": "Ex-CIA agent hits back at Tulsi Gabbard after she accused Obama of ‘treasonous conspiracy’ against Trump  —  Susan Miller says US intelligence chief's allegations were based on misrepresentations of discoveries made by her team about Russian actions  —  A former CIA officer who helped lead … ",
    "url": "https://www.theguardian.com/us-news/2025/jul/30/tulsi-gabbard-obama-russian-intelligence"
  },
  {
    "text": "MAGA Champion Who Said Trump Would Fight Child Predators Is Arrested on Charges of Being a Child Predator  —  ISN'T IT IRONIC  —  Scott Soucek, the husband of a prominent Wisconsin GOP operative, has been accused of possessing child pornography.  —  A fervent Trump supporter … ",
    "url": "https://www.thedailybeast.com/maga-champion-scott-soucek-said-trump-would-fight-child-predators-arrested-for-being-a-child-predator/"
  },
  {
    "text": "Arab states call on Hamas to disarm and relinquish power in unprecedented move  —  Arab and Muslim states including Qatar, Saudi Arabia and Egypt have for the first time issued a joint call for Hamas to disarm and relinquish power in the Gaza Strip as part of efforts to end the war in the territory.",
    "url": "https://cnn.com/2025/07/30/middleeast/arab-league-hamas-gaza-israel-intl"
  },
  {
    "text": "U.S. Economy Slowed in First Half of 2025 as Tariffs Scrambled Data  —  Gross domestic product rebounded in the spring after contracting at the start of the year, but consumer spending remained weak.  —  Economic growth softened in the first half of the year, as tariffs … ",
    "url": "https://www.nytimes.com/2025/07/30/business/us-economy-grew-in-second-quarter-as-tariffs-scrambled-data.html"
  },
  {
    "text": "Federal Reserve issues FOMC statement  —  For release at 2:00 p.m. EDT  —  Although swings in net exports continue to affect the data, recent indicators suggest that growth of economic activity moderated in the first half of the year.  The unemployment rate remains low, and labor market conditions remain solid.",
    "url": "https://www.federalreserve.gov/newsevents/pressreleases/monetary20250730a.htm"
  },
  {
    "text": "Trump administration freezes more than $100M in federal funding for Duke  —  The Trump administration has frozen $108 million to Duke University just days after it launched an investigation into alleged race-based discrimination at the institution.  —  The frozen funds from the National Institutes … ",
    "url": "https://thehill.com/homenews/education/5428043-duke-university-federal-funding-trump-mcmahon-kennedy-nih/"
  }
]