[
  {
    "text": "First on CNN: Fulton County DA to present Trump election subversion case to grand jury early next week  —  An Atlanta-area prosecutor has notified at least one witness to appear before a grand jury early next week, the most significant indication of her intention to seek indictments … ",
    "url": "https://www.cnn.com/2023/08/12/politics/geoff-duncan-georgia-election-probe/"
  },
  {
    "text": "BREAKING: Fulton grand jury to hear Trump case early next week  —  X  —  Fulton County District Attorney Fani Willis will begin presenting her 2020 elections interference case against former President Donald Trump and others to a grand jury early next week.",
    "url": "https://www.ajc.com/politics/breaking-fulton-grand-jury-to-hear-trump-case-early-next-week/EL7JW7LHTBGHRE2AMJ6OR6AYJ4/"
  },
  {
    "text": "Trump Election Interference Case to Go to Grand Jury in Georgia Early Next Week  —  Atlanta-area prosecutors have indicated that they will go before a grand jury early next week to present the results of their investigation into election interference by former President Donald J. Trump and his allies … ",
    "url": "https://www.nytimes.com/2023/08/12/us/trump-georgia-election-trial.html"
  },
  {
    "text": "Republicans Wanted a Special Counsel Investigation of Hunter Biden.  Now Many Oppose It.  —  Although some G.O.P. lawmakers see the appointment of David C. Weiss as a vindication of their strategy, others criticize the now-scuttled plea deal he struck with Mr. Biden.",
    "url": "https://www.nytimes.com/2023/08/12/us/politics/republicans-hunter-biden-special-counsel.html"
  },
  {
    "text": "Ron DeSantis and his backers paid $95,000 to an Iowa religious leader's group  —  As Florida Governor Ron DeSantis scrambles to shore up his struggling run for the Republican presidential nomination, he has spent far more than any rival on courting an influential Christian conservative leader … ",
    "url": "https://www.reuters.com/world/us/desantis-his-backers-paid-95000-iowa-religious-leaders-group-documents-show-2023-08-12/"
  },
  {
    "text": "DeSantis Gets Heckled and Trolled on His Big Day With Trump in Iowa  —  The Florida governor was hoping to have the stage to himself, but Donald Trump and his supporters have made that hard to achieve.  —  It's been said that a bad day at the fair is always better than a good day at work.",
    "url": "https://www.nytimes.com/2023/08/12/us/politics/iowa-state-fair-desantis-trump.html"
  },
  {
    "text": "‘Liar,’ ‘loser,’ a ‘national security threat’: Hurd rips into Trump  —  Republican presidential hopeful and former Texas Rep. Will Hurd ripped into former President Trump on Friday, calling him a “liar,” “loser” and “national security threat.”  —  Hurd, who has been sharply critical … ",
    "url": "https://thehill.com/homenews/campaign/4150149-liar-loser-a-national-security-threat-hurd-rips-into-trump/"
  },
  {
    "text": "Sheriff Says Former Trump Doctor Threatened to Beat Officer  —  Republican Congressman Ronny Jackson reportedly threatened a state trooper and vowed retribution against a local sheriff after he was briefly detained at a rodeo in July.  —  A Texas Republican who previously worked … ",
    "url": "https://www.thedailybeast.com/sheriff-says-former-trump-doctor-ronny-jackson-threatened-to-beat-officer-at-white-deer-rodeo"
  },
  {
    "text": "In Marion County newspaper raid, a grim threat to Kansans' First Amendment rights  —  Marion County Record papers for sale in the newspaper's office beside a collection of Kansas Press Association awards on Aug. 11, 2023, the day the office was raided by local law enforcement.  (Sam Bailey/Kansas Reflector)",
    "url": "https://kansasreflector.com/2023/08/12/in-marion-county-newspaper-raid-a-grim-threat-to-kansans-first-amendment-rights/"
  },
  {
    "text": "See where Sen. Tommy Tuberville is blocking 301 military promotions  —  From Alabama to Asia, the scope of senior military officers frozen in place by a dispute between Sen. Tommy Tuberville and Defense Secretary Lloyd Austin is vast, including not only the incoming leaders of the Joint Chiefs … ",
    "url": "https://www.washingtonpost.com/national-security/2023/08/12/military-promotions-blocked-tuberville/"
  },
  {
    "text": "Growing Segregation by Sex in Israel Raises Fears for Women's Rights  —  Ultra-Orthodox members of Prime Minister Benjamin Netanyahu's far-right coalition want to expand the powers of all-male rabbinical courts, and to bar women and men from mixing in many public arenas.  —  Reporting from Tel Aviv",
    "url": "https://www.nytimes.com/2023/08/12/world/middleeast/israel-women-rights.html"
  },
  {
    "text": "Debunking Florida's Argument That Slavery Could Benefit the Enslaved, in 120 Seconds  —  In my latest video, I tackle the controversy surrounding Florida's teaching standards.  These new guidelines, approved last month, sparked an avalanche of criticism by suggesting that enslaved Americans … ",
    "url": "https://www.motherjones.com/politics/2023/08/florida-slavery-tennessee-capitol-skills-video-scandal-desantis/"
  },
  {
    "text": "Trump blames left for legal costs  —  Trump's Save America PAC shrank from over $100 million at the beginning of last year to $3.6 million after bankrolling legal fees for the former president and his allies.  —  Former President Donald Trump on Saturday blamed his political enemies … ",
    "url": "https://www.politico.com/news/2023/08/12/trump-legal-costs-pac-00110960"
  },
  {
    "text": "‘Better martyrs’: the growing role of women in the far-right movement  —  The pipeline from mommy blogger to Tradwife to book-banner is an important aspect of the extreme right wing in the US  —  Researchers who track how the far right in in the US mobilizes, self-promotes and recruits … ",
    "url": "https://www.theguardian.com/world/2023/aug/12/conservative-women-tradwife-republican"
  },
  {
    "text": "Pence previews debate strategy at Iowa State Fair: Attack on abortion  —  Pence supports a national 15-week abortion ban  —  Former Vice President Mike Pence signaled Friday he will go on attack on abortion at the upcoming Republican presidential primary debate.",
    "url": "https://www.foxnews.com/politics/pence-previews-debate-strategy-iowa-state-fair-attack-abortion"
  }
]