[
  {
    "text": "Why Trump Blinked on Tariffs Just Hours After They Went Into Effect  —  Treasury secretary helped persuade president to take time to negotiate with trading partners in face of pressure from business leaders  —  President Trump finally blinked.  —  It took a week for the plunge in the stock … ",
    "url": "https://www.wsj.com/politics/policy/why-trump-blinked-on-tariffs-b588aea8?st=jQ73FX&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Trump Says He Will Consider Exempting Some U.S. Companies From Tariffs  —  President Trump said Wednesday that he's considering granting some U.S. companies an exemption from his tariff program.  “There are some that have been hard,” Trump told reporters when asked about companies requesting exemptions.",
    "url": "https://www.wsj.com/livecoverage/stock-market-trump-tariffs-trade-war-04-09-25/card/trump-says-he-will-consider-exempting-some-u-s-companies-from-tariffs-BXfdUETG5o197ZivMbn0"
  },
  {
    "text": "From ‘Be Cool!’ to ‘Getting Yippy’: Inside Trump's Reversal on Tariffs  —  Economic turmoil, particularly a rapid rise in government bond yields, caused President Trump to reverse course on the steep levies.  —  For the past week, President Trump has been urging calm in the face … ",
    "url": "https://www.nytimes.com/2025/04/09/us/politics/trump-tariff-pause-be-cool.html"
  },
  {
    "text": "Live Updates: U.S. Market Rally Fades as China Trade Tensions Intensify  —  Stocks slipped in early trading, as investors assessed the economic impact of trade negotiations.  The European Union paused its retaliatory tariffs and said it wanted to give talks with President Trump a chance.",
    "url": "https://www.nytimes.com/live/2025/04/10/business/trump-tariffs-stocks"
  },
  {
    "text": "Trump's ‘buy’ tip on social media before his tariffs pause made money for investors who listened  —  When Donald Trump offered some financial advice Wednesday morning, stocks were wavering between gains and losses.  But that was about to change.  —  “THIS IS A GREAT TIME TO BUY!!!",
    "url": "https://apnews.com/article/trump-truth-social-djt-tesla-musk-tariffs-pause-fccfa6b06c8f1ec0cd7844641ca52669"
  },
  {
    "text": "We Just Saw the Cracks in Trump's Wall of Power  —  The past week undermined the narrative that has surrounded the president — that he is a political juggernaut able to run roughshod over his party and beyond.  —  The opening months of President Donald Trump's second term have been studded … ",
    "url": "https://www.politico.com/news/magazine/2025/04/10/donald-trump-vulnerabilities-tariffs-budget-00283251"
  },
  {
    "text": "House Republicans Are Set to Pass a Voter Suppression Bill That Would Disenfranchise Millions  —  Two weeks after Donald Trump issued a sweeping anti-voting executive order, the House of Representatives is set to pass a measure, the SAVE Act, that is described by voting rights advocates … ",
    "url": "https://www.motherjones.com/politics/2025/04/save-act-voter-suppression-trump/"
  },
  {
    "text": "4/10/25 ☀️ AM: … Johnson and House GOP leaders delayed a vote on a compromise budget resolution, yielding to conservative hardliners who want deeper spending cuts than the Senate can likely stomach.  —  At the end of the day, Johnson had more than a dozen holdouts.",
    "url": "https://punchbowl.news/archive/41025-am/"
  },
  {
    "text": "Trump Signs Orders Punishing Those Who Opposed His 2020 Election Lies  —  The president targeted two officials from his first administration and an elite law firm as part of his campaign for retribution.  —  President Trump on Wednesday signed executive orders punishing two officials … ",
    "url": "https://www.nytimes.com/2025/04/09/us/politics/trump-executive-orders-law-firm-krebs.html"
  },
  {
    "text": "Judge finds Newsmax aired false and defamatory claims about voting-tech company  —  A Delaware judge, once again, has found that a conservative news outlet broadcast false and defamatory claims about the role a voting technology company played in the 2020 presidential election.",
    "url": "https://www.npr.org/2025/04/09/nx-s1-5357885/newsmax-dominion-defamation-2020-election"
  },
  {
    "text": "The Pool Filter  —  Some White House pool reports are no longer making it to the official distribution list, Status has learned—an unsettling development in the Trump administration's escalating war on the press.  —  At approximately six-thirty on Tuesday evening, Joseph Morton … ",
    "url": "https://www.status.news/p/white-house-censors-pool-reports"
  },
  {
    "text": "U.S. and Russia Swap Prisoners in Deal Arranged by Intelligence Agencies  —  Moscow releases Ksenia Karelina while Washington frees Arthur Petrov  —  Russia and the U.S. carried out a prisoner swap early Thursday in Abu Dhabi in a sign of continuing confidence building, as the two sides pursue a deal to end the war in Ukraine.",
    "url": "https://www.wsj.com/world/russia/u-s-and-russia-swap-prisoners-in-deal-arranged-by-intelligence-agencies-e6448f06?st=UctocP&reflink=article_whatsapp_share"
  },
  {
    "text": "Feds move to drop criminal case against man they previously called a major gang leader  —  Pam Bondi, Kash Patel and President Donald Trump celebrated his arrest.  —  Federal prosecutors have abruptly abandoned the criminal case against a Virginia man portrayed by the Justice Department … ",
    "url": "https://www.politico.com/news/2025/04/09/drop-criminal-case-man-called-gang-leader-00283355"
  },
  {
    "text": "American Is Arrested in Thailand on Charges of Criticizing Royalty  —  The U.S. State Department said it was alarmed at the arrest of Paul Chambers, a lecturer in civil-military relations, under Thailand's strict lèse-majesté laws.  —  The arrest of an American academic … ",
    "url": "https://www.nytimes.com/2025/04/09/us/paul-chambers-thailand-monarchy-arrest.html"
  },
  {
    "text": "Addressing Risks from Chris Krebs and Government Censorship  —  MEMORANDUM FOR THE HEADS OF EXECUTIVE DEPARTMENTS AND AGENCIES  —  The Federal Government has a constitutional duty and a moral responsibility to respect and promote the free speech rights of Americans.",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/04/addressing-risks-from-chris-krebs-and-government-censorship/"
  },
  {
    "text": "Rejected at her door, ICE nabs a Maryland woman in her car after smashing her window  —  The arrest was captured on camera by her daughter  —  This Monday started off like any other day for Karen Cruz Berrios.  —  The 18-year-old and her mother — Elsy Noemi Berrios, 52 … ",
    "url": "https://www.thebaltimorebanner.com/community/local-news/video-ice-arrest-wesminster-elsy-noemi-berrios-QJ7CIME76ZGPZEBW5C3REEPZ6E/"
  },
  {
    "text": "H.R. McMaster receives accidental call from President Trump  —  Just over a month ago, retired Lt. Gen. H.R. McMaster received an unexpected call on his personal cell, four sources told CBS News.  It was from the White House and he was instructed by the voice on the other end to stand by for the president.",
    "url": "https://www.cbsnews.com/news/h-r-mcmaster-trump-accidental-call/"
  },
  {
    "text": "Trump administration ends union dues collection for most feds without notice  —  The Trump administration has apparently ceased collecting federal workers' union dues via voluntary payroll deduction at agencies targeted by a recent executive order seeking to strip employees … ",
    "url": "https://www.govexec.com/workforce/2025/04/trump-administration-ends-union-dues-collection-most-feds-without-notice/404434/"
  },
  {
    "text": "NIH freezes all research grants to Columbia University  —  Trump administration fires staff for flagship U.S. climate assessment  —  After April Fools' Day purge, U.S. health agencies spiral into chaos  —  Sifter  —  Gene editing fixes DNA—and treats incurable lung and liver disease",
    "url": "https://www.science.org/content/article/nih-freezes-all-research-grants-columbia-university"
  },
  {
    "text": "Dow falls 1,000 points as tariff sell-off resumes after historic rally: Live updates  —  Stocks fell Thursday, giving back some of the historic rally seen in the previous session after President Donald Trump announced a 90-day reprieve on some of his “reciprocal” tariffs.",
    "url": "https://www.cnbc.com/2025/04/09/stock-market-today-live-updates.html"
  },
  {
    "text": "Tulsi Gabbard declared her residency in Texas.  Then she voted in Hawaii  —  As Tulsi Gabbard completed her transformation from a Hawaii Democratic politician to a MAGA surrogate last year, she put down stakes in a far redder state.  Gabbard and her husband bought a home outside of Austin … ",
    "url": "https://cnn.com/2025/04/09/politics/tulsi-gabbard-texas-hawaii-voting-residency-invs/"
  }
]