[
  {
    "text": "Scoop: U.S. put a hold on an ammunition shipment to Israel … - The incident raised serious concerns inside the Israeli government and sent officials scrambling to understand why the shipment was held, Israeli officials said.  — President Biden is facing sharp criticism among Americans who oppose his support of Israel.",
    "url": "https://www.axios.com/2024/05/05/israel-us-ammunition-shipment-hold"
  },
  {
    "text": "Sen. Tim Scott dodges on whether he would accept 2024 election results  —  The senator, who ran for the Republican nomination for president last year, repeatedly refused to say whether he'd accept this year's presidential election results, regardless of who wins.",
    "url": "https://www.nbcnews.com/politics/2024-election/sen-tim-scott-dodges-whether-accept-2024-election-results-rcna150758"
  },
  {
    "text": "GOP: Noem up in smoke; Scott, Burgum rise in Trump VP race  —  Republican senators say South Dakota Gov. Kristi Noem's (R) viability as a vice presidential candidate has gone up in smoke after she admitted to shooting a 14-month-old puppy, and they are looking to other contenders to round out former President Trump's ticket.",
    "url": "https://thehill.com/homenews/campaign/4642282-noem-scott-burgum-trump-vp/"
  },
  {
    "text": "Here's who was with Trump at RNC's Spring Meeting at Mar-a-Lago  —  Former President Trump held a private lunch event at his Mar-a-Lago Club over the weekend that hosted many top GOP donors and high-profile party leaders.  —  The fundraiser was largely seen as an audition for Trump's vice president within the GOP.",
    "url": "https://thehill.com/homenews/campaign/4644552-donald-trump-rnc-gop-mar-a-lago/"
  },
  {
    "text": "At Donor Retreat, Trump Calls Biden Administration the ‘Gestapo’  —  The speech by Donald J. Trump at a Republican National Committee fund-raising retreat came during his criminal trial in New York.  He faces a total of 88 criminal charges across four indictments.",
    "url": "https://www.nytimes.com/2024/05/04/us/politics/trump-donors.html"
  },
  {
    "text": "RNC co-chair Lara Trump: ‘You cannot have ballots counted after elections are over’  —  Republican National Committee co-chair Lara Trump argued Sunday that ballots should not be counted after elections are over.  —  While speaking to Fox News host Maria Bartiromo, Trump explained why her party … ",
    "url": "https://www.rawstory.com/lara-trump-counting-ballots/"
  },
  {
    "text": "‘They May Be Republicans, But They Still Come in for Services’  —  Many Latinas in conservative South Florida support abortion rights.  But will they vote to enshrine the right in the state constitution?  —  HIALEAH, Florida —  The clinic usually doesn't open until around 9 a.m. … ",
    "url": "https://www.politico.com/news/magazine/2024/05/05/abortion-ban-florida-women-00156107"
  },
  {
    "text": "Gallows Humor and Talk of Escape: Trump's Possible Return Rattles Capital  —  At Washington dinner parties, dark jokes abound about where to go into exile if the former president reclaims the White House.  —  It has become the topic of the season at Washington dinner parties and receptions.",
    "url": "https://www.nytimes.com/2024/05/05/us/politics/trump-biden-election-dc.html"
  },
  {
    "text": "What I'm telling my graduating students  —  My students are graduating at a tremulous time.  —  The largest campus protest movement of the 21st century.  The first criminal trial of a former U.S. president.  The most restrictive abortion laws in the nation.  Two horrific wars.",
    "url": "https://robertreich.substack.com/p/what-im-telling-my-graduating-students"
  },
  {
    "text": "6 months out, a tight presidential race with battle between issues and attributes: POLL  —  Trump has 46% support among U.S. adults and Biden 44% in a head-to-head matchup.  —  President Joe Biden speaks at a campaign rally for Democratic gubernatorial candidate Wes Moore at Bowie State University … ",
    "url": "https://abcnews.go.com/Politics/6-months-out-tight-presidential-race-trump-biden-poll/story?id=109909175"
  },
  {
    "text": "Kristi Noem Suggests Biden's Dog Should Have Been Killed, Too  —  The South Dakota governor, defending her tale of shooting and killing her family's dog, suggested that President Biden's German shepherd, Commander, had merited a similar fate.  —  Gov. Kristi Noem of South Dakota … ",
    "url": "https://www.nytimes.com/2024/05/05/us/politics/kristi-noem-biden-dog.html"
  },
  {
    "text": "GOP official argues in favor of child marriage: Girls are ‘ripe’ and ‘fertile’  —  The New Hampshire House passed a bill to ban child marriage in the state and raise the minimum age of marriage to 18.  —  The measure passed the Senate unanimously in March.  On Thursday, it passed the House, 192-174.",
    "url": "https://www.nj.com/politics/2024/05/gop-official-argues-in-favor-of-child-marriage-girls-are-ripe-and-fertile.html"
  },
  {
    "text": "Transcript: South Dakota Gov. Kristi Noem on “Face the Nation,” May 5, 2024  —  The following is a transcript of an interview with South Dakota Gov. Kristi Noem that aired on May 5, 2024.  —  MARGARET BRENNAN: We begin this morning with the Republican governor of the state of South Dakota, Kristi Noem, her upcoming memoir.",
    "url": "https://www.cbsnews.com/news/kristi-noem-south-dakota-governor-face-the-nation-transcript-05-05-2024/"
  },
  {
    "text": "Top RNC lawyer resigns after rift grows with Trump  —  The former president was angered by Charlie Spies's criticism of his false 2020 election-fraud claims.  —  The top lawyer at the Republican Party is resigning after he cited conflicts with his other work obligations and after Donald Trump grew angry … ",
    "url": "https://www.washingtonpost.com/politics/2024/05/04/trump-rnc-spies-election-fraud/"
  },
  {
    "text": "Don't give in to ‘the smallest, angriest group,’ university president says  —  “We just don't negotiate with people who scream the loudest,” former Sen. Ben Sasse said.  —  University of Florida President Ben Sasse said Sunday that he won't copy other university leaders in prioritizing … ",
    "url": "https://www.politico.com/news/2024/05/05/ben-sasse-florida-protests-00156168"
  }
]