[
  {
    "text": "CBS News VP debate poll shows voter reactions to Vance-Walz showdown  —  In the first — and likely only — vice-presidential debate between Tim Walz and JD Vance, voters who watched Tuesday night said it was an almost even match, and an overwhelming majority felt the tone of the debate was positive.",
    "url": "https://www.cbsnews.com/news/cbs-news-vp-debate-poll-2024/"
  },
  {
    "text": "The One Question That Mattered in the VP Debate  —  IN TUESDAY NIGHT'S VICE-PRESIDENTIAL DEBATE, JD Vance and Tim Walz covered lots of issues: inflation, housing, guns, abortion, immigration, health care, and much more.  —  But there was only one question on which the vice presidency … ",
    "url": "https://www.thebulwark.com/p/the-one-question-that-mattered-in-the-vp-debate-vance-walz"
  },
  {
    "text": "Dead even: POLITICO snap poll shows stark division on debate  —  The results reflect the country's hyper-polarized politics.  —  Talk about a divided nation: There was no decisive winner in the first-and-only vice presidential debate of the 2024 election.  —  Asked who won Tuesday's debate … ",
    "url": "https://www.politico.com/news/2024/10/02/politico-snap-poll-division-debate-00182131"
  },
  {
    "text": "Vance Makes a Better Case for Trump Than Trump  —  Both vice-presidential candidates put on a better, more informed, debate than their presidential running mates.  —  The political cliche is that vice-presidential debates don't matter to the ultimate election result.",
    "url": "https://www.wsj.com/opinion/vp-debate-jd-vance-tim-walz-cbs-2024-election-519c8d37"
  },
  {
    "text": "Walz vs Vance: Fact Checking the VP Debate  —  Tim Walz and JD Vance met for their first and only Vice Presidential debate.  Below I provide a comprehensive analysis on 10 of the most salient questions and subjects.  We have a lot to cover so let's dive in.  Likewise, please consider subscribing to support my work and advocacy.",
    "url": "https://www.qasimrashid.com/p/walz-vs-vance-fact-checking-the-vp"
  },
  {
    "text": "8 Body Language Tells From the Vice Presidential Debate  —  Body language revealed even more than words on the debate stage.  —  Before vice presidential contenders JD Vance and Tim Walz so much as opened their mouths on the debate stage in New York tonight, they both started talking to me.",
    "url": "https://www.politico.com/news/magazine/2024/10/02/walz-vance-vp-debate-body-language-analysis-00182127"
  },
  {
    "text": "Trump backs out of “60 Minutes” interview after appearing “scattered” and incoherent in Wisconsin  —  Trump's decision to pull out of the event came after he made confused and incoherent remarks on Tuesday  —  Former President Donald Trump backed out of an interview with “60 Minutes,” … ",
    "url": "https://www.salon.com/2024/10/02/backs-out-of-60-minutes-interview-after-appearing-confused-at-wisconsin-rally/"
  },
  {
    "text": "Trump mixes up words, swerves among subjects in off-topic speech  —  The Republican nominee appeared tired and complained about his heightened campaign schedule.  —  MILWAUKEE — Republican nominee Donald Trump spoke for 33 minutes before his first mention of the ostensible focus of his remarks.",
    "url": "https://www.washingtonpost.com/politics/2024/10/01/trump-wisconsin-swerves-subjects/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI3NzU1MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI5MTM3NTk5LCJpYXQiOjE3Mjc3NTUyMDAsImp0aSI6IjhmZDhmNGE1LWZhMTEtNGFkMi05ZjdkLTM3ZDI2MWQ5ZDIxMyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzEwLzAxL3RydW1wLXdpc2NvbnNpbi1zd2VydmVzLXN1YmplY3RzLyJ9.E00QenZ6mHuNVNIKz7lrPMQnl8nj_H2ZrFRyvIx3Z_0&itid=gfta"
  },
  {
    "text": "How unhinged must Trump get to even matter?  —  The irony is now painful.  For many years now, the artsy mountain resort city of Asheville, N.C. has been marketed to a growing retiree population as a “climate refuge,” a temperate inland fortress far from the potential killer hurricanes … ",
    "url": "https://www.inquirer.com/columnists/attytood/trump-crime-police-violence-cbs-news-debate-fact-check-20241001.html"
  },
  {
    "text": "Bombshell immunity filing details Trump's alleged ‘increasingly desperate’ bid to overturn 2020 election  —  Trump privately described claims of voter fraud as “crazy,” the filing says.  —  In this July 31, 2024, file photo, Republican presidential candidate former President Donald Trump waits … ",
    "url": "https://abcnews.go.com/US/bombshell-special-counsel-filing-includes-new-allegations-trumps/story?id=114409494"
  },
  {
    "text": "Kamala Harris's husband Doug Emhoff ‘forcefully slapped ex-girlfriend for flirting with another man’ in booze-fueled assault after date to star-studded gala  —  Vice President Kamala Harris's husband assaulted his ex-girlfriend, three friends have told Dailymail.com.",
    "url": "https://www.dailymail.co.uk/news/article-13898791/Kamala-Harris-husband-Doug-Emhoff-accused-ex-girlfriend-slap.html"
  },
  {
    "text": "‘Iran made a big mistake’: Israel promises revenge after missile attack  —  Israel has vowed revenge after Iran's missile attack on Tuesday, the latest development in what Iran said was a retaliation for Israel's airstrikes in Lebanon, where Hezbollah is based, and its killing of Hezbollah leader Hassan Nasrallah.",
    "url": "https://www.usatoday.com/story/news/world/2024/10/02/israel-iran-missile-attack-what-happens-next/75478676007/"
  },
  {
    "text": "Internal Emails Reveal How Hate Overwhelmed Springfield After Trump's Lies About Haitian Immigrants  —  A cache of internal emails obtained by 404 Media using a public records request show the chaos caused by the unfounded racist conspiracy theory that Haitian immigrants are “eating the pets” of residents in Springfield, Ohio.",
    "url": "https://www.404media.co/internal-emails-reveal-how-hate-overwhelmed-springfield-after-trumps-lies-about-haitian-immigrants/"
  },
  {
    "text": "Elon Musk Gave Tens of Millions to Republican Causes Far Earlier Than Previously Known  —  The donations were to groups with ties to former Trump aide Stephen Miller and to Florida Gov. Ron DeSantis's presidential bid  —  Elon Musk's financial support for Republican causes has been much more extensive … ",
    "url": "https://www.wsj.com/politics/policy/elon-musk-political-donations-stephen-miller-desantis-39464294?st=4P8BX7&email=467cb6399cb7df64551775e431052b43a775c749&emaila=12a6d4d069cd56cfddaa391c24eb7042&emailb=054528e7403871c79f668e49dd3c44b1ec00c7f611bf9388f76bb2324d6ca5f3&utm_source=Sailthru&utm_medium=email&utm_campaign=10.2.24%20Business%20and%20Economy%20-%20AF"
  },
  {
    "text": "Harris backs striking port workers, knocks Trump  —  Vice President Harris voiced her support Wednesday for striking port workers, while also bashing her rival former President Trump, after tens of thousands of longshoreman at ports along the East Coast and Gulf of Mexico walked off the job.",
    "url": "https://thehill.com/homenews/administration/4911841-harris-supports-striking-longshoremen/"
  },
  {
    "text": "Swing State Polling Finds Deadlocked Presidential Contest, ‘Blue Wall’ Senate Races Tighten  —  A new Cook Political Report Swing State Project Survey conducted by BSG and GS Strategy Group (September 19-25; 2,941 voters), shows Vice President Kamala Harris leading or tied with former President Donald Trump … ",
    "url": "https://www.cookpolitical.com/analysis/survey-research/2024-swing-state-project/swing-state-polling-finds-deadlocked-presidential"
  },
  {
    "text": "In deep-blue Philly, working class voters are shifting toward Republicans  —  In deep-blue Philly, working class voters are shifting toward Republicans  —  Democrats have lost the most ground in neighborhoods where poverty rates are highest.  It could hurt Kamala Harris in November.",
    "url": "https://www.inquirer.com/politics/election/inq2/philadelphia-working-class-voters-republican-20241001.html"
  },
  {
    "text": "Oct. 7 ‘vigil for Gaza’ at University of Maryland ‘inappropriate,’ governor says  —  Maryland Gov. Wes Moore (D) says he will respect a court decision allowing a “vigil for Gaza” planned at the University of Maryland on Oct. 7, but he considers it “inappropriate” to hold the event on the anniversary of Hamas's attack against Israel.",
    "url": "https://thehill.com/homenews/education/4911711-oct-7-vigil-for-gaza-university-of-maryland-wes-moore-hamas-israel/"
  }
]