[
  {
    "text": "“Horrible mess”: Trump called out for “ungodly” profanity-laced tirade at Catholic event  —  “Who does that?” questioned former Republican lawmaker Barbara Comstock, calling Trump a “buffoon”  —  The Alfred E. Smith Memorial Foundation Dinner, an annual Catholic charity event in New York City … ",
    "url": "https://www.salon.com/2024/10/18/horrible-mess-called-out-for-ungodly-profanity-laced-tirade-at-catholic-event/"
  },
  {
    "text": "Fox News disputes Trump's claim that its employees helped write his jokes  —  Donald Trump says Fox News employees helped him write his jokes for the Al Smith dinner.  Fox says that's fake news.  The former president, whose roast of Kamala Harris and other Democrats at Thursday's Al Smith dinner pulled … ",
    "url": "https://www.politico.com/live-updates/2024/10/18/2024-elections-live-coverage-updates-analysis/trump-fox-news-jokes-00184409"
  },
  {
    "text": "Trump admits he's demanding Rupert Murdoch stop running ‘negative ads’ on Fox News  —  Donald Trump ended his interview with “The Fox & Friends” by admitting he was about to issue some demands for the network's founder Rupert Murdoch.  —  Trump was in the studio on Friday morning for the show he typically calls into.",
    "url": "https://www.rawstory.com/fox-news-trump-rupert-murdoch/"
  },
  {
    "text": "Harris says it is part of the American tradition for VPs not to criticize the president  —  NBC News spoke to the vice president exclusively after her rally in Grand Rapids, Michigan.  —  GRAND RAPIDS, Mich. — Vice President Kamala Harris on Friday continued to steer clear … ",
    "url": "https://www.nbcnews.com/politics/2024-election/harris-says-part-american-tradition-vps-not-criticize-president-rcna176160?_branch_match_id=1375921366908302608"
  },
  {
    "text": "Trump cancels a streak of events with only days until election … - Vice President Kamala Harris, on the other hand, has been on a media blitz after enduring criticism from Republicans about a perceived lack of interviews.  — And while Harris has ventured into the unfriendly territory … ",
    "url": "https://www.axios.com/2024/10/18/trump-cancels-interviews-2024"
  },
  {
    "text": "An ‘exhausted’ Trump says no to another interview  —  Recently, it's become something of a pattern: Donald Trump is scheduled for an interview with a neutral media outlet, the date nears and then ... things fall apart.  It happened just this week to planned Trump sit-downs with NBC in Philadelphia and CNBC's … ",
    "url": "https://www.politico.com/live-updates/2024/10/18/2024-elections-live-coverage-updates-analysis/trump-skips-another-interview-00184327"
  },
  {
    "text": "A Mystery $30 Million Wave of Pro-Trump Bets Has Moved a Popular Prediction Market  —  Four Polymarket accounts have systematically placed frequent wagers on a Trump election victory  —  Vice President Kamala Harris and former President Donald Trump are neck and neck in the polls.",
    "url": "https://www.wsj.com/finance/betting-election-pro-trump-ad74aa71?st=SbQdzx&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Playbook: Trump's media backout  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  A ONE-TWO PUNCH — With 18 days left until Election Day, VP KAMALA HARRIS will be hitting the road with the two most popular members of her party: BARACK and MICHELLE OBAMA.",
    "url": "https://www.politico.com/newsletters/playbook/2024/10/18/trumps-media-backout-00184324"
  },
  {
    "text": "New evidence unsealed of how Trump's Jan. 6, 2021 rally was funded  —  Bart Jansen Josh Meyer Aysha BagchiUSA TODAY  —  WASHINGTON - A trove of new records released in the federal election-interference case against former President Donald Trump described how money was spent on Trump's … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/10/18/donald-trump-election-interference-case-new-evidence/75714784007/"
  },
  {
    "text": "This Is Exactly How an Elon Musk-Funded PAC Is Microtargeting Muslims and Jews With Opposing Messages  —  An Elon Musk-funded group called Future Coalition PAC is targeting Muslim voters in Michigan and Jewish voters in Pennsylvania with diametrically opposed political advertisements about Kamala Harris.",
    "url": "https://www.404media.co/this-is-exactly-how-an-elon-musk-funded-pac-is-microtargeting-muslims-and-jews-with-opposing-messages/"
  },
  {
    "text": "How Silicon Valley Billionaires Became Trump's Biggest Donors … Last February, the billionaire financier Nelson Peltz summoned a group of about 20 wealthy, predominantly Republican donors and a handful of G.O.P. strategists to dinner at his $334 million waterfront estate in Palm Beach … ",
    "url": "https://www.nytimes.com/2024/10/18/magazine/trump-donors-silicon-valley.html?unlocked_article_code=1.TE4.yMQN.L2APvfL4FtSL&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "It Sure Looks Like Trump Watches Are Breaking Copyright Law  —  The company behind Trump Watches prominently features an iconic image of the presidential candidate on its timepieces.  There's one big problem: It's not allowed to.  —  In late September, Donald Trump gushed on Truth Social … ",
    "url": "https://www.wired.com/story/it-sure-looks-like-trump-watches-are-breaking-copyright-law/"
  },
  {
    "text": "Trump Is Speaking Like Hitler, Stalin, and Mussolini  —  To support The Atlantic's journalism, please consider subscribing today.  —  Rhetoric has a history.  The words democracy and tyranny were debated in ancient Greece; the phrase separation of powers became important in the 17th and 18th centuries.",
    "url": "https://www.theatlantic.com/politics/archive/2024/10/trump-authoritarian-rhetoric-hitler-mussolini/680296/?gift=hVZeG3M9DnxL4CekrWGK34vU4G4QMrQTKJxena1OKFY&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "A Candidate for U.S. Senate Says He Was Shot in War.  Was He? … Doubts have been raised about whether Tim Sheehy sustained a bullet wound as a Navy SEAL in Afghanistan.Tailyr Irvine for The New York Times  —  In a book and in his campaign for the U.S. Senate in Montana … ",
    "url": "https://www.nytimes.com/2024/10/18/us/tim-sheehy-gunshot-wound-montana-senate.html?unlocked_article_code=1.TE4.iTsg.GztoQXuHs92i&smid=nytcore-ios-share&referringSource=articleShare&tgrp=cpy"
  },
  {
    "text": "Trump overcharged Secret Service agents to stay at his D.C. hotel, new Democratic report says  —  Then-President Donald Trump also benefited from U.S. officials and others seeking jobs and pardons who paid for stays at his downtown Washington hotel, House Democrats allege.",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-secret-service-dc-hotel-emoluments-pardons-jobs-democrat-report-rcna175714"
  },
  {
    "text": "With Sinwar Dead, We Must End the War in Gaza  —  The death of Yahya Sinwar, the Hamas leader who was believed to be the mastermind of the Oct. 7 attack, provides a new opening for the United States to meaningfully push for a cease-fire and hostage release in Gaza and for the de-escalation of violence across the Middle East.",
    "url": "https://www.nytimes.com/2024/10/17/opinion/yahya-sinwar-dead-hamas-gaza.html"
  },
  {
    "text": "Judge dubious of ‘creative’ GOP lawsuit challenging Pennsylvania's overseas voting procedures  —  HARRISBURG, Pennsylvania — A GOP challenge to Pennsylvania's procedures for overseas voters appeared to run aground here Friday as a federal judge called the lawsuit “creative,” … ",
    "url": "https://www.politico.com/live-updates/2024/10/18/2024-elections-live-coverage-updates-analysis/lawsuit-pennsylvania-overseas-voters-00184448"
  },
  {
    "text": "Georgia passes 1 million early voting mark  —  Big turnout comes as Harris, Trump continue to treat Georgia as a must-win state  —  More than 1 million Georgia voters have already cast ballots as the state remains a focus in one of the closest presidential contests in recent memory.",
    "url": "https://www.ajc.com/politics/election/georgia-passes-1-million-vote-mark/KNMH3BTAJNELXJW7SYVZPZ34CU/"
  },
  {
    "text": "What should be in your civic information diet?  —  Good afternoon from Washington, where I just finished listening to the first meeting of the U.S. government's Open Government Federal Advisory Committee over on Zoom.  Administrative meetings like this aren't usually open … ",
    "url": "https://civic-texts.ghost.io/what-should-be-in-your-civic-information-diet/"
  }
]