[
  {
    "text": "Cannon tells lawyers to weigh if Trump conduct can't be reviewed by courts  —  In classified documents case, legal arguments over jury instructions seem to take precedence over numerous other pretrial issues  —  The judge overseeing Donald Trump's classified-documents case issued … ",
    "url": "https://www.washingtonpost.com/national-security/2024/03/18/trump-judge-cannon-jury-instructions-pra/"
  },
  {
    "text": "Trump is making the Jan. 6 attack a cornerstone of his bid for the White House  —  WASHINGTON (AP) — Republican Donald Trump has launched his general election campaign not merely rewriting the history of the Jan. 6, 2021, Capitol attack, but positioning the violent siege and its failed attempt … ",
    "url": "https://apnews.com/article/donald-trump-jan-6-pardons-2024-campaign-2401ead35cb1402a7b289c2c99761373"
  },
  {
    "text": "Trump's call for a “bloodbath” was literal — let's not waste time pretending it was ambiguous  —  Trump hides his threats of fascist violence in plain sight — here is how to fight back  —  When Donald Trump declared “If I don't get elected, it's going to be a bloodbath” … ",
    "url": "https://www.salon.com/2024/03/19/call-for-a-bloodbath-was-literal--lets-not-waste-time-pretending-it-was-ambiguous/"
  },
  {
    "text": "Trump Golf Club Settlement Hangs Alina Habba Out to Dry  —  The former president's lawyer may still face fallout for her involvement in an ex-employee's hush money deal over harassment claims at Trump's Bedminster club. … Donald Trump's golf club in Bedminster, New Jersey … ",
    "url": "https://www.thedailybeast.com/trump-new-jersey-golf-club-settlement-hangs-lawyer-alina-habba-out-to-dry"
  },
  {
    "text": "Grisham lists properties that would ‘devastate’ Trump if seized  —  Former White House press secretary Stephanie Grisham proposed a list of properties former President Trump would be most disappointed to have seized if he cannot pay the damages in his civil fraud case.",
    "url": "https://thehill.com/regulation/court-battles/4541386-grisham-lists-properties-that-would-devastate-trump-if-seized/"
  },
  {
    "text": "Is Donald Trump About to Go Bankrupt?  —  Debt is becoming a major campaign issue in 2024.  I don't mean the national debt, which today stands at 99 percent of gross domestic product and which, the Congressional Budget Office projects, will total 116 percent of GDP 10 years from now.",
    "url": "https://newrepublic.com/article/179879/trump-legal-debts-chubb-payment"
  },
  {
    "text": "Trump can't find anyone to spot him $464 million.  Would you?  —  Of course no one will lend Donald Trump the half-billion dollars he needs to put up while appealing his fraud case.  Would you?  —  In recent months, the former president has racked up a series of costly legal judgments for his many misdeeds.",
    "url": "https://www.washingtonpost.com/opinions/2024/03/18/trump-civil-fraud-case-appeal-bond/"
  },
  {
    "text": "Trump sues ABC and Stephanopoulos, alleging defamation over Mace interview  —  Former President Trump sued ABC News and George Stephanopoulos, alleging defamation over the anchor's questioning of Rep. Nancy Mace (R-S.C.) about her endorsement of Trump.  —  The March 10 interview on “This Week” … ",
    "url": "https://thehill.com/regulation/court-battles/4541257-trump-sues-abc-stephanopoulos-alleging-defamation-mace-interview/"
  },
  {
    "text": "The Ego Has Crash-Landed  —  Donald Trump dominated the news cycle this weekend.  Everybody's talking about the outrageous things he said at his rally in Dayton, Ohio—above all, his menacing warning of a “bloodbath” if he is defeated in November.  To follow political news is to again be immersed in all Trump, all the time.",
    "url": "https://www.theatlantic.com/politics/archive/2024/03/donald-trump-ego-election-2024/677797/"
  },
  {
    "text": "Ex-Trump aide Peter Navarro heads to prison after historic contempt prosecution  —  Peter Navarro, an ex-White House aide to former President Donald Trump, is scheduled to turn himself in Tuesday to a federal prison in Miami, making history as the first former White House official to be imprisoned for a contempt of Congress conviction.",
    "url": "https://www.cnn.com/2024/03/19/politics/peter-navarro-jail-contempt-of-congress/"
  },
  {
    "text": "Pro-Trump Michigan attorney arrested after hearing in DC over leaking Dominion documents  —  An attorney facing criminal charges for illegally accessing Michigan voting machines after the 2020 election was arrested Monday after a hearing in a separate case in federal court in Washington, D.C.",
    "url": "https://apnews.com/article/voting-machines-dominion-defamation-68d3f3a4e840ccb7a81d72837c4f6b3e"
  },
  {
    "text": "Congressional Leaders Strike Deal on Final Spending Bill Ahead of Shutdown  —  Lawmakers resolved disputes over Department of Homeland Security funding, paving the way for an agreement.  But they may still be unable to meet a Friday deadline to avert a brief partial shutdown.",
    "url": "https://www.nytimes.com/2024/03/19/us/politics/congress-spending-bill-shutdown.html"
  },
  {
    "text": "March 18, 2024  —  It seems to me that the news tends to be slow on weekends during the Biden administration, while Mondays are a firehose.  (In contrast, Trump's people tended to dump news in the middle of the night, after Fox News Channel personality Sean Hannity's show was over, which may or may not have been a coincidence.)",
    "url": "https://heathercoxrichardson.substack.com/p/march-18-2024"
  },
  {
    "text": "Trump Says Jews Who Support Democrats ‘Hate Israel’ and ‘Their Religion’  —  The comments, on a conservative radio program, echo an antisemitic trope and escalate claims he made as president that were widely criticized.  —  Former president Donald J. Trump accused Jewish voters of hating … ",
    "url": "https://www.nytimes.com/2024/03/18/us/politics/trump-israel-jewish-voters.html"
  },
  {
    "text": "Biden to target ‘rent gouging’ landlords as high housing costs factor into 2024 race  — President Biden plans to target landlords he claims are keeping rents artificially high.  — Biden's attack on ‘rent gouging’ seeks to shift the blame for stubbornly high housing costs partly onto … ",
    "url": "https://www.cnbc.com/2024/03/19/biden-targets-rent-gouging-landlords-as-high-housing-costs-2024-race.html"
  },
  {
    "text": "Trader Joe's cashews sold in 16 states are recalled over salmonella threat  —  Story at a glance  — Wenders LLC, based in Dublin, California, is recalling some lots of Trader Joe's 50% Less Sodium Roasted & Salted Whole Cashews, which were sold in 16 states.",
    "url": "https://thehill.com/changing-america/well-being/prevention-cures/4541630-trader-joes-cashews-sold-in-16-states-are-recalled-over-salmonella-threat/"
  },
  {
    "text": "Potential 2024 candidates keep saying no, but No Labels is pressing forward anyway  —  More than a dozen prominent potential presidential candidates have said no after approaches from the group, which is behind its stated ballot access goal.  —  No Labels is still working to find … ",
    "url": "https://www.nbcnews.com/politics/2024-election/potential-2024-candidates-keep-telling-no-no-labels-pressing-forward-rcna142960?taid=65f97e49cb10a20001a25653"
  },
  {
    "text": "Hong Kong Passes New Security Bill Cementing China's Control  — Article 23 was fastest bill passed in the city since 1997  — Critics say new law could diminish open economic discussion  —  Hong Kong has fast-tracked into law domestic security legislation that critics … ",
    "url": "https://www.bloomberg.com/news/articles/2024-03-19/hong-kong-passes-local-security-bill-cementing-china-s-control"
  },
  {
    "text": "Trump Hints Again at Deporting Harry Over Drug Use: 'We'll Have to See'  —  Prince Harry's admission of drug use in his memoir could make him vulnerable to politically motivated action if Trump wins in November.  —  Donald Trump has once again hinted that, under a second Trump administration … ",
    "url": "https://www.thedailybeast.com/trump-hints-at-deporting-prince-harry-over-drugs-well-have-to-see"
  },
  {
    "text": "Despite Bans, Number of Abortions in the United States Increased in 2023  —  Isaac Maddow-Zimet, Guttmacher Institute  —  Reproductive rights are under attack.  Will you help us fight back with facts?  —  New findings from the Monthly Abortion Provision Study show that an estimated 1,026 … ",
    "url": "https://www.guttmacher.org/2024/03/despite-bans-number-abortions-united-states-increased-2023"
  },
  {
    "text": "The Left turns on Fani Willis after judge finds ‘an odor of mendacity remains’ in her case against Trump  —  Many of us were demoralized by Fulton County Judge Scott McAfee's decision on Friday to allow District Attorney Fani Willis to continue prosecuting the RICO case against former President Donald Trump and his co-defendants.",
    "url": "https://www.washingtonexaminer.com/restoring-america/2925716/left-turns-on-willis-judge-finds-odor-of-mendacity-case-against-trump/"
  },
  {
    "text": "EPA bans asbestos, a deadly carcinogen still in use decades after a partial ban was enacted  —  The Environmental Protection Agency on Monday announced a comprehensive ban on asbestos, a carcinogen that kills tens of thousands of Americans every year but is still used in some chlorine bleach, brake pads and other products.",
    "url": "https://apnews.com/article/epa-asbestos-cancer-brakes-biden-72b0fa8b36adedaff6000034d35c2acd"
  }
]