[
  {
    "text": "What J.D. Vance really believes  —  I met Sen. J.D. Vance (R-OH), Donald Trump's new choice for vice president, in the summer of 2022.  I was covering a conservative conference in Israel, and Vance was the surprise VIP attraction.  We chatted for a bit about the connections between right … ",
    "url": "https://www.vox.com/politics/360283/jd-vance-trump-vp-vice-president-authoritarian"
  },
  {
    "text": "Behind the Curtain: Why J.D. … - Youth & vigor: Vance, who turns 40 in two weeks, is half Trump's age. … - Smart: Vance can put an intellectual wrapper around Trump's red meat. … - American Dream bio: James David Vance grew up in a broken Rust Belt home in Middletown, Ohio, with deep ties to Appalachia.",
    "url": "https://www.axios.com/2024/07/16/trump-vp-pick-jd-vance-rnc"
  },
  {
    "text": "Trump's incredible lucky streak  —  Good morning, Early Birds.  The Republican National Convention is being held a few blocks from where Theodore Roosevelt — another former president seeking to return to the White House — was shot in 1912.  Like Donald Trump, Roosevelt survived the attempted assassination.",
    "url": "https://www.washingtonpost.com/politics/2024/07/16/trumps-incredible-lucky-streak/"
  },
  {
    "text": "Europe reacts to J.D. Vance as Trump's VP pick: ‘This is a disaster for Ukraine’  —  “This is a disaster for Ukraine.”  Those are the words of one senior EU official today as Europe reacted to Donald Trump's choice of Ohio senator J.D. Vance as his running mate.",
    "url": "https://www.politico.com/live-updates/2024/07/15/rnc-live-updates-coverage/eu-on-vance-disaster-for-ukraine-00168463"
  },
  {
    "text": "Who Is Usha Vance, the Wife of J.D. Vance?  —  The two met at Yale Law School, and Ms. Vance has helped him along in his political rise ever since — including now to Donald J. Trump's vice-presidential pick.  —  If you were to build a member of the American elite from scratch, she might look something like Usha Vance.",
    "url": "https://www.nytimes.com/2024/07/15/style/usha-vance-jd-vance.html"
  },
  {
    "text": "Playbook: Trump upstages Vance on Night 1  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  The first day of the GOP convention in Milwaukee was supposed to be about something mundane: economic policy.  The slogan was “Make America Wealthy Once Again.”",
    "url": "https://www.politico.com/newsletters/playbook/2024/07/16/trump-upstages-vance-on-night-1-00168591"
  },
  {
    "text": "The risk of J.D. Vance  —  Trump went with the MAGA pick.  But the 2022 election suggests that might not be the right electoral one.  —  During the 2022 election, Republicans nominated unpopular candidates aligned with Donald Trump.  As a group, they most likely cost the party a chance to win the U.S. Senate.",
    "url": "https://www.washingtonpost.com/politics/2024/07/15/risk-jd-vance/"
  },
  {
    "text": "The inside story of how Trump chose JD Vance as his running mate  —  Once a critic, Vance repositioned himself as an faithful ally eager to defend Trump on TV, carry a torch for a younger generation of MAGA figures and fight for voters in the Midwest.  —  MILWAUKEE — With the clock ticking … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-chose-jd-vance-running-mate-vp-pick-rcna161982"
  },
  {
    "text": "Elon Musk has said he plans to commit around $45 million a month to a new super political-action committee backing former President Donald Trump's presidential run, according to people familiar with the matter.  —  Other backers of the group, called America PAC, include Palantir Technologies … ",
    "url": "https://www.wsj.com/politics/elections/elon-musk-has-said-he-is-committing-around-45-million-a-month-to-a-new-pro-trump-super-pac-dda53823"
  },
  {
    "text": "Firefighter Corey Comperatore's widow refused Biden call after Trump rally shooting: 'Didn't want to talk to him'  —  SARVER, Pa. — The heartbroken widow of Corey Comperatore, the hero firefighter shot dead by a sniper at a Trump rally, wanted nothing to do with President Biden when he called after the tragedy, she told The Post.",
    "url": "https://nypost.com/2024/07/15/us-news/corey-comperatores-widow-refused-biden-call-after-trump-rally-shooting/"
  },
  {
    "text": "Swing states get prime spots on the RNC convention floor — except one  —  As more than 2,400 delegates gather in Milwaukee for the Republican National Convention, some will have much better seats than others in Fiserv Forum.  —  MILWAUKEE — The live band playing “God Bless the U.S.A.” … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/15/republican-national-convention-floor-maps/"
  },
  {
    "text": "Stop Pretending You Know How This Will End  —  The failed assassination of Donald Trump might not have any lasting effect on the election or politics in general.  —  In the immediate aftermath of the failed attempt on Donald Trump's life, pundits and politicians rushed to proclaim … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/07/assassination-attempt-election-predictions/679025/"
  },
  {
    "text": "These Republicans use violent rhetoric.  They are featured speakers at the RNC.  —  In the wake of the attempted assassination of Donald Trump, his top political aides and allies are blaming Democrats for inciting the horrific attack.  The co-manager of Trump's campaign, Chris LaCivita … ",
    "url": "https://popular.info/p/these-republicans-use-violent-rhetoric"
  },
  {
    "text": "ABC Exclusive: Trump rally shooting ‘unacceptable,’ Secret Service director says  —  “The buck stops with me,” Kimberly Cheatle said in an ABC News interview.  —  U.S. Secret Service Director Kimberly Cheatle sat down with ABC News in her first network interview since the assassination attempt on former President Donald Trump.",
    "url": "https://abcnews.go.com/US/trump-rally-shooting-unacceptable-secret-service-director-abc-exclusive/story?id=111962314"
  },
  {
    "text": "Special counsels are unconstitutional if they make Trump sad  —  So says Aileen Cannon, who makes a mockery of the rule of law. … It finally happened.  —  Judge Aileen Cannon, who has been telegraphing for months that she was committed to finding a way to get Trump off the hook … ",
    "url": "https://www.publicnotice.co/p/aileen-cannon-jack-smith-unconstitutional"
  },
  {
    "text": "Trump met with Robert F. Kennedy Jr. to seek endorsement  —  Former President Donald Trump met this morning in Milwaukee with Robert F. Kennedy Jr. to discuss the possibility of the independent candidate endorsing the Republican nominee, according to multiple people familiar with the huddle.",
    "url": "https://www.politico.com/live-updates/2024/07/15/rnc-live-updates-coverage/trump-met-with-rfk-jr-00168412"
  },
  {
    "text": "FBI, DHS warn of possible retaliation for attack on Trump  —  Intelligence bulletin raises alarm about election violence.  —  U.S. authorities are concerned about possible attacks in retaliation to the attempted assassination of Donald Trump, the FBI and Department of Homeland Security … ",
    "url": "https://www.politico.com/news/2024/07/15/fbi-dhs-possible-retaliation-trump-shooting-00168549"
  },
  {
    "text": "‘We are speaking of a failure’: Mayorkas on security at Trump rally  —  Secretary of Homeland Security Alejandro Mayorkas called the security a “failure” at former President Donald Trump's rally where he was nearly assassinated in Butler, Pennsylvania.  Mayorkas says officials are conducting a full review of the situation.",
    "url": "https://www.cnn.com/2024/07/15/politics/video/alejandro-mayorkas-security-failure-trump-rally-digvid"
  },
  {
    "text": "Scoop: How the DNC plans to run out the clock for Biden … - Once Biden receives votes from a majority of the nearly 4,000 delegates, it will become exceedingly difficult to remove him from atop the Democratic presidential ticket.  — The DNC's current plan is to train state party chairs next week … ",
    "url": "https://www.axios.com/2024/07/16/biden-dnc-vote-nomination-states-2024-election"
  }
]