[
  {
    "text": "FBI agents were told to ‘flag’ any Epstein records that mentioned Trump, Sen. Durbin says  — FBI agents assigned to review files in the criminal case against Jeffrey Epstein were instructed to “flag” any documents that mentioned President Donald Trump, Sen. Richard Durbin said",
    "url": "https://www.cnbc.com/2025/07/18/trump-epstein-fbi-durbin.html"
  },
  {
    "text": "Donald Trump sues Dow Jones, News Corp, Rupert Murdoch, WSJ reporters for libel, court records show  —  U.S. President Donald Trump filed a lawsuit on Friday against Dow Jones, News Corp (NWSA.O), Rupert Murdoch and two Wall Street Journal reporters, raising claims under federal libel law, court records show.",
    "url": "https://www.reuters.com/legal/government/donald-trump-sues-dow-jones-news-corp-rupert-murdoch-wsj-reporters-libel-court-2025-07-18/"
  },
  {
    "text": "Trump sues Wall Street Journal, Rupert Murdoch over Epstein letter story  —  The lawsuit accuses the newspaper and its parent company of libel after it published an article about a lewd letter bearing Trump's name among the birthday notes collected as a gift for Jeffrey Epstein's 50th birthday.",
    "url": "https://www.washingtonpost.com/politics/2025/07/18/trump-lawsuit-wall-street-journal-murdoch-epstein/"
  },
  {
    "text": "Justice Department asks court to unseal grand jury records in Jeffrey Epstein case  —  The Justice Department has not announced any plans to release its own files related to the high profile case.  —  The Department of Justice requested a federal court on Friday to unseal grand jury transcripts … ",
    "url": "https://www.scrippsnews.com/politics/justice-department-asks-court-to-unseal-grand-jury-records-in-jeffrey-epstein-case"
  },
  {
    "text": "As Trump Downplays Epstein, Wyden Unveils Details of Treasury's Undisclosed Epstein File  —  Finance Committee Ranking Democrat Continues Years-Long, Follow-the-Money Investigation of Epstein Finances  —  Watch a video of Wyden deliver his remarks here  —  Donald Trump says a lot of outlandish stuff.",
    "url": "https://www.finance.senate.gov/ranking-members-news/as-trump-downplays-epstein-wyden-unveils-details-of-treasurys-undisclosed-epstein-file"
  },
  {
    "text": "Bondi Ordered FBI to Flag Trump's Name in Epstein Files  —  PLEASE EXPLAIN!  —  The AG has been asked to explain her handling of the case.  —  Attorney General Pam Bondi made FBI agents trawl through about 100,000 investigative files relating to child sex offender Jeffrey Epstein and … ",
    "url": "https://www.thedailybeast.com/pam-bondi-ordered-fbi-to-flag-donald-trumps-name-in-epstein-files/"
  },
  {
    "text": "CBS staff in turmoil over ‘Trump shakedown’ after Stephen Colbert and The Late Show are canceled  —  Exclusive: Multiple CBS staffers who spoke with The Independent said they aren't buying the company's claim that Colbert's cancellation was a ‘financial decision,’ adding that the demise of the show has left ‘everyone stunned.’",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/stephen-colbert-canceled-cbs-staff-trump-shakedown-b2791693.html"
  },
  {
    "text": "Trump's approval hits new low as Epstein pressure mounts  —  This is one of those classic weeks in a Trump presidency where too many stories are moving too fast for an individual writer to keep up.  There are new tariffs, expansion of deportation operations, a will-he-or-won't-he dance … ",
    "url": "https://www.gelliottmorris.com/p/trumps-approval-hits-new-low-as-epstein"
  },
  {
    "text": "U.S.-Venezuela prisoner swap frees Americans for migrants in El Salvador  —  The Venezuelans, labeled terrorists and violent criminals by President Trump, had been deported to the notorious CECOT prison, setting off a tense legal battle over executive power.",
    "url": "https://www.washingtonpost.com/national-security/2025/07/18/trump-venezuela-el-salvador-cecot-prison/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzUyODExMjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzU0MTkzNTk5LCJpYXQiOjE3NTI4MTEyMDAsImp0aSI6IjA3Y2VlODM5LWE4MTMtNDAxZC1iOWUzLTU0NmQ2YmM3OTc5NiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb25hbC1zZWN1cml0eS8yMDI1LzA3LzE4L3RydW1wLXZlbmV6dWVsYS1lbC1zYWx2YWRvci1jZWNvdC1wcmlzb24vIn0.o4gLsIf2R4KhMkdj1tb-2g58U8CP5hPlBMOIZmAGYLc&itid=gfta"
  },
  {
    "text": "Comedians Pull Off Brazen Epstein Prank Inside Trump Tower Gift Shop  —  The Good Liars' stunt comes as MAGA backlash to President Donald Trump over the Epstein files grows.  —  Pranksters this week trolled President Donald Trump by placing Jeffrey Epstein-themed postcards in the gift shop at Trump Tower in New York City.",
    "url": "https://www.huffpost.com/entry/the-good-liars-donald-trump-gift-shop_n_6879e733e4b00f995df4e2e8"
  },
  {
    "text": "Habba tells staff she loves her job, hopes to stay as she awaits judicial meeting (Updated)  —  U.S. Attorney Alina Habba told her staff on Thursday that her tenure as a federal prosecutor could come to an end on Tuesday when she hits the 120-day limit for appointments made by the U.S. Attorney General … ",
    "url": "https://newjerseyglobe.com/national/habba-announces-departure-as-u-s-attorney/"
  },
  {
    "text": "ACA health insurance will cost the average person 75% more next year, research shows  —  Health insurance premiums are going way up next year for people who buy their insurance on Healthcare.gov or the state-based marketplaces, according to an analysis out Friday.",
    "url": "https://www.npr.org/sections/shots-health-news/2025/07/18/nx-s1-5471281/aca-health-insurance-premiums-obamacare-bbb-kff"
  },
  {
    "text": "Justice Dept. Asks Manhattan Court to Unseal Epstein Grand Jury Testimony  —  The president has been under intense political pressure from his base after Attorney General Pam Bondi withheld portions of investigative files on the disgraced financier.  —  The Justice Department asked … ",
    "url": "https://www.nytimes.com/2025/07/18/nyregion/trump-epstein-files-unsealing-request.html"
  },
  {
    "text": "3 deputies killed after explosion reported at East LA sheriff's training facility  —  At least three deputies were killed after an explosion was reported early Friday at an LA County Sheriff's Department training facility in East Los Angeles.  —  The explosion is believed to have occurred … ",
    "url": "https://www.nbclosangeles.com/news/local/explosion-east-los-angeles-sheriff-training-facility/3748153/"
  },
  {
    "text": "Scoop: Israel seeks U.S. help on deals to move Palestinians out of Gaza … - The spy chief, David Barnea, told White House envoy Steve Witkoff that Israel has been speaking in particular with Ethiopia, Indonesia and Libya. … - Barnea suggested that the U.S. offer incentives to those countries and help Israel convince them.",
    "url": "https://www.axios.com/2025/07/18/israel-send-palestinians-gaza-indonesia-ethiopia"
  },
  {
    "text": "Texan Moved Fam to Russia to Flee Woke—Now He's Headed to Ukraine Front Line  —  FAFO  —  Derek Huffman, 46, joined the military with hopes of becoming a Russian citizen.  His wife said he was duped into a combat role.  —  An American father who moved to Russia to avoid LGBTQ+ … ",
    "url": "https://www.thedailybeast.com/texan-moved-fam-to-russia-to-flee-wokenow-hes-headed-to-ukraine-front-line/"
  },
  {
    "text": "Trump appointees pushed more marble in Fed building renovation White House now attacks  —  President Donald Trump has looked to the marble finishes and hefty price tag of the Federal Reserve headquarters to claim grounds to fire Chair Jerome Powell, with whom he has tussled for years over interest rates.",
    "url": "https://apnews.com/article/powell-trump-federal-reserve-16a3a78bab27f44e058d69829a8dcfa9"
  },
  {
    "text": "Trump administration to destroy nearly $10m of contraceptives for women overseas  —  As part of president's end to foreign aid, destruction of the long-acting contraceptives will cost US taxpayers $167,000  —  The Trump administration has decided to destroy $9.7m worth of contraceptives rather than send them abroad to women in need.",
    "url": "https://www.theguardian.com/us-news/2025/jul/18/trump-administration-destroy-contraceptives-usaid-africa"
  },
  {
    "text": "Just 23% of Americans say Israeli military actions in Gaza are fully justified, CNN poll finds  —  Americans are increasingly skeptical of Israeli actions in Gaza, according to a new CNN poll conducted by SSRS that also finds rising sentiment that the US should pull back on military aid to Israel.",
    "url": "https://cnn.com/2025/07/18/politics/cnn-poll-israel-support"
  },
  {
    "text": "E.P.A. Says It Will Eliminate Its Scientific Research Arm  —  The decision comes after a Supreme Court ruling allowing the Trump administration to slash the federal work force and dismantle agencies.  —  The Environmental Protection Agency said on Friday that it would eliminate … ",
    "url": "https://www.nytimes.com/2025/07/18/climate/epa-firings-scientific-research.html"
  },
  {
    "text": "Senators Say Trump Nominated Judge To Their State They've Never Even Met  —  When a president is nominating someone to be a federal judge, they typically work with the two U.S. senators from that state to vet nominees and ultimately agree on someone together.  These are lifetime appointments, after all.",
    "url": "https://www.huffpost.com/entry/trump-tariffs-white-house-latest_n_686ec29fe4b09bd98fe4be7e/liveblog_687a685fe4b00f995df53789"
  },
  {
    "text": "Indiana's Camp Atterbury to be used to house detained migrants  —  Indiana's Camp Atterbury and New Jersey's Joint Base McGuire-Dix-Lakehurst will be temporarily used to detain immigrants lacking permanent legal status, according to a directive from Defense Secretary Pete Hegseth.",
    "url": "https://thehill.com/homenews/5409229-indiana-new-jersey-camp-migrant-detention/"
  },
  {
    "text": "Where Congress's Cuts Threaten Access to PBS and NPR  —  President Trump's proposal to eliminate federal funding for public broadcasters threatens scores of radio and TV stations across the United States that air PBS and NPR programs.",
    "url": "https://www.nytimes.com/interactive/2025/07/18/business/media/house-rescission-vote-pbs-npr.html?unlocked_article_code=1.XU8.S2CS.vvL9GS6rCS1b&smid=em-share"
  },
  {
    "text": "Israel levelling thousands of Gaza civilian buildings in controlled demolitions  —  Israel has demolished thousands of buildings across Gaza since it withdrew from a ceasefire with Hamas in March, with entire towns and suburbs - once home to tens of thousands of people - levelled in the past few weeks.",
    "url": "https://www.bbc.com/news/resources/idt-33fccfbe-abcc-4af1-bdd2-632b2787cf59"
  }
]