[
  {
    "text": "Suspected Shooter Had Explosive Devices in His Car, Sources Say  —  Authorities found explosive devices in the car of the man who officials say tried to assassinate former President Donald Trump, according to people briefed on the investigation.  —  The car, which was driven by Thomas Matthew Crooks … ",
    "url": "https://www.wsj.com/livecoverage/trump-rally-incident/card/suspected-shooter-had-explosive-devices-in-his-car-sources-say-nqpDI2AqQQNtSvYtEpS9"
  },
  {
    "text": "The FBI Identifies Suspected Gunman in Trump Rally Shooting: What to Know  —  Authorities identified the gunman as a 20-year-old man from Bethel Park, a town about an hour's drive from the site of the shooting.  —  The 20-year-old gunman who attempted to assassinate former President Donald J. Trump … ",
    "url": "https://www.nytimes.com/2024/07/14/us/politics/trump-gunman-thomas-crooks.html"
  },
  {
    "text": "Who is Thomas Matthew Crooks, the suspected Trump rally shooter  —  The FBI identified 20-year-old Thomas Matthew Crooks of Bethel Park, Pennsylvania as the suspect in Saturday's attempted assassination of former U.S. President Donald Trump at a campaign rally.",
    "url": "https://www.reuters.com/world/us/heres-what-we-know-about-thomas-matthew-crooks-suspected-trump-rally-shooter-2024-07-14/"
  },
  {
    "text": "America is staring into the abyss  —  After the attempted assassination of Donald Trump, an already existential election is now even more fraught  —  It is not just Donald Trump who dodged a bullet.  Half an inch to the left and the cartridge that grazed Trump's ear would have turned him into a martyr.",
    "url": "https://www.ft.com/content/1d3c12b2-99ed-4935-bcb0-0fd700081c83"
  },
  {
    "text": "Trump rally shooter identified as 20-year-old Pennsylvania man  —  The FBI identified the shooter, who is dead, as Thomas Matthew Crooks of Bethel Park, Pennsylvania.  A motive was not clear.  —  Law enforcement authorities have identified the man who made an assassination attempt … ",
    "url": "https://www.nbcnews.com/politics/politics-news/trump-rally-shooter-identified-rcna161757"
  },
  {
    "text": "Trump rally shooting live updates: Shooter was a 20-year-old man from Pennsylvania, officials say  —  Donald Trump's campaign said in a statement that he was “fine” after being whisked off the stage at a rally in Butler, Pennsylvania after apparent gunshots rang through the crowd.",
    "url": "https://apnews.com/live/election-biden-trump-campaign-updates-07-13-2024"
  },
  {
    "text": "FBI identifies Trump rally shooter as 20-year-old Thomas Matthew Crooks  —  Authorities have identified the gunman involved in the attack against former US President Donald Trump on Saturday as 20-year-old Thomas Matthew Crooks, who was killed by Secret Service agents at the scene after the shooting.",
    "url": "https://www.cnn.com/2024/07/14/us/trump-shooting-thomas-matthew-crooks-intl-hnk/"
  },
  {
    "text": "Misinformation spreads swiftly in hours after Trump rally shooting  —  Conspiracy theories swell around false flags, Deep State, Biden and the Secret Service, filling the information vacuum as consumers choose their own reality.  —  Law enforcement officials quickly launched an investigation … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/14/trump-shooting-conspiracy-theories/"
  },
  {
    "text": "Police found explosives inside the car of suspected Trump rally shooter Thomas Matthew Crooks  — Police found explosives in Thomas Matthew Crooks' car after he shot at Donald Trump.  — The FBI has identified Crooks, who was killed by Secret Service, as the shooter.",
    "url": "https://www.businessinsider.com/police-find-explosives-car-suspect-trump-rally-shooter-2024-7"
  },
  {
    "text": "Trump allies immediately blame Biden, Democrats for their rhetoric  —  Supporters argued that Democratic portrayals of Trump as a threat to democracy led to the violence, though the shooter's motive was not apparent at the time of their remarks.  —  Top allies of Donald Trump quickly accused President Biden … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/13/trump-shooting-blame-biden-democrats/"
  },
  {
    "text": "Rep. Ronny Jackson nephew injured in Trump rally shooting: What We Know  —  WASHINGTON - Former President Donald Trump was grazed by a bullet on his ear in an assassination attempt at his rally in Butler, Pennsylvania on Saturday.  —  The shooting killed one spectator, and seriously injured two others.",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/07/14/ronny-jackson-nephew-trump/74400137007/"
  },
  {
    "text": "Witness says he saw gunman on roof near Trump rally  —  A man with a rifle was seen on a rooftop minutes before shots were fired at a Donald Trump rally in Pennsylvania, a witness has told the BBC.  —  Greg Smith said the man had crawled on top of a building just outside the event in Butler County on Friday evening.",
    "url": "https://www.bbc.com/news/articles/cn4v7v2g5l1o"
  },
  {
    "text": "Photo Appears to Capture Path of Bullet Used in Assassination Attempt  —  Michael Harrigan, a retired F.B.I. special agent, said the image captured by Doug Mills, a New York Times photographer, seems to show a bullet streaking past former President Donald J. Trump.",
    "url": "https://www.nytimes.com/2024/07/14/us/politics/photo-path-trump-assassination.html"
  },
  {
    "text": "The true, tactical significance of Project 2025 (permalink)  —  Like you, I have heard a lot about Project 2025, the Heritage Foundation's roadmap for the actions that Trump should take if he wins the presidency.  Given the Heritage Foundation's centrality to the American authoritarian project … ",
    "url": "https://pluralistic.net/2024/07/14/fracture-lines/#disassembly-manual"
  },
  {
    "text": "Biden spoke with Trump: White House official  —  President Biden spoke with Trump, a White House official told ABC News.  —  Biden also spoke with Pennsylvania Gov. Josh Shapiro and Butler Mayor Bob Dandoy, the official said.  —ABC News' Mary Bruce  —  Male shooter was killed by Secret Service counter-sniper: Source",
    "url": "https://abcnews.go.com/Politics/live-updates/donald-trump-rally-shooting-assassination-attempt/?id=111916828&entryId=111920910&cid=social_twitter_tw"
  }
]