[
  {
    "text": "IVF helps women become mothers — so why does the Christian right hate it so much?  —  Former Gov. Nikki Haley, R-S.C., gets a lot of glowing coverage simply because she occasionally criticizes Donald Trump in her fruitless presidential primary run against him.",
    "url": "https://www.salon.com/2024/02/23/alabamas-targeting-of-ivf-is-the-christian-rights-attempt-to-control-motherhood-and-theocracy/"
  },
  {
    "text": "Alabama said frozen embryos are kids.  The GOP isn't sure what to do about it.  —  IVF — and specifically how to handle unused, frozen embryos — was rarely, if ever, discussed outside of the rightmost fringes of anti-abortion and religious circles.  —  Republicans have spent five decades … ",
    "url": "https://www.politico.com/news/2024/02/23/alabama-frozen-embryos-gop-ivf-00143011"
  },
  {
    "text": "125 House Republicans — including Speaker Mike Johnson — back a ‘life at conception’ bill without any IVF exception  —  Most House Republicans have cosponsored a bill declaring that life begins from the moment of conception, a position under increased scrutiny after the Alabama Supreme Court ruled … ",
    "url": "https://www.businessinsider.com/house-republicans-life-at-conception-ivf-exception-2024-2"
  },
  {
    "text": "Scoop: House Democrats plan barrage against GOP on IVF … - The bill would “grant equal protection” to “every member of the species homo sapiens at all stages of life, including the moment of fertilization.” … - Shipping companies are also responding to the ruling by halting the transfer of frozen embryos out of the state.",
    "url": "https://www.axios.com/2024/02/23/house-democrats-attack-republicans-ivf-alabama"
  },
  {
    "text": "Jim Jordan Offers Startling Confession on Indicted Biden Informant … After trying and failing to salvage Republicans' crumbling impeachment inquiry into President Joe Biden, Ohio Representative Jim Jordan at last, finally, conceded on Friday that Alexander Smirnov's story might not be totally accurate.",
    "url": "https://newrepublic.com/post/179270/jim-jordan-confession-indicted-biden-fbi-informant-smirnov"
  },
  {
    "text": "Ignoring Warnings, G.O.P. Trumpeted Now-Discredited Allegation Against Biden  —  Republicans in Congress built their impeachment case against President Biden around a bribery accusation that the F.B.I. had warned them was uncorroborated.  —  In May 2023, Senator Charles E. Grassley … ",
    "url": "https://www.nytimes.com/2024/02/23/us/politics/gop-smirnov-allegation-biden.html"
  },
  {
    "text": "Jury finds NRA liable for mismanagement, says Wayne LaPierre violated duties  —  LaPierre and an NRA executive must pay a combined $6.35 million, the NY AG said.  —  Wayne LaPierre, CEO of the National Rifle Association, leaves New York State Supreme Court, Feb. 23, 2024, in New York.",
    "url": "https://abcnews.go.com/US/jury-finds-nra-liable-mismanagement-wayne-lapierre-violated/story?id=107269909"
  },
  {
    "text": "Jury finds NRA, Wayne LaPierre liable in civil corruption case  —  A Manhattan jury found three top executives of the National Rifle Association liable Friday in a lengthy civil trial that focused on alleged corruption and the misspending of millions of dollars.",
    "url": "https://www.npr.org/2024/02/23/1232229060/nra-wayne-lapierre-corruption-trial-verdict-new-york"
  },
  {
    "text": "Judge formally says Trump owes $454 million in civil fraud case, countdown starts for him to put up the money for appeal  —  A New York judge on Friday formally ordered Donald Trump to pay $454 million, including interest, a move that will give the former president one month to post nearly half … ",
    "url": "https://www.cnn.com/2024/02/23/politics/trump-judgment-civil-fraud-ruling"
  },
  {
    "text": "How Democrats Could Disqualify Trump If the Supreme Court Doesn't  —  Without clear guidance from the Court, House Democrats suggest that they might not certify a Trump win on January 6.  —  Near the end of the Supreme Court's oral arguments about whether Colorado could exclude former President Donald Trump … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/02/democrats-congress-trump-january-6/677545/"
  },
  {
    "text": "Dozens of Previously Unreported SCOTUS Trips in New Marshals Documents — But Justice Thomas and the Chief Justice Are Nowhere to be Found  —  Ditching deputy marshals at the gates of Bohemian Grove.  An extravagant birthday party at Lincoln Center.  Religious services at a Brooklyn theater.",
    "url": "https://fixthecourt.com/2024/02/usms-foia-release-2024/"
  },
  {
    "text": "Nex Benedict's mom raises doubts about police statements: It's a “big cover”  —  The mother of Nex Benedict — the non-binary Oklahoma teen who was assaulted in a school bathroom and died the following day — is raising doubts about statements released by the local police.",
    "url": "https://popular.info/p/nex-benedicts-mom-raises-doubts-about"
  },
  {
    "text": "Ex-Trump White House aide Cassidy Hutchinson says photo refutes Biden impeachment witness's claims  —  Her attorney shared a photo he says refutes a claim by witness Tony Bobulinski.  —  In this Oct. 30, 2023, file photo, Cassidy Hutchinson attends an event in New York.",
    "url": "https://abcnews.go.com/US/trump-white-house-aide-cassidy-hutchinson-pushes-back/story?id=107465387"
  },
  {
    "text": "Ethics Commission alleges Trump joint fundraising committee, Brandtjen involved in campaign finance scheme to benefit Vos challenger  —  Home » WisPolitics News » Ethics Commission alleges Trump joint fundraising committee, Brandtjen involved in campaign finance scheme to benefit Vos challenger",
    "url": "https://www.wispolitics.com/2024/ethics-commission-alleges-trump-joint-fundraising-committee-brandtjen-involved-in-campaign-finance-scheme-to-benefit-vos-challenger/"
  },
  {
    "text": "White House reverses West Bank policy, calling Israeli settlements illegal  —  The decision was in response to reports that the far-right government of Israeli Prime Minister Benjamin Netanyahu was planning further settlement expansion, an official said  —  BUENOS AIRES — Secretary … ",
    "url": "https://www.washingtonpost.com/national-security/2024/02/23/israel-west-bank-settlements-illegal/"
  },
  {
    "text": "BREAKING: Cellphone data raises questions about start of Willis-Wade relationship  —  Thousands of texts between DA and special prosecutor in 2021, court filing says  —  Nathan Wade appeared to make at least 35 visits to the Hapeville neighborhood where Fani Willis was living … ",
    "url": "https://www.ajc.com/politics/breaking-cellphone-data-raise-questions-about-start-of-willis-wade-relationship/SFVMYPTD2RD3HMZYOH3377CNNE/"
  },
  {
    "text": "Speaker Mike Johnson unveils plan to avert shutdown next week  —  The House will vote on four funding bills next week to stave off a partial government shutdown, the speaker told House Republicans on a conference call Friday night.  —  WASHINGTON — Speaker Mike Johnson on Friday night unveiled … ",
    "url": "https://www.nbcnews.com/politics/congress/speaker-mike-johnson-unveils-plan-avert-shutdown-week-rcna140054"
  },
  {
    "text": "‘You must act fast:’ Katie Porter is selling her fundraising list — at a discount  —  The California Democrat is trying to quickly scoop up cash to spend in the final sprint of her U.S. Senate campaign.  —  Rep. Katie Porter is holding a fire sale for her highly prized fundraising list … ",
    "url": "https://www.politico.com/news/2024/02/23/porter-list-fire-sale-00143018"
  },
  {
    "text": "Sotomayor, Barrett encourage civility in front of nation's governors  —  Liberal Justice Sonia Sotomayor and conservative Justice Amy Coney Barrett jointly encouraged the nation's governors on Friday to emulate the Supreme Court's collegiality, despite the divisive political climate.",
    "url": "https://thehill.com/regulation/court-battles/4485867-supreme-court-justices-sotomayor-barrett-encourage-civility/"
  }
]