[
  {
    "text": "New Polling Shows the Real Fallout From the Trump Conviction  —  A new POLITICO Magazine/Ipsos poll shows that Trump's criminal conviction hurts him with independents.  —  Donald Trump's criminal conviction didn't instantly upend the 2024 presidential race.  But the results of a new poll should be worrying for Trump.",
    "url": "https://www.politico.com/news/magazine/2024/06/17/trouble-for-trump-in-a-new-poll-on-his-conviction-00163498"
  },
  {
    "text": "J.D. Vance Wanted a Constitutional Crisis  —  An interesting new Politico/Ipsos poll, out today, sheds more light on the electorate's reaction to Donald Trump's recent felony conviction.  Team Trump has been triaging the political damage with relentless messaging of a rigged trial … ",
    "url": "https://www.thebulwark.com/p/jd-vance-wanted-a-constitutional"
  },
  {
    "text": "The 2024 ‘Deciders’: Who are they and what makes them tick? … RiKi Denning is, by her own account, “torn up” about the November election.  She is almost certain she will cast a ballot but just might leave the presidential line blank.  “I just hate both of the candidates and there's … ",
    "url": "https://www.washingtonpost.com/politics/2024/06/17/deciders-2024-election-poll/"
  },
  {
    "text": "Surgeon General: Why I'm Calling for a Warning Label on Social Media Platforms  —  One of the most important lessons I learned in medical school was that in an emergency, you don't have the luxury to wait for perfect information.  You assess the available facts, you use your best judgment, and you act quickly.",
    "url": "https://www.nytimes.com/2024/06/17/opinion/social-media-health-warning.html"
  },
  {
    "text": "Surgeon General Calls for Warning Labels on Social Media Platforms  —  Dr. Vivek Murthy said he would urge Congress to require a warning that social media use can harm teenagers' mental health.  —  The United States Surgeon General, Dr. Vivek Murthy, announced on Monday that he would push … ",
    "url": "https://www.nytimes.com/2024/06/17/health/surgeon-general-social-media-warning-label.html"
  },
  {
    "text": "Maryland Gov. Wes Moore to pardon 175,000 marijuana convictions  —  The news was announced Monday.  —  Maryland Gov. Wes Moore is pardoning more than 175,000 convictions for marijuana, his office announced Monday.  —  “I am humbled to be with you in the historic Maryland State House … ",
    "url": "https://abcnews.go.com/Politics/maryland-gov-wes-moore-pardon-175000-marijuana-convictions/story?id=111172786"
  },
  {
    "text": "Incoming Post editor tied to self-described ‘thief’ who claimed role in his reporting  —  Unpublished book drafts and other documents raise questions about Robert Winnett's journalistic record just months before he is to assume a top newsroom role.  —  LONDON — The alleged offense was trying … ",
    "url": "https://www.washingtonpost.com/investigations/2024/06/16/washington-post-editor-robert-winnett/"
  },
  {
    "text": "A tradwife drops a racist slur: Why the right's trolling economy made Lilly Gaddis' rise inevitable  —  Cashing in as a “cancel culture” martyr is getting harder, so attention addicts have to get more extreme  —  Let's stipulate up front that it is theoretically possible that Lilly Gaddis … ",
    "url": "https://www.salon.com/2024/06/17/a-tradwife-drops-a-slur-why-the-rights-trolling-economy-made-lilly-gaddis-rise-inevitable/"
  },
  {
    "text": "U.S. faces “serious threat” of terror attack, expert and former CIA chief warn … - Now, similar warnings are popping up from FBI director Chris Wray and Army Gen. Erik Kurilla — the commander of CENTCOM, which includes the Middle East. … - Over that time, terrorism has faded as a national fixation.",
    "url": "https://www.axios.com/2024/06/17/us-terrorist-attack-morell-allison"
  },
  {
    "text": "Greek coastguard threw migrants overboard to their deaths, witnesses say  —  The Greek coastguard has caused the deaths of dozens of migrants in the Mediterranean over a three-year period, witnesses say, including nine who were deliberately thrown into the water.",
    "url": "https://www.bbc.com/news/articles/c0vv717yvpeo"
  },
  {
    "text": "Sinclair floods local news websites with hundreds of deceptive articles about Biden's mental fitness  —  This month, Sinclair Broadcast Group has flooded a vast network of local news websites with misleading articles suggesting that President Biden is mentally unfit for office.",
    "url": "https://popular.info/p/sinclair-floods-local-news-websites"
  },
  {
    "text": "How Alex Jones dodged accountability again  —  A leading purveyor of hate keeps gaming the legal system. … Judge Christopher Lopez last Friday booted Infowars out of bankruptcy.  It was mostly a win for hate purveyor Alex Jones, who within hours of the December 14, 2012 … ",
    "url": "https://www.publicnotice.co/p/alex-jones-judge-lopez-inforwars-bankruptcy"
  },
  {
    "text": "J.D. Vance for Trump's VP?  Here are the pros and cons of the 8 candidates on his shortlist  —  The former president is expected to announce his selection next month.  —  Donald Trump Jr. is urging his dad to pick a “fighter” as his running mate.  The elder Trump is locked in a general election … ",
    "url": "https://www.politico.com/news/2024/06/17/trump-vp-pick-list-pros-cons-00162820"
  },
  {
    "text": "Biden appears to freeze up, has to be led off stage by Obama at mega-bucks LA fundraiser  —  President Biden appeared to freeze up on stage and had to be led off by Barack Obama at the conclusion of a star-studded campaign fundraiser in Los Angeles Saturday night.",
    "url": "https://nypost.com/2024/06/16/us-news/biden-appears-to-freeze-up-has-to-be-led-off-stage-by-obama-at-mega-bucks-la-fundraiser/"
  },
  {
    "text": "Trials reveal depths of Bidens' family tragedy … - When Biden declared for president in 2019, his family was plagued by addiction, grief and soap opera levels of drama, the legal cases involving his son Hunter and daughter Ashley have shown.  — It's affected the president … ",
    "url": "https://www.axios.com/2024/06/17/biden-hunter-family-election-2024"
  },
  {
    "text": "Trump unleashed: This is the calm before the storm  —  We will look back at these months before the election and Donald Trump's sentencing as relatively good times  —  Donald Trump is unleashed.  —  Following his historic felony conviction in New York for election interference, the former president has become even more dangerous.",
    "url": "https://www.salon.com/2024/06/17/unleashed-this-is-the-calm-before-the-storm/"
  }
]