[
  {
    "text": "The public doesn't understand the risks of a Trump victory.  That's the media's fault  —  With democracy in the balance, the press must relay the crucial importance of this election and the dangers of a Trump win  —  Whatever doubts you may have about public-opinion polls, one recent example should not be dismissed.",
    "url": "https://www.theguardian.com/commentisfree/2023/nov/09/trump-president-democracy-threat-media-journalism"
  },
  {
    "text": "Echoes of Jan. 6 committee as Jack Smith foreshadows plan to tie Trump to Capitol riot  —  Donald Trump doesn't want prosecutors to talk about Jan. 6.  They want to make it central to their case.  —  When Donald Trump faces a jury on charges stemming from his bid to subvert the 2020 election … ",
    "url": "https://www.politico.com/news/2023/11/09/donald-trump-jan-6-riot-defendant-00126258"
  },
  {
    "text": "Trump was defeated twice in one week  —  Trumpism lost big in the courtroom and at the polls, proving the rule of law and democracy still matter.  —  Donald Trump got two rude awakenings this week.  One happened Monday in a New York courtroom, and the other came the next day courtesy of voters across the nation.",
    "url": "https://www.bostonglobe.com/2023/11/08/opinion/trump-defeated-new-york-case-elections/"
  },
  {
    "text": "Please get Ramaswamy off my TV, and other debate thoughts  —  Is there anyone who isn't annoyed to death by this guy? … The third of four Republican presidential debates didn't change the trajectory of a race that Donald Trump will win, barring shocking developments.",
    "url": "https://www.publicnotice.co/p/gop-debate-vivek-ramaswamy-annoying"
  },
  {
    "text": "NBC hosts a GOP debate — and its right-wing misinformation  —  It was unavoidable from the moment that NBC News agreed to host the third Republican presidential debate on Wednesday night that it would be a conduit for misinformation.  Any political debate involves some falsehoods … ",
    "url": "https://www.washingtonpost.com/politics/2023/11/09/nbc-debate-republican-misinformation/"
  },
  {
    "text": "Peter Thiel Is Taking a Break From Democracy  —  It wasn't clear at first why Peter Thiel agreed to talk to me.  —  He is, famously, no friend of the media.  But Thiel—co-founder of PayPal and Palantir, avatar of techno-libertarianism, bogeyman of the left—consented to a series … ",
    "url": "https://www.theatlantic.com/politics/archive/2023/11/peter-thiel-2024-election-politics-investing-life-views/675946/"
  },
  {
    "text": "James Comer, Like Joe Biden, Also Paid His Brother $200K  —  James Comer is going after Joe Biden because he loaned his brother, James Biden, $200,000.  If that's the standard, James Comer may want to investigate himself. … Pay Dirt is a weekly foray into the pigpen of political funding.",
    "url": "https://www.thedailybeast.com/james-comer-like-joe-biden-also-paid-his-brother-dollar200k"
  },
  {
    "text": "Israel agrees to daily, 4-hour pauses in Gaza assault, White House says: Live updates  —  In a crucial breakthrough for the global effort to provide humanitarian aid to Gaza, Israel has agreed to daily, four-hour pauses in fighting across northern Gaza, the White House said Thursday.",
    "url": "https://www.usatoday.com/story/news/world/israel-hamas/2023/11/09/israel-hamas-war-gaza-live-updates/71514275007/"
  },
  {
    "text": "McSally says she was sexually assaulted during run  —  Former Sen. Martha McSally (R-Ariz.) said she was sexually assaulted Wednesday during a run along the Missouri River on the border of Nebraska and Iowa.  —  “I am OK,” McSally said in a video shared to Instagram after the run, while she was “still in an adrenaline state.”",
    "url": "https://thehill.com/blogs/blog-briefing-room/4301669-mcsally-claims-sexually-assault-during-run/"
  },
  {
    "text": "Schumer Warns GOP House Speaker Johnson a Shutdown Will Be On Him  —  Schumer says ‘hard-right’ poison pills ‘only make a shutdown more likely’  —  Senate Majority Leader Chuck Schumer on Thursday exhorted Mike Johnson to “learn from the fiasco of a month ago” and work with Democrats to avoid a government shutdown next week.",
    "url": "https://themessenger.com/politics/schumer-warns-gop-house-speaker-johnson-a-shutdown-will-be-on-him"
  },
  {
    "text": "Democrats' new abortion battle plan: Rush to get it on ballots in 2024 … - Voters now have explicitly endorsed abortion rights via ballot initiatives in seven states since the Supreme Court overturned Roe v. Wade last year — in California, Kansas, Kentucky, Michigan, Montana, Vermont and now Ohio.",
    "url": "https://www.axios.com/2023/11/09/democrats-abortion-election-plan-2023"
  },
  {
    "text": "Gruesome Footage of Oct. 7 Hamas Atrocities Screens in Hollywood Under Heavy Guard  —  On Wednesday night, with a sizable security presence and protesters audible through the walls, some 200 members of the industry screened ‘Bearing Witness,’ comprising 43 minutes of uncensored footage, at the Museum of Tolerance in West L.A.",
    "url": "https://www.hollywoodreporter.com/news/general-news/hollywood-screening-bearing-witness-hamas-israel-attack-1235642773/"
  },
  {
    "text": "Christie gets into yelling match with MSNBC anchor after lackluster debate: 'Don't mess with me'  —  Former New Jersey Gov. Chris Christie got into a heated debate with MSNBC host Mika Brzezinski over his comments on abortion.  —  Appearing the morning after the third Republican presidential debate … ",
    "url": "https://www.washingtonexaminer.com/news/campaigns/christie-yelling-match-msnbc-anchor"
  },
  {
    "text": "Ramaswamy Seemed to Call Zelensky a Nazi.  His Campaign Says That's Not What He Meant.  —  A spokeswoman for Mr. Ramaswamy acknowledged that, without context, his remark could be easily misunderstood.  —  Vivek Ramaswamy drew shock and criticism online on Wednesday when he appeared to accuse … ",
    "url": "https://www.nytimes.com/2023/11/08/us/politics/ramaswamy-zelensky-nazi-comment.html"
  },
  {
    "text": "House GOP pulls second funding bill in a week  —  House Republicans pulled their annual financial services and general government funding bill Thursday amid divisions on abortion-related provisions and FBI funding.  —  It was the second time in a week that GOP leaders opted to punt a vote … ",
    "url": "https://thehill.com/homenews/house/4301942-house-gop-pull-second-funding-bill-in-a-week/"
  },
  {
    "text": "Young Americans are losing faith in democracy — educators must act now  —  There is a quiet revolution going on among the younger generation in this country, marked by a dramatic erosion of support for America's constitutional democracy.  —  The younger generation has good reason to be disillusioned with democracy.",
    "url": "https://thehill.com/opinion/education/4302113-young-americans-are-losing-faith-in-democracy-educators-must-act-now/"
  },
  {
    "text": "She saw Trump coming in 2016 better than anyone.  What does Salena Zito see for 2024?  —  If you've heard the phrase about how you should take former President Donald Trump “seriously but not literally,” you can thank Salena Zito.  The reporter from Pittsburgh coined the incisive observation … ",
    "url": "https://thehill.com/opinion/white-house/4302014-she-saw-trump-coming-in-2016-better-than-anyone-what-does-salena-zito-see-for-2024/"
  },
  {
    "text": "Broken Borders: AP & Reuters Pictures of Hamas Atrocities Raise Ethical Questions  —  On October 7, Hamas terrorists were not the only ones who documented the war crimes they had committed during their deadly rampage across southern Israel.  Some of their atrocities were captured … ",
    "url": "https://honestreporting.com/photographers-without-borders-ap-reuters-pictures-of-hamas-atrocities-raise-ethical-questions/"
  },
  {
    "text": "Swing State 2024 Polling: Biden Trails Trump in Arizona, Georgia, and Pennsylvania, and Wisconsin, Leads Trump in Michigan  —  Home Polls Swing State 2024 Polling: Biden Trails Trump in Arizona, Georgia, and Pennsylvania, and Wisconsin, Leads Trump in Michigan",
    "url": "https://emersoncollegepolling.com/swing-state-2024-polling-biden-trails-trump-in-arizona-georgia-and-pennsylvania-and-wisconsin-leads-trump-in-michigan/"
  },
  {
    "text": "Tim Scott's girlfriend is, in fact, real.  —  The senator debuted his significant other at the most charming of spots: the stage of the GOP primary debate.  —  Who says that politics isn't romantic?  —  Sen. Tim Scott on Wednesday finally debuted his girlfriend, bringing her onstage … ",
    "url": "https://www.politico.com/news/2023/11/08/tim-scott-girlfriend-is-real-00126293"
  },
  {
    "text": "Former Arkansas Gov. Mike Huckabee Says Women Who Have Abortions ‘Probably Got Talked Into’ it  —  During a Wednesday appearance on Hannity, Huckabee discussed the impact Republican messaging has had on abortion  —  Former GOP Arkansas Gov. Mike Huckabee says that women who have received abortions probably … ",
    "url": "https://themessenger.com/politics/former-arkansas-gov-mike-huckabee-says-women-who-have-abortions-probably-got-talked-into-it"
  },
  {
    "text": "CAIR Received 1,283 Complaints Over Past Month, an ‘Unprecedented’ Increase in Complaints of Islamophobia, Anti-Arab Bias  —  (WASHINGTON, DC, 11/9/23) - The Council on American-Islamic Relations (CAIR), the nation's largest Muslim civil rights and advocacy organization, today released data showing an … ",
    "url": "https://www.cair.com/press_releases/cair-received-1283-complaints-over-past-month-an-unprecedented-increase-in-complaints-of-islamophobia-anti-arab-bias/"
  }
]