[
  {
    "text": "‘Two Weeks’ Is Trump's Favorite Unit of Time  —  “Two weeks” is one of President Trump's favorite units of time.  It can mean something, or nothing at all.  —  “Within the next two weeks.”  —  That is when President Trump now says he will be ready to make his decision about bombing Iran or not.",
    "url": "https://www.nytimes.com/2025/06/19/world/middleeast/trump-iran-two-weeks.html"
  },
  {
    "text": "Trump to decide on Iran action ‘within two weeks,’ White House says  —  President Trump will make a decision on whether the U.S. will strike Iran “within two weeks,” the White House said Thursday.  —  “Based on the fact that there's a substantial chance of negotiations that may or may not take place … ",
    "url": "https://www.npr.org/2025/06/19/nx-s1-5439075/israel-iran-conflict-hospital"
  },
  {
    "text": "Live Updates: Trump Will Decide on Iran Attack ‘in the Next Two Weeks,’ White House Says  —  European officials, who have been effectively sidelined in the war between Israel and Iran, will try to exert limited leverage in a meeting with Iranian officials on Friday in Geneva.  —  Tehran",
    "url": "https://www.nytimes.com/live/2025/06/19/world/iran-israel-trump-news"
  },
  {
    "text": "Trump administration boosts monitoring of possible Iran-backed cells in U.S. — as Trump weighs strikes, sources say  —  As President Trump is contemplating potential U.S. strikes on Iranian nuclear facilities, law enforcement officials have stepped up surveillance of Iran-backed operatives … ",
    "url": "https://www.cbsnews.com/news/trump-administration-monitor-iran-backed-cells-trump-weighs-strikes/"
  },
  {
    "text": "Trump caution on Iran strike linked to doubts over ‘bunker buster’ bomb, officials say  —  Exclusive: The likelihood of a successful US strike on the Iranian nuclear facility buried deep underground at Fordow is a topic of deep contention, defense officials say",
    "url": "https://www.theguardian.com/world/2025/jun/19/trump-caution-on-iran-strike-linked-to-doubts-over-bunker-buster-bomb-officials-say"
  },
  {
    "text": "Live updates Trump says he'll decide on Iran strike within two weeks  —  President Donald Trump will make a decision on action against Iran within the next two weeks, the White House said Thursday.  “Based on the fact that there's a substantial chance of negotiations that may or may not take place … ",
    "url": "https://www.washingtonpost.com/world/2025/06/19/israel-iran-strikes-live-us-trump/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzUwMzA1NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzUxNjg3OTk5LCJpYXQiOjE3NTAzMDU2MDAsImp0aSI6ImNhMzJmOGE5LWMyNGMtNDQwMC1hMzE1LTczMDliNTNhYzY1NyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS93b3JsZC8yMDI1LzA2LzE5L2lzcmFlbC1pcmFuLXN0cmlrZXMtbGl2ZS11cy10cnVtcC8ifQ.T3qDSXjf0Jnwth6kjDmPYUJmEnsBzVfSbHZBdHgOKCQ&itid=gfta"
  },
  {
    "text": "Elon Musk's SpaceX Starship explodes on test stand  —  The failure sent a giant fireball into the sky over the company's South Texas launch site.  —  SpaceX Starship explodes on test stand  —  SpaceX's Starship spacecraft exploded ahead of an engine test late Wednesday … ",
    "url": "https://www.washingtonpost.com/technology/2025/06/19/starship-spacex-explosion-musk/"
  },
  {
    "text": "Trump is silent about Juneteenth on a day he previously honored as president  —  President Donald Trump honored Juneteenth in each of his first four years as president, even before it became a federal holiday.  He even claimed once to have made it “famous.”",
    "url": "https://apnews.com/article/trump-juneteenth-slavery-statement-holiday-28afec7cd532295437d53d3ec29f549f"
  },
  {
    "text": "Parsing ICE's mixed-up, hard-to-believe assault claims  —  ICE officials keep touting a 413 percent increase in assaults on officers to justify anonymity.  —  Last month, I wrote a column questioning why Immigration and Customs Enforcement officers were increasingly disguising their identities as they conducted sweeps and arrests.",
    "url": "https://www.washingtonpost.com/opinions/2025/06/19/brad-lander-ice-assault-masking/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzUwMzA1NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzUxNjg3OTk5LCJpYXQiOjE3NTAzMDU2MDAsImp0aSI6IjkzZmYyMmUzLTU5MWMtNGQ3OC1hMmMwLWI4OTYwNmY0ODRkMiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9vcGluaW9ucy8yMDI1LzA2LzE5L2JyYWQtbGFuZGVyLWljZS1hc3NhdWx0LW1hc2tpbmcvIn0.jI3RdkdeQ_BuOvl3vCMb275mxz0VICVSopkT2v71vjg&itid=gfta"
  },
  {
    "text": "LA Dodgers says it denied ICE access to stadium grounds  —  The Los Angeles Dodgers said Thursday it denied Immigration and Customs Enforcement (ICE) agents entry to their stadium grounds.  —  “This morning, ICE agents came to Dodger Stadium and requested permission to access the parking lots.",
    "url": "https://thehill.com/latino/5359804-la-dodgers-deny-ice-access-to-stadium-grounds/"
  },
  {
    "text": "ICE Imposes New Rules on Congressional Visits  —  The policy specifies that ICE field offices are not subject to an existing law that allows members of Congress to make unannounced oversight visits to immigration facilities that “detain or otherwise house aliens.”",
    "url": "https://www.nytimes.com/2025/06/19/us/politics/ice-congress.html"
  },
  {
    "text": "'He's a snake': Musk jabs at Trump adviser who fueled messy presidential breakup  —  Sergio Gor helped facilitate the termination of Jared Isaacman's nomination for NASA head — a pick Musk had pushed.  —  Elon Musk may have stopped sparring with President Donald Trump online … ",
    "url": "https://www.politico.com/news/2025/06/19/musk-sergio-gor-feud-00414246"
  },
  {
    "text": "Exclusive: Democrats want new leaders, focus on pocketbook issues, Reuters/Ipsos poll finds  —  Democrats want new leaders for their party, which many feel isn't focusing enough on economic issues and is over-emphasizing issues like transgender rights and electric vehicles, a Reuters/Ipsos poll found.",
    "url": "https://www.reuters.com/world/us/democrats-want-new-leaders-focus-pocketbook-issues-reutersipsos-poll-finds-2025-06-19/"
  },
  {
    "text": "An Islamic Republic With Its Back Against the Wall  —  The Iranian regime finds itself in its most difficult position 46 years after the revolution that brought it to power.  But does it mean the end?  —  Beneath Israel's bombs lies an unpopular and repressive Iranian regime that has spent billions … ",
    "url": "https://www.nytimes.com/2025/06/19/world/middleeast/iran-islamic-republic-regime.html?unlocked_article_code=1.QE8.LKxr.JAPlwgBWFiD2&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Trump's border czar: Immigration raids at farms, hotels to continue  —  Following a week of immigration whiplash, President Trump's border czar Tom Homan confirmed Thursday that immigration raids will continue in the agriculture and hospitality industries.  —  The big picture … ",
    "url": "https://www.axios.com/2025/06/19/trump-immigration-raids-farms-hotels-border-czar"
  },
  {
    "text": "Trump's Nuclear Attack ‘Doomsday Plane’ Arrives In Washington  —  A U.S. Air Force “Doomsday Plane” arrived at Joint Base Andrews Tuesday night, fueling speculation of a potential U.S. role in the escalating Israel-Iran crisis.  —  The E-4B Nightwatch aircraft landed at the military facility … ",
    "url": "https://www.newsweek.com/trump-doomsday-plane-spotted-flying-2087848"
  },
  {
    "text": "Trump Insists MAGA ‘HATES’ Fox News After Embarrassing Network Poll  —  HURT FEELINGS  —  He couldn't believe what voters really think of his “miraculously perfect” border.  —  President Donald Trump savaged Fox News and declared that his MAGA base hates the network after a poll showed his approval ratings tanking.",
    "url": "https://www.thedailybeast.com/trump-insists-maga-hates-fox-news-after-embarrassing-network-poll/"
  },
  {
    "text": "Trump extends TikTok ban deadline by another 90 days  —  The latest ban extension is the third Trump has given to TikTok's Chinese owner, ByteDance.  —  President Donald Trump has extended the deadline for TikTok's parent company, ByteDance, to sell the short-form video app to an American owner by another 90 days.",
    "url": "https://www.nbcnews.com/tech/social-media/trump-extends-tiktok-ban-deadline-another-90-days-rcna213720"
  },
  {
    "text": "Paramount delays $35M settlement with Trump as media giant fears bribery backlash: sources  —  A potential $35 million settlement of President Trump's lawsuit against Paramount's CBS affiliate has been delayed after the company's management continued to fear a potential legal backlash, The Post has learned.",
    "url": "https://nypost.com/2025/06/19/media/paramount-delays-35m-settlement-with-trump-sources/"
  },
  {
    "text": "Focus groups: Latino Trump voters diverge on deportations but largely still back the president  —  The focus group participants broadly supported Trump's actions on immigration and the economy, but some divisions emerged over the focus of his deportation program.",
    "url": "https://www.nbcnews.com/politics/politics-news/focus-groups-latino-trump-voters-diverge-deportations-largely-still-ba-rcna213461"
  },
  {
    "text": "Maduro Locks Up Economists Sharing Data on Venezuela's Decline  —  President Nicolás Maduro has intensified his crackdown on independent economists and consultants, detaining at least eight people in what critics call a bid to control data exposing Venezuela's decline.",
    "url": "https://www.bloomberg.com/news/articles/2025-06-19/maduro-locks-up-economists-sharing-data-on-venezuela-s-decline"
  },
  {
    "text": "Spain threatens to derail Nato summit over Trump defence target  —  Madrid balks at US president's request for members to increase security spending to 5% of GDP  —  Spain is threatening to derail a Nato summit intended to appease Donald Trump by refusing to commit to the US president's request … ",
    "url": "https://www.ft.com/content/a8db875d-0c17-4f78-bd33-5faaf0903ad0"
  },
  {
    "text": "How My Reporting on the Columbia Protests Led to My Deportation  —  As an Australian who wrote about the demonstrations while on campus, I gave my phone a superficial clean before flying to the U.S. I underestimated what I was up against.  —  Many people are detained at U.S. airports for reasons they find arbitrary and mysterious.",
    "url": "https://www.newyorker.com/news/the-lede/how-my-reporting-on-the-columbia-protests-led-to-my-deportation"
  },
  {
    "text": "The Atlantic Announces Staff Writers Quinta Jurecic, Toluse Olorunnipa, and Nancy Youssef  —  As The Atlantic continues a major expansion of its editorial staff, today editor in chief Jeffrey Goldberg is announcing the hires of Quinta Jurecic, Toluse Olorunnipa, and Nancy Youssef as staff writers.",
    "url": "https://www.theatlantic.com/press-releases/archive/2025/06/atlantic-hires-jurecic-olorunnipa-and-youssef/683229/"
  },
  {
    "text": "Americans largely disapprove of U.S. involvement in Israel and Iran war: Poll  —  A majority of Americans don't want the U.S. to get involved in the escalating war between Israel and Iran, a poll released this week found.  —  The big picture: President Trump is slated to make a decision … ",
    "url": "https://www.axios.com/2025/06/19/israel-iran-war-americans-poll"
  },
  {
    "text": "‘Weak,’ ‘whiny’ and ‘invisible’: Critics of DNC Chair Ken Martin savage his tenure  —  The new DNC chair has faced messy drama since stepping into the role in February.  —  Four-and-a-half months after the Democratic National Committee chair pledged to focus on fighting Donald Trump … ",
    "url": "https://www.politico.com/news/2025/06/19/dnc-chair-ken-martin-infighting-00413409"
  },
  {
    "text": "The Supreme Court's Blindness to Transgender Reality  —  Imagine you are a transgender teenager.  Don't ask me how you know that you are transgender: That question is no more appropriate or relevant than asking people how they know that they are gay or Jewish or Black.  Maybe you've always known.",
    "url": "https://www.nytimes.com/2025/06/19/opinion/the-supreme-court-fails-to-see-transgender-teens.html?unlocked_article_code=1.QE8.WpSF.018ellE9-T9r&smid=url-share"
  }
]