[
  {
    "text": "Trump's Speeches, Increasingly Angry and Rambling, Reignite the Question of Age … Former President Donald J. Trump vividly recounted how the audience at his climactic debate with Vice President Kamala Harris was on his side.  Except that there was no audience.  The debate was held in an empty hall.",
    "url": "https://www.nytimes.com/2024/10/06/us/politics/trump-speeches-age-cognitive-decline.html?unlocked_article_code=1.QE4.Sj6N.wDMvFD_Cmj4k&smid=url-share"
  },
  {
    "text": "‘Sounding the alarm’: Election officials warn postal delays could invalidate mailed ballots  —  Postmaster General Louis DeJoy says staffers take ‘extraordinary measures’ to delivery ballots on time, but election officials warn delays could invalidate votes.",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/10/06/absentee-mail-in-ballots-postal-service-delays/75499900007/"
  },
  {
    "text": "‘This is voter fraud’: FBI alerted as Elon Musk's mom accused of committing federal crime  —  Donald Trump's embrace of the richest man in the world, Elon Musk, hit another speedbump on Saturday as Musk's mom was accused of encouraging her followers to commit voter fraud.",
    "url": "https://www.rawstory.com/elon-musks-mom-voter-fraud-trump/"
  },
  {
    "text": "Harris Will Appear in a Whirlwind of Interviews, Most of Them Friendly  —  After mostly avoiding interviews as her campaign began, the vice president will hold several this week, including with Howard Stern, Stephen Colbert and the hosts of “The View.”  —  Vice President Kamala Harris … ",
    "url": "https://www.nytimes.com/2024/10/06/us/politics/kamala-harris-interviews-the-view-stern-stephen-colbert.html"
  },
  {
    "text": "Harris weighs more breaks with Biden as he keeps injecting himself into the campaign  —  Top aides to Kamala Harris are heading into the final month of the 2024 presidential race still wrestling with how much distance she can credibly claim from Joe Biden as she looks for more ways to weave in breaks with him on the campaign trail.",
    "url": "https://www.cnn.com/2024/10/06/politics/harris-biden-breaks/"
  },
  {
    "text": "Fact check: Six days of Trump lies about the Hurricane Helene response  —  Former President Donald Trump has delivered a barrage of lies and distortions about the federal response to Hurricane Helene.  —  While various misinformation about the response has spread widely without Trump's involvement … ",
    "url": "https://www.cnn.com/2024/10/06/politics/fact-check-trump-helene-response-north-carolina/"
  },
  {
    "text": "Hines & RFK Jr. ‘Have Barely Spoken’ Since Affair News Broke  —  EMBARRASSED  —  Cheryl Hines and Robert F. Kennedy Jr. “have barely spoken” since news emerged that he had a digital affair with New York magazine reporter Olivia Nuzzi, a source told People magazine.",
    "url": "https://www.thedailybeast.com/cheryl-hines-and-rfk-jr-have-barely-spoken-since-affair-news-broke"
  },
  {
    "text": "All Hell Is Going to Break Loose: Maybe Jack Smith Did Precisely What Elie Honig Claims He Didn't  —  There are a number of laugh-in-his-face funny things about Elie Honig's column bitching that Jack Smith submitted his immunity filing before the election.  First, for years Honig whined … ",
    "url": "https://www.emptywheel.net/2024/10/06/all-hell-is-going-to-break-loose-maybe-jack-smith-did-precisely-what-elie-honig-claims-he-didnt/"
  },
  {
    "text": "Mark Kelly on Harris: 'I'm confident she's going to win Arizona'  —  Sen. Mark Kelly (D-Ariz.) said on Sunday he's confident Vice President Harris is going to win his state of Arizona and the race overall.  —  In an interview on CNN's “State of the Union,” anchor Dana Bash pressed … ",
    "url": "https://thehill.com/homenews/campaign/4918284-mark-kelly-confident-kamala-harris-win-arizona/"
  },
  {
    "text": "Johnson punts on GOP rhetoric, 2020 election outcome  —  Trump has accused Democrats of trying to kill him.  —  Speaker of the House Mike Johnson appears on “This Week,” Oct. 6, 2024.  —  Speaker Mike Johnson, R-La., declined to definitively answer questions on Republican rhetoric surrounding … ",
    "url": "https://abcnews.go.com/Politics/johnson-punts-gop-rhetoric-2020-election-outcome/story?id=114530238"
  },
  {
    "text": "Signs grow that young Black voters are going to show up for Harris  —  Courtney McClain was 18 when she met then-Sen. Kamala Harris in 2019 at the Carolina Country Club in Spartanburg, S.C.  —  When McClain arrived at the club, Harris, then a candidate in the 2020 Democratic presidential primary, offered her some advice.",
    "url": "https://thehill.com/homenews/campaign/4916523-young-black-voters-kamala-harris/"
  },
  {
    "text": "‘Undisciplined, unhinged and deranged’: will Trump's strange behavior hurt him at the polls?  —  While he's always been quick to insult, he's now frequently vicious, and his speeches are increasingly disjointed  —  A “beautiful” beach body and a “mentally disabled” opponent.",
    "url": "https://www.theguardian.com/us-news/2024/oct/06/trump-behavior-final-meltdown"
  },
  {
    "text": "October 5, 2024  —  William McKinley is having a moment (which I confess is a sentence I never expected to write).  —  Republican presidential nominee Donald Trump is elevating McKinley, representative from Ohio from 1877 to 1891 and president from 1897 to 1901, to justify his plan to impose new high tariffs.",
    "url": "https://heathercoxrichardson.substack.com/p/october-5-2024"
  },
  {
    "text": "Antisemitic incidents in the US soar to record high  —  Antisemitic incidents in the U.S. have soared to an all-time high in the wake of Hamas's Oct. 7 attack on Israel, according to new data released by the Anti-Defamation League (ADL).  —  The group tracked more than 10,000 incidents from Oct. 7 … ",
    "url": "https://thehill.com/homenews/state-watch/4916905-antisemitic-incidents-all-time-high/"
  },
  {
    "text": "Playbook: Michigan messes mount for Harris  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  TICK TOCK — One month until Election Day.  —  RETURN TO BUTLER — Former President DONALD TRUMP heads back to Butler, Pennsylvania, today … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/10/05/michigan-messes-mount-for-harris-00182609"
  }
]