[
  {
    "text": "Abrego Garcia's deportation case exposes a rift among Democrats over how to take on Trump  —  As some Democrats vocally push for the release of the man the administration says was mistakenly deported, others have sought to steer clear and focus on high prices and economic issues.",
    "url": "https://www.nbcnews.com/politics/immigration/abrego-garcias-deportation-case-exposes-rift-democrats-take-trump-rcna201723"
  },
  {
    "text": "Trump Administration Live Updates: Senator Meets With Wrongly Deported Maryland Man in El Salvador  —  The senator's meeting came after he had been denied access to the wrongly deported man.  —  Senator Chris Van Hollen said on Thursday night that he had met in San Salvador … ",
    "url": "https://www.nytimes.com/live/2025/04/17/us/trump-news-updates?unlocked_article_code=1.Ak8.7nab.UiX7VEs51mhb&smid=url-share"
  },
  {
    "text": "Rubio Says U.S. to ‘Move On’ From Ukraine Peace Efforts if No Progress Soon  —  “If it is not possible to end the war in Ukraine, we need to move on,” the American secretary of state said as he departed meetings in Paris.  —  The United States will abandon efforts to end the war in Ukraine … ",
    "url": "https://www.nytimes.com/2025/04/18/world/europe/rubio-ukraine-russia-war-paris.html"
  },
  {
    "text": "Trump ready to ‘move on’ from Ukraine peace talks if no progress, Rubio says  —  Rubio's remarks appear to reflect the president's frustration with the difficulty of achieving peace in Ukraine after Russia's 2022 full-scale invasion.  —  PARIS — President Donald Trump is ready to “move on” … ",
    "url": "https://www.washingtonpost.com/world/2025/04/18/rubio-trump-ukraine-peace-talks-russia/"
  },
  {
    "text": "US will abandon Ukraine peace push if no progress ‘within a matter of days,’ Rubio says  —  U.S. President Donald Trump will walk away from trying to broker a Russia-Ukraine peace deal within days unless there are clear signs that a deal can be done, U.S. Secretary of State Marco Rubio said on Friday.",
    "url": "https://www.reuters.com/world/us-ready-abandon-efforts-broker-russia-ukraine-peace-deal-rubio-says-2025-04-18/"
  },
  {
    "text": "The State Department is changing its mind about what it calls human rights  —  The Trump administration is substantially scaling back the State Department's annual reports on international human rights to remove longstanding critiques of abuses such as harsh prison conditions … ",
    "url": "https://www.npr.org/2025/04/18/nx-s1-5357511/state-department-human-rights-report-cuts"
  },
  {
    "text": "What's Happening Is Not Normal.  America Needs an Uprising That Is Not Normal.  —  In the beginning there was agony.  Under the empires of old, the strong did what they willed and the weak suffered what they must.  —  But over the centuries, people built the sinews of civilization … ",
    "url": "https://www.nytimes.com/2025/04/17/opinion/trump-harvard-law-firms.html?unlocked_article_code=1.AU8.K4jq.TyX5a_Zlsepx&smid=re-nytopinion"
  },
  {
    "text": "House Democrats fume at David Hogg's plan to oust lawmakers  —  Democratic National Committee vice chair David Hogg's plan to spend $20 million to primary older Democratic incumbents in Congress has sparked intense anger from some lawmakers.  —  Why it matters: House Democrats told Axios that … ",
    "url": "https://www.axios.com/2025/04/18/house-democrats-david-hogg-primary-dnc"
  },
  {
    "text": "DOGE is slashing 90% of a federal agency designed to prevent another financial crisis  — The Consumer Financial Protection Bureau terminated 90% of its staff.  — A copy of a termination notice reviewed by BI said employees will lose access to work systems on Friday night.",
    "url": "https://www.businessinsider.com/doge-terminations-cfpb-trump-cuts-staff-prevent-financial-crisis-2025-4"
  },
  {
    "text": "Trump Releases Files on 1968 Assassination of Robert F. Kennedy  —  President Donald Trump's administration on Friday released more than 10,000 pages of files related to the 1968 assassination of former Senator Robert F. Kennedy, following through on an executive order aimed at declassifying documents … ",
    "url": "https://www.bloomberg.com/news/articles/2025-04-18/trump-releases-files-on-assassination-of-robert-f-kennedy-sr"
  },
  {
    "text": "With Harvard Threat, Trump Tries to Bend the I.R.S. to His Will  —  Since the post-Nixon era, the Internal Revenue Service has had a degree of independence from the White House.  President Trump is seeking to change that.  —  In the years after President Richard Nixon enlisted … ",
    "url": "https://www.nytimes.com/2025/04/18/us/politics/trump-irs.html"
  },
  {
    "text": "FDA making plans to end its routine food safety inspections, sources say  —  The Food and Drug Administration is drawing up plans that would end most of its routine food safety inspections work, multiple federal health officials tell CBS News, and effectively outsource this oversight to state and local authorities.",
    "url": "https://www.cbsnews.com/news/fda-food-safety-inspections-plans/"
  },
  {
    "text": "U.S.-born American citizen under ICE hold in Florida after driving from Georgia  —  Juan Carlos Gomez-Lopez is being held even though a county judge found his birth certificate “authentic” and said there wasn't reason to consider him an “illegal alien.”  —  A U.S.-born American citizen … ",
    "url": "https://www.nbcnews.com/news/latino/us-born-citizen-detained-ice-immigration-florida-rcna201800"
  },
  {
    "text": "Wisconsin governor can lock in 400-year school funding increase using a veto, court says  —  The Democratic governor of Wisconsin's creative use of his uniquely powerful veto can lock in a school funding increase for 400 years, the state Supreme Court ruled Friday.",
    "url": "https://apnews.com/article/wisconsin-400-year-veto-supreme-court-5a1be188f78ab5e4223b2c7c7ad3ca7d"
  },
  {
    "text": "Travel to the U.S. from almost everywhere is falling under Trump  —  Charts show the scale of a steep drop in visitors from key countries and regions after President Donald Trump returned to office.  —  Overseas travel to the United States has declined sharply since President Donald Trump returned to office.",
    "url": "https://www.washingtonpost.com/world/2025/04/18/us-tourism-travel-trump/"
  },
  {
    "text": "A deadly E. coli outbreak hit 15 states, but the FDA chose not to publicize it  —  The outbreak linked to romaine lettuce killed one person and sickened at least 88 more, including a 9-year-old boy who nearly died of kidney failure.  —  An E. coli outbreak linked to romaine lettuce ripped across 15 states … ",
    "url": "https://www.nbcnews.com/news/us-news/ecoli-bacteria-lettuce-outbreak-rcna200236"
  },
  {
    "text": "Trump's newest grift: Building a cryptocurrency empire while destroying its regulators  —  Listen to me read this post here (not an AI-generated voice!), subscribe to the feed in your podcast app, or download the recording for later.  —  In an unprecedented abuse of presidential power … ",
    "url": "https://www.citationneeded.news/trump-crypto-empire/"
  },
  {
    "text": "US Supreme Court to hear Trump bid to enforce birthright citizenship order  —  The U.S. Supreme Court said on Thursday it will hear arguments next month over Donald Trump's bid to broadly enforce his executive order to restrict automatic birthright citizenship, a key pillar … ",
    "url": "https://www.reuters.com/world/us/us-supreme-court-hear-trump-bid-enforce-birthright-citizenship-order-2025-04-17/"
  },
  {
    "text": "Trump's United States of Emergency  —  In his first 100 days, President Trump has declared more national emergencies — more creatively and more aggressively — than any president in modern American history.  —  Why it matters: Powers originally crafted to give the president flexibility … ",
    "url": "https://www.axios.com/2025/04/18/trump-national-emergency-declarations"
  },
  {
    "text": "Trump's War on Measurement Means Losing Data on Drug Use, Maternal Mortality, Climate Change and More  —  More children ages 1 to 4 die of drowning than any other cause of death.  Nearly a quarter of adults received mental health treatment in 2023, an increase of 3.4 million from the prior year.",
    "url": "https://www.propublica.org/article/trump-doge-data-collection-hhs-epa-cdc-maternal-mortality"
  },
  {
    "text": "Strange sell-off in the dollar raises the specter of investors losing trust in the US under Trump  —  Among the threats tariffs pose to the U.S. economy, none may be as strange as the sell-off in the dollar.  Currencies rise and fall all the time because of inflation fears, central bank moves and other factors.",
    "url": "https://apnews.com/article/dollar-trump-tariffs-trade-safe-haven-china-c108fd36a3122f85872ad34ba5f5d977"
  },
  {
    "text": "DOGE begins to freeze health-care payments for extra review  —  DOGE is putting new curbs on billions of dollars in federal grants, requiring officials to manually review and approve payments that were previously routine.  —  The U.S. DOGE Service is putting new curbs on billions of dollars … ",
    "url": "https://www.washingtonpost.com/politics/2025/04/17/doge-trump-grants-hhs-nih-backlog/"
  },
  {
    "text": "Trump is wrapping up 100 days of historic failure  —  America has seen ruinous periods, but never when the president was the one knowingly causing the ruin.  —  By any reasonable measure, President Donald Trump's first 100 days will be judged an epic failure.  —  He has been a legislative failure.",
    "url": "https://www.washingtonpost.com/opinions/2025/04/18/trump-100-days-failure/"
  },
  {
    "text": "U.S. intelligence contradicts Trump's justification for mass deportations  —  The determination is the most comprehensive assessment to date undercutting the president's rationale for deporting suspected gang members without due process.  —  The National Intelligence Council … ",
    "url": "https://www.washingtonpost.com/national-security/2025/04/17/us-intelligence-tren-de-aragua-deportations-trump/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ0ODYyNDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ2MjQ0Nzk5LCJpYXQiOjE3NDQ4NjI0MDAsImp0aSI6IjgyYWZiNzRmLTYxODEtNGRjNi1hNWFjLWJlMjMyYjRmM2VmYiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb25hbC1zZWN1cml0eS8yMDI1LzA0LzE3L3VzLWludGVsbGlnZW5jZS10cmVuLWRlLWFyYWd1YS1kZXBvcnRhdGlvbnMtdHJ1bXAvIn0.F8QCNQIWtNgNiJQ9dxrBxcJEECASABX7wzrXXm8Kx2M&itid=gfta"
  },
  {
    "text": "US strikes on a Yemeni oil port kill 74 people, Houthis say, in deadliest attack of Trump campaign  —  U.S. airstrikes targeting an oil port held by Yemen's Houthi rebels killed 74 people and wounded 171 others, the group said Friday, marking the single-deadliest known attack under President Donald Trump's … ",
    "url": "https://apnews.com/article/yemen-us-airstrikes-563f61bbd96e1f2de68373fdf76c8811"
  },
  {
    "text": "Does It Matter If He's a Criminal?  —  The Justice Department, with Attorney General Pam Bondi most unseemingly leading the charge, is on a campaign to paint Kilmar Abrego Garcia, the man they have acknowledged was illegally sent to a prison used to house terrorists in El Salvador, as a bad guy.",
    "url": "https://joycevance.substack.com/p/does-it-matter-if-hes-a-criminal"
  },
  {
    "text": "Appeals court won't lift order to ‘facilitate’ Abrego Garcia's return in blistering opinion  —  The 4th U.S. Circuit Court of Appeals on Thursday declined to lift a judge's order that the Trump administration “facilitate” the return of Kilmar Abrego Garcia, admonishing the Justice Department in the ruling.",
    "url": "https://thehill.com/homenews/5254406-abrego-garcia-appeals-court-order/"
  },
  {
    "text": "SCOTUS Can Let the President Break the Law; They Can't Change It … We are now cranking up another edition of the “will he or won't he” Trump song and dance, this time about firing Fed Chair Jerome Powell.  Trump manages to add an additional pungency to these dramas by trying to fire the guy who is actually his own Fed Chair.",
    "url": "https://talkingpointsmemo.com/edblog/scotus-can-let-the-president-break-the-law-they-cant-change-it"
  }
]