[
  {
    "text": "‘Political Malpractice’: The Debate Commission Chief Thinks Trump Blew It  —  Frank J. Fahrenkopf Jr. lets loose on the potentially mortal wound to the Commission on Presidential Debates, and why Biden got the better of Trump.  —  Despite all the talk that Joe Biden killed the Commission … ",
    "url": "https://www.politico.com/news/magazine/2024/05/17/debate-commission-chief-trump-00158689"
  },
  {
    "text": "‘No more games’: Biden rejects additional debates against Trump  —  Both campaigns agreed to two debates this week.  The Biden campaign said it wasn't interested in two additional face-offs that Trump has accepted.  —  President Joe Biden's campaign rejected two additional debates on Friday … ",
    "url": "https://www.nbcnews.com/politics/2024-election/biden-rejects-debates-trump-nbc-telemundo-fox-news-rcna152860"
  },
  {
    "text": "Biden and Trump cut a deal on debates.  Then the fighting started.  —  Inside the ongoing feud over who came out on top when two candidates decided to upend the nation's presidential debate tradition.  —  Less than two hours after President Biden made his move Wednesday to upend … ",
    "url": "https://www.washingtonpost.com/politics/2024/05/17/biden-trump-cnn-debate-decision/"
  },
  {
    "text": "Exclusive: Sean ‘Diddy’ Combs seen physically assaulting Cassie Ventura in 2016 surveillance video obtained by CNN  —  A 2016 surveillance video obtained exclusively by CNN shows Sean “Diddy” Combs grab, shove, drag and kick his then-girlfriend Cassie Ventura during an altercation … ",
    "url": "https://www.cnn.com/2024/05/17/entertainment/sean-combs-cassie-ventura/"
  },
  {
    "text": "GOP, Dems Round on MTG After Outburst: ‘Her Brand Is Chaos’  —  ‘ABSOLUTELY A RACIST THING’  —  Rep. Jasmine Crockett said Greene mentioning her eyelashes was an attempt to make her look “ghetto,” while even Rep. Lauren Boebert said she was embarrassed by her GOP colleague.",
    "url": "https://www.thedailybeast.com/gop-dems-round-on-mtg-after-committee-outburst-her-brand-is-chaos"
  },
  {
    "text": "Man convicted of attacking ex-Speaker Nancy Pelosi's husband with a hammer sentenced to 30 years  —  The man convicted of attempting to kidnap then-House Speaker Nancy Pelosi and attacking her husband with a hammer was sentenced Friday to 30 years in prison.",
    "url": "https://apnews.com/article/paul-pelosi-nancy-hammer-attack-depape-sentence-b41b6c776fb27f62913e3754afa1ceac"
  },
  {
    "text": "Glamorous GOP Rep. Beth Van Duyne breaks her silence on love affair with married Georgia Republican Rich McCormick  — McCormick was seen stroking Van Duyne's arm during the State of the Union  —  By JON MICHAEL RAASCH, POLITICAL REPORTER ON CAPITOL HILL, FOR DAILYMAIL.COM and MORGAN PHILLIPS, CONGRESS REPORTER FOR DAILYMAIL.COM",
    "url": "https://www.dailymail.co.uk/news/article-13430725/beth-van-duyne-confirms-affair-rich-mccormick.html"
  },
  {
    "text": "Alito's Explanation for the Upside-Down American Flag Honestly Makes It Worse  —  We have known for some time now that the current Supreme Court is not comprised of “conservatives” and “liberals,” or even “jurists” and “reactionaries.”  It has split into those who care about the future … ",
    "url": "https://slate.com/news-and-politics/2024/05/alito-flag-supreme-court-justices-stop-the-steal-ethics-rules-pitiful.html"
  },
  {
    "text": "Scoop: U.S., Iran held talks this week on avoiding more attacks … - The talks occurred just over a month after Iran's unprecedented missile assault on Israel on April 13.  — The attack put the Middle East on the cusp of a regional war. … - It was the first-ever direct attack on Israel that had been launched from Iranian soil.",
    "url": "https://www.axios.com/2024/05/17/biden-us-iran-regional-attacks"
  },
  {
    "text": "MAGA Rage at Trump's Trial Just Got Darker and More Dangerous  —  In recent days, a parade of Republicans have shown up at the Manhattan courthouse where Donald Trump faces criminal charges related to the hush-money scheme he concocted to deceive American voters during the 2016 election.",
    "url": "https://newrepublic.com/article/181682/trump-trial-maga-rage-dark-dangerous"
  },
  {
    "text": "UAW Loses Unionization Vote at Mercedes Factories in Alabama  —  The election, fiercely opposed by the state's political leaders, was seen as a test of the United Automobile Workers' ability to unionize factories in the South.  —  Workers at two Mercedes-Benz factories near Tuscaloosa … ",
    "url": "https://www.nytimes.com/2024/05/17/business/mercedes-benz-uaw-alabama-vote.html"
  },
  {
    "text": "New Star Wars Plan: Pentagon Rushes to Counter Threats in Orbit  —  Citing rapid advances by China and Russia, the United States is building an extensive capacity to fight battles in space.  —  The Pentagon is rushing to expand its capacity to wage war in space, convinced that rapid advances … ",
    "url": "https://www.nytimes.com/2024/05/17/us/politics/pentagon-space-military-russia-china.html"
  },
  {
    "text": "Bridget and Christian Ziegler ‘Prowled’ Florida Bars for Women, Police Memo Says  —  PREDATORY  —  “Don't come home until your d*ck is wet,” Moms For Liberty founder Bridget Ziegler allegedly told her husband.  —  Newly released documents say Moms For Liberty co-founder Bridget Ziegler … ",
    "url": "https://www.thedailybeast.com/bridget-and-christian-ziegler-prowled-florida-bars-in-search-of-women-to-have-sex-with-docs"
  },
  {
    "text": "Senior Mike Johnson Staffer Resigns Over Behavioral Complaints … A senior communications staffer in Speaker Mike Johnson's office abruptly resigned this week after he was presented with complaints about his behavior, sources confirmed to NOTUS.  —  Anang Mittal, who was Johnson's head of digital … ",
    "url": "https://www.notus.org/congress/senior-mike-johnson-staffer-resigns-over-behavioral-complaints"
  },
  {
    "text": "US, TikTok seek fast-track schedule, ruling by Dec. 6 on potential ban  —  The U.S. Justice Department and TikTok on Friday asked a U.S. appeals court to set a fast-track schedule to consider the legal challenges to a new law requiring China-based ByteDance to divest TikTok's U.S. assets by Jan. 19 or face a ban.",
    "url": "https://www.reuters.com/technology/us-tiktok-seek-fast-track-schedule-ruling-by-dec-6-potential-ban-2024-05-17/"
  },
  {
    "text": "John Eastman, former Trump lawyer, pleads not guilty in Arizona election interference case  —  Former Donald Trump lawyer John Eastman pleaded not guilty in Phoenix on Friday on charges related to allegedly participating in a conspiracy to overturn the 2020 election results in Arizona.",
    "url": "https://www.cnn.com/2024/05/17/politics/john-eastman-arizona-not-guilty-plea"
  },
  {
    "text": "'A Governor Who Doesn't Seem to Have Much Interest in Governing Arkansas'  —  Sarah Huckabee Sanders' increasing number of critics think she's too worried about her national profile.  —  Gov. Sarah Huckabee Sanders assumed a podium on a recent spring morning in Arkansas … ",
    "url": "https://www.politico.com/news/magazine/2024/05/17/sarah-huckabee-sanders-arkansas-maga-trump-00156647"
  }
]