[
  {
    "text": "Trump allies try to energize him as he struggles to adapt to Harris  —  The Republican nominee has fixated on Biden's withdrawal: “It feels like he's lost his mojo.”  —  Republican nominee Donald Trump looked cheerful playing golf at his New Jersey club one day earlier this month … ",
    "url": "https://www.washingtonpost.com/politics/2024/08/24/trump-energy-campaign-harris/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI0NDcyMDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI1ODU0Mzk5LCJpYXQiOjE3MjQ0NzIwMDAsImp0aSI6IjU2NmI3YzM2LWViNjctNDY2MS04NjkxLTJiNjYzMDJjMGFjOSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzA4LzI0L3RydW1wLWVuZXJneS1jYW1wYWlnbi1oYXJyaXMvIn0.MDzrYbXhK0xHakIlB0aG9TSaLo7X4RgzzV12FnSX0AA&itid=gfta"
  },
  {
    "text": "Harris's campaign has raised $540 million since launch, Democrats say  —  The amount raised since Biden bowed out in July amounts to “a record for any campaign in history,” the Harris campaign's manager says.  —  Vice President Kamala Harris's campaign has raised $540 million since it launched last month … ",
    "url": "https://www.washingtonpost.com/politics/2024/08/25/kamala-harris-fundraising-trump-election/"
  },
  {
    "text": "Harris raised $82M during convention, $540M since announcing candidacy  —  Vice President Harris's campaign raised $82 million during the Democratic convention and has brought in a staggering $540 million since she entered the presidential race roughly one month ago.",
    "url": "https://thehill.com/homenews/campaign/4846232-harris-raised-82m-during-convention-540m-since-announcing-candidacy/"
  },
  {
    "text": "Trump event at wall Obama built highlights an unkept promise  —  The Republican nominee heaped praise on a section of barrier that was actually built by his predecessor.  —  MONTEZUMA PASS, Ariz. — A brown ribbon carved a straight gash across a vast, flat desert basin, the only mark of human civilization visible on this wilderness.",
    "url": "https://www.washingtonpost.com/politics/2024/08/25/trump-event-wall-obama-built-highlights-an-unkept-promise/"
  },
  {
    "text": "Vance dodges on whether Trump's immigration policy would lead to family separation  —  In an interview with NBC News' “Meet the Press,” Ohio Sen. JD Vance didn't give a direct answer to questions about whether Trump's policy proposals on the border would lead to family separation.",
    "url": "https://www.nbcnews.com/politics/2024-election/vance-dodges-whether-trumps-immigration-policy-family-separation-rcna168088"
  },
  {
    "text": "Ignore my brother Bobby, Max Kennedy says  —  I'm heartbroken over my brother Bobby's endorsement of Donald Trump.  —  I think often about my father and how he might have viewed the politics of our time.  I'm not sure what he would have thought about TikTok or AI, but this much I know for sure: He would have despised Donald Trump.",
    "url": "https://www.latimes.com/opinion/story/2024-08-25/robert-kennedy-donald-trump-kamala-harris"
  },
  {
    "text": "Why It's So Hard to Find a Therapist Who Takes Insurance  —  America is in the midst of a mental health crisis.  —  But finding a therapist who takes insurance can feel impossible.  —  Insurers say that's because there aren't enough therapists.  —  That's not entirely true.",
    "url": "https://projects.propublica.org/why-i-left-the-network/"
  },
  {
    "text": "We removed RFK Jr. from our model.  But it didn't hurt Kamala.  —  Like everything else about his presidential campaign, Robert F. Kennedy's withdrawal from the presidential race was weird.  —  Kennedy endorsed Donald Trump yesterday and announced that he was “suspending” his campaign.",
    "url": "https://www.natesilver.net/p/we-removed-rfk-jr-from-our-model"
  },
  {
    "text": "Audience signs and chants at the DNC were all about America.  At the RNC, it was the Trump show.  — The Democratic and Republican national conventions concluded this week.  — Between party speeches and celebrity appearances, audience members held signs and led chants.",
    "url": "https://www.businessinsider.com/dnc-audience-signs-kamala-harris-compared-rnc-voters-donald-trump-2024-8"
  },
  {
    "text": "As Kamala Harris Claims Oakland, Berkeley Forgives … Kamala Harris spent much of her childhood living in a modest, yellow house in Berkeley, Calif. But as she campaigns for president, she calls herself a “daughter of Oakland.”  Jim Wilson/The New York Times",
    "url": "https://www.nytimes.com/2024/08/25/us/politics/kamala-harris-berkeley-hometown.html"
  },
  {
    "text": "Harris's DNC was a master class in coalition building  —  The nominee has found a way to use the simple and the obvious to activate a new majority.  —  CHICAGO — It all seems simple and obvious: If you want to win, embrace patriotism, talk incessantly about freedom and be joyfully hopeful.",
    "url": "https://www.washingtonpost.com/opinions/2024/08/25/kamala-harris-dnc-coalition-unity/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI0NTU4NDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI1OTQwNzk5LCJpYXQiOjE3MjQ1NTg0MDAsImp0aSI6ImE3ZmI3MjFlLWQxYmQtNGVkOS05MDg0LWMzZmExZThkNTdiZCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9vcGluaW9ucy8yMDI0LzA4LzI1L2thbWFsYS1oYXJyaXMtZG5jLWNvYWxpdGlvbi11bml0eS8ifQ.flM-PfW6U9f4DOvx9GsQYZ94sw2z7aEmScaZq8SZfRs&itid=gfta"
  },
  {
    "text": "Rick Scott dials up election denialism … - “We just had an election stolen in Venezuela. … Scott also recently echoed a right-wing talking point falsely suggesting noncitizens often vote in elections.  — If Democrats win in November, “They won't have to commit fraud to win elections anymore … ",
    "url": "https://www.axios.com/local/tampa-bay/2024/08/23/rick-scott-dials-up-election-denialism"
  },
  {
    "text": "German Police Arrest Suspect After Deadly Attack at Festival  — Three stabbed to death and eight wounded in city of Solingen  — Latest incident poised to fuel debate about immigration laws  —  German police have arrested a man who is “to the highest degree” suspected … ",
    "url": "https://www.bloomberg.com/news/articles/2024-08-24/terror-group-islamic-state-claims-responsibility-for-germany-attack-ap-says"
  },
  {
    "text": "How Tim Walz's dumb taco joke broke MAGA brains  —  Tough-talking right-wing pundits leaned into victimhood culture with their collective freakout over an anodyne joke.  —  Minnesota Gov. Tim Walz broke MAGA brains for the second time in a month — and he wasn't even calling them “weird” this time.",
    "url": "https://www.msnbc.com/opinion/msnbc-opinion/tim-walz-white-guy-tacos-harris-campaign-video-trump-ann-coulter-rcna167678"
  },
  {
    "text": "Kari Lake Trolled With Photo of Her Urged Off Stage at Trump Rally  —  U.S.  —  candidate  —  was trolled on Friday by her Democratic opponent, Representative  —  , with a photo of her being urged to get off the stage while speaking at a rally for former President  —  .",
    "url": "https://www.newsweek.com/kari-lake-trolled-ruben-gallego-urged-off-stage-donald-trump-rally-1943919"
  }
]