[
  {
    "text": "Trump proposes U.S. ‘take over’ Gaza, permanent displacement of residents  —  The idea, a first indicator of Trump's approach to the conflict, was sure to inflame the region given the history of Palestinians' displacement from their territory.",
    "url": "https://www.washingtonpost.com/politics/2025/02/04/trump-netanyahu-meeting/"
  },
  {
    "text": "Live updates: Trump wants US to take ownership of Gaza Strip  —  President Donald Trump says he wants the U.S. to take ownership of the Gaza Strip and redevelop it after Palestinians are resettled elsewhere.  He made the remarks in a joint press conference with Israeli Prime Minister Benjamin Netanyahu.",
    "url": "https://apnews.com/live/trump-presidency-updates-day-16"
  },
  {
    "text": "Democrats Are Falling For Trump and Musk's Foreign Aid Trap  —  Three veteran strategists want their party to be more thoughtful about fighting Trump's anti-bureaucracy campaign.  —  After three months of soul-searching about how to revive their party, some Democrats this week believe … ",
    "url": "https://www.politico.com/news/magazine/2025/02/04/democrats-foreign-aid-trap-trump-00202447"
  },
  {
    "text": "The CIA Is About to Get a Trump Makeover  —  Spy agency's workforce receives buyout-style offer  —  WASHINGTON—The Central Intelligence Agency offered buyouts to its entire workforce Tuesday, in what officials said is a bid to bring the agency in line with President Trump's priorities, including targeting drug cartels.",
    "url": "https://www.wsj.com/politics/national-security/the-cia-is-about-to-get-a-trump-makeover-16fc0cbf?st=UkTZ8Q"
  },
  {
    "text": "CIA sends ‘buyout’ offers to entire workforce  —  The Central Intelligence Agency on Tuesday became the first major national security agency to offer so-called buyouts to its entire workforce, a CIA spokesperson and two other sources familiar with the offer said, part of President Donald Trump's broad effort … ",
    "url": "https://www.cnn.com/2025/02/04/politics/cia-workforce-buyouts/"
  },
  {
    "text": "Musk Cronies Dive Into Treasury Dept Payments Code Base  —  Overnight, Wired reported that, contrary to published reports that DOGE operatives at the Treasury Department are limited to “read only” access to department payment systems, this is not true.  A 25-year-old DOGE operative named Marko Elez … ",
    "url": "https://talkingpointsmemo.com/edblog/musk-cronies-dive-into-treasury-dept-payments-code-base/sharetoken/f6ef509c-ac91-4914-ad6d-4b0f6f8abc3b"
  },
  {
    "text": "FBI turns over names of 5,000 employees who worked on January 6 cases to Trump Justice Department, as agents sue  —  FBI officials have complied with demands to provide the Justice Department with a list of thousands of employees who worked on investigations related to the January 6, 2021 … ",
    "url": "https://www.cnn.com/2025/02/04/politics/fbi-employees-tuesday"
  },
  {
    "text": "Federal health workers terrified after ‘DEI’ website publishes list of ‘targets’  —  The site calls out workers who have been involved with DEI initiatives.  A majority are Black.  —  Federal health workers are expressing fear and alarm after a website called “DEI Watch List” published the photos … ",
    "url": "https://www.nbcnews.com/health/health-news/federal-health-workers-terrified-dei-website-publishes-list-targets-rcna190711"
  },
  {
    "text": "U.S. government officials privately warn Musk's blitz appears illegal  —  The billionaire's DOGE team has launched an all-out assault on federal agencies, triggering numerous legal objections.  —  The chaotic blitz by Elon Musk's Department of Government Efficiency has triggered legal … ",
    "url": "https://www.washingtonpost.com/business/2025/02/04/elon-musk-government-legal-doge/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM4NjQ1MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQwMDI3NTk5LCJpYXQiOjE3Mzg2NDUyMDAsImp0aSI6ImJmNWQ2YmJhLWQzYmEtNDdkMS05MDQ0LTVhZWI2ZjNhYjllMiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9idXNpbmVzcy8yMDI1LzAyLzA0L2Vsb24tbXVzay1nb3Zlcm5tZW50LWxlZ2FsLWRvZ2UvIn0.nAg1iiymvc20QOtIdoLG04zHuSNFRwgDGTLPr4OLgHI&itid=gfta"
  },
  {
    "text": "Breaking the Law  —  Just weeks in, the Trump administration has violated rules, laws, and the Constitution.  —  “In America,” Thomas Paine wrote at the founding, “the law is king.”  Amid today's governing and constitutional crisis, we are finding out whether that is still true.",
    "url": "https://www.brennancenter.org/our-work/analysis-opinion/breaking-law"
  },
  {
    "text": "Multiple ICE impersonation arrests made during nationwide immigration crackdown  —  Editor's note: This story contains profane and hateful language.  —  Authorities in at least three states have arrested individuals allegedly impersonating Immigration and Customs Enforcement officers … ",
    "url": "https://www.cnn.com/2025/02/04/us/ice-impersonators-on-the-rise-arrests-made-as-authorities-issue-national-warning"
  },
  {
    "text": "Hong Kong CNN  —  The US Postal Service says it has temporarily suspended the acceptance of incoming international parcels from China and Hong Kong until further notice.  —  It did not provide a reason for the suspension, but said in a statement Tuesday the flow of letters will not be affected.",
    "url": "https://www.cnn.com/2025/02/04/business/us-postal-service-suspends-parcels-china-intl-hnk"
  },
  {
    "text": "Trump and Musk demand termination of federal office leases through General Services Administration  —  One of the next moves in President Donald Trump and Elon Musk's sweeping effort to fire government employees and curtail operations is using the agency that manages thousands … ",
    "url": "https://apnews.com/article/trump-musk-gsa-terminate-office-leases-f8faac5e2038722f705587c8dd21ab26"
  },
  {
    "text": "Doge staffers enter Noaa headquarters and incite reports of cuts and threats  —  Members reportedly sought access to IT systems at agency that Project 2025 has called ‘harmful to US prosperity’  —  Staffers with Elon Musk's “department of government efficiency” (Doge) reportedly entered … ",
    "url": "https://www.theguardian.com/us-news/2025/feb/04/doge-noaa-headquarters"
  },
  {
    "text": "White House preparing executive order to abolish the Department of Education  —  The planned order follows years of campaign promises from President Donald Trump to abolish the federal Education Department.  —  The White House is preparing an executive order to eliminate the Department of Education … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/white-house-preparing-executive-order-abolish-department-education-rcna190205"
  },
  {
    "text": "Biden signs with Hollywood agency  —  Former President Joe Biden is signing with a Hollywood agency in one of the first major indicators of what the 82-year-old will do after his presidency.  —  Biden previously signed with the Creative Artists Agency from 2017 to 2020 after leaving office as vice president.",
    "url": "https://www.washingtonexaminer.com/news/entertainment/3309189/biden-signs-hollywood-agency-caa/"
  },
  {
    "text": "EXCLUSIVE: Daniel Penny Gets Hired by Andreessen Horowitz  —  “Daniel acted with courage in a tough situation,” said partner David Ulevitch in a statement explaining the hire.  —  In less than two months, Daniel Penny has gone from facing a potential 20 years in prison to landing a role … ",
    "url": "https://www.thefp.com/p/exclusive-daniel-penny-hired-at-andreessen-horowitz"
  },
  {
    "text": "State Department moving to evacuate USAID staff worldwide: Sources  —  The State Department has begun working to assist in evacuating all USAID staff who are on foreign assignments worldwide, sources familiar with the effort told ABC News.  —  The Department is aiming to recall all USAID employees … ",
    "url": "https://abcnews.go.com/Politics/live-updates/trump-second-term-live-updates/?id=118389757&entryId=118457128"
  },
  {
    "text": "‘Things Are Going to Get Intense:’ How a Musk Ally Plans to Push AI on the Government  —  Thomas Shedd, a Musk-associate and now head of the General Services Administration's Technology Transformation Services (TTS), told government tech workers in a meeting this week that the administration plans … ",
    "url": "https://www.404media.co/things-are-going-to-get-intense-how-a-musk-ally-plans-to-push-ai-on-the-government/"
  },
  {
    "text": "When It's Not Just A Coup But A CFAA Violation Too  —  The hazard with landing upon a legal solution that seems too good to be true is that it often is.  So as you read this post it is important to keep in mind that I may have overlooked something, and there can always be defenses.",
    "url": "https://www.techdirt.com/2025/02/04/when-its-not-just-a-coup-but-a-cfaa-violation-too/"
  },
  {
    "text": "‘Beyond betrayal.’ Venezuelans in Florida are angry at Trump immigration policy  —  MIAMI — Venezuelan migrants in South Florida say they feel betrayed by a Trump administration decision to end legal protections for hundreds of thousands of people who fled dictatorships and sought refuge in the U.S.",
    "url": "https://www.npr.org/2025/02/04/nx-s1-5285470/venezuelans-florida-tps-immigration-trump"
  },
  {
    "text": "Science funding agency threatened with mass layoffs  —  National Science Foundation staff heard the plans at a meeting Tuesday.  —  One of the United States' leading funders of science and engineering research is planning to lay off between a quarter and a half of its staff in the next two months … ",
    "url": "https://www.politico.com/news/2025/02/04/science-funding-agency-layoffs-threat-00202426"
  },
  {
    "text": "Negotiations stall ahead of shutdown deadline as Democrats slam Trump for subverting spending laws  —  Democrats are eying the March 14 deadline to push back on Trump's recent unilateral actions, saying he needs to follow the law on government funding.  —  WASHINGTON — Government funding negotiations … ",
    "url": "https://www.nbcnews.com/politics/congress/negotiations-stall-shutdown-deadline-democrats-slam-trump-rcna190464"
  },
  {
    "text": "Scoop: Senate Dems plot USAID revenge on Trump … - Sen. Richard Blumenthal (D-Conn.) told Axios on Tuesday that he's willing to place holds on Trump nominees on the Senate Judiciary Committee.  — Blumenthal said the caucus is proceeding as if there is a blanket hold on Trump nominations.",
    "url": "https://www.axios.com/2025/02/04/senate-democrats-holds-nominees-usaid"
  },
  {
    "text": "Federal Workers Sue to Disconnect DOGE Server  —  Two federal workers, citing reports that Elon Musk's associates are operating an illegally connected email server at OPM, seek a restraining order.  —  Federal employees are seeking a temporary restraining order as part of a class action lawsuit accusing … ",
    "url": "https://www.wired.com/story/federal-workers-sue-over-doge-server/"
  },
  {
    "text": "How Trump Gutted America's $40 Billion Aid Agency in Two Weeks  —  Dismantling of USAID appears to be a test case for new administration  —  WASHINGTON—The cuts came so fast that one dismissed employee had to be rehired to process other employees' time sheets.",
    "url": "https://www.wsj.com/politics/policy/how-trump-musk-doge-killed-usaid-b649f1f5?st=2U1axT&reflink=article_copyURL_share"
  }
]