[
  {
    "text": "Trump's Shock Comic Was Set to Call Harris a ‘C*nt’  —  DONALD TRUMP'S CAMPAIGN WAS LEFT scrambling Sunday night after roast-comic Tony Hinchcliffe made insulting jokes about Hispanic and black people on stage at the ex-president's Madison Square Garden rally.",
    "url": "https://www.thebulwark.com/p/trumps-shock-comic-was-set-to-call"
  },
  {
    "text": "Trump's Puerto Rico fallout is ‘spreading like wildfire’ in Pennsylvania  —  Evidence of the backlash was immediate on Monday.  —  Donald Trump has a serious Puerto Rico problem — in Pennsylvania.  —  Many Puerto Rican voters in the state are furious about racist and demeaning comments delivered at a Trump rally.",
    "url": "https://www.politico.com/news/2024/10/28/trump-rally-puerto-rico-pennsylvania-fallout-00185935"
  },
  {
    "text": "Archbishop of San Juan says Trump needs to ‘personally’ apologize  —  The Archbishop of San Juan, Puerto Rico is asking former President Donald Trump to personally apologize for vulgar comments made about Puerto Ricans during a rally in Madison Square Garden over the weekend.",
    "url": "https://www.politico.com/live-updates/2024/10/28/2024-elections-live-coverage-updates-analysis/puerto-rico-archbishop-trump-madison-square-garden-00185983"
  },
  {
    "text": "Kamala Harris Had Lovely Sunday With Puerto Rican Voters, Why Do You Ask?  —  So much for inroads with Hispanic voters, maybe.  —  Of all the election scenarios we have had running through our mind for months, we'll admit that “activating millions of Puerto Rican voters against your own campaign … ",
    "url": "https://www.wonkette.com/p/kamala-harris-had-lovely-sunday-with"
  },
  {
    "text": "Trump rally comedian workshopped racist Puerto Rico line at NYC comedy club the night before  —  The comments have drawn intense anger and reignited the criticism over Trump's handling of Hurricane Maria's devastating aftermath in Puerto Rico.  —  The comedian who let loose a series of racist jokes … ",
    "url": "https://www.nbcnews.com/news/latino/tony-hinchcliffe-trump-rally-racist-puerto-rico-remarks-rcna177587"
  },
  {
    "text": "Over 200,000 subscribers flee ‘Washington Post’ after Bezos blocks Harris endorsement  —  The Washington Post has been rocked by a tidal wave of cancellations from digital subscribers and a series of resignations from columnists, as the paper grapples with the fallout of owner Jeff Bezos's decision … ",
    "url": "https://www.npr.org/2024/10/28/nx-s1-5168416/washington-post-bezos-endorsement-president-cancellations-resignations"
  },
  {
    "text": "Betrayed Washington Post readers leave their parting thoughts in 140,000 comments  —  According to NPR's David Folkenflik, a staggering, catastrophic 8 percent of Washington Post subscribers - over 200,000 — have canceled their subscriptions since Friday's news broke that owner Jeff Bezos ordered … ",
    "url": "https://presswatchers.org/2024/10/betrayed-washington-post-readers-leave-their-parting-thoughts-in-140000-comments/"
  },
  {
    "text": "USA Today the Latest to Offer Up Excuse for Lack of Presidential Endorsement  —  PLAYING IT SAFE  —  The national newspaper, which endorsed Joe Biden four years ago, says it'd rather have its editors focussed on local elections.  —  USA Today, the nation's fourth largest newspaper … ",
    "url": "https://www.thedailybeast.com/usa-today-the-latest-to-offer-up-excuse-for-lack-of-presidential-endorsement/"
  },
  {
    "text": "The hard truth: Americans don't trust the news media  —  A note from our owner.  —  Jeff Bezos is the owner of The Washington Post.  —  In the annual public surveys about trust and reputation, journalists and the media have regularly fallen near the very bottom, often just above Congress.",
    "url": "https://www.washingtonpost.com/opinions/2024/10/28/jeff-bezos-washington-post-trust/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzMwMDg4MDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzMxNDczOTk5LCJpYXQiOjE3MzAwODgwMDAsImp0aSI6IjE5ZGQxMWNiLWNjNjItNDA4Ni05YjM1LTA5MTYxYWQwMDliMyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9vcGluaW9ucy8yMDI0LzEwLzI4L2plZmYtYmV6b3Mtd2FzaGluZ3Rvbi1wb3N0LXRydXN0LyJ9.3bGpycf0p1iM1CkeklMNEzduE_s3yEK9Zk0jtEYt0Uk&itid=gfta"
  },
  {
    "text": "Fires set in drop boxes destroy hundreds of ballots in Washington and damage 3 in Oregon  —  Incendiary devices were set off Monday at two ballot drop boxes — one in Portland and another in nearby Vancouver, Washington — destroying hundreds of ballots in what one official called a … ",
    "url": "https://apnews.com/article/vote-ballot-drop-box-democracy-fire-f66c52f774955106fb9e7c8172825cff"
  },
  {
    "text": "Burning ballots pulled from inside smoking Vancouver ballot box; hundreds of ballots lost  —  VANCOUVER, Wash. — KATU was on the scene at Fisher's Landing Transit Center in Vancouver early Monday morning, where heavy smoke was seen coming from inside a dropoff ballot box.",
    "url": "https://www.katu.com/news/local/vancouver-ballot-box-seen-smoking-same-morning-as-portland-ballot-box-arson"
  },
  {
    "text": "Trump Wants You to Accept All of This as Normal  —  In the final week of this election season, the Republican Party is running two different campaigns.  One of them is an ugly and angry but conventional political enterprise.  Donald Trump and other Republicans make speeches … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/10/maidison-square-garden-election-fraud/680429/?gift=hVZeG3M9DnxL4CekrWGK36Ka554OqzSbHzHo9_Vj1FE&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Harris Aides Hopeful That Casting Trump as a Fascist Could Shift Election  —  While still cautious, advisers and allies believe that casting Donald Trump as a fascist is working, and that their expansive ground game and appeals on abortion rights may carry the day.",
    "url": "https://www.nytimes.com/2024/10/28/us/politics/kamala-harris-donald-trump-2024-election.html"
  },
  {
    "text": "NAACP poll: Trump's support among young Black men decreasing  —  A new NAACP survey found Republican Donald Trump's support among young Black men has dwindled with a little more than a week to go before Election Day.  The poll found Black men under 50 years old decreased their likelihood … ",
    "url": "https://www.politico.com/live-updates/2024/10/28/2024-elections-live-coverage-updates-analysis/aarp-survey-00185978"
  },
  {
    "text": "A new Supreme Court case could change the result of the presidential election  —  Support independent journalism that matters — become a Vox Member.  —  On October 23, the Pennsylvania Supreme Court ruled that many voters who cast a mailed-in ballot improperly, thus rendering their vote … ",
    "url": "https://www.vox.com/scotus/380170/supreme-court-pennsylvania-election-republican-genser"
  },
  {
    "text": "Kamala Harris' VP choice Tim Walz had secret fling with daughter of top Chinese Communist official during teaching stint in China  — Tim Walz had a romance with Jenna Wang, daughter of a CCP official in 1989  — She said her father Bin Hui would disown her for fraternizing with a westerner",
    "url": "https://www.dailymail.co.uk/news/article-14012181/tim-walz-fling-china-communist-daughter-kamala-harris-vp.html"
  },
  {
    "text": "Elon Musk's America PAC uses crude, sexist attack against Harris in new ad  —  Elon Musk's America PAC shared a video calling Kamala Harris “the c-word” on X, the social media platform also owned by the tech billionaire.  The narrator in the 34-second ad repeatedly calls Harris a “c-word” … ",
    "url": "https://www.politico.com/live-updates/2024/10/28/2024-elections-live-coverage-updates-analysis/elon-musk-kamala-harris-ad-00185884"
  },
  {
    "text": "Trump: 'I'm not a Nazi.  I'm the opposite of a Nazi'  —  “I'm not a Nazi.  I'm the opposite of a Nazi,” former President Donald Trump declared at a campaign rally in Atlanta on Monday night — instead placing blame on Democrats for comparing him to one.  He claimed that Harris' campaign painted him as a Nazi.",
    "url": "https://www.politico.com/live-updates/2024/10/28/2024-elections-live-coverage-updates-analysis/trump-not-nazi-atlanta-rally-00185967"
  },
  {
    "text": "Swing state paper publishes blistering takedown of a key component of Trump's agenda  —  Former President Donald Trump's plans would bring about economic ruin and hardship for millions of Americans, wrote Peter Harrell of the Carnegie Endowment for International Peace.",
    "url": "https://www.rawstory.com/trump-tariffs-2669496953/"
  },
  {
    "text": "Anna Kendrick Calls Out Director Who Shamed Her Publicly  —  The actress is now a director herself, having recently premiered her directorial debut with the film “Woman of the Hour.”  —  Jamie Oliver Urges Fans to Help Find $390K of Stolen Cheese  —  ‘VERY POSH CHEESE’",
    "url": "https://www.thedailybeast.com/anna-kendrick-calls-out-director-who-shamed-her-publicly-f-you/"
  },
  {
    "text": "Pluralistic: The US Copyright Office frees the McFlurry (28 Oct 2024)  — The US Copyright Office frees the McFlurry: The only kind of DMCA exemption that makes a difference.  — Hey look at this: Delights to delectate.  — This day in history: 2004, 2009, 2014, 2019, 2023",
    "url": "https://pluralistic.net/2024/10/28/mcbroken/"
  },
  {
    "text": "Nevada Supreme Court rejects GOP mail ballot challenge  —  Nevada's Supreme Court affirmed a lower court decision Monday allowing mail ballots to be counted if they arrive without a postmark up to three days after the Nov. 5 election.  —  A majority of the high court ruled the state law requiring mail … ",
    "url": "https://thehill.com/regulation/court-battles/4957675-nevada-supreme-court-rejects-gop-mail-ballot-challenge/"
  }
]