[
  {
    "text": "Why Kamala Harris chose Tim Walz  —  Harris and Walz didn't know each other but quickly clicked.  —  Kamala Harris loved Tim Walz's governing record in Minnesota.  His biography and record of winning tough races resonated with her.  And most of all, she just really liked him.",
    "url": "https://www.politico.com/news/2024/08/06/why-kamala-harris-chose-tim-walz-00172834"
  },
  {
    "text": "55 Things to Know About Tim Walz, Kamala Harris' Pick for VP  —  The governor of Minnesota had a career in the National Guard and as a high school teacher before he got into politics in the early 2000s.  —  Tim Walz, the governor of Minnesota, once said he never expected … ",
    "url": "https://www.politico.com/news/magazine/2024/08/06/tim-walz-55-things-harris-vp-00172790"
  },
  {
    "text": "Why Tim Walz is the Right Choice for VP  —  The Minnesota Governor is an unconventional pick, but he makes sense on the ticket.  —  ∙ Paid  —  The pick is in — Vice President Kamala Harris has chosen Minnesota Governor Tim Walz as her running mate.  Her pick was a surprise.",
    "url": "https://www.messageboxnews.com/p/why-tim-walz-is-the-right-choice"
  },
  {
    "text": "The Walz Pick and America's Urban-Rural Divide  —  AND THE WINNER of the Democratic veepstakes is . . . Tim Walz, who makes perfect sense.  He's a popular, plainspoken, moderate Midwestern governor, a former teacher, a football coach, a gun owner who hunts pheasant and turkey … ",
    "url": "https://www.thebulwark.com/p/tim-walz-vp-pick-democratic-coalition"
  },
  {
    "text": "WATCH LIVE: Harris holds first rally with Tim Walz after choosing him as running mate  —  The event is scheduled to begin at 5:30 p.m. ET.  Watch in the player above.  —  The two made their first public appearance at a rally in Philadelphia just hours after Harris announced Walz … ",
    "url": "https://www.pbs.org/newshour/politics/watch-live-harris-holds-first-rally-with-minnesota-gov-tim-walz-after-choosing-him-as-running-mate"
  },
  {
    "text": "Poll: Harris jumps to a small national lead over Trump  —  Vice President Harris has upended the presidential race and has now built a 51%-48% lead over former President Trump, according to the latest NPR/PBS News/Marist poll.  —  That result is 4 points better than just after Harris got … ",
    "url": "https://www.npr.org/2024/08/06/g-s1-15701/election-poll-harris-trump"
  },
  {
    "text": "Trump's Campaign Is Drowning in Rage … There was One (very) Angry Man at the Georgia State University Convocation Center last Saturday.  Donald Trump had harsh words for everyone.  He insulted his general election opponent, “Crazy Kamala” Harris, for her “low IQ,” and jeered at President Joe Biden for … ",
    "url": "https://newrepublic.com/article/184569/trumps-campaign-drowning-rage"
  },
  {
    "text": "The 2024 Presidential Contest (August 2024)  —  NPR/PBS News/Marist National Poll  —  Harris Edges Trump in Two-Way and Multi-Candidate Contests  —  In the 2024 presidential contest, Vice President Kamala Harris edges former President Donald Trump by 3 percentage points in a head … ",
    "url": "https://maristpoll.marist.edu/polls/the-2024-presidential-contest-august-2024/"
  },
  {
    "text": "X, Owned by Elon Musk, Brings Antitrust Suit Accusing Advertisers of a Boycott  —  The company claimed that members of the Global Alliance for Responsible Media coordinated to dissuade brands from advertising on X.  —  X on Tuesday filed a lawsuit against the Global Alliance for Responsible Media … ",
    "url": "https://www.nytimes.com/2024/08/06/technology/x-antitrust-suit-advertisers-elon-musk.html"
  },
  {
    "text": "FBI agents execute search warrant on Tennessee Congressman Andy Ogles, NewsChannel 5 confirms  —  NASHVILLE, Tenn. (WTVF) — FBI agents executed a search warrant late last week on Tennessee Congressman Andy Ogles as the first-term Republican faces continuing scrutiny over fraudulent campaign financial reports … ",
    "url": "https://www.newschannel5.com/news/newschannel-5-investigates/revealed/fbi-agents-execute-search-warrant-on-tennessee-congressman-andy-ogles-newschannel-5-confirms"
  },
  {
    "text": "Pakistani national with ties to Iran charged in connection to a foiled assassination plot potentially targeting Trump  —  The Justice Department has charged a Pakistani man who has alleged ties to the Iranian government with seeking to carry out political assassinations … ",
    "url": "https://www.cnn.com/2024/08/06/politics/iran-trump-assassination-charges/"
  },
  {
    "text": "Top U.S. newspapers have hardly covered Trump's antisemitic July 30 interview  —  The interview included multiple antisemitic attacks regarding Jewish voters, Vice President Kamala Harris, and second gentleman Doug Emhoff, but the comments were referenced in just 6 unique articles",
    "url": "https://www.mediamatters.org/antisemitism/top-us-newspapers-have-hardly-covered-trump-agreeing-radio-host-who-called-second"
  },
  {
    "text": "Speaker Johnson: Shapiro was ‘overlooked’ for VP because of Jewish heritage  —  Video Player is loading.  —  Play Video  —  Unmute  —  Current Time 0:00 … Stream Type LIVE  —  Seek to live, currently behind liveLIVE  —  Playback Rate  —  Chapters  — Chapters  —  Descriptions",
    "url": "https://thehill.com/homenews/house/4813622-speaker-johnson-shapiro-overlooked-harris/"
  },
  {
    "text": "Republicans Resurface Tim Walz' 1995 Mugshot as Attacks Heat Up  —  DIGGING UP DIRT  —  The Minnesota governor gave up alcohol after the incident in 1995.  —  Tim Walz' mugshot from a 1995 DUI arrest went viral Tuesday just as Kamala Harris announced the Minnesota governor was joining her presidential ticket.",
    "url": "https://www.thedailybeast.com/tim-walz-old-mugshot-circulates-after-harris-picks-him-for-vp-ticket"
  },
  {
    "text": "Walz Has Faced Criticism for His Response to George Floyd Protests  —  Some believe that Gov. Tim Walz should have deployed the Minnesota National Guard sooner when riots broke out following the police murder of George Floyd.  —  A little more than a year into Tim Walz's first term as governor, he faced his biggest test.",
    "url": "https://www.nytimes.com/2024/08/06/us/tim-walz-george-floyd-criticism.html"
  },
  {
    "text": "Republicans Would Love for Bad Things to Start Happening  —  Plus: The GOP casts about for a Walz narrative … We're now within three months of election day, and as we enter the final stretch, Democrats' anxieties are growing about the possibility of an unexpected catastrophe changing the race in its final leg.",
    "url": "https://www.thebulwark.com/p/republicans-would-love-for-bad-things"
  },
  {
    "text": "Letter: If Biden's age was so concerning, why isn't Trump's age?  —  The landscape of the 2024 presidential election has shifted markedly since President Joe Biden voluntarily stepped aside as the Democratic Party's presumptive nominee last month.  Democrats were appropriately concerned … ",
    "url": "https://www.stltoday.com/opinion/letters/letter-if-bidens-age-was-so-concerning-why-isnt-trumps-age/article_dc029b90-537e-11ef-9339-4bd759e7ba68.html"
  }
]