[
  {
    "text": "Ron DeSantis is refusing to take Harris' call on Hurricane Helene  —  An aide to the Florida governor said that Harris' call “seemed political” and that she “was trying to reach out, and we didn't answer.”  —  Florida Gov. Ron DeSantis is not taking calls from Vice President Kamala Harris … ",
    "url": "https://www.nbcnews.com/politics/kamala-harris/ron-desantis-harris-call-hurricane-helene-political-rcna174276"
  },
  {
    "text": "A Distributional Analysis of Donald Trump's Tax Plan  —  Impact Of Donald Trump's Tax Proposals by Income Group  —  Former President Donald Trump has proposed a wide variety of tax policy changes.  Taken together, these proposals would, on average, lead to a tax cut for the richest 5 percent … ",
    "url": "https://itep.org/a-distributional-analysis-of-donald-trumps-tax-plan-2024/"
  },
  {
    "text": "Trump's Plans Could Increase U.S. Debt While Raising Costs for Most Americans  —  A new analysis estimates that the former president's proposals could grow deficits by as much as $15 trillion over a decade.  —  Former President Donald J. Trump's economic proposals could inflame … ",
    "url": "https://www.nytimes.com/2024/10/07/us/politics/trumps-plans-could-increase-us-debt-while-raising-costs-for-most-americans.html"
  },
  {
    "text": "Lying Is Loyalty in Trump's GOP  —  So how far will his allies go to keep their king happy?  —  Donald Trump, who proved to be deeply dishonest as a candidate in 2016, and as president for four years, is lying with reckless abandon as he tries to return to the White House.",
    "url": "https://www.vanityfair.com/news/story/lying-is-loyalty-in-trumps-gop"
  },
  {
    "text": "MAGA's Hurricane Helene Lies Are A Trial Run For The Election  —  The through-line is sowing chaos and hurting people for personal gain.  —  ∙ Paid  —  When Donald Trump started telling conspicuous lies about the federal response to Hurricane Helene, all of MAGA understood the assignment.",
    "url": "https://www.offmessage.net/p/maga-hurricane-helene-lies-trial-run-election"
  },
  {
    "text": "Supreme Court lets stand a decision barring emergency abortions that violate Texas ban  —  The Supreme Court on Monday let stand a decision barring emergency abortions that violate the law in Texas, which has one of the country's strictest abortion bans.  Without detailing their reasoning … ",
    "url": "https://apnews.com/article/supreme-court-emergency-abortion-texas-bf79fafceba4ab9df9df2489e5d43e72"
  },
  {
    "text": "Saying immigrants bring ‘bad genes’ echoes Trump's history — and the world's  —  With a mishmash of false claims about crime and ridiculous race science, Trump makes explicit the racism at the heart of his politics.  —  Former president Donald Trump has long espoused a worldview in which genes … ",
    "url": "https://www.washingtonpost.com/politics/2024/10/07/trump-finally-just-says-that-some-immigrants-are-genetically-inferior/"
  },
  {
    "text": "‘Call Her Daddy’ Faces Backlash Over ‘Propaganda’ Harris Interview  —  HOODIE'S NICE THOUGH!  —  Some fans of the hugely popular podcast are angry that the vice president did not address the devastation caused by Hurricane Helene.  —  Alex Cooper, host of the Call Her Daddy podcast … ",
    "url": "https://www.thedailybeast.com/alex-coopers-call-her-daddy-podcast-faces-backlash-over-propaganda-harris-interview"
  },
  {
    "text": "What Going on Call Her Daddy Did for Kamala Harris  —  Very few podcasters would apologize to their fans for clogging up their feed by interviewing a presidential candidate.  But Alex Cooper—the host of a podcast variously described as “raunchy, “sex-positive,” “mega-popular,” and … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/10/kamala-harris-call-her-daddy-podcast/680181/?gift=hKlyhOsAqtwHzNWWygN1jkI7qhWUc3cEJDawK2DNwO0&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Hurricane Milton is a Category 5.  Florida orders evacuations and scrambles to clear Helene's debris  —  Florida's storm-battered Gulf Coast raced against a Category 5 hurricane Monday as workers sprinted to pick up heaps of appliances and other street debris left over from Helene two weeks ago … ",
    "url": "https://apnews.com/article/hurricane-milton-helene-florida-557c5c512135e0a8661b298e45e17c92"
  },
  {
    "text": "Melania Trump: Why I'm an Unapologetic Election Denier  —  Donald Trump's wife says she believes the 2020 contest “was not a normal election” and still “questions the results.” … Melania Trump is fully on board with her husband's 2020 election denial, her new memoir reveals.",
    "url": "https://www.thedailybeast.com/melania-trump-why-im-an-unapologetic-election-denier"
  },
  {
    "text": "Ex-Florida Democratic lawmaker backs Trump, citing foreign policy  —  A former Democratic congressman who served six terms in the House said Monday he was endorsing former President Trump, citing his concerns with the Biden administration's handling of global conflicts abroad.",
    "url": "https://thehill.com/homenews/campaign/4920220-ex-florida-democratic-lawmaker-backs-trump-citing-foreign-policy/"
  },
  {
    "text": "Scandal-plagued Deputy Mayor Phil Banks, close Adams friend, resigns  —  Scandal-plagued Deputy Mayor for Public Safety Phil Banks has resigned, succumbing to weeks of pressure amid federal probes that ensnared both him and his longtime friend Mayor Eric Adams, sources told The Post.",
    "url": "https://nypost.com/2024/10/07/us-news/phil-banks-deputy-mayor-and-close-eric-adams-pal-resigns/"
  },
  {
    "text": "‘We already have the receipts.’ Election denier says his group gained access to U.S. banking data  —  Arizona's Mark Finchem says Millersville, Tennessee's assistant police chief, Shawn Taylor, used Treasury Department's FinCen data in work for Finchem's Election Fairness Institute",
    "url": "https://www.newschannel5.com/news/newschannel-5-investigates/qanon-comes-to-main-street/we-already-have-the-receipts-election-denier-says-his-group-gained-access-to-u-s-banking-data"
  },
  {
    "text": "GEICO is Terminating Insurance Coverage of Tesla Cybertrucks, Says “This Type of Vehicle Doesn't Meet Our Underwriting Guidelines”  —  GEICO, the second-largest vehicle insurance underwriter in the US, has decided it will no longer cover Tesla Cybertrucks.  The company is terminating current … ",
    "url": "https://www.torquenews.com/11826/geico-terminating-insurance-coverage-tesla-cybertrucks-says-type-vehicle-doesnt-meet-our"
  },
  {
    "text": "‘Easy money’: Trump backer Elon Musk claims PAC will pay $47 for swing state voter information … Tesla CEO Elon Musk, who is backing Donald Trump in the presidential election, on Sunday touted a $47 referral bonus that the billionaire's political action committee is offering to people … ",
    "url": "https://www.cnbc.com/2024/10/07/elon-musk-pac-election-bonus-gun-rights-petition-referrals.html"
  },
  {
    "text": "Georgia Supreme Court Restores State's 6-Week Abortion Ban  —  The ban will resume while the court considers an appeal to a decision that had briefly allowed greater access to abortions in the state.  —  The Georgia Supreme Court reinstated on Monday a state law that prohibits abortions beyond six weeks … ",
    "url": "https://www.nytimes.com/2024/10/07/us/georgia-supreme-court-abortion-ban.html"
  },
  {
    "text": "Helene's devastation has disrupted voting in battlegrounds  —  Hurricane Helene's devastation has disrupted voting preparation in several states, including the battlegrounds of North Carolina and Georgia.  —  The Category 4 hurricane that ripped through the eastern seaboard … ",
    "url": "https://www.politico.com/news/2024/10/07/hurricane-helene-election-nc-ga-voting-00182602"
  },
  {
    "text": "Trump transition team co-chair warns prospective appointees must prove ‘loyalty’  —  Howard Lutnick, former President Trump's transition team co-chair, said prospective appointees will only be tapped for future roles in a hypothetical Trump administration if they prove “loyalty” to the former president and his policies.",
    "url": "https://thehill.com/homenews/campaign/4919663-howard-lutnick-trump-appointees/"
  },
  {
    "text": "Porn Industry Jumps Into the Presidential Campaign, Targeting Project 2025  —  In seven swing states, the industry's websites will feature ads decrying the conservative policy blueprint's proposed ban on pornography.  —  Just when you thought everyone had already jumped into the 2024 campaign, here come the porn stars.",
    "url": "https://www.nytimes.com/2024/10/07/us/politics/porn-actors-project-2025-ad.html?unlocked_article_code=1.QU4.YoAw.qigGg6SIjHBM&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "As Major Hurricane Approaches Florida, FEMA Faces Severe Staffing Shortage  —  Fewer than 10 percent of the agency's disaster workers are available to respond to Hurricane Milton and other calamities.  —  The Federal Emergency Management Agency is running out of staff to deal … ",
    "url": "https://www.nytimes.com/2024/10/07/climate/hurricane-milton-fema-staff-shortage.html?unlocked_article_code=1.QU4.uhu9.t5doUgPt3Zz8&smid=url-share"
  }
]