[
  {
    "text": "Maurene Comey, daughter of James Comey and prosecutor of Jeffrey Epstein, is fired … In recent weeks, President Donald Trump and Attorney General Pam Bondi have faced a firestorm of criticism over their decision not to release additional files related to Epstein, the disgraced financier … ",
    "url": "https://www.politico.com/news/2025/07/16/maurene-comey-fired-doj-00458921"
  },
  {
    "text": "Loomer delivers searing warning: Epstein could ‘consume’ Trump presidency … The debacle over a new government review of evidence relating to Epstein, the notorious sex offender, has blown up in recent days, causing a schism within Trump's MAGA movement over his administration's approach to the case.",
    "url": "https://www.politico.com/news/2025/07/16/trump-epstein-maga-anger-00456207"
  },
  {
    "text": "Justice Department fires Maurene Comey, prosecutor on Epstein case and daughter of ex-FBI director  —  The Justice Department has fired Maurene Comey, the daughter of former FBI director James Comey and a veteran federal prosecutor who worked on the cases against Sean “Diddy” Combs and Jeffrey Epstein … ",
    "url": "https://apnews.com/article/justice-department-james-comey-maurene-trump-dda5d1f40f08346bd97696ce4791e8ec"
  },
  {
    "text": "Maurene Comey, federal prosecutor in Epstein case, fired from SDNY  —  Maurene Comey, a federal prosecutor in Manhattan and the daughter of former FBI Director James Comey, has been fired from her job in the Southern District of New York, according to people familiar with the situation.",
    "url": "https://cnn.com/2025/07/16/politics/maurene-comey-fired-sdny"
  },
  {
    "text": "Inside Trump's Frantic, Failing Mission to Crush the Epstein ‘MAGA Rebellion’  —  The president and his administration are telling supporters to forget about the convicted sex offender.  It isn't working … By the time it was over, the president had sustained more blowback and political damage … ",
    "url": "https://www.rollingstone.com/politics/politics-features/inside-trump-failing-mission-crush-maga-revolt-epstein-1235387313/"
  },
  {
    "text": "“Um ... What?”  — Elon Musk Criticizes Trump's Epstein Files Hoax Claim  —  Musk: “There was a bedroom in the back of that plane”  —  Elon Musk, who broke with Trump over his deficit busting massive spending bill, continues to boost Epstein files criticism to his over 222 million followers.",
    "url": "https://meidasnews.com/news/um-what-elon-musk-criticizes-trumps-epstein-files-hoax-claim"
  },
  {
    "text": "Jeez, I wonder why Trump won't release the Epstein files  —  SFGATE columnist Drew Magary unpacks what could be the biggest scandal of our time  —  When Donald Trump doesn't want to talk about something, that usually means that we need to talk about it.  That's especially true of the president's … ",
    "url": "https://www.sfgate.com/sf-culture/article/i-wonder-why-trump-wont-release-epstein-files-20772363.php"
  },
  {
    "text": "Trump makes it personal with MAGA over Epstein … But the president's growing irritation with his supporters' Epstein theories and adamance that they're illegitimate is widening the most significant rift yet. … - “By continuing to go to war with the online MAGA class … ",
    "url": "https://www.axios.com/2025/07/16/trump-maga-epstein-fight-weaklings-hoax"
  },
  {
    "text": "Ghislaine Maxwell's family appeals to Trump amid battle over Epstein files  —  Maxwell was sentenced to 20 years in prison for recruiting and grooming teenage girls to be sexually abused by Epstein in 2022.  —  Amid an explosive fight on Capitol Hill over whether the Trump administration … ",
    "url": "https://www.nbcnews.com/news/us-news/ghislaine-maxwells-family-appeals-trump-battle-epstein-files-rcna219067"
  },
  {
    "text": "Trump Has Drafted Letter to Fire Fed Chair and Asked Republicans if He Should  —  The president waved a copy of a draft letter firing Jerome H. Powell at a meeting in the Oval Office with House Republicans.  It remains to be seen whether he follows through with his threat.",
    "url": "https://www.nytimes.com/2025/07/16/us/politics/trump-powell-firing-letter.html?unlocked_article_code=1.W08.6tcF.tU8hUTCR5msK&smid=url-share"
  },
  {
    "text": "Trump, 79, Can't Remember Appointing His Own Fed Chair  —  ‘BIDEN DID THAT!’  —  The president blamed Joe Biden for selecting Jerome Powell as the U.S. Central Bank head when it was in fact him who made the appointment.  —  President Donald Trump was raging against Federal Reserve Chairman Jerome Powell … ",
    "url": "https://www.thedailybeast.com/trump-79-cant-remember-appointing-his-own-fed-chair-jerome-powell/"
  },
  {
    "text": "Hundreds of DOJ alumni warn Senate against Trump's appellate judge nominee  —  More than 900 former U.S. Department of Justice employees on Wednesday warned the Republican-controlled Senate Judiciary Committee against confirming President Donald Trump's nominee Emil Bove to serve as an appellate court judge … ",
    "url": "https://www.reuters.com/legal/government/hundreds-doj-alumni-warn-senate-against-trumps-appellate-judge-nominee-2025-07-16/"
  },
  {
    "text": "Trump says Coca-Cola agreed to use real cane sugar in US drinks: 'It's just better!'  —  WASHINGTON — President Trump was on a sugar high Wednesday, announcing that Coca-Cola would soon include the real sweet stuff in its US-sold beverages.  —  “I have been speaking to Coca-Cola … ",
    "url": "https://nypost.com/2025/07/16/us-news/trump-says-coca-cola-agrees-to-use-real-cane-sugar-in-us-drinks-its-just-better/"
  },
  {
    "text": "Trump says Coca-Cola will use real sugar in its US flagship drink.  The company isn't confirming that  —  Make American Coke Great Again?  President Donald Trump said Wednesday that Coca-Cola has agreed to use real cane sugar in its flagship soft drink in the U.S. at his suggestion — though the company didn't confirm such a move.",
    "url": "https://apnews.com/article/trump-coca-cola-real-sugar-corn-syrup-be3111be856dcffea8c5e004259c37c8"
  },
  {
    "text": "EXCLUSIVE: Memo Reveals D.C. Judges Are Predisposed Against Trump Administration  —  The Trump Administration has been doing its part, but the lower courts remain rabid in their attack on the rule of law.  —  Federal judge James Boasberg advised Chief Justice John Roberts and some two dozen … ",
    "url": "https://thefederalist.com/2025/07/16/exclusive-memo-reveals-d-c-judges-are-predisposed-against-trump-administration/"
  },
  {
    "text": "Senate set to debate cuts to NPR, PBS and foreign aid  —  The Senate voted by a razor-thin margin late Tuesday to advance debate on a package of funding cuts requested by President Trump.  They're aimed at clawing back $1.1 billion previously allocated to the Corporation for Public Broadcasting … ",
    "url": "https://www.npr.org/2025/07/16/nx-s1-5468967/npr-pbs-cuts-senate-recission"
  },
  {
    "text": "RFK Jr. Plots New White House Bid With Alleged Rapist's Help  —  ESTEEMED COMPANY  —  Comedian Russel Brand was on a super PAC call seen as a stepping stone towards Kennedy launching another presidential campaign.  —  Robert F. Kennedy Jr. is fueling speculation that he's eyeing … ",
    "url": "https://www.thedailybeast.com/rfk-jr-plots-new-white-house-bid-with-alleged-rapists-help/"
  },
  {
    "text": "White House Tries to Shake Off Trump's Bizarre Hand Make-Up  —  SHAKE IT OFF  —  Trump was speaking to reporters when a camera zoomed in on the president's hand.  —  The mysterious recurring bruise on the back of Donald Trump's right hand reappeared on Tuesday, prompting a fresh wave of concern over the president's health.",
    "url": "https://www.thedailybeast.com/white-house-explains-after-trumps-hand-pictured-caked-with-makeup/"
  },
  {
    "text": "Crypto standoff drags on  —  Republicans remain locked in a standoff over cryptocurrency policy that has shut down the House floor, with hard-liners demanding that a bipartisan crypto market structure bill be packaged with legislation that would ban a central bank digital currency.",
    "url": "https://www.politico.com/live-updates/2025/07/16/congress/crypto-standoff-drags-on-00458662"
  },
  {
    "text": "Minnesota Senator Tina Smith hospitalized after not feeling well at Capitol  —  Minnesota's Tina Smith kept overnight for observation after Capitol physician's recommendation  —  Democratic Sen. Tina Smith of Minnesota was hospitalized Wednesday after she began feeling unwell while working at the Capitol … ",
    "url": "https://www.foxnews.com/politics/minnesota-senator-tina-smith-hospitalized-after-not-feeling-well-capitol"
  },
  {
    "text": "Jill Biden ‘work husband’ refuses to answer Oversight questions  —  Former first lady Jill Biden's chief of staff refused to answer questions during closed-door testimony before the House Oversight and Government Reform Committee on Wednesday morning.  —  Committee Chair Rep. James Comer … ",
    "url": "https://thehill.com/homenews/house/5404020-anthony-bernal-jill-biden-aide-pleads-fifth/"
  },
  {
    "text": "Andrew Cuomo, conceding his failed primary campaign was flawed, takes to NYC streets  —  Andrew Cuomo is shifting gears and taking personal responsibility for running what he admits was a lackluster campaign in the Democratic mayoral primary, acknowledging that any strategic mistakes ultimately fall on him.",
    "url": "https://www.nydailynews.com/2025/07/16/andrew-cuomo-failed-primary-campaign-flawed-mamdani-adams-nyc-streets/"
  },
  {
    "text": "Trump administration taking new steps to block wind and solar projects, undisclosed memo says … Gregory Wischer, Interior's deputy chief of staff for policy, wrote in the memo that “all decisions, actions, consultations, and other undertakings — including but not limited to the following … ",
    "url": "https://www.politico.com/news/2025/07/16/interior-requires-burgum-sign-off-for-solar-wind-projects-00458999"
  },
  {
    "text": "Shares of gun seller GrabAGun — backed by Donald Trump Jr. — tank after NYSE trading debut … Shares of the online firearms retaile r GrabAGun — whose shareholders and board members include Donald Trump Jr.— tanked on their first day of trading on the New York Stock Exchange following … ",
    "url": "https://www.cnbc.com/2025/07/16/trump-jr-grabagun-stock-gun-merger.html"
  },
  {
    "text": "Contracts Show Millions of Dollars and Diverted Disaster Resources Were Used to Build DeSantis' ‘Alligator Alcatraz’  —  TPM has obtained and analyzed over a dozen contracts and invoices related...",
    "url": "https://talkingpointsmemo.com/news/contracts-desantis-alligator-alcatraz#EmbedCommentsWrapper"
  },
  {
    "text": "Bill would prevent ICE from detaining or deporting U.S. citizens … But reports of citizens of Latino descent being detained — or stopped and asked to prove citizenship — are rippling through Latino communities nationwide.  — Critics say reports of ICE detaining citizens are instances … ",
    "url": "https://www.axios.com/2025/07/16/ice-us-citizens-detention-racial-profiling"
  },
  {
    "text": "Supreme Court justice pauses ruling weakening Voting Rights Act  —  Justice Kavanaugh paused a ruling that bars individuals in some Midwestern states from filing lawsuits claiming that voting laws discriminate on the basis of race.  —  Supreme Court Justice Brett M. Kavanaugh on Wednesday paused … ",
    "url": "https://www.washingtonpost.com/politics/2025/07/16/supreme-court-voting-rights-act/"
  },
  {
    "text": "The secret to Baltimore's extraordinary year  —  This April, Baltimore saw five homicides.  That is the fewest of any month since 1970, when the city began tracking monthly homicide numbers.  In the first six months of the year, homicides were down 22% compared to 2024, and non-fatal shootings were down 19%.",
    "url": "https://popular.info/p/the-secret-to-baltimores-extraordinary"
  },
  {
    "text": "Donald Trump reaps $50bn tariff haul as world ‘chickens out’  —  Only China and Canada have retaliated against US president's tariff war  —  Peter Foster and Amy Borrett in London, Andy Bounds in Brussels and Ilya Gridneff in Ottawa  —  America's trading partners have largely failed … ",
    "url": "https://www.ft.com/content/82e32f7c-47e2-4e96-bb53-a58377e18aa9"
  },
  {
    "text": "Democrats' former chair tries to become the left's Joe Rogan  —  The News  —  COLUMBIA, S.C. - The search for a liberal Joe Rogan has led Democrats to an unlikely candidate: Jaime Harrison, their former party chair.  —  Harrison will launch “At Our Table” on Thursday.",
    "url": "https://www.semafor.com/article/07/16/2025/democrats-former-chair-tries-to-become-the-lefts-joe-rogan"
  },
  {
    "text": "DHS Faces New Pressure Over DNA Taken From Immigrant Children  —  The US government has added the DNA of approximately 133,000 migrant children and teens to a criminal database, which critics say could mean police treat them like suspects “indefinitely.”  —  United States Senator Ron Wyden … ",
    "url": "https://www.wired.com/story/dhs-and-doj-face-new-pressure-over-collecting-childrens-dna/"
  },
  {
    "text": "Trump officials halt ‘dangerous’ research, overriding NIH career scientists  —  The Trump administration's actions on NIH gain-of-function research have raised concerns among scientists, who argue the move could block experiments that are safe and potentially lead to new treatments and medicines.",
    "url": "https://www.washingtonpost.com/science/2025/07/16/nih-research-viruses-trump-administration/"
  }
]