[
  {
    "text": "Harris campaign: The Iowa poll is exciting, but...  Democrats were giddy Saturday when a gold-standard poll found Kamala Harris narrowly leading Donald Trump in deep-red Iowa.  But Harris' senior campaign officials are cautioning against getting too excited about the Des Moines Register survey.",
    "url": "https://www.politico.com/live-updates/2024/11/03/2024-elections-live-coverage-updates-analysis/kamala-harris-iowa-poll-reaction-00187008"
  },
  {
    "text": "Male Pollsters Shocked — Shocked!!  — When a Woman Pollster Discovers Women Voters  —  On Friday, Nate Silver tweeted and substacked a piece declaring that there must be herding going on in the casino.  —  His substack analysis didn't acknowledge, however, that this herding was going on in his casino.",
    "url": "https://www.emptywheel.net/2024/11/03/male-pollsters-shocked-shocked-when-a-woman-pollster-discovers-women-voters/"
  },
  {
    "text": "Kamala Harris' new lead in top Iowa poll could bode well for her in some key swing states  — A new Des Moines Register/Mediacom Iowa poll shows Harris leading Trump by 3 points in the state.  — It's a significant shift in a conservative-leaning state that Trump won by eight points in 2020.",
    "url": "https://www.businessinsider.com/harris-trump-iowa-polling-lead-swing-states-2024-11"
  },
  {
    "text": "Major pollster drops final battleground poll numbers  —  Harris hold slim leads in four of the seven main battleground states  —  The final New York Times/Siena College Battleground poll of the 2024 race shows a razor-tight election in the battleground states just days before the election.",
    "url": "https://www.foxnews.com/politics/major-pollster-drops-final-battleground-poll-numbers"
  },
  {
    "text": "Trump Boasts ‘Every Rally Is Full’ as Camera Immediately Pans to Empty Seats, People Leaving  —  The former president falsely claimed his rallies “do not have any seats that are empty”  —  A savvy camera operator fact checked Donald Trump live.  —  During his rally in Greensboro … ",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-rally-full-empty-seats-1235151596/"
  },
  {
    "text": "Trump talks about reporters being shot and says he shouldn't have left White House after 2020 loss  —  Donald Trump gave a profane and conspiracy-laden speech two days before the presidential election, talking about reporters being shot and suggesting he “shouldn't have left” the White House after his 2020 loss to Democrat Joe Biden.",
    "url": "https://apnews.com/article/donald-trump-kamala-harris-presidential-election-a310fbc211ad8f0f5e290547ec284187"
  },
  {
    "text": "Trump says he doesn't mind someone shooting at journalists at rally  —  Trump's latest comments were an escalation of violent language he and his supporters have used in recent days.  —  Trump says he 'doesn't mind much' if press is shot at  —  LITITZ, Pa. — Donald Trump told a crowd … ",
    "url": "https://www.washingtonpost.com/elections/2024/11/03/trump-rally-media-shooting/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzMwNjA2NDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzMxOTkyMzk5LCJpYXQiOjE3MzA2MDY0MDAsImp0aSI6IjM4ZDkxYTkyLTQwNjEtNDBmMC05Mzc4LTgxZTFlY2ViNDdjOSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9lbGVjdGlvbnMvMjAyNC8xMS8wMy90cnVtcC1yYWxseS1tZWRpYS1zaG9vdGluZy8ifQ.u0AgLzo6btS1kp8GmlD4N0JpRfGuYPw5mRLJ3Pahtuw&itid=gfta"
  },
  {
    "text": "Canvassers for Elon Musk's America PAC Were Fired and Stranded in Michigan After Speaking Out  —  A dozen Black canvassers were tricked, threatened, and driven in seatless U-Haul vans.  They were fired after WIRED reported on their plight—some without full pay or a way back home.",
    "url": "https://www.wired.com/story/canvassers-elon-musk-america-pac-fired-stranded-michigan-mistreatment/"
  },
  {
    "text": "Apology Not Accepted  —  I woke up yesterday morning to learn that Don Trump—the famed rapist, convicted felon, and white christian presidential candidate—had mimed performing a blowjob on his microphone stand to the clear delight of his crowd.  —  There's a famous Christian thinker named Jesus H. Christ … ",
    "url": "https://www.the-reframe.com/apology-not-accepted/"
  },
  {
    "text": "Trump says ‘Fox News is not our friend,’ claims it's airing ‘Democrat ads’  —  Former President Trump on Sunday took aim at Fox News for airing what the GOP presidential nominee sees as too much coverage devoted to the Democrats, just a few days before the election.",
    "url": "https://thehill.com/media/4968450-trump-fox-news-not-our-friend-claiming-its-airing-democrat-ads/"
  },
  {
    "text": "Trump doesn't rule out banning vaccines if he becomes president: 'I'll make a decision'  —  In an interview with NBC News, the former president also said that a push by RFK Jr. to remove fluoride in water “sounds OK to me.”  —  Former President Donald Trump said that Robert F. Kennedy Jr. would have a … ",
    "url": "https://www.nbcnews.com/politics/2024-election/trump-banning-vaccines-president-rfk-fluoride-rcna178570"
  },
  {
    "text": "GOP candidate Tim Sheehy says medical records don't exist for gunshot wound  —  In May, the candidate said it was “insulting and ridiculous” that he would be asked to provide them.  —  Tim Sheehy, the Montana Republican nominee for Senate, said in an interview with former Fox News host Megyn Kelly … ",
    "url": "https://www.washingtonpost.com/politics/2024/11/03/gop-candidate-tim-sheehy-says-medical-records-dont-exist-gunshot-wound/"
  },
  {
    "text": "Ann Selzer: How Could This Be?  —  Few states are as red as Iowa, and yet the legendary Iowa pollster Ann Selzer found that Kamala has leapfrogged over Trump to take the lead there.  The turnaround is due to women—particularly women 65 and older, who previously tilted toward Trump, but now favor Kamala 63% to 28%.",
    "url": "https://www.thebulwark.com/p/ann-selzer-how-could-this-be"
  },
  {
    "text": "CNN Exclusive: Bill Clinton has hopes and fears on what comes after 2024 - for the country, the party and himself  —  Michigan's West Coast CNN  —  Rumbling down the road between small towns in western Michigan, Bill Clinton was considering mortality - potentially American democracy's or the Democratic Party's, but also his own.",
    "url": "https://www.cnn.com/2024/11/03/politics/bill-clinton-cnn-interview/"
  },
  {
    "text": "Cruz on McConnell's replacement: I want a ‘leader who changes how the Senate operates’  —  Sen. Ted Cruz (R-Texas) said he hopes whoever replaces Senate Minority Leader Mitch McConnell (R-Ky.) atop the Senate GOP is someone who will change “how the Senate operates.”",
    "url": "https://thehill.com/homenews/senate/4968838-cruz-mcconnell-replacement-leader-who-changes-how-senate-operates/"
  },
  {
    "text": "Why business leaders are worried about JD Vance  —  They've watched the party move away from them under Donald Trump.  They're worried his chosen successor could accelerate the shift.  —  Business leaders watched with growing frustration as Donald Trump pushed the Republican Party toward … ",
    "url": "https://www.politico.com/news/2024/11/03/business-leaders-jd-vance-republican-populism-00186981"
  },
  {
    "text": "FCC commissioner claims Harris on ‘SNL’ violates ‘equal time’ rule  —  A Federal Communications Commission (FCC) commissioner has claimed that Vice President Harris's recent appearance on “Saturday Night Live” violates the “equal time” rule.  —  “This is a clear and blatant effort to evade … ",
    "url": "https://thehill.com/homenews/4968217-fcc-commissioner-claims-harris-on-snl-violates-equal-time-rule/"
  },
  {
    "text": "2024's biggest gaffe?  GOP telling the truth about what it will do to America.  —  The most wildly misunderstood yet commonly used word in American politics is “gaffe.”  The dictionary defines it as “an unintentional act or remark causing embarrassment to its originator; a blunder” — and that's not wrong.",
    "url": "https://www.inquirer.com/opinion/commentary/gop-agenda-repeal-obamacare-chips-act-20241103.html"
  }
]