[
  {
    "text": "Van Hollen: ‘I am not defending the man, I am defending the rights of this man to due process’  —  Senator says the Abrego Garcia case is about upholding the rule of law.  —  Sen. Chris Van Hollen speaks with ABC News while appearing on ‘This Week’ April 20, 2025.",
    "url": "https://abcnews.go.com/Politics/van-hollen-defending-man-defending-rights-man-due/story?id=120978764"
  },
  {
    "text": "Sen. Chris Van Hollen says America is in a ‘constitutional crisis’ as Trump disregards court orders in the Abrego Garcia case  —  The Maryland senator told “Meet the Press” that the Trump administration needs to litigate the case in courtrooms rather than social media posts.",
    "url": "https://www.nbcnews.com/politics/trump-administration/chris-van-hollen-america-constitutional-crisis-trump-abrego-garcia-rcna202018"
  },
  {
    "text": "Trump Administration Draft Order Calls for Drastic Overhaul of State Department  —  The draft executive order to be signed by President Trump would eliminate Africa operations and shut down bureaus working on democracy, human rights and refugee issues.  —  A draft White House executive order proposes … ",
    "url": "https://www.nytimes.com/2025/04/20/us/politics/trump-state-department-overhaul.html?unlocked_article_code=1.BE8.QhVd.gY0YDBy3y33U"
  },
  {
    "text": "Pope Francis meets with US Vice President JD Vance at Santa Marta  —  The brief meeting of Pope Francis with US Vice President JD Vance offered the opportunity to exchange Easter greetings.  Yesterday Cardinal Parolin met with the US leader at the Secretariat of State.",
    "url": "https://www.vaticannews.va/en/pope/news/2025-04/pope-francis-meets-us-vice-president-jd-vance-at-santa-marta.html"
  },
  {
    "text": "Vance meets Pope Francis on Easter Sunday after tangle over migration, gets chocolate eggs for kids  —  U.S. Vice President JD Vance met briefly with Pope Francis on Sunday to exchange Easter greetings, after they got into a long-distance tangle over the Trump administration's migrant deportation plans.",
    "url": "https://apnews.com/article/pope-vance-us-migration-c9fc577cabff138de7bd8026133994fc"
  },
  {
    "text": "As legal fight raged, ICE buses filled with Venezuelans heading toward airport turned around, video shows  —  At least 28 detainees were placed on buses Friday evening at ICE's Bluebonnet Detention Center in Anson, Texas, and then driven toward an airport about an hour away.",
    "url": "https://www.nbcnews.com/politics/immigration/legal-fight-raged-ice-buses-filled-venezuelans-heading-airport-turned-rcna202007"
  },
  {
    "text": "Immigrants forced to sleep on floors at overwhelmed ICE detention centers  —  Conditions are deteriorating as many detention centers approach capacity and the Trump administration closes two agencies overseeing health and safety at the facilities.  —  At a crowded Miami detention center … ",
    "url": "https://www.washingtonpost.com/business/2025/04/18/immigrant-detention-overcrowding-trump-crackdown/"
  },
  {
    "text": "U.S. citizen in Arizona detained by immigration officials for 10 days  —  IMMIGRATION OFFICIALS IN TUCSON ARRESTED THE 19-YEAR-OLD MAN FROM ALBUQUERQUE ON APRIL 8, SAYING HE HAD ENTERED THE COUNTRY ILLEGALLY, BEFORE A JUDGE DISMISSED HIS CASE ON APRIL 17.  —  19-year-old Jose Hermosillo … ",
    "url": "https://news.azpm.org/p/news-articles/2025/4/18/224512-us-citizen-in-arizona-detained-by-immigration-officials-for-10-days/"
  },
  {
    "text": "Zeldin says he can ‘absolutely’ assure public EPA deregulation efforts won't harm environment  —  Environmental Protection Agency (EPA) Administrator Lee Zeldin said he can “absolutely” assure the public that the various deregulation efforts undergone by the agency will not harm the environment.",
    "url": "https://thehill.com/policy/energy-environment/5257850-zeldin-public-epa-deregulations-wont-harm-environment/"
  },
  {
    "text": "Boeing begins flying back planes refused by Chinese airlines  —  Beijing orders carriers to stop taking deliveries of US jets as part of its trade war strategy  —  The US plane manufacturer Boeing has begun flying 737 Max jets that were refused by Chinese airline customers back to the United States … ",
    "url": "https://www.bangkokpost.com/business/general/3006447/boeing-begins-flying-back-planes-refused-by-chinese-airlines"
  },
  {
    "text": "GOP senator says Trump shouldn't send Americans to foreign prisons: ‘We have our own laws’  —  Sen. John Kennedy (R-La.) said on Sunday he does not think the law would allow President Trump to send United States citizens convicted of violent crimes to Salvadoran prisons … ",
    "url": "https://thehill.com/homenews/senate/5257772-gop-senator-trump-shouldnt-send-americans-to-foreign-prisons/"
  },
  {
    "text": "Kash Patel Embraces the Limelight, Unlike Recent F.B.I. Directors  —  Kash Patel's embrace of the spotlight appears to be a break from the recent past, as his predecessors typically did the job with little fanfare.  —  Kash Patel flew to Miami on Air Force One last weekend to watch … ",
    "url": "https://www.nytimes.com/2025/04/20/us/politics/kash-patel-spotlight-fbi-director.html"
  },
  {
    "text": "Zuckerberg, Dimon Are Among Top Sellers Ahead of Tariff Stock Rout  —  Billionaire Oracle CEO also unloaded shares in first quarter before markets tumbled.  —  Insiders including Meta Platforms Inc.'s Mark Zuckerberg, Oracle Corp.'s Safra Catz and JPMorgan Chase & Co.'s Jamie Dimon cashed … ",
    "url": "https://www.bloomberg.com/news/articles/2025-04-20/zuckerberg-dimon-are-among-top-sellers-ahead-of-tariff-stock-rout"
  },
  {
    "text": "Tomatoes Become One of the First Everyday Casualties of Trade War  —  New fees will hit fresh tomato imports from Mexico starting in July unless a new agreement is reached  —  WASHINGTON—President Trump dialed back his trade war—but not on tomatoes.  —  Starting in July … ",
    "url": "https://www.wsj.com/economy/tomato-prices-trump-tariffs-trade-war-5ef5ad47"
  },
  {
    "text": "The America I loved is gone  —  It was a nation of dreams, built for the screen.  Then it shattered  —  The first impression America gave me was gentle carelessness.  We were driving down from Canada to visit family friends in Texas sometime in the mid- to late 1980s … ",
    "url": "https://www.theguardian.com/us-news/ng-interactive/2025/apr/20/american-dream-trump-canada"
  },
  {
    "text": "This Midwestern city has long been a federal hub.  The pain from DOGE's cuts is everywhere  —  In her 28 years working for the federal government, Shea Giagnorio provided day care for the children of U.S. soldiers, training for employees and oversight for safety net programs.",
    "url": "https://apnews.com/article/doge-federal-cuts-job-musk-trump-kansas-city-06023cbc68c82fdaa021ced1069fd81c"
  },
  {
    "text": "Democrats face growing calls for generational change  —  Calls for generational change among Democrats are growing louder as the party seeks to chart a path forward going into the 2026 midterms.  —  On Wednesday, Democratic National Committee (DNC) Chair David Hogg's group Leaders … ",
    "url": "https://thehill.com/homenews/campaign/5256401-democrats-call-for-generational-change/"
  },
  {
    "text": "Trump's Tariffs Won't Even Let You Drink Your Way Through these Tough Times  —  One evening last week I came home and mixed myself a cocktail.  That night it was a riff on a martini.  I started with a bottle of Botanist gin, which is distilled in Scotland with a broad range of local botanicals like apple mint, birch leaf, and heather.",
    "url": "https://www.theunpopulist.net/p/trumps-tariffs-wont-even-let-you"
  },
  {
    "text": "Read Justice Alito's Dissent  —  Justice Samuel A. Alito Jr. wrote that the Supreme Court's decision to block the Trump administration from deporting Venezuelan migrants under a wartime law was premature. … See more on: Samuel A. Alito Jr., U.S. Supreme Court  —  Our Coverage of the Supreme Court",
    "url": "https://www.nytimes.com/interactive/2025/04/20/us/politics/24a1007-dissent.html"
  }
]