[
  {
    "text": "Behind the Scenes at the Dismantling of Roe v. Wade  —  On Feb. 10 last year, Justice Samuel A. Alito Jr. showed his eight colleagues how he intended to uproot the constitutional right to abortion.  —  At 11:16 a.m., his clerk circulated a 98-page draft opinion in Dobbs v. Jackson Women's Health Organization.",
    "url": "https://www.nytimes.com/2023/12/15/us/supreme-court-dobbs-roe-abortion.html"
  },
  {
    "text": "Why Bob Vander Plaats thinks some evangelicals can't quit Trump  —  Good morning, Early Birds.  We're running out of shelves on which to hide our elves.  Please send suggestions (and, more importantly, newsworthy tips) to earlytips@washpost.com.  Was this forwarded to you?  Sign up here.",
    "url": "https://www.washingtonpost.com/politics/2023/12/15/why-bob-vander-plaats-thinks-some-evangelicals-cant-quit-trump/"
  },
  {
    "text": "The mystery of the missing binder: How a collection of raw Russian intelligence disappeared under Trump  —  A binder containing highly classified information related to Russian election interference went missing at the end of Donald Trump's presidency, raising alarms among intelligence officials … ",
    "url": "https://www.cnn.com/interactive/2023/12/politics/missing-russia-intelligence-trump-dg/"
  },
  {
    "text": "Playbook: The fascinating race to replace George Santos  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  TALK OF THIS TOWN — DONALD TRUMP is accused of swiping National Archives property.  But MELANIA TRUMP is set to star today in a killer photo op at the Archives: A naturalization ceremony.",
    "url": "https://www.politico.com/newsletters/playbook/2023/12/15/the-fascinating-race-to-replace-george-santos-00131970"
  },
  {
    "text": "Urgent Need to Increase Immunization Coverage for Influenza, COVID-19, and RSV and Use of Authorized/Approved Therapeutics in the Setting of Increased Respiratory Disease Activity During the 2023 - 2024 Winter Season  —  Distributed via the CDC Health Alert Network",
    "url": "https://emergency.cdc.gov/han/2023/han00503.asp"
  },
  {
    "text": "Ex-FBI official sentenced for assisting “Putin's henchman”  —  A former FBI special agent in charge of counterintelligence at the bureau's New York Field Office was sentenced to 50 months in prison on Thursday in connection to working with a sanctioned Russian oligarch.",
    "url": "https://www.axios.com/2023/12/15/fbi-official-charles-mcgonigal-russian-oligarch-sentenced"
  },
  {
    "text": "Michigan appeals court rules Trump can stay on 2024 primary ballot  —  The Michigan Court of Appeals decided Thursday that former President Trump can remain on the state's 2024 Republican primary ballot, blocking a series of challenges to his candidacy related to the Jan. 6, 2021, Capitol attack.",
    "url": "https://thehill.com/regulation/court-battles/4361894-michigan-court-trump-2024-primary/"
  },
  {
    "text": "Hamas plot to attack Jews across Europe is foiled by police  —  Seven arrests made during raids in Germany, Denmark and the Netherlands as fears grow that Middle East war is increasing global threat  —  A Hamas plot to kill Jews in Europe was foiled by German and Danish police who uncovered … ",
    "url": "https://www.telegraph.co.uk/world-news/2023/12/14/hamas-plot-attack-jewish-sites-europe-foiled-police/"
  },
  {
    "text": "Cornel West thinks Biden won't make it to the general election  —  The independent candidate rejected the idea he could be a “spoiler” for Biden in an exclusive meeting with POLITICO.  —  Cornel West doesn't think Joe Biden will make it to the general election.",
    "url": "https://www.politico.com/news/2023/12/15/cornel-west-biden-election-00131944"
  },
  {
    "text": "Republicans struggle as they keep getting forced to talk about abortion  —  The contrast between GOP candidates' maneuvering toward the middle and real-world events that remind the public of the party's most aggressively anti-abortion faction shows how vexing the issue remains for the party.",
    "url": "https://www.politico.com/news/2023/12/15/republicans-abortion-kate-cox-00131921"
  },
  {
    "text": "Rudy Giuliani Labels ‘Daily Show’ Guest Host a ‘Slob’ After Roast  —  The former New York City mayor was not impressed with a segment aired on “The Daily Show” this week.  —  As a Washington, D.C. jury decides if he'll pay $43 million to a pair of Georgia poll workers he defamed … ",
    "url": "https://www.thedailybeast.com/rudy-giuliani-labels-daily-show-guest-host-kal-penn-a-slob-after-roast"
  },
  {
    "text": "What Trump has already taken from us  —  Democracy is a culture — and Trump is destroying it.  —  In the long arc of human history, the modern democratic era is a mere blip.  —  Humans first began residing in city-like agricultural settlements about 10,000 years ago.",
    "url": "https://www.vox.com/2023/12/15/23990986/trump-2024-democracy-consolidated-culture-campaign"
  },
  {
    "text": "In court, Michigan Republicans tie false elector effort to Donald Trump's campaign  —  Lansing — Testifying in court Thursday, top Michigan Republicans linked the organization and execution of a false certificate saying Donald Trump won the state's 2020 presidential election directly to Trump's campaign.",
    "url": "https://www.detroitnews.com/story/news/politics/2023/12/14/michigan-republican-party-chairwoman-laura-cox-testifies-false-donald-trump-electors-court-hearing/71912637007/"
  },
  {
    "text": "Rep. Elise Stefanik files complaint against judge who has ruled in Jan. 6 and Trump cases  —  The New York Republican and staunch Trump ally is asking for an ethics investigation, arguing the judge has engaged in “highly inappropriate political speech.”  —  WASHINGTON — Rep. Elise Stefanik … ",
    "url": "https://www.nbcnews.com/politics/congress/elise-stefanik-files-complaint-judge-ruled-jan-6-trump-cases-rcna129878"
  },
  {
    "text": "EXCLUSIVE: Apology letters surface in Fulton Trump case  —  Statements from Powell, Chesebro are just one sentence long  —  The apology letters written by two of the attorneys who struck plea agreements in the Fulton County election interference case are just one sentence long and hand-written on lined notebook paper.",
    "url": "https://www.ajc.com/politics/exclusive-apology-letters-surface-in-fulton-trump-case/O6YKFRXE6JAS7FX724K36FGZQE/"
  },
  {
    "text": "Jack Smith is still scrutinizing John Eastman  —  Eastman, a former top Trump attorney, is facing the loss of his law license in California — and the special counsel's office appears to be interested in materials from that case.  —  Federal prosecutors don't appear to be done with John Eastman just yet.",
    "url": "https://www.politico.com/news/2023/12/14/jack-smith-john-eastman-trump-records-00131823"
  },
  {
    "text": "Congress approves bill barring any president from unilaterally withdrawing from NATO  —  Congress has approved legislation that would prevent any president from withdrawing the United States from the North Atlantic Treaty Organization (NATO) without approval from the Senate or an Act of Congress.",
    "url": "https://thehill.com/homenews/4360407-congress-approves-bill-barring-president-withdrawing-nato/"
  },
  {
    "text": "Hungary Blocks Ukraine Aid After E.U. Opens Door to Membership  —  President Volodymyr Zelensky of Ukraine welcomed the breakthrough in Ukraine's official opening of accession negotiations to join the bloc.  Securing more financial aid will have to wait.  —  Hungary on Friday blocked … ",
    "url": "https://www.nytimes.com/2023/12/14/world/europe/eu-ukraine-hungary-aid.html"
  },
  {
    "text": "Virginia court revives lawsuit by teacher fired for refusing to use trans student's pronouns  —  The former teacher, who was fired from West Point High School in 2018, said he could not use the student's pronouns because of his religious beliefs.  —  RICHMOND, Va. — A lawsuit filed … ",
    "url": "https://www.nbcnews.com/nbc-out/out-news/virginia-court-revives-lawsuit-teacher-fired-refusing-use-trans-studen-rcna129866"
  },
  {
    "text": "85-Year Old D.C. Man Charged With Killing His 81-Year-Old Wife  —  For Immediate Release  —  U.S. Attorney's Office, District of Columbia  —  Defendant Did Not Want to Eat the Pancakes She Made and Stabbed Her in the Back.  —  WASHINGTON - Steven Schwartz, 85, of Washington, D.C. … ",
    "url": "https://www.justice.gov/usao-dc/pr/85-year-old-dc-man-charged-killing-his-81-year-old-wife"
  },
  {
    "text": "New York Republicans choose ex-Israel Defense Forces soldier as nominee to replace George Santos  —  County party leaders selected the Nassau County legislator to be the GOP nominee in February's special election.  —  New York Republicans have selected Nassau County legislator Mazi Melesa Pilip … ",
    "url": "https://www.nbcnews.com/politics/2024-election/new-york-republicans-choose-mazi-melesa-pilip-house-nominee-replace-ge-rcna129426?taid=657b4ffaa7e88e0001afe63c"
  }
]