[
  {
    "text": "Biden's reset moment … Officials close to him, needing a repeat triumph, will spend hours on everything from the text to his physical preparation to exploit the prime-time moment.  — “Everyone around him is well aware — well aware — of the need to jack this campaign up,” a source close to Biden said.",
    "url": "https://www.axios.com/2024/02/19/biden-trump-age-state-union-election"
  },
  {
    "text": "Biden campaign touts $42M raised in January  —  The Democratic president and DNC ended January with $130 million cash on hand.  —  President Joe Biden's political operation said it raised $42 million in January, continuing to amass cash as he gears up for a likely rematch with former President Donald Trump.",
    "url": "https://www.politico.com/news/2024/02/20/biden-campaign-fundraising-00142130"
  },
  {
    "text": "Democrats weaponized justice system to punish Trump in business case  —  Oscar Wilde wrote “moderation is a fatal thing.  Nothing succeeds like excess.”  Judge Arthur Engoron took that line to heart with his absurd imposition of $455 million in fines and interest against Donald Trump and his corporation.",
    "url": "https://nypost.com/2024/02/19/opinion/democrats-weaponized-justice-system-to-punish-trump-in-business-case/"
  },
  {
    "text": "Measles erupts in Florida school where 11% of kids are unvaccinated  —  Over 100 children at the school are susceptible to virus.  —  Florida health officials on Sunday announced an investigation into a cluster of measles cases at an elementary school in the Fort Lauderdale area with a low vaccination rate … ",
    "url": "https://arstechnica.com/science/2024/02/measles-erupts-in-florida-school-where-11-of-kids-are-unvaccinated/"
  },
  {
    "text": "Oops!  DeSantis says book challenges have gone too far  —  In an extraordinary press conference last week, Florida Governor Ron DeSantis (R) acknowledged that challenges to books in the state's school libraries are out of control.  Over the course of the event, DeSantis blamed teachers … ",
    "url": "https://popular.info/p/oops-desantis-says-book-challenges"
  },
  {
    "text": "US proposes a ‘temporary ceasefire’ in Gaza in draft UN resolution  —  New York CNN  —  The United States has proposed a United Nations Security Council draft resolution on Gaza calling for a temporary ceasefire in Israel's war against Hamas and warning against an Israeli ground incursion into Rafah … ",
    "url": "https://www.cnn.com/2024/02/19/politics/us-un-security-council-temporary-ceasefire-draft-intl/"
  },
  {
    "text": "Trump allies prepare to infuse ‘Christian nationalism’ in second administration  —  Spearheading the effort is Russell Vought, president of The Center for Renewing America, part of a conservative consortium preparing for Trump's return to power.  —  Russell Vought is president of The Center … ",
    "url": "https://www.politico.com/news/2024/02/20/donald-trump-allies-christian-nationalism-00142086"
  },
  {
    "text": "Trump's RNC Takeover Is on the Brink of Becoming a ‘Purge’  —  From top to bottom, the national GOP organization could soon be rid of anyone seen as insufficiently MAGA.  —  First came the internal grumbling about Ronna McDaniel, the chairwoman of the Republican National Committee.",
    "url": "https://www.thedailybeast.com/trumps-rnc-takeover-is-on-the-brink-of-becoming-a-purge"
  },
  {
    "text": "Wisconsin governor signs new state legislative maps into law, ending a GOP gerrymander  —  The new lines will all but certainly loosen Republicans' grip on power in the swing state's government after more than a decade of dominance.  —  Wisconsin Democratic Gov. Tony Evers on Monday signed … ",
    "url": "https://www.nbcnews.com/politics/elections/wisconsin-new-state-legislative-maps-rcna139477"
  },
  {
    "text": "John Oliver Offers Supreme Court Justice Clarence Thomas $1 Million a Year to Resign  —  John Oliver made Justice Clarence Thomas an offer too good to refuse, but he has 30 days to take a cool million a year — plus a sweet bus — or it goes away.  —  Oliver made the stunning offer at the end … ",
    "url": "https://www.mediaite.com/tv/john-oliver-offers-supreme-court-justice-clarence-thomas-1-million-a-year-to-resign/"
  },
  {
    "text": "Pelosi: Trump comments on Navalny's death ‘beneath the dignity of a human being’  —  Former Speaker Nancy Pelosi (D-Calif.) went after former President Trump on Monday for his response to the death of Russian opposition leader Alexei Navalny, calling Trump's comments “'beneath the dignity of a human being.”",
    "url": "https://thehill.com/homenews/campaign/4477550-pelosi-trump-comments-on-navalnys-death-beneath-the-dignity-of-a-human-being/"
  },
  {
    "text": "Trump musical about ex-wives, Stormy Daniels debuts in New York  —  A parody musical centered on former President Trump and some of the well-known women in his life is hitting the off-Broadway stage in New York City this month.  —  The musical, titled “Five: The Parody Musical,” … ",
    "url": "https://thehill.com/blogs/in-the-know/4477302-trump-musical-five-ex-wives-stormy-daniels-ivanka-melania-debuts-new-york/"
  },
  {
    "text": "Frozen embryos are children, Ala. high court says in unprecedented ruling  —  The Alabama Supreme Court ruled Friday that frozen embryos are people and someone can be held liable for destroying them, a decision that reproductive rights advocates say could imperil in vitro fertilization (IVF) … ",
    "url": "https://www.washingtonpost.com/politics/2024/02/19/alabama-supreme-court-embryos-children-ivf/"
  },
  {
    "text": "Read: Historians rank Trump as worst president … - Lincoln.  — F.D. Roosevelt.  — Washington.  — T. Roosevelt.  — Jefferson.  — Truman.  — Obama.  — Eisenhower.  — L.B. Johnson.  — Kennedy.",
    "url": "https://www.axios.com/2024/02/19/presidents-survey-trump-ranks-last-biden-14th"
  },
  {
    "text": "Trump's Final Hours in Office Were Consumed With Fury at Snoop Dogg  —  Trump's rage at Snoop Dogg created “chaos” in his administration's last moments — and nearly killed clemency for Harry-O … The source of the then-outgoing president's anger had nothing to do with his failed attempts … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trumps-snoop-dogg-pardon-final-hours-president-1234969914/"
  },
  {
    "text": "Sunak Pitches for Rural Votes With Funding Promise to UK Farmers  — Prime minister tells farmers government is ‘by their side’  — First premier to attend NFU conference since Brown in 2008  —  Rishi Sunak told British farmers he is “by their side” as the UK prime minister tries … ",
    "url": "https://www.bloomberg.com/news/articles/2024-02-20/sunak-pitches-for-rural-votes-with-funding-promise-to-uk-farmers"
  },
  {
    "text": "The 17th-Century Heretic We Could Really Use Now  —  The Enlightenment philosopher Baruch Spinoza almost died for his ideals one day in 1672.  —  Spinoza, a Sephardic Jew born in Amsterdam in 1632, was a passionate and outspoken defender of freedom, tolerance and moderation.",
    "url": "https://www.nytimes.com/2024/02/20/opinion/baruch-spinoza-free-thought.html"
  }
]