[
  {
    "text": "Speaker Mike Johnson unveils funding bill one week before potential shutdown  —  The stopgap measure would keep the government funded through Sept. 30.  But Democratic leaders are opposed, and it's unclear if Johnson can pass it with only Republicans.  —  WASHINGTON — House Speaker Mike Johnson … ",
    "url": "https://www.nbcnews.com/politics/congress/speaker-mike-johnson-unveils-funding-bill-one-week-potential-shutdown-rcna195421"
  },
  {
    "text": "Republican Infighting Stalls Trump's ‘Big, Beautiful’ Tax Bill  —  Disagreements on spending cuts, the process and the debt limit combine to slow House-Senate agreement  —  WASHINGTON—President Trump's tax-cut plans are grinding through Congress in slow motion.  The tax cuts themselves aren't really the reason why.",
    "url": "https://www.wsj.com/politics/policy/trump-tax-bill-cuts-senate-roadblocks-c6a150fd"
  },
  {
    "text": "Fox News Suddenly Starts Panicking About Trump's Economy: “Weakening!”  —  Fox News figures are willing to propagandize on President Trump's behalf on pretty much every horror that he throws our way.  Do Fox personalities back Trump when he sells out our allies in tandem with murderous tyrant Vladimir Putin?",
    "url": "https://newrepublic.com/article/192505/fox-news-panicking-trump-economy"
  },
  {
    "text": "US Intelligence Ban Leads to Heavy Ukrainian Losses  —  The decision by the United States to suspend military intelligence sharing with Ukraine has contributed to significant battlefield losses, with Russian forces advancing along key frontlines.  —  Reports indicate that the halt … ",
    "url": "https://eutoday.net/us-intelligence-ban-leads-to-heavy-ukrainian-losses/"
  },
  {
    "text": "Putin Won  —  The Russian dictator has bent the world, including the United States, to his vision.  —  Historians like to play a parlor game called periodization, in which they attempt to define an era, often by identifying it with the individual who most shaped the times: the Age of Jackson, the Age of Reagan.",
    "url": "https://www.theatlantic.com/ideas/archive/2025/03/putin-russia-won/681959/"
  },
  {
    "text": "HHS grants DOGE access to child support database, overriding objections  —  An HHS official said the associates of Elon Musk's group had sought ‘read-only’ access.  —  just now  —  The Department of Health and Human Services has granted associates of the U.S. DOGE Service access … ",
    "url": "https://www.washingtonpost.com/business/2025/03/08/hhs-doge-child-support/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQxNDEwMDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQyNzg4Nzk5LCJpYXQiOjE3NDE0MTAwMDAsImp0aSI6IjhkNzNkMWI2LTVmNTAtNGZiYy04ODM3LWYyMGU2NWE3ZmU0ZSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9idXNpbmVzcy8yMDI1LzAzLzA4L2hocy1kb2dlLWNoaWxkLXN1cHBvcnQvIn0.LevW59hwW9p_U4Nzr9-Z0wnvYLJe7p0-1bo2Kn1RsMs&itid=gfta"
  },
  {
    "text": "Unions ask court to stop DOGE from accessing Social Security data of millions of Americans  —  A group of labor unions are asking a federal court for an emergency order to stop Elon Musk 's Department of Government Efficiency from accessing the sensitive Social Security data of millions of Americans.",
    "url": "https://apnews.com/article/social-security-doge-lawsuit-data-protection-ab30a5f446914b93aff84188558c1416"
  },
  {
    "text": "Trump signs order to limit who gets public service student loan forgiveness  —  The president says some nonprofit organizations that qualify for the program are engaging in illegal activity, without offering any proof.  —  In a move that could upend a popular federal program … ",
    "url": "https://www.washingtonpost.com/education/2025/03/07/public-service-loan-forgiveness-trump-executive-order/"
  },
  {
    "text": "Trump's Justice Dept. ousts national security officials in latest purge  —  The transferring of at least three national security officials amounts to a complete gutting of leadership in the highly sensitive National Security Division.  —  just now  —  The Justice Department … ",
    "url": "https://www.washingtonpost.com/national-security/2025/03/08/trumps-justice-dept-ousts-national-security-officials-latest-purge/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQxNDEwMDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQyNzg4Nzk5LCJpYXQiOjE3NDE0MTAwMDAsImp0aSI6IjUwN2FjYmM2LTZlZGMtNGRlYi1hNTAxLTkwZDU2OTk0ZTRkOSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb25hbC1zZWN1cml0eS8yMDI1LzAzLzA4L3RydW1wcy1qdXN0aWNlLWRlcHQtb3VzdHMtbmF0aW9uYWwtc2VjdXJpdHktb2ZmaWNpYWxzLWxhdGVzdC1wdXJnZS8ifQ.F9jfSsMwPT5n8R8_y4KUE-jTT4ZHVz_o7zojG-h_APQ&itid=gfta"
  },
  {
    "text": "Wisconsin Gov. Tony Evers joins lawsuit against President Trump, calls widespread federal workforce firings illegal  —  Natalie Eilbert Mary SpicuzzaMilwaukee Journal Sentinel  —  Gov. Tony Evers announced Friday that Wisconsin has joined a multistate lawsuit against President Donald … ",
    "url": "https://www.jsonline.com/story/news/politics/2025/03/07/evers-sues-trump-over-reckless-mass-firings-of-federal-workers/81982085007/"
  },
  {
    "text": "Shelburne police officer had YouTube video playing in cruiser at time of fatal crash, court records say  —  Kyle Kapitanski is set to be arraigned next week on a felony charge stemming from the crash that killed Sean Hayes, a cyclist, in South Burlington.  —  A Shelburne police sergeant … ",
    "url": "https://vtdigger.org/2025/03/07/shelburne-police-officer-had-youtube-video-playing-in-cruiser-at-time-of-fatal-crash-court-records-say/"
  },
  {
    "text": "Trump Golf Weekends' Cost To Taxpayers Hits $18.2 million  —  Donald Trump has played golf at his own courses in Florida on six of the seven weekends since his second term began.  —  WASHINGTON — Donald Trump's insistence on playing golf at his Florida courses has now cost American taxpayers … ",
    "url": "https://www.huffpost.com/entry/donald-trump-golf18-million_n_67cb892fe4b02f3ad1f4b2bb"
  },
  {
    "text": "Trump's Threat To Take Over Canada Is a Scandal  —  Americans would never accept another nation threatening our country the way Trump insists on doing with Canada  —  As an American teenager who grew into a semblance of political consciousness during the height of George W. Bush's War on Terror … ",
    "url": "https://www.rollingstone.com/politics/political-commentary/trump-threat-canada-annex-scandal-1235292306/"
  },
  {
    "text": "Anger at Elon Musk turns violent with molotov cocktails and gunfire at Tesla lots  —  The string of violence against Tesla storefronts, charging stations and vehicles exacerbates the company's woes, analysts said.  —  The woman in the black hoodie walked onto the Tesla car lot prepared to inflict damage.",
    "url": "https://www.washingtonpost.com/technology/2025/03/08/elon-musk-tesla-protest-violence-vandalism/"
  },
  {
    "text": "Tim Walz has some sharp critiques of the Dem 2024 campaign  —  The Harris-Walz campaign should have “rolled the dice” more, he told POLITICO.  —  HELENA, Montana — Tim Walz thinks he and Kamala Harris played it too safe last year.  —  He thinks they should have held more town halls.",
    "url": "https://www.politico.com/news/2025/03/08/tim-walz-2024-campaign-critiques-00219718"
  },
  {
    "text": "Insiders Loaded Up On Firm's Stock—Right Before Don Jr. And Eric Trump's Involvement Sent Shares Soaring  —  Dominari Holdings insiders, as well as Donald Trump Jr. and Eric Trump, acquired 1 million shares through a private placement and bonuses just before the stock surged on news … ",
    "url": "https://www.forbes.com/sites/zacheverson/2025/03/08/donald-trump-jr-eric-stock-dominari-holdings-insider-trading/"
  },
  {
    "text": "Musk Doesn't Understand Why Government Matters  —  Elon Musk's life is a great American success story.  Time and again, he has anticipated where the world was headed, helping to create not just new products but new industries.  His achievements, from his pioneering role in online payments … ",
    "url": "https://www.nytimes.com/2025/03/08/opinion/elon-musk-doge-government.html"
  },
  {
    "text": "'You Can't Pin Him Down': Trump's Contradictions Are His Ultimate Cover  —  President Trump's shifting positions and outright lies have presented the American public with dueling narratives at every turn.  —  What does President Trump really believe?  —  Does he want to run for a third term, or is that just a joke?",
    "url": "https://www.nytimes.com/2025/03/08/us/politics/trump-third-term-gaza-contradictions.html"
  },
  {
    "text": "Controversial military-themed brewery shuts its doors after a year in Norfolk, citing “woke mob”  —  Financial filings show the brewery was struggling financially before it relocated and had failed to start turning a profit after opening in Norfolk.  —  A controversial military-themed brewery championed … ",
    "url": "https://www.whro.org/business-growth/2025-03-07/controversial-military-themed-brewery-shuts-its-doors-after-a-year-in-norfolk-citing-woke-mob"
  }
]