[
  {
    "text": "Trump, without evidence, blames ‘rhetoric’ of Biden, Harris for possible assassination attempt  —  Former president Trump, who has a long history of inflammatory rhetoric, repeated the claim on his social media platform Truth Social.  —  Former president Donald Trump on Monday blamed the … ",
    "url": "https://www.washingtonpost.com/politics/2024/09/16/trump-blames-biden-harris-rhetoric-potential-assassination-attempt/"
  },
  {
    "text": "You're Allowed to Call Trump a Threat to Democracy  —  Would-be assassins and migrant pogroms grab the headlines, but the most electorally important event of the week may be the much more boring one coming tomorrow: The Federal Reserve is set to cut interest rates for the first time in two years.",
    "url": "https://www.thebulwark.com/p/youre-allowed-to-call-trump-a-threat"
  },
  {
    "text": "After possible assassination attempt, Trump decries ‘rhetoric’?  Spare me the sanctimony.  —  The idea that Harris or her campaign should stop talking about the threat Trump poses to our democracy is absurd.  Democrats are not encouraging any form of violence against him or anyone else.",
    "url": "https://www.usatoday.com/story/opinion/columnist/2024/09/16/trump-assassination-attempt-golf-course-shooting-violence-hypocrisy/75251537007/"
  },
  {
    "text": "Vance: Trump's Health-Care Plan Is to Let Insurers Charge More for Preexisting Conditions … Donald Trump infamously said at the presidential debate he had the “concept of a plan” to replace Obamacare.  As is often the case when Trump commits verbal self-harm, it fell to J.D. Vance to turn … ",
    "url": "https://nymag.com/intelligencer/article/trump-health-plan-charge-more-preexisting-conditions-concept-plan-j-d-vance.html"
  },
  {
    "text": "Vance Lets Slip: He and Trump Are Coming For Your Health Care  —  It's not just Project 2025 or Trump's failed ACA repeal.  Vance accidentally admitted the NEW plan is to screw over people with pre-existing conditions specifically.  —  ∙ Paid  —  Democrats are always hoping … ",
    "url": "https://www.offmessage.net/p/vance-trump-coming-for-your-health-care"
  },
  {
    "text": "Harris soars to record 6-point lead over Trump in post-debate poll … - “A majority of likely voters — including 1 in 5 Republicans — believe Harris won the debate, and performance appears to be crystalizing her national lead over the former president,” said Eli Yokley, political analyst at Morning Consult, in an emailed statement.",
    "url": "https://www.axios.com/2024/09/17/harris-leads-trump-poll-after-debate-record"
  },
  {
    "text": "Harris holds 6-point national lead over Trump in postdebate polling  —  Vice President Harris is leading former President Trump nationally by 6 points, according to a polling released a week after the first debate between the major party nominees.  —  The Morning Consult survey … ",
    "url": "https://thehill.com/homenews/campaign/4883524-kamala-harris-donald-trump-post-debate-polling/"
  },
  {
    "text": "Harris leads Trump in Pennsylvania — and two bellwether PA counties — exclusive poll finds  —  Joey Garrison Michael CollinsUSA TODAY  —  WASHINGTON - Democratic presidential nominee Kamala Harris narrowly leads former President Donald Trump in the critical battleground state of Pennsylvania … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/09/16/harris-trump-pennsylvania-poll/75236006007/"
  },
  {
    "text": "Is 2024 the year of the ‘pro-choice’ Republican?  —  Good morning, Early Birds.  Tonight the sky will showcase a “super harvest moon.”  Here's when you can see it.  Send tips to earlytips@washpost.com.  Thanks for waking up with us.  —  In today's edition ... What's next for the Secret Service … ",
    "url": "https://www.washingtonpost.com/politics/2024/09/17/is-2024-year-pro-choice-republican/"
  },
  {
    "text": "Mehdi Hasan sounds off  —  “The media is too timid, too cautious, too cowardly.”  —  ∙ Paid … Mehdi Hasan thinks elite media institutions are failing us, which is why he founded Zeteo, an “independent and unfiltered” news and commentary site that has grown exponentially since its debut earlier this year.",
    "url": "https://www.publicnotice.co/p/mehdi-hasan-interview-2024"
  },
  {
    "text": "Playbook: The next Jan. 6  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  APPOINTMENT VIEWING — We're excited to note Eugene is among the reporters who will question VP KAMALA HARRIS later today in Philadelphia at an event organized by the National Association of Black Journalists.",
    "url": "https://www.politico.com/newsletters/playbook/2024/09/17/the-next-jan-6-00179476"
  },
  {
    "text": "In an Unprecedented Move, Ohio Is Funding the Construction of Private Religious Schools  —  The state is giving millions in taxpayer dollars directly to private schools to help them renovate and expand their campuses.  It may be the next frontier in the push to increase the use of school vouchers, proponents say.",
    "url": "https://www.propublica.org/article/ohio-taxpayer-money-funding-private-religious-schools"
  },
  {
    "text": "Harris enthusiasm driving a surge in young Latino registration: Voto Latino  —  Voter registration among young Hispanics jumped over the past two months, a change that the president and CEO of Voto Latino says is mostly driven by voter enthusiasm for Vice President Harris.",
    "url": "https://thehill.com/latino/4883646-voter-registration-jumps-hispanics/"
  },
  {
    "text": "Morning Report — Will two assassination attempts alter the election?  —  Editor's note: The Hill's Morning Report is our daily newsletter that dives deep into Washington's agenda.  To subscribe, click here or fill out the box below.  —  Close  —  Thank you for signing up!",
    "url": "https://thehill.com/newsletters/morning-report/4883482-two-assassination-attempts-donald-trump-2024-election/"
  },
  {
    "text": "Elon Musk Is a National Security Risk  —  Musk's now-deleted post questioning why no one has attempted to assassinate Joe Biden and Kamala Harris renews concerns over his work for the US government—and potential to inspire extremist violence.  —  Shortly following reports … ",
    "url": "https://www.wired.com/story/elon-musk-biden-harris-assassination-post-x/"
  },
  {
    "text": "U.S. Attorney Handling Would-Be Trump Assassin's Case Is a Haitian Immigrant  —  ISN'T IT IRONIC  —  Days after Donald Trump spewed conspiracies targeting Haitian migrants on the presidential debate stage, a Haitian-American immigrant has taken charge of the prosecution of an alleged assassin whose plot … ",
    "url": "https://www.thedailybeast.com/us-attorney-handling-would-be-trump-assassins-case-is-a-haitian-immigrant"
  },
  {
    "text": "Megyn Kelly owes Taylor Swift an apology  —  Megyn Kelly, formerly of NBC and Fox News, is enraged that Taylor Swift endorsed Kamala Harris for president.  The global superstar endorsed Harris in an Instagram post on September 10, immediately after the debate between Harris and Donald Trump.",
    "url": "https://popular.info/p/megyn-kelly-owes-taylor-swift-an"
  },
  {
    "text": "U.S. Authorities Were Warned About Suspected Trump Gunman  —  Ryan Routh criticized Trump and threatened to kill Vladimir Putin, setting off alarm bells among those involved in Ukraine assistance efforts  —  in West Palm Beach, Fla., and Vera Bergengruen in Washington",
    "url": "https://www.wsj.com/us-news/u-s-authorities-were-warned-about-suspected-trump-gunman-153dab6f?st=dHi5Ft&reflink=article_copyURL_share"
  },
  {
    "text": "Omnipresent AI cameras will ensure good behavior, says Larry Ellison  —  “We're going to have supervision,” says billionaire Oracle co-founder Ellison.  —  On Thursday, Oracle co-founder Larry Ellison shared his vision for an AI-powered surveillance future during a company financial meeting, reports Business Insider.",
    "url": "https://arstechnica.com/information-technology/2024/09/omnipresent-ai-cameras-will-ensure-good-behavior-says-larry-ellison/"
  },
  {
    "text": "New details of Trump family crypto project released, including who can buy in … More than two hours into Republican former President Donald Trump's World Liberty Financial launch event on X Monday night, the team behind the Trump family's new crypto project finally unveiled a key detail … ",
    "url": "https://www.cnbc.com/2024/09/16/trump-crypto-world-liberty-financial.html"
  },
  {
    "text": "14% of Republicans would ‘take action to overturn’ the election if Trump loses, study finds  —  Nearly half of Republicans say they won't accept the results of the presidential election if their candidate loses, and some of them say they would “take action to overturn” the results, according to data released Tuesday.",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/09/17/half-republicans-wont-accept-trump-loss-2024/75142477007/"
  },
  {
    "text": "Sean ‘Diddy’ Combs arrested at NYC hotel by Homeland Security amid sex trafficking investigation  —  Embattled rapper and hip hop mogul Sean “Diddy” Combs was arrested at a New York City hotel Monday night amid a federal sex trafficking investigation, officials said.",
    "url": "https://nypost.com/2024/09/16/us-news/sean-diddy-combs-arrested-in-nyc-amid-sex-trafficking-investigation/"
  }
]