[
  {
    "text": "What the New York Mayoral Primary Means for Democrats  —  Zohran Mamdani's success might give the party a few ideas about how to move forward—to a point.  —  After its demoralizing defeat in November, the Democratic Party has undertaken an agonizing, months-long self-autopsy to determine … ",
    "url": "https://www.theatlantic.com/politics/archive/2025/06/new-york-mayoral-race-democrats/683325/?gift=SCYx-5scVta3-cr_IlgTydVtlYoRnMm66hAXWfNor2w"
  },
  {
    "text": "What Democrats can (and can't) learn from Zohran Mamdani's triumph  —  Four takeaways from the socialist's shocking defeat of Andrew Cuomo. … It's hard to overstate how much this was not supposed to happen.  —  On Tuesday night, Zohran Mamdani — a 33-year-old socialist and state lawmaker … ",
    "url": "https://www.vox.com/politics/417776/zohran-mamdani-cuomo-nyc-mayor-policies-democrats"
  },
  {
    "text": "Democratic Leaders Tried to Crush Zohran Mamdani.  They Should Have Been Taking Notes.  —  On Tuesday night, Zohran Mamdani shocked the political establishment.  There are lessons that national Democrats should take from his strong showing in the Democratic primary for mayor of New York City.",
    "url": "https://www.nytimes.com/2025/06/25/opinion/zohran-mamdani-democratic-party.html?unlocked_article_code=1.Rk8.dJku.uzcolsc0QwnO&smid=url-share"
  },
  {
    "text": "Scoop: Trump to limit sharing classified info with Congress after leak on Iran bombing damage … - The FBI also is investigating the leak, the sources said. … - “We are declaring a war on leakers,” a senior White House official said Wednesday.  — “The FBI is investigating the leak,” the source said.",
    "url": "https://www.axios.com/2025/06/25/iran-bombing-intelligence-trump-congress"
  },
  {
    "text": "Leavitt says Israel and Iran have debunked claims nuclear sites weren't destroyed  —  White House press secretary Karoline Leavitt joined members of the Trump administration in firmly rebuffing reports that Iran's nuclear sites were not completely destroyed, citing information from the two countries involved in the conflict.",
    "url": "https://www.washingtonexaminer.com/news/3453965/karoline-leavitt-says-israel-iran-have-debunked-claims-nuclear-sites-werent-destroyed/"
  },
  {
    "text": "Rubio Fleshes Out Trump's Case That Iran Nuclear Capacity Was Eliminated  —  Secretary of State Marco Rubio said U.S. strikes had destroyed a facility that is key to turning highly enriched nuclear fuel into a working bomb.  He railed against a less optimistic U.S. intelligence report.",
    "url": "https://www.nytimes.com/2025/06/25/us/politics/iran-nuclear-program-damage-rubio.html?unlocked_article_code=1.Rk8.Qcah.NRcCxPKYcs-B&smid=url-share"
  },
  {
    "text": "Thune faces brewing megabill mutiny  —  Sen. Thom Tillis warned his colleagues during a closed-door meeting Wednesday that he would not vote to take up the party's sweeping domestic policy bill without further clarity on Medicaid changes, a person granted anonymity to disclose private discussions said.",
    "url": "https://www.politico.com/live-updates/2025/06/25/congress/megabill-senate-mutiny-00424389"
  },
  {
    "text": "Trump DOJ sues all federal judges in Maryland over deportation order  —  Legal experts said the unusual lawsuit marks an escalation in the Trump administration's attacks on the U.S. judiciary.  —  Summary907  —  The Justice Department sued all 15 federal district court judges in Maryland … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2025/06/25/doj-sues-maryland-judges/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzUwODI0MDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzUyMjA2Mzk5LCJpYXQiOjE3NTA4MjQwMDAsImp0aSI6ImUyZmEwZTJlLTcyNjItNDMzZi1hNjAzLTJjNDc5YjU3OWFiYSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9kYy1tZC12YS8yMDI1LzA2LzI1L2Rvai1zdWVzLW1hcnlsYW5kLWp1ZGdlcy8ifQ.6KulD7UhFMLNjUw0ZNdMZR_fqmAlEIJrK5egCHTSgIE&itid=gfta"
  },
  {
    "text": "RFK Jr. says US won't donate to global vaccine effort  —  Kennedy ripped into Gavi, the Vaccine Alliance, in a video address at its pledging summit.  —  The United States won't contribute anymore to Gavi, the Vaccine Alliance, until the global health organization has “re-earned the public trust … ",
    "url": "https://www.politico.com/news/2025/06/25/rfk-vaccine-donations-gavi-00422705"
  },
  {
    "text": "Trump's Border Czar Claims Death Threats Have Driven Him From Wife  —  DISPLACED  —  President Donald Trump's border czar Tom Homan says he has received so much hate for his positions on immigration that he is unable to live safely with his family.  In a podcast interview with the New York Post … ",
    "url": "https://www.thedailybeast.com/trumps-border-czar-tom-homan-living-separately-from-wife-due-to-death-threats/"
  },
  {
    "text": "Something is ‘pulsing’ beneath the Earth, scientists say - and could tear a continent apart  —  Rhythmic surges are like a ‘heartbeat’ under the ground  —  Scientists have detected deep pulses in the Earth beneath Africa - and it could tear the continent apart.",
    "url": "https://www.independent.co.uk/space/earth-pulsing-continent-africa-b2776542.html"
  },
  {
    "text": "U.S. Department of Education Finds California Department of Education and California Interscholastic Federation in Violation of Title IX  —  Today, the U.S. Department of Education's Office for Civil Rights (OCR) announced the conclusion of its Title IX investigations into the California Department … ",
    "url": "https://www.ed.gov/about/news/press-release/us-department-of-education-finds-california-department-of-education-and-california-interscholastic-federation-violation-of-title-ix"
  },
  {
    "text": "‘Criminal immigrant’ means whatever the administration says it means  —  Trump's deportation goals are being met by targeting non-criminal immigrants.  —  President Donald Trump being President Donald Trump, it certainly seems possible that he believed that the Maryland resident … ",
    "url": "https://www.washingtonpost.com/opinions/2025/06/25/immigration-criminals-trump-invention/"
  },
  {
    "text": "'They're Not Breathing': Inside the Chaos of ICE Detention Center 911 Calls  —  Records of hundreds of emergency calls from ICE detention centers obtained by WIRED—including audio recordings—show a system inundated by life-threatening incidents, delayed treatment, and overcrowding.",
    "url": "https://www.wired.com/story/ice-detention-center-911-emergencies/"
  },
  {
    "text": "National Science Foundation to Be Requisitioned as Mansion for HUD Secretary (And Also HUD Office)  —  I'm still trying to find out more about this.  But as I do, I just wanted to put it on your radar because it's completely crazy and epitomizes the Trump presidency.",
    "url": "https://talkingpointsmemo.com/edblog/national-science-foundation-to-be-requisitioned-as-mansion-for-hud-secretary-and-also-hud-office"
  },
  {
    "text": "First Reports Are Always Wrong.  The Iran Strike Is No Exception.  —  EARLY IN MY CAREER, AS A YOUNG LIEUTENANT, I made a mistake that still haunts me.  After a high-tempo mission, I rushed to assess the outcome and tell my boss about what I believed was our overwhelming success.  Without full intelligence.",
    "url": "https://www.thebulwark.com/p/first-reports-are-always-wrong-iran-strike-nuclear-dia-intelligence-assessment"
  },
  {
    "text": "Trump Considers Naming Next Fed Chair Early in Bid to Undermine Powell  —  Warsh, Hassett and Bessent are among those under consideration as Trump evaluates their commitment to cutting rates—and ‘made-for-TV’ appeal  —  President Trump's exasperation over the Federal Reserve's take-it-slow approach … ",
    "url": "https://www.wsj.com/economy/central-banking/trump-considers-naming-next-fed-chair-early-in-bid-to-undermine-powell-d3edcb9c?st=RsjPmE&reflink=article_copyURL_share"
  },
  {
    "text": "Trump's Use of Federal Troops in Drug Raid Outside of Los Angeles: An Alarming Escalation  —  Editor's Note  —  This piece is part of Just Security's Collection: Just Security's Coverage of the Trump Administration's Executive Actions.  —  Last week, federalized National Guard forces … ",
    "url": "https://www.justsecurity.org/115545/federalized-national-guard-drug-raids/"
  },
  {
    "text": "Voters 51 - 42 Percent Oppose U.S. Joining Israel In Military Strikes On Iran's Nuclear Sites, Quinnipiac University National Poll Finds; Vast Majority Concerned U.S. Will Get Drawn Into A War With Iran  — mail_outline  —  Days after the United States military targeted nuclear sites inside Iran … ",
    "url": "https://poll.qu.edu/poll-release?releaseid=3925"
  },
  {
    "text": "A Word to the Weiss … Late last year, during a trip to New York City, David Ellison quietly made time for a meeting that said as much about his worldview as it did about his interest in media.  According to people familiar with the matter, the Hollywood scion set time aside on his busy calendar … ",
    "url": "https://www.status.news/p/bari-weiss-david-ellison-cbs-news"
  },
  {
    "text": "Iranian immigrant who has lived in New Orleans nearly 50 years arrested outside Lakeview home  —  The arrest highlights how Trump's immigration crackdown has ensnared people who were long allowed to stay in the U.S. as their cases unfolded.  — 5 min to read",
    "url": "https://www.nola.com/news/politics/national_politics/iran-new-orleans-woman-arrested/article_bcfdc93e-01dc-4021-b5f8-a91ded5ed784.html"
  },
  {
    "text": "Mediator Proposes $20 Million Settlement in Trump's CBS Suit  —  Potential package would include a donation, legal costs and public service announcements  —  A mediator has proposed that President Trump and Paramount Global settle his lawsuit over a CBS News “60 Minutes” … ",
    "url": "https://www.wsj.com/business/media/mediator-proposes-20-million-settlement-in-trumps-cbs-suit-ed04c3e3?st=KHicGt&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Kyle Rittenhouse Steps Away From Public Eye, Deletes Social Media Accounts, Leaves Gun Shop Job  —  Kyle Rittenhouse quietly shuttered his social media accounts and stepped back from the spotlight at some point during the past few months, an about-face from the slew of public speaking appearances … ",
    "url": "https://www.mediaite.com/online/kyle-rittenhouse-steps-away-from-public-eye-deletes-social-media-accounts-leaves-gun-shop-job/"
  },
  {
    "text": "Emil Bove Avoids Telling the Senate Much of Anything About DOJ  —  Trump's former personal lawyer, up for a powerful judicial seat, was hammered by Senate Democrats over his role as the president's legal enforcer.  — Copy  —  The defining feature of Justice Department official Emil Bove's trip … ",
    "url": "https://www.notus.org/trump-white-house/emil-bove-senate-hearing-court"
  },
  {
    "text": "A Military-Ethics Professor Resigns in Protest  —  Over the course of several months, Pauline Shanks Kaurin concluded that she no longer had the academic freedom necessary for doing her job.  —  Seven years ago, Pauline Shanks Kaurin left a good job as a tenured professor at a university … ",
    "url": "https://www.theatlantic.com/ideas/archive/2025/06/academic-freedom-naval-war-college/683309/?gift=_IXYI0Wrwnxuvm7JZ0fMfDckvNPBk-LgBKXWRsnkcHo&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Jill Biden's top aide bails on House investigation in Biden fitness  —  Anthony Bernal, the top aide to Jill Biden, abruptly withdrew from his scheduled interview with the House Oversight Committee after President Trump's White House waived his ability to invoke executive privilege to protect private conversations.",
    "url": "https://www.axios.com/2025/06/25/joe-biden-mental-fitness-anthony-bernal-oversight-testimony"
  },
  {
    "text": "Presentation for CDC advisers appears to cite nonexistent study to support claims about risk of vaccine preservative  —  A presentation slated to be shared at this week's meeting of vaccine advisers to the US Centers for Disease Control and Prevention claimed that a study in animals suggested … ",
    "url": "https://cnn.com/2025/06/24/health/cdc-vaccine-adviser-thimerosal-presentation"
  },
  {
    "text": "District Court, M.D. Tennessee  —  Citation: United States v. Garcia, 3:25-cr-00115, (M.D. Tenn. Jun 25, 2025) ECF No. 55  —  Add Note   Search this PDF  Download PDF  —  MEMORANDUM OPINION as to Kilmar Armando Abrego Garcia: The Government's Motion for Stay of Release Order (Doc.",
    "url": "https://www.courtlistener.com/docket/70476164/55/united-states-v-garcia/"
  },
  {
    "text": "Trump administration is preparing to test budget law, U.S. officials say  —  Internal dissent among federal employees is coming to the surface as President Donald Trump's budget chief aims to rebalance spending authority.  —  The Trump administration is preparing to test a 1974 budget law … ",
    "url": "https://www.washingtonpost.com/business/2025/06/25/trump-budget-law-challenge/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzUwODI0MDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzUyMjA2Mzk5LCJpYXQiOjE3NTA4MjQwMDAsImp0aSI6ImQ2ODE0NTEzLWMwMzMtNDhjZC04NjgzLWUyYTdjY2YyYzcyOCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9idXNpbmVzcy8yMDI1LzA2LzI1L3RydW1wLWJ1ZGdldC1sYXctY2hhbGxlbmdlLyJ9.HGcNp4UXhp_Uz1DAllvQAY6WEDK0Kduz8RdN5cDvxPI&itid=gfta"
  }
]