[
  {
    "text": "Iran launches unprecedented drone and missile attack on Israel … - The specific targets were initially unclear.  — The Biden administration has vowed to help Israel counter the Iranian attack.  — Iranian officials had threatened to retaliate against Israel for an airstrike in Syria … ",
    "url": "https://www.axios.com/2024/04/13/iran-israel-attack"
  },
  {
    "text": "Iran's state-run news agency says Iran has fired ballistic missiles at targets inside Israel … Iran says it has launched ballistic missiles as part of its attack targeting Israel.  The state-run IRNA news agency quoted an anonymous official saying ballistic missiles were part of the attack.",
    "url": "https://apnews.com/article/strait-of-hormuz-vessel-33fcffde2d867380e98c89403776a8ac"
  },
  {
    "text": "Biden returns to the White House as imminent Iranian attack on Israel is possible … - Israel Defense Forces' home front command announced a state of alert starting 4pm ET Saturday and added that all schools and education institutions will be closed Sunday — another sign of an imminent attack.",
    "url": "https://www.axios.com/2024/04/13/biden-israel-iran-white-house"
  },
  {
    "text": "Iran launches hundreds of suicide drones in ‘significant escalation’ against Israel  —  Iran has launched an attack against Israel using hundreds of suicide drones, the Jewish state has confirmed.  —  Axios journalist Barak Ravid, citing a senior Israeli official, reported that hundreds of drones were headed for Israel.",
    "url": "https://nypost.com/2024/04/13/world-news/iran-launches-wave-of-drone-attacks-at-israel-report/"
  },
  {
    "text": "White House says US support for Israel is ‘ironclad,’ will ‘support their defense’ amid Iran attack  —  Iran launched an aerial attack towards Israel Saturday  —  The White House vowed Saturday that the United States' support for Israel's security is “ironclad,” pledging to stand with the Jewish state and … ",
    "url": "https://www.foxnews.com/politics/white-house-says-us-support-for-israel-is-ironclad-will-support-their-defense-amid-iran-attack"
  },
  {
    "text": "Biden cuts short weekend trip as Iran launches attack on Israel  —  The president returned a day earlier than planned from Delaware.  —  President Joe Biden cut short a weekend trip to his Delaware beach home to return to the White House as Iran launched a series of drone and missile strikes against Israel.",
    "url": "https://www.politico.com/news/2024/04/13/biden-cuts-trip-middle-east-00152111"
  },
  {
    "text": "Majority of voters think Trump committed ‘serious federal crimes,’ according to NYT poll  —  The new poll comes as jury selection will begin in Trump's New York trial on Monday.  —  A majority of voters believe former President Donald Trump has committed “serious federal crimes,” … ",
    "url": "https://www.politico.com/news/2024/04/13/trump-crimes-poll-voters-00152110"
  },
  {
    "text": "Biden Shrinks Trump's Edge in Latest Times/Siena Poll  —  The president's popularity has ticked up slightly, though voters still view Donald J. Trump more favorably and have dour views of the economy.  —  President Biden has nearly erased Donald J. Trump's early polling advantage … ",
    "url": "https://www.nytimes.com/2024/04/13/us/politics/trump-biden-times-siena-poll.html"
  },
  {
    "text": "A Closer Look at a Slight Shift in the Polls  —  An average of recent surveys, including the Times/Siena poll, finds President Biden inching closer to Donald Trump.  —  Is President Biden gaining in the polls?  There have been signs of it ever since his State of the Union address last month … ",
    "url": "https://www.nytimes.com/2024/04/13/upshot/biden-trump-polls.html"
  },
  {
    "text": "Republicans in swing state Wisconsin unenthused by Trump: ‘A bad candidate’  —  Fervent Trump supporters from last elections air doubts over abortion and the man himself in state where turnout will be key  —  Terri Burl has come full circle.  —  The local Republican party official … ",
    "url": "https://www.theguardian.com/us-news/2024/apr/13/election-trump-wisconsin-republicans"
  },
  {
    "text": "Mike Pence pushes a post-Trump path for conservatives and GOP  —  The former vice president, who decided not to endorse his old running mate, believes many in the conservative movement have lost their way to populism  —  Mike Pence became vice president by bearing witness to Donald Trump … ",
    "url": "https://www.washingtonpost.com/politics/2024/04/13/mike-pence-trump-conservative-movement/"
  },
  {
    "text": "Trump will juggle appearances in courtroom and on campaign trail as hush money trial begins  —  Former President Donald Trump's appearance in a New York courthouse Monday for jury selection in his criminal hush money trial will kick off a weekslong juggling act between the courtroom … ",
    "url": "https://www.cnn.com/2024/04/13/politics/trump-trial-schedule/"
  },
  {
    "text": "‘The 401(k) industry owns Congress’: How lawmakers quietly passed a $300 billion windfall to the wealthy  —  Greased by lobbying and campaign cash, tax breaks for retirement savings are one thing Congress agrees on.  But they also blow out the deficit and add to income inequality.",
    "url": "https://www.politico.com/news/2024/04/13/how-your-401k-ate-the-federal-budget-00150319"
  },
  {
    "text": "Trump wields endorsement to try and remove one of two pro-impeachment Republicans left in the House  —  Former President Donald Trump wielded his endorsement in a Washington House race on Friday to try and remove one of the two Republicans left who tried to impeach him in 2021.",
    "url": "https://www.washingtonexaminer.com/news/house/2965301/trump-wields-endorsement-to-try-and-remove-one-of-two-pro-impeachment-republicans-left-in-the-house/"
  },
  {
    "text": "Biden wins Wyoming Democratic caucus  —  President Biden is the winner of the Wyoming Democratic presidential caucus, Decision Desk HQ has projected.  —  Biden is already the presumptive nominee of the Democratic Party, having mathematically clinched the nomination last month.",
    "url": "https://thehill.com/homenews/4591114-biden-wins-wyoming-democratic-caucuses/"
  }
]