[
  {
    "text": "DOJ expected to announce indictment of Texas Democratic Rep. Henry Cuellar, sources say  —  Federal authorities searched the congressman's home in Laredo in 2022 as part of an investigation into the country of Azerbaijan and a group of U.S. businessmen.  —  WASHINGTON — The Justice Department … ",
    "url": "https://www.nbcnews.com/politics/congress/doj-expected-announce-indictment-texas-democratic-rep-henry-cuellar-so-rcna150567"
  },
  {
    "text": "U.S. Congressman Henry Cuellar and His Wife Charged with Bribery, Unlawful Foreign Influence, and Money Laundering Schemes  —  For Immediate Release  —  Congressman Allegedly Accepted $600,000 in Bribes from Two Foreign Entities in Exchange for Official Acts as a Member of Congress",
    "url": "https://www.justice.gov/opa/pr/us-congressman-henry-cuellar-and-his-wife-charged-bribery-unlawful-foreign-influence-and"
  },
  {
    "text": "SEC charges Trump Media auditor with ‘massive fraud’ on hundreds of companies, imposes lifetime ban … The auditing firm for Trump Media and the auditor's owner were charged Friday with “massive fraud” by the Securities and Exchange Commission for work that affected more than 1,500 SEC filings, the federal regulator announced.",
    "url": "https://www.cnbc.com/2024/05/03/trump-media-auditor-charged-by-sec-with-massive-fraud-permanently-barred-from-public-company-audits.html"
  },
  {
    "text": "SEC Charges Audit Firm BF Borgers and Its Owner with Massive Fraud Affecting More Than 1,500 SEC Filings  —  The Securities and Exchange Commission today charged audit firm BF Borgers CPA PC and its owner, Benjamin F. Borgers (together, “Respondents\"), with deliberate and systemic failures … ",
    "url": "https://www.sec.gov/news/press-release/2024-51"
  },
  {
    "text": "Trump Media's accounting firm charged with ‘massive fraud’  —  New York CNN  —  BF Borgers, Trump Media & Technology Group's independent accounting firm, was charged by the Securities and Exchange Commission on Friday with widespread fraud and accused of operating a “sham audit mill.”",
    "url": "https://www.cnn.com/2024/05/03/business/trump-media-accounting-firm-charged-fraud/"
  },
  {
    "text": "Trump Media's accountant is charged with “massive fraud” by the SEC  —  BF Borgers, the independent accounting firm for Trump Media & Technology Group, is facing allegations of “massive fraud” from the Securities and Exchange Commission, which on Friday claimed the auditor ran a “sham audit mill” that put investors at risk.",
    "url": "https://www.cbsnews.com/news/trump-media-accountant-borgers-charged-with-massive-fraud-sec/"
  },
  {
    "text": "Gov. Kristi Noem's account of meeting North Korean dictator in doubt  —  UPDATE: Since the original publication of this story, a Noem spokesman told The Dakota Scout “the publisher will be addressing conflated world leaders' names in the book before it is released.”",
    "url": "https://www.thedakotascout.com/p/gov-kristi-noems-account-of-meeting"
  },
  {
    "text": "Noem book dogged by new claims of inaccuracies  —  The South Dakota governor says she met with North Korea's dictator and, separately, that she was threatened by Nikki Haley.  Both are being questioned.  —  Days ahead of its release, South Dakota Gov. Kristi Noem is mired in yet … ",
    "url": "https://www.politico.com/news/2024/05/03/kristi-noem-book-excerpt-nikki-haley-dog-00155925"
  },
  {
    "text": "Mark Meadows unmasked in Arizona fake electors indictment, faces 9 felony charges: Report  —  Charges have formally been made public against Mark Meadows, the onetime chief of staff to former President Donald Trump, in the expansive fake electors case now underway in Arizona.",
    "url": "https://lawandcrime.com/high-profile/mark-meadows-unmasked-in-arizona-fake-electors-indictment-faces-9-felony-charges-report/"
  },
  {
    "text": "Trump Trial Live Updates: Hope Hicks Details Campaign's Panic Over ‘Access Hollywood’ Tape  —  On the stand in Donald J. Trump's criminal trial, Ms. Hicks, who was his press secretary in 2016, described the chaos that ensued after the infamous recording of the candidate discussing how he groped women was made public.",
    "url": "https://www.nytimes.com/live/2024/05/03/nyregion/trump-hush-money-trial"
  },
  {
    "text": "Trump Violates Gag Order by Posting Video Attacking Judge's Daughter  —  This potential violation occurred after Judge Merchan held Trump in contempt of court  —  On Thursday night, Trump posted a link to a Rumble clip of Steve Bannon's War Room podcast in which Trump supporting host Doug Burquam … ",
    "url": "https://www.meidastouch.com/news/trump-violates-gag-order-by-posting-video-attacking-judges-daughter"
  },
  {
    "text": "Former government official charged with falsely implicating colleagues in Jan. 6 attack  —  Investigators say Miguel Zapata used “burner” emails to submit anonymous, false tips to an FBI tipline about seven ex-colleagues.  —  Federal prosecutors have charged a former government employee … ",
    "url": "https://www.politico.com/news/2024/05/03/former-government-official-charged-jan-6-capitol-riots-00155949"
  },
  {
    "text": "8 Possible Trump VP Candidates Who Haven't Shot Their Dogs  —  That we know of!  —  LOADING  —  Kristi Noem thought the political world would be impressed by her story of executing a dog, but she seems to have misjudged her fellow Republicans — including, most critically, Donald Trump.",
    "url": "https://www.huffpost.com/entry/trump-vp-list-kristi-noem_n_6634f704e4b0fc2b95294be2"
  },
  {
    "text": "How one text exchange gave Trump an ominous day in court  —  Editor's Note: Norman Eisen is a CNN legal analyst and editor of “Trying Trump: A Guide to His First Election Interference Criminal Trial.”  He served as counsel to the House Judiciary Committee for the first impeachment and trial of then-President Donald Trump.",
    "url": "https://www.cnn.com/2024/05/02/opinions/keith-davidson-testimony-trump-ominous-day-in-court-eisen/"
  },
  {
    "text": "Texas man files legal action to probe ex-partner's out-of-state abortion  —  The previously unreported petition reflects a potential new antiabortion strategy to block women from ending their pregnancies in states where abortion is legal.  —  As soon as Collin Davis found out his ex-partner … ",
    "url": "https://www.washingtonpost.com/investigations/2024/05/03/texas-abortion-investigations/"
  },
  {
    "text": "Make Billionaires Pay (Their Taxes)  —  Until recently, it was hard to know just how good the superrich are at avoiding taxes.  Public statistics are oddly quiet about their contributions to government coffers, a topic of legitimate interest in democratic societies.",
    "url": "https://www.nytimes.com/interactive/2024/05/03/opinion/global-billionaires-tax.html"
  },
  {
    "text": "Biden finalizes rule opening up Obamacare to DACA recipients  —  Federal health officials estimate that roughly 100,000 people enrolled in the Deferred Action for Childhood Arrivals program will sign up for subsidized plans through the health insurance marketplace over the next year under the rule.",
    "url": "https://www.politico.com/news/2024/05/03/biden-obamacare-daca-00155881"
  },
  {
    "text": "An AI tool used in thousands of criminal cases is facing legal challenges  —  Cybercheck's founder has said the software tops 90% accuracy.  Defense lawyers have said he lied under oath about his expertise and made false claims about when and where the technology has been used.",
    "url": "https://www.nbcnews.com/news/crime-courts/ai-tool-used-thousands-criminal-cases-facing-legal-challenges-rcna149607"
  },
  {
    "text": "Israel briefs US on plan to move Gazans ahead of Rafah invasion  —  The Israel Defense Forces recently told the U.S. government and aid groups operating on the ground that they had developed a plan to move people out of Rafah.  —  The Israeli military has informed aid groups … ",
    "url": "https://www.politico.com/news/2024/05/03/israel-gazans-rafah-invasion-00156024"
  },
  {
    "text": "Austin City Council passes gender affirming care protections after Texas lawsuit  —  The Austin City Council passed protections for gender-affirming care Thursday, only a few days after the state of Texas filed a lawsuit over Title IX changes granting protections for transgender people.",
    "url": "https://thehill.com/homenews/lgbtq/4641956-austin-city-council-passes-gender-affirming-care-protections/"
  },
  {
    "text": "US Justice Department warns it will sue if Iowa tries to enforce its new immigration law  —  The U.S. Department of Justice will sue Iowa to block a new immigration law criminalizing “illegal reentry” if it remains in effect, a top DOJ official wrote to Gov. Kim Reynolds and Attorney General Brenna Bird Thursday.",
    "url": "https://www.desmoinesregister.com/story/news/politics/2024/05/03/department-of-justice-warns-lawsuit-iowa-immigration-illegal-reentry-law-kim-reynolds/73548125007/"
  },
  {
    "text": "Hope Hicks witnessed nearly every Trump scandal.  Now she must testify.  —  Friends say the former aide and Trump have not spoken since she testified to Congress about the Jan. 6 Capitol attack, but the two continue to have affection for each other  —  Special counsel Robert S. Mueller III … ",
    "url": "https://www.washingtonpost.com/politics/2024/05/03/hope-hicks-testimony-trump-hush-money-trial/"
  },
  {
    "text": "Jeffco GOP cancels Kristi Noem event amid dog-killing controversy  —  Jefferson County Republicans embraced the national furor over Governor Kristi Noem's killing of a puppy, then backtracked citing “safety concerns.”  —  JEFFERSON COUNTY, Colo. — South Dakota Governor Kristi Noem (R) … ",
    "url": "https://www.9news.com/article/news/local/next/next-with-kyle-clark/kristi-noem-colorado-gop-event-canceled/73-8b7b16f9-ddac-4dbc-8195-f81ec4bb2eab"
  }
]