[
  {
    "text": "CBS News poll finds Trump starts on positive note as most approve of transition handling  —  President-elect Donald Trump's incoming administration starts off with mostly good will from the public: a majority of Americans overall are either happy or at least satisfied that he won … ",
    "url": "https://www.cbsnews.com/news/cbs-news-poll-trump-transition-cabinet-picks-2024-11-24/"
  },
  {
    "text": "Democrats turn on each other in battle for soul of the party  —  The Democrats are nearly three weeks removed from their first popular vote defeat in a presidential contest in two decades and are riven about how to avoid a similar defeat in four years.  —  President-elect Donald Trump pulled off … ",
    "url": "https://www.washingtonexaminer.com/news/campaigns/3237997/democrats-2024-defeats-battle-for-soul-of-the-party/"
  },
  {
    "text": "As MSNBC Continues to Swirl Down the Toilet, Its Latest Excuse for Trump's Win Is Crazy-Train Absurd  —  In the slim chance that you need an example to understand why MSNBC's ratings have continued to swirl down the toilet in the aftermath of President-elect Donald Trump's decisive win … ",
    "url": "https://redstate.com/mike_miller/2024/11/23/as-mnsbc-continues-to-swirl-down-the-toilet-its-latest-excuse-for-trumps-win-is-crazy-train-lunacy-n2182402"
  },
  {
    "text": "You'll Need to Hit the Showers for a ‘Sanewash’ After This Ridiculous RFK Hit Piece  —  America's left just lost an election in which voters overwhelmingly rejected their current fad: that it is perfectly normal for men to be surgically converted into women, use women's bathrooms and locker rooms … ",
    "url": "https://pjmedia.com/victoria-taft/2024/11/23/hhs-n4934342"
  },
  {
    "text": "Trump Is Running His Transition Team on Secret Money  —  Breaking with past practice, President-elect Donald J. Trump has not agreed to disclose the donors paying for his planning effort or to limit their contributions.  —  President-elect Donald J. Trump is keeping secret the names … ",
    "url": "https://www.nytimes.com/2024/11/24/us/politics/donald-trump-2024-campaign-transition.html?unlocked_article_code=1.cU4.9Lik.0btlhOTcy7j9&smid=url-share"
  },
  {
    "text": "Trump Refuses to Disclose Who Is Funding His Transition  —  He is the first president-elect not to sign an ethics agreement that sets fundraising limits and transparency  —  True to character, Donald Trump is already flouting ethics laws and norms even before he takes office as president in 2025.",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-refuses-disclose-funding-transition-1235179059/"
  },
  {
    "text": "Chuck Woolery, smooth-talking game show host of ‘Love Connection’ and ‘Scrabble,’ dies at 83  —  Chuck Woolery, the affable, smooth-talking game show host of “Wheel of Fortune,” “Love Connection” and “Scrabble” who later became a right-wing podcaster, skewering liberals and accusing the government of lying about COVID-19, has died.",
    "url": "https://apnews.com/article/obituary-chuck-woolery-508f37c136ccbc4c8ad48a4fd582674b"
  },
  {
    "text": "Trump's vow to use US troops for mass deportations could face intense resistance — starting from within the military  — President-elect Trump confirmed his intent to use the US military for mass deportations in the US.  — Laws sharply limit the roles that federal troops can fill in US law enforcement.",
    "url": "https://www.businessinsider.com/trump-military-mass-deportation-plan-legal-limits-experts-2024-11"
  },
  {
    "text": "Trump's plan to dismantle DEI on day one is a “colorblind” path to Jim Crow 2.0  —  Stephen Miller makes clear the subtext behind Trump's call to ban DEI  —  Donald Trump's vow to ban diversity, equity, and inclusion (DEI) initiatives in workplaces and educational institutions … ",
    "url": "https://www.salon.com/2024/11/24/plan-to-dismantle-dei-on-day-one-is-a-colorblind-path-to-jim-crow-20/"
  },
  {
    "text": "The Resistance goes quiet … - That could change as Trump moves to implement his agenda. … This time Democratic voters, particularly women, were just as disappointed but less shocked, says Lisa Mueller, a political science professor at Macalester College.",
    "url": "https://www.axios.com/2024/11/24/resistance-trump-protests-womens-march"
  },
  {
    "text": "Sherrod Brown won't rule out running for Senate again  —  The Ohio Democrat was defeated earlier this month.  —  Sen. Sherrod Brown, who was defeated Nov. 5 in his reelection bid, said he won't rule out running for the Senate again or for governor of Ohio in 2026.",
    "url": "https://www.politico.com/news/2024/11/24/sherrod-brown-senate-run-00191406"
  },
  {
    "text": "Hagerty: Public doesn't care if FBI does background check of Hegseth  —  Trump will command compliance from his administration, GOP senator says.  —  In this July 16, 2024, file photo, Senator Bill Hagerty, a Republican from Tennessee, is shown at an interview during the Republican National Convention (RNC) in Milwaukee, Wisconsin.",
    "url": "https://abcnews.go.com/Politics/hagerty-public-care-fbi-background-check-hegseth/story?id=116168369"
  },
  {
    "text": "‘The View’ hosts forced to issue four ‘legal notes’ in a single episode spent trashing Trump's cabinet picks  —  “The View” doesn't want anyone to sue.  —  The co-hosts of the controversial ABC talk show were forced to issue four “legal notes” during Friday's broadcast after they discussed … ",
    "url": "https://nypost.com/2024/11/23/entertainment/the-view-hosts-forced-to-issue-four-legal-notes-in-a-single-episode-spent-trashing-trumps-cabinet-pick/"
  },
  {
    "text": "Will Trump's former defense lawyer protect the Justice Department from Trump?  —  DOJ officials say Todd Blanche, a former federal prosecutor, knows its tradition of barring politicians from influencing criminal investigations, but he faces a daunting task.  —  WASHINGTON — When Matt Gaetz … ",
    "url": "https://www.nbcnews.com/politics/justice-department/will-trumps-former-defense-lawyer-protect-justice-department-trump-rcna181002"
  },
  {
    "text": "This Professor Has Taken on Robert F. Kennedy Jr. for Opposing Vaccines  —  A Q&A with Dr. Peter Hotez, who has clashed with the new health and human services secretary nominee.  Hotez himself helped develop low-cost vaccinations. … Dr. Peter Hotez knows vaccines.",
    "url": "https://www.insidehighered.com/news/government/science-research-policy/2024/11/22/professor-has-taken-rfk-jr-opposing-vaccines"
  }
]