[
  {
    "text": "Playbook: Can Dems flip the border script?  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  I'VE GOT A BLANK SPACE, BABY — The NYT takes a close look this morning at President JOE BIDEN's general election battle plan, which will “couple a direct assault on … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/01/29/can-dems-flip-the-border-script-00138304"
  },
  {
    "text": "The huge wedge between McConnell and Johnson: Donald Trump  —  The two Hill GOP leaders are about to find out if they can bridge their yawning generation gap — with a border and Ukraine deal on the line.  —  Mitch McConnell and Mike Johnson, two wildly different congressional GOP leaders … ",
    "url": "https://www.politico.com/news/2024/01/29/mcconnell-johnson-trump-border-ukraine-deal-00138165"
  },
  {
    "text": "Inside Biden's Anti-Trump Battle Plan (and Where Taylor Swift Fits In)  —  Watching Donald Trump ascend, the newly energized Biden campaign is aiming to make the general election all about him.  It's also hoping for some big endorsements.  —  As former President Donald J. Trump speeds toward … ",
    "url": "https://www.nytimes.com/2024/01/29/us/politics/biden-trump-election-taylor-swift.html"
  },
  {
    "text": "Lankford defends bipartisan border security bill after attacks by Trump, GOP  —  'We all have an oath to the Constitution and we have a commitment to say we're going to do whatever we can to be able to secure the border,' the senator from Oklahoma says.  —  Sen. James Lankford (R-Okla.) … ",
    "url": "https://www.washingtonpost.com/politics/2024/01/28/border-bill-trump-lankford/"
  },
  {
    "text": "GOP hawks press Biden to target Iran directly over soldiers' deaths  —  President Biden is facing calls from congressional hawks to escalate attacks on Iran-linked targets, including within Iran itself, in response to the deaths of three U.S. service members in a drone attack in Jordan.",
    "url": "https://www.axios.com/2024/01/28/gop-biden-iran-soldier-deaths"
  },
  {
    "text": "Nikki Haley Explains Why ‘Insecure’ Trump Is His ‘Own Worst Enemy’  —  “When he feels insecure, he starts to rail, he starts to rant, he starts to flail his arms and he starts to get upset,” Haley said in a recent “Meet the Press” interview.  —  LOADING  —  Nikki Haley called Donald Trump his … ",
    "url": "https://www.huffpost.com/entry/nikki-haley-donald-trump-insecure_n_65b6a418e4b077c17ab5871f"
  },
  {
    "text": "Trump Cash Stockpile at Risk From $450 Million Dual Verdicts  — Damages from NY civil cases could cut 15% of Trump's net worth  — Likely Republican front-runner faces mounting legal bills  —  Donald Trump is facing a pair of major legal verdicts in New York that risk wiping out most … ",
    "url": "https://www.bloomberg.com/news/articles/2024-01-29/trump-s-cash-stockpile-at-risk-from-450-million-dual-verdicts"
  },
  {
    "text": "The second insurrection  —  “The Federal Government has broad constitutional powers in determining what aliens shall be admitted to the United States, the period they may remain, regulation of their conduct before naturalization, and the terms and conditions of their naturalization … ",
    "url": "https://popular.info/p/the-second-insurrection"
  },
  {
    "text": "Pelosi Wants F.B.I. to Investigate Pro-Palestinian Protesters  —  The former House speaker suggested without offering evidence that some protesters calling for a cease-fire in Gaza had financial ties to Russia and Vladimir V. Putin.  —  Representative Nancy Pelosi, Democrat of California … ",
    "url": "https://www.nytimes.com/2024/01/28/us/politics/nancy-pelosi-fbi-russia-gaza-protesters.html"
  },
  {
    "text": "Brussels threatens to hit Hungary's economy if Viktor Orbán vetoes Ukraine aid  —  EU strategy aims to spook investors by cutting off funding to Budapest in stand-off over €50bn package  —  The EU will sabotage Hungary's economy if Budapest blocks fresh aid to Ukraine at a summit this week … ",
    "url": "https://www.ft.com/content/9dabcd4b-9c64-4124-9f9c-b0c898c84c8f"
  },
  {
    "text": "Dems make early ad reservations in key Senate races  —  Senate Majority PAC is booking early to lock in lower rates in Montana and Nevada, two states that are crucial to a brutal Senate map.  —  The Senate TV ad wars are beginning.  —  Senate Majority PAC, Democrats' largest outside group focused … ",
    "url": "https://www.politico.com/news/2024/01/29/democratic-2024-senate-tv-ad-reservations-montana-nevada-00138184"
  },
  {
    "text": "Quiet rebellion threatens House GOP chair over surprise tax deal  —  The House GOP's top tax writer doesn't just face blowback over the surprise deal he unveiled this month: Now the background chatter suggests Rep. Jason Smith (R-Mo.) could lose his gavel.",
    "url": "https://www.axios.com/2024/01/28/ways-means-jason-smith-vern-buchanan-tax-deal"
  },
  {
    "text": "Climate activists hurl soup at the Mona Lisa at the Louvre Museum in Paris  —  Two protesters from a climate and agricultural NGO hurled soup onto the bulletproof glass protecting Leonardo da Vinci's “Mona Lisa” painting in Paris, demanding the right to “healthy and sustainable food”.  —  By: FRANCE 24",
    "url": "https://www.france24.com/en/france/20240128-activists-hurl-soup-on-glass-protected-mona-lisa-at-paris-s-louvre-museum"
  },
  {
    "text": "Biden marks 15th anniversary of landmark pay equity law  —  President Joe Biden is marking the 15th anniversary of a landmark pay equity law with new steps to tackle persistent gaps in pay for federal government employees and those who work for federal contractors",
    "url": "https://abcnews.go.com/Business/wireStory/biden-marking-15th-anniversary-landmark-pay-equity-law-106755591"
  }
]