[
  {
    "text": "Ruling Against Trump Cuts to the Heart of His Identity  —  The finding by a judge in a New York civil case that Donald Trump committed fraud in valuing his real estate properties undermined the narrative of the business career that launched him in politics.  —  Nearly every aspect … ",
    "url": "https://www.nytimes.com/2023/09/27/us/politics/trump-fraud-ruling.html"
  },
  {
    "text": "How much would your house be worth if the Trump Organization owned it?  —  A year offering no shortage of bad news for Donald Trump outdid itself Tuesday afternoon, with New York Supreme Court Justice Arthur Engoron ruling that the former president's namesake business, the Trump Organization … ",
    "url": "https://www.washingtonpost.com/politics/2023/09/27/trump-property-inflated-values/"
  },
  {
    "text": "Judge Gives Trump Organization the Corporate Death Penalty  —  Donald Trump is no longer in business.  —  Worse, the self-proclaimed multibillionaire may soon be personally bankrupt as a result, stripped of just about everything because for years he engaged in calculated bank fraud … ",
    "url": "https://www.dcreport.org/2023/09/26/donald-trump-liable-for-fraud/"
  },
  {
    "text": "The Republican debate is fake  —  With Trump dominating the GOP primary, the debate is a cosplay of a competitive election — and a distraction from an ugly truth.  —  Tonight's Republican primary debate is not a real event.  It is a performance, a show, a pantomime: a shiny object … ",
    "url": "https://www.vox.com/2024-elections/2023/9/27/23890683/second-republican-debate-gop-fake-rnc-trump"
  },
  {
    "text": "McCarthy's new shutdown strategy: Shifting the blame  —  Good morning, Early Birds.  The New York Times's Vanessa Friedman says it's “a cliché” to wear a Patagonia fleece vest in the office if you don't work in outdoor recreation — but it's so cold in The Post's newsroom.  What's a man to do?",
    "url": "https://www.washingtonpost.com/politics/2023/09/27/mccarthys-new-shutdown-strategy-shifting-blame/"
  },
  {
    "text": "McCarthy told conference he won't allow vote on Senate stopgap: GOP lawmakers  —  Speaker Kevin McCarthy (R-Calif.) told members of the House GOP conference Wednesday morning that he will not bring the Senate's bipartisan continuing resolution to the floor for a vote.",
    "url": "https://thehill.com/homenews/house/4225849-mccarthy-told-conference-he-wont-allow-vote-on-senate-stopgap-gop-lawmakers/"
  },
  {
    "text": "Biden tops Trump by 5 points in new survey  —  President Biden tops former President Trump by 5 points among registered voters in a 2024 hypothetical matchup, new polling shows.  —  Asked who they'd back if Trump and Biden were their respective party's nominees, 45 percent of registered voters … ",
    "url": "https://thehill.com/homenews/campaign/4225778-biden-tops-trump-by-5-points-in-new-survey/"
  },
  {
    "text": "President Drink Bleach says what?  Trump now claims he beat George W. Bush and Barack Obama  —  The press should cover his decline anyway  —  Donald Trump is skipping another GOP primary debate this week and the theories abound as to why.  Some paint it as a smart strategy … ",
    "url": "https://www.salon.com/2023/09/27/drink-bleach-says-what-now-claims-he-beat-george-w-bush-and-barack-obama/"
  },
  {
    "text": "Poll: Republicans see Trump as a ‘person of faith’ ... more so than Mitt Romney, Mike Pence and others  —  Sen. Mitt Romney tops the list for independents, while more Democrats say President Biden is a man of faith  —  More than half of Republicans see former President Donald Trump as a person of faith … ",
    "url": "https://www.deseret.com/2023/9/26/23891360/trump-biden-man-of-faith-religious-mitt-romney-vivek-ramaswamy"
  },
  {
    "text": "Virginia Republican Gov. Youngkin Says He Does Not Plan to Endorse GOP Presidential Candidate  —  Youngkin also voiced his opinions on the issue of age and its impact on the presidency and election  —  A Facebook icon representing an external link to share the article on Facebook … ",
    "url": "https://themessenger.com/politics/virginia-republican-gov-youngkin-says-he-does-not-plan-to-endorse-gop-presidential-candidate"
  },
  {
    "text": "US secures the release of the soldier who crossed into North Korea 2 months ago  —  The U.S. has secured the release of a U.S. soldier who sprinted across a heavily fortified border into North Korea more than two months ago, the White House announced Wednesday.  U.S. ally Sweden and rival China helped with the transfer.",
    "url": "https://apnews.com/article/north-korea-us-soldier-travis-king-00c171778e378d95fe1115fe31612ec2"
  },
  {
    "text": "Menendez ordered to turn over personal passport at arraignment  —  Sen. Bob Menendez (D-N.J.), who pleaded not guilty to federal bribery charges Wednesday, must turn over his personal passport as a condition for his release, multiple reports indicated following the senator's arraignment in Manhattan.",
    "url": "https://thehill.com/regulation/court-battles/4225703-menendez-ordered-to-turn-over-personal-passport-at-arraignment/"
  },
  {
    "text": "Target says it will close nine stores in major cities, citing violence and theft  — Target said it will close nine stores across the country after struggling with crime and safety threats at those locations.  — Target, which has nearly 2,000 stores in the U.S., has been outspoken … ",
    "url": "https://www.cnbc.com/2023/09/26/target-says-it-will-close-nine-stores-citing-violence-and-theft-.html"
  },
  {
    "text": "Tuberville says he opposed Joint Chiefs chair over ‘equal opportunity’ push  —  Alabama Sen. Tommy Tuberville (R) said he voted against the nomination of the Pentagon's next Joint Chiefs of Staff chairman over the military officer's push to promote “woke policies.”",
    "url": "https://thehill.com/policy/defense/4225842-tuberville-says-he-opposed-joint-chiefs-chair-over-equal-opportunity-push/"
  },
  {
    "text": "FCC chair proposes reinstating Obama-era net neutrality rules  —  Federal Communications Commission (FCC) Chairwoman Jessica Rosenworcel said on Tuesday that she plans to put forward a proposal to reinstate net neutrality rules that were repealed under former President Trump.",
    "url": "https://thehill.com/policy/technology/4224200-fcc-chair-proposes-reinstating-obama-era-net-neutrality-rules/"
  },
  {
    "text": "The Quotable Milley: The chair's most memorable lines from the past four years  —  From white rage to Ukraine to the need for haircuts, Gen. Mark Milley hasn't been shy about giving his opinion.  —  If there is one military officer the average American can name, it is Gen. Mark Milley … ",
    "url": "https://www.politico.com/news/2023/09/27/mark-milley-quotes-ukraine-00117971"
  },
  {
    "text": "“They've already succeeded”: Will Bunch on the GOP's impeachment clown show  —  They don't have evidence.  But they don't need any for their purposes.  —  ∙ Paid … As House Republicans turn the impeachment process into a joke with their evidence-free Joe Biden fishing expedition … ",
    "url": "https://www.publicnotice.co/p/biden-impeachment-inquiry-explained-will-bunch"
  },
  {
    "text": "Unraveling what's really happening in Florida school libraries  —  On Tuesday, Popular Information reported that librarians in Charlotte County, Florida, were instructed by the school district superintendent to remove all books with LGBTQ characters.  This story was based on a document dated July 24 … ",
    "url": "https://popular.info/p/update-unraveling-whats-really-happening"
  }
]