[
  {
    "text": "144. The Supreme Court's Late-Night Alien Enemy Act Intervention  —  Welcome back to “One First,” an (increasingly frequent) newsletter that aims to make the U.S. Supreme Court more accessible to all of us.  If you're not already a subscriber, I hope you'll consider becoming one (and … ",
    "url": "https://www.stevevladeck.com/p/144-the-supreme-courts-late-night"
  },
  {
    "text": "Supreme Court blocks Alien Enemies Act deportation of Venezuelan men  —  The Trump administration was planning to deport at least 30 Venezuelan men under a rarely invoked wartime statute before the court ruled to temporarily halt it.  —  The U.S. Supreme Court ordered the Trump administration early Saturday … ",
    "url": "https://www.washingtonpost.com/immigration/2025/04/18/aclu-alien-enemies-deportations-trump/"
  },
  {
    "text": "US Supreme Court temporarily halts deportations of Venezuelan migrants under wartime law  —  The U.S. Supreme Court early on Saturday paused President Donald Trump's administration from deporting Venezuelan men in immigration custody after their lawyers said they were at imminent risk … ",
    "url": "https://www.usatoday.com/story/news/politics/2025/04/19/supreme-court-halts-deportations-venezuelan-migrans/83171290007/"
  },
  {
    "text": "Supreme Court orders Trump administration not to deport Venezuelans under Alien Enemies Act for now  —  The justices said no action should be taken to pursue the deportations of any alleged Venezuelan gang members in Texas under the rarely used wartime law.  —  WASHINGTON — The Supreme Court … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-orders-trump-administration-not-deport-venezuelans-now-rcna201949"
  },
  {
    "text": "Trump Officials Blame Mistake for Setting Off Confrontation With Harvard  —  An official on the administration's antisemitism task force told the university that a letter of demands had been sent without authorization.  —  Harvard University received an emailed letter from the Trump administration … ",
    "url": "https://www.nytimes.com/2025/04/18/business/trump-harvard-letter-mistake.html?unlocked_article_code=1.A08.Qu-Z.-WTNuuYLOA1n&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Three Ways Abrego Garcia's Rights Violated — Two of Which the Government Admits  —  As the controversy over the deportation of Kilmar Abrego Garcia from Maryland to El Salvador has raged, the Trump administration has sought to focus the public's attention on Abrego Garcia's alleged membership in MS-13, a violent international gang.",
    "url": "https://www.justsecurity.org/110658/three-ways-abrego-garcias-rights-violated-two-of-which-the-government-admits/"
  },
  {
    "text": "Trump Advisers Took Advantage of Navarro's Absence to Push for Tariff Pause  —  Peter Navarro, an adviser to Trump in favor of wide-ranging tariffs, had been a fixture on the president's side after ‘Liberation Day’  —  They needed to get the president alone.  —  On April 9, financial markets were going haywire.",
    "url": "https://www.wsj.com/politics/policy/trump-tariff-pause-navarro-bessent-lutnick-b9e864fb?st=44RMeA&reflink=article_copyURL_share"
  },
  {
    "text": "Acting IRS leader replaced after 3 days as senior DOGE official loses access  —  Deputy Treasury Secretary Michael Faulkender will replace Gary Shapley as acting IRS commissioner amid disputes over the U.S. DOGE Service's role at the tax agency.  —  President Donald Trump replaced acting … ",
    "url": "https://www.washingtonpost.com/business/2025/04/18/irs-shapley-bessent-musk/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ0OTQ4ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ2MzMxMTk5LCJpYXQiOjE3NDQ5NDg4MDAsImp0aSI6IjI0YzMyYTRmLWE0YTItNGZiNC04YzdkLWU4OTIyOGVhZmU1MyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9idXNpbmVzcy8yMDI1LzA0LzE4L2lycy1zaGFwbGV5LWJlc3NlbnQtbXVzay8ifQ.fIkJ3Pe3AUi8LlCdQRWO8GxMekDIPG3HM-F5j1xzcYk&itid=gfta"
  },
  {
    "text": "Pentagon turmoil deepens: Top Hegseth aide leaves post  —  Other Defense Department officials were placed on leave earlier this week.  —  Joe Kasper, Defense Secretary Pete Hegseth's chief of staff will leave his role in the coming days for a new position at the agency … ",
    "url": "https://www.politico.com/news/2025/04/18/defense-secretary-chief-of-staff-joe-kasper-departure-00299508"
  },
  {
    "text": "DEI rollbacks hit campus support systems for students of color  —  Campus mentors.  Move-in events.  Scholarships.  Diversity offices that made them feel welcome on predominantly white campuses.  —  As U.S. colleges pull back on diversity, equity and inclusion practices … ",
    "url": "https://apnews.com/article/dei-diversity-equity-inclusion-college-bbe09c081d8a47fcb5616c8fa3b23cee"
  },
  {
    "text": "BYU doctorate student's visa reinstated after unexpected revocation  —  SALT LAKE CITY — A Japanese doctorate student at Brigham Young University will now be able to stay in the U.S. after his visa was revoked earlier this month.  —  BYU student Suguru Onda is a year away from finishing his doctorate.",
    "url": "https://kslnewsradio.com/shows-podcasts/jeff-caplans-afternoon-news/visa-byu-student/2204681/"
  },
  {
    "text": "Senator Says Abrego Garcia Was Denied Phone Call During Deportation  —  About three kilometers outside of CECOT, we were pulled over by soldiers.  You could see the rest of the traffic was allowed to go by.  We were pulled over by soldiers and told that we were not allowed to proceed any farther.",
    "url": "https://www.nytimes.com/live/2025/04/18/us/trump-news?unlocked_article_code=1.A08.sAdq.C-M5H1WjPksh&smid=url-share"
  },
  {
    "text": "The Lever Cometh For Trump's Taxman  —  It's a long shot for Billy Long, the Google-opoly comes crumbling down, Chicago teachers ace a big test, attorneys stand up against Trump's legal bullying, and immigrants score a reprieve.  —  This full story is for paid subscribers.  —  Select Your Paid Subscription",
    "url": "https://www.levernews.com/you-love-to-see-it-the-lever-comes-for-trumps-taxman/"
  },
  {
    "text": "Trump-Allied Prosecutor Sends Letters to Medical Journals Alleging Bias  —  An interim U.S. attorney is demanding information about the selection of research articles and the role of N.I.H. Experts worry this will have a chilling effect on publications.  —  A federal prosecutor has sent letters … ",
    "url": "https://www.nytimes.com/2025/04/18/health/trump-martin-us-attorney-medical-journals.html?unlocked_article_code=1.Ak8.EMaq.FgyJDGc6D7I_&smid=url-share"
  },
  {
    "text": "The Naval Academy Thinks Midshipmen Can't Handle the Truth  —  For the past four years, I have been delivering a series of lectures on the virtues of Stoicism to midshipmen at the U.S. Naval Academy in Annapolis, Md., and I was supposed to continue this on April 14 to the entire sophomore class on the theme of wisdom.",
    "url": "https://www.nytimes.com/2025/04/19/opinion/naval-academy-speech-censorship.html?unlocked_article_code=1.A08.AsS5.lY2qmISxh4bo&smid=nytcore-ios-share&referringSource=articleShare&sgrp=c-cb"
  },
  {
    "text": "DOGE Is Building a Master Database to Surveil and Track Immigrants  —  DOGE is knitting together data from the Department of Homeland Security, Social Security Administration, and IRS that could create a surveillance tool of unprecedented scope.  —  Operatives from Elon Musk's so-called Department … ",
    "url": "https://www.wired.com/story/doge-collecting-immigrant-data-surveil-track/"
  },
  {
    "text": "Why is no one talking about the millions of Americans the House GOP wants to uninsure?  —  Let's say you're a House Republican in a losable district.  And you're also a member of the smallest House majority in a century.  How do you announce that you're planning on uninsuring millions … ",
    "url": "https://www.thefarce.org/why-is-no-one-talking-about-the-millions-of-americans-the-house-gop-wants-to-uninsure/"
  },
  {
    "text": "The Next Terrorist Attack  —  Thirty years ago today, I was driving a moving van across the country, from the west coast to the east.  The hold was packed well; the ride was wobbly, and I kept the heavy vehicle between the lines, mile after mile.  Driving carefully, I was surprised to be stopped by state troopers.",
    "url": "https://snyder.substack.com/p/the-next-terrorist-attack"
  },
  {
    "text": "The Women Who Think the World Needs More Babies  —  At a convention of the pronatalist movement, the relatively few women in attendance agreed: Motherhood needs a rebrand.  —  “We're going to fix the birthrate decline in this room,” said the dating app entrepreneur Amanda Bradford … ",
    "url": "https://www.nytimes.com/2025/04/17/style/women-pronatalist-movement.html?unlocked_article_code=1.Ak8.FsEx.EXozGCYjEktU&smid=url-share"
  },
  {
    "text": "Trump administration may form task force to handle China tariff impact  —  Trump administration officials, anticipating supply chain strains due to steep tariffs on Chinese goods, have discussed forming a working group to deal with the problems with urgency if there's no breakthrough with Beijing, multiple sources told CBS News.",
    "url": "https://www.cbsnews.com/news/trump-administration-china-tariff-task-force/"
  },
  {
    "text": "DHS Releases Bombshell Investigative Report on Kilmar Abrego Garcia Suspected Human Trafficking Incident  —  WASHINGTON - Today, the Department of Homeland Security released a Homeland Security Investigations' Combined Intelligence Unit (CIU) Investigative Referral report on Kilmar Abrego Garcia.",
    "url": "https://www.dhs.gov/news/2025/04/18/dhs-releases-bombshell-investigative-report-kilmar-abrego-garcia-suspected-human"
  },
  {
    "text": "More than 400 anti-Trump rallies planned in another wave of US protests  —  Organizers have called for 11 million people across country to participate this weekend in effort to ‘protect democracy’  —  The US will witness its second wave of protests in a fortnight on Saturday as organizers seek … ",
    "url": "https://www.theguardian.com/us-news/2025/apr/19/anti-trump-rallies-protests"
  },
  {
    "text": "Trump Just Scrapped My Anti-Kremlin Streaming Platform  —  The Trump administration's decision to take a hammer to the funding for Radio Free Europe/Radio Liberty might be legally dubious, but politically pretty safe: Its programming wasn't intended to reach American audiences, so who would miss it, really?",
    "url": "https://www.nytimes.com/2025/04/19/opinion/trump-defund-votvot-kremlin-russia.html"
  },
  {
    "text": "J.K. Rowling's war on trans people won't stop us from existing  —  The world has always had trans people, and always will.  —  On Wednesday morning, my social feeds showed me two stark reactions to a historic rolling back of trans rights in the United Kingdom.",
    "url": "https://www.msnbc.com/opinion/msnbc-opinion/jk-rowling-uk-trans-women-ruling-rcna201947"
  },
  {
    "text": "Trump moves to invoke Schedule F to make it easier to fire some federal workers  —  President Donald Trump has begun making one of the controversial personnel changes for government employees that was spelled out in the conservative Project 2025 blueprint for his second term.",
    "url": "https://apnews.com/article/donald-trump-civil-service-workforce-e6e4cf979b910b0f89877a9a09e7c4a4"
  },
  {
    "text": "Vatican notes ‘exchange of opinions’ over migrants, prisoners in meeting with Vance  —  U.S. Vice President JD Vance met Saturday with the Vatican's No. 2 official amid tensions over the U.S. crackdown on migrants, with the Holy See reaffirming good relations but noting “an exchange of opinions” … ",
    "url": "https://apnews.com/article/vatican-vance-pope-migration-a91d0f741cb994faae1e363d38b66c05"
  }
]