[
  {
    "text": "Government shutdown hours away as House GOP pitches last-ditch deal  —  Just hours before a government shutdown, the House planned to vote on a measure to keep the government open for 45 days at current spending levels, adding money for U.S. disaster relief but none of the billions of dollars … ",
    "url": "https://www.washingtonpost.com/politics/2023/09/30/government-shutdown-updates/"
  },
  {
    "text": "News Analysis: Kevin McCarthy may avoid a shutdown.  But the fiasco shows he's weaker than ever  —  Kevin McCarthy's struggle to become House speaker should have been the most embarrassing moment in his political career.  The U.S. House of Representatives had to vote 15 times before he was able … ",
    "url": "https://www.latimes.com/politics/story/2023-09-30/government-shutdown-shows-kevin-mccarthy-weaker-than-ever"
  },
  {
    "text": "McConnell announces Senate Republicans will defer to House spending bill  —  Senate Minority Leader Mitch McConnell (R-Ky.) announced Senate Republicans will vote against advancing the chamber's bipartisan stopgap spending bill as members see an emerging bill coming from the House as the main way to avoid a government shutdown.",
    "url": "https://thehill.com/homenews/senate/4231910-mcconnell-announces-senate-republicans-wont-let-bipartisan-spending-bill-advance/"
  },
  {
    "text": "‘It is a surrender’: Why McCarthy reversed with his survival uncertain  —  After Saturday's shocking vote, the speaker all but taunted his critics to come after his gavel if they wanted to.  —  When he walked into the Capitol on Saturday, Speaker Kevin McCarthy knew exactly what he'd do to stave off … ",
    "url": "https://www.politico.com/news/2023/09/30/kevin-mccarthy-government-shutdown-deal-00119290"
  },
  {
    "text": "McCarthy compares Rep. Jamaal Bowman pulling a fire alarm to Jan. 6 rioters  —  The fire alarm, which Bowman's office suggested was unintentional, came as Democrats were trying to delay a vote after Republicans rushed to pass the stopgap measure.  —  Rep. Jamal Bowman allegedly pulls fire alarm in House building",
    "url": "https://www.nbcnews.com/politics/congress/jamaal-bowman-pulled-fire-alarm-rcna118230"
  },
  {
    "text": "Rep. Bowman pulled House fire alarm amid vote chaos  —  The New York Democratic lawmaker has not immediately responded to a request for comment.",
    "url": "https://www.politico.com/live-updates/2023/09/30/congress/bowman-didnt-start-the-fire-00119278"
  },
  {
    "text": "Elon Musk crosses the border to Nazi  —  He's blown past blatant antisemitism and is now aligning with Jew-hating, right wing Germans.  What else would you call that?  —  On Thursday I posted on Bluesky that it's been a quiet week for the Jews, and that turned out to be a mistake.",
    "url": "https://thehandbasket.substack.com/p/elon-musk-crosses-the-border-to-nazi"
  },
  {
    "text": "House GOP stunner: Spending patch passes with mostly Dem votes  —  “We're tired of f—king around with these whack jobs,” one House Republican said as Kevin McCarthy risked a far-right rebellion aimed at taking his gavel.",
    "url": "https://www.politico.com/live-updates/2023/09/30/congress/stopgap-passes-00119280"
  },
  {
    "text": "Squabbles, missteps and failure to govern: The Republican week that was  —  Republicans offered a kaleidoscopic display of self-inflicted wounds by politicians unwilling to govern responsibly and loath to confront the damage done by Donald Trump  —  There are good weeks and bad weeks … ",
    "url": "https://www.washingtonpost.com/politics/2023/09/30/republican-shutdown-trump-missteps/"
  },
  {
    "text": "DeSantis Super PAC Cuts Back Iowa, New Hampshire TV Ads in Shift  — DeSantis trails Trump by smaller margin in early-voting states  —  Never Back Down, the super PAC supporting Florida Governor Ron DeSantis's presidential bid, cut more than $530,000 in reserved time on broadcast television stations … ",
    "url": "https://www.bloomberg.com/news/articles/2023-09-30/desantis-super-pac-cuts-back-iowa-new-hampshire-tv-ads-in-shift"
  },
  {
    "text": "The MAGAmerican dream lives in Sarasota  —  On Florida's Gulf Coast, a loose coalition of activists, officials and Trumpworld celebrities is building the world they want to live in  —  There are a few ways to enter Sarasota County's modern conservative paradise, but Vic Mellor led me in through what he calls “the cave of doom.”",
    "url": "https://www.washingtonpost.com/style/power/interactive/2023/sarasota-maga-dream/"
  },
  {
    "text": "Pregnant with no OB-GYNs around: In Idaho, maternity care became a casualty of its abortion ban  —  After an Idaho hospital closed its obstetrics department, pregnant women in the county have been left without nearby care.  Their OB-GYNs fled the state.  —  If you're pregnant in Bonner County … ",
    "url": "https://www.nbcnews.com/health/womens-health/pregnant-women-struggle-find-care-idaho-abortion-ban-rcna117872"
  },
  {
    "text": "‘No enemies to the right’: DeSantis ally hosts debate hedging white nationalism  —  Christopher Rufo's Twitter space discussed conservatives cooperating with extremists ‘to destroy the power of the left’  —  Conservative activist Christopher Rufo, who is a close ally of Florida governor … ",
    "url": "https://www.theguardian.com/world/2023/sep/30/conservative-christopher-rufo-florida-twitter-debate"
  },
  {
    "text": "The Trump administration touted him as a victim of #MeToo.  Now he's accused of dismembering a girlfriend  —  The gruesome discovery spoke to a ghastly crime.  —  On the afternoon of July 20, someone using a waterfront trail in Alameda spotted a large garbage bag wrapped in duct tape … ",
    "url": "https://www.sfchronicle.com/bayarea/article/alameda-murder-joseph-roberts-18380333.php"
  }
]