[
  {
    "text": "9/12/23 ☀️ Punchbowl News AM  —  THE TOP … McCarthy and the House Republican leadership scheduled a closed-door session for Thursday morning so that members could get an update on the investigations led by House Judiciary Committee Chair Jim Jordan (R-Ohio) and House Oversight Committee Chair Jamie Comer (R-Ky.).",
    "url": "https://punchbowl.news/archive/91223-punchbowl-news-am/"
  },
  {
    "text": "Kevin McCarthy announces House will begin an impeachment inquiry into Biden  —  “This logical next step will give our committees the full power to gather all the facts and answers for the American public is exactly what we want to know the answers,” he said.  —  McCarthy endorses Biden impeachment inquiry",
    "url": "https://www.nbcnews.com/politics/joe-biden/kevin-mccarthy-plans-formally-endorse-impeachment-inquiry-biden-rcna104585"
  },
  {
    "text": "Playbook PM: McCarthy launches Biden impeachment inquiry  —  IMPEACHMENT RETURNS — Speaker KEVIN McCARTHY today announced the historic decision to open an impeachment inquiry into President JOE BIDEN over allegations of bribery and corruption that so far have not been backed up by public evidence.",
    "url": "https://www.politico.com/newsletters/playbook-pm/2023/09/12/mccarthy-launches-biden-impeachment-inquiry-00115288"
  },
  {
    "text": "GOP lawmaker faces blowback from Republicans over anti-impeachment stance  —  Conservative Rep. Ken Buck is just one of several House Republicans standing in the way of the right's push to impeach President Joe Biden.  —  But his high-profile seat on the key House Judiciary Committee … ",
    "url": "https://www.cnn.com/2023/09/12/politics/ken-buck-impeachment-stance/"
  },
  {
    "text": "Kevin McCarthy directs House to open impeachment inquiry into Biden  —  House Speaker Kevin McCarthy (R-Calif.) said Tuesday he is directing House committees to open an impeachment inquiry into President Biden, amid pressure from some hard-right members of the Republican caucus to do so.",
    "url": "https://www.washingtonpost.com/politics/2023/09/12/mccarthy-biden-impeachment/"
  },
  {
    "text": "Biden impeachment inquiry gives White House a fight it's ready for  — The White House last year began hiring on a team to rebuff anticipated congressional inquiries into the president and his son when the party retook control of the House after the midterms.",
    "url": "https://www.cnbc.com/2023/09/12/house-impeachment-inquiry-gives-white-house-a-fight-its-ready-for-.html"
  },
  {
    "text": "Playbook: The clash that will set the tone for September  —  Presented by With help from Eli Okun and Garrett Ross  —  DRIVING THE DAY  —  JUST POSTED — WaPo's Ben Terris takes a deep dive into Sen. TIM SCOTT's love life, a subject that has become something of a thing for the 57-year-old bachelor … ",
    "url": "https://www.politico.com/newsletters/playbook/2023/09/12/the-clash-that-will-set-the-tone-for-september-00115180"
  },
  {
    "text": "Income, Poverty and Health Insurance Coverage in the United States: 2022  —  SEPT. 12, 2023 — The U.S. Census Bureau announced today that real median household income in 2022 fell in comparison to 2021.  The official poverty rate of 11.5% was not statistically different between 2021 and 2022.",
    "url": "https://www.census.gov/newsroom/press-releases/2023/income-poverty-health-insurance-coverage.html"
  },
  {
    "text": "Trump faces another 14th Amendment candidacy challenge, this time in Minnesota  —  A liberal group filed a lawsuit Tuesday to block former President Donald Trump from the 2024 presidential ballot in Minnesota, the second major lawsuit in two weeks that hopes to invoke the 14th Amendment's arcane “insurrectionist ban.”",
    "url": "https://www.cnn.com/2023/09/12/politics/minnesota-trump-14th-amendment-lawsuit/"
  },
  {
    "text": "Tim Scott's girlfriend … In June, as Sen. Tim Scott (R-S.C.) began to get a little momentum in the presidential primary, a person working on behalf of one of Scott's Republican opponents messaged me, asking to chat.  —  “Have you seen the video,” he asked over the phone, conspiratorially, “where he says he has a girlfriend?”",
    "url": "https://www.washingtonpost.com/style/2023/09/12/tim-scott-girlfriend-republican-presidential-candidate/"
  },
  {
    "text": "Virginia election candidate responds after leak of tapes showing her performing sex acts with husband: “It won't silence me”  —  A candidate in a high-stakes legislative contest in Virginia had sex with her husband in live videos posted on a pornographic website and asked viewers to pay … ",
    "url": "https://www.cbsnews.com/news/susanna-gibson-candidate-responds-leak-tapes-sex-acts-husband-live-videos/"
  },
  {
    "text": "Iowa 2024: Biden and Trump Remain Frontrunners In Caucuses, But Both Losing Ground  —  Home Polls Iowa 2024: Biden and Trump Remain Frontrunners In Caucuses, But Both Losing Ground  —  Neither Party with Clear Alternatives to Frontrunners  —  A new Emerson College Polling survey … ",
    "url": "https://emersoncollegepolling.com/iowa-2024-biden-and-trump-remain-frontrunners-in-caucuses-but-both-losing-ground/"
  },
  {
    "text": "Elizabeth Warren Demands Probes of Elon Musk, SpaceX After Ukraine Revelations  — Warren calls on Pentagon to look into decision over attack  — Musk, other tech chiefs will meet with senators on Wednesday  —  Senator Elizabeth Warren is demanding an investigation into SpaceX … ",
    "url": "https://www.bloomberg.com/news/articles/2023-09-11/elizabeth-warren-demands-probes-of-elon-musk-spacex-after-ukraine-revelations"
  },
  {
    "text": "PRESS RELEASE 08 September 2023  —  *For Immediate Release*  —  The Covington Police Department and Tipton County Sheriff's Office are jointly investigating allegations of sexual misconduct involving a local teacher and multiple juveniles.  —  On 24 August 2023, the Covington Police Department … ",
    "url": "https://www.facebook.com/CovingtonPD.TN/posts/pfbid0Ej2sPXVfFtbjp1HNiSmqh4HgvCeVDxKZk7Gic7bv73aLcq5LZR3jVL82gzsFMTuTl"
  },
  {
    "text": "Book ban defenders use sex scenes to make their point at Senate hearing  —  A Senate Judiciary Committee hearing on book bans took a racy turn Tuesday, as Republican senators and a witness read scenes of various sexual content into the congressional record to defend the banning of multiple titles from U.S. schools.",
    "url": "https://thehill.com/homenews/education/4200011-book-ban-defenders-use-sex-scenes-to-make-their-point-at-senate-hearing/"
  },
  {
    "text": "Popular nasal decongestant doesn't actually relieve congestion, FDA advisers say  —  The leading decongestant used by millions of Americans looking for relief from a stuffy nose is likely no better than a dummy pill, according to government experts who reviewed the latest research on the long-questioned drug ingredient.",
    "url": "https://apnews.com/article/sudafed-decongestants-phenylephrine-pseudoephedrine-fda-0f140bafae9a500c5fba05fe764ecb66"
  },
  {
    "text": "Kemp declares state of emergency over inflation in Georgia  —  Georgia Gov. Brian Kemp (R) declared a state of emergency for the Peach State over inflation rates Tuesday.  —  “From runaway federal spending to policies that hamstring domestic energy production, all Bidenomics has done … ",
    "url": "https://thehill.com/homenews/state-watch/4200196-kemp-declares-state-of-emergency-over-inflation-in-georgia/"
  },
  {
    "text": "Mark Harris announces House bid after election fraud controversy  —  Harris, whose apparent 2018 victory was thrown out amid allegations of election fraud, is seeking to replace GOP Rep. Dan Bishop.  —  Republican Mark Harris announced on Tuesday that he will run for Congress in North Carolina … ",
    "url": "https://www.politico.com/news/2023/09/12/mark-harris-congress-run-north-carolina-00115218"
  },
  {
    "text": "InfoWars host Owen Shroyer sentenced to 60 days in Jan. 6 case  —  The conspiracy theorist was with Alex Jones on the grounds of the Capitol on Jan. 6, but never entered the building.  —  WASHINGTON — A host of the far-right media outlet InfoWars was sentenced Tuesday to 60 days in prison … ",
    "url": "https://www.nbcnews.com/politics/justice-department/infowars-host-owen-shroyer-sentenced-jan-6-case-rcna104378"
  },
  {
    "text": "Senile Joe Biden rambles about pony soldiers, Vietnam and lies about 9/11  —  In April 1968, after he had run through five draft deferments, a medical board determined Joe Biden was unfit to go to Vietnam.  —  Unfortunately, nobody stopped him this time.  —  The president … ",
    "url": "https://nypost.com/2023/09/11/senile-joe-biden-rambles-about-pony-soldiers-vietnam-and-lies-about-9-11/"
  },
  {
    "text": "Proud Boys leader Tarrio says prosecutors pushed him to implicate Trump  —  After being sentenced to 22 years for seditious conspiracy, Tarrio said he met with government shortly before trial but no deal was cut  —  Before he went to trial on charges of seditious conspiracy and other counts related … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2023/09/12/tarrio-jan6-prosecutors-trump/"
  },
  {
    "text": "Whistleblower alleges CIA offered officials money to change view of COVID origins  —  FIRST ON FOX: A CIA whistleblower told Congress that the agency offered officials on a team investigating COVID-19 origins “significant monetary incentive” to change their positions, from that it originated … ",
    "url": "https://www.foxnews.com/politics/whistleblower-alleges-cia-offered-officials-significant-monetary-incentive-to-change-view-of-covid-origins"
  },
  {
    "text": "‘I just had another one’: How McConnell scrambled to protect his job after two freeze-ups  —  The GOP leader emerged from a tumultuous 10 days with his internal strength intact, according to interviews with more than a dozen senators.  —  Senate Minority Leader Mitch McConnell's apparent health problems … ",
    "url": "https://www.politico.com/news/2023/09/12/mitch-mcconnell-freezes-health-senate-job-00114686"
  }
]