[
  {
    "text": "3 Expert Shoemakers Say Ron DeSantis Is Probably Wearing Height Boosters  —  The internet has questions about the governor's boots.  So I asked the experts.  —  In the last few weeks, posts mocking Florida Gov. Ron DeSantis' strangely shaped cowboy boots have racked up millions of views … ",
    "url": "https://www.politico.com/news/magazine/2023/10/31/desantis-boots-shoemakers-00121044"
  },
  {
    "text": "Ron DeSantis Turns Down Chance To Squash Lifted Shoe Speculation  —  People have been trolling the Florida governor and GOP presidential candidate by claiming his signature cowboy boots have hidden heels.  —  LOADING  —  It looks like Florida Gov. Ron DeSantis can't sidestep ridiculous rumors about his height much longer.",
    "url": "https://www.huffpost.com/entry/ron-desantis-dismisses-heel-boot-rumor_n_65402831e4b0a78a26a470a8"
  },
  {
    "text": "Rep. Earl Blumenauer to retire after nearly three decades in Congress  —  Rep. Earl Blumenauer (D-Ore.), who has spent nearly three decades in Congress, announced Monday night that he does not plan to seek reelection next year.  —  “I have dedicated my career to creating livable communities … ",
    "url": "https://www.washingtonpost.com/politics/2023/10/31/earl-blumenauer-retirement-congress/"
  },
  {
    "text": "“It Was Always Going to End Badly”: The Untold Story of Tucker Carlson's Ugly Exit From Fox News  —  Fox never explained that abrupt firing of cable news' biggest star, allowing conspiracy theories to fester.  Now, in his new book, Network of Lies, Brian Stelter explores the myriad factors contributing to Carlson's cancellation.",
    "url": "https://www.vanityfair.com/news/2023/10/tucker-carlsons-ugly-exit-from-fox-news"
  },
  {
    "text": "Mike Johnson's Wife Takes Down Website That Compared Being Gay To Bestiality, Incest  —  HuffPost first reported on Kelly Johnson's counseling service that likens LGBTQ+ people to people who have sex with animals and family members.  —  LOADING  —  House Speaker Mike Johnson's wife took … ",
    "url": "https://www.huffpost.com/entry/mike-johnson-wife-website-homosexuality-bestiality-incest_n_653fd7a9e4b0ae2dc0b49d17"
  },
  {
    "text": "Hedge fund billionaire Leon Cooperman, in rare public rebuke of a Republican candidate, says Trump ‘belongs in jail’  —  New York CNN  —  Leon Cooperman, the hedge fund billionaire who has famously clashed with Sen. Elizabeth Warren over her proposed wealth tax, is cautioning voters … ",
    "url": "https://www.cnn.com/2023/10/30/investing/leon-cooperman-trump-biden/"
  },
  {
    "text": "Supreme Court weighs whether public officials can be sued for blocking critics on social media  —  The justices will decide a legal question that was never conclusively decided when then-President Donald Trump blocked critics on Twitter.  —  WASHINGTON — The Supreme Court is delving … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-weighs-whether-public-officials-can-sued-blocking-people-rcna122765"
  },
  {
    "text": "Why Doug Burgum Is Staying in a Race He Can Afford to Lose  —  With a substantial personal fortune, the North Dakota governor is insistent on spreading his message despite calls to drop out.  —  Gov. Doug Burgum of North Dakota knows that many people, including powerful voices in his own party … ",
    "url": "https://www.nytimes.com/2023/10/31/us/politics/doug-burgum-ads-spending.html"
  },
  {
    "text": "Donald Trump Jr. Says Prosecutors Want ‘The Death Penalty’ for His Father  —  Former President Trump does not face the death penalty in any of his criminal cases  —  Donald Trump Jr., the son of former President Donald Trump, on Monday slammed the legal cases against his father during … ",
    "url": "https://themessenger.com/politics/donald-trump-jr-says-prosecutors-want-the-death-penalty-for-his-father"
  },
  {
    "text": "America's Rifle Fetish Is Destroying Its Sense of Freedom  —  In Anthony Mann's 1950 western “Winchester '73,” a rare and much-desired Winchester rifle brings misery and death to the unlucky souls who manage to bring it into their possession.  In the West as brought to you by Mann … ",
    "url": "https://www.nytimes.com/2023/10/31/opinion/maine-mass-shooting-rifles-freedom.html"
  },
  {
    "text": "Executive Order on the Safe, Secure, and Trustworthy Development and Use of Artificial Intelligence  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered as follows:  —  Section 1.  Purpose.",
    "url": "https://www.whitehouse.gov/briefing-room/presidential-actions/2023/10/30/executive-order-on-the-safe-secure-and-trustworthy-development-and-use-of-artificial-intelligence/"
  },
  {
    "text": "Kinzinger says family disowned him over loss of Hannity's trust  —  Former Rep. Adam Kinzinger (R-Ill.) said he was disowned by his family after he left Congress and “lost the trust” of Fox News host Sean Hannity.  —  “So, I had family that sent a certified letter disowning me,” Kinzinger said in a CNN interview Monday.",
    "url": "https://thehill.com/homenews/4285023-adam-kinzinger-family-disowned-sean-hannity/"
  },
  {
    "text": "Harris had a contingency plan for campus protests over Israel  —  The vice president, like other Democrats, is feeling some heat from her base.  —  Former aides to Kamala Harris' 2020 presidential campaign are collecting signatures for a letter urging the vice president to “seek an immediate ceasefire” … ",
    "url": "https://www.politico.com/news/2023/10/31/harris-campaign-alums-want-her-to-call-israelis-gaza-campaign-a-genocide-00124410"
  },
  {
    "text": "Ex-North Dakota Lawmaker Accused Of Flying To Prague To Rape Minor  —  Ex-Republican state Sen. Ray Holmberg is facing federal charges for intent to rape a minor and receiving images depicting child sexual abuse.  —  A former longtime North Dakota lawmaker is charged with traveling to Prague … ",
    "url": "https://www.huffpost.com/entry/ap-us-former-legislator-indicted-north-dakota_n_653ff3dee4b0a78a26a44b60"
  },
  {
    "text": "Ivanka Trump Helped Her Dad Lie About His Net Worth  —  When Ivanka Trump takes the stand in her father's fraud case, she should have plenty to talk about.  —  Ivanka Trump is expected to testify on Friday in a $250 million fraud case that the New York attorney general is waging against her father and his associates.",
    "url": "https://www.forbes.com/sites/danalexander/2023/10/30/ivanka-trump-helped-her-dad-lie-about-his-net-worth/"
  },
  {
    "text": "‘This war is prophetically significant’: why US evangelical Christians support Israel  —  One strand of evangelical theology holds that the return of Jews to the region starts the clock ticking on a seven-year armageddon, after which Jesus Christ will return",
    "url": "https://www.theguardian.com/world/2023/oct/30/us-evangelical-christians-israel-hamas-war"
  },
  {
    "text": "White House shoots down GOP funding bills  —  The Big Story  —  Biden fires veto warning to House GOP on funding  —  The White House is threatening to veto House Republican funding bills as the party moves quickly to pass partisan spending plans.",
    "url": "https://thehill.com/newsletters/business-economy/4284280-white-house-shoots-down-gop-funding-bills/"
  },
  {
    "text": "Montenegro votes in new government with Milojko Spajic prime minister  —  After weeks of negotiations, Montenegro's parliament on Tuesday appointed a new government, a coalition of pro-European and pro-Serb parties expected to lead the small Balkan country in its bid to join the European Union.",
    "url": "https://www.reuters.com/world/europe/montenegro-votes-new-government-with-milojko-spajic-prime-minister-2023-10-31/"
  },
  {
    "text": "House Israel aid bill includes $14.3 billion by slashing IRS funds  —  The Israel aid package, which includes proposed cuts to President Joe Biden's signature Inflation Reduction Act, has not been well received by Democrats.  They “are already blasting newly minted Speaker Johnson for politicizing … ",
    "url": "https://www.nbcnews.com/meet-the-press/video/house-israel-aid-bill-includes-14-3-billion-by-slashing-irs-funds-196725317628"
  },
  {
    "text": "Donald Trump's Colorado ballot challenge trial begins with each side warning of an attack on democracy  —  Police officers testify about the Jan. 6 Capitol siege, while defense asks judge to recuse herself  —  A weeklong trial that could bar Donald Trump from appearing on Colorado's ballot kicked off Monday … ",
    "url": "https://www.denverpost.com/2023/10/30/donald-trump-14th-amendment-ballot-challenge-trial/"
  },
  {
    "text": "‘Medical emergency’ leads to another short-handed military post due to Tuberville protest  —  The nation's top Marine has been hospitalized due to a “medical emergency,” officials say, leaving a three-star ranked leader to take charge thanks to a stalled confirmation process led by Sen. Tommy Tubervile over the Corps' abortion policy.",
    "url": "https://www.rawstory.com/tommy-tuberville-marine-corps/"
  },
  {
    "text": "Alabama Pol Jailed for FaceTiming Witness in His Bribery Case  —  SORRY, WRONG NUMBER  —  An 82-year-old state lawmaker from Alabama was sent to jail on Monday for FaceTiming a witness—the founder of a gospel music non-profit he allegedly tried to bribe to lie to the FBI about a kickback scheme.",
    "url": "https://www.thedailybeast.com/alabama-rep-john-rogers-jailed-for-facetiming-witness-in-his-bribery-case"
  }
]