[
  {
    "text": "Republicans “stunned and disgusted” as Trump taps Matt Gaetz for AG … - “We wanted him out of the House ... this isn't what we were thinking,” quipped one House Republican, who spoke on the condition of anonymity to speak frankly about Trump's decision.",
    "url": "https://www.axios.com/2024/11/13/matt-gaetz-republicans-trump-attorney-general"
  },
  {
    "text": "No Matter How Bad You Think an Attorney General Matt Gaetz Would Be, He'll Be Worse  —  On Wednesday, Donald Trump announced his intent to nominate Republican Congressman Matthew Gaetz to lead the Department of Justice—the same agency that once investigated Gaetz for the sex trafficking of an underage girl.",
    "url": "https://slate.com/news-and-politics/2024/11/matt-gaetz-donald-trump-attorney-general-disaster.html"
  },
  {
    "text": "Gaetz resigns from Congress — possibly skirting long-awaited Ethics report  —  His resignation came the same day Donald Trump nominated him to be attorney general, but some Republicans think he had other motivations.  —  GOP Rep. Matt Gaetz resigned from the House Wednesday … ",
    "url": "https://www.politico.com/news/2024/11/13/matt-gaetz-resigns-congress-00189488"
  },
  {
    "text": "Donald Trump reveals exclusively to The Post what he and Biden spoke about at DC meeting  —  President-elect Donald Trump told The Post Wednesday that he and President Biden “both really enjoyed seeing each other” when they sat down for a historic post-election get-together in the Oval Office.",
    "url": "https://nypost.com/2024/11/13/us-news/donald-trump-reveals-what-he-and-biden-spoke-about-at-dc-meeting-really-enjoyed-seeing-each-other/"
  },
  {
    "text": "Trump picks Matt Gaetz for attorney general, Tulsi Gabbard for director of national intelligence  —  President-elect Donald Trump announced Wednesday that he plans to nominate Matt Gaetz as attorney general — the Republican congressman from Florida resigned his seat the same day … ",
    "url": "https://www.washingtonpost.com/politics/2024/11/13/trump-administration-transition/"
  },
  {
    "text": "A Foul Fireside Chat  —  It was such a cozy moment in the Oval Office on Wednesday morning, with the roaring fire and the warm handshake and the past presidents — including George Washington, Abraham Lincoln and F.D.R. — looking down benignly on the scene.  —  So why did it feel so nauseating?",
    "url": "https://www.nytimes.com/2024/11/13/opinion/a-foul-fireside-chat.html"
  },
  {
    "text": "Trump Chooses Tulsi Gabbard for Director of National Intelligence  —  Ms. Gabbard, a former congresswoman who left the Democratic Party, would hold a top job in the administration, overseeing 18 spy agencies.  —  President-elect Donald J. Trump on Wednesday chose Tulsi Gabbard … ",
    "url": "https://www.nytimes.com/2024/11/13/us/politics/trump-tulsi-gabbard-director-national-intelligence.html"
  },
  {
    "text": "Trump taps Matt Gaetz for attorney general  —  Gaetz's nomination was met with surprise from House lawmakers, where the Florida congressman had been the subject of an Ethics Committee investigation.  —  President-elect Trump on Wednesday announced Rep. Matt Gaetz, R-Fla. … ",
    "url": "https://www.foxnews.com/politics/trump-taps-matt-gaetz-attorney-general"
  },
  {
    "text": "Pete Hegseth Was Removed from Biden's Inauguration, Labeled ‘Extremist’  —  commentator who saw active service with the Minnesota National Guard, as his  —  .  —  Hegseth was one of a number of National Guard members ordered to stand down from  —  's inauguration, according to",
    "url": "https://www.newsweek.com/pete-hegseth-was-removed-bidens-inauguration-labelled-extremist-1984882"
  },
  {
    "text": "‘I made a mistake’: House Foreign Affairs chief detained by airport police for appearing intoxicated  —  The Scoop  —  House Foreign Affairs Committee Chair Michael McCaul was detained by police at Dulles International Airport earlier this month in an incident that he described as … ",
    "url": "https://www.semafor.com/article/11/13/2024/house-foreign-affairs-chief-detained-by-airport-police"
  },
  {
    "text": "Jeffries tells House Democrats he owns 2024 election loss … - Several also said they wanted Jeffries - who, until Wednesday, had maintained that Democrats still had a realistic shot at winning a majority - to acknowledge the party is on track to fall short of that goal.",
    "url": "https://www.axios.com/2024/11/13/hakeem-jeffries-2024-election"
  },
  {
    "text": "Why the Guardian is no longer posting on X  —  We will stop posting from our official editorial accounts on the platform, but X users can still share our articles  —  We wanted to let readers know that we will no longer post on any official Guardian editorial accounts on the social media site X (formerly Twitter).",
    "url": "https://www.theguardian.com/media/2024/nov/13/why-the-guardian-is-no-longer-posting-on-x"
  },
  {
    "text": "House Republicans strike deal to make it harder to oust Speaker  —  Hard-line conservatives have struck a tentative deal with House Republicans concerned about chaos in the chamber, agreeing to raise the threshold to force a vote to oust the Speaker in exchange for concessions on rule changes … ",
    "url": "https://thehill.com/homenews/house/4989395-republicans-oust-speaker-motion-to-vacate-deal/"
  },
  {
    "text": "Kamala Harris ditched Joe Rogan podcast interview over progressive backlash fears  —  Decision seen as major blunder for campaign that lost male votes to Donald Trump  —  Kamala Harris's fears of a progressive backlash killed a plan for her to appear on Joe Rogan's podcast … ",
    "url": "https://www.ft.com/content/9292db59-8291-4507-8d86-f8d4788da467"
  },
  {
    "text": "Jack Smith Plans to Step Down as Special Counsel Before Trump Takes Office  —  The prosecutor who investigated and charged Donald J. Trump plans to finish his report and leave the job before he can be fired.  —  Jack Smith, the special counsel who pursued two federal prosecutions of Donald J. Trump … ",
    "url": "https://www.nytimes.com/2024/11/13/us/politics/jack-smith-special-counsel.html"
  },
  {
    "text": "Trump's win turns online censorship case upside-down  —  with research by Andrea Jiménez and Aaron Schaffer  —  The Washington Post's essential guide to tech policy news  —  Happy Wednesday!  Hope you weren't counting on snow this winter.  Send news tips to: will.oremus@washpost.com.",
    "url": "https://www.washingtonpost.com/politics/2024/11/13/missouri-v-biden-social-media-censorship-trump/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzMxNDc0MDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzMyODU2Mzk5LCJpYXQiOjE3MzE0NzQwMDAsImp0aSI6ImMzMWI1NjE5LTJmM2QtNGMzMS1hZDUwLTQ3YzBlMjM5NmJmZiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzExLzEzL21pc3NvdXJpLXYtYmlkZW4tc29jaWFsLW1lZGlhLWNlbnNvcnNoaXAtdHJ1bXAvIn0.aTRy7GvfKitYqPD6b4jCq_fvevDxod_UDXpAWKwabCY&itid=gfta"
  },
  {
    "text": "Transcript: Paul Krugman on How Badly Trump Voters Have Been Scammed  —  The following is a lightly edited transcript of the November 13 episode of the Daily Blast podcast.  Listen to it here.  —  Greg Sargent: This is The Daily Blast from The New Republic, produced and presented by the DSR network.",
    "url": "https://newrepublic.com/article/188346/transcript-paul-krugman-badly-trump-voters-scammed"
  },
  {
    "text": "Republicans suddenly feel good about the economy  —  Republicans are feeling positive about the economy for the first time in four years, while the Democratic vibes have plunged, per new data from Morning Consult.  —  Why it matters: Consumer sentiment used to reflect current economic conditions … ",
    "url": "https://www.axios.com/2024/11/13/consumer-sentiment-republican-democrat-switch"
  },
  {
    "text": "Mississippi Voters Retire GOP-Backed Supreme Court Justice Who Voted to Kill Ballot-Initiative System, Electing a Public Defender Instead  — Click to email a link to a friend (Opens in new window)  —  A Republican-backed Mississippi Supreme Court justice who in 2021 voted to kill … ",
    "url": "https://www.mississippifreepress.org/mississippi-voters-retire-gop-backed-supreme-court-justice-who-voted-to-kill-ballot-initiative-system-electing-a-public-defender-instead/"
  }
]