[
  {
    "text": "Trump rushed to safety as Secret Service opens fire on man with AK-47 near golf course  —  Donald Trump was rushed to safety by the Secret Service after agents spotted a man with an AK-47 near his golf course and agents opened fire, law enforcement sources said.",
    "url": "https://nypost.com/2024/09/15/us-news/shooting-reported-at-donald-trumps-golf-club-while-ex-president-was-on-grounds/"
  },
  {
    "text": "Trump campaign says former president is safe following possible gunshots in his vicinity  —  The former president was on the golf course and was immediately rushed to safety on Sunday, his campaign said in a statement.  It is still unconfirmed if shots were fired.",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-campaign-says-former-president-safe-possible-gunshots-vicinity-rcna171206"
  },
  {
    "text": "Trump Safe After Shooting Reported at His Golf Course  —  The Palm Beach County Sheriff's Office said there had been a shooting “on the grounds” of Mr. Trump's course there while the former president was at the club.  —  A shooting took place on the grounds of the Trump International Golf … ",
    "url": "https://www.nytimes.com/2024/09/15/us/politics/trump-shooting-golf-course.html"
  },
  {
    "text": "Trump was the subject of an apparent assassination attempt at his Florida golf club, the FBI says … The FBI said Donald Trump was the target of “what appears to be an attempted assassination” at his golf club in West Palm Beach, Florida, on Sunday, just nine weeks after the Republican … ",
    "url": "https://apnews.com/article/trump-shooting-gunshots-florida-f62f8378d3a8ce7b2e99d6a8fb40aba9"
  },
  {
    "text": "JD Vance admits he is willing to ‘create stories’ to get media attention  —  Republican vice-presidential candidate defends spreading false, racist claims demonizing Haitian immigrants  —  In a stunning admission, Republican vice-presidential candidate JD Vance said he is willing … ",
    "url": "https://www.theguardian.com/us-news/2024/sep/15/jd-vance-lies-haitian-immigrants"
  },
  {
    "text": "Trump is safe, his campaign says, after a shooting is reported at his golf course.  —  Senator JD Vance stood by debunked claims about Haitian immigrants, saying he was willing to “create stories” about issues.  Former President Donald J. Trump expressed disdain for Taylor Swift … ",
    "url": "https://www.nytimes.com/live/2024/09/15/us/harris-trump-election"
  },
  {
    "text": "Election 2024 latest news: FBI investigating incident at Trump's golf course as potential assassination attempt  —  Who is ahead in Harris vs. Trump 2024 presidential polls right now?  —  Earlier today  —  Trump golf course incident investigated as potential assassination attempt  —  Just now",
    "url": "https://www.washingtonpost.com/elections/2024/09/15/2024-election-campaign-updates-harris-trump/"
  },
  {
    "text": "Vance defends spreading claims that Haitian migrants are eating pets  —  Sen. JD Vance stood by his false claim that Haitian migrants were eating pets in Springfield, Ohio — an unsupported story that former President Donald Trump has also echoed on the debate stage and on social media.",
    "url": "https://www.npr.org/2024/09/15/nx-s1-5113140/vance-false-claims-haitian-migrants-pets"
  },
  {
    "text": "John Roberts' Secret Trump Memo Revealed in Huge SCOTUS Leak  —  BOMBSHELL  —  A memo obtained by The New York Times indicated the chief justice wanted to act quick—and decisively—on Donald Trump's presidential immunity.  —  The Supreme Court was hit by a flurry of damaging new leaks Sunday … ",
    "url": "https://www.thedailybeast.com/john-roberts-secret-trump-memo-revealed-in-huge-scotus-leak"
  },
  {
    "text": "How Roberts Shaped Trump's Supreme Court Winning Streak  —  Behind the scenes, the chief justice molded three momentous Jan. 6 and election cases that helped determine the former president's fate.  —  Last February, Chief Justice John G. Roberts Jr. sent his eight Supreme Court colleagues … ",
    "url": "https://www.nytimes.com/2024/09/15/us/justice-roberts-trump-supreme-court.html?unlocked_article_code=1.K04.Hw-C.FVxaHPVlsDTE&smid=url-share"
  },
  {
    "text": "GOP Gov. DeWine defends Haitian immigrants: ‘They came to Springfield to work’  —  Ohio city has been subject of rumors and threats in the presidential race.  —  In this July 14, 2024, file photo, Ohio Governor Mike DeWine takes part in a sound check at the Fiserv Forum ahead … ",
    "url": "https://abcnews.go.com/Politics/gop-gov-dewine-defends-haitian-immigrants-springfield-work/story?id=113690058"
  },
  {
    "text": "Ronald Reagan's former staff back Harris-Walz ticket: “Today is a choice between integrity and demagoguery.”  —  Seventeen former staff members of the late Republican President Ronald Reagan are endorsing the Democratic nominee, Vice President Kamala Harris.",
    "url": "https://www.cbsnews.com/news/ronald-reagan-former-staff-back-harris-walz-ticket/"
  },
  {
    "text": "Trump's Iowa lead shrinks significantly as Kamala Harris replaces Biden, Iowa Poll shows  —  The nationally recognized Iowa Poll's first test of Kamala Harris' strength against Donald Trump indicates she's a more formidable opponent than President Biden in solid-red Iowa",
    "url": "https://www.desmoinesregister.com/story/news/politics/iowa-poll/2024/09/15/iowa-poll-donald-trump-iowa-lead-shrinks-as-kamala-harris-replaces-joe-biden/75180245007/"
  },
  {
    "text": "Trump loses Electric Avenue song legal fight  —  Former US President Donald Trump has been found liable to pay damages to London singer and songwriter Eddy Grant for using his song Electric Avenue without permission.  —  It has taken Mr Grant, 76, more than four years to sue the Republican candidate … ",
    "url": "https://www.bbc.com/news/articles/c1488zz8jnzo"
  },
  {
    "text": "Donald Trump and Loomer Tunes  —  Why is the former President hanging with a 9/11 conspiracist?  —  Donald Trump likes to call his political opponents nuts, as in “crazy Nancy Pelosi,” so then why is he hanging with the 9/11 conspiracist Laura Loomer?  Is he trying to lose the election?",
    "url": "https://www.wsj.com/opinion/donald-trump-laura-loomer-conspiracist-2024-campaign-54e13cf8?st=g1APHs&reflink=article_copyURL_share"
  }
]