[
  {
    "text": "Biden says he will stop sending bombs and artillery shells to Israel if they launch major invasion of Rafah  —  Programming note: CNN's Erin Burnett's full interview with President Joe Biden airs at 7 p.m. ET on “Erin Burnett OutFront”  —  President Joe Biden said for the first time Wednesday … ",
    "url": "https://www.cnn.com/2024/05/08/politics/joe-biden-interview-cnntv"
  },
  {
    "text": "Playbook: Johnson: Biden's having a ‘senior moment’ on Israel  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  Last night on CNN, President JOE BIDEN made news by drawing a clear red line that Israel is rapidly approaching: He will halt shipments of bombs … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/05/09/johnson-bidens-having-a-senior-moment-on-israel-00156995"
  },
  {
    "text": "Democrats make no promises about bailing out Mike Johnson again … - “I talked to probably 30 or 40 members, nobody expected it,” said one senior House Democrat.  — The lawmaker told Axios that a “question that came up quite a bit” on the Democratic side during the vote was “how many times can she do this?”",
    "url": "https://www.axios.com/2024/05/09/democrats-mike-johnson-motion-to-vacate"
  },
  {
    "text": "House Speaker Mike Johnson survives challenge from Rep. Marjorie Taylor Greene  —  Rep. Marjorie Taylor Greene (R-Ga.) officially filed her motion Monday to oust Speaker Mike Johnson (R-La.) as leader of the House, starting a two-day clock for lawmakers to decide his fate.",
    "url": "https://www.washingtonpost.com/politics/2024/05/08/motion-to-vacate-house-speaker-marjorie-taylor-greene-mike-johnson/"
  },
  {
    "text": "Barron Trump to step into the political arena as a Florida delegate at the Republican convention  —  The position as an at-large delegate for the Florida Republican Party will be the most high-profile political role thus far for Barron, former President Donald Trump's youngest son.",
    "url": "https://www.nbcnews.com/politics/donald-trump/barron-trump-florida-delegate-republican-national-convention-rcna151388"
  },
  {
    "text": "Barron Trump picked to serve as a Florida delegate at Republican National Convention in July  —  Eric Trump will serve as delegation chair.  —  U.S. President Donald Trump, center, son Barron Trump, left, and First Lady Melania Trump walk on the South Lawn of the White House after exiting Marine … ",
    "url": "https://abcnews.go.com/Politics/barron-trump-picked-serve-florida-delegate-republican-national/story?id=110049809"
  },
  {
    "text": "Stack Overflow bans users en masse for rebelling against OpenAI partnership — users banned for deleting answers to prevent them being used to train ChatGPT  —  Stack Overflow is overflowing with salt.  —  Stack Overflow, a legendary internet forum for programmers and developers … ",
    "url": "https://www.tomshardware.com/tech-industry/artificial-intelligence/stack-overflow-bans-users-en-masse-for-rebelling-against-openai-partnership-users-banned-for-deleting-answers-to-prevent-them-being-used-to-train-chatgpt"
  },
  {
    "text": "What Trump promised oil CEOs as he asked them to steer $1 billion to his campaign  —  Donald Trump has pledged to scrap President Biden's policies on electric vehicles and wind energy, as well as other initiatives opposed by the fossil fuel industry.  —  As Donald Trump sat … ",
    "url": "https://www.washingtonpost.com/politics/2024/05/09/trump-oil-industry-campaign-money/"
  },
  {
    "text": "Judge Cannon Postpones Trump Case Citing Backlog Of Motions She Failed To Rule On  —  Not.  Subtle.  —  Judge Aileen Cannon has done her duty by not doing her job.  —  It was clear for months that the Trump-appointee was going to hold this trial after the 2024 election, or never — and preferably the second.",
    "url": "https://abovethelaw.com/2024/05/judge-cannon-postpones-trump-case-citing-backlog-of-motions-she-failed-to-rule-on/"
  },
  {
    "text": "Top Republicans, led by Trump, refuse to commit to accept 2024 election results  —  One possible vice-presidential candidate, Sen. Tim Scott (R-S.C.), repeatedly declined to say whether he will accept the outcome.  —  Top Republicans, led by former president Donald Trump … ",
    "url": "https://www.washingtonpost.com/elections/2024/05/08/trump-republicans-2024-election-results/"
  },
  {
    "text": "DOJ ‘Stonewalling’ House Ethics Committee Probe of Matt Gaetz  —  HUNG UP  —  The feds are refusing to turn over relevant information to lawmakers as they investigate the Florida congressman, according to two sources. … As the House Ethics Committee probes allegations that Rep. Matt Gaetz … ",
    "url": "https://www.thedailybeast.com/doj-stonewalling-house-ethics-committee-probe-of-rep-matt-gaetz"
  },
  {
    "text": "Meet AdVon, the AI-Powered Content Monster Infecting the Media Industry  —  A few years back, a writer in a developing country started doing contract work for a company called AdVon Commerce, getting a few pennies per word to write online product reviews.  —  But the writer … ",
    "url": "https://futurism.com/advon-ai-content"
  },
  {
    "text": "The dangerously illiberal judges  —  A group of Trump appointees vow they won't hire clerks from Columbia because students there engaged in protest they don't like. … It was likely only a matter of time before right-wing federal judges decided to weigh in on student protests over the ongoing slaughter of Palestinians.",
    "url": "https://www.publicnotice.co/p/columbia-protests-law-clerk-trump-judges-boycott"
  },
  {
    "text": "Corporate leaders, wealthy donors want a say in Trump's vice presidential pick … Republican presidential candidate and former U.S. President Donald Trump speaks during a campaign event in Freeland, Michigan, U.S. May 1, 2024.  —  Former President Donald Trump and people close … ",
    "url": "https://www.cnbc.com/2024/05/08/donald-trump-vp-corporate-leaders-and-wealthy-donors-want-a-say-.html"
  },
  {
    "text": "You May Have a Brain Worm Like RFK JR. and Not Even Know it  —  THE WORM TURNS  —  Experts say that even if you do have a parasite in your head, you shouldn't necessarily freak out.  —  Unapologetic conspiracy theorist and out-and-proud anti-vaxxer Robert F. Kennedy Jr. has long been accused by clearer heads of having “brain worms.”",
    "url": "https://www.thedailybeast.com/rfk-jrs-brain-wormhow-to-know-if-you-have-a-similar-parasite-in-your-head"
  },
  {
    "text": "Nikki Haley Is Huddling With Donors and Won't Endorse Donald Trump Yet  —  Some of her supporters want her to run for president in 2028, but she is watching from the sidelines for now  —  Nikki Haley is easing back into public life after dropping out of the Republican presidential race in early March … ",
    "url": "https://www.wsj.com/politics/elections/nikki-haley-is-huddling-with-donors-and-wont-endorse-donald-trump-yet-052d3d0f"
  },
  {
    "text": "Harris Warns of Supreme Court's Future Rulings: ‘I Worry About Fundamental Freedoms’  —  In an interview with The Times, Vice President Kamala Harris deepened her criticism of the conservative justices who overturned Roe and singled out Clarence Thomas's views on other settled cases.",
    "url": "https://www.nytimes.com/2024/05/09/us/politics/kamala-harris-interview.html"
  },
  {
    "text": "Ukraine's parliament dismisses agriculture minister suspected of corruption, lawmaker says  —  Ukraine's parliament has dismissed Agriculture Minister Mykola Solsky who tendered his resignation in late April as he faces an investigation into alleged involvement in illegal acquisition of state-owned land … ",
    "url": "https://www.reuters.com/world/europe/ukraines-parliament-dismisses-agriculture-minister-suspected-corruption-lawmaker-2024-05-09/"
  },
  {
    "text": "Ohio lawmakers are at odds over effort to ensure Biden appears on November ballot  —  The state House adjourned Wednesday without voting on measures to address a deadline for Democrats to certify their nominee.  Court action may be next.  —  An effort to ensure that President Joe Biden … ",
    "url": "https://www.nbcnews.com/politics/2024-election/ohio-lawmakers-are-odds-effort-ensure-biden-appears-november-ballot-rcna151369"
  },
  {
    "text": "Trump asks NY appeals court to expedite the appeal of the gag order in hush money case  —  Lawyers for Donald Trump asked a New York appeals court to rule on their challenge to the gag order limiting what the former president can say about witnesses in the criminal hush money trial, according to people familiar with the matter.",
    "url": "https://www.cnn.com/2024/05/08/politics/trump-gag-order-appeal-new-york-appeal"
  },
  {
    "text": "GOP lawmaker claims KKK is ‘the military wing of the Democratic Party’ in closed door meeting ahead of antisemitism hearing  —  GOP Rep. Scott Perry of Pennsylvania said in a closed door briefing with lawmakers on Tuesday that the Ku Klux Klan is the “the military wing of the Democratic party” … ",
    "url": "https://www.cnn.com/2024/05/08/politics/scott-perry-closed-door-comments/"
  },
  {
    "text": "CNN's Erin Burnett asks President Joe Biden about how he is going to combat inflation and improve the economy before election day 2024.",
    "url": "https://www.cnn.com/videos/politics/2024/05/08/joe-biden-preview-sot-ebof-intv-lead-digvid.cnn"
  },
  {
    "text": "Leading Republicans reveal allegations on why Biden envoy to Iran was suspended  —  .  —  Top congressional Republicans revealed the reason they believe the Biden administration's special envoy to Iran may have been suspended from his position in a letter to State Secretary Antony Blinken requesting confirmation.",
    "url": "https://www.washingtonexaminer.com/policy/foreign-policy/2995464/leading-republicans-allegations-biden-envoy-iran-suspended/"
  }
]