[
  {
    "text": "Louisiana Legislature approves bill classifying abortion pills as controlled dangerous substances  —  Two abortion-inducing drugs could soon be reclassified as controlled and dangerous substances in Louisiana under a first-of-its-kind bill that received final legislative passage Thursday … ",
    "url": "https://apnews.com/article/abortion-pills-louisiana-legislature-controlled-substance-06ea3e8df86b72b473efe8fc71054ddf"
  },
  {
    "text": "Pentagon: Over 1 million pounds of aid reaches Gaza via U.S. pier … - The effort “is being carried out as part of the United States' broader efforts alongside international partners to surge assistance to Palestinians in need,” the Pentagon said in a blog post.",
    "url": "https://www.axios.com/2024/05/24/gaza-aid-us-pier-pentagon"
  },
  {
    "text": "The White House to the left: We told you so on crime  —  ‘Well-meaning ideas have gone too far, and we need a sensible approach.’  —  The defeat of a liberal Portland prosecutor at the hands of a tough-on-crime challenger has hardened a view among top White House officials that Democrats need … ",
    "url": "https://www.politico.com/news/2024/05/23/white-house-oregan-turn-towards-center-00159588"
  },
  {
    "text": "Clarence Thomas attacks Brown v. Education ruling amid 70th anniversary … - Those remedies came through “extravagant uses of judicial power” to end racial segregation in the 1950s and 60s, Thomas wrote.  — Federal courts have limited power to grant equitable relief … ",
    "url": "https://www.axios.com/2024/05/23/clarence-thomas-supreme-court-racial-segregation"
  },
  {
    "text": "Supreme Court allows disputed South Carolina voting map, a win for GOP  —  At issue was whether the map was an unconstitutional attempt to divvy voters up by race — or was permitted partisan gerrymandering.  —  The Supreme Court on Thursday allowed the use of a South Carolina congressional map … ",
    "url": "https://www.washingtonpost.com/politics/2024/05/23/supreme-court-ruling-south-carolina-voting-map-gerrymander/"
  },
  {
    "text": "Russia denies Trump's claim he can free US journalist if he wins election  —  Spokesman says 'there aren't any contacts' with former president regarding Evan Gershkovich's release from Russia  —  Donald Trump boasted on Thursday he would quickly free the jailed US journalist Evan Gershkovich … ",
    "url": "https://www.theguardian.com/us-news/article/2024/may/23/russia-denies-trump-claim-us-journalist"
  },
  {
    "text": "Most believe Trump probably guilty of crime as his NYC trial comes to an end, CBS News poll finds  —  As Donald Trump's trial in New York City nears closing arguments, most Americans believe he is guilty of a crime in this case.  But they are less sure what the jury will do after it deliberates next week.",
    "url": "https://www.cbsnews.com/news/trump-trial-poll-most-believe-guilty-new-york/"
  },
  {
    "text": "North Carolina public universities board repeals policy in vote that likely cuts diversity jobs  —  North Carolina's public university system board voted Thursday to repeal a nearly five-year-old diversity, equity and inclusion policy, meaning its 17 schools will likely join other major universities … ",
    "url": "https://apnews.com/article/north-carolina-diversity-dei-board-of-governors-dc23328c84b9005fc1e916164e44c3fa"
  },
  {
    "text": "Ohio governor calls special session to ensure Biden gets on ballot  —  The Republican governor took the move after fellow GOP members in the state assembly were at an impasse to ensure President Biden would be on the November election ballot in his state.  —  Ohio Gov. Mike DeWine (R) … ",
    "url": "https://www.washingtonpost.com/politics/2024/05/23/ohio-biden-ballot/"
  },
  {
    "text": "Gavin Newsom signs bill allowing Arizona doctors to perform abortions in California  —  The California Democrat signed legislation drafted in response to the Arizona Supreme Court ruling that a near-total ban on abortion from 1864 is enforceable in the state.",
    "url": "https://www.nbcnews.com/politics/politics-news/gavin-newsom-signs-bill-letting-arizona-doctors-perform-abortions-cali-rcna153836"
  },
  {
    "text": "Revelation of secret Obama-era program casts doubt on stated reason for Trump Mar-a-Lago raid  —  ‘The law protects only those who follow the norms of one party,’ America First Legal Vice President Dan Epstein says  —  FIRST ON FOX: A purportedly never-before-seen Department of Defense memo … ",
    "url": "https://www.foxnews.com/politics/revelation-secret-obama-era-program-casts-doubt-stated-reason-trump-mar-a-lago-raid"
  },
  {
    "text": "Is the Biden Campaign Running on False Hope?  —  Most polls show Donald Trump leading in swing states, but the Democratic Party strategist Simon Rosenberg believes the President's chances are better than the surveys suggest.  —  President Joe Biden trails Donald Trump by approximately … ",
    "url": "https://www.newyorker.com/news/q-and-a/is-the-biden-campaign-running-on-false-hope"
  },
  {
    "text": "GOP Senate Candidate Spent Thousands in Donor Funds on Strip Clubs, Luxury, and Mysterious Wire Transfers  —  ROLLS ROYCE  —  Star athlete and conspiracy theorist Royce White just landed the Minnesota GOP's endorsement for Senate.  They must not have seen his previous campaign expenses.",
    "url": "https://www.thedailybeast.com/gop-sen-candidate-royce-white-spent-big-on-strip-clubs-limos-luxury"
  },
  {
    "text": "Justice Department Sues Live Nation-Ticketmaster for Monopolizing Markets Across the Live Concert Industry  —  For Immediate Release  —  Live Nation-Ticketmaster's Exclusionary Conduct and Dominance Across the Live Concert Ecosystem Harms Fans, Innovation, Artists, and Venues",
    "url": "https://www.justice.gov/opa/pr/justice-department-sues-live-nation-ticketmaster-monopolizing-markets-across-live-concert"
  },
  {
    "text": "Top Biden campaign official held Zoom call with Haley supporters hours after she endorsed Trump  —  “The common theme was, they feel homeless and they need a reason to vote for Biden.  A lot of them are just not there yet.”  —  A top official with Joe Biden's presidential campaign held … ",
    "url": "https://www.politico.com/news/2024/05/23/biden-nikki-haley-supporters-trump-endorsement-00159692"
  },
  {
    "text": "“No blaming it on his spouse”: Critics say seditious Alito flags expose his “Christian nationalism”  —  The Supreme Court justice isn't hiding his far-right sympathies, but at least this time he's not blaming his wife  —  When Supreme Court Justice Samuel Alito was caught raising an upside … ",
    "url": "https://www.salon.com/2024/05/23/no-blaming-it-on-his-spouse-critics-say-seditious-alito-flags-expose-his-christian-nationalism/"
  },
  {
    "text": "Steven Kramer Charged with Voter Suppression Over AI-Generated President Biden Robocalls  —  Concord, NH - Attorney General John M. Formella announces that today, Steven Kramer, age 54, of New Orleans, LA, has been indicted on charges of felony voter suppression and misdemeanor impersonation of a candidate.",
    "url": "https://www.doj.nh.gov/news/2024/20240523-kramer-voter-suppression.html"
  },
  {
    "text": "Trump campaign accuses Secret Service of ‘critical flaw’ in RNC convention planning  —  The Trump campaign wants more space between the convention and protest areas.  —  Former President and Republican presidential candidate Donald Trump attends a campaign rally in Wildwood, New Jersey, on May 11, 2024.",
    "url": "https://abcnews.go.com/Politics/trump-campaign-accuses-secret-service-critical-flaw-rnc/story?id=110507764"
  },
  {
    "text": "Garland calls Trump's false claim of Biden DOJ plan to potentially assassinate him during FBI's Mar-a-Lago search ‘extremely dangerous’  —  He noted the FBI had a similar policy during the search of Biden's home.  —  A police car is seen outside former President Donald Trump's residence in Mar-A-Lago … ",
    "url": "https://abcnews.go.com/Politics/garland-calls-trumps-false-claim-biden-doj-plan/story?id=110504598"
  },
  {
    "text": "'Ron, I love that you're back': Trump and DeSantis put an often personal primary fight behind them  —  Donald Trump, the presumptive Republican presidential nominee, and Florida Gov. Ron DeSantis are signaling to donors that they are putting their rivalry behind them after a contentious and often personal primary fight.",
    "url": "https://apnews.com/article/trump-desantis-presidential-campaign-rivalry-fundraising-republicans-d782508e303cd87ff853cac8b999c477"
  },
  {
    "text": "Representative Jim McGovern (D-MA) called out his Republican colleagues on the floor of the House today for offering “stunts instead of solutions, extremism over bipartisanship.”  It's a shame, he said, because the Republicans' narrow majority “could have given us a chance to work together in a bipartisan way.”",
    "url": "https://heathercoxrichardson.substack.com/p/may-22-2024-ac2"
  },
  {
    "text": "‘A Failed Medical School’: How Racial Preferences, Supposedly Outlawed in California, Have Persisted at UCLA … Long considered one of the best medical schools in the world, the University of California, Los Angeles's David Geffen School of Medicine receives as many as 14,000 applications a year.",
    "url": "https://freebeacon.com/campus/a-failed-medical-school-how-racial-preferences-supposedly-outlawed-in-california-have-persisted-at-ucla/"
  },
  {
    "text": "A Unique Election Driven by a Traditional Issue  —  There are a lot of unique and untested variables in this upcoming presidential election.  It is the first race in more than 100 years between an incumbent and former incumbent president (both of whom would be the oldest ever to be inaugurated).",
    "url": "https://www.cookpolitical.com/survey-research/2024-swing-state-project/unique-election-driven-traditional-issue"
  }
]