[
  {
    "text": "Trump indicted again in election subversion case brought by Jack Smith  —  The 36-page indictment, secured Tuesday by special counsel Jack Smith, is an attempt by prosecutors to recalibrate the case.  —  A federal grand jury in Washington, D.C. has re-indicted Donald Trump on four felony charges related … ",
    "url": "https://www.politico.com/news/2024/08/27/trump-indicted-2020-election-subversion-00176503"
  },
  {
    "text": "New federal indictment filed against Trump in federal Jan. 6 case  —  The superseding indictment brought by special counsel Jack Smith follows a historic Supreme Court ruling granting broad immunity to presidents for official acts.  —  Special counsel Jack Smith has filed a new indictment … ",
    "url": "https://www.washingtonpost.com/national-security/2024/08/27/trump-dc-indictment-new-charges-jan-6/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI0NzMxMjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI2MTEzNTk5LCJpYXQiOjE3MjQ3MzEyMDAsImp0aSI6ImRmNThmNzM0LTcwMTQtNGU5NC05MDA1LTEyOWEzMzk0MTQ3NCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb25hbC1zZWN1cml0eS8yMDI0LzA4LzI3L3RydW1wLWRjLWluZGljdG1lbnQtbmV3LWNoYXJnZXMtamFuLTYvIn0.T1RTMQOPlpCKKHBtnRCVXK2tCpj4jGeeyMHiMyDN5DA&itid=gfta"
  },
  {
    "text": "Smith files new indictment in Trump Jan. 6 case, adjusting for immunity decision  —  Special counsel Jack Smith filed a superseding indictment in his case indicting former President Trump for his actions seeking to subvert the 2020 election, retaining the same charges but shifting some elements … ",
    "url": "https://thehill.com/regulation/court-battles/4850566-superseding-indictment-trump-election-subversion-case/"
  },
  {
    "text": "Feds file new indictment in Trump Jan. 6 case, keeping charges intact but narrowing allegations  —  Special counsel Jack Smith on Tuesday filed a new indictment against Donald Trump over his efforts to undo the 2020 presidential election that keeps the same criminal charges but narrows … ",
    "url": "https://apnews.com/article/trump-jack-smith-jan-6-186c874404912578e44d5781c8267e2d"
  },
  {
    "text": "Taunting Trump: Harris campaign's sneer tactics … Now he's the taunted.  — It's another dimension of Vice President Harris' “happy warrior” approach to a campaign that's sure to get uglier this fall. … - But Monday's widespread coverage of the backstage fight over the “muted mics” … ",
    "url": "https://www.axios.com/2024/08/27/taunting-trump-harris-campaigns-sneer-tactics"
  },
  {
    "text": "Harris takes lead over Trump after convention: Poll  —  Video Player is loading.  —  Play Video  —  Unmute  —  Current Time 0:00  —  Loaded: 0%  —  Stream Type LIVE  —  Seek to live, currently behind liveLIVE  —  Playback Rate  —  Chapters  — Chapters  —  Descriptions",
    "url": "https://thehill.com/homenews/campaign/4849880-vice-president-harris-leads-trump/"
  },
  {
    "text": "Playbook: Inside Harris' big interview decision  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  ONE CEASE-FIRE DOWN — “Oasis reunites for tour and ends a 15-year hiatus during Gallagher brothers' feud,” by AP's Danica Kirka and Maria Sherman in London",
    "url": "https://www.politico.com/newsletters/playbook/2024/08/27/inside-harris-big-interview-decision-00176402"
  },
  {
    "text": "Harris and Walz to sit with CNN for exclusive first joint interview since campaign began  —  Vice President Kamala Harris and Minnesota Gov. Tim Walz will sit with CNN for their first joint interview on Thursday as Democrats work to broaden their base's excitement from last week's Democratic National Convention.",
    "url": "https://www.cnn.com/2024/08/27/politics/kamala-harris-cnn-interview"
  },
  {
    "text": "Trump to Put Kennedy and Gabbard on his Transition Team  —  Mr. Kennedy and Ms. Gabbard, who had been progressive Democrats for many years, will join the former president's sons and Senator JD Vance, his running mate, as honorary co-chairs.  —  Donald J. Trump plans to name his former rival … ",
    "url": "https://www.nytimes.com/2024/08/27/us/politics/trump-transition-rfk-tulsi-gabbard.html"
  },
  {
    "text": "The Conservatives Who Sold Their Souls for Trump  —  The rage and shame of the anti-anti-Trumpers is getting worse.  —  Today, Rich Lowry, the editor of National Review (the flagship conservative magazine founded by William F. Buckley Jr.), published an article claiming that Donald Trump could win the 2024 election “on character.”",
    "url": "https://www.theatlantic.com/newsletters/archive/2024/08/the-conservatives-who-sold-their-souls-for-trump/679623/?gift=hVZeG3M9DnxL4CekrWGK38nWdgGJEJDaAV_aOdhRDAM&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Why Did the New York Times Let Itself Be Used as a Mule?  —  Rich Lowry got the Gray Lady to bend over so Daddy Trump would see his genius idea.  —  ∙ Paid  —  1. The Liberal Media  —  Yesterday the New York Times published an op-ed by Rich Lowry arguing that Donald Trump … ",
    "url": "https://www.thebulwark.com/p/why-did-the-new-york-times-let-itself"
  },
  {
    "text": "Texas GOP doubles down on fraud claims as Trump, Cruz leads shrink  —  Texas Republicans are doubling down on claims that Democrats in the state's biggest cities are attempting to steal an election in which the GOP's leads in the Senate and presidential races are increasingly narrowing.",
    "url": "https://thehill.com/homenews/campaign/4850214-texas-gop-trump-cruz-shrink-lead/"
  },
  {
    "text": "Harris flip-flops on building the border wall … - Harris is embracing a more hawkish immigration policy as Donald Trump's campaign spends tens of millions of dollars attacking her about the border.  — But she still has significant differences with Trump on immigration … ",
    "url": "https://www.axios.com/2024/08/27/kamala-harris-flip-flops-border-wall"
  },
  {
    "text": "The bewildering politics of Telegram  —  Here are two big reasons the controversial app just became a global flashpoint.  —  When Telegram founder Pavel Durov was arrested late Saturday at an airport outside Paris, accused of complicity in illegal online behavior and refusing to disclose information … ",
    "url": "https://www.politico.com/news/2024/08/26/telegram-app-politics-00176386"
  },
  {
    "text": "Georgia governor inquires whether he can remove MAGA election board members after series of alarming votes  —  Donald Trump recently praised the right-wing coalition on the Georgia state election board  —  Support truly  —  independent journalism  —  Our mission is to deliver unbiased … ",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/georgia-election-trump-brian-kemp-b2602111.html"
  },
  {
    "text": "A sitting VP has won once in 188 years.  Harris isn't likely to be next.  —  Only one sitting vice president has been elected to the top office in the last 188 years.  —  The Democrats are coming out of their Chicago convention brimming with confidence.  But to win in November … ",
    "url": "https://www.washingtonpost.com/opinions/2024/08/27/kamal-harris-election-sitting-vp/"
  },
  {
    "text": "How the media blew 2024′s election  —  I'm back — back from Chicago and also back, inshallah, with weekly newsletters from now until Election Day.  Friends and neighbors who watched on TV keep asking me what covering the Democratic National Convention was really like.",
    "url": "https://www.inquirer.com/columnists/attytood/media-elections-dnc-kamala-harris-military-20240827.html"
  },
  {
    "text": "MAGA attacks on Kamala Harris' stepdaughter threaten to backfire on Donald Trump  —  Ella Emhoff has triggered Trump's bitter bro fanbase — but his embrace of the incel vote could come back to haunt  —  MAGA thought leaders can't stop proving that they are weird, just as Vice President Kamala Harris … ",
    "url": "https://www.salon.com/2024/08/27/maga-on-kamala-harris-stepdaughter-threaten-to-backfire-on-donald/"
  },
  {
    "text": "Confederate Voter Intimidation 2.0: The GOP's Dark Strategy for Winning  —  From Reconstruction to DeSantis to Paxton: How Republicans Are Keeping Power by Any Means Necessary...  The song that was inspired by this article is available here.  —  The Republican attorney general … ",
    "url": "https://hartmannreport.com/p/confederate-voter-intimidation-20-0bd"
  },
  {
    "text": "How a Zuckerberg letter got Trump to accuse himself of rigging 2020  —  A look at Mark Zuckerberg's letter to House Republicans, and why Trump sees it as a (sort of) political victory.  —  Donald Trump on Tuesday blamed his presidential administration for rigging the 2020 election against him.",
    "url": "https://www.washingtonpost.com/politics/2024/08/27/zuckerberg-letter-trump-2020-election/"
  },
  {
    "text": "NH resident dies after testing positive for mosquito-borne virus  —  New Hampshire authorities on Tuesday confirmed an adult resident has died after contracting a rare mosquito-borne illness with a high mortality rate.  —  The New Hampshire Department of Health and Human Services … ",
    "url": "https://thehill.com/homenews/4850239-nh-resident-dies-after-testing-positive-for-mosquito-borne-virus/"
  },
  {
    "text": "Nebraska Reverts to 19th-Century Voting Restrictions, Clouding Rights for Thousands  —  The Nebraska Voting Rights Restoration Coalition was ready for July 19.  A new state law, Legislative Bill 20, would take effect that day, instantly granting voting rights to some 7,000 people with past felony convictions.",
    "url": "https://boltsmag.org/nebraska-voting-rights-restoration/"
  }
]