[
  {
    "text": "U.S. and China Agree to Temporarily Slash Tariffs in Bid to Defuse Trade War  —  The 145 percent U.S. tariff on Chinese goods will come down to 30 percent for 90 days, while the two sides continue talks aimed at resolving their differences.  —  The United States and China said Monday … ",
    "url": "https://www.nytimes.com/2025/05/12/business/china-us-tariffs.html"
  },
  {
    "text": "U.S. and China agree to slash tariffs for 90 days in major trade breakthrough … WATCH NOW  —  The U.S. and China on Monday agreed to temporarily suspend most tariffs on each other's goods in a move that shows a major thawing of trade tensions between the world's two largest economies.",
    "url": "https://www.cnbc.com/2025/05/12/us-and-china-agree-to-slash-tariffs-for-90-days.html"
  },
  {
    "text": "A Garish, Outlandish, Stunningly Corrupt Act  —  Happy China Trade Thaw Day to those who celebrate!  The United States and China agreed overnight to suspend many of the tariffs put in place after Donald Trump's “Liberation Day,” which had ground trade between the two nations to a virtual standstill.",
    "url": "https://www.thebulwark.com/p/a-garish-outlandish-stunningly-corrupt-act-qatar-plane-747-air-force-one-bribe"
  },
  {
    "text": "House Republicans unveil Medicaid cuts that Democrats warn will leave millions without care  —  House Republicans unveiled the cost-saving centerpiece of President Donald Trump's “ big, beautiful bill ” late Sunday, at least $880 billion in cuts largely to Medicaid to help cover the cost of $4.5 trillion in tax breaks.",
    "url": "https://apnews.com/article/medicaid-cuts-trump-tax-cuts-bill-1e2b12a91a3d12ceb0420ce7053de58e"
  },
  {
    "text": "A Common Sense Budget Reconciliation Bill  —  My committee's legislation supports U.S. innovation, strengthens Medicaid, and ends Green New Deal-style waste.  —  When President Trump took the podium for his Second Inaugural Address, he promised a “revolution of common sense” … ",
    "url": "https://www.wsj.com/opinion/a-common-sense-budget-reconciliation-bill-house-energy-and-commerce-committee-d8ab0d71?st=wJavUz"
  },
  {
    "text": "Don't Cut Medicaid  —  Polls show Democrats down in the dumps at their lowest approval level in decades, but we Republicans are having an identity crisis of our own, and you can see it in the tug of war over President Trump's “one big, beautiful bill.”  The nub of the conflict … ",
    "url": "https://www.nytimes.com/2025/05/12/opinion/josh-hawley-dont-cut-medicaid.html"
  },
  {
    "text": "Fight over Medicaid cuts heats up as House Republicans release bill  —  The legislation includes work requirements, stricter eligibility checks, citizenship verification and new limits on federal funding for Medicaid to states.  It met swift Democratic opposition.",
    "url": "https://www.nbcnews.com/politics/congress/fight-medicaid-cuts-heats-house-republicans-release-bill-rcna206210"
  },
  {
    "text": "Hamas to release Israeli-American hostage as gesture to Trump  —  Hamas said Sunday it will release Israeli-American hostage Edan Alexander, who has been held for over 550 days, as part of an effort to reach a ceasefire deal and resume humanitarian aid deliveries to Gaza.",
    "url": "https://www.axios.com/2025/05/11/trump-gaza-hostage-deal-hamas-edan-alexander"
  },
  {
    "text": "Trump Heads to the Middle East Focused on Business Deals, Not Diplomacy  —  President Trump has always viewed the presidency as a worldwide hunt for deals.  And there is no better place for that than the Gulf, where a few men wield absolute authority over vast wealth.",
    "url": "https://www.nytimes.com/2025/05/12/us/politics/trump-middle-east-visit-saudi-arabia-qatar-uae.html"
  },
  {
    "text": "Auction to Dine With Trump Creates Foreign Influence Opportunity … The sale of face-to-face access to President Trump using the Trump family's own cryptocurrency has done more than benefit him financially, though it has certainly done that.  —  Mr. Trump announced last month that leading buyers … ",
    "url": "https://www.nytimes.com/2025/05/12/us/politics/auction-to-dine-with-trump-creates-foreign-influence-opportunity.html?unlocked_article_code=1.Gk8.yzzI.Y7iQnH7Ph6sL"
  },
  {
    "text": "House Democrat calls for ‘immediate’ ethics probe of Qatari plane gift to Trump  —  A Democratic congressman is calling for an ethics investigation over President Donald Trump's plans to accept a $400 million jet from Qatar that would temporarily serve as Air Force One before being allotted … ",
    "url": "https://www.foxnews.com/politics/house-democrat-calls-immediate-ethics-probe-qatari-plane-gift-trump"
  },
  {
    "text": "White South Africans Granted Refugee Status by Trump Leave for U.S.  —  Dozens of Afrikaners who claim discrimination in their home country left Johannesburg on Sunday.  Their departure for the U.S. came as the Trump administration was halting virtually all refugee admissions.",
    "url": "https://www.nytimes.com/2025/05/11/world/africa/white-south-africans-granted-refugee-status-by-trump-leave-for-us.html"
  },
  {
    "text": "The Federalist Society is surprisingly ambivalent about Trump  —  Few organizations have profited as handsomely off of President Donald Trump's rise to power as the Federalist Society, a kind of bar association for right-wing lawyers.  —  “We're going to have great judges, conservative … ",
    "url": "https://www.vox.com/scotus/412624/supreme-court-federalist-society-donald-trump-tariffs"
  },
  {
    "text": "Inside Trump's $1 trillion military bonanza  —  The White House recently released a preview of Donald Trump's 2026 budget request, with the full proposal expected later this month.  For now, topline figures for broad government functions are available and not much else.",
    "url": "https://popular.info/p/inside-trumps-1-trillion-military"
  },
  {
    "text": "Newsom Asks Cities to Ban Homeless Encampments, Escalating Crackdown  —  “There are no more excuses,” the California governor said in pushing for municipalities to address one of the most visible byproducts of homelessness.  —  Gov. Gavin Newsom escalated California's push … ",
    "url": "https://www.nytimes.com/2025/05/12/us/newsom-california-homeless-encampments.html"
  },
  {
    "text": "Flights Could Be Disrupted Across U.S., Transportation Secretary Warns  —  After a series of problems at Newark Liberty International Airport, the secretary, Sean Duffy, said he would meet with airline leaders on Wednesday to plan to scale back Newark flights.",
    "url": "https://www.nytimes.com/2025/05/11/nyregion/newark-airport-flight-disruptions-duffy.html?unlocked_article_code=1.GU8.jg6x.m8ofFo8O4sXJ&smid=url-share"
  },
  {
    "text": "Tech companies have a big remote worker problem: North Korean operatives  —  Cybersecurity firms say that the intricate scam to amass funding for North Korea's weapons program is happening “on a scale we haven't seen before.”  —  A growing number of the nation's top tech firms … ",
    "url": "https://www.politico.com/news/2025/05/12/north-korea-remote-workers-us-tech-companies-00340208"
  },
  {
    "text": "“The Wolves Came”: Richard Steigmann-Gall on Daniel Steinmetz-Jenkins's *Did it Happen Here?  Perspectives on Fascism and America*  —  Daniel Steinmetz-Jenkins has edited a book which he hoped would finally put to bed the hotly contested Fascism Debate that arose from Trump's 2016 candidacy … ",
    "url": "https://s-usih.org/2025/05/the-wolves-came-richard-steigmann-gall-on-daniel-steinmetz-jenkinss-did-it-happen-here-perspectives-on-fascism-and-america/#_ftn1"
  },
  {
    "text": "Here Is Everything That Has Changed Since Congestion Pricing Started in New York  —  Fewer cars.  Faster travel.  Less honking.  And some questions we still can't answer.  —  The reporters sought information from everyone they could think of, including the M.T.A., the Fire Department … ",
    "url": "https://www.nytimes.com/interactive/2025/05/11/upshot/congestion-pricing.html"
  },
  {
    "text": "Will we allow ICE to behave as a secret police?  —  I had missed the story from two weeks ago about what happened after (apparent) agents of the U.S. Immigration and Customs Enforcement (ICE), one wearing a balaclava to hide his face, seized two men at the Charlottesville, Va. courthouse.",
    "url": "https://walterolson.substack.com/p/will-we-allow-ice-to-behave-as-a"
  }
]