[
  {
    "text": "Trump and Harris Neck and Neck After Summer Upheaval, Times/Siena Poll Finds  —  The survey finds that Donald J. Trump is retaining his support and that, on the eve of the debate, voters are unsure they know enough about where Kamala Harris stands.  —  Former President Donald J. Trump … ",
    "url": "https://www.nytimes.com/2024/09/08/us/politics/trump-and-harris-times-siena-poll.html?unlocked_article_code=1.JE4.hi1f.f26wReRbISmY&smid=url-share"
  },
  {
    "text": "Harris v. Trump CBS News poll finds Pennsylvania, Michigan, Wisconsin race tight ahead of debate  —  In Pennsylvania, Michigan and Wisconsin — all tight races — we see the larger contours of the entire presidential contest ahead of the first Harris-Trump debate.  —  What makes these states close?",
    "url": "https://www.cbsnews.com/news/harris-trump-poll-pennsylvania-michigan-wisconsin-debate/"
  },
  {
    "text": "The mistakes of 2019 could cost Harris the election  —  Voters think she's too far to the left — but there's plenty of room to define Trump as radical.  —  For the second time this weekend, I'm upending previously laid plans to cover a more time-sensitive story: the New York Times/Siena College poll that came out this morning.",
    "url": "https://www.natesilver.net/p/the-mistakes-of-2019-could-cost-harris"
  },
  {
    "text": "September 7, 2024  —  By rights, tonight's post should be a picture, but Trump's behavior today merits a marker because it feels like a dramatic escalation of the themes we've seen for years.  Please feel free to ignore—as I often say, I am trying to leave notes for a graduate student in 150 years … ",
    "url": "https://heathercoxrichardson.substack.com/p/september-7-2024"
  },
  {
    "text": "Trump pledges authoritarian crackdown, saying enemies to be prosecuted at levels “never seen before”  —  The Republican candidate promised to imprison those whom he falsely claimed stole the 2020 election from him  —  Former President Donald Trump is promising to carry out what he described … ",
    "url": "https://www.salon.com/2024/09/08/pledges-authoritarian-crackdown-saying-enemies-to-be-prosecuted-at-levels-never-seen-before/"
  },
  {
    "text": "Trump threatens lawyers, donors and election officials with prison for ‘unscrupulous behavior’  —  Trump and his allies filed dozens of unsuccessful cases after the 2020 election in an attempt to overturn the results.  —  Former President Donald Trump, who makes frequent false claims … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-warns-prison-sentences-people-cheated-2024-rcna170088"
  },
  {
    "text": "Cheney says Trump is an ‘unrecoverable catastrophe’ in call for GOP to vote for Harris  —  The former congresswoman says not voting for Trump is not enough.  —  Rep. Liz Cheney Vice Chairwoman of the Select Committee to Investigate the January 6th Attack on the U.S. Capitol … ",
    "url": "https://abcnews.go.com/Politics/cheney-trump-unrecoverable-catastrophe-call-gop-vote-harris/story?id=113486970"
  },
  {
    "text": "Variety Asked Elton John About Donald Trump and the TDS Afflicted Will NOT Like His Answer  —  Those on the Left afflicted with Trump Derangement Syndrome might not be fully satisfied by Elton John's response to a question from a Variety reporter at the Toronto Film Festival … ",
    "url": "https://twitchy.com/dougp/2024/09/07/variety-asked-elton-john-about-donald-trump-and-the-tds-afflicted-will-not-like-his-answer-n2400652"
  },
  {
    "text": "Elton John's New Remarks About Trump Are Likely to Have Dems Losing Their Minds  —  Democrats and media have been going all in to demonize former President Donald Trump as we count down to the election.  We see that in the constant drumbeat of bad press for him and positive press for Kamala Harris, for example.",
    "url": "https://redstate.com/nick-arama/2024/09/08/elton-john-remarks-n2179048"
  },
  {
    "text": "‘This Week’ Transcript 9-8-24: Former Rep. Liz Cheney and Gov. Sarah Huckabee Sanders  —  Former Wyoming Congressman Liz Cheney announces her father's support for Democratic candidate Kamala Harris on the second day of panels at the 14th annual Texas Tribune Festival in downtown Austin, Texas.",
    "url": "https://abcnews.go.com/Politics/week-transcript-9-8-24-former-rep-liz/story?id=113487189"
  },
  {
    "text": "Trump dismisses new warnings of Russian interference in election  —  U.S. intelligence officials warned Friday of new covert efforts by Russia to sway the presidential election.  At a rally in Wisconsin, Trump made clear he doesn't buy it.  —  MOSINEE, Wis. — A day after spending … ",
    "url": "https://www.washingtonpost.com/politics/2024/09/07/trump-rally-russia-election/"
  },
  {
    "text": "Trump cashes in during final weeks of his presidential campaign  —  No presidential candidate has ever so closely linked his election with personal for-profit enterprises, selling items from shoes to books to pieces of his suit.  —  With less than 10 weeks before the presidential election … ",
    "url": "https://www.washingtonpost.com/politics/2024/09/08/trump-cash-merchandise-books-cards/"
  },
  {
    "text": "Anti-Abortion Extremists Call the Shots in Trump's GOP  —  Trump's epic flip flop abortion is why Democratic fears about Project 2025 and a Federal abortion ban are well-founded.  —  The generally accepted — and oft-repeated — narrative about Trump is that he is a cult-leader who can bend the Republican base to his will.",
    "url": "https://www.messageboxnews.com/p/anti-abortion-extremists-call-the"
  },
  {
    "text": "Fake news, social media, and “The Death of Truth”  —  We live in an age of alternate facts.  More and more Americans are getting their information almost entirely from outlets that echo their own political point of view.  And then, of course, there's social media, where there are few … ",
    "url": "https://www.cbsnews.com/news/fake-news-social-media-and-the-death-of-truth/"
  },
  {
    "text": "Mother of Georgia suspect is said to have called school before shooting, warning of ‘emergency’  —  The mother of the suspected Apalachee High School gunman said that she called the school on the morning of the shooting and warned a counselor about an “extreme emergency.”",
    "url": "https://www.washingtonpost.com/investigations/2024/09/07/georgia-school-shooter-mother-warning/"
  },
  {
    "text": "MAGA Turns on Trump for Admitting He's an Election ‘Loser’  —  BONUS PODCAST  —  “He's admitting... ‘I lost by a whisker’.  So what was the point?  What's the point of any of it you lost in 2020?” one-time Trump dinner companion Nick Fuentes asked.",
    "url": "https://www.thedailybeast.com/maga-and-nick-fuentes-turn-on-donald-trump-for-admitting-hes-an-election-loser"
  },
  {
    "text": "It's time for a permanent repeal of the global gag rule  —  Project 2025, the policy agenda created by conservative activists and spearheaded by The Heritage Foundation, envisions sweeping changes to U.S. government policy.  Among them, buried within the more than 900-page document … ",
    "url": "https://thehill.com/opinion/international/4866475-project-2025-global-gag-rule/"
  }
]