[
  {
    "text": "Justice Alito Caught on Tape Discussing How Battle for America 'Can't Be Compromised'  —  In a new, secret recording, the Supreme Court justice says he “agrees” that the U.S. should return to a place of godliness  —  Justice Samuel Alito spoke candidly about the ideological battle between … ",
    "url": "https://www.rollingstone.com/politics/politics-features/samuel-alito-supreme-court-justice-recording-tape-battle-1235036470/"
  },
  {
    "text": "The Mooch's warning to Trump's new pals on Wall Street  —  Editor's note: Morning Money is a free version of POLITICO Pro Financial Services morning newsletter, which is delivered to our subscribers each morning at 5:15 a.m. The POLITICO Pro platform combines the news you need with tools … ",
    "url": "https://www.politico.com/newsletters/morning-money/2024/06/10/the-moochs-warning-to-trumps-new-pals-on-wall-street-00162439"
  },
  {
    "text": "Georgia Republican convicted in Jan. 6 riot walks out during televised congressional primary debate  —  A Georgia congressional candidate convicted of a misdemeanor for illegally demonstrating inside the U.S. Capitol on Jan. 6, 2021, walked out of a televised debate",
    "url": "https://apnews.com/article/georgia-january-6-congress-chuck-hand-johnson-8d13db524ed68f265c8183654597926f"
  },
  {
    "text": "Trump Demands Biden Remove Ad of Him Calling Dead Soldiers ‘Suckers’ and ‘Losers’  —  WAGING WAR  —  The former president said only a “psycho” or a “very stupid person” would've made such statements.  —  Donald Trump on Sunday called for President Joe Biden to take down an attack ad featuring … ",
    "url": "https://www.thedailybeast.com/trump-demands-biden-remove-ad-of-him-calling-dead-soldiers-suckers-and-losers"
  },
  {
    "text": "Ukraine strikes Moscow's most advanced fighter jet inside Russia … - The attack took place at the Akhtubinsk airfield in Russia's Astrakhan region, about 366 miles behind the front lines, GUR added.  — “The Su-57 is Moscow's most advanced fighter” jet that can carry two different types of cruise missiles.",
    "url": "https://www.axios.com/2024/06/10/ukraine-strike-russian-fighter-jet-su57"
  },
  {
    "text": "The Future is Terror  —  Robespierre, a central architect of the French revolution, may seem like an unlikely reference point for modern American politics, and Donald Trump in particular.  But in one way he articulated a theory of governing that Trump is enacting today:",
    "url": "https://donmoynihan.substack.com/p/the-future-is-terror"
  },
  {
    "text": "Donald Trump Calls Taylor Swift ‘Unusually Beautiful’ but ‘Liberal’ in New ‘Apprentice’ Book (EXCLUSIVE)  —  Donald Trump is in his “Reputation” era.  —  The former president muses about pop princess Taylor Swift in a new book about his years as a reality star, “Apprentice in Wonderland … ",
    "url": "https://variety.com/2024/tv/news/donald-trump-taylor-swift-beautiful-liberal-apprentice-1236030425/"
  },
  {
    "text": "Donald Trump Mocked Over ‘Bizarre Rant’ About Sharks  —  Donald Trump has been mocked online after going on a tirade against sharks and sinking boats during his recent campaign rally in Las Vegas.  —  During his speech  —  in the key swing state of Nevada on Sunday, the former president posed … ",
    "url": "https://www.newsweek.com/donald-trump-mocked-rally-sharks-rant-las-vegas-boats-1910275"
  },
  {
    "text": "Increase in Liberal Views Brings Ideological Parity on Social Issues  —  But the long-term increase is not as pronounced on economic issues, on which Americans still lean conservative  —  WASHINGTON, D.C. — Americans have become significantly more likely to identify as liberal in their views … ",
    "url": "https://news.gallup.com/poll/645776/increase-liberal-views-brings-ideological-parity-social-issues.aspx"
  },
  {
    "text": "Donald Trump's Last (We Hope) Grift  —  Have you been to the Trump Ocean Resort Baja Mexico?  It's absolutely lovely; you must visit one of these days.  I did, a little while back.  Let me tell you all about it.  The resort is in Mexico, just over the border with the United States and southwest of … ",
    "url": "https://newrepublic.com/article/182345/donald-trump-last-grift"
  },
  {
    "text": "Eric Swalwell Savages Trump Rally With ‘You Might Be In A Cult If... ’ Video  —  The California congressman hilariously captured the ridiculous messianic vibe of Trump's Las Vegas campaign stop.  —  LOADING  —  Rep. Eric Swalwell (D-Calif.) mocked Donald Trump's Las Vegas rally Sunday … ",
    "url": "https://www.huffpost.com/entry/eric-swalwell-trump-you-know-youre-in-a-cult-if_n_6666c4f4e4b02fc48bf3e03f"
  },
  {
    "text": "Biden admin has discussed potentially negotiating unilateral deal with Hamas to free U.S. hostages  —  Such talks, if they begin, would not include Israel and would be conducted through Qatari interlocutors.  —  WASHINGTON — Biden administration officials have discussed potentially negotiating … ",
    "url": "https://www.nbcnews.com/news/investigations/biden-administration-discussed-potentially-negotiating-unilateral-deal-rcna156266"
  },
  {
    "text": "The U.S. Economy Reaches Superstar Status  —  No, really.  —  If the United States' economy were an athlete, right now it would be peak LeBron James.  If it were a pop star, it would be peak Taylor Swift.  Four years ago, the pandemic temporarily brought much of the world economy to a halt.",
    "url": "https://www.theatlantic.com/ideas/archive/2024/06/us-economy-excellent/678630/"
  },
  {
    "text": "GOP overwhelmingly supports a Trump conspiracy theory, yet again  —  There remains no evidence that Biden was behind the Manhattan prosecution of the former president, but 80 percent of Republicans say otherwise.  —  Stop me if you've heard this before: Donald Trump is unhappy about the outcome of a proceeding.",
    "url": "https://www.washingtonpost.com/politics/2024/06/10/gop-overwhelmingly-supports-trump-conspiracy-theory-yet-again/"
  },
  {
    "text": "The Success Narratives of Liberal Life Leave Little Room for Having Children  —  For young, secular, politically progressive men and women, having children has become something of an afterthought.  Liberal conventional wisdom encourages people to spend their 20s on journeys of personal … ",
    "url": "https://www.nytimes.com/2024/06/10/opinion/natalism-liberalism-parenthood.html"
  },
  {
    "text": "The brazen GOP plan to launder cash to the nation's most radical gubernatorial candidate  —  One of the country's most hotly contested gubernatorial contests is taking place in North Carolina, where Lt. Governor Mark Robinson (R) — known for his extremist views on LGBTQ rights, abortion … ",
    "url": "https://popular.info/p/the-brazen-gop-plan-to-launder-cash"
  },
  {
    "text": "The Republicans taking credit for federal funding they voted against  —  Rep. Nancy Mace celebrated a public transit project in her district that was made possible by the infrastructure law, which she called a “socialist wish list” and a “fiasco.”  —  Billions of dollars in infrastructure funding … ",
    "url": "https://www.politico.com/news/2024/06/10/house-republicans-infrastructure-funding-vote-no-00162361"
  },
  {
    "text": "Minnesota Poll: Biden holds narrow lead over Trump, but GOP voters more enthusiastic  —  Biden leads Trump 45%-41% in Minnesota, according to a new Star Tribune/MPR News/KARE 11 poll.  —  President Joe Biden holds a narrow lead over former President Donald Trump among likely voters in Minnesota … ",
    "url": "https://www.startribune.com/new-minnesota-poll-shows-close-presidential-race/600371666/?refresh=true"
  },
  {
    "text": "Trump's sentencing: everything you need to know  —  Defendants normally plead for leniency.  Trump is too busy slandering the judge. … With Donald Trump's sentencing for his 34 felony convictions just a month away, speculation about the criminal consequences for the former president is reaching a fever pitch.",
    "url": "https://www.publicnotice.co/p/trump-new-york-sentencing-explained-july-11-2024"
  },
  {
    "text": "Trump won't mention abortion in brief, virtual remarks to anti-abortion group  —  The former president will deliver a pre-recorded message to a Christian advocacy group that calls abortion “child sacrifice.”  —  Hours before Donald Trump was expected to make a virtual address … ",
    "url": "https://www.politico.com/news/2024/06/10/trump-virtual-remarks-to-anti-abortion-group-00162500"
  },
  {
    "text": "Donald Trump and Byron Donalds racial stunts are for white racists, not “outreach” to Black voters  —  Trump's alliances with rappers and Donalds praising Jim Crow are about validating MAGA's racist stereotypes  —  Because we keep hearing so much about how convicted felon Donald Trump is doing … ",
    "url": "https://www.salon.com/2024/06/10/donald-and-byron-donalds-racial-stunts-are-for-racists-not-outreach-to-black/"
  },
  {
    "text": "FFS: If It's Not Explicitly Leftist, It's ‘Far Right’  —  Europeans have had enough with open borders, rising crime, Islamism, and especially their elites.  —  They haven't been saying so by rioting, breaking things, or through roving bands of immigrant bashers.",
    "url": "https://hotair.com/david-strom/2024/06/10/ffs-if-its-not-explicitly-leftist-its-far-right-n3789951"
  },
  {
    "text": "Dockworkers Cancel Bargaining, Threaten Strike at U.S. Seaports  —  Union that represents workers at ports from Maine to Texas cancels labor talks in row over use of automated machinery  —  Dockworkers at America's East Coast and Gulf Coast seaports canceled labor talks that were due to start … ",
    "url": "https://www.wsj.com/articles/dockworkers-cancel-bargaining-threaten-strike-at-u-s-seaports-b5712a1a"
  },
  {
    "text": "Liberal Judge Susan Crawford enters race for Wisconsin Supreme Court with majority at stake  —  A liberal judge who previously represented Planned Parenthood in a case related to abortion access has entered the race for Wisconsin Supreme Court  —  This photo provided by Susan Crawford for Wisconsin … ",
    "url": "https://abcnews.go.com/US/wireStory/liberal-judge-susan-crawford-enters-race-wisconsin-supreme-110980605"
  },
  {
    "text": "US consulate in Sydney attacked with sledgehammer, daubed in pro-Palestinian graffiti  —  The US consulate in North Sydney has been attacked by a person wearing a dark hoodie and carrying a small sledgehammer.  —  The person made several attempts to shatter the glass windows at the front … ",
    "url": "https://www.smh.com.au/national/us-consulate-in-sydney-attacked-with-sledgehammer-daubed-in-pro-palestinian-graffiti-20240610-p5jkk2.html"
  }
]