[
  {
    "text": "The polls are suggesting a huge shift in the electorate.  Are they right?  —  It's a significant reversal from recent history: President Joe Biden is struggling with young voters but performing better than most Democrats with older ones.  —  Something weird is happening beneath … ",
    "url": "https://www.politico.com/news/2024/04/07/voter-age-biden-trump-2024-election-00150923"
  },
  {
    "text": "Yes, Biden is really running in November.  But a lot of voters say they doubt it  —  In November, President Biden and Former President Donald Trump will be at the top of the ballot, just like they were in 2020.  But among voters, there is an undercurrent of disbelief that this rematch is really happening.",
    "url": "https://npr.org/2024/04/07/1243049811/biden-voter-disbelief-age-disinformation"
  },
  {
    "text": "‘Increasingly chaotic’: Why House Republicans are heading for the exits  —  The decision by 21 Republican lawmakers to step back is indicative of the broader morale problem within the GOP conference  —  House Majority Leader Steve Scalise thought he had a good argument for Rep. Mike Gallagher (R-Wis.).",
    "url": "https://www.washingtonpost.com/politics/2024/04/07/house-republicans-retirements-mike-johnson-majority-elections/"
  },
  {
    "text": "Trump: Would be a “great honor” to be jailed for gag order violation … - “We have to Save our Country from these Political Operatives masquerading as Prosecutors and Judges, and I am willing to sacrifice my Freedom for that worthy cause,” he said. … - Merchan expanded the gag order … ",
    "url": "https://www.axios.com/2024/04/07/trump-gag-order-new-york-merchan-jail"
  },
  {
    "text": "Inside Donald Trump's secret plan to end the Ukraine-Russia war  —  Foreign policy experts and some Republicans warned that pressuring Ukraine to cede land would reward Putin  —  Former president Donald Trump has privately said he could end Russia's war in Ukraine by pressuring Ukraine … ",
    "url": "https://www.washingtonpost.com/politics/2024/04/05/trump-ukraine-secret-plan/"
  },
  {
    "text": "Former GOP rep says Trump ‘appeals to the worst of us,’ calls on Biden ‘to recognize the moment’  —  Former Republican Congressman Joe Walsh (Ill.) said that former President Trump “appeals to the worst of us” when discussing his rhetoric and called on President Biden to “recognize the moment” … ",
    "url": "https://thehill.com/homenews/campaign/4578861-former-gop-rep-says-trump-appeals-to-the-worst-of-us/"
  },
  {
    "text": "Colorado Sun politics reporter kicked out of GOP state assembly  —  A Colorado Sun politics reporter was escorted out of the state GOP assembly by a sheriff's deputy Saturday after being told that party Chairman Dave Williams found her “current reporting to be very unfair.”",
    "url": "https://coloradosun.com/2024/04/06/colorado-republican-party-kicks-out-colorado-sun-reporter/"
  },
  {
    "text": "Trump promises a ‘deal’ on abortion that will please everyone.  It likely doesn't exist.  —  Should Trump appear vague or duck the issue, some of his supporters fear it will allow the Biden campaign to tie him to the more extreme wing of the anti-abortion movement.",
    "url": "https://www.politico.com/news/2024/04/07/trump-abortion-democrats-republicans-00150800"
  },
  {
    "text": "House, Senate elections are being fought on very different political terrain  —  The House and Senate majorities are both on the line in November and could easily flip in different directions  —  When it comes to this fall's battle for control of Congress, the House and Senate might as well be on different planets.",
    "url": "https://www.washingtonpost.com/politics/2024/04/06/congressional-elections-house-senate-majority/"
  },
  {
    "text": "6 months in, the Gaza war is in limbo — which may help Bibi stay in power … - Israel is conducting sporadic raids and airstrikes like the botched one that killed seven World Central Kitchen workers, but there are no major military operations going on in Gaza.",
    "url": "https://www.axios.com/2024/04/07/6-months-gaza-war-netanyahu"
  },
  {
    "text": "RNC chair: We're ‘going to be in the room’ when votes are cast, counted in November  —  Republican National Committee (RNC) Chair Michael Whatley said the committee will ensure they are “going to be in the room” when the early votes are cast and counted in the November election.",
    "url": "https://thehill.com/homenews/campaign/4578554-rnc-chair-were-going-to-be-in-the-room-when-votes-are-cast-counted-in-november/"
  },
  {
    "text": "Navy cancels ship briefings after damning internal report  —  As China's fleet grows, the U.S. is struggling with fresh delays in building new subs and warships.  —  As the Navy's largest U.S. trade show gets underway on Monday, officers in charge of the service's marquee shipbuilding programs … ",
    "url": "https://www.politico.com/news/2024/04/07/navy-cancels-ship-briefings-internal-report-00150879"
  },
  {
    "text": "Russia Says Macron's Hawkish Statements Pose ‘Strategic Problem’  — Macron has refused to rule out sending troops to Ukraine  — Envoy says Russia shut out of Paris Olympic safety planning  —  Alexey Meshkov, Russia's ambassador to France, said Emmanuel Macron's recent hawkish commentary … ",
    "url": "https://www.bloomberg.com/news/articles/2024-04-07/russia-says-macron-s-hawkish-statements-pose-strategic-problem"
  },
  {
    "text": "How Gaza Protesters Are Making Life Difficult for Democratic Leaders  —  From President Biden to the mayors of small cities, Democrats have been trailed by demonstrators who are complicating the party's ability to campaign in an election year.  —  In Detroit, a congressman's holiday party devolved … ",
    "url": "https://www.nytimes.com/2024/04/07/us/politics/democrats-israel-gaza-protesters.html"
  },
  {
    "text": "Montana GOP Senate candidate says he lied to ranger about gunshot wound in 2015  —  Tim Sheehy was cited for illegally discharging a weapon in a national park but says he made up the gunshot to cover up a bullet wound he received as a Navy SEAL in Afghanistan that he never reported to superiors",
    "url": "https://www.washingtonpost.com/politics/2024/04/06/tim-sheehy-montana-senate-gunshot-wound-national-park/"
  }
]