[
  {
    "text": "Ex-Trump Official Makes Stunning Revelation: Trump Talked About Executing People At Several WH Meetings  —  Ex-Trump White House official Alyssa Farah Griffin told Mediaite that then-President Donald Trump discussed “executing” people at multiple White House meetings.",
    "url": "https://www.mediaite.com/news/ex-trump-official-makes-stunning-revelation-trump-talked-about-executing-people-at-several-wh-meetings/"
  },
  {
    "text": "Washington Post Publisher and Incoming Editor Are Said to Have Used Stolen Records in Britain  —  Years before becoming the Post's publisher, Will Lewis assigned an article based on stolen phone records, a former reporter said.  —  The publisher and incoming editor of The Washington Post … ",
    "url": "https://www.nytimes.com/2024/06/15/world/europe/will-lewis-records-uk-editor.html"
  },
  {
    "text": "Trump portrays rampant crime in speech at Black church in Detroit  —  The presumptive Republican nominee, who hopes to dent Biden's advantage among Black voters, has often disparaged communities where many African Americans live  —  DETROIT — Presumptive Republican nominee Donald Trump repeated … ",
    "url": "https://www.washingtonpost.com/politics/2024/06/15/trump-black-church-detroit-crime/"
  },
  {
    "text": "Biden has a problem with Black voters.  So does Trump.  —  Takeaways from USA TODAY's exclusive new poll of Black voters in two key swing states.  —  President Biden's sagging support among Black voters has set off alarm bells among Democrats and raised hopes among Republicans that Donald Trump … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/06/16/biden-trump-problem-with-black-voters/74101326007/"
  },
  {
    "text": "Trump challenges Biden to a cognitive test but confuses the name of the doctor who tested him  —  Donald Trump has suggested President Joe Biden “should have to take a cognitive test,” only to confuse who administered the test to him in the next sentence  —  WASHINGTON — Donald Trump … ",
    "url": "https://www.washingtonpost.com/politics/2024/06/15/trump-mental-acuity-gaffe-biden-ronny-jackson/5f398ac0-2b78-11ef-835a-2a6acac1f8a6_story.html"
  },
  {
    "text": "What Have We Liberals Done to the West Coast?  —  As Democrats make their case to voters around the country this fall, one challenge is that some of the bluest parts of the country — cities on the West Coast — are a mess.  —  Centrist voters can reasonably ask: Why put liberals … ",
    "url": "https://www.nytimes.com/2024/06/15/opinion/progressives-california-portland.html"
  },
  {
    "text": "Biden and Trump campaigns agreed to mic muting, podiums among rules for upcoming CNN debate  —  With less than two weeks until the first presidential debate of the 2024 election cycle, CNN has released additional details on the parameters agreed upon by the Trump and Biden campaigns.",
    "url": "https://www.cnn.com/2024/06/15/politics/trump-biden-cnn-debate-rules/"
  },
  {
    "text": "Biden says the next president may get to name two Supreme Court justices  —  LOS ANGELES - President Biden on Saturday night said he expects the winner of this year's presidential election will likely have the chance to fill two vacancies on the Supreme Court - a decision he warned would be … ",
    "url": "https://www.npr.org/2024/06/15/nx-s1-5007404/biden-supreme-court-vacancies-trump"
  },
  {
    "text": "UK polls point to ‘electoral extinction’ for Prime Minister Sunak's Conservatives  —  Three British opinion polls released late on Saturday presented a grim picture for Prime Minister Rishi Sunak's Conservative Party, and one pollster warned that the party faced “electoral extinction” in July 4's election.",
    "url": "https://www.reuters.com/world/uk/uk-polls-point-electoral-extinction-prime-minister-sunaks-conservatives-2024-06-15/"
  },
  {
    "text": "Trump threatens to cut US aid to Ukraine quickly if reelected  —  Former U.S. President Donald Trump on Saturday blasted the scale of U.S. support for Ukraine and said that if he is reelected in November he would immediately “have that settled.”  —  At a campaign rally in Detroit … ",
    "url": "https://www.politico.eu/article/donald-trump-ukraine-russia-war-threatens-cut-aid-election-2024/"
  },
  {
    "text": "How Rubio Went From ‘Little Marco’ to Trump's VP Shortlist  —  Presumptive GOP presidential nominee hasn't made up his mind but sees appeal in having the senator on the ticket  —  As a boy, Marco Rubio sat at the feet of his Cuban grandfather, engrossed in stories about Ronald Reagan.",
    "url": "https://www.wsj.com/politics/elections/marco-rubio-trump-vp-shortlist-b68c7791"
  },
  {
    "text": "Jill Biden reacts to Hunter Biden's conviction  —  The first lady said that the trial marked “a tough week for my family,” adding that they “had to relive ... the tough times.”  —  PHOENIX — First lady Jill Biden discussed Hunter Biden's trial with NBC News on Saturday during a campaign swing … ",
    "url": "https://www.nbcnews.com/politics/joe-biden/jill-biden-reacts-hunter-bidens-conviction-rcna157376"
  },
  {
    "text": "Israel's army will pause daytime fighting along a route in southern Gaza to help ramp up aid  —  The pause is aimed at allowing aid trucks to reach the Israel-controlled Kerem Shalom crossing.  —  JERUSALEM — Israel's military announced on Sunday that it would pause fighting throughout daytime hours along … ",
    "url": "https://www.politico.com/news/2024/06/16/israels-army-will-pause-daytime-fighting-along-a-route-in-southern-gaza-to-help-ramp-up-aid-00163599"
  },
  {
    "text": "MAGA Youth Activist Charlie Kirk's Big Conservative Shindig Is Full of Old Folks  —  Turning Point USA, which casts itself as a conservative political youth movement, appears to be aging.  Founded in 2012 by Charlie Kirk, then 18, TPUSA quickly won the backing of rich Republican megadonors eager … ",
    "url": "https://www.motherjones.com/politics/2024/06/maga-turning-point-usa-action-charlie-kirk-peoples-convention-old-people/"
  }
]