[
  {
    "text": "Scaramucci: ‘Disaster’ if Trump doesn't debate Harris  —  Former White House communications director Anthony Scaramucci signaled Saturday that former President Trump could face “disaster” if he doesn't debate Vice President Harris ahead of November.  —  Harris, who was officially nominated Friday … ",
    "url": "https://thehill.com/homenews/campaign/4809870-anthony-scaramucci-donald-trump-kamala-harris-2024-debate/"
  },
  {
    "text": "Harris plans to use ABC debate time even if Trump doesn't show up  —  Vice President Kamala Harris is planning to show up for the previously agreed-upon debate set for September 10 on ABC - even if Donald Trump does not, a source familiar with the matter tells CNN.",
    "url": "https://www.cnn.com/2024/08/03/politics/kamala-harris-donald-trump-debate/"
  },
  {
    "text": "Trump goes low as Harris gains ground  —  In a succession of crude social media posts, Trump called Harris “low IQ,” “dumb” and lacking “mental capacity.”  —  Donald Trump broadsided Kamala Harris in a string of derisive social media posts on Saturday, focusing his attacks … ",
    "url": "https://www.politico.com/news/2024/08/03/trump-harris-georgia-00172560"
  },
  {
    "text": "Kamala Harris Mocks Donald Trump for ‘Running Scared’ Over Debate  —  Vice President Kamala Harris' campaign responded to former President  —  's announcement that he had “agreed” to a  —  nominee of “running scared” on Saturday.  —  Harris formally became the",
    "url": "https://www.newsweek.com/kamala-harris-mocks-donald-trump-running-scared-over-debate-1934160"
  },
  {
    "text": "Kamala Harris's husband Doug Emhoff cheated on his first wife with daughter Ella's nanny Najen Naylor - and got her PREGNANT  — Doug Emhoff cheated on his first wife with Najen Naylor, now 47  — Naylor also taught at their children's pricey Los Angeles private school",
    "url": "https://www.dailymail.co.uk/news/article-13703933/Kamala-Harris-Doug-Emhoff-cheated-nanny-Najen-Nayler.html"
  },
  {
    "text": "Emhoff acknowledges affair during first marriage after tabloid report  —  Vice President Kamala Harris' husband Doug Emhoff acknowledged Saturday in a statement to CNN that he had an affair during his first marriage after the alleged details of the relationship were published by a British tabloid.",
    "url": "https://www.cnn.com/2024/08/03/politics/doug-emhoff-acknowledges-affair-during-first-marriage/"
  },
  {
    "text": "Jimmy Carter says he's hoping to vote for Kamala Harris as 100th birthday approaches  —  WASHINGTON - Former President Jimmy Carter told family that as he approaches his milestone 100th birthday this fall that he's holding on to vote in the presidential election.",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/08/03/jimmy-carter-kamala-harris-vote-100/74657161007/"
  },
  {
    "text": "Jimmy Carter's next goal is voting for Kamala Harris for president  —  The former president is ‘more alert and interested in politics’ in recent days, his family says  —  As former President Jimmy Carter nears his 100th birthday, his milestone celebration isn't on his mind.  —  Defeating Donald Trump is.",
    "url": "https://www.ajc.com/politics/jimmy-carters-next-goal-is-voting-for-kamala-harris/UKCLDIUSSJC6JM4NP7HGOEDCNY/"
  },
  {
    "text": "Trump Says Georgia's Governor Is Hampering His Efforts to Win There  —  At a rally in Atlanta, former President Donald J. Trump said the battleground state's governor and its top election official wanted him “to lose” and falsely claimed that he'd won the state twice.",
    "url": "https://www.nytimes.com/2024/08/03/us/politics/trump-rally-georgia.html"
  },
  {
    "text": "Trump reopens old feud in Georgia.  Some Republicans are scratching their heads.  —  Some Republicans warned Trump's comments could threaten his already shaky prospects in the state.  —  Former President Donald Trump is reopening an old feud with Republicans in Georgia.",
    "url": "https://www.politico.com/news/2024/08/03/trump-brian-kemp-georgia-00172564"
  },
  {
    "text": "Senate Republicans forgot Trump's recklessness.  It's back to haunt them.  —  GOP senators relished watching Democratic infighting during the summer, neglecting that their nominee would never merely focus on policy issues.  —  For weeks, Senate Republicans delighted in the misery of their Democratic counterparts.",
    "url": "https://www.washingtonpost.com/politics/2024/08/03/trump-senate-republicans-race/"
  },
  {
    "text": "Trump congratulates Putin over deal that brought Evan Gershkovich home  —  Trump also seemed to lash out at the deal after it was trumpeted Thursday by President Biden and Vice President Harris, who met the freed prisoners in an emotional ceremony.  —  ATLANTA — Former president Donald … ",
    "url": "https://www.washingtonpost.com/politics/2024/08/03/trump-putin-prisoner-swap-gershkovich/"
  },
  {
    "text": "Fetterman has concerns about Shapiro for V.P., aides tell Harris' team  —  The conversations reveal the intensity of the scrutiny surrounding her selection of a running mate  —  PHILADELPHIA — Pennsylvania Sen. John Fetterman is concerned about the possibility that Vice President Kamala Harris might choose … ",
    "url": "https://www.politico.com/news/2024/08/03/fetterman-shapiro-harris-vp-00172557"
  },
  {
    "text": "Dog whistling past Dixie: Republicans are in over their heads playing the Kamala Harris race card  —  The attempts to disqualify the vice president reek of desperation  —  Donald Trump just made it official, in case you had doubts: The GOP is the party of racism, whether reverse-spun, dog-whistled or broadcast without guise.",
    "url": "https://www.salon.com/2024/08/03/dog-whistling-past-dixie-are-in-over-their-heads-playing-the-kamala-harris-race-card/"
  },
  {
    "text": "How JD Vance Thinks About Power  —  Mr. Vance has been blunt about wanting to break norms and test constitutional limits to execute his ideas: “We have to get pretty wild, pretty far out there.”  —  Mr. Vance has been blunt about wanting to break norms and test constitutional limits to execute his ideas … ",
    "url": "https://www.nytimes.com/2024/08/03/us/politics/jd-vance-donald-trump-2024-campaign.html?unlocked_article_code=1.AE4.248B.wGb1x66odz0i&smid=url-share"
  }
]