[
  {
    "text": "‘Make them pay’: Canada puts Trump's ‘first friend’ Elon Musk's Tesla in the crosshairs of tariff war  —  Canada's EV adoption rate is outpacing that of the U.S., with nearly 17% of new cars sold in the third quarter of 2024 being fully electric, compared to just 8% in the US.  —  Business Today Desk",
    "url": "https://www.businesstoday.in/world/canada/story/make-them-pay-canada-puts-trumps-first-friend-elon-musks-tesla-in-the-crosshairs-of-tariff-war-463097-2025-02-01"
  },
  {
    "text": "B.C. premier announces countermeasures against U.S. tariffs, including ban on ‘red-state’ liquor  —  U.S. President Donald Trump will impose 25% tariff on most Canadian imports beginning Tuesday  —  B.C. Premier David Eby has announced immediate countermeasures in response to incoming U.S. tariffs … ",
    "url": "https://www.cbc.ca/news/canada/british-columbia/bc-premier-david-eby-us-tariffs-1.7448307"
  },
  {
    "text": "Trump launches trade war against Canada with with 25 per cent tariff on most goods  —  U.S. president slaps 25% tariff on most Canadian goods  —  Canada braces for threatened U.S. tariffs  —  President Donald Trump launched a trade war against Canada on Saturday by imposing a 25 per cent tariff … ",
    "url": "https://www.cbc.ca/news/politics/trump-tariffs-canada-february-1-1.7447829"
  },
  {
    "text": "Canada Poised to Retaliate Against Trump Tariffs, Rethink US Reliance  — Freeland, a candidate for PM, calls for tariffs on Tesla cars  — Levies will first hit goods easy to substitute, minister says  —  Canada is set to introduce escalating retaliatory counter-tariffs to try … ",
    "url": "https://www.bloomberg.com/news/articles/2025-02-01/canada-poised-to-retaliate-against-trump-tariffs-while-rethinking-us-reliance"
  },
  {
    "text": "Trump slaps tariffs on Canada, Mexico, China, risking higher prices for U.S. consumers  —  The new levies on America's top trade partners could drive prices higher for cars, electronics, lumber and more, threatening to crimp an economy that the president has vowed to improve.",
    "url": "https://www.nbcnews.com/politics/trump-slaps-tariffs-canada-mexico-china-risking-higher-prices-us-consu-rcna190185"
  },
  {
    "text": "Trump imposes tariffs on Canada, Mexico and China, spurring prospect of inflation and trade conflict  —  President Donald Trump on Saturday signed an order to impose stiff tariffs on imports from Mexico, Canada and China — fulfilling one of his post-campaign commitments to voters that threatened … ",
    "url": "https://apnews.com/article/trump-tariffs-trade-china-mexico-canada-inflation-753a09d56cd318f2eb1d2efe3c43b7d4"
  },
  {
    "text": "Trump signs order imposing tariffs on Canada, Mexico and China  —  It's the first official action of the president's second-term trade war.  —  President Donald Trump on Saturday imposed tariffs on imports from Canada, Mexico and China, the nation's three largest trading partners … ",
    "url": "https://www.washingtonpost.com/business/2025/02/01/tariff-mexico-canada-trump/"
  },
  {
    "text": "Elon Musk's team has gotten access to the Treasury Department's payments system.  — Trump tariffs: The Canadian government has been notified by the United States government that goods exported to the United States will be subject to a 25 percent tariff, with a lower rate for Canadian oil … ",
    "url": "https://www.nytimes.com/live/2025/02/01/us/trump-tariffs-news/treasury-department-payments-system?unlocked_article_code=1.tk4.2ZbK.3uhE-0Ft611J&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Elon Musk's Team Now Has Access to Treasury's Payments System  —  Treasury Secretary Scott Bessent gave Mr. Musk's representatives at the so-called Department of Government Efficiency a powerful tool to monitor and potentially limit government spending.  — 1.4k",
    "url": "https://www.nytimes.com/2025/02/01/us/politics/elon-musk-doge-federal-payments-system.html?unlocked_article_code=1.tk4.2ZbK.3uhE-0Ft611J"
  },
  {
    "text": "Wyden Demands Answers Following Report of Musk Personnel Seeking Access to Highly Sensitive U.S. Treasury Payments System  —  In New Letter to Treasury Secretary Bessent, Wyden Warns That Political Meddling in Treasury Payments Risks Severe Economic Damage, Calls Out Dangerous Conflicts … ",
    "url": "https://www.finance.senate.gov/chairmans-news/wyden-demands-answers-following-report-of-musk-personnel-seeking-access-to-highly-sensitive-us-treasury-payments-system"
  },
  {
    "text": "Senior FBI official forcefully resisted Trump administration firings  —  Brian Driscoll pushed back so aggressively that some feared he would be dismissed.  Driscoll has so far not handed over the names of thousands of FBI agents who worked on Jan. 6th cases.",
    "url": "https://www.nbcnews.com/politics/national-security/senior-fbi-official-forcefully-resisted-trump-administration-firings-rcna190301"
  },
  {
    "text": "BREAKING NEWS: CDC orders mass retraction and revision of submitted research across all science and medicine journals.  Banned terms must be scrubbed.  —  I believe we are breaking news some news here.  To help sustain independent journalism and analysis, please support Inside Medicine.",
    "url": "https://insidemedicine.substack.com/p/breaking-news-cdc-orders-mass-retraction"
  },
  {
    "text": "Ken Martin wins election as the next chair of the Democratic National Committee  —  The DNC's chair election marks a first step for a party looking to fill a void of leadership after the 2024 election.  —  Ken Martin, the longtime leader of the state Democratic Party organization in Minnesota … ",
    "url": "https://www.nbcnews.com/politics/elections/ken-martin-wins-election-chair-democratic-national-committee-rcna190018"
  },
  {
    "text": "The RFK Jr. Op-Ed the Los Angeles Times Didn't Want You to Read  —  Editors note: As The New Republic reported on Friday, the Los Angeles Times—currently in a race to the bottom with The Washington Post to determine which of the two venerable institutions can sell out to Donald Trump the hardest … ",
    "url": "https://newrepublic.com/article/191030/rfk-jr-op-ed-los-angeles-times"
  },
  {
    "text": "The Truth About Democrats, According to Amy Klobuchar  —  Let's skip the happy talk: Democrats are in a dark place.  It's not merely that Donald Trump has rolled back into Washington with an everything-everywhere-all-at- once approach to grabbing power.  The new president is buoyed by eager … ",
    "url": "https://www.nytimes.com/2025/02/01/opinion/amy-klobuchar-interview-democrats-trump.html"
  },
  {
    "text": "Musk's Junta Establishes Him as Head of Government  —  Imagining how we'd cover overseas what's happening to the U.S. right now  —  I've long believed that the American media would be more clear-eyed about the rise and return of Donald Trump if it was happening overseas in a foreign country … ",
    "url": "https://www.doomsdayscenario.co/p/musk-s-junta-establishes-him-as-head-of-government"
  },
  {
    "text": "DOGE Staff Had Questions About the ‘Resign’ Email.  Their New HR Chief Dodged Them  —  “I think the information that you're going to have about this is available to you right now,” Stephanie Holmes told workers at Elon Musk's DOGE who pressed for detail on offers of “deferred resignation.”",
    "url": "https://www.wired.com/story/doge-hr-elon-musk-resignation-fork-road-leaked-staff-meeting/"
  },
  {
    "text": "Rebecca Lobach ID'd as female soldier inside doomed Black Hawk during DC crash  —  The U.S. Army has identified the female soldier in the doomed Black Hawk helicopter which crashed into an American Airlines flight this week, killing more than 60 people.  —  Capt. Rebecca M. Lobach, of Durham … ",
    "url": "https://nypost.com/2025/02/01/us-news/rebecca-lobach-idd-as-female-soldier-inside-doomed-black-hawk-during-dc-crash/"
  },
  {
    "text": "Health Programs Shutter Around the World After Trump Pauses Foreign Aid  —  Lifesaving treatment and prevention programs for tuberculosis, malaria, H.I.V. and other diseases cannot access funds to continue work.  —  Lifesaving health initiatives and medical research projects have shut … ",
    "url": "https://www.nytimes.com/2025/02/01/health/trump-aid-malaria-tuberculosis-hiv.html?unlocked_article_code=1.tk4.KySl.9gK0vyAP6_Wx&smid=url-share"
  },
  {
    "text": "‘This is not right’: Outrage as major government agency accused of ‘breaking the law’  —  The National Transportation Safety Board made a pro-Elon Musk announcement that took onlookers by storm.  —  The NTSB said over the weekend that it would only be announcing news about major aircraft accidents … ",
    "url": "https://www.rawstory.com/trump-musk-ntsb-outrage-x/"
  },
  {
    "text": "A Storied Newspaper Prepares to Print Its Own Obituary  —  The Star-Ledger, New Jersey's longtime paper of record, will publish its final edition on Sunday and become an online-only news outlet.  —  In its heyday, The Star-Ledger, New Jersey's longtime paper of record … ",
    "url": "https://www.nytimes.com/2025/02/01/nyregion/new-jersey-star-ledger-prints-final-edition.html"
  },
  {
    "text": "Trump fires the director of the Consumer Financial Protection Bureau  —  President Donald Trump has fired the director of the Consumer Financial Protection Bureau, Rohit Chopra, in the latest purge of a Biden administration holdover.  Chopra was one of the more important regulators … ",
    "url": "https://apnews.com/article/trump-chopra-consumer-financial-protection-bureau-47b6b39d0eff05ea0c9bca4eacf55b79"
  },
  {
    "text": "Trump says he ordered precision military air strikes on ISIS leaders in Somalia  —  The U.S. military conducted coordinated airstrikes against ISIS operatives in Somalia, the first attacks in the African nation during President Trump's second term.  —  Mr. Trump said Saturday in a post … ",
    "url": "https://www.cbsnews.com/news/trump-air-strikes-isis-leaders-in-somalia/"
  },
  {
    "text": "Pro-RFK Jr. letter to the Senate includes names of doctors whose licenses were revoked or suspended  —  A letter submitted to the U.S. Senate that states it was sent by physicians in support of Robert F. Kennedy Jr.'s nomination as secretary of Health and Human Services includes the names … ",
    "url": "https://apnews.com/article/trump-cabinet-kennedy-health-secretary-doctors-vaccines-a3dc5bdb0be5da29dccaef91c19c9ce4"
  },
  {
    "text": "DOGE is ripping out the guts of government  —  DOGE is beginning to hit, and this piece, by Mike Masnick, provides the best overview I've seen of what's happening. … The gloss that I'd add to what Mike says is this.  Just as happened with Twitter, we are seeing a Silicon Valley power fantasy playing out in real life.",
    "url": "https://www.programmablemutter.com/p/doge-is-ripping-out-the-guts-of-government"
  },
  {
    "text": "CDC advisers push agency to explain data removal, say when info will be restored  —  Agencies took down info on topics including gender, vaccines, and climate change  —  Top advisers to the Centers for Disease Control and Prevention are asking the agency's acting director to explain … ",
    "url": "https://www.statnews.com/2025/02/01/cdc-data-websites-removed-advisers-ask-acting-director-explain-resotre/"
  }
]