[
  {
    "text": "Biden aides slam Trump for calling Hezbollah ‘very smart’  —  Aides to President Biden and his campaign blasted former President Trump on Thursday for remarks a night earlier in which Trump described Hezbollah as “very smart” amid unfolding violence in Israel.",
    "url": "https://thehill.com/homenews/campaign/4251829-biden-aides-slam-trump-for-calling-hezbollah-very-smart/"
  },
  {
    "text": "Why is Trump Trashing Netanyahu?  —  On Wednesday, Donald Trump held a rally in West Palm Beach, Florida.  Considering Palm Beach County has one of the highest concentrations of Jewish people in America, the typical person at a Trump rally is quite conservative, and Israel is now responding … ",
    "url": "https://washingtonmonthly.com/2023/10/12/why-is-trump-trashing-netanyahu/"
  },
  {
    "text": "De Niro warns democracy 'won't survive' Trump reelection  —  Robert De Niro is issuing a dire warning against the country reelecting former President Trump, saying “democracy won't survive the return of a wannabe dictator.”  —  “I've spent a lot of time studying bad men,” the “Godfather” … ",
    "url": "https://thehill.com/blogs/in-the-know/4253058-de-niro-warns-democracy-wont-survive-trump-reelection/"
  },
  {
    "text": "Trump to Return to NYC Court for Civil Fraud Trial (Exclusive)  —  The 2024 GOP frontrunner plans to fly from Iowa after a Monday rally and head to New York State Supreme Court on Tuesday, Wednesday and Thursday … Donald Trump will again head from the presidential campaign trail … ",
    "url": "https://themessenger.com/politics/trump-trial-new-york-court-civil-fraud"
  },
  {
    "text": "Donald Trump Criticizes Israel PM Benjamin Netanyahu, Calls Hezbollah ‘Very Smart’  —  The former president admitted he could have been dishing classified information at a campaign event with a claim about the Israeli leader.  —  LOADING  —  Former President Donald Trump … ",
    "url": "https://www.huffpost.com/entry/donald-trump-israel-hezbollah_n_6527b1aae4b0102e6964bb29"
  },
  {
    "text": "10/12/23 ☀️ Punchbowl News AM … But worse.  Maybe way worse. … Only the stakes this time are higher, the time frame is shorter, the opposition is larger and the House Republican Conference is angrier. … After winning the GOP speaker nomination on Wednesday — barely … ",
    "url": "https://punchbowl.news/archive/101223-punchbowl-news-am/"
  },
  {
    "text": "The New Republican Establishment  —  An alternative Trumpist governing elite gets closer to ruling the party.  —  In the final account, the rise and fall of Kevin McCarthy might read like the familiar tale of a Republican congressional leader toppled by a small but uncompromising right-wing faction.",
    "url": "https://www.nytimes.com/2023/10/12/upshot/new-republican-establishment-speaker.html"
  },
  {
    "text": "Top House Republican Wants Help From Democrats to Pick a Speaker  — House Armed Services Chair Says GOP unable to elect speaker  — Calls on Democratic leader to offer conditions to aid GOP  —  A powerful Republican is looking to Democrats to help resolve his party's impasse over naming a speaker of the House.",
    "url": "https://www.bloomberg.com/news/articles/2023-10-12/democrats-to-the-rescue-some-republicans-see-it-as-solution-to-speaker-impasse"
  },
  {
    "text": "A new indictment charges Sen. Menendez with being an unregistered agent of the Egyptian government  —  Federal prosecutors have rewritten their indictment against U.S. Sen. Bob Menendez of New Jersey and his wife to charge them with conspiring to have him act as an agent of Egypt and Egyptian officials.",
    "url": "https://apnews.com/article/bob-menendez-indictment-c1850764b8ce7c613fc50f0e4f495e87"
  },
  {
    "text": "U.S., Qatar agree to stop Iran from tapping $6 billion fund after Hamas attack  —  U.S. officials and the Qatari government have agreed to stop Iran from accessing a $6 billion account for humanitarian assistance in light of Hamas's attack on Israel, Deputy Treasury Secretary Wally Adeyemo told House Democrats … ",
    "url": "https://www.washingtonpost.com/business/2023/10/12/iran-oil-fund-us-israel/"
  },
  {
    "text": "Blinken describes images of Hamas attack victims, pledges US support on trip to Israel  —  “It's simply depravity in the worst imaginable way,” Blinken said.  —  Secretary of State Antony Blinken on Thursday described gruesome photos and videos he reviewed depicting victims of Hamas' terrorist attack on Israeli civilians.",
    "url": "https://abcnews.go.com/International/blinken-meets-hamas-attack-survivors-pledges-us-support/story?id=103925374"
  },
  {
    "text": "Six Months Ago NPR Left Twitter.  The Effects Have Been Negligible  —  A lot of people threaten to leave Twitter.  Not many of them have actually done it.  —  This was true even before Elon Musk's purchase of the platform a year ago.  But the parade of calamities since … ",
    "url": "https://niemanreports.org/articles/npr-twitter-musk/"
  },
  {
    "text": "What It Would Mean to Treat Hamas Like ISIS  —  The instant I understood the scale of Hamas's attack on Israel, I understood the probable response.  As I read reports of Hamas terrorists murdering entire families, raping Israeli women beside the bodies of their dead friends and dragging Israeli hostages … ",
    "url": "https://www.nytimes.com/2023/10/12/opinion/israel-hamas-isis-gaza.html"
  },
  {
    "text": "Wisconsin Republicans Retreat From Threats to Impeach Liberal Justice  —  Republicans had floated the idea of impeaching Janet Protasiewicz, newly seated on the Wisconsin Supreme Court, before she could undo the party's legislative gerrymander.  But on Thursday, they backed off.",
    "url": "https://www.nytimes.com/2023/10/12/us/politics/wisconsin-republicans-impeach-janet-protasiewicz.html"
  },
  {
    "text": "Poll: Majority blames gov't for Hamas massacre, says Netanyahu must resign  —  An overwhelming majority of 86% of respondents, including 79% of coalition supporters, said the surprise attack from Gaza is a failure of the country's leadership.  —  Four out of five Jewish Israelis believe … ",
    "url": "https://www.jpost.com/israel-news/article-767880"
  },
  {
    "text": "France bans pro-Palestinian protests, citing risk of ‘disturbances to public order’  —  French police used teargas and water cannon to break up a banned rally in support of the Palestinian people in Paris on Thursday after the interior minister said such gatherings were “likely to generate disturbances to public order”.",
    "url": "https://www.reuters.com/world/europe/france-bans-pro-palestinian-protests-citing-risk-disturbances-public-order-2023-10-12/"
  },
  {
    "text": "Republican Sen. Tuberville Warns Against ‘Picking Sides in the Middle East’ in Jaw-Dropping Interview  —  Senator Tommy Tuberville (R-AL) is under fire for telling an interviewer that “when you start picking sides in the Middle East, it can get really messy very quick” amid the violence in Israel spurred by Hamas.",
    "url": "https://www.mediaite.com/news/republican-sen-tuberville-warns-against-picking-sides-in-the-middle-east-in-jaw-dropping-interview/"
  },
  {
    "text": "Van Orden defends outburst at Biden officials over Israel, denies cursing  —  Rep. Derrick Van Orden (R-Wis.) on Thursday defended his questioning of Biden administration officials at a briefing this week on Israel after other lawmakers criticized him for what they called rude and obnoxious behavior.",
    "url": "https://thehill.com/homenews/house/4253013-van-orden-defends-outburst-at-biden-officials-over-israel-denies-cursing/"
  },
  {
    "text": "Waahmbulance time: When your water pipes become rockets, it's Israel's fault there's no water  —  Since Hamas didn't seem to be getting any sympathy at the moment in the “Look what Israel's doing to our buildings!” quarter (I'm admittedly biased)...  ...they've apparently decided to switch tacks.",
    "url": "https://hotair.com/tree-hugging-sister/2023/10/12/waahmbulance-time-when-your-water-pipes-become-rockets-its-israels-fault-theres-no-water-n584219"
  },
  {
    "text": "North Carolina's cautionary tale for purple states  —  Republicans have made themselves so powerful, it doesn't matter if Dems win elections. … North Carolina Republicans are having a very good year, and now that they've locked down both the legislature and the judiciary … ",
    "url": "https://www.publicnotice.co/p/north-carolina-gop-power-grab-roy-cooper"
  }
]