[
  {
    "text": "A 25-Year-Old With Elon Musk Ties Has Direct Access to the Federal Payment System  —  The Bureau of the Fiscal Service is a sleepy part of the Treasury Department.  It's also where, sources say, a 25-year-old engineer tied to Elon Musk has admin privileges over the code that controls Social Security payments, tax returns, and more.",
    "url": "https://www.wired.com/story/elon-musk-associate-bfs-federal-payment-system/"
  },
  {
    "text": "Elon Musk's Blitz Shakes U.S. Government as He Sweeps Through Agencies  —  The billionaire is creating major upheaval as his team sweeps through agencies, in what has been an extraordinary flexing of power by a private individual.  —  The billionaire is creating major upheaval … ",
    "url": "https://www.nytimes.com/2025/02/03/us/politics/musk-federal-government.html?unlocked_article_code=1.uE4.TJsg.JuW7_bu37TM7&smid=url-share"
  },
  {
    "text": "DOGE's access to federal data is ‘an absolute nightmare,’ legal experts warn  —  The latest moves at Treasury have already triggered a lawsuit, with a fight over the dissolution of USAID looming.  —  Elon Musk's headlong rush to take control of crucial federal agencies and functions … ",
    "url": "https://www.politico.com/news/2025/02/03/doge-treasury-usaid-donald-trump-011538"
  },
  {
    "text": "Bessent tells lawmakers Musk's DOGE does not control Treasury payments system  —  The remarks came during a two-hour gathering between the Treasury secretary and GOP members of the House Financial Services Committee.  —  Treasury Secretary Scott Bessent privately reassured Republican lawmakers Monday … ",
    "url": "https://www.politico.com/news/2025/02/03/bessent-musk-doge-treasury-payments-00202278"
  },
  {
    "text": "Elon Musk Suggests Getting Rid Of All Regulations In Midnight Call  —  “If it's not possible now, it'll never be possible,” Musk said of his proposal to simply ignore all federal regulation as a baseline.  —  LOADING  —  President Donald Trump's “government efficiency” … ",
    "url": "https://www.huffpost.com/entry/elon-musk-regulations-default-gone_n_67a12742e4b09a02376043c7"
  },
  {
    "text": "Elon Musk is a ‘special government employee.’ What does that mean?  —  The SGE designation, which has come under scrutiny under Democrats as well, exempts short-term federal employees from certain disclosure rules.  —  White House press secretary Karoline Leavitt has confirmed that Elon Musk … ",
    "url": "https://www.washingtonpost.com/politics/2025/02/04/elon-musk-special-government-employee-meaning/"
  },
  {
    "text": "Democrats flood the zone with acts of anti-Trump resistance … - “That's not a thing. … - House Minority Leader Hakeem Jeffries (D-N.Y.) unveiled a 10-part plan for countering Trump that includes using the federal funding process to thwart his efforts to “defund programs important to everyday Americans.”",
    "url": "https://www.axios.com/2025/02/04/democrats-trump-house-senate-resistance"
  },
  {
    "text": "What the Musk is Happening?  —  When writing posts for this newsletter, I like to have a clear focus and offer a tightly argued thesis, backed by data.  This, however, won't be that kind of post.  If I had to summarize the state of affairs right now, I would quote Charlie Brown: “Aaugh!”",
    "url": "https://paulkrugman.substack.com/p/what-the-musk-is-happening"
  },
  {
    "text": "Day Five of the Trump-Musk Treasury Payments Crisis of 2025: Not “Read Only” access anymore  —  If you are a current or former career Bureau of the Fiscal Service Employee, especially if you're a legacy IT programmer with years of experience and especially if you are a COBOL programmer currently working … ",
    "url": "https://www.crisesnotes.com/day-five-of-the-trump-musk-treasury-payments-crisis-of-2025-not-read-only-access-anymore/"
  },
  {
    "text": "China counters with tariffs on US products.  It will also investigate Google  —  China countered President Donald Trump's across-the-board tariffs on Chinese products with tariffs on select U.S. imports Tuesday, as well as announcing an antitrust investigation into Google and other trade measures.",
    "url": "https://apnews.com/article/china-tariffs-us-trump-150fab3a44ec055845e47c82bde544c2"
  },
  {
    "text": "The worst thing Trump has done so far  —  About two and a half months ago, I wrote a piece about what foreign aid might look like in the second Trump term.  Reading that piece now feels bizarre.  —  I thought that Trump's second term would look much like his first: lots of proposals … ",
    "url": "https://www.vox.com/future-perfect/397992/trump-usaid-foreign-aid-pepfar-musk-doge"
  },
  {
    "text": "Trump preps order to dismantle Education Dept. as DOGE probes data  —  Closing the agency would require congressional approval, so the new administration hopes to diminish it in the meantime.  —  President Donald Trump is preparing an executive order aimed at eventually closing the Education Department and … ",
    "url": "https://www.washingtonpost.com/education/2025/02/03/trump-education-department-dismantling-executive-order-draft/"
  },
  {
    "text": "About 20,000 federal workers took “buyout” so far, official says  —  About 20,000 federal workers have accepted the “buyout” offer put forward by the Trump administration last week, a senior administration official tells Axios. … - The offer is open through Thursday, meaning the total could rise … ",
    "url": "https://www.axios.com/2025/02/04/trump-buyout-federal-workers-20000"
  },
  {
    "text": "USAID personnel told to stay away from headquarters after Elon Musk's shutdown comments  —  Marocco held several national security positions during the first Trump administration, including at USAID, where he tried to consolidate power and slash funding.  —  WASHINGTON — Secretary … ",
    "url": "https://www.nbcnews.com/politics/white-house/usaid-personnel-told-stay-away-headquarters-elon-musks-shutdown-commen-rcna190405"
  },
  {
    "text": "State audit finds overall unnecessary spending under former UF President Ben Sasse  —  Sasse's expenditures included more than $300,000 in private jet flights  —  A preliminary report from the Florida Auditor General found UF failed to prevent former President Ben Sasse from leveraging … ",
    "url": "https://www.alligator.org/article/2025/02/state-audit-finds-unnecessary-spending-under-ben-sasse"
  },
  {
    "text": "Trump Is Testing Our Constitutional System.  It's Doing Fine.  —  The president's flurry of illegal actions have been stopped by the courts.  That's how it is supposed to work.  —  The Trump administration is subjecting the US constitutional system to a stress test.",
    "url": "https://www.bloomberg.com/opinion/articles/2025-02-04/trump-is-testing-our-constitutional-system-it-s-working-fine?accessToken=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzb3VyY2UiOiJTdWJzY3JpYmVyR2lmdGVkQXJ0aWNsZSIsImlhdCI6MTczODY3NjI0OSwiZXhwIjoxNzM5MjgxMDQ5LCJhcnRpY2xlSWQiOiJTUjVTMkJEV1gyUFMwMCIsImJjb25uZWN0SWQiOiJERUUxNjI0Q0YwRjU0MTBEOENEOEMyRTY5MzM3NDQ1NSJ9.Wz2i87ochvcjsyJ-JYlQVI19OYDcmbwRII5sCU4XFyw"
  },
  {
    "text": "A Coup Is In Progress In America  —  A coup is underway in the United States, and we must stop pretending otherwise.  The signs are unmistakable and accelerating: in just the past 48 hours, Elon Musk's DOGE commission has seized control of Treasury payment systems and gained unauthorized access … ",
    "url": "https://www.techdirt.com/2025/02/03/a-coup-is-in-progress-in-america/"
  },
  {
    "text": "Top ‘60 Minutes’ Producer Says He Will Not Apologize Over Trump Lawsuit  —  Bill Owens, the show's executive producer, addressed his staff as CBS's parent company, Paramount, pursues a legal settlement with the president.  —  The head of “60 Minutes” told the show's staff on Monday … ",
    "url": "https://www.nytimes.com/2025/02/03/business/media/cbs-news-60-minutes-trump.html"
  },
  {
    "text": "Jan. 6 conspiracy theory promoter named to a top State Department job  —  Darren Beattie, who's claimed the FBI was responsible for the 2021 attack on the Capitol, has been named acting undersecretary of state for public diplomacy.  —  A conservative author who has spread conspiracy theories … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/jan-6-conspiracy-theory-promoter-named-top-state-department-job-rcna190497"
  },
  {
    "text": "The Situation: What's Going on at the FBI?  —  Don't look now but the FBI is resisting the political witch-hunt loosed upon it.  —  Meet The Authors … The Situation on Friday was too fluid to write responsibly on the ongoing purge at the FBI.  —  Things have clarified enough today … ",
    "url": "https://www.lawfaremedia.org/article/the-situation--what-s-going-on-at-the-fbi"
  },
  {
    "text": "How Democratic Gen Z activists lost the Gen Z vote  —  This story was originally published in The Highlight, Vox's member-exclusive magazine.  To get early access to member-exclusive stories every month, join the Vox Membership program today.  —  Six months ago, young Democrats were preparing for a very different conversation.",
    "url": "https://www.vox.com/2024-elections/393531/democrat-gen-z-republican-conservative-vote-young-loss-trump"
  },
  {
    "text": "El Salvador offers to house violent US criminals and deportees of any nationality in unprecedented deal  —  El Salvador has agreed to house violent US criminals and receive deportees of any nationality, US Secretary of State Marco Rubio announced Monday, in an unprecedented … ",
    "url": "https://www.cnn.com/2025/02/03/americas/el-salvador-migrant-deal-marco-rubio-intl-hnk/"
  },
  {
    "text": "To Save Democracy, Start Filing Cases  —  The Trump-Musk ransacking of the federal government must stop.  The courts offer one important way to apply the brake, says an administrative law scholar.  —  If you were a state senator in 1975 seeking constitutional advice, any competent lawyer … ",
    "url": "https://washingtonmonthly.com/2025/02/04/to-save-democracy-start-filing-cases/"
  }
]