[
  {
    "text": "Trump to Begin Large-Scale Deportations Tuesday  —  Chicago will be early target and the government will send as many as 200 officers to carry out the operation, according to people familiar with the planning  —  The incoming Trump administration is planning a large-scale immigration raid … ",
    "url": "https://www.wsj.com/politics/policy/trump-to-begin-large-scale-deportations-tuesday-e1bd89bd?st=47HCM3&ref=paydayreport.com"
  },
  {
    "text": "Trump administration planning illegal immigrant arrests throughout US on ‘day one’  —  The incoming Trump administration is eyeing immigration arrests of illegal immigrants across the country as soon as day one, as top officials say they are ready to “take the handcuffs off” Immigration and Customs Enforcement (ICE).",
    "url": "https://www.foxnews.com/politics/trump-administration-planning-illegal-immigrant-arrests-across-us-day-one"
  },
  {
    "text": "Trump's Deportation Plan Is Said to Start Next Week in Chicago  —  The size of the planned immigration raids is unclear, but they would be the opening step in the president-elect's goal of overseeing the largest deportation program in history.  —  The incoming Trump administration intends to carry out … ",
    "url": "https://www.nytimes.com/2025/01/17/us/politics/trump-immigration-raids-chicago.html"
  },
  {
    "text": "Support for Trump's Policies Exceeds Support for Trump  —  A new poll found the public is sympathetic to the president-elect's plans to deport migrants and reduce America's presence overseas.  —  Many Americans who otherwise dislike President-elect Donald J. Trump share his bleak assessment … ",
    "url": "https://www.nytimes.com/2025/01/18/us/politics/trump-policies-immigration-tariffs-economy.html?unlocked_article_code=1.qE4.Axo4.bt2hEdcb0Ofc&smid=url-share"
  },
  {
    "text": "Under Trump's Big Tent, Republicans Are Starting to Clash  —  Donald J. Trump won his battle with establishment Republicans.  Now, it's disputes over immigration, taxes and foreign policy that will test his party's unity.  —  Democrats have long been viewed as the big-tent party … ",
    "url": "https://www.nytimes.com/2025/01/18/us/politics/donald-trump-inauguration-republican-party.html"
  },
  {
    "text": "After major 2024 defeats, the Democratic Party searches for a new direction  —  DETROIT — The Democratic Party begins 2025 with several looming questions about its future.  —  Among them: how to recover from losing the White House and the Senate, in an election that saw Democrats lose … ",
    "url": "https://www.npr.org/2025/01/18/nx-s1-5262358/democratic-party-future-trump"
  },
  {
    "text": "Transition Live Updates: Trump, Citing Cold Weather, Moves Inauguration Indoors  —  Where Things Stand  — President-elect Donald J. Trump announced that he would move his inauguration ceremony inside the Capitol Rotunda on Monday because extreme cold is forecast.",
    "url": "https://www.nytimes.com/live/2025/01/17/us/trump-confirmation-hearings-news"
  },
  {
    "text": "Kennedy Sought to Stop Covid Vaccinations 6 Months After Rollout  —  Robert F. Kennedy Jr. petitioned the F.D.A. to revoke authorization of the shots at a time when they were in high demand and considered life-saving.  —  Robert F. Kennedy Jr., President-elect Donald J. Trump's choice to lead … ",
    "url": "https://www.nytimes.com/2025/01/17/health/rfk-jr-covid-vaccines.html?unlocked_article_code=1.p04.VtD-.Gp_05XPFwAE6&smid=url-share"
  },
  {
    "text": "Biden just announced there's a new constitutional amendment.  Huh?  —  Three days before leaving office, President Joe Biden has made a surprising announcement: He declared that a decades-old proposed Constitutional amendment enshrining equal rights on the basis of sex is now “the law of the land.”",
    "url": "https://www.vox.com/politics/395506/equal-rights-amendment-biden-law-land"
  },
  {
    "text": "Exclusive |  CBS Owner Discusses Settling Trump Suit, With Merger Review on Tap  —  Paramount, owner of CBS, its namesake studio and several cable channels, has a major piece of business in front of the new administration: its planned merger with Skydance Media.",
    "url": "https://www.wsj.com/business/media/cbs-owner-discusses-settling-trump-suit-with-merger-review-on-tap-a5916925?st=J6cdvU&reflink=article_copyURL_share"
  },
  {
    "text": "TikTok to ‘Go Dark’ on Sunday for Its 170 Million American Users  —  The Chinese-owned company said it would cut off its services unless the U.S. assures Apple, Google and other companies that they would not be punished for hosting and distributing TikTok.  —  TikTok said late Friday … ",
    "url": "https://www.nytimes.com/2025/01/17/technology/17tiktok-goes-dark-sunday-apple-google.html"
  },
  {
    "text": "CNN settles lawsuit after $5 million defamation verdict  —  CNN reached a legal settlement with a security contractor Friday after a Florida jury found the network had defamed him by suggesting he was charging “exorbitant prices” to evacuate people from Afghanistan after the U.S. withdrawal in August 2021.",
    "url": "https://www.npr.org/2025/01/17/nx-s1-5251209/cnn-defamation-afghanistan-evacuations-black-market"
  },
  {
    "text": "The Real Story Behind Mike Turner's Firing  —  The speaker's decision to cashier his Intelligence chair wasn't about Donald Trump.  —  When Speaker Mike Johnson summarily fired House Intelligence Chair Mike Turner this week, everyone assumed it was about Donald Trump.",
    "url": "https://www.politico.com/news/magazine/2025/01/18/mike-johnson-mike-turner-firing-column-00199129"
  },
  {
    "text": "Voters Want MAGA Lite From Trump, WSJ Poll Finds  —  Survey shows Biden leaves office with record-low approval and a badly tarnished party  —  Voters support many of the goals President-elect Donald Trump has set for his second term.  They are just not on board with all the ways he wants to accomplish them.",
    "url": "https://www.wsj.com/politics/policy/donald-trump-policy-approval-poll-849feb84?st=AdVB9g"
  },
  {
    "text": "Fox News' Jessica Tarlov Hits Sean Hannity With Blunt Reality Check On Biden  —  Tarlov spotted the “reason” why Donald Trump “wants to take credit” for numbers coming out of the Biden administration.  —  LOADING  —  Fox News' Jessica Tarlov on Friday took on network host Sean Hannity … ",
    "url": "https://www.huffpost.com/entry/fox-news-jessica-tarlov-sean-hannity-biden-trump_n_678b3f56e4b0aa5a1d95ddd5"
  },
  {
    "text": "Curtis Yarvin Says Democracy Is Done.  Powerful Conservatives Are Listening.  —  Philip Montgomery for The New York Times  —  For a long time, Curtis Yarvin, a 51-year-old computer engineer, has written online about political theory in relative obscurity.",
    "url": "https://www.nytimes.com/2025/01/18/magazine/curtis-yarvin-interview.html"
  },
  {
    "text": "Exclusive: Elon Musk May Be the Latest Leader of D.C.'s Line Hotel  —  The president-elect's best new buddy hopes to snap up the hot Adams Morgan address  —  In huge pre-inauguration news, tech titan Elon Musk is slated to be the highest bidder on D.C.'s trendy Line hotel.",
    "url": "https://dc.eater.com/2025/1/17/24346186/exclusive-elon-musk-dc-line-hotel"
  },
  {
    "text": "As Zuckerberg Goes Around Whining About Biden, He Made Sure To First Get His New Approach Approved By Trump  —  Remember how Zuckerberg was “done with politics”?  Remember how he promised that he was going to stop doing what politicians demanded he do?  —  Now it turns out that he not only … ",
    "url": "https://www.techdirt.com/2025/01/17/as-zuckerberg-goes-around-whining-about-biden-he-made-sure-to-first-get-his-new-approach-approved-by-trump/"
  },
  {
    "text": "Bill Gates ‘Impressed’ With Trump's Interest in Global Health During Three-Hour Dinner  —  Microsoft co-founder says he discussed HIV, polio and global health with president-elect  —  Add Bill Gates to growing the list of billionaires dining with President-elect Donald Trump before he returns to the White House.",
    "url": "https://www.wsj.com/politics/policy/bill-gates-donald-trump-meeting-e54fc20d?st=Ljbkqs&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Eric Adams, With Pardon Talk Swirling, Meets With Trump Near Mar-a-Lago  —  The New York mayor, who has expressed interest in a pardon to resolve federal corruption charges, met with President-elect Donald J. Trump and his son Eric on Friday.  —  Mayor Eric Adams of New York City met … ",
    "url": "https://www.nytimes.com/2025/01/17/nyregion/adams-trump-mar-a-lago.html"
  },
  {
    "text": "FBI assistant special agent in charge who said New Orleans attack ‘not a terrorist event’ reassigned  —  The FBI later put out a statement confirming the Bourbon Street attack was ‘terrorism’  —  The FBI assistant special agent in charge who told the media and the public the New Orleans attack was … ",
    "url": "https://www.foxnews.com/us/fbi-assistant-special-agent-charge-who-said-new-orleans-attack-not-terrorist-event-reassigned"
  },
  {
    "text": "Live Updates: Israeli Government Approves Gaza Cease-Fire  —  Prime Minister Benjamin Netanyahu's office said the deal, which includes the release of hostages for Palestinian prisoners, would go into effect on Sunday.  —  Here's the latest on the agreement.",
    "url": "https://www.nytimes.com/live/2025/01/17/world/israel-hamas-gaza-ceasefire"
  },
  {
    "text": "Yellen: Debt limit will be hit day after Trump's inauguration  —  Treasury Secretary Janet Yellen on Friday said the nation will hit its debt ceiling the day after President Trump is inaugurated, and that the agency will begin “extraordinary measures” to stave off the threat of a national default.",
    "url": "https://thehill.com/business/5092786-treasury-yellen-debt-ceiling/"
  },
  {
    "text": "DeWine passes over Ramaswamy, selects Jon Husted for Senate  —  The senator-to-be is an institutionalist Republican similar to the Ohio governor.  —  Gov. Mike DeWine announced his own Lt. Gov. Jon Husted as the next senator from Ohio, passing over entrepreneur and former presidential candidate Vivek Ramaswamy.",
    "url": "https://www.politico.com/news/2025/01/17/ohio-senate-seat-dewine-husted-ramaswamy-00198974"
  }
]