[
  {
    "text": "I Listened to Trump's Rambling, Unhinged, Vituperative Georgia Rally—and So Should You  —  The ex-President is building a whole new edifice of lies for 2024.  —  I'm sure you had better things to do on Saturday evening than watch Donald Trump rant for nearly two hours to an audience of cheering fans in Rome, Georgia.",
    "url": "https://www.newyorker.com/news/letter-from-bidens-washington/i-listened-to-trumps-rambling-unhinged-vituperative-georgia-rally-and-so-should-you"
  },
  {
    "text": "Mike Pence Says He Won't Endorse Donald Trump For President  —  This should come as “no surprise,” Trump's former vice president said.  —  Former Vice President Mike Pence confirmed Friday that he will not be endorsing Donald Trump for president.  —  “It should come as no surprise … ",
    "url": "https://www.huffpost.com/entry/mike-pence-not-endorsing-donald-trump-2024-election_n_65f4ab9de4b0b4d0b8995cbe"
  },
  {
    "text": "Pence says he ‘cannot in good conscience’ endorse Trump  —  Former Vice President Mike Pence on Friday said he “cannot in good conscience” endorse presumptive GOP nominee Donald Trump, arguing that Trump is pursuing an agenda that is “at odds with the conservative agenda.”",
    "url": "https://www.cnn.com/2024/03/15/politics/pence-will-not-endorse-trump/"
  },
  {
    "text": "Live Updates: Judge Says Fani Willis Can Stay on Trump Case If Ex-Boyfriend Withdraws  —  The Atlanta district attorney's romantic relationship with the lead prosecutor she hired to oversee the case created an “appearance of impropriety,” the judge said, ruling that the prosecution can't proceed unless he leaves or she steps aside.",
    "url": "https://www.nytimes.com/live/2024/03/15/us/fani-willis-trump-georgia"
  },
  {
    "text": "Fani Willis can stay on Trump Georgia case, but only if Wade steps aside, judge says  —  ATLANTA — The judge overseeing the Georgia election interference case against former president Donald Trump and his allies ruled that Fulton County District Attorney Fani T. Willis (D) … ",
    "url": "https://www.washingtonpost.com/national-security/2024/03/15/fani-willis-trump-georgia-case/"
  },
  {
    "text": "Lara Trump says she wants to hire QAnon conspiracy theorist Scott Presler to work for the RNC  —  Lara Trump, who was recently elected as co-chair to the Republican National Committee, said on March 14 that she is interested in hiring right-wing influencer, QAnon conspiracy theorist, and … ",
    "url": "https://www.mediamatters.org/lara-trump/lara-trump-says-she-wants-hire-qanon-conspiracy-theorist-scott-presler-work-rnc"
  },
  {
    "text": "Schumer discusses ‘long-shot scenario’ with Manchin: Last-ditch Senate run in West Virginia  —  Hear more from Sen. Joe Manchin and the fight for control of the US Senate on “Inside Politics Sunday with Manu Raju” at 8 a.m. ET and 11 a.m. ET.  —  Senate Majority Leader Chuck Schumer recently discussed … ",
    "url": "https://www.cnn.com/2024/03/14/politics/joe-manchin-independent-senate-run/"
  },
  {
    "text": "Ginsburg family blasts plan to give RBG Award to Musk, Murdoch, others  —  The family of the late Ruth Bader Ginsburg and some of the Supreme Court justice's former colleagues have denounced this year's slate of honorees for an award that a philanthropic foundation bestows in the name of the liberal icon.",
    "url": "https://www.washingtonpost.com/style/power/2024/03/15/ruth-bader-ginsburg-award-backlash/"
  },
  {
    "text": "Supreme Court Narrowly Interprets Landmark Reduced Sentencing Law  —  The justices sided with the government in a case focused on who is eligible for shorter prison sentences under the bipartisan First Step Act passed in 2018.  —  The Supreme Court sided with the government on Friday … ",
    "url": "https://www.nytimes.com/2024/03/15/us/politics/supreme-court-sentencing-first-step-act.html"
  },
  {
    "text": "Trump hush money trial postponed until mid-April, judge rules  —  Manhattan District Attorney Alvin Bragg had said he would support the trial being delayed 30 days, while Trump's legal team requested that it be postponed for 90 days.  —  The trial in the New York hush money case … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-hush-money-trial-briefly-postponed-april-judge-rules-rcna143612"
  },
  {
    "text": "Powerful Realtor Group Agrees to Slash Commissions to Settle Lawsuits  —  The National Association of Realtors will pay $418 million in damages and will amend several rules that housing experts say will drive down housing costs.  —  American homeowners could see a significant drop in the cost … ",
    "url": "https://www.nytimes.com/2024/03/15/realestate/national-association-realtors-commission-settlement.html"
  },
  {
    "text": "Kushner Developing Deals Overseas Even as His Father-in-Law Runs for President  —  Donald Trump's son-in-law, who was also a senior White House official, said he was close to finalizing real estate projects in Albania and Serbia.  —  Jared Kushner, the son-in-law of Donald J. Trump … ",
    "url": "https://www.nytimes.com/2024/03/15/us/politics/jared-kushner-pursuing-development-deals-in-albania-and-serbia.html"
  },
  {
    "text": "How CrowdTangle predicted the future  —  Eight years after buying the data analysis tool CrowdTangle, and four years after it began exasperating the executives responsible for it, Meta said Thursday that it would shut down the tool on August 14.  —  CrowdTangle, a data analysis tool … ",
    "url": "https://www.platformer.news/meta-crowdtangle-shutdown-dsa-platform-transparency/"
  },
  {
    "text": "Brazil's military leaders told police Bolsonaro was involved in plan to reverse 2022 election result  —  Top Brazilian military leaders declared to police that former President Jair Bolsonaro presented them a plan to reverse the results of the 2022 election he lost, but they refused and warned … ",
    "url": "https://apnews.com/article/bolsonaro-military-chiefs-testimonies-arrest-fb03d16461fab0d31846d630fb93acc1"
  },
  {
    "text": "‘Squid Game’ actor O Yeong-su convicted of sexual harassment and given a suspended sentence  —  As he was leaving the court, O told reporters he planned to appeal against the decision.  —  SEOUL — South Korean actor O Yeong-su, who starred in the first season of the hit Netflix series … ",
    "url": "https://www.nbcnews.com/news/world/squid-game-actor-o-yeong-su-convicted-sexual-harassment-suspended-sent-rcna143595"
  },
  {
    "text": "8 in 10 Americans Say Religion Is Losing Influence in Public Life  —  Few see Biden or Trump as especially religious Few see Biden or Trump as especially religious  —  How we did this  —  A new Pew Research Center survey finds that 80% of U.S. adults say religion's role in American life is shrinking … ",
    "url": "https://www.pewresearch.org/religion/2024/03/15/8-in-10-americans-say-religion-is-losing-influence-in-public-life/"
  },
  {
    "text": "Mike Johnson Suddenly Seems Ready to Stick a Shiv in MAGA  —  Poor Mike Johnson is in quite a bind.  The House speaker simply doesn't have a governing majority: It is borderline impossible to pass anything with only Republican votes, because the hard-right MAGA bloc wants to thwart governing at all costs.",
    "url": "https://newrepublic.com/article/179861/mike-johnson-ukraine-aid-bill-shiv-maga"
  }
]