[
  {
    "text": "Forget No Labels.  Biden's Third-Party Peril is on the Left.  —  LOS ANGELES — Memo to Democrats: It's not Nancy Jacobson who's disrupting President Joe Biden's speeches most every time he appears in public and it's also not Nancy Jacobson floating Robert F. Kennedy Jr. $15 million to help him get on general election ballots.",
    "url": "https://www.politico.com/news/magazine/2024/02/04/biden-third-party-peril-00139380"
  },
  {
    "text": "Biden hits Trump during campaign HQ speech: He's ‘not for anything’ and ‘against everything’  —  President Biden hit former President Trump Saturday, claiming the GOP front-runner doesn't “stand for anything,” during a stop at his campaign headquarters in Wilmington, Del., near his family home.",
    "url": "https://thehill.com/homenews/campaign/4446546-biden-hits-trump-during-campaign-hq-speech/"
  },
  {
    "text": "Biden Says This Is the ‘Weirdest Campaign Ever’ as Trump Suggests He's an Elvis Lookalike  —  He's also compared himself to the Mona Lisa for his ability to draw large, fawning crowds.  —  President Joe Biden on Saturday said the 2024 presidential race was “the weirdest campaign I've ever been engaged in” … ",
    "url": "https://www.thedailybeast.com/biden-says-this-is-the-weirdest-campaign-ever-as-trump-claims-hes-an-elvis-lookalike"
  },
  {
    "text": "The Polling ‘Disaster’ That's Starting To Terrify Team Trump  —  Polls show a criminal conviction could torpedo Donald Trump's chances in 2024 — and some of his close advisers are telling him to take it seriously  —  IN THE MIDDLE of last year, several of Donald Trump's closest advisers … ",
    "url": "https://www.rollingstone.com/politics/politics-features/polling-disaster-terrify-team-trump-criminal-1234959962/"
  },
  {
    "text": "Biden brings home first official win in South Carolina primary  —  President Biden won the Democratic primary in South Carolina on Saturday, notching a decisive victory in his party's first official nominating contest.  —  The Associated Press called the race shortly after polls closed Saturday night.",
    "url": "https://www.washingtonpost.com/politics/2024/02/03/biden-south-carolina-primary/"
  },
  {
    "text": "US, Britain strike Yemen's Houthis in a new wave, retaliating for attacks by Iran-backed militants  —  The United States and Britain struck 36 Houthi targets in Yemen on Saturday in a second wave of assaults meant to further disable Iran-backed groups that have relentlessly attacked American … ",
    "url": "https://apnews.com/article/iraq-iran-syria-jordan-strikes-us-2f235ac0d00edc266576ef0d76fa33e4"
  },
  {
    "text": "When Joe Biden lost his purpose  —  Between his son's death and his presidential run, Biden cast about for meaning  —  Several months before Joe Biden left the vice presidency, Louis Freeh, the former FBI director, began messaging Hunter Biden in hopes of enticing his father into a business partnership.",
    "url": "https://www.washingtonpost.com/politics/2024/02/03/joe-biden-beau-death/"
  },
  {
    "text": "Kinzinger blasts Republican efforts to link border security with Ukraine funding: ‘The whole party has become a joke’  — Former GOP Rep. Adam Kinzinger blasted the GOP for its attempt to tie Ukraine aid to border security.  — “It's not a serious party,” the former congressman told CNN's Christiane Amanpour.",
    "url": "https://www.businessinsider.com/kinzinger-gop-border-security-immigration-ukraine-funding-joke-2024-2"
  },
  {
    "text": "Nikki Haley Tries to Keep South Carolina From Ending Her Campaign  —  Former governor faces high expectations in her home state and the need to cut into deep-rooted support for Donald Trump  —  COLUMBIA, S.C.—When Nikki Haley announced her presidential bid almost a year ago … ",
    "url": "https://www.wsj.com/politics/elections/nikki-haley-tries-to-keep-south-carolina-from-ending-her-campaign-422b572e?mod=followamazon"
  },
  {
    "text": "Trump's team worries about a hollow victory in Nevada  —  Donald Trump is virtually assured of winning all 26 of the delegates available in Nevada's GOP caucuses Thursday, but his team is worried that the state's plan to hold a primary two days before the caucuses could wind up embarrassing the former president.",
    "url": "https://www.axios.com/2024/02/04/trump-team-worries-hollow-victory-nevada"
  },
  {
    "text": "They hoped solar panels would secure the future of their farm.  Then their neighbors found out  —  GARDNER, Kansas − Donna Knoche made her way up to the podium at the Johnson County Commission hearing on June 6, 2022, her new yellow shirt crisp and her voice steady.",
    "url": "https://www.usatoday.com/story/news/investigations/2024/02/04/solar-power-in-kansas/71920670007/"
  },
  {
    "text": "The Israeli Firebrand Driving Netanyahu Further to the Right  —  Itamar Ben-Gvir spells out his plan for resettling Gaza during a rare interview and says Trump would be better for Israel than President Biden  —  BNEI BRAK, Israel—As Israel and the U.S. wrestle over a deal to free … ",
    "url": "https://www.wsj.com/world/middle-east/the-israeli-firebrand-driving-netanyahu-further-to-the-right-dd9e8113?mod=followamazon"
  },
  {
    "text": "Wisconsin Democrats inch closer to overturning Republican-drawn legislative maps  —  Wisconsin Democrats are inching closer to overturning Republican-drawn legislative maps that the GOP has used over the past 13 years to grow their majorities and advance their agenda.",
    "url": "https://apnews.com/article/wisconsin-redistricting-republican-democrat-gerrymandering-3005729fef164ececa603b21cb6b0a42"
  },
  {
    "text": "Moms for Liberty faces new challenges and growing pushback over its conservative education agenda  —  In Florida, where the right-wing Moms for Liberty group was born in response to Covid-19 school closures and mask mandates, the first Brevard County School Board meeting of the new year considered whether … ",
    "url": "https://www.cnn.com/2024/02/03/us/moms-for-liberty-scandal-opposition/"
  },
  {
    "text": "Mike Gill, former Trump official, dies days after being shot in DMV carjacking spree  —  WASHINGTON - Mike Gill, a married father of three who was also a member of former President Donald Trump's administration, has died.  He was shot during a deadly carjacking rampage in Washington, D.C. last Monday night.",
    "url": "https://www.fox5dc.com/news/mike-gill-former-trump-official-dies-days-after-being-shot-in-dmv-carjacking-spree"
  },
  {
    "text": "Can Trump be on the ballot?  It's the Supreme Court's biggest election test since Bush v. Gore  —  WASHINGTON (AP) — A case with the potential to disrupt Donald Trump's drive to return to the White House is putting the Supreme Court uncomfortably at the center of the 2024 presidential campaign.",
    "url": "https://apnews.com/article/supreme-court-trump-insurrection-2024-election-45728c8a2f1e863ed94e14891aea5d47"
  }
]