[
  {
    "text": "Clarence Thomas Secretly Participated in Koch Network Donor Events  —  Friends of the Court: SCOTUS Justices' Beneficial Relationships With Billionaire Donors  —  Supreme Court Justice Clarence Thomas' decadeslong friendship with real estate tycoon Harlan Crow and Samuel Alito's luxury travel … ",
    "url": "https://www.propublica.org/article/clarence-thomas-secretly-attended-koch-brothers-donor-events-scotus"
  },
  {
    "text": "Senator Robert Menendez Is Indicted in New York  —  Mr. Menendez, a New Jersey Democrat, was charged six years after his trial in a different corruption case ended in a hung jury.  —  Senator Robert Menendez of New Jersey, the chairman of the Foreign Relations Committee … ",
    "url": "https://www.nytimes.com/2023/09/22/nyregion/robert-menendez-indicted.html"
  },
  {
    "text": "Sen. Bob Menendez indicted over gifts of gold bars, car, apartment  —  Menendez has served as senator from New Jersey since 2006.  —  A federal grand jury in New York has returned an indictment against United States Sen. Bob Menendez, D-N.J., chairman of the powerful Foreign Relations Committee.",
    "url": "https://abcnews.go.com/Politics/sen-bob-menendez-indicted-gifts-gold-bars-car/story?id=103407936"
  },
  {
    "text": "Sen. Menendez, wife indicted on bribe charges as probe finds $100,000 in gold bars, prosecutors say  —  U.S. Sen. Bob Menendez of New Jersey and his wife were indicted Friday on charges that they took bribes of cash, gold bars and a luxury car for a range of corrupt acts … ",
    "url": "https://apnews.com/article/senator-menendez-indicted-729db45fcf21c42ba707c9d0139349e9"
  },
  {
    "text": "Playbook PM: Inside the shocking Menendez indictment  —  NOT GREAT, BOB — Federal authorities today unveiled stunning criminal corruption charges against Sen. BOB MENENDEZ (D-N.J.) and his wife, NADINE, which will immediately upend his political career and likely force him to step down as Senate Foreign Relations chair.",
    "url": "https://www.politico.com/newsletters/playbook-pm/2023/09/22/inside-the-shocking-menendez-indictment-00117665"
  },
  {
    "text": "Trump lights his legal defenses on fire on Meet the Press  —  This is why you shut the hell up when you're facing criminal charges. … Last week, Kristen Welker kicked off her tenure at NBC's “Meet the Press” by interviewing Donald Trump.  It was roundly criticized as an epic shitshow … ",
    "url": "https://www.publicnotice.co/p/trump-meet-the-press-legal-defenses-destroyed"
  },
  {
    "text": "Why Did Trump Lose His ‘Billion Dollar Lawyer’?  —  Nasty infighting and a brutal indictment led to Trump parting ways with “one of the finest lawyers I've ever dealt with,” says one Atlanta defense attorney  —  LAST MONTH, WHEN Donald Trump parted ways with “Billion Dollar Lawyer” … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-fulton-county-drew-findling-1234829429/"
  },
  {
    "text": "Playbook: How Matt Gaetz took over the House  —  Presented by With help from Eli Okun and Garrett Ross  —  DRIVING THE DAY  —  NEW SCOTUS INVESTIGATION JUST DROPPED — ProPublica is up with its latest must-read dive into ethics on the Supreme Court.  This time, the story centers … ",
    "url": "https://www.politico.com/newsletters/playbook/2023/09/22/how-matt-gaetz-took-over-the-house-00117565"
  },
  {
    "text": "Katherine Clark names the Democrats' price to save Kevin McCarthy  —  The number two Democratic leader in the House reveals the conditions upon which her caucus may lend Kevin McCarthy the votes he needs to pass a CR and fend-off a potential challenge to his speakership.",
    "url": "https://www.politico.com/news/2023/09/22/pbdd-house-minority-whip-katherine-clark-dems-00117441"
  },
  {
    "text": "U.A.W. President Steps Up Pressure on Biden With Invite to Picket Lines  —  President Biden has defended the striking autoworkers, who expanded their walkout on Friday, but has so far not announced plans to visit them.  —  Shawn Fain, the United Automobile Workers president … ",
    "url": "https://www.nytimes.com/2023/09/22/us/politics/uaw-biden-shawn-fain.html"
  },
  {
    "text": "America's Cities Need Republicans, and I'm Becoming One  —  While Dallas has thrived, elsewhere Democratic policies have exacerbated crime and homelessness.  —  Dallas  —  I have been mayor of Dallas for more than four years.  During that time, my priority has been to make the city safer, stronger and more vibrant.",
    "url": "https://www.wsj.com/articles/americas-cities-need-republicans-and-im-becoming-one-dallas-texas-mayor-965dbaa4?mod=followamazon"
  },
  {
    "text": "U.S. will send Ukraine ATACMS long-range missiles for the first time  —  Some in Washington had resisted supplying the weapons system, known as “attack-ems,” out of fear that would widen the war with Russia.  —  U.S to give Ukraine an additional $325 million in military aid",
    "url": "https://www.nbcnews.com/news/world/russia-ukraine-war-atacms-biden-zelenskyy-long-range-missile-rcna116876"
  },
  {
    "text": "‘Waiting for him to drop out’: DeSantis' influence nosedives in Florida  —  Some party members view the once-powerful governor as weakened amid his campaign struggles.  —  TALLAHASSEE, Fla. — Florida Gov. Ron DeSantis is losing his clout in Florida.  —  College boards, stacked … ",
    "url": "https://www.politico.com/news/2023/09/22/desantis-florida-republicans-governor-elections-00117514"
  },
  {
    "text": "Michigan attorney general says fake GOP electors she charged are ‘brainwashed’  —  Michigan Attorney General Dana Nessel said at a recent event with liberal activists that the fake Republican electors from 2020 that she charged were “brainwashed” to keep former President Donald Trump in power … ",
    "url": "https://www.cnn.com/2023/09/22/politics/dana-nessel-fake-electors-michigan-comments/"
  },
  {
    "text": "Ted Cruz claims Democrats could parachute Michelle Obama in as presidential nominee  —  Texas Senator Ted Cruz claimed Democrats could “parachute” Michelle Obama in as a presidential nominee if his theory of President Biden dropping out of the race holds true.",
    "url": "https://thehill.com/homenews/campaign/4218505-ted-cruz-claims-democrats-could-parachute-michelle-obama-in-as-presidential-nominee/"
  },
  {
    "text": "Russian state TV promotes new Tucker Carlson show  —  Rightwing former Fox News presenter said he was unaware of the “absurd” claim  —  Russia's flagship state news channel is advertising a new programme hosted by Tucker Carlson, apparently without the firebrand rightwing US TV host's knowledge or consent.",
    "url": "https://www.ft.com/content/5e204059-9455-4b77-a5f7-b5d7fd81e48f"
  },
  {
    "text": "Monopoly busting lawsuit against Amazon expected next week  —  The FTC has been investigating the company for more than four years.  —  A long-awaited antitrust case against Amazon's massive online retail operations is expected to be filed in federal court as soon as Tuesday, according to three people with knowledge of the matter.",
    "url": "https://www.politico.com/news/2023/09/22/lawsuit-against-amazon-expected-next-week-00117609"
  },
  {
    "text": "Office of Management and Budget to initiate process of preparing for a shutdown  —  While the House and Senate remain far apart on a spending deal, the federal government will soon formally initiate the process of preparing for a potential shutdown, participating in the mandatory but standard process … ",
    "url": "https://www.cnn.com/2023/09/22/politics/omb-government-shutdown-process/"
  },
  {
    "text": "Hillary Clinton on Trump saying he's unlikely to pardon himself: 'I don't believe him'  —  In an interview set to air Sunday, former presidential candidate Hillary Clinton said she doesn't believe former President Trump when he said it would be very unlikely that he would pardon himself.",
    "url": "https://thehill.com/homenews/4218428-clinton-on-trump-saying-hes-unlikely-to-pardon-himself-i-dont-believe-him/"
  },
  {
    "text": "U.S. braces for calamitous, costly government shutdown in eight days  —  Federal workers and military service members won't be paid, while federal programs — from some food safety inspections to child care funds — come to an abrupt halt  —  Millions of federal employees … ",
    "url": "https://www.washingtonpost.com/business/2023/09/22/us-braces-calamitous-costly-government-shutdown-eight-days/"
  },
  {
    "text": "David Brooks is laughing at you, peasant  —  David Brooks, the “moderate” columnist for the New York Times, is a very deep thinker who understands the important issues of the day well, and who deigns to share his understanding with the plebs as long as he gets a nice paycheck for doing so.",
    "url": "https://hotair.com/david-strom/2023/09/22/david-brooks-is-laughing-at-you-peasant-n579726"
  }
]