[
  {
    "text": "The irony of Trump's angry reaction to his N.H. primary victory  —  So let me get this straight.  Donald Trump, of all people, is outraged by the very idea of a candidate presenting a second-place finish as a success?  —  For speechwriters, remarks after a primary victory are an easy lift.",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/irony-trumps-angry-reaction-nh-primary-victory-rcna135420"
  },
  {
    "text": "Why Republicans are (still) humiliating themselves for Trump  —  Even Nikki Haley will eventually have to kiss the ring. … With close to 90 percent of the vote counted early Wednesday morning evening, Donald Trump had beaten Nikki Haley by just over 10 points in the New Hampshire Republican presidential primary.",
    "url": "https://www.publicnotice.co/p/trump-wins-new-hampshire-primary-24-endorsements"
  },
  {
    "text": "After Trump's NH win, Biden gets the opponent he wants  —  The president's campaign gears up for a Trump rematch  —  MANCHESTER, New Hampshire — The general election has all but begun — and it's the race President Joe Biden's team wanted.  —  Former President Donald Trump's victory … ",
    "url": "https://www.politico.com/news/2024/01/24/trumps-win-biden-gets-opponent-he-wants-00137429"
  },
  {
    "text": "Trump fumes in victory, Haley spins in defeat: Takeaways from New Hampshire … A disgusted Trump lashed out in response, dropping any pretense of civility as he ripped Haley as an “imposter” standing in his way.  —  3 takeaways from New Hampshire … - You wouldn't know it from the tone of her speech … ",
    "url": "https://www.axios.com/2024/01/24/new-hampshire-trump-haley-takeaways"
  },
  {
    "text": "Heaven knows I'm miserable now!  The Smiths star recoils at Trump using his song  —  Donald Trump isn't known for his love of classic British guitar band The Smiths — even though they have a song called “Bigmouth Strikes Again” that could be an ideal soundtrack for his planned return to the White House.",
    "url": "https://www.politico.eu/article/the-smiths-johnny-marr-donald-trump-rally-election/"
  },
  {
    "text": "Trump Wins NH Primary, But Not Quite the Victory He Wanted  —  Trump secured a win in the New Hampshire primary, but it was hardly what he was looking for.  —  CONCORD, New Hampshire—If Donald Trump ever had a chance of having his march to the Republican presidential nomination sidetracked … ",
    "url": "https://www.thedailybeast.com/trump-wins-nh-primary-but-not-quite-the-victory-he-wanted"
  },
  {
    "text": "Playbook: 'That's the guy we will beat'  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  WITH ENDORSEMENTS LIKE THESE — “DeSantis sees ‘big warning signs’ for Trump's candidacy,” by Kimberly Leonard: “Speaking to conservative radio host Steve Deace … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/01/24/thats-the-guy-we-will-beat-00137517"
  },
  {
    "text": "Most N.H. GOP primary voters say Trump fit for presidency even if convicted  —  Trump and Biden won their respective New Hampshire primary elections.  Here are the results, biggest takeaways and what exit polls showed.  —  Learn more about the GOP presidential candidates: Donald Trump and Nikki Haley.",
    "url": "https://www.washingtonpost.com/politics/2024/01/23/new-hampshire-voters-trump-trials-2020-election/"
  },
  {
    "text": "DeSantis says Trump's victory in Iowa is ‘a huge warning’ for Republicans  —  Florida Gov. Ron DeSantis said Tuesday that Donald Trump's commanding victory in Iowa should be “a huge warning sign” for Republicans, comments critical of the former president's influence on the party that come … ",
    "url": "https://www.washingtonpost.com/politics/2024/01/24/ron-desantis-trump-iowa-victory/"
  },
  {
    "text": "Trump Says He Lost 15 Pounds ‘The Hard Way’  —  “You look like you're in fighting shape!”  Fox host Brian Kilmeade gushed while aboard the indicted former president's plane.  —  Fox & Friends co-host Brian Kilmeade spoke with former President Donald Trump ahead of his final rally … ",
    "url": "https://www.thedailybeast.com/trump-says-he-lost-15-pounds-the-hard-way"
  },
  {
    "text": "Trump Hammers Former Press Secretary McEnany After New Hampshire Win: 'Don't Need Any Advice From RINO'  —  The former president told his ex-employee to save her words of wisdom for Nikki Haley  —  JWPlayer  —  Donald Trump has no interest in advice from his former White House press secretary.",
    "url": "https://themessenger.com/politics/donald-trump-kayleigh-mcenany-advice-joe-biden"
  },
  {
    "text": "New Hampshire Primary Takeaway: We Are Not a Serious Country  —  This was the GOP's chance to choose the lane back to respectability and sanity.  Now they're ride or die with Trump, probably forever. … In the words of the unfortunately named Dick Tuck, “The people have spoken—the bastards.”",
    "url": "https://www.thedailybeast.com/new-hampshire-primary-takeaway-we-are-not-a-serious-country"
  },
  {
    "text": "The White House has its own pharmacy—and, boy, was it shady under Trump  —  It wasted $750K during the Trump years and freely handed out Ambien and Provigil.  —  The White House has its own pharmacy that, until recently, could perhaps best be described as a hot mess, according … ",
    "url": "https://arstechnica.com/science/2024/01/the-white-house-has-its-own-pharmacy-and-boy-was-it-shady-under-trump/"
  },
  {
    "text": "New Hampshire Democratic Primary Election Results  —  President Biden did not appear on the ballot in New Hampshire, so voters had to write in his name.  All write-in votes will appear in our results as “unprocessed” before they are identified for Mr. Biden or for another candidate.",
    "url": "https://www.nytimes.com/interactive/2024/01/23/us/elections/results-new-hampshire-democratic-primary.html"
  },
  {
    "text": "1/24/24 ☀️ Punchbowl News AM … The Senate Republican Conference is starting to sound like their House GOP counterparts — a complete mess.  —  Private Senate GOP meetings have devolved into testy exchanges over immigration, Donald Trump and Ukraine, including Tuesday's closed policy lunch.",
    "url": "https://punchbowl.news/archive/12424-punchbowl-news-am/"
  },
  {
    "text": "New Hampshire Republican Primary Election Results  —  Donald J. Trump wins the New Hampshire Republican primary.  —  Race called by The Associated Press.  —  Latest results from just now  —  24% of votes in  —  Republican Primary  —  Candidate Votes Pct.  % Delegates Del.  —  38,755",
    "url": "https://www.nytimes.com/interactive/2024/01/23/us/elections/results-new-hampshire-republican-primary.html"
  }
]