[
  {
    "text": "Putin Pals Say Accused MAGA Media Stars Should Come to Russia for Protection  —  ‘THEY FINALLY WOKE UP’  —  Kremlin media hailed the bombshell influence plot uncovered by the DOJ, which it says saw millions funneled to a MAGA media group in the U.S.  —  This week's Department … ",
    "url": "https://www.thedailybeast.com/putin-pals-say-accused-maga-media-stars-should-come-to-russia-for-protection"
  },
  {
    "text": "YouTubers Are Almost Too Easy to Dupe  —  No wonder Russia finds its useful idiots among the extremely online.  —  Perhaps the most accurate cliché is that if a deal appears too good to be true, then it probably is.  —  To wit: If a “private investor” of unknown origin approaches … ",
    "url": "https://www.theatlantic.com/technology/archive/2024/09/tenet-media-indictment/679743/?gift=bQgJMMVzeo8RHHcE1_KM0VphL_8ZeL3_E3Ounhk8H3s&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Meet the right-wing Canadian influencers accused of collaborating with an alleged Russian propaganda scheme  —  Tenet Media founder Lauren Chen allegedly took funds from pro-Moscow outlet  —  The social media accounts of two of Canada's most vocal far-right pundits have fallen unusually silent … ",
    "url": "https://www.cbc.ca/news/investigates/russian-influence-election-tenet-media-chen-southern-1.7314976"
  },
  {
    "text": "September State Polling: California, Florida, Ohio, Texas  —  Home Polls September State Polling: California, Florida, Ohio, Texas  —  New Emerson College Polling/The Hill statewide polls find Donald Trump leading Kamala Harris by ten in Ohio, 53% to 43%, five in Florida, 50% to 45% … ",
    "url": "https://emersoncollegepolling.com/september-state-polling-california-florida-ohio-texas/"
  },
  {
    "text": "Liz Cheney will back Allred in Texas Senate race  —  Video Player is loading.  —  Play Video  —  RISING: Hunter Biden Pleads Guilty  —  Unmute  —  Current Time 0:00  —  Loaded: 0%  —  Stream Type LIVE  —  Seek to live, currently behind liveLIVE  —  Playback Rate  —  Chapters",
    "url": "https://thehill.com/homenews/campaign/4866581-liz-cheney-backing-allred-texas-senate-race/"
  },
  {
    "text": "Trump Holds Press Event Just To Attack Women Who've Accused Him Of Sexual Assault  —  The GOP presidential nominee weirdly claimed E. Jean Carroll loves “Law & Order” and copied one of the TV show's episodes to lie about him assaulting her.  —  LOADING  —  WASHINGTON — Former President … ",
    "url": "https://www.huffpost.com/entry/donald-trump-sexual-assault-e-jean-carroll_n_66db34f0e4b0abbb7b44a32a"
  },
  {
    "text": "Trump's New E. Jean Carroll Defense Is That He Assaulted Other Women  —  Donald Trump on Friday inexplicably started detailing two horrific sexual assault allegations made against him, as part of a hapless attempt to discredit a completely different sexual assault allegation.",
    "url": "https://newrepublic.com/post/185680/donald-trump-new-e-jean-carroll-defense-assaulted-women"
  },
  {
    "text": "Pakistani National Charged for Plotting Terrorist Attack in New York City in Support of ISIS  —  For Immediate Release  —  Muhammad Shahzeb Khan, also known as Shazeb Jadoon, Attempted to Enter the United States to Carry Out a Mass Shooting at a Jewish Center in New York City  —  Note: View the complaint here.",
    "url": "https://www.justice.gov/opa/pr/pakistani-national-charged-plotting-terrorist-attack-new-york-city-support-isis-0"
  },
  {
    "text": "Former Vice President Dick Cheney will vote for Harris, his daughter Liz Cheney says  —  The younger Cheney, one of former President Donald Trump's most prominent conservative critics, also said she was supporting Democratic Rep. Colin Allred for Senate in Texas.",
    "url": "https://www.nbcnews.com/politics/2024-election/dick-cheney-kamala-harris-liz-cheney-rcna169979"
  },
  {
    "text": "Harris team worried she'll be ‘handcuffed’ by debate rules set by Biden  —  Even some Democrats dismiss her griping as gamesmanship.  But the mic rules are changing her strategy.  —  Kamala Harris had planned to object, fact-check and directly question Donald Trump while he was speaking during their debate next week.",
    "url": "https://www.politico.com/news/2024/09/06/kamala-harris-debate-prep-00177762"
  },
  {
    "text": "Donald Trump gets the ‘inside straight’ he's been hoping for in court  —  The former president has had remarkable success with his strategy of delays, but a legal reckoning looms if he loses the election.  —  Donald Trump has pulled it off.  —  Voters will go to the polls … ",
    "url": "https://www.politico.com/news/2024/09/06/trump-court-delay-strategy-00177810"
  },
  {
    "text": "IRS joins investigation into NYPD's nightclub enforcement practices, commissioner's phone seized  —  The NYPD investigation is one of three News 4 learned are underway connected to top city officials  —  The Internal Revenue Service's Criminal Investigation division has joined … ",
    "url": "https://www.nbcnewyork.com/news/local/irs-joins-federal-investigation-into-nypd-nightclub-enforcement-practices-edward-caban/5771174/"
  },
  {
    "text": "Tucker Carlson blasted for interview with Holocaust revisionist  —  Conservative commentator Tucker Carlson is facing criticism after hosting a Holocaust revisionist on his podcast.  —  Carlson, a former Fox News pundit, now hosts a show, “The Tucker Carlson Show,” on the social media platform X. Earlier … ",
    "url": "https://thehill.com/homenews/media/4866301-tucker-carlson-interview-holocaust-revisionist/"
  },
  {
    "text": "IRS says it has recovered $1.3 billion in unpaid taxes from rich Americans  —  The IRS said Friday that it has recovered $1.3 billion in unpaid taxes from high-income Americans who had either failed to file their returns or who hadn't fully paid what they owed.",
    "url": "https://www.cbsnews.com/news/irs-recovered-1-3-billion-unpaid-taxes-wealthy-taxpayers-audits/"
  },
  {
    "text": "DeSantis' election police questioned people who signed abortion petitions  —  Two residents of Lee County said they were questioned at their homes about the validity of petition signatures.  —  Isaac Menasche remembers being at the Cape Coral farmer's market last year when someone asked … ",
    "url": "https://www.tampabay.com/news/florida-politics/elections/2024/09/06/florida-abortion-amendment-petition-signature-fraud-voters/"
  },
  {
    "text": "Why Trump's word salad answer on child care policy matters  —  Donald Trump and JD Vance were asked in separate events about child care policy.  Vance's answer was ridiculous.  Trump's was worse.  —  For many American families, the cost and availability of child care pose real challenges.",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trumps-world-salad-answer-child-care-policy-matters-rcna169909"
  },
  {
    "text": "Person infected with bird flu in Missouri had no contact with animals  —  The case adds to growing anxiety about the risk of the H5 virus spreading among humans.  —  A person in Missouri has been infected with bird flu, the Centers for Disease Control and Prevention said Friday.",
    "url": "https://www.nbcnews.com/health/health-news/person-infected-bird-flu-missouri-no-contact-animals-know-rcna170010"
  },
  {
    "text": "California state senator's former staffer sues lawmaker for alleged sexual harassment  —  Sen. Marie Alvarado-Gil recently changed her party registration from Democrat to Republican.  —  SACRAMENTO, California — State Sen. Marie Alvarado-Gil's former chief of staff has sued … ",
    "url": "https://www.politico.com/news/2024/09/06/california-sexual-harassment-discrimination-00177846"
  },
  {
    "text": "California Democrat changes affiliation to Republican: 'I've had enough'  —  SACRAMENTO, Calif. (TND) — Former California Senate Majority Leader Gloria Romero, R- District 24, announced on Wednesday she would ditch the Democratic Party and change her affiliation to the GOP.",
    "url": "https://news4sanantonio.com/news/nation-world/california-democrat-changes-affiliation-to-republican-ive-had-enough"
  }
]