[
  {
    "text": "Trump's “Russiagate” crusade enters fraught new territory … - For MAGA, the new focus on “Russiagate” offers a unifying reprieve — a return to familiar territory where Trump is the victim of a conspiracy, not the subject of one.  — It's a retribution campaign that's deeply personal … ",
    "url": "https://www.axios.com/2025/07/24/trump-russiagate-obama-epstein-files"
  },
  {
    "text": "The Epstein bombshell explodes  —  With help from Eli Okun, Bethany Irvine and Ali Bianco  —  Good morning.  It's Thursday.  I'm Adam Wren.  Let's get straight to the news.  —  FIRST IN PLAYBOOK: Republican National Committee Chair Michael Whatley will run for Senate in North Carolina … ",
    "url": "https://www.politico.com/newsletters/playbook/2025/07/24/the-epstein-bombshell-explodes-00473431"
  },
  {
    "text": "White House tightens its grip on Jeffrey Epstein messaging  —  White House aides have made it clear that no one in the administration is allowed to talk about Epstein without high-level vetting as Trump attempts to change the subject.  —  WASHINGTON — Jeffrey Epstein is dead, but the White House can't seem to kill his story.",
    "url": "https://www.nbcnews.com/politics/trump-administration/white-house-tightens-grip-jeffrey-epstein-messaging-rcna220615"
  },
  {
    "text": "MAGA Inches Closer to a Ghislaine Maxwell Alliance  —  DONALD TRUMP'S JEFFREY EPSTEIN DISASTER has now been dragged into its third week, with the Wall Street Journal's report Wednesday confirming that Trump's own name is in the Epstein files and that he knew it back in May.",
    "url": "https://www.thebulwark.com/p/maga-inches-closer-to-a-ghislaine-maxwell-alliance-donald-trump-jeffrey-epstein"
  },
  {
    "text": "Trump White House Rages Over ‘South Park’ Episode, Calls Show ‘Fourth-Rate’  —  The president cowed Paramount execs, but the company's talent is rebelling.  Now, the administration is melting down … “The Left's hypocrisy truly has no end — for years they have come after South Park … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-white-house-rages-south-park-premiere-1235393132/"
  },
  {
    "text": "South Park skewers Trump over Epstein files, depicts him in bed with Satan … After a two-year break, “South Park” returned to TV on Wednesday night with an explosive episode aimed squarely at Donald Trump that depicted the president in bed with Satan and referenced Jeffrey Epstein.",
    "url": "https://www.politico.com/news/2025/07/24/south-park-skewers-donald-trump-jeffrey-epstein-files-00473442"
  },
  {
    "text": "Hulk Hogan Dead at 71  —  EXCLUSIVE  —  Wrestling legend Hulk Hogan has died at 71 years old, TMZ Sports has learned.  —  Medics were dispatched to the WWE icon's Clearwater, Florida home early Thursday morning ... with operators stating it was regarding a “cardiac arrest.”  —  CARDIAC ARREST CALLED IN",
    "url": "https://www.tmz.com/2025/07/24/hulk-hogan-dead/"
  },
  {
    "text": "Columbia ends uncertainty with Trump deal, head says  —  Columbia University's agreement to pay over $200 million to the U.S. government in a settlement with President Donald Trump's administration to resolve federal probes and restore most of its suspended federal funding ends a period of … ",
    "url": "https://www.reuters.com/legal/government/columbia-ends-uncertainty-with-trump-deal-head-says-2025-07-24/"
  },
  {
    "text": "Independents Drive Trump's Approval to 37% Second-Term Low  —  WASHINGTON, D.C. — Six months into his second term, President Donald Trump's job approval rating has dipped to 37%, the lowest of this term and just slightly higher than his all-time worst rating of 34% at the end of his first term.",
    "url": "https://news.gallup.com/poll/692879/independents-drive-trump-approval-second-term-low.aspx"
  },
  {
    "text": "The Supreme Court Is Now Asking Judges to Do the Impossible … The Supreme Court expanded Donald Trump's power yet again on Wednesday, granting him the authority to fire Democratic members of the Consumer Product Safety Commission in direct violation of federal law.",
    "url": "https://slate.com/news-and-politics/2025/07/supreme-court-precedent-judges-must-rule-for-trump.html"
  },
  {
    "text": "Amy Sherald Cancels Her Smithsonian Show, Citing Censorship  —  The artist said that she made the decision after she said she learned that her painting of a transgender Statue of Liberty might be removed to avoid provoking President Trump.  —  Amy Sherald — the artist who rocketed to fame … ",
    "url": "https://www.nytimes.com/2025/07/24/arts/design/amy-sherald-smithsonian-censorship.html?unlocked_article_code=1.Y08.Wq7P.vQrr0WNRL1br&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Social Security recipients set to face an $18,000 benefit cut in just seven years  —  Retirees are facing the prospect of substantial Social Security cuts in just seven years, sooner than projected, due to the “big, beautiful bill,” per an analysis out Thursday from the Committee for a Responsible Federal Budget.",
    "url": "https://www.axios.com/2025/07/24/social-security-recipients-benefit-cut"
  },
  {
    "text": "UnitedHealth says DOJ is investigating company after it denied inquiry  —  Insurance giant UnitedHealth Group said Thursday the Department of Justice is investigating the company for its Medicare billing practices.  —  The Wall Street Journal reported in May that the DOJ was conducting … ",
    "url": "https://www.washingtonexaminer.com/news/3480955/unitedhealth-investigation-doj-after-previously-denying-probe/"
  },
  {
    "text": "As Starvation Rises, Israeli Minister Says Israel Is ‘Driving Out’ Gazans  —  Amichay Eliyahu's comments came amid growing hunger in the territory, where Israel controls the delivery of food.  —  Amid rising starvation in the Gaza Strip, an Israeli government minister said on Thursday … ",
    "url": "https://www.nytimes.com/2025/07/24/world/middleeast/israel-minister-gaza-driving-out.html"
  },
  {
    "text": "ChatGPT Gave Instructions for Murder, Self-Mutilation, and Devil Worship  —  OpenAI's chatbot also said “Hail Satan.”  —  On Tuesday afternoon, ChatGPT encouraged me to cut my wrists.  Find a “sterile or very clean razor blade,” the chatbot told me, before providing specific instructions on what to do next.",
    "url": "https://www.theatlantic.com/technology/archive/2025/07/chatgpt-ai-self-mutilation-satanism/683649/?gift=bQgJMMVzeo8RHHcE1_KM0cxSx11Lntx4lJmT0kSHB7A&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Gazans Are Dying of Starvation … Displaced Palestinians waited in front of a charity kitchen in western Gaza City on Wednesday.  These kitchens are funded by Arab and Western countries and aid groups.  —  Atef Abu Khater, 17, who was healthy before Gaza was gripped by war … ",
    "url": "https://www.nytimes.com/2025/07/24/world/middleeast/gaza-starvation.html?unlocked_article_code=1.Y08.TIOr.U_9nhL9YPqLw&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Newsmax's Greg Kelly on Ghislaine Maxwell: “She just might be a victim.  She just might be.  There was a rush to judgment.”  —  THE LATEST",
    "url": "https://www.mediamatters.org/greg-kelly/newsmaxs-greg-kelly-ghislaine-maxwell-she-just-might-be-victim-she-just-might-be-there"
  },
  {
    "text": "Trump to sign order pushing cities and states to remove homeless people from streets  —  Amid record high homelessness, Trump wants to move homeless people from the streets and into treatment centers.  —  WASHINGTON ― President Donald Trump is set to take executive action that looks … ",
    "url": "https://www.usatoday.com/story/news/politics/2025/07/24/trump-homeless-people-streets-order-housing/85358060007/"
  },
  {
    "text": "‘I Want to Clear My Name’: Deported Migrant Takes First Step to Sue the U.S.  —  Neiyerver Adrián Leon Rengel, who was held in a prison in El Salvador, filed a claim Thursday against Homeland Security, accusing it of wrongful detention.  —  A Venezuelan migrant took the first step … ",
    "url": "https://www.nytimes.com/2025/07/24/us/venezuelan-migrant-us-wrongful-detention.html"
  },
  {
    "text": "Sen. Angus King Admits His Vote For Anti-Abortion Judge Was ‘A Mistake’  —  The Maine senator says he was “not fully” aware of Josh Divine's record, but “took Josh Hawley's advice” to confirm him to a lifetime federal judgeship.  —  WASHINGTON — Sen. Angus King (I-Maine) admitted Thursday that he made … ",
    "url": "https://www.huffpost.com/entry/angus-king-mistake-josh-divine-abortion_n_688257c1e4b036c6e7022a68"
  },
  {
    "text": "UAW Statement on U.S. Trade Agreement with Japan  —  The UAW is deeply angered by the Trump administration's announced trade deal with Japan.  What we've seen so far makes one thing clear: American workers are once again being left behind.  —  For decades, Japanese automakers … ",
    "url": "https://uaw.org/uaw-statement-on-u-s-trade-agreement-with-japan/"
  },
  {
    "text": "Donald, the Call Is Coming From Inside the House  —  U.S. chipmaker Nvidia really wants to be able to sell AI components in China; U.S. foreign policy hawks are keen to stop that from happening.  President Biden formerly placed strict export controls on the chips.",
    "url": "https://www.thebulwark.com/p/donald-the-call-is-coming-from-inside-house-bondi-patel-bongino-epstein-poll-trump"
  },
  {
    "text": "Pentagon suspends participation in think tank events … The move would sideline the Pentagon from national security dialogues that it has used for decades to advance its policy and explain the department's rationale.  Former Defense Secretaries Jim Mattis, Mark Esper and Lloyd Austin … ",
    "url": "https://www.politico.com/news/2025/07/24/pentagon-think-tank-events-ban-00473621"
  },
  {
    "text": "French President Macron says France will recognize Palestine as a state  —  French President Emmanuel Macron announced Thursday that France will recognize Palestine as a state, amid snowballing global anger over people starving in Gaza.  Macron said in a post on X that he will formalize … ",
    "url": "https://apnews.com/article/france-recognize-palestine-state-macron-800ed63143f0653a7f215ad96f7038d3"
  },
  {
    "text": "IRS considers eliminating non-English language tax services  —  To comply with an order making English the official language, Treasury officials say the IRS may need to get rid of free interpreters and translation services.  —  Trump administration officials are considering eliminating multi … ",
    "url": "https://www.washingtonpost.com/business/2025/07/24/irs-non-english-tax-services-trump-administration/"
  },
  {
    "text": "Senate GOP-led panel delays testimony for Trump special counsel nominee  —  The Senate Committee on Homeland Security and Governmental Affairs has indefinitely delayed President Donald Trump's pick to run an independent watchdog that investigates wrongdoing in the federal government.",
    "url": "https://www.politico.com/live-updates/2025/07/24/congress/panel-punts-special-counsel-nom-00473663"
  },
  {
    "text": "White House rejects disaster relief Wes Moore requested for Maryland floods  —  The Trump White House on Wednesday rejected a disaster relief request from Gov. Wes Moore (D-MD) following devastating flooding in western Maryland.  —  Moore requested $15.8 million in disaster relief funds … ",
    "url": "https://www.washingtonexaminer.com/news/3480756/white-house-rejects-disaster-relief-gov-moore-requested-for-maryland-floods/"
  },
  {
    "text": "Marjorie Taylor Greene takes aim at Trump on artificial intelligence  —  Rep. Marjorie Taylor Greene (R-Ga.) is taking aim at a recent executive order from President Donald Trump looking to expand artificial intelligence capacities in the U.S., the latest prominent break between the president … ",
    "url": "https://www.politico.com/live-updates/2025/07/24/congress/marjorie-taylor-greene-ai-trump-00474396"
  }
]