[
  {
    "text": "The National Guard in Los Angeles  —  The president hasn't invoked the Insurrection Act.  He's instead relying on a theory of inherent constitutional power that is far more limited.  —  Meet The Authors … Late yesterday, President Donald Trump signed a Presidential Proclamation mobilizing … ",
    "url": "https://www.lawfaremedia.org/article/the-national-guard-in-los-angeles"
  },
  {
    "text": "Department of Defense Security for the Protection of Department of Homeland Security Functions  —  MEMORANDUM FOR THE SECRETARY OF DEFENSE  —  THE ATTORNEY GENERAL THE SECRETARY OF HOMELAND SECURITY  —  Numerous incidents of violence and disorder have recently occurred and threaten … ",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/06/department-of-defense-security-for-the-protection-of-department-of-homeland-security-functions/"
  },
  {
    "text": "Trump Is Calling Up National Guard Troops Under a Rarely Used Law  —  President Trump bypassed the authority of Gov. Gavin Newsom to call up 2,000 National Guard troops to quell immigration protests.  —  President Trump took extraordinary action on Saturday by calling up 2,000 National Guard troops … ",
    "url": "https://www.nytimes.com/2025/06/07/us/trump-national-guard-deploy-rare.html?unlocked_article_code=1.NU8.MiJi.wIHcOlpxIz7P&smid=url-share"
  },
  {
    "text": "The Big Ugly: Stephen Miller Uses His War on Home Depot to Invade California  —  Yesterday, Trump used the opportunity of a protest against brutal ICE action staged out of Paramount, CA (close to a Home Depot location) to federalize 2,000 California National Guard for force protection … ",
    "url": "https://www.emptywheel.net/2025/06/08/the-big-ugly-stephen-miller-uses-his-war-on-home-depot-to-invade-california/"
  },
  {
    "text": "Live Updates: L.A. Quiet as National Guard Troops Begin to Arrive  —  Protests over immigration raids in the Los Angeles area were expected to continue for a third day.  Gov. Gavin Newsom said President Trump's decision to call in National Guards was “purposefully inflammatory.”  —  Los Angeles",
    "url": "https://www.nytimes.com/live/2025/06/08/us/la-protests-national-guard?unlocked_article_code=1.NU8.VTur.zDx4PMKHJj5g&smid=url-share"
  },
  {
    "text": "National guard arrives in LA after protests over Ice raids as governor says Trump is ‘hoping for chaos’ - US politics live  —  Gavin Newsom says president is looking to ‘justify more crackdowns’ after deploying 2,000 troops to Los Angeles county  —  California governor Gavin Newsom on Trump: 'He's hoping for chaos'",
    "url": "https://www.theguardian.com/us-news/live/2025/jun/08/trump-national-guard-la-protests-immigration-ice-us-politics-live-news"
  },
  {
    "text": "Trump charts new territory in bypassing Newsom to deploy National Guard  —  Legal experts questioned the president's response to unrest in Los Angeles, saying the military personnel involved will face strict limitations under the law.  —  Just now  —  President Donald Trump's order … ",
    "url": "https://www.washingtonpost.com/national-security/2025/06/08/trump-national-guard-la-protests-law/"
  },
  {
    "text": "Republicans Line Up to Back Trump's L.A. National Guard Deployment  —  It's the first time since 1965 that a president has activated National Guard troops over the wishes of local officials.  — Copy  —  Republican lawmakers and Trump administration officials lined up on Sunday morning … ",
    "url": "https://www.notus.org/us-news/republicans-line-up-to-back-trumps-l-a-national-guard-deployment"
  },
  {
    "text": "Breaking With Trump, Bacon Says He Won't Follow His Party ‘Off the Cliff’ … Representative Don Bacon, Republican of Nebraska, has publicly accused President Trump of treating Russia with “velvet gloves,” criticized him for gutting AmeriCorps and questioned his power to impose tariffs without congressional approval.",
    "url": "https://www.nytimes.com/2025/06/08/us/politics/breaking-with-trump-bacon-says-he-wont-follow-his-party-off-the-cliff.html"
  },
  {
    "text": "MAGA Melts Down at ABC Reporter Over Stephen Miller Takedown  —  MAGA is going off on an ABC reporter who dared attack White House Deputy Chief of Staff Stephen Miller.  ABC's Terry Moran wrote Saturday night on X that “what's interesting about [Stephen] Miller” is “not brains.",
    "url": "https://www.thedailybeast.com/maga-melts-down-at-trump-interviewer-terry-moran-over-stephen-miller-takedown/"
  },
  {
    "text": "‘You essentially destroyed any chance I have,’ DNC chair told David Hogg in private meeting  —  Ken Martin expressed frustration and self-doubt in a meeting with other party leaders, according to a two-minute recording obtained by POLITICO.  —  Democratic National Committee Chair Ken Martin … ",
    "url": "https://www.politico.com/news/2025/06/08/martin-hogg-call-private-meeting-00393517"
  },
  {
    "text": "MAGA's blue-collar base waits patiently for populist payoff  —  President Trump's second term has been a payday for the powerful, exposing a disconnect in his promise to deliver for “the forgotten man” of America's working class.  —  Why it matters: The populist paradox at the heart of MAGA … ",
    "url": "https://www.axios.com/2025/06/08/trump-billionaires-working-class-paradox"
  },
  {
    "text": "Trump's deportation program nets positive approval amid contrasting views over its scope, CBS News poll finds  —  Views of the Trump administration's deportation program headed into this weekend with positive net approval from Americans, including continued strong backing from the Republican base … ",
    "url": "https://www.cbsnews.com/news/deportation-immigration-opinion-poll/"
  },
  {
    "text": "Corruption Has Flooded America.  The Dams Are Breaking.  —  President Trump has more than doubled his personal wealth since starting his 2024 election campaign.  Billions of foreign dollars have flowed into his family's real estate and crypto ventures.  A plane that doubles as a … ",
    "url": "https://www.nytimes.com/2025/06/08/opinion/trump-corruption.html?unlocked_article_code=1.NU8.jCkk.kM7pW4UtRZHq&smid=url-share"
  },
  {
    "text": "The U.S. Economy Is Headed Toward an Uncomfortable Summer  —  Companies are freezing hiring and investment to deal with shifting tariff policies.  'Even Trump doesn't know what Trump will do next.'  —  The U.S. economy, which weathered false recession alarms in 2023 and 2024, is entering another uncomfortable summer.",
    "url": "https://www.wsj.com/economy/trump-tariffs-us-economy-business-investment-7d3c6476?st=A1Vq8E&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Musk's DOGE Goons Covertly Transmitted Reams of WH Data  —  Elon Musk's goons at the Department of Government Efficiency transmitted a large amount of data—all of it undetected—using a Starlink Wi-Fi terminal they installed on top of the White House, according to a new report.Starlink … ",
    "url": "https://www.thedailybeast.com/elon-musks-doge-goons-surreptitiously-transmitted-reams-of-white-house-data/"
  },
  {
    "text": "Law Enforcement Officials Struggle to Fulfill Trump Promises Rooted in Conspiracy Theories  —  Top leaders at the Justice Department and the F.B.I. are struggling to fulfill Trump campaign promises often rooted in misinformation and conspiracy theories.  —  Dan Bongino, the intense … ",
    "url": "https://www.nytimes.com/2025/06/08/us/politics/justice-department-fbi-trump-conspiracy-theories.html?unlocked_article_code=1.NU8.w3nB.63piUyYsHncb&smid=url-share"
  }
]