[
  {
    "text": "Trump asks Judge Tanya Chutkan to recuse herself in Jan. 6 case  —  Attorneys for former President Donald Trump want a new judge in his 2020 election interference case.  —  In a filing Monday, they argued that Judge Tanya Chutkan should recuse herself from the case for previous statements they say give the appearance of bias.",
    "url": "https://www.cbsnews.com/news/trump-asks-judge-tanya-chutkan-jan-6-case-to-recuse-herself/"
  },
  {
    "text": "Trump Seeks Recusal of Judge in Federal Elections Case  —  The former president said Judge Tanya S. Chutkan, who is hearing the Justice Department's case accusing him of seeking to overturn the 2020 election, had shown bias against him in public statements.  —  Lawyers for former President … ",
    "url": "https://www.nytimes.com/2023/09/11/us/politics/trump-recusal-judge.html"
  },
  {
    "text": "Trump advisers plot aggressive new tax cuts for second White House term  —  Although the 2017 GOP tax law proved unpopular, the former president is eyeing deeper cuts to the corporate rate  —  As Donald Trump widens his lead over other Republican candidates in the GOP primary … ",
    "url": "https://www.washingtonpost.com/business/2023/09/11/trump-tax-cuts-2024/"
  },
  {
    "text": "Va. Dem.  House candidate performed sex online with husband for tips  —  Susanna Gibson is running in a competitive district with control of the House at stake.  —  RICHMOND — A Democrat running for a crucial seat in Virginia's House of Delegates performed sex acts with her husband … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2023/09/11/susanna-gibson-sex-website-virginia-candidate/"
  },
  {
    "text": "Virginia Democrat candidate posted sex acts with husband online while soliciting tips: report  —  Susanna Gibson, 40, is a nurse practitioner and mother of two  —  A Virginia Democratic candidate running for the commonwealth's House of Delegates is being accused of performing sex acts … ",
    "url": "https://www.foxnews.com/politics/virginia-democrat-candidate-posted-sex-acts-husband-online-soliciting-tips-report"
  },
  {
    "text": "Dems inch toward House majority with recent court wins  —  Court rulings on redistricting are raising Democratic hopes.  —  The fundamentals of the 2024 campaign are still taking shape, but one thing is already clear: A flurry of court actions might cost Republicans the House majority.",
    "url": "https://www.politico.com/news/2023/09/11/redistricting-could-help-democrats-win-back-the-house-00114780"
  },
  {
    "text": "‘Virginia Is the Test Case’: Youngkin Pushes for G.O.P. Takeover This Fall  —  Glenn Youngkin, a popular Republican governor with national ambitions, is trying to help his party take full control of state government in crucial legislative races this year.  —  Virginia, whose off-year elections … ",
    "url": "https://www.nytimes.com/2023/09/11/us/politics/virginia-youngkin-elections.html"
  },
  {
    "text": "US moves to advance prisoner swap deal with Iran and release $6 billion in frozen Iranian funds  —  The Biden administration has cleared the way for the release of five American citizens detained in Iran by issuing a blanket waiver for international banks to transfer $6 billion in frozen Iranian money … ",
    "url": "https://apnews.com/article/us-iran-prisoners-blinken-3e834df0a845ef2cc5c52af14598c66f"
  },
  {
    "text": "FDA Takes Action on Updated mRNA COVID-19 Vaccines to Better Protect Against Currently Circulating Variants  —  For Immediate Release:  —  Today, the U.S. Food and Drug Administration took action approving and authorizing for emergency use updated COVID-19 vaccines formulated … ",
    "url": "https://www.fda.gov/news-events/press-announcements/fda-takes-action-updated-mrna-covid-19-vaccines-better-protect-against-currently-circulating"
  },
  {
    "text": "Marine Capitol rioter gets 1 hour of community service for each of 279 Marine Civil War casualties  —  Dodge Hellonen, who was carrying a yellow “Don't Tread on Me” flag on Jan. 6, was the first of the three Marines to be punished for participating in the Capitol siege.",
    "url": "https://www.nbcnews.com/politics/justice-department/marine-capitol-rioter-gets-1-hour-community-service-279-marine-civil-w-rcna104506"
  },
  {
    "text": "Labor, business reach deal to raise fast-food wages and end California ballot fight  —  California Politics ,Jobs, Labor & Workplace  —  Fast-food companies agreed over the weekend to pull a California referendum off next years ballot that sought to reverse a landmark worker-protections law … ",
    "url": "https://www.latimes.com/california/story/2023-09-11/labor-business-strike-deal-to-end-referendum-over-landmark-california-fast-food-law"
  },
  {
    "text": "Samuel Alito Is Wrong and Arrogant—and Must Be Reined In … Supreme Court Justice Samuel Alito has been in the spotlight lately, and not in a good way.  Embattled over revelations of major ethics violations and calls for Supreme Court ethics reform and now the subject of an ethics charge … ",
    "url": "https://newrepublic.com/article/175403/samuel-alito-wrong-arrogant-supreme-court-ethics"
  },
  {
    "text": "Biden has set the stage for the next 9/11, should resign immediately  —  FRONT PAGE PODCAST  —  Does the country do enough to recognize and remember the events of 9/11?  —  Question of the Day No, we need to do more Yes, it's appropriate No, it's too much  —  STORY TOPICS  —  OPINION:",
    "url": "https://www.washingtontimes.com/news/2023/sep/10/biden-has-set-stage-for-next-911-should-resign-imm/"
  },
  {
    "text": "Hard-Line Conservatives Talk Tough, and Government Shutdown Looms  —  House dissidents make demands on border security and Ukraine, while lawmakers consider a short-term funding deal  —  WASHINGTON—House dissidents say they're serious this time.  —  After putting Kevin McCarthy through 15 ballots … ",
    "url": "https://www.wsj.com/politics/policy/hard-line-conservatives-talk-tough-and-government-shutdown-looms-c0fa851?mod=followamazon"
  },
  {
    "text": "Governor Youngkin Pardons Father Who Was Arrested in School Board Meeting  —  In a Loudoun County, Va., case that became a national flashpoint over transgender rights, Scott Smith rose to accuse a boy of assaulting his daughter, and a fight ensued.  —  In a case that became a national flashpoint … ",
    "url": "https://www.nytimes.com/2023/09/11/us/politics/youngkin-pardon-scott-smith-loudoun.html"
  },
  {
    "text": "TikTok is blocking searches for WGA amid the ongoing writers strike  —  As the Writers Guild of America (WGA) continues to strike, TikTok is blocking searches on the platform for “WGA.”  —  The writers strike began on May 2 after unresolved labor negotiations with the Alliance of Motion Picture and Television Producers.",
    "url": "https://www.mediamatters.org/tiktok/tiktok-blocking-searches-wga-amid-ongoing-writers-strike"
  },
  {
    "text": "MSU football coach Mel Tucker could face “monumental fall” after sexual harassment allegations, reporter says  —  Michigan State University's head football coach Mel Tucker was suspended without pay on Sunday after USA Today reported on harassment allegations against him.",
    "url": "https://www.cbsnews.com/news/mel-tucker-msu-football-coach-sexual-harassment-allegations-monumental-fall-usa-today-kenny-jacoby/"
  },
  {
    "text": "Twitter appears to throttle New York Times  —  The Scoop  —  X, Elon Musk's social media platform formerly known as Twitter, appears to be attempting to limit its users' access to The New York Times.  —  Since late July, engagement on X posts linking to the New York Times has dropped dramatically.",
    "url": "https://www.semafor.com/article/09/10/2023/twitter-appears-to-throttle-new-york-times"
  },
  {
    "text": "‘Christian, The Hugging Lion’ latest children's book banned in Florida - despite no mention of sexuality: report  —  A children's book about a lion raised by two men has been banned in Florida because right-wing activists suspect the men might be gay - despite nothing in the book suggesting … ",
    "url": "https://www.rawstory.com/christian-the-hugging-lion/"
  },
  {
    "text": "Ex-GOP Lawmaker Recalls Wild Moment Colleagues Made His Head Explode  —  “It was incredible to me to listen to that,” former Virginia Republican Denver Riggleman said of his very week in the hardline House Freedom Caucus.  —  LOADING  —  Former Rep. Denver Riggleman (Va.) … ",
    "url": "https://www.huffpost.com/entry/denver-riggleman-house-freedom-caucus_n_64fee85be4b07eb12a0fb052"
  },
  {
    "text": "Biden to mark 9/11 anniversary in Alaska, Harris visits ground zero  —  Biden will deliver remarks to service members and their families in Anchorage.  —  President Joe Biden will mark the 22nd anniversary of the Sept. 11, 2001 terrorist attacks in Alaska on Monday afternoon.",
    "url": "https://abcnews.go.com/Politics/biden-mark-911-anniversary-alaska-harris-visits-ground/story?id=103088628"
  },
  {
    "text": "S.F. judge sends Feinstein suit over husband's assets to mediation  —  A San Francisco Superior Court judge on Monday ordered Sen. Dianne Feinstein and the trustees of her late husband's estate into mediation to resolve a bitter feud over access to his sprawling assets.",
    "url": "https://www.sfchronicle.com/sf/article/feinstein-lawsuit-18359403.php"
  },
  {
    "text": "Climber survives 2,000-foot plunge down side of dangerous New Zealand mountain: “He is exceptionally lucky to be alive”  —  A climber who plunged 600 meters (nearly 2,000 feet) down the side of one of New Zealand's most dangerous mountains was “exceptionally lucky” to survive after landing on snow, police said Monday.",
    "url": "https://www.cbsnews.com/news/climber-survives-2000-foot-plunge-mount-taranaki-new-zealand/"
  },
  {
    "text": "Olympic gold medalist Sarah Hughes decides against congressional campaign  —  Sarah Hughes, a former Olympic figure skating champion, has decided not to run for a congressional seat in her home state of New York after she initially said that she planned to launch a campaign.",
    "url": "https://thehill.com/homenews/campaign/4198186-olympic-gold-medalist-sarah-hughes-decides-against-congressional-campaign/"
  },
  {
    "text": "Protesters Arrested for Storming Kevin McCarthy's Office  —  ‘PASS PEPFAR NOW!’  —  A group of seven activists were arrested for unlawful entry on Monday morning after storming House Speaker Kevin McCarthy's office to demand the passage of the President's Emergency Plan for AIDS Relief, Capitol Police confirmed to The Daily Beast.",
    "url": "https://www.thedailybeast.com/protesters-arrested-for-storming-kevin-mccarthys-office"
  },
  {
    "text": "Dems' immigration letter - Live Updates  —  It's the latest effort on border issues from House Dems as they navigate their minority status.",
    "url": "https://www.politico.com/live-updates/2023/09/11/congress/house-democrats-immigration-biden-00114980"
  }
]