[
  {
    "text": "Cruz's corrupt bargain  —  After the Supreme Court's 2010 decision in Citizens United, there are few restrictions on spending money in federal elections.  But Senator Ted Cruz (R-TX) may have violated one of the last legal guardrails to secure hundreds of thousands of dollars in support of his reelection campaign.",
    "url": "https://popular.info/p/cruzs-corrupt-bargain"
  },
  {
    "text": "Super PACs keep testing the limits of campaign finance law  —  Advocates say lack of enforcement of campaign finance laws means groups can push the envelope with little fear of reprecussions.  —  Super PACs keep pushing the boundaries of campaign finance law this cycle.",
    "url": "https://www.politico.com/news/2024/04/08/super-pac-fec-limits-00150672"
  },
  {
    "text": "Trump's $175 Million Bond Is Even Shadier Than It Looks  —  BOILERPLATE  —  New information shows that the insurance company that swooped in and bailed out Trump with a $175 million bond isn't on a list of vetted companies—and wrote a bizarre contract.",
    "url": "https://www.thedailybeast.com/trumps-dollar175-million-bond-is-even-shadier-than-it-looks"
  },
  {
    "text": "Melania's Appearance With Donald Trump Sparks Mockery: ‘Checking the Clock’  —  Melania Trump's appearance at a fundraiser with husband Donald Trump has prompted mockery on social media.  —  The former first lady has maintained a low profile as her husband seeks to reclaim the White House in 2024.",
    "url": "https://www.newsweek.com/melania-appearance-donald-trump-mockery-1887693"
  },
  {
    "text": "Top Republican warns pro-Russia messages are echoed ‘on the House floor’  —  The latest remarks come after another GOP member said Russian propaganda has ‘infected’ the Republican base  —  Rep. Michael R. Turner (R-Ohio), who chairs the House Permanent Select Committee on Intelligence … ",
    "url": "https://www.washingtonpost.com/politics/2024/04/07/russian-propaganda-republicans-congress/"
  },
  {
    "text": "Judge Cannon's ticking time bomb jury instructions  —  She's got a lot of ways to blow up this case, and appears to be trying this one on for size. … Last week we got an alarming look at a potential route for Judge Aileen Cannon to ruin the case against Donald Trump for stealing government documents … ",
    "url": "https://www.publicnotice.co/p/judge-aileen-cannon-jury-instructions-trump-docs"
  },
  {
    "text": "Congress Has a Lot to Do and No Time to Do It … House Speaker Mike Johnson could get ousted at any moment.  The Senate needs to deal with incoming articles of impeachment for the Homeland Security secretary and confirm more of President Joe Biden's judicial nominees.",
    "url": "https://www.notus.org/congress/house-senate-congress-mike-johnson-schumer"
  },
  {
    "text": "Trump protest vote warnings … - In 10 recent primary contests, more than one-quarter of GOP primary voters cast a ballot for a non-Trump candidate.  — “Joe Biden has a real golden opportunity to capture all those disaffected people who voted for Nikki Haley,” said Arizona-based GOP strategist Barrett Marson.",
    "url": "https://www.axios.com/2024/04/07/trump-biden-protest-vote-2024"
  },
  {
    "text": "Scoop: Trump, GOP plot 2025 criminal probe of Bidens … - A source close to the Trump campaign said that “everything you have seen from the Biden DOJ,” in terms of the charges against Trump, “you can expect to see from the Trump DOJ.”  — One Trump ally argued that there is precedent … ",
    "url": "https://www.axios.com/2024/04/08/trump-gop-plot-biden-probe-2025"
  },
  {
    "text": "Changing Israel positions test NY House race  —  A fiery House primary in New York highlights the Democratic divide over Israel.  —  ALBANY, New York — Rep. Jamaal Bowman, an outspoken Israel critic, has made calls to end the war in Gaza a central theme of his House primary near New York City.",
    "url": "https://www.politico.com/news/2024/04/08/israel-war-new-york-bowman-latimer-00150874"
  },
  {
    "text": "The House Dems who keep using TikTok while voting against it  —  A campaign dilemma: The most popular app among young voters is growing more politically toxic in Washington.  —  To TikTok, or not?  —  For Democrats running in 2024, that question is getting a lot more politically risky.",
    "url": "https://www.politico.com/news/2024/04/08/house-dems-tiktok-00150873"
  },
  {
    "text": "Trump: it would be ‘great honor’ to go to jail for violating gag order  —  Former U.S. President Donald Trump said it would be “my great honor” to go to jail for violating a gag order imposed by the judge who will hear his upcoming trial on charges stemming from a hush-money payment to a porn star.",
    "url": "https://www.reuters.com/world/us/trump-it-would-be-great-honor-go-jail-violating-gag-order-2024-04-07/"
  },
  {
    "text": "Livestreams and video playbacks: Democrats go all in on an unfiltered Trump  —  After the 2016 election, many Democrats pushed networks and social media companies to give Trump less airtime.  Now they're saying voters should get to hear from him more.  —  There was a time when Democratic groups howled … ",
    "url": "https://www.nbcnews.com/politics/2024-election/democrats-platform-unfiltered-trump-media-rcna146094"
  },
  {
    "text": "Biden promises student loan relief as early as this fall through new plan  —  The president, vice president and others plan to fan out across the country this week to trumpet the administration's boldest student debt relief plan since the Supreme Court's rebuke last summer.  —  Zachary Schermele Alia WongUSA TODAY",
    "url": "https://www.usatoday.com/story/news/education/2024/04/08/biden-new-student-loan-forgiveness-proposal/73218916007/"
  },
  {
    "text": "Trump says he'll announce his position on abortion Monday, a key moment in the presidential race  —  Former President Donald Trump says he will finally announce Monday when he believes abortions should be banned, after months of refusing to stake a position on an issue that could decide the outcome of November's presidential election.",
    "url": "https://apnews.com/article/trump-abortion-2024-ban-7bf06e0856b88a710c79a6eb85cffa6a"
  }
]