[
  {
    "text": "Live Updates: Mamdani Holds Lead Over Cuomo in Democratic Primary for N.Y.C. Mayor  —  Zohran Mamdani, a 33-year-old state assemblyman, built a significant advantage over former Gov. Andrew Cuomo thanks to a strong showing in Brooklyn and Manhattan.  A winner might not be declared until ranked-choice ballots are tabulated next week.",
    "url": "https://www.nytimes.com/live/2025/06/24/nyregion/nyc-democratic-primary-election-mayor?unlocked_article_code=1.Rk8.JmS3.B_aryLPg6Yny&smid=url-share"
  },
  {
    "text": "Zohran Mamdani topples Andrew Cuomo in NYC mayoral race  —  The 33-year-old Democratic Socialist lawmaker outpaced the former governor, who has conceded, in a stunning primary, signaling generational change in the Democratic Party.  —  NEW YORK — Zohran Mamdani, a 33-year-old democratic socialist lawmaker … ",
    "url": "https://www.politico.com/news/2025/06/24/mamdani-leads-cuomo-nyc-mayor-race-00422363"
  },
  {
    "text": "Mamdani Stuns Cuomo in New York Mayoral Primary  —  Zohran Mamdani, a state assemblyman and democratic socialist, had a commanding lead over former Gov. Andrew M. Cuomo, who conceded in the Democratic primary.  —  Zohran Mamdani, a little-known state lawmaker whose progressive platform … ",
    "url": "https://www.nytimes.com/2025/06/25/nyregion/cuomo-mamdani-mayor-primary-nyc.html?unlocked_article_code=1.Rk8.BIdr.KtGQRbK9snyA&smid=url-share"
  },
  {
    "text": "Exclusive: Early US intel assessment suggests strikes on Iran did not destroy nuclear sites, sources say  —  The US military strikes on three of Iran's nuclear facilities last weekend did not destroy the core components of the country's nuclear program and likely only set it back by months … ",
    "url": "https://cnn.com/2025/06/24/politics/intel-assessment-us-strikes-iran-nuclear-sites"
  },
  {
    "text": "Iran ‘much further away’ from building nukes after US strike, Rubio says  —  The secretary of state dismissed media reports of new intel assessments as “false.”  —  THE HAGUE, Netherlands - Secretary of State Marco Rubio said on Wednesday that Iran is “much further away from a nuclear weapon” … ",
    "url": "https://www.politico.com/news/2025/06/25/marco-rubio-dasha-burns-interview-nato-00421760"
  },
  {
    "text": "Strike Set Back Iran's Nuclear Program by Only a Few Months, U.S. Report Says  —  Classified findings indicate that the attack sealed off the entrances to two facilities but did not collapse their underground buildings.  —  A preliminary classified U.S. report says the American bombing … ",
    "url": "https://www.nytimes.com/2025/06/24/us/politics/iran-nuclear-sites.html?unlocked_article_code=1.RU8.3ALC.LpnGMmyLfpyW&smid=url-share"
  },
  {
    "text": "Pentagon launches probe into Iran strike intel leak  —  U.S. Defense Secretary Pete Hegseth confirmed the findings after others called it fake news.  —  THE HAGUE — The Pentagon has launched a criminal investigation into the leak of a classified Defense Intelligence Agency report assessing … ",
    "url": "https://www.politico.eu/article/us-pentagon-investigation-iran-intel-leak-pete-hegseth-donald-trump-rubio/"
  },
  {
    "text": "‘Big Balls’ No Longer Works for the US Government  —  The technologist Edward Coristine, a key operative in Elon Musk's so-called Department of Government Efficiency who's gone by the name “Big Balls” online, has resigned, the White House tells WIRED.  —  Edward “Big Balls” Coristine … ",
    "url": "https://www.wired.com/story/big-balls-coristine-doge-resigned-us-government/"
  },
  {
    "text": "Edward Coristine, Key Player on Elon Musk's DOGE Team, Resigns  —  Edward Coristine, the 19-year-old who was hired by Elon Musk to help slash the government bureaucracy, became a public symbol of his team.  —  Edward Coristine, the 19-year-old high-profile operative for the Department … ",
    "url": "https://www.nytimes.com/2025/06/24/us/politics/big-balls-edward-coristine-musk-doge.html"
  },
  {
    "text": "Key GOP senator warns Medicaid cuts could spell political disaster for Republicans  —  Sen. Thom Tillis (N.C.), one of the most vulnerable Senate Republican incumbents facing re-election in 2026, warned Senate Majority Leader John Thune (R-S.D.) bluntly in a private meeting Tuesday that deep cuts … ",
    "url": "https://thehill.com/homenews/senate/5367877-tillis-republicans-mediticaid-cuts/"
  },
  {
    "text": "Presentation for CDC advisers appears to cite nonexistent study to support claims about risk of vaccine preservative  —  A presentation slated to be shared at this week's meeting of vaccine advisers to the US Centers for Disease Control and Prevention claimed that a study in animals suggested … ",
    "url": "https://cnn.com/2025/06/24/health/cdc-vaccine-adviser-thimerosal-presentation"
  },
  {
    "text": "The Supreme Court Is at War With Its Own Judiciary  —  Between May 1 and June 23, federal judges ruled against the Trump administration 94% of the time.  The Supreme Court backed it 94% of the time.  —  The Supreme Court is now in open conflict with the lower courts over cases involving the Trump administration.",
    "url": "https://data4democracy.substack.com/p/the-supreme-court-is-at-war-with"
  },
  {
    "text": "See Vaccine Recommendations Backed by Science in These Handy Charts  —  These graphics will guide you through science-based vaccine guidelines for children and adults  —  Vaccines are a marvel of modern medicine: the carefully tested and regulated technologies teach people's immune systems … ",
    "url": "https://www.scientificamerican.com/article/see-vaccine-recommendations-backed-by-science-in-these-handy-charts/"
  },
  {
    "text": "Scoop: Trump denies 9 former Biden aides executive privilege  —  The Trump White House has decided that nine former senior Biden aides won't be protected by executive privilege during their interviews for a congressional probe into Joe Biden's mental fitness for office.",
    "url": "https://www.axios.com/2025/06/25/biden-investigation-congress-aides-executive-privilege"
  },
  {
    "text": "This Is The Beginning of The End of The 9/11 Era  —  EVER SINCE I WROTE REIGN OF TERROR, people have asked me how we end the long 9/11 era.  Someone asked me a version of that question tonight, at my Anyone Comics signing.  I gave the answer I always give, the only answer I believe to be true: Organize.",
    "url": "https://www.forever-wars.com/this-is-the-beginning-of-the-end-of-the-9-11-era/"
  },
  {
    "text": "RFK Jr. says US won't donate to global vaccine effort  —  Kennedy ripped into Gavi, the Vaccine Alliance, in a video address at its pledging summit.  —  The United States won't contribute anymore to Gavi, the Vaccine Alliance, until the global health organization has “re-earned the public trust … ",
    "url": "https://www.politico.com/news/2025/06/25/rfk-vaccine-donations-gavi-00422705"
  },
  {
    "text": "The National Archives at College Park, Maryland  —  We hold permanent records created by Federal agencies that include:  — Textual records from civilian agencies  — Army unit records dating from WW1  — Navy unit records dating from WW2  — Berlin Documents Center microfilm",
    "url": "https://www.archives.gov/college-park"
  },
  {
    "text": "Despite promise to remove ‘worst of the worst,’ ICE has arrested only 6% of known immigrant murderers  —  ICE told Congress in September that over 13,000 immigrants known to have committed murder remained at large.  Since then, only 752 have been arrested.  —  After six months … ",
    "url": "https://www.nbcnews.com/politics/national-security/promise-remove-worst-worst-ice-arrested-only-6-known-immigrant-murdere-rcna214817"
  },
  {
    "text": "Congress Fights Back...Against Congress  —  The broad story of the second Trump era has been of two inverse and related trends: the growth of a personalist Presidency, and the decline of state capacity.  A system built on loyalty to one man cannot tolerate institutions bound by other values, and so it must break them.",
    "url": "https://donmoynihan.substack.com/p/congress-fights-backagainst-congress"
  },
  {
    "text": "White House ramps up sales pitch for Trump tax plan  —  The White House is stepping up its efforts to sell the GOP megabill ahead of an impending Senate vote.  The legislation is far from finalized, but the Council of Economic Advisers is sending its first analysis of the Senate bill to Congress Wednesday.",
    "url": "https://www.politico.com/live-updates/2025/06/25/congress/white-house-senate-bill-cea-analysis-00422704"
  },
  {
    "text": "Trump administration is preparing to test budget law, U.S. officials say  —  Internal dissent among federal employees is coming to the surface as President Donald Trump's budget chief aims to rebalance spending authority.  —  The Trump administration is preparing to test a 1974 budget law … ",
    "url": "https://www.washingtonpost.com/business/2025/06/25/trump-budget-law-challenge/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzUwODI0MDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzUyMjA2Mzk5LCJpYXQiOjE3NTA4MjQwMDAsImp0aSI6ImQ2ODE0NTEzLWMwMzMtNDhjZC04NjgzLWUyYTdjY2YyYzcyOCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9idXNpbmVzcy8yMDI1LzA2LzI1L3RydW1wLWJ1ZGdldC1sYXctY2hhbGxlbmdlLyJ9.HGcNp4UXhp_Uz1DAllvQAY6WEDK0Kduz8RdN5cDvxPI&itid=gfta"
  },
  {
    "text": "Report: National Science Foundation headquarters to be taken over by HUD, displacing 1,800+ employees  —  The Department of Housing and Urban Development (HUD) will reportedly take over the National Science Foundation (NSF) headquarters building (2415 Eisenhower Ave.), displacing more than 1,833 NSF employees who currently work there.",
    "url": "https://www.alxnow.com/2025/06/24/report-national-science-foundation-headquarters-to-be-taken-over-by-hud-displacing-1800-employees/"
  },
  {
    "text": "A Military Ethics Professor Resigns in Protest  —  Over the course of several months, Pauline Shanks Kaurin concluded she no longer had the academic freedom necessary for doing her job.  —  Seven years ago, Pauline Shanks Kaurin left a good job as a tenured professor at a university … ",
    "url": "https://www.theatlantic.com/ideas/archive/2025/06/academic-freedom-naval-war-college/683309/?gift=_IXYI0Wrwnxuvm7JZ0fMfDckvNPBk-LgBKXWRsnkcHo&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  }
]