[
  {
    "text": "How Far Trump Would Go  —  The former President, at Mar-a-Lago on April 12, is rallying the right at home and seeking common cause with autocratic leaders abroad.Photograph by Philip Montgomery for TIME  —  Donald Trump thinks he's identified a crucial mistake of his first term: He was too nice.",
    "url": "https://time.com/6972021/donald-trump-2024-election-interview/"
  },
  {
    "text": "Read the Full Transcripts of Donald Trump's Interviews With TIME … Over the course of the interviews, Trump discussed his agenda for a second term, which includes deporting millions of people, cutting the U.S. civil service, and intervening more directly in Justice Department prosecutions than his predecessors.",
    "url": "https://time.com/6972022/donald-trump-transcript-2024-election/"
  },
  {
    "text": "Trump's most revealing quotes yet on what he'll do if he wins in 2024 … “If they weren't able to, then I'd use [other parts of] the military.”  — In response to a question over whether he would override the Posse Comitatus Act, which forbids the use of the military against civilians … ",
    "url": "https://www.axios.com/2024/04/30/donald-trump-time-magazine-interview-news"
  },
  {
    "text": "Trump gets jail warning for violating hush money trial gag order; Stormy Daniels ex-lawyer testifies … Former U.S. President Donald Trump walks at New York State Supreme Court in New York, U.S., 30 April 2024. … Prosecutors on Tuesday began questioning the former attorney for porn star Stormy Daniels … ",
    "url": "https://www.cnbc.com/2024/04/30/trump-trial-hush-money-case-resumes-with-testimony-from-michael-cohen-banker.html"
  },
  {
    "text": "Trump, Venting About Lawyer in His Criminal Trial, Seeks More Aggression  —  Todd Blanche upended his career to represent Donald J. Trump and has been the former president's favorite.  But Mr. Trump has made him a focus of his episodic wrath.  —  Donald J. Trump's Manhattan criminal trial … ",
    "url": "https://www.nytimes.com/2024/04/30/us/politics/trump-trial-todd-blanche.html"
  },
  {
    "text": "Judge holds Trump in contempt for violating gag order in hush money trial  —  Prosecutors from the Manhattan District Attorney's Office accused Trump of violating the gag order numerous times since it went into effect.  —  The judge presiding over Donald Trump's hush money case on Tuesday held … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/judge-holds-trump-contempt-violating-gag-order-hush-money-trial-rcna149101"
  },
  {
    "text": "GOP lawmakers say Marjorie Taylor Greene's motion to vacate has fizzled … - “Even trolls online have said they don't want it,” one member told Axios.  — “I dont think she's going to do it - I think that window for her has passed,” another argued.",
    "url": "https://www.axios.com/2024/04/30/marjorie-taylor-greene-johnson-motion-vacate-gop"
  },
  {
    "text": "Supreme Court declines to block Texas pornography restriction  —  The pornography industry challenged the state law's age-verification provision, saying it places an unlawful burden on adults wishing to access content.  —  WASHINGTON — The Supreme Court on Tuesday refused to block … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-declines-block-texas-pornography-restriction-rcna149877"
  },
  {
    "text": "Trump Holds Edge Over Biden in Seven Key Swing State Polls  —  Home Polls Trump Holds Edge Over Biden in Seven Key Swing State Polls  —  Democrats Maintain Lead over Republicans in Five Senate Races  —  New Emerson College Polling/The Hill swing state polls find President Biden trailing … ",
    "url": "https://emersoncollegepolling.com/trump-holds-edge-over-biden-in-seven-key-swing-state-polls/"
  },
  {
    "text": "FBI data shows America is seeing a ‘considerable’ drop in crime.  Trump says the opposite.  —  Jeff Asher is a New Orleans-based crime data analyst who has worked at the CIA and Department of Defense.  He leans towards caution when describing trends in his line of work.",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/04/30/trump-crime-fbi-data-murder-statistics/73443631007/"
  },
  {
    "text": "Sex is biological fact, NHS declares in landmark shift against gender ideology  —  Campaigners welcome change to constitution, which will ban trans women from female-only wards, as ‘return to common sense’  —  The NHS is to declare that sex is a matter of biology in a landmark shift against gender ideology.",
    "url": "https://www.telegraph.co.uk/news/2024/04/30/nhs-sex-biological-landmark-shift-against-gender-ideology/"
  },
  {
    "text": "Why I'm Resigning From The Intercept  —  I resigned from The Intercept today in order to pursue a new kind of journalism here on Substack, one more hard-hitting than what's possible in the corporate world.  The Intercept has been taken over by suits who have abandoned its founding mission … ",
    "url": "https://www.kenklippenstein.com/p/why-im-resigning-from-the-intercept"
  },
  {
    "text": "‘Frustrated’ ex-Trump aide says she won't vote for former president  —  Sarah Matthews, an ex-staffer of former President Trump, said Monday she would not cast her vote in November for Trump, signaling she could instead vote for President Biden.  —  “When we have a candidate on the ballot … ",
    "url": "https://thehill.com/homenews/campaign/4632165-sarah-matthews-former-donald-trump-aide-vote-joe-biden-2024/"
  },
  {
    "text": "Kristi Noem doubled down on dog-killing to win over MAGA — now her story is backfiring in her face  —  South Dakota's governor gets the sadism of Trump supporters, but screws up by saying the quiet parts out loud  —  Squint hard enough and perhaps one can see how Gov. Kristi Noem, R-S.D. … ",
    "url": "https://www.salon.com/2024/04/30/kristi-noem-doubled-down-on-dog-to-win-over-maga--now-her-story-is-backfiring-in-her-face/"
  },
  {
    "text": "War Zone Surveillance Technology Is Hitting American Streets … Big Brother isn't just watching you: He's using your cell phone, smartwatch, wireless earbuds, car entertainment systems and license plates to track your location in real time.  —  Contracting records and notes … ",
    "url": "https://www.notus.org/technology/war-zone-surveillance-border-us"
  },
  {
    "text": "US drug control agency will move to reclassify marijuana in a historic shift, AP sources say  —  The U.S. Drug Enforcement Administration will move to reclassify marijuana as a less dangerous drug, The Associated Press has learned, a historic shift to generations of American drug policy … ",
    "url": "https://apnews.com/article/marijuana-biden-dea-criminal-justice-pot-f833a8dae6ceb31a8658a5d65832a3b8"
  },
  {
    "text": "Dozens occupy Hamilton Hall as pro-Palestinian protests spread across campus  —  This is a developing story.  Check back for updates.",
    "url": "https://www.columbiaspectator.com/news/2024/04/30/dozens-occupy-hamilton-hall-as-pro-palestinian-protests-spread-across-campus/"
  },
  {
    "text": "Trump Wants to Prosecute Biden.  He Also Thinks Presidents Deserve Immunity.  —  In arguing to the Supreme Court that he cannot be charged for acts while in office, Donald Trump has asked the justices to enforce a norm that he has long threatened to shatter.",
    "url": "https://www.nytimes.com/2024/04/30/us/politics/trump-biden-president-immunity.html"
  }
]