[
  {
    "text": "The Situation: The Cult of Unqualified Authenticity  —  On Pete Hegseth and the first hearing for a Trump nominee for a major cabinet position  —  Meet The Authors  —  Published by The Lawfare Institute in Cooperation With  —  The Situation on Friday reflected on the sentencing of Donald Trump in New York.",
    "url": "https://www.lawfaremedia.org/article/the-situation--the-cult-of-unqualified-authenticity"
  },
  {
    "text": "Pete Hegseth seems open to ordering soldiers to shoot protesters  —  Trump's pick to lead the Defense Department indicates he would be willing to do what Mark Esper refused to do.  —  Soon after the 2020 election, as President Donald Trump was gearing up his efforts to retain power despite his loss … ",
    "url": "https://www.washingtonpost.com/politics/2025/01/14/hegseth-seems-open-to-ordering-protesters-shot/"
  },
  {
    "text": "The Pressure Campaign to Get Pete Hegseth Confirmed as Defense Secretary  —  Supporters of Donald Trump's nominee have intimidated potential witnesses and suppressed the F.B.I. background check of the former Fox News host in the run-up to his Senate hearing.",
    "url": "https://www.newyorker.com/news/the-lede/the-pressure-campaign-to-get-pete-hegseth-confirmed-as-defense-secretary"
  },
  {
    "text": "The Most Damning Lines in Jack Smith's Brutal Trump January 6 Report  —  Special counsel Jack Smith did not hold back in his final report on the investigation into Donald Trump's attempt to overturn the 2020 election.  —  While much of it contains information already made public … ",
    "url": "https://newrepublic.com/post/190190/jack-smith-trump-january-6-report"
  },
  {
    "text": "Special Counsel Report Says Trump Would Have Been Convicted in Election Case  —  “But for Mr. Trump's election and imminent return to the presidency, the office assessed that the admissible evidence was sufficient to obtain and sustain a conviction at trial,” the report said.",
    "url": "https://www.nytimes.com/2025/01/14/us/politics/trump-special-counsel-report-election-jan-6.html?unlocked_article_code=1.pE4.qEsJ.JEVOGbzuKumK&smid=url-share"
  },
  {
    "text": "GOP Senator Flames Dems for ‘Cheating’ and Voting ‘Drunk’  —  “And don't tell me you haven't seen it, because I know you have,” the Republican senator said.",
    "url": "https://www.thedailybeast.com/gop-senator-markwayne-mullin-flames-dems-for-cheating-and-voting-drunk-during-pete-hegseth-hearing/"
  },
  {
    "text": "Michelle Obama will skip Trump inauguration, but ex-Presidents Obama, Clinton and Bush will be there  —  Former first lady Michelle Obama will skip the inauguration of President-elect Donald Trump, the second time in two weeks that she is not attending a gathering of former U.S. leaders and their spouses … ",
    "url": "https://apnews.com/article/trump-inauguration-obama-bush-clinton-f7212766dc0f69444d8a4537a736c2d2"
  },
  {
    "text": "Michelle Obama Will Skip Trump's Inauguration  —  Mrs. Obama also declined to attend the funeral of Jimmy Carter last week, which would have put her face-to-face with Mr. Trump.  —  Michelle Obama, the former first lady, will not attend the inauguration of President-elect Donald J. Trump, her office said in a statement on Tuesday.",
    "url": "https://www.nytimes.com/2025/01/14/us/politics/michelle-obama-trump-inauguration.html"
  },
  {
    "text": "SEC Sues Musk Over Securities Violation in Federal Court  —  The Securities and Exchange Commission sued Elon Musk in federal court over an alleged securities violation, according to a court docket.  —  The agency claimed Musk failed to timely disclose a major purchase of Twitter Inc. shares ahead … ",
    "url": "https://www.bloomberg.com/news/articles/2025-01-14/sec-sues-elon-musk-over-securities-violation-in-federal-court"
  },
  {
    "text": "US SEC sues Elon Musk over late disclosure of Twitter stake  —  Elon Musk was sued on Tuesday by the U.S. Securities and Exchange Commission for having failed to timely disclose purchasing more than 5% of Twitter's common stock in March 2022.  —  In a complaint filed in Washington, D.C. … ",
    "url": "https://www.reuters.com/legal/us-sec-sues-elon-musk-over-late-disclosure-twitter-stake-2025-01-14/"
  },
  {
    "text": "Biden moves to lift state sponsor of terrorism designation for Cuba, part of deal to free prisoners  —  The Biden administration on Tuesday is notifying Congress of its intent to lift the U.S. designation of Cuba as a state sponsor of terrorism, the White House announced … ",
    "url": "https://apnews.com/article/biden-cuba-terrorism-designation-a0e2f003ce7100e6a845ef7ed6e96a1b"
  },
  {
    "text": "Republican Hard-Liners Already Have a Problem With the GOP's Reconciliation Strategy  —  Some Freedom Caucus members think a debt limit increase needs to be part of the reconciliation process.  GOP leaders are already signaling that it won't be.  — Copy",
    "url": "https://www.notus.org/congress/republican-hard-liners-problem-with-gop-reconciliation"
  },
  {
    "text": "Mike Johnson eyes April deadline to pass one big MAGA bill through the House, but GOP senators are skeptical  —  House and Senate Republicans still disagree on the best strategy to advance Trump's policy priorities on the border, energy and taxes.  A recent Trump-GOP meeting failed to resolve it.",
    "url": "https://www.nbcnews.com/politics/congress/mike-johnson-april-deadline-pass-one-big-maga-bill-house-rcna187688"
  },
  {
    "text": "Elon Musk, Jeff Bezos and Mark Zuckerberg to attend Trump's inauguration  —  The three will be seated together on the inauguration platform with other prominent guests.  —  Elon Musk, Jeff Bezos and Mark Zuckerberg will attend President-elect Donald Trump's inauguration on Monday … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/elon-musk-jeff-bezos-mark-zuckberg-trump-inauguration-rcna187629"
  },
  {
    "text": "Israel and Hamas agree in principle to ceasefire and hostage deal, sources say  —  A draft deal for a ceasefire in Gaza and hostage release has been agreed to in principle and, if all goes well, will be finalized by Israel and Hamas this week, Arab, U.S. and Israeli officials told CBS News.",
    "url": "https://www.cbsnews.com/news/israel-hamas-ceasefire-hostage-deal-agreement-in-principle/"
  },
  {
    "text": "Vice Is a Moat  —  1. Secretary Pete  —  Here is the thing about Pete Hegseth:  —  Imagine that his character was sterling.  That he was a fine, upstanding man, admired by all who know him.  That he had dedicated his life to service and been judged to be as good a human being as Mister Rogers or Dolly Parton.",
    "url": "https://www.thebulwark.com/p/vice-is-a-moat"
  },
  {
    "text": "I have struggled with how to respond to Mark Zuckerberg and Facebook's descent into toxic masculinity and Neo-Nazi madness.  While I have thought about quitting Facebook, I find great value in the connections and friends I have here, and it doesn't seem fair that I should lose that because Zuckerberg is having a mid-life crisis.",
    "url": "https://www.linkedin.com/posts/marklemley_i-have-struggled-with-how-to-respond-to-mark-activity-7284685204676362241-7h9r"
  },
  {
    "text": "I was fully indoctrinated into the Democrat ‘cult.’ Here's why I left my liberal influencer life behind to raise money for Trump  —  A former high energy Democratic fundraiser, failed congressional candidate and social media influencer is now raising money for President-elect Donald Trump's inaugural committee.",
    "url": "https://www.dailymail.co.uk/news/article-14278643/lindy-li-liberal-defected-democrat-cult-raising-money-trump.html"
  },
  {
    "text": "Texas House elects new Speaker in blow to far-right wing  —  The Texas House on Tuesday elected state Rep. Dustin Burrows (R) to lead the chamber in a blow to the rising far-right wing of the party, defeating a candidate supported by Texas Attorney General Ken Paxton (R) and other top state figures.",
    "url": "https://thehill.com/homenews/state-watch/5085530-texas-house-elects-new-speaker-blow-to-far-right-wing/"
  },
  {
    "text": "Speaker Orders Capitol Hill Flags Raised for Inauguration  —  President-elect Donald J. Trump had complained that flags were scheduled to fly at half-staff — a symbol of mourning for former President Jimmy Carter — on the day of his inauguration.  —  Speaker Mike Johnson on Tuesday announced … ",
    "url": "https://www.nytimes.com/2025/01/14/us/politics/mike-johnson-flags-trump-inauguration.html"
  },
  {
    "text": "Kaine clashes with Hegseth over infidelity, drinking, scandals  —  Sen. Tim Kaine (D-Va.) clashed sharply with secretary of Defense nominee Pete Hegseth over his infidelity and reports of public drunkenness and drunkenness on the job, repeatedly pressing Hegseth on his character and judgment.",
    "url": "https://thehill.com/homenews/5084889-tim-kaine-pete-hegseth-hearing-infidelity/"
  },
  {
    "text": "Food shoppers could see nutrition facts on the front, as FDA unveils proposed packaging rules  —  The Food and Drug Administration released on Tuesday its long-awaited proposal to require food manufacturers to put some nutrition facts on the front of packages, in a bid to nudge Americans … ",
    "url": "https://www.cbsnews.com/news/nutrition-facts-packages-fda-proposal/"
  },
  {
    "text": "Trump and DeSantis golf, with Rubio replacement looming  —  President-elect Donald Trump and Florida Gov. Ron DeSantis are meeting over a round of golf on Tuesday, as key decisions loom in the state they both call home.  The meetup is taking place as Trump backed DeSantis' recent call … ",
    "url": "https://www.politico.com/live-updates/2025/01/14/congress/trump-desantis-golf-rubio-replacement-00000396"
  }
]