[
  {
    "text": "Lindsey Graham, a longtime foreign policy hawk, bows to Trump on Ukraine  —  The shift sends another warning sign to U.S. allies about the isolationist posture spreading within the Republican Party  —  Last May, Lindsey Graham (R-S.C.) visited Ukrainian President Volodymyr Zelensky in Kyiv … ",
    "url": "https://www.washingtonpost.com/politics/2024/02/14/lindsey-graham-ukraine-trump/"
  },
  {
    "text": "Playbook: Why Ukraine aid is headed nowhere fast  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  SUOZZILAND — After a failed governor run and a second chance granted by the grace of GEORGE SANTOS, veteran New York Democrat TOM SUOZZI is headed … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/02/14/why-ukraine-aid-is-headed-nowhere-fast-00141363"
  },
  {
    "text": "Suozzi wins New York special election, replacing George Santos  —  The Democrat prevailed in a race that centered heavily on immigration  —  Democrat Tom Suozzi won a hotly contested special election for Congress on Tuesday, the Associated Press projected, retaking a seat in suburban New York … ",
    "url": "https://www.washingtonpost.com/elections/2024/02/13/new-york-district-3-special-election-george-santos/"
  },
  {
    "text": "February 13, 2024  —  “History is watching,” President Joe Biden said this afternoon.  He warned “Republicans in Congress who think they can oppose funding for Ukraine and not be held accountable” that “[f]ailure to support Ukraine at this critical moment will never be forgotten.”",
    "url": "https://heathercoxrichardson.substack.com/p/february-13-2024"
  },
  {
    "text": "Lara Trump says she'd spend ‘every single penny’ of RNC funds to elect father-in-law  —  Lara Trump on Tuesday doubled down on her support for her father-in-law, former President Trump, vowing to spend “every single penny” of Republican National Committee (RNC) funds to reelect him to the White House.",
    "url": "https://thehill.com/homenews/campaign/4467232-lara-trump-spend-rnc-funds-to-elect-donald-trump/"
  },
  {
    "text": "New York 3rd Congressional District Special Election Results  —  The special House election to replace George Santos in New York is a tossup with unusually high stakes — both for the immediate balance of power in the House and November's general elections.  It pits Mazi Pilip … ",
    "url": "https://www.nytimes.com/interactive/2024/02/13/us/elections/results-new-york-us-house-3-special.html"
  },
  {
    "text": "Democrats flip Santos's New York House seat in high-stakes special election  —  Former Rep. Tom Suozzi (D) has won back his old seat in the House, giving Democrats a critical pickup that will further narrow the GOP House majority, according to a projection from Decision Desk HQ.",
    "url": "https://thehill.com/homenews/campaign/4465973-tom-suozzi-democrats-mazi-pillip-george-santos-new-york/"
  },
  {
    "text": "NY-03 gives Republicans lots to worry about  —  Tom Suozzi's victory highlights GOP weakness and D strengths. … Much pre-election hype suggested the NY-03 special to replace lying grifting weirdo George Santos was going to be a nail biter.  In the event, though, it wasn't that close.",
    "url": "https://www.publicnotice.co/p/tom-suozzi-ny-03-pilip-loss-2024-takeaways"
  },
  {
    "text": "New documents underscore why the Supreme Court must let Jack Smith's Trump case move forward  —  January 6 was just the tip of the iceberg — Trump's criminal conspiracy was sprawling  —  Despite taking their own sweet time to render what should have been a five-minute decision ruling … ",
    "url": "https://www.salon.com/2024/02/14/new-documents-underscore-why-the-must-let-jack-smiths-case-move-forward/"
  },
  {
    "text": "Statement from President Joe Biden on House GOP's Baseless Impeachment of Secretary Mayorkas  —  History will not look kindly on House Republicans for their blatant act of unconstitutional partisanship that has targeted an honorable public servant in order to play petty political games.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/02/13/statement-from-president-joe-biden-on-house-gops-baseless-impeachment-of-secretary-mayorkas/"
  },
  {
    "text": "High School Girls Basketball Team Quits After Crowd Allegedly Spews Racial Slurs  —  School officials in Scarsdale and East Ramapo have announced an investigation into the incident.  —  A high school girls' basketball game in Scarsdale, New York came to an early finish on Saturday … ",
    "url": "https://www.thedailybeast.com/high-school-girls-basketball-team-quits-after-crowd-spews-racial-slurs-report-says"
  },
  {
    "text": "Extending our Mastodon social media trial  —  In July 2023 we announced our plan to establish a BBC presence in the distributed collection of social networks known as the Fediverse, a collection of social media applications all linked together by common protocols, as part of our research into social technologies.",
    "url": "https://www.bbc.co.uk/rd/blog/2024-02-extending-our-mastodon-social-media-trial"
  },
  {
    "text": "‘The Campaign Is a Mess’: RFK Jr. Hit With Staff Exodus Over ‘Lavish Spending’ and ‘Amateurish’ Leadership  —  Robert F. Kennedy Jr.'s campaign is in disarray amid an exodus of campaign workers who say disorganization, lavish spending, amateurish leadership, and a severe disconnect between … ",
    "url": "https://www.mediaite.com/politics/the-campaign-is-a-mess-rfk-jr-hit-with-staff-exodus-over-lavish-spending-and-amateurish-leadership/"
  },
  {
    "text": "Democrats on track to maintain majority in Pennsylvania state House  —  Democratic school board member Jim Prokopiak appeared on track to represent Pennsylvania's 140th state House district in Tuesday's special election, signaling the party will likely maintain its majority in the state's lower chamber.",
    "url": "https://thehill.com/homenews/campaign/4466050-democrats-on-track-to-maintain-majority-in-pennsylvania-state-house/"
  },
  {
    "text": "GOP Congressman Spews Racist Screed on Fall of “Western Civilization”  —  Texas Republican Representative Chip Roy may have stirred up disunity in the GOP earlier this year with his threats to oust House Speaker Mike Johnson, but he's in lockstep with the rest of his party on one thing … ",
    "url": "https://newrepublic.com/post/178981/republican-congressman-chip-roy-western-civilization-migrants"
  },
  {
    "text": "Jared Kushner Says He Won't Be Part of a Second Trump White House  —  He said he's enjoyed being “out of the spotlight.”  —  Jared Kushner says he wouldn't take a role in a hypothetical second Trump administration, explaining that he's enjoyed being out of the glare of constant public scrutiny … ",
    "url": "https://www.thedailybeast.com/jared-kushner-says-he-wont-be-part-of-a-second-trump-white-house"
  },
  {
    "text": "NATO Allies Ramp Up Defense Budgets Amid Worries About Trump  — Announcement follows Trump's threats to under-spenders  — NATO allies already discussing measures in case Trump returns  —  A record 18 out of NATO's 31 countries are expected to meet the alliance's defense spending goal this year … ",
    "url": "https://www.bloomberg.com/news/articles/2024-02-14/nato-allies-ramp-up-defense-spending-amid-worries-about-trump"
  },
  {
    "text": "Ex-French President Sarkozy Appeals Prison Term, Says Lawyer  —  Former French President Nicolas Sarkozy appealed a one-year prison sentence over illegal campaign financing that was partly upheld, to the country's highest court.  —  The Paris Court of Appeal backed the 12-month sentence … ",
    "url": "https://www.bloomberg.com/news/articles/2024-02-14/ex-french-president-sarkozy-appeals-prison-term-says-lawyer"
  },
  {
    "text": "It took me three tries to register to vote — and I'm a voting reporter  —  Votebeat is a nonprofit news organization reporting on voting access and election administration across the U.S.  —  A version of this post was originally distributed in Votebeat's free weekly newsletter.",
    "url": "https://www.votebeat.org/2024/02/12/natalia-contreras-register-to-vote-texas-roadblocks/"
  }
]