[
  {
    "text": "Police treating vehicle explosion at Trump Las Vegas hotel as possible act of terror: Official  —  Police are also probing the Cybertruck incident as a possible criminal act.  —  General views of the Trump International Hotel Las Vegas on April 15, 2024 in Las Vegas, Nevada.",
    "url": "https://abcnews.go.com/Politics/police-investigating-vehicle-explosion-trump-hotel-las-vegas/story?id=117252987"
  },
  {
    "text": "Fireworks, gas tanks and camping fuel used in Tesla cybertruck explosion outside Las Vegas Trump Hotel  —  Authorities believe fireworks, gas tanks and camping fuel were connected to a detonation system controlled by the driver in the Tesla Cybertruck that exploded outside a Trump Hotel in Las Vegas Wednesday morning.",
    "url": "https://www.cnn.com/2025/01/01/us/cybertruck-fire-trump-hotel-las-vegas/"
  },
  {
    "text": "Firework mortars, gas cannisters stuffed inside Tesla that exploded outside Trump's Las Vegas hotel  —  Firework mortars and camp fuel canisters were found stuffed into the back of the Tesla Cybertruck that exploded outside President-elect Donald Trump's Las Vegas hotel early Wednesday … ",
    "url": "https://apnews.com/article/trump-hotel-vehicle-fire-las-vegas-ad4c171c7a6af64f08db93d9fdc2d749"
  },
  {
    "text": "1 Dead After a Cybertruck Explodes Outside the Trump Hotel in Las Vegas  —  At least seven people were injured, the authorities said.  The authorities said they believed it to be “an isolated incident” but have not ruled out a connection to the attack in New Orleans.",
    "url": "https://www.nytimes.com/2025/01/01/us/car-fire-trump-hotel-las-vegas.html"
  },
  {
    "text": "Tesla Cybertruck bursts into flames outside Trump hotel in Las Vegas, killing one  —  The Clark County Fire Department confirmed it responded to a vehicle fire early Wednesday.  —  A Tesla Cybertruck exploded and burst into flames Wednesday morning just outside the entrance of Trump International Hotel … ",
    "url": "https://www.nbcnews.com/news/us-news/tesla-cybertruck-appears-burst-flames-trump-hotel-las-vegas-rcna185932"
  },
  {
    "text": "FBI Statement on the Attack in New Orleans  —  Today, at approximately 3:15 a.m. CST, an individual drove a pickup truck into a crowd of people on Bourbon Street in New Orleans, killing at least 10 and injuring dozens of others.  After hitting the crowd, he exited the vehicle and fired upon local law enforcement.",
    "url": "https://www.fbi.gov/news/press-releases/fbi-statement-on-the-attack-in-new-orleans"
  },
  {
    "text": "Suspect in New Orleans Attack Is Identified as a Texan and Had an ISIS Flag With Him  —  In a YouTube video from 2020, the man identified as the suspect said he had been born and raised in Beaumont, Texas, and had served in the U.S. military.  —  The man killed in a shootout with the police … ",
    "url": "https://www.nytimes.com/2025/01/01/us/suspect-new-orleans-texan-isis-flag.html?unlocked_article_code=1.l04.WTCF.B3JpPEYewJo-&smid=url-share"
  },
  {
    "text": "Liz Cheney Is Among 20 Chosen to Receive Presidential Citizens Medal  —  Two close advisers to President Biden will also be honored, in addition to career lawmakers who have worked across the aisle and advocates for liberal causes.  —  President Biden will award the Presidential Citizens Medal … ",
    "url": "https://www.nytimes.com/2025/01/02/us/politics/presidential-citizens-medal-liz-cheney.html"
  },
  {
    "text": "Biden to honor Liz Cheney with Presidential Citizens Medal  —  The second-highest civilian medal will also go to Rep. Bennie G. Thompson, who led the investigation with Cheney into the Jan. 6, 2021, Capitol attack.",
    "url": "https://www.washingtonpost.com/politics/2025/01/02/biden-cheney-presidential-citizens-medal/"
  },
  {
    "text": "Biden is giving the 2nd highest civilian award to the leaders of the Jan. 6 congressional committee  —  President Joe Biden is bestowing the second highest civilian medal on Liz Cheney and Bennie Thompson, leaders of the congressional investigation into the Capitol riot who Donald Trump … ",
    "url": "https://apnews.com/article/biden-citizens-medals-jan-6-cheney-thompson-f725b7003ea11239b90962a8cf0d5305"
  },
  {
    "text": "The attack was the deadliest in the U.S. in more than a year.  —  Officials postponed the Sugar Bowl and said they were hunting for possible connections between the suspect, who rammed into New Year's revelers, and terrorist organizations.  —  TRANSCRIPT  —  Back  —  Deadly New Year's Day Attack in New Orleans",
    "url": "https://www.nytimes.com/live/2025/01/01/us/new-orleans-vehicle-crash?unlocked_article_code=1.l04.NOtM.UNls5FGSFORo&smid=bs-share"
  },
  {
    "text": "Trump Falsely Suggested New Orleans Suspect Was an Immigrant  —  The president-elect said on social media that he was right about fearing criminals on the other side of the border.  Officials later identified the suspect as a U.S.-born citizen and Army veteran.",
    "url": "https://www.nytimes.com/2025/01/01/us/politics/trump-new-orleans.html?unlocked_article_code=1.mE4.ofuV.W-VZBHgqNYIp&smid=url-share"
  },
  {
    "text": "Democrats rage as Johnson restricts their ability to oust him … - “This makes it clear that they have no intention of working together to find common ground,” Rep. Jim McGovern (D-Mass.), the top Democrat on the House Rules Committee, said of the rules change in a statement.",
    "url": "https://www.axios.com/2025/01/02/mike-johnson-democrats-motion-to-vacate-rules"
  },
  {
    "text": "Trump to hold DC rally day before inauguration  —  President-elect Trump will hold a rally in Washington the day before he is set to be inaugurated for a second term.  —  The president-elect will hold what is being dubbed a “victory rally” at Capital One Arena on Jan. 19 … ",
    "url": "https://thehill.com/homenews/campaign/5062614-trump-washington-rally-inaguration/"
  },
  {
    "text": "Enshittification Comes to Washington  —  My experiences with private-sector package delivery are, to put it mildly, not the best.  As I write this, I'm watching and fretting over a package that is supposed to be delivered to my apartment by FedEx, which only occasionally manages to locate … ",
    "url": "https://newrepublic.com/article/189701/trump-2025-enshittification-civil-service"
  },
  {
    "text": "Texas sues to impose bigotry on the rest of the country  —  Ken Paxton's lawsuit against the NCAA is a glorified Fox News segment.  —  Donald Trump and JD Vance spent the 2024 election spewing the most rank transphobia, a tactic that should have made them pariahs but instead helped win them the presidency.",
    "url": "https://www.publicnotice.co/p/ken-paxton-ncaa-lawsuit-texas-trans-athletes"
  },
  {
    "text": "“Largest” explosives cache “in FBI history” seized from farm, prosecutors say … - The 36-year-old Spafford allegedly used pictures of President Biden “for target practice,” prosecutors said in the memorandum of support, filed Monday in U.S. federal court in Norfolk, seeking to keep Spafford in detention.",
    "url": "https://www.axios.com/2025/01/02/homemade-bombs-virginia-fbi"
  }
]