[
  {
    "text": "Alex Jones' personal assets will be sold to help pay Sandy Hook debt as judge decides Infowars' fate  —  A federal judge on Friday ordered the liquidation of conspiracy theorist Alex Jones ′ personal assets but was still deciding on his company's separate bankruptcy case … ",
    "url": "https://apnews.com/article/alex-jones-sandy-hook-lawsuit-3ccd113496caee18a085dfa54c6e6c0e"
  },
  {
    "text": "Judge rejects bankruptcy plan for Alex Jones' Infowars but allows him to liquidate his personal assets  —  A Texas bankruptcy judge has rejected a proposed liquidation of conspiracy theorist Alex Jones' company Free Speech Systems, the parent company of Infowars, saying it was, in his opinion, in the best interest of the creditors.",
    "url": "https://www.cnn.com/2024/06/14/media/infowars-alex-jones-liquidation-ruling/"
  },
  {
    "text": "Supreme Court rules gun ‘bump stocks’ ban is unlawful  —  The ban was imposed by the Trump administration after the accessory was used during the 2017 mass shooting in Las Vegas.  —  WASHINGTON — In a loss for the Biden administration, the Supreme Court on Friday ruled that federal ban on … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-rules-gun-bump-stocks-ban-unlawful-rcna154651"
  },
  {
    "text": "The Chilling Reason You May Never See the New Trump Movie  —  This week I finally got to see “The Apprentice,” an absorbing, disturbing movie about the relationship between the red-baiting mob lawyer Roy Cohn and a young Donald Trump.  The film, which was received with an extended standing ovation … ",
    "url": "https://www.nytimes.com/2024/06/14/opinion/the-apprentice-trump-movie.html"
  },
  {
    "text": "Moment Biden, 81, freezes AGAIN after shuffling away from G7 leaders forcing Italian PM to shepherd him back for pic  —  Watch Biden's latest concerning incident in the clip above  —  ELDERLY Joe Biden has given his “worst ever” performance at a major international summit, G7 insiders say … ",
    "url": "https://www.thesun.co.uk/news/28495274/joe-biden-freezes-again-shuffling-g7-giorgia-meloni/"
  },
  {
    "text": "Biden's condition shocks allies at G7 summit, with one saying it's ‘worst he has ever been’: report  —  President Biden has been “losing focus” during discussions at this week's G7 summit in Italy, with one diplomatic insider saying the commander-in-chief is “the worst he has ever been.”",
    "url": "https://nypost.com/2024/06/14/us-news/bidens-condition-shocks-allies-at-g7-summit-with-one-saying-its-worst-he-has-ever-been-report/"
  },
  {
    "text": "House Republicans narrowly pass defense bill loaded with culture war issues  —  The tactic represented a gamble for Speaker Mike Johnson, who could have pushed to pass a more bipartisan version with the help of Democrats.  —  The House narrowly cleared defense policy legislation on Friday … ",
    "url": "https://www.politico.com/news/2024/06/14/house-republicans-narrowly-pass-defense-bill-loaded-with-culture-war-issues-00163453"
  },
  {
    "text": "CEOs at Trump meeting: Ex-president ‘meandering’ and 'doesn't know what he's talking about' … WATCH NOW  —  WASHINGTON — Former President Donald Trump failed to impress everyone in a room full of top CEOs Thursday at the Business Roundtable's quarterly meeting, multiple attendees told CNBC.",
    "url": "https://www.cnbc.com/2024/06/14/ceos-at-trump-meeting-not-impressed.html"
  },
  {
    "text": "Biden preparing to offer legal status to undocumented immigrants who have lived in U.S. for 10 years  —  The Biden administration is making plans to announce one of the largest immigration relief programs in recent history, developing a policy that would offer legal status to hundreds … ",
    "url": "https://www.cbsnews.com/news/biden-plan-undocumented-immigrants-legal-status-10-years-in-u-s-married/"
  },
  {
    "text": "Anthony Fauci: Volcanic Donald Trump Screamed F-Bombs, Then Said He Loved Me  —  COVID BOOK LEAK  —  In his memoir “On Call,” Anthony Fauci tells how Trump lurched from crisis to crisis and said he would win in a “f***ing landslide.” … Donald Trump shouted foul-mouthed abuse at Anthony Fauci … ",
    "url": "https://www.thedailybeast.com/anthony-fauci-covid-book-volcanic-donald-trump-screamed-f-bombs-at-me"
  },
  {
    "text": "DOJ says it won't prosecute Attorney General Merrick Garland after House contempt vote  —  The Justice Department said Friday that it would not act on the House's contempt referral of Attorney General Merrick Garland.  —  In a letter to House Speaker Mike Johnson, DOJ pointed to its … ",
    "url": "https://www.cnn.com/2024/06/14/politics/merrick-garland-contempt-vote-no-prosecution"
  },
  {
    "text": "Summers Says Trump Tax Ideas Mean ‘Mother of All Stagflations’  — Former Treasury secretary warns of 10% mortgage rates  — Summers urges GOP-leaning economists, executives to speak up  —  Trump Tax Ideas Could Cause ‘Economic Warfare,’ Summers Says",
    "url": "https://www.bloomberg.com/news/articles/2024-06-14/summers-says-trump-tax-ideas-mean-mother-of-all-stagflations"
  },
  {
    "text": "Pentagon ran secret anti-vax propaganda campaign to incite fear of China vaccines during pandemic  —  The U.S. military launched a clandestine program amid the COVID crisis to discredit China's Sinovac inoculation - payback for Beijing's efforts to blame Washington for the pandemic.",
    "url": "https://www.reuters.com/investigates/special-report/usa-covid-propaganda/"
  },
  {
    "text": "Mitch McConnell Is Trump's Gimp.  Again.  —  Never has an American politician been so mistaken about the nature of power.  —  ∙ Paid  —  The Secret pod is live.  Sarah and I talked about what happens to the Republican party after Trump leaves.  Good news: Maybe they can't keep the Trump coalition together!",
    "url": "https://www.thebulwark.com/p/mitch-mcconnell-is-trumps-gimp-again"
  },
  {
    "text": "Trump has ‘sort of a pretty good idea’ of VP pick, will probably announce during RNC convention  —  Trump will likely announce VP pick during the Republican National Convention, which will be held in July in Milwaukee  —  Join Fox News for access to this content",
    "url": "https://www.foxnews.com/politics/trump-has-sort-pretty-good-idea-vp-pick-probably-announce-during-rnc-convention"
  },
  {
    "text": "Jill Biden pitches the benefits of age on the campaign trail  —  First lady Dr. Jill Biden is hitting the campaign trail on a double mission this week, courting older voters to support her husband's reelection bid while also tackling voters' concerns about his age.",
    "url": "https://www.cnn.com/2024/06/14/politics/jill-biden-age-campaign-trail/"
  },
  {
    "text": "Top GOPer Accidentally Wrecks Trump's Biggest Lie About Jack Smith  —  Don't look now, but Donald Trump's criminality is slowly morphing into a serious wedge issue against the Republican Party—and Democrats, fortunately, are beginning to act like it.  —  Politico's Playbook reported Thursday … ",
    "url": "https://newrepublic.com/article/182728/top-goper-accidentally-wrecks-trumps-biggest-lie-jack-smith"
  },
  {
    "text": "Scoop: Democrats plan to go bigger than a boycott for Netanyahu speech … - The proposals include a press conference, a vigil, or an event with families of those taken hostage by Hamas, many of whom feel Netanyahu hasn't done enough to free their loved ones.",
    "url": "https://www.axios.com/2024/06/14/democrats-boycott-netanyahu-speech-congress"
  },
  {
    "text": "Sunak Vows to Stay as MP for 5 Years If Tories Lose UK Election  — Says he'll serve full term if he keeps seat but is not premier  — Labour on track to oust Sunak's Conservatives in July 4 vote  —  Rishi Sunak said he would stay on as a member of Parliament for five years … ",
    "url": "https://www.bloomberg.com/news/articles/2024-06-14/sunak-vows-to-stay-as-mp-for-5-years-if-tories-lose-uk-election"
  },
  {
    "text": "U.S. Designates Largest Neo-Nazi Group in Sweden as Terrorist Organization  —  The Nordic Resistance Movement and three of its leaders were labeled terrorists in a rare move by the State Department targeting white supremacists.  —  The State Department on Friday designated the largest neo-Nazi group … ",
    "url": "https://www.nytimes.com/2024/06/14/us/politics/us-sweden-neo-nazi-group-terrorists.html"
  },
  {
    "text": "Supreme Court's Leisurely Pace Will Produce Pileup of Late June Rulings  —  Even as the size of the court's docket has shrunk, it has deferred a larger share of its decisions to the very end of its term.  —  The Supreme Court has been moving at a sluggish pace in issuing decisions this term … ",
    "url": "https://www.nytimes.com/2024/06/14/us/politics/supreme-court-rulings-june.html"
  },
  {
    "text": "Graves won't run for reelection, ending speculation in Louisiana  —  Rep. Garret Graves said Friday he will not run for reelection — ending months of questions about his political future after redistricting scrambled Louisiana's congressional map.  Graves (R-La.), in a statement, said that … ",
    "url": "https://www.politico.com/live-updates/2024/06/14/congress/graves-not-running-for-reelection-house-louisiana-00163538"
  },
  {
    "text": "Colombia lawmakers approve pension reform in victory for Petro  —  Colombia's lower house on Friday approved a pension reform proposed by President Gustavo Petro, marking a victory for the leftist, who has struggled to get lawmaker approval for several of his cornerstone promises.",
    "url": "https://www.reuters.com/world/americas/colombia-lawmakers-approve-pension-reform-victory-petro-2024-06-15/"
  }
]