[
  {
    "text": "Ex-Trump aide Cassidy Hutchinson claims Rudy Giuliani groped her on January 6  —  Exclusive: in a new book, Hutchinson describes incident in which the former New York mayor put his hand ‘under my blazer, then my skirt’  —  Cassidy Hutchinson, the former Trump aide turned crucial January 6 witness … ",
    "url": "https://www.theguardian.com/us-news/2023/sep/20/rudy-giuliani-grope-cassidy-hutchinson-claim-january-6-trump-aide"
  },
  {
    "text": "Trump Privately Frets He Could Be Headed to Prison  —  Would he be sent to a “club fed” style prison — or a “bad” one?  Would he have Secret Service protection?  And what would they make him wear?  Those are some of the questions Donald Trump is asking his lawyers as his many trials loom",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-prison-conviction-trial-1234828231/"
  },
  {
    "text": "Former White House lawyer Ty Cobb compares Trump to ‘mob boss’  —  Former White House lawyer Ty Cobb compared former President Trump to a “mob boss” in a CNN interview Tuesday.  —  The comparison follows reporting alleging Trump, Cobb's former boss, wrote to-do lists on the backs of classified documents.",
    "url": "https://thehill.com/homenews/media/4213938-former-white-house-lawyer-ty-cobb-compares-trump-to-mob-boss/"
  },
  {
    "text": "Why the White House is letting McCarthy flail  —  The administration has no plans to help as Kevin McCarthy and House Republicans inch closer to a government shutdown.  —  Speaker Kevin McCarthy is struggling to pass a bill to fund the government — and the White House isn't about to throw him a lifeline.",
    "url": "https://www.politico.com/news/2023/09/20/biden-white-house-mccarthy-shutdown-budget-00116965"
  },
  {
    "text": "House Speaker McCarthy to Hardliners: 'It's Like You're Walking Into a Fight Losing'  —  ‘I want to be able to win these battles,’ McCarthy says, blaming fellow Republicans for a blockade on government funding and diminishing his negotiating leverage with Democrats",
    "url": "https://themessenger.com/politics/house-speaker-mccarthy-to-hardliners-its-like-youre-walking-into-a-fight-losing"
  },
  {
    "text": "Pro-Trump Lawyer Lin Wood Turned State's Witness in Georgia Racketeering Case, DA Reveals  —  A once-prominent defamation lawyer who represented Richard Jewell, Lin Wood surrendered his law license in July under the shroud of disciplinary proceedings  —  A Facebook icon representing … ",
    "url": "https://themessenger.com/politics/pro-trump-lawyer-lin-wood-witness-georgia-rico"
  },
  {
    "text": "Pro-Trump lawyer Lin Wood is a witness in Georgia election subversion case, district attorney says  —  Pro-Donald Trump lawyer Lin Wood is a “witness for the state” in the Georgia election subversion case, Fulton County District Attorney Fani Willis revealed Wednesday.",
    "url": "https://www.cnn.com/2023/09/20/politics/lin-wood-georgia-election-subversion-case/"
  },
  {
    "text": "Three fake electors charged in Georgia election probe seek to move cases to federal court  —  David Shafer, Shawn Still and Cathy Latham are among the 16 Georgians who acted as so-called false electors for Trump in Georgia in 2020.  —  Three Georgia Republicans who participated … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/three-fake-electors-charged-georgia-election-probe-seek-move-cases-fed-rcna107952"
  },
  {
    "text": "Feds to restart mail-order Covid test program  —  “The president wanted to make sure that no one can go without tests,” HHS Secretary Xavier Becerra said.  —  The federal government will again offer free Covid-19 tests through the mail, HHS Secretary Xavier Becerra told reporters Wednesday … ",
    "url": "https://www.politico.com/news/2023/09/20/feds-mail-order-covid-test-00117133"
  },
  {
    "text": "Free COVID test kits are coming back.  Here's how to get them.  —  The Biden administration is preparing to resume taking orders for free at-home COVID-19 tests starting September 25, officials announced Wednesday.  The administration is also planning a new infusion of money to boost domestic manufacturing of the test kits.",
    "url": "https://www.cbsnews.com/news/free-covid-tests-how-to-order-online/"
  },
  {
    "text": "Democrats have been winning big in special elections  —  That could bode well for them in the 2024 election.  —  Democrats just scored a big win in an election on Tuesday: Democrat Hal Rafter defeated Republican James Guzofski 56 percent to 44 percent in a special election to fill … ",
    "url": "https://abcnews.go.com/538/democrats-winning-big-special-elections/story?id=103315703"
  },
  {
    "text": "Breaking Up Is Hard to Do  —  Rupert Murdoch didn't want to dump his ratings leader and favorite Fox host.  But was Tucker Carlson giving him a choice?  —  After Donald Trump was elected president in 2016, Fox News — to the surprise of many, including founder Rupert Murdoch, who loathed Trump … ",
    "url": "https://nymag.com/intelligencer/article/michael-wolff-fox-news-rupert-murdoch-tucker-carlson-book-excerpt.html"
  },
  {
    "text": "Federal Reserve issues FOMC statement  —  For release at 2:00 p.m. EDT  —  Recent indicators suggest that economic activity has been expanding at a solid pace.  Job gains have slowed in recent months but remain strong, and the unemployment rate has remained low.  Inflation remains elevated.",
    "url": "https://www.federalreserve.gov/newsevents/pressreleases/monetary20230920a.htm"
  },
  {
    "text": "Don't Ask, Don't Tell Resources  —  DOD is committed to increasing its efforts to reach LGBTQ+ veterans discharged under less than honorable conditions for homosexual conduct prior to the repeal of Don't Ask, Don't Tell to ensure they are aware of the process to request a correction to their military record.",
    "url": "https://www.defense.gov/Spotlights/Dont-Ask-Dont-Tell-Resources/"
  },
  {
    "text": "Trump and Meadows joked about Covid on plane after Biden debate, book says  —  Exclusive: Ex-aide Cassidy Hutchinson says Trump ordered White House guests who tested positive to remove masks in Oval Office  —  Donald Trump and his chief of staff Mark Meadows joked about the then US president having Covid … ",
    "url": "https://www.theguardian.com/books/2023/sep/20/trump-meadows-joked-covid-biden-debate-cassidy-hutchinson-book"
  },
  {
    "text": "FACT SHEET: Biden-Harris Administration Launches American Climate Corps to Train Young People in Clean Energy, Conservation, and Climate Resilience Skills, Create Good-Paying Jobs and Tackle the Climate Crisis  —  In its first year, the American Climate Corps will put more than 20,000 young people … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2023/09/20/fact-sheet-biden-harris-administration-launches-american-climate-corps-to-train-young-people-in-clean-energy-conservation-and-climate-resilience-skills-create-good-paying-jobs-and-tackle-the-clima/"
  },
  {
    "text": "Ohio abortion rights activists suffer blow in suit over referendum language  —  A fetus will now be referred to as an ‘unborn child’ on a ballot measure to enshrine abortion rights in the state constitution  —  In this year's only opportunity for US voters to directly weigh in on the right to abortion … ",
    "url": "https://www.theguardian.com/world/2023/sep/19/ohio-abortion-rights-referendum-language"
  },
  {
    "text": "Kari Lake to launch Arizona Senate bid next month  —  The close ally of Trump is looking to run in the swing state again.  —  Arizona Republican Kari Lake will launch a Senate run as soon as early next month, according to three people familiar with her plans.",
    "url": "https://www.politico.com/news/2023/09/20/kari-lake-arizona-senate-bid-00117148"
  },
  {
    "text": "Fetterman pledges to wear suit if government avoids shutdown  —  (WHTM) - Pennsylvania U.S. Senator John Fetterman says if the United States House of Representatives can reach a deal to avoid a government shutdown, he'll ditch his signature hoodie and shorts for a suit.",
    "url": "https://www.abc27.com/pennsylvania-politics/fetterman-pledges-to-wear-suit-if-government-avoids-shutdown/"
  },
  {
    "text": "The anti-vaccine movement is on the rise.  The White House is at a loss over what to do about it.  —  “They keep just hoping it'll go away.”  —  This is the first story of a five-part series diving into the rise of the anti-vaccine political movement.  —  A Biden administration that vowed … ",
    "url": "https://www.politico.com/news/2023/09/20/biden-anti-vax-movement-00116516"
  },
  {
    "text": "Freedom Caucus Holds Shutdown Talks in a Tax Cheat's Home.  The Neighbors Are Pissed.  —  The Freedom Caucus met Monday night in a private residence on Capitol Hill—at least, it's supposed to be a private residence. … When House Freedom Caucus members leveraged their votes this week … ",
    "url": "https://www.thedailybeast.com/freedom-caucus-holds-shutdown-talks-in-a-tax-cheats-home-the-neighbors-are-pissed"
  },
  {
    "text": "White House told U.S. ambassador to Japan to stop taunting China on social media  —  Rahm Emanuel has mocked Chinese President Xi Jingping, speculating about the recent disappearance of a top official.  —  WASHINGTON — President Joe Biden's aides have asked that Rahm Emanuel … ",
    "url": "https://www.nbcnews.com/politics/white-house/rahm-emanuel-mock-china-ambassador-rcna105982"
  }
]