[
  {
    "text": "Jim Jordan to force floor vote for House speaker on Tuesday after consolidating Republican support - as it happened  —  This live blog has now closed.  Read our latest US politics stories here:  —  Key events  —  Closing summary  —  Biden and Harris condemn murder of six-year-old Palestinian in Illinois",
    "url": "https://www.theguardian.com/us-news/live/2023/oct/16/trump-gag-order-jan-6-trial-biden-israel-politics-live-updates"
  },
  {
    "text": "Jordan builds Speakership momentum as opposition falls  —  Opposition to House GOP Speaker nominee Rep. Jim Jordan (Ohio) is crumbling as Republicans return to Washington for a House vote to try to officially elect him.  —  Four key lawmakers who signaled opposition to Jordan last week fell … ",
    "url": "https://thehill.com/homenews/house/4258693-jordan-speakership-momentum-opposition-falls/"
  },
  {
    "text": "Jim Jordan skeptics begin lining up behind his House speaker bid  —  Rep. Jim Jordan (R-Ohio) is shoring up support from detractors for his bid for House speaker as he prepares to go to the floor for a vote on Tuesday. … - “Jim Jordan and I have had two cordial, thoughtful … ",
    "url": "https://www.axios.com/2023/10/16/jim-jordan-house-speaker-endorsements"
  },
  {
    "text": "Jim Jordan's remarkably thin legislative track record  —  In a historically fraught time marked not only by partisan gridlock but also a remarkably incohesive Republican Party, the House GOP could soon elect a speaker with a remarkably thin legislative track record and precious little experience building … ",
    "url": "https://www.washingtonpost.com/politics/2023/10/16/jim-jordan-speaker-legislation-effectiveness/"
  },
  {
    "text": "Biden campaign to launch account on Trump's Truth Social  —  'There's very little ‘truth’ happening on Truth Social, but at least now it'll be a little fun,' Biden campaign tells Fox News Digital  —  EXCLUSIVE: The Biden campaign is launching an account on former President Trump's Truth Social, Fox News Digital has learned.",
    "url": "https://www.foxnews.com/politics/biden-campaign-launch-account-trumps-truth-social"
  },
  {
    "text": "Trump placed under limited gag order in federal election case in D.C.  —  No ‘carte blanche’ for a candidate who is also a defendant, the judge said at a hearing  —  A federal judge issued a limited gag order Monday against Donald Trump, saying the former president must stop disparaging prosecutors … ",
    "url": "https://www.washingtonpost.com/national-security/2023/10/16/trump-gag-order-chutkan/"
  },
  {
    "text": "Judge imposes gag order on Donald Trump in D.C. trial  —  Judge Tanya Chutkan said Trump's “presidential candidacy does not give him carte blanche to vilify ... public servants who are simply doing their job.”  —  A federal judge has barred Donald Trump from attacking witnesses … ",
    "url": "https://www.politico.com/news/2023/10/16/judge-imposes-gag-order-on-donald-trump-in-d-c-trial-00121743"
  },
  {
    "text": "21 species removed from endangered list due to extinction, U.S. wildlife officials say  —  Nearly two dozen species are being taken off the endangered species list because they are extinct, the U.S. Fish and Wildlife Service said Monday.  —  Most of the species were listed under … ",
    "url": "https://www.cbsnews.com/news/21-species-removed-from-endangered-list-due-to-extinction-us-wildlife-officials-say/"
  },
  {
    "text": "Federal government declares 21 species extinct  —  The U.S. Fish and Wildlife Service (FWS) declared 21 species extinct Monday, including 10 birds and two freshwater fish.  —  The species, which the agency removed from the list of those protected under the Endangered Species Act (ESA) … ",
    "url": "https://thehill.com/policy/energy-environment/4258766-21-species-extinct-birds-freshwater-fish/"
  },
  {
    "text": "Suspect in death of 6-year-old Palestinian American boy was obsessed with Israel-Hamas war, prosecutors say  —  Hundreds are expected to attend the funeral of Wadea Al-Fayoume, whose death is being investigated as an anti-Muslim hate crime.  —  The suburban Chicago landlord accused of stabbing … ",
    "url": "https://www.nbcnews.com/news/us-news/suspect-wadea-al-fayoume-death-was-obsessed-israel-hamas-war-prosecuto-rcna120589"
  },
  {
    "text": "Israel war: Over 30 arrested in protest at White House calling for ceasefire in Gaza  —  Over 30 protesters were arrested outside the White House after a demonstration calling for a ceasefire in Gaza.  —  The protest was led by several Jewish groups, specifically the IfNotNow Movement … ",
    "url": "https://www.washingtonexaminer.com/news/white-house/30-arrested-protest-white-house-ceasefire-gaza"
  },
  {
    "text": "Huntsman family, longtime Penn supporters, will halt donations to ‘unrecognizable’ University  —  This story is developing and will continue to be updated.  —  1987 College graduate Jon Huntsman Jr. told Penn President Liz Magill that his family will stop donating to Penn … ",
    "url": "https://www.thedp.com/article/2023/10/penn-jon-huntsman-jr-wharton-halts-donations-magill"
  },
  {
    "text": "Settlement over Trump family separations at the border limits future separations for 8 years  —  The federal government would be barred from immigration policies that separate parents from children for eight years under a proposed court settlement announced Monday that also provides families … ",
    "url": "https://apnews.com/article/separated-children-trump-biden-border-immigration-f9a73685d0ddbcda86e5b69997f5f7dd"
  },
  {
    "text": "Trump, under fire for Israel comments, proposes fresh crackdown on Muslim immigrants  —  The Republican polling leader responded to backlash for calling Hezbollah ‘very smart’ by reviving a proposal for screening immigrants by ideology  —  CLIVE, Iowa — Former president Donald Trump … ",
    "url": "https://www.washingtonpost.com/politics/2023/10/16/trump-muslim-immigrants-crackdown/"
  },
  {
    "text": "U.S. Picks Troops to Prepare for Potential Deployment to Middle East  —  The U.S. military has selected roughly 2,000 troops to prepare for a potential deployment to support Israel, U.S. defense officials said.  The troops are tasked with missions like advising and medical support … ",
    "url": "https://www.wsj.com/livecoverage/israel-hamas-war-gaza-palestinians/card/u-s-picks-troops-to-prepare-for-potential-deployment-to-middle-east-0pYNLxiZ7dmUbN6NxCML?mod=followamazon"
  },
  {
    "text": "Rockets are fired toward Israel from the Gaza Strip, as seen from southern Israel, Monday.Credit: Leo Correa /AP  — Hamas releases first video of Israeli hostage in Gaza; family confirms  — Hamas claims to hold 200 Israeli hostages, with dozens held by other Gaza factions",
    "url": "https://www.haaretz.com/israel-news/2023-10-16/ty-article-live/israel-prepares-for-ground-invasion-biden-big-mistake-to-reoccupy-gaza/0000018b-364f-dc99-a1db-3fcf1ae10000"
  },
  {
    "text": "Justice Department Seeking Stronger Prison Sentences for Proud Boys Members  —  DOJ filed notice it wants the U.S. Court of Appeals in D.C., to help impose longer sentences for Enrique Tarrio, Joseph Biggs, Zachary Rehl, Dominic Pezzola and Ethan Nordean",
    "url": "https://themessenger.com/politics/proud-boys-prison-sentences-justice-department-appeal-tarrio-biggs-jan6"
  },
  {
    "text": "Former Navajo Nation president challenges Arizona Republican who ousted McCarthy  —  Former Navajo Nation President Jonathan Nez is challenging Republican Rep. Eli Crane for his seat in Arizona's 2nd Congressional District.  —  Nez, in his announcement on X, the website formerly known as Twitter … ",
    "url": "https://thehill.com/homenews/campaign/4258625-ex-navajo-nation-president-challenges-arizona-republican-who-ousted-mccarthy/"
  }
]