[
  {
    "text": "How Trump's Election Lies Left the Michigan G.O.P. Broken and Battered  —  Infighting between Trump acolytes and traditionalists has driven away donors and voters.  Can the Michigan Republican Party rebuild in time for the presidential election?  —  The Michigan Republican Party is starving for cash.",
    "url": "https://www.nytimes.com/2023/08/29/us/politics/trump-michigan-republican-party.html"
  },
  {
    "text": "Steve Scalise diagnosed with ‘very treatable’ blood cancer  —  House Majority Leader Steve Scalise (R-La.) was diagnosed with multiple myeloma, a blood cancer, he announced Tuesday.  —  Scalise, 57, has begun treatment and plans to return to Washington, D.C.",
    "url": "https://thehill.com/homenews/house/4176620-steve-scalise-diagnosed-blood-cancer/"
  },
  {
    "text": "These are the first 10 drugs subject to Medicare price negotiations  —  The Biden administration unveiled Tuesday the names of the first 10 drugs subject to price negotiations in Medicare.  —  They are: Eliquis, Jardiance, Xarelto, Januvia, Farxiga, Entresto, Enbrel, Imbruvica, Stelara … ",
    "url": "https://www.cnn.com/2023/08/29/politics/medicare-drug-price-negotiations/"
  },
  {
    "text": "Supreme Court Justice Amy Coney Barrett Says She Welcomes Public Scrutiny Of Court  —  U.S. Supreme Court Justice Amy Coney Barrett did not offer any opinion, or speak directly about, recent calls for the justices to institute an official code of conduct.  —  LOADING",
    "url": "https://www.huffpost.com/entry/supreme-court-barrett_n_64edc1e4e4b05b73949dea39"
  },
  {
    "text": "GOP salivates at the biggest campaign finance win since Citizens United  —  It could be a seismic shift in how tens of millions of campaign dollars are spent.  —  Republicans have waged a decades-long battle to blow up the campaign-finance laws that rein in big-money spending.",
    "url": "https://www.politico.com/news/2023/08/29/gop-campaign-finance-citizens-united-00113235"
  },
  {
    "text": "Texas Guardsmen spied on migrants via WhatsApp, mishandled secret docs  —  Senior leaders allegedly ignored oversight officials' concerns.  —  This article is co-published and co-reported with The Texas Tribune, a nonprofit newsroom that informs Texans about state policy and politics.",
    "url": "https://www.armytimes.com/news/your-army/2023/08/29/texas-guardsmen-spied-on-migrants-via-whatsapp-mishandled-secret-docs/"
  },
  {
    "text": "The testimony from Trump's White House chief of staff could change everything  —  Former White House chief of staff Mark Meadows rolled the dice on Monday with his opening move in the sprawling Fulton County election subversion trial: he took the stand himself.",
    "url": "https://www.cnn.com/2023/08/29/politics/mark-meadows-gamble-trump-fani-willis/"
  },
  {
    "text": "Conservative Coalition Recruiting for Plan to Dismantle Federal Government  —  NOW HIRING  —  A coalition of right-wing organizations has started recruiting thousands of people as part of a project aimed at gutting the federal government in anticipation of a Republican victory in the 2024 election, according to a report.",
    "url": "https://www.thedailybeast.com/project-2025-conservative-coalition-recruiting-for-plan-to-dismantle-federal-government"
  },
  {
    "text": "GOP silences ‘Tennessee Three’ Democrat on House floor for day on ‘out of order’ rule; crowd erupts  —  Republican lawmakers voted Monday to temporarily silence a Democratic member of the so-called Tennessee Three during an already tense House floor session after determining … ",
    "url": "https://apnews.com/article/tennessee-special-session-gun-control-f0af470eb6f377633735c5a1dcefa66f"
  },
  {
    "text": "The Final Days  —  Joe Biden was determined to get out of Afghanistan—no matter the cost.  —  august is the month when oppressive humidity causes the mass evacuation of official Washington.  In 2021, White House Press Secretary Jen Psaki piled her family into the car for a week at the beach.",
    "url": "https://www.theatlantic.com/magazine/archive/2023/10/afghanistan-withdrawal-biden-decision/675116/"
  },
  {
    "text": "A shutdown wouldn't halt Trump's trials, so Republicans seek to rein in his prosecutors  —  Federal criminal proceedings are exempted from shutdowns.  But GOP House members want to use a must-pass funding bill to defund or limit law enforcement investigating Trump.",
    "url": "https://www.nbcnews.com/politics/donald-trump/shutdown-wouldnt-halt-trumps-trials-republicans-seek-rein-prosecutors-rcna102152"
  },
  {
    "text": "Florida Governor Ron DeSantis faces Black leaders' anger after racist killings in Jacksonville  —  Ron DeSantis scoffed when the NAACP issued a travel advisory this spring warning Black people to use “extreme care” if traveling to Florida.  The leading civil rights group argued … ",
    "url": "https://apnews.com/article/jacksonville-desantis-racist-republican-shooting-haley-scott-9bba89577ae8d0571e1d19b6a947fef5"
  },
  {
    "text": "The Fourteenth Amendment Fantasy  —  The Constitution won't disqualify Trump from running.  The only real-world way of stopping him is through the ballot box.  —  The fourteenth amendment won't save us from Donald Trump.  —  Eminent jurists are promising that it will.",
    "url": "https://www.theatlantic.com/ideas/archive/2023/08/trump-disqualified-president-14th-amendment/675163/"
  },
  {
    "text": "EPA significantly shrinks what qualifies as federal waters after Supreme Court rolled back protections  —  The Environmental Protection Agency and US Army on Tuesday released a new rule that dramatically shrinks what qualifies as federal waters, following a Supreme Court decision in May that rolled back protections for US wetlands.",
    "url": "https://www.cnn.com/2023/08/29/politics/epa-waters-of-the-united-states-rule-climate/"
  },
  {
    "text": "Gadsden flag now a symbol of hate?  —  A schoolboy has become an instant internet legend for defying a school district.  —  The 12-year-old has, as is so often the case, a bunch of patches on his backpack as an expression of his individuality.  His school didn't like one of the patches and demanded that he quit displaying it.",
    "url": "https://hotair.com/david-strom/2023/08/29/gadsden-flag-now-a-symbol-of-hate-n574491"
  },
  {
    "text": "Republicans demand answers from Garland on Covid relief fraud  —  The Labor Department's latest estimate of unsupported payments in the unemployment program from March 2020 to September 2021 is nearly 40%, or $47 billion.  —  A congressional committee investigating pandemic relief fraud … ",
    "url": "https://www.nbcnews.com/politics/congress/republicans-demand-answers-garland-covid-relief-fraud-rcna102298"
  },
  {
    "text": "Playbook: A first look at the big new Biden book  —  Presented by With help from Eli Okun and Garrett Ross  —  DRIVING THE DAY  —  IDALIA LATEST — From the National Hurricane Center's 5 a.m. update: “IDALIA NOW A HURRICANE ... EXPECTED TO RAPIDLY INTENSIFY INTO AN EXTREMELY DANGEROUS MAJOR HURRICANE BEFORE LANDFALL ON WEDNESDAY.”",
    "url": "https://www.politico.com/newsletters/playbook/2023/08/29/a-first-look-at-the-big-new-biden-book-00113271"
  },
  {
    "text": "China behind ‘largest ever’ digital influence operation  —  People with ties to China's law enforcement agencies conducted the largest known covert digital influence operation aimed at discrediting the West and promoting Beijing's agenda across more than 50 social media and online platforms … ",
    "url": "https://www.politico.eu/article/china-behind-largest-ever-digital-influence-operation-says-meta/"
  },
  {
    "text": "Scott unveils education plan stressing ‘family first culture’  —  Sen. Tim Scott (R-S.C.) on Monday unveiled an education plan he says will promote a “family first culture,” knocking the Biden administration, Big Tech and teachers unions as he calls to “empower parents.”",
    "url": "https://thehill.com/homenews/campaign/4176524-scott-unveils-education-plan-stressing-family-first-culture/"
  },
  {
    "text": "The chaos in Florida school libraries  —  For months, districts across Florida have purged books with LGBTQ characters and themes from school libraries.  The removal of these books followed the passage of the Parental Rights in Education Act in 2022, a bill championed by Governor Ron DeSantis … ",
    "url": "https://popular.info/p/the-chaos-in-florida-school-libraries"
  },
  {
    "text": "Final Say  —  TEHRAN - In Last July, the Tehran Times exclusively reported that former U.S. envoy for Iran Rob Malley got his security clearance suspended on April 21.  The Tehran Times now can reveal that Malley breached three U.S. national security rules.",
    "url": "https://www.tehrantimes.com/news/488429/Final-Say"
  }
]