[
  {
    "text": "U.S. Deploys B-2 Bombers as Trump Plans to Meet National Security Team  —  President Trump announced the United States had struck Fordo, Iran's heavily fortified nuclear facilities, as well as two other sites.  —  Here are the latest developments.  —  The United States has entered Israel's war against Iran.",
    "url": "https://www.nytimes.com/live/2025/06/21/world/iran-israel-trump?unlocked_article_code=1.Q08.70nJ.4dnQ-xScDwbt&smid=url-share"
  },
  {
    "text": "The United States Bombed Iran.  What Comes Next?  —  President Donald Trump has done what he swore he would not do: involve the United States in a war in the Middle East.  His supporters will tie themselves in knots (as Vice President J. D. Vance did last week) trying to jam the square peg … ",
    "url": "https://www.theatlantic.com/politics/archive/2025/06/united-states-bombed-iran-now-what/683276/"
  },
  {
    "text": "Trump's Two-Week Window for Diplomacy Was a Smoke Screen  —  Well, he did it.  He actually did it.  —  President Donald Trump had insisted for months that he wanted the ultimate deal with Iran, one that would put a definitive end to the country's ability to produce a nuclear weapon.",
    "url": "https://www.theatlantic.com/politics/archive/2025/06/trump-israel-iran-bomb/683275/?gift=kPTlqn0J1iP9IBZcsdI5Ie8uG5lCCjj8j4qVMruuL_s"
  },
  {
    "text": "American Democracy Might Not Survive a War With Iran  —  The United States is well down the road to dictatorship.  Imagine what Trump would do with a state of war.  —  The current debate over bombing Iran is surreal.  To begin with, bombardment is unlikely to lead to a satisfactory outcome.",
    "url": "https://www.theatlantic.com/international/archive/2025/06/democracy-iran-israel-war-trump/683269/?gift=5aUYI8dJ_4U5JTdJqsIAqwzbXk7nlcFLPaxDqLj0C5E"
  },
  {
    "text": "Some lawmakers in both parties question the legality of Trump's Iran strikes  —  Multiple Republicans and Democrats raised constitutional concerns about Trump acting without approval by Congress.  But GOP leaders offered support for his move.  —  WASHINGTON — Several members of Congress … ",
    "url": "https://www.nbcnews.com/politics/congress/lawmakers-both-parties-question-legality-trumps-iran-strikes-rcna214316"
  },
  {
    "text": "Transcript of Trump's speech on US strikes on Iran  —  WASHINGTON (AP) — A transcript of President Donald Trump's speech on U.S. airstrikes on Iran on Saturday as transcribed by The Associated Press:  —  Thank you very much.  —  A short time ago, the U.S. military carried out massive … ",
    "url": "https://apnews.com/article/trump-iran-speech-transcript-text-ff4b286992309ec1337e04260247bb1e"
  },
  {
    "text": "U.S. strikes Iran's nuclear facilities  —  The U.S. military conducted air strikes on Iran's nuclear facilities in Fordow, Natanz and Isfahan on Sunday morning local time, President Trump announced on Truth Social.  —  Why it matters: Trump's decision to intervene directly in support … ",
    "url": "https://www.axios.com/2025/06/21/us-strike-iran-nuclear-israel-trump"
  },
  {
    "text": "Trump faces bipartisan blowback in Congress on Iran strikes  —  While most congressional Republicans and some pro-Israel Democrats are praising President Trump's strikes on Iranian nuclear facilities, pockets of opposition are already emerging in both parties.",
    "url": "https://www.axios.com/2025/06/22/trump-iran-strikes-republicans-democrats-congress"
  },
  {
    "text": "U.S. Military Is Pulled Back Into Middle East Wars  —  The strikes on Iran ushered in a period of high alert as the Pentagon braced for almost-certain retaliation against American forces in the region.  —  The U.S. strikes on nuclear sites in Iran are an extraordinary turn for a military … ",
    "url": "https://www.nytimes.com/2025/06/21/us/politics/military-middle-east-wars.html"
  },
  {
    "text": "MAGA largely falls in line on Trump's Iran strikes  —  Meanwhile, Democrats challenged the constitutionality of the president's actions.  —  President Donald Trump's sudden announcement Saturday night that he bombed three Iranian nuclear sites has skeptics of U.S. military action against Iran largely falling in line.",
    "url": "https://www.politico.com/news/2025/06/21/maga-largely-falls-in-line-on-trumps-iran-strikes-00416450"
  },
  {
    "text": "Exclusive: Israel seeks swift action on Iran, sources say, with a split U.S. administration  —  Israeli officials have told the Trump administration they do not want to wait two weeks for Iran to reach a deal to dismantle key parts of its nuclear program and Israel could act alone before the deadline is up … ",
    "url": "https://www.reuters.com/world/middle-east/israel-seeks-swift-action-iran-sources-say-with-split-us-administration-2025-06-21/"
  },
  {
    "text": "Leaders of House, Senate briefed on attacks  —  Julie Tsirkin and Melanie Zanona  —  House Speaker Mike Johnson, R-La., and Senate Majority Leader John Thune, R-S.D., were briefed on the U.S. attacks on Iranian nuclear sites, their offices tell NBC News.  —  Trump says bombs dropped on 3 nuclear sites in Iran",
    "url": "https://www.nbcnews.com/world/middle-east/live-blog/israel-iran-conflict-rcna214241/rcrd82924?canonicalCard=true"
  },
  {
    "text": "GOP's food stamp plan is found to violate Senate rules.  It's the latest setback for Trump's big bill  —  In another blow to the Republicans' tax and spending cut bill, the Senate parliamentarian has advised that a proposal to shift some food stamps costs from the federal government to states … ",
    "url": "https://apnews.com/article/trump-food-stamps-tax-cuts-senate-spending-101d16d8ca61956fc37f0cce7551fa24"
  },
  {
    "text": "New Texas law will require Ten Commandments to be posted in every public school classroom  —  Texas will require all public school classrooms to display the Ten Commandments under a new law that will make the state the nation's largest to attempt to impose such a mandate.",
    "url": "https://apnews.com/article/texas-ten-commandments-law-3f1ea84acd67a028ad9b7c01c3c2368c"
  },
  {
    "text": "New insight into Texas family detention reveals adults fighting kids for clean water  —  Adults fighting kids for clean water, despondent toddlers and a child with swollen feet denied a medical exam — these first-hand accounts from immigrant families at detention centers included in a motion filed … ",
    "url": "https://apnews.com/article/migrants-child-supervision-texas-e4994b2b6786717ea79a4be230e476bf"
  },
  {
    "text": "After Virginia elections, governor's race begins a new phase  —  The newly formed Democratic ticket for governor, lieutenant governor and attorney general kicked off a joint bus tour while Republicans stump separately.  —  RICHMOND — Virginia's election season kicked into high gear Saturday … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2025/06/21/virginia-governors-race-spanberger-earle-sears/"
  }
]