[
  {
    "text": "Trump says there's ‘no price tag’ for his mass deportation plan  —  In an exclusive interview with NBC News, Trump talked about his campaign promise to carry out the largest mass deportation of immigrants in U.S. history.  —  President-elect Donald Trump told NBC News on Thursday … ",
    "url": "https://www.nbcnews.com/politics/2024-election/trump-says-no-price-tag-mass-deportation-plan-rcna179178"
  },
  {
    "text": "2 Democrats speak out against transgender athletes after Trump win  —  Two House Democrats said they oppose transgender athletes competing in women's sports in the immediate aftermath of President-elect Trump's decisive victory over Vice President Harris, shifting right of their previous policy positions … ",
    "url": "https://thehill.com/homenews/house/4979665-democrats-transgender-athletes/"
  },
  {
    "text": "Playbook: Dems agonize over Sotomayor  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  THE LATEST RACE CALLS — Republican DAVE McCORMICK defeats Democratic Sen. BOB CASEY in Pennsylvania. ...  Reps. DON DAVIS (D-N.C.), YOUNG KIM (R-Calif.), JULIA BROWNLEY … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/11/08/dems-agonize-over-sotomayor-00188412"
  },
  {
    "text": "Democrats Are in Disarray With No Easy Fix  —  The idea that another candidate could have succeeded where Harris failed seems spurious at best. … Vice President Kamala Harris led a coalition that stretched from lefty Representative Alexandria Ocasio-Cortez to former Representative Liz Cheney … ",
    "url": "https://www.bloomberg.com/opinion/articles/2024-11-08/democrats-are-in-disarray-election-2024"
  },
  {
    "text": "Democrats Need To Compete In The New Media Landscape — Or Keep Paying The Price  —  This is your TPM evening briefing.  —  As always happens after a bad election loss — and is compounded when that loss is sweeping, and to the man who launched a coup against the country — the losing side is in full panic mode.",
    "url": "https://talkingpointsmemo.com/where-things-stand/democrats-need-to-compete-in-the-new-media-landscape-or-keep-paying-the-price"
  },
  {
    "text": "Axelrod: Democrats becoming ‘smarty-pants, suburban, college-educated party’  —  Political strategist David Axelrod argued Thursday that Democrats are becoming a “smarty-pants, suburban, college-educated party” that could keep losing electorally if it does not change course.",
    "url": "https://thehill.com/homenews/campaign/4980343-david-axelrod-democratic-party-2024-election-upset/"
  },
  {
    "text": "Scoop: Trump dismissed Rick Scott as Senate GOP leader … - A senior Trump campaign official pushed back on Axios' reporting, saying Trump “hasn't weighed in on the leadership race and anyone who says differently is wrong.” … - Scott had signs at his campaign victory party on Tuesday that read … ",
    "url": "https://www.axios.com/2024/11/08/trump-rick-scott-senate-gop-leader-thune"
  },
  {
    "text": "Why Dean Phillips thinks Harris lost  —  The Washington Post's essential guide to power and influence in D.C.  —  Sign upfor Early Brief newsletter  —  Good morning, Early Birds.  We all made it to Friday.  Have a great weekend.  Send tips to earlytips@washpost.com.  Thanks for waking up with us.",
    "url": "https://www.washingtonpost.com/politics/2024/11/08/why-dean-phillips-thinks-harris-lost/"
  },
  {
    "text": "Judge declares Biden immigration program for spouses of U.S. citizens illegal  —  A federal judge on Thursday struck down a Biden administration program that would allow unauthorized immigrants married to American citizens to get legal status and a streamlined path to U.S. citizenship, declaring the policy illegal.",
    "url": "https://www.cbsnews.com/news/judge-declares-biden-immigration-program-for-spouses-of-u-s-citizens-illegal/"
  },
  {
    "text": "Judge strikes down Biden program shielding immigrant spouses from deportation  —  A federal judge on Thursday struck down a Biden administration policy that aimed to ease a path to citizenship for some undocumented immigrants who are married to U.S. citizens.",
    "url": "https://www.npr.org/2024/11/08/g-s1-33370/judge-biden-program-immigrant-spouses-deportation"
  },
  {
    "text": "Why Democrats won't build their own Joe Rogan  —  Minutes after Donald Trump was declared the winner of the 2024 election, Dana White took the stage to thank the influencers who helped lead Trump to victory.  “I want to thank the Nelk Boys, Adin Ross, Theo Von, Bussin' With The Boys … ",
    "url": "https://www.usermag.co/p/why-democrats-wont-build-their-own"
  },
  {
    "text": "MAGA Launches Increasingly Horrific Attacks on Women After Trump Win  —  The immediate aftermath of Donald Trump's presidential election win is already a bad omen for women and minorities across the nation, who within less than 48 hours have found themselves the subjects of hate campaigns designed to belittle and marginalize them.",
    "url": "https://newrepublic.com/post/188159/donald-trump-maga-attacks-women"
  },
  {
    "text": "Racist text messages target young African Americans post-election  —  Black college and high school students report receiving racist texts about being “selected to pick cotton at the nearest plantation.”  —  Federal, state, and local authorities are investigating the offensive messages that have been sent over the last two days.",
    "url": "https://www.npr.org/2024/11/07/g-s1-33340/racist-text-messages-african-americans-splc-fbi"
  },
  {
    "text": "Adams pledges to work with Trump on public safety, infrastructure  —  The mayor, a Democrat, said he can find common ground with “anyone and everyone.”  —  NEW YORK — Mayor Eric Adams spoke Wednesday with President-elect Donald Trump about working together on infrastructure … ",
    "url": "https://www.politico.com/news/2024/11/07/adams-pledges-to-work-with-trump-00188252"
  },
  {
    "text": "Dump Twitter … The oligarchs won.  When the markets closed November 6—the day Donald Trump was declared winner of the presidential election—the combined wealth of the world's 10 richest people, nine of whom live in the United States, had surged by a combined $63.5 billion.",
    "url": "https://newrepublic.com/article/188156/liberals-dump-musk-leave-twitter"
  },
  {
    "text": "Donald Trump picks Susie Wiles to be chief of staff  —  A veteran of Florida politics, Wiles directed Trump's campaign to victory in the state in 2016.  —  President-elect Donald Trump has tapped his campaign senior adviser Susie Wiles as White House chief of staff.",
    "url": "https://www.politico.com/news/2024/11/07/donald-trump-susie-wiles-chief-of-staff-00188346"
  },
  {
    "text": "The model exactly predicted the most likely election map  —  Before we get into the meat of today's newsletter, just a quick update on our plans.  Silver Bulletin, we hope, will have a long future.  But I'm thinking about things in a few different stages:  — Short term: We're treating next week … ",
    "url": "https://www.natesilver.net/p/the-model-exactly-predicted-the-most"
  },
  {
    "text": "Dem governor issues stark warning to Trump: ‘You come for my people, you come through me’  —  Gov. JB Pritzker says he is a ‘warrior’ for the people of Illinois  —  Democrat Illinois Gov. JB Pritzker issued a stark warning to President-elect Trump following his landmark victory … ",
    "url": "https://www.foxnews.com/politics/dem-governor-issues-stark-warning-trump-you-come-my-people-you-come-through-me"
  },
  {
    "text": "The wreckage Merrick Garland leaves behind  —  His failures left American democracy ripe for the picking. … ✍️  —  It has often been said that Donald Trump was running for president to keep himself out of prison.  Mission accomplished.  —  But the fact that Trump wasn't … ",
    "url": "https://www.publicnotice.co/p/merrick-garland-failures-explained"
  }
]