[
  {
    "text": "Employers Pulled Back on Hiring, Adding 73,000 Jobs  —  The labor market showed signs of weakening, as job gains for the previous two months were also revised lower.  —  Employers continued to create jobs but pulled back on hiring, a sign that more businesses are putting expansion plans on hold as they deal with economic uncertainty.",
    "url": "https://www.nytimes.com/2025/08/01/us/politics/jobs-report-us-economy.html"
  },
  {
    "text": "Unemployment Rose To 4.2% In July As Hiring Fell Sharply  —  Topline  —  The U.S. job market appeared to lose steam last month, according to Labor Department data released Friday, as the Federal Reserve warned the effects of President Donald Trump's tariffs on the economy have yet to be seen.",
    "url": "https://www.forbes.com/sites/tylerroush/2025/08/01/unemployment-rose-to-42-in-july-as-hiring-fell-sharply/"
  },
  {
    "text": "Stunning revisions show US added 258K fewer jobs than first reported  —  The U.S. added 258,000 fewer jobs in May and June than the Labor Department first reported, according to federal data released Friday.  —  The Bureau of Labor Statistics (BLS) issued stunning revisions to its reports … ",
    "url": "https://thehill.com/business/5431805-us-job-growth-revised-downward/"
  },
  {
    "text": "U.S. Jobs Report Falls Flat With Only 73,000 Added in July  —  Massive downward revisions to prior months and a rising unemployment rate paint a troubling picture—healthcare drove most of July's limited gains  —  The U.S. labor market delivered a disappointing performance in July … ",
    "url": "https://meidasnews.com/news/u-s-jobs-report-falls-flat-with-only-73000-added-in-july"
  },
  {
    "text": "‘Clinton Plan’ Emails Were Likely Made by Russian Spies, Declassified Report Shows  —  An annex to a report by the special counsel John H. Durham was the latest in a series of disclosures about the Russia inquiry, as the Trump team seeks to distract from the Jeffrey Epstein files.",
    "url": "https://www.nytimes.com/2025/07/31/us/politics/trump-clinton-emails-russia-investigation.html?unlocked_article_code=1.a08.WmHr.TWoZEuTvFEKm&smid=url-share"
  },
  {
    "text": "How John Durham and Chuck Grassley Covered Up Getting Ass-Handed by Russia  —  The most important passage of the classified annex of the Durham Report is this one — though you won't hear it from the frothy mob, in significant part because Chuck Grassley and Tulsi Gabbard are hiding what these documents are.",
    "url": "https://www.emptywheel.net/2025/08/01/how-john-durham-and-chuck-grassley-covered-up-getting-ass-handed-by-russia/"
  },
  {
    "text": "Smithsonian removes Trump from impeachment exhibit in American History Museum  —  The Smithsonian said it restored the display to an earlier version, which notes that “only three presidents have seriously faced removal.”  —  The Smithsonian's National Museum of American History … ",
    "url": "https://www.washingtonpost.com/entertainment/2025/07/31/trump-impeachment-smithsonian/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzUzOTM0NDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzU1MzE2Nzk5LCJpYXQiOjE3NTM5MzQ0MDAsImp0aSI6ImJkMDI5M2FmLTMzZDUtNDNiMC04YmVmLTk2Yzg5MzI0NzRhOCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9lbnRlcnRhaW5tZW50LzIwMjUvMDcvMzEvdHJ1bXAtaW1wZWFjaG1lbnQtc21pdGhzb25pYW4vIn0.1O5MNBId47-CbznOfSi8hUNcZQNH2D6qeoyIhEyBlLU&itid=gfta"
  },
  {
    "text": "The FBI Redacted Trump's Name in the Epstein Files  —  The bureau's FOIA team tasked with conducting a final review of the records blacked out the names before higher-ups said last month that releasing the documents ‘would not be appropriate or warranted.’ … ‘The most transparent administration in history’",
    "url": "https://www.bloomberg.com/news/newsletters/2025-08-01/epstein-files-trump-s-name-was-redacted-by-the-fbi?accessToken=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzb3VyY2UiOiJTdWJzY3JpYmVyR2lmdGVkQXJ0aWNsZSIsImlhdCI6MTc1NDA1OTE1MiwiZXhwIjoxNzU0NjYzOTUyLCJhcnRpY2xlSWQiOiJUMEJLSjNHUTdMOEUwMCIsImJjb25uZWN0SWQiOiIyQjE3NzFFOTlEODc0QzRDOTY1Njg1RTZBQkJGM0QwRCJ9.3ALPrarxmje8f879sHyUxeFbyg60ntxdgX4Ar8jOZLQ"
  },
  {
    "text": "Further Modifying the Reciprocal Tariff Rates  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, including the International Emergency Economic Powers Act (50 U.S.C. 1701 et seq.)  (IEEPA), the National Emergencies Act … ",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/07/further-modifying-the-reciprocal-tariff-rates/"
  },
  {
    "text": "Kamala Harris refuses to say who's leading Democratic Party when pressed by Colbert  —  Former Vice President Kamala Harris declined to names who is currently leading the Democratic Party when she was pressed about the political void on “The Late Show.”  —  Harris, who was plugging … ",
    "url": "https://www.foxnews.com/media/kamala-harris-refuses-say-whos-leading-democratic-party-when-pressed-colbert"
  },
  {
    "text": "Trump, Term-Limited, Amasses $200 Million War Chest for Political Ambitions  —  The money is meant to beat Democrats, but some Republicans worry it could be used to beat Republicans, too.  —  President Trump's super PAC is sitting on about $200 million that it can spend against his rivals … ",
    "url": "https://www.nytimes.com/2025/07/31/us/politics/maga-inc-trump-fundraising.html"
  },
  {
    "text": "Cooper leads first public poll since jumping in North Carolina Senate race … Cooper, who finished his second term in 2024, starts the open race to replace Tillis with stronger name recognition and favorability than Whatley, a first-time candidate.  Most voters view Cooper positively … ",
    "url": "https://www.politico.com/news/2025/08/01/cooper-leads-first-public-poll-of-north-carolina-senate-race-since-jumping-in-this-week-00487501"
  },
  {
    "text": "Trump raises tariffs on Canada to 35 percent  —  President Trump announced Thursday that the U.S. would raise tariffs on certain Canadian goods from 25 percent to 35 percent beginning Friday.  —  Goods that are covered under the 2020 United States-Mexico-Canada Agreement will be exempt from the tariff rate, the White House said.",
    "url": "https://thehill.com/homenews/administration/5431181-trump-raises-tariffs-on-canada-to-35-percent/"
  },
  {
    "text": "Palantir Is Extending Its Reach Even Further Into Government  —  Palantir has become one of the few winners in the Trump administration's cost-cutting efforts, offering other contractors a lifeline while consolidating its own reach and power.  —  President Donald Trump's administration … ",
    "url": "https://www.wired.com/story/palantir-government-contracting-push/"
  },
  {
    "text": "GOP's summer town hall push gets heated  —  House Republicans are beginning to face rowdy town halls as they try to sell President Donald Trump's sweeping tax and spending law.  Rep. Bryan Steil of Wisconsin had a hostile crowd Thursday night, with jeers and boos from the audience, according to local media reports.",
    "url": "https://www.politico.com/live-updates/2025/08/01/congress/dramatic-start-to-gop-town-hall-season-00488230"
  },
  {
    "text": "Trump administration cuts UCLA research funds … Frenk's letter said “hundreds of grants may be lost” but did not provide further details on the scope, but the Los Angeles Times reported that it accounted for about $200 million in funding.  POLITICO has not independently confirmed that number … ",
    "url": "https://www.politico.com/news/2025/08/01/trump-administration-cuts-ucla-research-funds-00488233"
  },
  {
    "text": "Trump's Bad-to-Worse Options on Epstein … The Trump administration has been flailing as it struggles to contain the fallout from its handling of the so-called Epstein files.  Is there a way out?  —  Even on an overseas trip, President Donald Trump couldn't escape persistent queries … ",
    "url": "https://www.politico.com/news/magazine/2025/08/01/trump-epstein-decisions-ankush-khardori-column-00484918"
  },
  {
    "text": "El Salvador approves indefinite presidential reelection and extends presidential terms to 6 years  —  The party of El Salvador President Nayib Bukele approved constitutional changes in the country's National Assembly on Thursday that will allow indefinite presidential reelection and extend presidential terms to six years.",
    "url": "https://apnews.com/article/el-salvador-nayib-bukele-reelection-f9efd1a08d3c9de2f886f7b911b9417d"
  },
  {
    "text": "Scotland Trolls Trump With Massive New Wind Farm on His Doorstep  —  SPIRALING  —  “Stop the windmills!  You are ruining your countries,” Trump ranted days earlier while on a visit to the country.  —  The Scottish government has green-lighted one of the world's biggest wind farms … ",
    "url": "https://www.thedailybeast.com/scotland-trolls-trump-with-massive-new-wind-farm-on-his-doorstep/"
  },
  {
    "text": "Trump administration firings mount as staffers' loyalty is called into question … In an interview with POLITICO, Loomer said she is now fielding tips from administration officials about colleagues they want exiled amid what she called “a serious vetting crisis,” predicting there are “hundreds” more she expects to purge.",
    "url": "https://www.politico.com/news/2025/08/01/trump-firings-loomer-00488070"
  },
  {
    "text": "Judges Are Begging The Public To Take Trump's Attacks On Them Seriously  —  Federal judges wonder if they can't keep themselves or their families safe, how are they expected to uphold the rule of law?  —  Sitting federal judges targeted for impeachment or misconduct complaints … ",
    "url": "https://www.huffpost.com/entry/judges-beg-public-take-trump-admin-threats-courts-seriously_n_688bd158e4b0f5c3b7c9ceaf"
  },
  {
    "text": "Inside the Crisis at the Anti-Defamation League  —  The group used to fight for justice for all.  Its war against anti-Zionism has changed everything.  —  On June 4, an executive at the Anti-Defamation League, which was founded with a mission to defend the Jewish people and … ",
    "url": "https://nymag.com/intelligencer/article/inside-adl-anti-defamation-league-greenblatt-zionism-trump-gaza.html"
  },
  {
    "text": "DOGE Wasted Tens of Billions While Chainsawing the Government in the Name of ‘Efficiency’: Senate Report  —  The Department of Government Efficiency wasn't so efficient after all.  In fact, it was extraordinarily wasteful, according to a Thursday report by the U.S. Senate's investigations subcommittee.",
    "url": "https://www.commondreams.org/news/doge-wasted-tens-of-billions"
  },
  {
    "text": "Capitol agenda: It's down to Trump, Schumer and Thune  —  The Senate's summer exit is getting complicated as lawmakers brace for some weekend work.  Tensions are running high over government funding negotiations.  And Senate leaders have yet to seal a deal to advance dozens … ",
    "url": "https://www.politico.com/live-updates/2025/08/01/congress/trump-schumer-thune-senate-00488164"
  },
  {
    "text": "8/1/25 ☀️ AM: … Welcome to August. … Once backed by just a handful of progressives, Sen. Bernie Sanders' (I-Vt.) months-long effort to block the transfer of certain offensive weapons to Israel now has the support of more than half the Senate Democratic Caucus.",
    "url": "https://punchbowl.news/archive/8125-am/"
  },
  {
    "text": "South Korea says it has no written pact on US trade deal  —  There is no written agreement yet on a trade deal between South Korea and the United States announced by President Donald Trump this week, the Asian nation's trade minister said on Friday.  —  The U.S. tariff on South Korean imports … ",
    "url": "https://www.reuters.com/world/asia-pacific/south-korea-says-it-has-no-written-pact-us-trade-deal-2025-08-01/"
  },
  {
    "text": "Trump to blame for high cost of living, Americans say in new poll  —  Six out of 10 Americans fault president for financial struggles and eight out of 10 worry about tariffs' impact  —  Americans are struggling financially, grappling with debt and the rising cost of living … ",
    "url": "https://www.theguardian.com/business/2025/aug/01/trump-inflation-cost-of-living-poll"
  }
]