[
  {
    "text": "No Labels Will Abandon 2024 Presidential Campaign Effort  —  The centrist group plans to announce it won't field a third-party ‘unity ticket’ after months of failing to find a candidate to lead its effort  —  WASHINGTON—No Labels, the centrist group which has sought to field a third-party presidential bid … ",
    "url": "https://www.wsj.com/politics/elections/no-labels-will-abandon-2024-presidential-campaign-effort-4b4e5121"
  },
  {
    "text": "No Labels abandons 2024 presidential effort  —  The bipartisan group No Labels won't put forward a third-party presidential ticket after failing to find a candidate, multiple outlets have reported.  —  No Labels will reportedly announce Monday that it hasn't been able to recruit … ",
    "url": "https://thehill.com/homenews/campaign/4575052-no-labels-party-passes-2024-election-candidate/"
  },
  {
    "text": "Is Trump's $175 million civil fraud bond valid in New York?  —  When former President Donald Trump posted a $175 million bond in New York on Monday, it appeared that he had evaded a financial crisis.  He had paused enforcement of the more than $460 million judgment against him following a civil fraud trial, while his appeal is pending.",
    "url": "https://www.cbsnews.com/news/donald-trump-175-million-civil-fraud-bond-valid-new-york/"
  },
  {
    "text": "Scoop: Johnson faces new pressure from Democrats on foreign aid … - “He's a bit boxed in,” one House Democrat said of Johnson. … - “No matter which path he walks down ... one's with alligators, one's with piranhas. … - In addition to Ukraine and Gaza, the letter calls for aid to Sudan … ",
    "url": "https://www.axios.com/2024/04/04/mike-johnson-ukraine-aid-bill-israel"
  },
  {
    "text": "Judge denies Trump bid to dismiss classified documents prosecution  —  A federal judge refused Thursday to throw out the classified documents prosecution against Donald Trump, rejecting a defense argument that the case should be tossed because he was entitled as a former president to retain the records after he left office.",
    "url": "https://apnews.com/article/donald-trump-jack-smith-classified-documents-b862ec627ac0070e5353ac324d8d333f"
  },
  {
    "text": "RFK Jr. campaign says Jan. 6 ‘activists’ have been ‘stripped of their Constitutional liberties’  —  Robert F. Kennedy Jr. has said he would consider pardoning Jan. 6 defendants if elected president, and his campaign compared them to “political prisoner” Julian Assange.",
    "url": "https://www.nbcnews.com/politics/2024-election/rfk-jr-campaign-jan-6-activists-stripped-constitutional-liberties-rcna146445"
  },
  {
    "text": "G.O.P. Congressman's Wild Claim: F.B.I. Entrapped Jan. 6 Rioters  —  More than three years after the attack on Congress, a Republican subcommittee chairman offered a series of baseless and disproved claims about it, reflecting an effort on the right to falsify what occurred.",
    "url": "https://www.nytimes.com/2024/04/04/us/politics/clay-higgins-jan-6.html"
  },
  {
    "text": "Biden moves to defang political assaults on federal workforce  —  The move is widely seen as a response to former President Donald Trump's efforts to root out what he called a “deep state” that thwarted his policies.  —  The Biden administration put the finishing touches Thursday on a plan … ",
    "url": "https://www.politico.com/news/2024/04/04/biden-moves-to-defang-political-assaults-on-federal-workforce-00150446"
  },
  {
    "text": "Former President Donald Trump On Israel's War, 2024 And Much More  —  Former President Donald Trump joined me this morning:  —  Audio:  —  04-04hhs-trump  —  Transcript:  —  HH: Joined by our very special guest, former President Donald Trump.  Mr. President, welcome back.",
    "url": "https://hughhewitt.com/former-president-donald-trump-on-israels-war-2024-and-much-more"
  },
  {
    "text": "Reps. Andy Biggs, Paul Gosar subpoenaed in Arizona probe of Trump fake electors  —  The Arizona attorney general is nearing a decision on whether to charge Trump allies with crimes, but there is no indication Biggs or Gosar will face charges.  —  Arizona investigators probing Republicans' efforts … ",
    "url": "https://www.politico.com/news/2024/04/04/biggs-gosar-arizona-subpoenas-00150416"
  },
  {
    "text": "Biden warns Netanyahu the situation in Gaza is ‘unacceptable’  —  The president said U.S. policy will change if Israel does not immediately take ‘specific, concrete, and measurable’ steps to address the disaster  —  President Biden told Israeli Prime Minister Benjamin Netanyahu on Thursday … ",
    "url": "https://www.washingtonpost.com/politics/2024/04/04/biden-warns-netanyahu-situation-gaza-is-unacceptable/"
  },
  {
    "text": "The Washington press corps doesn't have a freaking clue  —  I've been away for nearly two weeks, almost entirely unplugged, and let me tell you, a little distance makes the failure of the American political press even more horrifying and inexcusable.  —  The nation stands on the edge of a precipice … ",
    "url": "https://presswatchers.org/2024/04/the-washington-press-corps-doesnt-have-a-freaking-clue/"
  },
  {
    "text": "Jeffrey Clark's bid to aid Trump election scheme violated attorney rules, DC Bar panel finds  —  Disciplinary investigators who brought the charges against Clark say they intend to advocate for his disbarment.  —  A disciplinary panel in Washington has found that Jeffrey Clark … ",
    "url": "https://www.politico.com/news/2024/04/04/jeffrey-clark-ethics-rules-00150631"
  },
  {
    "text": "Biden says U.S. economy is world's best.  Trump calls it a ‘cesspool.’ Data is clear. … U.S. President Joe Biden, delivers remarks on the U.S. economy and his administration's effort to revive American manufacturing, during his visit in Flex LTD, a factory that makes solar energy microinverters … ",
    "url": "https://www.cnbc.com/2024/04/04/biden-us-economy-worlds-best-trump-claims-cesspool-data-is-clear.html"
  },
  {
    "text": "Alyssa Farah Griffin rips RFK Jr. in op-ed: ‘Gaslighting and real-time pivoting’  —  Former Trump administration aide Alyssa Farah Griffin went after Robert F. Kennedy Jr. in an op-ed published in The Daily Beast, calling out the independent presidential candidate for “gaslighting and real-time pivoting” … ",
    "url": "https://thehill.com/homenews/campaign/4575111-alyssa-farah-griffin-rfk-jr-op-ed-2024/"
  },
  {
    "text": "Attempt to consolidate Electoral College votes fails in Nebraska Legislature  —  ‘Winner-take-all’ change would eliminate Democrats' opportunity to repeat the 2020 ‘blue dot’ win for Biden  —  LINCOLN, Neb. (WOWT) - An attempt to turn Nebraska into a “winner-take-all” state … ",
    "url": "https://www.wowt.com/2024/04/03/nebraska-lawmakers-pushing-consolidate-states-electoral-college-votes/"
  },
  {
    "text": "How Trump's story about Ruby Garcia's family went horribly awry  —  Donald Trump boasted about speaking to members of a murder victim's family.  It now appears he made that up.  —  In light of Donald Trump's overtly anti-immigrant platform, it wasn't too surprising to see the Republican seize … ",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trumps-story-ruby-garcias-family-went-horribly-awry-rcna146351"
  },
  {
    "text": "Louisiana HB 777 Would Criminalize Librarians and Libraries Who Join the American Library Association  —  Despite the fact that l ibrarians are among the most trusted professionals, per data acquired in several studies of parents on the perceptions of the profession, lawmakers across … ",
    "url": "https://bookriot.com/louisiana-hb-777/"
  },
  {
    "text": "Trump tests gag order by sharing articles on judge's family  —  Former President Trump shared articles critical of Judge Juan Merchan and his family on Wednesday, appearing to test the bounds of the gag order placed on Trump in his New York hush money case.  —  Merchan expanded the gag order Monday … ",
    "url": "https://thehill.com/regulation/court-battles/4574362-trump-tests-gag-order-by-sharing-articles-on-judges-family/"
  },
  {
    "text": "Musk's X pivots again, restoring blue checks to popular accounts  —  The social network formerly known as Twitter is now gifting premium features to users with at least 2,500 verified followers  —  A year after his controversial decision to remove verification from popular Twitter accounts unless … ",
    "url": "https://www.washingtonpost.com/technology/2024/04/04/twitter-blue-check-restored-x/"
  },
  {
    "text": "Evicted, arrested and being sued by the boss: When will MAGA learn loyalty to Trump ends in sorrow?  —  Another week, another round of people destroying their lives while Trump skates free of consequences  —  When I saw the news that the stock price of Truth Social went into freefall … ",
    "url": "https://www.salon.com/2024/04/04/evicted-arrested-and-being-sued-by-the-boss-when-will-maga-learn-loyalty-to-ends-in-sorrow/"
  },
  {
    "text": "Readout of President Joe Biden's Call with Prime Minister Netanyahu of Israel  —  President Biden spoke by telephone with Prime Minister Netanyahu.  The two leaders discussed the situation in Gaza.  President Biden emphasized that the strikes on humanitarian workers and the overall humanitarian situation are unacceptable.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/04/04/readout-of-president-joe-bidens-call-with-prime-minister-netanyahu-of-israel-3/"
  },
  {
    "text": "Election 2024: Trump +8 Over Biden, Third-Party Candidates Have Little Impact  —  President Joe Biden continues to trail former President Donald Trump in their election rematch, regardless of which third-party candidates are included on the ballot.  —  The latest Rasmussen Reports national telephone … ",
    "url": "https://www.rasmussenreports.com/public_content/politics/biden_administration/election_2024_trump_8_over_biden_third_party_candidates_have_little_impact"
  },
  {
    "text": "DeSantis predicts voters will reject ‘radical’ ballot measures on pot and abortion  —  The governor contended that many voters had “developed a skepticism” about proposed amendments in recent years and that the “default” position for many voters was no.  —  TALLAHASSEE, Florida … ",
    "url": "https://www.politico.com/news/2024/04/04/desantis-abortion-marijuana-ballot-initiatives-00150616"
  },
  {
    "text": "Roseanne Barr Pushed QAnon Blood Drinking Conspiracy at Kari Lake's Mar-a-Lago Event  —  Barr also encouraged everyone to drop out of college  —  Kari Lake, who is running for a Senate seat after losing her governor's race, had a fundraiser at Trump's Mar-a-Lago home.",
    "url": "https://www.meidastouch.com/news/roseanne-barr-pushed-qanon-blood-drinking-conspiracy-at-kari-lakes-mar-a-lago-event"
  }
]