[
  {
    "text": "Surge in U.S. Concern About Immigration Has Abated  —  WASHINGTON, D.C. — Americans have grown markedly more positive toward immigration over the past year, with the share wanting immigration reduced dropping from 55% in 2024 to 30% today.  At the same time, a record-high 79% of U.S. adults … ",
    "url": "https://news.gallup.com/poll/692522/surge-concern-immigration-abated.aspx"
  },
  {
    "text": "Trump readies blanket tariffs as he brushes off inflation worries  —  In a wide-ranging interview with NBC News, Trump talked about tariffs, sending Patriot missiles to NATO for Ukraine and how he'll sell his recently passed “big, beautiful bill.”  —  President Donald Trump on Thursday … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-tariffs-inflation-hasbro-ukraine-patriot-missiles-nato-russia-rcna218125"
  },
  {
    "text": "George Mason Is the Latest University Under Fire From Trump.  Its President Fears an “Orchestrated” Campaign.  —  When university president Gregory Washington received notice that the Trump administration had opened an investigation into complaints of antisemitism, he was “perplexed.”",
    "url": "https://www.propublica.org/article/george-mason-university-antisemitism-investigation-trump"
  },
  {
    "text": "Harvard Explores New Center for Conservative Scholarship Amid Trump Attacks  —  The Ivy League school has discussed an effort to ‘support viewpoint diversity’ with potential donors, says it ‘will not be partisan’  —  Harvard leaders have discussed creating a program that people briefed … ",
    "url": "https://www.wsj.com/us-news/education/harvard-conservative-scholarship-center-trump-attacks-a187242a"
  },
  {
    "text": "Whistleblower Documents Implicate Emil Bove in Criminal Contempt Order by Chief Judge Boasberg  —  A whistleblower's documents provided to Congress implicate Emil Bove in the administration's violation of a court order that prohibited the transfer of more than 100 Venezuelans to El Salvador's CECOT prison.",
    "url": "https://www.justsecurity.org/116777/bove-criminal-contempt-boasberg/"
  },
  {
    "text": "Sen. Angela Paxton files for divorce from Attorney General Ken Paxton  —  In a statement, Angela Paxton said she moved to end her 38-year marriage “on biblical grounds,” citing “recent discoveries.”  —  State Sen. Angela Paxton announced Thursday she has filed for divorce from her husband, Texas Attorney General Ken Paxton.",
    "url": "https://www.texastribune.org/2025/07/10/angela-paxton-divorce-texas-attorney-general-ken/"
  },
  {
    "text": "Mike Lee Can't Stop Throwing Social Media Grenades.  His Church Isn't Happy.  —  The Utah senator's online persona has further damaged his already frayed relationship with The Church of Jesus Christ of Latter-day Saints.  —  It was Father's Day morning, but Mike Lee was still hard at work on social media.",
    "url": "https://www.politico.com/news/magazine/2025/07/11/mike-lee-utah-mormon-church-profile-00437296"
  },
  {
    "text": "Did Trump Really Just Break Up with Putin?  —  It's never easy to tell which flip or flop the flip-flopper in the White House means.  —  Donald Trump finally called “bullshit” on Vladimir Putin this week, though nobody seems to quite know what it means.  One explanation, and perhaps the best one … ",
    "url": "https://www.newyorker.com/news/letter-from-trumps-washington/did-donald-trump-really-just-break-up-with-vladimir-putin"
  },
  {
    "text": "Federal immigration agents blockade Camarillo farm, clash with demonstrators  —  Federal immigration agents descended on a farm outside of Camarillo on July 10, blocking off a road outside the facility and clashing with protesters.  —  Reports flooded social media in the morning … ",
    "url": "https://eu.vcstar.com/story/news/local/2025/07/10/immigration-raid-near-camarillo-sets-up-clash-with-ice-protesters/84540242007/"
  },
  {
    "text": "How Netanyahu Prolonged the War in Gaza to Stay in Power … Prime Minister Benjamin Netanyahu on June 5.  —  ‘You no longer have a government’  —  Six months into the war in the Gaza Strip, Benjamin Netanyahu was preparing to bring it to a halt.  Negotiations were underway … ",
    "url": "https://www.nytimes.com/2025/07/11/magazine/benjamin-netanyahu-gaza-war.html?unlocked_article_code=1.Vk8.khSS.frmunMArZFM1&smid=url-share"
  },
  {
    "text": "DHS Tells Police That Common Protest Activities Are ‘Violent Tactics’  —  DHS is urging law enforcement to treat even skateboarding and livestreaming as signs of violent intent during a protest, turning everyday behavior into a pretext for police action.  —  The Department of Homeland Security … ",
    "url": "https://www.wired.com/story/dhs-tells-police-that-common-protest-activities-are-violent-tactics/"
  },
  {
    "text": "Missouri Governor Signs Bill Rolling Back Voter-Approved Minimum Wage and Sick Leave  —  The reversal reflected a growing struggle over the use of ballot measures to answer policy questions in Republican-led states.  —  When Missouri voters were asked last year whether they wanted to increase … ",
    "url": "https://www.nytimes.com/2025/07/10/us/missouri-minimum-wage-leave.html"
  },
  {
    "text": "Trump's Texas visit highlights an us-vs-them approach to disasters  —  In the days since flash flooding killed at least 120 people in Texas, President Donald Trump has pledged unwavering support for the deep-red state, lauding Republican Governor Greg Abbott and other local officials for their … ",
    "url": "https://www.reuters.com/business/environment/trumps-texas-visit-highlights-an-us-vs-them-approach-disasters-2025-07-11/"
  },
  {
    "text": "ICE handcuffs 71-year-old grandmother, a U.S. citizen, at San Diego immigration court … A grandmother planning to document ICE arrests at the San Diego courthouse instead became the story Tuesday after video of her own arrest began circulating.  —  An ICE agent accused the woman of pushing her.",
    "url": "https://www.nbcsandiego.com/news/local/ice-arrests-71-year-old-grandmother-a-us-citizen-at-san-diego-immigration-court/3865098/"
  },
  {
    "text": "The Paramount and Global Law Firm Settlements With Trump Don't Constitute Bribery  —  Bribery law requires an unambiguous intent to influence a public official's action through money or something else of value.  —  Meet The Authors … Last week, Paramount Global agreed to pay $16 million … ",
    "url": "https://www.lawfaremedia.org/article/the-paramount-and-global-law-firm-settlements-with-trump-don-t-constitute-bribery"
  },
  {
    "text": "Fired Justice Department official warns we are “driving straight into an abyss”  —  A 17-year former Justice Department official is warning of a wave of retribution inside the agency.  —  Patty Hartman, who served as a top public affairs specialist at the FBI and federal prosecutors' offices … ",
    "url": "https://www.cbsnews.com/news/fired-justice-department-official-we-are-falling-into-an-abyss/"
  },
  {
    "text": "State Department is firing over 1,300 employees under Trump administration plan  —  The State Department is firing more than 1,300 employees on Friday in line with a dramatic reorganization plan unveiled by the Trump administration earlier this year, a move that critics say will damage America's … ",
    "url": "https://apnews.com/article/layoffs-diplomats-state-department-trump-rubio-bfdb86767b7bd5b6570819d404a7782e"
  },
  {
    "text": "Grok 4 seems to consult Elon Musk to answer controversial questions  —  During xAI's launch of Grok 4 on Wednesday night, Elon Musk said — while live-streaming the event on his social media platform, X — that his AI company's ultimate goal was to develop a “maximally truth-seeking AI.”",
    "url": "https://techcrunch.com/2025/07/10/grok-4-seems-to-consult-elon-musk-to-answer-controversial-questions/"
  },
  {
    "text": "Justice Dept. Demands Patient Details From Trans Medicine Providers  —  Doctors and hospitals were subpoenaed for private information on gender-related care for minors, the latest move by the Trump administration to stop the treatments.  —  The Justice Department has issued subpoenas demanding … ",
    "url": "https://www.nytimes.com/2025/07/10/health/transgender-medicine-minors-trump-subpoena.html?unlocked_article_code=1.VU8.-jw7.Tu6IpFti68dH&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Trump administration moves away from abolishing FEMA  —  As the president heads to Texas to see the impact of last week's deadly flash floods, the White House has backed away from plans to abolish the agency, officials said.  —  For months, President Donald Trump and his homeland security secretary … ",
    "url": "https://www.washingtonpost.com/politics/2025/07/11/trump-fema-texas-floods/"
  },
  {
    "text": "State Department to Soon Begin Mass Layoffs  —  Secretary of State Marco Rubio's plan to downsize a “bloated” department had been on hold after a court ruling.  —  The State Department formally notified employees on Thursday that it was about to begin layoffs as part of a consolidation plan … ",
    "url": "https://www.nytimes.com/2025/07/10/us/politics/state-department-mass-layoffs.html"
  },
  {
    "text": "California surgical center staff demand to see warrant as ICE agents detain landscaper  —  Federal immigration agents seeking to detain a Honduran landscaper chased him into a Southern California surgical center and quickly found themselves in a tense standoff as clinic staff demanded to see identification and a warrant.",
    "url": "https://apnews.com/article/ice-arrest-california-surgery-center-c827038f1a40227dc05ab1c28b048035"
  },
  {
    "text": "The F.B.I. Is Using Polygraphs to Test Officials' Loyalty  —  Some senior officials who have taken the test have been asked whether they said anything negative about the F.B.I. director, Kash Patel.  — 1.2k  —  Typically, the F.B.I. has turned to polygraph tests to sniff out employees … ",
    "url": "https://www.nytimes.com/2025/07/10/us/politics/fbi-polygraph-kash-patel.html?unlocked_article_code=1.VU8.AnJL.I4rSD7g8Hmop&smid=url-share"
  },
  {
    "text": "Why You Should Fear a MAGAfied Fed  —  The next Fed chair will debase himself for Trump  —  Jerome Powell's term as chairman of the Federal Reserve Board will end in May 2026.  We don't know who Donald Trump will choose to replace him, but we already know that his successor will be a disaster.",
    "url": "https://paulkrugman.substack.com/p/why-you-should-fear-a-magafied-fed"
  },
  {
    "text": "White House reviews mass federal layoff plans, aims for swift action  —  The White House is scrutinizing layoff plans by federal agencies in an effort to limit further court challenges after the Supreme Court cleared the way for a sweeping downsizing of the government workforce … ",
    "url": "https://www.reuters.com/legal/litigation/white-house-reviews-mass-federal-layoff-plans-aims-swift-action-2025-07-11/"
  }
]