[
  {
    "text": "Trump Stepped on a Rake Yesterday—and He Knew It  —  DONALD TRUMP DOESN'T ADMIT TO MISTAKES, but he knew he made one Sunday morning.  —  For 96 minutes, at his first of his three rallies that day, Trump barely looked at his teleprompter.  He darkly obsessed about election fraud … ",
    "url": "https://www.thebulwark.com/p/trump-stepped-on-a-rake-lititz-rally-grievances"
  },
  {
    "text": "Trump is confident on election's eve: 'It's ours to lose'  —  Former President Trump thinks it's his election to lose as voters go the polls to elect a new president.  —  If he's right, he'll make history, becoming the first former president to lose office and then win it again since 1892.",
    "url": "https://thehill.com/homenews/campaign/4970776-trump-election-loss-challenge/"
  },
  {
    "text": "Trump Claims “Illegal Alien” Voting Is Rampant.  His Own Party Disagrees.  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up to receive our biggest stories as soon as they're published.  —  In public remarks, former President Donald Trump has repeatedly … ",
    "url": "https://www.propublica.org/article/trump-pennsylvania-rnc-training-video-undocumented-voting-election"
  },
  {
    "text": "Trump Isn't Perfect, but He's the Better Choice  —  If you like his policies but are put off by his tone or his excesses, consider the cost of the past four years.  —  Millions of people love Donald Trump, and millions hate him.  Each group will vote accordingly.",
    "url": "https://www.wsj.com/opinion/trump-isnt-perfect-but-hes-the-better-choice-says-nikki-haley-presidential-election-b343f6ab?st=VnD8bM&reflink=article_copyURL_share"
  },
  {
    "text": "Final GOP push in Pennsylvania focuses on imaginary voters over real ones  —  On the campaign's last weekend, volunteers for Kamala Harris focused on turnout across Scranton, Pa., while Donald Trump supporters focused on stopping “fraud.”  —  SCRANTON, Pa. — Two strikingly different messages … ",
    "url": "https://www.washingtonpost.com/politics/2024/11/04/final-gop-push-pennsylvania-focuses-imaginary-voters-over-real-ones/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzMwNjk2NDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzMyMDc4Nzk5LCJpYXQiOjE3MzA2OTY0MDAsImp0aSI6Ijc0ZTJkNTQ2LWUzMmYtNGYzMC1iNzY0LTY5NDFjNWZhNjE4MSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzExLzA0L2ZpbmFsLWdvcC1wdXNoLXBlbm5zeWx2YW5pYS1mb2N1c2VzLWltYWdpbmFyeS12b3RlcnMtb3Zlci1yZWFsLW9uZXMvIn0.v4TlVxO7xNuSKMfL405BEHwhTcamivBciBuqizTmUKY&itid=gfta"
  },
  {
    "text": "Elon Musk lawyer says $1 million voter giveaway winners are not random  —  Elon Musk's pro-Trump group does not choose the winners of its $1 million-a-day giveaway to registered voters at random, but instead picks people who would be good spokespeople for its agenda, a lawyer for the billionaire said on Monday.",
    "url": "https://www.reuters.com/legal/judge-weighs-challenge-elon-musks-1-million-voter-giveaway-2024-11-04/"
  },
  {
    "text": "Musk PAC tells Philadelphia judge the $1 million sweepstakes winners are not chosen by chance  —  A lawyer for Elon Musk 's political action committee told a judge in Philadelphia on Monday that so-called “winners” of his $1 million-a-day voter sweepstakes in swing states are not chosen … ",
    "url": "https://apnews.com/article/musk-million-sweepstakes-lottery-pennsylvania-krasner-4f683c48eb7dcc57f183e54ef16e7320"
  },
  {
    "text": "U.S. Presidential Contest, November 2024  —  Harris +4 Points Against Trump Nationally  —  In this final, national NPR/PBS News/Marist Poll before Election Day, Vice President Kamala Harris edges former President Donald Trump among likely voters nationally including those who are undecided yet leaning toward a candidate.",
    "url": "https://maristpoll.marist.edu/polls/u-s-presidential-contest-november-2024/"
  },
  {
    "text": "Harris leads Trump by 4 points in final PBS News/NPR/Marist poll; gender gap closes  —  Vice President Harris leads former President Trump by four percentage points, according to the final PBS News/NPR/Marist poll of the election.  —  In their national survey of likely voters … ",
    "url": "https://thehill.com/homenews/campaign/4970396-vice-president-harris-leads-trump/"
  },
  {
    "text": "Russia Suspected of Plotting to Send Incendiary Devices on U.S.-Bound Planes  —  Two devices that ignited in Europe, officials say, were part of a covert operation to put them on cargo or passenger aircraft  —  Western security officials say they believe that two incendiary devices … ",
    "url": "https://www.wsj.com/world/russia-plot-us-planes-incendiary-devices-de3b8c0a"
  },
  {
    "text": "NBC Gives Donald Trump Campaign Time During NASCAR Race, ‘Sunday Night Football’ in Response to Kamala Harris' ‘SNL’ Appearance  —  Trump appeared in spots that aired during Sunday's coverage of both sporting events on NBC, speaking directly to the camera.  —  NBC is giving former President … ",
    "url": "https://www.hollywoodreporter.com/tv/tv-news/nbc-donald-trump-campaign-free-ad-time-nascar-race-kamala-harris-snl-sketch-1236052709/"
  },
  {
    "text": "Editor Jon Ralston's 2024 Nevada election predictions  —  I should have done the mic drop in 2022.  —  Picking the winners in the top two races, both of which were agonizingly close, should have been the swan song, the ride off into the sunset on my oracular career.",
    "url": "https://thenevadaindependent.com/article/editor-jon-ralstons-2024-nevada-election-predictions"
  },
  {
    "text": "Illinois man arrested after punching election judge at polling location  —  Case follows numerous attacks on the voting process and threats of violence, even as officials say voting is safe  —  A man in Illinois punched an election judge at a polling location and was arrested on Sunday … ",
    "url": "https://www.theguardian.com/us-news/2024/nov/04/illinois-man-punch-election-judge-polls"
  },
  {
    "text": "Quincy Jones, music titan who worked with everyone from Frank Sinatra to Michael Jackson, dies at 91  —  Quincy Jones, the multi-talented music titan whose vast legacy ranged from producing Michael Jackson's historic “Thriller” album to writing prize-winning film and television scores … ",
    "url": "https://apnews.com/article/quincy-jones-dead-a9e31c7e39c448d8971519f47a22dd21"
  },
  {
    "text": "Trump's Crowds Are Dwindling as His Campaign Winds Down  —  The former president likes to talk about the attendance at his rallies, but empty seats and early exits have grown more common.  —  Donald J. Trump has spent parts of the last week of his campaign speaking in self-aggrandizing reverence … ",
    "url": "https://www.nytimes.com/2024/11/04/us/politics/trump-rally-crowds.html"
  },
  {
    "text": "Donald Trump Has Lost His Sh*t  —  I woke up Saturday morning, as you may have, to the sight of Donald Trump performing fellatio on a microphone (no, I'm not linking to it).  The clip that was making the rounds on X was 27 seconds.  As I scrolled down, I noticed a tweet from a MAGA person scolding … ",
    "url": "https://newrepublic.com/article/187847/donald-trump-fellatio-microphone-rally"
  },
  {
    "text": "New York Times Tech Workers Go on Strike  —  The Times Tech Guild represents more than 600 software developers and others who run the back-end systems behind The Times's digital operation.  —  The Times Tech Guild, which represents workers like software developers and data analysts at The New York Times … ",
    "url": "https://www.nytimes.com/2024/11/04/business/media/new-york-times-strike.html?unlocked_article_code=1.XU4.ue2o.uCBBzpk27eyh&smid=url-share"
  },
  {
    "text": "Mini Poop Statues Appear At D.C.'s Mysterious Turd Monument ‘Honoring’ Trump  —  “A monument isn't a real monument until cheap souvenirs are involved,” reads an email from the anonymous group behind the statue mocking Jan. 6, 2021, rioters.  —  LOADING  —  WASHINGTON — It's been two weeks since … ",
    "url": "https://www.huffpost.com/entry/poop-monument-trump-jan-6-insurrection_n_6728f0f2e4b05debb72b6f29"
  },
  {
    "text": "Two potential futures for Trump: The presidency or prison … - His legal team largely succeeded in delaying his criminal trials until after the election. … - And Justice Department policy prohibits the prosecution of a sitting president. … - On Nov. 12, a week after the election … ",
    "url": "https://www.axios.com/2024/11/04/trump-prison-sentencing-criminal-cases"
  },
  {
    "text": "Missouri sues DOJ in effort to block poll monitors  —  The Republican-led state of Missouri on Monday asked a judge to block the Justice Department from dispatching lawyers to St. Louis to monitor adherence to federal voting rights laws on Election Day.  —  Missouri's attorney general … ",
    "url": "https://thehill.com/regulation/court-battles/4970552-mo-missouri-lawsuit-doj-monitoring/"
  },
  {
    "text": "Meet the conservative women who are keeping their votes for Kamala Harris a secret  —  In political ads and campaign speeches, supporters of Vice President Harris have a message for Republican women: Your vote is private, and no one will know if you secretly vote for Harris.",
    "url": "https://www.npr.org/2024/11/03/nx-s1-5159978/republicans-for-harris-women-voters-secret-votes-quiet-voters-2024-election-trump"
  },
  {
    "text": "Algerian Boxer Imane Khelif Has XY Chromosomes And “Testicles” : French-Algerian Medical Report Admits  —  A shocking new development has emerged in the case of Algerian boxer Imane Khelif after a French journalist reportedly gained access to a damning medical report revealing Khelif has “testicles.”",
    "url": "https://reduxx.info/algerian-boxer-imane-khelif-has-xy-chromosomes-and-testicles-french-algerian-medical-report-admits/"
  },
  {
    "text": "Do you need photo ID to vote for the 2024 election?  Here's a state-by-state look at requirements  —  As Americans head to the polls on Election Day 2024 to choose between former President Donald Trump and Vice President Kamala Harris, voters should know the required ID, if any … ",
    "url": "https://www.cbsnews.com/news/voter-id-requirements-2024-election/"
  },
  {
    "text": "Harris has continued to improve with Black voters  —  It's still likely, though, that she'll underperform Joe Biden in 2020.  —  One of the challenges with polling is that it's often tricky to evaluate trends over time.  Different pollsters use different methodologies, weights and questions.",
    "url": "https://www.washingtonpost.com/politics/2024/11/04/harris-has-continued-improve-with-black-voters/"
  },
  {
    "text": "How to Get Through Election Day  —  Store up some enlightenment for the white-knuckle hours ahead.  —  This might be nostalgia talking, but I miss the old Election Nights, the kind we used to have before the stakes became so gruesomely high.  No one was warning of “existential consequences” … ",
    "url": "https://www.theatlantic.com/ideas/archive/2024/11/election-results-grief-minimization/680517/"
  }
]