[
  {
    "text": "Trump urges Garland to block release of Jack Smith's final report  —  His lawyers wrote to Attorney General Merrick Garland.  —  Donald Trump and two of his allies are making a last-minute push to block special counsel Jack Smith from issuing his final report on his two dismissed criminal cases against the president-elect.",
    "url": "https://www.politico.com/news/2025/01/06/trump-garland-jack-smith-filing-00196786"
  },
  {
    "text": "Trump's attorneys have reviewed draft of Smith's final special counsel report and want it blocked from public release  —  Lawyers for Donald Trump have reviewed a draft of special counsel Jack Smith's final report related to federal investigations into the president-elect and are threatening legal action … ",
    "url": "https://www.cnn.com/2025/01/06/politics/trump-smith-special-counsel-final-report/"
  },
  {
    "text": "Mark Carney Says He's Considering Running to Succeed Trudeau  —  Mark Carney, the former governor of the Bank of Canada and Bank of England, said he's considering entering the race to replace Justin Trudeau as Canada's prime minister.  —  Carney said he's “encouraged and honored by the support … ",
    "url": "https://www.bloomberg.com/news/articles/2025-01-07/mark-carney-says-he-s-considering-running-to-succeed-trudeau"
  },
  {
    "text": "Danish king changes coat of arms amid row with Trump over Greenland  —  Design shows intent to keep control of Faroe Islands and Greenland - which Trump says he would like the US to buy  —  The Danish king has shocked some historians by changing the royal coat of arms to more prominently feature Greenland … ",
    "url": "https://www.theguardian.com/world/2025/jan/06/danish-king-changes-coat-of-arms-in-apparent-rebuke-to-donald-trump"
  },
  {
    "text": "Donald Trump Jr. to visit Greenland as his father muses anew about the US taking control of it  —  Donald Trump Jr. is heading to Greenland, visiting the Danish territory as his father has continued to stoke seemingly far-fetched suggestions that the U.S. could take control of it.",
    "url": "https://apnews.com/article/donald-trump-junior-greenland-renewed-calls-us-control-7a235a1e756c48ffdb4a3158ced35514"
  },
  {
    "text": "10 corporations that kept their promises after January 6, 2021  —  After a violent mob stormed the Capitol building on January 6, 2021, hundreds of corporations took action to communicate to the public that democracy itself was more important than maximizing their political influence.",
    "url": "https://popular.info/p/10-corporations-that-kept-their-promises"
  },
  {
    "text": "Trump, Who Incited Insurrection, Accuses Biden Of Making Transition ‘As Difficult As Possible’  —  Four years after trying to stop the peaceful transfer of power, the president-elect claimed Biden is engaging in “lawfare such as has never been seen before.”  —  LOADING",
    "url": "https://www.huffpost.com/entry/trump-insurrection-accuses-biden-difficult-transition_n_677c2708e4b0da20062b766e"
  },
  {
    "text": "Rudy Giuliani is in contempt of court in $148 million defamation case  —  Rudy Giuliani was found in contempt of court Monday for failing to properly respond to requests for information as he turned over assets to satisfy a $148 million defamation judgment granted to two Georgia election workers.",
    "url": "https://apnews.com/article/rudy-giuliani-defamation-georgia-election-workers-5fe7787f42b4b89ef9d6df50bcde2efb"
  },
  {
    "text": "FACT SHEET: President Biden Establishes Chuckwalla and Sáttítla Highlands National Monuments in California  —  President Biden has now conserved more lands and waters than any President in history and has created the largest corridor of protected lands in the lower 48 states, the Moab to Mojave Conservation Corridor",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2025/01/07/fact-sheet-president-biden-establishes-chuckwalla-and-sattitla-highlands-national-monuments-in-california/"
  },
  {
    "text": "Trump's one-bill pronouncement settles nothing: ‘We still need a plan’  —  GOP senators are questioning the president-elect's commitment to “one powerful bill.”  —  If Donald Trump thought he was settling the GOP's most important strategy dispute, Senate Republicans are not getting the message.",
    "url": "https://www.politico.com/news/2025/01/07/trump-gop-confusion-reconciliation-plan-00196745"
  },
  {
    "text": "He Got Away With It  —  Donald Trump instigated a violent attack on the Capitol.  In two weeks, he'll be sworn in as president at the very same building  —  Aaron Thacker is a veteran of the wars in Afghanistan and Iraq.  He's served as military police, been posted at a detention facility … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-got-away-with-instigating-jan-6-capitol-attack-1235226493/"
  },
  {
    "text": "McDonald's is the latest company to roll back diversity goals  —  Four years after launching a push for more diversity in its ranks, McDonald's is ending some of its diversity practices, citing a U.S. Supreme Court's decision that outlawed affirmative action in college admissions.",
    "url": "https://apnews.com/article/mcdonalds-diversity-dei-goals-845d94cd46511341a43e98e057b0fa8e"
  },
  {
    "text": "U.S. in Talks to Swap Detained Americans in Afghanistan for Guantanamo Prisoner  —  Biden administration negotiates for the release of three Americans in exchange for an alleged Osama bin Laden associate—and seeks to avoid political blowback  —  WASHINGTON—The Biden administration … ",
    "url": "https://www.wsj.com/politics/national-security/u-s-in-talks-to-swap-detained-americans-in-afghanistan-for-guantanamo-prisoner-c2fe0df9"
  },
  {
    "text": "How Democrats should talk about Trump's corruption  —  “There's really a need for a whole new set of reforms,” Noah Bookbinder says.  —  ∙ Paid  —  Donald Trump is the most brazenly self-dealing president in history.  He's surrounded these days by an obscene cast of billionaires … ",
    "url": "https://www.publicnotice.co/p/noah-bookbinder-2025-interview-trump-corruption"
  },
  {
    "text": "Virginia Holds the First Elections of the New Trump Era  —  Voters are going to the polls on Tuesday in three special elections for the legislature that will serve as barometers of political energy for both parties.  —  The first special elections since President-elect Donald J. Trump won … ",
    "url": "https://www.nytimes.com/2025/01/07/us/politics/virginia-elections-legislature.html"
  },
  {
    "text": "Dana White, UFC CEO and Trump ally, to join Meta's board of directors  — Meta on Monday announced Dana White will join the company's board of directors.  — White said he'd “never been interested” in joining a company's board before Meta's offer.  — White is the CEO … ",
    "url": "https://www.businessinsider.com/ufc-ceo-dana-white-join-meta-board-directors-donald-trump-2025-1"
  },
  {
    "text": "Former French far-right leader Jean-Marie Le Pen dies aged 96  —  Jean-Marie Le Pen, founder of the far-right National Front party who tapped into working class concerns over immigration and globalisation, shaking up the French political establishment, has died, sources close to his daughter Marine Le Pen said on Tuesday.",
    "url": "https://www.reuters.com/world/europe/former-french-far-right-leader-jean-marie-le-pen-dies-aged-96-media-reports-2025-01-07/"
  },
  {
    "text": "Carter to Lie in State in Capitol Starting Tuesday  —  Former President Jimmy Carter, who once banned the playing of “Hail to the Chief,” will be honored with three days of elaborate ceremonies in the nation's capital.  —  Former President Jimmy Carter, who disavowed the trappings … ",
    "url": "https://www.nytimes.com/2025/01/07/us/politics/jimmy-carter-washington-events.html"
  },
  {
    "text": "Private equity to lobby Donald Trump for access to savers' retirement funds  —  Industry hopes incoming administration will open long-restricted private investments to individual investors  —  The private equity industry is preparing to lobby the incoming Donald Trump administration to give … ",
    "url": "https://www.ft.com/content/dddd1752-789a-40b6-9aa8-d7cf6f408c81"
  },
  {
    "text": "Elon Musk's Dishonest Demagogy on Grooming Gangs  —  Over a decade ago, a horrific sex trafficking scandal rocked Britain.  Starting in the late 1990s, thousands of mostly white girls in the postindustrial north of England, many from struggling families, were groomed by networks of mostly Pakistani men … ",
    "url": "https://www.nytimes.com/2025/01/06/opinion/elon-musk-britain-sex-trafficking.html"
  },
  {
    "text": "No, John Roberts, You Are Not a Civil Rights Hero  —  At the top of Page One of Chief Justice John Roberts' “Year End Report on the Federal Judiciary” is a photograph of a courthouse—the J. Waties Waring Judicial Center in Charleston, South Carolina.  The picture is part of Roberts' effort … ",
    "url": "https://slate.com/news-and-politics/2025/01/john-roberts-compares-extremist-judges-civil-rights-heroes.html"
  },
  {
    "text": "Trump says he'll replace National Archives leader  —  President-elect Trump said on Monday that he'll replace the National Archives and Records Administration (NARA) leader.  —  “We will [have a] new archivist,” Trump told conservative radio host Hugh Hewitt on his show.",
    "url": "https://thehill.com/homenews/administration/5070619-trump-says-hell-replace-national-archives-leader/"
  },
  {
    "text": "The Bogus Case Against Birthright Citizenship for the Children of Undocumented Immigrants  —  As Inauguration Day approaches, President-elect Donald Trump's promise of mass deportation at an unprecedented scale and the infighting within his own movement over H-1B visas have understandably taken center stage.",
    "url": "https://www.theunpopulist.net/p/the-bogus-case-against-birthright"
  }
]