[
  {
    "text": "Republicans Are Divided Over Iran.  Will Trump Pick a Side?  —  President Trump is trapped between the “America First” isolationists and others in his party who are cheering on Israel's strikes against Iran.  —  As Israel pummels Iran with waves of airstrikes, President Trump is navigating … ",
    "url": "https://www.nytimes.com/2025/06/13/us/politics/trump-republicans-iran-israel.html"
  },
  {
    "text": "How Israeli spies and pilots crippled an Iranian counterstrike  —  The U.S. and Israel were bracing for swift, fierce retaliation from Iran overnight.  — Thanks to intricately planned maneuvers by Israeli spies and pilots — and shock and disarray on the Iranian side — there was silence.",
    "url": "https://www.axios.com/2025/06/13/israel-mossad-attack-iran-response"
  },
  {
    "text": "Voice of America brings back Farsi-speaking staff amid Israel-Iran conflict  —  Several dozen sidelined Voice of America staffers have suddenly been called back to work as the Israel-Iran conflict escalates.  —  It is a dramatic turn of events for the American government-funded broadcasting system … ",
    "url": "https://cnn.com/2025/06/13/media/voice-of-america-iran-israel-trump"
  },
  {
    "text": "Israel-Iran live updates: US helps shoot down missiles heading toward Israel  —  At least 41 people in Israel were injured in retaliatory strikes by Iran.  —  LIVE  —  An explosion is seen during a missile attack in Tel Aviv, Israel, June 13, 2025.  —  Iran launched dozens … ",
    "url": "https://abcnews.go.com/International/live-updates/middle-east-live-updates-israel-launches-preemptive-strike/?id=122797400"
  },
  {
    "text": "Tucker Carlson Blasts Trump for Being ‘Complicit’ in Israel's Attack on Iran  —  CALLED OUT  —  The former Fox News star broke ranks to call on the president to put America first and drop Israel as an ally.  —  Conservative commentator Tucker Carlson made waves on Friday when he criticized … ",
    "url": "https://www.thedailybeast.com/tucker-carlson-blasts-trump-for-being-complicit-in-israels-attack-on-iran/"
  },
  {
    "text": "Voice of America brings back 50 staffers amid Iran-Israel conflict  —  The government-funded broadcaster has fired more than 500 and sidelined 800 more since March.  —  Voice of America told more than 50 employees to come back to work immediately Friday amid escalating military action between Iran and Israel.",
    "url": "https://www.washingtonpost.com/style/media/2025/06/13/voa-staff-iran-israel/"
  },
  {
    "text": "Exclusive: US Marines carry out first known detention of civilian in Los Angeles, video shows  —  Marines deployed to Los Angeles carried out the detention of a civilian on Friday, the U.S. military confirmed after being presented with Reuters images, in the first known detention … ",
    "url": "https://www.reuters.com/world/us/us-marines-carry-out-first-known-detention-civilian-los-angeles-video-shows-2025-06-13/"
  },
  {
    "text": "Trump Shifts Deportation Focus, Pausing Raids on Farms, Hotels and Eateries  —  The abrupt pivot on an issue at the heart of Mr. Trump's presidency suggested his broad immigration crackdown was hurting industries and constituencies he does not want to lose.  —  The Trump administration … ",
    "url": "https://www.nytimes.com/2025/06/13/us/politics/trump-ice-raids-farms-hotels.html?unlocked_article_code=1.O08.-3wV.Z_Osb56HSwak&smid=url-share"
  },
  {
    "text": "Trump Accidentally Reveals a Dark MAGA Truth—and Hands Dems an Opening  —  This week, President Donald Trump admitted on Truth Social that his mass deportations are hurting farmers and the economy.  Those removals are “taking very good, longtime workers away” from farms and hotels … ",
    "url": "https://newrepublic.com/article/196817/trump-deportations-house-republicans-memo"
  },
  {
    "text": "Extremist's Advice for ‘No Kings’ Protests: ‘Shoot a Couple, the Rest Will Go Home ’  —  Proud Boys and other far-right groups capitalize on planned demonstrations against Trump policies  —  “Shoot a couple, the rest will go home,” said a meme circulating on Telegram channels of groups affiliated with the far-right Proud Boys.",
    "url": "https://www.wsj.com/politics/policy/no-kings-protest-proud-boys-df066df0?st=93NAgP&reflink=desktopwebshare_permalink"
  },
  {
    "text": "‘Shoot a couple, the rest will go home’: Far-right groups are sharing scary messages ahead of ‘No Kings’ protests  —  Accounts associated with extremist groups are sharing detailed information about protest organizers, including names and where they work  —  Far-right groups … ",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/trump-protests-no-kings-far-right-b2769812.html"
  },
  {
    "text": "The “Delicate, Beautiful, Tiny” Fascism of Kristi Noem  —  The right thinks Noem is the victim of Sen. Padilla's assault.  But what about Rep. McIver?  —  As quickly as condemnation poured in over the forcible removal of Sen. Alex Padilla from a Department of Homeland Security press conference on Thursday … ",
    "url": "https://www.motherjones.com/politics/2025/06/kristi-noem-lamonica-mciver/"
  },
  {
    "text": "No Kings.  No Emperors.  No Thugs.  —  “If this is how the administration responds to a Senator with a question, you can only imagine what they're doing to farmworkers, cooks, and day laborers throughout the country.”  — Senator Alex Padilla  —  Happy Friday.",
    "url": "https://charliesykes.substack.com/p/no-kings-no-emperors-no-thugs"
  },
  {
    "text": "Trump admin refuses to release Mahmoud Khalil, despite judge's order  —  The Trump administration is keeping Columbia University alumnus Mahmoud Khalil detained, despite a judge's Wednesday order for his release.  —  Why it matters: The administration's tug-of-war with courts over Khalil represents … ",
    "url": "https://www.axios.com/2025/06/13/trump-admin-refuses-to-release-mahmoud-khalil-despite-judges-order"
  },
  {
    "text": "If you're not standing with LA right now, you're the problem  —  SFGATE columnist Drew Magary writes that it's obvious why Trump is targeting LA — and that's why it must be protected  —  It's protest season in America once again, which means that I and my fellow clear-headed … ",
    "url": "https://www.sfgate.com/la/article/if-youre-not-standing-with-la-youre-the-problem-20376646.php"
  },
  {
    "text": "Willkie Farr Partners, Unhappy With the Firm's Deal With Trump, Depart for Cooley  —  The departures are the latest fallout for firms that cut deals with President Trump to avoid executive orders.  —  Seven partners at Willkie Farr & Gallagher, a prominent law firm that cut a deal … ",
    "url": "https://www.nytimes.com/2025/06/13/business/willkie-farr-cooley-trump-deal.html"
  },
  {
    "text": "Trump's financial disclosures reveal tens of millions in income from guitars, bibles and watches with his name on them  —  Trump also reported income in 2024 of more than $57 million from World Liberty Financial, the Trump family crypto startup.  —  President Donald Trump continues … ",
    "url": "https://www.nbcnews.com/business/business-news/trumps-financial-disclosures-reveal-millions-income-guitars-bibles-wat-rcna212981"
  },
  {
    "text": "Kennedy has caused irreparable harm to vaccines  —  Anti-vaccine voices are now advising the CDC.  Here's how public health experts can respond.  —  Robert F. Kennedy Jr. this week put to rest any doubt about his intent to use his perch as health and human services secretary to advance his long-standing anti-vaccine agenda.",
    "url": "https://www.washingtonpost.com/opinions/2025/06/13/kennedy-vaccines-acip-committee/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ5Nzg3MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzUxMTY5NTk5LCJpYXQiOjE3NDk3ODcyMDAsImp0aSI6IjYwNjNjM2NlLTIwMzktNGJkOS05YWRiLTA5ZmM4ZGM1NWRkMiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9vcGluaW9ucy8yMDI1LzA2LzEzL2tlbm5lZHktdmFjY2luZXMtYWNpcC1jb21taXR0ZWUvIn0.lYX1c3fHBA0dbHfXPwt8AsmRK0A7w3tS0qLDlh2fgTc&itid=gfta"
  },
  {
    "text": "‘No Kings’ Protests, Citizen-Run ICE Trackers Trigger Intelligence Warnings  —  Army intelligence analysts are monitoring civilian-made ICE tracking tools, treating them as potential threats, as immigration protests spread nationwide.  —  As protests continue to swell across the United States … ",
    "url": "https://www.wired.com/story/no-kings-protests-citizen-run-ice-trackers-trigger-intelligence-warnings/"
  },
  {
    "text": "Stop Looking for Red Lines.  You no Longer Live in a Full Democracy  —  People want to know when we have crossed the line from one state of existence to another.  In watching our democracy die, many people are wondering when we will have crossed the line from life to death, from democracy to autocracy.",
    "url": "https://ryandenos.substack.com/p/stop-looking-for-red-lines-you-no"
  },
  {
    "text": "US Capitol Police arrest 60 people after veterans demonstration  —  The United States Capitol Police said they arrested 60 people Friday evening following a protest demonstration held by veterans.  —  Police said in a statement that they were “aware of a peaceful demonstration at the Supreme Court … ",
    "url": "https://www.washingtonexaminer.com/news/crime/3441993/us-capitol-police-protest-arrests-60-people-veterans-demonstration/"
  },
  {
    "text": "Judge halts Rubio's plan to lay off almost 2,000 State Dept. employees  —  The Trump administration has argued that the agency is bloated.  The court said that's for Congress to decide.",
    "url": "https://www.washingtonpost.com/national-security/2025/06/13/state-department-layoffs-rubio/"
  },
  {
    "text": "California pastor says apparent immigration agents waved a weapon at her in church parking lot  —  (RNS) — The Rev. Tanya Lopez says a masked man pointed a weapon at her while she was filming a group of unidentified men detaining a man in her church's parking lot.",
    "url": "https://religionnews.com/2025/06/13/in-church-confrontation-apparent-immigration-agents-wave-a-weapon-at-pastor/"
  },
  {
    "text": "Andrew Cuomo for Mayor?  Bill de Blasio Has Thoughts, None of Them Good.  —  In a candid interview, former Mayor Bill de Blasio strenuously argued that former Gov. Andrew M. Cuomo should not be elected to lead New York City: “He is a vindictive person,” Mr. de Blasio said.",
    "url": "https://www.nytimes.com/2025/06/13/nyregion/de-blasio-cuomo-nyc-mayor.html"
  },
  {
    "text": "REGARDING THE PROPOSED ACQUISITION OF UNITED STATES STEEL CORPORATION BY NIPPON STEEL CORPORATION  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, including section 721 of the Defense Production Act of 1950, as amended (section 721), 50 U.S.C. 4565, it is hereby ordered:",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/06/regarding-the-proposed-acquisition-of-the-united-states-steel-corporation-by-nippon-steel-corporation/"
  },
  {
    "text": "Hiding in the fields - farm workers fearing deportation stay in California's shadows  —  The women crouch down motionless, kneeling between endless rows of fruit bushes, almost hidden from view.  —  “Are you from ICE?” one of the women, a farm worker in a hat and purple bandana, asks us fearfully.",
    "url": "https://www.bbc.com/news/articles/c989zrggn14o"
  }
]