[
  {
    "text": "Lindsey Graham ‘threw Trump under the bus’ in Georgia case, book says  —  Senator told grand jury in election subversion case Trump would have believed martians stole the election, per Find Me the Votes  —  The South Carolina senator Lindsey Graham “threw Donald Trump under the bus” … ",
    "url": "https://www.theguardian.com/books/2024/jan/24/find-me-the-votes-book-graham-trump-georgia"
  },
  {
    "text": "The irony of Trump's angry reaction to his N.H. primary victory  —  So let me get this straight.  Donald Trump, of all people, is outraged by the very idea of a candidate presenting a second-place finish as a success?  —  For speechwriters, remarks after a primary victory are an easy lift.",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/irony-trumps-angry-reaction-nh-primary-victory-rcna135420"
  },
  {
    "text": "Why Republicans are (still) humiliating themselves for Trump  —  Even Nikki Haley will eventually have to kiss the ring. … With close to 90 percent of the vote counted early Wednesday morning evening, Donald Trump had beaten Nikki Haley by just over 10 points in the New Hampshire Republican presidential primary.",
    "url": "https://www.publicnotice.co/p/trump-wins-new-hampshire-primary-24-endorsements"
  },
  {
    "text": "Trump fumes in victory, Haley spins in defeat: Takeaways from New Hampshire … A disgusted Trump lashed out in response, dropping any pretense of civility as he ripped Haley as an “imposter” standing in his way.  —  3 takeaways from New Hampshire … - You wouldn't know it from the tone of her speech … ",
    "url": "https://www.axios.com/2024/01/24/new-hampshire-trump-haley-takeaways"
  },
  {
    "text": "After Trump's NH win, Biden gets the opponent he wants  —  The president's campaign gears up for a Trump rematch  —  MANCHESTER, New Hampshire — The general election has all but begun — and it's the race President Joe Biden's team wanted.  —  Former President Donald Trump's victory … ",
    "url": "https://www.politico.com/news/2024/01/24/trumps-win-biden-gets-opponent-he-wants-00137429"
  },
  {
    "text": "Trump Hammers Former Press Secretary McEnany After New Hampshire Win: 'Don't Need Any Advice From RINO'  —  The former president told his ex-employee to save her words of wisdom for Nikki Haley  —  JWPlayer  —  Donald Trump has no interest in advice from his former White House press secretary.",
    "url": "https://themessenger.com/politics/donald-trump-kayleigh-mcenany-advice-joe-biden"
  },
  {
    "text": "Playbook: 'That's the guy we will beat'  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  WITH ENDORSEMENTS LIKE THESE — “DeSantis sees ‘big warning signs’ for Trump's candidacy,” by Kimberly Leonard: “Speaking to conservative radio host Steve Deace … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/01/24/thats-the-guy-we-will-beat-00137517"
  },
  {
    "text": "DeSantis says Trump's victory in Iowa is ‘a huge warning’ for Republicans  —  Florida Gov. Ron DeSantis said Tuesday that Donald Trump's commanding victory in Iowa should be “a huge warning sign” for Republicans, comments critical of the former president's influence on the party that come … ",
    "url": "https://www.washingtonpost.com/politics/2024/01/24/ron-desantis-trump-iowa-victory/"
  },
  {
    "text": "The White House has its own pharmacy—and, boy, was it shady under Trump  —  It wasted $750K during the Trump years and freely handed out Ambien and Provigil.  —  The White House has its own pharmacy that, until recently, could perhaps best be described as a hot mess, according … ",
    "url": "https://arstechnica.com/science/2024/01/the-white-house-has-its-own-pharmacy-and-boy-was-it-shady-under-trump/"
  },
  {
    "text": "Nose wheel falls off Boeing 757 passenger jet awaiting takeoff  —  Delta Air Lines jet was due to depart from Atlanta airport and none of six crew or 184 passengers were hurt  —  A nose wheel fell off a Delta Air Lines Boeing 757 passenger jet and rolled away as the plane lined up for takeoff … ",
    "url": "https://www.theguardian.com/business/2024/jan/24/delta-air-lines-plane-nose-wheel-falls-off"
  },
  {
    "text": "Obamacare sign-ups hit record 21.3 million as Biden pushes his efforts to lower health care costs  —  A record 21.3 million Americans flocked to Affordable Care Act coverage for 2024, further cementing the law's place in the nation's health care landscape.  —  Nearly 5 million more people signed … ",
    "url": "https://www.cnn.com/2024/01/24/politics/obamacare-enrollment-record"
  },
  {
    "text": "Republicans Turn on Their Impeachment Chairman: ‘Parade of Embarrassments’ (Exclusive)  —  One Trump ally told The Messenger ‘the base is starting to get more and more frustrated’ with Comer  —  JWPlayer  —  House Republicans are increasingly disenchanted with Rep. James Comer, R-Ky. … ",
    "url": "https://themessenger.com/politics/republicans-turn-on-their-impeachment-chairman-a-parade-of-embarrassments-exclusive"
  },
  {
    "text": "What is Tucker Carlson doing in Canada?  —  Albertans turn out for Tucker Carlson MAGA tour.  —  CALGARY — A year ago, Tucker Carlson was calling on Americans to invade and “liberate” Canada from Prime Minister Justin Trudeau.  —  Now, he's getting the red carpet treatment in Alberta.",
    "url": "https://www.politico.com/news/2024/01/24/tucker-carlson-canada-00137380"
  },
  {
    "text": "Heaven knows I'm miserable now!  The Smiths star recoils at Trump using his song  —  Donald Trump isn't known for his love of classic British guitar band The Smiths — even though they have a song called “Bigmouth Strikes Again” that could be an ideal soundtrack for his planned return to the White House.",
    "url": "https://www.politico.eu/article/the-smiths-johnny-marr-donald-trump-rally-election/"
  },
  {
    "text": "United Auto Workers union expected to endorse Biden  —  Biden became the first sitting president to join a picket line when he appeared with striking UAW workers last year.  —  WASHINGTON — The United Auto Workers union is expected to endorse President Joe Biden as early as Wednesday … ",
    "url": "https://www.nbcnews.com/politics/2024-election/united-auto-workers-union-expected-endorse-biden-rcna135444"
  },
  {
    "text": "Towards a Fully Human Communication  —  Dear brothers and sisters!  —  The development of systems of artificial intelligence, to which I devoted my recent Message for the World Day of Peace, is radically affecting the world of information and communication, and through it, certain foundations of life in society.",
    "url": "https://www.vatican.va/content/francesco/en/messages/communications/documents/20240124-messaggio-comunicazioni-sociali.html"
  },
  {
    "text": "New Hampshire Democratic Primary Election Results  —  President Biden did not appear on the ballot in New Hampshire, so voters had to write in his name.  All write-in votes will appear in our results as “unprocessed” before they are identified for Mr. Biden or for another candidate.",
    "url": "https://www.nytimes.com/interactive/2024/01/23/us/elections/results-new-hampshire-democratic-primary.html"
  }
]