[
  {
    "text": "Supreme Court appears open to some presidential immunity for Trump, risking delays  —  Justices on the Supreme Court voiced skepticism Thursday to assertions from former President Trump's attorneys that presidential immunity could extend to an attempted coup or the assassination of a political rival … ",
    "url": "https://thehill.com/regulation/court-battles/4621749-supreme-court-justices-skeptical-of-sweeping-immunity-claims-by-trump/"
  },
  {
    "text": "Trump Is Getting What He Wants  —  The Supreme Court seems to be endorsing his views on presidential power.  —  At today's hearing on Donald Trump's claim of absolute immunity from criminal prosecution, the Republican-appointed Supreme Court majority appeared poised to give him what he most desires … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/04/supreme-court-poised-unshackle-second-trump-term/678190/"
  },
  {
    "text": "Live updates Supreme Court hears arguments in Trump immunity case  —  The Supreme Court is hearing oral arguments over the unprecedented question of whether Donald Trump is immune from prosecution for actions taken while in office to try to retain power after losing the 2020 election.",
    "url": "https://www.washingtonpost.com/politics/2024/04/25/supreme-court-trump-immunity-case/"
  },
  {
    "text": "High School AD Framed Principal With Fake AI-Generated Racist Audio: Cops  —  BRAVE NEW WORLD  —  The alleged ploy led police to arrest and charge Dazhon Darien with theft, stalking, disruption of school operations, and retaliation against a witness.  —  A Maryland high school athletic director … ",
    "url": "https://www.thedailybeast.com/high-school-athletic-director-framed-principal-with-fake-ai-generated-racist-audio"
  },
  {
    "text": "A Principal Was Removed, Faced Threats for Making Racist Comments.  There's Just One, Major Problem.  —  A black ex-employee allegedly used artificial intelligence to frame the white principal of a Baltimore-area high school as a racist and an antisemite, resulting in relentless threats … ",
    "url": "https://townhall.com/tipsheet/miacathell/2024/04/25/baltimore-high-school-hate-crime-hoax-n2638281"
  },
  {
    "text": "USC cancels ‘main stage’ commencement ceremony  —  USC announced Thursday that it is canceling its main May commencement ceremony, capping a dramatic series of moves that began last week after it informed valedictorian Asna Tabassum, who had been opposed by pro-Israel groups, that she would not be delivering the traditional speech.",
    "url": "https://www.latimes.com/california/story/2024-04-25/la-me-usc-commencement-canceled"
  },
  {
    "text": "DeSantis: Florida ‘will not comply’ with new Biden Title IX rules  —  Florida Gov. Ron DeSantis (R) said Thursday his state “will not comply” with recently unveiled changes to Title IX by the Biden administration.  —  “Florida rejects [President Biden's] attempt to rewrite Title IX,” … ",
    "url": "https://thehill.com/homenews/lgbtq/4621642-desantis-florida-will-not-comply-with-new-biden-title-ix-rules/"
  },
  {
    "text": "MAGA begins to panic: Trump may not make it to the ballot  —  Donald Trump.  —  Those two words spoken out loud can elicit an emotional response on par with the worst invectives, curses or insults you can conjure.  —  The man himself is capable of the same emotional outbursts under the proper stimuli.",
    "url": "https://www.salon.com/2024/04/25/maga-begins-to-panic-may-not-make-it-to-the-ballot/"
  },
  {
    "text": "US preparing to announce $6B in weapons contracts for Ukraine  —  The package could be finalized and announced as soon as Friday, and will include Patriot systems.  —  The U.S. is putting the finishing touches on one of its largest Ukraine military aid packages to date … ",
    "url": "https://www.politico.com/news/2024/04/25/us-weapons-contract-ukraine-00154450"
  },
  {
    "text": "Pluralistic: Antitrust is a labor issue (25 Apr 2024)  — Antitrust is a labor issue: Banning noncompetes is huge, but it's not all the FTC is doing!  — Hey look at this: Delights to delectate.  — This day in history: 2009, 2014, 2019, 2023  — Upcoming appearances: Where to find me.",
    "url": "https://pluralistic.net/2024/04/25/capri-v-tapestry/"
  },
  {
    "text": "In Historic Vote, the FCC Reasserts Its Authority to Protect the Open Internet and Safeguard Online Users  —  Contact: Timothy Karr, 201-533-8838  —  WASHINGTON — On Thursday, in a 3-2 vote, the Federal Communications Commission voted to restore Net Neutrality protections … ",
    "url": "https://www.freepress.net/news/press-releases/historic-fcc-vote-restore-net-neutrality-title-ii"
  },
  {
    "text": "Bill that could lead to prosecution of librarians advances in Alabama House  —  Lawmakers in Alabama passed legislation that could lead to the prosecution of librarians under the state's obscenity law for providing minors with “harmful” materials.  —  The bill, approved 72-28 by the Alabama House … ",
    "url": "https://thehill.com/homenews/state-watch/4622940-bill-that-could-lead-to-prosecution-of-librarians-advances-in-alabama-house/"
  },
  {
    "text": "CNN Poll: Few think Trump is being treated the same as other defendants  —  As the first criminal prosecution of a former American president began just 13% nationwide feel Donald Trump is being treated the same as other criminal defendants, a new CNN poll conducted by SSRS finds.",
    "url": "https://www.cnn.com/2024/04/25/politics/cnn-poll-trump-trial/"
  },
  {
    "text": "US State Department Arabic spokesperson resigns in opposition to Gaza policy  —  The Arabic language spokesperson of the U.S. State Department has resigned, citing her opposition to Washington's policy related to the war in Gaza, in at least the third resignation from the department over the issue.",
    "url": "https://www.reuters.com/world/uk/us-state-department-arabic-spokesperson-resigns-opposition-gaza-policy-2024-04-25/"
  },
  {
    "text": "Newsom celebrates storage milestone but confirms blackouts are not over yet  —  California officials on Thursday celebrated a milestone in their quest to achieve a 100-percent clean grid by 2045: the installation of more than 10,000 megawatts of battery storage.",
    "url": "https://thehill.com/policy/energy-environment/4622694-gavin-newsom-battery-storage-california-blackouts/"
  },
  {
    "text": "Speaker Mike Johnson stands tall against hateful campus mobs  —  .  —  House Speaker Mike Johnson (R-LA) gave new evidence yesterday of having “found his voice” in defense of Western values against the threats from both international and domestic bullies and mobs.",
    "url": "https://www.washingtonexaminer.com/opinion/2980157/speaker-mike-johnson-stands-tall-against-hateful-campus-mobs/"
  },
  {
    "text": "Gaza-based militants attack Israeli forces preparing for US pier  —  No U.S. equipment was damaged.  —  Gaza-based militants launched mortar rounds on Wednesday at Israeli forces making preparations for the U.S.-led effort to establish a new maritime aid route for Gaza, according to two U.S. officials.",
    "url": "https://www.politico.com/news/2024/04/25/gaza-terrorists-attack-israeli-pier-00154386"
  },
  {
    "text": "Tennessee lawmakers OK bill criminalizing adults who help minors receive gender-affirming care  —  Tennessee's GOP-controlled Statehouse on Thursday gave their final approval to legislation criminalizing adults who help minors receive gender-affirming care without parental consent … ",
    "url": "https://apnews.com/article/tennessee-transgender-care-ban-minors-b7b6700f6a54a3788ec0697f065281b6"
  },
  {
    "text": "Texas prosecutor appeals ruling that tossed Crystal Mason's voting fraud conviction  —  A Texas prosecutor on Thursday appealed a recent ruling that tossed Crystal Mason's illegal voting conviction from 2018, the Tarrant County district attorney's office said in a statement.",
    "url": "https://thehill.com/homenews/4622384-texas-prosecutor-appeals-ruling-that-tossed-crystal-masons-voting-fraud-conviction/"
  },
  {
    "text": "Exclusive: ByteDance prefers TikTok shutdown in US if legal options fail, sources say  —  TikTok owner ByteDance would prefer to shut down its loss-making app rather than sell it if the Chinese company exhausts all legal options to fight legislation to ban the platform from app stores in the U.S., four sources said.",
    "url": "https://www.reuters.com/technology/bytedance-prefers-tiktok-shutdown-us-if-legal-options-fail-sources-say-2024-04-25/"
  },
  {
    "text": "The GOP's “Election Integrity” Lawyer Was Just Indicted for Election Subversion  —  Christina Bobb tried to overturn the 2020 election, and Arizona just charged her for it.  —  The attorney running the Republican National Committee's “election integrity” effort has been criminally charged … ",
    "url": "https://www.motherjones.com/politics/2024/04/arizona-indictments-christina-bobb/"
  },
  {
    "text": "Senior Democrat calls for arrests of ‘leftwing fascists’ urging Gaza ceasefire  —  Congressman Adam Smith says ‘totalitarian’ protesters are ‘trying to silence anyone who dares to disagree with them’  —  Protesters calling for Israel to cease fire in its war with Hamas who have disrupted US public events … ",
    "url": "https://www.theguardian.com/us-news/2024/apr/25/israel-gaza-ceasefire-adam-smith"
  },
  {
    "text": "Justice Department fight with House GOP heats up over Biden recording … The letter from the DOJ on Thursday argues it has complied with the GOP's oversight of the Hur investigation.  — \"\"It seems that the more information you receive, the less satisfied you are, and the less justification … ",
    "url": "https://www.axios.com/2024/04/25/justice-department-hur-biden-recording"
  },
  {
    "text": "The US supreme court heard one of the most sadistic, extreme anti-abortion cases yet  —  Idaho's law requires doctors to treat pregnant women's health as disposable - and the loss of their lives as an acceptable risk  —  The risk of stating plainly what Idaho argued at the US supreme court … ",
    "url": "https://www.theguardian.com/commentisfree/2024/apr/25/supreme-court-idaho-anti-abortion-case"
  }
]