[
  {
    "text": "'It's a mess': Biden turns to family on his path forward after his disastrous debate  —  Democratic leaders have stood by the president as he faces questions about his ability to defeat Trump in November.  But privately, many are expressing concern.  —  WASHINGTON — President Joe Biden … ",
    "url": "https://www.nbcnews.com/politics/2024-election/biden-family-path-forward-disastrous-debate-mess-rcna159591"
  },
  {
    "text": "Two Joe Bidens: The night America saw the other one  —  The past 36 hours showcased two Joe Bidens: the veteran president rallying voters in a swing state, and an 81-year-old man struggling to string thoughts together in a debate. … - Internally, many aides have seen flashes of an absent-minded Biden … ",
    "url": "https://www.axios.com/2024/06/29/two-bidens-trump-debate-2024-president"
  },
  {
    "text": "The Reckoning of Joe Biden  —  For the President to insist on remaining the Democratic candidate would be an act not only of self-delusion but of national endangerment.  —  There is an immense bounty of bunk about the wisdom of age available to all of us who require it from time to time … ",
    "url": "https://www.newyorker.com/news/daily-comment/the-reckoning-of-joe-biden"
  },
  {
    "text": "‘Mental Masturbation’: Trump Camp Dismisses Dem Talk of Shoving Biden Aside  —  Trump camp is operating as if Biden will stay on the ticket.  —  JOE BIDEN HAS NO PLANS TO QUIT the presidential race.  Nor does Donald Trump's campaign expect him to.  —  Amid the fallout from the president's … ",
    "url": "https://www.thebulwark.com/p/trump-camp-dismisses-dem-talk-biden-debate"
  },
  {
    "text": "Biden campaign argues president dropping out would ‘lead to weeks of chaos’  —  The president has spent Friday and Saturday fundraising, vowing to fight harder.  —  President Joe Biden participates in the CNN Presidential Debate, June 27, 2024, in Atlanta.",
    "url": "https://abcnews.go.com/Politics/biden-campaign-argues-president-dropping-lead-weeks-chaos/story?id=111552401"
  },
  {
    "text": "48 Hours to Fix a 90-Minute Mess: Inside the Biden Camp's Post-Debate Frenzy  —  With countless calls and a rush of campaign events, the president's team began a damage-control effort to pressure and plead with anxious Democratic lawmakers, surrogates, activists and donors.",
    "url": "https://www.nytimes.com/2024/06/30/us/politics/biden-campaign-debate-scramble.html"
  },
  {
    "text": "Democrats: Stop Panicking  —  As a former Republican who spent decades pointing out flaws in the Democratic Party, I watch the current Democratic panic over President Biden's debate performance with a mix of bafflement and nostalgia.  —  It's baffling that so many Democrats are failing … ",
    "url": "https://www.nytimes.com/2024/06/29/opinion/democrats-panic-joe-biden.html"
  },
  {
    "text": "Let's Ask Trump To Leave The Race  —  Have you read the post debate hot takes?  Here's the Editorial Board of The New York Times: … That sentiment was echoed across the opinion pages.  Here's a screenshot from Friday night.  —  Other respected commentators, many of them friends … ",
    "url": "https://thelefthook.substack.com/p/lets-ask-trump-to-leave-the-race"
  },
  {
    "text": "To serve his country, Donald Trump should leave the raceBoard  —  President Joe Biden's debate performance was a disaster.  His disjointed responses and dazed look sparked calls for him to drop out of the presidential race.But lost in the hand wringing was Donald Trump's usual bombastic litany of lies … ",
    "url": "https://www.inquirer.com/opinion/editorials/first-presidential-debate-joe-biden-donald-trump-withdraw-20240629.html"
  },
  {
    "text": "Want to Be Trump's Running Mate?  Make Sure He Knows About Your Donors.  —  Vice-presidential hopefuls are posturing as part of a bid to highlight their ties to the rich.  —  During his 2016 campaign, Donald J. Trump orchestrated a takeover of the Republican Party in part … ",
    "url": "https://www.nytimes.com/2024/06/30/us/politics/trump-vice-president-donors.html"
  },
  {
    "text": "How will Louisiana's new Ten Commandments classroom requirement be funded and enforced?  —  Even as a legal challenge is already underway over a new Louisiana law requiring the Ten Commandments to be displayed in classrooms, the details of how the mandate will be implemented and enforced remain murky.",
    "url": "https://apnews.com/article/louisiana-ten-commandments-class-school-25207ca74c0656563c171c1c8ed921b4"
  },
  {
    "text": "‘Massive power grab’ by SCOTUS ‘throws out decades of established law’  —  The Supreme Court on Friday overturned the 40-year-old legal principle known as the Chevron doctrine, which required courts to defer to federal agencies' interpretations of ambiguous laws they administer.",
    "url": "https://www.msnbc.com/ali-velshi/watch/-massive-power-grab-by-scotus-throws-out-decades-of-established-law-213950021505"
  },
  {
    "text": "French Far Right Holds Strong Lead Ahead of Vote: What to Watch  — First round of legislative elections is being held Sunday  — Marine Le Pen's National Rally is well ahead in polls  —  President Emmanuel Macron's decision three weeks ago to call snap elections overturned any semblance … ",
    "url": "https://www.bloomberg.com/news/articles/2024-06-30/french-far-right-holds-strong-lead-ahead-of-vote-what-to-watch"
  },
  {
    "text": "‘So bad’: Bob Woodward calls Biden's debate performance political h-bomb  —  WASHINGTON − Bob Woodward knows a little bit about political scandals that could bring down the president.  —  The famous journalist, who helped break the 1972 Watergate scandal, told MSNBC Friday … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/06/29/bob-woodward-watergate-biden/74255601007/"
  }
]