[
  {
    "text": "Newark mayor: ICE raided business without a warrant, detained U.S. citizens  —  U.S. Immigration and Customs Enforcement agents carried out a raid on a Newark business Thursday, detaining non-citizens and citizens alike, according to Mayor Ras J. Baraka.  —  The incident, which could not immediately … ",
    "url": "https://www.nj.com/essex/2025/01/newark-mayor-ice-raided-business-without-a-warrant-detained-us-citizens.html"
  },
  {
    "text": "MAYOR RAS J. BARAKA'S STATEMENT ON ICE RAID ON NEWARK BUSINESS ESTABLISHMENT  —  “Today, U.S. Immigration and Customs Enforcement (ICE) agents raided a local establishment in the City of Newark, detaining undocumented residents as well as citizens, without producing a warrant.",
    "url": "https://www.newarknj.gov/news/mayor-ras-j-barakas-statement-on-ice-raid-on-newark-business-establishment"
  },
  {
    "text": "The Border Debate Is Over.  Dems Lost.  —  ONE OF MY FAVORITE nuggets about immigration (yes, I have favorite immigration trivia) is about the timeline for the creation of the Department of Homeland Security (DHS), Immigration and Customs Enforcement (ICE), and Customs and Border Protection (CBP).",
    "url": "https://www.thebulwark.com/p/democrats-lost-border-debate-immigration-trump-miller"
  },
  {
    "text": "Trump immigration raids alarm cities, but ICE arrests fewer than in 2017  —  The numbers could indicate the Trump administration's show of force has so far outpaced the government's ability to quickly deport more migrants.  —  The Trump administration circulated photos Friday showing U.S … ",
    "url": "https://www.washingtonpost.com/immigration/2025/01/24/immigration-raids-deportations-trump-ice/"
  },
  {
    "text": "Trump has pulled Fauci's security detail, source says  —  President Donald Trump has terminated Dr. Anthony Fauci's security detail that was being provided and paid for by the National Institutes of Health, a source familiar with the situation tells CNN.  It was pulled on Thursday night.",
    "url": "https://www.cnn.com/2025/01/24/politics/anthony-fauci-security-detail-trump/"
  },
  {
    "text": "Trump returns — and so does his astounding ignorance  —  If you feel off-kilter, you're in good company.  The president seems downright bewildered.  —  “I think we're going to do things that people would be shocked at,” President Donald Trump declared on his second day in office.",
    "url": "https://www.washingtonpost.com/opinions/2025/01/24/trump-first-week-executive-orders-actions/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM3Njk0ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM5MDc3MTk5LCJpYXQiOjE3Mzc2OTQ4MDAsImp0aSI6IjIyZjFmMWE1LTQxODItNGI0NC05OTAwLWE3NWVmOTc2YTgzNSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9vcGluaW9ucy8yMDI1LzAxLzI0L3RydW1wLWZpcnN0LXdlZWstZXhlY3V0aXZlLW9yZGVycy1hY3Rpb25zLyJ9.xrsS0Gz-9j51U1tG3NRSGQlzjZgZJMuHGufcCB7prd0&itid=gfta"
  },
  {
    "text": "Trump Says States Should Manage Disasters.  Former FEMA Leaders Agree.  —  “I'd rather see the states take care of their own problems,” the president said.  Federal emergency managers from both parties have made the same argument.  —  President Trump plans to tour damage on Friday … ",
    "url": "https://www.nytimes.com/2025/01/24/climate/trump-says-states-should-manage-disasters-former-fema-leaders-agree.html"
  },
  {
    "text": "Experts saw Samoa's plunging vaccination rates as a crisis.  RFK Jr. saw an opportunity.  —  New details show how Robert F. Kennedy Jr., then chair of an anti-vaccine group and now Trump's pick for health secretary, sought to exploit a deadly vaccine accident.",
    "url": "https://www.nbcnews.com/news/us-news/rfk-jr-samoa-measles-vaccine-crisis-rcna187787"
  },
  {
    "text": "RFK Jr.'s allies have a plan to upend childhood vaccination  —  Robert F. Kennedy's Jr. advisers are sparring over how far he should go on vaccines as health secretary.  —  Top advisers to Robert F. Kennedy Jr. are battling over how aggressively to target vaccines during his first days … ",
    "url": "https://www.politico.com/news/2025/01/24/rfk-jr-allies-child-vaccinations-00200364"
  },
  {
    "text": "Musk Tells a ‘Joke’  —  The board and shareholders of Costco overwhelmingly rejected a proposal for the big-box giant to revise its diversity, equity, and inclusion practices.  You might call it the first act of wholesale resistance.  —  Happy Friday.  —  Stick to Rockets  —  by William Kristol",
    "url": "https://www.thebulwark.com/p/musk-tells-a-joke"
  },
  {
    "text": "Elon Musk doesn't deserve the benefit of the doubt  —  Since Donald Trump's rise to power, some liberals have developed a bad habit of seeing secret Nazi imagery everywhere on the right.  —  Be it Laura Ingraham allegedly sieg-heiling at the 2016 Republican National Convention … ",
    "url": "https://www.vox.com/politics/396535/elon-musk-nazi-salute-trump-inauguration"
  },
  {
    "text": "Trump's Plan to Crush the Academic Left  —  Last year, Chris Rufo, the influential right-wing strategist who spearheaded the campaign against diversity, equity and inclusion, or D.E.I., initiatives, told me about his ambitions for a second Trump presidency.  He hoped, he said … ",
    "url": "https://www.nytimes.com/2025/01/24/opinion/trump-dei-education-harvard.html?unlocked_article_code=1.rk4.tqup.HyOsQkRyhSgl&smid=url-share"
  },
  {
    "text": "Paul Krugman on Leaving the New York Times  —  The paper wanted to take away his newsletter or make him write less frequently, he says.  —  For two and a half decades, Paul Krugman's columns in the New York Times were beacons of intelligence and common sense.",
    "url": "https://www.cjr.org/analysis/paul-krugman-leaving-new-york-times-heavy-hand-editing-less-frequent-columns-newsletter.php"
  },
  {
    "text": "New GOP bill would let Trump (but not Obama) run for a third term  —  Rep. Andy Ogles' bill to amend the Constitution and empower Donald Trump to seek a third term will inevitably fail.  That doesn't mean it's irrelevant.  —  About a week after Donald Trump was elected to a second term … ",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/new-gop-bill-let-trump-not-obama-run-third-term-rcna189099"
  },
  {
    "text": "Judge bars Rhodes, other Oath Keepers from entering DC without court permission  —  A federal judge on Friday barred Oath Keepers founder Stewart Rhodes and seven other members of the right-wing extremist group from entering Washington, D.C., without the court's permission … ",
    "url": "https://thehill.com/regulation/court-battles/5104820-federal-judge-bars-oath-keepers-washington-dc-capitol/"
  },
  {
    "text": "There Is No Resistance  —  To see how far the lines of normal have moved since President Donald Trump freed the January 6ers, briefly return to the closing days of the 2024 presidential campaign.  At the time, a hot issue was whether Trump harbored fascist tendencies, as some of his former aides alleged.",
    "url": "https://www.theatlantic.com/politics/archive/2025/01/republicans-rationalization-trump-pardons/681433/"
  },
  {
    "text": "Dems Worry Sen. Whitehouse Considering Vote for RFK Jr  —  Wanted to share some information on the RFK Jr. nomination before the Senate.  —  It probably won't surprise you that RFK Jr., along with Tulsi Gabbard, are among the few Trump nominees who might actually not get confirmed.",
    "url": "https://talkingpointsmemo.com/edblog/dems-worry-sen-whitehouse-considering-vote-for-rfk-jr"
  },
  {
    "text": "Trump enlists attorney general to investigate Biden administration  —  President has thrown weight of justice department behind two politically charged reviews into his personal grievances  —  Donald Trump has tasked the attorney general in two executive orders to conduct far-reaching investigations … ",
    "url": "https://www.theguardian.com/us-news/2025/jan/24/trump-executive-orders-justice-department"
  },
  {
    "text": "LA Times owner on spiking Harris endorsement: 'I knew I'd get pushback'  —  The billionaire owner of the Los Angeles Times in a new interview defended a decision not to endorse a presidential candidate in last year's election between President Trump and former Vice President Kamala Harris.",
    "url": "https://thehill.com/homenews/media/5105248-los-angeles-times-owner-endorsement/"
  },
  {
    "text": "Kathy versus crime  —  Presented by With help from Cris Seda Chabrier  —  Gov. Kathy Hochul is funding the police — and her $252 billion budget includes a push to recruit more cops as she tries to address Republican attacks over crime.  —  She wants to raise the mandatory retirement age … ",
    "url": "https://www.politico.com/newsletters/new-york-playbook/2025/01/24/kathy-versus-crime-00200424"
  },
  {
    "text": "Nearly 150 congressional Democrats sign on to resolution condemning Paris withdrawal  —  A majority of the House Democratic caucus has signed on to a resolution opposing President Trump's move to withdraw the U.S. from the Paris Climate Agreement for the second time.",
    "url": "https://thehill.com/policy/energy-environment/5105075-democrats-resolution-trump-paris-climate-agreement-withdrawal/"
  },
  {
    "text": "Two Words and a World of Trouble  —  Let me tell you a story about clowns evolving into velociraptors.  —  ∙ Paid  —  Bill Kristol sat in for Sarah on the Secret Pod today and it was dark.  Just a warning.  If you're not in good head-space to begin with today, maybe skip this episode?",
    "url": "https://www.thebulwark.com/p/two-words-and-a-world-of-trouble"
  },
  {
    "text": "Lutnick Lists 800 Firms in Complex Billionaire Ethics Filing  — Cantor CEO says he'll divest a swath of business stakes  — He faces a US Senate confirmation hearing on Jan. 29  —  Howard Lutnick, President Donald Trump's nominee to lead the Commerce Department … ",
    "url": "https://www.bloomberg.com/news/articles/2025-01-24/lutnick-discloses-800-firms-in-complex-billionaire-ethics-filing"
  }
]