[
  {
    "text": "Donald Trump poses the biggest danger to the world in 2024  —  What his victory in America's election would mean  —  Enjoy more audio and podcasts on iOS or Android.  —  A shadow looms over the world.  In this week's edition we publish The World Ahead 2024, our 38th annual predictive guide … ",
    "url": "https://www.economist.com/leaders/2023/11/16/donald-trump-poses-the-biggest-danger-to-the-world-in-2024"
  },
  {
    "text": "The Economist names Trump “biggest danger” for 2024  —  The Economist says former President Trump presents the world's “biggest danger” in 2024. … - “China and its friends would rejoice over the evidence that American democracy is dysfunctional” and Beijing “could easily miscalculate over Taiwan, with catastrophic consequences.”",
    "url": "https://www.axios.com/2023/11/16/economist-trump-2024-presidential"
  },
  {
    "text": "Playbook: The case for triangulation on immigration  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  THE SPIRIT OF '68 — “Violent clash at DNC headquarters sparks concern over convention security,” by Shia Kapos: “A pro-Palestinian protest … ",
    "url": "https://www.politico.com/newsletters/playbook/2023/11/17/the-case-for-triangulation-on-immigration-00127765"
  },
  {
    "text": "X Races to Contain Damage After Elon Musk Endorses Antisemitic Post  —  IBM, a major advertiser on X, has pulled its spending from the social media platform whose employees are grappling with what to tell its other advertisers, according to internal messages.",
    "url": "https://www.nytimes.com/2023/11/16/technology/elon-musk-endorses-antisemitic-post-ibm.html"
  },
  {
    "text": "No more ads on Elon's X, EU Commission tells staff  —  Ads on Musk-owned social media site risk causing ‘reputational damage’ to the EU, its executive says in internal note.  —  The European Commission has decided to stop advertising on social media platform X, owned by Elon Musk, over … ",
    "url": "https://www.politico.eu/article/no-more-ads-elon-musk-x-twitter-european-commission-tell-staff/"
  },
  {
    "text": "House Ethics chairman introduces resolution to expel George Santos from Congress  —  House Ethics Chairman Michael Guest, a Mississippi Republican, introduced a resolution Friday to expel GOP Rep. George Santos of New York from Congress, one day after the Ethics Committee released a damning report on its investigation into Santos.",
    "url": "https://www.cnn.com/2023/11/17/politics/santos-expulsion-resolution-introduced/"
  },
  {
    "text": "George Santos faces new motion to expel him from Congress  —  Rep. George Santos (R-N.Y.) is facing a new motion to expel him from Congress, one day after the House Ethics Committee released a scathing report that found “substantial evidence” Santos had knowingly violated ethics guidelines, House rules and criminal laws.",
    "url": "https://www.washingtonpost.com/politics/2023/11/17/george-santos-motion-expel/"
  },
  {
    "text": "Donald Trump Posts Tirade Against Judge, Court Clerk Hours After Gag Order Paused  —  The former president called a court staffer a “Trump Hating Clerk,” who is “politically biased and out of control.”  —  LOADING  —  Former President Donald Trump went on a tirade against the judge overseeing … ",
    "url": "https://www.huffpost.com/entry/trump-attacks-engoron-clerk-new-york-trial_n_6556c859e4b0e47670139c4f"
  },
  {
    "text": "CNN Airs New Tape of Trump Discussing Capitol Trip on Jan. 6  —  WON'T BACK DOWN  —  In a taped interview for ABC News reporter Jonathan Karl's book, Tired of Winning, former President Donald Trump said that if he had been allowed to go to the Capitol during the Jan. 6 insurrection … ",
    "url": "https://www.thedailybeast.com/cnn-airs-new-tape-of-trump-discussing-capitol-trip-on-jan-6"
  },
  {
    "text": "Scoop: Christie tells donors he still can beat Trump … - The former New Jersey governor's appeal in the Granite State has made it difficult for any other non-Trump candidates to get within striking distance of Trump in the state — namely former South Carolina Gov. Nikki Haley, who has been rising in polls lately.",
    "url": "https://www.axios.com/2023/11/17/christie-trump-primaries-2024"
  },
  {
    "text": "Trump leads big in New Hampshire as Haley rises, Post-Monmouth poll finds  —  Two months before the Jan. 23 primary, 46 percent of potential primary voters in the state support Trump while 18 percent support Haley  —  Built on a foundation of robust enthusiasm for his candidacy … ",
    "url": "https://www.washingtonpost.com/politics/2023/11/17/post-monmouth-new-hampshire-poll/"
  },
  {
    "text": "Senate Republicans get ready to roll Tuberville on military holds  —  Republican senators are laying the groundwork to vote before Christmas on a Democratic-drafted resolution to circumvent the blockade that Alabama Sen. Tommy Tuberville (R) has placed in front of more than 400 military nominees.",
    "url": "https://thehill.com/homenews/senate/4314139-senate-republicans-get-ready-to-roll-tuberville-on-military-holds/"
  },
  {
    "text": "The hidden biases at play in the U.S. Senate  —  People of color get significantly less representation than White voters.  And that's not the only way the Senate is skewed.  —  The United States Senate was never designed to represent all people equally.  But over recent decades … ",
    "url": "https://www.washingtonpost.com/politics/interactive/2023/us-senate-bias-white-rural-voters/"
  },
  {
    "text": "Trump classified documents trial running about four months behind schedule  —  Judge Aileen Cannon put off setting deadline for Trump to submit notice about what classified information he intends to use at trial  —  Donald Trump's trial on charges that he retained classified documents … ",
    "url": "https://www.theguardian.com/us-news/2023/nov/17/trump-classified-documents-trial-delay"
  },
  {
    "text": "List of Open Title VI Shared Ancestry Investigations  —  Protecting Students > Race, Color, or National Origin Discrimination > Issues >>  —  As a public service, the Office for Civil Rights (OCR) publishes this list of elementary-secondary and post-secondary institutions … ",
    "url": "https://www2.ed.gov/about/offices/list/ocr/sharedancestry-list.html"
  },
  {
    "text": "‘No Labels’ Tax Forms Reveal Execs Cashing In on 2024 Hype  —  According to tax documents obtained by The Daily Beast, the centrist group plotting a 2024 challenge is raising lots of dough, padding its leaders' paychecks. … No Labels, No Worries  —  As the centrist group No Labels gears … ",
    "url": "https://www.thedailybeast.com/no-labels-tax-forms-reveal-execs-cashing-in-on-centrist-2024-third-party-campaign-hype"
  },
  {
    "text": "Israel-Hamas War  —  Israeli Army Takes Journalists on Controlled Visit to Gaza Hospital … The Israeli Army escorts Times journalists to Al-Shifa, a focus of its invasion.  —  Almost 48 hours after entering Gaza's largest medical complex, the Israeli military escorted journalists … ",
    "url": "https://www.nytimes.com/live/2023/11/17/world/israel-hamas-gaza-war-news"
  },
  {
    "text": "Failure at the fence: How Israel's vaunted ‘Iron Wall’ crumbled  —  In December 2021, Israel's military said a high-tech upgrade to the barrier that had long surrounded the Gaza Strip would protect nearby Israeli residents from the threat of violence from militants.",
    "url": "https://www.washingtonpost.com/investigations/2023/11/17/how-hamas-breached-israel-iron-wall/"
  },
  {
    "text": "Study: 58% of world's richest companies quietly lobby against climate policies  —  Pledges by the world's largest corporations to fight climate change frequently do not align with their lobbying efforts, with more than half of companies at risk of engaging in misleading practices known as … ",
    "url": "https://www.upi.com/Top_News/World-News/2023/11/17/net-zero-greenwashing-58-large-corporations-lobby-against-climate-efforts/7141700219198/"
  },
  {
    "text": "Argentina on a knife-edge as presidential election offers clashing visions of the future  —  Argentine voters are angry and afraid.  Which is stronger will tip the balance of the South American country's presidential election on Sunday and may reshape its diplomatic ties, economic future, and the wider region's political fault lines.",
    "url": "https://www.reuters.com/world/americas/argentina-knife-edge-presidential-election-offers-clashing-visions-future-2023-11-17/"
  },
  {
    "text": "DeSantis' State Guard contracts with combat-training company  —  Eddie Gallagher, a former U.S. Navy SEAL accused of war crimes, is listed as an instructor with a company hired by Florida to train its civilian military force.  —  To recruit and train members of a civilian military force under his control … ",
    "url": "https://www.tampabay.com/news/florida-politics/2023/11/17/desantis-state-guard-stronghold-sof-solutions-eddie-gallagher-combat-training/"
  },
  {
    "text": "Secret source informed prosecutors in Michigan voting machine probe  —  With an MLive.com subscription, you can gift 10 Subscriber Exclusive articles per month to anyone, including non-subscribers.  —  Already a subscriber? … Disclaimer  —  Use of and/or registration on any portion … ",
    "url": "https://www.mlive.com/politics/2023/11/secret-source-informed-prosecutors-in-michigan-voting-machine-probe.html"
  },
  {
    "text": "Trump Crosses a Crucial Line  —  But Americans can still choose a better path.  —  The former president, after years of espousing authoritarian beliefs, has fully embraced the language of fascism.  But Americans—even those who have supported him—can still refuse to follow him deeper into darkness.",
    "url": "https://www.theatlantic.com/newsletters/archive/2023/11/trump-crosses-a-crucial-line/676031/"
  },
  {
    "text": "Florida sued over ban on pro-Palestinian student groups  —  “This attack on free speech is dangerous,” said Howard Simon, interim executive director of ACLU of Florida.  —  The American Civil Liberties Union challenged Florida's ban on pro-Palestinian university groups … ",
    "url": "https://www.nbcnews.com/news/us-news/florida-sued-ban-palestinian-student-groups-rcna125652"
  }
]