[
  {
    "text": "Carville: Democrats have to add states, expand Supreme Court to ‘save democracy’  —  Veteran Democratic strategist James Carville on Thursday suggested Democrats should add two states to the country and expand the Supreme Court in order to “save democracy.”  —  “They are just going to have … ",
    "url": "https://thehill.com/homenews/administration/5442239-carville-democrats-states-supreme-court/"
  },
  {
    "text": "A Legal Standoff in the Lone Star State  —  Can Gov. Abbott compel their return or remove them from office?  And what the heck is a “quo warranto” action, anyway?  —  annabower.bsky.social  —  Meet The Authors … A bitter political and legal battle is unfolding in Texas.",
    "url": "https://www.lawfaremedia.org/article/a-legal-standoff-in-the-lone-star-state"
  },
  {
    "text": "Cornyn Says F.B.I. Will Help Find Texas Lawmakers Who Left State  —  The senator said the agency had agreed to help locate Democratic state legislators who departed to try to block a vote on congressional maps.  Democrats said federal law enforcement was being misused.  — 1.2k",
    "url": "https://www.nytimes.com/2025/08/07/us/politics/texas-redistricting-cornyn-fbi.html?unlocked_article_code=1.cU8.MnkU.auC8JsTMtbiD&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Senior Agent Who Helped Oversee F.B.I.'s Response to Jan. 6 Is Fired  —  Deepening its purge, the bureau forced out Steven Jensen, whose ascent had angered Trump supporters, and Brian Driscoll, the acting director in the early chaotic days of the administration.",
    "url": "https://www.nytimes.com/2025/08/07/us/politics/trump-fbi.html?unlocked_article_code=1.cU8.XIqk.xUQAcvIqKWIm&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Netanyahu Says Israel Wants to Take Military Control of All of Gaza  —  Benjamin Netanyahu, the Israeli prime minister, made the remarks ahead of a security cabinet meeting, although military leaders are wary of expanding operations in the territory.  —  Prime Minister Benjamin Netanyahu … ",
    "url": "https://www.nytimes.com/2025/08/07/world/middleeast/israel-gaza-military-offensive.html?unlocked_article_code=1.cU8.XhnV.FDp0G3kdxrtX&smid=url-share"
  },
  {
    "text": "US Air Force to deny retirement pay to transgender service members being separated from the service  —  The U.S. Air Force said Thursday it would deny all transgender service members who have served between 15 and 18 years the option to retire early and would instead separate them without retirement benefits.",
    "url": "https://apnews.com/article/air-force-transgender-no-early-retirement-e6a4da806f2cc2bdc05f49438cbd26fd"
  },
  {
    "text": "Exclusive: US Air Force denies early retirement for group of transgender service members  —  The U.S. Air Force is denying early retirement to all transgender service members with between 15 and 18 years of military service, opting instead to force them out with no retirement benefits, according to a memo seen by Reuters.",
    "url": "https://www.reuters.com/legal/government/us-air-force-denies-early-retirement-group-transgender-service-members-2025-08-07/"
  },
  {
    "text": "Judge orders temporary halt to construction at Florida's ‘Alligator Alcatraz’ detention center  —  A federal judge on Thursday ordered a temporary halt to construction at an immigration detention center — built in the middle of the Florida Everglades and dubbed “Alligator Alcatraz” … ",
    "url": "https://apnews.com/article/florida-detention-alligator-alcatraz-08aac166ad5fa5dfbd33a00f6be2b979"
  },
  {
    "text": "Improving Oversight of Federal Grantmaking  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, and to improve the process of Federal grantmaking while ending offensive waste of tax dollars, it is hereby ordered:  —  Section 1.  Purpose.",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/08/improving-oversight-of-federal-grantmaking/"
  },
  {
    "text": "Crypto group claims responsibility for hurling sex toys at WNBA games … Cryptocurrency meme coin creators say they are responsible for the sex toys being thrown at multiple WNBA games, and they are planning more “pranks.”  —  From Atlanta to Los Angeles, no arena has been safe … ",
    "url": "https://www.usatoday.com/story/sports/wnba/2025/08/07/wnba-sex-toys-green-dildo-crypto-meme-coin/85551443007/?link_source=ta_bluesky_link&taid=6894f4f9a84a4a00010d10da"
  },
  {
    "text": "How the Right Shaped the Debate Over the Sydney Sweeney Ads  —  Right-wing commentators suggested there was widespread criticism of Ms. Sweeney over her new ad campaign.  There wasn't, at least at first.  —  To hear Vice President JD Vance tell it, the Democratic Party has a serious Sydney Sweeney problem.",
    "url": "https://www.nytimes.com/2025/08/07/business/sydney-sweeney-ad-right-wing-media.html"
  },
  {
    "text": "VA Just Terminated Most Federal Union Contracts, National Nurses United Included … In a significant shift affecting approximately 360,000 healthcare workers, the Department of Veterans Affairs (VA) has severed ties with most federal unions, including the National Nurses Organizing Committee … ",
    "url": "https://nurse.org/news/va-terminates-union-contracts-nurses-united/"
  },
  {
    "text": "Lawsuit: ICE Agents Deported Citizen Children in Secret, Including 4-Year-Old on Chemo  —  WASHINGTON — A new federal lawsuit filed in the Middle District of Louisiana accuses U.S. Immigration and Customs Enforcement of unlawfully deporting three U.S. citizen children, including a four-year-old … ",
    "url": "https://migrantinsider.com/p/lawsuit-ice-agents-deported-citizen"
  },
  {
    "text": "Energy chief suggests Trump administration is altering previously published climate reports  —  Energy Sec. Chris Wright said Tuesday night the Trump administration is updating the National Climate Assessments that have been previously published, which the administration recently removed from government websites.",
    "url": "https://cnn.com/2025/08/07/climate/wright-national-climate-assessments-updating"
  },
  {
    "text": "Trump doubles reward to $50 million for arrest of Venezuela's president to face US drug charges  —  The Trump administration is doubling to $50 million a reward for the arrest of Venezuela's President Nicolás Maduro, accusing him of being one of the world's largest narco-traffickers … ",
    "url": "https://apnews.com/article/venezuela-fbi-bondi-justice-department-0e618369ca68b79b1a2143a95955344a"
  },
  {
    "text": "Alan Dershowitz once again denied pierogi as Martha's Vineyard residents chant ‘time to go’  —  'I am very surprised that you're here because of the things that you've been saying about us and the business online,' the pierogi vendor told Alan Dershowitz on Wednesday.",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/alan-dershowitz-marthas-vineyard-pierogi-b2803763.html"
  },
  {
    "text": "Trump Administration to Require Universities to Submit Data on Applicants' Race  —  The administration has become increasingly focused on admissions data in its effort to bring the higher education system in line with President Trump's political agenda.  —  President Trump on Thursday ordered … ",
    "url": "https://www.nytimes.com/2025/08/07/us/politics/trump-schools-race-data.html"
  },
  {
    "text": "Gina Carano, Disney Settle Legal Dispute Over ‘Mandalorian’ Firing: ‘We Look Forward to Identifying Opportunities to Work Together in the Future’  —  Lucasfilm and the Walt Disney Company have reached a mutual agreement in their legal dispute with Gina Carano following her firing from “The Mandalorian.”",
    "url": "https://variety.com/2025/biz/news/gina-carano-disney-settle-mandalorian-firing-1236481982/"
  },
  {
    "text": "Video shows Department of Justice official urging Jan. 6 rioters to ‘kill’ cops  —  Police bodycam footage introduced at the trial of Jared Wise showed him berating police officers on Jan. 6, 2021 and yelling “kill 'em” as rioters attacked law enforcement.  —  Less than five years … ",
    "url": "https://www.npr.org/2025/08/07/nx-s1-5493197/doj-trump-jan-6-defendant-jared-wise-capitol-riot"
  },
  {
    "text": "Fact Sheet: President Donald J. Trump Democratizes Access to Alternative Assets for 401(k) Investors  —  EXPANDING INVESTMENT CHOICES FOR 401(K) PLANS: Today, President Donald J. Trump signed an Executive Order to allow 401(k) investors to access alternative assets for better returns and diversification.",
    "url": "https://www.whitehouse.gov/fact-sheets/2025/08/fact-sheet-president-donald-j-trump-democratizes-access-to-alternative-assets-for-401k-investors/"
  },
  {
    "text": "Top Trump officials discussed Epstein at White House meeting Wednesday night  —  A much-anticipated meeting between Attorney General Pam Bondi, FBI Director Kash Patel, Vice President JD Vance and others was moved from Vance's residence to the White House Wednesday night after intense media coverage … ",
    "url": "https://cnn.com/2025/08/07/politics/epstein-meeting-vance-bondi-patel"
  },
  {
    "text": "Trump Turns the Screws on the Fortune 500 … Shares of Intel, the semiconductor manufacturer, tanked today after Donald Trump called on the company's CEO to resign because of his past business dealings in China.  —  It's too early to make any assessments about the president's claims about CEO Lip-Bu Tan … ",
    "url": "https://www.politico.com/news/magazine/2025/08/07/trump-turns-the-screws-on-the-fortune-500-00498762"
  },
  {
    "text": "As Trump Administration Plans to Burn Contraceptives, Europeans Are Alarmed  —  The U.S. government intends to incinerate $9.7 million in already-purchased birth control in Belgium after U.S.A.I.D shut down.  Destruction may have already started.  —  The Trump administration's plans … ",
    "url": "https://www.nytimes.com/2025/08/07/world/europe/usaid-contraceptives-trump.html?unlocked_article_code=1.cU8.HTU8.4Yj0xtXgt_HH&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "On Vaccines, Kennedy Has Broken Sharply With the Mainstream  —  While many officials and scientists embrace other parts of the secretary's agenda, his stance on vaccines is alienating allies who fear a public health crisis.  —  Even before Robert F. Kennedy Jr. took office in February … ",
    "url": "https://www.nytimes.com/2025/08/07/health/kennedy-vaccines-mrna-trump.html?unlocked_article_code=1.cU8.FoTH.6uI3CzsNxyZy&smid=url-share"
  },
  {
    "text": "Dean Cain, Who Played Superman, Says He Is Joining ICE  —  The actor told Fox News he will sign up as an immigration officer, as the Trump administration recruits more personnel to staff its deportation campaign.  —  Dean Cain, the actor who played Superman in a popular 1990s TV series … ",
    "url": "https://www.nytimes.com/2025/08/07/us/dean-cain-superman-ice.html?unlocked_article_code=1.cU8.sNI8.JUcX3D7CXPO1&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Jailed by Trump's ICE, Children's Hospital Chaplain Was Thrown Into ‘Solitary’  —  Ayman Soliman is locally renowned for helping the families of dying kids.  Now, friends say he's been “tortured” in isolation as the Trump administration tries to deport him  —  CINCINNATI — Since July 9 … ",
    "url": "https://www.rollingstone.com/politics/politics-features/childrens-hosptial-chaplain-isolation-ice-deport-1235403224/"
  },
  {
    "text": "Trump orders federal law enforcement to patrol DC  —  Federal law enforcement officers will patrol the streets of Washington, D.C., for the next seven days, the White House announced on Thursday.  —  The enhanced federal presence will begin at midnight.  It will be led by the U.S. Park Police … ",
    "url": "https://thehill.com/homenews/state-watch/5442446-trump-federal-law-enforcement-dc/"
  },
  {
    "text": "Federal courts step up security following major hack of electronic filing system … “The Judiciary is also further enhancing security of the system and to block future attacks, and it is prioritizing working with courts to mitigate the impact on litigants,” the statement added.",
    "url": "https://www.politico.com/news/2025/08/07/federal-court-filing-system-pacer-hack-security-lawmaker-response-00498563"
  },
  {
    "text": "Alabama immigration advocate detained by ICE in traffic stop, family says: ‘Just heartbreaking and discouraging’  —  The family and friends of a Birmingham woman are pleading with the community to help them keep her in Alabama after she was detained this week during a traffic stop.",
    "url": "https://www.al.com/news/2025/08/alabama-immigration-advocate-detained-by-ice-in-traffic-stop-family-says-just-heartbreaking-and-discouraging.html"
  },
  {
    "text": "Stephen Miller Is Getting $170 Billion To Build His Own Army To Target Our Immigrant Neighbors.  Here's What That Funding Could Do Instead  —  Just think of how much our country could get done with $170 billion in federal funding.  Hungry schoolkids fed with nutritious meals.",
    "url": "https://americasvoicecnn.substack.com/p/stephen-miller-is-getting-170-billion"
  },
  {
    "text": "Trump pushed major change to Medicare after $5 million donation to MAGA, Inc: report  —  Back in April, President Donald Trump paused the rollout of a Biden-era rule that sought to tamper down “abusive (Medicare) pricing practices” from private companies, and on Thursday … ",
    "url": "https://www.rawstory.com/trump-2673867349/"
  }
]