[
  {
    "text": "“Bringing back the joy”: Kamala Harris' rally blows away JD Vance's weird appearance across town  —  In Philadelphia, thousands cheered for Tim Walz, while Trump's running mate spoke to a small, aggrieved group  —  “He's so weird!  He's so weird!” the crowd chanted in a sing-song … ",
    "url": "https://www.salon.com/2024/08/07/bringing-back-the-joy-kamala-harris-rally-blows-away-jd-vances-weird-appearance-across-town/"
  },
  {
    "text": "J.D. Vance's New Attack on Tim Walz Proves Irony Is Dead  —  Ohio Senator J.D. Vance has gone on the attack against Minnesota Governor Tim Walz's military service—even if he's not the right guy to be pointing the finger.  —  “When were you ever in war?”  Vance asked rhetorically at a Michigan rally on Wednesday.",
    "url": "https://newrepublic.com/post/184662/jd-vance-attack-tim-walz-stolen-valor-background"
  },
  {
    "text": "Republicans start tearing down Walz by going after his military record  —  The charge has been led by Vance, a veteran who served in Iraq, going after Walz's decision to leave the National Guard to run for public office.  —  Donald Trump's presidential campaign is homing in on what advisers … ",
    "url": "https://www.nbcnews.com/politics/2024-election/republicans-vance-start-tearing-walz-going-military-record-rcna165564"
  },
  {
    "text": "Gov. Tim Walz doesn't own a single stock … Same goes for his wife Gwen, per tax filings.  — His disclosures, both from his final year in Congress and his time as Minnesota governor, also show no mutual funds, bonds, private equities, or other securities.  — No book deals or speaking fees or crypto or racehorse interests.",
    "url": "https://www.axios.com/2024/08/07/tim-walz-vp-pick-investment-portfolio"
  },
  {
    "text": "JD Vance approaches Air Force Two after Kamala Harris, Walz land in Wisconsin — says it will be ‘my plane’ soon  —  EAU CLAIRE, Wis. — Republican vice presidential candidate JD Vance stunned reporters Wednesday by attempting to confront Vice President Kamala Harris and her running mate Tim Walz … ",
    "url": "https://nypost.com/2024/08/07/us-news/jd-vance-tries-to-confront-kamala-harris-on-wisconsin-tarmac-inspects-his-future-plane-instead/"
  },
  {
    "text": "Trump took a private flight with Project 2025 leader in 2022  —  Trump took the flight to speak at a Heritage Foundation conference, where he said, “They're going to lay the groundwork and detail plans for exactly what our movement will do.”  —  Republican presidential nominee Donald Trump … ",
    "url": "https://www.washingtonpost.com/elections/2024/08/07/trump-heritage-project-2025-roberts/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzIzMDAzMjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI0Mzg1NTk5LCJpYXQiOjE3MjMwMDMyMDAsImp0aSI6IjU5YWFlZjcyLWU1ZDgtNGE1NC04MWZiLTdkYWVjNDIxOGU1ZiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9lbGVjdGlvbnMvMjAyNC8wOC8wNy90cnVtcC1oZXJpdGFnZS1wcm9qZWN0LTIwMjUtcm9iZXJ0cy8ifQ.2HhqEQNVoqvh9Bm-KPcK5zwpQDNFngVH67ucIvuc1uY&itid=gfta"
  },
  {
    "text": "Delayed publication of Heritage president's book reflects Project 2025 shell game  —  Media Matters has obtained a galley copy of Dawn's Early Light, which decries IVF, abortion, childlessness, and dog parks  —  Heritage Foundation President Kevin Roberts' book will be published … ",
    "url": "https://www.mediamatters.org/kevin-roberts/delayed-publication-heritage-presidents-book-reflects-project-2025-shell-game"
  },
  {
    "text": "Electoral College Rating Changes: GA Back to Toss-up, MN/NH Better for Democrats  —  KEY POINTS FROM THIS ARTICLE  — In the few weeks that Vice President Kamala Harris has emerged as Democrats' standard bearer, she has “reset” the electoral map to some degree, as she has polled better … ",
    "url": "https://centerforpolitics.org/crystalball/electoral-college-rating-changes-ga-back-to-toss-up-mn-nh-better-for-democrats/"
  },
  {
    "text": "Despite new criticism, Trump told Walz in 2020 he was ‘very happy’ with his handling of George Floyd protests  —  GOP critics are seizing on the VP candidate's handling of the protests.  —  In this June 3, 2020, file photo, Minnesota Governor Tim Walz speaks to the press in St. Paul, Minnesota.",
    "url": "https://abcnews.go.com/US/despite-new-criticism-trump-told-walz-2020-happy/story?id=112616502"
  },
  {
    "text": "JD Vance over text: Crude, dismissive and friendly with the far-right fringe  —  Private messages show Trump's running mate entertaining conspiracy theories and scorning the late Sheldon Adelson.  —  The day after JD Vance was elected to the U.S. Senate in 2022, he received a congratulatory text … ",
    "url": "https://www.washingtonpost.com/politics/2024/08/07/jd-vance-charles-johnson-texts/"
  },
  {
    "text": "Forest Service orders Arrowhead bottled water company to shut down California pipeline  —  (Allen J. Schaben / Los Angeles Times)  —  In a decision that could end a years-long battle over commercial extraction of water from public lands, the U.S. Forest Service has ordered the company … ",
    "url": "https://www.latimes.com/environment/story/2024-08-07/arrowhead-bottled-water-permit"
  },
  {
    "text": "Trump keeps losing his train of thought.  Cognitive experts have theories about why  —  In a speech earlier this year, former President Trump was mocking President Biden's ability to walk through sand when he suddenly switched to talking about the old Hollywood icon Cary Grant.",
    "url": "https://www.statnews.com/2024/08/07/trump-mental-health-linguistic-analysis-suggests-potential-cognitive-decline-experts-say/"
  },
  {
    "text": "Kamala Goes Electric and Trump Melts Down  —  Last Thursday the Harris campaign began offering tickets for a campaign rally in Detroit the following Wednesday (tomorrow, August 7th).  Over the first 24 hours they received 47,000 requests for tickets.  47,000.",
    "url": "https://talkingpointsmemo.com/edblog/kamala-goes-electric-and-trump-melts-down"
  },
  {
    "text": "It's getting worse for JD Vance  —  A half-dozen polls in recent weeks have shown his already-underwhelming image deteriorating.  And they suggest his past comments about childless women aren't helping.  —  Two weeks ago, I noted that the early signs for JD Vance as Donald Trump's vice-presidential nominee were not encouraging.",
    "url": "https://www.washingtonpost.com/politics/2024/08/07/its-getting-worse-jd-vance/"
  },
  {
    "text": "Musk's Twitter ‘Boycott’ Lawsuit Is a ‘Hideous Joke’: Former FTC Official  —  “This complaint doesn't even get into the batter's box, much less get the chance to strike out,” says David Balto, FTC policy director from 1998 to 2001 … This time, the company is going after a cohort of advertisers … ",
    "url": "https://www.rollingstone.com/culture/culture-features/elon-musk-twitter-advertisers-lawsuit-joke-1235074957/"
  },
  {
    "text": "Another fake elector domino falls in Arizona after ex-Trump attorney caves to prosecutors  —  Amid scrutiny by the congressional Jan. 6 committee into Donald Trump's alleged fake elector scheme in Arizona two years ago, Republican activist Lorraine Pellegrino deflected on her role in advancing … ",
    "url": "https://lawandcrime.com/high-profile/another-fake-elector-domino-falls-in-arizona-after-ex-trump-attorney-caves-to-prosecutors/"
  },
  {
    "text": "Taylor Swift concerts in Vienna canceled after Austrian police say foiled terror plot targeted shows  —  Two men were arrested in what police said were terror plots at major events in Vienna.  One of those arrested was a 19-year-old who allegedly pledged his allegiance to ISIS.",
    "url": "https://www.nbcnews.com/news/world/taylor-swift-concert-terror-plot-austria-foiled-2-men-arrested-shows-w-rcna165591"
  },
  {
    "text": "FBI: California woman brought sword, whip and other weapons into Capitol during Jan. 6 riot  —  A California woman is charged with taking a cache of weapons, including a sword, a steel whip and a knife into the U.S. Capitol during the Jan. 6, 2021, attack by a mob of Donald Trump supporters … ",
    "url": "https://apnews.com/article/capitol-riot-arrest-kennedy-lindsey-a4d4f054d7b5dde546397d4a4ac03153"
  }
]