[
  {
    "text": "Judge Denies Trump's Bid to Throw Out Conviction Over Immunity Ruling  —  Justice Juan M. Merchan thwarted one of several attempts by Donald J. Trump to clear his record of 34 felonies before returning to the White House.  —  A judge on Monday rejected Donald J. Trump's argument … ",
    "url": "https://www.nytimes.com/2024/12/16/nyregion/trump-immunity-criminal-case.html"
  },
  {
    "text": "Trump's Retribution Tour Begins  —  On Monday evening, Trump sued Ann Selzer, the respected pollster who incorrectly predicted a Harris victory in Iowa.  Is he looking for compensation over damages or simply firing a warning shot to the industry ahead of his next term?",
    "url": "https://puck.news/trump-sues-iowa-pollster-ann-selzer-for-being-wrong/"
  },
  {
    "text": "Trump sues Des Moines Register, top pollster for ‘brazen election interference,’ fraud over Harris poll  —  FIRST ON FOX: President-elect Donald Trump is suing the Des Moines Register and its top pollster J. Ann Selzer for “brazen election interference” and fraud over its final 2024 presidential … ",
    "url": "https://www.foxnews.com/politics/trump-sues-des-moines-register-top-pollster-brazen-election-interference-fraud-over-harris-poll"
  },
  {
    "text": "Statement from President Joe Biden on Shooting at Abundant Life Christian School in Wisconsin  —  Today, families in Madison, Wisconsin, are grieving the loss of those who were killed and wounded at Abundant Life Christian School.  It's shocking and unconscionable.  —  We need Congress to act.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/12/16/statement-from-president-joe-biden-on-shooting-at-abundant-life-christian-school-in-wisconsin/"
  },
  {
    "text": "The toxic nature of “debate me, bro” culture  —  Dan Dezner has a good blog about how even if the resistance to things like RFK Jr.'s war on vaccines is able to mostly hold the line — far from a guarantee in itself — there is a huge opportunity cost to pretending there is any legitimate … ",
    "url": "https://www.lawyersgunsmoneyblog.com/2024/12/the-toxic-nature-of-debate-me-bro-culture"
  },
  {
    "text": "Questions ABC News Should Answer Following the $16 Million Trump Settlement … As someone who practiced press law for more than twenty years, and served as a senior executive of news organizations for just as long, I was shocked by the decision of ABC News last week to pay $16 million … ",
    "url": "https://www.cjr.org/business_of_news/questions-abc-news-should-answer-16-million-trump-settlement.php"
  },
  {
    "text": "Why ABC News settled with Donald Trump for $15 million  —  George Stephanopoulos ended Sunday's “This Week” program without any mention of him or ABC News settling Donald Trump's defamation lawsuit against them.  The suit was triggered by a segment on “This Week,” but ABC News has not reported … ",
    "url": "https://www.cnn.com/2024/12/16/media/george-stephanopoulos-trump-settlement-abc"
  },
  {
    "text": "The Great Capitulation  —  At a press conference at Mar-a-Lago on Monday, Donald Trump described recent visits from Tim Cook, C.E.O. of Apple, Sergey Brin, a co-founder of Google, and other tech barons.  “In the first term, everyone was fighting me,” he said.  “In this term, everyone wants to be my friend.”",
    "url": "https://www.nytimes.com/2024/12/16/opinion/trump-tech-leaders-support.html"
  },
  {
    "text": "AOC loses key vote in House Oversight race to Gerry Connolly … - The House Democratic caucus still has to vote on whether to accept the recommendation - though that ratification is rarely denied.",
    "url": "https://www.axios.com/2024/12/16/aoc-house-steering-committee-oversight-connolly"
  },
  {
    "text": "Judge rejects Trump request to toss Bragg charges in New York on basis of presidential immunity  —  Judge Merchan has not yet ruled on Trump's motion to dismiss the charges altogether  —  Judge Juan Merchan on Monday rejected Trump attorneys' request to dismiss charges brought … ",
    "url": "https://www.foxnews.com/politics/judge-rejects-trump-request-toss-bragg-charges-new-york-basis-presidential-immunity"
  },
  {
    "text": "A low, low point for ABC News  —  ABC News not only settled a defamation suit with Trump.  It paid out $15 million.  What?",
    "url": "https://www.washingtonpost.com/opinions/2024/12/16/abc-news-trump-settlement-stephanopoulos/"
  },
  {
    "text": "Hegseth's Guard Left the Army After the Beating of a Civilian During Training  —  John Hasenbein, who has escorted Donald J. Trump's pick for defense secretary to meetings on Capitol Hill, said he was unjustly prosecuted for the 2019 episode.  —  When Pete Hegseth visited senators on Capitol Hill … ",
    "url": "https://www.nytimes.com/2024/12/16/us/politics/hegseth-bodyguard-army.html?unlocked_article_code=1.h04.OGVD.K3ZO9RUMdp2N&smid=url-share"
  },
  {
    "text": "Meddling for MAGA  —  Patrick Soon-Shiong, the owner of the Los Angeles Times, has dismayed staffers as he curtails critical coverage of Donald Trump.  —  Patrick Soon-Shiong's meddling at the Los Angeles Times has grown more pervasive than previously realized.",
    "url": "https://www.status.news/p/patrick-soon-shiong-los-angeles-times-donald-trump-fcad"
  },
  {
    "text": "A bomb killed a Russian general in Moscow.  A Ukrainian official says secret service was behind it  —  Live from Moscow after an explosive device planted close to a residential apartment block killed the head of Russia's Nuclear, Biological, and Chemical Defence Forces, Lt. General Igor Kirillov, Russia's Investigative Committee said.",
    "url": "https://apnews.com/article/russia-explosion-head-of-nuclear-defense-forces-killed-9656bce946a9f552454df9debe5fbd18"
  },
  {
    "text": "Trump transition launches DHS landing team full of first-term alums  —  President-elect Donald Trump's Homeland Security landing team is starting work today with meetings at the Transportation Security Administration's headquarters in Springfield, Virginia.  The sprawling Department … ",
    "url": "https://www.politico.com/live-updates/2024/12/16/congress/dhs-landing-team-starts-work-00194494"
  },
  {
    "text": "After Trump's Victory, Republicans Trust the Election System Again  —  Surveys taken since Donald Trump's win show a resurgent faith among the president-elect's supporters, and little Democratic appetite for conspiracy theories.  —  Americans are more confident in the country's election system … ",
    "url": "https://www.nytimes.com/2024/12/17/us/politics/republicans-elections-trust-trump.html"
  },
  {
    "text": "Oh, Never Mind  —  Do you remember when candidate Donald Trump said, “Grocery prices have skyrocketed.  How can a family afford that?  So, when I win, I will immediately bring prices down.”  That was at a rally in August.  —  Or how about this: “We will end inflation and make America affordable again … ",
    "url": "https://steady.substack.com/p/oh-never-mind"
  },
  {
    "text": "12/17/24 ☀️ AM:  —  Tick-tock: The CR is still under wraps, as a House vote slips to Thursday  —  The Vault: Brown's nomination gambit looks shaky  —  RFK Jr. wades slowly into confirmation fight  —  Trump allies start making impoundment moves",
    "url": "https://punchbowl.news/archive/121724-am/"
  },
  {
    "text": "Scoop: Top editors stiff the Washington Post … - One person involved in the search told us Lewis' pitch was foggy and uninspiring. … Other candidates include current interim executive editor Matt Murray.  But it's hard to imagine this monthslong process unfolding so publicly — only to end with the same guy in charge.",
    "url": "https://www.axios.com/2024/12/17/washington-post-executive-editor-candidates-withdraw"
  },
  {
    "text": "Trump's for-profit presidency  —  “Victory” cologne and perfume.  “Crypto President” watches.  Limited-edition “American Eagle” guitars.  T-branded golf shoes and “Fight Fight Fight” high-top sneakers.  —  These are just a sample of the many products licensed to bear President-elect Donald Trump's brand … ",
    "url": "https://www.vox.com/politics/391338/trump-business-truth-social-crypto-liv-hotel-conflicts"
  },
  {
    "text": "Elizabeth Warren asks Trump to set conflict-of-interest rules for Musk  —  The letter from the Massachusetts senator comes as the tech tycoon has taken a prominent role inside Trump's orbit  —  Sen. Elizabeth Warren (D-Massachusetts) wrote a letter to President-elect Donald Trump on Monday … ",
    "url": "https://www.washingtonpost.com/politics/2024/12/17/elizabeth-warren-trump-elon-musk-conflicts-interest/"
  },
  {
    "text": "Trump and SoftBank CEO Announce $100 Billion Investment in US Projects  —  The technology company plans to invest $100 billion in U.S. projects, echoing the multibillion-dollar pledge it made after Donald J. Trump's first election victory in 2016.  —  President-elect Donald J. Trump's … ",
    "url": "https://www.nytimes.com/2024/12/16/us/trump-softbank-investment.html?unlocked_article_code=1.iE4.-fpn.Uu6E3a2JXlsv&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Scoop: GOP senator pushes huge increase to child tax credit … - After a child is born, Hawley is proposing to let parents claim a credit for the tax year of the pregnancy.  — Hawley's proposal speaks to the GOP's desire to adopt pro-family policies and outflank Democrats on anti-poverty programs.",
    "url": "https://www.axios.com/2024/12/17/josh-hawley-child-tax-credit-trump"
  },
  {
    "text": "Adeel Mangi's letter to America  —  Biden's stalled Third Circuit nominee, Mangi spoke out in a fiery — and needed — four-page letter.  Also: The clock is ticking on TikTok.  (Sorry.)  —  On Monday, 13 months after President Joe Biden announced that Adeel Mangi would be his nominee … ",
    "url": "https://www.lawdork.com/p/adeel-mangi-letter-third-circuit-nominee"
  }
]