[
  {
    "text": "Truth Social Users Are Losing Ridiculous Sums of Money to Scams  —  Read the complaints submitted to the FTC by users of Donald Trump's social media platform. … Donald Trump launched Truth Social in 2022 as a social media platform where the MAGA faithful could hang out without any liberals to spoil the fun.",
    "url": "https://gizmodo.com/truth-social-users-are-losing-ridiculous-sums-of-money-to-scams-2000506604"
  },
  {
    "text": "‘This is voter fraud’: FBI alerted as Elon Musk's mom accused of committing federal crime  —  Donald Trump's embrace of the richest man in the world, Elon Musk, hit another speedbump on Saturday as Musk's mom was accused of encouraging her followers to commit voter fraud.",
    "url": "https://www.rawstory.com/elon-musks-mom-voter-fraud-trump/"
  },
  {
    "text": "Elon Musk Leaps to Trump's Side in Rally Appearance  —  Mr. Musk, the world's richest man and the owner of Tesla and X, endorsed the former president after the attempted assassination in July.  On Saturday, he returned to the scene and made a spirited rally appearance.",
    "url": "https://www.nytimes.com/2024/10/05/us/politics/elon-musk-trump-butler-rally.html"
  },
  {
    "text": "Playbook: Michigan messes mount for Harris  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  TICK TOCK — One month until Election Day.  —  RETURN TO BUTLER — Former President DONALD TRUMP heads back to Butler, Pennsylvania, today … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/10/05/michigan-messes-mount-for-harris-00182609"
  },
  {
    "text": "'It's not won': Democrats jittery over razor-thin race in Michigan  —  Harris still faces a number of challenges in the state.  —  FLINT, Michigan — Democrats across the country are fretting about Pennsylvania, a blue wall state that could crumble Vice President Kamala Harris' most straightforward path to victory.",
    "url": "https://www.politico.com/news/2024/10/05/kamala-harris-michigan-battleground-2024-00182614"
  },
  {
    "text": "Interested Parties Memo: Fighting Hurricane Helene Falsehoods with Facts  —  Senior Advisor to the President and Communications Director Ben LaBolt, and Director of Digital Strategy Christian Tom  —  Under President Biden and Vice President Harris's direction, the Administration has mobilized a robust … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/10/05/interested-parties-memo-fighting-hurricane-helene-falsehoods-with-facts/"
  },
  {
    "text": "Helene response hampered by misinformation, conspiracy theories  —  False claims are adding to the chaos and confusion in many storm-battered communities.  Social media platforms such as X have allowed the falsehoods to spread.  —  One day after Hurricane Helene slammed into Asheville … ",
    "url": "https://www.washingtonpost.com/weather/2024/10/05/hurricane-helene-conspiracy-theories-rumors/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI4MTAwODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI5NDgzMTk5LCJpYXQiOjE3MjgxMDA4MDAsImp0aSI6ImVkMWU1M2M0LWQ1YzQtNDcyMi05Njg5LTUwMzE1YmJjOGEyYiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS93ZWF0aGVyLzIwMjQvMTAvMDUvaHVycmljYW5lLWhlbGVuZS1jb25zcGlyYWN5LXRoZW9yaWVzLXJ1bW9ycy8ifQ.tI-VTjCdXE9jFU2r_ypMvdJN_cli2B3SxW7eQNeo1sU&itid=gfta"
  },
  {
    "text": "Trump's Speeches, Increasingly Angry and Rambling, Reignite the Question of Age … Former President Donald J. Trump vividly recounted how the audience at his climactic debate with Vice President Kamala Harris was on his side.  Except that there was no audience.  The debate was held in an empty hall.",
    "url": "https://www.nytimes.com/2024/10/06/us/politics/trump-speeches-age-cognitive-decline.html"
  },
  {
    "text": "‘Sounding the alarm’: Election officials warn postal delays could invalidate mailed ballots  —  Postmaster General Louis DeJoy says staffers take ‘extraordinary measures’ to delivery ballots on time, but election officials warn delays could invalidate votes.",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/10/06/absentee-mail-in-ballots-postal-service-delays/75499900007/"
  },
  {
    "text": "Harris Will Appear in a Whirlwind of Interviews, Most of Them Friendly  —  After mostly avoiding interviews as her campaign began, the vice president will hold several this week, including with Howard Stern, Stephen Colbert and the hosts of “The View.”  —  Vice President Kamala Harris … ",
    "url": "https://www.nytimes.com/2024/10/06/us/politics/kamala-harris-interviews-the-view-stern-stephen-colbert.html"
  },
  {
    "text": "The Supreme Court Is Waiting Until After the Election to Do Its Next Damage  —  The first Monday of October is the traditional start of the Supreme Court docket-harvest festival, when a handful of cases are plucked by the justices to be argued before the highest court in the land and previewed by a deferential press corps.",
    "url": "https://slate.com/news-and-politics/2024/10/supreme-court-2024-election-plans.html"
  },
  {
    "text": "Colorado judge who sentenced election denier Tina Peters to prison receives threats  —  A rural Colorado county courthouse beefed up security Friday after threats were made against staff and a judge who sentenced former county clerk Tina Peters to nearly nine years behind bars and admonished … ",
    "url": "https://apnews.com/article/tina-peters-election-clerk-sentenced-threats-d565bd42bc566d4d178491a258238765"
  },
  {
    "text": "Florida is nearing toss-up status as top Republican poll shows Trump's lead nearly vanished  —  Race and age of Florida respondents seemed to correlate with which candidate they supported  —  Your support helps us to tell the story  —  As your White House correspondent, I ask the tough questions and seek the answers that matter.",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/florida-trump-toss-up-state-harris-b2624445.html"
  },
  {
    "text": "Melania Trump Reveals Why Donald Keeps Phoning Her Personal Doctor  —  ‘GENUINE AND CARING’  —  The former first lady opens about surprising aspects of her marriage in her forthcoming memoir and confirms she is an unrepentant election denier. … Melania Trump has opened up about a surprising aspect … ",
    "url": "https://www.thedailybeast.com/melania-trump-reveals-why-donald-keeps-phoning-her-personal-doctor-and-what-she-believes-about-2020-election"
  }
]