[
  {
    "text": "Trump Got a Big Sign the Supreme Court Doesn't Have His Back  —  Donald Trump may have handpicked three members of the Supreme Court's conservative majority.  That doesn't mean they are doing him any favors.  —  Former President Donald Trump has tried every legal trick in the book to postpone … ",
    "url": "https://www.vice.com/en/article/ak3qv4/trump-got-a-big-sign-the-supreme-court-doesnt-have-his-back"
  },
  {
    "text": "Trump Pulls Ahead in Michigan as Union, Women Voters Sour on Biden  —  Biden now trails Trump in seven swing states on economic concerns, the latest Bloomberg News/Morning Consult Poll shows.  —  Donald Trump has pulled ahead of President Joe Biden in must-win Michigan as voters remain pessimistic … ",
    "url": "https://www.bloomberg.com/news/articles/2023-12-14/trump-leads-biden-in-michigan-with-gains-in-union-women-votes-for-2024"
  },
  {
    "text": "Liz Cheney: Constitutional checks, balances won't stop Trump abuses  —  Former Rep. Liz Cheney is no longer in Congress, but she's not slowing in her efforts to warn Republicans about the danger of electing former President Trump in 2024.  —  “The risk is far too great to elect Mr. Trump ever again … ",
    "url": "https://thehill.com/homenews/4360134-liz-cheney-constitutional-checks-balances-trump/"
  },
  {
    "text": "Election 2024: Trump Opens 10-Point Lead  —  Former President Donald Trump now has a double-digit lead for 2024, as support for re-electing President Joe Biden has faded in the past month.  —  The latest Rasmussen Reports national telephone and online survey finds that … ",
    "url": "https://www.rasmussenreports.com/public_content/politics/public_surveys/election_2024_trump_opens_10_point_lead"
  },
  {
    "text": "When the New York Times lost its way  —  America's media should do more to equip readers to think for themselves  —  Are we truly so precious?  \" Dean Baquet, the executive editor of the New York Times, asked me one Wednesday evening in June 2020.  I was the editorial-page editor of the Times … ",
    "url": "https://www.economist.com/1843/2023/12/14/when-the-new-york-times-lost-its-way"
  },
  {
    "text": "Playbook: The politics that could make or break a border deal  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  WHAT YOUR MEDIA FRIENDS ARE TEXTING ABOUT — The Economist's James Bennet is out with a very buzzy, nearly 17,000-word piece on the culture war roiling … ",
    "url": "https://www.politico.com/newsletters/playbook/2023/12/14/the-politics-that-could-make-or-break-a-border-deal-00131713"
  },
  {
    "text": "The Republican leading the probe of Hunter Biden has his own shell company and complicated friends  —  TOMPKINSVILLE, Ky. (AP) — Rep. James Comer, a multimillionaire farmer, boasts of being one of the largest landholders near his rural Kentucky hometown, and he has meticulously documented nearly … ",
    "url": "https://apnews.com/article/comer-shell-company-biden-hunter-impeachment-6fde28673d5dced307b95cab8425c7ba"
  },
  {
    "text": "Kamala Harris pushes White House to be more sympathetic toward Palestinians  —  Her response to the Israel-Hamas war underscores how Democrats are walking a fine line between pro-Israel and pro-Palestinian constituencies.  —  Vice President Kamala Harris has been telling colleagues … ",
    "url": "https://www.politico.com/news/2023/12/14/kamala-harris-gaza-palestinians-00131633"
  },
  {
    "text": "Rudy Giuliani now won't testify in defamation trial brought by former Georgia election workers  —  Former Donald Trump attorney Rudy Giuliani will no longer testify in his defamation damages trial over how much he should pay two Georgia election workers millions of dollars in damages … ",
    "url": "https://www.cnn.com/2023/12/14/politics/rudy-giuliani-freeman-moss-defamation-trial/"
  },
  {
    "text": "Behind Hunter Biden's unexpected appearance: A surprising ally and a heads-up to his dad  —  The California Democratic lawmaker confirmed to POLITICO that he reserved the space for the president's son to deliver dramatic Wednesday morning remarks.  —  Hunter Biden pulled off his surprise appearance … ",
    "url": "https://www.politico.com/news/2023/12/13/hunter-biden-wingman-eric-swalwell-00131582"
  },
  {
    "text": "Statement from President Joe Biden on Baseless House Republican Impeachment Stunt  —  The American people need their leaders in Congress to take action on important priorities for the nation and world.  —  On Tuesday, I met with the President of Ukraine, who is leading his people in a battle for freedom against Russian aggression.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2023/12/13/statement-from-president-joe-biden-on-baseless-house-republican-impeachment-stunt/"
  },
  {
    "text": "Jan. 6 rioter with ‘Foxmania’ pleads guilty to felony Capitol attack charge  —  “You want war?”  Anthony Alexander Antonio shouted during the Jan. 6 attack.  “We got war. 1776 all over again.”  —  WASHINGTON — A Jan. 6 defendant whose attorney said was infected with “Foxmania” … ",
    "url": "https://www.nbcnews.com/politics/justice-department/jan-6-rioter-foxmania-pleads-guilty-felony-capitol-attack-charge-rcna129621"
  },
  {
    "text": "Trump Broadly Favored in GOP Primary  —  Democrats back Biden but with little enthusiasm  —  West Long Branch, NJ - Former President Donald Trump enjoys widespread support among an enthusiastic and motivated base of potential Republican primary voters in Michigan, according to the Monmouth (\"Mon-muth\") University-Washington Post Poll.",
    "url": "https://www.monmouth.edu/polling-institute/reports/monmouthpoll_mi_121423/"
  },
  {
    "text": "Biden campaign names top voter turnout operative as chief of staff  —  Sara Schreiber's hiring comes as Biden's campaign staffs up at headquarters and in battleground states.  —  Joe Biden's campaign is installing a top voter turnout operative as its chief of staff.",
    "url": "https://www.politico.com/news/2023/12/14/biden-campaign-chief-of-staff-sara-schreiber-00131733"
  },
  {
    "text": "Navy officer serving prison sentence in Japan for fatal crash returning to US, family says  —  A Navy officer who has been serving a prison sentence in Japan over a car crash that killed two people has been transferred into U.S. custody and is being returned to the United States.",
    "url": "https://www.washingtonexaminer.com/policy/defense-national-security/navy-officer-serving-prison-sentence-japan-fatal-crash-return"
  },
  {
    "text": "Pro-China YouTube Network Used A.I. to Malign U.S., Report Finds  —  Content from at least 30 channels in the network drew nearly 120 million views and 730,000 subscribers since last year.  —  In a faintly stilted tone and with slightly awkward grammar, the American-accented voice on YouTube … ",
    "url": "https://www.nytimes.com/2023/12/14/business/media/pro-china-youtube-disinformation.html"
  },
  {
    "text": "Exclusive: McCarthy eyes AI for new career, can imagine working with Musk … The ornate first-floor room was Rep. Nancy Pelosi's hideaway, before the GOP evicted her to make room for McCarthy after he lost the gavel.  — “AI is where California is going to come back,” he added.",
    "url": "https://www.axios.com/2023/12/14/kevin-mccarthy-elon-musk-ai-career-california-dc"
  }
]