[
  {
    "text": "Inside the Worst Three Weeks of Donald Trump's 2024 Campaign  —  People around the former and would-be president see a candidate knocked off his bearings, disoriented by his new contest with Kamala Harris and unsure of how to take her on.  —  The Aug. 2 dinner at the Bridgehampton, N.Y. … ",
    "url": "https://www.nytimes.com/2024/08/10/us/politics/trump-campaign-election.html?unlocked_article_code=1.B04.8Ov0.QyvP9oMUtuV9&smid=url-share"
  },
  {
    "text": "Report: Trump calls Harris a “bitch” … Steven Cheung, Trump campaign communications director, told The Times: “That is not language President Trump has used to describe Kamala, and it's not how the campaign would characterize her.” … - At his Mar-a-Lago news conference on Thursday … ",
    "url": "https://www.axios.com/2024/08/10/trump-calls-harris-bitch-report"
  },
  {
    "text": "Trump to host town halls if Harris bails on Fox News, NBC debate offers  —  Republican presidential nominee Donald Trump will still be in front of TV cameras even if Vice President Harris ducks out of two suggested debates, a campaign official told The Post.  —  If Harris is a no-show, “We'll do town-halls,” said a Trump official.",
    "url": "https://nypost.com/2024/08/10/us-news/trump-to-host-town-halls-if-harris-bails-on-fox-news-nbc-debate-offers/"
  },
  {
    "text": "The other Black politician who says he was with Trump in that near-fatal chopper crash  —  Former Los Angeles city councilman and state senator Nate Holden said in an exclusive interview late Friday that he remembers the near-death experience well.  —  The man who almost crashed in a helicopter … ",
    "url": "https://www.politico.com/news/2024/08/09/trump-plane-crash-california-00173487"
  },
  {
    "text": "Yes, Trump Was in a Scary Helicopter Ride.  But Not With That Politician.  —  There was a helicopter.  It did make an emergency landing.  But a former California lawmaker says Donald Trump has mixed up one Black lawmaker for another.  —  Donald J. Trump was doubling down on Friday … ",
    "url": "https://www.nytimes.com/2024/08/10/us/politics/trump-helicopter-crash-willie-brown.html?unlocked_article_code=1.B04.wRAg.KC17vTGHmf8H&smid=nytcore-ios-share&referringSource=articleShare&sgrp=c-cb"
  },
  {
    "text": "“We're not weird.”  —  Audio playback is not supported on your browser.  Please upgrade.  —  I am watching the Harris-Walz rally in Arizona as I write this newsletter on Friday evening.  The venue is packed, and the crowd is wildly enthusiastic.  Tim Walz delivered an even more enthusiastic speech … ",
    "url": "https://roberthubbell.substack.com/p/were-not-weird"
  },
  {
    "text": "Inside Project 2025's Secret Training Videos  —  Co-published with Documented  — DEEP STATE BATTLE: Project 2025's plan to train an army of political appointees who could fight the so-called deep state on behalf of a future Trump administration remains on track.",
    "url": "https://www.propublica.org/article/inside-project-2025-secret-training-videos-trump-election"
  },
  {
    "text": "Watch: 14 Hours of Never-Before-Published Videos From Project 2025's Presidential Administration Academy  —  Co-published with Documented  —  ProPublica and Documented obtained more than 14 hours of never-before-published videos from Project 2025's Presidential Administration Academy … ",
    "url": "https://www.propublica.org/article/video-project-2025-presidential-training-academy-trump-election"
  },
  {
    "text": "Harris Leads Trump in Three Key States, Times/Siena Polls Find  —  New surveys of Michigan, Wisconsin and Pennsylvania taken this week offer the latest indication of a dramatic reversal in standing for the Democratic Party since President Biden abandoned his re-election bid.",
    "url": "https://www.nytimes.com/2024/08/10/us/politics/harris-trump-battleground-polls.html?unlocked_article_code=1.B04.Q2KR.mNlzgt8msrxe&smid=url-share"
  },
  {
    "text": "Cross-Tabs: August 2024 Times/Siena Poll of the Likely Electorate in Michigan, Pennsylvania and Wisconsin  —  Results of New York Times/Siena College polls of Michigan, Pennsylvania and Wisconsin conducted among 1,973 likely voters from Aug. 5 to 9, 2024.  —  Thinking ahead to the presidential … ",
    "url": "https://www.nytimes.com/interactive/2024/08/10/us/elections/times-siena-poll-likely-electorate-crosstabs.html"
  },
  {
    "text": "Cross-Tabs: August 2024 Times/Siena Poll of Registered Voters in Michigan, Pennsylvania and Wisconsin  —  Results of New York Times/Siena College polls of Michigan, Pennsylvania and Wisconsin conducted among 1,973 registered voters from Aug. 5 to 9, 2024.  —  Thinking ahead to the presidential … ",
    "url": "https://www.nytimes.com/interactive/2024/08/10/us/elections/times-siena-poll-registered-voter-crosstabs.html"
  },
  {
    "text": "Kroger's new dynamic AI pricing scheme is ‘corporate greed is out of control’: critics  —  Expressing doubt that a new artificial intelligence-powered “dynamic pricing” model used by the Kroger grocery chain is truly meant to “better the customer experience,” Sens. Elizabeth Warren said Friday … ",
    "url": "https://www.rawstory.com/kroger-pricing-strategy/"
  },
  {
    "text": "Fact check: Walz retired from Army National Guard after 24 years to run for Congress  —  GOP vice presidential candidate JD Vance claims that the Minnesota governor and Democratic vice presidential candidate bailed as his unit headed to Iraq, but Walz retired before his unit was called up.",
    "url": "https://www.startribune.com/fact-check-walz-retired-from-army-national-guard-after-24-years-to-run-for-congress/600962516"
  },
  {
    "text": "A sinking ship?  Donald Trump campaign mocked for playing ‘Titanic’ song at rally  —  David Jackson Sudiksha KochiUSA TODAY  —  WASHINGTON - As far as his opponents are concerned, Donald Trump's latest presidential campaign is sinking so fast that his rallies include the musical theme from “Titanic.”",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/08/10/donald-trump-titanic-celine-dion/74747976007/"
  },
  {
    "text": "Kamala in Arizona: I Respect Your Pro-Hamas Voices  —  To her credit, Kamala Harris has been attracting some fairly respectable crowds out on the campaign trail this week.  That was the case in Arizona yesterday where she managed to attract roughly 15,000 people to an arena outside of Phoenix.",
    "url": "https://hotair.com/jazz-shaw/2024/08/10/kamala-in-arizona-i-respect-your-pro-hamas-voices-n3792952"
  },
  {
    "text": "Harris shutting down ‘lock him up’ chants shields Trump's federal Jan. 6 case from even more delays  —  Any comments Kamala Harris makes that could be seen as referencing the federal charges against Donald Trump could affect his election interference case.  —  WASHINGTON — Vice President … ",
    "url": "https://www.nbcnews.com/politics/2024-election/harris-shutting-lock-chants-shields-trumps-federal-jan-6-case-even-del-rcna165837"
  },
  {
    "text": "Montana GOP Senate candidate touts his business.  It's losing millions  —  After last year's slow wildfire season, Tim Sheehy's aerial firefighting company has suffered steep losses.  —  As he campaigns in one of the nation's most competitive U.S. Senate races, Montana Republican Tim Sheehy recounts … ",
    "url": "https://www.washingtonpost.com/politics/2024/08/10/tim-sheehy-firefighting-company-losses-wildfires/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzIzMjYyNDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI0NjQ0Nzk5LCJpYXQiOjE3MjMyNjI0MDAsImp0aSI6IjMxOTlkOTA1LWM4NjItNGQzMS05MTBjLTlkODFlMTZjNDM5YSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzA4LzEwL3RpbS1zaGVlaHktZmlyZWZpZ2h0aW5nLWNvbXBhbnktbG9zc2VzLXdpbGRmaXJlcy8ifQ.fCCg8FY7XgIL4p9okhEk7lShYl_SeeO1hTkdfmxToYM&itid=gfta"
  },
  {
    "text": "More than 90 Palestinians killed in Israeli strike on school and mosque sheltering displaced people, Gaza officials say  —  At least 93 Palestinians have been killed in an Israeli strike on a school and mosque in Gaza sheltering displaced people, according to local officials.",
    "url": "https://www.cnn.com/2024/08/10/middleeast/israeli-school-strike-gaza-intl-hnk/"
  }
]