[
  {
    "text": "Harris and Walz to sit with CNN for exclusive first joint interview since campaign began  —  Vice President Kamala Harris and Minnesota Gov. Tim Walz will sit with CNN for their first joint interview on Thursday as Democrats work to broaden their base's excitement from last week's Democratic National Convention.",
    "url": "https://www.cnn.com/2024/08/27/politics/kamala-harris-cnn-interview"
  },
  {
    "text": "Kamala's Campaign Pushes Trump's Impulse Control Problems  —  I don't think that even the outlets that recognize the troll are giving the Kamala Harris campaign enough credit for the jujitsu they're engaged in with the debate.  Before I explain why, though, here's a video of Barack Obama's skewering … ",
    "url": "https://www.emptywheel.net/2024/08/27/kamalas-campaign-pushes-trumps-impulse-control-problems/"
  },
  {
    "text": "New federal indictment filed against Trump in federal Jan. 6 case  —  The superseding indictment brought by special counsel Jack Smith follows a historic Supreme Court ruling granting broad immunity to presidents for official acts.  —  Special counsel Jack Smith has filed a new indictment … ",
    "url": "https://www.washingtonpost.com/national-security/2024/08/27/trump-dc-indictment-new-charges-jan-6/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI0NzMxMjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI2MTEzNTk5LCJpYXQiOjE3MjQ3MzEyMDAsImp0aSI6ImRmNThmNzM0LTcwMTQtNGU5NC05MDA1LTEyOWEzMzk0MTQ3NCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb25hbC1zZWN1cml0eS8yMDI0LzA4LzI3L3RydW1wLWRjLWluZGljdG1lbnQtbmV3LWNoYXJnZXMtamFuLTYvIn0.T1RTMQOPlpCKKHBtnRCVXK2tCpj4jGeeyMHiMyDN5DA&itid=gfta"
  },
  {
    "text": "Trump indicted again in election subversion case brought by Jack Smith  —  The 36-page indictment, secured Tuesday by special counsel Jack Smith, is an attempt by prosecutors to recalibrate the case.  —  A federal grand jury in Washington, D.C. has re-indicted Donald Trump on four felony charges related … ",
    "url": "https://www.politico.com/news/2024/08/27/trump-indicted-2020-election-subversion-00176503"
  },
  {
    "text": "Trump Reindicted On Coup Attempt Charges To Honor Supreme Court Immunity Ruling  —  Special counsel Jack Smith filed the new indictment on the same four counts of trying to overturn the 2020 election but without citing potentially “immune” evidence.  —  LOADING",
    "url": "https://www.huffpost.com/entry/trump-jan-6-superceding-indictment_n_66ce362ee4b054d20856a19f"
  },
  {
    "text": "Trump to Put Kennedy and Gabbard on his Transition Team  —  Mr. Kennedy and Ms. Gabbard, who had been progressive Democrats for many years, will join the former president's sons and Senator JD Vance, his running mate, as honorary co-chairs.  —  Donald J. Trump plans to name his former rival … ",
    "url": "https://www.nytimes.com/2024/08/27/us/politics/trump-transition-rfk-tulsi-gabbard.html"
  },
  {
    "text": "'He's got to pay a price': Unaired footage reveals Nancy Pelosi's Jan. 6 fury  —  Previously unaired footage reviewed by POLITICO reveals how the former speaker quickly turned her focus to impeaching Donald Trump after Congress certified the 2020 election.  —  Nancy Pelosi spent the duration … ",
    "url": "https://www.politico.com/news/2024/08/27/nancy-pelosi-jan-6-fury-00176529"
  },
  {
    "text": "Mark Zuckerberg's letter about Facebook censorship is not what it seems  —  This week Mark Zuckerberg sent Rep. Jim Jordan (R-OH) a letter outlining how the Biden administration pressured his company to “censor” free speech on Facebook — specifically misinformation about Covid-19.",
    "url": "https://www.vox.com/technology/369136/zuckerberg-letter-facebook-censorship-biden"
  },
  {
    "text": "Trump campaign staff had altercation with official at Arlington National Cemetery  —  Two members of Donald Trump's campaign staff had a verbal and physical altercation Monday with an official at Arlington National Cemetery where the former president participated in a wreath laying ceremony, NPR has learned.",
    "url": "https://www.npr.org/2024/08/27/nx-s1-5091154/trump-arlington-cemetery"
  },
  {
    "text": "The Conservatives Who Sold Their Souls for Trump  —  The rage and shame of the anti-anti-Trumpers is getting worse.  —  Today, Rich Lowry, the editor of National Review (the flagship conservative magazine founded by William F. Buckley Jr.), published an article claiming that Donald Trump could win the 2024 election “on character.”",
    "url": "https://www.theatlantic.com/newsletters/archive/2024/08/the-conservatives-who-sold-their-souls-for-trump/679623/?gift=hVZeG3M9DnxL4CekrWGK38nWdgGJEJDaAV_aOdhRDAM&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Why Did the New York Times Let Itself Be Used as a Mule?  —  Rich Lowry got the Gray Lady to bend over so Daddy Trump would see his genius idea.  —  ∙ Paid  —  1. The Liberal Media  —  Yesterday the New York Times published an op-ed by Rich Lowry arguing that Donald Trump … ",
    "url": "https://www.thebulwark.com/p/why-did-the-new-york-times-let-itself"
  },
  {
    "text": "Harris takes lead over Trump after convention: Poll  —  Video Player is loading.  —  Play Video  —  Unmute  —  Current Time 0:00  —  Loaded: 0%  —  Stream Type LIVE  —  Seek to live, currently behind liveLIVE  —  Playback Rate  —  Chapters  — Chapters  —  Descriptions",
    "url": "https://thehill.com/homenews/campaign/4849880-vice-president-harris-leads-trump/"
  },
  {
    "text": "Harris flip-flops on building the border wall … - Harris is embracing a more hawkish immigration policy as Donald Trump's campaign spends tens of millions of dollars attacking her about the border.  — But she still has significant differences with Trump on immigration … ",
    "url": "https://www.axios.com/2024/08/27/kamala-harris-flip-flops-border-wall"
  },
  {
    "text": "North Carolina Moves to Toss Up; Minnesota and New Hampshire Shift to Likely Democrat  —  Since the beginning of this cycle, Democrats were confident that President Joe Biden could win North Carolina.  Its demographic profile as an ethnically diverse and rapidly suburbanizing state looks similar … ",
    "url": "https://www.cookpolitical.com/analysis/national/national-politics/north-carolina-moves-toss-minnesota-and-new-hampshire-shift"
  },
  {
    "text": "New AARP Maryland Poll: Alsobrooks Tied with Hogan in Senate Contest  —  Vice President Harris leads former President Donald Trump by 25 points among older voters  —  ANNAPOLIS, Md.—Today, AARP Maryland released a 2024 statewide election survey revealing that candidates for president … ",
    "url": "https://press.aarp.org/2024-8-27-AARP-Maryland-Poll-Alsobrooks-Tied-Hogan-Senate-Contest"
  },
  {
    "text": "Confederate Voter Intimidation 2.0: The GOP's Dark Strategy for Winning  —  From Reconstruction to DeSantis to Paxton: How Republicans Are Keeping Power by Any Means Necessary...  The song that was inspired by this article is available here.  —  The Republican attorney general … ",
    "url": "https://hartmannreport.com/p/confederate-voter-intimidation-20-0bd"
  },
  {
    "text": "Georgia governor inquires whether he can remove MAGA election board members after series of alarming votes  —  Donald Trump recently praised the right-wing coalition on the Georgia state election board  —  Support truly  —  independent journalism  —  Our mission is to deliver unbiased … ",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/georgia-election-trump-brian-kemp-b2602111.html"
  },
  {
    "text": "Texas GOP doubles down on fraud claims as Trump, Cruz leads shrink  —  Texas Republicans are doubling down on claims that Democrats in the state's biggest cities are attempting to steal an election in which the GOP's leads in the Senate and presidential races are increasingly narrowing.",
    "url": "https://thehill.com/homenews/campaign/4850214-texas-gop-trump-cruz-shrink-lead/"
  }
]