[
  {
    "text": "Defend Trump and ‘Hammer’ Ramaswamy: DeSantis Allies Reveal Debate Strategy  —  Hundreds of pages of blunt advice, memos and internal polling were posted online by the main super PAC backing the Florida governor, offering an extraordinary glimpse into his operation's thinking.",
    "url": "https://www.nytimes.com/2023/08/17/us/politics/desantis-debate-strategy.html"
  },
  {
    "text": "Awkward Americans see themselves in Ron DeSantis  —  But do they like what they see?  —  After watching awkward videos of Ron DeSantis, Derek Guy had a horrifying realization.  —  Guy, a fashion writer known as the “Menswear Guy” to his large following on social media, had noticed people on X … ",
    "url": "https://www.washingtonpost.com/lifestyle/2023/08/17/ron-desantis-awkward/"
  },
  {
    "text": "Trump team seeks to delay federal election interference trial until 2026  —  Former President Donald Trump wants a federal judge to reject special counsel Jack Smith's request to get the trial underway in early January of next year.  —  WASHINGTON — Former President Donald Trump … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-lawyers-seeks-delay-federal-election-trial-2026-rcna100062"
  },
  {
    "text": "Prosecutors seek 27 to 33 years in prison for Proud Boys guilty of seditious conspiracy  —  Enrique Tarrio, Joseph Biggs, Ethan Nordean and Zachary Rehl were all convicted of seditious conspiracy in May following a months-long trial that began in January.  —  WASHINGTON — Federal prosecutors … ",
    "url": "https://www.nbcnews.com/politics/justice-department/prosecutors-seek-30-years-prison-proud-boys-seditious-conspiracy-case-rcna100277"
  },
  {
    "text": "Trump's Lawyers Seek April 2026 Start to Jan. 6 Trial  —  The lawyers said the extraordinary delay was needed given the historic nature of the case and the volume of discovery materials they will have to sort through in the coming months.  —  Lawyers for former President Donald J. Trump asked … ",
    "url": "https://www.nytimes.com/2023/08/17/us/trump-jan-6-trial-date-proposal.html"
  },
  {
    "text": "Officials Investigate Threats Against Trump Grand Jurors in Georgia  —  Some of the jurors' identities have been shared on social media, with suggestions that they be harassed or made “infamous.”  —  Anna Betts and Nicholas Bogel-Burroughs reported from Atlanta.",
    "url": "https://www.nytimes.com/2023/08/17/us/trump-georgia-grand-jurors.html"
  },
  {
    "text": "Trump's legal advisers urge him to cancel press conference to refute Georgia allegations: Sources  —  Trump had announced a plan to release info on alleged election interference.  —  Former President Donald Trump's promised press conference to refute the allegations in the indictment handed … ",
    "url": "https://abcnews.go.com/US/trumps-legal-advisers-urge-cancel-press-conference-refute/story?id=102336380"
  },
  {
    "text": "Inside the Incredible Drama Over One Senator's Trump Endorsement  —  One senator has been reluctant to endorse Trump because she serves on an RNC advisory board.  That excuse doesn't seem to be working for right-wing media. … When Republican National Committee chair Ronna McDaniel formed … ",
    "url": "https://www.thedailybeast.com/inside-the-incredible-drama-over-senator-katie-britts-trump-endorsement"
  },
  {
    "text": "Hunter Biden stays close to father at White House amid criminal probe  —  A day after he reached a tentative plea deal with Justice Department, Hunter Biden began two-week stay at the White House, underscoring President Biden's fatherly attachment despite his son's troubles",
    "url": "https://www.washingtonpost.com/politics/2023/08/17/hunter-biden-investigation-white-house/"
  },
  {
    "text": "GOP Georgia State Lawmaker Calls for Investigation Into Fani Willis  —  State Sen. Colton Moore quickly got the support of fellow Trump supporter Rep. Marjorie Taylor Greene  —  A Facebook icon representing an external link to share the article on Facebook.A Twitter icon representing … ",
    "url": "https://themessenger.com/politics/gop-georgia-state-lawmaker-calls-for-investigation-into-fani-willis"
  },
  {
    "text": "Electric cars face ‘punitive’ fees, new restrictions in many states  —  A growing number of conservative states are imposing new taxes on drivers using electric vehicle charging stations and trying to limit EV sales.  —  Electric vehicle drivers in Texas have started to get some bad news in the mail.",
    "url": "https://www.politico.com/news/2023/08/17/punitive-texas-other-states-roadblocks-ev-transition-00110125"
  },
  {
    "text": "CNN Pushes Kamala's False Claim About Florida Curriculum, Immediately Issues ‘Clarification’  —  CNN issued a clarification after pushing Vice President Kamala Harris' false claim about Florida's curriculum on black history.  —  Harris falsely accused the African American history curriculum of teaching how … ",
    "url": "https://dailycaller.com/2023/08/17/cnn-kamala-harris-florida-curriculum-black-history/"
  },
  {
    "text": "U.S. intelligence says Ukraine will fail to meet offensive's key goal  —  Thwarted by minefields, Ukrainian forces won't reach the southeastern city of Melitopol, a vital Russian transit hub, according to a U.S. intelligence assessment  —  The U.S. intelligence community assesses … ",
    "url": "https://www.washingtonpost.com/national-security/2023/08/17/ukraine-counteroffensive-melitopol/"
  },
  {
    "text": "The Hard-Tweeting Defense Lawyer GOP Candidates Have Learned to Fear  —  Ron Filipkowski's uncovered videos have embarrassed multiple campaigns.  Now he's aiming for Ron DeSantis.  —  Ron Filipkowski poses for a portrait outside of his office in Sarasota, Fla., on Friday, June 2, 2023.",
    "url": "https://www.politico.com/news/magazine/2023/08/17/ron-filipkowski-desantis-trump-00110950"
  },
  {
    "text": "‘Tanning Mom’ Patricia Krentcil Announces Run For Florida Senate Seat  —  Krentcil attained internet infamy in 2012 after she was arrested for allegedly putting her 5-year-old daughter in a tanning booth.  —  LOADING  —  If a former reality show host like Donald Trump can be elected president … ",
    "url": "https://www.huffpost.com/entry/tanning-mom-patricia-krentcil-florida-senate_n_64de8aede4b0f4cf3ed72ed2"
  },
  {
    "text": "US approves sending F-16s to Ukraine from Denmark and Netherlands  —  The United States has approved sending F-16 fighter jets to Ukraine from Denmark and the Netherlands to defend against Russian invaders as soon as pilot training is completed, a U.S. official said on Thursday.",
    "url": "https://www.reuters.com/world/us-approves-sending-f-16s-ukraine-denmark-netherlands-2023-08-17/"
  },
  {
    "text": "Trump plots counterprogramming for GOP primary debate, sources say  —  The current thinking among Donald Trump's campaign advisers and those close to the former president is that he is not planning on participating in next week's Republican presidential primary debate, three sources familiar … ",
    "url": "https://www.cnn.com/2023/08/16/politics/trump-debate-counterprogramming/"
  },
  {
    "text": "Federal judge rejects push to block Florida Chinese land ownership law  —  The groups that challenged the law — which they called “racist” — said they intend to appeal the ruling.  —  TALLAHASSEE — A federal judge on Thursday rejected attempts, including from the Biden administration … ",
    "url": "https://www.politico.com/news/2023/08/17/florida-chinese-land-ownership-law-00111732"
  },
  {
    "text": "Marijuana and hallucinogen use, binge drinking reached historic highs among adults 35 to 50  —  NIH-funded study also shows younger adults reported marijuana, vaping, and hallucinogen use at or near historically high levels.  —  For more information on substance and mental health treatment programs … ",
    "url": "https://www.nih.gov/news-events/news-releases/marijuana-hallucinogen-use-binge-drinking-reached-historic-highs-among-adults-35-50"
  },
  {
    "text": "‘Squad’ Democrat Ilhan Omar's World Cup trip funded by Hamas-tied Qatar  —  “Squad” Rep. Ilhan Omar (D-MN), who has come under fire from Democrats and Republicans for anti-Israel remarks, had her 2022 World Cup trip paid for by the government of Qatar, an Arab country that has been a top funder of the terrorist group Hamas.",
    "url": "https://www.washingtonexaminer.com/news/house/squad-democrat-ilhan-omars-world-cup-trip-funded-qatar"
  },
  {
    "text": "Fact-Checking the Breadth of Trump's Election Lies  —  The former president faces multiple charges related to his lies about the 2020 election.  Here's a look at some of his most repeated falsehoods.  —  Before the 2020 election had even concluded, President Donald J. Trump laid the groundwork … ",
    "url": "https://www.nytimes.com/2023/08/17/us/politics/trump-election-lies-fact-check.html"
  },
  {
    "text": "Maui survivors say government help still lags  —  FEMA is confronting growing disasters fueled by climate change while suffering staffing and funding shortages  —  Nine days after the deadliest wildfires in modern U.S. history scorched much of the historic town of Lahaina on Maui … ",
    "url": "https://www.washingtonpost.com/politics/2023/08/17/fema-maui-response-lahaina-fires-biden/"
  },
  {
    "text": "Pentagon study calls for reforms at US military academies to combat wave of sexual assaults  —  A new Pentagon study says the U.S. military academies must step up efforts to address a spike in reported cases of sexual assault and harassment among cadets and midshipmen, including strengthening … ",
    "url": "https://thehill.com/policy/defense/4157392-pentagon-study-calls-for-reforms-at-us-military-academies/"
  }
]