[
  {
    "text": "Trump Plans to Skip G.O.P. Debate for Interview With Tucker Carlson  —  The former president's apparent decision to skip the first debate is a major affront both to the Republican National Committee and to Fox News, which is hosting the event.  —  Former President Donald J. Trump plans … ",
    "url": "https://www.nytimes.com/2023/08/18/us/politics/trump-debate-tucker-carlson.html"
  },
  {
    "text": "Kenneth Chesebro, alleged architect of fake electors' plot, followed Alex Jones around Capitol grounds on January 6th  —  When conspiracy theorist Alex Jones marched his way to the US Capitol on January 6, 2021, riling up his legion of supporters, an unassuming middle-aged man in a red “Trump 2020” hat conspicuously tagged along.",
    "url": "https://www.cnn.com/2023/08/18/politics/kfile-kenneth-chesebro-followed-alex-jones-capitol-riot-jan-6/"
  },
  {
    "text": "A Jan. 6 defendant scheduled to be sentenced on Friday is now missing  —  WASHINGTON — Christopher Worrell, a Florida Proud Boy convicted on seven counts stemming from his actions during the Jan. 6 riot, was scheduled to be sentenced today in Washington, D.C, federal court but is now missing … ",
    "url": "https://www.nbcnews.com/politics/justice-department/jan-6-defendant-scheduled-sentenced-friday-now-missing-rcna100677"
  },
  {
    "text": "Camp David Principles  —  We, Prime Minister Kishida Fumio, President Yoon Suk Yeol, and President Joseph R. Biden, Jr., affirm a shared vision for our partnership as well as for the Indo-Pacific and beyond.  Our partnership is based on a bedrock of shared values, mutual respect … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2023/08/18/camp-david-principles/"
  },
  {
    "text": "Christie Says DeSantis Should Drop Out if He Defends Trump at Debate  —  Mr. Christie needled his higher-polling rivals while campaigning in their home state of Florida.  —  Reporting from South Miami, Fla.  —  If Gov. Ron DeSantis follows political consultants' advice … ",
    "url": "https://www.nytimes.com/2023/08/18/us/politics/christie-desantis-trump-debate.html"
  },
  {
    "text": "James Buckley, conservative politician and U.S. senator, dies at 100  —  In political circles, Mr. Buckley was perhaps best remembered as the lead plaintiff in a landmark campaign finance lawsuit — Buckley v. Valeo — that in 1976 unraveled part of the post-Watergate regulation of political money",
    "url": "https://www.washingtonpost.com/obituaries/2023/08/18/james-buckley-valeo-obit/"
  },
  {
    "text": "Exclusive: James O'Keefe Is Now Under Investigation for Looting Project Veritas  —  Prosecutors in Westchester County, N.Y., are pursuing charges against the right's premiere “gotcha video” scammer, for scamming his own donors.  —  Pocket  —  James O'Keefe, the founder and until … ",
    "url": "https://www.thenation.com/article/society/james-okeefe-criminal-investigation-project-veritas/"
  },
  {
    "text": "Our collective malady: Donald Trump's mental health crisis is America's problem  —  Experts: Trump's “denial of reality” and “primitive projections” are imploding.  He's even more dangerous  —  To properly respond to Donald Trump and the level of extreme danger he represents … ",
    "url": "https://www.salon.com/2023/08/18/our-collective-malady-donald-mental-health/"
  },
  {
    "text": "Trump attorneys, Fulton County DA expected to meet next week: Sources  —  The attorneys and DA are expected to negotiate terms of Trump's bond package.  —  Attorneys for former President Donald Trump are expected to meet early next week with the Fulton County district attorney's office … ",
    "url": "https://abcnews.go.com/US/trump-attorneys-fulton-county-da-expected-meet-week/story?id=102369420"
  },
  {
    "text": "A GOP challenger's frank talk about ‘sexual sin’  —  FITZPATRICK'S FOE DETAILS PORN ADDICTION  —  Pennsylvania Republican Mark Houck, who is challenging Rep. Brian Fitzpatrick from the right in a battleground district, revealed during a 2020 interview that he “struggled” … ",
    "url": "https://www.politico.com/newsletters/huddle/2023/08/18/a-gop-challengers-frank-talk-about-sexual-sin-00111808"
  },
  {
    "text": "Rudy Giuliani Was Never 'America's Mayor'  —  On Monday, Rudy Giuliani was indicted in Georgia for his role in what prosecutors called a conspiracy to overturn the results of the 2020 presidential election in that state.  —  The district attorney for Fulton County, Fani Willis … ",
    "url": "https://www.nytimes.com/2023/08/18/opinion/rudy-giuliani-trump-authoritarianism.html"
  },
  {
    "text": "‘Lock Them Up’ is Now the Republican Party's Highest Goal … Donald Trump's supporters, as you might expect, have not taken his latest indictment in stride.  Charlie Kirk, writing in the Federalist, proposes a list of Democrats or liberal groups to charge in retaliation, proposing Hunter Biden … ",
    "url": "https://nymag.com/intelligencer/2023/08/lock-them-up-is-now-the-republican-partys-highest-goal.html"
  },
  {
    "text": "George Santos Thinks ‘Most People’ Lie on Their Résumé Like Him  —  ‘INSECURITIES’  —  Rep. George Santos (R-NY) once again brushed off the scandal surrounding his serial lies, claiming in a Friday interview that most people lie on their résumés.",
    "url": "https://www.thedailybeast.com/george-santos-thinks-most-people-lie-on-their-resume-like-him"
  },
  {
    "text": "‘Pathetic’: Voters of color slam Biden's performance on the economy  —  “Our economy is the lowest it's been.”  —  In a focus group last week, eight men of color who voted for President Joe Biden in 2020 were asked to describe their feelings about the economy.  —  The answers were bleak.",
    "url": "https://www.politico.com/news/2023/08/18/bidens-reelection-economy-voters-of-color-00111730"
  },
  {
    "text": "Biden to sign strategic partnership deal with Vietnam in latest bid to counter China in the region  —  The new strategic partnership agreement opens the door to closer diplomatic, economic and technological cooperation with former foe — and China's neighbor — Hanoi.",
    "url": "https://www.politico.com/news/2023/08/18/biden-vietnam-partnership-00111939"
  },
  {
    "text": "Gen. Milley on Ukraine, Tuberville and ‘wokeness’  —  Good morning, Early Birds.  Sadly, a missed opportunity with this one-time real-life Barbie Dreamhouse.  But has anyone built the Mojo Dojo Casa House?  Tips: earlytips@washpost.com.  Was this forwarded to you?  Sign up here.",
    "url": "https://www.washingtonpost.com/politics/2023/08/18/gen-milley-ukraine-tuberville-wokeness/"
  },
  {
    "text": "Gavin Newsom's future hinges on San Francisco  —  Newsom has increasingly been moonlighting as a quasi-city executive of his hometown and approaching its woes as a litmus test for his success in Sacramento.  —  SAN FRANCISCO — Gavin Newsom hasn't been mayor of San Francisco for more than a decade … ",
    "url": "https://www.politico.com/news/2023/08/18/san-francisco-gavin-newsom-homeless-00111777"
  },
  {
    "text": "Microsoft says listing the Ottawa Food Bank as a tourist destination wasn't the result of ‘unsupervised AI’ … A Microsoft travel guide for Ottawa, Canada, prominently recommended tourists visit the Ottawa Food Bank, as spotted by Paris Marx until it was removed after this article was originally published.",
    "url": "https://www.theverge.com/2023/8/17/23836287/microsoft-ai-recommends-ottawa-food-bank-tourist-destination"
  }
]