[
  {
    "text": "Trump calls his globe-trotting ex-diplomat ‘my envoy.’ Neither is in office.  —  Richard Grenell is meeting with far-right foreign leaders, attacking President Biden and offering a glimpse at what U.S. foreign policy could be like in a second Trump term  —  After an anti-corruption crusader … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/28/richard-grenell-trump-envoy-serbia-guatemala/"
  },
  {
    "text": "Freedom Caucus chair faces primary peril  —  Good morning, Early Birds.  Our condolences to the friends and family of former Democratic senator Joseph I. Lieberman, who died Wednesday.  He was 82.  Tips: earlytips@washpost.com.  Was this forwarded to you?  Sign up here.  Thanks for waking up with us.",
    "url": "https://www.washingtonpost.com/politics/2024/03/28/freedom-caucus-chair-faces-primary-peril/"
  },
  {
    "text": "These 50 companies have donated over $23 million to election deniers since January 6, 2021  —  Donald Trump lost the 2020 election.  —  Then, according to the report of the bipartisan January 6 Commission, Trump engaged in a “multi-part conspiracy to overturn the lawful results of the 2020 Presidential election.”",
    "url": "https://popular.info/p/these-50-companies-have-donated-over"
  },
  {
    "text": "Jan. 6 Architect John Eastman Roasted By Judge In Disbarment Case  —  A lot of things happened.  Here are some of the things.  This is TPM's Morning Memo.  —  Thanks for reading Morning Memo!  Subscribe for free to receive new posts and support my work.  —  The Closest We Get To A Jan. 6 Verdict Before November?",
    "url": "https://morningmemo.talkingpointsmemo.com/p/jan-6-architect-john-eastman-roasted"
  },
  {
    "text": "Judge rules Georgia Republican Party vice chairman voted illegally  —  Brian K. Pritchard voted nine times while serving probation for felony forgery charges  —  A judge ruled Wednesday that the Georgia Republican Party's first vice chairman, Brian K. Pritchard, violated state election laws … ",
    "url": "https://www.ajc.com/politics/georgia-judge-rules-that-republican-brian-k-pritchard-voted-illegally/M4A27QQNQJDW7MTI66MRF5B4EQ/"
  },
  {
    "text": "How Greene's bid to topple Johnson could blow up the House — or in her own face  —  One House Republican summed up the fear: Her move could “deliver aid to Ukraine” by giving Johnson no choice but to seek common cause with Democrats.  —  Marjorie Taylor Greene's bid to vote … ",
    "url": "https://www.politico.com/news/2024/03/28/marjorie-taylor-greene-mike-johnson-ouster-00149325"
  },
  {
    "text": "States moving to require schools to show inaccurate fetus video  —  At least four states are considering legislation to follow North Dakota in mandating the showing of an animated fetal development video in elementary school classrooms.  —  The particular video suggested, Meet Baby Olivia … ",
    "url": "https://www.upi.com/Top_News/US/2024/03/28/north-dakota-iowa-baby-olivia-video-fetus-bill/1451711563174/"
  },
  {
    "text": "GOP scrambles to organize early and mail voting despite Trump's attacks  —  Republicans are playing catch-up to Democrats on voting before Election Day in battleground states, but Trump disparages those methods  —  In December, Donald Trump called for the end of mail-in voting in presidential elections.",
    "url": "https://www.washingtonpost.com/elections/2024/03/28/trump-mail-early-voting-republicans/"
  },
  {
    "text": "Trump Bibles make a mockery of Christianity — and that's exactly why MAGA will eat them up  —  Faith without morality or theology, much less that “soyboy” Jesus?  Sign MAGA Republicans up!  —  Earlier this week, Donald Trump unveiled his newest grift to squeeze money out of his cult followers: Trump-branded Bibles.",
    "url": "https://www.salon.com/2024/03/28/bibles-make-a-mockery-of-christianity--and-thats-exactly-why-maga-will-eat-them-up/"
  },
  {
    "text": "Judge Forges Ahead With Pretrial Motions In Trump Georgia Election Interference Case  —  Lawyers for Trump argued that the charges in the Georgia election interference case seek to criminalize speech that is protected by the First Amendment.  —  LOADING  —  The charges against former … ",
    "url": "https://www.huffpost.com/entry/georgia-election-indictment_n_6605562be4b05f4de327e927"
  },
  {
    "text": "Republican: ‘Outrageous’ for Biden to promise feds will pay for Baltimore bridge  —  Rep. Dan Meuser (R-Pa.) criticized President Biden on Thursday for pledging that the federal government will pay for the replacement of the Francis Scott Key Bridge in Baltimore, which collapsed earlier … ",
    "url": "https://thehill.com/homenews/house/4561463-republican-biden-baltimore-bridge-collapse/"
  },
  {
    "text": "Here's What It Would Look Like to Remove Judge Cannon  —  THE JUDGE PRESIDING OVER Donald Trump's classified documents prosecution just gave Special Counsel Jack Smith a gift that he desperately needed: a fresh opening to seek her removal from the case.  —  Last week, Judge Aileen Cannon … ",
    "url": "https://plus.thebulwark.com/p/what-it-would-look-like-to-remove-judge-cannon"
  },
  {
    "text": "CNN Exclusive: Conservative bigwig Matt Schlapp agreed to hefty settlement to end sexual assault lawsuit  —  The Republican operative who accused American Conservative Union chairman Matt Schlapp of sexual assault last year received a significant financial settlement in exchange for dropping … ",
    "url": "https://www.cnn.com/2024/03/27/politics/matt-schlapp-settlement-sexual-assault-lawsuit/"
  },
  {
    "text": "RFK Jr.'s vice presidential pick calls IVF 'one of the biggest lies being told about women's health'  —  She has weighed in on in-vitro fertilization many times through her nonprofit work.  —  Robert F. Kennedy Jr.'s running mate has been a harsh critic of in-vitro fertilization … ",
    "url": "https://www.politico.com/news/2024/03/28/robert-f-kennedy-vice-president-nicole-shanahan-ivf-00149523"
  },
  {
    "text": "Playbook: Biden's NYC money bomb  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  BRIGHT LIGHTS, BIG KITTY — President JOE BIDEN heads to the Big Apple tonight for a star-studded fundraising event with former Presidents BARACK OBAMA and BILL CLINTON and “Late Show” host STEPHEN COLBERT.",
    "url": "https://www.politico.com/newsletters/playbook/2024/03/28/bidens-nyc-money-bomb-00149501"
  },
  {
    "text": "Legal experts worry about presidential abuse of the Insurrection Act.  Here's why  —  A bipartisan group of legal experts is sounding an alarm about presidential power this election season.  —  They're pushing Congress to update a cluster of laws known as the Insurrection Act and limit … ",
    "url": "https://npr.org/2024/03/28/1241141939/insurrection-act"
  },
  {
    "text": "NBC Proves the Media Can't Save Democracy  —  The decision to hi former RNC chair is a symptom of a larger problem  —  Sometimes, a piece of news pops up that is so up my alley that I have so much to say/write/Tweet/Thread about it that I become paralyzed.",
    "url": "https://www.messageboxnews.com/p/nbc-proves-that-the-media-cant-save"
  },
  {
    "text": "Supreme Court delay prompts federal judges to act over South Carolina redistricting dispute  —  A lower court that ruled the district held by Rep. Nancy Mace, R-S.C., was racially gerrymandered has now said it can be used in this year's election following a months-long delay in the Supreme Court deciding the issue.",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-delay-prompts-federal-judges-act-south-carolina-redistri-rcna145267"
  },
  {
    "text": "Trump Attacks Judge's Daughter After Gag Order in Hush-Money Case  —  Donald Trump said a photo of him behind bars on Loren Merchan's X account meant he could not get a fair trial, but a court official said someone had appropriated the account.  —  It was an explosive claim from Donald J. Trump … ",
    "url": "https://www.nytimes.com/2024/03/27/nyregion/trump-social-media-attack.html"
  },
  {
    "text": "Tale of a Tampon  —  Scenes from a sit-in at Vanderbilt.  —  Let me tell you about some Vanderbilt girl's tampon.  —  It all started yesterday morning, when a wave of undergrad students rushed Kirkland Hall, where Vanderbilt's chancellor's office is located.",
    "url": "https://www.thefp.com/p/tale-of-a-tampon"
  },
  {
    "text": "Liz Cheney warns U.S. can't ‘survive’ another Donald Trump presidency  —  Rep. Liz Cheney, a one-time Wyoming lawmaker turned fierce critic of former President Donald Trump, said the Republican party is currently threatening democracy and that the nation is undergoing a political shift during … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/03/28/liz-cheney-warns-dangers-donald-trump-president/73129154007/"
  },
  {
    "text": "Does the Left Think Young Left-Wing Protesters Matter or Not? … This week, The Atlantic published an account of how the war between Israel and Hamas has convulsed a campus (in this case, that of the author, Stanford sophomore Theo Baker).  The most explosive details in the story showed … ",
    "url": "https://nymag.com/intelligencer/article/stanford-theo-baker-palestinian-protester-anti-semitism-israel-biden-campus.html"
  },
  {
    "text": "The slow death of Twitter is measured in disasters like the Baltimore bridge collapse  —  Twitter, now X, was once a useful site for breaking news.  The Baltimore bridge collapse shows those days are long gone.  —  Line up a few years' worth of tragedies and disasters … ",
    "url": "https://www.vox.com/technology/24113765/twitter-x-misinformation-baltimore-bridge-collapse"
  },
  {
    "text": "Trump Launches Fresh Attack on Judge's Daughter After Gag Order  —  Less than 24 hours after Donald Trump got hit with a gag order in his hush-money trial, he launched a fresh attack on the judge and his family.  —  In posts on Truth Social Wednesday morning, Trump blasted Judge Juan Merchan and his family … ",
    "url": "https://newrepublic.com/post/180183/trumps-wild-response-judges-gag-order-trumpy"
  },
  {
    "text": "Surge of new US-led oil and gas activity threatens to wreck Paris climate goals  —  World's fossil-fuel producers on track to nearly quadruple output from newly approved projects by decade's end, report finds  —  The world's fossil-fuel producers are on track to nearly quadruple the amount … ",
    "url": "https://www.theguardian.com/environment/2024/mar/28/oil-and-gas-fossil-fuels-report"
  },
  {
    "text": "Elon Musk gets SLAPPed  —  He got his ass handed to him in federal court for — irony alert! — trying to stifle speech.  —  Read →  —  Top First  —  CCDH: X provides ads appearing next to neo-Nazi content on the site.  —  MEDIA MATTERS: X provides ads appearing next to neo-Nazi content on the site.",
    "url": "https://www.publicnotice.co/p/elon-musk-ccdh-lawsuit-slapp-dismissed-explained/comments"
  },
  {
    "text": "MyPillow, owned by election denier Mike Lindell, formally evicted from Minnesota warehouse  —  A court ordered the eviction Wednesday of MyPillow from a suburban Minneapolis warehouse that it formerly used, but company founder and prominent election denier Mike Lindell said that it's … ",
    "url": "https://apnews.com/article/mike-lindell-mypillow-eviction-election-denier-11cd7e09f86f1ab03527281e51922730"
  },
  {
    "text": "Netanyahu doesn't deserve to address Congress again  —  Speaker of the House Mike Johnson (R-La.) announced that he is considering inviting Israel's Prime Minister Benjamin Netanyahu to address Congress.  Senate Majority Leader Chuck Schumer (D-N.Y.), who recently said Netanyahu “lost his way” … ",
    "url": "https://thehill.com/opinion/international/4559900-netanyahu-doesnt-deserve-to-address-congress-again/"
  }
]