[
  {
    "text": "Tim Scott drops out of the 2024 presidential race  —  The South Carolina senator has been stagnating in the polls for months despite spending big on early TV ads.  —  Sen. Tim Scott of South Carolina announced Sunday night that he is dropping out of the 2024 presidential campaign.",
    "url": "https://www.nbcnews.com/politics/2024-election/tim-scott-drops-2024-presidential-race-rcna124836"
  },
  {
    "text": "Sen. Tim Scott announces decision to suspend his 2024 presidential campaign  —  South Carolina Sen. Tim Scott announced Sunday he is suspending his 2024 presidential campaign on an episode of Fox News' “Sunday Night in America” with Trey Gowdy.  —  “I think the voters … ",
    "url": "https://www.foxnews.com/politics/sen-tim-scott-announces-2024-presidential-campaign"
  },
  {
    "text": "I Was Obama's 2012 Campaign Manager.  There's No Need to Panic Over Biden.  —  Don't sweat the doom and gloom polling.  We've been here before.  —  As you walk into my office, the first thing you see is a framed magazine cover.  It's not from the days of triumph — like in November 2012 … ",
    "url": "https://www.politico.com/news/magazine/2023/11/13/obama-2012-campaign-manager-advice-00126736"
  },
  {
    "text": "Here's How Biden Can Turn It Around  —  Top Democrats agree that the president needs more aggressiveness, more help from his friends and a few more friends.  Liz Cheney, Rahm Emanuel and Mitt Romney can help.  —  Just under one year before the presidential election, Democrats should be concerned … ",
    "url": "https://www.politico.com/news/magazine/2023/11/13/biden-2024-reelection-challenges-strategy-00126776"
  },
  {
    "text": "New book details Trump lawyers' secret meeting with Jack Smith ahead of DC indictment  —  ABC's Jonathan Karl offers an account of a fateful July 27 meeting in his forthcoming book.  —  Jack Smith's public image, shaped by his near invisibility since taking over the federal criminal cases … ",
    "url": "https://www.politico.com/news/2023/11/13/book-trump-lawyers-meeting-jack-smith-00126681"
  },
  {
    "text": "Scoop: Trump hung up on Kim Kardashian, new Jonathan Karl book says  —  Former President Trump hung up on Kim Kardashian when she called for help with a clemency case — because he assumed she voted for President Biden, ABC News' Jonathan Karl writes in “Tired of Winning,” out Tuesday.",
    "url": "https://www.axios.com/2023/11/13/trump-biden-white-house-kim-kardashian-book"
  },
  {
    "text": "Stephen Miller's “America First Legal” is more dangerous than you think  —  Miller is a clown.  But his organization is racking up wins advancing a deeply reactionary agenda. … You probably know Stephen Miller as an election denier, a perennial Fox News guest, and, most famously … ",
    "url": "https://www.publicnotice.co/p/stephen-miller-america-first-legal-explained"
  },
  {
    "text": "Trump calls political enemies ‘vermin,’ echoing dictators Hitler, Mussolini  —  On Veterans Day, the former president vowed to “root out” his liberal opponents, drawing backlash from historians who say his rhetoric is reminiscent of authoritarians  —  Former president Donald Trump denigrated … ",
    "url": "https://www.washingtonpost.com/politics/2023/11/12/trump-rally-vermin-political-opponents/"
  },
  {
    "text": "Behind the Curtain: Trump allies pre-screen loyalists for unprecedented power grab … - His top obsession will be the Justice Department, the FBI and the intelligence community — all of which he thinks conspired to investigate him, thwart him, screw him.",
    "url": "https://www.axios.com/2023/11/13/trump-loyalists-2024-presidential-election"
  },
  {
    "text": "How Moms for Liberty and a notorious English teacher exploited a high school student  —  On October 25, as Popular Information previously reported, two members of Moms for Liberty went to the Santa Rosa County Sheriff's Office in Florida and accused public school librarians of felonies … ",
    "url": "https://popular.info/p/how-moms-for-liberty-and-a-notorious"
  },
  {
    "text": "Sinema left the Democratic party.  Democratic donors left her too.  —  A POLITICO analysis of campaign finance data reveals a tough road ahead if the Arizona independent runs for reelection.  —  Democratic donors have fled Sen. Kyrsten Sinema since she left the party … ",
    "url": "https://www.politico.com/news/2023/11/13/kyrsten-sinema-donors-democrats-00126676"
  },
  {
    "text": "‘QAnon Shaman’ who stormed the Capitol on Jan. 6 files paperwork to run for Congress  —  Jacob Chansley, who served about 27 months in prison for his role in the Capitol attack, filed to run for the seat left vacant by Rep. Debbie Lesko, R-Ariz.  —  Jacob Chansley, the Arizona man known as the … ",
    "url": "https://www.nbcnews.com/politics/2024-election/qanon-shaman-stormed-capitol-jan-6-files-paperwork-run-congress-rcna124858"
  },
  {
    "text": "Israel-Hamas war live updates: Al Shifa hospital in Gaza no longer functioning, WHO says … Just now  —  Erin McLaughlin  —  TEL AVIV — The situation at Al-Shifa hospital in Gaza is “extremely difficult and dangerous,” the head of neurosurgery at the hospital told NBC News this morning.",
    "url": "https://www.nbcnews.com/news/world/live-blog/israel-hamas-war-live-updates-rcna124850"
  },
  {
    "text": "Trump's New York Trial Promises to Get Even Worse  —  Donald Trump's bank fraud trial is half-over.  But the epic showdown is now merely a prelude to an inevitable fight in New York's higher courts.  —  Halfway through Donald Trump's bank fraud trial in New York, the former president … ",
    "url": "https://www.thedailybeast.com/trumps-new-york-trial-promises-to-get-even-worse"
  },
  {
    "text": "Ex-PM David Cameron appointed foreign secretary in shock return to government  —  Summary  — Ex-PM David Cameron is made foreign secretary in a shock move as Rishi Sunak reshuffles his cabinet  — It is a remarkable return to government for the former Conservative prime minister, in office between 2010 and 2016",
    "url": "https://www.bbc.com/news/live/uk-politics-67370421"
  },
  {
    "text": "Scoop: Internal State Dept. memo blasts Biden, U.S. policy on Israel-Hamas war  —  An internal State Department dissent memo accuses President Biden of “spreading misinformation” on the Israel-Hamas war and alleges that Israel is committing “war crimes” in Gaza, according to a copy of the memo obtained by Axios.",
    "url": "https://www.axios.com/2023/11/13/biden-gaza-hamas-policy-state-department-memo"
  }
]