[
  {
    "text": "A “Delicate Matter”: Clarence Thomas' Private Complaints About Money Sparked Fears He Would Resign  —  Friends of the Court: SCOTUS Justices' Beneficial Relationships With Billionaire Donors  —  Supreme Court Justice Clarence Thomas' decadeslong friendship with real estate tycoon Harlan Crow … ",
    "url": "https://www.propublica.org/article/clarence-thomas-money-complaints-sparked-resignation-fears-scotus"
  },
  {
    "text": "Trump's rhetoric in final campaign sprint goes to new dark extremes  —  Donald Trump's rhetoric dropped to a spine-tingling new low this weekend with less than a month before the Iowa caucuses.  —  The GOP primary front-runner said migrants are “poisoning the blood” of the US … ",
    "url": "https://www.cnn.com/2023/12/18/politics/trump-campaign-rhetoric-new-extremes/"
  },
  {
    "text": "Trump polls shot upward after indictments started  —  TRUMP POLLS SHOT UPWARD AFTER INDICTMENTS STARTED.  Sometimes the poll numbers for former President Donald Trump look downright crazy.  Over the weekend, Fox News released a new national survey that showed Trump leading … ",
    "url": "https://www.washingtonexaminer.com/opinion/trump-polls-shot-upward-after-indictments-started"
  },
  {
    "text": "Pope approves blessings for same-sex couples if they don't resemble marriage  —  Pope Francis has formally approved allowing priests to bless same-sex couples, with a new document explaining a radical change in Vatican policy by insisting that people seeking God's love and mercy shouldn't be subject to … ",
    "url": "https://apnews.com/article/vatican-lgbtq-pope-bfa5b71fa79055626e362936e739d1d8"
  },
  {
    "text": "Testo in lingua inglese  —  On the Pastoral Meaning of Blessings  —  This Declaration considers several questions that have come to this Dicastery in recent years.  In preparing the document, the Dicastery, as is its practice, consulted experts, undertook a careful drafting process … ",
    "url": "https://press.vatican.va/content/salastampa/it/bollettino/pubblico/2023/12/18/0901/01963.html#en"
  },
  {
    "text": "Pope Francis Allows Priests to Bless Same-Sex Couples  —  A church official said the blessings amounted to “a real development” that nevertheless did not amend “the traditional doctrine of the church about marriage.”  —  The Vatican said Monday that Pope Francis had allowed priests … ",
    "url": "https://www.nytimes.com/2023/12/18/world/europe/pope-gay-lesbian-same-sex-blessing.html"
  },
  {
    "text": "Biden said to be increasingly frustrated by dismal poll numbers  —  In one recent meeting he said poll numbers were unacceptably low and he wanted to know what his team and his campaign were doing about it  —  The night before President Biden departed Washington to celebrate Thanksgiving on Nantucket … ",
    "url": "https://www.washingtonpost.com/politics/2023/12/18/joe-biden-polls-campaign/"
  },
  {
    "text": "President's Rating Hits Record Low  —  Biden gets especially poor marks on inflation and immigration; few Americans say he is paying enough attention to their concerns  —  West Long Branch, NJ - President Joe Biden's job rating has hit an all-time low in the Monmouth (\"Mon-muth\") … ",
    "url": "https://www.monmouth.edu/polling-institute/reports/monmouthpoll_US_121823/"
  },
  {
    "text": "Ziwe Exposes George Santos Once and for All in Scathing Sit-Down  —  In a nearly 20-minute interview, comedian Ziwe Fumudoh gave America the George Santos takedown it was waiting for.  —  It instantly became the most hotly anticipated—and dreaded?—political stunt of the year … ",
    "url": "https://www.thedailybeast.com/ziwe-exposes-george-santos-once-and-for-all-in-scathing-sit-down"
  },
  {
    "text": "Biden unharmed after car strikes president's motorcade in Delaware  —  It was not immediately clear why the sedan smashed into an SUV that was part of the motorcade.  The driver was surrounded by agents who had their guns drawn.  —  A sedan smacked into a Secret Service vehicle that was part … ",
    "url": "https://www.nbcnews.com/politics/politics-news/biden-unharmed-car-strikes-presidents-motorcade-delaware-rcna130189"
  },
  {
    "text": "Conservatives move to keep abortion off the 2024 ballot  —  “We don't believe those rights should be subjected to majority vote.”  —  Conservatives are testing new tactics to keep abortion off the ballot following a series of high-profile defeats.  —  In Arizona, Florida, Nevada and other states … ",
    "url": "https://www.politico.com/news/2023/12/18/first-rule-of-the-anti-abortion-playbook-dont-let-the-public-vote-on-abortion-00132049"
  },
  {
    "text": "Trump defends former influencer convicted of election interference who has racist, antisemitic past  —  Donald Trump and Donald Trump Jr. have come to the defense of a one time social media influencer who has been convicted of election interference and has a well-known history of pushing deeply racist … ",
    "url": "https://www.cnn.com/2023/12/18/politics/kfile-donald-trump-defends-former-influencer-racist-antisemitic-past/"
  },
  {
    "text": "No Labels Is Pushing a Lie That Will Elect Trump  —  There's no path to victory for a third-party candidate.  —  With a rematch between President Joe Biden and Donald Trump almost set in stone, it's time to put a farce to rest: The notion that a third-party candidate could actually win the presidency in 2024.",
    "url": "https://www.politico.com/news/magazine/2023/12/18/third-party-2024-no-labels-00132066"
  },
  {
    "text": "Southwest's $140M penalty ‘should put all airlines on notice’ after travel debacle  —  Last year's travel mess left 16,900 flights canceled and more than two million passengers stranded.  —  The Transportation Department is slapping Southwest Airlines with the largest consumer protection penalty … ",
    "url": "https://www.politico.com/news/2023/12/18/southwest-airlines-fine-2022-transportation-00132222"
  },
  {
    "text": "New York AG Ridicules Trump's Failed Courtroom Hail Marys  —  Donald Trump keeps asking a judge to hand him a total victory at his bank fraud trial.  The longshot strategy has failed miserably.  Now, the New York AG is tearing him apart for it.  —  The New York Attorney General's office … ",
    "url": "https://www.thedailybeast.com/new-york-ag-ridicules-trumps-failed-courtroom-hail-marys"
  },
  {
    "text": "Biden's daughter owes thousands in income taxes, lien documents show  —  Read this article for free!  —  Plus get unlimited access to thousands of articles, videos and more with your free account!  —  FIRST ON FOX: Ashley Biden, President Biden's daughter, owes $5,000 in income taxes beginning in 2015 … ",
    "url": "https://www.foxnews.com/politics/ashley-biden-owes-thousands-taxes-lien-documents-show?intcmp=tw_fnc"
  },
  {
    "text": "Vivek Ramaswamy tells CNN's Van Jones ‘Just shut the f-k up’ at Turning Point USA Americafest  —  Presidential candidate Vivek Ramaswamy suggested Sunday that CNN commentator Van Jones should “just shut the f-k up” in response to Jones labeling the brash Republican a “demagogue” earlier this month.",
    "url": "https://nypost.com/2023/12/18/news/vivek-ramaswamy-tells-cnns-van-jones-just-shut-the-f-k-up-at-turning-point-usa-americafest/"
  }
]