[
  {
    "text": "Trump Asks Supreme Court to Put Off Hearing Case on Immunity Claim  —  The former president urged the justices to move slowly in his federal election interference case, an apparent attempt to delay the trial, set for March.  —  Former President Donald J. Trump urged the Supreme Court … ",
    "url": "https://www.nytimes.com/2023/12/20/us/politics/trump-supreme-court-immunity.html"
  },
  {
    "text": "The Colorado Decision: Heads Trump Wins.  Tails America Loses.  —  1. The Sunshine State  —  I don't have a firm opinion about the Colorado Supreme Court's ruling that Donald Trump cannot appear on the state's presidential ballot.  —  As a matter of law, I can see it both ways.",
    "url": "https://plus.thebulwark.com/p/the-colorado-decision-heads-trump"
  },
  {
    "text": "Colorado Supreme Court justices face a flood of threats after disqualifying Trump from the ballot  —  The latest round of threats fits a familiar pattern: Trump faces a legal setback, and officials face threats.  —  In the 24 hours since the Colorado Supreme Court kicked former President Donald Trump off … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/colorado-justices-face-flood-threats-disqualifying-trump-ballot-rcna130720"
  },
  {
    "text": "Booting Trump off the ballot isn't just legally correct — it's the smart move for the Supreme Court  —  This is one of those rare situations where what's good for the country is also good for the GOP  —  Let's just get this out the way up front: If Donald Trump is removed from enough state ballots … ",
    "url": "https://www.salon.com/2023/12/20/booting-off-the-ballot-isnt-just-legally-correct--its-the-smart-move-for-the/"
  },
  {
    "text": "Lieutenant Governor Eleni Kounalakis Calls for Secretary of State Weber to Explore Legal Options to Remove Former President Donald Trump from California's 2024 Presidential Primary Ballot  —  Contact: Press@ltg.ca.gov, (916) 803-2191  —  SACRAMENTO - Today, Lieutenant Governor Eleni Kounalakis sent … ",
    "url": "https://ltg.ca.gov/2023/12/20/lt-governor-kounalakis-calls-for-secretary-of-state-weber-to-explore-legal-options-to-remove-former-president-donald-trump-from-californias-2024-presidential-primary-ballot/"
  },
  {
    "text": "4 takeaways from the Colorado Supreme Court's disqualifying Trump  —  Tuesday will go down as a momentous date in American political history, with the Colorado Supreme Court ruling that a former president engaged in insurrection and is therefore disqualified from the presidency.",
    "url": "https://www.washingtonpost.com/politics/2023/12/19/4-takeaways-colorado-supreme-courts-disqualifying-trump/"
  },
  {
    "text": "Jan. 6 rioter nabbed in Bumble dating app sting pleads guilty to assaulting officers  —  Andrew Taake was turned in by a Bumble user who used the dating app to try to illicit confessions from Donald Trump supporters who took part in the Capitol attack.  —  WASHINGTON — Nearly three years ago … ",
    "url": "https://www.nbcnews.com/politics/justice-department/jan-6-rioter-nabbed-bumble-dating-app-sting-pleads-guilty-assaulting-o-rcna130593"
  },
  {
    "text": "Capitol Rioter's High-School Classmate Gives Him Up to Feds  —  REVENGE OF THE NERDS  —  The FBI arrested a Minnesota man for his alleged role in the Jan. 6 riots after one of his high-school classmates told the feds he'd posted a selfie from the U.S. Capitol during the attack … ",
    "url": "https://www.thedailybeast.com/capitol-rioters-high-school-classmate-gives-him-up-to-feds"
  },
  {
    "text": "Speaker Mike Johnson and daughter were profiled attending ‘purity ball’ in 2015 German TV news segment  —  The unearthed segment is the latest example of Johnson's deeply held views.  —  A still image from a 2015 German news segment featuring Mike Johnson and his family.",
    "url": "https://abcnews.go.com/US/speaker-mike-johnson-daughter-profiled-attending-purity-ball/story?id=105785626"
  },
  {
    "text": "U.S. to free ally of Venezuela's Maduro in exchange for 36 prisoners -source  —  The government of Venezuelan President Nicolas Maduro plans to release up to 36 people, including up to 12 Americans, in exchange for the U.S. government's release of a Maduro ally, two Venezuelan sources said on Wednesday.",
    "url": "https://www.reuters.com/world/us/us-has-freed-close-ally-venezuela-president-swap-jailed-americans-ap-2023-12-20/"
  },
  {
    "text": "Yes, it's okay to compare Trump to Hitler.  Don't let me stop you.  —  Mike Godwin is an attorney and author in Washington.  —  My very minor status as an authority on Adolf Hitler comparisons stems from having coined “Godwin's Law” about three decades ago.",
    "url": "https://www.washingtonpost.com/opinions/2023/12/20/godwins-law-trump-hitler-comparisons/"
  },
  {
    "text": "House Republicans land last-minute Ohio recruit for key House race  —  House Republicans launched a last-minute scramble to recruit state Rep. Derek Merrin.  —  House Republicans may have found a way to salvage their flailing prospects in a crucial swing seat.",
    "url": "https://www.politico.com/news/2023/12/20/derek-merrin-ohio-00132746"
  },
  {
    "text": "Scoop: Warner Bros. Discovery in talks to merge with Paramount Global  —  Warner Bros. Discovery CEO David Zaslav met with Paramount Global CEO Bob Bakish on Tuesday in New York City to discuss a possible merger, Axios has learned from multiple sources.",
    "url": "https://www.axios.com/2023/12/20/warner-bros-paramount-merger-discovery-streaming"
  },
  {
    "text": "Matt Gaetz fundraises off the possibility that the House will expel him like Santos  —  Following the expulsion of former New York Rep. George Santos, Rep. Matt Gaetz (R-FL) is fundraising off the possibility that the House might come after him next.  —  In a fundraising email sent Dec. 13 … ",
    "url": "https://www.washingtonexaminer.com/news/house/following-santos-expulsion-gaetz-fundraises-possibility-house-expel-him"
  },
  {
    "text": "U.S. charges Hezbollah operative who allegedly planned 1994 Argentina bombing that killed 85  —  Washington — The Justice Department announced terrorism charges on Wednesday against an operative with the Lebanese terrorist group Hezbollah who allegedly helped plan the 1994 bombing of a Jewish community center in Argentina.",
    "url": "https://www.cbsnews.com/news/hezbollah-operative-charged-1994-argentina-bombing-samuel-salman-el-reda/"
  },
  {
    "text": "Pilot, photographer killed after Action News' Chopper 6 crashes in wooded area of New Jersey  —  The crew members have a long history with our station and have been working as part of the Action News team for years.  —  By, 6abc Digital Staff, Trish Hartman, Maggie Kent, and Katherine Scott",
    "url": "https://6abc.com/action-news-helicopter-6abc-chopper-6-crash-new-jersey-philadelphia-crew-wpvi-tv/14205051/"
  },
  {
    "text": "42 percent of GOP Iowa caucusgoers say ‘poisoning the blood’ remarks make them more likely to support Trump: poll  —  Forty-two percent of likely Iowa Republican caucusgoers said that former President Trump's recent remarks about immigrants “poisoning the blood” of the country makes … ",
    "url": "https://thehill.com/homenews/campaign/4370059-42-percent-of-gop-iowa-caucus-goers-say-poisoning-the-blood-remarks-make-them-more-likely-to-support-trump-poll/"
  },
  {
    "text": "Judge says Rudy Giuliani must pay $148 million judgment immediately  —  Rudy Giuliani must immediately pay the $148 million he owes two Georgia women he falsely accused of helping steal the 2020 election, a federal judge ruled Wednesday in a scathing order accusing the former Trump attorney of ongoing dishonesty.",
    "url": "https://www.washingtonpost.com/dc-md-va/2023/12/20/giuliani-judgment-pay-immediately/"
  }
]