[
  {
    "text": "Sheinbaum refutes Trump's border claim: 'Mexico's position is not to close borders'  —  Mexican President Claudia Sheinbaum pushed back on President-elect Trump's claim suggesting Mexico agreed to close its border with the U.S. “effectively immediately.”  —  “In our conversation with President Trump … ",
    "url": "https://thehill.com/policy/international/5014093-mexico-claudia-sheinbaum-donald-trump-border-comments/"
  },
  {
    "text": "Biden on Trump's tariff plan: ‘I hope he rethinks it’  —  President Biden said Thursday that he hopes President-elect Trump “rethinks” some of his tariff plans.  —  “I hope he rethinks it.  I think it's a counterproductive thing to do,” the president said in Nantucket, Mass. … ",
    "url": "https://thehill.com/homenews/administration/5014253-biden-trump-tariffs-canada-mexico/"
  },
  {
    "text": "Trump says Mexico's president has ‘agreed to stop’ migrants crossing into US through her country: ‘Very productive conversation!’  —  President-elect Donald Trump said Wednesday that he has received assurances from Mexico's new president that she will “stop migration” though her country and into the US … ",
    "url": "https://nypost.com/2024/11/27/us-news/trump-says-mexicos-president-has-agreed-to-stop-migrants-from-crossing-the-us-border-illegally/"
  },
  {
    "text": "Mexico warns Trump tariffs would kill 400,000 US jobs, threatens retaliation  —  Mexican President Claudia Sheinbaum said on Wednesday Mexico would retaliate if U.S. President-elect Donald Trump followed through with his proposed 25% across-the-board tariff, a move her government warned … ",
    "url": "https://www.reuters.com/markets/mexico-warns-trumps-tariff-would-kill-400000-us-jobs-2024-11-27/"
  },
  {
    "text": "Multiple Democrats say they were targeted by Thanksgiving bomb threats  —  Multiple Connecticut Democrats said they were targeted by bomb threats on their homes on Thanksgiving Day.  —  Rep. Jim Himes (D-Conn.) said on Thursday that he was notified of a bomb threat targeting his Connecticut home.",
    "url": "https://thehill.com/homenews/house/5014391-bomb-threats-connecticut-democrats/"
  },
  {
    "text": "Democratic members of Congress get bomb threats on Thanksgiving  —  The threats follow some to Trump's Cabinet selections earlier in the week.  —  The U.S. Capitol in Washington, Nov. 23, 2024.  —  The homes of multiple Democratic members of Congress in Connecticut were targeted by bomb threats on Thanksgiving Day.",
    "url": "https://abcnews.go.com/Politics/democratic-members-congress-bomb-threats-thanksgiving/story?id=116309053"
  },
  {
    "text": "Biden stresses gratitude while Trump targets enemies in Thanksgiving messages … - Trump's Thanksgiving message shows he feels no need to strike a more conciliatory tone as he returns to the White House.  — Biden has promised Trump a peaceful transition of power, while Trump has vowed … ",
    "url": "https://www.axios.com/2024/11/28/trump-biden-thanksgiving-messages"
  },
  {
    "text": "My Brother Is Doing the Trump Dance  —  I know that every year, some of you see this Thanksgiving column by my brother and think that it is actually I who am serving up this slab of red meat under the nom de plume of Kevin Dowd.  I can assure you that Kevin is very real and, this year, very excited.",
    "url": "https://www.nytimes.com/2024/11/28/opinion/donald-trump-presidency.html?unlocked_article_code=1.dU4.3pBX._0YSG6Zw0cE8&smid=url-share"
  },
  {
    "text": "Laura Loomer: Mark Zuckerberg's Trump Visit Was ‘Very Disturbing’  —  X MARKS THE SPOT  —  Loomer claimed Zuckerberg censored “the assassination attempt pictures of President Trump,” and then programmed Facebook to censor mentions of the same.  —  Far-right online personality Laura Loomer indulged … ",
    "url": "https://www.thedailybeast.com/laura-loomer-mark-zuckerbergs-trump-visit-was-very-disturbing/"
  },
  {
    "text": "Boise State Forfeits Against SJSU, Transgender Blaire Fleming In Stunning Show Of Protest  —  LAS VEGAS, NV - In a stunning turn of events, the Boise State Broncos women's volleyball team announced that it will forfeit its semifinal match in the Mountain West Tournament against San Jose State.",
    "url": "https://www.outkick.com/sports/boise-state-forfeit-sjsu-blaire-fleming-mountain-west-tournament"
  },
  {
    "text": "Statement from President Joe Biden on Russia's Attack on Ukraine  —  Overnight, Russia carried out a horrific aerial attack against Ukraine.  Ukrainian authorities report that Russia launched nearly 200 missiles and drones against Ukrainian cities and energy infrastructure, depriving Ukrainian civilians of access to electricity.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/11/28/statement-from-president-joe-biden-on-russias-attack-on-ukraine/"
  },
  {
    "text": "Ken Paxton vows to shut down Texas church's homeless ministry in new suit  —  The Texas attorney general, a Southern Baptist, has a history of suing organizations that seemingly don't align with his religious and political beliefs.  —  In announcing a lawsuit on Tuesday … ",
    "url": "https://www.chron.com/culture/religion/article/ken-paxton-austin-church-lawsuit-19946766.php"
  },
  {
    "text": "Conservative US influencer Candace Owens is barred from New Zealand weeks after a ban from Australia  —  The U.S. conservative political commentor Candace Owens was refused a visa to enter New Zealand for a speaking engagement because she had been banned from another country, immigration officials said Thursday.",
    "url": "https://apnews.com/article/candace-owens-zealand-australia-visa-eedd9b2f77a289b44a517719008f9730"
  },
  {
    "text": "Republicans Built an Ecosystem of Influencers.  Some Democrats Want One, Too.  —  Democrats were badly outflanked online in the election, and progressive influencers are now trying to create networks to be a left-wing answer to Turning Point USA.  —  Zackory Kirk, an influencer based … ",
    "url": "https://www.nytimes.com/2024/11/28/us/politics/democratic-influencers.html?unlocked_article_code=1.dU4.Mzxw.RGxGXv_8LVWR&smid=url-share"
  }
]