[
  {
    "text": "Tanks, troops and flyovers in D.C. as Trump gets his military parade  —  For its 250th birthday, the Army put on the largest show of military might in the capital in more than three decades.  —  Summary0  —  Planes roared over the heart of Washington on Saturday evening … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2025/06/14/army-parade-dc-trump-birthday-national-mall/"
  },
  {
    "text": "Man drives into crowd of protesters at ‘No Kings’ rally in Virginia  — Police say 21-year-old Joseph R. Checklick Jr. intentionally drove an SUV into a crowd of protesters in Culpeper, hitting at least one person.  — Checklick Jr. was arrested and charged with reckless driving … ",
    "url": "https://www.fox5dc.com/news/man-drives-crowd-protesters-no-kings-rally-virginia"
  },
  {
    "text": "‘No Kings’ rallies draw big crowds to protest Trump and his policies  —  Across the country, relatively few disruptions were reported during protests and marches where the mood ranged from joyful to defiant.  —  Summary2689  —  Americans turned out en masse in communities across the country Saturday … ",
    "url": "https://www.washingtonpost.com/nation/2025/06/14/no-kings-protests-anti-trump-rallies-us/"
  },
  {
    "text": "Fox News Hosts Gushed Over the Parade, With No Protests in Sight  —  Cable networks covered President Trump's Army parade on a busy day of protests, a political assassination and Middle East strikes.  ABC, CBS and NBC aired other programming on their affiliates.",
    "url": "https://www.nytimes.com/2025/06/14/business/media/trump-parade-tv-coverage.html"
  },
  {
    "text": "Trump's Military Birthday Parade Was a Gross Failure  —  The president's military parade, which reportedly cost up to $45 million, was short on attendees, long on political speeches  —  WASHINGTON — On Saturday, President Donald Trump held a hideously expensive military parade in Washington, D.C., on his birthday.",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-military-birthday-parade-dc-failure-1235365040/"
  },
  {
    "text": "Suspect in Minnesota Shooting Linked to Security Company, Evangelical Ministry  —  The alleged shooter is a 57-year-old white male; according to his ministry's website, he “sought out militant Islamists in order to share the gospel and tell them that violence wasn't the answer.”",
    "url": "https://www.wired.com/story/shooting-minnesota-melissa-hortman-vance-boelter/"
  },
  {
    "text": "What We Know About the Suspect in the Minnesota Lawmakers Shootings  —  The suspect, Vance Boelter, was appointed more than once to the Workforce Development Board, where he served with State Senator John A. Hoffman, who was shot on Saturday.  —  The man suspected of shooting … ",
    "url": "https://www.nytimes.com/2025/06/14/us/politics/minnesota-shootings-gunman-suspect.html"
  },
  {
    "text": "Minnesota rep killed made headlines days earlier over vote on benefits for illegal aliens  —  Hortman was the lone House Democrat to vote for the repeal as authorities investigate politically motivated attack  —  Minnesota Democratic Rep. Melissa Hortman, who was fatally shot on Saturday … ",
    "url": "https://www.foxnews.com/politics/minnesota-rep-killed-made-headlines-days-earlier-over-vote-benefits-illegal-aliens"
  },
  {
    "text": "Minnesota Gov. Tim Walz: former House speaker and husband killed in politically motivated shooting  —  Minnesota Gov. Tim Walz says former state House Speaker Melissa Hortman and her husband were killed in a politically motivated assassination.  A second lawmaker and his wife were shot and wounded.",
    "url": "https://apnews.com/article/minnesota-lawmakers-shot-d7983e1e4f1a7573a487cab1a98cd172"
  },
  {
    "text": "Rep. Melissa Hortman, killed in targeted attack, was a champion for Minnesotan families  —  Hortman worked closely with Gov. Tim Walz to enact policies that prioritized children and expanded protections for abortion and gender-affirming care  —  Melissa Hortman, a former Minnesota House speaker … ",
    "url": "https://19thnews.org/2025/06/rep-melissa-hortman-killed-in-targeted-attack-was-a-champion-for-minnesotan-families/"
  },
  {
    "text": "Trump reports over $600 million in income in latest financial disclosure  —  The president reported making millions from cryptocurrency, his golf properties, foreign licensing deals and other sources.  JD Vance also filed forms disclosing Bitcoin holdings.  —  Summary172",
    "url": "https://www.washingtonpost.com/politics/2025/06/14/trump-income-assets/"
  },
  {
    "text": "Israel urges U.S. to join war with Iran to eliminate nuclear program  —  Israel has asked the Trump administration over the past 48 hours to join the war with Iran in order to eliminate its nuclear program, according to two Israeli officials.  —  The big picture: Israel lacks the bunker buster bombs … ",
    "url": "https://www.axios.com/2025/06/14/israel-iran-war-us-nuclear-program-trump"
  },
  {
    "text": "Ancient miasma theory may help explain Health Secretary Robert F. Kennedy Jr.'s vaccine moves  —  Health Secretary Robert F. Kennedy Jr. has upended medical research and public health in the U.S. in many ways.  One of the ideas that could be influencing his overhaul of federal health agencies dates back to ancient Greece.",
    "url": "https://www.npr.org/sections/shots-health-news/2025/06/14/nx-s1-5429732/ancient-miasma-theory-may-help-explain-health-secretary-robert-f-kennedy-jr-s-vaccine-moves"
  },
  {
    "text": "Inside Trump's Extraordinary Turnaround on Immigration Raids  —  President Trump's decision to pause most raids targeting farms and hospitality workers took many inside the White House by surprise.  It came after intensive lobbying by his agriculture secretary.",
    "url": "https://www.nytimes.com/2025/06/14/us/politics/trump-immigration-raids-workers.html"
  },
  {
    "text": "Gunman Opens Fire on ‘No Kings’ Protest in Salt Lake City  —  ‘DEEPLY TROUBLING’  —  One person has been taken to the hospital with life-threatening injuries.  —  A gunman opened fire on thousands of protesters in Salt Lake City, Utah, on Saturday evening.",
    "url": "https://www.thedailybeast.com/gunman-opens-fire-on-no-kings-protest-in-salt-lake-city/"
  },
  {
    "text": "Trump administration considers adding 36 countries to travel ban list  —  An internal memo reviewed by The Post sets a 60-day deadline for the targeted nations to conform with certain requirements, or face a full or partial entry ban.  —  The United States is considering restricting entry … ",
    "url": "https://www.washingtonpost.com/national-security/2025/06/14/trump-travel-ban-expansion/"
  },
  {
    "text": "Trump Says He Decides What ‘America First’ Means  —  When I caught Donald Trump by phone this morning, the president wanted to make one thing clear: “America First” means whatever he says it does.  “Well, considering that I'm the one that developed ‘America First,’ and considering that the term … ",
    "url": "https://www.theatlantic.com/politics/archive/2025/06/trump-interview-iran-israel/683192/"
  },
  {
    "text": "GOP Senate Version of the Big Beautiful Bill Includes an Ugly Attack on Courts' Ability to Protect Constitutional Rights  —  A provision inserted into the Senate GOP version of Trump's “Big Beautiful Bill” would, if enacted, pose a serious threat to federal courts' ability to protect your constitutional rights.",
    "url": "https://reason.com/volokh/2025/06/14/gop-senate-version-of-the-big-beautiful-bill-includes-an-ugly-attack-on-courts-ability-to-protect-constitutional-rights/"
  }
]