[
  {
    "text": "Democrats are trying to pass a right-wing border bill, but the GOP won't let them  —  Senate negotiations revealed what some Democrats are willing to give up on immigration in 2024.  —  A bipartisan group of Senate negotiators has reached a $118 billion deal that trades sweeping border security measures … ",
    "url": "https://www.vox.com/politics/2024/2/5/24062710/senate-immigration-bill-border-security-ukraine-2024"
  },
  {
    "text": "Trump Now Falsely Claims He Didn't Endorse Immigration Bill Co-Author  —  Oklahoma Senator James Lankford, who helped draw up the immigration bill that Trump hates, received Trump's “Complete and Total Endorsement” in 2022.  —  Donald Trump said during an interview Monday that he did not endorse … ",
    "url": "https://www.thedailybeast.com/trump-now-falsely-claims-he-didnt-endorse-immigration-bill-co-author-james-lankford"
  },
  {
    "text": "Detention and that border ‘shutdown’: What's really in Biden's bipartisan immigration deal  —  Breaking down 12 major points in the border deal, including the parameters of a border shutdown, increased visas and work permits for asylum seekers.  —  The bipartisan border security deal that's headed … ",
    "url": "https://www.politico.com/news/2024/02/05/biden-bipartisan-immigration-deal-00139558"
  },
  {
    "text": "Nikki Haley Asks for Secret Service Protection After Increase in Threats  —  Former South Carolina governor is final hurdle between Trump and the Republican presidential nomination  —  AIKEN, S. C.—Republican presidential candidate Nikki Haley has applied for Secret Service protection … ",
    "url": "https://www.wsj.com/politics/elections/nikki-haley-asks-for-secret-service-protection-after-increase-in-threats-05b67a22?mod=followamazon"
  },
  {
    "text": "Chutkan contemplates Trump trial extending deep into 2024, as case remains in limbo  —  It was the judge's first acknowledgment that Trump's federal trial could could extend into the general election.  —  The judge presiding over Donald Trump's Washington, D.C. criminal case acknowledged Monday … ",
    "url": "https://www.politico.com/news/2024/02/05/chutkan-trump-trial-date-2024-00139665"
  },
  {
    "text": "Trump says he wants to debate Biden  —  The Republican National Committee decided in 2022 to withdraw from the quadrennial events set up by the Commission on Presidential Debates.  —  Former President Donald Trump said Monday that he wants to debate President Joe Biden ahead of November's general election.",
    "url": "https://www.nbcnews.com/politics/2024-election/donald-trump-says-wants-debate-joe-biden-rcna137340"
  },
  {
    "text": "King Charles III diagnosed with cancer, Buckingham Palace says  —  King Charles has been diagnosed with a form of cancer, says Buckingham Palace.  —  The type of cancer has not been revealed - it is not prostate cancer, but was discovered during his recent treatment for an enlarged prostate.",
    "url": "https://www.bbc.com/news/uk-68208157"
  },
  {
    "text": "King Charles III has cancer  —  Prince Harry due to fly in as British monarch steps back from “public-facing” aspects of his role.  —  LONDON — King Charles III has cancer, Buckingham Palace announced Monday evening, sending shockwaves through the British establishment.",
    "url": "https://www.politico.eu/article/king-charles-iii-has-cancer-royal-uk-buckingham-police/"
  },
  {
    "text": "Lauren Boebert gets restraining order against her ex-husband  —  U.S. Rep. Lauren Boebert asked for and received a temporary restraining order Friday against her ex-husband, Jayson Boebert.  —  The order also covers three of the former couple's four sons.  —  In requesting the order … ",
    "url": "https://coloradosun.com/2024/02/05/lauren-boebert-restraining-order-jayson-boebert/"
  },
  {
    "text": "Why Jack Smith wants to ‘clear the air’ in the classified documents case  —  Donald Trump “paints an inaccurate and distorted picture of events,” the special counsel tells Judge Aileen Cannon.  Will she care?  —  Though the classified documents case is playing out partly behind closed doors … ",
    "url": "https://www.msnbc.com/deadline-white-house/deadline-legal-blog/trump-classified-documents-case-jack-smith-filing-rcna137310"
  },
  {
    "text": "Look who moved in Nextdoor: another spying, suspicious, paranoid snoop  —  Are you bummed you weren't around when the Stasi ruled?  Do you wish you could've been one of Mao Zedong's millions of neighborhood snitches?  Maybe watch the Red Guards drag off your least favorite aunt?",
    "url": "https://www.washingtonpost.com/opinions/2024/02/05/nextdoor-suspicious-neighbors/"
  },
  {
    "text": "Larry David Breaks Georgia's Voting Law in ‘Curb Your Enthusiasm’  —  Comedy's crankiest star usually breaks social norms.  This time, he ran afoul of voting legislation passed in Georgia in 2021.  —  Television comedies like “Veep” and “Parks and Recreation” have long poked fun … ",
    "url": "https://www.nytimes.com/2024/02/05/us/politics/larry-david-curb-your-enthusiasm-georgia-voting.html"
  },
  {
    "text": "Supreme Court Shocker?  Here's What Happens if Trump Gets Kicked Off the Ballot  —  Legal scholars, national security experts and political analysts imagine the extraordinary fallout that would ensue.  —  “Increase its perceived public legitimacy”  —  “Rip the country apart”",
    "url": "https://www.politico.com/news/magazine/2024/02/05/predicting-the-fallout-if-the-supreme-court-throws-trump-off-the-ballot-00139381"
  },
  {
    "text": "Scientists Use Sea Sponges to Study Global Warming Back to 1700  —  Research on a long-lived but rarely seen species in the Caribbean is helping scientists piece together a revised history of climate change.  —  Since the dawn of the industrial age, our species has warmed the planet … ",
    "url": "https://www.nytimes.com/2024/02/05/climate/global-warming-sponges.html"
  },
  {
    "text": "A GOP Senate Candidate Blames “Liberal” Judges for His Labor Violations.  Just One Problem With That.  —  The judges were largely appointed by Republicans.  —  Bernie Moreno, the Trump-endorsed Republican candidate for US Senate in Ohio, focuses his campaign on a central theme.",
    "url": "https://www.motherjones.com/politics/2024/02/a-gop-senate-candidate-blames-liberal-judges-for-his-labor-violations-just-one-problem-with-that/"
  },
  {
    "text": "Biden appears to mix up Macron with French president Mitterrand, who died in 1996  —  President Biden on Sunday appeared to mix up French President Emmanuel Macron with Francois Mitterrand, the former president of France who died in 1996.  —  The apparent mix-up took place during … ",
    "url": "https://thehill.com/homenews/administration/4449805-biden-appears-to-mix-up-macron-with-french-president-mitterrand-who-died-in-1996/"
  },
  {
    "text": "Sarah Huckabee Sanders appoints man who had sex with a minor to top state post  —  Arkansas Gov. Sarah Huckabee Sanders (R), who has repeatedly pledged to “protect kids” with anti-LGBTQ+ laws, appointed a man to a top state prison post even though he had previously been fired from a local police force … ",
    "url": "https://www.lgbtqnation.com/2024/02/sarah-huckabee-sanders-appoints-man-who-had-sex-with-a-minor-to-top-state-post/"
  }
]