[
  {
    "text": "Donald Trump removed from Maine primary ballot by secretary of state  —  Maine barred Donald Trump from the primary ballot Thursday, making it the second state in the country to block the former president from running again under a part of the Constitution that prevents insurrectionists from holding office.",
    "url": "https://www.washingtonpost.com/politics/2023/12/28/maine-trump-primary-ballot/"
  },
  {
    "text": "Why Trump May Find Himself in Jail Sooner Than He Thinks  —  Donald Trump is doing his best to delay as many cases as possible.  But there's a simple reason Trump may find himself behind bars sooner than he thinks: Trump himself.  —  The countdown is on for Donald Trump's D.C. trial in March.",
    "url": "https://www.thedailybeast.com/why-trump-may-find-himself-in-jail-sooner-than-he-thinks"
  },
  {
    "text": "Trump Campaign Statement on Maine Secretary of State Ruling  —  “The Maine Secretary of State is a former ACLU attorney, a virulent leftist and a hyper-partisan Biden-supporting Democrat who has decided to interfere in the presidential election on behalf of Crooked Joe Biden.",
    "url": "https://www.donaldjtrump.com/news/73ef6b29-1fc9-4785-b064-d7c31962c3c0"
  },
  {
    "text": "Maine strips Trump from the ballot, inflaming legal war over his candidacy  —  Activists and voters have filed numerous lawsuits around the country claiming the former president is barred from office under the “insurrection clause.”  —  Maine's top election official ejected former President Donald Trump … ",
    "url": "https://www.politico.com/news/2023/12/28/maine-kicks-trump-off-ballot-under-14th-amendment-00133294"
  },
  {
    "text": "Maine Secretary of State Decision in Challenge to Trump Presidential Primary Petitions  —  Secretary of State Shenna Bellows issued the attached decision regarding three challenges brought by Maine voters to the nomination petition of Donald J. Trump, for the Republican primary for the President of the United States.",
    "url": "https://www.maine.gov/sos/news/2023/BellowsDecisionChallengeTrumpPrimaryPetitionsDec2023.html"
  },
  {
    "text": "Democrats go after GOP's ‘anti-history record’ with billboard ads  —  The Democratic National Committee (DNC) has launched four billboards in Iowa attacking Republican presidential candidates for their “anti-history record” as they spend the weekend campaigning in the Hawkeye state.",
    "url": "https://thehill.com/homenews/campaign/4381374-democratic-national-committee-desantis-haley-trump-2024-election-attack-gops-anti-history-record-billboard-ads/"
  },
  {
    "text": "Exclusive: Recordings, emails show how Trump team flew fake elector ballots to DC in final push to overturn 2020 election  —  Two days before the January 6 insurrection, the Trump campaign's plan to use fake electors to block President-elect Joe Biden from taking office faced a potentially crippling hiccup … ",
    "url": "https://www.cnn.com/2023/12/28/politics/recordings-trump-team-fake-elector-ballots/"
  },
  {
    "text": "Ohio's Republican governor vetoes trans care restriction and sports ban  —  Gov. Mike DeWine is one of only a few Republican governors to veto a restriction on transition-related care for minors or a ban on trans student athlete participation.  —  Ohio's governor vetoed a bill Friday … ",
    "url": "https://www.nbcnews.com/nbc-out/out-politics-and-policy/ohios-republican-governor-vetoes-trans-care-restriction-sports-ban-rcna131579"
  },
  {
    "text": "Public Christian schools?  Leonard Leo's allies advance a new cause  —  A tight-knit group of activists tied to Leo's non-profit network are rallying around an Oklahoma effort to create a public Catholic school.  —  POLITICO illustration by Emily Scherer/Photos by AP, Getty Images, iStock",
    "url": "https://www.politico.com/news/2023/12/29/oklahoma-public-christian-schools-00132534"
  },
  {
    "text": "New Year's resolutions for the media (and those who love to hate us)  —  A new year is coming, but many of the same old problems plague journalism.  So as we plow into 2024, join me in my intermittent tradition: New Year's resolutions for the news media.  This election-year edition includes … ",
    "url": "https://www.washingtonpost.com/opinions/2023/12/29/news-resolutions-2024/"
  },
  {
    "text": "The ‘wealth transfer’ from boomers won't save Gen X and millennials  —  Experts say baby boomers will give more than $50 trillion to their heirs.  But for many, health care costs will claim the bulk of that wealth.  —  The story goes that baby boomers are going to give tens of trillions … ",
    "url": "https://www.nbcnews.com/business/consumer/generational-wealth-transfer-baby-boomers-cant-save-gen-x-millennials-rcna128099"
  },
  {
    "text": "7 of the biggest medical breakthroughs in 2023  —  There were major breakthroughs in Alzheimer's and sickle cell treatment.  —  From the first-ever RSV vaccines to the first drug fully approved to treat Alzheimer's disease, here are seven of the biggest medical breakthroughs in 2023.",
    "url": "https://abcnews.go.com/Health/7-biggest-medical-breakthroughs-2023/story?id=105555925"
  },
  {
    "text": "Sunak's Approval Rating Hits Record Low Among UK Conservatives  — Premier's rating falls to minus 26.5 as Cabinet also flags  — British prime minister must hold election within 13 months  —  Rishi Sunak's approval rating among members of his own Conservative Party ended 2023 on a record low … ",
    "url": "https://www.bloomberg.com/news/articles/2023-12-29/sunak-s-approval-rating-hits-record-low-among-uk-conservatives"
  },
  {
    "text": "World population up 75 million this year, standing at 8 billion on Jan. 1  —  The world population grew by 75 million people over the past year and on New Year's Day it will stand at more than 8 billion people, according to figures released by the U.S. Census Bureau on Thursday.",
    "url": "https://apnews.com/article/world-population-census-bureau-growth-b2a32ff77b9f3ae977c943014fe2b853"
  },
  {
    "text": "Rep. Lucy McBath to switch districts due to Georgia redistricting  —  Rep. Lucy McBath (D-Ga.) announced Thursday that she will pursue election in Georgia's 6th District in 2024 after a federal judge approved a GOP-led redistricting plan, which changed her current 7th District seat to favor Republicans.",
    "url": "https://thehill.com/homenews/campaign/4380529-mcbath-switch-districts-georgia-redistricting/"
  }
]