[
  {
    "text": "‘No one involved in the effort thinks he has a path’: Biden insiders say the writing is on the wall  —  The set of Democrats who think he should reconsider his decision to stay in the race has grown to include aides, operatives and officials tasked with guiding his campaign to victory.",
    "url": "https://www.nbcnews.com/politics/2024-election/biden-reelection-insiders-no-path-debate-rcna161296"
  },
  {
    "text": "Some Biden Advisers Are Discussing How to Convince Him to Step Aside  —  Close allies of the president are developing a case for why he should end his re-election campaign, though it is not clear that the discussions have reached him.  —  Some longtime aides and advisers to President Biden … ",
    "url": "https://www.nytimes.com/2024/07/11/us/politics/biden-aides-campaign.html"
  },
  {
    "text": "Amid Doubts About Biden's Mental Sharpness, Trump Leads Presidential Race  —  Roughly 6 in 10 voters describe both Biden and Trump as ‘embarrassing’  —  Table of Contents Table of Contents  — Broad dissatisfaction with the 2024 campaign  — Other findings: Voter engagement … ",
    "url": "https://www.pewresearch.org/politics/2024/07/11/amid-doubts-about-bidens-mental-sharpness-trump-leads-presidential-race/"
  },
  {
    "text": "Playbook: What Obama and Pelosi are doing about Biden  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  This morning, we have a look at how, at a moment of unprecedented crisis for the Democratic Party, two of its most powerful and popular personalities … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/07/11/what-obama-and-pelosi-are-doing-about-biden-00167520"
  },
  {
    "text": "The Embattled Biden Campaign Tests Kamala Harris's Strength vs. Trump  —  The campaign is quietly carrying out a head-to-head survey of voters between the vice president and Donald Trump, in a sign of the uncertainty even atop the Democratic Party.  —  Under siege from fellow Democrats … ",
    "url": "https://www.nytimes.com/2024/07/11/us/politics/biden-kamala-harris-poll-trump.html"
  },
  {
    "text": "Republicans: No Fair Nominating Somebody Else! … The people most upset by efforts to replace Joe Biden as the Democratic nominee, after Biden and his immediate family, are in the Trump campaign.  Donald Trump's strategy is built around around portraying him as strong and virile … ",
    "url": "https://nymag.com/intelligencer/article/republicans-no-fair-nominating-somebody-else.html"
  },
  {
    "text": "Angry and stunned Democrats blame Biden's closest advisers for shielding public from full extent of president's decline  —  At a star-studded fundraiser for President Joe Biden in Los Angeles last month, George Clooney wasn't the only one who came away concerned about the president.",
    "url": "https://www.cnn.com/2024/07/11/politics/joe-biden-age-decline-democrats-angry/"
  },
  {
    "text": "This Is How You Know Trump Smells Victory  —  I'm used to Donald Trump being painfully loud, proudly obnoxious and, well, sort of bonkers.  I'm used to alligators-on-the-border Trump, sharks-in-the-water Trump, Hannibal Lecter Trump.  —  I'm not used to the Trump of the past two weeks … ",
    "url": "https://www.nytimes.com/2024/07/11/opinion/biden-trump-election-debate.html"
  },
  {
    "text": "Is Unfit to Lead Donald Trump Is Unfit to Lead  —  The editorial board is a group of opinion journalists  —  Next week, for the third time in eight years, Donald Trump will be nominated as the Republican Party's candidate for president of the United States.",
    "url": "https://www.nytimes.com/interactive/2024/07/11/opinion/editorials/donald-trump-2024-unfit.html"
  },
  {
    "text": "NYTimes Launders Its Own Agency  —  After having scolded the President that he “should leave the race” that Democratic primary voters elected him to run.  —  And having ordered the Democratic Party to “speak the [NYT's] plain truth to Biden,  —  And having ignored Trump's own actions in the meanwhile … ",
    "url": "https://www.emptywheel.net/2024/07/11/nytimes-launders-its-own-agency/"
  },
  {
    "text": "GOP Push To Fine Merrick Garland $10,000 A Day Over Biden Audio Fails  —  Rep. Anna Paulina Luna (R-Fla.), who pushed for the penalty, said she would try again when Congress returns.  —  LOADING  —  Some Republicans' effort to punish Attorney General Merrick Garland for withholding audio … ",
    "url": "https://www.huffpost.com/entry/gop-attempt-to-fine-garland-flops-in-house_n_669039ebe4b0c4c9f3a754d7"
  },
  {
    "text": "Civic Media  —  Statement regarding edits to the July 4th interview with President Biden  —  The Earl Ingram Show was one of two radio programs contacted by the Biden campaign following the June 27th debate to speak with President Biden.  The interview was recorded on July 3rd and aired … ",
    "url": "https://civicmedia.us/2024/07/11/statement-regarding-edits-to-the-july-4th-interview-with-president-biden"
  },
  {
    "text": "Exclusive: US and Germany foiled Russian plot to assassinate CEO of arms manufacturer sending weapons to Ukraine  —  US intelligence discovered earlier this year that the Russian government planned to assassinate the chief executive of a powerful German arms manufacturer that has been producing … ",
    "url": "https://www.cnn.com/2024/07/11/politics/us-germany-foiled-russian-assassination-plot/"
  },
  {
    "text": "The GOP Has Found A New Reason To Pawn Off America's Public Lands  —  Trump has endorsed a new party platform that tries to make a wildly unpopular idea more digestible to voters.  —  LOADING  —  Anti-federal land zealots across the country must be licking their chops.",
    "url": "https://www.huffpost.com/entry/gop-party-platform-public-lands_n_6690023fe4b0fb744167465b"
  },
  {
    "text": "Inflation continues to slow in the U.S., opening door to Fed rate cut  —  Consumer prices rose 3% in June, less than expected and down from May's rate, adding pressure on the Federal Reserve to lower interest rates.  —  Price increases slowed more sharply than expected in June … ",
    "url": "https://www.nbcnews.com/business/economy/inflation-rate-june-2024-interest-rate-cut-when-how-much-rcna160842"
  },
  {
    "text": "Dem-Appointed Judge Tosses Major Climate Case Against Oil and Gas Producers in Blow to Environmental Activists  —  A Baltimore judge tossed a landmark climate change lawsuit against more than two dozen oil and gas companies in a sizable defeat for environmental activists and Democrats that have touted the case.",
    "url": "https://freebeacon.com/energy/democratic-city-judge-tosses-major-climate-case-against-big-oil-in-blow-to-environmental-activists/"
  },
  {
    "text": "ABC's brutal ultimatum to George Stephanopoulos after his damning verdict on Joe Biden - as network plunged into ‘fully fledged crisis’  —  George Stephanopoulos was threatened with being taken off air if he didn't clarify his position on Joe Biden's ability to serve another four years, it is claimed.",
    "url": "https://www.dailymail.co.uk/news/article-13621789/ABC-ultimatum-George-Stephanopoulos-Joe-Biden-crisis.html"
  },
  {
    "text": "What Happened to Marco Rubio?  —  The GOP's Reaganite internationalist has remade himself for the Trump era.  —  What happened to the GOP's preacher of optimism and American uplift who, as Jeb Bush once said, “makes grown men cry”?  Its Reaganite internationalist and defense hawk, its champion of democracy?",
    "url": "https://www.politico.com/news/magazine/2024/07/11/what-happened-to-marco-rubio-00167637"
  },
  {
    "text": "‘Someone has to birth all the babies’: How the far right is crafting their plan for women  —  A strong theme pervaded the fourth National Conservatism Conference this year, wrote Sarah Jones for New York Magazine's “Intelligencer” on Thursday — and that is the restrictive vision they have for women in society.",
    "url": "https://www.rawstory.com/republican-women-2668725633/"
  },
  {
    "text": "IRS collects milestone $1 billion in back taxes from high-wealth taxpayers  —  The IRS announced Thursday that it has collected $1 billion in back taxes from high-wealth tax cheats — a milestone meant to showcase how the agency is making use of the money it received as part … ",
    "url": "https://apnews.com/article/irs-audits-wealthy-taxes-biden-treasury-b12a48b200834a7c9a04dc293e3273c2"
  }
]