[
  {
    "text": "Johnson weighs spending plan B as Elon Musk stokes opposition  —  Speaker Mike Johnson's leadership team is quietly discussing a plan B to fund the government amid conservative opposition and vocal criticism from incoming President Donald Trump's top ally Elon Musk.",
    "url": "https://www.politico.com/live-updates/2024/12/18/congress/johnsons-spending-plan-b-00195169"
  },
  {
    "text": "What Elon got wrong about the CR  —  With assists from POLITICO's Congress team  —  THE LATEST: House votes have been cancelled for the night as Speaker Mike Johnson regroups and tries to salvage a year-end spending plan after a mass Republican backlash led by billionaire businessman and presidential pal Elon Musk.",
    "url": "https://www.politico.com/newsletters/inside-congress/2024/12/18/what-elon-got-wrong-about-the-cr-00195226"
  },
  {
    "text": "Republicans scrap spending bill, under pressure from Trump and Musk  —  Unless Congress acts, a government shutdown deadline looms just past midnight Saturday.",
    "url": "https://www.washingtonpost.com/business/2024/12/18/government-shutdown-house-vote-cr/"
  },
  {
    "text": "Trump opposes funding bill, pushing government closer to a shutdown  —  Elon Musk joined a wave of right-wing fury against a bill to keep the government open.  Now, the president-elect says he wants big changes, too, before this weekend's deadline.  —  WASHINGTON — President-elect Donald … ",
    "url": "https://www.nbcnews.com/politics/congress/trump-opposes-funding-bill-pushing-government-closer-shutdown-rcna184745"
  },
  {
    "text": "Musk Kills Government Funding Deal, Demands Shutdown Until Trump Is Sworn In  —  The Republican megadonor bombarded X with lies about a stopgap bill that would have extended federal funding until the spring  —  Elon Musk, self-described “First Buddy” of President-elect Donald Trump … ",
    "url": "https://www.rollingstone.com/politics/politics-news/musk-trump-government-funding-deal-shutdown-1235211000/"
  },
  {
    "text": "Elon Musk fueled backlash to spending plan with false and misleading claims  —  The billionaire stirred Republicans into a frenzy with 100-plus posts on X.  —  A bipartisan deal to avert a government shutdown collapsed Wednesday amid a sustained campaign against the package led by billionaire Elon Musk … ",
    "url": "https://www.politico.com/news/2024/12/18/elon-musk-false-claims-cr-00195252"
  },
  {
    "text": "The Wrath of Trump: House Republicans Map a Case Against Liz Cheney  —  President-elect Donald J. Trump has never been shy about his desire to see his enemies punished.  But he often shows a measure of caution about taking credit for potential prosecutions himself.",
    "url": "https://www.nytimes.com/2024/12/18/us/politics/trump-liz-cheney-report.html"
  },
  {
    "text": "In Massive Twist, Trump's Georgia Case Might Not Be Dead Yet  —  Donald Trump's forthcoming presidency might not hinder the proceedings surrounding his Georgia election interference charges, according to an attorney for Fulton County District Attorney Fani Willis.",
    "url": "https://newrepublic.com/post/189537/donald-trump-georgia-case-proceed"
  },
  {
    "text": "California Declares an Emergency Over Bird Flu in Cattle  —  Officials have discovered the virus in 645 dairy herds, more than in any other state so far.  —  In a stark acknowledgment of the increasing seriousness of bird flu's spread, Gov. Gavin Newsom of California declared on Wednesday … ",
    "url": "https://www.nytimes.com/2024/12/18/health/bird-flu-emergency-california.html?unlocked_article_code=1.iU4.4Y1W.tTgy3PDgDIGw&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Four Ways to Unbend the Media's Knee  —  You've no doubt heard by now about ABC News capitulating to Donald Trump.  With the possible exception of FBI director Christopher Wray resigning before his term was up, this is the most depressing news since the election.",
    "url": "https://washingtonmonthly.com/2024/12/18/four-ways-to-unbend-the-medias-knee/"
  },
  {
    "text": "ABC's George Stephanopoulos was repeatedly warned not to use word ‘rape’ by producer — but said it anyway: sources  —  George Stephanopoulos was repeatedly told by his executive producer not to “use the word rape” before going on the air to discuss Donald Trump but the ABC News anchor ignored the warning … ",
    "url": "https://nypost.com/2024/12/18/media/abc-parent-disney-didnt-think-it-would-beat-trump-in-court-report/"
  },
  {
    "text": "Dow plunges more than 1,100 points and marked its longest losing streak since 1974  —  New York CNN  —  The Dow plunged Wednesday on a disappointing outlook from the Federal Reserve.  In the process, the blue-chip index extended its losing streak to 10 days — the longest such stretch since Gerald Ford was president.",
    "url": "https://www.cnn.com/2024/12/18/economy/dow-10-day-losing-streak/"
  },
  {
    "text": "‘Vile and heinous’: Michigan man admits to planning mass shootings targeting gay people  — An Owosso man faces up to life in prison after pleading guilty to plotting mass shootings to kill gay people.  — Mack Davis' plans were uncovered during a search of his home after he shot at his neighbors' properties over the summer.",
    "url": "https://www.fox2detroit.com/news/michigan-man-admits-planning-mass-shootings-targeting-gay-people"
  },
  {
    "text": "In reversal, key House panel votes to release Matt Gaetz ethics report  —  The House Ethics Committee secretly voted earlier this month to release its report into the conduct of former Rep. Matt Gaetz before the end of this Congress, according to multiple sources with knowledge of the matter.",
    "url": "https://www.cnn.com/2024/12/18/politics/matt-gaetz-ethics-report-committee/"
  },
  {
    "text": "LA Times owner asks editorial board to ‘take a break’ from writing about Trump - report  —  Billionaire Patrick Soon-Shiong, who said paper is ‘echo chamber’, also blocked paper's board from endorsing Harris  —  Patrick Soon-Shiong, the owner of the Los Angeles Times, reportedly asked … ",
    "url": "https://www.theguardian.com/media/2024/dec/18/la-times-patrick-soon-shiong-trump"
  },
  {
    "text": "Dems Troll ‘Vice President’ Trump as Musk Meddles With Government Funding Bill  —  WHO'S IN CHARGE?  —  The term “President Musk” also started trending on X, which he owns.",
    "url": "https://www.thedailybeast.com/dems-troll-vice-president-trump-as-musk-meddles-with-government-funding-bill/"
  },
  {
    "text": "Massie says he's opposing Johnson  —  Rep. Thomas Massie became the first House Republican to pledge not to back Mike Johnson in the upcoming speakership fight, saying Wednesday he will vote for someone else on Jan. 3.  The Kentucky conservative is known as a prominent Johnson critic … ",
    "url": "https://www.politico.com/live-updates/2024/12/18/congress/massie-says-hes-opposing-johnson-00195146"
  },
  {
    "text": "Trump's transition is happening over private emails.  Federal officials are nervous.  —  Agencies are weighing in-person requirement for sensitive data.  —  Federal officials say they're worried about sharing documents via e-mail with Donald Trump's transition team because the incoming officials … ",
    "url": "https://www.politico.com/news/2024/12/18/federal-officials-nervous-about-sending-data-to-trump-transition-private-emails-00195217"
  },
  {
    "text": "LA deputy mayor allegedly made bomb threat to City Hall  —  The FBI is investigating the Los Angeles deputy mayor of public safety after reports show he was allegedly tied to City Hall bomb threats made earlier this year.  —  Agents searched the home of Brian Williams on Tuesday for evidence of a connection.",
    "url": "https://thehill.com/homenews/state-watch/5047389-la-deputy-mayor-allegedly-made-bomb-threat-to-city-hall/"
  }
]