[
  {
    "text": "Louis Gossett Jr., 1st Black man to win supporting actor Oscar, dies at 87  —  Louis Gossett Jr., the first Black man to win a supporting actor Oscar and an Emmy winner for his role in the seminal TV miniseries “Roots,” has died.  He was 87.  —  Gossett's first cousin Neal L. Gossett told … ",
    "url": "https://apnews.com/article/louis-gossett-jr-dies-1e86e1441ec8b614a282f3de22490a07"
  },
  {
    "text": "Trump's actual record comes back to haunt him  —  This isn't 2016 anymore. … Donald Trump continued his Nazi-style rhetoric at his most recent campaign rally in Dayton, Ohio, warning that if he didn't win the presidential election, “it's going to be a bloodbath for the country.”",
    "url": "https://www.publicnotice.co/p/trump-policy-record-2024-entitlements-abortion"
  },
  {
    "text": "Biden threatens Russia with costs on Evan Gershkovich arrest anniversary  —  President Joe Biden said on Friday the U.S. will impose costs for Russia's “appalling attempts” to use Americans as bargaining chips in a statement to mark the one-year anniversary of Wall Street Journal reporter Evan Gershkovich's arrest in Russia.",
    "url": "https://www.reuters.com/world/biden-threatens-russia-with-costs-evan-gershkovich-arrest-anniversary-2024-03-29/"
  },
  {
    "text": "Trump can't remember much.  He hopes you won't be able to, either.  —  The Very Stable Genius is glitching again.  —  This week, he announced that he is not — repeat, NOT — planning to repeal the Affordable Care Act.  He apparently forgot that he had vowed over and over again to do exactly that … ",
    "url": "https://www.washingtonpost.com/opinions/2024/03/29/trump-collective-amnesia-campaign-strategy/"
  },
  {
    "text": "Americans Really Don't Like Trump's Health-Care Plans  —  Health care may turn out to be a major winning issue for Democrats.  —  Expanding access to health care has been a shared policy priority for Joe Biden and the former Democratic presidents who joined him onstage at a lucrative … ",
    "url": "https://www.theatlantic.com/ideas/archive/2024/03/biden-winning-health-care-trump/677912/"
  },
  {
    "text": "Anti-Israel protesters disrupt Biden's lavish NYC fundraiser with Obama, Clinton, where tickets went for up to $500K: ‘War pig’  —  Several waves of protesters disrupted President Biden's grandiose fundraiser at Radio City Music Hall Thursday, where he kicked it with former Presidents Barack Obama … ",
    "url": "https://nypost.com/2024/03/28/us-news/biden-holds-lavish-nyc-grassroots-fundraiser-with-obama-clinton-in-tow-tickets-going-for-up-to-500k/"
  },
  {
    "text": "Crystal Mason: Texas woman sentenced to five years over voting error acquitted  —  Appeals court rules Mason, now 49, did not know she was ineligible when she voted in 2016 and throws out conviction  —  The fight for democracy is supported by  —  A Texas appeals court has thrown … ",
    "url": "https://www.theguardian.com/us-news/2024/mar/28/crystal-mason-texas-woman-acquitted"
  },
  {
    "text": "Woman Who Received 5-Year Sentence in Voter Fraud Case Is Acquitted  —  A Texas appeals court reversed its earlier opinion that had upheld the conviction of Crystal Mason, who was found guilty of illegally casting a provisional ballot in 2016, even though she claimed she hadn't known she was ineligible to vote.",
    "url": "https://www.nytimes.com/2024/03/28/us/politics/crystal-mason-texas-voting-acquitted.html"
  },
  {
    "text": "Trump Has a Big Problem With GOP Voters  —  NOT DONE YET  —  The GOP primary has been effectively over for weeks, but voters are still showing up to cast their ballots for anyone but Donald Trump. … ZOMBIE PRIMARY  —  Donald Trump may believe the 2024 Republican presidential primary is done—but clearly, it's not done with him.",
    "url": "https://www.thedailybeast.com/trump-has-a-big-problem-with-gop-voters"
  },
  {
    "text": "Many GOP billionaires balked at Jan. 6.  They're coming back to Trump.  —  Elite donors are rediscovering their affinity for the former president over taxes — even as he vows to free Jan. 6 defendants, promises mass deportations and faces 88 felony charges",
    "url": "https://www.washingtonpost.com/politics/2024/03/29/trump-billionaires-gop-donors/"
  },
  {
    "text": "'They all say he's bad': Morning Joe astonished by number of Trump appointees who hate him  —  President Joe Biden was joined by two of his Democratic predecessors for a fundraiser that raked in more than $26 million, and MSNBC's Joe Scarborough pointed out that Donald Trump would never be able … ",
    "url": "https://www.rawstory.com/morning-joe-today-2667631465/"
  },
  {
    "text": "Trump sends message to Biden, Obama for missing NYPD officer's wake: Have to go ‘whether they like it or not’  —  Trump talks to Brian Kilmeade in exclusive interview after attending wake for officer Jonathan Diller  —  Former President Trump slammed President Biden during an exclusive interview with … ",
    "url": "https://www.foxnews.com/media/trump-sends-message-biden-obama-missing-nypd-officer-wake-go-whether-like"
  },
  {
    "text": "Scotland was ‘hoodwinked’ by Donald Trump, says former aide  —  Donald Trump flanked by his children and pipers on the official opening day of the Trump International Golf Links course in Aberdeenshire in 2012  —  The man who helped broker the deal for Donald Trump's first Scottish golf resort … ",
    "url": "https://www.bbc.com/news/uk-scotland-68069245"
  },
  {
    "text": "NYC's AI Chatbot Tells Businesses to Break the Law  —  The Microsoft-powered bot says bosses can take workers' tips and that landlords can discriminate based on source of income … In October, New York City announced a plan to harness the power of artificial intelligence to improve the business of government.",
    "url": "https://themarkup.org/news/2024/03/29/nycs-ai-chatbot-tells-businesses-to-break-the-law"
  },
  {
    "text": "Cesar Chavez's family to endorse Biden after RFK Jr. claims civil rights leader would've voted for him  —  President Biden is set to be endorsed Friday by members of Cesar Chavez's family — a mostly symbolic gesture, but one meant to send a signal to independent presidential candidate Robert F. Kennedy Jr. … ",
    "url": "https://www.cbsnews.com/news/cesar-chavez-family-endorse-biden-robert-kennedy-jr/"
  },
  {
    "text": "The real D.C. crime wave  —  Welcome to POLITICO's West Wing Playbook, your guide to the people and power centers in the Biden administration.  —  In a sense, it's a daring crime given that the aircraft and the individual traveling in its executive cabin are among the most heavily secured entities in the world.",
    "url": "https://www.politico.com/newsletters/west-wing-playbook/2024/03/28/the-real-d-c-crime-wave-00149591"
  },
  {
    "text": "Donald Trump, COVID-19, And The Francis Scott Key Bridge Calamity  —  Four years ago this week, it became clear that Donald Trump would husband emergency pandemic resources like ventilators and personal protective equipment for Republican-run states.  Or rather, Trump made it clear.",
    "url": "https://www.offmessage.net/p/trump-covid-francis-scott-key-bridge"
  },
  {
    "text": "Suicide Mission  —  What Boeing did to all the guys who remember how to build a plane  —  A Boeing Dreamlifter sits on the tarmac at their campus in North Charleston, South Carolina, May 30, 2023.  —  John Barnett had one of those bosses who seemed to spend most of his waking hours scheming to inflict humiliation upon him.",
    "url": "https://prospect.org/infrastructure/transportation/2024-03-28-suicide-mission-boeing/"
  },
  {
    "text": "Judge kills NJ's controversial ballot design for Senate primary  —  The judge ordered the use of office block ballots for the June primary, where candidates are placed together by the office they are seeking.  —  New Jersey's controversial ballot design that gives party-backed candidates … ",
    "url": "https://www.politico.com/news/2024/03/29/new-jersey-ballot-judge-senate-andy-kim-00149763"
  },
  {
    "text": "Biden-Harris Administration Finalizes Strongest Ever Greenhouse Gas Standards for Heavy-Duty Vehicles to Protect Public Health and Address the Climate Crisis While Keeping the American Economy Moving  —  WASHINGTON - Today, March 29, the U.S. Environmental Protection Agency announced final … ",
    "url": "https://www.epa.gov/newsreleases/biden-harris-administration-finalizes-strongest-ever-greenhouse-gas-standards-heavy"
  }
]