[
  {
    "text": "Trump's legal advisers urge him to cancel press conference to refute Georgia allegations: Sources  —  Trump had announced a plan to release info on alleged election interference.  —  Former President Donald Trump's promised press conference to refute the allegations in the indictment handed … ",
    "url": "https://abcnews.go.com/US/trumps-legal-advisers-urge-cancel-press-conference-refute/story?id=102336380"
  },
  {
    "text": "Indicted Ex-Trump Official's Weird ‘Witches’ Gripe Gets The Treatment Online … LOADING",
    "url": "https://www.huffpost.com/entry/jeff-clark-witches-post_n_64de19c1e4b0ce7f01200d7c"
  },
  {
    "text": "Ex-Trump Aide Says Trump's Use Of Word ‘Riggers’ Is A Racist Dog Whistle  —  “I do think that's deliberate,” said Alyssa Farah Griffin, Trump's former White House communications director.  —  LOADING  —  Former White House communications director Alyssa Farah Griffin said she believes … ",
    "url": "https://www.huffpost.com/entry/alyssa-farah-griffin-trump-riggers-racist_n_64ddf04de4b0b74956e4493d"
  },
  {
    "text": "Top Georgia Republicans dismiss pro-Trump calls to change pardon rules  —  X  —  Georgia's most powerful Republican politicians rejected pro-Donald Trump calls to change the state constitution to give the governor direct authority to pardon those convicted of crimes.",
    "url": "https://www.ajc.com/politics/politics-blog/top-georgia-republicans-dismiss-pro-trump-calls-to-change-pardon-rules/5HTMB46BDFBC5KWAHMXOLTPVAM/"
  },
  {
    "text": "Defend Trump and ‘Hammer’ Ramaswamy: DeSantis Allies Reveal Debate Strategy  —  Hundreds of pages of blunt advice, memos and internal polling were posted online by the main super PAC backing the Florida governor, offering an extraordinary glimpse into his operation's thinking.",
    "url": "https://www.nytimes.com/2023/08/17/us/politics/desantis-debate-strategy.html"
  },
  {
    "text": "Ron DeSantis debate memo urges him to defend Trump and take ‘a sledge-hammer’ to Vivek Ramaswamy  —  A memo authored by leaders of a pro-DeSantis super PAC outlined the “overarching goals” for Florida Gov. Ron DeSantis in next week's first GOP presidential primary debate.",
    "url": "https://www.nbcnews.com/politics/2024-election/desantis-debate-memo-urges-defend-trump-attack-ramaswamy-rcna100414"
  },
  {
    "text": "How Republicans overhype the findings of their Hunter Biden probe  —  The Fact Checker … — Rep. James Comer (R-Ky.), chairman of the House Oversight Committee, interview on Fox Business, May 11 … — Comer, interview on Newsmax, Aug. 10  —  The House Oversight Committee, led by Comer … ",
    "url": "https://www.washingtonpost.com/politics/2023/08/17/how-republicans-overhype-findings-their-hunter-biden-probe/"
  },
  {
    "text": "Texas woman charged with threatening to kill judge overseeing Trump case, Democratic congresswoman  —  Abigail Jo Shry, of Alvin, Texas, is accused of threatening to harm U.S. District Judge Tanya S. Chutkan and Rep. Sheila Jackson Lee (D-TX).  —  WASHINGTON — A Texas woman faces federal charges … ",
    "url": "https://www.wusa9.com/article/news/national/capitol-riots/texas-woman-charged-with-threatening-to-kill-judge-overseeing-trump-case-democrat-congresswoman-sheila-jackson-lee-tanya-chutkan/65-34a5a7c1-d049-4919-836a-755150d10ea7"
  },
  {
    "text": "As Xitter's Lawyer Stalled DOJ, Elon Musk Met with Jim Jordan (Twice!) and Kevin McCarthy  —  Elon Musk has been eerily quiet about being held in contempt by Beryl Howell since the DC Circuit opinion was first released on August 9.  —  It's not like him to pass up the opportunity to make an obnoxious comment.",
    "url": "https://www.emptywheel.net/2023/08/17/as-xitters-lawyer-stalled-doj-elon-musk-met-with-jim-jordan-twice-and-kevin-mccarthy/"
  },
  {
    "text": "Why Democrat Dean Phillips says Biden shouldn't run  —  The Minnesota Democrat said he is worried a Biden candidacy will lead to another Donald Trump presidency  —  Rep. Dean Phillips has nothing but good things to say about President Biden's time in office, supporting his policies … ",
    "url": "https://www.washingtonpost.com/politics/2023/08/17/phillips-biden-trump/"
  },
  {
    "text": "Purported names, photos and addresses of Fulton County grand jurors circulate on far-right internet  —  Names, photographs, social media profiles and even the home addresses purportedly belonging to members of the Fulton County grand jury that this week voted to indict former President Donald Trump … ",
    "url": "https://www.cnn.com/2023/08/17/politics/fulton-county-grand-jurors-far-right-internet/"
  },
  {
    "text": "Rudy Giuliani made desperate appeal to Trump to pay his legal bills in Mar-a-Lago meeting  —  With his attorney in tow, Rudy Giuliani traveled to Mar-a-Lago in recent months on a mission to make a personal and desperate appeal to former President Donald Trump to pay his legal bills.",
    "url": "https://www.cnn.com/2023/08/16/politics/giuliani-trump-legal-bills/"
  },
  {
    "text": "Rudy Giuliani pocketed $300,000 from farmers investing in anti-Biden documentary that was never made, lawsuit claims  — A lawsuit claims Rudy Giuliani was paid $300,000 while pitching investors on an anti-Biden film.  — Giuliani allegedly said it would be a “kill shot” that would sink Joe Biden's campaign.",
    "url": "https://www.businessinsider.com/rudy-giuliani-biden-documentary-scam-money-lawsuit-2023-8?op=1"
  },
  {
    "text": "You Could See The Appeals Court Ruling on the Abortion Pill Coming From a Mile Away  —  Now, all the lawyers seeking to ban mifepristone will need to do is talk very fast and use the word “abortifacient” a lot.  —  Cassandra got a very raw deal.  She was always right and her curse … ",
    "url": "https://www.esquire.com/news-politics/politics/a44833443/mifepristone-appeals-court-ruling-restrictions-ban/"
  },
  {
    "text": "Will Trump have his mug shot taken?  —  X  —  Will Donald Trump have his mug shot taken by the Fulton County Sheriff's Office?  He's been spared that indignity in all three of his previous criminal cases.  —  But that might change now that he's been charged in Georgia.",
    "url": "https://www.ajc.com/news/will-trump-have-his-mug-shot-taken/GVBPHPM7VZBERCORLRK2OT472Y/"
  },
  {
    "text": "How Trump Could Pull Off the Ultimate Upstage of the Republican Debate  —  He has 10 days to surrender and one of those days would crush the first debate.  —  ∙ Paid  —  1. Prime Time  —  From the time of his (latest) indictment, Donald Trump has 10 days to surrender himself to the authorities in Fulton County.",
    "url": "https://thetriad.thebulwark.com/p/what-if-trump-upstages-the-republican"
  },
  {
    "text": "Hurricane Hilary could be first tropical storm to hit California in 84 years  —  Tropical Storm Hilary strengthened into a hurricane Thursday, with forecasters warning it could potentially bring devastating rainfall and high winds to Southern California this weekend.",
    "url": "https://thehill.com/policy/energy-environment/4156774-hurricane-hilary-could-be-first-tropical-storm-to-hit-california-in-84-years/"
  },
  {
    "text": "Hawaiian Electric Knew of Wildfire Threat, but Waited Years to Act  —  Four years ago, the utility said it needed to do more to prevent its power lines from emitting sparks.  It made little progress, focusing on a shift to clean energy.",
    "url": "https://www.wsj.com/us-news/wildfire-risk-maui-hawaiian-electric-7beed21e"
  },
  {
    "text": "Pence world poised for a showdown with Trump  —  'We've been waiting for this for a while,' the former vice president's senior adviser told POLITICO.  —  INDIANAPOLIS — Mike Pence tosses out a now well-honed line whenever he's asked how he could go from loyally defending Donald Trump to throwing spears at him on the debate stage.",
    "url": "https://www.politico.com/news/2023/08/17/pence-debate-showdown-trump-00111589"
  }
]