[
  {
    "text": "Voters don't have a clue about how much worse Trump's second term would be  —  Gameli Fenuku, a 22-year-old Black college student in Richmond, Va. is exactly the demographic you'd think would never vote for Donald Trump in November — and indeed he may not.  But Fenuku told the New York Times … ",
    "url": "https://www.inquirer.com/columnists/trump-47-second-term-dangers-authoritarianism-20240314.html#loaded"
  },
  {
    "text": "Judge denies one of Trump's motions to dismiss classified documents case  —  U.S. District Judge Aileen Cannon issued the ruling after hearing daylong arguments from lawyers for the former president and special counsel Jack Smith's office.  —  FORT PIERCE, Fla. — The judge presiding … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-florida-classified-documents-dismiss-rcna143135"
  },
  {
    "text": "Manhattan D.A. Offers to Delay Trump Hush-Money Trial for Review of Records  —  The proposal by the Manhattan district attorney's office came in response to Donald J. Trump's request for a 90-day delay to allow his lawyers time to review a new batch of records.",
    "url": "https://www.nytimes.com/2024/03/14/nyregion/alvin-bragg-trump-trial-delay.html"
  },
  {
    "text": "Judge appears skeptical of Trump's bid to dismiss his classified documents prosecution  —  A federal judge appeared reluctant Thursday to dismiss the classified documents prosecution of Donald Trump after his lawyers argued for hours that the case trampled on the former president's rights.",
    "url": "https://apnews.com/article/trump-classified-documents-maralago-presidential-records-200d4c73d7c7dd75d9c9d878b77d05ce"
  },
  {
    "text": "Ex-Trump White House official convicted of contempt must report to prison, appeals court finds  —  An appeals court denied Trump White House official Peter Navarro 's bid to stave off his jail sentence on contempt of Congress charges Thursday.  Navarro has been ordered to report to a federal prison by March 19.",
    "url": "https://apnews.com/article/trump-white-house-official-jan-6-contempt-8c28224fcde49e784708a1b9444076d7"
  },
  {
    "text": "Judge Denies One of Trump's Efforts to Derail Documents Case  —  With the former president in attendance, Judge Aileen Cannon held a hearing in federal court in Florida to weigh some of Donald Trump's motions to have the classified documents case dismissed.  —  The federal judge overseeing … ",
    "url": "https://www.nytimes.com/2024/03/14/us/politics/trump-classified-documents-case.html"
  },
  {
    "text": "Rep. Matt Gaetz subpoenaed in defamation suit by woman he allegedly had sex with as minor: Sources  —  Gaetz could be asked under oath about the allegations involving a minor.  —  Rep. Matt Gaetz asks questions during a House Judiciary Committee hearing on Capitol Hill in Washington, D.C., on July 13, 2023.",
    "url": "https://abcnews.go.com/US/rep-matt-gaetz-subpoenaed-defamation-suit-woman-allegedly/story?id=108098265"
  },
  {
    "text": "Matt Gaetz subpoenaed in friend's lawsuit accusing others of defamation in sex trafficking probe  —  The Justice Department has told the Florida Republican that he will not face any charges as a result of its probe.  Gaetz is not a direct party to the defamation lawsuit.",
    "url": "https://www.nbcnews.com/politics/congress/matt-gaetz-subpoenaed-friends-lawsuit-accusing-others-defamation-sex-t-rcna143489"
  },
  {
    "text": "GOP nominee to run North Carolina public schools called for violence against Democrats, including executing Obama and Biden  —  The Republican nominee for superintendent overseeing North Carolina's public schools and its $11 billion budget has a history marked by extreme and controversial comments … ",
    "url": "https://www.cnn.com/2024/03/14/politics/kfile-gop-nominee-north-carolina-public-schools-michele-morrow-executing-democrats/"
  },
  {
    "text": "Bernie Sanders pushes bill to establish a four-day workweek  —  The Sanders-led bill would reduce the standard workweek from 40 to 32 hours over four years and protect workers' pay and benefits.  —  Sen. Bernie Sanders, I-Vt., held a hearing Thursday on a bill he introduced to reduce … ",
    "url": "https://www.nbcnews.com/politics/congress/bernie-sanders-pushes-bill-establish-four-day-workweek-rcna143354"
  },
  {
    "text": "Jury reaches verdict in James Crumbley's involuntary manslaughter trial  —  Crumbley was charged in connection with son Ethan's 2021 school shooting at Oxford High School in Michigan.  His wife, Jennifer, was convicted on the same charge.  —  PONTIAC, Mich. — The 12 jurors weighing the fate … ",
    "url": "https://www.nbcnews.com/news/us-news/verdict-james-crumbley-involuntary-manslaughter-trial-rcna143174"
  },
  {
    "text": "Biden is coming out in opposition to plans to sell US Steel to a Japanese company  —  WASHINGTON (AP) — President Joe Biden is coming out in opposition to the planned sale of U.S. Steel to Nippon Steel of Japan, saying in a statement to be released Thursday that the U.S. needs to … ",
    "url": "https://apnews.com/article/biden-steel-nippon-kishida-merger-purchase-201b3d5719bcf77067cb81d181442afb"
  },
  {
    "text": "A Third Tie between Trump World and Alexander Smirnov  —  Before I point to a report on third known link between Alexander Smirnov — the FBI informant whose allegedly false claims about Joe Biden were laundered through a process Bill Barr set up for Rudy Giuliani in 2020 — and Donald Trump … ",
    "url": "https://www.emptywheel.net/2024/03/14/a-third-tie-between-trump-world-and-alexander-smirnov/"
  },
  {
    "text": "Schumer's anti-Netanyahu speech stuns Israel … - Schumer's speech stunned officials and observers in both Washington and Jerusalem because he has been — and still is — the Democratic Party's most avid supporter of Israel in decades.  — His harsh remarks about Netanyahu create … ",
    "url": "https://www.axios.com/2024/03/14/schumer-israel-netanyahu-speech-reaction"
  },
  {
    "text": "More Counties Saw Population Gains in 2023  —  Note: Data will be available before 8 a.m. ET on public release day.  —  MARCH 14, 2024 - More U.S. counties experienced population gains than losses in 2023, as counties in the South saw faster growth and more Northeast and Midwest counties … ",
    "url": "https://www.census.gov/newsroom/press-releases/2024/population-estimates-more-counties-population-gains-2023.html"
  },
  {
    "text": "Trump-backed Senate candidate faces GOP worries that he could be linked to adult website profile  —  For Republicans eager to regain the Senate majority this year, Ohio offers a prime opportunity to pick up a critical seat.  But ahead of Tuesday's primary election, there's mounting anxiety inside … ",
    "url": "https://apnews.com/article/ohio-senate-election-2024-bernie-moreno-09e34f6331708c192c89d7c1727c2458"
  },
  {
    "text": "Democrat says green pin ditched by GOP had hidden message … House Republican leaders spent a reported $40,000 in January to replace the official pin given to all members to show they had been sworn into the 118th Congress — a midterm expense driven by a confluence of factors … ",
    "url": "https://www.eenews.net/articles/democrat-says-green-pin-ditched-by-gop-had-hidden-message/"
  },
  {
    "text": "At Abortion Clinic Visit, Harris Says U.S. Is Confronting ‘Health Care Crisis’  —  The trip made history and offered a vivid look at how the politics of abortion rights have transformed since the Supreme Court overturned Roe v. Wade.  —  Vice President Kamala Harris described the flood … ",
    "url": "https://www.nytimes.com/2024/03/14/us/politics/kamala-harris-abortion.html"
  },
  {
    "text": "EXCLUSIVE: Female Athletes Sue NCAA Over Transgender Competitors in Sports  —  ‘I was racing Olympic gold medalists and I was changing in a storage closet.  My privacy and safety were being violated in the locker room.’  —  Over a dozen female athletes are suing the National Collegiate Athletics Association … ",
    "url": "https://www.thefp.com/p/exclusive-female-athletes-sue-ncaa-transwomen"
  },
  {
    "text": "Supreme Betrayal  —  A requiem for Section 3 of the Fourteenth Amendment  —  The Supreme Court of the United States did a grave disservice to both the Constitution and the nation in Trump v. Anderson.  —  In a stunning disfigurement of the Fourteenth Amendment, the Court impressed upon … ",
    "url": "https://www.theatlantic.com/ideas/archive/2024/03/supreme-court-trump-v-anderson-fourteenth-amendment/677755/"
  },
  {
    "text": "CEO of Data Privacy Company Onerep.com Founded Dozens of People-Search Firms  —  The data privacy company Onerep.com bills itself as a Virginia-based service for helping people remove their personal information from almost 200 people-search websites.  However, an investigation into the history … ",
    "url": "https://krebsonsecurity.com/2024/03/ceo-of-data-privacy-company-onerep-com-founded-dozens-of-people-search-firms/"
  },
  {
    "text": "Fulton County judge says Fani Willis disqualification ruling ‘should be out tomorrow’  —  “These kind of orders take time to write,” the judge said.  —  Fulton County District Attorney Fani Willis looks on during a hearing on the Georgia election interference case, March, 1, 2024, in Atlanta.",
    "url": "https://abcnews.go.com/Politics/fulton-county-judge-fani-willis-disqualification-ruling-tomorrow/story?id=108137448"
  },
  {
    "text": "2024 Michigan: Trump Leads Biden In 5-Way Race, On Upside Of Too-Close-To-Call 2-Way Race, Quinnipiac University Michigan Poll Finds; 79% Of Dems Want Gov. Whitmer To Run For President In The Future  —  mail_outline  —  With the 2024 general election campaigns underway … ",
    "url": "https://poll.qu.edu/poll-release?releaseid=3893"
  }
]