[
  {
    "text": "On a Scrambled 2024 Map, North Carolina Democrats Say Harris Has a Shot  —  As Kamala Harris visits to unroll her economic agenda, Democrats in the state are feeling hopeful.  Working against her is over four decades of Republican victories, interrupted only by Barack Obama.",
    "url": "https://www.nytimes.com/2024/08/16/us/politics/kamala-harris-north-carolina.html"
  },
  {
    "text": "5 striking new poll numbers amid Harris's rise  —  What we've learned about enthusiasm, running mates and down-ballot races in recent days.  —  A large batch of polls this week confirmed Vice President Kamala Harris's rise in the 2024 presidential race and suggests it has continued.",
    "url": "https://www.washingtonpost.com/politics/2024/08/15/5-striking-new-poll-numbers-amid-harriss-rise/"
  },
  {
    "text": "How Harris Has Completely Upended the Presidential Race, in 14 Maps  —  With Kamala Harris now at the top of the ticket, the enthusiasm and confidence within the Democratic Party feel stronger than at any point I've seen since Barack Obama ran for president in 2008.",
    "url": "https://www.nytimes.com/interactive/2024/08/16/opinion/harris-trump-electoral-college-map.html?unlocked_article_code=1.DU4.8g43.y4Py7KogJAVh&smid=url-share"
  },
  {
    "text": "Harris has opened up a second path to victory, according to The Post's polling model  —  The Democratic nominee could win in the Rust Belt or the Sun Belt and get to the White House, while Donald Trump must win in both geographic regions to triumph.  —  A lot has changed in the presidential race … ",
    "url": "https://www.washingtonpost.com/politics/2024/08/15/kamala-harris-polling-electoral-college-polling-model-donald-trump/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzIzNjk0NDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI1MDc2Nzk5LCJpYXQiOjE3MjM2OTQ0MDAsImp0aSI6IjYxYjQ1NzRiLTc4YTQtNDA1NS05NDk0LTY2YjAyNjI0NmI2YSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzA4LzE1L2thbWFsYS1oYXJyaXMtcG9sbGluZy1lbGVjdG9yYWwtY29sbGVnZS1wb2xsaW5nLW1vZGVsLWRvbmFsZC10cnVtcC8ifQ.F8UT0Xn_3aVoCGHqZDOi_ZWgqDXr88WdtOJNYfSuBUE&itid=gfta"
  },
  {
    "text": "FACT FOCUS: Trump blends falsehoods and exaggerations at rambling NJ press conference  —  Former President Donald Trump on Thursday gave his second news conference in as many weeks as he adjusts to a newly energized Democratic ticket ahead of next week's Democratic National Convention.",
    "url": "https://apnews.com/article/trump-press-conference-new-jersey-misinformation-fact-check-f8ed52f64a12cf450b0d0f2591c9d92b"
  },
  {
    "text": "Trump Warns That if Kamala Harris Wins, ‘Everybody Gets Health Care’  —  Donald Trump repeatedly lies about single-payer health care — an idea he and Harris both previously supported but no longer do … Vice President Kamala Harris did, too.  Neither candidate backs the idea now.",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-kamala-harris-wins-everybody-gets-health-care-1235081328/"
  },
  {
    "text": "A Trump official criticized the media for talking “about Project 2025, which has nothing to do with our campaign.”  She worked on Project 2025.  —  During a recent interview, Trump National Press Secretary Karoline Leavitt criticized the media for talking “about Project 2025, which has nothing to do with our campaign.”",
    "url": "https://www.mediamatters.org/project-2025/trump-official-karoline-leavitt-criticized-media-talking-about-project-2025-which-has"
  },
  {
    "text": "Trump to resume outdoor rallies with bulletproof glass  —  The U.S. Secret Service is arranging for former President Donald Trump to resume outdoor campaign rallies a month after a gunman targeted him at a rally in Pennsylvania.  —  The Secret Service plans to surround Trump's podium with bulletproof glass … ",
    "url": "https://www.cbsnews.com/news/trump-resume-outdoor-rallies-bulletproof-glass/"
  },
  {
    "text": "Harris brings her ad blitz to Fox News … - The Harris campaign on Wednesday began running four spots on the network, a Fox News spokesperson confirmed to Axios.  — The ads are largely positive about Harris' life, a sharp contrast with the network's often-critical programming about her.",
    "url": "https://www.axios.com/2024/08/16/kamala-harris-fox-news-ads"
  },
  {
    "text": "Trump VP pick JD Vance is seen posing with three female classmates at boys' urinals in unearthed high school photo  — 18-year-old JD Vance was snapped posing with three girls in the boys' bathroom  — The photo appeared in the 2003 yearbook of Middletown High School in Ohio",
    "url": "https://www.dailymail.co.uk/news/article-13742781/JD-Vance-posing-female-classmates-urinals-photo.html"
  },
  {
    "text": "Unearthed Photo Shows Teen JD Vance Posing in Bathroom With Three Girls at Urinals  —  WIZZ GOING ON?  —  A resurfaced yearbook photo shows the GOP vice presidential nominee next to three girls pretending to use the urinals in his high school's bathroom.  —  JD Vance, no fan … ",
    "url": "https://www.thedailybeast.com/jd-vance-poses-in-bathroom-with-three-girls-at-urinals-in-unearthed-photo"
  },
  {
    "text": "Harris to Unveil Housing Initiatives Aimed at First-Time Buyers  —  Democratic nominee to address thorny economic issue by calling for more construction, tax incentives  —  WASHINGTON—Vice President Kamala Harris will call for the construction of 3 million new housing units in her first four years … ",
    "url": "https://www.wsj.com/politics/elections/kamala-harris-policy-agenda-election-2024-9e057b83"
  },
  {
    "text": "New College of Florida tosses hundreds of library books, empties gender diversity library  —  Hundreds of New College of Florida library books, including many on LGBTQ+ topics and religious studies, are headed to a landfill.  —  A dumpster in the parking lot of Jane Bancroft Cook Library … ",
    "url": "https://www.heraldtribune.com/story/news/education/2024/08/15/new-college-of-florida-throws-away-hundreds-of-library-books-diversity-lgbtq/74814756007/"
  },
  {
    "text": "JD Vance Officially Has a Lower Favorability Rating Than Sarah Palin  —  LOW BLOW  —  Ohio Sen. JD Vance is now the most unpopular vice presidential nominee in modern history—soaring past former Alaska Gov. Sarah Palin's unfavorability ratings during the 2008 campaign.",
    "url": "https://www.thedailybeast.com/jd-vance-has-lower-favorability-rating-than-sarah-palin-and-tim-kaine-polls-say"
  },
  {
    "text": "When your opponent calls you ‘communist,’ maybe don't propose price controls?  —  It's hard to exaggerate how bad Kamala Harris's price-gouging proposal is.  —  “Price gouging” is the focus of Vice President Kamala Harris's economic agenda, her presidential campaign says.",
    "url": "https://www.washingtonpost.com/opinions/2024/08/15/kamala-harris-price-gouging-groceries/"
  },
  {
    "text": "Tim Walz's remarkably courageous stand for LGBT youth  —  Walz supported gay kids at a time when most Democrats did not. … In Boston on Wednesday, Democratic vice presidential candidate Tim Walz talked about his desire to engage with young voters without resorting to fear.",
    "url": "https://www.publicnotice.co/p/tim-walz-gay-straight-alliance-mankato"
  },
  {
    "text": "Kamala Harris to Announce Soviet-Style Price Controls on Food Under Guise of ‘Gouging Ban’  —  Soviet-style centrally administered price controls on food and grocery prices will form part of the federal economic proposals U.S. Vice President Kamala Harris will unveil Friday when she finally delivers an insight into her 2024 policies.",
    "url": "https://www.breitbart.com/politics/2024/08/15/kamala-harris-to-announce-soviet-style-price-controls-on-food-under-guise-of-gouging-ban/"
  },
  {
    "text": "Inside the rift that could define the future of Pennsylvania politics  —  A dispute between Sen. John Fetterman and Gov. Josh Shapiro spilled into the open during Kamala Harris' VP search.  It could roil state and Democratic politics for years.  —  John Fetterman was angry.",
    "url": "https://www.nbcnews.com/politics/elections/rift-define-future-pennsylvania-politics-rcna165614?taid=66be5e5e4b96700001cc2fac"
  },
  {
    "text": "Man Arrested for Explosives Threats and Attack on Energy Facility  —  For Immediate Release  —  U.S. Attorney's Office, Middle District of Florida  —  Orlando, Florida - United States Attorney Roger B. Handberg announces the return of an indictment charging Hashem Younis Hashem Hnaihen … ",
    "url": "https://www.justice.gov/usao-mdfl/pr/jordanian-national-indicted-explosives-threats-and-attack-energy-facility"
  },
  {
    "text": "Eric Adams and His Campaign Receive Subpoenas in Federal Investigation  —  A new round of federal grand jury subpoenas in the investigation of Mayor Eric Adams and his 2021 fund-raising seeks a wide range of information.  —  Federal prosecutors investigating Mayor Eric Adams of New York … ",
    "url": "https://www.nytimes.com/2024/08/15/nyregion/eric-adams-fbi-investigation.html"
  }
]