[
  {
    "text": "The Trump Hack Could Extend Far Beyond a Hack-and-Leak  —  When news first broke that Donald Trump's campaign says it has been hacked, I started drafting a post on applying the lessons of past ratfucks.  —  The alleged hack was first reported by Politico, which says some person using … ",
    "url": "https://www.emptywheel.net/2024/08/11/the-trump-hack-could-extend-far-beyond-a-hack-and-leak/"
  },
  {
    "text": "Trump campaign says it is victim of foreign hack after leak of Vance report  —  Microsoft discovered evidence that Iranian hackers compromised the email account of a former Trump campaign adviser, a person familiar with the matter says.  —  Donald Trump's presidential campaign said on Saturday … ",
    "url": "https://www.washingtonpost.com/politics/2024/08/10/trump-hack-iran-vance-report/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzIzMjYyNDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI0NjQ0Nzk5LCJpYXQiOjE3MjMyNjI0MDAsImp0aSI6ImI5ZGY3MDc4LTljZDktNGVlOC1iYmI3LTBjZGI3ODU1ZjkwNSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzA4LzEwL3RydW1wLWhhY2staXJhbi12YW5jZS1yZXBvcnQvIn0.O1wwyu0W06PHqlDN03JBiBZQdzPT9glUFfi_8WHSLgE&itid=gfta"
  },
  {
    "text": "We received internal Trump documents from ‘Robert.’ Then the campaign confirmed it was hacked.  —  The campaign suggested Iran was to blame.  POLITICO has not independently verified the identity of the hacker or their motivation.  —  Former President Donald Trump's campaign said Saturday … ",
    "url": "https://www.politico.com/news/2024/08/10/trump-campaign-hack-00173503"
  },
  {
    "text": "It's Happening: Swifties are Officially Organizing for Harris  —  For us at The Alt Media, the only thing more delicious than seeing MAGA lose its damn mind is seeing all the enthusiasm across the country to elect Kamala Harris and Tim Walz as our next president and VP.",
    "url": "https://www.thealtmedia.com/p/swifties-organizing"
  },
  {
    "text": "Kamala Harris is more trusted than Donald Trump on the US economy  —  FT Michigan Ross poll shows Democratic candidate leading on the issue for first time in nearly a year  —  More Americans trust Kamala Harris to handle the US economy than Donald Trump, according to a new poll that marks … ",
    "url": "https://www.ft.com/content/cf9a7c4d-3b82-4867-892c-f4f95daebbc7?accessToken=zwAGH2gd7xL4kdPPmnxNO4JIZ9OJLPT5Xa67xw.MEQCIDptIGbmMgmN9TRig75y1Ne5WzlIsMxg6zXeOsiHOYRdAiBfWjVfomB3nzmWEnEQZq-nTQBg-C8JBETsnUPgyv9bow&sharetype=gift&token=90fe1eb2-ff26-4235-a105-63f294bb9aff"
  },
  {
    "text": "162 lies and distortions in a news conference.  NPR fact checks former President Trump  —  There were a host of false things that Donald Trump said during his hour-long news conference Thursday that have gotten attention.  —  A glaring example is his helicopter emergency landing story, which has not stood up to scrutiny.",
    "url": "https://www.npr.org/2024/08/11/nx-s1-5070566/trump-news-conference"
  },
  {
    "text": "More advertisers to flee X after recent Elon Musk lawsuit and riot comments  —  Elon Musk's antitrust lawsuit against brands that have boycotted X and his controversial activity on the platform during the recent spate of UK riots are set to exacerbate the long-held misgivings advertisers have with the site … ",
    "url": "https://www.cityam.com/more-advertisers-to-flee-x-after-recent-elon-musk-lawsuit-and-riot-comments/"
  },
  {
    "text": "‘Neoliberal capitalism’ has contributed to the rise of fascism, says Nobel laureate  —  abc.net.au/news/joseph-stiglitz-the- road-to-freedom-neoliberalism-fascism/ 104210670  —  How would you define the “good society”?  —  It's a question Joseph Stiglitz, winner of the Nobel Memorial Prize … ",
    "url": "https://www.abc.net.au/news/2024-08-11/joseph-stiglitz-the-road-to-freedom-neoliberalism-fascism/104210670"
  },
  {
    "text": "British Writer Pens The Best Description Of Trump I've Read  —  “Why do some British people not like Donald Trump?”  Nate White, an articulate and witty writer from England wrote the following response:  —  A few things spring to mind.  Trump lacks certain qualities which the British traditionally esteem.",
    "url": "https://londondaily.com/british-writer-pens-the-best-description-of-trump-i-ve-read"
  },
  {
    "text": "Trump's Crucial Power Has Been Neutralized  —  He's no longer the “change” candidate.  —  If you're compiling a list of the head-spinning, gob-smacking, I've-never-seen-this-before events of the 2024 campaign, here's one more potentially decisive factor to add: A sitting vice president has become the “change” candidate.",
    "url": "https://www.politico.com/news/magazine/2024/08/11/trumps-crucial-power-has-been-neutralized-00173406"
  },
  {
    "text": "JD Vance says mass deportations should ‘start with 1 million,’ defends ‘thought experiment’ giving parents extra votes  —  The GOP vice presidential candidate discussed several issues with Jonathan Karl.  —  Republican vice presidential candidate JD Vance is interviewed by ABC News' Jon Karl on Aug. 10, 2024.",
    "url": "https://abcnews.go.com/Politics/jd-vance-mass-deportations-start-1-million-defends/story?id=112739447"
  },
  {
    "text": "Trump's Attacks on Georgia's GOP Governor Stand to Benefit Harris  —  As the presidential race tightens, Republicans in the state would rather focus on unifying against Democrats  —  ATLANTA—Georgia Republicans are having a bad case of déjà vu.",
    "url": "https://www.wsj.com/politics/elections/trumps-attacks-on-georgias-gop-governor-stand-to-benefit-harris-acbe967a"
  },
  {
    "text": "Biden admits he was pushed out of presidential race, name-drops Pelosi in first interview since exit  —  President Biden admitted he was pushed out of the presidential race by Democratic Party elites and specifically name-dropped former House Speaker Nancy Pelosi as one of the perpetrators … ",
    "url": "https://nypost.com/2024/08/11/us-news/biden-specifically-names-nancy-pelosi-in-first-interview-about-why-he-dropped-out-of-presidential-race/"
  },
  {
    "text": "STATEMENT by Culinary Union Secretary-Treasurer Ted Pappageorge regarding the endorsement of Kamala Harris for President and Tim Walz for Vice-President:  —  FOR IMMEDIATE RELEASE:  —  MEDIA CONTACT:  —  Bethany Khan: bkhan@culinaryunion226.org ▪ (702) 387-7088",
    "url": "https://m.culinaryunion226.org/news/press/statement-endorsement-of-kamala-harris-for-president-and-tim-walz-for-vice-president"
  }
]