[
  {
    "text": "Trump pushes Steve Daines to succeed McConnell as GOP's Senate leader … - Trump, is consolidating his power over the GOP and Republicans in Congress, and his blessing — along with a triumphant November election — could position Daines for the Senate leadership job when the new Congress starts in January.",
    "url": "https://www.axios.com/2024/02/29/trump-pushes-steve-daines-mcconnell-successor-senate"
  },
  {
    "text": "Scoop: GOP Rep. Mark Green reverses decision to retire after Trump pressure … - “While my strong desire was to leave Congress at the end of this year, since my announcement, I have received countless calls from constituents, colleagues, and President Trump urging me to reconsider,” he said in a statement.",
    "url": "https://www.axios.com/2024/02/29/mark-green-congress-retire-reelection-trump"
  },
  {
    "text": "Cornyn launches bid to succeed McConnell as GOP leader  —  Sen. John Cornyn (R-Texas) on Thursday officially announced a run to replace Senate Minority Leader Mitch McConnell (R-Ky.) as Republican leader, setting up what is expected to be a hotly contested race for the top spot in the conference.",
    "url": "https://thehill.com/homenews/senate/4497417-cornyn-launches-bid-to-replace-mcconnell-as-gop-leader/"
  },
  {
    "text": "Why Is Trump Trying to Make Ukraine Lose?  —  The former president isn't in office—but is still dictating U.S. policy.  —  Nearly half a year has passed since the White House asked Congress for another round of American aid for Ukraine.  Since that time, at least three different legislative efforts … ",
    "url": "https://www.theatlantic.com/ideas/archive/2024/02/one-global-issue-trump-cares-about/677592/"
  },
  {
    "text": "Democratic leader shoots down discharge petition on Ukraine-border bill  —  The head of the House Democratic Caucus wasted no time Thursday shooting down a bipartisan proposal linking Ukraine aid to border security.  —  Rep. Pete Aguilar (D-Calif.) said the supporters of that plan are “well-meaning” and “thoughtful” lawmakers.",
    "url": "https://thehill.com/homenews/house/4497826-democratic-leader-shoots-down-discharge-petition-on-ukraine-border-bill/"
  },
  {
    "text": "House Republican prepares “discharge petition” on Ukraine aid … - “We have to get something done,” said Rep. Brian Fitzpatrick (R-Pa.), co-chair of the bipartisan Problem Solvers Caucus, who is leading the push.  — “It's existential, it's time sensitive.",
    "url": "https://www.axios.com/2024/02/29/house-republican-ukraine-aid-discharge-petition"
  },
  {
    "text": "Trump appeals Illinois judge's ruling removing him from primary ballot  —  Judge Tracie Porter had ordered Trump's removal from presidential ballot for his role in the US Capitol attack  —  Donald Trump has appealed a decision from an Illinois state judge who decided he should be removed … ",
    "url": "https://www.theguardian.com/us-news/2024/feb/29/trump-illinois-presidential-primary-ballot-appeal"
  },
  {
    "text": "In Taking Up Trump's Immunity Claim, Supreme Court Bolstered His Delay Strategy  —  By scheduling a hearing for late April on the former president's assertion that he cannot be prosecuted for his actions in office, the justices increased the chances that he will not face trial by Election Day.",
    "url": "https://www.nytimes.com/2024/02/28/us/politics/trumps-immunity-supreme-court-delay-strategy.html"
  },
  {
    "text": "Republican senator blocks bill to protect IVF  —  Sen. Cindy Hyde-Smith, R-Miss., blocked the bill brought by Sen. Tammy Duckworth, D-Ill., who used IVF to have her daughters.  —  WASHINGTON — Republican Sen. Cindy Hyde-Smith of Mississippi blocked passage of legislation Wednesday that would protect access to in vitro fertilization.",
    "url": "https://www.nbcnews.com/politics/congress/republican-senator-cindy-hyde-smith-blocks-bill-protecting-ivf-rcna141083"
  },
  {
    "text": "Washington State's largest labor union endorses ‘uncommitted’ over Biden  —  The biggest state chapter of the United Food and Commercial Workers suggested it is concerned about Joe Biden's ability to defeat Donald Trump.  —  The biggest labor union in Washington State endorsed voting … ",
    "url": "https://www.nbcnews.com/politics/2024-election/washington-states-largest-labor-union-endorses-uncommitted-biden-rcna141139"
  },
  {
    "text": "Biden Is Too Old But Trump Is Dangerous, Swing-State Poll Shows  —  Trump leads Biden in seven key states, with perceptions of an improving national economy failing to translate into a significant increase in support for the incumbent.  —  Swing-state voters across every major demographic … ",
    "url": "https://www.bloomberg.com/news/articles/2024-02-29/biden-age-worries-swing-state-voters-trump-seen-as-dangerous-poll-shows"
  },
  {
    "text": "Fox News' attempt to manufacture a Biden crime crisis runs into a problem: Violent crime is down  —  A case study in how Fox uses anecdote-based fearmongering to undermine actual crime data  —  After President Joe Biden accurately declared that murders and other violent crimes fell last year … ",
    "url": "https://www.mediamatters.org/fox-news/fox-news-attempt-manufacture-biden-crime-crisis-runs-problem-violent-crime-down"
  },
  {
    "text": "Revealed: ‘extremist’ Trump economist plots rightwing overhaul of US treasury  —  Stephen Moore, who withdrew from Fed consideration after sexist remarks were uncovered, is co-author of radical Project 2025 effort  —  Stephen Moore, a conservative economist whose controversial remarks … ",
    "url": "https://www.theguardian.com/us-news/2024/feb/29/trump-economist-stephen-moore-us-treasury-project-2025"
  },
  {
    "text": "Missouri GOP Candidate for Governor Was Only ‘Honorary’ KKK Member  —  The name of “Pro-White man” Darrell Leon McClanahan III sits atop Missouri's gubernatorial ballot  —  These photos tweeted yesterday by former Missouri Representative Shamed Dogan first appeared on the website … ",
    "url": "https://www.riverfronttimes.com/news/missouri-gop-candidate-for-governor-is-only-honorary-kkk-member-42007057"
  },
  {
    "text": "Israel-Hamas war: Gaza Health Ministry says over 30,000 Palestinians killed  —  Israeli strikes over central Gaza late Wednesday killed at least 20 people, including five women and two children.  Dozens of men held prayers for the deceased, wrapped traditionally in white shrouds, outside al-Aqsa Martyrs Hospital in Deir al-Balah.",
    "url": "https://apnews.com/article/israel-hamas-war-news-02-29-2024-f9b5a62a80d8b83eac4946d3c85af58b"
  },
  {
    "text": "Judge blocks Texas law that gives police broad powers to arrest migrants who illegally enter US  —  A federal judge on Thursday blocked a new Texas law that gives police broad powers to arrest migrants suspected of illegally entering the U.S., dealing a victory to the Biden administration … ",
    "url": "https://apnews.com/article/texas-migrant-arrests-court-ruling-3bcded91620cbd9686575caa6bcac203"
  },
  {
    "text": "Raging wildfire now largest in Texas history with deteriorating conditions expected  —  A raging wildfire that tore across the Texas Panhandle this week has now become the largest in state history, and deteriorating conditions are expected to continue in the state.",
    "url": "https://thehill.com/homenews/state-watch/4497444-raging-wildfire-now-largest-in-texas-history/"
  },
  {
    "text": "Trump Media co-founders sue company, alleging a scheme to dilute shares  —  The case could complicate a long-delayed bid by the owner of Truth Social to go public — and deliver former president Donald Trump a financial lifeline  —  The co-founders of former president Donald Trump's media company filed … ",
    "url": "https://www.washingtonpost.com/technology/2024/02/29/truth-social-lawsuit-trump-media-founders/"
  }
]