[
  {
    "text": "House GOP in open warfare over doomed spending plan  —  One Republican summed up the situation neatly as leadership-empowered negotiators faceplanted with days to go before a shutdown: “It's a mess.”  —  As House Republicans began ripping apart their party's latest spending proposal … ",
    "url": "https://www.politico.com/news/2023/09/19/house-gop-spending-plan-00116631"
  },
  {
    "text": "Maybe Matt Gaetz Is Right  —  The dysfunctional dance taking place in the House between Speaker Kevin McCarthy and his right flank has driven me to consider something I never imagined possible: that Matt Gaetz is right.  —  A House speaker can be successful only with the confidence … ",
    "url": "https://www.nytimes.com/2023/09/19/opinion/kevin-mccarthy-gaetz.html"
  },
  {
    "text": "McCarthy gets tough with the right  —  Boxed in by conservatives as a shutdown looms, the embattled speaker is punching back.  —  After months tiptoeing around the conservatives who have made his speakership a constant high-wire act, House Speaker Kevin McCarthy appears to be fed up — and ready to fight.",
    "url": "https://www.politico.com/news/2023/09/19/mccarthy-gets-mean-00116702"
  },
  {
    "text": "House GOP pulls key vote on stopgap spending bill amid conservative opposition  —  House GOP leadership pulled a procedural vote on a proposed short-term funding stopgap that has bitterly divided the Republican conference and elicited opposition from hard-line conservatives.",
    "url": "https://thehill.com/homenews/house/4212036-house-gop-pulls-key-vote-on-stopgap-spending-bill-amid-conservative-opposition/"
  },
  {
    "text": "Witness testimony disputes IRS whistleblower allegations in Hunter Biden probe as Republicans begin impeachment inquiry  —  New testimony from a number of FBI and Internal Revenue Service officials casts doubt on key claims from an IRS whistleblower who alleges there was political interference … ",
    "url": "https://www.cnn.com/2023/09/19/politics/witness-testimony-disputes-irs-whistleblower-hunter-biden/"
  },
  {
    "text": "Ray Epps, subject of Tucker Carlson's Jan. 6 conspiracy theories, charged by DOJ  —  Epps entered Capitol grounds on Jan. 6 as a supporter of former President Donald Trump.  He told the Jan. 6 committee that the conspiracy theories about him ruined his life.",
    "url": "https://www.nbcnews.com/politics/justice-department/ray-epps-subject-tucker-carlsons-jan-6-conspiracy-theories-charged-doj-rcna99836"
  },
  {
    "text": "A real fact-check of Trump's appearance on Meet the Press  —  Kristen Welker's tenure as the new host of NBC's Meet the Press began on Sunday with an interview with former President Donald Trump.  NBC News promoted Trump's appearance as his “first broadcast network interview since leaving office.”",
    "url": "https://popular.info/p/a-real-fact-check-of-trumps-appearance"
  },
  {
    "text": "Trump wrote to-do lists for assistant on White House documents marked classified: Sources  —  Molly Michael told investigators about the documents, according to sources.  —  One of former President Donald Trump's long-time assistants told federal investigators that Trump repeatedly wrote … ",
    "url": "https://abcnews.go.com/US/trump-wrote-lists-assistant-white-house-documents-marked/story?id=103226113"
  },
  {
    "text": "Rep. Lauren Boebert Says Hookup Theater Guy Won't Get Another Date  —  Rep. Lauren Boebert says it's dunzo between her and the theater groping guy — saying the one-time private moment came and went ... and it sounds like his politics might be at play.  —  The Colorado congresswoman touched … ",
    "url": "https://www.tmz.com/2023/09/18/rep-lauren-boebert-no-more-dates-after-theater-hookup/"
  },
  {
    "text": "This is what taking on election deniers really looks like  —  Democrats won a whole lot of elections in 2022, in no small part on their vow to strengthen and defend democracy.  But if they hope to turn the issue into a sustained political winner, they have to deliver on that promise … ",
    "url": "https://www.washingtonpost.com/opinions/2023/09/19/josh-shapiro-automatic-voter-registration-pennsylvania-trump-maga/"
  },
  {
    "text": "Giuliani's former lawyers sue him for $1.36M in unpaid legal fees  —  The fees stem from the lawyers defending Giuliani's work with Donald Trump's efforts to overturn the 2020 election.  —  Rudy Giuliani's ex-lawyers are suing the former New York City mayor for failing to pay legal fees amounting … ",
    "url": "https://www.politico.com/news/2023/09/19/rudy-giuliani-lawyer-trump-00116671"
  },
  {
    "text": "House will hold first Biden impeachment inquiry hearing next Thursday  —  House Republicans are moving forward with their impeachment inquiry into President Biden as soon as next week  —  FIRST ON FOX — House Republicans will hold their first impeachment inquiry hearing investigating allegations … ",
    "url": "https://www.foxnews.com/politics/house-hold-first-biden-impeachment-inquiry-hearing-thursday"
  },
  {
    "text": "Americans' Dismal Views of the Nation's Politics  —  65% say they always or often feel exhausted when thinking about politics  —  65% say they always or often feel exhausted when thinking about politics  —  How we did this  —  Americans have long been critical of politicians and skeptical of the federal government.",
    "url": "https://www.pewresearch.org/politics/2023/09/19/americans-dismal-views-of-the-nations-politics/"
  },
  {
    "text": "Sen. Susan Collins on the New Senate Dress Code: ‘I Plan to Wear a Bikini’  —  Some Republicans are bashing the informal dress code policy change, while other seem to be embracing it  —  A Facebook icon representing an external link to share the article on Facebook.A Twitter icon representing … ",
    "url": "https://themessenger.com/politics/sen-susan-collins-on-the-new-senate-dress-code-i-plan-to-wear-a-bikini"
  },
  {
    "text": "Shutdown threatens Ukraine training, weapons deliveries  —  Funding for the shipments of weapons from DOD's stockpiles would continue.  —  The government shutdown looming in two weeks if lawmakers fail to reach a deal could halt shipments of critical weapons and U.S. military training of Ukrainian forces … ",
    "url": "https://www.politico.com/news/2023/09/19/us-shutdown-ukraine-weapons-training-00116727"
  },
  {
    "text": "Federal judge upholds convictions of Oath Keeper associate  —  A federal judge on Tuesday upheld two federal convictions against a Navy veteran and Oath Keeper associate accused of helping the far-right group stash weapons outside Washington, DC, on January 6, 2021.",
    "url": "https://www.cnn.com/2023/09/19/politics/oath-keeper-convictions/"
  },
  {
    "text": "Democrat governor first in nation to ban her state government from buying this common item  —  Massachusetts will become the first state to ban the purchase of single-use plastic bottles for state agencies  —  Massachusetts is slated to become the first state in the nation to ban state agencies … ",
    "url": "https://www.foxnews.com/politics/democrat-governor-first-nation-ban-her-state-government-buying-common-item"
  },
  {
    "text": "The breakup: Biden and Adams avoid each other in New York  —  The decision by Biden and Adams to avoid each other is a concession to the reality that their relationship is deeply broken, according to several people familiar with the dynamics.  —  NEW YORK — This time last year … ",
    "url": "https://www.politico.com/news/2023/09/19/biden-adams-new-york-united-nations-00116667"
  },
  {
    "text": "Evidence Suggests Ukrainian Missile Caused Market Tragedy  —  Witness accounts and an analysis of video and weapon fragments suggest a Ukrainian missile failed to hit its intended target and landed in a bustling street, with devastating consequences.  —  The Sept. 6 missile strike … ",
    "url": "https://www.nytimes.com/2023/09/18/world/europe/ukraine-missile-kostiantynivka-market.html"
  },
  {
    "text": "China's Former Foreign Minister Ousted After Alleged Affair, Senior Officials Told  —  Qin Gang remains under investigation for possible national security violations, according to people familiar with the matter  —  NEW YORK—Senior Chinese officials were told that an internal Communist … ",
    "url": "https://www.wsj.com/world/china/chinas-ex-foreign-minister-ousted-after-alleged-affair-senior-officials-told-fdff4672?mod=followamazon"
  }
]