[
  {
    "text": "The Most Unsettling Presidential Debate Spectacle Ever  —  A lot of things happened.  Here are some of the things.  This is TPM's Morning Memo.  Sign up for the email version.  —  What WAS That?  —  When one of America's two major political parties has become a cult of personality … ",
    "url": "https://talkingpointsmemo.com/morning-memo/gop-presidential-debate-surreal-spectacle"
  },
  {
    "text": "A Very Good Republican Presidential Debate  —  Without Trump, the candidates could fight about their policies.  —  Donald Trump ducked the first Republican presidential debate Wednesday night, and his absence did the party and country a favor.  Voters were able to hear eight other candidates … ",
    "url": "https://www.wsj.com/articles/gop-presidential-debate-republicans-donald-trump-ron-desantis-chris-christie-nikki-haley-a24af59d?mod=djemalertNEWS"
  },
  {
    "text": "The winners and losers from the first Republican debate  —  Eight Republican presidential candidates who sought some kind of traction against former president Donald Trump faced off Wednesday night at the first debate of the 2024 GOP primary race in Milwaukee.  Trump was absent.",
    "url": "https://www.washingtonpost.com/politics/2023/08/23/who-won-republican-debate/"
  },
  {
    "text": "Nikki Haley Is the Best Trump Alternative  —  I have a bunch of friends and acquaintances who are Never Trump, maybe-Trump or kind-of-Trump Republicans.  They've been looking around for the candidate they can support and give their dollars to, somebody who is an antidote to Donald Trump and who can win a general election.",
    "url": "https://www.nytimes.com/2023/08/24/opinion/nikki-haley-republican-debate-winner.html"
  },
  {
    "text": "The stage could shrink for the second GOP primary debate  —  Two of the eight candidates who met Wednesday night have not yet met the higher thresholds to participate in the next debate in September.  —  A mad dash for donors and a flurry of last-minute polls marked the days leading … ",
    "url": "https://www.nbcnews.com/politics/2024-election/stage-shrink-second-gop-primary-debate-rcna101586?taid=64e79a9aabe9470001626e68"
  },
  {
    "text": "Why do Republicans even bother with this whole farce?  —  Trump wasn't there, but we saw why he's leading: GOP voters don't care about substance, just unjustified grievances  —  Going into Wednesday night, there were some valiant efforts from the Beltway media to hype the first debate of the Republican presidential primary.",
    "url": "https://www.salon.com/2023/08/24/why-do-even-bother-with-this-whole-farce/"
  },
  {
    "text": "Trump replaces top Georgia lawyer ahead of surrender  —  Former President Donald Trump has replaced his top Georgia lawyer ahead of his surrender Thursday evening, sources tell CNN.  —  Drew Findling, the lawyer who has led Trump's defense in Georgia, is being replaced by Steven Sadow … ",
    "url": "https://www.cnn.com/2023/08/24/politics/trump-georgia-lawyer/"
  },
  {
    "text": "Jim Jordan launches probe into Georgia Trump prosecution  —  House Judiciary Chairman Jim Jordan (R-Ohio) fired off a sweeping request for documents dealing with former President Trump's prosecution for election interference in Georgia, asking Fulton County District Attorney Fani Willis (D) to turn over all records relating to the case.",
    "url": "https://thehill.com/regulation/court-battles/4169099-jim-jordan-launches-probe-into-georgia-trump-prosecution/"
  },
  {
    "text": "Fulton County prosecutors ask judge to set Oct. 23 trial on Trump racketeering charges  —  A trial just two months from now seems implausible given the torrent of anticipated pretrial motions and complex legal issues likely to be litigated before a jury can be seated.",
    "url": "https://www.politico.com/news/2023/08/24/fulton-county-prosecutors-ask-judge-to-set-oct-23-trial-on-trump-racketeering-charges-00112816"
  },
  {
    "text": "House Judiciary Committee launches inquiry into Fulton County District Attorney Fani Willis  —  The Republican-led House Judiciary Committee has opened a congressional investigation into Fulton County District Attorney Fani Willis, a development that was first reported by CNN and comes the same … ",
    "url": "https://www.cnn.com/2023/08/24/politics/house-republican-conference-trump-defense/"
  },
  {
    "text": "Ex-Trump Chief of Staff Mark Meadows Surrenders to Jail in Georgia  —  His bond was set at $100,000.  —  Mark Meadows, Donald Trump's former chief of staff, surrendered to authorities in Georgia on Thursday on allegations he—along with the former president and 17 others—schemed to keep Trump in power after losing the 2020 election.",
    "url": "https://www.thedailybeast.com/ex-trump-chief-of-staff-mark-meadows-surrenders-to-jail-in-georgia"
  },
  {
    "text": "US intelligence assessment shows intentionally caused explosion crashed Wagner chief's plane  —  A preliminary U.S. intelligence assessment has found that the plane crash presumed to have killed Wagner leader Yevgeny Prigozhin was intentionally caused by an explosion, according to U.S. and Western officials.",
    "url": "https://apnews.com/article/russia-wagner-prigozhin-jet-crash-382515214f691e47daa2e3635d64e612"
  },
  {
    "text": "Exclusive: US believes missile inside Russia likely shot down Prigozhin's presumed plane, US officials say  —  The United States believes a surface-to-air missile originating from inside Russia likely shot down the plane presumed to be carrying mercenary leader Yevgeny Prigozhin on Wednesday, two U.S. officials told Reuters on Thursday.",
    "url": "https://www.reuters.com/world/europe/us-believes-missile-inside-russia-likely-shot-down-prigozhins-presumed-plane-us-2023-08-24/"
  },
  {
    "text": "Chaos Erupts When Republican Candidates Are Asked if They Believe in Climate Change  —  There is no scientific dispute on the question, but almost none of the Republican presidential candidates gave a straight answer.  —  It was an unusual litmus test for a Republican primary debate … ",
    "url": "https://www.nytimes.com/2023/08/23/us/republican-debate-climate-change.html"
  },
  {
    "text": "RSVP: … About the Stamp  —  The Ruth Bader Ginsburg stamp features an oil painting of her in her black judicial robe and iconic white collar.  The stamp captures her enduring spirit and tireless dedication to upholding the principles of the Constitution.",
    "url": "https://about.usps.com/newsroom/national-releases/2023/0824ma-usps-to-unveil-stamp-honoring-ruth-bader-ginsburg.htm"
  },
  {
    "text": "Justice Department Sues SpaceX for Discriminating Against Asylees and Refugees in Hiring  —  For Immediate Release  —  Asylees and Refugees With Relevant Information Should Contact the Justice Department  —  The Justice Department filed a lawsuit today against Space Exploration Technologies Corporation … ",
    "url": "https://www.justice.gov/opa/pr/justice-department-sues-spacex-discriminating-against-asylees-and-refugees-hiring"
  },
  {
    "text": "Which issues are Republican voters most concerned about?  —  Before tonight's debate kicks off, FiveThirtyEight, The Washington Post and Ipsos partnered to ask Republican voters about how they might vote in the upcoming Republican presidential primaries.  Specifically, we asked 4,968 likely … ",
    "url": "https://abcnews.go.com/Politics/live-updates/republican-debate-primary/which-issues-are-republican-voters-most-concerned-about-102516326?id=102507215"
  },
  {
    "text": "Orange County mass shooter identified as ex-cop targeting estranged wife, sources say  —  A gunman who officials say killed three people and wounded six others Wednesday night at a landmark biker bar in Trabuco Canyon was a former police officer, according to officials.  —  Orange County Dist.",
    "url": "https://www.latimes.com/california/story/2023-08-23/mass-shooting-cooks-corner-biker-bar-trebuco-orange-county"
  },
  {
    "text": "Some emperor penguin sites experienced ‘total breeding failure’ because of sea ice loss  —  Using satellite images, scientists at the British Antarctic Survey found that sea ice in 2022 broke up long before penguin chicks would have developed their waterproof feathers, making it unlikely they could survive.",
    "url": "https://www.nbcnews.com/science/environment/emperor-penguin-sites-experienced-total-breeding-failure-sea-ice-loss-rcna101011"
  }
]