[
  {
    "text": "Verdict: Colorado Springs-area resident found guilty on all charges in Capitol breach trial in D.C.  —  After a lengthy deliberation that's been rare for Capitol breach cases, Falcon resident Rebecca Lavrenz, known on social media as the “J6 Praying Grandma,” was convicted … ",
    "url": "https://gazette.com/news/crime/verdict-colorado-springs-area-resident-found-guilty-on-all-charges-in-capitol-breach-trial-in/article_41e439fe-f0fc-11ee-9887-4fc0904851b5.html"
  },
  {
    "text": "The Trump Docket: A window into Trump's ‘private’ acts on Jan. 6 may soon be opened by a federal judge  —  Very soon, a federal judge in Washington, D.C., is expected to issue a ruling that could expose key pieces of discovery that some lawyers say prove Donald Trump acted in his “private” … ",
    "url": "https://lawandcrime.com/high-profile/the-trump-docket-a-window-into-trumps-private-acts-on-jan-6-may-soon-be-opened-by-a-federal-judge/"
  },
  {
    "text": "Trump embraces woman convicted of Jan. 6 crimes, helps raise money for legal costs  —  Former president Donald Trump said Friday that a Colorado woman convicted of four federal misdemeanor charges related to the Jan. 6, 2021, attack on the U.S. Capitol is a “patriot” and shared a link … ",
    "url": "https://www.washingtonpost.com/politics/2024/04/05/donald-trump-laverenz-january-6/"
  },
  {
    "text": "Biden campaign hits Trump over guests at upcoming Palm Beach high-dollar fundraiser  —  President Biden's reelection campaign hit former President Trump on Friday over the guest list for his high-dollar fundraiser in Palm Beach, Fla., on Saturday.  —  Trump is aiming to outraise Biden's $26 … ",
    "url": "https://thehill.com/homenews/campaign/4575614-biden-campaign-hits-trump-over-guests-at-upcoming-palm-beach-high-dollar-fundraiser/"
  },
  {
    "text": "Trump's $50 million gala set to double Biden's triple-president fundraiser  —  The former president has secured commitments that far outpace the $26 million Democrats raised last week at Radio City Music Hall.  —  Former President Donald Trump has secured commitments totaling $50 million … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-50-million-gala-fundraising-biden-rcna146672"
  },
  {
    "text": "Trump's Lawyers Told the Court That No One Would Give Him a Bond.  Then He Got a Lifeline, but They Didn't Tell the Judges.  —  An appeals court reduced Trump's bond by more than 60% after his attorneys claimed it was a “practical impossibility” to pay the full amount.",
    "url": "https://www.propublica.org/article/trump-bond-disclosure-appeals-court-hankey"
  },
  {
    "text": "Trump again asks hush money judge to recuse himself less than two weeks before trial starts  —  His lawyers cited Judge Juan Merchan's daughter's job at a company that does work for Democratic candidates as the main reason he should step aside.  —  Lawyers for Donald Trump have again asked … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-asks-hush-money-judge-recuse-less-two-weeks-trial-starts-rcna146659"
  },
  {
    "text": "Biden Will Try Again to Wipe Out Student Loan Debt for Millions of Borrowers  —  The Supreme Court blocked President Biden's first attempt at large-scale student debt relief last summer.  —  President Biden will announce a new effort on Monday to reduce or eliminate student loan debt … ",
    "url": "https://www.nytimes.com/2024/04/05/us/politics/biden-student-loan-debt.html"
  },
  {
    "text": "US preparing for significant Iran attack on US or Israeli assets in the region as soon as next week  —  The US is on high alert and actively preparing for a “significant” attack that could come as soon as within the next week by Iran targeting Israeli or American assets in the region in response … ",
    "url": "https://www.cnn.com/2024/04/05/politics/us-israel-iran-retaliation-strike"
  },
  {
    "text": "CIA refutes whistleblower claim pushed by Republicans leading Biden impeachment inquiry  —  House Republicans leading the impeachment inquiry into President Joe Biden were dealt their latest blow this week when the CIA informed them that an allegation they pushed was false … ",
    "url": "https://www.cnn.com/2024/04/05/politics/comer-jordan-whistleblower-claim-cia/"
  },
  {
    "text": "Joe Biden Is Not a “Genocidal Maniac”  —  1. Genocide No(e)  —  One thing I discovered upon leaving the dark arts of public relations and opposition research for the green pastures of journalism commentary content creation is that even if something seems blazingly obvious to you … ",
    "url": "https://plus.thebulwark.com/p/joe-biden-is-not-a-genocidal-maniac"
  },
  {
    "text": "Noem banned from Cheyenne River Reservation  —  SIOUX FALLS, S.D. (Dakota News Now) - Governor Kristi Noem has been banned from a second tribal reservation in South Dakota.  —  On Tuesday, the Cheyenne River Sioux Tribe voted to ban Noem from its reservation, which means that Noem will no longer … ",
    "url": "https://www.dakotanewsnow.com/2024/04/04/noem-banned-cheyenne-river-reservation/"
  },
  {
    "text": "Democrats introduce bill to name Miami prison after Trump  —  A trio of House Democrats introduced legislation to rename a Miami prison after former President Trump.  —  Congressmen Gerry Connolly (D-Va.), Jared Moskowitz (D-Fla.), and John Garamendi (D-Calif.) introduced legislation Friday … ",
    "url": "https://thehill.com/homenews/house/4577000-democrats-introduce-bill-name-miami-prison-trump/"
  },
  {
    "text": "Judge blocks Trump attempt to subpoena NBC over materials related to Stormy Daniels documentary  —  A State Supreme Court judge blocked former President Trump's attempt to gain access to NBC's documentary material related to adult film actress Stormy Daniels.",
    "url": "https://thehill.com/regulation/court-battles/4577438-judge-blocks-trump-attempt-subpoena-nbc-over-materials-stormy-daniels-documentary/"
  },
  {
    "text": "Pelosi joins call to halt U.S. weapons transfers to Israel … - “In light of the recent strike against aid workers and the ever-worsening humanitarian crisis, we believe it is unjustifiable to approve these weapons transfers,” the lawmakers wrote to President Biden and Secretary of State Antony Blinken.",
    "url": "https://www.axios.com/2024/04/05/pelosi-call-halt-us-weapons-transfers-israel"
  },
  {
    "text": "Top Israeli spy chief exposes his true identity in online security lapse  —  Exclusive: Yossi Sariel unmasked as head of Unit 8200 and architect of AI strategy after book written under pen name reveals his Google account  —  The identity of the commander of Israel's Unit 8200 is a closely guarded secret.",
    "url": "https://www.theguardian.com/world/2024/apr/05/top-israeli-spy-chief-exposes-his-true-identity-in-online-security-lapse"
  },
  {
    "text": "Sen. Bernie Sanders's Office In Vermont Caught Fire.  Arson Is Suspected, But The Motive Is Unclear.  —  Authorities are seeking a suspect who allegedly started a fire outside the Vermont office of U.S. Sen. Bernie Sanders.  —  Police in Vermont are seeking a suspect who allegedly started … ",
    "url": "https://www.huffpost.com/entry/bernie-sanders-office-fire_n_661099cee4b0d81853f9477d"
  },
  {
    "text": "House to vote on rebuking Biden's call for Gaza ceasefire … - It's the latest in a series of Israel-related wedge votes House Republicans have held since Hamas' Oct. 7 attack. … - It cites a White House readout of Biden's call with Netanyahu, which said Biden “underscored … ",
    "url": "https://www.axios.com/2024/04/05/house-vote-biden-gaza-ceasefire"
  },
  {
    "text": "Trump Wants to Jail His Opponents and Nobody Seems to Care  —  THE NEW ABNORMAL  —  “The fact that this conversation is not on the front of every paper, the lead-in for every cable news story, I just don't understand.” … Former President Donald Trump has talked repeatedly about jailing … ",
    "url": "https://www.thedailybeast.com/trump-wants-to-jail-his-opponents-and-nobody-seems-to-care"
  },
  {
    "text": "4.8 magnitude quake rattles New York City area  —  A 4.8 magnitude earthquake shook the New York City area Friday morning, according to the United States Geological Survey (USGS).  —  The epicenter was near Lebanon, N.J., with a depth just shy of 3 miles, according to the USGS.",
    "url": "https://thehill.com/homenews/state-watch/4576512-new-york-experiences-4-8-magnitude-earthquake/"
  }
]