[
  {
    "text": "Trump may not attend arraignment in Fulton County  —  Washington — Former President Donald Trump may not show up to his arraignment in Georgia next week, according to two sources familiar with his plans.  —  Trump is considering waiving his arraignment appearance, which is scheduled … ",
    "url": "https://www.cbsnews.com/news/trump-arraignment-fulton-county-georgia/"
  },
  {
    "text": "Over 100 former clerks of Justice Thomas sign open letter defending his integrity, independence  —  112 of Justice Thomas' former clerks say news stories attacking him are ‘part of larger attack on the Court’ and its ‘legitimacy’  —  EXCLUSIVE - Over 100 former clerks of Supreme Court Justice … ",
    "url": "https://www.foxnews.com/politics/over-100-former-clerks-justice-thomas-sign-open-letter-defending-his-integrity-independence"
  },
  {
    "text": "Recently indicted John Eastman is among those vouching for Clarence Thomas' integrity  —  Eastman was indicted in Georgia in connection with efforts to keep former President Donald Trump in office after his 2020 election loss.  He also faces disbarment proceedings.",
    "url": "https://www.nbcnews.com/politics/supreme-court/john-eastman-vouching-clarence-thomas-integrity-rcna102466"
  },
  {
    "text": "Secretaries of state get ready for possible challenges to Trump's ballot access  —  Arizona's secretary of state is the latest to say his office is grappling with the potential effects of a move to block Trump from the ballot.  —  Arizona Secretary of State Adrian Fontes said Tuesday … ",
    "url": "https://www.nbcnews.com/politics/2024-election/secretaries-state-get-ready-possible-challenges-trumps-ballot-access-rcna102440"
  },
  {
    "text": "‘Go after it’: GOP strategists say Republicans need to hit Biden on drug pricing  —  Republicans are working to persuade Americans that the Biden plan will stifle innovation and lead to price controls.  —  As President Joe Biden touts the first 10 drugs subject to Medicare price talks … ",
    "url": "https://www.politico.com/news/2023/08/29/biden-drug-prices-gop-00113404"
  },
  {
    "text": "Supporting people's right to accurate and safe political discourse on X  —  More than half a billion people from around the world gather on X to talk about their interests in real-time, and that includes elections.  X enables people to directly engage on important topics with elected representatives … ",
    "url": "https://blog.twitter.com/en_us/topics/company/2023/supporting-peoples-right-to-accurate-and-safe-political-discourse-on-x"
  },
  {
    "text": "A 6-figure Donald Trump donor is now a No Labels adviser  —  A major Republican donor and one-time financial backer of former President Donald Trump is now a leader in the Florida chapter of No Labels' third-party presidential bid.  —  Allan Keen, a Florida-based real estate developer … ",
    "url": "https://www.politico.com/news/2023/08/30/trump-donor-no-labels-adviser-00113395"
  },
  {
    "text": "When I Tell You Nikki Haley Is Pathetic, That's an Understatement  —  I wish it were as simple as that one Republican debate.  —  I wish the Nikki Haley onstage in Milwaukee last week — who called out Donald Trump for his profligate government spending, who implored her fellow Republicans … ",
    "url": "https://www.nytimes.com/2023/08/29/opinion/nikki-haley-trump-2024.html"
  },
  {
    "text": "Trump Could Clinch the Nomination Before the G.O.P. Knows if He's a Felon  —  The federal election interference case — one of four — is set to start just before Super Tuesday and a cascade of consequential primaries.  —  By the time Donald J. Trump is sitting at his federal trial on charges … ",
    "url": "https://www.nytimes.com/2023/08/30/us/politics/trump-gop-calendar.html"
  },
  {
    "text": "GOP lawmaker arrested again after domestic violence charges: report  —  A Republican state representative in Ohio has been arrested for violating a protective order — while awaiting trial for a prior arrest for domestic violence.  —  According to Fox 8 News, Rep. Bob Young allegedly breached … ",
    "url": "https://www.rawstory.com/gop-lawmaker-arrested-again/"
  },
  {
    "text": "Florida reviewers of AP African American Studies sought ‘opposing viewpoints’ of slavery  —  When Florida rejected a new Advanced Placement course on African American Studies, state officials said they objected to the study of several concepts — like reparations, the Black Lives Matter movement and “queer theory.”",
    "url": "https://www.miamiherald.com/news/local/education/article278582149.html"
  },
  {
    "text": "Playbook: The House GOP mulls some impeachment hypocrisy  —  Presented by With help from Eli Okun and Garrett Ross  —  DRIVING THE DAY  —  FLORIDA LATEST — Via the National Hurricane Center: “IDALIA RAPIDLY INTENSIFIES INTO A CATEGORY 4 HURRICANE ... CATASTROPHIC STORM SURGE AND DESTRUCTIVE WINDS … ",
    "url": "https://www.politico.com/newsletters/playbook/2023/08/30/the-house-gop-mulls-some-impeachment-hypocrisy-00113436"
  },
  {
    "text": "No Labels preps playbook to select presidential candidates, broaden support  —  The group that's preparing a potential third-party bid is seeking ways to grow grass roots before deciding whether to field candidates next year  —  The organizers of No Labels, the bipartisan group preparing … ",
    "url": "https://www.washingtonpost.com/politics/2023/08/30/no-labels-third-party-election/"
  },
  {
    "text": "DeSantis tells Biden: Keep your IRA money  —  The governor is blocking Biden's IRA benefits from Floridians.  There's not much Dems can do about it.  —  President Joe Biden is offering one of his White House challengers hundreds of millions of dollars to spend in his state.",
    "url": "https://www.politico.com/news/2023/08/30/desantis-refuses-biden-climate-ira-money-00113397"
  },
  {
    "text": "Canada, citing potential dangers, warns LGBTQ travelers of US risks  —  Canada, citing the risk of potential dangers, is advising LGBTQ travelers planning trips to the United States to check how they might be affected by recently passed laws in some states, Ottawa said on Tuesday.",
    "url": "https://www.reuters.com/world/americas/canada-citing-potential-dangers-warns-lgbtq-travelers-us-risks-2023-08-29/"
  },
  {
    "text": "Jack Smith's Team Grilled Witnesses About Rudy Giuliani's Drinking  —  The special counsel's interest in Rudy's drinking could play a role in undermining one of Trump's key legal defenses … In their questioning of multiple witnesses, Smith's team of federal investigators have asked questions … ",
    "url": "https://www.rollingstone.com/politics/politics-features/rudy-giuliani-jack-smith-donald-trump-jan6-1234814129/"
  },
  {
    "text": "Greece struggles to contain Europe's largest wildfire on record  —  Wildfires raging across northeast Greece for 10 straight days — even as hundreds of firefighters battling to contain them — are the largest ever recorded within the European Union, according to a European Commission spokesman.",
    "url": "https://www.washingtonpost.com/world/2023/08/29/greece-wildfire-largest-recorded-europe/"
  },
  {
    "text": "Exclusive: Russia will not probe Prigozhin plane crash under international rules  —  Russia has informed Brazil's aircraft investigation authority that it will not probe the crash of the Brazilian-made Embraer (EMBR3.SA) jet that killed mercenary boss Yevgeny Prigozhin under international rules … ",
    "url": "https://www.reuters.com/world/europe/russia-will-not-probe-prigozhin-plane-crash-under-international-rules-brazil-2023-08-29/"
  },
  {
    "text": "School kicks 12-year-old out of class for 'Don't Tread On Me' patch  —  A 12-year-old Colorado boy was removed from class due to a patch on his backpack that showed the Gadsden flag.  —  Reading “DON'T TREAD ON ME,” the Gadsden flag has its roots in Benjamin Franklin's Join, or Die cartoon … ",
    "url": "https://www.washingtonexaminer.com/news/school-kicks-12-year-old-out-of-class-for-dont-tread-on-me-patch"
  }
]