[
  {
    "text": "It's Even Worse Than We Imagined  —  Just when you thought it couldn't be worse, here we are.  —  As I reported last week, a star witness for the GOP-led impeachment inquiry, someone Rep. Jim Jordan (R-OH) had called a “highly credible human source,” was indicted for making false statements and reports.",
    "url": "https://statuskuo.substack.com/p/its-even-worse-than-we-imagined"
  },
  {
    "text": "Fox News co-host ‘surprised’ by GOP's ‘threshold for humiliation’ in Biden probe  —  Fox News co-host Jessica Tarlov mocked House Republicans on Wednesday for their pursuit of impeachment charges against President Biden.  —  “This is the path that they've chosen to take … ",
    "url": "https://thehill.com/homenews/media/4481267-fox-news-host-surprised-gop-threshold-humiliation-biden-probe/"
  },
  {
    "text": "Republicans Rush to Scrub Mention of FBI Informant in Impeachment Letter … House Republicans quietly deleted a reference to their epic fail of an FBI informant in a letter to a potential witness in the somehow-still-ongoing impeachment inquiry into Joe Biden.",
    "url": "https://newrepublic.com/post/179160/republicans-delete-reference-fbi-informant-smirnov-impeachment-letter"
  },
  {
    "text": "Russia's Staggering Success In Duping Willing Republicans And Right Wing Media  —  A lot of things happened.  Here are some of the things.  This is TPM's Morning Memo.  —  The Plot Thickens  —  The former FBI informant charged with fabricating the Burisma bribery story about President Biden … ",
    "url": "https://morningmemo.talkingpointsmemo.com/p/russias-staggering-success-in-duping"
  },
  {
    "text": "Nikki Haley sides with Alabama Supreme Court on IVF ruling: ‘Embryos, to me, are babies’  —  The Alabama court's recent ruling raised concerns among doctors and patients worried that classifying embryos as children could restrict in-vitro fertilization.  —  NORTH AUGUSTA, S.C. … ",
    "url": "https://www.nbcnews.com/politics/2024-election/nikki-haley-sides-alabama-supreme-court-ivf-ruling-embryos-are-babies-rcna139819"
  },
  {
    "text": "Ron DeSantis shares his concerns about Trump in a private call with supporters  —  The Florida governor, who endorsed Trump after ending his own White House bid last month, said the former president should not use “identity politics” to pick a running mate.  —  Florida Gov. Ron DeSantis told backers … ",
    "url": "https://www.nbcnews.com/politics/2024-election/ron-desantis-concerns-trump-private-call-supporters-rcna139859"
  },
  {
    "text": "Mike Johnson invoked God in a GOP presentation on keeping the majority.  It didn't land well.  —  The speaker delivered a presentation that, while ostensibly about holding the majority this fall, took a notably moral turn, according to two people in the room.",
    "url": "https://www.politico.com/live-updates/2024/02/21/congress/johnsons-sermon-to-gop-retreagt-00142436"
  },
  {
    "text": "Republicans Furious as Speaker Johnson Turns GOP Leadership Meeting Into Religious Revival  —  They just wanted to hear plans for keeping their extremely slim House majority  —  Members of House Republican leadership expressed frustration at Speaker Mike Johnson after a GOP leadership retreat … ",
    "url": "https://www.meidastouch.com/news/republicans-furious-as-speaker-johnson-turns-gop-leadership-meeting-into-religious-revival"
  },
  {
    "text": "2024 Election: Biden Holds On To Slight Lead Over Trump, Quinnipiac University National Poll Finds; Trump Gets Higher Marks On Age, Mental & Physical Fitness; Biden Does Better On Ethics, Empathy & Temperament  —  mail_outline  —  In a hypothetical 2024 general election presidential matchup … ",
    "url": "https://poll.qu.edu/poll-release?releaseid=3890"
  },
  {
    "text": "Commander, Biden's banished German shepherd, had at least 25 biting incidents in a year  —  President Biden's now-banished German shepherd Commander inflicted more damage with bite incidents than previously known.  —  Newly released records from the United States Secret Service to USA TODAY reveal … ",
    "url": "https://www.usatoday.com/story/news/investigations/2024/02/21/commander-bidens-german-shepherd-involved-in-at-least-25-bites/72690614007/"
  },
  {
    "text": "Federal judge affirms MyPillow's Mike Lindell must pay $5M in election data dispute  —  A federal judge on Wednesday affirmed a $5 million arbitration award against MyPillow chief executive Mike Lindell in favor of a software engineer who challenged data that Lindell said proves China interfered … ",
    "url": "https://apnews.com/article/mike-lindell-election-denial-arbitration-award-a9b27dd8d37eab1d0f22111566feba93"
  },
  {
    "text": "Arizona prosecutor refuses to extradite murder suspect to New York  —  An Arizona prosecutor said she will not extradite a New York murder suspect to the state on Wednesday, claiming Manhattan District Attorney Alvin Bragg could not be trusted to keep the man behind bars.",
    "url": "https://thehill.com/regulation/court-battles/4481318-arizona-prosecutor-refuses-extradite-murder-suspect-new-york/"
  },
  {
    "text": "Elon Musk quietly visited the Biden White House in September  —  Musk and President Joe Biden, who didn't meet during the visit, have had a frosty relationship driven by differing views on labor unions and more.  —  Tech billionaire Elon Musk quietly visited the White House in September … ",
    "url": "https://www.nbcnews.com/tech/tech-news/elon-musk-quietly-visited-biden-white-house-september-rcna139836"
  },
  {
    "text": "FACT SHEET: President Biden Cancels Student Debt for more than 150,000 Student Loan Borrowers Ahead of Schedule  —  Today, President Biden announced the approval of $1.2 billion in student debt cancellation for almost 153,000 borrowers currently enrolled in the Saving on a Valuable Education (SAVE) repayment plan.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/02/21/fact-sheet-president-biden-cancels-student-debt-for-more-than-150000-student-loan-borrowers-ahead-of-schedule/"
  },
  {
    "text": "Amy Brown, wife of GOP Senate candidate Sam Brown, opens up about her abortion for the first time publicly  —  Sam Brown is running for Senate in Nevada, and he told NBC News that his wife's experience has helped show him politicians have to “lead with compassion.”",
    "url": "https://www.nbcnews.com/politics/2024-election/sam-amy-brown-abortion-nevada-gop-republican-senate-race-rcna136826?_branch_match_id=1279445062030396012"
  },
  {
    "text": "'Who's going to do that?':  Trump faces hurdles in securing appeal bond for fraud case  —  Former President Donald Trump will need to secure a massive bond as he appeals the ruling ordering him to pay more than $450 million in penalties and interest.  —  Former President Donald Trump … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/s-going-trump-faces-hurdles-securing-appeal-bond-fraud-case-rcna139861"
  },
  {
    "text": "U.S. Attorney Announces Nuclear Materials Trafficking Charges Against Japanese Yakuza Leader  —  For Immediate Release  —  U.S. Attorney's Office, Southern District of New York  —  Takeshi Ebisawa of Japan, Leader Within the Yakuza Transnational Organized Crime Syndicate … ",
    "url": "https://www.justice.gov/usao-sdny/pr/us-attorney-announces-nuclear-materials-trafficking-charges-against-japanese-yakuza"
  },
  {
    "text": "US man pleads not guilty after two-year-old daughter accidentally shoots herself  —  Michael Tolbert, 44, of Flint becomes first person charged under Michigan's new law requiring safe storage of guns  —  A Michigan man whose two-year-old daughter shot herself in the head with his revolver … ",
    "url": "https://www.theguardian.com/us-news/2024/feb/21/michigan-man-pleads-not-guilty-daughter-shooting"
  },
  {
    "text": "Teamsters give GOP first major donation in years with $45,000 to RNC  —  The Teamsters' political committee has given $45,000 to the Republican National Committee, according to federal records, a significant departure for a powerful organized labor group that has more recently supported Democrats … ",
    "url": "https://www.washingtonpost.com/business/2024/02/21/teamsters-trump-biden-union/"
  }
]