[
  {
    "text": "Inside Trump's Decision to Skip the G.O.P. Debate  —  Fox News leaned on the former president privately and publicly to join the debate.  But all the while he was proceeding with a plan for his own counterprogramming.  —  On a cool August night on the crowded patio of his private club in New Jersey … ",
    "url": "https://www.nytimes.com/2023/08/19/us/politics/trump-fox-debate.html"
  },
  {
    "text": "Why Trump might regret passing on the first debate  —  In recent nominating contests, the nationally televised shoutfests have prompted significant shifts in polling afterward.  —  Donald Trump wants to deprive his competitors of any oxygen.  That's why the former president is likely skipping next week's debate in Milwaukee.",
    "url": "https://www.politico.com/news/2023/08/19/2024-debates-matter-00111948"
  },
  {
    "text": "Giuliani Repeatedly Sought Financial Lifeline From Trump  —  As Rudolph Giuliani has neared a financial breaking point with a pile of legal bills, the former president has largely demurred, despite making a vague promise to pay up.  —  Rudolph W. Giuliani is running out of money and looking … ",
    "url": "https://www.nytimes.com/2023/08/19/us/politics/giuliani-trump-legal-finances.html"
  },
  {
    "text": "FACT SHEET: The Trilateral Leaders' Summit at Camp David  —  President Biden welcomed Japanese Prime Minister Kishida and Republic of Korea (ROK) President Yoon to a historic trilateral summit at Camp David, the first-ever stand-alone summit of Leaders from the United States, Japan, and the ROK … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2023/08/18/fact-sheet-the-trilateral-leaders-summit-at-camp-david/"
  },
  {
    "text": "Kevin Kruse on Florida's whitewashing of Black history  —  The part about slavery is getting all the attention.  But Kruse argues that Florida's treatment of the 20th century is just as egregious.  —  ∙ Paid … Florida Gov. Ron DeSantis has been pilloried, and rightfully so … ",
    "url": "https://www.publicnotice.co/p/kevin-kruse-florida-history-curriculum-desantis"
  },
  {
    "text": "Exclusive: James O'Keefe Is Now Under Investigation for Looting Project Veritas  —  Prosecutors in Westchester County, N.Y., are pursuing charges against the right's premiere “gotcha video” scammer, for scamming his own donors.  —  Pocket  —  James O'Keefe, the founder and until … ",
    "url": "https://www.thenation.com/article/society/james-okeefe-criminal-investigation-project-veritas/"
  },
  {
    "text": "Proud Boy on house arrest in Jan. 6 case disappears ahead of sentencing  —  Authorities are searching for a member of the Proud Boys extremist group who disappeared days before his sentencing in a U.S. Capitol riot case, where prosecutors are seeking more than a decade in prison, according to a warrant made public Friday.",
    "url": "https://apnews.com/article/jan-6-capitol-attack-proud-boy-1341d4596fb96ee2828b54d70ef7e126"
  },
  {
    "text": "Biden campaign expects GOP candidates to ‘out-MAGA each other’ during first debate  —  In a memo first shared with NBC News, the Biden campaign plans to highlight abortion rights and threats to democracy when candidates take the stage Wednesday night.  —  The Biden campaign plans to highlight … ",
    "url": "https://www.nbcnews.com/politics/2024-election/biden-campaign-expects-candidates-maga-debate-rcna100712"
  },
  {
    "text": "Von der Leyen condemns Turkish Cypriot attack on UN peacekeepers  —  The European Commission President Ursula von der Leyen joined the U.K., France and the U.S. in expressing shock and disapproval over an assault on U.N. peacekeepers in Cyprus by Turkish Cypriots.",
    "url": "https://www.politico.eu/article/von-der-leyen-condemns-turkish-cypriot-attack-on-un-peacekeepers/"
  },
  {
    "text": "Camp David Summit: The U.S., Japan and South Korea Form Security Pact  —  Meeting at Camp David, the leaders of the three countries avoided raising tensions with China, but the country loomed large over the meeting.",
    "url": "https://www.nytimes.com/live/2023/08/18/us/biden-news-camp-david"
  },
  {
    "text": "Rupert Murdoch encouraged Virginia's Glenn Youngkin to seek presidency  —  CORRECTION  —  A previous version of this article incorrectly said that Fox News settled a lawsuit by Dominion Voting Systems for nearly $788 billion.  The settlement was for nearly $788 million.  The article has been corrected.",
    "url": "https://www.washingtonpost.com/dc-md-va/2023/08/18/rupert-murdoch-glenn-youngkin-fox-news-presidency/"
  },
  {
    "text": "Our collective malady: Donald Trump's mental health crisis is America's problem  —  Experts: Trump's “denial of reality” and “primitive projections” are imploding.  He's even more dangerous  —  To properly respond to Donald Trump and the level of extreme danger he represents … ",
    "url": "https://www.salon.com/2023/08/18/our-collective-malady-donald-mental-health/"
  },
  {
    "text": "Biden to sign strategic partnership deal with Vietnam in latest bid to counter China in the region  —  The new strategic partnership agreement opens the door to closer diplomatic, economic and technological cooperation with former foe — and China's neighbor — Hanoi.",
    "url": "https://www.politico.com/news/2023/08/18/biden-vietnam-partnership-00111939"
  },
  {
    "text": "Arizona Investigators ‘Aggressively’ Looking at Top Trump Ally Kelli Ward  —  The fake elector, and one of the state's most prominent Republicans, is in the crosshairs of a criminal probe into the scheme to steal the election … The Arizona probe has been accelerating in the past several weeks … ",
    "url": "https://www.rollingstone.com/politics/politics-features/kelli-ward-crosshairs-arizona-fake-electors-investigation-1234808925/"
  },
  {
    "text": "DeSantis meets privately with Kemp in Georgia  —  The meeting follows Donald Trump's indictment in the state.  —  Ron DeSantis met privately with Georgia Gov. Brian Kemp on Friday, the latest in his effort to fortify relationships with three Republican governors alienated by Donald Trump.",
    "url": "https://www.politico.com/news/2023/08/18/desantis-campaign-georgia-governor-kemp-00111911"
  }
]