[
  {
    "text": "4 things revealed by Trump's Georgia indictment  —  Donald Trump has been criminally charged for the fourth time this year, with Fulton County District Attorney Fani T. Willis unveiling an indictment Monday night concerning Trump's attempts to overturn the 2020 presidential election result in Georgia.",
    "url": "https://www.washingtonpost.com/politics/2023/08/15/takeaways-trump-georgia-indictment/"
  },
  {
    "text": "Who is Scott McAfee, the judge assigned to oversee Trump case in Georgia?  —  The newly leveled case against former President Donald Trump and his co-defendants accusing them of engaging in a conspiracy to overturn the results of the 2020 presidential election in Georgia has been assigned to a judge who is a lifelong Georgian.",
    "url": "https://www.cnn.com/2023/08/15/politics/scott-mcafee-trump-judge-georgia-rico-case/"
  },
  {
    "text": "Trump, 18 others indicted for trying to overthrow 2020 Georgia election  —  X  —  Former President Donald Trump and 18 allies were charged on Monday with conspiring to overturn the results of the 2020 election in Georgia.  —  In a sweeping 98-page indictment handed up by a Fulton County grand jury … ",
    "url": "https://www.ajc.com/politics/trump-18-others-indicted-for-trying-to-overthrow-2020-georgia-election/PQ3N2YBIDRDJFLJGFLEBZUWM6I/"
  },
  {
    "text": "An early test for Georgia prosecutors: Trump's likely bid to take the case to federal court  —  He's virtually certain to try to transfer the case in hopes of a friendlier jury pool and the chance to draw one of his own judges.  —  One of the first big battles in the new racketeering case … ",
    "url": "https://www.politico.com/news/2023/08/15/trump-georgia-case-removal-federal-court-00111240"
  },
  {
    "text": "Trump's 4 criminal cases, ranked in order of how screwed he is  — Former President Donald Trump has been indicted in four separate criminal cases since leaving office.  — All the cases loom as he runs for the 2024 GOP presidential nomination.  — Some are more threatening than others.",
    "url": "https://www.businessinsider.com/trump-criminal-cases-ranked-how-much-legal-trouble-2023-8?op=1"
  },
  {
    "text": "Dershowitz slams GA indictment, says Trump used same tactics as Al Gore in 2000: not a ‘crime’  —  Trump was indicted in Georgia over his alleged effort to overturn the election results there  —  The former legal counsel for Al Gore who challenged - and lost - the presidential election results … ",
    "url": "https://www.foxnews.com/politics/dershowitz-slams-trump-georgia-indictment"
  },
  {
    "text": "Fact check: Debunking Trump's dishonest attacks against Georgia prosecutor Fani Willis  —  Former President Donald Trump has launched a barrage of attacks, many of them dishonest, against the Georgia district attorney who is prosecuting him over his attempts to overturn his 2020 election defeat in the state.",
    "url": "https://www.cnn.com/2023/08/15/politics/fact-check-trump-attacks-fani-willis-georgia/"
  },
  {
    "text": "Trump charged in Georgia 2020 election probe, his fourth indictment  —  ATLANTA — Former president Donald Trump and 18 others were criminally charged in Georgia on Monday in connection with efforts to overturn Joe Biden's 2020 victory in the state, according to an indictment made public late Monday night.",
    "url": "https://www.washingtonpost.com/national-security/2023/08/14/trump-indictment-georgia-election-2020/"
  },
  {
    "text": "Trump indictment underscores election security risk for 2024  —  The charges are the first to officially link Trump allies to the theft of voting system software that took place in Georgia and other states in the aftermath of the 2020 election.  —  The alleged theft of voting system software … ",
    "url": "https://www.politico.com/news/2023/08/15/trump-indictment-election-security-risk-00111276"
  },
  {
    "text": "The Hill's Morning Report — Trump, advisers charged with Georgia election scheme  —  Editor's note: The Hill's Morning Report is our daily newsletter that dives deep into Washington's agenda.  To subscribe, click here or fill out the box below.  —  Close  —  Thank you for signing up!",
    "url": "https://thehill.com/newsletters/4152921-the-hills-morning-report-trump-advisers-charged-with-georgia-election-scheme/"
  },
  {
    "text": "New Hampshire 2024: DeSantis Fades, Trump Maintains Lead in Primary  —  Home Polls New Hampshire 2024: DeSantis Fades, Trump Maintains Lead in Primary  —  Kelly Ayotte Leads Joyce Craig in Potential Granite State Gubernatorial Matchup  —  A new Emerson College Polling survey … ",
    "url": "https://emersoncollegepolling.com/new-hampshire-2024-desantis-fades-trump-maintains-lead-in-primary/"
  },
  {
    "text": "Hunter Biden's top lawyer asks to withdraw from case  —  Hunter Biden's lead criminal defense attorney asked a federal judge on Tuesday for permission to withdraw from the case because he could now be called as a witness in future proceedings.  —  Christopher Clark, Biden's longtime defense lawyer … ",
    "url": "https://www.cnn.com/2023/08/15/politics/hunter-biden-lawyer-christopher-clark/"
  },
  {
    "text": "Hillary Clinton expresses ‘profound sadness’ over indictments  —  In an interview on MSNBC, Hillary Clinton said she feels “profound sadness” that the U.S. has a former president who has faced indictments “that went right to the heart of whether or not our democracy would survive.”",
    "url": "https://www.nbcnews.com/politics/donald-trump/live-blog/trump-georgia-indictment-rcna98900/rcrd16869?canonicalCard=true"
  },
  {
    "text": "The Various Kinds of Georgia Crimes in the RICO Indictment  —  There's so much good reporting out of Georgia that I'm going to mostly leave close coverage of the Georgia case to them going forward.  —  But the Georgia prosecution will interact with Jack Smith's ongoing investigation in interesting ways.",
    "url": "https://www.emptywheel.net/2023/08/15/the-various-kinds-of-georgia-crimes-in-the-rico-indictment/"
  },
  {
    "text": "Former high-level FBI official pleads guilty in connection to scheme working for sanctioned Russian oligarch  —  The former head of counterintelligence for the FBI's New York field office pleaded guilty Tuesday to one count of conspiracy in connection to a scheme working for a sanctioned Russian oligarch in 2021.",
    "url": "https://www.cnn.com/2023/08/15/politics/charles-mcgonigal-fbi/"
  },
  {
    "text": "Arkansas rejects AP African American Studies, cites Arkansas law on “prohibited topics”  —  The Arkansas Department of Education (DOE) abruptly rejected AP African American Studies, saying the course may violate Arkansas law.  “The department encourages the teaching of all American history … ",
    "url": "https://popular.info/p/arkansas-rejects-ap-african-american"
  }
]