[
  {
    "text": "Montana GOP Senate candidate says he lied to ranger about gunshot wound in 2015  —  Tim Sheehy was cited for illegally discharging a weapon in a national park but says he made up the gunshot to cover up a bullet wound he received as a Navy SEAL in Afghanistan that he never reported to superiors",
    "url": "https://www.washingtonpost.com/politics/2024/04/06/tim-sheehy-montana-senate-gunshot-wound-national-park/"
  },
  {
    "text": "Biden may have trouble getting on Ohio's general election ballot, state's top elections official warns  —  In a letter to Ohio's Democratic Party chair, Secretary of State Frank LaRose warns that the Democratic National Convention will take place after a state deadline to declare a candidate.",
    "url": "https://www.nbcnews.com/politics/2024-election/biden-may-trouble-getting-ohios-general-election-ballot-rcna146706"
  },
  {
    "text": "Biden could face challenges getting on Ohio general ballot  —  The state's Dems were alerted Joe Biden could be non-compliant with state law.  —  President Joe Biden delivers remarks during a campaign event with Vice President Kamala Harris in Raleigh, N.C., March 26, 2024.",
    "url": "https://abcnews.go.com/Politics/biden-face-challenges-ohio-general-ballot/story?id=108912620"
  },
  {
    "text": "Biden hauls in $90 million in March as campaign embarks on general election blitz  —  President Joe Biden raised more than $90 million for his reelection campaign and the Democratic Party in March, a whopping haul in a month that saw him pivot to a general election posture … ",
    "url": "https://www.cnn.com/2024/04/06/politics/biden-fundraising-march/"
  },
  {
    "text": "Colorado Sun politics reporter kicked out of GOP state assembly  —  A Colorado Sun politics reporter was escorted out of the state GOP assembly by a sheriff's deputy Saturday after being told that party Chairman Dave Williams found her “current reporting to be very unfair.”",
    "url": "https://coloradosun.com/2024/04/06/colorado-republican-party-kicks-out-colorado-sun-reporter/"
  },
  {
    "text": "Anonymous users are dominating right-wing discussions online.  They also spread false information  —  NEW YORK (AP) — The reposts and expressions of shock from public figures followed quickly after a user on the social platform X who uses a pseudonym claimed that a government website had revealed … ",
    "url": "https://apnews.com/article/misinformation-anonymous-accounts-social-media-2024-election-8a6b0f8d727734200902d96a59b84bf7"
  },
  {
    "text": "Sen. John Fetterman blasts squatters, violent crime: ‘I am not woke’  —  Pennsylvania Sen. John Fetterman ripped the idea of “squatter's rights” during an exclusive interview with The Post this week.  —  “Squatters have no rights,” Fetterman said, adding that the issue was one he often dealt … ",
    "url": "https://nypost.com/2024/04/06/us-news/fetterman-blasts-squatters-violent-crime-i-am-not-woke/"
  },
  {
    "text": "Trump Is Accidentally Exposing Aileen Cannon's Shady Pro-MAGA Game  —  When Judge Aileen Cannon handed down her latest ruling in the prosecution of Donald Trump for stealing classified documents, many legal observers immediately understood the shady gamesmanship lurking behind it.",
    "url": "https://newrepublic.com/article/180514/trump-judge-aileen-cannon-ruling-shady-maga-game"
  },
  {
    "text": "April 5, 2024  —  Today offered yet more evidence that Biden's rejection of the Republicans' supply-side economics in favor of investing in ordinary Americans is paying off with high growth, low unemployment, and strong wages.  —  Today's jobs report from the U.S. Department of Labor … ",
    "url": "https://heathercoxrichardson.substack.com/p/april-5-2024"
  },
  {
    "text": "Cecil ‘Chip’ Murray, L.A. civil rights icon and spiritual leader, dead at 94  —  The Rev. Dr. Cecil L.  “Chip” Murray, who made the First African Methodist Episcopal Church the most prestigious Black pulpit in Los Angeles, attracting presidents, governors and mayors to hear his dynamic sermons, has died.",
    "url": "https://www.latimes.com/obituaries/story/2024-04-06/cecil-murray-dead"
  },
  {
    "text": "Biden Waves His First-Term Résumé at a Skeptical America  —  With increasing urgency, the president is trying to impress upon voters that he has accomplished quite a bit — even if they don't see it in their lives yet.  —  President Biden is discovering that passing … ",
    "url": "https://www.nytimes.com/2024/04/06/us/politics/biden-2024-campaign.html"
  },
  {
    "text": "Mass. GOP ousts veteran Republican power player Ron Kaufman from RNC post  —  Kaufman, a former treasurer for the Republican National Committee, was upset by Brad Wyatt in a narrow 37-35 vote taken at a Republican State Committee meeting.  —  BURLINGTON, Massachusetts … ",
    "url": "https://www.politico.com/news/2024/04/06/massachusetts-gop-ousts-ron-kaufman-from-rnc-post-00150911"
  },
  {
    "text": "Calls grow for RFK Jr. to drop out after remarks sympathetic to Jan. 6 rioters  —  MoveOn Executive Director Rahna Epting joins MSNBC's Ali Velshi to discuss why independent presidential candidate Robert Kennedy Jr. should end his bid for the White House.",
    "url": "https://www.msnbc.com/the-last-word/watch/calls-grow-for-rfk-jr-to-drop-out-after-remarks-sympathetic-to-jan-6-rioters-208454213930"
  },
  {
    "text": "‘Extreme’ US anti-abortion group ramps up lobbying in Westminster  —  The UK branch of the Alliance Defending Freedom has increased its spending and is forging ties with key MPs  —  A rightwing Christian lobby group that wants abortion to be banned has forged ties with an adviser … ",
    "url": "https://www.theguardian.com/world/2024/apr/06/extreme-us-anti-abortion-group-ramps-up-lobbying-in-westminster"
  }
]