[
  {
    "text": "The Story Behind Trump's Gag Order Involves a Man Under Criminal Investigation for Stalking (Exclusive)  —  A Wisconsin man behind the digital campaign that prompted Donald Trump's gag order received three 50-year restraining orders and two criminal convictions resulting in jail time for harassing women",
    "url": "https://themessenger.com/politics/the-story-behind-trumps-gag-order-involves-a-man-under-criminal-investigation-for-stalking"
  },
  {
    "text": "Trump Got a Big Sign the Supreme Court Doesn't Have His Back  —  Donald Trump may have handpicked three members of the Supreme Court's conservative majority.  That doesn't mean they are doing him any favors.  —  Former President Donald Trump has tried every legal trick in the book to postpone … ",
    "url": "https://www.vice.com/en/article/ak3qv4/trump-got-a-big-sign-the-supreme-court-doesnt-have-his-back"
  },
  {
    "text": "Jack Smith is still scrutinizing John Eastman  —  Eastman, a former top Trump attorney, is facing the loss of his law license in California — and the special counsel's office appears to be interested in materials from that case.  —  Federal prosecutors don't appear to be done with John Eastman just yet.",
    "url": "https://www.politico.com/news/2023/12/14/jack-smith-john-eastman-trump-records-00131823"
  },
  {
    "text": "When the New York Times lost its way  —  America's media should do more to equip readers to think for themselves  —  Are we truly so precious?  \" Dean Baquet, the executive editor of the New York Times, asked me one Wednesday evening in June 2020.  I was the editorial-page editor of the Times … ",
    "url": "https://www.economist.com/1843/2023/12/14/when-the-new-york-times-lost-its-way"
  },
  {
    "text": "‘Are We Truly So Precious?’:  James Bennet's Damning NYT Portrayal  —  The former Times editorial page editor clears the record on his controversial 2020 firing.  —  Three years after his high-profile firing from the New York Times, James Bennet has told his side of the story in a damning portrait of the Times.",
    "url": "https://www.politico.com/news/magazine/2023/12/14/james-bennet-nyt-firing-00131826"
  },
  {
    "text": "Congress approves bill barring any president from unilaterally withdrawing from NATO  —  Congress has approved legislation that would prevent any president from withdrawing the United States from the North Atlantic Treaty Organization (NATO) without approval from the Senate or an Act of Congress.",
    "url": "https://thehill.com/homenews/4360407-congress-approves-bill-barring-president-withdrawing-nato/"
  },
  {
    "text": "Republicans Tap Israeli Military Veteran to Run for Santos's Seat  —  Party leaders believe Mazi Melesa Pilip has the potential to be a breakout star.  But she has little political experience and her policy views are largely unknown.  —  Republicans battling to hold onto the New York House seat vacated … ",
    "url": "https://www.nytimes.com/2023/12/14/nyregion/pilip-santos-special-election.html"
  },
  {
    "text": "New York Republicans choose ex-Israel Defense Forces soldier as nominee to replace George Santos  —  County party leaders selected the Nassau County legislator to be the GOP nominee in February's special election.  —  New York Republicans have selected Nassau County legislator Mazi Melesa Pilip … ",
    "url": "https://www.nbcnews.com/politics/2024-election/new-york-republicans-choose-mazi-melesa-pilip-house-nominee-replace-ge-rcna129426?taid=657b4ffaa7e88e0001afe63c"
  },
  {
    "text": "Giuliani's words used against him in poll worker defamation trial  —  Rudy Giuliani repeatedly promised that he would use his defamation trial to explain why he falsely claimed two Georgia poll workers helped steal the 2020 election.  Instead, he was silent in court.",
    "url": "https://www.washingtonpost.com/dc-md-va/2023/12/14/giuliani-defamation-trial-testimony-georgia-election-workers/"
  },
  {
    "text": "‘He has no right to offer defenseless civil servants up to a virtual mob’  —  Attorneys for Ruby Freeman and Shaye Moss are urging the eight-member panel to award the women $24 million apiece for Rudy Giuliani's defamation against them.  —  A Washington, D.C. jury is set to begin considering … ",
    "url": "https://www.politico.com/news/2023/12/14/rudy-giuliani-jury-georgia-election-00131796"
  },
  {
    "text": "Morning Consult |  Bloomberg News Partnership Survey: Biden's and Trump's Ballot Performance as of Early December 2023  —  Trump leads Biden in all seven swing states, regardless of whether or not third party candidates are listed. … This survey, which identifies key issues in the 2024 election … ",
    "url": "https://pro.morningconsult.com/articles/2024-swing-states-survey-key-issues-ballot-performance-december-2023"
  },
  {
    "text": "Israel-Hamas War  —  Washington Urges Israel to Scale Back Ground War in Gaza by Year's End … U.S. wants Israel to scale down its ground campaign in Gaza within weeks.  —  The Biden administration has told the Israeli government that it wants Israel to end its large-scale ground campaign … ",
    "url": "https://www.nytimes.com/live/2023/12/14/world/israel-hamas-war-gaza-news"
  },
  {
    "text": "The Republican leading the probe of Hunter Biden has his own shell company and complicated friends  —  Rep. James Comer, a multimillionaire farmer, boasts of being one of the largest landholders near his rural Kentucky hometown, and he has meticulously documented nearly all of his landholdings … ",
    "url": "https://apnews.com/article/comer-shell-company-biden-hunter-impeachment-6fde28673d5dced307b95cab8425c7ba"
  },
  {
    "text": "Jeffries: Government will shut down unless House GOP yields on demands  —  House Minority Leader Hakeem Jeffries (D-N.Y.) is drawing red lines when it comes to 2024 spending, warning Thursday that the government will close its doors if House Republicans continue to demand funding levels below … ",
    "url": "https://thehill.com/homenews/house/4360885-jeffries-shut-down-house-gop/"
  },
  {
    "text": "McCarthy Calls Gaetz ‘Crazy’ and Entertains Role in a Possible Trump Administration  —  ‘I believe in public service,’ former Speaker McCarthy told reporters when asked if he would take a job from Donald Trump  —  On his last day as a working member of Congress, Rep. Kevin McCarthy, R-Calif. … ",
    "url": "https://themessenger.com/politics/mccarthy-calls-gaetz-crazy-and-entertains-role-in-a-possible-trump-administration"
  },
  {
    "text": "Cheney's book tops NYT print and e-book bestseller lists  —  Former Rep. Liz Cheney's (R-Wyo.) new memoir clinched the No. 1 spots on the weekly New York Times bestselling book lists for hardcover and e-book editions for the first week since its debut.  —  The New York Times book bestseller lists … ",
    "url": "https://thehill.com/homenews/house/4360543-cheney-book-tops-nyt-bestseller-lists/"
  },
  {
    "text": "Coca-Cola recalled 2,000 cases of drinks due to potential contamination  —  The FDA says Coca-Cola took about 2,000 cases of Spite, Diet Coke, and Fanta off shelves in the Deep South because of possible ‘foreign material’ in cans.  —  Coca-Cola is recalling cans of Diet Coke, Sprite … ",
    "url": "https://www.nbcnews.com/business/consumer/coca-cola-recalled-cases-drinks-due-potential-contamination-rcna129609"
  },
  {
    "text": "Sources: Christian Ziegler wants multimillion-dollar buyout to step down as Florida GOP Chair  —  Christian Ziegler wants a multimillion-dollar buyout to resign as the Republican Party of Florida's (RPOF) Chair, party sources confirmed.  —  The demand comes as the political leader remains under investigation … ",
    "url": "https://floridapolitics.com/archives/649068-sources-christian-ziegler-wants-multi-million-buyout-to-step-down-as-florida-gop-chair/"
  }
]