[
  {
    "text": "Donald's Desperate Demand: Trump Files for Mistrial in New York Bank Fraud Case  —  Trump's lawyers made a 30-page court filing on Wednesday seeking a mistrial, a move they've telegraphed for a while but still marks a new low in the case. … Seeing no way out of his bank fraud trial … ",
    "url": "https://www.thedailybeast.com/donalds-desperate-demand-trump-files-for-mistrial-in-new-york-bank-fraud-case"
  },
  {
    "text": "Trump files motion for mistrial in NY fraud case  —  Former President Trump's legal team on Wednesday requested a mistrial in his New York fraud case, claiming that the trial judge and his principal law clerk's purported bias against Trump has “tainted” the case.",
    "url": "https://thehill.com/regulation/court-battles/4310913-trump-files-motion-for-mistrial-in-ny-fraud-case/"
  },
  {
    "text": "Conservatives hold back on Johnson ouster threat — but plot other payback  —  The House GOP's right flank is furious the new speaker worked with Democrats to avoid a shutdown, a move that essentially mirrored Kevin McCarthy's last act on the job.  —  Speaker Mike Johnson is averting … ",
    "url": "https://www.politico.com/news/2023/11/14/mike-johnson-speaker-shutdown-democrats-00127083"
  },
  {
    "text": "House passes bill to avert government shutdown, sends to Senate  —  Senate leaders say they will take up the legislation ‘as soon as possible’ to beat the Saturday deadline when federal funds expire  —  The House on Tuesday passed stopgap legislation to keep the federal government operating past … ",
    "url": "https://www.washingtonpost.com/business/2023/11/14/government-shutdown-house-bill-vote/"
  },
  {
    "text": "How the next Republican president could stop most abortions without Congress  —  The next Republican president could effectively ban most abortions through a simple policy change at the Department of Justice, experts and advocates on both sides of the abortion debate say.",
    "url": "https://www.axios.com/2023/11/15/us-abortion-ban-republican-president-2024-trump"
  },
  {
    "text": "New Hampshire 2024: Haley Surges to Second Place While Trump Maintains Lead  —  Haley Outperforms Trump and DeSantis Against Biden Among New Hampshire Voters  —  A new Emerson College Polling/WHDH poll of New Hampshire voters finds former President Donald Trump with 49% of voters' support … ",
    "url": "https://emersoncollegepolling.com/new-hampshire-2024-haley-surges-to-second-place-while-trump-maintains-lead/"
  },
  {
    "text": "GOP Sen. Mullin Says His Offer to Brawl With Union Leader Was ‘Oklahoma Values’  —  WHOLESOME  —  Sen. Markwayne Mullin (R-OK) said he was nobly representing “Oklahoma values” when he challenged a union boss to a fight Tuesday.  A meeting of the Senate HELP Committee went off the rails … ",
    "url": "https://www.thedailybeast.com/gop-sen-mullin-says-his-offer-to-brawl-with-union-leader-was-oklahoma-values"
  },
  {
    "text": "Speaker Mike Johnson calls separation of church and state a “misnomer” … Of course it comes from a phrase that was in a letter that [Thomas] Jefferson wrote, it's not in the Constitution,\" Johnson said.  — “What he was explaining is they did not want the government to encroach upon the church … ",
    "url": "https://www.axios.com/2023/11/15/mike-johnson-separation-church-state-misnomer"
  },
  {
    "text": "Hundreds of Jewish Marchers Left Stranded by ‘Malicious’ Bus Drivers  —  Three hundred Jewish marchers never made it to Tuesday's “March for Israel” in Washington, D.C., in what is being described as the “deliberate and malicious” actions of some bus drivers.",
    "url": "https://redstate.com/terichristoph/2023/11/15/deliberate-and-malicious-300-jewish-marchers-left-stranded-when-bus-drivers-refused-to-drive-them-n2166368"
  },
  {
    "text": "Silicon Valley's worldview is not just an ideology; it's a personality disorder.  —  Silicon Valley's ideology is this: Libertarianism for me.  Feudalism for thee.  —  In more detail:  —  • Surveillance, manipulation and coercion; at first, just for profit, later by necessity, and ultimately for the hell of it",
    "url": "https://crookedtimber.org/2023/11/15/silicon-valleys-worldview-is-not-just-an-ideology-its-a-personality-disorder/"
  },
  {
    "text": "US public support for Israel drops; majority backs a ceasefire, Reuters/Ipsos shows  —  U.S. public support for Israel's war against Hamas militants in Gaza is eroding and most Americans think Israel should call a ceasefire to a conflict that has ballooned into a humanitarian crisis, according to a new Reuters/Ipsos poll.",
    "url": "https://www.reuters.com/world/us-public-support-israel-drops-majority-backs-ceasefire-reutersipsos-2023-11-15/"
  },
  {
    "text": "Sunnylands Statement on Enhancing Cooperation to Address the Climate Crisis  —  Recalling the meeting between President Xi Jinping and President Joseph R. Biden in Bali, Indonesia, the United States and China reaffirm their commitment to work jointly and together with other countries to address the climate crisis.",
    "url": "https://www.state.gov/sunnylands-statement-on-enhancing-cooperation-to-address-the-climate-crisis/"
  },
  {
    "text": "Biden compares Trump's ‘vermin’ remarks to Nazi rhetoric  —  Biden slammed former President Donald Trump's remarks last weekend that characterized his political opponents as “vermin” who pose threats within the country.  —  President Joe Biden on Tuesday decried former President Donald … ",
    "url": "https://www.nbcnews.com/politics/2024-election/biden-compares-trumps-vermin-remarks-nazi-rhetoric-rcna125266"
  },
  {
    "text": "Stop Corporatizing My Students  —  I have taught creative writing in Mississippi's flagship university for over 20 years, and I've witnessed a powerful outcome: students who master written and spoken communication can change the world.  —  Which is why the educational trend focusing on student outcomes is so alarming.",
    "url": "https://www.nytimes.com/2023/11/15/opinion/education-humanities-college-degree.html"
  },
  {
    "text": "Hunter Biden seeks to subpoena Trump, Barr in criminal case  —  Hunter Biden requested Wednesday to subpoena former President Trump and three senior officials who served in his administration's Justice Department, seeking evidence that Biden's criminal prosecution is politically motivated.",
    "url": "https://thehill.com/regulation/court-battles/4310911-hunter-biden-seeks-to-subpoena-trump-barr-in-criminal-case/"
  },
  {
    "text": "Meta Allows Ads Claiming Rigged 2020 Election on Facebook, Instagram  —  Company weighed free-speech considerations in changing its policy last year  —  Meta Platforms will let political ads on Facebook and Instagram question the legitimacy of the 2020 U.S. presidential election … ",
    "url": "https://www.wsj.com/tech/meta-allows-ads-claiming-rigged-2020-election-on-facebook-instagram-309b678d?mod=followamazon"
  },
  {
    "text": "Oklahoma Supreme Court keeps anti-abortion laws on hold while challenge is pending  —  The Oklahoma Supreme Court reiterated its position on Tuesday in a 5-4 opinion that the state constitution guarantees a woman's right to an abortion when necessary to preserve her life … ",
    "url": "https://apnews.com/article/oklahoma-supreme-court-abortion-8e6160880139b86d654dd0531831e945"
  },
  {
    "text": "Trump allowed to stay on Michigan presidential ballot, judge rules … - Several states are seeing lawsuits arguing that the Republican primary front-runner's actions surrounding the Jan. 6 U.S. Capitol riot should disqualify him from serving as president under the Civil War-era amendment's insurrection clause.",
    "url": "https://www.axios.com/2023/11/15/trump-michigan-presidential-ballot-ruling"
  },
  {
    "text": "Haley calls for social media reforms targeting user accountability  —  Former South Carolina Gov. Nikki Haley (R) called for social media reforms targeting user accountability in a post Tuesday.  —  “When I get into office, the first thing we have to do, social media accounts … ",
    "url": "https://thehill.com/homenews/campaign/4309883-haley-urges-social-media-reforms-user-accountability/"
  },
  {
    "text": "Biden bets big on early ads over door-to-door campaigning  —  President Biden's re-election team has spent more than $50 million on TV and digital ads in swing states this year — and next to nothing on local organizers to begin reaching voters in person.",
    "url": "https://www.axios.com/2023/11/15/biden-early-advertising-campaign-2024"
  },
  {
    "text": "Relentless positivity replaced by ‘vermin’ and ‘scum’ in the modern GOP  —  Tim Scott never mastered the art of the beef, a senior Scott adviser told POLITICO.  —  Pour one out for sunny, Reaganesque Republicanism.  —  The latest blow came this week, when Tim Scott, the second of two candidates … ",
    "url": "https://www.politico.com/news/2023/11/15/republicans-positivity-pence-tim-scott-00127105"
  },
  {
    "text": "Senate Dems take major step towards ending Tuberville's military holds  —  It will now require at least nine Republicans to support it on the Senate floor.  Those prospects are iffy.",
    "url": "https://www.politico.com/live-updates/2023/11/14/congress/tuberville-nominations-rules-committee-change-senate-00127031"
  }
]