[
  {
    "text": "Johnson's margin drops to one vote as Gallagher heads for early exit  —  Allies of the Wisconsin Republican say he was long jaded by the antics of the House following the ouster of Speaker Kevin McCarthy.",
    "url": "https://www.politico.com/live-updates/2024/03/22/congress/gallagher-leaving-early-00148586"
  },
  {
    "text": "Republican Rep. Mike Gallagher will resign early, leaving House majority hanging by a thread  —  House Republicans lost another member in Rep. Ken Buck, R-Colo., on Friday.  Gallagher's early departure could leave Republicans with just one vote to spare on legislation.",
    "url": "https://www.nbcnews.com/politics/congress/republican-mike-gallagher-resign-early-house-majority-shrinks-rcna144672"
  },
  {
    "text": "Moscow concert attack live updates: Dozens reported dead after shooting  —  What we know about the Moscow concert attack … Public events across Russia called off after attack  —  Several regional leaders across Russia, including in the annexed Kherson region of Ukraine … ",
    "url": "https://www.nbcnews.com/news/world/live-blog/russia-moscow-concert-attack-shooting-rcna144706"
  },
  {
    "text": "ISIS claims responsibility for attack at Moscow-area concert venue that left at least 60 dead  —  ISIS has claimed responsibility for an attack at a popular concert venue complex near Moscow Friday after assailants stormed the venue with guns and incendiary devices, killing at least 60 people and injuring 145.",
    "url": "https://www.cnn.com/2024/03/22/europe/crocus-moscow-shooting"
  },
  {
    "text": "Gunmen Kill at Least 60 at Moscow Concert Hall, Russian Officials Say  —  U.S. officials said the Islamic State was responsible for the attack, one of the deadliest in Russia's capital region in more than a decade.  —  Here is the latest on the attack in Russia.",
    "url": "https://www.nytimes.com/live/2024/03/22/world/moscow-shooting"
  },
  {
    "text": "Terrorist attack at concert hall outside Moscow Latest updates … a few seconds ago  —  Putin recently dismissed U.S. warning of potential terrorist attacks in Moscow  —  On March 19, Vladimir Putin dismissed warnings from U.S. diplomats that there was an imminent risk of a terrorist attack at a crowded venue in Moscow.",
    "url": "https://meduza.io/en/live/2024/03/22/terrorist-attack-at-concert-hall-outside-moscow"
  },
  {
    "text": "Trump is about to get $3 billion richer after deal is approved to take his company public.  But it won't solve his cash crunch  —  Investors have approved a deal on Friday to make Truth Social owner Trump Media a publicly traded company.  —  The green light from shareholders clears … ",
    "url": "https://www.cnn.com/2024/03/22/business/trump-truth-social-dwac-shares"
  },
  {
    "text": "NBC hires former RNC chair Ronna McDaniel, who has demonized the press and refused to acknowledge Biden was fairly elected  —  NBC News on Friday announced that it had hired Ronna McDaniel, the former Republican National Committee chair who has repeatedly attacked the network and its journalists … ",
    "url": "https://www.cnn.com/2024/03/22/media/ronna-mcdaniel-nbc/"
  },
  {
    "text": "We Have Met the Enemy and He Owns the Valet Booth at Trump Tower  —  As we can see, the New York State civil judgment against Donald Trump, totaling roughly $450 million, and Trump's seeming inability to post a bond for the amount in order to appeal the judgment, is the real deal.",
    "url": "https://talkingpointsmemo.com/edblog/we-have-met-the-enemy-and-he-owns-the-valet-booth-at-trump-tower/sharetoken/3jTLuWi6kWgZ"
  },
  {
    "text": "F.B.I. Tells Passengers on Alaska Flight They May Have Been Crime Victims  —  Letters sent by the bureau's Seattle office are a sign that the Justice Department's investigation into Boeing, the maker of the plane whose fuselage panel blew off, is ramping up.",
    "url": "https://www.nytimes.com/2024/03/22/us/politics/fbi-investigation-boeing.html"
  },
  {
    "text": "Exclusive: Texas AG Ken Paxton could see criminal charges dropped in deal with prosecutors  —  Felony charges would be erased in exchange for community service and six-figure restitution.  —  Texas Attorney General Ken Paxton is nearing a resolution to the 9-year-old securities fraud charges … ",
    "url": "https://www.statesman.com/story/news/state/2024/03/22/ken-paxton-securities-fraud-case-felony-charges-texas-ag-plea-negotiation/72960517007/"
  },
  {
    "text": "Users shocked to find Instagram limits political content by default  —  Instagram never directly told users it was limiting political content by default.  —  Instagram users have started complaining on X (formerly Twitter) after discovering that Meta has begun limiting recommended political content by default.",
    "url": "https://arstechnica.com/tech-policy/2024/03/instagram-users-outraged-by-app-limiting-political-content-ahead-of-elections/"
  },
  {
    "text": "Harris to announce gun control measures on visit to Parkland, Fla.  —  Vice President Harris will make two announcements on gun violence prevention efforts Saturday in Parkland, Fla., where 14 students and three staff members were killed in a school shooting in 2018.",
    "url": "https://thehill.com/homenews/administration/4550438-harris-to-announce-gun-control-measures-on-visit-to-parkland-fla/"
  },
  {
    "text": "Judge permits Gaetz, Greene to sue California cities that canceled their events  —  But the judge blasted the GOP lawmakers for “pure conjecture” and “conspiracy theory” against civic groups.  —  A federal judge on Friday cleared the way for Reps. Matt Gaetz and Marjorie Taylor Greene to sue … ",
    "url": "https://www.politico.com/news/2024/03/22/judge-permits-gaetz-greene-to-sue-california-cities-that-canceled-their-events-00148693"
  },
  {
    "text": "‘Even stronger’ than imagined: DOJ's sweeping Apple lawsuit draws expert praise … The Department of Justice's antitrust division has come into its own, having filed its third tech monopoly lawsuit in four years. … The DOJ describes a sweeping arc of behaviors by Apple … ",
    "url": "https://www.theverge.com/2024/3/22/24109033/doj-apple-antitrust-lawsuit-legal-expert-praise"
  },
  {
    "text": "National monument honoring enslaved Black people set to open … - It comes as some states in recent years have passed bills limiting the discussion of slavery in public schools. … - The 17-acre site combines historical artifacts, contemporary art, original research … ",
    "url": "https://www.axios.com/2024/03/23/national-monument-enslaved-black-people-eji"
  },
  {
    "text": "Ukraine denies US requested to halt strikes on Russian oil refineries  —  Ukraine did not receive calls from the United States to cease attacks on Russian oil refineries, according to the advisor to the head of the Office of the President of Ukraine, Mykhailo Podolyak.",
    "url": "https://newsukraine.rbc.ua/news/ukraine-denies-us-requested-to-halt-strikes-1711118430.html"
  },
  {
    "text": "House GOP Member Admits Biden Impeachment Vote Is ‘Not Gonna Happen’  —  Rep. Tim Burchett said Republicans “don't have the guts” to take action after his colleagues failed to produce any hard evidence of Biden's presidential wrongdoing.  —  LOADING  —  House Republicans' monthslong effort … ",
    "url": "https://www.huffpost.com/entry/no-biden-impeachment-vote-says-gop-house-members_n_65fda6b2e4b087dad3054db8"
  }
]