[
  {
    "text": "Harris campaign suggests Trump avoiding debate because he doesn't want to defend ‘toxic positions’  —  Vice President Harris's campaign on Friday argued that former President Trump shared a handful of “toxic positions” on the debate stage earlier this week and suggested he's avoiding another debate so he doesn't have to defend them.",
    "url": "https://thehill.com/homenews/campaign/4878206-harris-campaign-trump-toxic-positions-debate/"
  },
  {
    "text": "If True, the ABC News Presidential Debate Could Be Rocked by Explosive Scandal  —  Anyone who watched the presidential debate hosted by ABC News on Tuesday knows that the moderators were biased and repeatedly fact-checked Trump while letting Kamala Harris's lies go unchallenged.",
    "url": "https://pjmedia.com/matt-margolis/2024/09/12/if-true-the-abc-news-presidential-debate-could-be-rocked-by-explosive-scandal-n4932479"
  },
  {
    "text": "Election 2024 live updates: Trump to hold news conference, campaign in Nev.; Harris back in Pa.  —  Trump says he won't debate Harris again before election  —  Election 2024  —  Follow live updates on the 2024 election and the contest between Vice President Kamala Harris … ",
    "url": "https://www.washingtonpost.com/elections/2024/09/13/2024-election-campaign-updates-harris-trump/"
  },
  {
    "text": "How Elon Musk Secretly Tried to Oust a Texas Prosecutor  —  In a bid to counter George Soros, the Tesla chief executive unsuccessfully backed the opponent of a progressive district attorney  —  Elon Musk secretly channeled hundreds of thousands of dollars into a local race in Travis County … ",
    "url": "https://www.wsj.com/us-news/elon-musk-texas-da-jose-garza-oust-atempt-206db043?st=0r4kfh0mlpe0euo"
  },
  {
    "text": "Elon Musk Secretly Funded Effort to Dump Texas Prosector  —  LONE STAR HATER  —  The billionaire's real target may have been the man he, in his increasingly conspiratorial worldview, has compared to the supervillain Magneto: George Soros.  —  Elon Musk secretly funneled hundreds of thousands … ",
    "url": "https://www.thedailybeast.com/elon-musk-secretly-funded-effort-to-dump-texas-prosector"
  },
  {
    "text": "Triple Hearsay: Original Sources of the Claim that Haitians Eat Pets in Ohio Admit No First-Hand Knowledge  —  “I'm not sure I'm the most credible source because I don't actually know the person who lost the cat,” Kimberly Newton told NewsGuard.  She is the Springfield, Ohio, resident whose story started it all",
    "url": "https://www.newsguardrealitycheck.com/p/origins-haitians-eating-pets-claim"
  },
  {
    "text": "Trump allies alarmed by far-right activist's influence on him … - “Marjorie Taylor Greene is right. … - Greene, a GOP firebrand known for her politically provocative speeches in Congress, has had a series of disagreements with Loomer long before this week.",
    "url": "https://www.axios.com/2024/09/13/trump-allies-far-right-activist-loomer"
  },
  {
    "text": "Texas comes for the right to interstate travel  —  States' rights for me, not for thee. … During Tuesday's debate, as Donald Trump tried to take credit for the demise of Roe while pretending a second Trump administration wouldn't obliterate abortion protections at a national level … ",
    "url": "https://www.publicnotice.co/p/texas-medical-records-abortion"
  },
  {
    "text": "Bipartisan group of lawmakers signs pledge to certify 2024 election results  —  More than 30 House members, including a half-dozen Republicans, have signed a bipartisan pledge to uphold the results of the 2024 election amid an increased focus on Congress' role in certifying the tally next January.",
    "url": "https://www.politico.com/live-updates/2024/09/13/congress/house-centrists-vow-to-certify-2024-election-00178945"
  },
  {
    "text": "Six House Republicans join bipartisan commitment to uphold election results  —  Six moderate House Republicans signed on to a bipartisan letter spearheaded by centrists pledging to respect the results of the 2024 election.  —  The “unity commitment” released on Friday is led by Rep. Josh Gottheimer … ",
    "url": "https://thehill.com/homenews/house/4878373-house-republicans-election-results/"
  },
  {
    "text": "Biden administration expected to unveil new evidence of RT's key role in Russian intelligence operations globally  —  The Biden administration is expected on Friday to announce a major effort to blunt the global influence of RT and expose what it says is the Russian state media network's key role … ",
    "url": "https://www.cnn.com/2024/09/13/politics/biden-administration-rt-russian-intelligence"
  },
  {
    "text": "The New York Times' Republicans-only Opinion Feature  —  A regular New York Times opinion feature includes outside writers — but only conservatives  —  If you read yesterday's New York Times, you likely came across a feature headlined “'Trump Brought Darkness; Harris Brought Light': 14 Writers on Who Won the Presidential Debate.”",
    "url": "https://www.findinggravity.net/p/the-new-york-times-republicans-only"
  },
  {
    "text": "In blow to Newsmax, judge rules Smartmatic's case over 2020 election lies will go to trial this month  —  A major defamation case against Newsmax will proceed to trial later this month, a judge ruled Thursday, dealing a blow to the right-wing network and setting the stage for the 2020 election … ",
    "url": "https://www.cnn.com/smartmatic-newsmax-trial-2020-election-fox/"
  },
  {
    "text": "Project 2025 cuts Social Security: Are you on the chopping block?  Check this map.  —  Should the Social Security Retirement Age Be Raised?  Yes.  — Heritage Foundation  —  You gotta hand it to the clever folks at the Heritage Foundation!  How do you make it even harder for seniors struggling with their healthcare and expenses?",
    "url": "https://thedemlabs.org/2024/09/12/project-2025-cuts-social-security-map-of-who-gets-hurt/"
  },
  {
    "text": "New York City Council Votes to Acknowledge, Study, and Address Legacy and Impact of Slavery and Racial Injustices in New York City  —  Council also passed legislation to bolster notifications for fires, support for victims  —  City Hall, NY - Today, the New York City Council voted … ",
    "url": "https://council.nyc.gov/press/2024/09/12/2692/"
  },
  {
    "text": "Harris or Trump?  Once Again, Election Results Could Take a While.  —  More Americans are using mail-in ballots, which take longer to count than those cast in person.  In several battleground states, a winner may not be apparent on Nov. 5.  —  The hosts of election night parties may want to book a room for more than just one night.",
    "url": "https://www.nytimes.com/2024/09/13/us/politics/election-night-results-timing.html"
  },
  {
    "text": "Charges expected in Iranian hack of Trump campaign: Sources  —  The charges could be filed as soon as next week.  —  Republican presidential nominee former President Donald Trump greets supporters prior to speaking during a campaign event at the Linda Ronstadt Music Hall, Sept. 12, 2024, in Tucson, Ariz.",
    "url": "https://abcnews.go.com/Politics/charges-expected-iranian-hack-trump-campaign-sources/story?id=113660527"
  }
]