[
  {
    "text": "CBS News poll — Trump has positive approval amid “energetic” opening weeks; seen as doing what he promised  —  With most describing him as “tough,” “energetic,” “focused” and “effective” — and as doing what he'd promised during his campaign — President Trump has started his term with net positive marks from Americans overall.",
    "url": "https://www.cbsnews.com/news/trump-approval-opinion-poll-2025-2-9/"
  },
  {
    "text": "Katie Britt vows to work with RFK Jr. after NIH funding cuts cause concern in Alabama  —  Alabama's junior U.S. senator said she will work with President Donald Trump's health secretary nominee Robert F. Kennedy, Jr. to “ensure our nation remains at the forefront” of innovation … ",
    "url": "https://www.al.com/news/2025/02/katie-britt-vows-to-work-with-rfk-jr-after-nih-funding-cuts-cause-concern-in-alabama.html"
  },
  {
    "text": "‘Bama Senator Howls Like Stuck Pig After She Sees NIH Cuts’ Impact in State  —  Yesterday I made the point that while research universities and academic medical centers may be coded blue in many ways, they're far from limited to blue states.  Indeed, overall they tend to be more crucial … ",
    "url": "https://talkingpointsmemo.com/edblog/bama-senator-howls-like-stuck-pig-after-she-sees-nih-cuts-impact-in-state"
  },
  {
    "text": "Democratic senator says his party is ready to shut down government over Trump's actions  —  Democratic Sen. Andy Kim (N.J.) said he and his fellow Democrats are ready to shut down the federal government over President Trump's recent actions.  —  “I cannot support efforts that will continue … ",
    "url": "https://thehill.com/homenews/5134820-andy-kim-democrats-government-shutdown-trump/"
  },
  {
    "text": "Trump's Shameful Campaign Against Transgender Americans  —  Some of the most deplorable episodes in U.S. history involve the government wielding the power of the state against minority groups: Black people, Indigenous people and gay people, to name just a few.",
    "url": "https://www.nytimes.com/2025/02/09/opinion/transgender-trump-orders.html?unlocked_article_code=1.vk4.L0SC.8---brwB6ghD&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "NYT Hypocrisy: Outlet Criticizes Trump's Attacks On Trans People That They Helped Usher In  —  Erin In The Morning is a reader-supported publication.  To receive new posts and support my work, consider becoming a subscriber.  —  Today, The New York Times Editorial Board published … ",
    "url": "https://www.erininthemorning.com/p/nyt-hypocrisy-outlet-criticizes-trumps"
  },
  {
    "text": "Exclusive: Inside Trump's Iran fear … - Iran clearly is still on Trump's mind: Last week, he said he'd given his team instructions to “obliterate” Iran if its operatives were to kill him.  — He later tempered that remark by saying he wanted a “verified nuclear peace agreement” with Iran … ",
    "url": "https://www.axios.com/2025/02/09/inside-trump-fear-iran-book"
  },
  {
    "text": "More Than 800K Have Lost $2B on Trump's Meme Coin  —  The token's price has crashed from $75 to $17.  —  ‘Thug’: Richard Gere Drags Trump in Award Acceptance Speech  —  ‘MILLIONAIRE CLOWNS’  —  “The millionaire clowns surrounding Trump are immature and narcissistic—a deadly mix,” Gere said.",
    "url": "https://www.thedailybeast.com/more-than-800k-have-lost-2b-on-trumps-meme-coin/"
  },
  {
    "text": "Musk calls for impeachment of judge who blocked DOGE access at Treasury  —  Elon Musk is calling for the impeachment of the federal judge who made a decision early Saturday morning that the Treasury Department should block access to anyone “other than civil servants with a need for access … ",
    "url": "https://thehill.com/policy/technology/5134725-elon-musk-impeachment-demand/"
  },
  {
    "text": "Federal Financial Watchdog Ordered to Cease Activity  —  In an email to staff of the Consumer Financial Protection Bureau, the agency's acting director ordered workers to cease “all supervision and examination activity.”  —  Employees of the Consumer Financial Protection Bureau were instructed to cease … ",
    "url": "https://www.nytimes.com/2025/02/08/us/politics/cfpb-vought-staff-finance-watchdog.html?unlocked_article_code=1.vk4.tkNM.755KLwhrxD95"
  },
  {
    "text": "A Quick Guide to the Lawsuits Against the Trump Orders  —  Dozens of suits have been filed that seek to stop some of President Trump's executive orders.  Here's a brief rundown.  —  The legal war over President Trump's blizzard of executive actions is intensifying, with new lawsuits and fresh rulings emerging now day and night.",
    "url": "https://www.nytimes.com/2025/02/09/us/trump-lawsuits-executive-orders.html?unlocked_article_code=1.vk4.OlDS.77A0NE29xCV-&smid=url-share"
  },
  {
    "text": "Early Crypto Traders Had Speedy Profit on Trump Coin as Others Suffered Losses  —  Some traders made tens of millions off a new cryptocurrency launched by President Trump and his sons.  Many others lost out.  —  The curious trade came a little past 9 p.m. on Jan. 17 … ",
    "url": "https://www.nytimes.com/2025/02/09/us/politics/trump-crypto-memecoin.html?unlocked_article_code=1.vk4.eiNH.RhUhYwQ0OSBe&smid=bs-share"
  },
  {
    "text": "Kristi Noem: ‘Get rid of FEMA the way it exists today’  —  The DHS secretary backed Trump's proposal to shutter the disaster response agency.  —  Homeland Security Secretary Kristi Noem said she supports the idea of getting “rid of FEMA” as part of President Donald Trump's massive overhaul of the federal government.",
    "url": "https://www.politico.com/news/2025/02/09/kristi-noem-fema-00203266"
  },
  {
    "text": "NSA Waltz says gutting USAID ‘absolutely not’ handing power to China and Russia: Full interview  —  National Security Adviser Mike Waltz tells Meet the Press in an exclusive interview that USAID needs to realign its mission to fit President Trump's foreign policy vision, as the Trump administration takes steps to dismantle the agency.",
    "url": "https://www.nbcnews.com/meet-the-press/video/nsa-waltz-says-gutting-usaid-absolutely-not-handing-power-to-china-and-russia-full-interview-231499845771"
  },
  {
    "text": "House Republicans mull taxes on scholarships and changes to student loan programs  —  As Republicans in Congress look for ways to slash spending, some legislators are floating new taxes on college scholarships, an end to student loan repayment plans and a big hike in taxes on university endowments.",
    "url": "https://apnews.com/article/trump-administration-education-college-loans-532d52c2ccac8b4be459f7797fb63a73"
  },
  {
    "text": "Jim Jordan backs Elon Musk's authority to cut federal government  —  “It's something that people evaluated and voted for on November 5,” the Ohio Republican said.  —  Rep. Jim Jordan (R-Ohio) vehemently defended Elon Musk and his so-called Department of Government Efficiency's campaign … ",
    "url": "https://www.politico.com/news/2025/02/09/jim-jordan-backs-elon-musk-authority-00203273"
  },
  {
    "text": "Noem confident in legality of housing migrants at Guantánamo Bay  —  Department of Homeland Security Secretary Kristi Noem said she's confident that steps the government is taking to deport certain migrants from the U.S. mainland to Guantánamo Bay are legal.",
    "url": "https://thehill.com/policy/national-security/5134810-us-migrants-deported-guantanamo/"
  },
  {
    "text": "Trump reveals he's spoken with Putin by phone, says Russian president ‘wants to see people stop dying’ in Ukraine war  —  President Trump has spoken to Russian leader Vladimir Putin on the phone to try to negotiate an end to the Ukraine war, he told The Post in an exclusive interview aboard Air Force One Friday.",
    "url": "https://nypost.com/2025/02/08/us-news/trump-and-putin-in-talks-to-end-the-russia-ukraine-war/"
  }
]