[
  {
    "text": "What Americans should remember about Jan. 6  —  Four years ago, our democracy was put to the test — and prevailed.  —  Joe Biden is president of the United States.  —  On this Jan. 6, order will be called.  Clerks, staff and members of Congress will gather to certify the results of a free … ",
    "url": "https://www.washingtonpost.com/opinions/2025/01/05/president-biden-jan-6-democracy/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM2MDUzMjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM3NDM1NTk5LCJpYXQiOjE3MzYwNTMyMDAsImp0aSI6ImFlMjc4YmZjLTRlOGUtNGZjOS1hZDQ5LWNlOWY5Zjg0ODE5YiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9vcGluaW9ucy8yMDI1LzAxLzA1L3ByZXNpZGVudC1iaWRlbi1qYW4tNi1kZW1vY3JhY3kvIn0.D7SX-A_K83IvLq493kb52ukRKWvbmxjl25eZLxCGvyo&itid=gfta"
  },
  {
    "text": "The Internet Is Worse Than a Brainwashing Machine  —  A rationale is always just a scroll or a click away.  —  Try to remember for a moment how you felt on January 6, 2021.  Recall the makeshift gallows erected on the Capitol grounds, the tear gas, and the sound of the riot shields colliding with hurled flagpoles.",
    "url": "https://www.theatlantic.com/technology/archive/2025/01/january-6-justification-machine/681215/?gift=bQgJMMVzeo8RHHcE1_KM0a4qV9a0Rv2_NNVQ656zT6A&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Axios interview: Susie Wiles vows to block West Wing troublemakers … Wiles, who was co-campaign manager, gets much of the credit.  Two weeks from today, she'll bring her formula to Washington. … - The veteran Florida political operative — a former lobbyist who worked for Trump's GOP primary rival … ",
    "url": "https://www.axios.com/2025/01/06/axios-interview-susie-wiles-trump"
  },
  {
    "text": "Don't Let Trump Whitewash the Truth About Jan. 6  —  The nation needs to remember the facts of the violent insurrection four years ago despite the president-elect's attempts to rewrite history.  —  History, the saying goes, is written by the victors.  —  That particular flex is in motion today … ",
    "url": "https://www.bloomberg.com/opinion/articles/2025-01-06/don-t-let-trump-whitewash-the-truth-about-jan-6?accessToken=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzb3VyY2UiOiJTdWJzY3JpYmVyR2lmdGVkQXJ0aWNsZSIsImlhdCI6MTczNjE3MDUyMywiZXhwIjoxNzM2Nzc1MzIzLCJhcnRpY2xlSWQiOiJTUE8xQzlUMEcxS1cwMCIsImJjb25uZWN0SWQiOiJGMUM1Mzc1OEY5Qjg0MDZCOUJCNzMyODRDN0RBMEY3QyJ9.xW1Rl15QI2Kq_MFfB7IX8glM71bJGZ6eDNxNYFTpG5E"
  },
  {
    "text": "Four years later  —  The unapologetic nature of Trump's political renaissance is an ongoing menace  —  The scariest thing about contemporary American politics is that on January 7, 2021, it was widely acknowledged among American conservatives that Donald Trump's behavior on January 6th was completely unacceptable.",
    "url": "https://www.slowboring.com/p/four-years-later"
  },
  {
    "text": "Our National Day of Shame  —  The Bulwark grows!  The Bulwark will swallow the world!  —  Semafor let the cat out of the bag this morning on our first expansion of the new year.  We're bringing on reporter Adrian Carrasquillo for a new twice-weekly newsletter, Huddled Masses … ",
    "url": "https://www.thebulwark.com/p/our-national-day-of-shame"
  },
  {
    "text": "Jan. 6 and the path not taken  —  Four years ago we lived through a pivot point.  History could have gone one way, but went another.  —  For about a one-month period after the Jan. 6 everyone seemed truly appalled.  At that moment, America was poised to consign Trumpism to the dustbin of history.",
    "url": "https://donmoynihan.substack.com/p/jan-6-and-the-path-not-taken"
  },
  {
    "text": "Trudeau expected to announce resignation before national caucus meeting Wednesday  —  ////Justin Trudeau is expected to announce as early as Monday that he will resign as Liberal Party Leader, three sources said Sunday, as the Prime Minister faces a caucus revolt and dismal public opinion polls … ",
    "url": "https://www.theglobeandmail.com/politics/article-trudeau-expected-to-announce-resignation-before-national-caucus/"
  },
  {
    "text": "Trump aides ready ‘universal’ tariff plans — with one key change  —  President-elect's aides look at universal import duties, but only on certain sectors, among first big moves of presidency.  —  President-elect Donald Trump's aides are exploring tariff plans that would be applied … ",
    "url": "https://www.washingtonpost.com/business/2025/01/06/trump-tariff-economy-trade/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM2MTM5NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM3NTIxOTk5LCJpYXQiOjE3MzYxMzk2MDAsImp0aSI6ImIyY2QzNzBkLTgxNDctNGNjMy1iZjBlLWJlZTE0OTgzNzZkZCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9idXNpbmVzcy8yMDI1LzAxLzA2L3RydW1wLXRhcmlmZi1lY29ub215LXRyYWRlLyJ9.el2pftfrzzyx3P1kg79fnhzpBgd4Vi9xEtvIDwrVE98"
  },
  {
    "text": "Trump Seeks to Halt His Criminal Sentencing in New York  —  A Manhattan judge has already indicated that he will spare Donald J. Trump from jail time, but the president-elect is seeking to avoid the symbolic blow of the criminal proceeding.  —  President-elect Donald J. Trump has signaled … ",
    "url": "https://www.nytimes.com/2025/01/06/nyregion/trump-trial-sentencing-new-york.html"
  },
  {
    "text": "Biden bans new offshore oil and gas drilling in most federal waters  —  WASHINGTON — President Joe Biden is moving to ban new offshore oil and gas drilling in most U.S. coastal waters, a last-minute effort to block possible action by the incoming Trump administration to expand offshore drilling.",
    "url": "https://www.npr.org/2025/01/06/g-s1-41154/biden-ban-new-offshore-oil-gas-drilling"
  },
  {
    "text": "Trump says he's still open to two-bill track on GOP legislative priorities  —  President-elect Donald Trump publicly said that he's open to a two-bill approach to budget reconciliation, slightly walking back his Sunday night endorsement of tackling the border, energy and taxes in one mammoth package.",
    "url": "https://www.politico.com/live-updates/2025/01/06/congress/trump-still-open-to-two-bill-reconciliation-00196574"
  },
  {
    "text": "Paper Cuts  —  The Washington Post is expected to lay off dozens of staffers this week, Status has learned.  —  Layoffs are expected to rock The Washington Post this week, according to people familiar with the matter. … One person familiar with the matter said that the cuts will be deep, impacting many dozens of employees.",
    "url": "https://www.status.news/p/washington-post-layoffs"
  },
  {
    "text": "Biden Uses 72-Year-Old Law to Give Trump a Slap in the Face Before MAGA 2.0  —  The White House move could create a roadblock to one of President-elect Trump's major plans.",
    "url": "https://www.thedailybeast.com/biden-uses-72-year-old-law-to-give-trump-a-slap-in-the-face-before-maga-20/"
  },
  {
    "text": "Bluesky Captures More Unique Visitors Than Truth Social in November  —  Majority of Right Wing News Websites Grew Audience in Critical Month  —  TheRighting released its November 2024 election year traffic analysis of mobile and desktop traffic for right wing and mainstream news websites based on Comscore data.",
    "url": "https://therighting.com/traffic-reports/bluesky-captures-more-unique-visitors-than-truth-social-in-november/"
  },
  {
    "text": "No, Trump wasn't “confused” about the New Orleans attack  —  On New Year's Day, a driver intentionally steered a truck into a crowd in New Orleans, killing 14 people.  Trump and other MAGA leaders, echoing a false Fox News report, quickly rushed to blame President Biden's supposedly lax security at the border.",
    "url": "https://www.publicnotice.co/p/trump-new-orleans-attack-fox-misinformation"
  },
  {
    "text": "Pentagon agrees to historic legal settlement with LGBTQ+ veterans  —  The Pentagon has reached a historic legal settlement with more than 35,000 gay and lesbian military veterans who were dismissed because of their sexual orientation, and in many cases denied an honorable discharge and the array … ",
    "url": "https://www.cbsnews.com/news/pentagon-legal-settlement-lgbtq-veterans/"
  },
  {
    "text": "Trump transition falling short of hiring goals, sources say  —  A stack of employment offer letters is expected to go out Monday to political appointees in the new administration of President-elect Donald Trump, according to people familiar with the matter, with just two weeks to go before the inauguration.",
    "url": "https://www.cbsnews.com/news/trump-transition-falling-short-hiring-goals/"
  }
]