[
  {
    "text": "Statement from President Joe Biden on the Death of Hassan Nasrallah  —  Hassan Nasrallah and the terrorist group he led, Hezbollah, were responsible for killing hundreds of Americans over a four-decade reign of terror.  His death from an Israeli airstrike is a measure of justice for his many victims … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/09/28/statement-from-president-joe-biden-on-the-death-of-hassan-nasrallah/"
  },
  {
    "text": "Hezbollah confirms its leader Hassan Nasrallah was killed in an Israeli airstrike  —  Lebanon's Hezbollah group confirmed on Saturday that its leader and one of its founders, Hassan Nasrallah, was killed in an Israeli airstrike in Beirut the previous day.  A statement said Nasrallah “has joined his fellow martyrs.”",
    "url": "https://apnews.com/article/lebanon-israel-hezbollah-airstrikes-28-september-2024-c4751957433ff944c4eb06027885a973"
  },
  {
    "text": "Israeli military says Hezbollah leader Hassan Nasrallah killed in Beirut strike  —  Hezbollah released statement confirming death of terror chief  —  Join Fox News for access to this content  —  The Israeli Defense Forces (IDF) confirmed the leader of the Hezbollah terrorist organization … ",
    "url": "https://www.foxnews.com/world/israeli-military-says-hezbollah-leader-hassan-nasrallah-killed-beirut-strike"
  },
  {
    "text": "The Republican Freak Show  —  Like the man who leads it, the GOP is not just incidentally grotesque.  It is grotesque at its core.  —  the gop is a moral freak show, and freak shows attract freaks.  Which is why Mark Robinson fits in so well in today's Republican Party.",
    "url": "https://www.theatlantic.com/politics/archive/2024/09/mark-robinson-rfk-jr-trump/680064/"
  },
  {
    "text": "5 takeaways from this week's Trump-Harris polls  —  The polls are coming thick and fast with less than six weeks to go before Election Day.  —  Vice President Harris has seen broadly favorable polling results this week — with some caveats.  —  Harris now leads former President Trump … ",
    "url": "https://thehill.com/homenews/campaign/4904478-vice-president-harris-polls/"
  },
  {
    "text": "Childless GOP Candidate Borrows Family for Weird Photo Shoot  —  FAKE FAMILY VALUES  —  Anti-abortion Republican Derrick Anderson, who is running for Virginia's seventh congressional district, appears to be trying to appeal to women using a bizarre tactic.",
    "url": "https://www.thedailybeast.com/childless-gop-candidate-derrick-anderson-borrows-family-for-weird-photo-shoot"
  },
  {
    "text": "Vance appears at event hosted by hard-right Christian nationalist  —  The live event was hosted by Lance Wallnau, who has blended hard-right politics with Christian supremacy and who has demonized Kamala Harris.  —  MONROEVILLE, Pa. — Republican vice-presidential candidate JD Vance appeared Saturday … ",
    "url": "https://www.washingtonpost.com/elections/2024/09/28/jd-vance-christian-nationalism-lance-wallnau/"
  },
  {
    "text": "Harris to troll Trump on second debate during Georgia-Alabama game  —  The campaign has hired a plane to fly a banner over the Tuscaloosa, Ala., stadium and will run a television ad during the game.  —  Kamala Harris doesn't get to decide if Donald Trump debates her a second time.",
    "url": "https://www.washingtonpost.com/politics/2024/09/28/harris-trump-debate-alabama-georgia-football/"
  },
  {
    "text": "Brian Williams Set to Make Shock Election Night Return  —  COMEBACK  —  The broadcast news legend spent 28 years at NBC before leaving in 2021.  —  Journalist  —  Brian Williams' return to the broadcasting chair for live election coverage is “imminent,” a source told the Daily Beast.",
    "url": "https://www.thedailybeast.com/brian-williams-set-to-host-amazon-election-night-special"
  },
  {
    "text": "Michigan man charged with assaulting postal carrier over Kamala Harris flyer  —  (CBS DETROIT) — A 61-year-old Farmington Hills man faces multiple criminal charges after he allegedly assaulted a female postal carrier Thursday evening upon receiving a flyer in the mail featuring Vice President Kamala Harris.",
    "url": "https://www.cbsnews.com/detroit/news/postal-carrier-assault-kamala-harris-flyer/"
  },
  {
    "text": "Five things to know about Social Security reforms being considered in Congress  —  Legislation that would reform some aspects of Social Security is gaining steam in Congress.  —  The measure, dubbed the Social Security Fairness Act, seeks to do away with tax rules that proponents say have led … ",
    "url": "https://thehill.com/business/budget/4904464-social-security-reform-bill/"
  },
  {
    "text": "Exclusive: Kamala Harris campaign launches ‘Athletes for Harris’  —  There's “Swifties for Harris” and “Cat Ladies for Kamala” and “White Dudes for Harris.”  You can add one more to the list: “Athletes for Harris.”  —  The Harris campaign says it's launching “Athletes for Harris” … ",
    "url": "https://www.usatoday.com/story/sports/columnist/mike-freeman/2024/09/28/athletes-for-kamala-harris/75415123007/"
  },
  {
    "text": "How Trump's plan for mass deportations fits into U.S. history … - Trump wants to mobilize ICE agents — along with the FBI, federal prosecutors, the National Guard, and even local law enforcement officers — to carry out deportations.  — He says he would start with mass deportations … ",
    "url": "https://www.axios.com/2024/09/28/trump-mass-deportations-us-history"
  },
  {
    "text": "Tim Snyder: Trump reveals what a bad negotiator he is in Zelenskyy meeting  —  Yale University history professor Tim Snyder joins MSNBC's Ali Velshi to discuss former President Trump's meeting with Ukrainian President Volodymyr Zelenskyy and Trump's lie that he can negotiate a deal … ",
    "url": "https://www.msnbc.com/the-last-word/watch/tim-snyder-trump-reveals-what-a-bad-negotiator-he-is-in-zelenskyy-meeting-220352069588"
  },
  {
    "text": "Who created the “constitutional sheriff” myth?  Hint: It's not in the Constitution  —  Author Jessica Pishko on how two Arizona sheriffs created an entire mythology — and a dangerous movement  —  Four years ago, George Floyd's murder and the resulting months of demonstrations brought unprecedented scrutiny … ",
    "url": "https://www.salon.com/2024/09/28/created-the-constitutional-sheriff-myth-hint-its-not-in-the-constitution/"
  },
  {
    "text": "WATCH: Harris Barely Bothers to Speak During Her 1st Visit to the Border in AZ; Arizonan Calls Her ‘Liar’  —  Democrat presidential nominee Kamala Harris is in my home state of Arizona Friday, to visit Cochise County, and the border city of Douglas—a city split by the U.S.-Mexico border.",
    "url": "https://redstate.com/beccalower/2024/09/27/harris-az-border-remarks-n2179874"
  }
]