[
  {
    "text": "Potential Trump loss threatens destruction of modern GOP  —  An identity crisis.  A brutal power struggle.  Years in the wilderness.  — If Donald Trump is defeated in next month's election, the Republican Party will face a reckoning unprecedented in modern political history.",
    "url": "https://www.axios.com/2024/10/06/trump-election-loss-republican-future"
  },
  {
    "text": "Harris hits Trump on abortion record in “Call Her Daddy” interview … - “There are now 20 states with Trump abortion bans, including bans that make no exceptions for rape or incest,” Harris said on the podcast. … - “President Trump has been incredibly clear: the issue of abortion … ",
    "url": "https://www.axios.com/2024/10/06/harris-trump-abortion-call-her-daddy-podcast"
  },
  {
    "text": "Harris blasts Arkansas governor's comments about her lack of biological children  —  On the “Call Her Daddy” podcast, the vice president spoke about her “modern family” and lifting women up, rather than putting them down for not having kids.  —  Vice President Kamala Harris hit back at Arkansas GOP … ",
    "url": "https://www.nbcnews.com/politics/kamala-harris/harris-sarah-huckabee-sanders-children-humble-rcna174194"
  },
  {
    "text": "GOP looks to avoid disaster in Nebraska Senate race  —  Republicans are looking to avoid a disaster in the Nebraska Senate race amid signs that an independent candidate could be giving Sen. Deb Fischer (R-Neb.) a run for her money.  —  Independent Senate candidate and political newcomer Dan Osborn … ",
    "url": "https://thehill.com/homenews/campaign/4917075-nebraska-senate-race-independent/"
  },
  {
    "text": "‘SmartLess’ Podcast Snags Tim Walz Interview … Kamala Harris' vice presidential nominee will be virtually sitting down with the SmartLess podcast Monday, we hear.  —  Minnesota Gov. Walz, who is also appearing on Jimmy Kimmel Live tomorrow, will hold a Zoom conversation with the popular podcast hosts … ",
    "url": "https://deadline.com/2024/10/tim-walz-smartless-podcast-interview-1236108842/"
  },
  {
    "text": "The Press Gave Up On Telling The Truth This Week  —  Welcome to our 9th edition of Corporate Media Fails, and wow—that was quite a long year—I mean week.  Sometimes when I analyze the news, it seems like those in the Press have quit trying, and are now serving as stenographers for the Trump campaign.",
    "url": "https://www.dworkinsubstack.com/p/the-press-gave-up-on-telling-the"
  },
  {
    "text": "Former Google CEO Eric Schmidt says we should go all in on building AI data centers because ‘we are never going to meet our climate goals anyway’  — Ex-Google CEO Eric Schmidt urged more AI development, even though it requires so much energy.  — AI models require enormous data centers … ",
    "url": "https://www.businessinsider.com/eric-schmidt-google-ai-data-centers-energy-climate-goals-2024-10"
  },
  {
    "text": "Johnson won't say Biden won in 2020, raising worries on 2024's process  —  During a testy exchange on ABC News, the House speaker wouldn't say Trump lost in 2020, saying that the question was a “gotcha game” by the media.  —  House Speaker Mike Johnson (R-La.) wouldn't acknowledge Sunday … ",
    "url": "https://www.washingtonpost.com/politics/2024/10/06/mike-johnson-donald-trump-election/"
  },
  {
    "text": "Trump Reiterates He Wants to Be a ‘Dictator’ for ‘One Day’ at Wisconsin Rally  —  It's the GOP presidential nominee's fourth event in Wisconsin in eight days  —  Donald Trump held a rally for the second time in as many days, this time in Juneau, Wisconsin, on Sunday following his return to Butler, Pennsylvania, on Saturday.",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-reiterates-dictator-for-one-day-wisconsin-rally-1235127435/"
  },
  {
    "text": "Muslim faith leaders endorse Harris  —  The vice president is in need of allies in a community that remains frustrated with the administration's handling of the Israel-Hamas war.  —  A group of imams endorsed Vice President Kamala Harris in an open letter shared first with NBC News on Sunday … ",
    "url": "https://www.nbcnews.com/politics/kamala-harris/muslim-faith-leaders-endorse-kamala-harris-rcna174190"
  },
  {
    "text": "Bolsonaro-Backed Candidates Pull Ahead in Brazil Mayor Elections  — Most winners in Brazilian cities lean center-right so far  — A second round will be held in three weeks in 51 cities  —  Candidates backed by Jair Bolsonaro are pulling ahead in municipal elections that are considered … ",
    "url": "https://www.bloomberg.com/news/articles/2024-10-07/bolsonaro-backed-candidates-pull-ahead-in-brazil-mayor-elections"
  },
  {
    "text": "Vance says Trump administration would end funding to Planned Parenthood  —  While some states have halted government funds to Planned Parenthood, recent GOP-led efforts to defund the nonprofit nationwide have been largely unsuccessful.  —  Sen. JD Vance (R-Ohio), former president Donald Trump's running mate … ",
    "url": "https://www.washingtonpost.com/politics/2024/10/06/vance-defund-planned-parenthood/"
  },
  {
    "text": "Autocracy and Poverty  —  When I am on media, television hosts ask how democracy is relevant to people who are voting on kitchen-table issues.  That's easy.  —  When Trump destroys our democracy, he will also destroy our economy.  —  Autocracy will bring poverty.",
    "url": "https://snyder.substack.com/p/autocracy-and-poverty"
  },
  {
    "text": "KJP slammed after Hurricane Helene over mixed messages on whether FEMA resources used for migrants  —  White House press secretary Karine Jean-Pierre is facing heavy criticism after sending mixed messages on whether the Biden-Harris administration has been using FEMA resources to support migrants last week.",
    "url": "https://www.foxnews.com/politics/kjp-slammed-after-hurricane-helene-over-mixed-messages-whether-fema-resources-used-migrants"
  },
  {
    "text": "‘Shameful!’  Johnson slammed for saying Congress won't cut recess short to pass disaster relief aid  —  Although Republican House Speaker Mike Johnson (R-LA) plans to visit the western part of North Carolina this week in the “deadly and devastating” aftermath of Hurricane Helene … ",
    "url": "https://www.alternet.org/johnson-congress-helene/"
  },
  {
    "text": "Fact check: Six days of Trump lies about the Hurricane Helene response  —  Former President Donald Trump has delivered a barrage of lies and distortions about the federal response to Hurricane Helene.  —  While various misinformation about the response has spread widely without Trump's involvement … ",
    "url": "https://www.cnn.com/2024/10/06/politics/fact-check-trump-helene-response-north-carolina/"
  },
  {
    "text": "FEMA abandons devastated NC town residents because they can't drive around ‘road closed’ sign: 'Nobody's been bringing in supplies except civilians'  —  BAT CAVE, North Carolina — Residents of a tiny North Carolina town that was almost totally destroyed by Hurricane Helene fending for themselves … ",
    "url": "https://nypost.com/2024/10/06/us-news/fema-abandons-residents-of-devastated-nc-town-because-of-road-closed-sign/"
  },
  {
    "text": "What I texted President Biden about how to restore public trust during a hurricane of lies  —  Good afternoon from Washington, where we are enjoying the best fall weather yet while a toxic storm of lies, rumors, and conspiracy theories undermines our government's response to the historic hurricane that swept inland last weekend.",
    "url": "https://civic-texts.ghost.io/what-i-texted-president-niden-about-how-to-restore-public-trust-during-a-hurricane-of-lies/"
  }
]