[
  {
    "text": "Justice Thomas discloses two 2019 trips paid for by Harlan Crow  —  2023 financial disclosure reports for Supreme Court justices also show six-figure book payments for Kavanaugh, Gorsuch and Jackson  —  Supreme Court Justice Clarence Thomas has disclosed for the first time trips to Bali … ",
    "url": "https://www.washingtonpost.com/politics/2024/06/07/supreme-court-financial-disclosures-gifts-thomas/"
  },
  {
    "text": "Clarence Thomas, in Financial Disclosure, Acknowledges 2019 Trips Paid by Harlan Crow  —  The justice amended an earlier filing to include vacations to Bali and an exclusive California club paid for by the Texas billionaire Harlan Crow.  —  Justice Clarence Thomas acknowledged … ",
    "url": "https://www.nytimes.com/2024/06/07/us/supreme-court-disclosures-gifts.html"
  },
  {
    "text": "Robust job growth in May once again exceeds expectations  —  By nearly every metric, the latest jobs report points to a very strong U.S. job market.  The political implications have the potential to be dramatic.  —  Expectations heading into this morning showed projections of about 190,000 … ",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/robust-job-growth-may-exceeds-expectations-rcna156001"
  },
  {
    "text": "Is the US job market beginning to weaken?  Friday's employment report may provide hints  —  America's employers added a vigorous 272,000 jobs in May, accelerating from April and a sign that companies are still confident enough in the economy to keep hiring despite persistently high interest rates.",
    "url": "https://apnews.com/article/jobs-hiring-unemployment-economy-inflation-federal-reserve-d1d73005dbc40b081a555850a44e73d1"
  },
  {
    "text": "Fox News Poll: Trump holds 4-point edge in Florida rematch as majority says conviction won't matter to vote  —  Nearly 7 in 10 support legalizing marijuana and establishing the right to abortion  —  Former President Donald Trump won Florida in 2016 and 2020 and a new Fox News survey shows he is favored to win it again.",
    "url": "https://www.foxnews.com/official-polls/fox-news-poll-trump-holds-4-point-edge-florida-rematch-majority-says-conviction-wont-matter-vote"
  },
  {
    "text": "‘We Ride at Dawn’: The Federalist Came For Dolly Parton, Now Her Fans Are Coming For Them  —  When is The Federalist going to learn that it's a mistake to go after intensely popular and beloved pop stars just for the sake of contrarianism?  —  Not any time soon, going by their new attack on country music icon Dolly Parton.",
    "url": "https://www.mediaite.com/entertainment/we-ride-at-dawn-the-federalist-came-for-dolly-parton-now-her-fans-are-coming-for-them/"
  },
  {
    "text": "Convictions: The Many Crimes of Donald Trump: Bannon Banished  —  On July 1, three days before Independence Day, Stephen Kevin Bannon, the leprous-faced, multi-shirt-wearing, nihilistic windbag, must report to prison, to serve his four-month sentence for Contempt of Congress.",
    "url": "https://gregolear.substack.com/p/convictions-the-many-crimes-of-donald"
  },
  {
    "text": "Nashville School Shooter's Writings Leak: ‘I Hate Everything About My Gender’ (Update)  —  This week the Tennessee Star published a description of previously unseen writings by Audrey Hale.  The Star is one of the papers that is part of a lawsuit trying to force the Metro Nashville PD … ",
    "url": "https://hotair.com/john-s-2/2024/06/07/nashville-school-shooters-writings-finally-released-n3789823"
  },
  {
    "text": "The Hunter Biden Case Is Solid.  There's Something Rotten About It Too.  —  WILMINGTON, Delaware — The line between criminal prosecution and public flogging was hard to detect this week when federal prosecutors began their case against Hunter Biden for allegedly buying a gun in 2018 while addicted to drugs.",
    "url": "https://www.politico.com/news/magazine/2024/06/07/hunter-biden-trial-truths-column-00162083"
  },
  {
    "text": "Revisiting “the biggest political crime in American history, by far”  —  Remember “Obamagate”?  You should. … It's tough to remember now as Donald Trump regularly wails about the need for total presidential immunity, but four years ago, the then-president was a huge proponent of prosecuting presidents.",
    "url": "https://www.publicnotice.co/p/trump-obamagate-revisited-presidential-immunity"
  },
  {
    "text": "Isolated and inexperienced: A portrait of the judge overseeing Trump's documents case from veterans of her courtroom  —  Judge Aileen Cannon had been on the federal bench for little more than a year when a senior judge offered to preside over one of her first criminal trials in her isolated south Florida courthouse.",
    "url": "https://www.cnn.com/2024/06/07/politics/aileen-cannon-judge-trump-classified-documents/"
  },
  {
    "text": "Businessman Tells Jury He Bribed Senator Menendez With a Mercedes-Benz  —  Jose Uribe said he had provided the car to Senator Robert Menendez's girlfriend in exchange for gaining his “power and influence.”  —  Until recently, Jose Uribe was an obscure New Jersey businessman who had been caught … ",
    "url": "https://www.nytimes.com/2024/06/07/nyregion/jose-uribe-menendez-trial-bribery.html"
  },
  {
    "text": "RNC hires a prominent ‘Stop the Steal’ advocate to help craft its 2024 platform  —  Ed Martin, who was hired by the RNC in May, pushed to overturn Donald Trump's 2020 loss and marched outside the Capitol on Jan. 6, 2021.  —  WASHINGTON — The Republican National Committee has hired … ",
    "url": "https://www.nbcnews.com/politics/2024-election/rnc-hires-prominent-stop-steal-advocate-help-craft-2024-platform-rcna155298"
  },
  {
    "text": "Google's and Microsoft's AI Chatbots Refuse to Say Who Won the 2020 US Election  —  With just six months to go before the US presidential election, Gemini and Copilot chatbots are incapable of saying that Joe Biden won in 2020, and won't return results on any election anywhere, ever.",
    "url": "https://www.wired.com/story/google-and-microsofts-chatbots-refuse-election-questions/"
  },
  {
    "text": "'Donald Trump doesn't like America': Ex-GOP pollster writes MAGA movement's obituary  —  Republicans booed and walked out on two former Capitol police officers at the Pennsylvania statehouse, and a former GOP pollster was disgusted by that display of antipathy to American democracy.",
    "url": "https://www.rawstory.com/maga-movement-2668476457/"
  },
  {
    "text": "It's 2024.  Elon Musk Rules X. And the Political World Is Still Addicted. … While former President Donald Trump was actively being convicted by a jury of his peers in New York City last week, Democratic strategist Tim Hogan did what just about everyone in politics, media … ",
    "url": "https://www.notus.org/media/elon-musk-x-politics-addicted-twitter"
  },
  {
    "text": "Biden to offer forceful defense of democracy in Normandy speech commemorating D-Day  —  ABC's Mary Bruce reports the contrasts with Donald Trump will be clear.  —  President Joe Biden attends a ceremony to mark the 80th anniversary of D-Day at the Normandy American Cemetery and Memorial in Colleville-sur-Mer, France, June 6, 2024.",
    "url": "https://abcnews.go.com/Politics/biden-offer-forceful-defense-democracy-normandy-speech-commemorating/story?id=110923613"
  },
  {
    "text": "Biden pulls back on tightened car and truck fuel standards  —  The new CAFE standards for the popular classes of vehicles will require more modest mileage improvements than the Biden administration had called for last year.  —  The Biden administration on Friday backed off its proposal … ",
    "url": "https://www.politico.com/news/2024/06/07/biden-pulls-back-on-tightened-car-and-truck-fuel-standards-00162297"
  },
  {
    "text": "A group of far-right media figures is using social media to recruit for its newly formed militia  —  The group is recruiting on Instagram, despite Meta's previous crackdowns on militias  —  A group of far-right media figures has announced the formation of a militia group that is dedicated to … ",
    "url": "https://www.mediamatters.org/january-6-insurrection/group-far-right-media-figures-using-social-media-recruit-its-newly-formed"
  },
  {
    "text": "A Staggering Tally: Supreme Court Justices Accepted Hundreds of Gifts Worth Millions of Dollars  —  Following the groundbreaking reporting from ProPublica and other outlets, FTC ventured to compile all the SCOTUS gifts, found a few unreported ones  —  Ahead of tomorrow's expected release … ",
    "url": "https://fixthecourt.com/2024/06/a-staggering-tally-supreme-court-justices-accepted-hundreds-of-gifts-worth-millions-of-dollars/"
  },
  {
    "text": "Yes, Democrats Should Still Care How Real Journalists Cover The News  —  Just because most mainstream news consumers are already Biden voters, doesn't mean big problems with mainstream news coverage don't seep into the larger culture.  —  Six years ago, White House Press Secretary Sarah … ",
    "url": "https://www.offmessage.net/p/democrats-journalists-cover-news"
  }
]