[
  {
    "text": "Senate Republicans warn House they won't get a better immigration deal under Trump  —  “To those who think that if President Trump wins, which I hope he does, that we can get a better deal — you won't,” Sen. Lindsey Graham, R-S.C., told reporters on Wednesday.",
    "url": "https://www.nbcnews.com/politics/congress/senate-republicans-warn-house-wont-get-better-immigration-deal-trump-rcna134348"
  },
  {
    "text": "Shake-Up by a Desperate DeSantis Opens Wider Path for Haley in New Hampshire  —  Ron DeSantis's super PAC began layoffs on the same day he signaled he would largely bypass New Hampshire's primary election and train his efforts on South Carolina.  —  Straining to recover after a bruising defeat in Iowa … ",
    "url": "https://www.nytimes.com/2024/01/17/us/politics/desantis-layoffs-super-pac.html"
  },
  {
    "text": "Trump solidifies lead in NH, Haley firmly in second, new poll shows  —  Only 5% of likely Republican primary voters said they would choose Ron DeSantis, leaving him a distant third  —  Former President Donald Trump has solidified his lead in New Hampshire ahead of the state's first-in-the-nation primary … ",
    "url": "https://www.nbcboston.com/news/local/trump-solidifies-lead-in-nh-haley-firmly-in-second-new-poll-shows/3249134/"
  },
  {
    "text": "Judge Threatens to Kick Trump Out of E. Jean Carroll Defamation Trial if He Disrupts Court  —  Trump told the judge he would ‘love it’ if he threw him out of the courtroom  —  The federal judge presiding over Donald Trump's defamation trial on Wednesday warned the former president … ",
    "url": "https://themessenger.com/politics/trump-e-jean-carroll-judge-kaplan-defamation-trial"
  },
  {
    "text": "Trump Recycles Tired 2020 Election Allegations  —  The former president just won't let his loss go, even if that means returning to long-disproven allegations about the outcome.  —  As originally conceived by its inventors, the concept of the “big lie” is supposed to be a tale so audacious and captivating that people can't doubt it.",
    "url": "https://www.nationalreview.com/2024/01/trump-recycles-tired-2020-election-allegations/"
  },
  {
    "text": "Jamie Dimon: Quit Attacking MAGA  —  Jamie Dimon is the CEO of JPMorgan and describes himself as “barely a Democrat.”  —  His name has often been floated as a potential candidate for president, and at 68, he seems positively youthful compared to the two frontrunners for president this year.",
    "url": "https://hotair.com/david-strom/2024/01/17/jamie-dimon-quit-attacking-maga-n605571"
  },
  {
    "text": "Supreme Court divided over whether to curb the power of federal agencies  —  A divided Supreme Court debated whether and how to curtail the power of federal agencies Wednesday, with liberals urging the court to defer to the judgment of government experts and conservatives saying courts … ",
    "url": "https://www.washingtonpost.com/politics/2024/01/17/supreme-court-herring-chevron-regulatory-agencies/"
  },
  {
    "text": "Supreme Court Hears Case That Could Overturn Key Chevron Precedent  —  The Supreme Court considered whether to overrule the seminal 1984 Chevron decision, which requires judges to defer to agencies' interpretations of ambiguous statutes.  —  Members of the Supreme Court's conservative … ",
    "url": "https://www.nytimes.com/2024/01/17/us/supreme-court-chevron-case.html"
  },
  {
    "text": "Democrat Keen wins state House 35 special election over GOP's Booth  —  In a race seen as a bellwether for Democratic chances in November, Democrat Tom Keen flipped what had been a Republican state House seat in Central Florida in a special election held Tuesday.",
    "url": "https://www.orlandosentinel.com/2024/01/16/democrat-keen-wins-state-house-35-special-election-over-gops-booth/"
  },
  {
    "text": "‘Survivor’ Champ Kentucky Pol Whose Incest Bill Would Let Cousins Have Sex: ‘I Made a Mistake’ (Exclusive)  —  ‘I was thinking like a lawyer, not like a legislator,’ state Rep. Nick Wilson tells The Messenger  —  A Kentucky Republican introduced a bill on Tuesday that was intended to broaden … ",
    "url": "https://themessenger.com/news/incest-kentucky-cousins-lawmaker-bill-decriminalize-sex-nick-wilson-mistake-republican"
  },
  {
    "text": "The ‘Sleeping Giant’ Case that Could Upend Jack Smith's Prosecution of Trump  —  The Supreme Court has agreed to consider a case that doesn't mention the former president, but that could invalidate half of the Jan. 6 charges against him.  —  There's been a lot of attention paid … ",
    "url": "https://www.politico.com/news/magazine/2024/01/17/supreme-court-case-trump-prosecution-00135852"
  },
  {
    "text": "David Weiss Buries Bill Barr Right Alongside Tony Bobulinski  —  For a second time, David Weiss' Special Counsel team has buried an inconvenient (some)body to avoid accounting for the politicization of the investigation they claim is not political.  —  This time, it's Bill Barr.",
    "url": "https://www.emptywheel.net/2024/01/17/david-weiss-buries-bill-barr-right-alongside-tony-bobulinski/"
  },
  {
    "text": "New Baltimore Sun owner insults staff in meeting, says paper should mimic Fox45  —  In a tense, three-hour meeting with staff Tuesday afternoon, new Baltimore Sun owner David Smith told employees he has only read the paper four times in the past few months, insulted the quality of their journalism … ",
    "url": "https://www.thebaltimorebanner.com/economy/baltimore-sun-david-smith-sinclair-owner-F77S3D47ORD7LNEPZ7PJCXSLWM/"
  },
  {
    "text": "White House Phoned Asa Hutchinson to Apologize for DNC Slight  —  The call came after the DNC took a potshot at the former Arkansas governor, who was one of Donald Trump's biggest critics from the right.  —  President Joe Biden on Wednesday dispatched his chief of staff to call the former Arkansas … ",
    "url": "https://www.thedailybeast.com/white-house-phoned-asa-hutchinson-to-apologize-for-dnc-slight"
  },
  {
    "text": "Arnold Schwarzenegger detained at German airport over his watch  —  Former Hollywood superstar and politician Arnold Schwarzenegger was detained at an airport in Germany on Wednesday over a watch he was traveling with.  —  Schwarzenegger, best known for his role in The Terminator franchise … ",
    "url": "https://www.washingtonexaminer.com/news/2801952/arnold-schwarzenegger-detained-germany-airport-watch/"
  },
  {
    "text": "Elise Stefanik Targeted for Censure for Jan. 6 ‘Hostages’ Comment  —  “In putting her personal ambitions over her integrity, Congresswoman Stefanik has been Donald Trump's biggest congressional cheerleader,” Dan Goldman said.  —  Representative Dan Goldman (D-NY) planned to introduce … ",
    "url": "https://www.thedailybeast.com/ny-rep-dan-goldman-plans-to-censure-elise-stefanik-over-hostages-comment"
  },
  {
    "text": "Blinken Stranded After Boeing 737 Breaks Down on Davos Trip  —  US Secretary of State Antony Blinken was unable to fly home from Davos as scheduled on Wednesday due to a critical error with his aircraft. … An oxygen leak detected previously could not be remedied.",
    "url": "https://www.bloomberg.com/news/articles/2024-01-17/blinken-stranded-after-boeing-plane-breaks-down-on-davos-trip"
  },
  {
    "text": "House Hearing Turns Chaotic as GOP Rep, Witness Clash on ‘Family Separation’: ‘Why Are You Laughing!?’  —  ‘Are you psychic?  Have you won the lotto, Mr. Bier?’  Rep. Anna Paulina Luna exclaimed  —  Rep. Anna Paulina Luna, R-Fla., was shocked to find a congressional witness laughing … ",
    "url": "https://themessenger.com/politics/house-hearing-migrants-family-separation-rep-luna-david-bier-clash"
  }
]