[
  {
    "text": "Donald's New Owner  —  [Substack was down for a while and is still a little glitchy.  I hope this reaches you.]  —  Donald Trump has always been for sale.  It used to be shocking how many people were willing to prop him up in the hopes of profiting off his increasingly seamy ventures.",
    "url": "https://www.marytrump.org/p/donalds-new-owner"
  },
  {
    "text": "Harris vs. Trump analyst tells panicky Dems: GOP is creating fake polls |  ‘Desperate, unhinged, Trumpian’  —  As polls seem to indicate that former president Donald Trump has momentum in some swing states with 24 days remaining until the Nov. 5 presidential election, Democratic strategist Simon Rosenberg says: Don't buy it.",
    "url": "https://www.nj.com/politics/2024/10/harris-vs-trump-analyst-tells-panicky-dems-gop-is-creating-fake-polls-desperate-unhinged-trumpian.html"
  },
  {
    "text": "We watched 20 Trump rallies.  His racist, anti-immigrant messaging is getting darker.  —  A POLITICO analysis of more than 20 of his rallies and campaign events shows Trump has demonized minority groups in all of them.  —  Donald Trump vowed to “rescue” the Denver suburb of Aurora, Colorado … ",
    "url": "https://www.politico.com/news/2024/10/12/trump-racist-rhetoric-immigrants-00183537"
  },
  {
    "text": "Trump suggests heckler should ‘get the hell knocked out of her’ after rally  —  The remarks were part of a dark speech at a California rally where Trump called the U.S. an “occupied country.”  —  COACHELLA, Calif- Former president Donald Trump suggested that a heckler would later get … ",
    "url": "https://www.washingtonpost.com/politics/2024/10/12/trump-heckler-violence/"
  },
  {
    "text": "Harris weighing where to put more distance between her and Biden  —  Trump has been criticizing her for an answer to a question in which she initially declined to say anything she would have done different the past four years.  —  WASHINGTON — Vice President Kamala Harris' team … ",
    "url": "https://www.nbcnews.com/politics/2024-election/harris-weighing-put-distance-biden-rcna175082"
  },
  {
    "text": "Far-right website admits there was no fraud at 2020 vote count in Atlanta  —  Gateway Pundit settled defamation lawsuit brought by election workers it had falsely accused of wrongdoing  —  The far-right website the Gateway Pundit acknowledged for the first time on Saturday … ",
    "url": "https://www.theguardian.com/us-news/2024/oct/12/gateway-pundit-admits-no-election-fraud-atlanta"
  },
  {
    "text": "Note from the Editor: Legal Update  —  Georgia officials concluded that there was no widespread voter fraud by election workers who counted ballots at the State Farm Arena in November 2020.  The results of this investigation indicate that Ruby Freeman and Wandrea ‘Shaye’ Moss did not engage … ",
    "url": "https://www.thegatewaypundit.com/2024/10/note-editor-legal-update/"
  },
  {
    "text": "Is Ron DeSantis secretly preparing an effort to block Florida's abortion measure?  —  Late Friday, the Florida Department of State's office released a report alleging fraud relating to petition circulation and collection for the abortion rights measure that will be Amendment 4 on this fall's ballot in the state.",
    "url": "https://www.lawdork.com/p/is-ron-desantis-secretly-preparing"
  },
  {
    "text": "“Threatening to cancel votes”: Florida officials allege fraud to kneecap abortion rights amendment  —  The last-minute report threatens to “cancel” votes for an amendment to restore abortion rights in the state  —  In a last-minute effort to kill a proposed ballot amendment … ",
    "url": "https://www.salon.com/2024/10/12/threatening-to-cancel-votes-florida-officials-allege-fraud-to-kneecap-abortion-rights-amendment/"
  },
  {
    "text": "New York Times polls are betting on a political realignment  —  Should you buy it?  —  ∙ Paid  —  The past quarter-century of American politics has been dominated by two major trends.  One is simply increasing political polarization: red states have perpetually become redder, and blue states bluer.",
    "url": "https://www.natesilver.net/p/new-york-times-polls-are-betting"
  },
  {
    "text": "Trump-aligned group believed to have been attacked by Chinese hackers  —  Among the materials taken from the America First Policy Institute were recommendations for jobs in a second term and policy proposals.  —  A political organization helping prepare for the potential presidential transition … ",
    "url": "https://www.washingtonpost.com/politics/2024/10/12/trump-aligned-group-believed-be-attacked-by-chinese-hackers/"
  },
  {
    "text": "America First Policy Institute, a group advising Trump, says its systems were breached  —  A group helping to lay the groundwork for a future Donald Trump administration said its computer systems were breached, marking the second known instance that people supporting the former president have been the target of a cyberattack.",
    "url": "https://apnews.com/article/america-first-policy-institute-breach-2626d34b7426c4917f11052dafc7041c"
  },
  {
    "text": "Vance points out the ‘biggest difference’ between leadership of Trump, Harris during campaign stop  —  Veteran homelessness increased 7.4% between 2022 and 2023  —  Sen. JD Vance, R-Ohio, set the record straight on how former President Donald Trump's and Vice President Kamala Harris' leadership styles … ",
    "url": "https://www.foxnews.com/politics/jd-vance-points-biggest-difference-leadership-trump-harris-campaign-stop"
  },
  {
    "text": "‘As serious as it gets’: Trump ally stuns with ‘petrifying’ answer about executing enemies  —  Former Lt. Gen. Mike Flynn, the controversial figure Donald Trump named to be his White House national security adviser, stunned observers with his answer to a question about potentially executing political enemies.",
    "url": "https://www.rawstory.com/mike-flynn-executing-swamp-petrifying/"
  },
  {
    "text": "Where Is the Fierce Urgency of Beating Trump?  —  Barack Obama got blunt in Pittsburgh on Thursday.  He chided Black men who are not supporting Kamala Harris, saying that some of “the brothers” were just not “feeling the idea of having a woman as president.”",
    "url": "https://www.nytimes.com/2024/10/12/opinion/trump-harris-election.html"
  },
  {
    "text": "The Other Hidden Secret in Olivia Nuzzi And RFK Jr.'s Affair  —  TROUBLED DYNASTIES  —  The D.C. golden couple of Olivia Nuzzi and Ryan Lizza was torn apart by her FaceTime affair with RFK Jr. But she was not the only one with a secret, the Daily Beast reveals.",
    "url": "https://www.thedailybeast.com/the-family-secrets-of-ryan-lizza-whose-fiancee-olivia-nuzzi-cheated-with-rfk-jr"
  },
  {
    "text": "Trump Called Harris ‘Retarded,’ Railed Against Jews Supporting Her: Report  —  Donald Trump is said to have used the slur at a Trump Tower dinner, where he also suggested that donors need to provide more help to his campaign.  —  LOADING  —  Former President Donald Trump called Vice … ",
    "url": "https://www.huffpost.com/entry/trump-reportedly-called-harris-retarded-complained-jewish-support_n_670a8c57e4b0c2f4a135376f"
  }
]