[
  {
    "text": "Behind the Curtain: Inside Trump's slump … - Advisers are telling him Harris will grow her lead coming out of the Democratic convention, which begins a week from tomorrow — especially if they don't define her better, faster. … But it's Trump.  So a new script is often fictional wishfulness.",
    "url": "https://www.axios.com/2024/08/11/trump-slump-assassination-attempt-2024-election"
  },
  {
    "text": "Trump's Anger Out of Control as Poll Numbers Keep Cratering  —  GOING DOWN  —  According to Axios sources, Trump “is struggling to get past his anger” and his advisers are “deeply rattled” by his “meandering, mean and often middling public performances.”  —  Donald Trump's advisers … ",
    "url": "https://www.thedailybeast.com/trump-advisers-deeply-rattled-by-his-spiraling-campaign-report"
  },
  {
    "text": "JD Vance says mass deportations should ‘start with 1 million,’ defends ‘thought experiment’ giving parents extra votes  —  The GOP vice presidential candidate discussed several issues with Jonathan Karl.  —  Republican vice presidential candidate JD Vance is interviewed by ABC News' Jon Karl on Aug. 10, 2024.",
    "url": "https://abcnews.go.com/Politics/jd-vance-mass-deportations-start-1-million-defends/story?id=112739447"
  },
  {
    "text": "162 lies and distortions in a news conference.  NPR fact checks former President Trump  —  There were a host of false things that Donald Trump said during his hour-long news conference Thursday that have gotten attention.  —  A glaring example is his helicopter emergency landing story, which has not stood up to scrutiny.",
    "url": "https://www.npr.org/2024/08/11/nx-s1-5070566/trump-news-conference"
  },
  {
    "text": "Trump falsely claims Harris Michigan rally crowd 'didn't exist,' was generated with AI  —  Former President Donald Trump took to social media on Sunday to falsely claim that Vice President Kamala Harris' campaign faked photos of the crowd at her Detroit-area rally last week using artificial intelligence.",
    "url": "https://ny1.com/nyc/all-boroughs/politics/2024/08/11/trump-kamala-harris-michigan-rally-ai"
  },
  {
    "text": "The Trump Hack Could Extend Far Beyond a Hack-and-Leak  —  When news first broke that Donald Trump's campaign says it has been hacked, I started drafting a post on applying the lessons of past ratfucks.  —  The alleged hack was first reported by Politico, which says some person using … ",
    "url": "https://www.emptywheel.net/2024/08/11/the-trump-hack-could-extend-far-beyond-a-hack-and-leak/"
  },
  {
    "text": "What “Center” Is That, Exactly?  —  Hey friends!  If you've read Very Fine People and enjoyed it, why not leave a quick rating or review on Amazon or Goodreads?  It would help bunches!  —  I really can't get over the signs.  —  The Republicans held what was basically a Nuremberg rally … ",
    "url": "https://www.the-reframe.com/what-center-is-that-exactly/"
  },
  {
    "text": "British Writer Pens The Best Description Of Trump I've Read  —  “Why do some British people not like Donald Trump?”  Nate White, an articulate and witty writer from England wrote the following response:  —  A few things spring to mind.  Trump lacks certain qualities which the British traditionally esteem.",
    "url": "https://londondaily.com/british-writer-pens-the-best-description-of-trump-i-ve-read"
  },
  {
    "text": "Kid Rock Threw the Party.  MAGA Faithful Brought the Joy, Rage and Smirnoff Ice.  —  A music festival headlined by the pro-Trump musician offered a snapshot of a maturing American subculture, with a mash-up of hedonism, rebellion and beer-guzzling pursuit of happiness.",
    "url": "https://www.nytimes.com/2024/08/11/us/kid-rock-trump-maga.html?unlocked_article_code=1.CE4.CHgb.4M5QM2laC31E&smid=url-share"
  },
  {
    "text": "Vibes matter: Trump can hardly restrain his jealousy over the Harris campaign's joy  —  Donald Trump is stewing in frustration over Kamala Harris' meteoric rise  —  Evolutionary biologists know why humans spend disproportionate energy on negative thoughts compared to positive: Teasing out threats … ",
    "url": "https://www.salon.com/2024/08/11/vibes-matter-trumpcan-hardly-restrain-his-jealousy-over-the-harris-campaigns-joy/"
  },
  {
    "text": "It's Happening: Swifties are Officially Organizing for Harris  —  For us at The Alt Media, the only thing more delicious than seeing MAGA lose its damn mind is seeing all the enthusiasm across the country to elect Kamala Harris and Tim Walz as our next president and VP.",
    "url": "https://www.thealtmedia.com/p/swifties-organizing"
  },
  {
    "text": "‘Neoliberal capitalism’ has contributed to the rise of fascism, says Nobel laureate  —  abc.net.au/news/joseph-stiglitz-the- road-to-freedom-neoliberalism-fascism/ 104210670  —  How would you define the “good society”?  —  It's a question Joseph Stiglitz, winner of the Nobel Memorial Prize … ",
    "url": "https://www.abc.net.au/news/2024-08-11/joseph-stiglitz-the-road-to-freedom-neoliberalism-fascism/104210670"
  },
  {
    "text": "To Save Conservatism From Itself, I Am Voting for Harris  —  I believe life begins at conception.  If I lived in Florida, I would support the state's heartbeat bill and vote against the referendum seeking to liberalize Florida's abortion laws.  I supported the Dobbs decision and I support … ",
    "url": "https://www.nytimes.com/2024/08/11/opinion/harris-trump-conservatives-abortion.html"
  },
  {
    "text": "Biden admits he was pushed out of presidential race, name-drops Pelosi in first interview since exit  —  President Biden admitted he was pushed out of the presidential race by Democratic Party elites and specifically name-dropped former House Speaker Nancy Pelosi as one of the perpetrators … ",
    "url": "https://nypost.com/2024/08/11/us-news/biden-specifically-names-nancy-pelosi-in-first-interview-about-why-he-dropped-out-of-presidential-race/"
  }
]