[
  {
    "text": "Marco Rubio Adds a New Title Under Trump: Interim National Security Adviser  —  The former senator from Florida is now the head of four government bodies.  He has outdone Henry Kissinger and even Xi Jinping, China's leader, who has only three main titles.  —  Secretary of state.",
    "url": "https://www.nytimes.com/2025/05/01/us/politics/marco-rubio-national-security-secretary-state.html"
  },
  {
    "text": "Army plans for a potential parade on Trump's birthday call for 6,600 soldiers, AP learns  —  Detailed Army plans for a potential military parade on President Donald Trump's birthday in June call for more than 6,600 soldiers, at least 150 vehicles, 50 helicopters, seven bands and possibly … ",
    "url": "https://apnews.com/article/army-parade-trump-birthday-96bb9c8e9af1ef285c56fdc3d1ba4b35"
  },
  {
    "text": "Abbe Lowell launches his own law firm  —  Hunter Biden's former lawyer is teaming up with attorneys who have quit major law firms over Trump's executive orders targeting the legal industry.  —  Prominent defense lawyer Abbe Lowell has officially launched Lowell & Associates … ",
    "url": "https://www.politico.com/news/2025/05/02/abbe-lowell-law-firm-trump-00322063"
  },
  {
    "text": "Microsoft drops a law firm that appeased Trump, hires firm that's fighting Trump  —  Law firms that struck deals with the White House thought it'd protect their bottom line.  What if their assumptions were wrong?  —  When Donald Trump launched an unprecedented offensive against prominent law firms … ",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/microsoft-drops-law-firm-appeased-trump-hires-firm-s-fighting-trump-rcna204152"
  },
  {
    "text": "GOP leaders take more time for key megabill markup after Medicaid snags  —  House GOP leaders are pushing Energy and Commerce Committee's megabill markup another week as Republicans try to resolve lingering issues over spending cuts to Medicaid.  The panel will now likely hold it's markup the week on May 12 … ",
    "url": "https://www.politico.com/live-updates/2025/05/01/congress/energy-and-commerce-punts-megabill-markup-another-week-00322490"
  },
  {
    "text": "Exclusive: NSF stops awarding new grants and funding existing ones … - Dan Garisto  —  You can also search for this author in  —  PubMed Google Scholar  —  Staff members at the US National Science Foundation (NSF) were told on 30 April to “stop awarding all funding actions until further notice … ",
    "url": "https://www.nature.com/articles/d41586-025-01396-2"
  },
  {
    "text": "Establishment of the Religious Liberty Commission  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:  —  Section 1.  Purpose and Policy.  It shall be the policy of the executive branch to vigorously enforce … ",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/05/establishment-of-the-religious-liberty-commission/"
  },
  {
    "text": "Ed Martin, Trump's controversial U.S. attorney pick, on thin ice in the Senate  —  President Trump's pick to be Washington's top prosecutor appears to be in trouble with Senate Republicans.  No GOP senator has said they will oppose Ed Martin to be U.S. attorney for the District of Columbia … ",
    "url": "https://www.politico.com/live-updates/2025/05/01/congress/ed-martin-senate-confirmation-woes-00322346"
  },
  {
    "text": "Orders to Investigate Columbia Protesters Raised Alarms in Justice Dept.  —  Behind the scenes, a top department official pressed employees to gather a list of activists and investigate them, people familiar with the matter said.  —  A top Trump appointee in the Justice Department ordered … ",
    "url": "https://www.nytimes.com/2025/05/01/us/politics/columbia-protests-justice-department.html?unlocked_article_code=1.D08.fy7e.P0sXbqrbXdLl&smid=url-share"
  },
  {
    "text": "Senior State Department official sought internal communications with journalists, European officials, and Trump critics … A previously unreported document distributed by senior US State Department official Darren Beattie reveals a sweeping effort to uncover all communications between the staff … ",
    "url": "https://www.technologyreview.com/2025/05/01/1115988/senior-state-department-official-sought-internal-communications-with-journalists-european-officials-and-trump-critics/"
  },
  {
    "text": "Fired DOJ attorney says on TikTok that Trump pardons cost $1 billion  —  Liz Oyer says Americans lost out on restitution because President Donald Trump sidestepped the usual clemency process to pardon allies.  —  Liz Oyer, the Justice Department's recently fired pardon attorney … ",
    "url": "https://www.washingtonpost.com/national-security/2025/05/01/liz-oyer-trump-pardons-restitution-1-billion/"
  },
  {
    "text": "Trump to Propose Slashing $163 Billion in Government Programs in Budget Blueprint  —  The president's budget wish list would cut health research, climate and education programs  —  WASHINGTON—President Trump is expected to propose far-reaching cuts to federal environmental, renewable energy … ",
    "url": "https://www.wsj.com/politics/policy/trump-to-propose-slashing-163-billion-in-government-programs-in-budget-blueprint-86309f80"
  },
  {
    "text": "Tulsi Gabbard is out to prove Covid came from a lab  —  The director of national intelligence told podcast host Megyn Kelly she's working with top HHS officials to investigate Covid-19's origins.  —  National Intelligence Director Tulsi Gabbard's office is working with NIH Director Jay Bhattacharya … ",
    "url": "https://www.politico.com/news/2025/05/01/gabbard-00322598"
  },
  {
    "text": "Federal Judge Strikes Down Trump's Use of Alien Enemies Act to Deport Venezuelans  —  The ruling, which is limited to the Southern District of Texas, prohibited the administration from using the wartime law because the president's claims about a Venezuelan gang do not add up to an “invasion.”",
    "url": "https://www.nytimes.com/2025/05/01/us/texas-judge-trump-alien-enemies-act.html?unlocked_article_code=1.D08.Sfed.fFJKQTv8TrNU&smid=url-share"
  },
  {
    "text": "Ilhan Omar Cusses Out Right-Wing Reporter Over Question on Wrongfully Deported Man  —  NO REGRETS  —  A reporter from The Daily Caller asked whether the Democratic lawmaker would encourage more of her colleagues to fly to El Salvador.  —  Rep. Ilhan Omar had no patience for a right-wing journalist … ",
    "url": "https://www.thedailybeast.com/ilhan-omar-cusses-out-right-wing-reporter-over-question-on-wrongfully-deported-man/"
  },
  {
    "text": "The Justice Department ended a decades-old school desegregation order.  Others are expected to fall  —  When the Justice Department lifted a school desegregation order in Louisiana this week, officials called its continued existence a “historical wrong” and suggested that others dating … ",
    "url": "https://apnews.com/article/school-segregation-order-civil-rights-justice-department-7fc5e2e4ef8e9ad4a283f563c042ae7c"
  },
  {
    "text": "Ketanji Brown Jackson sharply condemns Trump's attacks on judges  —  The Supreme Court justice warned Thursday that increasingly hostile rhetoric poses a dire threat to the country's political fabric.  —  RIO GRANDE, PUERTO RICO — Justice Ketanji Brown Jackson forcefully condemned attacks … ",
    "url": "https://www.politico.com/news/2025/05/01/ketanji-brown-jackson-sharply-condemns-trumps-attacks-on-judges-00323010"
  },
  {
    "text": "Pentagon Inspector General Expands Investigation Into Hegseth's Use of Signal  —  Probe seeks to determine who put sensitive military information in unclassified chat group that included Hegseth's family  —  The Pentagon inspector general has expanded an investigation into Defense Secretary … ",
    "url": "https://www.wsj.com/politics/national-security/pete-hegseth-signal-chat-wife-pentagon-investigation-b60457db"
  },
  {
    "text": "Mike Waltz Accidentally Reveals Obscure App the Government Is Using to Archive Signal Messages  —  Mike Waltz, who was until Thursday U.S. National Security Advisor, has inadvertently revealed he is using an obscure and unofficial version of Signal that is designed to archive messages … ",
    "url": "https://www.404media.co/mike-waltz-accidentally-reveals-obscure-app-the-government-is-using-to-archive-signal-messages/"
  },
  {
    "text": "HHS redirects $500 million to Trump appointee's vaccine project, bypassing reviews  —  The Department of Health and Human Services has transferred $500 million from research into next-generation COVID-19 vaccines, redirecting the money to a single vaccine project linked to the Trump … ",
    "url": "https://www.cbsnews.com/news/covid-flu-vaccine-funding-trump-administration/"
  },
  {
    "text": "U.S. Prosecutors Accuse Large Insurers of Paying Kickbacks for Private Medicare Plans  —  The Justice Department accused large insurers of colluding with national brokers to steer older people and those with disabilities toward coverage that might not offer the best medical care.",
    "url": "https://www.nytimes.com/2025/05/01/health/medicare-kickbacks-private-plans-trump.html"
  },
  {
    "text": "Senate overturns EPA rule on seven highly toxic air pollutants  —  If also passed by the House as expected, the action will be the first time Congress has weakened protections under the Clean Air Act.  —  The Senate voted Thursday to overturn an Environmental Protection Agency rule limiting … ",
    "url": "https://www.washingtonpost.com/climate-environment/2025/05/01/senate-vote-epa-air-pollution/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ2MDcyMDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ3NDU0Mzk5LCJpYXQiOjE3NDYwNzIwMDAsImp0aSI6ImUyOGEyZTNiLTFhNzgtNDgzNC1iY2Y4LTMyMTEwMmEwZjhkOSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9jbGltYXRlLWVudmlyb25tZW50LzIwMjUvMDUvMDEvc2VuYXRlLXZvdGUtZXBhLWFpci1wb2xsdXRpb24vIn0.583sITOwSobzxzHGIXvN5QWZKnV3s1Njq68wt6fxpnw&itid=gfta"
  },
  {
    "text": "Trump Administration Cancels $1 Billion in Grants for Student Mental Health  —  Congress authorized the money in a bipartisan breakthrough around addressing gun violence after a shooting at an elementary school in Uvalde, Texas, killed 19 children and two teachers.",
    "url": "https://nytimes.com/2025/05/01/us/politics/trump-mental-health-grants.html?unlocked_article_code=1.D08.-FT6.gyMf3mNjKNKw&smid=tw-share"
  },
  {
    "text": "German spy agency ranks far-right AfD “extremist”  —  Germany's domestic intelligence agency on Friday classified the far-right Alternative for Germany as an extremist entity that threatens democracy, a move enabling it to better monitor the party that came second in February's federal election.",
    "url": "https://www.reuters.com/world/europe/german-spy-agency-ranks-far-right-afd-extremist-2025-05-02/"
  },
  {
    "text": "Yadira Caraveo's former aides say they were mistreated, traumatized by Colorado congresswoman  —  Warning: This story contains details about apparent suicide attempts.  Here's how to get involved with suicide prevention, or find help.  —  U.S. Rep. Yadira Caraveo's behavior last year … ",
    "url": "https://coloradosun.com/2025/05/01/yadira-caraveo-staff-mistreatment-allegations-colorado/"
  },
  {
    "text": "Human rights nightmares show ‘the crazies’ who wanted to abolish ICE were right  —  Even after 100 days of nightly headlines about federal immigration cops gone wild — smashing car windows, descending on schools and courthouses, wrongly deporting dads, or donning masks and handcuffing stunned … ",
    "url": "https://www.inquirer.com/opinion/ice-homeland-security-hsi-customs-citizens-violations-rights-20250501.html"
  }
]