[
  {
    "text": "House speaker live updates: Republicans to vote behind closed-doors to pick leader  — Republicans Reps. Steve Scalise, of Louisiana, and Jim Jordan, of Ohio, are the two declared candidates for House speaker to replace Rep. Kevin McCarthy, R-Calif.  — House Republicans met Tuesday night … ",
    "url": "https://www.nbcnews.com/politics/congress/live-blog/house-speaker-live-updates-rcna119455"
  },
  {
    "text": "Israel forms emergency gov't for Hamas war, Gantz to join Netanyahu  —  As part of the deal, Gantz and fellow party member Gadi Eisenkot will be sworn in as ministers and will join a war cabinet with Netanyahu and Defense Minister Yoav Gallant.  —  An emergency government was formed … ",
    "url": "https://www.jpost.com/breaking-news/article-767742"
  },
  {
    "text": "9 UN staffers killed in airstrikes in Gaza  —  Nine United Nation staff members have been killed by Israeli airstrikes in Gaza since Saturday, the UN's agency for Palestinian refugees confirmed Wednesday.  —  The UN Relief and Works Agency (UNRWA) said nine staffers have been killed … ",
    "url": "https://thehill.com/policy/international/4249540-9-un-staffers-killed-in-airstrikes-in-gaza/"
  },
  {
    "text": "Crackpot fight!  Trump is worried about RFK Jr. running for president — and he should be scared  —  Trump depends on the crank vote that the anti-vaccine conspiracy theorist could siphon off  —  He may not have bolts sticking out of his neck, but Robert F. Kennedy Jr. is morphing into the MAGA version of Frankenstein's monster.",
    "url": "https://www.salon.com/2023/10/11/crackpot-fight-is-worried-about-rfk-jr-running-for-and-he-should-be-scared/"
  },
  {
    "text": "Hannity asks RFK Jr. why Democratic Party didn't ‘want’ him  —  Fox News host Sean Hannity confronted presidential candidate Robert F. Kennedy Jr. on Tuesday about his decision to leave the Democratic Party and run for the White House as an independent.  —  “So I hope you don't mind, but I did a little research on you.",
    "url": "https://thehill.com/homenews/media/4249526-sean-hannity-rfk-jr-spar-democratic-party/"
  },
  {
    "text": "Trump demands trial delay to wade through classified docs he stole  —  And Judge Cannon might just let him get away with it. … Donald Trump has just one goal in his two federal criminal cases: push them off until after November 2024, so that he can either pardon himself or instruct … ",
    "url": "https://www.publicnotice.co/p/trump-judge-cannon-classified-docs-trial-delay"
  },
  {
    "text": "Congressman George Santos Charged With Conspiracy, Wire Fraud, False Statements, Falsification of Records, Aggravated Identity Theft, and Credit Card Fraud  —  For Immediate Release  —  U.S. Attorney's Office, Eastern District of New York  —  Santos Allegedly Filed Fraudulent Fundraising Reports … ",
    "url": "https://www.justice.gov/usao-edny/pr/congressman-george-santos-charged-conspiracy-wire-fraud-false-statements-0"
  },
  {
    "text": "North Carolina Republicans enact election changes over Democratic governor's vetoes  —  RALEIGH, N.C. — North Carolina Republicans enacted vote-count restrictions and weakened the governor's ability to oversee elections and other state regulatory bodies on Tuesday by overriding Democratic Gov. Roy Cooper's vetoes.",
    "url": "https://www.npr.org/2023/10/10/1204941814/north-carolina-republican-election-laws"
  },
  {
    "text": "NYU Student Bar Association President Loses Job Offer for Calling Israel Massacre ‘Necessary’ as School Distances Itself  —  ‘Israel bears full responsibility for this tremendous loss of life,’ wrote Ryna Workman of the terror attack that left at least 1,200 people dead",
    "url": "https://themessenger.com/news/nyu-student-bar-association-president-loses-job-offer-for-calling-israel-massacre-necessary-as-school-distances-itself"
  },
  {
    "text": "Initial US intelligence casts doubt on direct Iran involvement in Hamas attack on Israel  —  The United States has collected specific intelligence that casts doubt on the idea that Iran was directly involved in the planning, resourcing or approving of Saturday's bloody attack on Israel by Hamas … ",
    "url": "https://www.cnn.com/2023/10/11/politics/us-intelligence-iran-hamas-doubt/"
  },
  {
    "text": "Charles Koch's audacious new $5 billion political scheme  —  Billionaire Charles Koch, who will turn 88 on November 1, is funneling his wealth into two secretive organizations that can continue his right-wing political advocacy for years.  Koch structured more than $5 billion in donations … ",
    "url": "https://popular.info/p/charles-kochs-5-billion-tax-loophole"
  },
  {
    "text": "Hamas Seeds Violent Videos on Sites With Little Moderation  —  The strategy mirrors efforts by extremist groups like the Islamic State and Al Qaeda in years past.  —  A video of a Hamas gunman firing his assault rifle at a car full of Israeli civilians was viewed more than one million times on X … ",
    "url": "https://www.nytimes.com/2023/10/10/technology/hamas-violent-videos-online.html"
  },
  {
    "text": "Former OSU wrestlers say Jim Jordan betrayed them and shouldn't be House speaker  —  “Do you really want a guy in that job who chose not to stand up for his guys?” said one former wrestler who attended OSU when Jordan was assistant coach.  —  Four of the former Ohio State University wrestlers … ",
    "url": "https://www.nbcnews.com/politics/politics-news/former-osu-wrestlers-say-jim-jordan-betrayed-shouldnt-house-speaker-rcna119116"
  },
  {
    "text": "Olympic gold medalist Mary Lou Retton battling pneumonia in intensive care  —  Retton's daughter, McKenna Kelley, made an appeal for help, saying the legend does not have medical insurance.  —  Mary Lou Retton battling rare form of pneumonia, family says  —  Olympic gold medalist Mary Lou Retton … ",
    "url": "https://www.nbcnews.com/news/us-news/olympic-gold-medalist-mary-lou-retton-battling-pneumonia-intensive-car-rcna119828"
  },
  {
    "text": "Alarms sound in all of Israel's north, warnings of terrorist infiltrators in communities on Israeli-Lebanese border  —  Suspected infiltration of hostile aircrafts from Lebanon spike alarms across all northern Israel  —  Sirens were heard throughout the Golan Heights and the Galilee due … ",
    "url": "https://www.haaretz.com/israel-news/2023-10-11/ty-article-live/1-200-israelis-killed-2-400-wounded-as-israel-targets-hamas-leaders-in-airstrikes/0000018b-1d16-d08b-adef-1ff68d470000"
  },
  {
    "text": "Conservative Election Activists Use Virginia as a Dry Run for 2024  —  Inspired in part by Donald Trump's baseless rigged-election claims, the activists are trying to recruit supporters to serve as poll watchers and election workers in the state's legislative contests.",
    "url": "https://www.nytimes.com/2023/10/11/us/politics/virginia-election-integrity-activists.html"
  },
  {
    "text": "Trump dips into internet conspiracy theories with his latest lines about Obama  —  Donald Trump had been alluding to the idea that his predecessor, Barack Obama, is still in charge before he outright said it in New Hampshire this week.  —  WOLFEBORO, N.H. — Former President Donald Trump … ",
    "url": "https://www.nbcnews.com/politics/2024-election/trump-dips-internet-conspiracies-latest-lines-obama-rcna119571"
  },
  {
    "text": "Conservatives target Ohio to end their losing streak on abortion votes  —  Abortion opponents have lost every state referendum since Roe was overturned.  In Ohio, they're wooing students, Black communities and even abortion rights advocates to turn their fortunes around.",
    "url": "https://www.politico.com/news/2023/10/11/conservatives-ohio-abortion-referendums-00120837"
  },
  {
    "text": "Defiant Gabrielle Hanson refuses to denounce hate group as Franklin aldermen deliver stern rebuke  —  Alderman Beverly Burger: ‘Is it your mission to divide our city?  Because you are doing a bang-up job of it right now’  —  FRANKLIN, Tenn. (WTVF) — Members of the Franklin Board of Mayor … ",
    "url": "https://www.newschannel5.com/news/newschannel-5-investigates/defiant-gabrielle-hanson-refuses-to-denounce-hate-group-as-franklin-aldermen-deliver-stern-rebuke"
  },
  {
    "text": "The Senate is a problem in the Israel crisis.  Democrats are fed up.  —  The war in the Middle East means top military and diplomatic posts must be filled now, senators say.  —  As war breaks out in the Middle East, key ambassadorships in the region and top military promotions are languishing in the Senate.",
    "url": "https://www.politico.com/news/2023/10/11/hamas-israel-nominees-military-ambassadors-00120871"
  }
]