[
  {
    "text": "House Speaker Mike Johnson Visits Trump at Mar-a-Lago  —  It was the speaker's first trip to see the former president since he won his post, and it came as he faced anger from right-wing lawmakers for moving to fund the government.  —  Speaker Mike Johnson on Monday night visited former … ",
    "url": "https://www.nytimes.com/2023/11/21/us/politics/johnson-trump-mar-a-lago.html"
  },
  {
    "text": "Tux-Wearing Christian Nationalists Laugh About Their Influence, Live From Mar-a-Lago  —  The pastor with whom Speaker Mike Johnson prayed to ward off God's judgment made the case for Christian dominion at Trump's Florida domain  —  CHRISTIAN NATIONALISTS WERE out in force at Mar-a-Lago on Friday night … ",
    "url": "https://www.rollingstone.com/politics/politics-features/christian-nationalists-influence-mar-a-lago-1234889682/"
  },
  {
    "text": "Ignore Trump?  Democrats Now Want Him Plastered All Over the News.  —  The former president has been relatively quiet, out of the headlines and off mainstream social media.  Democrats are hoping that more attention on him can help turn around President Biden's fortunes.",
    "url": "https://www.nytimes.com/2023/11/21/us/politics/trump-democrats-biden.html"
  },
  {
    "text": "The Trump Threat Is Growing.  Lawyers Must Rise to Meet This Moment.  —  American democracy, the Constitution and the rule of law are the righteous causes of our times, and the nation's legal profession is obligated to support them.  But with the acquiescence of the larger conservative legal movement … ",
    "url": "https://www.nytimes.com/2023/11/21/opinion/trump-lawyers-constitution-democracy.html"
  },
  {
    "text": "Texas attorney general opens probe into Media Matters over report on X ads  —  Texas Attorney General Ken Paxton (R) said Monday that his office is opening an investigation into Media Matters for America over its recent reports accusing X, the platform formerly known as Twitter … ",
    "url": "https://thehill.com/policy/technology/4320745-texas-attorney-general-ken-paxton-opens-probe-media-matters-x-ads/"
  },
  {
    "text": "Ron DeSantis' team was going after Nikki Haley.  They turned on each other instead.  —  Haley's rise has posed an existential threat to DeSantis' candidacy, and his team has struggled in how to counter it.  —  Leaders of Ron DeSantis' Never Back Down super PAC met privately last Tuesday … ",
    "url": "https://www.nbcnews.com/politics/2024-election/ron-desantis-nikki-haley-fight-right-never-back-down-rcna126102"
  },
  {
    "text": "UK Museum Determines Roman Emperor Was Trans, Changes Pronouns to She/Her  —  Elagabalus only ruled for 4 years before being assassinated  —  A UK museum has reclassified a Roman emperor as a transgender woman after doing research.  —  The North Hertfordshire Museum will use her and she when referring to Elagabalus.",
    "url": "https://themessenger.com/news/roman-emperor-elagabalus-transgender-woman-uk-museum-she-her-pronouns"
  },
  {
    "text": "Israel-Hamas deal on hostage release and ceasefire is imminent, sources say  —  A deal between Israel and Hamas to free dozens of hostages and declare a multi-day ceasefire is imminent and could be announced by the Qatari mediators as soon as Tuesday, two sources with direct knowledge of the issue told Axios.",
    "url": "https://www.axios.com/2023/11/21/israel-hamas-hostage-ceasefire-deal-imminent"
  },
  {
    "text": "Binance Founder Changpeng Zhao Agrees to Step Down, Plead Guilty  —  Zhao's crypto exchange will also admit wrongdoing and agree to pay $4.3 billion in fines  —  The chief executive of Binance, the largest global cryptocurrency exchange, plans to step down and plead guilty … ",
    "url": "https://www.wsj.com/finance/currencies/binance-ceo-changpeng-zhao-step-down-plead-guilty-01f72a40?mod=followamazon"
  },
  {
    "text": "OnPolitics: New appeals court ruling tees up Voting Rights Act review  —  Hey there OnPolitics readers!  Another voting rights case could be heading to the Supreme Court - this time over who can file suit under the Voting Rights Act.  —  The St. Louis-based U.S. Court of Appeals … ",
    "url": "https://www.usatoday.com/story/news/politics/2023/11/21/new-appeals-court-ruling-tees-voting-rights-act/71670193007/"
  },
  {
    "text": "Billionaires are lining up to fund Donald Trump's anti-democratic agenda  —  The more disturbing Trump's public proclamations become, the more US plutocrats seem to want him to win  —  As an ever-greater portion of the nation's total wealth goes to the top, it's hardly surprising that ever … ",
    "url": "https://www.theguardian.com/commentisfree/2023/nov/21/donald-trump-anti-democratic-agenda-billionaires-neofascism"
  },
  {
    "text": "The twentysomething mayor-elect making history in Indiana  —  With help from Brakkton Booker, Ella Creamer, Rishika Dugyala and Teresa Wiltz  —  Hi, Recasters!  The U.S. is reportedly brokering a deal between Israel and Hamas to exchange some hostages, New York City's mayor blames … ",
    "url": "https://www.politico.com/newsletters/the-recast/2023/11/21/brandon-sakbun-terre-haute-election-00128307"
  },
  {
    "text": "How a Maine Businessman Made the AR-15 Into America's Best-Selling Rifle  —  Neither a gun enthusiast nor a right-wing ideologue, Richard Dyke used political connections and lobster giveaways to build Bushmaster, the company that popularized assault-style rifles.  —  Under the Gun: How Gun Violence Is Impacting the Nation",
    "url": "https://www.propublica.org/article/how-bushmaster-made-ar-15-into-best-selling-rifle-us"
  },
  {
    "text": "WOKE ALERT: BEST BUY, ACTIVISION, TARGET, NORDSTROM, & HOME DEPOT  —  FIVE WOKE COMPANIES TO WATCH THIS BLACK FRIDAY AND CYBER MONDAY  —  These five companies went Woke, and now they're vying for your business on Black Friday and Cyber Monday.  Keep these companies' woke antics in mind when you're shopping for deals.",
    "url": "https://consumersresearch.org/woke-alert/woke-alert-best-buy-activision-target-nordstrom-home-depot/"
  },
  {
    "text": "The D.C. Circuit Court Revealed the Huge Flaw in Trump's Gag Order Claim  —  Monday's oral argument in the U.S. Court of Appeals for the District of Columbia Circuit on the validity of Judge Tanya Chutkan's limited ban of defendant Donald Trump's pretrial free speech rights underscores … ",
    "url": "https://slate.com/news-and-politics/2023/11/dc-circuit-court-trump-gag-order-lose.html"
  },
  {
    "text": "Democrats nearly double Republicans in October fundraising  —  The Democratic National Committee (DNC) far outperformed its Republican National Committee (RNC) counterpart in fundraising in October.  —  The latest Federal Election Commission (FEC) campaign filings show the DNC … ",
    "url": "https://thehill.com/homenews/campaign/4321630-democrats-nearly-double-republicans-in-october-fundraising/"
  },
  {
    "text": "Mike Johnson's America: Revisit landmark SCOTUS decisions and use government to ‘restrain evil’  —  Mike Johnson, the new speaker of the House, voiced support for revisiting Supreme Court decisions that struck down restrictions on the use of contraception, barred bans on gay sex … ",
    "url": "https://www.cnn.com/2023/11/21/politics/mike-johnson-kfile-invs"
  },
  {
    "text": "Wisconsin supreme court appears poised to strike down legislative maps and end Republican dominance  —  Decision from four liberal justices in lawsuit could eliminate some of the most gerrymandered districts in the United States  —  The fight for democracy is supported by",
    "url": "https://www.theguardian.com/us-news/2023/nov/21/wisconsin-supreme-court-redistricting-lawsuit"
  },
  {
    "text": "Appeal filed in Colorado 14th Amendment case  —  The six Republican and unaffiliated Colorado voters who challenged Donald Trump's eligibility to be on the ballot following his actions on January 6th last night filed an appeal with the Colorado Supreme Court challenging the judge's rulings … ",
    "url": "https://www.citizensforethics.org/news/press-releases/appeal-filed-in-colorado-14th-amendment-case/"
  },
  {
    "text": "US has sent Israel data on aid group locations to try to prevent strikes  —  Among the sites provided to the Israeli government are medical facilities, including Al-Shifa hospital, which Israeli forces raided last week.  —  The Biden administration has been providing Israel with the location … ",
    "url": "https://www.politico.com/news/2023/11/21/u-s-has-sent-israel-data-on-aid-group-locations-to-try-to-prevent-strikes-00128336"
  },
  {
    "text": "Rudy Giuliani Dragged Into Court Again Over a Measly $10K  —  “America's Mayor” stiffed the accountants who helped him through his most recent divorce, according to a lawsuit obtained by The Daily Beast.  —  Rudy Giuliani is drowning in debt, and yet another pissed-off associate has come knocking—for a paltry $10,000.",
    "url": "https://www.thedailybeast.com/rudy-giuliani-dragged-into-court-again-over-a-measly-dollar10k"
  },
  {
    "text": "House GOP's Biden impeachment effort heads into final stage  —  The conference plans to depose Hunter Biden in December and is working to tie up other threads before January — when advocates hope they can start moving toward a vote.  —  House Republicans are closing in on a make-or-break moment … ",
    "url": "https://www.politico.com/news/2023/11/21/house-republicans-biden-impeachment-00128154"
  }
]