[
  {
    "text": "Trump Just Revealed How He'll Attack Biden at Debate—and It's Vile  —  You can't say you weren't warned: At the upcoming presidential debate on June 27, Donald Trump plans to highlight a handful of horrific murders—allegedly by undocumented migrants—and blame them on President Biden.",
    "url": "https://newrepublic.com/article/182993/trump-biden-debate-attack"
  },
  {
    "text": "For Biden and Trump, a Debate Rematch With Even Greater Risks and Rewards  —  The matchup on Thursday will be the earliest presidential debate in American history, and any potential missteps could linger for weeks or months.  —  The debate between President Biden and former President Donald J. Trump … ",
    "url": "https://www.nytimes.com/2024/06/23/us/politics/biden-trump-debate-stakes.html"
  },
  {
    "text": "Here's How Biden Could Rattle Trump in Their First Debate  —  My opponent likes to pose as a tough guy.  But where I come from—and it may be old-fashioned—if you lose, you take the hit.  You don't whine and cry about it and blame everybody else.  You take responsibility, you move on.",
    "url": "https://link.motherjones.com/public/35799406"
  },
  {
    "text": "Trump tries some debate prep on the campaign trail  —  Over the course of nearly 90 minutes, Trump kept coming back to talking about Thursday's debate in Atlanta.  —  Donald Trump might be eschewing formal preparations for Thursday's debate — but that doesn't mean he isn't thinking about it.",
    "url": "https://www.politico.com/news/2024/06/22/trump-philly-rally-debate-00164578"
  },
  {
    "text": "Who Is on Donald Trump's Revenge List?  —  One of the central themes of Donald Trump's 2024 presidential campaign has been the desire for vengeance against those who he believes have done him and the country wrong.  “I am your retribution,” has become a staple of his stump speech, and it's not just rhetoric.",
    "url": "https://nymag.com/intelligencer/article/who-is-donald-trump-planning-revenge-against.html"
  },
  {
    "text": "Trump floats UFC-style migrant league amid border crisis  —  At the Faith & Freedom Coalition gathering in Washington, D.C., Trump called migrants “tough people” who could beat the country's best fighters.  —  Former President Donald Trump suggested in two speeches Saturday that migrants coming … ",
    "url": "https://www.politico.com/news/2024/06/22/trump-ufc-migrant-league-00164570"
  },
  {
    "text": "Trump keeps flip-flopping his policy positions after meeting with rich people  —  Top CEOs were seen nodding their heads when Trump talked about finding ways to keep American-educated talent at home.  —  Donald Trump privately hinted at a shift in immigration policy at a Business Roundtable meeting last week.",
    "url": "https://www.politico.com/news/2024/06/22/trump-policy-flip-flop-00164538"
  },
  {
    "text": "Trump ‘Tiny Hands’ Joke Rules Out VP Contender: Ex-Aide  —  Anthony Scaramucci said that Donald Trump will pick “a white guy” to be his running mate.  —  FREE SPEECH?  —  Attendees of a May 31 panel on antisemitism at a Columbia University alumni event captured pictures of texts … ",
    "url": "https://www.thedailybeast.com/trump-tiny-hands-joke-rules-out-vp-contender-marco-rubio-says-anthony-scaramucci"
  },
  {
    "text": "US, Vietnam Discuss Boosting Cooperation in Wake of Putin Visit  —  The US and Vietnam discussed ways to develop their strategic partnership, according to a statement from the Hanoi government, in a meeting that follows a visit to the Southeast Asian nation last week by Russian President Vladimir Putin.",
    "url": "https://www.bloomberg.com/news/articles/2024-06-23/us-vietnam-discuss-boosting-cooperation-in-wake-of-putin-visit"
  },
  {
    "text": "Florida Dems Hope Fourth Time Is A Charm Against Rick Scott And His Bank Account  —  The U.S. senator and former governor has won all three of his statewide races, but never by more than a single percentage point.  —  TAMPA, Fla. — As Democrats gear up for yet another run … ",
    "url": "https://www.huffpost.com/entry/mucarsel-powell-rick-scott-florida-abortion_n_66748780e4b043a634bd9ea9"
  },
  {
    "text": "DeSantis Vetoes All Arts Grants in Florida  —  Gov. Ron DeSantis gave no explanation for zeroing out the $32 million in grants that were approved by state lawmakers.  —  For the past 10 days, Richard Russell has been rattled, poring over budgets and working the phones in an attempt to limit … ",
    "url": "https://www.nytimes.com/2024/06/21/arts/ron-desantis-veto-arts-funding-florida.html"
  },
  {
    "text": "Bowman, in Fight for His Political Life, Embraces the Left's Star Power  —  Representative Alexandria Ocasio-Cortez and Senator Bernie Sanders rallied with Jamaal Bowman on Saturday, three days before the primary on Tuesday.  —  He cracked jokes on “The Late Show With Stephen Colbert,” … ",
    "url": "https://www.nytimes.com/2024/06/22/nyregion/bowman-aoc-bernie.html"
  },
  {
    "text": "Biden DHS docs suggested Trump supporters, military and religious people are likely violent terror threats  —  Internal documents show that the board suggested ‘most of the Domestic Terrorism threat’ in the U.S. comes from Trump supporters  —  Join Fox News for access to this content",
    "url": "https://www.foxnews.com/politics/biden-dhs-docs-suggested-trump-supporters-military-religious-people-likely-violent-terror-threats?intcmp=tw_fnc"
  },
  {
    "text": "Trump campaign seeks to head off convention revolt from its right flank  —  Aides scrambled to foil a plot to throw the nominating process into chaos as suspicions abound about potentially disloyal delegates.  —  PHOENIX — Arizona delegates to the Republican National Convention gathered … ",
    "url": "https://www.washingtonpost.com/politics/2024/06/22/trump-convention-revolt-right-wing-arizona/"
  }
]