[
  {
    "text": "In Sudan, where children clung to life, doctors say USAID cuts have been fatal  —  The Trump administration's cuts to USAID had an immediate and deadly impact in war-ravaged Sudan, according to civilians, doctors and aid officials.  —  QUAZ NAFISA, Sudan — The 3-year-old boy darted among the mourners … ",
    "url": "https://www.washingtonpost.com/world/2025/06/29/sudan-usaid-funding-cuts-trump-musk/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzUxMTY5NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzUyNTUxOTk5LCJpYXQiOjE3NTExNjk2MDAsImp0aSI6IjFjMmUyZjZhLTJiNTItNDk1MS1iODc1LTc3OWJmNmFjYmRhMyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS93b3JsZC8yMDI1LzA2LzI5L3N1ZGFuLXVzYWlkLWZ1bmRpbmctY3V0cy10cnVtcC1tdXNrLyJ9.-eu12N37wEKFEzuv7q2jbfb3b91idbSw7EpJ9aMBZC8&itid=gfta"
  },
  {
    "text": "Senate GOP tax bill includes largest cut to U.S. safety net in decades  —  The legislation would enact historic, possibly unprecedented, reductions in Medicaid and food stamps spending.  —  The Senate Republican tax bill speeding to passage includes the biggest reduction of funding … ",
    "url": "https://www.washingtonpost.com/business/2025/06/29/trump-tax-medicaid-snap/"
  },
  {
    "text": "How the reconciliation bill would change America  —  As the Republican “Big Beautiful Bill” passed another threshold via Senate reconciliation, I want to step back to make sense about what is portends for the future of America.  —  It would be wrong to characterize the BBB a tax cut bill.",
    "url": "https://donmoynihan.substack.com/p/how-the-reconciliation-bill-would"
  },
  {
    "text": "Republican Senate tax bill would add $3.3 trillion to the US debt load, CBO says  —  The changes made to President Donald Trump's big tax bill in the Senate would pile trillions onto the nation's debt load while resulting in even steeper losses in health care coverage, the nonpartisan … ",
    "url": "https://apnews.com/article/cbo-trump-tax-bill-republicans-senate-5f591bea21bd95eec45ba90c93c50687"
  },
  {
    "text": "Trump reacts to Tillis not seeking re-election, sends warning to ‘cost cutting Republicans’  —  North Carolina Republican was one of only two GOP senators who voted against advancing Trump's ‘big, beautiful bill’  —  President Donald Trump celebrated the retirement announcement … ",
    "url": "https://www.foxnews.com/politics/trump-reacts-tillis-not-seeking-re-election-sends-warning-cost-cutting-republicans?intcmp=tw_fnc&taid=6861cb180066c10001c99b41"
  },
  {
    "text": "Sen. Thom Tillis won't run for reelection in 2026  —  Sen. Thom Tillis won't run for re-election in 2026, the North Carolina Republican announced Sunday. … - “It's not a hard choice, and I will not be seeking re-election,” Tillis said in a statement announcing his plans.",
    "url": "https://www.axios.com/2025/06/29/thom-tillis-retire-senate-north-carolina"
  },
  {
    "text": "Retiring GOP senator savages Medicaid cuts in Trump's “big, beautiful bill”  —  Fresh off announcing he'll retire next year, Sen. Thom Tillis gave a lengthy floor speech Sunday night attacking cuts to Medicaid in the “big, beautiful bill.” … - Tillis voted Saturday against starting debate on the bill … ",
    "url": "https://www.axios.com/2025/06/30/thom-tillis-medicaid-trump-big-beautiful-bill"
  },
  {
    "text": "Multiple firefighters shot in Coeur d'Alene, Idaho, while responding to a brush fire  —  Multiple firefighters have been shot while responding to a brush fire in Coeur d'Alene, Idaho, according to Northern Lakes Fire Protection Chief Pat Riley.  —  Kootenai County Emergency Management … ",
    "url": "https://cnn.com/2025/06/29/us/coeur-dalene-idaho-shooter"
  },
  {
    "text": "Sheriff says 2 killed after firefighters shot at near Coeur d'Alene, police are ‘taking sniper fire’  —  A sniper ambushed firefighters responding to a blaze in an Idaho mountain community Sunday, killing at least two people and unleashing barrages of gunfire over several hours in an attack the governor called a “heinous” assault.",
    "url": "https://apnews.com/article/coeur-dalene-idaho-shooting-57e4143642c5a0e98d134051a7147a89"
  },
  {
    "text": "2 Idaho firefighters killed, another injured in active shooter situation near Coeur d'Alene  — Daniel Fortin NonStop Local Digital Journalist/Mark Rattner ocal Digital Journalist  —  COEUR D'ALENE, Idaho - The International Association of Fire Fighters has confirmed that two Idaho firefighters … ",
    "url": "https://www.khq.com/news/idaho_news/multiple-firefighters-reportedly-shot-while-responding-to-fire-near-coeur-d-alene/article_1e5c4d27-5211-407f-95d2-0c273b893033.html"
  },
  {
    "text": "Firefighters ambushed by gunman while responding to brush fire in Idaho: Sheriff  —  The incident unfolded in Coeur d'Alene, Idaho, on Sunday afternoon.  —  Emergency personnel and law enforcement were seen responding to an incident in Coeur d'Alene, Idaho, on Sunday.  —  KXLY",
    "url": "https://abcnews.go.com/US/firefighters-ambushed-gunman-responding-brush-fire-coeur-dalene/story?id=123325507"
  },
  {
    "text": "Rick Scott drafts key Medicaid amendment ahead of voting marathon  —  Florida Sen. Rick Scott is circulating text of his amendment to the GOP megabill that would effectively end a key Medicaid financing mechanism after 2030.  The provision won the backing of Senate Majority Leader John Thune during … ",
    "url": "https://www.politico.com/live-updates/2025/06/29/congress/rick-scott-medicaid-amendment-00432227"
  },
  {
    "text": "Trump: Mamdani must “behave” if elected NYC mayor or face funding cuts  —  Zohran Mamdani shrugged off President Trump's attacks on him and denied he's a communist during a Sunday interview in which the progressive New York City mayoral candidate said he doesn't think there should be billionaires.",
    "url": "https://www.axios.com/2025/06/29/trump-mamdani-nyc-funds-mayor-race"
  },
  {
    "text": "U.N. Inspector Says Iran Could Be Enriching Fuel Again in a ‘Matter of Months’  —  The assessment widens the divide with President Trump, who has claimed that Tehran has given up its nuclear ambitions after a U.S. attack.  —  The chief United Nations nuclear inspector has widened the divide … ",
    "url": "https://www.nytimes.com/2025/06/29/us/politics/un-iran-nuclear-program-enrichment.html?unlocked_article_code=1.Sk8.rXji.vZ38L-H11Vde&smid=url-share"
  },
  {
    "text": "Canada rescinds digital services tax to advance broader trade negotiations with the United States  —  News release  —  June 29, 2025 - Ottawa, Ontario - Department of Finance Canada  —  Canada's new government is engaged in complex negotiations on a new economic and security partnership … ",
    "url": "https://www.canada.ca/en/department-finance/news/2025/06/canada-rescinds-digital-services-tax-to-advance-broader-trade-negotiations-with-the-united-states.html"
  },
  {
    "text": "Intercepted call of Iranian officials downplays damage of U.S. attack  —  The officials were heard saying Trump's strike on Iran proved less devastating than expected.  The administration calls the intelligence insignificant.",
    "url": "https://www.washingtonpost.com/national-security/2025/06/29/trump-iran-nuclear-damage-intercepted-call/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzUxMTY5NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzUyNTUxOTk5LCJpYXQiOjE3NTExNjk2MDAsImp0aSI6IjcxNDQ0NGVmLTZmODctNDQ2OS04ZmFhLTY0ZjcxYzAxZGI2NiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb25hbC1zZWN1cml0eS8yMDI1LzA2LzI5L3RydW1wLWlyYW4tbnVjbGVhci1kYW1hZ2UtaW50ZXJjZXB0ZWQtY2FsbC8ifQ.udWv-MF2EOntYDNsisi51nibt2UGTdqdj2SMmPO1E_g&itid=gfta"
  },
  {
    "text": "Mamdani pushes back on Trump's latest jab  —  Trump called Mamdani a Communist and threatened to withhold federal funding from the city in case of a conflict.  —  Zohran Mamdani is continuing to sell his progressive vision for New York City amid increasing pressure from President Donald Trump.",
    "url": "https://www.politico.com/news/2025/06/29/mamdani-trump-latest-jab-00432137"
  },
  {
    "text": "Trump says there will be ‘temporary pass’ for migrant farm, hotel workers  —  President Trump said that there will be a temporary pass issued for migrants working at farms and in the hospitality industry to allow employers to have more control after the administration has sent mixed messages … ",
    "url": "https://thehill.com/homenews/administration/5375717-trump-temporary-pass-migrant-farm-hotel-workers/"
  },
  {
    "text": "'He's going to do everything to damage the president': Former Musk friend on the Trump fallout  —  In a rare interview after the Musk-Trump row, Silicon Valley founder Philip Low predicts his former friend will seek retaliation against the president.  —  SAN FRANCISCO — A former longtime friend … ",
    "url": "https://www.politico.com/news/2025/06/29/silicon-valley-elon-musk-donald-trump-00415544"
  }
]