[
  {
    "text": "Tens of thousands at Burning Man told to conserve water and food after heavy rains leave attendees stranded in Nevada desert  —  Tens of thousands of people attending the Burning Man festival in the Nevada desert are being told to conserve food, water and fuel as they shelter in place … ",
    "url": "https://www.cnn.com/2023/09/02/us/burning-man-storms-shelter-black-rock-city/"
  },
  {
    "text": "Burning Man 2023: Feds shut down entry, tell burners waiting to get in to go home  —  Noon update: Burning Man entry shut down for remainder of event  —  The Bureau of Land Management released a statement Saturday, saying Burning Man entry is now closed for good:",
    "url": "https://www.rgj.com/story/life/arts/burning-man/2023/09/02/burning-man-2023-rain-keeps-burners-confined-to-camps/70749751007/"
  },
  {
    "text": "The leaked internal poll numbers scrambling the GOP primary  —  The DeSantis campaign is trying to shape the race with its own data.  —  Ron DeSantis' supporters were thrilled last week when a poll emerged following the first primary debate showing him bouncing up 7 points in the critical first caucus state of Iowa.",
    "url": "https://www.politico.com/news/2023/09/02/desantis-gop-primary-internal-polling-00113716"
  },
  {
    "text": "DeSantis' super PAC head honcho privately admits he's spreading dirt on Ramaswamy  —  The private remarks underscore a brewing anxiety about the upstart entrepreneur turned primary foe.  —  The top strategist for Ron DeSantis' super PAC privately told donors that Vivek Ramaswamy posed … ",
    "url": "https://www.politico.com/news/2023/09/03/desantis-super-pac-ramaswamy-00113836"
  },
  {
    "text": "Republican race remains stuck as Trump dominates heading into fall  —  Some campaigns don't want to go after Trump for fear of alienating his supporters — but don't see a path to beating him without attacking him at some point  —  Republican rivals of Donald Trump and their allies have run … ",
    "url": "https://www.washingtonpost.com/elections/2023/09/02/trump-republicans-dominates-campaign/"
  },
  {
    "text": "Senate Republican: 'We don't know' if Trump could beat Biden in 2024  —  Sen. Mike Rounds (R-S.D.) said on Sunday he does not know if former President Trump could beat President Biden in a hypothetical 2024 general election rematch at this point in the campaign, saying that's one of his concerns.",
    "url": "https://thehill.com/blogs/blog-briefing-room/news/4185085-senate-republican-we-dont-know-if-trump-could-beat-biden-in-2024/"
  },
  {
    "text": "Ramaswamy doubles down on voting for Trump if former president is convicted  —  GOP presidential candidate Vivek Ramaswamy doubled down on his comments regarding voting for former President Trump if he is the Republican nominee in 2024, even if Trump is convicted in one of his four ongoing legal battles.",
    "url": "https://thehill.com/homenews/campaign/4185050-ramaswamy-doubles-down-on-voting-for-trump-if-former-president-is-convicted/"
  },
  {
    "text": "Florida judge rejects state congressional map championed by DeSantis  —  A Florida judge on Saturday struck down congressional district lines for northern Florida advocated by Gov. Ron DeSantis, ruling that the Republican governor's map had improperly diluted Black voting power.",
    "url": "https://www.cnn.com/2023/09/02/politics/florida-redistricting-map-lawsuit-desantis/"
  },
  {
    "text": "Biden: ‘Nobody intelligent’ can deny the impact of climate crisis  —  President Biden on Saturday said that no intelligent person can deny the impacts of climate change after the president toured storm damage in Florida from Hurricane Idalia.  —  “Nobody can deny the impact of climate crises … ",
    "url": "https://thehill.com/homenews/administration/4184642-biden-says-nobody-intelligent-can-deny-the-impact-of-climate-crisis/"
  },
  {
    "text": "Kinzinger slams DeSantis for not meeting with Biden in Florida: ‘Absolutely outrageous’  —  Former Rep. Adam Kinzinger (R-Ill.) criticized Florida Gov. Ron DeSantis (R) for not meeting with President Biden while he visited the state Friday to survey hurricane damage, calling the decision “absolutely outrageous.”",
    "url": "https://thehill.com/homenews/campaign/4184404-kinzinger-slams-desantis-for-not-meeting-with-biden-in-florida-absolutely-outrageous/"
  },
  {
    "text": "What the Contradiction of Slavery Tells Us About Abortion Rights  —  One of the ironies of the American slave system was that it depended for its survival on a federal structure that left it vulnerable and unstable.  —  Within the federal union, the slave-dependent states had access … ",
    "url": "https://www.nytimes.com/2023/09/02/opinion/slavery-abortion-rights-laws.html"
  },
  {
    "text": "Neo-Nazis March Through Florida Park  —  ‘WE ARE EVERYWHERE’  —  A large group of neo-Nazis wearing red and waving flags with swastikas marched through Cranes Roost Park in Altamonte Springs, Florida, on Saturday shouting “we are everywhere,” according to a video shared by a state lawmaker.",
    "url": "https://www.thedailybeast.com/neo-nazis-chanting-in-unison-march-through-florida-park-in-terrifying-video"
  },
  {
    "text": "Greene responds to criticism over impeachment comments: ‘The White House is attacking me’  —  Rep. Marjorie Taylor Greene (R-Ga.) responded Saturday to recent White House criticism of her saying she would vote against funding the government if the House decides not to open an impeachment inquiry against the president.",
    "url": "https://thehill.com/homenews/house/4184683-greene-responds-to-criticism-over-impeachment-comments/"
  },
  {
    "text": "The Story of Our Universe May Be Starting to Unravel  —  Not long after the James Webb Space Telescope began beaming back from outer space its stunning images of planets and nebulae last year, astronomers, though dazzled, had to admit that something was amiss.",
    "url": "https://www.nytimes.com/2023/09/02/opinion/cosmology-crisis-webb-telescope.html"
  }
]