[
  {
    "text": "As Biden lags in key states, big questions for Democrats … - It also raises critical questions for the 2024 election: Whether Democrats can fix the lack of enthusiasm for Biden — or whether he'll drag down other Democrats on the ballot. … - Republican and Democratic operatives expect … ",
    "url": "https://www.axios.com/2024/06/23/biden-trump-swing-states-polling-democrats"
  },
  {
    "text": "Trump is on a fundraising blitz.  But there are other warning signs for Republicans.  —  For the first time this year, the Fox News poll had Joe Biden leading Donald Trump by two points, within the poll's margin of error.  —  For Republicans who spent much of the year crowing about Joe Biden's weaknesses … ",
    "url": "https://www.politico.com/news/2024/06/24/trump-fundraising-republicans-nervous-00164588"
  },
  {
    "text": "Disappointment and ‘depression’: Biden's biggest fundraisers watch their advantage vanish  —  Joe Biden's allies are bracing after Donald Trump erased the president's financial edge.  —  Joe Biden's campaign planned to bury Donald Trump in an avalanche of cash.",
    "url": "https://www.politico.com/news/2024/06/23/biden-trump-finances-00164566"
  },
  {
    "text": "Meet the ‘double haters’ who could decide the election  —  Many voters express resignation, dismay and anger over being asked to choose between Biden and Trump again in November  —  HUDSON, Wis. — Ask voters here in far western Wisconsin what they think of their two main presidential choices in November … ",
    "url": "https://www.washingtonpost.com/politics/2024/06/23/double-haters-biden-trump-deciders/"
  },
  {
    "text": "Trump taunted Jewish employees with jokes about Nazi ovens: Ex-Trump Org VP  —  During an appearance on MSNBC on Sunday morning, a former executive vice president of the Trump Organization revealed that her former boss thought it was funny to make jokes about the Nazi ovens around Jewish employees.",
    "url": "https://www.rawstory.com/trump-attacking-jews/"
  },
  {
    "text": "Trump Made ‘Nazi Ovens’ Joke Around Jewish Execs: Ex-Trump Org VP  —  CRUEL AND UNUSUAL  —  “Everybody was shocked,” the former Trump Organization employee said on Sunday.  —  Donald Trump has claimed he's better for Jewish Americans than Democrats, but according to a former senior Trump … ",
    "url": "https://www.thedailybeast.com/trump-made-nazi-ovens-joke-around-jewish-execs-ex-trump-org-vp"
  },
  {
    "text": "In This Debate, CNN Is the Decider  —  One network is in charge of every aspect of the Biden-Trump debate, a major shift from previous years.  Tens of millions of viewers are expected to be watching.  —  The prime-time matchup on Thursday between President Biden and former President Donald … ",
    "url": "https://www.nytimes.com/2024/06/24/business/media/cnn-presidential-debate.html"
  },
  {
    "text": "South Carolina poised to impose draconian censorship regime on school libraries  —  On Tuesday, the South Carolina State Board of Education will impose a centralized and expansive censorship regime on every K-12 school library in the state.  The new regulations could result in the banning … ",
    "url": "https://popular.info/p/south-carolina-poised-to-impose-draconian"
  },
  {
    "text": "Louisiana Republicans write a guide for Alito and Thomas  —  Their Ten Commandments law has a small but powerful audience. … On its own, Louisiana's new law requiring the Ten Commandments to be displayed in every public school classroom is bad enough, a victory for evangelicals who want to push … ",
    "url": "https://www.publicnotice.co/p/louisiana-ten-commandments-law-alito-thomas"
  },
  {
    "text": "Why Conservatives Should Vote for Joe Biden … In 2023, the United States had one of the sharpest drops in the murder rate on record, according to FBI statistics, and early data shows the trend continuing into 2024.  Republicans have persistently denied this, continuing to insist … ",
    "url": "https://nymag.com/intelligencer/article/why-conservatives-should-vote-for-joe-biden.html"
  },
  {
    "text": "Gunmen Attack Synagogues and Churches in Russian Republic  —  Multiple law-enforcement officers and a priest in the region of Dagestan were killed in what appeared to be coordinated attacks, local officials said.  —  Gunmen attacked synagogues and churches in two cities in southern Russia on Sunday … ",
    "url": "https://www.nytimes.com/2024/06/23/world/europe/russia-attack-dagestan.html"
  },
  {
    "text": "I Know What America's Leading C.E.O.s Really Think of Donald Trump  —  Recent headlines suggest that our nation's business leaders are embracing the presidential candidate Donald Trump.  His campaign would have you believe that our nation's top chief executives are returning to support … ",
    "url": "https://www.nytimes.com/2024/06/23/opinion/ceo-trump-republican-support.html"
  },
  {
    "text": "Gov. Kristi Noem says there can't be a ‘blanket approach’ to Jan. 6 pardons: Full interview  —  As former President Donald Trump promises to pardon convicted January 6th rioters, Republican Gov. Kristi Noem (S.D.) says, “each of those situations needs to be looked at separately.”",
    "url": "https://www.nbcnews.com/meet-the-press/video/gov-kristi-noem-says-there-can-t-be-a-blanket-approach-to-jan-6-pardons-full-interview-213516869940"
  },
  {
    "text": "Trump drops $500 tip at Philly cheesesteak restaurant as possible VP name is floated in crowd interaction  —  The former president has campaigned recently to end taxation on tips for those in the service industries  —  Former President Trump made an unexpected campaign stop Saturday at Tony … ",
    "url": "https://www.foxbusiness.com/fox-news-politics/trump-drops-tip-philly-cheesesteak-restaurant-possible-vp-name-floated-crowd-interaction"
  },
  {
    "text": "Scoop: House Dems try to make post-Dobbs comments haunt GOP … - The lawmakers targeted by the five-figure buy: Reps. Michelle Steel (R-Calif.), Nick LaLota (R-N.Y.), Brandon Williams (R-N.Y.), Lori Chavez-DeRemer (R-Ore.) and Scott Perry (R-Pa.).  — “Over the next five months … ",
    "url": "https://www.axios.com/2024/06/23/house-democrats-republicans-roe-v-wade-abortion"
  }
]