[
  {
    "text": "White House lays out offer on immigration changes in talks with Congress  —  Washington — The Biden administration on Tuesday indicated to congressional lawmakers that it would be willing to support a new border authority to expel migrants without asylum screenings, as well as a dramatic expansion … ",
    "url": "https://www.cbsnews.com/news/immigration-white-house-congress-border-security-detention-deportation/"
  },
  {
    "text": "New York's high court just blew up the fight for control of the House  —  Here are five takeaways from the Tuesday's court ruling to redistrict New York — and what to know about the chaotic weeks ahead.  —  New York's high court gave Democrats a big leg up in the dogfight for control of the House of Representatives.",
    "url": "https://www.politico.com/news/2023/12/12/new-york-redistricting-house-00131434"
  },
  {
    "text": "Israel Begins Pumping Seawater Into Hamas's Gaza Tunnels  —  Early effort to flood tunnels is one of several techniques aimed at destroying network that underpins Hamas's operations  —  Israel's military has begun pumping seawater into Hamas's vast complex of tunnels in Gaza … ",
    "url": "https://www.wsj.com/world/middle-east/israel-takes-fight-against-hamas-to-vast-tunnel-network-2ed3b3f2?mod=followamazon"
  },
  {
    "text": "André Braugher Dies: Star Of ‘Homicide: Life On The Street’, ‘Brooklyn Nine-Nine’ & Other Series And Films Was 61  —  Co-Editor-in-Chief, Film  — VIBE Editor-In-Chief Datwon Thomas Takes Executive Producer, Talent Post At Dick Clark Productions  — Mort Engelberg Dies … ",
    "url": "https://deadline.com/2023/12/andre-braugher-dead-homicide-life-on-the-street-brooklyn-nine-nine-actor-1235665513/"
  },
  {
    "text": "Russia Has Suffered Staggeringly High Losses, U.S. Report Says  —  The declassified intelligence assessment also found that Russia's objective has been eroding Western support for Ukraine, the country it invaded.  —  The Russian push in eastern Ukraine this fall and winter was designed … ",
    "url": "https://www.nytimes.com/2023/12/12/us/politics/russia-intelligence-assessment.html"
  },
  {
    "text": "Trump Legal Defense Fund's Biggest Expense Was Mar-a-Lago  —  New tax filings show that a legal defense fund for Trump isn't spending any money on legal services, but is dishing out for a party at Mar-a-Lago.  —  A legal defense fund for Donald Trump appears to have placed its spending priorities in a strange place: Mar-a-Lago.",
    "url": "https://www.thedailybeast.com/trump-legal-defense-funds-biggest-expense-was-mar-a-lago"
  },
  {
    "text": "Tech CEO Accused of Raping, Torturing Employee in ‘Slave Contract’  —  Tradeshift fired Christian Lanng in October over “serious allegations of sexual assault and harassment.”  —  The former chief executive of Tradeshift, a billion-dollar San Francisco business software startup … ",
    "url": "https://www.thedailybeast.com/tradeshift-ceo-christian-lanng-accused-of-trafficking-former-employee"
  },
  {
    "text": "Biden takes a tougher stance on Israel's ‘indiscriminate bombing’ of GazaPresident Joe Biden is speaking out about the Israel-Hamas war and warning...  WASHINGTON (AP) — President Joe Biden on Tuesday warned that Israel was losing international support because of its “indiscriminate bombing” … ",
    "url": "https://apnews.com/article/biden-israel-hamas-oct-7-44c4229d4c1270d9cfa484b664a22071"
  },
  {
    "text": "Lawmakers introduce bipartisan resolution condemning college presidents' response to antisemitism  —  The resolution, first obtained by NBC News, calls on the presidents of Harvard and MIT to resign.  —  WASHINGTON — A bipartisan group of four high-profile House lawmakers will introduce … ",
    "url": "https://www.nbcnews.com/politics/congress/bipartisan-resolution-condemn-college-presidents-antisemitism-campus-rcna129350"
  },
  {
    "text": "Florida school board votes for Moms for Liberty co-founder Bridget Ziegler to resign  —  Ziegler's husband, the Florida GOP chair, is accused of rape, and the couple has admitted to a three-way sexual encounter with the alleged victim.  The school board's vote is nonbinding.",
    "url": "https://www.nbcnews.com/politics/politics-news/sarasota-florida-school-board-bridget-ziegler-moms-for-liberty-rcna129318"
  },
  {
    "text": "Pharmacies share medical data with police without a warrant, inquiry finds  —  The revelation could shape the debate over Americans' health privacy as states move to criminalize abortion and drugs related to reproductive health  —  The nation's largest pharmacy chains have handed … ",
    "url": "https://www.washingtonpost.com/technology/2023/12/12/pharmacy-records-police-privacy-abortion/"
  },
  {
    "text": "Nude painting row at French school sparks teacher walkout  —  France's education minister has visited a school where some pupils refused to look at a painting of nude women in class, sparking a teacher walkout.  —  The pupils also accused their teacher of making racist and Islamophobic remarks, which the school denies.",
    "url": "https://www.bbc.com/news/world-europe-67691484"
  },
  {
    "text": "Statement from President Joe Biden on Continued Denials of Abortion Care  —  No woman should be forced to go to court or flee her home state just to receive the health care she needs.  But that is exactly what happened in Texas thanks to Republican elected officials, and it is simply outrageous.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2023/12/12/statement-from-president-joe-biden-on-continued-denials-of-abortion-care/"
  },
  {
    "text": "After Jan. 6, Brad Parscale Felt “Guilty” for Helping Trump.  Now He's Back on Trump's Gravy Train.  —  A woman is still dead, but Trump's former campaign manager is once again cashing in.  —  On the evening of January 6, 2021, Brad Parscale texted Donald Trump adviser Katrina Pierson … ",
    "url": "https://www.motherjones.com/politics/2023/12/brad-parscale-trump-campaign-january-6/"
  },
  {
    "text": "Trump sells snippets of mugshot suit, Mar-a-Lago dinner in latest NFT promotion  — Former President Donald Trump is selling snippets of the clothes he wore the day of his arrest in a Georgia state election case, part of a promotional pitch for a new set of NFT “digital trading cards.”",
    "url": "https://www.cnbc.com/2023/12/12/trump-sells-mugshot-suit-mar-a-lago-dinner-in-latest-nft-promotion.html"
  },
  {
    "text": "Families of American hostages not invited to White House Hanukkah reception  —  Several family members of US citizens believed to have been taken hostage by Hamas had asked to attend a Hanukkah reception at the White House Monday night but never received invitations, the father of a 19-year-old missing Israeli American told CNN.",
    "url": "https://www.cnn.com/2023/12/11/politics/families-hostages-white-house-hanukkah/"
  },
  {
    "text": "Heartland/Rasmussen Poll: One-in-Five Mail-In Voters Admit to Committing at Least One Kind of Voter Fraud During 2020 Election  —  17% of mail-in voters admit that in 2020 they voted in a state where they are “no longer a permanent resident”  —  21% of mail-in voters admitted that they filled out a ballot for a friend or family member",
    "url": "https://heartland.org/opinion/heartland-rasmussen-poll-one-in-five-mail-in-voters-admit-to-committing-at-least-one-kind-of-voter-fraud-during-2020-election/"
  }
]