[
  {
    "text": "Jack Smith's Big New Jan. 6 Brief Is a Major Indictment of the Supreme Court  —  It's rare to simultaneously feel red-hot anger and wistfulness, especially when merely reading a document.  But those are exactly the emotions that washed over me when I read the redacted version … ",
    "url": "https://slate.com/news-and-politics/2024/10/trump-election-interference-trial-jack-smith-brief-supreme-court-failure.html"
  },
  {
    "text": "Bombshell immunity filing details Trump's alleged ‘increasingly desperate’ bid to overturn 2020 election  —  Trump privately described claims of voter fraud as “crazy,” the filing says.  —  In this July 31, 2024, file photo, Republican presidential candidate former President Donald Trump waits … ",
    "url": "https://abcnews.go.com/US/bombshell-special-counsel-filing-includes-new-allegations-trumps/story?id=114409494"
  },
  {
    "text": "11 damning details in Jack Smith's new brief in the Trump election case  —  From Trump's fictitious stats about voter fraud to the FBI's forensic analysis of Trump's phone, prosecutors previewed how they would make their case at trial.  —  Special counsel Jack Smith won't get a chance … ",
    "url": "https://www.politico.com/news/2024/10/02/jack-smith-trump-election-brief-details-00182287"
  },
  {
    "text": "Jack Smith lays out his case against Trump in vivid detail  —  In a newly unsealed legal brief, the special counsel revealed private, detailed conversations Trump had with GOP officials in his bid to subvert the 2020 election.  —  As his bid to hold on to power in 2020 grew increasingly desperate … ",
    "url": "https://www.politico.com/news/2024/10/02/jack-smith-trump-case-00182258"
  },
  {
    "text": "Jack Smith Lays Out New Evidence in Trump's Jan. 6 Case  —  Judge Tanya Chutkan made public portions of a filing by prosecutors setting out their argument for why the case should go forward despite the Supreme Court's ruling on presidential immunity.  —  When told by an aide … ",
    "url": "https://www.nytimes.com/2024/10/02/us/politics/trump-jan-6-case-jack-smith-evidence.html?unlocked_article_code=1.PE4.CPV7.DVbtr_zR8EME&smid=url-share"
  },
  {
    "text": "Key takeaways from special counsel Jack Smith's major filing in Trump's 2020 election case  —  Washington — U.S. District Judge Tanya Chutkan has made public a key filing from special counsel Jack Smith that includes evidence compiled in his investigation into former President Donald Trump's alleged efforts … ",
    "url": "https://www.cbsnews.com/news/trump-2020-election-filing-special-counsel-jack-smith/"
  },
  {
    "text": "Prosecutors lay out new evidence in Trump election case and accuse him of having ‘resorted to crimes’  —  Donald Trump laid the groundwork to try to overturn the 2020 election even before he lost, knowingly pushed false claims of voter fraud and “resorted to crimes” in his failed bid to cling to power … ",
    "url": "https://apnews.com/article/trump-jack-smith-election-supreme-court-0b9969b480036bb1f7c61a73980d406c"
  },
  {
    "text": "Trump and his allies are not planning to concede another electoral loss  —  The former president and his allies are making it clear, repeatedly, that the only outcome they will accept without hesitation is one where he is the victor.  —  The reason that it is important to ask Sen. JD Vance … ",
    "url": "https://www.washingtonpost.com/politics/2024/10/02/trump-his-allies-are-not-planning-concede-another-electoral-loss/"
  },
  {
    "text": "Trump fear factor hits Senate GOP … - “I said, 'Sir, if I was you, I would stay out of the race, because there's no win for you in this,'” Sen. Markwayne Mullin (R-Okla.) told us about a recent call with Trump.  — “I hope not,” said Sen. Thom Tillis, when asked if he thinks Trump will weigh in.",
    "url": "https://www.axios.com/2024/10/03/trump-senate-republicans-mcconnell-thune-cornyn"
  },
  {
    "text": "Inside Jim Jordan's campaign for top House Republican  —  Good morning, Early Birds.  Shana tova.  President George W. Bush signed legislation creating the Troubled Asset Relief Program — popularly known as the bank bailout — 16 years ago today.  Send tips to earlytips@washpost.com.",
    "url": "https://www.washingtonpost.com/politics/2024/10/03/inside-jim-jordans-campaign-top-house-republican/"
  },
  {
    "text": "UK will give sovereignty of Chagos Islands to Mauritius  —  The UK has announced it is giving up sovereignty of a remote but strategically important cluster of islands in the Indian Ocean after more than half a century.  —  The deal - reached after years of negotiations … ",
    "url": "https://www.bbc.com/news/articles/c98ynejg4l5o"
  },
  {
    "text": "Walz vs Vance: Fact Checking the VP Debate  —  Tim Walz and JD Vance met for their first and only Vice Presidential debate.  Below I provide a comprehensive analysis on 10 of the most salient questions and subjects.  We have a lot to cover so let's dive in.  Likewise, please consider subscribing to support my work and advocacy.",
    "url": "https://www.qasimrashid.com/p/walz-vs-vance-fact-checking-the-vp"
  },
  {
    "text": "Melania Trump passionately defends abortion rights in upcoming memoir  —  Exclusive: ‘I have carried this belief with me throughout my entire adult life’, former first lady writes in memoir  —  Melania Trump made an extraordinary declaration in an eagerly awaited memoir to be published … ",
    "url": "https://www.theguardian.com/us-news/2024/oct/02/melania-trump-memoir-defends-abortion-rights"
  },
  {
    "text": "Trump campaign brings in $160 million in September  —  Hundreds of millions of dollars raised by each campaign are going towards expensive television buys in battleground states.  —  Donald Trump's campaign reported raising over $160 million in September as it gears up for the final five weeks of the presidential election.",
    "url": "https://www.politico.com/news/2024/10/02/trump-fundraising-september-2024-00182263"
  },
  {
    "text": "“One rough hour”: Experts say Trump's call for a “violent” purge should be taken as a serious threat  —  Experts on authoritarianism told Salon that Trump's support for police brutality should not be dismissed  —  Republican presidential candidate Donald Trump recently claimed that … ",
    "url": "https://www.salon.com/2024/10/02/one-rough-hour-experts-say-call-for-a-violent-purge-should-be-taken-as-a-serious/"
  },
  {
    "text": "Behind the Curtain: Vance's “Minnesota nice” ploy … Walz was girded for war against Vance, who has spent the past 10 weeks defending past controversial remarks.  — Instead, Vance greeted Walz with a big smile, and the two shook hands warmly right off the bat.",
    "url": "https://www.axios.com/2024/10/03/jd-vance-vp-debate-nice"
  },
  {
    "text": "Health Care Is on the Ballot Again  —  In an otherwise confident debate performance on Tuesday, the Republican vice-presidential nominee, J. D. Vance, conspicuously dodged questions from the CBS moderators about his views on health care.  For weeks, Vance has made clear his desire to dismantle … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/10/health-care-election-2024/680132/"
  },
  {
    "text": "How Republicans could subvert the 2024 election  —  During Tuesday night's vice presidential debate, Senator JD Vance (R-OH) refused to acknowledge that former President Donald Trump lost the 2020 election.  “Did [Trump] lose the 2020 election?”  Governor Tim Walz (D-MN) asked Vance.",
    "url": "https://popular.info/p/how-republicans-could-subvert-the"
  },
  {
    "text": "David Nir on downballot races to watch  —  “If there's one takeaway I hope readers of PN take from this, it's to pay attention to these state supreme court races.”  —  ∙ Paid … With so much on the line at the top of the ticket, it's understandable if you haven't been paying close attention to downballot races this year.",
    "url": "https://www.publicnotice.co/p/david-nir-downballot-interview-2024"
  },
  {
    "text": "Harris and Biden surveyed damage wrought by Hurricane Helene in 2 swing states  —  AUGUSTA, Ga. — Vice President Harris took a pause from the campaign trail on Wednesday to visit a neighborhood ravaged by Hurricane Helene where more than half of residents don't have power and many don't have running water … ",
    "url": "https://www.npr.org/2024/10/02/nx-s1-5136749/kamala-harris-joe-biden-hurricane-helene-north-carolina-georgia"
  }
]