[
  {
    "text": "McCarthy, Laboring to Adjust to Life After the Speakership, Eyes Exiting Congress  —  The California Republican is still angry at his ouster and has struggled to acclimate.  His colleagues expect him to retire, but he has taken his time deciding.  —  At an emotional evening news conference immediately … ",
    "url": "https://www.nytimes.com/2023/12/02/us/politics/mccarthy-house-speaker-republicans.html"
  },
  {
    "text": "Hard-right backtrack on spending levels leaves sour taste for colleagues  —  Fiscal fights have been at the heart of Republican conflict this year, including the debate over the top-line spending level for 2024  —  Under a sweltering July heat outside the Capitol, members … ",
    "url": "https://www.washingtonpost.com/politics/2023/12/02/house-freedom-caucus-spending-plan/"
  },
  {
    "text": "Obamacare is even more popular than the last time Trump tried to kill it  —  The issue doesn't specifically motivate Republican voters, either.  —  Donald Trump couldn't repeal Obamacare in 2017, largely because it had become too popular.  It's even more popular now.",
    "url": "https://www.politico.com/news/2023/12/02/trump-obamacare-polling-support-00129721"
  },
  {
    "text": "Pelosi calls Santos a ‘coward’ for leaving chamber before expulsion vote closed  —  Former Speaker Nancy Pelosi took aim at ousted Rep. George Santos (R-N.Y.) after he exited the House chamber Friday before his expulsion vote had come to an end, calling him a “coward” for doing so.",
    "url": "https://thehill.com/homenews/house/4338547-pelosi-calls-santos-coward-for-leaving-chamber-expulsion-vote/"
  },
  {
    "text": "Biden's EPA launches crackdown on planet-warming methane  —  The rule's 3 a.m. rollout was timed to coincide with the ongoing U.N. climate talks in Dubai.  —  The Environmental Protection Agency unveiled sweeping new regulations targeting methane emissions from the oil and gas sector on Saturday … ",
    "url": "https://www.politico.com/news/2023/12/02/bidens-epa-launches-crackdown-on-planet-warming-methane-00129433"
  },
  {
    "text": "911 Call and Affidavit Reveal Chilling Claims in Florida GOP Chair Rape Probe  —  The woman told investigators he showed up at her home after she had cancelled plans with him.  —  The woman who accused Florida GOP chairman Christian Ziegler—husband of Moms for Liberty co-founder Bridget Ziegler … ",
    "url": "https://www.thedailybeast.com/911-call-released-in-florida-gop-chair-christian-ziegler-rape-probe"
  },
  {
    "text": "Trump pardoned them.  Now they're helping him return to power.  —  FOUNTAIN HILLS, Ariz. — At a diner known for political chitchat and Coca-Cola memorabilia, former Maricopa County sheriff Joe Arpaio walked from table to table on a recent fall morning, asking voters to back him for mayor … ",
    "url": "https://www.washingtonpost.com/politics/interactive/2023/trump-pardon-power-2024-benefit/"
  },
  {
    "text": "Henry Kissinger's (Maybe) Last Interview: Drop the Two-State Solution  —  In one of the final interviews before he died, the famous statesman said the two-state solution was no longer viable and that the U.S. must reconcile with China.  —  Former Secretary of State Henry Kissinger is introduced … ",
    "url": "https://www.politico.com/news/magazine/2023/12/02/henry-kissinger-interview-israel-hamas-war-00129374"
  },
  {
    "text": "COP28: UN climate talks take aim at planet-warming food  —  World leaders have for the first time promised to tackle the huge responsibility that food and agriculture have in climate change.  —  More than 130 countries signed up to a declaration about food, on the second day of the UN climate summit COP28 … ",
    "url": "https://www.bbc.com/news/science-environment-67594303"
  },
  {
    "text": "Rep. Smith Statement on Vandalism at His Home  —  WASHINGTON, D.C. -Representative Adam Smith (D-Wash.) today released the following statement on the vandalism against his home in Bellevue, Washington regarding the conflict in Israel and Gaza.  —  “Last night, my house was vandalized … ",
    "url": "https://adamsmith.house.gov/press-releases?ID=576CE593-C52E-4E14-A57E-F429245C2262"
  },
  {
    "text": "Judge denies two of Trump's motions to dismiss his federal election interference case  —  The judge rejected arguments from Trump's lawyers, who cited the First Amendment and presidential immunity in pressing for dismissal of special counsel Jack Smith's case.",
    "url": "https://www.nbcnews.com/politics/donald-trump/judge-denies-two-trumps-motions-dismiss-federal-election-interference-rcna127720"
  },
  {
    "text": "Appeals court orders Texas to remove buoy barrier on the Rio Grande border  —  The U.S. Court of Appeals for the Fifth Circuit rejected Texas Gov. Greg Abbott's request to reverse a lower court's finding that the floating barriers were illegal.  —  A federal appeals court on Friday ordered Texas … ",
    "url": "https://www.nbcnews.com/politics/immigration/appeals-court-orders-texas-remove-buoy-barrier-rio-grande-border-rcna127711"
  },
  {
    "text": "Florida appeals court reverses ruling on DeSantis's congressional maps  —  A state appeals court in Florida reaffirmed Gov. Ron DeSantis's (R) congressional maps Friday, reversing a lower court ruling that labeled them unconstitutional.  —  The appeals court said the lower court misapplied precedent … ",
    "url": "https://thehill.com/homenews/state-watch/4338182-appeals-court-reverses-ruling-desantis-congressional-maps/"
  },
  {
    "text": "Boebert Enlists Dave Chappelle for Transphobic Photo Op  —  SAY CHEESE  —  Dave Chappelle obliged a number of starstruck lawmakers' requests for photos while at Capitol Hill on Thursday, among them Reps. Lauren Boebert (R-CO) and Anna Paulina Luna (R-FL).  “May we get a selfie with you?”",
    "url": "https://www.thedailybeast.com/lauren-boebert-snaps-a-selfie-with-dave-chappelle-on-capitol-hill"
  }
]