[
  {
    "text": "DeSantis Campaign Uses Fake Churchill Quote in Final Message  —  The International Churchill Society once referred to it as “a double misquote” in a blog post on the same set of words.  —  The Ron DeSantis large language model appeared to hallucinate on Sunday, with the campaign running … ",
    "url": "https://www.thedailybeast.com/desantis-campaign-posts-fake-churchill-quote-in-final-message"
  },
  {
    "text": "‘A total failure to launch’: Why Ron DeSantis was doomed from the start  —  Muddled messages, hiring too many staffers and even a puzzle — how it all went wrong for DeSantis' presidential bid.  —  Iowa was supposed to be make-or-break for Ron DeSantis.  —  The Florida governor essentially moved … ",
    "url": "https://www.nbcnews.com/politics/2024-election/ron-desantis-campaign-doomed-puzzle-rcna132688"
  },
  {
    "text": "Ron DeSantis ends his presidential bid before New Hampshire after falling far short of Trump  —  WASHINGTON (AP) — Florida Gov. Ron DeSantis suspended his Republican presidential campaign Sunday on the eve of the New Hampshire primary, ending a White House bid that failed to meet expectations … ",
    "url": "https://apnews.com/article/ron-desantis-250c8ed4b49843350e258f0c2754c8ba"
  },
  {
    "text": "Ron DeSantis ends presidential campaign, endorses Trump  —  Florida Gov. Ron DeSantis is ending his once-promising presidential campaign, which steadily deflated as he struggled to connect with voters and convince Republicans to swap Donald Trump for a younger, more disciplined champion of his ideas.",
    "url": "https://www.washingtonpost.com/politics/2024/01/21/ron-desantis-drops-out/"
  },
  {
    "text": "What DeSantis suspending his campaign could mean for Haley  —  GOP Presidential candidate and former UN Ambassador Nikki Haley shares that this is the race she has been hoping for after Ron DeSantis announced his 2024 campaign suspension.  NBC News' Ali Vitali explains how the suspension will affect the Haley campaign moving forward.",
    "url": "https://www.nbcnews.com/now/video/what-desantis-suspending-his-campaign-could-mean-for-haley-202588229713"
  },
  {
    "text": "The lawless presidency  —  In Federalist No. 69, Alexander Hamilton explains the key difference between the “king of Great Britain” and the “President of the United States.”  A king, Hamilton explains, is “sacred and inviolable” and “there is no constitutional tribunal to which he is amenable.”",
    "url": "https://popular.info/p/the-lawless-presidency"
  },
  {
    "text": "Polls Show Trump Could Be Doomed If He's Convicted.  Will a Trial Happen in Time?  —  Here's the real timeline for Trump's criminal trials.  —  This sketch depicts former President Donald Trump (right) listening as his attorney D. John Sauer speaks before the D.C. Circuit Court of Appeals … ",
    "url": "https://www.politico.com/news/magazine/2024/01/22/trump-jan-6-trial-polls-00136688"
  },
  {
    "text": "In Judge Kaplan's court, Trump plays with fire  —  A misbehaving defendant claims to want a showdown Monday with a judge who has a unique track record on contempt  —  In the high-stakes world of presidential trials, there are no judges like Lewis A. Kaplan.",
    "url": "https://www.washingtonpost.com/national-security/2024/01/21/trump-carroll-judge-kaplan-witness/"
  },
  {
    "text": "South Carolina Sen. Tim Scott, a possible VP pick, is engaged to be married  —  His fiancée Mindy Noce wore an engagement ring to church in South Carolina this morning, following an engagement last night on Kiawah Island  —  Sen. Tim Scott (R-S.C.), a former presidential candidate … ",
    "url": "https://www.washingtonpost.com/elections/2024/01/21/tim-scott-engaged-vp-trump/"
  },
  {
    "text": "California's marquee Senate race could be bad news for down ballot Dems  —  Strategists with some Democratic House campaigns in California said the state's Senate race has sucked up all the oxygen and made it more difficult to fundraise.  —  California's Rep. Adam Schiff's $35 million war chest … ",
    "url": "https://www.politico.com/news/2024/01/22/adam-schiff-katie-porter-campaign-funding-00136890"
  },
  {
    "text": "CENTCOM Status Update on Missing Navy SEALs  —  TAMPA, Fla. - We regret to announce that after a 10-day exhaustive search, our two missing U.S. Navy SEALs have not been located and their status has been changed to deceased.  The search and rescue operation for the two Navy SEALs reported missing during … ",
    "url": "https://www.centcom.mil/MEDIA/PRESS-RELEASES/Press-Release-View/Article/3651310/centcom-status-update-on-missing-navy-seals/"
  },
  {
    "text": "Abortion fight puts Vice President Harris at center of 2024 election campaign  —  WASHINGTON (AP) — Vice President Kamala Harris is taking center stage in the Democrats' renewed push for abortion rights during this year's election and she will mark the 51st anniversary of the Roe v. Wade ruling on Monday in Wisconsin.",
    "url": "https://apnews.com/article/kamala-harris-abortion-biden-2024-election-560bc2bbdf036c18b6601ced44a62b50"
  },
  {
    "text": "House Jan. 6 Committee deleted more than 100 encrypted files days before GOP took majority: sources  —  Loudermilk is demanding then-Jan. 6 Chairman Thompson provide passwords for encrypted files  —  Read this article for free!  —  Plus get unlimited access to thousands of articles, videos and more with your free account!",
    "url": "https://www.foxnews.com/politics/house-committee-jan-6-deleted-encrypted-117-files-was-required-share-house-gop-sources"
  },
  {
    "text": "Donald Trump's Campaign Cuts Off Access After Refusing To Allow NBC News' Vaughn Hillyard As Designated Pool Reporter  —  Donald Trump's campaign refused to agree to let an NBC News correspondent travel with him on New Hampshire campaign stops today as the designated pool reporter, leading to access being cut off for the day.",
    "url": "https://deadline.com/2024/01/donald-trumps-campaign-cuts-off-access-after-refusing-to-allow-nbc-news-vaughn-hillyard-as-designated-pool-reporter-1235799928/"
  }
]