[
  {
    "text": "Live Updates: Wall Street Slumps Further as Trump Defends His Tariffs  —  The S&P 500 tumbled, entering bear market territory, after more losses in Asia and Europe.  President Trump said he would not back off his trade war, reinforcing fears of a global economic downturn.  —  Here's the latest.",
    "url": "https://www.nytimes.com/live/2025/04/07/business/trump-tariffs-stock-market"
  },
  {
    "text": "Scoop: Trump issues veto threat on tariff bill  —  President Trump would veto the legislation introduced by Sens. Maria Cantwell (D-Wash.) and Sen. Chuck Grassley (R-Iowa) that would limit the president's authority to unilaterally impose tariffs, according to a White House statement seen by Axios.",
    "url": "https://www.axios.com/2025/04/07/trump-veto-tariff-bill-grassley"
  },
  {
    "text": "Jamie Dimon sounds the alarm bell on tariffs  —  JPMorgan CEO Jamie Dimon has issued a blunt warning about President Donald Trump's tariff policy: It threatens to raise prices, drive the global economy into a downturn and weaken America's standing in the world.",
    "url": "https://cnn.com/2025/04/07/business/jamie-dimon-tariff-warning"
  },
  {
    "text": "House will give Trump ‘space’ on tariffs, Johnson says  —  Speaker Mike Johnson said Monday that the House will provide President Donald Trump with “space” to carry out his massive global tariff regime, even as some GOP lawmakers openly plead with Trump to negotiate off-ramps before the levies kick in on Wednesday.",
    "url": "https://www.politico.com/live-updates/2025/04/07/congress/house-will-give-trump-space-on-tariffs-johnson-says-00276498"
  },
  {
    "text": "Trump asks Supreme Court to block judge's order requiring US to bring back man who was wrongly deported  —  The Trump administration has described Abrego Garcia's deportation both as an “administrative error” and a “clerical error.”  —  The Trump administration is asking the Supreme Court … ",
    "url": "https://www.politico.com/news/2025/04/07/abrego-garcia-case-trump-deportation-el-salvador-00276237"
  },
  {
    "text": "Trump asks Supreme Court to block order returning deportee from El Salvador  —  Judge Paula Xinis gave the Trump administration until midnight Monday to return Kilmar Abrego García, who was deported despite a court order forbidding it.  —  The Trump administration asked the Supreme Court … ",
    "url": "https://www.washingtonpost.com/politics/2025/04/07/trump-deportee-mistake-supreme-court-abrego-garcia/"
  },
  {
    "text": "Trump Plans $92 Million Military Parade—Honoring Himself  —  Donald Trump may finally get his long-desired military parade through the streets of Washington.  —  The Washington City Paper, citing an unnamed D.C. source, reports that the president has chosen June 14, 2025 … ",
    "url": "https://newrepublic.com/post/193674/trump-military-parade-birthday"
  },
  {
    "text": "Trump Orders Four Mile Military Parade for His 79th Birthday  —  SHOW OF FARCE  —  The president was previously forced to abandon plans for a procession in Washington, D.C., due to its colossal price tag.  —  President Donald Trump is making plans for a military parade in Washington … ",
    "url": "https://www.thedailybeast.com/trump-orders-four-mile-military-parade-for-his-79th-birthday/"
  },
  {
    "text": "European Union Slaps 25% Tariffs On United States In Retaliation  —  Only Zimbabwe and Penguin Island are willing to negotiate with Trump  —  The European Commission has announced a new wave of counter-tariffs in retaliation to the United States' escalating protectionist measures under President Donald Trump.",
    "url": "https://meidasnews.com/news/european-union-slaps-25-tariffs-on-united-states-in-retaliation"
  },
  {
    "text": "US Justice Dept mobilized armed Marshals to warn ex-lawyer over congressional testimony, letter shows  —  The U.S. Justice Department sent armed U.S. Marshals to deliver a letter warning a fired career pardon attorney about testifying to congressional Democrats, her lawyer said in a letter seen by Reuters on Monday.",
    "url": "https://www.reuters.com/world/us/us-justice-dept-mobilized-armed-marshals-warn-ex-lawyer-over-congressional-2025-04-07/"
  },
  {
    "text": "Social Security website keeps crashing, as DOGE demands cuts to IT staff  —  The worsening problems come as Elon Musk's DOGE team pushes for more cuts at the agency, including in the department that oversees the website.  —  Retirees and disabled people are facing chronic website outages … ",
    "url": "https://www.washingtonpost.com/politics/2025/04/07/social-security-website-crashes-musk-trump/"
  },
  {
    "text": "I Should Have Seen This Coming  —  When I joined the conservative movement in the 1980s, there were two types of people: those who cared earnestly about ideas, and those who wanted only to shock the left.  The reactionary fringe has won.  —  Listen to more stories on Hark",
    "url": "https://www.theatlantic.com/magazine/archive/2025/05/trumpism-maga-populism-power-pursuit/682116/?gift=mBLCHcnsd_Gd3EecvWSKTc_XhOOOYDxoVsQH4EROPEI&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "‘Wi-Fi Keeps Going Down’: Donald Trump's Return-to-Office Mandate Is Going Terribly  —  Dozens of federal employees tell WIRED the return-to-office order has resulted in widespread chaos, plummeting productivity, and significantly reduced services to the public.",
    "url": "https://www.wired.com/story/federal-workers-rto-chaos/"
  },
  {
    "text": "After President Donald Trump's tariff announcements on April 2 wiped $5 trillion dollars from the stock market, the Republican Party is scrambling.  —  Farmers, who were a part of Trump's base, are “struck and shocked” by the tariffs, the president of the South Dakota Farmers Union told Lauren Scott … ",
    "url": "https://heathercoxrichardson.substack.com/p/april-6-2025-sunday"
  },
  {
    "text": "UAW President Shawn Fain explains why he supports Trump's tariffs  —  President Trump's announcements on tariffs have dismayed many of his erstwhile supporters on Wall Street.  The suddenness — and steepness — of the tariffs announced last Wednesday prompted some global manufacturers … ",
    "url": "https://www.npr.org/2025/04/07/nx-s1-5352409/trump-auto-tariffs-uaw-shawn-fain"
  },
  {
    "text": "RFK Jr. visits Texas after second child dies of measles amid outbreak  —  Sen. Bill Cassidy (R), a medical doctor, called on top health officials to “unequivocally” endorse measles vaccinations before “another child dies.”  —  A second child has died of measles amid an outbreak in West Texas … ",
    "url": "https://www.washingtonpost.com/health/2025/04/06/measles-texas-death-outbreak-vaccine/"
  },
  {
    "text": "Exclusive: US admiral at NATO fired in expanding national security purge  —  U.S. Navy Vice Admiral Shoshana Chatfield, who holds a senior position in NATO, has been fired as part of what appears to be an expanding national security purge of top officials by the Trump administration, three sources told Reuters on Monday.",
    "url": "https://www.reuters.com/world/us/us-admiral-nato-fired-expanding-national-security-purge-2025-04-07/"
  },
  {
    "text": "Scoop: Schatz expands holds to more than 300 Trump nominees  —  Sen. Brian Schatz (D-Hawaii) is expanding his holds on President Trump's nominees to include an additional 50 names — along with a batch of bipartisan foreign affairs bills, Axios has learned.  —  Why it matters … ",
    "url": "https://www.axios.com/2025/04/07/schatz-holds-more-than-300-trump-nominees"
  },
  {
    "text": "Former clerk for judge who tossed Trump's classified docs case now in senior DOJ position  —  A former law clerk to Judge Aileen Cannon is now with the Justice Department.  —  President Donald Trump crosses the South Lawn after exiting Marine One at White House in Washington, April 6, 2025.",
    "url": "https://abcnews.go.com/US/former-clerk-judge-tossed-trumps-classified-docs-case/story?id=120565274"
  },
  {
    "text": "Peter Navarro says Vietnam's 0% tariff offer is not enough: 'It's the nontariff cheating that matters'  —  WATCH NOW  —  White House trade advisor Peter Navarro said Monday that an offer by Vietnam to eliminate tariffs on U.S. imports would not be enough for the administration to lift its new levies announced last week.",
    "url": "https://www.cnbc.com/2025/04/07/peter-navarro-says-vietnams-0percent-tariff-offer-is-not-enough-its-the-non-tariff-cheating-that-matters.html"
  },
  {
    "text": "Columbia's Former President Undergoes Heated Government Questioning in Closed-Door Session  —  Relations remain tense as the school negotiates over federal funding  —  Closed-door government questioning of Columbia University's recently departed interim president indicates … ",
    "url": "https://www.wsj.com/us-news/education/columbia-katrina-armstrong-deposition-trump-ac708391"
  },
  {
    "text": "Harriet Tubman reference removed from National Parks' Underground Railroad web page  —  The National Parks Service (NPS) has removed a reference to abolitionist Harriet Tubman from its webpage dedicated to the Underground Railroad.  —  For years, the Parks' page on the Underground Railroad featured a prominent photo of Tubman.",
    "url": "https://thehill.com/homenews/race-politics/5235796-harriet-tubman-underground-railroad-nps-national-parks-service-maryland-trump-dei/"
  },
  {
    "text": "Political Styles of the Rich and Clueless  —  As we wait to see what fresh hell awaits us this week, one obvious question is, who put these malevolent clowns in power?  —  The short answer is ignorant people.  But political ignorance takes two different forms.",
    "url": "https://paulkrugman.substack.com/p/political-styles-of-the-rich-and"
  },
  {
    "text": "‘This is the Trump recession,’ CEOs say, with tariff price increases, job losses coming: CNBC survey … WATCH NOW  —  The market has been through a housing crash, a dotcom bubble, a global pandemic, and the twin headwinds of the Russia-Ukraine war and runaway inflation in recent history … ",
    "url": "https://www.cnbc.com/2025/04/07/trump-recession-inflation-job-losses-coming-ceos-say-cnbc-survey.html"
  },
  {
    "text": "US bishops halt partnerships with federal government on aid programs, citing funding cuts  —  The U.S. Conference of Catholic Bishops announced Monday that it is ending a half-century of partnerships with the federal government to serve refugees and children, saying the “heartbreaking” … ",
    "url": "https://apnews.com/article/catholic-bishops-refugee-resettlement-trump-administration-362231100b8e4650c00d22a75b5c6ab8"
  },
  {
    "text": "The Shocking Far-Right Agenda Behind the Facial Recognition Tech Used by ICE and the FBI  —  One evening in March 2017, Hoan Ton-That, an Australian coder building a powerful facial recognition system, emailed his American business partners with a plan to deploy their fledgling technology.",
    "url": "https://www.motherjones.com/politics/2025/04/clearview-ai-immigration-ice-fbi-surveillance-facial-recognition-hoan-ton-that-hal-lambert-trump/"
  }
]