[
  {
    "text": "Top Social Security official exits after clash with Musk's DOGE over data  —  Yet another top career staffer is leaving the administration amid a disagreement over a request by Elon Musk's team for sensitive government information.",
    "url": "https://www.washingtonpost.com/politics/2025/02/17/doge-social-security-musk/"
  },
  {
    "text": "Who's in charge of DOGE?  Not Elon Musk, White House says  —  A Trump administration personnel official says Musk has “no actual or formal authority to make government decisions.”  —  Elon Musk is not the leader of DOGE — the mysterious Trump administration operation overseeing an effort to break and remake the federal bureaucracy.",
    "url": "https://www.politico.com/news/2025/02/17/doge-administrator-elon-musk-00204639"
  },
  {
    "text": "4 Top Officials to Resign Over Adams's Cooperation With Trump  —  Four deputy mayors to Eric Adams are leaving “to stay faithful to the oaths we swore to New Yorkers and our families,” they said in a statement.  —  Four top New York City officials said they would resign after the Justice Department moved … ",
    "url": "https://www.nytimes.com/2025/02/17/nyregion/adams-deputy-mayors-resign-trump-immigration.html"
  },
  {
    "text": "A team from SpaceX is being brought in to overhaul FAA's air traffic control system  —  The visit comes after a union representing FAA workers says hundreds are being laid off. … A team from Elon Musk's SpaceX is visiting the Air Traffic Control Command Center in Virginia Monday … ",
    "url": "https://www.theverge.com/news/614078/faa-air-traffic-control-spacex-elon-musk-layoff-staff-shortage"
  },
  {
    "text": "Trump begins firings of FAA staff just weeks after fatal DC plane crash  —  The Trump administration has begun firing several hundred Federal Aviation Administration employees, upending staff on a busy air travel weekend and just weeks after a January fatal midair collision at Ronald Reagan Washington National Airport.",
    "url": "https://apnews.com/article/doge-faa-air-traffic-firings-safety-67981aec33b6ee72cbad8dcee31f3437"
  },
  {
    "text": "No, 150-Year-Olds Aren't Collecting Social Security Benefits  —  Elon Musk claims to have found rampant fraud in the Social Security Administration.  There's a much simpler explanation.  —  Elon Musk has repeatedly claimed that his so-called Department of Government Efficiency (DOGE) … ",
    "url": "https://www.wired.com/story/elon-musk-doge-social-security-150-year-old-benefits/"
  },
  {
    "text": "Thousands Gather on Presidents' Day to Call Trump a Tyrant  —  Thousands of protesters opposing broad swaths of President Trump's agenda took to the streets across the country, including outside the U.S. Capitol.  —  Thousands of protesters opposing broad swaths of President Trump's agenda took … ",
    "url": "https://www.nytimes.com/2025/02/17/us/politics/trump-musk-protests-50501-presidents-day.html?unlocked_article_code=1.x04.tG-e.UWjWRCoH_X6G&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Delta Plane Overturns at Toronto Airport While Landing  —  The airport said on social media that emergency teams were responding and that all passengers and crew were accounted for.  —  A Delta Air Lines flight arriving at Toronto Pearson Airport from Minneapolis appears to have overturned … ",
    "url": "https://www.nytimes.com/2025/02/17/world/canada/delta-toronto-plane-crash.html?unlocked_article_code=1.xk4.UE47.jx1FYaRcA_lv&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "This Is the Way to Stop Elon Musk  —  Senate Democrats have the power to block federal contracts to Tesla and SpaceX.  It's the path to pushing Musk out of politics.  —  WITH THE BACKING of President Donald Trump, Elon Musk has embarked on an unconstitutional rampage against the federal government.",
    "url": "https://theintercept.com/2025/02/17/elon-musk-trump-government-tesla-spacex/"
  },
  {
    "text": "Washington Post Cancels Ad From Groups Calling for Trump to Fire Musk  —  The newspaper told Common Cause, an advocacy group, that it was pulling its special ad, which would have covered the front and back pages of some Tuesday editions.  —  An advertisement that was set to run in some editions … ",
    "url": "https://www.nytimes.com/2025/02/17/business/washington-post-ad-trump-musk.html"
  },
  {
    "text": "Europe grapples over its “collective security” under pressure from Trump  —  European leaders gathered Monday in Paris for a hastily organized meeting to discuss how to react to recent diplomatic moves by the Trump administration pertaining to Ukraine.  The leaders of Poland, Germany … ",
    "url": "https://www.cbsnews.com/news/trump-russia-war-ukraine-nato-uk-sweden-troops-europe-security/"
  },
  {
    "text": "Department of Homeland Security preparing to fire hundreds of senior leaders this week  —  The firings are a move not to reduce the size of the workforce but to get rid of people the administration sees as not on board with its goals.  —  The Trump administration is preparing to fire hundreds … ",
    "url": "https://www.nbcnews.com/politics/national-security/department-homeland-security-preparing-fire-100s-leaders-rcna192493"
  },
  {
    "text": "'It's gone': Elon Musk suggests without evidence that gold was ‘stolen’ from Fort Knox  —  Sen. Mike Lee (R-UT) and Department of Government Efficiency Chair Elon Musk demanded access to the gold stored at Fort Knox.  —  Writing on Musk's social media platform X, Lee said he was repeatedly denied access … ",
    "url": "https://www.rawstory.com/fort-knox/"
  },
  {
    "text": "Exclusive: FDA staff reviewing Musk's Neuralink were included in DOGE employee firings, sources say  —  U.S. Food and Drug Administration employees reviewing Elon Musk's brain implant company Neuralink were fired over the weekend as part of a broader purge of the federal workforce, according to two sources with knowledge of the matter.",
    "url": "https://www.reuters.com/world/us/fda-staff-reviewing-musks-neuralink-were-included-doge-employee-firings-sources-2025-02-17/"
  },
  {
    "text": "Argentina president faces impeachment calls over crypto crash  —  Argentine President Javier Milei is facing impeachment calls - and legal action accusing him of fraud - over his promotion of cryptocurrency on social media.  —  Milei posted on X, formerly Twitter, about the $LIBRA coin on Friday … ",
    "url": "https://www.bbc.com/news/articles/cp9x9j89evxo"
  },
  {
    "text": "White House Email Snafu Said to Stall Firings of US Attorneys  —  The White House sent termination emails to the wrong addresses of as many as 22 US attorneys who learned they'd been dismissed five days later after a perplexing weekend, said two people familiar with the process.",
    "url": "https://news.bloomberglaw.com/us-law-week/white-house-email-snafu-said-to-stall-firings-of-us-attorneys"
  },
  {
    "text": "Republican Senators Try to Curb Influence of Trump Tariff Hawk  —  White House trade adviser has had major influence on punitive levies as Trump's trade team awaits Senate confirmation  —  WASHINGTON—President Trump has peppered the first month of his presidency with trade actions even before the bulk of his trade team is in place.",
    "url": "https://www.wsj.com/politics/policy/peter-navarro-trump-administration-tariffs-c7242b2a"
  },
  {
    "text": "Hegseth claims Biden administration targeted him with IRS audit  —  The Defense secretary posted a photo of a letter showing the IRS seeking more than $33,000.  —  Secretary of Defense Pete Hegseth on Monday accused the Biden administration of orchestrating a last-minute audit of him and his wife … ",
    "url": "https://www.politico.com/news/2025/02/17/pete-hegseth-irs-audit-biden-administration-00204626"
  },
  {
    "text": "Bice: An Elon Musk-backed group buys at least $670,000 of TV time to support Brad Schimel  —  Conservative Supreme Court candidate Brad Schimel said just recently he was hoping conservative third-party groups would start buying up TV time in the state “very soon.”  —  Ask and you shall receive.",
    "url": "https://www.jsonline.com/story/news/politics/elections/2025/02/17/elon-musk-group-buys-tv-ads-backing-brad-schimel-for-supreme-court/78976985007/"
  },
  {
    "text": "Elon Musk ridiculed a blind person on X. Then a mob went to work.  —  Musk's unparalleled online reach on X has given him a powerful tool to attack individuals who criticize DOGE.  —  Dylan Hedtler-Gaudette works at the Project on Government Oversight, a nonpartisan watchdog group focused on reducing bureaucratic waste.",
    "url": "https://www.washingtonpost.com/technology/2025/02/17/elon-musk-x-target-critics-federal-employees/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM5NzY4NDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQxMTUwNzk5LCJpYXQiOjE3Mzk3Njg0MDAsImp0aSI6IjZmNWRhNjI3LTAzYmQtNGI2MC1iNzQ4LTFiNTFjNTMwNTA1OCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS90ZWNobm9sb2d5LzIwMjUvMDIvMTcvZWxvbi1tdXNrLXgtdGFyZ2V0LWNyaXRpY3MtZmVkZXJhbC1lbXBsb3llZXMvIn0.1OjimICgPEoOa7-8-pGolRc_WFgSdKNRV0QqcWsCLk8&itid=gfta"
  },
  {
    "text": "Jewish man mistakes two Israeli tourists for Palestinians and opens fire on them in Miami  —  Victims reportedly posted ‘death to Arabs’ on social media after shooting while suspect held on attempted murder charges  —  A Jewish man in Miami Beach is facing charges of attempted murder following accusations … ",
    "url": "https://www.theguardian.com/us-news/2025/feb/17/miami-shooting-israeli-men"
  },
  {
    "text": "Trump casts psychiatric and weight-loss drugs as threats to children  —  Trump directed a panel headed by HHS Secretary Robert F. Kennedy Jr. to assess “the prevalence of and threat” posed by SSRIs, mood stabilizers, stimulants, and weight-loss drugs.",
    "url": "https://www.washingtonpost.com/health/2025/02/16/trump-psychiatric-medications-drugs-weight/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM5NzY4NDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQxMTUwNzk5LCJpYXQiOjE3Mzk3Njg0MDAsImp0aSI6IjEyMjcyZjU4LTY3NzUtNDc5Mi1hMzk1LWExMjIxMjczZWRmYiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9oZWFsdGgvMjAyNS8wMi8xNi90cnVtcC1wc3ljaGlhdHJpYy1tZWRpY2F0aW9ucy1kcnVncy13ZWlnaHQvIn0.9hLGS2XRTmRKIxWOtgOG8E39wCTyYX7bpUZ0_GCTGp4"
  },
  {
    "text": "WSJ asks Kennedy to cast aside ‘antivax hooey’ amid Texas measles outbreak  —  The Wall Street Journal's editorial board published on op-ed on Monday calling on Health and Human Services Secretary Robert F. Kennedy Jr. to set aside his anti-vaccine activist positions in light … ",
    "url": "https://thehill.com/policy/healthcare/5149761-wsj-kennedy-antivax-texas-measles-outbreak/"
  }
]