[
  {
    "text": "Trump has no immunity from Jan. 6 prosecution, appeals court rules  —  A federal appeals court has unanimously ruled that Donald Trump can be put on trial for trying to stay in power after losing the 2020 election, rejecting Trump's sweeping claim of presidential immunity and moving the case one step closer to a jury.",
    "url": "https://www.washingtonpost.com/dc-md-va/2024/02/06/trump-jan-6-immunity-appeal-denied/"
  },
  {
    "text": "Accountant's Apparent Lies Further Dooms Trump's Bank Fraud Defense  —  Trump accountant Allen Weisselberg is apparently working out a deal addressing lies he told on the stand in the New York bank fraud trial.  Now Trump is in even more trouble.  —  Donald Trump's expected massive loss … ",
    "url": "https://www.thedailybeast.com/judge-demands-trump-explain-his-accountant-allen-weisselbergs-apparent-lies"
  },
  {
    "text": "Trump is not immune from prosecution for bid to subvert the 2020 election, appeals court rules  —  The unanimous 57-page decision is a major win for special counsel Jack Smith.  —  Former President Donald Trump — and indeed any other former president — may be prosecuted for alleged crimes … ",
    "url": "https://www.politico.com/news/2024/02/06/trump-is-not-immune-from-prosecution-for-bid-to-subvert-the-2020-election-appeals-court-rules-00139832"
  },
  {
    "text": "Appeals court rules against Trump presidential immunity in 2020 election interference case  —  Trump is likely to ask the Supreme Court to intervene after the ruling, which would allow the trial to go ahead in the criminal case in Washington, D.C.  —  WASHINGTON — A federal appeals court … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/appeals-court-rules-trump-presidential-immunity-2020-election-interfer-rcna133234"
  },
  {
    "text": "The GOP's True Priority  —  The Republicans who won't take yes for an answer  —  Sometimes, a negotiation produces a deal.  —  Sometimes, a negotiation reveals the truth.  —  Negotiators in the Senate have produced a draft agreement on immigration and asylum.  The deal delivers on Republican priorities.",
    "url": "https://www.theatlantic.com/ideas/archive/2024/02/republicans-congress-immigration-deal/677357/"
  },
  {
    "text": "As a compromise border plan collapses, the GOP is in disarray  —  There can be little doubt that one of the major American political parties is in disarray, but it's not the Democratic Party.  —  For those familiar with online political commentary, the phrase “Dems in disarray” … ",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/compromise-border-plan-collapses-gop-disarray-rcna137424"
  },
  {
    "text": "The GOP dog caught the car.  Again.  —  Welp, the dog caught the car again.  After months — decades? — of running on tightening the border, House Republicans are suddenly paralyzed when offered the chance to do so.  —  A hard-won, bipartisan Senate deal dropped Sunday evening … ",
    "url": "https://www.washingtonpost.com/opinions/2024/02/05/border-security-deal-immigration-johnson-obamacare/"
  },
  {
    "text": "N.H. attorney general says he found source of fake Biden robocalls  —  New Hampshire's top law enforcement official said, “We have never seen...such a blatant attempt to mislead voters.”  —  New Hampshire's Attorney General on Tuesday named a Texas telecom company as the source … ",
    "url": "https://www.nbcnews.com/politics/2024-election/nh-attorney-general-says-found-source-fake-biden-robocalls-rcna137499"
  },
  {
    "text": "The RNC's chief of staff is stepping down  —  The departure comes amid growing speculation that Donald Trump will push for changes at the committee.  —  Republican National Committee chief of staff Mike Reed is set to step down from his role later this month.  —  Reed had served as chief of staff at the committee since Jan. 2022.",
    "url": "https://www.politico.com/news/2024/02/06/rnc-chief-of-staff-stepping-down-trump-00139867"
  },
  {
    "text": "Jury finds Jennifer Crumbley guilty of manslaughter in son's school shooting  —  Ethan Crumbley killed four students at his high school in November 2021.  —  LIVE  —  Jennifer Crumbley, the mother of accused Oxford High School gunman Ethan Crumbley, listens on the stand in the courtroom … ",
    "url": "https://abcnews.go.com/US/jury-reaches-verdict-jennifer-crumbley-manslaughter-trial/story?id=106924349"
  },
  {
    "text": "Second GOP rep says he'll vote against Mayorkas impeachment  —  Rep. Tom McClintock (R-Calif.) announced Tuesday that he would vote against a resolution to impeach Homeland Security Secretary Alejandro Mayorkas, becoming the second Republican to buck the party and putting GOP plans in jeopardy.",
    "url": "https://thehill.com/homenews/house/4450627-gop-loses-second-vote-in-effort-to-impeach-mayorkas/"
  },
  {
    "text": "Christie calls hot mic moment ‘a complete mistake’ in 1st interview since leaving race  —  The former governor sat down exclusively with George Stephanopoulos.  —  Former New Jersey Governor and Republican presidential candidate Chris Christie speaks with George Stephanopoulos from ABC News, Feb. 5, 2024.",
    "url": "https://abcnews.go.com/Politics/christie-calls-hot-mic-moment-complete-mistake-1st/story?id=106974944"
  },
  {
    "text": "70 Current And Former NYCHA Employees Charged With Bribery And Extortion Offenses  —  For Immediate Release  —  U.S. Attorney's Office, Southern District of New York  —  In the Largest Number of Federal Bribery Charges on a Single Day in DOJ History, 70 Current and Former Employees … ",
    "url": "https://www.justice.gov/usao-sdny/pr/70-current-and-former-nycha-employees-charged-bribery-and-extortion-offenses"
  },
  {
    "text": "Bluesky, a trendy rival to X, finally opens to the public  —  The upstart social network has been by invitation only since its launch last year  —  When Jack Dorsey, then Twitter's CEO, tweeted in 2019 that he planned to create a new, “decentralized” form of social media, most people scratched their heads.",
    "url": "https://www.washingtonpost.com/technology/2024/02/06/bluesky-launch-public-jay-graber/"
  },
  {
    "text": "Tensions flare in Trump world over Montana's GOP Senate primary  —  As Rep. Matt Rosendale prepares to launch a campaign, frustrations about his lack of loyalty are filtering out from aides and others close to the former president.  —  A hostile Republican Senate primary is brewing in Montana … ",
    "url": "https://www.nbcnews.com/politics/2024-election/trump-world-tensions-montana-senate-primary-rcna136816"
  },
  {
    "text": "Category 6?  Climate-boosted hurricanes push scientists to rethink classifications  —  The findings add to ongoing debates about how to better communicate to the public the threats of extreme weather events and the ways that climate change can multiply them.",
    "url": "https://www.nbcnews.com/science/science-news/category-6-climate-boosted-hurricanes-push-scientists-rethink-classifi-rcna137454"
  },
  {
    "text": "Study cited by Texas judge in abortion pill case retracted  —  Two of the key studies cited by plaintiffs and judges as evidence that medication abortion should be pulled from the market or heavily restricted have been retracted because of undeclared conflicts of interest and unreliable findings … ",
    "url": "https://www.rawstory.com/study-cited-by-texas-judge-in-abortion-pill-case-retracted/"
  },
  {
    "text": "Toby Keith dead: Country singer dies following cancer battle at 62  —  Country music star Toby Keith has died at the age of 62, his family announced early Tuesday morning.  —  Keith, best known for songs such as “Red Solo Cup”, “Should've Been a Cowboy,” “Beer for My Horses,” … ",
    "url": "https://www.washingtonexaminer.com/news/2839288/toby-keith-dead-country-singer-dies-following-cancer-battle-at-62/"
  }
]