[
  {
    "text": "GOP senator: Greene ‘dragging our brand down’  —  Sen. Thom Tillis (R-N.C.) took a shot at Rep. Marjorie Taylor Greene (R-Ga.) Tuesday, saying she is “dragging our brand down.”  —  “She is a horrible leader,” Tillis said of Greene, according to audio played on CNN's “Erin Burnett OutFront.”",
    "url": "https://thehill.com/homenews/senate/4617334-gop-senator-thom-tillis-says-greene-dragging-our-brand-down/"
  },
  {
    "text": "Congress Pokes Trump, Putin in Eye  —  The foreign aid bill—$95 billion for Ukraine, Israel, and Taiwan, plus other sundries like a possible ban on TikTok—is headed to Joe Biden's desk after the Senate approved it 79-18 last night.  —  A quick reminder: It was only months ago … ",
    "url": "https://www.thebulwark.com/p/congress-pokes-trump-putin-in-eye"
  },
  {
    "text": "GOP senator bashes Marjorie Taylor Greene: ‘She is dragging our brand down’  —  Sen. Thom Tillis, R-N.C., called Rep. Marjorie Taylor Greene, R-Ga., one of the Republican party's “biggest risks” following her opposition to passing foreign aid.  —  Sen. Thom Tillis, R-N.C. … ",
    "url": "https://www.nbcnews.com/politics/congress/gop-senator-bashes-marjorie-taylor-greene-dragging-brand-rcna149136"
  },
  {
    "text": "How Donald Trump Gets His News  —  The former president is a voracious press consumer.  Here's how his media diet has changed since his last presidential campaign.  —  Donald Trump has always had a symbiotic relationship with the media.  Back when he was a Manhattan bachelor and real estate mogul … ",
    "url": "https://www.politico.com/news/magazine/2024/04/24/donald-trump-news-consumption-00153477"
  },
  {
    "text": "Why is Trump giving someone a ‘key to the White House’?  —  From Jan. 20, 2017, until Jan. 20, 2021, Donald Trump was president of the United States.  This is a position that includes many perks, offered to the person who was selected by American voters to serve as chief executive.",
    "url": "https://www.washingtonpost.com/politics/2024/04/24/trump-key-to-white-house/"
  },
  {
    "text": "Airlines Required To Give Automatic Cash Refunds For Canceled And Delayed Flights  —  The Biden administration is defining a significant delay as lasting at least three hours for domestic flights and six hours for international ones.  —  LOADING  —  The Biden administration issued final rules Wednesday … ",
    "url": "https://www.huffpost.com/entry/airlines-fee-rules_n_66291e2be4b01248ca9b9290"
  },
  {
    "text": "Trump is a co-conspirator in Michigan's 2020 false electors plot, state investigator says  —  Lansing — Michigan prosecutors consider former President Donald Trump and some of his top aides co-conspirators in the plot to submit a certificate falsely claiming he won Michigan's 2020 election … ",
    "url": "https://www.detroitnews.com/story/news/politics/2024/04/24/donald-trump-unindicted-co-conspirator-in-false-electors-plot-michigan-rudy-giuliani-mark-meadows/73420368007/"
  },
  {
    "text": "Trump, Giuliani, Meadows are unindicted co-conspirators in Michigan fake elector case, hearing reveals  —  The Michigan AG last year charged 16 Republicans with being “fake electors.”  —  Former President Donald Trump speaks to supporters during a Farmers for Trump campaign event … ",
    "url": "https://abcnews.go.com/US/trump-giuliani-meadows-unindicted-conspirators-michigan-fake-elector/story?id=109578220"
  },
  {
    "text": "Chris Christie, unplugged  —  Good morning, Early Birds.  We hope your allergies aren't as bad as ours, but sorry to be the bearer of bad news: The tree and grass pollen count in D.C. today is “high.”  Tips: earlytips@washpost.com.  Was this forwarded to you?  Sign up here.  Thanks for waking up with us.",
    "url": "https://www.washingtonpost.com/politics/2024/04/24/chris-christie-unplugged/"
  },
  {
    "text": "Senate passes TikTok ban bill, sending it to President Biden's desk … A bill that would force China-based company ByteDance to sell TikTok — or else face a US ban of the platform — is all but certain to become law after the Senate passed a foreign aid package including the measure.",
    "url": "https://www.theverge.com/2024/4/23/24137638/senate-passes-tiktok-ban-bill-divest-bytedance-foreign-aid"
  },
  {
    "text": "Live updates Supreme Court hears arguments in case over emergency abortion care  —  The Supreme Court is currently hearing arguments Wednesday over whether the federal government has the power to penalize hospitals that fail to provide emergency abortions even in states with strict bans on the procedure.",
    "url": "https://www.washingtonpost.com/politics/2024/04/24/supreme-court-arguments-abortions-emergency-emtala/"
  },
  {
    "text": "How the House GOP's Biden impeachment effort fell apart  —  House Oversight Committee Chairman James Comer was eager to take the reins of a high-stakes investigation into President Joe Biden and his family, seen as central to the House Republican agenda - a coveted perch that brought the added benefit of elevating his national profile.",
    "url": "https://www.cnn.com/2024/04/24/politics/house-gop-biden-impeachment-effort"
  },
  {
    "text": "New Jersey Rep. Donald Payne Jr. dead at 65  —  Rep. Donald Payne Jr. (D-N.J.), who represented New Jersey in the House for more than a decade, has died at the age of 65.  —  New Jersey Gov. Phil Murphy (D) confirmed Payne's death in a statement on Wednesday.",
    "url": "https://thehill.com/homenews/house/4618099-donald-payne-jr-dead-new-jersey/"
  },
  {
    "text": "How to Know If the Supreme Court Is in the Tank for Trump  —  Trump's bid for immunity from prosecution in Washington is an absurd farce.  Will the court's conservatives bail him out?  —  This week at the Supreme Court, a simple question will sound difficult: Can a former president … ",
    "url": "https://www.politico.com/news/magazine/2024/04/24/trumps-crazy-argument-for-immunity-heads-to-the-high-court-00153954"
  },
  {
    "text": "George W. Bush was a terrible president  —  Looking back at the last — disastrous — era of efficacious conservative policymaking  —  If you're in the DC area, I'm hosting a book talk for Daniel Schlozman and Sam Rosenfeld about their new book “The Hollow Parties: The Many Pasts and Disordered Present of American Party Politics.”",
    "url": "https://www.slowboring.com/p/george-w-bush-was-a-terrible-president"
  },
  {
    "text": "The Man Who Killed Google Search  —  This is the story of how Google Search died, and the people responsible for killing it.  —  The story begins on February 5th 2019, when Ben Gomes, Google's head of search, had a problem. … For those unfamiliar with Google's internal scientology-esque jargon, let me explain.",
    "url": "https://www.wheresyoured.at/the-men-who-killed-google/"
  },
  {
    "text": "Trump's New Legal Bills Are Hiding an $8 Million Mystery  —  CONCEALED CARRY  —  Trump is using a GOP compliance firm as a go-between to pay lawyers, allowing him to hide who he's actually paying.  Experts have real questions whether he can do that.",
    "url": "https://www.thedailybeast.com/trumps-new-legal-bills-are-hiding-an-dollar8-million-mystery"
  },
  {
    "text": "Biden grants clemency to 16 people convicted of nonviolent drug offenses  —  President Biden on Wednesday granted clemency to 16 people who were convinced of nonviolent drug offenses, arguing the pardons and commutations reflect his commitment to address racial disparities.",
    "url": "https://thehill.com/homenews/administration/4617506-biden-grants-clemency-16-people-nonviolent-drug-offenses/"
  },
  {
    "text": "Exclusive: Trump brothers Eric and Don Jr. emerge as loyalty czars … - Don Jr.'s goal “is to keep the John Boltons of the world outside a second Trump administration,” a person close to him told Axios, referring to Donald Trump's hawkish former national security adviser who wrote a bestselling book lambasting the former president.",
    "url": "https://www.axios.com/2024/04/24/trump-brothers-loyalty-czars-transition-team"
  },
  {
    "text": "How Trump and the GOP are Using RFK Jr. to Pull a Big Scam  —  New polls this week served up a surprise: They showed Robert F. Kennedy's presidential run pulling more support from Donald Trump than from President Biden.  And even some Republicans are publicly insisting that they fear the same.",
    "url": "https://newrepublic.com/article/180912/dont-fooled-heres-know-rfk-jr-tacitly-boosting-trump"
  }
]