[
  {
    "text": "White House Warns Biden Would Veto House GOP Standalone Israel Funding Bill  —  House Speaker Mike Johnson's bill is a $14 billion Israel aid package that he says is.  more urgent need than others  —  The White House on Tuesday warned that President Joe Biden would veto a bill … ",
    "url": "https://themessenger.com/politics/white-house-warns-biden-would-veto-house-gop-standalone-israel-funding-bill"
  },
  {
    "text": "Major national outlets adopt House GOP spin to protect rich tax cheats  —  Several major national news outlets are promoting House Republicans' deceptive spin as the party seeks to leverage emergency funding for Israel to enact its top priority of protecting wealthy tax cheats.",
    "url": "https://www.mediamatters.org/joe-biden/major-national-outlets-adopt-house-gop-spin-protect-rich-tax-cheats"
  },
  {
    "text": "Johnson's Israel funding showdown with Biden, Democrats — and Senate Republicans  —  The House bill does not include Ukraine aid and slashes IRS funding.  —  Speaker of the House Mike Johnson (R-LA) gives a brief statement to reporters about the mass shooting in Lewiston … ",
    "url": "https://abcnews.go.com/Politics/johnsons-israel-funding-showdown-biden-democrats-senate-republicans/story?id=104517753"
  },
  {
    "text": "Israel strikes Gaza's Jabalya refugee camp  —  An Israeli strike targeting a Hamas commander in the densely populated Jabalya refugee camp in northern Gaza has left catastrophic damage and killed a large number of people, according to eyewitnesses and medics in the enclave.",
    "url": "https://www.cnn.com/2023/10/31/middleeast/jabalya-blast-gaza-intl/"
  },
  {
    "text": "Bolivia severs diplomatic ties with Israel, citing ‘crimes against humanity’  —  Bolivia's government said it had broken diplomatic ties with Israel on Tuesday, accusing Israel of committing crimes against humanity in its attacks on the Gaza Strip.  —  Bolivia “has decided to break diplomatic relations … ",
    "url": "https://www.reuters.com/world/americas/bolivia-severs-diplomatic-ties-with-israel-citing-crimes-against-humanity-2023-10-31/"
  },
  {
    "text": "Colleges braced for antisemitism and violence.  It's happening.  —  ‘I had Jewish blood on my hands,’ a Tulane student said after aiding a classmate who was assaulted at a pro-Palestinian rally  —  Recent days have witnessed what Jewish students and watchdog groups describe as a raft of antisemitic incidents on college campuses.",
    "url": "https://www.washingtonpost.com/education/2023/10/31/antisemitism-college-campuses-jewish-hamas-gaza/"
  },
  {
    "text": "New House speaker once partnered with so-called ‘ex-gay’ conversion group  —  Speaker of the House Mike Johnson closely collaborated with a group in the mid-to-late 2000s that promoted “conversion therapy,” a discredited practice that asserted it could change the sexual orientation of gay and lesbian individuals.",
    "url": "https://www.cnn.com/2023/11/01/politics/mike-johnson-kfile-invs/"
  },
  {
    "text": "RFK Jr.'s 2024 bid is a threat to Republicans — and donor data shows it  —  A POLITICO analysis of his donor base reveals a lot about who is powering this unconventional candidate.  —  Robert F. Kennedy Jr. is collecting checks from past Donald Trump donors at a much higher rate … ",
    "url": "https://www.politico.com/news/2023/11/01/rfk-jr-2024-campaign-donors-00124621"
  },
  {
    "text": "Trump visits secure facility to view evidence in classified documents case: Sources  —  It's Trump's first known review of classified evidence shared by Jack Smith.  —  This image contained in a court filing by the Department of Justice on Aug. 30, 2022, and partially redacted by the source … ",
    "url": "https://abcnews.go.com/US/trump-scheduled-visit-secure-facility-view-evidence-classified/story?id=104515489"
  },
  {
    "text": "The Virginia voter purge  —  Election officials working under Virginia Governor Glenn Youngkin (R) have admitted to removing “nearly 3,400 qualified voters from the state's rolls.”  The Youngkin administration originally discovered the mistake at the beginning of October but grossly underestimated the number of voters affected.",
    "url": "https://popular.info/p/the-virginia-voter-purge"
  },
  {
    "text": "Home schooling's rise from fringe to fastest-growing form of education  —  A district-by-district look at home schooling's explosive growth, which a Post analysis finds has far outpaced the rate at private and public schools  —  Home schooling has become — by a wide margin … ",
    "url": "https://www.washingtonpost.com/education/interactive/2023/homeschooling-growth-data-by-district/"
  },
  {
    "text": "Does New Speaker of the House Mike Johnson Have a Bank Account?  —  Speaker Mike Johnson has never listed a bank account on his financial disclosure.  In fact, on his newest disclosure he doesn't list a single asset at all. … Newly elected Speaker of the House Mike Johnson (R-LA) does not have a bank account.",
    "url": "https://www.thedailybeast.com/does-new-speaker-of-the-house-mike-johnson-have-a-bank-account"
  },
  {
    "text": "Trump's Allies Want a New Style of Lawyer if He Returns to Power  —  Politically appointed lawyers sometimes frustrated Donald J. Trump's ambitions.  His allies are planning to install more aggressive legal gatekeepers if he regains the White House.  —  Close allies of Donald J. Trump … ",
    "url": "https://www.nytimes.com/2023/11/01/us/politics/trump-2025-lawyers.html"
  },
  {
    "text": "Home Sellers Win $1.8 Billion as Jury Finds Realtors Inflated Commissions  —  Future homebuyers could be paying smaller commissions following the decision by a federal jury in Missouri  —  In a verdict that's roiling the real estate world, an eight-person jury in a federal Missouri court found … ",
    "url": "https://themessenger.com/business/realtors-found-liable-for-1-8-billion-for-keeping-commissions-artificially-high"
  },
  {
    "text": "Muslim Democrats give Biden ultimatum: Israel ceasefire by 5 or battleground states turn ‘red’  —  The National Muslim Democratic Council, a nationwide group of Democratic leaders and activists, threatened President Joe Biden that if he does not force Israel to reach a ceasefire with Hamas … ",
    "url": "https://justthenews.com/politics-policy/elections/muslim-democrats-give-biden-ultimatum-israel-ceasefire-5-or-battleground"
  },
  {
    "text": "Tim Scott secures spot in third GOP debate following campaign strategy overhaul  —  Sen. Tim Scott of South Carolina has secured his spot in the third GOP presidential debate in Miami next week, announcing that he has met the final requirement — gathering enough individual donations needed … ",
    "url": "https://www.cbsnews.com/news/sen-tim-scott-secures-spot-third-gop-presidential-debate-miami-campaign-strategy-overhaul/"
  },
  {
    "text": "Romney steps in as Halloween dog parade emcee  —  Sen. Mitt Romney (R-Utah) stepped in as the emcee for the annual bipartisan Halloween dog parade after host Sen. Thom Tillis (R-N.C.) said Tuesday that he tested positive for COVID-19.  —  “Glad to host some furry friends in the Senate today … ",
    "url": "https://thehill.com/homenews/4286316-romney-steps-in-as-halloween-dog-parade-emcee/"
  },
  {
    "text": "‘Wake Up, It Is a Time to Be Concerned’: FBI Director Wray Issues Stark Warning at Committee Hearing  —  In a Senate Homeland Security Committee hearing on Tuesday, FBI Director Christopher Wray provided some worrying — if not outright alarming — answers to questions from U.S. Senator Rick Scott … ",
    "url": "https://townhall.com/tipsheet/spencerbrown/2023/10/31/fbi-director-wray-it-is-a-time-to-be-concerned-about-terrorism-in-the-us-n2630588"
  },
  {
    "text": "Idaho's first ‘abortion trafficking’ arrest  —  Police used geo-location data to place teen at Oregon clinic  —  Last week, an Idaho teenager and his mother were arrested for bringing the teen's girlfriend out-of-state for an abortion.  The pair were charged with multiple felonies … ",
    "url": "https://jessica.substack.com/p/idahos-first-abortion-trafficking"
  }
]