[
  {
    "text": "Exclusive: All 50 Democratic party US state chairs back Harris -sources  —  All 50 Democratic party state chairs have thrown their weight behind Vice President Kamala Harris to be the party's new presidential nominee, according to sources familiar with the matter.",
    "url": "https://www.reuters.com/world/us/all-50-democratic-party-us-state-chairs-back-harris-sources-2024-07-21/"
  },
  {
    "text": "My Statement on President Biden's Announcement  —  Joe Biden has been one of America's most consequential presidents, as well as a dear friend and partner to me.  Today, we've also been reminded — again — that he's a patriot of the highest order.  —  Sixteen years ago … ",
    "url": "https://t.co/Bs2ZumFXxe"
  },
  {
    "text": "Nikki Haley Voters PAC Announces Support for Kamala Harris  —  voters pledged their support for Democratic Vice President  —  ' presidential bid on Sunday, hours after President  —  announced that he was dropping out of the race.  —  Biden announced on Sunday afternoon in a letter … ",
    "url": "https://www.newsweek.com/nikki-haley-voters-pac-announces-support-kamala-harris-1928198"
  },
  {
    "text": "Biden's exit leads to the biggest day for Democratic donations online in years — $30 million and counting.  —  Democrats greeted President Biden's departure from the presidential race with an avalanche of cash, donating more than $30 million online on Sunday and making it the single biggest … ",
    "url": "https://www.nytimes.com/2024/07/21/us/politics/bidens-exit-leads-to-the-biggest-day-for-democratic-donations-online-in-years.html"
  },
  {
    "text": "Why Biden finally quit  —  The Saturday night decision that ended Biden's reelection campaign.  —  For 23 days, President Joe Biden insisted on pushing forward with his reelection bid in the face of calls from Democratic lawmakers and donors for him to step aside.  —  And then, almost on a dime, things changed.",
    "url": "https://www.politico.com/news/2024/07/21/why-biden-dropped-out-00170106"
  },
  {
    "text": "Manchin weighs options after Biden exits presidential race  —  Sen. Joe Manchin (W.Va.) is considering re-registering as a Democrat in order to compete for Democratic presidential nomination.  —  Sen. Joe Manchin III (I-W. Va.) is considering re-registering as a Democrat to compete … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/21/manchin-weighs-options-after-biden-exits-presidential-race/"
  },
  {
    "text": "The Week Ahead  —  President Biden: “I believe it is in the interest of my party and the country to stand down and to focus solely on fulfilling my duties as president.”  He followed up minutes later endorsing Kamala Harris.  He is a splendid man, a splendid human being … ",
    "url": "https://joycevance.substack.com/p/the-week-ahead-fc5"
  },
  {
    "text": "EXCLUSIVE: New AJC poll finds Trump leads Harris in Georgia matchup  —  In survey conducted July 9-18, Republican led vice president by 5 percentage points  —  Former President Donald Trump holds a slight lead over Vice President Kamala Harris in Georgia in an Atlanta Journal-Constitution … ",
    "url": "https://www.ajc.com/politics/exclusive-new-ajc-poll-finds-trump-leads-harris-in-georgia-head-to-head-matchup/XCR4MTGSJJHOFHLPUUZLYLCFPE/"
  },
  {
    "text": "With Biden stepping aside, Democrats must now embrace an open process  —  Vice President Harris may be the most likely replacement, but a contested convention is good for everyone.  —  By the Editorial Board  —  President Biden took one of the most consequential steps imaginable: He ended his bid for a second term.",
    "url": "https://www.washingtonpost.com/opinions/2024/07/21/biden-drop-out-dnc-convention-harris/"
  },
  {
    "text": "Gretchen Whitmer joins campaign call with Harris for President staff  —  Michigan Gov. Gretchen Whitmer joined a call of Harris for President staff on Sunday, throwing her support to the vice president in a crucial battleground state and adding to the flood of endorsements.",
    "url": "https://www.politico.com/live-updates/2024/07/21/joe-biden-drops-out-election/gretchen-whitmer-joins-harris-campaign-call-00170209"
  },
  {
    "text": "Obama endorses open nominating process while Clintons endorse Harris  —  Former President Barack Obama endorsed an open Democratic primary process at the convention next month — less than an hour after former President Bill Clinton endorsed Vice President Kamala Harris for president.",
    "url": "https://www.politico.com/live-updates/2024/07/21/joe-biden-drops-out-election/biden-obama-clinton-harris-00170063"
  },
  {
    "text": "Kamala Harris Must Be the Candidate.  This Is How She Beats Trump  —  WINNING TICKET  —  Beginning right now, the Democratic Party must unite behind Harris.  The debates of the past few weeks following the presidential debate, and all recriminations, must be set aside.",
    "url": "https://www.thedailybeast.com/kamala-harris-must-be-the-candidate-this-is-how-she-beats-trump"
  },
  {
    "text": "This Is Exactly What the Trump Team Feared  —  A campaign that had been optimized to beat Joe Biden now must be reinvented.  —  On the evening of Super Tuesday, March 5, shortly before Donald Trump effectively ended the Republican primary and earned a general-election rematch with President Joe Biden … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/07/trump-campaign-biden-dropping-out/679183/"
  },
  {
    "text": "With honor and decency, Joe Biden exits the race  —  In the end, President Joe Biden did the right thing for the country.Age caught up to him.  Democrats turned on him.  And the media piled on, helping to drive Biden from the 2024 presidential race, while largely ignoring the danger … ",
    "url": "https://www.inquirer.com/opinion/editorials/biden-leaves-presidential-race-20240721.html"
  },
  {
    "text": "Biden's Greatest Strengths Proved His Undoing  —  For the past few weeks, Joe Biden has cut a deeply unattractive figure.  Unable to escape a lifetime of resentments and mired in self-pity, he has stubbornly bucked his party's elite.  It has been exceedingly difficult to view Biden as anything … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/07/bidens-greatest-strengths-proved-his-undoing/679179/"
  },
  {
    "text": "Biden Made a Courageous Choice.  Democrats Must Seize the Opportunity.  —  President Biden's decision to exit the 2024 presidential election is a fitting coda for a man whose life has been devoted to public service.  Mr. Biden has served the nation well as its president.",
    "url": "https://www.nytimes.com/2024/07/21/opinion/editorials/joe-biden-drops-out-courage.html?unlocked_article_code=1.9E0.HLLk.rhyrmu2oiQV9&smid=url-share"
  }
]