[
  {
    "text": "‘Of course he lost’: Ron DeSantis rejects Trump's 2020 election claims  —  Florida Gov. Ron DeSantis on Sunday rejected Donald Trump's claim that he was the true winner of the 2020 presidential election in his most forceful comments to date on the matter.  —  “Whoever puts their hand … ",
    "url": "https://www.nbcnews.com/politics/2024-election/ron-desantis-of-course-trump-lost-2020-election-rcna98200"
  },
  {
    "text": "‘Fake’ elector plot raised concerns over legal peril, indictment shows  —  A contingency plan, a crime or a ‘donkey show’?  Doubts across seven states and within the Trump campaign  —  Six weeks after the 2020 election, senior campaign officials for Donald Trump called a group … ",
    "url": "https://www.washingtonpost.com/national-security/2023/08/07/fake-electors-trump-indictment/"
  },
  {
    "text": "There's a Good Reason Trump Aides Don't Think the New Indictment Is a Joke  —  A number of Donald Trump's current aides are involved in the latest case against their boss.  That could put them in some very difficult positions. … Donald Trump has publicly joked about the four latest felony charges brought against him.",
    "url": "https://www.thedailybeast.com/theres-a-good-reason-trump-aides-dont-think-the-new-indictment-is-a-joke"
  },
  {
    "text": "The Pelosi Factor … If you were going to draw up a list of the people most responsible for the latest indictment of Donald Trump, the former president himself would be at the top, followed by the prosecutors who have brought the case.  Republicans in Congress perversely deserve a great deal of credit … ",
    "url": "https://nymag.com/intelligencer/2023/08/how-nancy-pelosi-long-game-led-to-trumps-indictment.html"
  },
  {
    "text": "Will Trump's Social Media Behavior Cost Him in Court?  —  “If you go after me, I'm coming after you.”  That's what Donald Trump posted Friday afternoon on Truth Social.  —  Uh-oh.  Experts immediately suggested that a few more posts like that could land a fellow in contempt of court for defiance of an order.",
    "url": "https://plus.thebulwark.com/p/will-trump-social-media-behavior-cost-him-court"
  },
  {
    "text": "Fulton County insiders expect former President Donald Trump to be indicted this week in Georgia  —  It would be a state indictment and could be the most significant out of all the indictments since someone can only be pardoned on federal charges.  —  ATLANTA — Many people in Fulton County … ",
    "url": "https://www.11alive.com/article/news/special-reports/ga-trump-investigation/fulton-county-insiders-expect-former-president-donald-trump-indicted-this-week-georgia/85-10b10a28-e537-49a5-a17e-042d86dd4777"
  },
  {
    "text": "Trump and his new lawyer are not on the same page about judge's recusal  —  The former president's public statements are already diverging from the advice of his newest lawyer, John Lauro.  —  Donald Trump blared Sunday morning that his legal team would be “immediately asking for recusal” … ",
    "url": "https://www.politico.com/news/2023/08/07/trump-lawyer-judge-recusal-00110103"
  },
  {
    "text": "Most disapprove of Biden's handling of climate change, Post-UMD poll finds  —  Less than 3 in 10 Americans say they know a good or great deal about the Inflation Reduction Act, though many voters in both parties support some of its key climate programs  —  Nearly one year after President Biden enacted … ",
    "url": "https://www.washingtonpost.com/climate-environment/2023/08/07/biden-white-house-climate-policy/"
  },
  {
    "text": "The Weaponization of Loneliness  —  To defend America against those who would exploit our social disconnection, we need to rebuild our communities.  —  The question that preoccupied me and many others over much of the past eight years is how our democracy became so susceptible to a would-be strongman and demagogue.",
    "url": "https://www.theatlantic.com/ideas/archive/2023/08/hillary-clinton-essay-loneliness-epidemic/674921/"
  },
  {
    "text": "Nursing pillows are associated with more than 160 infant deaths, NBC News investigation finds  —  Federal officials are poised to propose the first safety requirements for nursing pillows.  An industry-supported group is fighting back, arguing that government regulation of the widely used product could discourage breastfeeding.",
    "url": "https://www.nbcnews.com/news/us-news/nursing-pillow-baby-deaths-breastfeeding-infant-investigation-rcna97725"
  },
  {
    "text": "Trump counterclaim against E. Jean Carroll dismissed, DA can get deposition  — A federal judge dismissed a counterclaim by Donald Trump against the writer E. Jean Carroll in her pending lawsuit that accuses him of defaming her after she wrote that he had raped her.",
    "url": "https://www.cnbc.com/2023/08/07/judge-trump-deposition-in-e-jean-carroll-case-can-go-to-prosecutors.html"
  },
  {
    "text": "Some conservatives have surprising ‘Barbie’ take despite criticisms of liberal agenda  —  ‘Barbie’ surpassed $1 billion in global box office sales, despite ‘woke’ claims  —  Some conservatives are standing by the film “Barbie,” despite criticisms and reviews that blasted the blockbuster film for an allegedly liberal agenda.",
    "url": "https://www.foxnews.com/politics/some-conservatives-surprising-barbie-take-despite-criticisms-liberal-agenda"
  },
  {
    "text": "The Republican Party's Split on Economics  —  Why an argument over economic policy is roiling the party.  —  The Wall Street Journal's editorial board has spent the last few months trying to boost Gov. Ron DeSantis's presidential campaign.  It has called his legislative record … ",
    "url": "https://www.nytimes.com/2023/08/07/briefing/desantis-republican-economics.html"
  },
  {
    "text": "Exclusive: North Korean hackers breached top Russian missile maker  —  An elite group of North Korean hackers secretly breached computer networks at a major Russian missile developer for at least five months last year, according to technical evidence reviewed by Reuters and analysis by security researchers.",
    "url": "https://www.reuters.com/technology/north-korean-hackers-breached-top-russian-missile-maker-2023-08-07/"
  }
]