[
  {
    "text": "Federal court blocks Trump from imposing sweeping tariffs under emergency powers law  —  A federal court on Wednesday blocked President Donald Trump from imposing sweeping tariffs on imports under an emergency-powers law, swiftly throwing into doubt Trump's signature set of economic policies … ",
    "url": "https://apnews.com/article/trump-tariffs-trade-court-0392dbd59f548e49ad4f64254ae3f94a"
  },
  {
    "text": "Court says Trump doesn't have the authority to set tariffs  —  A federal court on Wednesday ruled President Trump does not have the authority under economic emergency legislation to impose sweeping global tariffs.  —  Why it matters: The U.S. Court of International Trade's ruling could bring … ",
    "url": "https://www.axios.com/2025/05/28/trump-tariffs-trade-court-ruling"
  },
  {
    "text": "US court blocks most Trump tariffs, says president exceeded his authority  —  A U.S. trade court blocked most of President Donald Trump's tariffs in a sweeping ruling on Wednesday that found the president overstepped his authority by imposing across-the-board duties on imports from U.S. trading partners.",
    "url": "https://www.reuters.com/world/us/us-court-blocks-trumps-liberation-day-tariffs-2025-05-28/"
  },
  {
    "text": "We Won Our Tariff Case!  —  The US Court of International Trade just issued a unanimous ruling in the case against Trump's “liberation day” tariffs filed by Liberty Justice Center and myself on behalf of five US businesses harmed by the tariffs.  The ruling also covers the case filed … ",
    "url": "https://reason.com/volokh/2025/05/28/we-won-our-tariff-case/"
  },
  {
    "text": "U.S. Will ‘Aggressively’ Revoke Visas of Chinese Students, Rubio Says  —  Secretary of State Marco Rubio said the students who will have their visas canceled include people with ties to the Chinese Communist Party and those studying in “critical fields.”  —  Secretary of State Marco Rubio announced … ",
    "url": "https://www.nytimes.com/2025/05/28/us/politics/china-student-visas-revoke.html"
  },
  {
    "text": "China thought it had a truce with the US.  Then Trump dropped two bombshells  —  A one-two punch from the United States risks shattering the already fragile trade war truce between Washington and Beijing, with Chinese tech companies and students both dealt shock blows by the Trump administration Wednesday night.",
    "url": "https://cnn.com/2025/05/29/china/china-us-truce-chips-student-visa-intl-hnk"
  },
  {
    "text": "Chinese Students Are Frustrated With U.S. Visa Bans: ‘What Now?’  —  As applicants in Beijing wait to see how sweeping the new action might be, one says the United States is making people too scared.  —  In the hours after the Trump administration announced that it would begin “aggressively” … ",
    "url": "https://www.nytimes.com/2025/05/29/world/asia/china-student-visas.html"
  },
  {
    "text": "A Disillusioned Musk, Distanced From Trump, Says He's Exiting Washington  —  The billionaire has made clear he is frustrated with the obstacles he encountered as he tried to upend the federal bureaucracy.  —  Elon Musk during a cabinet meeting at the White House last month.Eric Lee/The New York Times",
    "url": "https://www.nytimes.com/2025/05/28/us/politics/elon-musk-trump-doge.html?unlocked_article_code=1.K08.4XYc.ogBOdRQcbKSB&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Elon Musk is leaving the Trump administration after leading effort to slash federal government  —  Elon Musk is leaving his government role as a top adviser to President Donald Trump after spearheading efforts to reduce and overhaul the federal bureaucracy.  His departure, announced Wednesday evening … ",
    "url": "https://apnews.com/article/elon-musk-donald-trump-big-beautiful-bill-aa2bc70b0ebdb219b5dd3e9f8fae03af"
  },
  {
    "text": "The MAHA Report Cites Studies That Don't Exist  —  The Trump administration's “Make America Healthy Again” report misinterprets some studies and cites others that don't exist, according to the listed authors.  — Copy  —  Health Secretary Robert F. Kennedy Jr. says his “Make America Healthy Again” … ",
    "url": "https://www.notus.org/health-science/make-america-healthy-again-report-citation-errors"
  },
  {
    "text": "STAT+: HHS cancels nearly $600 million Moderna contract on vaccines for flu pandemics  —  The Department of Health and Human Services has notified Moderna that it is canceling a nearly $600 million contract with the company to develop, test, and license vaccines for flu subtypes … ",
    "url": "https://www.statnews.com/2025/05/28/moderna-flu-vaccine-development-cancelled-by-hhs-mrna-platform-offers-speedy-pandemic-response/"
  },
  {
    "text": "HHS cancels Moderna's $590M bird flu vaccine award  —  The Trump administration canceled a nearly $600 million award to Moderna to develop an mRNA vaccine for bird flu in humans, the company announced Wednesday.  —  Why it matters: It ends one of the remaining Biden-era efforts aimed at creating vaccines for pandemic preparedness.",
    "url": "https://www.axios.com/2025/05/29/hhs-cancel-moderna-bird-flu-vaccine"
  },
  {
    "text": "Trump finds more convicted congressional Republicans to reward with pardons  —  Thanks to the president's latest flurry of pardons, he's now pardoned most of the Republican congressmen convicted of felonies in the 21st century.  —  It's been a challenge keeping up with the flurry … ",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trump-finds-convicted-congressional-republicans-reward-pardons-rcna209668"
  },
  {
    "text": "The US Is Storing Migrant Children's DNA in a Criminal Database  —  Customs and Border Protection has swabbed the DNA of migrant children as young as 4, whose genetic data is uploaded to an FBI-run database that can track them if they commit crimes in the future.",
    "url": "https://www.wired.com/story/cbp-dna-migrant-children-fbi-codis/"
  },
  {
    "text": "Paramount Has Offered $15 Million to Settle CBS Lawsuit.  Trump Wants More.  —  President's team threatened another lawsuit amid settlement talks  —  A month into negotiations between Paramount Global and President Trump to settle his lawsuit against CBS News, the parties remain far apart on terms.",
    "url": "https://www.wsj.com/business/media/paramount-has-offered-15-million-to-settle-cbs-lawsuit-trump-wants-more-861d857e?st=bKShvL"
  },
  {
    "text": "Trump's Air Force One deal with Qatar not final, despite U.S. claims  —  The delay reflects lingering concerns about legal liabilities stemming from a White House maneuver to transform what was originally a sale between two countries into a “gift.”  —  Despite claims by the Defense Department … ",
    "url": "https://www.washingtonpost.com/national-security/2025/05/28/trump-qatar-air-force-one/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ4NDA0ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ5Nzg3MTk5LCJpYXQiOjE3NDg0MDQ4MDAsImp0aSI6IjVmMjRmMGI5LTE0NmMtNDE1ZS1hMTk0LTIzMjI4ZWNiZGM0YSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb25hbC1zZWN1cml0eS8yMDI1LzA1LzI4L3RydW1wLXFhdGFyLWFpci1mb3JjZS1vbmUvIn0.2ScbHuUvHq5qT8kJUbEAHGarzUW6fWeXGPBG2NsRGMY&itid=gfta"
  },
  {
    "text": "Harrison Ruffin Tyler, grandson of 10th U.S. president and longtime Richmonder, dies at 96  —  Since 2020, Harrison Ruffin Tyler was the last living link to a vanished America.  —  The Richmond resident, preservationist and chemical engineer, a man who founded water treatment company ChemTreat … ",
    "url": "https://www.richmonder.org/harrison-ruffin-tyler-grandson-of-10th-u-s-president-and-longtime-richmonder-dies-at-96/"
  },
  {
    "text": "The Totalitarian Logic of Immigration Controls  —  There were many terrible moments in Donald Trump's nakedly fascist 2024 campaign, but I will personally never forget taking the time, in May, to read Radley Balko's extensive discussion of how mass deportation might work in practice.",
    "url": "https://www.liberalcurrents.com/the-totalitarian-logic-of-immigration-controls/"
  },
  {
    "text": "A Missouri Town Was Solidly Behind Trump.  Then Carol Was Detained.  —  For 20 years, Carol Hui has served waffles, raised her children and embraced the small town of Kennett, Mo. Her detention and pending deportation to Hong Kong has hit the community hard.",
    "url": "https://www.nytimes.com/2025/05/28/us/missouri-immigrant-trump.html?unlocked_article_code=1.Kk8.6Vrx.t0p5DTeSQtbp&smid=url-share"
  },
  {
    "text": "Supreme Court limits environmental review of major infrastructure projects  —  The Supreme Court on Thursday limited the scope of environmental reviews of major infrastructure projects in a decision that could speed up approvals of highways, airports and pipelines.",
    "url": "https://cnn.com/2025/05/29/politics/supreme-court-nepa"
  },
  {
    "text": "National Association of the Deaf Sues White House for Access to Press Briefings  —  Washington D.C., May 28, 2025 — The National Association of the Deaf (NAD) filed a lawsuit today to compel the White House to immediately resume providing American Sign Language (ASL) interpreters during broadcasts … ",
    "url": "https://www.nad.org/2025/05/28/national-association-of-the-deaf-sues-white-house-for-access-to-press-briefings/"
  },
  {
    "text": "The Punch That Launched Trump's War on American Universities  —  Threats to withhold billions in federal research funds to punish campuses grew heated after a 2019 altercation left a man with a black eye",
    "url": "https://www.wsj.com/us-news/education/trump-college-university-federal-funding-fight-91c2a274?st=UDKi7K&reflink=article_copyURL_share"
  },
  {
    "text": "Trump violating right to life with anti-environment orders, youth lawsuit says  —  Twenty-two plaintiffs between ages seven and 25 allege government is engaging in unlawful executive overreach  —  Democracy and justice is supported by  —  Twenty two young Americans have filed a new lawsuit … ",
    "url": "https://www.theguardian.com/us-news/2025/may/29/trump-administration-sued-anti-environment-orders"
  },
  {
    "text": "US economy shrank at 0.2% rate in first quarter  —  Revised GDP figures confirm first contraction since 2022  —  Roula Khalaf, Editor of the FT, selects her favourite stories in this weekly newsletter.  —  The US economy shrank by an annualised 0.2 per cent during the first quarter of 2025 … ",
    "url": "https://www.ft.com/content/6624600c-0fe0-4e03-b728-b341a23ef797"
  }
]