[
  {
    "text": "CBS News poll finds Trump's big lead grows, as GOP voters dismiss indictments  —  Well, there's no debate about this: Right now, the Republican Party would easily re-nominate Donald Trump for 2024.  And it's not close.  —  The former president now holds his largest lead over his rivals in our polling amid his recent legal troubles.",
    "url": "https://www.cbsnews.com/news/trump-poll-indictments-2023-08-20/"
  },
  {
    "text": "How G.O.P. Views of Biden Are Helping Trump in the Republican Primary  —  In interviews and polling, many Republican voters believe President Biden is so weak that picking the most electable candidate to beat him no longer matters.  —  Gov. Ron DeSantis of Florida has run into a surprising buzz saw … ",
    "url": "https://www.nytimes.com/2023/08/20/us/politics/biden-trump-republican-primary.html"
  },
  {
    "text": "With one day to spare, Asa Hutchinson says he'll make the GOP's first primary debate  —  WASHINGTON — Former Arkansas Gov. Asa Hutchinson says he has met the donor threshold to participate in the first GOP primary debate after a swell of contributions that followed GOP frontrunner Donald Trump's indictments … ",
    "url": "https://www.usatoday.com/story/news/politics/2023/08/20/asa-hutchinson-hits-donor-threshold-says-hell-make-gop-debate-stage/70633317007/"
  },
  {
    "text": "Inside the Collapse of Hunter Biden's Plea Deal  —  An examination of confidential correspondence and interviews with those close to Mr. Biden and lawyers involved in the case show how the deal ultimately fell apart amid schisms and withering external pressures.",
    "url": "https://www.nytimes.com/2023/08/19/us/politics/inside-hunter-biden-plea-deal.html"
  },
  {
    "text": "In talks with prosecutors, Hunter Biden's lawyers vowed to put the president on the stand  —  A behind-the-scenes look at how a plea deal for the president's son nearly came together before it fell apart.  —  It was Halloween of 2022, and Hunter Biden's lawyer, Chris Clark, didn't sound happy.",
    "url": "https://www.politico.com/news/2023/08/19/hunter-biden-plea-deal-collapse-00111974"
  },
  {
    "text": "Meadows told special counsel he could not recall Trump ever declassifying Mar-a-Lago docs: Sources  —  Trump has insisted that he declassified all the materials before he left office.  —  Appearing to contradict former President Donald Trump's primary public defense in the classified documents case … ",
    "url": "https://abcnews.go.com/US/meadows-told-special-counsel-recall-trump-declassifying-mar/story?id=102396159"
  },
  {
    "text": "‘I could sell golf’: How DeSantis and aides courted lobbyists for campaign cash  —  The efforts to effectively auction off leisure time to those seeking to influence state policy created a special pathway of access for big donors that is striking in the way that it was documented in writing, ethics experts said",
    "url": "https://www.washingtonpost.com/politics/2023/08/20/ron-desantis-donors-lobbyists-florida/"
  },
  {
    "text": "Jimmy and Rosalynn Carter's Grandson Offers Update on Their Health: 'We're in the Final Chapter' (Exclusive)  —  Josh Carter tells PEOPLE that while it's “different” visiting his grandparents' home now that they've grown a bit quieter, “they are still here, they are still holding hands and still very much together”",
    "url": "https://people.com/jimmy-rosalynn-carter-health-update-exclusive-7692868"
  },
  {
    "text": "Bucks County power struggle could hint at shifting suburban politics for 2024  —  “As Bucks County goes, Pennsylvania will go.”  —  DOYLESTOWN, Pa. — An obscure race for county commissioner underway here in a suburb outside of Philadelphia could tell us a lot about who will win the presidential election in 2024.",
    "url": "https://www.politico.com/news/2023/08/20/bucks-county-pennsylvania-2024-00111933"
  },
  {
    "text": "Factbox: Russia's Luna-25 moon mission fails: what you need to know  —  Russia's first moonshot in nearly half a century has failed after its Luna-25 spacecraft spun out of control and smashed into the moon.  —  Following are details about the mission and what its failure is likely to mean.",
    "url": "https://www.reuters.com/technology/space/russias-luna-25-moon-mission-fails-what-you-need-know-2023-08-20/"
  },
  {
    "text": "WATCH: DeSantis Plans to Do What Trump Couldn't |  Full Interview With Will Witt  —  Ron DeSantis told Will Witt in an exclusive interview that those making RINO claims about him are kissing Trump's rear end.  Meanwhile, the swamp still needs to be drained.",
    "url": "https://www.theflstandard.com/watch-desantis-plans-to-do-what-trump-couldnt-full-interview-with-will-witt/"
  },
  {
    "text": "First on CNN: Biden wades into GOP primary with $25 million ad blitz, starting with economy focus  —  President Joe Biden is preparing to blanket the airwaves with a $25 million television and digital ad campaign in battleground states this month as Republicans are set to face off in their first presidential primary debate.",
    "url": "https://www.cnn.com/2023/08/20/politics/joe-biden-2024-republican-primary/"
  },
  {
    "text": "Minnesota Democrat pans ‘weird group of folks’ on GOP debate stage  —  Minnesota Gov. Tim Walz (D) on Sunday called the GOP presidential candidates heading to the debate stage a “weird group of folks.”  —  When asked by NBC's “Meet The Press” moderator Chuck Todd about his working relationship … ",
    "url": "https://thehill.com/homenews/4160943-minnesota-democrat-pans-weird-group-of-folks-on-gop-debate-stage/"
  },
  {
    "text": "Hilary will produce ‘really significant impacts’ in California, FEMA administrator warns  —  “People really need to take this storm in California serious,” Deanne Criswell said.  —  As the federal government prepares its response to the tropical storm expected to hit parts of Southern California … ",
    "url": "https://www.politico.com/news/2023/08/20/hurricane-hilary-california-criswell-fema-administrator-warns-00111995"
  },
  {
    "text": "MAGA world lashes out over DeSantis' ‘listless vessels’ remark  —  Trump campaign and supporters push comparisons to Hillary Clinton's ‘deplorables’ remark.  —  The Trump campaign and MAGA world on Saturday blasted Florida Gov. Ron DeSantis for remarks appearing to label some of the former president's supporters “listless vessels.”",
    "url": "https://www.politico.com/news/2023/08/19/desantis-trump-listless-vessels-00111971"
  }
]