[
  {
    "text": "Trump admin eyes arrests for House Dems over ICE incident  —  Democratic members of Congress who were part of a scuffle with law enforcement officers at an ICE facility in New Jersey may face arrests, the Department of Homeland Security confirmed to Axios Saturday.",
    "url": "https://www.axios.com/2025/05/10/trump-ice-arrest-house-democrats-new-jersey"
  },
  {
    "text": "Stephen Miller Threatens to Suspend Habeas Corpus because He Got Caught Lying  —  You should know that the question to Stephen Miller about habeas corpus was a set up.  —  The male “journalist” who asked it after Miller called on him for the first question at a staged press event posed it in terms of … ",
    "url": "https://www.emptywheel.net/2025/05/10/stephen-miller-threatens-to-suspend-habeas-corpus-because-he-got-caught-lying/"
  },
  {
    "text": "Trump Calls for 20,000 Extra Officers to Help With Deportation Efforts  —  The order, which would use state and local officers, among others, would represent an enormous expansion of immigration enforcement.  But it is unclear how it would be paid for.  —  President Trump ordered the Department … ",
    "url": "https://www.nytimes.com/2025/05/10/us/politics/dhs-deportation-extra-officers.html"
  },
  {
    "text": "Live Updates: Trump Announces Truce Between India and Pakistan  —  Officials in both countries acknowledged a halt after several days of their most expansive fighting in decades.  —  Here's the latest.  —  President Trump announced Saturday that India and Pakistan had agreed to a cease-fire … ",
    "url": "https://www.nytimes.com/live/2025/05/10/world/pakistan-india-kashmir"
  },
  {
    "text": "A New Kind of Battle for Two Old Enemies  —  Pakistan accused India of launching air-to-surface missiles that targeted at least three bases.  Soon after, Pakistani officials said retaliatory action against Indian bases had begun.  —  The military conflict between India and Pakistan hit … ",
    "url": "https://www.nytimes.com/2025/05/09/world/asia/india-pakistan-kashmir-drones.html"
  },
  {
    "text": "Trump envoy relied on Kremlin interpreter in meetings with Putin to end war in Ukraine  —  Using the Kremlin's interpreter was “a very bad idea” that put Witkoff “at a real disadvantage,” Michael McFaul, a former U.S. ambassador to Russia, told NBC News.  —  MOSCOW — President Donald Trump's … ",
    "url": "https://www.nbcnews.com/world/russia/russia-ukraine-war-trump-envoy-witkoff-interpreter-kremlin-rcna205878"
  },
  {
    "text": "Trump Promised to End Two Wars Quickly.  In Private, He Admits He's Frustrated.  —  The president has told donors resolving the conflicts has been more difficult than he thought  —  When President Trump spoke to a room of top donors at his Florida club last week, he described ending Russia's war … ",
    "url": "https://www.wsj.com/politics/trump-israel-gaza-russia-ukraine-war-f847b04a?st=iUVvCX"
  },
  {
    "text": "Trump Is Already Obsessed With the Midterms  —  Eighteen months out, the president is already hyper-engaged in the fight to keep the GOP's majorities in Congress.  —  Early in Donald Trump's first term, the president received what he now views as bad advice: Don't worry about the midterms, some advisers whispered back then.",
    "url": "https://www.politico.com/news/magazine/2025/05/10/donald-trump-midterms-2026-last-campaign-00339567"
  },
  {
    "text": "ICE raids have ‘overwhelmed’ coastal California communities ‘We continue to allow double punishment for noncitizens’  —  After a lull in U.S. Immigration and Customs Enforcement activity on California's Central Coast, a rash of raids has reportedly swept through San Luis Obispo, Santa Barbara and Ventura counties over the past week.",
    "url": "https://www.sfgate.com/centralcoast/article/ice-raids-overwhelm-california-communities-20319412.php"
  },
  {
    "text": "Zero ships from China are bound for California's top ports.  Officials haven't seen that since the pandemic  —  On Friday morning, West Coast port officials told CNN about a startling sight: Not a single cargo vessel had left China with goods for the two major West Coast ports in the past 12 hours.",
    "url": "https://cnn.com/2025/05/10/business/zero-ships-china-trade-ports-pandemic"
  },
  {
    "text": "Federal judge temporarily blocks further Trump-backed mass firings across gov't  —  A federal judge issued a temporary restraining order on Friday night blocking the Trump administration from implementing broad staffing cuts and other efforts to dismantle wide swaths of the federal government for the next two weeks.",
    "url": "https://www.lawdork.com/p/-federal-judge-blocks-trump-mass-firings"
  },
  {
    "text": "Yesterday afternoon, President Donald Trump withdrew his nomination for interim U.S. attorney Ed Martin to become U.S. attorney in Washington D.C., the top federal prosecutor in the nation's capital.  A Missouri political operative with no experience as a prosecutor, Martin defended … ",
    "url": "https://heathercoxrichardson.substack.com/p/may-9-2025"
  },
  {
    "text": "There are big, ugly problems at the center of the House budget bill  —  Republicans have created impossible restraints on their tax-and-budget package.  —  You might have heard the riddle about the man who must row a fox, a chicken and a sack of corn across a river one at a time.",
    "url": "https://www.washingtonpost.com/opinions/2025/05/10/republicans-trump-tax-spending-medicaid/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ2ODQ5NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ4MjMxOTk5LCJpYXQiOjE3NDY4NDk2MDAsImp0aSI6IjU4MzYzMTUxLWM4OWEtNDY4MC05ZWQyLWEyYmU1YTY2YmM1ZSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9vcGluaW9ucy8yMDI1LzA1LzEwL3JlcHVibGljYW5zLXRydW1wLXRheC1zcGVuZGluZy1tZWRpY2FpZC8ifQ.pva4_2K8y_iHU9sWfpCnFnlfDxCoczEwWO55-96FMZU&itid=gfta"
  },
  {
    "text": "Pentagon Furthers Crackdown on Diversity Policies With Fresh Order for Review of Library Books  —  The move is the latest denunciation by the Trump administration against anything related to diversity, equity and inclusion.  —  The Pentagon continued its purge of anything related to diversity … ",
    "url": "https://www.nytimes.com/2025/05/09/us/politics/pentagon-hegseth-dei-library-books.html"
  },
  {
    "text": "Trump Media Warns Of ‘Material Weakness’ In Financial Controls  —  Topline  —  Trump Media & Technology Group, the parent of Truth Social, disclosed “material weaknesses” in its financial reporting controls—acknowledging the risk of errors in its financial statements … ",
    "url": "https://www.forbes.com/sites/zacheverson/2025/05/10/trump-media-truth-social-donald-material-weakness-sec-filing/"
  },
  {
    "text": "New York City Is About to Make a Huge Mistake  —  Speaking at a Black church in Brooklyn last September, Andrew Cuomo tested the message that would quickly become the centerpiece of his campaign to be mayor of the country's largest city.  “We're on the decline,” the former New York governor said.",
    "url": "https://newrepublic.com/article/194972/andrew-cuomo-mayor-new-york-city-huge-mistake"
  },
  {
    "text": "Angry Trump Kills “Woke” Program—and Accidentally Screws MAGA Voters  —  The other day, during his intensive daily reading of complex policy papers, President Donald Trump noticed that a government initiative created by his predecessor had the word “equity” in its title.  Naturally, this caught his attention.",
    "url": "https://newrepublic.com/article/195097/angry-trump-kills-woke-program-and-accidentally-screws-maga-voters"
  },
  {
    "text": "America's Richest Foundations Team Up Against Feared Trump Assault  —  Grantmakers are discussing legal and other strategies to help them avoid the recent fates of law firms and universities  —  Some of America's wealthiest and most powerful private foundations are informally banding together … ",
    "url": "https://www.wsj.com/politics/policy/nonprofit-foundations-prepare-trump-fight-884f6016?st=XEVcAX&reflink=desktopwebshare_permalink"
  }
]