[
  {
    "text": "Scoop: Iran warns Israel through UN against ground offensive in Gaza … - Iran's message, sent to Israel through the UN, comes as the Biden administration has been trying to deter Iran and Lebanon-backed Hezbollah, supported by Iran, from joining the war.",
    "url": "https://www.axios.com/2023/10/14/iran-warning-israel-hezbollah-hamas-war-gaza"
  },
  {
    "text": "Israeli Invasion Plans Target Gaza City and Hamas Leadership  —  The goal, according to three senior officers, is to wipe out the top political and military hierarchy of Hamas, the Palestinian group that controls Gaza.  —  The Israeli military is preparing to invade the Gaza Strip … ",
    "url": "https://www.nytimes.com/2023/10/14/world/middleeast/israel-gaza-invasion.html"
  },
  {
    "text": "Israel-Gaza war live updates  —  Israeli military preparing ‘wide range’ attacks as Gaza residents flee  —  The Israeli military said it is preparing a “wide range of offensive operative plans” for Gaza, including attacks by land, sea and air, after warning the entire population … ",
    "url": "https://www.washingtonpost.com/world/2023/10/14/israel-gaza-war-updates-hamas-palestine/"
  },
  {
    "text": "A flood of misinformation shapes views of Israel-Gaza conflict  —  The barrage of false images, memes, videos and posts — mostly generated from within the region itself — is making it difficult to assess what is real.  —  A WhatsApp voice memo purporting to have insider information … ",
    "url": "https://www.washingtonpost.com/technology/2023/10/14/propaganda-misinformation-israel-hamas-war-social-media/"
  },
  {
    "text": "Progressives call for US to take in some of the expected 1 million Gaza refugees  —  Experts predict a million refugees might flee the Gaza Strip amid the war between Israel and Hamas, and socialists and far-left lawmakers said America should welcome them.  —  “Fifty percent of the population in Gaza are children.",
    "url": "https://nypost.com/2023/10/14/progressives-call-for-us-to-take-refugees-from-gaza/"
  },
  {
    "text": "DeSantis argues against US accepting Gaza refugees, citing antisemitism  —  Florida Gov. Ron DeSantis (R) argued Saturday that the U.S. shouldn't take in Palestinian refugees fleeing from Gaza amid the war between Israel and Hamas militants.  —  “I don't know what [President] Biden's gonna do … ",
    "url": "https://thehill.com/policy/international/4256373-ron-desantis-argues-against-gaza-refugees/"
  },
  {
    "text": "Will Jim Jordan bully his way to the speakership?  —  To win the speaker's gavel, the Ohio Republican might have to embrace the tough tactics he built his reputation on.  —  Back in September 2016, Rep. Jim Jordan was on a crusade: He wanted the House to launch impeachment proceedings … ",
    "url": "https://www.politico.com/news/2023/10/14/jim-jordans-bully-pulpit-00121585"
  },
  {
    "text": "Nadler: supporting innocent Palestinians doesn't make you anti-Israel  —  Rep. Jerry Nadler (D-N.Y.) argued on Saturday that supporting innocent Palestinians doesn't make a person anti-Israel amid the ongoing fighting between Israel and Hamas.  —  “It's a fairly simple proposition … ",
    "url": "https://thehill.com/homenews/house/4256443-nadler-supporting-innocent-palestinians-doesnt-make-you-anti-israel/"
  },
  {
    "text": "UN expert warns of new instance of mass ethnic cleansing of Palestinians, calls for immediate ceasefire  —  Statement by Mr. Françis Amar, Chief, Division of International Organizations, ICRC  —  VIOLENCE AGAINST WOMEN LINKED TO POVERTY, ARMED CONFLICT, THIRD COMMITTEE TOLD, AS DISCUSSION OF WOMEN'S ISSUES CONCLUDES",
    "url": "https://www.ohchr.org/en/press-releases/2023/10/un-expert-warns-new-instance-mass-ethnic-cleansing-palestinians-calls"
  },
  {
    "text": "Republican Jeff Landry Wins The Louisiana Governor's Race, Reclaims Office For GOP  —  Attorney General Jeff Landry has won Louisiana governor's seat, fending off a crowded field of candidates.  —  LOADING  —  Attorney General Jeff Landry, a Republican backed by former President Donald Trump … ",
    "url": "https://www.huffpost.com/entry/election-2023-louisiana-governor_n_652b5af4e4b00565b6204b47"
  },
  {
    "text": "Mounting debt threatens Mike Pence's campaign  —  Pence's 2024 effort has $1.2 million on hand but has built up $620,000 in debt, a major warning sign for a presidential campaign.  —  Former Vice President Mike Pence's 2024 campaign faces a potentially existential cash squeeze, with debt already piling up.",
    "url": "https://www.nbcnews.com/politics/2024-election/mounting-debt-threatens-mike-pences-campaign-rcna120458"
  },
  {
    "text": "Time to be the arsenal of democracy  —  The quotes that got the most attention in President Joe Biden's remarks on Tuesday about the terrorist attacks in Israel referred to “evil.”  But the line with the most important policy foreshadowing was notable in that it did not name Israel per se … ",
    "url": "https://thehill.com/opinion/congress-blog/4256564-time-to-be-the-arsenal-of-democracy/"
  },
  {
    "text": "New Zealand Defeats Ardern's Party, Electing Conservative Coalition  —  The rightward shift came as voters punished the party once led by Jacinda Ardern for failing to deliver the transformational change that it had promised.  —  After an election campaign of fits and starts … ",
    "url": "https://www.nytimes.com/2023/10/14/world/asia/new-zealand-election-national-wins.html"
  },
  {
    "text": "Most say Biden has acted either illegally or unethically in his son's business dealings  —  A third of the public approves of the House's impeachment inquiry and 38% say neither party is equipped to manage government corruption. … Most adults say President Biden has at the very least acted unethically … ",
    "url": "https://apnorc.org/projects/most-say-biden-has-acted-either-illegally-or-unethically-in-his-sons-business-dealings/"
  }
]