[
  {
    "text": "Lawyers found classified docs in Trump's bedroom 4 months after Mar-a-Lago search  —  The revelation was contained in a newly unsealed opinion that a federal judge issued in 2023.  —  Four months after the FBI raided his Mar-a-Lago estate, Donald Trump's attorneys discovered four documents marked “classified” in his personal bedroom.",
    "url": "https://www.politico.com/news/2024/05/21/trump-classified-documents-bedroom-00159182"
  },
  {
    "text": "Trump email falsely says Biden was ‘locked & loaded’ to ‘take me out’ in Mar-a-Lago search  —  A former president falsely accusing his successor and rival of posing a threat to his life is without precedent in modern U.S. history.  —  Donald Trump on Tuesday falsely claimed … ",
    "url": "https://www.washingtonpost.com/politics/2024/05/21/trump-mar-a-lago-raid-fbi-deadly-force/"
  },
  {
    "text": "Scoop: Senate Democrats plot reproductive-rights blitz … - “We are certainly going to be talking a lot about [abortion],” she said.  — Sen. Patty Murray (D-Wash.), a leading advocate of protecting access to the procedure, said leaders plan to talk about potential floor actions … ",
    "url": "https://www.axios.com/2024/05/22/senate-democrats-plot-reproductive-rights-blitz"
  },
  {
    "text": "Schumer Plans Vote on Contraception Access, Teeing Up a Campaign Issue  —  Democrats are planning to spotlight Republicans' opposition to legislation protecting birth control access nationwide, as part of an election-year push.  —  Senator Chuck Schumer, Democrat of New York and the majority leader … ",
    "url": "https://www.nytimes.com/2024/05/22/us/politics/schumer-contraception-ivf-democrats.html"
  },
  {
    "text": "Biden Widens Student Loan Relief to More Than 10% of Borrowers  — More than one in 10 borrowers are getting debt relief, US says  — Biden promotes moves to cancel debt amid legal challenges  —  More than one in 10 Americans with federal student loans have been approved for some measure … ",
    "url": "https://www.bloomberg.com/news/articles/2024-05-22/student-loan-forgiveness-biden-widens-relief-to-over-10-of-borrowers"
  },
  {
    "text": "Fani Willis and judge presiding over Georgia Trump election case defeat challengers  —  Fulton County District Attorney Fani Willis, the Georgia prosecutor who brought a sprawling racketeering case against former President Donald Trump and others, has won the Democratic primary in her bid for reelection.",
    "url": "https://apnews.com/article/fani-willis-scott-mcafee-trump-georgia-indictment-6e55b3a7eafd66c6ae3dae3a50d3187a"
  },
  {
    "text": "Alito's “defense” of flying the J6 flag is transparent BS  —  Going full insurrectionist is not normal. … Everyone is waiting to see what the United States Supreme Court will do with Donald Trump's outlandish claim he should be given absolute immunity from prosecution for his attempts to overturn the 2020 election.",
    "url": "https://www.publicnotice.co/p/alito-upside-down-flag-january-6-explained"
  },
  {
    "text": "Biden's approval rating falls to lowest level in nearly two years-Reuters/Ipsos poll  —  U.S. President Joe Biden's public approval rating this month fell to its lowest level in almost two years, tying the lowest reading of his presidency in a warning sign for his reelection effort, a Reuters/Ipsos poll showed.",
    "url": "https://www.reuters.com/world/us/bidens-approval-rating-falls-lowest-level-nearly-two-years-reutersipsos-poll-2024-05-21/"
  },
  {
    "text": "Trump-Backed California Lawmaker Vince Fong Wins Special Election To Finish McCarthy's Term  —  A Trump-backed Republican California legislator won a special election to complete the remainder of the term of deposed former U.S. House Speaker Kevin McCarthy.  —  LOADING",
    "url": "https://www.huffpost.com/entry/election-2024-house-california_n_664dbf26e4b048d73b54b174"
  },
  {
    "text": "An Expert's Guide to Surviving Extreme Plane Turbulence  —  HOLD ON TIGHT  —  News that a 73-year-old man died when wild turbulence hit a Singapore Airlines flight on Tuesday is the stuff of most fliers' nightmares.  —  News that a 73-year-old man died and seven others were critically injured … ",
    "url": "https://www.thedailybeast.com/an-experts-guide-to-surviving-extreme-plane-turbulence-on-flights"
  },
  {
    "text": "The right's fascism problem  —  UNFORCED ERROR — Since Donald Trump emerged on the national political scene in 2015, journalists and pundits have been debating whether it's appropriate to compare him and the MAGA movement to the fascist movements of 20th-century Europe — and, more specifically … ",
    "url": "https://www.politico.com/newsletters/politico-nightly/2024/05/21/the-rights-fascism-problem-00159265"
  },
  {
    "text": "Scenes From a MAGA Meltdown: Inside the “America First” Movement's War Over Democracy  —  Across the country, the Republican Party's rank-and-file have turned on the GOP establishment.  In Michigan, this schism broke the party — and maybe democracy itself.",
    "url": "https://www.propublica.org/article/michigan-republicans-maga-meltdown-democracy-elections"
  },
  {
    "text": "British lawmaker who lost hands and feet to sepsis returns to parliament  —  A British lawmaker returned to parliament on Wednesday, five months after losing his hands and feet to sepsis, receiving loud applause from colleagues and praise from the prime minister.",
    "url": "https://www.reuters.com/world/uk/british-lawmaker-who-lost-hands-feet-sepsis-returns-parliament-2024-05-22/"
  },
  {
    "text": "“Pro-Pedophile” Activist Group Celebrates As Germany Decriminalizes Child Porn Possession  —  Germany's Parliament (Bundestag) has received the votes necessary to remove a section of the Criminal Code which made the possession of child sexual abuse materials a felony crime.",
    "url": "https://reduxx.info/pro-pedophile-activist-group-celebrates-as-germany-decriminalizes-child-porn-possession/"
  },
  {
    "text": "The campaign to gut Washington's power over corporate America  —  A yearslong legal crusade to hobble Wall Street's top cop could have repercussions across the government.  —  A decade-long conservative crusade against financial regulators will come to a head soon with a crucial Supreme Court ruling … ",
    "url": "https://www.politico.com/news/2024/05/21/supreme-court-jarkesy-administrative-state-00158948"
  },
  {
    "text": "Meet Trump's ‘Human Printer’  —  WHENEVER DONALD TRUMP BRANDISHES a stack of papers or reads a printout of a social media post, he's relying on the work of Natalie Harp.  —  Harp, 32, occupies a unique role in the history of presidential campaigns: aide who travels with a portable printer … ",
    "url": "https://www.thebulwark.com/p/meet-trumps-human-printer-natalie-harp"
  },
  {
    "text": "Scoop: Mike Johnson's communications director to leave Capitol Hill … - Shah's timeline on leaving Johnson's office is unclear, but he is expected to remain on through at least the end of the month.  — “It's an honor to serve Speaker Johnson, especially through such an historic time,” Shah said in a statement.",
    "url": "https://www.axios.com/2024/05/22/mike-johnson-communications-raj-shah-trump"
  },
  {
    "text": "Trump says he will ‘never advocate’ for contraception restrictions after earlier saying he's ‘looking at’ them  —  The social media post came after Trump said in a TV interview that he plans to share a policy on contraception “very shortly,” without providing details.",
    "url": "https://www.politico.com/news/2024/05/21/trump-contraception-abortion-00159118"
  },
  {
    "text": "The Right Has A Terrifying Second Trump Term Plan Called Project 2025  —  Many of our readers have asked us to explore the details and dangers of “Project 2025”—a right-wing plan for how to move America toward authoritarian rule under a second Trump term.  —  Few writers and scholars … ",
    "url": "https://thinkbigpicture.substack.com/p/project-2025-thomas-zimmer-trump"
  },
  {
    "text": "Scoop: Inside the DNC strategy for Trump VPs … - It also plans to run paid ads and dedicate staff across the communications, digital and research departments to the effort.  — The vice presidential debate in July or August, the official says, will be another key opportunity for the DNC to define Trump's vice presidential pick.",
    "url": "https://www.axios.com/2024/05/22/democratic-national-committee-trump-vp-maga"
  },
  {
    "text": "Rep. Greg Murphy reveals skull tumor diagnosis, planned surgery … - He is an active member of the House Committee on Ways and Means, the Committee on Veterans' Affairs and the Committee on House Administration.  — “As a physician I have, for the last 30 years, taken care of thousands and thousands of patients.",
    "url": "https://www.axios.com/2024/05/21/skull-tumor-greg-murphy-north-carolina"
  }
]