[
  {
    "text": "Thoughts On the Hur Report  —  Let me share a few thoughts on the Biden special counsel report.  —  First off, this is another example of the universal rule: Republican special counsels are chosen to investigate Democrats.  And Republican special counsels are chosen to investigate Republicans.",
    "url": "https://talkingpointsmemo.com/edblog/thoughts-on-the-hur-report"
  },
  {
    "text": "Biden investigation reveals event that nearly pushed Joe to resign as Obama's vice president  —  Then-Vice President Joe Biden considered resigning from his post under former President Barack Obama over disagreements with the administration's policies during the Afghanistan War … ",
    "url": "https://www.washingtonexaminer.com/news/white-house/2846948/biden-investigation-reveals-event-nearly-pushed-joe-resign-obamas-vice-president/"
  },
  {
    "text": "Playbook: A day Biden world wishes it could forget  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  TALK OF THIS TOWN — Michael Schaffer's latest column: “To See the Toxic Effect of Crime on Politics, Look at Local DC”",
    "url": "https://www.politico.com/newsletters/playbook/2024/02/09/a-day-biden-world-wishes-it-could-forget-00140647"
  },
  {
    "text": "'It's devastating': Trump seizes unmatched control over GOP  —  Trump's influence was felt across the country, from Nevada to Congress to the Republican National Committee.  —  RENO, Nevada — Donald Trump long ago bent the Republican Party to his will.  But seldom has the sheer sweep … ",
    "url": "https://www.politico.com/news/2024/02/09/trump-gop-dominance-00140592"
  },
  {
    "text": "How Trump turned the GOP into the party of lawless disorder  —  Can Republicans win by promoting contempt for the rule of law?  We're about to find out. … As the GOP prepares for the third general election with Donald Trump at the head of its ticket, it is becoming clear that the 2024 race … ",
    "url": "https://www.publicnotice.co/p/trump-gop-lawless-disorder"
  },
  {
    "text": "Trump Came for Their Party but Took Over Their Souls  —  I thought I was beyond shockable, but this week has been profoundly shocking for me.  I spent the bulk of my adult life on the right-wing side of things, generally rooting for the Republican Party, because I thought that party best served America.",
    "url": "https://www.nytimes.com/2024/02/08/opinion/trump-republicans-immigration.html"
  },
  {
    "text": "Evangelicals' Trump Worship Looks More Like QAnon Every Day  —  I've watched hundreds of hours of Trump rally footage, and it's clear he's going full “messiah” in his plea to the evangelical Christian voters who have supported him since 2016. … I have watched every Donald Trump rally … ",
    "url": "https://www.thedailybeast.com/evangelicals-trump-worship-looks-more-like-qanon-every-day"
  },
  {
    "text": "Jury awards climate scientist Michael Mann $1 million in defamation lawsuit  —  A jury on Thursday awarded $1 million to climate scientist Michael Mann who sued a pair of conservative writers 12 years ago after they compared his depictions of global warming to a convicted child molester.",
    "url": "https://apnews.com/article/climate-change-defamation-michael-mann-penn-state-61289ee2d8d2143768d28995c83899ef"
  },
  {
    "text": "Israel-Hamas war: Netanyahu orders Gaza's crowded Rafah evacuated ahead of an expected ground invasion  —  Israeli Prime Minister Benjamin Netanyahu on Friday said he has ordered the military to prepare a plan to evacuate civilians from Rafah ahead of an expected Israeli invasion of the densely populated southern Gaza city.",
    "url": "https://apnews.com/article/israel-hamas-war-news-02-09-2024-d3229eec6a85c071248d3ddc2de2a73e"
  },
  {
    "text": "Scoop — Forthcoming book on Jill Biden in 2022: “Why didn't anyone stop that? … President Biden and top aides were gathered in the Treaty Room, the president's study in the executive residence, after a press conference that ran nearly two hours. … - Suddenly, the group saw First Lady Jill Biden … ",
    "url": "https://www.axios.com/2024/02/09/forthcoming-book-jill-biden-why-didnt-anyone-stop-that"
  },
  {
    "text": "Revealed: rightwinger Leonard Leo linked to efforts to keep Trump on ballot  —  Federalist Society co-chair has ties to the groups arguing in the US supreme court case that Trump should stay on the Colorado ballot  —  The man behind the conservative effort to move the judiciary to the right … ",
    "url": "https://www.theguardian.com/law/2024/feb/09/leonard-leo-federalist-society-trump-ballot-supreme-court"
  },
  {
    "text": "Putin walks away with propaganda victory after Tucker Carlson's softball interview  —  Editor's Note: A version of this article first appeared in the “Reliable Sources” newsletter.  Sign up for the daily digest chronicling the evolving media landscape here.  —  CNN  —",
    "url": "https://www.cnn.com/2024/02/08/media/vladimir-putin-tucker-carlson-interview-reliable-sources/"
  },
  {
    "text": "Arizona prevents election recount nightmare scenario with a bipartisan fix  —  Lawmakers approved a change to the battleground state's election policies to ensure Arizona delivers its presidential electors to Washington on time in the event of a close race.  —  Arizona lawmakers dodged … ",
    "url": "https://www.nbcnews.com/politics/2024-election/arizona-prevents-election-recount-nightmare-scenario-rcna138028"
  },
  {
    "text": "‘It would be devastating’: inside Trump's plan to destroy the EPA  —  Trump has made campaign promises to toss crucial environmental regulations - including dismantling the federal body with the most power to tackle the climate crisis  —  Donald Trump and his advisers have made campaign promises … ",
    "url": "https://www.theguardian.com/us-news/2024/feb/09/trump-epa-plan-environment"
  },
  {
    "text": "US to Launch $5 Billion Research Hub to Stay Ahead in Chip Race  — Officials seek to prevent China from benefiting from funding  — R&D effort seeks to fill hardware, packaging innovation gaps  —  President Joe Biden's administration plans to launch a $5 billion semiconductor research consortium … ",
    "url": "https://www.bloomberg.com/news/articles/2024-02-09/us-to-launch-5-billion-research-hub-to-stay-ahead-in-chip-race"
  },
  {
    "text": "Inflation in December was even lower than first reported, the government says  —  The prices consumers pay in the marketplace rose at an even slower pace than originally reported, according to closely watched revisions the government released Friday.  —  Updates to the consumer price index showed … ",
    "url": "https://www.cnbc.com/2024/02/09/-inflation-in-december-was-even-lower-than-first-reported-the-government-says.html"
  },
  {
    "text": "Oral surgery at today's Supreme Court  —  The Supreme Court hears oral arguments today on whether Section 3 of the 14th Amendment of the Constitution bars Trump from appearing on the ballot in Colorado and other states because of his role in the January 6 Capitol riot.",
    "url": "https://robertreich.substack.com/p/oral-surgery-at-todays-supreme-court"
  }
]