[
  {
    "text": "The ‘faith-based’ leader for Philly's Moms for Liberty chapter is a registered sex offender  —  Phillip Fisher Jr. is a pastor and Republican ward leader who coordinates faith-based outreach for Philadelphia's Moms for Liberty chapter.He's also a registered sex offender … ",
    "url": "https://www.inquirer.com/politics/philadelphia/moms-for-liberty-philadelphia-pastor-sex-offender-20231120.html"
  },
  {
    "text": "President-elect Milei vows 'end of Argentina's decline'  —  Libertarian outsider Javier Milei swept to victory in Argentina's presidential election Sunday, vowing to halt decades of economic decline in a country reeling from triple-digit inflation.  —  The self-described “anarcho-capitalist” … ",
    "url": "https://insiderpaper.com/milei-wins-argentina-election-with-56-percent-provisional-results/"
  },
  {
    "text": "Biden turns 81 as questions about age continue to dominate 2024 race  —  Polls show voters continue to be concerned by Biden's age.  —  President Joe Biden smiles as he walks from Marine One upon arrival on the South Lawn of the White House, June 1, 2023, in Washington.",
    "url": "https://abcnews.go.com/Politics/biden-turns-81-questions-age-continue-dominate-2024/story?id=104984287"
  },
  {
    "text": "Many former Trump aides say he shouldn't be president.  Will it matter?  —  Critics are grappling with how they can puncture Trump's candidacy in 2024 and whether their voices will have any impact  —  John F. Kelly, the longest-serving chief of staff in President Donald Trump's White House … ",
    "url": "https://www.washingtonpost.com/nation/2023/11/20/trump-aides-cabinet-critics-election/"
  },
  {
    "text": "4 more free COVID tests will be available to each household ahead of the holidays  —  The winter season is expected to bring a resurgence of the virus.  —  Boxes of BinaxNow a COVID-19 at home test kit made by Abbott, Aug. 13, 2022, in North Haledon, N.J.  —  Ahead of the approaching holidays … ",
    "url": "https://abcnews.go.com/Health/4-free-covid-tests-household-ahead-holidays/story?id=104989775"
  },
  {
    "text": "Richest 1% account for more carbon emissions than poorest 66%, report says  —  ‘Polluter elite’ are plundering the planet to point of destruction, says Oxfam after comprehensive study of climate inequality  —  The richest 1% of humanity is responsible for more carbon emissions than the poorest 66% … ",
    "url": "https://www.theguardian.com/environment/2023/nov/20/richest-1-account-for-more-carbon-emissions-than-poorest-66-report-says"
  },
  {
    "text": "Support for Abortion Access Is Near Record, WSJ-NORC Poll Finds  —  Some 55% of respondents say a pregnant woman should be able to get an abortion for any reason  —  Santana De'LaBay, a 29-year-old Republican with six children, thinks her party is wrong to back broad abortion restrictions.",
    "url": "https://www.wsj.com/politics/policy/support-for-abortion-access-is-near-record-wsj-norc-poll-finds-6021c712?mod=followamazon"
  },
  {
    "text": "Who Is Most Responsible For Divisions In The U.S.?  Social Media Ranks #1 Among Young Voters, Quinnipiac University National Poll Finds; Table The Talk About Politics At Thanksgiving, Say Voters  —  mail_outline  —  Given a list of four options and asked which they hold most responsible … ",
    "url": "https://poll.qu.edu/poll-release?releaseid=3885"
  },
  {
    "text": "Federal court deals devastating blow to Voting Rights Act  —  The decision out of the 8th Circuit will almost certainly be appealed to the Supreme Court.  —  A federal appeals court issued a ruling Monday that could gut the Voting Rights Act, saying only the federal government … ",
    "url": "https://www.politico.com/news/2023/11/20/federal-court-deals-devastating-blow-to-voting-rights-act-00128069"
  },
  {
    "text": "Judge Aileen Cannon's Games in Florida May Delay Other Trump Trials  —  The federal judge overseeing Donald Trump's classified documents case is setting up some serious roadblocks in the case, and injecting confusion in his other upcoming trials too.  —  When Donald Trump's beloved federal … ",
    "url": "https://www.thedailybeast.com/judge-aileen-cannons-games-in-florida-may-delay-other-trump-trials"
  },
  {
    "text": "Greene calls for new Jan. 6 select committee  —  Rep. Marjorie Taylor Greene (R-Ga.) on Sunday called on Speaker Mike Johnson (R-La.) to create a new Jan. 6 select committee she said would target the original members of the panel and exonerate the so-called “MAGA” wing of the Republican Party … ",
    "url": "https://thehill.com/homenews/house/4318796-greene-new-jan-6-select-committee/"
  },
  {
    "text": "How SCOTUS's “ethics code” provides cover for corruption  —  It's weak sauce — which was the goal all along. … After unrelenting pressure from everyone but Republicans, who by and large are thrilled that Supreme Court justices can be bought, the Court has issued a voluntary, non-binding code of conduct.",
    "url": "https://www.publicnotice.co/p/supreme-court-ethics-code-corruption-explained"
  },
  {
    "text": "GOP moves to split Arizona Democrats in 3-way Senate race  —  A new NRSC ad boosts independent Kyrsten Sinema while slamming likely Democratic nominee Ruben Gallego.  —  Senate Republicans are rolling out a provocative new strategy as they try to boost the GOP's chances in Arizona next year: propping up incumbent Sen. Kyrsten Sinema.",
    "url": "https://www.politico.com/news/2023/11/20/arizona-democrats-3-way-senate-race-nrsc-00128018"
  },
  {
    "text": "Wages are rising.  Jobs are plentiful.  Nobody's happy.  —  It's a good time to be a worker and a bad time to be a consumer — the problem is most people are both.  —  Explaining the state of the American economy at the moment is a conundrum.  The labor market is good … ",
    "url": "https://www.vox.com/2023/11/20/23964535/labor-market-employment-inflation-sentiment-economy-bad-polls"
  },
  {
    "text": "UAW formally claims contract wins at Big Three  —  Across General Motors, Ford and Stellantis, 64 percent of UAW members voted in favor of the tentative agreements brokered by union leadership.  —  Unionized workers at Detroit's Big Three car companies have officially ratified their contracts, the United Auto Workers announced Monday.",
    "url": "https://www.politico.com/news/2023/11/20/uaw-contract-wins-big-three-00128041"
  },
  {
    "text": "The Era of Total U.S. Submarine Dominance Over China Is Ending  —  New Chinese submarines and sensors to catch U.S. subs will alter the balance of power  —  For decades, the U.S. hasn't had to worry much about China's submarines.  They were noisy and easy to track.",
    "url": "https://www.wsj.com/world/china/us-submarine-dominance-shift-china-8db10a0d?mod=followamazon"
  }
]