[
  {
    "text": "Scoop: Biden told Bibi U.S. won't support an Israeli counterattack on Iran … - Iran launched attack drones and missiles against Israel on Saturday night local time in retaliation for an airstrike in Syria that killed a top Iranian general.  — “More than 200 drones … ",
    "url": "https://www.axios.com/2024/04/14/biden-netanyahu-iran-israel-us-wont-support"
  },
  {
    "text": "UN Security Council to meet Sunday on Iran attack after Israel request  —  The United Nations Security Council is set to meet on Sunday after Israel requested the council condemn Iran's attack on Israel and designate the Iranian Revolutionary Guard Corps a terrorist organization.",
    "url": "https://www.reuters.com/world/middle-east/un-security-council-aims-meet-sunday-iran-attack-after-israel-request-diplomat-2024-04-14/"
  },
  {
    "text": "Statement from President Joe Biden on Iran's Attacks against the State of Israel  —  Earlier today, Iran—and its proxies operating out of Yemen, Syria and Iraq—launched an unprecedented air attack against military facilities in Israel.  I condemn these attacks in the strongest possible terms.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/04/13/statement-from-president-joe-biden-on-irans-attacks-against-the-state-of-israel/"
  },
  {
    "text": "U.S. Intercepts Drones and Missiles Aimed at Israel, as Allies Pledge Support  —  Iran fired more than 300 drones and missiles at Israel overnight.  The U.S. military shot some of them down, but most were intercepted by Israel's military.  —  Here are the latest developments.",
    "url": "https://www.nytimes.com/live/2024/04/13/world/israel-iran-gaza-war-news"
  },
  {
    "text": "Israel says Iran launched more than 300 drones and missiles, 99% of which were intercepted  —  Sirens and explosions in Jerusalem after Iran fires drones and missiles  —  Israeli military spokesman: we will do everything to defend Israel  —  Military expert weighs in on Iran's military attack against Israel",
    "url": "https://apnews.com/article/strait-of-hormuz-vessel-33fcffde2d867380e98c89403776a8ac"
  },
  {
    "text": "Live Updates: Israel Weighs Response After Iranian Attack Does Little Damage  —  As Biden urged Israel to show restraint, Iran signaled that it would not strike further unless attacked.  Calm mostly prevailed in Israel after Iran fired hundreds of missiles and drones overnight, nearly all of them intercepted.",
    "url": "https://www.nytimes.com/live/2024/04/14/world/iran-israel-gaza-war-news"
  },
  {
    "text": "Iran strike live updates: Israel says over 300 drones, missiles were shot down during attack … China expresses ‘deep concern’ over Iranian attack  —  HONG KONG — China expressed “deep concern” over the Iranian attack on Israel, describing it as “the latest spillover of the Gaza conflict” … ",
    "url": "https://www.nbcnews.com/news/world/live-blog/iran-attack-israel-strikes-live-updates-rcna147738"
  },
  {
    "text": "Small-time investors in Trump's Truth Social reckon with stock collapse  —  Some Trump supporters who invested in his social media company have seen their share values plunge —  Jerry Dean McLain first bet on former president Donald Trump's Truth Social two years ago … ",
    "url": "https://www.washingtonpost.com/technology/2024/04/14/truth-social-investors-faith-trump/"
  },
  {
    "text": "Four Years Out, Some Voters Look Back at Trump's Presidency More Positively  —  A new poll by The New York Times and Siena College finds that voters think highly of the former president's record on the economy, but memories of his divisiveness largely remain intact.",
    "url": "https://www.nytimes.com/2024/04/14/us/politics/poll-trump-views.html"
  },
  {
    "text": "As Trump goes on trial, Biden goes to Pennsylvania  —  Biden plans to attack Trump on the economy while the former president is in court, though abortion will still be his campaign's top message.  —  WASHINGTON — While President Donald Trump is in his hometown of New York this week … ",
    "url": "https://www.nbcnews.com/politics/2024-election/trump-goes-trial-biden-goes-pennsylvania-rcna147703"
  },
  {
    "text": "The Shady Right-Wing Threats to Keep Biden Off Some State Ballots … When the Supreme Court overturned a Colorado court ruling last month that had disqualified former President Donald Trump from the state ballot, the justices argued that it was necessary to avoid a “patchwork” of requirements for presidential candidates to meet.",
    "url": "https://newrepublic.com/article/180674/ohio-alabama-biden-convention-ballots"
  },
  {
    "text": "Scoop: How a key skeptic got behind Democrats' Ukraine aid push … - But only one Republican, former Rep. Ken Buck (R-Colo.), has signed on, and some progressives won't sign over the bill's military aid for Israel. … - “I remain skeptical that they will get enough Republicans on it to get to 218 … ",
    "url": "https://www.axios.com/2024/04/14/israel-ukraine-aid-democrat-petition"
  },
  {
    "text": "Major media organizations urge Biden and Trump to debate  —  ABC News and other major TV networks sent a letter to the candidates Sunday.  —  President Joe Biden and Former President Donald Trump  —  ABC News is among a unified grouping of the five chief broadcast and cable news networks … ",
    "url": "https://abcnews.go.com/Politics/major-media-organizations-urge-biden-trump-debate/story?id=109169895"
  },
  {
    "text": "Trump endorses a Pennsylvania U.S. Senate candidate he once condemned  —  The former president backed former hedge fund CEO Dave McCormick to take on Democratic Sen. Bob Casey  —  SCHNECKSVILLE, Pa. — Former President Donald Trump backed former hedge fund CEO Dave McCormick on Saturday … ",
    "url": "https://www.washingtonpost.com/politics/2024/04/13/trump-mccormick-pennsylvania-senate/"
  }
]