[
  {
    "text": "Trump once hosted party for ‘young women’ where Epstein was the only guest, says report  —  President under pressure to release all files related to his former friend Epstein  —  Donald Trump once hosted a party with “young women” where the disgraced late pedophile Jeffrey Epstein “was the only other guest,” according to a report.",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/trump-epstein-party-women-b2792328.html"
  },
  {
    "text": "Trump survived many scandals, but the Epstein story poses a new test  —  The MAGA base has rallied as they see him under attack.  The White House is trying to change the subject.  —  Just now  —  Nearly two weeks after President Donald Trump and his administration announced they had nothing … ",
    "url": "https://www.washingtonpost.com/politics/2025/07/20/trump-epstein-files-political-fallout-risks/"
  },
  {
    "text": "Consumed by Epstein, Trump has lost ground on the economy and immigration  —  When he was sworn in, Trump promised a new “Golden Age.”  It's clear that, six months into his presidency, the public isn't buying all the hype.  —  Just now  —  President Donald Trump spent much of last week trying … ",
    "url": "https://www.washingtonpost.com/politics/2025/07/20/trump-epstein-economy-immigration-approval/"
  },
  {
    "text": "G.O.P. Push Behind Trump Agenda Has Congress in an Uproar … Republicans' relentless marathon to force President Trump's agenda through Congress over objections from Democrats and some in their own ranks is taking a toll on the institution and its members, prompting tempers to boil … ",
    "url": "https://www.nytimes.com/2025/07/20/us/politics/republicans-democrats-congress-dysfunction.html"
  },
  {
    "text": "Bipartisan government funding is at risk of dying in Trump's Washington  —  Eschewing a long-standing practice, Trump's budget director is calling for a more partisan path to funding the government ahead of a Sept. 30 shutdown deadline.  —  WASHINGTON — For many years … ",
    "url": "https://www.nbcnews.com/politics/congress/bipartisan-government-funding-dying-trump-spending-cuts-shutdown-rcna219344"
  },
  {
    "text": "‘Direct retaliation’: Hispanic journalist detained by ICE speaks out  —  In an exclusive interview from an ICE detention facility, Mario Guevara talks about his month behind bars and his once positive feelings toward Donald Trump.  —  Mario Guevara spent the bulk of his days as a journalist … ",
    "url": "https://www.ajc.com/news/2025/07/direct-retaliation-hispanic-journalist-detained-by-ice-speaks-out/"
  },
  {
    "text": "Another Hegseth aide exits as Pentagon churn continues  —  Justin Fulcher was at the center of two unusual controversies, and officials had speculated in recent days that his days in the Trump administration were numbered.  —  Another senior aide to Defense Secretary Pete Hegseth is leaving the Pentagon … ",
    "url": "https://www.washingtonpost.com/national-security/2025/07/19/hegseth-justin-fulcher-pentagon/"
  },
  {
    "text": "“He's a madman”: Trump's team frets about Netanyahu after Syria strikes  —  As smoke and debris swirled over the Syrian presidential palace, the chatter in the West Wing grew louder: Benjamin Netanyahu is out of control. … He bombs everything all the time,\" one White House official told Axios, referring to Netanyahu by his nickname.",
    "url": "https://www.axios.com/2025/07/20/israel-syria-strikes-trump-netanyahu-divide"
  },
  {
    "text": "Sunday Pages: “Superman”  —  A film by James Gunn  —  I first saw the trailer for the new James Gunn Superman a few months ago, during the NBA playoffs.  My first reaction was an eye-roll and a dismissive, “Do we really need another Superman?  Really?  Why?”",
    "url": "https://gregolear.substack.com/p/sunday-pages-superman"
  },
  {
    "text": "What happens once we spot the asteroid that will hit Earth? … In January, at a US Space Force Base in the Rocky Mountains near Colorado Springs, an operator received an unusual email.  It was an alert — but not one triggered by the military's network of space-based sensors.",
    "url": "https://www.ft.com/content/7a629f0c-6a62-47d6-831a-48a492a49acb"
  },
  {
    "text": "As Trump Courts a More Assertive Beijing, China Hawks Are Losing Out  —  The Trump administration has dialed back aggressive measures against China and reversed its position on technology controls as the president angles for a Chinese trip later this year.  —  In recent years … ",
    "url": "https://www.nytimes.com/2025/07/20/us/politics/trump-china-technology.html"
  },
  {
    "text": "Trump Aides Discussed Ending Some SpaceX Contracts, but Found Most Were Vital  —  Fallout between the president and the rocket maker's billionaire founder threatened the company's multibillion-dollar agreements with the government  —  For the U.S. government, breaking up with Elon Musk is easier said than done.",
    "url": "https://www.wsj.com/business/trump-aides-discussed-ending-some-spacex-contracts-but-found-most-were-vital-d1cf9ab5"
  },
  {
    "text": "JD Vance flew to Montana for secret meeting with Rupert Murdoch and Fox News executives  —  A source familiar with the trip told The Independent that the vice president spoke to both Rupert and Lachlan Murdoch, as well as a group of executives from the right-wing network",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/jd-vance-murdoch-fox-news-secret-meeting-b2769061.html"
  },
  {
    "text": "GOP Rep. Tim Burchett doubles down on call for release of Epstein files  —  Burchett stopped short of calling for Attorney General Pam Bondi to resign.  —  Rep. Tim Burchett speaks to reporters while arriving at the Capitol Hill Club for a meeting of the House Republican Conference on March 25, 2025, in Washington, D.C.",
    "url": "https://abcnews.go.com/Politics/gop-rep-tim-burchett-doubles-call-release-epstein/story?id=123902429"
  },
  {
    "text": "After a Chaotic Start, a U.S. Attorney's Time May Be Running Out  —  Alina Habba, President Trump's choice to run the U.S. attorney's office in New Jersey, has pursued investigations against Democrats.  Her tenure has damaged morale inside the office.  —  Lawyers for Eliyahu Weinstein were faced with a difficult situation.",
    "url": "https://www.nytimes.com/2025/07/20/nyregion/alina-habba-us-attorney-new-jersey.html"
  },
  {
    "text": "Why American Jews No Longer Understand One Another  —  It's a tense time in the Jewish family group chats.  The consensus that held American Jewry together for generations is breaking down.  That consensus, roughly, was this: What is good for Israel is good for the Jews.  Anti-Zionism is a form of antisemitism.",
    "url": "https://www.nytimes.com/2025/07/20/opinion/antisemitism-american-jews-israel-mamdani.html?unlocked_article_code=1.X08.7jBS.jwWy8PewQI51&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "The War on Women  —  When we said women and people who loved them needed to vote like their lives depended on it in 2024, it wasn't hyperbole.  Despite the hole the Dobbs case, which reversed Roe v. Wade, tore in the heart of so many Americans and the women who have suffered and even died since … ",
    "url": "https://joycevance.substack.com/p/the-war-on-women"
  },
  {
    "text": "EU to Prepare Retaliation Plan as US Trade Stance Seen to Harden  —  European Union envoys are set to meet as early as this week to formulate a plan for measures to respond to a possible no-deal scenario with US President Donald Trump, whose tariff negotiating position is seen to have stiffened ahead of an Aug. 1 deadline.",
    "url": "https://www.bloomberg.com/news/articles/2025-07-20/eu-to-prepare-retaliation-plan-as-us-trade-stance-seen-to-harden?accessToken=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzb3VyY2UiOiJTdWJzY3JpYmVyR2lmdGVkQXJ0aWNsZSIsImlhdCI6MTc1MzAxMjYwMSwiZXhwIjoxNzUzNjE3NDAxLCJhcnRpY2xlSWQiOiJTWk9SREZHUFFRN0gwMCIsImJjb25uZWN0SWQiOiJFNDNBODZGMTM2MEQ0QTYzQURDREY5MzhBMUU0NzIzNCJ9.fjgETkTcJ_ybUTFDhNjBYNbUTohxlzCfNKyH6UDRXjE"
  },
  {
    "text": "GOP wants to cut waste.  Critics say SNAP exemption could do opposite.  —  Republicans sought to make states pay for some food-assistance benefits, but watchdogs say an exception added to the bill could discourage states from addressing disbursement mistakes.  —  Just now",
    "url": "https://www.washingtonpost.com/politics/2025/07/20/snap-tax-law-error-rate/"
  }
]