[
  {
    "text": "Harris accepts CNN debate invitation for October 23, again challenging Trump to another showdown  —  Vice President Kamala Harris on Saturday accepted an invitation from CNN to debate former President Donald Trump on October 23, challenging her rival to another engagement on a public stage in the final weeks of the campaign.",
    "url": "https://www.cnn.com/2024/09/21/politics/presidential-debate-harris-trump-cnn/"
  },
  {
    "text": "Trump says ‘too late to do another’ debate after Harris accepts CNN invitation  —  Former President Trump said Saturday afternoon that it's “too late to do another” debate, after Vice President Harris accepted an invitation from CNN for a second debate.  —  “She's done one debate.  I've done two.",
    "url": "https://thehill.com/homenews/campaign/4892384-trump-rejects-harris-debate-cnn/"
  },
  {
    "text": "Trump says it's ‘too late’ after Harris agrees to Oct. 23 debate on CNN  —  The former president's comments come after Harris goaded her opponent to accept another face-off.  —  Donald Trump quashed the prospect of another presidential debate on Saturday, saying it's “too late” … ",
    "url": "https://www.politico.com/news/2024/09/21/harris-challenges-trump-to-second-debate-on-oct-23-00180362"
  },
  {
    "text": "Trump appeals to women in return to North Carolina without Mark Robinson, a top in-state supporter  —  Donald Trump returned to North Carolina on Saturday, stumping in the southern battleground state with direct appeals to women, claiming he would be a better champion for them than Vice President Kamala Harris … ",
    "url": "https://apnews.com/article/trump-mark-robinson-north-carolina-wilmington-1bc79594567860c9ffe7f44375fac847"
  },
  {
    "text": "Republicans Reeling As Trump Raised Just $44.5 Million in August  —  In what is being described as a Friday news dump, the Trump campaign waited until the very last minute to file their FEC report about how much they raised in August, because the number isn't great.",
    "url": "https://www.politicususa.com/2024/09/21/republicans-reeling-as-trump-raised-just-44-5-million-in-august.html"
  },
  {
    "text": "As President, Trump Demanded Investigations of Foes.  He Often Got Them. … Former President Donald J. Trump has threatened to carry out a campaign of retribution if he returns to the White House.Roger Kisby for The New York Times  —  It was the spring of 2018 and President Donald J. Trump … ",
    "url": "https://www.nytimes.com/2024/09/21/us/politics/trump-investigations-enemies.html?unlocked_article_code=1.MU4.aemx.o4cu_iUb-wxt&smid=url-share"
  },
  {
    "text": "Wisconsin Town Voting Machine Access Challenge  —  United States of America v. Town of Thornapple  —  Lawsuit filed by U.S. Department of Justice (DOJ) against the Town of Thornapple, the Town of Lawrence, town officials and the state of Wisconsin challenging the towns' decisions to ban … ",
    "url": "https://www.democracydocket.com/cases/wisconsin-town-voting-machine-access-challenge/"
  },
  {
    "text": "A tour of the 7½ key swing states  —  There's a 92 percent chance that this is where the election is decided.  —  ∙ Paid  —  In 16 years of running election forecasts, I've never seen such a close election.  —  Our polling averages in seven swing states — in alphabetical order … ",
    "url": "https://www.natesilver.net/p/a-tour-of-the-7-key-swing-states"
  },
  {
    "text": "A dramatic rise in pregnant women dying in Texas after abortion ban  —  Exclusive analysis finds the rate of maternal deaths in Texas increased 56% from 2019 to 2022, compared with just 11% nationwide during the same time period.  —  The number of women in Texas who died while pregnant … ",
    "url": "https://www.nbcnews.com/health/womens-health/texas-abortion-ban-deaths-pregnant-women-sb8-analysis-rcna171631"
  },
  {
    "text": "New MyPillow ad includes a ‘disturbing wink at Nazis’: historian  —  Far-right election denier Mike Lindell's MyPillow is now being advertised at a significant discount.  One historian is pointing out that the pillow's new price is a reference to a prominent neo-Nazi rallying cry.",
    "url": "https://www.alternet.org/mike-lindell-nazis/"
  },
  {
    "text": "Elon Musk's X Backs Down in Brazil  —  In an abrupt reversal, the social network's lawyers said it was complying with court orders that it had previously defied.  Brazil's Supreme Court could allow the site to return next week.  —  Elon Musk suddenly gave up.",
    "url": "https://www.nytimes.com/2024/09/21/world/americas/elon-musk-x-brazil.html?unlocked_article_code=1.MU4.vF-1.G8FMn_vW3QBK&smid=nytcore-ios-share&referringSource=articleShare&sgrp=c-cb&ngrp=mnp"
  },
  {
    "text": "Married RFK Jr., 70, Bragged He Had ‘Intimate’ Photos of Reporter Olivia Nuzzi, 31  —  COULDN'T CURB HIS ENTHUSIASM  —  A source said the two had met multiple times, though insisted those meetings included public functions and maintained Olivia Nuzzi and RFK Jr.'s relationship was never physical.",
    "url": "https://www.thedailybeast.com/married-rfk-jr-70-bragged-he-had-intimate-photographs-of-reporter-31"
  },
  {
    "text": "Abortion drugs and procedures are part of lifesaving treatments because abortion is healthcare  —  Soon, Louisiana will add the abortion pills misoprostol and mifepristone to its list of Schedule IV controlled substances, which will make it more difficult for doctors to access the drugs during emergencies … ",
    "url": "https://www.msnbc.com/ali-velshi/watch/abortion-drugs-and-procedures-are-part-of-lifesaving-treatments-because-abortion-is-healthcare-219873349818"
  },
  {
    "text": "What Trump has promised to do on ‘day one’ as president  —  Trump has made 41 distinct promises for his first day in office, including mass deportations and banning transgender women from sports.  —  Donald Trump has a long list of executive actions he says he wants to carry out on his potential first day back in the White House.",
    "url": "https://www.washingtonpost.com/politics/2024/09/21/trump-day-one-promises-president-election/"
  },
  {
    "text": "Cards Against Humanity game sues Musk's SpaceX for trespassing  —  Cards Against Humanity (CAH) is suing Elon Musk's SpaceX for $15 million after it allegedly left construction equipment and destroying property on CAH land in Texas.  —  The complaint, which was filed Thursday evening … ",
    "url": "https://thehill.com/policy/technology/4892479-cards-against-humanity-spacex-lawsuit/"
  }
]