[
  {
    "text": "Chris Christie caught on hot mic, says Nikki Haley will ‘get smoked’  —  Moments before ending his 2024 presidential campaign at a New Hampshire town hall, former New Jersey governor Chris Christie was caught on a hot mic saying GOP presidential candidate Nikki Haley will “get smoked” in the primary race.",
    "url": "https://www.washingtonpost.com/politics/2024/01/10/chris-christie-hot-mic-new-hampshire-town-hall/"
  },
  {
    "text": "Latest GOP split: Senate leaders hold out as House brass goes all-in for Trump  —  The former president's allies warn it's a risky move, depending on “how much Donald Trump wants to keep a grudge.”  —  Most Senate GOP leaders are confronting a dilemma they hoped to avoid … ",
    "url": "https://www.politico.com/news/2024/01/11/trump-endorsements-2024-election-00134814"
  },
  {
    "text": "Don't Be So Certain Trump Has the Nomination Locked Up  —  Here's the path for a Nikki Haley upset.  —  Contrary to conventional wisdom, Nikki Haley doesn't have to win New Hampshire, or even South Carolina — she just has to keep it close enough to keep donors and voters convinced there might … ",
    "url": "https://www.politico.com/news/magazine/2024/01/11/nikki-haley-donald-trump-gop-00134902"
  },
  {
    "text": "Will You Vote for Trump Again?  —  It's the question weighing on Republicans across the country.  But Iowans get to decide first.  We listened as they grappled with their choices.  —  By Jennifer MedinaPhotographs by Jordan Gale  —  There is no way around it: The Iowa caucuses on Monday … ",
    "url": "https://www.nytimes.com/2024/01/11/us/politics/iowa-voters.html"
  },
  {
    "text": "Trump Reacts To Woman Telling Him He ‘Personally Demeaned’ So Many Ex-Associates  —  The former president was confronted by a DeSantis supporter at the Fox News town hall and tried to spin his way out of it.  —  LOADING  —  Donald Trump on Wednesday wriggled out of a town hall question … ",
    "url": "https://www.huffpost.com/entry/donald-trump-personally-demeaned_n_659fbe78e4b0fbd2bc05d67d"
  },
  {
    "text": "Bomb Threat Made at Home of Judge in Trump's Bank Fraud Trial  —  A bomb squad rushed to Justice Arthur F. Engoron's house on Long Island, a source told The Daily Beast.  —  The danger surrounding Donald Trump's bank fraud trial in New York escalated just hours before its final hearing on Thursday … ",
    "url": "https://www.thedailybeast.com/arthur-engoron-bomb-threat-made-at-home-of-judge-in-trumps-bank-fraud-trial"
  },
  {
    "text": "Judge in Trump's civil fraud trial faces bomb threat ahead of closing arguments  —  The bomb squad was called to Engoron's home and was investigating Thursday morning.  It is unclear whether Engoron was home at the time.  —  Nassau County police on Thursday have responded to a bomb threat … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/bomb-threat-targeted-home-judge-trumps-civil-fraud-trial-rcna133416"
  },
  {
    "text": "US verges on vaccination tipping point, faces thousands of needless deaths: FDA  —  Top regulatory officials call for clinicians to speak up and drown out misinformation.  —  The US may be heading to a “dangerous vaccination tipping point,” with immunization rates falling so low … ",
    "url": "https://arstechnica.com/science/2024/01/anti-vaccine-nonsense-will-likely-kill-thousands-this-season-fda-officials-say/"
  },
  {
    "text": "Musk uses megaphone to promote misleading claims about voting, push for severe restrictions  —  This week, Elon Musk has repeatedly promoted false and misleading claims about voting to his 168 million followers on X, the social network formerly known as Twitter.",
    "url": "https://popular.info/p/musk-uses-megaphone-to-promote-misleading"
  },
  {
    "text": "Jan. 6 committee helped guide early days of Georgia Trump probe  —  In the spring of 2022, the committee staff helped Fulton County prosecutors prepare for interviews with key witnesses.  —  Georgia prosecutors probing Donald Trump's effort to subvert the 2020 election got an early boost in the spring of 2022.",
    "url": "https://www.politico.com/news/2024/01/10/jan-6-georgia-trump-probe-00134941"
  },
  {
    "text": "American intel officials warn of risk of Hezbollah attacking U.S.  —  Hezbollah has more capability to strike inside the U.S. than other terrorist groups like ISIS, officials say.  —  U.S. officials assess that there's a rising risk Lebanese Hezbollah militants will strike Americans in the Middle East … ",
    "url": "https://www.politico.com/news/2024/01/10/american-intel-officials-hezbollah-u-s-attack-risk-00134874"
  },
  {
    "text": "Haters gonna hate: Pentagon pushes back against Fox News conspiracy theory involving Taylor Swift  —  Watters on Tuesday told viewers that “around four years ago, the Pentagon's psychological operations unit floated turning Taylor Swift into an asset.”  —  There may be bad blood between Taylor Swift … ",
    "url": "https://www.politico.com/news/2024/01/10/pentagon-taylor-swift-fox-00134866"
  },
  {
    "text": "Conservatives take revenge for Johnson's spending deal by halting action on House floor  —  They're looking for ways to punish GOP leadership, even if they're not yet willing to boot the speaker.",
    "url": "https://www.politico.com/live-updates/2024/01/10/congress/house-floors-shut-down-00134812"
  },
  {
    "text": "Staffers Allege Jamie McLeod-Skinner's Driver Feared Physical Violence From Her  —  The new allegations, however, mark the first public claim that the congressional candidate laid a hand on an employee.  —  Expand  —  Three former campaign workers for U.S. congressional candidate Jamie McLeod-Skinner … ",
    "url": "https://www.wweek.com/news/2024/01/10/staffers-allege-jamie-mcleod-skinners-driver-feared-physical-violence-from-her/"
  },
  {
    "text": "UFO sightings: House bill would allow civilian pilots to report UAP for national security  —  The bipartisan legislation would enable commercial pilots and other airline employees to report UFO sightings to the FAA, which would share it with the Pentagon  —  Commercial airline pilots … ",
    "url": "https://www.usatoday.com/story/news/politics/2024/01/11/ufo-sightings-house-bill-uap/72178065007/"
  },
  {
    "text": "GOP AGs Urging Impeachment Of Secretary Mayorkas Squirm When Asked About Trump  —  “I'm just a simple attorney general from Oklahoma,” said Genter Drummond when Rep. Eric Swalwell (D-Calif.) asked if Trump's conduct warranted impeachment.  —  LOADING  —  WASHINGTON ― Rep. Eric Swalwell … ",
    "url": "https://www.huffpost.com/entry/republican-attorneys-general-mayorkas-impeach-trump_n_659ef3cce4b0712b12c36a32"
  },
  {
    "text": "Statement on the Approval of Spot Bitcoin Exchange-Traded Products  —  Today, the Commission approved the listing and trading of a number of spot bitcoin exchange-traded product (ETP) shares.  —  I have often said that the Commission acts within the law and how the courts interpret the law.",
    "url": "https://www.sec.gov/news/statement/gensler-statement-spot-bitcoin-011023"
  },
  {
    "text": "Brexit Cost the UK Economy £140 Billion, London Mayor Says  — Study suggests UK has 2 million fewer jobs due to EU divorce  — Sadiq Khan says ‘mature approach’ needed to forge closer ties  —  London Mayor Sadiq Khan on Thursday will blame Brexit for costing the UK economy £140 billion … ",
    "url": "https://www.bloomberg.com/news/articles/2024-01-11/brexit-erased-140-billion-from-uk-economy-london-mayor-to-say"
  },
  {
    "text": "COVID ‘6-feet’ social distancing ‘sort of just appeared,’ likely lacked scientific basis, Fauci admits  —  Dr. Anthony Fauci confessed to lawmakers Tuesday that guidelines to keep six feet of separation — ostensibly to limit the spread of COVID-19 — “sort of just appeared” without scientific input.",
    "url": "https://nypost.com/2024/01/10/news/fauci-admits-to-congress-that-certain-covid-social-distancing-guidelines-lacked-scientific-basis-sort-of-just-appeared/"
  },
  {
    "text": "Mike Johnson urges fellow Republicans to leave him alone on social media … - Facing a Jan. 19 deadline, some hardliners have said they are not opposed to shutting down the government in an attempt to get more concessions.  — Democrats have noted that Republicans have very little leverage due … ",
    "url": "https://www.axios.com/2024/01/10/mike-johnson-budget-republicans-social-media"
  }
]