[
  {
    "text": "Peter Navarro says Trump told him to assert privilege during Jan. 6 committee investigation  —  Washington — Former top Trump White House economic adviser Peter Navarro told a federal judge that Donald Trump made it “very clear” that he wanted Navarro to invoke certain privileges and not respond … ",
    "url": "https://www.cbsnews.com/news/trump-aide-peter-navarro-trump-assert-privilege-jan-6-committee/"
  },
  {
    "text": "Trump vows to appeal after judge sets March 2024 trial date - live  —  Experts say trial dates typically not subject to appeal as Mark Meadows attempts to move his case to federal court  —  Key events  —  Trump says he'll appeal 4 March trial start  —  DeSantis speaks to Biden … ",
    "url": "https://www.theguardian.com/us-news/live/2023/aug/28/trump-trial-jan-6-georgia-biden-politics-live-updates"
  },
  {
    "text": "Mark Meadows takes stand in bid to derail Georgia criminal charges  —  The former top Trump aide testified that he viewed nearly everything as part of his official duties — an argument he hopes will give him immunity.  —  ATLANTA — Former Trump White House Chief of Staff Mark Meadows took … ",
    "url": "https://www.politico.com/news/2023/08/28/meadows-testimony-georgia-hearing-00113215"
  },
  {
    "text": "Meadows testifies in Atlanta; March trial date for Trump in D.C.  —  Trump D.C. trial set to begin in March amid GOP primaries and other trial dates  —  U.S. prosecutor says Trump's social media posts show need for quick trial  —  'Let's take the temperature down,' judge says in D.C. hearing",
    "url": "https://www.washingtonpost.com/dc-md-va/2023/08/28/trump-jan-6-trial-date/"
  },
  {
    "text": "Trump vows to appeal after judge set federal election trial for March 4, 2024  — A federal judge set a March 4, 2024, trial date in former President Donald Trump's criminal election interference case.  — Judge Tanya Chutkan delivered that ruling after rejecting two wildly different … ",
    "url": "https://www.cnbc.com/2023/08/28/trump-special-counsel-to-clash-over-trial-date-in-dc-election-case.html"
  },
  {
    "text": "Samuel Wurzelbacher, Celebrated as ‘Joe the Plumber,’ Dies at 49  —  For Republicans in 2008, he briefly became a symbol of Middle America when he questioned the presidential candidate Barack Obama in an impromptu televised encounter.  —  Samuel Joseph Wurzelbacher, who briefly became … ",
    "url": "https://www.nytimes.com/2023/08/28/us/politics/samuel-wurzelbacher-joe-the-plumber-dead.html"
  },
  {
    "text": "‘Joe The Plumber,’ who rose to fame after confronting Barack Obama on the 2008 campaign trail, dead at 49  —  Joe Wurzelbacher, a plumber by trade, became a key part of Republican John McCain's presidential campaign  —  Samuel Joseph Wurzelbacher, who became known as “Joe the Plumber” … ",
    "url": "https://www.foxnews.com/politics/joe-plumber-rose-fame-confronting-obama-2008-campaign-trail-dead-49"
  },
  {
    "text": "‘Joe The Plumber,’ thrust into spotlight for confronting Obama, dies at 49  —  Joe Wurzelbacher became a political celebrity after posing a question in 2008 to then-candidate Barack Obama regarding his tax policies and small business.  —  Samuel Joseph Wurzelbacher, whose question to Barack Obama … ",
    "url": "https://www.nbcnews.com/politics/politics-news/joe-plumber-thrust-spotlight-confronting-obama-dies-49-rcna102182"
  },
  {
    "text": "EXCLUSIVE: Eminem sends Vivek Ramaswamy a cease and desist letter demanding he stop rapping his music on the campaign trail  — Rapper Eminem has objected to Republican candidate Vivek Ramaswamy using his music on the campaign trail, DailyMail.com can exclusively report",
    "url": "https://www.dailymail.co.uk/news/article-12453955/Im-REAL-Slim-Shady-Eminem-sends-skinny-Vivek-Ramaswamy-cease-desist-letter-demanding-stop-rapping-music-campaign-trail.html"
  },
  {
    "text": "Ramaswamy Fires At Nikki Haley On Campaign Website: ‘Keep Lying, Namrata Randhawa’  —  The 2024 hopeful's website referenced the former ambassador's birth name to dispel a ‘myth’ about his support of Israel  —  A Facebook icon representing an external link to share the article on Facebook … ",
    "url": "https://themessenger.com/politics/ramaswamy-fires-at-nikki-haley-on-campaign-website-keep-lying-namrata-randhawa"
  },
  {
    "text": "Eminem Hits Vivek Ramaswamy With Cease and Desist Following ‘Lose Yourself’ Performance: Report  —  The rapper is demanding the Republican presidential candidate stop using his songs on the campaign trail  —  A Facebook icon representing an external link to share the article on Facebook … ",
    "url": "https://themessenger.com/politics/eminem-hits-vivek-ramaswamy-with-cease-and-desist-following-lose-yourself-performance-report"
  },
  {
    "text": "DeSantis booed at vigil for victims of racist shooting in Florida  —  Florida Gov. Ron DeSantis, a GOP presidential candidate, was met with boos while speaking late Sunday at a vigil held for the three victims of a racially motivated shooting in Jacksonville.",
    "url": "https://thehill.com/homenews/state-watch/4174426-desantis-booed-at-vigil-for-victims-of-racist-shooting-in-florida/"
  },
  {
    "text": "Biden is widely seen as too old for office, an AP-NORC poll finds.  Trump has problems of his own  —  Americans actually agree on something in this time of raw discord: Joe Biden is too old to be an effective president in a second term.  Only a few years his junior, Donald Trump raises strikingly less concern about his age.",
    "url": "https://apnews.com/article/biden-age-poll-trump-2024-620e0a5cfa0039a6448f607c17c7f23e"
  },
  {
    "text": "GOP activist, lawyer stabbed to death in his Durham, NH, home  —  A suspicious death investigation that was underway this weekend in Durham, New Hampshire, has been ruled a homicide after an autopsy was completed on the victim.  —  The New Hampshire Attorney General's Office said in a statement Sunday … ",
    "url": "https://www.nbcboston.com/news/local/41-year-old-man-fatally-stabbed-in-durham-nh-identified/3122099/"
  },
  {
    "text": "Burning Man 2023: Nevada Rangers plow truck through Extinction Rebellion protest after the activists blocked road into festival causing ‘miles-long gridlock’  — Officers from the Pyramid Lake Paiute Tribal Police drove through the blockade  —  Rangers have smashed through a climate protest blocking … ",
    "url": "https://www.dailymail.co.uk/news/article-12453081/Nevada-Rangers-Extinction-Rebellion-protest-activists-blocked-road-Burning-Man.html"
  },
  {
    "text": "MAGA attorney gets three years after voter fraud conviction in Ohio  —  A Trump-supporting tax attorney in Shaker Heights, Ohio has been sentenced to three years for illegally voting twice, reported the Cleveland Scene.  —  This comes a week after the attorney, 53-year-old James Saunders, was convicted.",
    "url": "https://www.rawstory.com/voter-fraud-maga-attorney/"
  },
  {
    "text": "Riley Gaines Wrecks Nebraska Democrat for Tone-Deaf Statement About Women's Sports  —  For a party that claims to be the women looking out for women, the Democrats sure are doing a lot to erase them in favor of some transgender agenda.  —  While you can see a demonstration a day … ",
    "url": "https://redstate.com/brandon_morse/2023/08/28/riley-gaines-wrecks-nebraska-democrat-for-tone-deaf-statement-about-womens-sports-n2163132"
  },
  {
    "text": "The administration's love letter to unions  —  A new Treasury Department report found unions help to raise wages and benefits for workers and can lead to positive economic “spillover effects.”  —  Treasury Secretary Janet Yellen described her agency's report Monday as “the administration's latest action … ",
    "url": "https://thehill.com/newsletters/business-economy/4175613-the-administrations-love-letter-to-unions/"
  },
  {
    "text": "The Federalist Society's mugshots  —  This entirely free edition of Public Notice is made possible by paid subscribers.  If you appreciate our work and aren't already one, please support us by signing up.  Just click the button below for a free trial.  —  Sign up for Public Notice free trial",
    "url": "https://www.publicnotice.co/p/jeffrey-clark-eastman-charges-federalist-society"
  }
]