[
  {
    "text": "Scoop: Blackstone's Steve Schwarzman backs Trump … Schwarzman, a billionaire and lifelong moderate Republican, was one of Trump's most visible business supporters when he was in the White House.  — But ahead of this year's GOP primaries, Schwarzman called for “a new generation of leaders.”",
    "url": "https://www.axios.com/2024/05/24/trump-2024-stephen-schwarzman-blackstone"
  },
  {
    "text": "Blackstone's Chief, a G.O.P. Megadonor, Says He Will Again Back Trump  —  Stephen A. Schwarzman, the billionaire co-founder and chief executive of the investment group, had previously called for a “new generation of leaders.”  —  Stephen A. Schwarzman, the billionaire chairman and chief executive … ",
    "url": "https://www.nytimes.com/2024/05/24/us/politics/blackstone-stephen-schwarzman-trump.html"
  },
  {
    "text": "Special counsel asks judge for gag order in Trump classified documents case  —  Special counsel's office prosecutors on Friday asked a federal judge in Florida to place a gag order on Donald Trump that would limit his ability to comment about law enforcement that searched his Mar-a-Lago resort.",
    "url": "https://www.cnn.com/2024/05/24/politics/trump-gag-order-trump-classified-documents/"
  },
  {
    "text": "Prosecutors seek to bar Trump in classified files case from statements endangering law enforcement  —  Federal prosecutors on Friday asked the judge overseeing the classified documents case against Donald Trump to bar the former president from public statements that “pose a significant … ",
    "url": "https://apnews.com/article/trump-classified-documents-fbi-d52b7468d93712dd86cbb8fe304d4b64"
  },
  {
    "text": "Trump Pressures Republicans to Pass a Law to Keep Him Out of Jail Forever  —  The former president is convinced state prosecutors will target him again after a second term, and wants the GOP to solve that problem for him  —  Donald Trump likes to tell anyone who will listen … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-republicans-pass-law-jail-1235027139/"
  },
  {
    "text": "Trumpworld Claims 25,000 People Attended His Rally.  Aerial Shots Show Otherwise.  —  COUNTING IS EASY  —  The Trump campaign was adamant 25,000 people attended his Bronx rally.  Footage, and The Daily Beast's reporter in attendance, suggested otherwise.  —  Trumpworld is once again splintering from reality.",
    "url": "https://www.thedailybeast.com/aerial-shots-undercut-comical-claim-about-trumps-bronx-rally"
  },
  {
    "text": "Jan. 6 rioter who attacked cops lashes out at Trump-appointed judge after 12-year sentence  —  Christopher Quaglin said that Donald Trump would be back in the White House in eight short months and called the judge who sentenced him Trump's “worst mistake of 2016.”",
    "url": "https://www.nbcnews.com/politics/justice-department/jan-6-rioter-attacked-cops-lashes-trump-appointed-judge-12-year-senten-rcna153818"
  },
  {
    "text": "‘Sedition Panda’ convicted of assaulting officer on Jan. 6 after judge calls defense argument ‘absurd’  —  Jesse James Rumson, dubbed “Sedition Panda” because of the costume head he wore on Jan. 6, will be sentenced in September.  —  WASHINGTON — A Jan. 6 rioter dubbed “Sedition Panda” … ",
    "url": "https://www.nbcnews.com/politics/justice-department/sedition-panda-convicted-assaulting-officer-jan-6-judge-calls-defense-rcna153920"
  },
  {
    "text": "U.S. Announces $275 Million Weapons Package To Ukraine Amid Calls To Loosen Limits  —  Ukraine wants a green light to strike inside Russia with American weapons.  So do some key members of Congress.  —  LOADING  —  The Pentagon announced a $275 million package of weaponry for Ukraine … ",
    "url": "https://www.huffpost.com/entry/us-announces-military-aid-package-ukraine_n_6650fd08e4b07f5ea74825d2"
  },
  {
    "text": "Libertarian convention devolves into fighting, obscenities on eve of Trump's visit  —  The former president could face a hostile crowd when he addresses the Libertarian Party on Saturday.  —  Donald Trump won't be speaking to his usual self-selected crowd of adoring red-hatted MAGA fans … ",
    "url": "https://www.politico.com/news/2024/05/24/libertarian-convention-fighting-obscenities-trump-visit-00160008"
  },
  {
    "text": "Trump's ‘unified Reich’ video appears to trace origins to a Turkish graphic designer  —  The phrase “unified Reich,” which appeared in a video posted by the Trump campaign and caused a firestorm of controversy, appears to have originated as placeholder text in a collection of video templates created … ",
    "url": "https://www.cnn.com/2024/05/24/media/trump-unified-reich/"
  },
  {
    "text": "A Polling Risk for Trump  —  His advantage may not be as stable as it looks.  —  The polls have shown Donald Trump with an edge for eight straight months, but there's a sign his advantage might not be quite as stable as it looks: His lead is built on gains among voters who aren't paying close attention … ",
    "url": "https://www.nytimes.com/2024/05/24/briefing/a-polling-risk-for-trump.html"
  },
  {
    "text": "As ‘The Apprentice’ Seeks Cannes Sale, Trump Team Sends Cease and Desist Letter to Block Film's Release (EXCLUSIVE)  —  Attorneys for Donald Trump have sent a cease and desist letter to the filmmakers behind “The Apprentice” in an effort to block its U.S. sale and release.",
    "url": "https://variety.com/2024/film/news/apprentice-donald-trump-team-cease-and-desist-letter-sebastian-stan-jeremy-strong-1236015819/"
  },
  {
    "text": "Defense Secretary Lloyd Austin to undergo surgery … - “The Secretary has determined he will be temporarily unable to perform his functions and duties during the procedure,” Pentagon spokesperson Maj. Gen. Pat Ryder said in a statement, adding that Deputy Secretary of Defense Kathleen Hicks will assume his post.",
    "url": "https://www.axios.com/2024/05/24/lloyd-austin-surgery-bladder-walter-reed"
  },
  {
    "text": "Republican Rep's Daughter and Son-in-Law Killed in Haiti Gang Attack  —  ‘MY HEART IS BROKEN’  —  “I've never felt this kind of pain,” Ben Baker wrote on Facebook on Friday.  —  Missouri state Rep. Ben Baker said Friday that his “heart is broken in a thousand pieces” … ",
    "url": "https://www.thedailybeast.com/missouri-state-rep-ben-bakers-daughter-son-in-law-killed-in-haiti"
  },
  {
    "text": "They brick you because they can (permalink)  —  In “The Scorpion and the Frog,” a trusting frog gives a scorpion a ride across a brook, only to be stung to death by his passenger upon arrival.  The dying frog gasps “why?” and the scorpion replies, “I am sorry, but I couldn't resist the urge.",
    "url": "https://pluralistic.net/2024/05/24/record-scratch/#autoenshittification"
  },
  {
    "text": "Google criticized as AI Overview makes obvious errors, such as saying former President Obama is Muslim … It's been less than two weeks since Google debuted “AI Overview” in Google Search, and public criticism has mounted after queries have returned nonsensical or inaccurate results within the AI feature — without any way to opt out.",
    "url": "https://www.cnbc.com/2024/05/24/google-criticized-as-ai-overview-makes-errors-like-saying-president-obama-is-muslim.html"
  },
  {
    "text": "Trump's Apparent VP Contender Proudly Flies Jan. 6-Linked Flag  —  IN A FLUTTER  —  Tom Cotton is showing his true colors.  —  Sen. Tom Cotton (R-AR), who is reportedly a top contender for Donald Trump's vice presidential pick, has jumped on the bandwagon of flying the Christian nationalist “Appeal To Heaven” flag.",
    "url": "https://www.thedailybeast.com/trumps-apparent-vp-contender-tom-cotton-proudly-flies-jan-6-linked-flag"
  }
]