[
  {
    "text": "Donald Trump is barred from Colorado's 2024 primary ballot, the state Supreme Court rules  —  In a historic decision Tuesday, the Colorado Supreme Court barred Donald Trump from running in the state's presidential primary after determining that he had engaged in insurrection on Jan. 6, 2021.",
    "url": "https://www.washingtonpost.com/politics/2023/12/19/trump-off-colorado-ballot/"
  },
  {
    "text": "Colorado Supreme Court bans Trump from the state's ballot under Constitution's insurrection clause  —  DENVER (AP) — The Colorado Supreme Court on Tuesday declared former President Donald Trump ineligible for the White House under the U.S. Constitution's insurrection clause and removed … ",
    "url": "https://apnews.com/article/trump-insurrection-14th-amendment-2024-colorado-d16dd8f354eeaf450558378c65fd79a2"
  },
  {
    "text": "Colorado Supreme Court kicks Trump off the state's 2024 ballot for violating the U.S. Constitution  —  The ruling marks the first time a 14th Amendment challenge to Trump's candidacy has been successful.  —  In a bombshell decision, Colorado's Supreme Court on Tuesday ruled … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/colorado-supreme-court-kicks-trump-states-2024-ballot-violating-us-con-rcna130484"
  },
  {
    "text": "Colorado Supreme Court disqualifies Trump from 2024 ballot, pauses ruling to allow appeal  — Lawsuits in a slew of states have sought to block Donald Trump from appearing on ballots for the 2024 presidential election.  — The suits argued that Trump should be barred from ballots … ",
    "url": "https://www.cnbc.com/2023/12/19/trump-ballot-challenge-decided-by-colorado-supreme-court.html"
  },
  {
    "text": "Trump ineligible to run for president in Colorado because of Jan. 6, court rules in historic move  —  The decision sets up a battle before the U.S. Supreme Court.  —  Republican presidential candidate former U.S. President Donald Trump delivers remarks during a campaign rally … ",
    "url": "https://abcnews.go.com/Politics/trump-ineligible-run-president-jan-6-colorado-court/story?id=105785727"
  },
  {
    "text": "Federal judge orders documents naming Jeffrey Epstein's associates to be unsealed  —  More than 150 people are expected to be identified in early January.  —  Jeffrey Epstein attends Launch of RADAR MAGAZINE at Hotel QT on May 18, 2005.  —  A federal judge in New York has ordered … ",
    "url": "https://abcnews.go.com/US/federal-judge-orders-documents-naming-jeffrey-epsteins-associates/story?id=105779882"
  },
  {
    "text": "Over 170 of Jeffrey Epstein's high-profile associates will be NAMED in court documents set to be unsealed in the first days of 2024  — A judge has ruled to unseal documents that would name 177 Does who are Epstein's friends, recruiters and victims within the coming weeks",
    "url": "https://www.dailymail.co.uk/news/article-12881277/Pedophile-Jeffrey-Epstein-associates-named-unsealed-court-document.html"
  },
  {
    "text": "Biden resists his age limitations, causing tension  —  President Biden's reluctance to acknowledge his physical limitations at age 81 is causing some tension on his team, as senior aides and First Lady Jill Biden push him to rest more and be vigilant about his health going into 2024.",
    "url": "https://www.axios.com/2023/12/19/biden-resistance-age-trump-election-2024"
  },
  {
    "text": "Tucker Carlson rips DeSantis' political operation as ‘nastiest’ and ‘stupidest’ he's seen  —  A member of DeSantis' team appeared to respond with a jab at Donald Trump's campaign.  —  Former Fox News host Tucker Carlson lit into Florida Gov. Ron DeSantis' allies during Turning Point USA's AmericaFest … ",
    "url": "https://www.politico.com/news/2023/12/19/tucker-carlson-rips-desantis-political-operation-as-nastiest-and-stupidest-hes-seen-00132523"
  },
  {
    "text": "GOP rep: Trump's anti-immigrant rhetoric wasn't anti-immigrant  —  After Donald Trump again said immigrants are “poisoning the blood of our country,” Nicole Malliotakis tried to gaslight a national television audience.  —  After Donald Trump spent the weekend reiterating his belief that immigrants are … ",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/gop-rep-trumps-anti-immigrant-rhetoric-wasnt-anti-immigrant-rcna130381"
  },
  {
    "text": "Rite Aid Banned from Using AI Facial Recognition After FTC Says Retailer Deployed Technology without Reasonable Safeguards  —  FTC says Rite Aid technology falsely tagged consumers, particularly women and people of color, as shoplifters; Ban will last five years",
    "url": "https://www.ftc.gov/news-events/news/press-releases/2023/12/rite-aid-banned-using-ai-facial-recognition-after-ftc-says-retailer-deployed-technology-without"
  },
  {
    "text": "Ex-Proud Boys leader is sentenced to over 3 years in prison for Capitol riot plot  —  A former leader of the far-right Proud Boys extremist group was sentenced on Tuesday to more than three years behind bars for joining a plot to attack the U.S. Capitol nearly three years ago.",
    "url": "https://apnews.com/article/charles-donohoe-proud-boys-capitol-riot-trump-2c4bf37d2dd4f1dc82d6a1caa423a205"
  },
  {
    "text": "$750 a month, no questions asked, improved the lives of homeless people  —  For L.A. Times Subscribers  —  If 100 homeless people were given $750 per month for a year, no questions asked, what would they spend it on?  —  That question was at the core of a controlled study conducted … ",
    "url": "https://www.latimes.com/california/story/2023-12-19/750-a-month-no-questions-asked-improved-the-lives-of-homeless-people"
  },
  {
    "text": "Poll Finds Wide Disapproval of Biden on Gaza, and Little Room to Shift Gears  —  Opinion is split between those wanting the war to end and those pressing for a definitive Israeli victory, and the divide is starkest among older and younger generations.  —  Opinion is split between those wanting … ",
    "url": "https://www.nytimes.com/2023/12/19/us/politics/biden-israel-gaza-poll.html"
  },
  {
    "text": "Senate confirms top military nominees, ending Tuberville's hold over promotions  —  Eleven nominees were confirmed.  —  The Senate on Tuesday confirmed nearly a dozen nominees for top military posts on Tuesday night, marking the end of Sen. Tommy Tuberville's remaining holds over senior promotions.",
    "url": "https://www.politico.com/news/2023/12/19/senate-confirms-top-military-nominees-ending-tubervilles-hold-over-promotions-00132588"
  },
  {
    "text": "Counsel withdraws for former Kanye West publicist, Trump co-defendant Trevian Kutti  —  Trevian Kutti (Fulton County Sheriff's Office)  —  FULTON COUNTY, Ga. - The attorneys representing Trevian Kutti, a co-defendant of Donald Trump and former publicist for Kanye West, have filed a motion to withdraw as counsel of record.",
    "url": "https://www.fox5atlanta.com/news/counsel-withdraws-for-former-kanye-west-publicist-trump-co-defendant-trevian-kutti"
  },
  {
    "text": "Israel offers Hamas one-week pause in fighting as part of a new hostage deal  —  Israel is offering to pause the fighting in Gaza for at least one week as part of a new deal to get Hamas to release more than three dozen hostages the terror group is holding, two Israeli officials and another source … ",
    "url": "https://www.axios.com/2023/12/19/israel-offer-hamas-pause-fighting-hostages"
  },
  {
    "text": "Ketanji Brown Jackson slapped with ethics complaint over husband's income  —  Group says Supreme Court justice omitted portions of husband's income on disclosure forms for years  —  FIRST ON FOX — A conservative policy group has filed an ethics complaint against Supreme Court Justice Ketanji Brown Jackson … ",
    "url": "https://www.foxnews.com/politics/ketanji-brown-jackson-slapped-ethics-complaint-husbands-income"
  },
  {
    "text": "Pay Dispute Between James Craig Campaign, Former Staffers Renders Website Blank  —  Craig, one candidate in a growing field of Republicans running for Senate in Michigan, said he was unaware of any pay dispute involving his campaign  —  A pay dispute between Michigan Senate candidate James Craig's campaign … ",
    "url": "https://themessenger.com/politics/pay-dispute-between-james-craig-campaign-former-staffers-renders-website-blank"
  },
  {
    "text": "Scoop: Inside the White House's border assurances to Hispanic lawmakers  —  Biden officials have told Hispanic lawmakers that they are resisting GOP demands to limit the administration's authority to release migrants through the legal tool known as parole, according to people familiar with the matter.",
    "url": "https://www.axios.com/2023/12/20/biden-border-hispanic-parole-migrant-crisis"
  }
]