[
  {
    "text": "What J.D. Vance really believes  —  I met Sen. J.D. Vance (R-OH), Donald Trump's new choice for vice president, in the summer of 2022.  I was covering a conservative conference in Israel, and Vance was the surprise VIP attraction.  We chatted for a bit about the connections between right … ",
    "url": "https://www.vox.com/politics/360283/jd-vance-trump-vp-vice-president-authoritarian"
  },
  {
    "text": "55 Things to Know About J.D. Vance, Trump's VP Pick  —  Donald Trump's pick for vice president made a 180-degree turn from fierce critic to bulldog surrogate for the former president.  —  Who is J.D. Vance really?  —  That is the question that has dogged the 39-year-old senator from Ohio along … ",
    "url": "https://www.politico.com/news/magazine/2024/07/15/jd-vance-55-things-trump-vp-00167882"
  },
  {
    "text": "The inside story of how Trump chose JD Vance as his running mate  —  Once a critic, Vance repositioned himself as an faithful ally eager to defend Trump on TV, carry a torch for a younger generation of MAGA figures and fight for voters in the Midwest.  —  MILWAUKEE — With the clock ticking … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-chose-jd-vance-running-mate-vp-pick-rcna161982"
  },
  {
    "text": "The risk of J.D. Vance  —  Trump went with the MAGA pick.  But the 2022 election suggests that might not be the right electoral one.  —  During the 2022 election, Republicans nominated unpopular candidates aligned with Donald Trump.  As a group, they most likely cost the party a chance to win the U.S. Senate.",
    "url": "https://www.washingtonpost.com/politics/2024/07/15/risk-jd-vance/"
  },
  {
    "text": "Biden-Harris Campaign: “As Trump's running mate, Vance will make it his mission to enact Trump's Project 2025 agenda”  —  From the Biden for President campaign:",
    "url": "https://bluevirginia.us/2024/07/biden-harris-campaign-as-trumps-running-mate-vance-will-make-it-his-mission-to-enact-trumps-project-2025-agenda"
  },
  {
    "text": "Who Is Usha Vance, the Wife of J.D. Vance?  —  The two met at Yale Law School, and Ms. Vance has helped him along in his political rise ever since — including now to Donald J. Trump's vice-presidential pick.  —  If you were to build a member of the American elite from scratch, she might look something like Usha Vance.",
    "url": "https://www.nytimes.com/2024/07/15/style/usha-vance-jd-vance.html"
  },
  {
    "text": "‘The VP will take it to JD’: Biden campaign pushes Vance to debate Kamala Harris  —  WASHINGTON — Vice President Kamala Harris is ready to debate J.D. Vance.  —  That was the main subject of a Biden campaign afternoon call on Monday shortly after Donald Trump publicly named the Ohio senator as his running mate.",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/07/15/biden-campaign-wants-jd-vance-kamala-harris-debate/74415507007/"
  },
  {
    "text": "Trump's classified documents case dismissed by Judge Aileen Cannon  —  The Florida judge accepted a long-shot legal argument, embraced by conservatives, that special counsel Jack Smith was improperly appointed.  —  The federal judge overseeing the classified documents charges … ",
    "url": "https://www.washingtonpost.com/national-security/2024/07/15/trump-classified-trial-dismisssed-cannon/"
  },
  {
    "text": "Judge Aileen Cannon does Trump's bidding in dismissing Mar-a-Lago case  —  A day bookended by reminders that Donald Trump expects and rewards obedience — from Cannon's Florida ruling to Trump's VP pick, J.D. Vance.  —  U.S. District Judge Aileen Cannon is a Trump appointee who rules … ",
    "url": "https://www.lawdork.com/p/cannon-dismisses-mar-a-lago-case"
  },
  {
    "text": "‘Unity’ Doesn't Mean Covering Up the Truth About Donald Trump  —  TELL IT LIKE IT IS  —  It doesn't violate President Biden's admonition that we take the temperature down in U.S. politics to describe a fascist as a fascist, or a coup instigator as a coup instigator. … Donald Trump is a changed man.",
    "url": "https://www.thedailybeast.com/unity-doesnt-mean-covering-up-the-truth-about-donald-trump"
  },
  {
    "text": "Donald Trump's New Mr. Nice Guy Act Doesn't Even Last A Day  —  AND JUST LIKE THAT  —  He was Lazarus.  He was spiritual.  “Getting shot in the face changes a man.”  And then he took to Truth Social. … Well that didn't last long.  —  Throughout Sunday and overnight into Monday morning … ",
    "url": "https://www.thedailybeast.com/donald-trumps-new-unity-platform-doesnt-even-last-a-day"
  },
  {
    "text": "Mystery Over Trump's Diagnosis and Treatment After Assassination Attempt  —  UNANSWERED QUESTIONS  —  Trump was taken to Butler Memorial Hospital close to where the attack happened, but no details have been officially released.  —  Deputy Washington Bureau Chief",
    "url": "https://www.thedailybeast.com/mystery-over-donald-trumps-medical-condition-and-treatment-after-assassination-attempt"
  },
  {
    "text": "Elon Musk has said he plans to commit around $45 million a month to a new super political-action committee backing former President Donald Trump's presidential run, according to people familiar with the matter.  —  Other backers of the group, called America PAC, include Palantir Technologies … ",
    "url": "https://www.wsj.com/politics/elections/elon-musk-has-said-he-is-committing-around-45-million-a-month-to-a-new-pro-trump-super-pac-dda53823"
  },
  {
    "text": "Biden Facing Challenges in Two Must-Win States, Times/Siena Polls Find  —  The polls, taken before the assassination attempt on Donald J. Trump, found President Biden trailing Mr. Trump in Pennsylvania, a swing state critical to his re-election hopes, and slightly ahead in Virginia, a state he won by 10 points in 2020.",
    "url": "https://www.nytimes.com/2024/07/15/us/politics/pennsylvania-virginia-polls-biden-trump.html"
  },
  {
    "text": "Trump met with Robert F. Kennedy Jr. to seek endorsement  —  Former President Donald Trump met this morning in Milwaukee with Robert F. Kennedy Jr. to discuss the possibility of the independent candidate endorsing the Republican nominee, according to multiple people familiar with the huddle.",
    "url": "https://www.politico.com/live-updates/2024/07/15/rnc-live-updates-coverage/trump-met-with-rfk-jr-00168412"
  },
  {
    "text": "‘Get out of here!’  Don Jr. snaps at MSNBC ‘clown’ after tough question on RNC floor  —  Donald Trump Jr., the son of former President Donald Trump, snapped at MSNBC correspondent Jacob Soboroff during a confrontation at the Republican National Convention.  —  As convention proceedings … ",
    "url": "https://www.rawstory.com/donald-trump-jr-msnbc/"
  },
  {
    "text": "‘We are speaking of a failure’: Mayorkas on security at Trump rally  —  Secretary of Homeland Security Alejandro Mayorkas called the security a “failure” at former President Donald Trump's rally where he was nearly assassinated in Butler, Pennsylvania.  Mayorkas says officials are conducting a full review of the situation.",
    "url": "https://www.cnn.com/2024/07/15/politics/video/alejandro-mayorkas-security-failure-trump-rally-digvid"
  },
  {
    "text": "Swing states get prime spots on the RNC convention floor — except one  —  As more than 2,400 delegates gather in Milwaukee for the Republican National Convention, some will have much better seats than others in Fiserv Forum.  —  MILWAUKEE — The live band playing “God Bless the U.S.A.” … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/15/republican-national-convention-floor-maps/"
  },
  {
    "text": "Firefighter Corey Comperatore's widow refused Biden call after Trump rally shooting: 'Didn't want to talk to him'  —  SARVER, Pa. — The heartbroken widow of Corey Comperatore, the hero firefighter shot dead by a sniper at a Trump rally, wanted nothing to do with President Biden when he called after the tragedy, she told The Post.",
    "url": "https://nypost.com/2024/07/15/us-news/corey-comperatores-widow-refused-biden-call-after-trump-rally-shooting/"
  }
]