[
  {
    "text": "Wall Street opposition to Trump collapses, as ‘pipe dream’ of primary defeat ends  — Many Wall Street executives have made a calculated decision not to speak out against Donald Trump, and in some cases they will consider supporting the Republican former president.",
    "url": "https://www.cnbc.com/2024/01/22/wall-street-opposition-to-trump-collapses-as-pipe-dream-of-primary-defeat-ends.html"
  },
  {
    "text": "Senate Democrat: GOP presidential candidates want to end democracy  —  Sen. Maggie Hassan (D-N.H.) on Sunday dug into the GOP presidential candidates, claiming the group of three — at the time — White House hopefuls would “all undermine democracy.”  —  Speaking on NBC's “Meet The Press” … ",
    "url": "https://thehill.com/homenews/campaign/4421250-maggie-hassan-gop-presidential-candidates-end-democracy/"
  },
  {
    "text": "Is Nikki Haley the Real Frontrunner?  —  A reader in New Hampshire emailed me Saturday and said that in that day's mail, he had received no fewer than twelve mailings asking for his vote in Tuesday's primary.  He said that wasn't unusual this close to the big day, but that what struck … ",
    "url": "https://pjmedia.com/robert-spencer/2024/01/21/is-nikki-haley-the-real-frontrunner-n4925707"
  },
  {
    "text": "Biden campaign features OB-GYN who left Texas for abortion in new ad  —  President Biden's reelection campaign on Monday dropped an ad to mark the 51st anniversary of Roe v. Wade that features an OB-GYN who couldn't receive an abortion in Texas after the landmark law was overturned",
    "url": "https://thehill.com/homenews/campaign/4421276-biden-campaign-ob-gyn-ad-texas-abortion/"
  },
  {
    "text": "The lawless presidency  —  In Federalist No. 69, Alexander Hamilton explains the key difference between the “king of Great Britain” and the “President of the United States.”  A king, Hamilton explains, is “sacred and inviolable” and “there is no constitutional tribunal to which he is amenable.”",
    "url": "https://popular.info/p/the-lawless-presidency"
  },
  {
    "text": "Polls Show Trump Could Be Doomed If He's Convicted.  Will a Trial Happen in Time?  —  Here's the real timeline for Trump's criminal trials.  —  This sketch depicts former President Donald Trump (right) listening as his attorney D. John Sauer speaks before the D.C. Circuit Court of Appeals … ",
    "url": "https://www.politico.com/news/magazine/2024/01/22/trump-jan-6-trial-polls-00136688"
  },
  {
    "text": "'It's embarrassing': Republicans worry they have no achievements to run on in 2024  —  Rep. Chip Roy, R-Texas, has openly questioned whether the GOP deserves to keep the House majority, lamenting the lack of accomplishments this Congress.  He's not alone.  —  WASHINGTON — When Congress began … ",
    "url": "https://www.nbcnews.com/politics/2024-election/s-embarrassing-republicans-worry-no-achievements-run-2024-rcna131902"
  },
  {
    "text": "Families condemn Koch brothers over ploy to avoid asbestos compensation  —  Georgia-Pacific, owned by Koch Industries, employ controversial legal tactic to circumvent paying millions to sickened workers  —  Asbestos victims, their families and attorneys are claiming a Koch Industries-owned company … ",
    "url": "https://www.theguardian.com/us-news/2024/jan/22/koch-brothers-asbestos-georgia-pacific"
  },
  {
    "text": "Fake Joe Biden robocall tells New Hampshire Democrats not to vote on Tuesday  —  The call, an apparent imitation or digital manipulation of the president's voice, says, “Voting this Tuesday only enables the Republicans in their quest to elect Donald Trump again.”",
    "url": "https://www.nbcnews.com/politics/2024-election/fake-joe-biden-robocall-tells-new-hampshire-democrats-not-vote-tuesday-rcna134984"
  },
  {
    "text": "Donald Trump's Campaign Cuts Off Access After Refusing To Allow NBC News' Vaughn Hillyard As Designated Pool Reporter  —  Donald Trump's campaign refused to agree to let an NBC News correspondent travel with him on New Hampshire campaign stops today as the designated pool reporter, leading to access being cut off for the day.",
    "url": "https://deadline.com/2024/01/donald-trumps-campaign-cuts-off-access-after-refusing-to-allow-nbc-news-vaughn-hillyard-as-designated-pool-reporter-1235799928/"
  },
  {
    "text": "Saudi Arabia's top diplomat says it won't recognize Israel without a path to a Palestinian state  —  Saudi Arabia's foreign minister says the kingdom will not normalize relations with Israel or contribute to Gaza's reconstruction without a credible pathway to a Palestinian state.",
    "url": "https://apnews.com/article/israel-hamas-war-news-01-22-2024-d092205024c6064eb0440f0bfe06657f"
  },
  {
    "text": "House Jan. 6 Committee deleted more than 100 encrypted files days before GOP took majority: sources  —  Loudermilk is demanding then-Jan. 6 Chairman Thompson provide passwords for encrypted files  —  Read this article for free!  —  Plus get unlimited access to thousands of articles, videos and more with your free account!",
    "url": "https://www.foxnews.com/politics/house-committee-jan-6-deleted-encrypted-117-files-was-required-share-house-gop-sources"
  },
  {
    "text": "Far-right AfD leader vows to campaign for Brexit-style EU exit vote in Germany  —  Alice Weidel says UK departure is model for her country as party struggles with reaction to exposé about deportation ‘masterplan’  —  The leader of Germany's far-right Alternative für Deutschland … ",
    "url": "https://www.theguardian.com/world/2024/jan/22/germany-far-right-afd-leader-alice-weidel-eu-exit-campaign"
  },
  {
    "text": "Nikki Haley's word salad extremism  —  She's trying to dupe people and mostly failing. … Even with Ron DeSantis out of the race, Nikki Haley will not be the Republican Party's nominee for president.  But she will go down in history as one of the nation's most prolific purveyors of word salad.",
    "url": "https://www.publicnotice.co/p/nikki-haley-abortion-racist-country-comments"
  },
  {
    "text": "South Carolina Sen. Tim Scott, a possible VP pick, is engaged to be married  —  His fiancée Mindy Noce wore an engagement ring to church in South Carolina this morning, following an engagement last night on Kiawah Island  —  Sen. Tim Scott (R-S.C.), a former presidential candidate … ",
    "url": "https://www.washingtonpost.com/elections/2024/01/21/tim-scott-engaged-vp-trump/"
  },
  {
    "text": "Growing Oct. 7 ‘truther’ groups say Hamas massacre was a false flag  —  In city council hearings, protests and online, a growing movement with ties to Holocaust denial is effacing history in real-time  —  When she first heard about Hamas's Oct. 7 attack on Israel, Mirela Monte was “appalled.”",
    "url": "https://www.washingtonpost.com/technology/2024/01/21/hamas-attack-october-7-conspiracy-israel/"
  }
]