[
  {
    "text": "Trump Moves to Overturn Manhattan Conviction, Citing Immunity Decision  —  Former President Donald J. Trump took the action hours after a U.S. Supreme Court ruling granted him immunity for official acts committed in office.  —  Donald J. Trump began an effort on Monday to throw … ",
    "url": "https://www.nytimes.com/2024/07/01/nyregion/trump-sentence-hush-money.html"
  },
  {
    "text": "Supreme Court Impeachment Plan Released by Alexandria Ocasio-Cortez  —  announced plans to introduce articles of impeachment against the U.S.  —  justices on Monday after the court ruled that presidents have immunity for official actions.  —  The court on Monday ruled that former presidents … ",
    "url": "https://www.newsweek.com/supreme-court-justices-impeachment-aoc-1919728"
  },
  {
    "text": "The President Can Now Assassinate You, Officially  —  Under this new standard, a president can go on a four-to-eight year crime spree and then retire from public life, never to be held accountable.  —  Pocket  —  Welp, Donald Trump won.  The Supreme Court today ruled that presidents are entitled to … ",
    "url": "https://www.thenation.com/article/society/trump-immunity-supreme-court/"
  },
  {
    "text": "The Supreme Court Puts Trump Above the Law  —  And gives him permission for a despotic second term.  —  Near the top of their sweeping, lawless opinion in Trump v. United States, Donald Trump's defenders on the Supreme Court repeat one of the most basic principles of American constitutional government … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/07/supreme-court-donald-trump-immunity-decision/678859/"
  },
  {
    "text": "Ruling Further Slows Trump Election Case but Opens Door to Airing of Evidence  —  The Supreme Court's immunity decision directed the trial court to hold hearings on what portions of the indictment can survive — a possible chance for prosecutors to set out their case in public before Election Day.",
    "url": "https://www.nytimes.com/2024/07/01/us/politics/supreme-court-immunity-trump-jan-6.html"
  },
  {
    "text": "Supreme Court says Trump has absolute immunity for core acts only  —  The U.S. Supreme Court, in a 6-3 decision along ideological lines, ruled that a former president has absolute immunity for his core constitutional powers — and is entitled to a presumption of immunity for his official acts, but lacks immunity for unofficial acts.",
    "url": "https://www.npr.org/2024/07/01/nx-s1-5002157/supreme-court-trump-immunity"
  },
  {
    "text": "Trump Immunity Ruling Will Be John Roberts' Legacy to American Democracy  —  This is part of Opinionpalooza, Slate's coverage of the major decisions from the Supreme Court this June.  Alongside Amicus, we kicked things off this year by explaining How Originalism Ate the Law.",
    "url": "https://slate.com/news-and-politics/2024/07/supreme-court-trump-immunity-john-roberts-legacy.html"
  },
  {
    "text": "Thomas uses Trump immunity ruling to question Jack Smith appointment  —  Echoing a long-shot argument made by Donald Trump's attorneys in Florida, Justice Clarence Thomas said special counsels need Senate confirmation.  —  Supreme Court Justice Clarence Thomas tackled a question … ",
    "url": "https://www.washingtonpost.com/national-security/2024/07/01/clarence-thomas-jack-smith-special-counsel-immunity/"
  },
  {
    "text": "Rep. Spartz charged with weapons violation at DC airport  —  U.S. Rep. Spartz charged with airport weapons violation  —  (WISH) — U.S. Rep. Victoria Spartz has been charged with a weapons violation at Dulles International Airport in Washington, D.C.  —  A spokesperson for Metropolitan … ",
    "url": "https://www.wishtv.com/news/politics/rep-spartz-charged-with-weapons-violation-at-dc-airport/"
  },
  {
    "text": "Unsealed: Jeffrey Epstein's grand jury records now viewable online  —  The records have long been sealed due to state limitations on exposing grand jury evidence.  Lawmakers passed narrowly tailored legislation in February to circumvent those restrictions.  —  More than 150 transcript pages … ",
    "url": "https://floridapolitics.com/archives/682400-unsealed-jeffrey-epsteins-grand-jury-records-now-viewable-online/"
  },
  {
    "text": "Supreme Court lets a truck stop sue the Federal Reserve in latest threat to agency regulations  —  The Supreme Court on Monday revived a lawsuit by a North Dakota truck stop that is challenging the fees banks can charge for debit-card transactions in a ruling that could have deeper implications for other government regulations.",
    "url": "https://www.cnn.com/2024/07/01/politics/corner-post-sec-supreme-court/"
  },
  {
    "text": "Trump Amplifies Calls to Jail Top Elected Officials, Invokes Military Tribunals  —  A post that Mr. Trump circulated on Sunday called for Liz Cheney to be prosecuted by a military court reserved for enemy combatants and war criminals.  —  Former President Donald J. Trump over the weekend escalated … ",
    "url": "https://www.nytimes.com/2024/07/01/us/politics/trump-liz-cheney-treason-jail.html"
  },
  {
    "text": "Midjourney is creating Donald Trump pictures when asked for images of ‘the president of the United States’  —  This is in spite of Midjourney's self-imposed ban on creating Trump and Biden images ahead of the US presidential election.  —  Midjourney, a popular AI-powered image generator … ",
    "url": "https://www.engadget.com/midjourney-is-creating-donald-trump-pictures-when-asked-for-images-of-the-president-of-the-united-states-212427937.html"
  },
  {
    "text": "Democrats Weigh Mid-July Vote to Formally Tap Biden as Nominee  —  The Democratic National Committee is considering formally nominating Joe Biden as early as mid-July to ensure that the president is on November ballots, while helping to stamp out intra-party chatter of replacing him after last week's poor debate performance.",
    "url": "https://www.bloomberg.com/news/articles/2024-07-01/democrats-weigh-early-biden-nomination-to-squash-talk-of-a-swap"
  },
  {
    "text": "S.F. becomes first California city to miss its housing goals.  The impact will be massive  —  The majority of housing projects in San Francisco will now be eligible for over-the-counter approval, thanks to the activation of a new state law that eliminates the city's famously contentious land-use battles … ",
    "url": "https://www.sfchronicle.com/sf/article/s-f-housing-goals-19545405.php"
  },
  {
    "text": "We're Going to Have to Talk About President Joe Biden, Candidate  —  The Brokered Convention is a glorious fantasy for people who cover politics and know absolutely nothing about political history.  —  As reluctant as I am to join the general scrum that resulted from the president's desultory performance … ",
    "url": "https://www.esquire.com/news-politics/politics/a61477104/democrats-biden-president-race/"
  },
  {
    "text": "Federal court blocks Biden's pause on approving gas export projects  —  The decision deals the latest legal blow to President Biden's climate agenda after a string of Supreme Court rulings last week.  —  A federal court on Monday blocked the Biden administration's pause on approving … ",
    "url": "https://www.washingtonpost.com/climate-environment/2024/07/01/liquefied-natural-gas-exports-court-ruling/"
  }
]