[
  {
    "text": "Trump Calls for Recusal of Judge as His Lawyer Denies Pence's 2020 Claims  —  Former President Donald J. Trump spent the weekend on the attack on Truth Social while his lawyer, John F. Lauro, ran through a gantlet of interviews Sunday morning.  —  Appearing on five television networks Sunday morning … ",
    "url": "https://www.nytimes.com/2023/08/06/us/politics/trump-lawyer-pence-truth-social.html"
  },
  {
    "text": "CBS News poll finds after latest Trump indictment, many Americans see implications for democracy.  For some, it's personal  —  America's response to this week's indictment of Donald Trump is providing a window into more than just how Americans view his alleged actions per se … ",
    "url": "https://www.cbsnews.com/news/trump-indictment-jan-6-opinion-poll-2023-08-06/"
  },
  {
    "text": "If Trump committed ‘a technical violation of the Constitution,’ it's not a crime, his lawyer says  —  Later on NBC's “Meet the Press,” Rep. Jamie Raskin, who sat on the House panel that investigated the Capitol riot, said Lauro's argument was “deranged.”  —  Chuck Todd pushes … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/donald-trump-2020-election-indictment-lawyer-john-lauro-rcna98406"
  },
  {
    "text": "‘Of course he lost’: Ron DeSantis rejects Trump's 2020 election claims  —  Florida Gov. Ron DeSantis on Sunday rejected Donald Trump's claim that he was the true winner of the 2020 presidential election in his most forceful comments to date on the matter.  —  “Whoever puts their hand … ",
    "url": "https://www.nbcnews.com/politics/2024-election/ron-desantis-of-course-trump-lost-2020-election-rcna98200"
  },
  {
    "text": "Trump says he'll seek a new judge in election case  — Trump on Sunday called for recusal of the judge presiding over the federal case that alleges he illegally conspired to overturn his election loss in 2020.  — He claimed there is “NO WAY HE CAN GET A FAIR TRIAL,” in a post on his social media site.",
    "url": "https://www.cnbc.com/2023/08/06/trump-says-hell-seek-a-new-judge-in-election-case-.html"
  },
  {
    "text": "Playbook: Welcome to the courtroom campaign  —  With help from Eli Okun and Garrett Ross  —  DRIVING THE DAY  —  DeSANTIS SPEAKS ... TO NBC!  — RON DeSANTIS's campaign boycott of NBC News is over.  The governor sat down with Dasha Burns for an interview that was just posted and will air … ",
    "url": "https://www.politico.com/newsletters/playbook/2023/08/07/welcome-to-the-courtroom-campaign-00110068"
  },
  {
    "text": "There's a Good Reason Trump Aides Don't Think the New Indictment Is a Joke  —  A number of Donald Trump's current aides are involved in the latest case against their boss.  That could put them in some very difficult positions. … Donald Trump has publicly joked about the four latest felony charges brought against him.",
    "url": "https://www.thedailybeast.com/theres-a-good-reason-trump-aides-dont-think-the-new-indictment-is-a-joke"
  },
  {
    "text": "The Pelosi Factor … If you were going to draw up a list of the people most responsible for the latest indictment of Donald Trump, the former president himself would be at the top, followed by the prosecutors who have brought the case.  Republicans in Congress perversely deserve a great deal of credit … ",
    "url": "https://nymag.com/intelligencer/2023/08/how-nancy-pelosi-long-game-led-to-trumps-indictment.html"
  },
  {
    "text": "Russian and Chinese ships patrolled ‘near Alaska’ but were not ‘a threat’: US officials  —  Four destroyers and P-8 aircraft were deployed to shadow the formation.  —  A Russian and Chinese naval formation patrolled “near Alaska” last week but “was not considered a threat,” U.S. Northern Command said Sunday.",
    "url": "https://abcnews.go.com/Politics/russian-chinese-ships-patrolled-alaska-threat-us-officials/story?id=102058344"
  },
  {
    "text": "On January 19, 2022, SCOTUS Upheld Judge Tanya Chutkan's Decision Rejecting Trump's Executive Privilege Claims  —  On November 9, 2021, Judge Tanya Chutkan — the judge who randomly got assigned to Trump's January 6 prosecution — rejected Trump's request to enjoin the Archives from turning over documents to the January 6 Committee.",
    "url": "https://www.emptywheel.net/2023/08/06/on-january-19-2022-scotus-upheld-judge-tanya-chutkans-decision-rejecting-trumps-executive-privilege-claims/"
  },
  {
    "text": "Exclusive: North Korean hackers breached top Russian missile maker  —  An elite group of North Korean hackers secretly breached computer networks at a major Russian missile developer for at least five months last year, according to technical evidence reviewed by Reuters and analysis by security researchers.",
    "url": "https://www.reuters.com/technology/north-korean-hackers-breached-top-russian-missile-maker-2023-08-07/"
  },
  {
    "text": "Racism at heart of US failure to tackle deadly heatwaves, expert warns  —  Racism is at the heart of the American government's failure to tackle the growing threat of deadly heatwaves, according to the author of an authoritative new book on the heating planet.",
    "url": "https://www.theguardian.com/environment/2023/aug/06/jef-goodell-heatwaves-racism-the-heat-will-kill-you-first-book"
  },
  {
    "text": "Kamala Harris Takes on a Forceful New Role in the 2024 Campaign  —  The vice president is trying to reclaim the momentum that propelled her to Joseph R. Biden Jr.'s side as a candidate and into the White House in 2020.  —  Reporting from Washington  —  In recent weeks, Vice President Kamala Harris … ",
    "url": "https://www.nytimes.com/2023/08/06/us/politics/kamala-harris-prosecutor.html"
  },
  {
    "text": "Black mayor of tiny Alabama town says he was ousted by his White predecessor  —  Patrick Braxton accomplished something no Black man in his Alabama town had done in its 166-year history: he became mayor.  —  He told CNN he ran for office in 2020 to serve the fewer than 300 residents of Newbern … ",
    "url": "https://www.cnn.com/2023/08/06/us/newbern-alabama-mayor-dispute/"
  },
  {
    "text": "Republican Attacks on ‘Woke’ Ideology Falling Flat With G.O.P. Voters  —  New polling shows national Republicans and Iowa Republican caucusgoers were more interested in “law and order” than battling “woke” schools, media and corporations.  —  When it comes to the Republican primaries, attacks on “wokeness” may be losing their punch.",
    "url": "https://www.nytimes.com/2023/08/06/us/politics/woke-republicans-poll.html"
  }
]