[
  {
    "text": "Trump escalates gendered personal insults against Harris, defying GOP pressure  —  The Republican nominee also stoked Democrats' rift over Israel by baselessly claiming Harris passed over Gov. Josh Shapiro to be her running mate because he is Jewish.  —  WILKES-BARRE, Pa. … ",
    "url": "https://www.washingtonpost.com/politics/2024/08/17/trump-harris-presidential/"
  },
  {
    "text": "Democrats still might invoke the 25th Amendment to make Harris president  —  Politics aside, it's understandable that some now view President Joe Biden as a “broken man,” walking alone in a deep valley of depression, confusion and anger.  One day he is declaring that he is the Democratic nominee … ",
    "url": "https://thehill.com/opinion/campaign/4831471-democrats-might-invoke-the-25th-amendment-to-make-harris-president/"
  },
  {
    "text": "Trump tries to undermine Harris' legitimacy as a candidate  —  “Why is she going to the convention?  Because it's a rigged convention, obviously,” he said.  —  For former President Donald Trump, the 2024 race is a contest between him and Vice President Kamala Harris.  And President Joe Biden.",
    "url": "https://www.politico.com/news/2024/08/17/trump-rally-pennsylvania-kamala-harris-rigged-00174502"
  },
  {
    "text": "Trump campaign attempts to reset with candidate who sometimes has his own plans  —  Kamala Harris's entry into the race has scrambled Donald Trump's plans and revived concerns about whether he can focus his attacks.  —  Donald Trump's top brass gathered reporters in West Palm Beach, Fla. … ",
    "url": "https://www.washingtonpost.com/politics/2024/08/17/trump-campaign-harris/"
  },
  {
    "text": "Trump Jabs Harris on Inflation Before Pivoting to Her Laugh  — Trump says he's been told to ‘be nice’ in references to Harris  — Harris and Walz also visiting Pennsylvania ahead of convention  —  Former President Donald Trump sought to tie Vice President Kamala Harris … ",
    "url": "https://www.bloomberg.com/news/articles/2024-08-17/trump-jabs-harris-on-inflation-before-pivoting-to-her-laugh"
  },
  {
    "text": "You Should Know  —  I flagged this on social media.  But I wanted to make sure you knew.  Trump just announced a “crime and safety” rally for next Tuesday in Howell, Michigan, a town that has been heavily associated with the KKK for decades.  Indeed, just late last month White Supremacists marched … ",
    "url": "https://talkingpointsmemo.com/edblog/you-should-know"
  },
  {
    "text": "‘Things I Trust More Than Donald Trump’ List Goes Viral: ‘Dinner with Jeffrey Dahmer’  —  ‘A CASEY ANTHONY DAYCARE’  —  When “The View” co-host Anna Navarro posted the list to her Instagram account, numerous social media users added their own comments.  —  A viral list called … ",
    "url": "https://www.thedailybeast.com/the-view-co-host-anna-navarro-posts-things-i-trust-more-than-donald-trump-list"
  },
  {
    "text": "Inciting rioters in Britain was a test run for Elon Musk.  Just see what he plans for America  —  The presidential election is three months away.  What if the billionaire contests the result?  What if he decides democracy is over-rated?  —  Just over four years ago … ",
    "url": "https://www.theguardian.com/commentisfree/article/2024/aug/18/inciting-rioters-in-britain-was-a-test-run-for-elon-musk-just-see-what-he-plans-for-america"
  },
  {
    "text": "Willie Brown to Donald Trump: Mention My Name Again and Get Sued  —  The former president has falsely claimed that he nearly died in a helicopter ride with Mr. Brown, and that Mr. Brown said “terrible things” about Kamala Harris.  —  Willie Brown, the former mayor of San Francisco … ",
    "url": "https://www.nytimes.com/2024/08/17/us/politics/willie-brown-donald-trump-sue-lawsuit.html"
  },
  {
    "text": "Mark Robinson, Who Often Calls Abortion Murder: ‘We Had an Abortion’  —  The North Carolina Republican gubernatorial candidate previously said mass shootings were karma for the “murder of infants” … He compared supporters of reproductive rights to people who fought to preserve slavery.",
    "url": "https://www.rollingstone.com/politics/politics-features/mark-robinson-abortion-murder-north-carolina-1235082406/"
  },
  {
    "text": "Election Countdown, 80 Days to Go: Media Failure Reaches a Turning Point.  —  The tone of American politics may finally be brightening.  Maybe the mainstream press will recognize that a time for change has come for it as well.  —  ∙ Paid  —  This post is about a recent convergence of articles … ",
    "url": "https://fallows.substack.com/p/election-countdown-80-days-to-go"
  },
  {
    "text": "Ohio lawmaker: Vance ‘not good for Ohio’ and ‘not good for America’  —  Rep. Joyce Beatty (D-Ohio) went after her fellow Ohioan and current Republican vice presidential nominee, Sen. JD Vance, saying he “is not good for Ohio” in an interview Saturday.  —  “JD Vance is not good for Ohio … ",
    "url": "https://thehill.com/homenews/campaign/4832987-ohio-lawmaker-vance-not-good-for-ohio-and-not-good-for-america/"
  },
  {
    "text": "Harris Campaign Reserves $370 Million for Swing-State Fall Ad Blitz  —  $200 million of that will be spent to reach voters on their phones and other devices, as Kamala Harris's aides race to define her while drawing a contrast with Donald Trump.  —  Vice President Kamala Harris's campaign announced … ",
    "url": "https://www.nytimes.com/2024/08/17/us/politics/kamala-harris-ads.html"
  },
  {
    "text": "Election 2024 live updates  —  Trump holding rally in Pennsylvania; Tim Walz spoke in suburban Omaha  —  Former president Donald Trump is campaigning this afternoon in Wilkes-Barre, Pa., about 20 miles from President Joe Biden's birthplace of Scranton.  Minnesota Gov. Tim Walz (D) … ",
    "url": "https://www.washingtonpost.com/politics/2024/08/17/2024-election-campaign-updates-harris-trump/"
  },
  {
    "text": "VP Kamala Harris' stepdaughter Ella Emhoff pushes ketamine, ‘shorter work days’ in ‘pain management’ rant  —  Vice President Kamala Harris' stepdaughter, Ella Emhoff, revealed this week that she grew up with a spinal condition that caused a “hunchback” - and suggested using the controversial drug ketamine … ",
    "url": "https://nypost.com/2024/08/17/us-news/vp-kamala-harris-stepdaughter-ella-emhoff-pushes-ketamine-shorter-work-days-in-pain-management-rant/"
  },
  {
    "text": "VFW Condemns Donald Trump's ‘Asinine’ Comments About Medal of Honor  —  “It is even more disappointing when these comments come from a man who already served in this noble office and frankly should already know better”  —  Veterans of Foreign Wars (VFW), the country's largest veterans advocacy group … ",
    "url": "https://www.rollingstone.com/politics/politics-news/vfw-condemn-donald-trump-asinine-comments-medal-of-honor-1235082395/"
  },
  {
    "text": "Her name was on a filing agreeing to be a Cornel West elector.  Her question: What's an elector?  —  When Denisha Mitchell was asked why she filled out paperwork to serve as an Arizona elector for the independent presidential candidate Cornel West, her first response was “What?!”  Her second: What's an elector?",
    "url": "https://apnews.com/article/ballot-deception-cornel-west-conservatives-0d2c94da68bbd136442e63edadf14398"
  }
]