[
  {
    "text": "Top House Democrats Throw Chuck Schumer Under The Bus Amid Funding Fight  —  “This false choice that some are buying instead of fighting is unacceptable,” Rep. Nancy Pelosi said as Schumer cast his vote for an extreme GOP spending bill.  —  WASHINGTON - Top House Democrats … ",
    "url": "https://www.huffpost.com/entry/nancy-pelosi-chuck-schumer-hakeem-jeffries-government-shutdown_n_67d473ece4b034e451a5db9f"
  },
  {
    "text": "‘A Really Easy Mark for Trump’: Three Columnists on the Threats to Elite Colleges  —  Patrick Healy, the deputy Opinion editor, hosted an online conversation with the Times Opinion columnists M. Gessen, Tressie McMillan Cottom and Bret Stephens about Donald Trump's attacks on Columbia University … ",
    "url": "https://www.nytimes.com/2025/03/15/opinion/trump-higher-education.html"
  },
  {
    "text": "Colleges Are Under Attack.  They Can Fight Back.  —  When a political leader wants to move a democracy toward a more authoritarian form of government, he often sets out to undermine independent sources of information and accountability.  The leader tries to delegitimize judges … ",
    "url": "https://www.nytimes.com/2025/03/15/opinion/trump-research-cuts.html"
  },
  {
    "text": "Trump Orders Gutting of 7 Agencies, Including Voice of America's Parent  —  The order targeting the agencies, largely obscure entities that address issues like labor mediation and homelessness prevention, appeared to test the bounds of the president's power.",
    "url": "https://www.nytimes.com/2025/03/15/us/politics/trump-order-voice-of-america.html?unlocked_article_code=1.4E4.gU4N.aG0u4sAo_cSa&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Trump calls his opponents ‘scum’ and lawbreakers in bellicose speech at Justice Department  —  For more than an hour, he delivered an insult-laden speech that shattered the traditional notion of DOJ independence.  —  President Donald Trump on Friday walked into the Department of Justice … ",
    "url": "https://www.politico.com/news/2025/03/14/trump-doj-speech-prison-opponents-00231438"
  },
  {
    "text": "Green card holder from New Hampshire ‘interrogated’ at Logan Airport, detained  —  A New Hampshire man with a green card was detained by immigration officers at Logan Airport and is being held by U.S. Immigration and Customs Enforcement at the Donald W. Wyatt detention facility in Central Falls, Rhode Island.",
    "url": "https://www.nhpr.org/nh-news/2025-03-14/green-card-holder-from-new-hampshire-interrogated-at-logan-airport-detained"
  },
  {
    "text": "She saw family in Lebanon.  Now this Brown Medicine doctor is being held at Logan for deportation. … A Rhode Island doctor who traveled home to Lebanon to visit family was prevented by U.S. Customs officials from reentering the country on Thursday at Boston's Logan International Airport … ",
    "url": "https://www.providencejournal.com/story/news/local/2025/03/14/brown-medicine-doctor-told-shes-being-deported-after-trip-to-lebanon/82418182007/"
  },
  {
    "text": "R.I. doctor prevented from returning to US after visiting her parents in Lebanon  —  Dr. Rasha Alawieh works at Brown Medicine and Rhode Island Hospital, and she had secured an H-1B visa, her lawyer said  —  PROVIDENCE — A Rhode Island doctor who had traveled to Lebanon to see her parents … ",
    "url": "https://www.bostonglobe.com/2025/03/14/metro/ri-doctor-prevented-from-returning-to-us-after-visiting-parents-in-lebanon/"
  },
  {
    "text": "Trump Administration Expels South Africa's Ambassador to the U.S.  —  Secretary of State Marco Rubio had lashed out on social media over comments critical of President Trump that the ambassador had made to a think tank in Johannesburg.  —  President Trump's administration … ",
    "url": "https://www.nytimes.com/2025/03/14/us/politics/south-africa-ambassador-marco-rubio.html"
  },
  {
    "text": "Elon Musk Shared, Then Removed a Post Absolving Dictators for Genocide  —  The post falsely claimed that Joseph Stalin, Adolf Hitler and Mao Zedong were not responsible for the murders of millions of people, but rather public sector workers were.  —  Early on Friday, Elon Musk shared … ",
    "url": "https://www.nytimes.com/2025/03/14/technology/elon-musk-x-post-hitler-stalin-mao.html?unlocked_article_code=1.4E4.RW-P.VV-Qk7n8s5HK&smid=bs-share"
  },
  {
    "text": "Trump Expands Attacks on Law Firms, Singling Out Paul, Weiss  —  Experts have warned that the president's efforts threaten the ability of lawyers to do their jobs and private citizens to obtain legal counsel.  —  President Trump on Friday opened a third attack against a private law firm … ",
    "url": "https://www.nytimes.com/2025/03/14/us/politics/trump-law-firm.html?unlocked_article_code=1.4E4.DSe8.9w4654cpMXpr&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Walz, Newsom and Buttigieg Are Among Democrats Stirring 2028 Presidential Chatter  —  Tim Walz was in Iowa.  JB Pritzker's heading to New Hampshire.  Pete Buttigieg is keeping his options open.  It's far too early to run for president, but some Democrats seem to be exploring the idea.",
    "url": "https://www.nytimes.com/2025/03/15/us/politics/democrats-president-2028-buttigieg-newsom-walz.html"
  },
  {
    "text": "A majority-Black town starts armed protection group after neo-Nazi rally  —  “I feel like it's more secure now,” one woman said.  “I know my son can walk home and be OK.”  —  LINCOLN HEIGHTS, Ohio — Nearly every morning for the last month, Jay has been waking up before sunrise to drive around … ",
    "url": "https://www.nbcnews.com/news/nbcblk/lincoln-heights-ohio-armed-protection-group-neo-nazi-rally-rcna196240"
  },
  {
    "text": "Addressing Risks from Paul Weiss  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:  —  Section 1.  Background.  Global law firms have for years played an outsized role in undermining the judicial process … ",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/03/addressing-risks-from-paul-weiss/"
  },
  {
    "text": "Musk Said No One Has Died Since Aid Was Cut.  That Isn't True.  —  Mr. Kristof reported from South Sudan and Nairobi, Kenya.  Ms. Fezehai is a photographer and visual journalist based in Kenya.  —  As the world's richest men slash American aid for the world's poorest children, they insist that all is well.",
    "url": "https://www.nytimes.com/interactive/2025/03/15/opinion/foreign-aid-cuts-impact.html?unlocked_article_code=1.4E4.H8Lx.GD39rucUfloD&smid=url-share"
  },
  {
    "text": "Draft List for New Travel Ban Proposes Trump Target 43 Countries  —  A draft circulating inside the administration lists three tiers of countries whose citizens may face restrictions on entering the United States.  —  The Trump administration is considering targeting the citizens … ",
    "url": "https://www.nytimes.com/2025/03/14/us/politics/trump-travel-ban.html"
  },
  {
    "text": "Newborn babies exposed to measles in Texas hospital  —  Infants barely three days old are receiving antibody injections to help protect against the virus.  Nearly 300 cases have been reported in the outbreak.  —  On Wednesday, a woman gave birth in a Lubbock, Texas, hospital in the middle … ",
    "url": "https://www.nbcnews.com/health/health-news/texas-measles-outbreak-hospital-newborn-babies-exposed-rcna196519"
  },
  {
    "text": "The head of Trump's antisemitism task force just re-posted two antisemitic X accounts  —  Leo Terrell, the Department of Justice lawyer who heads the Federal Task Force to Combat Antisemitism, has made multiple appearances on the network and other conservative outlets to unapologetically press … ",
    "url": "https://www.rawstory.com/raw-investigates/leo-terrell/"
  },
  {
    "text": "Boehler withdraws nomination as special presidential envoy for hostages affairs  —  Adam Boehler, who oversaw unprecedented direct negotiations with Hamas on behalf of President Trump, has withdrawn his nomination for the position of special presidential envoy for hostage affairs, according to two White House officials.",
    "url": "https://www.axios.com/2025/03/15/adam-boehler-nomination-special-presidential-envoy-hostages"
  }
]