[
  {
    "text": "Trump's mug shot is released, a first in his four criminal cases this year.  —  The former president spent about 20 minutes at the Fulton County Jail, submitting to some of the routines of criminal defendant intake.  He was fingerprinted and had his photo taken.",
    "url": "https://www.nytimes.com/2023/08/24/us/politics/trump-mugshot-booking-photo.html"
  },
  {
    "text": "Co-defendant in Georgia says false electors met at Trump's ‘direction’  —  Shawn Still is a Georgia Republican charged alongside the former president in a racketeering conspiracy to subvert the 2020 election.  —  Shawn Still, a Georgia Republican charged alongside former President Donald Trump … ",
    "url": "https://www.politico.com/news/2023/08/24/co-defendant-georgia-trump-indictment-00112932"
  },
  {
    "text": "Trump Lands in Atlanta and Is Expected to Surrender at County Jail  —  The former president shook up his legal team before flying to Georgia on Thursday evening to face racketeering charges.  —  Here are the latest developments in the election interference case.",
    "url": "https://www.nytimes.com/live/2023/08/24/us/trump-georgia-surrender-indictment"
  },
  {
    "text": "Trump says taking a mugshot was 'not a comfortable feeling, especially when you've done nothing wrong'  —  Trump told Fox News Digital in an exclusive interview that officials ‘insisted’ he take a mugshot  —  EXCLUSIVE: Former President Trump said Georgia officials “insisted” … ",
    "url": "https://www.foxnews.com/politics/trump-says-taking-mugshot-was-not-comfortable-feeling-when-done-nothing-wrong"
  },
  {
    "text": "Nikki Haley Is the Best Trump Alternative  —  I have a bunch of friends and acquaintances who are Never Trump, maybe-Trump or kind-of-Trump Republicans.  They've been looking around for the candidate they can support and give their dollars to, somebody who is an antidote to Donald Trump and who can win a general election.",
    "url": "https://www.nytimes.com/2023/08/24/opinion/nikki-haley-republican-debate-winner.html"
  },
  {
    "text": "READ: Trump jail record in Georgia election case  —  Former President Trump surrendered to the Fulton County, Ga., jail on Thursday, where he was formally booked in a process that took only about 22 minutes.  He has been released on a $200,000 bond.  —  Trump also agreed to other release conditions … ",
    "url": "https://thehill.com/homenews/4170478-read-trump-jail-record-in-georgia-election-case/"
  },
  {
    "text": "The Vivek and Nikki Show  —  The orange elephant not in the room  —  Donald Trump's fourth perp walk, Rudy's mugshot, and another assassination by Vladimir Putin.  —  But let's talk about last night, shall we?  —  The Fox News hosts began the presidential debate by asking candidates … ",
    "url": "https://morningshots.thebulwark.com/p/the-vivek-and-nikki-show"
  },
  {
    "text": "Maui utility may have compromised evidence in fire probe, lawyers say  —  The utility removed damaged poles, lines and other equipment from where the Lahaina fire reportedly started, documents show, before investigators were able to view the scene  —  LAHAINA, Hawaii — The Hawaii power utility believed … ",
    "url": "https://www.washingtonpost.com/climate-environment/2023/08/24/maui-fires-power-utility-lahaina-investigation/"
  },
  {
    "text": "Hawaiian Electric shares slide after Maui County sues for damages over deadly wildfires  — Maui County has sued Hawaiian Electric for damages over the deadly wildfires.  — The wildfires have claimed more than a hundred lives and resulted in billions of dollars in estimated property losses.",
    "url": "https://www.cnbc.com/2023/08/24/hawaiian-electric-shares-slide-after-maui-county-sues-for-damages-over-deadly-wildfires.html"
  },
  {
    "text": "Early Intelligence Suggests Prigozhin Was Assassinated, U.S. Officials Say  —  Preliminary findings indicate it wasn't surface-to-air missile that took down Wagner leader's plane  —  The plane carrying Yevgeny Prigozhin, the head of the Wagner paramilitary group, crashed as the result … ",
    "url": "https://www.wsj.com/world/russia/wagner-prigozhin-russia-assassinated-intelligence-3e456fab?mod=djemalertNEWS"
  },
  {
    "text": "US intelligence assessment shows intentionally caused explosion crashed Wagner chief's plane  —  A preliminary U.S. intelligence assessment has found that the plane crash presumed to have killed Wagner leader Yevgeny Prigozhin was intentionally caused by an explosion, according to U.S. and Western officials.",
    "url": "https://apnews.com/article/russia-wagner-prigozhin-jet-crash-382515214f691e47daa2e3635d64e612"
  },
  {
    "text": "Photos: Georgia co-defendants turn themselves in  —  Former President Donald Trump and 18 co-defendants are making their way to Atlanta to be booked after being indicted for their roles in attempting to overturn the 2020 election in Georgia.",
    "url": "https://www.politico.com/gallery/2023/08/24/georgia-election-case-mugshots-00112748"
  },
  {
    "text": "The First Republican Presidential Debate Was Rife With Abortion Misinformation  —  “Abortions on demand,” “born alive abortions” and other fact-free claims were on display at the first GOP debate.  —  LOADING  —  The first Republican presidential debate included a lot of fake news about abortion.",
    "url": "https://www.huffpost.com/entry/republican-presidential-debate-abortion-misinformation_n_64e6c58ee4b0306c321b6c5e"
  },
  {
    "text": "This scholar is pulling back the curtain on race in Shakespeare  —  Farah Karim-Cooper argues that the Bard has a race problem.  But that doesn't mean we have to love him less.  —  LONDON — The green-oak framed indoor theater of Shakespeare's Globe in London, illuminated by candles at showtime is dark and cavernous, even macabre.",
    "url": "https://www.washingtonpost.com/books/2023/08/23/farah-karim-cooper-great-white-bard/"
  },
  {
    "text": "Sheriff investigating bomb threat at Fulton County courthouse  —  The Fulton County Sheriff's Office is investigating a bomb threat at the courthouse.  This was not the location former President Trump appeared at to surrender to authorities.",
    "url": "https://www.nbcnews.com/now/video/sheriff-investigating-bomb-threat-at-fulton-county-courthouse-191552069805"
  },
  {
    "text": "Debate ratings: 12.8 million watched GOP candidates minus Trump battle on Fox News  —  Nearly 13 million people watched the first Republican primary debate on Fox News on Wednesday night, well below the 20 million that tuned into Fox to watch the first GOP primary debate in 2015 — when Donald Trump debuted on the stage.",
    "url": "https://thehill.com/homenews/media/4170110-debate-ratings-12-8-million-watched-gop-candidates-minus-trump-battle-on-fox-news/"
  },
  {
    "text": "RSVP: … About the Stamp  —  The Ruth Bader Ginsburg stamp features an oil painting of her in her black judicial robe and iconic white collar.  The stamp captures her enduring spirit and tireless dedication to upholding the principles of the Constitution.",
    "url": "https://about.usps.com/newsroom/national-releases/2023/0824ma-usps-to-unveil-stamp-honoring-ruth-bader-ginsburg.htm"
  },
  {
    "text": "House Judiciary Committee launches inquiry into Fulton County District Attorney Fani Willis  —  The Republican-led House Judiciary Committee has opened a congressional investigation into Fulton County District Attorney Fani Willis, a development that was first reported by CNN and comes the same … ",
    "url": "https://www.cnn.com/2023/08/24/politics/house-republican-conference-trump-defense/"
  }
]