[
  {
    "text": "Democrats confront their powerlessness as Trump flexes authority  —  Amid Democrats' shock and bickering over how much to respond to President Donald Trump is a deeper question rippling through leaders across the Capitol and across the country: How much should they rely on the same institutional … ",
    "url": "https://www.cnn.com/2025/02/16/politics/democrats-strategy-powerless-trump/"
  },
  {
    "text": "Dems concede Republicans ‘running circles’ around them online as Trump remakes Washington  —  The Democratic response to Trump, one Texas lawmaker said, is “too slow and too tepid and not meeting the moment.”  —  The Department of Government Efficiency created its own account on X last November … ",
    "url": "https://www.politico.com/news/2025/02/16/democrats-losing-trump-doge-information-battle-00204522"
  },
  {
    "text": "Ukraine not attending US-Russia talks in Saudi Arabia, government source tells BBC  —  Summary  — Ukrainian officials will not attend Russia-US talks to be held in Saudi Arabia in the coming days, the BBC has learned  — A government source says Ukraine has not been invited and will not send a delegation",
    "url": "https://www.bbc.com/news/live/crr0gngkjrvt"
  },
  {
    "text": "Trump administration firings hit key office handling bird flu response  —  The layoffs in USDA's National Animal Health Laboratory Network program office come as egg prices reach record high amid worsening outbreak.  —  Laboratories in a national network of 58 facilities responding to the spread … ",
    "url": "https://www.politico.com/news/2025/02/16/trump-administration-firings-bird-flu-response-00204542"
  },
  {
    "text": "Trump Firings Impact ‘Front Line of Surveillance’ for Bird Flu Outbreak  —  While the virus continues to spread, the White House is cutting employees who coordinate testing for the virus … The news comes as the virus poses an increasing risk to humans and has caused egg shortages, leading to skyrocketing egg prices.",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-firings-bird-flu-surveillance-1235269620/"
  },
  {
    "text": "‘A particularly heinous villain’: a disdain for Musk has sparked protests across US  —  50501 group gained national force with Musk as a target and is now working globally to thwart Trump administration  —  Democracy and justice is supported by  —  When protesters showed up at state capitols around … ",
    "url": "https://www.theguardian.com/us-news/2025/feb/16/elon-musk-protests-trump-50501"
  },
  {
    "text": "The Worst and the Dimmest  —  Hey cousins.  The world's richest man held court in the Oval Office this week while his pet president watched from the resolute desk wearing his trademark pants-shitting scowl.  The world's richest man was telling the press lies to repeat while holding his hands … ",
    "url": "https://www.the-reframe.com/the"
  },
  {
    "text": "Auchincloss: Trump ‘replacing the rule of law with the law of the ruler’  —  Rep. Jake Auchincloss (D-Mass.) on Sunday criticized the order from the Trump administration's Justice Department to dismiss the corruption charges against New York City Mayor Eric Adams.",
    "url": "https://thehill.com/homenews/house/5147993-auchincloss-trump-rule-of-law/"
  },
  {
    "text": "Congresswoman Tenney Moves to Make President Trump's Birthday a Federal Holiday  —  Washington, DC - Congresswoman Claudia Tenney (NY-24) today introduced the Trump's Birthday and Flag Day Holiday Establishment Act to officially designate June 14 as a federal holiday to commemorate President Donald J. Trump's Birthday and Flag Day.",
    "url": "https://tenney.house.gov/media/press-releases/congresswoman-tenney-moves-make-president-trumps-birthday-federal-holiday"
  },
  {
    "text": "‘Border Czar’ Doubles Down on Asking If DOJ Should Prosecute AOC for Informing Immigrants of Their Rights  —  “I'm asking the Department of Justice, who are the prosecutors and decide who they prosecute and what the standards of that prosecution is,” Tom Homan said after suggesting “AOC's gonna be in trouble now”",
    "url": "https://www.rollingstone.com/politics/politics-news/border-czar-prosecute-aoc-immigrants-rights-1235269988/"
  },
  {
    "text": "Steve Bannon, US Hospitals Join GOP Rebellion Over Medicaid Cuts  — Medicaid fight threatens passage of Trump's legislative agenda  — Trump tax cuts, spending priorities could hang in the balance  —  A quiet rebellion among Republicans representing working-class and low-income areas … ",
    "url": "https://www.bloomberg.com/news/articles/2025-02-16/steve-bannon-us-hospitals-join-gop-rebellion-over-medicaid-cuts"
  },
  {
    "text": "US Health Department Layoffs Expand to Medicare, FDA  — Employees at CMS, FDA, CDC received notices in weekend cuts  —  The Department of Health and Human Services laid off employees Saturday evening across some of its biggest agencies — the Centers for Medicare and Medicaid Services … ",
    "url": "https://www.bloomberg.com/news/articles/2025-02-16/us-health-department-layoffs-expand-to-medicare-fda"
  },
  {
    "text": "Ed Department: DEI Violates Civil Rights Law  —  In a sweeping and unprecedented letter issued over the weekend, the Office for Civil Rights declared race-based scholarships, cultural centers and even graduation ceremonies illegal.  —  The Education Department's Office for Civil Rights declared … ",
    "url": "https://www.insidehighered.com/news/diversity/race-ethnicity/2025/02/15/trump-admin-threatens-rescind-federal-funds-over-dei"
  },
  {
    "text": "Appeals court rejects Trump in showdown over firing of ethics watchdog  —  The D.C. Circuit panel voted, 2-1, against the president's bid to immediately remove Hampton Dellinger.  —  A divided federal appeals court panel has again turned down President Donald Trump's request to follow through … ",
    "url": "https://www.politico.com/news/2025/02/16/appeals-court-rejects-trump-in-showdown-over-firing-of-ethics-watchdog-00204551"
  },
  {
    "text": "US government tries to rehire nuclear staff it fired days ago  —  The US government is trying to rehire nuclear safety employees it had fired on Thursday, after concerns grew that their dismissal could jeopardise national security, US media reported.  —  The National Nuclear Security Administration … ",
    "url": "https://www.bbc.com/news/articles/c4g3nrx1dq5o"
  },
  {
    "text": "DOGE Mismanagement Principles  —  Sam Rayburn, the Texan who served as House Speaker for 17 years was fond of saying: … Rayburn was talking about policymaking, but the point extends to more broadly to governing.  Trashing government agencies is easy.  Making them work is hard.",
    "url": "https://donmoynihan.substack.com/p/doge-mismanagement-principles"
  }
]