[
  {
    "text": "Jeffries and Schumer privately warned Biden he could imperil Democrats  —  The Democratic leaders pointed Biden to polls suggesting his candidacy could damage the party's hopes of controlling the House and Senate  —  House Minority Leader Hakeem Jeffries and Senate Majority Leader Charles E. Schumer … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/17/jeffries-schumer-biden-hurting-democrats/"
  },
  {
    "text": "Rep. Schiff calls on Biden to drop out, citing ‘serious concerns’ that he can't win  —  Rep. Adam B. Schiff has called on President Biden to drop out of the White House race, becoming the most prominent Democrat in Congress to do so.  —  The announcement Wednesday from Schiff … ",
    "url": "https://www.latimes.com/politics/story/2024-07-17/schiff-calls-on-biden-to-drop-out-citing-serious-concerns-that-he-can-win"
  },
  {
    "text": "Nearly two-thirds of Democrats want Biden to withdraw, new AP-NORC poll finds  —  Follow AP's live coverage of the investigation into the Trump rally shooting and the Republican National Convention.  —  WASHINGTON (AP) — Nearly two-thirds of Democrats say President Joe Biden should withdraw … ",
    "url": "https://apnews.com/article/biden-trump-poll-drop-out-debate-democrats-59eebaca6989985c2bfbf4f72bdfa112"
  },
  {
    "text": "Biden held ‘tense’ call with group of House Democrats over concerns he can't win  —  Sources say he got into a heated exchange with Rep. Jason Crow on Saturday.  —  President Joe Biden walks out of the Oval Office towards Marine One on the South Lawn of the White House in Washington, DC, on July 15, 2024",
    "url": "https://abcnews.go.com/Politics/biden-held-tense-call-group-house-democrats-concerns/story?id=112033463"
  },
  {
    "text": "Biden Says He'd Consider Dropping Out if a ‘Medical Condition’ Emerged  —  President Biden has said none of his doctors have told him he has a serious medical condition.  But his debate performance last month raised questions about his health and acuity.  —  President Biden said in an … ",
    "url": "https://www.nytimes.com/2024/07/17/us/politics/biden-health-election-drop-out.html"
  },
  {
    "text": "President Joe Biden has tested positive for Covid-19  —  President Joe Biden tested positive for Covid-19 on Wednesday and is experiencing mild symptoms, according to the White House.  —  Biden, 81, tested positive following his first event in Las Vegas, where he was expected to later speak at the UnidosUS annual conference.",
    "url": "https://www.cnn.com/2024/07/17/politics/joe-biden-tests-positive-covid-19/"
  },
  {
    "text": "Biden tests positive for COVID, cancels speaking engagement on Strip  —  Video  —  Poll shows many Latino voters still on fence over Biden, Trump  —  ‘Something went wrong’: Parallels seen between Oct. 1 shooting, Trump assassination attempt  —  Washoe County reverses vote, certifies 2 recounts as legal action looms",
    "url": "https://www.reviewjournal.com/news/politics-and-government/nevada/biden-tests-positive-for-covid-cancels-speaking-engagement-on-strip-3096562/"
  },
  {
    "text": "Biden tests positive for Covid-19  —  This is not the first time Biden has had the coronavirus.  —  President Joe Biden has tested positive for Covid-19, the White House confirmed Wednesday after a conference leader where the president was scheduled to speak made the announcement.",
    "url": "https://www.nbcnews.com/politics/joe-biden/president-joe-biden-tests-positive-covid-19-rcna162435"
  },
  {
    "text": "Democratic Sen. Bob Menendez tells allies he will resign after bribery conviction  —  The New Jersey lawmaker has faced calls to step down from fellow Democrats, including Gov. Phil Murphy, who will, appoint a senator to finish out Menendez's term.  —  WASHINGTON — Sen. Bob Menendez … ",
    "url": "https://www.nbcnews.com/politics/congress/democratic-sen-bob-menendez-tells-allies-will-resign-bribery-convictio-rcna116970"
  },
  {
    "text": "Donors' cash is drying up, Katzenberg warns Biden in private meeting  —  The Scoop  —  Joe Biden met privately in Las Vegas Wednesday with Jeffrey Katzenberg, the film producer and a top campaign adviser, who conveyed a warning: The president's donors' patience is wearing thin, and their cash soon will, too.",
    "url": "https://www.semafor.com/article/07/17/2024/donors-cash-is-drying-up-jeffrey-katzenberg-warns-biden-in-private-meeting"
  },
  {
    "text": "Trump has given no official info about his medical care for days since an assassination attempt  —  Four days after a gunman's attempt to assassinate former President Donald Trump at a Pennsylvania rally, the public is still in the dark over the extent of his injuries, what treatment … ",
    "url": "https://apnews.com/article/trump-shooting-transparency-db2f4437237ad03d3b04b0b5f1573977"
  },
  {
    "text": "Secret Service was told police could not watch building used by Trump rally shooter  —  Amid probes of security lapses during assassination attempt, Senate Minority Leader Mitch McConnell calls for Secret Service director to resign  —  Local police alerted the Secret Service … ",
    "url": "https://www.washingtonpost.com/nation/2024/07/17/secret-service-trump-rally-shooting-homeland-security-investigation/"
  },
  {
    "text": "Trump campaign edits GOP convention speeches to tone down political rhetoric  —  The speeches have tended toward MAGA decaf, steering clear of topics like the 2020 election results and Jan. 6 riots as Trump pushes a theme of unity.  —  MILWAUKEE — Former President Donald Trump's campaign … ",
    "url": "https://www.nbcnews.com/politics/2024-election/trump-campaign-edits-gop-convention-speeches-tone-political-rhetoric-rcna162394"
  },
  {
    "text": "Secret Service spotted Trump rally shooter on roof 20 minutes before gunfire erupted  —  Investigators are trying to determine motive for Thomas Matthew Crooks.  —  The Butler Farm Show, site of a campaign rally for Republican presidential candidate former President Donald Trump … ",
    "url": "https://abcnews.go.com/US/trump-assassination-attempt-investigation-continues-new-details/story?id=112020474"
  },
  {
    "text": "Former 90 Day Fiancé star who claims she has been secretly dating a US Senator for a year in exchange for MONEY ‘exposes all his dirty secrets’ - including his bizarre fetishes  — 90 Day Fiancé alum Stephanie Matto, 33, dished on the romance via TikTok",
    "url": "https://www.dailymail.co.uk/femail/article-13639795/stephanie-matto-dating-senator-secrets-fetishes.html"
  },
  {
    "text": "The changes in vibes — why did they happen?  —  Clearly it has happened, and it has been accelerated and publicized by the Biden failings and the attempted Trump assassination.  But it was already underway.  If you need a single, unambiguous sign of it, I would cite MSNBC pulling off Morning Joe … ",
    "url": "https://marginalrevolution.com/marginalrevolution/2024/07/the-changes-in-vibes-why-did-they-happen.html"
  },
  {
    "text": "Teamsters social media attacks leader over Republican convention speech  —  Deleted post said, ‘unions gain nothing from endorsing the racist, misogynistic, and anti-trans politics of the far right’  —  The Teamsters' social media account attacked its own president on Wednesday, saying … ",
    "url": "https://www.theguardian.com/us-news/article/2024/jul/17/teamsters-sean-obrien-rnc-speech"
  },
  {
    "text": "Special counsel Jack Smith appeals dismissal of Trump classified documents case … Special counsel Jack Smith on Wednesday filed a notice appealing the stunning decision earlier this week by Florida court federal Judge Aileen Cannon that dismissed the criminal classified documents case against former President Donald Trump.",
    "url": "https://www.cnbc.com/2024/07/17/special-counsel-jack-smith-appeals-dismissal-of-trump-classified-documents-case.html"
  },
  {
    "text": "DNC letter says virtual roll call to nominate Biden will happen in August  —  The Democratic National Committee has determined that a virtual roll call vote to formally nominate President Biden as the party's nominee will happen in August, according to a letter sent Wednesday by the heads of the convention rules committee.",
    "url": "https://www.cbsnews.com/news/democratic-national-committee-letter-joe-biden-virtual-roll-call/"
  },
  {
    "text": "Former CIA official charged with being secret agent for South Korean intelligence  —  A former CIA employee and senior official at the National Security Council has been charged with serving as a secret agent for South Korea's intelligence service, the U.S. Justice Department said.",
    "url": "https://apnews.com/article/south-korea-justice-department-foreign-agent-07bc57d23924fc4d6e8c465ad8ea77c9"
  },
  {
    "text": "Dark Money Just Got Darker: Wall Street Helped Fund Project 2025  —  A significant portion of the money bankrolling the Heritage Foundation — the conservative think tank behind the sweeping “Project 2025” initiative to reshape the federal government if former President Donald Trump is reelected … ",
    "url": "https://www.levernews.com/dark-money-just-got-darker-wall-street-helped-fund-project-2025/"
  }
]