[
  {
    "text": "Trump wrote to-do lists for assistant on White House documents marked classified: Sources  —  Molly Michael told investigators about the documents, according to sources.  —  One of former President Donald Trump's long-time assistants told federal investigators that Trump repeatedly wrote … ",
    "url": "https://abcnews.go.com/US/trump-wrote-lists-assistant-white-house-documents-marked/story?id=103226113"
  },
  {
    "text": "Trump to Woo Striking Union Members in Detroit, Skipping 2nd G.O.P. Debate  —  Looking past the Republican primary, Donald Trump and his campaign are already gearing up for a possible rematch with President Biden.  —  Former President Donald J. Trump is planning to travel to Detroit … ",
    "url": "https://www.nytimes.com/2023/09/18/us/politics/trump-detroit-debate.html"
  },
  {
    "text": "Tim Scott, asked about auto strikes, praises past firing of striking federal workers  —  The South Carolina senator has been more critical of striking United Auto Workers members than a number of other GOP presidential candidates.  —  Sen. Scott suggests firing striking workers during campaign stop",
    "url": "https://www.nbcnews.com/politics/2024-election/tim-scott-asked-auto-strikes-praises-firing-striking-federal-workers-rcna105716"
  },
  {
    "text": "McCarthy foes eye higher office  —  Several of the House Republicans currently blocking their party from passing a budget deal may have their eye on higher office — and that's causing some gripes among their colleagues.  —  On Monday, NBC reported on widespread speculation that Rep. Matt Gaetz could run for governor of Florida.",
    "url": "https://www.semafor.com/article/09/19/2023/kevin-mccarthy-foes-eye-higher-office"
  },
  {
    "text": "Maybe Matt Gaetz Is Right  —  The dysfunctional dance taking place in the House between Speaker Kevin McCarthy and his right flank has driven me to consider something I never imagined possible: that Matt Gaetz is right.  —  A House speaker can be successful only with the confidence … ",
    "url": "https://www.nytimes.com/2023/09/19/opinion/kevin-mccarthy-gaetz.html"
  },
  {
    "text": "Rudy Giuliani's ex-lawyers sue him for the $1.4 million they say he owes for defending him in election interference investigations  — Rudy Giuliani's ex-lawyer has filed a lawsuit seeking nearly $1.4 million in unpaid bills.  — It's the latest bad news for Giuliani, who has been indicted and put his apartment up for sale.",
    "url": "https://www.businessinsider.com/giuliani-lawyers-lawsuit-1-million-unpaid-legal-fees-2023-9?op=1"
  },
  {
    "text": "Rudy Giuliani sued by his former lawyers claiming he owes $1.4 million in unpaid legal fees  —  The lawsuit said legal services provided by the firm included early representation in what became the election interference cases in Georgia and Washington, D.C.  —  Former Trump attorney Rudy Giuliani … ",
    "url": "https://www.nbcnews.com/politics/politics-news/giuliani-sued-former-lawyers-claiming-14-million-unpaid-legal-fees-rcna105731"
  },
  {
    "text": "A real fact-check of Trump's appearance on Meet the Press  —  Kristen Welker's tenure as the new host of NBC's Meet the Press began on Sunday with an interview with former President Donald Trump.  NBC News promoted Trump's appearance as his “first broadcast network interview since leaving office.”",
    "url": "https://popular.info/p/a-real-fact-check-of-trumps-appearance"
  },
  {
    "text": "Canada Ties Hardeep Singh Nijjar Killing to India  —  In a rare and explosive allegation, the Canadian leader said the Indian government was behind the death of a Canadian citizen who advocated turning part of India into an independent Sikh nation.  —  Prime Minister Justin Trudeau of Canada … ",
    "url": "https://www.nytimes.com/2023/09/18/world/canada/canada-india-sikh-killing.html"
  },
  {
    "text": "Rep. Lauren Boebert Says Hookup Theater Guy Won't Get Another Date  —  Rep. Lauren Boebert says it's dunzo between her and the theater groping guy — saying the one-time private moment came and went ... and it sounds like his politics might be at play.  —  The Colorado congresswoman touched … ",
    "url": "https://www.tmz.com/2023/09/18/rep-lauren-boebert-no-more-dates-after-theater-hookup/"
  },
  {
    "text": "Anxiety ripples through the Democratic Party over Biden  —  Persistent concerns over Biden's age come amid a series of polls showing he's neck-and-neck with Trump  —  A growing number of polls are showing voters concerned about President Biden's age and energy.",
    "url": "https://www.washingtonpost.com/nation/2023/09/18/biden-democrats-anxiety-age/"
  },
  {
    "text": "Where Has All the Left-Wing Money Gone?  —  As we stumble toward another existential election, panic is setting in among some progressive groups because the donors who buoyed them throughout the Trump years are disengaging.  “Donations to progressive organizations are way down in 2023 across the board … ",
    "url": "https://www.nytimes.com/2023/09/18/opinion/columnists/progessive-fundraising-downturn.html"
  },
  {
    "text": "Texas Lawman Linked to Oath Keepers Convicted After Violating Inmate Rights  —  Sheriff Jeff Lyde kept a pair of inmates jailed for days after a judge had ordered them freed  —  A TEXAS SHERIFF with links to the Oath Keepers has been convicted of “official oppression” for the mistreatment … ",
    "url": "https://www.rollingstone.com/politics/politics-news/oath-keeper-sheriff-convicted-violating-inmate-rights-1234827432/"
  },
  {
    "text": "Azerbaijan launches ‘anti-terrorist activities’ in Karabakh to disarm Armenians  —  Azerbaijan said on Tuesday its armed forces had launched what it called “local anti-terrorist activities” in the Nagorno-Karabakh region to restore constitutional order by disarming and forcing the withdrawal of Armenian military formations there.",
    "url": "https://www.reuters.com/world/azerbaijan-says-six-its-citizens-were-killed-by-land-mines-karabakh-2023-09-19/"
  },
  {
    "text": "Dominion's $1.6 billion defamation suit against Newsmax over election lies set for September 2024 trial  —  Dominion Voting Systems' $1.6 billion defamation lawsuit against Newsmax over the right-wing network's airing of 2020 election lies is scheduled to go to trial in late September 2024, a Delaware judge decided.",
    "url": "https://www.cnn.com/2023/09/18/media/dominion-newsmax-defamation-lawsuit/"
  },
  {
    "text": "Fed Creeps Toward Next Phase in Its Fight Against Inflation  —  The Federal Reserve is unlikely to declare victory this week.  But investors will watch for any hint that the end to rate increases is coming.  —  Federal Reserve officials are expected to leave interest rates unchanged … ",
    "url": "https://www.nytimes.com/2023/09/19/business/economy/fed-meeting-interest-rates-inflation.html"
  },
  {
    "text": "The breakup: Biden and Adams avoid each other in New York  —  The decision by Biden and Adams to avoid each other is a concession to the reality that their relationship is deeply broken, according to several people familiar with the dynamics.  —  NEW YORK — This time last year … ",
    "url": "https://www.politico.com/news/2023/09/19/biden-adams-new-york-united-nations-00116667"
  }
]