[
  {
    "text": "Trump and Harris Neck and Neck After Summer Upheaval, Times/Siena Poll Finds  —  The survey finds that Donald J. Trump is retaining his support and that, on the eve of the debate, voters are unsure they know enough about where Kamala Harris stands.  —  Former President Donald J. Trump … ",
    "url": "https://www.nytimes.com/2024/09/08/us/politics/trump-and-harris-times-siena-poll.html?unlocked_article_code=1.JE4.hi1f.f26wReRbISmY&smid=url-share"
  },
  {
    "text": "Harris v. Trump CBS News poll finds Pennsylvania, Michigan, Wisconsin race tight ahead of debate  —  In Pennsylvania, Michigan and Wisconsin — all tight races — we see the larger contours of the entire presidential contest ahead of the first Harris-Trump debate.  —  What makes these states close?",
    "url": "https://www.cbsnews.com/news/harris-trump-poll-pennsylvania-michigan-wisconsin-debate/"
  },
  {
    "text": "Pennsylvania is key as Harris and Trump prep for their Philly showdown  —  HARRISBURG, Pa. (AP) — When Donald Trump and Kamala Harris meet onstage Tuesday night in Philadelphia, they'll both know there's little debate that Pennsylvania is critical to their chances of winning the presidency.",
    "url": "https://apnews.com/article/pennsylvania-presidential-election-trump-harris-debate-2dcb86551271b79d63551739b1a5fd18"
  },
  {
    "text": "Toplines: September 2024 Times/Siena Poll of Registered Voters Nationwide  —  Results of a nationwide New York Times/Siena College poll conducted among 1,695 registered voters from September 3 to 6, 2024.  —  Do you think the United States is on the right track, or is it headed in the wrong direction?",
    "url": "https://www.nytimes.com/interactive/2024/09/08/us/politics/times-siena-poll-toplines.html"
  },
  {
    "text": "September 7, 2024  —  By rights, tonight's post should be a picture, but Trump's behavior today merits a marker because it feels like a dramatic escalation of the themes we've seen for years.  Please feel free to ignore—as I often say, I am trying to leave notes for a graduate student in 150 years … ",
    "url": "https://heathercoxrichardson.substack.com/p/september-7-2024"
  },
  {
    "text": "Cheney says Trump is an ‘unrecoverable catastrophe’ in call for GOP to vote for Harris  —  The former congresswoman says not voting for Trump is not enough.  —  Rep. Liz Cheney Vice Chairwoman of the Select Committee to Investigate the January 6th Attack on the U.S. Capitol … ",
    "url": "https://abcnews.go.com/Politics/cheney-trump-unrecoverable-catastrophe-call-gop-vote-harris/story?id=113486970"
  },
  {
    "text": "Trump threatens lawyers, donors and election officials with prison for ‘unscrupulous behavior’  —  Trump and his allies filed dozens of unsuccessful cases after the 2020 election in an attempt to overturn the results.  —  Former President Donald Trump, who makes frequent false claims … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-warns-prison-sentences-people-cheated-2024-rcna170088"
  },
  {
    "text": "Anti-Abortion Extremists Call the Shots in Trump's GOP  —  Trump's epic flip flop abortion is why Democratic fears about Project 2025 and a Federal abortion ban are well-founded.  —  The generally accepted — and oft-repeated — narrative about Trump is that he is a cult-leader who can bend the Republican base to his will.",
    "url": "https://www.messageboxnews.com/p/anti-abortion-extremists-call-the"
  },
  {
    "text": "Fake news, social media, and “The Death of Truth”  —  We live in an age of alternate facts.  More and more Americans are getting their information almost entirely from outlets that echo their own political point of view.  And then, of course, there's social media, where there are few … ",
    "url": "https://www.cbsnews.com/news/fake-news-social-media-and-the-death-of-truth/"
  },
  {
    "text": "Variety Asked Elton John About Donald Trump and the TDS Afflicted Will NOT Like His Answer  —  Those on the Left afflicted with Trump Derangement Syndrome might not be fully satisfied by Elton John's response to a question from a Variety reporter at the Toronto Film Festival … ",
    "url": "https://twitchy.com/dougp/2024/09/07/variety-asked-elton-john-about-donald-trump-and-the-tds-afflicted-will-not-like-his-answer-n2400652"
  },
  {
    "text": "MAGA Turns on Trump for Admitting He's an Election ‘Loser’  —  BONUS PODCAST  —  “He's admitting... ‘I lost by a whisker’.  So what was the point?  What's the point of any of it you lost in 2020?” one-time Trump dinner companion Nick Fuentes asked.",
    "url": "https://www.thedailybeast.com/maga-and-nick-fuentes-turn-on-donald-trump-for-admitting-hes-an-election-loser"
  },
  {
    "text": "It's time for a permanent repeal of the global gag rule  —  Project 2025, the policy agenda created by conservative activists and spearheaded by The Heritage Foundation, envisions sweeping changes to U.S. government policy.  Among them, buried within the more than 900-page document … ",
    "url": "https://thehill.com/opinion/international/4866475-project-2025-global-gag-rule/"
  },
  {
    "text": "Trump cashes in during final weeks of his presidential campaign  —  No presidential candidate has ever so closely linked his election with personal for-profit enterprises, selling items from shoes to books to pieces of his suit.  —  With less than 10 weeks before the presidential election … ",
    "url": "https://www.washingtonpost.com/politics/2024/09/08/trump-cash-merchandise-books-cards/"
  },
  {
    "text": "After a Year of Legal Peril, Trump Seeks Election as a Felon, but Free  —  Donald J. Trump's sentencing in Manhattan was delayed, thanks in part to his legal resources and political status.  It raised a question: Is he above the law?  —  One year ago, Donald J. Trump faced 91 felony counts … ",
    "url": "https://www.nytimes.com/2024/09/08/nyregion/trump-election-felon-sentence-delay.html"
  }
]