[
  {
    "text": "Consumed by Epstein, Trump has lost ground on the economy and immigration  —  When he was sworn in, Trump promised a new “Golden Age.”  It's clear that, six months into his presidency, the public isn't buying all the hype.  —  Just now  —  President Donald Trump spent much of last week trying … ",
    "url": "https://www.washingtonpost.com/politics/2025/07/20/trump-epstein-economy-immigration-approval/"
  },
  {
    "text": "Trump survived many scandals, but the Epstein story poses a new test  —  The MAGA base has rallied as they see him under attack.  The White House is trying to change the subject.  —  Just now  —  Nearly two weeks after President Donald Trump and his administration announced they had nothing … ",
    "url": "https://www.washingtonpost.com/politics/2025/07/20/trump-epstein-files-political-fallout-risks/"
  },
  {
    "text": "CBS News poll finds support for Trump's deportation program falls; Americans call for more focus on prices  —  After six months that included a string of achievements on President Trump's legislative goals, views of his second term are increasingly defined by the difference between his political base … ",
    "url": "https://www.cbsnews.com/news/cbs-news-poll-trump-deportation-program-prices/"
  },
  {
    "text": "Trump once hosted party for ‘young women’ where Epstein was the only guest, says report  —  President under pressure to release all files related to his former friend Epstein  —  Donald Trump once hosted a party with “young women” where the disgraced late pedophile Jeffrey Epstein “was the only other guest,” according to a report.",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/trump-epstein-party-women-b2792328.html"
  },
  {
    "text": "G.O.P. Push Behind Trump Agenda Has Congress in an Uproar … Republicans' relentless marathon to force President Trump's agenda through Congress over objections from Democrats and some in their own ranks is taking a toll on the institution and its members, prompting tempers to boil … ",
    "url": "https://www.nytimes.com/2025/07/20/us/politics/republicans-democrats-congress-dysfunction.html"
  },
  {
    "text": "Volunteers flock to immigration courts to support migrants arrested in the hallways  —  After a Seattle immigration judge dismissed the deportation case against a Colombian man — exposing him to expedited removal — three people sat with him in the back of the courtroom … ",
    "url": "https://apnews.com/article/immigration-court-arrests-ice-bd145fae56c0d493ba52418cc66ef3b7"
  },
  {
    "text": "An Accuser's Story Suggests How Trump Might Appear in the Epstein Files … Maria Farmer in August 2019.  Ms. Farmer said in an interview with The New York Times that she twice told the F.B.I. about a troubling encounter she had with Donald J. Trump, and about how close he was with Jeffrey Epstein.Andrea Morales for The New York Times",
    "url": "https://www.nytimes.com/2025/07/20/us/politics/epstein-employee-trump-investigation.html?unlocked_article_code=1.X08.-y5C.oO6OwIDny5oX&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "GOP Senator Blames ‘Radical’ Leftists for Trump's Cankles  —  CHOLESTEROL?  NO, COMMUNISM!  —  Tommy Tuberville says even at the ripe old age of 79, the president's only ailing because every day's “almost like a fistfight” with pesky liberals.  —  Republican Sen. Tommy Tuberville thinks it's not age … ",
    "url": "https://www.thedailybeast.com/gop-senator-tommy-tuberville-blasts-radical-leftists-for-making-president-donald-trump-sick/"
  },
  {
    "text": "Officials say 85 Palestinians seeking aid are killed in Gaza as Israel widens evacuation orders  —  At least 85 Palestinians were killed while trying to reach food at locations across Gaza on Sunday, the territory's Health Ministry said, on the deadliest day yet for aid-seekers in over 21 months of war.",
    "url": "https://apnews.com/article/israel-palestinians-hamas-war-07-20-2025-2b494af89d710793bc6933f5ae437566"
  },
  {
    "text": "Atlanta journalist fights deportation from Ice jail despite dropped charges: 'I'm seeing what absolute power can do'  —  A Salvadorian reporter with an audience of millions, Mario Guevara was arrested while livestreaming a protest against Trump in June - and is still struggling for freedom",
    "url": "https://www.theguardian.com/us-news/2025/jul/20/mario-guevara-journalist-ice-georgia-trump"
  },
  {
    "text": "Sunday Pages: “Superman”  —  I first saw the trailer for the new James Gunn Superman a few months ago, during the NBA playoffs.  My first reaction was an eye-roll and a dismissive, “Do we really need another Superman?  Really?  Why?”  —  Seriously: why do we keep recycling the same old tired movie franchises?",
    "url": "https://gregolear.substack.com/p/sunday-pages-superman"
  },
  {
    "text": "What happens once we spot the asteroid that will hit Earth? … In January, at a US Space Force Base in the Rocky Mountains near Colorado Springs, an operator received an unusual email.  It was an alert — but not one triggered by the military's network of space-based sensors.",
    "url": "https://www.ft.com/content/7a629f0c-6a62-47d6-831a-48a492a49acb"
  },
  {
    "text": "Why American Jews No Longer Understand One Another  —  It's a tense time in the Jewish family group chats.  The consensus that held American Jewry together for generations is breaking down.  That consensus, roughly, was this: What is good for Israel is good for the Jews.  Anti-Zionism is a form of antisemitism.",
    "url": "https://www.nytimes.com/2025/07/20/opinion/antisemitism-american-jews-israel-mamdani.html?unlocked_article_code=1.X08.7jBS.jwWy8PewQI51&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "“He's a madman”: Trump's team frets about Netanyahu after Syria strikes  —  As smoke and debris swirled over the Syrian presidential palace, the chatter in the West Wing grew louder: Benjamin Netanyahu is out of control. … He bombs everything all the time,\" one White House official told Axios, referring to Netanyahu by his nickname.",
    "url": "https://www.axios.com/2025/07/20/israel-syria-strikes-trump-netanyahu-divide"
  },
  {
    "text": "Ice chief says he will continue to allow agents to wear masks during arrest raids  —  Legal advocates and attorneys general argue practice poses accountability issues and contributes to a climate of fear  —  The head of US Immigration and Customs Enforcement (Ice) said on Sunday … ",
    "url": "https://www.theguardian.com/us-news/2025/jul/20/ice-agents-masks"
  },
  {
    "text": "Should the Heterodox Academy Prioritize Fighting Trump's Authoritarian Assaults Over Wokeness on Campuses?  A Conversation with Cathy Young  —  The outfit's recent conference revealed a deep divide that needs tackling  —  Landry Ayres: Welcome back to Zooming In at The UnPopulist.  I'm Landry Ayres.",
    "url": "https://www.theunpopulist.net/p/should-the-heterodox-academy-prioritize"
  },
  {
    "text": "After a Chaotic Start, a U.S. Attorney's Time May Be Running Out  —  Alina Habba, President Trump's choice to run the U.S. attorney's office in New Jersey, has pursued investigations against Democrats.  Her tenure has damaged morale inside the office.  —  Lawyers for Eliyahu Weinstein were faced with a difficult situation.",
    "url": "https://www.nytimes.com/2025/07/20/nyregion/alina-habba-us-attorney-new-jersey.html"
  }
]