[
  {
    "text": "Byrd Rule Violations Continue to Mount on the Republicans' “One Big, Beautiful Bill”  —  WASHINGTON, D.C. - Today, the Senate Parliamentarian again advised that several provisions in the Republicans' “One Big, Beautiful Bill,” would be subject to a 60-vote threshold if they remain in the bill.",
    "url": "https://www.budget.senate.gov/ranking-member/newsroom/press/byrd-rule-violations-continue-to-mount-on-the-republicans-one-big-beautiful-bill"
  },
  {
    "text": "Senate referee rejects key Medicaid cuts in Trump's ‘big, beautiful bill’  —  Senate Parliamentarian Elizabeth MacDonough has rejected key Medicaid provisions in the Senate GOP megabill, a ruling that appears to strike a major blow to Republicans' strategy for cutting federal spending.",
    "url": "https://thehill.com/homenews/senate/5370671-medicaid-trump-bill-senate-parliamentarian/"
  },
  {
    "text": "Thune says Senate won't overrule parliamentarian  —  Senate Majority Leader John Thune said Thursday the Senate would not move to overrule its parliamentarian after she advised that including key provisions in the GOP's domestic-policy megabill would expose it to a fatal Democratic filibuster.",
    "url": "https://www.politico.com/live-updates/2025/06/26/congress/john-thune-senate-parliamentarian-overrule-00425792"
  },
  {
    "text": "Cuomo will stay on NYC mayor's ballot after conceding Democratic primary to Mamdani, sources tell CNN  —  Andrew Cuomo will not drop out of the New York City mayoral race by the Friday deadline to remove himself from the general election ballot, sources tell CNN.",
    "url": "https://cnn.com/2025/06/26/politics/cuomo-mamdani-mayor-november-ballot"
  },
  {
    "text": "Eric Adams Meets With Business Leaders Desperate to Stop Mamdani's Rise  —  Daniel Loeb, the hedge fund manager, and some other New York City business leaders are aghast at Zohran Mamdani's success in the Democratic mayoral primary and are considering backing Mr. Adams in the general election.",
    "url": "https://www.nytimes.com/2025/06/26/nyregion/eric-adams-business-leaders-meeting.html"
  },
  {
    "text": "States can cut off Medicaid funding to Planned Parenthood, the Supreme Court rules  —  A divided Supreme Court allowed states to cut off Medicaid money to Planned Parenthood in a ruling handed down Thursday amid a wider Republican-backed push to defund the country's biggest abortion provider.",
    "url": "https://apnews.com/article/supreme-court-planned-parenthood-abortion-medicaid-e056395b9e5646d13539e76605027a1f"
  },
  {
    "text": "Bill Moyers, the former White House press secretary turned acclaimed TV journalist, dead at 91  —  Bill Moyers, the former White House press secretary who became one of television's most honored journalists, masterfully using a visual medium to illuminate a world of ideas, died Thursday at age 91.",
    "url": "https://apnews.com/article/bill-moyers-dead-eed7ecae0e20c2db4b82500996916dfe"
  },
  {
    "text": "Bill Moyers, eminence of public affairs broadcasting, dies at 91  —  He was White House press secretary under Lyndon B. Johnson and Newsday publisher before becoming an acclaimed television journalist, mostly for PBS.  —  Bill Moyers, who served as press secretary to President Lyndon B. Johnson and then … ",
    "url": "https://www.washingtonpost.com/obituaries/2025/06/26/bill-moyers-lbj-pbs-broadcasting-dead/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzUwOTEwNDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzUyMjkyNzk5LCJpYXQiOjE3NTA5MTA0MDAsImp0aSI6IjAwMTVmYTk4LWRiZjItNDM0NS1hMjVkLTEwZGQwZGY1ZjNkNiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9vYml0dWFyaWVzLzIwMjUvMDYvMjYvYmlsbC1tb3llcnMtbGJqLXBicy1icm9hZGNhc3RpbmctZGVhZC8ifQ.HvzwmHFpiGkr6QV-a0qHkjw-QuW7_3uMsxhYFWkf4gI&itid=gfta"
  },
  {
    "text": "Trump Threatens to Sue The Times and CNN Over Iran Reporting  —  The president has criticized media coverage of a preliminary classified report that ran counter to his assertion that U.S. strikes had “obliterated” Iran's nuclear program.  —  President Trump on Wednesday threatened to sue … ",
    "url": "https://www.nytimes.com/2025/06/26/business/media/trump-iran-new-york-times-cnn.html?unlocked_article_code=1.R08.zz4o.GhMIicEh533s&smid=url-share"
  },
  {
    "text": "Behind Trump's 2024 Victory, a More Racially and Ethnically Diverse Voter Coalition  —  A study of the 2024 election, based on validated voters  —  Table of Contents Table of Contents  —  Pew Research Center conducted this study to better understand which voters cast ballots in the 2024 presidential election and how they voted.",
    "url": "https://www.pewresearch.org/politics/2025/06/26/behind-trumps-2024-victory-a-more-racially-and-ethnically-diverse-voter-coalition/"
  },
  {
    "text": "ICE Plans to Send Abrego Garcia to an Unnamed Nation That Isn't El Salvador  —  A government lawyer laid out a plan in court Thursday, but without a clear timeline.  — Copy  —  Kilmar Armando Abrego Garcia, back in the United States after the Trump administration mistakenly deported … ",
    "url": "https://www.notus.org/immigration/abrego-garcia-third-country-ice-doj-court"
  },
  {
    "text": "Trump Justice Dept. Pressuring University of Virginia President to Resign  —  The Justice Department has demanded that James E. Ryan step down to help resolve a civil rights investigation into the school, three people familiar with the matter said.  —  The Trump administration has privately demanded … ",
    "url": "https://www.nytimes.com/2025/06/26/us/politics/university-of-virginia-president-trump.html?unlocked_article_code=1.SE8.H015.ebP-n2IzBxuT&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "‘Big Balls’ Is Now at the Social Security Administration  —  Edward “Big Balls” Coristine's placement at the SSA comes after a White House official told WIRED on Tuesday that the 19-year-old had resigned from his position in government.  —  Edward “Big Balls” Coristine … ",
    "url": "https://www.wired.com/story/big-balls-social-security-administration/"
  },
  {
    "text": "Support Rises For Giving Most Undocumented Immigrants A Pathway To Legal Status vs. Deportations, Quinnipiac University National Poll Finds; More Than 9 In 10 Voters Say Politically Motivated Violence In The U.S. Is A Serious Problem  — mail_outline",
    "url": "https://poll.qu.edu/poll-release?releaseid=3926"
  },
  {
    "text": "Kennedy's New Advisers Rescind Recommendations for Some Flu Vaccines  —  Critics saw in the move the beginnings of a more restrictive approach to providing vaccines to Americans.  —  An advisory panel recently appointed by Health Secretary Robert F. Kennedy Jr. voted on Thursday to walk … ",
    "url": "https://www.nytimes.com/2025/06/26/health/rfk-jr-vaccines-acip-cdc.html?unlocked_article_code=1.R08.J5ol.F_ZAuAgH1pJr&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "ICE Is Using a New Facial Recognition App to Identify People, Leaked Emails Show  —  Immigration and Customs Enforcement (ICE) is using a new mobile phone app that can identify someone based on their fingerprints or face by simply pointing a smartphone camera at them, according to internal ICE emails viewed by 404 Media.",
    "url": "https://www.404media.co/ice-is-using-a-new-facial-recognition-app-to-identify-people-leaked-emails-show/"
  },
  {
    "text": "Former Supreme Court Justice Kennedy says ‘democracy is at risk’  —  The retired Reagan appointee joined a forum on threats to judges and the rule of law.  —  Former Supreme Court Justice Anthony Kennedy warned Thursday that acrimonious political discourse and threats to judges are eroding … ",
    "url": "https://www.politico.com/news/2025/06/26/anthony-kennedy-democracy-judiciary-threats-00427714"
  },
  {
    "text": "Rep. Carolyn McCarthy, former congresswoman and prominent gun control advocate, dies at 81  —  Automated narration.  Learn more  —  Carolyn McCarthy, whose personal tragedy propelled her to national prominence after her husband was killed during the 1993 Long Island Rail Road massacre … ",
    "url": "https://www.newsday.com/long-island/obituaries/carolyn-mccarthy-obituary-blu7hqga"
  },
  {
    "text": "Critical Hurricane Forecast Tool Abruptly Terminated  —  On Tuesday, the U.S. Department of Defense announced it would immediately stop ingesting, processing, and transmitting data essential to most hurricane forecasts.  —  The announcement was formalized on Wednesday when NOAA distributed … ",
    "url": "https://michaelrlowry.substack.com/p/critical-hurricane-forecast-tool"
  },
  {
    "text": "Mamdani and the Moguls of Madness  —  Will he be a good mayor?  Nobody knows.  But the hysteria is revealing.  —  I was in mid-air when NYC's election results came in, and I'm still not quite home.  So again, not a proper post.  But a few late-morning reactions from the road.",
    "url": "https://paulkrugman.substack.com/p/mamdani-and-the-moguls-of-madness"
  },
  {
    "text": "Supreme Court is set to issue rulings on birthright citizenship and five other cases on term's final day  —  The court has six cases left to decide as it concludes its nine-month term ahead of a summer break.  —  WASHINGTON — The Supreme Court is set to conclude its nine-month term Friday … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-rulings-birthright-citizenship-5-cases-final-day-rcna215246"
  },
  {
    "text": "Gabbard Dropped From Intelligence Briefing as Trump Rages Over Leak  —  SIDELINED  —  The director of national intelligence is being left out after a leaked assessment said the president's strikes on Iran had set the country's nuclear program back just a few months.",
    "url": "https://www.thedailybeast.com/tulsi-gabbard-dropped-from-intelligence-briefing-as-trump-rages-over-leak/"
  },
  {
    "text": "American Vogue Seeks New Head of Editorial Content  —  Anna Wintour will continue in her roles as chief content officer for Condé Nast and global editorial director, Vogue.  —  It's the end of an era. … Wintour, 75, will remain chief content officer for Condé Nast and global editorial director, Vogue.",
    "url": "https://wwd.com/fashion-news/fashion-scoops/american-vogue-new-head-editorial-content-search-1237951685/"
  },
  {
    "text": "Canadian man awaiting deportation dies at detention facility in downtown Miami  —  Johnny Noviello moved from Canada to Daytona Beach when he was 10 years old.  He grew up in Florida and became a lawful permanent resident.  —  On Monday, June 23, he died at the Federal Detention Center in downtown Miami … ",
    "url": "https://www.miamiherald.com/news/local/immigration/article309501470.html"
  },
  {
    "text": "Crockett questions Melania Trump's reported ‘Einstein visa’: 'The math ain't mathin\"  —  Rep. Jasmine Crockett (D-Texas) questioned first lady Melania Trump's reported “Einstein visa” inata House hearing Wednesday.  —  “Let me remind y'all that Melania, the first lady, a model … ",
    "url": "https://thehill.com/homenews/house/5370991-crockett-melania-einstein-visa-question/"
  },
  {
    "text": "ICE arrested a 6-year-old boy with leukemia at immigration court.  His family is suing.  —  A Honduran mother and her two children — ages 6 and 9 — sued the Trump administration over their arrest at Los Angeles Immigration Court, the first lawsuit challenging the arrests of children under a new ICE directive targeting courthouses.",
    "url": "https://www.tpr.org/border-immigration/2025-06-25/ice-arrested-a-6-year-old-boy-with-leukemia-at-immigration-court-his-family-is-suing"
  },
  {
    "text": "Early intelligence suggests Iran's uranium largely intact, European officials say  —  Preliminary assessments suggest Tehran was able to move much of its stockpile  —  Preliminary intelligence assessments provided to European governments indicate that Iran's highly enriched uranium stockpile … ",
    "url": "https://www.ft.com/content/0808eeb8-341c-4a4e-8ccf-0db07febef91"
  },
  {
    "text": "Exclusive: Details emerge of secret diplomatic efforts to restart Iran talks  —  The Trump administration has discussed possibly helping Iran access as much as $30 billion to build a civilian-energy-producing nuclear program, easing sanctions, and freeing up billions of dollars in restricted Iranian funds … ",
    "url": "https://cnn.com/2025/06/26/politics/us-iran-talks-nuclear-program"
  }
]