[
  {
    "text": "R.F.K. Jr. Says Doctors Found a Dead Worm in His Brain  —  The presidential candidate has faced previously undisclosed health issues, including a parasite that he said ate part of his brain.  —  Robert F. Kennedy Jr. has emphasized his vitality and relative youth compared with the leading Democratic … ",
    "url": "https://www.nytimes.com/2024/05/08/us/rfk-jr-brain-health-memory-loss.html"
  },
  {
    "text": "How We Got to a Place Where Right Wingers Cheer Stealing Nuclear Documents  —  When Aileen Cannon issued her order delaying Trump's stolen documents trial indefinitely, I posted this on Xitter.  —  The post was factual.  Trump nominated Judge Cannon on May 21, 2020.",
    "url": "https://www.emptywheel.net/2024/05/08/how-we-got-to-a-place-where-right-wingers-cheer-stealing-nuclear-documents/"
  },
  {
    "text": "FreedomWorks Is Closing — And Blaming Trump  —  The libertarian organization couldn't survive the populist shift in the Republican Party.  —  FreedomWorks, the once-swaggering conservative organization that helped turn tea party protesters into a national political force, is shutting down … ",
    "url": "https://www.politico.com/news/magazine/2024/05/08/freedomworks-is-closing-and-blaming-trump-00156784"
  },
  {
    "text": "When Trump Attacks Our Elections, We Will Have No Excuse  —  Donald Trump and his Republican allies have no intention of accepting the outcome of a free and fair election.  They are boasting about building a voter suppression war machine.  They have told us their plans to intimidate election officials and voters.",
    "url": "https://www.democracydocket.com/opinion/when-trump-attacks-our-elections-we-will-have-no-excuse/"
  },
  {
    "text": "‘Character is too important’: Paul Ryan says he'll write in a candidate, won't vote for Trump  —  WASHINGTON - Former House Speaker Paul Ryan this week doubled down on his claim that he will not vote for Donald Trump this November, reasserting his opposition to the former president just two months … ",
    "url": "https://www.jsonline.com/story/news/politics/elections/2024/05/08/ex-house-speaker-paul-ryan-reaffirms-claim-hell-vote-against-trump/73606288007/"
  },
  {
    "text": "Biden on Trump: He 'didn't build a damn thing'  —  The president's speech on Wednesday was designed to claim credit for positive economic news — but also shake voters' views that his predecessor got stuff done.  —  President Joe Biden on Wednesday cast a major new investment in battleground Wisconsin … ",
    "url": "https://www.politico.com/news/2024/05/08/biden-trump-2024-elections-00156853"
  },
  {
    "text": "Stormy Daniels details Trump's sleazy contempt for women  —  PN is a reader-supported publication made possible by paid subscribers.  Appreciate our independent journalism?  Then please sign up to support us.  —  📈 Subscribe to Public Notice 📈",
    "url": "https://www.publicnotice.co/p/stormy-daniels-testimony-trump-access-hollywood"
  },
  {
    "text": "Georgia just made it a lot easier to challenge elections — and a lot harder to vote in them  —  With the 2024 presidential election just six months away, Georgia Gov. Brian Kemp on has signed legislation that makes critical changes to the state's election laws, including expanding the options … ",
    "url": "https://lawandcrime.com/high-profile/georgia-just-made-it-a-lot-easier-to-challenge-elections-and-a-lot-harder-to-vote-in-them/"
  },
  {
    "text": "RFK Jr.'s new hire who downplayed Jan. 6 appears to have been at the Capitol during the attack  —  Photos and videos from outside the Capitol on Jan. 6, 2021, uncovered by online sleuths and NBC News appear to show Zach Henry, a right-wing influencer now working for Kennedy's campaign.",
    "url": "https://www.nbcnews.com/politics/2024-election/rfk-jr-staffer-zach-henry-jan-6-downplay-capitol-attack-rcna150476"
  },
  {
    "text": "World's top climate scientists expect global heating to blast past 1.5C target  —  Exclusive: Planet is headed for at least 2.5C of heating with disastrous results for humanity, poll of hundreds of scientists finds  —  Hundreds of the world's leading climate scientists expect global temperatures … ",
    "url": "https://www.theguardian.com/environment/article/2024/may/08/world-scientists-climate-failure-survey-global-temperature"
  },
  {
    "text": "U.S. to empower asylum officials to reject more migrants earlier in process  —  The Biden administration is planning to announce a new regulation as early as Thursday that is designed to allow immigration officials to deport migrants who are ineligible for U.S. asylum earlier in the process … ",
    "url": "https://www.cbsnews.com/news/immigration-us-asylum-migrants-new-regulation/"
  },
  {
    "text": "College anti-Israel agitators could be sent to Gaza under new House GOP bill  —  'I am going to bet that these pro-Hamas supporters wouldn't last a day, but let's give them the opportunity,' says Rep Randy Weber  —  FIRST ON FOX: A new House Republican bill would send any person charged … ",
    "url": "https://www.foxnews.com/politics/college-anti-israel-agitators-sent-gaza-new-house-gop-bill"
  },
  {
    "text": "U.S. pauses Israel arms shipment over Rafah assault fears as Biden pushes for a cease-fire deal  —  An Israeli official told NBC News there is deep frustration in the country's government over the decision, which comes as the Biden admin presses for a cease-fire deal that would head off … ",
    "url": "https://www.nbcnews.com/news/world/us-pauses-weapons-shipment-bombs-israel-rafah-assault-cease-fire-gaza-rcna151187"
  },
  {
    "text": "Georgia appeals court will review decision that kept Fani Willis on Trump case  —  A Georgia appeals court agreed Wednesday to review a lower court ruling in former President Trump's 2020 state-level election case allowing Fulton County District Attorney Fani Willis to continue overseeing it, per a filing.",
    "url": "https://www.axios.com/2024/05/08/georgia-trump-2020-election-case-fani-willis"
  },
  {
    "text": "Meet AdVon, the AI-Powered Content Monster Infecting the Media Industry  —  A few years back, a writer in a developing country started doing contract work for a company called AdVon Commerce, getting a few pennies per word to write online product reviews.  —  But the writer … ",
    "url": "https://futurism.com/advon-ai-content"
  },
  {
    "text": "McCarthy vs. Gaetz: The GOP's never-ending feud  —  Seven months after the Florida firebrand led the ouster of the former speaker, tempers are running hotter than ever — with McCarthy lauding Gaetz's new primary challenger.  —  Kevin McCarthy is escalating his revenge campaign against Rep. Matt Gaetz.",
    "url": "https://www.politico.com/news/2024/05/08/mccarthy-gaetz-gop-florida-00156659"
  },
  {
    "text": "NPR CEO skips hearing to examine radio outlet's alleged ideological bias  —  .  —  The top executive at NPR failed to appear at a congressional hearing designed to examine alleged bias at the news outlet despite being funded by taxpayer dollars.  —  Katherine Maher, who was named CEO … ",
    "url": "https://www.washingtonexaminer.com/news/house/2996157/npr-ceo-skips-house-hearing-bias/"
  },
  {
    "text": "How Trump's allies amplify his Truth Social messages to the wider world  —  On the second day of his civil fraud trial in New York last fall, Donald Trump posted a photo of a young woman, Allison Greenfield, standing next to Senate Majority Leader Charles E. Schumer (D-N.Y.).",
    "url": "https://www.washingtonpost.com/politics/interactive/2024/trump-truth-social-posts-amplifiers-right-wing-media/"
  },
  {
    "text": "Trump Individual, Estate Tax Cut Renewal to Cost $4.6 Trillion  — US deficit in 2024 seen rising closer to $2 trillion, CBO says  — CBO Director Swagel sees ‘daunting’ US fiscal outlook  —  The cost of extending the 2017 tax cuts for households, small businesses and the estates … ",
    "url": "https://www.bloomberg.com/news/articles/2024-05-08/trump-tax-cut-extension-cost-swells-to-3-8-trillion-cbo-warns"
  },
  {
    "text": "Playbook: Biden's race to Trump-proof his legacy  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  OUR MAN IN JERUSALEM — CIA Director WILLIAM BURNS is meeting this hour with Israeli PM BENJAMIN NETANYAHU after Gaza cease-fire talks were rekindled yesterday … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/05/08/bidens-race-to-trump-proof-his-legacy-00156759"
  },
  {
    "text": "Unexpected warning signs for Trump in busy Indiana primary  —  There were a half-dozen consequential GOP primaries on Tuesday, but Nikki Haley's performance in the already concluded presidential race could be a sign of trouble for Trump in more competitive states.",
    "url": "https://www.politico.com/news/2024/05/07/indiana-primary-unexpected-warning-signs-donald-trump-00156750"
  }
]