[
  {
    "text": "Biden: “I am an elderly man ... I know what the hell I'm doing” … - Biden's hastily arranged nighttime remarks came after the special counsel's report said he wouldn't be charged for having classified documents, but blistered him as “an elderly man with a poor memory” … ",
    "url": "https://www.axios.com/2024/02/09/biden-defends-memory-2024-election"
  },
  {
    "text": "Thoughts On the Hur Report  —  Let me share a few thoughts on the Biden special counsel report.  —  First off, this is another example of the universal rule: Republican special counsels are chosen to investigate Democrats.  And Republican special counsels are chosen to investigate Republicans.",
    "url": "https://talkingpointsmemo.com/edblog/thoughts-on-the-hur-report"
  },
  {
    "text": "MSNBC's Joe Scarborough trashes special counsel's report  —  “So bizarre.  So many people immediately heard these random conclusions, irrelevant conclusions, politically charged, Trump-like ramblings,” Scarborough said.  —  MSNBC's Joe Scarborough attacked Special Counsel Robert Hur on … ",
    "url": "https://www.politico.com/news/2024/02/09/hur-biden-memory-special-counsel-00140656"
  },
  {
    "text": "Obama AG Eric Holder blasts special counsel's report  —  “Had this report been been subject to a normal DOJ review these remarks would undoubtedly have been excised,” Eric Holder said.  —  Former Attorney General Eric Holder slammed Special Counsel Robert Hur's report that contained observations on President Joe Biden's memory.",
    "url": "https://www.politico.com/news/2024/02/09/biden-hur-report-00140658"
  },
  {
    "text": "'It's devastating': Trump seizes unmatched control over GOP  —  Trump's influence was felt across the country, from Nevada to Congress to the Republican National Committee.  —  RENO, Nevada — Donald Trump long ago bent the Republican Party to his will.  But seldom has the sheer sweep … ",
    "url": "https://www.politico.com/news/2024/02/09/trump-gop-dominance-00140592"
  },
  {
    "text": "How Trump turned the GOP into the party of lawless disorder  —  Can Republicans win by promoting contempt for the rule of law?  We're about to find out. … As the GOP prepares for the third general election with Donald Trump at the head of its ticket, it is becoming clear that the 2024 race … ",
    "url": "https://www.publicnotice.co/p/trump-gop-lawless-disorder"
  },
  {
    "text": "Hogan running for Senate  —  Former Maryland Gov. Larry Hogan is launching a Senate bid, according to a person familiar with the matter.  The anti-Trump Republican is expected to file for the open Senate seat on Friday, the last day of the filing deadline.  Hogan is popular in Maryland … ",
    "url": "https://www.politico.com/live-updates/2024/02/08/congress/hogan-running-for-senate-00140681"
  },
  {
    "text": "Larry Hogan launches surprise Maryland Senate bid  —  Former Gov. Larry Hogan (R) announced on Friday that he's launching a surprise bid for the open Maryland Senate seat, despite speculation that he was considering a third-party presidential bid.  —  “We desperately need leaders willing … ",
    "url": "https://thehill.com/homenews/campaign/4458366-larry-hogan-maryland-senate/"
  },
  {
    "text": "Israel-Hamas war: Netanyahu orders Gaza's crowded Rafah evacuated ahead of an expected ground invasion  —  Israeli Prime Minister Benjamin Netanyahu on Friday said he has ordered the military to prepare a plan to evacuate civilians from Rafah ahead of an expected Israeli invasion of the densely populated southern Gaza city.",
    "url": "https://apnews.com/article/israel-hamas-war-news-02-09-2024-d3229eec6a85c071248d3ddc2de2a73e"
  },
  {
    "text": "‘Relentless and misleading’: Jack Smith shreds new Trump motion as proof he will ‘stop at nothing’ to delay Mar-a-Lago documents case  —  In a new motion, special counsel Jack Smith shredded Donald Trump's latest attempt to indefinitely delay the classified documents case in Florida … ",
    "url": "https://lawandcrime.com/trump/relentless-and-misleading-jack-smith-shreds-new-trump-motion-as-proof-he-will-stop-at-nothing-to-delay-mar-a-lago-documents-case/"
  },
  {
    "text": "Scoop — Forthcoming book on Jill Biden in 2022: “Why didn't anyone stop that? … President Biden and top aides were gathered in the Treaty Room, the president's study in the executive residence, after a press conference that ran nearly two hours. … - Suddenly, the group saw First Lady Jill Biden … ",
    "url": "https://www.axios.com/2024/02/09/forthcoming-book-jill-biden-why-didnt-anyone-stop-that"
  },
  {
    "text": "Inflation in December was even lower than first reported, the government says  —  The prices consumers pay in the marketplace rose at an even slower pace than originally reported, according to closely watched revisions the government released Friday.  —  Updates to the consumer price index showed … ",
    "url": "https://www.cnbc.com/2024/02/09/-inflation-in-december-was-even-lower-than-first-reported-the-government-says.html"
  },
  {
    "text": "‘It would be devastating’: inside Trump's plan to destroy the EPA  —  Trump has made campaign promises to toss crucial environmental regulations - including dismantling the federal body with the most power to tackle the climate crisis  —  Donald Trump and his advisers have made campaign promises … ",
    "url": "https://www.theguardian.com/us-news/2024/feb/09/trump-epa-plan-environment"
  },
  {
    "text": "Jury awards climate scientist Michael Mann $1 million in defamation lawsuit  —  A jury on Thursday awarded $1 million to climate scientist Michael Mann who sued a pair of conservative writers 12 years ago after they compared his depictions of global warming to a convicted child molester.",
    "url": "https://apnews.com/article/climate-change-defamation-michael-mann-penn-state-61289ee2d8d2143768d28995c83899ef"
  },
  {
    "text": "Revealed: rightwinger Leonard Leo linked to efforts to keep Trump on ballot  —  Federalist Society co-chair has ties to the groups arguing in the US supreme court case that Trump should stay on the Colorado ballot  —  The man behind the conservative effort to move the judiciary to the right … ",
    "url": "https://www.theguardian.com/law/2024/feb/09/leonard-leo-federalist-society-trump-ballot-supreme-court"
  },
  {
    "text": "Supreme Court almost certain to allow Trump to remain on Colorado's primary ballot  —  The justices appeared to be more concerned about what removing Trump from the ballot would do rather than whether the Constitution says he is disqualified.  —  After a little more than two hours of arguments Thursday … ",
    "url": "https://www.lawdork.com/p/supreme-court-trump-colorado-section-three"
  }
]