[
  {
    "text": "Shadowing Trump's attacks on mental fitness — his own father's dementia  —  Trump avoids mention of his father's Alzheimer's disease as he lashes Biden for being ‘cognitively impaired’  —  Donald Trump invited his extended family to Mar-a-Lago in the mid-1990s.",
    "url": "https://www.washingtonpost.com/politics/2024/03/20/donald-trump-dementia-father-fred-alzheimers-biden/"
  },
  {
    "text": "Liz Cheney still plans to make a difference in the election  —  Liz Cheney doesn't mince words about Donald Trump.  She calls the former president a “liar,” a “con man” and a potential “tyrant” who, if elected again, would “torch the Constitution” and its guarantees of free speech and rule of law.",
    "url": "https://www.washingtonpost.com/opinions/2024/03/19/liz-cheney-trump-biden-election-2024-difference/"
  },
  {
    "text": "Playbook: Sherrod Brown's dilemma  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  ABOUT LAST NIGHT — The biggest story from yesterday's elections was in Ohio, where former car dealer BERNIE MORENO … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/03/20/sherrod-browns-dilemma-00147970"
  },
  {
    "text": "Trump's “crazies” are back in his mix … - They're returning as Trump more aggressively touts Jan. 6 rioters as “patriots,” ramps up his racist, incendiary rhetoric — and embraces some of his most provocative loyalists. … - Trump's team is in talks to hire 2016 campaign advisers Paul Manafort … ",
    "url": "https://www.axios.com/2024/03/20/trump-far-righters-return"
  },
  {
    "text": "3 takeaways from primaries in Illinois, Ohio and elsewhere  —  With the general-election matchup between President Biden and former president Donald Trump solidified as of last week, Tuesday began the process of filling out the ballot in some key House and Senate races.",
    "url": "https://www.washingtonpost.com/politics/2024/03/19/gop-primaries-ohio-illinois-election-takeaways/"
  },
  {
    "text": "Three Points Separate Trump and Biden in Presidential Re-Match in North Carolina...Stein and Robinson Competitive in North Carolina Governor's Race  —  In North Carolina, former President Donald Trump edges President Joe Biden by three percentage points among, both, the statewide electorate … ",
    "url": "https://maristpoll.marist.edu/polls/the-battleground-2024-north-carolina/"
  },
  {
    "text": "Donald Trump Isn't Running A Presidential Campaign  —  It's a campaign for immunity from the law, and Democrats aren't doing nearly enough to counter it.  —  ∙ Paid  —  Every now and again it's fun to hold the unfiltered public comments of normal politicians up against the Donald Trump's ravings on social media.",
    "url": "https://www.offmessage.net/p/donald-trump-isnt-running-presidential-campaign"
  },
  {
    "text": "Divided Supreme Court lifts stay on a Texas law giving police broad powers to arrest migrants  —  A divided Supreme Court on Tuesday allowed Texas to begin enforcing a law that gives police broad powers to arrest migrants suspected of crossing the border illegally while a legal battle over the measure plays out.",
    "url": "https://apnews.com/article/supreme-court-migrant-arrests-texas-13ffaed316d16f42e928f6958f0658f2"
  },
  {
    "text": "Sanders sending Arkansas National Guard troops to US border with Mexico  —  Arkansas Gov. Sarah Huckabee Sanders (R) announced Tuesday that she would deploy state National Guard troops to aid Texas in its mission to combat the surge of migrants along the U.S.-Mexico border.",
    "url": "https://thehill.com/homenews/state-watch/4544155-sanders-sending-arkansas-national-guard-troops-to-border/"
  },
  {
    "text": "Judge Aileen Cannon Could Get Herself Booted From Trump's Classified Documents Case  —  The Trump-friendly judge is so obviously putting her thumb on the scales of justice in favor of the ex-president that she might not end up adjudicating the trial at all.",
    "url": "https://www.thedailybeast.com/judge-aileen-cannon-could-get-herself-booted-from-trumps-classified-documents-case"
  },
  {
    "text": "No Labels can't get a ‘yes’ on a candidate for 2024 — and there's a good reason why  —  It's tough to understand what's going on at No Labels, the centrist political group that is trying — and repeatedly failing — to find a candidate for its presidential ticket this year.",
    "url": "https://thehill.com/opinion/campaign/4544313-no-labels-cant-get-a-yes-on-a-candidate-for-2024-and-theres-a-good-reason-why/"
  },
  {
    "text": "Users ditch Glassdoor, stunned by site adding real names without consent  —  Anonymous review site Glassdoor now consults public sources to identify users.  —  Glassdoor, where employees go to leave anonymous reviews of employers, has recently begun adding real names to user profiles without users' consent … ",
    "url": "https://arstechnica.com/tech-policy/2024/03/glassdoor-adding-users-real-names-job-info-to-profiles-without-consent/"
  },
  {
    "text": "Banning abortion was the first step, not the last  —  They also won't stop with ending privacy rights. … When the United States Supreme Court overturned Roe v. Wade in 2022's Dobbs v. Jackson Women's Health Organization, Justice Samuel Alito's majority opinion smugly declared that … ",
    "url": "https://www.publicnotice.co/p/scotus-banning-abortion-was-the-first-step"
  },
  {
    "text": "Half a decade later, Christine Blasey Ford still has no corroborating witness  —  More than half a decade after Supreme Court Justice Brett Kavanaugh became the second of three Supreme Court justices appointed by former President Donald Trump, Christine Blasey Ford has reemerged from the wilderness of #Resistance-era one-hit wonders.",
    "url": "https://www.washingtonexaminer.com/opinion/2929011/half-decade-later-christine-blasey-ford-has-no-corroborating-witness/"
  },
  {
    "text": "Chubb ended Trump fraud bond talks after backing E. Jean Carroll appeal bond, court filing says  — Donald Trump and his co-defendants were in talks with insurance giant Chubb for a $464 million appeal bond, but the company backed out, a Trump Organization lawyer said.",
    "url": "https://www.cnbc.com/2024/03/19/chubb-ended-trump-fraud-bond-talks-after-e-jean-carroll-appeal-bond-court-filing.html"
  },
  {
    "text": "Judge declines to sanction Michael Cohen, lawyer over AI-generated fake case citations  —  A federal judge on Wednesday declined to sanction Michael Cohen and his lawyer for submitting fraudulent case citations generated by artificial intelligence (AI) - but chided them for the “embarrassing and certainly negligent” episode.",
    "url": "https://thehill.com/regulation/court-battles/4544339-judge-sanction-michael-cohen-lawyer-ai-generated-fake-case-citations/"
  },
  {
    "text": "Biden to tout government investing $8.5B in Intel's computer chip plants in four states  —  Biden plans to talk up the investment on Wednesday as he visits Intel's campus in Chandler, Arizona, which could be a decisive swing state in November's election.  —  WASHINGTON — The Biden administration … ",
    "url": "https://www.nbcnews.com/politics/economics/biden-tout-government-investing-85b-intels-computer-chip-plants-four-s-rcna144216"
  },
  {
    "text": "Ukraine races to build weapons at home  —  KYIV — Ukraine manufactured practically no weapons before Russia invaded in February 2022, but the local arms industry is now booming.  —  Factories spit out shells, mortar rounds, military vehicles, missiles and other items crucial to the war effort.",
    "url": "https://www.washingtonpost.com/world/2024/03/20/ukraine-weapons-industry-domestic-production/"
  },
  {
    "text": "Arizona lawmaker says she announced plans to get abortion to underscore out-of-touch laws  —  Democratic Sen. Eva Burch of Mesa told fellow lawmakers in a floor speech she was going to get an abortion because her pregnancy is no longer viable.  —  PHOENIX — A pregnant Arizona lawmaker … ",
    "url": "https://www.politico.com/news/2024/03/19/arizona-lawmaker-says-she-announced-plans-to-get-abortion-to-underscore-out-of-touch-laws-00147899"
  }
]