[
  {
    "text": "Exclusive: Musk aides lock government workers out of computer systems at US agency, sources say  —  Aides to Elon Musk charged with running the U.S. government human resources agency have locked career civil servants out of computer systems that contain the personal data of millions of federal employees … ",
    "url": "https://www.reuters.com/world/us/musk-aides-lock-government-workers-out-computer-systems-us-agency-sources-say-2025-01-31/"
  },
  {
    "text": "Elon Musk's Friends Have Infiltrated Another Government Agency  —  Elon Musk's former employees are trying to use White House credentials to access General Services Administration tech, giving them the potential to remote into laptops, read emails, and more, sources say.",
    "url": "https://www.wired.com/story/elon-musk-lackeys-general-services-administration/"
  },
  {
    "text": "Trump and Elon Musk Just Pulled Off Another Purge—and It's a Scary One  —  President Donald Trump has granted Elon Musk unprecedented power to carry out his war on the “deep state.”  The justification for this is supposed to be that the government is corrupted to its core precisely … ",
    "url": "https://newrepublic.com/article/191014/trump-elon-musk-treasury-purge"
  },
  {
    "text": "Elon's Twitter Destruction Playbook Hits The US Government, And It's Even More Dangerous  —  from the twisting-the-chaos-knob-on-the-levers- of-power dept  —  Remember how Elon Musk destroyed Twitter by ripping apart its infrastructure without understanding it?  Now imagine that same playbook applied to the federal government.",
    "url": "https://www.techdirt.com/2025/01/31/elons-twitter-destruction-playbook-hits-the-us-government-and-its-even-more-dangerous/"
  },
  {
    "text": "Acting on Trump's order, federal officials opened up two California dams  — The U.S. Army Corps of Engineers abruptly increased the amount of water flowing from two California dams.  — The federal agency made the decision after President Trump signed an order calling for increased water deliveries.",
    "url": "https://www.latimes.com/environment/story/2025-01-31/trump-california-dams-opened-up"
  },
  {
    "text": "Trump's emergency water order responsible for water dump from Tulare County lakes  —  The sudden announcement Thursday by the U.S. Army Corps of Engineers that Kaweah and Success lakes would immediately begin dumping water was in response to President Trump's Jan. 24 executive order mandating … ",
    "url": "https://sjvwater.org/trumps-emergency-water-order-responsible-for-water-dump-from-tulare-county-lakes/"
  },
  {
    "text": "Decision to dump water from Tulare County lakes altered after sending locals into a mad scramble  —  Water managers were relieved Thursday evening after the Army Corps of Engineers agreed to back off of a sudden decision earlier in the day to dump massive amounts of water from Kaweah and Success lakes.",
    "url": "https://sjvwater.org/decision-to-dump-water-from-tulare-county-lakes-altered-after-sending-locals-in-mad-scramble/"
  },
  {
    "text": "Trump says he opened California's water.  Local officials say he nearly flooded them.  —  The Army Corps of Engineers moved to release massive quantities of water in Central California, panicking local officials.  —  SACRAMENTO, California — President Donald Trump declared victory on Friday … ",
    "url": "https://www.politico.com/news/2025/01/31/trump-california-water-00201909"
  },
  {
    "text": "D.C. U.S. attorney fires Jan. 6 prosecutors, launches new probes  —  Ed Martin has fired Jan. 6 prosecutors, launched investigations of Capitol riot prosecutions and threatened the nation's top elected Democrat with an inquiry.  —  Interim D.C. U.S. attorney Edward R. Martin, Jr. … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2025/01/31/jan6-prosecutors-fired-dc-martin/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM4Mjk5NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM5NjgxOTk5LCJpYXQiOjE3MzgyOTk2MDAsImp0aSI6ImIzY2MwNGRkLWQwMzAtNDA5My05OTk3LTk5NTZjM2FlOTY4OCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9kYy1tZC12YS8yMDI1LzAxLzMxL2phbjYtcHJvc2VjdXRvcnMtZmlyZWQtZGMtbWFydGluLyJ9.3pq78sZul7y2sSaXNwbUu0TbWvTi3dJOHosFwnfH8EY&itid=gfta"
  },
  {
    "text": "FBI Agents Are Stunned by the Scale of the Expected Trump Purge  —  This afternoon, FBI personnel braced for a retaliatory purge of the nation's premiere law-enforcement agency, as President Donald Trump appeared ready to fire potentially hundreds of agents and officials who'd participated … ",
    "url": "https://www.theatlantic.com/politics/archive/2025/01/trump-fbi-revenge-firings/681538/?gift=HoRfrgrF5SCKopc-hfobxP4aJPfbiqptrE31ZTCGbn0&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Watch live coverage: Plane crash in Philadelphia leaves multiple houses on fire, causes explosion  —  Emergency crews are responding to an explosion in Northeast Philadelphia after a small medical jet crashed in the area of Roosevelt Boulevard and Cottman Avenue, Philadephia police confirmed to CBS News Philadelphia.",
    "url": "https://www.cbsnews.com/philadelphia/news/plane-crash-cottman-roosevelet/"
  },
  {
    "text": "Federal Judge Orders White House to Keep Money Flowing to 22 States  —  A court in Rhode Island issued a temporary restraining order to block Trump's directive to defund programs he considers to be “woke.”  —  A federal judge on Friday ordered the Trump administration to keep taxpayer dollars flowing … ",
    "url": "https://www.nytimes.com/2025/01/31/us/trump-freeze-blocked.html"
  },
  {
    "text": "Trump administration purges websites across federal health agencies  —  At the direction of the Trump administration, the federal Department of Health and Human Services and its agencies are purging its websites of information and data on a broad array of topics — from adolescent health to LGBTQ+ rights to HIV.",
    "url": "https://www.npr.org/sections/shots-health-news/2025/01/31/nx-s1-5282274/trump-administration-purges-health-websites"
  },
  {
    "text": "These Clowns are Economic Illiterates  —  Trump treats tariffs like a toddler treats a new word, repeating it endlessly without grasping its meaning in his stained, clutching hands.  —  Donald Trump has discovered tariffs again, and God help us all.  The President and souvenir coin salesman announced … ",
    "url": "https://www.theindex.media/these-clowns-are-economic-illiterates/"
  },
  {
    "text": "Trump Admin Emails Air Traffic Controllers: Quit Your Jobs  —  REALLY?!  —  Federal employees were told they could use their paid time off to explore “dream destinations” before quitting.",
    "url": "https://www.thedailybeast.com/trump-admin-emails-air-traffic-controllers-quit-your-jobs/"
  },
  {
    "text": "New York doctor indicted for prescribing abortion pill in Louisiana  —  A New York doctor was indicted by a Louisiana grand jury on Friday for allegedly prescribing an abortion pill online in the Deep South state, which has one of the strictest near-total abortion bans in the country.",
    "url": "https://apnews.com/article/abortion-indictment-lousiana-new-york-doctor-63ff4d9da8a9b592a7ca4ec7ba538cd3"
  },
  {
    "text": "“People Will Die”: The Trump Administration Said It Lifted Its Ban on Lifesaving Humanitarian Aid.  That's Not True.  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up to receive our biggest stories as soon as they're published.",
    "url": "https://www.propublica.org/article/trump-state-department-usaid-humanitarian-aid-freeze-ukraine-gaza-sudan"
  },
  {
    "text": "The Situation: Kash Patel's “Odor of Mendacity”  —  Any FBI agent who testified as the FBI Director nominee did would lose his job.  —  Meet The Authors … The Situation on Wednesday focused on the unique danger of Kash Patel among Donald Trump's nominees, in the context of the purge … ",
    "url": "https://www.lawfaremedia.org/article/the-situation--kash-patel-s--odor-of-mendacity"
  },
  {
    "text": "Trump Media gifts Patel, McMahon thousands of shares  —  Trump Media called the gifts in the filings “consideration for services provided” in 2024.  —  President Donald Trump's social media startup gifted more than $800,000 worth of stock each to Kash Patel, his nominee to run the FBI … ",
    "url": "https://www.politico.com/news/2025/01/31/trump-media-patel-mcmahon-shares-00201841"
  },
  {
    "text": "Federal employees told to remove pronouns from email signatures by end of day  —  The mandate is the latest effort in the Trump administration's push to end DEI.  —  President Donald Trump signs executive orders in the Oval Office at the White House in Washington, Jan. 30, 2025.",
    "url": "https://abcnews.go.com/US/federal-employees-told-remove-pronouns-email-signatures-end/story?id=118310483"
  },
  {
    "text": "Governors Identify 2 Soldiers Killed in Black Hawk Collision While Third Name Withheld by Service  —  Two of the three soldiers who were killed Wednesday when their Black Hawk helicopter collided with a passenger airline have been identified by service and public officials … ",
    "url": "https://www.military.com/daily-news/2025/01/31/2-soldiers-killed-tragic-midair-collision-dc-identified-army-withholds-third-name.html"
  },
  {
    "text": "Trump administration directs 70% cut to internal OPM staffing, programs  —  Trump administration officials are taking major steps to cut down the size of the workforce and federal programs at the Office of Personnel Management.  —  During an internal meeting Friday morning … ",
    "url": "https://federalnewsnetwork.com/management/2025/01/trump-administration-directs-opm-career-leaders-to-prepare-for-70-cut-to-staffing-programs/"
  }
]