[
  {
    "text": "Israel Knew Hamas's Attack Plan More Than a Year Ago  —  A blueprint reviewed by The Times laid out the attack in detail.  Israeli officials dismissed it as aspirational and ignored specific warnings.  —  Israeli officials obtained Hamas's battle plan for the Oct. 7 terrorist attack … ",
    "url": "https://www.nytimes.com/2023/11/30/world/middleeast/israel-hamas-attack-intelligence.html"
  },
  {
    "text": "Blinken said to tell Israel to change strategy for southern Gaza, suggest it won't have months to win war  —  According to leaked remarks from today's war cabinet meeting, attended by US Secretary of State Antony Blinken, Blinken told Israel it cannot operate in southern Gaza in the way it has done … ",
    "url": "https://www.timesofisrael.com/liveblog_entry/blinken-said-to-tell-israel-to-change-strategy-for-southern-gaza-suggest-it-wont-have-months-to-win-war/"
  },
  {
    "text": "Florida GOP Chair Christian Ziegler, husband of Moms For Liberty cofounder, accused of sexual assault by alleged menage a trois lover  —  Christian Ziegler, Florida's GOP chairman and husband of Sarasota County School Board member and Moms of Liberty co-founder Bridget Ziegler … ",
    "url": "https://flcga.org/florida-gop-chair-christian-ziegler-husband-of-a-moms-for-liberty-cofounder-accused-of-battery-by-alleged-menage-a-trois-lover/"
  },
  {
    "text": "Florida GOP chairman faces allegations of sexual battery  —  The allegations against Christian Ziegler are in a heavily redacted 14-page police report shared with NBC News on Thursday.  His attorney confirmed he is under investigation.  —  TALLAHASSEE, Fla. — Florida Republican Party … ",
    "url": "https://www.nbcnews.com/politics/politics-news/christian-ziegler-florida-gop-chairman-allegations-sexual-battery-rcna127430"
  },
  {
    "text": "MSNBC cancels Mehdi Hasan's show  —  The News  —  MSNBC is canceling outspoken opinion host Mehdi Hasan's weekend program and show on the streaming service Peacock.  —  Two people familiar with the move, which MSNBC privately announced to staff Thursday morning, told Semafor that Hasan … ",
    "url": "https://www.semafor.com/article/11/30/2023/msnbc-cancels-mehdi-hasans-show"
  },
  {
    "text": "The Trump dictatorship  —  Editor at large  —  Robert Kagan, a Post Opinions contributing editor, is the author of “Rebellion: How Antiliberalism Is Tearing America Apart — Again,” which will be published by Knopf in May.  —  Let's stop the wishful thinking and face the stark reality … ",
    "url": "https://www.washingtonpost.com/opinions/2023/11/30/trump-dictator-2024-election-robert-kagan/"
  },
  {
    "text": "Former U.S. Marine Pleads Guilty to Firebombing a Planned Parenthood Clinic in Orange County and Admits to Planning Additional Attacks  —  For Immediate Release  —  U.S. Attorney's Office, Central District of California  —  SANTA ANA, California - An Orange County man pleaded guilty today … ",
    "url": "https://www.justice.gov/usao-cdca/pr/former-us-marine-pleads-guilty-firebombing-planned-parenthood-clinic-orange-county-and"
  },
  {
    "text": "Florida Democrats plan to cancel presidential primary, enraging Dean Phillips' campaign  —  The representative says the state party has deliberately moved to keep him off the ballot.  Florida Dems say he is acting “unbecoming.”  —  Florida appears poised to hold no presidential primary election … ",
    "url": "https://www.politico.com/news/2023/11/30/florida-democrats-dean-phillips-election-00129403"
  },
  {
    "text": "Welcome to Our New ‘Bespoke Realities’  —  I've known conspiracy theorists my entire life.  In fact, there's probably a little bit of conspiracy theorist in each of us, myself included.  (Don't get me started on Game 6 of the 2002 N.B.A. Western Conference Finals.)",
    "url": "https://www.nytimes.com/2023/11/30/opinion/political-reality-algorithms.html"
  },
  {
    "text": "Former N.J. Trump golf club worker says she was sexually harassed, tricked into signing NDA  —  The allegations date back to 2021.  —  A former server at Trump National Golf Club in Bedminster alleges she was sexually harassed and coerced into sex by a supervisor, then tricked into signing … ",
    "url": "https://www.politico.com/news/2023/11/30/trump-golf-club-worker-sexually-harassment-lawsuit-00129307"
  },
  {
    "text": "Three US cities make list of most expensive in world  —  Story at a glance  — New York, Los Angeles and San Francisco are three of the most expensive cities on the planet to live in, according to a new report.  — New York tied with Geneva as the third most expensive city on earth … ",
    "url": "https://thehill.com/changing-america/respect/poverty/4335962-three-us-cities-make-list-of-most-expensive-in-world/"
  },
  {
    "text": "Biden lights the National Christmas Tree, taking his turn to bring holiday spirit to Washington  —  WASHINGTON (AP) — It was President Joe Biden 's turn to bring some holiday spirit to the U.S. capital.  —  The president and his wife, Jill, participated Thursday in the annual tradition … ",
    "url": "https://apnews.com/article/joe-biden-lighting-christmas-tree-national-730fb9076756772a664162b3a87c6261"
  },
  {
    "text": "‘She got so mad at me’: book on the ‘Squad’ details AOC-Pelosi clashes  —  Alexandria Ocasio-Cortez tells Ryan Grim life in Congress ‘completely transformed’ after Democratic leader stepped down  —  In a call to congratulate Alexandria Ocasio-Cortez on her momentous 2018 primary win over Joe Crowley … ",
    "url": "https://www.theguardian.com/books/2023/nov/30/squad-book-aoc-nancy-pelosi"
  },
  {
    "text": "Santos Relishes the Limelight Even as His Show Looks Likely to Close  —  Before the debate about his possible expulsion from Congress, George Santos seemed to embrace his starring role in a scandal of his own making.  —  It was likely to be his second-to-last day serving in Congress … ",
    "url": "https://www.nytimes.com/2023/11/30/us/politics/george-santos-expel-debate.html"
  },
  {
    "text": "Statement from President Biden on the Passing of Henry Kissinger  —  I'll never forget the first time I met Dr. Kissinger.  I was a young Senator, and he was Secretary of State—giving a briefing on the state of the world.  Throughout our careers, we often disagreed.  And often strongly.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2023/11/30/statement-from-president-biden-on-the-passing-of-henry-kissinger/"
  },
  {
    "text": "Dave Chappelle makes surprise visit to the Capitol ahead of evening show at The Anthem  —  Comedian Dave Chappelle made a surprise visit to the Capitol late Thursday afternoon, gathering with friends ahead of his Washington show in the evening.  —  While in the Capitol, the comedy legend took photos with staffers and lawmakers alike.",
    "url": "https://www.washingtonexaminer.com/news/house/dave-chappelle-surprise-capitol-visit-dc-weekend"
  },
  {
    "text": "Senate GOP stages hearing walkout to protest Supreme Court-related subpoenas  —  Tempers exploded at a Senate Judiciary Committee meeting Thursday before Democrats voted to subpoena a major conservative donor and a prominent conservative activist linked to the Supreme Court's ethics scandals.",
    "url": "https://thehill.com/homenews/senate/4335581-senate-gop-stages-hearing-walkout-to-protest-supreme-court-related-subpoenas/"
  },
  {
    "text": "Company statement  —  Novo Nordisk takes additional legal actions to help protect US patients from potentially unsafe and ineffective compounded drugs claiming to contain semaglutide that are not FDA approved … Novo Nordisk announced today, that as part of its ongoing commitment to patient safety … ",
    "url": "https://www.novonordisk-us.com/media/news-archive/news-details.html?id=166352"
  },
  {
    "text": "Trump spokesperson: DeSantis ‘so desperate for attention’ he's debating ‘Grade A loser’ Gavin Newsom  —  A Trump spokesperson said Florida Gov. Ron DeSantis (R) is “so desperate for attention” that he's debating a “Grade A loser” like California Gov. Gavin Newsom (D) Thursday.",
    "url": "https://thehill.com/homenews/campaign/4336611-trump-spokesperson-desantis-desperate-for-attention/"
  },
  {
    "text": "Sen. Rand Paul performs Heimlich maneuver on choking Joni Ernst  —  Paul performed the Heimlich maneuver on Ernst during a Thursday Senate lunch  —  Sen. Rand Paul, R-Ky., performed the Heimlich maneuver on Sen. Joni Ernst, R-Iowa who was choking on food.  —  The incident happened … ",
    "url": "https://www.foxnews.com/politics/sen-rand-paul-performs-heimlich-maneuver-choking-joni-ernst"
  },
  {
    "text": "Henry Kissinger, the Hypocrite  —  Henry Kissinger, who died on Wednesday, exemplified the gap between the story that America, the superpower, tells and the way that we can act in the world.  At turns opportunistic and reactive, his was a foreign policy enamored with the exercise of power … ",
    "url": "https://www.nytimes.com/2023/11/30/opinion/henry-kissinger-the-hypocrite.html"
  },
  {
    "text": "Mark Cuban says he's never running for elective office  —  Mark Cuban tells Axios that he never plans to run for any elective office, cooling off speculation that began after he struck a deal earlier this week to sell his majority stake in the Dallas Mavericks.",
    "url": "https://www.axios.com/2023/11/30/mark-cuban-president-not-running"
  },
  {
    "text": "The Rock's appearance on Rogan is proof that ‘cancel culture’ lost  —  Elon Musk was asked on Wednesday what his message was to companies that paused their ads on his X platform, after a campaign from the progressive activist group Media Matters pressuring companies to leave.  “I hope they stop.",
    "url": "https://thehill.com/opinion/campaign/4335881-the-rocks-appearance-on-rogan-is-proof-that-cancel-culture-lost/"
  },
  {
    "text": "Scoop: Inside the Biden White House's aggressive back-to-office push  —  White House Chief of Staff Jeff Zients, facing huge numbers of federal workers who aren't coming to the office, is privately pushing Cabinet secretaries to break their staffs' stubborn work-from-home habits.",
    "url": "https://www.axios.com/2023/11/30/biden-zients-federal-workers-return-to-office"
  }
]