[
  {
    "text": "Musk Shows Trump That He's the New Chaos in Town  —  If you haven't seen the details, the meltdown on Capitol Hill went from bad to worse this evening.  Or awesome to awesomer, depending on your perspective.  Let's review.  Donald Trump wanted a smooth ride to January 20th.",
    "url": "https://talkingpointsmemo.com/edblog/musk-shows-trump-that-hes-the-new-chaos-in-town"
  },
  {
    "text": "Senate Republicans fume over ‘fiasco’ in House  —  Senate Republicans were left fuming Thursday over what they called the dysfunctional “s— show” and “fiasco” they witnessed in the House as two proposals to fund the government through Christmas failed this week.",
    "url": "https://thehill.com/homenews/senate/5049966-senate-republicans-house-government-funding/"
  },
  {
    "text": "House GOP offers new plan to avert a government shutdown without Trump's debt limit demand  —  House Republicans are discussing the latest plan from leadership to fund the government and avoid a shutdown before a midnight deadline.  Several Republicans said the Rules Committee will meet … ",
    "url": "https://www.washingtonpost.com/politics/2024/12/20/government-shutdown-bill-house-trump-musk/"
  },
  {
    "text": "House Republicans reach new plan to avoid government shutdown after back-to-back defeats  —  House Republican negotiators have tentatively reached an agreement on averting a partial government shutdown at the end of Friday, sources told Fox News Digital.  —  Two people familiar … ",
    "url": "https://www.foxnews.com/politics/house-republicans-reach-deal-plan-c-avoid-government-shutdown-after-back-to-back-defeats-sources"
  },
  {
    "text": "Backlash builds as Elon Musk endorses Germany's far right  —  Elon Musk is backing the far-right Alternative for Germany (AfD), triggering an outcry in Berlin in the run-up to a critical snap election.  —  “Only the AfD can save Germany,” the billionaire X owner wrote on the platform on Friday … ",
    "url": "https://www.politico.eu/article/elon-musk-endorses-germanys-far-right/"
  },
  {
    "text": "Party City is going out of business  —  New York CNN  —  Party City is closing down all of its stores, ending nearly 40 years in business, CNN has learned.  —  CEO Barry Litwin told corporate employees Friday in a meeting viewed by CNN that Party City is “winding down” … ",
    "url": "https://www.cnn.com/2024/12/20/business/party-city-shut-down"
  },
  {
    "text": "Elon Musk is becoming a one-man rogue state - it's time we reined him in  —  He has bankrolled elections, stoked riots and ignored laws.  We mustn't make the mistake of playing nice with the world's richest bully  —  Elon Musk is, more or less, a rogue state.",
    "url": "https://www.theguardian.com/commentisfree/2024/dec/20/elon-musk-is-becoming-a-one-man-rogue-state-its-time-we-reined-him-in"
  },
  {
    "text": "Louisiana forbids public health workers from promoting COVID, flu and mpox shots  —  A group of high-level managers at the Louisiana Department of Health walked into a Nov. 14 meeting in Baton Rouge expecting to talk about outreach and community events.  —  Instead, they were told … ",
    "url": "https://www.npr.org/sections/shots-health-news/2024/12/20/nx-s1-5223440/louisiana-ban-public-health-promoting-covid-flu-mpox-vaccines-landry-rfk-jr-anti-vaccine"
  },
  {
    "text": "Major Trump donors who complained of immigrant ‘invasion’ used Mexican workers illegally, sources allege  —  Exclusive: Experts believe the alleged ‘shuttle support’ program used by Uline - a company owned by billionaires Liz and Dick Uihlein - is likely illegal and exploitative of workers",
    "url": "https://www.theguardian.com/us-news/2024/dec/20/uline-mexican-workers-trump"
  },
  {
    "text": "Musk vows to fund ‘moderate’ Democratic primary challengers  —  Elon Musk said he'll be funding moderate primary challengers to incumbent Democrats in deep-blue seats around the country, as he continues to try to influence a wide swath of government.  “Forgot to mention that I'm also going … ",
    "url": "https://www.politico.com/live-updates/2024/12/20/congress/elon-musk-democratic-primary-challengers-00195617"
  },
  {
    "text": "Elon Killed the Budget Deal.  Cancer Research for Kids Was Collateral Damage.  —  THE DECISION BY REPUBLICAN LEADERSHIP to scuttle a bipartisan funding deal on Thursday night has left lawmakers scrambling and others anxiously bracing for a government shutdown.",
    "url": "https://www.thebulwark.com/p/elon-musk-killed-budget-deal-children-cancer-funding-collateral-damage"
  },
  {
    "text": "As Musk forces a shutdown, the Trump presidency is already collapsing into chaos  —  Lies, conspiracy theories and middle-of-the-night rants are no way to run a country.  —  They're baaaack.  —  Just six weeks ago, voters elected Donald Trump by the slimmest of margins in hopes that he would lower the cost of living.",
    "url": "https://www.washingtonpost.com/opinions/2024/12/20/trump-musk-government-shutdown/"
  },
  {
    "text": "Judges increasingly alarmed as Trump's Jan. 6 clemency decision nears  —  “The rewriting of the history of Jan. 6, 2021, is incredibly disturbing,” Judge Beryl Howell said.  —  U.S. District Judge Tanya Chutkan says she has often reassured police officers traumatized by the violence of Jan. 6 … ",
    "url": "https://www.politico.com/news/2024/12/20/judges-trump-jan6-clemency-warnings-00195496"
  },
  {
    "text": "George Mason freshman, 18, busted for plotting attack on Israel's NYC consulate — as he was facing possible deportation  —  An 18-year-old freshman at George Mason University in Virginia was arrested Tuesday for allegedly plotting a mass casualty attack on Israel's General Consulate in New York City … ",
    "url": "https://nypost.com/2024/12/19/us-news/george-mason-freshman-18-busted-for-plotting-attack-on-israels-nyc-consulate-as-he-was-facing-possible-deportation/"
  },
  {
    "text": "Trump wants 5% Nato defence spending target, Europe told  —  US president-elect's closest foreign policy aides indicate he will continue arming Ukraine while pursuing end to war  —  Donald Trump's team has told European officials that the incoming US president will demand Nato member states … ",
    "url": "https://www.ft.com/content/35f490c5-3abb-4ac9-8fa3-65e804dd158f"
  },
  {
    "text": "Trump Moves to Replace Officials Whom New Presidents Traditionally Leave Alone  —  Congress devised some positions to stay on during changes in administrations.  But Donald Trump has declared his intent to replace at least three.  —  President-elect Donald J. Trump has moved to install loyalists … ",
    "url": "https://www.nytimes.com/2024/12/20/us/politics/trump-replace-officials.html"
  },
  {
    "text": "Trumpism's healthcare fracture-lines (permalink)  —  There was never any question as to whether Trump would implement Project 2025, the 900-page brick of terrifying and unhinged policy prescriptions edited by the Heritage Foundation.  He would not implement it, because he could not implement it.",
    "url": "https://pluralistic.net/2024/12/20/clinical-trial-by-ordeal/#spoiled-his-brand-new-rattle"
  },
  {
    "text": "Car drives into idyllic Germany Christmas market in suspected terrorist attack: report  —  At least 20 people are injured, and one reported to have been killed in a suspected terrorist attack  —  A festive Christmas market in Eastern Germany erupted into chaos after a car was driven into a group of people.",
    "url": "https://www.foxnews.com/world/car-drives-idyllic-germany-christmas-market-suspected-terrorist-attack-report"
  },
  {
    "text": "Postmortems Are Bad at Predictions: Democrats May Just Need a ‘Change’ Election  —  An opening will probably emerge for Democrats in four years, but it may not be what the party and pundits expect today.  —  There's a lot about politics that's hard to predict, but there's something you can count … ",
    "url": "https://www.nytimes.com/2024/12/20/upshot/election-democrats-postmortem.html"
  }
]