[
  {
    "text": "Georgia court website briefly publishes, removes document about potential Trump charges  —  The Fulton County, Georgia, court's website briefly posted a document on Monday listing several criminal charges against former U.S. President Donald Trump that appeared related to his attempts to overturn … ",
    "url": "https://www.reuters.com/legal/us-state-georgia-appears-set-file-charges-against-donald-trump-court-document-2023-08-14/"
  },
  {
    "text": "Why Georgia's case against Trump could be so damaging … - Willis is expected to present her case to a grand jury early this week. … - The law — inspired by federal statutes with the same name — allows prosecutors to string together crimes committed by different people toward one common goal.",
    "url": "https://www.axios.com/2023/08/14/trump-georgia-rico-charges-fani-willis"
  },
  {
    "text": "Georgia on My Mind: A Fourth Trump Indictment Needs Something Other Than ‘The Call’  —  A Facebook icon representing an external link to share the article on Facebook.A Twitter icon representing an external link to share the article on Twitter.An Email icon that opens an email with the article link … ",
    "url": "https://themessenger.com/opinion/georgia-on-my-mind-a-fourth-trump-indictment-needs-something-other-than-the-call"
  },
  {
    "text": "‘Fully expected the downfall’: Inside DeSantis's brawls with Fla. Republicans  —  Some who knew the Florida governor in Tallahassee say they expected him to have trouble translating his governance of the state into a coalition that could win him the presidency",
    "url": "https://www.washingtonpost.com/politics/2023/08/14/desantis-florida-republicans-2024-election/"
  },
  {
    "text": "Trump's Bid to Sink the Manhattan DA's Case Has Already Made It Stronger  —  Trump tried to drag the Manhattan DA into federal court and failed.  Now a judge's order in that case can be used to persuade a state court that Trump's charges should stick.  —  Donald Trump's attempts this summer … ",
    "url": "https://www.thedailybeast.com/trumps-bid-to-sink-the-manhattan-da-alvin-braggs-case-has-already-made-it-stronger"
  },
  {
    "text": "Trump jabs at judge in election case, testing warning against ‘inflammatory’ statements  —  Overnight, Trump called Chutkan ‘biased and unfair’ for comments during 2022 sentencing of Jan. 6 defendant.  —  Donald Trump slammed the judge presiding over his newest criminal case early Monday … ",
    "url": "https://www.politico.com/news/2023/08/14/trump-inflammatory-comments-judge-chutkan-00111041"
  },
  {
    "text": "RFK Jr. backs 15-week federal ban on abortion, then reverses himself  —  “Today, Mr. Kennedy misunderstood a question,” his campaign said.  —  Democratic presidential candidate Robert F. Kennedy Jr. on Sunday said he would support a federal ban on abortion after the first three months of pregnancy … ",
    "url": "https://www.politico.com/news/2023/08/13/rfk-jr-backs-15-week-federal-ban-on-abortion-00111017"
  },
  {
    "text": "McConnell in Winter: Inside the GOP Leader's Attempt to Thwart Trump  —  The Kentucky Republican is doing all he can to bolster Ukraine, preserve NATO and help his party maintain its Reaganite roots.  —  From the Senate floor and Washington fundraisers to awards banquets … ",
    "url": "https://www.politico.com/news/magazine/2023/08/14/mitch-mcconnell-trump-00110969"
  },
  {
    "text": "Defense Secretary Lloyd Austin blasts GOP senator's blockade of military promotions as ‘unnecessary’ and ‘unsafe’  —  Austin said the hold on nominations meant that “for the first time in the history of the Department of Defense, three of our military services are operating without Senate-confirmed leaders.”",
    "url": "https://www.nbcnews.com/politics/politics-news/defense-secretary-lloyd-austin-blasts-gop-senators-blockade-military-p-rcna99759"
  },
  {
    "text": "Hunter Biden Says Prosecutors Reneged on Major Part of Plea Deal  —  The move is the latest salvo in the back and forth between Mr. Biden and David C. Weiss, the federal prosecutor who was appointed special counsel last week.  —  Hunter Biden told a federal judge late Sunday that the Justice Department … ",
    "url": "https://www.nytimes.com/2023/08/14/us/politics/hunter-biden-plea-deal-weiss.html"
  },
  {
    "text": "Trump's ‘Co-Conspirators’ Are Already Starting to Turn on Each Other  —  “It is the 'please don't put me in jail, put that other guy in jail' strategy,” says one attorney working in Trump's legal orbit … A number of the ex-president's chief lieutenants and alleged co-conspirators in the plot … ",
    "url": "https://www.rollingstone.com/politics/politics-features/donald-trump-jack-smith-coconspirators-rudy-giuliani-1234806292/"
  },
  {
    "text": "In a small Kansas town, a brazen attack on press freedom  —  “These are Hitler tactics, and something has to be done.”  —  Those were the words of 98-year-old Joan Meyer, the co-owner of the Marion County Record, after her home and office were raided by the City of Marion's entire five-person police department on Friday.",
    "url": "https://popular.info/p/in-a-small-kansas-town-a-brazen-attack"
  },
  {
    "text": "David McCormick is gearing up for a Senate run in Pennsylvania.  But he lives in Connecticut  —  David McCormick had a clear explanation for why his fellow Republican, Dr. Mehmet Oz, lost a critical Pennsylvania Senate seat: Voters viewed the daytime television celebrity as an interloper … ",
    "url": "https://apnews.com/article/pennsylvania-mccormick-residency-mansion-connecticut-oz-e84500b848f0be7efb9f9b3c495dd066"
  },
  {
    "text": "Karen Pence ‘never felt afraid’ on Jan. 6: ABC News Exclusive  —  The former second lady said she felt “God's presence” despite the attack.  —  On Jan. 6, 2021, when then-second lady Karen Pence drew the curtains of the vice president's ceremonial office on Capitol Hill … ",
    "url": "https://abcnews.go.com/Politics/karen-pence-felt-afraid-jan-6-abc-news/story?id=102238270"
  },
  {
    "text": "Enes Freedom on Trans Athletes: ‘Should I Put on a Wig’ and Dominate the WNBA?  —  Enes Kanter Freedom took a shot at transgender athletes and wondered how fair it would be if he “put on a wig” and then joined the Women's National Basketball Association.  —  On Friday, the former NBA star … ",
    "url": "https://www.breitbart.com/sports/2023/08/14/enes-freedom-trans-athletes-should-i-put-on-a-wig-and-dominate-the-wnba/"
  },
  {
    "text": "GOP sees turnout disaster without Trump  —  Republican strategists are worried that if former President Trump doesn't secure the GOP's presidential nomination next year, or if he is kept off the ballot because of his mounting legal problems, it could spell a voter turnout disaster for their party in 2024.",
    "url": "https://thehill.com/homenews/senate/4149548-gop-sees-turnout-disaster-without-trump/"
  }
]