[
  {
    "text": "Rep. Dean Phillips will challenge Biden in Democratic presidential race: “This is an election about the future”  —  Rep. Dean Phillips of Minnesota has decided to challenge President Biden for the Democratic presidential nomination and will launch his 2024 campaign on Friday in New Hampshire … ",
    "url": "https://www.cbsnews.com/news/dean-phillips-biden-presidential-primary-challenge/"
  },
  {
    "text": "Judge orders Ivanka Trump to testify in $250 million fraud case  —  Judge Arthur Engoron agreed with the AG's office that her testimony is necessary, even though she's no longer a defendant in the case.  —  The judge overseeing the $250 million civil trial against Donald Trump and his company ordered … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/judge-orders-ivanka-trump-testify-250-million-fraud-case-rcna122482"
  },
  {
    "text": "Ivanka Trump Must Testify At Donald Trump's Civil Fraud Trial, Judge Rules  —  The ruling came weeks into the trial of New York Attorney General Letitia James' lawsuit against Trump, sons Don Jr. and Eric, the Trump Organization and some executives.  —  LOADING",
    "url": "https://www.huffpost.com/entry/trump-fraud-lawsuit-ivanka-testify_n_653b98c8e4b0d69ae706d83c"
  },
  {
    "text": "Ivanka Trump Loses Bid to Block Subpoena Forcing Her Testimony in Her Father's New York Civil Fraud Case  —  The former president's daughter was initially a defendant in the civil fraud case, until succeeding in dismissing the counts against her on appeal  —  JWPlayer",
    "url": "https://themessenger.com/politics/ivanka-trump-must-testify-fraud-judge-engoron"
  },
  {
    "text": "Trump Jr. Hits RFK Jr. in Iowa: ‘A Democrat Plant’  —  Trump Jr. said that Kennedy should be ‘much more of a threat’ than President Joe Biden  —  Donald Trump Jr., the son of former President Donald Trump, told Iowans while volunteering for his father's 2024 presidential campaign … ",
    "url": "https://themessenger.com/politics/trump-jr-hits-rfk-jr-in-iowa-a-democrat-plant"
  },
  {
    "text": "Hearings begin as Trump critics attempt to kick him off ballots  —  Lawsuits in Colorado and Minnesota center on the 14th Amendment, which bars those who engage in an insurrection from running for office  —  In two courtrooms 900 miles apart, judges next week will begin to weigh an unprecedented … ",
    "url": "https://www.washingtonpost.com/politics/2023/10/27/trump-14th-amendment-colorado-minnesota/"
  },
  {
    "text": "Tlaib is the very threat to democracy Democrats warned about  —  For about six years, Democratic politicians and pundits have promoted the phrase “threat to our democracy.”  It was entirely based on constructing a political narrative through fearmongering propaganda meant to brainwash … ",
    "url": "https://www.washingtonexaminer.com/opinion/tlaib-is-very-threat-to-democracy-democrats-warned-about"
  },
  {
    "text": "Trump's Vanishing Act: Why Trump Rallies Are Going Extinct  —  Trump has been holding about two rallies per month.  That's way down from his previous campaigns, like in 2016 when he held 323 rallies, or 70 rallies during COVID. … Vanishing Act  —  DERRY, New Hampshire … ",
    "url": "https://www.thedailybeast.com/trumps-vanishing-act-why-trump-rallies-are-going-extinct"
  },
  {
    "text": "Some of Trump's closest allies have yet to be offered plea deals in Georgia case  —  Mark Meadows, Rudy Giuliani and John Eastman among those who may have to go to trial, people close to the matter say  —  Donald Trump's top co-defendants charged with conspiring to overturn the 2020 election results … ",
    "url": "https://www.theguardian.com/us-news/2023/oct/27/trump-trial-georgia-no-plea-deals-mark-meadows-rudy-giuliani-john-eastman"
  },
  {
    "text": "Jenna Ellis's long, strange trip to disgrace  —  In court, she's contrite.  On social media?  Not so much. … On November 19, 2020, Trump campaign lawyer Jenna Ellis stood on the stage at the RNC flanked by Rudy Giuliani and Sidney Powell and vowed that “an elite strikeforce team” … ",
    "url": "https://www.publicnotice.co/p/jenna-ellis-guilty-plea-statement-biography"
  },
  {
    "text": "Make Mike Johnson Famous  —  If Republicans vote for a medieval insurrectionist, and nobody knows, does it count?  —  I had hoped, without really expecting, that the 20-plus member GOP rebellion against Jim Jordan's efforts to shove himself down their throats would bloom into a greater struggle … ",
    "url": "https://www.offmessage.net/p/make-mike-johnson-famous"
  },
  {
    "text": "‘He Seems to Be Saying His Commitment Is to Minority Rule’  —  A Q&A with historian Kristin Kobes Du Mez on the Christian nationalist ideas that shaped House Speaker Mike Johnson.  —  Speaker Mike Johnson, a Shreveport, Louisiana, native, entered politics after spending … ",
    "url": "https://www.politico.com/news/magazine/2023/10/27/mike-johnson-christian-nationalist-ideas-qa-00123882"
  },
  {
    "text": "NRCC chair dishes on Johnson  —  THE TOP … He's bringing his longtime chief of staff Hayden Haynes to work in the speaker's office.  And the new speaker is busy searching for a top foreign policy aide, a member services director and a policy director.  —  Yet maybe no organ … ",
    "url": "https://punchbowl.news/newsletter/"
  },
  {
    "text": "Former Arizona GOP Senate candidate Blake Masters is running for Congress  —  Masters, a venture capitalist, lost a race last year against Democratic Sen. Mark Kelly.  —  PHOENIX — Republican Blake Masters, who lost to Democratic Sen. Mark Kelly in last year's midterm election … ",
    "url": "https://www.nbcnews.com/politics/2024-election/former-arizona-gop-senate-candidate-blake-masters-running-congress-rcna122463"
  },
  {
    "text": "Secretary of Defense Lloyd J. Austin III's Statement on U.S. Military Strikes in Eastern Syria  —  Today, at President Biden's direction, U.S. military forces conducted self-defense strikes on two facilities in eastern Syria used by Iran's Islamic Revolutionary Guard Corps (IRGC) and affiliated groups.",
    "url": "https://www.defense.gov/News/Releases/Release/Article/3570798/secretary-of-defense-lloyd-j-austin-iiis-statement-on-us-military-strikes-in-ea/"
  },
  {
    "text": "Congress' Job Approval Drops to 13%, Lowest Since 2017  —  WASHINGTON, D.C. — Amid a prolonged search for a new House speaker that paralyzed the House of Representatives for three weeks while two U.S. allies are engaged in wars, Americans' approval of Congress' job performance fell from 17% to 13%.",
    "url": "https://news.gallup.com/poll/513410/congress-job-approval-drops-lowest-2017.aspx"
  },
  {
    "text": "Is the Republican Speakership Cursed?  Johnson Is About to Find Out.  —  Kevin McCarthy was just the latest in a series of Republican speakers and speaker wannabes who faced revolts.  Speaker Mike Johnson should take note.  —  Republicans didn't have a speaker for 40 years until Newt … ",
    "url": "https://www.nytimes.com/2023/10/27/us/politics/house-speaker-johnson-republicans.html"
  },
  {
    "text": "New House Speaker Thinks Creationist Museum Is ‘Pointing People To The Truth’  —  An ark replica with dinosaurs “is one way to bring people to this recognition ... that what we read in the Bible are actual historical events,” Mike Johnson said.  —  Before arriving in Washington less than a decade ago … ",
    "url": "https://www.huffpost.com/entry/mike-johnson-young-earth-creationist_n_653adc81e4b0d69ae7068a0b"
  },
  {
    "text": "One-way plane tickets: NYC offers migrants free travel anywhere to move  —  New York City is moving migrants out of shelters and offering them plane tickets to anywhere in the world.  —  NEW YORK — Here's one approach to discourage migrants from settling in New York City: Give them a free, one-way plane ticket out of town.",
    "url": "https://www.politico.com/news/2023/10/26/migrants-nyc-plane-rides-00123778"
  },
  {
    "text": "A barrage and a midair explosion: What visual evidence shows about the Gaza hospital blast  —  Videos analyzed by The Post reveal that rockets were launched from Gaza in the direction of the hospital 44 seconds before an explosion there  —  Fighters in Gaza launched a barrage of rockets toward Israel … ",
    "url": "https://www.washingtonpost.com/investigations/2023/10/26/gaza-hospital-blast-evidence-israel-hamas/"
  },
  {
    "text": "Intruder Arrested Twice Wednesday at RFK, Jr.'s Home  —  On Wednesday an intruder was arrested after climbing a fence at the residence of Robert F. Kennedy, Jr.  —  Protectors from Gavin de Becker & Associates (GDBA) detected and detained the intruder, who asked to see the candidate.",
    "url": "https://www.kennedy24.com/intruder_arrested_twice_wednesday_rfk_jr_home"
  },
  {
    "text": "Treasury Targets Additional Sources of Support and Financing to Hamas  —  WASHINGTON — Today, the U.S. Department of the Treasury's Office of Foreign Assets Control (OFAC) imposed a second round of sanctions on key Hamas-linked officials and financial networks following the October 7 barbaric attacks … ",
    "url": "https://home.treasury.gov/news/press-releases/jy1845"
  },
  {
    "text": "Israel War: John Kirby blasts reporter over criticism of US response to Gaza death figures  —  National Security Council spokesman John Kirby blasted a reporter for asking a question critical of President Joe Biden's response to the war in Gaza.  —  Referencing remarks where Biden said he had … ",
    "url": "https://www.washingtonexaminer.com/news/white-house/john-kirby-blasts-reporter-us-gaza-war"
  }
]