[
  {
    "text": "The Hill's Morning Report — Democrats see red with Manchin's retirement  —  Editor's note: The Hill's Morning Report is our daily newsletter that dives deep into Washington's agenda.  To subscribe, click here or fill out the box below.  —  Close  —  Thank you for signing up!",
    "url": "https://thehill.com/newsletters/morning-report/4303834-the-hills-morning-report-democrats-see-red-with-manchins-retirement/"
  },
  {
    "text": "Playbook: Why Congress could sleepwalk into a shutdown  —  Presented by With help from Eli Okun and Garrett Ross  —  DRIVING THE DAY  —  DEBATE WINDFALLS — Florida Gov. RON DeSANTIS raised more than $1 million in the 24 hours after Wednesday night's GOP debate in Miami, we're told by his campaign.",
    "url": "https://www.politico.com/newsletters/playbook/2023/11/10/why-congress-could-sleepwalk-into-a-shutdown-00126552"
  },
  {
    "text": "The Warnings About Trump in 2024 Are Getting Louder  —  A judge's plea, Hillary Clinton invokes the H-word, and a shock poll in the Times.  —  Donald Trump often takes the breath away with his defiance of the basic norms of American public life.  (See: January 6th.)",
    "url": "https://www.newyorker.com/news/letter-from-bidens-washington/the-warnings-about-trump-in-2024-are-getting-louder"
  },
  {
    "text": "Trump's right, the system is RIGGED.  In his favor.  —  This free edition of Public Notice is made possible by paid subscribers.  If you aren't one already, please consider signing up.  Just click the button below.  —  Click for Public Notice free trial",
    "url": "https://www.publicnotice.co/p/trump-trials-engoron-james-jack-smith-rigged"
  },
  {
    "text": "Judge in classified documents case rejects Trump's request to delay May trial date  —  The federal judge had announced in July that the trial would begin on May 20 in Fort Pierce, Florida.  —  A federal judge on Friday declined former President Donald Trump's request to postpone the May start date … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/judge-classified-documents-case-rejects-trumps-request-delay-may-trial-rcna124614"
  },
  {
    "text": "McCarthy Predicts Nancy Mace's Downfall After She Voted Him Out  —  ‘LIVING RENT FREE’  —  Rep. Kevin McCarthy (R-CA) on Thursday ripped into the Republicans who banded together to oust him from his position as House Speaker last month, prophesying that at least one of them could be nearing the end of their political career.",
    "url": "https://www.thedailybeast.com/kevin-mccarthy-predicts-downfall-of-nancy-mace-after-she-helps-push-him-out-of-speakership"
  },
  {
    "text": "Update on Fort Totten Park metal canister investigation  —  WASHINGTON— An area of Fort Totten Park remains closed and fenced, and cement barriers and “no trespassing” signs will remain while the National Park Service (NPS) and U.S. Army further investigate the metal canisters … ",
    "url": "https://www.nps.gov/rocr/learn/news/2023-11-09-fort-totten-park-update.htm"
  },
  {
    "text": "Federal appeals court calls Biden's ‘ghost gun’ limits unlawful  —  So-called ghost guns are difficult for law enforcement to trace because they can be assembled from kits that can be bought online or at a store without a background check.  —  A federal appeals court on Thursday ruled … ",
    "url": "https://www.nbcnews.com/politics/politics-news/federal-appeals-court-calls-bidens-ghost-gun-limits-unlawful-rcna124601"
  },
  {
    "text": "Arizona fake electors led vocal campaign to overturn the 2020 election — they're now part of a ‘robust’ state investigation  —  They called it “The Signing.”  Eleven fake electors for President Donald Trump convened at the state Republican Party headquarters in Phoenix, Arizona, on December 14, 2020.",
    "url": "https://www.cnn.com/2023/11/10/politics/arizona-fake-electors-kifle-invs/"
  },
  {
    "text": "How the GOP muzzled the quiet coalition that fought foreign propaganda  —  The FBI put a pause on briefings with tech companies due to an ongoing lawsuit, adding to a broader breakdown in a system meant to guard against influence operations and to ensure election integrity.",
    "url": "https://www.nbcnews.com/tech/tech-news/gop-muzzled-quiet-coalition-fought-foreign-propaganda-rcna103373"
  },
  {
    "text": "Under new speaker, some Republicans hope impeachment inquiry will lose steam  —  The inquiry stagnated during the 3-week fight to elect a new speaker.  Now, James Comer has sent out new subpoenas as Speaker Mike Johnson strikes a more reserved tone.  —  During the 22-day fight to fill … ",
    "url": "https://www.washingtonpost.com/politics/2023/11/10/biden-impeachment-inquiry-speaker-johnson/"
  },
  {
    "text": "Where's Melania?  —  The former first lady isn't too hard to find.  So why does it feel like she's hiding?  —  PALM BEACH, Fla. — On an October morning, before the club had opened for its winter season, all was quiet at Mar-a-Lago.  The five clay tennis courts were unblemished.",
    "url": "https://www.washingtonpost.com/style/power/2023/11/10/where-is-melania-trump/"
  },
  {
    "text": "Rep. Elise Stefanik files ethics complaint against judge in Trump's civil fraud trial  —  The senior House Republican and close Trump ally accused Judge Arthur Engoron of “weaponized law fare” against the former president and called on the judge to recuse himself.",
    "url": "https://www.nbcnews.com/politics/donald-trump/stefanik-files-ethics-complaint-judge-engoron-trump-trial-rcna124554"
  },
  {
    "text": "Ramaswamy camp: The RNC sabotaged us in the debate spin room  —  There is bad blood brewing here.  —  Vivek Ramaswamy's campaign accused Republican National Committee Chair Ronna McDaniel of trying to limit his campaign's visibility in the post debate spin room, following critical remarks he made of her at the forum.",
    "url": "https://www.politico.com/news/2023/11/09/ramaswamy-camp-rnc-sabotage-debate-spin-room-00126446"
  },
  {
    "text": "Billionaire FBI informant Peter Thiel dished about two Kremlin invites to private Putin meetings … It was the perfect hunting ground for a Kremlin operative looking to get his hooks into Peter Thiel, one of the most powerful men in Silicon Valley: an extravagant birthday party with hundreds of guests … ",
    "url": "https://www.businessinsider.com/fbi-peter-thiel-vladimir-putin-russia-christian-angermayer-daniil-bisslinger-2023-11?op=1"
  },
  {
    "text": "Did Trump violate campaign finance laws (again)?  —  The most newsworthy part of Barton Gellman's new interview of tech entrepreneur Peter Thiel for the Atlantic is that Thiel is swearing off campaign contributions.  He'd been a big donor to Donald Trump's 2016 campaign, earning a speaking spot at that year's convention.",
    "url": "https://www.washingtonpost.com/politics/2023/11/10/thiel-trump-analysis/"
  },
  {
    "text": "MTG Is Trashing Lauren Boebert as a ‘Whore’ to GOP Colleagues  —  Greene and Boebert have been going at it for nearly a year now.  But Greene's latest move is straight out of the high school cafeteria's playbook. … After Rep. Lauren Boebert helped get Rep. Marjorie Taylor Greene kicked … ",
    "url": "https://www.thedailybeast.com/marjorie-taylor-greene-is-trashing-lauren-boebert-as-a-whore-to-gop-colleagues"
  },
  {
    "text": "County elections offices receive suspicious envelopes  — County elections offices receive suspicious envelopes  —  OLYMPIA — Envelopes received by elections offices in King, Pierce, Skagit, and Spokane counties were found Wednesday to contain unknown powdery substances.",
    "url": "https://www.sos.wa.gov/about-office/news/2023/county-elections-offices-receive-suspicious-envelopes"
  },
  {
    "text": "Putin's long war gamble could be paying off  —  As Russia's invasion of Ukraine nears the end of its second year, a conclusion to the conflict seems as distant as ever.  —  Kyiv's counteroffensive has failed to decisively break through the Russian Army's prepared defenses in Ukraine's southern and eastern regions.",
    "url": "https://thehill.com/opinion/international/4302241-putins-long-war-gamble-could-be-paying-off/"
  },
  {
    "text": "‘Buying influence’: top US nuclear board advisers are tied to arms business  —  Nine of 12 members of the commission charged with avoiding nuclear conflict have financial ties to defense contractors  —  Co-published with Responsible Statecraft  —  Nine of the 12 members … ",
    "url": "https://www.theguardian.com/world/2023/nov/10/us-congress-nuclear-weapon-committee-conflict-interest"
  },
  {
    "text": "How Abortion Could Define the 2024 Presidential Race  —  With two election cycles after the decision in Dobbs v. Jackson Women's Health Organization under our belts, it cannot be denied: Abortion rights are the dominant issue in American politics.  And when supporters of abortion rights … ",
    "url": "https://www.nytimes.com/2023/11/10/opinion/abortion-presidential-election-biden.html"
  },
  {
    "text": "FEC Commissioner Calls Out Her GOP Colleagues in Brutal 5-Sentence Takedown  —  SPECIAL TREATMENT  —  FEC Commissioner Ellen Weintraub on Thursday said her Republican colleagues have effectively put former President Donald Trump “in [a] category by himself” by refusing to investigate … ",
    "url": "https://www.thedailybeast.com/fec-commissioner-calls-out-her-gop-colleagues-in-brutal-5-sentence-takedown"
  }
]