[
  {
    "text": "Live Updates: Trump Lashes Out at Israel and Iran as Fragile Truce Is Tested  —  Mr. Trump suggested that both Israel and Iran had continued fighting despite a cease-fire that both had agreed to hours earlier.  He warned Israel that further attacks would be a “major violation.”  —  Beersheba, Israel",
    "url": "https://www.nytimes.com/live/2025/06/24/world/ceasefire-iran-israel-trump?unlocked_article_code=1.RU8.rCan.toHYhYBQKsMQ&smid=url-share"
  },
  {
    "text": "Devastating Poll Shows Trump What Americans Think of His Bombings  —  REALITY CHECK  —  The president launched a tirade against CNN right after the poll aired.  —  A bombshell CNN poll found that a clear majority of Americans disapprove of President Trump's decision to launch airstrikes in Iran.",
    "url": "https://www.thedailybeast.com/devastating-poll-shows-trump-what-americans-think-of-his-bombings/"
  },
  {
    "text": "A majority of Americans disapproves of Trump's Iran airstrikes, CNN poll finds  —  President Donald Trump's decision to launch airstrikes against Iran is broadly unpopular with Americans, according to a new CNN poll conducted by SSRS after the strikes.  —  Americans disapprove of the strikes … ",
    "url": "https://cnn.com/2025/06/24/politics/trump-iran-strikes-poll-cnn-ssrs"
  },
  {
    "text": "Trump nominated for Nobel Peace Prize over Iran-Israel ceasefire deal  —  Rep Buddy Carter credits President Donald Trump with preventing Iran from obtaining ‘most lethal weapon on the planet’  —  FIRST ON FOX: A House lawmaker is nominating President Donald Trump for the Nobel Peace Prize … ",
    "url": "https://www.foxnews.com/politics/trump-nominated-nobel-peace-prize-over-iran-israel-ceasefire-deal"
  },
  {
    "text": "The Shock-and-Awe Deportations Will Get Worse  —  Last night, Donald Trump sounded relieved as he announced an Israel and Iran ceasefire.  “CONGRATULATIONS TO EVERYONE!” he wrote.  “This is a War that could have gone on for years, and destroyed the entire Middle East, but it didn't, and never will!”",
    "url": "https://www.thebulwark.com/p/the-shock-and-awe-deportations-will-get-worse-supreme-court-trump-israel-iran"
  },
  {
    "text": "Exclusive: Early US intel assessment suggests strikes on Iran did not destroy nuclear sites, sources say  —  The US military strikes on three of Iran's nuclear facilities last weekend did not destroy the core components of the country's nuclear program and likely only set it back by months … ",
    "url": "https://cnn.com/2025/06/24/politics/intel-assessment-us-strikes-iran-nuclear-sites"
  },
  {
    "text": "Strike Set Back Iran's Nuclear Program by Only a Few Months, U.S. Report Says  —  Classified findings indicate that the attack sealed off the entrances to two facilities but did not collapse their underground buildings.  —  A preliminary classified U.S. report says the American bombing … ",
    "url": "https://www.nytimes.com/2025/06/24/us/politics/iran-nuclear-sites.html"
  },
  {
    "text": "Justice Dept. Leader Suggested Violating Court Orders, Whistle-Blower Says  —  Emil Bove III, a Trump judicial nominee, voiced his intent to disobey court orders as others stonewalled and misled judges, according to a complaint.  —  A senior Justice Department official, Emil Bove III … ",
    "url": "https://www.nytimes.com/2025/06/24/us/politics/justice-department-emil-bove-trump-deportations-reuveni.html?unlocked_article_code=1.RU8.o_g5.739ROt8Cpqgp&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Guardsmen sent to LA are 130 miles east of the city doing drug busts  —  California National Guard soldiers operating under federal orders helped the Drug Enforcement Agency and other federal personnel carry out a raid on a large marijuana growth operation in the eastern Coachella Valley last week, 130 miles from downtown Los Angeles.",
    "url": "https://taskandpurpose.com/news/national-guard-drug-busts-la-area/"
  },
  {
    "text": "Chip Roy says he means it this time  —  Good Tuesday afternoon, and a brief word of thanks for the miracle of air conditioning.  —  Senate Republicans are scrambling to finalize their version of the GOP megabill, pass it this weekend and then get out of town.  They're not much concerned at the moment with what happens after that.",
    "url": "https://www.politico.com/newsletters/inside-congress-updates/2025/06/24/chip-roy-megabill-00421047"
  },
  {
    "text": "This Is the Worst Supreme Court Decision of Trump's Second Term  —  On Monday, the Supreme Court lifted an injunction that had protected immigrants from removal to dangerous countries where they could face torture and death.  The Trump administration argues that it can expel immigrants to … ",
    "url": "https://slate.com/news-and-politics/2025/06/worst-supreme-court-decision-trump-second-term.html"
  },
  {
    "text": "Trump administration accuses judge of ‘unprecedented defiance’ of Supreme Court in immigration dispute  —  The Justice Department asked the Supreme Court to clarify a decision Monday that paved the way for the government to quickly deport criminal immigrants to “third countries.”",
    "url": "https://www.nbcnews.com/politics/supreme-court/trump-administration-accuses-judge-unprecedented-defiance-supreme-cour-rcna214735"
  },
  {
    "text": "‘Who are these people?’  Masked immigration agents challenge local police, sow fear in L.A.  —  Increasingly aggressive immigration raids carried out by masked federal agents, sometimes using unmarked vehicles, are creating problems for local law enforcement agencies.",
    "url": "https://www.latimes.com/california/story/2025-06-24/masked-immigration-agents-local-law-enforcement-tension"
  },
  {
    "text": "BREAKING: Stephen Miller's Financial Stake in ICE Contractor Palantir Raises Conflict Concerns  —  POGO report shows top Trump adviser owned six-figure stock in company profiting off deportations.  —  Notes  —  WASHINGTON — Stephen Miller, the influential Trump administration aide behind … ",
    "url": "https://migrantinsider.com/p/stephen-miller-palantir"
  },
  {
    "text": "The plan to vaccinate all Americans, despite RFK Jr.  —  The effort comes as the Trump administration has replaced members of the key federal vaccine advisory panel.  —  Summary629  —  Professional medical societies, pharmacists, state health officials and vaccine manufacturers … ",
    "url": "https://www.washingtonpost.com/health/2025/06/24/vaccines-access-rfk-cdc/"
  },
  {
    "text": "‘Dear Donald.’ Trump posts fawning private text from NATO chief on social media  —  The message started by congratulating Donald Trump on his “decisive action in Iran” and then got even more flattering, gushing about reaching the precipice of achieving “something NO American president in decades could have done.”",
    "url": "https://apnews.com/article/trump-rutte-text-message-nato-signal-6263810ac3ca77a5bf7366499f51c772"
  },
  {
    "text": "After 48 years in the U.S. and having taken two bullets for the country, Sae Joon Park left for South Korea  —  A U.S. Army veteran, awarded the Purple Heart for injuries sustained in combat, has self-deported to South Korea after being informed he could no longer remain in America under … ",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/veteran-self-deports-ice-immigration-b2776037.html"
  },
  {
    "text": "Department of Defense Employee Charged with Unlawful Retention of Classified Documents  —  For Immediate Release  —  A civilian employee of the U.S. Department of Defense (DoD) was arrested and made her initial court appearance yesterday to face charges of unauthorized removal and retention of classified documents.",
    "url": "https://www.justice.gov/opa/pr/department-defense-employee-charged-unlawful-retention-classified-documents"
  },
  {
    "text": "Toys are getting pricier as tariffs kick in  —  Toy and game prices jumped by a record amount in May. The industry, which relies heavily on China, has been hit hard by new import taxes.  —  Summary99  —  Toy prices are rising at their fastest pace on record, the result of stiff new tariffs … ",
    "url": "https://www.washingtonpost.com/business/2025/06/24/toy-prices-tariffs-inflation/"
  },
  {
    "text": "Garcia secures top Democratic seat on powerful Oversight Committee  —  Rep. Robert Garcia (D-Calif.) secured the top Democratic seat on the powerful House Oversight and Government Reform Committee on Tuesday, winning a vote of the full House Democratic Caucus in the crowded race to replace former … ",
    "url": "https://thehill.com/homenews/house/5366030-robert-garcia-wins-house-overwatch-seat/"
  },
  {
    "text": "The Problem With Americans and the “Finding Out” Part  —  An anti-vaxxer in Texas almost died from measles.  Real doctors saved his life.  After that, he got even *more* redpilled.  Plus: A Mamdani win in NYC could have unintended consequences.  —  ∙ Paid  —  Notes",
    "url": "https://www.thebulwark.com/p/texas-anti-vaxxer-survives-measles-is-redpilled-the-finding-out-part"
  },
  {
    "text": "Why Are Federal Agents Wearing Masks?  It's a Threat to American Democracy  —  Masked Federal Agents Are Undermining Trust—and Democracy  —  Let's get one thing straight: in the United States of America, law enforcement officers work for the people.  They are public servants … ",
    "url": "https://adamkinzinger.substack.com/p/why-are-federal-agents-wearing-masks"
  },
  {
    "text": "ICE holding a record 59,000 immigrant detainees, nearly half with no criminal record, internal data show  —  U.S. Immigration and Customs Enforcement is holding around 59,000 detainees in facilities across the country, likely setting a record high as the Trump administration aggressively … ",
    "url": "https://www.cbsnews.com/news/ice-record-59000-immigrant-detainees-half-no-criminal-record/"
  },
  {
    "text": "Breaking another presidential norm, Trump drops the f-bomb on camera  —  President Trump on Tuesday emphatically dropped an f-bomb, on camera, expressing frustration that Israel and Iran appeared to be violating the ceasefire that he just celebrated going into effect.",
    "url": "https://www.npr.org/2025/06/24/nx-s1-5443337/trump-expletive-israel-iran"
  },
  {
    "text": "LGBTQ+ leader: Dems should talk about ‘kitchen table issues, not about identity’  —  The LGBTQ+ Victory Fund reports the number of openly LGBTQ+ people serving in public office has jumped nearly 200 percent since Trump's first term.  —  SAN FRANCISCO — The leader of the largest PAC dedicated … ",
    "url": "https://www.politico.com/news/2025/06/24/lgbtq-leader-dems-kitchen-table-issues-not-identity-00419552"
  },
  {
    "text": "Provisions Continue to Violate the Byrd Rule in the Republicans' “One Big, Beautiful Bill”  —  WASHINGTON, D.C. - Today, the Senate Parliamentarian again advised that several provisions in the Republicans' “One Big, Beautiful Bill,” would be subject to a 60-vote threshold if they remain in the bill.",
    "url": "https://www.budget.senate.gov/ranking-member/newsroom/press/provisions-continue-to-violate-the-byrd-rule-in-the-republicans-one-big-beautiful-bill"
  }
]