[
  {
    "text": "A 6-figure Donald Trump donor is now a No Labels adviser  —  A major Republican donor and one-time financial backer of former President Donald Trump is now a leader in the Florida chapter of No Labels' third-party presidential bid.  —  Allan Keen, a Florida-based real estate developer … ",
    "url": "https://www.politico.com/news/2023/08/30/trump-donor-no-labels-adviser-00113395"
  },
  {
    "text": "Trump may not attend arraignment in Fulton County  —  Washington — Former President Donald Trump may not show up to his arraignment in Georgia next week, according to two sources familiar with his plans.  —  Trump is considering waiving his arraignment appearance, which is scheduled … ",
    "url": "https://www.cbsnews.com/news/trump-arraignment-fulton-county-georgia/"
  },
  {
    "text": "Trump fundraising spikes after Fulton County mugshot, surpassing $20M in August  —  Trump campaign says funds will only be used for political, campaign activities, not to cover legal expenses  —  EXCLUSIVE: Former President Trump has raised more than $9.4 million since being processed … ",
    "url": "https://www.foxnews.com/politics/trump-fundraising-spikes-after-fulton-county-mugshot-surpassing-20m-in-august"
  },
  {
    "text": "Proud Boy Enrique Tarrio's January 6 sentencing abruptly postponed due to ‘emergency’  —  The sentencing for Enrique Tarrio, the former chair of the Proud Boys, was postponed unexpectedly on Wednesday morning “due to an emergency,” according to the U.S. attorney's office in Washington, D.C.",
    "url": "https://www.washingtonexaminer.com/policy/courts/proud-boy-enrique-tarrior-january-6-sentenced-abruptly-postponed-emergency"
  },
  {
    "text": "Trump Could Clinch the Nomination Before the G.O.P. Knows if He's a Felon  —  The federal election interference case — one of four — is set to start just before Super Tuesday and a cascade of consequential primaries.  —  By the time Donald J. Trump is sitting at his federal trial on charges … ",
    "url": "https://www.nytimes.com/2023/08/30/us/politics/trump-gop-calendar.html"
  },
  {
    "text": "RNC member: State parties should develop ‘options’ to deny Trump nomination if he's a convicted felon  —  Bill Palatucci, a Republican National Committee member from New Jersey, is sounding the alarm that the RNC needs to adopt an escape hatch to boot former President Donald Trump … ",
    "url": "https://www.rawstory.com/trump-2024-2664623601/"
  },
  {
    "text": "Tennessee House Speaker silences critic, avoids vote on alleged residency fraud  —  On Monday, Tennessee Representative Justin Jones (D) distributed a letter to his colleagues in the Tennessee House announcing his intention to call a vote of no confidence in House Speaker Cameron Sexton (R).",
    "url": "https://popular.info/p/update-tennessee-house-speaker-silences"
  },
  {
    "text": "Over 100 former clerks of Justice Thomas sign open letter defending his integrity, independence  —  112 of Justice Thomas' former clerks say news stories attacking him are ‘part of larger attack on the Court’ and its ‘legitimacy’  —  EXCLUSIVE - Over 100 former clerks of Supreme Court Justice … ",
    "url": "https://www.foxnews.com/politics/over-100-former-clerks-justice-thomas-sign-open-letter-defending-his-integrity-independence"
  },
  {
    "text": "Supporting people's right to accurate and safe political discourse on X  —  More than half a billion people from around the world gather on X to talk about their interests in real-time, and that includes elections.  X enables people to directly engage on important topics with elected representatives … ",
    "url": "https://blog.twitter.com/en_us/topics/company/2023/supporting-peoples-right-to-accurate-and-safe-political-discourse-on-x"
  },
  {
    "text": "Is Judge Cannon preparing to kneecap Trump's Florida documents case?  —  Spoiler alert: Yes. … Last year, Judge Aileen Cannon tried valiantly to derail the Justice Department's investigation of Donald Trump's retention of classified documents at his Florida country club.",
    "url": "https://www.publicnotice.co/p/judge-aileen-cannon-trump-florida-documents-case"
  },
  {
    "text": "‘Go after it’: GOP strategists say Republicans need to hit Biden on drug pricing  —  Republicans are working to persuade Americans that the Biden plan will stifle innovation and lead to price controls.  —  As President Joe Biden touts the first 10 drugs subject to Medicare price talks … ",
    "url": "https://www.politico.com/news/2023/08/29/biden-drug-prices-gop-00113404"
  },
  {
    "text": "Dem Senate plots move amid spending clash with House GOP  —  Majority Leader Chuck Schumer is tentatively planning to bring up several spending bills for floor votes in mid-September.  —  The Senate is preparing its first big move in the fall spending fight.",
    "url": "https://www.politico.com/news/2023/08/30/schumer-spending-senate-house-gop-00113447"
  },
  {
    "text": "How Mark Meadows' Testimony May Have Just Helped Prosecutors  —  Mark Meadows made his surprise appearance in court on Monday, and while what he said may have seemed innocuous, it could be much more damning than anyone thinks.  —  For years now, Mark Meadows has avoided answering questions … ",
    "url": "https://www.thedailybeast.com/how-mark-meadows-testimony-may-have-just-helped-prosecutors"
  },
  {
    "text": "When I Tell You Nikki Haley Is Pathetic, That's an Understatement  —  I wish it were as simple as that one Republican debate.  —  I wish the Nikki Haley onstage in Milwaukee last week — who called out Donald Trump for his profligate government spending, who implored her fellow Republicans … ",
    "url": "https://www.nytimes.com/2023/08/29/opinion/nikki-haley-trump-2024.html"
  },
  {
    "text": "DeSantis tells Biden: Keep your IRA money  —  The governor is blocking Biden's IRA benefits from Floridians.  There's not much Dems can do about it.  —  President Joe Biden is offering one of his White House challengers hundreds of millions of dollars to spend in his state.",
    "url": "https://www.politico.com/news/2023/08/30/desantis-refuses-biden-climate-ira-money-00113397"
  },
  {
    "text": "Robert F. Kennedy Jr. Gushes Over Donald Trump's Mug Shot On Jesse Watters' Show  —  The long-shot Democratic presidential candidate asked the question about Trump's mug shot that many may be thinking.  —  LOADING  —  Robert F. Kennedy Jr. not surprisingly praised Donald Trump's mug shot on … ",
    "url": "https://www.huffpost.com/entry/robert-f-kennedy-jr-donald-trump-mug-shot_n_64ef1bcee4b0cf275533a38c"
  },
  {
    "text": "Exclusive: Russia will not probe Prigozhin plane crash under international rules  —  Russia has informed Brazil's aircraft investigation authority that it will not probe the crash of the Brazilian-made Embraer (EMBR3.SA) jet that killed mercenary boss Yevgeny Prigozhin under international rules … ",
    "url": "https://www.reuters.com/world/europe/russia-will-not-probe-prigozhin-plane-crash-under-international-rules-brazil-2023-08-29/"
  },
  {
    "text": "GOP lawmaker arrested again after domestic violence charges: report  —  A Republican state representative in Ohio has been arrested for violating a protective order — while awaiting trial for a prior arrest for domestic violence.  —  According to Fox 8 News, Rep. Bob Young allegedly breached … ",
    "url": "https://www.rawstory.com/gop-lawmaker-arrested-again/"
  }
]