[
  {
    "text": "How Trump's Election Lies Left the Michigan G.O.P. Broken and Battered  —  Infighting between Trump acolytes and traditionalists has driven away donors and voters.  Can the Michigan Republican Party rebuild in time for the presidential election?  —  The Michigan Republican Party is starving for cash.",
    "url": "https://www.nytimes.com/2023/08/29/us/politics/trump-michigan-republican-party.html"
  },
  {
    "text": "EXCLUSIVE: Eminem sends Vivek Ramaswamy a cease and desist letter demanding he stop rapping his music on the campaign trail  — Rapper Eminem has objected to Republican candidate Vivek Ramaswamy using his music on the campaign trail, DailyMail.com can exclusively report",
    "url": "https://www.dailymail.co.uk/news/article-12453955/Im-REAL-Slim-Shady-Eminem-sends-skinny-Vivek-Ramaswamy-cease-desist-letter-demanding-stop-rapping-music-campaign-trail.html"
  },
  {
    "text": "GOP silences ‘Tennessee Three’ Democrat on House floor for day on ‘out of order’ rule; crowd erupts  —  Republican lawmakers voted Monday to temporarily silence a Democratic member of the so-called Tennessee Three during an already tense House floor session after determining … ",
    "url": "https://apnews.com/article/tennessee-special-session-gun-control-f0af470eb6f377633735c5a1dcefa66f"
  },
  {
    "text": "Meadows testifies in Atlanta; March trial date for Trump in D.C.  —  Trump D.C. trial set to begin in March amid GOP primaries and other trial dates  —  U.S. prosecutor says Trump's social media posts show need for quick trial  —  'Let's take the temperature down,' judge says in D.C. hearing",
    "url": "https://www.washingtonpost.com/dc-md-va/2023/08/28/trump-jan-6-trial-date/"
  },
  {
    "text": "Former Trump adviser Peter Navarro's testimony in contempt case is ‘weak sauce,’ judge says  —  The federal judge overseeing Peter Navarro's contempt of Congress criminal case on Monday called his defense arguments “pretty weak sauce,” injecting last-minute uncertainty into how the former Donald Trump adviser … ",
    "url": "https://www.cnn.com/2023/08/28/politics/peter-navarro-testimony-contempt-of-congress-case/"
  },
  {
    "text": "Faculty member shot and killed in a campus building, says University of North Carolina official  —  A University of North Carolina faculty member was shot and killed in a campus building, officials said Monday.  A suspect was arrested about an hour and a half after shots were reported … ",
    "url": "https://apnews.com/article/university-north-carolina-chapel-hill-shooting-9a264145d183eeb7c28bb7d6a467ab39"
  },
  {
    "text": "Playbook: A first look at the big new Biden book  —  Presented by With help from Eli Okun and Garrett Ross  —  DRIVING THE DAY  —  IDALIA LATEST — From the National Hurricane Center's 5 a.m. update: “IDALIA NOW A HURRICANE ... EXPECTED TO RAPIDLY INTENSIFY INTO AN EXTREMELY DANGEROUS MAJOR HURRICANE BEFORE LANDFALL ON WEDNESDAY.”",
    "url": "https://www.politico.com/newsletters/playbook/2023/08/29/a-first-look-at-the-big-new-biden-book-00113271"
  },
  {
    "text": "Supreme Court Justice Amy Coney Barrett Says She Welcomes Public Scrutiny Of Court  —  U.S. Supreme Court Justice Amy Coney Barrett did not offer any opinion, or speak directly about, recent calls for the justices to institute an official code of conduct.  —  LOADING",
    "url": "https://www.huffpost.com/entry/supreme-court-barrett_n_64edc1e4e4b05b73949dea39"
  },
  {
    "text": "The chaos in Florida school libraries  —  For months, districts across Florida have purged books with LGBTQ characters and themes from school libraries.  The removal of these books followed the passage of the Parental Rights in Education Act in 2022, a bill championed by Governor Ron DeSantis … ",
    "url": "https://popular.info/p/the-chaos-in-florida-school-libraries"
  },
  {
    "text": "How Vivek Ramaswamy makes money from climate denial  —  At Wednesday's debate, Ramaswamy said he was the “only candidate who's not bought and paid for.”  That couldn't be further from the truth.  —  At the first Republican presidential debate last week, most of the candidates struggled … ",
    "url": "https://heated.world/p/how-vivek-ramaswamy-makes-money-from"
  },
  {
    "text": "More than 60 people arrested at a gay wedding in southern Nigeria  —  Arrests of gay people are common in Nigeria, where the Same Sex Marriage Prohibition Act carries up to 10 years in jail for gay individuals.  —  ABUJA, Nigeria — Police in Nigeria said Tuesday they detained … ",
    "url": "https://www.nbcnews.com/nbc-out/out-news/60-people-arrested-gay-wedding-southern-nigeria-rcna102302"
  },
  {
    "text": "Afghans who fought in secret CIA-trained force face legal uncertainty in the U.S.  —  Fighters from the “Zero Units” got work permits when they escaped to the U.S. Those permits expire soon, and now some fighters worry their CIA pasts might be working against them.",
    "url": "https://www.nbcnews.com/politics/national-security/afghans-fought-secret-cia-trained-force-face-legal-uncertainty-us-rcna102105"
  },
  {
    "text": "GOP salivates at the biggest campaign finance win since Citizens United  —  It could be a seismic shift in how tens of millions of campaign dollars are spent.  —  Republicans have waged a decades-long battle to blow up the campaign-finance laws that rein in big-money spending.",
    "url": "https://www.politico.com/news/2023/08/29/gop-campaign-finance-citizens-united-00113235"
  },
  {
    "text": "These are the first 10 drugs subject to Medicare price negotiations  —  The Biden administration unveiled Tuesday the names of the first 10 drugs subject to price negotiations in Medicare.  —  They are: Eliquis, Jardiance, Xarelto, Januvia, Farxiga, Entresto, Enbrel, Imbruvica, Stelara … ",
    "url": "https://www.cnn.com/2023/08/29/politics/medicare-drug-price-negotiations/"
  },
  {
    "text": "Rep. Clyde signals appropriations fight over Trump prosecutions  —  The House Appropriations Committee could consider amendments to the fiscal 2024 Commerce-Justice-Science bill next month stripping federal funding from prosecutors who are pursuing charges against former President Donald Trump.",
    "url": "https://www.rollcall.com/2023/08/28/rep-clyde-signals-appropriations-fight-over-trump-prosecutions/"
  },
  {
    "text": "Pope Francis blasts US Catholics for ‘reactionary’ views  —  Pope Francis criticized the state of the Catholic Church in the United States, calling it “reactionary” in recent comments during a closed-door meeting with members of the Jesuit religious order in Portugal.",
    "url": "https://www.washingtonexaminer.com/news/pope-francis-blasts-u-s-catholics-reactionary-views"
  },
  {
    "text": "Samuel Wurzelbacher, Celebrated as ‘Joe the Plumber,’ Dies at 49  —  For Republicans in 2008, he briefly became a symbol of Middle America when he questioned the presidential candidate Barack Obama in an impromptu televised encounter.  —  Samuel Joseph Wurzelbacher, who briefly became … ",
    "url": "https://www.nytimes.com/2023/08/28/us/politics/samuel-wurzelbacher-joe-the-plumber-dead.html"
  },
  {
    "text": "Biden is ‘old,’ Trump is ‘corrupt’: AP-NORC poll has ominous signs for both in possible 2024 rematch  —  WASHINGTON (AP) — Old.  Confused.  Corrupt.  Dishonest.  —  Those are among the top terms Americans use when they're asked to describe President Joe Biden and former President Donald Trump … ",
    "url": "https://apnews.com/article/biden-trump-2024-poll-old-corrupt-12b806876e2072790f9a67793761c688"
  },
  {
    "text": "A federal hate crime probe is underway after 3 people were killed in a racist rampage in Jacksonville, officials say.  Here's what we know  —  A federal hate crime investigation is underway after a White gunman with a swastika-emblazoned assault rifle killed three Black people at a Dollar General store … ",
    "url": "https://www.cnn.com/2023/08/28/us/jacksonville-florida-shooting-what-we-know/"
  }
]