[
  {
    "text": "Trump leadership PAC racks up millions in legal bills amid courtroom fights  —  The PAC paid $5.6 million in legal bills last month.  —  Donald Trump's leadership PAC spent another $5.6 million on legal expenses in February, furthering a trend that has seen the former president put valuable campaign dollars into his courtroom fights.",
    "url": "https://www.politico.com/news/2024/03/20/trump-leadership-pac-legal-bills-00148184"
  },
  {
    "text": "Trump eyes Sen. Marco Rubio as a potential VP pick  —  The short list remains on the long side.  But the Florida senator is gaining traction, six sources tell NBC News.  —  TALLAHASSEE, Fla. — Sen. Marco Rubio, R-Fla., is moving up the list of former President Donald Trump's potential … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-eyes-sen-marco-rubio-potential-vp-pick-rcna144003"
  },
  {
    "text": "Bankruptcy is one way out of Trump's financial jam.  He doesn't want to take it.  —  People close to the presumptive 2024 Republican nominee say he is not considering bankruptcy, even though it could ease his immediate cash crunch  —  As Donald Trump faces dwindling options to pay off … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/20/trump-bond-bankruptcy/"
  },
  {
    "text": "Trump is having trouble getting cash for his bond.  And he's growing frustrated.  —  The former president is in the unprecedented position of attempting to raise cash for both his campaign and his legal battles.  —  The prospect that Donald Trump may fail to post a bond by Monday's deadline … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-trouble-getting-cash-bond-growing-frustrated-rcna144351"
  },
  {
    "text": "Biden impeachment hearing descends into chaos as lawmaker caught on hot mic branding it ‘Jurassic Park’  —  'You can't make this stuff up,' someone can be heard saying  —  A hot mic captured a lawmaker labelling the heated House Oversight Committee's impeachment inquiry hearing … ",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/biden-impeachment-hearing-jurassic-park-b2515858.html"
  },
  {
    "text": "House Republican budget calls for raising the retirement age for Social Security  —  A budget by the Republican Study Committee, a group of more than 170 GOP lawmakers, highlights how many in the party would seek to govern if Republicans win in November.  —  WASHINGTON — A new budget … ",
    "url": "https://www.nbcnews.com/politics/congress/republican-budget-raise-age-retirement-social-security-medicare-rcna144341"
  },
  {
    "text": "Republicans Call for Retirement Age Hike in Clash With Biden  —  Search by Topic  —  The largest caucus of House Republicans called for an increase in the Social Security retirement age Wednesday, setting up a clash with President Joe Biden over spending on popular entitlement programs.",
    "url": "https://news.bgov.com/bloomberg-government-news/republicans-call-for-retirement-age-hike-in-clash-with-biden"
  },
  {
    "text": "Mississippi ex-deputy gets 40-year sentence as judge decries brutal attack on 2 Black men  —  A third former Mississippi sheriff's deputy has been sentenced to more than 17 years in federal prison for his part in torturing two Black men.  In all, six former law officers are being sentenced … ",
    "url": "https://apnews.com/article/mississippi-goon-squad-sentencing-94d9dcfa00e582b9d50a6eb7288b058b"
  },
  {
    "text": "A fourth former Mississippi officer is sentenced to 40 years in racially charged torture cases  —  A fourth former Mississippi law enforcement officer who pleaded guilty to torturing two Black men was sentenced to 40 years in prison Wednesday, as accounts of the horrifying brutality of a self-styled … ",
    "url": "https://www.cnn.com/2024/03/20/us/mississippi-officers-sentencing-goon-squad-wednesday"
  },
  {
    "text": "‘Very, very troubling’: Judges, lawyers flummoxed by Judge Cannon  —  The jurist overseeing Donald Trump's classified documents case in Florida has raised eyebrows and alarms with her latest order  —  Lawyers and former judges said they are baffled by an order issued this week … ",
    "url": "https://www.washingtonpost.com/national-security/2024/03/20/trump-cannon-judge-pra-jury-instructions/"
  },
  {
    "text": "Do ‘Zombie Votes’ for Nikki Haley Expose Trump's Weakness?  —  Donald Trump clinched his third consecutive Republican presidential nomination on March 12.  His record in 2024 primaries and caucuses is 33 wins and two losses so far (Nikki Haley won the District of Columbia and Vermont primaries).",
    "url": "https://nymag.com/intelligencer/article/nikki-haley-votes-expose-trump-weakness.html"
  },
  {
    "text": "Parnas calls out GOP rep at hearing for ‘doing the bidding’ of Russia  —  Lev Parnas, a convicted former aide to Rudy Giuliani, named members of Congress Wednesday who he alleged were “doing the bidding” of Russia by attempting to dig up “dirt” on President Biden during his 2020 campaign.",
    "url": "https://thehill.com/homenews/house/4545008-parnas-calls-out-gop-rep-hearing-doing-bidding-russia/"
  },
  {
    "text": "Mass Shooter Father's Chilling Prison Calls to Prosecutor Revealed  —  An investigation is now underway after threatening calls from prison by James Crumbley were revealed by the prosecutor handling his case.  —  The alleged jailhouse threats the father of the Oxford High School mass shooter … ",
    "url": "https://www.thedailybeast.com/mass-shooter-father-james-crumbleys-chilling-prison-calls-to-prosecutor-revealed"
  },
  {
    "text": "Airman Accused of Sharing Classified Info With Boogaloo Buddies  —  USAF intel analyst and alleged extremist Jason Travis Gray ran a high-profile anti-government Facebook group, according to the feds. … A U.S. Air Force intelligence analyst advocated publicly for a second Civil War … ",
    "url": "https://www.thedailybeast.com/airman-jason-travis-gray-accused-of-sharing-classified-info-with-boogaloo-buddies"
  },
  {
    "text": "Manchin won't vote for Biden judge picks that lack GOP support  —  The retiring West Virginia Democrat called it his “own little filibuster.”",
    "url": "https://www.politico.com/live-updates/2024/03/20/congress/manchin-mounts-his-own-judicial-filibuster-00148147"
  },
  {
    "text": "Shohei Ohtani's attorneys accuse interpreter of ‘massive theft’ tied to alleged gambling  —  Representatives of Dodgers superstar Shohei Ohtani on Wednesday accused his interpreter of engaging in a “massive theft” of the ballplayer's funds to place bets with an allegedly illegal bookmaker who is the target of a federal investigation.",
    "url": "https://www.latimes.com/california/story/2024-03-20/gambling-story"
  },
  {
    "text": "Freedom Caucus votes to remove Ken Buck  —  The House Freedom Caucus voted to remove Rep. Ken Buck (R-Colo.) from the group Tuesday night, a member of the conservative body told The Hill, a dismissal that comes days before he is set to retire from Congress.  —  The Freedom Caucus member … ",
    "url": "https://thehill.com/homenews/house/4545351-freedom-caucus-ken-buck/"
  },
  {
    "text": "Mitch McConnell urges GOP against term limits … - McConnell was one of several senators who spoke during an hour-and-a-half conference meeting, which was called by conservative Sen. Ron Johnson (R-Wisc.).  — McConnell spoke against imposing term limits for the top GOP position … ",
    "url": "https://www.axios.com/2024/03/20/mitch-mconnell-senate-term-limits-filibuster"
  }
]