[
  {
    "text": "Navigating Iran crisis, Trump relies on experience over star power  —  Gabbard, Hegseth outside the inner circle as president weighs military actions against Iran.  —  Summary55  —  As President-elect Donald Trump assembled his core national security team early this year … ",
    "url": "https://www.washingtonpost.com/national-security/2025/06/18/iran-war-trump-hegseth-gabbard/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzUwMjE5MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzUxNjAxNTk5LCJpYXQiOjE3NTAyMTkyMDAsImp0aSI6IjFkZjY1NzI5LTc5MTAtNGZmYS05ZWQxLTcwMzkzZGYwYmE1YiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb25hbC1zZWN1cml0eS8yMDI1LzA2LzE4L2lyYW4td2FyLXRydW1wLWhlZ3NldGgtZ2FiYmFyZC8ifQ.THNOto4e4zo2NbppjsRDq54e9G_ZY2aCgoBjro_oRgM&itid=gfta"
  },
  {
    "text": "Trump's Nuclear Attack ‘Doomsday Plane’ Arrives In Washington  —  A U.S. Air Force “Doomsday Plane” arrived at Joint Base Andrews Tuesday night, fueling speculation of a potential U.S. role in the escalating Israel-Iran crisis.  —  The E-4B Nightwatch aircraft landed at the military facility … ",
    "url": "https://www.newsweek.com/trump-doomsday-plane-spotted-flying-2087848"
  },
  {
    "text": "Live Updates: Trump Will Decide on Iran Attack ‘in the Next Two Weeks,’ White House Says  —  European officials, who have been effectively sidelined in the war between Israel and Iran, will try to exert limited leverage in a meeting with Iranian officials on Friday in Geneva.  —  Tehran",
    "url": "https://www.nytimes.com/live/2025/06/19/world/iran-israel-trump-news"
  },
  {
    "text": "Exclusive: inside the spy dossier that led Israel to war  —  We review its secret intelligence on Iranian nukes  —  When israel launched its war on Iran on June 13th it did so on the basis of intelligence that it claimed showed Iran had reached a “point of no return” in its quest for a nuclear weapon.",
    "url": "https://www.economist.com/middle-east-and-africa/2025/06/18/exclusive-inside-the-spy-dossier-that-led-israel-to-war"
  },
  {
    "text": "Elon Musk's SpaceX Starship explodes on test stand  —  The failure sent a giant fireball into the sky over the company's South Texas launch site.  —  SpaceX Starship explodes on test stand  —  SpaceX's Starship spacecraft exploded ahead of an engine test late Wednesday … ",
    "url": "https://www.washingtonpost.com/technology/2025/06/19/starship-spacex-explosion-musk/"
  },
  {
    "text": "Parsing ICE's mixed-up, hard-to-believe assault claims  —  ICE officials keep touting a 413 percent increase in assaults on officers to justify anonymity.  —  Last month, I wrote a column questioning why Immigration and Customs Enforcement officers were increasingly disguising their identities as they conducted sweeps and arrests.",
    "url": "https://www.washingtonpost.com/opinions/2025/06/19/brad-lander-ice-assault-masking/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzUwMzA1NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzUxNjg3OTk5LCJpYXQiOjE3NTAzMDU2MDAsImp0aSI6IjkzZmYyMmUzLTU5MWMtNGQ3OC1hMmMwLWI4OTYwNmY0ODRkMiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9vcGluaW9ucy8yMDI1LzA2LzE5L2JyYWQtbGFuZGVyLWljZS1hc3NhdWx0LW1hc2tpbmcvIn0.jI3RdkdeQ_BuOvl3vCMb275mxz0VICVSopkT2v71vjg&itid=gfta"
  },
  {
    "text": "Some liberties end in ICE  —  ICE, our new secret police agency, claims its agents must wear masks and conceal their identities because of a rising risk of violence on the job or home terror attacks.  But according to this must-read piece by Philip Bump at the Washington Post … ",
    "url": "https://walterolson.substack.com/p/some-liberties-end-in-ice"
  },
  {
    "text": "The Supreme Court Fails to See Transgender Teens  —  Imagine you are a transgender teenager.  Don't ask me how you know that you are transgender: That question is no more appropriate or relevant than asking people how they know that they are gay or Jewish or Black.  Maybe you've always known.",
    "url": "https://www.nytimes.com/2025/06/19/opinion/the-supreme-court-fails-to-see-transgender-teens.html?unlocked_article_code=1.QE8.WpSF.018ellE9-T9r&smid=url-share"
  },
  {
    "text": "'He's a snake': Musk jabs at Trump adviser who fueled messy presidential breakup  —  Sergio Gor helped facilitate the termination of Jared Isaacman's nomination for NASA head — a pick Musk had pushed.  —  Elon Musk may have stopped sparring with President Donald Trump online … ",
    "url": "https://www.politico.com/news/2025/06/19/musk-sergio-gor-feud-00414246"
  },
  {
    "text": "Musk Savages ‘Snake’ Trump Aide as Their White House Feud Erupts  —  VENOMOUS WORDS  —  Sergio Gor has been blamed in part for the explosive breakdown in the alliance between the president and his former “First Buddy.”  —  Elon Musk publicly ripped into a top White House aide who fueled his falling out with President Donald Trump.",
    "url": "https://www.thedailybeast.com/elon-musk-savages-snake-trump-aide-sergio-gor-as-their-white-house-feud-erupts/"
  },
  {
    "text": "Trump's border czar: Immigration raids at farms, hotels to continue  —  Following a week of immigration whiplash, President Trump's border czar Tom Homan confirmed Thursday that immigration raids will continue in the agriculture and hospitality industries.  —  The big picture … ",
    "url": "https://www.axios.com/2025/06/19/trump-immigration-raids-farms-hotels-border-czar"
  },
  {
    "text": "Donald Trump Rages At Reporter Who Refuses To Stick To ‘Positive’ Questions  —  The president launched a trademark diatribe in response to a line of questioning he didn't particularly like.  —  President Donald Trump on Wednesday once again ripped a reporter to their face … ",
    "url": "https://www.huffpost.com/entry/donald-trump-snaps-cnn-reporter_n_6853b5cbe4b0dd3af036ae05"
  },
  {
    "text": "Trump extends TikTok ban deadline by another 90 days  —  The latest ban extension is the third Trump has given to TikTok's Chinese owner, ByteDance.  —  President Donald Trump has extended the deadline for TikTok's parent company, ByteDance, to sell the short-form video app to an American owner by another 90 days.",
    "url": "https://www.nbcnews.com/tech/social-media/trump-extends-tiktok-ban-deadline-another-90-days-rcna213720"
  },
  {
    "text": "Republicans Threaten a Hospital Apocalypse  —  Experts warn of potentially hundreds of hospital closures, which would degrade the entire medical system. … As we at the Prospect have reported, while the Senate's version of the Republican budget reconciliation bill was widely expected … ",
    "url": "https://prospect.org/health/2025-06-13-hospitals-senate-republicans-senate/"
  },
  {
    "text": "How My Reporting on the Columbia Protests Led to My Deportation  —  As an Australian who wrote about the demonstrations while on campus, I gave my phone a superficial clean before flying to the U.S. I underestimated what I was up against.  —  Many people are detained at U.S. airports for reasons they find arbitrary and mysterious.",
    "url": "https://www.newyorker.com/news/the-lede/how-my-reporting-on-the-columbia-protests-led-to-my-deportation"
  },
  {
    "text": "Trump Insists MAGA ‘HATES’ Fox News After Embarrassing Network Poll  —  HURT FEELINGS  —  He couldn't believe what voters really think of his “miraculously perfect” border.  —  President Donald Trump savaged Fox News and declared that his MAGA base hates the network after a poll showed his approval ratings tanking.",
    "url": "https://www.thedailybeast.com/trump-insists-maga-hates-fox-news-after-embarrassing-network-poll/"
  },
  {
    "text": "‘Weak,’ ‘whiny’ and ‘invisible’: Critics of DNC Chair Ken Martin savage his tenure  —  The new DNC chair has faced messy drama since stepping into the role in February.  —  Four-and-a-half months after the Democratic National Committee chair pledged to focus on fighting Donald Trump … ",
    "url": "https://www.politico.com/news/2025/06/19/dnc-chair-ken-martin-infighting-00413409"
  },
  {
    "text": "The Subway Is Not Scary  —  In 2014, New York Times reporter Michael Barbaro (who would go on to become one of the paper's superstars as host of its podcast “The Daily\") posted this tweet:  —  After receiving a good deal of ridicule, Barbaro deleted the tweet.  The nervous sentiment he expressed, however, lives on.",
    "url": "https://www.hamiltonnolan.com/p/the-subway-is-not-scary"
  },
  {
    "text": "Abraham Lincoln Wasn't Born an Abolitionist, He Became One  —  Abraham Lincoln was not an original advocate of abolition.  In fact we know that his journey to what he called “the central act of my administration, and the great event of the 19th century” was a relatively slow, though continuous, one.",
    "url": "https://www.theunpopulist.net/p/abraham-lincoln-wasnt-born-an-abolitionist"
  },
  {
    "text": "The Atlantic Announces Staff Writers Quinta Jurecic, Toluse Olorunnipa, and Nancy Youssef  —  As The Atlantic continues a major expansion of its editorial staff, today editor in chief Jeffrey Goldberg is announcing the hires of Quinta Jurecic, Toluse Olorunnipa, and Nancy Youssef as staff writers.",
    "url": "https://www.theatlantic.com/press-releases/archive/2025/06/atlantic-hires-jurecic-olorunnipa-and-youssef/683229/"
  },
  {
    "text": "Is Mike Lee Shitposting His Way Out of Congress?  —  Never Tweet  —  WHEN SEN. MIKE LEE (R-Utah) took to social media to spread wild, nakedly partisan theories about the Minnesota shootings that left a Democratic state representative and her husband dead, national Democrats were horrified.",
    "url": "https://www.thebulwark.com/p/is-mike-lee-shitposting-his-way-out-of-congress-utah-democrats"
  },
  {
    "text": "Record Debt Limit Increase Would Break Republican Precedent  —  A proposed $5 trillion debt limit increase could make it hard for Republicans to maintain their fiscal hawk credibility.  —  For years, Republicans have warned about the government's reliance on borrowed money to pay its bills.",
    "url": "https://www.nytimes.com/2025/06/19/business/national-debt-limit-republicans.html?unlocked_article_code=1.QE8.WCU-._0wR8OBLUu-u&smid=url-share"
  },
  {
    "text": "Knife-Wielding Illegal Alien Charged With Attempted Murder After Allegedly Attacking Trump Attorney in NY  —  A United States Attorney for New York was chased with a knife by an illegal immigrant outside a hotel in Albany, New York, security camera footage shows.",
    "url": "https://redstate.com/rusty-weiss/2025/06/19/trump-attorney-attacked-by-knife-wielding-illegal-in-capital-of-new-york-charged-with-attempted-murder-n2190654"
  },
  {
    "text": "How does Israel restrict its media from reporting on the Iran conflict?  —  The military censor has introduced a slew of new restrictions on journalists covering the unfolding war.  —  The Israeli government has issued new directives restricting how its media covers its current war with Iran.",
    "url": "https://www.aljazeera.com/news/2025/6/19/how-does-israel-restrict-its-media-from-reporting-on-the-iran-conflict"
  },
  {
    "text": "Exclusive: Democrats want new leaders, focus on pocketbook issues, Reuters/Ipsos poll finds  —  Democrats want new leaders for their party, which many feel isn't focusing enough on economic issues and is over-emphasizing issues like transgender rights and electric vehicles, a Reuters/Ipsos poll found.",
    "url": "https://www.reuters.com/world/us/democrats-want-new-leaders-focus-pocketbook-issues-reutersipsos-poll-finds-2025-06-19/"
  },
  {
    "text": "Appeals court says DOJ cannot represent Trump in appeal of E. Jean Carroll case  —  A jury last year ordered Trump to pay the columnist $83 million in damages.  —  President Donald Trump speaks to the press in the Oval Office of the White House as members of Italian soccer club Juventus pay a visit in Washington, June 18, 2025.",
    "url": "https://abcnews.go.com/US/appeals-court-doj-represent-trump-appeal-jean-carroll/story?id=122989566"
  }
]