[
  {
    "text": "Scoop: Dem senators' Biden huddle called off … - Details of the proposed meeting leaking out made it impossible for there to be a private conversation, the source said.  — Senate Democrats as a whole will meet Tuesday for a regularly scheduled caucus meeting.",
    "url": "https://www.axios.com/2024/07/07/scoop-dem-senators-biden-huddle-called-off"
  },
  {
    "text": "4 more senior Dems call on Biden to stand down from reelection bid  —  Other Democrats also expressed concerns with the president's prospects during a private Sunday call.  —  Several more senior House Democrats called on President Joe Biden to abandon his reelection bid during … ",
    "url": "https://www.politico.com/news/2024/07/07/jerry-nadler-adam-smith-congress-biden-00166733"
  },
  {
    "text": "Radio Host Resigns After Asking Biden Questions His Campaign Had Provided  —  WURD said that the interview with President Biden was not up to its standards and that the host, Andrea Lawful-Sanders, had resigned in a mutual decision.  —  The Philadelphia radio station WURD has parted ways … ",
    "url": "https://www.nytimes.com/2024/07/07/us/politics/biden-interview-radio-host-resigns.html"
  },
  {
    "text": "Radio station parts ways with host who interviewed Biden with questions from his aides  —  Interview “violates our practice” said WURD president and CEO Sara M. Lomax.  The station “is not a mouthpiece for the Biden or any other Administration.”  —  The head of a Philadelphia radio station … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/07/biden-interview-wurd-campaign/"
  },
  {
    "text": "French left beats Le Pen's far right in election shock  —  PARIS  —  The left-wing alliance in France won the most seats in parliament in a dramatic election, dealing a surprise blow to the far-right party of Marine Le Pen.  —  In the first round of voting a week ago Le Pen's National Rally came top … ",
    "url": "https://www.politico.eu/article/france-legislative-election-2024-second-round-front-populaire-jean-luc-melenchon-raphael-glucksmann-shock-victory/"
  },
  {
    "text": "‘Blitz primary’ could open up Democratic race if Biden drops out  —  The Scoop  —  As the Democratic Party convulses over questions about President Joe Biden's mental fitness, a pair of well-connected Democrats is offering an optimistic plan that would involve the president stepping … ",
    "url": "https://www.semafor.com/article/07/07/2024/blitz-primary-could-open-up-democratic-race-if-biden-drops-out"
  },
  {
    "text": "Fascism and Fear  —  The Moment, The Media, The Election  —  Mainstream media have treated President Biden with prejudice and arrogance.  Quite a few Democrats, reacting to this, treat any mention of President Biden's fitness as disloyalty.  This is mistaken, if understandable.",
    "url": "https://snyder.substack.com/p/fascist-froth"
  },
  {
    "text": "An America that you won't recognize': Legal scholar Kermit Roosevelt III on SCOTUS and Project 2025  —  The Supreme Court's latest term revealed just how fundamentally the ultraconservative supermajority has changed the dynamics on the court, as well as how dire its ethics issues are.",
    "url": "https://www.msnbc.com/ali-velshi/watch/an-america-that-you-won-t-recognize-legal-scholar-kermit-roosevelt-iii-on-scotus-and-project-2025-214355013697"
  },
  {
    "text": "Sen. Lindsey Graham says if Biden steps aside, “this is a dramatically different race” for Trump  —  Washington — Sen. Lindsey Graham said Sunday that if President Biden drops out of the 2024 presidential race amid swirling concerns about his fitness for office after a disastrous debate … ",
    "url": "https://www.cbsnews.com/news/lindsey-graham-2024-race-if-joe-biden-steps-aide/"
  },
  {
    "text": "Scoop: How Biden's event staffers guide him behind the scenes … - “I staffed a simple fundraiser at a private residence, but they treated it like it was a NATO summit with his movements,” according to a person who staffed a Biden event in the past 18 months.",
    "url": "https://www.axios.com/2024/07/07/biden-staff-events-prepare"
  },
  {
    "text": "Temperatures 1.5C above pre-industrial era average for 12 months, data shows  —  Copernicus Climate Change Service says results a ‘large and continuing shift’ in the climate  —  The world has baked for 12 consecutive months in temperatures 1.5C (2.7F) greater than their average before the fossil fuel era, new data shows.",
    "url": "https://www.theguardian.com/environment/article/2024/jul/08/temperatures-1-point-5c-above-pre-industrial-era-average-for-12-months-data-shows"
  },
  {
    "text": "NY Times reporter hilariously sticks it to ‘sex abuser’ Trump after Truth Social attack  —  The New York Times' Peter Baker got the last laugh on Sunday after former president Donald Trump smeared Baker and his wife, Susan Glasser of the New Yorker, early Sunday morning on Truth Social.",
    "url": "https://www.rawstory.com/trump-abuser/"
  },
  {
    "text": "Boeing accepts a plea deal to avoid a criminal trial over 737 Max crashes, Justice Department says  —  Boeing will plead guilty to a criminal fraud charge stemming from two crashes of 737 Max jetliners that killed 346 people after the government determined the company violated an agreement … ",
    "url": "https://apnews.com/article/boeing-guilty-plea-crashes-245a38dc6d3082f4ddff1f6f74f274f2"
  },
  {
    "text": "2024 RNC platform could alter the GOP's abortion position for the first time in decades  —  Some conservative members worry the party will adopt a softened abortion stance.  —  President Donald Trump pauses while speaking during a rally in Charlotte, N.C., March 2, 2020.",
    "url": "https://abcnews.go.com/Politics/2024-rnc-platform-alter-gops-abortion-position-time/story?id=111728686"
  },
  {
    "text": "‘I have to hit pause here’: J.D. Vance flips out on NBC host as she fact-checks him  —  In just the first half of Sen. J.D. Vance's interview with “Meet the Press” host Kristen Welker, the Ohio Republican waved his hands and snapped at her as she attempted to fact-check him.",
    "url": "https://www.alternet.org/jd-vance-2668697406/"
  }
]