[
  {
    "text": "Trump Says He Might Have to Sell Properties to Pay $454 Million Penalty  —  The ex-president, who is appealing the penalty in his civil fraud case, offered a bond of only $100 million to pause the judgment.  —  Donald J. Trump offered a New York appeals court on Wednesday a bond … ",
    "url": "https://www.nytimes.com/2024/02/28/nyregion/trump-bond-civil-fraud.html"
  },
  {
    "text": "Trump offers $100m bond instead of full $454m as he appeals New York case  —  Lawyers say judgment banning ex-president from obtaining loans from New York banks makes it impossible to cover full amount  —  Donald Trump's lawyers asked a New York appellate court on Wednesday to halt collection … ",
    "url": "https://www.theguardian.com/us-news/2024/feb/28/trump-appeal-bond-fraud-case"
  },
  {
    "text": "Trump tried to ignore Haley.  He barely lasted a day.  —  The former president was back to his old ways in no time.  —  For a full 24 hours on Saturday, Donald Trump did not mention Nikki Haley by name, ignoring her both in a freewheeling address to the Conservative Political Action Conference … ",
    "url": "https://www.politico.com/news/2024/02/28/trump-nikki-haley-attacks-00143710"
  },
  {
    "text": "Mitch McConnell to step down from Republican Senate leadership  —  Mitch McConnell's legacy as the longest-serving leader of Senate Republicans  —  Mitch McConnell, the longest-serving Senate leader in history who maintained his power in the face of dramatic convulsions in the Republican Party … ",
    "url": "https://apnews.com/article/mitch-mcconnell-senate-republican-leader-stepping-down-ba478d570a4561aa7baf91a204d7e366"
  },
  {
    "text": "Gaetz: 'We've now 86'd McCarthy, McDaniel, McConnell'  —  Rep. Matt Gaetz (R-Fla.) celebrated the news that Senate Republican Leader Mitch McConnell (Ky.) is stepping down from his leadership post, recounting the recent shake-ups permeating across the Republican Party.",
    "url": "https://thehill.com/homenews/house/4494816-gaetz-says-weve-now-86d-mccarthy-mcdaniel-mcconnell/"
  },
  {
    "text": "Lauren Boebert's son was arrested over a spate of thefts as his mom tries to convince voters to look past her chaotic family life  — Lauren Boebert's son Tyler Boebert was arrested on Tuesday afternoon.  — He's facing 22 charges in connection with a series of crimes in Rifle, Colorado.",
    "url": "https://www.businessinsider.com/lauren-boebert-son-tyler-arrested-family-drama-2024-republican-campaign-2024-2"
  },
  {
    "text": "Lauren Boebert's son arrested, faces 22 charges  —  GRAND JUNCTION, Colo. (KJCT) - Lauren Boebert's 18-year-old son was arrested in Garfield County February 27, 2024, and faces 22 charges.  —  According to the Rifle Police Department's Facebook page Tyler Boebert was arrested at around 2:30 in the afternoon.",
    "url": "https://www.kjct8.com/2024/02/28/lauren-boeberts-son-arrested-faces-22-charges/"
  },
  {
    "text": "How Panera Bread ducked California's new $20 minimum wage law  —  Billionaire Greg Flynn, who made his fortune running one of the world's largest restaurant franchise operations, is getting a new boost from sourdough loaves and brioche buns.  —  That's because a California law that's … ",
    "url": "https://www.mercurynews.com/2024/02/28/how-panera-bread-ducked-californias-new-20-minimum-wage-law/"
  },
  {
    "text": "Exxon CEO blames public for failure to fix climate change  —  The world isn't on track to meet its climate goals — and it's the public's fault, a leading oil company CEO told journalists.  —  Exxon CEO Darren Woods told editors from Fortune that the world has “waited too long” … ",
    "url": "https://thehill.com/policy/energy-environment/4494543-exxon-ceo-blames-public-for-failure-to-fix-climate-change/"
  },
  {
    "text": "Biden to issue executive order aimed at protecting Americans' sensitive data from China and other ‘hostile countries’  —  The measure targets the business of selling people's personal information, which the White House said could be used “to track Americans (including military service members) … ",
    "url": "https://www.nbcnews.com/politics/joe-biden/biden-issue-executive-order-aimed-protecting-americans-sensitive-data-rcna140869"
  },
  {
    "text": "‘Star witness’ testifies his claims about Fani Willis were only ‘speculation’  —  ATLANTA — A lawyer billed as the “star witness” in the case to disqualify Fulton County District Attorney Fani T. Willis (D) testified Tuesday that it was mere “speculation” when he told a defense attorney … ",
    "url": "https://www.washingtonpost.com/national-security/2024/02/27/fani-willis-nathan-wade-trump-georgia-hearing/"
  },
  {
    "text": "They're coming for birth control next  —  Banning IVF is a natural result of anti-choice zealots running the GOP, and they won't stop there. … Earlier this month, the Alabama Supreme Court issued an opinion, complete with a wildly theocratic concurrence from Chief Justice Thomas Parker … ",
    "url": "https://www.publicnotice.co/p/alabama-ivf-ban-explained"
  },
  {
    "text": "French Senate approves a bill to make abortion a constitutional right  —  France's Senate on Wednesday adopted a bill to enshrine a woman's right to an abortion in the constitution, clearing a key hurdle for legislation promised by President Emmanuel Macron in response to a rollback in abortion rights in the United States.",
    "url": "https://apnews.com/article/france-constitution-abortion-right-senate-macron-assembly-6e8cfc46d3fa4553c4d78e8a227f23b2"
  },
  {
    "text": "Hunter Biden testifies that he never involved his father in business  —  President's son opens with a defiant statement accusing Republicans of “partisan house of cards” built on “lies”  —  Hunter Biden testified on Wednesday that he never involved his father, President Biden … ",
    "url": "https://www.washingtonpost.com/politics/2024/02/28/hunter-biden-accuses-house-republicans-innuendo-lies/"
  },
  {
    "text": "The foreign policy establishment fails to see that the Middle East balance of power has shifted  —  Ryan Crocker is an experienced and knowledgeable American diplomat who specializes in the Middle East, having served as ambassador to Lebanon, Kuwait, Syria, Pakistan, Iraq and Afghanistan.",
    "url": "https://thehill.com/opinion/international/4492433-the-foreign-policy-establishment-fails-to-see-that-the-middle-east-balance-of-power-has-shifted/"
  },
  {
    "text": "Man who assaulted officers with hockey stick on Jan. 6 sentenced to prison  —  A Michigan man has been sentenced to more than three years in prison for assaulting law enforcement officers with a hockey stick during the Jan. 6, 2021, riot at the Capitol.  —  District Judge Tanya Chutkan … ",
    "url": "https://thehill.com/policy/national-security/4495029-man-assaulted-officerscapi-hockey-stick-on-jan-6-sentenced-to-prison/"
  },
  {
    "text": "Poll: Most Americans cool to Christian nationalism as its influence grows … - This once-fringe ideology has become prevalent in some deeply red states at a time when the nation overall is increasingly diverse and less religious. … - In California, New York and Virginia … ",
    "url": "https://www.axios.com/2024/02/28/poll-christian-nationalism-americans-reject"
  },
  {
    "text": "Mike Johnson is again staring down a government shutdown — and his conference  —  The House speaker is juggling competing demands from his members while trying to strike a deal to keep the government open  —  The House returns to Washington Wednesday with the goal of averting … ",
    "url": "https://www.washingtonpost.com/politics/2024/02/28/mike-johnson-government-shutdown-house-republicans/"
  }
]