[
  {
    "text": "Trump Rules Out Vivek Ramaswamy as Running Mate as He Eyes New Team  — Former president eyeing loyalty, ideological agreement in pick  — Trump team aiming for smooth transition should he win election  —  Donald Trump has ruled out Vivek Ramaswamy as his running mate and is instead eyeing … ",
    "url": "https://www.bloomberg.com/news/articles/2024-03-18/trump-rules-out-ramaswamy-as-running-mate-as-he-eyes-new-team"
  },
  {
    "text": "Trump Says Jews Who Support Democrats ‘Hate Israel’ and ‘Their Religion’  —  The comments, on a conservative radio program, echo an antisemitic trope and escalate claims he made as president that were widely criticized.  —  Former president Donald J. Trump accused Jewish voters of hating … ",
    "url": "https://www.nytimes.com/2024/03/18/us/politics/trump-israel-jewish-voters.html"
  },
  {
    "text": "Is Donald Trump About to Go Bankrupt? … Debt is becoming a major campaign issue in 2024.  I don't mean the national debt, which today stands at 99 percent of gross domestic product and which, the Congressional Budget Office projects, will total 116 percent of GDP 10 years from now.",
    "url": "https://newrepublic.com/article/179879/trump-legal-debts-chubb-payment"
  },
  {
    "text": "Trump Spurned by 30 Companies as He Seeks Bond in $454 Million Judgment  —  Donald J. Trump's lawyers said in a court filing that he faces “insurmountable difficulties” as he tries to raise cash for the civil fraud penalty he faces in New York.  —  Donald J. Trump's lawyers disclosed on Monday … ",
    "url": "https://www.nytimes.com/2024/03/18/nyregion/trump-bond-civil-fraud-case.html"
  },
  {
    "text": "Context collapse  —  On Saturday, Donald Trump spoke at a rally in Ohio.  Before he began, an announcer instructed the crowd to rise in tribute to the insurrectionists who stormed the Capitol on January 6, and Trump himself stood and saluted the national anthem as recorded by the “J6 Prison Choir.”",
    "url": "https://www.cjr.org/the_media_today/trump_ohio_speech_bloodbath_media_broadcast_live.php"
  },
  {
    "text": "Behind Trump's campaign cash crunch: Small-dollar donor fatigue, major donor hesitation  — Former President Donald Trump is facing two major fundraising problems: A shortage of big money interest and a drop in small-dollar donor support.  — The drop in Trump's small-dollar contributors … ",
    "url": "https://www.cnbc.com/2024/03/18/trump-campaign-cash-crunch-small-dollar-donor-fatigue-major-donor-nerves.html"
  },
  {
    "text": "Trump loses bid to block Michael Cohen, Stormy Daniels testimony at hush money trial  —  Donald Trump on Monday lost a bid to block testimony from Michael Cohen and Stormy Daniels at his upcoming trial on charges stemming from hush money that Cohen, his former lawyer and fixer, paid Daniels, a porn star, before the 2016 election.",
    "url": "https://www.reuters.com/world/us/judge-denies-trump-request-exclude-michael-cohens-testimony-hush-money-trial-2024-03-18/"
  },
  {
    "text": "Donald Trump officially “out of his mind” after unhinged speech praising Capitol rioters  —  Donald Trump held a rally in Dayton, Ohio, this weekend, and many believe his speech solidified that the presumed GOP presidential nominee has continued to descend further into madness.",
    "url": "https://www.lgbtqnation.com/2024/03/donald-trump-officially-out-of-his-mind-after-unhinged-speech-praising-capitol-rioters/"
  },
  {
    "text": "Supreme Court says Trump White House official Peter Navarro must begin prison sentence  —  Navarro, who refused to cooperate with the Jan. 6 committee, wanted to remain free while he appealed his contempt of Congress conviction.  —  WASHINGTON − Former Trump adviser Peter Navarro … ",
    "url": "https://www.usatoday.com/story/news/politics/2024/03/18/supreme-court-peter-navarro-trump-prison/72999868007/"
  },
  {
    "text": "Peter Navarro Compares Prison Sentence to Dead American Soldiers  —  The day before heading to prison for contempt of Congress, the ex-Trump aide stood by his decision, describing it as a “much smaller sacrifice.”  —  On the eve of Peter Navarro's first day in prison, the former White House aide … ",
    "url": "https://www.thedailybeast.com/peter-navarro-compares-prison-sentence-to-dead-american-soldiers"
  },
  {
    "text": "Navarro's bid to stave off jail sentence denied at Supreme Court  —  His sentence is set to begin Tuesday.  —  Peter Navarro, a former trade adviser in Donald Trump's White House, appears to be heading to jail.  —  Chief Justice John Roberts on Monday turned down Navarro's emergency motion … ",
    "url": "https://www.politico.com/news/2024/03/18/peter-navarro-supreme-court-00147649"
  },
  {
    "text": "Supreme Court refuses to delay prison time for Trump aide Peter Navarro  —  Chief Justice John G. Roberts Jr. on Monday refused to delay prison time for Peter Navarro, a former senior aide to President Donald Trump, as he appeals his conviction for refusing to testify before Congress … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/18/navarro-supreme-court-prison-report/"
  },
  {
    "text": "Pro-Trump lawyer arrested on bench warrant in Washington, D.C.  —  Stefanie Lambert, a Michigan lawyer who has championed dubious claims of election fraud, was arrested in Washington, D.C., Monday afternoon because of a bench warrant, according to a spokesman for the U.S. Marshals Service.",
    "url": "https://www.detroitnews.com/story/news/politics/2024/03/18/pro-trump-lawyer-stefanie-lambert-arrested-on-bench-warrant-in-washington-dominion-voting-elections/73023957007/"
  },
  {
    "text": "Ohio 2024 GOP Poll: Moreno 38%, Dolan 29%, LaRose 12%  —  Home Polls Ohio 2024 GOP Poll: Moreno 38%, Dolan 29%, LaRose 12%  —  The final Emerson College Polling Ohio Republican Primary poll, fielded Sunday-Monday before the Tuesday election, finds 38% of likely voters support Bernie Moreno, 29% Matt Dolan, and 12% Frank LaRose.",
    "url": "https://emersoncollegepolling.com/ohio-2024-gop-poll-moreno-38-dolan-29-larose-12/"
  },
  {
    "text": "US Supreme Court justices, judges face new rules for disclosing free trips  —  U.S. Supreme Court justices and federal judges can no longer avoid disclosing the value of travel-related gifts they receive by classifying such free trips as “reimbursements” on their financial disclosure forms under new regulations now in effect.",
    "url": "https://www.reuters.com/world/us/us-supreme-court-justices-judges-face-new-rules-disclosing-free-trips-2024-03-18/"
  },
  {
    "text": "Tuberville says GOP leadership should have vetted claims in Katie Britt's speech  —  Sen. Tommy Tuberville (R-Ala.) said GOP leadership should have more carefully reviewed the claims in Sen. Katie Britt (R-Ala.)'s response to President Biden's State of the Union address as she faces criticism … ",
    "url": "https://thehill.com/homenews/senate/4540525-tuberville-says-gop-leadership-should-have-vetted-claims-in-katie-britts-speech/"
  },
  {
    "text": "EPA bans asbestos, a deadly carcinogen still in use decades after a partial ban was enacted  —  The Environmental Protection Agency on Monday announced a comprehensive ban on asbestos, a carcinogen that kills tens of thousands of Americans every year but is still used in some chlorine bleach, brake pads and other products.",
    "url": "https://apnews.com/article/epa-asbestos-cancer-brakes-biden-72b0fa8b36adedaff6000034d35c2acd"
  },
  {
    "text": "Congressional leaders strike deal on Homeland Security funding ahead of shutdown deadline  —  Congressional leaders have struck a deal to fund the Department of Homeland Security (DHS) through the remainder of fiscal year 2024, a source familiar with the matter confirmed to The Hill … ",
    "url": "https://thehill.com/business/budget/4540683-congressional-leaders-strike-deal-on-homeland-security-funding-ahead-of-shutdown-deadline/"
  },
  {
    "text": "Arizona Gov. Katie Hobbs vetoes bipartisan housing bill, citing ‘unclear outcomes’  —  Arizona Gov. Katie Hobbs has vetoed a controversial housing bill that won bipartisan support in the Legislature, saying the measure would put Arizona “at the center of a housing reform experiment with unclear outcomes.”",
    "url": "https://www.azcentral.com/story/news/politics/arizona/2024/03/18/arizona-gov-katie-hobbs-vetoes-bipartisan-housing-bill/73017918007/"
  },
  {
    "text": "Justice Jackson Complains First Amendment Is ‘Hamstringing’ Feds' Censorship Efforts  —  Free speech is on trial at the Supreme Court, and Justice Ketanji Brown Jackson is no fan of the First Amendment.  —  Free speech is on trial at the Supreme Court, but Justice Kentanji Brown Jackson is no fan of the First Amendment.",
    "url": "https://thefederalist.com/2024/03/18/justice-jackson-complains-first-amendment-is-hamstringing-feds-censorship-efforts/"
  },
  {
    "text": "Over 450 Jewish Creatives and Professionals Denounce Jonathan Glazer's ‘Zone of Interest’ Oscars Speech in Open Letter (EXCLUSIVE) … The list of co-signees provided to Variety Monday morning covers a broad swath of the industry including actors (Debra Messing, Tovah Feldshuh), executives … ",
    "url": "https://variety.com/2024/film/news/jonathan-glazer-oscar-speech-zone-of-interest-open-letter-1235944880/"
  },
  {
    "text": "Niger ordered US troops to leave after Biden officials warned about ties to Russia, Iran: Pentagon  —  Niger is pulling its military cooperation deal with the United States and ordering some 1,000 American military personnel to leave the country, a startling development that comes … ",
    "url": "https://thehill.com/policy/defense/4539830-niger-ends-us-military-deal/"
  }
]