[
  {
    "text": "Not the Life Matt Gaetz Was Planning On  —  The normal rules of public disgrace may no longer apply to Donald Trump.  But at least some expectation of good behavior remains, it seems, for a politician in Trump's orbit.  —  After a multiyear investigation, the House Ethics Committee reported today … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/12/matt-gaetz-house-ethics-report/681163/"
  },
  {
    "text": "Bill Clinton is hospitalized for observation and testing after developing a fever  —  A source close to the 42nd president told NBC News that the situation is “not urgent” and that Clinton is “awake and alert.”  —  Former President Bill Clinton has been hospitalized in Washington after developing a fever … ",
    "url": "https://www.nbcnews.com/politics/politics-news/bill-clinton-hospitalized-developing-fever-rcna185287"
  },
  {
    "text": "Relief, defiance, anger: Families and advocates react to Biden's death row commutations  —  Victims' families and others affected by crimes that resulted in federal death row convictions shared a range of emotions on Monday, from relief to anger, after President Joe Biden commuted dozens of the sentences.",
    "url": "https://apnews.com/article/biden-death-row-commutations-trump-executions-ce7763faf93bc77773bfb635dd8c51d7"
  },
  {
    "text": "Statement from President Joe Biden on H.R. 5009, Servicemember Quality of Life Improvement and National Defense Authorization Act for Fiscal Year 2025  —  Today, I have signed into law H.R. 5009, the “Servicemember Quality of Life Improvement and National Defense Authorization Act for Fiscal Year 2025” (the “Act\").",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/12/23/statement-from-president-joe-biden-on-h-r-5009-servicemember-quality-of-life-improvement-and-national-defense-authorization-act-for-fiscal-year-2025/"
  },
  {
    "text": "Biden signs defense bill despite objections to ban on transgender health care for military children  —  The president also objected to language prohibiting the use of money earmarked to transfer detainees held at Guantánamo Bay, Cuba, to some foreign countries and into the U.S.",
    "url": "https://www.nbcnews.com/politics/white-house/biden-signs-defense-bill-objections-ban-transgender-health-care-milita-rcna185304"
  },
  {
    "text": "Former D.C. police intel chief found guilty of tipping off Proud Boys leader ahead of Jan. 6 attack  —  Shane Lamond was charged for tipping then-Proud Boys chairman Enrique Tarrio off about the warrant out for his arrest in the leadup to the Capitol attack.",
    "url": "https://www.nbcnews.com/politics/justice-department/former-dc-police-intel-chief-guilty-tipping-proud-boys-leader-ahead-ja-rcna185206"
  },
  {
    "text": "Trump's Wish to Control Greenland and Panama Canal: Not a Joke This Time  —  In recent days the president-elect has called for asserting U.S. control over the Panama Canal and Greenland, showing that his “America First” philosophy has an expansionist dimension.",
    "url": "https://www.nytimes.com/2024/12/23/us/politics/trump-greenland-panama-canal.html?unlocked_article_code=1.j04.qAML.5WBOdV_RGx0K&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Trump's FCC pick sends stern letter to Bob Iger, blasting ‘erosion in public trust’  —  New York CNN  —  The incoming chairman of the Federal Communications Commission is sending a stern message to the owners of television stations and networks.  And he is using ABC's recent settlement … ",
    "url": "https://www.cnn.com/2024/12/23/media/fcc-brendan-carr-bob-iger-abc-letter/"
  },
  {
    "text": "Elon Musk Is a Paid Subscriber to Shockingly Racist Pro-Apartheid South African X Account  —  Elon Musk, the richest man in the world and advisor to President-elect Donald Trump, is a paid subscriber to a virulently racist X account.  —  Musk not only follows an account called “Boer” … ",
    "url": "https://www.mediaite.com/news/elon-musk-is-a-paid-subscriber-to-shockingly-racist-pro-apartheid-south-african-x-account/"
  },
  {
    "text": "If You're Worried About the Future of Our Country, Do Something About It  —  In the early 1990s, when I was a co-senior partner at Goldman Sachs, younger people sometimes asked me for advice.  I told them, “First, become really good at what you do, and then branch out to get involved … ",
    "url": "https://www.nytimes.com/2024/12/24/opinion/civil-society-importance.html"
  },
  {
    "text": "Luigi Mangione's attorney blasts police, mayor for using the accused CEO killer as ‘political fodder’  —  Mangione pleaded not guilty to state murder and terror charges.  —  Luigi Mangione sits with his lawyer Karen Friedman Agnifilo during a hearing in New York State Supreme Court on charges … ",
    "url": "https://abcnews.go.com/US/ceo-killing-suspect-mangione-manhattan-court-arraignment-state/story?id=117041573"
  },
  {
    "text": "Judge rules Arkansas law allowing criminal charges against librarians is unconstitutional  —  A federal judge on Monday struck down key parts of an Arkansas law that would have allowed criminal charges against librarians and booksellers for providing “harmful” materials to minors.",
    "url": "https://apnews.com/article/arkansas-books-librarians-obscenity-lawsuit-c05fc196fe4ba9c6ffe83d3287bc0d2f"
  },
  {
    "text": "Walmart illegally opened delivery drivers' deposit accounts, U.S. says  —  A federal lawsuit alleges that Walmart deceived more than a million delivery drivers by creating deposit accounts without their knowledge or consent, using their Social Security numbers and other personal information.",
    "url": "https://www.npr.org/2024/12/23/nx-s1-5237492/cfpb-sues-walmart-over-delivery-drivers-illegal-deposit-accounts"
  },
  {
    "text": "Money for 9/11 Health Care Was Dropped from Year-End Spending Bill  —  A plan to ensure long-term funding to address health needs stemming from the terrorist attacks fell to the wayside after President-elect Donald Trump and Elon Musk objected to a bipartisan budget deal.",
    "url": "https://www.nytimes.com/2024/12/23/us/politics/sept-11-health-care-spending-bill.html?unlocked_article_code=1.j04.bEoW.c3WjRGWM83I_&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Fiend accused of burning woman to death on NYC subway is illegal migrant from Guatemala who sneaked into US after he was deported  —  The illegal Guatemalan migrant accused of setting a straphanger on fire and gawking as she burned to death was once deported — but sneaked back into the US … ",
    "url": "https://nypost.com/2024/12/23/us-news/nyc-subway-burn-suspect-is-illegal-migrant-from-guatemala-who-sneaked-into-us-after-being-deported/"
  },
  {
    "text": "Scientists Warn of Harmful Release From Tea Bags  —  Drinking tea from plastic-containing tea bags could expose you to billions of nano- and microplastics with every sip, putting your health at risk.  —  Many tea bags contain small amounts of tiny plastic particles called microplastics.",
    "url": "https://www.newsweek.com/harmful-release-tea-bags-microplastics-nanoplastics-2005123"
  }
]