[
  {
    "text": "Private Data and Passwords of Senior U.S. Security Officials Found Online  —  Donald Trump's most important security advisers used Signal to discuss an imminent military strike.  Now, reporting by DER SPIEGEL has found that the contact data of some of those officials, including mobile phone numbers … ",
    "url": "https://www.spiegel.de/international/world/hegseth-waltz-gabbard-private-data-and-passwords-of-senior-u-s-security-officials-found-online-a-14221f90-e5c2-48e5-bc63-10b705521fb7"
  },
  {
    "text": "Mike Waltz Left His Venmo Friends List Public  —  A WIRED review shows national security adviser Mike Waltz, White House chief of staff Susie Wiles, and other top officials left sensitive information exposed via Venmo—until WIRED asked about it.  —  A Venmo account under the name … ",
    "url": "https://www.wired.com/story/michael-waltz-left-his-venmo-public/"
  },
  {
    "text": "Michael Waltz's Venmo Is Public, and It's Full of Journalists  —  The figure who tagged a journalist into a Signal chat about the attack on Yemen also failed to set his Venmo to private, revealing his willingness to engage with reporters of all political stripes.",
    "url": "https://prospect.org/politics/2025-03-26-michael-waltz-venmo-public-full-of-journalists/"
  },
  {
    "text": "‘Somebody has to go down’: Trump allies take aim at Michael Waltz  —  In a particularly rough week for the Trump administration, a number of the president's allies are calling for accountability after military plans were inadvertently shared with a journalist.",
    "url": "https://www.nbcnews.com/politics/trump-administration/trump-allies-take-aim-michael-waltz-rcna198289"
  },
  {
    "text": "The Five Scandals (and One Fascinating Political Insight) of Signalgate  —  The Trump administration's group chat tells a lot about itself  —  Welcome to Doomsday Scenario, my regular column on national security, geopolitics, history, and—unfortunately—the fight for democracy in the Trump era.",
    "url": "https://www.doomsdayscenario.co/p/the-five-scandals-and-one-fascinating-political-insight-of-signalgate"
  },
  {
    "text": "Turkish student at Tufts University detained, video shows masked people handcuffing her  —  A Turkish national and doctoral student at Tufts University has been detained by U.S. Department of Homeland Security agents without explanation, her lawyer said Wednesday.",
    "url": "https://apnews.com/article/tufts-student-detained-massachusetts-immigration-6c3978da98a8d0f39ab311e092ffd892"
  },
  {
    "text": "Rumeysa Ozturk, a Tufts Student, Is Detained by ICE  —  The university was told that the student's visa had been terminated, its president said in a late-night email to students and faculty members.  —  An international student in a graduate program at Tufts University was taken … ",
    "url": "https://www.nytimes.com/2025/03/26/us/ice-tufts-student-detained-rumeysa-ozturk.html"
  },
  {
    "text": "WATCH: The Moment Masked ICE Agents Arrested Tufts Graduate Student Who Spoke Out in Support of Palestine  —  “I can buy that badge from a fucking costume store,” says a witness to the “kidnapping” of Rumeysa Ozturk as she was on her way to break her Ramadan fast.",
    "url": "https://zeteo.com/p/watch-the-moment-masked-ice-agents"
  },
  {
    "text": "Here is the latest.  —  The measure is intended to bring car factories to the United States but could increase prices for consumers significantly.  —  Here is the latest.  —  President Trump said on Wednesday that he would impose a 25 percent tariffs on all cars that are shipped into the United States.",
    "url": "https://www.nytimes.com/live/2025/03/26/business/trump-tariffs-auto-cars?unlocked_article_code=1.604.lNy6.fVLOxD0nzK3u&smid=url-share"
  },
  {
    "text": "Social Security backs off plan to cut phone services for disabled people  —  But millions applying for retirement or survivor benefits will no longer be allowed to verify their identity by phone, and will need to do so online or in person.  —  The Social Security Administration … ",
    "url": "https://www.washingtonpost.com/politics/2025/03/26/social-security-cuts-phone-elderly-disabled/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQyOTYxNjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ0MzQzOTk5LCJpYXQiOjE3NDI5NjE2MDAsImp0aSI6IjlhYWFkZmY2LTAwYzAtNGZkNS1hZDNiLTYxN2Y2NWM2OGQ4NiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzAzLzI2L3NvY2lhbC1zZWN1cml0eS1jdXRzLXBob25lLWVsZGVybHktZGlzYWJsZWQvIn0.0QttKE9z49OoBXCcXtf3SXP4LzvfYg9p_09ix2TNjMM&itid=gfta"
  },
  {
    "text": "“You're Here Because of Your Tattoos”  —  On Friday, March 14, Arturo Suárez Trejo called his wife, Nathali Sánchez, from an immigration detention center in Texas.  Suárez, a 33-year-old native of Caracas, Venezuela, explained that his deportation flight had been delayed.",
    "url": "https://www.motherjones.com/politics/2025/03/trump-el-salvador-venezulea-deportation-prison-cecot-bukele/"
  },
  {
    "text": "A populist uprising stirs among Democrats furious at their leaders  —  In dozens of interviews at recent Democratic events, voters said their party leaders need to show a much greater sense of urgency — and develop a plan to stop Trump and Musk.  —  Just now",
    "url": "https://www.washingtonpost.com/politics/2025/03/27/democrats-populist-trump-sanders-aoc-schumer/"
  },
  {
    "text": "Trump's executive order on elections is a blatant power grab  —  It seems especially dangerous to take power away from the states when there are many threats to our democracy.  —  By design, presidents have no power over the conduct of federal elections.  President Donald Trump's recent executive order … ",
    "url": "https://www.msnbc.com/opinion/msnbc-opinion/trump-election-executive-order-citizenship-proof-vote-rcna198229"
  },
  {
    "text": "Now that Trump has silenced Voice of America, could U.S. public media outlets be next?  —  The president's decision to shutter the global news organization portends ever more troubling repression of independent journalism in the United States.  —  Two weeks ago, President Donald Trump signed … ",
    "url": "https://chicago.suntimes.com/other-views/2025/03/25/trump-voice-of-america-press-freedom-public-media-npr-pbs-wbez-chicago-jim-friedlich"
  },
  {
    "text": "Federal Court Slaps Down DOJ's Request to Allow Deportations Under Wartime Law  —  A three-judge panel Wednesday with a 2-1 vote declined the Department of Justice's (DOJ) request to lift a lower-court order preventing the Trump administration from using an 18th century wartime law to deport people … ",
    "url": "https://www.democracydocket.com/news-alerts/federal-court-deny-trump-request-deportations-aliens-enemies-act/"
  },
  {
    "text": "Trump changes his tune on Signalgate: ‘I always thought it was Mike’  —  Some military and government officials have expressed concern about the contents of Hegseth's messages saying he leaked sensitive attack details that were “reckless and dangerous.”  —  President Donald Trump tentatively … ",
    "url": "https://www.politico.com/news/2025/03/26/trump-blames-mike-waltz-signal-00252707"
  },
  {
    "text": "4 American soldiers who went missing in Lithuania have died, NATO leader says  —  NATO Secretary-General Mark Rutte said Wednesday that four U.S. soldiers who went missing while training in Lithuania have died, but that he did not yet know the details.  A U.S. official would say only that the four soldiers … ",
    "url": "https://apnews.com/article/lithuania-pabrade-us-soldiers-military-training-c89957fc6a62da8624202095920630e1"
  },
  {
    "text": "In a Victory for Autoworkers, Auto Tariffs Mark the Beginning of the End of NAFTA and the “Free Trade” Disaster  —  This afternoon, the Trump administration announced major tariffs on passenger cars and trucks entering the U.S. market, marking the beginning of the end of a thirty-plus year “free trade” disaster.",
    "url": "https://uaw.org/tariffs-mark-beginning-of-victory-for-autoworkers/"
  },
  {
    "text": "Federal appeals court maintains temporary block on Trump's use of Alien Enemies Act for deportations  —  A divided federal appeals court has maintained a temporary block on President Donald Trump's ability to use the Alien Enemies Act to quickly deport alleged members of a Venezuelan gang.",
    "url": "https://cnn.com/2025/03/26/politics/alien-enemies-act-trump-dc-circuit-court-of-appeals"
  },
  {
    "text": "Yale professor who studies fascism fleeing US to work in Canada  —  Jason Stanley, who says grandmother fled Berlin with his father in 1939, says US may become ‘fascist dictatorship’  —  A Yale professor who studies fascism is leaving the US to work at a Canadian university … ",
    "url": "https://www.theguardian.com/us-news/2025/mar/26/yale-professor-fascism-canada"
  },
  {
    "text": "Trump Is Going After the Independence of the Entire Legal Profession, Not Just Big Law  —  A new presidential memo is meant to instill fear in any firm that dares to represent his political adversaries  —  The Trump administration's assault on lawyers who represent its perceived adversaries … ",
    "url": "https://www.theunpopulist.net/p/trump-is-going-after-the-independence?triedRedirect=true"
  },
  {
    "text": "Trump's Pick For Ambassador To South Africa Actively Opposed Fight To End Apartheid  —  As Black activists in South Africa fought against their country's racist apartheid government decades ago, some on the American right felt they took it too far.  One of those people who stepped up and spoke … ",
    "url": "https://talkingpointsmemo.com/news/trumps-pick-for-ambassador-to-south-africa-actively-opposed-fight-to-end-apartheid"
  },
  {
    "text": "Trump Administration Abruptly Cuts Billions From State Health Services  —  States were told Monday that they could no longer use grants that were funding infectious disease management and addiction services.  —  The Department of Health and Human Services has abruptly canceled more than $12 billion … ",
    "url": "https://www.nytimes.com/2025/03/26/health/trump-state-health-grants-cuts.html"
  },
  {
    "text": "Canada freezes rebate payments to Tesla, bans it from future rebate programs due to tariffs  —  Canada has frozen all rebate payments for Tesla (TSLA.O) and banned the electric-vehicle maker from future EV rebate programs, Transport Minister Chrystia Freeland said on Tuesday.",
    "url": "https://www.reuters.com/business/autos-transportation/canada-freezes-rebate-payments-tesla-bans-it-future-rebate-programs-due-tariffs-2025-03-25/"
  }
]