[
  {
    "text": "With Jan. 6 Rioters Sentenced, Prosecuting Trump Will Be a Different Challenge  —  With leaders of the far-right groups that helped drive the attack on the Capitol sentenced to long prison terms, attention is shifting to the fraught process of prosecuting Donald Trump.",
    "url": "https://www.nytimes.com/2023/09/06/us/politics/enrique-tarrio-trump-jan-6.html"
  },
  {
    "text": "Willis seeks to shield jurors in Trump trial  —  Move comes after online harassment of grand jurors who indicted former president  —  X  —  Fulton County District Attorney Fani Willis has asked the judge in the Donald Trump racketeering trial to shield the identities of prospective jurors … ",
    "url": "https://www.ajc.com/news/willis-seeks-to-shield-jurors-in-trump-trial/7KXEQAXDL5D2TMG5V2MR4FP3XA/"
  },
  {
    "text": "CNN Poll: Biden faces negative job ratings and concerns about his age as he gears up for 2024  —  President Joe Biden faces continued headwinds from broadly negative job ratings overall, widespread concerns about his age and decreased confidence among Democratic-aligned voters, according to a new CNN Poll conducted by SSRS.",
    "url": "https://www.cnn.com/2023/09/07/politics/cnn-poll-joe-biden-headwinds/"
  },
  {
    "text": "Scoop: Trump privately urged to support Biden's Saudi mega-deal  —  Sen. Lindsey Graham (R-S.C.) told Axios he has urged former President Trump to support the mega-deal President Biden is negotiating with Saudi Arabia, which could pave the way for a historic peace agreement between the kingdom and Israel.",
    "url": "https://www.axios.com/2023/09/06/biden-saudi-mega-deal-israel-trump"
  },
  {
    "text": "America's Authoritarian Exceptionalism  —  Demagogues usually arise in times of chaos and privation.  In America, our demagogues have become powerful during a period of peace and prosperity.  —  ∙ Paid  —  1. Decadence  —  We're going to keep doing this and I'm sorry.",
    "url": "https://thetriad.thebulwark.com/p/americas-authoritarian-exceptionalism"
  },
  {
    "text": "Senate Confirmation Still in Limbo for 301 Military Leaders  —  The Senate has returned to work, and there is still no resolution in sight of confirmation of general and flag officers by the body.  —  Alabama Sen. Thomas H. Tuberville has put holds on the nominations of 301 senior military leaders … ",
    "url": "https://www.defense.gov/News/News-Stories/Article/Article/3515996/senate-confirmation-still-in-limbo-for-301-military-leaders/"
  },
  {
    "text": "Tommy Tuberville's Hissy Fit Shows McConnell Has Lost His Hold on the GOP  —  The ex-football coach-turned-junior senator is holding up vital military promotions and brazenly thumbing his nose at the longest serving Republican Senate leader. … It should be a national embarrassment … ",
    "url": "https://www.thedailybeast.com/tommy-tubervilles-hissy-fit-shows-mitch-mcconnell-lost-his-hold-on-the-gop"
  },
  {
    "text": "The Giuliani aide who ‘vanished’  —  Documents reviewed by POLITICO — and also in the hands of federal prosecutors — offer new details about Rudy Giuliani's ill-fated efforts to reverse the 2020 election.  —  In December 2020, an adviser to Rudy Giuliani circulated a draft email addressed … ",
    "url": "https://www.politico.com/news/2023/09/06/giuliani-aide-vanished-trump-election-00114307"
  },
  {
    "text": "Pennsylvania school district requires social studies classes to incorporate right-wing propaganda  —  Last Monday, the Pennridge School Board, located outside of Philadelphia, imposed a new social studies curriculum that will require teachers to incorporate lessons from the 1776 Curriculum … ",
    "url": "https://popular.info/p/pennsylvania-school-district-requires"
  },
  {
    "text": "‘A Big Circle Jerk’: John Fetterman Dares Republicans To Impeach Joe Biden  —  “Go ahead.  Do it, I dare you,” said the Democratic senator.  “It's a loser.”  —  LOADING  —  Sen. John Fetterman (D-Pa.) had some blunt words for Republicans who are pushing to impeach President Joe Biden: It'll bite you in next year's elections.",
    "url": "https://www.huffpost.com/entry/joe-biden-impeachment-john-fetterman_n_64f8df8de4b0d44852edd611"
  },
  {
    "text": "Prosecutors will seek Hunter Biden indictment by end of September  —  Special counsel David Weiss will seek to indict Hunter Biden before the end of this month, the prosecutor said in a court filing updating a judge on his investigation into the president's son's failure to pay taxes.",
    "url": "https://thehill.com/regulation/court-battles/4190614-prosecutors-will-seek-hunter-biden-indictment-by-end-of-september/"
  },
  {
    "text": "I Can't Keep Trump Off the Ballot  —  Voters should decide elections: That's the simple lesson of Georgia in 2018 and 2020.  —  Atlanta  —  Some legal scholars are arguing that secretaries of state should remove Donald Trump from the 2024 presidential ballot under Section 3 of the 14th Amendment … ",
    "url": "https://www.wsj.com/articles/i-cant-keep-trump-off-the-ballot-georgia-sec-state-14th-amendment-c1017ede?mod=followamazon"
  },
  {
    "text": "Newly obtained George Santos “vulnerability report” spotted red flags long before embattled Rep. was elected  —  When an outside firm hired by then-congressional hopeful George Santos in 2021 delivered a secret internal report detailing aspects of the candidate's checkered background, several of his aides found it too much to stomach.",
    "url": "https://www.cbsnews.com/news/george-santos-vulnerability-report-red-flags-long-before-embattled-rep-was-elected/"
  },
  {
    "text": "Judge Orders Texas to Move Barrier From Middle of the Rio Grande  —  A federal judge ordered the state to move the barrier, placed to discourage illegal crossings from Mexico, to the banks of the river.  —  A federal judge ordered Gov. Greg Abbott on Wednesday to move a barrier of floating buoys … ",
    "url": "https://www.nytimes.com/2023/09/06/us/texas-border-rio-grande-lawsuit.html"
  },
  {
    "text": "Trump Plans $1M ‘Family Style’ Mar-a-Lago Dinner to Raise Money for His Co-Defendants (Exclusive)  —  The exact date of the candlelight event is still being ironed out, but Trump's sons will attend  —  A Facebook icon representing an external link to share the article on Facebook … ",
    "url": "https://themessenger.com/politics/trump-plans-family-style-mar-a-lago-dinner-to-raise-money-for-his-co-defendants"
  },
  {
    "text": "Texas AG Ken Paxton's Affair Explains Illegal Acts, Former Aide Testifies  —  An impeachment trial for the suspended Republican began in the state Senate Tuesday.  —  LOADING  —  An extramarital affair Texas Attorney General Ken Paxton had with a donor's employee helped connect the dots … ",
    "url": "https://www.huffpost.com/entry/ken-paxton-impeachment-trial-texas-affair_n_64f8eb9ce4b08f6e30ea12a5"
  },
  {
    "text": "UK PM Sunak faces new vote to fill seat after lawmaker accused of groping resigns  —  British Prime Minister Rishi Sunak faces another difficult vote to fill a vacant seat in parliament after a lawmaker who was given an eight-week suspension for groping two men at a London club last year announced he plans to resign.",
    "url": "https://www.reuters.com/world/uk/uk-lawmaker-pincher-who-was-facing-8-week-suspension-resigns-sky-news-2023-09-07/"
  },
  {
    "text": "Mexico decriminalizes abortion, extending Latin American trend of widening access to procedure  —  Mexico's Supreme Court threw out all federal criminal penalties for abortion Wednesday, ruling that national laws prohibiting the procedure are unconstitutional and violate women's rights … ",
    "url": "https://apnews.com/article/mexico-abortion-decriminalize-d87f6edbdf68c2e6c8f5700b3afd15de"
  },
  {
    "text": "Cancer among adults under 50 surged by 79%: Study  —  A study found that cancer cases in adults under 50 years old have risen sharply.  —  The study was published by BMJ Oncology and analyzed data between 1990 to 2019, finding an increase of 79% in cancer among people under 50 years old in just three decades.",
    "url": "https://www.washingtonexaminer.com/news/cancer-among-younger-adults-under-50-has-surged-by-79-in-new-study"
  }
]