[
  {
    "text": "Former Proud Boys leader Enrique Tarrio sentenced to 22 years for role in Jan. 6 attack  —  “I will have to live with that shame ... for the rest of my life,” Tarrio said.  —  A federal judge on Tuesday sentenced former Proud Boys leader Enrique Tarrio to 22 years in prison … ",
    "url": "https://abcnews.go.com/Politics/former-proud-boys-chairman-enrique-tarrio-convicted-seditious/story?id=102929276"
  },
  {
    "text": "Enrique Tarrio, Proud Boys leader on Jan. 6, sentenced to 22 years for seditious conspiracy  —  The sentence is the lengthiest among hundreds arising from the Jan. 6 attack on the Capitol.  —  Enrique Tarrio, the national leader of the Proud Boys on Jan. 6, 2021, was sentenced Tuesday … ",
    "url": "https://www.politico.com/news/2023/09/05/sentencing-enrique-tarrio-proud-boys-00114095"
  },
  {
    "text": "Christie knocks DeSantis for not meeting Biden during visit to survey hurricane damage  —  The former governor has experience navigating the optics of a visit from a Democratic president after a natural disaster.  —  Former New Jersey Gov. Chris Christie on Tuesday blasted Florida … ",
    "url": "https://www.politico.com/news/2023/09/05/christie-desantis-biden-hurricane-damage-00114110"
  },
  {
    "text": "Christie slams DeSantis for not meeting Biden after hurricane: ‘He was playing politics’  —  Chris Christie slammed GOP presidential rival Ron DeSantis for “playing politics” after the Florida governor chose not to meet with President Biden during his trip to the Sunshine State to survey damage from Idalia.",
    "url": "https://thehill.com/homenews/campaign/4188815-christie-slams-desantis-for-not-meeting-biden-after-idalia-he-was-playing-politics/"
  },
  {
    "text": "George Santos Insists He Is Not Working On A Plea Deal  —  The U.S. attorney prosecuting the case against freshman Rep. George Santos (R-N.Y.) has indicated they are involved in discussions on how to resolve the case.  However, in a series of texts to TPM, Santos insisted those talks … ",
    "url": "https://talkingpointsmemo.com/news/george-santos-insists-he-is-not-working-on-a-plea-deal"
  },
  {
    "text": "Trump scores big social media vote victory  —  Truth Social, former President Trump's social media platform, got a major reprieve on Tuesday, courtesy of shareholders in the blank-check company seeking to take it public. … - Had the shareholder vote failed, DWAC would have liquidated … ",
    "url": "https://www.axios.com/2023/09/05/trump-vote-victory-truth-social-dwac"
  },
  {
    "text": "All signs point to a rise in Covid  —  Covid hospitalizations, deaths and wastewater data — among other indicators — are all increasing as the U.S. heads into fall.  —  Signs in the U.S. continue to point to a rise in Covid activity as fall approaches.  —  Hospitalizations are rising.",
    "url": "https://www.nbcnews.com/health/health-news/signs-point-rise-covid-rcna103439"
  },
  {
    "text": "BREAKING: More than 60 Atlanta training center activists named in RICO Indictment  —  The Georgia Attorney General's Office is prosecuting the case  —  X  —  More than five dozen activists were indicted on RICO charges last week over the ongoing efforts to halt construction of the city … ",
    "url": "https://www.ajc.com/news/crime/breaking-more-than-60-training-center-activists-named-in-rico-indictment/DQ6B6GHTAJAJRH4SLGIIBAMXR4/"
  },
  {
    "text": "Gaetz advocates forcing impeachment votes in warning to McCarthy  —  Rep. Matt Gaetz (R-Fla.) on Tuesday forecast upcoming moves to force House votes on impeachment, while sending a warning shot to Speaker Kevin McCarthy (R-Calif.).  —  The firebrand Republican's remarks come as McCarthy … ",
    "url": "https://thehill.com/homenews/house/4188271-gaetz-advocates-forcing-impeachment-votes-in-warning-to-mccarthy/"
  },
  {
    "text": "Senator appears to suggest bipartisan bill will censor transgender content online  —  The Kids Online Safety Act, aimed at protecting children from harmful online content, has been endorsed by lawmakers on both sides of the aisle, as well as by President Joe Biden.",
    "url": "https://www.nbcnews.com/nbc-out/out-politics-and-policy/senator-appears-suggest-bipartisan-bill-will-censor-transgender-conten-rcna103479"
  },
  {
    "text": "A Huge Threat to the U.S. Budget Has Receded.  And No One Is Sure Why.  —  For decades, runaway Medicare spending was the story of the federal budget.  —  Now, flat Medicare spending might be a bigger one.  —  Something strange has been happening in this giant federal program.",
    "url": "https://www.nytimes.com/interactive/2023/09/05/upshot/medicare-budget-threat-receded.html"
  },
  {
    "text": "Appeals court limits special counsel's effort to access Rep. Scott Perry's phone  —  Investigators have long been fighting to obtain records from Perry, who aided Donald Trump's effort to remain in power after the 2020 election.  —  A federal appeals court panel has partially blocked efforts … ",
    "url": "https://www.politico.com/news/2023/09/05/scott-perry-phone-court-ruling-00114005"
  },
  {
    "text": "New York AG asks judge to sanction Trump for rehashing failed legal arguments  — New York Attorney General Letitia James asked a judge Tuesday to sanction Donald Trump, other defendants, and their lawyers for rehashing the same legal arguments in James' big civil fraud lawsuit against the former president.",
    "url": "https://www.cnbc.com/2023/09/05/new-york-ag-asks-judge-to-sanction-trump-for-rehashing-failed-legal-arguments.html"
  },
  {
    "text": "Gabe Amo Wins Rhode Island Special Congressional Primary  —  Amo becomes the overwhelming favorite to become the first person of color to represent Rhode Island in Congress  —  A Facebook icon representing an external link to share the article on Facebook.A Twitter icon representing … ",
    "url": "https://themessenger.com/politics/gabe-amo-wins-rhode-island-special-congressional-primary"
  },
  {
    "text": "Sen. Sheldon Whitehouse files ethics complaint over Justice Samuel Alito interview  —  The Rhode Island Democrat asked Chief Justice John Roberts to investigate comments made by Alito in a Wall Street Journal interview.  —  WASHINGTON — Democratic Sen. Sheldon Whitehouse is demanding … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/sen-sheldon-whitehouse-files-ethics-complaint-justice-samuel-alito-int-rcna103394"
  },
  {
    "text": "Man Cleared of Rape Conviction 48 Years Later Thanks to DNA  —  Leonard Mack fell victim to racial bias and discarded evidence, but said he never lost hope  —  A Facebook icon representing an external link to share the article on Facebook.A Twitter icon representing an external link to share … ",
    "url": "https://themessenger.com/news/man-cleared-of-rape-conviction-48-years-later-thanks-to-dna"
  },
  {
    "text": "Republicans hired way more ex-lobbyists as congressional staffers in the last year than Democrats, analysis finds  — In Washington, people often move between jobs as Capitol Hill staffers and as lobbyists.  — Per a new analysis, Republicans have hired way more former lobbyists than Democrats in the last year.",
    "url": "https://www.businessinsider.com/republicans-hire-more-lobbyists-than-democrats-last-year-legistorm-2023-9?op=1"
  },
  {
    "text": "Comer Subpoenas Mayorkas, DHS & Secret Service Employees After Obstructing Investigation into Politicized Hunter Biden Criminal Investigation  —  WASHINGTON—House Committee on Oversight and Accountability Chairman James Comer (R-Ky.) today issued six subpoenas to the Department of Homeland Security … ",
    "url": "https://oversight.house.gov/release/comer-subpoenas-mayorkas-dhs-secret-service-employees-after-obstructing-investigation-into-politicized-hunter-biden-criminal-investigation/"
  },
  {
    "text": "House Majority Forward Announces $20 Million Voter Registration and Grassroots Mobilization Campaign  —  Initial Investment Includes Outreach to Black, Latino, AAPI, and Native American Communities  —  Washington, D.C. - House Majority Forward is announcing an initial $20 million investment … ",
    "url": "https://www.housemajorityforward.org/news/house-majority-forward-announces-20-million-voter-registration-and-grassroots-mobilization-campaign"
  },
  {
    "text": "United Airlines requests nationwide ground stop, FAA says  —  The exact cause for grounding its fleet is unknown, but could be because of technological problems, according to authorities.  —  United Airlines has requested grounding its fleet nationwide, according to the Federal Aviation Administration.",
    "url": "https://www.nbcnews.com/news/us-news/united-airlines-requests-nationwide-ground-stop-faa-says-rcna103470"
  },
  {
    "text": "I Left Out the Full Truth to Get My Climate Change Paper Published  —  If you've been reading any news about wildfires this summer—from Canada to Europe to Maui—you will surely get the impression that they are mostly the result of climate change. … I am a climate scientist.",
    "url": "https://www.thefp.com/p/i-overhyped-climate-change-to-get-published"
  },
  {
    "text": "CNN Poll: GOP voters' broad support for Trump holds, with less than half seriously worried criminal charges will harm his 2024 chances  —  Former President Donald Trump continues to hold what has proven to be an unshakeable position atop the Republican field of candidates vying … ",
    "url": "https://www.cnn.com/2023/09/05/politics/cnn-poll-trump-primary-criminal-charges/"
  },
  {
    "text": "Americans Are Losing Faith in the Value of College.  Whose Fault Is That?  —  For most people, the new economics of higher ed make going to college a risky bet.  —  A decade or so ago, Americans were feeling pretty positive about higher education.  Public-opinion polls in the early 2010s all told the same story.",
    "url": "https://www.nytimes.com/2023/09/05/magazine/college-worth-price.html"
  },
  {
    "text": "Three Years Later, Trump Deserves A Nobel Peace Prize For The Abraham Accords  —  On Sept. 15, 2020, President Trump ushered in a new era of peace and collaboration in the Middle East without a single bullet fired.  —  This month, the world will celebrate the three-year anniversary of President Donald Trump's Abraham Accords.",
    "url": "https://thefederalist.com/2023/09/05/three-years-later-trump-deserves-a-nobel-peace-prize-for-the-abraham-accords/"
  }
]