[
  {
    "text": "Matt Gaetz ethics report says his drug use and sex with a minor violated state laws  —  Former Rep. Matt Gaetz, a Florida Republican who briefly stood to become President-elect Donald Trump's nominee to be attorney general, was found by congressional ethics investigators to have paid numerous women … ",
    "url": "https://www.cbsnews.com/news/matt-gaetz-ethics-report-released/"
  },
  {
    "text": "House Ethics report finds evidence Matt Gaetz paid thousands for sex and drugs including paying a 17-year-old for sex in 2017  —  The House Ethics Committee found evidence that former Rep. Matt Gaetz paid tens of thousands of dollars to women for sex or drugs on at least 20 occasions … ",
    "url": "https://www.cnn.com/2024/12/23/politics/matt-gaetz-house-ethics-report"
  },
  {
    "text": "Not the Life Matt Gaetz Was Planning On  —  The normal rules of public disgrace may no longer apply to Donald Trump.  But at least some expectation of good behavior remains, it seems, for a politician in Trump's orbit.  —  After a multiyear investigation, the House Ethics Committee reported today … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/12/matt-gaetz-house-ethics-report/681163/"
  },
  {
    "text": "The Trumpian Attitude at the Heart of the Gaetz Report  —  The Trumpian Attitude at the Heart of the Gaetz Report  —  There is so much repellently sleazy behavior documented in the House Ethics Committee report about Matt Gaetz that a reader has to stop every few pages to look away and focus … ",
    "url": "https://www.nytimes.com/live/2024/12/17/opinion/thepoint?unlocked_article_code=1.jk4.kP2r.qvwL4M3ewFsM&smid=url-share"
  },
  {
    "text": "Statement from President Joe Biden on Federal Death Row Commutations  —  I've dedicated my career to reducing violent crime and ensuring a fair and effective justice system.  —  Today, I am commuting the sentences of 37 of the 40 individuals on federal death row to life sentences without the possibility of parole.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/12/23/statement-from-president-joe-biden-on-federal-death-row-commutations/"
  },
  {
    "text": "Bill Clinton is hospitalized for observation and testing after developing a fever  —  A source close to the 42nd president told NBC News that the situation is “not urgent” and that Clinton is “awake and alert.”  —  Former President Bill Clinton has been hospitalized in Washington after developing a fever … ",
    "url": "https://www.nbcnews.com/politics/politics-news/bill-clinton-hospitalized-developing-fever-rcna185287"
  },
  {
    "text": "Bill Clinton admitted to hospital for ‘testing and observation’ after falling ill  —  Former President Bill Clinton was admitted to a hospital Monday afternoon for testing and observation after developing a fever, a spokesperson for Clinton said.  —  “President Clinton was admitted … ",
    "url": "https://www.foxnews.com/politics/bill-clinton-admitted-hospital-testing-observation-after-falling-ill"
  },
  {
    "text": "Former D.C. police intel chief found guilty of tipping off Proud Boys leader ahead of Jan. 6 attack  —  Shane Lamond was charged for tipping then-Proud Boys chairman Enrique Tarrio off about the warrant out for his arrest in the leadup to the Capitol attack.",
    "url": "https://www.nbcnews.com/politics/justice-department/former-dc-police-intel-chief-guilty-tipping-proud-boys-leader-ahead-ja-rcna185206"
  },
  {
    "text": "D.C. officer guilty of leaking to Proud Boys' Tarrio before Jan. 6  —  Prosecutors said former intel unit head Shane Lamond helped Tarrio and the Proud Boys in the days before the Capitol riot.  —  A former D.C. police lieutenant was found guilty in federal court Monday on charges … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2024/12/23/lamond-proud-boys-jan6-verdict/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM0OTMwMDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM2MzEyMzk5LCJpYXQiOjE3MzQ5MzAwMDAsImp0aSI6ImI2ZTk2YzA3LWJkMzAtNDk1Yy05ZWY4LWIyODg4ZDQ0OGFkMyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9kYy1tZC12YS8yMDI0LzEyLzIzL2xhbW9uZC1wcm91ZC1ib3lzLWphbjYtdmVyZGljdC8ifQ.9bWHjK2_2uiiIgJOaXfdxaZltYvBIofnuuclnUAKspc&itid=gfta"
  },
  {
    "text": "Luigi Mangione's attorney blasts police, mayor for using the accused CEO killer as ‘political fodder’  —  Mangione pleaded not guilty to state murder and terror charges.  —  Luigi Mangione sits with his lawyer Karen Friedman Agnifilo during a hearing in New York State Supreme Court on charges … ",
    "url": "https://abcnews.go.com/US/ceo-killing-suspect-mangione-manhattan-court-arraignment-state/story?id=117041573"
  },
  {
    "text": "Scientists Warn of Harmful Release From Tea Bags  —  Drinking tea from plastic-containing tea bags could expose you to billions of nano- and microplastics with every sip, putting your health at risk.  —  Many tea bags contain small amounts of tiny plastic particles called microplastics.",
    "url": "https://www.newsweek.com/harmful-release-tea-bags-microplastics-nanoplastics-2005123"
  },
  {
    "text": "Trump's big Mike Johnson decision  —  A messy Capitol Hill endgame has the president-elect pondering a change in House leadership.  —  After the House passed a shutdown-averting spending bill Friday, a very relieved Speaker Mike Johnson proclaimed to reporters that President-elect Donald Trump was “certainly happy about this outcome.”",
    "url": "https://www.politico.com/news/2024/12/23/mike-johnson-speaker-trump-limbo-00195854"
  },
  {
    "text": "Elon Musk Is a Paid Subscriber to Shockingly Racist Pro-Apartheid South African X Account  —  Elon Musk, the richest man in the world and advisor to President-elect Donald Trump, is a paid subscriber to a virulently racist X account.  —  Musk not only follows an account called “Boer” … ",
    "url": "https://www.mediaite.com/news/elon-musk-is-a-paid-subscriber-to-shockingly-racist-pro-apartheid-south-african-x-account/"
  },
  {
    "text": "Trump Organization Accused of Tax Evasion in Panama: What We Know  —  has started a quarrel with Panama over the fees it's charging American ships to use the Panama Canal, while the Trump Organization is fighting a court case over taxes in the central American country.  —  What to Know",
    "url": "https://www.newsweek.com/donald-trump-panama-canal-threats-hotel-taxes-court-filing-2005079"
  },
  {
    "text": "Texas AG Paxton sues NCAA for allowing transgender women to compete  —  Texas Attorney General Ken Paxton (R) sued the NCAA on Sunday, accusing the organization of engaging in “false, deceptive, and misleading practices” by allowing transgender women to participate in athletic events it markets as women's competitions.",
    "url": "https://thehill.com/homenews/state-watch/5053923-texas-attorney-general-sues-ncaa/"
  },
  {
    "text": "Trump's FCC pick sends stern letter to Bob Iger, blasting ‘erosion in public trust’  —  New York CNN  —  The incoming chairman of the Federal Communications Commission is sending a stern message to the owners of television stations and networks.  And he is using ABC's recent settlement … ",
    "url": "https://www.cnn.com/2024/12/23/media/fcc-brendan-carr-bob-iger-abc-letter/"
  },
  {
    "text": "Research Finds Vaccines Are Not Behind the Rise in Autism.  So What Is?  —  There is no one factor that causes autism — or explains its growing prevalence.  Researchers are seeking explanations for the surge.  Here are some possibilities.  —  When President-elect Donald J. Trump mused … ",
    "url": "https://www.nytimes.com/2024/12/23/health/what-causes-autism.html"
  },
  {
    "text": "Fiend accused of burning woman to death on NYC subway is illegal migrant from Guatemala who sneaked into US after he was deported  —  The illegal Guatemalan migrant accused of setting a straphanger on fire and gawking as she burned to death was once deported — but sneaked back into the US … ",
    "url": "https://nypost.com/2024/12/23/us-news/nyc-subway-burn-suspect-is-illegal-migrant-from-guatemala-who-sneaked-into-us-after-being-deported/"
  }
]