[
  {
    "text": "Trump administration will offer all 2 million federal workers a buyout to resign  —  An email is set to go out to federal workers beginning Tuesday.  —  President Donald Trump's administration is set to offer every single federal worker the chance to take a “deferred resignation” … ",
    "url": "https://www.nbcnews.com/politics/white-house/trump-administration-offer-federal-workers-buyouts-resign-rcna189661"
  },
  {
    "text": "Elon Musk Lackeys Have Taken Over the Office of Personnel Management  —  Sources tell WIRED that the OPM's top layers of management now include individuals linked to xAI, Neuralink, the Boring Company, and Palantir.  One expert found the takeover reminiscent of Stalin.",
    "url": "https://www.wired.com/story/elon-musk-lackeys-office-personnel-management-opm-neuralink-x-boring-stalin/"
  },
  {
    "text": "Scoop: Trump offering buyouts to all federal workers, source says … We're five years past COVID and just 6 percent of federal employees work full-time in office.  That is unacceptable,\" a senior administration official tells Axios.",
    "url": "https://www.axios.com/2025/01/28/trump-federal-workers-quit-severance"
  },
  {
    "text": "Compelling Mass Civil Servant Resignations Will Create Chaos  —  Elon Musk's role at Twitter represents a Rorschach test for how people think he will fare in restructuring government.  For fans, he was able to cut the majority of the employees, and the site continued to run more or less as before.",
    "url": "https://donmoynihan.substack.com/p/compelling-mass-civil-servant-resignations"
  },
  {
    "text": "Throw Biden under the bus  —  Sleepy Joe landed us in this mess with bad, selfish decisions  —  When Joe Biden stepped aside in favor of Kamala Harris, the overwhelming majority of Democrats praised him for the decision and painted an overall flattering portrait of Biden's presidency and his career.",
    "url": "https://www.slowboring.com/p/throw-biden-under-the-bus"
  },
  {
    "text": "“Trump is trying to collapse our economy”: War on “woke” revealed as a war on all Americans  —  Christian nationalists behind the spending shutdown aim to punish everyone, not just imaginary Marxists  —  Initially, the most striking detail in the White House Office of Management and Budget memo … ",
    "url": "https://www.salon.com/2025/01/29/is-trying-to-collapse-our-economy/"
  },
  {
    "text": "Trump is already acting like a king  —  Late on Monday night, the Trump administration sent out a stunning memo suspending all federal grants.  Chaos followed, with everything from veteran's charities facing financial ruin to reports of Medicaid portals shutting down across the country.",
    "url": "https://www.vox.com/on-the-right-newsletter/397120/trump-federal-spending-grant-pause-cutoff-democracy"
  },
  {
    "text": "New Trump memo claims authority to ignore Congress  —  On Monday, the Trump administration issued an extraordinary memo ordering federal agencies to indefinitely freeze the “disbursement of all Federal financial assistance.”  The freeze was scheduled to take effect at 5 PM on Tuesday … ",
    "url": "https://popular.info/p/new-trump-memo-claims-authority-to"
  },
  {
    "text": "Trump's Order on Transgender Troops Will Likely Ban Their Service, Again  —  In an executive order issued Monday night, the president said transgender service members “cannot satisfy the rigorous standards necessary” for the military.  —  Hours after President Trump signed … ",
    "url": "https://www.nytimes.com/2025/01/28/us/politics/trump-transgender-troops.html"
  },
  {
    "text": "Protecting Children from Chemical and Surgical Mutilation  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:  —  Section 1.  Policy and Purpose.  Across the country today, medical professionals are maiming … ",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/01/protecting-children-from-chemical-and-surgical-mutilation/"
  },
  {
    "text": "Pentagon pulling Gen. Milley's security detail and clearance ‘immediately,’ may face demotion in retirement  —  EXCLUSIVE: Defense Secretary Pete Hegseth will announce he is “immediately pulling” retired Gen. Mark Milley's personal security detail and security clearance, multiple senior administration officials tell Fox News.",
    "url": "https://www.foxnews.com/politics/white-house-pulling-gen-milleys-security-detail-clearance-panel-may-face-demotion-retirement"
  },
  {
    "text": "Lara Trump: Caroline Kennedy's comments on RFK Jr. ‘disgusting’  — Caroline Kennedy lambastes RFK Jr. in letter to senators  — She calls cousin a ‘predator’ who lacks relevant experience  — Lara Trump: Comments are ‘part of that political game’  —  Lara Trump responded … ",
    "url": "https://thehill.com/homenews/administration/5112370-lara-trump-caroline-kennedy-robert-f-kennedy-jr-comments/"
  },
  {
    "text": "SCOOP: RFK Jr. Secretly Recorded Second Wife During Divorce and Acknowledged Being “Polygamous”  —  One recording might have violated state law.  It was part of a messy saga that ended with her suicide.  —  In the early 2010s, Robert F. Kennedy Jr. went through a contentious divorce with his second wife, Mary Richardson Kennedy.",
    "url": "https://www.motherjones.com/politics/2025/01/robert-f-kennedy-jr-richardson-divorce-polygamous-secret-recording-suicide-department-health-and-human-services-trump/"
  },
  {
    "text": "White House Press Secretary Makes Steely and Unflinching Debut  —  Karoline Leavitt used her first briefing in the role to warn veteran reporters that they were increasingly irrelevant.  —  So much for respecting your elders.  —  Karoline Leavitt, the new White House press secretary … ",
    "url": "https://www.nytimes.com/2025/01/28/us/politics/karoline-leavitt-debut.html"
  },
  {
    "text": "Iowa Democrats flip Senate seat in special election to cut into Republican majority  —  Iowa Democrats have flipped a state Senate seat vacated earlier this year by Chris Cournoyer, who resigned to become the state's new lieutenant governor.  —  Democrat Mike Zimmer has defeated Republican Kate Whittington … ",
    "url": "https://www.desmoinesregister.com/story/news/politics/elections/2025/01/28/iowa-democrats-flip-senate-seat-in-special-election-chris-cournoyer/77999519007/"
  },
  {
    "text": "The best commute to Washington belongs to Jim Justice  —  Most days before the Senate starts its day, a privately-owned Cessna Citation V jet lands at Washington Reagan National Airport.  —  And most evenings, after the chamber is done with its business, the same jet takes off for Greenbrier Valley Airport in Lewisburg, W.Va.",
    "url": "https://punchbowl.news/article/senate/jim-justice-takes-private-jet-to-work-in-dc/"
  },
  {
    "text": "Trump's PEPFAR Shutdown is White Supremacy in Action  —  The message is clear - these lives are expendable to an administration steeped in white supremacist ideology.  —  On Monday morning, a healthcare worker posted a final notice on the door of a small clinic in Johannesburg, South Africa … ",
    "url": "https://www.theindex.media/trumps-pepfar-shutdown-is-white-supremacy-in-action-2/"
  },
  {
    "text": "OpenAI says it has evidence China's DeepSeek used its model to train competitor  —  White House AI tsar David Sacks raises possibility of alleged intellectual property theft  —  OpenAI says it has found evidence that Chinese artificial intelligence start-up DeepSeek used the US company's proprietary models … ",
    "url": "https://www.ft.com/content/a0dfedd1-5255-4fa9-8ccc-1fe01de87ea6?accessToken=zwAGLNJX-fBAkdOg3-3RUlVPqdOMzB_gHeh-pg.MEYCIQCGjo04z0mtOsKbDspQLq2BMXyw8SbQnlYePOuqiqr6QgIhAInK67eBkYuZS-77ljnP-y--EJdN1wwRQ8GIR8sKMFgE&sharetype=gift&token=1eebbaa7-a4e6-4251-b665-c2f2562b38e4"
  },
  {
    "text": "‘It was leaked to us:’ Army in chaos over Trump orders  —  Confusion around the new administration's spending freezes and executive orders has caused disarray inside the Pentagon.  —  The Army rushed to satisfy President Donald Trump's executive orders this week, sparking so much confusion … ",
    "url": "https://www.politico.com/news/2025/01/28/army-trump-executive-order-chaos-00201074"
  },
  {
    "text": "How Trump's orbit used blunt force to squeeze Hegseth through  —  The aggressive posture, inspired by Trump, meant going after not only Democrats, the media and Hegseth's accusers — but also their own party.  —  Pete Hegseth seemed well on his way to becoming Trump's next Defense secretary … ",
    "url": "https://www.politico.com/news/2025/01/28/hegseth-confirmation-senate-trump-00201033"
  },
  {
    "text": "Trump administration may pull money from TSA, Coast Guard to help ICE afford costly deportations  —  The average cost to ICE to deport a single person during the Biden administration was about $10,500, sources told NBC News.  —  Immigrations and Customs Enforcement, the principal agency tasked … ",
    "url": "https://www.nbcnews.com/politics/national-security/administration-may-pull-money-tsa-help-fund-deportations-rcna189387"
  },
  {
    "text": "STAT+: Private emails show RFK Jr. making false claims about Covid-19 shots, linking vaccines to autism  —  On the eve of Robert F. Kennedy Jr.'s confirmation hearings, his physician niece has shared a trove of private emails in the hopes of derailing his nomination to lead the Department of Health and Human Services.",
    "url": "https://www.statnews.com/2025/01/28/kennedy-confirmation-hearing-niece-releases-emails-vaccine-criticism-conspiracy-theories/"
  },
  {
    "text": "Trump DOJ appointee in DC lashes out after flurry of ‘personally insulting’ leaks in his first week  —  The acting top federal prosecutor in Washington under President Donald Trump is furious about recent leaks to the press and also specifically directed staff to scrutinize a former official's work … ",
    "url": "https://www.cnn.com/2025/01/28/politics/trump-doj-appointee-in-dc-lashes-after-leaks/"
  },
  {
    "text": "Americans sour on some of Trump's early moves, Reuters/Ipsos poll finds  —  Americans have a dim view of some of President Donald Trump's early barrage of executive orders, including his attempt to do away with so-called birthright citizenship and his decision to rename the Gulf of Mexico, a Reuters/Ipsos poll found.",
    "url": "https://www.reuters.com/world/us/americans-sour-some-trumps-early-moves-reutersipsos-poll-finds-2025-01-28/"
  },
  {
    "text": "'Biden's Book Ban Hoax': Department of Education claims book bans are a ‘hoax’ and dismisses all complaints  —  The fear that book bans would worsen under Donald Trump's presidency has become a reality.  The Department of Education announced it is dismissing book ban complaints as a hoax … ",
    "url": "https://www.themarysue.com/bidens-book-ban-hoax-department-of-education-claims-book-bans-are-a-hoax-and-dismisses-all-complaints/"
  },
  {
    "text": "D.C. federal judge temporarily blocks Trump plan to pause federal aid spending  —  The order from Judge Loren AliKhan runs through next Monday, when further arguments in the case are scheduled.  —  Trump administration freezes nearly all federal grants and loans",
    "url": "https://www.nbcnews.com/politics/donald-trump/dc-federal-judge-temporarily-blocks-trump-plan-pause-federal-aid-spend-rcna189706"
  }
]