[
  {
    "text": "Restricting The Entry of Foreign Nationals to Protect the United States from Foreign Terrorists and Other National Security and Public Safety Threats  —  BY THE PRESIDENT OF THE UNITED STATES OF AMERICA  —  During my first Administration, I restricted the entry of foreign nationals into the United States … ",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/06/restricting-the-entry-of-foreign-nationals-to-protect-the-united-states-from-foreign-terrorists-and-other-national-security-and-public-safety-threats/"
  },
  {
    "text": "Stephen Miller Erupts in Fury over Low Arrests—and Hands Dems a Weapon  —  The potential deportation of people like Carol Hui, which has shocked locals in the Missouri town where she's lived for 20 years, has inspired a searching debate: What did people think they were voting for when they chose Donald Trump?",
    "url": "https://newrepublic.com/article/196154/stephen-miller-erupts-fury-low-arrests-and-hands-dems-weapon"
  },
  {
    "text": "Trump Orders Investigation of Biden and His Aides  —  The executive order is the latest effort by President Trump to stoke outlandish conspiracy theories about his predecessor and question the legality of his actions in office.  —  President Trump ordered his White House counsel … ",
    "url": "https://www.nytimes.com/2025/06/04/us/politics/trump-biden-investigation.html?unlocked_article_code=1.Mk8.MoHE._TDgJNXSpQL2"
  },
  {
    "text": "“The Intern in Charge”: Meet the 22-Year-Old Trump's Team Picked to Lead Terrorism Prevention  —  One year out of college and with no apparent national security expertise, Thomas Fugate is the Department of Homeland Security official tasked with overseeing the government's main hub for combating violent extremism.",
    "url": "https://www.propublica.org/article/trump-dhs-thomas-fugate-cp3-terrorism-prevention"
  },
  {
    "text": "Trump Is Losing Patience With Musk's Outbursts Over Megabill  —  Billionaire's attacks on Trump's tax bill are fraying his relationship with the president  —  WASHINGTON—President Trump is losing patience with Elon Musk after the billionaire attacked Republicans' sprawling tax-and-spending bill.",
    "url": "https://www.wsj.com/politics/policy/elon-musk-trump-tax-spending-republicans-5b779d6b?st=9sSzSr&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Supreme Court makes it easier to claim ‘reverse discrimination’ in employment, in a case from Ohio  —  A unanimous Supreme Court made it easier Thursday to bring lawsuits over so-called reverse discrimination, siding with an Ohio woman who claims she didn't get a job and then was demoted because she is straight.",
    "url": "https://apnews.com/article/supreme-court-discrimination-lawsuit-ohio-205f07a2d47d7a46cfc96a5fefdf9269"
  },
  {
    "text": "Scoop: Trump admired Ukraine's “badass” attack, but worries what's next  —  President Trump thought Ukraine's surprise drone attack over the weekend was “strong” and “badass,” sources who discussed it with him tell Axios, but he's also concerned it will make his ceasefire mission even harder.",
    "url": "https://www.axios.com/2025/06/05/trump-reaction-ukraine-drone-attack-spiderweb"
  },
  {
    "text": "Millions Would Lose Their Obamacare Coverage Under Trump's Bill  —  Though Republicans are not explicitly trying to repeal the Affordable Care Act, a series of small, technical changes would substantially reduce enrollment and increase the cost of coverage.  —  Millions of Obamacare enrollees … ",
    "url": "https://www.nytimes.com/2025/06/05/upshot/obamacare-cuts-republicans.html"
  },
  {
    "text": "Bidenworld goes scorched earth on Karine Jean-Pierre  —  Former Biden press secretary Karine Jean-Pierre announced Tuesday that she's written a book about a “broken” Biden White House and what she sees as the betrayal of the former president by the Democratic Party.",
    "url": "https://www.axios.com/2025/06/05/karine-jean-pierre-book-reaction-biden-aides"
  },
  {
    "text": "Karine Jean-Pierre leaves Democratic Party, pens book about ‘broken’ White House  —  Former press secretary's tome will publish in October, and its title is a nod to her recently announced departure from the Democratic Party to become an independent.  —  Weeks after the release … ",
    "url": "https://www.washingtonpost.com/politics/2025/06/04/karine-jean-pierre-biden-book-leaves-democrats/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ5MDA5NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzUwMzkxOTk5LCJpYXQiOjE3NDkwMDk2MDAsImp0aSI6IjZmZjQyYTI4LTc2MzktNDliNC05NTAyLWQyNWM0ZmY5N2NhMyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzA2LzA0L2thcmluZS1qZWFuLXBpZXJyZS1iaWRlbi1ib29rLWxlYXZlcy1kZW1vY3JhdHMvIn0.Bhp8a4AYPyCt6beJPqxp-XnTQ3y44A9RF4zEQWU3ixU&itid=gfta"
  },
  {
    "text": "Trump critic David Jolly running for governor as Democrat  —  Former Florida Republican congressman and Trump critic David Jolly on Thursday officially launched his campaign for governor as a Democrat.  —  “Let's end the politics of division and return Florida to voters who simply want an economy … ",
    "url": "https://thehill.com/homenews/campaign/5334167-david-jolly-launches-governor-campaign/"
  },
  {
    "text": "Columbia failed to meet accreditation standards, US government says  —  The U.S. Department of Education said on Wednesday it has notified a university accreditation body that Columbia University had violated federal anti-discrimination laws by its alleged failure to protect Jewish students on its campus.",
    "url": "https://www.reuters.com/world/us/us-education-department-says-columbia-university-violated-federal-anti-2025-06-04/"
  },
  {
    "text": "Alexandria Ocasio-Cortez Endorses Zohran Mamdani as Top Choice for Mayor  —  The New York City congresswoman said she would list Adrienne Adams second on her Democratic primary ballot and urged the left to unite to defeat Andrew Cuomo.  —  Representative Alexandria Ocasio-Cortez … ",
    "url": "https://www.nytimes.com/2025/06/05/nyregion/aoc-endorse-mamdani-mayor.html?unlocked_article_code=1.Mk8.DgW8.Pkuw1m5Gcj5s"
  },
  {
    "text": "Fact Sheet: President Donald J. Trump Restricts Foreign Student Visas at Harvard University  —  RESTRICTING FOREIGN STUDENT VISAS AT HARVARD: Today, President Donald J. Trump signed a Proclamation to safeguard national security by suspending the entry of foreign nationals seeking to study … ",
    "url": "https://www.whitehouse.gov/fact-sheets/2025/06/fact-sheet-president-donald-j-trump-restricts-foreign-student-visas-at-harvard-university/"
  },
  {
    "text": "Media coverage of Kilmar Abrego Garcia hurt Trump, not Democrats  —  A group of center-left Democratic strategists, politicians, and commentators met at “WelcomeFest” in Washington, D.C., on Wednesday to figure out what went wrong in 2024 and how to compete in the future.",
    "url": "https://www.gelliottmorris.com/p/kilmar-abrego-garcia-immigration-democrats-yglesias"
  },
  {
    "text": "Dems eye a villain-to-ally arc for Musk  —  Welcome to POLITICO's West Wing Playbook: Remaking Government, your guide to Donald Trump's unprecedented overhaul of the federal government — the key decisions, the critical characters and the power dynamics that are upending Washington and beyond.",
    "url": "https://www.politico.com/newsletters/west-wing-playbook-remaking-government/2025/06/04/dems-eye-a-villain-to-ally-arc-for-musk-00385945"
  },
  {
    "text": "Republicans Trying to Control Indiana University Meet Little Resistance  —  As university leaders face political pressure around the country, one president in Indiana has acquiesced to many conservative plans.  —  The sweeping changes to Indiana's public universities came suddenly this spring, with little time for debate.",
    "url": "https://www.nytimes.com/2025/06/05/us/republicans-indiana-public-universities.html?unlocked_article_code=1.Mk8.UiF8.3OkWMsnqky14&smid=url-share"
  },
  {
    "text": "Reviewing Certain Presidential Actions  —  MEMORANDUM FOR THE ATTORNEY GENERAL THE COUNSEL TO THE PRESIDENT  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby directed:  —  Section 1.  Background.",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/06/reviewing-certain-presidential-actions/"
  },
  {
    "text": "How to become a right-wing star?  Harass people  —  Here is one version of the story: A Brown University student created a shoddy AI that labeled individual university administrative employees with terms like “DEI,” “antisemitism,” and “flunkie.”  He emailed all of the employees … ",
    "url": "https://donmoynihan.substack.com/p/how-to-become-a-right-wing-star-harass"
  },
  {
    "text": "Feds sue Texas over long-standing law allowing undocumented students to receive in-state tuition  —  The lawsuit comes just days after the Legislature adjourned without repealing the first-in-the-nation law, which passed in 2001.  —  The U.S. Department of Justice is suing Texas … ",
    "url": "https://www.texastribune.org/2025/06/04/texas-justice-department-lawsuit-undocumented-in-state-tuition/"
  },
  {
    "text": "The Trump administration justifies its new entry ban as punishing countries for “visa overstays.”  Barring most people from 19 countries, the Presidential Proclamation refers again and again to a Customs and Border Protection (CBP) report estimating how many people come to the U.S. on a valid visa and then stay longer than authorized.",
    "url": "https://www.linkedin.com/posts/doug-rand_the-trump-administration-justifies-its-new-activity-7336264928367927296-7BJ0"
  },
  {
    "text": "Defying Trump, National Portrait Gallery Director Kim Sajet is still at work  —  The president said he had fired the museum leader — setting up a standoff between the White House and the Smithsonian.  —  President Donald Trump's latest attempt to assert control over an elite American cultural institution … ",
    "url": "https://www.washingtonpost.com/entertainment/art/2025/06/04/national-portrait-gallery-kim-sajet-trump/"
  },
  {
    "text": "The Trump Administration Is Spending $2 Million to Figure Out Whether DEI Causes Plane Crashes  —  When President Donald Trump blamed diversity, equity, and inclusion programs for the deadly January crash at Ronald Reagan Washington National Airport, some aviation officials were appalled.",
    "url": "https://www.theatlantic.com/politics/archive/2025/06/government-investigating-whether-dei-causes-plane-crashes/683038/"
  },
  {
    "text": "Elon Musk is a Disgusting Abomination  —  So is the One Big Beautiful Bill Act.  But still  —  1,162  —  On Tuesday, after Elon Musk blasted out the screed above, a friend texted me: “I guess the worm has turned.  Oh, wait, I guess that's RFK.”  Indeed.",
    "url": "https://paulkrugman.substack.com/p/elon-musk-is-a-disgusting-abomination"
  },
  {
    "text": "Trump Wants His Presidential Library Set in Florida, Enticed by Free Land  —  President gave little thought to a library after his first term, with aides fearing it would signal the end of his political career  —  Donald Trump is considering the campus of Florida Atlantic University … ",
    "url": "https://www.wsj.com/politics/policy/trump-wants-his-presidential-library-set-in-florida-enticed-by-free-land-c0f6e314"
  }
]