[
  {
    "text": "Trump reportedly plans to kick trans troops out of the military within days of inauguration  —  Trump's actions could eject thousands of current trans service members  —  Your support helps us to tell the story  —  From reproductive rights to climate change to Big Tech, The Independent is on the ground when the story is developing.",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/trump-transgender-military-policy-b2652956.html"
  },
  {
    "text": "Donald Trump to kick transgender troops out of US military  —  An executive order could be signed as early as his first day back in the White House, which would force 15,000 people out of their posts  —  Donald Trump is planning an executive order that would lead to the removal … ",
    "url": "https://www.thetimes.com/world/us-world/article/donald-trump-transgender-troops-us-military-52xf5cdlc"
  },
  {
    "text": "Playbook: The big decision facing Kamala Harris  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  SPARES HUNTER?  — “Joe Biden Should Commute Any Prison Sentence for Hunter Biden,” by Ankush Khardori: President JOE BIDEN “is on strong ground … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/11/25/the-big-decision-facing-kamala-harris-00191458"
  },
  {
    "text": "Joe Biden Should Commute Any Prison Sentence for Hunter Biden  —  The case for presidential mercy.  —  Thanks to President Joe Biden's Justice Department, Donald Trump is headed to the White House, and his son Hunter might be headed to prison.  And believe it or not, the drama will intensify shortly.",
    "url": "https://www.politico.com/news/magazine/2024/11/25/hunter-biden-commute-prison-sentence-00190737"
  },
  {
    "text": "Romania election stunner: Unexpected hard-right candidate surges in presidential vote  —  Romanian ultranationalist Călin Georgescu is currently on track to make it to the final round of presidential elections, according to Sunday's provisional results with more than 99.9 percent of precincts reporting.",
    "url": "https://www.politico.eu/article/romania-election-stunner-who-is-calin-georgescu-marcel-ciolacu/"
  },
  {
    "text": "Georgian ruling party defies protests, boycott to re-open parliament after disputed election  —  Lawmakers from Georgia's ruling party opened the first session of parliament on Monday after last month's disputed election, defying protesters outside and a boycott by opposition parties who say the vote was illegitimate.",
    "url": "https://www.reuters.com/world/europe/georgian-ruling-party-defies-protests-boycott-re-open-parliament-after-disputed-2024-11-25/"
  },
  {
    "text": "Rand Paul Reminds Critics of Hegseth's Planning to Ditch Military DEI Why It Matters  —  The current U.S. Joint Chiefs of Staff, the highest-ranking military officer and probably more importantly, the person has the ear of the President of the United States on military matters, is the man pictured above.",
    "url": "https://redstate.com/beccalower/2024/11/24/rand-paul-woke-military-n2182435"
  },
  {
    "text": "Trump's national security pick: I'm on same page as Jake Sullivan about ‘our adversaries’  —  “We are hand in glove.  We are one team with the United States in this transition,” Rep. Mike Waltz said.  —  Rep. Michael Waltz (R-Fla.) said Sunday that he has met with President Joe Biden's … ",
    "url": "https://www.politico.com/news/2024/11/24/trump-national-security-adviser-waltz-sullivan-00191412"
  },
  {
    "text": "Pam Bondi's road from Four Seasons Total Landscaping to AG pick should alarm America  —  The long, strange trip of the United States of America has taken a wild and dangerous right turn, and you can see the exact moment that Pam Bondi — Donald Trump's newest pick to become … ",
    "url": "https://www.inquirer.com/opinion/pam-bondi-ag-nomination-election-denial-20241124.html"
  },
  {
    "text": "CBS News poll finds Trump starts on positive note as most approve of transition handling  —  President-elect Donald Trump's incoming administration starts off with mostly good will from the public: a majority of Americans overall are either happy or at least satisfied that he won … ",
    "url": "https://www.cbsnews.com/news/cbs-news-poll-trump-transition-cabinet-picks-2024-11-24/"
  },
  {
    "text": "Business donors overwhelmingly bet on the GOP.  Here's where it paid off.  —  The 2024 general election saw a flood of contributions from the crypto industry, banking and labor.  And then there was Elon Musk.  —  Thousands of industry donors poured over $425 million into the general election this year … ",
    "url": "https://www.politico.com/news/2024/11/24/business-election-donations-republicans-00191072"
  },
  {
    "text": "Right-wing activist arrested at anti-Israel rally in Toronto after refusing to cross road: 'It's because I'm a Jew'  —  Canadian right-wing political pundit Ezra Levant has been arrested at a pro-Hamas rally in Toronto, after he refused police instructions to move away from the demonstration … ",
    "url": "https://www.timesofisrael.com/liveblog_entry/far-right-activist-arrested-at-anti-israel-rally-in-toronto-after-refusing-to-cross-road-its-because-im-a-jew/"
  },
  {
    "text": "Rural counties in California, Illinois push to secede from blue states to separate from liberal-run cities after Trump's win: ‘So flipping excited’  —  They've had enough.  —  A movement in a myriad of rural counties across deep blue states such as Illinois and California to split off … ",
    "url": "https://nypost.com/2024/11/24/us-news/rural-counties-in-california-and-illinois-push-to-secede-from-blue-states-to-separate-from-liberal-run-cities/"
  },
  {
    "text": "Feeling betrayed by increased minority support for Trump, Black women say they're stepping back  —  As she checked into a recent flight to Mexico for vacation, Teja Smith chuckled at the idea of joining another Women's March on Washington.  As a Black woman, she just couldn't see herself helping … ",
    "url": "https://apnews.com/article/trump-black-women-democrats-harris-base-votecast-0c646e888c999b03d1798e1aa1331937"
  }
]