[
  {
    "text": "Trump floats ‘cutting’ retirement spending, drawing quick pushback from Biden  —  The Republican nominee-in-waiting said that “there's a lot you can do in terms of cutting” when pressed on CNBC about the solvency of Social Security, Medicare and Medicaid.  —  Presumptive Republican nominee … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-floats-cutting-retirement-spending-drawing-quick-pushback-biden-rcna142776"
  },
  {
    "text": "Trump's $91.6 million question  —  New York juries have found, by a preponderance of the evidence, that former President Donald Trump sexually assaulted writer E. Jean Carroll in a Bergdorf Goodman dressing room in the mid-90s and then repeatedly defamed her, falsely accusing Carroll of lying about the incident.",
    "url": "https://popular.info/p/trumps-916-million-question"
  },
  {
    "text": "Adding to an ugly record, Trump mocks Biden's stutter (again)  —  Donald Trump's fractured relationship with human decency is especially evident when it comes to those with disabilities.  —  A couple of months ago, while on the campaign trail in Iowa, Donald Trump had plenty … ",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/adding-ugly-record-trump-mocks-bidens-stutter-rcna142802"
  },
  {
    "text": "The media is still selling a fantasy version of Trump  —  This free edition of PN is made possible by paid subscribers.  If you aren't one already, hit the button and sign up to support our independent journalism.  —  ⌨️ Subscribe to Public Notice ⌨️",
    "url": "https://www.publicnotice.co/p/axios-new-york-times-nbc-trump-fantasy-version"
  },
  {
    "text": "Trump Stumbles Through Word Salad On Banning Or Not Banning TikTok In CNBC Hit  —  Former President Donald Trump stumbled and rambled his way through a meandering answer when CNBC host Andrew Ross Sorkin asked him about banning TikTok.  —  Trump recently came out against banning TikTok … ",
    "url": "https://www.mediaite.com/news/trump-stumbles-through-word-salad-on-banning-or-not-banning-tiktok-in-cnbc-hit/"
  },
  {
    "text": "Florida teachers can discuss sexual orientation and gender ID under 'Don't Say Gay' bill settlement  —  Students and teachers will be able to speak freely about sexual orientation and gender identity in Florida classrooms, provided it's not part of instruction, under a settlement reached … ",
    "url": "https://apnews.com/article/florida-dont-say-gay-bill-settlement-987904b3e19122d719cf468034746b6e"
  },
  {
    "text": "Florida 'Don't Say Gay' law upheld after settlement in federal court  —  The state of Florida settled a multi-year suit Monday against the so-called “Don't Say Gay” law, which limits how LGBTQ topics can be discussed and presented in schools.  —  The settlement agreement clarifies language … ",
    "url": "https://thehill.com/homenews/state-watch/4524572-florida-dont-say-gay-law-desantis/"
  },
  {
    "text": "Former advisers sound the alarm that Trump praises despots in private and on the campaign trail  —  To Donald Trump, Hungarian strongman Viktor Orbán is “fantastic,” Chinese leader Xi Jinping is “brilliant,” North Korea's Kim Jong Un is “an OK guy,” and, most alarmingly … ",
    "url": "https://www.cnn.com/2024/03/11/politics/trump-despots-advisers-sound-alarm/"
  },
  {
    "text": "Exclusive: ‘Trump Employee 5,’ who unknowingly helped move classified documents, speaks out  —  Watch the full interview with Kaitlan Collins at 9 p.m. ET Monday on “The Source.”  —  CNN  —  A longtime Mar-a-Lago employee who is a central witness in the investigation … ",
    "url": "https://www.cnn.com/2024/03/11/politics/trump-employee-5-classified-documents-mar-a-lago/"
  },
  {
    "text": "The MAGA Aesthetic Is Beginning to Rot  —  The stable of imagery associated with the far-right insurgency no longer seems as fresh as it did when Trump first donned his red cap.  —  Pocket  —  For headline writers and Beltway pundits, the takeaway from last week's State of the Union address was clear … ",
    "url": "https://www.thenation.com/article/politics/maga-aesthetic-trump-style/"
  },
  {
    "text": "Biden effigy beaten, kicked at Kansas county GOP event, drawing outrage  —  A Republican fundraiser in the Kansas City suburbs on Friday night at which attendees beat and kicked an effigy of President Biden has sparked bipartisan outrage and calls for the GOP leaders responsible for the event to resign.",
    "url": "https://www.washingtonpost.com/nation/2024/03/11/biden-effigy-kansas-republican-event/"
  },
  {
    "text": "Some journalists seem bored by the biggest story of our lifetimes  —  At the New York Times, the journalists count on politics for amusement.  It's a sporting event, a cage match.  Republicans vs. Democrats, Sharks vs. Jets, gladiators vs. lions.  —  The folks at the Times have settled … ",
    "url": "https://www.stopthepresses.news/p/some-journalists-seem-bored-by-the"
  },
  {
    "text": "House Republicans release report seeking to undermine Jan. 6 Committee and star witness  —  The report takes aim at key Jan. 6 witness Cassidy Hutchinson, citing unnamed Trump White House staffers who did not corroborate her testimony.  —  WASHINGTON — A House committee investigating … ",
    "url": "https://www.nbcnews.com/politics/congress/house-republicans-report-jan-6-committee-cassidy-hutchinson-trump-rcna142762"
  },
  {
    "text": "Trump seeks to derail New York hush money trial over immunity claims  —  Former President Trump is seeking to derail the start of his first criminal trial just two weeks out from when it is scheduled to begin, asserting a presidential immunity defense in the case for the first time.",
    "url": "https://thehill.com/regulation/court-battles/4524017-trump-new-york-hush-money-trial-immunity/"
  },
  {
    "text": "Automakers Are Sharing Consumers' Driving Behavior With Insurance Companies  —  LexisNexis, which generates consumer risk profiles for the insurers, knew about every trip G.M. drivers had taken in their cars, including when they sped, braked too hard or accelerated rapidly.",
    "url": "https://www.nytimes.com/2024/03/11/technology/carmakers-driver-tracking-insurance.html"
  },
  {
    "text": "How a tenacious reporter revealed Sen. Katie Britt's SOTU response to be ‘beyond misleading’  —  Britt tied an anecdote about a woman who survived sex trafficking to Biden's border policies.  But it happened during the George W. Bush admin.  —  Last Thursday was President Joe Biden's big State of the Union address.",
    "url": "https://www.poynter.org/commentary/2024/katie-britt-scarlett-johansson-teacup-snl/"
  },
  {
    "text": "Sex trafficking victim says Sen. Katie Britt telling her story during SOTU rebuttal is ‘not fair’  —  The woman whose story Alabama Sen. Katie Britt appeared to have shared in the Republican response to the State of the Union as an example of President Joe Biden's failed immigration policies told CNN … ",
    "url": "https://www.cnn.com/2024/03/10/politics/katie-britt-sex-trafficking-victim-interview"
  },
  {
    "text": "HUD Secretary Marcia Fudge to resign, says affordable housing is ‘an American issue’  —  WASHINGTON ‒ Housing and Urban Development Secretary Marcia Fudge will step down from her top post in the Biden administration this month, she announced Monday, saying that after decades of public service, she's retiring and returning to Ohio.",
    "url": "https://www.usatoday.com/story/news/politics/2024/03/11/hud-secretary-marcia-fudge-steps-down/72886441007/"
  }
]