[
  {
    "text": "Playbook: Ronna strikes back  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  ROLL TIDE — More evidence came in overnight that reproductive rights remains a potent issue for Democrats, at least in low-turnout contests: The party flipped an Alabama state House seat … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/03/27/ronna-strikes-back-00149270"
  },
  {
    "text": "Democrat wins Alabama special election in early test for IVF as a campaign issue  —  Marilyn Lands, who defeated Republican Teddy Powell, highlighted IVF and abortion rights in her campaign for a state House seat that had been held by the GOP.  —  Democratic candidate Marilyn Lands … ",
    "url": "https://www.nbcnews.com/politics/elections/democrat-marilyn-lands-wins-alabama-special-election-ivf-abortion-righ-rcna145210"
  },
  {
    "text": "Democrat wins Alabama special election after focusing on IVF, abortion  —  Democratic candidate Marilyn Lands is projected to win the special election in Alabama state House District 10, according to Decision Desk HQ.  —  Lands, a licensed professional counselor, beat Republican Teddy Powell … ",
    "url": "https://thehill.com/homenews/campaign/4557670-democrat-wins-alabama-special-election-after-focusing-on-ivf-abortion/"
  },
  {
    "text": "Democrat who made reproductive rights a campaign focus will win Alabama special election, CNN projects  —  Marilyn Lands, a Democrat who made reproductive rights a central part of her campaign, will win a special election Tuesday for an Alabama state House seat, CNN projects.",
    "url": "https://www.cnn.com/2024/03/26/politics/alabama-special-election-democrat-reproductive-rights"
  },
  {
    "text": "Abortion proves winning strategy for Alabama Democrat  —  Marilyn Lands won a state House special election in a rare battleground race  —  An Alabama Democrat who campaigned aggressively on abortion access won a special election in the state Legislature on Tuesday, sending a message … ",
    "url": "https://www.politico.com/news/2024/03/26/abortion-winning-strategy-alabama-democrat-00149205"
  },
  {
    "text": "The Biden Campaign Is Quietly Preparing a Trump Ambush  —  LOW MALARKEY  —  The ingredients for a Biden comeback are falling into place at a moment in the 2024 campaign when Trump is mired in legal and financial problems.  —  Just a few months ago, it was hard to see the ingredients … ",
    "url": "https://www.thedailybeast.com/the-biden-campaign-is-quietly-preparing-a-trump-ambush"
  },
  {
    "text": "Was the 2020 election stolen?  Job interviews at RNC take an unusual turn.  —  Prospective hires say agreeing with Trump's false election claim appears to be a new litmus test for being hired by the party  —  Those seeking employment at the Republican National Committee after a Trump-backed purge … ",
    "url": "https://www.washingtonpost.com/nation/2024/03/26/rnc-2020-election-stolen-trump-hiring/"
  },
  {
    "text": "Geraldo Rivera Saves Nastiest Barb For Rachel Maddow In Blasting NBC's McDaniel Firing  —  The longtime TV journalist said the network sabotaged a “great idea.”  —  LOADING  —  NewsNation correspondent Geraldo Rivera blasted NBC's “cabal of aging” hosts for instigating the network's firing … ",
    "url": "https://www.huffpost.com/entry/geraldo-rivera-rachel-maddowmalignant-wokeism_n_6603e4cee4b06c56a1b69cef"
  },
  {
    "text": "In MAGA world, there are no accidents  —  The Baltimore bridge disaster reminded us that these folks should be nowhere near power. … Donald Trump has been talking disconcertingly often on the campaign trail about a looming terror attack.  All indications are that Tuesday's bridge collapse … ",
    "url": "https://www.publicnotice.co/p/baltimore-bridge-collapse-maga-unhinged-response"
  },
  {
    "text": "Even the US supreme court was baffled by conservatives' attack on abortion pills  —  The anti-choice case relies on outlandish legal leaps.  And if they can't win there, they'll redouble efforts to win the White House  —  It is a testament to how weak the plaintiffs' case is that the justices seemed so skeptical.",
    "url": "https://www.theguardian.com/commentisfree/2024/mar/27/us-supreme-court-anti-choice-abortion-pills-case"
  },
  {
    "text": "Trump is selling ‘God Bless the USA’ Bibles for $59.99 as he faces mounting legal bills  —  Former President Donald Trump is now selling Bibles as he runs to return to the White House.  Trump, who became the presumptive Republican nominee earlier this month, released a video on his Truth Social platform … ",
    "url": "https://apnews.com/article/trump-god-bless-usa-bible-greenwood-2713fda3efdfa297d0f024efb1ca3003"
  },
  {
    "text": "Settlement reached in lawsuit between Disney and Florida Gov. Ron DeSantis' allies  —  Allies of Gov. Ron DeSantis and Disney reached a settlement agreement Wednesday in a state court fight over how Walt Disney World is developed in the future following the takeover of the theme park resort's government by the Florida governor.",
    "url": "https://apnews.com/article/disney-florida-ron-desantis-settlement-91040178ad4708939e621dd57bc5e494"
  },
  {
    "text": "People say they're leaving religion due to anti-LGBTQ teachings and sexual abuse  —  People in the U.S. are leaving and switching faith traditions in large numbers.  The idea of “religious churning” is very common in America, according to a new survey from the Public Religion Research Institute (PRRI).",
    "url": "https://www.npr.org/2024/03/27/1240811895/leaving-religion-anti-lgbtq-sexual-abuse"
  },
  {
    "text": "Another top House Democrat announces plans to retire … But, more than anything, it has been an honor,\" Kuster said in a statement to WMUR.  — “I will continue serving the people of New Hampshire until the end of my term in January 2025. … - She has routinely faced competitive reelection battles … ",
    "url": "https://www.axios.com/2024/03/27/annie-kuster-retire-house-democrat"
  },
  {
    "text": "Facebook snooped on users' Snapchat traffic in secret project, documents reveal  —  In 2016, Facebook launched a secret project designed to intercept and decrypt the network traffic between people using Snapchat's app and its servers.  The goal was to understand users' behavior … ",
    "url": "https://techcrunch.com/2024/03/26/facebook-secret-project-snooped-snapchat-user-traffic/"
  },
  {
    "text": "Will RFK Jr. and Other Third-Party Candidates Help Doom Democracy?  —  In the summer of 2000, Robert F. Kennedy Jr., a scion of the Democratic Party dynasty, took time out of his schedule as an environmental attorney to write an op-ed for the New York Times.",
    "url": "https://www.motherjones.com/politics/2024/03/will-rfk-jr-and-other-third-party-candidates-help-doom-democracy/"
  },
  {
    "text": "Trump ally Clark attempted ‘coup’ at US Justice Dept, ethics counsel says  —  Jeffrey Clark, a former senior official in the U.S. Justice Department, made false claims as he attempted to enlist the agency in former President Donald Trump's efforts to undo his 2020 election loss, a Washington ethics lawyer said on Tuesday.",
    "url": "https://www.reuters.com/world/us/trump-justice-official-clark-faces-ethics-hearing-over-2020-election-role-2024-03-26/"
  }
]