[
  {
    "text": "Biden's reset moment … Officials close to him, needing a repeat triumph, will spend hours on everything from the text to his physical preparation to exploit the prime-time moment.  — “Everyone around him is well aware — well aware — of the need to jack this campaign up,” a source close to Biden said.",
    "url": "https://www.axios.com/2024/02/19/biden-trump-age-state-union-election"
  },
  {
    "text": "It's time for the White House to put up or shut up  —  If you'd asked me a year ago, I would have told you that Joe Biden was a reasonably clear favorite in the event of a rematch against Donald Trump.  —  Not an overwhelming favorite, mind you.  But perhaps a 65:35 favorite.",
    "url": "https://www.natesilver.net/p/its-time-for-the-white-house-to-put"
  },
  {
    "text": "NYT publisher: White House ‘extremely upset’ on Biden age coverage  —  “We are going to continue to report fully and fairly,” A.G. Sulzberger said.  —  The New York Times Publisher A.G. Sulzberger said Monday that the White House is “extremely upset” about its coverage on President Joe Biden's age … ",
    "url": "https://www.politico.com/news/2024/02/19/nyt-white-house-upset-biden-age-coverage-00142098"
  },
  {
    "text": "New York Times publisher A. G. Sulzberger: “Our industry needs to think bigger”  —  In this exclusive interview, he discusses his role in shaping the paper and preserving its values  —  In early January 1996 journalist Kevin McKenna presented the New York Times' first website to three generations … ",
    "url": "https://reutersinstitute.politics.ox.ac.uk/news/new-york-times-publisher-g-sulzberger-our-industry-needs-think-bigger"
  },
  {
    "text": "Measles erupts in Florida school where 11% of kids are unvaccinated  —  Over 100 children at the school are susceptible to virus.  —  Florida health officials on Sunday announced an investigation into a cluster of measles cases at an elementary school in the Fort Lauderdale area with a low vaccination rate … ",
    "url": "https://arstechnica.com/science/2024/02/measles-erupts-in-florida-school-where-11-of-kids-are-unvaccinated/"
  },
  {
    "text": "Read: Historians rank Trump as worst president … - Lincoln.  — F.D. Roosevelt.  — Washington.  — T. Roosevelt.  — Jefferson.  — Truman.  — Obama.  — Eisenhower.  — L.B. Johnson.  — Kennedy.",
    "url": "https://www.axios.com/2024/02/19/presidents-survey-trump-ranks-last-biden-14th"
  },
  {
    "text": "Wisconsin governor signs new state legislative maps into law, ending a GOP gerrymander  —  The new lines will all but certainly loosen Republicans' grip on power in the swing state's government after more than a decade of dominance.  —  Wisconsin Democratic Gov. Tony Evers on Monday signed … ",
    "url": "https://www.nbcnews.com/politics/elections/wisconsin-new-state-legislative-maps-rcna139477"
  },
  {
    "text": "Democrats weaponized justice system to punish Trump in business case  —  Oscar Wilde wrote “moderation is a fatal thing.  Nothing succeeds like excess.”  Judge Arthur Engoron took that line to heart with his absurd imposition of $455 million in fines and interest against Donald Trump and his corporation.",
    "url": "https://nypost.com/2024/02/19/opinion/democrats-weaponized-justice-system-to-punish-trump-in-business-case/"
  },
  {
    "text": "Pelosi: Trump comments on Navalny's death ‘beneath the dignity of a human being’  —  Former Speaker Nancy Pelosi (D-Calif.) went after former President Trump on Monday for his response to the death of Russian opposition leader Alexei Navalny, calling Trump's comments “'beneath the dignity of a human being.”",
    "url": "https://thehill.com/homenews/campaign/4477550-pelosi-trump-comments-on-navalnys-death-beneath-the-dignity-of-a-human-being/"
  },
  {
    "text": "John Oliver Offers Supreme Court Justice Clarence Thomas $1 Million a Year to Resign  —  John Oliver made Justice Clarence Thomas an offer too good to refuse, but he has 30 days to take a cool million a year — plus a sweet bus — or it goes away.  —  Oliver made the stunning offer at the end … ",
    "url": "https://www.mediaite.com/tv/john-oliver-offers-supreme-court-justice-clarence-thomas-1-million-a-year-to-resign/"
  },
  {
    "text": "Trump musical about ex-wives, Stormy Daniels debuts in New York  —  A parody musical centered on former President Trump and some of the well-known women in his life is hitting the off-Broadway stage in New York City this month.  —  The musical, titled “Five: The Parody Musical,” … ",
    "url": "https://thehill.com/blogs/in-the-know/4477302-trump-musical-five-ex-wives-stormy-daniels-ivanka-melania-debuts-new-york/"
  },
  {
    "text": "Documents reveal Abraham Lincoln pardoned Biden's great-great-grandfather  —  Every new president selects personalized Oval Office decor to suit his tastes and pay homage to admired predecessors.  President Biden's Oval Office boasts both a portrait and a bust of Abraham Lincoln.",
    "url": "https://www.washingtonpost.com/history/2024/02/19/abraham-lincoln-joe-biden-pardon-presidents-day/"
  },
  {
    "text": "‘What a Coward’: Fox Contributor Blasts J.D. Vance For Refusing to ‘Look Zelensky in the Eye’ While Opposing Aid  —  Sen. J.D. Vance (R-OH) received a bevy criticism over the weekend for skipping out on a meeting with Ukrainian President Volodymyr Zelensky at the Munich Security Conference … ",
    "url": "https://www.mediaite.com/politics/what-a-coward-fox-contributor-blasts-j-d-vance-for-refusing-to-look-zelensky-in-the-eye-while-opposing-aid/"
  },
  {
    "text": "Bipartisan House members unveil new border, foreign aid proposal  —  It's not yet clear if House GOP leadership would consider the proposal.  —  Representative Brian Fitzpatrick, a Republican from Pennsylvania, pauses while speaking during the American Federation of Government Employees … ",
    "url": "https://abcnews.go.com/Politics/bipartisan-house-members-unveil-new-border-foreign-aid/story?id=107348740"
  },
  {
    "text": "Heat pumps outsold gas furnaces again last year — and the gap is growing  —  While sales of both heat pumps and gas furnaces were down in 2023, heat pumps are proving more popular than ever.  —  Heat pumps outsold gas furnaces.  Again. … That's the biggest lead heat pumps have opened … ",
    "url": "https://grist.org/energy/heat-pumps-outsold-gas-furnaces-again-last-year-and-the-gap-is-growing/"
  },
  {
    "text": "Nancy Mace Fires Back at ‘Loser’ Kevin McCarthy for Saying She Needs to ‘Straighten Out Her Life’  —  After McCarthy snarked that he hopes Mace “gets the help she needs,” the congresswoman lashed out at the ex-speaker and begged for campaign cash.  —  Rep. Nancy Mace (R-SC) … ",
    "url": "https://www.thedailybeast.com/nancy-mace-fires-back-at-loser-kevin-mccarthy-for-saying-she-needs-to-straighten-out-her-life"
  },
  {
    "text": "Republican Attacks on Biden's Climate Law Raise Concerns Ahead of Election  —  Executives of companies with clean energy projects are facing questions about the potential for a rollback of the law and its incentives if a Republican wins.  —  The United States has experienced a surge … ",
    "url": "https://www.nytimes.com/2024/02/19/us/politics/inflation-reduction-act-republican-attacks.html"
  }
]