[
  {
    "text": "CNN Poll: Biden faces negative job ratings and concerns about his age as he gears up for 2024  —  President Joe Biden faces continued headwinds from broadly negative job ratings overall, widespread concerns about his age and decreased confidence among Democratic-aligned voters, according to a new CNN Poll conducted by SSRS.",
    "url": "https://www.cnn.com/2023/09/07/politics/cnn-poll-joe-biden-headwinds/"
  },
  {
    "text": "The Best Anti-Trump Argument Can't Be Used  —  GOP primary voters don't want to hear it.  —  Donald Trump is winning the Republican nomination race in a walk, and it's been quite the pleasant stroll.  —  That's because his opponents can't make the most compelling argument against Trump … ",
    "url": "https://www.politico.com/news/magazine/2023/09/07/gop-trump-truth-00114366"
  },
  {
    "text": "CNN Poll: A majority of Americans believe Joe Biden, as VP, was involved with son's business dealings  —  Most Americans say they think President Joe Biden was involved in his son's business dealings with Ukraine and China while he served as vice president under Barack Obama, according to a CNN poll conducted by SSRS.",
    "url": "https://www.cnn.com/2023/09/07/politics/poll-hunter-biden/"
  },
  {
    "text": "Harris launching college tour to try to mobilize young voters in battleground states  —  The vice president is the face for the administration's work on abortion, more.  —  Vice President Kamala Harris will soon be hitting the road for a monthlong college tour, traveling to more than a dozen campuses across eight states.",
    "url": "https://abcnews.go.com/Politics/harris-launching-college-tour-mobilize-young-voters-battleground/story?id=102867458"
  },
  {
    "text": "Trump escalates false attacks on Biden as some Republicans push toward impeachment  —  In campaign speeches, the former president repeatedly exaggerates and misrepresents claims about Hunter Biden's foreign business dealings.  —  “Manchurian candidate.”  “Stone-cold thief.”  “Dumb son of a b—",
    "url": "https://www.washingtonpost.com/elections/2023/09/07/trump-biden-false-attacks-2024-presidential-race/"
  },
  {
    "text": "America's Authoritarian Exceptionalism  —  Demagogues usually arise in times of chaos and privation.  In America, our demagogues have become powerful during a period of peace and prosperity.  —  ∙ Paid  —  1. Decadence  —  We're going to keep doing this and I'm sorry.",
    "url": "https://thetriad.thebulwark.com/p/americas-authoritarian-exceptionalism"
  },
  {
    "text": "John Eastman declines to elaborate on Trump world discussions about Grassley presiding on Jan. 6  —  He asserted attorney-client privilege when asked to discuss evidence that Trump's allies considered the Iowa senator playing a role to keep Trump in power.  —  John Eastman, testifying … ",
    "url": "https://www.politico.com/news/2023/09/07/john-eastman-disbarment-chuck-grassley-00114416"
  },
  {
    "text": "CNN Exclusive: ‘How am I in this war?’:  New Musk biography offers fresh details about the billionaire's Ukraine dilemma  —  Elon Musk secretly ordered his engineers to turn off his company's Starlink satellite communications network near the Crimean coast last year to disrupt a Ukrainian sneak attack … ",
    "url": "https://www.cnn.com/2023/09/07/politics/elon-musk-biography-walter-isaacson-ukraine-starlink/"
  },
  {
    "text": "Republicans Narrow in on Bribery Charge for Biden Impeachment Probe (Exclusive)  —  ‘There was money flowing to the son of the vice president turned president,’ Rep. Chip Roy, R-Texas, tells The Messenger on why he wants to impeach Biden  —  A Facebook icon representing an external link … ",
    "url": "https://themessenger.com/politics/republicans-narrow-in-on-bribery-charge-for-biden-impeachment-probe"
  },
  {
    "text": "Pennsylvania school district requires social studies classes to incorporate right-wing propaganda  —  Last Monday, the Pennridge School Board, located outside of Philadelphia, imposed a new social studies curriculum that will require teachers to incorporate lessons from the 1776 Curriculum … ",
    "url": "https://popular.info/p/pennsylvania-school-district-requires"
  },
  {
    "text": "Tommy Tuberville's Hissy Fit Shows McConnell Has Lost His Hold on the GOP  —  The ex-football coach-turned-junior senator is holding up vital military promotions and brazenly thumbing his nose at the longest serving Republican Senate leader. … It should be a national embarrassment … ",
    "url": "https://www.thedailybeast.com/tommy-tubervilles-hissy-fit-shows-mitch-mcconnell-lost-his-hold-on-the-gop"
  },
  {
    "text": "Michigan fake elector described planning with Trump campaign attorneys: ‘Mike Pence and Congress [to] make that decision’  —  One of the fake electors put forward by Republicans in Michigan said in December 2020 that the plan to use a slate of fake electors to help Donald Trump win … ",
    "url": "https://www.cnn.com/2023/09/07/politics/kfile-meshawn-maddock-fake-elector-planning-trump-attorneys/"
  },
  {
    "text": "Abortions Rose in Most States This Year, New Data Shows  —  Legal abortions most likely increased in the United States in the first six months of the year compared with 2020, an analysis of new estimates shows, as states with more permissive abortion laws absorbed patients traveling … ",
    "url": "https://www.nytimes.com/interactive/2023/09/07/us/abortion-data-bans-laws.html"
  },
  {
    "text": "Trump Plans $1M ‘Family Style’ Mar-a-Lago Dinner to Raise Money for His Co-Defendants (Exclusive)  —  The exact date of the candlelight event is still being ironed out, but Trump's sons will attend  —  A Facebook icon representing an external link to share the article on Facebook … ",
    "url": "https://themessenger.com/politics/trump-plans-family-style-mar-a-lago-dinner-to-raise-money-for-his-co-defendants"
  },
  {
    "text": "The Giuliani aide who ‘vanished’  —  Documents reviewed by POLITICO — and also in the hands of federal prosecutors — offer new details about Rudy Giuliani's ill-fated efforts to reverse the 2020 election.  —  In December 2020, an adviser to Rudy Giuliani circulated a draft email addressed … ",
    "url": "https://www.politico.com/news/2023/09/06/giuliani-aide-vanished-trump-election-00114307"
  },
  {
    "text": "Behind the scenes: See how private ammo sales from US are fueling the war in Ukraine  —  The bullets came in plywood crates.  —  Any given box was about the size of a small microwave oven.  The printed label stuck to each one demonstrated a militaristic brevity.",
    "url": "https://www.usatoday.com/story/news/investigations/2023/09/07/war-in-ukraine-private-ammunition-sales/70708811007/"
  },
  {
    "text": "UK PM Sunak faces new vote to fill seat after lawmaker accused of groping resigns  —  British Prime Minister Rishi Sunak faces another difficult vote to fill a vacant seat in parliament after a lawmaker who was given an eight-week suspension for groping two men at a London club last year announced he plans to resign.",
    "url": "https://www.reuters.com/world/uk/uk-lawmaker-pincher-who-was-facing-8-week-suspension-resigns-sky-news-2023-09-07/"
  },
  {
    "text": "Democrats Consider the Unthinkable: Missing Mitch McConnell  —  Mitch McConnell has bedeviled Democrats for decades.  Now, with his future in doubt, the Senate GOP Leader isn't looking like the worst-case scenario for his counterparts. … For decades, Democrats have hated, cursed … ",
    "url": "https://www.thedailybeast.com/democrats-consider-the-unthinkable-missing-mitch-mcconnell"
  },
  {
    "text": "Newly obtained George Santos “vulnerability report” spotted red flags long before embattled Rep. was elected  —  When an outside firm hired by then-congressional hopeful George Santos in 2021 delivered a secret internal report detailing aspects of the candidate's checkered background, several of his aides found it too much to stomach.",
    "url": "https://www.cbsnews.com/news/george-santos-vulnerability-report-red-flags-long-before-embattled-rep-was-elected/"
  },
  {
    "text": "13 Presidential Libraries Issue Rare Joint Warning About U.S. Democracy  —  Their statement stopped short of slamming individuals as it called for a recommitment to the country's bedrock principles.  —  LOADING  —  Concern for U.S. democracy amid deep national polarization has prompted … ",
    "url": "https://www.huffpost.com/entry/presidential-centers-warning_n_64f9bb3de4b04a65c3cc1bfa"
  },
  {
    "text": "Prosecutors will seek Hunter Biden indictment by end of September  —  Special counsel David Weiss will seek to indict Hunter Biden before the end of this month, the prosecutor said in a court filing updating a judge on his investigation into the president's son's failure to pay taxes.",
    "url": "https://thehill.com/regulation/court-battles/4190614-prosecutors-will-seek-hunter-biden-indictment-by-end-of-september/"
  },
  {
    "text": "Texas AG Ken Paxton's Affair Explains Illegal Acts, Former Aide Testifies  —  An impeachment trial for the suspended Republican began in the state Senate Tuesday.  —  LOADING  —  An extramarital affair Texas Attorney General Ken Paxton had with a donor's employee helped connect the dots … ",
    "url": "https://www.huffpost.com/entry/ken-paxton-impeachment-trial-texas-affair_n_64f8eb9ce4b08f6e30ea12a5"
  },
  {
    "text": "Judge Orders Texas to Move Barrier From Middle of the Rio Grande  —  A federal judge ordered the state to move the barrier, placed to discourage illegal crossings from Mexico, to the banks of the river.  —  A federal judge ordered Gov. Greg Abbott on Wednesday to move a barrier of floating buoys … ",
    "url": "https://www.nytimes.com/2023/09/06/us/texas-border-rio-grande-lawsuit.html"
  }
]