[
  {
    "text": "Suspected shooter spotted at EWU before gunfire erupted at store on Kings Road, sources say  —  Shooter's parents contacted Clay County Sheriff's Office after finding manifesto: sources  —  Kendra Mazeke, Digital Content Producer  —  JACKSONVILLE, Fla. - The man suspected of killing numerous people … ",
    "url": "https://www.news4jax.com/news/local/2023/08/26/developing-heavy-police-presence-reported-on-kings-road/"
  },
  {
    "text": "3 people dead after gunman targeted Black people in Jacksonville, Florida, officials say  —  Three people were killed Saturday in a racially motivated attack after a gunman targeted Black people at a Dollar General store in Jacksonville, Florida, in one of several weekend shootings … ",
    "url": "https://www.cnn.com/2023/08/26/us/jacksonville-florida-shooting-multiple-fatalities/"
  },
  {
    "text": "3 dead as Marine helicopter crashes in Australia during training, officials say  —  The V-22 Osprey crashed carrying 23 service members, U.S. officials said.  —  At least three U.S. military personnel were killed on Sunday when a Marine helicopter crashed during a training exercise off … ",
    "url": "https://abcnews.go.com/International/3-dead-marine-helicopter-crash-australia-training-exercises/story?id=102596827"
  },
  {
    "text": "FDA pet food investigation: What to know about diet-related heart disease  —  At least 1,382 cases of heart damage, possibly diet related, have been reported in dogs, although veterinary researchers believe the problem could be more widespread than the numbers suggest.",
    "url": "https://www.nbcnews.com/health/health-news/fda-pet-food-dogs-diet-heart-disease-rcna101224"
  },
  {
    "text": "The next big abortion battleground: Pennsylvania  —  Once-sleepy state Supreme Court races hit a new nerve in a post-Roe world.  —  PHILADELPHIA — Less than a month after their double-digit victory on abortion rights in Ohio, Democrats are preparing to pour millions of dollars into the next big battlefront over the hot-button policy.",
    "url": "https://www.politico.com/news/2023/08/27/pennsylvania-supreme-court-abortion-00113074"
  },
  {
    "text": "Why most of Trump's Republican rivals won't attack him  —  Polls show Donald Trump leading Florida Gov. Ron DeSantis, his nearest rival for the 2024 Republican presidential nomination, by about 40 points.  You might think this would cause the former president's GOP rivals to attack … ",
    "url": "https://www.cnn.com/2023/08/27/politics/republican-primary-president-trump-rivals/"
  },
  {
    "text": "5,000 pilots suspected of hiding major health issues.  Most are still flying.  —  Federal authorities have been investigating nearly 5,000 pilots suspected of falsifying their medical records to conceal that they were receiving benefits for mental health disorders and other serious conditions … ",
    "url": "https://www.washingtonpost.com/politics/2023/08/27/faa-pilots-health-conditions-va-benefits/"
  },
  {
    "text": "Hochul and Adams face off over foie gras  —  The debate pits upstate interests versus downstate ones.  —  SULLIVAN COUNTY, N.Y. — With the New York state government's ongoing legal attempts to block New York City from banning foie gras, critics say Gov. Kathy Hochul is treating Mayor Eric Adams like chopped liver.",
    "url": "https://www.politico.com/news/2023/08/27/nyc-foie-gras-ban-00113106"
  },
  {
    "text": "State of the Union  —  DANA BASH, CNN HOST (voice-over): Fight night.  No Donald Trump, but plenty of fireworks at the first Republican debate.  —  VIVEK RAMASWAMY (R), PRESIDENTIAL CANDIDATE: I'm the only person the stage who isn't bought and paid for.  —  MIKE PENCE (R), PRESIDENTIAL CANDIDATE … ",
    "url": "https://transcripts.cnn.com/show/sotu/date/2023-08-27/segment/01"
  },
  {
    "text": "Pressley punches back at Ramaswamy over KKK jibe: ‘A line was crossed’  —  The GOP presidential candidate called the congresswoman part of “the modern KKK” in a campaign event Friday.  —  Rep. Ayanna Pressley (D-Mass.) on Saturday hit back at Vivek Ramaswamy for labeling her part of … ",
    "url": "https://www.politico.com/news/2023/08/26/ayanna-pressley-vivek-ramaswamys-kkk-label-00113114"
  },
  {
    "text": "Biden advisers bristle at Newsom's plan to debate DeSantis  —  Vice President Kamala Harris' allies are particularly annoyed by the California governor's move into the spotlight ahead of a possible 2028 Democratic nomination fight.  —  WASHINGTON — California Gov. Gavin Newsom is increasingly … ",
    "url": "https://www.nbcnews.com/politics/joe-biden/biden-advisers-bristle-newsoms-plan-debate-desantis-rcna101799"
  },
  {
    "text": "Trump raised $7.1 million after Georgia booking, mugshot  —  The former president raised $4.18 million on Friday alone, the single-highest 24 hour period of his campaign to date.  —  Donald Trump has turned his Georgia mugshot into a record-breaking fundraising haul.",
    "url": "https://www.politico.com/news/2023/08/26/trump-mugshot-fundraising-00113118"
  },
  {
    "text": "CPAC urged to probe more sexual misconduct claims against chair Matt Schlapp  —  A senior board member of CPAC's parent organization resigned as he urged more scrutiny of Schlapp's alleged conduct  —  A senior board member of the parent organization behind the prominent Conservative Political … ",
    "url": "https://www.washingtonpost.com/nation/2023/08/26/matt-schlapp-cpac-sexual-misconduct-allegations/"
  },
  {
    "text": "Trump's mug shot will backfire in 2024  —  Trump thinks this is a political winner for him.  But as New Hampshire Gov. Chris Sununu told me this week, “independents hate it.”  —  Why the mug shot matters  —  This Georgia indictment is different for a whole host of reasons.",
    "url": "https://www.msnbc.com/inside-with-jen-psaki/trumps-mug-shot-will-backfire-2024-rcna101879"
  }
]