[
  {
    "text": "Russell Brand accused of rape, sexual assaults and abuse  —  Four women, including one who was just 16, make allegations after an investigation by The Sunday Times, The Times and Channel 4 Dispatches  —  The comedian and actor Russell Brand has been accused of rape, sexual assaults … ",
    "url": "https://www.thetimes.co.uk/article/russell-brand-rape-sexual-assault-abuse-allegations-investigation-v5hxdlmb6"
  },
  {
    "text": "Russell Brand accused of rape and sexual assault  —  Comedian and actor Russell Brand has been accused of rape, sexual assaults and emotional abuse during a seven-year period at the height of his fame.  —  The allegations were made in a joint investigation by the Sunday Times, the Times and Channel 4's Dispatches.",
    "url": "https://www.bbc.com/news/uk-66831593"
  },
  {
    "text": "Texas Attorney General Ken Paxton acquitted in impeachment trial  —  Paxton was impeached for allegedly taking bribes, but ultimately members of his party chose not to vote for his conviction and removal from office.  —  Impeached Texas Attorney General Ken Paxton was acquitted … ",
    "url": "https://www.nbcnews.com/politics/politics-news/texas-attorney-general-ken-paxton-acquitted-impeachment-trial-rcna104816"
  },
  {
    "text": "Texas AG Ken Paxton Survives Fiery Impeachment Trial  —  Ken Paxton was accused of using his job as the state's top prosecutor to dish out favors to a big-donor friend.  —  The embattled Texas Attorney General Ken Paxton avoided an impeachment conviction on Saturday with Texas' Republican … ",
    "url": "https://www.thedailybeast.com/ken-paxton-impeachment-verdict-texas-ag-acquitted-of-16-charges-will-remain-in-office"
  },
  {
    "text": "Trump Plans Two Mar-a-Lago Fundraisers for Campaign, Legal Fees  — Separate events said to include a dinner for $100,000 per seat  — Former president has been fundraising on his four indictments  —  Former President Donald Trump is planning separate fundraisers at Mar-a-Lago in October … ",
    "url": "https://www.bloomberg.com/news/articles/2023-09-16/trump-plans-two-mar-a-lago-fundraisers-for-campaign-legal-fees"
  },
  {
    "text": "Obama on UAW strike: Time to ‘do right’ by workers that keep companies ‘on their feet’  —  Former President Obama backed the United Auto Workers strike on Saturday, telling automakers that it's time to “do right” by workers.  —  “Fourteen years ago, when the big three automakers were struggling … ",
    "url": "https://thehill.com/business/4208144-obama-puts-supports-behind-uaw-strike/"
  },
  {
    "text": "California goes on offense against Big Oil  —  California is one of the country's top oil and gas producers, and Chevron, one of the defendants, is headquartered in the state.  —  Democratic California Gov. Gavin Newsom announced a lawsuit Saturday against five major oil companies and their subsidiaries … ",
    "url": "https://www.politico.com/news/2023/09/16/california-sues-oil-companies-00116398"
  },
  {
    "text": "'It was a very nice note: Trump says he left Biden a message when he departed the White House  —  Former President Trump talks about his views on a potential vice president, the note he left for President Biden and whether age should be an issue for voters.",
    "url": "https://www.nbcnews.com/meet-the-press/video/-it-was-a-very-nice-note-trump-says-he-left-biden-a-message-when-he-departed-the-white-house-193106501996"
  },
  {
    "text": "Trump lawyer Jenna Ellis turns on ‘malignant narcissist’ ex-president  —  Ellis, one of 18 Trump associates charged in Georgia election subversion case, says she 'simply can't support him' again  —  Jenna Ellis - the Donald Trump lawyer who like the former president faces criminal charges … ",
    "url": "https://www.theguardian.com/us-news/2023/sep/15/trump-lawyer-jenna-ellis"
  },
  {
    "text": "Man groped by Lauren Boebert during frisky ‘Beetlejuice’ date owns gay-friendly bar that hosts drag shows  —  A bar owned by Rep. Lauren Boebert's apparent new beau has staged at least one drag show, according to a review of social media posts.  —  In January, the Hooch Craft Cocktail Bar in Aspen … ",
    "url": "https://nypost.com/2023/09/16/lauren-boeberts-new-man-owns-gay-friendly-bar-which-hosts-drag-shows/"
  },
  {
    "text": "Boebert, caught on video, apologizes for inappropriate behavior at ‘Beetlejuice’ show  —  The congressmember had denied acting inappropriately until surveillance video surfaced showing her disrupting the performance.  —  Colorado Rep. Lauren Boebert apologized after she and a male companion … ",
    "url": "https://www.politico.com/news/2023/09/16/boebert-video-apologizes-beetlejuice-show-00116390"
  },
  {
    "text": "GOP senators ask Biden to provide Ukraine with missiles needed to win war  —  A group of Republican senators on Saturday sent a letter to President Biden urging him to “immediately” provide the missiles Ukraine needs to win its war against Russia.  —  Sen. Tom Cotton (R-Ark.) … ",
    "url": "https://thehill.com/homenews/senate/4208276-gop-senators-ask-biden-to-provide-ukraine-with-missiles-needed-to-win-war/"
  },
  {
    "text": "Iowa Democrats vote to approve Jan. 15 in-person caucus date — mail-in dates unresolved  —  The Iowa Democratic Party voted Saturday to hold the in-person portion of its 2024 presidential caucuses on Jan. 15 — the same day Iowa Republicans plan to caucus.  —  That will be when Democrats … ",
    "url": "https://www.desmoinesregister.com/story/news/elections/presidential/caucus/2023/09/16/iowa-democrats-approve-january-15-in-person-caucus-date-2024/70876412007/"
  },
  {
    "text": "Sore throat, then congestion: Common Covid symptoms follow a pattern now, doctors say  —  Doctors who treat Covid describe the ways the illness has gotten milder and shifted over time to mostly affect the upper respiratory tract.  —  How Covid symptoms have evolved since the pandemic",
    "url": "https://www.nbcnews.com/health/health-news/covid-symptoms-mild-follow-pattern-doctors-say-rcna105090"
  },
  {
    "text": "Erdogan to Attend UN General Assembly Amid Tensions With US  —  Turkish President Recep Tayyip Erdogan is traveling to New York to attend the UN General Assembly amid heightened tensions with Washington over Syria and Russia.  —  Erdogan is expected to arrive in New York on Sunday … ",
    "url": "https://www.bloomberg.com/news/articles/2023-09-16/erdogan-to-attend-un-general-assembly-amid-tensions-with-us"
  },
  {
    "text": "Military officers begin to speak out on the harm done by Sen. Tuberville's holds on promotions  —  In the months since a single senator froze military promotions over the Pentagon's abortion policy, the uniformed officers affected have been largely silent, wary of stepping into a political fray.",
    "url": "https://apnews.com/article/tuberville-holds-military-nominations-664c15d00d330b2b06b75ebeda8e3f01"
  }
]