[
  {
    "text": "From a Capitol Hill Basement, Bannon Stokes the Republican Party Meltdown  —  The former Trump adviser has helped create the spectacle of G.O.P. dysfunction, using it to build his own following and those of the right-wing House rebels who took down Kevin McCarthy.",
    "url": "https://www.nytimes.com/2023/10/04/us/politics/bannon-republicans-gaetz-mace.html"
  },
  {
    "text": "Imagine If Democrats Had Done It  —  The Republican party is sustained by two fundamental asymmetries.  And there's no cure for either of them.  —  ∙ Paid  —  We did an emergency live show last night about the McCarthy ouster.  You can find it here.  (There won't be a Thursday night show this week.)",
    "url": "https://thetriad.thebulwark.com/p/imagine-if-democrats-had-done-it"
  },
  {
    "text": "There Are Tapes: GOP Rep. Has Recording of Kevin McCarthy ‘Belittling’ Him  —  LORDY  —  Rep. Tim Burchett (R-TN) told CNN on Wednesday morning that he recorded his Monday night call with Kevin McCarthy that featured the since-ousted Speaker of the House “belittling” the Tennessee lawmaker.",
    "url": "https://www.thedailybeast.com/gop-rep-tim-burchett-has-recording-of-kevin-mccarthy-belittling-him"
  },
  {
    "text": "Why is protecting institutions largely the Democrats' responsibility?  —  The frustration that Rep. Kevin McCarthy (R-Calif.) had been trying to keep hidden for months (with varying degrees of success) seeped out on Tuesday evening.  At a news conference following his ouster as House speaker … ",
    "url": "https://www.washingtonpost.com/politics/2023/10/04/why-is-protecting-institutions-largely-democrats-responsibility/"
  },
  {
    "text": "Former Mike Pence Aide Claims Matt Gaetz Likely Came To D.C. ‘For The Teenage Interns’  —  Marc Short told CNN that Gaetz wasn't motivated by public service. “it's more likely he came here for the teenage interns on Capitol Hill, to be honest.”  —  LOADING",
    "url": "https://www.huffpost.com/entry/marc-short-matt-gaetz-cnn-interns_n_651ddf94e4b0b44317301e7d"
  },
  {
    "text": "Hours After Gag Order, Trump Launches Fresh Vitriol Against New York Judge  —  Donald Trump on Wednesday launched fresh vitriol against the judge and prosecuting attorney in his New York business fraud trial, carefully skirting a gag order imposed on him just a day prior.",
    "url": "https://newrepublic.com/post/175971/trump-gag-order-attack-new-york-judge-attorney-general"
  },
  {
    "text": "McCarthy behind move to kick Pelosi out of her office, sources say — so he can move into it  —  Kevin McCarthy was behind interim Speaker Patrick McHenry's move to kick former House Speaker Nancy Pelosi and former Majority Leader Steny Hoyer out of their office spaces, two Republican sources told CNN.",
    "url": "https://www.cnn.com/2023/10/03/politics/pelosi-vacate-office-capitol-mchenry-interim-speaker/"
  },
  {
    "text": "Inside the Menendez Indictment: A Mercedes and a Secretive Fatal Crash  —  A 2018 fatal car crash in Bogota, N.J., drew no media attention and resulted in no charges.  The driver was the soon-to-be wife of Senator Robert Menendez.  —  It was a cold evening in December 2018, and Nadine Arslanian … ",
    "url": "https://www.nytimes.com/2023/10/04/nyregion/nadine-menendez-mercedes-death.html"
  },
  {
    "text": "Trump Announces $45.5 Million Fund-Raising Haul, Tripling DeSantis  —  The Trump campaign's total, which cannot be independently verified until later this month, was built in part by an outpouring of money after his mug shot in Georgia was released.  —  Donald J. Trump's campaign announced … ",
    "url": "https://www.nytimes.com/2023/10/04/us/politics/trump-campaign-fund-raising-desantis.html"
  },
  {
    "text": "Officiant fires gun to welcome bride, shoots grandson — and wedding goes on  —  Michael Gardner wanted to start his nephew's wedding with a bang.  —  His plan involved shooting a blank from a revolver into the air to signal to the roughly 200 people gathered on Saturday that the outdoor ceremony … ",
    "url": "https://www.washingtonpost.com/nation/2023/10/04/wedding-officiant-shoots-grandson-michael-gardner-nebraska/"
  },
  {
    "text": "Bidens' dog, Commander, involved in more White House biting incidents than previously reported  —  President Joe Biden and first lady Dr. Jill Biden's 2-year-old German shepherd, Commander, has been involved in more biting incidents than previously reported at the White House, multiple sources familiar with the matter told CNN.",
    "url": "https://www.cnn.com/2023/10/04/politics/commander-biden-white-house/"
  },
  {
    "text": "Giuliani's Drinking, Long a Fraught Subject, Has Trump Prosecutors' Attention  —  The former mayor's drinking has become an investigative subplot in Donald Trump's federal case over 2020 election interference.  But long before that, friends had grown deeply concerned.",
    "url": "https://www.nytimes.com/2023/10/04/us/politics/rudy-giuliani-drinking.html"
  },
  {
    "text": "20 GOP senators led by Rick Scott vow to block bills not related to funding government  —  Facing a pileup of spending bills and a possible government shutdown, 20 Republican senators led by Sen. Rick Scott (Fla.) say they will delay any legislation moving on the Senate floor that does not relate directly to funding the government.",
    "url": "https://thehill.com/homenews/senate/4238926-20-gop-senators-led-by-rick-scott-vow-to-block-bills-not-related-to-funding-government/"
  },
  {
    "text": "GOP candidate says he smeared ‘fecal matter’ on daycare center because of Obama: report  —  A Republican candidate for New Jersey Assembly has admitted to being convicted in a criminal incident where he smeared “fecal matter” on the door of a daycare facility he was feuding with in 2009 … ",
    "url": "https://www.rawstory.com/gop-2665797669/"
  },
  {
    "text": "Colorado high court to hear case against Christian baker who refused to make trans-themed cake  —  The baker previously won a case before the U.S. Supreme Court on a technicality in 2018, after refusing to make a gay couple's wedding cake.  —  On the heels of a U.S. Supreme Court victory … ",
    "url": "https://www.nbcnews.com/nbc-out/out-politics-and-policy/colorado-high-court-hear-case-christian-baker-refused-make-trans-theme-rcna118815"
  },
  {
    "text": "‘The Drew Barrymore Show’ Writers Decline to Return (Exclusive)  —  The daytime talk show is coming back Oct. 16, but the show's three WGA writers — Chelsea White, Cristina Kinon and Liz Koe — have turned down an offer to return with it.  —  The Drew Barrymore Show is once again readying its return … ",
    "url": "https://www.hollywoodreporter.com/tv/tv-news/drew-barrymore-show-writers-decline-return-1235606269/"
  },
  {
    "text": "‘Fixin’ to ride the lightning': Soldier who was handcuffed, hit, pepper-sprayed during traffic stop appeals case after jury mostly sides with police  —  A U.S. Army soldier who sued police after being pepper-sprayed, beaten and threatened with firearms during a traffic stop in a rural southern Virginia town … ",
    "url": "https://lawandcrime.com/civil-rights/fixin-to-ride-the-lightning-soldier-who-was-handcuffed-hit-pepper-sprayed-during-traffic-stop-appeals-case-after-jury-mostly-sides-with-police/"
  },
  {
    "text": "Biden cancels $9 billion in student debt for 125,000 borrowers  — President Joe Biden announced Wednesday that he approved $9 billion in student loan forgiveness for 125,000 Americans.  — The relief is a result of his administration's fixes to number of programs … ",
    "url": "https://www.cnbc.com/2023/10/04/biden-cancels-9-billion-in-student-debt-for-125000-borrowers-.html"
  },
  {
    "text": "Brooklyn public policy advocate stabbed to death in front of girlfriend  —  A Brooklyn man described as a rising star in the world of public policy was stabbed to death in front of his girlfriend while sitting on a bus bench early Monday morning.  —  Ryan Carson, 32, was waiting for a bus … ",
    "url": "https://www.nbcnewyork.com/news/local/brooklyn-public-policy-advocate-stabbed-to-death-in-front-of-girlfriend/4736351/"
  },
  {
    "text": "Exclusive: Donald Trump Followers Targeted by FBI as 2024 Election Nears  —  The federal government believes that the threat of violence and major civil disturbances around the 2024 U.S. presidential election is so great that it has quietly created a new category of extremists that it seeks … ",
    "url": "https://www.newsweek.com/2023/10/13/exclusive-fbi-targets-trump-followers-2024-election-nears-1831836.html"
  },
  {
    "text": "PA 2024 Elections: Casey Leads McCormick In U.S. Senate Race, Quinnipiac University Pennsylvania Poll Finds; Race For The White House: Biden vs. Trump Matchup Barely Budges  —  mail_outline  —  Roughly two weeks after Republican David McCormick announced he would challenge incumbent Democratic … ",
    "url": "https://poll.qu.edu/poll-release?releaseid=3879"
  },
  {
    "text": "Frog meets scorpion: House Republicans threaten to quit Problem Solvers Caucus after McCarthy ouster  —  Oh, to which fable should we turn to explain this sequence of events?  Al Wilson?  Casablanca?  Let's start with Lev Nitoburg and his tale of the scorpion and the frog.",
    "url": "https://hotair.com/ed-morrissey/2023/10/04/frog-meets-scorpion-house-republicans-threaten-to-quit-problem-solvers-caucus-after-mccarthy-ouster-n582302"
  }
]