[
  {
    "text": "Why I'm quitting the Washington Post  —  I've worked for the Washington Post since 2008 as an editorial cartoonist.  I have had editorial feedback and productive conversations—and some differences—about cartoons I have submitted for publication, but in all that time I've never had a cartoon killed … ",
    "url": "https://anntelnaes.substack.com/p/why-im-quitting-the-washington-post"
  },
  {
    "text": "Washington Post Cartoonist Quits After Jeff Bezos Cartoon Is Killed  —  The cartoon, by Ann Telnaes, depicted the owner of The Post, Jeff Bezos, and other billionaires genuflecting toward a statue of President-elect Donald Trump.  —  Ann Telnaes, a Pulitzer Prize-winning cartoonist for The Washington Post … ",
    "url": "https://www.nytimes.com/2025/01/03/business/media/washington-post-cartoonist-quits-after-jeff-bezos-cartoon-is-killed.html?unlocked_article_code=1.mk4.6_zx.YOY8uSvF1m7i&smid=nytcore-ios-share&referringSource=articleShare&tgrp=ctr"
  },
  {
    "text": "Trump Has Reeled in More Than $200 Million Since Election Day  —  The president-elect has boasted about the donations for his inauguration, library and political activities from those seeking favor or perhaps in some cases, atonement.  —  Since his victory in November … ",
    "url": "https://www.nytimes.com/2025/01/04/us/politics/trump-inaugural-donations.html"
  },
  {
    "text": "Scoop: Apple CEO Tim Cook donates $1 million to Trump inauguration … The company is not expected to give.  — Cook, with a consistent presence in Washington, has made it clear over the years that he believes in participation, not sitting on the sidelines, and engaging with policymakers from both sides of the aisle.",
    "url": "https://www.axios.com/2025/01/03/tim-cook-apple-donate-1-million-trump-inauguration"
  },
  {
    "text": "Apple CEO Tim Cook personally invested $1 million in Trump's inauguration  —  In a bid to gain favor with the president-elect, Apple CEO Tim Cook has contributed $1 million of his personal finances to the inauguration fund.  —  President-elect Donald Trump will be inaugurated on January 20 … ",
    "url": "https://appleinsider.com/articles/25/01/03/apple-ceo-tim-cook-personally-invested-1-million-in-trumps-inauguration"
  },
  {
    "text": "Johnson's Reward for Keeping His Gavel: An Impossible Job Delivering for Trump  —  Speaker Mike Johnson narrowly avoided a painful and prolonged fight to keep his post, but his messy victory showed how difficult his job will be in the new all-Republican Congress.",
    "url": "https://www.nytimes.com/2025/01/03/us/politics/johnson-speaker-trump-republicans.html"
  },
  {
    "text": "Judge Upholds Trump's Conviction but Signals No Jail Time  —  The New York judge who oversaw President-elect Donald J. Trump's hush-money trial scheduled his sentencing for Jan. 10.  Mr. Trump is expected to appeal his conviction.  —  A New York judge on Friday upheld President-elect Donald … ",
    "url": "https://www.nytimes.com/2025/01/03/nyregion/trump-sentencing-hush-money-case-ny.html"
  },
  {
    "text": "Biden Presidential Medal of Freedom honorees to include Hillary Clinton, Lionel Messi  —  Among Saturday's 19 recipients are rockstar Bono and actor Denzel Washington.  —  President Joe Biden is pictured during an event to award the Presidential Citizens Medal to recipients in the East Room … ",
    "url": "https://abcnews.go.com/Politics/biden-presidential-medal-freedom-honorees-include-hillary-clinton/story?id=117325468"
  },
  {
    "text": "Biden to Dole Out 19 Medals of Freedom, and One Unmistakable Message  —  With a recipient list stocked with old-guard icons and political backers, the president is signaling support for the establishment his successor wants to tear down.  —  With 16 days left in a political career that spanned … ",
    "url": "https://www.nytimes.com/2025/01/04/us/politics/biden-to-dole-out-19-medals-of-freedom-and-one-unmistakable-message.html"
  },
  {
    "text": "The Militia and the Mole  —  Outraged by the Jan. 6 Capitol riot, a wilderness survival trainer spent years undercover climbing the ranks of right-wing militias.  He didn't tell police or the FBI.  He didn't tell family or friends.  The one person he told was a ProPublica reporter.",
    "url": "https://www.propublica.org/article/ap3-oath-keepers-militia-mole"
  },
  {
    "text": "Driver who exploded Cybertruck in Las Vegas railed about ‘political grievances’ and domestic issues before suicide  —  Editor's Note: Help is available if you or someone you know is struggling with suicidal thoughts or mental health matters.  In the US: Call or text 988, the Suicide & Crisis Lifeline.",
    "url": "https://www.cnn.com/2025/01/03/us/las-vegas-cybertruck-explosion/"
  },
  {
    "text": "Jimmy Carter's Funeral: See the Full Schedule of Events  —  The gestures of remembrance have all been selected to reflect the 39th president's rural roots and political career in Georgia and Washington, and his legacy of global advocacy.  —  Over the next six days, various dignitaries … ",
    "url": "https://www.nytimes.com/2025/01/04/us/jimmy-carter-funeral-schedule.html?unlocked_article_code=1.mk4.EXEW.qJ1vz-dzIcG3&smid=url-share"
  },
  {
    "text": "Trump is days away from having to confront the kinds of crises he's long been railing against  —  The president-elect is confronting a new year with a raft of challenges, from the attack in New Orleans to ongoing massive Chinese-linked hacks of critical systems.",
    "url": "https://www.politico.com/news/2025/01/04/trump-american-crises-solutions-00196444"
  },
  {
    "text": "How the Democrats Lost the Working Class … The Democratic Party's estrangement from working-class voters was crucial to Donald J. Trump's victories in 2016 and 2024.Will Warasila for The New York Times  —  Democrats had just absorbed a crushing defeat in the 1994 midterm elections … ",
    "url": "https://www.nytimes.com/2025/01/04/us/politics/democrats-working-class.html"
  },
  {
    "text": "Harris to oversee electoral count, restoring norm that Trump shattered  —  The vice president on Monday is scheduled to certify the victory of a man she repeatedly called unfit for office.  —  Vice President Kamala Harris has called President-elect Donald Trump a threat to American democracy.",
    "url": "https://www.washingtonpost.com/politics/2025/01/04/harris-oversees-certification-trump-victory/"
  },
  {
    "text": "Soldier who blew up Tesla at Trump hotel left note saying blast was to be a ‘wake up call’ for US  —  A highly decorated Army soldier who fatally shot himself in a Tesla Cybertruck just before it blew up outside the Trump hotel in Las Vegas left notes saying the New Year's Day explosion … ",
    "url": "https://apnews.com/article/cybertruck-explosion-trump-hotel-las-vegas-6c85af85255753db497f2cd344fb2ace"
  }
]