[
  {
    "text": "Trump to take more than 200 executive actions on day one  —  EXCLUSIVE: President-elect Trump will sign more than 200 executive actions on Inauguration Day—a massive, first wave of policy priorities focused on border security, energy, reducing the cost of living for American families … ",
    "url": "https://www.foxnews.com/politics/trump-take-more-than-200-executive-actions-day-one"
  },
  {
    "text": "EXCLUSIVE: Trump's Day One Executive Order on ‘Male and Female’  —  The White House strikes out at gender ideology and pronouns.  Also: ends housing of biological men in women's prisons; self-ID on passports; and more.  —  Toward the end of the 2024 presidential campaign … ",
    "url": "https://www.thefp.com/p/trumps-day-one-executive-order-male-female-gender-ideology-pronouns"
  },
  {
    "text": "TikTok is coming back online after Trump pledged to restore it  —  New York CNN  —  TikTok appears to be coming back online just hours after President-elect Donald Trump pledged Sunday that he would sign an executive order Monday that aims to restore the banned app.",
    "url": "https://www.cnn.com/2025/01/19/tech/tiktok-ban/"
  },
  {
    "text": "Miller tells Republican leaders Trump will strip protections from career civil servants.  —  Miller Tells Republicans Trump Will Strip Protections From Civil Servants  —  Behind the Scenes as Trump's Inauguration Moves Indoors  —  Haiyun Jiang  —  On Friday, Trump announced that his inauguration … ",
    "url": "https://www.nytimes.com/live/2025/01/19/us/trump-inauguration-news?unlocked_article_code=1.qU4._S6u.2h71CyJ0Hyz3&smid=url-share"
  },
  {
    "text": "Trump plans barrage of Day 1 executive actions on border, energy, federal workforce  —  President-elect Trump is planning a barrage of executive actions on energy, the border and immigration enforcement on his first day in office, four sources told The Hill.",
    "url": "https://thehill.com/homenews/administration/5094573-trump-day-one-executive-orders/"
  },
  {
    "text": "TikTok says it is ‘restoring service’ after Trump announces he will issue executive order  — TikTok says it is “restoring service” in the United States.  — The company had turned off its app for its 170 million US users on Saturday.  — President-elect Donald Trump said he will issue … ",
    "url": "https://www.businessinsider.com/tiktok-back-online-us-shutdown-biden-trump-media-app-2025-1"
  },
  {
    "text": "Vivek Ramaswamy expected to depart DOGE  —  Vivek Ramaswamy, President-elect Donald Trump's choice to co-lead the Department of Government Efficiency (DOGE) with entrepreneur Elon Musk, is expected to soon step away from the task force, CBS News has learned.",
    "url": "https://www.cbsnews.com/news/vivek-ramaswamy-expected-to-depart-doge/"
  },
  {
    "text": "Trump's Cryptocurrency Surges to Become One of the World's Most Valuable  —  The new business venture by the Trump family is generating intensifying criticism, even as it has turned into an overnight phenomenon, generating a windfall on paper.  —  The Trump family's new crypto token surged … ",
    "url": "https://www.nytimes.com/2025/01/19/us/politics/trump-cryptocurrency-surges.html?unlocked_article_code=1.qk4.LdH6.reJymwrcjNgW&smid=url-share"
  },
  {
    "text": "Donald Trump, crypto billionaire … - After another massive overnight rally, as of Sunday morning Trump's crypto holdings were worth as much as $58 billion on paper, enough — with his other assets — to make him one of the world's 25 richest people.",
    "url": "https://www.axios.com/2025/01/19/donald-trump-crypto-billionaire"
  },
  {
    "text": "Scores of career State Dept. diplomats resign before Trump's inauguration  —  Trump's team requested the high-level resignations as the president-elect prepares a sharp break with the Biden administration.  —  Scores of senior career diplomats are resigning from the State Department effective … ",
    "url": "https://www.washingtonpost.com/national-security/2025/01/19/trump-state-department-resignations/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM3MjYyODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM4NjQ1MTk5LCJpYXQiOjE3MzcyNjI4MDAsImp0aSI6IjA3ZjJkZjU3LWRkODktNDFmMC1hMzc3LWVmN2IyN2ZmMzRmNyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb25hbC1zZWN1cml0eS8yMDI1LzAxLzE5L3RydW1wLXN0YXRlLWRlcGFydG1lbnQtcmVzaWduYXRpb25zLyJ9.F2w85PZoKMacD_JnaSMCeRKPTHY3NCBuVGx8blr8zTE&itid=gfta"
  },
  {
    "text": "Trump Vowed to End the Ukraine War Before Taking Office.  The War Rages On.  —  Donald J. Trump's promise to broker peace between Russia and Ukraine in 24 hours, “before I even become president,” proved to be hyperbole.  —  After they win elections and move into the White House … ",
    "url": "https://www.nytimes.com/2025/01/19/us/politics/trump-promise-ending-ukraine-war.html"
  },
  {
    "text": "Trump is back.  But a return of total resistance would be a bad strategy.  —  A guide for how liberals should approach the next four years.  —  When Donald Trump was first elected president in the fall of 2016, his elevation to the most powerful office in the world seemed like an aberration.",
    "url": "https://www.bostonglobe.com/2025/01/19/opinion/trump-resistance-second-term/"
  },
  {
    "text": "Biden pardons the late Black nationalist Marcus Garvey as well as 4 others and commutes 2 sentences  —  President Joe Biden on Sunday posthumously pardoned Black nationalist Marcus Garvey, who influenced Malcolm X and other civil rights leaders and was convicted of mail fraud in the 1920s.",
    "url": "https://apnews.com/article/biden-pardons-marcus-garvey-fc8a98481f2139f908814476e883e764"
  },
  {
    "text": "First Israeli hostages and Palestinian prisoners freed in ceasefire deal with Hamas  —  Around 90 Palestinian prisoners and detainees were freed from Israeli jails and into the occupied West Bank on Sunday, as part of an exchange under ceasefire deal between Hamas and Israel that went into effect Sunday morning.",
    "url": "https://www.npr.org/2025/01/19/g-s1-43571/ceasefire-goes-into-effect-in-gaza"
  },
  {
    "text": "Most Americans optimistic about Trump's return to office: Poll  —  A new survey found that most Americans are optimistic about President-elect Trump returning to the White House.  —  The survey, conducted by CBS News and YouGov, found that 60 percent of respondents say they feel optimistic about Trump's second term.",
    "url": "https://thehill.com/homenews/administration/5094460-most-americans-optimistic-about-trumps-return-to-office-poll/"
  },
  {
    "text": "Accused 9/11 Mastermind Agrees to Use of Disputed Confession for Life Sentence  —  Lawyers for Khalid Shaikh Mohammed have said for years that the confession was tainted by torture.  Mr. Mohammed has now agreed that portions can be used at his sentencing trial if prosecutors agree to settle his case.",
    "url": "https://www.nytimes.com/2025/01/19/us/politics/khalid-shaikh-mohammed-plea-deal-torture-sept-11.html"
  },
  {
    "text": "Part 3: Democracy, Oligarchy, and Tyranny  —  As coincidence has it, I was reading Book VIII of Plato's The Republic and considering a blog post about the interplay of democracy and oligarchy when Biden gave a speech warning Americans of a rising oligarchy.  I did not intend my blog post about The Republic to be so timely.",
    "url": "https://terikanefield.com/democracy-oligarchy-and-tyranny/"
  },
  {
    "text": "Trump Barely Won the Popular Vote.  Why Doesn't It Feel That Way?  —  In 2024, Donald Trump won the popular vote by 1.5 points.  Trump and Democrats alike treated this result as an overwhelming repudiation of the left and a broad mandate for the MAGA movement.  But by any historical measure, it was a squeaker.",
    "url": "https://www.nytimes.com/2025/01/19/opinion/trump-mandate-zuckerberg-masculinity.html"
  }
]