[
  {
    "text": "Biden aides slam Trump for calling Hezbollah ‘very smart’  —  Aides to President Biden and his campaign blasted former President Trump on Thursday for remarks a night earlier in which Trump described Hezbollah as “very smart” amid unfolding violence in Israel.",
    "url": "https://thehill.com/homenews/campaign/4251829-biden-aides-slam-trump-for-calling-hezbollah-very-smart/"
  },
  {
    "text": "Why is Trump Trashing Netanyahu?  —  Not even an international crisis of epic proportion can prevent the former president from making everything about his ego.  —  On Wednesday, Donald Trump held a rally in West Palm Beach, Florida.  Considering Palm Beach County has one of the highest concentrations … ",
    "url": "https://washingtonmonthly.com/2023/10/12/why-is-trump-trashing-netanyahu/"
  },
  {
    "text": "Donald Trump Criticizes Israel PM Benjamin Netanyahu, Calls Hezbollah ‘Very Smart’  —  The former president admitted he could have been dishing classified information at a campaign event with a claim about the Israeli leader.  —  LOADING  —  Former President Donald Trump … ",
    "url": "https://www.huffpost.com/entry/donald-trump-israel-hezbollah_n_6527b1aae4b0102e6964bb29"
  },
  {
    "text": "10/12/23 ☀️ Punchbowl News AM … But worse.  Maybe way worse. … Only the stakes this time are higher, the time frame is shorter, the opposition is larger and the House Republican Conference is angrier. … After winning the GOP speaker nomination on Wednesday — barely … ",
    "url": "https://punchbowl.news/archive/101223-punchbowl-news-am/"
  },
  {
    "text": "The New Republican Establishment  —  An alternative Trumpist governing elite gets closer to ruling the party.  —  In the final account, the rise and fall of Kevin McCarthy might read like the familiar tale of a Republican congressional leader toppled by a small but uncompromising right-wing faction.",
    "url": "https://www.nytimes.com/2023/10/12/upshot/new-republican-establishment-speaker.html"
  },
  {
    "text": "A new indictment charges Sen. Menendez with being an unregistered agent of the Egyptian government  —  Federal prosecutors have rewritten their indictment against U.S. Sen. Bob Menendez of New Jersey and his wife to charge them with conspiring to have him act as an agent of Egypt and Egyptian officials.",
    "url": "https://apnews.com/article/bob-menendez-indictment-c1850764b8ce7c613fc50f0e4f495e87"
  },
  {
    "text": "U.S., Qatar agree to stop Iran from tapping $6 billion fund after Hamas attack  —  U.S. officials and the Qatari government have agreed to stop Iran from accessing a $6 billion account for humanitarian assistance in light of Hamas's attack on Israel, Deputy Treasury Secretary Wally Adeyemo told House Democrats … ",
    "url": "https://www.washingtonpost.com/business/2023/10/12/iran-oil-fund-us-israel/"
  },
  {
    "text": "Six Months Ago NPR Left Twitter.  The Effects Have Been Negligible  —  A lot of people threaten to leave Twitter.  Not many of them have actually done it.  —  This was true even before Elon Musk's purchase of the platform a year ago.  But the parade of calamities since … ",
    "url": "https://niemanreports.org/articles/npr-twitter-musk/"
  },
  {
    "text": "Israel-Hamas War  —  U.N. Warns of ‘Disaster’ in Gaza as Israel Strikes Back at Hamas  —  More than 300,000 people are homeless as Israeli airstrikes pound Gaza in retaliation for the Hamas attack.  Secretary of State Antony Blinken pledged steadfast support for Israel while calling for … ",
    "url": "https://www.nytimes.com/live/2023/10/12/world/israel-gaza-war-hamas"
  },
  {
    "text": "Wisconsin Republicans Retreat From Threats to Impeach Liberal Justice  —  Republicans had floated the idea of impeaching Janet Protasiewicz, newly seated on the Wisconsin Supreme Court, before she could undo the party's legislative gerrymander.  But on Thursday, they backed off.",
    "url": "https://www.nytimes.com/2023/10/12/us/politics/wisconsin-republicans-impeach-janet-protasiewicz.html"
  },
  {
    "text": "Republican Sen. Tuberville Warns Against ‘Picking Sides in the Middle East’ in Jaw-Dropping Interview  —  Senator Tommy Tuberville (R-AL) is under fire for telling an interviewer that “when you start picking sides in the Middle East, it can get really messy very quick” amid the violence in Israel spurred by Hamas.",
    "url": "https://www.mediaite.com/news/republican-sen-tuberville-warns-against-picking-sides-in-the-middle-east-in-jaw-dropping-interview/"
  },
  {
    "text": "France bans pro-Palestinian protests, citing risk of ‘disturbances to public order’  —  French police used teargas and water cannon to break up a banned rally in support of the Palestinian people in Paris on Thursday after the interior minister said such gatherings were “likely to generate disturbances to public order”.",
    "url": "https://www.reuters.com/world/europe/france-bans-pro-palestinian-protests-citing-risk-disturbances-public-order-2023-10-12/"
  },
  {
    "text": "Waahmbulance time: When your water pipes become rockets, it's Israel's fault there's no water  —  Since Hamas didn't seem to be getting any sympathy at the moment in the “Look what Israel's doing to our buildings!” quarter (I'm admittedly biased)...  ...they've apparently decided to switch tacks.",
    "url": "https://hotair.com/tree-hugging-sister/2023/10/12/waahmbulance-time-when-your-water-pipes-become-rockets-its-israels-fault-theres-no-water-n584219"
  },
  {
    "text": "Trump Doral event with Eric Trump will feature a Hitler-promoting antisemite who killed someone  —  This is at least the fourth Hitler-promoting antisemite who's toured with Eric Trump  —  Trump National Doral Miami is scheduled to host a ReAwaken America tour event featuring Eric Trump … ",
    "url": "https://www.mediamatters.org/eric-trump/trump-doral-event-eric-trump-will-feature-ian-smith-hitler-promoting-antisemite-who"
  },
  {
    "text": "US Gives First Iron Dome Interceptors to Israel  — US to send more Tamir interceptors to Israel, official says  — Interceptors are located in Israel but owned by the US  —  The Pentagon has transferred to Israel the first missiles in US inventories for the Iron Dome air-defense system … ",
    "url": "https://www.bloomberg.com/news/articles/2023-10-12/pentagon-owned-stocks-in-israel-transfered-to-defense-forces"
  },
  {
    "text": "The Massacre in Israel and the Need for a Decent Left  —  On Tuesday evening, I was drinking on the porch of my friend and neighbor Misha Shulman, the Israel-born rabbi of a progressive New York synagogue called the New Shul.  All day, he'd been on the phone with congregants deeply distraught … ",
    "url": "https://www.nytimes.com/2023/10/12/opinion/columnists/israel-gaza-massacre-left.html"
  },
  {
    "text": "North Carolina's cautionary tale for purple states  —  Republicans have made themselves so powerful, it doesn't matter if Dems win elections. … North Carolina Republicans are having a very good year, and now that they've locked down both the legislature and the judiciary … ",
    "url": "https://www.publicnotice.co/p/north-carolina-gop-power-grab-roy-cooper"
  },
  {
    "text": "Trump tells court he had no duty to ‘support’ the Constitution as president  —  Former President Donald Trump is arguing to a judge in Colorado that he was not required to “support” the Constitution as president, reported Brandi Buchman from Law & Crime.  —  The argument came as he seeks … ",
    "url": "https://www.rawstory.com/trump-wont-support-constitution/"
  }
]