[
  {
    "text": "BREAKING: NYT Reports Biden Mulling Withdrawal — If ...  Should I stay or should I go?  That's the rock-and-roll version of Shakespeare's “to be or not to be.”  Given that Democrats face a tragedy of their own making in propping up a clearly incompetent Joe Biden for a run at a second term … ",
    "url": "https://hotair.com/ed-morrissey/2024/07/03/breaking-nyt-reports-biden-mulling-withdrawal-if-n3791335"
  },
  {
    "text": "Trump Widens Lead After Biden's Debate Debacle, Times/Siena Poll Finds  —  Donald Trump is ahead of President Biden by six percentage points among likely voters in a new national survey.  Overall, 74 percent of voters view him as too old for the job, an uptick since the debate.",
    "url": "https://www.nytimes.com/2024/07/03/us/politics/poll-debate-biden-trump.html"
  },
  {
    "text": "Biden Told Ally That He Is Weighing Whether to Continue in the Race  —  The president's conversation is the first indication that he is seriously considering whether he can recover after a devastating performance on the debate stage in Atlanta on Thursday.  —  President Biden has told … ",
    "url": "https://www.nytimes.com/2024/07/03/us/politics/biden-election-debate.html"
  },
  {
    "text": "Biden Tells Allies He Knows He Has Only Days to Salvage Candidacy  —  The president's conversations are the first indication that he is seriously considering whether he can recover after a devastating performance on the debate stage in Atlanta.  The White House said the report was false.",
    "url": "https://www.nytimes.com/2024/07/03/us/politics/biden-withdraw-election-debate.html"
  },
  {
    "text": "Time to Roll the Dice  —  November's election has very high stakes: the nature and, indeed, the continued existence of the American republic, at least in the form that we've known it for the past century.  Around the world, the United States under a second Trump presidency would cease … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/07/replace-biden-strategic-plan/678884/"
  },
  {
    "text": "Clyburn says he would support ‘mini-primary’ ahead of DNC if Biden steps aside  —  “You can actually fashion the process that's already in place to make it a mini-primary, and I would support that absolutely,” Rep. Jim Clyburn said.  —  Democratic Rep. Jim Clyburn, a top ally of Joe Biden … ",
    "url": "https://www.politico.com/news/2024/07/03/clyburn-biden-president-election-dnc-00166481"
  },
  {
    "text": "Electoral College Rating Changes: Upper Midwest Moves After Biden's Debate Disaster … KEY POINTS FROM THIS ARTICLE  — President Biden's debate performance was so bad that it has forced us to reassess some of our assumptions about the race.  — Michigan and Minnesota move to more competitive categories in our ratings.",
    "url": "https://centerforpolitics.org/crystalball/electoral-college-rating-changes-upper-midwest-moves-after-bidens-debate-disaster/"
  },
  {
    "text": "Behind the Curtain: Democratic rage at Biden rises … Some of these members believe the White House wants to shield Biden from people who'd try to argue why he should drop out.  — “I don't know who's making decisions,” said one House Democrat who's exasperated with the West Wing.",
    "url": "https://www.axios.com/2024/07/03/democratic-rage-biden-debate-performance"
  },
  {
    "text": "Inside the GOP Effort to Make Sure Biden Is the Democratic Nominee  —  “We would make it extraordinarily difficult” for Democrats to replace Joe Biden on the ballot, a Heritage Foundation leader told NOTUS.  — Copy  —  President Joe Biden's Democratic allies could get a boost to keep … ",
    "url": "https://www.notus.org/2024-election/biden-heritage-republicans"
  },
  {
    "text": "Biden Must Resign  —  Joe Biden must resign the presidency.  The last person to do so was Richard Nixon, who left in disgrace after abusing the powers of his office.  Nixon had to resign because he led an assault on American democracy.  Biden must resign for the opposite reason … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/07/biden-resign-kamala-harris-presidential-candidate/678886/"
  },
  {
    "text": "President Kamala Harris  —  1. Skating, Pucks  —  I am now convinced that President Biden will step aside as his party's nominee.  This isn't a value judgment, just an analysis of reality.1 As I explained on Monday, if that happens, Kamala Harris is—far and away—the most likely replacement.",
    "url": "https://www.thebulwark.com/p/president-kamala-harris"
  },
  {
    "text": "Biden vows to keep running after his disastrous debate.  ‘No one is pushing me out,’ he says  —  President Joe Biden defiantly vowed on Wednesday to keep running for reelection, rejecting growing pressure from within his Democratic Party to withdraw after a disastrous debate performance raised questions about his readiness.",
    "url": "https://apnews.com/article/president-joe-biden-white-house-jeff-zients-7794155c12bc78c084e4b964545e2b7f"
  },
  {
    "text": "Trump Expands Lead Over Biden as Age Worries Grow, WSJ Poll Finds  —  The former president is now ahead by 6 points, with 80% saying the incumbent is too old to run",
    "url": "https://www.wsj.com/politics/elections/trump-expands-lead-over-biden-after-debate-as-voters-age-worries-grow-wsj-poll-finds-c3a793ab"
  },
  {
    "text": "Forcing Biden Out Would Have Only One Beneficiary: Trump  —  Joe Biden refuses to drop out of the presidential race even as some liberals, rattled by the incumbent's frightening debate performance last week, keep pressuring him to do so.  —  Who's surprised by that?",
    "url": "https://www.nytimes.com/2024/07/03/opinion/biden-harris-trump-democrats.html"
  },
  {
    "text": "Man Behind Project 2025 Just Said the Quiet Part Out Loud  —  SMELLING BLOOD  —  Heritage Foundation President Kevin Roberts gave what appeared to be a disturbing warning to the left.  —  The president of the Heritage Foundation on Tuesday declared that a new revolution is already underway in the U.S. … ",
    "url": "https://www.thedailybeast.com/kevin-roberts-man-behind-project-2025-just-said-the-quiet-part-out-loud"
  },
  {
    "text": "Pro-choice advocates set to turn in around 800,000 signatures for Arizona abortion ballot measure  —  Arizona abortion-rights supporters on Wednesday turned in more than double the signatures needed to put the issue on November's ballot in the key swing state.",
    "url": "https://apnews.com/article/arizona-abortion-ballot-petitions-83cb053919be342d7bbb60217129fe49"
  }
]