[
  {
    "text": "For Democrats, the Hunter Biden pardon is a problem — and an opportunity  —  President Joe Biden has pardoned Hunter Biden for all crimes — known and unknown — that his son committed over the past 11 years.  —  This is not a great look for a man who's decried President-elect Donald Trump's attacks … ",
    "url": "https://www.vox.com/politics/389206/hunter-biden-pardon-joe-biden-democrats-response"
  },
  {
    "text": "The extraordinary breadth of Hunter Biden's pardon  —  President Joe Biden's pardon of his son, Hunter, for any offenses over a nearly 11-year period doesn't have many, if any, direct historical parallels.  —  It's one thing for a president to pardon his son.  It's another to do it like this.",
    "url": "https://www.washingtonpost.com/politics/2024/12/02/hunter-biden-presidential-pardon-comparisons/"
  },
  {
    "text": "What to know about presidents pardoning family members and allies … - His decision infuriated Republicans and raised questions regarding the precedent that it could set for future presidents. … Donald Trump … He issued one for Charles Kushner, the father of his son-in-law Jared Kushner, at the end of his first term.",
    "url": "https://www.axios.com/2024/12/02/hunter-biden-pardon-family-members-allies-history"
  },
  {
    "text": "Why Biden's Pardon of His Son Is So Controversial  —  The ongoing legal drama over Hunter Biden ended abruptly when his father, US President Joe Biden, pardoned him for tax and gun charges despite vowing not to do so.  —  Biden issued a sweeping order on Dec. 1 that pardoned his son for all federal crimes … ",
    "url": "https://www.bloomberg.com/news/articles/2024-12-02/why-joe-biden-pardoning-his-son-hunter-is-so-controversial"
  },
  {
    "text": "John Dean Reveals Biden Move That Could Doom Trump's ‘Revenge’ Plot  —  The Watergate figure said the president could “take the wind” out of Trump's plans for revenge and retribution with a stroke of his pen.  —  LOADING  —  John Dean, the former White House counsel who helped bring … ",
    "url": "https://www.huffpost.com/entry/john-dean-trump-revenge_n_674d27dde4b0e9a096d07d23"
  },
  {
    "text": "White House press secretary defends Hunter Biden pardon: ‘Enough is enough’  —  Both Karine Jean-Pierre and President Joe Biden had told the press multiple times that he had no plans to pardon his son.  —  White House press secretary Karine Jean-Pierre on Monday defended President Joe Biden's decision … ",
    "url": "https://www.nbcnews.com/politics/white-house/karine-jean-pierre-hunter-biden-pardon-rcna182459"
  },
  {
    "text": "Trump privatization plan will add thousands a year to typical mortgage: expert  —  A proposed deregulation of the home loan market that Donald Trump is widely expected to pursue could have massive consequences for new homebuyers — particularly those with low incomes, reported CNN on Monday.",
    "url": "https://www.rawstory.com/trump-s-expected-mortgage-deregulation-could-cost-new-homebuyers-up-to-2800-more-a-year/"
  },
  {
    "text": "Trump may renew a housing fight that could rattle mortgage rates  —  During his second term, President-elect Donald Trump is widely expected to privatize Fannie Mae and Freddie Mac, the mortgage giants that guarantee 70% of America's mortgages.  —  Amid a housing market marked … ",
    "url": "https://www.cnn.com/2024/12/02/economy/fannie-mae-freddie-mac-mortgage-rates-housing"
  },
  {
    "text": "Unions score major win in Wisconsin with court ruling restoring collective bargaining rights  —  Union leaders were overjoyed with the ruling, which affects tens of thousands of public employees.  —  MADISON, Wis. — Wisconsin public worker and teachers unions scored a major legal victory Monday … ",
    "url": "https://www.politico.com/news/2024/12/02/unions-wisconsin-ruling-collective-bargaining-rights-00192229"
  },
  {
    "text": "MAGA Filmmaker Trump Praised Admits 2020 Election Fraud Doc Was B.S.  —  The conspiracy theorist was sued for defamation after falsely accusing a Georgia man of stuffing ballot boxes  —  MAGA filmmaker Dinesh D'Souza issued a statement on Sunday admitting that his most notorious project … ",
    "url": "https://www.rollingstone.com/politics/politics-news/dinesh-dsouza-admits-2000-mules-documentary-false-data-1235188932/"
  },
  {
    "text": "America Just Failed the Test of Responding to Trump's Politicized Prosecutions  —  Let's imagine that, two years from now, Pam Bondi rolls out charges against some onetime adversary of Donald Trump.  To the extent that journalists will still be employed and reading court filings … ",
    "url": "https://www.emptywheel.net/2024/12/02/america-just-failed-the-test-of-responding-to-trumps-politicized-prosecutions/"
  },
  {
    "text": "Trump's health nominees want Covid vindication.  Here's how their critique has aged.  —  Trump's picks to lead the NIH and FDA were critics of health officials and their pandemic policies.  —  The Covid wars are still raging in 2024, and now the Covid contrarians are in charge.",
    "url": "https://www.politico.com/news/2024/12/02/trump-health-picks-covid-00192011"
  },
  {
    "text": "Trump suggests Canada become 51st state after Trudeau said tariff would kill economy: sources  —  Trudeau made a hastily arranged visit to Mar-a-Lago last Friday after Trump threatened Canada with tariffs  —  Join Fox News for access to this content  —  President-elect Trump suggested … ",
    "url": "https://www.foxnews.com/politics/trump-suggests-canada-become-51st-state-after-trudeau-said-tariff-would-kill-economy-sources"
  },
  {
    "text": "Trump Threatens ‘Hell to Pay’ Unless Gaza Hostages Are Freed Before Inauguration  —  President-elect Donald J. Trump said in a social media post on Monday that the hostages must be released before his inauguration in January.  —  President-elect Donald J. Trump on Monday demanded … ",
    "url": "https://www.nytimes.com/2024/12/02/world/middleeast/trump-gaza-hostages-inauguration.html"
  },
  {
    "text": "5 things to know about Kash Patel  —  President-elect Trump on Saturday nominated longtime ally Kash Patel to lead the FBI, tapping a figure who has pledged to reform the bureau.  —  In doing so, Trump signaled his plan to remove FBI Director Christopher Way, whom Trump nominated to a 10-year term in 2017.",
    "url": "https://thehill.com/homenews/administration/5017697-trump-nominates-kash-patel-fbi/"
  },
  {
    "text": "Harris Stayed Silent On Khan Amid Probe Of Top Adviser's Firm  —  When Democratic donors attacked the Biden-Harris administration's chief antitrust regulator Lina Khan during this year's election, Vice President Kamala Harris declined to defend her, prompting some critics to say Harris … ",
    "url": "https://www.levernews.com/harris-stayed-silent-on-khan-amid-probe-of-top-advisers-firm/"
  },
  {
    "text": "‘Trumpworld deeply worried’: Sources tell MSNBC hosts of ‘controversy inside Trump orbit’  —  MSNBC's Joe Scarborough and Jonathan Lemire claimed Monday that some in Donald Trump's orbit aren't thrilled by his nomination of MAGA loyalist Kash Patel as FBI director.",
    "url": "https://www.rawstory.com/kash-patel-fbi/"
  },
  {
    "text": "Hegseth Faces Allegations Of Boozing, Partying And Mismanagement Helming Veterans Groups  —  Donald Trump's pick for defense secretary is accused of running one nonprofit into the ground and of promoting a climate of toxic sexism at another.  —  Pete Hegseth, the former Fox News host who's … ",
    "url": "https://www.huffpost.com/entry/pete-hegseth-whistleblower-report-new-yorker_n_674dce05e4b0d426caf10ecf"
  },
  {
    "text": "The End of Democratic Delusions  —  The Trump Reaction and what comes next  —  the roosevelt republic—the progressive age that extended social welfare and equal rights to a widening circle of Americans—endured from the 1930s to the 1970s.  At the end of that decade … ",
    "url": "https://www.theatlantic.com/magazine/archive/2025/01/trump-reelection-voter-demographic-change/680752/"
  },
  {
    "text": "Republicans don't care if women die from abortion bans — but they don't want you to know about it  —  Women will keep dying, but the GOP is working hard to destroy the evidence  —  After the Supreme Court ended federal abortion rights in 2022, there was a robust debate between pro … ",
    "url": "https://www.salon.com/2024/12/02/dont-care-if-women-from-abortion-bans--but-they-dont-want-you-to-know-about-it/"
  },
  {
    "text": "The expert class is failing, and so is Biden's presidency  —  As Sean Trende pointed out on X, it hasn't exactly been the best century for the expert class.  Begin with the response to September 11 — the Afghanistan and Iraq Wars, which were supported by bipartisan majorities.",
    "url": "https://www.natesilver.net/p/the-expert-class-is-failing-and-so"
  },
  {
    "text": "Study: U.S.-made weapons might be driving migrants to the southern border  —  Rifles on a wall rack.  (Getty Images)  —  As undocumented immigrants show up at the southern border, many may be fleeing gun violence perpetrated with weapons that originally came from the United States.",
    "url": "https://ohiocapitaljournal.com/2024/12/02/study-u-s-made-weapons-might-be-driving-migrants-to-the-southern-border/"
  },
  {
    "text": "Insider Memo Envisions a New DLC  —  A former venture capitalist and fundraiser has a bold idea: market-friendly moderation.  —  Al From, founder and CEO of the Democratic Leadership Council, second from left, and Pennsylvania Gov. Ed Rendell, right, speak to reporters alongside other Democratic leaders … ",
    "url": "https://prospect.org/politics/2024-12-02-insider-memo-envisions-new-dlc/"
  }
]