[
  {
    "text": "Bruce Springsteen Endorses Kamala Harris for President  —  The rock star has long aligned himself with Democrats and been critical of former President Donald J. Trump.  —  Bruce Springsteen, the rock star and longtime critic of former President Donald J. Trump, endorsed Vice President Kamala Harris … ",
    "url": "https://www.nytimes.com/2024/10/03/us/politics/bruce-springsteen-kamala-harris-endorsement.html?unlocked_article_code=1.PU4.09b4.GT9amTu4QOtD&smid=url-share"
  },
  {
    "text": "Trump says if he thought he lost the 2020 election, he wouldn't be running again  —  Trump said toward the top of his remarks at a rally in Saginaw, Michigan, that if he thought he lost the 2020 presidential election, he wouldn't be running again.  —  “It was a rigged election.",
    "url": "https://www.nbcnews.com/politics/2024-election/live-blog/trump-harris-presidential-election-live-updates-rcna173209/rcrd58425?canonicalCard=true"
  },
  {
    "text": "5 key details in special counsel Jack Smith's Trump election case filing  —  Breaking down the key details from Smith's latest court filing  —  A federal judge on Wednesday unsealed a key filing from special counsel Jack Smith's updated election interference case against former President Donald Trump.",
    "url": "https://www.foxnews.com/politics/5-key-details-special-counsel-jack-smiths-trump-election-case-filing"
  },
  {
    "text": "Former Colorado county clerk Tina Peters sentenced to 9 years for voting data scheme  —  A judge excoriated a Colorado county clerk for her crimes and lies before sentencing her Thursday to nine years behind bars for a data-breach scheme spawned from the rampant false claims about voting machine fraud in the 2020 presidential race.",
    "url": "https://apnews.com/article/tina-peters-colorado-clerk-election-vote-fraud-b456ce4f80dc97f4b967eb6297311a51"
  },
  {
    "text": "Trump election conspiracist Tina Peters sentenced to 9 years in prison by Colorado judge … - CNBC Councils  — CNBC on Peacock  — Join the CNBC Panel  — Supply Chain Values  — Select Shopping  — Ad Choices  — News Tips  —  Got a confidential news tip?  We want to hear from you.",
    "url": "https://www.cnbc.com/2024/10/03/trump-election-conspiracist-tina-peters-sentenced.html"
  },
  {
    "text": "Biden administration can move forward with student loan forgiveness, federal judge rules … A federal judge will let expire a temporary restraining order against the Biden administration's sweeping new student loan forgiveness plan, which could deliver relief to tens of millions of Americans.",
    "url": "https://www.cnbc.com/2024/10/03/student-loan-forgiveness-plan-goes-ahead-biden.html"
  },
  {
    "text": "Missouri judge blocks Biden student loan forgiveness that was cleared to proceed … The Biden administration's sweeping student loan forgiveness plan was temporarily blocked again Thursday by a Missouri judge, just one day after a federal judge in Georgia said he would let a restraining order against the relief expire.",
    "url": "https://www.cnbc.com/2024/10/03/biden-student-loan-forgiveness-blocked-again-missouri.html"
  },
  {
    "text": "Trump tops Harris by 2 points in Florida: Survey  —  Former President Trump is leading Vice President Harris in Florida by 2 points, according to a new survey.  —  In the poll, released Thursday by Napolitan News Service, Trump received 50 percent support to Harris's 48 percent among likely voters in the Sunshine State.",
    "url": "https://thehill.com/homenews/campaign/4914363-donald-trump-kamala-harris-florida-survey/"
  },
  {
    "text": "Helene isn't the first time Trump inserted politics into a natural disaster … In the aftermath of Hurricane Helene, former President Donald Trump has blasted the Biden administration for its handling of the disaster — going so far as to accuse Democratic leaders of ignoring the needs of Republican storm victims.",
    "url": "https://www.eenews.net/articles/helene-isnt-the-first-time-trump-inserted-politics-into-a-natural-disaster/"
  },
  {
    "text": "Could Trump Really Use the Justice Department to Lock Up His Enemies? … As a candidate for president once again, Donald Trump could not be clearer about his plans to use the Justice Department to seek revenge against his enemies.  During his 2016 campaign, his rallies exploded with the chant “Lock Her Up.”",
    "url": "https://www.nytimes.com/2024/10/03/magazine/trump-justice-department-rivals.html"
  },
  {
    "text": "Striking port workers to return to work Friday as negotiators reach an agreement on wages  —  New York CNN  —  Striking members of the International Longshoremen's Association will be back to work at the ports on Friday, the union announced Thursday evening, as the union … ",
    "url": "https://www.cnn.com/2024/10/03/business/port-strike-union-deal/"
  },
  {
    "text": "Photos Show New York Congressman in Blackface as Michael Jackson  —  Representative Mike Lawler, a Republican locked in a tight race for re-election, dressed as the pop star for Halloween as a college student in 2006.  —  Representative Mike Lawler of New York wore blackface as part … ",
    "url": "https://www.nytimes.com/2024/10/03/nyregion/lawler-blackface-michael-jackson.html?unlocked_article_code=1.PU4.QjF5.v5JniminTZBb&smid=url-share"
  },
  {
    "text": "CNN requested an interview with Melania Trump.  Her book publisher asked for $250,000 in exchange  —  Nearly two months ago, CNN reached out to Melania Trump's book publisher to request an interview with the former first lady ahead of her upcoming memoir.  After several exchanges … ",
    "url": "https://www.cnn.com/2024/10/03/politics/melania-trump-book-cnn-interview/"
  },
  {
    "text": "I Know What His Mamaw Would Tell JD Vance About Hillbilly Values  —  NO MIGRANT HATE  —  I'm a real hillbilly like Vance claims to be.  He should learn about immigrants from how his family were treated when they moved for a better life. … JD Vance had a lot to say about immigrants at Tuesday night's debate.",
    "url": "https://www.thedailybeast.com/i-know-what-mamaw-would-tell-jd-vance-about-hating-immigrants-at-vice-presidential-debate"
  },
  {
    "text": "Feds say there's no money left to respond to hurricanes — after FEMA spent $1.4B on migrants  —  WASHINGTON — Homeland Security Secretary Alejandro Mayorkas set off outrage Wednesday when he told reporters that the Federal Emergency Management Agency (FEMA) “does not have the funds” … ",
    "url": "https://nypost.com/2024/10/03/us-news/feds-say-theres-no-money-left-to-respond-to-hurricanes-after-fema-used-640-9m-this-year-on-migrants/"
  },
  {
    "text": "Trump on Springfield Haitian migrants: ‘They have to be removed’  — Immigrants living there under temporary protected status  — Trump has made false claims about Haitian immigrants eating pets … HOUSTON (NewsNation) — Former President Donald Trump exclusively told NewsNation … ",
    "url": "https://www.newsnationnow.com/politics/2024-election/trump-springfield-haitian-migrants-removed/"
  },
  {
    "text": "Dozens of San Fernando Valley white supremacist gang members charged in federal indictment, DOJ says  —  Federal prosecutors said 42 members and associates of a San Fernando Valley white supremacist gang were arrested and indicted.  —  LOS ANGELES (CNS) — Forty-two members of what prosecutors call … ",
    "url": "https://abc7.com/post/dozens-san-fernando-valley-white-supremacist-gang-members-arrested-charged-federal-indictment/15385105/"
  },
  {
    "text": "Firefighters union declines to issue presidential endorsement  —  The decision follows the Teamsters union recent decision to decline to make an endorsement.  —  Vice President Kamala Harris suffered a blow Thursday as the union representing more than 300,000 career firefighters … ",
    "url": "https://www.politico.com/news/2024/10/03/fire-fighters-union-declines-presidential-endorsement-00182372"
  },
  {
    "text": "Revealed: ports-strike CEO's crude attacks on Biden and Democrats  —  David Adam of USMX made coarse remarks about president and appeared to endorse rightwing conspiracy theory  —  An executive representing ports where tens of thousands of workers went on strike this week made a series … ",
    "url": "https://www.theguardian.com/business/2024/oct/03/port-strike-usmx-biden-democrats"
  },
  {
    "text": "3 Former Officers Acquitted of Most Serious Charge in Tyre Nichols's Death  —  The former officers were found guilty of witness tampering but not of the charge that would have held them responsible for causing his death.  —  Three former Memphis police officers were found guilty on Thursday … ",
    "url": "https://www.nytimes.com/2024/10/03/us/tyre-nichols-verdict.html"
  }
]