[
  {
    "text": "Trump is about to get $3 billion richer after deal is approved to take his company public.  But it won't solve his cash crunch  —  Investors have approved a deal on Friday to make Truth Social owner Trump Media a publicly traded company.  —  The green light from shareholders clears … ",
    "url": "https://www.cnn.com/2024/03/22/business/trump-truth-social-dwac-shares"
  },
  {
    "text": "Trump vows to fight New York AG case ‘all the way up to the US Supreme Court,’ as deadline to post $454M looms  —  James has threatened to begin seizing assets if bond isn't posted, urges court to reject Trump appeal  —  EXCLUSIVE: Former President Trump said he will fight the ruling … ",
    "url": "https://www.foxnews.com/politics/trump-vows-fight-new-york-ag-case-all-way-us-supreme-court-deadline-post-454m-looms"
  },
  {
    "text": "Trump claims he has $500 million in cash, undercutting his lawyers  —  Former president Donald Trump said he has ‘almost $500 million’ in cash, days after his lawyers stated that it would be nearly impossible to post the judgment of nearly half a billion dollars in his New York civil fraud case",
    "url": "https://www.washingtonpost.com/politics/2024/03/22/trump-500-million-civil-fraud/"
  },
  {
    "text": "The Publicly-Traded Presidential Candidate  —  We've all been focused lately on a question appropriate for Schadenfriday: How is Donald Trump going to post a $450+ million bond to cover his appeal in the New York civil fraud case?  The clock is ticking, and Trump claims he doesn't have the ability to post it.",
    "url": "https://statuskuo.substack.com/p/the-publicly-traded-presidential"
  },
  {
    "text": "Johnson's margin drops to one vote as Gallagher heads for early exit  —  Allies of the Wisconsin Republican say he was long jaded by the antics of the House following the ouster of Speaker Kevin McCarthy.",
    "url": "https://www.politico.com/live-updates/2024/03/22/congress/gallagher-leaving-early-00148586"
  },
  {
    "text": "Republican Rep. Mike Gallagher will resign early, leaving House majority hanging by a thread  —  House Republicans lost another member in Rep. Ken Buck, R-Colo., on Friday.  Gallagher's early departure could leave Republicans with just one vote to spare on legislation.",
    "url": "https://www.nbcnews.com/politics/congress/republican-mike-gallagher-resign-early-house-majority-shrinks-rcna144672"
  },
  {
    "text": "Marjorie Taylor Greene files motion to remove Speaker Mike Johnson … - Johnson's predecessor, Rep. Kevin McCarthy (R-Calif.), became the first House speaker to be ousted after hardline Republicans triggered a motion to vacate against him last year.  — Greene's move came after she voiced … ",
    "url": "https://www.axios.com/2024/03/22/majorie-taylor-greene-mike-johnson-vacate-motion"
  },
  {
    "text": "House Passes Spending Bill to Avert Shutdown, Prompting G.O.P. Mutiny  —  The bipartisan vote split Republicans and prompted a threat to oust Speaker Mike Johnson.  It was not clear whether Senate Republicans would allow the spending measure to pass in time to avoid a shutdown.",
    "url": "https://www.nytimes.com/2024/03/22/us/politics/congress-spending-bill-government-shutdown.html"
  },
  {
    "text": "MTG Officially Launches Revolt Against Speaker Mike Johnson  —  On Friday, Rep. Marjorie Taylor Greene (R-GA) filed a motion to force a vote on Mike Johnson's removal from the speakership.  —  It's anarchy again in the House GOP.  —  On Friday, Rep. Marjorie Taylor Greene (R-GA) … ",
    "url": "https://www.thedailybeast.com/marjorie-taylor-greene-officially-launches-motion-to-vacate-revolt-against-speaker-mike-johnson"
  },
  {
    "text": "Ronna McDaniel, Former R.N.C. Chair, Joins NBC News  —  Her new role as a commentator on NBC and MSNBC programs comes shortly after she stepped down as the leader of the Republican National Committee.  —  Ronna McDaniel, who stepped down as chairwoman of the Republican National Committee this month … ",
    "url": "https://www.nytimes.com/2024/03/22/business/media/ronna-mcdaniel-nbc-msnbc.html"
  },
  {
    "text": "NBC hires former RNC chair Ronna McDaniel, who has demonized the press and refused to acknowledge Biden was fairly elected  —  NBC News on Friday announced that it had hired Ronna McDaniel, the former Republican National Committee chair who has repeatedly attacked the network and its journalists … ",
    "url": "https://www.cnn.com/2024/03/22/media/ronna-mcdaniel-nbc/"
  },
  {
    "text": "Terrorist attack at concert hall outside Moscow Latest updates … a few seconds ago  —  Putin recently dismissed U.S. warning of potential terrorist attacks in Moscow  —  On March 19, Vladimir Putin dismissed warnings from U.S. diplomats that there was an imminent risk of a terrorist attack at a crowded venue in Moscow.",
    "url": "https://meduza.io/en/live/2024/03/22/terrorist-attack-at-concert-hall-outside-moscow"
  },
  {
    "text": "Moscow concert attack live updates: Dozens reported dead after shooting  —  What we know about the Moscow concert attack … Public events across Russia called off after attack  —  Several regional leaders across Russia, including in the annexed Kherson region of Ukraine … ",
    "url": "https://www.nbcnews.com/news/world/live-blog/russia-moscow-concert-attack-shooting-rcna144706"
  },
  {
    "text": "Fox News' demands to impeach Biden blew up in the GOP's face  —  The network deserves a big share of the blame for leading Republicans into this debacle.  —  It's time to call it: The House GOP's shambolic inquiry into the impeachment of President Joe Biden expired on Wednesday night … ",
    "url": "https://www.msnbc.com/opinion/msnbc-opinion/fox-news-sean-hannity-biden-impeachment-rcna144499"
  },
  {
    "text": "Inside Garland's Effort to Prosecute Trump  —  In trying to avoid even the smallest mistakes, Attorney General Merrick B. Garland might have made one big one: ending up in a race against the clock.  —  After being sworn in as attorney general in March 2021, Merrick B. Garland gathered … ",
    "url": "https://www.nytimes.com/2024/03/22/us/politics/trump-jan-6-merrick-garland.html"
  },
  {
    "text": "They don't want want this miracle™ to exist  —  It was four years ago today.  After about 34 hours inside Ann Arbor's St. Joseph Mercy Hospital and a lifetime of heroic pushing by my wife, my daughter was born.  She, like every newborn, was a miracle™.  That's the cliche™.",
    "url": "https://thecause.substack.com/p/they-dont-want-want-my-daughter-to"
  }
]