[
  {
    "text": "House GOP blocks second Dem attempt to release Epstein files  —  House Republicans on Tuesday voted down another Democratic procedural maneuver aimed at forcing the Justice Department to release documents related to Jeffrey Epstein. … - Democrats are already promising future votes … ",
    "url": "https://www.axios.com/2025/07/15/epstein-house-democrats-republicans-trump-doj"
  },
  {
    "text": "Speaker Mike Johnson and other Republicans break with Trump on Epstein  —  Democrats also also seizing on an issue championed by the president's base and forced a nearly successful vote Tuesday to take up the issue on the House floor.  —  Summary3  —  One of the leading Republicans … ",
    "url": "https://www.washingtonpost.com/politics/2025/07/15/mike-johnson-epstein-files-democrats-house-vote/"
  },
  {
    "text": "Playbook: Bizarro World  —  With help from Eli Okun, Bethany Irvine and Ali Bianco  —  Happy Tuesday morning.  I'm Adam Wren.  Get in touch.  —  In today's Playbook ...  — Could the key to another House GOP majority be supporting a central Obamacare provision?  We have exclusive new polling.",
    "url": "https://www.politico.com/newsletters/playbook/2025/07/15/bizarro-world-00452932"
  },
  {
    "text": "White House agrees to exempt PEPFAR from cuts  —  Office of Management and Budget Director Russ Vought told reporters after meeting with Senate Republicans Tuesday that the White House is on board with a substitute amendment to the rescissions package that would exempt PEPFAR, the global anti-AIDS initiative from cuts.",
    "url": "https://thehill.com/homenews/senate/5402273-white-house-accepts-pepfar-exemption/"
  },
  {
    "text": "The FBI's Jeffrey Epstein Prison Video Had Nearly 3 Minutes Cut Out  —  Metadata from the “raw” Epstein prison video shows approximately 2 minutes and 53 seconds were removed from one of two stitched-together clips.  The cut starts right at the “missing minute.”",
    "url": "https://www.wired.com/story/the-fbis-jeffrey-epstein-prison-video-had-nearly-3-minutes-cut-out/"
  },
  {
    "text": "The Trump-Epstein question that put the White House “in a tizzy” … - Trump quickly dismissed a reporter's question Tuesday about whether Attorney General Pam Bondi had told him he was in the sex trafficker's files. … - That angered Trump's MAGA loyalists who — thanks in part to Trump and his aides … ",
    "url": "https://www.axios.com/2025/07/16/trump-epstein-question-white-house-edge"
  },
  {
    "text": "Trump tells Texas Republicans to redraw the state congressional map to help keep House majority  —  President Donald Trump said Tuesday that he is pushing Texas Republicans to redraw the state's congressional maps to create more House seats favorable to his party, part of a broader effort … ",
    "url": "https://apnews.com/article/trump-congress-house-republicans-texas-redistricting-d18e8280a32872d9eefcbb26f66a0331"
  },
  {
    "text": "NIH official fired amid probe of contract used to potentially hire spouse, officials say  —  NIH chief operating officer Eric Schnabel was fired as officials were looking into whether a $3.3 million contract could have benefited his spouse.  —  Summary136  —  A senior National Institutes … ",
    "url": "https://www.washingtonpost.com/science/2025/07/15/nih-leader-fired-amid-contract-probe/"
  },
  {
    "text": "Trump accuses Sen. Adam Schiff of mortgage fraud in new attack on critic  —  A senior administration official said a criminal case against the California Democrat had been referred to the Justice Department.  —  President Donald Trump accused Sen. Adam Schiff (D-California) of mortgage fraud Tuesday … ",
    "url": "https://www.washingtonpost.com/business/2025/07/15/schiff-trump-mortgage-fraud/"
  },
  {
    "text": "Spokane ICE protesters, including Stuckart, arrested by federal agents  —  Federal agents on Tuesday morning arrested and searched the homes of multiple people who took part in a June 11 mass protest against immigration enforcement in Spokane.  —  Among those arrested was former Spokane … ",
    "url": "https://www.spokesman.com/stories/2025/jul/15/spokane-ice-protesters-including-stuckart-arrested/"
  },
  {
    "text": "Trump, 79, forgets who is with him on Pittsburgh trip as rambling talk includes unlikely Unabomber story  —  Oldest person to ever serve as president claimed to have discussed Unabomber Ted Kaczynski with MIT professor uncle who died in 1985 … President Donald Trump delivered a rambling speech … ",
    "url": "https://www.the-independent.com/news/world/americas/us-politics/donald-trump-ted-kaczynski-pittsburgh-b2789670.html"
  },
  {
    "text": "US military to remove 2,000 National Guard troops from Los Angeles  —  U.S. Defense Secretary Pete Hegseth has ordered the removal of 2,000 National Guard troops who had been sent to Los Angeles to protect federal property and personnel during a spate of protests last month, the Pentagon said on Tuesday.",
    "url": "https://www.reuters.com/world/us/us-military-remove-2000-national-guard-troops-los-angeles-2025-07-15/"
  },
  {
    "text": "Russia more relieved than rattled by US tariff threat  —  In the Oval Office on Monday, Donald Trump was talking tough, announcing new US arms shipments to Ukraine paid for by European governments, and threatening new tariffs which, if imposed, would hit Russia's war chest.",
    "url": "https://www.bbc.com/news/articles/c62g6e8zvd4o"
  },
  {
    "text": "Hawley Introduces Legislation to Prevent Future Medicaid Cuts, Invest in Rural Hospitals  —  Today, U.S. Senator Josh Hawley (R-Mo.) introduced new legislation to invest in rural hospitals and prevent any future cuts to Medicaid hospital funding.  Senator Hawley's legislation builds on provisions … ",
    "url": "https://www.hawley.senate.gov/hawley-introduces-legislation-to-prevent-future-medicaid-cuts-invest-in-rural-hospitals/"
  },
  {
    "text": "A Scion of Democratic Politics Defeats the Upstarts in an Arizona Primary  —  Adelita Grijalva beat back charges of “legacy” and embraced the memory of her father, Raúl Grijalva, to win the Democratic primary for the House seat opened by his death.  —  The Mamdani momentum withered … ",
    "url": "https://www.nytimes.com/2025/07/15/us/politics/grijalva-arizona-primary.html"
  },
  {
    "text": "U.S. Department of Education Opens Foreign Funding Investigation into the University of Michigan  —  Today, the U.S. Department of Education's Office of the General Counsel (OGC) opened a foreign funding investigation into the University of Michigan (UM) after a review of the university's … ",
    "url": "https://www.ed.gov/about/news/press-release/us-department-of-education-opens-foreign-funding-investigation-university-of-michigan"
  },
  {
    "text": "Billionaires Convince Themselves AI Chatbots Are Close to Making New Scientific Discoveries  —  “I'm doing the equivalent of vibe coding, except it's vibe physics.” … Generative artificial intelligence tools like ChatGPT, Gemini, and Grok have exploded in popularity as AI becomes mainstream.",
    "url": "https://gizmodo.com/billionaires-convince-themselves-ai-is-close-to-making-new-scientific-discoveries-2000629060"
  },
  {
    "text": "Elmo returns to X after hacked antisemitic outburst … By Tuesday, the posts had been deleted, and Elmo appeared to be back to his normal warm and fuzzy self, posting that “Elmo loves you.”  —  The incident is the latest example of hate speech spreading on X, which was acquired in 2022 … ",
    "url": "https://www.politico.com/news/2025/07/15/elmo-x-account-hacked-00455033"
  },
  {
    "text": "When the Online Mob Came After Me—and My Kids  —  Over the past few weeks, I—and my family—have been subject to an aggressive internet harassment campaign.  Thousands of strangers have smeared my name, sent insane direct messages, and made more than a few death threats.",
    "url": "https://www.jessicariedl.blog/p/when-the-online-mob-came-after-meand"
  },
  {
    "text": "ICE Lawyers Are Hiding Their Names in Immigration Court  —  Inside a federal immigration courtroom in New York City last month, a judge took an exceedingly unusual step: declining to state the name of the Immigration and Customs Enforcement attorney pressing to deport asylum seekers.",
    "url": "https://theintercept.com/2025/07/15/ice-lawyers-hiding-names-court/"
  },
  {
    "text": "Federal agents describe unusual run-up to arrests of Pro-Palestinian academics … The agents appeared as witnesses for the government at an ongoing trial in Boston on a lawsuit claiming the Trump administration is implementing an “ideological deportation policy” that targets non-citizens … ",
    "url": "https://www.politico.com/news/2025/07/15/pro-palestinian-academics-deportations-trial-00454324"
  },
  {
    "text": "Mamdani for Mayor (if You Want to Help the Republicans)  —  Two groups must be especially thrilled by the prospect of Zohran Mamdani becoming New York's next mayor.  —  The first: young, progressive-leaning voters who gave the charismatic 33-year-old State Assembly member his come … ",
    "url": "https://www.nytimes.com/2025/07/15/opinion/mamdani-mayor-republicans.html"
  },
  {
    "text": "Trump Administration Resumes Third-Country Deportation Flights  —  The five migrants on the latest flight, all from different countries, were sent to Eswatini, a small nation in southern Africa.  —  The Trump administration sent five migrants from Vietnam, Jamaica, Laos … ",
    "url": "https://www.nytimes.com/2025/07/15/us/politics/trump-deportation-flights-eswatini.html"
  },
  {
    "text": "Trump Makes Bonkers New Threat Against AOC and Jasmine Crockett  —  PROJECTION  —  Boasting that he had “aced” an intelligence test, the president said, “Now it's time for them to take a test.”  —  President Donald Trump wants to hand out IQ tests to Democratic representatives Alexandria Ocasio-Cortez … ",
    "url": "https://www.thedailybeast.com/trump-makes-bonkers-new-threat-against-aoc-and-jasmine-crockett/"
  },
  {
    "text": "Scoop: RFK Jr.'s PAC stirs, fueling speculation on a 2028 campaign … - A 2028 presidential campaign wasn't explicitly discussed, but two people with knowledge of the call came away believing it was a step toward another campaign for Kennedy, whose long-shot run in 2024 wound up helping Donald Trump to victory.",
    "url": "https://www.axios.com/2025/07/16/rfk-jr-pac-2028-speculation"
  }
]