[
  {
    "text": "Paramount in Settlement Talks With Trump Over ‘60 Minutes’ Lawsuit  —  A settlement, if reached, would be an extraordinary concession by a major U.S. media company to a sitting president.  —  When Donald J. Trump sued CBS for $10 billion days before the 2024 election, accusing the company … ",
    "url": "https://www.nytimes.com/2025/01/30/business/media/paramount-trump-cbs-news-settlement.html?unlocked_article_code=1.tU4.TRir.c2EziAfO0_RQ&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "The Art of the Kneel  —  If a settlement deal is inked with Donald Trump, Shari Redstone will be remembered as the mogul who sold out “60 Minutes.”  —  The journalists at CBS News are livid at Paramount Global boss Shari Redstone over the company's move to engage in settlement talks with Donald Trump.",
    "url": "https://www.status.news/p/paramount-trump-60-minutes-settlement-talks"
  },
  {
    "text": "Staffing Was ‘Not Normal’ at Reagan Airport Tower, According to F.A.A. Report  —  The report, reviewed by The New York Times, said that one controller was communicating with both helicopters and planes.  Those jobs are typically assigned to two people, not one.",
    "url": "https://www.nytimes.com/2025/01/30/business/air-traffic-control-staffing-plane-crash.html"
  },
  {
    "text": "Trump launched air controller diversity program that he now decries  —  At news conference, Trump read a list of disabilities he calls disqualifying, but his administration started such hiring in 2019  —  “All qualify for the position of a controller of airplanes pouring into our country … ",
    "url": "https://www.washingtonpost.com/politics/2025/01/30/faa-dei-trump-fact-checker/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM4MjEzMjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM5NTk1NTk5LCJpYXQiOjE3MzgyMTMyMDAsImp0aSI6IjYyMjM3ZWYxLWMzMjUtNDc1NC05ZWNjLTI0MGM3YmQ5ZGE3NCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzAxLzMwL2ZhYS1kZWktdHJ1bXAtZmFjdC1jaGVja2VyLyJ9.diYCYSEL5vSV01nfg83SDz8Ap72uBFG7Tb5MDf_KI8w&itid=gfta"
  },
  {
    "text": "Political reporters are actively covering up Trump's racism  —  Even as bodies were still being fished out of the Potomac River, Donald Trump went on a racist, partisan, and dishonest rant on Thursday, blaming diversity hires and Democrats for Wednesday's calamitous nighttime collision between … ",
    "url": "https://presswatchers.org/2025/01/political-reporters-are-actively-covering-up-trumps-racism/"
  },
  {
    "text": "The Day Trump Became Un-President  —  “We're so back,” one reporter whispered to another.  —  All of the chairs in the White House briefing room were filled, and reporters and photographers were crammed into every available nook and cranny.  I was standing in the back … ",
    "url": "https://www.theatlantic.com/politics/archive/2025/01/trump-airplane-crash/681521/"
  },
  {
    "text": "Senior U.S. official to exit after rift with Musk allies over payment system  —  A top Treasury career staffer is expected to depart.  Surrogates of Musk's DOGE effort had sought access to sensitive payment systems.  —  The highest-ranking career official at the Treasury Department … ",
    "url": "https://www.washingtonpost.com/business/2025/01/31/elon-musk-treasury-department-payment-systems/"
  },
  {
    "text": "F.C.C. Chair Orders Investigation Into NPR and PBS Stations  —  Brendan Carr, the chairman of the Federal Communications Commission, recently expressed concern about NPR and PBS's sponsorships.  —  Brendan Carr, the chairman of the Federal Communications Commission, informed NPR and PBS … ",
    "url": "https://www.nytimes.com/2025/01/30/business/media/npr-pbs-fcc-investigation.html?unlocked_article_code=1.tE4.njGJ.s2ljEztrWYxy&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Trump Aides Hunt for 11th-Hour Deal to Dial Back Canada-Mexico Tariffs  —  President says he will decide tonight whether oil will be included in levies … President Trump's advisers are considering several offramps to avoid enacting the universal tariffs on Mexico and Canada that he had pledged … ",
    "url": "https://www.wsj.com/economy/trade/trump-trade-tariffs-mexico-canada-negotiations-1abfa01e?st=yuXFF7&reflink=article_copyURL_share"
  },
  {
    "text": "National Science Foundation suspends salary payments, leaving researchers unable to pay their bills  —  NSF payment system remained offline despite the lifting of Trump administration funding freeze  —  One scientist texted his landlord to say February rent would be late.",
    "url": "https://www.statnews.com/2025/01/30/trump-funding-freeze-national-science-foundation-suspends-salary-payments/"
  },
  {
    "text": "Gabbard's Hearing Turns Tense Over Snowden Questions  —  Tulsi Gabbard, President Trump's nominee for director of national intelligence, refused to fully denounce the 2013 leaks by Edward J. Snowden, eliciting concern from both parties.  —  Senators of both parties sharply questioned Tulsi Gabbard … ",
    "url": "https://www.nytimes.com/2025/01/30/us/politics/tulsi-gabbard-confirmation-hearing-intelligence.html"
  },
  {
    "text": "‘Everything I Say Leaks,’ Zuckerberg Says in Leaked Meeting Audio  —  Join the newsletter to get the latest updates.  —  Success  —  Great!  Check your inbox and click the link.  —  Error  —  Please enter a valid email address.  —  At an all hands meeting inside Meta Thursday … ",
    "url": "https://www.404media.co/zuckerberg-says-everything-i-say-leaks-in-leaked-meeting-audio/"
  },
  {
    "text": "Civil rights attorney, former Miss Kansas contestant killed in plane crash near DC airport  —  WICHITA, Kan. (KWCH) - As families and communities identify victims in Wednesday night's plane crash near Washington, D.C., we're learning that a well-known civil rights attorney and former Miss Kansas contestant is among the 67 people dead.",
    "url": "https://www.kwch.com/2025/01/30/civil-rights-attorney-former-miss-kansas-contestant-killed-plane-crash-near-dc-airport/"
  },
  {
    "text": "Sam Bankman-Fried's Parents Explore Seeking Trump Pardon for Son  — They've met with lawyers and other figures in Trump's orbit  — FTX co-founder was sentenced to 25 years for fraud last year  —  The Impact of Trump's DEI Actions The Impact of Trump's DEI Actions The Impact of Trump's DEI Actions",
    "url": "https://www.bloomberg.com/news/articles/2025-01-30/sam-bankman-fried-s-parents-explore-seeking-trump-pardon-for-son"
  },
  {
    "text": "Several senior FBI leaders told to leave agency or be fired, people familiar with matter say  —  The ultimatum was unusual for the FBI and suggested that President Donald Trump is purging leadership at an agency he has harshly criticized.  —  Multiple senior FBI officials have been ordered … ",
    "url": "https://www.washingtonpost.com/national-security/2025/01/30/fbi-leadership-removed-kash-patel-trump/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM4MjEzMjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM5NTk1NTk5LCJpYXQiOjE3MzgyMTMyMDAsImp0aSI6ImNmMzI3NGM1LWRiNzEtNGQxYi04NjZiLWU0NTAxYmM0NmRjNyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb25hbC1zZWN1cml0eS8yMDI1LzAxLzMwL2ZiaS1sZWFkZXJzaGlwLXJlbW92ZWQta2FzaC1wYXRlbC10cnVtcC8ifQ.OP5Q6VTexNgVyZXgK5nuJxgkLioGP468FuCILcRANYA&itid=gfta"
  },
  {
    "text": "Records undercut Tulsi Gabbard's claim of ignorance on cleric's views  —  The nominee for director of national intelligence said, under oath, that she did not know “until today” that a prominent cleric she met in Syria threatened to unleash suicide bombers in the United States.",
    "url": "https://www.washingtonpost.com/national-security/2025/01/30/gabbard-hearing-syria-suicide-bombers/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM4MjEzMjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM5NTk1NTk5LCJpYXQiOjE3MzgyMTMyMDAsImp0aSI6IjIyNDUyM2Q1LWYyMTEtNGY4ZS1hYjM1LTMzYzM5YWFmZjM2NyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb25hbC1zZWN1cml0eS8yMDI1LzAxLzMwL2dhYmJhcmQtaGVhcmluZy1zeXJpYS1zdWljaWRlLWJvbWJlcnMvIn0.kckDB2sM2cfcRoRKitNYk2u5WamccUTrQHZ3p3NsKR0&itid=gfta"
  },
  {
    "text": "JAEA Plans Hydrogen Facility Integrated with N-Reactor; Goal Is Steady Supply of Hydrogen without CO2 Byproduct  —  The Japan Atomic Energy Agency plans to ask the Nuclear Regulation Authority to review its plan for building a hydrogen production facility as early as February, The Yomiuri Shimbun has learned.",
    "url": "https://japannews.yomiuri.co.jp/science-nature/science/20250131-236383/"
  },
  {
    "text": "The FAA is facing a major crisis without a leader because Elon Musk pushed him out  —  Musk has publicly clashed with the FAA and its former chief, Michael Whitaker.  —  Musk has publicly clashed with the FAA and its former chief, Michael Whitaker. … The Federal Aviation Administration … ",
    "url": "https://www.theverge.com/news/603113/faa-chief-musk-dc-plane-crash-crisis"
  },
  {
    "text": "Musk's Twitter Takeover Offers Trump a Blueprint  —  Federal agencies have offered exits to millions of employees and tested the prowess of engineers — just like when Elon Musk bought Twitter.  The similarities have been uncanny.  —  The email landed in employees' inboxes with the subject line: “Fork in the Road.”",
    "url": "https://www.nytimes.com/2025/01/30/technology/musk-doge-x-playbook.html?unlocked_article_code=1.tE4.AZid.crJmDInSppkd&smid=url-share"
  },
  {
    "text": "Playbook: Trump's narrative shift  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  Happy Friday.  This is Zack Stanton.  Thanks for waking up with Playbook.  Get in touch: [email protected].  —  FIRST IN PLAYBOOK: Chris LaCivita, the co-manager of President Donald Trump's 2024 campaign … ",
    "url": "https://www.politico.com/newsletters/playbook/2025/01/31/trumps-narrative-shift-00201729"
  },
  {
    "text": "Boxed Up: A Portrait of an Immigrant Community Living Under Threat of Deportation  —  The Nicaraguans who keep Wisconsin's dairy farms, restaurants and factories working are sending home their most prized possessions, bracing for potential mass deportations.  “We don't have much, but what we do have is important.”",
    "url": "https://www.propublica.org/article/immigration-wisconsin-trump-mass-deportations-nicaragua"
  },
  {
    "text": "DOJ's LGBTQ employee group shuts down after three decades  —  The board of DOJ Pride, founded in 1994, told members that the decision was made “in the interest and for the protection of all members.”  —  DOJ Pride, an LGBTQ employee resource group at the Department of Justice … ",
    "url": "https://www.nbcnews.com/feature/nbc-out/justice-department-doj-pride-lgbtq-erg-trump-rcna189866"
  },
  {
    "text": "Census Bureau Director Robert Santos is resigning, making way for Trump's pick  —  The director of the U.S. Census Bureau, Robert Santos, announced Thursday he is resigning, giving President Trump an early opportunity to nominate a new political appointee to lead the agency.",
    "url": "https://www.npr.org/2025/01/30/nx-s1-5258393/census-bureau-director-robert-santos"
  },
  {
    "text": "North Korean Troops No Longer Seen on Front Lines Fighting Ukraine  —  North Korea sent its best troops to aid Russia in its war against Ukraine.  But after months of suffering severe losses, they have been taken off the front line.  —  North Korean soldiers who joined their Russian allies … ",
    "url": "https://www.nytimes.com/2025/01/30/world/europe/north-korea-troops-ukraine-russia.html?unlocked_article_code=1.tU4.TcAA.QFFKo6k9HaQF&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Several top FBI officials are told to resign or face demotion as Trump continues federal purge  —  The affected employees include about a half dozen “executive assistant directors,” who are some of the bureau's top managers.  —  Several top FBI executives promoted by former Director Christopher Wray … ",
    "url": "https://www.nbcnews.com/politics/justice-department/several-top-fbi-officials-are-told-resign-face-demotion-trump-continue-rcna190095"
  },
  {
    "text": "Government Tech Workers Forced to Defend Projects to Random Elon Musk Bros  —  A recent high school graduate and former Neuralink intern has joined meetings to review lines of code and other work history of career public servants, sparking chaos at a major government agency.",
    "url": "https://www.wired.com/story/elon-musk-government-tech-workers-gsa-tts/"
  },
  {
    "text": "Trump Administration Orders Agencies to Find More DEI Workers to Ax  —  Government offices have cut dozens of positions and canceled millions of dollars in contracts  —  Trump administration officials are pressing federal agencies to dig deeper to find diversity workers to push out of the government … ",
    "url": "https://www.wsj.com/politics/policy/trump-administration-orders-agencies-to-find-more-dei-workers-to-ax-7b627c36?st=C86Rsx&reflink=desktopwebshare_permalink"
  }
]