[
  {
    "text": "Trump Delivers Historically Illiterate Lecture on Tariffs … Donald Trump has grown increasingly fixated on tariffs, which he seems to think, contrary to the consensus among economists, are borne by foreigners.  Trump understands at some level that economists and most business owners disagree with him … ",
    "url": "https://nymag.com/intelligencer/article/trump-tariffs-detroit-economic-club-history-revenue-smoot-hawley.html"
  },
  {
    "text": "Obama admonishes Black men for hesitancy in supporting Harris  —  Former president suggests some in the Black community are uncomfortable voting for a woman and are coming up with excuses  —  PITTSBURGH — Former president Barack Obama on Thursday made a direct, impassioned plea to black men … ",
    "url": "https://www.washingtonpost.com/politics/2024/10/10/obama-harris-rally-pittsburgh/"
  },
  {
    "text": "Taylor Lorenz leaves ‘Washington Post’ after rift with editors  —  When tech columnist Taylor Lorenz left the Washington Post last week, she did so with a splash: An interview with The Hollywood Reporter about launching her own digital magazine, called User Mag.",
    "url": "https://www.npr.org/2024/10/10/g-s1-27366/taylor-lorenz-leaves-washington-post-after-rift-with-editors"
  },
  {
    "text": "FCC chair denounces Trump's calls for CBS to ‘lose its license’ over Harris' ‘60 Minutes’ interview  —  New York CNN  —  Federal Communications Commission chairwoman Jessica Rosenworcel denounced former President Donald Trump's “threats against free speech” Thursday after he attacked CBS … ",
    "url": "https://www.cnn.com/2024/10/10/media/fcc-rosenworcel-trump-cbs-license-60-minutes/"
  },
  {
    "text": "Michigan Gov. Gretchen Whitmer feeds Doritos to left-wing influencer in deeply bizarre ‘communion’ video  —  DETROIT — Now that's weird.  —  Michigan Gov. Gretchen Whitmer raised eyebrows Thursday over a bizarre video in which she fed Doritos into the mouth of a liberal podcaster … ",
    "url": "https://nypost.com/2024/10/10/us-news/why-is-gretchen-whitmer-feeding-a-left-wing-influencer-doritos/"
  },
  {
    "text": "Battle for Swing States Is Tied, Trump Has Edge on Top Issues, WSJ Poll Shows  —  Voters prefer the Republican on economy and border security, but Harris still has a path to Electoral College win  —  WASHINGTON—Voters in the nation's seven battleground states see Donald Trump as better equipped … ",
    "url": "https://www.wsj.com/politics/elections/trump-harris-swing-state-poll-october-2024-c3ca9414"
  },
  {
    "text": "Federal judges decline to extend voter registration deadline in Georgia and Florida as states face hurricane damage  —  Two federal judges have rejected requests to immediately reopen voter registration in Georgia and Florida as the southeast continues to grapple with significant storm damage ahead of the November election.",
    "url": "https://www.cnn.com/2024/10/10/politics/georgia-florida-voter-registration-deadlines"
  },
  {
    "text": "Trump Says He Was ‘Man of the Year.’ His Source Says It Isn't True.  —  Fact-checkers have found no evidence over the years that former President Donald J. Trump once received the honor in Michigan.  —  Former President Donald J. Trump expressed irritation on Thursday that anyone would challenge … ",
    "url": "https://www.nytimes.com/2024/10/10/us/politics/trump-man-of-year.html"
  },
  {
    "text": "Behind the Curtain: The Republican welfare state … - This helps explain the massive surge in government spending under Trump, his continued opposition to trade agreements, his scorn for GOP ideas to gut Social Security and Medicare, and his us-vs.-them rhetoric.  —  Trump saw what establishment Republicans missed:",
    "url": "https://www.axios.com/2024/10/11/trump-welfare-government-aid-social-security"
  },
  {
    "text": "Trump's 2020 Fake Electors Are Now 2024 Electors — And State Officials Too  —  In swing states that didn't put in accountability measures, Republicans are elevating those who participated in the plot to overturn the 2020 election.  —  Jose Pagliery and  Byron Tau  — Copy",
    "url": "https://www.notus.org/trump-2024/fake-electors-2024-state-officials"
  },
  {
    "text": "In Texas' Third-Largest County, the Far Right's Vision for Local Governing Has Come to Life  —  From cutting social services to changing election rules, Tarrant County Judge Tim O'Hare has pushed his agenda with an uncompromising approach.  His term offers a rare look at what happens … ",
    "url": "https://www.propublica.org/article/tarrant-county-judge-tim-ohare-far-right"
  },
  {
    "text": "Gateway Pundit settles with Georgia election workers in defamation suit  —  The far-right publisher, which frequently reported false election-fraud claims, wrote repeatedly about Shaye Moss and her mother, Ruby Freeman.  —  The Gateway Pundit, a far-right news site that repeatedly published … ",
    "url": "https://www.washingtonpost.com/politics/2024/10/10/gateway-pundit-defamation-ruby-freeman/"
  },
  {
    "text": "2024 Nobel Peace Prize goes to Japanese organization Nihon Hidankyo for efforts against nuclear weapons  —  The Nobel Peace Prize for 2024 was awarded Friday to the Japanese organization Nihon Hidankyo, with the Nobel committee lauding the “grassroots movement of atomic bomb survivors … ",
    "url": "https://www.cbsnews.com/news/nobel-peace-prize-2024-nihon-hidankyo-japan-anti-nuclear-weapons/"
  },
  {
    "text": "Jim Jordan warns FTC to back off suing car dealer accused of overcharging Latinos  —  House Judiciary Committee chairman Jim Jordan (R-OH) fired off a warning shot at Federal Trade Commission chair Lina Khan, according to the New York Post: stop investigating civil rights matters.",
    "url": "https://www.rawstory.com/jim-jordan-2669376570/"
  },
  {
    "text": "Cards Against Humanity to pay swing-state non-voters to make a plan to vote  —  Cards Against Humanity (CAH) is jumping into the 2024 White House election by offering to pay blue-leaning non-voters in swing states to create a plan to vote.  —  The company behind the popular card game rolled … ",
    "url": "https://thehill.com/homenews/campaign/4927786-cards-against-humanity-to-pay-swing-state-non-voters-to-make-a-plan-to-vote/"
  },
  {
    "text": "The FBI conducted a sham investigation into Brett Kavanaugh.  Surprised?  —  The bureau shamefully allowed itself to be used as a prop in political theater, orchestrated by the Trump administration  —  Maybe it was always obvious that the whole thing was a sham.",
    "url": "https://www.theguardian.com/commentisfree/2024/oct/10/brett-kavanaugh-fbi-donald-trump-investigation-sham"
  },
  {
    "text": "Roger Stone Suggests Using ‘Armed Guards’ During Election in Secret Video  —  The Trump ally explains how to ensure the former president returns to office in undercover footage from liberal documentarian Lauren Windsor  —  DONALD TRUMP IS still mad he lost in 2020, and this year he and his allies … ",
    "url": "https://www.rollingstone.com/politics/politics-features/roger-stone-armed-guards-election-secret-audio-1235131014/"
  },
  {
    "text": "TD Bank Pleads Guilty to Bank Secrecy Act and Money Laundering Conspiracy Violations in $1.8B Resolution  —  For Immediate Release  —  WASHINGTON — TD Bank N.A. (TDBNA), the 10th largest bank in the United States, and its parent company TD Bank US Holding Company (TDBUSH) (together with TDBNA … ",
    "url": "https://www.justice.gov/opa/pr/td-bank-pleads-guilty-bank-secrecy-act-and-money-laundering-conspiracy-violations-18b"
  },
  {
    "text": "Republican Farmers Featured in Harris Ad Are Not Actors, Not Democrats  —  Este artículo estará disponible en español en El Tiempo Latino.  —  Quick Take  —  An ad from Vice President Kamala Harris features a Pennsylvania farming couple who say they are “lifelong Republicans” but are voting for Harris.",
    "url": "https://www.factcheck.org/2024/10/republican-farmers-featured-in-harris-ad-are-not-actors-not-democrats/"
  },
  {
    "text": "More than 3 million without power as Hurricane Milton slams Florida, causes deaths and flooding  —  Florida residents returned to the familiar ritual of assessing hurricane damage Thursday, the day after Milton smashed through many coastal communities and spawned a barrage of tornadoes … ",
    "url": "https://apnews.com/article/hurricane-milton-tampa-florida-5f6a112986eb6e21720f0f17c504afe8"
  }
]