[
  {
    "text": "U.S. oil production hit a record under Biden.  He seldom mentions it.  —  The politics of oil are particularly tricky for Democrats, whose chances for victory in next year's elections can hinge on whether young, climate-focused voters come out in big numbers.",
    "url": "https://www.washingtonpost.com/politics/2023/12/31/us-oil-production-has-hit-record-under-biden-he-hardly-mentions-it/"
  },
  {
    "text": "Playbook: The 3 unpredictable factors shaping 2024  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  It's finally here: the last day of a long, wild year in politics.  And now, we can all look forward to a very quiet, calm year that could (1) … ",
    "url": "https://www.politico.com/newsletters/playbook/2023/12/31/the-3-unpredictable-factors-shaping-2024-00133360"
  },
  {
    "text": "Former Trump White House insiders call possible 2nd term a threat to American democracy  —  “We don't need to speculate,” one told “This Week” co-anchor Jonathan Karl.  —  ABC's Jonathan Karl interviews Sarah Matthews, left, Cassidy Hutchinson, center, and Alyssa Farah Griffin, Dec. 15, 2023, in Washington.",
    "url": "https://abcnews.go.com/Politics/former-trump-white-house-insiders-call-2nd-term/story?id=105998679"
  },
  {
    "text": "Graham backtracks on earlier Jan. 6 criticism of Trump: ‘It depends on what the conduct is’  —  Sen. Lindsey Graham (R-S.C.) on Sunday appeared to backtrack on earlier criticism of former President Trump's actions on Jan. 6 and suggested, instead, that his presidential immunity defense was … ",
    "url": "https://thehill.com/homenews/senate/4383307-graham-backtracks-on-earlier-jan-6-criticism-of-trump-it-depends-on-what-the-conduct-is/"
  },
  {
    "text": "Comic legend Shecky Greene dies at 97  —  Shecky Greene, an entertainment legend whose very name became synonymous with stand-up comedy, has died.  He was 97.  —  Greene died at 3:21 a.m. Sunday at his home in Las Vegas of natural causes, confirmed by his wife of 41 years Marie Musso Green.",
    "url": "https://www.reviewjournal.com/entertainment/entertainment-columns/kats/comic-legend-shecky-greene-dies-at-97-2973752/"
  },
  {
    "text": "California law banning most firearms in public is taking effect as the legal fight over it continues  —  LOS ANGELES (AP) — A California law that bans people from carrying firearms in most public places will take effect on New Year's Day, even as a court case continues to challenge the law.",
    "url": "https://apnews.com/article/california-concealed-carry-gun-law-appeal-53136d83deba7cc74f908fffc4dd8106"
  },
  {
    "text": "The 14th Amendment is the ‘most democratic’ disqualifier, Jamie Raskin says  —  The Maryland Democrat said it is the only disqualifier over which the person has control.  —  The constitutional amendment that election officials in Colorado and Maine are relying on to block former President Donald Trump … ",
    "url": "https://www.politico.com/news/2023/12/31/14th-amendment-jamie-raskin-democratic-disqualifier-00133366"
  },
  {
    "text": "Led by Trump, GOP candidates take polarizing stances on race and history  —  The party's three leading candidates are speaking about history and race in polarizing and provocative ways that sometimes diverge from or distort the facts, some political strategists, experts and civil rights leaders said",
    "url": "https://www.washingtonpost.com/elections/2023/12/30/trump-desantis-haley-race-slavery/"
  },
  {
    "text": "Netanyahu says ‘many more months’ of war ahead  —  Israeli Prime Minister Benjamin Netanyahu is not letting up on his vow to destroy the militant group Hamas as he warns the war will continue for months.  —  Netanyahu said at a press conference Saturday there will be “many more months” … ",
    "url": "https://thehill.com/policy/international/4383443-netanyahu-says-many-more-months-of-war-ahead/"
  },
  {
    "text": "Roberts sidesteps Supreme Court's ethics controversies in yearly report  —  The Supreme Court will be tested in the coming weeks to untangle politically consequential legal questions with the potential to reshape the 2024 presidential election.  The court's reputation remains marred … ",
    "url": "https://www.washingtonpost.com/politics/2023/12/31/supreme-court-john-roberts-report/"
  },
  {
    "text": "Former U.S. Rep. Eddie Bernice Johnson, Black Democratic trailblazer, dies at 88  —  Johnson, the first Black woman elected to any seat in Dallas and the first Black Dallasite to serve in Congress, was a towering figure in Texas politics.  —  Retired U.S. Rep. Eddie Bernice Johnson has died, her family said Sunday on social media.",
    "url": "https://www.texastribune.org/2023/12/31/texas-eddie-bernice-johnson-dies/"
  },
  {
    "text": "The EU should support Ireland's bold move to regulate Big Tech  —  Dublin, Ireland, was stunned a month ago by riots that transformed its downtown into chaos, the worst rioting in decades, stemming from far-right online rumors about an attack on children. ",
    "url": "https://thehill.com/opinion/technology/4380369-the-eu-should-support-irelands-bold-move-to-regulate-big-tech/"
  },
  {
    "text": "In rare apology, Israeli minister says she ‘sinned’ for her role in reforms that tore country apart  —  Distel Atbaryan appeared to accept the argument that the internal divisions created perceptions of weakness that encouraged Hamas to attack.  —  JERUSALEM — A former member … ",
    "url": "https://www.politico.com/news/2023/12/31/apology-israeli-minister-sinned-for-her-role-in-reforms-that-tore-country-apart-00133369"
  },
  {
    "text": "Frustrated Dem Maverick Joe Lieberman Stumps for ‘No Labels’ Third Option to Political Parties  —  'I've never seen this much anger at the two major parties,' he said  —  Former Sen. Joe Lieberman continues to insist there's no time like the present to ditch both political parties' candidates and seriously consider another option.",
    "url": "https://themessenger.com/politics/frustrated-dem-maverick-joe-lieberman-stumps-for-no-labels-third-option-to-political-parties"
  }
]