[
  {
    "text": "Exclusive: Recordings describe 2020 Oval Office photo-op where Trump was briefed on fake electors and January 6  —  Before a group of supportive lawyers entered the Oval Office for a photo-op with then-President Donald Trump in December 2020, they were given a clear instruction … ",
    "url": "https://www.cnn.com/2023/12/13/politics/trump-2020-oval-office-fake-electors-recordings/"
  },
  {
    "text": "Lawyer Fani Willis calls proposed pause on Trump's election case ‘silly notion’  —  Fulton County District Attorney Fani Willis rejected the idea that her prosecution of Donald Trump could amount to election interference.  Willis, who obtained a sweeping indictment against Trump and 18 others in August, is seeking an August trial date.",
    "url": "https://apnews.com/article/fani-willis-trump-2020-election-indictment-georgia-de77f102a0747f9c65ed874a1f0612c0"
  },
  {
    "text": "Supreme Court will review scope of obstruction law that Trump is charged with breaking  —  The case calls into question prosecutors' handling of an Enron-era obstruction law to punish those who stormed Congress.  —  The Supreme Court has agreed to take up a case that could derail hundreds … ",
    "url": "https://www.politico.com/news/2023/12/13/supreme-court-will-review-scope-of-obstruction-law-that-trump-is-charging-with-breaking-00131514"
  },
  {
    "text": "Checks and Balances Won't Stop Trump  —  The Constitution's protections won't be able to block his abuses of executive power.  —  As we approach the 2024 primaries, some Republicans have begun arguing that the checks and balances constructed by the framers of our Constitution … ",
    "url": "https://www.wsj.com/articles/liz-cheney-checks-and-balances-wont-stop-trump-abuse-of-power-jan-6-second-term-219cc7b7?mod=followamazon"
  },
  {
    "text": "Trump Said Too Much Too Soon  —  DONALD TRUMP HAS CHOSEN to make “dictator” his brand.  No one made him do it.  But the fact that he did, eleven months before the election, is a good thing.  —  Trump's plans to destroy our foundational checks and balances and rule as a king hadn't penetrated … ",
    "url": "https://plus.thebulwark.com/p/trump-said-too-much-too-soon-dictator"
  },
  {
    "text": "Biden impeachment inquiry authorized by House Republicans, despite lack of evidence  —  The U.S. House of Representatives voted on Wednesday to formally authorize its ongoing impeachment inquiry into President Joe Biden, as Republicans unite behind the effort even though they have yet to find evidence of wrongdoing by the Democrat.",
    "url": "https://www.reuters.com/world/us/us-house-republicans-ready-vote-formalize-biden-impeachment-inquiry-2023-12-13/"
  },
  {
    "text": "Republican Senators Say They're Weighing Biden's Immigration Offer  —  President Joe Biden has offered changes to US border policy that raises the prospects of a bipartisan deal on immigration and aid to Ukraine, Republican senators said Wednesday.  —  Republicans met behind closed doors … ",
    "url": "https://www.bloomberg.com/news/articles/2023-12-13/republican-senators-say-they-re-weighing-biden-immigration-offer"
  },
  {
    "text": "A revealing exchange on the GOP's speculative impeachment inquiry  —  It's perhaps a little too simplistic to cast the impeachment inquiry of President Biden, which the House will vote to formalize Wednesday, as a “Seinfeld”-ian impeachment “about nothing.”  —  Republicans have at the very … ",
    "url": "https://www.washingtonpost.com/politics/2023/12/13/republican-impeachment-case-analysis/"
  },
  {
    "text": "GOP Rep. Explains Impeachment Push: ‘Donald J. Trump 2024, Baby!’  —  In video obtained by Rolling Stone, Troy Nehls touted Trump returning to the White House when asked what Republicans have to gain from a Biden impeachment inquiry … The party has struggled to gin up a legitimate rationale … ",
    "url": "https://www.rollingstone.com/politics/politics-news/troy-nehls-biden-impeachment-inquiry-donald-trump-2024-1234927472/"
  },
  {
    "text": "Hunter Biden flouts subpoena for closed-door testimony, demanding to testify publicly: ‘I am here’  —  President Joe Biden's son Hunter Biden defied Republican investigators' subpoena for closed-door testimony, demanding to testify publicly Wednesday.  —  In his first public statement since … ",
    "url": "https://www.cnn.com/2023/12/13/politics/hunter-biden-capitol-hill/"
  },
  {
    "text": "Federal appeals court denies Trump's presidential immunity defense in E. Jean Carroll case  —  The 2nd U.S. Circuit Court of Appeals found Trump's lawyers waited too long - three years - to try to use the defense for his upcoming civil trial.  —  A federal appeals court on Wednesday shot … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/federal-appeals-court-denies-trumps-presidential-immunity-defense-e-je-rcna129521"
  },
  {
    "text": "Tesla recalls nearly all vehicles sold in US to fix system that monitors drivers using Autopilot  —  Tesla is recalling nearly all vehicles sold in the U.S., more than 2 million, to update software and fix a defective system that's supposed to ensure drivers are paying attention when using Autopilot.",
    "url": "https://apnews.com/article/tesla-autopilot-recall-driver-monitoring-system-8060508627a34e6af889feca46eb3002"
  },
  {
    "text": "Fox Board Member Paul Ryan Slams Trump, Hails Cheney and Kinzinger: 'Trump's Not a Conservative, He's an Authoritarian Narcissist'  —  Former House Speaker Paul Ryan tore into Donald Trump in a recent interview, denouncing the former president as an “authoritarian narcissist,” … ",
    "url": "https://www.mediaite.com/news/fox-board-member-paul-ryan-slams-trump-hails-cheney-and-kinzinger-trumps-not-a-conservative-hes-an-authoritarian-narcissist/"
  },
  {
    "text": "Supreme Court will decide access to key abortion drug mifepristone  —  The Supreme Court announced Wednesday that it will decide this term whether to limit access to a key abortion drug, returning the polarizing issue of reproductive rights to the high court for the first time since … ",
    "url": "https://www.washingtonpost.com/politics/2023/12/13/abortion-drug-supreme-court-mifepristone-fda/"
  },
  {
    "text": "One US Marine Dead, Dozen More Hospitalized After Training Accident in California  —  The Marines were traveling in an amphibious combat vehicle, designed to operate on the sea and on land, at the time of the accident  —  A United States Marine is dead while more than a dozen others were taken … ",
    "url": "https://themessenger.com/news/marine-dead-dozen-hospitalized-training-accident-camp-pendleton-california"
  },
  {
    "text": "Contraception is a winning issue, conservative strategists tell GOP  —  Former Trump confidante Kellyanne Conway and other strategists are citing poll data showing strong demand among GOP voters for birth control after the fall of Roe.  —  Kellyanne Conway is going to Capitol Hill on Wednesday … ",
    "url": "https://www.politico.com/news/2023/12/13/kellyanne-conway-contraception-republicans-2024-00131410"
  },
  {
    "text": "White House turns focus to states in latest push to curb gun violence  —  The White House on Wednesday announced a new plan to assist states in curbing gun violence, turning the attention to the local level with the hope of further federal gun-control legislation fading.",
    "url": "https://www.washingtonpost.com/politics/2023/12/13/white-house-harris-gun-laws-states/"
  },
  {
    "text": "Scoop: U.S. delaying sale of M16 rifles to Israel over settler violence  —  The Biden administration is again holding up the licenses for selling more than 20,000 U.S.-made rifles to Israel over concerns about attacks by extremist Israeli settlers against Palestinian civilians in the occupied West Bank, two U.S. officials told Axios.",
    "url": "https://www.axios.com/2023/12/13/us-israel-rifle-sale-delay-west-bank-violence"
  },
  {
    "text": "Inside the Troll Army Waging Trump's Online Campaign  —  A team of meme-makers has been flooding social media with pro-Trump posts riddled with sexist and racist tropes.  Donald Trump is cheering them on.  —  The video, called “Let's Get Ready to Bumble,” is a slick mash … ",
    "url": "https://www.nytimes.com/2023/12/13/us/politics/trump-meme-trolls-2024.html"
  }
]