[
  {
    "text": "Special counsel probe uncovers new details about Trump's inaction on Jan. 6: Sources  —  Aides allegedly said Trump was “not interested” in doing more to stop the riot.  —  In a video message posted to Twitter on the afternoon of Jan. 6, 2021, President Donald Trump addresses supporters participating in the attack on the U.S. Capitol.",
    "url": "https://abcnews.go.com/US/special-counsel-probe-uncovers-new-details-trumps-inaction/story?id=106131854"
  },
  {
    "text": "‘Piece Of S**t’: Meghan McCain Rips Trump For Mocking Her Late Father  —  McCain criticized the former president for dishing out another attack at the late senator.  —  LOADING  —  Meghan McCain slammed former President Donald Trump for mocking her late father, Sen. John McCain (R-Ariz.) … ",
    "url": "https://www.huffpost.com/entry/meghan-mccain-trump-john-mccain-injuries_n_659a24d0e4b0bfe5ff636f22"
  },
  {
    "text": "How the GOP Became the Party of Insurrection  —  Three years after 1/6, the GOP reembraced the Big Lie out of cowardice and convenience  —  Three years ago, a mob of rioters, militia members, and political tourists violently stormed the United States Capitol for the express purpose … ",
    "url": "https://www.messageboxnews.com/p/how-the-gop-became-the-party-of-insurrection"
  },
  {
    "text": "Trump engaged in insurrection three years ago today.  The Supreme Court must say so.  —  I told my family and out-of-town friends on Jan. 6, 2021, that the people invading Capitol were more than three miles away and I was safe in my apartment in Dupont Circle.  —  “People are still using the dog park!”",
    "url": "https://www.lawdork.com/p/trump-insurrection-scotus"
  },
  {
    "text": "Lauren Boebert's Ex Called The Cops After Physical Fight in Public on Saturday Night  —  Police confirmed an “active investigation” into the incident, while a Boebert aide told The Daily Beast that the congresswoman was acting in self-defense. … On Saturday night, three years … ",
    "url": "https://www.thedailybeast.com/lauren-boeberts-ex-husband-jayson-called-the-cops-after-physical-fight-in-public"
  },
  {
    "text": "Silt police investigating incident involving U.S. Rep. Lauren Boebert and her ex-husband  —  The Silt Police Department is investigating a Saturday night incident at a restaurant involving U.S. Rep. Lauren Boebert and her ex-husband Jayson Boebert.  —  Silt police Chief Mike Kite confirmed … ",
    "url": "https://www.denverpost.com/2024/01/07/lauren-boebert-ex-husband-jayson-police-silt-colorado-restaurant/"
  },
  {
    "text": "GOP Rep. Elise Stefanik won't commit to certifying the 2024 election results  —  “We will see if this is a legal and valid election,” Stefanik, a member of House GOP leadership and Donald Trump ally, said in an interview with “Meet the Press.”  —  Rep. Elise Stefanik, R-N.Y., on Sunday … ",
    "url": "https://www.nbcnews.com/politics/2024-election/republican-elise-stefanik-wont-commit-certifying-2024-election-results-rcna132700"
  },
  {
    "text": "Johnson calls description of him as an election denier ‘nonsense,’ but won't say Biden won  —  The Constitution was “clearly violated during the 2020 election,” the Louisiana Republican said.  —  House Speaker Mike Johnson called suggestions that he is an election denier “nonsense,” … ",
    "url": "https://www.politico.com/news/2024/01/07/johnson-election-denier-nonsense-biden-2020-election-00134184"
  },
  {
    "text": "Johnson defends Trump's ‘poisoning’ immigrant remark: 'It's not hateful'  —  House Speaker Mike Johnson (R-La.) defended former President Trump's “poisoning the blood” remarks, arguing that while he would not use the language himself, he understands the “urgency” of Trump's warning about immigration.",
    "url": "https://thehill.com/homenews/house/4393941-johnson-defends-trumps-poisoning-immigrant-remark-its-not-hateful/"
  },
  {
    "text": "The Lloyd Austin fallout is growing: 'Someone's head has to roll'  —  The defense chief is facing criticism for keeping his bosses in the dark.  —  At a White House meeting last week, Jake Sullivan, the national security adviser, noticed that Defense Secretary Lloyd Austin was absent.",
    "url": "https://www.politico.com/news/2024/01/07/biden-stands-by-austin-as-befuddled-white-house-handles-secret-hospitalization-fallout-00134182"
  },
  {
    "text": "Deputy defense secretary was not told Austin had been hospitalized when she assumed his duties  —  When the deputy secretary of defense began assuming some of Secretary of Defense Lloyd Austin's responsibilities on January 2, not even she knew that it was because Austin was hospitalized, two defense officials told CNN.",
    "url": "https://www.cnn.com/2024/01/07/politics/austin-hospitalization-leaders-not-informed/"
  },
  {
    "text": "Elon Musk Has Used Illegal Drugs, Worrying Leaders at Tesla and SpaceX  —  Some executives and board members fear the billionaire's use of drugs—including LSD, cocaine, ecstasy, mushrooms and ketamine—could harm his companies  —  Elon Musk and his supporters offer several explanations … ",
    "url": "https://www.wsj.com/business/elon-musk-illegal-drugs-e826a9e1?mod=followamazon"
  },
  {
    "text": "Investigators seek fallen Alaska Airlines door plug, ask for public's help  —  NTSB experts arrived on Saturday to investigate Alaska Airlines Flight 1282.  —  Alaska Airlines N704AL, a 737 Max 9 which made an emergency landing at Portland International Airport after a part … ",
    "url": "https://abcnews.go.com/US/investigators-seek-fallen-alaska-airlines-door-plug-publics/story?id=106164683"
  },
  {
    "text": "Pressured by record migrant crossings, White House weighs tough concession in border talks with Congress  —  Pressured by the record levels of migrant crossings reported in December, the Biden administration is weighing whether to restrict a key presidential immigration authority … ",
    "url": "https://www.cbsnews.com/news/border-talks-congress-white-house-tough-concessions-record-migrant-crossings/"
  },
  {
    "text": "Clyburn concerned Biden campaign isn't breaking through ‘MAGA wall’  —  Rep. Jim Clyburn (D-S.C.) said on Sunday he was concerned the Biden campaign was not breaking through “MAGA wall,” in a reference to former President Trump's unwavering support from Republicans heading into 2024.",
    "url": "https://thehill.com/homenews/house/4394023-clyburn-concerned-biden-campaign-isnt-breaking-through-maga-wall/"
  }
]