[
  {
    "text": "Kamala Harris' Support Among Republicans Almost Doubles: NYT-Siena Poll  —  in November has nearly doubled over the past month according to a major new survey from  —  .  —  It found nine percent of likely voters who describe themselves as  —  plan to back the Democratic candidate in November … ",
    "url": "https://www.newsweek.com/kamala-harris-support-among-republicans-almost-doubles-nyt-siena-poll-1965611"
  },
  {
    "text": "Romney Won't Endorse Harris, Saying He Wants to Keep His Voice in the Party  —  Senator Mitt Romney of Utah, the 2012 Republican nominee for president, says the party may need to be rebuilt.  —  Senator Mitt Romney, the retiring Republican from Utah and onetime standard-bearer of a party … ",
    "url": "https://www.nytimes.com/2024/10/08/us/politics/mitt-romney-trump-harris.html"
  },
  {
    "text": "Trump Lashes Out After Damning Report on His Close Ties to Putin  —  Donald Trump's campaign team is lashing out against a journalist following news that the former president secretly kept in touch with Russian President Vladimir Putin after leaving the Oval Office.",
    "url": "https://newrepublic.com/post/186915/trump-team-reaction-woodward-report-close-ties-putin"
  },
  {
    "text": "Trump thrusts hurricane response into center of 2024 campaign  —  Even some Republicans are debunking his claims.  —  As many across the southeast struggle to dig out from Hurricane Helene and with Florida now bracing for Hurricane Milton, Donald Trump is making the storms a flashpoint in the presidential race.",
    "url": "https://www.politico.com/news/2024/10/08/trump-hurricane-response-2024-campaign-00182960"
  },
  {
    "text": "Elon Musk Is Now Seizing Other People's Twitter Accounts To Promote Donald Trump  —  How quickly do you think we'd be having Congressional hearings about “election interference” if Mark Zuckerberg so much as posted a “Harris/Walz” lawn sign in front of his house?",
    "url": "https://www.techdirt.com/2024/10/08/elon-musk-is-now-seizing-other-peoples-twitter-accounts-to-promote-donald-trump/"
  },
  {
    "text": "FBI arrests Afghan man who officials say planned Election Day attack in the US  —  The FBI has arrested an Afghan man who officials say was inspired by the Islamic State militant organization and was plotting an Election Day attack targeting large crowds in the U.S., the Justice Department said Tuesday.",
    "url": "https://apnews.com/article/fbi-afghanistan-justice-department-election-2e13aac1b28342be32513eaf58212ada"
  },
  {
    "text": "Walz says the Electoral College ‘needs to go’  —  The Minnesota governor hasn't been shy about his support for making the popular vote king.  —  Gov. Tim Walz made a new push for booting the Electoral College in favor of a national popular vote, as Democrats are again wary of a scenario … ",
    "url": "https://www.politico.com/news/2024/10/08/walz-says-the-electoral-college-needs-to-go-00182981"
  },
  {
    "text": "Scoop: Senate Democrats go to war over GOP ad spending loophole … - The FEC will decide this week if one GOP strategy can keep going, with a vote expected Thursday.  — People who closely follow the commission tell Axios the expectation is for the vote to split along party lines … ",
    "url": "https://www.axios.com/2024/10/09/senate-democrats-republicans-campaign-finance-ads"
  },
  {
    "text": "Whitehouse Unveils Report Examining Failures of Supplemental Background Investigation of Justice Brett Kavanaugh  —  New report details how the Trump White House restricted FBI investigators and lied to the American people about the investigation and tip line.",
    "url": "https://www.whitehouse.senate.gov/news/release/whitehouse-unveils-report-examining-failures-of-supplemental-background-investigation-of-justice-brett-kavanaugh/"
  },
  {
    "text": "‘Eternally sorry’: Journalist confesses his biggest error in covering ‘buffoon’ Trump  —  Former President Donald Trump's behavior has been enabled by a mainstream press that “never took him seriously,” Lucian Truscott wrote for Salon on Tuesday in a damning indictment of the media's enabling … ",
    "url": "https://www.rawstory.com/donald-trump-normalized/"
  },
  {
    "text": "Ethel Kennedy, widow of Robert F. Kennedy, hospitalized after suffering stroke, family says  —  Ethel Kennedy, a social justice advocate and the widow of late U.S. Attorney General Robert F. Kennedy, is recovering in a hospital after suffering a stroke last week, her grandson said in a statement.",
    "url": "https://thehill.com/homenews/media/4923264-ethel-kennedy-hospitalized-suffering-stroke/"
  },
  {
    "text": "Florida Meteorologist Explains Why He Broke Down During Hurricane Report  —  ‘I HAVE CHANGED’  —  NBC's John Morales, who has been covering storms for more than three decades, said that global warming has changed him.  —  South Florida NBC meteorologist John Morales explained … ",
    "url": "https://www.thedailybeast.com/florida-meteorologist-explains-why-he-broke-down-during-hurricane-milton-report"
  },
  {
    "text": "As a hurricane threatens, White House helps Americans text-to-find shelter  —  Good evening from Washington, where I'm digesting another good fall day spent at Howard University participating in the third Democracy Summit convened by the Center for Journalism and Democracy.",
    "url": "https://civic-texts.ghost.io/as-a-hurricane-threatens-white-house-helps-americans-text-to-find-shelter/"
  },
  {
    "text": "‘60 Minutes’ Has Some Explaining to Do After Eye-Opening Edit Discovered on a Kamala Harris Word Salad  —  We wrote earlier about how the much-anticipated “60 Minutes” interview with Vice President Kamala Harris didn't do her any favors considering it a) further proved points her critics … ",
    "url": "https://redstate.com/sister-toldjah/2024/10/08/60-minutes-edits-to-kamala-harris-word-salad-n2180320"
  },
  {
    "text": "The latest union snub for Harris and Walz underscores a bigger problem for their campaign  —  Even with a union member on the presidential ticket, Democrats are struggling to hold back a changing cultural tide.  —  It was a viral moment for a campaign that needed one: A chorus … ",
    "url": "https://www.politico.com/news/2024/10/08/tim-walz-union-snubs-00182961"
  },
  {
    "text": "Expert: Analysis shows Trump tax plan “taking money” from bottom 95% and “giving it” to richest 5%  —  “This is an enormously redistributive tax plan from low- and middle-income families to the wealthiest Americans”  —  Former President Donald Trump's proposed tax plan would create tax cuts … ",
    "url": "https://www.salon.com/2024/10/08/expert-analysis-shows-plan-taking-money-from-bottom-95-and-giving-it-to-richest-5/"
  },
  {
    "text": "Vance and Walz press corps revive a tradition on their campaign planes  —  Candidates answered questions rolled up the aisle to them on an orange.  —  US Senator and Republican vice presidential candidate J.D. Vance (L) and Minnesota Governor and Democratic vice presidential candidate Tim Walz shake hands … ",
    "url": "https://abcnews.go.com/Politics/vance-walz-press-corps-revive-tradition-campaign-planes/story?id=114624028"
  },
  {
    "text": "What Will Happen If Trump Wins the 2024 Election?  —  And why it matters in 2024. … Former President Donald Trump has threatened a campaign of retribution if he returns to the White House, signaling that he will seek to prosecute rivals and enemies while stocking a second administration with loyalists who will carry out his wishes.",
    "url": "https://www.nytimes.com/2024/10/08/us/politics/trump-2024-election-democracy.html"
  },
  {
    "text": "I'm Behind the Trump-Russia Dossier.  We Gave the FBI More Than People Know  —  My wife Katherine called me up to the bedroom and told me that BuzzFeed had published our memos: The so-called “dossier” on  —  .  —  It was the night of January 10, 2017.  The publication of the news story … ",
    "url": "https://www.newsweek.com/christopher-steele-trump-russia-putin-election-dossier-fbi-1963717"
  },
  {
    "text": "Rashid Khalidi, America's foremost scholar of Palestine, is retiring: 'I don't want to be a cog in the machine any more'  —  As the Columbia University professor steps down, he addresses student protests, links between Ireland and Palestine and how ‘higher education has developed into a hedge fund’",
    "url": "https://www.theguardian.com/world/ng-interactive/2024/oct/08/rashid-khalidi-palestine-israel-scholar-columbia-university-retires"
  },
  {
    "text": "Daughters to dads who support Trump: ‘You chose him over me’  —  The anti-Donald Trump group, The Lincoln Project, is out with a new digital ad that's focused on abortion and access to reproductive health care.  —  The ad comes as the former president has been trying to thread a divide between … ",
    "url": "https://www.nj.com/politics/2024/10/daughters-to-dads-who-support-trump-you-chose-him-over-me.html"
  },
  {
    "text": "Google's new phones can't stop phoning home (permalink)  —  One of the most brazen lies of Big Tech is that people like commercial surveillance, a fact you can verify for yourself by simply observing how many people end up using products that spy on them.  If they didn't like spying, they wouldn't opt into being spied on.",
    "url": "https://pluralistic.net/2024/10/08/water-thats-not-wet/#pixelated"
  },
  {
    "text": "John Roberts remains confounded by Donald Trump as election approaches  —  From the moment he was confirmed in 2005, Chief Justice John Roberts made it his mission to differentiate the Supreme Court from the political branches.  Yet, the court is ensnared in politics perhaps more than ever - and by the chief's own hand.",
    "url": "https://www.cnn.com/2024/10/08/politics/john-roberts-donald-trump-biskupic/"
  },
  {
    "text": "‘If meteorologists could stop hurricanes, we would.’ Here's why humans still can't control the weather  —  Hurricanes are humanity's reminder of the uncontrollable, chaotic power of Earth's weather.  —  Milton's powerful push toward Florida just days after Helene devastated large parts … ",
    "url": "https://www.pbs.org/newshour/science/if-meteorologists-could-stop-hurricanes-we-would-heres-why-humans-still-cant-control-the-weather"
  },
  {
    "text": "Kamala Harris Has a Numbers Problem in Arizona  —  Harris supporters, aware of the tough odds, are reaching out to independents and moderate Republicans in Arizona as they hope enough cross party lines.  — Copy  —  NEW RIVER, AZ — Donald Trump has a math advantage in Arizona.",
    "url": "https://www.notus.org/harris-2024/kamala-harris-arizona-campaign"
  }
]