[
  {
    "text": "Trump's Bizarre Moments With Dr. Phil and Hannity Should Alarm Us All  —  During just this week, two of Donald Trump's friendliest interviewers handed him big prime-time opportunities to unequivocally renounce any intention to retaliate against Democrats for his criminal conviction by a jury of his peers in Manhattan.",
    "url": "https://newrepublic.com/article/182480/trump-dr-phil-hannity-bizarre-moments-alarm"
  },
  {
    "text": "It's Simple: Trump Is Treated Like a Criminal Because He's a Criminal … You are, I'm sure, familiar with Occam's razor.  It's the old philosophical theorem that holds that the simplest explanation for an event, the one requiring the fewest assumptions, is probably the best explanation.",
    "url": "https://newrepublic.com/post/182437/treat-trump-like-criminal-democrats"
  },
  {
    "text": "Trump loyalist pushes ‘post-constitutional’ vision for second term  —  Russ Vought, the former president's budget director, is laying the groundwork for a broad expansion of presidential powers.  —  A battle-tested D.C. bureaucrat and self-described Christian nationalist is drawing … ",
    "url": "https://www.washingtonpost.com/politics/2024/06/08/russ-vought-trump-second-term-radical-constitutional/"
  },
  {
    "text": "‘That 10 percent is important’: Trump forgoes moderates to juice the base after his conviction  —  The former president is intensifying his post-conviction rhetoric, even as a majority of Americans say he got a fair trial.  —  In the days since his criminal conviction in New York … ",
    "url": "https://www.politico.com/news/2024/06/08/trump-rhetoric-post-conviction-00162365"
  },
  {
    "text": "Israel rescues 4 hostages taken in Hamas' Oct. 7 attack.  At least 94 Palestinians are killed  —  Rescued Israeli hostages Andrey Kozlov and Almog Meir Jan arrived by helicopter at Sheba Medical Centre in Ramat Gan on Saturday.  Israel said it had rescued four hostages who were kidnapped in the Hamas-led attack on October 7.",
    "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-8-6-2024-a5d1ef04763a5ed17de2d050ebc5d490"
  },
  {
    "text": "Trump Vows to Lower Prices.  Some of His Policies May Raise Them.  —  Donald J. Trump has not released a detailed economic plan.  But three of his key proposals would push prices up, economists say.  —  Supporters cheered for former President Donald J. Trump at a campaign rally in Wildwood … ",
    "url": "https://www.nytimes.com/2024/06/08/us/politics/trump-2025-inflation.html"
  },
  {
    "text": "Trump plans to claim sweeping powers to cancel federal spending  —  In a second term, allies said the former president would look at unilateral funding cuts for the World Health Organization and green energy initiatives.  —  Donald Trump is vowing to wrest key spending powers from Congress … ",
    "url": "https://www.washingtonpost.com/business/2024/06/07/trump-budget-impoundment-congress/"
  },
  {
    "text": "Demons: The Greek Tragedy of America's Hunter Biden Addiction  —  While Hunter Biden's team hasn't officially decided whether he will take the stand, I'm confident we have seen the last witness testimony in the trial.  The testimony might lead to a split verdict from the jury … ",
    "url": "https://www.emptywheel.net/2024/06/08/demons-the-greek-tragedy-of-americas-hunter-biden-addiction/"
  },
  {
    "text": "Controversial Lawmaker Nancy Mace Fights for Her Political Life  —  ‘I owe Washington nothing,’ says South Carolina congresswoman as Kevin McCarthy's allies seek payback for his ouster  —  WASHINGTON—Rep. Nancy Mace says she is fighting a lonely battle.  She faces a tough Republican primary challenge … ",
    "url": "https://www.wsj.com/politics/policy/controversial-lawmaker-nancy-mace-fights-for-her-political-life-61d029a8"
  },
  {
    "text": "Playbook: 3 non-Trump trials Dems want to talk about  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  THE OTHER TRIALS — While the federal cases against DONALD TRUMP in Florida (violating the Espionage Act, making false statements and obstruction of justice) … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/06/08/3-non-trump-trials-dems-want-to-talk-about-00162396"
  },
  {
    "text": "If Trump Wins  —  Mr. Trump's top immigration adviser, Stephen Miller, said that a second Trump administration would seek a tenfold increase in the volume of deportations — to more than a million per year.  —  2. Increase the number of agents for ICE raids",
    "url": "https://www.nytimes.com/interactive/2024/06/07/us/politics/trump-policy-list-2025.html"
  },
  {
    "text": "Biden's Cabinet moonlights for campaign cash … - The moonlighting secretaries — Transportation Secretary Pete Buttigieg and Commerce Secretary Gina Raimondo are particularly active — give donors what many desperately crave: An inside view of how Biden's team plans to prevent Donald Trump from returning to the White House.",
    "url": "https://www.axios.com/2024/06/08/biden-cabinet-moonlights-campaign-cash-buttigieg-raimondo"
  },
  {
    "text": "Revealed: Trump ally Kari Lake gave speech in front of Confederate flag  —  Video shows Arizona Senate candidate repeating election-fraud claims at event with Confederate flag behind her  —  The Republican Senate candidate Kari Lake addressed supporters with a Confederate flag displayed behind … ",
    "url": "https://www.theguardian.com/us-news/article/2024/jun/07/kari-lake-confederate-flag"
  },
  {
    "text": "How to cover an abnormal presidential race  —  Could the media coverage adhere closer to reality?  Hard questions must be asked. … This week, I look at the challenge of covering a presidential campaign, in which a major political party plans to nominate a felon.",
    "url": "https://www.washingtonpost.com/opinions/2024/06/07/coverage-abnormal-campaign-2024/"
  }
]