[
  {
    "text": "Truth Social launches scheme to profit from Trump's tariff policies  —  The signature economic policy of President Trump's second term has been tariffs, which Trump has imposed, frozen, and revised haphazardly.  On April 2, which Trump dubbed “Liberation Day,” Trump imposed “reciprocal” … ",
    "url": "https://popular.info/p/truth-social-launches-scheme-to-profit"
  },
  {
    "text": "Why Trump Will Lose His Trade War  —  Scenes from the trade war:  — In response to Donald Trump's huge tariffs on Chinese exports, China's government has suspended exports of rare earth minerals and magnets, both critical to many modern industries and the military",
    "url": "https://paulkrugman.substack.com/p/why-trump-will-lose-his-trade-war"
  },
  {
    "text": "Just landed in El Salvador to discuss release of Kilmar Abrego Garcia  —  I just landed in San Salvador a little while ago, and I look forward to meeting with the team at the U.S. embassy to discuss the release of Mr. Abrego Garcia...",
    "url": "https://youtube.com/shorts/e2MfhRBoZfc?feature=share"
  },
  {
    "text": "Law Firms Made Deals With Trump.  Now He Wants More From Them.  —  To avoid retribution, big firms agreed to provide free legal services for uncontroversial causes.  To the White House, that could mean negotiating trade deals — or even defending the president and his allies.",
    "url": "https://www.nytimes.com/2025/04/16/us/politics/law-firms-deals-trump.html"
  },
  {
    "text": "Van Hollen speaks to press after meeting with El Salvador VP about return of Kilmar Abrego Garcia  —  Van Hollen speaks to press from El Salvador after meeting with El Salvador Vice President Félix Ulloa about return of wrongly deported Marylander Kilmar Abre...",
    "url": "https://www.youtube.com/live/pYZPzHyCtt0?si=D-7lJLKyE6SH_suO"
  },
  {
    "text": "Trump's D.C. U.S. attorney pick appeared on Russian state media over 150 times  —  Trump nominee Ed Martin's 100-plus appearances on Russian state-directed media RT and Sputnik from 2016 to 2024 alarm some former national security officials.",
    "url": "https://www.washingtonpost.com/dc-md-va/2025/04/16/ed-martin-rt-sputnik-usattorney/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ0Nzc2MDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ2MTU4Mzk5LCJpYXQiOjE3NDQ3NzYwMDAsImp0aSI6IjU1ODE1YjIxLTI4MjAtNDE4OS1iZWZjLWEyOTZhZWYxMTdjYSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9kYy1tZC12YS8yMDI1LzA0LzE2L2VkLW1hcnRpbi1ydC1zcHV0bmlrLXVzYXR0b3JuZXkvIn0.QRfSgCDxA5HE2Rw8h7pdkgTdJYXfUccsdIqorsufXQI&itid=gfta"
  },
  {
    "text": "Trump dashed Musk's secret Pentagon briefing on China  —  Beyond tariffs and court battles over Trump policies, two pieces of White House palace intrigue emerged Tuesday:  — Defense Secretary Pete Hegseth suspended two top Pentagon officials, Dan Caldwell and Darin Selnick … ",
    "url": "https://www.axios.com/2025/04/16/trump-block-elon-musk-pentagon-briefing-china"
  },
  {
    "text": "Inside Democrats' scramble to travel to El Salvador  —  Democrats are rushing to organize trips to El Salvador as President Trump refuses to comply with a Supreme Court order to facilitate the return of a Maryland resident who was erroneously deported to the country.",
    "url": "https://www.axios.com/2025/04/16/democrats-el-salvador-trump-deportation-cecot"
  },
  {
    "text": "Legal definition of woman is based on biological sex, UK supreme court rules  —  Judges say Equality Act definition excludes transgender women, after gender-critical campaigners' challenge  —  The UK supreme court has ruled that the terms “woman” and “sex” in the Equality Act refer … ",
    "url": "https://www.theguardian.com/society/2025/apr/16/critics-of-trans-rights-win-uk-supreme-court-case-over-definition-of-woman"
  },
  {
    "text": "Trump administration likely acted in contempt of court by not turning around deportation flights, judge says  —  Judge James Boasberg had ordered the flights to be returned.  —  President Donald Trump meets with El Salvador President Nayib Bukele in the Oval Office at the White House in Washington, April 14, 2025.",
    "url": "https://abcnews.go.com/Politics/trump-administration-acted-contempt-court-turning-deportation-flights/story?id=120870498"
  },
  {
    "text": "Federal judge calls Trump's order targeting prominent law firm a ‘shocking abuse of power’  —  Trump, three months into his term, has moved swiftly to use the powers of the presidency in unprecedented ways to punish, weaken and silence his enemies, experts say.",
    "url": "https://www.nbcnews.com/politics/justice-department/federal-judge-calls-trumps-order-targeting-prominent-law-firm-shocking-rcna200961"
  },
  {
    "text": "US office that counters foreign disinformation is being eliminated  —  The only office within the US State Department that monitors foreign disinformation is to be eliminated, according to US Secretary of State Marco Rubio, confirming reporting by MIT Technology Review.",
    "url": "https://www.technologyreview.com/2025/04/16/1115256/us-office-that-counters-foreign-disinformation-is-being-eliminated-say-officials/"
  },
  {
    "text": "Inside the Mind of an ICE Agent  —  Is this what she signed up for?  —  ∙ Paid  —  Quick update: Yesterday it was reported Cory Booker is joining Chris Van Hollen in going to El Salvador.  John Lewis would be proud.  This is good trouble; necessary trouble.  —  1. Choices",
    "url": "https://www.thebulwark.com/p/inside-the-mind-of-an-ice-agent"
  },
  {
    "text": "Riggs on track to win NC Supreme Court race  —  Based on a court filing from the North Carolina State Board of Elections, Democratic Supreme Court Justice will defeat Republican Court of Appeals Judge Jefferson Griffin.  —  ∙ Paid  —  Democratic Supreme Court Justice Allison Riggs … ",
    "url": "https://andersonalerts.substack.com/p/riggs-supreme-court-win-approaching"
  },
  {
    "text": "Schumer Moves to Block Trump Picks for Two Key Prosecutor Positions  —  An arcane Senate tradition effectively gives senators veto power over nominees for U.S. attorney in their home states, providing Democrats a potential opening to stop President Trump's picks.",
    "url": "https://www.nytimes.com/2025/04/16/us/schumer-trump-new-york-prosecutors.html"
  },
  {
    "text": "Trump administration plans to end the IRS Direct File program for free tax filing, AP sources say  —  The Trump administration plans to eliminate the IRS' Direct File program, an electronic system for filing tax returns directly to the agency for free, according to two people familiar with the decision.",
    "url": "https://apnews.com/article/irs-direct-file-tax-returns-free-trump-4bb0bca02fab9b3d06ae6f45ac67b7ab"
  },
  {
    "text": "RFK Jr. contradicts CDC on causes of autism  —  HHS Secretary Robert F. Kennedy Jr. took the unusual step of publicly contradicting one of his own agencies' autism studies on Tuesday, suggesting at a press conference that “environmental factors” including drugs, not improved screening, were causing a spike in confirmed cases.",
    "url": "https://www.axios.com/2025/04/16/kennedy-cdc-autism-rates"
  },
  {
    "text": "Judge rules against parents who wore wristbands to protest transgender student athlete  —  A federal judge ruled Monday that two fathers cannot wear pink wristbands with two X's — the symbol for female chromosomes — drawn on them in opposition to a transgender high school athlete on one of their daughters' rival soccer teams.",
    "url": "https://thehill.com/homenews/lgbtq/5249752-judge-parents-protest-transgender-student-athlete/"
  },
  {
    "text": "The Tactics Elon Musk Uses to Manage His ‘Legion’ of Babies—and Their Mothers  —  The world's richest man juggles more than a dozen children and ‘harem drama’ along with running his companies and advising Trump.  He recently took a paternity test in a battle with one woman over money and privacy.",
    "url": "https://www.wsj.com/politics/elon-musk-children-mothers-ashley-st-clair-grimes-dc7ba05c?st=rbiMzK&reflink=mobilewebshare_permalink"
  },
  {
    "text": "2 Protesters at Marjorie Taylor Greene Town Hall Are Subdued With Stun Guns  —  Three people, including the two who were subdued with stun guns, were arrested.  —  A town hall for Representative Marjorie Taylor Greene of Georgia outside of Atlanta on Tuesday quickly deteriorated into chaos … ",
    "url": "https://www.nytimes.com/2025/04/15/us/politics/marjorie-taylor-greene-protesters.html"
  },
  {
    "text": "Pa. Gov. Shapiro was targeted for ‘what he wants to do to Palestinian people’: warrant  —  The suspect in the arson attack at the Governor's Residence targeted Josh Shapiro due to his perceived stance on Palestine, according to a search warrant obtained by PennLive.",
    "url": "https://www.pennlive.com/crime/2025/04/arson-suspect-targeted-pa-gov-shapiro-for-what-he-wants-to-do-to-palestinian-people-search-warrant.html&subscribed=auth0%7C67ff83c45c04df3168b5ed8b"
  },
  {
    "text": "In unprecedented move, DNC official to spend big to take down fellow Democrats  —  David Hogg, the DNC vice chair, wants to take down some safe incumbents.  —  David Hogg, a controversial Democratic National Committee vice chair, is pledging to upend Democratic primaries by funding candidates … ",
    "url": "https://www.politico.com/news/2025/04/15/david-hogg-dnc-vice-chair-to-spend-big-to-take-down-safe-democratic-incumbents-00292535"
  },
  {
    "text": "Trump administration refers NY AG Letitia James for potential prosecution over alleged mortgage fraud  —  WASHINGTON — New York Attorney General Letitia James — who infamously declared that “no one is above the law” when she was targeting Donald Trump — was hit with a federal criminal referral … ",
    "url": "https://nypost.com/2025/04/15/us-news/trump-administration-refers-ny-ag-tish-james-for-prosecution/"
  },
  {
    "text": "Memo shows U.S. can send migrants without criminal records to Guantanamo, despite Trump's promise to hold “the worst” there  —  A government memo obtained by CBS News shows the Trump administration created broad rules outlining which migrants can be held at Guantanamo Bay … ",
    "url": "https://www.cbsnews.com/news/guantanamo-trump-migrants-without-criminal-records/"
  }
]