[
  {
    "text": "Pro-DeSantis super PAC fires interim CEO after 9 days  —  Never Back Down fired Kristin Davison on Friday, according to two people familiar with the decision.  —  The chief super PAC supporting Republican presidential candidate Ron DeSantis, Never Back Down, has fired its interim chief executive officer after less than two weeks.",
    "url": "https://www.politico.com/news/2023/12/02/desantis-super-pac-ceo-00129765"
  },
  {
    "text": "Pro-DeSantis super PAC parts with CEO amid turmoil  —  Kristin Davison departs just 10 days after the previous chief executive resigned, the latest shake-up as fighting between the governor's allies has escalated and erupted into public view  —  A super PAC that has overseen … ",
    "url": "https://www.washingtonpost.com/politics/2023/12/02/kristin-davison-desantis-never-back-down/"
  },
  {
    "text": "DeSantis PAC CEO out in latest shakeup  —  Never Back Down - the super PAC supporting Republican presidential candidate Ron DeSantis - has parted ways with its interim chief executive officer after she served nine days on the job.  —  Kristin Davison replaced former CEO Chris Jankowski on Nov. 22.",
    "url": "https://thehill.com/homenews/campaign/4339588-desantis-pac-ceo-out-in-latest-shakeup/"
  },
  {
    "text": "Swing-state Muslim leaders launch campaign to ‘abandon’ Biden in 2024  —  The bubbling anger among Arab and Muslim Americans over the president's handling of the Israel-Hamas conflict could threaten his chances of reelection.  —  Muslim leaders from several swing states on Saturday descended on Dearborn … ",
    "url": "https://www.politico.com/news/2023/12/02/swing-state-muslim-leaders-biden-00129758"
  },
  {
    "text": "Trump attempts to spin anti-democracy, authoritarian criticism against Biden  —  The former president declared his 2024 campaign as a ‘righteous crusade’ against ‘tyrants and villains’  —  CEDAR RAPIDS, Iowa — Republican polling leader Donald Trump moved to deflect from criminal charges … ",
    "url": "https://www.washingtonpost.com/politics/2023/12/02/trump-speech-authoritarian-criticism-biden/"
  },
  {
    "text": "Texas GOP executive committee rejects proposed ban on associating with Nazi sympathizers and Holocaust deniers  —  Some members of the committee said such a ban, proposed two months after a prominent conservative activist was caught meeting with a famous white supremacist, might be a “slippery slope” or too vague.",
    "url": "https://www.texastribune.org/2023/12/02/texas-gop-antisemitism-resolution/"
  },
  {
    "text": "What home schooling hides: A boy tortured and starved by his stepmom  —  Roman Lopez was 11 when he went missing.  His years of torment were concealed by home schooling.  —  Deep Reads features The Washington Post's best immersive reporting and narrative writing.  —  Nobody could find Roman Lopez.",
    "url": "https://www.washingtonpost.com/education/interactive/2023/homeschooling-child-abuse-torture-roman-lopez/"
  },
  {
    "text": "Hard-right backtrack on spending levels leaves sour taste for colleagues  —  Fiscal fights have been at the heart of Republican conflict this year, including the debate over the top-line spending level for 2024  —  Under a sweltering July heat outside the Capitol, members … ",
    "url": "https://www.washingtonpost.com/politics/2023/12/02/house-freedom-caucus-spending-plan/"
  },
  {
    "text": "George Santos Movie In Works At HBO Films From ‘Veep’ EP Frank Rich  —  Co-Editor-in-Chief, TV  — ‘Riches’ U.K. Series Canceled By Prime Video After One Season; “I Still Had Many More Stories To Tell,” Creator Says  — Julianna Margulies Apologizes For Comments Tying Black & LGBTQ Communities … ",
    "url": "https://deadline.com/2023/12/george-santos-movie-hbo-films-frank-rich-1235649730/"
  },
  {
    "text": "Drunk and Asleep on the Job: Air Traffic Controllers Pushed to the Brink  —  A nationwide shortage of controllers has resulted in an exhausted and demoralized work force that is increasingly prone to making dangerous mistakes.  —  One air traffic controller went into work drunk this summer and joked about “making big money buzzed.”",
    "url": "https://www.nytimes.com/2023/12/02/business/air-traffic-controllers-safety.html"
  },
  {
    "text": "Several killed in bombing during Catholic mass in Philippines  —  At least three people were killed and seven wounded in a bomb attack on a Catholic mass in the insurgency-plagued southern Philippines on Sunday, officials said.  —  The blast took place during a regular service … ",
    "url": "https://www.cbsnews.com/news/several-killed-bombing-catholic-mass-philippines-marawi/"
  },
  {
    "text": "Address of His Holiness Pope Francis to the Conference of Parties to the United Nations Framework Convention on Climate Change (COP28)  —  I have the honour to read the Address that His Holiness Pope Francis prepared for this occasion:  —  Mr President,  —  Mr Secretary-General of the United Nations,",
    "url": "https://www.vatican.va/content/francesco/en/speeches/2023/december/documents/20231202-dubai-cop28.html"
  },
  {
    "text": "Paris Terror Attack: One Killed, Two Injured by ‘Allahu Akbar’ Knifeman  —  Paris police arrested a man on Saturday evening after he allegedly killed one man and injured another two while shouting ‘Allahu Akbar’.  —  UPDATE 2350: The alleged attacker, referred to only Armand R … ",
    "url": "https://www.breitbart.com/europe/2023/12/02/paris-terror-attack-one-killed-two-injured-by-allahu-akbar-knifeman/"
  },
  {
    "text": "Israel Risks ‘Strategic Defeat’ If It Doesn't Protect Civilians, Austin Says  — Defense secretary amplifies growing US concern as war resumes  — Protecting civilians is crucial in urban warfare, Austin says  —  US Defense Secretary Lloyd Austin said Israel risked “strategic defeat” … ",
    "url": "https://www.bloomberg.com/news/articles/2023-12-02/defense-secretary-austin-warns-of-risk-for-israel-over-civilian-deaths-in-gaza"
  }
]