[
  {
    "text": "Trump Golf Club Settlement Hangs Alina Habba Out to Dry  —  The former president's lawyer may still face fallout for her involvement in an ex-employee's hush money deal over harassment claims at Trump's Bedminster club. … Donald Trump's golf club in Bedminster, New Jersey … ",
    "url": "https://www.thedailybeast.com/trump-new-jersey-golf-club-settlement-hangs-lawyer-alina-habba-out-to-dry"
  },
  {
    "text": "Doug Emhoff Decries ‘Antisemitic’ Trump Comments on Jewish Democrats  — Husband of Vice President Harris visited Omaha on Tuesday  — Trump's remarks widely condemned by Jewish groups, Democrats  —  Second gentleman Doug Emhoff condemned Republican Donald Trump for accusing Jews … ",
    "url": "https://www.bloomberg.com/news/articles/2024-03-19/emhoff-decries-antisemitic-trump-comments-on-jewish-democrats"
  },
  {
    "text": "Why Won't Rich Republicans Loan Money to Upstanding Businessman Donald Trump? … The Republican Party is united in its belief that Donald Trump's court-ordered financial distress is the product of Democratic Party “lawfare.”  Liberal prosecutors and courts have set out to persecute … ",
    "url": "https://nymag.com/intelligencer/article/donald-trump-fines-broke-court-fraud-rich-republicans-loan.html"
  },
  {
    "text": "Trump can't find anyone to spot him $464 million.  Would you?  —  Of course no one will lend Donald Trump the half-billion dollars he needs to put up while appealing his fraud case.  Would you?  —  In recent months, the former president has racked up a series of costly legal judgments for his many misdeeds.",
    "url": "https://www.washingtonpost.com/opinions/2024/03/18/trump-civil-fraud-case-appeal-bond/"
  },
  {
    "text": "Trump Asks Supreme Court for Absolute Immunity on Election Charges  —  The court will hear arguments on April 25 over whether former presidents can be prosecuted for things they did while in office.  —  Former President Donald J. Trump urged the Supreme Court on Tuesday to rule … ",
    "url": "https://www.nytimes.com/2024/03/19/us/trump-supreme-court-immunity.html"
  },
  {
    "text": "Trump sues ABC and Stephanopoulos, alleging defamation over Mace interview  —  Former President Trump sued ABC News and George Stephanopoulos, alleging defamation over the anchor's questioning of Rep. Nancy Mace (R-S.C.) about her endorsement of Trump.  —  The March 10 interview on “This Week” … ",
    "url": "https://thehill.com/regulation/court-battles/4541257-trump-sues-abc-stephanopoulos-alleging-defamation-mace-interview/"
  },
  {
    "text": "Trump sues ABC, George Stephanopoulos for defamation after host accused him of rape in Mace interview  —  Former President Donald Trump has filed a defamation lawsuit against ABC News and George Stephanopoulos, claiming his reputation was tarnished by the anchor saying multiple times on-air … ",
    "url": "https://nypost.com/2024/03/19/us-news/trump-sues-abc-george-george-stephanopoulos-for-defamation-after-host-accused-him-of-rape-in-mace-interview/"
  },
  {
    "text": "Supreme Court allows Texas to enforce immigration law  —  The Biden administration sued to block the law, saying it tramples on the federal government's exclusive authority to oversee immigration issues.  —  WASHINGTON — The Supreme Court on Tuesday allowed Texas to enforce a contentious … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-allows-texas-enforce-immigration-law-rcna142971"
  },
  {
    "text": "Supreme Court allows Texas to begin enforcing controversial immigration law  —  The Supreme Court on Tuesday cleared the way for Texas to immediately begin enforcing a controversial immigration law that allows state officials to arrest and detain people they suspect of entering the country illegally.",
    "url": "https://www.cnn.com/2024/03/19/politics/supreme-court-allows-texas-to-begin-enforcing-controversial-immigration-law/"
  },
  {
    "text": "Jared Kushner says Gaza's ‘waterfront property could be very valuable’  —  Donald Trump's son-in-law also says Israel should bulldoze an area of the Negev desert and move Palestinians there  —  Jared Kushner has praised the “very valuable” potential of Gaza's “waterfront property” … ",
    "url": "https://www.theguardian.com/us-news/2024/mar/19/jared-kushner-gaza-waterfront-property-israel-negev"
  },
  {
    "text": "Mar-a-Lago Judge's Stark Ruling: Jury Sees Secret Files or Trump Wins  —  Trump-appointed Judge Aileen Cannon handed the jury in his Mar-a-Lago case a shocking ultimatum on Monday.  —  The MAGA-friendly federal judge who keeps siding with Donald Trump in his Mar-a-Lago classified records case … ",
    "url": "https://www.thedailybeast.com/mar-a-lago-judge-rules-jury-sees-top-secret-files-or-trump-wins"
  },
  {
    "text": "Brazil's Bolsonaro is indicted for first time over alleged falsification of his own vaccination data  —  Former Brazilian President Jair Bolsonaro was formally accused Tuesday of falsifying his COVID-19 vaccination data, marking the first indictment for the embattled far-right leader, with more allegations potentially in store.",
    "url": "https://apnews.com/article/bolsonaro-brazil-federal-police-indicted-covid-a0c1f1dba71553096d0de0f4f39d4caa"
  },
  {
    "text": "Peter Navarro is 1st Trump White House official to serve prison time related to Jan. 6 attack  —  Former White House adviser Peter Navarro reported to prison Tuesday for a contempt of Congress conviction, becoming the first senior Trump administration official to be locked up for a crime related to the Jan. 6, 2021, Capitol attack.",
    "url": "https://apnews.com/article/peter-navarro-jan-6-prison-congress-contempt-ea6f0e60dda1a7bcaef31012cd2c7678"
  },
  {
    "text": "Mississippi ex-deputy gets 20-year sentence in racist torture of two Black men  —  A former Mississippi sheriff's deputy was sentenced Tuesday to about 20 years in prison for his part in torturing two Black men last year.  Hunter Elward was sentenced by U.S. District Judge Tom Lee … ",
    "url": "https://apnews.com/article/mississippi-goon-squad-sentencing-d2eb6ba7e2f337ac1f17035cc97f2934"
  },
  {
    "text": "Nebraska lawmaker faces calls to resign after invoking colleague's name in book's rape scene passage  —  Republican Nebraska state Sen. Steve Halloran later defended reading the graphic text but apologized for adding his colleague's name to it.  —  Republican Nebraska state Sen. Steve Halloran … ",
    "url": "https://www.nbcnews.com/politics/politics-news/nebraska-lawmaker-faces-calls-resign-invoking-colleagues-name-books-ra-rcna144050"
  },
  {
    "text": "Michigan congressman's brother killed in shooting  —  Congressman Dan Kildee's (D-Mich.) brother, Timothy Kildee, was killed in a Tuesday morning shooting, local law enforcement said.  —  Timothy Kildee was shot and killed during a string of crimes that transpired during early morning hours on Tuesday … ",
    "url": "https://thehill.com/homenews/house/4542657-michigan-congressmans-brother-killed-in-shooting/"
  },
  {
    "text": "Drone footage raises questions about Israeli justification for deadly strike on Gaza journalists  —  JERUSALEM — On Jan. 7, the Israeli military conducted a targeted missile strike on a car carrying four Palestinian journalists outside Khan Younis, in southern Gaza.",
    "url": "https://www.washingtonpost.com/world/2024/03/19/gaza-journalists-killed-israel-al-jazeera-footage/"
  },
  {
    "text": "Pro-Trump Michigan attorney arrested after hearing in DC over leaking Dominion documents  —  An attorney facing criminal charges for illegally accessing Michigan voting machines after the 2020 election was arrested Monday after a hearing in a separate case in federal court in Washington, D.C.",
    "url": "https://apnews.com/article/voting-machines-dominion-defamation-68d3f3a4e840ccb7a81d72837c4f6b3e"
  },
  {
    "text": "Montana Supreme Court allows abortion ballot proposal to proceed  —  The ruling says Attorney General Austin Knudsen erred in finding the proposal for the 2024 ballot ‘legally insufficient.’  — Click to email a link to a friend (Opens in new window)  —  Thank you for being a member of Montana Free Press.",
    "url": "https://montanafreepress.org/2024/03/18/montana-supreme-court-allows-abortion-ballot-proposal-to-proceed/"
  },
  {
    "text": "Twenty Democratic attorneys general file motion in support of Biden methane rule  —  Twenty Democratic state attorneys general on Monday filed a motion in defense of the Environmental Protection Agency's (EPA) oil and gas methane rule, following a lawsuit against the rule by Republican AGs.",
    "url": "https://thehill.com/policy/energy-environment/4542710-twenty-democratic-attorneys-general-file-motion-in-support-of-biden-methane-rule/"
  },
  {
    "text": "Porter regrets saying California Senate primary race was ‘rigged’  —  Progressive Rep. Katie Porter says she regrets calling the recent California Senate primary “rigged” after losing the closely watched Democratic contest to Rep. Adam Schiff.  —  Porter sparked backlash for using the word … ",
    "url": "https://thehill.com/homenews/house/4541839-porter-regrets-saying-california-senate-primary-race-was-rigged/"
  },
  {
    "text": "The Ego Has Crash-Landed  —  Donald Trump dominated the news cycle this weekend.  Everybody's talking about the outrageous things he said at his rally in Dayton, Ohio—above all, his menacing warning of a “bloodbath” if he is defeated in November.  To follow political news is to again be immersed in all Trump, all the time.",
    "url": "https://www.theatlantic.com/politics/archive/2024/03/donald-trump-ego-election-2024/677797/"
  },
  {
    "text": "The Bloodbath Candidate  —  In Context, Trump is Worse  —  At a rally in Vandalia, Ohio last Saturday, Trump promised a “bloodbath for the country” if he's not elected president.  —  Then followed a predictable bout of (self-)deception, the claim that Trump's bloodbath was out of context.",
    "url": "https://snyder.substack.com/p/the-bloodbath-candidate"
  },
  {
    "text": "Supreme Court unanimously rules against government in No Fly List case  —  The Supreme Court unanimously ruled Tuesday that a man's challenge to his former placement on the No Fly List can move forward, finding the government failed to show his lawsuit is moot.",
    "url": "https://thehill.com/regulation/court-battles/4541638-supreme-court-no-fly-list-case/"
  }
]