[
  {
    "text": "Playbook: Inside Tom Emmer's Trump problem  —  Presented by With help from Eli Okun and Garrett Ross  —  DRIVING THE DAY  —  CORRECTING THE RECORD — “Hamas Fails to Make Case That Israel Struck Hospital,” by NYT's Patrick Kingsley and Aaron Boxerman in Jerusalem",
    "url": "https://www.politico.com/newsletters/playbook/2023/10/23/inside-tom-emmers-trump-problem-00122966"
  },
  {
    "text": "Republicans Grapple With Being Speakerless, but Effectively Leaderless, Too  —  With a speaker fight in the House, concerns about an aging Senate leader and a 2024 front-runner who has the party in a vise grip, some G.O.P. members worry the turmoil could have long-term effects.",
    "url": "https://www.nytimes.com/2023/10/23/us/politics/republicans-speaker-2024-elections.html"
  },
  {
    "text": "Cut it out, Americans by more than 2-1 tell the House: Elect a speaker, already  —  Susan Page Sudiksha Kochi Savannah Kuchar  —  The soap opera that has consumed members of Congress for nearly three weeks over electing a new speaker is testing the patience of the voters who sent them to Washington … ",
    "url": "https://www.usatoday.com/story/news/politics/2023/10/22/americans-house-elect-speaker-poll/71270869007/"
  },
  {
    "text": "New SAT Data Highlights the Deep Inequality at the Heart of American Education  —  New data shows, for the first time at this level of detail, how much students' standardized test scores rise with their parents' incomes — and how disparities start years before students sit for tests.",
    "url": "https://www.nytimes.com/interactive/2023/10/23/upshot/sat-inequality.html"
  },
  {
    "text": "The House GOP's unlikely resistance fighter  —  Public Notice just celebrated its second birthday.  Click the button to take advantage of our special anniversary offer.  —  Click to redeem PN 2nd anniversary offer  —  The ongoing GOP House speakership debacle has been a clownish … ",
    "url": "https://www.publicnotice.co/p/ken-buck-speaker-vote-trump-big-lie-rejection"
  },
  {
    "text": "Trump Claims He Never Spoke to Billionaire ‘Red Haired Weirdo’ About Nuke Subs  —  ‘FAKE NEWS!’  —  Donald Trump lashed out at explosive reports Sunday alleging that he had discussed sensitive information concerning U.S. nuclear submarines and conversations with world leaders with Australian billionaire Anthony Pratt.",
    "url": "https://www.thedailybeast.com/trump-claims-he-never-spoke-to-billionaire-red-haired-weirdo-about-nuclear-submarines"
  },
  {
    "text": "Exclusive poll: Nikki Haley surges, nearly ties Ron DeSantis as the alternative to Trump  —  Haley's support has surged to 11% and DeSantis' plunged to 12%, the USA TODAY/Suffolk Poll finds.  But Trump still dominates.  —  Former UN ambassador Nikki Haley has surged nationally … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2023/10/23/2024-poll-haley-desantis-trump/71286643007/"
  },
  {
    "text": "COVID Is Ramping Up for a Year of Deadly Surges  —  Scientists hope that by the end of 2024 COVID may become more flu-like but before that fading immunity means more killer waves are on the way.  —  COVID is back.  But then, it never really left.  And the respiratory disease's late-summer resurgence might … ",
    "url": "https://www.thedailybeast.com/covid-is-ramping-up-for-a-year-of-deadly-surges"
  },
  {
    "text": "Yes, Byron Donalds should be the next speaker of the House  —  Rep. Byron Donalds (R-FL) declared his candidacy for speaker of the House Friday evening, the Washington Examiner reported.  —  It was a bold declaration after Rep. Jim Jordan (R-OH) could not secure enough votes to proceed with his candidacy.",
    "url": "https://www.washingtonexaminer.com/opinion/yes-byron-donalds-should-be-the-next-speaker-of-the-house"
  },
  {
    "text": "The $14 billion question  —  After the terrorist attacks of September 11, 2001, which killed 2,977 victims, there was a tremendous and justifiable desire for the government to take action against those responsible.  On October 7, 2001, the United States and its allies launched “Operation Enduring Freedom.”",
    "url": "https://popular.info/p/the-14-billion-question"
  },
  {
    "text": "Battleground Dem senators consider bucking Biden on border, Iran  —  Joe Manchin has already signed on to two bills that would freeze $6 billion in assets to Iran, countering the White House.  Sherrod Brown and Jon Tester may join him.  —  Battleground Senate Democrats are weighing a break … ",
    "url": "https://www.politico.com/news/2023/10/23/battleground-democrats-crossing-biden-00122761"
  },
  {
    "text": "Joint Statement on Israel  —  Today,  President Joseph R. Biden, Prime Minister Trudeau of Canada,  President Emmanuel Macron of France, Chancellor Olaf Scholz of Germany, Prime Minister Giorgia Meloni of Italy, and Prime Minister Rishi Sunak of the United Kingdom spoke regarding … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2023/10/22/joint-statement-on-israel-2/"
  },
  {
    "text": "Leaked audio captures Sheila Jackson Lee disparaging staffer  —  Rep. Shelia Jackson Lee (D-TX), who is running for mayor of Houston, was allegedly caught in an audio recording cursing at her staffer while calling him names.  —  The audio was given to Texas outlet Current Revolt Saturday … ",
    "url": "https://www.washingtonexaminer.com/news/house/sheila-jackson-lee-leaked-audio-disparaging-staffer"
  },
  {
    "text": "If you have nine candidates for Speaker you have no candidates for speaker  —  I would call this the political equivalent of a “let's remember some guys” blog except that you would have had to ever have known who they were to remember them:  —  The House GOP's enormous speaker field is officially set … ",
    "url": "https://www.lawyersgunsmoneyblog.com/2023/10/if-you-have-nine-candidates-for-speaker-you-have-no-candidates-for-speaker"
  }
]