[
  {
    "text": "The Social Security Administration Is Gutting Regional Staff and Shifting All Public Communications to X  —  The SSA's shift to Elon Musk's X comes as the agency plans to cut its regional office workforce by roughly 90 percent, WIRED has learned.  —  The Social Security Administration … ",
    "url": "https://www.wired.com/story/social-security-administration-regional-office-elon-musk-x/"
  },
  {
    "text": "Immigration judge rules that Columbia University activist Mahmoud Khalil can be deported  —  Columbia University graduate student Mahmoud Khalil can be deported as a national security risk, an immigration judge in Louisiana ruled Friday during a hearing over the legality of kicking the activist … ",
    "url": "https://apnews.com/article/mahmoud-khalil-columbia-protester-ruling-deport-fd9e80583af3109d7de0a5264e79ea61"
  },
  {
    "text": "Immigration Judge Rules Khalil Can Be Deported, but Legal Hurdles Remain  —  The decision by a judge in Louisiana is an early victory for Secretary of State Marco Rubio, but a broader challenge is still being heard in federal court in Newark.  —  An immigration judge in Louisiana found … ",
    "url": "https://www.nytimes.com/2025/04/11/nyregion/khalil-jena-deportation-ruling.html"
  },
  {
    "text": "Judge orders government to lay out steps for return of wrongly deported man  —  U.S. District Judge Paula Xinis also directed the government to confirm the location of Kilmar Abrego García, who was deported to a Salvadoran mega-prison, by 9:30 a.m. Friday.  —  just now",
    "url": "https://www.washingtonpost.com/immigration/2025/04/11/kilmar-abrego-garcia-el-salvador-deported-case/"
  },
  {
    "text": "Trump tariff collection for freight shipments delayed by Customs ‘glitch’ … An alert from U.S. Customs and Border Protection on Friday notified users of a glitch in the system that is used to exempt freight from tariffs, including shipments from China that were already on the water … ",
    "url": "https://www.cnbc.com/2025/04/11/customs-reports-glitch-in-system-used-by-freight-for-tariff-exemptions.html"
  },
  {
    "text": "Pennsylvania Man Charged with Making Threats to Assault and Murder President Donald J. Trump, Other U.S. Officials, and Immigration and Customs Enforcement Agents  —  For Immediate Release  —  Shawn Monper, 32, a resident of Butler, Pennsylvania, has been charged by federal criminal complaint … ",
    "url": "https://www.justice.gov/opa/pr/pennsylvania-man-charged-making-threats-assault-and-murder-president-donald-j-trump-other-us"
  },
  {
    "text": "Trump envoy's embrace of Russian demands worries Republicans, U.S. allies  —  Less than 48 hours after dining with a negotiator sent by Russian President Vladimir Putin in Washington last week, Steve Witkoff, the U.S. special envoy leading talks with Moscow, sat down with President Donald Trump … ",
    "url": "https://www.reuters.com/world/trump-envoys-embrace-russian-demands-worries-republicans-us-allies-2025-04-11/"
  },
  {
    "text": "Five More Big Law Firms Reach Deals With Trump  —  Kirkland & Ellis, Latham & Watkins, A&O Shearman, Simpson Thacher & Bartlett and Cadwalader, Wickersham & Taft agreed to do free legal work on causes the White House supports.  —  Five more prominent law firms facing potential punitive action … ",
    "url": "https://www.nytimes.com/2025/04/11/business/trump-law-firms-kirkland-ellis-latham-watkins.html"
  },
  {
    "text": "Who's In and Who's Out at the Naval Academy's Library?  —  An order by Defense Secretary Pete Hegseth's office resulted in a purge of books critical of racism but preserved volumes defending white power.  —  Gone is “I Know Why the Caged Bird Sings,” Maya Angelou's transformative best-selling … ",
    "url": "https://www.nytimes.com/2025/04/11/us/politics/naval-academy-banned-books.html?unlocked_article_code=1.-04.RMwP.oLahXQat2fy_&smid=url-share"
  },
  {
    "text": "RFK Jr. says Deep State ‘is real,’ references past work with ‘the r—  d’ in speech to FDA staff  —  The HHS secretary's remarks shocked staffers at the Food and Drug Administration, prompting some of them to walk out.  —  HHS Secretary Robert F. Kennedy Jr.'s visit to the FDA Friday … ",
    "url": "https://www.politico.com/news/2025/04/11/rfk-jr-says-the-deep-state-is-real-references-past-work-with-the-retarded-in-private-speech-to-fda-staff-00286826"
  },
  {
    "text": "Palantir Is Helping DOGE With a Massive IRS Data Project  —  For the last three days, DOGE and a handful of Palantir representatives, along with dozens of career IRS engineers, have been collaborating to build a “mega API,” WIRED has learned.  —  Palantir, the software company cofounded by Peter Thiel … ",
    "url": "https://www.wired.com/story/palantir-doge-irs-mega-api-data/"
  },
  {
    "text": "Trump's draft budget eviscerates weather and climate tracking and research  —  The Trump administration plans to eliminate the research arm of National Oceanic and Atmospheric Administration, close all weather and climate labs and eviscerate its budget along with several other NOAA offices … ",
    "url": "https://cnn.com/2025/04/11/climate/trump-noaa-budget-cuts"
  },
  {
    "text": "Freak sell-off of ‘safe haven’ US bonds raises fear that confidence in America is fading  —  The upheaval in stocks has been grabbing all the headlines, but there is a bigger problem looming in another corner of the financial markets that rarely gets headlines: Investors are dumping U.S. government bonds.",
    "url": "https://apnews.com/article/treasurys-bond-market-yield-tariff-46b4818710f01b8cc93fd002081167b0"
  },
  {
    "text": "European travellers cancel US visits as Trump's policies threaten tourism  —  International visitors stay away as political and economic tension and fears of a hostile border rise  —  The number of European travellers visiting the US has fallen sharply as political and economic tension … ",
    "url": "https://www.ft.com/content/6dc16a54-8de1-4f3b-8409-ecb566118127"
  },
  {
    "text": "State tells employees to report on one another for ‘anti-Christian bias’  —  “It's very 'Handmaid's Tale'-esque,” one official said.  —  The Trump administration has ordered State Department employees to report on any instances of coworkers displaying “anti-Christian bias” … ",
    "url": "https://www.politico.com/news/2025/04/11/state-report-anti-christian-bias-033535"
  },
  {
    "text": "Why Beijing is not backing down on tariffs  —  In response to why Beijing is not backing down to Donald Trump on tariffs, the answer is that it doesn't have to.  —  China's leaders would say that they are not inclined to cave in to a bully - something its government has repeatedly labelled … ",
    "url": "https://www.bbc.com/news/articles/cjew7y4j724o"
  },
  {
    "text": "Military Mission for Sealing the Southern Border of the United States and Repelling Invasions  —  NATIONAL SECURITY PRESIDENTIAL MEMORANDUM/NSPM-4 MEMORANDUM FOR THE SECRETARY OF DEFENSE THE SECRETARY OF THE INTERIOR THE SECRETARY OF AGRICULTURE THE SECRETARY OF HOMELAND SECURITY",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/04/military-mission-for-sealing-the-southern-border-of-the-united-states-and-repelling-invasions/"
  },
  {
    "text": "BEST WEEK EVER: Trump Frees Hot Ballerina After Winning Trade War, Making Showers Great Again (PHOTOS)  —  President Donald Trump is having one of the best weeks of his presidency.  The stock market surged on Wednesday after Trump declared victory against unfair trade practices.",
    "url": "https://freebeacon.com/politics/best-week-ever-trump-frees-hottest-us-hostage-after-winning-trade-war-making-showers-great-again-photos/"
  },
  {
    "text": "Inside the DOGE immigration task force  —  The taskforce, led by Musk confidante Antonio Gracias, is providing the technical infrastructure for a sweeping set of actions aimed at revoking parole and terminating visas.  —  DOGE's bread and butter has been slashing headcounts but it is now wielding … ",
    "url": "https://www.politico.com/news/2025/04/11/doge-immigration-taskforce-00287327"
  },
  {
    "text": "Trump Will End Temporary Protections for Afghans and Cameroonians  —  More than 10,000 people will be put on track for deportation in May and June as a result of the Department of Homeland Security's action.  —  The Trump administration will end temporary protections for more than 10,000 people … ",
    "url": "https://www.nytimes.com/2025/04/11/us/politics/trump-tps-afghanistan-cameroon.html"
  },
  {
    "text": "Military contractors pitch unprecedented prison plan for detained immigrants  —  Erik Prince wants to cut a deal to skirt immigration laws and transport detainees from the US to El Salvador.  —  Former Blackwater CEO Erik Prince and a team of defense contractors are pitching the White House … ",
    "url": "https://www.politico.com/news/2025/04/11/military-contractors-prison-plan-detained-immigrants-erik-prince-00287208"
  },
  {
    "text": "F.B.I. Suspends Bureau Employee on Patel's So-Called Enemies List  —  The employee was a longtime counterintelligence analyst who had worked on the F.B.I.'s investigation examining Russian meddling in the 2016 presidential election.  —  The F.B.I. has suspended an analyst on Kash Patel's … ",
    "url": "https://www.nytimes.com/2025/04/11/us/politics/fbi-suspends-employee-patel-enemies.html"
  },
  {
    "text": "DOGE takes over federal grants website, wresting control of billions  —  A DOGE engineer removed users' access to grants.gov, threatening to further slow the process of awarding thousands of federal grants per year.  —  U.S. DOGE Service employees have inserted themselves … ",
    "url": "https://www.washingtonpost.com/politics/2025/04/11/doge-controls-federal-grant-postings/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ0MzQ0MDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ1NzI2Mzk5LCJpYXQiOjE3NDQzNDQwMDAsImp0aSI6Ijk3MWVjOTI5LTgwYjktNGM0Zi1hNzdjLTc2Y2ZhNzE2OGE4YiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzA0LzExL2RvZ2UtY29udHJvbHMtZmVkZXJhbC1ncmFudC1wb3N0aW5ncy8ifQ.v43T-h7cb-PB9d8KuXfxz3q0Ste7SjxuYeRdrNFgHHc&itid=gfta"
  },
  {
    "text": "Small plane crashes in Boca Raton, Florida; all 3 on board killed  —  One man on the ground suffered non-life-threatening injuries.  —  Emergency crew inspects the site of a small plane crash, April 11, 2025 in Boca Raton, Fla.  —  All three people on board a small plane were killed … ",
    "url": "https://abcnews.go.com/US/small-plane-crashes-boca-raton-florida-police/story?id=120717334"
  },
  {
    "text": "Children Seeking Cholera Care Die After U.S. Cuts Aid, Charity Says  —  The victims died on a grueling three-hour walk in scorching heat as they tried to reach the nearest remaining health facility, officials of Save the Children said.  —  At least five children and three adults with cholera died … ",
    "url": "https://www.nytimes.com/2025/04/11/world/africa/south-sudan-cholera-children-deaths.html?unlocked_article_code=1.-04.bmGw.QjX8z-5PPpYB&smid=bs-share"
  },
  {
    "text": "Joe Concha uses his daughter's experience to defend Maine father silenced while protecting girls sports  —  Washington Examiner senior writer Joe Concha detailed how his young daughter recently had to share the soccer field with a high school boy when defending a Maine father who was silenced trying to defend girls' sports.",
    "url": "https://www.washingtonexaminer.com/news/3377743/joe-concha-defend-maine-father-silenced-protecting-girls-sports/"
  },
  {
    "text": "‘From Anxious to Petrified’: Consumer Sentiment Plunges Further  —  The University of Michigan's closely watched index hit its second-lowest reading on record, dragged down by fears of higher prices and unemployment  —  Americans turned much more pessimistic about the economy in April … ",
    "url": "https://www.wsj.com/economy/consumer-confidence-sinks-further-umich-says-c3c09654"
  },
  {
    "text": "Trump likely to propose pay freeze for federal workers in 2026  —  President Trump appears set to propose freeze civilian federal employees' pay next year, according to draft budget documents.  —  The news came in the form of a passback, which is effectively the Office of Management … ",
    "url": "https://www.govexec.com/pay-benefits/2025/04/trump-likely-propose-pay-freeze-federal-workers-2026/404502/"
  },
  {
    "text": "Top U.S. Prosecutor in New Jersey, a Trump Loyalist, Targets Governor  —  Alina Habba said she was investigating Gov. Philip D. Murphy and the state's attorney general over immigration policy.  She called the inquiry a “warning for everybody.”  —  The top federal prosecutor in New Jersey … ",
    "url": "https://www.nytimes.com/2025/04/11/nyregion/trump-justice-department-habba-immigration.html?unlocked_article_code=1.-04.w8sH.PVx7SsIhCuBs&smid=nytcore-ios-share&referringSource=articleShare"
  }
]