[
  {
    "text": "Barack and Michelle Obama endorse Kamala Harris for president  —  The Obamas are the final key leaders in the Democratic Party to unite behind Harris after President Biden ended his bid for a second term.  —  Former president Barack Obama and first lady Michelle Obama endorsed Vice President Harris … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/26/barack-michelle-obama-kamala-harris-endorse/"
  },
  {
    "text": "‘What happened to any time, any place?’:  Kamala Harris trolls Trump as he backs out of debate  —  Trump's campaign team won't commit to debating Harris - at least not yet - blaming Democratic instability  —  Support truly  —  independent journalism  —  Our mission is to deliver unbiased … ",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/kamala-harris-trump-debate-any-time-b2586303.html"
  },
  {
    "text": "Playbook: The endorsement Kamala Harris was waiting for  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  NEW THIS MORNING — BARACK and MICHELLE OBAMA officially endorsed KAMALA HARRIS' presidential campaign this morning via a campaign video that captured … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/07/26/the-endorsement-kamala-harris-was-waiting-for-00171347"
  },
  {
    "text": "Trump Invites Reporters to Start Demanding His Medical Records  —  More media outlets are beginning to report on the FBI's uncertainty regarding whether a bullet or shrapnel wounded Donald Trump's ear.  —  NBC quotes the FBI describing that their Shooting Reconstruction Team continues to investigate … ",
    "url": "https://www.emptywheel.net/2024/07/26/trump-invites-reporters-to-start-demanding-his-medical-records/"
  },
  {
    "text": "Speculation Swirls About What Hit Trump.  An Analysis Suggests It was a Bullet  —  An absence of medical records or official accounts has stirred confusion, but a Times video and trajectory analysis indicates a bullet, not debris, wounded the former president.",
    "url": "https://www.nytimes.com/2024/07/26/us/politics/trump-shooter-bullet-trajectory-ear.html"
  },
  {
    "text": "The media is already failing in its duty to fairly cover Kamala Harris  —  Sure, Harris deserves scrutiny.  But she doesn't deserve smears and stereotypes amplified by journalists and pundits addicted to clicks  —  It's going to be ugly, that much is already clear.",
    "url": "https://www.theguardian.com/commentisfree/article/2024/jul/26/kamala-harris-media"
  },
  {
    "text": "Conservatives' racist and sexist attacks on Kamala Harris show exactly who they are  —  Hatred will continue to ooze from the right.  Pay attention - because that bigotry isn't just talk, it's Republican policies  —  Like a warm compress drawing pus from a wound, the Democratic presidential candidacy … ",
    "url": "https://www.theguardian.com/commentisfree/article/2024/jul/26/republican-kamala-harris-racist-sexist-attacks"
  },
  {
    "text": "Inside JD Vance's Blogger Days  —  The Democrats' biggest holdouts are done holding out.  Barack and Michelle Obama announced Friday morning they are endorsing Kamala Harris for president, saying that “she has the vision, the character, and the strength that this critical moment demands.”",
    "url": "https://www.thebulwark.com/p/inside-jd-vances-blogger-days"
  },
  {
    "text": "Trump campaign plays defense amid Harris honeymoon … - “The Democrats and the [mainstream media] will try and tout these polls as proof that the race has changed. … - “Before long, Harris' ‘honeymoon’ will end and voters will refocus on her role as Biden's partner and co-pilot,” … ",
    "url": "https://www.axios.com/2024/07/26/kamala-harris-honeymoon-fundraising-ads"
  },
  {
    "text": "Kevin Roberts, architect of Project 2025, has close ties to radical Catholic group Opus Dei  —  Heritage Foundation leader has long received spiritual guidance from group and his policy goals align with its teachings  —  Kevin Roberts, the Heritage Foundation president and the architect of Project 2025 … ",
    "url": "https://www.theguardian.com/us-news/article/2024/jul/26/kevin-roberts-project-2025-opus-dei"
  },
  {
    "text": "NY Times Makes Incredible Retraction Involving Kamala Harris Polling — And A Bowl Of Chili With A Severed Finger In It?  —  In a case of incredibly weird odds, The New York Times issued a retraction on Thursday of a quote it used in an article about new polling — because of all the people … ",
    "url": "https://www.mediaite.com/media/new-york-times-retracts-quote-from-woman-who-planted-a-severed-finger-in-her-serving-of-wendys-chili/"
  },
  {
    "text": "Exclusive: CNN survey finds 48 states say Harris can get on ballot instead of Biden, rejecting claim switch breaks state laws  —  The election authorities of at least 48 states, both Republicans and Democrats, say there are no obstacles that would prevent Vice President Kamala Harris from getting … ",
    "url": "https://www.cnn.com/2024/07/26/politics/harris-ballot-legal-obstacles-48-states/"
  },
  {
    "text": "Donald Trump Gets No Black Votes vs. Kamala Harris in New Michigan Poll  —  received the support of no Black voters in a new Michigan survey.  —  The WDIV/Detroit News poll found that the presidential race is a dead heat between Trump, the  —  nominee, and Vice President  —  , the",
    "url": "https://www.newsweek.com/donald-trump-no-black-voters-michigan-poll-kamala-harris-1930542"
  },
  {
    "text": "Elon Musk's transgender daughter, in first interview, says he berated her for being queer as a child  —  In an exclusive interview, Vivian Jenna Wilson said her father's recent statements, including that she is “not a girl,” inspired her to speak out: “I'm not just gonna let that slide.”",
    "url": "https://www.nbcnews.com/tech/tech-news/elon-musk-transgender-daughter-vivian-wilson-interview-rcna163665"
  },
  {
    "text": "Vance argued for higher tax rate on childless Americans in 2021 interview  —  Trump's running mate has faced criticism over other similar previous comments.  —  Republican vice-presidential nominee, Sen. J.D. Vance speaks at a campaign rally at Radford University, July 22, 2024, in Radford, Virginia.",
    "url": "https://abcnews.go.com/US/vance-argued-higher-tax-rate-childless-americans-2021/story?id=112284318"
  },
  {
    "text": "VP Kamala Harris Is Not “Veep” Selina Meyer  —  As soon as President Biden dropped out of the race, leaving his vice president to take on the candidacy, a pile-on of news organizations tracked me down to ask for comment.  They weren't after any insights on Kamala Harris's campaign (I have none) … ",
    "url": "https://www.nytimes.com/2024/07/26/opinion/veep-selina-meyer-kamala-harris.html"
  },
  {
    "text": "Kamala Harris praised ‘defund the police’ movement in June 2020 radio interview  —  Vice President Kamala Harris voiced support for “defund the police” in a radio interview in June 2020 amidst nationwide protests for police reform, just months before denouncing the movement after she had joined the Biden presidential campaign.",
    "url": "https://www.cnn.com/2024/07/26/politics/kfile-kamala-harris-praised-defund-the-police-movement-in-june-2020/"
  },
  {
    "text": "The Unnerving Changeability of JD Vance  —  In “Hillbilly Elegy,” the 2016 memoir that made JD Vance a celebrity, he described constantly remaking his childhood self to fit the rotating cast of father figures his unsound mother brought into their lives.  “With Steve, a midlife-crisis sufferer … ",
    "url": "https://www.nytimes.com/2024/07/26/opinion/jd-vance-changeability.html?unlocked_article_code=1.-E0.f_Wx.WGS_rVG5ir8m&smid=nytcore-ios-share&referringSource=articleShare&sgrp=c-cb"
  },
  {
    "text": "EU gives $1.6 billion in profits from frozen Russian assets to Ukraine  —  The European Union Friday transferred $1.6 billion in profits from frozen Russian Central Bank assets to Ukraine.  EU Commission President Ursula von der Leyen declared that the EU stands with Ukraine.",
    "url": "https://www.upi.com/Top_News/World-News/2024/07/26/EU-Russian-frozen-asset-profits-Ukraine-EU/1201721998237/"
  },
  {
    "text": "Nebraska Supreme Court upholds law restricting both medical care for transgender youth and abortion  —  OMAHA, Neb. (AP) — A Nebraska law that combined abortion restrictions with another measure to limit gender-affirming health care for minors does not violate a state constitutional amendment requiring bills … ",
    "url": "https://apnews.com/article/transgender-health-abortion-nebraska-supreme-court-62a1022df835adc6697f5c96b8a35c16"
  }
]