[
  {
    "text": "Pro-Haley super PAC relaunches as ‘Haley Voters for Biden’  —  The News  —  A super PAC that urged non-Republicans to cast primary votes for Nikki Haley is pivoting to November, urging Haley's voters to support President Joe Biden.  Starting today, Primary Pivot will become Haley Voters for Biden … ",
    "url": "https://www.semafor.com/article/03/06/2024/pro-haley-super-pac-relaunches-as-haley-voters-for-biden"
  },
  {
    "text": "Trump RNC ‘purge’ has some committee members nervous  —  Former President Donald Trump's impending takeover of the Republican National Committee could give him access to a big new pile of cash at a time when he is beset by legal bills, making some committee members nervous.",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/03/07/trump-rnc-purge/72856982007/"
  },
  {
    "text": "President Biden faces pivotal 2024 State of the Union, chance to reset race against Trump  —  WASHINGTON ― President Joe Biden faces a pivotal State of the Union address Thursday as he looks to silence skeptics about his ability to keep serving, convince restless Americans of a strong economy … ",
    "url": "https://www.usatoday.com/story/news/politics/2024/03/07/2024-state-of-the-union-biden/72841280007/"
  },
  {
    "text": "Dean Phillips suspends 2024 presidential campaign … - “I am going to suspend my campaign, and I will be right now endorsing President Biden,” Phillips said in an interview with WCCO Radio on Wednesday. … - “Congratulations to Joe Biden, Uncommitted, Marianne Williamson … ",
    "url": "https://www.axios.com/2024/03/06/dean-phillips-suspends-campaign-2024-presidential"
  },
  {
    "text": "How Trump's Crushing Primary Triumph Masked Quiet Weaknesses  —  Even though he easily defeated Nikki Haley, the primary results suggested that he still has long-term problems with suburban voters, moderates and independents.  —  Donald J. Trump's daunting level of Republican support helped … ",
    "url": "https://www.nytimes.com/2024/03/06/us/politics/donald-trump-primary-wins.html"
  },
  {
    "text": "Ahead of the State of the Union, Voters Support Biden's Agenda and Accomplishments Despite Low Awareness  —  With the general election still eight months away, this week's State of the Union address will mark one of Joe Biden's first and best chances to lay out his plans for a second presidential term … ",
    "url": "https://www.dataforprogress.org/blog/2024/3/6/ahead-of-the-state-of-the-union-voters-support-bidens-agenda-and-accomplishments-despite-low-awareness"
  },
  {
    "text": "It's not money that Elon Musk is contributing to Donald Trump  —  News that Elon Musk met with Donald Trump over the weekend prompted not gasps of surprise but, instead, the sort of “oh, sure, of course” response that comes from figuring out a mystery story written for children.",
    "url": "https://www.washingtonpost.com/politics/2024/03/06/trump-musk-2024-contributions/"
  },
  {
    "text": "Mark Robinson's Bizarre Ramble: 'I Absolutely Want To Go Back To The America Where Women Couldn't Vote'  —  In a newly unearthed video, North Carolina's GOP nominee for governor says America was better then because Republicans “fought for real social change.”  —  LOADING",
    "url": "https://www.huffpost.com/entry/north-carolina-gop-mark-robinson-women-vote_n_65e7d899e4b0f9d26cacc002"
  },
  {
    "text": "Ex-Congressional candidate Daniel Rodimer wanted for murder in Las Vegas  —  LAS VEGAS (KSNV) — Former professional wrestler and congressional candidate Daniel Rodimer is wanted for murder in connection with a homicide on the Las Vegas Strip last year, authorities have confirmed.",
    "url": "https://news3lv.com/news/local/ex-congressional-candidate-daniel-rodimer-wanted-for-murder-in-las-vegas-lvjc-lvmpd-homicide-investigation-cops-courts"
  },
  {
    "text": "Ex-GOP Candidate and Former WWE Wrestler Surrenders Over Vegas Murder  —  Daniel Rodimer, a former wrestler who ran for Congress in 2020, is accused of killing someone at a resort on the Las Vegas Strip.  —  Daniel Rodimer, the disgraced GOP congressional candidate who was endorsed … ",
    "url": "https://www.thedailybeast.com/ex-gop-congressional-candidate-and-former-wwe-wrestler-daniel-rodimer-is-wanted-for-murder"
  },
  {
    "text": "House passes $460 billion package of spending bills.  Senate expected to act before shutdown deadline  —  The House passed a $460 billion package of spending bills Wednesday that would keep money flowing to key federal agencies through the remainder of the budget year.",
    "url": "https://apnews.com/article/government-shutdown-funding-deadline-congress-2533c1a6b6eb25cc63e78f089e27d3a0"
  },
  {
    "text": "FDA says to throw away these 6 cinnamon products because they contain high levels of lead  —  Consumers should not purchase half a dozen ground cinnamon products sold by retailers including Family Dollar and Dollar Tree because they contain elevated levels of lead, the U.S. Food and Drug Administration … ",
    "url": "https://www.cbsnews.com/news/lead-cinnamon-fda-applesauce-children/"
  },
  {
    "text": "Chinese National Residing in California Arrested for Theft of Artificial Intelligence-Related Trade Secrets from Google  —  For Immediate Release  —  Defendant Allegedly Pilfered Technology from Google While Secretly Working for Two PRC-Based Technology Companies  —  View the indictment here.",
    "url": "https://www.justice.gov/opa/pr/chinese-national-residing-california-arrested-theft-artificial-intelligence-related-trade"
  },
  {
    "text": "Gov. Kathy Hochul sending National Guard members to New York City subways to combat ongoing crime  —  “No one heading to their job or to visit family or go to a doctor appointment should worry that the person sitting next to them possesses a deadly weapon,” she said.",
    "url": "https://www.nbcnews.com/news/us-news/gov-kathy-hochul-sending-national-guard-members-new-york-city-subways-rcna142063"
  },
  {
    "text": "A federal agency has told rural counties and small towns how to safeguard their elections, but not all can afford the fixes  —  Local officials said that amid baseless claims of stolen and rigged elections, they worry about the physical safety of election workers and the sites where votes are counted.",
    "url": "https://www.nbcnews.com/politics/2024-election/rural-counties-small-towns-need-money-protect-elections-november-2024-rcna141918"
  },
  {
    "text": "Speaker Johnson urges GOP lawmakers to maintain decorum at State of the Union  —  Speaker Mike Johnson (R-La.) is urging GOP lawmakers to maintain decorum when President Biden delivers his State of the Union address Thursday night, after Republicans had a number of outbursts during last year's speech.",
    "url": "https://thehill.com/homenews/house/4514306-speaker-johnson-urges-gop-lawmakers-to-maintain-decorum-at-state-of-the-union/"
  },
  {
    "text": "Black couple rented to a Chinese American family when nobody would.  Now, they're donating $5M to Black community.  —  The Dongs are selling the home their family rented and eventually bought from Gus Thompson, a former slave, and his wife, Emma.  The Dongs will donate the proceeds to Black students.",
    "url": "https://www.nbcnews.com/news/us-news/black-chinese-family-coronado-california-rcna140717"
  },
  {
    "text": "Florida Senate passes bill banning local heat protections for workers  —  The Florida State Senate passed a bill Tuesday that would prohibit local agencies from implementing heat protections for workers.  —  The GOP-controlled Senate voted 28-11 to pass the bill, which would ban cities … ",
    "url": "https://thehill.com/homenews/state-watch/4514517-florida-senate-passes-bill-banning-local-heat-protections-for-workers/"
  },
  {
    "text": "Keller high school backtracks, students will perform ‘The Laramie Project’  —  Keller high school students will perform The Laramie Project, a play that explores the aftermath of the 1998 murder of a gay student in Wyoming.The Timber Creek High School production is expected to go on in May.\"Now we can tell … ",
    "url": "https://www.dallasnews.com/news/education/2024/03/06/keller-high-school-backtracks-will-perform-the-laramie-project/"
  }
]