[
  {
    "text": "My Next Chapter  —  I'm leaving the House but not the fight.  —  I'm an optimist.  How could I not be?  I'm the son of a firefighter.  For 17 years I've served in the same congressional seat—the same office in which I was once denied an internship.  Only in America.",
    "url": "https://www.wsj.com/articles/kevin-mccarthy-my-next-chapter-house-gop-retirement-california-e4e593d7?mod=followamazon"
  },
  {
    "text": "Former speaker Kevin McCarthy will retire from Congress at end of year  —  Rep. Kevin McCarthy (R-Calif.), the former House speaker who was ousted from his position in October in a revolt by hard-right members, will not seek reelection to his congressional seat and will retire from Congress … ",
    "url": "https://www.washingtonpost.com/politics/2023/12/06/kevin-mccarthy-retire/"
  },
  {
    "text": "Wisconsin Trump electors settle lawsuit, agree Biden won in 2020  —  MADISON, Wis. — In a legal settlement Wednesday, the 10 Republicans who signed official-looking paperwork falsely purporting Donald Trump won Wisconsin in 2020 have agreed to withdraw their inaccurate filings … ",
    "url": "https://www.washingtonpost.com/politics/2023/12/06/wisconsin-trump-fake-electors-lawsuit/"
  },
  {
    "text": "Nevada grand jury indicts six pro-Trump fake electors  —  A Nevada grand jury has indicted six individuals who acted as fake electors in a scheme intended to overturn Joe Biden's 2020 election win, according to the state's attorney general.  —  The indictments make Nevada the third state … ",
    "url": "https://www.cnn.com/2023/12/06/politics/nevada-fake-electors-indicted/"
  },
  {
    "text": "Pro-Trump electors indicted in Nevada, the third state to issue charges  —  A Nevada grand jury on Wednesday charged six Republicans who claimed to be presidential electors in 2020 and submitted certificates to Congress falsely asserting that former president Donald Trump had won the election in their state.",
    "url": "https://www.washingtonpost.com/politics/2023/12/06/nevada-fake-electors-indictment-trump/"
  },
  {
    "text": "Nevada GOP ‘fake electors’ indicted for falsely claiming Trump won state's 2020 election  —  A Nevada grand jury has indicted the six Republicans — including the chair of the Nevada Republican Party — who falsely pledged Nevada's electoral votes to Donald Trump following … ",
    "url": "https://thenevadaindependent.com/article/nevada-gop-fake-electors-indicted-for-falsely-claiming-trump-won-states-2020-election"
  },
  {
    "text": "‘This Is Grim,’ One Democratic Pollster Says  —  The predictive power of horse-race polling a year from the presidential election is weak at best.  The Biden campaign can take some comfort in that.  —  But what recent surveys do reveal is that the coalition that put Biden in the White House … ",
    "url": "https://www.nytimes.com/2023/12/06/opinion/biden-campaign-polls.html"
  },
  {
    "text": "Trump is hiding his fascist plans in plain sight  —  Trump's nightmarish scheme was leaked to the New York Times — and yes, it was on purpose  —  Watching cable news is a frequent source of despair, but one especially fraught spiral occurred Monday while subjecting myself to “Morning Joe” on MSNBC.",
    "url": "https://www.salon.com/2023/12/06/is-hiding-his-fascist-plans-in-plain-sight/"
  },
  {
    "text": "Here are the top moments from Trump's ‘Hannity’ town hall  —  Trump touched on topics ranging from President Biden to dictatorships  —  Former President Trump joined Fox News' “Hannity” on Tuesday night for a town hall discussion on the GOP presidential primary, President Biden, dictatorships, and more.",
    "url": "https://www.foxnews.com/politics/top-moments-trumps-hannity-town-hall"
  },
  {
    "text": "Trump says he told son Eric not to testify at fraud trial  —  Former President Trump says he directed his second eldest son, Eric Trump, not to testify again in the New York fraud trial threatening the family's business empire.  —  “Eric has already testified, PERFECTLY … ",
    "url": "https://thehill.com/regulation/court-battles/4344914-donald-trump-eric-new-york-fraud-trial-testimony/"
  },
  {
    "text": "America's White Evangelical Problem  —  When the journalist Tim Alberta's father unexpectedly died, another ordeal awaited Tim.  His father had pastored the Cornerstone Evangelical Presbyterian church in Michigan, where the Alberta family now gathered to honor his life alongside the congregation the father had nurtured.",
    "url": "https://nymag.com/intelligencer/2023/12/tim-alberta-book-review-americas-white-evangelical-problem.html"
  },
  {
    "text": "Norman Lear, TV Legend, Dies at 101  —  Writer-producer-developer Norman Lear, who revolutionized American comedy with such daring, immensely popular early-'70s sitcoms as “All in the Family” and “Sanford and Son,” died on Tuesday.  He was 101.  —  Lear's publicist confirmed to Variety … ",
    "url": "https://variety.com/2023/tv/news/norman-lear-dead-dies-tv-legend-all-in-the-family-1235823995/"
  },
  {
    "text": "Dems assess wreckage of border talks: ‘They never should have started’  —  With a foreign aid package slated to go down on the Senate floor Wednesday, Democrats aren't hiding their frustration that border policies ever became linked to cash for Ukraine and Israel.",
    "url": "https://www.politico.com/news/2023/12/06/congress-border-ukraine-deal-00130225"
  },
  {
    "text": "Person of the Year  —  Taylor Swift  —  Taylor Swift is telling me a story, and when Taylor Swift tells you a story, you listen, because you know it's going to be good—not only because she's had an extraordinary life, but because she's an extraordinary storyteller.",
    "url": "https://time.com/6342806/person-of-the-year-2023-taylor-swift/"
  },
  {
    "text": "George Santos is earning six figures from Cameo videos  —  The Scene  —  Just before 6 p.m. on Tuesday, George Santos was at Best Buy on Northern Boulevard in Queens.  —  Santos, whose biography on the celebrity video platform Cameo identifies him as a “Former congressional ‘Icon’!",
    "url": "https://www.semafor.com/article/12/06/2023/george-santos-is-earning-six-figures-from-cameo-videos"
  },
  {
    "text": "WATCH: MIT, Penn, Harvard Presidents Say Calls for Jewish Genocide Do Not Violate Code of Conduct  —  ‘If the speech turns into conduct, it can be harassment,’ Penn's Liz Magill said  —  The presidents of the Massachusetts Institute of Technology, the University of Pennsylvania … ",
    "url": "https://freebeacon.com/latest-news/watch-mit-penn-harvard-presidents-say-calls-for-jewish-genocide-do-not-violate-code-of-conduct/"
  },
  {
    "text": "Are We Shocked a Dem Rep Said This About Florida and Texas?  —  It's one of those moments where you hear Winston Churchill's remarks about democracy: the most significant argument against it is five minutes with the average voter.  Yes, we're a constitutional republic, but you get the point.",
    "url": "https://townhall.com/tipsheet/mattvespa/2023/12/06/dem-rep-florida-and-texas-are-deplorable-states-n2632046"
  },
  {
    "text": "Hunter Biden got staggering $4.9M from ‘sugar brother’ Kevin Morris: IRS whistleblower  —  WASHINGTON — Hunter Biden received a whopping $4.9 million from Hollywood lawyer Kevin Morris in a three-year period, according to an IRS agent who investigated the president's son for alleged tax evasion.",
    "url": "https://nypost.com/2023/12/05/news/hunter-biden-got-staggering-4-9m-from-sugar-brother-kevin-morris-irs-whistleblower/"
  },
  {
    "text": "Suspect ID'd in Texas shooting spree that left 6 dead, 3 injured  —  A suspect was arrested after the shootings in Austin and near San Antonio.  —  Police investigate a crime scene in Austin, Texas, after a series of shootings in Austin and near San Antonio on Dec. 5, 2023.",
    "url": "https://abcnews.go.com/US/suspect-arrested-after-shootings-austin-san-antonio-leave/story?id=105412955"
  },
  {
    "text": "‘Test case’ for America: Colorado's top court poised to weigh Trump's eligibility to run again  —  A Wednesday argument brings the question of Trump's eligibility under the 14th Amendment one step closer to the Supreme Court.  —  The most potent effort to disqualify Donald Trump … ",
    "url": "https://www.politico.com/news/2023/12/06/colorado-supreme-court-trump-insurrection-00130271"
  },
  {
    "text": "NASA commemorates 25th anniversary of International Space Station: ‘Absolutely amazing’  —  NASA on Wednesday celebrated 25 years of the International Space Station's (ISS) operations.  —  The first two modules of the ISS, named Zayra and Unity, were joined together 25 years ago on Dec. 6, 1998.",
    "url": "https://thehill.com/homenews/administration/4345856-nasa-commemorates-25th-anniversary-of-international-space-station-absolutely-amazing/"
  },
  {
    "text": "The report AT&T didn't want to produce  —  Last Friday, AT&T quietly published an extraordinary document.  For the first time ever, the company released a “political congruency report.”  The report, which covers the year 2022, looks at the “[s]tate and federal elected officials to whom AT&T … ",
    "url": "https://popular.info/p/the-report-at-and-t-didnt-want-to"
  }
]