[
  {
    "text": "Exclusive: The White House is looking to replace Pete Hegseth as defense secretary  —  The White House has begun the process of looking for a new secretary of defense, according to a U.S. official who was not authorized to speak publicly.  —  This comes as Defense Secretary Pete Hegseth continues to find himself mired in controversy.",
    "url": "https://www.npr.org/2025/04/21/nx-s1-5371312/trump-white-house-pete-hegseth-defense-department"
  },
  {
    "text": "‘An amateur person’: GOP Rep. Bacon says Hegseth should go  —  The Nebraska lawmaker is the first House Republican to recommend the president fire the secretary of Defense.  —  Rep. Don Bacon, a prominent Republican on the House Armed Services Committee, became the first sitting GOP lawmaker Monday … ",
    "url": "https://www.politico.com/news/2025/04/21/don-bacon-recommends-firing-hegseth-00301057"
  },
  {
    "text": "The Fire Jerome Powell Market Rout  —  Investors render a verdict on tariffs and politicizing the Fed.  —  Click for Sound  —  If the White House wanted a test of how firing Jerome Powell would go over in the markets, it succeeded on Monday.  U.S. stocks and the dollar plunged while yields … ",
    "url": "https://www.wsj.com/opinion/donald-trump-jerome-powell-federal-reserve-kevin-hassett-tariffs-interest-rates-markets-acd5c7b3"
  },
  {
    "text": "U.S. dollar falls to three-year low as Trump's Powell threats further dent investor confidence  —  The U.S. dollar continued its slide on Monday, falling to its lowest level since 2022, as global investors retreat from U.S. assets in the face of tension between President Donald Trump and the Federal Reserve.",
    "url": "https://www.cnbc.com/2025/04/21/us-dollar-falls-to-three-year-low-as-trumps-powell-threats-further-dent-investor-confidence.html"
  },
  {
    "text": "Upholding Our Values, Defending Our University  —  Dear Members of the Harvard Community,  —  Over the course of the past week, the federal government has taken several actions following Harvard's refusal to comply with its illegal demands.  Although some members of the administration … ",
    "url": "https://www.harvard.edu/president/news/2025/upholding-our-values-defending-our-university/"
  },
  {
    "text": "Harvard Sues Trump Administration Over Threats to Cut Funding  —  Harvard's lawsuit comes after the administration sought to force the university to comply with a list of demands by cutting billions in federal funding the school receives.  —  Harvard, the world's wealthiest university … ",
    "url": "https://www.nytimes.com/2025/04/21/us/harvard-lawsuit-trump-administration.html"
  },
  {
    "text": "Harvard Sues Trump Administration Over $2.2 Billion Funding Freeze  —  Harvard sued the Trump administration in federal court on Monday over its multibillion dollar cuts to the University's research funding, accusing the White House of undertaking an arbitrary and unconstitutional campaign to … ",
    "url": "https://www.thecrimson.com/article/2025/4/22/harvard-sues-trump-admin/"
  },
  {
    "text": "Homeland Security Secretary Kristi Noem's bag, including $3,000 in cash, is stolen from DC restaurant  —  Department of Homeland Security Secretary Kristi Noem fell victim to a thief while eating dinner at a downtown Washington, DC, restaurant Sunday night, two sources familiar with the incident … ",
    "url": "https://cnn.com/2025/04/21/politics/homeland-security-kristi-noem-purse-stolen/"
  },
  {
    "text": "Kristi Noem's Bag, With Security Badge and $3,000, Is Stolen  —  The homeland security secretary was dining at a Washington, D.C., restaurant.  She also lost her passport and keys.  —  A handbag belonging to the homeland security secretary Kristi Noem containing her passport … ",
    "url": "https://www.nytimes.com/2025/04/21/us/politics/kristi-noem-purse-stolen.html"
  },
  {
    "text": "New images could change cancer diagnostics, but ICE detained the Harvard scientist who analyzes them  —  Without scientist Kseniia Petrova's expertise, no one can fully unlock the data's potential, putting crucial advancements in early cancer detection at risk.",
    "url": "https://www.nbcnews.com/news/us-news/ice-detain-kseniia-petrova-protest-harvard-cancer-research-rcna202180"
  },
  {
    "text": "Student loans in default to be referred to debt collection, Education Department says  —  The Education Department will begin collection next month on student loans that are in default, including the garnishing of wages for potentially millions of borrowers,officials said Monday.",
    "url": "https://apnews.com/article/student-loan-debt-default-collection-fa6498bf519e0d50f2cd80166faef32a"
  },
  {
    "text": "Mahmoud Khalil's Son Arrives After ICE Refuses to Let Him Attend Birth  —  Mr. Khalil, a permanent resident detained in Louisiana, had requested a monitored furlough for the birth.  His request was denied in less than an hour.  —  The Department of Homeland Security denied Mahmoud Khalil permission … ",
    "url": "https://www.nytimes.com/2025/04/21/nyregion/mahmoud-khalil-denied-baby-birth.html?unlocked_article_code=1.BU8.pjhe.3Jr8pWs0F1Bz&smid=url-share"
  },
  {
    "text": "Mississippi Governor Declares April 2025 as Confederate Heritage Month  — Click to email a link to a friend (Opens in new window) Email  —  Mississippi Gov. Tate Reeves has declared April 2025 as Confederate Heritage Month in Mississippi, keeping alive a 32-year-old tradition that began in 1993.",
    "url": "https://www.mississippifreepress.org/mississippi-governor-declares-april-2025-as-confederate-heritage-month/"
  },
  {
    "text": "My Dinner With Adolf  —  Imagine my surprise when in the spring of 1939 a letter arrived at my house inviting me to dinner at the Old Chancellery with the world's most reviled man, Adolf Hitler.  I had been a vocal critic of his on the radio from the beginning, pretty much predicting everything … ",
    "url": "https://www.nytimes.com/2025/04/21/opinion/larry-david-hitler-dinner.html?unlocked_article_code=1.BU8.iA11.gp0VbsxPOiVa&smid=url-share"
  },
  {
    "text": "Statement Of Acting United States Attorney Matthew Podolsky On The Conviction Of Nadine Menendez  —  For Immediate Release  —  U.S. Attorney's Office, Southern District of New York  —  Moments ago, a unanimous jury convicted Nadine Menendez for her critical role in a corruption … ",
    "url": "https://www.justice.gov/usao-sdny/pr/statement-acting-united-states-attorney-matthew-podolsky-conviction-nadine-menendez"
  },
  {
    "text": "First House Republican calls for Pete Hegseth's ouster  —  Rep. Don Bacon (R-Neb.) on Monday became the first Republican member of Congress to openly indicate support for Secretary of Defense Pete Hegseth's removal from office.  —  Why it matters: Hegseth is under fire for a series … ",
    "url": "https://www.axios.com/2025/04/21/don-bacon-pete-hegseth-signal"
  },
  {
    "text": "Justice Dept. agrees to let DOGE access sensitive immigration case data  —  About a half-dozen DOGE “advisors” won approval from the the Justice Department to access the ECAS system, according to documents reviewed by The Washington Post.  —  Representatives for the U.S. DOGE Service … ",
    "url": "https://www.washingtonpost.com/immigration/2025/04/21/doge-ecas-justice-immigration-courts-trump/"
  },
  {
    "text": "Newly Minted DOJ Employee Michael Caputo Keeps Posting ‘Antifa’ Death Fantasies Online  —  The week before last, veteran GOP operative Michael Caputo was hired by one of President Trump's most controversial nominees to advise him ahead of what is expected to be a tough confirmation fight.",
    "url": "https://talkingpointsmemo.com/news/newly-minted-doj-employee-michael-caputo-keeps-posting-antifa-death-fantasies-online"
  },
  {
    "text": "The ACLU Is Suing the Government to Get Access to DOGE Records  —  The ACLU claims the Department of Veterans Affairs and the Social Security Administration have violated the Freedom of Information Act.  —  The American Civil Liberties Union filed a federal lawsuit on Monday … ",
    "url": "https://www.wired.com/story/aclu-lawsuit-government-doge-access-sensitive-data/"
  },
  {
    "text": "The Government's Chemical Disaster Tracking Tool Just Went Dark  —  The chemical lobby demanded Trump make the locations of high-risk chemical plants secret.  The EPA did just that.",
    "url": "https://www.levernews.com/the-governments-chemical-disaster-tracking-tool-just-went-dark/"
  },
  {
    "text": "Six Men Are Charged After Woman Was Dragged From Idaho Town Hall  —  The plainclothes guards were involved in the forcible removal of a woman from a meeting hosted by local Republicans in Coeur d'Alene, prosecutors said.  —  Six men who prosecutors said took part in forcibly removing a woman … ",
    "url": "https://www.nytimes.com/2025/04/21/us/idaho-coeur-dalene-town-hall-charges.html"
  },
  {
    "text": "Trump May Soon Offer a Motherhood Medal, an Idea Popularized in Nazi Germany  —  “I'll be known as the fertilization president and that's okay,” the president has said.  —  On Monday, the New York Times reported that the Trump Administration is mulling a suite of initiatives aimed at encouraging Americans to have more babies.",
    "url": "https://www.motherjones.com/politics/2025/04/trump-motherhood-medal-pronatalist-nazi/"
  },
  {
    "text": "E.P.A. Set to Cancel Grants Aimed at Protecting Children From Toxic Chemicals  —  The cancellations, set to apply to pending and active grants, also affect research into “forever chemicals” contaminating the food supply.  —  The Trump administration is set to cancel tens of millions of dollars … ",
    "url": "https://www.nytimes.com/2025/04/21/climate/epa-cuts-forever-chemicals-grants.html?unlocked_article_code=1.BU8.c5WZ.CVSL3fR47vRt&smid=bs-share"
  },
  {
    "text": "Tesla Slides as Analyst Warns of ‘Code Red’ Ahead of Earnings … Wedbush Securities analyst Dan Ives said Tesla's chief executive officer should step back from his controversial work at the Department of Government Efficiency and re-focus his attention on the carmaker.",
    "url": "https://www.bloomberg.com/news/articles/2025-04-21/tesla-bull-calls-code-red-saying-musk-needs-to-leave-doge?accessToken=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzb3VyY2UiOiJTdWJzY3JpYmVyR2lmdGVkQXJ0aWNsZSIsImlhdCI6MTc0NTE5Nzg1OCwiZXhwIjoxNzQ1ODAyNjU4LCJhcnRpY2xlSWQiOiJTVjFIMkdUMEFGQjQwMCIsImJjb25uZWN0SWQiOiIxNTI1ODQyQjlGOEY0MDMzQUVGNjI4MTNFMkIxMEY0OSJ9.0SEG4_7ieov83Km6AwnbBGaF7ByqtOnsaRNTNGuFtuo"
  },
  {
    "text": "Trump Aides Solicit Ideas to Raise Birthrate, From Baby Bonuses to Fertility Planning … “We need to channel the MAHA spirit and really dive deep into infertility,” said Emma Waters, a policy analyst at the Heritage Foundation, referring to Robert F. Kennedy Jr.'s Make America Healthy Again campaign.Rebecca Kiger for The New York Times",
    "url": "https://www.nytimes.com/2025/04/21/us/politics/trump-birthrate-proposals.html?unlocked_article_code=1.BU8.pB_x.XEjMZkwXrbWE&smid=url-share"
  },
  {
    "text": "With CDC injury prevention team gutted, ‘we will not know what is killing us’  —  Before they were fired, staff at the Centers for Disease Control and Prevention were about to launch a new data system to improve how the U.S. tracks concussions.  —  They were planning to release updated guidance … ",
    "url": "https://www.npr.org/sections/shots-health-news/2025/04/21/nx-s1-5371519/cdc-hhs-injury-prevention-federal-layoffs"
  },
  {
    "text": "Bluesky Is Rolling Out Official Verification  —  Bluesky's new verification process launches today.  It mixes the old-school, Twitter-style blue check bestowed by the platform with a more decentralized option for trusted organizations.  —  Starting today, Bluesky is rolling out a new verification system … ",
    "url": "https://www.wired.com/story/bluesky-official-verification-blue-check/"
  },
  {
    "text": "Bukele Has Cruel Plan to Make Trump's Mass Deportations Even Worse  —  Salvadoran President Nayib Bukele wants to exchange Venezuelan deportees from the United States being unlawfully held in prison for political prisoners being held in Venezuela.  —  He made the terrifying proposition … ",
    "url": "https://newrepublic.com/post/194203/nayib-bukele-donald-trump-mass-deportations-venezuela"
  },
  {
    "text": "Trump pretends he's a dictator — and the credulous media too often nods along  —  Immediately after retaking the presidency in January, Donald Trump began signing executive orders with lightning speed.  Wielding his fancy pen like a wrecking ball, he acted like he was autographing new copies of “The Art of the Deal” for his fans.",
    "url": "https://margaretsullivan.substack.com/p/trump-pretends-hes-a-dictator-and"
  },
  {
    "text": "Delta plane engine catches fire at Orlando airport, passengers evacuate on slides  —  A Delta passenger jet caught fire on the tarmac at Orlando International Airport Monday and passengers had to evacuate via the emergency slides, the Federal Aviation Authority said Monday.",
    "url": "https://www.cbsnews.com/news/delta-plane-engine-fire-orlando-airport-passengers-evacuate/"
  },
  {
    "text": "She told Trump the Smithsonian needs changing.  He's ordered her to do it.  —  Who is Lindsey Halligan, the attorney assigned to help remove “improper ideology” from a major cultural institution?  —  There is only one person mentioned by name in President Donald Trump's March 27 executive order titled … ",
    "url": "https://www.washingtonpost.com/style/power/2025/04/21/lindsey-halligan-smithsonian-executive-order/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ1MjA4MDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ2NTkwMzk5LCJpYXQiOjE3NDUyMDgwMDAsImp0aSI6IjZjMTMwMjg2LWZjNGEtNDhmNy05MTk0LTE5MDlkOTJjNmQwNSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9zdHlsZS9wb3dlci8yMDI1LzA0LzIxL2xpbmRzZXktaGFsbGlnYW4tc21pdGhzb25pYW4tZXhlY3V0aXZlLW9yZGVyLyJ9.t6Ea73F6qBwR8VGtQT1HJZlfLUMGyoiV5e_wKNauVTI&itid=gfta"
  },
  {
    "text": "Trump backs Long Island town's effort to keep Native American logo  —  President Trump has thrown his support behind a Long Island school district's fight to keep its mascot after New York's State Education Board banned the use of Native American-inspired names and logos.",
    "url": "https://thehill.com/homenews/5259441-trump-backs-massapequa-chiefs/"
  },
  {
    "text": "Democrats Hold Meetings in El Salvador, Seeking Release of Maryland Resident  —  The lawmakers said the Salvadoran government had denied their request to meet with a deported Maryland man, Kilmar Armando Abrego Garcia.  The visit came after a trip by Senator Chris Van Hollen.",
    "url": "https://www.nytimes.com/2025/04/21/us/politics/abrego-garcia-el-salvador-democrats.html"
  }
]