[
  {
    "text": "Department of Defense Security for the Protection of Department of Homeland Security Functions  —  MEMORANDUM FOR THE SECRETARY OF DEFENSE  —  THE ATTORNEY GENERAL THE SECRETARY OF HOMELAND SECURITY  —  Numerous incidents of violence and disorder have recently occurred and threaten … ",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/06/department-of-defense-security-for-the-protection-of-department-of-homeland-security-functions/"
  },
  {
    "text": "Trump Is Calling Up National Guard Troops Under a Rarely Used Law  —  President Trump bypassed the authority of Gov. Gavin Newsom to call up 2,000 National Guard troops to quell immigration protests.  —  President Trump took extraordinary action on Saturday by calling up 2,000 National Guard troops … ",
    "url": "https://www.nytimes.com/2025/06/07/us/trump-national-guard-deploy-rare.html?unlocked_article_code=1.NU8.MiJi.wIHcOlpxIz7P&smid=url-share"
  },
  {
    "text": "National guard troops sent by Trump arrive in LA following protests against immigration raids - US politics live  —  President had earlier praised national guard for ‘great job’, even though they were not yet in the city  —  Trump praises national guard, though troops have not arrived",
    "url": "https://www.theguardian.com/us-news/live/2025/jun/08/trump-national-guard-la-protests-immigration-ice-us-politics-live-news"
  },
  {
    "text": "Trump deploys California National Guard to LA to quell protests despite the governor's objections  —  President Donald Trump is deploying 2,000 California National Guard troops to Los Angeles over the objections of Gov. Gavin Newsom after a second day of clashes between hundreds of protesters … ",
    "url": "https://apnews.com/article/immigration-raids-los-angeles-2d1d5e2f638da600c4b34fe8bf8cf3aa"
  },
  {
    "text": "Trump activates National Guard after L.A.-area protests  —  California Gov. Gavin Newsom (D) condemned the move, saying it “will only escalate tensions.”  —  LOS ANGELES — President Donald Trump has ordered the California National Guard to Los Angeles to intervene in protests of immigration sweeps … ",
    "url": "https://www.washingtonpost.com/politics/2025/06/07/los-angeles-immigration-protests-national-guard/"
  },
  {
    "text": "The National Guard in Los Angeles  —  The president hasn't invoked the Insurrection Act.  He's instead relying on a theory of inherent constitutional power that is far more limited.  —  Meet The Authors … Late yesterday, President Donald Trump signed a Presidential Proclamation mobilizing … ",
    "url": "https://www.lawfaremedia.org/article/the-national-guard-in-los-angeles"
  },
  {
    "text": "Breaking With Trump, Bacon Says He Won't Follow His Party ‘Off the Cliff’ … Representative Don Bacon, Republican of Nebraska, has publicly accused President Trump of treating Russia with “velvet gloves,” criticized him for gutting AmeriCorps and questioned his power to impose tariffs without congressional approval.",
    "url": "https://www.nytimes.com/2025/06/08/us/politics/breaking-with-trump-bacon-says-he-wont-follow-his-party-off-the-cliff.html"
  },
  {
    "text": "Colombia presidential hopeful shot in head at rally  —  A Colombian presidential candidate has been shot three times - reportedly twice in the head - at a campaign event in the capital, Bogota.  —  Miguel Uribe Turbay, 39, was attacked while addressing a small crowd in a park on Saturday.",
    "url": "https://www.bbc.com/news/articles/c9dq8yxxy8zo"
  },
  {
    "text": "MAGA's blue-collar base waits patiently for populist payoff  —  President Trump's second term has been a payday for the powerful, exposing a disconnect in his promise to deliver for “the forgotten man” of America's working class.  —  Why it matters: The populist paradox at the heart of MAGA … ",
    "url": "https://www.axios.com/2025/06/08/trump-billionaires-working-class-paradox"
  },
  {
    "text": "Trump's deportation program nets positive approval amid contrasting views over its scope, CBS News poll finds  —  Views of the Trump administration's deportation program headed into this weekend with positive net approval from Americans, including continued strong backing from the Republican base … ",
    "url": "https://www.cbsnews.com/news/deportation-immigration-opinion-poll/"
  },
  {
    "text": "MAGA Melts Down at ABC Reporter Over Stephen Miller Takedown  —  MAGA is going off on an ABC reporter who dared attack White House Deputy Chief of Staff Stephen Miller.  ABC's Terry Moran wrote Saturday night on X that “what's interesting about [Stephen] Miller” is “not brains.",
    "url": "https://www.thedailybeast.com/maga-melts-down-at-trump-interviewer-terry-moran-over-stephen-miller-takedown/"
  },
  {
    "text": "Corruption Has Flooded America.  The Dams Are Breaking.  —  President Trump has more than doubled his personal wealth since starting his 2024 election campaign.  Billions of foreign dollars have flowed into his family's real estate and crypto ventures.  A plane that doubles as a … ",
    "url": "https://www.nytimes.com/2025/06/08/opinion/trump-corruption.html?unlocked_article_code=1.NU8.jCkk.kM7pW4UtRZHq&smid=url-share"
  },
  {
    "text": "Donald Trump Is Destroying the Economy and Waging War on the Poor  —  Trump and MAGAnomics are wrecking the economy, dismantling democracy, and making America backward again  —  f you weren't deeply afraid months ago of what a second Trump administration would mean, you weren't paying attention.",
    "url": "https://www.rollingstone.com/politics/politics-features/donald-trump-is-destroying-the-economy-and-waging-war-on-the-poor-an-1235356280/"
  },
  {
    "text": "Southern Baptists to Vote on Effort to Overturn Same-Sex Marriage  —  Motivated by their success in reversing Roe v. Wade, conservative Christian activists have a new target in Obergefell v. Hodges.  They see early signs of promise.  —  Southern Baptists plan to vote this week on acting … ",
    "url": "https://www.nytimes.com/2025/06/08/us/same-sex-marriage-baptists-obergefell.html?unlocked_article_code=1.NU8.pk1-.FvhNNWKcXj-4&smid=url-share"
  },
  {
    "text": "It's Opening Night for the MAGA Makeover of the Kennedy Center  —  Ticket sales are down amid Trump's planned overhaul of national arts center, which includes ‘common sense’ programming, a prayer wall and refurbished decor; $2 million gold-tier fundraiser  —  When the curtain rises … ",
    "url": "https://www.wsj.com/business/media/maga-kennedy-center-trump-b9cc7589?st=jf4h3E&reflink=article_copyURL_share"
  },
  {
    "text": "Law Enforcement Officials Struggle to Fulfill Trump Promises Rooted in Conspiracy Theories  —  Top leaders at the Justice Department and the F.B.I. are struggling to fulfill Trump campaign promises often rooted in misinformation and conspiracy theories.  —  Dan Bongino, the intense … ",
    "url": "https://www.nytimes.com/2025/06/08/us/politics/justice-department-fbi-trump-conspiracy-theories.html?unlocked_article_code=1.NU8.w3nB.63piUyYsHncb&smid=url-share"
  },
  {
    "text": "Sometimes a Parade Is Just a Parade  —  Not everything the Trump administration does is a threat to democracy.  —  President Donald Trump has gotten his way and will oversee a military parade in Washington, D.C., this summer on the Army's birthday, which also happens to be his own.",
    "url": "https://www.theatlantic.com/politics/archive/2025/06/trump-military-parade-ok/683050/"
  }
]