[
  {
    "text": "Google Explains Why Search for ‘Where Can I Vote for Harris’ Showed a Map While Similar Trump Search Didn't … Earlier Tuesday, searches on Google for “Where can I vote for Harris?” displayed a “Where to vote” map that lets uses enter their street address to find their polling location.",
    "url": "https://variety.com/2024/digital/news/google-search-where-can-i-vote-for-harris-trump-map-1236201473/"
  },
  {
    "text": "How Trump Accidentally Let His Biggest Advantage Over Harris Slip Away  —  If you've spent time on social media lately, you've surely encountered the argument that Kamala Harris and Democrats have squandered way too much time and resources on attacking Donald Trump as a sexual predator, dangerous madman, and wannabe fascist dictator.",
    "url": "https://newrepublic.com/article/187950/trump-2024-election-advantage-harris-slip-away"
  },
  {
    "text": "Election Live Updates: A Caustic and Turbulent Race Is in Voters' Hands  — Polls in parts of Indiana and Kentucky have closed, and voting ends in six more states including Georgia, a key battleground, at 7 p.m. Eastern time.  Turnout looked strong in an election that Vice President Kamala Harris … ",
    "url": "https://www.nytimes.com/live/2024/11/05/us/trump-harris-election"
  },
  {
    "text": "Florida's abortion amendment fails, leaving 6-week ban in place  —  Florida's abortion-rights ballot initiative fell short of passing on Tuesday, leaving in place a six-week abortion ban that has helped restrict access across almost all of the Southern U.S.  —  The measure's defeat … ",
    "url": "https://thehill.com/policy/healthcare/4969765-florida-abortion-rights-ballot/"
  },
  {
    "text": "NBC News Exit Poll: Voters express deep concern about America's democracy and economy  —  Women are twice as likely as men to rank abortion as their top issue, according to preliminary results from the national survey.  —  The state of democracy and the economy in the United States … ",
    "url": "https://www.nbcnews.com/politics/2024-election/nbc-news-exit-poll-voters-express-concern-democracy-economy-rcna178602"
  },
  {
    "text": "NBC News Exit Poll: Harris loses ground with Latinos  —  NBC News Exit Poll Desk  —  Latino men are breaking for Trump by a 10-point margin, 54% to 44%, in a major reversal from four years ago, according to the NBC News Exit Poll.  In 2020, Latino men backed Biden over Trump by a 23-point margin, 59% to 36%.",
    "url": "https://www.nbcnews.com/politics/2024-election/live-blog/presidential-election-2024-live-updates-rcna175556/rcrd62776?canonicalCard=true"
  },
  {
    "text": "Election 2024 live updates: Latest news and results as Americans head to the polls to vote for Trump or Harris  —  Control of the House, Senate and many key states is also up for grabs, in addition to a number of crucial ballot measures. … Arab American voters in Michigan opt for third-party candidate Jill Stein",
    "url": "https://www.nbcnews.com/politics/2024-election/live-blog/presidential-election-2024-live-updates-rcna175556#rcrd62376"
  },
  {
    "text": "Live Presidential Forecast  —  Our election model estimates the outcome of the race in real time based on polling data, the votes reported so far and what we expect from remaining votes.  Read how it works ›  —  Chance of winning  —  No estimates yet",
    "url": "https://www.nytimes.com/interactive/2024/11/05/us/elections/results-president-forecast-needle.html"
  },
  {
    "text": "Sarah McBride becomes the first out transgender person elected to Congress  —  McBride, a Democrat who served two terms as a state senator, wins Delaware's only House seat, NBC News projects.  —  WILMINGTON, Del. — Delaware state Sen. Sarah McBride won the state's only House seat Tuesday … ",
    "url": "https://www.nbcnews.com/nbc-out/out-politics-and-policy/sarah-mcbride-first-transgender-congress-delaware-rcna177878"
  },
  {
    "text": "Non-credible bomb threats against Atlanta-area polling places were from Russia, secretary of state says  —  Several non-credible bomb threats that briefly disrupted voting at two Georgia polling places originated from Russia, Georgia Secretary of State Brad Raffensperger told reporters Tuesday.",
    "url": "https://www.cnn.com/2024/11/05/us/georgia-non-credible-bomb-threat-russia/"
  },
  {
    "text": "Israel's Netanyahu dismisses his defense minister as wars rage.  Protests erupt across country  —  Israeli Prime Minister Benjamin Netanyahu on Tuesday dismissed his popular defense minister, Yoav Gallant, in a surprise announcement that came as the country is embroiled in wars on multiple fronts across the region.",
    "url": "https://apnews.com/article/israel-netanyahu-gallant-gaza-war-lebanon-3810d3adb1603e8485b4be46a5b79f8b"
  },
  {
    "text": "Musk to Spend Election Night With Trump  —  Elon Musk has spent $119 million on a super PAC supporting Donald Trump and held events on his behalf.  But his ownership of X is especially valuable.  —  Elon Musk plans to spend election night with former President Donald J. Trump … ",
    "url": "https://www.nytimes.com/2024/11/05/us/politics/elon-musk-trump-election-night.html"
  },
  {
    "text": "Andy Kim Wins in New Jersey to Become the First Korean American Senator  —  Mr. Kim, a Democrat, will take the seat previously held by Robert Menendez, who resigned after being convicted of taking bribes.  —  Representative Andy Kim was elected on Tuesday to the U.S. Senate … ",
    "url": "https://www.nytimes.com/2024/11/05/nyregion/nj-senate-kim-bradshaw.html"
  },
  {
    "text": "Supreme Court: Cobb County absentee ballots must be returned by Election Day  —  The court sided with the Republican National Committee, removing the relief that a lower court ordered.  —  The Georgia Supreme Court on Monday ordered that Cobb County may only count absentee ballots received by 7 p.m. on Election Day.",
    "url": "https://www.ajc.com/politics/cobb-county-absentee-ballots-must-be-returned-by-election-day-georgia-supreme-court-rules/7DHUDZ4IARGOLDHYPR53AI7PYU/"
  },
  {
    "text": "X Is a White-Supremacist Site … X has always had a nazi problem.  I've covered the site, formerly known as Twitter, for more than a decade and reported extensively on its harassment problems, its verification (and then de-verification) of a white nationalist, and the glut of anti-Semitic hatred that roiled the platform in 2016.",
    "url": "https://www.theatlantic.com/technology/archive/2024/11/x-white-supremacist-site/680538/?gift=bQgJMMVzeo8RHHcE1_KM0T8uB7iimO1-elCapdzG8XE&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Trump campaign denies and revokes journalists' election night credentials after critical coverage  —  New York CNN  —  Journalists from multiple news organizations have been denied credentials to former President Donald Trump's election night watch event in West Palm Beach, Florida … ",
    "url": "https://www.cnn.com/2024/11/05/media/trump-revokes-journalists-election-night-credentials/"
  },
  {
    "text": "Trump votes, and then utters 15 falsehoods in 15 minutes  —  The former president couldn't resist repeating his greatest hits on crime, immigration, elections and Oprah's last show.  —  Former president Donald Trump cast his ballot in West Palm Beach, Florida, on Tuesday and then spoke to reporters.",
    "url": "https://www.washingtonpost.com/politics/2024/11/05/trump-votes-then-utters-15-falsehoods-15-minutes/"
  },
  {
    "text": "Democrat Josh Stein defeats Republican Mark Robinson in N.C. governor's race  —  NBC News projects Stein will keep the governorship in Democrats' hands after a campaign that was defined by Robinson's litany of inflammatory statements.  —  North Carolina Attorney General Josh Stein defeated … ",
    "url": "https://www.nbcnews.com/politics/2024-election/mark-robinson-loses-north-carolina-governor-josh-stein-rcna173891"
  },
  {
    "text": "How are things looking in Pennsylvania?  Dems are feeling cautiously optimistic  —  How are Democrats feeling in Pennsylvania, the most pivotal battleground in the country?  Cautiously optimistic.  I surveyed 10 Dem elected officials and strategists across the state and, to a person … ",
    "url": "https://www.politico.com/live-updates/2024/11/05/2024-election-results-live-coverage-updates-analysis/pennsylvania-vibe-check-early-00187540"
  },
  {
    "text": "Milwaukee rerunning more than 30,000 absentee ballots over error, delaying results  —  Vanessa Swales Alison DirrMilwaukee Journal Sentinel  —  The City of Milwaukee restarted the processing about 31,000 absentee ballots after an election observer brought to officials' attention that doors covering … ",
    "url": "https://www.jsonline.com/story/news/politics/elections/2024/11/05/milwaukee-rerunning-more-than-30000-ballots-over-machine-error/76078233007/"
  },
  {
    "text": "Greene easily wins reelection in Georgia  —  GOP Rep. Marjorie Taylor Greene (Ga.) easily won reelection Tuesday, fending off a challenge from Democrat Shawn Harris, a retired Army general, in Georgia's deep-red 14th District, Decision Desk HQ projects.  —  The outcome was never in question … ",
    "url": "https://thehill.com/homenews/campaign/4972962-marjorie-taylor-greene-georgia/"
  },
  {
    "text": "Trump projected to win Texas, Wyoming, Dakotas; update on battlegrounds  —  CBS News projects that former President Donald Trump will win Texas, Wyoming, North Dakota and South Dakota.  CBS News chief Washington correspondent Major Garrett gives an update on the battleground states of Georgia, North Carolina and Pennsylvania.",
    "url": "https://www.cbsnews.com/video/trump-projected-win-texas-wyoming-dakotas-update-battlegrounds/"
  },
  {
    "text": "Elon Musk is sued over $1 million election giveaway  —  Elon Musk was sued in a proposed class action on Tuesday by registered voters who signed his petition to support the Constitution for a chance to win his $1 million-a-day giveaway, and now claim it was a fraud.",
    "url": "https://www.reuters.com/legal/elon-musk-is-sued-over-1-million-election-giveaway-2024-11-05/"
  },
  {
    "text": "Ukrainian troops have engaged with North Korean units for the 1st time in Russia, an official says  —  Ukrainian troops have for the first time engaged with North Korean units that were recently deployed to help Russia in the war with its neighbor, Ukraine's defense minister said Tuesday.",
    "url": "https://apnews.com/article/russia-ukraine-war-north-korea-troops-c8cf9599591e50caf1c48a98b6841fe4"
  },
  {
    "text": "AP Race Call: Democrat Angela Alsobrooks wins election to U.S. Senate from Maryland  —  The Associated Press is an independent global news organization dedicated to factual reporting.  Founded in 1846, AP today remains the most trusted source of fast, accurate, unbiased news in all formats … ",
    "url": "https://apnews.com/article/race-call-alsobrooks-wins-maryland-senate-2ec2424eb07641cdb43dbb2ec8f053dc"
  },
  {
    "text": "Democrat Wesley Bell wins race for Cori Bush's House seat  —  St. Louis Prosecuting Attorney Wesley Bell will win his House race to represent Missouri's 1st Congressional District, Decision Desk HQ projects.  —  Bell's defeat of Republican Andrew Jones is no surprise in the solidly Democratic district … ",
    "url": "https://thehill.com/homenews/campaign/4970414-democrat-wesley-bell-missouri-house/"
  },
  {
    "text": "Texas church removes four elders over Trump-linked founder's abuse of girl, 12, in 1980s  —  Church said leaders ‘failed to inquire further’ after learning Robert Morris, ex-Trump adviser, molested girl for years  —  A Dallas-area Christian megachurch has removed four of its elders … ",
    "url": "https://www.theguardian.com/us-news/2024/nov/05/gateway-church-founder-child-sex-abuse-texas"
  },
  {
    "text": "Trump-loving evangelical leader busted with hard drive full of appalling images  —  The former head of a Christian conservative voter outreach has been arrested for possession of child sexual abuse materials.  —  Jason C. Yates, former CEO of My Faith Votes, has been charged in Minnesota … ",
    "url": "https://www.rawstory.com/jason-yates-my-faith-votes/"
  }
]