[
  {
    "text": "Donald's Desperate Demand: Trump Files for Mistrial in New York Bank Fraud Case  —  Trump's lawyers made a 30-page court filing on Wednesday seeking a mistrial, a move they've telegraphed for a while but still marks a new low in the case. … Seeing no way out of his bank fraud trial … ",
    "url": "https://www.thedailybeast.com/donalds-desperate-demand-trump-files-for-mistrial-in-new-york-bank-fraud-case"
  },
  {
    "text": "Trump files motion for mistrial in NY fraud case  —  Former President Trump's legal team on Wednesday requested a mistrial in his New York fraud case, claiming that the trial judge and his principal law clerk's purported bias against Trump has “tainted” the case.",
    "url": "https://thehill.com/regulation/court-battles/4310913-trump-files-motion-for-mistrial-in-ny-fraud-case/"
  },
  {
    "text": "Ethics Committee will not recommend punishment for embattled Rep. George Santos  —  The New York Republican has pleaded not guilty to charges and defended himself.  —  Rep. George Santos walks back to his office after debate on the House floor on a resolution to expel him from Congress … ",
    "url": "https://abcnews.go.com/Politics/ethics-committee-recommend-punishment-embattled-rep-george-santos/story?id=104913312"
  },
  {
    "text": "New Hampshire 2024: Haley Surges to Second Place While Trump Maintains Lead  —  Haley Outperforms Trump and DeSantis Against Biden Among New Hampshire Voters  —  A new Emerson College Polling/WHDH poll of New Hampshire voters finds former President Donald Trump with 49% of voters' support … ",
    "url": "https://emersoncollegepolling.com/new-hampshire-2024-haley-surges-to-second-place-while-trump-maintains-lead/"
  },
  {
    "text": "Sen. Joe Manchin says he ‘absolutely’ would consider a presidential run  —  In an interview with NBC's Kristen Welker, the West Virginia Democrat said he first has to explore whether there's an appetite among voters for a moderate candidate like him.  —  WASHINGTON — Sen. Joe Manchin … ",
    "url": "https://www.nbcnews.com/politics/2024-election/sen-joe-manchin-says-absolutely-consider-presidential-run-rcna125368"
  },
  {
    "text": "Nevada attorney general is investigating false electors who aided Trump in 2020  —  The attorney general of Nevada is quietly investigating Republican activists and operatives who falsely pledged the state's six electoral votes to Donald Trump in 2020, despite Joe Biden's victory in the state.",
    "url": "https://www.politico.com/news/2023/11/15/nevada-false-electors-trump-investigation-00127369"
  },
  {
    "text": "Speaker Mike Johnson calls separation of church and state a “misnomer” … Of course it comes from a phrase that was in a letter that [Thomas] Jefferson wrote, it's not in the Constitution,\" Johnson said.  — “What he was explaining is they did not want the government to encroach upon the church … ",
    "url": "https://www.axios.com/2023/11/15/mike-johnson-separation-church-state-misnomer"
  },
  {
    "text": "US public support for Israel drops; majority backs a ceasefire, Reuters/Ipsos shows  —  U.S. public support for Israel's war against Hamas militants in Gaza is eroding and most Americans think Israel should call a ceasefire to a conflict that has ballooned into a humanitarian crisis, according to a new Reuters/Ipsos poll.",
    "url": "https://www.reuters.com/world/us-public-support-israel-drops-majority-backs-ceasefire-reutersipsos-2023-11-15/"
  },
  {
    "text": "How the next Republican president could stop most abortions without Congress  —  The next Republican president could effectively ban most abortions through a simple policy change at the Department of Justice, experts and advocates on both sides of the abortion debate say.",
    "url": "https://www.axios.com/2023/11/15/us-abortion-ban-republican-president-2024-trump"
  },
  {
    "text": "Hundreds of Jewish Marchers Left Stranded by ‘Malicious’ Bus Drivers  —  Three hundred Jewish marchers never made it to Tuesday's “March for Israel” in Washington, D.C., in what is being described as the “deliberate and malicious” actions of some bus drivers.",
    "url": "https://redstate.com/terichristoph/2023/11/15/deliberate-and-malicious-300-jewish-marchers-left-stranded-when-bus-drivers-refused-to-drive-them-n2166368"
  },
  {
    "text": "House GOP starts Thanksgiving recess early after hardliners revolt on spending bill  —  House Republicans are leaving D.C. early for Thanksgiving recess after a group of conservatives brought down a procedural vote on an appropriations bill. … - Nineteen conservative hardliners bucked party lines … ",
    "url": "https://www.axios.com/2023/11/15/house-republicans-thanksgiving-recess-votes"
  },
  {
    "text": "Rashida Tlaib member of secret Facebook group where Hamas terrorists glorified  —  ‘Squad’ member has been part of controversial group for 6 years  —  EXCLUSIVE: Rep. Rashida Tlaib is part of a secret social media group in which its members have glamorized Hamas in its war battle with Israel … ",
    "url": "https://www.foxnews.com/politics/rashida-tlaib-member-secret-facebook-group-where-hamas-terrorists-glorified"
  },
  {
    "text": "Silicon Valley's worldview is not just an ideology; it's a personality disorder.  —  Silicon Valley's ideology is this: Libertarianism for me.  Feudalism for thee.  —  In more detail:  —  • Surveillance, manipulation and coercion; at first, just for profit, later by necessity, and ultimately for the hell of it",
    "url": "https://crookedtimber.org/2023/11/15/silicon-valleys-worldview-is-not-just-an-ideology-its-a-personality-disorder/"
  },
  {
    "text": "Oklahoma Supreme Court blocks abortion restrictions  —  The Oklahoma Supreme Court placed temporary injunctions on three laws regulating abortion and abortion pills on Tuesday, signaling that the state's high court could soon weigh whether abortion rights are implied in the state constitution.",
    "url": "https://www.washingtonexaminer.com/policy/healthcare/oklahoma-supreme-court-blocks-abortion-restrictions"
  },
  {
    "text": "Where Does Religion Come From?  —  Ayaan Hirsi Ali, the ex-Muslim critic of Islamic fundamentalism and longtime champion of Enlightenment liberalism, has announced that she now calls herself a Christian — a conversion that she attributes to a twofold realization.",
    "url": "https://www.nytimes.com/2023/11/15/opinion/religion-christianity-belief.html"
  },
  {
    "text": "Montgomery teacher denies Hamas raid, accuses Israel of organ theft  —  An educator at Tilden Middle School ‘may be on leave’ after screenshots showed a Facebook post of hers containing misinformation about Israel  —  A Montgomery County teacher “may be on leave” after screenshots … ",
    "url": "https://www.washingtonpost.com/education/2023/11/15/antisemitism-montgomery-county-teacher/"
  },
  {
    "text": "New York's top court hears Democratic attempt to draw new congressional maps  —  There were few signs that any of the six judges who heard the case last year were poised to side with different parties this time.  —  BUFFALO, N.Y. — New York's top court heard oral arguments Wednesday in a case … ",
    "url": "https://www.politico.com/news/2023/11/15/redistricting-new-york-00127438"
  },
  {
    "text": "GOP Sen. Mullin Says His Offer to Brawl With Union Leader Was ‘Oklahoma Values’  —  WHOLESOME  —  Sen. Markwayne Mullin (R-OK) said he was nobly representing “Oklahoma values” when he challenged a union boss to a fight Tuesday.  A meeting of the Senate HELP Committee went off the rails … ",
    "url": "https://www.thedailybeast.com/gop-sen-mullin-says-his-offer-to-brawl-with-union-leader-was-oklahoma-values"
  },
  {
    "text": "Biden compares Trump's ‘vermin’ remarks to Nazi rhetoric  —  Biden slammed former President Donald Trump's remarks last weekend that characterized his political opponents as “vermin” who pose threats within the country.  —  President Joe Biden on Tuesday decried former President Donald … ",
    "url": "https://www.nbcnews.com/politics/2024-election/biden-compares-trumps-vermin-remarks-nazi-rhetoric-rcna125266"
  },
  {
    "text": "Biden campaign considers changing digital fundraising platforms  —  The Biden campaign is testing alternatives to ActBlue, the small-dollar behemoth that powered much of Democrats' anti-Trump fundraising machine.  —  President Joe Biden's campaign is mulling a significant change … ",
    "url": "https://www.politico.com/news/2023/11/15/biden-campaign-actblue-online-donations-00127404"
  },
  {
    "text": "New Hampshire sets presidential primary date for Jan. 23, defying Biden's new primary order  —  New Hampshire's first-in-the-nation GOP primary will come after Iowa, but state Democrats will face punishment from the DNC for leapfrogging South Carolina.  —  CONCORD, N.H. … ",
    "url": "https://www.nbcnews.com/politics/2024-election/new-hampshire-sets-presidential-primary-date-jan-23-defying-bidens-new-rcna125161"
  },
  {
    "text": "Luxembourg's Former Finance Chief Frieden to Become Its New Premier  — Frieden will take over from Bettel after 10 years in post  — Outgoing prime minister will become foreign minister  —  Luc Frieden is set to make a surprise comeback as Luxembourg's prime minister 10 years … ",
    "url": "https://www.bloomberg.com/news/articles/2023-11-15/former-finance-chief-frieden-to-become-luxembourg-s-new-premier"
  },
  {
    "text": "GOP at Fault If Government Shuts Down, Say Nearly Half of Americans  —  If the federal government fails to reach a spending agreement and shuts down, nearly half of Americans will point a finger at congressional Republicans.  Most Americans also express displeasure with members of Congress using … ",
    "url": "https://maristpoll.marist.edu/polls/the-looming-government-shutdown/"
  },
  {
    "text": "Biden Unlocks Fresh Funds to Iran Totaling Billions  —  The Biden administration on Tuesday reapproved a sanctions waiver that will allow Iran to access upward of $10 billion in frozen assets, the State Department confirmed to the Washington Free Beacon.  —  The sanctions waiver … ",
    "url": "https://freebeacon.com/biden-administration/biden-unlocks-fresh-payments-to-iran-totaling-billions/"
  }
]