[
  {
    "text": "Disaster for Trump as Truth Social Crashes at Critical SOTU Moment  —  The former president heavily promoted his live reactions prior to President Joe Biden's SOTU speech.  But when it came time, Trump's promises crashed and burned.  —  Donald Trump may have rage-posted … ",
    "url": "https://www.thedailybeast.com/disaster-for-trump-as-truth-social-crashes-at-critical-sotu-moment"
  },
  {
    "text": "The First Part Of Joe Biden's Speech Was SO Important  —  The theme of the week here has been the importance of looking backward.  —  Not that Democrats need to give themselves over to slagging Donald Trump and the GOP 100 percent of the time.  Democrats without a policy agenda would be doomed.",
    "url": "https://www.offmessage.net/p/first-part-biden-sotu-important"
  },
  {
    "text": "Biden chatted for so long after State of the Union, the lights went down  —  President Biden didn't seem to want State of the Union night to end.  —  Biden took about 35 minutes between finishing his speech and exiting the House chamber — shaking hands, chatting with members of Congress … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/08/biden-sotu-exit-walk-lights-off-house/"
  },
  {
    "text": "Biden electrifies Democrats, spars with Republicans in fiery State of the Union address  — President Joe Biden delivered a fiery, partisan State of the Union address fit for an election year.  — When Republicans booed a bipartisan immigration security bill, “Oh, you don't think so?",
    "url": "https://www.cnbc.com/2024/03/07/biden-state-of-the-union-address-to-lay-out-economic-vision-.html"
  },
  {
    "text": "Remarks of President Joe Biden — State of the Union Address As Prepared for Delivery  —  Good evening.  —  Mr. Speaker.  Madam Vice President.  Members of Congress.  My Fellow Americans.  —  In January 1941, President Franklin Roosevelt came to this chamber to speak to the nation.",
    "url": "https://www.whitehouse.gov/briefing-room/speeches-remarks/2024/03/07/remarks-of-president-joe-biden-state-of-the-union-address-as-prepared-for-delivery-2/"
  },
  {
    "text": "Truth Social Suffers Outage in Middle of Trump's Furious Live-Tweeting About Biden Speech  —  “THE DRUGS ARE WEARING OFF!”  Trump wrote without any further context, making it's unclear if he was talking about Biden or himself.  —  Truth Social, the social media platform launched by Donald Trump in 2022 … ",
    "url": "https://gizmodo.com/truth-social-down-outage-trump-biden-state-of-the-union-1851318732"
  },
  {
    "text": "The Smart Political Strategy Behind Biden's Big Speech  —  Last night was a very good night for Joe Biden.  The President delivered a vigorous, pugilistic speech with the highest possible stakes for his presidency.  He was strong and in command.  Most importantly, he made his best case yet for reelection.",
    "url": "https://www.messageboxnews.com/p/the-smart-political-strategy-behind"
  },
  {
    "text": "Official GOP Response to SOTU Has Republicans ‘Losing It’  —  Sen. Katie Britt of Alabama gave the GOP response to President Biden's annual address—which got panned by some in her own party.  —  As President Joe Biden mingled on the House floor following his State of the Union address Thursday night … ",
    "url": "https://www.thedailybeast.com/official-katie-britt-gop-response-to-state-of-the-union-has-republicans-losing-it"
  },
  {
    "text": "Republican Katie Britt Ruthlessly Mocked for SOTU Response  —  Alabama Senator Katie Britt on Thursday faced widespread backlash after delivering the Republican Party's response to President Joe Biden's State of the Union address.  —  Many users on X, formerly Twitter … ",
    "url": "https://www.newsweek.com/republican-katie-britt-ruthlessly-mocked-sotu-response-1877151"
  },
  {
    "text": "‘What the Hell Am I Watching’: Republicans Torch Their Own SOTU Rebuttal  —  Alabama Sen. Katie Britt was panned after delivering the most bizarre State of the Union rebuttal in recent memory  —  THE RITUAL SURROUNDING the annual State of the Union is never complete until the president's opposition … ",
    "url": "https://www.rollingstone.com/politics/politics-news/katie-britt-sotu-rebuttal-torched-republicans-1234983528/"
  },
  {
    "text": "Trump loses bid to delay $83.3 million E. Jean Carroll defamation judgment  — Donald Trump lost a bid to delay paying an $83.3 million civil defamation judgment to writer E. Jean Carroll.  — Trump had asked Manhattan federal Judge Lewis Kaplan to delay the judgment from taking effect until … ",
    "url": "https://www.cnbc.com/2024/03/07/trump-loses-bid-to-delay-83point3-million-e-jean-carroll-judgment.html"
  },
  {
    "text": "Hot streak for American jobs continues in early months of 2024  —  The unemployment rate has now been below 4% for 25 consecutive months — a streak unseen in the United States since the 1960s.  —  Expectations heading into this morning showed projections of about 198,000 new jobs having been added in the United States in February.",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/hot-streak-american-jobs-continues-early-months-2024-rcna142417"
  },
  {
    "text": "Father of Marine Killed in Afghanistan Is Arrested During Biden's Address  —  Steve Nikoui yelled “Abbey Gate, Abbey Gate” during the speech, a reference to where his son, Lance Cpl. Kareem Nikoui, and 12 other troops were killed during the chaotic final days of the U.S. presence in Kabul.",
    "url": "https://www.nytimes.com/2024/03/08/us/politics/abbey-gate-yelling-state-of-union.html"
  },
  {
    "text": "Expelled congressman George Santos plans another House bid  —  Santos looks to unseat one of the Republicans who led a bipartisan effort to oust him in December  —  Expelled New York Republican congressman George Santos said he will again run for office, this time against one of the Republicans … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/08/santos-congress-campaign-2024/"
  },
  {
    "text": "Big oil's big deception: That plastics are recyclable  —  Plastic pollution is everywhere.  We eat it.  We drink it.  We breathe it.  It is on the summit of Mount Everest and at the bottom of the oceans.  Not only is it in human breast milk, but, according to one study … ",
    "url": "https://thehill.com/opinion/energy-environment/4513908-big-oils-big-deception-that-plastics-are-recyclable/"
  },
  {
    "text": "US embassy warns of imminent attack in Moscow by ‘extremists’  —  The U.S. embassy in Russia warned that “extremists” had imminent plans for an attack in Moscow, hours after Russian security services said they had foiled a planned shooting at a synagogue by a cell from the Afghan arm of Islamic State.",
    "url": "https://www.reuters.com/world/us-embassy-warns-imminent-extremist-attack-moscow-2024-03-08/"
  },
  {
    "text": "Biden Calls Out SCOTUS To Their Faces: Women Have Political Power  —  It remains unspoken that the incoming Democratic majority will look at expanding the Court.  —  Video  —  Can you help us out?  —  For nearly 20 years we have been exposing Washington lies and untangling media deceit … ",
    "url": "https://crooksandliars.com/2024/03/biden-warns-scotus-women-have-political"
  }
]