[
  {
    "text": "Trump under oath: Six things to watch for as the former president testifies  —  Trump will take the stand in a case that could unravel his business empire.  —  NEW YORK — On Monday, Donald Trump will leave the campaign trail for a place where he'll still be the center of attention: a witness box.",
    "url": "https://www.politico.com/news/2023/11/06/trump-civil-fraud-trial-testimony-00125458"
  },
  {
    "text": "She Tangled with Trump in a Deposition.  Here's Her Strategy When He's Under Oath.  —  “Just let him talk.  I got exactly what I wanted by letting him talk.”  —  Former President Donald Trump and his family are accused of fraudulently inflating Trump's net worth in a case that could upend his New York businesses.",
    "url": "https://www.politico.com/news/magazine/2023/11/06/tips-questioning-trump-under-oath-00125439"
  },
  {
    "text": "Ivanka Is Not Going to Save Trump in His New York Fraud Trial—and He's Not Going to Save Himself  —  His daughter is the only non-defendant among the Trumps, but Daddy shouldn't expect her to come to his rescue when she testifies. … Former President Donald Trump boasts about his children following in his footsteps.",
    "url": "https://www.thedailybeast.com/ivanka-is-not-going-to-save-trump-in-new-york-fraud-trial"
  },
  {
    "text": "Trump Indictments Haven't Sunk His Campaign, but a Conviction Might  —  Polls by The New York Times and Siena College show his strength in key swing states, in part because of concerns about President Biden's age.  But a conviction could be the difference in 2024.",
    "url": "https://www.nytimes.com/2023/11/06/us/politics/trump-biden-times-siena-poll.html"
  },
  {
    "text": "Behind the Curtain: Biden's race problem  —  President Biden has a growing race problem. … Now this is an alarming, re-election-threatening, full-blown crisis for the White House.  — It's clear from consistent trends across multiple polls that Biden is bleeding support among Hispanic voters … ",
    "url": "https://www.axios.com/2023/11/06/biden-black-hispanic-voters-losing-polls"
  },
  {
    "text": "Senate GOP campaign arm whacks Meijer for entering Michigan Senate race  —  Meijer “isn't viable” in the primary, the NRSC warned in a forceful statement.  —  Former Michigan Rep. Peter Meijer's announcement that he would make a run for the state's Senate seat was met with a less … ",
    "url": "https://www.politico.com/news/2023/11/06/peter-meijer-nrsc-pushback-00125514"
  },
  {
    "text": "We have obtained EXCLUSIVE access to the Nashville Covenant shooter's manifesto  —  BREAKING: Nashville Trans Manifesto Leaked “I Hope I Have A High Death Count”; Shooter Specifically Targeted Students With “White Privileges” And Was “Ready to Die”  — Louder with Crowder … ",
    "url": "https://www.louderwithcrowder.com/nashville-shooters-manifesto"
  },
  {
    "text": "“Apocalypticism”: Polling expert reveals the root of “panic among conservative White Christians”  —  “That core belief explains so much of the extremism and the proclivity toward violence on the political right”  —  This year's American Values Survey, conducted by the Public Religion Research Institute … ",
    "url": "https://www.salon.com/2023/11/06/apocalypticism-polling-expert-reveals-the-root-of-panic-among-conservative-christians/"
  },
  {
    "text": "Trump administration considered ideological ‘screenings’ of noncitizens  —  Ice examined implications of expelling foreign nationals from the US for their political beliefs, unsealed documents show  —  During Donald Trump's presidency, Immigration and Customs Enforcement (Ice) … ",
    "url": "https://www.theguardian.com/us-news/2023/nov/06/trump-administration-ice-immigration-noncitizens-ideological-screenings-memo"
  },
  {
    "text": "Indy police arrest ‘terrorist’ for purposely driving her car into what she thought was a Jewish school  —  INDIANAPOLIS — IMPD officers arrested a woman, who they labeled a “terrorist,” after she drove her car into a building that she thought was a Jewish school.",
    "url": "https://fox59.com/news/indy-police-arrest-terrorist-for-purposely-driving-her-car-into-home-used-by-hate-group/"
  },
  {
    "text": "Donald Trump's Gift to Adam Schiff  —  This article was featured in One Story to Read Today, a newsletter in which our editors recommend a single must-read from The Atlantic, Monday through Friday.  Sign up for it here.  —  Representative Adam Schiff was mingling his way through a friendly crowd … ",
    "url": "https://www.theatlantic.com/politics/archive/2023/11/adam-schiff-2024-california-senate-race-trump/675880/"
  },
  {
    "text": "FACT SHEET: President Biden Advances Vision for World Class Passenger Rail by Delivering Billions in New Funding  —  $16.4 Billion from Bipartisan Infrastructure Law to Repair and Replace Critical Rail Infrastructure Along Northeast Corridor to Provide Faster and More Reliable Passenger Rail Experience … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2023/11/06/fact-sheet-president-biden-advances-vision-for-world-class-passenger-rail-by-delivering-billions-in-new-funding/"
  },
  {
    "text": "How Republicans are using congressional maps to entrench their power  —  Michael Li on the state of gerrymandering one year out from the 2024 election.  —  ∙ Paid … The Supreme Court surprised many in June when it ruled that Alabama had to redraw its congressional district maps … ",
    "url": "https://www.publicnotice.co/p/michael-li-congressional-maps-gerrymander-2024"
  },
  {
    "text": "Boy killed, 5 wounded in Cincinnati mass shooting  —  A shooter fired 22 shots into a crowd in Cincinnati, Ohio on Friday, killing an 11-year-old boy and wounding four other children and an adult, according to local authorities.  —  The Cincinnati Police Department on Sunday said the occupant … ",
    "url": "https://thehill.com/homenews/4295119-boy-killed-5-wounded-in-cincinnati-mass-shooting/"
  }
]