[
  {
    "text": "Trump appeals to women in return to North Carolina without Mark Robinson, a top in-state supporter  —  Donald Trump returned to North Carolina on Saturday, stumping in the southern battleground state with direct appeals to women, claiming he would be a better champion for them than Vice President Kamala Harris … ",
    "url": "https://apnews.com/article/trump-mark-robinson-north-carolina-wilmington-1bc79594567860c9ffe7f44375fac847"
  },
  {
    "text": "Vance says allegations against Mark Robinson 'aren't necessarily reality'  —  Vance told NBC Philadelphia that it's “ultimately up to Mark Robinson and North Carolina whether he's going to be their governor and whether he wants to stay in the race.”  —  LEESPORT, Pa. — Sen. JD Vance … ",
    "url": "https://www.nbcnews.com/politics/2024-election/jd-vance-says-allegations-mark-robinson-arent-necessarily-reality-rcna172122"
  },
  {
    "text": "Harris accepts CNN debate invitation for October 23, again challenging Trump to another showdown  —  Vice President Kamala Harris on Saturday accepted an invitation from CNN to debate former President Donald Trump on October 23, challenging her rival to another engagement on a public stage in the final weeks of the campaign.",
    "url": "https://www.cnn.com/2024/09/21/politics/presidential-debate-harris-trump-cnn/"
  },
  {
    "text": "Kamala Harris Is the Clear Choice for President  —  One candidate has spent her career as a dedicated public servant, who believes government exists to serve the people, the other has divided the nation for his own personal gain  —  Flo Ngala for Rolling Stone  —  T",
    "url": "https://www.rollingstone.com/politics/political-commentary/kamala-harris-president-rolling-stone-endorsement-1235096166/"
  },
  {
    "text": "Kamala Harris plans to skip historic Al Smith dinner despite long-standing tradition: report  —  The Al Smith dinner has been a campaign tradition since 1960  —  Join Fox News for access to this content  —  Vice President Kamala Harris' presidential campaign reportedly announced Harris … ",
    "url": "https://www.foxnews.com/politics/kamala-harris-plans-skip-historic-al-smith-dinner-despite-long-standing-tradition-report"
  },
  {
    "text": "Barack Obama raises $4 million for Harris at L.A. fundraiser  —  The former president is adopting an increasingly visible role on the campaign trail for his longtime friend: “I'm pushing, and I hope you are, too,” he tells donors.  —  Former president Barack Obama headlined his first solo fundraiser … ",
    "url": "https://www.washingtonpost.com/elections/2024/09/21/obama-harris-trump-fundraiser/"
  },
  {
    "text": "Trump Melts Down And Attacks Bill Maher And Stephanie Ruhle As Election Slips Away  —  More proof that Trump knows that the election is slipping away from him as he went off off on a rant about Bill Maher, Stephanie Ruhle, Bret Stephens, and The New York Times.  —  Trump posted on Truth Social:",
    "url": "https://www.politicususa.com/2024/09/21/trump-melts-down-and-attacks-bill-maher-and-stephanie-ruhle-as-election-slips-away.html"
  },
  {
    "text": "Wisconsin Town Voting Machine Access Challenge  —  United States of America v. Town of Thornapple  —  Lawsuit filed by U.S. Department of Justice (DOJ) against the Town of Thornapple, the Town of Lawrence, town officials and the state of Wisconsin challenging the towns' decisions to ban … ",
    "url": "https://www.democracydocket.com/cases/wisconsin-town-voting-machine-access-challenge/"
  },
  {
    "text": "Ballot error shuts down Montana online absentee voting system  —  When Max Himsl opened his electronic ballot on Friday, he was dismayed to see a candidate missing from the list of options.  —  Voting absentee electronically while living abroad, Himsl saw that under the options for president … ",
    "url": "https://dailyinterlake.com/news/2024/sep/20/ballot-error-shuts-down-montana-online-absentee-voting-system/"
  },
  {
    "text": "‘Steel yourself’: Jack Smith filing huge brief with ‘mountain of evidence’ in Trump case  —  Special Counsel Jack Smith is soon expected to file an “oversized brief” filled with “sensitive material” in the criminal case Donald Trump faces in D.C.  —  Smith on Saturday submitted a filing … ",
    "url": "https://www.rawstory.com/jack-smith-oversized-filing-sensitive-material-dc/"
  },
  {
    "text": "Republicans Reeling As Trump Raised Just $44.5 Million in August  —  In what is being described as a Friday news dump, the Trump campaign waited until the very last minute to file their FEC report about how much they raised in August, because the number isn't great.",
    "url": "https://www.politicususa.com/2024/09/21/republicans-reeling-as-trump-raised-just-44-5-million-in-august.html"
  },
  {
    "text": "Mass shooting in Birmingham's 5 Points South leaves 4 dead, dozens injured by gunfire  —  Gunfire erupted in Birmingham's Five Points South entertainment area Saturday night, leaving four people dead and at least 21 others injured.  —  Officer Truman Fitzgerald said the shooting happened … ",
    "url": "https://www.al.com/news/2024/09/shooting-in-birminghams-5-points-south-may-have-mass-casualties-police-say.html"
  },
  {
    "text": "Harris Makes Undercover Push to Win Over Corporate America  —  The vice president has campaigned on holding big business accountable but has privately sought advice from CEOs, investors  —  Texas billionaire Mark Cuban only occasionally spoke with President Biden or his aides.",
    "url": "https://www.wsj.com/politics/elections/kamala-harris-campaign-ceos-investors-68e1bda1"
  },
  {
    "text": "New MyPillow ad includes a ‘disturbing wink at Nazis’: historian  —  Far-right election denier Mike Lindell's MyPillow is now being advertised at a significant discount.  One historian is pointing out that the pillow's new price is a reference to a prominent neo-Nazi rallying cry.",
    "url": "https://www.alternet.org/mike-lindell-nazis/"
  },
  {
    "text": "Daniel J. Evans, 98, Washington State Governor Who Went to Senate, Dies  —  A moderate Republican, he championed education, civil rights and environmental causes as a three-term governor and on Capitol Hill.  He was eyed as a potential vice president.  —  Daniel J. Evans … ",
    "url": "https://www.nytimes.com/2024/09/21/obituaries/daniel-j-evans-dead.html"
  }
]