[
  {
    "text": "What Americans should remember about Jan. 6  —  Four years ago, our democracy was put to the test — and prevailed.  —  Joe Biden is president of the United States.  —  On this Jan. 6, order will be called.  Clerks, staff and members of Congress will gather to certify the results of a free … ",
    "url": "https://www.washingtonpost.com/opinions/2025/01/05/president-biden-jan-6-democracy/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM2MDUzMjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM3NDM1NTk5LCJpYXQiOjE3MzYwNTMyMDAsImp0aSI6ImFlMjc4YmZjLTRlOGUtNGZjOS1hZDQ5LWNlOWY5Zjg0ODE5YiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9vcGluaW9ucy8yMDI1LzAxLzA1L3ByZXNpZGVudC1iaWRlbi1qYW4tNi1kZW1vY3JhY3kvIn0.D7SX-A_K83IvLq493kb52ukRKWvbmxjl25eZLxCGvyo&itid=gfta"
  },
  {
    "text": "Kash Patel Believes the FBI Planned Jan. 6th  —  “WHAT WAS THE FBI DOING PLANNING January 6th for a year?”  —  Kash Patel, President-elect Donald Trump's nominee to serve as FBI director, asked that question during a November 25, 2022 episode of his Kash's Corner podcast for the Epoch Times.",
    "url": "https://www.thebulwark.com/p/kash-patel-fbi-director-nominee-january-6th-conspiracy-theories"
  },
  {
    "text": "DOJ: 200 Jan. 6 cases pending as Trump prepares to retake office  —  It's the first time prosecutors have estimated how many uncharged Jan. 6 cases remain.  —  Federal prosecutors are weighing charging as many as 200 more people for their involvement in the Jan. 6 attack on the Capitol … ",
    "url": "https://www.politico.com/news/2025/01/06/january-6-cases-donald-trump-00196501"
  },
  {
    "text": "Trudeau expected to announce resignation before national caucus meeting Wednesday  —  ////Justin Trudeau is expected to announce as early as Monday that he will resign as Liberal Party Leader, three sources said Sunday, as the Prime Minister faces a caucus revolt and dismal public opinion polls … ",
    "url": "https://www.theglobeandmail.com/politics/article-trudeau-expected-to-announce-resignation-before-national-caucus/"
  },
  {
    "text": "Canada PM Trudeau to announce resignation as early as Monday, Globe and Mail reports  —  Canadian Prime Minister Justin Trudeau is expected to announce as early as Monday that he will resign as Liberal Party Leader, The Globe and Mail reported on Sunday, citing three sources.",
    "url": "https://www.reuters.com/world/americas/canada-pm-trudeau-announce-resignation-early-monday-globe-mail-reports-2025-01-06/"
  },
  {
    "text": "Four years later  —  The unapologetic nature of Trump's political renaissance is an ongoing menace  —  The scariest thing about contemporary American politics is that on January 7, 2021, it was widely acknowledged among American conservatives that Donald Trump's behavior on January 6th was completely unacceptable.",
    "url": "https://www.slowboring.com/p/four-years-later"
  },
  {
    "text": "Jan. 6 and the path not taken  —  Four years ago we lived through a pivot point.  History could have gone one way, but went another.  —  For about a one-month period after the Jan. 6 everyone seemed truly appalled.  At that moment, America was poised to consign Trumpism to the dustbin of history.",
    "url": "https://donmoynihan.substack.com/p/jan-6-and-the-path-not-taken"
  },
  {
    "text": "Paper Cuts  —  The Washington Post is expected to lay off dozens of staffers this week, Status has learned.  —  Layoffs are expected to rock The Washington Post this week, according to people familiar with the matter. … One person familiar with the matter said that the cuts will be deep, impacting many dozens of employees.",
    "url": "https://www.status.news/p/washington-post-layoffs"
  },
  {
    "text": "Statement from President Joe Biden on Protecting America's Ocean and Coasts from Offshore Oil and Gas Drilling  —  I am taking action to protect the East and West coasts, the eastern Gulf of Mexico, and Alaska's Northern Bering Sea from oil and natural gas drilling and the harm it can cause.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2025/01/06/statement-from-president-joe-biden-on-protecting-americas-ocean-and-coasts-from-offshore-oil-and-gas-drilling/"
  },
  {
    "text": "Elon Musk asks if America should ‘liberate the people of Britain’ in tirade against UK government … Elon Musk has questioned whether the United States should “liberate the people of Britain from their tyrannical government” after hitting out at top U.K. lawmakers.",
    "url": "https://www.cnbc.com/2025/01/06/elon-musk-asks-if-us-should-liberate-britain.html"
  },
  {
    "text": "No, Trump wasn't “confused” about the New Orleans attack  —  On New Year's Day, a driver intentionally steered a truck into a crowd in New Orleans, killing 14 people.  Trump and other MAGA leaders, echoing a false Fox News report, quickly rushed to blame President Biden's supposedly lax security at the border.",
    "url": "https://www.publicnotice.co/p/trump-new-orleans-attack-fox-misinformation"
  },
  {
    "text": "Trump aides ready ‘universal’ tariff plans — with one key change  —  President-elect's aides look at universal import duties, but only on certain sectors, among first big moves of presidency.  —  President-elect Donald Trump's aides are exploring tariff plans that would be applied … ",
    "url": "https://www.washingtonpost.com/business/2025/01/06/trump-tariff-economy-trade/"
  },
  {
    "text": "Elon Musk's European political meddling is ‘worrying,’ says Norway's PM  —  European backlash grows against billionaire ally of U.S. President-elect Donald Trump.  —  Norwegian Prime Minister Jonas Gahr Støre said Monday he found it “worrying” that a billionaire social media owner … ",
    "url": "https://www.politico.eu/article/norwegian-pm-jonas-gahr-store-worried-elon-musk-political-meddling/"
  },
  {
    "text": "Axios interview: Susie Wiles vows to block West Wing troublemakers … Wiles, who was co-campaign manager, gets much of the credit.  Two weeks from today, she'll bring her formula to Washington. … - The veteran Florida political operative — a former lobbyist who worked for Trump's GOP primary rival … ",
    "url": "https://www.axios.com/2025/01/06/axios-interview-susie-wiles-trump"
  },
  {
    "text": "The queer people who are buying guns to prepare for Trump's America  —  On a brisk Saturday afternoon, A. crouched in a boxer's stance, knees bent, one hip forward, raised her new Ruger Security-380 pistol aloft with both hands, and pulled the trigger.  Spent gold casings clinked to the ground … ",
    "url": "https://www.inquirer.com/identity/guns-trump-lgbt-philadelphia-20250105.html"
  }
]