[
  {
    "text": "Why I Want an Open Convention  —  Over the past few years, many people have told me I should stop making Biden-is-old jokes because “it just helps Trump” — as if voters wouldn't have noticed his age otherwise.  I can't ignore the obvious; none of us can.  And I'm not going to mindlessly … ",
    "url": "https://www.nytimes.com/2024/07/01/opinion/bill-maher-open-convention.html"
  },
  {
    "text": "Whitmer Disavows ‘Draft Gretch’ Movement — and Delivers A Warning to Biden  —  Democrats' 2028 bench is eager to avoid appearing eager to push Biden aside.  —  When Michigan Gov. Gretchen Whitmer telephoned a senior official with President Biden's campaign on Friday night … ",
    "url": "https://www.politico.com/news/magazine/2024/07/01/whitmer-biden-democrats-2028-00165995"
  },
  {
    "text": "Now We Know Who's Really in Charge at the White House  —  For quite a while now, some of us have been trying to figure out who is actually running the country at the moment.  It obviously hasn't been Joe Biden, a fact that should have been made clear during Thursday night's debate … ",
    "url": "https://hotair.com/jazz-shaw/2024/07/01/now-we-know-whos-really-in-charge-at-the-white-house-n3791220"
  },
  {
    "text": "Biden's family privately criticizes top advisers and pushes for their ouster at Camp David meeting  —  They also urged the president to stay in the race.  —  Members of Joe Biden's family privately trashed his top campaign advisers at Camp David this weekend, blaming them for the president's flop … ",
    "url": "https://www.politico.com/news/2024/06/30/biden-camp-david-family-debate-00165970"
  },
  {
    "text": "Don't Let a Biden Succession Crisis Create a Succession Crisis  —  It took no time for the pundits calling for Joe Biden to drop out of the race to reveal their fundamental childishness by asking for someone — Gavin Newsom, Gretchen Whitmer, JB Pritzker, Josh Shapiro … ",
    "url": "https://www.emptywheel.net/2024/07/01/dont-let-a-biden-succession-crisis-create-a-succession-crisis/"
  },
  {
    "text": "Jill Biden's delusional if she believes she can save her husband, the country after debate debacle  —  In the aftermath of Joe Biden's debate debacle, there is one constant: Dr. Jill's delusional self-belief that she can save the day.  —  Under the thrall of her Rasputin-like adviser Anthony Bernal … ",
    "url": "https://nypost.com/2024/06/30/opinion/jill-bidens-delusional-if-she-believes-she-can-save-her-husband-the-country-after-debate-debacle/"
  },
  {
    "text": "Behind the Curtain: Biden's salvation plan … - Dismiss “bedwetting.” … - Squeeze polls for juice. … - Warn of chaos. … - Limit dissent. … - Keep elected leaders close. … - Get the donor class to chill. … - Prove vitality. … - Ignore/engage the media.",
    "url": "https://www.axios.com/2024/07/01/biden-2024-election-pr-campaign-step-aside"
  },
  {
    "text": "Biden's family urges him to ‘keep fighting’ as donors look for alternatives  —  A top campaign official held a tense call with donors Sunday, laying out what would happen to the campaign infrastructure should Biden step aside — stressing he had no plans to do so.",
    "url": "https://www.nbcnews.com/politics/joe-biden/bidens-family-keep-fighting-donors-alternatives-rcna159694"
  },
  {
    "text": "US Supreme Court rules Trump has immunity for official, not private acts  —  The U.S. Supreme Court found on Monday that Donald Trump cannot be prosecuted for official actions taken as president, but can for private acts, in a landmark ruling recognizing for the first time any form of presidential immunity from prosecution.",
    "url": "https://www.reuters.com/legal/us-supreme-court-due-rule-trumps-immunity-bid-blockbuster-case-2024-07-01/"
  },
  {
    "text": "SCOTUS completes the biggest power grab in modern US history  —  This free edition of Public Notice is made possible by paid subscribers.  If you aren't one already, please sign up to support our independent journalism.  —  ⚖️ Subscribe to Public Notice ⚖️",
    "url": "https://www.publicnotice.co/p/scotus-loper-bright-chevron-jarkesy-explained"
  },
  {
    "text": "Supreme power grab  —  For thirty years, federal law has required commercial fishing boats to include a trained observer to ensure the vessel does not engage in overfishing or other prohibited practices.  The law specifies that certain classes of boats pay the costs of their own monitors.",
    "url": "https://popular.info/p/supreme-power-grab"
  },
  {
    "text": "Conservatives Go to War — Against Each Other — Over School Vouchers  —  School choice advocates are intent on expanding the availability of vouchers to fund private education at the expense of public schools, but rural residents of these targeted states are putting up some of the strongest resistance.",
    "url": "https://www.propublica.org/article/rural-republicans-school-vouchers-education-choice"
  },
  {
    "text": "Trump Throws Middle-Of-The-Night Fit After Nancy Pelosi Called Him Out On Live TV  —  The former president attacked the former House speaker as a “sick puppy.”  —  LOADING  —  Donald Trump posted a wild late night rant aimed at Rep. Nancy Pelosi (D-Calif.) after the former House speaker slammed … ",
    "url": "https://www.huffpost.com/entry/nancy-pelosi-trump-late-night-fit_n_668225aae4b08dc39c833e5b"
  },
  {
    "text": "Five Takeaways From France's Snap Election  —  It was a big day for the far-right National Rally.  Just how big will not be clear until after a second round of voting.  —  A new week of frenetic campaigning started in France on Monday, a day after the far-right National Rally party dominated … ",
    "url": "https://www.nytimes.com/2024/07/01/world/europe/france-election-takeaways.html"
  }
]