[
  {
    "text": "Trump's Former Finance Chief in Negotiations to Plead Guilty to Perjury  —  Allen H. Weisselberg would admit to lying on the stand during the former president's civil fraud trial, according to people familiar with the talks.  —  Allen H. Weisselberg, a longtime lieutenant to Donald J. Trump … ",
    "url": "https://www.nytimes.com/2024/02/01/nyregion/weisselberg-perjury-trump-fraud.html"
  },
  {
    "text": "Behind the Curtain: Trump's conviction scenario  —  Former President Trump is breezing to the GOP nomination — but, in private, is bracing for the genuine possibility that he'll be the first convicted felon in U.S. history to represent a major party.",
    "url": "https://www.axios.com/2024/02/02/trump-conviction-trial-jan-6-court"
  },
  {
    "text": "Trump Is Inching Closer to the Worst Legal Defeat of his Life  —  It sure looks like Trump's business empire is about to get hammered.  —  Former President Donald Trump has suffered through plenty of painful courtroom defeats during his lengthy career as one of America's most litigious businessmen.",
    "url": "https://www.vice.com/en/article/g5yn8x/trump-is-inching-closer-to-the-worst-legal-defeat-of-his-life"
  },
  {
    "text": "What Biden *really* says about Trump behind closed doors  —  Welcome to POLITICO's West Wing Playbook, your guide to the people and power centers in the Biden administration.  With help from producer Raymond Rapada.  —  President JOE BIDEN has a reputation for salty language behind closed doors.",
    "url": "https://www.politico.com/newsletters/west-wing-playbook/2024/02/01/what-biden-really-says-about-trump-behind-closed-doors-00139178"
  },
  {
    "text": "Biden Refers to Trump as a ‘Sick Fuck’ Behind Closed Doors: Report  —  POTTY MOUTH  —  Joe Biden refers to Donald Trump as a “sick fuck” behind closed doors to his longtime friends and close aides, Politico reported Thursday, citing three people who claim to have personally heard the insult.",
    "url": "https://www.thedailybeast.com/joe-biden-refers-to-donald-trump-as-a-sick-fk-behind-closed-doors-report"
  },
  {
    "text": "Fox News Poll: Trump leads Biden in Georgia, receiving just over 50% support  —  Trump is ahead of Biden in Georgia among independents and voters under age 35, according to the Fox News poll  —  Former President Donald Trump leads President Joe Biden with just over 50% support in Georgia … ",
    "url": "https://www.foxnews.com/politics/fox-news-poll-trump-leads-biden-georgia-receiving-just-over-50-support"
  },
  {
    "text": "Special counsel questioned witnesses about 2 rooms FBI didn't search inside Trump's Mar-a-Lago residence: Sources  —  The FBI missed the rooms in their search for classified documents, said sources.  —  In this June 9, 2017, file photo, President Donald Trump is shown at the White House in Washington, D.C.",
    "url": "https://abcnews.go.com/US/special-counsel-questioned-witnesses-2-rooms-fbi-search/story?id=106826552"
  },
  {
    "text": "He Was Accused of Sexual Misconduct.  Then Trump Hired Him.  Then He Was Indicted in Mar-a-Lago Case.  —  Trump body man Walt Nauta is a critical figure in the Mar-a-Lago documents case.  Trump only hired him after Nauta was dismissed from the White House after sexual harassment claims.",
    "url": "https://www.thedailybeast.com/walt-nauta-was-accused-of-sexual-misconduct-then-trump-hired-him-then-he-was-indicted-in-mar-a-lago-case"
  },
  {
    "text": "House Democrats continue to do the legislative heavy lifting  —  When the House passed a $78 billion tax package, it was members of the Democratic minority who provided most of the votes.  This keeps happening.  —  As awful as the current Congress is, it would be an overstatement to argue … ",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/house-democrats-continue-legislative-heavy-lifting-rcna136749"
  },
  {
    "text": "Republicans' plotting to block a Democratic president goes public  —  A bill under consideration in the House would, among other things, expand the child tax credit to the benefit of parents earning $40,000 a year or less.  —  In the 2022 General Social Survey, over two-thirds of people … ",
    "url": "https://www.washingtonpost.com/politics/2024/02/01/grassley-republicans-biden-border-deal/"
  },
  {
    "text": "Christian Ziegler Told His Wife to ‘Hunt’ For Sex Partners  —  New police records also show Ziegler's Google searches for “OnlyFans” and the average settlement amount for sexual battery.  —  Former Florida GOP chair Christian Ziegler and his wife, Bridget—known for promoting “family values” … ",
    "url": "https://www.thedailybeast.com/christian-ziegler-told-his-wife-to-hunt-for-sex-partners"
  },
  {
    "text": "Ken Paxton's lawlessness previews Trump's second term  —  And it's terrifying. … Last May, the Texas House voted 121-23 to impeach Attorney General Ken Paxton.  The following September, after a sustained pressure campaign by his political allies and donors, he was acquitted by the Senate of all the charges.",
    "url": "https://www.publicnotice.co/p/ken-paxton-trump-texas-supreme-court-explained"
  },
  {
    "text": "Ex-CIA hacker who leaked secrets to WikiLeaks gets 40 years in prison  —  A former CIA software engineer who was convicted of carrying out the largest data breach in the agency's history was sentenced to 40 years in prison on Thursday, the Department of Justice announced.",
    "url": "https://www.axios.com/2024/02/02/cia-hacker-wikileaks-joshua-schulte-sentenced"
  },
  {
    "text": "Inflation has fallen.  Why are groceries still so expensive?  —  Ongoing supply chain disruptions, droughts, avian flu, labor shortage and more continue to keep grocery prices high  —  Americans are finally getting a break from inflation, with prices for gasoline, used cars and health insurance … ",
    "url": "https://www.washingtonpost.com/business/2024/02/02/grocery-price-inflation-biden/"
  },
  {
    "text": "Wisconsin redistricting experts tell Supreme Court Republican map proposals are gerrymanders  —  Consultants hired by the Wisconsin Supreme Court to examine maps redrawing state legislative districts said Thursday that plans submitted by the Republican Legislature and a conservative law firm … ",
    "url": "https://apnews.com/article/wisconsin-redistricting-legislature-5bc5c0347b26a40fd615f4faf7583b46"
  },
  {
    "text": "Sorry Appin, We're Not Taking Down Our Article About Your Attempts To Silence Reporters  —  Back in December, we wrote about Appin.  We were not writing about the reports (of which there have been many) that the organization that started as a sort of cybersecurity training school … ",
    "url": "https://www.techdirt.com/2024/02/01/sorry-appin-were-not-taking-down-our-article-about-your-attempts-to-silence-reporters/"
  },
  {
    "text": "First on CNN: House Ethics Committee reached out to Rep. Matt Gaetz's ex-girlfriend amid ongoing investigation  —  The House Ethics Committee investigating Rep. Matt Gaetz has reached out to an ex-girlfriend who was a key witness in the federal investigation into the Florida lawmaker … ",
    "url": "https://www.cnn.com/2024/02/01/politics/matt-gaetz-ethics-committee"
  },
  {
    "text": "123 passengers sickened aboard cruise ship: CDC  —  More than 100 passengers and crew aboard a Queen Victoria cruise ship have fallen sick with a gastrointestinal illness, the Centers for Disease Control and Prevention (CDC) reported.  —  The Cunard Cruise Line ship departed on Jan. 22 … ",
    "url": "https://thehill.com/policy/healthcare/4443658-123-passengers-sickened-aboard-cruise-ship-cdc/"
  },
  {
    "text": "Iowa lawmakers decline to advance bill that would remove gender identity from the state's civil rights law  —  Iowa lawmakers declined to advance a bill Thursday that would remove gender identity from the state's civil rights law.  —  All three members of a subcommittee voted to not advance the bill Wednesday.",
    "url": "https://thehill.com/homenews/lgbtq/4443564-iowa-lawmakers-decline-advance-bill-removing-gender-identity-state-civil-rights-law/"
  },
  {
    "text": "Among Black adults, those with higher incomes are most likely to say they are happy  —  More than eight-in-ten Black adults say they are at least somewhat happy these days, according to a spring 2023 Pew Research Center survey of Black Americans.  However, Black adults with upper family incomes … ",
    "url": "https://www.pewresearch.org/short-reads/2024/02/01/among-black-adults-those-with-higher-incomes-are-most-likely-to-say-they-are-happy/"
  },
  {
    "text": "Speaker Mike Johnson's Favorite Way to Dodge Questions: Answering the Phone  —  Speaker Mike Johnson, who once routinely stopped for hallway interviews, has taken to pressing his iPhone to his ear as he walks through the Capitol, avoiding questions as he navigates a tough new job.",
    "url": "https://www.nytimes.com/2024/02/02/us/politics/mike-johnson-speaker-phone.html"
  },
  {
    "text": "Rep. Victoria Spartz waffling on retirement decision  —  The Indiana Republican says she will “probably” make a decision this weekend.  —  Rep. Victoria Spartz is waffling on her decision to retire, after the Indiana Republican announced last year that she planned to leave Congress.",
    "url": "https://www.politico.com/news/2024/02/01/victoria-spartz-retirement-decision-00139235"
  }
]