[
  {
    "text": "Minnesota Gov. Tim Walz: former House speaker and husband killed in politically motivated shooting  —  Minnesota Gov. Tim Walz says former state House Speaker Melissa Hortman and her husband were killed in a politically motivated assassination.  A second lawmaker and his wife were shot and wounded.",
    "url": "https://apnews.com/article/minnesota-lawmakers-shot-d7983e1e4f1a7573a487cab1a98cd172"
  },
  {
    "text": "Suspect in Minnesota Shooting Linked to Security Company, Evangelical Ministry  —  The alleged shooter is a 57-year-old white male; according to his ministry's website, he “sought out militant Islamists in order to share the gospel and tell them that violence wasn't the answer.”",
    "url": "https://www.wired.com/story/shooting-minnesota-melissa-hortman-vance-boelter/"
  },
  {
    "text": "Sources say two Minnesota lawmakers have been shot  —  Sources have told 5 EYEWITNESS NEWS' Tom Hauser that two Minnesota Lawmakers have been shot.  —  Minnesota state senator John Hoffman in Champlin and Minnesota state representative Melissa Hortman in Brooklyn Park were reportedly shot … ",
    "url": "https://kstp.com/kstp-news/top-news/sources-say-two-minnesota-lawmakers-have-been-shot/"
  },
  {
    "text": "Rep. Melissa Hortman, her husband killed; Sen. John Hoffman, his wife shot in ‘targeted’ shootings  — Two Minnesota lawmakers and their spouses were shot by someone impersonating a police officer early Saturday morning.  — Rep. Melissa Hortman and her husband Mark were killed.",
    "url": "https://www.fox9.com/news/melissa-hortman-john-hoffman-lawmakers-shot-minnesota"
  },
  {
    "text": "Brooklyn Park police searching for suspect in ‘multiple targeted shootings’  —  Gov. Tim Walz said there were targeted shootings in both Brooklyn Park and Champlin on Saturday. … Emergency vehicles were on the scene of a reported shooting in Brooklyn Park on Saturday morning.",
    "url": "https://www.startribune.com/brooklyn-park-police-searching-for-suspect-in-multiple-targeted-shootings/601372993"
  },
  {
    "text": "Here's how the attacks in Minnesota unfolded early on Saturday.  —  State Representative Melissa Hortman and her husband, Mark, died in the attack at their home.  The assailant also shot and injured another Democratic lawmaker and his wife, officials said.  —  “We're here today … ",
    "url": "https://www.nytimes.com/live/2025/06/14/us/minnesota-shootings"
  },
  {
    "text": "2 Minnesota lawmakers shot in apparent ‘targeted’ incidents, in grave condition; manhunt underway  —  The shootings took place in Champlin and Brooklyn Park, Minnesota.  —  Minnesota State Representative Melissa Hortman and Minnesota State Senator John Hoffman are shown in these undated file photos.",
    "url": "https://abcnews.go.com/US/2-minnesota-lawmakers-shot-targeted-incident-officials/story?id=122840751"
  },
  {
    "text": "Minnesota rep killed made headlines days earlier over vote on benefits for illegal aliens  —  Hortman was the lone House Democrat to vote for the repeal as authorities investigate politically motivated attack  —  Minnesota Democratic Rep. Melissa Hortman, who was fatally shot on Saturday … ",
    "url": "https://www.foxnews.com/politics/minnesota-rep-killed-made-headlines-days-earlier-over-vote-benefits-illegal-aliens"
  },
  {
    "text": "Former appointee of Tim Walz sought in deadly shootings of Minnesota lawmaker and her husband, had ‘No Kings’ flyers in car: sources  —  A former appointee of Minnesota Gov. Tim Walz is being sought in connection with the assassination of a state lawmaker and the shooting of another, police sources said.",
    "url": "https://nypost.com/2025/06/14/us-news/suspect-in-deadly-minnesota-shootings-identified-as-vance-luther-boelter/"
  },
  {
    "text": "Minnesota Rep. Hortman and husband killed, Sen. Hoffman and wife wounded in politically motivated shooting, Gov. Walz says  —  Minnesota Gov. Tim Walz announced Saturday morning that state Rep. Melissa Hortman and her husband are dead, and state Sen. John Hoffman and his wife are wounded following … ",
    "url": "https://www.cbsnews.com/minnesota/news/minnesota-lawmakers-targeted-shootings-champlin-brooklyn-park-john-hoffman-melissa-hortman/"
  },
  {
    "text": "Live Updates: Protests Against Trump Policies Kick Off Across the Country  —  Demonstrations have started in Nashville, Houston, Atlanta and Newark, N.J. Los Angeles said it was preparing for a turnout that “may be unprecedented” after days of sustained protests against the Trump administration's crackdown on immigration.",
    "url": "https://www.nytimes.com/live/2025/06/14/us/protests-news?unlocked_article_code=1.O08.61ao.4kN20xHE8N0S&smid=url-share"
  },
  {
    "text": "Tanks, troops and flyovers in D.C. as Trump gets his military parade  —  For its 250th birthday, the Army put on the largest show of military might in the capital in more than three decades.  —  Summary0  —  Planes roared over the heart of Washington on Saturday evening … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2025/06/14/army-parade-dc-trump-birthday-national-mall/"
  },
  {
    "text": "A few hundred gathered to protest Trump in D.C., in the shadow of the parade.  —  President Trump is taking part in events marking the Army's 250th anniversary.  Protests in Washington were peaceful on Saturday, but a forecast of thunderstorms forced an early start to the parade.  —  Here's the latest.",
    "url": "https://www.nytimes.com/live/2025/06/14/us/trump-parade"
  },
  {
    "text": "Protesters crowd into streets, parks, and plazas at anti-Trump ‘No Kings’ demonstrations across US.  Follow live updates.  —  Follow live updates. … In towns and cities across New England on Saturday, thousands participated in “No Kings” marches and rallies — some with about hundred people … ",
    "url": "https://www.bostonglobe.com/2025/06/14/nation/trump-military-parade-protests-live-updates/"
  },
  {
    "text": "Live Updates: Israel and Iran Launch Another Round of Missiles at Each Other  —  The two countries have been striking each other since Friday, fueling fears of a wider conflict that could draw in the United States and other major powers.  —  South Pars, Iran  —  Ramat Gan, Israel  —  Tehran",
    "url": "https://www.nytimes.com/live/2025/06/14/world/israel-iran-news"
  },
  {
    "text": "Man drives into crowd of protesters at ‘No Kings’ rally in Virginia  — Police say 21-year-old Joseph R. Checklick Jr. intentionally drove an SUV into a crowd of protesters in Culpeper, hitting at least one person.  — Checklick Jr. was arrested and charged with reckless driving … ",
    "url": "https://www.fox5dc.com/news/man-drives-crowd-protesters-no-kings-rally-virginia"
  },
  {
    "text": "Ancient miasma theory may help explain Health Secretary Robert F. Kennedy Jr.'s vaccine moves  —  Health Secretary Robert F. Kennedy Jr. has upended medical research and public health in the U.S. in many ways.  One of the ideas that could be influencing his overhaul of federal health agencies dates back to ancient Greece.",
    "url": "https://www.npr.org/sections/shots-health-news/2025/06/14/nx-s1-5429732/ancient-miasma-theory-may-help-explain-health-secretary-robert-f-kennedy-jr-s-vaccine-moves"
  },
  {
    "text": "The Judiciary Will Become Virtually Powerless in Protecting Your Rights if the Current Budget Bill Becomes Law  —  Senate Republicans have proposed an even worse version of a House provision that will require citizens suing the government to post enormous sums in bonds",
    "url": "https://www.theunpopulist.net/p/the-judiciary-will-become-virtually"
  },
  {
    "text": "Trump administration considers adding 36 countries to travel ban list  —  An internal memo reviewed by The Post sets a 60-day deadline for the targeted nations to conform with certain requirements, or face a full or partial entry ban.  —  The United States is considering restricting entry … ",
    "url": "https://www.washingtonpost.com/national-security/2025/06/14/trump-travel-ban-expansion/"
  },
  {
    "text": "Putin and Trump discussed Middle East tensions, Ukraine war in phone call  —  Russian President Vladimir Putin and U.S. President Donald Trump held a lengthy call Saturday to discuss the escalating situation in the Middle East and Russia's war in Ukraine.  —  Trump in a posting … ",
    "url": "https://apnews.com/article/russia-us-putin-trump-498642958089922ffc038330041e9987"
  }
]