[
  {
    "text": "Why Pence's Refusal to Endorse Trump Matters (Seriously!)  —  A Vice President not endorsing his former boss should be a bigger deal  —  On Friday afternoon, Mike Pence announced during an interview with Fox News' Martha MacCallum that he would not endorse Donald Trump for President.",
    "url": "https://www.messageboxnews.com/p/why-pences-refusal-to-endorse-trump"
  },
  {
    "text": "Trump Says Some Migrants Are ‘Not People’ and Predicts a ‘Blood Bath’ if He Loses  —  In a caustic and discursive speech in Ohio, former President Donald J. Trump once again doubled down on a doomsday vision of the United States.  —  Former President Donald J. Trump, at an event … ",
    "url": "https://www.nytimes.com/2024/03/16/us/politics/trump-speech-ohio.html"
  },
  {
    "text": "Trump ramps up dark rhetoric in Ohio stump speech for Senate candidate Bernie Moreno  —  Former President Donald Trump claimed that he — not President Joe Biden — will protect Social Security and warned of a “bloodbath” if he loses in November as he campaigned for Senate candidate Bernie Moreno in Ohio.",
    "url": "https://apnews.com/article/trump-ohio-moreno-senate-social-security-3b450dcfc24a02c8cac3a3feb657ddc8"
  },
  {
    "text": "Two GOP senators won't commit to explicit Trump endorsement  —  Sens. Bill Cassidy (R-La.) and Mike Rounds (R-S.D.), in Sunday interviews, would not say whether they would endorse former President Trump's bid for the White House.  —  Rounds, in an interview on CNN's “State of the Union,” … ",
    "url": "https://thehill.com/homenews/senate/4537495-two-gop-senators-wont-commit-to-explicit-trump-endorsement/"
  },
  {
    "text": "Rep. Turner disagrees with Trump's anti-migrant rhetoric but argues he can ‘fix’ border ‘crisis’  —  The top House Republican also said Jan. 6 convicts aren't “hostages.”  —  Chairman Michael Turner speaks at a hearing with the House Select Intelligence Committee in the Cannon Office Building, on March 12, 2024, in Washington, D.C.",
    "url": "https://abcnews.go.com/Politics/rep-turner-disagrees-trumps-anti-migrant-rhetoric-argues/story?id=108185893"
  },
  {
    "text": "Trump Escalates His Dehumanization of Migrants: Some Are ‘Not People ... These Are Animals’  —  The former president continued his campaign to denigrate people coming to the U.S. in search of a better life  —  Former president Donald Trump, who opened his 2016 campaign declaring undocumented immigrants … ",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-migrants-not-people-animals-1234989117/"
  },
  {
    "text": "Behind the scenes, Biden has grown angry and anxious about re-election effort  —  Biden locked up the Democratic nomination last week, but looking ahead to the general, anxiety has seemed to increase.  —  WASHINGTON — President Joe Biden was seething.  —  In a private meeting at the White House … ",
    "url": "https://www.nbcnews.com/politics/2024-election/biden-anger-rcna143729"
  },
  {
    "text": "The Strongman Fantasy  —  And Dictatorship in Real Life  —  Quite a few Americans like the idea of strongman rule.  Why not a dictator who will get things done?  —  I lived in eastern Europe when memories of communism were fresh.  I have visited regions in Ukraine where Russia imposed its occupation regime.",
    "url": "https://snyder.substack.com/p/the-strongman-fantasy"
  },
  {
    "text": "Promo video for Texas dental practice poses new ethics issue for Noem  —  Sitting in front of a camera for a highly produced, well-lit vertical video with the kind of caption made to watch on mute while you're scrolling through social media, a patient for SmileTexas near Houston tells viewers … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/16/kristi-noem-dental-practice-video/"
  },
  {
    "text": "How Trump's Allies Are Winning the War Over Disinformation  —  Their claims of censorship have successfully stymied the effort to filter election lies online.  —  In the wake of the riot on Capitol Hill on Jan. 6, 2021, a groundswell built in Washington to rein in the onslaught of lies … ",
    "url": "https://www.nytimes.com/2024/03/17/us/politics/trump-disinformation-2024-social-media.html"
  },
  {
    "text": "Ro Khanna says TikTok bill is not ‘actually addressing the issue’  —  Rep. Ro Khanna (D-Calif.) said the TikTok bill passed by the House last week is not “actually addressing the issue.”  —  Khanna, who voted against the bill, argued on ABC's “This Week” that while the two national security issues cited … ",
    "url": "https://thehill.com/homenews/house/4537706-ro-khanna-says-tiktok-bill-is-not-actually-addressing-the-issue/"
  },
  {
    "text": "Sen. Cassidy says he is not running on No Labels ticket  —  Sen. Bill Cassidy (R-La.) said in a Sunday interview that he is not running on a third-party presidential ticket with the political organization No Labels.  —  In an interview on NBC News's “Meet the Press,” Cassidy … ",
    "url": "https://thehill.com/elections/4537734-sen-cassidy-says-he-is-not-running-on-no-labels-ticket/"
  },
  {
    "text": "‘Anti-Trump’ Republicans in North Carolina feel alienated by Mark Robinson  —  RALEIGH, N.C. - Ex-Republican Phebe Roberson, 75, said she “can't stand” former President Donald Trump and voted against him in North Carolina's GOP primary earlier this month.  —  She also cast a ballot … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/03/17/north-carolina-governor-mark-robinson-trump/72945069007/"
  },
  {
    "text": "The GOP's Claim That We Were Better Off in 2020 Is So Weird  —  The answer will obviously vary, but it's a good bet the year 2020 will rank pretty high in any list of wretched years.  After all, it's when COVID-19 arrived.  The pandemic eventually took over a million lives just in America.",
    "url": "https://nymag.com/intelligencer/article/republican-better-off-2020-weird.html"
  }
]