[
  {
    "text": "Exclusive: Attorney General Merrick Garland says there should be ‘speedy trial’ of Trump as 2024 election looms  —  Attorney General Merrick Garland said in an interview with CNN that he believes there should be a “speedy trial” in the election subversion case against Donald Trump … ",
    "url": "https://www.cnn.com/2024/01/19/politics/merrick-garland-trump-speedy-trial/"
  },
  {
    "text": "What if Trump is acquitted in the courts?  —  Unquestionably, Democrats are pursuing all available nonelectoral means to beat former President Donald Trump.  Two of the most prominent and drawn-out involve the courts: indictments and trials across a host of matters and barring him from the ballot in Colorado and Maine.",
    "url": "https://www.washingtonexaminer.com/opinion/2804442/what-if-trump-is-acquitted-in-the-courts/"
  },
  {
    "text": "The DeSantis Team Ran the Worst Campaign in History  —  The bizarre decisions behind a $130 million debacle.  —  Tim Pawlenty's and Scott Walker's presidential campaigns can breathe a sigh of relief.  The mantle of Worst Republican Presidential Campaign Ever has been lifted from their shoulders … ",
    "url": "https://www.politico.com/news/magazine/2024/01/19/the-desantis-team-ran-the-worst-campaign-in-history-00136527"
  },
  {
    "text": "Trump plays defense after Haley attacks his age  —  The former president, 77, touted his cognitive skills during a campaign stop in New Hampshire, saying he feels ‘about 35 years old’  —  Onstage at a New Hampshire campaign event on Wednesday night, former president Donald Trump bragged about many things … ",
    "url": "https://www.washingtonpost.com/politics/2024/01/18/trump-age-haley-new-hampshire/"
  },
  {
    "text": "Media outlets making their own coverage decisions isn't “authoritarian”  —  Trump's call to take them off the air is  —  Sen. Marco Rubio (R-FL) is worried about creeping authoritarianism in the United States.  Not from Donald Trump, whose presidential bid Rubio endorsed Sunday despite … ",
    "url": "https://www.mediamatters.org/donald-trump/media-outlets-making-their-own-coverage-decisions-isnt-authoritarian"
  },
  {
    "text": "Comer Statement on Transcribed Interview with Kevin Morris  —  WASHINGTON—House Committee on Oversight and Accountability Chairman James Comer (R-Ky.) issued the following statement on today's transcribed interview with Kevin Morris, a Hollywood lawyer and Democrat donor:",
    "url": "https://oversight.house.gov/release/comer-statement-on-transcribed-interview-with-kevin-morris%EF%BF%BC/"
  },
  {
    "text": "How a Judge in India Prevented Americans From Seeing a Blockbuster Report  —  Free speech on the internet took a huge hit when the news agency Reuters took down an important hacking investigation to comply with an overseas legal challenge.  —  Two months ago, the news agency Reuters published … ",
    "url": "https://www.politico.com/news/magazine/2024/01/19/india-judge-reuters-story-00136339"
  },
  {
    "text": "Statement from President Joe Biden on Nearly $5 Billion in Additional Student Debt Cancellation for 74,000 Borrowers  —  Today, my Administration approved debt cancellation for another 74,000 student loan borrowers across the country, bringing the total number of people who have gotten … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/01/19/statement-by-president-joe-biden-on-nearly-5-billion-in-additional-student-debt-cancellation-for-74000-borrowers/"
  },
  {
    "text": "I once hated America, and I was so wrong  —  “I take this obligation freely, without any mental reservation or purpose of evasion; so help me God.”  —  Just a few days ago, I said these words in front of the friends who had accompanied me to take my Oath of Allegiance to become an American citizen.",
    "url": "https://thehill.com/opinion/immigration/4416136-i-once-hated-america-and-i-was-so-wrong/"
  },
  {
    "text": "Outrage as Oklahoma Republican's bill labels Hispanic people ‘terrorists’  —  Lawmaker JJ Humphrey seeks punishments for ‘acts of terrorism’ and defines terrorist as ‘any person who is of Hispanic descent’  —  An Oklahoma lawmaker is facing backlash for proposing a discriminatory bill … ",
    "url": "https://www.theguardian.com/us-news/2024/jan/18/oklahoma-bill-labels-hispanic-people-terrorists"
  },
  {
    "text": "Google News Is Boosting Garbage AI-Generated Articles  —  Google News is boosting sites that rip-off other outlets by using AI to rapidly churn out content, 404 Media has found.  Google told 404 Media that although it tries to address spam on Google News, the company ultimately does not focus … ",
    "url": "https://www.404media.co/google-news-is-boosting-garbage-ai-generated-articles/"
  },
  {
    "text": "Elon Musk's scheme to gut worker protections nationally  —  For a guy who claims to want to save humanity, he's got some strange ideas. … “This is a battle for the future of civilization,” Elon Musk tweeted in 2022.  “If free speech is lost even in America, tyranny is all that lies ahead.”",
    "url": "https://www.publicnotice.co/p/elon-musk-space-x-national-labor-relations-board"
  },
  {
    "text": "What do angry farmers in Nevada and Germany have in common?  They're being exploited by the far right  —  Populists are taking advantage of agrarian protests sparked by genuine crises - and it all feels horribly familiar  —  When environmental activists calling for less pollution sit in the streets … ",
    "url": "https://www.theguardian.com/commentisfree/2024/jan/19/angry-farmers-nevada-germany-far-right-protest"
  },
  {
    "text": "California 2024 Poll: Schiff and Garvey Gain Support in Crowded Primary  —  An Emerson College Polling/Inside California Politics survey of the California Senate Election finds a quarter of voters (25%) support Democratic Representative Adam Schiff, while 18% support former Los Angeles Dodger … ",
    "url": "https://emersoncollegepolling.com/california-2024-poll-schiff-and-garvey-gain-support-in-crowded-primary/"
  },
  {
    "text": "Senate Democrats launch website targeting GOP on abortion ahead of Roe v Wade anniversary  —  The Senate Democrats' campaign arm launched a website on Friday targeting Republicans in battleground states on their past comments on abortion ahead of the anniversary of the Roe v. Wade decision.",
    "url": "https://thehill.com/homenews/senate/4416758-senate-democrats-launch-website-targeting-gop-on-abortion-ahead-of-roe-v-wade-anniversary/"
  },
  {
    "text": "Pro-Biden group raised $208M as Dems brace for tough election year  —  The top outside group supporting Joe Biden's reelection raised $208 million in 2023.  —  The top outside group supporting President Joe Biden raised $208 million in 2023, an enormous sum as Democrats gear up for a difficult reelection year.",
    "url": "https://www.politico.com/news/2024/01/19/pro-biden-group-raised-208-m-as-dems-brace-for-tough-election-year-00136510"
  },
  {
    "text": "Trump leads Biden with independent voters by 11 points: Poll  —  Former President Trump is leading President Biden with independent voters, outpacing the incumbent by 11 points, according to a new poll.  —  In the new Messenger/Harris poll, the former president garnered 46 percent … ",
    "url": "https://thehill.com/homenews/campaign/4416654-trump-leads-biden-with-independent-voters-by-11-points-poll/"
  }
]