[
  {
    "text": "How Trump Set Deadly Election Trap for Himself  —  CHECKMATE  —  Jill Filipovic, CNN columnist and author of OK Boomer Let's Talk, on how Kamala wins. … It's barely been 48 hours since Joe Biden dropped out of the race for the White House, but one thing is clear: Kamala Harris can win.",
    "url": "https://www.thedailybeast.com/how-trump-set-deadly-election-trap-for-himself-against-kamala-harris"
  },
  {
    "text": "Trump Camp Is Planning to ‘Willie Horton’ Kamala Harris  —  Can the campaign—and the candidate—stay focused on her record rather than her race?  —  DONALD TRUMP'S CAMPAIGN IS PREPARING a full-scale blitz on Vice President Kamala Harris, with broadsides on her record that borrow from the ad that came to define dog-whistle politics.",
    "url": "https://www.thebulwark.com/p/trump-planning-to-willie-horton-kamala"
  },
  {
    "text": "How Harris can change the narrative to beat Trump  —  Rarely is an American political party presented with the opportunity for a course correction of this magnitude so late in the election cycle.  Democrats showed how American political parties can be resilient and speedy when they need to be … ",
    "url": "https://thehill.com/opinion/4787461-kamala-harris-campaign-reset/"
  },
  {
    "text": "Yang says he'll support Harris for president in November  —  Former presidential candidate Andrew Yang declared that he will back Vice President Harris and her eventual running mate in the November general election after criticizing the Democrats' previous choice of President Biden as the party's nominee.",
    "url": "https://thehill.com/homenews/campaign/4788230-yang-support-harris-president/"
  },
  {
    "text": "Trump's New Rival May Bring Out His Harshest Instincts  —  After years planning to face President Biden, Donald J. Trump and his team will be campaigning against Kamala Harris.  He has attacked female rivals and critics in brutal and personal terms.  —  Donald J. Trump and his political team spent nearly … ",
    "url": "https://www.nytimes.com/2024/07/23/us/politics/trump-harris-attack-lines.html"
  },
  {
    "text": "Secret Service director resigns after Trump shooting fallout  —  Director Kimberly Cheatle revealed her decision in an internal message to Secret Service employees.  —  Secret Service Director Kimberly Cheatle resigned Tuesday over the agency's failure to prevent the assassination attempt … ",
    "url": "https://www.politico.com/news/2024/07/23/secret-service-director-resigns-after-trump-shooting-fallout-00170580"
  },
  {
    "text": "Secret Service Director Kimberly Cheatle resigns over Trump shooting outrage … U.S. Secret Service Director Kimberly Cheatle resigned Tuesday following widespread outrage over how her agency failed to prevent the attempted assassination of former President Donald Trump at a Pennsylvania campaign rally earlier this month.",
    "url": "https://www.cnbc.com/2024/07/23/secret-service-resigns-trump-shooting.html"
  },
  {
    "text": "Schumer and Jeffries set to endorse Harris for president  —  Senate Majority Leader Chuck Schumer and House Minority Leader Hakeem Jeffries are poised to endorse Kamala Harris for president at a press conference Tuesday afternoon, three people familiar with the plans told POLITICO.",
    "url": "https://www.politico.com/live-updates/2024/07/23/congress/schumer-jeffries-set-to-endorse-harris-00170605"
  },
  {
    "text": "Biden to address nation Wednesday night  —  The speech will come four days after his stunning announcement that he was stepping aside as the Democratic Party's presumptive nominee.  —  President Joe Biden will address the nation from the Oval Office on Wednesday evening about his historic decision … ",
    "url": "https://www.politico.com/news/2024/07/23/biden-national-address-2024-election-00170590"
  },
  {
    "text": "Feds discover transcripts of Biden chats with biographer  —  Justice Department relents by contacting former special counsel Robert Hur to respond to records requests.  —  The Justice Department told a federal judge late Monday that it has located transcripts it previously denied having … ",
    "url": "https://www.politico.com/news/2024/07/23/biden-hur-biographer-transcripts-00170548"
  },
  {
    "text": "Top Sinclair anchor resigned over concerns about biased and inaccurate content  —  Eugene Ramirez, the lead anchor of Sinclair's national evening news broadcast, resigned in January over concerns about the accuracy and right-wing bias of the content he was required to present on air, three sources told Popular Information.",
    "url": "https://popular.info/p/top-sinclair-anchor-resigned-over"
  },
  {
    "text": "JD Vance repeatedly indicated in 2016 that he believed Donald Trump had committed sexual assault  —  Ohio Sen. JD Vance, the Republican vice presidential nominee, repeatedly indicated in 2016 that he believed Donald Trump had committed sexual assault, even suggesting in one TV segment that in a … ",
    "url": "https://www.cnn.com/2024/07/23/politics/kfile-jd-vance-believed-donald-trump-sexual-assault-allegations-2016/"
  },
  {
    "text": "Exclusive: Beyoncé gives Kamala Harris permission to use her song ‘Freedom’ for her presidential campaign  —  Vice President Kamala Harris made a big entrance during her first official visit to her campaign headquarters on Monday evening, walking out to Beyoncé's song “Freedom.”",
    "url": "https://www.cnn.com/2024/07/22/entertainment/beyonce-freedom-harris-campaign/"
  },
  {
    "text": "Harris has the best 48 hours in presidential campaign history, raising $100 million since Sunday  —  “Kamala Harris has had the single best first day of any presidential candidate in history,” MSNBC's O'Donnell said  —  The first 48 hours of Kamala Harris as a U.S. presidential candidate … ",
    "url": "https://www.salon.com/2024/07/23/harris-has-the-best-48-hours-in-presidential-campaign-history-raising-100-million-since-sunday/"
  },
  {
    "text": "Trump's Sons Keep Falsely Blaming Democrats for the Assassination Attempt  —  Eric and Don Jr. are pushing a narrative that threat experts say will fuel violence.  —  Since a 20-year-old gunman opened fire more than a week ago at former President Donald Trump's campaign rally in Butler … ",
    "url": "https://www.motherjones.com/politics/2024/07/trump-assassination-attempt-eric-donald-jr-blame-violence/"
  },
  {
    "text": "Elon Musk Says His Trans Daughter Was ‘Killed by Woke Mind Virus’  —  MASK OFF  —  The billionaire made the extraordinary claim in an interview with Jordan Peterson, adding that he “vowed to destroy” the “virus” after losing his child to it.  —  Elon Musk says his transgender daughter is “dead.”",
    "url": "https://www.thedailybeast.com/elon-musk-says-his-transgender-daughter-was-killed-by-woke-mind-virus"
  },
  {
    "text": "Fraudulent Failson Judgement: JD Vance “Ain't From Here”  —  As always with DC's gossip press, they exercise almost none of the scrutiny with Donald Trump that they do with others.  —  One recent example comes in the treatment of Joe Biden and Trump's sons' involvement in campaign decision-making.",
    "url": "https://www.emptywheel.net/2024/07/23/fraudulent-failson-judgement-jd-vance-aint-from-here/"
  },
  {
    "text": "HIV ‘vaccine’ could be made for just $40 a year for every patient  —  Generic version of a drug already on the market, which can suppress and prevent HIV, would still yield 30% profit if the current price was slashed, researchers say  —  A new drug described as “the closest we have ever … ",
    "url": "https://www.theguardian.com/global-development/article/2024/jul/23/hiv-aids-prevention-vaccine-lenacapavir-sunlenca-pharmaceuticals-gilead-generic-licensing"
  }
]