[
  {
    "text": "Cabinet approves deal for release of 50 Gaza hostages in exchange for multi-day truce  —  Israel believes Hamas could potentially locate some 30 more mothers and children and says the 4-day halt could be extended by an extra day per each 10 Israeli hostages freed",
    "url": "https://www.timesofisrael.com/cabinet-approves-deal-for-return-of-50-hostages-in-exchange-for-multi-day-ceasefire/"
  },
  {
    "text": "Cassidy Hutchinson Gives Dark Reason Why ‘Everybody Should Vote For Joe Biden’  —  The former Trump White House aide would not confirm who she's putting on her ballot, but she did say who she won't be voting for.  —  LOADING  —  Former White House aide Cassidy Hutchinson urged Americans … ",
    "url": "https://www.huffpost.com/entry/cassidy-hutchinson-vote-joe-biden_n_655c989ee4b0c91d82787586"
  },
  {
    "text": "Ron DeSantis' team was going after Nikki Haley.  They turned on each other instead.  —  Haley's rise has posed an existential threat to DeSantis' candidacy, and his team has struggled in how to counter it.  —  Leaders of Ron DeSantis' Never Back Down super PAC met privately last Tuesday … ",
    "url": "https://www.nbcnews.com/politics/2024-election/ron-desantis-nikki-haley-fight-right-never-back-down-rcna126102"
  },
  {
    "text": "UK Museum Determines Roman Emperor Was Trans, Changes Pronouns to She/Her  —  Elagabalus only ruled for 4 years before being assassinated  —  A UK museum has reclassified a Roman emperor as a transgender woman after doing research.  —  The North Hertfordshire Museum will use her and she when referring to Elagabalus.",
    "url": "https://themessenger.com/news/roman-emperor-elagabalus-transgender-woman-uk-museum-she-her-pronouns"
  },
  {
    "text": "‘Scream VII’ Star Axed Over Pro-Palestine Posts  —  Melissa Barrera wrote on Instagram that “Western media only shows the [Israeli] side.  Why do they do that, I will let you deduce for yourself.”  —  Scream VII actress Melissa Barrera has been “quietly” dropped by Spyglass Studios … ",
    "url": "https://www.thedailybeast.com/scream-vii-star-axed-over-pro-palestine-posts"
  },
  {
    "text": "WOKE ALERT: BEST BUY, ACTIVISION, TARGET, NORDSTROM, & HOME DEPOT  —  FIVE WOKE COMPANIES TO WATCH THIS BLACK FRIDAY AND CYBER MONDAY  —  These five companies went Woke, and now they're vying for your business on Black Friday and Cyber Monday.  Keep these companies' woke antics in mind when you're shopping for deals.",
    "url": "https://consumersresearch.org/woke-alert/woke-alert-best-buy-activision-target-nordstrom-home-depot/"
  },
  {
    "text": "Colorado Supreme Court to take up appeals in Trump ballot case  —  A state judge ruled last week that Trump “engaged in insurrection” but that the U.S. Constitution's ban on insurrectionists' holding office didn't apply to presidents.  —  The Colorado Supreme Court agreed Tuesday … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/colorado-supreme-court-agrees-take-appeal-trump-ballot-case-rcna126293"
  },
  {
    "text": "Dean Phillips supporters launch ads attacking Biden's electability  —  The spots, focused on generational change and the president's current polling, will initially run in New Hampshire and the Washington area  —  A new super PAC supporting the presidential campaign of Minnesota … ",
    "url": "https://www.washingtonpost.com/politics/2023/11/21/dean-phillips-joe-biden-ads/"
  },
  {
    "text": "Poll: Gun ownership reaches record high with American electorate  —  A record share of voters in NBC News' latest poll say that they or someone in their household owns a gun.  —  More than half of American voters — 52% — say they or someone in their household owns a gun, per the latest NBC News national poll.",
    "url": "https://www.nbcnews.com/meet-the-press/meetthepressblog/poll-gun-ownership-reaches-record-high-american-electorate-rcna126037"
  },
  {
    "text": "OnPolitics: New appeals court ruling tees up Voting Rights Act review  —  Hey there OnPolitics readers!  Another voting rights case could be heading to the Supreme Court - this time over who can file suit under the Voting Rights Act.  —  The St. Louis-based U.S. Court of Appeals … ",
    "url": "https://www.usatoday.com/story/news/politics/2023/11/21/new-appeals-court-ruling-tees-voting-rights-act/71670193007/"
  },
  {
    "text": "Democrats nearly double Republicans in October fundraising  —  The Democratic National Committee (DNC) far outperformed its Republican National Committee (RNC) counterpart in fundraising in October.  —  The latest Federal Election Commission (FEC) campaign filings show the DNC … ",
    "url": "https://thehill.com/homenews/campaign/4321630-democrats-nearly-double-republicans-in-october-fundraising/"
  },
  {
    "text": "Cuomo weighs run for NYC mayor amid Adams' woes  —  Former Gov. Andrew Cuomo wouldn't try to compete in a primary against Eric Adams  —  NEW YORK — Former Gov. Andrew Cuomo is indicating to allies he may want to run for New York City mayor if fellow Democrat Eric Adams sinks under the weight of a federal investigation.",
    "url": "https://www.politico.com/news/2023/11/21/cuomo-mayor-adams-00128380"
  },
  {
    "text": "The D.C. Circuit Court Revealed the Huge Flaw in Trump's Gag Order Claim  —  Monday's oral argument in the U.S. Court of Appeals for the District of Columbia Circuit on the validity of Judge Tanya Chutkan's limited ban of defendant Donald Trump's pretrial free speech rights underscores … ",
    "url": "https://slate.com/news-and-politics/2023/11/dc-circuit-court-trump-gag-order-lose.html"
  },
  {
    "text": "Business leaders are ignoring Elon Musk's antisemitism  —  They're much quieter when antisemitism comes from the right than from the left  —  As a Jewish Harvard student, I've had a front row seat to elite backlash against pro-Palestinian activism on campus, including aggressive efforts … ",
    "url": "https://www.slowboring.com/p/business-leaders-are-ignoring-elon"
  },
  {
    "text": "Republican Celeste Maloy wins Utah special House election  —  Republican Celeste Maloy was projected to win a Thanksgiving-week special election for the open U.S. House seat in Utah left vacant by her former boss, Rep. Chris Stewart (R-Utah), according to Decision Desk HQ.",
    "url": "https://thehill.com/homenews/campaign/4321766-utah-special-house-election-celeste-maloy-kathleen-riebe-trump-abortion/"
  },
  {
    "text": "The twentysomething mayor-elect making history in Indiana  —  With help from Brakkton Booker, Ella Creamer, Rishika Dugyala and Teresa Wiltz  —  Hi, Recasters!  The U.S. is reportedly brokering a deal between Israel and Hamas to exchange some hostages, New York City's mayor blames … ",
    "url": "https://www.politico.com/newsletters/the-recast/2023/11/21/brandon-sakbun-terre-haute-election-00128307"
  },
  {
    "text": "North Philadelphia shooting leaves 2 men dead, 5 injured: police  —  PHILADELPHIA (CBS) — A shooting in North Philadelphia has left two men dead and five others injured on Tuesday night, police said.  —  The shooting happened in the area of 6th Street and Allegheny Avenue at around 8:30 p.m., according to police.",
    "url": "https://www.cbsnews.com/philadelphia/news/philadelphia-shooting-6th-street-allegheny-avenue-crime/"
  },
  {
    "text": "Mike Johnson's America: Revisit landmark SCOTUS decisions and use government to ‘restrain evil’  —  Mike Johnson, the new speaker of the House, voiced support for revisiting Supreme Court decisions that struck down restrictions on the use of contraception, barred bans on gay sex … ",
    "url": "https://www.cnn.com/2023/11/21/politics/mike-johnson-kfile-invs"
  },
  {
    "text": "Texas attorney general opens probe into Media Matters over report on X ads  —  Texas Attorney General Ken Paxton (R) said Monday that his office is opening an investigation into Media Matters for America over its recent reports accusing X, the platform formerly known as Twitter … ",
    "url": "https://thehill.com/policy/technology/4320745-texas-attorney-general-ken-paxton-opens-probe-media-matters-x-ads/"
  },
  {
    "text": "How a Maine Businessman Made the AR-15 Into America's Best-Selling Rifle  —  Neither a gun enthusiast nor a right-wing ideologue, Richard Dyke used political connections and lobster giveaways to build Bushmaster, the company that popularized assault-style rifles.  —  Under the Gun: How Gun Violence Is Impacting the Nation",
    "url": "https://www.propublica.org/article/how-bushmaster-made-ar-15-into-best-selling-rifle-us"
  },
  {
    "text": "US hits Iran-backed militants with fourth round of retaliatory airstrikes  —  Iran-backed groups have attacked US forces more than 60 times since mid-Oct.  —  United States fighter jets struck two sites in Iraq used by Iran-linked militants on Wednesday morning local time, according to U.S. Central Command and defense officials.",
    "url": "https://abcnews.go.com/Politics/us-hits-iran-backed-militants-fourth-round-retaliatory/story?id=105081095"
  }
]