[
  {
    "text": "Statement of ICC Prosecutor Karim A.A. Khan KC: Applications for arrest warrants in the situation in the State of Palestine  —  Today I am filing applications for warrants of arrest before Pre-Trial Chamber I of the International Criminal Court in the Situation in the State of Palestine.",
    "url": "https://www.icc-cpi.int/news/statement-icc-prosecutor-karim-aa-khan-kc-applications-arrest-warrants-situation-state"
  },
  {
    "text": "EXCLUSIVE: ICC seeks arrest warrants against Sinwar and Netanyahu for war crimes over October 7 attack and Gaza war  —  The International Criminal Court is seeking arrest warrants for Hamas leader Yahya Sinwar and Israeli Prime Minister Benjamin Netanyahu on charges of war crimes and crimes … ",
    "url": "https://www.cnn.com/2024/05/20/middleeast/icc-israel-hamas-arrest-warrant-war-crimes-intl/"
  },
  {
    "text": "Exclusive: Donald Trump foreign policy advisers met Israeli PM Netanyahu, source says  —  Three former U.S. foreign policy officials in Donald Trump's administration met with Prime Minister Benjamin Netanyahu and other public figures in Israel on Monday, according to a person with direct knowledge of the matter.",
    "url": "https://www.reuters.com/world/us/donald-trump-foreign-policy-advisers-met-israeli-pm-netanyahu-source-says-2024-05-20/"
  },
  {
    "text": "Middle East Crisis: Israeli Leaders Rally Behind Netanyahu Despite Divisions Over War … The I.C.C. prosecutor requests warrants for Hamas leaders and Netanyahu.  —  The International Criminal Court prosecutor, Karim Khan, said Monday that he had requested arrest warrants for the leaders … ",
    "url": "https://www.nytimes.com/live/2024/05/20/world/israel-gaza-war-hamas-rafah"
  },
  {
    "text": "Statement from President Joe Biden on the Warrant Applications by the International Criminal Court  —  The ICC prosecutor's application for arrest warrants against Israeli leaders is outrageous.  And let me be clear: whatever this prosecutor might imply, there is no equivalence — none — between Israel and Hamas.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/05/20/statement-from-president-joe-biden-on-the-warrant-applications-by-the-international-criminal-court/"
  },
  {
    "text": "Trump trial: Prosecution rests after Michael Cohen's fiery testimony … Prosecutors on Monday rested their criminal hush money case against Donald Trump after their star witness, the former president's onetime personal lawyer Michael Cohen, delivered dramatic testimony.",
    "url": "https://www.cnbc.com/2024/05/20/trump-trial-end-looms-in-hush-money-case.html"
  },
  {
    "text": "Trump claims he wants to testify at his trial.  No one else thinks he should.  —  “Anybody testifying for their own sake, it doesn't play out well,” said one Trump ally.  —  On the eve of his criminal trial, Donald Trump told reporters in Florida that he would take the stand and testify if necessary.",
    "url": "https://www.politico.com/news/2024/05/20/trump-testify-hush-money-trial-00158756"
  },
  {
    "text": "Alvin Bragg's Case in Shambles After Michael Cohen Admits to Stealing From Trump and More  —  It's not quite time for closing arguments in the New York-based criminal case against Donald Trump, but the crescendo is building.  —  On Monday, disgraced felon Michael Cohen retook the stand … ",
    "url": "https://redstate.com/bonchie/2024/05/20/michael-cohen-admits-on-the-witness-stand-to-stealing-money-from-trump-as-case-gets-more-absurd-n2174413"
  },
  {
    "text": "Iranian President Raisi feared dead as helicopter wreckage found  —  Hopes are fading that Iranian President Ebrahim Raisi and his foreign minister have survived a helicopter crash in mountainous terrain and icy weather, an Iranian official said on Monday after search teams located the wreckage.",
    "url": "https://www.reuters.com/world/middle-east/hopes-fade-wreckage-found-helicopter-carrying-iranian-president-raisi-2024-05-20/"
  },
  {
    "text": "Iran's president, foreign minister and others found dead at helicopter crash site, state media says  —  Iranian President Ebrahim Raisi, the country's foreign minister and others have been found dead at the site of a helicopter crash Monday after an hourslong search through a foggy … ",
    "url": "https://apnews.com/article/iran-president-ebrahim-raisi-426c6f4ae2dd1f0801c73875bb696f48"
  },
  {
    "text": "Supreme Court Justice Alito sold Bud Light stock, then bought Coors during boycott … Supreme Court Justice Samuel Alito sold shares of beer giant Anheuser-Busch InBev as conservatives were ditching the Bud Light brewer over its partnership with a transgender social media influencer.",
    "url": "https://www.cnbc.com/2024/05/20/supreme-court-alito-sold-bud-light-stock-bought-coors-boycott.html"
  },
  {
    "text": "Toxic Gaslighting: How 3M Executives Convinced a Scientist the Forever Chemicals She Found in Human Blood Were Safe  —  Decades ago, Kris Hansen showed 3M that its PFAS chemicals were in people's bodies.  Her bosses halted her work.  As the EPA now forces the removal of the chemicals from drinking water … ",
    "url": "https://www.propublica.org/article/3m-forever-chemicals-pfas-pfos-inside-story"
  },
  {
    "text": "Scared about America losing democracy?  Texas is already gone  —  “I might go to Dallas to murder looters,” a then-active duty U.S. Army sergeant named Daniel Perry texted a friend in the spring of 2020, as protest marches over the police murder of George Floyd swept across Texas and the nation.",
    "url": "https://www.inquirer.com/opinion/commentary/texas-abbott-pardon-murderer-blm-protester-20240519.html"
  },
  {
    "text": "Senate Banking Chair Brown calls on Biden to replace embattled FDIC head  —  FDIC Chair Martin Gruenberg testified at hearings before House and Senate lawmakers last week, where Democrats stopped just shy of calling for his ouster.  —  Senate Banking Chair Sherrod Brown on Monday called … ",
    "url": "https://www.politico.com/news/2024/05/20/brown-calls-on-biden-to-replace-embattled-fdic-head-00158864"
  },
  {
    "text": "A Former Leader of the Hells Angels Motorcycle Gang Joins Trump in Court  —  Chuck Zito, who did time on drug conspiracy charges, has tried to recast his persona as a general-purpose tough guy around town.  —  An entourage of more than a dozen supporters who joined President Donald J. Trump … ",
    "url": "https://www.nytimes.com/2024/05/20/nyregion/chuck-zito-hells-angels-trump-trial.html"
  },
  {
    "text": "Biden bizarrely suggests he was VP during pandemic in latest blunder  —  President Biden bizarrely declared Sunday that things got “kinda bad” when he was vice president during the pandemic — even though COVID-19 hit three years after the Obama administration left office.",
    "url": "https://nypost.com/2024/05/20/us-news/biden-says-things-were-kinda-bad-when-he-was-vice-president-during-pandemic/"
  },
  {
    "text": "Social media slams latest transgender state champion  —  Activists on social media were quick to blast the nation's latest transgender state champion after a biological male who identifies as a woman took first place in the Oregon Girls' 6A 200-meter championship.",
    "url": "https://www.washingtonexaminer.com/news/3010138/social-media-slams-latest-transgender-state-champion/"
  },
  {
    "text": "Robert F Kennedy Jr lists foreclosed New York home as voting address  —  Independent presidential candidate does not own the listed property and is not in public searches as one of its residents  —  Robert F Kennedy Jr has listed a home in foreclosure for non-payment as his voting address … ",
    "url": "https://www.theguardian.com/us-news/article/2024/may/20/robert-f-kennedy-jr-address"
  },
  {
    "text": "Why isn't Donald Trump in jail already?  —  Donald Smith would be in a cell by now! … “Why isn't Donald Trump in jail already?”  —  It's a fair question, particularly in light of the flagrant gag order violations in Trump's Manhattan criminal trial, both by the man himself and his surrogates.",
    "url": "https://www.publicnotice.co/p/trump-merchan-gag-order-violations-jail-why-not"
  },
  {
    "text": "In Nevada, another GOP Senate contender downplays stance on abortion … - Brown is seeking the GOP nomination to unseat Sen. Jacky Rosen (D-Nev.) in a state that is a key battleground for the presidential race and the fight over which party will control the Senate.",
    "url": "https://www.axios.com/2024/05/20/nevada-senate-republicans-abortion-sam-brown"
  },
  {
    "text": "Sources: Manchin is being encouraged to hop into governor's race against Morrisey  —  Sources close to Senator Joe Manchin, a mainstay of Democratic politics in West Virginia, say he is being encouraged to run for governor.  —  Two sources confirmed that the outreach comes from Republicans … ",
    "url": "https://wvmetronews.com/2024/05/20/sources-manchin-is-being-encouraged-to-hop-into-governors-race-against-morrisey/"
  },
  {
    "text": "We'll Protect Both Life and IVF  —  A Senate bill to clear up confusion after an Alabama Supreme Court ruling.  —  Families across the U.S. are understandably worried that in vitro fertilization is under threat.  As Republican senators from Texas and Alabama, we're united on many issues … ",
    "url": "https://www.wsj.com/articles/well-protect-both-life-and-ivf-81e2bf1f"
  },
  {
    "text": "Senate investigation finds BMW and others used parts made with Chinese forced labor  —  .  —  A Senate inquiry into automakers found that BMW, Jaguar Land Rover, and Volkswagen used parts from a Chinese manufacturer that is accused of using forced labor in Xinjiang.",
    "url": "https://www.washingtonexaminer.com/policy/finance-and-economy/3010324/senate-investigation-bmw-others-used-car-parts-chinese-forced-labor/"
  }
]