[
  {
    "text": "Russian activist and Putin critic Alexei Navalny dies in prison  —  Opposition leader, 47, was being held in jail about 40 miles north of Arctic Circle  —  The Russian opposition leader Alexei Navalny has died in jail, the country's prison service has said, in what is likely to be seen … ",
    "url": "https://www.theguardian.com/world/2024/feb/16/russian-activist-and-putin-critic-alexei-navalny-dies-in-prison"
  },
  {
    "text": "Fani Willis Endures Disrespect, Racist Tropes, And Public Humiliation  —  A lot of things happened.  Here are some of the things.  This is TPM's Morning Memo.  Sign up for the email version.  —  The District Attorney And Race  —  The smoldering confrontation in an Atlanta courtroom … ",
    "url": "https://talkingpointsmemo.com/morning-memo/fani-willis-racism-trump-georgia-rico-romantic-relationship"
  },
  {
    "text": "Alexei Navalny, the fiercest foe of Russia's Putin, has died, Russian authorities say  —  Alexei Navalny, the fiercest foe of Russian President Vladimir Putin who crusaded against official corruption and staged massive anti-Kremlin protests, died in prison Friday, Russia's prison agency said.",
    "url": "https://apnews.com/article/russia-navalny-dead-opposition-leader-2d11644f7ae5332587b39150f1fd1738"
  },
  {
    "text": "Russian opposition leader Alexei Navalny dies in prison  —  Navalny, 47, a prominent critic of President Vladimir Putin, spent his final years behind bars as the Russian leader reshaped the country to rally behind his war in Ukraine.  —  Russian opposition leader Alexei Navalny has died in prison … ",
    "url": "https://www.nbcnews.com/news/world/russian-opposition-leader-alexei-navalny-dies-prison-rcna79718"
  },
  {
    "text": "Putin critic Alexei Navalny, 47, dies in Arctic Circle jail  —  Russia's most significant opposition leader for the past decade, Alexei Navalny, has died in an Arctic Circle jail, the prison service said.  —  Seen as President Vladimir Putin's most vociferous critic, Navalny was serving … ",
    "url": "https://www.bbc.com/news/world-europe-68315943"
  },
  {
    "text": "Alexei Navalny, Russian opposition leader, dies in prison, officials say  —  RIGA, Latvia — Russia's jailed opposition leader, Alexei Navalny, died in a Russian prison colony on Friday, Russia's prison service announced early afternoon, without giving the cause of his death.",
    "url": "https://www.washingtonpost.com/world/2024/02/16/alexei-navalny-dead-russia-prsion/"
  },
  {
    "text": "Trump opts against Supreme Court appeal on civil immunity claim over Jan. 6 lawsuits  —  The decision not to seek high court review means cases brought against Trump over Jan. 6 can move forward in district court, although he can still mount an immunity defense.",
    "url": "https://www.nbcnews.com/politics/supreme-court/trump-opts-supreme-court-appeal-immunity-claim-police-jan-6-lawsuits-rcna138869"
  },
  {
    "text": "Trump Privately Expresses Support for a 16-Week Abortion Ban  —  In supporting a 16-week ban with exceptions, Donald Trump appears to be trying to satisfy social conservatives who want to further restrict abortion access and voters who want more modest limits.",
    "url": "https://www.nytimes.com/2024/02/16/us/politics/trump-abortion-ban.html"
  },
  {
    "text": "Inside Trump's ouster of Ronna McDaniel as RNC chair  —  “Loyalty is a one-way street” for the former president, one party committeeman said  —  For much of the fall, Donald Trump was annoyed at Republican National Committee Chair Ronna McDaniel.  She was refusing to cancel the party's primary debates … ",
    "url": "https://www.washingtonpost.com/politics/2024/02/16/ronna-mcdaniel-trump-rnc/"
  },
  {
    "text": "Why Attacks on Trump's Mental Acuity Don't Land  —  Ten years ago, I stood in the back of a large room at Saint Anselm College in New Hampshire, watching Donald Trump ramble.  The celebrity billionaire had been loitering on the fringes of American politics for a few years, but this was my first time seeing him give a proper speech.",
    "url": "https://www.theatlantic.com/politics/archive/2024/02/trump-buzzfeed-mar-a-lago-speech-coherence/677480/"
  },
  {
    "text": "Judge Cannon—Yes, Judge Cannon!  —Just Shot Down a Trump Delay Tactic  —  Judge Aileen Cannon isn't buying Donald Trump's newest delay tactic in the classified documents case.  —  On Thursday, Cannon, a Trump-appointed judge, shot down the GOP front-runner's latest effort to postpone pretrial deadlines … ",
    "url": "https://newrepublic.com/post/179061/judge-cannon-shut-down-trump-delay-tactic-classified-documents-trial"
  },
  {
    "text": "FBI informant charged with lying about Joe and Hunter Biden's ties to Ukrainian energy company  —  WASHINGTON (AP) — An FBI informant has been charged with lying to his handler about ties between President Joe Biden, his son Hunter and a Ukrainian energy company.",
    "url": "https://apnews.com/article/hunter-biden-burisma-fbi-informant-lying-6969656f6012780a23a4b8841ce2689b"
  },
  {
    "text": "Witness Told Feds She Was Paid for Sex Parties With Matt Gaetz  —  The Ethics Committee is investigating Gaetz—and has text messages between the congressman and a woman who claims she had sex with Gaetz at parties she was paid to attend. … When ABC News reported on Wednesday … ",
    "url": "https://www.thedailybeast.com/witness-told-feds-she-was-paid-for-sex-parties-with-matt-gaetz"
  },
  {
    "text": "Senate Democrat: Americans will be next on front lines against Russia if Ukraine aid not approved  —  American soldiers could be next in line to combat the Russian military if the House does not approve a supplemental package that includes aid to Ukraine, Sen. Chris Coons (D-Del.) said Friday.",
    "url": "https://thehill.com/homenews/senate/4472542-senate-democrat-americans-will-be-next-on-front-lines-against-russia-if-ukraine-aid-not-approved/"
  },
  {
    "text": "The top doctor for CBP tried to order fentanyl lollipops for a helicopter mission in New York, whistleblowers say  —  The whistleblowers also allege Dr. Alexander Eastman was already under investigation for trying to procure narcotics for a friend who worked as a chopper pilot for the border agency.",
    "url": "https://www.nbcnews.com/politics/immigration/cbp-doctor-tried-order-fentanyl-lollipops-helicopter-mission-new-york-rcna139116"
  },
  {
    "text": "Greece becomes first Orthodox Christian country to legalize same-sex civil marriage  —  Lawmakers in Greece have begun a debate on a landmark bill to legalize same-sex marriage.  It would make Greece the first Orthodox Christian country to do so.  The Valentine's Day session … ",
    "url": "https://apnews.com/article/greece-same-sex-marriage-law-parliament-church-5be190dd6a7628d7a057be683256b8c2"
  },
  {
    "text": "Democrats Have a Better Option Than Biden  —  It requires them to embrace an old-fashioned approach to winning a campaign.  —  Back to The Ezra Klein Show  —  More episodes of  —  The Ezra Klein Show  —  Building the Palestinian State With Salam Fayyad  —  •  59:17",
    "url": "https://www.nytimes.com/2024/02/16/opinion/ezra-klein-biden-audio-essay.html"
  },
  {
    "text": "Biden campaign blasts Trump's comments on Putin and NATO in a new ad  —  First to NBC News: The ad highlights Trump's remarks that Russia should “do whatever the hell they want” to NATO countries that didn't spend enough on defense.  —  WASHINGTON — President Joe Biden's re-election campaign … ",
    "url": "https://www.nbcnews.com/politics/2024-election/biden-campaign-blasts-trump-putin-nato-new-ad-rcna139178"
  }
]