[
  {
    "text": "Exclusive: Biden plans feisty economic reset … - Biden needs a cure for what some advisers call “Trump amnesia” — the notion that the chaos and unpopularity of Trump's presidency has receded from some voters' memories nearly four years on. … - Voters largely understand the contrasts between Trump … ",
    "url": "https://www.axios.com/2024/03/07/state-of-the-union-biden-us-economy"
  },
  {
    "text": "Trump and his Republican base are actively scaring away undecided voters -spelling potential disaster in the election  —  Trump seems to show little interest in reaching out to Nikki Haley's voters — and that could hurt him, Eric Garcia writes  —  Upon the news that Nikki Haley would suspend her campaign … ",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/trump-maga-republicans-losing-voters-b2508210.html"
  },
  {
    "text": "Trump to Seize Control of GOP Machine After Clinching Nomination  — Party staffers are bracing for layoffs under new leadership  — Some in GOP fear Trump may tap party funds to pay legal bills  —  Donald Trump will tighten his grip on the GOP on Friday when his allies are poised … ",
    "url": "https://www.bloomberg.com/news/articles/2024-03-07/trump-to-seize-control-of-gop-machine-after-clinching-nomination"
  },
  {
    "text": "Navy demoted Ronny Jackson after probe into White House behavior  —  Ronny Jackson, the former White House physician turned GOP congressman, regularly touts his military bona fides.  —  “As a retired U.S. Navy Rear Admiral with nearly three decades of military service I understand the commitment … ",
    "url": "https://www.washingtonpost.com/nation/2024/03/07/ronny-jackson-demotion-white-house-medical-unit-navy/"
  },
  {
    "text": "How millions in corporate cash could help a radical conspiracy theorist become governor  —  Judd Legum, Tesnim Zekeria, and Rebecca Crosby  —  On Tuesday, Mark Robinson (R) won the Republican nomination for Governor of North Carolina.  Robinson, currently North Carolina's lieutenant governor … ",
    "url": "https://popular.info/p/how-millions-in-corporate-cash-could"
  },
  {
    "text": "Spate of Mock News Sites With Russian Ties Pop Up in U.S.  —  The fake news organizations, experts say, represent a technological leap in the Kremlin's efforts to spread false and misleading narratives.  —  Into the depleted field of journalism in America, a handful of websites have appeared … ",
    "url": "https://www.nytimes.com/2024/03/07/business/media/russia-us-news-sites.html"
  },
  {
    "text": "Biden to announce ‘emergency’ US military mission to build port on Gaza coast to deliver aid  —  It will receive “large ships carrying food, water, medicine,” an official said.  —  A military aircraft drops packages towards Gaza, amid the ongoing conflict between Israel and the Palestinian group Hamas … ",
    "url": "https://abcnews.go.com/Politics/sotu-biden-announce-emergency-us-military-mission-build/story?id=107889126"
  },
  {
    "text": "Sweden officially joins NATO, ending decades of post-World War II neutrality  —  Sweden on Thursday formally joined NATO as the 32nd member of the transatlantic military alliance, ending decades of post-World War II neutrality and centuries of broader non-alignment with major powers … ",
    "url": "https://apnews.com/article/sweden-nato-us-russia-ukraine-8372bc866c8ddcf42d2b8209fa5cd2b1"
  },
  {
    "text": "Steve Bannon's Refusal to Pay His Bills Is Costing Him Big  —  Bannon has refused to pay his legal bills for two years.  Now he and his current lawyer are facing fines over Bannon's refusal to make good on his debts. … For two years, Steve Bannon has refused to pay the half-million dollars he owes his former lawyer.",
    "url": "https://www.thedailybeast.com/steve-bannons-refusal-to-pay-his-bills-is-costing-him-big"
  },
  {
    "text": "House panel passes measure blocking Biden administration from finalizing nursing home staffing rule  —  The GOP-controlled House Ways & Means Committee on Wednesday passed a bill that would block the Biden administration from implementing rules requiring minimum staffing levels for nursing homes.",
    "url": "https://thehill.com/homenews/house/4516104-house-panel-passes-measure-blocking-biden-administration-from-finalizing-nursing-home-staffing-rule/"
  },
  {
    "text": "Charted: Trump world allies sentenced to prison … - He is expected to be sentenced to five months in prison in April. … - Former Trump campaign lawyer Sidney Powell — one of Trump's co-defendants in the sprawling Georgia election subversion case — took a plea deal to testify against co-defendants that helped her avoid prison.",
    "url": "https://www.axios.com/2024/03/07/trump-associates-prison-sentence-crimes-list"
  },
  {
    "text": "Ex-Congressional Candidate Endorsed by Trump Wanted for Murder  —  A former Nevada Republican congressional candidate who was endorsed by President Donald Trump is wanted by police in relation to the murder of a man in a Las Vegas hotel.  —  An arrest warrant was issued for 45-year-old politician … ",
    "url": "https://www.mediaite.com/politics/ex-congressional-candidate-endorsed-by-trump-wanted-for-murder/"
  },
  {
    "text": "Missouri's total war on Planned Parenthood  —  Republicans aren't stopping at abortion bans.  —  ∙ Paid  —  Given the sinkhole of conspiracies that is Elon Musk's X, it shouldn't be surprising that Andrew Bailey, Missouri's hard-right attorney general, used the platform to announce … ",
    "url": "https://www.publicnotice.co/p/missouri-planned-parenthood-lawsuit"
  },
  {
    "text": "In Shinzo's shadow, Japan fears ‘if Trump’  —  Moshi Tora.  That's the compact phrase now spreading like wildfire in Japan.  It means “If Trump,” and is often said with a sense of foreboding.  —  This haiku-like, four-syllable phrase is short for the longer sentence: “What if Trump wins the presidency again?”",
    "url": "https://thehill.com/opinion/white-house/4513866-in-shinzos-shadow-japan-fears-if-trump/"
  },
  {
    "text": "Byron Donalds wouldn't commit to certifying election results if he was VP … - Donalds also did not clarify if he would have certified the 2020 election results, during an interview with Axios' Sophia Cai.  — Trump, the GOP presidential frontrunner, has continued to push the false theory … ",
    "url": "https://www.axios.com/2024/03/07/byron-donalds-certifying-election-results-trump-vp"
  },
  {
    "text": "The White House Announces Guest List for the First Lady's Box for the 2024 State of the Union Address  —  WASHINGTON, D.C. - First Lady Jill Biden will welcome guests to join her in the viewing box for President Biden's State of the Union Address on Thursday, March 7, 2024.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/03/07/the-white-house-announces-guest-list-for-the-first-ladys-box-for-the-2024-state-of-the-union-address/"
  },
  {
    "text": "Profound Damage Found in Maine Gunman's Brain, Possibly From Blasts  —  A laboratory found a pattern of cell damage that has been seen in veterans exposed to weapons blasts, and said it probably played a role in symptoms the gunman displayed before the shooting.",
    "url": "https://www.nytimes.com/2024/03/06/us/maine-shooting-brain-injury.html"
  },
  {
    "text": "Public Calls for Menendez Resignation  —  Bipartisan opinion much more negative than earlier corruption case  —  West Long Branch, NJ - Public opinion of Sen. Bob Menendez has plummeted since he was charged in a second corruption case in less than ten years.",
    "url": "https://www.monmouth.edu/polling-institute/reports/monmouthpoll_nj_030724/"
  },
  {
    "text": "FDA says to throw away these 6 cinnamon products because they contain high levels of lead  —  Consumers should not purchase half a dozen ground cinnamon products sold by retailers including Family Dollar and Dollar Tree because they contain elevated levels of lead, the U.S. Food and Drug Administration … ",
    "url": "https://www.cbsnews.com/news/lead-cinnamon-fda-applesauce-children/"
  }
]