[
  {
    "text": "People Close to Biden Say He Appears to Accept He May Have to Leave the Race  —  One person familiar with President Biden's thinking cautioned that he had not yet made up his mind to leave the race, after three weeks of insisting that almost nothing would drive him out.",
    "url": "https://www.nytimes.com/2024/07/18/us/politics/biden-election-drop-out.html"
  },
  {
    "text": "Obama tells allies Biden needs to seriously consider his viability  —  The former president, hugely influential in the party, has told associates that Biden's path to victory has significantly shrunk.  —  Former president Barack Obama has told allies in recent days that President Biden's path … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/18/obama-says-biden-must-consider-viability/"
  },
  {
    "text": "Behind the Curtain: Top Dems now believe Biden will exit … - The president is being told that if he stays in, former President Trump could win in a landslide and wipe away Biden's legacy and Democrats' hopes in November. … - Democrats fully expect polls after the Republican National Convention … ",
    "url": "https://www.axios.com/2024/07/18/president-biden-drop-out-election-democrats"
  },
  {
    "text": "Once defiant, Biden is now ‘soul searching’ about dropping out of race, source says  —  U.S. President Joe Biden is taking calls to step aside as the Democratic presidential candidate seriously and multiple Democratic officials think an exit is a matter of time, according to sources familiar with the matter.",
    "url": "https://www.reuters.com/world/us/once-defiant-biden-is-now-soul-searching-about-dropping-out-race-source-says-2024-07-18/"
  },
  {
    "text": "Pelosi has told House Democrats that Biden may soon be persuaded to exit race  —  The former House speaker has stepped up her behind-the-scenes role in working to persuade the president to bow out of campaign  —  Former House speaker Nancy Pelosi has told some House Democrats … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/18/nancy-pelosi-biden-close-to-dropping-out/"
  },
  {
    "text": "Sen. Jon Tester calls on Biden to drop 2024 presidential bid … - “While I appreciate his commitment to public service and our country, I believe President Biden should not seek re-election to another term,” Tester said in a statement Thursday.  — Tester is facing re-election in deep-red Montana … ",
    "url": "https://www.axios.com/2024/07/19/jon-tester-montana-senate-biden-president-2024"
  },
  {
    "text": "'We're close to the end': Biden world braces for the possibility that the president steps aside  —  As Trump is about to give a major speech accepting the GOP nomination for president, Biden is off the campaign trail with COVID.  —  WASHINGTON — President Joe Biden's political world is collapsing.",
    "url": "https://www.nbcnews.com/politics/2024-election/biden-world-braces-possibility-president-steps-rcna162494"
  },
  {
    "text": "Biden left feeling angry and betrayed by top Democratic leaders wavering on his campaign  —  President Joe Biden is furious at how the party has tried to force him out, as Democrats in Congress increasingly believe the question is when, not if, he will end his campaign.",
    "url": "https://www.nbcnews.com/politics/joe-biden/biden-left-feeling-angry-betrayed-top-democratic-leaders-wavering-camp-rcna162635"
  },
  {
    "text": "Democratic donors begin mobilizing to raise money for Harris if she's the nominee  —  While acknowledging the volatility of the situation, some organizers said donors were already “lining up” to give in case Kamala Harris leads the Democratic ticket.  —  Allies of Vice President Kamala Harris … ",
    "url": "https://www.politico.com/news/2024/07/18/kamala-harris-fundraising-democrats-00169634"
  },
  {
    "text": "Excruciating!  Trump's Endlessly Long, Wildly Dishonest RNC Speech  —  Donald Trump briefly tried a “new tone” — before pivoting to Hannibal Lecter, “crazy” Pelosi, insurrection lies and more of his greatest hits.  —  LOADING  —  MILWAUKEE — Not four years after Donald Trump's eldest son boasted … ",
    "url": "https://www.huffpost.com/entry/donald-trump-republican-takeover_n_66998a0ae4b047588a4b2aac"
  },
  {
    "text": "J.D. Vance Left His Venmo Public.  Here's What It Shows  —  The Republican VP nominee's Venmo network reveals connections ranging from the architects of Project 2025 to enemies of Donald Trump—and the populist's close ties to the very elites he rails against.",
    "url": "https://www.wired.com/story/jd-vance-venmo/"
  },
  {
    "text": "What Secret Service and FBI told Congress about attempted Trump assassination … - FBI and Secret Service officials briefed House lawmakers on Wednesday on their preliminary findings.  — The Secret Service said they identified the building used in the assassination attempt as … ",
    "url": "https://www.axios.com/2024/07/18/secret-service-fbi-trump-assassination-attempt"
  },
  {
    "text": "Hunter Biden seeks dismissal of tax, gun cases, citing decision to toss Trump's classified docs case  —  President Joe Biden's son, Hunter, asked federal judges on Thursday to dismiss tax and gun cases against him, citing a ruling in Florida this week that threw out a separate prosecution of former President Donald Trump.",
    "url": "https://apnews.com/article/hunter-biden-taxes-guns-justice-department-cannon-c403a3ed8e8f2b2f45ebcbd78d113aa3"
  },
  {
    "text": "‘Treated like a convict’: NFL legend Terrell Davis describes getting handcuffed on a plane near his kids after asking for ice  —  Terrell Davis and his family were looking forward to vacationing in California when pro football Hall of Famer was handcuffed and removed from a United Airlines plane - for no apparent reason.",
    "url": "https://www.cnn.com/2024/07/17/us/terrell-davis-united-flight-attendant/"
  },
  {
    "text": "Elon Musk's X pushes Trump tags on all US users  —  The platform prevents users from blocking or muting the tags, which inorganically appear atop the trending page  —  X, the social media platform owned by Trump megadonor Elon Musk, is promoting Trump campaign-curated content to all U.S. users … ",
    "url": "https://www.salon.com/2024/07/18/elon-musks-x-pushes-tags-on-all-us-users/"
  },
  {
    "text": "America will never be the same after Milwaukee's tent revival for the cult of Donald Trump  —  MILWAUKEE — I came to the American Heartland to cover a political convention, but all I found was a tent revival, Brother Trump's Traveling Salvation Show.The Republican National Convention took … ",
    "url": "https://www.inquirer.com/opinion/milwaukee-rnc-cult-donald-trump-20240718.html"
  },
  {
    "text": "Five Just Stop Oil protesters jailed for a total of 21 years after UK motorway blocked  —  Five Just Stop Oil protesters, including one of its co-founders, have been jailed for a total of 21 years for conspiring to organise protests that blocked the M25 motorway in London, England.",
    "url": "https://www.rte.ie/news/uk/2024/0718/1460642-just-stop-oil-court/"
  },
  {
    "text": "Man arrested, accused of threatening FBI Director Christopher Wray online  —  “It's time to burn these mother f—ers down and hang them from trees,” the Georgia man allegedly wrote.  “Hit them where it f—ing hurts.  Hit Chris at his home.”  —  WASHINGTON — A Georgia man has been indicted … ",
    "url": "https://www.nbcnews.com/politics/justice-department/man-arrested-threatening-fbi-director-chris-wray-online-rcna162591"
  },
  {
    "text": "Corporate donors swarm GOP convention: 'It's like a cocktail party'  —  Much of corporate America flocked to the Republican convention this week, packing luxury suites, sponsoring late-night parties and mingling with Trump advisers.  —  Much of corporate America has flocked … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/18/trump-corporations-republican-convention-donors/"
  },
  {
    "text": "Housing provider for unaccompanied migrant children engaged in sexual abuse and harassment, DOJ says  —  The largest housing provider for unaccompanied migrant children has engaged in the “severe, pervasive, and unwelcome” sexual abuse and harassment of children in its care, the Justice Department alleged Thursday.",
    "url": "https://apnews.com/article/migrant-children-provider-lawsuit-0bfd45735aa6d41a4233abe6059f0e1f"
  }
]