[
  {
    "text": "GOP lawmaker pushes to impeach judge over order to halt deportations  —  Republican Rep. Brandon Gill (Texas) said he would be pushing to impeach the federal judge who ordered the Trump administration to halt deportations of Venezuelan gang members over the weekend.",
    "url": "https://thehill.com/homenews/house/5198905-gill-impeach-judge-deportations/"
  },
  {
    "text": "Trump's border czar: “I don't care what the judges think”  —  President Trump's border czar Tom Homan on Monday doubled down on the decision to defy a court order that barred the deportation of alleged Venezuelan gang members.  —  Why it matters: The White House's decision to disregard … ",
    "url": "https://www.axios.com/2025/03/17/tom-homan-deportation-flights-trump-court-order"
  },
  {
    "text": "The Ultimate Trump Story  —  Less than a month into the second Trump administration, the White House began publicly toying with the idea of defying court orders.  In the weeks since then, it's continued to flirt with the suggestion, not ignoring a judge outright but pushing the boundaries … ",
    "url": "https://www.theatlantic.com/politics/archive/2025/03/trump-alien-enemies-act/682068/"
  },
  {
    "text": "The evil at your door  —  Individuals associated with the federal government have, in defiance of a court order and without a trial or any form of due process, deported hundreds of people from the territory of the United States to El Salvador, where they will be held indefinitely in a concentration camp.",
    "url": "https://snyder.substack.com/p/the-evil-at-your-door"
  },
  {
    "text": "Trump Lays Groundwork for Investigating People Pardoned by Biden  —  President asserts in social-media post that Biden's pardons were ‘void, vacant, and of no further force of effect’  —  President Trump questioned the validity of pardons granted by President Joe Biden before he left office … ",
    "url": "https://www.wsj.com/politics/policy/trump-lays-groundwork-for-investigating-people-pardoned-by-biden-73ee33ad"
  },
  {
    "text": "Trump Says Biden's Pardons are ‘Void’ and ‘Vacant’ Because of Autopen  —  The use of the autopen, a device that reproduces signatures and is ubiquitous in government and business, is ordinarily uncontroversial.  There is no power to undo a pardon in the Constitution or case law.",
    "url": "https://www.nytimes.com/2025/03/17/us/autopen-pardons-biden-trump.html"
  },
  {
    "text": "EXCLUSIVE: Memo details Trump plan to sabotage the Social Security Administration  —  An internal Social Security Administration (SSA) memo, sent on March 13 and obtained by Popular Information, details proposed changes to the claims process that would debilitate the agency … ",
    "url": "https://popular.info/p/exclusive-memo-details-trump-plan"
  },
  {
    "text": "Deported Brown University professor had ‘sympathetic photos’ of Hezbollah leaders on her phone, DOJ says  —  The government's explanation for Rasha Alawieh's deportation came before a judge postponed a hearing on whether it defied a judge's order that she not be deported without advance notice to the court.",
    "url": "https://www.politico.com/news/2025/03/17/rasha-alawieh-deportation-026038"
  },
  {
    "text": "What can be done if Trump is openly defying the courts?  —  The question of what happens if the Trump administration openly defies a federal court order has hung over the United States since President Donald Trump's second term began.  If that happens, it will trigger a constitutional crisis.",
    "url": "https://www.vox.com/donald-trump/404665/trump-defy-supreme-court-alawieh-deportation"
  },
  {
    "text": "Exclusive: Navajo Code Talkers disappear from military websites after Trump DEI order  —  Articles about the renowned Native American Code Talkers have disappeared from some military websites, with several broken URLs now labeled “DEI.”  —  Why it matters: From 1942 to 1945 … ",
    "url": "https://www.axios.com/local/salt-lake-city/2025/03/17/navajo-code-talkers-trump-dei-military-websites-wwii"
  },
  {
    "text": "Schumer Postpones Book Tour Amid Backlash to Voting With Republicans  —  Many Democratic activists, desperate for their leaders to stand up to President Trump, have been staging protests outside of Senator Chuck Schumer's home and calling for his resignation.",
    "url": "https://www.nytimes.com/2025/03/17/us/politics/chuck-schumer-book-tour-postponed.html"
  },
  {
    "text": "French politician demands US return the Statue of Liberty  —  A Member of the European Parliament thinks the U.S. should return the Statue of Liberty to France.  —  Raphael Glucksmann, a socialist and member of France's left-wing Place Publique party, made the demand while delivering … ",
    "url": "https://www.washingtonexaminer.com/news/3349519/french-politician-demands-us-return-statue-of-liberty/"
  },
  {
    "text": "Trump has a plan to remake the economy.  But he's not explaining it very well.  —  President Donald Trump's economic plan is causing brief pain while the nation advances to a new “Golden Age.”  But officials have been much less clear about what that destination will look like.",
    "url": "https://www.washingtonpost.com/business/2025/03/17/trump-economy-trade/"
  },
  {
    "text": "GUEST POST: We Are Professors at Columbia.  Here is How We Would Respond.  —  Five Columbia University political scientists offer their unofficial response to the Trump administration's demands on their university.  —  Everything that has been posted on Drezner's World over the past … ",
    "url": "https://danieldrezner.substack.com/p/guest-post-we-are-professors-at-columbia"
  },
  {
    "text": "Destroying America's Brand  —  Last week Mark Carney, having won the Liberal Party's leadership election, became Canada's Prime Minister.  And it looks possible that he may hold that position for a while.  Not long ago the Liberals seemed headed for an electoral wipeout, but they've seen an amazing surge in the polls:",
    "url": "https://paulkrugman.substack.com/p/teslafying-us-exports"
  },
  {
    "text": "DOGE Cuts Reach Key Nuclear Scientists, Bomb Engineers and Safety Experts … Los Alamos National Laboratory in New Mexico.  The National Nuclear Safety Administration field office that oversees the lab lost nine staff members, according to documents reviewed by The New York Times.The Albuquerque Journal, via Associated Press",
    "url": "https://www.nytimes.com/2025/03/17/us/politics/federal-job-cuts-nuclear-bomb-engineers-scientists.html?unlocked_article_code=1.4k4.uE6b._YafB7bQ-dvX&smid=url-share"
  },
  {
    "text": "Brown advises all international community members to postpone, reconsider travel  —  The announcement comes after the deportation of Assistant Professor of Medicine Rasha Alawieh.  —  One week before spring break, Brown advised international community members, including visa holders and permanent residents … ",
    "url": "https://www.browndailyherald.com/article/2025/03/brown-advises-all-international-community-members-to-postpone-reconsider-travel"
  },
  {
    "text": "Trump's Unwelcome News to Auto Chiefs: Buckle Up for What's to Come  —  President Trump's approach to tariffs has unsettled many corporate leaders who believed he would use the levies as a negotiating tool.  As it turns out, he sees them as an end in themselves.  —  The line fell silent.",
    "url": "https://www.nytimes.com/2025/03/17/us/politics/trump-tariffs-auto-industry-corporate-executives.html"
  },
  {
    "text": "Contempt, Equity, and the Boundaries of the United States  —  According to reporting by Josh Gerstein and Myah Ward at Politico, executive officers just defied the court order prohibiting the shipment of prisoners to El Salvador.  The official explanation given for that defiance … ",
    "url": "https://blog.dividedargument.com/p/contempt-equity-and-the-boundaries"
  },
  {
    "text": "Scientists Say NIH Officials Told Them To Scrub mRNA References on Grants  —  National Institutes of Health officials have urged scientists to remove all references to mRNA vaccine technology from their grant applications, two researchers said, in a move that signaled the agency might abandon a promising field of medical research.",
    "url": "https://kffhealthnews.org/news/article/nih-grants-mrna-vaccines-trump-administration-hhs-rfk/"
  },
  {
    "text": "Social Security Employees Warn of Damage From DOGE  —  Current and former employees, both Republican and Democratic, are raising alarms about the damage cost-cutting efforts could do to the agency's ability to serve the public.  —  When Eleanor H., 66, called the Social Security Administration … ",
    "url": "https://www.nytimes.com/2025/03/17/business/social-security-doge-ssa.html?unlocked_article_code=1.4k4.eClI.r8nJVMof_cw_&smid=url-share"
  },
  {
    "text": "Musk forced to halt Cybertruck deliveries as parts fall off  —  Latest development adds to a litany of build-quality issues with the electric pickup  —  Elon Musk's Tesla has been forced to halt sales of its electric Cybertruck pickup amid mounting concern about metal panels falling off the supposedly indestructible vehicles.",
    "url": "https://www.telegraph.co.uk/business/2025/03/16/musk-forced-halt-cybertuck-deliveries-as-parts-fall-off/"
  },
  {
    "text": "There Was Never Any “Fascism Debate”  —  They Refused to Engage  —  A number of my interlocutors in the fascism debate have reversed their positions since witnessing the full extent of the Trump regime's willingness and ability to employ political repression against its enemies.",
    "url": "https://www.unpopularfront.news/p/there-was-never-any-fascism-debate"
  },
  {
    "text": "The Competition to Get Into Law School Is Brutal This Year  —  Applications are surging as students seek stability in a difficult job market  —  A weakening white-collar job market and a contentious political climate are fueling interest in law school, leading to one of the most competitive years … ",
    "url": "https://www.wsj.com/us-news/education/law-school-application-increase-job-market-623bb314?st=XJZCCb&reflink=article_copyURL_share"
  },
  {
    "text": "Trump weighs recognizing Crimea as Russian territory in bid to end war  —  The Scoop  —  The Trump administration is considering recognizing Ukraine's Crimea region as Russian territory as part of any future agreement to end Moscow's war on Kyiv, according to two people familiar with the matter.",
    "url": "https://www.semafor.com/article/03/17/2025/trump-weighs-recognizing-crimea-as-russian-territory-in-bid-to-end-war"
  }
]