[
  {
    "text": "Byron Donalds expresses nostalgia for the Jim Crow era, when ‘the Black family was together’  —  The Trump surrogate's comments, made during a Black voter outreach event in Philadelphia, sparked outrage from Democrats.  —  PHILADELPHIA — Rep. Byron Donalds (R-Fla.) suggested that Black families … ",
    "url": "https://www.politico.com/news/2024/06/05/byron-donalds-nostalgia-jim-crow-00161786"
  },
  {
    "text": "Trump's surrogates reached out to Black voters in Philly with cigars and cognac  —  Former President Donald Trump's campaign and some of his surrogates held two events Tuesday in Philadelphia aimed at engaging Black Philly voters — but it's unclear how many got the message.In the afternoon … ",
    "url": "https://www.inquirer.com/politics/election/trump-black-voters-philadelphia-20240604.html"
  },
  {
    "text": "Senate Republicans block bill to protect Americans' access to contraception  —  Democrats expected the GOP to filibuster the legislation and brought it up to make a point to voters ahead of the 2024 election, viewing reproductive rights as a winning issue.  —  WASHINGTON — Senate Republicans … ",
    "url": "https://www.nbcnews.com/politics/congress/senate-republicans-block-bill-protect-americans-access-contraception-rcna155448"
  },
  {
    "text": "The Two-Time Trump Voters Who Have Had Enough  —  “Now that he is a convicted felon, he's completely unfit.”  —  The day after former President Donald Trump was convicted of 34 felonies, I sat down for a focus group with nine voters from across the country who voted for him twice and don't want to vote for him again.",
    "url": "https://www.theatlantic.com/politics/archive/2024/06/trump-conviction-focus-group/678603/"
  },
  {
    "text": "Donald Trump Suffers Huge Vote Against Him in New Mexico Primary  —  Donald Trump has seen a significant number of votes go against him in the New Mexico  —  presidential primary.  —  While Trump still dominated the race, winning the primary with 84.5 percent of the vote … ",
    "url": "https://www.newsweek.com/donald-trump-new-mexico-primary-result-suffers-huge-vote-against-nikki-haley-1908318"
  },
  {
    "text": "Small Shift Toward Biden After Trump Verdict  —  We reached nearly 2,000 people who participated in previous Times/Siena polls to see if any had changed their minds.  —  It's one of the biggest questions in the wake of Donald J. Trump's conviction: Did the verdict change anyone's mind?",
    "url": "https://www.nytimes.com/2024/06/05/upshot/polling-trump-conviction-voters.html"
  },
  {
    "text": "NYPD preparing to revoke Donald Trump's license to carry a gun after felony conviction in New York  —  The New York City Police Department is preparing to revoke former President Donald Trump's license to carry a gun, a senior police official told CNN.  —  Trump's New York concealed carry license … ",
    "url": "https://www.cnn.com/2024/06/05/politics/trump-gun-nypd-revoke/"
  },
  {
    "text": "Judge Cannon expands hearing on Trump's request to declare special counsel's appointment invalid  —  Judge Aileen Cannon is planning on holding a sprawling hearing on Donald Trump's request to declare Jack Smith's appointment as special counsel invalid, signaling the judge could be more willing … ",
    "url": "https://www.cnn.com/2024/06/04/politics/cannon-trump-special-counsel-hearing"
  },
  {
    "text": "Judge Reshuffles Hearings in Trump Documents Case  —  The new schedule set by Judge Aileen Cannon reflects the array of legal issues that she has yet to resolve amid efforts by the former president's legal team to delay the trial.  —  The federal judge overseeing former President Donald J … ",
    "url": "https://www.nytimes.com/2024/06/05/us/politics/trump-documents-case-hearings.html"
  },
  {
    "text": "Trump's VP search accelerates  —  Prospective running mates have received vetting materials as the race for the No. 2 spot on Trump's ticket narrows to three or four candidates, sources tell NBC News.  —  Donald Trump's search for a running mate is intensifying, as the former president awaits sentencing … ",
    "url": "https://www.nbcnews.com/politics/2024-election/trumps-vp-search-accelerates-rcna155607"
  },
  {
    "text": "VP contenders Burgum, Vance, Rubio asked for documents from Trump team  —  The initial ask for documents reflect who tops Trump's list at this point.  —  Gov. Doug Burgum, R-N.D., Sen. J.D. Vance, R-Ohio and Sen. Marco Rubio, R-Fla.  —  Former President Donald Trump's campaign has begun … ",
    "url": "https://abcnews.go.com/Politics/vp-contenders-burgum-vance-rubio-asked-documents-trump/story?id=110870278"
  },
  {
    "text": "Hochul Halts Congestion Pricing in a Stunning 11th-Hour Shift  —  Weeks before New York was to charge motorists to enter Manhattan's business district, Gov. Kathy Hochul postponed the program citing economic concerns.  —  Gov. Kathy Hochul of New York announced on Wednesday that she was shelving … ",
    "url": "https://www.nytimes.com/2024/06/05/nyregion/congestion-pricing-pause-hochul.html"
  },
  {
    "text": "Trump again suggests political opponents may face prosecution, too  —  In an interview with Newsmax that aired Tuesday evening, the former president said “it's a terrible, terrible path that they're leading us to, and it's very possible that it's going to have to happen to them.”",
    "url": "https://www.washingtonpost.com/politics/2024/06/04/trump-newsmax-opponents-jail-clinton/"
  },
  {
    "text": "Alito's account of the upside-down flag doesn't fully add up.  Here's why.  —  A look at the major discrepancies in Justice Samuel Alito's comments about controversial flags flown at his property and what he still has not fully answered.  —  Supreme Court Justice Samuel A. Alito Jr … ",
    "url": "https://www.washingtonpost.com/politics/2024/06/05/justice-alito-flags-unanswered-questions/"
  },
  {
    "text": "Hunter Biden trial live updates: Hunter Biden's ex-wife, former girlfriend testify about his drug use  —  President Joe Biden's son has pleaded not guilty to three charges related to the possession of a gun while using narcotics. … Zoe Kestan testimony is over, gun dealer will be the next witness",
    "url": "https://www.nbcnews.com/politics/white-house/live-blog/hunter-biden-trial-live-updates-rcna155515"
  },
  {
    "text": "Surveillance pricing (permalink)  —  Noted anti-capitalist agitator Adam Smith had it right: “People of the same trade seldom meet together, even for merriment and diversion, but the conversation ends in a conspiracy against the public, or in some contrivance to raise prices.”",
    "url": "https://pluralistic.net/2024/06/05/your-price-named/#privacy-first-again"
  },
  {
    "text": "Ex-NASCAR Driver and Son Arrested for Allegedly Assaulting Cops on Jan. 6  —  NEED FOR SPEED  —  Jarret Scott went on an expletive-laden rant after officers shoved Tighe Scott away from them, calling them “vaginas” and shouting, “You knocked down my father!”",
    "url": "https://www.thedailybeast.com/ex-nascar-driver-tighe-scott-and-son-arrested-for-allegedly-assaulting-cops-on-jan-6"
  },
  {
    "text": "White dad stops daughter from shaking Black superintendent's hand - at school infamous for Nazi salute photo  —  The same high school made headlines in 2018 when a photo of students performing the Nazi salute emerged  —  The latest headlines from our reporters across the US sent straight to your inbox each weekday",
    "url": "https://www.independent.co.uk/news/world/americas/baraboo-high-school-graduation-nazi-photo-b2557484.html"
  },
  {
    "text": "Speaker Johnson appoints two Trump allies to a committee that handles classified intelligence  —  House Speaker Mike Johnson on Wednesday appointed two far-right Republicans to the powerful House Intelligence Committee, positioning two close allies of Donald Trump who worked to overturn … ",
    "url": "https://apnews.com/article/house-intelligence-committee-trump-perry-jackson-868039d95bc245634644514d2a5abe48"
  },
  {
    "text": "How Trump's guilty verdict could impact his travel … - Even while the case is on appeal, the jury's verdict will stand and he'll be considered a convicted felon. … - That could happen if, for example, the individual is considered a flight risk.  — “I would find it very unlikely … ",
    "url": "https://www.axios.com/2024/06/05/trump-travel-restrictions-convicted-felon"
  },
  {
    "text": "Cucumbers linked to salmonella outbreak that has spread to 25 states  —  A salmonella outbreak linked to cucumbers has expanded to 25 U.S. states and the District of Columbia, with at least 162 people having fallen ill and 54 hospitalized, health officials announced on Wednesday.",
    "url": "https://www.cbsnews.com/news/cucumber-recall-2024-salmonella-states/"
  },
  {
    "text": "FTC prepares to sue largest U.S. alcohol distributor, alleging ‘secret kickbacks’ … The Federal Trade Commission is preparing an antitrust lawsuit against the largest U.S. alcohol distributor, Southern Glazer's Wine and Spirits, two sources familiar with the matter tell CNBC.",
    "url": "https://www.cnbc.com/2024/06/05/ftc-lawsuit-southern-glazers-alcohol.html"
  },
  {
    "text": "SEC Hedge Fund Fee Disclosure Rule Struck Down by US Court  — US appeals court blocks rules opposed by hedge funds, PE firms  — Fund groups argued that agency overstepped its authority  —  Appeals Court Strikes Down SEC Hedge Fund Fee Rule  —  A federal appeals court struck … ",
    "url": "https://www.bloomberg.com/news/articles/2024-06-05/sec-private-fund-fee-disclosure-rules-struck-down-by-court"
  }
]