[
  {
    "text": "CNN Poll: Harris improves on Biden's performance against Trump in early look at new matchup  —  The likely 2024 presidential election campaign between Vice President Kamala Harris and former President Donald Trump begins with no clear leader, according to a new CNN poll conducted by SSRS … ",
    "url": "https://www.cnn.com/2024/07/24/politics/cnn-poll-kamala-harris-donald-trump/"
  },
  {
    "text": "Trump Allies Warn Him: Underestimate Kamala at Your Peril  —  Republicans close to Trump tell him that while they were heading for a landslide before, Harris is putting key swing states back in play  —  IN THE DAYS since Joe Biden dropped out of the 2024 race, several Republicans close to Donald Trump … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-allies-warn-him-kamala-harris-1235067042/"
  },
  {
    "text": "So what does Joe Biden do now?  —  President Joe Biden addressed the nation from the Oval Office Wednesday night in the culmination of a pivotal few weeks that saw him relinquish the Democratic presidential nomination — an act that may one day be the defining moment of his political career.",
    "url": "https://www.vox.com/politics/362997/biden-speech-drop-out-election-harris"
  },
  {
    "text": "As Trump unloads on Harris, even his supporters see her gaining ground  —  Trump's spokesperson says he doesn't know if attacks referencing race or gender of Harris are “off limits,” but says Trump doesn't do them.  —  CHARLOTTE, North Carolina — Even Donald Trump's supporters sense he suddenly has a tougher race on his hands.",
    "url": "https://www.politico.com/news/2024/07/24/trump-rally-harris-attacks-support-00171041"
  },
  {
    "text": "Trump's Nephew Reveals Racist Comments From Former President In New Book  —  In a new memoir, Fred C. Trump III claims his uncle, Donald J. Trump, made cruel and racist comments.  —  In 2020, a few months before the last election, former President Donald J. Trump's niece, Mary Trump … ",
    "url": "https://www.nytimes.com/2024/07/24/us/politics/donald-trump-nephew-book-fred-trump.html?unlocked_article_code=1.900.4AjW.wnlHvJXTzq4g&smid=url-share"
  },
  {
    "text": "My Uncle Donald Trump Told Me Disabled Americans Like My Son ‘Should Just Die’  —  When my uncle was elected President, I recognized what a highly privileged position I would be in.  I would have some access to the White House.  And as long as that was true, I wanted to make sure I used that access for something positive.",
    "url": "https://time.com/7002003/donald-trump-disabled-americans-all-in-the-family/"
  },
  {
    "text": "Around half of Congress' Democrats skip Netanyahu speech … - Among the boycotters are former House Speaker Nancy Pelosi (D-Calif.), former House Majority Whip Jim Clyburn (D-S.C.) and Rep. Alexandria Ocasio-Cortez (D-N.Y.). … - Most of the lawmakers who did attend the speech are on the more moderate … ",
    "url": "https://www.axios.com/2024/07/24/half-house-senate-democrats-boycott-netanyahu"
  },
  {
    "text": "Pelosi says Netanyahu gave ‘the worst’ speech to Congress from any foreign leader  —  Video Player is loading.  —  Play Video  —  Unmute  —  Current Time 0:00  —  Loaded: 0%  —  Stream Type LIVE  —  Seek to live, currently behind liveLIVE  —  Playback Rate  —  Chapters  — Chapters",
    "url": "https://thehill.com/homenews/house/4790348-pelosi-netanyahu-worst-speech-congress/"
  },
  {
    "text": "Posts spread baseless rumors about GOP vice presidential pick JD Vance having sex with a couch  —  CLAIM: Republican vice presidential nominee JD Vance wrote in his 2016 memoir about having sex with a couch.  —  AP'S ASSESSMENT: False.  Vance does not write about performing such an act in his bestselling book.",
    "url": "https://apnews.com/article/fact-check-jd-vance-sex-couch-038130326229"
  },
  {
    "text": "Kamala Harris vetting about a dozen possible VP candidates  —  Approximately a dozen individuals are being vetted as possible running mates for Vice President Kamala Harris, according to a source familiar with the process.  —  That number is larger than previously reported … ",
    "url": "https://www.cbsnews.com/news/kamala-harris-vp-vetting/"
  },
  {
    "text": "The Murdoch Family Is Battling Over the Future of the Fox Empire  —  Rupert Murdoch, the patriarch, has moved to change the family's irrevocable trust to preserve his media businesses as a conservative force.  Several of his children are fighting back.  —  Rupert Murdoch is locked … ",
    "url": "https://www.nytimes.com/2024/07/24/business/media/rupert-murdoch-succession-fox.html?unlocked_article_code=1.9k0.TPyH.Tfa_RrPNVIas&smid=url-share"
  },
  {
    "text": "Geoff Duncan endorses Harris, says he's ‘committed to beating Donald Trump’  —  Former Atlanta Mayor Bottoms joins ‘Politically Georgia’ to talk about vice president's Atlanta connections  —  In an interview Wednesday on “Politically Georgia,” former Lt. Gov. Geoff Duncan said he would vote … ",
    "url": "https://www.ajc.com/politics/geoff-duncan-endorses-harris-says-hes-committed-to-beating-donald-trump/M3MBQT5VWRCJVL37ZOZACFEPP4/"
  },
  {
    "text": "Republicans condemn Netanyahu protesters for burning US flags — and waving Hamas ones instead  —  Republicans seized immediately on images of burning U.S. flags and vandalism at Washington, D.C.'s Union Station following Benjamin Netanyahu's speech as evidence of widespread antisemitism … ",
    "url": "https://www.politico.com/live-updates/2024/07/24/congress/republicans-flag-burning-protesters-hamas-00171030"
  },
  {
    "text": "NORAD detects, tracks and intercepts Russian and PRC aircraft operating in the Alaska ADIZ  —  North American Aerospace Defense Command Public Affairs  —  COLORADO SPRINGS, Colo. - NORAD detected, tracked, and intercepted two Russian TU-95 and two PRC H-6 military aircraft operating … ",
    "url": "https://www.norad.mil/Newsroom/Press-Releases/Article/3849184/norad-detects-tracks-and-intercepts-russian-and-prc-aircraft-operating-in-the-a/"
  },
  {
    "text": "How Kamala Harris Took Command of the Democratic Party in 48 Hours  —  She worked the phones.  Her team worked the delegates.  When it was over, she had quickly locked down the nomination in a “well-orchestrated cascade,” as one party leader put it.  —  She worked the phones.  Her team worked the delegates.",
    "url": "https://www.nytimes.com/2024/07/24/us/politics/kamala-harris-democrats-nomination.html?unlocked_article_code=1.9k0.lb48.5ajwltz9N4eO&smid=nytcore-ios-share&referringSource=articleShare&sgrp=c-cb"
  },
  {
    "text": "Trump allies crush misinformation research despite Supreme Court loss  —  High court ruling green-lighting contact between government and tech companies to stymie falsehoods online hasn't deterred a GOP campaign against academics, nonprofits and tech industry initiatives aimed at addressing their spread.",
    "url": "https://www.washingtonpost.com/technology/2024/07/14/trump-allies-disarm-misinformation-researchers-ahead-election/"
  },
  {
    "text": "Google Is the Only Search Engine That Works on Reddit Now Thanks to AI Deal  —  DuckDuckGo, Bing, Mojeek, and other search engines are not returning full Reddit results any more. … Google is now the only search engine that can surface results from Reddit, making one of the web's … ",
    "url": "https://www.404media.co/google-is-the-only-search-engine-that-works-on-reddit-now-thanks-to-ai-deal/"
  },
  {
    "text": "Don't treat Trump like he has no agency  —  Reporters who know Donald Trump know that he will respond to Kamala Harris's candidacy with racist and sexist attacks on her as a woman of color.  —  In fact, he's already started.  —  But the way two New York Times journalists wrote about it on Tuesday … ",
    "url": "https://presswatchers.org/2024/07/dont-treat-trump-like-he-has-no-agency/"
  },
  {
    "text": "Harris' Wall Street allies strategize on private call, Rubin, Lasry, Wolf among them … Vice President Kamala Harris' allies on Wall Street huddled on a private Zoom call Wednesday to strategize how to defeat former President Donald Trump, according to people familiar with the matter.",
    "url": "https://www.cnbc.com/2024/07/24/harris-wall-street-allies-trump.html"
  },
  {
    "text": "JD Vance Has a Bunch of Weird Views on Gender  —  Overt chauvinism is the unifying thread of the New Right.  —  On July 29, 2021, JD Vance appeared on Tucker Carlson's show back when he was still a Fox News host.  Like Carlson, Vance had once opposed Donald Trump, and like Carlson … ",
    "url": "https://www.politico.com/news/magazine/2024/07/24/jd-vance-gender-views-00170673"
  },
  {
    "text": "Johnson seeks to quash “DEI hire”-type attacks on Harris … - Johnson (R-La.) encouraged members to\" focus on policy not personality\" during a closed-door conference meeting Tuesday, later echoing that sentiment publicly to reporters.  — Rep. Byron Donalds (R-Fla.) encouraged members in the meeting to … ",
    "url": "https://www.axios.com/2024/07/24/republicans-pushback-dei-attacks-harris"
  }
]