[
  {
    "text": "Apple, Google remove TikTok from stores as app halts service in US … Apple and Google removed TikTok from their app stores Saturday night, complying with a law requiring China's ByteDance to divest the social app or see it face an effective ban in the U.S.",
    "url": "https://www.cnbc.com/2025/01/18/apple-google-remove-tiktok-from-stores-as-app-halts-service-in-us.html"
  },
  {
    "text": "Oracle Prepares to Start Shutting TikTok Servers Saturday Night  —  Leaders at Oracle, the main cloud computing provider for TikTok's U.S. operations, have told some staff to prepare to shut down servers that host U.S. TikTok data on Saturday night as early as around 9 p.m. Eastern … ",
    "url": "https://www.theinformation.com/articles/oracle-prepares-to-start-shutting-tiktok-servers-saturday-night"
  },
  {
    "text": "TikTok goes dark in the US  —  “We are fortunate that President Trump has indicated that he will work with us on a solution to reinstate TikTok once he takes office,” the company said in a notice on the app.  —  TikTok revoked access Saturday night for U.S. users ahead of a federal ban on the app … ",
    "url": "https://www.politico.com/news/2025/01/18/tiktok-shutdown-before-us-ban-00199167"
  },
  {
    "text": "Trump launches meme coin, apparently makes more than $25 billion overnight … - It also speaks to the nature of the crypto industry that someone could have $25 billion worth of something that literally did not exist 24 hours previously. … - His website bills it as “the only official Trump meme.”",
    "url": "https://www.axios.com/2025/01/18/trump-meme-coin-25-billion"
  },
  {
    "text": "Trump begins selling a new crypto token, in a move assailed as an ethical breach.  —  The president-elect and his family have a direct and potentially lucrative stake in the sale of a cryptocurrency product that surged in value in the hours after going on sale, days before his inauguration.",
    "url": "https://www.nytimes.com/2025/01/18/us/politics/trump-meme-coin-crypto.html"
  },
  {
    "text": "A List of Those Who Could Be in Line for Trump's ‘Retribution’ … Supporters of President-elect Donald J. Trump outside Mar-a-Lago in West Palm Beach, Fla., in December.Maddie McGarvey for The New York Times  —  President-elect Donald J. Trump has promised at times to use the vast powers … ",
    "url": "https://www.nytimes.com/2025/01/18/us/politics/trump-retribution-list.html"
  },
  {
    "text": "Trump's Targets Fear ‘Retribution’ He Promised in Second Presidency  —  President-elect Donald J. Trump has promised to punish adversaries, particularly those involved in his prosecutions and the congressional investigation of the Jan. 6 Capitol riot.Eric Lee/The New York Times",
    "url": "https://www.nytimes.com/2025/01/18/us/politics/trump-officials-retribution.html?unlocked_article_code=1.qE4.VLsn.Ek59ylINDYjP&smid=bs-share"
  },
  {
    "text": "Exclusive: German ambassador warns of Trump plan to redefine constitutional order, document shows  —  Germany's ambassador to the United States has warned that the incoming Trump administration will rob U.S. law enforcement and the media of their independence and hand big tech companies … ",
    "url": "https://www.reuters.com/world/us/german-ambassador-warns-trump-plan-redefine-constitutional-order-document-shows-2025-01-18/"
  },
  {
    "text": "Trump officials haven't decided on post-inauguration Chicago raids, Homan says  —  “Border czar” Tom Homan said the incoming administration is reconsidering plans for an immigration enforcement blitz in Chicago next week after preliminary details leaked.  —  President-elect Donald Trump's handpicked … ",
    "url": "https://www.washingtonpost.com/immigration/2025/01/18/chicago-immigration-raids/"
  },
  {
    "text": "Trump Told Advisers He Wants to Visit China as President  —  The possibility of a visit to China comes as Trump has threatened to impose stiff tariffs on Chinese imports  —  WASHINGTON—President-elect Donald Trump has told advisers he wants to travel to China after he takes office … ",
    "url": "https://www.wsj.com/us-news/trump-china-xi-jinping-visit-e9141794?st=67WSBs"
  },
  {
    "text": "Democrats Now Threatening People Who Donated to Trump's Inauguration  —  Democrats are the political equivalent of mafia bosses who basically run protection rackets.  —  “Nice company you have there.  Shame if something happened to it.”  —  We saw a lot of this behavior over the past few years.",
    "url": "https://hotair.com/david-strom/2025/01/18/democrats-now-threatening-people-who-donated-to-trumps-inauguration-n3798956"
  },
  {
    "text": "Marc Andreessen Seems to Think Hillary Clinton Was Actually President  —  The New York Times made a sneaky edit to its own transcript to make Andreessen sound more coherent. … Marc Andreessen, the billionaire tech investor who co-founded Netscape, has recently been making the rounds … ",
    "url": "https://gizmodo.com/marc-andreessen-seems-to-think-hillary-clinton-was-actually-president-2000552062"
  },
  {
    "text": "House conservative defies Johnson over remote voting for new moms in Congress  —  GOP Rep. Anna Paulina Luna repeatedly tried to convince Speaker Mike Johnson that he — as a pro-family champion — should back her push to allow new mothers to vote remotely for six weeks while they are recovering from birth.",
    "url": "https://www.cnn.com/2025/01/18/politics/house-remote-voting-new-moms-congress"
  },
  {
    "text": "North Carolina Supreme Court Candidate Wants Military Absentee Votes Tossed.  Years Earlier, That's How He Voted.  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up for Dispatches, a newsletter that spotlights wrongdoing around the country, to receive our stories in your inbox every week.",
    "url": "https://www.propublica.org/article/jefferson-griffin-military-absentee-votes-north-carolina-supreme-court"
  },
  {
    "text": "Netanyahu praises Trump in ‘temporary’ ceasefire announcement  —  Israeli Prime Minister Benjamin Netanyahu praised President-elect Trump for his role in negotiating a ceasefire between the nation and the militant group Hamas.  —  “From the moment he was elected, President Trump has been involved … ",
    "url": "https://thehill.com/policy/international/5093656-benjamin-netanyahu-donald-trump-israel-gaza-ceasefire/"
  },
  {
    "text": "Trump Is Packing His Cabinet With Crypto, Oil and Private Prison Profiteers  —  Trump's policy makers will be overseeing the industries that they run and own.  —  Money in U.S. politics is nothing new, but the scale of crass intervention in 2024 by mega-billionaire donors through super PACs was unprecedented.",
    "url": "https://truthout.org/articles/trump-is-packing-his-cabinet-with-crypto-oil-and-private-prison-profiteers/"
  },
  {
    "text": "Trump hires fed-firing mastermind  —  James Sherk, who was behind Trump's push to make it easier to fire federal workers, is set to return to the White House.  —  President-elect Donald Trump is bringing back a senior White House official who led his first-term push to make it easier to fire civil servants.",
    "url": "https://www.politico.com/news/2025/01/18/trump-hires-fed-firing-mastermind-00199154"
  }
]