[
  {
    "text": "Lisa Murkowski, done with Donald Trump, won't rule out leaving GOP  —  Hear more on Sen. Lisa Murkowski's plans on “Inside Politics Sunday with Manu Raju” at 8 a.m. ET and 11 a.m. ET.﻿  —  Sen. Lisa Murkowski, aghast at Donald Trump's candidacy and the direction of her party, won't rule out bolting from the GOP.",
    "url": "https://www.cnn.com/2024/03/24/politics/lisa-murkowski-done-with-trump/"
  },
  {
    "text": "Murkowski doesn't rule out leaving GOP  —  Sen. Lisa Murkowski (R-Alaska) suggested she is not ruling out leaving the GOP, pointing to its shift towards former President Trump.  —  “I wish that as Republicans, we had a nominee that I could get behind.  I certainly can't get behind Donald Trump … ",
    "url": "https://thehill.com/homenews/senate/4552625-murkowski-doesnt-rule-out-leaving-gop/"
  },
  {
    "text": "Sen. Lisa Murkowski not ruling out splitting with GOP … - Murkowski did not confirm she would move to become and independent, saying, “I am navigating my way through some very interesting political times, so let's just leave it at that.”  — If Murkowski changed her party affiliation … ",
    "url": "https://www.axios.com/2024/03/24/lisa-murkowski-gop-exit-trump"
  },
  {
    "text": "Trump escalates solidarity with Jan. 6 rioters as his own trials close in  —  The presumptive Republican nominee is aligning himself with the rioters and intensifying his use of dark, graphic and at times violent language  —  Shortly after Donald Trump walked onstage at a recent rally … ",
    "url": "https://www.washingtonpost.com/elections/2024/03/23/trump-jan-6-rioters-rhetoric-campaign/"
  },
  {
    "text": "Ronna McDaniel Will Not Appear on MSNBC Amid ‘Internal Backlash’ Over Her Hire at NBC News: Report  —  Former RNC chair Ronna McDaniel may have inked a deal to appear as a political analyst on NBC News, but she is not welcome on sister network MSNBC, a new report revealed.",
    "url": "https://www.mediaite.com/media/ronna-mcdaniel-will-not-appear-on-msnbc-amid-internal-backlash-over-her-hire-at-nbc-news-report/"
  },
  {
    "text": "MSNBC Has No Plans to Have Ex-RNC Chief on Network  —  Cable network head seeks to address employee and talent backlash over appointment of Ronna McDaniel as an NBC News contributor  —  MSNBC has no plans to have former Republican National Committee Chairwoman Ronna McDaniel on the cable network … ",
    "url": "https://www.wsj.com/business/media/msnbc-has-no-plans-to-have-ex-rnc-chief-on-network-0d88e70c"
  },
  {
    "text": "The ghost of Russia's past wars comes back to haunt Moscow  —  Gunmen in an entertainment venue.  Bodies lying on the cold concrete.  Horror that such murder could strike the safety of the Moscow bubble.  —  These were all present in the horrific aftermath of Friday night's savage attack … ",
    "url": "https://www.cnn.com/2024/03/23/europe/moscow-concert-hall-attack-analysis-intl-cmd/"
  },
  {
    "text": "Oath Keepers' son emerges from traumatic childhood to tell his own story in a long shot election bid  —  KALISPELL, Mont. (AP) — The eldest son of one of America's most infamous seditionists is building a new life since breaking free from his father's control — juggling work, college classes and volunteer firefighting.",
    "url": "https://apnews.com/article/oath-keepers-stewart-rhodes-dakota-adams-montana-e0b46f25dfe319afe29617fd7325eb10"
  },
  {
    "text": "Kamala Harris claps to Puerto Rico protest song, stops once aide translates what they're actually singing  —  A San Juan band called out Vice President Kamala Harris on Palestine, Haiti  —  Vice President Kamala Harris was captured on camera clapping to a Puerto Rican protest song during … ",
    "url": "https://www.foxnews.com/politics/kamala-harris-claps-puerto-rico-protest-song-stops-once-aide-translates-actually-singing"
  },
  {
    "text": "Harris says US has not ruled out ‘consequences’ if Israel invades Rafah  —  “There's nowhere for those folks to go,” the vice president tells ABC.  —  In a wide-ranging new interview with ABC News, Vice President Kamala Harris suggested there could be “consequences” for Israel if it moves ahead … ",
    "url": "https://abcnews.go.com/Politics/harris-us-ruled-consequences-israel-invades-rafah/story?id=108431225"
  },
  {
    "text": "Why Mike Johnson Can't Run the House Without Democrats' Help  —  A bipartisan coalition has been needed to pass key bills, while GOP's thin majority puts Republican agenda at risk  —  WASHINGTON—When Republicans won control of the House in November 2022, the big question was whether … ",
    "url": "https://www.wsj.com/politics/why-mike-johnson-cant-run-the-house-without-democrats-help-a9f5dd23"
  },
  {
    "text": "Moscow concert attack: ‘No Ukrainian involvement’ in deadly attack, U.S. says  —  The Russian president accused Ukraine of preparing a “window” for the suspects to escape.  Kyiv has staunchly denied any role in the attack. … Coverage on this live blog has ended.",
    "url": "https://www.nbcnews.com/news/world/live-blog/moscow-concert-attack-live-updates-rcna144768"
  },
  {
    "text": "How a Pandemic Malaise Is Shaping American Politics … Confidence in the presidency, public schools, the criminal justice system, the news media and Congress has yet to recover from its slump in surveys in the aftermath of the coronavirus pandemic.Jonah Markowitz for The New York Times",
    "url": "https://www.nytimes.com/2024/03/24/us/politics/pandemic-politics-malaise.html"
  },
  {
    "text": "Warnock on Georgia support for Biden: ‘The more Donald Trump talks, the better our fortunes will be’  —  Sen. Raphael Warnock (D-Ga.) said Sunday that support for President Biden in Georgia will be boosted the more former President Trump talks.  —  CBS host Margaret Brennan asked Warnock on … ",
    "url": "https://thehill.com/homenews/senate/4552514-warnock-on-georgia-support-for-biden-the-more-donald-trump-talks-the-better-our-fortunes-will-be/"
  },
  {
    "text": "In an exclusive interview with CNN, Fulton County District Attorney Fani Willis says the work on the case against former President Donald Trump has not been delayed in the wake of a hearing into her relationship with former lead prosecutor Nathan Wade.",
    "url": "https://www.cnn.com/videos/politics/2024/03/23/fulton-county-da-fani-willis-exclusive-intv-nr-vpx.cnn"
  },
  {
    "text": "Stormy Daniels' Description of Sex With Trump Is All Too Familiar for Sex Workers  —  “I didn't want it, but I allowed it to happen,” the adult film star says in a new documentary that sheds lights on their fateful encounter. … Many things have been said about Stormy Daniels.",
    "url": "https://www.thedailybeast.com/stormy-daniels-description-of-sex-with-trump-is-all-too-familiar-for-sex-workers"
  }
]