[
  {
    "text": "George Stephanopoulos and ABC apologize to Trump, are forced to pay $15 million to settle defamation suit  —  FIRST ON FOX- ABC News and its top anchor George Stephanopoulos have reached a settlement with Donald Trump in his defamation suit, which will result in the news network paying the president-elect $15 million.",
    "url": "https://www.foxnews.com/media/george-stephanopoulos-abc-apologize-trump-forced-pay-15-million-settle-defamation-suit"
  },
  {
    "text": "ABC agrees to give $15 million to Donald Trump's presidential library to settle defamation lawsuit  —  ABC News has agreed to pay $15 million toward Donald Trump's presidential library to settle a lawsuit over anchor George Stephanopoulos' inaccurate on-air assertion that the president-elect … ",
    "url": "https://apnews.com/article/abc-trump-lawsuit-defamation-stephanopoulos-04aea8663310af39ae2a85f4c1a56d68"
  },
  {
    "text": "ABC to Pay $15 Million to Settle a Defamation Suit Brought by Trump  —  The outcome of the lawsuit marks an unusual victory for President-elect Donald J. Trump in his ongoing legal campaign against national news organizations.  —  ABC News agreed on Saturday to give $15 million … ",
    "url": "https://www.nytimes.com/2024/12/14/us/politics/trump-abc-settlement.html"
  },
  {
    "text": "Devin Nunes, Pugnacious Trump Loyalist, to Lead Espionage Advisory Board  —  As chair of the House Intelligence Committee, he attacked the Russia inquiry and Donald J. Trump's first impeachment.  Now, Mr. Nunes runs Mr. Trump's social media company.  —  President-elect Donald J. Trump announced … ",
    "url": "https://www.nytimes.com/2024/12/14/us/devin-nunes-intelligence-advisory-board.html"
  },
  {
    "text": "Trump taps Truth Social CEO Nunes to lead intelligence board  —  U.S. President-elect Donald Trump on Saturday named ally Devin Nunes, a former U.S. lawmaker who now runs Trump's Truth Social social media platform, to serve as chairman of President's Intelligence Advisory Board.",
    "url": "https://www.reuters.com/world/us/trump-names-truth-social-ceo-nunes-lead-intelligence-advisory-board-2024-12-14/"
  },
  {
    "text": "Trump picks Nunes for intelligence advisory board, Grenell as special envoy  —  Nunes was chair of the House Intelligence Committee when he was in Congress and is a longtime ally of the president-elect.  —  President-elect Donald Trump announced on Saturday that he intends to appoint Devin Nunes … ",
    "url": "https://www.washingtonpost.com/politics/2024/12/14/devin-nunes-donald-trump/"
  },
  {
    "text": "Trump eyes privatizing U.S. Postal Service, citing financial losses  —  Trump feuded with the mail agency in his first term.  Privatizing it could shake up consumer shipping and business supply chains.",
    "url": "https://www.washingtonpost.com/business/2024/12/14/trump-usps-privatize-plan/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM0MTUyNDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM1NTM0Nzk5LCJpYXQiOjE3MzQxNTI0MDAsImp0aSI6IjgyYzBlYTQ3LTNjNzktNDQ5Ny1iYmI5LTVkZTNlODY2ODZmMiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9idXNpbmVzcy8yMDI0LzEyLzE0L3RydW1wLXVzcHMtcHJpdmF0aXplLXBsYW4vIn0.HRrFzjx5DnYHUZ9Vc9EKTfFi28fvV7NfdhoIU794ZUE&itid=gfta"
  },
  {
    "text": "Rand Paul offers support for Trump immigration agenda, Noem as DHS chief  —  Sen. Rand Paul (R-Ky.) said he would prioritize South Dakota Gov. Kristi Noem's (R) confirmation as Secretary of the Department of Homeland Security once President-elect Trump takes office in January.",
    "url": "https://thehill.com/homenews/administration/5040874-rand-paul-trump-noem/"
  },
  {
    "text": "Florida workers died in the heat.  Their deaths were kept from authorities  —  A Times investigation found twice as many workers have died across the state from heat than officials know.  —  It felt like 100 degrees on the job site by late afternoon.  —  “Truly unbearable,” … ",
    "url": "https://www.tampabay.com/investigations/2024/12/14/florida-workers-died-heat-their-deaths-were-kept-authorities/"
  },
  {
    "text": "Will anger at health insurers spur action?  Democrats pessimistic  —  Democrats are pessimistic that Congress will enact new rules around the health insurance industry, even as they try to appear responsive to growing calls for reform following the killing of UnitedHealthcare CEO Brian Thompson.",
    "url": "https://thehill.com/policy/healthcare/5040261-congress-health-insurance-reform/"
  },
  {
    "text": "Republicans make inroads in state legislative elections, teeing up high-stakes 2025 races  —  Republicans are expanding their footprint in statehouses across the country, reversing Democrats' earlier trend of high-profile wins just a year ago.  —  In the Midwest, the GOP successfully flipped … ",
    "url": "https://thehill.com/homenews/campaign/5040340-republicans-state-elections-2025/"
  },
  {
    "text": "South Korea's President Is Impeached After Martial Law Crisis  —  Some members of President Yoon Suk Yeol's own party helped remove him from office.  But the political uncertainty is far from over.  —  Eleven days ago, President Yoon Suk Yeol of South Korea made a bold power grab … ",
    "url": "https://www.nytimes.com/2024/12/14/world/asia/south-korea-president-impeached-martial-law.html"
  },
  {
    "text": "Statement by Governor Kathy Hochul on Additional Drone Activity  —  “Last night, the runways at Stewart Airfield were shut down for approximately one hour due to drone activity in the airspace.  This has gone too far.  —  “In mid-November, I directed the New York State Intelligence Center … ",
    "url": "https://www.governor.ny.gov/news/statement-governor-kathy-hochul-additional-drone-activity"
  },
  {
    "text": "Syria Shudders as Assad's Prison Atrocities Come Into the Light  —  At the country's most notorious prison, Syrians confront their worst fears: that they will never know what happened to the loved ones who disappeared.  —  At the country's most notorious prison, Syrians confront their worst fears … ",
    "url": "https://www.nytimes.com/2024/12/14/world/middleeast/syria-sednaya-prison-assad-atrocities.html"
  }
]