[
  {
    "text": "Exclusive: Biden plans feisty economic reset … - Biden needs a cure for what some advisers call “Trump amnesia” — the notion that the chaos and unpopularity of Trump's presidency has receded from some voters' memories nearly four years on. … - Voters largely understand the contrasts between Trump … ",
    "url": "https://www.axios.com/2024/03/07/state-of-the-union-biden-us-economy"
  },
  {
    "text": "Democrats pin 2024 hopes and fears on Biden's State of the Union … - “We are all nervous,” said one House Democrat, citing concerns about the 81-year-old Biden's “ability to speak without blowing things.”  — Another House Democrat said: “Listen, Trump has made rhetorical slips … ",
    "url": "https://www.axios.com/2024/03/07/biden-state-of-the-union-democrats-2024-election"
  },
  {
    "text": "Pro-Haley super PAC relaunches as ‘Haley Voters for Biden’  —  The News  —  A super PAC that urged non-Republicans to cast primary votes for Nikki Haley is pivoting to November, urging Haley's voters to support President Joe Biden.  Starting today, Primary Pivot will become Haley Voters for Biden … ",
    "url": "https://www.semafor.com/article/03/06/2024/pro-haley-super-pac-relaunches-as-haley-voters-for-biden"
  },
  {
    "text": "Mark Robinson's Bizarre Ramble: 'I Absolutely Want To Go Back To The America Where Women Couldn't Vote'  —  In a newly unearthed video, North Carolina's GOP nominee for governor says America was better then because Republicans “fought for real social change.”  —  LOADING",
    "url": "https://www.huffpost.com/entry/north-carolina-gop-mark-robinson-women-vote_n_65e7d899e4b0f9d26cacc002"
  },
  {
    "text": "The Much Vaunted Guardrails Are Failing  —  Unless America's leading institutions start acting accordingly, how can we expect enough people to believe the danger to democracy and fundamental rights is really all that severe?  —  Most of you who are reading this probably remember where you were on January 6 … ",
    "url": "https://thomaszimmer.substack.com/p/the-much-vaunted-guardrails-are-failing"
  },
  {
    "text": "How millions in corporate cash could help a radical conspiracy theorist become governor  —  Judd Legum, Tesnim Zekeria, and Rebecca Crosby  —  On Tuesday, Mark Robinson (R) won the Republican nomination for Governor of North Carolina.  Robinson, currently North Carolina's lieutenant governor … ",
    "url": "https://popular.info/p/how-millions-in-corporate-cash-could"
  },
  {
    "text": "Ex-Congressional candidate Daniel Rodimer wanted for murder in Las Vegas  —  LAS VEGAS (KSNV) — Former professional wrestler and congressional candidate Daniel Rodimer is wanted for murder in connection with a homicide on the Las Vegas Strip last year, authorities have confirmed.",
    "url": "https://news3lv.com/news/local/ex-congressional-candidate-daniel-rodimer-wanted-for-murder-in-las-vegas-lvjc-lvmpd-homicide-investigation-cops-courts"
  },
  {
    "text": "Trump RNC ‘purge’ has some committee members nervous  —  Former President Donald Trump's impending takeover of the Republican National Committee could give him access to a big new pile of cash at a time when he is beset by legal bills, making some committee members nervous.",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/03/07/trump-rnc-purge/72856982007/"
  },
  {
    "text": "Steve Bannon's Refusal to Pay His Bills Is Costing Him Big  —  Bannon has refused to pay his legal bills for two years.  Now he and his current lawyer are facing fines over Bannon's refusal to make good on his debts. … For two years, Steve Bannon has refused to pay the half-million dollars he owes his former lawyer.",
    "url": "https://www.thedailybeast.com/steve-bannons-refusal-to-pay-his-bills-is-costing-him-big"
  },
  {
    "text": "FDA says to throw away these 6 cinnamon products because they contain high levels of lead  —  Consumers should not purchase half a dozen ground cinnamon products sold by retailers including Family Dollar and Dollar Tree because they contain elevated levels of lead, the U.S. Food and Drug Administration … ",
    "url": "https://www.cbsnews.com/news/lead-cinnamon-fda-applesauce-children/"
  },
  {
    "text": "Profound Damage Found in Maine Gunman's Brain, Possibly From Blasts  —  A laboratory found a pattern of cell damage that has been seen in veterans exposed to weapons blasts, and said it probably played a role in symptoms the gunman displayed before the shooting.",
    "url": "https://www.nytimes.com/2024/03/06/us/maine-shooting-brain-injury.html"
  },
  {
    "text": "Missouri's total war on Planned Parenthood  —  Republicans aren't stopping at abortion bans.  —  ∙ Paid  —  Given the sinkhole of conspiracies that is Elon Musk's X, it shouldn't be surprising that Andrew Bailey, Missouri's hard-right attorney general, used the platform to announce … ",
    "url": "https://www.publicnotice.co/p/missouri-planned-parenthood-lawsuit"
  },
  {
    "text": "Byron Donalds wouldn't commit to certifying election results if he was VP … - Donalds also did not clarify if he would have certified the 2020 election results, during an interview with Axios' Sophia Cai.  — Trump, the GOP presidential frontrunner, has continued to push the false theory … ",
    "url": "https://www.axios.com/2024/03/07/byron-donalds-certifying-election-results-trump-vp"
  },
  {
    "text": "House passes $460 billion package of spending bills.  Senate expected to act before shutdown deadline  —  The House passed a $460 billion package of spending bills Wednesday that would keep money flowing to key federal agencies through the remainder of the budget year.",
    "url": "https://apnews.com/article/government-shutdown-funding-deadline-congress-2533c1a6b6eb25cc63e78f089e27d3a0"
  },
  {
    "text": "Alabama Passes Law to Protect I.V.F. Treatments  —  Some doctors said the law would allow them to resume treatments quickly, though legal experts cautioned that state constitutional challenges may still arise.  —  Alabama lawmakers on Wednesday passed legislation to shield … ",
    "url": "https://www.nytimes.com/2024/03/06/us/politics/alabama-ivf-law.html"
  },
  {
    "text": "PragerU is a conservative video giant.  Here's why it's trying to get into schools  —  Despite the suggestive sound of its name, PragerU is not a university.  It's a content creator.  The conservative media nonprofit makes short, well-produced videos crafted to appeal to college students and young people.",
    "url": "https://npr.org/2024/03/07/1234491074/prageru-schools-videos-growth"
  },
  {
    "text": "Third-party group No Labels is expected to move forward with a 2024 campaign, AP sources say  —  The third-party presidential movement No Labels is planning to move toward fielding a presidential candidate in the November election, even as high-profile contenders for the ticket have decided not to run … ",
    "url": "https://apnews.com/article/no-labels-candidates-selection-third-party-ea3f28a5e35f0789e873ac42369b0a77"
  }
]