[
  {
    "text": "Supreme Court Clears Way for Mass Firings at Federal Agencies  —  The Trump administration had asked the justices to block a lower court's ruling that paused the largest phase of the president's efforts to downsize the government.  —  The Trump administration can move forward with plans … ",
    "url": "https://www.nytimes.com/2025/07/08/us/politics/supreme-court-federal-workers-layoffs.html?unlocked_article_code=1.U08.0Mrk.meMp6Z3dy3B0&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "US Supreme Court lifts order that blocked Trump's mass federal layoffs  —  The U.S. Supreme Court cleared the way on Tuesday for President Donald Trump's administration to resume carrying out mass job cuts and the restructuring of agencies, elements of his campaign to downsize and reshape the federal government.",
    "url": "https://www.reuters.com/legal/litigation/us-supreme-court-lifts-order-that-blocked-trumps-mass-federal-layoffs-2025-07-08/"
  },
  {
    "text": "Elon Musk's Grok Chatbot Goes Full Nazi, Calls Itself ‘MechaHitler’  —  The billionaire has long complained about the xAI model undermining right-wing narratives and recently said it would be “updated” … It also proclaimed that Adolf Hitler would “spot the pattern” of Jews' “anti-white hate” and “handle it decisively.”",
    "url": "https://www.rollingstone.com/culture/culture-news/elon-musk-grok-chatbot-antisemitic-posts-1235381165/"
  },
  {
    "text": "Elon Musk's Grok Is Calling for a New Holocaust  —  The chatbot is also praising Hitler and attacking users with Jewish-sounding names.  —  The year is 2025, and an AI model belonging to the richest man in the world has turned into a neo-Nazi.  Earlier today, Grok, the large language model that's woven … ",
    "url": "https://www.theatlantic.com/technology/archive/2025/07/grok-anti-semitic-tweets/683463/?gift=bQgJMMVzeo8RHHcE1_KM0aqqdSsaHDgZB8kcsy7aDBI&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Musk chatbot Grok removes posts after complaints of antisemitism  —  Grok, the chatbot developed by the Elon Musk-founded company xAI, removed what it called “inappropriate” social media posts on Tuesday after complaints from X users and the Anti-Defamation League that Grok produced content … ",
    "url": "https://www.reuters.com/technology/musk-chatbot-grok-removes-posts-after-complaints-antisemitism-2025-07-09/"
  },
  {
    "text": "Elon Musk's Grok Chatbot Shares Antisemitic Posts on X  —  The artificial intelligence chatbot, which has a dedicated account on X, praised Hitler after fielding a query about a user's comments on the Texas flood.  —  Grok, a chatbot created by Elon Musk's artificial intelligence company … ",
    "url": "https://www.nytimes.com/2025/07/08/technology/grok-antisemitism-ai-x.html?unlocked_article_code=1.VE8.3-P4.-kU0gkq5vieP&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "FBI launches criminal investigations of John Brennan, James Comey: DOJ sources  —  CIA Director John Ratcliffe referred Brennan for criminal investigation to the FBI, sources told Fox News Digital  —  EXCLUSIVE: Former CIA Director John Brennan and former FBI Director James Comey … ",
    "url": "https://www.foxnews.com/politics/john-brennan-james-comey-under-criminal-investigation-doj-sources"
  },
  {
    "text": "Hegseth did not inform the White House before he authorized pause on weapon shipments to Ukraine, sources say  —  Secretary of Defense Pete Hegseth did not inform the White House before he authorized a pause on weapons shipments to Ukraine last week, according to five sources familiar with the matter … ",
    "url": "https://cnn.com/2025/07/08/politics/hegseth-did-not-inform-white-house-ukraine-weapons-pause"
  },
  {
    "text": "JD Vance: Some Americans Are More American Than Others  —  VP tries to redefine citizenship in speech to friendly think tank.  —  The day after President Trump signed a bill that throws unprecedented amounts of money at ICE, extends tax cuts for the wealthy, and slashes health-care … ",
    "url": "https://talkingpointsmemo.com/news/jd-vance-some-americans-are-more-american-than-others"
  },
  {
    "text": "'Essential isn't a strong enough word': Loss of foreign workers begins to bite US economy … “Essential isn't a strong enough word,” said Matt Teagarden, head of the Kansas Livestock Association.  —  “It is some version of an immigrant, maybe not first generation, but second or third generation, that are just critical to that work.”",
    "url": "https://www.politico.com/news/2025/07/08/essential-isnt-a-strong-enough-word-loss-of-foreign-workers-begins-to-bite-us-economy-00443021"
  },
  {
    "text": "Conspiracy Theories About the Texas Floods Lead to Death Threats  —  Disinformation around a “weather weapon” and cloud seeding is being widely promoted by everyone from anti-government extremists to GOP influencers—and leading to real-world consequences.  —  On Sunday afternoon … ",
    "url": "https://www.wired.com/story/texas-floods-conspiracy-theories-geoengineering-weather-weapon/"
  },
  {
    "text": "Trump said he threatened to bomb Moscow if Putin attacked Ukraine, 2024 fundraiser tapes show  —  Donald Trump told a private gathering of donors last year that he once sought to deter Russian President Vladimir Putin from attacking Ukraine by threatening to “bomb the sh*t out of Moscow” … ",
    "url": "https://cnn.com/2025/07/08/politics/trump-tape-putin-bomb-fundraiser"
  },
  {
    "text": "Ellison's Late-Night Limbo … Jon Stewart opened Monday's episode of “The Daily Show” not mincing words, calling Paramount's settlement with Donald Trump “shameful.” … “Did they?  Son of a bitch!”  Stewart exclaimed, playing along with the bit—yet nodding to a deeper fear … ",
    "url": "https://www.status.news/p/skydance-colbert-stewart-ellison"
  },
  {
    "text": "Ted Cruz Toured the Parthenon Before Heading Home to Texas Disaster: Report  —  Photos appear to show the senator visiting ancient Greek ruins one day after Camp Mystic announced that more than 20 campers had gone missing in the flood.  —  Texas senator Ted Cruz, whose superpower is always doing … ",
    "url": "https://www.vanityfair.com/news/story/ted-cruz-toured-the-parthenon-before-heading-home-to-texas-disaster-report"
  },
  {
    "text": "Dueling U.S. Efforts Botched a Deal to Swap Venezuelans Held in El Salvador for Americans  —  Secretary of State Marco Rubio and the U.S. envoy to Venezuela were both working on different deals and ended up at cross purposes.  —  The Trump administration's top diplomat, Secretary of State Marco Rubio … ",
    "url": "https://www.nytimes.com/2025/07/08/world/americas/trump-venezuelan-migrants-us-prisoner-swap.html?unlocked_article_code=1.U08.sveO.lyU8-_6hT3dW&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "With Broken Promise on Epstein, Pam Bondi Draws the Ire of Trump's Supporters  —  MAGA influencers are calling for attorney general's resignation after she failed to produce ‘truckload’ of documents about the sex offender  —  Pam Bondi's tendency to exaggerate is catching up to her.",
    "url": "https://www.wsj.com/politics/policy/pam-bondi-epstein-files-maga-40383ad4"
  },
  {
    "text": "Planned Parenthood Gets Cut Off  —  The defunding of the abortion giant is the most beautiful thing in the GOP megabill.  —  Democrats know how to put lipstick on a pig.  In 2022 they tarted up the Inflation Reduction Act, calling it a necessary makeover for the pandemic-scarred economy.",
    "url": "https://www.wsj.com/opinion/planned-parenthood-gets-cut-off-republican-reconciliation-bill-trump-thune-johnson-f4ed3cdf"
  },
  {
    "text": "Ten Individuals Charged with Attempted Murder of Federal Officers and Firearms Offenses in Alvarado Police Officer Shooting  —  For Immediate Release  —  U.S. Attorney's Office, Northern District of Texas  —  Ten individuals have been charged for their roles in the shooting … ",
    "url": "https://www.justice.gov/usao-ndtx/pr/ten-individuals-charged-attempted-murder-federal-officers-and-firearms-offenses"
  },
  {
    "text": "Major medical groups sue Health Secretary Robert F. Kennedy Jr. over vaccines  —  Kennedy's track record of undermining vaccine safety and effectiveness prompted the lawsuit.  “We've had enough,” one public health expert said.  —  Several major medical organizations are suing Health Secretary … ",
    "url": "https://www.nbcnews.com/health/health-news/rfk-jr-sued-pediatricians-medical-groups-covid-vaccines-rcna217218"
  },
  {
    "text": "GOP Rep. Weirdly Lies About Helping His State Survive The Medicaid Cuts He Voted For  —  Rep. Derrick Van Orden (R-Wis.) insists he helped get $1 billion for hospitals in his state hit by Trump's tax bill.  Except his governor and state legislature did that.",
    "url": "https://www.huffpost.com/entry/derrick-van-orden-trump-tax-bill-medicaid-cuts_n_686d4a1fe4b088c62569b44c"
  },
  {
    "text": "Alligator Alcatraz detainees allege inhumane conditions at immigration detention center  —  Cuban reggaeton artist Leamsy La Figura, arrested last week in Miami-Dade on assault charges, was transferred to South Florida's new immigration detention facility known as Alligator Alcatraz in the Everglades … ",
    "url": "https://www.cbsnews.com/miami/news/alligator-alcatraz-detainees-allege-inhumane-conditions-at-immigration-detention-center/"
  },
  {
    "text": "Trump now backs tough Russia sanctions bill, Graham says  —  A bill targeting Russia with substantial new sanctions is gaining momentum in the Senate, with a key GOP senator signaling Tuesday that President Donald Trump is now on board.  “We're moving,” said Sen. Lindsey Graham (R-S.C.) … ",
    "url": "https://www.politico.com/live-updates/2025/07/08/congress/senate-russia-sanctions-lindsey-graham-00443192"
  },
  {
    "text": "Only Criminals Don't Want To Be Gassed By The Government  —  The United States Attorney's Office for the Central District of California, my former employer, has filed a criminal complaint against Alejandro Orellana, a local immigration activist in Los Angeles.  They've charged him for distributing face masks to protestors.",
    "url": "https://www.popehat.com/p/only-criminals-don-t-want-to-be-gassed-by-the-government"
  },
  {
    "text": "Trump threatens ‘no extensions’ on new Aug. 1 tariff deadline, warns of higher import taxes  —  The Yale Budget Lab noted that the letters sent Monday would hike the effective tariff rate on U.S. consumers to the highest since 1934.  —  President Donald Trump said Tuesday there would be … ",
    "url": "https://www.nbcnews.com/business/business-news/trump-threatens-no-extensions-aug-1-tariff-deadline-what-countries-rcna217536"
  },
  {
    "text": "Fact check: Debunking 11 of Trump's false claims at Cabinet meeting  —  President Donald Trump again turned a Cabinet meeting into a wide-ranging conversation with reporters - and again uttered a whole bunch of false claims in the process.  —  Trump's Tuesday remarks at the White House … ",
    "url": "https://cnn.com/2025/07/08/politics/fact-check-trump-cabinet-meeting"
  },
  {
    "text": "French police raid far-right National Rally's headquarters  —  PARIS — French authorities raided the headquarters of the National Rally Wednesday morning as part of a major investigation into whether the party broke campaign finance laws during recent elections.",
    "url": "https://www.politico.eu/article/national-rally-france-marine-le-pen-jordan-bardella-police-raids-headquarters/"
  },
  {
    "text": "European heatwave caused 2,300 deaths, scientists estimate  —  Around 2,300 people died of heat-related causes across 12 European cities during the severe heatwave that ended last week, according to a rapid scientific analysis published on Wednesday.  —  The study targeted the 10 days … ",
    "url": "https://www.reuters.com/sustainability/cop/european-heatwave-caused-2300-deaths-scientists-estimate-2025-07-09/"
  },
  {
    "text": "Los Angeles Moves to Join Suit Against Immigration Raids  —  The legal move came the day after federal agents and National Guard troops converged on a Los Angeles park in an extraordinary show of force.  —  City and county officials in Los Angeles sought to join a federal lawsuit … ",
    "url": "https://www.nytimes.com/2025/07/08/us/politics/la-immigration-raids-trump-lawsuit.html"
  },
  {
    "text": "US court strikes down ‘click-to-cancel’ rule designed to make unsubscribing easier  —  Rule would have kept businesses from forcing customers through lengthy chats or other barriers to cancellation  —  A federal rule designed to make canceling subscriptions as easy as signing … ",
    "url": "https://www.theguardian.com/us-news/2025/jul/08/court-click-to-cancel-ruling"
  },
  {
    "text": "IRS says churches should be allowed to make political endorsements  —  Since 1954, the IRS has banned nonprofits — including congregations — from participating in political campaigns.  The agency now says political endorsements by churches should be allowed.",
    "url": "https://www.washingtonpost.com/nation/2025/07/08/irs-church-endorsements/"
  },
  {
    "text": "Big Surprise: The Trump Regime Lied to Judges About CECOT  —  What we've all long suspected has been confirmed by the President of El Salvador in a statement to the United Nations  —  If you've been following my writing or listening to our podcasts, you'll note that we've been covering … ",
    "url": "https://www.muellershewrote.com/p/big-surprise-the-trump-regime-lied"
  },
  {
    "text": "ICE Said They Were Being Flown to Louisiana.  Their Flight Landed in Africa.  —  When eight men in the custody of Immigration and Customs Enforcement boarded a plane in May, officials told them that they were being sent on a short trip from Texas to another ICE facility in Louisiana.",
    "url": "https://theintercept.com/2025/07/08/ice-deportation-louisiana-south-sudan/"
  },
  {
    "text": "How Insularity Defined the Last Stages of Biden's Career … At the most perilous moment of his presidency, Joseph R. Biden Jr. was all but impossible for anyone outside his tight inner circle to reach.Eric Lee/The New York Times  —  Former President Joseph R. Biden Jr.'s aides did not want him to speak with me.",
    "url": "https://www.nytimes.com/2025/07/08/us/politics/biden-aides-election-age.html?unlocked_article_code=1.U08.sP7n.Rl0Tv7kjzM5S&smid=url-share"
  },
  {
    "text": "Exclusive: GOP urged to “get to work” selling Trump's controversial megabill  —  Republicans are pushing senators to more aggressively sell the “big, beautiful bill” amid concerns that the party's lawmakers aren't doing enough to promote its most popular provisions. … Polls suggest it currently isn't.",
    "url": "https://www.axios.com/2025/07/08/republicans-trump-big-beautiful-bill-polls-senate"
  }
]