[
  {
    "text": "‘A dying empire led by bad people’: Poll finds young voters despairing over US politics  —  The Scoop  —  Young voters overwhelmingly believe that almost all politicians are corrupt and that the country will end up worse off than when they were born, according to new polling … ",
    "url": "https://www.semafor.com/article/05/28/2024/a-dying-empire-led-by-bad-people-poll-finds-young-voters-despairing-over-us-politics"
  },
  {
    "text": "Roanoke College Poll: Biden and Trump tied in Virginia  —  President Joe Biden and former President Donald Trump are tied (42%-42%) in a head-to-head matchup in Virginia, while Biden holds a two-point lead (40%-38%) when other candidates are included, according to the Roanoke College Poll.",
    "url": "https://www.roanoke.edu/news/rc_poll_politics_may_2024"
  },
  {
    "text": "Lauren Boebert lags challenger Ike McCorkle by double digits, Democrat's internal poll shows  —  One-third of voters in Colorado's reddest congressional district say they're undecided  —  An internal poll conducted last week for one of the three Democrats hoping to deny U.S … ",
    "url": "https://gazette.com/politics/elections/internal-poll-shows-mccorkle-leads-boebert/article_83de5307-b1a0-5c77-ac39-b4b576f8a9dc.html"
  },
  {
    "text": "Live Updates: Jury Begins Deciding Trump's Fate in Hush-Money Case  —  Twelve New Yorkers have begun deliberations on the 34 felony counts against Donald Trump in the first criminal trial of an American president.  He is accused of falsifying business records in connection with a payment to a porn star.",
    "url": "https://www.nytimes.com/live/2024/05/29/nyregion/trump-trial-hush-money"
  },
  {
    "text": "Justice Alito tells Congress he will not recuse from Jan. 6-related cases  —  Some Democrats asked whether Justice Samuel A. Alito Jr. could be impartial after an upside-down flag flew at his home following the 2021 U.S. Capitol attack.  —  Justice Samuel A. Alito, Jr. announced Wednesday … ",
    "url": "https://www.washingtonpost.com/politics/2024/05/29/supreme-court-alito-recuse-flag-jan-6/"
  },
  {
    "text": "The Alitos, the Neighborhood Clash and the Upside-Down Flag  —  Inside the escalating conflict on a bucolic suburban street that Justice Alito said prompted a “Stop the Steal” symbol at his home.  —  The police in Fairfax County, Va., received an unusual phone call on Feb. 15, 2021.",
    "url": "https://www.nytimes.com/2024/05/28/us/justice-alito-neighbors-stop-steal-flag.html"
  },
  {
    "text": "Trump Boasted About Sex With Stormy in Tahoe, Athlete Says  —  SUB PAR  —  The athlete also told The Daily Beast that in the run-up to the 2016 election he received anonymous calls from strangers asking what he remembered of the weekend. … Donald Trump boasted about having sex … ",
    "url": "https://www.thedailybeast.com/trump-boasted-about-sex-with-stormy-in-tahoe-athlete-says"
  },
  {
    "text": "Inside Donald Trump and Elon Musk's Growing Alliance  —  Donald Trump is weighing an advisory role for the Tesla leader in the event the former president reclaims the White House",
    "url": "https://www.wsj.com/politics/donald-trump-elon-musk-alliance-d1fe43e3"
  },
  {
    "text": "Emerging Portrait of Judge in Trump Documents Case: Prepared, Prickly and Slow  —  Judge Aileen Cannon's handling of court hearings offers insights into how the case accusing Donald Trump of illegally retaining classified material has become bogged down in unresolved issues.",
    "url": "https://www.nytimes.com/2024/05/29/us/politics/trump-documents-judge-aileen-cannon.html"
  },
  {
    "text": "Mother of Jan. 6 officer Michael Fanone swatted after he called Trump ‘authoritarian’  —  Fanone was abducted by the mob on Jan. 6 and nearly killed when a MAGA-hatted rioter who believed Donald Trump's lies about the 2020 election drove a stun gun into his neck.",
    "url": "https://www.nbcnews.com/politics/justice-department/mother-jan-6-officer-michael-fanone-swatted-called-trump-authoritarian-rcna154467"
  },
  {
    "text": "Jenna Ellis, ex-Trump campaign legal adviser, has Colorado law license suspended for 3 years  —  Washington — Jenna Ellis, who served as a legal adviser to former President Donald Trump during the 2020 election, is barred from practicing law in the state of Colorado for three years … ",
    "url": "https://www.cbsnews.com/news/jenna-ellis-ex-trump-campaign-legal-adviser-colorado-law-license-suspended/"
  },
  {
    "text": "Texas GOP Platform Endorses Death Penalty for Abortion Patients  —  We need to talk about Plank 35 in the Texas GOP platform.  Because while there's been lots of coverage about how extremist the state's Republican convention was, people seem to have missed the fact that delegates adopted … ",
    "url": "https://jessica.substack.com/p/texas-gop-platform-endorses-death"
  },
  {
    "text": "Don't Commit National Suicide: Ken Burns' Warning  —  Ken Burns Suspends ‘Longstanding Attempt At Neutrality’ to Utterly Torch Trump  —  “Filmmaker Ken Burns ditched his trademark political neutrality during an undergraduate commencement address at Massachusetts' Brandies University to warn … ",
    "url": "https://thedemlabs.org/2024/05/29/ken-burns-brandies-university-commencement-address-video-highlights/"
  },
  {
    "text": "How I went from left to center-left  —  My crisis of confidence in progressive epistemology  —  I've written about the history of left versus right since the French Revolution, about what the left gets right, and about what the right gets right.  Now, I want to talk about my own journey … ",
    "url": "https://www.slowboring.com/p/how-i-went-from-left-to-center-left"
  },
  {
    "text": "Amy Coney Barrett's Husband Is Representing Fox in a Lawsuit  —  Supreme Court Justice Amy Coney Barrett's husband, Jesse Barrett, is defending Fox Corporation in a defamation case … The lawsuit relates to reports by one of Fox's local stations.  —  Jesse Barrett is a trial lawyer and managing partner at SouthBank Legal.",
    "url": "https://www.rollingstone.com/politics/politics-features/amy-coney-barrett-husband-jesse-fox-1235028838/"
  },
  {
    "text": "Libertarians Should Vote for Trump  —  He isn't one of us, but he promised to pardon Ross Ulbricht—and he's a lot better than Joe Biden.  —  Donald Trump spoke Saturday at the Libertarian National Convention.  Hats off to party chairman Angela McArdle for inviting him along with Robert F. Kennedy Jr. … ",
    "url": "https://www.wsj.com/articles/libertarians-should-vote-for-trump-4ef84994"
  },
  {
    "text": "Life on Ukraine's front line: ‘Worse than hell’ as Russia advances  —  Ukraine's soldiers talk of exhaustion, faith, personal loss and a perilous shortage of munitions as Russian forces take new ground.  Reuters traveled along the front line, where Ukrainian troops say Vladimir Putin must be beaten back.",
    "url": "https://www.reuters.com/investigates/special-report/ukraine-war-frontline/"
  },
  {
    "text": "Two New Giant Pandas Coming to Smithsonian's National Zoo and Conservation Biology Institute From China by End of the Year  —  New 10-Year Research and Breeding Agreement Signed … Download b-roll from Dropbox. … Video  —  Today, May 29, the Smithsonian's National Zoo … ",
    "url": "https://nationalzoo.si.edu/news/two-new-giant-pandas-coming-smithsonians-national-zoo-and-conservation-biology-institute-china"
  },
  {
    "text": "Texas House runoffs bring wave of GOP incumbent defeats, give Abbott votes for school vouchers  —  Six of eight GOP incumbents lost their races.  Gov. Greg Abbott declared he “now has enough votes to pass school choice.”  —  A wave of Republican incumbents were swept out of the Texas House … ",
    "url": "https://www.texastribune.org/2024/05/28/texas-primary-runoff-school-vouchers-abbott/"
  },
  {
    "text": "As Civil War Consumes Black Lives Matter, $8.7 Million Goes Missing  —  The left-wing dark money giant Tides Foundation raised more than $33 million on behalf of the national Black Lives Matter group during the George Floyd riots in 2020.  Now, Black Lives Matter is suing Tides over its refusal to hand the funds back.",
    "url": "https://freebeacon.com/democrats/as-civil-war-consumes-black-lives-matter-8-7-million-goes-missing/"
  },
  {
    "text": "Steinglass pokes hole in defense's argument around National Enquirer  —  Steinglass makes a very good point about the Dino Sajuddin story and corresponding payment.  —  Sajuddin is the former Trump Tower doorman who claims Trump fathered a child out of wedlock, a claim the former president has denied.",
    "url": "https://www.nbcnews.com/politics/donald-trump/live-blog/trump-trial-live-updates-closing-statements-hush-money-case-rcna153996/rcrd42325?canonicalCard=true"
  }
]