[
  {
    "text": "House speaker live updates: Republicans to vote behind closed-doors to pick leader  — Republicans Reps. Steve Scalise, of Louisiana, and Jim Jordan, of Ohio, are the two declared candidates for House speaker to replace Rep. Kevin McCarthy, R-Calif.  — House Republicans met Tuesday night … ",
    "url": "https://www.nbcnews.com/politics/congress/live-blog/house-speaker-live-updates-rcna119455"
  },
  {
    "text": "Playbook: What to watch in the speaker election  —  Presented by With help from Eli Okun and Garrett Ross  —  DRIVING THE DAY  —  NEW JMART — “Biden Won't Directly Address the Age Issue,” by Jonathan Martin: “His own supporters and lawmakers are all but pleading with [President JOE BIDEN] … ",
    "url": "https://www.politico.com/newsletters/playbook/2023/10/11/what-to-watch-in-the-speaker-election-00120891"
  },
  {
    "text": "Embattled Rep. George Santos hit with additional charges, including identity theft  —  Prosecutors said Santos claimed he made non-existent loans to his campaign while making unauthorized charges on donors' credit cards.  —  Federal prosecutors hit Rep. George Santos, R-N.Y. … ",
    "url": "https://www.nbcnews.com/politics/congress/santos-charged-identity-theft-rcna119819"
  },
  {
    "text": "NYU Student Bar Association President Loses Job Offer for Calling Israel Massacre ‘Necessary’ as School Distances Itself  —  ‘Israel bears full responsibility for this tremendous loss of life,’ wrote Ryna Workman of the terror attack that left at least 1,200 people dead",
    "url": "https://themessenger.com/news/nyu-student-bar-association-president-loses-job-offer-for-calling-israel-massacre-necessary-as-school-distances-itself"
  },
  {
    "text": "Trump demands trial delay to wade through classified docs he stole  —  And Judge Cannon might just let him get away with it. … Donald Trump has just one goal in his two federal criminal cases: push them off until after November 2024, so that he can either pardon himself or instruct … ",
    "url": "https://www.publicnotice.co/p/trump-judge-cannon-classified-docs-trial-delay"
  },
  {
    "text": "Charles Koch's audacious new $5 billion political scheme  —  Billionaire Charles Koch, who will turn 88 on November 1, is funneling his wealth into two secretive organizations that can continue his right-wing political advocacy for years.  Koch structured more than $5 billion in donations … ",
    "url": "https://popular.info/p/charles-kochs-5-billion-tax-loophole"
  },
  {
    "text": "Olympic gold medalist Mary Lou Retton battling pneumonia in intensive care  —  Retton's daughter, McKenna Kelley, made an appeal for help, saying the legend does not have medical insurance.  —  Mary Lou Retton battling rare form of pneumonia, family says  —  Olympic gold medalist Mary Lou Retton … ",
    "url": "https://www.nbcnews.com/news/us-news/olympic-gold-medalist-mary-lou-retton-battling-pneumonia-intensive-car-rcna119828"
  },
  {
    "text": "Crackpot fight!  Trump is worried about RFK Jr. running for president — and he should be scared  —  Trump depends on the crank vote that the anti-vaccine conspiracy theorist could siphon off  —  He may not have bolts sticking out of his neck, but Robert F. Kennedy Jr. is morphing into the MAGA version of Frankenstein's monster.",
    "url": "https://www.salon.com/2023/10/11/crackpot-fight-is-worried-about-rfk-jr-running-for-and-he-should-be-scared/"
  },
  {
    "text": "North Carolina Republicans enact election changes over Democratic governor's vetoes  —  RALEIGH, N.C. — North Carolina Republicans enacted vote-count restrictions and weakened the governor's ability to oversee elections and other state regulatory bodies on Tuesday by overriding Democratic Gov. Roy Cooper's vetoes.",
    "url": "https://www.npr.org/2023/10/10/1204941814/north-carolina-republican-election-laws"
  },
  {
    "text": "9 UN staffers killed in airstrikes in Gaza  —  Nine United Nation staff members have been killed by Israeli airstrikes in Gaza since Saturday, the UN's agency for Palestinian refugees confirmed Wednesday.  —  The UN Relief and Works Agency (UNRWA) said nine staffers have been killed … ",
    "url": "https://thehill.com/policy/international/4249540-9-un-staffers-killed-in-airstrikes-in-gaza/"
  },
  {
    "text": "Israel forms emergency gov't for Hamas war, Gantz to join Netanyahu  —  As part of the deal, Gantz and fellow party member Gadi Eisenkot will be sworn in as ministers and will join a war cabinet with Netanyahu and Defense Minister Yoav Gallant.  —  An emergency government was formed … ",
    "url": "https://www.jpost.com/breaking-news/article-767742"
  },
  {
    "text": "Defiant Gabrielle Hanson refuses to denounce hate group as Franklin aldermen deliver stern rebuke  —  Alderman Beverly Burger: ‘Is it your mission to divide our city?  Because you are doing a bang-up job of it right now’  —  FRANKLIN, Tenn. (WTVF) — Members of the Franklin Board of Mayor … ",
    "url": "https://www.newschannel5.com/news/newschannel-5-investigates/defiant-gabrielle-hanson-refuses-to-denounce-hate-group-as-franklin-aldermen-deliver-stern-rebuke"
  },
  {
    "text": "Trump dips into internet conspiracy theories with his latest lines about Obama  —  Donald Trump had been alluding to the idea that his predecessor, Barack Obama, is still in charge before he outright said it in New Hampshire this week.  —  WOLFEBORO, N.H. — Former President Donald Trump … ",
    "url": "https://www.nbcnews.com/politics/2024-election/trump-dips-internet-conspiracies-latest-lines-obama-rcna119571"
  },
  {
    "text": "US nuclear deterrence strategy needs an update — here's how  —  Demand signals are growing for improved U.S. theater nuclear options and missile defenses in the Western Pacific.  In the runup to President Biden's recent summit with the Pacific Islands, Palau's president called … ",
    "url": "https://thehill.com/opinion/national-security/4248602-us-nuclear-deterrence-strategy-needs-an-update-heres-how/"
  },
  {
    "text": "Former OSU wrestlers say Jim Jordan betrayed them and shouldn't be House speaker  —  “Do you really want a guy in that job who chose not to stand up for his guys?” said one former wrestler who attended OSU when Jordan was assistant coach.  —  Four of the former Ohio State University wrestlers … ",
    "url": "https://www.nbcnews.com/politics/politics-news/former-osu-wrestlers-say-jim-jordan-betrayed-shouldnt-house-speaker-rcna119116"
  },
  {
    "text": "Hannity asks RFK Jr. why Democratic Party didn't ‘want’ him  —  Fox News host Sean Hannity confronted presidential candidate Robert F. Kennedy Jr. on Tuesday about his decision to leave the Democratic Party and run for the White House as an independent.  —  “So I hope you don't mind, but I did a little research on you.",
    "url": "https://thehill.com/homenews/media/4249526-sean-hannity-rfk-jr-spar-democratic-party/"
  },
  {
    "text": "Conservatives target Ohio to end their losing streak on abortion votes  —  Abortion opponents have lost every state referendum since Roe was overturned.  In Ohio, they're wooing students, Black communities and even abortion rights advocates to turn their fortunes around.",
    "url": "https://www.politico.com/news/2023/10/11/conservatives-ohio-abortion-referendums-00120837"
  },
  {
    "text": "Craig, Trump lead with Michigan GOP  —  A new PPP poll of Michigan Republicans finds James Craig as the early front runner to be the party's nominee for Senate next year.  Meanwhile Donald Trump holds an overwhelming lead in the Presidential race.  —  Craig leads Mike Rogers by double digits, 30-19.",
    "url": "https://www.publicpolicypolling.com/polls/craig-trump-lead-with-michigan-gop/"
  },
  {
    "text": "The Senate is a problem in the Israel crisis.  Democrats are fed up.  —  The war in the Middle East means top military and diplomatic posts must be filled now, senators say.  —  As war breaks out in the Middle East, key ambassadorships in the region and top military promotions are languishing in the Senate.",
    "url": "https://www.politico.com/news/2023/10/11/hamas-israel-nominees-military-ambassadors-00120871"
  },
  {
    "text": "Republican effort to impeach Wis. Supreme Court justice loses steam  —  MADISON, Wis. — Republican lawmakers in this political battleground state appear to be easing off an effort to impeach a new liberal state Supreme Court justice who in her campaign promoted abortion rights and condemned gerrymandering.",
    "url": "https://www.washingtonpost.com/politics/2023/10/10/wisconsin-supreme-court-impeachment/"
  },
  {
    "text": "Israeli woman, 25, hailed as a hero for killing terrorists, leading team that saved kibbutz from Hamas  —  The Hamas was no match for an intrepid 25-year-old Israeli woman — who saved an entire kibbutz from harm by leading a group of residents to kill more than two dozen advancing terrorists, including five she slaughtered herself.",
    "url": "https://nypost.com/2023/10/10/israeli-woman-25-hailed-as-hero-for-killing-terrorists-leading-security-team-at-kibbutz/"
  },
  {
    "text": "Kari Lake announces run for Arizona Senate  —  Kari Lake announced her bid for Arizona Senate on Tuesday, entering the race for Sen. Kyrsten Sinema's (I-Ariz.) seat as the heavy favorite for the GOP nomination.  —  Lake, a Trump ally who has denied her loss in last year's Arizona governor's race … ",
    "url": "https://thehill.com/homenews/campaign/4245492-kari-lake-announces-run-for-arizona-senate/"
  },
  {
    "text": "Remarks by President Biden on the Terrorist Attacks in Israel  —  THE PRESIDENT:  Good afternoon.  —  You know, there are moments in this life — and I mean this literally — when the pure, unadulterated evil is unleashed on this world.  —  The people of Israel lived through one such moment this weekend.",
    "url": "https://www.whitehouse.gov/briefing-room/speeches-remarks/2023/10/10/remarks-by-president-biden-on-the-terrorist-attacks-in-israel-2/"
  },
  {
    "text": "Youngkin's PAC sets $1.4 million ad push on abortion issue  —  Republican General Assembly candidates don't always stress their abortion stands when wooing swing voters, but Gov. Glenn Youngkin's political action committee is spending big money to do just that.",
    "url": "https://richmond.com/news/state-regional/government-politics/youngkins-pac-sets-1-4-million-ad-push-on-abortion-issue/article_2256a7ce-678c-11ee-93e8-1b49cbbcb646.html"
  }
]