[
  {
    "text": "Live Updates: Eric Adams Is Indicted in New York  —  The indictment makes Mr. Adams the first sitting New York City mayor to face criminal charges.  —  Here's the latest on the mayor's indictment.  —  Mayor Eric L. Adams has been indicted on federal criminal charges … ",
    "url": "https://www.nytimes.com/live/2024/09/25/nyregion/eric-adams-indicted-corruption?unlocked_article_code=1.Nk4.RfxD.LvCd4VYdPWrg&smid=nytcore-ios-share&referringSource=articleShare&sgrp=c-cb"
  },
  {
    "text": "Eric Adams Is Indicted After Federal Corruption Investigation  —  The indictment makes Mr. Adams the first sitting mayor of New York City to be charged with a federal crime.  —  Eric L. Adams, a retired police captain who was elected as New York City's 110th mayor nearly three years ago … ",
    "url": "https://www.nytimes.com/2024/09/25/nyregion/eric-adams-indicted.html"
  },
  {
    "text": "Eric Adams becomes first sitting NYC mayor indicted in historic federal probe — claims feds persecuting him over migrant crisis  —  Mayor Eric Adams has been indicted by a grand jury on charges connected to a federal probe, sources told The Post — as the defiant mayor claimed he was being persecuted … ",
    "url": "https://nypost.com/2024/09/25/us-news/nyc-mayor-eric-adams-indicted-by-grand-jury-in-historic-federal-probe-sources/"
  },
  {
    "text": "Ocasio-Cortez Says Adams Should Resign ‘for the Good of the City’  —  Representative Alexandria Ocasio-Cortez became the most prominent elected official to call for Mayor Eric Adams to no longer lead New York City.  —  Representative Alexandria Ocasio-Cortez of New York on Wednesday … ",
    "url": "https://www.nytimes.com/2024/09/25/nyregion/aoc-eric-adams-resign.html"
  },
  {
    "text": "GOP Rep. Clay Higgins deletes post calling Haitian migrants ‘thugs,’ telling them to get ‘their a** out of our country’  —  House Democrats immediately tried to reprimand GOP Rep. Clay Higgins of Louisiana from the floor of the chamber on Wednesday over a since deleted social media post calling … ",
    "url": "https://www.cnn.com/2024/09/25/politics/clay-higgins-deletes-post-haitian-migrants/"
  },
  {
    "text": "Rep. Clay Higgins Posts, Then Deletes, Racist Comments About Haitians  —  False claims about migrants in Springfield, Ohio, who are legal residents, became a campaign issue after Donald J. Trump brought them up at the presidential debate this month.  —  Representative Clay Higgins … ",
    "url": "https://www.nytimes.com/2024/09/25/us/politics/clay-higgins-haitians-springfield-ohio.html"
  },
  {
    "text": "GOP lawmaker deletes racist social media post after swift backlash  —  Rep. Clay Higgins deleted a social media post Wednesday with racist tropes about Haitians after swift backlash from his congressional colleagues, including a call to censure him on the House floor.",
    "url": "https://www.politico.com/live-updates/2024/09/25/congress/fallout-after-racist-republican-social-media-post-00181072"
  },
  {
    "text": "Kamala Harris: American Women Don't Need Trump's ‘Protection’  —  NOT HAVING IT  —  “I don't think the women of America need him to say he's going to protect them.  The women of America need him to trust them,” Harris said.  —  Vice President Kamala Harris rejected Donald Trump's recent assertion that … ",
    "url": "https://www.thedailybeast.com/harris-speaks-for-american-women-in-dismissing-trumps-promise-to-protect-them"
  },
  {
    "text": "Harris Calls Trump ‘One Of The Biggest Losers Ever On Manufacturing’  —  Vice President Kamala Harris ripped Donald Trump on a key issue the former president ran on in 2016.  —  LOADING  —  Vice President Kamala Harris called Donald Trump a “loser” who failed to grow domestic manufacturing under … ",
    "url": "https://www.huffpost.com/entry/donald-trump-kamala-harris-manufacturing-economy_n_66f4791fe4b0bcdae0fd4634"
  },
  {
    "text": "Trump makes last-minute push for alternative stopgap with voting provisions  —  Former President Trump is making a last-minute push for House Republicans to adopt a short-term government funding package that includes language pertaining to voting, multiple sources told The Hill.",
    "url": "https://thehill.com/homenews/house/4898953-trump-stopgap-funding-voting/"
  },
  {
    "text": "Wausau mayor moves ballot box in controversial act  —  Wausau Mayor Doug Diny is facing scrutiny after video surveillance footage showed him carting the city's outdoor ballot drop box inside on Sunday while sporting a Department of Public Works jacket and hard hat.",
    "url": "https://wausaupilotandreview.com/2024/09/24/wausau-mayor-moves-ballot-box-in-controversial-act-public-outcry-and-potential-legal-consequences-loom/"
  },
  {
    "text": "Mark Robinson's Top Staff in the Lieutenant Governor's Office Plan to Resign  —  North Carolina's Republican nominee for governor has already lost most of his campaign staff after a news report linked him to disturbing comments on a porn site.  —  Senior staff members in the office … ",
    "url": "https://www.nytimes.com/2024/09/25/us/politics/mark-robinson-staff-resignation.html"
  },
  {
    "text": "“The evidence will be powerful”: Legal experts say Jack Smith about to drop a bomb in Trump case  —  Legal scholars expect a bitter fight over what evidence may be redacted from the public  —  Special counsel Jack Smith is expected to submit an “oversized” brief in former President Donald … ",
    "url": "https://www.salon.com/2024/09/25/the-evidence-will-be-powerful-legal-experts-say-jack-smith-about-to-drop-a-bomb-in-case/"
  },
  {
    "text": "Barack Obama's Secret Service Detail Penetrated, Armed Man Walks Up to SUV  —  BARACK OBAMA ARMED MAN STROLLS UP TO HIS SUV With Secret Service Nearby … 1:15 PM PT — A rep for Secret Service tells TMZ ... “The Secret Service cannot provide the details on our means and methods of protection … ",
    "url": "https://www.tmz.com/2024/09/25/barack-obama-secret-service-breach-security-failure-armed-man/"
  },
  {
    "text": "Joe Biden Says He Delegated ‘Everything’ to Kamala Harris: ‘Foreign Policy to Domestic Policy’  —  President Joe Biden said Wednesday that he delegated “everything” as commander-in-chief to Vice President Kamala Harris, including foreign policy and domestic policy.",
    "url": "https://www.breitbart.com/2024-election/2024/09/25/joe-biden-says-he-delegated-everything-to-kamala-harris-foreign-policy-domestic-policy/"
  },
  {
    "text": "Trio of sex scandals create unwelcome September surprises for GOP  —  A trio of sex scandals are becoming September surprises for Republicans, creating unnecessary distractions as the party seeks to win control of the White House and Congress this fall.  —  It's unclear if any of the controversies … ",
    "url": "https://thehill.com/homenews/house/4899406-republican-sex-scandals-2022/"
  },
  {
    "text": "'I've got 25 grandkids': Mitt Romney fears Trump will target him and his family if re-elected  —  Mitt Romney's biographer claims the senator is preparing for what a Trump win means for him and his family  —  Your support helps us to tell the story  —  As your White House correspondent … ",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/donald-trump-mitt-romney-retribution-b2618924.html"
  },
  {
    "text": "Statement from President Joe Biden on Passage of the Continuing Resolution  —  Tonight, bipartisan majorities in both chambers of Congress passed a continuing resolution to keep the government open through mid-December.  I want to thank both houses of Congress—especially Senators Murray … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/09/25/statement-from-president-joe-biden-on-passage-of-the-continuing-resolution/"
  },
  {
    "text": "Mike Johnson demands Zelensky fire Ukrainian ambassador after Pennsylvania trip  —  House Speaker Mike Johnson (R-LA) is demanding Ukrainian President Volodymyr Zelensky fire the Ukrainian ambassador to the United States for planning a visit to Pennsylvania earlier this week … ",
    "url": "https://www.washingtonexaminer.com/news/house/3166535/johnson-demands-zelensky-fire-ukrainian-ambassador-pennsylvania-trip/"
  },
  {
    "text": "Republicans Seem To Be A Far Greater Threat To Pets Than Immigrants  —  Some of them have actually killed dogs!  —  LOADING  —  JD Vance, Donald Trump and other Republicans are clinging to a racist and thoroughly debunked lie that a group of legal immigrants in Ohio are abducting, killing and eating people's pets.",
    "url": "https://www.huffpost.com/entry/republicans-killing-dogs-hurting-threatening-animals_n_66f2fe29e4b0d04575631d0b"
  },
  {
    "text": "Why Mark Zuckerberg thinks AR glasses will replace your phone  —  Meta's CEO on his first pair of AR glasses, partnering with Ray-Ban, why he's done with politics, and more. … We have a very special episode of Decoder today.  It's become a tradition every fall to have Verge deputy editor … ",
    "url": "https://www.theverge.com/24253481/meta-ceo-mark-zuckerberg-ar-glasses-orion-ray-bans-ai-decoder-interview"
  }
]