[
  {
    "text": "Exclusive: Recordings describe 2020 Oval Office photo-op where Trump was briefed on fake electors and January 6  —  Before a group of supportive lawyers entered the Oval Office for a photo-op with then-President Donald Trump in December 2020, they were given a clear instruction … ",
    "url": "https://www.cnn.com/2023/12/13/politics/trump-2020-oval-office-fake-electors-recordings/"
  },
  {
    "text": "It's a ‘silly notion’ that Trump's Georgia case should pause for the election, Willis tells the AP  —  ATLANTA (AP) — The district attorney prosecuting Donald Trump over efforts to overturn the 2020 election in Georgia says she has a duty to file charges against anyone who violates the law and that it's a … ",
    "url": "https://apnews.com/article/fani-willis-trump-2020-election-indictment-georgia-de77f102a0747f9c65ed874a1f0612c0"
  },
  {
    "text": "Checks and Balances Won't Stop Trump  —  The Constitution's protections won't be able to block his abuses of executive power.  —  As we approach the 2024 primaries, some Republicans have begun arguing that the checks and balances constructed by the framers of our Constitution … ",
    "url": "https://www.wsj.com/articles/liz-cheney-checks-and-balances-wont-stop-trump-abuse-of-power-jan-6-second-term-219cc7b7?mod=followamazon"
  },
  {
    "text": "Biden impeachment inquiry authorized by House Republicans, despite lack of evidence  —  The U.S. House of Representatives voted on Wednesday to formally authorize its ongoing impeachment inquiry into President Joe Biden, as Republicans unite behind the effort even though they have yet to find evidence of wrongdoing by the Democrat.",
    "url": "https://www.reuters.com/world/us/us-house-republicans-ready-vote-formalize-biden-impeachment-inquiry-2023-12-13/"
  },
  {
    "text": "A revealing exchange on the GOP's speculative impeachment inquiry  —  It's perhaps a little too simplistic to cast the impeachment inquiry of President Biden, which the House will vote to formalize Wednesday, as a “Seinfeld”-ian impeachment “about nothing.”  —  Republicans have at the very … ",
    "url": "https://www.washingtonpost.com/politics/2023/12/13/republican-impeachment-case-analysis/"
  },
  {
    "text": "'He's worried': Hunter Biden's legal woes take a heavy toll on his father  —  Behind closed doors, fears about the reelection campaign and his son's potential criminal trial have become an ever-present weight on the president.  —  WILMINGTON, Del. — Some days it's with a text.",
    "url": "https://www.politico.com/news/2023/12/13/hunter-biden-legal-woes-reelection-00131568"
  },
  {
    "text": "Trump fraud trial judge evacuated from Manhattan courthouse soon after testimony ends  — The Trump fraud trial is nearing its end in a lower Manhattan courthouse.  — More than 10 weeks of testimony wrapped on Wednesday with a verdict expected in a month.",
    "url": "https://www.businessinsider.com/manhattan-courthouse-evacuated-donald-trump-new-york-civil-fraud-trial-2023-12"
  },
  {
    "text": "Protest calling for cease-fire in Gaza shuts down SB 110 Freeway in downtown Los Angeles  —  The CHP says 75 people were arrested.  —  A protest on the 110 Freeway in downtown Los Angeles prompted a shutdown of southbound lanes as demonstrators called for a cease-fire in Gaza.  —  KABC",
    "url": "https://abc7.com/110-freeway-protest-downtown-cease-fire/14177639/"
  },
  {
    "text": "Fox Board Member Paul Ryan Slams Trump, Hails Cheney and Kinzinger: 'Trump's Not a Conservative, He's an Authoritarian Narcissist'  —  Former House Speaker Paul Ryan tore into Donald Trump in a recent interview, denouncing the former president as an “authoritarian narcissist,” … ",
    "url": "https://www.mediaite.com/news/fox-board-member-paul-ryan-slams-trump-hails-cheney-and-kinzinger-trumps-not-a-conservative-hes-an-authoritarian-narcissist/"
  },
  {
    "text": "Senate Passes Defense Bill, Steering Clear of Far-Right Policy Dictates  —  The $886 billion legislation is the product of bipartisan negotiations between the House and Senate in which right-wing restrictions on abortion, transgender care and diversity initiatives were jettisoned.",
    "url": "https://www.nytimes.com/2023/12/13/us/senate-defense-bill.html"
  },
  {
    "text": "Tesla recalls nearly all vehicles sold in US to fix system that monitors drivers using Autopilot  —  Tesla is recalling nearly all vehicles sold in the U.S., more than 2 million, to update software and fix a defective system that's supposed to ensure drivers are paying attention when using Autopilot.",
    "url": "https://apnews.com/article/tesla-autopilot-recall-driver-monitoring-system-8060508627a34e6af889feca46eb3002"
  },
  {
    "text": "Carnegie Mellon Student Sues Over Prof's ‘Cruel Campaign of Antisemitic Abuse’  —  Yael Canaan says her architecture instructor at one point suggested she ponder “what Jews do to make themselves such a hated group.”  —  A Carnegie Mellon University architecture student says she was subjected to a … ",
    "url": "https://www.thedailybeast.com/carnegie-mellon-student-sues-over-profs-cruel-campaign-of-antisemitic-abuse"
  },
  {
    "text": "One US Marine Dead, Dozen More Hospitalized After Training Accident in California  —  The Marines were traveling in an amphibious combat vehicle, designed to operate on the sea and on land, at the time of the accident  —  A United States Marine is dead while more than a dozen others were taken … ",
    "url": "https://themessenger.com/news/marine-dead-dozen-hospitalized-training-accident-camp-pendleton-california"
  },
  {
    "text": "The GOP's Refusal to Fund Ukraine's Defense Is an Absolute Scandal  —  MAGA Republicans are Vladimir Putin's best friends, and they work against the U.S.' national security. … The damage has been done.  The message has been sent.  —  Russia's fifth column, also known as the MAGA Republicans … ",
    "url": "https://www.thedailybeast.com/gops-refusal-to-fund-ukraines-defense-is-an-absolute-scandal"
  },
  {
    "text": "‘COME AND TAKE IT, USDA’: House Republicans Passionately Defend Milk  —  “We want only the most nutritional option for Santa,” argued Rep. Virginia Foxx (R-N.C.).  “Whole milk is the unsung hero of his Christmas journey.”  —  LOADING  —  Congress is running out of time to pass major legislative priorities … ",
    "url": "https://www.huffpost.com/entry/house-republicans-whole-milk-santa_n_657a3d94e4b061b3c92df896"
  },
  {
    "text": "Democrat senator blasts ‘failure’ of university leaders to protect Jewish students, asks Biden admin to review  —  Sen. Jacky Rosen sent a letter to Education Secretary Cardona after House hearing on campus antisemitism  —  EXCLUSIVE: Democrat Sen. Jacky Rosen is urging Education Secretary Miguel Cardona … ",
    "url": "https://www.foxnews.com/politics/democrat-senator-blasts-failure-university-leaders-protect-jewish-students-asks-biden-admin-review"
  },
  {
    "text": "Bush v. Gore destroyed us  —  This week marks 23 long and weary years since the Supreme Court delivered its landmark opinion in Bush v. Gore.  Time sure does fly when democracy is eroding before your very eyes.  —  The Court's decision ended Florida's recount of its 2000 election results … ",
    "url": "https://thehill.com/opinion/campaign/4357812-bush-v-gore-destroyed-us/"
  },
  {
    "text": "Former global diversity executive at Facebook pleads guilty to defrauding company out of more than $4 million  —  For Immediate Release  —  U.S. Attorney's Office, Northern District of Georgia  —  ATLANTA - Barbara Furlow-Smiles, a former global diversity executive at Facebook … ",
    "url": "https://www.justice.gov/usao-ndga/pr/former-global-diversity-executive-facebook-pleads-guilty-defrauding-company-out-more-4?te=1&nl=dealbook&emc=edit_dk_20231213"
  },
  {
    "text": "Scoop: U.S. delaying sale of M16 rifles to Israel over settler violence  —  The Biden administration is again holding up the licenses for selling more than 20,000 U.S.-made rifles to Israel over concerns about attacks by extremist Israeli settlers against Palestinian civilians in the occupied West Bank, two U.S. officials told Axios.",
    "url": "https://www.axios.com/2023/12/13/us-israel-rifle-sale-delay-west-bank-violence"
  }
]