[
  {
    "text": "‘Deranged’ and ‘problematic’: Bipartisan lawmakers bash Trump's Gaza proposal  —  Trump said Tuesday night that the U.S. “will take over Gaza” and send in troops “if necessary.”  —  Criticism and concern spread across both sides of the aisle Tuesday night following President Donald Trump's announcement … ",
    "url": "https://www.nbcnews.com/politics/congress/deranged-problematic-bipartisan-lawmakers-bash-trumps-gaza-proposal-rcna190733"
  },
  {
    "text": "Trump Proposes U.S. Takeover of Gaza and Says All Palestinians Should Leave  —  The president met with the Israeli prime minister at the White House, meeting in person with another world leader for the first time since returning to power.  — 1.9k  —  President Trump declared on Tuesday … ",
    "url": "https://www.nytimes.com/2025/02/04/us/politics/trump-gaza-strip-netanyahu.html?unlocked_article_code=1.uk4.rdwW.YGF692Yw2pCF&smid=url-share"
  },
  {
    "text": "Trump's plan to ‘take over’ Gaza Strip confuses GOP lawmakers  —  President Donald Trump's vague vow that the United States will “take over the Gaza Strip” is sparking quick pushback, and confusion, among some of his key allies in the Senate GOP.  Trump provided no details during a press conference … ",
    "url": "https://www.politico.com/live-updates/2025/02/04/congress/trumps-gaza-comments-confuses-gop-00202538"
  },
  {
    "text": "Trump's suggestion the US ‘take over’ the Gaza Strip is rejected by allies and adversaries alike  —  President Donald Trump's proposal that the United States “take over” the Gaza Strip and permanently resettle its Palestinian residents was swiftly rejected and denounced on Wednesday by American allies and adversaries alike.",
    "url": "https://apnews.com/article/israel-hamas-war-gaza-trump-netanyahu-db2c407baf803291a4acf6edfd708c48"
  },
  {
    "text": "With Gaza Plan, an Unbound Trump Pushes an Improbable Idea  —  Once a critic of nation building, the president now envisions taking over a Middle East enclave, driving out its Palestinian population and transforming it into “the Riviera of the Middle East.”  —  President Trump basked … ",
    "url": "https://www.nytimes.com/2025/02/05/us/politics/trump-gaza-netanyahu-takeover.html"
  },
  {
    "text": "The CIA Is About to Get a Trump Makeover  —  Spy agency's workforce receives buyout-style offer  —  WASHINGTON—The Central Intelligence Agency offered buyouts to its entire workforce Tuesday, in what officials said is a bid to bring the agency in line with President Trump's priorities, including targeting drug cartels.",
    "url": "https://www.wsj.com/politics/national-security/the-cia-is-about-to-get-a-trump-makeover-16fc0cbf?st=UkTZ8Q"
  },
  {
    "text": "CIA offers buyouts to entire workforce to align with Trump priorities, sources say  —  The Central Intelligence Agency offered buyouts to its entire workforce Tuesday, citing an aim to bring the agency in line with U.S. President Donald Trump's priorities, according to two sources familiar with the matter.",
    "url": "https://www.reuters.com/world/us/cia-offers-buyouts-entire-workforce-align-with-trump-priorities-wsj-reports-2025-02-05/"
  },
  {
    "text": "CIA sends ‘buyout’ offers to entire workforce  —  The Central Intelligence Agency on Tuesday became the first major national security agency to offer so-called buyouts to its entire workforce, a CIA spokesperson and two other sources familiar with the offer said, part of President Donald Trump's broad effort … ",
    "url": "https://www.cnn.com/2025/02/04/politics/cia-workforce-buyouts/"
  },
  {
    "text": "There Is No Going Back  —  Even if anyone had elected Elon Musk to anything, the last week would still be one of the most serious examples of executive branch malfeasance in American history.  —  Musk has seized hold of critical levers of power and authority within the federal government … ",
    "url": "https://www.nytimes.com/2025/02/05/opinion/trump-musk-federal-government.html?unlocked_article_code=1.uk4.KjGs.NBjDp6WVakwq&smid=url-share"
  },
  {
    "text": "Trump Brazenly Defies Laws in Escalating Executive Power Grab  —  In the radical opening weeks of his second term, President Trump has appeared to feel little constraint by any need to show respect for the rule of law.  —  In his first term, President Trump seemed to relish ripping through … ",
    "url": "https://www.nytimes.com/2025/02/05/us/trump-federal-law-power.html?unlocked_article_code=1.uk4.Yri7.3if-NnTFkGWc"
  },
  {
    "text": "U.S. government officials privately warn Musk's blitz appears illegal  —  The billionaire's DOGE team has launched an all-out assault on federal agencies, triggering numerous legal objections.  —  The chaotic blitz by Elon Musk's Department of Government Efficiency has triggered legal … ",
    "url": "https://www.washingtonpost.com/business/2025/02/04/elon-musk-government-legal-doge/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM4NjQ1MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQwMDI3NTk5LCJpYXQiOjE3Mzg2NDUyMDAsImp0aSI6ImJmNWQ2YmJhLWQzYmEtNDdkMS05MDQ0LTVhZWI2ZjNhYjllMiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9idXNpbmVzcy8yMDI1LzAyLzA0L2Vsb24tbXVzay1nb3Zlcm5tZW50LWxlZ2FsLWRvZ2UvIn0.nAg1iiymvc20QOtIdoLG04zHuSNFRwgDGTLPr4OLgHI&itid=gfta"
  },
  {
    "text": "Trump Advisers Stopped Musk From Hiring a Noncitizen at DOGE  —  As Elon Musk set out to upend the federal bureaucracy on behalf of Donald Trump, he reached out to Trump's team with an unusual request: U.S. law generally prohibits noncitizens from working for the federal government … ",
    "url": "https://www.theatlantic.com/politics/archive/2025/02/elon-musk-doge-green-card-trump/681575/"
  },
  {
    "text": "A Legal Counteroffensive to Beat Back Trump's Government Purges  —  A raft of new lawsuits contend that President Trump and Elon Musk are breaking the law to ransack the F.B.I. and other federal agencies.  The courts will now decide.  —  Workers from across the federal government set off … ",
    "url": "https://www.nytimes.com/2025/02/04/us/doge-lawsuits-trump-elon-musk.html"
  },
  {
    "text": "Elon Musk gets quiet White House reminders his power isn't unchecked  —  Trump's aides have signaled behind the scenes that Musk still reports to White House chief of staff Susie Wiles.  —  Tech billionaire and newly minted “special government employee” Elon Musk has received quiet White House reminders … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/elon-musk-white-house-reminder-power-not-unchecked-rcna190659"
  },
  {
    "text": "U.S. Postal Service Reverses Decision to Halt Parcel Service From China  —  The Postal Service will continue to accept parcels from Hong Kong and China despite a new executive order that will require greater inspection of packages.  —  The United States Postal Service on Wednesday … ",
    "url": "https://www.nytimes.com/2025/02/04/business/usps-china-de-minimis.html"
  },
  {
    "text": "Doge staffers enter Noaa headquarters and incite reports of cuts and threats  —  Members reportedly sought access to IT systems at agency that Project 2025 has called ‘harmful to US prosperity’  —  Staffers with Elon Musk's “department of government efficiency” (Doge) reportedly entered … ",
    "url": "https://www.theguardian.com/us-news/2025/feb/04/doge-noaa-headquarters"
  },
  {
    "text": "Federal health workers terrified after ‘DEI’ website publishes list of ‘targets’  —  The site calls out workers who have been involved with DEI initiatives.  A majority are Black.  —  Federal health workers are expressing fear and alarm after a website called “DEI Watch List” published the photos … ",
    "url": "https://www.nbcnews.com/health/health-news/federal-health-workers-terrified-dei-website-publishes-list-targets-rcna190711"
  },
  {
    "text": "Democrats Are Falling For Trump and Musk's Foreign Aid Trap  —  Three veteran strategists want their party to be more thoughtful about fighting Trump's anti-bureaucracy campaign.  —  After three months of soul-searching about how to revive their party, some Democrats this week believe … ",
    "url": "https://www.politico.com/news/magazine/2025/02/04/democrats-foreign-aid-trap-trump-00202447"
  },
  {
    "text": "Treasury says Musk's DOGE has not rejected payments in first attempt to clarify access granted to critical system  —  The Treasury Department said Elon Musk aides detailed to the agency have “read-only” access to its sensitive $5 trillion US payments system and that no payments have been suspended … ",
    "url": "https://www.cnn.com/2025/02/04/politics/treasury-payments-system-musk-doge-access/"
  },
  {
    "text": "How Trump Gutted America's $40 Billion Aid Agency in Two Weeks  —  Dismantling of USAID appears to be a test case for new administration  —  WASHINGTON—The cuts came so fast that one dismissed employee had to be rehired to process other employees' time sheets.",
    "url": "https://www.wsj.com/politics/policy/how-trump-musk-doge-killed-usaid-b649f1f5?st=2U1axT&reflink=article_copyURL_share"
  },
  {
    "text": "Musk shocks lawmakers, setting himself on collision course  —  Billionaire businessman Elon Musk is on a collision course with lawmakers on Capitol Hill who are starting to challenge his authority.  —  Senate Republicans acknowledge they need to cut government spending … ",
    "url": "https://thehill.com/homenews/senate/5126740-elon-musk-government-authority/"
  },
  {
    "text": "Migrants Are Deported to India on U.S. Military Plane  —  The flight appeared to be the first use of an American military aircraft to deport people to India, which is one of the top sources of illegal immigration to the United States.  —  A U.S. military plane with at least 100 aboard landed … ",
    "url": "https://www.nytimes.com/2025/02/05/world/asia/migrants-deported-india-us.html"
  },
  {
    "text": "Trump and Musk demand termination of federal office leases through General Services Administration  —  One of the next moves in President Donald Trump and Elon Musk's sweeping effort to fire government employees and curtail operations is using the agency that manages thousands … ",
    "url": "https://apnews.com/article/trump-musk-gsa-terminate-office-leases-f8faac5e2038722f705587c8dd21ab26"
  },
  {
    "text": "Pam Bondi to be sworn in as attorney general following Senate confirmation  —  The 54-46 vote fell mostly along party lines, with Sen. John Fetterman (D-Pennsylvania) joining Republicans voting in her favor.  —  The Senate voted Tuesday evening to confirm Pam Bondi, President Donald Trump's nominee … ",
    "url": "https://www.washingtonpost.com/politics/2025/02/05/pam-bondi-attorney-general/"
  }
]