[
  {
    "text": "Trump can be held civilly liable in Jan. 6 riot, judges rule  —  Donald Trump can be held civilly liable for the actions of the mob that attacked the U.S. Capitol on Jan. 6, 2021, an appeals court ruled Friday in a long-awaited decision that could clear the way for lawsuits seeking financial damages from the former president.",
    "url": "https://www.washingtonpost.com/dc-md-va/2023/12/01/trump-can-be-sued-jan-6-immunity/"
  },
  {
    "text": "Behind the Curtain — Scoop: The Trump job applications revealed  —  We told you in a “Behind the Curtain” column last month that Trump allies are pre-screening the ideologies of thousands of potential appointees and employees in case he wins back the White House.",
    "url": "https://www.axios.com/2023/12/01/trump-government-job-applications-2025"
  },
  {
    "text": "Trump's campaign thinks it's getting a surprise assist from Dean Phillips  —  Joe Biden's primary opponent is make the ex-president's electability argument for him.  —  Donald Trump's campaign believes it's getting a welcome boost from an unexpected source.",
    "url": "https://www.politico.com/news/2023/12/01/trump-surprise-assist-dean-phillips-00129427"
  },
  {
    "text": "Trump may be sued over Jan. 6 incitement claims, appeals court panel rules  —  The three-judge panel turned aside Trump's sweeping argument that nearly all speech and conduct by an incumbent president should be shielded from lawsuits.  —  Donald Trump can be sued over claims that he incited violence … ",
    "url": "https://www.politico.com/news/2023/12/01/trump-may-be-sued-over-jan-6-incitement-claims-appeals-court-panel-rules-00129576"
  },
  {
    "text": "House votes to expel indicted Rep. George Santos from Congress  —  The New York Republican is now just the third lawmaker since the Civil War to be expelled from the House of Representatives.  —  WASHINGTON — The House voted overwhelmingly to expel indicted Rep. George Santos on Friday … ",
    "url": "https://www.nbcnews.com/politics/congress/george-santos-expulsion-congress-ny-house-ethics-committee-rcna127179"
  },
  {
    "text": "Steve Scalise reveals what's really happened since McCarthy's fall  —  The House Majority Leader illuminates what happened behind closed doors after Kevin McCarthy's ousting as well as what to expect next on impeachment; why he will vote against expelling George Santos; and how Speaker Mike Johnson … ",
    "url": "https://www.politico.com/news/2023/12/01/steve-scalise-house-majority-00129239"
  },
  {
    "text": "Rep. George Santos expelled from Congress in historic vote  —  The House on Friday voted to expel Rep. George Santos (R-N.Y.) over his many fabrications on the 2022 campaign trail and his two federal indictments. … - The votes comes after the House Ethics Committee released a report accusing Santos of a … ",
    "url": "https://www.axios.com/2023/12/01/george-santos-house-expulsion-vote"
  },
  {
    "text": "House votes to expel Santos from Congress in historic vote  —  The House voted Friday to expel GOP Rep. George Santos, a historic vote that will make the New York congressman the sixth lawmaker ever to be expelled from the chamber.  —  The resolution passed 311 to 114 … ",
    "url": "https://www.cnn.com/2023/12/01/politics/george-santos-expel-resolution-vote/"
  },
  {
    "text": "House Expels George Santos From Congress in Historic Vote  —  Mr. Santos, a New York Republican, is the sixth member of the House to be expelled in the body's history.  “To hell with this place,” he said after his colleagues ousted him.  —  Back  —  TRANSCRIPT  —  House Ousts George Santos From Office in Bipartisan Vote",
    "url": "https://www.nytimes.com/live/2023/12/01/nyregion/george-santos-expulsion-vote"
  },
  {
    "text": "Sandra Day O'Connor, the first female Supreme Court justice, dead at 93  —  From the early 1990s until her retirement in 2005, she was the indisputable swing justice  —  Sandra Day O'Connor, the first woman to serve on the Supreme Court and the justice who held the court's center for more than a generation … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/sandra-day-oconnor-dead-dies-rcna127589"
  },
  {
    "text": "Israel Knew Hamas's Attack Plan More Than a Year Ago  —  A blueprint reviewed by The Times laid out the attack in detail.  Israeli officials dismissed it as aspirational and ignored specific warnings.  —  Israeli officials obtained Hamas's battle plan for the Oct. 7 terrorist attack … ",
    "url": "https://www.nytimes.com/2023/11/30/world/middleeast/israel-hamas-attack-intelligence.html"
  },
  {
    "text": "Sparks flew behind the scenes at the Ron DeSantis and Gavin Newsom debate  —  While the candidates said they were happy to keep debating for longer than 90 minutes, an intervention from the California governor's wife put a stop to it.  —  Florida Gov. Ron DeSantis and California Gov. Gavin Newsom … ",
    "url": "https://www.nbcnews.com/politics/2024-election/gavin-newsom-fox-debate-rcna127563"
  },
  {
    "text": "Speaker Johnson wrote foreword for book filled with conspiracy theories and homophobic insults  —  Speaker of the House Mike Johnson wrote the foreword and publicly promoted a 2022 book that spread baseless and discredited conspiracy theories and used derogatory homophobic insults.",
    "url": "https://www.cnn.com/2023/12/01/politics/kfile-mike-johnson-conspiracy-theories-homophobic-slurs/"
  },
  {
    "text": "DeSantis calls for resignation of embattled Florida GOP chairman  —  Florida Gov. Ron DeSantis (R) is calling for the resignation of Florida GOP Chairman Christian Ziegler, who is ensnared in a police inquiry involving alleged sexual battery.  —  “I don't see how he can continue … ",
    "url": "https://www.washingtonpost.com/politics/2023/12/01/desantis-resignation-christian-ziegler-florida/"
  },
  {
    "text": "Rand Paul performs Heimlich on fellow GOP senator  —  Sen. Joni Ernst of Iowa thanked Sen. Rand Paul in a post on X after the incident.  —  WASHINGTON — Sen. Rand Paul, R-Ky., performed the Heimlich maneuver on Sen. Joni Ernst during a Republican conference lunch at the Capitol on Thursday, according to a tweet by the Iowa senator.",
    "url": "https://www.nbcnews.com/politics/congress/rand-paul-performs-heimlich-fellow-gop-senator-rcna127493"
  },
  {
    "text": "The White House ran afoul of the Hatch Act after initial warning, government watchdog says  —  Karine Jean-Pierre and Andrew Bates took actions that were “contrary” to guidance on complying with a law designed to limit how officials engage in elections, the U.S. Office of Special Counsel said.",
    "url": "https://www.nbcnews.com/politics/white-house/white-house-ran-afoul-hatch-act-initial-warning-government-watchdog-sa-rcna127456"
  },
  {
    "text": "Former U.S. Marine Pleads Guilty to Firebombing a Planned Parenthood Clinic in Orange County and Admits to Planning Additional Attacks  —  For Immediate Release  —  U.S. Attorney's Office, Central District of California  —  SANTA ANA, California - An Orange County man pleaded guilty today … ",
    "url": "https://www.justice.gov/usao-cdca/pr/former-us-marine-pleads-guilty-firebombing-planned-parenthood-clinic-orange-county-and"
  }
]