[
  {
    "text": "The real reason Trump is destroying the economy  —  The Trump administration's tariffs are, by every reasonable account, an economic catastrophe in the making.  So why are they happening?  —  One explanation is that this is simply democracy at work.  President Donald Trump campaigned … ",
    "url": "https://www.vox.com/politics/407053/trump-tariff-expensive-democracy-authoritarianism-breakdown"
  },
  {
    "text": "Top Republican leads bill to reassert Congress' tariff power amid Trump trade war  —  Sen. Chuck Grassley, a senior Republican lawmaker from the farm-heavy state of Iowa, is spearheading new legislation that would reassert Congress' authority over tariffs amid President Donald Trump's trade war escalation.",
    "url": "https://www.politico.com/live-updates/2025/04/03/congress/top-republican-leads-bill-to-reassert-congress-tariff-power-amid-trump-trade-war-00268710"
  },
  {
    "text": "National Security Agency and Cyber Command chief Gen. Timothy Haugh ousted  —  The director of the NSA, the powerful wiretapping and cyber espionage service, was fired and reassigned Thursday, according to U.S. officials.  —  just now  —  The director of the powerful wiretapping … ",
    "url": "https://www.washingtonpost.com/national-security/2025/04/03/nsa-director-fired-tim-haugh/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQzNjUyODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ1MDM1MTk5LCJpYXQiOjE3NDM2NTI4MDAsImp0aSI6ImU5MGYyZTIyLTZlMWUtNDI5Ny1iODVmLTRkMmNhNTM5ZDJhMiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb25hbC1zZWN1cml0eS8yMDI1LzA0LzAzL25zYS1kaXJlY3Rvci1maXJlZC10aW0taGF1Z2gvIn0.7AVXq6PGEYYtSiu9nV1l4fhRg0-IrJpb6HtYrKyQ0Yo&itid=gfta"
  },
  {
    "text": "Head of National Security Agency and Cyber Command Is Ousted  —  No reason was given for the removal of Gen. Timothy D. Haugh, but the far-right activist Laura Loomer had called for his ouster in a meeting with President Trump, an official said.  —  The head of the National Security Agency … ",
    "url": "https://www.nytimes.com/2025/04/03/us/politics/nsa-cyber-command-chief-fired.html?unlocked_article_code=1.9E4.h78r.muOL8d3IxEvb&smid=url-share"
  },
  {
    "text": "Trump Fires 6 N.S.C. Officials After Oval Office Meeting With Laura Loomer  —  During the 30-minute meeting, the far-right activist excoriated National Security Council officials in front of the president and Michael Waltz, the national security adviser.  —  President Trump fired six National … ",
    "url": "https://www.nytimes.com/2025/04/03/us/politics/trump-meeting-laura-loomer.html"
  },
  {
    "text": "White House fires three NSC staffers after president meets with far-right activist Laura Loomer  —  The White House has fired at least three National Security Council staffers, three sources familiar with the move told CNN.  —  The firings came after Laura Loomer, the far-right activist … ",
    "url": "https://cnn.com/2025/04/03/politics/nsc-firings-trump-laura-loomer-meeting/"
  },
  {
    "text": "Trump contradicts aides, talking points on purpose of global tariffs  —  Investors and global leaders have been trying to understand the purpose of sprawling new import duties.  —  President Donald Trump on Thursday contradicted his top aides on the purpose of his sprawling new global tariff regime … ",
    "url": "https://www.washingtonpost.com/business/2025/04/03/tariffs-trump-global-trade-talks/"
  },
  {
    "text": "‘Oh Sh-t’: RH Chief Is Shocked as Tariffs Drag Down Stock 44% … “Oh sh-t.”  That was RH Chief Executive Officer Gary Friedman's reaction to what was happening to the luxury furniture maker's stock price on Wednesday evening.  —  Donald Trump had just announced plans for an avalanche … ",
    "url": "https://www.bloomberg.com/news/articles/2025-04-03/rh-plummets-30-on-threat-from-trump-s-tariffs-outlook-miss?accessToken=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzb3VyY2UiOiJTdWJzY3JpYmVyR2lmdGVkQXJ0aWNsZSIsImlhdCI6MTc0MzcwMDcwMiwiZXhwIjoxNzQ0MzA1NTAyLCJhcnRpY2xlSWQiOiJTVTU0WDdEV1JHRzAwMCIsImJjb25uZWN0SWQiOiJCOTdGRUFDNjI5N0Y0ODdGODFCOTE5MTRCOUE0QTVENiJ9.2jep0al9SCQm6b0Oig_lkuY24dhmfhIZf-LZn0CDw8U"
  },
  {
    "text": "Trump's highest tariff will kill tiny African kingdom of Lesotho, economist says  —  A 50% reciprocal trade tariff on Lesotho, the highest levy on U.S. President Donald Trump's long list of target economies, will kill the tiny Southern African kingdom that Trump ridiculed last month, an economic analyst there said on Thursday.",
    "url": "https://www.reuters.com/world/africa/trump-slaps-tiny-african-kingdom-lesotho-with-highest-tariff-all-2025-04-03/"
  },
  {
    "text": "Trump's new tariff math looks a lot like ChatGPT's  —  ChatGPT, Gemini, Grok, and Claude all recommend the same “nonsense” tariff calculation. … When President Donald Trump began yesterday's announcement of the White House's latest trade policy brandishing a novelty-sized cardboard sign labeled … ",
    "url": "https://www.theverge.com/news/642620/trump-tariffs-formula-ai-chatgpt-gemini-claude-grok"
  },
  {
    "text": "Trump Administration Set to Pause $510 Million for Brown University  —  The administration has now targeted five schools' federal funding as part of a pledge to combat what it considers to be antisemitism on university campuses.  —  The Trump administration intends to block $510 million … ",
    "url": "https://www.nytimes.com/2025/04/03/us/trump-administration-brown-university-funding-pause.html"
  },
  {
    "text": "California, Connecticut and Washington lose federal grant funding for local libraries and museums  —  Sydney Carruth and Ryan J. Reilly  —  Several states were notified this morning the federal grant funding they rely on to operate local libraries and museums has been terminated.",
    "url": "https://www.nbcnews.com/politics/trump-administration/live-blog/trump-tariffs-china-doge-musk-immigration-live-updates-rcna199420/rcrd76195?canonicalCard=true"
  },
  {
    "text": "Senate confirms Dr. Oz to lead Medicare and Medicaid  —  He will oversee how physicians are paid through Medicare.  —  Dr. Mehmet Oz, the heart surgeon turned daytime television star, has a new job — overseeing the nation's largest health insurance programs.",
    "url": "https://www.politico.com/news/2025/04/03/senate-confirmation-mehmet-oz-medicare-medicaid-00270913"
  },
  {
    "text": "Eugene Robinson Leaves the Washington Post After Jeff Bezos' ‘Significant Shift’ to Opinion Section  —  “I wish nothing but the very best for the paper and for all of you.  I won't be a stranger,” the political columnist tells his colleagues after 45 years at WaPo",
    "url": "https://www.thewrap.com/eugene-robinson-leaves-the-washington-post-jeff-bezos-opinion/"
  },
  {
    "text": "Judge Blocks H.H.S. From Terminating $11 Billion in Public Health Grants  —  A coalition of states sued over the Trump administration's unexpected move to cut off the funds, which they said imperiled everything from childhood vaccination programs to opioid addiction treatment.",
    "url": "https://www.nytimes.com/2025/04/03/us/politics/hhs-public-health-grants-judge.html?unlocked_article_code=1.804.3weI.YX-dOoE8si5U&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "RFK Jr. announces HHS reinstating some programs, employees cut by mistake  —  He didn't indicate when the reinstatements would happen.  —  Health and Human Services Secretary Robert F. Kennedy Jr. arrives before President Donald Trump speaks during an event to announce new tariffs … ",
    "url": "https://abcnews.go.com/Politics/rfk-jr-announces-hhs-reinstating-programs-employees-cut/story?id=120463293"
  },
  {
    "text": "The American Age Is Over  —  1. Canada  —  Fittingly, it was the Canadian prime minister, Mark Carney, who declared the official time of death. … And just like that, the age of American empire, the great Pax Americana, ended.  —  Share  —  We cannot overstate what has just happened.",
    "url": "https://www.thebulwark.com/p/the-american-age-is-over"
  },
  {
    "text": "South Korean court removes president from office, says he violated duties  —  The Constitutional Court upheld the impeachment of President Yoon Suk Yeol over his attempt to impose martial law, a decision expected to exacerbate political divisions.  —  Just now",
    "url": "https://www.washingtonpost.com/world/2025/04/03/south-korea-president-removed-martial-law/"
  },
  {
    "text": "Trump Officials Could Be Held in Contempt for Deportation Flights, Judge Says  —  Judge says administration ‘acted in bad faith’ in removal of alleged Venezuelan gang members under wartime law  —  WASHINGTON—A federal judge said he was considering whether to hold Trump administration officials … ",
    "url": "https://www.wsj.com/politics/policy/trump-officials-could-be-held-in-contempt-for-deportation-flights-judge-says-279bb61d"
  },
  {
    "text": "A Response to a Member of Congress  —  Sydney Kamlager-Dove, Democrat of California, accused me of serial sex offenses in a public hearing, then said my lack of response was “telling.”  It's listed below  —  1,746  —  Sydney Kamlager-Dove, a Democrat representing California's 37th district … ",
    "url": "https://www.racket.news/p/a-response-to-a-member-of-congress"
  },
  {
    "text": "Army Planners Are Weighing Force Reductions of Up to 90,000 Active-Duty Soldiers  —  The Army is quietly considering a sweeping reduction of up to 90,000 active-duty troops, a move that underscores mounting fiscal pressures at the Pentagon and a broader shift in military strategy away from Europe … ",
    "url": "https://www.military.com/daily-news/2025/04/03/army-mulling-dramatic-reduction-of-tens-of-thousands-of-troops.html"
  },
  {
    "text": "Radio Free Europe says US switches off satellite transmitting Russia broadcast  —  PRAGUE - The head of Radio Free Europe/Radio Liberty said on April 3 that the US government had switched off a satellite that transmitted its Russian-language programme into Russia.",
    "url": "https://www.straitstimes.com/world/europe/radio-free-europe-says-us-switches-off-satellite-transmitting-russia-broadcast"
  },
  {
    "text": "Stellantis says it will temporarily lay off 900 US workers following tariff announcement  —  Stellantis NV (STLAM.MI) said on Thursday it was temporarily laying off 900 workers at five U.S. facilities after President Donald Trump's tariffs were announced, and temporarily pausing production … ",
    "url": "https://www.reuters.com/business/autos-transportation/stellantis-says-will-temporarily-lay-off-900-us-workers-following-tariff-2025-04-03/"
  }
]