[
  {
    "text": "Jack Smith Invites Aileen Cannon to Protect the Country Rather than Just Donald Trump  —  Jack Smith has asked Judge Aileen Cannon to prevent Trump from lying about a plot to assassinate him, as he has done since propagandist Julie Kelly made a stink about a routine Use of Force form Trump himself released … ",
    "url": "https://www.emptywheel.net/2024/05/25/jack-smith-invites-aileen-cannon-to-protect-the-country-rather-than-just-donald-trump/"
  },
  {
    "text": "Trump is still pushing the limits of the gag order.  It could come back to haunt him at sentencing.  —  Dealing with the gag order is a distraction for both sides.  But if Trump is convicted, his violations could be used as aggravating factors.  —  NEW YORK — So far … ",
    "url": "https://www.politico.com/news/2024/05/25/trump-hush-money-gag-order-sentencing-00159995"
  },
  {
    "text": "Special counsel asks judge for gag order in Trump classified documents case  —  Special counsel's office prosecutors on Friday asked a federal judge in Florida to place a gag order on Donald Trump that would limit his ability to comment about law enforcement that searched his Mar-a-Lago resort.",
    "url": "https://www.cnn.com/2024/05/24/politics/trump-gag-order-trump-classified-documents/"
  },
  {
    "text": "Prosecutors seek to bar Trump from statements endangering law enforcement in classified records case  —  Federal prosecutors on Friday asked the judge overseeing the classified documents case against Donald Trump to bar the former president from public statements that “pose a significant … ",
    "url": "https://apnews.com/article/trump-classified-documents-fbi-d52b7468d93712dd86cbb8fe304d4b64"
  },
  {
    "text": "Wife of Justice Alito called upside-down flag ‘signal of distress’  —  In January 2021, Martha-Ann Alito said the flag, a symbol embraced by election deniers, was raised outside her home in response to a neighborhood dispute.  —  The wife of Supreme Court Justice Samuel A. Alito Jr. told … ",
    "url": "https://www.washingtonpost.com/politics/2024/05/25/alito-flag-martha-ann-washington-post/"
  },
  {
    "text": "Libertarian convention devolves into fighting, obscenities on eve of Trump's visit  —  The former president could face a hostile crowd when he addresses the Libertarian Party on Saturday.  —  Donald Trump won't be speaking to his usual self-selected crowd of adoring red-hatted MAGA fans … ",
    "url": "https://www.politico.com/news/2024/05/24/libertarian-convention-fighting-obscenities-trump-visit-00160008"
  },
  {
    "text": "Libertarian convention crowd appears hostile to Trump ahead of Saturday speech  —  Vivek Ramaswamy was booed when he mentioned Trump, while a convention-goer who called for “Donald Trump to go f— himself” was met with widespread applause.  —  WASHINGTON — Former President Donald Trump … ",
    "url": "https://www.nbcnews.com/politics/2024-election/libertarian-convention-crowd-appears-hostile-trump-ahead-speech-rcna154029"
  },
  {
    "text": "‘It Was Pure Retaliation’: The Feud That Will Define the Senate GOP  —  Rick Scott hasn't given up his quest to vanquish Mitch McConnell and restore his own battered image inside the Republican conference.  —  In late November of 2022, Sen. Rick Scott received a text from an aide to Mitch McConnell.",
    "url": "https://www.politico.com/news/magazine/2024/05/25/it-was-pure-retaliation-the-feud-that-will-define-the-senate-gop-00160002"
  },
  {
    "text": "America's premier pronatalists on having ‘tons of kids’ to save the world: ‘There are going to be countries of old people starving to death’  —  Elon Musk (father of 11) supports their cause.  Thousands follow their ideology.  Malcolm and Simone Collins are on a mission to make it easier for everyone to have multiple children.",
    "url": "https://www.theguardian.com/lifeandstyle/article/2024/may/25/american-pronatalists-malcolm-and-simone-collins"
  },
  {
    "text": "Justice Sotomayor Describes Frustration With Being a Liberal on the Supreme Court  —  In a conversation at Harvard, the justice spoke of her despair at some of the court's decisions, but she urged optimism and a focus on future generations.  —  Some days, after Justice Sonia Sotomayor listens … ",
    "url": "https://www.nytimes.com/2024/05/24/us/politics/sonia-sotomayor-supreme-court.html"
  },
  {
    "text": "Polish foreign minister calls for long-term rearmament of Europe  —  Exclusive: Radosław Sikorski also says he favours deepest possible inclusion of UK in EU defence structures  —  A long-term rearmament of Europe, in which the UK can play the closest possible role … ",
    "url": "https://www.theguardian.com/world/article/2024/may/25/poland-foreign-minister-radoslaw-sikorski-long-term-rearmament-europe"
  },
  {
    "text": "Trumpworld Claims 25,000 People Attended His Rally.  Aerial Shots Show Otherwise.  —  COUNTING IS EASY  —  The Trump campaign was adamant 25,000 people attended his Bronx rally.  Footage, and The Daily Beast's reporter in attendance, suggested otherwise.  —  Trumpworld is once again splintering from reality.",
    "url": "https://www.thedailybeast.com/aerial-shots-undercut-comical-claim-about-trumps-bronx-rally"
  },
  {
    "text": "Google criticized as AI Overview makes obvious errors, such as saying former President Obama is Muslim … It's been less than two weeks since Google debuted “AI Overview” in Google Search, and public criticism has mounted after queries have returned nonsensical or inaccurate results within the AI feature — without any way to opt out.",
    "url": "https://www.cnbc.com/2024/05/24/google-criticized-as-ai-overview-makes-errors-like-saying-president-obama-is-muslim.html"
  },
  {
    "text": "Jan. 6 rioter who attacked cops lashes out at Trump-appointed judge after 12-year sentence  —  Christopher Quaglin said that Donald Trump would be back in the White House in eight short months and called the judge who sentenced him Trump's “worst mistake of 2016.”",
    "url": "https://www.nbcnews.com/politics/justice-department/jan-6-rioter-attacked-cops-lashes-trump-appointed-judge-12-year-senten-rcna153818"
  },
  {
    "text": "As ‘The Apprentice’ Seeks Cannes Sale, Trump Team Sends Cease and Desist Letter to Block Film's Release (EXCLUSIVE)  —  Attorneys for Donald Trump have sent a cease and desist letter to the filmmakers behind “The Apprentice” in an effort to block its U.S. sale and release.",
    "url": "https://variety.com/2024/film/news/apprentice-donald-trump-team-cease-and-desist-letter-sebastian-stan-jeremy-strong-1236015819/"
  },
  {
    "text": "Blackstone's Chief, a G.O.P. Megadonor, Says He Will Again Back Trump  —  Stephen A. Schwarzman, the billionaire co-founder and chief executive of the investment group, had previously called for a “new generation of leaders.”  —  Stephen A. Schwarzman, the billionaire chairman and chief executive … ",
    "url": "https://www.nytimes.com/2024/05/24/us/politics/blackstone-stephen-schwarzman-trump.html"
  }
]