[
  {
    "text": "Joseph Lieberman, senator and vice presidential nominee, dies at 82  —  Joseph I. Lieberman, the doggedly independent four-term U.S. senator from Connecticut who was the Democratic nominee for vice president in 2000, becoming the first Jewish candidate on the national ticket of a major party, died March 27 in New York City.",
    "url": "https://www.washingtonpost.com/obituaries/2024/03/27/joe-lieberman-senator-vice-president-dead/"
  },
  {
    "text": "Former Sen. Joe Lieberman, Democrats' VP pick in 2000, dead at 82  —  Former Sen. Joe Lieberman of Connecticut has died, according to his family.  He was 82 and died of complications from a fall.  —  Photos  —  Former U.S. Sen. Joe Lieberman of Connecticut, who nearly won the vice presidency … ",
    "url": "https://apnews.com/article/joe-lieberman-death-obit-senate-c82d9c92c1c4493fa5d708719884b12d"
  },
  {
    "text": "Playbook: Biden's NYC money bomb  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  BRIGHT LIGHTS, BIG KITTY — President JOE BIDEN heads to the Big Apple tonight for a star-studded fundraising event with former Presidents BARACK OBAMA and BILL CLINTON and “Late Show” host STEPHEN COLBERT.",
    "url": "https://www.politico.com/newsletters/playbook/2024/03/28/bidens-nyc-money-bomb-00149501"
  },
  {
    "text": "Judge rules John Eastman should be disbarred over efforts to overturn 2020 election  —  A California judge on Wednesday recommended disbarring a lawyer at the center of former President Trump's efforts to overturn the results of the 2020 election.  —  State Bar Judge Yvette Roland found … ",
    "url": "https://thehill.com/regulation/court-battles/4560409-judge-rules-john-eastman-should-be-disbarred-over-efforts-to-overturn-2020-election/"
  },
  {
    "text": "These 50 companies have donated over $23 million to election deniers since January 6, 2021  —  Donald Trump lost the 2020 election.  —  Then, according to the report of the bipartisan January 6 Commission, Trump engaged in a “multi-part conspiracy to overturn the lawful results of the 2020 Presidential election.”",
    "url": "https://popular.info/p/these-50-companies-have-donated-over"
  },
  {
    "text": "John Eastman, architect of Trump's 2020 election plot, should be disbarred, judge rules  —  Judge Yvette Roland made the recommendation.  —  A California judge on Wednesday recommended the disbarment of John Eastman, calling to revoke the law license of one of Donald Trump's top allies … ",
    "url": "https://www.politico.com/news/2024/03/27/john-eastman-disbarred-00149468"
  },
  {
    "text": "Matt Schlapp's Accuser Was Paid to Drop Sexual Assault Suit  —  EXONERATED?  —  The GOP operative who sued Matt Schlapp over allegations of sexual assault dropped his lawsuit, prompting Schlapp to take a victory lap.  It's more complicated, however.",
    "url": "https://www.thedailybeast.com/matt-schlapps-accuser-was-paid-to-drop-sexual-assault-suit"
  },
  {
    "text": "CNN Exclusive: Conservative bigwig Matt Schlapp agreed to hefty settlement to end sexual assault lawsuit  —  The Republican operative who accused American Conservative Union chairman Matt Schlapp of sexual assault last year received a significant financial settlement in exchange for dropping … ",
    "url": "https://www.cnn.com/2024/03/27/politics/matt-schlapp-settlement-sexual-assault-lawsuit/"
  },
  {
    "text": "How Greene's bid to topple Johnson could blow up the House — or in her own face  —  One House Republican summed up the fear: Her move could “deliver aid to Ukraine” by giving Johnson no choice but to seek common cause with Democrats.  —  Marjorie Taylor Greene's bid to vote … ",
    "url": "https://www.politico.com/news/2024/03/28/marjorie-taylor-greene-mike-johnson-ouster-00149325"
  },
  {
    "text": "COVID-Cautious Americans Feel Abandoned  —  For all of 2020, Alex, a 28-year-old living in New York, followed the U.S. Centers for Disease Control and Prevention's (CDC) COVID-19 guidance “religiously.”  Then, in 2021, something began to shift.  That spring, the CDC said it was okay … ",
    "url": "https://time.com/6960789/covid-19-cautious-americans/"
  },
  {
    "text": "NBC offered Ronna McDaniel a better contract to appear on MSNBC  —  The cable channel was part of the broad push to clinch a contributor deal for McDaniel, whose hiring caused an uproar  —  MSNBC President Rashida Jones participated in recruiting former Republican National Committee chair … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/27/ronna-mcdaniel-nbc-msnbc-contract/"
  },
  {
    "text": "Chris Christie turns down No Labels presidential bid after discussions  —  The decision removes one of the top remaining prospects for the centrist group hoping to upset the two-party system this year with a “unity ticket”  —  Former New Jersey governor Chris Christie (R) … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/27/chris-christie-no-labels-president/"
  },
  {
    "text": "Fugitive US Militant Ammon Bundy Geolocated to Utah  —  In February 2024, American anti-government agitator Ammon Bundy posted a video with a provocative title to his YouTube channel: ‘Want to know where Ammon Bundy is?’  —  Earlier in 2023, Bundy was ordered by an Idaho court to pay … ",
    "url": "https://www.bellingcat.com/news/2024/03/27/fugitive-us-militant-ammon-bundy-geolocated-to-utah/"
  },
  {
    "text": "MyPillow, owned by election denier Mike Lindell, formally evicted from Minnesota warehouse  —  A court ordered the eviction Wednesday of MyPillow from a suburban Minneapolis warehouse that it formerly used, but company founder and prominent election denier Mike Lindell said that it's … ",
    "url": "https://apnews.com/article/mike-lindell-mypillow-eviction-election-denier-11cd7e09f86f1ab03527281e51922730"
  },
  {
    "text": "Biden campaign to bring in massive $25M haul at star-packed fundraiser  —  The money is more than the president's team raised in all of February.  —  President Joe Biden will shatter fundraising records with a star-studded event on Thursday, with his campaign saying that it will bring … ",
    "url": "https://www.politico.com/news/2024/03/28/biden-campaign-fundraiser-00149490"
  },
  {
    "text": "Disney, Florida settle lawsuits over tourism district  —  DeSantis-appointed board ‘eager to work with Disney’; company sees ‘new chapter of constructive engagement’  —  A Gov. Ron DeSantis-backed board and Disney settled lawsuits Wednesday over who controls the governing district of Disney World's theme parks and resorts.",
    "url": "https://www.orlandosentinel.com/2024/03/27/desantis-oversight-board-disney-reach-settlement-in-state-lawsuit/"
  },
  {
    "text": "Trump Attacks R.F.K. Jr., a Third-Party Wild Card  —  Robert F. Kennedy Jr., the independent presidential candidate, has asserted that he intends to be a “spoiler” for both Donald Trump and President Biden.  —  Former President Donald J. Trump attacked Robert F. Kennedy Jr. … ",
    "url": "https://www.nytimes.com/2024/03/27/us/politics/trump-rfk-jr.html"
  },
  {
    "text": "Kari Lake and the Trump movement's billion-dollar defamation problem  —  For the second time in eight months, a top Donald Trump ally has, extraordinarily, declined to try to prove that they didn't defame an election worker.  Arizona Senate candidate Kari Lake (R) has joined former Trump lawyer Rudy Giuliani in that distinction.",
    "url": "https://www.washingtonpost.com/politics/2024/03/27/trump-lake-defamation/"
  },
  {
    "text": "White House ramps up defense of embattled Muslim American judicial nominee  —  First to NBC: Biden's top aides are pushing the Senate to confirm Adeel Mangi to be a U.S. appeals court judge as Sen. Jacky Rosen becomes the third Democrat to oppose him.  —  WASHINGTON — Facing … ",
    "url": "https://www.nbcnews.com/politics/white-house/white-house-defense-muslim-american-judicial-nominee-adeel-mangi-rcna145386"
  },
  {
    "text": "Press Call by Vice President Harris On Artificial Intelligence  —  THE VICE PRESIDENT:  Thank you, Director Young.  And I — I want to thank you for your longstanding leadership to our country.  From your days on Capitol Hill to your leadership here at the White House … ",
    "url": "https://www.whitehouse.gov/briefing-room/speeches-remarks/2024/03/28/press-call-by-vice-president-harris-on-artificial-intelligence/"
  },
  {
    "text": "Trump's Social Media Company Opens New Avenue for Conflicts of Interest  —  Ethics experts say Trump Media, now a publicly traded company, would present a new way for foreign actors or others to influence Donald J. Trump, if he is elected president.  —  When former President Donald J. Trump's … ",
    "url": "https://www.nytimes.com/2024/03/27/us/trump-media-truth-social-campaign.html"
  },
  {
    "text": "In Alabama, Abortion and IVF Helped Flip a Red Seat in a Special Election  —  On Tuesday, Alabama provided even more evidence of what we already know to be true: Abortion rights win elections.  —  Democrat Marilyn Lands won a special election for an Alabama state House seat … ",
    "url": "https://www.motherjones.com/politics/2024/03/marilyn-lands-alabama-special-election-ivf/"
  }
]