[
  {
    "text": "Judge indefinitely delays Trump's classified documents trial in Florida  —  U.S. Judge Aileen M. Cannon said there are too many pre-trial issues to address to set a new trial date now  —  Donald Trump's Florida trial for allegedly mishandling classified documents and obstructing government efforts … ",
    "url": "https://www.washingtonpost.com/national-security/2024/05/07/trump-classified-documents-trial-delayed-cannon-florida/"
  },
  {
    "text": "Trump's federal classified docs trial date postponed indefinitely … - Trump has successfully pushed for delays in multiple criminal trials ahead of November's election.",
    "url": "https://www.axios.com/2024/05/07/trump-classified-documents-trial-date-court"
  },
  {
    "text": "Judge Cannon indefinitely postpones Trump's classified docs trial  —  The date had been widely expected to move amid a tangle of pretrial conflicts between special counsel Jack Smith and Trump's attorneys.  —  The judge presiding over Donald Trump's criminal case in Florida … ",
    "url": "https://www.politico.com/news/2024/05/07/trump-classified-docs-trial-delay-florida-00156680"
  },
  {
    "text": "Stormy Daniels details Trump's sleazy contempt for women  —  It wasn't just “locker room talk.” … Adult actress and director Stormy Daniels testified yesterday about her sexual relationship with Donald Trump.  Trump is on trial for paying off Daniels to prevent her from going public … ",
    "url": "https://www.publicnotice.co/p/stormy-daniels-testimony-trump-access-hollywood"
  },
  {
    "text": "Stormy Daniels testifies, Trump curses in an angry day in court  —  Judge expresses alarm at Trump's cursing amid disturbing testimony about sex.  —  NEW YORK — Stormy Daniels, the adult-film actress at the center of Donald Trump's hush money trial, testified Tuesday about a disturbing sexual encounter … ",
    "url": "https://www.washingtonpost.com/politics/2024/05/07/stormy-daniels-testimony-trump-hush-money-trial/"
  },
  {
    "text": "R.F.K. Jr. Says Doctors Found a Dead Worm in His Brain  —  The presidential candidate has faced previously undisclosed health issues, including a parasite that he said ate part of his brain.  —  Robert F. Kennedy Jr. has emphasized his vitality and relative youth compared with the leading Democratic … ",
    "url": "https://www.nytimes.com/2024/05/08/us/rfk-jr-brain-health-memory-loss.html"
  },
  {
    "text": "Boy Scouts of America to Become Scouting America  —  This rebranding reflects the continuing efforts to welcome everyone to experience the benefits of Scouting  —  The Boy Scouts of America today announced that it will rebrand to Scouting America, reflecting the organization's ongoing commitment … ",
    "url": "https://www.scoutingnewsroom.org/press-releases/boy-scouts-of-america-to-become-scouting-america/"
  },
  {
    "text": "AUTHORITIES IDENTIFY SIXTH VICTIM RECOVERED IN THE COLLAPSE OF THE FRANCIS SCOTT KEY BRIDGE  —  BALTIMORE - Today, Unified Command salvage teams located the sixth victim and promptly notified the Maryland Department of State Police.  —  Maryland State Police investigators along with officers … ",
    "url": "https://www.keybridgeresponse2024.com/post/update-20-authorities-identify-sixth-victim-recovered-in-the-collapse-of-the-francis-scott-key-brid"
  },
  {
    "text": "World's top climate scientists expect global heating to blast past 1.5C target  —  Exclusive: Planet is headed for at least 2.5C of heating with disastrous results for humanity, poll of hundreds of scientists finds  —  Hundreds of the world's leading climate scientists expect global temperatures … ",
    "url": "https://www.theguardian.com/environment/article/2024/may/08/world-scientists-climate-failure-survey-global-temperature"
  },
  {
    "text": "Congressman Collins feels the heat  —  Last Friday, Congressman Mike Collins (R-GA) endorsed the conduct of student counterprotesters at the University of Mississippi.  Collins posted a video on X showing a counterprotester heckling a Black woman by imitating a monkey.",
    "url": "https://popular.info/p/update-congressman-collins-feels"
  },
  {
    "text": "New York Times editor Joe Kahn says defending democracy is a partisan act and he won't do it  —  He had an extraordinary opportunity, upon taking over from Dean Baquet, to right the ship: to recognize that the Times was not warning sufficiently of the threat to democracy presented by a second Trump presidency.",
    "url": "https://presswatchers.org/2024/05/new-york-times-editor-joe-kahn-says-defending-democracy-is-a-partisan-act-and-he-wont-do-it/"
  },
  {
    "text": "TikTok sues U.S. government, saying potential ban violates First Amendment  —  The company argues that invoking national security concerns is not a sufficient reason for restricting free speech.  —  TikTok is suing the United States government in an effort to stop enforcement of a bill passed … ",
    "url": "https://www.nbcnews.com/tech/tech-news/tiktok-sues-us-government-says-ban-violates-first-amendment-rcna151059"
  },
  {
    "text": "Rep. André Carson easily wins primary, but GOP's 7th District choice died in March  —  In Indiana's 7th Congressional District, incumbent André Carson easily won the Democratic nomination Tuesday.  —  Carson had 91% of the vote with all ballots counted.",
    "url": "https://www.indystar.com/story/news/politics/elections/2024/05/07/indiana-7th-congressional-district-election-rep-andre-carson-pierre-pullins-curtis-godfrey/73450862007/"
  },
  {
    "text": "Unexpected warning signs for Trump in busy Indiana primary  —  There were a half-dozen consequential GOP primaries on Tuesday, but Nikki Haley's performance in the already concluded presidential race could be a sign of trouble for Trump in more competitive states.",
    "url": "https://www.politico.com/news/2024/05/07/indiana-primary-unexpected-warning-signs-donald-trump-00156750"
  },
  {
    "text": "Scoop: McCormick PAC launches big ad buy in Pennsylvania Senate race … - The ad promoting the former hedge fund CEO will run for four weeks beginning on cable, broadcast and digital platforms in the Pittsburgh, Scranton, Harrisburg and Johnstown markets.  — McMormick's campaign aims … ",
    "url": "https://www.axios.com/2024/05/08/mccormick-pac-ad-pennsylvania-senate-casey"
  },
  {
    "text": "Biden hits Trump with major Microsoft announcement in Wisconsin … - He'll be taking a not-so-subtle shot at former President Trump in the same location where Trump touted a $10 billion Foxconn facility, which he called the “eighth wonder of the world” seven years ago.",
    "url": "https://www.axios.com/2024/05/08/biden-hits-trump-with-major-microsoft-announcement-in-wisconsin"
  },
  {
    "text": "Biden presses cash, staffing advantage against Trump … - Biden's team also said it would follow its six-week, $30 million ad buy in March and April with a $14 million ad buy in May.  — Trump's campaign and its affiliated super PAC have largely stayed off TV since he became the presumed GOP nominee … ",
    "url": "https://www.axios.com/2024/05/08/biden-presses-cash-advantage-trump-campaign"
  }
]