[
  {
    "text": "Trump allies prepare to infuse ‘Christian nationalism’ in second administration  —  Spearheading the effort is Russell Vought, president of The Center for Renewing America, part of a conservative consortium preparing for Trump's return to power.  —  Russell Vought is president of The Center … ",
    "url": "https://www.politico.com/news/2024/02/20/donald-trump-allies-christian-nationalism-00142086"
  },
  {
    "text": "Oops!  DeSantis says book challenges have gone too far  —  In an extraordinary press conference last week, Florida Governor Ron DeSantis (R) acknowledged that challenges to books in the state's school libraries are out of control.  Over the course of the event, DeSantis blamed teachers … ",
    "url": "https://popular.info/p/oops-desantis-says-book-challenges"
  },
  {
    "text": "Truckers Target Trump-Hating New York Judge  —  A boycott of New York City.  —  Gorodenkoff/Shutterstock  —  F  —  inally.  —  The seriously out-of-control far-leftist Manhattan Supreme Court Justice Arthur Engoron, he who has taken upon his Trump-hating self to fine the former president … ",
    "url": "https://spectator.org/truckers-target-trump-hating-new-york-judge/"
  },
  {
    "text": "Trump Must Pay Half a Billion Dollars Before He Can Appeal New York Decision  —  Former President Donald Trump must pay nearly half a billion dollars as a bond to New York State before he can appeal the ruling by Judge Arthur Engoron last week that he must pay $354 million in fines — over $450 million, with interest — for fraud.",
    "url": "https://www.breitbart.com/politics/2024/02/19/trump-must-pay-half-a-billion-dollars-before-he-can-appeal-new-york-decision/"
  },
  {
    "text": "Trump's Final Hours in Office Were Consumed With Fury at Snoop Dogg  —  Trump's rage at Snoop Dogg created “chaos” in his administration's last moments — and nearly killed clemency for Harry-O … The source of the then-outgoing president's anger had nothing to do with his failed attempts … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trumps-snoop-dogg-pardon-final-hours-president-1234969914/"
  },
  {
    "text": "Biden's reset moment … Officials close to him, needing a repeat triumph, will spend hours on everything from the text to his physical preparation to exploit the prime-time moment.  — “Everyone around him is well aware — well aware — of the need to jack this campaign up,” a source close to Biden said.",
    "url": "https://www.axios.com/2024/02/19/biden-trump-age-state-union-election"
  },
  {
    "text": "Pelosi: Trump comments on Navalny's death ‘beneath the dignity of a human being’  —  Former Speaker Nancy Pelosi (D-Calif.) went after former President Trump on Monday for his response to the death of Russian opposition leader Alexei Navalny, calling Trump's comments “'beneath the dignity of a human being.”",
    "url": "https://thehill.com/homenews/campaign/4477550-pelosi-trump-comments-on-navalnys-death-beneath-the-dignity-of-a-human-being/"
  },
  {
    "text": "Home sweet home?  Donald Trump trounces Nikki Haley in exclusive South Carolina poll  —  Donald Trump is poised to trounce Nikki Haley Saturday in her home state of South Carolina, an exclusive Suffolk University/USA TODAY poll finds, with a yawning advantage that hasn't been diminished … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/02/20/exclusive-poll-donald-trump-nikki-haley-south-carolina/72656833007/"
  },
  {
    "text": "Frozen embryos are children, Ala. high court says in unprecedented ruling  —  The Alabama Supreme Court ruled Friday that frozen embryos are people and someone can be held liable for destroying them, a decision that reproductive rights advocates say could imperil in vitro fertilization (IVF) … ",
    "url": "https://www.washingtonpost.com/politics/2024/02/19/alabama-supreme-court-embryos-children-ivf/"
  },
  {
    "text": "Trump's RNC Takeover Is on the Brink of Becoming a ‘Purge’  —  From top to bottom, the national GOP organization could soon be rid of anyone seen as insufficiently MAGA.  —  First came the internal grumbling about Ronna McDaniel, the chairwoman of the Republican National Committee.",
    "url": "https://www.thedailybeast.com/trumps-rnc-takeover-is-on-the-brink-of-becoming-a-purge"
  },
  {
    "text": "US proposes a ‘temporary ceasefire’ in Gaza in draft UN resolution  —  New York CNN  —  The United States has proposed a United Nations Security Council draft resolution on Gaza calling for a temporary ceasefire in Israel's war against Hamas and warning against an Israeli ground incursion into Rafah … ",
    "url": "https://www.cnn.com/2024/02/19/politics/us-un-security-council-temporary-ceasefire-draft-intl/"
  },
  {
    "text": "Looming testimony of Biden relatives has high stakes for both sides  —  As the president's brother and son prepare to appear before the House, the impeachment inquiry has compiled mostly exonerating statements  —  Eric Schwerin, a key witness for House Republicans in their impeachment inquiry … ",
    "url": "https://www.washingtonpost.com/politics/2024/02/20/biden-impeachment-inquiry-james-hunter-testimony/"
  },
  {
    "text": "New York Times publisher A. G. Sulzberger: “Our industry needs to think bigger”  —  In this exclusive interview, he discusses his role in shaping the paper and preserving its values  —  In early January 1996 journalist Kevin McKenna presented the New York Times' first website to three generations … ",
    "url": "https://reutersinstitute.politics.ox.ac.uk/news/new-york-times-publisher-g-sulzberger-our-industry-needs-think-bigger"
  },
  {
    "text": "The 17th-Century Heretic We Could Really Use Now  —  The Enlightenment philosopher Baruch Spinoza almost died for his ideals one day in 1672.  —  Spinoza, a Sephardic Jew born in Amsterdam in 1632, was a passionate and outspoken defender of freedom, tolerance and moderation.",
    "url": "https://www.nytimes.com/2024/02/20/opinion/baruch-spinoza-free-thought.html"
  },
  {
    "text": "Ex-GOP Lawmaker Sums Up Current Republican Platform With 2 Stinging Words  —  David Jolly also named and shamed the Republican lawmakers who “faceplant on the knee of Donald Trump.”  —  LOADING  —  Former Rep. David Jolly (R-Fla.) on Monday offered a critical take on the GOP's shift in stance on Russia.",
    "url": "https://www.huffpost.com/entry/david-jolly-republicans-follow-trump_n_65d483bfe4b0f7fbe7b4017b"
  },
  {
    "text": "'You're both traitors': Speaker Johnson's thumbs-up photo-op with Trump doesn't go well  —  House Speaker Mike Johnson made his pilgrimage to Mar-a-Lago for a photo-op with former President Donald Trump — but when he took it X Monday, it didn't get the kind of reception he'd hoped.",
    "url": "https://www.rawstory.com/trump-johnson-2667318263/"
  },
  {
    "text": "Wisconsin governor signs new state legislative maps into law, ending a GOP gerrymander  —  The new lines will all but certainly loosen Republicans' grip on power in the swing state's government after more than a decade of dominance.  —  Wisconsin Democratic Gov. Tony Evers on Monday signed … ",
    "url": "https://www.nbcnews.com/politics/elections/wisconsin-new-state-legislative-maps-rcna139477"
  },
  {
    "text": "John Oliver Offers Supreme Court Justice Clarence Thomas $1 Million a Year to Resign  —  John Oliver made Justice Clarence Thomas an offer too good to refuse, but he has 30 days to take a cool million a year — plus a sweet bus — or it goes away.  —  Oliver made the stunning offer at the end … ",
    "url": "https://www.mediaite.com/tv/john-oliver-offers-supreme-court-justice-clarence-thomas-1-million-a-year-to-resign/"
  },
  {
    "text": "Measles erupts in Florida school where 11% of kids are unvaccinated  —  Over 100 children at the school are susceptible to virus.  —  Florida health officials on Sunday announced an investigation into a cluster of measles cases at an elementary school in the Fort Lauderdale area with a low vaccination rate … ",
    "url": "https://arstechnica.com/science/2024/02/measles-erupts-in-florida-school-where-11-of-kids-are-unvaccinated/"
  }
]