[
  {
    "text": "Biden is to meet with Ukraine's Zelenskyy in Paris as Russia leans into its battlefield offensive  —  U.S. President Joe Biden on Friday for the first time publicly apologized to Ukraine for a monthslong congressional holdup in American military assistance that let Russia make gains on the battlefield.",
    "url": "https://apnews.com/article/russia-ukraine-war-biden-zelenskyy-a77546e23fa571eb7f6509d4e14b89b3"
  },
  {
    "text": "Zelenskyy to French lawmakers: ‘Nazism is resurgent’  —  In a speech the day after the 80th anniversary of D-Day, the Ukrainian president leaned heavily on history to highlight the importance of Ukraine's struggle.  —  PARIS — Ukrainian President Volodymyr Zelenskyy compared Ukraine's struggle … ",
    "url": "https://www.politico.eu/article/volodymyr-zelenskyy-french-lawmakers-nazism-resurging-parallels-ukraine-war-d-day/"
  },
  {
    "text": "Netanyahu to address Congress on July 24  —  Israeli Prime Minister Benjamin Netanyahu will address Congress on July 24, a person familiar with the plans, granted anonymity to discuss the matter, confirmed to POLITICO.  The speech comes after the four top congressional leaders … ",
    "url": "https://www.politico.com/live-updates/2024/06/06/congress/netanyahu-speech-congress-israel-00162227"
  },
  {
    "text": "Alex Jones agrees to liquidate his assets to pay Sandy Hook families, in move that would end his ownership of Infowars  —  Right-wing conspiracy theorist Alex Jones on Thursday moved to liquidate his personal assets, agreeing to demands from the families of Sandy Hook victims whom he owes … ",
    "url": "https://www.cnn.com/2024/06/06/media/alex-jones-assets-sandy-hook/"
  },
  {
    "text": "Exclusive: Biden tells Muir he wouldn't pardon son Hunter, says Trump got ‘fair trial’  —  Biden is in Normandy commemorating the 80th anniversary of D-Day.  —  ABC News' David Muir sat down exclusively with President Joe Biden in Normandy, France, on the 80th anniversary of D-Day on June 6, 2024.",
    "url": "https://abcnews.go.com/Politics/biden-tells-muir-wouldnt-pardon-son-hunter/story?id=110904482"
  },
  {
    "text": "'Donald Trump doesn't like America': Ex-GOP pollster writes MAGA movement's obituary  —  Republicans booed and walked out on two former Capitol police officers at the Pennsylvania statehouse, and a former GOP pollster was disgusted by that display of antipathy to American democracy.",
    "url": "https://www.rawstory.com/maga-movement-2668476457/"
  },
  {
    "text": "Playbook: A credibility crisis rocks the WaPo CEO  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  In late April, WILL LEWIS arrived at the former Georgetown home of KATHARINE GRAHAM.  —  Graham was the most revered publisher in the Washington Post's history.",
    "url": "https://www.politico.com/newsletters/playbook/2024/06/07/a-credibility-crisis-rocks-the-wapo-ceo-00162253"
  },
  {
    "text": "Court hears arguments on whether Steve Bannon should be begin prison sentence  —  The former Trump adviser was sentenced to four months in prison for refusing to comply with Jan. 6 Committee subpoenas, but it had been put on hold while he appealed.  —  WASHINGTON — A federal judge … ",
    "url": "https://www.nbcnews.com/politics/justice-department/court-hears-arguments-whether-steve-bannon-begin-prison-sentence-rcna155209"
  },
  {
    "text": "Conservatives tied to Trump want to limit insurance coverage for abortions  —  The proposal could make it more difficult for those with private-employer insurance to get out-of-state abortions, legal experts say.  —  Conservative policymakers influential with former president Donald Trump … ",
    "url": "https://www.washingtonpost.com/business/2024/06/06/abortion-health-insurance-coverage-trump/"
  },
  {
    "text": "Tesla CEO Elon Musk could leave if $56 billion pay package not approved, shareholders warned … Tesla board chair Robyn Denholm is calling on the company's shareholders to approve Elon Musk's massive $56 billion pay package or risk driving the billionaire CEO to greener pastures.",
    "url": "https://www.theverge.com/2024/6/6/24173064/tesla-board-chair-warn-elon-musk-leave-pay-shareholders"
  },
  {
    "text": "Is the US job market beginning to weaken?  Friday's employment report may provide hints  —  America's employers added a vigorous 272,000 jobs in May, accelerating from April and a sign that companies are still confident enough in the economy to keep hiring despite persistently high interest rates.",
    "url": "https://apnews.com/article/jobs-hiring-unemployment-economy-inflation-federal-reserve-d1d73005dbc40b081a555850a44e73d1"
  },
  {
    "text": "Revisiting “the biggest political crime in American history, by far”  —  Remember “Obamagate”?  You should. … It's tough to remember now as Donald Trump regularly wails about the need for total presidential immunity, but four years ago, the then-president was a huge proponent of prosecuting presidents.",
    "url": "https://www.publicnotice.co/p/trump-obamagate-revisited-presidential-immunity"
  },
  {
    "text": "Supreme Court Justice Clarence Thomas accepted gifts worth millions of dollars over 20 years, analysis finds … Supreme Court Justice Clarence Thomas accepted millions of dollars' worth of gifts over the past two decades on the bench, a total nearly 10 times the value of all gifts received … ",
    "url": "https://www.cnbc.com/2024/06/06/supreme-court-justices-millions-dollars-gifts-clarence-thomas.html"
  },
  {
    "text": "Israel strike on UN school that left dozens dead used US munitions, CNN analysis finds  —  Dozens of people were killed by an overnight Israeli airstrike on a United Nations-run school in central Gaza, authorities said, in an attack that CNN analysis found was conducted with a US-made weapon.",
    "url": "https://www.cnn.com/2024/06/06/middleeast/israel-airstrike-un-school-gaza-intl-hnk"
  },
  {
    "text": "DeSantis high court majority: DeSantis can easily oust people's elected prosecutors  —  On a 6-1 vote Thursday, the Florida Supreme Court gave its governor all-but-unfettered power to remove locally elected prosecutors — a power that could quickly render Floridians' “freedom” to “vote” … ",
    "url": "https://www.lawdork.com/p/desantis-worrell-florida-supreme-court"
  },
  {
    "text": "Biden's D-Day Speech Nailed the Threat of Modern Fascism  —  80 YEARS ON  —  Speaking on sacred ground in Normandy, the president correctly drew parallels between America's enemies in World War II and the threats we face domestically and globally today.",
    "url": "https://www.thedailybeast.com/bidens-d-day-speech-nailed-the-threat-of-modern-fascism"
  },
  {
    "text": "The Hunter Biden Case Is Solid.  There's Something Rotten About It Too.  —  WILMINGTON, Delaware — The line between criminal prosecution and public flogging was hard to detect this week when federal prosecutors began their case against Hunter Biden for allegedly buying a gun in 2018 while addicted to drugs.",
    "url": "https://www.politico.com/news/magazine/2024/06/07/hunter-biden-trial-truths-column-00162083"
  },
  {
    "text": "ERO Boston apprehends Colombian national charged with sex crimes against Rhode Island resident  —  PROVIDENCE, R.I. — Enforcement and Removal Operations Boston arrested an unlawfully present Colombian national charged with four counts of sexual assault and one count of assaulting someone with a mental handicap.",
    "url": "https://www.ice.gov/news/releases/ero-boston-apprehends-colombian-national-charged-sex-crimes-against-rhode-island"
  },
  {
    "text": "Milwaukee-based retail giant Kohl's says ‘No’ to sponsoring Republican convention events … Milwaukee based department store giant Kohl's says it will not sponsor any events related to the Republican National Convention in that city this summer, where Donald Trump will be crowned the party's nominee for president.",
    "url": "https://www.cnbc.com/2024/06/06/kohls-donation-trump-republican-national-convention.html"
  },
  {
    "text": "Scoop: Justice Brett Kavanaugh plans legal memoir … - Kavanaugh originally signed a contract with Regnery Publishing, a leading conservative house.  — But after Regnery was sold to Skyhorse Publishing in December, the project moved to the Center Street imprint at Hachette Book Group.",
    "url": "https://www.axios.com/2024/06/06/scotus-brett-kavanaugh-writing-book-memoir"
  },
  {
    "text": "Rishi Sunak apologizes for skipping D-Day event to do TV interview  —  LONDON — Rishi Sunak apologized after he ditched D-Day commemorations in France to do a TV interview instead — sparking a furious backlash.  —  The Conservative prime minister, who is fighting to stay in office ahead … ",
    "url": "https://www.politico.eu/article/uk-rishi-sunak-apologizes-dday-80-years-commemorations-backlash-tv-interview/"
  },
  {
    "text": "New York Democrat congressional candidate suggests MAGA supporters go to ‘re-education camp’  —  Democrat candidate Paula Collins is running against GOP Rep. Elise Stefanik for New York's 21st congressional district  —  EXCLUSIVE: The New York Democratic congressional candidate running … ",
    "url": "https://www.foxnews.com/politics/new-york-democrat-congressional-candidate-suggests-maga-supporters-go-re-education-camp?intcmp=tw_fnc"
  },
  {
    "text": "Why do Republicans stick with Trump?  New study explores the role of white nationalism  —  A new study explores why many Americans, particularly Republican voters, continue to support former President Donald Trump despite serious charges against him.  Researchers found that white nationalism … ",
    "url": "https://www.psypost.org/why-do-republicans-stick-with-trump-new-study-explores-the-role-of-white-nationalism/"
  },
  {
    "text": "Briahna Joy Gray fired from The Hill days after rolling her eyes at sister of Oct. 7 hostage during interview  —  A political commentator was sacked from The Hill — days after rolling her eyes while interviewing the sister of an Israeli abducted on Oct. 7 victim.  —  “It finally happened.",
    "url": "https://nypost.com/2024/06/06/media/briahna-joy-gray-fired-from-the-hill-days-after-rolling-her-eyes-at-sister-of-oct-7-victim-during-interview/"
  },
  {
    "text": "Vermont GOP rules bar it from promoting any candidate who is a ‘convicted felon’  —  The party can vote to exempt a candidate, but it so far appears to be following the rule.  —  The Vermont Republican Party is prohibited from backing a candidate with a felony conviction, according to the party's publicly posted rules.",
    "url": "https://www.nbcnews.com/politics/2024-election/vermont-republican-party-rules-bar-convicted-felon-trump-rcna155918"
  }
]