[
  {
    "text": "F.B.I. Examining Bullet Fragments Found at Trump Rally Site  —  The bureau is assessing what caused the former president's wound during an assassination attempt.  The question has turned political.  —  The F.B.I. is examining numerous metal fragments found near the stage at a campaign rally in Butler … ",
    "url": "https://www.nytimes.com/2024/07/25/us/politics/fbi-bullet-trump-rally.html"
  },
  {
    "text": "Finally Word from the FBI -About The Trump Story The Press Has Refused To Question  —  As you know, I've been on this story for a while: why there was never any law enforcement briefing or qualified medical report on the Butler, PA shooting incident or information of how Donald Trump was injured.",
    "url": "https://talkingpointsmemo.com/edblog/finally-word-from-the-fbi-about-the-trump-story-the-press-has-refused-to-question/sharetoken/af3f7a96-9979-4384-a1cd-ba3189b6bd9d"
  },
  {
    "text": "FBI director questions whether Trump was struck by bullet as ex-prez's team decries ‘conspiracy bulls-t’  —  The head of the FBI made the stunning assertion Wednesday that former President Donald Trump may not have been struck by an actual bullet when a deranged gunman attempted to assassinate … ",
    "url": "https://nypost.com/2024/07/25/us-news/fbi-director-christopher-wray-questions-whether-trump-was-struck-by-bullet/"
  },
  {
    "text": "Elon Musk's transgender daughter, in first interview, says he berated her for being queer as a child  —  In an exclusive interview, Vivian Jenna Wilson said her father's recent statements, including that she is “not a girl,” inspired her to speak out: “I'm not just gonna let that slide.”",
    "url": "https://www.nbcnews.com/tech/tech-news/elon-musk-transgender-daughter-vivian-wilson-interview-rcna163665"
  },
  {
    "text": "Harris Narrows Gap Against Trump, Times/Siena Poll Finds  —  In a survey taken after President Biden stepped aside, Donald Trump and Kamala Harris are locked in a tight race separated by a single percentage point among likely voters.  —  Vice President Kamala Harris begins a 103-day sprint … ",
    "url": "https://www.nytimes.com/2024/07/25/us/politics/poll-kamala-harris-donald-trump.html?unlocked_article_code=1.900.06G-.kJcgU8BhCMl6&smid=url-share"
  },
  {
    "text": "The 2024 Map Just Got a Major Shakeup  —  A white-knuckle ride through the Rust Belt isn't Kamala Harris' only option.  —  Choosing a running mate isn't the only big decision awaiting Vice President Kamala Harris in the 100-day sprint to Election Day.  Her campaign must also chart a course … ",
    "url": "https://www.politico.com/news/magazine/2024/07/25/2024-election-map-harris-00171278"
  },
  {
    "text": "Kamala Harris' stepdaughter responds to ‘childless’ attack from JD Vance: ‘I love my three parents’  —  Ella Emhoff's mother, Kerstin Emhoff, also responded to Vance's 2021 remarks, which referred to the vice president as one of the “childless cat ladies” running the country.",
    "url": "https://www.nbcnews.com/politics/2024-election/kamala-harris-stepdaughter-responds-childless-attack-jd-vance-rcna163673"
  },
  {
    "text": "Justice Kagan calls for a way to enforce Supreme Court ethics code  —  Justice Elena Kagan suggested Chief Justice John G. Roberts Jr. could appoint an outside panel of highly respected judges to review allegations of wrongdoing.  —  SACRAMENTO, Calif. — Justice Elena Kagan said Thursday … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/25/supreme-court-kagan-ethics-code-reform/"
  },
  {
    "text": "Elon Musk's trans daughter Vivian Wilson slams his anti-LGBTQ+ comments as ‘ketamine-fueled haze’  —  Vivian Wilson is fact-checking own father after billionaire Elon Musk made bigoted comments about her gender.  —  The billionaire recently attacked gender-affirming care in an interview … ",
    "url": "https://www.advocate.com/elon-musk-trans-daughter-vivian-wilson"
  },
  {
    "text": "Judge throws out Gateway Pundit's bankruptcy claim  —  The denial paves the way for defamation suits against the site by two Georgia election workers and a former Dominion Voting Systems executive to continue.  —  A federal judge in Florida threw out a bankruptcy case filed by the Gateway Pundit … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/25/judge-throws-out-gateway-pundits-bankruptcy-claim/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzIxODgwMDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzIzMjYyMzk5LCJpYXQiOjE3MjE4ODAwMDAsImp0aSI6ImFkZmJlYTJjLTQ5MjEtNDg3Yy04ODQ0LWRjNDMxMjAxM2JhNiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzA3LzI1L2p1ZGdlLXRocm93cy1vdXQtZ2F0ZXdheS1wdW5kaXRzLWJhbmtydXB0Y3ktY2xhaW0vIn0.w-3lo68b3MMxV8ABadaJv7QxyYPrtTfzUr1uYl0QgbA"
  },
  {
    "text": "Harris says she's ready to debate Trump and accuses him of ‘backpedaling’ from Sept. 10 faceoff  —  Vice President Kamala Harris says she's “ready to debate Donald Trump.”  She accused Trump of “backpedaling” away from a previous agreement for a debate hosted by ABC News on Sept. 10.",
    "url": "https://apnews.com/article/donald-trump-kamala-harris-83872f2a0339044795d2884cfab899c4"
  },
  {
    "text": "U.S. authorities arrest Sinaloa Cartel leaders, including El Chapo's son … - “Fentanyl is the deadliest drug threat our country has ever faced, and the Justice Department will not rest until every single cartel leader, member, and associate responsible for poisoning our communities is held accountable … ",
    "url": "https://www.axios.com/2024/07/26/sinaloa-cartel-leaders-arrested"
  },
  {
    "text": "Future Forward launches a $50 million ad blitz for Harris ahead of DNC  —  Future Forward, the most powerful Democratic-leaning super PAC, has plans to launch a $50 million advertising campaign in several states to introduce voters to Vice President Harris as the party's likely nominee ahead … ",
    "url": "https://thehill.com/homenews/4793913-future-forward-ad-blitz-kamala-harris/"
  },
  {
    "text": "Scoop: House Democrat “absolutely not” committed to voting for Harris … - “That's a positive step in the right direction, I think, from the perspective of the American people. … - But Golden said he is “absolutely not” committing to voting for Harris and is “going to wait … ",
    "url": "https://www.axios.com/2024/07/25/jared-golden-kamala-harris-trump-election"
  },
  {
    "text": "Trump botches Kamala Harris's first name, again and again and again  —  Harris's supporters accuse Trump and other prominent Republicans of intentionally bungling the pronunciation or using it as a racist dog whistle.  —  CHARLOTTE — In his first mention of the likely Democratic presidential nominee … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/25/trump-mispronounces-kamala-harris-name/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzIxODgwMDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzIzMjYyMzk5LCJpYXQiOjE3MjE4ODAwMDAsImp0aSI6IjAzYjU0OWM0LWU2NzQtNDU5My05OTFmLWJlMGY2NWU4NDFjMCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzA3LzI1L3RydW1wLW1pc3Byb25vdW5jZXMta2FtYWxhLWhhcnJpcy1uYW1lLyJ9.xL02PK6tLHoubM3XwqLCmeCakqoJqZC8fcwv9kYMYyU"
  },
  {
    "text": "Flipboard Brings Local News to the Fediverse  —  Has local news ever been more important?  Journalists who live in the communities they serve don't just keep residents informed on everything from wildfires and power outages to new businesses and upcoming events — though that's vital.",
    "url": "https://about.flipboard.com/fediverse/flipboard-brings-local-news-to-the-fediverse/"
  },
  {
    "text": "Fearing a Trump takeover, Justice Department alumni endorse Kamala Harris  —  Former DOJ officials warned in a new letter that the “fabric of the nation, the rule of law and the future of the Democracy are at stake in this election.”  —  For Justice Department employees who had spent weeks contemplating … ",
    "url": "https://www.nbcnews.com/politics/2024-election/justice-department-endorse-kamala-harris-fear-trump-rcna163069"
  },
  {
    "text": "Election 2024: Trump 50%, Harris 43%  —  With Vice President Kamala Harris replacing President Joe Biden as the Democratic Party candidate, former President Donald Trump now leads by seven points in his bid to return to the White House.  —  The latest Rasmussen Reports national telephone … ",
    "url": "https://www.rasmussenreports.com/public_content/politics/biden_administration/election_2024_trump_50_harris_43"
  },
  {
    "text": "Democrats' new line of attack on Republicans?  'You're being weird'  —  “I think it's really elegant in its simplicity,” one Democratic strategist said.  —  Vice President Kamala Harris arrives for an event on the South Lawn of the White House, July 22, 2024, in Washington … ",
    "url": "https://abcnews.go.com/Politics/democrats-new-line-attack-republicans-youre-weird/story?id=112281846"
  },
  {
    "text": "Pentagon panel to review Medals of Honor given to soldiers at the Wounded Knee massacre  —  The Defense Department will review the Medals of Honor that were given to 20 U.S. soldiers for their actions in the 1890 battle at Wounded Knee to make sure their conduct merits such an honorable award.",
    "url": "https://apnews.com/article/pentagon-medals-soldiers-wounded-knee-7c6a7cfd2b2d9ce6b4ce0d9731439cb4"
  },
  {
    "text": "What's fueling Kamala Harris' TikTok surge  —  MEMEABILITY RATINGS — There's a vibe shift brewing on TikTok: The platform, which had been dominated by pro-Trump content, has been exploding with Kamala Harris memes, many of which favorably highlight her quirky demeanor and tie her to the trendiest cool girl anthems.",
    "url": "https://www.politico.com/newsletters/politico-nightly/2024/07/24/whats-fueling-kamala-harris-tiktok-surge-00171024"
  },
  {
    "text": "The Associated Press removes a fact-check claiming JD Vance has not had sex with a couch … As of Thursday morning, the article page displayed a “page unavailable” error message.  —  The fact-check references a few joke social media posts that have been circulating that claim … ",
    "url": "https://www.theverge.com/2024/7/25/24206088/jd-vance-fact-check-sex-couch-rumor-associated-press-retraction"
  }
]