[
  {
    "text": "A Border Security Bill Worth Passing  —  The Senate bill has reforms Trump never came close to getting.  —  Do Republicans want to better secure the U.S. border, or do they want to keep what has become an open sore festering for another year as an election issue?",
    "url": "https://www.wsj.com/articles/senate-border-security-bill-james-lankford-republicans-immigration-biden-border-patrol-asylum-bc2f9543?mod=followamazon"
  },
  {
    "text": "The GOP's True Priority  —  The Republicans who won't take yes for an answer  —  Sometimes, a negotiation produces a deal.  —  Sometimes, a negotiation reveals the truth.  —  Negotiators in the Senate have produced a draft agreement on immigration and asylum.  The deal delivers on Republican priorities.",
    "url": "https://www.theatlantic.com/ideas/archive/2024/02/republicans-congress-immigration-deal/677357/"
  },
  {
    "text": "As a compromise border plan collapses, the GOP is in disarray  —  There can be little doubt that one of the major American political parties is in disarray, but it's not the Democratic Party.  —  For those familiar with online political commentary, the phrase “Dems in disarray” … ",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/compromise-border-plan-collapses-gop-disarray-rcna137424"
  },
  {
    "text": "Border-for-Ukraine deal on life support as GOP opposition mounts  —  House speaker calls it ‘DEAD’ while GOP senators start to defect en masse ahead of Wednesday vote  —  A bipartisan package of border reforms and funding for Ukraine and Israel appeared close to collapse on Monday … ",
    "url": "https://www.washingtonpost.com/politics/2024/02/05/republican-opposition-mounts-border-for-ukraine-deal/"
  },
  {
    "text": "In Huge Reversal, GOP Poised To Kill The Border-Ukraine Package It Demanded  —  Republican Sen. James Lankford, who spent months negotiating the border provisions the GOP demanded, said he may vote against his own bill this week.  —  LOADING  —  WASHINGTON ― Senate Republicans … ",
    "url": "https://www.huffpost.com/entry/border-deal-republicans-ukraine_n_65c18950e4b093b2e780ac30"
  },
  {
    "text": "Democrats are trying to pass a right-wing border bill, but the GOP won't let them  —  Senate negotiations revealed what some Democrats are willing to give up on immigration in 2024.  —  A bipartisan group of Senate negotiators has reached a $118 billion deal that trades sweeping border security measures … ",
    "url": "https://www.vox.com/politics/2024/2/5/24062710/senate-immigration-bill-border-security-ukraine-2024"
  },
  {
    "text": "Trump Now Falsely Claims He Didn't Endorse Immigration Bill Co-Author  —  Oklahoma Senator James Lankford, who helped draw up the immigration bill that Trump hates, received Trump's “Complete and Total Endorsement” in 2022.  —  Donald Trump said during an interview Monday that he did not endorse … ",
    "url": "https://www.thedailybeast.com/trump-now-falsely-claims-he-didnt-endorse-immigration-bill-co-author-james-lankford"
  },
  {
    "text": "Nikki Haley Asks for Secret Service Protection After Increase in Threats  —  Former South Carolina governor is final hurdle between Trump and the Republican presidential nomination  —  AIKEN, S. C.—Republican presidential candidate Nikki Haley has applied for Secret Service protection … ",
    "url": "https://www.wsj.com/politics/elections/nikki-haley-asks-for-secret-service-protection-after-increase-in-threats-05b67a22?mod=followamazon"
  },
  {
    "text": "Trump says he wants to debate Biden  —  The Republican National Committee decided in 2022 to withdraw from the quadrennial events set up by the Commission on Presidential Debates.  —  Former President Donald Trump said Monday that he wants to debate President Joe Biden ahead of November's general election.",
    "url": "https://www.nbcnews.com/politics/2024-election/donald-trump-says-wants-debate-joe-biden-rcna137340"
  },
  {
    "text": "Biden appears to mix up Macron with French president Mitterrand, who died in 1996  —  President Biden on Sunday appeared to mix up French President Emmanuel Macron with Francois Mitterrand, the former president of France who died in 1996.  —  The apparent mix-up took place during … ",
    "url": "https://thehill.com/homenews/administration/4449805-biden-appears-to-mix-up-macron-with-french-president-mitterrand-who-died-in-1996/"
  },
  {
    "text": "King Charles III diagnosed with cancer, Buckingham Palace says  —  King Charles has been diagnosed with a form of cancer, says Buckingham Palace.  —  The type of cancer has not been revealed - it is not prostate cancer, but was discovered during his recent treatment for an enlarged prostate.",
    "url": "https://www.bbc.com/news/uk-68208157"
  },
  {
    "text": "Senate Investigation “Casts Fresh Doubt” About the Validity of Harlan Crow's Yacht Tax Deductions  —  In their extensive probe, Senate investigators found evidence to suggest Crow has made repeated misrepresentations to the U.S. government.  ProPublica revealed the tax maneuvers in a previous story.",
    "url": "https://www.propublica.org/article/senate-probe-casts-doubt-harlan-crow-yacht-tax-deductions"
  },
  {
    "text": "Proposed Wage Theft Legislation Would Strip Violators of Their Ability to Do Business in New York  —  “We did not have the data to understand the scale of the issue in New York State until the ProPublica and Documented series came out last year,” state Sen. Jessica Ramos said.  —  Co-published with Documented",
    "url": "https://www.propublica.org/article/wage-theft-law-new-york-violators-doing-business"
  },
  {
    "text": "Kari Lake's leaked recording is causing trust issues in the Arizona GOP  —  The Senate candidate was booed by the party faithful after a secret tape forced out the party chair.  Republican officials say they assume they are being recorded when speaking with her.",
    "url": "https://www.washingtonpost.com/politics/2024/02/06/kari-lake-recording/"
  },
  {
    "text": "Chris Christie predicts ‘huge personnel problem’ if Trump is reelected to ‘vendetta presidency’  —  In an exclusive interview, the former governor warned of “absolute mayhem.”  —  Former New Jersey Governor and Republican presidential candidate Chris Christie speaks with George Stephanopoulos from ABC News, Feb. 5, 2024.",
    "url": "https://abcnews.go.com/Politics/chris-christie-predicts-huge-personnel-problem-trump-reelected/story?id=106971895"
  },
  {
    "text": "Why Jack Smith wants to ‘clear the air’ in the classified documents case  —  Donald Trump “paints an inaccurate and distorted picture of events,” the special counsel tells Judge Aileen Cannon.  Will she care?  —  Though the classified documents case is playing out partly behind closed doors … ",
    "url": "https://www.msnbc.com/deadline-white-house/deadline-legal-blog/trump-classified-documents-case-jack-smith-filing-rcna137310"
  }
]