[
  {
    "text": "Live updates Jordan failing to secure votes needed for speaker on second ballot  —  With a roll-call vote underway, Rep. Jim Jordan (R-Ohio) is failing to secure the votes he would need to be elected speaker on a second ballot.  On Tuesday, 20 members of his own party refused to back him.",
    "url": "https://www.washingtonpost.com/politics/2023/10/18/house-speaker-vote/"
  },
  {
    "text": "Republicans Fear Jordan Speaker Bid Could Cost Them House Majority  —  Nearly 200 G.O.P. lawmakers have supported Representative Jim Jordan, the hard-right Ohio lawmaker, in the speaker fight.  Some Republicans say that may doom the party in coming elections.",
    "url": "https://www.nytimes.com/2023/10/18/us/politics/republicans-speaker-jim-jordan-democrats-elections.html"
  },
  {
    "text": "Speaker McHenry  —  If the House Republicans cannot resolve the speakership in the next few days, they may be better off empowering Speaker Pro Tempore Patrick McHenry to run the House through at least the end of the year.  —  by Newt Gingrich  —  The second effort to replace Speaker Kevin McCarthy just ended in failure.",
    "url": "https://www.gingrich360.com/2023/10/17/speaker-mchenry/"
  },
  {
    "text": "'I Couldn't Shift Anything': Senior State Department Official Resigns Over Biden's Gaza Policy  —  Josh Paul, who spent a decade in State's bureau overseeing arms sales, exclusively spoke with HuffPost after quitting over the U.S. approach to the Israel-Palestine conflict.",
    "url": "https://www.huffpost.com/entry/state-department-resignation-gaza_n_65306079e4b00565b622b1fb"
  },
  {
    "text": "Donald Trump told to keep volume down after getting animated at New York civil fraud trial  —  A judge warned Donald Trump and others at his New York civil fraud trial to keep their voices down Wednesday after the former president threw up his hands in frustration and spoke aloud to his lawyers … ",
    "url": "https://apnews.com/article/donald-trump-letitia-james-fraud-lawsuit-new-york-dd10ecf8bdc4cbf8c17990cc4f40ce9b"
  },
  {
    "text": "Trump Lawyer Acknowledged Political Agenda in Election Suit, Emails Show  —  Kenneth Chesebro said that even long-shot litigation would hold political advantages, undercutting assertions that Donald J. Trump's lawyers were simply providing legal advice in challenging the 2020 results.",
    "url": "https://www.nytimes.com/2023/10/18/us/politics/kenneth-chesebro-trump-2020-election.html"
  },
  {
    "text": "Social Media Influencer Douglass Mackey Sentenced after Conviction for Election Interference in 2016 Presidential Race  —  For Immediate Release  —  U.S. Attorney's Office, Eastern District of New York  —  Defendant Attempted to Trick Voters Into Believing They Could Vote By Text Message",
    "url": "https://www.justice.gov/usao-edny/pr/social-media-influencer-douglass-mackey-sentenced-after-conviction-election"
  },
  {
    "text": "Social media influencer charged with election interference in 2016 sentenced to prison  —  Social media influencer Douglass Mackey was sentenced to seven months in prison on Wednesday for interfering with the 2016 election.  —  The Justice Department announced Wednesday that Mackey … ",
    "url": "https://thehill.com/regulation/court-battles/4263396-election-interference-2016-social-media-influencer-sentenced-prison/"
  },
  {
    "text": "Hundreds arrested after Pro-Palestinian demonstrators flood Cannon Rotunda, Capitol complex  —  WASHINGTON - A pro-Palestinian protest is underway on Capitol Hill as demonstrators are occupying the Cannon Rotunda and large crowds are growing around the Capitol complex.",
    "url": "https://www.fox5dc.com/news/pro-palestinian-protest-underway-at-capitol-rotunda-uscp-detains-some-demonstrators-israel-hamas-war-capitol-hill-jewish-voices-for-peace"
  },
  {
    "text": "Dems consider McHenry  —  Presented by With assists from POLITICO's Congress team  —  TICK TOCK: The government will shut down in 30 days if Congress can't pass a funding patch ... and it's day 15 of the House not having a speaker.  —  MCHENRY SUPPORT GROWS ... WITH DEMS",
    "url": "https://www.politico.com/newsletters/huddle/2023/10/18/dems-consider-mchenry-00122324"
  },
  {
    "text": "Trump Told Mitt Romney's Son He Would ‘Drop’ Melania: Book  —  An excerpt from Romney: A Reckoning details some of the Utah senator's first encounters with the former president  —  IN A NEW biography of Sen. Mitt Romney, Romney: A Reckoning by McKay Coppins, the Atlantic staff writer claims … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-bragged-drop-melania-romney-1234856364/"
  },
  {
    "text": "'It's not been enough to carry the day': Why the Victoria's Secret rebrand is over  —  Editor's Note: This article was originally published by Business of Fashion, an editorial partner of CNN  —  The radical transformation of Victoria's Secret is over.  —  The American lingerie chain … ",
    "url": "https://www.cnn.com/style/why-victorias-secret-is-bringing-sexy-back-bof/"
  },
  {
    "text": "At Least A Quarter Of A Million People Were Arrested For Weed Last Year, FBI Says  —  The FBI reported 227,108 arrests related to cannabis, which is legal in 23 states.  —  LOADING  —  Police made more than a quarter of a million arrests for weed-related offenses in 2022 … ",
    "url": "https://www.huffpost.com/entry/police-make-quarter-of-a-million-weed-arrests_n_65304ea4e4b03b213b087ddd"
  },
  {
    "text": "Cornel West draws max donation from GOP megadonor Harlan Crow  —  The professor is challenging President Joe Biden from the left in the 2024 presidential election, running as an independent after dropping a Green Party bid.  —  Progressive activist and independent presidential candidate Cornel West received … ",
    "url": "https://www.nbcnews.com/meet-the-press/meetthepressblog/cornel-west-draws-max-donation-gop-megadonor-harlan-crow-rcna121060"
  },
  {
    "text": "Los Angeles newscaster Christina Pascucci announces California Senate bid  —  Los Angeles newscaster Christina Pascucci announced Wednesday morning that she is running for the U.S. Senate vacancy created by the death of Dianne Feinstein.  —  The 38-year-old Democrat is the latest entrant … ",
    "url": "https://www.latimes.com/politics/story/2023-10-18/los-angeles-newscaster-christina-pascucci-senate-schiff-porter-lee-garvey-feinstein"
  },
  {
    "text": "Maddow: Trump Wants ‘MSNBC on Trial ... So that He Can Execute Us’  —  The incendiary language from MSNBC host Rachel Maddow was one of the things that inspired James T. Hodgkinson's attempted assassination of multiple congressional Republicans at a baseball practice in 2017.",
    "url": "https://www.newsbusters.org/blogs/nb/nicholas-fondacaro/2023/10/18/maddow-trump-wants-msnbc-trial-so-he-can-execute-us"
  },
  {
    "text": "Biden would lose in matchup vs. Trump, according to CNBC survey; Israel funding has strong support  — President Joe Biden's approval rating fell to just 37%, according to CNBC's All-America Economic Survey.  It's the second lowest approval rating of Biden's presidency.",
    "url": "https://www.cnbc.com/2023/10/18/biden-would-lose-in-match-up-vs-trump-according-to-cnbc-survey-israel-funding-has-strong-support.html"
  },
  {
    "text": "The 2024 Presidential Contest  —  NPR/PBS NewsHour/Marist National Poll  —  Biden and Trump Competitive in Potential 2024 Matchup... Biden Benefits in Three-Way Contest with RFK Jr.  —  In a potential presidential re-match, President Joe Biden and former President Donald Trump remain competitive … ",
    "url": "https://maristpoll.marist.edu/polls/the-2024-presidential-contest/"
  },
  {
    "text": "EPA takes step toward regulating small aircraft emissions  —  The Environmental Protection Agency announced Wednesday that it has found emissions from small planes run on leaded fuel can cause and contribute to air pollution, posing a danger to public health, a finding that marks a significant step toward regulation.",
    "url": "https://www.washingtonexaminer.com/policy/energy-environment/epa-takes-step-toward-regulating-small-aircraft-emissions"
  }
]