[
  {
    "text": "Hegseth Orders Navy to Strip Name of Gay Rights Icon Harvey Milk from Ship  —  Defense Secretary Pete Hegseth has ordered the Navy to take the rare step of renaming a ship, one that bears the name of a gay rights icon, documents and sources show.  —  Military.com reviewed a memorandum … ",
    "url": "https://www.military.com/daily-news/2025/06/03/hegseth-orders-navy-strip-name-of-gay-rights-icon-harvey-milk-ship.html"
  },
  {
    "text": "Navy set to rename USNS Harvey Milk, mulls new names for other ships named for civil rights leaders  —  Washington — The U.S. Navy plans to rename the USNS Harvey Milk, a fleet replenishment oiler named after the slain gay rights leader and Navy veteran, and is considering renaming multiple naval ships named … ",
    "url": "https://www.cbsnews.com/news/navy-new-name-usns-harvey-milk-ships-named-for-civil-rights-leaders/"
  },
  {
    "text": "Hegseth orders renaming of ship named after gay rights icon Harvey Milk  —  Secretary of Defense Pete Hegseth has ordered the secretary of the Navy to rename the oiler ship USNS Harvey Milk, according to a defense official.  —  The ship, which was launched in 2021 and named after the gay rights activist … ",
    "url": "https://cnn.com/2025/06/03/politics/hegseth-orders-renaming-ship-named-harvey-milk"
  },
  {
    "text": "Hegseth moves to rename Navy ship honoring gay rights icon Harvey Milk  —  The directive could be expanded to include other military vessels named for prominent American civil rights figures, said people familiar with internal discussions.  —  The Pentagon is making plans to strip the name … ",
    "url": "https://www.washingtonpost.com/national-security/2025/06/03/harvey-milk-navy-hegseth-civil-rights/"
  },
  {
    "text": "Hegseth orders Navy to rename ship honoring gay rights activist Harvey Milk  —  A DOD official said the decision's timing, during Pride month, was intentional.  —  The John Lewis-class replenishment oiler USNS Harvey Milk (T-AO-206) conducts a replenishment at sea, Dec. 13, 2024.  —  MC2 Maxwell Orlosky/Dvids",
    "url": "https://abcnews.go.com/Politics/hegseth-orders-navy-rename-ship-honoring-gay-rights/story?id=122460707"
  },
  {
    "text": "Elon Musk Calls Trump Megabill a ‘Disgusting Abomination’  —  Billionaire sides with GOP critics who say measure doesn't cut spending enough  —  WASHINGTON—Former White House cost-cutting czar Elon Musk called President Trump's “big, beautiful” tax and spending package a “disgusting abomination … ",
    "url": "https://www.wsj.com/politics/policy/elon-musk-trump-republican-tax-spending-bill-b4dd9a3b?st=nGhfyn"
  },
  {
    "text": "MTG Admits She Didn't Read Trump Mega Bill She Voted For  —  Diehard MAGA Rep. Marjorie Taylor Greene said she wished she had not voted for President Donald Trump's “One Big, Beautiful” spending bill, explaining that she wasn't aware of its contents.  “Full transparency … ",
    "url": "https://www.thedailybeast.com/marjorie-taylor-greene-admits-she-didnt-read-trump-mega-bill-she-voted-for/"
  },
  {
    "text": "‘Disgusting abomination’: Elon Musk tears into Trump megabill  —  Billionaire Elon Musk ramped up his criticism of the megabill of President Trump's tax cut and spending priorities, calling the legislation a “disgusting abomination.”  —  “I'm sorry, but I just can't stand it anymore.",
    "url": "https://thehill.com/policy/technology/5330697-elon-musk-trump-big-beautiful-bill-congress/"
  },
  {
    "text": "Trump asks Congress to wipe out funding for public broadcasting  —  President Trump took yet another step Tuesday to place NPR and PBS at the center of his broader clash with major cultural institutions, formally asking Congress to take back the $1.1 billion it has set aside for all public broadcasters for the next two years.",
    "url": "https://www.npr.org/2025/06/03/nx-s1-5418080/pbs-npr-trump-rescission-public-broadcasting"
  },
  {
    "text": "Democrats Will Hand Out Free Tacos to Mock Trump  —  The Democratic Party has commissioned a taco truck to serve free lunch outside the Republican National Committee's DC headquarters beginning at noon on Tuesday. … The giveaway is not just to mark taco Tuesday, says a Democratic National Committee staffer … ",
    "url": "https://www.motherjones.com/politics/2025/06/taco-truck-donald-trump-always-chickens-out/"
  },
  {
    "text": "Scoop: DNC rents taco truck to mock Trump on ‘TACO’ slogan  —  The Democratic National Committee is commandeering a taco truck to mock Trump's apparent fury at the slogan “Trump Always Chickens Out,” or “TACO,” Axios has learned.  —  Why it matters: Democrats clearly think they have found a way to get under the president's skin.",
    "url": "https://www.axios.com/2025/06/03/donald-trump-taco-truck-dnc-always-chickens-out"
  },
  {
    "text": "Trump administration revokes guidance requiring hospitals to provide emergency abortions  —  The Trump administration announced on Tuesday that it would revoke guidance to the nation's hospitals that directed them to provide emergency abortions for women when they are necessary to stabilize their medical condition.",
    "url": "https://apnews.com/article/abortion-emtala-biden-trump-emergency-hospital-3640bff165dac1d28b91e8adee7e47dd"
  },
  {
    "text": "Boulder suspect's family detained by ICE, set for expedited removal, Kristi Noem says  —  Family members of the man charged with Sunday's attack in Boulder, Colorado, have been taken into custody, Department of Homeland Security Secretary Kristi Noem said Tuesday.",
    "url": "https://www.cbsnews.com/news/boulder-suspects-family-detained-ice-expedited-removal-kristi-noem-says/"
  },
  {
    "text": "2 Chinese nationals charged with smuggling ‘potential agroterrorism’ fungus into US: DOJ  —  Authorities said it was in connection with work at the University of Michigan.  —  This photo released by the U.S. District Court for the Eastern District of Michigan shows what authorities … ",
    "url": "https://abcnews.go.com/Politics/2-chinese-nationals-charged-smuggling-potential-agroterrorism-fungus/story?id=122454213"
  },
  {
    "text": "Trump Wants to Cut Tribal College Funding by Nearly 90%, Putting Them at Risk of Closing  —  ProPublica found that Congress was underfunding tribal colleges by a quarter-billion dollars per year.  Rather than fixing the problem, proposed federal funding cuts unveiled this week would devastate the schools, tribal education leaders say.",
    "url": "https://www.propublica.org/article/tribal-colleges-universities-trump-cuts-funding"
  },
  {
    "text": "Kennedy Center subscription sales fall 36 percent from previous year  —  Sales for ticket packages across all genres are down about $1.6 million year over year, a window into the arts center's challenges following President Donald Trump's takeover.  —  Sales of subscriptions for the coming season … ",
    "url": "https://www.washingtonpost.com/entertainment/theater/2025/06/03/kennedy-center-subscription-sales-decline/"
  },
  {
    "text": "Denouncing Antisemitism, Trump Also Fans Its Flames  —  President Trump's effort to punish Harvard over antisemitism is complicated by his extensive history of amplifying white supremacist figures and symbols.  —  In the Oval Office one day last week, President Trump renewed his no-holds-barred attack … ",
    "url": "https://www.nytimes.com/2025/06/03/us/politics/trump-antisemitism.html?unlocked_article_code=1.ME8.qfI8.87KAzNfDdWyH&smid=bs-share"
  },
  {
    "text": "From the TEA Party to the Democratic Party  —  Three words I never thought I'd ever utter: I'm a Democrat.  This former Republican Congressman, former Republican candidate for President, this former TEA Party champion is formally joining the Democratic Party.  The stakes are simply too high to NOT become a Democrat.",
    "url": "https://socialcontractwithjoewalsh.substack.com/p/from-the-tea-party-to-the-democratic"
  },
  {
    "text": "The Washington Post Plans an Influx of Outside Opinion Writers  —  A new program, known internally as Ripple, would open The Post to journalists at other publications and influential writers on Substack.  —  The Washington Post has published some of the world's most influential voices … ",
    "url": "https://www.nytimes.com/2025/06/03/business/media/washington-post-opinion-ripple.html?unlocked_article_code=1.ME8.yzj8.AuF2bnwSme6h&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Google's New AI Tool Generates Convincing Deepfakes of Riots, Conflict, and Election Fraud  —  Google's recently launched AI video tool can generate realistic clips that contain misleading or inflammatory information about news events, according to a TIME analysis and several tech watchdogs.",
    "url": "https://time.com/7290050/veo-3-google-misinformation-deepfake/"
  },
  {
    "text": "Exclusive: CDC expert resigns from COVID vaccines advisory role, sources say  —  Pediatric infectious disease expert Dr. Lakshmi Panagiotakopoulos of the U.S. CDC resigned on Tuesday as co-leader of a working group that advises outside experts on COVID-19 vaccines and is leaving the agency … ",
    "url": "https://www.reuters.com/business/healthcare-pharmaceuticals/cdc-expert-resigns-covid-vaccines-advisory-role-sources-say-2025-06-03/"
  },
  {
    "text": "Trump privately complains about Amy Coney Barrett and other Supreme Court justices he nominated  —  President Donald Trump has privately complained that the Supreme Court justices he appointed have not sufficiently stood behind his agenda, according to multiple sources familiar with the conversations.",
    "url": "https://cnn.com/2025/06/03/politics/amy-coney-barrett-justice-trump"
  },
  {
    "text": "Rep. Jasmine Crockett Officially Announces Candidacy for Ranking Member of House Committee on Oversight and Government Reform  —  WASHINGTON - Today, Congresswoman Jasmine Crockett officially announced that she is running to serve as Ranking Member of the House Committee on Oversight and Government Reform.",
    "url": "https://crockett.house.gov/media/press-releases/rep-jasmine-crockett-officially-announces-candidacy-ranking-member-house"
  },
  {
    "text": "UPDATED: Trump to launch branded crypto trading application  —  Trump to launch branded crypto trading application  —  Listen to me read this post here (not an AI-generated voice!), subscribe to the feed in your podcast app, or download the recording for later.",
    "url": "https://www.citationneeded.news/trump-crypto-wallet/"
  },
  {
    "text": "Trump official who shut down counter-Russia agency has links to Kremlin  —  Darren Beattie, who alarmed the State Department with his pro-Moscow views, is married to a woman whose uncle has ties to Vladimir Putin  —  A senior official who dismantled the US government's Russian disinformation unit … ",
    "url": "https://www.telegraph.co.uk/us/news/2025/06/03/trump-official-shut-russia-propaganda-unit-kremlin-ties/"
  },
  {
    "text": "As the Trump Administration Slashes Federal Spending, Scientists Consider Leaving the U.S.  —  “My whole team, including those who were eager to apply for more permanent positions in the U.S., have no more interest,” he said.KT Kanazawich for The New York Times",
    "url": "https://www.nytimes.com/2025/06/03/us/trump-federal-spending-grants-scientists-leaving.html?unlocked_article_code=1.ME8.3jjH.HvyxcdgtxpRw"
  },
  {
    "text": "Bakersfield girl who faced deportation and loss of lifesaving medical care is allowed to stay in U.S.  —  WASHINGTON — The family of a 4-year-old Bakersfield girl with a rare medical condition has been granted humanitarian protection from deportation, allowing her to continue receiving lifesaving treatment in the United States.",
    "url": "https://www.latimes.com/california/story/2025-06-03/bakersfield-girl-who-faced-deportation-loss-of-lifesaving-medical-care-granted-humanitarian-parole"
  },
  {
    "text": "‘Half the tree of life’: ecologists' horror as nature reserves are emptied of insects  —  A new point in history has been reached, entomologists say, as climate-led species' collapse moves up the food chain even in supposedly protected regions free of pesticides  —  The age of extinction is supported by",
    "url": "https://www.theguardian.com/environment/2025/jun/03/climate-species-collapse-ecology-insects-nature-reserves-aoe"
  },
  {
    "text": "Fetterman's chief of staff leaves amid string of departures  —  Pennsylvania Sen. John Fetterman's chief of staff is leaving her post, two people familiar with the matter confirmed to POLITICO on Tuesday.  The move is yet another key departure for a congressional office that's been marked … ",
    "url": "https://www.politico.com/news/2025/06/03/fetterman-chief-of-staff-departs-00382848"
  },
  {
    "text": "Joni Ernst's Medicaid Quip Could Cost Iowa GOP  —  Up until now, Iowa has been the poster state for Donald Trump's alleged electoral revolution.  Prior to Trump's first race, it went Democratic in six of the seven presidential elections (and went Republican only by an eyelash in the other).",
    "url": "https://nymag.com/intelligencer/article/joni-ernsts-medicaid-quip-could-cost-iowa-gop.html"
  },
  {
    "text": "Defendant accused of faking Trump death threats so witness would be deported  —  Demetric Deshawn Scott wrote letters threatening to kill President Donald Trump, in an attempt to get Ramón Morales Reyes deported, Wisconsin prosecutors said.  —  A Wisconsin man is facing charges … ",
    "url": "https://www.washingtonpost.com/immigration/2025/06/03/trump-threat-letters-wisconsin-migrant-morales-reyes/"
  },
  {
    "text": "Troop Casualties in Ukraine War Near 1.4 Million, Study Finds  —  With high casualty figures and the slow pace of Russia's territorial gains, President Vladimir V. Putin could face years more of a grinding war of attrition in Ukraine.  —  Nearly one million Russian troops have been killed … ",
    "url": "https://www.nytimes.com/2025/06/03/us/politics/russia-ukraine-troop-casualties.html"
  },
  {
    "text": "The Senate's stablecoin bill risks repeating past legislative mistakes  —  In 2000, various forms of over-the-counter derivatives were emerging fast into the financial mainstream, and Congress passed the Commodity Futures Modernization Act, or CFMA, which purported to encourage financial innovation … ",
    "url": "https://www.americanbanker.com/opinion/the-senates-stablecoin-bill-risks-repeating-past-legislative-mistakes"
  },
  {
    "text": "Bowser hit with ethics complaint over travel paid for by Qatar  —  Washington, D.C., Mayor Muriel Bowser faces a possible investigation over her alleged acceptance of lavish gifts from Qatar during several trips.  —  A complaint filed by the Foundation for Accountability and Civic Trust … ",
    "url": "https://www.washingtonexaminer.com/news/justice/3429846/muriel-bowser-qatar-ethics-complaint-travel-paid/"
  },
  {
    "text": "ACOSTA, TROYE, FANONE EPIC TOWN HALL WITH ROSIE O'DONNELL AND JASMINE CROCKETT, AARON PARNAS, HARRY DUNN AND MANY MORE  —  Jim Acosta, Olivia of Troye, Michael Fanone, and 8 others  —  #EPIC: JIM ACOSTA SHOW DC TOWN HALL WITH ⁨Rep. Jasmine Crockett, ROSIE ODONNELL, Olivia of Troye, & Michael Fanone!",
    "url": "https://jimacosta.substack.com/p/acosta-troye-fanone-epic-town-hall"
  },
  {
    "text": "Texas man arrested and accused of trespassing at Mar-a-Lago told police he wanted to ‘marry Kai’  —  Anthony Reyes told law enforcement that he wanted to “marry Kai,” according to a police report.  Kai is the name of the president's 18-year-old granddaughter.",
    "url": "https://www.nbcnews.com/politics/donald-trump/texas-man-arrested-trespassing-mar-lago-told-police-wanted-spread-gosp-rcna210751"
  }
]