[
  {
    "text": "Exclusive: How the White House defied a judge's order to turn back deportation flights  —  The Trump administration says it ignored a Saturday court order to turn around two planeloads of alleged Venezuelan gang members because the flights were over international waters and therefore the ruling didn't apply … ",
    "url": "https://www.axios.com/2025/03/16/trump-white-house-defy-judge-deport-venezuelans"
  },
  {
    "text": "Trump administration deports hundreds of immigrants even as a judge orders their removals be stopped  —  The Trump administration has transferred hundreds of immigrants to El Salvador even as a federal judge issued an order temporarily barring the deportations under an 18th century wartime … ",
    "url": "https://apnews.com/article/trump-venezuela-el-salvador-immigration-dd4f61999f85c4dd8bcaba7d4fc7c9af"
  },
  {
    "text": "US deports hundreds of Venezuelans despite court order  —  A plane carrying more than 200 Venezuelans deported by the US has landed in El Salvador, hours after a US judge ordered the Trump administration not to do so.  —  El Salvador's president, Nayib Bukele, wrote on social media … ",
    "url": "https://www.bbc.com/news/articles/cp9yv1gnzyvo"
  },
  {
    "text": "Trump sends more than 200 alleged gang members to prison in El Salvador  —  The administration won't identify those moved — or say whether the Alien Enemies Act, which briefly sped up some deportations, played any role.  —  Over a weekend when President Donald Trump secretly invoked … ",
    "url": "https://www.washingtonpost.com/immigration/2025/03/16/alien-enemies-act-venezuela-el-salvador-prison/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQyMDk3NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQzNDc5OTk5LCJpYXQiOjE3NDIwOTc2MDAsImp0aSI6IjdlOTBmYWMyLTRhZTEtNDg1Ni04NGQ5LTEyNzBiMTNhN2VjMCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9pbW1pZ3JhdGlvbi8yMDI1LzAzLzE2L2FsaWVuLWVuZW1pZXMtYWN0LXZlbmV6dWVsYS1lbC1zYWx2YWRvci1wcmlzb24vIn0.0DzWBSBtwDogi18cAdtr-e99_x6yYrgy1DO8fAxc8-I&itid=gfta"
  },
  {
    "text": "132. Five Questions About Trump's Alien Enemy Act Proclamation  —  [An edited version of this post also appears at Just Security.]  —  Welcome back to “One First,” an (increasingly frequent) newsletter that aims to make the U.S. Supreme Court more accessible to all of us.",
    "url": "https://www.stevevladeck.com/p/132-five-questions-about-trumps-alien"
  },
  {
    "text": "Democratic Party hits new polling low, while its voters want to fight Trump harder  —  Unlike in Trump's first term, Democratic voters say 2-to-1 they want party leaders to fight rather than compromise, even at the risk of not getting things done, per the NBC News poll.",
    "url": "https://www.nbcnews.com/politics/politics-news/democratic-party-hits-new-polling-low-voters-want-fight-trump-harder-rcna196161"
  },
  {
    "text": "Chuck Schumer on Democrats, Antisemitism and His Shutdown Retreat  —  Philip Montgomery for The New York Times  —  It has been quite a week for Chuck Schumer.  When I spoke to the Senate minority leader on Monday, we talked about a lot of things: the direction of his party … ",
    "url": "https://www.nytimes.com/2025/03/16/magazine/chuck-schumer-interview.html?unlocked_article_code=1.4U4.a_Nh.s7z6d3rD9zaE&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "CNN Poll: Democratic Party's favorability drops to a record low  —  The Democratic Party's favorability rating among Americans stands at a record low, according to a new CNN poll conducted by SSRS, fueled in part by dimming views from its own frustrated supporters.",
    "url": "https://www.cnn.com/2025/03/16/politics/cnn-poll-democrats"
  },
  {
    "text": "Doctor and Professor Is Deported Despite a Judge's Order  —  Dr. Rasha Alawieh, a kidney transplant specialist and Brown University professor who had a valid visa, was expelled in apparent defiance of a court order.  —  A kidney transplant specialist and professor at Brown University's medical school … ",
    "url": "https://www.nytimes.com/2025/03/16/us/brown-university-rasha-alawieh-professor-deported.html?unlocked_article_code=1.4U4.QrEr.UrgkZpB3n34R&smid=url-share"
  },
  {
    "text": "Judge demands Trump admin. explain why doctor was deported despite order  —  A federal judge on Sunday ordered the Trump administration to respond to allegations that U.S. immigration enforcement “willfully disobeyed” an order halting the deportation of a Rhode Island doctor.",
    "url": "https://www.axios.com/2025/03/16/judge-trump-admin-deported-doctor-despite-order"
  },
  {
    "text": "Trump tapped Kari Lake to run VOA.  Then he dismantled it.  —  Lake had big plans to transform the outlet into a powerful “weapon” to fight an “information war.”  Instead, the president has essentially shut it down.  —  Just now  —  During his first term, Donald Trump accused Voice … ",
    "url": "https://www.washingtonpost.com/politics/2025/03/16/trump-voa-voice-of-america/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQyMDk3NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQzNDc5OTk5LCJpYXQiOjE3NDIwOTc2MDAsImp0aSI6ImQ3OGQwN2UzLTQ3M2YtNDY3MS05NWM2LWViMWI3NzU1OTcyMCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzAzLzE2L3RydW1wLXZvYS12b2ljZS1vZi1hbWVyaWNhLyJ9.um6UyBUt36hn-tZh6xPCtmrI1jMK3MEV3i-n7ClEiiM&itid=gfta"
  },
  {
    "text": "Nervous about Trump, international tourists scrap their U.S. travel plans  —  The Trump administration's hard stance on tariffs and other international policies has some travelers rethinking where they vacation.  —  International travelers concerned about President Donald Trump's trade policies … ",
    "url": "https://www.washingtonpost.com/business/2025/03/16/international-tourism-travel-trump-canada/"
  },
  {
    "text": "He voted for Trump.  Now his wife sits in an ICE detention center.  —  Bradley Bartell and Camila Muñoz had a familiar small-town love story, before they collided with immigration politics.  —  They met through mutual friends, had a first date at the local steakhouse … ",
    "url": "https://www.usatoday.com/story/news/nation/2025/03/16/mass-deportation-ice-detains-non-criminals/82304354007/"
  },
  {
    "text": "Top broadband official exits Commerce Department with sharp Musk warning  —  “Stranding all or part of rural America with worse internet so that we can make the world's richest man even richer is yet another in a long line of betrayals by Washington,” Evan Feinman warned.",
    "url": "https://www.politico.com/news/2025/03/16/official-exits-commerce-department-musk-warning-00232278"
  },
  {
    "text": "Featured Comment  —  Bill Clinton enacted his Reinventing Government package of streamlining restructuring (REIGO) in 1993, when he still held legislative majorities.  It was passed by a margin of ONE VOTE.  Al Gore was the one who actually drafted the plan in writing … ",
    "url": "https://www.gocomics.com/doonesbury/2025/03/16"
  },
  {
    "text": "Trade War Retaliation Will Hit Trump Voters Hardest  —  The counties where tariffs could hit jobs, by presidential vote winner  —  Source: New York Times analysis of data from Lightcast and the Bureau of Labor Statistics' Quarterly Census of Employment and Wages.  Note: Vote results are for the 2024 U.S. presidential election.",
    "url": "https://www.nytimes.com/interactive/2025/03/15/business/economy/tariffs-trump-maps-voters.html?unlocked_article_code=1.4U4.ttEE.d5kGMuP3mV8b&smid=url-share"
  },
  {
    "text": "Nita M. Lowey, Tenacious New York Representative, Dies at 87  —  A Democrat, she represented Westchester County for three decades and became the first woman to lead the powerful House Appropriations Committee.  —  Nita M. Lowey, who represented a congressional district based in Westchester County … ",
    "url": "https://www.nytimes.com/2025/03/16/us/politics/nita-m-lowey-dead.html"
  },
  {
    "text": "Black Medal of Honor recipient removed from US Department of Defense website  —  Page honoring Charles C Rogers for his Vietnam war service is now defunct with letters ‘DEI’ added to website address  —  The US defense department webpage celebrating an army general who served in the Vietnam war … ",
    "url": "https://www.theguardian.com/us-news/2025/mar/16/defense-department-black-medal-of-honor-veteran"
  },
  {
    "text": "Young scientists see career pathways vanish as schools adapt to federal funding cuts  —  As an infant, Connor Phillips was born three months premature with cerebral palsy.  The science that saved his life was the inspiration that led to his role studying brain processes as a research fellow at the National Institutes of Health.",
    "url": "https://apnews.com/young-scientists-see-career-pathways-vanish-as-schools-adapt-to-federal-funding-cuts-000001959e23d0e3addddf3fa7cc0000"
  },
  {
    "text": "‘Not getting the donations’: DC insider notes Kennedy Center decline after Trump takeover  —  A longtime insider who has been at the center of the Washington, D.C. social scene for decade claims Donald Trump's takeover of the Kennedy Center is destroying the venerable institution as ticket sales dry up … ",
    "url": "https://www.rawstory.com/trump-kennedy-center-2671337514/"
  },
  {
    "text": "What Authoritarianism Means  —  An audio version of this piece will be added by Monday morning.  —  It has been almost two months since Donald Trump's inauguration.  It feels much longer.  The speed and the scope of the assault on the constitutional order, on the foundations of democratic self-government have been unprecedented.",
    "url": "https://thomaszimmer.substack.com/p/what-authoritarianism-means"
  },
  {
    "text": "We Were Badly Misled About the Event That Changed Our Lives  —  Since scientists first began playing around with dangerous pathogens in laboratories, the world has experienced four or five pandemics, depending on how you count.  One of them, the 1977 Russian flu, was almost certainly sparked by a research mishap.",
    "url": "https://www.nytimes.com/2025/03/16/opinion/covid-pandemic-lab-leak.html"
  }
]