[
  {
    "text": "Live Updates: Jurors in Trump Criminal Case Told That He Lied ‘Over and Over and Over’  —  Donald J. Trump is charged with falsifying business records to cover up a sex scandal that threatened to derail his 2016 campaign.  A lawyer for Mr. Trump insisted that the former president “did not commit any crimes.”",
    "url": "https://www.nytimes.com/live/2024/04/22/nyregion/trump-hush-money-trial"
  },
  {
    "text": "Unpacking the alleged crime that made Trump's alleged crime a felony  —  Attorneys offered opening arguments in the criminal trial of Donald Trump on Monday in Manhattan, beginning the process of presenting to the jury the state's case against the former president.",
    "url": "https://www.washingtonpost.com/politics/2024/04/22/trump-hush-money-trial-charges/"
  },
  {
    "text": "“The alternate reality Trump lives in is crumbling” with first criminal trial: ex-federal prosecutor  —  “I think that Donald Trump is probably trying to get himself thrown into prison”  —  With a jury now impaneled, Donald Trump's hush-money trial can finally begin in earnest.",
    "url": "https://www.salon.com/2024/04/22/the-alternate-reality-lives-in-is-crumbling-with-first-criminal-trial-ex-prosecutor/"
  },
  {
    "text": "Statement from Columbia University President Minouche Shafik  —  Dear Members of the Columbia Community,  —  I am deeply saddened by what is happening on our campus.  Our bonds as a community have been severely tested in ways that will take a great deal of time and effort to reaffirm.",
    "url": "https://president.columbia.edu/news/statement-columbia-university-president-minouche-shafik-4-22"
  },
  {
    "text": "Tensions are so high at Columbia ahead of Passover that all classes will be virtual today  —  Officials at Columbia University, facing surging tensions on campus that raised safety concerns, have announced all classes will be virtual on Monday as Passover begins.",
    "url": "https://www.cnn.com/2024/04/22/business/columbia-tensions-passover-virtual-classes/"
  },
  {
    "text": "LIVE: Pro-Palestine protesters disperse from blocking intersection, move to Cross Campus  —  The incoming first-year counselors of all 14 residential colleges have released a “Letter of Support” for student protesters.  The letter is addressed to Dean Lewis, Dean Lafargue … ",
    "url": "https://yaledailynews.com/blog/2024/04/22/live-police-begin-arresting-pro-divestment-protesters-on-beinecke-plaza/"
  },
  {
    "text": "The Accidental Speaker  —  This article was featured in the One Story to Read Today newsletter.  Sign up for it here.  —  You could be forgiven for thinking it was Mike Johnson's idea to host the House Republicans' annual policy retreat at the Greenbrier resort in West Virginia … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/04/mike-johnson-speaker-ukraine-trump/678108/"
  },
  {
    "text": "The winner of this Congress?  Joe Biden  —  House Republicans came into the 118th Congress with big plans.  They were going to cut taxes and spending, impeach President Joe Biden and members of his Cabinet and use their leverage to force Democrats to accept stringent new border security and immigration policies.",
    "url": "https://punchbowl.news/article/joe-biden-winning-this-congress/"
  },
  {
    "text": "House Republican infighting getting worse after foreign aid vote  —  One GOP lawmaker said he serves with “some real scumbags,” while others fought over Speaker Mike Johnson's strategy for bringing up the aid package  —  The House came together Saturday to pass a sweeping $95 billion foreign aid package … ",
    "url": "https://www.washingtonpost.com/politics/2024/04/22/house-republicans-infighting-foreign-aid/"
  },
  {
    "text": "NASA's Voyager 1 Resumes Sending Engineering Updates to Earth  —  For the first time since November, NASA's Voyager 1 spacecraft is returning usable data about the health and status of its onboard engineering systems.  The next step is to enable the spacecraft to begin returning science data again.",
    "url": "https://blogs.nasa.gov/voyager/2024/04/22/nasas-voyager-1-resumes-sending-engineering-updates-to-earth/"
  },
  {
    "text": "The GOP's Worst Fears About the End of Roe v. Wade Have Come True  —  Nearly two years after the leak of Supreme Court Justice Samuel Alito's draft opinion overturning Roe v Wade, abortion refuses to step out of the spotlight on center stage in American politics.",
    "url": "https://newrepublic.com/article/180812/gops-worst-fears-end-roe-v-wade-come-true"
  },
  {
    "text": "Next Ukraine package to be larger than normal, include armored vehicles  —  The Senate could approved more than $60 billion for Kyiv as soon as Tuesday.  —  The Biden administration is preparing a larger-than-normal package of military aid for Ukraine that will include armored vehicles … ",
    "url": "https://www.politico.com/news/2024/04/22/ukraine-package-armored-vehicles-00153672"
  },
  {
    "text": "Biden Edges Trump in Two-Way Presidential Contest; Opens Up Lead Among Definite Voters  —  Despite a still close contest between President Joe Biden and former President Donald Trump, Trump's support among white voters and independents has splintered.  Biden is doing better … ",
    "url": "https://maristpoll.marist.edu/polls/election-2024-april/"
  },
  {
    "text": "The Supreme Court Should Rule Swiftly on Trump's Immunity Claim  —  On Thursday, the U.S. Supreme Court will hear Donald Trump's arguments that he is immune from prosecution for his efforts to steal the 2020 presidential election.  It is likely that all — or nearly all … ",
    "url": "https://www.nytimes.com/2024/04/22/opinion/trump-immunity-supreme-court.html"
  },
  {
    "text": "Abortion-rights group launches ad in Michigan, Wisconsin warning about RFK Jr.  —  An abortion-rights group is attacking Robert F. Kennedy Jr. as extreme and unfit to serve over abortion rights, as the health issue takes focus in the presidential election.  —  Reproductive Freedom … ",
    "url": "https://thehill.com/homenews/campaign/4612159-abortion-rights-group-ad-michigan-wisconsin/"
  },
  {
    "text": "The world dumps 2,000 truckloads of plastic into the ocean each day.  Here's where a lot of it ends up  —  Photographs and video by Edu Ponces/RUIDO Photo  —  The western coast of Java in Indonesia is popular with surfers for its world-famous breaks.  There's a majestic underwater world to explore, too.",
    "url": "https://www.cnn.com/interactive/2024/04/climate/plastic-pollution-ocean-cnnphotos/"
  },
  {
    "text": "Ilhan Omar's daughter, Isra Hirsi, says she's homeless, cries poverty after suspension from $90K-per-year college over anti-Israel protests  —  The privileged daughter of Minnesota Rep. Ilhan Omar amazingly claims she's homeless and can't get food after being kicked out of her prestigious $90 … ",
    "url": "https://nypost.com/2024/04/22/us-news/ilhan-omars-daughter-says-shes-homeless-after-being-suspended-from-college-over-anti-israel-protests/"
  },
  {
    "text": "Solar for All  —  Under the $7 billion Solar for All program, the 60 selected applicants will create new or expand existing low-income solar programs, which will enable over 900,000 households in low-income and disadvantaged communities to benefit from distributed solar energy.",
    "url": "https://www.epa.gov/greenhouse-gas-reduction-fund/solar-all"
  },
  {
    "text": "Why Trump Will Likely be Held in Contempt and What Then  —  Trial in The People of the State of New York vs. Donald J. Trump, the first-ever criminal prosecution of a former U.S. president, began on Monday, April 15.  Although the trial is still in its early stages, Trump has already run … ",
    "url": "https://www.justsecurity.org/94878/why-trump-will-likely-be-held-in-contempt-and-what-then/"
  },
  {
    "text": "Republicans Are Suing for the Right To Harass Election Workers  —  You might think that even in today's highly polarized election environment there would be a bipartisan consensus to protect election workers from intimidation and harassment.  If you thought so, you would be wrong.",
    "url": "https://www.democracydocket.com/opinion/republicans-are-suing-for-the-right-to-harass-election-workers/"
  },
  {
    "text": "Minnesota State Senator Nicole Mitchell Arrested On Suspicion Of Burglary  —  Democratic Sen. Nicole Mitchell, 49, of Woodbury, is being held in the Becker County Jail on suspicion of first-degree burglary.  —  Video  —  A state senator and former broadcast meteorologist was arrested … ",
    "url": "https://www.huffpost.com/entry/ap-us-minnesota-state-senator-arrested_n_6626ed5ae4b06e0c2709ae2c"
  },
  {
    "text": "Unite the Right tiki torch man pleads guilty to assaulting cops on Jan. 6  —  A man convicted of burning a tiki torch while chanting white supremacist slogans at the Unite the Right rally in 2017 has reached a plea deal with federal prosecutors and has admitted to assaulting two police at the U.S. Capitol on Jan. 6, 2021.",
    "url": "https://lawandcrime.com/crime/unite-the-right-tiki-torch-man-pleads-guilty-to-assaulting-cops-on-jan-6/"
  },
  {
    "text": "‘Civil War’ is terrifying not for what it says about America, but about journalism  —  Around 2 p.m. on Friday, I opened my laptop and bought a ticket on Fandango for that night's showing of Civil War, the No. 1 movie in America that depicts a not-too-distant U.S. future of killing fields, refugee camps and bombed-out shopping malls.",
    "url": "https://www.inquirer.com/opinion/commentary/civil-war-movie-about-journalism-20240421.html"
  },
  {
    "text": "Some migrants flown by DeSantis to Martha's Vineyard qualify for victim visas, feds say  —  Some of the 49 migrants flown to Martha's Vineyard by the state of Florida are now able to legally work in the United States and have temporary protections from deportation — because they are considered victims … ",
    "url": "https://www.miamiherald.com/news/politics-government/state-politics/article287896095.html"
  },
  {
    "text": "Trump, RNC promise ‘aggressive’ election interference in battleground states  —  Workers at the Washoe County Registrar of Voters counting early ballots in 2020.  The process was live-streamed online.  (Screengrab via YouTube)  —  Policy, politics and progressive commentary",
    "url": "https://nevadacurrent.com/2024/04/21/trump-rnc-promise-aggressive-election-interference-in-battleground-states/"
  }
]