[
  {
    "text": "Harris's Harsh Takedown of Fox's Bret Baier Exposes MAGA's Biggest Lie  —  Judging by the video that Kamala Harris's campaign is circulating, her aides are pleased with one particular exchange during her interview with Fox News's Bret Baier.  In it, Harris dressed down Baier for playing video … ",
    "url": "https://newrepublic.com/article/187269/harriss-harsh-takedown-foxs-bret-baier-exposes-magas-biggest-lie"
  },
  {
    "text": "Momentum shifts against Harris in presidential race  —  The tides of the election are turning against Vice President Harris.  —  During the late summer and heading into fall, Harris appeared to be the candidate with the momentum, with Democrats comparing her candidacy to former President Obama's in 2008.",
    "url": "https://thehill.com/homenews/campaign/4937489-harris-election-trend-concerns/"
  },
  {
    "text": "Fox News's interview of Kamala Harris was grievance theater, not political journalism  —  Brett Baier interrupted Harris so much she could barely finish a sentence.  She still injected some reality into Fox News's world  —  Bret Baier started off his Wednesday evening interview with Kamala Harris … ",
    "url": "https://www.theguardian.com/commentisfree/2024/oct/17/fox-news-harris-interview"
  },
  {
    "text": "Israel confirms Hamas leader Yahya Sinwar was killed in Gaza  —  Israeli forces in Gaza killed Hamas' top leader Yahya Sinwar, a chief architect of last year's attack on Israel that sparked the war, the military said Thursday.  Troops appeared to have run across him in a battle … ",
    "url": "https://apnews.com/article/israel-palestinians-hamas-lebanon-hezbollah-news-10-17-2024-d12ca71945313e601cf10876072f4182"
  },
  {
    "text": "Biden tells Obama 'she's not as strong as me' — and ex-prez agrees 'that's true' at Ethel Kennedy service  —  WASHINGTON — President Biden griped to former President Barack Obama that “she” is “not as strong as me” — with Obama agreeing “that's true” — in a stunning off-mic conversation deciphered … ",
    "url": "https://nypost.com/2024/10/17/us-news/biden-told-obama-shes-not-as-strong-as-me-and-ex-prez-agreed-thats-true-at-ethel-kennedy-funeral/"
  },
  {
    "text": "McConnell called Trump 'stupid\" and ‘despicable’ in private after the 2020 election, a new book says  —  Mitch McConnell said after the 2020 election that then-President Donald Trump was “stupid as well as being ill-tempered,” a “despicable human being” and a “narcissist,” … ",
    "url": "https://apnews.com/article/mcconnell-trump-biography-election-0a861001d95287e689336504abc2281f"
  },
  {
    "text": "Heat Map of January 6th Defendants Across the United States  —  The graphic below is a “Heat Map” of the United States displaying the hometown origins of all the defendants charged for federal crimes allegedly committed in connection with the January 6th attack on the U.S. Capitol (identified by general location and not by name).",
    "url": "https://www.justsecurity.org/104036/heat-map-january-6th-defendants-2/"
  },
  {
    "text": "Trump NRA rally in Savannah canceled  —  Former president was to make second visit to coastal Georgia city in less than a month for ‘Defend the 2nd’ event at Savannah Convention Center  —  SAVANNAH ― The National Rifle Association on Thursday canceled an Oct. 22 rally featuring … ",
    "url": "https://www.ajc.com/politics/trump-nra-rally-in-savannah-canceled/52HMNGS5ZVEUDEWO7Z3YGAG5ZM/"
  },
  {
    "text": "Let's Take the Republican Policy Challenge  —  If you live in Red America, as I do, you're familiar with two conceptually incompatible arguments for Donald Trump.  We'll call them the MAGA argument and the Republican argument.  —  The MAGA argument can be summed up in three words: Burn it down.",
    "url": "https://www.nytimes.com/2024/10/17/opinion/trump-policy-maga-republican.html?unlocked_article_code=1.S04.GWSD.RhR8yYgK93V0&smid=url-share"
  },
  {
    "text": "Maddow's bombshell reporting: Trump trying to pay Stormy Daniels to be quiet again  —  Rachel Maddow breaks down her bombshell reporting on how Trump is once again trying to pay Stormy Daniels to be quiet.",
    "url": "https://www.msnbc.com/all-in/watch/maddow-s-bombshell-reporting-trump-trying-to-pay-stormy-daniels-to-be-quiet-again-221947973843"
  },
  {
    "text": "Donald Trump's other mental health problem that we're not talking about  —  Donald Trump may be running again for the presidency, but some days on the campaign trail it feels like he's minoring in psychology.  At a rally Monday night in Atlanta, the GOP nominee added Black and Latino voters … ",
    "url": "https://www.inquirer.com/opinion/donald-trump-mental-health-crisis-20241017.html?id=xgu5jTuupbZGp"
  },
  {
    "text": "Trump suggests Zelenskyy is to blame for the Russia-Ukraine war  —  “He should never have let that war start,” Trump said, referring to Ukrainian President Volodymyr Zelenskyy.  —  Donald Trump blamed Russia's war on Ukraine on Ukrainian President Volodymyr Zelenskyy … ",
    "url": "https://www.politico.com/news/2024/10/17/trump-zelenskyy-biden-russia-ukraine-war-blame-00184173"
  },
  {
    "text": "Ruben, Kate Gallego's divorce records unsealed.  Here's what is in them  —  (This story was updated to add new information.)  —  U.S. Senate candidate Ruben Gallego filed suit to end his marriage with Phoenix Mayor Kate Gallego just before she gave birth to their son and sought to keep … ",
    "url": "https://www.azcentral.com/story/news/politics/elections/2024/10/17/ruben-kate-gallegos-divorce-records-unsealed-after-legal-battle-ends/75694151007/"
  },
  {
    "text": "This Race Is Kamala Harris's to Lose.  Here's Why.  —  It will all come down to turnout.  And that, I predict, will mean a Harris-Walz victory.  —  In these waning stages of the late Trump era, everything and nothing is a surprise.  We've become immune.",
    "url": "https://www.vanityfair.com/news/story/kamala-harris-to-lose-heres-why"
  },
  {
    "text": "Dave Bautista punches back on view of Trump as ‘tough guy’  —  Former professional wrestler Dave Bautista took out his frustration with former President Trump's “tough guy” image during a bit on “Jimmy Kimmel Live!”  Wednesday.  —  “Fellas, we gotta talk,” Bautista says in the video, while sparring in a gym's boxing ring.",
    "url": "https://thehill.com/homenews/4938457-dave-bautista-trump-tough-guy/"
  },
  {
    "text": "Texas AG sues doctor who allegedly provided transgender care to 21 minors  —  The suit is the first by an attorney general against an individual doctor for allegedly violating a restriction on gender-affirming care for minors.  —  Texas Attorney General Ken Paxton sued a Dallas doctor Thursday accusing … ",
    "url": "https://www.nbcnews.com/nbc-out/out-politics-and-policy/texas-ag-sues-doctor-allegedly-provided-transgender-care-21-minors-rcna175988"
  },
  {
    "text": "Donald Trump Cancels Second Mainstream Interview in Days  —  SAFE SPACE  —  The ex-president was scheduled to sit down with NBC News on Monday.  But he pulled out after nixing a CNBC interview too.  —  Donald Trump pulled out of another mainstream interview Thursday-this time nixing a sit-down with NBC News.",
    "url": "https://www.thedailybeast.com/donald-trump-cancels-another-mainstream-interview-with-nbc-and-heads-for-safety-of-fox-and-friends"
  },
  {
    "text": "Michigan judge says RNC suit challenging overseas voters could ‘disenfranchise an entire group of citizens’  —  A Michigan judge suggested Thursday that Republicans waited too long to file a suit challenging the right of some U.S. citizens who live abroad to vote in the swing state.",
    "url": "https://www.politico.com/live-updates/2024/10/17/2024-elections-live-coverage-updates-analysis/michigan-election-overseas-voters-00184200"
  },
  {
    "text": "Google to block election ads after polls close on Election Day  —  Google announced it will block ads about the general election on Nov. 5 after the last polls close.  —  “As we've done in the past, we will temporarily pause ads related to U.S. elections after the last polls close on November 5 … ",
    "url": "https://thehill.com/policy/technology/4939456-google-blocks-election-ads/"
  }
]