[
  {
    "text": "The Jolt: Marjorie Taylor Greene blasts Kemp and floats VP, Senate bids  —  Since Fulton County District Attorney Fani Willis indicted former President Donald Trump for interfering in Georgia's 2020 election, U.S. Rep. Marjorie Taylor Greene has been on the attack.The conservative firebrand … ",
    "url": "https://www.ajc.com/politics/politics-blog/the-jolt-marjorie-taylor-greene-blasts-kemp-and-floats-vp-senate-bids/YKTNGG7QRJDBTH4RSVTV37PZPI/"
  },
  {
    "text": "Americans are divided along party lines over Trump's actions in election cases, AP-NORC poll shows  —  Donald Trump and 18 allies have been indicted in Georgia over efforts to overturn his 2020 election loss in the state.  There is no shortage of logistical challenges raised by the sprawling racketeering indictment.",
    "url": "https://apnews.com/article/trump-indictment-poll-georgia-elections-b6140eed88b3153e41dbf9e008d5a21b"
  },
  {
    "text": "Majority Of Americans Say Trump Should Be Prosecuted On Federal Criminal Charges Linked To 2020 Election, Quinnipiac University National Poll Finds; DeSantis Slips, Trump Widens Lead In GOP Primary  —  mail_outline  —  In the wake of a federal indictment accusing former President Donald Trump … ",
    "url": "https://poll.qu.edu/poll-release?releaseid=3877"
  },
  {
    "text": "The ‘brains’ behind fake Trump electors was once a liberal Democrat  —  Kenneth Chesebro, a Harvard-trained lawyer, may be the least well known of the main players in Trump's federal and Georgia indictments  —  VEGA ALTA, Puerto Rico — The blinds were drawn at a handsome villa … ",
    "url": "https://www.washingtonpost.com/national-security/2023/08/16/kenneth-cheseboro-trump-indictment-fake-electors/"
  },
  {
    "text": "Santos Aide Who Impersonated McCarthy Staff Member Faces Federal Charges  —  The aide, Samuel Miele, was accused of impersonating the staff member in fund-raising appeals and was charged with wire fraud and identity theft.  —  A campaign associate of Representative George Santos … ",
    "url": "https://www.nytimes.com/2023/08/16/nyregion/sam-miele-charged-george-santos.html"
  },
  {
    "text": "Santos fundraiser charged with impersonating House leadership aide  —  Samuel Miele, a fundraiser for embattled Rep. George Santos (R-N.Y.), was indicted on allegations he had impersonated a top aide to a member of House leadership while soliciting donations for Santos's campaign.",
    "url": "https://thehill.com/regulation/court-battles/4155311-george-santos-fundraiser-accused-of-impersonating-house-leadership-aide/"
  },
  {
    "text": "US appeals court rules to restrict abortion pill use  —  A U.S. appeals court ruled on Wednesday to restrict access to the abortion pill mifepristone, partially upholding a lower court ruling that alarmed abortion advocates and pharmaceutical companies.  —  The New Orleans-based 5th U.S. Circuit Court … ",
    "url": "https://www.reuters.com/world/us/us-appeals-court-rules-restrict-abortion-pill-use-2023-08-16/"
  },
  {
    "text": "Appeals court embraces abortion-pill limits, sets up Supreme Court review  —  The Supreme Court has ruled that mifepristone, a key abortion drug, will remain available for now under existing rules while litigation continues  —  A federal appeals court on Wednesday said it would restrict access … ",
    "url": "https://www.washingtonpost.com/politics/2023/08/16/abortion-pill-mifepristone-court-ruling-appeal/"
  },
  {
    "text": "DeSantis slips to lowest level of support in Quinnipiac 2024 polling  —  Florida Gov. Ron DeSantis's support in the Republican presidential primary slipped to its lowest level this year, according to a new Quinnipiac University national poll released Wednesday.",
    "url": "https://thehill.com/homenews/campaign/4155446-desantis-slips-to-lowest-level-of-support-in-quinnipiac-2024-polling/"
  },
  {
    "text": "Special counsel obtained Trump DMs despite ‘momentous’ bid by Twitter to delay, unsealed filings show  —  Judge Beryl Howell lit into Twitter for taking steps to give Donald Trump advance notice about the search warrant.  —  Special counsel Jack Smith obtained an extraordinary array of data … ",
    "url": "https://www.politico.com/news/2023/08/15/special-counsel-obtained-trump-twitter-howell-00111410"
  },
  {
    "text": "What the Heck Happened in Coffee County, Georgia?  —  A detailed look back at the computer intrusion that features prominently in Fulton County District Attorney Fani Willis's election interference indictment  —  Meet The Authors  —  Published by The Lawfare Institute in Cooperation With",
    "url": "https://www.lawfaremedia.org/article/what-the-heck-happened-in-coffee-county-georgia"
  },
  {
    "text": "Trump supporters post names and addresses of Georgia grand jurors online  —  A fringe website featured the purported names and addresses of the Fulton County grand jury that indicted Trump and 18 others for their efforts to overturn the 2020 election.  —  ATLANTA — The purported names … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/names-addresses-grand-jurors-georgia-trump-indictment-posted-online-rcna100239"
  },
  {
    "text": "Fulton County district attorney wants Trump trial to begin March 4, 2024  —  Fulton County District Attorney Fani Willis has asked a judge to set a trial date of March 4, 2024, for former President Donald Trump and his 18 co-defendants.  —  Willis also asked to schedule arraignments … ",
    "url": "https://www.cnn.com/2023/08/16/politics/trump-trial-request-march-4/"
  },
  {
    "text": "Sinema takes on Schumer, Jeffries and the White House over the border  —  Border-state Democrats are frustrated to see New York claim most of a recent migrant relief infusion.  But Arizona's formerly Democratic senator is speaking out the loudest.  —  When the Biden administration doled … ",
    "url": "https://www.politico.com/news/2023/08/16/sinema-takes-on-schumer-jeffries-border-00111355"
  },
  {
    "text": "Dems start laughing off House GOP's Trump protection push  —  FOUR INDICTMENTS AND AN EXPUNGEMENT?  —  House Republicans first flirted with nullifying Donald Trump's impeachments back when the former president faced only two indictments.  Now that number has doubled, and the manager … ",
    "url": "https://www.politico.com/newsletters/huddle/2023/08/16/dems-start-laughing-off-house-gops-trump-protection-push-00111426"
  },
  {
    "text": "GOP lawmaker apologizes for ‘religious freedom’ tweet  —  A Republican lawmaker apologized Tuesday for a “religious freedom” tweet he posted earlier that day after receiving backlash from both sides of the aisle.  —  Rep. Max Miller (R-Ohio) asked Lizzie Marbach, director of communications … ",
    "url": "https://thehill.com/homenews/house/4155171-gop-lawmaker-apologizes-for-religious-freedom-tweet/"
  },
  {
    "text": "Ohio Secretary of State Frank LaRose fires press secretary over tweets criticizing Trump  —  The dismissal of Rob Nichols comes as LaRose seeks Trump's endorsement in a competitive GOP Senate primary.  —  CLEVELAND — An official spokesperson for Ohio Secretary of State Frank LaRose is out of a job … ",
    "url": "https://www.nbcnews.com/meet-the-press/meetthepressblog/ohio-secretary-state-frank-larose-fires-press-secretary-tweets-critici-rcna100222"
  },
  {
    "text": "Pakistan crowd vandalises churches, torches homes after blasphemy accusation  —  A Muslim crowd attacked a Christian community in eastern Pakistan on Wednesday, vandalising several churches and setting scores of houses on fire after accusing two of its members of desecrating the Koran, police and community leaders said.",
    "url": "https://www.reuters.com/world/asia-pacific/pakistani-christian-community-attacked-after-blasphemy-accusation-police-2023-08-16/"
  },
  {
    "text": "Congress moves toward a short-term funding bill to quell fears of a shutdown  —  Speaker McCarthy told Republicans on a private call this week that he thinks it will be necessary to buy time, two sources said.  Sen. Schumer said the two have discussed passing a stopgap bill.",
    "url": "https://www.nbcnews.com/politics/congress/congress-short-term-funding-bill-government-shutdown-rcna100182"
  }
]