[
  {
    "text": "New York Post pans Trump's ‘birdbrain’ attack on Haley  —  The editorial board of the New York Post dissed former President Trump after he attacked Nikki Haley, his former Ambassador to the United Nations and one of the candidates who is challenging him for the Republican nomination for president.",
    "url": "https://thehill.com/homenews/media/4234478-new-york-post-pans-trumps-birdbrain-attack-on-haley/"
  },
  {
    "text": "Trump says New York fraud case is a ‘scam’: Latest updates  —  Donald Trump denounces New York fraud case as ‘scam’  —  New York Attorney General Letitia James: President Trump engaged in ‘persistent and repeated fraud’  —  The fraud lawsuit that could cost former President Donald Trump control … ",
    "url": "https://apnews.com/article/trump-letitia-james-fraud-lawsuit-new-york-eb98c99fe918da139b0d8b6347211afe"
  },
  {
    "text": "Trump New York fraud trial ends first day with tax accountant testimony  — The $250 million civil fraud trial that could see Donald Trump permanently banned from doing business in New York ended its first day.  — Trump was present in the courtroom in Manhattan Supreme Court.",
    "url": "https://www.cnbc.com/2023/10/02/trump-fraud-trial-to-kick-off-in-new-york-court.html"
  },
  {
    "text": "Three in 10 Republicans don't think the Biden impeachment probe will be fair  —  Leaders of the House Republican conference would like Americans to be under the impression that the party's investigation into the possible impeachment of President Biden is a sober act, one undertaken solely … ",
    "url": "https://www.washingtonpost.com/politics/2023/10/02/biden-impeachment-inquiry-polling/"
  },
  {
    "text": "Little Enthusiasm for 2024 Front-Runners  —  Voters much more likely to see Biden as too old than Trump  —  West Long Branch, NJ - There is not a lot of enthusiasm for either President Joe Biden or former President Donald Trump becoming the major party nominees in 2024.",
    "url": "https://www.monmouth.edu/polling-institute/reports/monmouthpoll_us_100223/"
  },
  {
    "text": "Newsom picks Laphonza Butler as Feinstein replacement  —  California's governor chose a labor leader turned power player to serve in the Senate, and an adviser told POLITICO there were no preconditions about whether she could run in 2024.  —  California Gov. Gavin Newsom … ",
    "url": "https://www.politico.com/news/2023/10/01/newsom-senate-pick-butler-00119360"
  },
  {
    "text": "EMILYs List Statements on Laphonza Butler's Appointment to the U.S. Senate  —  FOR IMMEDIATE RELEASE  —  WASHINGTON, D.C. - Today, in response to the news that Gov. Gavin Newsom will name EMILYs List President Laphonza Butler to the U.S. Senate from California, EMILYs List released the following statements:",
    "url": "https://emilyslist.org/news/emilys-list-statements-on-laphonza-butlers-appointment-to-the-u-s-senate/"
  },
  {
    "text": "Putin's Pals Brag: Elon Musk ‘Really Is Our Agent!’  —  Kremlin propagandists are rejoicing after Congress omitted aid to Ukraine from its most recent government funding bill.  —  Russian experts have long predicted that it's only a matter of time before U.S. aid to Ukraine is jeopardized by war fatigue and domestic issues.",
    "url": "https://www.thedailybeast.com/russian-state-tv-brags-elon-musk-really-is-our-agent"
  },
  {
    "text": "Matt Gaetz's father seeking return to Florida Senate  —  Don Gaetz, Rep. Matt Gaetz's (R-Fla.) father, announced on Monday that he will be running again for the Florida Senate, where he served from 2006 to 2016.  —  Don Gaetz, a Republican, said that he has no intentions of seeking higher office … ",
    "url": "https://thehill.com/homenews/state-watch/4234410-matt-gaetzs-father-seeking-return-to-florida-senate/"
  },
  {
    "text": "Democrats can't really save Kevin McCarthy  —  To become House speaker, Kevin McCarthy (R-Calif.) had to give away much of the store to a small group of House Republicans.  Less than nine months later, he could be looking for what's left to give Democrats if he wants to try to keep the job.",
    "url": "https://www.washingtonpost.com/politics/2023/10/02/democrats-cant-really-save-kevin-mccarthy/"
  },
  {
    "text": "Spartz says she'll consider resigning from Congress  —  Rep. Victoria Spartz (R-Ind.) announced that she'll consider resigning from her position if Congress does not create a debt commission by the end of this year.  —  “I've done many very difficult things being one woman standing many times … ",
    "url": "https://thehill.com/homenews/house/4234161-spartz-says-shell-consider-resigning-from-congress/"
  },
  {
    "text": "Supreme Court declines to consider longshot bid to disqualify Trump from running for president  —  The Supreme Court said Monday that it will not take up a longshot challenge to Donald Trump's eligibility to run for president because of his alleged role in the January 6, 2021, attack on the US Capitol.",
    "url": "https://www.cnn.com/2023/10/02/politics/donald-trump-fourteenth-amendment-ballot-case-supreme-court/"
  },
  {
    "text": "Play it again, Sam  —  Inside Bankman-Fried's last year in the crypto game  —  Most of the people who went to work for Sam Bankman-Fried ended up in jobs for which they were not obviously qualified, and Natalie Tien was no exception.  She'd been raised in Taiwan by middle-class parents whose … ",
    "url": "https://www.washingtonpost.com/opinions/interactive/2023/michael-lewis-sam-bankman-fried-ftx-crypto/"
  },
  {
    "text": "GOP senators weigh go-big-or-go-home strategy on Ukraine  —  The GOP confrontation last week over continued aid was a rude awakening for Mitch McConnell and other senators who back Ukraine funding.  —  From Mitch McConnell on down, the Senate's pro-Ukraine coalition is trying to reassure … ",
    "url": "https://www.politico.com/news/2023/10/02/congress-shutdown-ukraine-aid-00119380"
  },
  {
    "text": "Supreme Court denies Eastman petition, with rare recusal from Thomas  —  The Supreme Court on Monday denied an effort by lawyer John Eastman to appeal a ruling that found he may have acted criminally with the legal advice he gave former President Trump.  It spurred a rare recusal … ",
    "url": "https://thehill.com/regulation/court-battles/4233719-supreme-court-denies-eastman-petition-with-rare-recusal-from-thomas/"
  },
  {
    "text": "Elon Musk Hit With Lawsuit For Falsely Accusing Man Of Being Part Of Neo-Nazi Brawl  —  Ben Brody, 22, said he was forced to leave his home after Musk falsely accused him of being a federal agent pretending to be a neo-Nazi.  —  Elon Musk, the tech billionaire and far-right sympathizer … ",
    "url": "https://www.huffpost.com/entry/elon-musk-defamation-lawsuit-neo-nazi_n_65146bace4b05bd1c4d60d14"
  },
  {
    "text": "Bowman camp slams ‘Nazi’ Republicans after fire alarm flap  —  Republicans have vowed to punish the progressive in the wake of the incident, with one member already introducing a motion to expel him from Congress.",
    "url": "https://www.politico.com/live-updates/2023/10/02/congress/bowmans-damage-control-00119493"
  },
  {
    "text": "An unexpected check on Supreme Court's sharp move right: Justice Kavanaugh  —  Justice Brett M. Kavanaugh during his combative 2018 confirmation hearing.  In stark contrast, the justice today displays a generally upbeat manner.  (Alex Brandon / Associated Press)  —  WASHINGTON —",
    "url": "https://www.latimes.com/politics/story/2023-10-02/conservative-justice-kavanaugh-holds-the-middle-vote-as-the-supreme-court-moves-right"
  },
  {
    "text": "Alliance Defending Freedom's Crusade Against Trans Rights  —  Alliance Defending Freedom has won fifteen Supreme Court cases.  Now it wants religious exemptions to anti-discrimination laws—and is targeting trans rights.  —  On March 15, 2023, two conservative Christian lawyers asked … ",
    "url": "https://www.newyorker.com/magazine/2023/10/09/alliance-defending-freedoms-legal-crusade?currentPage=all"
  }
]