[
  {
    "text": "Judge Kicks Reporters Out of Courtroom to Talk to Trump and AG  —  Justice Arthur F. Engoron also issued a gag order against Trump earlier in the day after the former president attacked one of his law clerks on social media.  —  A turbulent second day at Donald Trump's bank fraud trial … ",
    "url": "https://www.thedailybeast.com/judge-kicks-reporters-out-of-courtroom-to-talk-to-trump-and-ag"
  },
  {
    "text": "Trump Ordered Not to Comment on Judge's Staff in Fraud Case  —  The former president attacked Justice Arthur F. Engoron's clerk in a social media post that soon disappeared.  He was called to account behind closed doors.  —  A New York judge placed a limited gag order on Donald J. Trump … ",
    "url": "https://www.nytimes.com/2023/10/03/nyregion/trump-gag-order-fraud-trial.html"
  },
  {
    "text": "Trump Posts (Then Deletes) Attack Against Judge's Clerk During Trial  —  The former president is attending his New York civil fraud trial in person, ranting at cameras and on social media in between courtroom sessions … Trump last week was found guilty of committing fraud in the case … ",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-attacks-judge-engoron-clerk-new-york-fraud-trial-1234838462/"
  },
  {
    "text": "Trump fraud trial live updates: Day 2 begins with testimony from ex-Trump accountant  —  Trump appears in court for Day 2 of civil fraud trial … 2m ago / 6:59 PM UTC  —  Trump appears to delete post attacking judge's law clerk  —  Dan Gallo  —  Amid all the delays … ",
    "url": "https://www.nbcnews.com/politics/live-blog/trump-fraud-trial-live-updates-rcna118408"
  },
  {
    "text": "Judge Gags Trump After Ex-President Attacks His Law Clerk  —  Shortly before a lunch break, Trump circulated a false rumor about Manhattan Supreme Court Justice Arthur Engoron, which traces its origins to a now-shuttered satirical website  —  A Facebook icon representing an external link … ",
    "url": "https://themessenger.com/politics/trump-gag-order-new-york-engoron-clerk-truth-social"
  },
  {
    "text": "Donald Trump Drops Off The Forbes 400 For Second Time In 3 Years  —  As the New York attorney general accuses Donald Trump of fraud, Forbes answers the question at the heart of the case: What is he really worth?  —  Donald Trump is no longer rich enough for the country's most exclusive club.",
    "url": "https://www.forbes.com/sites/danalexander/2023/10/03/donald-trump-drops-off-the-forbes-400-for-second-time-in-3-years/"
  },
  {
    "text": "New York judge issues gag order after Trump attacks clerk on Truth Social  —  NEW YORK — The judge overseeing former President Trump's New York fraud trial issued a limited gag order for all parties Tuesday after Trump's Truth Social account made a post targeting the judge's principal clerk … ",
    "url": "https://thehill.com/regulation/court-battles/4236476-new-york-judge-issues-gag-order-after-trump-attacks-clerk-on-truth-social/"
  },
  {
    "text": "Republicans must expel Matt Gaetz  —  Newt Gingrich, a Republican from Georgia, was speaker of the House of Representatives from 1995 to 1999.  —  Rep. Matt Gaetz (R-Fla.) is an anti-Republican who has become actively destructive to the conservative movement.  —  Drama has filled the halls of Congress for 234 years.",
    "url": "https://www.washingtonpost.com/opinions/2023/10/03/newt-gingrich-matt-gaetz-remove/"
  },
  {
    "text": "McCarthy won't run for Speaker again  —  Rep. Kevin McCarthy (R-Calif.) informed members of his conference Tuesday night that he will not run for Speaker again after the House voted to oust him from the post hours earlier, multiple lawmakers confirmed to The Hill.",
    "url": "https://thehill.com/homenews/house/4237019-mccarthy-wont-run-for-speaker-again/"
  },
  {
    "text": "Kevin McCarthy's House speaker job under threat, with vote possible today  —  House Speaker Kevin McCarthy (R-Calif.) is at risk of losing his job as early as Tuesday, as a faction of hard-right Republicans seeks to oust him and Democrats signaled they are not willing to vote to save him.",
    "url": "https://www.washingtonpost.com/politics/2023/10/03/kevin-mccarthy-house-speaker-vote-2/"
  },
  {
    "text": "The Only Sin That Republicans Can't Forgive  —  The fall of House Speaker Kevin McCarthy today demonstrated again that the one sin that cannot be forgiven in the modern Republican Party is being seen as failing to fight the Democratic agenda by any means necessary.",
    "url": "https://www.theatlantic.com/politics/archive/2023/10/the-only-sin-that-republicans-cant-forgive/675534/"
  },
  {
    "text": "McHenry ordered Pelosi to leave her Capitol hideaway office by Wednesday  —  The former speaker blasted the move as a “sharp departure from tradition.”",
    "url": "https://www.politico.com/live-updates/2023/10/03/congress/mchenry-pelosi-hideaway-office-house-remove-00119803"
  },
  {
    "text": "Fulton prosecutors float plea deals to Trump defendants  —  First guilty plea in RICO case came Friday  —  Fulton County prosecutors are floating plea deals to a number of defendants in the election interference case involving former President Donald Trump, according to people with knowledge of the proposals.",
    "url": "https://www.ajc.com/politics/fulton-prosecutors-float-plea-deals-to-trump-defendants/76Q5JTJHXVHHFPVYEW6YWORZO4/"
  },
  {
    "text": "Payday Lenders Get Their Asses Handed To Them During Anti-CFPB Supreme Court Arguments  —  The case to dismantle the CFPB ran into a hammer from the three liberal justices and marked skepticism from at least two of the conservatives.  —  LOADING  —  The case seeking to eviscerate … ",
    "url": "https://www.huffpost.com/entry/cfpb-supreme-court_n_651c6a8fe4b0521d323733ee"
  },
  {
    "text": "Leonard Leo says he will not cooperate with D.C. Attorney General tax probe  —  A liberal group targeted by a similar tax probe said it would comply.  —  Judicial activist Leonard Leo is not cooperating with an investigation by Washington D.C. Attorney General Brian Schwalb … ",
    "url": "https://www.politico.com/news/2023/10/03/brian-schwalb-arabella-investors-00119751"
  },
  {
    "text": "Drugmakers agree to negotiate drug prices with government, White House says  —  The manufacturers of 10 prescription drugs — including Eliquis, Xarelto and Januvia — will take part in the negotiations.  —  Major drug companies including Johnson & Johnson, Merck and Bristol Myers Squibb … ",
    "url": "https://www.nbcnews.com/health/health-news/medicare-drug-costs-drugmakers-agree-price-negotiations-biden-administ-rcna118510"
  },
  {
    "text": "McCarthy will not run for speaker again after being removed  —  Listen To Our Podcast  —  Every weekday, NPR's best political reporters are there to explain the big news coming out of Washington and the campaign trail.  They don't just tell you what happened.  They tell you why it matters.",
    "url": "https://www.npr.org/2023/10/03/1203310040/mccarthy-gaetz-speaker-news"
  },
  {
    "text": "How red-state politics are shaving years off American lives  —  ASHTABULA, Ohio — Mike Czup unspooled the hose to wash his hearse.  It was time to pick up the body of yet another neighbor who had died in the prime of life.  —  Since he started working at 15 in the funeral business, Czup has seen plenty of tragedies.",
    "url": "https://www.washingtonpost.com/health/interactive/2023/republican-politics-south-midwest-life-expectancy/"
  },
  {
    "text": "Kari Lake Files to Run for Kyrsten Sinema's Senate Seat in Arizona  —  Ms. Sinema left the Democratic Party last year to become an independent, but has not confirmed whether she will run for re-election.  —  Kari Lake, the Republican former news anchor who refused to acknowledge her loss … ",
    "url": "https://www.nytimes.com/2023/10/03/us/politics/kari-lake-senate-arizona.html"
  },
  {
    "text": "Sinclair stations aired a sponsored segment featuring a white nationalist who supports killing journalists  —  Sinclair said “the segment in question is no longer on our air” following a Media Matters inquiry  —  At least 16 Sinclair television stations ran sponsored gold investment segments … ",
    "url": "https://www.mediamatters.org/stew-peters/sinclair-stations-aired-sponsored-segment-featuring-white-nationalist-who-supports"
  }
]