[
  {
    "text": "Sarah Palin Says Civil War Is ‘Going to Happen’ After Trump's Arrest  —  ‘RISE UP’  —  Sarah Palin responded to Donald Trump's arrest in Georgia on Thursday night by talking up the possibility of civil war.  Speaking to Eric Bolling as the former president was booked at the Fulton County Jail … ",
    "url": "https://www.thedailybeast.com/sarah-palin-says-civil-war-is-going-to-happen-after-trumps-arrest"
  },
  {
    "text": "Trump's Mug Shot Gives His Haters Nothing  —  Donald Trump dropped in for a photo op in Georgia last night—not the usual kibbitz on the hustings for a former president, but a killer visual to end the week with: a mug shot.  —  And just like that, Trump was restored to his accustomed place in the Republican dogpile: everywhere.",
    "url": "https://www.theatlantic.com/politics/archive/2023/08/donald-trump-georgia-mug-shot-debate/675133/"
  },
  {
    "text": "A Trump Mug Shot for History  —  The former president's booking photo is unprecedented.  And that's just the beginning of its significance.  —  As soon as it was taken, it became the de facto picture of the year.  A historic image that will be seared into the public record and referred … ",
    "url": "https://www.nytimes.com/2023/08/25/style/trump-mugshot.html"
  },
  {
    "text": "Trump's mug shot is released, a first in his four criminal cases this year.  —  The former president spent about 20 minutes at the Fulton County Jail, submitting to some of the routines of criminal defendant intake.  He was fingerprinted and had his photo taken.",
    "url": "https://www.nytimes.com/2023/08/24/us/politics/trump-mugshot-booking-photo.html"
  },
  {
    "text": "The GOP's Dispiriting Display  —  The Republican debate was a mess.  —  The first GOP primary debate confirmed the end of the old Republican Party and squelched any hope for a normal presidential election in 2024.  —  First, here are three new stories from The Atlantic:  —  An Inane Spectacle",
    "url": "https://www.theatlantic.com/newsletters/archive/2023/08/gop-republican-presidential-debate/675129/"
  },
  {
    "text": "Vivek Ramaswamy is America's demagogue-in-waiting  —  The Republican debate became the entrepreneur's coming-out party, with the news media boosting him along his way  —  e thinks the climate crisis is a hoax, supports Vladimir Putin's aggression in Ukraine, and would gladly pardon Donald Trump on Day 1 of his would-be presidency.",
    "url": "https://www.theguardian.com/commentisfree/2023/aug/24/vivek-ramaswamy-demagogue-in-waiting"
  },
  {
    "text": "Debate ratings: 12.8 million watched GOP candidates minus Trump battle on Fox News  —  Nearly 13 million people watched the first Republican primary debate on Fox News on Wednesday night, well below the 20 million that tuned into Fox to watch the first GOP primary debate in 2015 — when Donald Trump debuted on the stage.",
    "url": "https://thehill.com/homenews/media/4170110-debate-ratings-12-8-million-watched-gop-candidates-minus-trump-battle-on-fox-news/"
  },
  {
    "text": "Co-defendant in Georgia says false electors met at Trump's ‘direction’  —  Shawn Still is a Georgia Republican charged alongside the former president in a racketeering conspiracy to subvert the 2020 election.  —  Shawn Still, a Georgia Republican charged alongside former President Donald Trump … ",
    "url": "https://www.politico.com/news/2023/08/24/co-defendant-georgia-trump-indictment-00112932"
  },
  {
    "text": "5 more Trump defendants booked at Fulton jail overnight  —  X  —  Five more defendants in the Fulton County Trump case surrendered overnight at the Fulton County jail, hours after former President Donald Trump himself traveled to Atlanta to be booked.  —  First up, Michael Roman, a Trump campaign official.",
    "url": "https://www.ajc.com/news/crime/5-more-trump-defendants-booked-at-fulton-jail-overnight/DOOSLDJQZFCHJE6TGW5QJ4LQJY/"
  },
  {
    "text": "Maui utility may have compromised evidence in fire probe, lawyers say  —  The utility removed damaged poles, lines and other equipment from where the Lahaina fire reportedly started, documents show, before investigators were able to view the scene  —  LAHAINA, Hawaii — The Hawaii power utility believed … ",
    "url": "https://www.washingtonpost.com/climate-environment/2023/08/24/maui-fires-power-utility-lahaina-investigation/"
  },
  {
    "text": "The Last Days of Wagner's Prigozhin  —  On the run, the paramilitary chief crisscrossed his global business empire, desperate to show he was still in control; ‘I need more gold’  —  Yevgeny Prigozhin spent his final days planning for the future.  —  Last Friday, the warlord's private jet touched … ",
    "url": "https://www.wsj.com/world/russia/prigozhin-wagner-plane-crash-last-days-2c44dd5c?mod=djemalertNEWS"
  },
  {
    "text": "Maryland Court says parents can't opt kids out of LGBTQ+ curriculum: ‘Not a fundamental right’  —  Parents argued the inclusion of LGBTQ+ books indoctrinated their kids  —  A federal court in Maryland decided Thursday that parents can't opt their kids out of reading books with LGBTQ+ content in Montgomery County Schools.",
    "url": "https://www.foxnews.com/politics/maryland-court-parents-cant-opt-kids-lgbtq-curriculum-fundamental-right"
  },
  {
    "text": "Early Intelligence Suggests Prigozhin Was Assassinated, U.S. Officials Say  —  Preliminary findings indicate it wasn't surface-to-air missile that took down Wagner leader's plane  —  The plane carrying Yevgeny Prigozhin, the head of the Wagner paramilitary group, crashed as the result … ",
    "url": "https://www.wsj.com/world/russia/wagner-prigozhin-russia-assassinated-intelligence-3e456fab?mod=djemalertNEWS"
  },
  {
    "text": "This scholar is pulling back the curtain on race in Shakespeare  —  Farah Karim-Cooper argues that the Bard has a race problem.  But that doesn't mean we have to love him less.  —  LONDON — The green-oak framed indoor theater of Shakespeare's Globe in London, illuminated by candles at showtime is dark and cavernous, even macabre.",
    "url": "https://www.washingtonpost.com/books/2023/08/23/farah-karim-cooper-great-white-bard/"
  },
  {
    "text": "Deadly storm leaves hundreds of thousands without power in Michigan  —  A severe storm in Michigan and northern Ohio left nearly 700,000 people without power Thursday night.  —  Winds of more than 75 mph downed trees, damaged homes and vehicles in hailstorms and killed at least four people in Michigan.",
    "url": "https://thehill.com/homenews/state-watch/4170977-deadly-storm-leaves-hundreds-of-thousands-without-power-in-michigan/"
  },
  {
    "text": "County of Maui releases validated list of names of individuals who remain unaccounted for following  —  8/24/2023 — County of Maui releases validated list of names of individuals who remain unaccounted for following Lahaina wildfire disaster  —  The County of Maui on Thursday released … ",
    "url": "https://www.mauicounty.gov/CivicAlerts.aspx?AID=12763"
  }
]