[
  {
    "text": "House Republican moves to rein in tariff powers  —  Nebraska Rep. Don Bacon said he plans to introduce a companion bill to the bipartisan Senate legislation aimed at reclaiming Congress' authority over tariffs, becoming the first House Republican to openly challenge the powers President Donald Trump … ",
    "url": "https://www.politico.com/live-updates/2025/04/04/congress/don-bacon-tariff-powers-bill-00273307"
  },
  {
    "text": "Inside President Trump's whirlwind decision to upend global trade  —  Ultimately, Trump resolved to follow his own instincts — and was surrounded by senior officials who enabled him.  —  Not long after President Donald Trump's inauguration, the administration's economic staff went to work … ",
    "url": "https://www.washingtonpost.com/politics/2025/04/04/trump-tariffs-reason-advisers/"
  },
  {
    "text": "Buffett denies social media rumors after Trump shares wild claim that investor backs president crashing market  —  WATCH NOW  —  Warren Buffett went on the record Friday to deny social media posts after President Donald Trump shared on Truth Social a fan video that claimed the president … ",
    "url": "https://www.cnbc.com/2025/04/04/buffett-denies-social-media-rumors-after-trump-shares-wild-claim-that-investor-backs-president-crashing-market.html"
  },
  {
    "text": "Dow drops 1,400 points, Nasdaq set to close in bear market as Trump tariff sell-off worsens: Live updates  —  The stock market took another pounding Friday after China retaliated with new tariffs on U.S. goods, further lending credibility to fears of a trade war that could spark a global a recession.",
    "url": "https://www.cnbc.com/2025/04/03/stock-market-today-live-updates.html"
  },
  {
    "text": "Trump Shares Video About How He Is ‘Purposely Crashing the Stock Market’  —  Several close allies of the president told Rolling Stone they were “at a loss for words” when asked about the video … Economists are warning that the president's actions are putting not just the United States … ",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-shares-post-purposely-crashing-stock-market-1235310745/"
  },
  {
    "text": "‘Everyone is terrified’: Business and government officials are afraid to cross Trump on tariffs  —  While lobbyists, business leaders, and lawmakers are worried about Donald Trump's tariffs, there's a culture of fear in Washington preventing many from speaking out.",
    "url": "https://www.politico.com/news/2025/04/04/trump-tariffs-fear-lobby-business-congress-00006608"
  },
  {
    "text": "Appeals Court Orders Thousands of Voters to Verify Information in Contested N.C. Election  —  The ruling was a win for the Republican who narrowly lost a State Supreme Court race in November.  The case has tested the boundaries of post-election litigation.  —  In the prolonged legal battle … ",
    "url": "https://www.nytimes.com/2025/04/04/us/north-carolina-supreme-court-race-ruling.html"
  },
  {
    "text": "Judge orders Trump administration to bring back Md. man mistakenly deported  —  U.S. officials have argued in court records that the United States is powerless to effectuate his return because he is now in Salvadoran custody, and that Kilmar Abrego García's lawyers have “not clearly shown” that he would face harm in the prison.",
    "url": "https://www.washingtonpost.com/immigration/2025/04/04/judge-orders-trump-administration-bring-back-md-man-mistakenly-deported/"
  },
  {
    "text": "A stunning number of electric vehicle, battery factories are being canceled  —  Billions of dollars in clean energy projects have been canceled since Donald Trump took office again.  —  Just now  —  Over the past few years, electric vehicle manufacturing facilities producing lithium batteries … ",
    "url": "https://www.washingtonpost.com/climate-environment/2025/04/03/ev-factories-canceled/"
  },
  {
    "text": "Judge finds FEMA withholding grants in violation of court order  —  A federal judge Friday ordered the Federal Emergency Management Agency (FEMA) to disburse millions of dollars of grants to Democratic-led states, finding the administration's withholding of the funds breached his previous ruling.",
    "url": "https://thehill.com/regulation/court-battles/5232494-judge-fema-grants-trump-blue-states/"
  },
  {
    "text": "Obama says he is ‘deeply concerned’ with the Trump administration's targeting of students, journalists and law firms  —  His comments came on the same day that former Vice President Kamala Harris also spoke out against the administration.  —  Former President Barack Obama said he is … ",
    "url": "https://www.nbcnews.com/politics/politics-news/obama-says-deeply-concerned-trump-administrations-targeting-students-j-rcna199740"
  },
  {
    "text": "Ousted Vaccine Chief Says RFK Jr.'s Team Sought Data to Justify Anti-Science Stance  —  Peter Marks says the new health secretary's team wants to show vaccines aren't safe while promoting dangerous and unproven treatments  —  The top vaccine regulator ousted by Robert F. Kennedy Jr … ",
    "url": "https://www.wsj.com/health/healthcare/peter-marks-fda-vaccine-regulator-rfk-jr-interview-9194e3b4?st=1PG4LK"
  },
  {
    "text": "RFK Jr. Says He's Rehiring Thousands Of People He Mistakenly Fired  —  The cuts were a mistake he'd always planned to make, Kennedy said in head-scratching remarks.  —  Robert F. Kennedy Jr., secretary of the Health and Human Services Department, told reporters Thursday that he plans … ",
    "url": "https://www.huffpost.com/entry/rfk-jr-hhs-employees-mistakenly-fired_n_67f00a4be4b06ba13d223fde"
  },
  {
    "text": "Russell Brand charged with rape and sexual assault  —  Actor and comedian charged with rape, indecent assault, oral rape and two counts of sexual assault, say police  —  The comedian and actor Russell Brand has been charged with one count each of rape, indecent assault and oral rape as well as two counts of sexual assault.",
    "url": "https://www.theguardian.com/uk-news/2025/apr/04/russell-brand-charged"
  },
  {
    "text": "Massive, Unarchivable Datasets of Cancer, Covid, and Alzheimer's Research Could Be Lost Forever  —  Almost two dozen repositories of research and public health data supported by the National Institutes of Health are marked for “review” under the Trump administration's direction … ",
    "url": "https://www.404media.co/nih-archives-repositories-marked-for-review-for-potential-modification/"
  },
  {
    "text": "New York Warns Trump It Will Not Comply With Public School D.E.I. Order  —  New York's stance differed from the muted and deferential responses from other major institutions to the administration's threats.  —  The New York State Education Department on Friday issued a defiant response … ",
    "url": "https://www.nytimes.com/2025/04/04/us/politics/new-york-trump-dei-order.html"
  },
  {
    "text": "Poll: AOC leads Schumer in head-to-head New York primary matchup by double digits  —  The liberal group Data For Progress conducted the survey of likely Democratic voters.  —  Alexandria Ocasio-Cortez is leading Chuck Schumer by double digits in a new head-to-head poll of the 2028 New York primary.",
    "url": "https://www.politico.com/news/2025/04/04/schumer-aoc-poll-primary-new-york-030621"
  },
  {
    "text": "Trump Rejects Biden Plan to Expand Medicare Coverage for Obesity Drugs  —  Administration officials reversed a decision made during the Biden presidency that would have given millions of people access to weight-loss drugs paid for Medicare and Medicaid.  —  The Trump administration … ",
    "url": "https://www.nytimes.com/2025/04/04/health/trump-wegovy-obesity-drugs-medicare.html"
  },
  {
    "text": "IRS will cut 25% of its employees, eliminating its civil rights office  —  The tax agency began telling employees about the coming reduction in emails sent Friday.  —  Just now  —  The Internal Revenue Service plans to eliminate nearly a quarter of its workforce in layoffs starting Friday … ",
    "url": "https://www.washingtonpost.com/business/2025/04/04/irs-will-cut-25-its-employees-eliminating-its-civil-rights-office/"
  },
  {
    "text": "George Santos Should Get Seven Years for Campaign Fraud, US Says  —  Former US Representative George Santos should be sentenced to more than seven years in prison for committing fraud while campaigning for Congress, federal prosecutors said.  —  A “significant” sentence is needed to protect … ",
    "url": "https://www.bloomberg.com/news/articles/2025-04-04/george-santos-should-get-7-years-for-campaign-fraud-us-says"
  },
  {
    "text": "FEMA chief given lie detector test after leak of private meeting  —  The Department of Homeland Security tested acting Administrator Cameron Hamilton shortly after he met with DHS Secretary Kristi Noem.  —  The head of the Federal Emergency Management Agency was given a lie detector test … ",
    "url": "https://www.politico.com/news/2025/04/04/fema-chief-given-lie-detector-test-after-leak-of-private-meeting-politico-00272302"
  },
  {
    "text": "Nintendo Halts Switch 2 Pre-Orders Over Trump's Tariffs  —  New tariffs threaten massive price hikes on gaming hardware and other consumer goods  —  Switch 2 pre-orders were supposed to begin on April 9.  No longer.  In an unprecedented move, Nintendo announced on Friday that it's halting pre-orders … ",
    "url": "https://kotaku.com/switch-2-preorder-price-tariff-trump-nintendo-1851774764"
  },
  {
    "text": "Trump's Jewish Cover Story … The Trump administration wants you to know that it's just looking out for Jews.  In recent weeks, the White House has cited anti-Semitism as the motivation for many of its controversial moves, whether deporting foreign students who allegedly engaged … ",
    "url": "https://www.theatlantic.com/ideas/archive/2025/04/trump-anti-semitism-agenda/682285/?gift=Y5UOGK3oJJO3esRHvDP7ocVTDaajVIFYFG96PPCQ1HE&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Fate of the Filibuster Emerges as a Central Issue in Senate Budget Fight  —  Some Republicans are uneasy that their party is pursuing a tactic that could weaken the filibuster and backfire in the future.  —  Senator John Thune, Republican of South Dakota and the majority leader … ",
    "url": "https://www.nytimes.com/2025/04/04/us/politics/republicans-filibuster-tax-cuts.html"
  },
  {
    "text": "It's a terrifying time for free speech and civil liberties in Trump's America  —  We don't have to imagine what Trump would do with wartime powers.  He's already doing it, and U.S. citizens could be next.  —  President Donald Trump is running headlong into his radical reimagining of America … ",
    "url": "https://www.msnbc.com/opinion/msnbc-opinion/trump-free-speech-immigration-us-citizens-rcna199629"
  }
]