[
  {
    "text": "How Trump Fumbled his Attack on Biden's Age  —  Donald Trump and the Republicans smelled blood.  President Biden had recently been on the defensive about his age.  A series of polls released over the weekend heightened Democratic concerns.  The Republicans knew the press would treat … ",
    "url": "https://www.messageboxnews.com/p/how-trump-fumbled-his-attack-on-bidens"
  },
  {
    "text": "Biden says he regrets referring to ‘an illegal’ during his State of the Union address  —  The president used the term to describe Jose Antonio Ibarra, a Venezuelan who crossed the border into the U.S. and has been charged with the murder of Laken Riley.  —  President Joe Biden on Saturday told MSNBC … ",
    "url": "https://www.nbcnews.com/politics/white-house/biden-says-regrets-reference-illegal-state-union-address-rcna142561"
  },
  {
    "text": "“Smokin' Joe Biden”: Campaign builds on SOTU buzz … - “Donald Trump believes the job of the president is to take care of Donald Trump,” Biden says. … - By the end of this month, the campaign expects to surge from 100 staff members in the seven battlegrounds to 350+, with 100+ field offices, per the AP.",
    "url": "https://www.axios.com/2024/03/09/biden-campaign-ad-trump"
  },
  {
    "text": "The Biden-Trump Rerun: A Nation Craving Change Gets More of the Same  —  Americans love a candidate who promises something new.  But when a sitting president runs against a former one, can either claim the mantle of change?  —  The promise of change has been a powerful force in presidential campaigns … ",
    "url": "https://www.nytimes.com/2024/03/09/us/politics/trump-biden-presidential-campaign-2024.html"
  },
  {
    "text": "UAW president doubles down on support for Biden after State of the Union shoutout  —  United Auto Workers (UAW) president Shawn Fain doubled down on his support for President Biden following a shout-out from the president in his State of the Union speech.  —  “Joe Biden has a history … ",
    "url": "https://thehill.com/business/4521509-uaw-president-doubles-down-on-support-for-biden-after-state-of-the-union-shoutout/"
  },
  {
    "text": "EXCLUSIVE: Biden says he regrets calling migrant an ‘illegal’ during State of the Union speech  —  During an exclusive interview with Jonathan Capehart, President Biden says he regrets using the term “illegal” when referring to the alleged killer of Laken Riley during his State of the Union speech … ",
    "url": "https://www.msnbc.com/msnbc/watch/exclusive-biden-says-he-regrets-calling-migrant-an-illegal-during-state-of-the-union-speech-206028869556"
  },
  {
    "text": "Early polling of Biden's State of the Union doesn't quite match the hype  —  Democrats would like to believe that President Biden changed the 2024 game with his State of the Union address Thursday night, demonstrating verve and combativeness amid concerns about his age and mental acuity.",
    "url": "https://www.washingtonpost.com/politics/2024/03/08/biden-state-of-the-union-polling/"
  },
  {
    "text": "Katie Britt's false linkage of a sex-trafficking case to Joe Biden  —  The Fact Checker … — Sen. Katie Boyd Britt (R-Ala.), in the Republican response to the State of the Union address, March 7  —  If you were watching Britt's speech on Thursday night, you likely would have thought … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/09/fact-check-katie-britt-sex-trafficking/"
  },
  {
    "text": "Was Trump supporter Katie Britt caught in whopping lie about graphic sex trafficking story?  —  During her widely panned Republican response to the State of the Union Address on Thursday night, Sen. Katie Britt of Alabama told a graphic sex-trafficking story about a woman who was sexually abused … ",
    "url": "https://www.nj.com/news/2024/03/was-sen-katie-britt-caught-in-whopping-lie-about-graphic-sex-trafficking-story.html"
  },
  {
    "text": "Biden rebutter Sen. Britt blasted for recycling 20-year-old sex traffic story to attack border policy  — In her rebuttal to Biden's State of the Union, Republican Sen. Katie Britt of Alabama used what appears to be a sex trafficking victim's experience from the early 2000s to condemn President Joe Biden's current border policy.",
    "url": "https://www.cnbc.com/2024/03/09/katie-britt-unrelated-sex-trafficking-story-state-of-the-union-rebuttal.html"
  },
  {
    "text": "Questions Arise About Britt's State of the Union Response  —  The Alabama senator used a story about sex trafficking to criticize the Biden administration's border policies.  But it wasn't fully accurate.  —  In her rebuttal to President Biden's State of the Union speech Thursday night … ",
    "url": "https://www.nytimes.com/2024/03/09/us/politics/katie-britt-republican-response-sotu-trafficking.html"
  },
  {
    "text": "Inside A Secret Society Of Prominent Right-Wing Christian Men Prepping For A ‘National Divorce’  —  A trove of documents obtained by TPM reveal the society's inner workings.  —  A secret, men-only right-wing society with members in influential positions around the country is on a crusade … ",
    "url": "https://talkingpointsmemo.com/news/inside-a-secret-society-of-prominent-right-wing-christian-men-prepping-for-a-national-divorce"
  },
  {
    "text": "Pope Francis Says Ukraine Should Negotiate End of War With Russia  —  Pope Francis said in an interview that Ukraine, facing a possible defeat, should have the courage to negotiate an end to the war with Russia and not be ashamed to sit at the same table to carry out peace talks.",
    "url": "https://www.bloomberg.com/en/news/thp/2024-03-09/pope-francis-ukraine-should-have-the-courage-of-the-white-flag-negotiate-end-of-war-with-russia"
  },
  {
    "text": "DeSantis faces pushback in Florida as voters tire of war on woke  —  Conservative lawmakers rejected a host of new culture wars proposals in the legislature  —  The bill banning rainbow flags from public buildings in Florida sounded like a sure bet.  —  State Rep. David Borrero (R) … ",
    "url": "https://www.washingtonpost.com/nation/2024/03/09/desantis-florida-woke-culture-wars-legislature/"
  },
  {
    "text": "Robert De Niro Goes Off on ‘Total Monster’ Trump and His Fans In Epic Rant on Bill Maher — Calls Him Every Name In The Book  —  Acting legend Robert De Niro went on a blistering rant about former President Donald Trump and his supporters, sounding the alarm on a new Trump term and calling him a string of derogatory names.",
    "url": "https://www.mediaite.com/entertainment/robert-de-niro-goes-off-on-trump-and-his-fans-in-epic-rant-on-bill-maher-calls-him-every-name-in-the-book/"
  }
]