[
  {
    "text": "10 senators helped advance Ukraine aid after voting against it  —  Nine Republicans and one Democrat in the Senate voted Tuesday to advance a package that includes aid for Ukraine and Israel, after opposing the legislation in a vote earlier this year.  —  The package advanced toward a final vote Tuesday in an 80-19 procedural vote.",
    "url": "https://thehill.com/homenews/senate/4616241-ten-senators-helped-advance-ukraine-aid-after-voting-against-it/"
  },
  {
    "text": "U.S. bans noncompete agreements for nearly all jobs  —  The Federal Trade Commission narrowly voted Tuesday to ban nearly all noncompetes, employment agreements that typically prevent workers from joining competing businesses or launching ones of their own.  —  The FTC received … ",
    "url": "https://www.npr.org/2024/04/23/1246655366/ftc-bans-noncompete-agreements-lina-khan"
  },
  {
    "text": "FTC Announces Rule Banning Noncompetes  —  FTC's final rule will generate over 8,500 new businesses each year, raise worker wages, lower health care costs, and boost innovation  —  Today, the Federal Trade Commission issued a final rule to promote competition by banning noncompetes nationwide … ",
    "url": "https://www.ftc.gov/news-events/news/press-releases/2024/04/ftc-announces-rule-banning-noncompetes"
  },
  {
    "text": "Biden Roasts Trump for Selling His Own Version of The Bible  —  In today's snapshot of the presidential campaign, the contrast between the two candidates could not be starker.  President Biden gave another fiery speech, this time from the state of Florida, a week before their draconian abortion law goes into effect.",
    "url": "https://www.dworkinsubstack.com/p/biden-roasts-trump-for-selling-his"
  },
  {
    "text": "Trump fumes while Biden hits the trail  —  No day demonstrated the extreme asymmetry of the unfolding campaign more than Tuesday.  —  In New York on Tuesday, Donald Trump suffered through a hearing on whether he should be held in contempt of court and testimony from a tabloid publisher on a … ",
    "url": "https://www.politico.com/news/2024/04/23/trump-biden-campaign-trial-00153963"
  },
  {
    "text": "Biden's Gains Against Trump Vanish on Deep Economic Pessimism, Poll Shows  —  The president is trailing Donald Trump in six of seven swing states as a majority of poll respondents see the economy worsening by the end of the year.  —  President Joe Biden's recent polling bump in key battleground states … ",
    "url": "https://www.bloomberg.com/news/articles/2024-04-24/biden-trails-trump-in-6-of-7-key-states-poll-shows-election-2024"
  },
  {
    "text": "Why Biden's blasé about campus turmoil  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  FOR PETE'S SAKE — “Biden administration makes it easier for flyers to get refunds,” by Oriana Pawlyk: “Under the new rule, airlines can't simply give the passengers a voucher for a future flight.",
    "url": "https://www.politico.com/newsletters/playbook/2024/04/24/why-bidens-blase-about-campus-turmoil-00154044"
  },
  {
    "text": "FBI director rejects Trump's vow to investigate political rivals  —  In a wide-ranging interview with NBC News, Christopher Wray also broke with Trump over the former president's characterization of Jan. 6 defendants as “hostages.”  —  Reacting for the first time to former President Donald Trump's vow … ",
    "url": "https://www.nbcnews.com/politics/national-security/fbi-director-rejects-trumps-vow-investigate-political-rivals-rcna149056"
  },
  {
    "text": "National Enquirer made up the story about Ted Cruz's father and Lee Harvey Oswald, former publisher says  —  The Texas senator told NBC News that he's “not interested in revisiting ancient history.”  —  David Pecker, the former publisher of the National Enquirer, testified at Donald Trump's trial Tuesday … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/national-enquirer-ted-cruz-father-rafael-lee-harvey-oswald-rcna149027"
  },
  {
    "text": "Bird flu virus found in grocery milk as officials say supply still safe  —  Viral fragments of bird flu have been identified in samples of milk taken from grocery store shelves in the United States, a finding that does not necessarily suggest a threat to human health but indicates the avian flu virus … ",
    "url": "https://www.washingtonpost.com/health/2024/04/23/bird-flu-virus-milk/"
  },
  {
    "text": "Secret Service prepares for if Trump is jailed for contempt in hush money case  —  Judge Merchan on Tuesday reserved decision after a contentious hearing.  —  Former President Donald Trump appears in court for his trial at Manhattan Criminal Court on April 23, 2024 in New York City.",
    "url": "https://abcnews.go.com/US/secret-services-prepares-potential-trump-contempt-order-hush/story?id=109542824"
  },
  {
    "text": "Inside Dems' thinking on saving Mike Johnson  —  “I don't think we should penalize a speaker for doing the right thing,” said Rep. Steny Hoyer.  —  Democrats are increasingly open to the idea of voting to protect Speaker Mike Johnson against an ouster attempt, putting him in a stronger … ",
    "url": "https://www.politico.com/news/2024/04/24/democrats-mike-johnson-ouster-vote-00153802"
  },
  {
    "text": "Biden scores major union backing as its leaders attack Trump  —  Joe Biden will land a major union endorsement Wednesday from North America's Building Trades Unions, whose leaders say the president has his infrastructure bill largely to thank for it.  —  In making one of their earliest ever … ",
    "url": "https://www.cnn.com/2024/04/23/politics/biden-building-trades-union-endorsement"
  },
  {
    "text": "George Santos ends comeback bid for Congress after raising no money  —  Former U.S. Rep. George Santos on Tuesday said he is dropping his longshot bid to return to Congress, months after he was expelled from the House while facing a slew of federal fraud charges.",
    "url": "https://apnews.com/article/george-santos-congress-campaign-a4c4cc2ea7cb52a13ec9f8dfc5ede86c"
  },
  {
    "text": "Biden administration makes it easier for flyers to get refunds  —  The rule comes after more than a year of promises by the administration to shore up protections for air passengers.  —  Passengers whose flights are canceled or “significantly” delayed won't have to fight to get a cash refund … ",
    "url": "https://www.politico.com/news/2024/04/24/biden-administration-makes-it-easier-for-flyers-to-get-refunds-00154015"
  },
  {
    "text": "Why narrow majorities and House gridlock are here to stay in 2024  —  The number of truly competitive seats is smaller than it's been in decades.  —  The battle for the House will be determined by a smaller number of races than it has in at least the past two decades.",
    "url": "https://www.politico.com/news/2024/04/24/congress-narrow-majority-gridlock-00153921"
  },
  {
    "text": "Tennessee House passes bill allowing armed teachers, sending measure to the governor  —  Melissa Brown Angele LathamNashville Tennessean  —  Tennessee House Republicans on Tuesday passed legislation to allow some trained teachers and school staff to carry handguns despite pleas from Democrats … ",
    "url": "https://www.tennessean.com/story/news/politics/2024/04/23/tennessee-house-republicans-pass-bill-to-allow-teachers-to-carry-handguns/73331384007/"
  },
  {
    "text": "The media should be celebrating college protesters instead of demonizing them  —  Mainstream-media reporters covering the growing wave of college protests against Israel's war in Gaza have adopted an overwhelmingly negative tone about something they should be celebrating … ",
    "url": "https://presswatchers.org/2024/04/the-media-should-be-celebrating-college-protesters-instead-of-demonizing-them/"
  },
  {
    "text": "I Thought the Bragg Case Against Trump Was a Legal Embarrassment.  Now I Think It's a Historic Mistake.  —  About a year ago, when Alvin Bragg, the Manhattan district attorney, indicted former President Donald Trump, I was critical of the case and called it an embarrassment.",
    "url": "https://www.nytimes.com/2024/04/23/opinion/bragg-trump-trial.html"
  },
  {
    "text": "Biden-Harris administration finalizes rule to increase compensation thresholds for overtime eligibility, expanding protections for millions of workers  —  Rule ensures salaried workers making less than $58,656 receive fair pay for long hours  —  WASHINGTON - The Biden-Harris administration today announced … ",
    "url": "https://www.dol.gov/newsroom/releases/whd/whd20240423-0"
  }
]