[
  {
    "text": "Trump's criminal trial is off to a bad start for him  —  PN is a reader-supported publication made possible by paid subscribers.  If you aren't one, please click the button to support our independent journalism.  —  ⚖️ Subscribe to Public Notice ⚖️",
    "url": "https://www.publicnotice.co/p/trump-criminal-hush-money-trial-pecker-stormy"
  },
  {
    "text": "The gag “trap” of Manhattan's hush-money trial: “Trump will take the bait”  —  Will Donald Trump take the stand in his own defense?  Experts weigh in on his first criminal trial  —  The second week of Donald Trump's historic criminal trial in Manhattan for allegedly paying “hush money” … ",
    "url": "https://www.salon.com/2024/04/29/the-gag-trap-of-manhattans-hush-money-trial-trump-will-take-the-bait/"
  },
  {
    "text": "Playbook: Will MTG put up or shut up?  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  LIVE FROM RIYADH — AP's Matthew Lee: “U.S. Secretary of State ANTHONY BLINKEN said Monday that Israel must still do more to increase the flow of humanitarian aid … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/04/29/will-mtg-put-up-or-shut-up-00154883"
  },
  {
    "text": "On Friday, in an interview with CNN anchor Kaitlan Collins, Trump's former attorney general William Barr brushed off the recent news that Trump, furious that the story he had taken refuge in a bunker during the Black Lives Matter protests in summer 2020 had leaked, called for the White House leaker to be executed.",
    "url": "https://heathercoxrichardson.substack.com/p/april-28-2024"
  },
  {
    "text": "Peter Navarro's get-out-of-jail request is again rejected by the Supreme Court  —  The Supreme Court on Monday for a second time shot down a request from former Trump adviser Peter Navarro to avoid further prison time over his contempt of Congress conviction.",
    "url": "https://www.cnn.com/2024/04/29/politics/supreme-court-rejects-peter-navarros-get-of-jail-request-again/"
  },
  {
    "text": "Trump says 4 words about anti-Israel protests on college campuses as arrests skyrocket  —  Former President Trump's post came as the number of students and antisemitic agitators arrested has approached 900 since April 18  —  Former President Trump weighed in on Monday about the anti-Israel demonstrations … ",
    "url": "https://www.foxnews.com/politics/trump-says-anti-israel-protests-college-campuses-arrests-skyrocket"
  },
  {
    "text": "Tensions grow between Trump and Lake in Arizona race for Senate  —  The former president fears that GOP candidate Kari Lake might not win and will drag down his own prospects in the battleground state  —  Former president Donald Trump has long had a soft spot for his acolyte Kari Lake … ",
    "url": "https://www.washingtonpost.com/politics/2024/04/29/trump-kari-lake-arizona-tensions/"
  },
  {
    "text": "Why millions of Americans may lose internet access tomorrow  —  In 2024, reliable access to high-speed internet is no longer a luxury; it is a basic necessity.  From job applications to managing personal finances and completing school work, internet access is an essential part of daily life.",
    "url": "https://popular.info/p/why-millions-of-americans-may-lose"
  },
  {
    "text": "An assassination plot on American soil reveals a darker side of Modi's India  —  The White House went to extraordinary lengths last year to welcome Indian Prime Minister Narendra Modi in a state visit meant to bolster ties with an ascendant power and potential partner against China.",
    "url": "https://www.washingtonpost.com/world/2024/04/29/india-assassination-raw-sikhs-modi/"
  },
  {
    "text": "Surprise Tactics and Legal Threats: Inside R.F.K. Jr.'s Ballot Access Fight  —  Robert F. Kennedy Jr.'s effort to get on the ballot in 50 states has already cost millions, federal campaign finance records show.  —  As Robert F. Kennedy Jr.'s independent presidential campaign mounts … ",
    "url": "https://www.nytimes.com/2024/04/29/us/politics/rfk-jr-ballot-access.html"
  },
  {
    "text": "Supreme Court rejects Elon Musk over agreement with SEC to vet social media posts  —  Lawyers for the billionaire businessman say that the “Twitter sitter” provision in an agreement with the Securities and Exchange commission violated his free speech rights.",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-rejects-elon-musk-agreement-sec-vet-social-media-posts-rcna149579"
  },
  {
    "text": "Statement from Columbia University President Minouche Shafik  —  Dear fellow members of the Columbia community,  —  Our University is committed to four core principles, which underpin all of our work and our shared values as a community:  —  First, we must keep all members of our community physically safe on campus.",
    "url": "https://president.columbia.edu/news/statement-columbia-university-president-minouche-shafik-4-29"
  },
  {
    "text": "Trump and allies say Biden pays rent for ‘illegals’ in Michigan.  Not true.  —  The Fact Checker … — Former president Donald Trump, in a social media video, April 11 … — Voice-over in MAGA Inc. ad titled “Phone Bank,” April 26 … — radio ad via MAGA Inc., “Lecture,” April 26",
    "url": "https://www.washingtonpost.com/politics/2024/04/29/trump-allies-say-biden-pays-rent-illegals-michigan-not-true/"
  },
  {
    "text": "Trump and DeSantis, once GOP rivals, meet in South Florida to talk about 2024 election  —  Florida Governor Ron DeSantis met privately with former President Donald Trump for several hours on Sunday morning to talk, in part, about fundraising ahead of the 2024 general election, several sources familiar with the meeting tell CBS News.",
    "url": "https://www.cbsnews.com/news/trump-desantis-meeting-florida/"
  },
  {
    "text": "Israeli Officials Believe I.C.C. Is Preparing Arrest Warrants Over War  —  The officials said they believed that Prime Minister Benjamin Netanyahu and other Israelis could be charged, and that the court was also considering warrants for Hamas leaders.  —  Israeli officials increasingly believe … ",
    "url": "https://www.nytimes.com/2024/04/28/world/middleeast/icc-arrest-warrants-israel-hamas.html"
  },
  {
    "text": "Trump to Attend Las Vegas Fundraiser with $844,600 Tickets  — Trump increasingly courting wealthy donors to close money gap  — Recent poll shows Trump up over Biden in swing-state Nevada  —  Presumptive Republican nominee Donald Trump is slated to attend a fundraiser in swing-state Nevada … ",
    "url": "https://www.bloomberg.com/news/articles/2024-04-29/trump-to-attend-las-vegas-fundraiser-with-844-600-tickets"
  },
  {
    "text": "There's never a good time to drink raw milk.  But now's a really bad time as bird flu infects cows  —  Scientists who know about the types of pathogens — E. coli and Salmonella among them — that can be transmitted in raw milk generally think drinking unpasteurized milk is a bad idea.",
    "url": "https://www.statnews.com/2024/04/29/bird-flu-raw-milk-h5n1-risk-us-cattle/"
  },
  {
    "text": "Arizona state senator indicted in fake electors scheme is tapped for RNC position  —  Arizona state Sen. Jake Hoffman, one of the so-called fake electors charged in the Arizona 2020 election subversion case, announced Saturday that he's been elected as a Republican National Committee national committeeman for the state.",
    "url": "https://www.cnn.com/2024/04/29/politics/jake-hoffman-indicted-fake-elector-arizona-gop-rnc/"
  }
]