[
  {
    "text": "Trump under oath: Six things to watch for as the former president testifies  —  Trump will take the stand in a case that could unravel his business empire.  —  NEW YORK — On Monday, Donald Trump will leave the campaign trail for a place where he'll still be the center of attention: a witness box.",
    "url": "https://www.politico.com/news/2023/11/06/trump-civil-fraud-trial-testimony-00125458"
  },
  {
    "text": "She Tangled with Trump in a Deposition.  Here's Her Strategy When He's Under Oath.  —  “Just let him talk.  I got exactly what I wanted by letting him talk.”  —  Former President Donald Trump and his family are accused of fraudulently inflating Trump's net worth in a case that could upend his New York businesses.",
    "url": "https://www.politico.com/news/magazine/2023/11/06/tips-questioning-trump-under-oath-00125439"
  },
  {
    "text": "Ivanka Is Not Going to Save Trump in His New York Fraud Trial—and He's Not Going to Save Himself  —  His daughter is the only non-defendant among the Trumps, but Daddy shouldn't expect her to come to his rescue when she testifies. … Former President Donald Trump boasts about his children following in his footsteps.",
    "url": "https://www.thedailybeast.com/ivanka-is-not-going-to-save-trump-in-new-york-fraud-trial"
  },
  {
    "text": "Playbook: Trump testimony kicks off a jam-packed week  —  Presented by With help from Eli Okun and Garrett Ross  —  DRIVING THE DAY  —  November kicked off with a brief reprieve from the drama that engulfed the House — and all of Washington — last month.",
    "url": "https://www.politico.com/newsletters/playbook/2023/11/06/trump-testimony-kicks-off-a-jam-packed-week-00125493"
  },
  {
    "text": "Trump Indictments Haven't Sunk His Campaign, but a Conviction Might  —  Polls by The New York Times and Siena College show his strength in key swing states, in part because of concerns about President Biden's age.  But a conviction could be the difference in 2024.",
    "url": "https://www.nytimes.com/2023/11/06/us/politics/trump-biden-times-siena-poll.html"
  },
  {
    "text": "Behind the Curtain: Biden's race problem  —  President Biden has a growing race problem. … Now this is an alarming, re-election-threatening, full-blown crisis for the White House.  — It's clear from consistent trends across multiple polls that Biden is bleeding support among Hispanic voters … ",
    "url": "https://www.axios.com/2023/11/06/biden-black-hispanic-voters-losing-polls"
  },
  {
    "text": "Indy police arrest ‘terrorist’ for purposely driving her car into what she thought was a Jewish school  —  INDIANAPOLIS — IMPD officers arrested a woman, who they labeled a “terrorist,” after she drove her car into a building that she thought was a Jewish school.",
    "url": "https://fox59.com/news/indy-police-arrest-terrorist-for-purposely-driving-her-car-into-home-used-by-hate-group/"
  },
  {
    "text": "Boy killed, 5 wounded in Cincinnati mass shooting  —  A shooter fired 22 shots into a crowd in Cincinnati, Ohio on Friday, killing an 11-year-old boy and wounding four other children and an adult, according to local authorities.  —  The Cincinnati Police Department on Sunday said the occupant … ",
    "url": "https://thehill.com/homenews/4295119-boy-killed-5-wounded-in-cincinnati-mass-shooting/"
  },
  {
    "text": "Expect a rough two weeks for Speaker Johnson  —  Good morning, Early Birds.  Welcome to William Lewis, who this weekend was named The Post's next publisher — or as we'll be referring to him, Sir William.  (He was recently knighted.)  He starts in January.  Tips: earlytips@washpost.com.",
    "url": "https://www.washingtonpost.com/politics/2023/11/06/expect-rough-two-weeks-speaker-johnson/"
  },
  {
    "text": "“Apocalypticism”: Polling expert reveals the root of “panic among conservative White Christians”  —  “That core belief explains so much of the extremism and the proclivity toward violence on the political right”  —  This year's American Values Survey, conducted by the Public Religion Research Institute … ",
    "url": "https://www.salon.com/2023/11/06/apocalypticism-polling-expert-reveals-the-root-of-panic-among-conservative-christians/"
  },
  {
    "text": "Meijer jumps into Michigan GOP Senate primary  —  Former Rep. Pete Meijer (R-Mich.) on Monday launched a bid for the U.S. Senate in Michigan, joining a crowded GOP primary for the seat to replace Sen. Debbie Stabenow (D-Mich.) next fall.  —  “We are in dark and uncertain times … ",
    "url": "https://thehill.com/homenews/campaign/4287541-meijer-jumps-into-michigan-gop-senate-primary/"
  },
  {
    "text": "Watch: Just Stop Oil Climate Crazies Smash Glass Protecting 17th Century Painting with Hammers  —  Two Just Stop Oil activists were arrested after using hammers to smash the glass protecting the Rokeby Venus painting at the National Gallery in London on Monday morning.",
    "url": "https://www.breitbart.com/europe/2023/11/06/watch-just-stop-oil-climate-crazies-smash-glass-protecting-17th-century-painting-with-hammers/"
  },
  {
    "text": "Will the Supreme Court Toss Out a Gun Law Meant to Protect Women?  —  Ever since the Supreme Court agreed in June to hear the government's appeal of a particularly noxious Second Amendment ruling, I had been curious to see which “friends of the court” might emerge on the gun-rights side.",
    "url": "https://www.nytimes.com/2023/11/06/opinion/guns-domestic-abuse-supreme-court.html"
  },
  {
    "text": "How Republicans are using congressional maps to entrench their power  —  Michael Li on the state of gerrymandering one year out from the 2024 election.  —  ∙ Paid … The Supreme Court surprised many in June when it ruled that Alabama had to redraw its congressional district maps … ",
    "url": "https://www.publicnotice.co/p/michael-li-congressional-maps-gerrymander-2024"
  }
]