[
  {
    "text": "Trump gave pardons to hundreds of violent Jan. 6 rioters.  Here's what they did  —  Loading...  Throughout his 2024 campaign for president, Donald Trump repeatedly promised to give pardons to his supporters who had been criminally charged in the Jan. 6, 2021, attack on the U.S. Capitol.",
    "url": "https://www.npr.org/2025/01/21/nx-s1-5268919/trump-issues-jan-6-pardons-attack-capitol-clemency"
  },
  {
    "text": "Trump pushes Hill GOP on recess appointments, debt limit  —  A White House meeting on the president's first full day back in office emphasized unity.  —  President Donald Trump prodded congressional leaders to consider recess appointments for his top nominees and expressed interest … ",
    "url": "https://www.politico.com/news/2025/01/21/trump-johnson-thune-white-house-005697"
  },
  {
    "text": "Jan. 6 Defendants Leave Prison as Trump's Broad Pardons Draw Sharp Reactions  —  Some Republicans voice concerns about decision to clear people convicted of violent offenses  —  Some of the highest profile defendants convicted in the Jan. 6, 2021, Capitol riot were set free Tuesday … ",
    "url": "https://www.wsj.com/politics/policy/jan-6-defendants-leave-prison-as-trumps-broad-pardons-draw-sharp-reactions-672fd03e?st=3xLGJT&reflink=article_copyURL_share"
  },
  {
    "text": "Senators receive affidavit containing new allegations against Pete Hegseth, who denies the claims  —  The former sister-in-law of Trump's defense secretary pick said that Hegseth made his second wife fear for her safety.  Hegseth's second wife said, “There was no physical abuse in my marriage.”",
    "url": "https://www.nbcnews.com/politics/national-security/senators-received-affidavit-containing-new-allegations-pete-hegseth-de-rcna188342"
  },
  {
    "text": "Hegseth Ex-Sister-in-Law Tells Senators He Was ‘Abusive’ to Second Wife  —  A woman once married to the brother of Pete Hegseth, the defense secretary nominee, submitted a sworn statement to the Senate in a late-hour complication to his confirmation.  His attorney denied her account.",
    "url": "https://www.nytimes.com/2025/01/21/us/politics/hegseth-senators-affidavit.html?unlocked_article_code=1.q04.WqU2.FjpnG4Psf5Uq&smid=url-share"
  },
  {
    "text": "Senate learns of new allegations against Hegseth  —  The Defense secretary nominee's former sister-in-law, in an affidavit, said she witnessed his drunken aggression and that his second wife worried about her safety.  —  Pete Hegseth's former sister-in-law, in an affidavit given to senators on Tuesday … ",
    "url": "https://www.politico.com/news/2025/01/21/hegseth-new-allegations-00199730"
  },
  {
    "text": "Trump pardons Silk Road creator Ross Ulbricht … - He added, “The scum that worked to convict him were some of the same lunatics who were involved in the modern day weaponization of government against me.”",
    "url": "https://www.axios.com/2025/01/22/trump-ross-ulbricht-silk-road"
  },
  {
    "text": "Trump Pardons Creator of Silk Road Drug Marketplace  —  Ross Ulbricht was serving a life sentence for creating a site in a shady corner of the internet to sell heroin, cocaine and other illicit substances.  —  President Trump on Tuesday granted a pardon to Ross Ulbricht … ",
    "url": "https://www.nytimes.com/2025/01/21/technology/trump-ross-ulbricht-silk-road.html"
  },
  {
    "text": "Trump officials pause health agencies' communications, citing review  —  The agencies are charged with making decisions that touch the lives of every American and are the source of crucial information to health-care providers.  —  The Trump administration has instructed federal health agencies … ",
    "url": "https://www.washingtonpost.com/health/2025/01/21/trump-hhs-cdc-fda-communication-pause/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM3NDM1NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM4ODE3OTk5LCJpYXQiOjE3Mzc0MzU2MDAsImp0aSI6ImEzODFhN2UxLTRhOGUtNGFjOS1hNGRmLTEyNDk5ZWIzNGFiOSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9oZWFsdGgvMjAyNS8wMS8yMS90cnVtcC1oaHMtY2RjLWZkYS1jb21tdW5pY2F0aW9uLXBhdXNlLyJ9.cY26hIDkmu_AWumnD7uJ1Ge-rGGy5hoacMYbVpbSyJM&itid=gfta"
  },
  {
    "text": "Great-grandson of the man who established birthright citizenship slams Trump's new executive order  —  “He's feeding off the American mindset, and it's not a healthy one,” said the great-grandson of Wong Kim Ark, whose 1898 Supreme Court case helped guarantee birthright citizenship.",
    "url": "https://www.nbcnews.com/news/asian-america/wong-kim-ark-birthright-citizenship-trump-executive-order-rcna188481"
  },
  {
    "text": "Bishop Calls Out Trump and Vance To Their Face  —  This stunning video highlights the first direct call out received by Trump and Vance since taking office.  —  This afternoon, Bishop Mariann Edgar Budde fearlessly called out Donald Trump and JD Vance to their faces at a national prayer service.",
    "url": "https://meidasnews.com/news/bishop-calls-out-trump-and-vance-to-their-face"
  },
  {
    "text": "‘All Americans legally female’: Trump invites mockery with sloppy executive order  —  President Donald Trump published two executive orders late Monday that targeted transgender people, but critics couldn't help but note that the clunky language declared all Americans legally female.",
    "url": "https://www.rawstory.com/trump-transgender-2670902521/"
  },
  {
    "text": "Trump's Gender Order Won't Affect Existing Passports — Unless They're Renewed  —  “They can still apply to renew their passport — they just have to use their God-given sex, which was decided at birth,” the White House press secretary told NOTUS.  — Copy",
    "url": "https://www.notus.org/whitehouse/trump-gender-sex-order-passports"
  },
  {
    "text": "AOC slams ADL for excusing Elon Musk's ‘awkward gesture:’ 'You're defending a Heil Hitler salute'  —  Musk spoke at an inauguration event for President Trump after he was sworn in on Monday  —  Rep. Alexandria Ocasio-Cortez, D-N.Y., attacked the Anti-Defamation League (ADL) … ",
    "url": "https://www.foxnews.com/media/aoc-slams-adl-excusing-elon-musks-awkward-gesture-youre-defending-heil-hitler-salute"
  },
  {
    "text": "Trump removes US Coast Guard chief, official cites DEI focus  —  The Trump administration has fired U.S. Coast Guard Commandant Admiral Linda Lee Fagan, the first female uniformed leader of an armed forces branch, the Department of Homeland Security said on Tuesday.",
    "url": "https://www.reuters.com/world/us/trump-fires-coast-guard-commandant-over-dei-security-fox-news-reports-2025-01-21/"
  },
  {
    "text": "Trump says ICE can arrest people at churches and schools, directs agency to use ‘common sense’  —  Federal immigration authorities will be permitted to arrest people and carry out enforcement actions in and near places such as churches and schools, marking a departure from long-standing policy to avoid so-called sensitive areas.",
    "url": "https://www.cnn.com/2025/01/21/politics/ice-can-arrest-people-at-churches-and-schools/"
  },
  {
    "text": "Donald Trump's Medicare Executive Order Explained  —  's executive order 14087, which was put in place to lower the cost of prescription drugs for Americans.  —  Newsweek has reached out to the Trump transition team outside of regular working hours via email for comment.  —  Why It Matters",
    "url": "https://www.newsweek.com/donald-trump-medicare-executive-order-explained-2018138"
  },
  {
    "text": "Trump terminates John Bolton's security detail within hours of taking office  —  Within hours of taking office, President Donald Trump terminated the Secret Service detail that was assigned to his former national security adviser John Bolton, Bolton confirmed to CNN on Tuesday.",
    "url": "https://www.cnn.com/2025/01/21/politics/john-bolton-security-detail-trump"
  },
  {
    "text": "Democrats plot strategy for fighting Trump on funding freeze  —  Less than 24 hours after President Donald Trump's Day One blitz of executive actions, Democrats on Capitol Hill mobilized Tuesday to fight his move to freeze a broad range of federal cash.  House Minority Leader Hakeem Jeffries … ",
    "url": "https://www.politico.com/live-updates/2025/01/21/congress/democrats-house-funding-freeze-trump-00199805"
  },
  {
    "text": "Trump's crypto grifts: billions in paper profits, millions from memecoin trading fees, and new funding from Chinese-born entrepreneur Justin Sun  —  Grifter-in-Chief Donald Trump will not let an opportunity to profit pass him by.  —  This past Saturday, two days before the inauguration … ",
    "url": "https://newstracs.com/trumps-crypto-grifts-memecoin-trading-fees-and-a-new-investment-from-justin-sun/2025/01/21/"
  },
  {
    "text": "Trump Says He Will Impose 10% Tariffs on Chinese Imports on Feb. 1  —  The president said the planned duties were a response to China's failure to curb fentanyl exports.  —  President Trump said on Tuesday that he intended to impose a 10 percent tariff on Chinese imports into the United States on Feb. 1 … ",
    "url": "https://www.nytimes.com/2025/01/21/business/trump-tariffs-china.html"
  },
  {
    "text": "Trump announces AI infrastructure investment backed by Oracle, OpenAI and Softbank",
    "url": "https://www.cnbc.com/2025/01/21/trump-ai-openai-oracle-softbank.html"
  },
  {
    "text": "Trump finds a new way for foreign governments to pay him off: Crypto  —  Trump's crypto coin is little more than a whizbang Ponzi scheme.  —  The era of the Shakedown Economy has officially begun — and it started with something called a presidential “sh—coin.”  —  No, I am not making this up.",
    "url": "https://www.washingtonpost.com/opinions/2025/01/21/trump-crypto-ponzi-scheme/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM3NDM1NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM4ODE3OTk5LCJpYXQiOjE3Mzc0MzU2MDAsImp0aSI6Ijc5NGMyMjIyLTg5MzctNGQyYS04ODk2LTUxZDdmZTAzNzBiMSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9vcGluaW9ucy8yMDI1LzAxLzIxL3RydW1wLWNyeXB0by1wb256aS1zY2hlbWUvIn0.0Oo2br-a7bM1hiv33dS1zXYZ4WFddh1Oikn93mzPX5k"
  },
  {
    "text": "Instagram hides search results for ‘Democrats’  —  Meta says its working urgently to fix a problem with Instagram which results in a “results hidden” message when users search for the terms “Democrat” or “Democrats”.  —  Some social media users have accused the company of political bias … ",
    "url": "https://www.bbc.com/news/articles/c4g32yxpdz0o"
  },
  {
    "text": "Decentralized Social Media Is the Only Alternative to the Tech Oligarchy  —  If it wasn't already obvious, the last 72 hours have made it crystal clear that it is urgent to build and mainstream alternative, decentralized social media platforms that are resistant to government censorship and control … ",
    "url": "https://www.404media.co/decentralized-social-media-is-the-only-alternative-to-the-tech-oligarchy/"
  }
]