[
  {
    "text": "Trump Launches into Courtroom Tirade About ‘Witch Hunt’ Fraud Case, Claiming He Deserves Damages  —  The former president didn't wait for the judge's permission before reciting a roughly five-minute rant that he's being ‘persecuted’  —  Donald Trump launched into a tirade Thursday … ",
    "url": "https://themessenger.com/politics/trump-new-york-courtroom-rant-witch-hunt-fraud-case"
  },
  {
    "text": "Trump's Lawyers Argue Biden Can Assassinate Him  —  I CONFESS TO A LONGSTANDING PREFERENCE for the Army's Delta Force over the Navy's SEAL Team Six.  The preference is not rational—it is the product, no doubt, of some latent pro-Army sentiment because my stepson served in that branch.",
    "url": "https://plus.thebulwark.com/p/trump-lawyers-argue-biden-can-assassinate-him"
  },
  {
    "text": "In the Bronx, Trump's Name Is Replaced at a Golf Course  —  The removal of the sign by the golf course's new owner, Bally's Corporation, was another example of Trump's withdrawal from New York City.  —  As closing arguments began in President Donald J. Trump's civil fraud trial in Manhattan on Thursday … ",
    "url": "https://www.nytimes.com/2024/01/11/nyregion/trump-links-ballys-bronx.html"
  },
  {
    "text": "Hunter Biden attends House committee vote to cite him for contempt, walks out on Marjorie Taylor Greene  —  The votes came hours after Hunter Biden strolled smiling into the Oversight meeting, sparking a fierce reaction among lawmakers who called him a coward and other names.",
    "url": "https://www.usatoday.com/story/news/politics/2024/01/10/hunter-biden-contempt-subpoena-house-judiciary-oversight/72165306007/"
  },
  {
    "text": "Jill Biden slams ‘horrible’ Republicans for showing nude Hunter photos during hearing and says what they're doing to him is ‘cruel’  — ‘What they are doing to Hunter is cruel,’ she said in interview on Morning Joe  — She also defended Joe's Biden age: ‘I say his age is an asset’",
    "url": "https://www.dailymail.co.uk/news/article-12951907/jill-hunter-biden-congress-republicans-nude-photos-hearing.html"
  },
  {
    "text": "Democrats Propose Bill to Neuter Militias  —  The “Preventing Private Paramilitary Activity Act” would effectively limit most militia activity.  —  Militias who like to spend their weekends training to overthrow the government could find themselves running afoul of federal law … ",
    "url": "https://www.vice.com/en/article/n7e5xm/democrats-propose-bill-to-neuter-militias"
  },
  {
    "text": "New Hampshire 2024 Poll: Haley Gains, Trump Loses Support but Maintains Lead  —  Haley is Second Choice for 52% of Christie Voters  —  A new Emerson College Polling/WHDH New Hampshire survey finds former President Donald Trump leading the Republican Primary with 44% support, followed by Nikki Haley with 28%.",
    "url": "https://emersoncollegepolling.com/new-hampshire-2024-poll-haley-gains-trump-loses-support-but-maintains-lead/"
  },
  {
    "text": "Kim Reynolds Has Another Account, @Kimberl26890376, and Opinions About Donald Trump  —  In recent months, the Republican governor of Iowa has used a secondary account on X to share her unfiltered feelings on the Republican presidential primary race.  —  Not long after the calendar turned to 2024 … ",
    "url": "https://www.nytimes.com/2024/01/11/us/politics/kim-reynolds-twitter-account.html"
  },
  {
    "text": "Ohio woman who miscarried at home will not be criminally charged, grand jury says  —  Brittany Watts, 34, had been charged with a felony for abuse of a corpse after she miscarried in her bathroom and was later admitted to a hospital for a life-threatening hemorrhage.",
    "url": "https://www.nbcnews.com/news/us-news/ohio-woman-miscarried-home-will-not-criminally-charged-grand-jury-says-rcna132093"
  },
  {
    "text": "Hogan steps down from No Labels board amid 2024 speculation  —  Former Maryland Gov. Larry Hogan (R) stepped down as co-chair of No Labels last month, raising speculation about a potential third party presidential campaign.  —  Hogan's resignation letter, dated Dec. 15 and first reported … ",
    "url": "https://thehill.com/homenews/campaign/4398706-hogan-steps-down-no-labels-board-2024-speculation/"
  },
  {
    "text": "Secret Recording Shows NRA Treasurer Plotting to Conceal Extravagant Expenses Involving Wayne LaPierre  —  Audio obtained by The Trace and ProPublica reveals, in real time, the gun lobbying group enacting a plan that would conceal payments for fancy hotels, limousines and other luxury expenses connected to its longtime CEO for a decade.",
    "url": "https://www.propublica.org/article/nra-wayne-lapierre-recording-private-jet-limousine-expenses"
  },
  {
    "text": "Live updates Closing statements conclude in Trump's N.Y. civil fraud trial  —  Closing statements concluded Thursday in New York state's $370 million civil fraud trial against Donald Trump, his company and others.  Show more  —  Key updates  —  Trump rails against trial, judge from courtroom seat",
    "url": "https://www.washingtonpost.com/national-security/2024/01/11/trump-new-york-fraud-trial-closing-arguments/"
  },
  {
    "text": "Johnson's rider push meets reality  —  With an assist from Ursula Perano, Jordain Carney, Burgess Everett and Katherine Tully-McManus  —  RIDERS OR DIE?  —  Speaker Mike Johnson is selling the dream of conservative “policy riders” as a big upside to the nearly $1.7 trillion bipartisan funding deal reached over the weekend.",
    "url": "https://www.politico.com/newsletters/inside-congress/2024/01/10/johnsons-rider-push-meets-reality-00134903"
  },
  {
    "text": "Johnson flails as Republicans demand consequences for conservative hijacking  —  The speaker denied making any commitments to conservatives who want him to scrap this week's bipartisan government spending agreement.",
    "url": "https://www.politico.com/live-updates/2024/01/11/congress/conservatives-push-johnson-00135080"
  },
  {
    "text": "Maryland Elections Board member arrested on Jan. 6 riot charges resigns  —  Carlos Ayala, nominated to the state's top election board by Republicans last year, allegedly wore a ‘Stop the Steal’ button while breaching the U.S. Capitol  —  A top Maryland elections official was arrested this week … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2024/01/11/january-6-maryland-elections-official/"
  },
  {
    "text": "Feds charge eBay over employees who sent live spiders and cockroaches to couple; company to pay $3M  —  Online retailer eBay Inc. will pay a $3 million fine to resolve criminal charges over a harassment campaign waged by employees who sent live spiders, cockroaches and other disturbing items … ",
    "url": "https://apnews.com/article/ebay-spiders-cockroaches-steiner-newsletter-9ac2c35bcd4c87af181382c71d992343"
  },
  {
    "text": "Hunter Biden pleads not guilty to nine tax charges  —  Hunter Biden pleaded not guilty on Thursday to all nine charges he is facing in California over allegations that he failed to pay his taxes during a four-year period.  —  President Joe Biden's son appeared at a federal courthouse … ",
    "url": "https://www.washingtonexaminer.com/news/2791878/hunter-biden-pleads-not-guilty-to-nine-tax-charges/"
  },
  {
    "text": "House votes down Biden ‘Buy America’ waiver for EV chargers  —  The House voted 209-198 Wednesday to overturn a Biden administration waiver that allows federal funds to go to electric vehicle (EV) chargers even if the chargers are not made from U.S.-produced steel and iron.",
    "url": "https://thehill.com/policy/transportation/4399984-house-votes-down-biden-buy-america-waiver-for-ev-chargers/"
  },
  {
    "text": "Republicans respond to Trump ballot bans with bill to make SCOTUS only authority on insurrection challenges  —  Tillis leading bill to create expedited process for Supreme Court to review 14th Amendment ballot cases  —  Read this article for free!  —  Plus get unlimited access to thousands of articles … ",
    "url": "https://www.foxnews.com/politics/republicans-respond-trump-ballot-bans-bill-scotus-only-authority-insurrection-challenges"
  },
  {
    "text": "Update on FDA's ongoing evaluation of reports of suicidal thoughts or actions in patients taking a certain type of medicines approved for type 2 diabetes and obesity  —  Preliminary evaluation does not suggest a causal link  —  Drug Safety Communication (PDF - 214 KB)",
    "url": "https://www.fda.gov/drugs/drug-safety-and-availability/update-fdas-ongoing-evaluation-reports-suicidal-thoughts-or-actions-patients-taking-certain-type"
  },
  {
    "text": "Biden Campaign to Send Top Allies to Iowa to Spread Democrats' Message  —  The Hollywood mogul Jeffrey Katzenberg, Gov. J.B. Pritzker of Illinois and Senator Tina Smith of Minnesota are expected to appear on Monday, as Republicans hold their caucuses.  —  Iowa is dominated by Republicans right now.",
    "url": "https://www.nytimes.com/2024/01/11/us/politics/biden-iowa-katzenberg-pritzker-smith.html"
  },
  {
    "text": "The Plot Thickens in the Fani Willis Corruption Allegations  —  These Fani Willis allegations are getting crazier by the day.  By now, I'm sure you've read Athena Thorne's intrepid report on the accusations that Willis hired an attorney with whom she is supposedly carrying on an extramarital affair … ",
    "url": "https://pjmedia.com/chris-queen/2024/01/10/the-plot-thickens-in-the-fani-willis-corruption-allegations-n4925369"
  }
]