[
  {
    "text": "Trump suggests Panama Canal be returned to US control  —  President-elect Trump on Sunday again took on the matter of the Panama Canal, suggesting to a conference of his supporters that it be returned to U.S. control in a remarkable suggestion to push a sovereign country to cede territory.",
    "url": "https://thehill.com/homenews/administration/5052795-trump-suggests-panama-canal-be-returned-to-us-control/"
  },
  {
    "text": "Trump Previews Second Term in Sprawling Speech to Conservative Conference  —  President-elect Donald J. Trump repeated false claims about immigration and the border, slammed diversity initiatives and discussed the Panama Canal in the 90-minute address.  —  President-elect Donald J. Trump delivered … ",
    "url": "https://www.nytimes.com/2024/12/22/us/politics/trump-speech-turning-point-arizona.html"
  },
  {
    "text": "Panama's Leader Takes Up Feud With Trump Over Canal Control  — US president-elect stokes fight over fees, China's influence  — Mulino says canal is Panama's, cites treaties with the US  —  Panama's president rebuffed Donald Trump's threat to reimpose US control over the Panama Canal … ",
    "url": "https://www.bloomberg.com/news/articles/2024-12-22/panama-s-leader-takes-up-feud-with-trump-over-canal-s-control"
  },
  {
    "text": "Retiring U.S. Rep. Kay Granger experiencing ‘dementia issues,’ per family  —  Retiring U.S. Rep. Kay Granger, R-Fort Worth, has missed votes in Congress since the summer and her son said she has been “having some dementia issues late in the year.”  The last time the 81-year-old congresswoman cast … ",
    "url": "https://www.dallasnews.com/news/politics/2024/12/22/republican-rep-kay-granger-texas-missed-votes-dementia/"
  },
  {
    "text": "Kay Granger is residing in assisted-living facility, her son tells Dallas publication  —  The Texas lawmaker had been noticeably absent from Congress in recent months.  —  The son of Rep. Kay Granger (R-Texas) confirmed that his mother has “dementia issues” that have kept her away from Congress … ",
    "url": "https://www.politico.com/news/2024/12/22/kay-granger-assisted-living-facility-texas-00195837"
  },
  {
    "text": "Joe Manchin torches Democrats on the way out the door  —  For more on Sen. Joe Manchin of West Virginia, watch CNN's “Inside Politics with Manu Raju” at 8 a.m. ET and 11 a.m. ET.  —  Washington CNN  —  As Joe Manchin prepares to leave Congress after nearly 15 years, the West Virginia senator … ",
    "url": "https://www.cnn.com/2024/12/22/politics/joe-manchin-congress-democratic-party/"
  },
  {
    "text": "Trump signals plans to use all levers of power against the media  —  Press freedom advocates say they fear that the second Trump administration will ramp up pressure on journalists, in keeping with the president-elect's combative rhetoric.  —  For many years, Donald Trump repeatedly threatened … ",
    "url": "https://www.washingtonpost.com/politics/2024/12/22/trump-abc-news-settlement-george-stephanopoulos/"
  },
  {
    "text": "New research shows the massive hole Dems are in  —  Even voters who previously backed Democrats cast the party as weak and overly focused on diversity and elites.  —  Democrats conducting post-mortems on their sweeping losses in 2024 are finding more reason for alarm.",
    "url": "https://www.politico.com/news/2024/12/22/democrats-2024-election-problem-focus-group-00195806"
  },
  {
    "text": "Bluesky finds with growth comes growing pains — and bots  —  Bluesky has seen its user base soar since the U.S. presidential election, boosted by people seeking refuge from Elon Musk's X, which they view as increasingly leaning too far to the right given its owner's support of President-elect Donald Trump … ",
    "url": "https://apnews.com/article/bluesky-growth-users-bots-misinformation-ce9df3b9166ec1ba36f3d5278ff60dcb"
  },
  {
    "text": "Letter Calling for Tracking People of Color Circulates in an Oregon County  —  The letter, distributed in Lincoln County, Ore., tells community members to report people who may be undocumented, the sheriff's office said.  —  A letter circulating in a coastal county in rural Oregon encourages … ",
    "url": "https://www.nytimes.com/2024/12/22/us/oregon-anti-immigrant-letter-investigation.html"
  },
  {
    "text": "Trump picks billionaire financier for deputy defense secretary  —  The choice of Stephen Feinberg of Cerberus Capital Management comes as Pete Hegseth continues to face questions in the confirmation process for the top Pentagon post.",
    "url": "https://www.washingtonpost.com/politics/2024/12/22/trump-defense-department-stephen-feinberg/"
  },
  {
    "text": "Trump nominates Callista Gingrich as U.S. ambassador to Switzerland, announces other picks  —  Trump also named PayPal co-founder Ken Howery to an ambassador position  —  President-elect Trump on Sunday named Callista Gingrich, wife to former Speaker of the House Newt Gingrich, as one of his latest U.S. ambassador nominees.",
    "url": "https://www.foxnews.com/politics/trump-nominates-callista-gingrich-u-s-ambassador-switzerland-announces-other-picks"
  },
  {
    "text": "Fetterman: Kash Patel Told Me He Won't Go After Trump's ‘Enemies List’  —  The senator said that Democrats should “chill out” about Trump  —  Sen. John Fetterman said that Kash Patel, Donald Trump's nominee to lead the FBI, assured him he will not be targeting Trump's enemies.",
    "url": "https://www.rollingstone.com/politics/politics-news/john-fetterman-kash-patel-trump-enemies-list-1235215270/"
  },
  {
    "text": "Why Big Tech is funding Trump's inauguration  —  Hefty donations from tech companies and leaders to President-elect Trump's inaugural fund are a sign of Silicon Valley's shifting relationship with the incoming leader after past tensions.  —  While inaugural donations by companies are nothing new … ",
    "url": "https://thehill.com/policy/technology/5047266-trump-inaugural-fund-tech-donations/"
  },
  {
    "text": "Two US Navy pilots shot down over Red Sea in apparent ‘friendly fire’ incident, US military says  —  Two U.S. Navy pilots were shot down Sunday over the Red Sea in an apparent “friendly fire” incident, the U.S military said, marking the most serious incident to threaten troops in over a year of America targeting Yemen's Houthi rebels.",
    "url": "https://apnews.com/article/mideast-wars-yemen-us-navy-pilots-houthi-95a792daae3b0120186bfc6c66e1b6fe"
  }
]