[
  {
    "text": "Verdict reached in E. Jean Carroll's defamation damages trial against Trump  —  The verdict comes after a dramatic day in court that included the former president storming out of the courtroom during Carroll's closing argument.  —  The jury in E. Jean Carroll's defamation damages trial … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/verdict-reached-e-jean-carrolls-defamation-damages-trial-trump-rcna135919"
  },
  {
    "text": "Trump's Court-Appointed Monitor Tells Judge Company Gave ‘Incomplete’ and ‘Inconsistent’ Disclosures with ‘Errors’  —  Court monitor Barbara Jones sent her letter to Justice Engoron, who will determine whether to ban Trump from New York real estate for life  —  JWPlayer",
    "url": "https://themessenger.com/politics/trump-barbara-jones-incomplete-inconsistent-disclosures-errors"
  },
  {
    "text": "Trump-Carroll Defamation Trial  —  Jury Orders Trump to Pay Carroll $83.3 Million for Years of Defamation  —  The jury found Donald J. Trump had acted maliciously in persistently attacking E. Jean Carroll.  He was found liable last year of sexually abusing her.  —  Jury orders Trump to pay Carroll damages for defamation.",
    "url": "https://www.nytimes.com/live/2024/01/26/nyregion/trump-carroll-defamation-trial"
  },
  {
    "text": "Trump trial live updates: Closing arguments in E. Jean Carroll case begin  —  Former President Donald Trump attended today's closing arguments briefly before storming out of court.  The judge presiding over the trial also lashed out at his lawyer for being late.",
    "url": "https://www.nbcnews.com/politics/donald-trump/live-blog/trump-e-jean-carroll-trial-live-updates-rcna135759"
  },
  {
    "text": "‘Oath-breaking insurrectionist’ Trump is ineligible for office, Colorado voters tell the Supreme Court  —  The justices hear arguments next month on whether Trump can be barred from office for his efforts to overturn the 2020 election results that culminated in the Jan. 6 Capitol attack.",
    "url": "https://www.nbcnews.com/politics/donald-trump/oath-breaking-insurrectionist-trump-ineligible-office-colo-voters-tell-rcna135904"
  },
  {
    "text": "Trump Must Pay $83.3 Million to E. Jean Carroll for Defamation  —  The former president has denied the journalist's rape and sexual assault accusation, telling reporters in 2019, 'she's not my type' and sparking a federal defamation lawsuit  —  JWPlayer  —  Former President Donald Trump … ",
    "url": "https://themessenger.com/politics/trump-verdict-e-jean-carroll-defamation-trial-damages-jury"
  },
  {
    "text": "Judge Threatens to Send Trump Lawyer Alina Habba ‘in the Lockup’ at E. Jean Carroll Trial  —  The blockbuster remark came moments before closing arguments in Trump's second trial in a case brought by E. Jean Carroll  —  A federal judge threatened Donald Trump's attorney Alina Habba with jail time on Friday … ",
    "url": "https://themessenger.com/politics/trump-alina-habba-jail-e-jean-carroll-federal-judge-threat"
  },
  {
    "text": "Trump storms out of courtroom during closing arguments in E. Jean Carroll's defamation damages trial  —  Carroll is seeking at least $10 million in damages from the former president for repeatedly defaming her after she accused him of sexually assaulting her in the 1990s.",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-e-jean-carroll-trial-closing-arguments-rcna135756"
  },
  {
    "text": "Judge threatens to send Trump attorney Alina Habba to jail over interruptions  —  U.S. District Judge Lewis Kaplan, the federal judge overseeing former President Trump's defamation trial brought by columnist E. Jean Carroll, threatened to send Trump attorney Alina Habba to jail after she interrupted him during Friday's proceedings.",
    "url": "https://thehill.com/regulation/court-battles/4431893-judge-threatens-to-send-trump-attorney-alina-habba-to-jail-over-interruptions/"
  },
  {
    "text": "Trump ordered to pay E. Jean Carroll $83.3M in defamation damages trial  —  NEW YORK — A federal court jury awarded a total of $83.3 million in damages to E. Jean Carroll for defamatory comments Donald Trump made about her as president in 2019, remarks attacking her character that kicked off years … ",
    "url": "https://www.washingtonpost.com/politics/2024/01/26/trump-verdict-e-jean-carroll-defamation-trial/"
  },
  {
    "text": "Trump Calls on ‘All Willing States’ to Send National Guard Soldiers to Texas  —  Sorry, were you expecting the former president to tell everyone to chill out?  —  Like pouring water on a grease fire, former President Donald Trump has weighed in on the escalating standoff between the federal government and Texas.",
    "url": "https://www.vice.com/en/article/epv7p7/trump-national-guard-texas-border-dispute-federal-government-standoff"
  },
  {
    "text": "Trump's border power play is a push for civil war  —  Donald Trump wants Congress to refuse to do any deal until he can win and create the “PERFECT” border  —  Donald Trump is having a rolling hissy fit that's escalating by the day.  From courtrooms to rallies to incoherent interviews … ",
    "url": "https://www.salon.com/2024/01/26/donald-border-powerplay-is-a-push-for-civil/"
  },
  {
    "text": "U.S. pauses funding to UNRWA after 12 staffers accused of involvement in Oct. 7 attack … - State Department spokesperson Matthew Miller said the U.S. is “extremely troubled by the allegations” and the administration has “temporarily paused additional funding for UNRWA while we review … ",
    "url": "https://www.axios.com/2024/01/26/unrwa-gaza-hamas-israel-attack"
  },
  {
    "text": "Ex-coal CEO who called himself ‘Trumpier than Trump’ launches Democratic Senate bid in West Virginia  —  A former CEO of a coal company who once said he is “Trumpier than Trump” has launched a bid for Senate as a Democrat in West Virginia.  —  Don Blankenship, who previously ran … ",
    "url": "https://thehill.com/homenews/campaign/4431661-coal-blankenship-trumpier-than-trump-democratic-senate-west-virginia/"
  },
  {
    "text": "DOJ says Andrew Cuomo sexually harassed 13 women  —  The former governor's lawyer says he was never interviewed.  —  ALBANY, New York — Former New York Gov. Andrew Cuomo sexually harassed 13 women who worked for the state over the course of an eight-year period, the Department … ",
    "url": "https://www.politico.com/news/2024/01/26/cuomo-sexual-harassment-doj-00138140"
  },
  {
    "text": "Covid killed 170,000 in nursing homes.  Most residents still haven't gotten the latest shot.  —  The Biden administration says the facilities need to do more.  Home executives say vaccine hesitancy requires a new government message.  —  Fewer than 4 in 10 nursing home residents have received … ",
    "url": "https://www.politico.com/news/2024/01/26/nursing-homes-residents-covid-shot-00137665"
  },
  {
    "text": "Biden needles Trump in hopes of pushing him off message  —  Three words from Joe Biden's somber speech about Donald Trump had one man in the back of Charleston's Mother Emanuel AME Church the most excited: “He's a loser.”  —  The man, cracking up, poked the woman next to him with a “Can you believe it?” expression on his face.",
    "url": "https://www.cnn.com/2024/01/26/politics/biden-taunts-trump-2024/"
  },
  {
    "text": "Rep. Nancy Mace faces GOP primary challenge from ex-chief of staff  —  The former chief of staff to Rep. Nancy Mace (R-S.C.) on Friday filed to run as a Republican primary challenger against his onetime boss. … - Hanlon worked as a senior staffer for Mace from when she first entered Congress … ",
    "url": "https://www.axios.com/2024/01/26/rep-nancy-mace-primary-challenge-chief-staff"
  },
  {
    "text": "Scott hammers Democratic opponent as ‘liar’ over abortion attack  —  Sen. Rick Scott (R-Fla.), who is up for reelection this fall, says his Democratic challenger is a “liar” after she accused the first-term senator of supporting a national abortion ban, a charge that Democratic candidates … ",
    "url": "https://thehill.com/homenews/campaign/4431558-scott-hammers-democratic-opponent-as-liar-over-abortion-attack/"
  },
  {
    "text": "Mainstream media bloodbath: News outlets slash jobs as business suffers  —  Nearly a dozen mainstream media companies are gutting staff and scrambling to rescue their struggling businesses. … But an ongoing bloodbath is decimating news outlets nationwide.",
    "url": "https://www.axios.com/2024/01/26/media-layoffs-strikes-journalism-dying"
  },
  {
    "text": "Trader Joe's Follows SpaceX in Arguing US Labor Board Is Unconstitutional  — Grocery chain tries new argument to fight union-busting charge  — Decision on constitutionality is unlikely before an appeal … At a Jan. 16 National Labor Relations Board hearing in Connecticut … ",
    "url": "https://www.bloomberg.com/news/articles/2024-01-26/trader-joe-s-follows-spacex-in-arguing-nlrb-is-unconstitutional"
  },
  {
    "text": "The Curious Ethical Case of Kevin Morris  —  On Wednesday, I received a letter from Bryan M. Sullivan, a partner at Early Sullivan Wright Gizer & McRae LLP, who is the lawyer of Kevin Morris (who is the lawyer for Hunter Biden).  The letter warns that I could face a defamation action if I do not retract … ",
    "url": "https://jonathanturley.org/2024/01/26/the-curious-ethical-case-of-kevin-morris/"
  },
  {
    "text": "Key senators cut deal to give US new power to clamp down on border crossings  —  Senate negotiators have agreed to empower the US to significantly restrict illegal migrant crossings at the southern border, according to sources familiar with the matter, a move aimed at ending the migrant surge … ",
    "url": "https://www.cnn.com/2024/01/26/politics/senate-deal-shutdown-border/"
  }
]