[
  {
    "text": "The Legal Issues Surrounding Trump's Plan to Use Troops to Suppress Protests  —  President Trump has long mused about using troops to crush violent protests or riots in blue-state cities.  He is now moving to do so in Los Angeles.  —  Setting up a rare use of military force on domestic soil … ",
    "url": "https://www.nytimes.com/2025/06/08/us/trump-los-angeles-national-guard-explainer.html?unlocked_article_code=1.NU8.8xIk.aTAKs3T6TctI&smid=url-share"
  },
  {
    "text": "The Deportation Wars Begin  —  Trump has a mandate, but protests in California show the trouble that might lie ahead.  —  Rounding up and deporting millions of illegal migrants was never going to go down without protest.  But President Trump is determined to do it, and no one can say he didn't tell voters during the campaign.",
    "url": "https://www.wsj.com/opinion/the-deportation-wars-begin-d3cb4f8d?st=KxYCxt&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Trump Is Using the National Guard as Bait  —  Don't give him the pretext he wants.  —  President donald trump is about to launch yet another assault on democracy, the Constitution, and American traditions of civil-military relations, this time in Los Angeles.",
    "url": "https://www.theatlantic.com/ideas/archive/2025/06/trump-provoke-not-pacify-los-angeles/683080/?gift=otEsSHbRYKNfFYMngVFweH25hY2p_rsKIBWUs1l7ZV4&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "'Tom, arrest me.  Let's go.': Gov. Gavin Newsom responds to Trump border czar's threat  —  In an exclusive interview with NBC News' Jacob Soboroff, California Governor Gavin Newsom said that President Trump “has created the conditions” surrounding the Los Angeles protests.",
    "url": "https://www.msnbc.com/msnbc/watch/gov-newsom-tells-president-trump-to-stand-down-amid-l-a-protests-241152581707"
  },
  {
    "text": "Read: Newsom demands Trump pull National Guard from LA protests  —  California Gov. Gavin Newsom (D) on Sunday formally that requested President Trump's administration withdraw the National Guard from Los Angeles County, where troops are responding to immigration raid protests.",
    "url": "https://www.axios.com/2025/06/09/la-protests-trump-national-guard-newsom"
  },
  {
    "text": "Live Updates: L.A. Quiet as National Guard Troops Begin to Arrive  —  Protests over immigration raids in the Los Angeles area were expected to continue for a third day.  Gov. Gavin Newsom said President Trump's decision to call in National Guards was “purposefully inflammatory.”  —  Los Angeles",
    "url": "https://www.nytimes.com/live/2025/06/08/us/la-protests-national-guard?unlocked_article_code=1.NU8.VTur.zDx4PMKHJj5g&smid=url-share"
  },
  {
    "text": "Live updates: Protest spills onto 101 Freeway in downtown LA … What to Know  — Crowds gathered in downtown Los Angeles and Boyle Heights Sunday for a third straight day of protests over recent immigration raids.  — A march that began Sunday in Boyle Heights arrived … ",
    "url": "https://www.nbclosangeles.com/news/local/los-angeles-immigration-protests/3718195/"
  },
  {
    "text": "Trump's border czar threatens arrest for immigration interference, warns Newsom and Bass not to ‘cross that line’  —  ICE agents will be out “every day” regardless of pushback amid widespread protests across Los Angeles County, Tom Homan told NBC News on Saturday.",
    "url": "https://www.nbcnews.com/news/us-news/tom-homan-trump-border-czar-los-angeles-rcna211701"
  },
  {
    "text": "2 New York Representatives Are Denied Access to ICE Facility  —  Representatives Adriano Espaillat and Nydia Velázquez were turned away when seeking to inspect a migrant detention area inside a Manhattan federal building.  —  Federal officials prevented two members of Congress on Sunday … ",
    "url": "https://www.nytimes.com/2025/06/08/nyregion/ice-detention-federal-plaza-nyc.html?unlocked_article_code=1.Nk8.ZKNX.TulXnK8V1kuv&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "The Bluesky bubble hurts liberals and their causes  —  The social media network was doomed to fail as users tried to re-create Twitter.  —  Ever since Elon Musk bought Twitter, changed the social media site's name to X and altered its moderation policies, progressives have been hunting for a substitute.",
    "url": "https://www.washingtonpost.com/opinions/2025/06/08/blue-sky-twitter-liberals/"
  },
  {
    "text": "ABC News suspends journalist after calling Trump and adviser ‘world-class’ haters  —  Terry Moran to be evaluated after now deleted post said Stephen Miller is ‘richly endowed with capacity for hatred’  —  ABC News has suspended its senior national correspondent after he described top White … ",
    "url": "https://www.theguardian.com/us-news/2025/jun/08/abc-news-suspends-journalist-stephen-miller-trump"
  },
  {
    "text": "Trump's Feud With Musk Highlights His View of Government Power: It's Personal … President Trump's second term so far has been a 139-day quest for retribution.Haiyun Jiang for The New York Times  —  Amid the fireworks of his spectacular breakup with Elon Musk last week was a striking admission … ",
    "url": "https://www.nytimes.com/2025/06/08/us/politics/trump-elon-musk-fight-power.html"
  },
  {
    "text": "Israeli forces prevent aid boat carrying Greta Thunberg and other activists from reaching Gaza  —  Israeli forces stopped a Gaza-bound aid boat carrying Greta Thunberg and other activists early Monday and diverted it to Israel, enforcing a longstanding blockade of the Palestinian territory … ",
    "url": "https://apnews.com/article/mideast-wars-gaza-flotilla-greta-thunberg-b64e897fb37ee374e4494381304ff9be"
  },
  {
    "text": "‘You essentially destroyed any chance I have,’ DNC chair told David Hogg in private meeting  —  Ken Martin expressed frustration and self-doubt in a meeting with other party leaders, according to a two-minute recording obtained by POLITICO.  —  Democratic National Committee Chair Ken Martin … ",
    "url": "https://www.politico.com/news/2025/06/08/martin-hogg-call-private-meeting-00393517"
  },
  {
    "text": "Trump promised Britain a trade deal.  So where is it?  —  A month after the “historic” trade deal between the two sides was announced, duties remain in place with no clear timeline for when they'll lift.  —  LONDON — In a much-hyped split-screen Oval Office phone call a month ago … ",
    "url": "https://www.politico.eu/article/donald-trump-white-house-britain-uk-deal-tariffs/"
  },
  {
    "text": "The U.S. Economy Is Headed Toward an Uncomfortable Summer  —  Companies are freezing hiring and investment to deal with shifting tariff policies.  'Even Trump doesn't know what Trump will do next.'  —  The U.S. economy, which weathered false recession alarms in 2023 and 2024, is entering another uncomfortable summer.",
    "url": "https://www.wsj.com/economy/trump-tariffs-us-economy-business-investment-7d3c6476?st=A1Vq8E&reflink=desktopwebshare_permalink"
  },
  {
    "text": "DOGE employees are ‘being pushed out’ without Musk to protect them: report  —  Now that billionaire Elon Musk has stepped away from his White House job as a “special government employee,” the Department of Government Efficiency (DOGE) staffers he brought on board are exiting too — some not because they want to leave.",
    "url": "https://www.rawstory.com/doge-staffers-purge/"
  }
]