[
  {
    "text": "Exclusive: Order by Hegseth to cancel Ukraine weapons caught White House off guard  —  NEW YORK/WASHINGTON - Roughly a week after Donald Trump started his second term as president, the U.S. military issued an order to three freight airlines operating out of Dover Air Force Base in Delaware … ",
    "url": "https://www.reuters.com/world/us/order-by-hegseth-cancel-ukraine-weapons-caught-white-house-off-guard-2025-05-06/"
  },
  {
    "text": "Hegseth Accused of More Chaos After Sudden Ukraine Aid Halt  —  BOMBSHELL REPORT  —  The sudden grounding of military flights packed with materiel was a complete surprise to all except Hegseth.  —  Pete Hegseth was facing new claims of chaos in his running of the Pentagon on Tuesday … ",
    "url": "https://www.thedailybeast.com/hegseth-accused-of-more-chaos-after-sudden-ukraine-aid-halt/"
  },
  {
    "text": "Ed Martin confirmation in doubt even after Trump weighs in … Late Monday night, Senate Judiciary Committee Republicans noticed an executive business meeting for Thursday that didn't include Martin's nomination.  Time is running out for Martin, who can only serve 120 days as the interim U.S. attorney … ",
    "url": "https://punchbowl.news/archive/5625-am/#__edmartinconfirmationindoubtevenaftertrumpweighsin__"
  },
  {
    "text": "GOP leader: Trump pick to serve as US attorney for DC won't reach floor  —  Senate Majority Leader John Thune (R-S.D.) said Ed Martin, President Trump's controversial pick to serve as U.S. attorney for the District of Columbia, will “probably” stay stuck in the Senate Judiciary Committee given … ",
    "url": "https://thehill.com/homenews/senate/5285196-trump-pick-senate-opposition/"
  },
  {
    "text": "Key GOP senator won't support Trump loyalist Ed Martin to be D.C.'s top prosecutor  —  North Carolina Republican Sen. Thom Tillis' decision likely derails Martin's nomination as U.S. attorney for the District of Columbia.  —  WASHINGTON — Sen. Thom Tillis, R-N.C., said he wouldn't support Ed Martin … ",
    "url": "https://www.nbcnews.com/politics/justice-department/thom-tillis-wont-support-ed-martin-dc-us-attorney-rcna205104"
  },
  {
    "text": "Trump Brags About Gold-Plated Office While Telling Americans to Cut Expenses  —  The president gloated about his “24-karat gold” White House renovation as his nonsensical tariff agenda drives up prices for consumers  —  Austerity for thee but not for me.  As Donald Trump advises … ",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-brags-gold-plated-office-tariffs-1235332861/"
  },
  {
    "text": "US trade deficit surges to record high in March  —  The U.S. trade deficit widened to a record high in March as businesses boosted imports of goods ahead of tariffs, which dragged gross domestic product into negative terrain in the first quarter for the first time in three years.",
    "url": "https://www.reuters.com/world/us/us-trade-deficit-surges-record-high-march-2025-05-06/"
  },
  {
    "text": "One Ship, $417 Million in New Tariffs: The Cost of Trump's Trade War  —  On April 24, against the backdrop of towering cranes, dockworkers at the Port of Long Beach began unloading the OOCL Violet, a hulking shipping vessel carrying thousands of containers full of goods bound for the US.",
    "url": "https://www.bloomberg.com/graphics/2025-china-ship-cost-in-tariffs-trade-war/?accessToken=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzb3VyY2UiOiJTdWJzY3JpYmVyR2lmdGVkQXJ0aWNsZSIsImlhdCI6MTc0NjUzMTIxOCwiZXhwIjoxNzQ3MTM2MDE4LCJhcnRpY2xlSWQiOiJTVlUxMFFEV1JHRzAwMCIsImJjb25uZWN0SWQiOiI2NTI4REQ5RTU2RTM0NjcyOEM1NEMwNDIzREJCRDAyNSJ9.cR8lrdlkrzZ796aeFx3R6Nuv5IHSb-hYvPE3835U-To"
  },
  {
    "text": "Exclusive: Democrats target Trump family's crypto empire  —  Senate Democrats are unveiling a sweeping new proposal to ban presidents, lawmakers and their families from issuing, endorsing or sponsoring crypto assets, Axios has learned.  —  Why it matters: Concerns over the Trump family's crypto ventures … ",
    "url": "https://www.axios.com/2025/05/06/trump-coin-democrats-crypto-stablecoin"
  },
  {
    "text": "Supreme Court allows Trump to implement transgender military ban  —  The blanket ban, expanding on a similar policy Trump proposed in his first term, has been blocked nationwide by lower courts.  —  WASHINGTON — The Supreme Court on Tuesday allowed President Donald Trump to implement his ban … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-allows-trump-implement-transgender-military-ban-rcna204135"
  },
  {
    "text": "Elon Musk's Grok AI Will ‘Remove Her Clothes’ In Public, On X  —  Elon Musk's Grok, an AI chatbot that people can interact with via X, is being used to undress photos women are posting to the social media platform, as first flagged t0 404 Media by Kolina Koltai, a researcher and trainer at Bellingcat.",
    "url": "https://www.404media.co/elon-musks-grok-ai-will-remove-her-clothes-in-public-on-x/"
  },
  {
    "text": "Tulsi Gabbard Reused the Same Weak Password on Multiple Accounts for Years  —  Now the US director of national intelligence, Gabbard failed to follow basic cybersecurity practices on several of her personal accounts, leaked records reviewed by WIRED reveal.  —  Tulsi Gabbard … ",
    "url": "https://www.wired.com/story/tulsi-gabbard-dni-weak-password/"
  },
  {
    "text": "What do disengaged voters think about Trump now?  —  In the 2024 election, Donald Trump gained a surprising edge from an unlikely group: Americans who typically don't vote.  According to a New York Times analysis, these low-turnout voters backed Trump by a double-digit margin … ",
    "url": "https://www.gelliottmorris.com/p/what-do-disengaged-voters-think-about"
  },
  {
    "text": "Ohio governor moves to keep the state GOP from endorsing Trump-backed Vivek Ramaswamy to succeed him  —  The Ohio Republican Party is slated to take a Friday vote on whether to give Ramaswamy its endorsement in the 2026 race for governor.  —  CLEVELAND — President Donald Trump endorsed Vivek Ramaswamy … ",
    "url": "https://www.nbcnews.com/politics/2026-election/ohio-governor-moves-keep-state-gop-endorsing-trump-backed-vivek-ramasw-rcna205146"
  },
  {
    "text": "ICE Agents Are Targeting DC Restaurants  —  Immigration and Customs Enforcement agents are targeting DC restaurants today in what is shaping up to be one of the city's most high-profile examples yet of President Donald Trump's immigration crackdown.  Millie's in Spring Valley … ",
    "url": "https://www.washingtonian.com/2025/05/06/ice-agents-are-targeting-dc-restaurants/"
  },
  {
    "text": "Trump administration to garnish wages of 5.3 million defaulted student loan borrowers this summer … The Trump Administration resumed collection efforts on defaulted student loans Monday after a roughly five-year hiatus — and affected borrowers could begin feeling the financial consequences sooner than experts expected.",
    "url": "https://www.cnbc.com/2025/05/06/how-soon-defaulted-student-loan-borrowers-may-face-collections.html"
  },
  {
    "text": "Trump admin plans to shut down money-saving Energy Star program soon, sources say  —  The Trump administration is preparing to eliminate two key Environmental Protection Agency divisions focused on climate change and energy efficiency, including its consumer-facing Energy Star program, according to two sources familiar with the plan.",
    "url": "https://cnn.com/2025/05/06/climate/energy-star-trump"
  },
  {
    "text": "Declassified Spy Memo Contradicts Trump on Venezuela Gang Ties  —  The release of the memo further undercuts the Trump administration's rationale for using the Alien Enemies Act to deport scores of Venezuelans to a prison in El Salvador.  —  A newly declassified memo released on Monday confirms … ",
    "url": "https://www.nytimes.com/2025/05/05/us/trump-venezuela-gang-ties-spy-memo.html?unlocked_article_code=1.FE8.ekrJ.ejTHcs9yc702&smid=url-share"
  },
  {
    "text": "America's Air Traffic Fiasco  —  Here's why you're waiting hours to land at Newark airport.  —  Thousands of flights in and out of Newark airport in recent days have been delayed, diverted or canceled owing to a long runway of air traffic control failures.",
    "url": "https://www.wsj.com/opinion/air-traffic-control-faa-newark-airport-sean-duffy-donald-trump-56d080a3?st=uYDvaG"
  },
  {
    "text": "Trump-appointed judge reaffirms order that admin seek return of 2nd wrongly deported man from El Salvador  —  The Trump administration expelled the 20-year-old Venezuelan from the U.S. in March despite a legal settlement barring his deportation.  —  BALTIMORE — A federal judge on Tuesday refused … ",
    "url": "https://www.politico.com/news/2025/05/06/daniel-lozano-camargo-deportation-hearing-00331228"
  },
  {
    "text": "Far-Right Thinker Curtis Yarvin Argues for Remaking of Harvard at Faculty Club Debate  —  The far-right thinker Curtis Yarvin joined University Professor Danielle Allen for a debate Monday evening, where Yarvin in turn derided Harvard as “an essentially oligarchic institution” … ",
    "url": "https://www.thecrimson.com/article/2025/5/6/curtis-yarvin-danielle-allen-debate/"
  },
  {
    "text": "Justice Department investigating 2022 Abrego Garcia traffic stop: Sources  —  A federal inmate was questioned about possible connections, sources said.  —  Kilmar Abrego Garcia, a Salvadoran migrant in this handout image obtained by Reuters on April 9, 2025.  —  Abrego Garcia Family via Reuters",
    "url": "https://abcnews.go.com/Politics/justice-department-investigating-2022-abrego-garcia-traffic-stop/story?id=121492776"
  },
  {
    "text": "Most Americans use federal science information on a weekly basis, a new poll finds  —  Most people in the United States rely on federal science in their daily lives but don't realize it, a new nationwide poll of U.S. adults shows.  —  The poll was conducted in early April by the Association … ",
    "url": "https://www.npr.org/2025/05/06/nx-s1-5387367/federal-science-opinion-use-poll"
  },
  {
    "text": "‘What Are They Doing Illegal?’  Officer Says Before Arresting Pro-Palestine Students  —  Audio reveals an officer admitting UT Austin students weren't breaking the law before they were arrested.  The students are now suing Greg Abbott  —  A police officer questioned the legality … ",
    "url": "https://www.rollingstone.com/politics/politics-features/texas-students-arrested-pro-palestine-protest-sue-abbott-1235332777/"
  },
  {
    "text": "Matt Walsh Defends White People Using The N-Word  —  On Monday, Daily Wire contributor Matt Walsh used his show to defend Shiloh Hendrix, a racist woman accused of calling a Black child the N-word.  After lauding the people who contributed to her online fundraiser, Walsh complained that it's … ",
    "url": "https://angrywhitemen.org/2025/05/06/matt-walsh-defends-white-people-using-the-n-word/"
  },
  {
    "text": "President Trump's Media Company Is Offering Movies About ‘Lizard People’ And Other Wild Conspiracy Theories  —  Less than two minutes into the movie, the narrator makes a shocking claim.  —  “The evidence we are about to present to you has the potential to rewrite thousands of years of human history.",
    "url": "https://talkingpointsmemo.com/news/truth-plus-trump-conspiracy-theories"
  },
  {
    "text": "She Called a 5-Year-Old the N-Word  —  N-word-slinging woman becomes right-wing hero  —  OVER THE PAST WEEK, portions of the American right have embraced a Minnesota woman whose claim to fame is that she allegedly called a 5-year-old boy the n-word, going so far as to help her raise hundreds of thousands of dollars.",
    "url": "https://www.thebulwark.com/p/she-called-a-five-year-old-the-n-word-crowdfunding"
  },
  {
    "text": "Loudoun County Is Still Insane: Boys Face Title IX Probe After Girl Allegedly Films Them in Locker Room  —  When you see the words “Loudoun County Public Schools” in the news, you know your blood pressure is about to skyrocket.  Such is the case with a new report out of Loudoun County (\"LoCo\" … ",
    "url": "https://redstate.com/terichristoph/2025/05/06/lcps-title-ix-investigation-n2188738"
  },
  {
    "text": "Elon Musk's Most Alarming Power Grab  —  Can anyone stop his space-based internet?  —  When Elon Musk's engineers bundled a batch of prototype satellites into a rocket's nose cone six years ago, there were fewer than 2,000 functional satellites in Earth's orbit.",
    "url": "https://www.theatlantic.com/technology/archive/2025/05/starlink-elon-musk-space-internet/682705/?gift=guxsrl_dAdXUP9zqbQPWxS9Y60abe3-ea5P_I6HWcuE&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Merz fails to be elected chancellor by German parliament  —  Germany's parliament will hold a second vote on Tuesday on backing Friedrich Merz as chancellor after the veteran conservative failed to secure enough support in a first round, throwing politics in Europe's largest economy into disarray.",
    "url": "https://www.reuters.com/world/europe/merz-fails-be-elected-chancellor-by-german-parliament-2025-05-06/"
  },
  {
    "text": "Woman says security guard at Liberty Hotel in Boston confronted her in bathroom, asked to prove gender  —  A couple said they were embarrassed and offended after they were ordered to leave a high-end hotel in Boston over the weekend.  The women said a security guard at The Liberty Hotel challenged their use of a bathroom.",
    "url": "https://www.cbsnews.com/boston/news/women-boston-liberty-hotel-bathroom-gender/"
  },
  {
    "text": "FDA picks critic of COVID boosters to be new top vaccines official  —  The Food and Drug Administration announced Tuesday it has picked a new head of its center charged with vaccine approvals and other biologics products: Dr. Vinay Prasad, a vocal critic of the agency's moves to greenlight COVID-19 vaccine boosters.",
    "url": "https://www.cbsnews.com/news/fda-critic-covid-boosters-new-top-vaccines-official-vinay-prasad/"
  },
  {
    "text": "President Trump calls Chicago's Obama Presidential Center “a disaster,” blames “woke” construction  —  President Trump took shots at former President Barack Obama's Presidential Center in Chicago while meeting with new Canadian Prime Minister Mark Carney Tuesday, calling it “a disaster” and blaming “woke” construction workers.",
    "url": "https://www.cbsnews.com/news/president-trump-obama-presidential-center-disaster-blames-woke-construction/"
  },
  {
    "text": "A Clue From the Supreme Court on How It Will Handle Trump  —  Federal judges throughout the country are losing patience with the administration.  Will it be an issue for the Supreme Court?  —  It is generally a bad idea to get in the government's crosshairs.",
    "url": "https://www.politico.com/news/magazine/2025/05/06/trump-justice-department-trust-supreme-court-00329222"
  }
]