[
  {
    "text": "RFK Jr. Has Horrific Response to Measles Death  —  An unvaccinated child in west Texas died of measles on Wednesday, marking the first time that someone has died from the viral illness in the U.S. in a decade.  —  So far, 18 people have been hospitalized for the disease around Lubbock … ",
    "url": "https://newrepublic.com/post/192025/robert-f-kennedy-jr-response-measles-death"
  },
  {
    "text": "First measles death is reported in the West Texas outbreak that's infected more than 120 people  —  A person who was hospitalized has died from measles in West Texas, the first death in an outbreak that began late last month.  Texas Tech University Health Sciences Center spokesperson Melissa Whitfield confirmed the death Wednesday.",
    "url": "https://apnews.com/article/measles-outbreak-west-texas-death-rfk-41adc66641e4a56ce2b2677480031ab9"
  },
  {
    "text": "RFK Jr. Dismisses Measles Outbreak As ‘Not Unusual’ After Child's Death  —  “We have measles outbreaks every year,” Trump's health secretary said when asked about the death, which is the nation's first in a decade.  —  Health Secretary Robert F. Kennedy Jr., a prominent vaccine skeptic … ",
    "url": "https://www.huffpost.com/entry/rfk-jr-dismisses-measles-outbreak_n_67bf5519e4b053f9e3997f53"
  },
  {
    "text": "Justice Department tells judges it can't comply with court-ordered deadline to release frozen aid funding  —  In court filings, the DOJ contends it will take “weeks” to free the funding that a federal judge ordered to be released almost two weeks ago.  —  The Trump administration … ",
    "url": "https://www.nbcnews.com/politics/justice-department/justice-department-judges-cant-comply-deadline-usaid-funds-rcna193837"
  },
  {
    "text": "Trump administration says it's cutting 90% of USAID foreign aid contracts  —  The Trump administration said Wednesday it is eliminating more than 90% of the U.S. Agency for International Development's foreign aid contracts and $60 billion in overall U.S. assistance around the world … ",
    "url": "https://apnews.com/article/trump-usaid-foreign-aid-cuts-6292f48f8d4025bed0bf5c3e9d623c16"
  },
  {
    "text": "Jeff Bezos is muzzling the Washington Post's opinion section.  That's a death knell  —  'I couldn't be more sad and disgusted,' says former top editor Martin Baron  —  Owners and publishers of news organizations often exert their will on opinion sections.  It would be naive to think otherwise.",
    "url": "https://www.theguardian.com/commentisfree/2025/feb/26/jeff-bezos-washington-post-opinion"
  },
  {
    "text": "Today I am ending my professional association with The Washington Post.  Since my decision to step down as senior managing editor in 2023, I have been privileged to work on contract as a senior associate editor, helping to oversee investigative projects and undertaking other tasks at the behest … ",
    "url": "https://www.linkedin.com/posts/cameron-barr-72093bb0_today-i-am-ending-my-professional-association-activity-7300598172819546112-TjW-"
  },
  {
    "text": "Jeff Bezos' Directive for Washington Post Opinion Pages Leads to Editor David Shipley's Exit  —  David Shipley, The Post's opinion editor, is resigning after trying to persuade Jeff Bezos to reconsider the new direction.  — 1k  —  Jeff Bezos, the owner of The Washington Post … ",
    "url": "https://www.nytimes.com/2025/02/26/business/media/washington-post-bezos-shipley.html?unlocked_article_code=1.z04.AaIb.kaTV8X7xSNaN&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "FDA cancels meeting to select flu strains for next season's shots  —  The canceled meeting comes just days after a CDC vaccine advisory committee meeting was abruptly postponed.  —  A Food and Drug Administration vaccine advisory committee meeting scheduled for March to select the strains … ",
    "url": "https://www.nbcnews.com/health/health-news/fda-cancels-meeting-select-flu-strains-seasons-shots-rcna193931"
  },
  {
    "text": "F.D.A. Cancels Meeting of Vaccine Experts Scheduled to Advise on Flu Shots  —  The cancellation plays into fears among scientists who worry that Robert F. Kennedy Jr. will use his position as health secretary to sow doubts about vaccines.  —  A panel of scientific experts that advises … ",
    "url": "https://www.nytimes.com/2025/02/26/us/politics/fda-flu-vaccine.html?unlocked_article_code=1.0E4.BCg6.NQ9_8QTh2mFd&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Breaking: US FDA Cancels Upcoming Adcomm Discussing 2025-2026 Flu Vaccine  —  The Vaccines and Related Biological Products Advisory Committee meeting next month was scheduled to select strains for the 2025-2026 flu vaccine.  The cancellation could mean delays in vaccine availability.",
    "url": "https://insights.citeline.com/pink-sheet/vaccines/breaking-us-fda-cancels-upcoming-adcomm-discussing-2025-2026-flu-vaccine-AGBZQHYGZFHZLOK2PU5CCKBNK4/"
  },
  {
    "text": "Is Trump lying about cutting Medicaid — or is Congress?  —  Trump says Republicans won't “touch” the program.  But he left them a loophole. … Today I'm focused on Donald Trump's mixed messages on the fate of Medicaid, the low-income health insurance program that more than 70 million Americans depend on.",
    "url": "https://www.vox.com/politics/401630/is-trump-lying-about-cutting-medicaid-or-is-congress"
  },
  {
    "text": "Social Security Administration Could Cut Half Its Workforce  —  Sources tell the Prospect that a meeting called for a 50 percent reduction in an agency that millions rely on for benefit implementation.  —  There are more than 1,200 Social Security field offices across the country.",
    "url": "https://prospect.org/health/social-security-administration-could-cut-half-its-workforce/"
  },
  {
    "text": "DOGE Staffers at HUD Are From an AI Real Estate Firm and a Mobile Home Operator  —  Elon Musk's men at HUD come from the real estate sector.  They have access to vast stores of personal and financial data—and control over who can access which HUD systems.  —  On February 10 … ",
    "url": "https://www.wired.com/story/doge-hud-systems-access-ai-proptech-real-estate-mobile-home/"
  },
  {
    "text": "Musk claims DOGE ‘restored’ Ebola prevention effort.  Officials disagree.  —  USAID's initiatives to fight Ebola and other diseases have been gutted, current and former agency officials said  —  Elon Musk on Wednesday acknowledged that the U.S. DOGE Service “accidentally canceled” … ",
    "url": "https://www.washingtonpost.com/politics/2025/02/26/elon-musk-ebola-prevention-usaid-doge/"
  },
  {
    "text": "In Trump's Washington, a Moscow-Like Chill Takes Hold  —  A new administration's efforts to pressure the news media, punish political opponents and tame the nation's tycoons evoke the early days of President Vladimir V. Putin's reign in Russia.  —  She asked too many questions that the president didn't like.",
    "url": "https://www.nytimes.com/2025/02/26/us/politics/trump-putin-russia.html"
  },
  {
    "text": "Trump Press Sec Seethes at Media over Musk as More Bad Econ News Hits … At Tuesday's media briefing, White House press secretary Karoline Leavitt announced that the White House will now decide who attends briefings, an effort to insulate President Trump from tough scrutiny.",
    "url": "https://newrepublic.com/article/191984/trump-press-sec-seethes-media-musk-bad-econ-news-hits"
  },
  {
    "text": "WHCA head: Public ‘can no longer trust’ pool reports under White House control  —  The head of the White House Correspondents Association (WHCA) says the public can no longer trust pool reports now that the reporters included in the small group will be controlled by President Trump's team.",
    "url": "https://thehill.com/homenews/media/5165494-white-house-correspondents-association-white-house-pool/"
  },
  {
    "text": "VA pauses billions in cuts lauded by Musk as lawmakers and veterans decry loss of critical care  —  The Department of Veterans Affairs has temporarily suspended billions of dollars in planned contract cuts following concerns that the move would hurt critical veterans' health services … ",
    "url": "https://apnews.com/article/doge-veterans-affairs-cuts-health-services-contracts-9a726b744e402da01d711023b0fc49a1"
  },
  {
    "text": "Implementing the President's “Department of Government Efficiency” Cost Efficiency Initiative  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:  —  Section 1.  Purpose.  This order commences a transformation … ",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/02/implementing-the-presidents-department-of-government-efficiency-cost-efficiency-initiative/"
  },
  {
    "text": "Democrats Need to Clean House  —  The problem with the party goes way beyond the $10 words.  —  At the University of Chicago's Institute of Politics last week, former Transportation Secretary Pete Buttigieg was nearly apoplectic about the diversity spectacles at the recent Democratic National … ",
    "url": "https://www.theatlantic.com/ideas/archive/2025/02/democrats-dei-dnc-buttigieg/681835/"
  },
  {
    "text": "Dozens of DOGE ‘receipts’ saved no money and killed contracts meant to boost efficiency  —  Many of the receipts published by Elon Musk's DOGE aren't receipts at all — they're negotiated deals with vetted vendors who might do future government work.  —  Take a quick look at the Department … ",
    "url": "https://www.nbcnews.com/politics/doge/dozens-doge-receipts-saved-no-money-killed-contracts-meant-boost-effic-rcna193682"
  },
  {
    "text": "Musk's Ex-Twitter Workers Win Severance Over ‘Fork in the Road’ Email  — Ex-employees prevail in challenges to ‘Fork in the Road’ email  — Billionaire has Trump's support using similar tactics at DOGE  —  Former Twitter employees are scoring early victories in legal challenges … ",
    "url": "https://www.bloomberg.com/news/articles/2025-02-26/musk-s-ex-twitter-workers-win-severance-over-layoff-after-email?accessToken=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzb3VyY2UiOiJTdWJzY3JpYmVyR2lmdGVkQXJ0aWNsZSIsImlhdCI6MTc0MDU5Nzg2MywiZXhwIjoxNzQxMjAyNjYzLCJhcnRpY2xlSWQiOiJTUzdEVElEV0xVNjgwMCIsImJjb25uZWN0SWQiOiJGNDZBMzg1RkE3NTA0NTlCQTEzQ0MxNEZCRUU4ODRERiJ9.Oi3-5sm5GgXyKTCsXgMnap3zJSRZzWfZwVJW0Nr9iJo"
  },
  {
    "text": "Economists are starting to worry about a serious Trump recession  —  Tariffs on America's neighbours and assault on federal government will hit US economy  —  Donald Trump's assault on the US federal government and the world's interlinked manufacturing system have together reached an economic tipping point.",
    "url": "https://www.telegraph.co.uk/business/2025/02/25/economists-starting-worry-serious-trump-recession/"
  },
  {
    "text": "Who Is the Anonymous Data Expert Telling Elon Which Cuts to Make?  —  Conservatives have used DataRepublican to spread misinformation about federal agencies.  She's been working at a tech firm that's battled the CFPB … The account, and its alleged findings of mismanaged government agency spending … ",
    "url": "https://www.rollingstone.com/politics/politics-features/elon-musk-data-republican-anonymous-data-expert-doge-tech-1235280817/"
  },
  {
    "text": "DOJ has abruptly broadened its view of Trump's Jan. 6 pardons.  A judge wants answers.  —  A Trump-appointed judge grilled a Justice Department prosecutor on the department's change in position.  —  Three weeks ago, the Justice Department was emphatic: Donald Trump may have pardoned Kentuckian Dan Wilson … ",
    "url": "https://www.politico.com/news/2025/02/26/trump-january-6-pardon-judge-00206301"
  },
  {
    "text": "Chief Justice John Roberts pauses order for Trump admin to pay $2 billion in foreign aid by midnight  —  Chief Justice John Roberts on Wednesday paused a court-imposed midnight deadline that would have required the Trump administration to spend $2 billion in frozen foreign aid … ",
    "url": "https://www.cnn.com/2025/02/26/politics/supreme-court-foreign-aid-state-usaid"
  },
  {
    "text": "Trump asks Apple to end diversity policies after shareholders vote in favor  —  U.S. President Donald Trump on Wednesday urged Apple AAPL.O to scrap its diversity, equity and inclusion policies, a day after the iPhone maker's shareholders voted overwhelmingly to keep them in the face of growing pushback from conservative groups.",
    "url": "https://www.usatoday.com/story/money/business/2025/02/26/trump-apple-dei-policies-vote/80535564007/"
  }
]