[
  {
    "text": "Harris hires Obama campaign veterans to join 2024 effort, replacing Biden loyalists  —  David Plouffe, Stephanie Cutter and Mitch Stewart are joining the effort.  —  Presumptive Democratic presidential nominee Kamala Harris hired a battery of new senior advisers to her campaign this week … ",
    "url": "https://www.washingtonpost.com/politics/2024/08/02/kamala-harris-hires-new-senior-strategists-campaign-expands-portfolio-others/"
  },
  {
    "text": "Plouffe among corps of new advisers to Harris campaign  —  The Barack Obama veteran had been the subject of internal rumors for weeks.  —  Kamala Harris' presidential campaign is bringing on a new echelon of senior advisers, most prominently David Plouffe, the former top political adviser to Barack Obama.",
    "url": "https://www.politico.com/news/2024/08/02/plouffe-joins-harris-campaign-as-senior-adviser-00172478"
  },
  {
    "text": "How Biden feels about some of Harris' top running mate candidates  —  President Joe Biden acknowledged to reporters Friday morning that he and Vice President Kamala Harris have spoken about her upcoming decision on a vice presidential running mate.  —  But he wouldn't say much else … ",
    "url": "https://www.cnn.com/2024/08/02/politics/joe-biden-kamala-harris-running-mate-candidates/"
  },
  {
    "text": "Defense Secretary Revokes Plea Deal for Accused Sept. 11 Plotters  —  Defense Secretary Lloyd J. Austin III assumed direct oversight of the case and effectively put the death penalty back on the table.  —  Defense Secretary Lloyd J. Austin III on Friday relieved the overseer of the war court … ",
    "url": "https://www.nytimes.com/2024/08/02/us/politics/911-plotters-plea-deal.html?unlocked_article_code=1.AE4.HKWp.ZcD3F2UPP4xi&smid=url-share"
  },
  {
    "text": "Defense Secretary Lloyd Austin withdraws plea deal for accused 9/11 terrorists  —  The defense secretary overrode the agreements for Khalid Sheikh Mohammed, Walid Muhammad Salih Mubarak Bin 'Attash and Mustafa Ahmed Adam al Hawsawi.  —  WASHINGTON — Defense Secretary Lloyd Austin … ",
    "url": "https://www.nbcnews.com/politics/national-security/defense-secretary-lloyd-austin-withdraws-plea-deal-accused-911-terrori-rcna164966"
  },
  {
    "text": "Harris campaign rakes in $310M in July, far outpacing Trump  —  The Biden-turned-Harris operation ended the month with a $50 million cash advantage.  —  The Joe Biden-turned-Kamala Harris campaign raised $310 million in July — a monster sum of cash sparked by the vice president's entry into the presidential race.",
    "url": "https://www.politico.com/news/2024/08/02/harris-campaign-fundraising-numbers-july-00172400"
  },
  {
    "text": "‘Firestorm’: Philly Mayor May Have Just Accidentally Leaked Kamala Harris' VP Pick  —  Philadelphia's Mayor Cherelle Parker may have just leaked Kamala Harris' Vice Presidential pick as Pennsylvania Governor Josh Shapiro with a mistimed Friday tweet, according to Philly Mag's Ernest Owens.",
    "url": "https://dailycaller.com/2024/08/02/firestorm-philly-mayor-cherelle-parker-accidentally-leaked-kamala-harris-vp-pick-josh-shapiro-2024-election/"
  },
  {
    "text": "How an Elon Musk PAC is using voter data to help Trump beat Harris in 2024 election … If a voter in Michigan performs a search on Google, a somewhat shocking ad might pop up.  —  The ad shows a young man lying in bed late at night when someone else texts him, “Hey you need to vote,” … ",
    "url": "https://www.cnbc.com/2024/08/02/elon-musk-pac-voter-data-trump-harris.html"
  },
  {
    "text": "Giuliani's bankruptcy formally dismissed, freeing Georgia election workers to seek $148M  —  Video Player is loading.  —  Play Video  —  Unmute  —  Current Time 0:00  —  Loaded: 0%  —  Stream Type LIVE  —  Seek to live, currently behind liveLIVE  —  Playback Rate  —  Chapters",
    "url": "https://thehill.com/regulation/court-battles/4808529-rudy-giuliani-georgia-election-workers-bankruptcy-dismissed/"
  },
  {
    "text": "Job growth totals 114,000 in July, much less than expected, as unemployment rate rises to 4.3% … WATCH NOW  —  Job growth in the U.S. slowed much more than expected during July and the unemployment rate ticked higher, fueling fears of a broader economic slowdown, the Labor Department reported Friday.",
    "url": "https://www.cnbc.com/2024/08/02/job-growth-totals-114000-in-july-much-less-than-expected-as-unemployment-rate-rises-to-4point3percent.html"
  },
  {
    "text": "Arizona AG Kris Mayes says defendant in ‘fake electors’ case has agreed to flip  —  Mayes says announcement coming next week, but wouldn't provide more information.  —  PHOENIX — Arizona Attorney General Kris Mayes plans to announce next week that one of the 18 defendants in her investigation … ",
    "url": "https://www.12news.com/article/news/local/arizona/arizona-ag-kris-mayes-says-defendant-fake-electors-case-has-agreed-to-flip/75-39d75a17-b07d-4393-9de4-2b156ac96963"
  },
  {
    "text": "Federal Appeals Court Rules That Fair Use May Be Narrowed to Serve Hollywood Profits  —  Section 1201 of the Digital Millennium Copyright Act is a ban on reading any copyrighted work that is encumbered by access restrictions.  It makes it illegal for you to read and understand the code … ",
    "url": "https://www.eff.org/deeplinks/2024/08/federal-appeals-court-rules-fair-use-may-be-narrowed-serve-hollywood-profits"
  },
  {
    "text": "Trump's Angry New Attack on “Dumb” Kamala Gets Wrecked by Leaked Data  —  At a rally in Pennsylvania on Wednesday, Donald Trump rolled out a new attack on Vice President Kamala Harris that showcased his well-known fondness for high-toned discourse: Her handling of immigration reveals her as not just weak, but also dumb.",
    "url": "https://newrepublic.com/article/184507/trump-attacks-kamala-wrecked-leaked-immigration-data"
  },
  {
    "text": "An assassin, a Putin foe's death, secret talks: How a sweeping US-Russia prisoner swap came together  —  Russian President Vladimir Putin greeted Russian prisoners freed as part of a swap with the United States as they arrived at a Moscow airport.  It came after the U.S. and Russia earlier completed … ",
    "url": "https://apnews.com/article/russia-us-gershkovich-whelan-blinken-efae784bb95d3e496bb53b0fbf0b185b"
  },
  {
    "text": "Josh Shapiro once wrote that peace ‘will never come’ to the Middle East.  He says his views have changed over 30 years.  —  Pennsylvania Gov. Josh Shapiro wrote in his college newspaper in 1993 that peace “will never come” to the Middle East and expressed skepticism about the viability … ",
    "url": "https://www.inquirer.com/politics/election/josh-shapiro-israel-gaza-peace-column-vice-president-20240802.html"
  },
  {
    "text": "Trump's stalled election-subversion prosecution revs back to life  —  Former president's opponents seek “mini-trial” to call attention to his role in Jan. 6 unrest  —  The stalled criminal case against Donald Trump for seeking to subvert the 2020 election is starting to move.",
    "url": "https://www.politico.com/news/2024/08/02/trump-election-subversion-prosecution-trial-00172501"
  },
  {
    "text": "North Carolina GOP candidate Mark Robinson, a harsh abortion critic, reveals his wife once had the procedure  —  The state's lieutenant governor, who is running for governor, made the revelation in a new TV ad with his wife.  —  The Republican nominee for governor of North Carolina … ",
    "url": "https://www.nbcnews.com/politics/2024-election/north-carolina-gop-candidate-mark-robinson-harsh-abortion-critic-revea-rcna164901?taid=66ad3ad4a4cf1f00013ddf0a"
  },
  {
    "text": "Kamala Harris officially secures Democratic nomination for president  —  Harris becomes the first woman of color on a major national ticket, with a chance to become the first woman president in American history.  —  Vice President Harris secured a majority of the pledged delegates … ",
    "url": "https://www.washingtonpost.com/politics/2024/08/02/harris-becomes-democratic-nominee/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzIyNTcxMjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzIzOTUzNTk5LCJpYXQiOjE3MjI1NzEyMDAsImp0aSI6IjdlZDE1ZDYzLTVmYzgtNGU0Ni05NmIwLWUyNWY1YTY2YTcwNCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzA4LzAyL2hhcnJpcy1iZWNvbWVzLWRlbW9jcmF0aWMtbm9taW5lZS8ifQ.KkQdIN8OsXmmUtlhl_TfHSJQXhKNl57nM4f6BiQEGJw&itid=gfta"
  },
  {
    "text": "Netanyahu, Defiant, Appears to Have Gone Rogue, Risking a Regional War  —  Ignoring the efforts of President Biden and the condemnation of many allies, the Israeli prime minister is forcing the pace of the war and feeding the revolt of the far right.  —  As the Biden administration … ",
    "url": "https://www.nytimes.com/2024/08/02/world/europe/israel-defiant-gaza-war.html"
  }
]