[
  {
    "text": "Trump says there's ‘no price tag’ for his mass deportation plan  —  In an exclusive interview with NBC News, Trump talked about his campaign promise to carry out the largest mass deportation of immigrants in U.S. history.  —  President-elect Donald Trump told NBC News on Thursday … ",
    "url": "https://www.nbcnews.com/politics/2024-election/trump-says-no-price-tag-mass-deportation-plan-rcna179178"
  },
  {
    "text": "Harris Tried to Win Over Republicans.  Democratic Support Collapsed Instead  —  The vice president did not pull Republicans from Trump, and the percentage of voters identifying as Democrat declined, according to exit polls  —  During the final weeks of the 2024 campaign … ",
    "url": "https://www.rollingstone.com/politics/politics-features/harris-republican-appeal-democratic-support-collapse-1235156634/"
  },
  {
    "text": "The Strategic Failure of 2024 Was Written in 2021  —  President Biden bet everything on the innate goodness of the American people.  We should learn from his mistake.  —  ∙ Paid  —  1. Two Paths in the Wood  —  At the beginning of Joe Biden's presidency he had a choice.",
    "url": "https://www.thebulwark.com/p/the-strategic-failure-of-2024-was"
  },
  {
    "text": "Dems rage against Biden's ‘arrogance’ after Harris loss  —  Democratic leaders had hoped Harris could separate herself from Biden's deficiencies.  —  Democrats are directing their rage over losing the presidential race at Joe Biden, who they blame for setting up Kamala Harris for failure by not dropping out sooner.",
    "url": "https://www.politico.com/news/2024/11/06/democrats-blame-biden-trump-win-00188092"
  },
  {
    "text": "DNC chair calls Sanders's criticism ‘straight up BS’  —  Democratic National Committee (DNC) Chair Jaime Harrison on Thursday responded to Sen. Bernie Sanders's (I-Vt.) accusations that the party has abandoned the working class, contributing to its loss of the White House and Senate on Election Day.",
    "url": "https://thehill.com/homenews/campaign/4979136-dnc-chair-jamie-harrison-responds-bernie-sanders/"
  },
  {
    "text": "Donald Trump picks Susie Wiles to be chief of staff  —  A veteran of Florida politics, Wiles directed Trump's campaign to victory in the state in 2016.  —  President-elect Donald Trump has tapped his campaign senior adviser Susie Wiles as White House chief of staff.",
    "url": "https://www.politico.com/news/2024/11/07/donald-trump-susie-wiles-chief-of-staff-00188346"
  },
  {
    "text": "Florida woman takes job as White House chief of staff  —  Welcome to POLITICO's West Wing Playbook, your guide to the preparations, personnel decisions and policy deliberations of Donald Trump's transition.  POLITICO Pro subscribers receive a version of this newsletter first.  —  The chief of staff pick is in.",
    "url": "https://www.politico.com/newsletters/west-wing-playbook/2024/11/07/susie-wiles-trump-chief-of-staff-00188152"
  },
  {
    "text": "Why Biden's Team Thinks Harris Lost  —  Earlier this fall, one of Joe Biden's closest aides felt compelled to tell the president a hard truth about Kamala Harris's run for the presidency: “You have more to lose than she does.”  And now he's lost it.  Joe Biden cannot escape the fact … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/11/biden-harris-2024-election/680560/"
  },
  {
    "text": "2 Democrats speak out against transgender athletes after Trump win  —  Two House Democrats said they oppose transgender athletes competing in women's sports in the immediate aftermath of President-elect Trump's decisive victory over Vice President Harris, shifting right of their previous policy positions … ",
    "url": "https://thehill.com/homenews/house/4979665-democrats-transgender-athletes/"
  },
  {
    "text": "Devastated Democrats Play the Blame Game, and Stare at a Dark Future  —  In interviews, lawmakers and strategists tried to explain Kamala Harris's defeat, pointing to misinformation, the Gaza war, a toxic Democratic brand and the party's approach to transgender issues.",
    "url": "https://www.nytimes.com/2024/11/07/us/politics/democrats-kamala-harris.html"
  },
  {
    "text": "Fed policy expected to collide with the reality of a second Trump term  —  As the Federal Open Market Committee wraps up its meetings ahead of its latest interest rate decision Thursday, questions about Trump's economic policies loom large.  —  The Federal Reserve is set to announce … ",
    "url": "https://www.nbcnews.com/business/economy/federal-reserve-interest-rate-decision-november-2024-post-election-rcna179025"
  },
  {
    "text": "Governor Newsom convenes a special session of the Legislature to protect California values  —  What you need to know: Governor Newsom is convening a special session to protect California values, including fundamental civil rights, reproductive freedom, climate action, immigrant families, and more.",
    "url": "https://www.gov.ca.gov/2024/11/07/special-session-ca-values/"
  },
  {
    "text": "The right-wing claims about voter fraud have suddenly vanished  —  On election night, as the results looked to be in Trump's favor, the baseless conspiracy theories about fraud began tapering off.  —  In the months leading up to the election, Donald Trump and his Republican allies warned relentlessly of widespread voter fraud.",
    "url": "https://www.msnbc.com/top-stories/latest/trump-republicans-voter-fraud-claims-election-2024-rcna179105"
  },
  {
    "text": "‘Doomed’: Experts say this crucial campaign decision led to VP Harris' ‘disastrous’ defeat  —  Many experts believed that PA Gov Josh Shapiro was a better choice for vice president  —  Vice President Kamala Harris' failed presidential bid has political strategists second guessing … ",
    "url": "https://www.foxnews.com/politics/doomed-experts-say-crucial-decision-led-harris-disastrous-defeat"
  },
  {
    "text": "Trump Promised to End the War in Ukraine.  Now He Must Decide How.  —  Foreign-policy advisers close to the president-elect put forth different versions of a plan to effectively freeze the front line  —  WASHINGTON—Donald Trump's promise to end the war in Ukraine by Inauguration Day now puts … ",
    "url": "https://www.wsj.com/world/trump-presidency-ukraine-russia-war-plans-008655c0"
  },
  {
    "text": "Laura Gillen defeats Rep. Anthony D'Esposito in heated NY rematch focused on border security  —  Democrats scored a key House win on Long Island, unseating a Republican accused of an affair and patronage.  —  NEW YORK — Democratic challenger Laura Gillen notched an upset Tuesday night … ",
    "url": "https://www.politico.com/news/2024/11/07/laura-gillen-wins-new-york-house-race-00187414"
  },
  {
    "text": "Trump Got Away With It — Because of the Biden Administration's Massive Missteps  —  Start with Merrick Garland, Mitch McConnell and the Supreme Court.  —  We have just witnessed the greatest failure of federal law enforcement in American history.  —  The reasons for Donald Trump's reelection … ",
    "url": "https://www.politico.com/news/magazine/2024/11/07/trump-legal-failures-blame-column-00187945"
  },
  {
    "text": "Stefanik eyed for top Trump administration post  —  One of President-elect Donald Trump's most vocal supporters in the House is on the short list to become his next ambassador to the United Nations, according to five people familiar with the potential appointment.",
    "url": "https://www.politico.com/live-updates/2024/11/07/congress/stefanik-eyed-for-post-00188354"
  },
  {
    "text": "The model exactly predicted the most likely election map  —  Before we get into the meat of today's newsletter, just a quick update on our plans.  Silver Bulletin, we hope, will have a long future.  But I'm thinking about things in a few different stages:  — Short term: We're treating next week … ",
    "url": "https://www.natesilver.net/p/the-model-exactly-predicted-the-most"
  },
  {
    "text": "Judge scolds Giuliani for not turning over assets to two women, including car he's driving  —  Trump ally and former New York Mayor Rudy Giuliani got a tongue-lashing Thursday in federal court after missing a deadline to turn over valuables to two election workers he defamed, including one asset … ",
    "url": "https://www.cbsnews.com/news/rudy-giuliani-bankruptcy-fight-valuables/"
  },
  {
    "text": "Stay Awake  —  Welcome to the first day of the rest of our lives  —  The tagline for my newsletter, Doomsday Scenario, has always been about trying to answer whether things are as bad as they seem?  It's hard this week not to feel like the answer is: If anything, it's worse.",
    "url": "https://www.doomsdayscenario.co/p/stay-awake"
  },
  {
    "text": "There's No Denying It Anymore: Trump Is Not a Fluke—He's America  —  The United States chose Donald Trump in all his ugliness and cruelty, and the country will get what it deserves.  —  Pocket  —  America deserves everything it is about to get.  We had a chance to stand united against fascism … ",
    "url": "https://www.thenation.com/article/politics/trump-is-america-not-a-fluke/"
  },
  {
    "text": "Crazy Liberal Women Choosing Plan 4B  —  Liberal women are claiming that they are going to give up Plan B and adopt Plan 4B.  —  Plan 4B is basically the Lysistrata strategy updated for the 21st century.  These women are planning to extort political compliance out of men by denying them sex … ",
    "url": "https://hotair.com/david-strom/2024/11/07/crazy-liberal-women-choosing-plan-4b-n3796784"
  },
  {
    "text": "Biden Rushing Study That Threatens to Slow Trump's LNG Plans  — Officials are racing to finish study on LNG export impacts  — Study could slow down but not stop Trump LNG expansion efforts  —  The Biden administration is racing to complete a study that could complicate President … ",
    "url": "https://www.bloomberg.com/news/articles/2024-11-07/biden-rushing-study-that-threatens-to-slow-trump-s-lng-plans?accessToken=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzb3VyY2UiOiJTdWJzY3JpYmVyR2lmdGVkQXJ0aWNsZSIsImlhdCI6MTczMTAwMjY5MSwiZXhwIjoxNzMxNjA3NDkxLCJhcnRpY2xlSWQiOiJTTUo4N1dEV1JHRzAwMCIsImJjb25uZWN0SWQiOiJENzMwQ0QzRDRENzQ0RUJDQTk2QzlCQUYxRTE4OTg4RCJ9.eQtw_v0ZXvITLm0iy0yrTmmsKyaspkVXAamMCQ43uNg"
  }
]