[
  {
    "text": "The Pentagon says a US warship and multiple commercial ships have come under attack in the Red Sea  —  An American warship and multiple commercial ships came under attack Sunday in the Red Sea, the Pentagon said, potentially marking a major escalation in a series of maritime attacks in the Mideast linked to the Israel-Hamas war.",
    "url": "https://apnews.com/article/red-sea-houthi-yemen-ships-attack-israel-hamas-war-gaza-strip-716770f0a780160e9abed98d3c48fbde"
  },
  {
    "text": "Ron DeSantis bashes Trump and teases plans to ‘supersede’ Obamacare  —  The Florida governor touted his campaign's efforts in Iowa on NBC's “Meet the Press” six weeks ahead of the caucuses.  —  Florida Gov. Ron DeSantis said on NBC's “Meet the Press” that he would replace Obamacare with a … ",
    "url": "https://www.nbcnews.com/politics/2024-election/ron-desantis-bashes-trump-teases-plans-supersede-obamacare-rcna127414"
  },
  {
    "text": "DeSantis says he will win Iowa  —  “I think it's going to help propel us to the nomination,” DeSantis said.  —  Florida Gov. Ron DeSantis has staked his campaign's success on his performance in Iowa, where he's secured a key endorsement from Gov. Kim Reynolds and recently completed a 99-county campaign swing.",
    "url": "https://www.politico.com/news/2023/12/03/desantis-projects-confidence-iowa-00129772"
  },
  {
    "text": "Trump's Defense to Charge That He's Anti-Democratic?  Accuse Biden of It  —  Indicted over a plot to overturn an election and campaigning on promises to shatter democratic norms in a second term, Donald Trump wants voters to see Joe Biden as the bigger threat.",
    "url": "https://www.nytimes.com/2023/12/02/us/politics/trump-iowa-biden-democracy.html"
  },
  {
    "text": "I've lost confidence in Lloyd Austin, Lindsey Graham says  —  The South Carolina Republican decries his statements on the Israel-Hamas war.  —  Sen. Lindsey Graham said Sunday he has lost confidence in Defense Secretary Lloyd Austin because of his recent comments about the Israel-Hamas war.",
    "url": "https://www.politico.com/news/2023/12/03/lloyd-austin-lindsey-graham-israel-hamas-00129775"
  },
  {
    "text": "Cop28 president says there is ‘no science’ behind demands for phase-out of fossil fuels  —  Exclusive: UAE's Sultan Al Jaber says phase-out of coal, oil and gas would take world ‘back into caves’  —  The president of Cop28, Sultan Al Jaber, has claimed there is “no science” … ",
    "url": "https://www.theguardian.com/environment/2023/dec/03/back-into-caves-cop28-president-dismisses-phase-out-of-fossil-fuels"
  },
  {
    "text": "One Supreme Court Case Could Mess Up Chunks of the Tax Code  —  Justices will debate the meaning of ‘income’ under the 16th Amendment  —  WASHINGTON—A case that could punch holes in the federal tax code heads to the Supreme Court on Tuesday.  —  The court will hear arguments in Moore v. U.S. … ",
    "url": "https://www.wsj.com/us-news/law/one-supreme-court-case-could-mess-up-chunks-of-the-tax-code-680a9ba6?mod=followamazon"
  },
  {
    "text": "DeSantis's Education Policies in Florida Drive Out Liberal-Leaning Professors  —  Liberal-leaning professors are leaving coveted jobs with tenure.  And there are signs that recruiting scholars has become harder.  —  Gov. Ron DeSantis had just taken office in 2019 when the University … ",
    "url": "https://www.nytimes.com/2023/12/03/us/florida-professors-education-desantis.html"
  },
  {
    "text": "George Santos Movie in the Works at HBO Films  —  A movie about George Santos is in the works at HBO Films, Variety has confirmed.  —  HBO Films has optioned the rights to Mark Chiusano's book “The Fabulist: The Lying, Hustling, Grifting, Stealing, and Very American Legend of George Santos,” which was published on Nov. 28.",
    "url": "https://variety.com/2023/film/news/george-santos-movie-in-development-hbo-films-1235819803/"
  },
  {
    "text": "The Dirty Tricks the GOP Is Using to Keep Abortion Off the Ballot in 2024  —  Republicans are getting killed on reproductive rights, and they're taking desperate measures to prevent their constituents from having a say next year  —  TIFFANY CAMPBELL USED to describe herself as a “hardcore, church-going Republican.”",
    "url": "https://www.rollingstone.com/politics/politics-features/republicans-dirty-tricks-abortion-2024-ballots-1234907158/"
  },
  {
    "text": "Al Gore slams COP28 climate summit host UAE, says its emissions soared  —  Climate advocate and former U.S. Vice President Al Gore on Sunday slammed the UAE - host of the COP28 climate summit - saying its position as overseer of international negotiations on global warming this year was an abuse of public trust.",
    "url": "https://www.reuters.com/business/environment/al-gore-slams-cop28-climate-summit-host-uae-says-its-emissions-soared-2023-12-03/"
  },
  {
    "text": "Liz Cheney would rather see Democrats win in 2024  —  She warned of the “threat” from within her own party.  —  Former Republican Rep. Liz Cheney would rather cede power to Democrats than see members of her own party win in 2024, she said, calling a Republican majority a “threat,” … ",
    "url": "https://www.politico.com/news/2023/12/03/liz-cheney-would-rather-see-democrats-win-2024-00129796"
  },
  {
    "text": "‘Time to Be Bold’: Advice for Democrats from a Quietly Powerful Governor  —  Gov. Tim Walz has some tips for the party as he takes over as chair of the Democratic Governors Association.  —  Perhaps it's because he's a quintessential Midwesterner, but Minnesota Gov. Tim Walz has flown … ",
    "url": "https://www.politico.com/news/magazine/2023/12/03/tim-walz-democratic-governors-association-00129318"
  },
  {
    "text": "Open secret at climate talks: The top temperature goal is mostly gone  —  Researchers injected a sobering finding into global climate negotiations Sunday by saying the world will likely fail its most important warming test.  —  Leading scientists worldwide delivered a striking dose of reality … ",
    "url": "https://www.politico.com/news/2023/12/03/cop28-global-temperature-goal-00129766"
  },
  {
    "text": "Pro-DeSantis super PAC fires interim CEO after 9 days  —  Never Back Down fired Kristin Davison on Friday, according to two people familiar with the decision.  —  The chief super PAC supporting Republican presidential candidate Ron DeSantis, Never Back Down, has fired its interim chief executive officer after less than two weeks.",
    "url": "https://www.politico.com/news/2023/12/02/desantis-super-pac-ceo-00129765"
  },
  {
    "text": "Texas GOP executive committee rejects proposed ban on associating with Nazi sympathizers and Holocaust deniers  —  Some members of the committee said such a ban, proposed two months after a prominent conservative activist was caught meeting with a famous white supremacist, might be a “slippery slope” or too vague.",
    "url": "https://www.texastribune.org/2023/12/02/texas-gop-antisemitism-resolution/"
  },
  {
    "text": "Several killed in bombing during Catholic mass in Philippines  —  At least three people were killed and seven wounded in a bomb attack on a Catholic mass in the insurgency-plagued southern Philippines on Sunday, officials said.  —  The blast took place during a regular service … ",
    "url": "https://www.cbsnews.com/news/several-killed-bombing-catholic-mass-philippines-marawi/"
  }
]