[
  {
    "text": "Top Producer of ‘60 Minutes’ Quits, Saying He Lost Independence  —  The news program has faced mounting pressure from both President Trump and its corporate ownership at Paramount, the parent company of CBS News.  —  CBS News entered a new period of turmoil on Tuesday after the executive producer of … ",
    "url": "https://www.nytimes.com/2025/04/22/business/media/cbs-60-minutes-trump-bill-owens.html?unlocked_article_code=1.Bk8.1wV3.zcXqaT2IC3Hx&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "3 Adams Case Prosecutors Resign Rather Than Express Regret to Justice Dept.  —  They had been placed on administrative leave after refusing to abandon the corruption case against Mayor Eric Adams.  “We will not confess wrongdoing when there was none,” they wrote.",
    "url": "https://www.nytimes.com/2025/04/22/nyregion/eric-adams-prosecutors-resign.html?unlocked_article_code=1.Bk8.1GRe.r406j5r3Evmp"
  },
  {
    "text": "Three prosecutors in corruption case against NYC Mayor Eric Adams resign  —  The three remaining federal prosecutors who brought criminal corruption charges against New York City Mayor Eric Adams resigned in protest on Tuesday, saying the Justice Department pressured them to admit wrongdoing … ",
    "url": "https://www.reuters.com/world/us/three-prosecutors-corruption-case-against-nyc-mayor-eric-adams-resign-according-2025-04-22/"
  },
  {
    "text": "Info Pete Hegseth shared with wife, brother came from top general's secure messages  —  Hegseth has denied the information he shared was classified, but it was given to him on a system for sensitive and classified information, sources told NBC News.  —  WASHINGTON — Minutes … ",
    "url": "https://www.nbcnews.com/politics/national-security/info-pete-hegseth-shared-wife-brother-came-top-generals-secure-message-rcna198838?link_source=ta_bluesky_link&taid=68078c1766e4b3000122ed90"
  },
  {
    "text": "Under Hegseth, Chaos Prevails at the Pentagon  —  The defense secretary's inner circle is in disarray, and distrust is growing among civil servants and senior military officials.  —  Defense Secretary Pete Hegseth arrived at the Pentagon in January with almost no government experience … ",
    "url": "https://www.nytimes.com/2025/04/22/us/politics/hegseth-chaos-pentagon.html?unlocked_article_code=1.Bk8.-kIj.trHRIjzi_Req&smid=bs-share"
  },
  {
    "text": "Revealed: Trump Admin Launches the Biggest Shake-Up ‘In Decades’ at the State Department  —  Internal documents obtained by The Free Press detail plans to close 132 offices, including those launched to further human rights, counter extremism, and prevent war crimes.",
    "url": "https://www.thefp.com/p/trump-state-shake-up-rubio"
  },
  {
    "text": "Chinese freight ship traffic to busiest U.S. ports, Los Angeles, Long Beach, sees steep drop … The pullback in trade between the U.S. and China as a result of President Trump's steep tariffs on Chinese goods and fears of a recession are starting to show up in major ports data … ",
    "url": "https://www.cnbc.com/2025/04/22/busiest-us-ports-see-big-drop-in-chinese-freight-vessel-traffic.html"
  },
  {
    "text": "RFK Jr. Set to Launch Disease Registry Tracking Autistic People  —  Robert F. Kennedy Jr. is using private medical records to create a registry of people with autism in the United States.  —  The National Institutes of Health is helping to collect private medical records from government … ",
    "url": "https://newrepublic.com/post/194245/rfk-jr-disease-registry-track-autistic-people"
  },
  {
    "text": "George Mason University calls cops on student for article criticizing Trump  —  GMU student Nicholas Decker's Substack essay “When Must We Kill Them?” earned him a visit from the Secret Service  —  In 1787, Thomas Jefferson declared that “The tree of liberty must be refreshed from time to time with the blood of patriots and tyrants.”",
    "url": "https://www.thefire.org/news/george-mason-university-calls-cops-student-article-criticizing-trump"
  },
  {
    "text": "Venezuelan Immigrant Deported by Trump Administration Has Disappeared  —  The immigrant does not appear on a list of people sent to a prison in El Salvador, and his family and friends have no idea of his whereabouts.  He has essentially disappeared.  —  In late January, Ricardo Prada Vásquez … ",
    "url": "https://www.nytimes.com/2025/04/22/us/venezuela-immigrant-disappear-deport-ice.html?unlocked_article_code=1.Bk8.1Xxc.PSd78C9iLzi0&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "US FDA suspends milk quality tests amid workforce cuts  —  The Food and Drug Administration is suspending a quality control program for testing of fluid milk and other dairy products due to reduced capacity in its food safety and nutrition division, according to an internal email seen by Reuters.",
    "url": "https://www.reuters.com/business/healthcare-pharmaceuticals/us-fda-suspends-milk-quality-tests-amid-workforce-cuts-2025-04-21/"
  },
  {
    "text": "The Biden Official Who Doesn't Oppose Trump's Student Deportations  —  Why the Holocaust historian Deborah Lipstadt blames universities for “opening the door” to the Trump Administration's professed campaign to tackle antisemitism.  —  After Hamas's attack on Israel on October 7th, 2023 … ",
    "url": "https://www.newyorker.com/news/q-and-a/the-biden-official-who-doesnt-oppose-trumps-student-deportations"
  },
  {
    "text": "Even on the gravest of issues, GOP can't summon the will to question Trump  —  Just weeks after Republicans stood by as Trump's tariffs threw the economy into chaos, they're doing the same with Pete Hegseth and national security.  —  It took Pete Hegseth just three weeks as defense secretary … ",
    "url": "https://www.washingtonpost.com/politics/2025/04/22/hegseth-national-security-concerns/"
  },
  {
    "text": "Authorities won't charge man caught on video vandalizing Teslas in Minneapolis  —  Police chief responds with frustration that the state white collar employee is being spared prosecution after causing more than $21,000 in damages. … A man was caught on video vandalizing a Tesla in Minneapolis last month.",
    "url": "https://www.startribune.com/suspect-in-tesla-vandalizing-spree-in-minneapolis-to-be-entered-into-diversion-and-not-charged/601334027"
  },
  {
    "text": "Dow Headed for Worst April Since 1932 as Investors Send ‘No Confidence’ Signal  —  Few think administration's negotiations with trade partners will yield results soon enough to ease the strain  —  Created with Highcharts 9.0.1Performance since April 2 'Liberation Day'Sources: Dow Jones Market Data … ",
    "url": "https://www.wsj.com/finance/investing/dow-jones-stocks-worst-april-1932-74fe82ac?st=EwREUw&reflink=article_copyURL_share"
  },
  {
    "text": "Democrats Demand Answers From Top Law Firms That Caved To Trump's Wishes  —  “Your agreement makes you complicit in efforts to undermine the rule of law,” they fumed to five prominent firms that paid off Trump to avoid his attacks.  —  WASHINGTON — Key Democrats sent scathing letters … ",
    "url": "https://www.huffpost.com/entry/democrats-law-firms-caved-trump_n_6806aecee4b06d0beefcfb3f"
  },
  {
    "text": "The $10M steered to Hope Florida by the state was Medicaid money, document shows  —  The $10 million that Gov. Ron DeSantis' administration diverted to a state-created charity last year consisted of Medicaid dollars owed to state and federal taxpayers, contrary to what the governor and other officials have publicly asserted.",
    "url": "https://www.miamiherald.com/news/politics-government/state-politics/article304665166.html"
  },
  {
    "text": "White House asked FERC's Phillips to step down  —  His exit from the commission will leave a 2-2 partisan split, and allow President Donald Trump to tap a replacement commissioner.  —  FERC Commissioner Willie Phillips, a Democrat who chaired the agency under President Joe Biden … ",
    "url": "https://www.politico.com/news/2025/04/22/white-house-asked-fercs-phillips-to-step-down-00302660"
  },
  {
    "text": "A Ticking Clock on American Freedom … Look around, take stock of where you are, and know this: Today, right now—and I mean right this second—you have the most power you'll ever have in the current fight against authoritarianism in America.  If this sounds dramatic to you, it should.",
    "url": "https://www.theatlantic.com/ideas/archive/2025/04/america-trump-authoritarianism-global/682528/?gift=1ga2TvL-DbuHDQIcYF7oR9dXJw6lrzi5yXGetl8SqWg&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "White House is ‘close’ on Japan, India tariff agreements — but expect them to be light on specifics  —  One person close to the White House said that it “may take months to hammer out the final deals.”  —  The White House is closing in on general agreements with Japan and India … ",
    "url": "https://www.politico.com/news/2025/04/22/white-house-is-close-on-japan-india-agreements-but-expect-them-to-be-light-on-specifics-00302762"
  },
  {
    "text": "The Force That Holds Trump's Coalition Together  —  Traditional Republican elites tolerate the authoritarianism because they want the tax cuts.  —  When I was 5 or 6 years old, I pulled an extremely mean trick on my little brother.  I told him that if he cleaned my room, I “might give him a dollar.”",
    "url": "https://www.theatlantic.com/politics/archive/2025/04/trump-gop-tax-rich/682533/"
  },
  {
    "text": "The Market Is Discovering Trump May Be Crazy  —  Oh, look, the president is attacking the Supreme Court again:  —  Isn't it great to live in a world where we just note that in passing before getting on to the rest of the lunatic news?  Happy Tuesday.  —  More Like ‘Ow Jones,’ Am I Right?",
    "url": "https://www.thebulwark.com/p/market-discovering-trump-crazy-fed-powell-economy"
  },
  {
    "text": "Hundreds of scholars say U.S. is swiftly heading toward authoritarianism  —  WASHINGTON — A survey of more than 500 political scientists finds that the vast majority think the United States is moving swiftly from liberal democracy toward some form of authoritarianism.",
    "url": "https://www.npr.org/2025/04/22/nx-s1-5340753/trump-democracy-authoritarianism-competive-survey-political-scientist"
  },
  {
    "text": "Jury finds NY Times not liable in Sarah Palin defamation case  —  A federal jury in Manhattan on Tuesday found the New York Times (NYT.N) not liable for allegedly defaming Sarah Palin in a 2017 editorial about gun control, dealing the former Republican U.S. vice presidential candidate a second loss at trial.",
    "url": "https://www.reuters.com/world/us/jury-finds-ny-times-not-liable-sarah-palin-defamation-case-2025-04-22/"
  },
  {
    "text": "Stop!  In the Name of Trump!  —  Yesterday Bloomberg posted an article titled “Markets Are Discovering the Real Trump Trade Is ‘Sell America’.”  That's about right.  Look at the value of the dollar on international markets, shown at the top of this post.  For a while after the election investors loved Trump, not wisely but too well.",
    "url": "https://paulkrugman.substack.com/p/stop-in-the-name-of-trump"
  },
  {
    "text": "The Hegseth Pentagon Chronicles  —  The Defense secretary is validating the concerns of his critics.  —  No doubt the Beltway press would love to knock Pete Hegseth out as Defense secretary, but that doesn't come close to explaining the mess at the Pentagon.",
    "url": "https://www.wsj.com/opinion/pete-hegseth-pentagon-leaks-dismissals-signal-chat-b296e38e"
  },
  {
    "text": "Supreme Court weighs parents' objections to LGBTQ content in elementary schools  —  Some parents in Montgomery County, Md., schools say they have a religious right to ensure their children aren't exposed to LGBTQ books in the classroom.  —  WASHINGTON — The Supreme Court on Tuesday considers … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/parents-objections-lgbtq-books-elementary-schools-montgomery-county-md-rcna202193"
  },
  {
    "text": "Draft executive order outlines plan to integrate AI into K-12 schools  —  A policy under consideration by the White House and seen by The Post instructs federal agencies on how to incorporate artificial intelligence into classrooms.  —  The Trump administration is considering issuing … ",
    "url": "https://www.washingtonpost.com/education/2025/04/22/ai-schools-executive-order-trump-draft/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ1Mjk0NDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ2Njc2Nzk5LCJpYXQiOjE3NDUyOTQ0MDAsImp0aSI6ImMyMmFlNWY1LWZlZTUtNGFkNS04YzI5LTRkMGY2NGM2MDJkMyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9lZHVjYXRpb24vMjAyNS8wNC8yMi9haS1zY2hvb2xzLWV4ZWN1dGl2ZS1vcmRlci10cnVtcC1kcmFmdC8ifQ.kZQoEmtK8YUZQVDTZidEQKeAAeZXTwtL7kFYsV8f0WA"
  },
  {
    "text": "New images could change cancer diagnostics, but ICE detained the Harvard scientist who analyzes them  —  Without scientist Kseniia Petrova's expertise, no one can fully unlock the data's potential, putting crucial advancements in early cancer detection at risk.",
    "url": "https://www.nbcnews.com/news/us-news/ice-detain-kseniia-petrova-protest-harvard-cancer-research-rcna202180"
  },
  {
    "text": "Tulsi Gabbard's NIE Lies Make Dick Cheney Look Honest by Comparison  —  Yesterday, Tulsi Gabbard posted this tweet.  —  The last sentence of the tweet, referencing an “assessment that the foreign terrorist organization, Tren De Aragua, is acting with the support of the Maduro Regime,” … ",
    "url": "https://www.emptywheel.net/2025/04/22/tulsi-gabbards-nie-lies-make-dick-cheney-look-honest-by-comparison/"
  }
]