[
  {
    "text": "Ex-Chief of Staff Mark Meadows granted immunity, tells special counsel he warned Trump about 2020 claims: Sources  —  Meadows said Trump was “dishonest” on election night, according to sources.  —  Former President Donald Trump's final chief of staff in the White House, Mark Meadows … ",
    "url": "https://abcnews.go.com/US/chief-staff-mark-meadows-granted-immunity-tells-special/story?id=104231281"
  },
  {
    "text": "Cautions on ABC's Huge Mark Meadows Scoop  —  For more than six months, access journalists in DC have been trying to confirm how much Mark Meadows cooperated with Jack Smith.  —  Today, ABC has a huge scoop reporting that Meadows testified at least three times, one time — before a grand jury — with immunity.",
    "url": "https://www.emptywheel.net/2023/10/24/cautions-on-abcs-huge-mark-meadows-scoop/"
  },
  {
    "text": "Cohen Denounces Trump During Courtroom Face-Off  —  Michael D. Cohen accused his onetime boss, Donald J. Trump, of manipulating his net worth as Mr. Trump stared blankly ahead.  It was their first interaction in five years.  —  For five years, Michael D. Cohen has waged battle with Donald J. Trump … ",
    "url": "https://www.nytimes.com/2023/10/24/nyregion/trump-michael-cohen-fraud-trial.html"
  },
  {
    "text": "‘I killed him’: How Trump torpedoed Tom Emmer's speaker bid  —  Just when the congressman thought he had neutralized Trump, the former president lowered the boom.  —  Just hours after Rep. Tom Emmer (R-Minn.) won the Republican Conference's nomination to be Speaker on Tuesday … ",
    "url": "https://www.politico.com/news/2023/10/24/i-killed-him-how-trump-torpedoed-tom-emmers-speaker-bid-00123329"
  },
  {
    "text": "Trump rages as former acolytes turn against him under legal heat  —  Donald Trump's wealth, power and fame acted like a magnet for new associates keen to enter his orbit.  But now, key figures who sought a share of his reflected glory are turning against him to save themselves.",
    "url": "https://www.cnn.com/2023/10/25/politics/trump-former-aides-turn-against-him/"
  },
  {
    "text": "Mitt Romney sounds one last alarm on Trump  —  Ever since the rise of Donald Trump, many folks involved in politics have theorized about how we got here — and done a little introspection about whether anyone could have stopped him.  —  But my assumption is that there are three people alive today … ",
    "url": "https://www.nbcnews.com/politics/elections/chuck-todd-mitt-romney-sounds-one-last-alarm-trump-rcna121771"
  },
  {
    "text": "Emmer bid collapses, extending extraordinary GOP Speaker losing streak  —  House Majority Whip Tom Emmer's (R-Minn.) Speakership nomination collapsed in extraordinary fashion Tuesday, surviving only four hours and showcasing the complete chaos enveloping the House GOP conference.",
    "url": "https://thehill.com/homenews/house/4273184-tom-emmer-drops-out-speakers-race/"
  },
  {
    "text": "Biden is worried about wider war in the Middle East.  Here's how it could happen.  —  From Yemen's rebels launching missiles to alleged Israeli settler killings of Palestinians in the West Bank, the entire region faces chaos.  —  U.S. officials are worried that violence in Israel's neighbors will spiral into a larger regional war.",
    "url": "https://www.politico.com/news/2023/10/25/israel-hamas-war-fallout-00123360"
  },
  {
    "text": "Florida orders universities to ‘deactivate’ pro-Palestinian group  —  TALLAHASSEE, Fla. — Florida's university system chancellor, responding to a push by Gov. Ron DeSantis, directed state universities Tuesday to disband campus groups with ties to the national Students for Justice in Palestine organization … ",
    "url": "https://www.politico.com/news/2023/10/24/florida-orders-universities-to-deactivate-pro-palestinian-group-00123350"
  },
  {
    "text": "Voters soundly reject Gabrielle Hanson, other MAGA candidates in historic Franklin, Tennessee election  —  FRANKLIN, Tenn. (WTVF) — In perhaps the most bizarre race that this picturesque Middle Tennessee community has ever experienced, Franklin voters resoundingly rejected a candidate for mayor … ",
    "url": "https://www.newschannel5.com/news/newschannel-5-investigates/franklin-politics/voters-soundly-reject-gabrielle-hanson-other-maga-candidates-in-historic-franklin-tennessee-election"
  },
  {
    "text": "McCarthy floats partnership with Jim Jordan as assistant speaker  —  Amid the impasse, McCarthy is floating a plan that would reinstall him as speaker and make Jordan, a conservative Trump ally, the assistant speaker, according to three sources familiar with McCarthy's pitch.",
    "url": "https://www.nbcnews.com/politics/congress/live-blog/house-republicans-choose-new-speaker-nominee-live-updates-rcna121674/rcrd22879?canonicalCard=true"
  },
  {
    "text": "Threats to American Democracy Ahead of an Unprecedented Presidential Election  —  Introduction  —  In this divided era of American politics, the nation turns its eyes toward an unprecedented presidential election, with two of the oldest leading candidates in history … ",
    "url": "https://www.prri.org/research/threats-to-american-democracy-ahead-of-an-unprecedented-presidential-election/"
  },
  {
    "text": "MAGA Diehards Are Furious Jenna Ellis Pleaded Guilty After Raising $200K  —  Jenna Ellis raised more than $216,000 to fight her Georgia RICO indictment ... then accepted a plea deal  —  Jenna Ellis smiled in her mugshot.  The former Trump attorney who was indicted alongside him and 17 others … ",
    "url": "https://www.rollingstone.com/politics/politics-news/jenna-ellis-draws-maga-ire-pleading-guilty-fundraising-1234861064/"
  },
  {
    "text": "Hillary Clinton Repeatedly Snaps At Heckler In Bonkers Exchange  —  A protester got in the face of the former secretary of state, and she just wanted him to shut up during a panel at Columbia University.  —  LOADING  —  Hillary Clinton attempted to quiet a theatrical heckler this week in a tense exchange that lasted several minutes.",
    "url": "https://www.huffpost.com/entry/hillary-clinton-heckler-columbia_n_6538ea9ee4b0c8556103621c"
  },
  {
    "text": "The 8th Amendment is next  —  Right-wing judges want to put the “cruel” back in “cruel and unusual punishment.” … Over the last year, the fallout from the Supreme Court's decision in New York State Rifle and Pistol Association v. Bruen has been profound.",
    "url": "https://www.publicnotice.co/p/8th-amendment-scotus-clarence-thomas-hardiman"
  },
  {
    "text": "Republicans pray for an early voting reversal in Virginia  —  The Republican Party under President Donald Trump has abandoned the practice.  Glenn Youngkin is betting Virginia Republicans can be convinced otherwise.  —  GLEN ALLEN, Va. — Gov. Glenn Youngkin is trying to get Republican voters … ",
    "url": "https://www.politico.com/news/2023/10/25/republicans-early-voting-virginia-youngkin-trump-00123376"
  },
  {
    "text": "Trump, the UAW, and the electrified future  —  This week, the United Auto Workers (UAW) significantly expanded its strike of the three major U.S. automakers, targeting some of the companies' largest and most profitable facilities.  On Monday, the union struck the Stellantis RAM pickup factory, which employs 6,800 workers.",
    "url": "https://popular.info/p/the-uaw-trump-and-the-electrified"
  },
  {
    "text": "A Close Look at Some Key Evidence in the Gaza Hospital Blast  —  A widely cited missile video does not shed light on what happened, a Times analysis concludes.  —  The video shows a projectile streaking through the darkened skies over Gaza and exploding in the air.  Seconds later, another explosion is seen on the ground.",
    "url": "https://www.nytimes.com/2023/10/24/world/middleeast/gaza-hospital-israel-hamas-video.html"
  }
]