[
  {
    "text": "Rage Against Elon Musk Turns Tesla Into a Target  —  The backlash against the electric vehicle company has turned violent at times, as its billionaire chief executive parlays his support for President Trump into consequential influence over the federal government.",
    "url": "https://www.nytimes.com/2025/03/08/business/elon-musk-tesla-violence-protests-vandalism.html"
  },
  {
    "text": "Anger at Elon Musk turns violent with molotov cocktails and gunfire at Tesla lots  —  The string of violence against Tesla storefronts, charging stations and vehicles exacerbates the company's woes, analysts said.  —  The woman in the black hoodie walked onto the Tesla car lot prepared to inflict damage.",
    "url": "https://www.washingtonpost.com/technology/2025/03/08/elon-musk-tesla-protest-violence-vandalism/"
  },
  {
    "text": "DHS has begun performing polygraph tests on employees to find leakers  —  DHS Secretary Kristi Noem and border czar Tom Homan have blamed lower-than-expected ICE arrest numbers on recent leaks about planned operations.  —  The Department of Homeland Security has begun performing polygraph tests … ",
    "url": "https://www.nbcnews.com/politics/national-security/dhs-begun-performing-polygraph-tests-employees-find-leakers-rcna195485"
  },
  {
    "text": "The US is ending support for Ukrainian F-16s, but there is a way out  —  Читати українською  —  US President Donald Trump's team has ordered the termination of vital support for F-16 fighter jet jamming equipment that Ukraine has.",
    "url": "https://news.online.ua/en/the-us-is-ending-support-for-ukrainian-f-16s-but-there-is-a-way-out-891472/"
  },
  {
    "text": "Republicans unveil another extension to try to avert government shutdown  —  With less than a week to go before a March 14 shutdown deadline, it is not clear if Republicans have the votes to pass the continuing resolution unveiled Saturday.  —  Just now  —  Congressional Republicans are racing to avert a government shutdown.",
    "url": "https://www.washingtonpost.com/politics/2025/03/08/government-shutdown-cr-congress-trump/"
  },
  {
    "text": "Pro-Palestinian activists vandalise Trump's Turnberry golf course  —  The Palestine Action group spray painted the clubhouse and gates and dug up the greens, in protest over the US president's plans for Gaza  —  Pro-Palestinian protesters have vandalised one of Donald Trump's golf courses … ",
    "url": "https://www.thetimes.com/uk/politics/article/trump-turnberry-golf-course-vandalised-palestine-action-hd6tfz9lm"
  },
  {
    "text": "Trump signs order to limit who gets public service student loan forgiveness  —  The president says some nonprofit organizations that qualify for the program are engaging in illegal activity, without offering any proof.  —  In a move that could upend a popular federal program … ",
    "url": "https://www.washingtonpost.com/education/2025/03/07/public-service-loan-forgiveness-trump-executive-order/"
  },
  {
    "text": "US ‘to cease all future military exercises in Europe’  —  Nato countries could be forced to plan manoeuvres without US as Trump continues pivot away from bloc  —  The United States has told its allies that it does not plan to participate in military exercises in Europe, according to reports.",
    "url": "https://www.telegraph.co.uk/us/politics/2025/03/08/us-to-cease-all-future-military-exercises-in-europe-reports/"
  },
  {
    "text": "FEMA cancels classes at national fire training academy amid federal funding cuts  —  The country's preeminent federal fire training academy canceled classes, effective immediately, on Saturday amid the ongoing flurry of funding freezes and staffing cuts by President Donald Trump's administration.",
    "url": "https://apnews.com/article/national-fire-academy-fema-trump-cuts-doge-9cec46a638d66f19c5b8fe695e721bd6"
  },
  {
    "text": "HHS grants DOGE access to child support database, overriding objections  —  An HHS official said the associates of Elon Musk's group had sought ‘read-only’ access.  —  just now  —  The Department of Health and Human Services has granted associates of the U.S. DOGE Service access … ",
    "url": "https://www.washingtonpost.com/business/2025/03/08/hhs-doge-child-support/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQxNDEwMDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQyNzg4Nzk5LCJpYXQiOjE3NDE0MTAwMDAsImp0aSI6IjhkNzNkMWI2LTVmNTAtNGZiYy04ODM3LWYyMGU2NWE3ZmU0ZSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9idXNpbmVzcy8yMDI1LzAzLzA4L2hocy1kb2dlLWNoaWxkLXN1cHBvcnQvIn0.LevW59hwW9p_U4Nzr9-Z0wnvYLJe7p0-1bo2Kn1RsMs&itid=gfta"
  },
  {
    "text": "More NOAA Employees May Be Let Go, Making 20% of Staff Cut  —  Together with recent firings and resignations, the new cuts could hamper the National Weather Service's ability to produce lifesaving forecasts, scientists say.  —  The National Oceanic and Atmospheric Administration … ",
    "url": "https://www.nytimes.com/2025/03/08/climate/noaa-layoffs-trump.html"
  },
  {
    "text": "‘A disruptive effect’: How slashing staff at the Social Security Administration is sparking fears the system could collapse  —  Millions of Americans could soon feel the impact of the deep staffing cuts being planned at the Social Security Administration, which is undergoing a massive reorganization … ",
    "url": "https://www.cnn.com/2025/03/08/politics/social-security-administration-staff-cuts/"
  },
  {
    "text": "Tim Walz has some sharp critiques of the Dem 2024 campaign  —  The Harris-Walz campaign should have “rolled the dice” more, he told POLITICO.  —  HELENA, Montana — Tim Walz thinks he and Kamala Harris played it too safe last year.  —  He thinks they should have held more town halls.",
    "url": "https://www.politico.com/news/2025/03/08/tim-walz-2024-campaign-critiques-00219718"
  },
  {
    "text": "US Intelligence Ban Leads to Heavy Ukrainian Losses  —  The decision by the United States to suspend military intelligence sharing with Ukraine has contributed to significant battlefield losses, with Russian forces advancing along key frontlines.  —  Reports indicate that the halt … ",
    "url": "https://eutoday.net/us-intelligence-ban-leads-to-heavy-ukrainian-losses/"
  },
  {
    "text": "Trump Is Nero While Washington Burns  —  'Trump's message is that being his ally serves no purpose, because he will not defend you.' … Europe is at a crucial juncture of its history.  The American shield is slipping away, Ukraine risks being abandoned, and Russia is being strengthened.",
    "url": "https://www.theatlantic.com/international/archive/2025/03/claude-malheuret-speech/681947/?gift=47TjPNd1fvywdLyCkprj-M7M-dEqIpyt2KyZFde_yFU&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Invading Canada would spark guerrilla fight lasting decades, expert says  —  Canadian ‘niceness’ is a myth that would vanish overnight in the face of invasion  —  An expert on insurgency says an American military incursion into Canada would be a disaster — for the United States.",
    "url": "https://calgaryherald.com/opinion/columnists/braid-invading-canada-would-spark-guerrilla-fight-lasting-decades-expert-says"
  },
  {
    "text": "China Hits Canada With Tariffs in Indirect Riposte to Trump  —  Beijing, which set steep duties on canola, peas and pork, wants Canada and Mexico to resist U.S. pressure to raise tariffs on Chinese goods.  —  China announced tariffs of up to 100 percent on canola, pork and other foods … ",
    "url": "https://www.nytimes.com/2025/03/08/business/china-tariffs-canada.html"
  },
  {
    "text": "Some Republicans act as if Musk is the first to uncover waste.  He isn't.  —  Outside groups from across the ideological spectrum have spent decades documenting questionable government spending.  —  Just now  —  Supporters of Elon Musk's chainsaw approach to slashing the federal government speak … ",
    "url": "https://www.washingtonpost.com/politics/2025/03/08/elon-musk-doge-congress-fraud/"
  },
  {
    "text": "Trump says brief economic pain is worth long-term gain.  Will Americans agree?  —  The White House says economic pain is a temporary side-effect of its overhauls.  But Americans might not be willing to endure much more uncertainty.  —  The economy is on shaky footing — a necessary moment of upheaval … ",
    "url": "https://www.washingtonpost.com/business/2025/03/08/trump-economy-risks-tariffs-inflation-prices/"
  },
  {
    "text": "‘These guys just looked at the crowd and opened fire,’ Toronto police say after Scarborough pub mass shooting  —  Nobody killed but 12 injured by bullets and flying glass, shooters at large  —  Toronto Police Chief Myron Demkiw called the mass shooting at a Scarborough pub an … ",
    "url": "https://www.cbc.ca/news/canada/toronto/shooting-scarborough-pub-1.7478570"
  },
  {
    "text": "Some House members have mental faculties so diminished they can no longer do their jobs — and others voting drunk, high: lawmakers  —  Up to a dozen members of Congress reportedly have mental faculties so diminished they can no longer do their jobs — with some even showing up drunk or stoned to cast votes.",
    "url": "https://nypost.com/2025/03/08/us-news/some-house-members-have-mental-faculties-so-diminished-they-can-no-longer-do-their-jobs-and-others-voting-drunk-high-lawmakers/"
  },
  {
    "text": "Trump's Justice Dept. ousts national security officials in latest purge  —  The transferring of at least three national security officials amounts to a complete gutting of leadership in the highly sensitive National Security Division.  —  just now  —  The Justice Department … ",
    "url": "https://www.washingtonpost.com/national-security/2025/03/08/trumps-justice-dept-ousts-national-security-officials-latest-purge/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQxNDEwMDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQyNzg4Nzk5LCJpYXQiOjE3NDE0MTAwMDAsImp0aSI6IjUwN2FjYmM2LTZlZGMtNGRlYi1hNTAxLTkwZDU2OTk0ZTRkOSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb25hbC1zZWN1cml0eS8yMDI1LzAzLzA4L3RydW1wcy1qdXN0aWNlLWRlcHQtb3VzdHMtbmF0aW9uYWwtc2VjdXJpdHktb2ZmaWNpYWxzLWxhdGVzdC1wdXJnZS8ifQ.F9jfSsMwPT5n8R8_y4KUE-jTT4ZHVz_o7zojG-h_APQ&itid=gfta"
  },
  {
    "text": "Republican Medicaid cuts could shutter rural hospitals, maternity care  —  Potential Medicaid cuts could devastate America's teetering rural health-care system and jeopardize Republicans' political power among rural voters.  —  HONDO, Tex. — Jaylee Williams needed to find somewhere to deliver her son.",
    "url": "https://www.washingtonpost.com/health/2025/03/08/medicaid-cuts-rural-hospitals/"
  },
  {
    "text": "'I'm on the side of the workers': the Minnesota senator calling out Trump and Musk  —  Tina Smith is leaving at the end of her term, and says she would call Musk a dick even if she had to face re-election  —  The American people “can see in Elon Musk and in Donald Trump” the … ",
    "url": "https://www.theguardian.com/us-news/2025/mar/08/tina-smith-minnesota-senator-interview"
  }
]