[
  {
    "text": "Ukraine uses long-range missiles secretly provided by US to hit Russian-held areas, officials say  —  Ukraine for the first time has begun using long-range ballistic missiles provided secretly by the United States, bombing a Russian military airfield in Crimea last week and Russian forces … ",
    "url": "https://apnews.com/article/russia-ukraine-war-long-range-missiles-4d2254639eb5a503d8b0a291ed0680e9"
  },
  {
    "text": "GOP senator: Greene ‘dragging our brand down’  —  Sen. Thom Tillis (R-N.C.) took a shot at Rep. Marjorie Taylor Greene (R-Ga.) Tuesday, saying she is “dragging our brand down.”  —  “She is a horrible leader,” Tillis said of Greene, according to audio played on CNN's “Erin Burnett OutFront.”",
    "url": "https://thehill.com/homenews/senate/4617334-gop-senator-thom-tillis-says-greene-dragging-our-brand-down/"
  },
  {
    "text": "Biden signs foreign aid bill providing crucial military assistance to Ukraine  —  President Joe Biden on Wednesday signed into law an aid package providing crucial military assistance to Ukraine, capping months of negotiations and debate.  —  The aid package, passed by the Senate late Tuesday evening … ",
    "url": "https://www.cnn.com/2024/04/24/politics/biden-signs-foreign-aid-bill"
  },
  {
    "text": "Arizona state House passes a bill to repeal 1864 abortion ban  —  On their third try in three weeks, state House lawmakers voted to reverse a near-total ban on the procedure following an Arizona Supreme Court ruling.  —  On their third attempt in three weeks, Arizona state House lawmakers voted Wednesday … ",
    "url": "https://www.nbcnews.com/politics/arizona-abortion-ban-lawmakers-repeal-rcna149181?taid=66293ac2029dc600017aa414"
  },
  {
    "text": "Arizona House votes to repeal abortion ban, advancing issue to state Senate  —  PHOENIX — The Arizona House voted Wednesday to repeal a Civil War-era ban on nearly all abortions that is set to take effect as early as June 8.  The measure now heads to the state Senate, which could grant final passage next week.",
    "url": "https://www.washingtonpost.com/politics/2024/04/24/arizona-abortion-ban/"
  },
  {
    "text": "Rightwing US website that spreads election conspiracies declares bankruptcy  —  Gateway Pundit, run by Jim Hoft, is being sued for defamation by Georgia election workers Ruby Freeman and Shaye Moss and others  —  The Gateway Pundit, a rightwing website known for spreading election conspiracies … ",
    "url": "https://www.theguardian.com/world/2024/apr/24/gateway-pundit-rightwing-website-bankruptcy"
  },
  {
    "text": "How “The Nelson Mandela of America” Is Making Bank Off His Criminal Trial  —  IN THE FIRST WEEK OF HIS CRIMINAL TRIAL, Donald Trump raised about $5.6 million online by warning his small dollar-donors that the “Deep State” was out to lock him up.  —  “I JUST STORMED INTO COURT,” … ",
    "url": "https://www.thebulwark.com/p/trump-making-bank-off-his-criminal-trial"
  },
  {
    "text": "How to Know If the Supreme Court Is in the Tank for Trump  —  Trump's bid for immunity from prosecution in Washington is an absurd farce.  Will the court's conservatives bail him out?  —  This week at the Supreme Court, a simple question will sound difficult: Can a former president … ",
    "url": "https://www.politico.com/news/magazine/2024/04/24/trumps-crazy-argument-for-immunity-heads-to-the-high-court-00153954"
  },
  {
    "text": "Trump is a co-conspirator in Michigan's 2020 false electors plot, state investigator says  —  Lansing — Michigan prosecutors consider former President Donald Trump and some of his top aides co-conspirators in the plot to submit a certificate falsely claiming he won Michigan's 2020 election … ",
    "url": "https://www.detroitnews.com/story/news/politics/2024/04/24/donald-trump-unindicted-co-conspirator-in-false-electors-plot-michigan-rudy-giuliani-mark-meadows/73420368007/"
  },
  {
    "text": "Trump, Giuliani, Meadows are unindicted co-conspirators in Michigan fake elector case, hearing reveals  —  The Michigan AG last year charged 16 Republicans with being “fake electors.”  —  Former President Donald Trump speaks to supporters during a Farmers for Trump campaign event … ",
    "url": "https://abcnews.go.com/US/trump-giuliani-meadows-unindicted-conspirators-michigan-fake-elector/story?id=109578220"
  },
  {
    "text": "Biden-Harris Administration Announces Final Rule Requiring Automatic Refunds of Airline Tickets and Ancillary Service Fees  —  Rule makes it easy to get money back for cancelled or significantly changed flights, significantly delayed checked bags, and additional services not provided",
    "url": "https://www.transportation.gov/briefing-room/biden-harris-administration-announces-final-rule-requiring-automatic-refunds-airline"
  },
  {
    "text": "Why is Trump giving someone a ‘key to the White House’?  —  From Jan. 20, 2017, until Jan. 20, 2021, Donald Trump was president of the United States.  This is a position that includes many perks, offered to the person who was selected by American voters to serve as chief executive.",
    "url": "https://www.washingtonpost.com/politics/2024/04/24/trump-key-to-white-house/"
  },
  {
    "text": "2024 Race: Dead Heat: Biden 46%, Trump 46%, Quinnipiac University National Poll Finds; Support For Legal Abortion Reaches All-Time High  —  mail_outline  —  If the election for president were being held today, the race would be a dead heat between President Joe Biden and former President Donald Trump … ",
    "url": "https://poll.qu.edu/poll-release?releaseid=3896"
  },
  {
    "text": "DISGUSTING: Hamas Releases Propaganda Video of American Hostage Missing His Arm  —  Hamas has released a propaganda video featuring one of the American hostages it holds.  In it, Hersh Goldberg-Polin is seen reading a pre-prepared script blaming Israel for October 7th and everything that has transpired since.",
    "url": "https://redstate.com/bonchie/2024/04/24/disgusting-hamas-releases-propaganda-video-of-american-hostage-missing-his-arm-n2173239"
  },
  {
    "text": "'You're not dumb, you're insulting!'  Sparks fly on Fox News set over Trump ‘lies’  —  Fox News guest host Charles Payne clashed with co-host Leslie Marshall over the difference between President Joe Biden's misstatements and former President Donald Trump's false claims.",
    "url": "https://www.rawstory.com/biden-gaffes/"
  },
  {
    "text": "How the House GOP's Biden impeachment effort fell apart  —  House Oversight Committee Chairman James Comer was eager to take the reins of a high-stakes investigation into President Joe Biden and his family, seen as central to the House Republican agenda - a coveted perch that brought the added benefit of elevating his national profile.",
    "url": "https://www.cnn.com/2024/04/24/politics/house-gop-biden-impeachment-effort"
  },
  {
    "text": "New Jersey Rep. Donald Payne Jr. dead at 65  —  Rep. Donald Payne Jr. (D-N.J.), who represented New Jersey in the House for more than a decade, has died at the age of 65.  —  New Jersey Gov. Phil Murphy (D) confirmed Payne's death in a statement on Wednesday.",
    "url": "https://thehill.com/homenews/house/4618099-donald-payne-jr-dead-new-jersey/"
  },
  {
    "text": "Pennsylvania Primary Election Results  —  President  —  Republican Primary  —  Candidate Votes Pct.  % Delegates  —  790,471  —  83.4%  —  157,579  —  16.6%  —  Total reported  —  948,050  —  100% of delegates allocated (16 of 16)  —  Trump  —  Vote share Size of lead",
    "url": "https://www.nytimes.com/interactive/2024/04/23/us/elections/results-pennsylvania-primary.html"
  },
  {
    "text": "New York governor to Mike Johnson: Stay in Washington  —  New York Gov. Kathy Hochul said House Speaker Mike Johnson should be focusing on Washington instead of “politicizing” the ongoing crisis at Columbia University.  —  ALBANY, New York — Gov. Kathy Hochul doesn't see the benefit … ",
    "url": "https://www.politico.com/news/2024/04/24/mike-johson-columbia-new-york-hochul-00154114"
  },
  {
    "text": "How Donald Trump Gets His News  —  The former president is a voracious press consumer.  Here's how his media diet has changed since his last presidential campaign.  —  Donald Trump has always had a symbiotic relationship with the media.  Back when he was a Manhattan bachelor and real estate mogul … ",
    "url": "https://www.politico.com/news/magazine/2024/04/24/donald-trump-news-consumption-00153477"
  },
  {
    "text": "Trump's New Legal Bills Are Hiding an $8 Million Mystery  —  CONCEALED CARRY  —  Trump is using a GOP compliance firm as a go-between to pay lawyers, allowing him to hide who he's actually paying.  Experts have real questions whether he can do that.",
    "url": "https://www.thedailybeast.com/trumps-new-legal-bills-are-hiding-an-dollar8-million-mystery"
  },
  {
    "text": "Ohio lawmakers eliminate ‘archaic’ marital rape loophole after years-long fight  —  Ohio lawmakers voted Wednesday to criminalize marital rape in all situations, ending a years-long fight over a law that critics cast as archaic and harmful to survivors.  —  The Ohio Senate unanimously passed legislation … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/04/24/ohio-law-removes-marital-rape-loophole/73442601007/"
  },
  {
    "text": "The Man Who Killed Google Search  —  This is the story of how Google Search died, and the people responsible for killing it.  —  The story begins on February 5th 2019, when Ben Gomes, Google's head of search, had a problem. … For those unfamiliar with Google's internal scientology-esque jargon, let me explain.",
    "url": "https://www.wheresyoured.at/the-men-who-killed-google/"
  }
]