[
  {
    "text": "Elon Musk boosts Pizzagate conspiracy theory that led to D.C. gunfire  —  The far-right theory motivated a gunman to fire multiple rounds inside the Comet Ping Pong pizzeria in Northwest Washington in 2016.  Musk boosted the theory to his 164 million followers anyway.",
    "url": "https://www.washingtonpost.com/technology/2023/11/28/pizzagate-musk-twitter-x-controversy/"
  },
  {
    "text": "Elon Musk has boosted the ‘pizzagate’ conspiracy theory five times in the last two weeks  —  A new iteration of “pizzagate” has focused on unfounded claims that journalists were part of the conspiracy theory.  —  Elon Musk continued to boost a debunked conspiracy theory Tuesday … ",
    "url": "https://www.nbcnews.com/tech/tech-news/elon-musk-boosted-pizzagate-conspiracy-theory-rcna127087"
  },
  {
    "text": "Elon Musk deletes ‘Pizzagate’ meme following widespread backlash  —  Billionaire Elon Musk on Tuesday took down a post from his account on X, the platform formerly known as Twitter, that embraced a years-old false conspiracy theory about child sex trafficking after the tech and media mogul received widespread backlash and mockery.",
    "url": "https://thehill.com/policy/technology/4331790-elon-musk-deletes-pizzagate-meme/"
  },
  {
    "text": "Former Tim Scott adviser is running new pro-DeSantis effort in Iowa  —  A new super PAC is attacking Nikki Haley to help Ron DeSantis in the first caucus state.  —  A top adviser to Sen. Tim Scott's now-defunct presidential campaign is now helming a new super PAC supporting Florida Gov. Ron DeSantis in Iowa.",
    "url": "https://www.politico.com/news/2023/11/28/tim-scott-desantis-iowa-00128962"
  },
  {
    "text": "Melania Trump Adds Awkward Touch to Rosalynn Carter Funeral  —  In recent decades the former presidents and First Ladies have made a big show of their post-White House chumminess.  In 2005, Bill Clinton and George H.W. Bush teamed up to raise money for victims of the Indian Ocean tsunami … ",
    "url": "https://nymag.com/intelligencer/2023/11/melania-trump-rosalynn-carter-funeral.html"
  },
  {
    "text": "Melania Trump and Other Living First Ladies Pay Tribute to Rosalynn Carter  —  Melania Trump and Michelle Obama were seated side by side.  —  In any other circumstance it would have been a shocking sight.  But it was only fitting that in her death Rosalynn Carter, the pioneering woman … ",
    "url": "https://www.nytimes.com/2023/11/28/style/melania-trump-rosalynn-carter-memorial.html"
  },
  {
    "text": "Scoop: Students for Trump Founder charged with aggravated assault  —  The North Carolina-based Students for Trump co-founder Ryan Fournier is facing misdemeanor charges for assault on a female and assault with a deadly weapon, law enforcement records obtained by Axios show.",
    "url": "https://www.axios.com/2023/11/28/students-for-trump-ryan-fournier-arrested-assault"
  },
  {
    "text": "Exclusive: Liz Cheney's new book blasts GOP as ‘enablers and collaborators’ of Trump, whom one member called ‘Orange Jesus’  —  In her new book, former Rep. Liz Cheney paints a scathing portrait of the Republican Party, condemning her former colleagues and party leaders as … ",
    "url": "https://www.cnn.com/2023/11/28/politics/liz-cheney-trump-mccarthy-book/"
  },
  {
    "text": "California struggles to boot Trump  —  THE BUZZ: DEADLINE AHEAD — The window is narrowing to try to knock former President Donald Trump off California's March 5 primary ballot.  —  Democrats launched several long-shot challenges to Trump's ballot status.  But the deadline for Secretary … ",
    "url": "https://www.politico.com/newsletters/california-playbook/2023/11/28/path-narrowing-on-trump-ballot-challenges-00128805"
  },
  {
    "text": "Why Senate Dems are prepared to swallow a border policy compromise  —  In addition to helping embattled US allies, Senate Dems believe changes could help cool border politics in battleground states ahead of 2024.  —  A growing number of Senate Democrats appear open to making it harder … ",
    "url": "https://www.politico.com/news/2023/11/28/senate-dems-asylum-ukraine-money-00128970"
  },
  {
    "text": "Republicans Reject Hunter Biden's Offer to Testify Publicly  —  ‘OPENING THE DOOR’  —  House Oversight Committee Chairman James Comer (R-KY) denied Hunter Biden's request to testify publicly, saying that he wants the president's son to sit down for a closed-door deposition on Dec. 13.",
    "url": "https://www.thedailybeast.com/hunter-biden-agrees-to-testify-before-housebut-only-in-public-hearing"
  },
  {
    "text": "Gusty winds topple National Christmas Tree near the White House  —  The National Christmas tree in D.C. near the White House is once again upright after strong winds toppled it Tuesday afternoon.  —  The tree fell over around 1 p.m. during a strong wind gust, the National Park Service said.",
    "url": "https://wtop.com/dc/2023/11/gusty-winds-topple-national-christmas-tree-near-the-white-house/"
  },
  {
    "text": "Chris Christie says he wouldn't sign 6-week federal abortion ban  —  Former New Jersey Gov. Chris Christie said Tuesday he would not sign a six-week federal abortion ban as president because he does not believe such legislation aligns with the views of the American public.",
    "url": "https://www.cnn.com/2023/11/28/politics/chris-christie-abortion-ban-republicans/"
  },
  {
    "text": "Trump Tries Again to Dismiss Civil Fraud Case After Deutsche Exec Testifies  —  Judge Engoron appeared skeptical Tuesday after the former president's attorneys moved to end the trial after testimony from a high-ranking Deutsche Bank executive  —  Former President Donald Trump's lead attorney … ",
    "url": "https://themessenger.com/politics/trump-motion-dismiss-civil-fraud-trial-deutsche-exec-testifies"
  },
  {
    "text": "First plane using only sustainable fuel flies across Atlantic  —  A Virgin Atlantic plane powered using only sustainable fuel completed its flight from London to New York on Tuesday, highlighting an eco-friendly and low-carbon option for transatlantic flights.",
    "url": "https://thehill.com/policy/energy-environment/4332469-first-plane-using-only-sustainable-fuel-flies-across-atlantic/"
  },
  {
    "text": "Reports Say Pope Francis Is Evicting U.S. Cardinal From His Vatican Home  —  Word of the action against Cardinal Raymond Burke came after the prelate's increasingly pointed critiques of the reform-minded pope.  —  Almost as soon as Pope Francis became the head of the Roman Catholic church in 2013 … ",
    "url": "https://www.nytimes.com/2023/11/28/world/europe/pope-francis-cardinal-burke-vatican.html"
  },
  {
    "text": "A U.S. military plane with eight on board crashes into the sea near Japan  —  A coast guard spokesperson confirmed to NBC News that the plane crashed into the ocean near Yakushima, an island off the Kagoshima region on the southern main island of Kyushu.  —  TOKYO — A U.S. military Osprey aircraft … ",
    "url": "https://www.nbcnews.com/news/world/us-military-plane-crashes-sea-japan-osprey-yakushima-rcna127129"
  },
  {
    "text": "LGBTQ groups sue over Iowa law banning library books and gender identity discussions  —  The lawsuit was filed on behalf of Iowa Safe Schools, an organization that advocates for LGBTQ children, and seven Iowa students and their families.  —  Several families are suing to stop Iowa's new law … ",
    "url": "https://www.nbcnews.com/nbc-out/out-news/lgbtq-groups-sue-iowa-law-banning-library-books-gender-identity-discus-rcna127075"
  },
  {
    "text": "A rural post office was told to prioritize Amazon packages.  Chaos ensued.  —  BEMIDJI, Minn. — When Delbert Mikelson's mail started showing up late — and sometimes not showing up at all — he blamed it on the opening of deer season.  —  “I thought my carrier was out hunting,” … ",
    "url": "https://www.washingtonpost.com/technology/2023/11/28/amazon-missed-mail-rural-towns/"
  }
]