[
  {
    "text": "Trump Seeks, Without Evidence, to Blame D.E.I. and Democrats for the Crash  —  President Trump's remarks, suggesting that diversity in hiring and other Biden administration policies somehow caused the disaster, reflected his instinct to immediately frame major events through his political or ideological lens.",
    "url": "https://www.nytimes.com/2025/01/30/us/politics/trump-plane-crash-dei-faa-diversity.html?unlocked_article_code=1.tE4.Z0ud.JbQhMo4mtVkd"
  },
  {
    "text": "Trump's Plane Crash Response Is as Cheap as You'd Expect  —  THERE ARE PLENTY OF REASONABLE, nuanced, principled criticisms of DEI programs, and we at The Bulwark have made a lot of them.  —  But the attack on diversity, equity, and inclusion (DEI) programs that Donald Trump and JD Vance advanced … ",
    "url": "https://www.thebulwark.com/p/trumps-plane-crash-response-is-as"
  },
  {
    "text": "Trump lashes out at Biden, DEI efforts after D.C. plane crash … President Donald Trump on Thursday blasted former President Joe Biden and Democratic diversity measures after a midair collision between an American Airlines regional jet and an Army Black Hawk helicopter above Washington, D.C., the night before.",
    "url": "https://www.cnbc.com/2025/01/30/trump-lashes-out-at-biden-dei-efforts-after-dc-plane-crash.html"
  },
  {
    "text": "F.C.C. Chair Orders Investigation Into NPR and PBS Stations  —  Brendan Carr, the chairman of the Federal Communications Commission, recently expressed concern about NPR and PBS's sponsorships.  —  Brendan Carr, the chairman of the Federal Communications Commission, informed NPR and PBS … ",
    "url": "https://www.nytimes.com/2025/01/30/business/media/npr-pbs-fcc-investigation.html?unlocked_article_code=1.tE4.njGJ.s2ljEztrWYxy&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Staffing Was ‘Not Normal’ at Reagan Airport Tower, According to F.A.A. Report  —  The report, reviewed by The New York Times, said that one controller was communicating with both helicopters and planes.  Those jobs are typically assigned to two people, not one.",
    "url": "https://www.nytimes.com/2025/01/30/business/air-traffic-control-staffing-plane-crash.html"
  },
  {
    "text": "Breaking Down OPM's ‘Fork in the Road’ Email to Federal Workers  —  Though the subject line borrows a phrase from Musk's Twitter email, the federal government is not a private company, and its HR policies are arcane and legally binding.  —  Meet The Authors",
    "url": "https://www.lawfaremedia.org/article/breaking-down-opm-s--fork-in-the-road--email-to-federal-workers"
  },
  {
    "text": "The conservative ex-FBI agents who have Kash Patel's ear  —  Patel's relationships with the former agents shed light on some of his plans for the FBI if he is confirmed by the Senate to be the bureau's new director.  —  WASHINGTON — When President-elect Donald Trump announced … ",
    "url": "https://www.nbcnews.com/politics/justice-department/conservative-ex-fbi-agents-kash-patels-ear-rcna189611"
  },
  {
    "text": "Trump says US could soon put 25% tariffs on goods from Mexico, Canada  —  U.S. President Donald Trump on Thursday said he would likely decide by the end of the day whether to put a 25% tariff on imports of Mexican and Canadian oil that would take effect on Feb 1.  —  “We may or may not.",
    "url": "https://www.reuters.com/world/americas/trump-says-us-will-place-25-tariffs-goods-mexico-canada-2025-01-30/"
  },
  {
    "text": "Trump's 25% Tariff Vows Send Canada, Mexico FX Tumbling  — US dollar wiped out early losses to trade at day's high  — Canadian dollar and Mexican peso both weaken at least 1%  —  President Donald Trump's renewed pledges to slap 25% tariffs on imports from Canada and Mexico … ",
    "url": "https://www.bloomberg.com/news/articles/2025-01-30/trump-s-25-tariff-vows-send-canada-mexico-currencies-tumbling"
  },
  {
    "text": "White House Stenographers Can't Keep Up With Trump  —  The president has already spoken 81,235 words just last week.  —  SHOP WITH SCOUTED  —  These Heated Chairs Are a Must-Have Cold Plunge Companion  —  HEAT CHECK  —  Athletes, fitness fanatics, and wellness enthusiasts … ",
    "url": "https://www.thedailybeast.com/white-house-stenographers-cant-keep-up-with-trump/"
  },
  {
    "text": "FAA Chief Quit on Jan. 20 After Elon Musk Told Him to Resign  —  The Federal Aviation Administration's leader stepped down on Jan. 20, months after Elon Musk demanded that he quit.The move by Michael Whitaker means the FAA has no Senate-confirmed leader for one of the biggest crises in its history … ",
    "url": "https://www.thedailybeast.com/faa-chief-michael-whitaker-quit-on-jan-20-after-elon-musk-told-him-to-resign/"
  },
  {
    "text": "Trump Administration Orders Agencies to Find More DEI Workers to Ax  —  Government offices have cut dozens of positions and canceled millions of dollars in contracts  —  Trump administration officials are pressing federal agencies to dig deeper to find diversity workers to push out of the government … ",
    "url": "https://www.wsj.com/politics/policy/trump-administration-orders-agencies-to-find-more-dei-workers-to-ax-7b627c36?st=C86Rsx&reflink=desktopwebshare_permalink"
  },
  {
    "text": "In Tense Call, Governors Push Schumer to Fight Harder Against Trump  —  On a call with Senator Chuck Schumer, the minority leader, six Democratic governors pushed him to slow down the confirmation of President Trump's nominees and to do more to block his agenda.",
    "url": "https://www.nytimes.com/2025/01/29/us/politics/chuck-schumer-trump-agenda-cabinet.html?unlocked_article_code=1.tE4.uTbf.cKtvP65o9Anu&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Tulsi Gabbard refuses to call Edward Snowden a “traitor” … “So, was Edward Snowden a traitor?”  — Gabbard would not give a yes or no answer, saying only that she is “committed if confirmed as Director of National Intelligence to join you in making sure that there is no future Snowden-type leak.”",
    "url": "https://www.axios.com/2025/01/30/tulsi-gabbard-edward-snowden-traitor"
  },
  {
    "text": "Sam Bankman-Fried's Parents Explore Seeking Trump Pardon for Son  — They've met with lawyers and other figures in Trump's orbit  — FTX co-founder was sentenced to 25 years for fraud last year  —  The Impact of Trump's DEI Actions The Impact of Trump's DEI Actions The Impact of Trump's DEI Actions",
    "url": "https://www.bloomberg.com/news/articles/2025-01-30/sam-bankman-fried-s-parents-explore-seeking-trump-pardon-for-son"
  },
  {
    "text": "Panama's president ahead of Rubio's visit: ‘I cannot negotiate’ on the canal  —  The visit to Panama will be Rubio's first international trip as President Donald Trump's secretary of State.  —  Panama President José Raúl Mulino has a message for Secretary of State Marco Rubio ahead … ",
    "url": "https://www.politico.com/news/2025/01/30/panama-president-rubio-canal-trump-009037"
  },
  {
    "text": "‘Everything I Say Leaks,’ Zuckerberg Says in Leaked Meeting Audio  —  At an all hands meeting inside Meta Thursday, Mark Zuckerberg did not address Meta's $25 million settlement with Donald Trump that will see the company paying $22 million for the eventual establishment of the Trump Presidential Library.",
    "url": "https://www.404media.co/zuckerberg-says-everything-i-say-leaks-in-leaked-meeting-audio/"
  },
  {
    "text": "Trump Gutted Key Aviation Safety Committee Before D.C. Plane Crash  —  Last week, just days after his inauguration, Donald Trump eliminated the membership of a key committee that handles aviation security.  And on Wednesday night,  a passenger plane collided with a military helicopter in the Washington, D.C., area.",
    "url": "https://newrepublic.com/post/190934/trump-aviation-safety-committee-dc-plane-crash"
  },
  {
    "text": "US ban on gun sales to adults under age 21 is unconstitutional, court rules  —  A decades-old U.S. government ban on federally licensed firearms dealers selling handguns to adults under the age of 21 is unconstitutional, a U.S. appeals court held on Thursday, citing recent U.S. Supreme Court rulings expanding gun rights.",
    "url": "https://www.reuters.com/legal/us-ban-gun-sales-adults-under-age-21-is-unconstitutional-court-rules-2025-01-30/"
  },
  {
    "text": "Former USDA Inspector General Defies Trump Order, Escorted from Her Office  —  Security agents escorted the inspector general of the U.S. Department of Agriculture out of her office on Monday after she refused to comply with her dismissal by the Trump administration, according to Reuters.",
    "url": "https://www.newsweek.com/former-usda-inspector-general-defies-trump-order-escorted-her-office-2023069"
  },
  {
    "text": "Va. Gov. Youngkin says voters asked for Trump disruption as fallout continues  —  Virginia's governor has become a close ally of Trump and defended his plan to freeze federal spending as other officials reeled from changing guidance.  —  RICHMOND — Virginia Gov. Glenn Youngkin (R) … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2025/01/29/virginia-youngkin-trump-spending-freeze/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM4MTI2ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM5NTA5MTk5LCJpYXQiOjE3MzgxMjY4MDAsImp0aSI6ImQwYmQ2M2YwLTQ1OGEtNDhkZC1hODdmLTk1Mzg5OTRhZTMyNiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9kYy1tZC12YS8yMDI1LzAxLzI5L3ZpcmdpbmlhLXlvdW5na2luLXRydW1wLXNwZW5kaW5nLWZyZWV6ZS8ifQ.UX4ikk51vkF1VqUuGk0_ix-M7_MtjixAAP6t9Y8HW4M&itid=gfta"
  },
  {
    "text": "MSU college abruptly cancels Lunar New Year event, citing Trump DEI orders  —  Michigan State University cancelled an annual Lunar New Year celebration following new executive orders targeting diversity, equity and inclusion policies and concerns from students, according to emails obtained by The State News.",
    "url": "https://statenews.com/article/2025/01/msu-college-abruptly-cancels-lunar-new-year-event-citing-trump-orders"
  },
  {
    "text": "Trump Administration Considers Halting Congestion Pricing  —  The New York City tolling program began on Jan. 5 after defying obstacles for decades.  A move to stop it would likely touch off a legal battle between the state and federal government.  —  The Trump administration is considering … ",
    "url": "https://www.nytimes.com/2025/01/30/nyregion/nyc-trump-congestion-pricing.html?unlocked_article_code=1.tE4.p5Cn.mjMA4BYv5brH"
  },
  {
    "text": "Pentagon agency pauses celebrations for Martin Luther King Jr. Day, Black History Month and more  —  WASHINGTON — The Defense Department's intelligence agency has paused observances of Martin Luther King Jr. Day, Pride Month, Holocaust Days of Remembrance and other cultural or historical annual events … ",
    "url": "https://www.stripes.com/theaters/us/2025-01-29/department-of-defense-pauses-cultural-observances-16642776.html"
  }
]