[
  {
    "text": "'I'm not a windmill person': Trump takes the witness stand and doesn't break character  —  In a series of outbursts while testifying, Trump assailed the judge who is overseeing his civil fraud case.  —  NEW YORK — Testimony by former President Donald Trump quickly descended into bitter sniping Monday … ",
    "url": "https://www.politico.com/news/2023/11/06/trump-civil-fraud-trial-00125515"
  },
  {
    "text": "Live updates Donald Trump testifying in New York civil fraud trial  —  Former president Donald Trump took the stand Monday to testify in the civil trial accusing him and his company of committing rampant fraud.  He quickly drew warnings from the trial judge for making political statements … ",
    "url": "https://www.washingtonpost.com/national-security/2023/11/06/trump-testimony-ny-fraud-trial/"
  },
  {
    "text": "3 early takeaways from Trump's testimony  —  Donald Trump's many legal problems led to a historic scene Monday: a former president testifying under oath in his own civil fraud trial in New York.  —  New York Attorney General Letitia James (D) is suing Trump and others, including his two adult sons, seeking $250 million.",
    "url": "https://www.washingtonpost.com/politics/2023/11/06/trump-trial-testimony-takeaways/"
  },
  {
    "text": "Trump doesn't just want to win.  He wants revenge.  —  It can happen here — again.  Our nation survived the first time.  I'm not at all confident about the second.  —  The news brings two stories, separately alarming, together bone-chilling.  “Trump leads in 5 Critical States as Voters Blast Biden … ",
    "url": "https://www.washingtonpost.com/opinions/2023/11/06/trump-revenge-polls-biden/"
  },
  {
    "text": "Trump Indictments Haven't Sunk His Campaign, but a Conviction Might  —  Polls by The New York Times and Siena College show his strength in key swing states, in part because of concerns about President Biden's age.  But a conviction could be the difference in 2024.",
    "url": "https://www.nytimes.com/2023/11/06/us/politics/trump-biden-times-siena-poll.html"
  },
  {
    "text": "If Trump loses fraud case he'll spin it as a personal decision to leave NYC: ex-associate  —  If former President Donald Trump is prohibited from doing business in the state of New York, he will try to play it off as if he's leaving the state due to bad business practices, predicted former Trump Organization executive Barbara Res.",
    "url": "https://www.rawstory.com/trump-organization-future-new-york/"
  },
  {
    "text": "U.S. diplomats slam Israel policy in leaked memo  —  The document offers a window into internal fury at the State Department over President Joe Biden's Middle East policies.  —  State Department staffers offered a blistering critique of the Biden administration's handling of the Israel-Hamas war … ",
    "url": "https://www.politico.com/news/2023/11/06/u-s-diplomats-slam-israel-policy-in-leaked-memo-00125538"
  },
  {
    "text": "Moms for Liberty members call the cops on Florida librarians  —  Two members of Moms for Liberty, a right-wing activist group, have reported several Florida school librarians to law enforcement.  They claimed they had evidence that librarians were distributing “pornography” … ",
    "url": "https://popular.info/p/moms-for-liberty-members-call-the"
  },
  {
    "text": "Behind the Curtain: Biden's race problem  —  President Biden has a growing race problem. … Now this is an alarming, re-election-threatening, full-blown crisis for the White House.  — It's clear from consistent trends across multiple polls that Biden is bleeding support among Hispanic voters … ",
    "url": "https://www.axios.com/2023/11/06/biden-black-hispanic-voters-losing-polls"
  },
  {
    "text": "We have obtained EXCLUSIVE access to the Nashville Covenant shooter's manifesto  —  BREAKING: Nashville Trans Manifesto Leaked “I Hope I Have A High Death Count”; Shooter Specifically Targeted Students With “White Privileges” And Was “Ready to Die”  — Louder with Crowder … ",
    "url": "https://www.louderwithcrowder.com/nashville-shooters-manifesto"
  },
  {
    "text": "Barbarians IN the Gates: When Anne Frank Isn't ‘Diverse’ Enough for Germany  —  This was an interesting story coming out of Germany this weekend.  Apparently a wee little town in the country - and it is small, according to everything I could find - wants to change the 53 year old name of its childcare center in the name of “diversity.”",
    "url": "https://hotair.com/tree-hugging-sister/2023/11/06/barbarians-in-the-gates-when-anne-frank-isnt-diverse-enough-for-germany-n590306"
  },
  {
    "text": "Iran Might Have Miscalculated in Gaza  —  It had an interest in dividing Israel from Arab states.  So far that hasn't happened.  —  Most news and commentary describes the war in Gaza as the latest brutal episode in the conflict between Israelis and Arabs.",
    "url": "https://www.wsj.com/articles/iran-might-have-miscalculated-in-gaza-abraham-accords-arab-allies-70bc087a?mod=followamazon"
  },
  {
    "text": "Senate GOP campaign arm whacks Meijer for entering Michigan Senate race  —  Meijer “isn't viable” in the primary, the NRSC warned in a forceful statement.  —  Former Michigan Rep. Peter Meijer's announcement that he would make a run for the state's Senate seat was met with a less … ",
    "url": "https://www.politico.com/news/2023/11/06/peter-meijer-nrsc-pushback-00125514"
  },
  {
    "text": "A disgraced former Trump official wants to deport Palestinians  —  For just under two years, Ryan Zinke served as Donald Trump's secretary of the interior.  In late 2018, though, he resigned under the weight of more than a dozen federal investigations into his actions.",
    "url": "https://www.washingtonpost.com/politics/2023/11/06/zinke-palestian-deportation-bill/"
  },
  {
    "text": "Marijuana use linked with increased risk of heart attack, heart failure  —  American Heart Association Scientific Sessions 2023, Abstract Poster MDP250 and Abstract Poster MDP249  —  Research Highlights:  — As more people across the U.S. use marijuana for medical and recreational reasons … ",
    "url": "https://newsroom.heart.org/news/marijuana-use-linked-with-increased-risk-of-heart-attack-heart-failure"
  },
  {
    "text": "Netanyahu faces rising anger from within Israel after Hamas attack  —  Jerusalem — Angry protesters paid Israel's Prime Minister Benjamin Netanyahu a home visit over the weekend, chanting, “jail now!”  They were echoing rising cries from across the country for the veteran Israeli leader to step down.",
    "url": "https://www.cbsnews.com/news/israel-hamas-war-netanyahu-faces-rising-domestic-anger/"
  },
  {
    "text": "Cross-Tabs: October 2023 Times/Siena Poll of the 2024 Battlegrounds  —  Donald Trump leads Joe Biden in five of six key battlegrounds polled by The New York Times and Siena College.",
    "url": "https://www.nytimes.com/interactive/2023/11/06/us/elections/times-siena-battlegrounds-registered-voters.html"
  },
  {
    "text": "Indy police arrest ‘terrorist’ for purposely driving her car into what she thought was a Jewish school  —  INDIANAPOLIS — IMPD officers arrested a woman, who they labeled a “terrorist,” after she drove her car into a building that she thought was a Jewish school.",
    "url": "https://fox59.com/news/indy-police-arrest-terrorist-for-purposely-driving-her-car-into-home-used-by-hate-group/"
  },
  {
    "text": "“Apocalypticism”: Polling expert reveals the root of “panic among conservative White Christians”  —  “That core belief explains so much of the extremism and the proclivity toward violence on the political right”  —  This year's American Values Survey, conducted by the Public Religion Research Institute … ",
    "url": "https://www.salon.com/2023/11/06/apocalypticism-polling-expert-reveals-the-root-of-panic-among-conservative-christians/"
  },
  {
    "text": "Peru foreign minister resigns amid criticism of president's U.S. trip  —  Peru's foreign minister resigned on Monday after less than a year, according to a letter seen by Reuters, amid criticism of President Dina Boluarte's trip last week to the United States.",
    "url": "https://www.reuters.com/world/americas/peru-foreign-minister-resigns-amid-criticism-presidents-us-trip-source-2023-11-06/"
  }
]