[
  {
    "text": "Exclusive: Harris leads Trump 44% to 42% in US presidential race, Reuters/Ipsos poll finds  —  Vice President Kamala Harris opened up a marginal two-percentage-point lead over Republican Donald Trump after President Joe Biden ended his re-election campaign and passed the torch to her, a Reuters/Ipsos poll found.",
    "url": "https://www.reuters.com/world/us/harris-leads-trump-44-42-us-presidential-race-reutersipsos-poll-finds-2024-07-23/"
  },
  {
    "text": "Trump Camp Is Planning to ‘Willie Horton’ Kamala Harris  —  DONALD TRUMP'S CAMPAIGN IS PREPARING a full-scale blitz on Vice President Kamala Harris, with broadsides on her record that borrow from the ad that came to define dog-whistle politics.  —  The question is not just whether it will work … ",
    "url": "https://www.thebulwark.com/p/trump-planning-to-willie-horton-kamala"
  },
  {
    "text": "Trump says he is willing to debate Harris multiple times … Former Presiden t Donald Trump on Tuesday said he would be willing to debate Vice President Kamala Harris multiple times if she is nominated, as expected, by the Democratic National Convention as the party's presidential candidate.",
    "url": "https://www.cnbc.com/2024/07/23/trump-says-he-is-willing-to-debate-harris-multiple-times.html"
  },
  {
    "text": "How Trump Set Deadly Election Trap for Himself  —  CHECKMATE  —  Jill Filipovic, CNN columnist and author of OK Boomer Let's Talk, on how Kamala wins. … It's barely been 48 hours since Joe Biden dropped out of the race for the White House, but one thing is clear: Kamala Harris can win.",
    "url": "https://www.thedailybeast.com/how-trump-set-deadly-election-trap-for-himself-against-kamala-harris"
  },
  {
    "text": "Trump Is Suddenly Too Old  —  A month ago Joe Biden, at 81, was fit as a fiddle, sharp as a tack, and able to leap tall buildings at a single bound.  Any dissent about these assertions was mere “ageism,” you bigot!  —  Now that Biden is out of the race, Trump is far too old to be president and should be rejected on that basis alone.",
    "url": "https://hotair.com/david-strom/2024/07/23/trump-is-suddenly-too-old-say-democrats-and-the-msm-n3792160"
  },
  {
    "text": "Bob Menendez to resign Senate seat following federal bribery conviction  —  A storied career in New Jersey politics comes to an end as Menendez bows to calls for him to leave the Senate following his conviction on federal bribery and corruption charges.  —  Sen. Bob Menendez (D-N.J.) … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/23/senator-bob-menendez-resigns-senate/"
  },
  {
    "text": "Secret Service director resigns after Trump shooting fallout  —  Director Kimberly Cheatle revealed her decision in an internal message to Secret Service employees.  —  Secret Service Director Kimberly Cheatle resigned Tuesday over the agency's failure to prevent the assassination attempt … ",
    "url": "https://www.politico.com/news/2024/07/23/secret-service-director-resigns-after-trump-shooting-fallout-00170580"
  },
  {
    "text": "Secret Service Director Kimberly Cheatle resigns over Trump shooting outrage … U.S. Secret Service Director Kimberly Cheatle resigned Tuesday following widespread outrage over how her agency failed to prevent the attempted assassination of former President Donald Trump at a Pennsylvania campaign rally earlier this month.",
    "url": "https://www.cnbc.com/2024/07/23/secret-service-resigns-trump-shooting.html"
  },
  {
    "text": "Harris campaign vetting 7 Dems for VP, including Whitmer, Cooper, Kelly, Shapiro  —  Joey Garrison Phillip M. BaileyUSA TODAY  —  REHOBOTH BEACH, Del. — Vice President Kamala Harris' presidential campaign has requested vetting materials from seven Democrats under consideration … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/07/23/harris-campaign-vetting-vp-list/74510492007/"
  },
  {
    "text": "Sunday was the hottest day ever recorded on Earth, scientists say  —  The historic day comes on the heels of 13 straight months of unprecedented temperatures and the hottest year scientists have ever seen.  —  Global temperatures hit the highest levels in recorded history on Sunday … ",
    "url": "https://www.washingtonpost.com/climate-environment/2024/07/23/hottest-day-ever-recorded-climate-change/"
  },
  {
    "text": "Top Sinclair anchor resigned over concerns about biased and inaccurate content  —  Eugene Ramirez, the lead anchor of Sinclair's national evening news broadcast, resigned in January over concerns about the accuracy and right-wing bias of the content he was required to present on air, three sources told Popular Information.",
    "url": "https://popular.info/p/top-sinclair-anchor-resigned-over"
  },
  {
    "text": "JD Vance repeatedly indicated in 2016 that he believed Donald Trump had committed sexual assault  —  Ohio Sen. JD Vance, the Republican vice presidential nominee, repeatedly indicated in 2016 that he believed Donald Trump had committed sexual assault, even suggesting in one TV segment that in a … ",
    "url": "https://www.cnn.com/2024/07/23/politics/kfile-jd-vance-believed-donald-trump-sexual-assault-allegations-2016/"
  },
  {
    "text": "Harris has the best 48 hours in presidential campaign history, raising $100 million since Sunday  —  “Kamala Harris has had the single best first day of any presidential candidate in history,” MSNBC's O'Donnell said  —  The first 48 hours of Kamala Harris as a U.S. presidential candidate … ",
    "url": "https://www.salon.com/2024/07/23/harris-has-the-best-48-hours-in-presidential-campaign-history-raising-100-million-since-sunday/"
  },
  {
    "text": "Trump's Massive Deportation Plan Echoes Concentration Camp History  —  Trump's language about immigrants “poisoning” the U.S. repeats past rhetoric that led to civilian detention camps, with horrific, tragic results  —  The Republican National Convention hit rock bottom on its third day in Milwaukee … ",
    "url": "https://www.scientificamerican.com/article/trumps-massive-deportation-plan-echoes-concentration-camp-history/"
  },
  {
    "text": "Meeks predicts Black voter turnout could surpass what was seen in 2008  —  Rep. Gregory Meeks (D-N.Y.) on Tuesday said he believes the candidacy of Vice President Harris will drive Black voter excitement to levels higher than what was seen in 2008, when former President Obama first ran.",
    "url": "https://thehill.com/homenews/campaign/4788732-gregory-meeks-kamala-harris-black-voters/"
  },
  {
    "text": "Steve Bannon to go on trial in December for alleged fraud in We Build the Wall fundraiser  —  Bannon was recently jailed on a contempt of Congress conviction.  —  Former White House Chief Strategist Steve Bannon leaves a press conference outside the federal correctional institution, July 1, 2024, in Danbury, Conn.",
    "url": "https://abcnews.go.com/Politics/steve-bannon-trial-december-alleged-fraud-build-wall/story?id=112205929"
  },
  {
    "text": "After key Baptist leader applauds Biden's withdrawal, agency retracts announcement of his firing  —  In under 48 hours, the head of the staunchly conservative public-policy arm of the Southern Baptist Convention rankled fellow Baptists by applauding President Joe Biden's “selfless act” of withdrawing his candidacy for re-election.",
    "url": "https://apnews.com/article/southern-baptists-public-policy-arm-conservative-leadership-6ee78020117041514fc927b5c53db35d"
  },
  {
    "text": "GOP senator falls for sexually explicit Jimmy Carter death hoax  — For the second time in one month, Sen. Mike Lee has fallen for an online hoax.  — The Utah senator posted a fake letter announcing Jimmy Carter's death.  — The letter quoted Carter as calling his wife a “baddie” and the “original Brat.”",
    "url": "https://www.businessinsider.com/mike-lee-jimmy-carter-death-hoax-throat-goat-2024-7"
  },
  {
    "text": "Schumer and Jeffries set to endorse Harris for president  —  Senate Majority Leader Chuck Schumer and House Minority Leader Hakeem Jeffries are poised to endorse Kamala Harris for president at a press conference Tuesday afternoon, three people familiar with the plans told POLITICO.",
    "url": "https://www.politico.com/live-updates/2024/07/23/congress/schumer-jeffries-set-to-endorse-harris-00170605"
  },
  {
    "text": "House GOP leaders urge members: Stop making race comments about Harris  —  Leadership warned lawmakers during a closed-door meeting to focus on the vice president's record, not her race.  —  House Republican leaders told lawmakers to focus on criticizing Vice President Kamala Harris' record without reference … ",
    "url": "https://www.politico.com/news/2024/07/23/gop-race-comments-harris-00170735"
  },
  {
    "text": "Trump's Sons Keep Falsely Blaming Democrats for the Assassination Attempt  —  Eric and Don Jr. are pushing a narrative that threat experts say will fuel violence.  —  Since a 20-year-old gunman opened fire more than a week ago at former President Donald Trump's campaign rally in Butler … ",
    "url": "https://www.motherjones.com/politics/2024/07/trump-assassination-attempt-eric-donald-jr-blame-violence/"
  },
  {
    "text": "Feds discover transcripts of Biden chats with biographer  —  Justice Department relents by contacting former special counsel Robert Hur to respond to records requests.  —  The Justice Department told a federal judge late Monday that it has located transcripts it previously denied having … ",
    "url": "https://www.politico.com/news/2024/07/23/biden-hur-biographer-transcripts-00170548"
  },
  {
    "text": "Major labor unions urge Biden to halt military aid to Israel  —  A group of major labor unions pushed President Biden in a letter Tuesday to stop military aid to Israel as it continues to wage its war on Hama in the Gaza Strip.  —  “We believe that immediately cutting US military aid … ",
    "url": "https://thehill.com/business/4788621-unions-demand-stop-israeli-aid/"
  }
]