[
  {
    "text": "The GOP's legal challenges to Harris's candidacy are bunk  —  They're also amazingly hypocritical. … While Democrats wasted no time this week rallying around Kamala Harris, Republicans were just as quick to start trying to sabotage her campaign with lawfare.  —  It isn't surprising that the GOP is taking this approach.",
    "url": "https://www.publicnotice.co/p/trump-legal-challenges-harris-candidacy-bunk"
  },
  {
    "text": "Beware the Mump  —  Speaking in Charlotte, North Carolina, yesterday, at his first campaign rally since President Biden dropped out of the race and Kamala Harris became the presumptive Democratic candidate, Trump deployed his usual barrage of lies and smears.",
    "url": "https://robertreich.substack.com/p/beware-the-mump-0ee"
  },
  {
    "text": "Exclusive poll: Harris opens up early edge with young voters  —  Vice President Kamala Harris is significantly more popular among America's youngest voters than President Biden, a new Axios/Generation Lab poll shows. … But Harris could be extending the gap once again.",
    "url": "https://www.axios.com/2024/07/25/poll-harris-biden-trump-young-voters"
  },
  {
    "text": "White Voters Heard Here  —  Who's missing from MSNBC's first focus groups?  —  ·  —  ·  —  Just now  —  On MSNBC this morning, I watched Elise Jordan's focus groups from Green Bay, Wisconsin — the first after the nomination of Kamala Harris.",
    "url": "https://medium.com/whither-news/white-voters-heard-here-433f58e2deeb"
  },
  {
    "text": "Obama plans to endorse Harris for president soon  —  The former president has had multiple conversations with Vice President Kamala Harris about her campaign this week.  —  WASHINGTON — Former President Barack Obama and Vice President Kamala Harris have been in close touch since she announced … ",
    "url": "https://www.nbcnews.com/politics/2024-election/obama-plans-endorse-harris-president-soon-rcna163279"
  },
  {
    "text": "‘I Approve This Message’: Kamala Harris Instantly Uses Trump's Own Words Against Him  —  That didn't take long.  —  LOADING  —  Donald Trump's own words on Wednesday were quickly turned back at him in a new video from Vice President Kamala Harris's rapid response team.",
    "url": "https://www.huffpost.com/entry/donald-trump-kamala-harris-ad_n_66a1f26fe4b070e6bd5298e2"
  },
  {
    "text": "Trump and His Allies Adapt to a New Role: Fighting for Attention  —  In the days since President Biden ended his re-election bid and passed the torch to Vice President Kamala Harris, Donald Trump's campaign has been crowded out of the headlines.  —  For the first time since Donald J. Trump … ",
    "url": "https://www.nytimes.com/2024/07/25/us/politics/trump-gop-kamala-harris.html?unlocked_article_code=1.900.QYks.xXwmTfSt6Afk&smid=url-share"
  },
  {
    "text": "‘Lifelong Republican’ ex-GA lieutenant gov. endorses Kamala Harris  —  Former Georgia Lieutenant Governor explained in an op-ed published by the Atlanta Journal-Constitution earlier this year why he was supporting President Joe Biden in his bid for reelection.",
    "url": "https://www.alternet.org/geoff-duncan-kamala-harris/"
  },
  {
    "text": "July 2024 Swing State Polls: Harris Trails Trump in Arizona, Georgia, Michigan, Pennsylvania, Tied in Wisconsin  —  Home Polls July 2024 Swing State Polls: Harris Trails Trump in Arizona, Georgia, Michigan, Pennsylvania, Tied in Wisconsin  —  Majority of Democrats in Swing States Say Harris Should be Nominated at DNC",
    "url": "https://emersoncollegepolling.com/july-2024-swing-state-polls-harris-trails-trump-in-arizona-georgia-michigan-pennsylvania-tied-in-wisconsin/"
  },
  {
    "text": "The US economy is pulling off something historic  —  The US economy is on the verge of an extremely rare achievement.  —  Economic growth in the first half of the year was solid, with the economy expanding a robust 2.8% annualized rate in the second quarter, according to fresh Commerce … ",
    "url": "https://www.cnn.com/2024/07/25/economy/us-economy-gdp-second-quarter/"
  },
  {
    "text": "U.S. economy grew at a 2.8% pace in the second quarter, much more than expected … WATCH NOW  —  Economic activity in the U.S. was considerably stronger than expected during the second quarter, boosted by a strong consumer and a sizeable inventory build, according to an initial estimate Thursday from the Commerce Department.",
    "url": "https://www.cnbc.com/2024/07/25/us-gdp-q2-2024.html"
  },
  {
    "text": "July 24, 2024  —  Tonight, President Joe Biden explained to the American people why he decided to refuse the 2024 Democratic presidential nomination and hand the torch to Vice President Kamala Harris.  —  Speaking from the Oval Office from his seat behind the Resolute Desk … ",
    "url": "https://heathercoxrichardson.substack.com/p/july-24-2024"
  },
  {
    "text": "FBI Is Not Fully Convinced Trump Was Struck by a Bullet  —  LINGERING QUESTIONS  —  “There is some question about whether or not it was a bullet or shrapnel that hit his ear,” FBI Director Christopher Wray said Wednesday.  —  FBI Director Christopher Wray revealed during a marathon testimony … ",
    "url": "https://www.thedailybeast.com/fbi-is-not-fully-convinced-trump-was-struck-by-a-bullet"
  },
  {
    "text": "Posts spread baseless rumors about GOP vice presidential pick JD Vance having sex with a couch  —  CLAIM: Republican vice presidential nominee JD Vance wrote in his 2016 memoir about having sex with a couch.  —  AP'S ASSESSMENT: False.  Vance does not write about performing such an act in his bestselling book.",
    "url": "https://apnews.com/article/fact-check-jd-vance-sex-couch-038130326229"
  },
  {
    "text": "Melania Trump to tell her story in memoir, ‘Melania,’ scheduled for this fall  —  Former first lady Melania Trump has a memoir coming out this fall, “Melania,” billed by her office as “a powerful and inspiring story of a woman who has carved her own path, overcome adversity and defined personal excellence.”",
    "url": "https://apnews.com/article/melania-trump-memoir-first-lady-0461dbb098a2218d41fbe7960c05a1a5"
  },
  {
    "text": "NORAD detects, tracks and intercepts Russian and PRC aircraft operating in the Alaska ADIZ  —  North American Aerospace Defense Command Public Affairs  —  COLORADO SPRINGS, Colo. - NORAD detected, tracked, and intercepted two Russian TU-95 and two PRC H-6 military aircraft operating … ",
    "url": "https://www.norad.mil/Newsroom/Press-Releases/Article/3849184/norad-detects-tracks-and-intercepts-russian-and-prc-aircraft-operating-in-the-a/"
  },
  {
    "text": "The Dramatic Contrast of Biden's Last Act  —  Two political myths inspired the dreams and haunted the nightmares of the Founders of the American republic.  Both these foundational myths were learned from the history and literature of the ancient Romans.  —  Cincinnatus was the name of a man who … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/07/joe-biden-speech-cincinnatus/679229/"
  },
  {
    "text": "An online army rises, this time on Kamala Harris's side  —  A grassroots network of TikTok creators, energized by the new likely Democratic nominee, are using their skill at playful video collages to build Harris a viral political powerhouse from scratch.  —  Jaelyn Richter … ",
    "url": "https://www.washingtonpost.com/technology/2024/07/25/kamala-harris-election-tiktok-fancam/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzIxODgwMDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzIzMjYyMzk5LCJpYXQiOjE3MjE4ODAwMDAsImp0aSI6IjZjNTVhZDY1LWM1N2QtNGVmMy1hYTY4LTg0M2ZlMmZiNTE2ZiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS90ZWNobm9sb2d5LzIwMjQvMDcvMjUva2FtYWxhLWhhcnJpcy1lbGVjdGlvbi10aWt0b2stZmFuY2FtLyJ9.R5vGIy2dpfVGnG87UuI2afuL26MrWSH_inBMRzuRJTQ&itid=gfta"
  },
  {
    "text": "Trump suggested people with disabilities ‘should just die,’ nephew reveals in memoir  —  Fred Trump III writes that his uncle, Donald Trump, made the shocking suggestion during an Oval Office meeting in May 2020  —  Support truly  —  independent journalism",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/trump-nephew-disability-memoir-b2585139.html"
  }
]