[
  {
    "text": "Giuliani Is Liable for Defaming Georgia Election Workers, Judge Says  —  The ruling means that a defamation case against Rudolph W. Giuliani, stemming from his role in seeking to overturn the 2020 election, can proceed to a trial where damages will be set.  —  A federal judge ruled on Wednesday … ",
    "url": "https://www.nytimes.com/2023/08/30/us/politics/giuliani-defamation-georgia.html"
  },
  {
    "text": "Rudy Giuliani is liable for defaming Georgia election workers, judge rules  —  U.S. District Court Judge Beryl Howell ordered Giuliani to pay the two election workers punitive damages.  —  A federal judge ruled Wednesday that Rudy Giuliani is legally liable for defaming two Georgia election workers … ",
    "url": "https://www.politico.com/news/2023/08/30/judge-rules-giuliani-is-liable-for-defaming-georgia-election-workers-orders-sanctions-00113462"
  },
  {
    "text": "Rudy Giuliani liable for defaming Georgia election workers, hit with sanctions by judge  — A federal judge issued a default judgment against former Trump lawyer Rudy Giuliani in a civil conspiracy lawsuit filed by two Georgia election workers.  — Judge Beryl Howell also ordered … ",
    "url": "https://www.cnbc.com/2023/08/30/judge-orders-default-judgment-sanctions-against-rudy-giuliani-in-election-workers-lawsuit.html"
  },
  {
    "text": "Sen. Mitch McConnell appears to freeze again at a Kentucky event  —  The Republican leader was silent for more than 30 seconds after being asked if he will run for re-election.  He previously froze during a July press conference.  —  Senate Minority Leader Mitch McConnell appeared … ",
    "url": "https://www.nbcnews.com/politics/congress/sen-mitch-mcconnell-appears-freeze-kentucky-event-rcna102583"
  },
  {
    "text": "Proud Boy Enrique Tarrio's January 6 sentencing abruptly postponed due to ‘emergency’  —  The sentencing for Enrique Tarrio, the former chair of the Proud Boys, was postponed unexpectedly on Wednesday morning “due to an emergency,” according to the U.S. attorney's office in Washington, D.C.",
    "url": "https://www.washingtonexaminer.com/policy/courts/proud-boy-enrique-tarrior-january-6-sentenced-abruptly-postponed-emergency"
  },
  {
    "text": "Proud Boys leader Enrique Tarrio's sentencing delayed in seditious conspiracy case  —  Washington — Former Proud Boys leader Enrique Tarrio's sentencing hearing has been delayed, due to an emergency, the U.S. attorney's office said in a press release Wednesday morning.",
    "url": "https://www.cbsnews.com/news/proud-boys-leader-enrique-tarrio-sentencing-seditious-conspiracy-case/"
  },
  {
    "text": "How Mark Meadows' Testimony May Have Just Helped Prosecutors  —  Mark Meadows made his surprise appearance in court on Monday, and while what he said may have seemed innocuous, it could be much more damning than anyone thinks.  —  For years now, Mark Meadows has avoided answering questions … ",
    "url": "https://www.thedailybeast.com/how-mark-meadows-testimony-may-have-just-helped-prosecutors"
  },
  {
    "text": "Is Judge Cannon preparing to kneecap Trump's Florida documents case?  —  Spoiler alert: Yes. … Last year, Judge Aileen Cannon tried valiantly to derail the Justice Department's investigation of Donald Trump's retention of classified documents at his Florida country club.",
    "url": "https://www.publicnotice.co/p/judge-aileen-cannon-trump-florida-documents-case"
  },
  {
    "text": "A 6-figure Donald Trump donor is now a No Labels adviser  —  A major Republican donor and one-time financial backer of former President Donald Trump is now a leader in the Florida chapter of No Labels' third-party presidential bid.  —  Allan Keen, a Florida-based real estate developer … ",
    "url": "https://www.politico.com/news/2023/08/30/trump-donor-no-labels-adviser-00113395"
  },
  {
    "text": "Madison County lawmaker David Cole arrested on illegal voting charge  —  Alabama State Rep. David Cole of Madison was arrested Tuesday on a charge of voting at multiple or unauthorized locations.  —  Cole, 52, was booked into the Madison County jail Tuesday afternoon on the charge, which is a Class C felony.",
    "url": "https://www.al.com/news/2023/08/madison-county-lawmaker-arrested-on-illegal-voting-charge.html"
  },
  {
    "text": "Judge rejects former Trump aide Peter Navarro's executive privilege claim, paving way for trial in contempt case  —  U.S. District Court Judge Amit Mehta's ruling means Navarro's trial on charges he snubbed a congressional subpoena can begin next week.  —  A federal court judge in Washington … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/judge-rejects-former-trump-aide-peter-navarros-executive-privilege-cla-rcna102538"
  },
  {
    "text": "Gabon Junta Appoints Army Officer as Transitional President  — General Nguema's appointment comes hours after coup announced  — Deposed president Bongo has been placed under house arrest  —  Soldiers in Gabon appointed the head of the republican guard as the OPEC member state's new leader … ",
    "url": "https://www.bloomberg.com/news/articles/2023-08-30/gabon-junta-appoints-military-officer-as-transitional-president"
  },
  {
    "text": "Department of Labor announces proposal to restore, extend overtime protections for 3.6 million low-paid salaried workers  —  Proposed rule would ensure that more workers receive extra pay for long hours  —  WASHINGTON - The U.S. Department of Labor today announced a notice of proposed rulemaking … ",
    "url": "https://www.dol.gov/newsroom/releases/whd/whd20230830"
  },
  {
    "text": "Not in this backyard  —  THE BUZZ — California lawmakers aren't on board with an effort by Silicon Valley-backed investors to buy up massive amounts of farmland in Solano County and turn it into a new Bay Area city.  —  Over the course of five years, an until-recently opaque group known … ",
    "url": "https://www.politico.com/newsletters/california-playbook/2023/08/30/not-in-this-backyard-00113435"
  },
  {
    "text": "Alexandria Ocasio-Cortez on How She's Changed  —  The congresswoman from New York says she's different from when she first took office.  But she's not ready to call herself an insider.  —  Representative Alexandria Ocasio-Cortez is used to being a lightning rod.",
    "url": "https://www.nytimes.com/2023/08/30/us/politics/aoc-third-term-congress.html"
  },
  {
    "text": "Tennessee House Speaker silences critic, avoids vote on alleged residency fraud  —  On Monday, Tennessee Representative Justin Jones (D) distributed a letter to his colleagues in the Tennessee House announcing his intention to call a vote of no confidence in House Speaker Cameron Sexton (R).",
    "url": "https://popular.info/p/update-tennessee-house-speaker-silences"
  },
  {
    "text": "Joe Manchin and Daughter Pitch $100 Million Project to Boost Centrist Policies  —  West Virginia senator and former Mylan CEO Heather Manchin have held meetings with major donors  —  Sen. Joe Manchin and his daughter Heather Manchin are pitching major political donors on a nascent effort … ",
    "url": "https://www.wsj.com/politics/policy/joe-manchin-and-daughter-pitch-100-million-project-to-boost-centrist-policies-155d19da?mod=followamazon"
  },
  {
    "text": "DeSantis tells Biden: Keep your IRA money  —  The governor is blocking Biden's IRA benefits from Floridians.  There's not much Dems can do about it.  —  President Joe Biden is offering one of his White House challengers hundreds of millions of dollars to spend in his state.",
    "url": "https://www.politico.com/news/2023/08/30/desantis-refuses-biden-climate-ira-money-00113397"
  },
  {
    "text": "Trump Could Clinch the Nomination Before the G.O.P. Knows if He's a Felon  —  The federal election interference case — one of four — is set to start just before Super Tuesday and a cascade of consequential primaries.  —  By the time Donald J. Trump is sitting at his federal trial on charges … ",
    "url": "https://www.nytimes.com/2023/08/30/us/politics/trump-gop-calendar.html"
  },
  {
    "text": "US Health Officials Urge Moving Pot to Lower-Risk Category  — Change would remove drug from most restricted designation  — Cannabis industry stocks respond with double-digit jumps",
    "url": "https://www.bloomberg.com/news/articles/2023-08-30/hhs-calls-for-moving-marijuana-to-lower-risk-us-drug-category"
  }
]