[
  {
    "text": "Transition Live Updates: House Approves Stopgap Funding Bill Hours Ahead of Shutdown Deadline  —  The new legislation would keep the government open but did not include the debt ceiling increase that President-elect Donald J. Trump had demanded.  It now goes to the Senate.  —  Here are the latest developments.",
    "url": "https://www.nytimes.com/live/2024/12/20/us/government-shutdown-trump-news"
  },
  {
    "text": "House Republicans just exposed the limits of Trump's power  —  Support independent journalism that matters — become a Vox Member today.  —  This week's installment of the long-running saga, “House Republicans cannot govern,” will soon be forgotten.  Elon Musk's decision to blow … ",
    "url": "https://www.vox.com/politics/392278/government-shutdown-fight-spending-bill-trump-musk-house-republicans"
  },
  {
    "text": "House passes bill to avert government shutdown after whirlwind funding fight  —  The House approved legislation to avert a government shutdown hours before the deadline Friday, sending the bill to the Senate for consideration after a whirlwind week on Capitol Hill.",
    "url": "https://thehill.com/homenews/house/5051634-government-funding-shutdown-house-bill/"
  },
  {
    "text": "8 policies stripped from GOP bill after Trump, Musk rebellion  —  Research for children's health, a crackdown on junk fees, pay hikes for lawmakers and more were jettisoned from the legislation.  —  The House of Representatives approved legislation Friday to keep the government funded … ",
    "url": "https://www.washingtonpost.com/business/2024/12/20/musk-trump-children-health-debt/"
  },
  {
    "text": "House passes 11th-hour bill to avert government shutdown … - The vote was 366-34.  — The measure also includes a one-year Farm Bill extension and over $100 billion in disaster relief for hurricane-ravaged areas. … - The House failed to pass a bill Thursday that would have also included … ",
    "url": "https://www.axios.com/2024/12/20/house-passes-government-shutdown"
  },
  {
    "text": "Mike Johnson's magic debt ceiling promise … - Don't ask about Plan C: It lived a short, unhappy life, mostly confined to X.  — Johnson's Plan D survived because Republicans pretended the debt ceiling was in the agreement and Democrats know that it's not.",
    "url": "https://www.axios.com/2024/12/20/mike-johnson-debt-ceiling-promise-trump"
  },
  {
    "text": "House GOP picks new funding plan that will need wide Democratic support  —  House Republicans have landed on their fourth plan to fund the government: Relying on Democrats to pass a bill that doesn't include a debt limit measure pushed by Donald Trump.  House Republicans voted … ",
    "url": "https://www.politico.com/live-updates/2024/12/20/congress/house-gop-moves-forward-on-new-funding-plan-00195660"
  },
  {
    "text": "Musk helped kill a congressional spending bill.  But much of what he spread was misinformation  —  President-elect Donald Trump's billionaire ally Elon Musk played a key role this week in killing a bipartisan funding proposal that would have prevented a government shutdown … ",
    "url": "https://apnews.com/article/elon-musk-misinformation-government-shutdown-bill-budget-trump-musk-1235b15b425856bf902d0c8133eec222"
  },
  {
    "text": "Senate confirms Biden's 235th judge, beating Trump's record  —  It's an important milestone for Joe Biden as he tops his predecessor Donald Trump's total number of judicial nominees confirmed before handing the White House back over to him.  —  WASHINGTON — The Democratic-led Senate confirmed … ",
    "url": "https://www.nbcnews.com/politics/joe-biden/senate-confirms-bidens-235th-judge-beating-trumps-record-rcna182832"
  },
  {
    "text": "Senate approves 235th judge of Biden's term, beating Trump's tally  —  President Joe Biden secured the 235th judicial confirmation of his presidency Friday, an accomplishment that exceeds his predecessor's total by one after Democrats put extra emphasis on the federal courts following Donald … ",
    "url": "https://apnews.com/article/biden-235-judges-trump-courts-db2ac97d2852f0be212c05b8e674b1c0"
  },
  {
    "text": "Senate confirms 2 Biden judicial nominees, boosting total over Trump  —  President Joe Biden's diverse cohort of judges includes more women, people of color and LGBTQ+ individuals than any other U.S. president.  —  The Senate on Friday confirmed President Joe Biden's last two judicial nominees … ",
    "url": "https://www.washingtonpost.com/politics/2024/12/20/biden-judges-trump-record/"
  },
  {
    "text": "Elon Musk Applauds the German Neo-Nazi Party  —  After rallying behind Trump, the tech billionaire supports AfD and other anti-immigration parties.  —  Elon Musk appears to be leaning even further into a full neo-Nazi embrace.  Following his social media assault to block … ",
    "url": "https://www.motherjones.com/politics/2024/12/elon-musk-applauds-the-german-neo-nazi-party/"
  },
  {
    "text": "Biden Weighs Commuting Sentences of Death Row Inmates  —  Amid pleas from religious and civil-rights groups, president is considering whether to convert death sentences to life without parole  —  WASHINGTON—President Biden is considering commuting the sentences of most, if not all … ",
    "url": "https://www.wsj.com/us-news/law/biden-weighs-commuting-sentences-of-death-row-inmates-d24fcc15?st=8q8Jmn"
  },
  {
    "text": "2 dead, many injured after man drives into German Christmas market in suspected terror attack: report  —  A festive Christmas market in Eastern Germany erupted into chaos after a car was driven into a group of people in the city of Magdeburg on Friday in a suspected terrorist attack.",
    "url": "https://www.foxnews.com/world/car-drives-idyllic-germany-christmas-market-suspected-terrorist-attack-report"
  },
  {
    "text": "Party City is going out of business  —  New York CNN  —  Party City is closing down all of its stores, ending nearly 40 years in business, CNN has learned.  —  CEO Barry Litwin told corporate employees Friday in a meeting viewed by CNN that Party City is “winding down” … ",
    "url": "https://www.cnn.com/2024/12/20/business/party-city-shut-down"
  },
  {
    "text": "Trump Moves to Replace Officials Whom New Presidents Traditionally Leave Alone  —  Congress devised some positions to stay on during changes in administrations.  But Donald Trump has declared his intent to replace at least three.  —  President-elect Donald J. Trump has moved to install loyalists … ",
    "url": "https://www.nytimes.com/2024/12/20/us/politics/trump-replace-officials.html?unlocked_article_code=1.i04.Xqz6.wQmpGmGOt-qI"
  },
  {
    "text": "‘It Will Be a More Robust Check on Trump Than the G.O.P. Congress’: Three Legal Experts on Trump 2.0  —  Kate Shaw, a contributing Opinion writer, hosted a written online conversation with Times Opinion columnist David French and Jack Goldsmith, a law professor at Harvard and a co-author of … ",
    "url": "https://www.nytimes.com/2024/12/20/opinion/trump-supreme-court-second-term.html"
  },
  {
    "text": "Republicans Are Plotting $2.5 Trillion in Spending Cuts.  Yes, Including Entitlements.  —  The problem: No one seems to know how they'll do this.  — Copy  —  House Republicans have a new plan for their agenda next year — one that might even satisfy tech billionaire Elon Musk.",
    "url": "https://www.notus.org/republicans-spending-cuts-entitlements-debt-ceiling-deal"
  },
  {
    "text": "Alabama profits off prisoners who work at McDonald's but deems them too dangerous for parole  —  A storm was looming when the inmate serving 20 years for armed robbery was assigned to transport fellow prisoners to their jobs at private manufacturers supplying goods to companies like Home Depot and Wayfair.",
    "url": "https://apnews.com/article/prison-to-plate-inmate-labor-investigation-alabama-3b2c7e414c681ba545dc1d0ad30bfaf5"
  },
  {
    "text": "Sentencing closes chapter for Oath Keeper seeking redemption after Jan. 6  —  Joshua James pleaded guilty to seditious conspiracy but later became a crucial cooperator for prosecutors.  —  Joshua James earned his Purple Heart in 2007, when an IED tore through a bridge he was crossing in Baghdad … ",
    "url": "https://www.politico.com/news/2024/12/20/oath-keeper-sentencing-jan-6-00195780"
  },
  {
    "text": "Bannon: Kash Patel Will Absolutely Investigate the People Named in His Book  —  DONALD TRUMP'S NOMINEE FOR FBI DIRECTOR, Kash Patel, is dead serious when it comes to investigating the political enemies who he listed in his book Government Gangsters, according to Trump's on-again-off-again adviser Steve Bannon.",
    "url": "https://www.thebulwark.com/p/bannon-kash-patel-will-absolutely"
  }
]