[
  {
    "text": "The reality of being a criminal defendant on trial finally dawned on Trump.  He didn't take it well.  —  Donald Trump will spend most of this spring in a drab county courtroom, and he's not happy about it.  —  Donald Trump is learning a hard lesson: Criminal defendants don't get to set their own schedules.",
    "url": "https://www.politico.com/news/2024/04/16/trump-trial-reality-criminal-defendant-00152421"
  },
  {
    "text": "Why Trump's Trial is a Big Political Problem  —  Pundits are underestimating the potential impact of a candidate getting  —  Not to sound overdramatic, but yesterday is a day that will go down in political history.  For the first time, a former President is the defendant in a criminal trial … ",
    "url": "https://www.messageboxnews.com/p/why-trumps-trial-is-a-big-political"
  },
  {
    "text": "Verified pro-Nazi X accounts flourish under Elon Musk  —  An NBC News review identified 150 verified “Premium” accounts that have posted or amplified pro-Nazi content.  —  Elon Musk's X is a thriving hub for Nazi support and propaganda, with paid subscribers sharing speeches by Adolf Hitler or content praising his genocidal regime.",
    "url": "https://www.nbcnews.com/tech/social-media/x-twitter-elon-musk-nazi-extremist-white-nationalist-accounts-rcna145020"
  },
  {
    "text": "Justices to Hear Obstruction Case That Could Bar Charges Against Trump  —  The question for the Supreme Court is whether a 2002 law prompted by white-collar fraud applies to the obstruction of the congressional proceeding on Jan. 6, 2021.  —  The Supreme Court will hear arguments on Tuesday … ",
    "url": "https://www.nytimes.com/2024/04/16/us/supreme-court-jan-6-trump.html"
  },
  {
    "text": "Supreme Court takes its deepest plunge into Jan. 6, with possible implications for Trump  —  The Supreme Court is expected to grapple Tuesday in detail for the first time with the chaos and violence of the Jan. 6, 2021, riot at the Capitol when it hears arguments in a case that could upend hundreds … ",
    "url": "https://www.politico.com/news/2024/04/16/supreme-court-obstruction-jan-6-00152406"
  },
  {
    "text": "Who pays on Tax Day  —  Yesterday was the last day for Americans to file their 2023 taxes on time.  What is the biggest difference between Tax Day this year and Tax Day in 1980?  Millionaires pay a lot less.  —  Between 1945 and 1980, American households that made $1 million or more paid … ",
    "url": "https://popular.info/p/who-pays-on-tax-day"
  },
  {
    "text": "Johnson gambles on plan separating Israel aid from Ukraine funds  —  Marjorie Taylor Greene called the decision to put four different foreign aid bills on the floor a ‘scam,’ but it's unclear whether she will try to oust Johnson for it  —  After months of inaction, House Speaker Mike Johnson unveiled … ",
    "url": "https://www.washingtonpost.com/politics/2024/04/15/mike-johnson-israel-ukraine-aid-house-republicans/"
  },
  {
    "text": "Number of homicides plummets in major U.S. cities … - Polls show crime is a top concern ahead of the 2024 election — and it's an issue where Republicans regularly edge Democrats. … - At this pace, the murder rate in the U.S. could match its level in 2014 when many cities saw 30-year lows in violent crime and homicides.",
    "url": "https://www.axios.com/2024/04/16/homicide-rate-us-voters-trump"
  },
  {
    "text": "With Trump in court, Biden begins campaign blitz in highly contested Pennsylvania  —  WASHINGTON ― While Donald Trump remains in a New York courtroom, President Joe Biden is taking his campaign to Pennsylvania, the biggest battleground of the 2024 election, to hammer the former president … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/04/16/biden-campaign-blitz-pennsylvania-during-trump-trial/73331214007/"
  },
  {
    "text": "US Supreme Court lets Idaho enforce ban on transgender care for minors  —  The conservative-majority U.S. Supreme Court on Monday let a Republican-backed law in Idaho that criminalizes gender-affirming care for transgender minors broadly take effect after a federal judge blocked it as unconstitutional.",
    "url": "https://www.reuters.com/legal/us-supreme-court-lets-idaho-enforce-ban-transgender-care-minors-2024-04-15/"
  },
  {
    "text": "A tax mystery: Why are fewer people getting refunds?  —  The number of people who owe the government has also been rising.  —  If it seems like you're not getting a tax refund like you used to, you're not alone.  —  The share of taxpayers who get money back at tax time is slowly and, a little mysteriously, shrinking.",
    "url": "https://www.politico.com/news/2024/04/15/tax-fewer-people-getting-refunds-00152248"
  },
  {
    "text": "Why Biden Has a Narrower Path to the Presidency Than Trump, in 11 Maps  —  While polls show the race for president is tightening, Joe Biden still has a narrower and more challenging path to winning the election than Donald Trump.  The reason is the Electoral College: My analysis of voter history … ",
    "url": "https://www.nytimes.com/interactive/2024/04/16/opinion/electoral-map-outlook.html"
  },
  {
    "text": "Air Defense of Israel Made Possible by the Abraham Accords  —  I have said it before, and I will say it again: in a just world, Donald Trump would have gotten the Nobel Prize for the Abraham Accords.  —  Unfortunately, we live in a world where Barack Obama got it for merely existing and knowing … ",
    "url": "https://hotair.com/david-strom/2024/04/16/air-defense-of-israel-made-possible-by-the-abraham-accords-n3786567"
  },
  {
    "text": "Powerful conservative funds hand out millions to pro-Trump far-right groups  —  Groups led by Stephen Miller and Charlie Kirk among recipients of large sums from Bradley Foundation and Bradley Impact Fund  —  Two powerful conservative non-profits have donated millions of dollars to a number … ",
    "url": "https://www.theguardian.com/us-news/2024/apr/16/trump-rightwing-groups-funds"
  },
  {
    "text": "Audit cites potential legal violations in purchase of $19,000 lectern for Arkansas governor  —  LITTLE ROCK, Ark. (AP) — Arkansas Gov. Sarah Huckabee Sanders' office potentially violated state laws on purchasing, state property and government records when it purchased a $19,000 lectern … ",
    "url": "https://apnews.com/article/arkansas-huckabee-sanders-lectern-audit-19000-eb69927a5df693ac3e131b3c80f34b37"
  },
  {
    "text": "Maine joins effort to elect president by popular vote with new law  —  Maine will become the latest state to join an interstate effort to elect the nation's president by a popular vote, Gov. Janet Mills (D) announced Monday.  —  Mills said she will allow the legislation to become law without her signature … ",
    "url": "https://thehill.com/homenews/state-watch/4596054-maine-joins-effort-to-elect-president-by-popular-vote-with-new-law/"
  },
  {
    "text": "Sydney mall attack: Confronting pro-Kremlin troll on false claims Jewish student was killer  —  Simeon Boikov, known as Aussie Cossack online, fled to the Russian consulate in Sydney last year  —  “I never falsely suggested anything,” Simeon Boikov tells me.",
    "url": "https://www.bbc.com/news/world-australia-68822846"
  },
  {
    "text": "Democrats seek to seize control of deadlocked Michigan House in special elections  —  Democratic lawmakers are hoping to win back a majority in the deadlocked Michigan House and regain control of the state government in two special elections on Tuesday.  Democrat Mai Xiong is taking … ",
    "url": "https://apnews.com/article/michigan-election-majority-democrats-house-deadlocked-77f6261041701e9839c9ce2069d7c24b"
  },
  {
    "text": "Iran attack widens rift between activist left and Dem moderates  —  The latest flashpoint in the Israel-Gaza war shows both sides calcifying their stances.  —  Moments after Iran launched an attack on Israel, around 400 pro-Palestinian protesters in Chicago broke out in chants of “Hands off Iran!”",
    "url": "https://www.politico.com/news/2024/04/16/iran-israel-palestine-demcorats-rift-00152349"
  }
]