[
  {
    "text": "Former First Lady Rosalynn Carter Passes Away at Age 96  —  Former First Lady Rosalynn Carter, a passionate champion of mental health, caregiving, and women's rights, passed away Sunday, Nov. 19, at 2:10 p.m. at her home in Plains, Georgia, at the age of 96.  She died peacefully, with family by her side.",
    "url": "https://www.cartercenter.org/news/pr/2023/statement-rosalynn-carter-111923.html"
  },
  {
    "text": "Vulgarities, insults, baseless attacks: Trump backers follow his lead  —  Many GOP voters are not just tolerating, but relishing and emulating Trump's often crass and cruel approach to politics  —  DES MOINES — Donald Trump was conspicuously absent at a conservative Christian forum here … ",
    "url": "https://www.washingtonpost.com/elections/2023/11/19/donald-trump-insults-vulgarities-republicans/"
  },
  {
    "text": "Trump-like libertarian Javier Milei wins Argentina's presidency  —  BUENOS AIRES — A radical libertarian and admirer of Donald Trump rode a wave of voter rage to win Argentina's presidency on Sunday, crushing the political establishment and bringing the sharpest turn to the right in four decades of democracy in the country.",
    "url": "https://www.washingtonpost.com/world/2023/11/19/argentina-presidential-election-results-javier-milei/"
  },
  {
    "text": "Antisemitism was rising online.  Then Elon Musk's X supercharged it.  —  The Israel-Gaza war has raised tensions over what had already been a growing presence on the web.  —  In the weeks following the Oct. 7 Hamas attack on Israel, Twitter user @breakingbaht criticized leftists, academics and … ",
    "url": "https://www.washingtonpost.com/technology/2023/11/19/antisemiticism-interent-elon-musk-israwl-war/"
  },
  {
    "text": "GOP moves to split Arizona Democrats in 3-way Senate race  —  A new NRSC ad boosts independent Kyrsten Sinema while slamming likely Democratic nominee Ruben Gallego.  —  Senate Republicans are rolling out a provocative new strategy as they try to boost the GOP's chances in Arizona next year: propping up incumbent Sen. Kyrsten Sinema.",
    "url": "https://www.politico.com/news/2023/11/20/arizona-democrats-3-way-senate-race-nrsc-00128018"
  },
  {
    "text": "With a new speaker, the old MTG is back  —  Good morning, Early Birds.  This morning, we're thinking of former president Jimmy Carter, who lost his wife, former first lady Rosalynn Carter, on Sunday.  Tips: earlytips@washpost.com.  Was this forwarded to you?  Sign up here.  Thanks for waking up with us.",
    "url": "https://www.washingtonpost.com/politics/2023/11/20/with-new-speaker-old-mtg-is-back/"
  },
  {
    "text": "Wages are rising.  Jobs are plentiful.  Nobody's happy.  —  It's a good time to be a worker and a bad time to be a consumer — the problem is most people are both.  —  Explaining the state of the American economy at the moment is a conundrum.  The labor market is good … ",
    "url": "https://www.vox.com/2023/11/20/23964535/labor-market-employment-inflation-sentiment-economy-bad-polls"
  },
  {
    "text": "Scoop: Former Biden official Ron Klain to join Airbnb as chief legal officer  —  Airbnb will announce Monday that Ron Klain — former White House chief of staff, and one of Washington's best-connected Democrats — will join the company as chief legal officer on Jan. 1.",
    "url": "https://www.axios.com/2023/11/20/ron-klain-biden-airbnb-chief-legal-officer"
  },
  {
    "text": "Senate Dems stake their 2024 hopes on last 2 red-state incumbents  —  Montana's Jon Tester and Ohio's Sherrod Brown will need to defy their states' ideological leanings by winning over a sizable number of ticket-splitters next fall.  —  Democrats' hopes of clinging to the Senate next fall … ",
    "url": "https://www.politico.com/news/2023/11/20/tester-brown-senate-red-state-democrats-00127814"
  },
  {
    "text": "Biden turns 81 as questions about age continue to dominate 2024 race  —  Polls show voters continue to be concerned by Biden's age.  —  President Joe Biden smiles as he walks from Marine One upon arrival on the South Lawn of the White House, June 1, 2023, in Washington.",
    "url": "https://abcnews.go.com/Politics/biden-turns-81-questions-age-continue-dominate-2024/story?id=104984287"
  },
  {
    "text": "This Republican Wants Voters to Have a Say on Abortion  —  Republicans have struggled politically with the issue of abortion since the overturning of Roe v. Wade — a point proven several times over with anti-abortion measures failing in relatively conservative states.",
    "url": "https://www.nytimes.com/2023/11/20/opinion/sandy-senn-south-carolina-abortion-bans.html"
  },
  {
    "text": "Judge Aileen Cannon's Games in Florida May Delay Other Trump Trials  —  The federal judge overseeing Donald Trump's classified documents case is setting up some serious roadblocks in the case, and injecting confusion in his other upcoming trials too.  —  When Donald Trump's beloved federal … ",
    "url": "https://www.thedailybeast.com/judge-aileen-cannons-games-in-florida-may-delay-other-trump-trials"
  },
  {
    "text": "Austin Visits Kyiv to Signal US Support as Battles Rage  — Austin says message is US continues to stand with Ukraine  — Ukraine says army repelled Russian attacks in several areas  —  Lloyd Austin, the US defense secretary, arrived in Kyiv for talks on a mission … ",
    "url": "https://www.bloomberg.com/news/articles/2023-11-20/zelenskiy-ousts-army-medical-chief-as-battles-rage-on-frontline"
  },
  {
    "text": "The Super Rich No Longer Try To Support Their Societies  —  Throughout much of the Western world's history, the wealthiest have been viewed in their communities as a potentially unfavorable presence, and they have attempted to allay this sentiment by using their riches to support their societies … ",
    "url": "https://www.nytimes.com/2023/11/19/opinion/rich-billionaires-philanthropy-covid.html"
  }
]