[
  {
    "text": "Liz Cheney Nukes the Supreme Court Over Trump Delay—and Hands Dems a Weapon … In the wake of the Supreme Court agreeing to hear Donald Trump's demand for absolute immunity from prosecution—potentially delaying his insurrection-related trial until after the election—Democrats … ",
    "url": "https://newrepublic.com/article/179438/liz-cheney-supreme-court-trump-trial-delay-dems-weapon"
  },
  {
    "text": "‘Visible cringe’: Serviceman scowls amid Trump rant on 'people who don't speak languages'  —  A serviceman standing behind Donald Trump at a border town press conference Thursday was seen scowling as the former president ranted against “people who don't speak languages.”",
    "url": "https://www.rawstory.com/trump-s-language/"
  },
  {
    "text": "Nikki Haley calls for all Trump legal cases to be ‘dealt with’ before November  —  The Republican presidential candidate's comments came in an interview with NBC News' “Meet the Press” moderator Kristen Welker in Virginia.  —  Republican presidential candidate Nikki Haley … ",
    "url": "https://www.nbcnews.com/politics/2024-election/nikki-haley-calls-trump-legal-cases-dealt-november-rcna141276"
  },
  {
    "text": "Trump's Team ‘Literally Popping Champagne’ Over Supreme Court Taking Up Immunity Claim  —  The former president is now highly unlikely to stand trial in the Justice Department's election interference case before November  —  The Supreme Court handed Donald Trump a massive victory on Wednesday … ",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-team-celebrating-supreme-court-immunity-decision-1234978336/"
  },
  {
    "text": "Thoughts on the Supreme Court's Massive Gift to Trump  —  Delaying the January 6th trial means Trump may never face accountability for his crimes  —  Thanks to the shenanigans of Mitch McConnell, Donald Trump appointed three justices to the Supreme Court.  Yesterday, the MAGA justices thanked Trump … ",
    "url": "https://www.messageboxnews.com/p/thoughts-on-the-supreme-courts-massive"
  },
  {
    "text": "“Join me,” Biden tells Trump … - “Instead of telling members of Congress to block this legislation, join me,” Biden said in Brownsville, Texas.  — Biden prodded House Republicans to “show a little spine” and take up the Senate border deal they helped torpedo earlier this year.",
    "url": "https://www.axios.com/2024/03/01/biden-trump-border-immigration-migrant-crisis"
  },
  {
    "text": "Mitch McConnell: Some Thoughts on Mastery, Destruction and Minority Rule  —  Mitch McConnell is one of those perhaps historic figures for whom the greatness of his skill and impact are matched only in inverse by the malignity of his impact on our politics.  To put it more brashly, McConnell was great at doing political evil.",
    "url": "https://talkingpointsmemo.com/edblog/mitch-mcconnell-some-thoughts-on-mastery-destruction-and-minority-rule/sharetoken/HKlwxw9i77vE"
  },
  {
    "text": "Journalist Catherine Herridge held in contempt for not revealing source  —  The veteran correspondent for CBS and Fox News was ordered to pay $800 a day in a case that had triggered alarm for press advocates  —  In a case that has worried press advocates, veteran journalist Catherine Herridge … ",
    "url": "https://www.washingtonpost.com/style/media/2024/02/29/catherine-herridge-held-contempt-cbs-fox-journalist/"
  },
  {
    "text": "Arizona Senate Passes Bill Preventing Presidents From Ballot Removal Under 14th Amendment  —  WASHINGTON, D.C. — As states eagerly await the U.S. Supreme Court's ruling on if former President Donald Trump should be allowed on the ballot for supporting an insurrection, Arizona Republicans took … ",
    "url": "https://www.democracydocket.com/news-alerts/arizona-senate-passes-bill-preventing-presidents-from-ballot-removal-under-14th-amendment/"
  },
  {
    "text": "Fox News' “migrant crime” hysteria is a sign of GOP weakness  —  When you've got nothing else, run on hate. … The Republican Party wanted to run a 2024 election campaign on inflation and the economy.  That made some sense in June 2022, when inflation was at a 40-year high of 9.1 percent.",
    "url": "https://www.publicnotice.co/p/fox-news-migrant-crime-hysteria-trump-explained"
  },
  {
    "text": "GOP's post-Roe peril spreads like wildfire  —  Republicans are trapped in a political minefield over reproductive rights, paralyzed in fear that their vulnerabilities on abortion and in-vitro fertilization (IVF) could hand Democrats the 2024 election.",
    "url": "https://www.axios.com/2024/03/01/republicans-reproductive-rights-2024-election"
  },
  {
    "text": "Arizona's new voting laws that require proof of citizenship are not discriminatory, a US judge rules  —  A federal judge is upholding provisions of new Arizona laws that would require counties to verify the status of registered voters who haven't provided proof of U.S. citizenship … ",
    "url": "https://apnews.com/article/arizona-voting-laws-citizenship-proof-50dafd68f8dd4af5cf669afa62efdf19"
  },
  {
    "text": "Hunter Biden gives House Republicans the rebuttal they didn't want  —  Hunter Biden's appearance in front of investigators and members of the House Oversight and Judiciary Committees unfolded a bit like a Bruce Lee movie.  —  Republican legislators and interviewers challenging the president's son … ",
    "url": "https://www.washingtonpost.com/politics/2024/02/29/hunter-biden-transcript-impeachment-inquiry/"
  },
  {
    "text": "F.B.I. Searches Houses Owned by Adams's Asian Affairs Adviser  —  Federal agents descended on at least two properties owned by the adviser, Winnie Greco, who was a prominent fund-raiser for Mayor Eric Adams's campaign.  —  F.B.I. agents on Thursday searched two houses owned by a close aide … ",
    "url": "https://www.nytimes.com/2024/02/29/nyregion/fbi-adams-greco-investigation-nyc.html"
  },
  {
    "text": "How Biden aides are trying to shield the president from protests  —  The president's team has deployed tactics like hosting smaller events and withholding their precise locations from the media and the public to minimize disruptions.  —  WASHINGTON — President Joe Biden's team … ",
    "url": "https://www.nbcnews.com/politics/joe-biden/biden-aides-shield-president-pro-palestinian-protests-rcna141251"
  },
  {
    "text": "Senate passes spending bill, punting shutdown threat to next week  —  The Senate on Thursday passed a short-term spending bill that punts this weekend's shutdown threat to later in the month, but leaves questions about how Congress will fund the government through the rest of the year.",
    "url": "https://thehill.com/homenews/senate/4498962-senate-passes-spending-bill-punting-shutdown-threat-to-next-week/"
  },
  {
    "text": "Brian Mulroney, Who Led Canada Into Accords With US, Dies at 84  — Warm ties with US leaders helped bring about NAFTA agreement  — Domestic legacy overshadowed by failed constitutional reform  —  Brian Mulroney, the former Canadian prime minister who oversaw the treaty that tore … ",
    "url": "https://www.bloomberg.com/news/articles/2024-03-01/brian-mulroney-who-led-canada-into-accords-with-us-dies-at-84"
  }
]