[
  {
    "text": "Ron DeSantis ends presidential campaign, endorses Trump  —  Florida Gov. Ron DeSantis is ending his once-promising presidential campaign, which steadily deflated as he struggled to connect with voters and convince Republicans to swap Donald Trump for a younger, more disciplined champion of his ideas.",
    "url": "https://www.washingtonpost.com/politics/2024/01/21/ron-desantis-drops-out/"
  },
  {
    "text": "CNN Poll: Trump's lead over Haley widens to double digits in New Hampshire  —  The race for the New Hampshire Republican presidential primary appears to be former President Donald Trump's to lose, according to a new CNN poll conducted by the University of New Hampshire following Trump's 30-point win in Iowa's caucuses last week.",
    "url": "https://www.cnn.com/2024/01/21/politics/new-hampshire-primary-poll-trump-haley-desantis/"
  },
  {
    "text": "Ron DeSantis is planning to drop his presidential bid Sunday  —  The move comes two days before the primary in the state, where he was projected to fall behind both former President Donald Trump and former U.N. Ambassador Nikki Haley.  —  MANCHESTER, N.H. — Florida Gov. Ron DeSantis … ",
    "url": "https://www.nbcnews.com/politics/2024-election/ron-desantis-planning-drop-presidential-bid-sunday-rcna134953"
  },
  {
    "text": "'We don't have a clear path to victory': DeSantis exits presidential race  —  The Florida governor also endorsed Trump.  —  TALLAHASSEE, Florida — Gov. Ron DeSantis ended his turbulent campaign Sunday after he was unable to convince Republicans to set aside their allegiance to the man who helped his own political career.",
    "url": "https://www.politico.com/news/2024/01/21/desantis-ends-presidential-campaign-00136839"
  },
  {
    "text": "Inside New Hampshire Gov. Sununu's drive to stop Trump, boost Haley  —  BRETTON WOODS, N.H. — At a mountainside hotel in the middle of a snowstorm, New Hampshire Gov. Chris Sununu (R) bounded to the front of a packed room and explained how he intended to impede Donald Trump's march to the Republican nomination.",
    "url": "https://www.washingtonpost.com/politics/2024/01/21/new-hampshire-governor-primary-nikki-haley-sununu/"
  },
  {
    "text": "‘America Is Under Attack’: Inside the Anti-D.E.I. Crusade  —  In late 2022, a group of conservative activists and academics set out to abolish the diversity, equity and inclusion programs at Texas' public universities.  —  They linked up with a former aide to the state's powerful lieutenant governor … ",
    "url": "https://www.nytimes.com/interactive/2024/01/20/us/dei-woke-claremont-institute.html"
  },
  {
    "text": "Whitmer pushes Biden to talk more bluntly about abortion  —  Top Biden campaign officials have flagged abortion rights as a top issue for the president.  —  Michigan Gov. Gretchen Whitmer is nudging President Joe Biden to lean harder into abortion rights as he seeks to win another term in the White House.",
    "url": "https://www.politico.com/news/2024/01/21/whitmer-biden-abortion-2024-elections-00136802"
  },
  {
    "text": "Biden Has a Michigan Problem, Endangering His Re-Election  —  Democrats worry that the president's bad poll numbers spell trouble for down-ballot races  —  DETROIT—Michigan is flashing warning signs for President Biden's re-election bid.  —  Top Democrats in this state that will help decide … ",
    "url": "https://www.wsj.com/politics/elections/joe-biden-michigan-election-president-2f62aaed?mod=followamazon"
  },
  {
    "text": "Fire erupts at Russia's Novatek Baltic Sea terminal after explosions heard  —  Novatek (NVTK.MM), Russia's largest liquefied natural gas producer, said on Sunday it had been forced to suspend some operations at a huge Baltic Sea export terminal due to a fire started by what Ukrainian media said was a drone attack.",
    "url": "https://www.reuters.com/world/fire-erupts-russias-novatek-baltic-sea-terminal-after-explosions-heard-2024-01-21/"
  },
  {
    "text": "In Judge Kaplan's court, Trump plays with fire  —  A misbehaving defendant claims to want a showdown Monday with a judge who has a unique track record on contempt  —  In the high-stakes world of presidential trials, there are no judges like Lewis A. Kaplan.",
    "url": "https://www.washingtonpost.com/national-security/2024/01/21/trump-carroll-judge-kaplan-witness/"
  },
  {
    "text": "Could a Baseball Star Really Flip Dianne Feinstein's Seat?  —  COMPTON, California  — “Ryan, do you have a pen?”  —  Steve Garvey is sitting in the backseat of his Hyundai Genesis outside Ruben's Bakery & Mexican Food in South Los Angeles; Ryan, his son, sits in the driver's seat.",
    "url": "https://www.politico.com/news/magazine/2024/01/21/steve-garvey-dodgers-california-senate-race-00136451"
  },
  {
    "text": "House GOP already considering a future without Johnson  —  Speaker Mike Johnson is beset with political challenges: At least two conservative lawmakers have begun threatening his job.  The former acting speaker trashed Johnson's performance this week.  A border-policy showdown with the Senate and White House draws nearer every day.",
    "url": "https://www.politico.com/news/2024/01/21/house-gop-mike-johnson-future-00136677"
  },
  {
    "text": "Where there's smoke, there's fire: Nikki Haley is our choice for the 2024 First in the Nation Primary  —  A hot mic moment from a candidate's withdrawal speech made headlines recently.  His assessment of Nikki Haley: “She's going to get smoked.”  The candidate was close in his assessment, but missed the mark.",
    "url": "https://www.unionleader.com/opinion/editorials/where-theres-smoke-theres-fire-nikki-haley-is-our-choice-for-the-2024-first-in/article_9d248a32-b71b-11ee-97e7-0fe4f8ed2c23.html"
  },
  {
    "text": "U.S. Pushes Hostage-Release Plan Aimed at Ending Gaza War  —  The talks are at an early stage, and large gaps remain between Israel and Hamas on the details  —  DUBAI—The U.S., Egypt and Qatar are pushing Israel and Hamas to join a phased diplomatic process that would start with a release of hostages and … ",
    "url": "https://www.wsj.com/world/middle-east/u-s-pushes-hostage-release-plan-aimed-at-ending-gaza-war-d48b27e1?mod=followamazon"
  },
  {
    "text": "Science is revealing why American politics are so intensely polarized  —  Political psychologists say they see tribalism intensifying, fueled by contempt for the other side  —  ATKINSON, N.H. — They stood in line for hours, in steady snow that became steady sleet, to hear the leader of their tribe.",
    "url": "https://www.washingtonpost.com/science/2024/01/20/polarization-science-evolution-psychology/"
  }
]