[
  {
    "text": "Kamala Harris for President  —  The Vice-President has displayed the basic values and political skills that would enable her to help end, once and for all, a poisonous era defined by Donald Trump.  —  At the 1940 Republican National Convention, in Philadelphia, an uneasy affair marked by bomb scares … ",
    "url": "https://www.newyorker.com/magazine/2024/10/07/kamala-harris-for-president-endorsement?currentPage=all"
  },
  {
    "text": "Jeff Flake endorses Kamala Harris for president: ‘I know of her character’  —  Former Republican Sen. Jeff Flake is endorsing Vice President Kamala Harris because of his conservative values — not in spite of them — he said Saturday in an interview announcing his support for the Democratic presidential nominee.",
    "url": "https://www.azcentral.com/story/news/politics/elections/2024/09/29/jeff-flake-endorses-kamala-harris-for-president/75421304007/"
  },
  {
    "text": "Republican Senate Candidate Larry Hogan, Endorsed by Trump, Won't Endorse Him Back  —  NO THANKS  —  Larry Hogan condemned Donald Trump's hateful outburst—where he called Vice President Kamala Harris “mentally disabled”—as “outrageous and unacceptable.”  —  Former Maryland Governor Larry Hogan … ",
    "url": "https://www.thedailybeast.com/republican-senate-candidate-larry-hogan-endorsed-by-trump-wont-endorse-him-back"
  },
  {
    "text": "The 128 paths to the White House  —  From the Sun Belt to the Rust Belt, which maps are most likely?  —  ∙ Paid  —  Let's try something a little different today: basically, a two-for-one.  First, I'll give you what's essentially a full newsletter with some big-picture thoughts … ",
    "url": "https://www.natesilver.net/p/the-128-paths-to-the-white-house"
  },
  {
    "text": "J. D. Vance's Thin Skin Makes Him Vulnerable  —  Kamala Harris used Donald Trump's psychic weaknesses against him in their televised debate on September 10.  Can Governor Tim Walz do the same to Senator J. D. Vance when they meet on Tuesday?  —  Watch what happens when Vance is asked … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/09/tim-walz-debate-jd-vance/680060/"
  },
  {
    "text": "Republicans lay legal groundwork for election challenges  —  In Arizona, one of seven competitive U.S. states that are expected to decide the 2024 presidential election, an advocacy group founded by Donald Trump adviser Stephen Miller is advancing a bold legal theory: that judges can throw … ",
    "url": "https://www.reuters.com/world/us/legal-blitz-republicans-lay-groundwork-us-election-challenges-2024-09-29/"
  },
  {
    "text": "Kamala's Attempted Troll of Trump at Alabama Game Fails Miserably, While Trump Is Cheered Wildly  —  Kamala Harris told the media she was going to try to troll former President Donald Trump at the Alabama-Georgia game on Saturday.  —  But the effort failed miserably and just showed how desperate she was.",
    "url": "https://redstate.com/nick-arama/2024/09/29/kamalas-attempted-troll-of-trump-fails-miserably-shows-how-desperate-she-is-n2179911"
  },
  {
    "text": "Poll: Democrats' advantage with Latino voters continues to shrink  —  Harris leads Trump nationally among Latinos, 54% to 40%, but Democrats' edge is at its lowest level in the last four presidential cycles.  —  Vice President Kamala Harris is leading former President Donald Trump among Latino voters.",
    "url": "https://www.nbcnews.com/politics/2024-election/poll-harris-trump-democrats-advantage-latino-voters-continues-shrink-rcna172686"
  },
  {
    "text": "How Project 2025 Became Toxic and Exposed the Right's Toxicity  —  On September 22, NBC News published its latest national poll.  The headline results: Kamala Harris's favorability has soared since July and she now also leads Trump head-to-head, a significant shift compared to two months ago … ",
    "url": "https://thomaszimmer.substack.com/p/how-project-2025-became-toxic-and"
  },
  {
    "text": "Fact check: To attack Harris, Trump falsely describes new stats on immigrants and homicide  —  Former President Donald Trump is wildly distorting new statistics on immigration and crime to attack Vice President Kamala Harris.  —  Trump falsely claimed Friday and Saturday that the statistics … ",
    "url": "https://www.cnn.com/2024/09/29/politics/fact-check-trump-harris-immigrants-homicide/"
  },
  {
    "text": "Hogan says he doesn't ‘agree with’ getting rid of filibuster  —  Former Maryland Gov. Larry Hogan (R), also a Republican Senate candidate, said in a Sunday interview that he doesn't “agree with” getting rid of the filibuster.  —  “I don't agree with both my opponent and Donald Trump … ",
    "url": "https://thehill.com/homenews/campaign/4905956-hogan-says-he-doesnt-agree-with-getting-rid-of-filibuster/"
  },
  {
    "text": "Meehan says Trump will ‘absolutely not’ win popular vote  —  Michael Meehan, the CEO of Squared Communications, said Sunday he believes former President Trump will “absolutely not” win the popular vote.  —  Meehan, a Democrat, was asked by host Chris Stirewalt about Trump's standing in the polls … ",
    "url": "https://thehill.com/homenews/campaign/4905890-michael-meehan-donald-trump-not-win-popular-vote/"
  },
  {
    "text": "Russians who promote ‘child-free movement’ could soon face hefty fine  —  Vyacheslav Volodin, the speaker of the lower house of parliament and an ally of President Vladimir Putin, said a new bill would tackle the “ideology of childlessness.”  —  Russia's fight against the West and its values … ",
    "url": "https://www.nbcnews.com/news/world/russia-proposes-ban-child-free-lifestyle-rcna172616"
  },
  {
    "text": "Far right in Austria heads for unprecedented election victory  —  Austria's far-right Freedom Party is heading for an unprecedented general election victory under leader Herbert Kickl, projections say.  —  The projections, based on initial results, give Kickl's party 29.2% … ",
    "url": "https://www.bbc.com/news/articles/c8rdygy5888o"
  },
  {
    "text": "Vance not allowed to campaign in Pittsburgh culinary landmark — despite Harris event at same restaurant chain  —  The vice presidential nominee met supporters outside instead after the restaurant said it wasn't told in advance about the campaign stop  —  Vice presidential candidate … ",
    "url": "https://www.foxnews.com/politics/vance-not-allowed-campaign-pittsburgh-culinary-landmark-despite-harris-event-same-restaurant-chain"
  }
]