[
  {
    "text": "The Legal Issues Surrounding Trump's Plan to Use Troops to Suppress Protests  —  President Trump has long mused about using troops to crush violent protests or riots in blue-state cities.  He is now moving to do so in Los Angeles.  —  Setting up a rare use of military force on domestic soil … ",
    "url": "https://www.nytimes.com/2025/06/08/us/trump-los-angeles-national-guard-explainer.html?unlocked_article_code=1.NU8.8xIk.aTAKs3T6TctI&smid=url-share"
  },
  {
    "text": "Trump Is Using the National Guard as Bait  —  Don't give him the pretext he wants.  —  President donald trump is about to launch yet another assault on democracy, the Constitution, and American traditions of civil-military relations, this time in Los Angeles.",
    "url": "https://www.theatlantic.com/ideas/archive/2025/06/trump-provoke-not-pacify-los-angeles/683080/?gift=otEsSHbRYKNfFYMngVFweH25hY2p_rsKIBWUs1l7ZV4&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "The National Guard in Los Angeles  —  The president hasn't invoked the Insurrection Act.  He's instead relying on a theory of inherent constitutional power that is far more limited.  —  Meet The Authors … Late yesterday, President Donald Trump signed a Presidential Proclamation mobilizing … ",
    "url": "https://www.lawfaremedia.org/article/the-national-guard-in-los-angeles"
  },
  {
    "text": "Live Updates: L.A. Quiet as National Guard Troops Begin to Arrive  —  Protests over immigration raids in the Los Angeles area were expected to continue for a third day.  Gov. Gavin Newsom said President Trump's decision to call in National Guards was “purposefully inflammatory.”  —  Los Angeles",
    "url": "https://www.nytimes.com/live/2025/06/08/us/la-protests-national-guard?unlocked_article_code=1.NU8.VTur.zDx4PMKHJj5g&smid=url-share"
  },
  {
    "text": "Trump Is Calling Up National Guard Troops Under a Rarely Used Law  —  President Trump bypassed the authority of Gov. Gavin Newsom to call up 2,000 National Guard troops to quell immigration protests.  —  President Trump took extraordinary action on Saturday by calling up 2,000 National Guard troops … ",
    "url": "https://www.nytimes.com/2025/06/07/us/trump-national-guard-deploy-rare.html?unlocked_article_code=1.NU8.MiJi.wIHcOlpxIz7P&smid=url-share"
  },
  {
    "text": "Protests intensify in Los Angeles after Trump deploys hundreds of National Guard troops  —  Tensions in Los Angeles escalated Sunday as thousands of protesters took to the streets in response to President Donald Trump's extraordinary deployment of the National Guard, blocking off a major freeway … ",
    "url": "https://apnews.com/article/immigration-protests-raids-los-angeles-78eaba714dbdd322715bf7650fb543d7"
  },
  {
    "text": "Trump's border czar threatens arrest for immigration interference, warns Newsom and Bass not to ‘cross that line’  —  ICE agents will be out “every day” regardless of pushback amid widespread protests across Los Angeles County, Tom Homan told NBC News on Saturday.",
    "url": "https://www.nbcnews.com/news/us-news/tom-homan-trump-border-czar-los-angeles-rcna211701"
  },
  {
    "text": "Breaking With Trump, Bacon Says He Won't Follow His Party ‘Off the Cliff’ … Representative Don Bacon, Republican of Nebraska, has publicly accused President Trump of treating Russia with “velvet gloves,” criticized him for gutting AmeriCorps and questioned his power to impose tariffs without congressional approval.",
    "url": "https://www.nytimes.com/2025/06/08/us/politics/breaking-with-trump-bacon-says-he-wont-follow-his-party-off-the-cliff.html"
  },
  {
    "text": "Trump's Feud With Musk Highlights His View of Government Power: It's Personal … President Trump's second term so far has been a 139-day quest for retribution.Haiyun Jiang for The New York Times  —  Amid the fireworks of his spectacular breakup with Elon Musk last week was a striking admission … ",
    "url": "https://www.nytimes.com/2025/06/08/us/politics/trump-elon-musk-fight-power.html"
  },
  {
    "text": "The Bluesky bubble hurts liberals and their causes  —  The social media network was doomed to fail as users tried to re-create Twitter.  —  Ever since Elon Musk bought Twitter, changed the social media site's name to X and altered its moderation policies, progressives have been hunting for a substitute.",
    "url": "https://www.washingtonpost.com/opinions/2025/06/08/blue-sky-twitter-liberals/"
  },
  {
    "text": "MAGA Melts Down at ABC Reporter Over Stephen Miller Takedown  —  MAGA is going off on an ABC reporter who dared attack White House Deputy Chief of Staff Stephen Miller.  ABC's Terry Moran wrote Saturday night on X that “what's interesting about [Stephen] Miller” is “not brains.",
    "url": "https://www.thedailybeast.com/maga-melts-down-at-trump-interviewer-terry-moran-over-stephen-miller-takedown/"
  },
  {
    "text": "‘You essentially destroyed any chance I have,’ DNC chair told David Hogg in private meeting  —  Ken Martin expressed frustration and self-doubt in a meeting with other party leaders, according to a two-minute recording obtained by POLITICO.  —  Democratic National Committee Chair Ken Martin … ",
    "url": "https://www.politico.com/news/2025/06/08/martin-hogg-call-private-meeting-00393517"
  },
  {
    "text": "DOGE employees are ‘being pushed out’ without Musk to protect them: report  —  Now that billionaire Elon Musk has stepped away from his White House job as a “special government employee,” the Department of Government Efficiency (DOGE) staffers he brought on board are exiting too — some not because they want to leave.",
    "url": "https://www.rawstory.com/doge-staffers-purge/"
  },
  {
    "text": "The U.S. Economy Is Headed Toward an Uncomfortable Summer  —  Companies are freezing hiring and investment to deal with shifting tariff policies.  'Even Trump doesn't know what Trump will do next.'  —  The U.S. economy, which weathered false recession alarms in 2023 and 2024, is entering another uncomfortable summer.",
    "url": "https://www.wsj.com/economy/trump-tariffs-us-economy-business-investment-7d3c6476?st=A1Vq8E&reflink=desktopwebshare_permalink"
  },
  {
    "text": "MAGA's blue-collar base waits patiently for populist payoff  —  President Trump's second term has been a payday for the powerful, exposing a disconnect in his promise to deliver for “the forgotten man” of America's working class.  —  Why it matters: The populist paradox at the heart of MAGA … ",
    "url": "https://www.axios.com/2025/06/08/trump-billionaires-working-class-paradox"
  },
  {
    "text": "Federal Judges Are Begging Us to Pay Attention  —  A Data-Driven Analysis of nearly 300 Federal Cases Reveals Judges Quoting Kafka and Warning of Democracy in Peril  —  The road to authoritarianism, it is often said, is lined by people telling you that you are overreacting.",
    "url": "https://data4democracy.substack.com/p/federal-judges-are-begging-us-to"
  }
]