[
  {
    "text": "Here Are the Attack Plans That Trump's Advisers Shared on Signal  —  So, about that Signal chat.  —  On Monday, shortly after we published a story about a massive Trump-administration security breach, a reporter asked the secretary of defense, Pete Hegseth, why he had shared plans … ",
    "url": "https://www.theatlantic.com/politics/archive/2025/03/signal-group-chat-attack-plans-hegseth-goldberg/682176/?gift=49wmX9XxesaxFXKJmFp0PlFCOlSStPdC9KOycekgUy0&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Trump Administration Live Updates: Full Exchange of Signal Texts on U.S. Strikes Is Published as Criticism Mounts Over Leak  —  Where Things Stand  — Security leak: The full exchange of messages about U.S. strikes in Yemen among top Trump administration officials on the Signal app … ",
    "url": "https://www.nytimes.com/live/2025/03/26/us/trump-news?unlocked_article_code=1.604.XulI.q3P0VWdB5DSb&smid=url-share"
  },
  {
    "text": "Trump gave Waltz a vote of confidence.  It wasn't as smooth behind the scenes.  —  The fight over Waltz's survival shows the administration is obsessed with reporters more than NatSac protocols.  —  President Donald Trump was upset when he found out that National Security Adviser Mike Waltz … ",
    "url": "https://www.politico.com/news/2025/03/26/trump-leak-mike-waltz-atlantic-00249106"
  },
  {
    "text": "The Leaked Signal Chat, Annotated  —  Excerpts of a Signal chat published Monday by The Atlantic provide a rare and revealing look at the private conversations of top Trump administration officials as they weighed plans for U.S. strikes on Houthi targets in Yemen.",
    "url": "https://www.nytimes.com/interactive/2025/03/25/us/signal-group-chat-text-annotations.html?unlocked_article_code=1.604.sLJO.8zLvwUoE8Yw-&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Exclusive: DOGE staffer, ‘Big Balls’, provided tech support to cybercrime ring, records show  —  WILMINGTON, Delaware, March 26 (Reuters) - (This story contains strong language in paragraph 15)  —  The best-known member of Elon Musk's U.S. DOGE Service team of technologists once provided support … ",
    "url": "https://www.reuters.com/world/us/doge-staffer-big-balls-provided-tech-support-cybercrime-ring-records-show-2025-03-26/"
  },
  {
    "text": "Supreme Court allows Biden-era regulations for hard-to-trace ghost guns  —  The Supreme Court ruling impacts ghost guns, the largely untraceable firearms used in a growing number of crimes over the past decade.  —  March 26, 2025  —  Live updates: Atlantic publishes messages among Trump officials about timing of strikes in Yemen",
    "url": "https://www.washingtonpost.com/politics/2025/03/26/ghost-guns-supreme-court-ruling/"
  },
  {
    "text": "Supreme Court upholds federal regulations on ghost gun kits  —  The 7-2 decision came from Justice Neil Gorsuch.  —  A view of the U.S. Supreme Court in Washington, July 19, 2024.  —  The Supreme Court on Wednesday upheld government regulation of self-assemble firearm kits that produce untraceable weapons known as “ghost guns.”",
    "url": "https://abcnews.go.com/Politics/supreme-court-upholds-federal-regulations-ghost-gun-kits/story?id=119207659"
  },
  {
    "text": "Trump Signs Order Requiring Citizenship Proof to Vote in Federal Elections  —  Administration officials cited cracking down on immigrants illegally on voter rolls as one of the executive order's main goals, amplifying Mr. Trump's grievances about electoral integrity.",
    "url": "https://www.nytimes.com/2025/03/25/us/politics/trump-elections-executive-order.html"
  },
  {
    "text": "Democrats flip deep-red Pennsylvania district in special election shocker  —  Democrats pulled off an astonishing upset in a special election for the Pennsylvania Senate on Tuesday night, as East Petersburg Mayor James Andrew Malone defeated Republican Josh Parsons by a 50-49 margin to flip … ",
    "url": "https://www.the-downballot.com/p/breaking-democrats-flip-deep-red"
  },
  {
    "text": "Democrat wins special state Senate election in Pennsylvania in major upset  —  Democrat James Malone has won an open Pennsylvania state Senate seat in a major upset in a district that comfortably voted for President Trump in November, Decision Desk HQ projects.",
    "url": "https://thehill.com/homenews/campaign/5214236-democrat-james-malone-wins-pennsylvania-senate/"
  },
  {
    "text": "What the Bernie Sanders and Alexandria Ocasio-Cortez mega-rallies are really about  —  The two progressives are bringing energy to a party that has been exhausted and furious in the second Trump era.  —  Bernie Sanders and Alexandria Ocasio-Cortez are striking a chord.",
    "url": "https://www.politico.com/news/2025/03/26/what-the-bernie-sanders-and-alexandria-ocasio-cortez-mega-rallies-are-really-about-00249753"
  },
  {
    "text": "U.S. to End Vaccine Funds for Poor Countries  —  A 281-page spreadsheet obtained by The Times lists the Trump administration's plans for thousands of foreign aid programs.  —  The Trump administration intends to terminate the United States' financial support for Gavi, the organization … ",
    "url": "https://www.nytimes.com/2025/03/26/health/usaid-cuts-gavi-bird-flu.html?unlocked_article_code=1.604.mgUe.7Y_CkCo72lQh&smid=url-share"
  },
  {
    "text": "US likely to reach debt limit X-date in August or September, Congress' scorekeeper predicts  —  The United States is likely to breach its debt limit in August or September if Congress doesn't act, according to a Congressional Budget Office forecast Wednesday.",
    "url": "https://www.politico.com/live-updates/2025/03/26/congress/us-likely-to-reach-debt-limit-x-date-in-august-or-september-congress-scorekeeper-predicts-00250525"
  },
  {
    "text": "How Elon Musk's SpaceX Secretly Allows Investment From China  —  Elon Musk's aerospace giant SpaceX allows investors from China to buy stakes in the company as long as the funds are routed through the Cayman Islands or other offshore secrecy hubs, according to previously unreported court records.",
    "url": "https://www.propublica.org/article/elon-musk-spacex-allows-china-investment-cayman-islands-secrecy"
  },
  {
    "text": "Corporate America's Euphoria Over Trump's ‘Golden Age’ Is Giving Way to Distress  —  CEOs and investors are fretting over what they see as whipsaw policy changes and complacency about the risks of recession  —  Rapturous applause and a sea of phones in the air greeted President Trump … ",
    "url": "https://www.wsj.com/economy/wall-street-trump-golden-age-distress-28a1dfcc?st=1EaSto&reflink=mobilewebshare_permalink"
  },
  {
    "text": "American Oversight Sues Trump Administration for Using Signal to Plan Military Operations … INQUIRIES PRESS@AMERICANOVERSIGHT.ORG  —  DOCKET NUMBER 25-0883  —  Following bombshell reporting that top Trump administration officials used the auto-deleting messaging app Signal to coordinate high-level … ",
    "url": "https://americanoversight.org/american-oversight-sues-trump-administration-for-using-signal-to-plan-military-operations/"
  },
  {
    "text": "'We've all done this': Trump admin group chat scandal is its most relatable fail  —  Last year Morgan Matthews woke up to discover that she had sent a text message while she was asleep.  —  “I don't don't know what to do with my wwwa w www waawaww we awW,” the lengthy message began … ",
    "url": "https://www.usatoday.com/story/tech/2025/03/25/trump-secret-signal-chat-fail-relatable/82656180007/"
  },
  {
    "text": "Denmark welcomes US decision to skip Greenland dog-sled race amid Trump spat  —  Denmark on Wednesday welcomed a U.S. decision to confine a planned visit to Greenland to a military base after the plans triggered a spat between Copenhagen and the White House amid President Donald Trump's interest in taking over the island.",
    "url": "https://www.reuters.com/world/europe/denmark-welcomes-us-change-greenland-visit-2025-03-26/"
  },
  {
    "text": "This Is Why Young People Really Voted for Trump  —  Democrats were alarmed last spring and summer when polling suggested that voters ages 18 to 29 were softening in their longtime commitment to the Democratic Party.  After the November election, when exit polls indicated that Kamala Harris … ",
    "url": "https://www.nytimes.com/2025/03/26/opinion/young-maga-trump-vote.html"
  },
  {
    "text": "Trump floats possibility of compensation for Jan. 6 rioters  —  “A lot of the people that are in the government now talk about it,” the president said.  —  President Donald Trump on Tuesday floated the possibility of financial compensation for people who were prosecuted for taking part in the riot at the Capitol in 2021.",
    "url": "https://www.politico.com/news/2025/03/25/trump-floats-possibility-of-compensation-for-jan-6-rioters-00250063"
  },
  {
    "text": "TCE Is Linked to Heart Defects in Babies, Cancer and Parkinson's.  Republicans in Congress Want to Reverse a Ban on It.  —  The toxic substance, used in dry cleaning and manufacturing, has been linked to a host of serious health problems.  A Biden-era ban on the chemical has faced multiple challenges since Trump took office.",
    "url": "https://www.propublica.org/article/tce-ban-cancer-parkinsons-trump-republicans"
  },
  {
    "text": "Ukraine Was Just Knifed In The Back  —  An update on the big story of last night—which reveals the real peril that Ukraine and Europe find themselves in when dealing with the Trump Administration.  —  Phillips's Newsletter is a reader-supported publication.",
    "url": "https://phillipspobrien.substack.com/p/ukraine-was-just-knifed-in-the-back"
  },
  {
    "text": "Federal immigration authorities detain Tufts graduate student  —  Federal immigration authorities late Tuesday detained a Tufts PhD student who is a Turkish national, her attorney and community activists said.  —  The student, Rumeysa Ozturk, is student at the Tufts's doctoral program … ",
    "url": "https://www.bostonglobe.com/2025/03/26/metro/tufts-student-detailed-by-immigration-officials/"
  },
  {
    "text": "Judge who ruled against Trump deportation flights will oversee Signal lawsuit  —  The federal judge Republicans want to impeach for blocking deportation flights to El Salvador will handle a new lawsuit alleging Trump officials violated federal law by discussing an attack on Yemen in a Signal chat.",
    "url": "https://www.axios.com/2025/03/26/signal-lawsuit-judge-trump-deportation-flights"
  },
  {
    "text": "Incompetent or Evil: A False Dichotomy  —  Trump's people can be and are both  —  The amount of damage the second Trump administration has already done on many fronts, from foreign policy to public health to America's economic prospects, both for the months ahead and in the long run, is astonishing.",
    "url": "https://paulkrugman.substack.com/p/incompetent-or-evil-a-false-dichotomy"
  }
]