[
  {
    "text": "Nikki Haley Calls Senate A ‘Privileged Nursing Home’ After McConnell Freezes  —  “We need to know they're at the top of their game,” Haley told Fox News.  “You can't say that right now looking at Congress.”  —  LOADING  —  Former South Carolina Gov. Nikki Haley urged aging lawmakers to accept … ",
    "url": "https://www.huffpost.com/entry/nikki-haley-mcconnell-senate-nursing-home_n_64f0fe36e4b03bdff3ae0c2d"
  },
  {
    "text": "GOP senators weigh ‘special’ meeting on their leadership after McConnell's freeze  —  It takes just five Republicans to force such a sitdown, the most direct way to specifically discuss their future amid revived questions about the leader's health.  —  A handful of GOP senators is weighing whether … ",
    "url": "https://www.politico.com/news/2023/08/31/gop-senators-mcconnell-freeze-up-00113610"
  },
  {
    "text": "DeSantis-aligned super PAC asked for $50 million from donors on day of first GOP primary debate, leaked audio shows  —  In an urgent appeal to wealthy Republicans who had assembled in Milwaukee ahead of the first GOP presidential primary debate, top brass for the super PAC backing Florida … ",
    "url": "https://www.cnn.com/2023/08/31/politics/desantis-super-pac-audio/"
  },
  {
    "text": "DeSantis Super PAC's Urgent Plea to Donors: ‘We Need 50 Million Bucks’  —  In an audio recording made just before the first G.O.P. debate, the super PAC's chief strategist disparaged rivals and described an expensive attempt to thwart Donald Trump in Iowa.  —  Hours before the Republican Party's … ",
    "url": "https://www.nytimes.com/2023/08/31/us/politics/desantis-super-pac-audio.html"
  },
  {
    "text": "Exclusive: GOP donors fret over Scott's single status … Scott, 57, is among those trying to woo such fundraisers.  — The U.S. hasn't elected an unmarried person as president in 139 years. … - Scott's reluctance to say much about his private life has raised concerns among … ",
    "url": "https://www.axios.com/2023/08/31/tim-scott-not-married-single-republican-donors"
  },
  {
    "text": "Trump rambled so much in a NY fraud case deposition that a lawyer griped, 'we're going to be here until midnight'  — Trump gave long-winded answers while being deposed in NY AG Letitia James' financial-fraud lawsuit.  — He went on and on about his “beautiful” and “tremendous” golf courses, a new transcript shows.",
    "url": "https://www.businessinsider.com/trump-rambled-fraud-deposition-lawyer-well-be-here-all-night-2023-8?op=1"
  },
  {
    "text": "UPDATES: Trump hearings, trials will be YouTube live streamed  —  ATLANTA, Ga. (Atlanta News First) - For the first time in American history, cameras and live streaming coverage will be allowed inside the courtroom when a former U.S. president stands trial for allegedly running … ",
    "url": "https://www.atlantanewsfirst.com/2023/08/31/updates-judge-approves-youtube-stream-donald-trump-hearings-trials/"
  },
  {
    "text": "Giuliani to enter not guilty plea in Fulton County case, waive arraignment  —  Rudy Giuliani, Donald Trump's former lawyer, will waive arraignment and enter a not guilty plea in the Fulton County, Georgia case in which he's charged alongside the former president, according to his spokesperson.",
    "url": "https://www.cbsnews.com/news/giuliani-not-guilty-plea-fulton-county-case-waive-arraignment/"
  },
  {
    "text": "Man Pleads Guilty to Election-Related Threat Toward Georgia Public Officials  —  For Immediate Release  —  A Texas man pleaded guilty today in the Northern District of Georgia to posting a message online threatening several Georgia public officials following the 2020 election.",
    "url": "https://www.justice.gov/opa/pr/man-pleads-guilty-election-related-threat-toward-georgia-public-officials"
  },
  {
    "text": "Fulton judge says Trump court proceedings will be televised  —  X  —  A Fulton County judge on Thursday said that all court proceedings in the election interference case against former President Donald Trump and 18 co-defendants will be live streamed and televised.",
    "url": "https://www.ajc.com/politics/fulton-judge-says-trump-court-proceedings-will-be-televised/GNUTN4TYAVCQ7IPMOONTIY6SJM/"
  },
  {
    "text": "New Jersey governor says state can't handle NYC migrants  —  The Democratic governor's comments come as the Biden administration considers Atlantic City airport for housing.  —  Gov. Phil Murphy suggested Thursday that New Jersey does not have the resources to take an influx of migrants … ",
    "url": "https://www.politico.com/news/2023/08/31/murphy-new-jersey-influx-migrants-00113692"
  },
  {
    "text": "Why Biden is now routinely taking the short stairs up to Air Force One  —  It's one of the iconic images of the American presidency: the commander in chief, standing and waving to the cameras from the top of the stairs leading into Air Force One.  —  But recently, President Biden … ",
    "url": "https://www.npr.org/2023/08/31/1196803354/biden-air-force-one-short-stairs"
  },
  {
    "text": "Matt Schlapp Held an Exorcism at CPAC Offices After Junior Employees Resigned  —  Matt Schlapp wanted to rid the CPAC offices of evil spirits, so he got a Catholic priest to sprinkle holy water on the office furniture and employees, multiple sources said.",
    "url": "https://www.thedailybeast.com/matt-schlapp-held-an-exorcism-at-cpac-offices-after-junior-employees-resigned"
  },
  {
    "text": "Texas Supreme Court allows ban on gender-affirming care for most minors to take effect Friday  —  The Texas Supreme Court on Thursday dismissed efforts to temporarily block the state's near-total ban on gender-affirming care for minors, clearing the way for the measure to take effect Friday.",
    "url": "https://www.cnn.com/2023/08/31/politics/texas-gender-affirming-care-ban/"
  },
  {
    "text": "Proud Boys Joe Biggs, Zachary Rehl Sentenced For Jan. 6 Plot  —  Biggs, an Army veteran and former Infowars correspondent, was sentenced to 17 years for seditious conspiracy.  Rehl was sentenced to 15 years.  —  LOADING  —  Two leaders of the Proud Boys street gang were each sentenced Thursday … ",
    "url": "https://www.huffpost.com/entry/proud-boys-joe-biggs-sentenced_n_64ef3e5de4b0efecbcb97d74"
  },
  {
    "text": "Trump campaign aide told police officers to ‘go hang yourself’ at Jan. 6 riot  —  Dylan Quattrucci, the deputy director of Trump's 2024 campaign in New Hampshire, recorded the expletive-laden video at the foot of the Capitol.  —  WASHINGTON — The No. 2 official in Hampshire … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-aide-dylan-quattrucci-police-go-hang-jan-6-riot-rcna99437"
  },
  {
    "text": "Georgia's ruling party to try to impeach president over EU visits - Interpress  —  Georgia's ruling party said on Friday that it would begin impeachment proceedings against the president due to her visits to the European Union which were made against the will of the government, Georgian news agency Interpress reported.",
    "url": "https://www.reuters.com/world/europe/georgias-ruling-party-try-impeach-president-over-eu-visits-interpress-2023-09-01/"
  }
]