[
  {
    "text": "Courting the Kook Vote in Iowa, Vivek Draws the Ire of Trump  —  Ramaswamy is fourth in the polls, but top-of-mind for the former president.  —  ANKENY, Iowa—Vivek Ramaswamy was just going through his implausible plan for firing 75 percent of the federal workforce—\"the first four agencies we're … ",
    "url": "https://thedispatch.com/article/courting-the-kook-vote-in-iowa-vivek-draws-the-ire-of-trump/"
  },
  {
    "text": "Playbook: Iowa enters the spin zone  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  HISTORY LESSON, PART 1 — “Martin Luther King Jr. Was a Radical,” by Sheryll Cashin for POLITICO Magazine: “The civil rights icon's image has been sanitized to Kumbaya, feel-good platitudes.",
    "url": "https://www.politico.com/newsletters/playbook/2024/01/15/iowa-enters-the-spin-zone-00135582"
  },
  {
    "text": "CNN Anchor Grills Ex-2024 Hopeful on Trump Endorsement: ‘Why Get Behind Him Now?’  —  After repeatedly calling it a “binary choice,” a noticeably unenthused Burgum tried to compare Trump to Winston Churchill.  —  CNN anchor Phil Mattingly repeatedly pressed North Dakota Gov. Doug Burgum … ",
    "url": "https://www.thedailybeast.com/cnn-anchor-grills-nd-gov-doug-burgum-on-trump-endorsement-why-get-behind-him-now"
  },
  {
    "text": "Majority of Iowa caucusgoers say Trump conviction wouldn't affect their support  —  The Iowa poll shows 18% of likely caucusgoers would be less likely to back Trump in 2024 if he's convicted of a crime before the general election.  —  More than 6-in-10 likely Republican caucusgoers … ",
    "url": "https://www.nbcnews.com/meet-the-press/meetthepressblog/majority-iowa-caucusgoers-say-trump-conviction-wouldnt-affect-support-rcna133876"
  },
  {
    "text": "Trump's ghost stalks Davos  —  DAVOS, Switzerland — World leaders gathered together in the Swiss Alps this week are nervous that Donald Trump will be even more anti-global if he returns as United States president.  —  And they have good reason to be wary.",
    "url": "https://www.politico.eu/article/donald-trump-davos-us-elections-world-economic-forum/"
  },
  {
    "text": "Key Trump Lawyer Withdraws as Manhattan Criminal Trial Nears  —  Joseph Tacopina brought extensive experience with high-profile cases to former president Donald J. Trump's legal team.  —  Joseph Tacopina, the trial lawyer on Donald J. Trump's legal team with the most successes defending high-profile clients … ",
    "url": "https://www.nytimes.com/2024/01/15/us/politics/tacopina-trump-lawyer.html"
  },
  {
    "text": "A person called 911 falsely reporting a fire at the White House in apparent ‘swatting’ event  —  President Joe Biden was at Camp David when the call to 911 was made early Monday morning.  —  WASHINGTON — A person called 911 Monday morning falsely claiming that there was a fire at the White House and that someone was trapped inside.",
    "url": "https://www.nbcnews.com/politics/white-house/person-called-911-falsely-reporting-fire-white-house-apparent-swatting-rcna133964"
  },
  {
    "text": "911 caller falsely claims White House fire after series of swatting incidents  —  Emergency responders in Washington, D.C., on Monday were dispatched to a false alarm at the White House after a 911 caller claimed there was a structure fire in the building.  —  Noah Gray, the chief communications … ",
    "url": "https://thehill.com/blogs/blog-briefing-room/4409503-911-caller-falsely-claims-white-house-fire-after-series-of-swatting-incidents/"
  },
  {
    "text": "Why The World Is Betting Against American Democracy  —  Ambassadors to Washington warn that the GOP-Democratic divide is endangering America's national security.  —  Foreign diplomats are aghast that so many U.S. leaders let their zeal for partisan politics prevent the basic functions of government.",
    "url": "https://www.politico.com/news/magazine/2024/01/15/what-foreign-diplomats-say-about-u-s-politics-behind-closed-doors-00135326"
  },
  {
    "text": "Nikki Haley Refuses to Say a Man Cannot Become a Woman During Campaign Event  —  The Iowa Caucus is just hours away and social issues seem to be top of mind for at least some voters in the Hawkeye State.  —  Extreme weather conditions in Iowa limited the 2024 GOP hopefuls to mostly virtual events … ",
    "url": "https://www.megynkelly.com/2024/01/15/nikki-haley-can-a-man-become-a-woman-iowa/"
  },
  {
    "text": "Secretary of Defense Lloyd J. Austin III Released From Hospital  —  Following consultation with medical staff, Secretary Austin was released from Walter Reed National Military Medical Center today.  —  The Secretary continues to recover well and, on the advice of doctors … ",
    "url": "https://www.defense.gov/News/Releases/Release/Article/3645144/secretary-of-defense-lloyd-j-austin-iii-released-from-hospital/"
  },
  {
    "text": "Iowa caucuses 2024 live updates: Latest news on today's GOP vote  — Iowa Republicans will caucus today at 7 p.m. CT, officially kicking off the party's presidential nominating process.  — Former President Donald Trump holds a clear polling lead, with the final NBC News/Des Moines … ",
    "url": "https://www.nbcnews.com/politics/2024-election/live-blog/iowa-election-2024-live-updates-rcna133678#rcrd30712"
  },
  {
    "text": "RFK Jr. defends FBI, Kennedy-era wiretapping of MLK Jr.  —  Robert F. Kennedy Jr. offered a striking justification for the surveillance effort against Martin Luther King Jr. during an interview with Politico on Sunday.  —  Kennedy, who is seeking the 2024 presidency as an independent … ",
    "url": "https://thehill.com/homenews/campaign/4409426-rfk-jr-defends-fbi-kennedy-era-wiretapping-of-mlk-jr/"
  },
  {
    "text": "Fani Willis Is in Full Panic Mode  —  As RedState reported, Fani Willis finally responded to the allegations that she hired the man she was having an affair with to be a special counsel in her office.  For some reason, she decided to give her remarks in front of a black church congregation.",
    "url": "https://redstate.com/bonchie/2024/01/15/fani-willis-is-in-full-panic-mode-n2168734"
  },
  {
    "text": "North Korea says it tested new solid-fuel missile timed with hypersonic warhead  —  North Korea claimed to have successfully test-fired a hypersonic missile on Sunday as Pyongyang moves toward procuring a rocket that can travel at five times the speed of sound in a bid to bolster … ",
    "url": "https://thehill.com/policy/defense/4409429-north-korea-says-it-tested-new-solid-fuel-missile-timed-with-hypersonic-warhead/"
  }
]