[
  {
    "text": "Biden's Family Tells Him to Keep Fighting as They Huddle at Camp David  —  President Biden is trying to figure out how to tamp down Democratic anxiety after last week's disastrous debate performance.  —  President Biden's family is urging him to stay in the race and keep fighting despite … ",
    "url": "https://www.nytimes.com/2024/06/30/us/politics/biden-debate-anxious-democrats.html"
  },
  {
    "text": "Biden's family privately criticizes top advisers and pushes for their ouster at Camp David meeting  —  They also urged the president to stay in the race.  —  Members of Joe Biden's family privately trashed his top campaign advisers at Camp David this weekend, blaming them for the president's flop … ",
    "url": "https://www.politico.com/news/2024/06/30/biden-camp-david-family-debate-00165970"
  },
  {
    "text": "Playbook: Fear and loathing on Capitol Hill  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  PLAYING HORSESHOES — “Left and Right Agree on One Thing: The Justice System Is Corrupted by Bias,” by John F. Harris and Ian Ward: “Monday marks the final … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/07/01/fear-and-loathing-on-capitol-hill-00166000"
  },
  {
    "text": "Behind the Curtain: Biden's salvation plan … - Dismiss “bedwetting.” … - Squeeze polls for juice. … - Warn of chaos. … - Limit dissent. … - Keep elected leaders close. … - Get the donor class to chill. … - Prove vitality. … - Ignore/engage the media.",
    "url": "https://www.axios.com/2024/07/01/biden-2024-election-pr-campaign-step-aside"
  },
  {
    "text": "Why I Want an Open Convention  —  Over the past few years, many people have told me I should stop making Biden-is-old jokes because “it just helps Trump” — as if voters wouldn't have noticed his age otherwise.  I can't ignore the obvious; none of us can.  And I'm not going to mindlessly … ",
    "url": "https://www.nytimes.com/2024/07/01/opinion/bill-maher-open-convention.html"
  },
  {
    "text": "Whitmer Disavows ‘Draft Grech’ Movement  —  Democrats' 2028 bench is eager to avoid appearing eager to push Biden aside.  —  When Michigan Gov. Gretchen Whitmer telephoned a senior official with President Biden's campaign on Friday night, she wanted to convey a clear message … ",
    "url": "https://www.politico.com/news/magazine/2024/07/01/whitmer-biden-democrats-2028-00165995"
  },
  {
    "text": "The Road to a Crisis: How Democrats Let Biden Glide to Renomination  —  An 81-year-old candidate and no Plan B.  “How did we get here?” one leading Democrat asks.  The answer is complicated.  —  In the aftermath of Thursday's presidential debate, as Jill Biden led President Biden off the stage … ",
    "url": "https://www.nytimes.com/2024/07/01/us/politics/biden-democrats-renomination.html"
  },
  {
    "text": "Majority of voters think Biden is cognitively unfit to serve as president: poll  —  Poll finds 72% of registered voters doubt Biden's cognitive abilities  —  A poll released by CBS News on Sunday found that more voters have doubts about President Biden's cognitive abilities after Thursday's presidential debate.",
    "url": "https://www.foxnews.com/politics/majority-voters-think-biden-cognitively-unfit-serve-president-poll"
  },
  {
    "text": "Democrats fear replacement scenarios as much as keeping Biden  —  They're not writing anything down.  They're not making any firm commitments.  —  But between staring into phones that started buzzing about three minutes into the debate and haven't stopped since, several … ",
    "url": "https://www.cnn.com/2024/06/30/politics/democratic-party-replacement-worries-joe-biden/"
  },
  {
    "text": "SCOTUS completes the biggest power grab in modern US history  —  This free edition of Public Notice is made possible by paid subscribers.  If you aren't one already, please sign up to support our independent journalism.  —  ⚖️ Subscribe to Public Notice ⚖️",
    "url": "https://www.publicnotice.co/p/scotus-loper-bright-chevron-jarkesy-explained"
  },
  {
    "text": "Supreme power grab  —  For thirty years, federal law has required commercial fishing boats to include a trained observer to ensure the vessel does not engage in overfishing or other prohibited practices.  The law specifies that certain classes of boats pay the costs of their own monitors.",
    "url": "https://popular.info/p/supreme-power-grab"
  },
  {
    "text": "US to criminally charge Boeing, seek guilty plea, sources say  —  The U.S. Justice Department will criminally charge Boeing (BA.N) with fraud over two fatal crashes and ask the planemaker to plead guilty or face a trial, two people familiar with the matter said on Sunday.",
    "url": "https://www.reuters.com/legal/us-pushes-boeing-plead-guilty-connection-with-fatal-crashes-sources-say-2024-06-30/"
  },
  {
    "text": "Le Pen's far right set for big win in first round of French election  —  Early projections show National Rally on course for victory in the vote for a new parliament as Emmanuel Macron's election gamble backfires.  —  PARIS  —  France is facing what until recently was an unthinkable nightmare for Europe … ",
    "url": "https://www.politico.eu/article/france-legislative-election-results-first-round-marine-le-pen-pollsters-national-rally/"
  },
  {
    "text": "Meet the sporadic voters who could decide the 2024 election  —  Polls show Trump leading among voters who didn't participate in 2020.  The question is: Will they show up in 2024?  —  Neither Joseph Mitchum nor Laura Brooks participated in the last presidential election four years ago.",
    "url": "https://www.nbcnews.com/politics/2024-election/meet-sporadic-voters-decide-2024-election-rcna158374?taid=668274c3e045c600011911a8"
  },
  {
    "text": "Ron DeSantis strips more than $32m in Florida arts funding  —  Political allies are also surprised at move, which cancels nearly entirety of state's funding and will affect economy  —  Ron DeSantis stripped more than $32m in arts and culture funding from Florida's state budget over his hatred … ",
    "url": "https://www.theguardian.com/us-news/article/2024/jun/30/ron-desantis-florida-art-funding-cut"
  }
]