[
  {
    "text": "Haley blames a ‘Democratic plant’ for Civil War question that tripped her up  —  The former South Carolina governor also said that the war was, indeed, about slavery.  —  Hours after declining to do so, Nikki Haley said on Thursday morning that she believed slavery was, indeed, the cause of the Civil War.",
    "url": "https://www.politico.com/news/2023/12/28/nikki-haley-civil-war-comments-response-00133268"
  },
  {
    "text": "Nikki Haley, asked what caused the Civil War, leaves out slavery.  It's not the first time  —  Republican presidential candidate Nikki Haley was asked Wednesday by a New Hampshire voter about the reason for the Civil War, and she didn't mention slavery in her response — leading the voter to say he was “astonished” by her omission.",
    "url": "https://apnews.com/article/haley-election-civil-war-slavery-a509ff9d7cc5e271c42592276b75735c"
  },
  {
    "text": "Haley declines to say slavery was cause of Civil War  —  The former South Carolina governor instead said it was a dispute over how ‘government was going to run.’  —  Nikki Haley declined to say that slavery was a cause of the Civil War on Wednesday evening, placing the blame, instead, on the role of government.",
    "url": "https://www.politico.com/news/2023/12/27/haley-slavery-cause-of-civil-war-00133254"
  },
  {
    "text": "Dems Target GOP State Lawmakers With Jan. 6 Credentials  —  Democrats are going after Republicans who came to Washington, D.C., on Jan. 6 to cheer on overturning the election. … In Donald Trump's Republican Party, being in Washington on Jan. 6, 2021, is far from a mark on a candidate's record—it's more like a credential.",
    "url": "https://www.thedailybeast.com/dems-target-gop-state-lawmakers-with-jan-6-credentials"
  },
  {
    "text": "Jan. 6 riot suspect revealed as Trump administration employee who praised Hitler: report  —  A full-time employee of the Trump administration appears to have taken part in the Jan. 6 insurrection, according to a new analysis.  —  USA Today reported that Oliver Krvaric, who was working at the time as a … ",
    "url": "https://www.rawstory.com/jan-6-2666817731/"
  },
  {
    "text": "Colorado Republican Party Says It Asked Supreme Court to Keep Trump on Ballot  —  The party's petition urged the justices to review a ruling from the Colorado Supreme Court, which said the former president had engaged in insurrection and is ineligible to hold office.",
    "url": "https://www.nytimes.com/2023/12/27/us/colorado-supreme-court-trump.html"
  },
  {
    "text": "Christie says Trump will ‘burn America to the ground’  —  Chris Christie is stepping up his rhetoric attacking GOP presidential frontrunner and rival former President Trump, releasing a new ad declaring Trump will “burn America to the ground.”  —  Christie, the former New Jersey governor … ",
    "url": "https://thehill.com/homenews/campaign/4380102-christie-says-trump-will-burn-america-to-the-ground/"
  },
  {
    "text": "Christie pushes back on calls for him to drop out in 7-figure New Hampshire ad buy  —  Chris Christie is directly pushing back on calls for him to drop out of the 2024 Republican presidential primary in a new seven-figure ad buy debuting in New Hampshire on Thursday, according to details shared exclusively with CNN.",
    "url": "https://www.cnn.com/2023/12/27/politics/chris-christie-new-hampshire-ad-buy/"
  },
  {
    "text": "The conservative pin-up calendar is harmless kitsch, not pornography  —  In the dumbest possible online nontroversy that has been branded #Calendargate, a handful of conservatives — and disproportionately, conservative women — are apoplectic over a calendar featuring photo shoots of various right-wing bloggers and “influencers.”",
    "url": "https://www.washingtonexaminer.com/opinion/the-conservative-pin-up-calendar-is-harmless-kitsch-not-porn"
  },
  {
    "text": "Independent lawyers begin prosecuting cases of sexual assault and other crimes in the US military  —  The U.S. military on Thursday opened a new chapter in how it investigates and prosecutes cases of sexual assault and other major crimes, putting independent lawyers in charge of those decisions … ",
    "url": "https://apnews.com/article/military-sexual-assault-prosecution-overhaul-e6cb6e700338b1471501777a09ca467e"
  },
  {
    "text": "2024 may be the hottest year in recorded history  —  2024 may be even hotter than the “gobsmackingly” hot 2023, which featured extreme — and often deadly — weather and climate events around the globe. … But ‘the normal pattern’ may not exist anymore,\" said Andrew Dessler, a climate scientist at Texas A&M University.",
    "url": "https://www.axios.com/2023/12/28/climate-change-extreme-heat-outlook"
  },
  {
    "text": "Biden Knew Carter Was in Trouble in 1979.  Now He's in the Same Boat.  —  Both presidents faced inflation and foreign-policy challenges as they sought a second term  —  WASHINGTON—When an unpopular Democratic incumbent president was struggling to build support for a second term … ",
    "url": "https://www.wsj.com/politics/elections/biden-knew-carter-was-in-trouble-in-1979-now-hes-in-the-same-boat-74c96cdb?mod=followamazon"
  },
  {
    "text": "Gas prices will fall in 2024 and Americans will spend $32 billion less on fuel, GasBuddy predicts  —  New York CNN  —  Gas prices will fall in 2024 for the second year in a row, according to GasBuddy projections shared exclusively with CNN.  —  GasBuddy, which had a forecast for 2023 … ",
    "url": "https://www.cnn.com/2023/12/27/economy/gas-prices-2024-economy-inflation/"
  },
  {
    "text": "Tim Alberta on Why Evangelical Politics Was Ready for Trump  —  Roughly 24 percent of Americans consider themselves “born-again or evangelical,” but what that means — spiritually, culturally, politically — depends on whom you ask.  For some evangelicals, the role of politics … ",
    "url": "https://www.nytimes.com/2023/12/27/opinion/tim-alberta-trump-evangelicals.html"
  },
  {
    "text": "Statement of the Chairman and Ranking Member of the Committee on Ethics Regarding Representative Sheila Cherfilus-McCormick  —  Pursuant to Committee Rule 7, the Chairman and Ranking Member of the Committee on Ethics (Committee) determined to release the following statement:",
    "url": "https://ethics.house.gov/press-releases/statement-chairman-and-ranking-member-committee-ethics-regarding-representative-77"
  },
  {
    "text": "Tom Smothers, Comedian, Musician and Scourge of CBS Censors, Dies at 86  —  He and his brother, Dick, “turned television upside down” on ‘The Smothers Brothers Comedy Hour’ before they were canned.  —  Tom Smothers, the countercultural comedy icon admired for the 1960s variety program … ",
    "url": "https://www.hollywoodreporter.com/news/general-news/tom-smothers-dead-smothers-brothers-comedy-duo-1235775301/"
  },
  {
    "text": "One in five young Americans has a POSITIVE view of Osama Bin Laden: Disturbing Daily Mail poll results also reveal three in 10 Gen-Zers think the views of the 9/11 mastermind were a ‘force for good’  — Alarming poll results show some voters under 30 are sympathetic to Bin Laden",
    "url": "https://www.dailymail.co.uk/news/article-12890583/americans-osama-bin-laden-poll-gen-zers.html"
  }
]