[
  {
    "text": "Ramaswamy camp: The RNC sabotaged us in the debate spin room  —  There is bad blood brewing here.  —  Vivek Ramaswamy's campaign accused Republican National Committee Chair Ronna McDaniel of trying to limit his campaign's visibility in the post debate spin room, following critical remarks he made of her at the forum.",
    "url": "https://www.politico.com/news/2023/11/09/ramaswamy-camp-rnc-sabotage-debate-spin-room-00126446"
  },
  {
    "text": "Ramaswamy calls McDaniel claims about him ‘malpractice’  —  GOP presidential candidate Vivek Ramaswamy hit back at Republican National Committee (RNC) Chair Ronna McDaniel for claims she made about his voting record Thursday.  —  McDaniel made comments Thursday in which she dismissed Ramaswamy's knocks … ",
    "url": "https://thehill.com/homenews/campaign/4303471-ramaswamy-calls-mcdaniel-claims-about-him-malpractice/"
  },
  {
    "text": "GOP debate fireworks: Why Vivek Ramaswamy took aim at RNC chair Ronna McDaniel  —  Asked about Ramaswamy's call for her to resign as RNC chair, McDaniel told Fox News: 'I'm not going to attack other Republicans'  —  MIAMI, Fla. - A Republican presidential candidate fired personal insults … ",
    "url": "https://www.foxnews.com/politics/gop-debate-fireworks-vivek-ramaswamy-took-aim-rnc-chair-ronna-mcdaniel"
  },
  {
    "text": "Trump's Lawyers Argue Judges Don't Have a Role in Enforcing 14th Amendment Challenge on Day One of Michigan's Oral Arguments  —  Brewer and Columbo's arguments stem from a lawsuit filed by the nonprofit Free Speech for People alongside voters in the state against Secretary of State Jocelyn Benson … ",
    "url": "https://themessenger.com/politics/trumps-lawyers-argue-judges-dont-have-a-role-in-enforcing-14th-amendment-challenge-on-day-one-of-michigans-oral-arguments"
  },
  {
    "text": "County elections offices receive suspicious envelopes  — County elections offices receive suspicious envelopes  —  OLYMPIA — Envelopes received by elections offices in King, Pierce, Skagit, and Spokane counties were found Wednesday to contain unknown powdery substances.",
    "url": "https://www.sos.wa.gov/about-office/news/2023/county-elections-offices-receive-suspicious-envelopes"
  },
  {
    "text": "Fulton County election office sent envelope possibly laced with fentanyl  —  An envelope possibly containing fentanyl has been sent to Georgia's Fulton County election office in an incident that Secretary of State Brad Raffensperger called “domestic terrorism” on Thursday.",
    "url": "https://www.axios.com/2023/11/09/fulton-county-georgia-election-office-threats"
  },
  {
    "text": "Statement on Yousef Masoud  —  Below is a statement issued by The New York Times in response to allegations made by Honest Reporting and others against freelance photographer Yousef Masoud, who has contributed to coverage of the Israel-Hamas war for a number of outlets, including The New York Times.",
    "url": "https://www.nytco.com/press/statement-on-yousef-masoud/"
  },
  {
    "text": "MTG Is Trashing Lauren Boebert as a ‘Whore’ to GOP Colleagues  —  Greene and Boebert have been going at it for nearly a year now.  But Greene's latest move is straight out of the high school cafeteria's playbook. … After Rep. Lauren Boebert helped get Rep. Marjorie Taylor Greene kicked … ",
    "url": "https://www.thedailybeast.com/marjorie-taylor-greene-is-trashing-lauren-boebert-as-a-whore-to-gop-colleagues"
  },
  {
    "text": "Exclusive: What the woodworker saw: Trump documents trial may put resort workers on witness stand, sources say  —  West Palm Beach, Florida CNN  —  A plumber, a maid, a chauffeur and a woodworker are among Mar-a-Lago staffers and contract workers who federal prosecutors may call to testify … ",
    "url": "https://www.cnn.com/2023/11/09/politics/mar-a-lago-documents-case-witnesses/"
  },
  {
    "text": "‘No, screw him’: Top Democrat balks at Tuberville push to move abortion debate to defense bill  —  Rep. Adam Smith warns that a defense policy bill won't pass if Republicans insist on tough abortion language.  —  The top Democrat on the House Armed Services Committee forcefully rejected … ",
    "url": "https://www.politico.com/news/2023/11/09/dems-tuberville-abortion-defense-00126384"
  },
  {
    "text": "FEC Commissioner Calls Out Her GOP Colleagues in Brutal 5-Sentence Takedown  —  SPECIAL TREATMENT  —  FEC Commissioner Ellen Weintraub on Thursday said her Republican colleagues have effectively put former President Donald Trump “in [a] category by himself” by refusing to investigate … ",
    "url": "https://www.thedailybeast.com/fec-commissioner-calls-out-her-gop-colleagues-in-brutal-5-sentence-takedown"
  },
  {
    "text": "'We're ungovernable': House Republicans nix votes on two funding bills as shutdown deadline nears  —  Funding to keep the government open is set to expire on Nov. 17, and there's no deal on how to avoid it.  —  WASHINGTON — House Republicans closed out the week by canceling votes … ",
    "url": "https://www.nbcnews.com/politics/congress/-ungovernable-house-republicans-nix-votes-two-funding-bills-shutdown-d-rcna124441"
  },
  {
    "text": "Netanyahu rejected ceasefire-for-hostages deal in Gaza, sources say  —  Israeli PM said to have turned down proposal in early talks and continues to take tough line  —  Ruth Michaelson in Istanbul, Julian Borger in London and Emine Sinmaz in Jerusalem  —  Benjamin Netanyahu rejected a deal … ",
    "url": "https://www.theguardian.com/world/2023/nov/09/netanyahu-rejected-ceasefire-for-hostages-deal-in-gaza-sources-say"
  },
  {
    "text": "Justice Barrett gets standing ovation at Federalist Society gala  —  Outside the gathering of the conservative legal group, protesters proclaim the Supreme Court ‘is not for sale’  —  Justice Amy Coney Barrett received a standing ovation Thursday night at a black-tie gala for the Federalist Society … ",
    "url": "https://www.washingtonpost.com/politics/2023/11/09/justice-barrett-at-federalist-society-gala/"
  },
  {
    "text": "Brian Higgins appears to be stepping down as Congressman to take top job at Shea's  —  BUFFALO, N.Y. (WIVB) — Congressman Brian Higgins, who has represented much of the city of Buffalo and Western New York in Washington since 2005, appears to be stepping down.",
    "url": "https://www.wivb.com/news/political-news/brian-higgins-appears-to-be-stepping-down-as-congressman-to-take-top-job-at-sheas/"
  },
  {
    "text": "Judge Uses Eye-Opening Impeachment Analogy for Michael Cohen's Testimony That Trump Spoke in Code  —  Justice Engoron likened Michael Cohen's claim that Trump gave directives like a ‘mob boss’ to the former president's ‘perfect call’ with Ukraine's president  —  JWPlayer",
    "url": "https://themessenger.com/politics/trump-motion-verdict-new-york-civil-fraud-trial"
  },
  {
    "text": "Democratic Sen. Joe Manchin says he will not seek reelection  —  Sen. Joe Manchin III (D-W.Va.) announced Thursday he would not seek reelection in 2024, leaving the door open for Republicans to flip a seat in a solidly red state.  —  “After months of deliberation and long conversations with my family … ",
    "url": "https://www.washingtonpost.com/politics/2023/11/09/manchin-senate-reelection/"
  },
  {
    "text": "Statement from GSA Administrator regarding FBI Director comments  —  WASHINGTON - The following is a statement from U.S. General Services Administrator Robin Carnahan regarding the FBI suburban headquarters site selection process.  The agency's site selection process and decision can be found … ",
    "url": "https://www.gsa.gov/about-us/newsroom/news-releases/statement-from-gsa-administrator-regarding-fbi-director-comments-11092023"
  },
  {
    "text": "Australia Signs Historic Climate Refuge Pact With Tuvalu  — Agreement will also provide climate and economic assistance  — Deal creates pathway for Tuvalu citizens to come to Australia  —  Australia has struck the “most significant” Pacific agreement in its history with the tiny country of Tuvalu … ",
    "url": "https://www.bloomberg.com/news/articles/2023-11-10/australia-signs-bilateral-treaty-to-provide-security-to-tuvalu"
  },
  {
    "text": "McCarthy unloads on his GOP critics and says Mace deserves to lose reelection bid  —  Watch CNN Chief Congressional Correspondent Manu Raju's interview with former Speaker Kevin McCarthy this Sunday at 11 a.m. ET/8 a.m. PT on CNN's “Inside Politics.”  ﻿",
    "url": "https://www.cnn.com/2023/11/09/politics/mccarthy-comments-on-gop-critics/"
  },
  {
    "text": "Trump's false election claims lurk in background as court weighs robocall case  —  Trump's false election claims arose during a Michigan Supreme Court argument over the prosecutions of two right-wing provocateurs.  —  Could Donald Trump be prosecuted for saying the election was rigged?",
    "url": "https://www.politico.com/news/2023/11/09/court-debates-free-speech-protections-for-election-lies-including-trumps-00126503"
  }
]