[
  {
    "text": "Trump is ordered to pay legal fees after failed lawsuit over the Steele dossier  —  Former U.S. President Donald Trump has been ordered to pay legal fees to a company founded by a former British spy that he sued for making what he claimed were false claims that harmed his reputation",
    "url": "https://abcnews.go.com/International/wireStory/trump-ordered-pay-legal-fees-after-failed-lawsuit-107891658"
  },
  {
    "text": "Trump loses bid to delay $83.3 million E. Jean Carroll defamation judgment  — Donald Trump lost a bid to delay paying an $83.3 million civil defamation judgment to writer E. Jean Carroll.  — Trump had asked Manhattan federal Judge Lewis Kaplan to delay the judgment from taking effect until … ",
    "url": "https://www.cnbc.com/2024/03/07/trump-loses-bid-to-delay-83point3-million-e-jean-carroll-judgment.html"
  },
  {
    "text": "Trump's Money Problems Are Very Real and Very Bad  —  His political fortunes may be looking up, but his business problems are dire.  —  The danger posed to Donald Trump's finances by two recent judgments against him has been, if anything, underappreciated.",
    "url": "https://www.theatlantic.com/ideas/archive/2024/03/trump-financial-legal-troubles/677662/"
  },
  {
    "text": "Donald Trump told to pay six-figure costs of firm he sued  —  The former US president's case against a company founded by an ex-MI6 officer was thrown out.",
    "url": "https://www.bbc.com/news/uk-68499543"
  },
  {
    "text": "The Case Trump Really Hates  —  Prosecutors want to present steamy details at the hush money trial.  —  For the past couple of weeks, the spotlight has been focused on the timing of Donald Trump's four criminal trials and the prospect that at least two of them might not go to a jury before this fall's election.",
    "url": "https://www.nytimes.com/2024/03/07/us/politics/trump-trial-hush-money-stormy-daniels.html"
  },
  {
    "text": "Dr. John Gartner: The world is watching “a fundamental breakdown in Trump's ability to use language”  —  Experts say Trump's decline may be “caused by his incapacity to manage the stress caused by multiple indictments”  —  It has become undeniably clear and obvious to any reasonable person … ",
    "url": "https://www.salon.com/2024/03/07/dr-john-gartner-the-world-is-watching-a-fundamental-breakdown-in-trumps-ability-to-use-language/"
  },
  {
    "text": "Truth Social Suffers Outage in Middle of Trump's Furious Live-Tweeting About Biden Speech  —  “THE DRUGS ARE WEARING OFF!”  Trump wrote without any further context, making it's unclear if he was talking about Biden or himself.  —  Truth Social, the social media platform launched by Donald Trump in 2022 … ",
    "url": "https://gizmodo.com/truth-social-down-outage-trump-biden-state-of-the-union-1851318732"
  },
  {
    "text": "The biggest moments from Biden's 2024 State of the Union address  —  President Biden delivered an aggressive State of the Union speech Thursday night in which he drew sharp contrasts with former president Donald Trump and Republicans in Congress.  —  Biden made reference to “my predecessor” … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/07/state-of-the-union-highlights-2024/"
  },
  {
    "text": "Official GOP Response to SOTU Has Republicans ‘Losing It’  —  Sen. Katie Britt of Alabama gave the GOP response to President Biden's annual address—which got panned by some in her own party.  —  As President Joe Biden continued mingling on the House floor after his State of the Union speech Thursday night … ",
    "url": "https://www.thedailybeast.com/official-katie-britt-gop-response-to-state-of-the-union-has-republicans-losing-it"
  },
  {
    "text": "Navy demoted Ronny Jackson after probe into White House behavior  —  Ronny Jackson, the former White House physician turned GOP congressman, regularly touts his military bona fides.  —  “As a retired U.S. Navy Rear Admiral with nearly three decades of military service I understand the commitment … ",
    "url": "https://www.washingtonpost.com/nation/2024/03/07/ronny-jackson-demotion-white-house-medical-unit-navy/"
  },
  {
    "text": "Navy demoted Ronny Jackson in 2022 after scathing watchdog report  —  The Navy demoted Rep. Ronny Jackson in 2022 after a scathing report from the Defense Department watchdog found the former White House physician drank on the job, routinely screamed at subordinates and acted inappropriately.",
    "url": "https://www.cnn.com/2024/03/07/politics/navy-demoted-ronny-jackson"
  },
  {
    "text": "Santos to make surprise appearance at Capitol for State of the Union  —  Former Rep. George Santos (R-N.Y.) will make a surprise appearance at the Capitol Thursday for President Biden's State of the Union address, two sources familiar confirmed to The Hill, roughly three months after he was expelled … ",
    "url": "https://thehill.com/homenews/house/4517519-santos-to-make-surprise-appearance-at-capitol-for-state-of-the-union/"
  },
  {
    "text": "Why is New York Times campaign coverage so bad?  Because that's what the publisher wants.  —  It's an increasingly common critique of the New York Times: The largest, most influential news organization in the nation is not warning sufficiently of the threat to democracy … ",
    "url": "https://presswatchers.org/2024/03/why-is-new-york-times-campaign-coverage-so-bad-because-thats-what-the-publisher-wants/"
  },
  {
    "text": "Remarks of President Joe Biden — State of the Union Address As Prepared for Delivery  —  Good evening.  —  Mr. Speaker.  Madam Vice President.  Members of Congress.  My Fellow Americans.  —  In January 1941, President Franklin Roosevelt came to this chamber to speak to the nation.",
    "url": "https://www.whitehouse.gov/briefing-room/speeches-remarks/2024/03/07/remarks-of-president-joe-biden-state-of-the-union-address-as-prepared-for-delivery-2/"
  },
  {
    "text": "Stormy Daniels alleges in new documentary that Donald Trump cornered her the night they met  —  Stormy Daniels goes into new detail in a documentary about her alleged 2006 sexual encounter with former President Trump, saying she was cornered by him in his hotel room the night they met and that she blames herself for not stopping him.",
    "url": "https://www.latimes.com/entertainment-arts/tv/story/2024-03-07/stormy-documentary-donald-trump-peacock"
  },
  {
    "text": "GOP Rep. Michelle Steel rescinds her co-sponsorship of the Life at Conception Act after winning her primary  —  Steel says she supports IVF, which the bill could threaten.  She has put forward a nonbinding resolution backing IVF but has not signed on to a bill offering legal protection for it.",
    "url": "https://www.nbcnews.com/politics/congress/gop-rep-michelle-steel-rescinds-cosponsorship-life-conception-act-rcna142285"
  },
  {
    "text": "Spate of Mock News Sites With Russian Ties Pop Up in U.S.  —  The fake news organizations, experts say, represent a technological leap in the Kremlin's efforts to spread false and misleading narratives.  —  Into the depleted field of journalism in America, a handful of websites have appeared … ",
    "url": "https://www.nytimes.com/2024/03/07/business/media/russia-us-news-sites.html"
  },
  {
    "text": "Thune on Ukraine: ‘America cannot retreat from the world stage’  —  Sen. John Thune (R-S.D.) pressed the House on Thursday to pass a Ukraine aid bill, as he launches a campaign to replace outgoing Senate GOP Leader Mitch McConnell (Ky.).  —  “I think that the challenge, of course, right now … ",
    "url": "https://thehill.com/homenews/senate/4517922-thune-on-ukraine-america-cannot-retreat-from-the-world-stage/"
  },
  {
    "text": "House panel unanimously approves bill that could ban TikTok  —  A powerful House committee advanced a bill on Thursday that could lead to a nationwide ban against TikTok on all electronic devices, renewing lawmakers' challenge to one of the world's most popular social media apps … ",
    "url": "https://www.cnn.com/2024/03/07/tech/congress-bill-bans-tiktok-america/"
  },
  {
    "text": "Merrick Garland isn't to blame for delays in Trump's election interference case  —  The popular narratives attributing delay to Garland ignores real-world obstacles and early moves against Trump's co-conspirators.  —  After the Supreme Court delayed consideration of Donald Trump's immunity claim until April … ",
    "url": "https://www.msnbc.com/opinion/msnbc-opinion/merrick-garland-isnt-blame-delays-trumps-election-interference-case-rcna141213"
  },
  {
    "text": "‘Done deal’: Allies say Trump aide Brian Jack would be favorite in Georgia congressional race  —  Trump posted on social media Thursday encouraging his aide to run for Congress ahead of a Friday filing deadline.  —  Former President Donald Trump is urging a longtime political aide to run … ",
    "url": "https://www.nbcnews.com/politics/2024-election/done-deal-allies-say-trump-aide-brian-jack-favorite-georgia-congressio-rcna142308"
  },
  {
    "text": "Biden announces US will build pier on Gaza shore for large-scale aid delivery  —  President lays out plans in State of the Union speech while senior US official says ‘we are not waiting on the Israelis’  —  US forces will build a temporary dock on the Gaza shoreline to allow delivery … ",
    "url": "https://www.theguardian.com/world/2024/mar/07/biden-us-port-gaza-aid-delivery"
  }
]