[
  {
    "text": "Federal judge rejects bids to halt Georgia prosecution of Trump aides over 2020 election  —  Fulton County District Attorney Fani Willis sharply rejected efforts by Mark Meadows and Jeffrey Clark to derail the criminal proceedings against them in her jurisdiction.",
    "url": "https://www.politico.com/news/2023/08/23/georgia-trump-racketeering-case-state-court-00112480"
  },
  {
    "text": "Federal Judge Refuses To Block Arrests Of Mark Meadows, Jeffrey Clark In Georgia Case  —  The former White House chief of staff and former Justice Department official separately argued to bar their arrests as they seek to move the case to federal court.  —  LOADING",
    "url": "https://www.huffpost.com/entry/jeffrey-clark-mark-meadows-requests-to-block-arrest-rejected_n_64e68f95e4b01168be1758d6"
  },
  {
    "text": "Rudy ‘Tough on Crime’ Giuliani Arrested in Georgia  —  The former lawyer for Donald Trump turned himself into authorities after being indicted for his role in the scheme to overturn the 2020 election  —  RUDY GIULIANI HAS been arrested.  —  The former New York mayor and lawyer … ",
    "url": "https://www.rollingstone.com/politics/politics-news/rudy-giuliani-arrested-georgia-1234810896/"
  },
  {
    "text": "Wagner Group leader Yevgeny Prigozhin dies in plane crash in Russia  —  Prigozhin had led a rebellion against Russian authorities earlier this year.  —  Wagner Group leader Yevgeny Prigozhin was on the passenger list of a plane that crashed in Russia's Tver region on Wednesday … ",
    "url": "https://abcnews.go.com/International/wagner-group-leader-yevgeny-prigozhin-passenger-list-plane/story?id=102497445"
  },
  {
    "text": "Russian mercenary chief and mutineer Prigozhin killed in jet crash, state media say  —  Yevgeny Prigozhin, the notorious mercenary chieftain who led a failed uprising against Russian President Vladimir Putin's government two months ago, was aboard a private jet that crashed north of Moscow … ",
    "url": "https://www.latimes.com/world-nation/story/2023-08-23/jet-crash-in-russia-kills-10-wagner-chief-prigozhin-passenger-list"
  },
  {
    "text": "The spiciest moments of the first GOP debate  —  Trump wasn't on stage.  But the debate didn't lack for intense exchanges.  —  Candidates tonight on stage are Asa Hutchinson (far left), Chris Christie, Mike Pence, Ron DeSantis, Vivek Ramaswamy, Nikki Haley, Tim Scott and Doug Burgum.",
    "url": "https://www.politico.com/news/2023/08/23/first-republican-debate-highlights-00112617"
  },
  {
    "text": "Free Lawyers!  But Big Strings Attached  —  If your boss is accused of criming, and investigators want to talk to you, here's a tip: Be wary if the company generously offers to pay for your lawyer.  —  Remember Cassidy Hutchinson, the former aide to former White House chief of staff Mark Meadows?",
    "url": "https://statuskuo.substack.com/p/free-lawyers-but-big-strings-attached"
  },
  {
    "text": "Justice Department Announces Results of Nationwide COVID-19 Fraud Enforcement Action  —  For Immediate Release  —  Department Also Announces the Launch of Two New COVID-19 Fraud Strike Forces  —  The Justice Department announced today the results of a coordinated, nationwide enforcement action … ",
    "url": "https://www.justice.gov/opa/pr/justice-department-announces-results-nationwide-covid-19-fraud-enforcement-action"
  },
  {
    "text": "Fulton County defendant was earlier charged in Md. with attacking FBI agent  —  Harrison William Prescott Floyd is accused of assaulting an agent working on Justice Department's probe of efforts to obstruct 2020 election  —  A Trump supporter indicted last week in Fulton County, Ga. … ",
    "url": "https://www.washingtonpost.com/national-security/2023/08/23/willie-floyd-fulton-maryland-fbi-arrest/"
  },
  {
    "text": "An Atlanta bail bondsman explains how he would handle Trump  —  Imagine a universe in which Donald Trump's arrest on multiple criminal charges in Atlanta does not involve his casually flying into the state Thursday and navigating the legal process from within a cocoon of attorneys.",
    "url": "https://www.washingtonpost.com/politics/2023/08/23/an-atlanta-bail-bondsman-explains-how-hed-handle-trump/"
  },
  {
    "text": "It may be time to break out the masks against Covid, some experts say  —  If you're at high risk of serious illness or death from Covid-19, it's time to dust off those N95 masks and place them snugly over your nose and mouth to protect yourself from a recent uptick of the virus, according to a growing number of experts.",
    "url": "https://www.cnn.com/2023/08/23/health/masks-covid-surge-wellness/"
  },
  {
    "text": "Emails reveal Secret Service contacts with Oath Keepers  —  Internal Secret Service emails obtained by CREW show special agents in close communication with Oath Keepers leader Stewart Rhodes, while failing to acknowledge the group's ties to white nationalists and clashes with law enforcement.",
    "url": "https://www.citizensforethics.org/reports-investigations/crew-investigations/emails-reveal-secret-service-contacts-with-oath-keepers/"
  },
  {
    "text": "Anti-LGBTQ posts by suspect in Pride flag-related killing don't violate rules, X says  —  The shooter's apparent account was reported by a user on Tuesday, about 24 hours after the shooter was named by police.  —  Gunman identified in deadly dispute over LGBTQ Pride flag",
    "url": "https://www.nbcnews.com/nbc-out/out-news/pride-flag-suspect-twitter-rules-rcna101492"
  },
  {
    "text": "Some MAGA fans think a pro-Trump rally outside the Atlanta jail is an FBI setup  —  “Watch out for the FBI and antifa/blm to stir up a riot,” wrote one social media user, responding to former President Donald Trump's post about Thursday's rally.  —  WASHINGTON — After basking in conspiracy theories … ",
    "url": "https://www.nbcnews.com/politics/justice-department/maga-fans-think-trump-rally-atlanta-jail-fbi-setup-rcna101518"
  },
  {
    "text": "Democrats and Republicans deeply divided on extreme weather, Post-UMD poll finds  —  Partisans remain split on climate change contributing to more disasters, and on their weather becoming more extreme  —  Nearly 150 million Americans were under heat alerts Tuesday, after July marked the planet's hottest month on record.",
    "url": "https://www.washingtonpost.com/climate-environment/2023/08/23/extreme-weather-climate-change-poll/"
  },
  {
    "text": "'We're Winning': Apple Formally Endorses Right to Repair Legislation After Spending Millions Fighting It  —  In a letter from its lobbyist, Apple ‘urges’ California lawmakers to pass the strongest right-to-repair law in the country.  —  Apple told a California legislator that it is formally supporting … ",
    "url": "https://www.404media.co/apple-endorses-california-right-to-repair-bill/"
  },
  {
    "text": "A Trump appointee argues in dissent that OSHA's workplace rules are unconstitutional  —  Judge Nalbandian wrote that “today” was the day to end OSHA.  The Sixth Circuit majority disagreed, but big-name legal conservatives want OSHA gone.  —  On Wednesday morning, the U.S. Court of Appeals … ",
    "url": "https://www.lawdork.com/p/nalbandian-osha-workplace-rules-dissent"
  },
  {
    "text": "Chris Christie hit with ‘lots of boos’ after GOP debate introduction  —  Former Arkansas Gov. Asa Hutchinson also heard boos when he was announced  —  Former New Jersey Gov. Chris Christie was noticeably booed by the crowd after he was introduced as a participant in Wednesday night's first presidential debate.",
    "url": "https://www.foxnews.com/politics/chris-christie-hit-lots-boos-gop-debate-introduction"
  },
  {
    "text": "Fury at Michigan officials charged in 2020 false electors scheme: 'This isn't who we are'  —  State Republican lawmakers who allegedly signed on as Trump's false electors in 2020 face anger, prosecution and recall  —  The fight for democracy is supported by",
    "url": "https://www.theguardian.com/us-news/2023/aug/23/michigan-false-electors-trump-state-republicans"
  },
  {
    "text": "How Fox News Plans to Have Trump ‘Appear’ at Its GOP Debate  —  The network has found a way to ensure Trump is a part of their highly touted debate, even if he doesn't physically participate.  —  Donald Trump, the Republican 2024 frontrunner and quadruply indicted former president … ",
    "url": "https://www.thedailybeast.com/how-fox-news-plans-to-have-trump-appear-at-its-gop-debate"
  }
]