[
  {
    "text": "How to Avoid Utter Embarrassment at the Iowa State Fair, as a Presidential Candidate  —  Political hopefuls find the annual fair can be an obstacle course.  Don't flip the pork chops too fast, watch out for the corn dogs.  —  DES MOINES, Iowa—Republican presidential hopefuls … ",
    "url": "https://www.wsj.com/articles/iowa-state-fair-campaign-corn-dog-presidential-candidate-ec9a6680?mod=djemalertNEWS"
  },
  {
    "text": "Racing to Stop Trump, Republicans Descend on a Strange New Iowa  —  As the state fair and its Republican pageantry begin, Donald Trump's rivals face a transformed political environment in Iowa, where he holds a comfortable edge in polls despite rarely visiting.",
    "url": "https://www.nytimes.com/2023/08/10/us/politics/trump-republicans-iowa-state-fair.html"
  },
  {
    "text": "‘Derogatory and false’: Fulton DA denies rumors circulated by Trump  —  Fani Willis expected to seek indictment against Trump in week ahead  —  X  —  Fulton County District Attorney Fani Willis on Wednesday flatly denied that she had a relationship with a former client and other rumors spread … ",
    "url": "https://www.ajc.com/politics/derogatory-and-false-fulton-da-denies-rumors-circulated-by-trump/YSB6RC7KXZG25COURJFHDA5SGM/"
  },
  {
    "text": "Pelosi reemerges as top Trump adversary  —  Rep. Nancy Pelosi is off the bench as former President Trump's top adversary on Capitol Hill.  —  After stepping down as Speaker last year, Pelosi (D-Calif.) has flown largely under the radar in the Democratic caucus, allowing a crop of new leaders … ",
    "url": "https://thehill.com/homenews/house/4146274-pelosi-trump-adversary/"
  },
  {
    "text": "Clarence Thomas' 38 Vacations: The Other Billionaires Who Have Treated the Supreme Court Justice to Luxury Travel  —  Co-published with CNN  —  Friends of the Court: SCOTUS Justices' Beneficial Relationships With Billionaire Donors  —  Supreme Court Justice Clarence Thomas' decadeslong friendship … ",
    "url": "https://www.propublica.org/article/clarence-thomas-other-billionaires-sokol-huizenga-novelly-supreme-court"
  },
  {
    "text": "Anti-corruption presidential candidate slain at campaign event in Ecuador's capital  —  An Ecuadorian presidential candidate known for speaking up against corruption was shot and killed Wednesday at a political rally in the capital, an attack that comes amid a wave of startling violence in the South American country.",
    "url": "https://apnews.com/article/ecuador-villavicencio-presidential-candidate-killed-ee9c726b82c09e16e5dacde2d6f005ff"
  },
  {
    "text": "Ecuador Presidential Candidate Assassinated, Suspect Shot Dead  — Anti-graft campaigner murdered less than two weeks before vote  — Soaring violence has made Ecuador more violent than Colombia  —  Ecuador presidential candidate Fernando Villavicencio, a journalist known for his crusade … ",
    "url": "https://www.bloomberg.com/news/articles/2023-08-10/ecuador-presidential-candidate-villavicencio-shot-dead-expreso"
  },
  {
    "text": "The truth about Monique Worrell  —  On November 3, 2020, Monique Worrell (D) was elected state's attorney in Florida's 9th Judicial District, which includes Orange and Osceola counties.  Worrell won in resounding fashion, collecting 395,979 votes and defeating her opponent by a two-to-one margin.",
    "url": "https://popular.info/p/the-truth-about-monique-worrell"
  },
  {
    "text": "Man killed during FBI raid in connection with threats against Biden, other officials  —  The Utah man was shot and killed during an FBI raid early Wednesday morning.  —  A Utah man was shot and killed during an FBI raid early Wednesday morning, the FBI confirmed to ABC News.",
    "url": "https://abcnews.go.com/Politics/man-killed-fbi-raid-connection-threats-biden-officials/story?id=102138966"
  },
  {
    "text": "The Montgomery Brawl Was, for Some, a Clarifying Moment  —  The Alabama Sweet Tea Party.  —  That was one nickname people gave to a brawl this past Saturday on a Montgomery, Ala., riverfront dock, captured in viral videos, after a group of white people attacked Damien Pickett … ",
    "url": "https://www.nytimes.com/2023/08/09/opinion/montgomery-brawl.html"
  },
  {
    "text": "Maui fires live updates: 6 dead as thousands flee ‘unprecedented’ disaster … Former President Barack Obama and first lady Michelle are thinking of all those affected by the wildfires in the state of Hawaii, and shared a way to help with his more than 131 million followers on social media.",
    "url": "https://www.nbcnews.com/news/us-news/live-blog/maui-fires-live-updates-thousands-flee-unprecedented-disaster-rcna99164"
  },
  {
    "text": "GOP Candidate Plagiarized Massive Segments of His College Thesis  —  Controversial GOP congressional candidate Anthony Sabatini appears to have lifted massive segments of his college thesis from Wikipedia and gotten away with it—until now. … Right-wing Florida Republican congressional … ",
    "url": "https://www.thedailybeast.com/gop-candidate-anthony-sabatini-plagiarized-massive-segments-of-his-college-thesis"
  },
  {
    "text": "July CPI report shows inflation gauge rose 3.2%, less than expected  —  WATCH NOW  —  Inflation gauge rose 3.2% annually in July, less than expected  —  The consumer price index rose 3.2% from a year ago in July, a sign that inflation has lost at least some of its grip on the U.S. economy.",
    "url": "https://www.cnbc.com/2023/08/10/cpi-inflation-july-2023-.html"
  },
  {
    "text": "Major gun safety groups endorse Biden reelection bid  —  A slew of major anti-gun violence groups are throwing their weight behind President Biden's reelection bid, his campaign announced Thursday.  —  Brady, Everytown for Gun Safety Action Fund, Moms Demand Action and Students Demand Action … ",
    "url": "https://thehill.com/homenews/campaign/4146880-major-gun-safety-groups-endorse-biden-reelection-bid/"
  },
  {
    "text": "Abortion setback in Ohio alarms GOP, as Democrats see a ‘roadmap for 2024’  —  Trump's former campaign manager warns abortion could provide “rocket fuel” to Biden's re-election bid.  A Democratic pollster says it will motivate voters “as long as sex is salient.”",
    "url": "https://www.nbcnews.com/politics/2024-election/abortion-setback-ohio-alarms-gop-democrats-see-roadmap-2024-rcna99029"
  },
  {
    "text": "Rewild the National Mall  —  Mr. Nazaryan is a writer and gardener.  —  I recently committed an act of sabotage at one of the most revered landmarks in the United States, a transgression against my relatively new home of Washington, D.C. Walking across the National Mall … ",
    "url": "https://www.nytimes.com/2023/08/10/opinion/national-mall-wildflower-meadow.html"
  },
  {
    "text": "Exclusive: A veteran FBI agent told Congress that investigations into Giuliani and other Trump allies were suppressed  — An FBI veteran said his superiors suppressed investigations of Trump, Insider can exclusively reveal.  — “Are we going to do public corruption or not?” the whistleblower said to Insider.",
    "url": "https://www.businessinsider.com/fbi-whistleblower-senate-judiciary-russia-giuliani-leak-trump-allies-fuks-biden-2023-8?op=1"
  },
  {
    "text": "Special counsel obtained search warrant for Donald Trump's Twitter account  —  Twitter's initial resistance to complying with the warrant resulted in a federal judge holding the company in contempt and levying a $350,000 fine.  —  Special Counsel Jack Smith sought and obtained a search warrant … ",
    "url": "https://www.politico.com/news/2023/08/09/special-counsel-obtained-search-warrant-for-donald-trumps-twitter-account-00110484"
  }
]