[
  {
    "text": "Fani Willis admits relationship with prosecutor on Trump Georgia case  —  ATLANTA — Fulton County District Attorney Fani T. Willis (D) admitted she had a personal relationship with an outside prosecutor she appointed to manage the election interference case against former president Donald Trump … ",
    "url": "https://www.washingtonpost.com/national-security/2024/02/02/fani-willis-response-accusations/"
  },
  {
    "text": "Fani Willis, the DA who charged Trump in Georgia, subpoenaed by House GOP  —  House Judiciary Committee Chairman Jim Jordan says Fulton County District Attorney Fani Willis has failed to comply with two earlier requests for documents.  —  WASHINGTON — House Judiciary Committee Chairman Jim Jordan … ",
    "url": "https://www.nbcnews.com/politics/congress/fani-willis-da-charged-trump-georgia-subpoenaed-house-gop-rcna136683"
  },
  {
    "text": "Fani Willis' court filing confirms romantic relationship with lawyer on Trump case but denies any conflict  —  Lawyers for Fulton County District Attorney Fani Willis are preparing to formally acknowledge in a court filing that she had a romantic relationship with lawyer Nathan Wade … ",
    "url": "https://www.cbsnews.com/news/fani-willis-filing-confirms-romantic-relationship-denies-conflict/"
  },
  {
    "text": "Behind the Curtain: Trump's conviction scenario  —  Former President Trump is breezing to the GOP nomination — but, in private, is bracing for the genuine possibility that he'll be the first convicted felon in U.S. history to represent a major party.",
    "url": "https://www.axios.com/2024/02/02/trump-conviction-trial-jan-6-court"
  },
  {
    "text": "Trump D.C. trial drops off court's March calendar, clearing way for N.Y. case  —  Administrative move comes as anticipation mounts over how — and when — an appeals court will decide former president's claim of immunity from criminal prosecution  —  Former president Donald Trump's March 4 trial date … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2024/02/01/trump-trial-calendar-jan-6-delay/"
  },
  {
    "text": "Roberta Kaplan says Trump threw papers across table at Mar-a-Lago deposition because his legal team agreed to feed her lunch  —  Attorney Roberta Kaplan said former President Donald Trump threw papers across a table and stormed off during a deposition at Mar-a-Lago after learning that his legal team had agreed to provide her lunch.",
    "url": "https://www.cnn.com/2024/02/01/politics/roberta-kaplan-donald-trump-deposition-maralago/"
  },
  {
    "text": "He Was Accused of Sexual Misconduct.  Then Trump Hired Him.  Then He Was Indicted in Mar-a-Lago Case.  —  Trump body man Walt Nauta is a critical figure in the Mar-a-Lago documents case.  Trump only hired him after Nauta was dismissed from the White House after sexual harassment claims.",
    "url": "https://www.thedailybeast.com/walt-nauta-was-accused-of-sexual-misconduct-then-trump-hired-him-then-he-was-indicted-in-mar-a-lago-case"
  },
  {
    "text": "U.S. Voters: Biden, Most in House Don't Deserve Another Term  —  WASHINGTON, D.C. — Fewer than four in 10 U.S. registered voters say President Joe Biden deserves to be reelected, while less than a quarter say the same about most members of the U.S. House.  As is almost always the case … ",
    "url": "https://news.gallup.com/poll/609602/voters-biden-house-don-deserve-term.aspx"
  },
  {
    "text": "Biden's ‘holy grail’ economy  —  The strong job market, coupled with the end of price spikes, counters Republicans' campaign message that the economy is weakening.  —  The blowout job growth in January adds fuel to President Joe Biden's pitch to voters that the economy is solidly recovering under his watch.",
    "url": "https://www.politico.com/news/2024/02/02/biden-jobs-economy-00139282"
  },
  {
    "text": "New report points to blockbuster U.S. job growth as 2024 begins  —  By every metric, the latest jobs report points to an incredibly strong U.S. job market.  The political implications have the potential to be dramatic.  —  Expectations heading into this morning showed projections … ",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/new-report-points-blockbuster-us-job-growth-2023-begins-rcna136921"
  },
  {
    "text": "Trump Is Inching Closer to the Worst Legal Defeat of his Life  —  It sure looks like Trump's business empire is about to get hammered.  —  Former President Donald Trump has suffered through plenty of painful courtroom defeats during his lengthy career as one of America's most litigious businessmen.",
    "url": "https://www.vice.com/en/article/g5yn8x/trump-is-inching-closer-to-the-worst-legal-defeat-of-his-life"
  },
  {
    "text": "Inside Biden's obsession with “Morning Joe”  —  When White House aides appear on MSNBC's “Morning Joe,” they're often booked between 7 and 7:40 a.m. ET.  That's so they'll reach one crucial and loyal viewer: President Biden. … - During the day, Biden has long asked his staff whether they saw a story … ",
    "url": "https://www.axios.com/2024/02/02/biden-obsession-morning-joe-msnbc-media"
  },
  {
    "text": "Joe Rogan Gets New Spotify Deal Worth Up to $250 Million  —  Hit show to be distributed broadly, including on YouTube, rather than exclusively on audio-streaming service  —  Spotify has reached a new deal with star podcaster Joe Rogan that will allow his hit show to be distributed broadly.",
    "url": "https://www.wsj.com/business/media/joe-rogan-podcast-spotify-deal-28eb5f74?mod=followamazon"
  },
  {
    "text": "Still Waiting  —  It's 8:53 p.m. Central Time as I pick up my pen to write tonight.  Neither Judge Engoron's final decision in the New York civil fraud case nor the long-awaited presidential immunity opinion from the Court of Appeals for the District of Columbia has materialized.  We are still waiting.",
    "url": "https://joycevance.substack.com/p/still-waiting"
  },
  {
    "text": "Inflation has fallen.  Why are groceries still so expensive?  —  Ongoing supply chain disruptions, droughts, avian flu, labor shortage and more continue to keep grocery prices high  —  Americans are finally getting a break from inflation, with prices for gasoline, used cars and health insurance … ",
    "url": "https://www.washingtonpost.com/business/2024/02/02/grocery-price-inflation-biden/"
  },
  {
    "text": "Andy Kim leads Tammy Murphy by double digits in NJ Senate race, poll says  —  The race to replace Bob Menendez is a test of the Garden State's unique party boss system.  —  Rep. Andy Kim is the leading candidate for Senate in New Jersey, with a double-digit lead over his chief rival … ",
    "url": "https://www.politico.com/news/2024/02/02/poll-andy-kim-tammy-murphy-00139064"
  },
  {
    "text": "Republicans Want New Hampshire to Leave United States  —  A growing number of conservatives are pushing for New Hampshire to secede from the union.  —  The New Hampshire House will soon consider CACR 20 and House Bill 1130, which in part call for the state to become independent from the rest of the United States.",
    "url": "https://www.newsweek.com/republicans-want-new-hampshire-leave-united-states-1866130"
  },
  {
    "text": "Ryan Samsel, Jan. 6 defendant who instigated breach, convicted of multiple felonies  —  Samsel and four others were convicted of participating in the “civil disorder” wrought by the mob and of assaulting police officers.  —  The Jan. 6 defendant widely seen as the instigator of the violent breach … ",
    "url": "https://www.politico.com/news/2024/02/02/ryan-samsel-jan-6-defendant-00139344"
  }
]