[
  {
    "text": "Fear and loathing grips the House GOP  —  While Republicans appear to be turning next to Jim Jordan, some are already airing open doubts that he can pull off what the majority leader couldn't.  —  The House GOP has entered an angrier and more bewildered phase in its leadership crisis.",
    "url": "https://www.politico.com/news/2023/10/13/republicans-speaker-mccarthy-jim-jordan-00121370"
  },
  {
    "text": "Bipartisan talk grows as GOP fails to find a speaker  —  Lawmakers in both parties are expressing growing openness, both in public and in private, to a bipartisan deal to elect a House speaker as Republicans are continually thwarted in their efforts to do it alone.",
    "url": "https://www.axios.com/2023/10/13/house-speaker-bipartisan-deal-votes"
  },
  {
    "text": "House GOP in total chaos: So much for fascist order and discipline!  —  Aren't far-right movements supposed to make the trains run on time?  GOP can't elect a speaker from its own tribe  —  Nearly eight decades after the end of World War II, the thing we ought to understand most clearly … ",
    "url": "https://www.salon.com/2023/10/13/in-total-chaos-so-much-for-fascist-order-and-discipline/"
  },
  {
    "text": "House GOP rejects — again — bid to avoid messy speaker fight on the floor  —  Rep. Jim Jordan (R-Ohio) is now the only declared candidate for the GOP's nod, but he remains short of the support needed to win.",
    "url": "https://www.politico.com/live-updates/2023/10/13/congress/another-no-to-217-00121438"
  },
  {
    "text": "Will Narcissist Trump's Bizarre Praise for Hezbollah Hurt Him?  —  DONALD TRUMP HAS DEMONSTRATED YET AGAIN that he is a man without a single ounce of human decency.  At an event in West Palm Beach on Wednesday night, just four days after Hamas's brutal attack on Israeli civilians, Trump did the unthinkable.",
    "url": "https://plus.thebulwark.com/p/narcissist-trumps-bizarre-praise-hezbollah"
  },
  {
    "text": "Fraudster freed from prison by Trump faces prosecution under Biden  —  Philip Esformes received clemency from Trump in the final weeks of his presidency after well-connected supporters pushed for his release.  —  Philip Esformes beat the system.  Or so it seemed.",
    "url": "https://www.washingtonpost.com/politics/2023/10/13/trump-pardon-philip-esformes-biden-justice-department/"
  },
  {
    "text": "Donald Trump's Israeli War Insight  —  He attacks Netanyahu in a crisis because of old personal grudges.  —  The front-runner for the GOP presidential nomination for some reason used the words “smart” and “Hezbollah” in the same sentence on Wednesday night.",
    "url": "https://www.wsj.com/articles/donald-trump-israel-benjamin-netanyahu-hezbollah-gaza-hamas-54a426c8?mod=followamazon"
  },
  {
    "text": "Israel orders unprecedented evacuation of 1 million in Gaza as possible ground offensive looms  —  Gaza's energy crisis risk hospitals turning into morgues  —  Israel Defense Forces release footage of assault on Gaza-adjacent outpost  —  Israel's military told some 1 million Palestinians … ",
    "url": "https://apnews.com/article/israel-palestinians-gaza-hamas-war-c8b4fc20e4fd2ef381d5edb7e9e8308c"
  },
  {
    "text": "Hamas practiced in plain sight, posting video of mock attack weeks before border breach  —  Less than a month before Hamas fighters blew through Israel's high-tech “Iron Wall” and launched an attack that would leave more than 1,200 Israelis dead, they practiced in a very public dress rehearsal.",
    "url": "https://apnews.com/article/israel-palestinian-war-hamas-attack-border-wall-aa0b0f5f3613b6c6882cf37168e8e8ed"
  },
  {
    "text": "October 12, 2023  —  We are in a bizarre moment.  —  If the U.S. government were operating within its normal parameters, my first story tonight would be about new federal charges that Senator Bob Menendez (D-NJ) was acting as an agent of Egypt while chairing the Senate Foreign Relations Committee.",
    "url": "https://heathercoxrichardson.substack.com/p/october-12-2023"
  },
  {
    "text": "Top DOJ prosecutor in DC refutes claim that he blocked Hunter Biden tax charges in his district  —  In recent closed-door testimony to Congress, the top-ranking Justice Department prosecutor in Washington, DC, refuted claims from two Internal Revenue Service whistleblowers … ",
    "url": "https://www.cnn.com/2023/10/13/politics/matthew-graves-hunter-biden-testimony/"
  },
  {
    "text": "Supreme Court Justices Avoid Falling Chunk Of Marble In Courtyard  —  Democratic institutions in D.C. are literally crumbling, apparently.  —  LOADING  —  The Supreme Court avoided a catastrophic accident last year when a piece of marble at least 2 feet long crashed to the ground … ",
    "url": "https://www.huffpost.com/entry/supreme-court-falling-chunk-of-marble_n_65293963e4b03ea0c004c463"
  },
  {
    "text": "How the conspiracy-fueled Epoch Times went mainstream and made millions  —  The conservative news outlet has amassed a fortune, growing its revenue by 685% in two years, according to tax documents.  —  In the runup to the 2020 election, a small news organization saw an opportunity.",
    "url": "https://www.nbcnews.com/news/us-news/epoch-times-falun-gong-growth-rcna111373"
  },
  {
    "text": "Jack Smith tells Trump to put up or shut up  —  Smith's demand that Trump and his lawyers clarify his strategy is important because an affirmative defense would trigger two significant consequences  —  Jack Smith is asking former President Donald Trump to put his money where his mouth is.",
    "url": "https://www.msnbc.com/opinion/msnbc-opinion/trump-jack-smith-2020-election-interference-defense-rcna120166"
  },
  {
    "text": "Gov. DeSantis signs executive order authorizing rescue of Floridians stranded in Israel: ‘Help is on the way’  —  Hundreds of U.S. families are believed to be stranded in Israel  —  Florida Gov. Ron DeSantis signed an executive order on Thursday authorizing planes from his state … ",
    "url": "https://www.foxnews.com/politics/gov-desantis-signs-executive-order-authorizing-rescue-floridians-stranded-israel"
  }
]