[
  {
    "text": "Republicans are trying to find a new term for ‘pro-life’ to stave off more electoral losses  —  Sen. Todd Young, R-Ind., summarized the closed-door meeting on Capitol Hill as being focused on “pro-baby policies.”  —  WASHINGTON — Republican strategists are exploring a shift away from … ",
    "url": "https://www.nbcnews.com/politics/congress/republicans-try-find-new-term-life-stave-electoral-losses-rcna103924"
  },
  {
    "text": "Kristi Noem is suddenly front-and-center in the veepstakes  —  The South Dakota governor will appear with Donald Trump at an event in Rapid City on Friday.  —  Not long ago, it looked like Kristi Noem's star was flaming out.  Following a turbulent first term, the South Dakota governor elected … ",
    "url": "https://www.politico.com/news/2023/09/08/kristi-noem-veepstakes-00114586"
  },
  {
    "text": "Trump Adviser Peter Navarro Was Convicted, Really Fast, of Contempt of Congress  —  “Executive privilege” is not a magical incantation.  —  Donald Trump and many of his acolytes take the position that the words “executive privilege” are more or less magic.",
    "url": "https://www.motherjones.com/politics/2023/09/peter-navarro-verdit-contempt-congress/"
  },
  {
    "text": "Trump overstated net worth by up to $3.6 billion per year, NY AG alleges in new filing  — Former President Donald Trump's net worth was inflated by billions of dollars per year more than what he claimed, the New York attorney general's office alleged in a new court filing.",
    "url": "https://www.cnbc.com/2023/09/08/trump-overstated-net-worth-by-up-to-3point6-billion-per-year-ny-ag-alleges-in-new-filing.html"
  },
  {
    "text": "Willis blasts congressman's ‘interference’ in Fulton Trump probe  —  X  —  Fulton County District Attorney Fani Willis Thursday blasted a congressman who has pledged to investigate her handling of an indictment of former President Donald Trump and others.  —  U.S. Rep. Jim Jordan … ",
    "url": "https://www.ajc.com/politics/willis-blasts-congressmans-interference-in-fulton-trump-probe/IU5USCA3H5A3RJKTMT2WFCL3VU/"
  },
  {
    "text": "Climate protester glues feet to floor, interrupting US Open semifinal between Gauff and Muchova  —  The U.S. Open semifinal between Coco Gauff and Karolina Muchova was delayed by 50 minutes because of a disruption by environmental activists in the Arthur Ashe Stadium stands on Thursday night.",
    "url": "https://apnews.com/article/us-open-delay-women-semifinals-gauff-muchova-00a82f465076adea36b098aa6ca08a0d"
  },
  {
    "text": "Another Christian influencer arrested for child abuse: Why conservatives keep falling for these cons  —  Ruby Franke was yet another Duggar knock-off, putting a shiny happy gloss on religious oppression  —  In many ways, it's the least surprising story of our times: A showily Christian … ",
    "url": "https://www.salon.com/2023/09/08/another-christian-influencer-arrested-for-child-abuse-why-conservatives-keep-falling-for-these-cons/"
  },
  {
    "text": "DeSantis voiced complaints about top super PAC strategist, people familiar with comments say  —  The Florida governor and White House hopeful was “apoplectic” over a pre-debate strategy memo publicly posted on the website of Jeff Roe's firm, according to one person familiar with the comments",
    "url": "https://www.washingtonpost.com/politics/2023/09/08/ron-desantis-super-pac-debate/"
  },
  {
    "text": "Federal appeals court says Texas' floating barriers can remain in Rio Grande for now  —  The 5th US Circuit Court of Appeals issued a temporary stay Thursday night allowing the state of Texas to keep floating barriers in the Rio Grande.  —  A lower court judge had ordered Texas … ",
    "url": "https://www.cnn.com/2023/09/07/politics/texas-water-barriers-migrants-appeal/"
  },
  {
    "text": "Trump Hates Hillary Clinton.  He Might Hate This Judge More.  —  Donald Trump's revenge lawsuit against Hillary Clinton has turned into a retaliatory plot against a judge he has history with.  And now he's testing his ability to target judges.  —  Donald Trump is still so bitter … ",
    "url": "https://www.thedailybeast.com/trump-hates-hillary-clinton-he-might-hate-this-judge-more"
  },
  {
    "text": "Press Forward Will Award More Than $500 Million to Revitalize Local News  —  A national coalition of donors catalyzes local news and information for stronger communities.  —  A coalition of 22 donors today announced Press Forward, a national initiative to strengthen communities and democracy … ",
    "url": "https://www.macfound.org/press/press-releases/press-forward-will-award-more-than-500-million-to-revitalize-local-news"
  },
  {
    "text": "Justice Kavanaugh says ethics changes may be coming to Supreme Court  —  CLEVELAND — Justice Brett M. Kavanaugh said Thursday that he is “hopeful” the Supreme Court soon will take specific steps to deal with ethics issues at the court and boost public confidence in the institution.",
    "url": "https://www.washingtonpost.com/politics/2023/09/07/justice-kavanaugh-ethics-supreme-court/"
  },
  {
    "text": "I.R.S. Deploys Artificial Intelligence to Target Rich Partnerships  —  The tax agency is opening examinations into large hedge funds, private equity groups, real estate investors and law firms.  —  The Internal Revenue Service has started using artificial intelligence to investigate tax evasion … ",
    "url": "https://www.nytimes.com/2023/09/08/us/politics/irs-deploys-artificial-intelligence-to-target-rich-partnerships.html"
  },
  {
    "text": "Disney drops all but free speech claim in political retaliation suit against DeSantis  —  Disney on Thursday amended its federal lawsuit against Florida Gov. Ron DeSantis to focus solely on its First Amendment claim that the governor politically retaliated against the company.",
    "url": "https://www.cnbc.com/2023/09/07/disney-drops-all-but-free-speech-claim-in-political-retaliation-suit-against-desantis.html"
  },
  {
    "text": "Trump hosts $100,000-per-person Bedminster fundraiser to help Giuliani pay legal bills  —  Former President Donald Trump hosted a $100,000-a-plate fundraiser for disgraced former New York Mayor Rudy Giuliani at his Bedminster, New Jersey, golf club Thursday night as Giuliani struggles to pay his mounting legal bills.",
    "url": "https://apnews.com/article/trump-rudy-giuliani-fundraiser-bedminster-27724c04738a9d47114c3ea50b88b2ee"
  },
  {
    "text": "The Supreme Court's Fake Praying Coach Case Just Got Faker  —  Last year, the Supreme Court ruled in favor of high school football coach's right to engage in “brief, quiet, personal” prayer—despite photographic evidence that his prayers were drawn-out, loud, and extremely public.",
    "url": "https://slate.com/news-and-politics/2023/09/supreme-court-praying-coach-joe-kennedy-fake.html"
  },
  {
    "text": "The surprisingly strong constitutional case for Trump's disqualification  —  The 14th Amendment is quite clear that insurrectionists can't hold office.  —  ∙ Paid … Citizens for Responsibility and Ethics in Washington (CREW) sued earlier this week to keep Donald Trump off the presidential ballot in Colorado.",
    "url": "https://www.publicnotice.co/p/trump-14th-amendment-section-3-disqualified-crew"
  },
  {
    "text": "Prospect of Hunter Biden indictment and impeachment casts shadow over White House  —  Hunter Biden being indicted on an amended gun charge by the end of this month will complicate President Joe Biden's reelection campaign, particularly if there is a trial.  —  But how deeply Hunter Biden becomes … ",
    "url": "https://www.washingtonexaminer.com/news/white-house/hunter-biden-indictment-joe-biden-campaign"
  },
  {
    "text": "Unredacted Final Report From Georgia Special Grand Jury Set for Release on Friday  —  The report includes the recommendation for Fulton County District Attorney Fani Willis to charge on related attempts to overturn the 2020 election  —  A Facebook icon representing an external link to share … ",
    "url": "https://themessenger.com/politics/unredacted-final-report-from-georgia-special-grand-jury-set-for-release-on-friday"
  },
  {
    "text": "Wisconsin Republicans Try to Subvert Democracy, Again  —  For a little while this year, it looked as though Wisconsin voters had finally broken out of the straitjacket of minority rule in their state.  The key to their freedom was an April State Supreme Court election that … ",
    "url": "https://www.nytimes.com/2023/09/08/opinion/wisconsin-supreme-court-impeach.html"
  },
  {
    "text": "The GOP Is Losing the Doctor Vote in Pennsylvania.  Will the Party Flatline in 2024?  —  A political realignment around health care is reshaping state politics.  —  Animation by Kate Dehler for POLITICO  —  DERRY TOWNSHIP, Pa. —  Here in Hershey, the once-sleepy south-central Pennsylvania town built … ",
    "url": "https://www.politico.com/news/magazine/2023/09/08/pennsylvania-medical-establishment-gop-00114316"
  },
  {
    "text": "Biden's Cabinet members told the White House they plan to stay for his full term  —  White House chief of staff Jeff Zients told all Cabinet members he wanted to know by the end of the summer whether they'll stay through next year.  —  WASHINGTON — Earlier this summer … ",
    "url": "https://www.nbcnews.com/politics/white-house/bidens-cabinet-members-told-white-house-plan-stay-put-rcna103927"
  }
]