[
  {
    "text": "House Republicans: No Aid for Israel Unless Rich Tax Cheats Get a Break … A few years ago, Representative Mike Johnson, now Speaker of the House, told an audience that democracy is bad.  “By the way, the United States is not a democracy,” he explained.  “Do you know what a democracy is?",
    "url": "https://nymag.com/intelligencer/2023/10/house-gop-no-israel-aid-unless-rich-tax-cheats-get-a-break.html"
  },
  {
    "text": "Johnson's Israel funding showdown with Biden, Democrats — and Senate Republicans  —  The House bill does not include Ukraine aid and slashes IRS funding.  —  Speaker of the House Mike Johnson (R-LA) gives a brief statement to reporters about the mass shooting in Lewiston … ",
    "url": "https://abcnews.go.com/Politics/johnsons-israel-funding-showdown-biden-democrats-senate-republicans/story?id=104517753"
  },
  {
    "text": "Major national outlets adopt House GOP spin to protect rich tax cheats  —  Several major national news outlets are promoting House Republicans' deceptive spin as the party seeks to leverage emergency funding for Israel to enact its top priority of protecting wealthy tax cheats.",
    "url": "https://www.mediamatters.org/joe-biden/major-national-outlets-adopt-house-gop-spin-protect-rich-tax-cheats"
  },
  {
    "text": "Israel strikes Gaza's Jabalya refugee camp  —  An Israeli strike targeting a Hamas commander in the densely populated Jabalya refugee camp in northern Gaza has left catastrophic damage and killed a large number of people, according to eyewitnesses and medics in the enclave.",
    "url": "https://www.cnn.com/2023/10/31/middleeast/jabalya-blast-gaza-intl/"
  },
  {
    "text": "Israeli forces battle Hamas around Gaza City, as military says 800,000 have fled south  —  Israel advances in Gaza as Netanyahu rejects cease-fire  —  Israel rescues soldier held hostage by Hamas  —  A flurry of Israeli airstrikes Tuesday on a refugee camp near Gaza City leveled apartment buildings … ",
    "url": "https://apnews.com/article/israel-palestinians-hamas-gaza-war-news-10-31-2023-54ab6bd7f6861be86266770c245827e1"
  },
  {
    "text": "Desperate search for survivors after Gaza refugee camp is hit in Israeli airstrike  —  The Israeli military said it killed a senior Hamas commander who helped plot the Oct. 7 terrorist attack.  —  Desperate Palestinians were using their bare hands Tuesday to retrieve bodies buried in the ruins … ",
    "url": "https://www.nbcnews.com/news/world/desperate-search-survivors-gaza-refugee-camp-hit-israeli-airstrike-rcna123040"
  },
  {
    "text": "‘Wake Up, It Is a Time to Be Concerned’: FBI Director Wray Issues Stark Warning at Committee Hearing  —  In a Senate Homeland Security Committee hearing on Tuesday, FBI Director Christopher Wray provided some worrying — if not outright alarming — answers to questions from U.S. Senator Rick Scott … ",
    "url": "https://townhall.com/tipsheet/spencerbrown/2023/10/31/fbi-director-wray-it-is-a-time-to-be-concerned-about-terrorism-in-the-us-n2630588"
  },
  {
    "text": "Muslim Democrats give Biden ultimatum: Israel ceasefire by 5 or battleground states turn ‘red’  —  The National Muslim Democratic Council, a nationwide group of Democratic leaders and activists, threatened President Joe Biden that if he does not force Israel to reach a ceasefire with Hamas … ",
    "url": "https://justthenews.com/politics-policy/elections/muslim-democrats-give-biden-ultimatum-israel-ceasefire-5-or-battleground"
  },
  {
    "text": "3 Expert Shoemakers Say Ron DeSantis Is Probably Wearing Height Boosters  —  The internet has questions about the governor's boots.  So I asked the experts.  —  In the last few weeks, posts mocking Florida Gov. Ron DeSantis' strangely shaped cowboy boots have racked up millions of views … ",
    "url": "https://www.politico.com/news/magazine/2023/10/31/desantis-boots-shoemakers-00121044"
  },
  {
    "text": "Durbin, Whitehouse Announce Vote to Authorize Subpoenas for Crow, Leo, and Arkley Related to Supreme Court Ethics Reform in Judiciary Committee  —  “The Supreme Court is in an ethical crisis of its own making.  Thanks to investigative reporting, we now know that for decades … ",
    "url": "https://www.judiciary.senate.gov/press/releases/durbin-whitehouse-announce-vote-to-authorize-subpoenas-for-crow-leo-and-arkley-related-to-supreme-court-ethics-reform-in-judiciary-committee"
  },
  {
    "text": "Kinzinger says family disowned him over loss of Hannity's trust  —  Former Rep. Adam Kinzinger (R-Ill.) said he was disowned by his family after he left Congress and “lost the trust” of Fox News host Sean Hannity.  —  “So, I had family that sent a certified letter disowning me,” Kinzinger said in a CNN interview Monday.",
    "url": "https://thehill.com/homenews/4285023-adam-kinzinger-family-disowned-sean-hannity/"
  },
  {
    "text": "Mike Johnson Has a Dangerous Victim Complex  —  “Christ calls us to be ‘wise as serpents and harmless as doves,’” wrote Mike Johnson on a Creationist website in 2015.  Johnson, who became speaker of the House last week, was counseling his fellow Christians on how to live in a new and … ",
    "url": "https://newrepublic.com/article/176509/mike-johnson-dangerous-victim-complex"
  },
  {
    "text": "Speaker Johnson taps veteran GOP operative as chief spokesperson  —  Raj Shah previously spent four years as senior vice president for public affairs at Fox Corporation.",
    "url": "https://www.politico.com/live-updates/2023/10/31/congress/johnsons-comms-hire-00124592"
  },
  {
    "text": "White House: Saudi Arabia is still interested in pursuing mega-deal  —  Saudi Arabia assured the Biden administration that the kingdom is still interested in pursuing an agreement that would normalize relations with Israel after the war in Gaza ends, White House National Security Council spokesperson John Kirby told reporters Tuesday.",
    "url": "https://www.axios.com/2023/10/31/saudi-megadeal-normalization-israel-biden"
  },
  {
    "text": "Here are four races to watch on Election Day 2023  —  Voters in several states will head to the polls on November 7 to choose their representation and cast ballots on issues including abortion and cannabis.  NBC News National Political Correspondent Steve Kornacki lays out key races to watch this year.",
    "url": "https://www.nbcnews.com/meet-the-press/video/here-are-four-races-to-watch-on-election-day-2023-196802629646"
  },
  {
    "text": "“It Was Always Going to End Badly”: The Untold Story of Tucker Carlson's Ugly Exit From Fox News  —  Fox never explained that abrupt firing of cable news' biggest star, allowing conspiracy theories to fester.  Now, in his new book, Network of Lies, Brian Stelter explores the myriad factors contributing to Carlson's cancellation.",
    "url": "https://www.vanityfair.com/news/2023/10/tucker-carlsons-ugly-exit-from-fox-news"
  },
  {
    "text": "Trump grouses that his indictments took years.  Here's why that is.  —  The former president has zeroed in on the idea that the prosecutions are politically timed, neglecting some important details  —  No fewer than five times this week, Donald Trump has wondered aloud why he wasn't indicted … ",
    "url": "https://www.washingtonpost.com/politics/2023/10/31/trump-grouses-that-his-indictments-took-years-heres-why-that-is/"
  }
]