[
  {
    "text": "Republican-appointed judges raise alarm over Trump attacks on law  —  Federal D.C. Judge Reggie B. Walton warned Trump's attacks on hush-money trial judge and others could lead to violence.  Reagan, Bush-appointed judges decry Jan. 6 revisionism, threats.  —  A Republican-appointed judge … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2024/03/29/trump-judge-attacks-violence/"
  },
  {
    "text": "Federal judge warns of Trump's attacks in extraordinary rebuke  —  A sitting federal judge on Thursday harshly criticized Donald Trump's attacks on the judge overseeing the former president's criminal case tied to alleged hush money payments, telling CNN that such statements threaten the viability of the American legal system.",
    "url": "https://www.cnn.com/2024/03/29/politics/federal-judge-donald-trump-rebuke/"
  },
  {
    "text": "The Trump Docket: A forgotten legal battle is about to rear its ugly head  —  Ghosts from Donald Trump's presidential past are coming back to haunt him personally and in just a few short weeks, a case that could soon involve allegations of assault and battery and intentional infliction … ",
    "url": "https://lawandcrime.com/high-profile/the-trump-docket-a-forgotten-legal-battle-is-about-to-rear-its-ugly-head/"
  },
  {
    "text": "Trump Posts Image of Joe Biden Kidnapped And Bound With Rope  —  Trump signals approval of violent imagery targeting his political opponents  —  On Truth Social, Trump posted a video of Trump themed vehicles driving in New York.  One of the trucks has an image of Joe Biden on the back bound with rope,.",
    "url": "https://www.meidastouch.com/news/trump-posts-image-of-joe-biden-kidnapped-and-bound-with-rope"
  },
  {
    "text": "Donald Trump shares image of Joe Biden with hands and feet tied  —  Former president Donald Trump disseminated on social media on Friday an image of President Biden with his hands and feet tied, the latest example of the Republican candidate's use of increasingly violent rhetoric and imagery this campaign season.",
    "url": "https://www.washingtonpost.com/politics/2024/03/29/donald-trump-joe-biden-bound-and-gagged/"
  },
  {
    "text": "Best Buy offers to screen LGBTQ nonprofit donations after conservative pressure, filing shows  —  In an email exchange with a conservative think tank, tucked into an SEC filing, the electronics retailer offered to screen its employee groups' donations to LGBTQ causes.",
    "url": "https://www.nbcnews.com/nbc-out/out-news/best-buy-offers-screen-lgbtq-nonprofit-donations-conservative-pressure-rcna145603"
  },
  {
    "text": "Family of Brian Sicknick, D.C. officer who died after Jan. 6 riot, slam Trump attending wake for NYPD cop Jonathan Diller  —  The father and brother of Brian Sicknick, the police officer who died during the Jan. 6, 2021 riots at the U.S. Capitol, blasted Donald Trump's appearance at a wake Thursday … ",
    "url": "https://www.nydailynews.com/2024/03/29/family-of-brian-sicknick-d-c-officer-who-died-after-jan-6-riot-slam-trump-attending-wake-for-nypd-cop-jonathan-diller/"
  },
  {
    "text": "Donald Trump, Blasphemous Bible Thumper  —  On this holy weekend, one man is taking the Resurrection personally.  —  Donald Trump is presenting himself as the Man on the Cross, tortured for our sins.  “I consider it a great badge of courage,” he tells crowds.  “I am being indicted for you.”",
    "url": "https://www.nytimes.com/2024/03/30/opinion/trump-god-religion-easter.html"
  },
  {
    "text": "Arizona Republican lawmakers want to scrap early voting, question could be on November ballot  —  The Arizona state Legislature is considering asking Arizonans if they want to vote like it's 1990.  —  A measure before the state Senate would invite voters to abolish early voting and add … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/03/30/arizona-republicans-early-voting/73149008007/"
  },
  {
    "text": "Trump stays silent on detained U.S. reporter as he avoids criticizing Putin  —  Trump has consistently gone out of his way to avoid criticizing the Russian president and routinely demonizes reporters  —  Former president Donald Trump, the presumptive Republican nominee … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/29/trump-gershkovich-putin-journalist/"
  },
  {
    "text": "Hogan Pressed For Bigger Ships, Despite Safety Warnings  —  Days after a massive cargo ship collided with the Francis Scott Key Bridge in Baltimore, Republican U.S. Senate candidate Larry Hogan called for the federal government to foot the bill for the bridge's reconstruction.",
    "url": "https://www.levernews.com/hogan-pressed-for-bigger-ships-despite-safety-warnings/"
  },
  {
    "text": "Revisiting Florida 2000 and the Butterfly Effect  —  The evidence is strong that Al Gore would have won had it not been for an infamous ballot design in Palm Beach County.  —  We're still in a post-primary lull before the campaign starts to heat up — and before Donald J. Trump goes on trial.",
    "url": "https://www.nytimes.com/2024/03/30/upshot/florida-2000-gore-ballot.html"
  },
  {
    "text": "The Unhinged Arguments the Supreme Court Is Fielding on Trump Immunity  —  BUNKER MENTALITY  —  “Friend of the court” arguments are coming from across the political spectrum—and are showing the potential consequences of siding with Trump on immunity.  —  Retired American generals vehemently … ",
    "url": "https://www.thedailybeast.com/the-unhinged-arguments-the-supreme-court-is-fielding-on-trump-immunity"
  },
  {
    "text": "Federal judge strikes down county lines for this year's election  —  Quraishi agrees with Kim that county lines represent irreparable harm to candidates  —  In a monumental decision released today, U.S. District Judge Zahid Quraishi struck down the county organizational line … ",
    "url": "https://newjerseyglobe.com/judiciary/quraishi-overturns-the-county-line/"
  },
  {
    "text": "‘In office forever’: Trump's Project 2025 partner calls for ending presidential term limit  —  Conservatives are advocating to repeal the U.S. Amendment that limits presidential terms, prompting President Joe Biden's campaign to warn an election year victory for former President Donald Trump … ",
    "url": "https://www.rawstory.com/trump-term-limits/"
  }
]