[
  {
    "text": "Apple, Google remove TikTok from stores as app halts service in US … Apple and Google removed TikTok from their app stores Saturday night, complying with a law requiring China's ByteDance to divest the social app or see it face an effective ban in the U.S.",
    "url": "https://www.cnbc.com/2025/01/18/apple-google-remove-tiktok-from-stores-as-app-halts-service-in-us.html"
  },
  {
    "text": "TikTok Goes Dark in the U.S.  —  The popular video app stopped working shortly before a federal law barring U.S. companies from hosting or distributing TikTok was set to take effect on Sunday.  —  “Sorry, TikTok isn't available right now,” the message read.",
    "url": "https://www.nytimes.com/2025/01/18/technology/tiktok-ban.html"
  },
  {
    "text": "Oracle Prepares to Start Shutting TikTok Servers Saturday Night  —  Leaders at Oracle, the main cloud computing provider for TikTok's U.S. operations, have told some staff to prepare to shut down servers that host U.S. TikTok data on Saturday night as early as around 9 p.m. Eastern … ",
    "url": "https://www.theinformation.com/articles/oracle-prepares-to-start-shutting-tiktok-servers-saturday-night"
  },
  {
    "text": "TikTok goes dark in the US  —  “We are fortunate that President Trump has indicated that he will work with us on a solution to reinstate TikTok once he takes office,” the company said in a notice on the app.  —  TikTok revoked access Saturday night for U.S. users ahead of a federal ban on the app … ",
    "url": "https://www.politico.com/news/2025/01/18/tiktok-shutdown-before-us-ban-00199167"
  },
  {
    "text": "Trump begins selling a new crypto token, in a move assailed as an ethical breach.  —  The president-elect and his family have a direct and potentially lucrative stake in the sale of a cryptocurrency product that surged in value in the hours after going on sale, days before his inauguration.",
    "url": "https://www.nytimes.com/2025/01/18/us/politics/trump-meme-coin-crypto.html"
  },
  {
    "text": "A List of Those Who Could Be in Line for Trump's ‘Retribution’ … Supporters of President-elect Donald J. Trump outside Mar-a-Lago in West Palm Beach, Fla., in December.Maddie McGarvey for The New York Times  —  President-elect Donald J. Trump has promised at times to use the vast powers … ",
    "url": "https://www.nytimes.com/2025/01/18/us/politics/trump-retribution-list.html"
  },
  {
    "text": "Statement from President Joe Biden on the Executive Order to Help Left-Behind Communities Make a Comeback  —  When I took office, too many American communities had been left behind.  Decades of trickle-down economics offshored manufacturing jobs, slashed public investment … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2025/01/19/statement-from-president-joe-biden-on-the-executive-order-to-help-left-behind-communities-make-a-comeback/"
  },
  {
    "text": "Fox News Prepares to Cover a Government Filled With Fox News Alumni  —  President-elect Donald J. Trump has leaned heavily on familiar faces from the cable network as he fills out his second-term cast.  —  Nineteen ... and counting.  —  That's the number of former Fox News hosts … ",
    "url": "https://www.nytimes.com/2025/01/19/business/media/trump-fox-news-cabinet.html"
  },
  {
    "text": "A president's final days  —  As Biden leaves office, his term is ending where it began: Trump.  —  On a recent Tuesday morning, in a dim underground parking garage in west Los Angeles, President Joe Biden sat idly in his car, seemingly paralyzed by events.",
    "url": "https://www.politico.com/news/2025/01/19/inside-bidens-final-days-004594"
  },
  {
    "text": "Gov. Gavin Newsom faces complex politics, GOP criticism over L.A. fires  —  The California Democrat has pressed moderate measures to aid victims and been a constant TV presence as he and the state battle online falsehoods.  —  LOS ANGELES — Gov. Gavin Newsom has been an omnipresent figure … ",
    "url": "https://www.washingtonpost.com/politics/2025/01/19/california-governor-gavin-newsom-la-fires-trump/"
  },
  {
    "text": "Exclusive: German ambassador warns of Trump plan to redefine constitutional order, document shows  —  Germany's ambassador to the United States has warned that the incoming Trump administration will rob U.S. law enforcement and the media of their independence and hand big tech companies … ",
    "url": "https://www.reuters.com/world/us/german-ambassador-warns-trump-plan-redefine-constitutional-order-document-shows-2025-01-18/"
  },
  {
    "text": "A Trump Oligarchy Is Moving to Washington, and Buying Up Prime Addresses  —  Billionaires and multimillionaires are flocking to a city where power has been more important than money, but is now deeply intertwined with it.  —  President Biden warned in his farewell address to the nation … ",
    "url": "https://www.nytimes.com/2025/01/19/us/politics/trump-billionaires-washington-homes.html"
  },
  {
    "text": "Trump Told Advisers He Wants to Visit China as President  —  The possibility of a visit to China comes as Trump has threatened to impose stiff tariffs on Chinese imports  —  WASHINGTON—President-elect Donald Trump has told advisers he wants to travel to China after he takes office … ",
    "url": "https://www.wsj.com/us-news/trump-china-xi-jinping-visit-e9141794?st=67WSBs"
  },
  {
    "text": "Trump officials haven't decided on post-inauguration Chicago raids, Homan says  —  “Border czar” Tom Homan said the incoming administration is reconsidering plans for an immigration enforcement blitz in Chicago next week after preliminary details leaked.  —  President-elect Donald Trump's handpicked … ",
    "url": "https://www.washingtonpost.com/immigration/2025/01/18/chicago-immigration-raids/"
  },
  {
    "text": "House conservative defies Johnson over remote voting for new moms in Congress  —  GOP Rep. Anna Paulina Luna repeatedly tried to convince Speaker Mike Johnson that he — as a pro-family champion — should back her push to allow new mothers to vote remotely for six weeks while they are recovering from birth.",
    "url": "https://www.cnn.com/2025/01/18/politics/house-remote-voting-new-moms-congress"
  }
]