[
  {
    "text": "Pete Hegseth Sued Over Signal Text Debacle  —  A public watchdog group has launched the first lawsuit over the Trump administration's use of Signal to discuss war plans, HuffPost has learned.  —  A public watchdog group sued Defense Secretary Pete Hegseth and a slew of other Trump administration … ",
    "url": "https://www.huffpost.com/entry/pete-hegseth-sued-over-signal-text-debacle_n_67e2f9b5e4b074f0c26efadc"
  },
  {
    "text": "As top Trump aides sent texts on Signal, flight data show a member of the group chat was in Russia  —  President Trump's Ukraine and Middle East envoy Steve Witkoff was in Moscow, where he met with Russian President Vladimir Putin, when he was included in a group chat with more than a dozen … ",
    "url": "https://www.cbsnews.com/news/trump-envoy-steve-witkoff-signal-text-group-chat-russia-putin/"
  },
  {
    "text": "Waltz takes ‘full responsibility’ - and calls Atlantic editor ‘scum’  —  In an interview with Fox News, the national security advisor denied knowing how the Atlantic's Jeffrey Goldberg joined the thread.  —  National security adviser Mike Waltz said Tuesday that he is taking “full responsibility” … ",
    "url": "https://www.politico.com/news/2025/03/25/mike-waltz-signal-fox-interview-00249896"
  },
  {
    "text": "Preserving and Protecting the Integrity of American Elections  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:  —  Section 1.  Purpose and Policy.  Despite pioneering self-government … ",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/03/preserving-and-protecting-the-integrity-of-american-elections/"
  },
  {
    "text": "Trump Signs Order Requiring Citizenship Proof to Vote in Federal Elections  —  Administration officials cited cracking down on immigrants illegally on voter rolls as one of the executive order's main goals, amplifying Mr. Trump's grievances about electoral integrity.",
    "url": "https://www.nytimes.com/2025/03/25/us/politics/trump-elections-executive-order.html"
  },
  {
    "text": "Trump signs order seeking to overhaul US elections, including requiring proof of citizenship  —  President Donald Trump on Tuesday signed a sweeping executive action to overhaul elections in the U.S., including requiring documentary proof of citizenship to register to vote in federal elections … ",
    "url": "https://apnews.com/article/voting-elections-trump-executive-order-4e9edb53f47e61e241a43ceef8164022"
  },
  {
    "text": "Trump signs executive order requiring proof of citizenship in federal elections  —  Election experts said Trump was claiming power he does not have and said lawsuits over the measure were all but guaranteed.  —  President Donald Trump signed an executive order Tuesday requiring people … ",
    "url": "https://www.washingtonpost.com/politics/2025/03/25/trump-elections-citizenship-proof/"
  },
  {
    "text": "SCOOP: Jasmine Crockett hit with censure effort for mocking paraplegic Texas governor as ‘Hot Wheels’  —  Rep. Jasmine Crockett appeared to mock Gov. Greg Abbott's disability during an event over the weekend  —  FIRST ON FOX: A GOP lawmaker is moving to have Rep. Jasmine Crockett, D-Texas … ",
    "url": "https://www.foxnews.com/politics/scoop-jasmine-crockett-hit-censure-effort-mocking-paraplegic-texas-governor-hot-wheels"
  },
  {
    "text": "Democrats flip deep-red Pennsylvania district in special election shocker  —  Democrats pulled off an astonishing upset in a special election for the Pennsylvania Senate on Tuesday night, as East Petersburg Mayor James Andrew Malone defeated Republican Josh Parsons by a 50-49 margin to flip … ",
    "url": "https://www.the-downballot.com/p/breaking-democrats-flip-deep-red"
  },
  {
    "text": "Vaccine skeptic hired to head federal study of immunizations and autism  —  A long-discredited researcher and vaccine skeptic will conduct a government study on whether vaccines cause autism.  —  A vaccine skeptic who has long promoted false claims about the connection between immunizations … ",
    "url": "https://www.washingtonpost.com/health/2025/03/25/vaccine-skeptic-hhs-rfk-immunization-autism/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQyODc1MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ0MjU3NTk5LCJpYXQiOjE3NDI4NzUyMDAsImp0aSI6IjJjMDVlZjc5LTgzNDQtNGI4MC04ZDQ4LWM4NDFjMGZmMmNjYyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9oZWFsdGgvMjAyNS8wMy8yNS92YWNjaW5lLXNrZXB0aWMtaGhzLXJmay1pbW11bml6YXRpb24tYXV0aXNtLyJ9.CUI7cOCH3G9eZOHu1wO71T377pUb2_VymBS7x-xXEmc&itid=gfta"
  },
  {
    "text": "Speaker Mike Johnson floats eliminating federal courts as GOP ramps up attacks on judges  —  Republican lawmakers are setting their sights on the judiciary following court rulings that have halted Trump's agenda.  —  WASHINGTON — Facing pressure from his right flank to take on judges … ",
    "url": "https://www.nbcnews.com/politics/congress/speaker-mike-johnson-floats-eliminating-federal-courts-rcna197986"
  },
  {
    "text": "Social Security official ended program for Maine newborns because he was ‘ticked’ at Mills  —  U.S. Rep. Chellie Pingree said the rationale given by Lee Dudek, the acting commissioner of the Social Security Administration, is ‘infuriating and absurd.’",
    "url": "https://www.pressherald.com/2025/03/25/social-security-official-ended-program-for-maine-newborns-because-he-was-ticked-at-mills/"
  },
  {
    "text": "Trump targets Jenner & Block in latest executive order aimed at law firms  —  President Donald Trump expanded his attacks on major U.S. law firms on Tuesday as he signed an executive order targeting Jenner & Block, which represents clients challenging some of his major policies and formerly employed … ",
    "url": "https://www.reuters.com/world/us/trump-signs-executive-order-against-law-firm-jenner-block-2025-03-25/"
  },
  {
    "text": "CDC is pulling back $11B in Covid funding sent to health departments across the U.S.  —  “Now that the pandemic is over, the grants and cooperative agreements are no longer necessary,” federal health authorities wrote to funding recipients this week.  —  The Centers for Disease Control … ",
    "url": "https://www.nbcnews.com/health/health-news/cdc-pulling-back-11b-covid-funding-sent-health-departments-us-rcna198006"
  },
  {
    "text": "'We've all done this': Trump admin group chat scandal is its most relatable fail  —  Last year Morgan Matthews woke up to discover that she had sent a text message while she was asleep.  —  “I don't don't know what to do with my wwwa w www waawaww we awW,” the lengthy message began … ",
    "url": "https://www.usatoday.com/story/tech/2025/03/25/trump-secret-signal-chat-fail-relatable/82656180007/"
  },
  {
    "text": "Judge temporarily bars effort to defund Radio Free Europe  —  A federal judge on Monday temporarily blocked Kari Lake and the Trump administration from moving to defund Radio Free Europe/Radio Liberty (RFE/RL).  —  U.S. District Judge Royce Lamberth found that the administration and Lake … ",
    "url": "https://thehill.com/regulation/court-battles/5213513-judge-temporarily-bars-effort-to-defund-radio-free-europe/"
  },
  {
    "text": "DOGE efforts should be counted alongside megabill's cost-cutting, Thune says  —  Senate Majority Leader John Thune said he plans to use the cuts undertaken by Elon Musk's Department of Government Efficiency initiative as he tries to get Republican fiscal hawks on board with a budget blueprint paving … ",
    "url": "https://www.politico.com/live-updates/2025/03/24/congress/john-thune-doge-cuts-reconciliation-00249909"
  },
  {
    "text": "Addressing Risks from Jenner & Block  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:  —  Section 1.  Background.  My Administration is committed to addressing the significant risks associated with law firms … ",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/03/addressing-risks-from-jenner-block/"
  },
  {
    "text": "60% of Republicans think the Trump administration's military leak is a very or somewhat serious problem  —  The Trump administration is currently facing questions about a story published Monday by a journalist at The Atlantic, who wrote that he had inadvertently been added … ",
    "url": "https://today.yougov.com/politics/articles/51888-republicans-think-the-trump-administrations-military-leak-is-problem"
  },
  {
    "text": "The Justice Department Just Debuted a New Defense of Trump.  It's Terrifying.  —  Does the “mandate of the electorate” give the president absolute power to defy the courts?  —  On Monday, Donald Trump's Department of Justice made two arguments in two different courts that, taken together … ",
    "url": "https://slate.com/news-and-politics/2025/03/trump-boasberg-constitutional-crisis-latest-doj-king.html"
  },
  {
    "text": "Protecting America's Bank Account Against Fraud, Waste, and Abuse  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:  —  Section 1.  Purpose.  Promoting financial integrity and operational efficiency … ",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/03/protecting-americas-bank-account-against-fraud-waste-and-abuse/"
  },
  {
    "text": "Judge Orders U.S. to Stop Attempts to Deport Columbia Undergraduate  —  The administration has been seeking to arrest and deport Yunseo Chung, who immigrated from South Korea as a child, after she participated in pro-Palestinian demonstrations.  —  A federal judge on Tuesday ordered … ",
    "url": "https://www.nytimes.com/2025/03/25/nyregion/columbia-university-protester-chung-deportation.html?unlocked_article_code=1.6k4.Xe39.n-8360aPtx0b&smid=url-share"
  }
]