[
  {
    "text": "Arizona Supreme Court rules that a near-total abortion ban from 1864 is enforceable  —  The bombshell decision adds the state to the growing lists of places where abortion care is effectively banned.  —  PHOENIX — The Arizona Supreme Court ruled Tuesday that a 160-year-old near-total abortion ban still … ",
    "url": "https://www.nbcnews.com/politics/arizona-supreme-court-ruling-abortion-ban-rcna146915"
  },
  {
    "text": "Abortion in Arizona set to be illegal in nearly all circumstances, state high court rules  —  The Arizona Supreme Court upheld a 160-year-old abortion ban that could shutter abortion clinics in the state.  —  The ruling indicated the ban can only be “prospectively enforced” and enforcement of the law is stayed for 14 days.",
    "url": "https://www.azcentral.com/story/news/politics/arizona/2024/04/09/arizona-abortion-law-state-supreme-court-upholds-near-total-ban/73251148007/"
  },
  {
    "text": "Arizona Supreme Court rules to ban nearly all abortions, reverting back to penal code  —  The court filed its opinion in Planned Parenthood of Arizona vs. Mayes/Hazelrigg Tuesday morning  —  PHOENIX — In a historic decision Tuesday, the Arizona Supreme Court ruled the state must adhere … ",
    "url": "https://www.abc15.com/news/state/arizona-supreme-court-rules-to-ban-nearly-all-abortions-reverting-back-to-penal-code"
  },
  {
    "text": "Biden allies tie Arizona abortion ruling to Trump: ‘This is what leaving it to the states looks like’  —  Biden campaign aides and allies on Tuesday wasted little time tying an Arizona court ruling effectively outlawing abortion in the state directly to former President Donald Trump and his call … ",
    "url": "https://thehill.com/homenews/campaign/4583281-biden-allies-tie-arizona-abortion-ruling-to-trump/"
  },
  {
    "text": "Trump loses bid to delay hush money trial pending gag order appeal  —  Donald Trump on Tuesday lost his second last-ditch bid in as many days to delay his April 15 trial on criminal charges stemming from hush money paid to a porn star.  —  The former U.S. president's lawyers argued at a hearing … ",
    "url": "https://www.reuters.com/world/us/trump-appeals-gag-order-stormy-daniels-hush-money-case-2024-04-09/"
  },
  {
    "text": "The Inside Story of Alvin Bragg's Case Against Trump … Reporters vied for seats in the briefing room, some even crouching on the floor.  They all knew, on this Tuesday in early April 2023, that Alvin L. Bragg, the Manhattan district attorney, was about to announce something momentous … ",
    "url": "https://www.nytimes.com/2024/04/09/magazine/alvin-bragg-donald-trump-trial.html"
  },
  {
    "text": "Donald Trump's lawyers ask appeals court to lift gag order in hush money criminal case  —  NEW YORK (AP) — Donald Trump's lawyers asked a New York appeals court Tuesday to delay his hush-money criminal trial while they fight to lift the former president's gag order, just days before the trial is scheduled to start.",
    "url": "https://apnews.com/article/donald-trump-gag-order-hush-money-juan-merchan-0a10c7ee0236f760ce50c05cafb163ef"
  },
  {
    "text": "I've Been at NPR for 25 Years.  Here's How We Lost America's Trust.  —  Uri Berliner, a veteran at the public radio institution, says the network lost its way when it started telling listeners how to think.  —  You know the stereotype of the NPR listener: an EV-driving, Wordle-playing, tote bag-carrying coastal elite.",
    "url": "https://www.thefp.com/p/npr-editor-how-npr-lost-americas-trust"
  },
  {
    "text": "Michigan school shooter's parents sentenced to at least 10 years in prison  —  The parents of a Michigan school shooter have been sentenced to at least 10 years for failing to prevent the killing of four students in 2021.  Jennifer and James Crumbley are the first parents convicted in a U.S. mass school shooting.",
    "url": "https://apnews.com/article/james-crumbley-jennifer-crumbley-oxford-school-shooting-e5888f615c76c3b26153c34dc36d5436"
  },
  {
    "text": "Pelosi on Trump abortion statement: ‘He either is stupid, or he thinks the rest of us are’  —  Former Speaker Nancy Pelosi (D-Calif.) blasted former President Trump in an interview early Tuesday, saying he is trying to appear moderate on the issue of abortion and suggesting his official position does not reflect any core “belief.”",
    "url": "https://thehill.com/homenews/campaign/4582818-pelosi-on-trump-abortion-statement-he-either-is-stupid-or-he-thinks-the-rest-of-us-are/"
  },
  {
    "text": "Anti-Israel agitators shut down Senate cafeteria; around 50 arrested  —  More than 50 people were arrested Tuesday after the Senate cafeteria was shut down by anti-Israel protesters chanting “Senate can't eat until Gaza eats!”  —  The U.S. Capitol Police confirmed to Fox News … ",
    "url": "https://www.foxnews.com/politics/anti-israel-agitators-shut-down-senate-cafeteria-arrested"
  },
  {
    "text": "Ken Buck knocks ‘Moscow Marjorie’ Taylor Greene  —  Former Rep. Ken Buck (R-Colo.) took shots at Rep. Marjorie Taylor Greene (R-Ga.) Monday, attacking his former GOP colleague as “Moscow Marjorie.”  —  The jab comes after former Speaker Kevin McCarthy (R-Calif.) called Greene a … ",
    "url": "https://thehill.com/homenews/house/4582430-ken-buck-knocks-moscow-marjorie-taylor-greene/"
  },
  {
    "text": "Jacob Wohl and Jack Burkman Fined $1.25M for ‘Depraved’ Robocall Scheme  —  ‘HELD ACCOUNTABLE’  —  They were found liable in March 2023 for “transmitting false and threatening messages intended to discourage voting” by Black New Yorkers.  —  Notorious conspiracy theorists Jacob Wohl … ",
    "url": "https://www.thedailybeast.com/jacob-wohl-and-jack-burkman-fined-dollar125m-for-depraved-robocall-scheme"
  },
  {
    "text": "The deeply silly, extremely serious rise of ‘Alpha Male’ Nick Adams  —  Meet the Trump-backed raconteur who is teaching America's young men the art of being hard to deal with  —  Nick Adams was speaking to the men in the room.  —  “Never apologize,” he said.  “Never mask up.",
    "url": "https://www.washingtonpost.com/style/power/2024/04/09/nick-adams-alpha-male-trump-campaign-surrogate/"
  },
  {
    "text": "As Kushner's Investment Firm Steps Out, the Potential Conflicts Are Growing  —  Jared Kushner's Affinity Partners has invested more than $1.2 billion, much of it in firms abroad, drawing new scrutiny as his father-in-law, Donald Trump, again seeks the presidency.",
    "url": "https://www.nytimes.com/2024/04/09/us/politics/jared-kushner-affinity-partners.html"
  },
  {
    "text": "Biden is building a behemoth of a campaign.  Trump at this point seems to be playing catch-up.  —  Biden is flush with cash and opening campaign offices across the country but has struggled to overcome Trump and his more meager campaign in the polls.  —  PHILADELPHIA — President Joe Biden … ",
    "url": "https://www.nbcnews.com/politics/2024-election/biden-building-behemoth-campaign-trump-point-seems-playing-catch-rcna145903"
  },
  {
    "text": "Republican megadonor Jeff Yass, inner circle give millions to shape schools, courts … A portrait of Jeff Yass.  —  Inside one of the largest options trading firms in the world sits a little known charitable foundation, that has quietly donated tens of millions of dollars to influence federal policy, education and law.",
    "url": "https://www.cnbc.com/2024/04/09/jeff-yass-millions-to-influence-schools-courts-and-markets.html"
  },
  {
    "text": "European court rules human rights violated by climate inaction  —  A group of older Swiss women have won the first ever climate case victory in the European Court of Human Rights.  —  The women, mostly in their 70s, said that their age and gender made them particularly vulnerable to the effects of heatwaves linked to climate change.",
    "url": "https://www.bbc.com/news/science-environment-68768598"
  },
  {
    "text": "TV Networks to Urge Biden and Trump to Debate, Wading Into a Fraught Topic  —  Speculation has swirled in the political world about whether the presumptive candidates will agree to the traditional face-to-face events, a campaign staple since 1976.  —  In an unusual move … ",
    "url": "https://www.nytimes.com/2024/04/09/business/media/networks-biden-trump-debate-letter.html"
  },
  {
    "text": "Cracking down on pandemic aid fraud, DOJ claws back $1.4 billion and charges 3,500 people  —  Lawmakers and the White House propose to extend the statute of limitations on COVID fraud and authorize a group of inspectors general to continue their reviews of pandemic spending.",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/04/09/doj-recovers-pandemic-aid-fraud/73259347007/"
  },
  {
    "text": "Trump says Jews who vote for Biden do ‘not love Israel’ and ‘should be spoken to’  —  The presumptive Republican presidential nominee repeated an antisemitic trope he has pushed suggesting American Jews have dual loyalties to the U.S. and Israel.  —  Former President Donald Trump on Monday … ",
    "url": "https://www.nbcnews.com/politics/2024-election/trump-says-jews-vote-biden-not-love-israel-spoken-rcna146972"
  },
  {
    "text": "The Influential Conservative Group Making it Harder for Idaho Districts to Fix Their Schools  —  The Idaho Freedom Foundation has gone beyond the education culture wars by targeting local bond and levy elections, which districts rely on heavily to build and repair schools.  —  Co-published with Idaho Statesman",
    "url": "https://www.propublica.org/article/the-influential-group-disrupting-efforts-to-fix-idaho-schools"
  },
  {
    "text": "Are Democrats Using Illegal Immigration to Build a ‘Permanent Majority’?  —  Preventing illegal immigrants from voting is very important, according to a majority of voters, who agree with Elon Musk that Democrats are encouraging immigration as part of a plan to gain a “permanent majority.”",
    "url": "https://www.rasmussenreports.com/public_content/politics/biden_administration/are_democrats_using_illegal_immigration_to_build_a_permanent_majority"
  },
  {
    "text": "How Senate Dems plan to quickly ‘dispose’ of Mayorkas trial  —  Sen. Debbie Stabenow, the No. 3 Democrat, said the party will move to dismiss the articles of impeachment on Thursday.",
    "url": "https://www.politico.com/live-updates/2024/04/09/congress/dems-plan-to-dispose-of-mayorkas-trial-00151251"
  }
]