[
  {
    "text": "Henry Kissinger, War Criminal Beloved by America's Ruling Class, Finally Dies  —  The infamy of Nixon's foreign-policy architect sits, eternally, beside that of history's worst mass murderers.  A deeper shame attaches to the country that celebrates him  —  Henry Kissinger died on Wednesday … ",
    "url": "https://www.rollingstone.com/politics/politics-news/henry-kissinger-war-criminal-dead-1234804748/"
  },
  {
    "text": "Henry Kissinger, the Hypocrite  —  Henry Kissinger, who died on Wednesday, exemplified the gap between the story that America, the superpower, tells and the way that we can act in the world.  At turns opportunistic and reactive, his was a foreign policy enamored with the exercise of power … ",
    "url": "https://www.nytimes.com/2023/11/30/opinion/henry-kissinger-the-hypocrite.html"
  },
  {
    "text": "The surprising dating life of Henry Kissinger, a West Wing ‘playboy’  —  Henry Kissinger was about to get lucky with Zsa Zsa Gabor.  And it was due, in part, to Richard M. Nixon's setting them up.  Seriously.  —  The diplomat and the Hungarian American socialite were an unlikely couple … ",
    "url": "https://www.washingtonpost.com/history/2023/11/29/henry-kissinger-dies-dating-life-playboy/"
  },
  {
    "text": "McCarthy privately recounts terse phone call with Trump after ouster  —  During the call, former president detailed the reasons he hadn't intervened during the effort to remove McCarthy as speaker  —  In the weeks after the Jan. 6, 2021, attack on the U.S. Capitol, then-House Minority Leader Kevin McCarthy … ",
    "url": "https://www.washingtonpost.com/politics/2023/11/30/donald-trump-kevin-mccarthy-phone-call/"
  },
  {
    "text": "The Trump dictatorship  —  Editor at large  —  Robert Kagan, a Post Opinions contributing editor, is the author of “Rebellion: How Antiliberalism Is Tearing America Apart — Again,” which will be published by Knopf in May.  —  Let's stop the wishful thinking and face the stark reality … ",
    "url": "https://www.washingtonpost.com/opinions/2023/11/30/trump-dictator-2024-election-robert-kagan/"
  },
  {
    "text": "Majority of Florida Voters Support Abortion Amendment to State Constitution: Poll  —  If enough signatures are obtained, the Florida Supreme Court would then review the amendment and determine if it can be put on the ballot  —  A majority of Florida voters say they would vote yes … ",
    "url": "https://themessenger.com/politics/majority-of-florida-voters-support-abortion-amendment-to-state-constitution-poll"
  },
  {
    "text": "Florida GOP Chair Christian Ziegler, husband of Moms For Liberty cofounder, accused of sexual battery by alleged menage a trois lover  —  Christian Ziegler, Florida's GOP chairman and husband of Sarasota County School Board member and Moms of Liberty co-founder Bridget Ziegler … ",
    "url": "https://flcga.org/florida-gop-chair-christian-ziegler-husband-of-a-moms-for-liberty-cofounder-accused-of-battery-by-alleged-menage-a-trois-lover/"
  },
  {
    "text": "Defiant Santos announces effort to oust colleague ahead of his own likely expulsion  —  Rep. George Santos (R-N.Y.) may be getting pushed out of Congress, but he's making it clear that he won't be leaving quietly.  —  The embattled lawmaker announced Thursday morning that he will move … ",
    "url": "https://thehill.com/homenews/house/4334916-santos-bowman-house-expulsion/"
  },
  {
    "text": "Senate GOP stages hearing walkout to protest Supreme Court-related subpoenas  —  Tempers exploded at a Senate Judiciary Committee meeting Thursday before Democrats voted to subpoena a major conservative donor and a prominent conservative activist linked to the Supreme Court's ethics scandals.",
    "url": "https://thehill.com/homenews/senate/4335581-senate-gop-stages-hearing-walkout-to-protest-supreme-court-related-subpoenas/"
  },
  {
    "text": "He doesn't report having checking or savings.  So where did Andy Ogles get $320,000 for his campaign?  —  Watchdog: ' It's not clear from his financial disclosure reports where he got the money' that he claims to have loaned campaign  —  NASHVILLE, Tenn. (WTVF) — Where did Congressman Andy Ogles … ",
    "url": "https://www.newschannel5.com/news/newschannel-5-investigates/revealed/he-doesnt-report-having-checking-or-savings-so-where-did-andy-ogles-get-320-000-for-campaign"
  },
  {
    "text": "U.S. stops helping Big Tech spot foreign meddling amid GOP legal threats  —  The federal government is no longer warning Meta about foreign influence campaigns, a shift that comes amid a legal campaign against the Biden administration's communication with tech platforms",
    "url": "https://www.washingtonpost.com/technology/2023/11/30/biden-foreign-disinformation-social-media-election-interference/"
  },
  {
    "text": "Divisions leave Florida's House Republicans powerless  —  The lack of a cohesive delegation has allowed attention-seeking lawmakers to act on their own.  —  Florida Republicans should have clout in the House.  They have the numbers, the pedigree and the recently earned distinction as an epicenter of Republican politics.",
    "url": "https://www.politico.com/news/2023/11/29/divisions-leave-floridas-house-republicans-powerless-00129200"
  },
  {
    "text": "Americans Back Israel's Military Action in Gaza by 50% to 45%  —  WASHINGTON, D.C. — Half of Americans approve of Israel's military action in the Hamas-led Gaza Strip, and 45% disapprove, according to a Gallup poll conducted several weeks after Hamas launched a deadly attack on Israel that led to a major military operation by Israel.",
    "url": "https://news.gallup.com/poll/545045/americans-back-israel-military-action-gaza.aspx"
  },
  {
    "text": "Trump's Gag Order Is Back After Appeals Court Sides With Judge  —  An appeals court decided that Trump's gag order, which was lifted on appeal, should actually be reinstated.  —  Donald Trump is once again prohibited from attacking the law clerk at his ongoing bank fraud trial in New York … ",
    "url": "https://www.thedailybeast.com/trumps-gag-order-is-reinstated-for-bank-fraud-trial"
  },
  {
    "text": "Watchdog launches probe into FBI headquarters selection process  —  The Office of Inspector General (OIG) for the General Service Administration (GSA) is launching a probe into the agency's site selection process for the new FBI headquarters.  —  The GSA announced the selection of Greenbelt … ",
    "url": "https://thehill.com/homenews/administration/4335717-watchdog-probe-fbi-headquarters-selection-maryland/"
  },
  {
    "text": "Pro-Palestinian protesters, one carrying swastika, swarm Midtown in bid to derail Rockefeller Center Christmas tree lighting  —  Hundreds of pro-Palestinian protesters swarmed the streets surrounding Rockefeller Center on Wednesday, clashing with NYPD cops and chanting “River to the sea,” … ",
    "url": "https://nypost.com/2023/11/29/metro/pro-palestinian-protesters-swarm-nyc-to-derail-rockefeller-center-christmas-tree-lighting/"
  },
  {
    "text": "Hollywood Goes Home: How Celebrity Endorsements Are Helping Dems Win Down Ballot  —  The Hometown Project is finding success in pairing celebrities with down-ballot candidates from the areas they call home  —  In towns across the nation, there is that person - the kid who made it big … ",
    "url": "https://themessenger.com/politics/hollywood-goes-home-how-celebrity-endorsements-are-helping-dems-win-down-ballot"
  },
  {
    "text": "There are now more land mines in Ukraine than almost anywhere else on the planet  —  Ukraine is staring down a massive humanitarian challenge — now and into the future.  —  The sign is red, marked with a skull and crossbones and a warning: “Danger mines!”",
    "url": "https://www.vox.com/world-politics/2023/11/30/23979758/ukraine-war-russia-land-mines-artillery-humantarian-crisis"
  }
]