[
  {
    "text": "If True, the ABC News Presidential Debate Could Be Rocked by Explosive Scandal  —  Anyone who watched the presidential debate hosted by ABC News on Tuesday knows that the moderators were biased and repeatedly fact-checked Trump while letting Kamala Harris's lies go unchallenged.",
    "url": "https://pjmedia.com/matt-margolis/2024/09/12/if-true-the-abc-news-presidential-debate-could-be-rocked-by-explosive-scandal-n4932479"
  },
  {
    "text": "Trump Is Losing The Post-Debate Debate, Too  —  Plus: A bomb threat in Springfield.  —  Donald Trump has an announcement: He won the first debate against Kamala Harris so handily, and was praised so universally for doing so, that he really doesn't see a need to take the stage with her again.",
    "url": "https://www.thebulwark.com/p/trump-is-losing-the-post-debate-debate"
  },
  {
    "text": "Moooooods!!!!  —  Donald Trump's flailing performance at Tuesday night's debate triggered a multiday right-wing freakout at the ABC News moderators, punctuated by calls from the former president and his allies to target the network and its parent company with a regulatory crackdown, congressional investigation, and even prosecutions.",
    "url": "https://www.mediamatters.org/donald-trump/rights-post-debate-assault-abc-preview-trumps-authoritarian-agenda"
  },
  {
    "text": "Election 2024 live updates: Trump to hold news conference, campaign in Nev.; Harris back in Pa.  —  Trump says he won't debate Harris again before election  —  Election 2024  —  Follow live updates on the 2024 election and the contest between Vice President Kamala Harris … ",
    "url": "https://www.washingtonpost.com/elections/2024/09/13/2024-election-campaign-updates-harris-trump/"
  },
  {
    "text": "Trump allies alarmed by far-right activist's influence on him … - “Marjorie Taylor Greene is right. … - Greene, a GOP firebrand known for her politically provocative speeches in Congress, has had a series of disagreements with Loomer long before this week.",
    "url": "https://www.axios.com/2024/09/13/trump-allies-far-right-activist-loomer"
  },
  {
    "text": "Texas comes for the right to interstate travel  —  States' rights for me, not for thee. … During Tuesday's debate, as Donald Trump tried to take credit for the demise of Roe while pretending a second Trump administration wouldn't obliterate abortion protections at a national level … ",
    "url": "https://www.publicnotice.co/p/texas-medical-records-abortion"
  },
  {
    "text": "How Elon Musk Secretly Tried to Oust a Texas Prosecutor  —  In a bid to counter George Soros, the Tesla chief executive unsuccessfully backed the opponent of a progressive district attorney  —  Elon Musk secretly channeled hundreds of thousands of dollars into a local race in Travis County … ",
    "url": "https://www.wsj.com/us-news/elon-musk-texas-da-jose-garza-oust-atempt-206db043?st=0r4kfh0mlpe0euo"
  },
  {
    "text": "Triple Hearsay: Original Sources of the Claim that Haitians Eat Pets in Ohio Admit No First-Hand Knowledge  —  “I'm not sure I'm the most credible source because I don't actually know the person who lost the cat,” Kimberly Newton told NewsGuard.  She is the Springfield, Ohio, resident whose story started it all",
    "url": "https://www.newsguardrealitycheck.com/p/origins-haitians-eating-pets-claim"
  },
  {
    "text": "Bipartisan group of lawmakers signs pledge to certify 2024 election results  —  More than 30 House members, including a half-dozen Republicans, have signed a bipartisan pledge to uphold the results of the 2024 election amid an increased focus on Congress' role in certifying the tally next January.",
    "url": "https://www.politico.com/live-updates/2024/09/13/congress/house-centrists-vow-to-certify-2024-election-00178945"
  },
  {
    "text": "Martha Stewart Just Quietly Made a Rare Presidential Endorsement  —  ‘KEEP IT QUIET’  —  After declining to endorse a candidate in 2020, Stewart has finally broken her silence on the 2024 election. … Martha Stewart has finally weighed in on the 2024 election and endorsed a candidate.",
    "url": "https://www.thedailybeast.com/martha-stewart-just-quietly-endorsed-kamala-harris-for-president"
  },
  {
    "text": "Biden administration expected to unveil new evidence of RT's key role in Russian intelligence operations globally  —  The Biden administration is expected on Friday to announce a major effort to blunt the global influence of RT and expose what it says is the Russian state media network's key role … ",
    "url": "https://www.cnn.com/2024/09/13/politics/biden-administration-rt-russian-intelligence"
  },
  {
    "text": "The ‘feral 25-year-olds’ making Kamala Harris go viral on TikTok  —  Harris's “digital rapid response” operation and all-Gen-Z TikTok team are tapping the trends and rhythms of internet culture to create an online presence that's unique in presidential politics.",
    "url": "https://www.washingtonpost.com/technology/2024/09/13/harris-tiktok-social-media-team/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI2MjAwMDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI3NTgyMzk5LCJpYXQiOjE3MjYyMDAwMDAsImp0aSI6IjM2NmU0NzM2LWVkZTEtNGMwNS1iMGFjLTZjMjNjNTdiNmY3MSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS90ZWNobm9sb2d5LzIwMjQvMDkvMTMvaGFycmlzLXRpa3Rvay1zb2NpYWwtbWVkaWEtdGVhbS8ifQ.RWqlnFXoyxhpX8b0_e9bperwKF_uJDLS1-UQUsKnopc&itid=gfta"
  },
  {
    "text": "The New York Times' Republicans-only Opinion Feature  —  A regular New York Times opinion feature includes outside writers — but only conservatives  —  If you read yesterday's New York Times, you likely came across a feature headlined “'Trump Brought Darkness; Harris Brought Light': 14 Writers on Who Won the Presidential Debate.”",
    "url": "https://www.findinggravity.net/p/the-new-york-times-republicans-only"
  },
  {
    "text": "America's stores are winning the war on shoplifting  —  New York CNN  —  A year ago, America's stores declared a shoplifting epidemic.  They closed stores in major cities, hired extra security, locked up key merchandise and declared big losses in their financial statements.",
    "url": "https://www.cnn.com/2024/09/13/business/theft-retail-shrink-stores/"
  },
  {
    "text": "Is There More to JD Vance's MAGA Alliance Than Meets the Eye?  —  The New Right has a blueprint for taking power.  JD Vance could be following it.  —  JD Vance's political career has been defined by an apparent paradox.  On the one hand, Vance is a member of the upper echelon of America's ruling elite … ",
    "url": "https://www.politico.com/news/magazine/2024/09/13/jd-vance-new-right-political-movement-00177203"
  },
  {
    "text": "In blow to Newsmax, judge rules Smartmatic's case over 2020 election lies will go to trial this month  —  A major defamation case against Newsmax will proceed to trial later this month, a judge ruled Thursday, dealing a blow to the right-wing network and setting the stage for the 2020 election … ",
    "url": "https://www.cnn.com/smartmatic-newsmax-trial-2020-election-fox/"
  },
  {
    "text": "Project 2025 cuts Social Security: Are you on the chopping block?  Check this map.  —  Should the Social Security Retirement Age Be Raised?  Yes.  — Heritage Foundation  —  You gotta hand it to the clever folks at the Heritage Foundation!  How do you make it even harder for seniors struggling with their healthcare and expenses?",
    "url": "https://thedemlabs.org/2024/09/12/project-2025-cuts-social-security-map-of-who-gets-hurt/"
  },
  {
    "text": "Nebraska ballot can include competing measures to expand or limit abortion rights, high court rules  —  The Nebraska Supreme Court ruled Friday that competing measures that would expand or limit abortion rights can appear on the November ballot.  —  The high court's ruling came days … ",
    "url": "https://apnews.com/article/abortion-ballot-measures-nebraska-a545d1cb44b18cf37084e4a62e27019a"
  },
  {
    "text": "Zelenskiy Blasts Western Allies for Slow Aid Amid Russian Push Near Kursk  — Russian artillery domination near Pokrovsk declines: Zelenskiy  — Zelenskiy says help from Ukraine's western partners too slow  —  Ukraine Needs to Be Able to Defend Itself, Panetta Says",
    "url": "https://www.bloomberg.com/news/articles/2024-09-13/zelenskiy-blasts-western-allies-for-slow-aid-amid-russian-push-near-kursk"
  },
  {
    "text": "Feds rarely punish hospitals for turning away pregnant patients  —  As the pregnant woman's contractions rolled in every two minutes, staff at Our Lady of the Lake Regional Medical Center in Baton Rouge, Louisiana, dispatched an ambulance to send her elsewhere.",
    "url": "https://apnews.com/article/hospitals-patient-dumping-pregnancies-6a0fa0a16a42e4ceb4c8c14c5cd2c0f5"
  },
  {
    "text": "White House officials signal delay in U.S. Steel takeover decision  —  Concerns grow about risks involved in halting sale of U.S. Steel to Japanese company.  —  White House officials are signaling that President Joe Biden will not imminently move to block Nippon Steel's bid … ",
    "url": "https://www.washingtonpost.com/business/2024/09/13/biden-nippon-steel-deal-election/"
  }
]