[
  {
    "text": "Dean Phillips Was Right About Joe Biden.  He Finds It ‘Awfully Unsatisfying.’  —  The three-term lawmaker and presidential candidate is deeply disappointed with his fellow Democrats.  —  Outgoing Minnesota Rep. Dean Phillips poses for a portrait at his home in Capitol Hill in Washington on Dec. 16.",
    "url": "https://www.politico.com/news/magazine/2024/12/28/dean-phillips-congress-exit-interview-00195232"
  },
  {
    "text": "Playbook: Trump lets Johnson twist in the wind  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  BREAKING OVERNIGHT — “Putin Apologizes but Stops Short of Taking Responsibility for Kazakhstan Crash,” by NYT's Anatoly Kurmanaev: “The statement stopped short … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/12/28/trump-lets-johnson-twist-in-the-wind-00196093"
  },
  {
    "text": "Elon Musk pens German newspaper opinion piece supporting far-right AfD party  —  Billionaire Trump adviser said his ‘significant investments’ in the country justified his wading into German politics  —  The tech entrepreneur and close adviser to Donald Trump Elon Musk has taken a stunning … ",
    "url": "https://www.theguardian.com/world/2024/dec/28/elon-musk-germany-afd-party"
  },
  {
    "text": "Musk writes op-ed backing far-right German political party  —  Tech billionaire Elon Musk penned an op-ed further expressing support for the far-right German political party Alternative for Germany (AfD).  In response, the paper's commentary editor resigned in protest.",
    "url": "https://thehill.com/policy/international/5058480-musk-german-afd-endorsement/"
  },
  {
    "text": "Man accused of attacking TV reporter, saying 'This is Trump's America now'  —  A Colorado man is facing possible bias-motivated charges for allegedly attacking a television news reporter after demanding to know whether he was a citizen, saying “This is Trump's America now,” according to court documents.",
    "url": "https://apnews.com/article/tv-reporter-attack-trumps-america-40c4c3622bf85baef9cefbd50d50fcec"
  },
  {
    "text": "Elon Musk pledges “war” over H-1B visa program, calls opponents racists … - Trump, who has remained silent thus far on the schism, faces a quickly deepening conflict between his richest and most powerful advisors on one hand, and the people who swept him to office on the other.",
    "url": "https://www.axios.com/2024/12/28/musk-war-h1b-racists-maga-doge"
  },
  {
    "text": "Maga v Musk: Trump camp divided in bitter fight over immigration policy  —  Feud flared up when president-elect chose Sriram Krishnan, an Indian-born entrepreneur, as his AI adviser  —  Bitter in-fighting has broken out between the tech billionaire Elon Musk and Donald Trump's hardline … ",
    "url": "https://www.theguardian.com/us-news/2024/dec/27/trump-elon-musk-sriram-krishnan"
  },
  {
    "text": "Joe Biden's lonely battle to sell his vision of American democracy  —  In his presidency's final chapter, Biden has mused about whether he should have handled some decisions differently  —  Earlier this year, Rep. James E. Clyburn met President Joe Biden at the White House to deliver a stern message … ",
    "url": "https://www.washingtonpost.com/politics/2024/12/28/bidens-lonely-battle-to-sell-american-democracy/"
  },
  {
    "text": "Elon Musk accused of censoring conservatives on X who disagree with him about immigration  —  The claims came after Elon Musk was involved in a public feud with some Republicans over immigration.  —  Tech billionaire Elon Musk faced accusations of censorship Friday from fellow conservatives … ",
    "url": "https://www.nbcnews.com/tech/social-media/elon-musk-accused-censoring-laura-loomer-maga-republicans-x-rcna185569"
  },
  {
    "text": "Democrats grapple with ‘jarring’ lack of diversity in DNC race  —  The race for Democratic National Committee (DNC) chair is shaping up to be a field of largely white men — a notable development for a party that has long touted diversity within its ranks.  —  Roughly half a dozen candidates … ",
    "url": "https://thehill.com/homenews/campaign/5051005-dnc-chair-race-lacks-diversity/"
  },
  {
    "text": "Abortions are up in the US.  It's a complicated picture as women turn to pills, travel  —  Abortion has become slightly more common despite bans or deep restrictions in most Republican-controlled states, and the legal and political fights over its future are not over yet.",
    "url": "https://apnews.com/article/abortion-roe-dobbs-states-data-5632f60aa1d797bcdec9fbc77a385413"
  },
  {
    "text": "Janet Yellen tells Congress US could hit debt limit in mid-January  —  Treasury Secretary Janet Yellen said her agency will need to start taking “extraordinary measures,” or special accounting maneuvers intended to prevent the nation from hitting the debt ceiling, as early as January 14 … ",
    "url": "https://apnews.com/article/treasury-debt-limit-yellen-trump-elections-republicans-9c5d27c08feb744f5ee59dc2c87a06d5"
  },
  {
    "text": "Does Trump Jan 6.  Pardon Plan Include the Seditionists?  —  Trump's transition team is not ruling it out  —  With Donald Trump winning back the White House, his Big Lie that Jan. 6 was just an enthusiastic rally that got out of hand, rather than an insurrectionist mob he unleashed to disrupt … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-january-6-pardon-seditionists-oath-keepers-proud-boys-1235219409/"
  },
  {
    "text": "Experts confused but delighted by low rates of teen drug use  —  A new study has experts beaming with hope as it shows teen drug use at a record low, but they admit confusion as to why the trend is happening and how to ensure it continues.  —  The annual national Monitoring the Future survey found … ",
    "url": "https://thehill.com/homenews/education/5051213-teen-drug-use-vaping-marijuana-alcohol/"
  },
  {
    "text": "Trump Urges Supreme Court to Pause TikTok Ban  —  The president-elect took no position on the app's First Amendment challenge to the law, which sets a Jan. 19 deadline to sell or close the popular platform.  —  President-elect Donald J. Trump filed an unusual brief on Friday asking … ",
    "url": "https://www.nytimes.com/2024/12/27/us/politics/tiktok-ban-supreme-court-trump.html"
  },
  {
    "text": "'He's Not Going to Please Everyone.' John Thune's Delicate Task Under Trump  —  The small-town South Dakotan rose to the Senate's top post by deftly navigating spending fights and the ascent of MAGA",
    "url": "https://www.wsj.com/politics/john-thune-senate-majority-leader-profile-aa1eb7b1"
  }
]