[
  {
    "text": "Senior House Republican says GOP members ready to block Jordan  —  A number of House Republicans are in talks to block Rep. Jim Jordan's path to the speakership as the Ohio Republican tries to force a floor vote on Tuesday, according to multiple GOP sources.",
    "url": "https://www.cnn.com/2023/10/15/politics/jim-jordan-house-republicans-speaker/"
  },
  {
    "text": "Jordan Activates Right-Wing Pressure Campaign in Push to Win Speakership  —  Allies of the Ohio Republican, who must persuade scores of his colleagues to support his bid for speaker, are threatening right-wing retribution to any G.O.P. lawmakers who dare oppose him.",
    "url": "https://www.nytimes.com/2023/10/14/us/house-speaker-republicans-jordan.html"
  },
  {
    "text": "Jim Jordan's pressure campaign the ‘dumbest thing you can do,’ one House Republican says  —  Nobody likes a bully, Rep. Dan Crenshaw said.  —  Rep. Dan Crenshaw (R-Texas) has some advice for Rep. Jim Jordan as he and his allies attempt to pressure his way to the speakership:  —  Chill.",
    "url": "https://www.politico.com/news/2023/10/15/jim-jordan-bullying-dan-crenshaw-00121609"
  },
  {
    "text": "Turner: If GOP can't elect Speaker then ‘deal will have to be done’ with Democrats  —  Rep. Mike Turner (R-Ohio) said Sunday if House Republicans cannot elect a Speaker soon then a “deal will have to be done” with Democrats in order to get the chamber running again, as it nears two weeks since … ",
    "url": "https://thehill.com/homenews/house/4257216-turner-if-gop-cant-elect-speaker-then-deal-will-have-to-be-done-with-democrats/"
  },
  {
    "text": "House Republicans' Chaos Is Making Biden's Split-Screen Strategy a Lot Easier  —  Biden wants to run on his ability to govern.  House Republicans' inability to do just that plays into the Democrat's 2024 strategy … Joe Biden's reelection strategy relies on painting Republicans as chaotic, disorganized, and unserious.",
    "url": "https://themessenger.com/politics/biden-house-republican-chaos-contrast-strategy"
  },
  {
    "text": "Supplemental funding request for aid to Israel and Ukraine could come this week  —  Senate Majority Leader Chuck Schumer said during a trip to Tel Aviv this weekend that the upper chamber would move first and not wait for the House.  —  Top lawmakers are preparing for a supplemental funding request … ",
    "url": "https://www.nbcnews.com/politics/congress/supplemental-funding-request-aid-israel-ukraine-come-week-rcna120509"
  },
  {
    "text": "Driving 100 miles in labor; giving birth in the ER: Fears rise as 3 maternity units prepare to close in Alabama  —  The state has one of the country's highest maternal mortality rates.  Now, three hospitals plan to stop delivering babies, putting some pregnant women at even higher risk.",
    "url": "https://www.nbcnews.com/health/womens-health/3-hospitals-closing-maternity-labor-delivery-units-alabama-rcna111374"
  },
  {
    "text": "GOPer cut off by CNN host for anti-immigrant rant when asked about Gaza refugees  —  During an appearance on CNN on Sunday morning, host Victor Blackwell was forced to shut down a House Republican who took advantage of a question about what to do with Palestinian refugees to attack President Joe Biden over immigration in the U.S.",
    "url": "https://www.rawstory.com/gaza-palestinian-refugees/"
  },
  {
    "text": "Security Alert #10  —  Home الصفحة الرئيسية / News & Events / Security Alert #10  —  Event:  The U.S. government is assisting U.S. nationals and their immediate family members with a valid travel document … ",
    "url": "https://il.usembassy.gov/security-alert-10/"
  },
  {
    "text": "Boebert spent campaign cash at Beetlejuice boyfriend's bar  —  The Colorado congresswoman dropped a few hundred bucks at Hooch, a place that hosts drag shows.  —  Well before Rep. Lauren Boebert and her date got thrown out of a local theater showing of Beetlejuice for being disruptive and frisky … ",
    "url": "https://www.politico.com/news/2023/10/15/boebert-campaign-cash-beetlejuice-bar-00121606"
  },
  {
    "text": "How hackers piled onto the Israeli-Hamas conflict  —  Lower-level cyberattacks are becoming a major feature of the war between Israel and Hamas, and the attacks could ramp up in intensity.  —  Hackers sympathetic to Hamas are working to make the Israel-Gaza conflict the next front of cyberwarfare.",
    "url": "https://www.politico.com/news/2023/10/15/hackers-israel-hamas-war-00121593"
  },
  {
    "text": "Republican Jeff Landry Wins The Louisiana Governor's Race, Reclaims Office For GOP  —  Attorney General Jeff Landry has won Louisiana governor's seat, fending off a crowded field of candidates.  —  LOADING  —  Attorney General Jeff Landry, a Republican backed by former President Donald Trump … ",
    "url": "https://www.huffpost.com/entry/election-2023-louisiana-governor_n_652b5af4e4b00565b6204b47"
  },
  {
    "text": "Blackburn Calls For Removal Of Jake Sullivan As National Security Advisor  —  NASHVILLE, TENN. - U.S. Senator Marsha Blackburn (R-Tenn.) today called on President Biden to remove Jake Sullivan from his post as National Security Advisor to the United States.  —  Right Before The Attack On Israel … ",
    "url": "https://www.blackburn.senate.gov/2023/10/blackburn-calls-for-removal-of-jake-sullivan-as-national-security-advisor"
  },
  {
    "text": "Biden, DNC raise $71 million in third quarter  —  It's a large, though not record-breaking, amount that has allowed Biden to launch an earlier TV and digital advertising campaign than past presidents' reelection efforts.  —  President Joe Biden, the Democratic National Committee … ",
    "url": "https://www.politico.com/news/2023/10/15/biden-dnc-fundraising-fec-00121591"
  },
  {
    "text": "Why Israel Is Acting This Way  —  With the Middle East on the cusp of a full-blown ground war, I was thinking on Friday morning about how Israel's last two major wars have two very important things in common: They were both started by nonstate actors backed by Iran — Hezbollah from Lebanon … ",
    "url": "https://www.nytimes.com/2023/10/14/opinion/international-world/israel-hamas-war.html"
  }
]