[
  {
    "text": "The Republican Plot Against Donald Trump  —  The Republican Plot Against Donald Trump  —  The inside story of how Congress is pursuing endless war in Ukraine—and trying to stop a Trump election.  —  This weekend, Senate Democrats (joined by a few Republicans, including most Republican leadership) … ",
    "url": "https://www.theamericanconservative.com/how-congress-is-pursuing-endless-war-in-ukraine-and-trying-to-stop-a-trump-election/"
  },
  {
    "text": "Donald Trump and Tucker Carlson gave Putin exactly want he wants  —  It is no coincidence that Trump made his biggest threat against NATO right after Tucker Carlson sat with Putin  —  As we all know, the biggest story in the world is the breaking news that President Joe Biden is old.",
    "url": "https://www.salon.com/2024/02/12/donald-and-tucker-carlson-gave-putin-exactly-want-he-wants/"
  },
  {
    "text": "Call and Response: Putin Demanded Greater Russia and Trump Agreed  —  Over the weekend, Putin and Donald Trump seem to have come to public agreement that, if elected in November, Trump would help Putin pursue Greater Russia.  —  In his session with Tucker Carlson, after all … ",
    "url": "https://www.emptywheel.net/2024/02/12/call-and-response-putin-is-demanding-greater-russia/"
  },
  {
    "text": "Rubio dismisses concerns about Trump's NATO remarks as backlash mounts  —  GOP Sen. Marco Rubio defended former President Donald Trump's controversial comment that he would encourage Russia to do “whatever the hell they want” to a NATO member country that didn't meet defense spending guidelines.",
    "url": "https://www.cnn.com/2024/02/11/politics/rubio-trump-nato-haley-husband-national-guard-cnntv/"
  },
  {
    "text": "Trump Faces Fraud Trial Ruling and Criminal Trial Hearing in NY Next Week  —  Donald Trump faces a ruling in a civil fraud case that could drain his cash coffers.  He may also receive a court date for what would be the first criminal trial of a former U.S. president.",
    "url": "https://www.nytimes.com/2024/02/12/nyregion/trump-civil-criminal-trial.html"
  },
  {
    "text": "Media creates Biden “fitness” crisis  —  Robert Hur, the Republican special prosecutor assigned to investigate President Biden, is a lawyer, not a doctor.  On Thursday, Hur issued a lengthy report that came to the legal conclusion that charges against Biden for mishandling classified materials were not warranted.",
    "url": "https://popular.info/p/manufacturing-a-political-crisis"
  },
  {
    "text": "Jack Smith's Subtle Shot at Trump Mar-a-Lago Judge Aileen Cannon  —  Federal prosecutors working on the Donald Trump Mar-a-Lago documents case are trying to convince Judge Aileen Cannon by pointing to cases she worked on at the DOJ.  —  Faced with a federal judge in the Donald Trump Mar … ",
    "url": "https://www.thedailybeast.com/jack-smiths-subtle-shot-at-trump-mar-a-lago-judge-aileen-cannon"
  },
  {
    "text": "‘The voice we woke up to’: Bob Edwards, longtime ‘Morning Edition’ host, dies at 76  —  Bob Edwards, the veteran broadcaster and longtime host of Morning Edition who left an indelible mark on NPR's sound, has died.  He was 76 years old.  —  NPR's Susan Stamberg says Edwards' voice became part … ",
    "url": "https://www.npr.org/2024/02/12/165681524/bob-edwards-dead-npr-host"
  },
  {
    "text": "Austin cancels trip to Brussels for Ukraine meeting due to hospitalization  —  This week's Ukraine Defense Contact Group meeting will now be held virtually.  —  Defense Secretary Lloyd Austin on Monday canceled a planned trip to Brussels for a meeting on Ukraine aid this week after being admitted … ",
    "url": "https://www.politico.com/news/2024/02/12/austin-brussels-ukraine-00140953"
  },
  {
    "text": "Former RNC Chair Comes Up With Damning New Way To Describe Trump Supporters  —  Michael Steele asked why some voters don't just get what the former president is about.  —  LOADING  —  Michael Steele, a former chair of the Republican National Committee, on Sunday, ripped Donald Trump supporters as … ",
    "url": "https://www.huffpost.com/entry/michael-steele-donald-trump-supporters_n_65ca0c52e4b067c6b73da848"
  },
  {
    "text": "“lol hey guys”: Biden campaign joins TikTok to reach young voters  —  President Biden's re-election campaign officially launched its TikTok account on Sunday with a Super Bowl-themed video. … - By Monday morning, the video had 3.9 million views.  — “In a media ecosystem that is more fragmented … ",
    "url": "https://www.axios.com/2024/02/12/biden-campaign-tiktok-account-first-video"
  },
  {
    "text": "Exclusive: How Biden botched the border  —  Aboard Air Force One en route to tour the southern border in January 2023, President Biden sat at the head of his conference table and exploded with fury.  — The president lit into his team, which included then-Deputy Chief of Staff Jen O'Malley Dillon … ",
    "url": "https://www.axios.com/2024/02/12/how-biden-botched-border"
  },
  {
    "text": "Violent crime is dropping fast in the U.S. — even if Americans don't believe it  —  In 2020, the United States experienced one of its most dangerous years in decades.  —  The number of murders across the country surged by nearly 30% between 2019 and 2020, according to FBI statistics.",
    "url": "https://www.npr.org/2024/02/12/1229891045/police-crime-baltimore-san-francisco-minneapolis-murder-statistics"
  },
  {
    "text": "Kamala Harris Says She Is Ready to Serve as Biden Faces Age Scrutiny  —  In a recent interview, the vice president cites her ‘capacity to lead’ after stops on her abortion-rights tour  —  Vice President Kamala Harris was detailing her priorities for the campaign during a flight on Air Force … ",
    "url": "https://www.wsj.com/politics/elections/kamala-harris-says-she-is-ready-to-serve-as-biden-faces-age-scrutiny-8f39c442"
  },
  {
    "text": "The Tech Plutocrats Dreaming of a Right-Wing San Francisco  —  On a Friday night in late January, the leader of a famed San Francisco venture capital firm got drunk and launched into a profanity-laced tirade on social media.  Garry Tan, the Y Combinator CEO currently spearheading … ",
    "url": "https://newrepublic.com/article/178675/garry-tan-tech-san-francisco"
  }
]