[
  {
    "text": "Here's how Republicans are planning to throw millions off Medicaid and lie about it  —  Trump is teaching his minions to say, “We didn't insure anyone\"/\"They deserved it.\"  —  A lot of the horror in the Donald Trump sequel is new.  —  Sure, he was terrible the first time James Comey and Vladimir Putin made him president.",
    "url": "https://thelastbillionaires.com/heres-how-republicans-are-planning-to-throw-millions-off-medicaid-and-lie-about-it/"
  },
  {
    "text": "These Republicans have a lot to lose if Congress cuts Medicaid  —  GOP lawmakers expected to vote soon on slashing the insurance program for low-income people represent tens of millions reliant on it.  —  House Republicans who represent large numbers of Medicaid recipients are pushing … ",
    "url": "https://www.politico.com/news/2025/02/24/medicaid-gop-cuts-republicans-congress-00205542"
  },
  {
    "text": "Playbook: A date that will live in infamy  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  Good Monday morning.  This is Jack Blanchard, absolutely ready for temperatures to hit a heady 55F today.  —  THE LATEST JAW-DROPPER: President Donald Trump announced last night … ",
    "url": "https://www.politico.com/newsletters/playbook/2025/02/24/a-date-that-will-live-in-infamy-00205684"
  },
  {
    "text": "UPDATE on town hall chaos: Woman who was dragged out speaks, police chief condemns security, name of security firm confirmed  —  COEUR d'ALENE — A legislative town hall organized by the Kootenai County Republican Central Committee devolved into chaos Saturday when unidentified … ",
    "url": "https://cdapress.com/news/2025/feb/23/update-on-town-hall-chaos-woman-who-was-dragged-out-speaks-police-chief-condemns-security-name-of-security-firm-confirmed/"
  },
  {
    "text": "DOGE is the Theranos of Cost-Cutting  —  And other notes from the Chaos  —  Today's post will really be two short posts on different but related topics: The failure of DOGE to make any progress on its stated goals, and what's beginning to look like a rapid loss of confidence in Donald Trump's economic policies.",
    "url": "https://paulkrugman.substack.com/p/doge-is-the-theranos-of-cost-cutting"
  },
  {
    "text": "Germany's Merz vows ‘independence’ from Trump's America, warning NATO may soon be dead  —  BERLIN — Friedrich Merz did not even wait for the final results in Germany's election before delivering what could well be a defining verdict on U.S. President Donald Trump, consigning Europe's 80-year alliance with the United States to the past.",
    "url": "https://www.politico.eu/article/friedrich-merz-germany-election-united-states-donald-trump-nato/"
  },
  {
    "text": "Right-Wing Commentator Named F.B.I. Deputy Director  —  The choice of Dan Bongino is a radical departure from the bureau's history of having a veteran agent serve in the key role that oversees operations.  —  Dan Bongino, a former New York City police officer and Secret Service agent turned right-wing pundit … ",
    "url": "https://www.nytimes.com/2025/02/23/us/politics/dan-bongino-fbi-deputy-director.html?unlocked_article_code=1.zU4.1vIW.Wcj-dF2XlL1J"
  },
  {
    "text": "Trump deploys SpongeBob meme to troll DOGE critics  —  Trump shared the meme on Truth Social shortly after Musk shared it on X  —  President Donald Trump shared a SpongeBob SquarePants-themed meme after Elon Musk announced that federal workers would receive an email seeking information about what they accomplished last week.",
    "url": "https://www.foxnews.com/politics/trump-deploys-spongebob-meme-troll-doge-critics"
  },
  {
    "text": "Apple, Under Threat from Trump Tariffs, Will Add 20,000 US Jobs  — Company to begin producing Apple Intelligence servers in Texas  — $500 billion planned to be invested in US over next four years  —  Apple Inc., as it seeks relief from US President Donald Trump's tariffs on goods imported … ",
    "url": "https://www.bloomberg.com/news/articles/2025-02-24/apple-says-it-will-add-20-000-jobs-spend-500-billion-produce-ai-servers-in-us"
  },
  {
    "text": "The U.S. Economy Depends More Than Ever on Rich People  —  The highest-earning 10% of Americans have increased their spending far beyond inflation.  Everyone else hasn't.",
    "url": "https://www.wsj.com/economy/consumers/us-economy-strength-rich-spending-2c34a571?st=ohfAkF&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Angry Democratic donors turn off the flow of money  —  Democrats are anxious to rebuild their party on the heels of President Trump's victory in November.  But they have a major problem as they try to refashion their brand: The money isn't there.  —  Democratic donors … ",
    "url": "https://thehill.com/homenews/campaign/5158323-democrats-struggle-rebuild-party/"
  },
  {
    "text": "Foreign leaders visit Ukraine to show their support on war's 3rd anniversary  —  A dozen leaders from Europe and Canada visited Ukraine's capital Monday to mark the third anniversary of Russia's invasion in a show of support by some of Kyiv's most important backers for the nation at war.",
    "url": "https://apnews.com/article/russia-ukraine-war-anniversary-84e4c62519fc15b34e17f661cf3dd20e"
  },
  {
    "text": "The Trump Administration Keeps Citing an Untrue Stat as It Targets Federal Workers  —  A “survey of our niche audience for our niche audience” was the source for the claim that only 6% of federal employees are working full time in their offices.  The number isn't true.",
    "url": "https://www.propublica.org/article/federal-employees-work-from-home-trump-myth"
  },
  {
    "text": "As Facebook Abandons Fact-Checking, It's Also Offering Bonuses for Viral Content  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up to receive our biggest stories as soon as they're published.  —  Hours after Donald Trump was sworn in as president … ",
    "url": "https://www.propublica.org/article/facebook-meta-abandons-fact-checking-boosts-viral-content"
  },
  {
    "text": "Supreme Court rejects challenges to abortion clinic ‘buffer zone’ laws that restrict protesters  —  The two cases questioned a longstanding precedent that upheld such laws, which opponents say violate free speech rights.  —  WASHINGTON — The Supreme Court on Monday declined to consider overturning … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-rejects-challenges-abortion-clinic-buffer-zone-laws-rest-rcna180658"
  },
  {
    "text": "The inside story of how President Trump came to name the ‘Gulf of America’  —  Weeks before retaking office, Trump decided to add the measure to his Day 1 agenda, elevating a liberal joke that had become a conservative meme into an action that has come to symbolize the tenor of his term.",
    "url": "https://www.washingtonpost.com/politics/2025/02/24/trump-gulf-of-america-renamed-what-happened/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQwMzczMjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQxNzUxOTk5LCJpYXQiOjE3NDAzNzMyMDAsImp0aSI6IjQ3MDAwZjE4LWMyODQtNDkyOS1hNjE4LTA0OTJlZmRjNDRkYyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzAyLzI0L3RydW1wLWd1bGYtb2YtYW1lcmljYS1yZW5hbWVkLXdoYXQtaGFwcGVuZWQvIn0.9Ldp_vxPRIVvvxISIUSjzWoW92hgPwWKT2a4Dif9eXY"
  },
  {
    "text": "Trump Just Fired 6,700 I.R.S. Workers in the Middle of Tax Season.  That's a Huge Mistake.  —  If you were to ask the top chief executives in the world to name the best strategy to attack waste in their organizations and balance the books, there is one answer you would be very … ",
    "url": "https://www.nytimes.com/2025/02/24/opinion/irs-taxes-trump.html?unlocked_article_code=1.zU4.-lFt.4XVjzzGf7NV5&smid=bs-share"
  },
  {
    "text": "What Felt Impossible Became Possible  —  I've spent many hours since the election reading about the Ku Klux Klan in the 1920s.  It started the day after election day when I had hours to kill in the lobby of a Hampton Inn, waiting for a room to open up.  I loaded a library archive page up on my phone … ",
    "url": "https://dansinker.com/posts/2025-02-23-dale/"
  },
  {
    "text": "How the Trump and DOGE terminations — perhaps the biggest job cuts in history — may affect the economy … The Trump administration's purge of federal workers may ultimately amount to the biggest job cut in U.S. history, which is likely to have ramifications for the economy, especially at the local level, according to economists.",
    "url": "https://www.cnbc.com/2025/02/23/how-trump-doge-job-cuts-may-affect-the-us-economy.html"
  },
  {
    "text": "Live updates: Federal workers face mass confusion as Musk's deadline to list accomplishments looms  —  Elon Musk began his appearance at the Conservative Political Action Conference brandishing a chainsaw that was gifted to him by Argentine President Javier Milei.",
    "url": "https://apnews.com/live/donald-trump-news-2-24-2025#00000195-386c-da26-a3d5-b87c3e300000"
  },
  {
    "text": "Just 1 in 3 approve of job Trump doing on inflation: Survey  —  Just 1 in 3 people approve of the job President Trump is doing to curb inflation, a survey released Sunday found.  —  Thirty-two percent of respondents in the poll, released Sunday by Reuters and Ipsos, approve of the job Trump … ",
    "url": "https://thehill.com/blogs/blog-briefing-room/5160649-trump-inflation-approval/"
  },
  {
    "text": "'It's Over!'  James Carville Tells Dan Abrams the Trump White House Will Suffer a ‘Massive Collapse’ in ‘Less Than 30 Days’  —  Veteran Democratic strategist James Carville told Mediaite's Dan Abrams that the Trump administration would “collapse” within 30 days and advised Democrats to sit back and let it happen.",
    "url": "https://www.mediaite.com/politics/its-over-james-carville-tells-dan-abrams-the-trump-white-house-will-suffer-a-massive-collapse-in-less-than-30-days/"
  },
  {
    "text": "Fiasco for Musk as Trump Officials Openly Defy Him amid New GOP Panic  —  House Republicans are suddenly facing angry voter revolts back at home over Elon Musk's so-called Department of Government Efficiency.  Some of them are reportedly in a “panic” about DOGE's increasingly destructive cuts and firings.",
    "url": "https://newrepublic.com/article/191847/fiasco-musk-trump-officials-openly-defy-amid-new-gop-panic"
  },
  {
    "text": "Outside Tesla in the Philly suburbs, the green shoots of an American uprising  —  There was a mad-as-hell-can't-take-it-anymore moment for every one of the dozen or so sign-waving protesters who stood on the side of busy Route 30 in suburban Devon on a brisk but brightly sunny Saturday morning … ",
    "url": "https://www.inquirer.com/opinion/commentary/tesla-protest-philadelphia-elon-musk-20250223.html"
  },
  {
    "text": "To stop corruption and rescue democracy, we must take money out of politics  —  Last October, two-thirds of Americans said the erosion of democracy over the next decade was the nation's most pressing threat.  It took just a few days into his second presidency for Donald Trump to set off a mudslide.",
    "url": "https://thehill.com/opinion/campaign/5158090-trump-corruption-money-democracy/"
  }
]