[
  {
    "text": "Republican Voters Can — and Should — Rethink Nominating Trump  —  To say Donald Trump is the front-runner for the Republican nomination is an understatement.  He is above 60 percent in national polling averages and leads by roughly 30 points in Iowa.  His lead is much narrower in New Hampshire … ",
    "url": "https://www.nationalreview.com/2024/01/republican-voters-can-and-should-rethink-nominating-trump/"
  },
  {
    "text": "Democrats play a dangerous game with dire warnings about Trump  —  Democrats would have you believe that our very democracy is at risk in the 2024 election.  They may be right, but not for the reason they say.  —  That's because in the past, the low-level demagoguery of American politics was never really existential.",
    "url": "https://thehill.com/opinion/4399126-mulvaney-democrats-play-a-dangerous-game-with-dire-warnings-about-trump/"
  },
  {
    "text": "Why Haley Won't Break Through  —  Today's GOP is split along class lines, and her college-grad supporters aren't the majority.  —  WAUKEE, Iowa —  Nikki Haley's Tuesday rally outside Des Moines was a fittingly pedestrian event in this desultory excuse of a presidential primary.",
    "url": "https://www.politico.com/news/magazine/2024/01/10/haley-iowa-2024-primary-trump-00134703"
  },
  {
    "text": "Hunter Biden makes surprise appearance at House contempt hearing  —  President's son also made an unexpected appearance last December to blast House Republicans who have subpoenaed him  —  Hunter Biden made an unexpected appearance on Capitol Hill on Wednesday morning … ",
    "url": "https://www.washingtonpost.com/politics/2024/01/10/biden-surprise-appearance-contempt-hearing/"
  },
  {
    "text": "Hunter Biden makes surprise appearance at contempt of Congress hearing  —  Hunter Biden made a surprise appearance at a markup of the House Oversight Committee on Wednesday as the panel considers a resolution to hold the president's son in contempt of Congress for defying a subpoena last month.",
    "url": "https://thehill.com/homenews/house/4400047-hunter-biden-contempt-of-congress-hearing/"
  },
  {
    "text": "Speaker Johnson, Desperate To Avoid Mutiny, To Call Trump For Approval Check  —  'He and I have a very close relationship.  He's been an enthusiastic supporter of my leadership here,\" Johnson said of Trump  —  House Speaker Mike Johnson is reaching for the ultimate lifeline on Wednesday … ",
    "url": "https://themessenger.com/politics/speaker-johnson-desperate-to-avoid-mutiny-to-call-trump-for-approval-check"
  },
  {
    "text": "Trump prosecutor accused of ‘improper’ relationship with Georgia DA Fani Willis billed $4K for meetings with WH officials  —  The special prosecutor that Georgia District Attorney Fani Willis is accused of having an “improper” relationship with billed the Fulton County DA's office $4,000 … ",
    "url": "https://nypost.com/2024/01/10/news/trump-prosecutor-nathan-wade-billed-georgia-da-4000-for-white-house-meetings/"
  },
  {
    "text": "Florida school district removes dictionaries from libraries, citing law championed by DeSantis  —  The Escambia County School District, located in the Florida panhandle, has removed several dictionaries from its library shelves over concerns that making the dictionaries available to students would violate Florida law.",
    "url": "https://popular.info/p/florida-school-district-removes-dictionaries"
  },
  {
    "text": "Trump's Bad Day in Court  —  The first of many to come  —  Following Tuesday morning's oral argument in the District of Columbia, Donald Trump made some predictable comments to the press from a Washington, D.C., hotel.  As he finished, a reporter shouted out a request that he use the moment to tell his followers, “No violence.”",
    "url": "https://joycevance.substack.com/p/trumps-bad-day-in-court"
  },
  {
    "text": "Republican governors in 15 states reject summer food money for kids  —  Moving beyond efforts to block expansion of health care for the poor and disabled, Republican governors in 15 states are now rejecting a new, federally funded summer program to give food assistance to hungry children.",
    "url": "https://www.washingtonpost.com/nation/2024/01/10/republican-governors-summer-lunch-program/"
  },
  {
    "text": "Judge Signals Trump Is Doomed in New E. Jean Carroll Trial  —  In a 27-page order, the judge overseeing the E. Jean Carroll case essentially sides entirely against Trump and suggests the case is basically already decided.  —  With Donald Trump's second rape defamation trial only one week away … ",
    "url": "https://www.thedailybeast.com/judge-signals-trump-is-doomed-in-new-e-jean-carroll-trial"
  },
  {
    "text": "Lauren Boebert's Ex-Husband Arrested on Weapons and Assault Charges  —  In addition to the assault and weapons counts, Boebert was also charged with harassment (\"strikes shoves, kicks\"), disorderly conduct, and trespassing, jail records show.  —  Jayson Boebert, the former husband of Rep. Lauren Boebert … ",
    "url": "https://www.thedailybeast.com/lauren-boeberts-ex-husband-arrested-on-weapons-and-assault-charges"
  },
  {
    "text": "Bosses in the Biden admin are pressed over young staffers' anonymous letters  —  Protest letters, like those over Israel, were rare in past administrations.  White House veterans can barely contain their disdain over how times have changed.  —  Protest culture is shattering the last remaining barriers … ",
    "url": "https://www.politico.com/news/2024/01/10/white-house-biden-staffers-00134688"
  },
  {
    "text": "Psst: Joe Biden Has Solved the Student Debt Crisis  —  This past fall, with student loan payments set to resume after the pandemic pause, dread was setting in.  My pre-pandemic monthly payments had been a crippling burden that made saving money impossible; the pause was a lifeline that had allowed … ",
    "url": "https://washingtonmonthly.com/2024/01/10/psst-joe-biden-has-solved-the-student-debt-crisis/"
  },
  {
    "text": "Starbucks sued for allegedly using coffee from farms with rights abuses while touting its ‘ethical’ sourcing  —  The lawsuit calls for the coffee chain to end its “unfair and deceptive” trade practices and argues that the company is aware of the child and forced labor on some of its supplier farms.",
    "url": "https://www.nbcnews.com/news/us-news/starbucks-sued-allegedly-using-coffee-farms-rights-abuses-touting-ethi-rcna130393"
  },
  {
    "text": "‘It was a mirage’: States face budget woes as huge infusions of federal cash run out  —  Huge buckets of pandemic funding allowed states to boost spending and cut taxes, but now the windfall has run out  —  The pandemic boom times are over for state lawmakers — and so is their ability … ",
    "url": "https://www.politico.com/news/2024/01/09/state-budgets-2024-pandemic-spending-00134549"
  },
  {
    "text": "Republican Officials Openly Insult Women Nearly Killed by Abortion Bans  —  Red states would rather let a patient die than let her terminate a dangerous pregnancy.  And they're barely pretending otherwise.  —  For many years before S.B. 8 passed in Texas and was then swept into existence … ",
    "url": "https://slate.com/news-and-politics/2024/01/republican-abortion-bans-pregnant-women-deaths.html"
  },
  {
    "text": "Trump says he was never on Epstein's plane or ‘stupid island’  —  President Trump denounced reports of his association with Jeffrey Epstein Tuesday, arguing he had never been on the convicted sex trafficker's plane or “stupid island” after images of the two made by artificial intelligence (AI) surfaced online.",
    "url": "https://thehill.com/regulation/court-battles/4399706-trump-jeffrey-epstein-never-on-plane-island/"
  },
  {
    "text": "Constitutional Law Scholars on the Impeachment Proceedings Against Secretary of Homeland Security Alejandro Mayorkas  —  Joined by an extraordinary group of constitutional experts, we have published an open letter concerning the impeachment proceedings against Secretary of Homeland Security Alejandro Mayorkas.",
    "url": "https://www.justsecurity.org/91123/constitutional-law-scholars-on-the-impeachment-proceedings-against-secretary-of-homeland-security-alejandro-mayorkas/"
  }
]