[
  {
    "text": "‘It just exploded’: Springfield woman claims she never meant to spark false rumors about Haitians  —  The woman behind an early Facebook post that helped spark baseless rumors about Haitians eating pets told NBC News that she feels for the immigrant community.",
    "url": "https://www.nbcnews.com/news/us-news/-just-exploded-springfield-woman-says-never-meant-spark-rumors-haitian-rcna171099"
  },
  {
    "text": "'They've destroyed the place': Trump repeats racist, anti-immigrant lies  —  Trump spews hate again toward Ohio's Haitian migrants, where residents are fearful over bomb threats and hate  —  Donald Trump repeated racist claims about Haitian migrants in Springfield, Ohio, on Friday … ",
    "url": "https://www.theguardian.com/us-news/2024/sep/13/trump-repeats-lies-haitian-immigrants"
  },
  {
    "text": "Trump's false claim about Haitian immigrants eating pets invokes racist trope  —  The baseless assertion that immigrants in Ohio are eating people's pets mirrors claims that have been used against migrants since the 1800s, scholars and historians say.  —  For days, Donald Trump and his allies … ",
    "url": "https://www.washingtonpost.com/politics/2024/09/14/trump-immigrants-eating-pets-racist-stereotype/"
  },
  {
    "text": "Haitian immigrants helped revive a struggling Ohio town.  Then neo-Nazis turned up  —  Springfield's immigrant community was targeted by far-right extremists months before Trump shared racist rumors  —  While Donald Trump made baseless, dangerous claims that immigrants in Ohio … ",
    "url": "https://www.theguardian.com/us-news/2024/sep/14/neo-nazis-springfield-ohio-haitian-immigrants"
  },
  {
    "text": "Trump pledges “largest deportation” in U.S. history, starting in Ohio and Colorado … - “And we're going to start with Springfield and Aurora.”  — Trump also said he may hold campaign events in one or both cities. … - He also referenced exaggerated claims about Venezuelan gang activity in Aurora … ",
    "url": "https://www.axios.com/2024/09/13/trump-deportation-immigrants-springfield-ohio-aurora-colorado"
  },
  {
    "text": "Trump's Vile Lie About Haitians Is the Latest in a Long and Grim Tradition  —  When my family moved back to the United States from East Africa in the mid-1980s, one might have thought it was a peak time of compassion for people suffering in faraway places.  A glittering group of music superstars … ",
    "url": "https://www.nytimes.com/2024/09/14/opinion/trump-debate-haitians-pets.html"
  },
  {
    "text": "GOP lawmaker's wife accuses him of an affair — and points the finger at the wrong woman  —  The House Homeland Security chair, who is seeking a divorce, acknowledged “a difficult time for my family.”  —  House Homeland Security Chair Mark Green engaged in an extramarital affair … ",
    "url": "https://www.politico.com/news/2024/09/13/mark-green-affair-accusation-legal-threats-00179148"
  },
  {
    "text": "Rep. Mark Green Accused by Wife of Affair with Younger Woman  —  Updated at 1:50 p.m. with a comment from Green.  —  Republican Congressman Mark Green has filed for divorce from his wife of 35 years after having an affair, according to a dispatch from his wife.",
    "url": "https://nashvillebanner.com/2024/09/13/mark-green-divorce-affair/"
  },
  {
    "text": "Inside Team Trump's Plans For Mass Deportation Camps  —  A key Trump White House adviser said the operation would be “greater than any national infrastructure project we've done to date” as a country.  —  Five years ago, Kris Kobach, Kansas' former secretary of state, announced on Fox Business Network that … ",
    "url": "https://www.huffpost.com/entry/trump-deportation-camps_n_66e4793de4b03e3cc10020c3"
  },
  {
    "text": "The Star-Making Machine That Created ‘Donald Trump’ … Donald Trump had mostly luck to credit for being discovered, at age 57, by Mark Burnett, then the hottest name in the hottest new television genre.Chester Higgins Jr./The New York Times  —  Late in the summer of 2003 … ",
    "url": "https://www.nytimes.com/2024/09/14/business/donald-trump-apprentice.html?unlocked_article_code=1.Kk4.zHgy.nLhXqvv5iELM&smid=em-share"
  },
  {
    "text": "Harris campaign targets Latinos in new ad blitz focused on boxing matches and baseball games  —  The Harris campaign is especially focused on reaching undecided Latino voters who may be persuaded by some of former President Donald Trump's economic message.  —  WASHINGTON — The Harris campaign … ",
    "url": "https://www.nbcnews.com/politics/2024-election/harris-campaign-aims-bolster-latino-support-spending-blitz-rcna171113"
  },
  {
    "text": "Obamas and Clintons to hit the campaign trail for Harris in the final stretch  —  Energized by their speeches at the Democratic National Convention last month, the Clintons and Obamas will travel the country to help Harris reach key voters over the coming weeks.",
    "url": "https://www.nbcnews.com/politics/2024-election/obamas-clintons-campaign-trial-kamala-harris-election-2024-rcna171091"
  },
  {
    "text": "Lynda Carter's Sister Is Running in a Key Arizona Race.  Wonder Woman Is Sounding the Alarm.  —  Pamela Carter, a right-wing abortion foe, claims to have her family's “full support” for her candidacy.  Not exactly.  —  Arizona's fourth legislative district, located in the suburban heart … ",
    "url": "https://www.motherjones.com/politics/2024/09/lynda-carter-wonder-woman-pamela-carter-arizona-state-house-race/"
  },
  {
    "text": "Harris and Trump place their chips on different states to win White House  —  A compressed battleground map has given each campaign a defensive electoral college wall, and they overlap in the crucial state of Pennsylvania.  —  Democrats have spent the last year eyeing a familiar trio … ",
    "url": "https://www.washingtonpost.com/politics/2024/09/14/harris-trump-place-their-chips-different-states-win-white-house/"
  },
  {
    "text": "Georgia's Top GOP Lawmaker Seeks Tougher Action Against Students Who Make Threats.  But It May Not Make Schools Safer.  —  To deter violence, research suggests the best strategy is not harsh punishment for threats but a different tactic, one based on decades of interviews with mass shooters … ",
    "url": "https://www.propublica.org/article/apalachee-high-school-shooting-threats-response"
  },
  {
    "text": "Republicans sued three battleground states this week.  Here's what you need to know  —  Republicans are reprising efforts to legally challenge election law in three key battleground states that could help decide who wins in November.  —  Michigan, North Carolina and Nevada are targets of the blitz … ",
    "url": "https://thehill.com/regulation/court-battles/4879631-republicans-sue-battleground-states/"
  },
  {
    "text": "Trump says he doesn't agree with Loomer statements  —  Former President Trump said in a Truth Social post Friday that he did not agree with statements made by far-right activist Laura Loomer, who has come under scrutiny after traveling with the former president and battling with various other Republicans friendly with Trump.",
    "url": "https://thehill.com/homenews/campaign/4878970-trump-laura-loomer-association/"
  },
  {
    "text": "Trump says he would withhold California fire aid unless Newsom ‘signs those papers’  — Rancho Palos Verdes Mayor John Cruikshank met with Trump and spoke briefly about city's struggle to deal with land movement.  — Trump portrayed California as crime-ridden, water-starved and flooded with immigrants in the country illegally.",
    "url": "https://www.latimes.com/politics/story/2024-09-13/2024-election-trump-rancho-palos-verdes-news-conference"
  }
]