[
  {
    "text": "Republicans are weaponizing a boring House tradition.  The result is more paralysis.  —  GOP rebels are tanking “rules” to push their demands, raising the threshold to pass legislation to a supermajority and making the House look more like the Senate.  —  WASHINGTON — When Speaker Mike Johnson … ",
    "url": "https://www.nbcnews.com/politics/congress/republicans-are-weaponizing-boring-house-tradition-result-paralysis-rcna136436"
  },
  {
    "text": "Impeaching Mayorkas Achieves Nothing  —  A policy dispute doesn't qualify as a high crime and misdemeanor.  —  House Republicans are marking up articles of impeachment against Homeland Security Secretary Alejandro Mayorkas, and the question is why?  As much as we share the frustration … ",
    "url": "https://www.wsj.com/articles/alejandro-mayorkas-impeachment-house-republicans-border-immigration-homeland-security-1a431a5d?mod=followamazon"
  },
  {
    "text": "As judges mull presidential immunity, Trump reaps the benefits of delay  —  For over three weeks, the D.C. Circuit has been sitting on a potentially decisive question.  —  Whether Donald Trump faces a potential prison sentence in 2024 is at the mercy of a federal appeals court that's operating … ",
    "url": "https://www.politico.com/news/2024/01/31/trump-trial-immunity-delay-00138688"
  },
  {
    "text": "Pennsylvania man arrested after allegedly decapitating his father and displaying his head on YouTube  —  In the video, which has since been removed, Justin Mohn says his father was a federal employee and refers to him as a traitor while voicing right-wing conspiracy theories.",
    "url": "https://www.nbcnews.com/news/us-news/pa-man-arrested-decapitating-father-youtube-video-rcna136509"
  },
  {
    "text": "Why Trumpers are losing it over Taylor Swift  —  Swift goes to football games to support her boyfriend, shattering MAGA brains. … MAGA this week at last found its true, final, most hated enemy.  Not Barack Obama.  Not Hilary Clinton.  Not Joe Biden.  Not even Hunter Biden.",
    "url": "https://www.publicnotice.co/p/taylor-swift-causes-trumpers-to-lose-it-kelce"
  },
  {
    "text": "Judge orders Tesla to undo Elon Musk's $56 billion pay package  —  The ruling by a Delaware court stems from a Tesla shareholder lawsuit over the tech billionaire's 2018 compensation package  —  A Delaware judge on Tuesday ruled that Elon Musk's generous 2018 compensation package … ",
    "url": "https://www.washingtonpost.com/technology/2024/01/30/elon-musk-pay-package/"
  },
  {
    "text": "Elon Musk cannot keep Tesla pay package worth more than $55 billion, judge rules  —  Elon Musk is not entitled to landmark compensation package awarded by Tesla's board of directors that is potentially worth more than $55 billion, a Delaware judge ruled Tuesday.",
    "url": "https://apnews.com/article/elon-musk-tesla-compensation-pay-shareholders-e75687178d1175fba36ca55bd9c4c805"
  },
  {
    "text": "Mark Zuckerberg apologizes to parents at online child safety hearing  —  “I'm sorry for everything you've all gone through,” the Meta CEO said at a Senate Judiciary Committee Hearing called “Big Tech and the Online Child Sexual Exploitation Crisis.”  —  Meta CEO Mark Zuckerberg apologized Wednesday … ",
    "url": "https://www.nbcnews.com/tech/social-media/mark-zuckerberg-apologizes-parents-online-child-safety-hearing-rcna136578"
  },
  {
    "text": "A State Supreme Court Just Issued the Most Devastating Rebuke of Dobbs Yet  —  The Supreme Court's eradication of the constitutional right to abortion in 2022's Dobbs v. Jackson Women's Health Organization had an immediate and devastating impact on gender equality in the United States.",
    "url": "https://slate.com/news-and-politics/2024/01/pennsylvania-supreme-court-dobbs-sam-alito-abortion.html"
  },
  {
    "text": "The ‘Profound Influence’ of Christian Extremists on Mike Johnson  —  Speaker Mike Johnson's spiritual journey reveals ties to Christian fundamentalists who support slavery.  Johnson's office won't say where he stands on that issue. … If you want to know where Republican House Speaker Mike Johnson stands … ",
    "url": "https://www.thedailybeast.com/the-profound-influence-of-christian-extremists-on-mike-johnson"
  },
  {
    "text": "U.S. winning world economic war  —  The United States economy grew faster than any other large advanced economy last year — by a wide margin — and is on track to do so again in 2024.  —  Why it matters: America's outperformance is rooted in its distinctive structural strengths, policy choices, and some luck.",
    "url": "https://www.axios.com/2024/01/31/us-economy-2024-gdp-g7-nations"
  },
  {
    "text": "US veteran accused of tearing down Satanic Temple idol in Iowa Capitol charged with hate crime  —  A U.S. Navy veteran who is accused of tearing down a Satanic Temple statue within the Iowa state Capitol has been charged with a hate crime.  —  Michael Cassidy, a conservative Christian veteran … ",
    "url": "https://www.washingtonexaminer.com/news/2828416/news-veteran-tore-down-idol-iowa-capital-charged-hate-crime/"
  },
  {
    "text": "Fulton DA Willis, Wade subpoenaed to testify at Feb. 15 hearing  —  Fulton County District Attorney Fani Willis and special prosecutor Nathan Wade have been subpoenaed to testify at a Feb. 15 hearing involving motions to disqualify them from the election interference case, according to a lawsuit filed Tuesday.",
    "url": "https://www.ajc.com/politics/fulton-da-willis-wade-subpoenaed-to-testify-at-feb-15-hearing/T3J2ETVR4NCIRB3V6IMGJNW67M/"
  },
  {
    "text": "Activist who led ouster of Harvard president linked to ‘scientific racism’ journal  —  Christopher Rufo recommends a newsletter to his readers that has published several supporters of discredited genetics theory  —  Rightwing activist Christopher Rufo has links to a self-styled … ",
    "url": "https://www.theguardian.com/world/2024/jan/31/rightwing-activist-christopher-rufo-ties-scientific-racism-journal"
  },
  {
    "text": "Congressman urging Texas to ignore the Supreme Court is backed by major law firms  —  Congressman Chip Roy (R-TX) is publicly urging Texas to ignore the Supreme Court.  In previously unreported comments, Roy explained that he feared his position would push the country into “a post-constitutional world.”",
    "url": "https://popular.info/p/congressman-urging-texas-to-ignore"
  },
  {
    "text": "Trump Endorses Candidate Who Wanted to Ban Same-Sex Marriage With Constitutional Amendment  —  Trump announced endorsement of GOP Rep. Brian Babin on Truth Social  —  Trump endorsed GOP Rep. Brian Babin who voted to overturn the 2020 election results.  Babin is a Trump loyalist who is running … ",
    "url": "https://www.meidastouch.com/news/trump-endorses-candidate-who-wanted-to-ban-same-sex-marriage-with-constitutional-amendment"
  },
  {
    "text": "Michigan's Arabs and Muslims push to defeat Biden in critical state  —  As the war in Gaza leads to the deaths of friends and relatives, anger at Biden's refusal to call for a cease-fire has turned into political organizing  —  DEARBORN, Mich. — Mohammad Enayah relied on a cousin in Gaza … ",
    "url": "https://www.washingtonpost.com/politics/2024/01/31/arab-muslim-voters-work-to-defeat-biden/"
  },
  {
    "text": "GOP super PAC spends more on migrant crisis ads in NY race  —  The Congressional Leadership Fund is spending another $2.6 million to extend the ad blitz it began this month.  —  A top GOP super PAC is dumping even more money into the special election to replace ex-Rep. George Santos … ",
    "url": "https://www.politico.com/news/2024/01/31/ny-house-race-santos-00138801"
  },
  {
    "text": "South Carolina Moves to Boot Racist Couple by Deeming Them a ‘Public Nuisance’  —  The pair burned a cross near their Black neighbors' home.  Now local authorities are getting creative in removing them from the area.  —  Authorities in South Carolina have petitioned to boot a couple … ",
    "url": "https://www.thedailybeast.com/south-carolina-moves-to-boot-racist-couple-by-deeming-them-a-public-nuisance"
  },
  {
    "text": "India deploys unprecedented naval might near Red Sea to rein in piracy  —  India has deployed at least a dozen warships east of the Red Sea to provide security against pirates and has investigated more than 250 vessels as Western powers focus on attacks by Yemen's Iran-backed Houthis, Indian officials said.",
    "url": "https://www.reuters.com/world/india-deploys-unprecedented-naval-might-near-red-sea-rein-piracy-2024-01-31/"
  },
  {
    "text": "Housing Policy Council executive in critical condition after being shot in DC crime spree  —  WASHINGTON - Mike Gill, a married father of three, is in critical condition in the hospital after his family says he was shot during Monday night's wild crime spree.",
    "url": "https://www.fox5dc.com/news/housing-policy-council-executive-in-critical-condition-after-being-shot-in-dc-crime-spree"
  },
  {
    "text": "We have the tools to prevent nearly all HPV-related cancers.  We need the will.  —  Let's start with the bad news: Cervical cancer is the fourth most common cancer in women worldwide, with nearly 14,000 new cases and 4,300 deaths in 2023.  This is particularly tragic since it's … ",
    "url": "https://thehill.com/opinion/healthcare/4437991-we-have-the-tools-to-prevent-nearly-all-hpv-related-cancers-we-need-the-will/"
  }
]