[
  {
    "text": "Live Updates: Pete Hegseth Is Confirmed as Defense Secretary By Slim Margin  —  Pete Hegseth has vowed to bring his “warrior” ethos to the Pentagon.  Democrats had assailed him as unfit for the job, and his confirmation came down to Vice President JD Vance serving as tiebreaker.",
    "url": "https://www.nytimes.com/live/2025/01/24/us/pete-hegseth-defense-secretary-vote"
  },
  {
    "text": "VP Vance breaks tie in the Senate to confirm Pete Hegseth as defense secretary  —  Three Republicans voted with every Democrat against Trump's controversial pick to lead the Pentagon, forcing Vance to step in and put Hegseth over the top.  —  WASHINGTON — The Republican-controlled Senate … ",
    "url": "https://www.nbcnews.com/politics/congress/senate-vote-confirm-pete-hegseth-defense-secretary-rcna189058"
  },
  {
    "text": "US Secret Service approached South Side school, not ICE agents, CPS officials say  —  Chicago Public Schools officials initially claimed they denied ICE entry to Hamline Elementary Friday morning  —  US Secret Service approached Hamline Elementary School in Back of the Yards … ",
    "url": "https://abc7chicago.com/post/us-immigration-customs-enforcement-agents-denied-entry-hamline-elementary-school-back-yards-cps-officials/15833738/"
  },
  {
    "text": "Secret Service Agents — Not ICE — Denied Entry At Chicago School Despite Initial Reports, CPS Source Says  —  Editor's note: This story has been updated with new information correcting earlier information provided by CPS officials.  —  BACK OF THE YARDS - U.S. Secret Service agents … ",
    "url": "https://blockclubchicago.org/2025/01/24/ice-agents-denied-entry-at-cps-school-in-back-of-the-yards/"
  },
  {
    "text": "Trump ousts at least 12 independent inspectors general in late-night purge  —  The dismissals appeared to violate federal law, which requires Congress to receive 30 days' notice of any intent to fire a Senate-confirmed inspector general.",
    "url": "https://www.washingtonpost.com/politics/2025/01/24/trump-fire-inspectors-general-federal-agencies/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM3Njk0ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM5MDc3MTk5LCJpYXQiOjE3Mzc2OTQ4MDAsImp0aSI6IjM0ZGM3MzVkLTU4ODktNDEzOC04MWQ1LTEwZjQzOGY3NjUzZiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzAxLzI0L3RydW1wLWZpcmUtaW5zcGVjdG9ycy1nZW5lcmFsLWZlZGVyYWwtYWdlbmNpZXMvIn0.8XF_Noz3ifkriOenjwC09PgmWb3cN91LcQD73dnY3uA&itid=gfta"
  },
  {
    "text": "Trump Fires 17 Inspectors General in Late-Night Purge  —  The internal government watchdogs were believed to have been dismissed at several major agencies, though the Justice Department's was not said to have been among them.  —  President Trump fired 17 inspectors general … ",
    "url": "https://www.nytimes.com/2025/01/24/us/politics/trump-fires-inspectors-general.html"
  },
  {
    "text": "Mexico refuses to accept a U.S. deportation flight  —  The Mexican government has criticized President Donald Trump's unilateral immigration actions, and the landing would have required Mexico's assistance.  —  WASHINGTON — Mexico denied a U.S. military plane access to land Thursday … ",
    "url": "https://www.nbcnews.com/politics/immigration/mexico-refuses-accept-us-deportation-flight-rcna189182"
  },
  {
    "text": "State Department issues immediate, widespread pause on foreign aid  —  The “stop-work orders” appear to apply to US aid for all countries except Israel and Egypt.  —  Secretary of State Marco Rubio on Friday issued new guidance halting spending on most existing foreign aid grants for 90 days.",
    "url": "https://www.politico.com/news/2025/01/24/state-department-foreign-aid-pause-00200510"
  },
  {
    "text": "Donald Trump in fiery call with Denmark's prime minister over Greenland  —  US president insisted he wants to take over Arctic island  —  Donald Trump insisted he was serious in his determination to take over Greenland in a fiery telephone call with Denmark's prime minister, according to senior European officials.",
    "url": "https://www.ft.com/content/ace02a6f-3307-43f8-aac3-16b6646b60f6"
  },
  {
    "text": "Wall Street Banks Prepare to Sell Billions of Dollars of X Loans  —  Banks are hoping to sell the X debt at around 90 to 95 cents on the dollar  —  Banks are getting ready to sell billions of dollars in debt borrowed by Elon Musk's X, bringing Wall Street a step closer to exiting … ",
    "url": "https://www.wsj.com/finance/banking/wall-street-banks-prepare-to-sell-billions-of-dollars-of-x-loans-c609beb1?st=qi4q4y&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Trump signs anti-abortion policies after speaking to March for Life  —  Those impacted include overseas health organizations that distribute contraception and help combat HIV.  —  President Donald Trump's campaign-trail promise to leave abortion regulation to the states lasted just a few days into his presidency.",
    "url": "https://www.politico.com/news/2025/01/24/trump-issues-executive-orders-reviving-anti-abortion-policies-00200212"
  },
  {
    "text": "Keene man arrested for storming the Capitol on Jan. 6 rejects Trump's pardon  —  On his first day in office this week, President Donald Trump pardoned all rioters at the Jan. 6 attack on the U.S. Capitol.  Jason Riddle served time in jail for his participation in the 2021 riot where he stole … ",
    "url": "https://www.nhpr.org/nh-news/2025-01-24/keene-man-arrested-for-storming-the-capitol-on-jan-6-rejects-trumps-pardon"
  },
  {
    "text": "Supreme Court to weigh whether states can allow religious public schools  —  The Supreme Court agreed Friday to consider whether the state of Oklahoma may fund a proposed religious charter school, the first of its kind in the country  —  The Supreme Court agreed Friday to consider whether … ",
    "url": "https://www.washingtonpost.com/education/2025/01/24/supreme-court-public-religious-charter-school/"
  },
  {
    "text": "The immigrant crackdown has begun.  Its first target might surprise you.  —  Trump is not just going after foreigners who break the law.  —  Donald Trump promised to crack down on illegal immigration, a vow many Americans support.  But so far, his administration has been much more fixated … ",
    "url": "https://www.washingtonpost.com/opinions/2025/01/24/trump-immigration-legal-executive-orders/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM3Njk0ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM5MDc3MTk5LCJpYXQiOjE3Mzc2OTQ4MDAsImp0aSI6ImUzZjNlYjY1LTFmZmYtNDNiZS04NWIzLTBmODAxYzgxNzkxZiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9vcGluaW9ucy8yMDI1LzAxLzI0L3RydW1wLWltbWlncmF0aW9uLWxlZ2FsLWV4ZWN1dGl2ZS1vcmRlcnMvIn0.Uqg9dB4xLMesRk4SasbLj2YRVB9RpXJv-3FWhP1t7ds&itid=gfta"
  },
  {
    "text": "Idaho Lawmakers Want Supreme Court to Overturn Same-Sex Marriage Decision  —  A state legislative committee has advanced a resolution asking that the power to regulate marriage be returned to the states.  —  Since 1793, when the U.S. Supreme Court declined a request by President George Washington … ",
    "url": "https://www.nytimes.com/2025/01/24/us/idaho-same-sex-marriage-supreme-court.html"
  },
  {
    "text": "Trump Officials Pause Programs to Let In Immigrants, Including Ukrainians  —  The pause on several initiatives that allowed immigrants to enter the country temporarily will block the entrance of people fleeing some of the most unstable and desperate places in the world.",
    "url": "https://www.nytimes.com/2025/01/24/us/politics/trump-immigration-pause.html"
  },
  {
    "text": "Dems Worry Sen. Whitehouse Considering Vote for RFK Jr  —  Wanted to share some information on the RFK Jr. nomination before the Senate.  —  It probably won't surprise you that RFK Jr., along with Tulsi Gabbard, are among the few Trump nominees who might actually not get confirmed.",
    "url": "https://talkingpointsmemo.com/edblog/dems-worry-sen-whitehouse-considering-vote-for-rfk-jr"
  },
  {
    "text": "Reports of Navajo people being detained in immigration sweeps sparks concern from tribal leaders  —  Navajo Nation Council Speaker Crystalyne Curley called for swift action from Navajo tribal leaders to address the concern over ICE raids that have impacted Navajo people living in urban areas.",
    "url": "https://azmirror.com/2025/01/24/reports-of-navajo-people-being-detained-in-immigration-sweeps-sparks-concern-from-tribal-leaders/"
  },
  {
    "text": "Facing FBI investigation that Trump could halt, Andy Ogles proposes allowing third term for president  —  The Tennessee congressman, who was effusive in his praise of President Trump, faces an FBI investigation over allegations of fraud in reporting a $320,000 personal loan to his campaign.",
    "url": "https://www.newschannel5.com/news/newschannel-5-investigates/facing-fbi-investigation-that-trump-could-halt-andy-ogles-proposes-allowing-third-term-for-president"
  },
  {
    "text": "Trump has pulled Fauci's security detail, source says  —  President Donald Trump has terminated Dr. Anthony Fauci's security detail that was being provided and paid for by the National Institutes of Health, a source familiar with the situation tells CNN.  It was pulled on Thursday night.",
    "url": "https://www.cnn.com/2025/01/24/politics/anthony-fauci-security-detail-trump/"
  },
  {
    "text": "Experts saw Samoa's plunging vaccination rates as a crisis.  RFK Jr. saw an opportunity.  —  New details show how Robert F. Kennedy Jr., then chair of an anti-vaccine group and now Trump's pick for health secretary, sought to exploit a deadly vaccine accident.",
    "url": "https://www.nbcnews.com/news/us-news/rfk-jr-samoa-measles-vaccine-crisis-rcna187787"
  },
  {
    "text": "Madison and Nashville School Shooters Appear to Have Crossed Paths in Online Extremist Communities  —  A month after a student opened fire at Abundant Life Christian School, another killed a classmate at Antioch High School.  Both were active in an internet subculture that glorifies mass shooters … ",
    "url": "https://www.propublica.org/article/madison-nashville-school-shooters-online-extremism"
  },
  {
    "text": "RFK Jr. skipped meeting where officials planned fight against a future pandemic  —  The session between Trump and Biden administration officials is required of transitions and included other Trump Cabinet nominees.  —  As Biden officials packed up the White House last week … ",
    "url": "https://www.washingtonpost.com/politics/2025/01/24/rfk-jr-trump-biden-pandemic/"
  }
]