[
  {
    "text": "2024 Race: Trump vs. Harris Too Close To Call, Trump Slightly Ahead In 6-Way Race, Quinnipiac University National Poll Finds; 62% Say Biden Dropping Out Of Race Right Thing To Do  —  mail_outline  —  One day after President Joe Biden dropped out of the 2024 presidential race … ",
    "url": "https://poll.qu.edu/poll-release?releaseid=3901"
  },
  {
    "text": "Top Dems threatened to forcibly remove Biden from office unless he dropped out, set him up to fail at Trump debate: Sources  —  Operatives at the very highest levels of the Democratic Party threatened Joe Biden with forcibly removing him from office unless he stepped down, sources told The Post.",
    "url": "https://nypost.com/2024/07/22/us-news/top-dems-threatened-to-remove-biden-unless-he-resigned/"
  },
  {
    "text": "Exclusive: Beyoncé gives Kamala Harris permission to use her song ‘Freedom’ for her presidential campaign  —  Vice President Kamala Harris made a big entrance during her first official visit to her campaign headquarters on Monday evening, walking out to Beyoncé's song “Freedom.”",
    "url": "https://www.cnn.com/2024/07/22/entertainment/beyonce-freedom-harris-campaign/"
  },
  {
    "text": "Harris Is Uniting and Energizing Democratic Voters — and Polling Better Against Trump  —  65% of Democrats support Harris replacing Biden atop the ticket, where she's more competitive against Trump",
    "url": "https://pro.morningconsult.com/analysis/kamala-harris-biden-campaign-polling"
  },
  {
    "text": "Trump's New Rival May Bring Out His Harshest Instincts  —  After years planning to face President Biden, Donald J. Trump and his team will be campaigning against Kamala Harris.  He has attacked female rivals and critics in brutal and personal terms.  —  Donald J. Trump and his political team spent nearly … ",
    "url": "https://www.nytimes.com/2024/07/23/us/politics/trump-harris-attack-lines.html"
  },
  {
    "text": "How Harris can change the narrative to beat Trump  —  Rarely is an American political party presented with the opportunity for a course correction of this magnitude so late in the election cycle.  Democrats showed how American political parties can be resilient and speedy when they need to be … ",
    "url": "https://thehill.com/opinion/4787461-kamala-harris-campaign-reset/"
  },
  {
    "text": "Progressive youth voting group endorses Harris  —  The progressive youth voting group NextGen PAC is backing Vice President Kamala Harris for 2024 after President Biden made the unprecedented move to bow out of the running, giving her bid a boost with the critical bloc.",
    "url": "https://thehill.com/homenews/campaign/4787004-nextgen-pac-vice-president-kamala-harris-2024/"
  },
  {
    "text": "What Harris needs to do, now, to win  —  The vice president ought to explain where and why she differs from the president.  —  By the Editorial Board  —  With President Biden's exit from the race, Democrats are quickly coalescing around Vice President Harris.",
    "url": "https://www.washingtonpost.com/opinions/2024/07/22/kamala-harris-dnc-biden-differences/"
  },
  {
    "text": "Secret Service Director Kimberly Cheatle resigns over Trump shooting outrage … U.S. Secret Service Director Kimberly Cheatle resigned Tuesday following widespread outrage over how her agency failed to prevent the attempted assassination of former President Donald Trump at a Pennsylvania campaign rally earlier this month.",
    "url": "https://www.cnbc.com/2024/07/23/secret-service-resigns-trump-shooting.html"
  },
  {
    "text": "Secret Service director resigns after Trump shooting fallout  —  Director Kimberly Cheatle revealed her decision in an internal message to Secret Service employees.  —  Secret Service Director Kimberly Cheatle resigned Tuesday over the agency's failure to prevent the assassination attempt … ",
    "url": "https://www.politico.com/news/2024/07/23/secret-service-director-resigns-after-trump-shooting-fallout-00170580"
  },
  {
    "text": "JD Vance repeatedly indicated in 2016 that he believed Donald Trump had committed sexual assault  —  Ohio Sen. JD Vance, the Republican vice presidential nominee, repeatedly indicated in 2016 that he believed Donald Trump had committed sexual assault, even suggesting in one TV segment that in a … ",
    "url": "https://www.cnn.com/2024/07/23/politics/kfile-jd-vance-believed-donald-trump-sexual-assault-allegations-2016/"
  },
  {
    "text": "Top Sinclair anchor resigned over concerns about biased and inaccurate content  —  Eugene Ramirez, the lead anchor of Sinclair's national evening news broadcast, resigned in January over concerns about the accuracy and right-wing bias of the content he was required to present on air, three sources told Popular Information.",
    "url": "https://popular.info/p/top-sinclair-anchor-resigned-over"
  },
  {
    "text": "Exclusive: President Biden suffered an undisclosed medical emergency during his time in Las Vegas, police sources say  —  When President Joe Biden began his campaign trip in Las Vegas last week, everything seemed to be running as smoothly as it could for an 81-year-old president in physical and cognitive decline.",
    "url": "https://www.dossier.today/p/exclusive-president-biden-suffered"
  },
  {
    "text": "Elon Musk Says His Trans Daughter Was ‘Killed by Woke Mind Virus’  —  MASK OFF  —  The billionaire made the extraordinary claim in an interview with Jordan Peterson, adding that he “vowed to destroy” the “virus” after losing his child to it.  —  Elon Musk says his transgender daughter is “dead.”",
    "url": "https://www.thedailybeast.com/elon-musk-says-his-transgender-daughter-was-killed-by-woke-mind-virus"
  },
  {
    "text": "Fraudulent Failson Judgement: JD Vance “Ain't From Here”  —  As always with DC's gossip press, they exercise almost none of the scrutiny with Donald Trump that they do with others.  —  One recent example comes in the treatment of Joe Biden and Trump's sons' involvement in campaign decision-making.",
    "url": "https://www.emptywheel.net/2024/07/23/fraudulent-failson-judgement-jd-vance-aint-from-here/"
  },
  {
    "text": "Judge Cannon and JD Vance Are on the Same Team  —  In the days since Judge Aileen Cannon issued her inexplicable 93-page dismissal of the classified-documents case against Donald Trump, I've been coming back to something JD Vance said on a podcast in 2021.  —  Mr. Vance, the Ohio senator … ",
    "url": "https://www.nytimes.com/2024/07/23/opinion/cannon-trump-documents-vance.html?unlocked_article_code=1.9U0.3JrZ.GBkB7uEYN7MJ&smid=url-share"
  },
  {
    "text": "Mastercard, JPMorgan Get FTC Inquiry Over ‘Surveillance Pricing’  — Agency querying firms that offer pricing software to companies  — Companies more often setting individualized prices on products … The US Federal Trade Commission said it sent subpoenas to eight firms seeking information … ",
    "url": "https://www.bloomberg.com/news/articles/2024-07-23/ftc-opens-inquiry-into-mastercard-chase-over-surveillance-pricing"
  }
]