[
  {
    "text": "Trump Moves to Overturn Manhattan Conviction, Citing Immunity Decision  —  Former President Donald J. Trump took the action hours after a U.S. Supreme Court ruling granted him immunity for official acts committed in office.  —  Donald J. Trump began an effort on Monday to throw … ",
    "url": "https://www.nytimes.com/2024/07/01/nyregion/trump-sentence-hush-money.html"
  },
  {
    "text": "Supreme Court Impeachment Plan Released by Alexandria Ocasio-Cortez  —  announced plans to introduce articles of impeachment against the U.S.  —  justices on Monday after the court ruled that presidents have immunity for official actions.  —  The court on Monday ruled that former presidents … ",
    "url": "https://www.newsweek.com/supreme-court-justices-impeachment-aoc-1919728"
  },
  {
    "text": "The President Can Now Assassinate You, Officially  —  Under this new standard, a president can go on a four-to-eight year crime spree and then retire from public life, never to be held accountable.  —  Pocket  —  Welp, Donald Trump won.  The Supreme Court today ruled that presidents are entitled to … ",
    "url": "https://www.thenation.com/article/society/trump-immunity-supreme-court/"
  },
  {
    "text": "Ruling Further Slows Trump Election Case but Opens Door to Airing of Evidence  —  The Supreme Court's immunity decision directed the trial court to hold hearings on what portions of the indictment can survive — a possible chance for prosecutors to set out their case in public before Election Day.",
    "url": "https://www.nytimes.com/2024/07/01/us/politics/supreme-court-immunity-trump-jan-6.html"
  },
  {
    "text": "Behind the Curtain: The imperial presidency in waiting … - A re-elected Trump would quickly set up vast camps and deport millions of people in the U.S. illegally. … - In Washington, Trump would move to fire potentially tens of thousands of civil servants using a controversial interpretation of law and procedure.",
    "url": "https://www.axios.com/2024/07/02/trump-2025-imperial-us-presidency"
  },
  {
    "text": "Supreme Court's Trump Immunity Ruling Avoids the Obvious: He's Running Again  — Trump has long pushed to delay a trial until after election  — Majority sent case back to lower court to reconsider immunity  —  The Supreme Court's decision declaring Donald Trump partially immune … ",
    "url": "https://www.bloomberg.com/news/articles/2024-07-02/supreme-court-s-trump-immunity-ruling-avoids-2024-election"
  },
  {
    "text": "The Supreme Court Puts Trump Above the Law  —  And gives him permission for a despotic second term.  —  Near the top of their sweeping, lawless opinion in Trump v. United States, Donald Trump's defenders on the Supreme Court repeat one of the most basic principles of American constitutional government … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/07/supreme-court-donald-trump-immunity-decision/678859/"
  },
  {
    "text": "Thomas uses Trump immunity ruling to question Jack Smith appointment  —  Echoing a long-shot argument made by Donald Trump's attorneys in Florida, Justice Clarence Thomas said special counsels need Senate confirmation.  —  Supreme Court Justice Clarence Thomas tackled a question … ",
    "url": "https://www.washingtonpost.com/national-security/2024/07/01/clarence-thomas-jack-smith-special-counsel-immunity/"
  },
  {
    "text": "How much did debate hurt Biden's re-election bid?  New poll offers insight.  —  Trump's new, narrow advantage signals a close contest, not a decisive lead.  But other exclusive poll findings raise red flags for the president.  —  Susan Page Rachel BarberUSA TODAY",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/07/02/biden-trump-poll-post-debate/74263315007/"
  },
  {
    "text": "Rep. Spartz charged with weapons violation at DC airport  —  U.S. Rep. Spartz charged with airport weapons violation  —  (WISH) — U.S. Rep. Victoria Spartz has been charged with a weapons violation at Dulles International Airport in Washington, D.C.  —  A spokesperson for Metropolitan … ",
    "url": "https://www.wishtv.com/news/politics/rep-spartz-charged-with-weapons-violation-at-dc-airport/"
  },
  {
    "text": "Trump Amplifies Calls to Jail Top Elected Officials, Invokes Military Tribunals  —  A post that Mr. Trump circulated on Sunday called for Liz Cheney to be prosecuted by a military court reserved for enemy combatants and war criminals.  —  Former President Donald J. Trump over the weekend escalated … ",
    "url": "https://www.nytimes.com/2024/07/01/us/politics/trump-liz-cheney-treason-jail.html"
  },
  {
    "text": "Unsealed: Jeffrey Epstein's grand jury records now viewable online  —  The records have long been sealed due to state limitations on exposing grand jury evidence.  Lawmakers passed narrowly tailored legislation in February to circumvent those restrictions.  —  More than 150 transcript pages … ",
    "url": "https://floridapolitics.com/archives/682400-unsealed-jeffrey-epsteins-grand-jury-records-now-viewable-online/"
  },
  {
    "text": "Supreme Court lets a truck stop sue the Federal Reserve in latest threat to agency regulations  —  The Supreme Court on Monday revived a lawsuit by a North Dakota truck stop that is challenging the fees banks can charge for debit-card transactions in a ruling that could have deeper implications for other government regulations.",
    "url": "https://www.cnn.com/2024/07/01/politics/corner-post-sec-supreme-court/"
  },
  {
    "text": "Trump raked in big money from foreign nations.  Experts fear he'd do it more if re-elected  —  The countries include human rights violators and U.S. adversaries, raising questions about how Trump's financial interests affect national security.  —  WASHINGTON - If former President Donald Trump wins … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/07/02/trump-foreign-money-foreign-ethics-concerns/73969466007/"
  },
  {
    "text": "Cash Crunch Squeezes Kennedy Amid Costly Fight for Ballot Spots  —  Confronting steep debts and some layoffs, Robert F. Kennedy Jr.'s campaign is increasingly consumed by the battle for ballot access, with his allies quietly putting money into a new legal fund.",
    "url": "https://www.nytimes.com/2024/07/02/us/politics/rfk-jr-fundraising-ballot-access.html"
  },
  {
    "text": "Midjourney is creating Donald Trump pictures when asked for images of ‘the president of the United States’  —  This is in spite of Midjourney's self-imposed ban on creating Trump and Biden images ahead of the US presidential election.  —  Midjourney, a popular AI-powered image generator … ",
    "url": "https://www.engadget.com/midjourney-is-creating-donald-trump-pictures-when-asked-for-images-of-the-president-of-the-united-states-212427937.html"
  }
]