[
  {
    "text": "Landrieu to join Biden's campaign as national co-chair  —  Mitch Landrieu, the former New Orleans mayor who has been helping President Biden implement his $1.2 trillion bipartisan infrastructure bill, is leaving the White House to be a national co-chair of the Biden-Harris campaign, Axios has learned.",
    "url": "https://www.axios.com/2024/01/08/landrieu-joins-biden-campaign-2024"
  },
  {
    "text": "Biden will visit church where Black people were killed to lay out election stakes and perils of hate  —  WILMINGTON, Del. (AP) — President Joe Biden wants Americans to grasp the extraordinary stakes of this year's presidential election, as he sees them.  As part of that effort … ",
    "url": "https://apnews.com/article/biden-trump-2024-election-jan-6-3e40b3732036a237a5a8af45b7ad6a6b"
  },
  {
    "text": "Trump Says He Will Attend Presidential Immunity Hearing  —  The hearing is scheduled for Tuesday, Jan. 9  —  Former President Donald Trump early Monday morning announced he will atend his presidential immunity hearing in D.C. in person on Tuesday.  —  “Of course I was entitled … ",
    "url": "https://themessenger.com/politics/trump-says-he-will-attend-presidential-immunity-hearing"
  },
  {
    "text": "Trump Is Connecting With a Different Type of Evangelical Voter  —  They are not just the churchgoing, conservative activists who once dominated the G.O.P.  —  Karen Johnson went to her Lutheran church so regularly as a child that she won a perfect attendance award.  As an adult, she taught Sunday school.",
    "url": "https://www.nytimes.com/2024/01/08/us/politics/donald-trump-evangelicals-iowa.html"
  },
  {
    "text": "Boebert's ex-husband calls police after fight with congresswoman  —  The representative from Colorado denies allegations that she punched her former spouse  —  Police were called to a restaurant in Silt, Colo., on Saturday night after Rep. Lauren Boebert (R-Colo.) and her ex-husband Jayson … ",
    "url": "https://www.washingtonpost.com/politics/2024/01/07/lauren-boebert-ex-husband/"
  },
  {
    "text": "Silt police investigating incident involving U.S. Rep. Lauren Boebert and her ex-husband  —  The Silt Police Department is investigating a Saturday night incident at a restaurant involving U.S. Rep. Lauren Boebert and her ex-husband Jayson Boebert.  —  Silt police Chief Mike Kite confirmed … ",
    "url": "https://www.denverpost.com/2024/01/07/lauren-boebert-ex-husband-jayson-police-silt-colorado-restaurant/"
  },
  {
    "text": "Johnson strikes his first bipartisan deal — a $1.7T funding accord  —  Ahead of a government shutdown cliff on Jan. 19, angst among House Republicans could still derail efforts to avert a funding lapse.  —  Congressional leaders have clinched a deal on overall budget totals that could pave … ",
    "url": "https://www.politico.com/news/2024/01/07/congress-spending-deal-shutdown-00134200"
  },
  {
    "text": "Deputy learned of defense secretary's hospitalization 2 days after taking over his duties  —  The Pentagon did not initially inform Deputy Defense Secretary Kathleen Hicks, Secretary of State Antony Blinken or senior White House officials.  —  After being admitted to the hospital last week … ",
    "url": "https://www.nbcnews.com/politics/politics-news/deputy-learned-defense-secretarys-hospitalization-two-days-taking-duti-rcna132729"
  },
  {
    "text": "'He's a cipher': How Austin's need for privacy just backfired  —  Pressure is growing on Capitol Hill and within the administration for someone to lose their job.  —  Defense Secretary Lloyd Austin is one of the most reclusive Pentagon chiefs in recent memory.  That strategy may be backfiring on him.",
    "url": "https://www.politico.com/news/2024/01/07/austin-has-long-been-a-quiet-operator-that-just-backfired-on-him-00134199"
  },
  {
    "text": "The changing congressional map is shifting the fight for control of the House  —  With primaries in some states just weeks away, there are still big unresolved questions of what some districts will look like.  —  The partisan tilt of a handful of districts could still change dramatically … ",
    "url": "https://www.politico.com/news/2024/01/08/house-redistricting-2024-elections-00134053"
  },
  {
    "text": "Senate Dems launch eight-figure bid to boost Tester and Brown  —  The Montana and Ohio Democrats will face a tough climb to reelection — and their races are integral to their party's hopes of keeping the majority.",
    "url": "https://www.politico.com/live-updates/2024/01/08/congress/dsccs-big-spend-00134060"
  },
  {
    "text": "What Could Tip the Balance in the War in Ukraine?  —  In 2024, the most decisive fight may also be the least visible: Russia and Ukraine will spend the next twelve months in a race to reconstitute and resupply their forces.  —  On December 29th, Russia fired more than a hundred and fifty missiles … ",
    "url": "https://www.newyorker.com/news/news-desk/what-could-tip-the-balance-in-the-war-in-ukraine"
  },
  {
    "text": "The U.S. Is Dealing With an Israeli Leader Who's Losing Control  —  Benjamin Netanyahu is waging a war while struggling to avoid prison, salvage his legacy and keep his political partners happy.  —  Benjamin Netanyahu, whom many Israelis simply call “Bibi,” is Israel's longest-serving prime minister … ",
    "url": "https://www.politico.com/news/magazine/2024/01/08/netanyahu-israeli-leader-losing-control-00134146"
  },
  {
    "text": "Scoop: Pa. Senate hopeful McCormick raised $5.4M in last quarter … - McCormick, a former CEO of the Bridgewater Associates investment firm, also contributed $1 million of his own money in the fourth quarter of 2023 to boost his bid to oust three-term incumbent Sen. Bob Casey (D-Penn.).",
    "url": "https://www.axios.com/2024/01/08/pennsylvania-senate-fundraising-mccormick"
  }
]