[
  {
    "text": "Trump votes in his “last” election: “I don't even want to think about losing” … - He also cast doubt on the efficiency and reliability of voting machines, and called it an “absolute outrage” that key states take so long to count ballots.  — But Trump did say there will be “no violence” … ",
    "url": "https://www.axios.com/2024/11/05/trump-votes-election-fair-declare-victory"
  },
  {
    "text": "Mike Johnson on certifying election results: ‘Everybody needs to calm down’  —  House Speaker Mike Johnson (R-La.) said “everybody needs to calm down” when asked about election certification, adding that there's been too much “emotion” and “misinformation.”  —  When asked by EWTN News … ",
    "url": "https://thehill.com/homenews/campaign/4973098-mike-johnson-certifying-election-results-everybody-needs-to-calm-down/"
  },
  {
    "text": "A random number generator determined the “favorite” in our forecast  —  When I say the odds in this year's presidential race are about as close as you can possibly get to 50/50, I'm not exaggerating.  —  At exactly midnight on Tuesday, I pressed the “go” button for the final time on our election model this year.",
    "url": "https://www.natesilver.net/p/a-random-number-generator-determined"
  },
  {
    "text": "How the Election Could Unfold: Four Scenarios  —  A look at plausible outcomes that might wind up seeming obvious in hindsight.  —  The 2024 election is close and deeply uncertain.  —  One reason?  On paper, neither side ought to win.  —  For Democrats, it's a textbook challenge.",
    "url": "https://www.nytimes.com/2024/11/05/upshot/election-scenarios-polls.html?unlocked_article_code=1.Xk4.9EQX.lzjBH_RZ4PO9&smid=url-share"
  },
  {
    "text": "An hour-by-hour guide to watching the races on election night  —  Which states and races are closing at which times in the fight for president, Senate and House, as well as some key ballot measure battles.  —  When the polls start closing on Election Day, a wave of vote totals showing … ",
    "url": "https://www.nbcnews.com/politics/2024-election/election-day-polls-close-every-state-what-watch-rcna175479"
  },
  {
    "text": "Musk to Spend Election Night With Trump  —  Elon Musk has spent $119 million on a super PAC supporting Donald Trump and held events on his behalf.  But his ownership of X is especially valuable.  —  Elon Musk plans to spend election night with former President Donald J. Trump … ",
    "url": "https://www.nytimes.com/2024/11/05/us/politics/elon-musk-trump-election-night.html"
  },
  {
    "text": "Kellyanne Conway worries about Trump's safety on Election Day  —  We've been chatting with lawmakers, former elected officials and political insiders every day to Election Day to get a better sense of where people's heads are at — and what their candidate needs to be doing better.",
    "url": "https://www.politico.com/live-updates/2024/11/05/2024-elections-live-coverage-updates-analysis/kellyanne-conway-donald-trump-00187286"
  },
  {
    "text": "Giuliani Moved Possessions From N.Y. Apartment as Creditors Closed In  —  Lawyers for the two election workers seeking to collect on a $148 million defamation judgment against Rudolph W. Giuliani found that he had largely cleared out his Upper East Side home.",
    "url": "https://www.nytimes.com/2024/11/05/us/politics/giuliani-apartment-defamation-election.html?unlocked_article_code=1.Xk4.FMaD.HRrsOdodBJn7&smid=url-share"
  },
  {
    "text": "Non-credible bomb threats against Atlanta-area polling places were from Russia, secretary of state says  —  Several non-credible bomb threats that briefly disrupted voting at two Georgia polling places originated from Russia, Georgia Secretary of State Brad Raffensperger told reporters Tuesday.",
    "url": "https://www.cnn.com/2024/11/05/us/georgia-non-credible-bomb-threat-russia/"
  },
  {
    "text": "Trump campaign denies and revokes journalists' election night credentials after critical coverage  —  New York CNN  —  Journalists from multiple news organizations have been denied credentials to former President Donald Trump's election night watch event in West Palm Beach, Florida … ",
    "url": "https://www.cnn.com/2024/11/05/media/trump-revokes-journalists-election-night-credentials/"
  },
  {
    "text": "Trump Campaign Finishes the Election by Taking Revenge on the Media  —  With hours until the polls close, the Trump campaign is punishing reporters over critical stories either they or their outlets have written in recent days.  —  Politico had three reporters and a photographer credentialed … ",
    "url": "https://nymag.com/intelligencer/article/trump-campaign-election-media.html"
  },
  {
    "text": "Vance says he's lost friends over Trump support  —  Ohio Sen. JD Vance, the Republican vice presidential nominee, said Tuesday that he's lost friends over his support for former President Trump.  —  “We can't discard friends, and we can't discard family members,” Vance said in a clip … ",
    "url": "https://thehill.com/homenews/campaign/4972658-vance-lost-friendships-trump-support/"
  },
  {
    "text": "The MAGA Propaganda Machine Has Successfully Censored Voices Calling Out its Lies  —  In 2020, the U.S. found itself in the midst of an unprecedented election—one defined not only by candidates or policies, but by a fight over what was real.  During that election, I was one of the leaders … ",
    "url": "https://www.theunpopulist.net/p/the-maga-propaganda-machine-has-successfully"
  },
  {
    "text": "Remembering Bernie Marcus  —  BERNIE'S STORY  —  The Home Depot is deeply saddened by the passing of our beloved founder, Bernard Marcus.  To us, he was simply “Bernie.”  —  Bernie was an inspiration in many ways.  He was a master merchant and a genius with customer service.",
    "url": "https://corporate.homedepot.com/news/company/remembering-bernie-marcus"
  },
  {
    "text": "A Plaintive Cry For Election Reforms Before It's Too Late  —  A lot of things happened.  Here are some of the things.  This is TPM's Morning Memo.  Sign up for the email version.  —  It Doesn't Have To Be This Way  —  As voting wraps up across the country today, let me take a quick step … ",
    "url": "https://talkingpointsmemo.com/morning-memo/election-reforms-campaign-finance-dark-money-oligarchy"
  },
  {
    "text": "MAGA outrage over wives voting for Kamala Harris is funny — but it's also dangerous  —  When it comes to political bait, it was the tastiest sort: a cheeky ad run by Vote Common Good, and voiced by Julia Roberts, reminding women that they don't have to tell their husbands if they vote for Vice President Kamala Harris.",
    "url": "https://www.salon.com/2024/11/05/bracing-for-magas-backlash-the-strategy-behind-secret-kamala-harris-is-safety/"
  },
  {
    "text": "Election 2024 live updates: Trump Media stock halted three times amid volatile trading; Harris calls in to drive time radio … Americans are voting in record-setting numbers across the country this Election Day, marking the end of a history-making presidential race between former President Donald Trump and Vice President Kamala Harris.",
    "url": "https://www.cnbc.com/2024/11/05/presidential-election-2024-results-live-updates.html"
  },
  {
    "text": "Man convicted in 9/11-style plot to kill Americans  —  A man accused of being a Somalian terror group operative has been convicted of a 9/11-style plot to kill Americans, the Justice Department said Monday.  —  The Justice Department said in a press release that a 34-year-old Kenyan named … ",
    "url": "https://thehill.com/regulation/court-battles/4972836-somalian-terror-group-convicted/"
  },
  {
    "text": "FBI Statement on Inauthentic Use of Bureau Name, Insignia in Promoting False Election-Related Narratives  —  The FBI was made aware of two instances of its name and insignia being misused in promoting false narratives surrounding the election.  The first is a fabricated news clip purporting to be a terrorist warning issued by the FBI.",
    "url": "https://www.fbi.gov/news/press-releases/fbi-statement-on-inauthentic-use-of-bureau-name-and-insignia"
  },
  {
    "text": "Trump says Harris ‘copied my routine’ on ‘SNL’  —  Former President Trump said Monday that Vice President Harris “copied my routine” in her appearance on “Saturday Night Live” two days earlier.  —  “She uses everything I do.  She uses ... even ‘Saturday Night Live,’ they copied,” Trump said at a rally in Reading, Pa. “They copied.",
    "url": "https://thehill.com/homenews/campaign/4972350-trump-says-harris-copied-my-routine-on-snl/"
  },
  {
    "text": "Harris needs strong Election Day showing to win  —  Momentum has slightly shifted to Vice President Harris ahead of Election Day in her matchup against former President Trump, according to several major election analysts, but she'll need a strong showing in key states to get to 270 electoral votes.",
    "url": "https://thehill.com/homenews/campaign/4973327-vice-president-harris-trump-race/"
  }
]