[
  {
    "text": "Greene faces uphill battle to oust Johnson  —  Rep. Marjorie Taylor Greene (R-Ga.) is escalating her threat to remove Speaker Mike Johnson (R-La.) from power, but she faces a steep climb if she hopes to achieve that goal.  —  Not only has the Speaker recently received a glowing review … ",
    "url": "https://thehill.com/homenews/house/4612735-greene-vow-motion-vacate-johnson/"
  },
  {
    "text": "House GOP conservatives galvanize against Tony Gonzales … Hardline House GOP conservatives tell us they're feeling a renewed sense of motivation to go after Gonzales after he called out Rep. Matt Gaetz (R-Fla.) and House Freedom Caucus Chair Bob Good (R-Va.) on CNN this weekend.",
    "url": "https://punchbowl.news/article/tony-gonzales-brandon-herrera-primary-runoff/"
  },
  {
    "text": "Senate to hold key test vote on Ukraine aid, Israel funding and TikTok ban  —  The package of foreign aid and legislation that would provide a pathway to banning TikTok in the U.S. is expected to be signed into law by President Joe Biden in the coming days.  —  WASHINGTON — The Senate … ",
    "url": "https://www.nbcnews.com/politics/congress/senate-hold-key-test-vote-ukraine-aid-israel-funding-tiktok-ban-rcna148685?taid=66279b0c8c42f20001faa778"
  },
  {
    "text": "‘Plasmic Echo’ was FBI code name for Trump classified documents probe  —  The FBI's code name for its investigation into former President Trump's handling of classified documents was “Plasmic Echo,” according to court filings published Monday.  —  The name was listed in unredacted court … ",
    "url": "https://thehill.com/regulation/court-battles/4613537-plasmic-echo-was-fbi-code-name-for-trump-classified-documents-probe/"
  },
  {
    "text": "US agency poised to ban worker ‘noncompete’ agreements  —  The U.S. Federal Trade Commission (FTC) is expected on Tuesday to approve a rule that would ban agreements commonly signed by workers not to join their employers' competitors, which it says limit worker mobility and suppress their pay.",
    "url": "https://www.reuters.com/world/us/us-agency-poised-ban-worker-noncompete-agreements-2024-04-23/"
  },
  {
    "text": "Voyager 1 is sending data back to Earth for the first time in 5 months  —  For the first time in five months, NASA engineers have received decipherable data from Voyager 1 after crafting a creative solution to fix a communication problem aboard humanity's most distant spacecraft in the cosmos.",
    "url": "https://www.cnn.com/2024/04/22/world/voyager-1-communication-issue-cause-fix-scn/"
  },
  {
    "text": "How Republicans castrated themselves … - Letting any member call a vote on removing the speaker. … - Surrendering authority of the Rules Committee, which sets the terms for how legislation will be handled during votes.",
    "url": "https://www.axios.com/2024/04/23/republicans-speaker-motion-vacate-rules-committee"
  },
  {
    "text": "Inside the Off-the-Record Calls Held by Anti-Trump Legal Pundits  —  Some of the country's most prominent legal commentators are holding off-the-record sessions to hash out the latest twists and turns in Donald Trump's legal saga.  —  As the Jan. 6 committee was working on its bombshell investigation … ",
    "url": "https://www.politico.com/news/magazine/2024/04/23/anti-trump-legal-pundits-calls-00153300"
  },
  {
    "text": "Biden's New Chopper Is Demoted After Scorching White House Lawn  — New presidential helicopters delayed under $5 billion program  — Marine One helicopter is iconic symbol of American president … The VH-92 Patriot is landing only on paved runways for now, flying missions … ",
    "url": "https://www.bloomberg.com/news/articles/2024-04-23/lockheed-still-can-t-solve-marine-one-s-scorched-grass-problem"
  },
  {
    "text": "Why Trump Will Likely be Held in Contempt and What Then  —  Trial in The People of the State of New York vs. Donald J. Trump, the first-ever criminal prosecution of a former U.S. president, began on Monday, April 15.  Although the trial is still in its early stages, Trump has already run … ",
    "url": "https://www.justsecurity.org/94878/why-trump-will-likely-be-held-in-contempt-and-what-then/"
  },
  {
    "text": "Minnesota Sen. Nicole Mitchell arrested on suspicion of burglary after being found in home  —  Mitchell, a Democrat, was arrested after being found inside a home in Detroit Lakes, Minnesota, police say.  She was booked into Becker County jail on a burglary charge.",
    "url": "https://www.usatoday.com/story/news/nation/2024/04/22/minnesota-senator-burglary-arrest-nicole-mitchell/73419507007/"
  },
  {
    "text": "Xavier Becerra plots political future after Biden administration  —  The Health and Human Services secretary is making moves to run again in California.  Maybe even too many moves.  —  Health and Human Services Secretary Xavier Becerra's plans to leave the Biden administration and run … ",
    "url": "https://www.politico.com/news/2024/04/23/xavier-becerra-biden-administration-future-00153737"
  },
  {
    "text": "No Soft Power Shake-Ups for Now  —  Germany is No. 1 in leadership approval ratings; Russia is unpopular  —  This article is the first in a series detailing the results from the latest Rating World Leaders report, which analyzes trends in approval ratings of the leadership of the U.S., Germany, Russia and China in over 130 countries.",
    "url": "https://news.gallup.com/poll/643853/no-soft-power-shake-ups.aspx"
  },
  {
    "text": "Trump Calls for More Protests Outside Trial: ‘Rally Behind MAGA’  —  With support from demonstrators in Lower Manhattan spotty so far, Donald Trump issued a call to “rally behind MAGA,” and suggested the poor turnout was a result of a plot against his supporters.",
    "url": "https://www.nytimes.com/2024/04/22/us/politics/trump-trial-protests.html"
  },
  {
    "text": "Republicans are starting to worry about RFK Jr.  —  Even Donald Trump acknowledged Monday that the independent candidate “probably hurts both” Biden and him.  —  Republicans are waking up to the reality that Robert F. Kennedy Jr. could sink their standard-bearer just as easily … ",
    "url": "https://www.politico.com/news/2024/04/22/republicans-are-starting-to-worry-about-rfk-jr-00153763"
  },
  {
    "text": "Melania Quietly Emerges From the Shadows—at a Sparse Event for Log Cabin Republicans  —  BACK IN BLACK  —  Melania Trump's return to the campaign trail is just beginning.  But it was notable that she chose a small gathering for Log Cabin Republicans for her first solo event.",
    "url": "https://www.thedailybeast.com/melania-trump-quietly-emerges-from-the-shadowsat-a-sparse-event-for-log-cabin-republicans"
  },
  {
    "text": "Few have heard about Biden's climate policies, even those who care most about issue — CBS News poll  —  President Joe Biden made addressing climate change a key issue in his 2020 campaign.  Three years into his presidency, what do those who care about the issue most think about what he's done?",
    "url": "https://www.cbsnews.com/news/climate-policies-biden-poll/"
  },
  {
    "text": "U.S. Takes Aim at Chinese Banks Aiding Russia War Effort  —  Washington says Beijing's dual-use trade has helped Moscow rebuild its war machine  —  The U.S. is drafting sanctions that threaten to cut some Chinese banks off from the global financial system, arming Washington's top envoy … ",
    "url": "https://www.wsj.com/politics/national-security/u-s-takes-aim-at-chinese-banks-aiding-russia-war-effort-fcf76dcc"
  },
  {
    "text": "A historic victory for unions  —  On April 19, the National Labor Relations Board (NLRB) announced that workers at a Volkswagen auto plant in Chattanooga, Tennessee, voted to join the United Auto Workers (UAW) union.  The union won by a 73% majority, with more than 2,600 votes - a historic feat.",
    "url": "https://popular.info/p/a-historic-victory-for-unions"
  },
  {
    "text": "Could Trump Go to Prison?  If He Does, the Secret Service Goes, Too  —  Officials have had preliminary discussions about how to protect the former president in the unlikely event that he is jailed for contempt during the trial.  —  The U.S. Secret Service is in the business of protecting the president … ",
    "url": "https://www.nytimes.com/2024/04/23/nyregion/trump-trial-hush-money-prison.html"
  }
]