[
  {
    "text": "Trump's $91.6 million question  —  New York juries have found, by a preponderance of the evidence, that former President Donald Trump sexually assaulted writer E. Jean Carroll in a Bergdorf Goodman dressing room in the mid-90s and then repeatedly defamed her, falsely accusing Carroll of lying about the incident.",
    "url": "https://popular.info/p/trumps-916-million-question"
  },
  {
    "text": "The media is still selling a fantasy version of Trump  —  This free edition of PN is made possible by paid subscribers.  If you aren't one already, hit the button and sign up to support our independent journalism.  —  ⌨️ Subscribe to Public Notice ⌨️",
    "url": "https://www.publicnotice.co/p/axios-new-york-times-nbc-trump-fantasy-version"
  },
  {
    "text": "Donald Trump May Be Closer To Bankruptcy Than It Seems  —  Donald Trump may be in a worse financial situation than most people think, a financial analyst has said.  —  Jon Gabrielsen, an Atlanta-based market economist, told Newsweek that Trump's liquidity problems may be more acute than they first appear … ",
    "url": "https://www.newsweek.com/donald-trump-bankruptcy-court-awards-e-jean-carroll-new-york-fraud-case-engoron-1877890"
  },
  {
    "text": "Trump Gives Rambling Answer on Why He Backtracked on a TikTok Ban  —  Donald Trump told CNBC that banning TikTok would make young people “go crazy” and could benefit Facebook, which he called an “enemy of the people.”  —  Former President Donald J. Trump offered a rambling and confusing explanation … ",
    "url": "https://www.nytimes.com/2024/03/11/us/politics/trump-tiktok-ban-cnbc.html"
  },
  {
    "text": "Trump's freewheeling speeches offer a dark vision of a second term  —  A close examination of one appearance in Rock Hill, S.C., offers an anatomy of a signature rally by the former president  —  A Donald Trump rally is a freewheeling extravaganza.  A festival of grievance and retribution.",
    "url": "https://www.washingtonpost.com/politics/2024/03/11/trump-campaign-speech-anatomy/"
  },
  {
    "text": "E. Jean Carroll lawyer suggests third Trump defamation lawsuit possible after new comments  — Donald Trump again denied rape and defamation claims against him by E. Jean Carroll.  — The presumptive Republican presidential nominee claimed on CNBC's “Squawk Box” that the numerous judgments … ",
    "url": "https://www.cnbc.com/2024/03/11/trump-again-attacks-e-jean-carroll-as-he-appeals-rape-defamation-penalties.html"
  },
  {
    "text": "Trump floats ‘cutting’ retirement spending, drawing quick pushback from Biden  —  The Republican nominee-in-waiting said that “there's a lot you can do in terms of cutting” when pressed on CNBC about the solvency of Social Security, Medicare and Medicaid.  —  Presumptive Republican nominee … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-floats-cutting-retirement-spending-drawing-quick-pushback-biden-rcna142776"
  },
  {
    "text": "Former advisers sound the alarm that Trump praises despots in private and on the campaign trail  —  To Donald Trump, Hungarian strongman Viktor Orbán is “fantastic,” Chinese leader Xi Jinping is “brilliant,” North Korea's Kim Jong Un is “an OK guy,” and, most alarmingly … ",
    "url": "https://www.cnn.com/2024/03/11/politics/trump-despots-advisers-sound-alarm/"
  },
  {
    "text": "Biden takes aim at Trump following his embrace of Hungary's Orbán  —  Donald Trump doesn't embrace foreign autocrats despite their authoritarian style; he embraces foreign autocrats because of their authoritarian style.  —  Late last week, President Joe Biden briefly chatted … ",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/biden-takes-aim-trump-embrace-hungarys-orban-rcna142744"
  },
  {
    "text": "How a tenacious reporter revealed Sen. Katie Britt's SOTU response to be ‘beyond misleading’  —  Britt tied an anecdote about a woman who survived sex trafficking to Biden's border policies.  But it happened during the George W. Bush admin.  —  Last Thursday was President Joe Biden's big State of the Union address.",
    "url": "https://www.poynter.org/commentary/2024/katie-britt-scarlett-johansson-teacup-snl/"
  },
  {
    "text": "Why Democrats Are Hopeful in North Carolina and Nervous in Georgia  —  President Biden's campaign and its allies are targeting both battlegrounds — but only one state has a highly controversial Republican nominee lower on the ballot.  —  Democrats are starting to dream that President Biden … ",
    "url": "https://www.nytimes.com/2024/03/11/us/politics/biden-trump-north-carolina-georgia.html"
  },
  {
    "text": "Sex trafficking victim says Sen. Katie Britt telling her story during SOTU rebuttal is ‘not fair’  —  The woman whose story Alabama Sen. Katie Britt appeared to have shared in the Republican response to the State of the Union as an example of President Joe Biden's failed immigration policies told CNN … ",
    "url": "https://www.cnn.com/2024/03/10/politics/katie-britt-sex-trafficking-victim-interview"
  },
  {
    "text": "How Big Pharma is fighting Biden's program to lower seniors' drug costs  —  In court cases nationwide, drug companies are trying to block a new law that would cut prices on drugs for high blood pressure, heart disease, cancer and diabetes.  —  TRENTON, N.J. — Pharmaceutical giants are mounting … ",
    "url": "https://www.washingtonpost.com/business/2024/03/11/pharma-drug-priding-biden-negotiations/"
  },
  {
    "text": "The GOP can't leave MAGA — “Americans must electorally mercy-kill the Republican Party”  —  An ex-MAGA activist warns “no civic savior is coming” as Donald Trump's cognitive decline becomes undeniable  —  Power not used is power wasted.  Fascism is corrupt power.",
    "url": "https://www.salon.com/2024/03/11/the-cant-leave-maga--americans-must-electorally-mercy-the-party/"
  },
  {
    "text": "HUD Secretary Marcia Fudge to resign, says affordable housing is ‘an American issue’  —  WASHINGTON ‒ Housing and Urban Development Secretary Marcia Fudge will step down from her top post in the Biden administration this month, she announced Monday, saying that after decades of public service, she's retiring and returning to Ohio.",
    "url": "https://www.usatoday.com/story/news/politics/2024/03/11/hud-secretary-marcia-fudge-steps-down/72886441007/"
  },
  {
    "text": "Peter Navarro ordered to prison on March 19  —  Peter Navarro, once an economic adviser to former President Trump, has been ordered to report to a Miami prison on March 19 to begin serving a four-month sentence for refusing to comply with a congressional investigation into the Jan. 6, 2021 attack on the Capitol.",
    "url": "https://thehill.com/regulation/court-battles/4523581-peter-navarro-ordered-to-prison/"
  },
  {
    "text": "Conservatives are furious, but they're not threatening Speaker Johnson's job  —  For a small but passionate band of Republicans, reality appears to be setting in that they won't be able to bend a divided Congress to their will through the election of a speaker.",
    "url": "https://www.nbcnews.com/politics/congress/conservatives-are-furious-not-threatening-speaker-johnsons-job-rcna142489"
  },
  {
    "text": "Most Democrats Don't Want Congress to Certify Election if Trump Wins  —  After the Supreme Court rejected attempts to disqualify former President Donald Trump from the ballot, a majority of Democratic voters now support another way to block Trump's possible return to the White House.",
    "url": "https://www.rasmussenreports.com/public_content/politics/biden_administration/most_democrats_don_t_want_congress_to_certify_election_if_trump_wins"
  },
  {
    "text": "The GOP nominee to head North Carolina's schools is a QAnon conspiracy theorist  —  Michele Morrow also suggested actor Jim Carrey harvests and drinks children's blood  —  Michele Morrow, the Republican nominee for state superintendent of public instruction in North Carolina … ",
    "url": "https://www.mediamatters.org/qanon-conspiracy-theory/michele-morrow-gop-nominee-head-north-carolinas-schools-qanon-conspiracy"
  },
  {
    "text": "New $5 million ad campaign boosts House Democrats on health care  —  First to NBC News: Democrats are mobilizing for another election cycle in which they believe they can lean on the issue to help them convince voters to back them.  —  Fresh off of last week's State of the Union address … ",
    "url": "https://www.nbcnews.com/politics/2024-election/new-5-million-ad-campaign-boosts-house-democrats-health-care-rcna142739"
  },
  {
    "text": "The one man who could save Joe Biden  —  Jay Powell would very much like to stay out of politics, especially in an election year.  The Federal Reserve chair doesn't want to be perceived as having a horse in the race come November, especially when one of said horses — Donald Trump … ",
    "url": "https://www.businessinsider.com/federal-reserve-jerome-powell-election-trump-biden-president-interest-rates-2024-3"
  },
  {
    "text": "NAACP calls on Black student-athletes to boycott Florida public colleges over anti-DEI policy  —  “If these institutions are unable to completely invest in those athletes, it's time they take their talents elsewhere,” the leader of the civil rights organization said.",
    "url": "https://www.nbcnews.com/news/us-news/naacp-boycott-florida-colleges-black-athletes-dei-policy-rcna142549"
  }
]