[
  {
    "text": "European leaders to hold emergency summit on Ukraine as Trump-Putin call strains ties  —  British Prime Minister Keir Starmer is set to join European leaders at an emergency summit in Paris on Monday, Britain's PA media reported, after the relationship of the continent with Washington … ",
    "url": "https://www.cnn.com/2025/02/15/europe/europe-emergency-summit-ukraine-intl-latam"
  },
  {
    "text": "As US recedes, NATO scrambles to find a new leader  —  The Brits, French, and Germans all have their own ideas about how to defend the continent with America's plans in flux. … MUNICH — European officials say they get Donald Trump's point: They need to take care of their own defense — with less help from the Americans.",
    "url": "https://www.politico.eu/article/us-recedes-nato-scrambles-find-new-leader-munich-security-conference/"
  },
  {
    "text": "Dems concede Republicans ‘running circles’ around them online as Trump remakes Washington  —  The Democratic response to Trump, one Texas lawmaker said, is “too slow and too tepid and not meeting the moment.”  —  The Department of Government Efficiency created its own account on X last November … ",
    "url": "https://www.politico.com/news/2025/02/16/democrats-losing-trump-doge-information-battle-00204522"
  },
  {
    "text": "Democrats confront their powerlessness as Trump flexes authority  —  Amid Democrats' shock and bickering over how much to respond to President Donald Trump is a deeper question rippling through leaders across the Capitol and across the country: How much should they rely on the same institutional … ",
    "url": "https://www.cnn.com/2025/02/16/politics/democrats-strategy-powerless-trump/"
  },
  {
    "text": "Trump Official Destroying USAID Secretly Met With Christian Nationalists Abroad in Defiance of U.S. Policy  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up to receive our biggest stories as soon as they're published.  —  Before Peter Marocco was selected … ",
    "url": "https://www.propublica.org/article/usaid-peter-marocco-state-department-bosnia-serbia-diplomacy-trump-foreign-policy"
  },
  {
    "text": "Trump Suggests No Laws Are Broken if He's ‘Saving His Country’  —  President Trump shared a quotation on social media, making it clear it was one he wanted people to absorb: “He who saves his Country does not violate any Law.”  —  President Trump on Saturday posted on social media … ",
    "url": "https://www.nytimes.com/2025/02/15/us/politics/trump-saves-country-quote.html?unlocked_article_code=1.xU4.tdxZ.LL3LjMZXrLPw"
  },
  {
    "text": "Justice Department fires multiple immigration judges amid case backlog  —  A union representing the judges said it “makes no sense” to make cuts to immigration courts as Trump promises to carry out mass deportations, which must go through the courts.  —  WASHINGTON — The Department … ",
    "url": "https://www.nbcnews.com/politics/justice-department/justice-department-fires-multiple-immigration-judges-case-backlog-rcna192365"
  },
  {
    "text": "ICE struggles to boost arrest numbers despite infusion of resources  —  Trump has ordered a wartime effort to increase deportations, but ICE statistics show arrests have dipped so far this month.  —  Since taking office, President Donald Trump has launched an all-of-government immigration crackdown … ",
    "url": "https://www.washingtonpost.com/immigration/2025/02/15/ice-arrests-immigration-deportations/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM5NTk1NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQwOTc3OTk5LCJpYXQiOjE3Mzk1OTU2MDAsImp0aSI6ImM0YzA0NjEyLWY0YTUtNGEzNi1hNDMxLTg3YmI1ZTQ1MTc4OSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9pbW1pZ3JhdGlvbi8yMDI1LzAyLzE1L2ljZS1hcnJlc3RzLWltbWlncmF0aW9uLWRlcG9ydGF0aW9ucy8ifQ.3Dr1GN4zhqE1TUP74Zj_Iw4b6kMqBFfSsqko4zTe0wo&itid=gfta"
  },
  {
    "text": "Birthright Citizenship - A Response to Barnett and Wurman  —  In a recent New York Times op ed, legal scholars Randy Barnett and Ilan Wurman offer a partial defense of President Trump's executive order denying birthright citizenship to children of undocumented immigrants, and migrants in the US on temporary visas.",
    "url": "https://reason.com/volokh/2025/02/15/birthright-citizenship-a-response-to-barnett-and-wurman/"
  },
  {
    "text": "How Trump's One-for-One Tariff Plan Threatens the Global Economy  —  In starting a process to impose reciprocal tariffs on American trading partners, the White House is sowing uncertainty and risking inflation.  —  Rows of cars waiting to be shipped at the Port of Tianjin in China.",
    "url": "https://www.nytimes.com/2025/02/16/business/trump-tariffs-global-economy.html"
  },
  {
    "text": "Ed Department: DEI Violates Civil Rights Law  —  In a sweeping and unprecedented letter issued over the weekend, the Office for Civil Rights declared race-based scholarships, cultural centers and even graduation ceremonies illegal.  —  The Education Department's Office for Civil Rights declared … ",
    "url": "https://www.insidehighered.com/news/diversity/race-ethnicity/2025/02/15/trump-admin-threatens-rescind-federal-funds-over-dei"
  },
  {
    "text": "Appeals court rejects Trump in showdown over firing of ethics watchdog  —  The D.C. Circuit panel voted, 2-1, against the president's bid to immediately remove Hampton Dellinger.  —  A divided federal appeals court panel has again turned down President Donald Trump's request to follow through … ",
    "url": "https://www.politico.com/news/2025/02/16/appeals-court-rejects-trump-in-showdown-over-firing-of-ethics-watchdog-00204551"
  },
  {
    "text": "US government tries to rehire nuclear staff it fired days ago  —  The US government is trying to rehire nuclear safety employees it had fired on Thursday, after concerns grew that their dismissal could jeopardise national security, US media reported.  —  The National Nuclear Security Administration … ",
    "url": "https://www.bbc.com/news/articles/c4g3nrx1dq5o"
  },
  {
    "text": "Trump administration firings hit key office handling bird flu response  —  The layoffs in USDA's National Animal Health Laboratory Network program office come as egg prices reach record high amid worsening outbreak.  —  Laboratories in a national network of 58 facilities responding to the spread … ",
    "url": "https://www.politico.com/news/2025/02/16/trump-administration-firings-bird-flu-response-00204542"
  },
  {
    "text": "Trump Officials Attack a German Consensus on Nazis and Speech  —  Vice President JD Vance and Elon Musk have challenged decades-long approaches to political extremism that were designed to prevent another Hitler.  —  The American vice president visited a concentration camp on Thursday afternoon.",
    "url": "https://www.nytimes.com/2025/02/15/world/europe/vance-musk-nazis-afd-munich.html"
  },
  {
    "text": "NAACP lists companies that dump DEI in its tactical spending guide for Black Americans  —  The NAACP wants Black Americans to steer their buying power toward companies that haven't pulled back from diversity, equity and inclusion programs under conservative pressure, and the nation's oldest … ",
    "url": "https://apnews.com/article/black-consumers-dei-buying-guide-naacp-34664d8af92e2dc1ba787a498348b7a4"
  },
  {
    "text": "This Is What the Courts Can Do if Trump Defies Them  —  Are we heading toward a full-blown constitutional crisis?  For the first time in decades, the country is wrestling with this question.  It was provoked by members of the Trump administration, including Russell Vought … ",
    "url": "https://www.nytimes.com/2025/02/16/opinion/what-if-trump-defies-courts.html"
  },
  {
    "text": "Citing DoD order, Md. National Guard to skip Frederick Douglass event  —  The guidance bars military departments from using official resources to support cultural awareness months.  —  The Maryland National Guard has declined to participate in a parade to honor the life and legacy of abolitionist … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2025/02/15/maryland-national-guard-frederick-douglass-event/"
  },
  {
    "text": "Musk and Trump are stopping the distribution of live-saving aid and firing anybody who tells the public about it  —  These people are just cartoonishly evil:  —  A new internal memo circulating inside the U.S. Agency for International Development neatly captures this split.",
    "url": "https://www.lawyersgunsmoneyblog.com/2025/02/musk-and-trump-are-stopping-the-distribution-of-live-saving-aid-and-firing-anybody-who-tells-the-public-about-it"
  }
]