[
  {
    "text": "Why the Trump-Zelenskyy meeting imploded  —  The News  —  President Donald Trump's perception that Ukrainian President Volodymyr Zelenskyy was overtaking the day's planned emphasis on a US-Ukraine minerals deal partly set off Friday's Oval Office blowup, according to a White House official.",
    "url": "https://www.semafor.com/article/02/28/2025/why-the-trump-zelenskyy-meeting-imploded"
  },
  {
    "text": "The Real Reason Trump Berated Zelensky  —  Of the many bizarre and uncomfortable moments during today's Oval Office meeting between Donald Trump, J. D. Vance, and Volodymyr Zelensky—during which Trump finally shattered the American alliance with Ukraine—one was particularly revealing: What … ",
    "url": "https://www.theatlantic.com/politics/archive/2025/02/zelensky-trump-putin-ukraine/681883/"
  },
  {
    "text": "At Least Now We Know the Truth  —  Sign up for Trump's Return, a newsletter featuring coverage of the second Trump presidency.  —  At least the Oval Office meeting held by President Donald Trump and Vice President J. D. Vance with Ukrainian President Volodymyr Zelensky was held in front of the cameras.",
    "url": "https://www.theatlantic.com/politics/archive/2025/02/least-now-we-know-truth-about-trump-and-vance/681872/?gift=hVZeG3M9DnxL4CekrWGK322xBEKOAOqJ6N2BuUzPwvw&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "A president just disrespected America in the Oval Office.  It wasn't Zelensky  —  It's time to say it plainly.  America's leadership has switched sides in the war.  The American people have not, and they should speak up.  —  In the past several weeks, the U.S. leadership … ",
    "url": "https://kyivindependent.com/editorial-a-president-just-disrespected-america-in-the-oval-office-it-wasnt-zelensky/"
  },
  {
    "text": "“The free world needs a new leader”: Allies defend Zelensky after Trump debacle … - “He disrespected the United States of America in its cherished Oval Office. … - The verbal clash was triggered when Zelensky asked Vice President Vance “what kind of diplomacy” he envisioned with Vladimir Putin … ",
    "url": "https://www.axios.com/2025/02/28/trump-zelensky-ukraine-europe-reactions"
  },
  {
    "text": "Putin Wins the Trump-Zelensky Oval Office Spectacle  —  Vice President Vance starts a public fight that only helps Russia's dictator.  —  Toward the end of his on-camera, Oval Office brawl with Ukraine's Volodymyr Zelensky on Friday, President Trump quipped that it was “great television.”",
    "url": "https://www.wsj.com/opinion/putin-wins-the-trump-zelensky-oval-office-spectacle-e23e9b21?st=xfiJdB&reflink=desktopwebshare_permalink"
  },
  {
    "text": "‘Free world needs a new leader’: Europe defends Zelenskyy after Trump attack  —  BRUSSELS ― European leaders on Friday rallied to defend Ukrainian President Volodymyr Zelenskyy after United States President Donald Trump and Vice President JD Vance subjected him to a tirade of withering and infantilizing abuse in the Oval Office.",
    "url": "https://www.politico.eu/article/volodymyr-zelenskyy-donald-trump-jd-vance-oval-office-white-house-us-ukraine-war-russia/"
  },
  {
    "text": "Live updates: Trump cuts short talks with Ukraine's Zelenskyy after Oval Office blow up  —  Watch live as U.S. President Donald Trump greets Ukrainian President Volodymyr Zelenskyy in Washington, D.C.  —  President Donald Trump has cut short talks with Ukrainian President Volodymyr Zelenskyy … ",
    "url": "https://apnews.com/live/donald-trump-latest-news-2-28-2025"
  },
  {
    "text": "Russian state media briefly enters Oval Office during Zelenskyy meeting  —  The White House did not address how the unapproved reporter was able to gain access to the Oval Office.  —  The White House last week announced that “all journalists deserve a seat” in the Oval Office press pool.",
    "url": "https://www.politico.com/news/2025/02/28/tass-oval-office-trump-zelenskyy-00206739"
  },
  {
    "text": "Excerpts From the Fiery Exchange Between Trump and Zelensky at the White House  —  During the Oval Office meeting, President Trump told the Ukrainian leader: “You're either going to make a deal or we're out.”  —  A meeting between President Trump and President Volodymyr Zelensky of Ukraine … ",
    "url": "https://www.nytimes.com/2025/02/28/us/politics/trump-zelensky-transcript.html"
  },
  {
    "text": "Trump And Vance Ambush Zelensky In Prelude To Betrayal  —  JD Vance egged on the president, setting the stage for the US to abandon a key American ally in televised Oval Office meeting.  —  President Donald Trump and Vice President J.D. Vance moved to betray a key U.S. ally that has lost hundreds … ",
    "url": "https://talkingpointsmemo.com/news/trump-and-vance-ambush-zelensky-in-prelude-to-betrayal"
  },
  {
    "text": "A Russian state media reporter gained entry to the Oval Office for Trump-Zelensky sit-down  —  A member of Russia's state-owned news agency gained access to the Oval Office on Friday to cover President Trump's sit-down with Ukrainian President Volodymyr Zelensky - even as the AP and Reuters were barred from the high-level meeting.",
    "url": "https://www.cnn.com/2025/02/28/media/tass-russian-state-media-oval-office/"
  },
  {
    "text": "Exclusive: Hegseth orders Cyber Command to stand down on Russia planning  —  Defense Secretary Pete Hegseth last week ordered U.S. Cyber Command to stand down from all planning against Russia, including offensive digital actions, according to three people familiar with the matter.",
    "url": "https://therecord.media/hegseth-orders-cyber-command-stand-down-russia-planning"
  },
  {
    "text": "Voice of America Journalists Face Investigations for Trump Comments  —  The broadcaster placed a longtime journalist on leave amid growing concerns about its editorial independence.  —  Voice of America, the federally funded broadcaster to the world, has long prided itself on serving … ",
    "url": "https://www.nytimes.com/2025/02/28/business/voice-of-america-trump.html?unlocked_article_code=1.0k4.BEpe.u1SyCVNGvi61"
  },
  {
    "text": "Federal workers told once again to justify their work to DOGE  —  The late-night email created more anxiety for public-sector employees.  —  Federal workers are again being asked to justify their jobs to the Department of Government Efficiency overseen by billionaire Elon Musk.",
    "url": "https://www.politico.com/news/2025/02/28/federal-workers-told-once-again-to-justify-their-work-to-doge-00206853"
  },
  {
    "text": "Exclusive: US intel shows Russia and China are attempting to recruit disgruntled federal employees, sources say  —  Foreign adversaries including Russia and China have recently directed their intelligence services to ramp up recruiting of US federal employees working in national security … ",
    "url": "https://www.cnn.com/2025/02/28/politics/us-intel-russia-china-attempt-recruit-disgruntled-federal-employees/"
  },
  {
    "text": "FBI returns materials seized at Mar-a-Lago to Trump, White House says  —  The search was part of the federal investigation into Donald Trump's alleged mishandling of classified documents and obstruction of attempts to retrieve them.  —  Just now  —  The FBI on Friday returned at least … ",
    "url": "https://www.washingtonpost.com/national-security/2025/02/28/trump-fbi-classified-documents-mar-a-lago/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQwNzE4ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQyMDk3NTk5LCJpYXQiOjE3NDA3MTg4MDAsImp0aSI6IjY2NmE4YWIxLWQyYWUtNDkyNy05YTI0LWQzM2JjZDZmN2FlMyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb25hbC1zZWN1cml0eS8yMDI1LzAyLzI4L3RydW1wLWZiaS1jbGFzc2lmaWVkLWRvY3VtZW50cy1tYXItYS1sYWdvLyJ9.hC3Dkkr8H3jR6TZtPVTvKhgFoCONcGRUs6Ky6669Yc8&itid=gfta"
  },
  {
    "text": "Georgia Nonprofit That Produces Life-Saving Food For Kids Has Federal Contract Cut  —  An estimated 300,000 children globally are expected to lose access to a nutrient-dense peanut butter that's specially formulated to treat severe acute malnutrition.  —  A Georgia nonprofit that produces emergency aid … ",
    "url": "https://www.huffpost.com/entry/mana-food-aid-producer-loses-usaid-contracts_n_67c1fdb7e4b0c96eb9312299"
  },
  {
    "text": "Trump officials start dismantling civil rights offices, as part of DOGE's secret plan  —  Legal experts said that unwinding a civil-rights-era bulwark designed to safeguard employees' rights removes a crucial check on institutional power.  —  Agencies across the federal government … ",
    "url": "https://www.washingtonpost.com/nation/2025/02/28/doge-trump-civil-rights-office-closing-eeoc/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQwNzE4ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQyMDk3NTk5LCJpYXQiOjE3NDA3MTg4MDAsImp0aSI6IjQ2MWYzMWZmLTdjYmUtNDQxMS1iNzA4LWI3MTA2MmE3OWU3MSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb24vMjAyNS8wMi8yOC9kb2dlLXRydW1wLWNpdmlsLXJpZ2h0cy1vZmZpY2UtY2xvc2luZy1lZW9jLyJ9.QJkamYpMdxpDhqxZtHvtDS6vPHqc6K7-exiIMntAcwI&itid=gfta"
  },
  {
    "text": "Bezos' changes at ‘Washington Post’ lead to mass subscription cancellations — again  —  More than 75,000 digital subscribers to The Washington Post have cancelled since its owner, billionaire Amazon founder Jeff Bezos, announced on Wednesday that he would radically overhaul the paper's opinion pages … ",
    "url": "https://www.npr.org/2025/02/28/nx-s1-5312819/washington-post-bezos-subscriptions-cancellations"
  },
  {
    "text": "IRS rejected request for addresses of people believed to be in U.S. illegally  —  Immigration enforcement officials sought home addresses for 700,000 people and asked for skilled auditors to investigate businesses.  The tax agency is forbidden from sharing protected information, even with other parts of the government.",
    "url": "https://www.washingtonpost.com/business/2025/02/28/immigration-enforcement-trump-administration-irs/"
  },
  {
    "text": "RFK Jr. moves to eliminate public comment on HHS decisions  —  In notice to Federal Register, health agency says public participation is not needed in many decisions  —  Health and Human Services Secretary Robert F. Kennedy Jr.  —  Friday proposing to strip public participation from much of the business his department conducts.",
    "url": "https://www.statnews.com/2025/02/28/rfk-jr-eliminating-public-comment-hhs-decisions-richardson-waiver/"
  },
  {
    "text": "State Department terminates U.S. support of Ukraine energy grid restoration  —  The USAID initiative had invested hundreds of millions of dollars in helping Ukraine's energy grid recover from attacks from Russia.  —  WASHINGTON — The State Department this week terminated a U.S. Agency … ",
    "url": "https://www.nbcnews.com/politics/state-department-terminates-us-support-ukraine-energy-grid-restoration-rcna194259"
  },
  {
    "text": "HPV vaccine credited for declining cervical precancer rates  —  Fewer precancerous lesions are being found in young women undergoing cervical cancer screenings thanks to the human papillomavirus (HPV) vaccine.  —  Rates of precancerous lesions in women between the ages of 20 and 24 dropped … ",
    "url": "https://thehill.com/policy/healthcare/5170163-hpv-vaccine-effectiveness/"
  },
  {
    "text": "Firings at US weather and oceans agency risk lives and economy, former agency heads warn  —  The federal weather and oceans agency touches people's daily lives in unnoticed ways, so massive firings there will likely cause needless deaths and a big hit to America's economy, according to the people who ran it.",
    "url": "https://apnews.com/article/noaa-doge-federal-cuts-musk-weather-danger-6f60e7c511989aeff8930ae87c9a5ee8"
  },
  {
    "text": "Trump administration retreats in fight against Russian cyber threats  —  Recent incidents indicate US is no longer characterizing Russia as a cybersecurity threat, marking a radical departure: ‘Putin is on the inside now’  — Don't let a billionaire's algorithm control what you read.",
    "url": "https://www.theguardian.com/us-news/2025/feb/28/trump-russia-hacking-cyber-security"
  },
  {
    "text": "Hegseth Warned of Military Action if Mexico Fails to Meet Trump's Border Demands  —  The defense secretary's closed-door comments have unnerved Mexican officials negotiating to avoid 25% tariffs  —  MEXICO CITY—It was the first call U.S. Defense Secretary Pete Hegseth held … ",
    "url": "https://www.wsj.com/politics/policy/trump-mexico-drug-cartel-tariff-hegseth-military-action-5f507ab0"
  }
]