[
  {
    "text": "Elon Musk's Blitz Shakes U.S. Government as He Sweeps Through Agencies  —  The billionaire is creating major upheaval as his team sweeps through agencies, in what has been an extraordinary flexing of power by a private individual.  —  The billionaire is creating major upheaval … ",
    "url": "https://www.nytimes.com/2025/02/03/us/politics/musk-federal-government.html?unlocked_article_code=1.uE4.TJsg.JuW7_bu37TM7&smid=url-share"
  },
  {
    "text": "Elon Musk Installs Illegal Server to Seize All Federal Workers' Data  —  Elon Musk has taken control of government employees' private data by having his cronies illegally install a commercial server at the Office of Personnel Management.  —  Musk and his handpicked associates at the fake … ",
    "url": "https://newrepublic.com/post/191075/elon-musk-power-grab-server-federal-worker-data"
  },
  {
    "text": "Elon Musk Suggests Getting Rid Of All Regulations In Midnight Call  —  “If it's not possible now, it'll never be possible,” Musk said of his proposal to simply ignore all federal regulation as a baseline.  —  LOADING  —  President Donald Trump's “government efficiency” … ",
    "url": "https://www.huffpost.com/entry/elon-musk-regulations-default-gone_n_67a12742e4b09a02376043c7"
  },
  {
    "text": "DOGE's access to federal data is ‘an absolute nightmare,’ legal experts warn  —  The latest moves at Treasury have already triggered a lawsuit, with a fight over the dissolution of USAID looming.  —  Elon Musk's headlong rush to take control of crucial federal agencies and functions … ",
    "url": "https://www.politico.com/news/2025/02/03/doge-treasury-usaid-donald-trump-011538"
  },
  {
    "text": "I'm a Federal Worker.  Elon Musk's Government Data Heist Is the Entire Ballgame.  —  On Friday night, reports emerged that Elon Musk's aides had tussled with Office of Personnel Management and Treasury staffers while demanding access to troves of information about federal employees.",
    "url": "https://slate.com/news-and-politics/2025/02/elon-musk-us-aid-social-security-data-heist-trump.html"
  },
  {
    "text": "The ‘Rapid Unscheduled Disassembly’ of the United States Government  —  Elon Musk's bureaucratic coup is underway.  —  Elon Musk is not the president, but it does appear that he—a foreign-born, unelected billionaire who was not confirmed by Congress—is exercising profound influence … ",
    "url": "https://www.theatlantic.com/technology/archive/2025/02/elon-musk-bureaucratic-coup/681559/?gift=bQgJMMVzeo8RHHcE1_KM0WBeHzOXI-QvNDe77JFppiU&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Elon Musk Is President  —  He did not receive a single vote.  He did not get confirmed.  He does not receive a government paycheck.  —  The world's richest man has declared war on the federal government and, in a matter of days, has moved to slash its size and reach, while gaining access to some of its most sensitive secrets.",
    "url": "https://www.theatlantic.com/politics/archive/2025/02/president-elon-musk-trump/681558/"
  },
  {
    "text": "CONSTITUTIONAL STANDOFF  —  *Special Alert from The Contrarian*  —  Public opposition to the most wholesale and jaw-dropping violation of Americans' privacy and President Trump's unilateral outsourcing of the executive branch's operation to a private individual, Elon Musk, has taken hold.",
    "url": "https://contrarian.substack.com/p/constitutional-standoff"
  },
  {
    "text": "Democratic Senator Says He Will Stall Trump Nominees Until USAID Is Back  —  Schatz said he would hold up Trump's diplomatic confirmations  —  WASHINGTON—Sen. Brian Schatz (D., Hawaii) said he would place a “blanket hold” on all of President Trump's State Department nominees until … ",
    "url": "https://www.wsj.com/politics/policy/democratic-senator-says-he-will-block-trump-nominees-until-usaid-is-back-94f8699e?st=iRCZyy&reflink=article_copyURL_share"
  },
  {
    "text": "Democrats flood the zone with acts of anti-Trump resistance … - “That's not a thing. … - House Minority Leader Hakeem Jeffries (D-N.Y.) unveiled a 10-part plan for countering Trump that includes using the federal funding process to thwart his efforts to “defund programs important to everyday Americans.”",
    "url": "https://www.axios.com/2025/02/04/democrats-trump-house-senate-resistance"
  },
  {
    "text": "Trump preps order to dismantle Education Dept. as DOGE probes data  —  Closing the agency would require congressional approval, so the new administration hopes to diminish it in the meantime.  —  President Donald Trump is preparing an executive order aimed at eventually closing the Education Department and … ",
    "url": "https://www.washingtonpost.com/education/2025/02/03/trump-education-department-dismantling-executive-order-draft/"
  },
  {
    "text": "Trump Advisers Weigh Plan to Dismantle Education Department  —  Administration officials are discussing executive order that could shut down key functions of the agency  —  Trump administration officials are weighing executive actions to dismantle the Education Department as part of the campaign … ",
    "url": "https://www.wsj.com/politics/policy/education-department-trump-executive-order-eeaf1cb6?st=chFDfP&reflink=article_copyURL_share"
  },
  {
    "text": "USAID personnel told to stay away from headquarters after Elon Musk's shutdown comments  —  Marocco held several national security positions during the first Trump administration, including at USAID, where he tried to consolidate power and slash funding.  —  WASHINGTON — Secretary … ",
    "url": "https://www.nbcnews.com/politics/white-house/usaid-personnel-told-stay-away-headquarters-elon-musks-shutdown-commen-rcna190405"
  },
  {
    "text": "Trump to pause promised tariffs for 30 days after speaking with Trudeau  —  Trump, Trudeau spoke last hour for the second time today  —  Trump, Trudeau have 2nd phone call as tariff deadline nears  —  Prime Minister Justin Trudeau said Monday that U.S. President Donald Trump will hold off … ",
    "url": "https://www.cbc.ca/news/politics/trudeau-trump-speak-trade-war-1.7448805"
  },
  {
    "text": "DOJ Says Trump Administration Doesn't Have to Follow Court Order Halting Funding Freeze  —  The U.S. Department of Justice (DOJ) argued Monday that a federal court order blocking President Donald Trump's federal funding freeze doesn't halt the administration's efforts.",
    "url": "https://www.democracydocket.com/news-alerts/doj-says-trump-administration-doesnt-have-to-follow-court-order-halting-funding-freeze/"
  },
  {
    "text": "A Coup Is In Progress In America  —  A coup is underway in the United States, and we must stop pretending otherwise.  The signs are unmistakable and accelerating: in just the past 48 hours, Elon Musk's DOGE commission has seized control of Treasury payment systems and gained unauthorized access … ",
    "url": "https://www.techdirt.com/2025/02/03/a-coup-is-in-progress-in-america/"
  },
  {
    "text": "Top ‘60 Minutes’ Producer Says He Will Not Apologize Over Trump Lawsuit  —  Bill Owens, the show's executive producer, addressed his staff as CBS's parent company, Paramount, pursues a legal settlement with the president.  —  The head of “60 Minutes” told the show's staff on Monday … ",
    "url": "https://www.nytimes.com/2025/02/03/business/media/cbs-news-60-minutes-trump.html"
  },
  {
    "text": "Texas National Guard to make immigration arrests under agreement with Trump administration, Abbott says  —  Gov. Greg Abbott said that the agreement was effective immediately.  —  Texas National Guard soldiers now have the authority to make immigration arrests and help detain … ",
    "url": "https://www.texastribune.org/2025/02/03/texas-national-guard-immigration-arrests/"
  },
  {
    "text": "Trump appoints speechwriter fired for attending conference with White nationalists to top State Department role  —  Darren Beattie, a former Donald Trump speechwriter who was fired in 2018 after CNN revealed he spoke at a conference attended by White nationalists, has been elevated to a top job … ",
    "url": "https://www.cnn.com/2025/02/03/politics/kfile-darren-beattie-state-department-controversial-tweets-white-nationalist-conference/"
  },
  {
    "text": "CFPB halts work after Trump appoints Bessent as acting head  —  The consumer watchdog agency was formed in the wake of the 2008 financial crisis.  Elon Musk wants to “delete” it.  —  President Donald Trump on Monday appointed Treasury Secretary Scott Bessent as the acting director … ",
    "url": "https://www.washingtonpost.com/business/2025/02/03/trump-cfpb-bessent-halt/"
  },
  {
    "text": "GOP's Susan Collins to back Tulsi Gabbard confirmation  —  Sen. Susan Collins (R-Maine) announced on Monday that she will support Tulsi Gabbard to become director of national intelligence (DNI), giving her a key boost in her confirmation push.  —  Collins was considered a crucial swing vote … ",
    "url": "https://thehill.com/homenews/senate/5124047-tulsi-gabbard-susan-collins-intelligence-committee-dni/"
  },
  {
    "text": "California lawmakers approve $50M for Trump lawsuits, immigrant aid  —  The state's Republican minority argued it's foolish to be taking on Trump when California is trying to secure federal wildfire aid.  —  SACRAMENTO, California — California lawmakers on Monday approved a “Trump-proofing” … ",
    "url": "https://www.politico.com/news/2025/02/03/california-trump-lawsuits-immigrant-aid-00202256"
  },
  {
    "text": "Musk Says He's ‘Deleted’ Popular Free IRS Tax Filing Program  —  WHO ASKED FOR THIS?  —  The online tax filing option on the IRS website had a strong bipartisan 76% approval rating from registered voters.  —  Kanye West's Naked Grammys Stunt Could Cost Him $20M  —  THE NAKED TRUTH",
    "url": "https://www.thedailybeast.com/musk-says-hes-deleted-popular-free-irs-tax-filing-program/"
  },
  {
    "text": "Trump orders creation of US sovereign wealth fund, says it could buy TikTok  —  U.S. President Donald Trump signed an executive order on Monday ordering the U.S. Treasury and Commerce Departments to create a sovereign wealth fund and said it may purchase TikTok.  —  “We're going to stand this thing up within the next 12 months.",
    "url": "https://www.reuters.com/markets/wealth/trump-signs-executive-order-create-sovereign-wealth-fund-2025-02-03/"
  }
]