[
  {
    "text": "House GOP in open warfare over doomed spending plan  —  One Republican summed up the situation neatly as leadership-empowered negotiators faceplanted with days to go before a shutdown: “It's a mess.”  —  As House Republicans began ripping apart their party's latest spending proposal … ",
    "url": "https://www.politico.com/news/2023/09/19/house-gop-spending-plan-00116631"
  },
  {
    "text": "Chaos and acrimony as House Republicans pull bill to keep government running: ‘multiple games afoot’  —  House Speaker McCarthy in a bind as GOP factions, and factions within factions, at loggerheads  —  An expected procedural vote to advance the stopgap spending bill put together … ",
    "url": "https://www.foxnews.com/politics/chaos-house-gop-ranks-bipartisan-proposal-avoid-government-shutdown-emerges"
  },
  {
    "text": "McCarthy gets tough with the right  —  Boxed in by conservatives as a shutdown looms, the embattled speaker is punching back.  —  After months tiptoeing around the conservatives who have made his speakership a constant high-wire act, House Speaker Kevin McCarthy appears to be fed up — and ready to fight.",
    "url": "https://www.politico.com/news/2023/09/19/mccarthy-gets-mean-00116702"
  },
  {
    "text": "House GOP pulls key vote on stopgap spending bill amid conservative opposition  —  House GOP leadership pulled a procedural vote on a proposed short-term funding stopgap that has bitterly divided the Republican conference and elicited opposition from hard-line conservatives.",
    "url": "https://thehill.com/homenews/house/4212036-house-gop-pulls-key-vote-on-stopgap-spending-bill-amid-conservative-opposition/"
  },
  {
    "text": "House will hold first Biden impeachment inquiry hearing next Thursday  —  House Republicans are moving forward with their impeachment inquiry into President Biden as soon as next week  —  FIRST ON FOX — House Republicans will hold their first impeachment inquiry hearing investigating allegations … ",
    "url": "https://www.foxnews.com/politics/house-hold-first-biden-impeachment-inquiry-hearing-thursday"
  },
  {
    "text": "Ray Epps, subject of Tucker Carlson's Jan. 6 conspiracy theories, charged by DOJ  —  Epps entered Capitol grounds on Jan. 6 as a supporter of former President Donald Trump.  He told the Jan. 6 committee that the conspiracy theories about him ruined his life.",
    "url": "https://www.nbcnews.com/politics/justice-department/ray-epps-subject-tucker-carlsons-jan-6-conspiracy-theories-charged-doj-rcna99836"
  },
  {
    "text": "Witness testimony disputes IRS whistleblower allegations in Hunter Biden probe as Republicans begin impeachment inquiry  —  New testimony from a number of FBI and Internal Revenue Service officials casts doubt on key claims from an IRS whistleblower who alleges there was political interference … ",
    "url": "https://www.cnn.com/2023/09/19/politics/witness-testimony-disputes-irs-whistleblower-hunter-biden/"
  },
  {
    "text": "This is what taking on election deniers really looks like  —  Democrats won a whole lot of elections in 2022, in no small part on their vow to strengthen and defend democracy.  But if they hope to turn the issue into a sustained political winner, they have to deliver on that promise … ",
    "url": "https://www.washingtonpost.com/opinions/2023/09/19/josh-shapiro-automatic-voter-registration-pennsylvania-trump-maga/"
  },
  {
    "text": "Sen. Susan Collins on the New Senate Dress Code: ‘I Plan to Wear a Bikini’  —  Some Republicans are bashing the informal dress code policy change, while other seem to be embracing it  —  A Facebook icon representing an external link to share the article on Facebook.A Twitter icon representing … ",
    "url": "https://themessenger.com/politics/sen-susan-collins-on-the-new-senate-dress-code-i-plan-to-wear-a-bikini"
  },
  {
    "text": "Maybe Matt Gaetz Is Right  —  The dysfunctional dance taking place in the House between Speaker Kevin McCarthy and his right flank has driven me to consider something I never imagined possible: that Matt Gaetz is right.  —  A House speaker can be successful only with the confidence … ",
    "url": "https://www.nytimes.com/2023/09/19/opinion/kevin-mccarthy-gaetz.html"
  },
  {
    "text": "Lauren Boebert's sexy adventure: Blame conservatives' push for “traditional marriage”  —  Bari Weiss and Nicholas Kristof amplify GOP calls to marry young — that's just what the Colorado congresswoman did  —  It is a cycle as predictable as the sun rising and setting … ",
    "url": "https://www.salon.com/2023/09/19/lauren-boeberts-sexy-adventure-conservatives-push-for-traditional-marriage/"
  },
  {
    "text": "Rep. Lauren Boebert Says Hookup Theater Guy Won't Get Another Date  —  Rep. Lauren Boebert says it's dunzo between her and the theater groping guy — saying the one-time private moment came and went ... and it sounds like his politics might be at play.  —  The Colorado congresswoman touched … ",
    "url": "https://www.tmz.com/2023/09/18/rep-lauren-boebert-no-more-dates-after-theater-hookup/"
  },
  {
    "text": "‘Sound of Freedom’ Producer Felt the Naked Breasts of Apparently Underage Trafficking Victim  —  Files from a joint local and federal criminal investigation released to VICE News describe video evidence of the incident, which took place in Mexico on an Operation Underground Railroad mission.",
    "url": "https://www.vice.com/en/article/z3mq5w/sound-of-freedom-producer-underage-trafficking-victim"
  },
  {
    "text": "A real fact-check of Trump's appearance on Meet the Press  —  Kristen Welker's tenure as the new host of NBC's Meet the Press began on Sunday with an interview with former President Donald Trump.  NBC News promoted Trump's appearance as his “first broadcast network interview since leaving office.”",
    "url": "https://popular.info/p/a-real-fact-check-of-trumps-appearance"
  },
  {
    "text": "Alex Murdaugh Agrees to Plead Guilty to Federal Charges  —  He's charged with financial crimes related to bilking his law clients.  —  Alex Murdaugh, the disgraced South Carolina former lawyer convicted of murdering his wife and son to distract from massive fraud, has agreed to plead guilty … ",
    "url": "https://www.thedailybeast.com/alex-murdaugh-agrees-to-plead-guilty-to-federal-charges"
  },
  {
    "text": "The Idea That Biden Should Just Give Up Political Power Is Preposterous  —  It was clear from an early point that, barring some unforeseen circumstance, the 2024 presidential election would be a rematch between Donald Trump and Joe Biden — the first contest with two presidents … ",
    "url": "https://www.nytimes.com/2023/09/19/opinion/biden-political-power-2024.html"
  },
  {
    "text": "Republicans win a temporary freeze in New York's redistricting fight  —  Democrats have since argued that they should now be allowed to redraft the maps for 2024 rather than rely on the existing ones for the remainder of the decade.  —  ALBANY, N.Y. — Republicans won a preliminary round … ",
    "url": "https://www.politico.com/news/2023/09/19/republicans-new-york-redistricting-win-00116748"
  },
  {
    "text": "West Point sued by group behind Supreme Court affirmative action lawsuit  —  The group behind the lawsuits that led the Supreme Court to gut affirmative action at higher education institutions sued the U.S. Military Academy at West Point on Tuesday, seeking to end the school's race-conscious admissions policies.",
    "url": "https://thehill.com/regulation/court-battles/4212337-west-point-sued-by-group-behind-supreme-court-affirmative-action-lawsuit/"
  },
  {
    "text": "WSO Condemns the Government of India's Involvement in the Killing of Canadian Sikhs on Canadian Soil  —  Today, Prime Minister Justin Trudeau confirmed what Canadian Sikhs have known for months- that credible evidence exists to substantiate that agents of the Government of India were involved … ",
    "url": "https://www.worldsikh.org/wso_condemns_the_government_of_india_s_involvement_in_the_killing_of_canadian_sikhs_on_canadian_soil"
  },
  {
    "text": "Federal judge upholds convictions of Oath Keeper associate  —  A federal judge on Tuesday upheld two federal convictions against a Navy veteran and Oath Keeper associate accused of helping the far-right group stash weapons outside Washington, DC, on January 6, 2021.",
    "url": "https://www.cnn.com/2023/09/19/politics/oath-keeper-convictions/"
  },
  {
    "text": "Billions pour into Education Department as student loans restart  —  CASH FLOWS INTO EDUCATION DEPARTMENT AS STUDENT LOANS RESTART: Billions of dollars of payments are flooding into the Education Department as the agency begins turning on the federal student loan system that's largely been frozen since March 2020.",
    "url": "https://www.politico.com/newsletters/weekly-education"
  },
  {
    "text": "Americans' Dismal Views of the Nation's Politics  —  65% say they always or often feel exhausted when thinking about politics  —  65% say they always or often feel exhausted when thinking about politics  —  How we did this  —  Americans have long been critical of politicians and skeptical of the federal government.",
    "url": "https://www.pewresearch.org/politics/2023/09/19/americans-dismal-views-of-the-nations-politics/"
  },
  {
    "text": "Evidence Suggests Ukrainian Missile Caused Market Tragedy  —  Witness accounts and an analysis of video and weapon fragments suggest a Ukrainian missile failed to hit its intended target and landed in a bustling street, with devastating consequences.  —  The Sept. 6 missile strike … ",
    "url": "https://www.nytimes.com/2023/09/18/world/europe/ukraine-missile-kostiantynivka-market.html"
  },
  {
    "text": "Giuliani's former lawyers sue him for $1.36M in unpaid legal fees  —  The fees stem from the lawyers defending Giuliani's work with Donald Trump's efforts to overturn the 2020 election.  —  Rudy Giuliani's ex-lawyers are suing the former New York City mayor for failing to pay legal fees amounting … ",
    "url": "https://www.politico.com/news/2023/09/19/rudy-giuliani-lawyer-trump-00116671"
  }
]