[
  {
    "text": "Trump Put Musk on Phone With Zelensky During Call  —  Elon Musk was with Donald Trump at Mar-a-Lago when the president-elect spoke with Ukraine's leader.  It is not clear if they discussed any change in U.S. policy toward Ukraine.  —  President-elect Donald J. Trump spoke on Wednesday … ",
    "url": "https://www.nytimes.com/2024/11/08/us/politics/trump-musk-zelensky.html?unlocked_article_code=1.YU4.IeTL.0A1I6CIR9Fhj&smid=url-share"
  },
  {
    "text": "Scoop: Elon Musk joined Trump's call with Zelensky … - The Biden administration is now looking for ways to get as much military assistance as possible to Ukraine ahead of Jan. 20, when Trump could turn off the spigot.  — But the private conversations Trump and his team have had with Zelensky … ",
    "url": "https://www.axios.com/2024/11/08/musk-trump-zelensky-ukraine-call"
  },
  {
    "text": "Elon Musk joins Trump's call with Ukraine's Zelensky  —  The tech billionaire's involvement in the conversation between leaders is the latest indication he intends to play a prominent role in the next U.S. administration.  —  Elon Musk joined a Wednesday call between President-elect Donald … ",
    "url": "https://www.washingtonpost.com/politics/2024/11/08/elon-musk-trump-zelensky-call/"
  },
  {
    "text": "Behind the Curtain: Deep Democratic depression … Come January, they'll have scant power in the federal government, and shriveling clout in the courts and states.  — The traditional media structure sympathetic to their views, and hostile to Trump's, was shattered.",
    "url": "https://www.axios.com/2024/11/08/harris-biden-election-democratic-party"
  },
  {
    "text": "This Democratic defeat — and the rise of Trump 2.0 — was a decade in the making  —  Analysis: Biden's age and inability to sell his record or convince that he was fighting inflation were problems.  Longer-term Democratic weaknesses also came due.  —  There's something about an election … ",
    "url": "https://www.nbcnews.com/politics/elections/chuck-todd-democratic-defeat-rise-trump-20-was-decade-making-rcna179175"
  },
  {
    "text": "Here's the Plan to Fight Back  —  To everyone who feels like their heart has been ripped out of their chest, I feel the same.  To everyone who is afraid of what happens next, I share your fears.  But what we do next is important, and I need you in this fight with me.",
    "url": "https://time.com/collection/time100-voices/7173801/elizabeth-warren-democrats-plan-after-2024-election/"
  },
  {
    "text": "I blame the media  —  I am horrified and I am terrified and I am angry.  —  And I blame the media.  —  Yes, I am aware that some large number of people who voted for Trump did so fully aware that he will rule as a racist, a chaos agent, and a strongman.  That's what they want.  Noted.",
    "url": "https://presswatchers.org/2024/11/i-blame-the-media/"
  },
  {
    "text": "McCormick sues to challenge provisional ballots in Philadelphia  —  Pennsylvania Republican Senate candidate David McCormick filed two lawsuits challenging provisional ballots in Philadelphia, signaling he is prepared to take his fight to the Supreme Court.  —  McCormick declared victory … ",
    "url": "https://thehill.com/regulation/court-battles/4980694-mccormick-lawsuits-provisional-ballots-pennsylvania/"
  },
  {
    "text": "Wave of Racist Texts After Election Prompts F.B.I.'s Scrutiny  —  Offensive messages were reported across the South and from New York to California.  —  A wave of racist text messages summoning Black people to report for slavery showed up on phones across the United States … ",
    "url": "https://www.nytimes.com/2024/11/07/us/politics/racist-texts-election-fbi.html?unlocked_article_code=1.YU4.u4wx.TaO2iS_uL2BD&smid=url-share"
  },
  {
    "text": "Racist texts about slaves and ‘picking cotton’ sent to Black people as state AGs, colleges and police probe their origins  —  Authorities across the United States are investigating after racist text messages - some with references to “slave catchers” and “picking cotton” … ",
    "url": "https://www.cnn.com/2024/11/07/us/racist-text-messages-post-election"
  },
  {
    "text": "Justice Department Announces Murder-For-Hire and Related Charges Against IRGC Asset and Two Local Operatives  —  For Immediate Release  —  Iranian Asset Farhad Shakeri Employed Multiple Associates in the New York City Area to Surveil and Murder a U.S. Citizen of Iranian Origin Who Has Publicly Opposed the Iranian Government",
    "url": "https://www.justice.gov/opa/pr/justice-department-announces-murder-hire-and-related-charges-against-irgc-asset-and-two"
  },
  {
    "text": "Ted Cruz's daughter caught wincing and telling her mom 'don't clap' as senator praises Trump on stage  —  Caroline Cruz, 16, was left scowling at her mother on stage as the Texas senator prayed for a Trump win  —  Your support helps us to tell the story  —  From reproductive rights … ",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/ted-cruz-daughter-caroline-trump-election-b2643637.html"
  },
  {
    "text": "Playbook: Dems agonize over Sotomayor  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  THE LATEST RACE CALLS — Republican DAVE McCORMICK defeats Democratic Sen. BOB CASEY in Pennsylvania. ...  Reps. DON DAVIS (D-N.C.), YOUNG KIM (R-Calif.), JULIA BROWNLEY … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/11/08/dems-agonize-over-sotomayor-00188412"
  },
  {
    "text": "Dump Twitter  —  The oligarchs won.  When the markets closed November 6—the day Donald Trump was declared winner of the presidential election—the combined wealth of the world's 10 richest people, nine of whom live in the United States, had surged by a combined $63.5 billion.",
    "url": "https://newrepublic.com/article/188156/liberals-dump-musk-leave-twitter"
  },
  {
    "text": "Israeli soccer fans targeted in wave of violence in Amsterdam  —  Maccabi Tel Aviv FC was in Amsterdam to play Ajax  —  Maccabi Tel Aviv FC supporters were reportedly the target of violence in Amsterdam Thursday before and during the soccer team's match against Ajax.",
    "url": "https://www.foxnews.com/sports/israeli-soccer-fans-target-wave-violence-amsterdam"
  },
  {
    "text": "The wreckage Merrick Garland leaves behind  —  His failures left American democracy ripe for the picking. … ✍️  —  It has often been said that Donald Trump was running for president to keep himself out of prison.  Mission accomplished.  —  But the fact that Trump wasn't … ",
    "url": "https://www.publicnotice.co/p/merrick-garland-failures-explained"
  },
  {
    "text": "For transgender Americans, Trump's win after a campaign targeting them is terrifying  — President-elect Donald Trump ran a virulently anti-trans campaign, pushing hard against the queer community in stump speeches and in attack ads in swing states.  — That Trump won so decisively … ",
    "url": "https://www.latimes.com/politics/story/2024-11-08/transgender-americans-trump-election"
  },
  {
    "text": "Donald Trump asks arch protectionist Robert Lighthizer to run US trade policy  —  Tariff hawk's potential reappointment to top economy role likely to alarm trading partners  —  Robert Lighthizer, who was US trade representative when Donald Trump launched his trade war with China … ",
    "url": "https://www.ft.com/content/5003b5b9-7d36-49a7-96cc-d5fecc7a0a96"
  },
  {
    "text": "Harris, Biden camps blame each other for loss … - In response to Trump's decisive victory, aides in both camps are blaming the other for being more responsible, according to interviews with more than a dozen people in the White House and Harris' campaign.",
    "url": "https://www.axios.com/2024/11/08/kamala-harris-biden-advisers-blame-election"
  },
  {
    "text": "Trump: ‘NO INTENTION OF SELLING’ $3.5B stake in Trump Media  —  President-elect Donald Trump is doubling down on his plans to hold on to his roughly $3.5 billion stake in the parent company of Truth Social, just days after winning back the White House.  In a social media post, Trump … ",
    "url": "https://www.politico.com/live-updates/2024/11/08/congress/trump-not-dumping-truth-social-shares-00188456"
  },
  {
    "text": "Special counsel Jack Smith seeks pause in Trump's election interference criminal trial  —  The prosecutor said he would notify the court in December about how he plans to move forward, likely the first step in unwinding the case against Trump.  —  WASHINGTON — Special counsel Jack Smith … ",
    "url": "https://www.nbcnews.com/politics/2024-election/special-counsel-jack-smith-seeks-pause-trumps-election-interference-cr-rcna179335"
  },
  {
    "text": "FBI says hackers are sending fraudulent police data requests to tech giants to steal people's private information  —  The FBI is warning that hackers are obtaining private user information — including emails and phone numbers — from U.S.-based tech companies by compromising government … ",
    "url": "https://techcrunch.com/2024/11/08/fbi-says-hackers-are-sending-fraudulent-police-data-requests-to-tech-giants-to-steal-peoples-private-information/"
  },
  {
    "text": "Trump AG Prospect Warns Letitia James: ‘We Will Put Your Fat Ass In Prison’  —  Trump-aligned lawyer Mike Davis threatened New York's attorney general with racist and sexist posturing in perhaps a sign of things to come.  —  LOADING  —  Republican lawyer Mike Davis, an adviser for Donald … ",
    "url": "https://www.huffpost.com/entry/mike-davis-letitia-james-fat-ass-comment_n_672de5a9e4b0933e82c99ab2"
  },
  {
    "text": "Texas Democratic Party Chair to step down after brutal defeats  —  In the aftermath of his party's brutal shellacking in the 2024 elections, Texas Democratic Party chair Gilberto Hinojosa has announced he will step down in March.  —  Over his 12-year tenure, Hinojosa has faced fierce criticism … ",
    "url": "https://thehill.com/homenews/state-watch/4980899-texas-democratic-party-chair-resigns/"
  },
  {
    "text": "FBI brass ‘stunned’ and ‘shell-shocked’ over Trump reelection  —  The brass on the seventh floor at FBI headquarters in Washington are walking around in a daze and wary of a housecleaning since President-elect Donald Trump won his reelection on Tuesday, according to inside sources.",
    "url": "https://www.washingtontimes.com/news/2024/nov/7/fbi-brass-stunned-shell-shocked-donald-trump-reele/"
  }
]