[
  {
    "text": "Democrats enter panic mode as Gaza protests erupt … - “The longer they continue, and the worse that they get, the worse it's going to be for the election overall,” one House Democrat told Axios.  — The demonstrations, the lawmaker warned, are “bringing out [the public's] most conservative side.”",
    "url": "https://www.axios.com/2024/05/01/college-protests-democrats-congress"
  },
  {
    "text": "Democrats win a New York special election, further narrowing the House GOP's majority  —  Democratic state Sen. Tim Kennedy won a special election in the deep blue 26th District in western New York to serve the rest of Brian Higgins' term.  —  Democrats won a special election for a House seat … ",
    "url": "https://www.nbcnews.com/politics/2024-election/new-york-special-election-win-house-26-district-rcna149581"
  },
  {
    "text": "Democrat Tim Kennedy wins New York special election for House seat  —  Once he is sworn in to represent the state's 26th Congressional District, the Republican majority in the chamber will temporarily fall to just one vote.  —  State Sen. Tim Kennedy (D) is projected to win the special election … ",
    "url": "https://www.washingtonpost.com/politics/2024/04/30/new-york-special-election-house-kennedy/"
  },
  {
    "text": "Trump backs surveillance and prosecution of women to enforce abortion bans  —  As part of an extensive interview with Time Magazine, former President Donald Trump expanded on what abortion access would look like in the United States in a potential second term.",
    "url": "https://popular.info/p/trump-backs-surveillance-and-prosecution"
  },
  {
    "text": "Here's where campus protesters have been arrested over the past day.  —  Columbia in New York and Portland State University closed their campuses after pro-Palestinian demonstrators took over buildings.  More than 1,100 protesters have been arrested across the country in recent weeks.",
    "url": "https://www.nytimes.com/live/2024/04/30/nyregion/columbia-protests-college"
  },
  {
    "text": "Playbook: How the GOP tried to talk MTG down  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  WHEN HISTORY RHYMES — “NYPD sweeps occupied Hamilton Hall, arrests dozens,” Columbia Spectator: “The arrests came on the 56th anniversary of the 1968 police sweep … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/05/01/how-the-gop-tried-to-talk-mtg-down-00155395"
  },
  {
    "text": "Law Firm Defending Trump Seeks to Withdraw From a Long-Running Case  —  The firm, LaRocca Hornik, has represented Donald Trump's political operation in numerous suits dating to his first presidential run, including a pregnancy discrimination case in New York.",
    "url": "https://www.nytimes.com/2024/04/30/us/politics/trump-lawyers-delgado.html"
  },
  {
    "text": "Marjorie Taylor Greene says she's moving ahead with effort to oust Speaker Johnson  —  Her plan seems doomed to fail as Democrats said they would help save Johnson.  —  Marjorie Taylor Greene (2nd R) and Thomas Massie (R) hold a press conference outside the US Capitol in Washington, DC, on May 1, 2024.",
    "url": "https://abcnews.go.com/Politics/marjorie-taylor-greene-shes-moving-ahead-effort-oust/story?id=109802294"
  },
  {
    "text": "SCOTUS plays dumb as Trump claims sweeping immunity  —  PN is a reader-supported publication made possible by paid subscribers.  If you aren't one, please click the button to support our independent journalism.  —  ✍️ Subscribe to Public Notice ✍️",
    "url": "https://www.publicnotice.co/p/scotus-trump-immunity-arguments-explained"
  },
  {
    "text": "Trump: ‘Marco has this residency problem.’  —  DONALD TRUMP'S CAMPAIGN STAFF has assembled a dozen dossiers on possible running mates, but they largely remain unopened by the presidential candidate, who's conducting his own vetting process by asking friends, consultants, and insiders whom they think he should pick and why.",
    "url": "https://www.thebulwark.com/p/trump-vp-shortlist-marco-rubio"
  },
  {
    "text": "The Danger of a Small Act of Cowardice  —  The first time I photographed Gerald Ford, he was a day away from being nominated as vice president, after Spiro Agnew had resigned in disgrace.  The portrait I made ran on the cover of Time, a first for both of us.  Ford was my assignment, then he became my friend.",
    "url": "https://www.theatlantic.com/politics/archive/2024/05/gerald-ford-liz-cheney-award/678246/"
  },
  {
    "text": "Court tosses map that created second Black House district in Louisiana  —  The ruling, if it stands, could be a win for Republicans, since Democrats were almost certain to win the newly drawn district.  —  A panel of federal judges has tossed out Louisiana's new congressional map … ",
    "url": "https://www.politico.com/news/2024/04/30/louisiana-court-black-house-district-00155351"
  },
  {
    "text": "Multi-state E.coli outbreak connected to walnuts: CDC  —  The Centers for Disease Control and Prevention (CDC) warned on Tuesday of an E. coli outbreak linked to organic walnuts sold in bulk that has so far infected 12 people across the states of California and Washington.",
    "url": "https://thehill.com/homenews/administration/4635317-multi-state-e-coli-outbreak-connected-to-walnuts-cdc/"
  },
  {
    "text": "Trump Unleashes Bizarre ‘Word Salad’ Answer During Live Nighttime TV Interview  —  The former president left many confused with his rambling answer on Fox News.  —  LOADING  —  Donald Trump has people wondering just what he was trying to say during a rambling monologue on Fox News … ",
    "url": "https://www.huffpost.com/entry/donald-trump-word-salad_n_6631f693e4b0849b2edd8d91"
  },
  {
    "text": "Trump threatens to prosecute Bidens if he's re-elected unless he gets immunity  —  Time magazine called the ex-president's plans ‘an imperial presidency that would reshape America and its role in the world’  —  Donald Trump has warned that Joe Biden and his family could face multiple criminal … ",
    "url": "https://www.theguardian.com/us-news/2024/apr/30/trump-second-term-abortion-immigration"
  },
  {
    "text": "NEW: DHS Docs Show Top Cities Biden Admin Flew Migrants Under Controversial Program, 80% to Single State  —  Internal data obtained by Fox News via a House Homeland Security Committee subpoena to Secretary Alejandro Mayorkas' Department of Homeland Security (DHS) shows that thousands … ",
    "url": "https://redstate.com/brutalbrittany/2024/04/30/internal-dhs-docs-reveal-top-15-cities-biden-admin-flew-migrants-to-under-controversial-parole-program-n2173572"
  },
  {
    "text": "Historian says Trump lawyer “deliberatively misleading” SCOTUS: Ben Franklin “would be horrified”  —  Franklin's actual speech cited at immunity hearing “says exactly the opposite of what John Sauer was implying”  —  When Trump lawyer D. John Sauer spoke before the Supreme Court last week calling … ",
    "url": "https://www.salon.com/2024/04/30/historian-says-lawyer-deliberatively-misleading-scotus-ben-franklin-would-be-horrified/"
  },
  {
    "text": "Russia is trying to exploit America's divisions over the war in Gaza  —  The effort includes artificial intelligence, fake social media accounts and a spike in state-sponsored Russian propaganda.  —  Russia is seeking to exploit America's divisive debate over Israel's offensive in Gaza through overt … ",
    "url": "https://www.nbcnews.com/news/investigations/russia-trying-exploit-americas-divisions-war-gaza-rcna149759"
  },
  {
    "text": "White House considers admitting some Palestinians from Gaza as refugees  —  The Biden administration is considering admitting certain Palestinians to the U.S. as refugees, a report by CBS News found.  —  Senior officials in several U.S. agencies have discussed the idea of resettling Palestinians … ",
    "url": "https://thehill.com/homenews/administration/4634560-white-house-considers-admitting-some-palestinians-gaza-refugees/"
  },
  {
    "text": "Biden Clears $6 Billion in Debt for Closed Art School's Students  — Move will help 317,000 students who attended subpar colleges  — Biden looks to deliver student-debt relief ahead of election  —  President Joe Biden is forgiving $6.1 billion in student loans for more than 300,000 attendees … ",
    "url": "https://www.bloomberg.com/news/articles/2024-05-01/student-loan-forgiveness-biden-clears-6b-for-art-institutes-attendees"
  },
  {
    "text": "Israel-Hamas deal is only hope for Biden's Middle East strategy … “There just has to be a deal,” he said when asked about a plan B if negotiations aren't successful.  — “If we can get a ceasefire, we can get something more enduring and then maybe end the conflict and then maybe move forward … ",
    "url": "https://www.axios.com/2024/05/01/israel-hamas-ceasefire-hostage-deal-biden"
  },
  {
    "text": "Trump's trying to dismantle the Blue Wall again.  That would be disaster for Biden.  —  Biden's loss of support with younger voters and voters of color has helped make the Sun Belt swing states less competitive — and the “Blue Wall” Rust Belt states key to his reelection.",
    "url": "https://www.politico.com/news/2024/05/01/biden-blue-wall-00155364"
  },
  {
    "text": "Fox Business Host Goes There: Biden's ‘Woke’ Tax Policies Are Anti-White  —  QUIET PART OUT LOUD  —  Larry Kudlow on Tuesday made the assumption that Joe Biden's tax policies are part of a bigger scheme against conservatives.  —  Fox Business Network host and former Trump White House … ",
    "url": "https://www.thedailybeast.com/fox-business-host-larry-kudlow-labels-bidens-woke-tax-policies-as-anti-white"
  },
  {
    "text": "Will Looser Marijuana Rules Help Biden Move the Needle With Young Voters?  —  White House push is one of several election-year policy changes, including on climate and student debt, that could appeal to voters under age 30  —  WASHINGTON—President Biden's push to reclassify marijuana … ",
    "url": "https://www.wsj.com/politics/elections/will-looser-marijuana-rules-help-biden-move-the-needle-with-young-voters-c59463bb"
  },
  {
    "text": "‘Jeffrey Clark betrayed his oath’: Trump DOJ lawyer behind fake electors plot should be disbarred, disciplinary panel says  —  The District of Columbia's Office of Disciplinary Counsel issued a recommendation this week battering the credibility of former Donald Trump Justice Department attorney Jeffrey Clark … ",
    "url": "https://lawandcrime.com/high-profile/jeffrey-clark-betrayed-his-oath-trump-doj-lawyer-behind-fake-electors-plot-should-be-disbarred-disciplinary-panel-says/"
  }
]