[
  {
    "text": "1/3/25 ☀️ AM: … If you're new to Capitol Hill or Washington, subscribe to Punchbowl News.  —  Legislative business starts today at 11 a.m. with the closing of the 118th Congress.  The new Congress begins at noon with the quorum call and the vote to elect a speaker.",
    "url": "https://punchbowl.news/archive/1325-am/"
  },
  {
    "text": "House to vote on speaker as Mike Johnson hopes to keep gavel  —  House Speaker Mike Johnson (Louisiana) is seeking to shore up support among fellow Republicans for reelection to his post as the new Congress convenes Friday at noon Eastern time.  In his bid to keep the gavel … ",
    "url": "https://www.washingtonpost.com/politics/2025/01/03/house-speaker-vote-live-updates/"
  },
  {
    "text": "Trump Transition Live Updates: Speaker Johnson Faces Crucial Vote  —  Mike Johnson has President-elect Donald J. Trump's support to retain his role but only a razor-thin margin — and several Republican votes remain in question.  —  The House begins voting in hours.  Here's what to know.",
    "url": "https://www.nytimes.com/live/2025/01/03/us/house-speaker-vote-johnson-trump"
  },
  {
    "text": "FBI releases new video of a suspect planting a pipe bomb near DNC offices on eve of the Capitol riot  —  A harrowing chapter in American history remains shrouded in mystery: Who planted pipe bombs outside offices of the Democratic and Republican national committees in Washington on the eve of the attack on the Capitol?",
    "url": "https://apnews.com/article/capitol-riot-pipe-bombs-fbi-washington-ea85b6fe5fe9140f1c75b7ee8c0554b2"
  },
  {
    "text": "FBI seeking new leads on Jan. 6 pipe bomb suspect  —  The FBI is seeking new leads on the suspect who placed pipe bombs outside of the Republican and Democratic National Committee (DNC) headquarters in Washington, D.C., a day before the Jan. 6, 2021, attack on the Capitol.",
    "url": "https://thehill.com/policy/national-security/5065056-fbi-seeking-new-information-pipe-bomb-suspect/"
  },
  {
    "text": "Biden to announce decision on U.S. Steel acquisition as early as Friday  —  President Biden is likely to announce a decision as soon as Friday on whether he will approve Nippon Steel's $14.9 billion acquisition of U.S. Steel, according to people familiar with the process.",
    "url": "https://www.cbsnews.com/news/biden-to-announce-decision-us-steel-nippon-as-early-as-friday/"
  },
  {
    "text": "Biden decides to block U.S. Steel sale to Japanese buyer  —  Move comes after a year of political and economic drama.  It leaves the future of the once-iconic American business in doubt.",
    "url": "https://www.washingtonpost.com/business/2025/01/02/biden-blocks-nippon-us-steel-deal/"
  },
  {
    "text": "Net neutrality rules about corporate control over internet speeds blocked by federal appeals court  —  A federal appeals court on Thursday ruled that US regulators overstepped their authority by reinstating “net neutrality” rules governing internet service providers, dealing a blow to the Biden administration.",
    "url": "https://www.cbsnews.com/news/net-neutrality-rules-blocked-federal-appeals-court/"
  },
  {
    "text": "Statement from President Joe Biden  —  As I have said many times, steel production—and the steel workers who produce it—are the backbone of our nation.  A strong domestically owned and operated steel industry represents an essential national security priority and is critical for resilient supply chains.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2025/01/03/statement-from-president-joe-biden-13/"
  },
  {
    "text": "Judicial body won't refer Clarence Thomas to Justice Department over ethics lapses  —  The head of the Judicial Conference said there is legal uncertainty over whether it has the authority to refer complaints about Supreme Court justices.  —  A judicial organization that sets national policy … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/judicial-body-will-not-refer-clarence-thomas-justice-department-ethics-rcna186059"
  },
  {
    "text": "Cybertruck blast suspect was a ‘Rambo type’ who loved Trump, family says  —  Exclusive: Matthew Livelsberger's shocked uncle told The Independent that the Green Beret was a ‘supersoldier’  —  Your support helps us to tell the story  —  From reproductive rights to climate change to Big Tech … ",
    "url": "https://www.independent.co.uk/news/world/americas/cybertruck-explosion-suspect-matthew-livelsberger-vegas-b2672940.html"
  },
  {
    "text": "John Thune Takes Charge in the Senate, Ushering in a New Leadership Era  —  The affable traditional conservative from South Dakota is the first new chief of the Senate G.O.P. in nearly two decades.  He will confront a challenge managing President-elect Donald J. Trump's expectations.",
    "url": "https://www.nytimes.com/2025/01/03/us/politics/john-thune-senate-leadership.html"
  },
  {
    "text": "South Korea's Impeached President Fends Off Arrest Attempt Over Martial-Law Decree  —  Special investigators, warrant in hand, were blocked from detaining Yoon Suk Yeol during a six-hour standoff with Secret Service personnel  —  SEOUL—South Korean investigators failed to arrest … ",
    "url": "https://www.wsj.com/world/asia/south-koreas-impeached-president-fends-off-arrest-attempt-over-martial-law-decree-89ead876?st=af8E5M&reflink=mobilewebshare_permalink"
  },
  {
    "text": "Near midnight, Ohio Gov. DeWine signs bill into law to charge public for police video  —  COLUMBUS, Ohio — Ohio Gov. Mike DeWine has signed a controversial bill into law that could charge the public hundreds of dollars for footage from law enforcement agencies, including body cameras.",
    "url": "https://www.news5cleveland.com/news/politics/ohio-politics/near-midnight-ohio-gov-dewine-signs-bill-into-law-to-charge-public-for-police-video"
  },
  {
    "text": "Surgeon General Calls for Cancer Warnings on Alcohol  —  Dr. Vivek Murthy's report cites studies linking alcoholic beverages to at least seven malignancies, including breast cancer.  But to add warning labels, Congress would have to act.  —  Alcohol is a leading preventable cause of cancer … ",
    "url": "https://www.nytimes.com/2025/01/03/health/alcohol-surgeon-general-warning.html"
  },
  {
    "text": "Eyeing Potential Bird Flu Outbreak, Biden Administration Ramps Up Preparedness  —  The administration is committing an additional $306 million toward battling the virus, and will distribute the money before President-elect Donald J. Trump takes office.  —  The Biden administration … ",
    "url": "https://www.nytimes.com/2025/01/02/us/politics/bird-flu-biden-trump.html?unlocked_article_code=1.mU4.lah7.Rd_HYV51N3XR&smid=url-share"
  },
  {
    "text": "Elon Musk and the right's war on Wikipedia  —  Listen to me read this post here (not an AI-generated voice!), subscribe to the feed in your podcast app, or download the recording for later.  —  When Elon Musk launched his latest crusade against Wikipedia this Christmas Eve … ",
    "url": "https://www.citationneeded.news/elon-musk-and-the-rights-war-on-wikipedia/"
  },
  {
    "text": "The New Orleans attack shows that ISIS hasn't gone away.  It's changed.  —  The deadly attack in New Orleans on New Year's Eve that left 15 people dead feels like a disturbing reminder of a past era, one when the transnational terrorist organization known as the Islamic State, or ISIS, dominated the nation's attention and resources.",
    "url": "https://www.vox.com/world-politics/393110/new-orleans-isis-jabbar"
  },
  {
    "text": "Jimmy Carter's anti-corruption legacy is being desecrated  —  The contrast with Trump reflects how far our standards have fallen.  —  There are many obvious differences between the late Jimmy Carter and Donald Trump, but perhaps the most jarring is how they managed their family business when they were elected president.",
    "url": "https://www.publicnotice.co/p/jimmy-carter-trump-anti-corruption-legacy"
  }
]