[
  {
    "text": "Inside Biden's obsession with “Morning Joe”  —  When White House aides appear on MSNBC's “Morning Joe,” they're often booked between 7 and 7:40 a.m. ET.  That's so they'll reach one crucial and loyal viewer: President Biden. … - During the day, Biden has long asked his staff whether they saw a story … ",
    "url": "https://www.axios.com/2024/02/02/biden-obsession-morning-joe-msnbc-media"
  },
  {
    "text": "What Biden *really* says about Trump behind closed doors  —  Welcome to POLITICO's West Wing Playbook, your guide to the people and power centers in the Biden administration.  With help from producer Raymond Rapada.  —  President JOE BIDEN has a reputation for salty language behind closed doors.",
    "url": "https://www.politico.com/newsletters/west-wing-playbook/2024/02/01/what-biden-really-says-about-trump-behind-closed-doors-00139178"
  },
  {
    "text": "Republicans in Congress are bending to Trump's demands.  Some are frustrated.  —  Republicans are increasingly sensitive to Trump's viewpoints and conscious of his power to upend bills that Joe Biden might be able to tout on the campaign trail.  —  Before Jason Smith moved … ",
    "url": "https://www.politico.com/news/2024/02/02/trump-congressional-republicans-influence-00139061"
  },
  {
    "text": "U.S. Voters: Biden, Most in House Don't Deserve Another Term  —  WASHINGTON, D.C. — Fewer than four in 10 U.S. registered voters say President Joe Biden deserves to be reelected, while less than a quarter say the same about most members of the U.S. House.  As is almost always the case … ",
    "url": "https://news.gallup.com/poll/609602/voters-biden-house-don-deserve-term.aspx"
  },
  {
    "text": "Behind the Curtain: Trump's conviction scenario  —  Former President Trump is breezing to the GOP nomination — but, in private, is bracing for the genuine possibility that he'll be the first convicted felon in U.S. history to represent a major party.",
    "url": "https://www.axios.com/2024/02/02/trump-conviction-trial-jan-6-court"
  },
  {
    "text": "Trump Is Inching Closer to the Worst Legal Defeat of his Life  —  It sure looks like Trump's business empire is about to get hammered.  —  Former President Donald Trump has suffered through plenty of painful courtroom defeats during his lengthy career as one of America's most litigious businessmen.",
    "url": "https://www.vice.com/en/article/g5yn8x/trump-is-inching-closer-to-the-worst-legal-defeat-of-his-life"
  },
  {
    "text": "Trump D.C. trial drops off court's March calendar, clearing way for N.Y. case  —  Administrative move comes as anticipation mounts over how — and when — an appeals court will decide former president's claim of immunity from criminal prosecution  —  Former president Donald Trump's March 4 trial date … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2024/02/01/trump-trial-calendar-jan-6-delay/"
  },
  {
    "text": "Roberta Kaplan says Trump threw papers across table at Mar-a-Lago deposition because his legal team agreed to feed her lunch  —  Attorney Roberta Kaplan said former President Donald Trump threw papers across a table and stormed off during a deposition at Mar-a-Lago after learning that his legal team had agreed to provide her lunch.",
    "url": "https://www.cnn.com/2024/02/01/politics/roberta-kaplan-donald-trump-deposition-maralago/"
  },
  {
    "text": "He Was Accused of Sexual Misconduct.  Then Trump Hired Him.  Then He Was Indicted in Mar-a-Lago Case.  —  Trump body man Walt Nauta is a critical figure in the Mar-a-Lago documents case.  Trump only hired him after Nauta was dismissed from the White House after sexual harassment claims.",
    "url": "https://www.thedailybeast.com/walt-nauta-was-accused-of-sexual-misconduct-then-trump-hired-him-then-he-was-indicted-in-mar-a-lago-case"
  },
  {
    "text": "Special counsel questioned witnesses about 2 rooms FBI didn't search inside Trump's Mar-a-Lago residence: Sources  —  The FBI missed the rooms in their search for classified documents, said sources.  —  In this June 9, 2017, file photo, President Donald Trump is shown at the White House in Washington, D.C.",
    "url": "https://abcnews.go.com/US/special-counsel-questioned-witnesses-2-rooms-fbi-search/story?id=106826552"
  },
  {
    "text": "House Judiciary Committee subpoenas Fulton County District Attorney Fani Willis  —  Fulton County District Attorney Fani Willis has been subpoenaed by House Judiciary Committee Chairman Jim Jordan to produce documents related to the use and spending of federal funds, according to copy of the subpoena obtained by CNN.",
    "url": "https://www.cnn.com/2024/02/02/politics/gop-committee-subpoena-fani-willis/"
  },
  {
    "text": "New report points to blockbuster U.S. job growth as 2024 begins  —  By every metric, the latest jobs report points to an incredibly strong U.S. job market.  The political implications have the potential to be dramatic.  —  Expectations heading into this morning showed projections … ",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/new-report-points-blockbuster-us-job-growth-2023-begins-rcna136921"
  },
  {
    "text": "U.S. economy added 353,000 jobs in January, much better than expected  — Nonfarm payrolls expanded by 353,000 for the month, better than the Dow Jones estimate for 185,000.  The unemployment rate held at 3.7%, against the estimate for 3.8%.  — Average hourly earnings increased 0.6%, double the monthly estimate.",
    "url": "https://www.cnbc.com/2024/02/02/us-economy-added-353000-jobs-in-january-much-better-than-expected.html"
  },
  {
    "text": "The toll of legal fees on Trump's 2024 campaign, in context  —  The 2024 general election has only just begun, and Donald Trump looks prepared to sail to yet more GOP nominating contest victories in Nevada and South Carolina in the weeks to come.  —  But the campaign for the White House … ",
    "url": "https://www.washingtonpost.com/politics/2024/02/01/toll-legal-fees-trumps-2024-campaign-context/"
  },
  {
    "text": "Inflation has fallen.  Why are groceries still so expensive?  —  Ongoing supply chain disruptions, droughts, avian flu, labor shortage and more continue to keep grocery prices high  —  Americans are finally getting a break from inflation, with prices for gasoline, used cars and health insurance … ",
    "url": "https://www.washingtonpost.com/business/2024/02/02/grocery-price-inflation-biden/"
  },
  {
    "text": "Andy Kim leads Tammy Murphy by double digits in NJ Senate race, poll says  —  The race to replace Bob Menendez is a test of the Garden State's unique party boss system.  —  Rep. Andy Kim is the leading candidate for Senate in New Jersey, with a double-digit lead over his chief rival … ",
    "url": "https://www.politico.com/news/2024/02/02/poll-andy-kim-tammy-murphy-00139064"
  },
  {
    "text": "Eagerly awaited redistricting reports that will reshape Wisconsin Legislature are due  —  MADISON, Wis. (AP) — Consultants hired by the Wisconsin Supreme Court to examine maps redrawing state legislative districts said Thursday that plans submitted by the Republican Legislature … ",
    "url": "https://apnews.com/article/wisconsin-redistricting-legislature-5bc5c0347b26a40fd615f4faf7583b46"
  }
]