[
  {
    "text": "Kamala Harris' Support Among Republicans Almost Doubles: NYT-Siena Poll  —  in November has nearly doubled over the past month according to a major new survey from  —  .  —  It found nine percent of likely voters who describe themselves as  —  plan to back the Democratic candidate in November … ",
    "url": "https://www.newsweek.com/kamala-harris-support-among-republicans-almost-doubles-nyt-siena-poll-1965611"
  },
  {
    "text": "More Americans Identify as Republican Than Democrat.  Here's What That Means for the Election.  —  Rare GOP advantage takes pressure off Trump to win over independent voters  —  Beneath the headline results in many polls, something unusual has turned up with big implications for politics … ",
    "url": "https://www.wsj.com/politics/elections/more-americans-identify-as-republican-than-democrat-heres-what-that-means-for-the-election-150e12ae"
  },
  {
    "text": "Inside the Battle for America's Most Consequential Battleground State  —  Kamala Harris and Donald Trump are pouring more money, time and energy into Pennsylvania than anywhere else, waging an ad war as they crisscross the state.  —  When Vice President Kamala Harris rolled out her economic agenda, she went to Pittsburgh.",
    "url": "https://www.nytimes.com/2024/10/09/us/politics/trump-harris-pennsylvania-battleground.html"
  },
  {
    "text": "Romney Won't Endorse Harris, Saying He Wants to Keep His Voice in the Party  —  Senator Mitt Romney of Utah, the 2012 Republican nominee for president, says the party may need to be rebuilt.  —  Senator Mitt Romney, the retiring Republican from Utah and onetime standard-bearer of a party … ",
    "url": "https://www.nytimes.com/2024/10/08/us/politics/mitt-romney-trump-harris.html"
  },
  {
    "text": "Trump Lashes Out After Damning Report on His Close Ties to Putin  —  Donald Trump's campaign team is lashing out against a journalist following news that the former president secretly kept in touch with Russian President Vladimir Putin after leaving the Oval Office.",
    "url": "https://newrepublic.com/post/186915/trump-team-reaction-woodward-report-close-ties-putin"
  },
  {
    "text": "Elon Musk is piling onto all the hurricane disinformation, hampering relief efforts  —  The billionaire is using the power of his social media platform to spread falsehoods that officials say are hampering recovery efforts.  —  Elon Musk is using his social media network … ",
    "url": "https://www.politico.com/news/2024/10/08/elon-musk-hurricane-disinformation-trump-00182769"
  },
  {
    "text": "Scoop: Senate Democrats go to war over GOP ad spending loophole … - The FEC will decide this week if one GOP strategy can keep going, with a vote expected Thursday.  — People who closely follow the commission tell Axios the expectation is for the vote to split along party lines … ",
    "url": "https://www.axios.com/2024/10/09/senate-democrats-republicans-campaign-finance-ads"
  },
  {
    "text": "Expansive Senate map tightens in 2024 home stretch  —  “The Senate map could have gone much worse,” one Democrat said.  —  The U.S. Capitol seen on April 29, 2021, in Washington, DC.  —  Heading into the 2024 cycle, Republicans saw a Senate map offering flip opportunities in eight red … ",
    "url": "https://abcnews.go.com/Politics/expansive-senate-map-tightens-2024-home-stretch/story?id=114605036"
  },
  {
    "text": "Elon Musk Is Now Seizing Other People's Twitter Accounts To Promote Donald Trump  —  How quickly do you think we'd be having Congressional hearings about “election interference” if Mark Zuckerberg so much as posted a “Harris/Walz” lawn sign in front of his house?",
    "url": "https://www.techdirt.com/2024/10/08/elon-musk-is-now-seizing-other-peoples-twitter-accounts-to-promote-donald-trump/"
  },
  {
    "text": "Walz says the Electoral College ‘needs to go’  —  The Minnesota governor hasn't been shy about his support for making the popular vote king.  —  Gov. Tim Walz made a new push for booting the Electoral College in favor of a national popular vote, as Democrats are again wary of a scenario … ",
    "url": "https://www.politico.com/news/2024/10/08/walz-says-the-electoral-college-needs-to-go-00182981"
  },
  {
    "text": "FBI arrests Afghan man who officials say planned Election Day attack in the US  —  The FBI has arrested an Afghan man who officials say was inspired by the Islamic State militant organization and was plotting an Election Day attack targeting large crowds in the U.S., the Justice Department said Tuesday.",
    "url": "https://apnews.com/article/fbi-afghanistan-justice-department-election-2e13aac1b28342be32513eaf58212ada"
  },
  {
    "text": "Trump Holds Up Transition Process, Skirting Ethics and Fund-Raising Rules  —  Donald J. Trump has so far opted out of the official planning for a government handover, a move that allows him to avoid disclosing his donors to his transition effort.  —  Less than a month before Election Day … ",
    "url": "https://www.nytimes.com/2024/10/09/us/politics/trump-presidential-transition.html"
  },
  {
    "text": "Ethel Kennedy, widow of Robert F. Kennedy, hospitalized after suffering stroke, family says  —  Ethel Kennedy, a social justice advocate and the widow of late U.S. Attorney General Robert F. Kennedy, is recovering in a hospital after suffering a stroke last week, her grandson said in a statement.",
    "url": "https://thehill.com/homenews/media/4923264-ethel-kennedy-hospitalized-suffering-stroke/"
  },
  {
    "text": "Whitehouse Unveils Report Examining Failures of Supplemental Background Investigation of Justice Brett Kavanaugh  —  New report details how the Trump White House restricted FBI investigators and lied to the American people about the investigation and tip line.",
    "url": "https://www.whitehouse.senate.gov/news/release/whitehouse-unveils-report-examining-failures-of-supplemental-background-investigation-of-justice-brett-kavanaugh/"
  },
  {
    "text": "‘Eternally sorry’: Journalist confesses his biggest error in covering ‘buffoon’ Trump  —  Former President Donald Trump's behavior has been enabled by a mainstream press that “never took him seriously,” Lucian Truscott wrote for Salon on Tuesday in a damning indictment of the media's enabling … ",
    "url": "https://www.rawstory.com/donald-trump-normalized/"
  },
  {
    "text": "Florida Meteorologist Explains Why He Broke Down During Hurricane Report  —  ‘I HAVE CHANGED’  —  NBC's John Morales, who has been covering storms for more than three decades, said that global warming has changed him.  —  South Florida NBC meteorologist John Morales explained … ",
    "url": "https://www.thedailybeast.com/florida-meteorologist-explains-why-he-broke-down-during-hurricane-milton-report"
  },
  {
    "text": "As a hurricane threatens, White House helps Americans text-to-find shelter  —  Good evening from Washington, where I'm digesting another good fall day spent at Howard University participating in the third Democracy Summit convened by the Center for Journalism and Democracy.",
    "url": "https://civic-texts.ghost.io/as-a-hurricane-threatens-white-house-helps-americans-text-to-find-shelter/"
  },
  {
    "text": "‘60 Minutes’ Has Some Explaining to Do After Eye-Opening Edit Discovered on a Kamala Harris Word Salad  —  We wrote earlier about how the much-anticipated “60 Minutes” interview with Vice President Kamala Harris didn't do her any favors considering it a) further proved points her critics … ",
    "url": "https://redstate.com/sister-toldjah/2024/10/08/60-minutes-edits-to-kamala-harris-word-salad-n2180320"
  },
  {
    "text": "Vance and Walz press corps revive a tradition on their campaign planes  —  Candidates answered questions rolled up the aisle to them on an orange.  —  US Senator and Republican vice presidential candidate J.D. Vance (L) and Minnesota Governor and Democratic vice presidential candidate Tim Walz shake hands … ",
    "url": "https://abcnews.go.com/Politics/vance-walz-press-corps-revive-tradition-campaign-planes/story?id=114624028"
  },
  {
    "text": "The latest union snub for Harris and Walz underscores a bigger problem for their campaign  —  Even with a union member on the presidential ticket, Democrats are struggling to hold back a changing cultural tide.  —  It was a viral moment for a campaign that needed one: A chorus … ",
    "url": "https://www.politico.com/news/2024/10/08/tim-walz-union-snubs-00182961"
  },
  {
    "text": "Expert: Analysis shows Trump tax plan “taking money” from bottom 95% and “giving it” to richest 5%  —  “This is an enormously redistributive tax plan from low- and middle-income families to the wealthiest Americans”  —  Former President Donald Trump's proposed tax plan would create tax cuts … ",
    "url": "https://www.salon.com/2024/10/08/expert-analysis-shows-plan-taking-money-from-bottom-95-and-giving-it-to-richest-5/"
  },
  {
    "text": "What Will Happen If Trump Wins the 2024 Election?  —  And why it matters in 2024. … Former President Donald Trump has threatened a campaign of retribution if he returns to the White House, signaling that he will seek to prosecute rivals and enemies while stocking a second administration with loyalists who will carry out his wishes.",
    "url": "https://www.nytimes.com/2024/10/08/us/politics/trump-2024-election-democracy.html"
  },
  {
    "text": "Rashid Khalidi, America's foremost scholar of Palestine, is retiring: 'I don't want to be a cog in the machine any more'  —  As the Columbia University professor steps down, he addresses student protests, links between Ireland and Palestine and how ‘higher education has developed into a hedge fund’",
    "url": "https://www.theguardian.com/world/ng-interactive/2024/oct/08/rashid-khalidi-palestine-israel-scholar-columbia-university-retires"
  },
  {
    "text": "I'm Behind the Trump-Russia Dossier.  We Gave the FBI More Than People Know  —  My wife Katherine called me up to the bedroom and told me that BuzzFeed had published our memos: The so-called “dossier” on  —  .  —  It was the night of January 10, 2017.  The publication of the news story … ",
    "url": "https://www.newsweek.com/christopher-steele-trump-russia-putin-election-dossier-fbi-1963717"
  }
]