[
  {
    "text": "Shocked by Trump, Zelensky and Ukraine Try to Forge a Path Forward  —  After President Trump's rebukes, President Volodymyr Zelensky tried to repair the relationship with his counterpart while also reaching out to European allies.  —  For months leading into the American elections last fall … ",
    "url": "https://www.nytimes.com/2025/03/01/world/europe/trump-zelensky-us-ukraine-russia-meeting.html"
  },
  {
    "text": "Europe Races to Repair a Split Between the U.S. and Ukraine  —  European leaders pledge to assemble a “coalition of the willing” to develop a plan for ending Ukraine's war with Russia, which they hope could win the backing of a skeptical President Trump.  —  European leaders scrambled … ",
    "url": "https://www.nytimes.com/2025/03/02/world/europe/starmer-zelensky-meeting-europe-ukraine-trump.html"
  },
  {
    "text": "Judge rules Trump's firing of federal workforce watchdog was illegal  —  Decision reinstating special counsel sets up executive power fight that Supreme Court is likely to resolve  —  A federal judge ruled Saturday that President Donald Trump's firing of a federal workforce watchdog was illegal … ",
    "url": "https://www.politico.com/news/2025/03/01/judge-rules-trumps-firing-of-federal-workforce-watchdog-was-illegal-00206877"
  },
  {
    "text": "FAA Officials Ordered Staff to Find Funding for Elon Musk's Starlink  —  The Federal Aviation Administration directed staff to locate tens of millions of dollars for a Starlink deal, sources tell Rolling Stone … However, on Friday, FAA officials ordered staff to begin finding tens of millions … ",
    "url": "https://www.rollingstone.com/politics/politics-features/elon-musk-starlink-faa-officials-find-funding-1235285246/"
  },
  {
    "text": "A letter to the American People:  —  For over 11 years, 18F has been proudly serving you to make government technology work better.  We are non-partisan civil servants.  18F has worked on hundreds of projects, all designed to make government technology not just efficient but effective, and to save money for American taxpayers.",
    "url": "https://18f.org/"
  },
  {
    "text": "As JD Vance takes ski weekend in Vermont, protesters give him the cold shoulder  —  Anger over Oval Office dispute with Ukrainian President Volodymyr Zelensky draws demonstrators  —  WARREN, Vt. — Fresh powder covered the mountains at Sugarbush Resort on Saturday morning … ",
    "url": "https://www.bostonglobe.com/2025/03/01/metro/jd-vance-vermont-visit-sugarbush-resort/"
  },
  {
    "text": "The Trump Administration Said These Aid Programs Saved Lives.  It Canceled Them Anyway.  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up to receive our biggest stories as soon as they're published.  —  After the Trump administration moved to freeze nearly $60 billion … ",
    "url": "https://www.propublica.org/article/trump-usaid-rubio-marocco-canceled-programs-gaza-syria-congo-hiv-ebola"
  },
  {
    "text": "Anti-DOGE protests at Tesla stores target Elon Musk's bottom line  —  Demonstrators gathered outside Tesla stores across the U.S. Saturday to protest the automaker's billionaire CEO, Elon Musk, and his push to slash government spending on behalf of President Donald Trump.",
    "url": "https://apnews.com/article/elon-musk-tesla-protests-doge-3b3eba9313074ccf8e959a92486d900f"
  },
  {
    "text": "Norwegian fuel supplier refuses U.S. warships over Ukraine  —  Norwegian fuel company Haltbakk Bunkers has announced it will cease supplying fuel to U.S. military forces in Norway and American ships docking in Norwegian ports, citing dissatisfaction with recent U.S. policy towards Ukraine.",
    "url": "https://ukdefencejournal.org.uk/norwegian-fuel-supplier-refuses-u-s-warships-over-ukraine/"
  },
  {
    "text": "DOGE Claims Credit for Killing Contracts That Were Already Dead  —  Elon Musk's group claimed credit for canceling procurement agreements that had been completed years earlier, the latest in a string of public errors on its site.  —  While George W. Bush was president … ",
    "url": "https://www.nytimes.com/2025/03/02/us/politics/doge-musk-contracts-errors.html"
  },
  {
    "text": "Elon Musk Calls Social Security ‘The Biggest Ponzi Scheme Of All Time’  —  The tech billionaire argued Friday on “The Joe Rogan Experience” podcast that one of America's most enduring social safety nets is an insidious ploy.  —  Elon Musk is calling Social Security a “Ponzi scheme,” … ",
    "url": "https://www.huffpost.com/entry/elon-musk-social-security-ponzi-scheme_n_67c337cce4b049364f4586a3"
  },
  {
    "text": "Fresh Musk emails to workers lead to renewed pushback at federal agencies  —  A new directive to workers ordering them to justify their employment weekly is still being met with resistance at the highest levels.  —  Elon Musk is trying again on his demand that every federal worker justify their employment weekly.",
    "url": "https://www.washingtonpost.com/politics/2025/03/01/second-elon-musk-doge-federal-workers-email/"
  },
  {
    "text": "Israel cuts off Gaza aid to pressure Hamas to accept new ceasefire proposal  —  Israel stopped the entry of all goods and supplies into the Gaza Strip on Sunday and warned of “additional consequences” if Hamas doesn't accept a new proposal to extend a fragile ceasefire.",
    "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-ceasefire-hostages-03-02-2025-99402570996dcf33239d0492d99909e4"
  },
  {
    "text": "Putin ally pushes deal to restart Nord Stream 2 with US backing  —  Ex-spy Warnig's plan to involve American investors shows breadth of Trump's rapprochement with Russian president  —  A former spy and close friend of Vladimir Putin has been engineering a restart of Russia's Nord Stream 2 gas pipeline … ",
    "url": "https://www.ft.com/content/dc9c51ab-03cb-47ba-ad0a-09c4deed9b50"
  },
  {
    "text": "Congressman faces Trump and DOGE critics  —  About two dozen demonstrators greeted 3rd District Congressman Keith Self at a town hall in the Collin College Conference Center in Wylie.  —  “Do your job!” chanted the crowd carrying signs including “Dump Musk,” Russia is Not Our Ally,\" … ",
    "url": "https://princetonherald.com/2025/03/01/congressman-faces-trump-and-doge-critics/"
  },
  {
    "text": "$75 million was awarded to plant trees in places that badly need them.  In anti-DEI push, that's over  —  Arthur Johnson has lived in New Orleans' Lower 9th Ward for nearly three decades, long enough to appreciate the trees that filter pollution from the big ships traveling the nearby Mississippi River … ",
    "url": "https://apnews.com/article/trees-arbor-day-grants-cut-trump-heat-shade-environmental-justice-5909d4f102ac0de9cc5be313b4fbd399"
  },
  {
    "text": "Taking shots at vaccines has deadly consequences  —  Public health authorities reported on Feb. 21 that an ongoing measles outbreak in Gaines County, Texas and Lea County, New Mexico was already the largest in decades.  Of the 90 cases in Gaines County, 26 involved toddlers under four years of age … ",
    "url": "https://thehill.com/opinion/healthcare/5170157-taking-shots-at-vaccines-has-deadly-consequences/"
  },
  {
    "text": "Designating English as the Official Language of The United States  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:  —  Section 1.  Purpose and Policy.  From the founding of our Republic, English has been used as our national language.",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/03/designating-english-as-the-official-language-of-the-united-states/"
  },
  {
    "text": "Russia celebrates US foreign policy that now ‘coincides’ with Moscow's worldview  —  Moscow hopes to take advantage of a growing rift between the U.S. and Ukraine, and Europe more broadly.  —  The Kremlin on Sunday cheered the shift in U.S. foreign policy under President Donald Trump … ",
    "url": "https://www.politico.eu/article/russia-celebrates-united-states-foreign-policy-coinciding-moscow-ukraine/"
  }
]