[
  {
    "text": "Defense and prosecutors wrap arguments in Trump immunity appeal - live  —  If the judges rule in favor of Trump, it could lead to the dropping of the criminal charges brought by special counsel Jack Smith  —  Defense and prosecutors wrap up arguments in Trump immunity appeal",
    "url": "https://www.theguardian.com/us-news/live/2024/jan/09/trump-immunity-hearing-jan-6-case-dc-politics-latest-updates"
  },
  {
    "text": "5 ways the Supreme Court may try to defuse its newest Trump bomb  —  As the justices confront a historic case with enormous political stakes, they might seek a narrow way out.  —  After years of dodging Donald Trump-related questions, the Supreme Court is now facing the most consequential one of all … ",
    "url": "https://www.politico.com/news/2024/01/08/trump-supreme-court-ballot-insurrection-offramps-00134364"
  },
  {
    "text": "Georgia court weighs voting machines at heart of Trump election fraud claims  —  A Georgia trial will cast a spotlight on the security of the state's voting machines, which have long come under attack by the former president and his allies.  —  A federal court will begin hearing arguments Tuesday … ",
    "url": "https://www.politico.com/news/2024/01/09/georgia-court-voting-machines-trump-election-fraud-00134420"
  },
  {
    "text": "Trump's Claim of Immunity Reaches Appeals Court  —  Judges Seem Skeptical of Trump's Claim of Immunity  —  Judges heard from a lawyer for Donald J. Trump who argued that a president could face criminal charges only if impeached and convicted first, even if the case involved the assassination of a political rival.",
    "url": "https://www.nytimes.com/live/2024/01/09/us/trump-immunity-hearing"
  },
  {
    "text": "Trump trades Iowa rallies for day in court in preview of campaign to come  —  Republican polling leader Donald Trump returned Tuesday to the federal courthouse in Washington where he was arraigned in August on charges of interfering with the 2020 election results, making a voluntary appearance just before the Iowa caucuses.",
    "url": "https://www.washingtonpost.com/politics/2024/01/09/trump-courtroom-campaign-president-iowa/"
  },
  {
    "text": "CNN Poll: Haley trims Trump's lead to single digits in New Hampshire  —  Former South Carolina Gov. Nikki Haley has trimmed former President Donald Trump's lead in the Republican primary race in New Hampshire to single digits, according to a new CNN Poll conducted by the University of New Hampshire.",
    "url": "https://www.cnn.com/2024/01/09/politics/cnn-new-hampshire-poll/"
  },
  {
    "text": "Ramaswamy's campaign shows signs of unraveling  —  Vivek Ramaswamy won't be on the Illinois GOP primary ballot, some of his campaign staffers have begun looking for work elsewhere, and he hasn't qualified for Wednesday's final televised debate before Iowa's caucuses.",
    "url": "https://www.axios.com/2024/01/09/ramaswamy-campaign-signs-unraveling-2024"
  },
  {
    "text": "The Nikki Haley surge in New Hampshire may have peaked, Globe poll finds  —  Former South Carolina governor Nikki Haley's rise in New Hampshire in the past two months has been real and has injected new energy into what has been largely a sleepy race for the Republican presidential nomination dominated by former president Donald Trump.",
    "url": "https://www.bostonglobe.com/2024/01/09/nation/nikki-haley-new-hampshire/"
  },
  {
    "text": "BREAKING: Filing alleges ‘improper’ relationship between Fulton DA, top Trump prosecutor  —  Fani Willis hired alleged romantic partner as special prosecutor, court motion says  —  District Attorney Fani Willis improperly hired an alleged romantic partner to prosecute Donald Trump … ",
    "url": "https://www.ajc.com/politics/breaking-filing-alleges-improper-relationship-between-fulton-da-top-trump-prosecutor/A2N2OWCM7FFWJBQH2ORAK2BKMQ/"
  },
  {
    "text": "Hoyer to run for reelection, ending retirement speculation  —  Democratic Rep. Steny Hoyer (D-Md.) will run for reelection this year, ending speculation over a potential retirement for the Capitol Hill veteran.  —  In a statement on Monday, Hoyer pointed to the “partisanship,” “polarization” … ",
    "url": "https://thehill.com/homenews/campaign/4397164-hoyer-house-reelection-bid-2024/"
  },
  {
    "text": "Sprawling storm wallops US with tornado reports, damage and heavy snow, closing roads and schools  —  Winter weather may dampen turnout for 2024 Iowa caucuses  —  A sprawling winter storm hit the South with strong thunderstorms and tornado warnings that blew roofs off homes and tossed … ",
    "url": "https://apnews.com/article/midwest-snowstorm-effects-linger-tuesday-1e8f125fa357c014c6761acddb00cae0"
  },
  {
    "text": "The fleecing of America's hourly workers  —  More than 200,000 workers across the country are owed $163.3 million in back pay, according to a website maintained by the Department of Labor (DOL).  This is money companies have paid after they were found liable for wage theft violations … ",
    "url": "https://popular.info/p/the-fleecing-of-americas-hourly-workers"
  },
  {
    "text": "Aiming to retake House, DCCC invests $35 million to mobilize voters of color  —  The Democratic Congressional Campaign Committee will invest millions of dollars in an initiative that aims to engage with and persuade voters of color to support Democratic candidates as part of its effort to take back the House majority in November.",
    "url": "https://www.washingtonpost.com/politics/2024/01/09/dccc-minority-voters-initiative/"
  },
  {
    "text": "South Korea passes law banning dog meat trade  —  The slaughter and sale of dogs for their meat is to become illegal in South Korea after MPs backed a new law.  —  The legislation, set to come into force by 2027, aims to end the centuries-old practice of humans eating dog meat.",
    "url": "https://www.bbc.com/news/world-asia-67920167"
  },
  {
    "text": "Exclusive: Roger Stone Spoke With Cop Pal About Assassinating Eric Swalwell and Jerry Nadler  —  Weeks before the 2020 presidential election, infamous political operative Roger Stone sat across from his associate Sal Greco at a restaurant in Florida.  —  At the time, Greco was an NYPD cop working security for Stone on the side.",
    "url": "https://www.mediaite.com/politics/exclusive-roger-stone-spoke-with-cop-pal-about-assassinating-eric-swalwell-and-jerry-nadler/"
  },
  {
    "text": "Russia detains U.S. citizen on drugs charges  —  A Russian court said on Tuesday that a U.S. citizen had been detained on drugs charges which can carry up to 20 years in prison.  —  Moscow's Ostankino District Court said that on Jan. 6 Robert Romanov Woodland had been remanded … ",
    "url": "https://www.reuters.com/world/europe/russia-orders-us-citizen-detained-drugs-charges-2024-01-09/"
  },
  {
    "text": "Special counsel Jack Smith was targeted by attempted swatting on Christmas Day  —  Police were dispatched toward Smith's residence but were called off when they learned it was a false alarm and that everyone inside the home was safe.  —  Special counsel Jack Smith, who is overseeing … ",
    "url": "https://www.nbcnews.com/politics/politics-news/special-counsel-jack-smith-was-targeted-attempted-swatting-christmas-d-rcna132964"
  },
  {
    "text": "Judge Judy endorses Nikki Haley in 2024 presidential election  —  Famed television court personality “Judge” Judy Sheindlin endorsed 2024 presidential hopeful Nikki Haley in the GOP primary Monday, calling the former South Carolina governor “whip smart.”  —  “She is principled … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/01/09/judge-judy-endorses-nikki-haley-2024-presidential-election/72161100007/"
  },
  {
    "text": "Court serves defeat to Biden's dishwasher police  —  A federal court on Monday declared that President Joe Biden's team went too far in imposing new water and energy regulations on the two machines that make life easier, dishwashers and washing machines.  —  In ruling against Biden … ",
    "url": "https://www.washingtonexaminer.com/news/washington-secrets/2790065/court-serves-defeat-to-bidens-dishwasher-police/"
  },
  {
    "text": "As Penn and Harvard presidents fall, let's seize the full opportunity to reform education  —  The mighty can fall.  We have witnessed this reality recently.  Two presidents of elite universities have been driven from office: first Elizabeth Magill of Penn and then Claudine Gay of Harvard.",
    "url": "https://www.washingtonexaminer.com/opinion/2789750/as-penn-and-harvard-presidents-fall-lets-seize-the-full-opportunity-to-reform-education/"
  }
]