[
  {
    "text": "The Situation: The Cult of Unqualified Authenticity  —  On Pete Hegseth and the first hearing for a Trump nominee for a major cabinet position  —  Meet The Authors  —  Published by The Lawfare Institute in Cooperation With  —  The Situation on Friday reflected on the sentencing of Donald Trump in New York.",
    "url": "https://www.lawfaremedia.org/article/the-situation--the-cult-of-unqualified-authenticity"
  },
  {
    "text": "Pete Hegseth seems open to ordering soldiers to shoot protesters  —  Trump's pick to lead the Defense Department indicates he would be willing to do what Mark Esper refused to do.  —  Soon after the 2020 election, as President Donald Trump was gearing up his efforts to retain power despite his loss … ",
    "url": "https://www.washingtonpost.com/politics/2025/01/14/hegseth-seems-open-to-ordering-protesters-shot/"
  },
  {
    "text": "Joni Ernst says she'll vote to confirm Pete Hegseth  —  Pete Hegseth has won over Sen. Joni Ernst.  The Iowa senator said Tuesday she will be voting to confirm Hegseth to the next Defense secretary, a crucial endorsement for a nomination that seemed to be on shaky ground a few weeks ago.",
    "url": "https://www.politico.com/live-updates/2025/01/14/congress/ernst-says-shes-a-yes-on-hegseth-00198297"
  },
  {
    "text": "SEC Sues Musk Over Securities Violation in Federal Court  —  The Securities and Exchange Commission sued Elon Musk in federal court over an alleged securities violation, according to a court docket.  —  The agency claimed Musk failed to timely disclose a major purchase of Twitter Inc. shares ahead … ",
    "url": "https://www.bloomberg.com/news/articles/2025-01-14/sec-sues-elon-musk-over-securities-violation-in-federal-court"
  },
  {
    "text": "Search SEC.gov & EDGAR  —  Securities and Exchange Commission v. Elon Musk, No. 1:25-cv-00105 (D.D.C. filed Jan. 14, 2025)  —  SEC Charges Elon Musk for Violating the Beneficial Ownership Reporting Requirements of the Federal Securities Laws  —  The Securities and Exchange Commission announced today … ",
    "url": "https://www.sec.gov/enforcement-litigation/litigation-releases/lr-26219"
  },
  {
    "text": "US SEC sues Elon Musk over late disclosure of Twitter stake  —  Elon Musk was sued on Tuesday by the U.S. Securities and Exchange Commission for having failed to timely disclose purchasing more than 5% of Twitter's common stock in March 2022.  —  In a complaint filed in Washington, D.C. … ",
    "url": "https://www.reuters.com/legal/us-sec-sues-elon-musk-over-late-disclosure-twitter-stake-2025-01-14/"
  },
  {
    "text": "S.E.C. Sues Elon Musk Over Twitter-Related Securities Violations  —  Regulators filed a lawsuit in federal court stemming from Mr. Musk's $44 billion purchase of the social media company now called X.  —  U.S. securities regulators sued Elon Musk in federal court in Washington on Tuesday … ",
    "url": "https://www.nytimes.com/2025/01/14/technology/sec-elon-musk-securities-violations.html"
  },
  {
    "text": "The Most Damning Lines in Jack Smith's Brutal Trump January 6 Report  —  Special counsel Jack Smith did not hold back in his final report on the investigation into Donald Trump's attempt to overturn the 2020 election.  —  While much of it contains information already made public … ",
    "url": "https://newrepublic.com/post/190190/jack-smith-trump-january-6-report"
  },
  {
    "text": "Minnesota state House Democrats walk out in effort to block GOP speaker vote  —  The Minnesota Democratic caucus plans to skip nearly three weeks of the new legislative session in a bid to deny Republicans the ability to conduct business before a special election.",
    "url": "https://www.nbcnews.com/politics/elections/minnesota-state-house-democrats-stage-walkout-bar-new-gop-speaker-rcna187437"
  },
  {
    "text": "Meta just flipped the switch that prevents misinformation from spreading in the United States  —  I.  —  Last week, Meta announced a series of changes to its content moderation policies and enforcement strategies designed to curry favor with the incoming Trump administration.",
    "url": "https://www.platformer.news/meta-ends-misinformation-enforcement-zuckerberg/"
  },
  {
    "text": "Michelle Obama Will Skip Trump's Inauguration  —  Mrs. Obama also declined to attend the funeral of Jimmy Carter last week, which would have put her face-to-face with Mr. Trump.  —  Michelle Obama, the former first lady, will not attend the inauguration of President-elect Donald J. Trump, her office said in a statement on Tuesday.",
    "url": "https://www.nytimes.com/2025/01/14/us/politics/michelle-obama-trump-inauguration.html"
  },
  {
    "text": "Michelle Obama will skip Trump inauguration, but ex-Presidents Obama, Clinton and Bush will be there  —  Former first lady Michelle Obama will skip the inauguration of President-elect Donald Trump, the second time in two weeks that she is not attending a gathering of former U.S. leaders and their spouses … ",
    "url": "https://apnews.com/article/trump-inauguration-obama-bush-clinton-f7212766dc0f69444d8a4537a736c2d2"
  },
  {
    "text": "Biden moves to lift state sponsor of terrorism designation for Cuba, part of deal to free prisoners  —  The Biden administration on Tuesday is notifying Congress of its intent to lift the U.S. designation of Cuba as a state sponsor of terrorism, the White House announced … ",
    "url": "https://apnews.com/article/biden-cuba-terrorism-designation-a0e2f003ce7100e6a845ef7ed6e96a1b"
  },
  {
    "text": "Elon Musk, Jeff Bezos and Mark Zuckerberg to attend Trump's inauguration  —  The three will be seated together on the inauguration platform with other prominent guests.  —  Elon Musk, Jeff Bezos and Mark Zuckerberg will attend President-elect Donald Trump's inauguration on Monday … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/elon-musk-jeff-bezos-mark-zuckberg-trump-inauguration-rcna187629"
  },
  {
    "text": "I have struggled with how to respond to Mark Zuckerberg and Facebook's descent into toxic masculinity and Neo-Nazi madness.  While I have thought about quitting Facebook, I find great value in the connections and friends I have here, and it doesn't seem fair that I should lose that because Zuckerberg is having a mid-life crisis.",
    "url": "https://www.linkedin.com/posts/marklemley_i-have-struggled-with-how-to-respond-to-mark-activity-7284685204676362241-7h9r"
  },
  {
    "text": "A Biden-Trump Gaza deal?  —  With help from Connor O'Brien, John Sakellariadis, Maggie Miller and Daniel Lippman,  —  An Israel-Gaza cease-fire deal appears closer than ever, and both JOE BIDEN and DONALD TRUMP's camps are scrambling for credit.  —  Secretary of State ANTONY BLINKEN … ",
    "url": "https://www.politico.com/newsletters/national-security-daily/2025/01/14/a-biden-trump-gaza-deal-00198206"
  },
  {
    "text": "Vice Is a Moat  —  1. Secretary Pete  —  Here is the thing about Pete Hegseth:  —  Imagine that his character was sterling.  That he was a fine, upstanding man, admired by all who know him.  That he had dedicated his life to service and been judged to be as good a human being as Mister Rogers or Dolly Parton.",
    "url": "https://www.thebulwark.com/p/vice-is-a-moat"
  },
  {
    "text": "House passes ban on transgender students in girls sports  —  Washington — The House on Tuesday passed a Republican measure banning transgender girls and women from competing on school sports teams that match their gender identity after the party leaned into the issue during the 2024 campaign.",
    "url": "https://www.cbsnews.com/news/house-ban-transgender-girls-womens-sports/"
  },
  {
    "text": "Texas House elects new Speaker in blow to far-right wing  —  The Texas House on Tuesday elected state Rep. Dustin Burrows (R) to lead the chamber in a blow to the rising far-right wing of the party, defeating a candidate supported by Texas Attorney General Ken Paxton (R) and other top state figures.",
    "url": "https://thehill.com/homenews/state-watch/5085530-texas-house-elects-new-speaker-blow-to-far-right-wing/"
  },
  {
    "text": "I was fully indoctrinated into the Democrat ‘cult.’ Here's why I left my liberal influencer life behind to raise money for Trump  —  A former high energy Democratic fundraiser, failed congressional candidate and social media influencer is now raising money for President-elect Donald Trump's inaugural committee.",
    "url": "https://www.dailymail.co.uk/news/article-14278643/lindy-li-liberal-defected-democrat-cult-raising-money-trump.html"
  },
  {
    "text": "Mike Johnson eyes April deadline to pass one big MAGA bill through the House, but GOP senators are skeptical  —  House and Senate Republicans still disagree on the best strategy to advance Trump's policy priorities on the border, energy and taxes.  A recent Trump-GOP meeting failed to resolve it.",
    "url": "https://www.nbcnews.com/politics/congress/mike-johnson-april-deadline-pass-one-big-maga-bill-house-rcna187688"
  },
  {
    "text": "Republican Hard-Liners Already Have a Problem With the GOP's Reconciliation Strategy  —  Some Freedom Caucus members think a debt limit increase needs to be part of the reconciliation process.  GOP leaders are already signaling that it won't be.  — Copy",
    "url": "https://www.notus.org/congress/republican-hard-liners-problem-with-gop-reconciliation"
  },
  {
    "text": "Estimated Gaza Toll May Have Missed 25,000 Deaths, Study Says  —  Analysis found that more than 64,000 Palestinians may have been killed by traumatic injury in the first nine months of the war.  —  Deaths from bombs and other traumatic injuries during the first nine months of the war in Gaza … ",
    "url": "https://www.nytimes.com/2025/01/14/health/gaza-death-toll.html"
  },
  {
    "text": "‘Days of thunder’: Steve Bannon on the second coming of the Trump administration  —  The former adviser sat for a wide-ranging interview with POLITICO this week.  —  Steve Bannon had some thoughts on what the next four years have in store for Donald Trump as he returns to the White House.",
    "url": "https://www.politico.com/news/2025/01/14/bannon-second-trump-administration-00198197"
  }
]