[
  {
    "text": "Congress approves bill barring any president from unilaterally withdrawing from NATO  —  Congress has approved legislation that would prevent any president from withdrawing the United States from the North Atlantic Treaty Organization (NATO) without approval from the Senate or an Act of Congress.",
    "url": "https://thehill.com/homenews/4360407-congress-approves-bill-barring-president-withdrawing-nato/"
  },
  {
    "text": "New York Republicans choose ex-Israel Defense Forces soldier as nominee to replace George Santos  —  County party leaders selected the Nassau County legislator to be the GOP nominee in February's special election.  —  New York Republicans have selected Nassau County legislator Mazi Melesa Pilip … ",
    "url": "https://www.nbcnews.com/politics/2024-election/new-york-republicans-choose-mazi-melesa-pilip-house-nominee-replace-ge-rcna129426?taid=657b4ffaa7e88e0001afe63c"
  },
  {
    "text": "Rudy Giuliani Labels ‘Daily Show’ Guest Host a ‘Slob’ After Roast  —  The former New York City mayor was not impressed with a segment aired on “The Daily Show” this week.  —  As a Washington, D.C. jury decides if he'll pay $43 million to a pair of Georgia poll workers he defamed … ",
    "url": "https://www.thedailybeast.com/rudy-giuliani-labels-daily-show-guest-host-kal-penn-a-slob-after-roast"
  },
  {
    "text": "Ex-FBI counterintelligence official gets over 4 years in prison for aiding Russian oligarch  —  A former top FBI counterintelligence official was ordered Thursday to spend over four years in prison for violating sanctions on Russia by going to work for a Russian oligarch seeking dirt … ",
    "url": "https://apnews.com/article/mcgonigal-russian-oligarch-plea-fbi-ab21d73d0f943f0c9e6b267e157778bf"
  },
  {
    "text": "Hamas plot to attack Jews across Europe is foiled by police  —  Seven arrests made during raids in Germany, Denmark and the Netherlands as fears grow that Middle East war is increasing global threat  —  A Hamas plot to kill Jews in Europe was foiled by German and Danish police who uncovered … ",
    "url": "https://www.telegraph.co.uk/world-news/2023/12/14/hamas-plot-attack-jewish-sites-europe-foiled-police/"
  },
  {
    "text": "Jack Smith is still scrutinizing John Eastman  —  Eastman, a former top Trump attorney, is facing the loss of his law license in California — and the special counsel's office appears to be interested in materials from that case.  —  Federal prosecutors don't appear to be done with John Eastman just yet.",
    "url": "https://www.politico.com/news/2023/12/14/jack-smith-john-eastman-trump-records-00131823"
  },
  {
    "text": "“High intensity” phase of Gaza war needs to end within weeks, Sullivan tells Netanyahu  —  Israel's war in Gaza needs to “transition to the next lower intensity phase in a matter of weeks, not months,” White House national security adviser Jake Sullivan told Prime Minister Benjamin Netanyahu … ",
    "url": "https://www.axios.com/2023/12/14/jake-sullivan-netanyahu-israel-meeting"
  },
  {
    "text": "The Story Behind Trump's Gag Order Involves a Man Under Criminal Investigation for Stalking (Exclusive)  —  A Wisconsin man behind the digital campaign that prompted Donald Trump's gag order received three 50-year restraining orders and two criminal convictions resulting in jail time for harassing women",
    "url": "https://themessenger.com/politics/the-story-behind-trumps-gag-order-involves-a-man-under-criminal-investigation-for-stalking"
  },
  {
    "text": "Virginia court revives lawsuit by teacher fired for refusing to use trans student's pronouns  —  The former teacher, who was fired from West Point High School in 2018, said he could not use the student's pronouns because of his religious beliefs.  —  RICHMOND, Va. — A lawsuit filed … ",
    "url": "https://www.nbcnews.com/nbc-out/out-news/virginia-court-revives-lawsuit-teacher-fired-refusing-use-trans-studen-rcna129866"
  },
  {
    "text": "‘Are We Truly So Precious?’:  James Bennet's Damning NYT Portrayal  —  The former Times editorial page editor clears the record on his controversial 2020 firing.  —  Three years after his high-profile firing from the New York Times, James Bennet has told his side of the story in a damning portrait of the Times.",
    "url": "https://www.politico.com/news/magazine/2023/12/14/james-bennet-nyt-firing-00131826"
  },
  {
    "text": "Jeffries: Government will shut down unless House GOP yields on demands  —  House Minority Leader Hakeem Jeffries (D-N.Y.) is drawing red lines when it comes to 2024 spending, warning Thursday that the government will close its doors if House Republicans continue to demand funding levels below … ",
    "url": "https://thehill.com/homenews/house/4360885-jeffries-shut-down-house-gop/"
  },
  {
    "text": "Hungary Blocks Ukraine Aid After E.U. Opens Door to Membership  —  President Volodymyr Zelensky of Ukraine welcomed the breakthrough in Ukraine's official opening of accession negotiations to join the bloc.  Securing more financial aid will have to wait.  —  Hungary on Friday blocked … ",
    "url": "https://www.nytimes.com/2023/12/14/world/europe/eu-ukraine-hungary-aid.html"
  },
  {
    "text": "EXCLUSIVE: Apology letters surface in Fulton Trump case  —  Statements from Powell, Chesebro are just one sentence long  —  The apology letters written by two of the attorneys who struck plea agreements in the Fulton County election interference case are just one sentence long and hand-written on lined notebook paper.",
    "url": "https://www.ajc.com/politics/exclusive-apology-letters-surface-in-fulton-trump-case/O6YKFRXE6JAS7FX724K36FGZQE/"
  },
  {
    "text": "Mayor Wu's Boston City Council holiday party invitations draw criticism  —  An email went out to all city councilors about a holiday party on Tuesday, when it was only meant for minority elected officials  —  It was a festive atmosphere at the last scheduled Boston City Council meeting of the year on Wednesday.",
    "url": "https://www.nbcboston.com/news/local/mayor-wus-boston-city-council-holiday-party-invitations-draw-criticism/3218893/"
  },
  {
    "text": "Here's how dishonest James Comer's Biden allegations are  —  Over the past 24 hours, with a vote to formalize the impeachment investigation into President Biden looming in the House, Republican lawmakers have been pressed to identify what, exactly, they think Biden did.",
    "url": "https://www.washingtonpost.com/politics/2023/12/14/biden-impeachment-inquiry-comer-evidence/"
  },
  {
    "text": "In court, Michigan Republicans tie false elector effort to Donald Trump's campaign  —  Lansing — Testifying in court Thursday, top Michigan Republicans linked the organization and execution of a false certificate saying Donald Trump won the state's 2020 presidential election directly to Trump's campaign.",
    "url": "https://www.detroitnews.com/story/news/politics/2023/12/14/michigan-republican-party-chairwoman-laura-cox-testifies-false-donald-trump-electors-court-hearing/71912637007/"
  },
  {
    "text": "US has collected intel it could use to judge Israel's conduct of war  —  The U.S. has been gathering information about Israel's tactics in Gaza since the start of the war and provided those reports to lawmakers.  —  While American officials say they are not making judgments in real … ",
    "url": "https://www.politico.com/news/2023/12/14/israel-conduct-war-intel-tactic-00131868"
  }
]