[
  {
    "text": "Trump tariffs reinstated by appeals court for now … WATCH NOW  —  A federal appeals court on Thursday granted the Trump administration's request to temporarily pause a lower-court ruling that struck down most of President Donald Trump's tariffs.  —  The Trump administration had earlier told … ",
    "url": "https://www.cnbc.com/2025/05/29/blocked-trump-tariffs-trade-court-appeal.html"
  },
  {
    "text": "Second federal court rules against Trump's tariffs  —  The decision comes less than 24 hours after another court ruled against the president's use of an emergency law to justify tariffs on dozens of the United States' largest trading partners.  —  A second federal court has ruled … ",
    "url": "https://www.politico.com/news/2025/05/29/second-federal-court-rules-against-trumps-tariffs-00374377"
  },
  {
    "text": "Appeals court halts ruling that blocked Trump's tariffs  —  A federal appellate court on Thursday temporarily stayed a ruling that effectively wiped out most of President Trump's tariffs.  —  Why it matters: The intervention will deepen the chaos around the Court of International Trade's Wednesday order … ",
    "url": "https://www.axios.com/2025/05/29/trump-tariffs-court-appeal"
  },
  {
    "text": "Trump goes after Leonard Leo and the Federalist Society in fury over court ruling  —  Trump's attack came after the U.S. Court of International Trade struck down his tariffs, a blow to the primary pillar of his economic agenda.  —  President Donald Trump leveled unusually pointed criticism … ",
    "url": "https://www.politico.com/news/2025/05/29/trump-goes-after-leonard-leo-and-the-federalist-society-in-fury-over-court-ruling-00375813"
  },
  {
    "text": "US ruling that Trump tariffs are unlawful stirs relief and uncertainty  —  A U.S. trade court ruling that blocked most of President Donald Trump's tariffs and found he had overstepped his authority triggered some relief on financial markets on Thursday, while adding to the uncertainties weighing on the global economy.",
    "url": "https://www.reuters.com/business/us-ruling-that-trump-tariffs-are-unlawful-stirs-relief-uncertainty-2025-05-29/"
  },
  {
    "text": "White House Health Report Included Fake Citations  —  A report on children's health released by the Make America Healthy Again Commission referred to scientific papers that did not exist.  —  The Trump administration released a report last week that it billed as a “clear, evidence-based foundation” … ",
    "url": "https://www.nytimes.com/2025/05/29/well/maha-report-citations.html"
  },
  {
    "text": "The MAHA Report Cites Studies That Don't Exist  —  The Trump administration's “Make America Healthy Again” report misinterprets some studies and cites others that don't exist, according to the listed authors.  — Copy  —  Health Secretary Robert F. Kennedy Jr. says his “Make America Healthy Again” … ",
    "url": "https://www.notus.org/health-science/make-america-healthy-again-report-citation-errors"
  },
  {
    "text": "White House blames ‘formatting’ for errors in RFK Jr.'s MAHA report.  Authors push back.  —  Citation errors and phantom research used as scientific evidence to bolster Health Secretary Robert F. Kennedy Jr.'s landmark “Make America Healthy Again” commission report were apparently due to … ",
    "url": "https://www.usatoday.com/story/news/politics/2025/05/29/rfk-jr-maha-report-citation-errors/83925319007/"
  },
  {
    "text": "State Department set to launch ‘Office of Remigration’  —  The concept of remigration has explicitly neo-Nazi roots and has been popularized in Europe. … Secretary Marco Rubio's State Department published a reorganization chart Thursday morning showing massive cuts to diplomatic offices and functions, plus a few new additions.",
    "url": "https://www.thehandbasket.co/p/state-department-office-of-remigration"
  },
  {
    "text": "White House pressure for increased immigration arrests strains law enforcement agencies  —  The Trump administration is building up federal manpower and resources to meet the White House's desire to triple the number of daily immigration arrests - signaling a renewed push to go well beyond efforts from previous administrations.",
    "url": "https://cnn.com/2025/05/29/politics/white-house-immigration-arrests-law-enforcement-agencies"
  },
  {
    "text": "Exclusive: Kristi Noem said a migrant threatened to kill Trump.  Investigators think he was set up  —  Homeland Security Secretary Kristi Noem posted a stunning allegation on Wednesday: A undocumented migrant sent a letter threatening to kill President Donald Trump, promising to “self deport” after the assassination.",
    "url": "https://cnn.com/2025/05/29/politics/kristi-noem-migrant-arrested-threatening-trump"
  },
  {
    "text": "A Texas Cop Searched License Plate Cameras Nationwide for a Woman Who Got an Abortion  —  Earlier this month authorities in Texas performed a nationwide search of more than 83,000 automatic license plate reader (ALPR) cameras while looking for a woman who they said had a self-administered abortion … ",
    "url": "https://www.404media.co/a-texas-cop-searched-license-plate-cameras-nationwide-for-a-woman-who-got-an-abortion/"
  },
  {
    "text": "OPM ‘merit’ hiring plan includes bipartisan reforms, politicized new test  —  Federal job applicants will soon be quizzed on their favorite Trump administration policy as part of the hiring process, according to the Office of Personnel Management's new “merit hiring plan.”",
    "url": "https://www.govexec.com/workforce/2025/05/opm-merit-hiring-plan-includes-bipartisan-reforms-politicized-new-test/405687/"
  },
  {
    "text": "WIRED Talked to a Fired DOGE Staffer About Who Was Really in Charge  —  Sahil Lavingia, who says he was fired from DOGE after speaking out about his experiences there, told WIRED about how he communicated with the group, who appears to be in charge, and what might be coming next.",
    "url": "https://www.wired.com/story/fired-doge-staffer-who-is-in-charge/"
  },
  {
    "text": "Michigan Gov. Whitmer says Trump promised not to pardon kidnapping plotters  —  On Wednesday, Trump told reporters that he would “take a look at” pardoning the men, saying the trial looked “like somewhat of a railroad job.”  —  Michigan Gov. Gretchen Whitmer (D) said Thursday … ",
    "url": "https://www.washingtonpost.com/politics/2025/05/29/trump-pardon-whitmer-kidnapping-plot/"
  },
  {
    "text": "The Debate Over Transgender Rights Is a Liability for Democrats.  Here's How to Neutralize It.  —  It's time for real discussion, dissent and debate, without fear of being canceled.  —  It will go down as one of the most infamous taglines in modern campaign history: “Kamala is for they/them — President Trump is for you.”",
    "url": "https://www.politico.com/news/magazine/2025/05/29/transgender-politics-democrats-third-way-00372820"
  },
  {
    "text": "Your guide to Cryptogate, Trump's $4 billion corruption scandal that's 10 times bigger than Watergate  —  Here's an in-depth guide to the key players, companies, and deals behind Donald Trump's scheme to cash in on his presidency.",
    "url": "https://www.inquirer.com/opinion/trump-cryptocurrency-scandal-corruption-billions-20250529.html"
  },
  {
    "text": "Federal Authorities Probe Effort to Impersonate White House Chief of Staff  —  An unknown individual impersonated Susie Wiles in calls and texts to prominent Republicans and business executives  —  WASHINGTON—Federal authorities are investigating a clandestine effort to impersonate White House chief … ",
    "url": "https://www.wsj.com/politics/policy/federal-authorities-probe-effort-to-impersonate-white-house-chief-of-staff-65da0d59?st=gJtJuu"
  },
  {
    "text": "DOJ cutting American Bar Association access to judicial nominees  —  Attorney General Pam Bondi told the American Bar Association (ABA) Thursday that the Trump administration would no longer cooperate as the organization vets its judicial nominees.  —  In a letter, the Department of Justice … ",
    "url": "https://thehill.com/regulation/court-battles/5324916-doj-american-bar-association-judicial-nominees/"
  },
  {
    "text": "The WITAOD Chronicles  —  One woman's maddening search for the head of a non-existent federal agency.  —  annabower.bsky.social  —  Meet The Authors … Valentine's Day.  Other women are getting flowers and taking selfies and posting mushy stuff on social media.",
    "url": "https://www.lawfaremedia.org/article/the-witaod-chronicles"
  },
  {
    "text": "American doctors look to relocate to Canada to avoid the Trump administration  —  Earlier this year, as President Donald Trump was beginning to reshape the American government, Michael, an emergency room doctor who was born, raised, and trained in the United States, packed up his family and left the country.",
    "url": "https://www.npr.org/sections/shots-health-news/2025/05/29/nx-s1-5414345/american-doctors-look-to-relocate-to-canada-to-avoid-the-trump-administration"
  },
  {
    "text": "Bernard Kerik, who led NYPD on 9/11 before prison and pardon, has died at 69  —  Bernard Kerik, who served as New York City's police commissioner on 9/11 and later pleaded guilty to tax fraud before being pardoned, has died.  He was 69.  —  The New York Police Department confirmed his death Thursday on social media.",
    "url": "https://apnews.com/article/bernie-kerik-obit-1ed18ffa7da87bd824dc976eabd51fbf"
  },
  {
    "text": "SEC Drops Binance Lawsuit Days After Crypto Exchange Lists Trump's Stablecoin  —  Topline  —  The Securities and Exchange Commission dropped a lawsuit against Binance on Thursday, days after the crypto exchange began listing a stablecoin created by World Liberty Financial, one of President Donald Trump's blockchain ventures.",
    "url": "https://www.forbes.com/sites/zacheverson/2025/05/29/sec-drops-binance-lawsuit-trump-stablecoin-listed/"
  },
  {
    "text": "Big Law Firms 3, Trump 0  —  Three judges across the political spectrum have now said the President's punitive executive orders are unconstitutional.  —  Click for Sound  —  President Trump dismisses court rulings against him as judicial overreach, and sometimes he's right.",
    "url": "https://www.wsj.com/opinion/richard-leon-wilmerhale-donald-trump-executive-order-law-firms-perkins-coie-30ad849a"
  },
  {
    "text": "For These Trump Voters, a Rubber-Stamp Congress Is a Key Demand  —  In a recent pair of focus groups, voters loyal to President Trump judged members of Congress almost entirely according to whether they backed him — and rejected lawmakers who dared to dissent.",
    "url": "https://www.nytimes.com/2025/05/29/us/politics/trump-voters-congress.html"
  },
  {
    "text": "Statement on Chair Powell's meeting with the President  —  For immediate release  —  At the President's invitation, Chair Powell met with the President today at the White House to discuss economic developments including for growth, employment, and inflation.",
    "url": "https://www.federalreserve.gov/newsevents/pressreleases/other20250529a.htm"
  },
  {
    "text": "He Took a Wrong Turn Into Canada.  The Price?  3 Weeks in ICE Custody.  —  An accidental trip over the Peace Bridge in Buffalo typically means a toll and a loss of time.  But for Victor, crossing an international border carried a higher cost.  —  Visuals by Lauren Petracca",
    "url": "https://www.nytimes.com/2025/05/29/nyregion/border-deportation-peace-bridge.html"
  },
  {
    "text": "Musk Is Leaving Washington Pretty Much as He Found It  —  As the DOGE chief's stint comes to an end, the White House returns to politics as usual — which isn't necessarily an improvement. … Today's Agenda Did DOGE Work?  —  Last night, Elon Musk thanked President Donald Trump “for the opportunity to reduce wasteful spending.”",
    "url": "https://www.bloomberg.com/opinion/newsletters/2025-05-29/elon-musk-leaves-washington-pretty-much-as-he-found-it-pre-doge"
  },
  {
    "text": "Rep. Steube Introduces Make Autorail Great Again Act to Rebrand DC Metrorail as WMAGA and Trump Train  —  WASHINGTON — U.S. Representative Greg Steube (R-Fla.) today introduced the Make Autorail Great Again Act to block all federal funding to the Washington Metropolitan Area Transit Authority … ",
    "url": "https://steube.house.gov/press-releases/rep-steube-introduces-make-autorail-great-again-act-to-rebrand-dc-metrorail-as-wmaga-and-trump-train/"
  },
  {
    "text": "Intelligence agency employee accused of attempting to leak classified documents out of frustration with Trump  —  The FBI says he sought to share the material with an unspecified friendly foreign country.  —  An employee of the Defense Intelligence Agency is accused of attempting … ",
    "url": "https://www.politico.com/news/2025/05/29/dia-employee-leak-documents-trump-00375643"
  },
  {
    "text": "CEO pay rose nearly 10% in 2024 as stock prices and profits soared  —  The typical compensation package for chief executives who run companies in the S&P 500 jumped nearly 10% in 2024 as the stock market enjoyed another banner year and corporate profits rose sharply.",
    "url": "https://apnews.com/article/ceo-pay-compensation-pay-ratio-perks-1b968327984edfc67486c2e0e3dc2fff"
  },
  {
    "text": "Exclusive: Trump aims to exceed first term's weapons sales to Taiwan, officials say  —  The United States plans to ramp up weapons sales to Taipei to a level exceeding President Donald Trump's first term as part of an effort to deter China as it intensifies military pressure on the democratic island, according to two U.S. officials.",
    "url": "https://www.reuters.com/world/china/trump-aims-exceed-first-terms-weapons-sales-taiwan-officials-say-2025-05-30/"
  },
  {
    "text": "Federal Circuit Issues Brief Administrative Stay in Our Tariff Case  —  Last night, the US Court of International Trade (CIT) issued a unanimous ruling in the case against Trump's “Liberation Day” tariffs filed by Liberty Justice Center and myself on behalf of five US businesses harmed by the tariffs.",
    "url": "https://reason.com/volokh/2025/05/29/federal-circuit-issues-brief-administrative-stay-in-our-tariff-case/"
  }
]