[
  {
    "text": "Christopher Wray Says He'll Step Down as F.B.I. Director  —  The F.B.I. director, Christopher A. Wray, told bureau employees on Wednesday that he intended in January, bowing to the reality that President-elect Donald J. Trump had publicly declared his desire to replace him.",
    "url": "https://www.nytimes.com/live/2024/12/11/us/trump-news?unlocked_article_code=1.gk4.nrBl.-FY8bOi0dezX&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "FBI Director Christopher Wray to resign before Trump takes office  —  President-elect Donald Trump has said he will nominate Kash Patel as FBI director, sending a message to Christopher A. Wray that he should resign or prepare to be fired.  —  FBI Director Christopher A. Wray announced Wednesday … ",
    "url": "https://www.washingtonpost.com/national-security/2024/12/11/christopher-wray-resigns-fbi-director-trump-nominee/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzMzODkzMjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM1Mjc1NTk5LCJpYXQiOjE3MzM4OTMyMDAsImp0aSI6ImRhYTdjNjg1LWMwYjgtNDJhNS04YmI2LWI2ODBjZmQ3MDY4NiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb25hbC1zZWN1cml0eS8yMDI0LzEyLzExL2NocmlzdG9waGVyLXdyYXktcmVzaWducy1mYmktZGlyZWN0b3ItdHJ1bXAtbm9taW5lZS8ifQ.hhha7PC4vhhxuQqrZIYS4KGa2J9NI1OqdzqejntJwKg&itid=gfta"
  },
  {
    "text": "Manchin, Sinema block Democratic control of NLRB  —  The Senate on Wednesday blocked Lauren McFerran's re-nomination to the National Labor Relations Board, opening the door for Republican control of the board starting next year under President-elect Trump.  —  Senators voted 49 to 50 … ",
    "url": "https://thehill.com/homenews/senate/5035142-senate-blocks-nlrb-re-nomination/"
  },
  {
    "text": "Schumer torpedoed by Manchin and Sinema on crucial NLRB vote … - Schumer gambled that he had the votes without knowing how Sens. Kyrsten Sinema (I-Ariz.) and Joe Manchin (I-W.Va.) would vote on the nomination for Lauren McFerran.  — Both voted “No” on a crucial procedural vote that would clear the way for confirmation.",
    "url": "https://www.axios.com/2024/12/11/schumer-nlrb-vote-manchin-sinema"
  },
  {
    "text": "U.S. Rep. Nancy Mace Calls Police on Prominent Foster Youth Advocate; Eyewitnesses Dispute Her Assault Allegations  —  Stunned onlookers say the disturbing turn of events followed a routine celebration of a landmark child welfare law  —  This breaking news story will be updated as more information becomes available.",
    "url": "https://imprintnews.org/top-stories/nancy-mace-calls-police-prominent-foster-youth-advocate/256826"
  },
  {
    "text": "Mitch McConnell: 'We're in a very, very dangerous world right now'  —  The Republican Senator on his plans to spend the last two years of his term fighting back against an increasingly isolationist GOP  —  Mitch McConnell is standing in his office smiling.  Hanging on the walls are faces, mostly stern, from Washington's past.",
    "url": "https://www.ft.com/content/11d29c2f-4575-4f33-9419-b7abca1dbf39?accessToken=zwAGKP_M9YlYkc8R0pwvRXVPM9OUGberyh2_OQ.MEQCIF4VmsIeEbTzCVE_cXGdIk0NSGYtAbxQMvvpYfdKI9hjAiB466x6rsudrsZcgNVS9oVzIbC8Vc9mq8E30HzObIX_Rw&sharetype=gift&token=25ed162e-79f7-4d86-877b-72a8be948e00"
  },
  {
    "text": "CNN Poll: Most Americans approve how Trump is handling his return to the White House  —  Most Americans expect President-elect Donald Trump to do a good job upon his return to the White House next month (54%) and a majority approves of how he's handling the presidential transition so far … ",
    "url": "https://www.cnn.com/2024/12/11/politics/cnn-poll-trump-transition"
  },
  {
    "text": "House GOP Uses Must-Pass Defense Bill To Strip Care From Military Families' Trans Kids  —  A provision tucked into the National Defense Authorization Act forces parents in the military to weigh their careers against providing health care for loved ones.  —  LOADING",
    "url": "https://www.huffpost.com/entry/republicans-transgender-youth-defense-bill_n_67586f42e4b00d5a137d6b94"
  },
  {
    "text": "Time magazine to name Trump ‘Person of the Year’  —  He also won the honor in 2016.  —  Donald Trump is expected to be named Time magazine's “Person of the Year” — and to celebrate the unveiling of the cover, the president-elect will ring the opening bell of the New York Stock Exchange on Thursday morning … ",
    "url": "https://www.politico.com/news/2024/12/11/time-trump-person-of-the-year-000498"
  },
  {
    "text": "Warren on UnitedHealthcare CEO's killing: ‘People can only be pushed so far’  —  The Massachusetts lawmaker condemned the assassination of UnitedHealthcare CEO Brian Thompson, but added that the visceral reaction online should be a “warning” to the industry.",
    "url": "https://www.politico.com/news/2024/12/11/unitedhealthcare-ceo-killing-00193776"
  },
  {
    "text": "North Carolina GOP changes election rules before losing supermajority  —  Republicans in the state legislature gave an ally control over the state's elections board, rewrote ballot-counting rules and chipped away at the power of the incoming Democratic governor.",
    "url": "https://www.washingtonpost.com/politics/2024/12/11/north-carolina-republicans/"
  },
  {
    "text": "Trump plans to scrap policy restricting ICE arrests at churches, schools, hospitals  —  The long-standing policy has prevented ICE agents from arresting immigrants at so-called “sensitive locations” except under certain circumstances.  —  The incoming Trump administration intends to rescind … ",
    "url": "https://www.nbcnews.com/investigations/trump-scrap-restriction-ice-arrests-churches-schools-rcna183688"
  },
  {
    "text": "Trump invites China's Xi Jinping to inauguration  —  President-elect Donald Trump has invited Chinese President Xi Jinping to attend his inauguration next month, multiple sources told CBS News, and inauguration officials are making plans for additional foreign dignitaries to attend the swearing-in ceremony.",
    "url": "https://www.cbsnews.com/news/trump-invites-china-xi-jinping-inauguration/"
  },
  {
    "text": "Decivilization May Already Be Under Way  —  The line between a normal, functioning society and catastrophic decivilization can be crossed with a single act of mayhem.  This is why, for those who have studied violence closely, the brazen murder of a CEO in Midtown Manhattan—and, more important … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/12/decivilization-political-violence-civil-society/680961/"
  },
  {
    "text": "Luigi Mangione's Full Story Isn't Online  —  When the identity of Luigi Mangione, the alleged UnitedHealthcare CEO shooter, was revealed on Monday, the online search — a reporting process that's become a collective online ritual — began.  It turns out he left a lot of information online … ",
    "url": "https://nymag.com/intelligencer/article/luigi-mangione-social-media-instagram-facebook-x-good-reads.html"
  },
  {
    "text": "Annual inflation rate accelerates to 2.7% in November, as expected … WATCH NOW  —  Consumer prices rose at a faster annual pace in November, a reminder that inflation remains an issue both for households and policymakers.  —  The consumer price index showed a 12-month inflation rate … ",
    "url": "https://www.cnbc.com/2024/12/11/cpi-inflation-november-2024-annual-inflation-rate-accelerates-to-2point7percent-in-november-as-expected.html"
  },
  {
    "text": "Schumer says Senate will vote on Social Security changes  —  Senate Majority Leader Chuck Schumer (D-N.Y.) said Wednesday that he's “doing everything” he can to try to pass legislation that would enact some Social Security before Congress ushers in a new class next month.",
    "url": "https://thehill.com/homenews/senate/5035633-senate-majority-leader-schumer-social-security-legislation/"
  },
  {
    "text": "Albertsons Backs Out of Merger Deal and Sues Kroger After Court Rulings  —  The supermarket chain had tried to join forces with Kroger, but judges sided with federal and state regulators who charged that the merger would reduce competition.  —  The grocery chain Albertsons said on Wednesday … ",
    "url": "https://www.nytimes.com/2024/12/11/business/albertsons-kroger-merger-deal.html"
  },
  {
    "text": "The ultimate marker of Dems' generational shift: AOC's Oversight ascension  —  Ocasio-Cortez has earned the support of the majority of the panel's Democrats, based on interviews with a dozen members.  —  Rep. Alexandria Ocasio-Cortez is poised to become the top Democrat on the House Oversight Committee … ",
    "url": "https://www.politico.com/news/2024/12/11/aoc-oversight-generational-shakeup-00193849"
  },
  {
    "text": "Trump outran the law.  His allies haven't.  —  Dozens of Trump allies face criminal charges in lingering cases over efforts to overturn the 2020 election.  —  Despite Donald Trump's Houdini act, the criminal cases against his allies are not disappearing.  —  Dozens of Trump's top aides … ",
    "url": "https://www.politico.com/news/2024/12/11/trump-allies-state-legal-challenges-000246"
  },
  {
    "text": "The Fraudulence of “Waste, Fraud and Abuse”  —  First things first: welcome to readers new and old.  Now that I have written my last column for the New York Times, this newsletter is coming out of dormancy.  It will be mostly economics-related, and I'll try to stay away from pure political punditry … ",
    "url": "https://paulkrugman.substack.com/p/the-fraudulence-of-waste-fraud-and"
  },
  {
    "text": "Judge tosses Michael Flynn's $50 million lawsuit that claimed he was prosecuted to ‘derail and discredit’ Trump's 2020 presidential bid  —  A federal judge in Florida has dismissed a $50 million lawsuit filed by former U.S. National Security Advisor Michael Flynn, who sued the federal government … ",
    "url": "https://lawandcrime.com/high-profile/judge-tosses-michael-flynns-50-million-lawsuit-that-claimed-he-was-prosecuted-to-derail-and-discredit-trumps-2020-presidential-bid/"
  },
  {
    "text": "Exclusive: RFK Jr.'s secret push to prove CIA killed uncle … - RFK Jr. has been telling people that Fox Kennedy — his presidential campaign manager, who is married to his son Bobby Kennedy III — would help get to the bottom of the JFK assassination, two Republican sources told Axios.",
    "url": "https://www.axios.com/2024/12/11/rfk-jr-cia-jfk-kennedy-assassination-amaryllis-fox"
  },
  {
    "text": "Republican lawmakers invite a Jan. 6 felon to Trump's inauguration  —  The invitation to and praise for a member of the mob underscores the shifting power dynamic in Washington.  —  Russell Taylor spent weeks planning for chaos on Jan. 6, 2021.  He recruited anti-government activists to join … ",
    "url": "https://www.politico.com/news/2024/12/11/donald-trump-inauguration-jan-6-00193814"
  },
  {
    "text": "Recent Immigration Surge Has Been Largest in U.S. History  —  Under President Biden, more than two million immigrants per year have entered, government data shows.  —  The immigration surge of the past few years has been the largest in U.S. history, surpassing the great immigration boom … ",
    "url": "https://www.nytimes.com/2024/12/11/briefing/us-immigration-surge.html?unlocked_article_code=1.gk4.LYcv.t6zH-qEg-eHB&smid=url-share"
  },
  {
    "text": "Colleges Warn International Students to Return Ahead of Trump Term  —  Harvard, Penn and U.S.C. were among the universities and colleges that issued advisories in anticipation of possible travel bans.  —  With students at many colleges wrapping up final exams this week and preparing for their winter break … ",
    "url": "https://www.nytimes.com/2024/12/11/us/colleges-international-students-trump-travel-ban.html"
  },
  {
    "text": "Judge rejects sale of Alex Jones' Infowars to The Onion in dispute over bankruptcy auction  —  A federal judge on Tuesday night rejected the auction sale of Alex Jones' Infowars to The Onion satirical news outlet, criticizing the bidding process as flawed and the amount of money that families … ",
    "url": "https://apnews.com/article/infowars-onion-6bbdfb7d8d87b2f114570fcde4e39930"
  },
  {
    "text": "How a Decades-Old Loophole Lets Billionaires Avoid Medicare Taxes  —  Some of Wall Street's richest and most powerful figures are using a legal loophole to avoid paying millions of dollars in taxes earmarked for health care, a ProPublica investigation found.  —  The Secret IRS Files: Inside the Tax Records of the .001%",
    "url": "https://www.propublica.org/article/medicare-tax-loophole-steve-cohen"
  }
]