[
  {
    "text": "Elon Musk's Fake Sites and Fake Texts Impersonating the Harris Campaign  —  There's deeply cynical and then there's things which might be illegal.  In the first category we have an Elon Musk-funded PAC microtargeting Jewish and Arab communities with diametrically opposed ads about Kamala Harris's support for Israel or Palestine.",
    "url": "https://talkingpointsmemo.com/edblog/elon-musks-fake-sites-and-texts-impersonating-the-harris-campaign"
  },
  {
    "text": "Exclusive: Trump ground game in key states flagged as potentially fake  —  Data suggests canvassers linked to Elon Musk's America Pac falsely claimed to have visited homes of potential voters  —  Donald Trump's campaign may be failing to reach thousands of voters they hope to turn out in Arizona and Nevada … ",
    "url": "https://www.theguardian.com/us-news/2024/oct/19/trump-campaign-leaked-data-voters-elon-musk"
  },
  {
    "text": "Pro-Iranian account leaks alleged U.S. intel on Israel's attack plans … - The leak could be an attempt to disrupt the Israeli operation.  — The Pentagon and the Office of the Director of National Intelligence declined to comment on the leaked documents, but did not dispute their authenticity.",
    "url": "https://www.axios.com/2024/10/19/israel-iran-attack-telegram-leaked-intelligence"
  },
  {
    "text": "Leaked documents show US intelligence on Israel's plans to attack Iran, sources say  —  The US is investigating a leak of highly classified US intelligence about Israel's plans for retaliation against Iran, according to three people familiar with the matter.  One of the people familiar confirmed the documents' authenticity.",
    "url": "https://www.cnn.com/2024/10/19/politics/us-israel-iran-intelligence-documents/"
  },
  {
    "text": "How Trump's Cockiness Could Cost Him Votes  —  The GOP loves to pretend they are winning, but Trump has a different challenge  —  It's that time of the year again — Republicans are declaring with certainty that they will win the election while Democrats anxiously wait for the sky to crash down on their heads.",
    "url": "https://www.messageboxnews.com/p/how-trumps-cockiness-could-cost-him"
  },
  {
    "text": "Why Election Day has irreversibly changed … - Early voting in person or by mail has exploded over the past 24 years. … - Early in-person voting is underway in nearly two dozen states, per USA Today. … - A majority of voters who have already voted early or are planning to do so support Harris.",
    "url": "https://www.axios.com/2024/10/19/early-voting-2024-trump-harris"
  },
  {
    "text": "Here's why some Latinos are genuinely embracing the Republican Party  —  With the presidential election less than one month away, many people are still trying to make sense of why some Latinos support Donald Trump and the Republican Party, who display clear nativist stances.",
    "url": "https://thehill.com/opinion/4941672-latino-trump-support-republican-party/"
  },
  {
    "text": "Montana park ranger says Senate candidate Tim Sheehy lied about combat wound  —  Sheehy has claimed that he was wounded in Afghanistan, but ranger says he investigated accidental shooting in park in 2015  —  A former Montana park ranger has now publicly accused Tim Sheehy … ",
    "url": "https://www.theguardian.com/us-news/2024/oct/19/tim-sheehy-gunshot-wound-montana-park-ranger"
  },
  {
    "text": "Western Wisconsin farmers say Van Orden behavior derailed meeting on agricultural policy … Two farmers from western Wisconsin are speaking out after a meeting last month on agricultural policy with Republican Rep. Derrick Van Orden was derailed by the congressman when he and his staff interrupted … ",
    "url": "https://wisconsinindependent.com/politics/western-wisconsin-farmers-van-orden-behavior-derailed-meeting-agricultural-policy/"
  },
  {
    "text": "What Elon Musk Really Wants  —  The Tesla and X mogul has long dreamed of redesigning the world in his own extreme image.  Trump may be his Trojan horse.  —  In Elon Musk's vision of human history, Donald Trump is the singularity.  If Musk can propel Trump back to the White House … ",
    "url": "https://www.theatlantic.com/books/archive/2024/10/donald-trump-is-elon-musks-trojan-horse/680309/"
  },
  {
    "text": "JD Vance's Most Recent Comment About His Wife Having Three Kids Is Going Viral Because People Think It's Really, Really Creepy  —  “I've never heard a man refer to his kids as my wife's children.  That's insane.”  —  Michaela Bramwell— BuzzFeed  —  JD Vance is on my timeline yet again … ",
    "url": "https://www.huffpost.com/entry/jd-vance-wife-kids-comment_n_67129574e4b0e2b6e54bfb5a"
  },
  {
    "text": "Here's why sex discrimination at work doesn't go away until women are in charge  —  New research reveals men pay little heed to women in mixed-sex teams  —  Single-sex teams are something for the football pitch, not the workplace.  It's not the 1950s.  Many studies show the benefits of mixed teams … ",
    "url": "https://www.theguardian.com/commentisfree/2024/oct/19/heres-why-sex-discrimination-at-work-doesnt-go-away-until-women-are-in-charge"
  },
  {
    "text": "Here's how Trump, Harris and their allies have altered their ad spending strategies in October  —  In the first two weeks of October, Donald Trump and his allies directed about a third of all their spending on broadcast TV advertisements to ads about transgender health care … ",
    "url": "https://www.cnn.com/2024/10/19/politics/campaign-advertising-tv-trump-harris/"
  },
  {
    "text": "(5th LD) N. Korea decides to send around 10,000 soldiers to support Russia in Ukraine war: Seoul  —  (ATTN: UPDATES with response from NATO chief in paras 17-18)  —  South Korea's spy agency on Friday confirmed that North Korea has decided to send around 10,000 troops to support Russia … ",
    "url": "https://en.yna.co.kr/view/AEN20241018006856315"
  },
  {
    "text": "Obama: ‘You would be worried if your grandpa was acting’ like Trump  —  Former President Obama took a swipe at former President Trump's competence Friday, mocking the GOP nominee for his recent rhetoric.  —  “He called himself ‘the father IVF,’” Obama said during a rally in battleground Arizona.",
    "url": "https://thehill.com/homenews/campaign/4942571-barack-obama-donald-trump-competence-arizona/"
  },
  {
    "text": "America's gullibility crisis … In the last few weeks alone:  — MAGA influencers breathlessly spread the false claim that Vice President Kamala Harris used a teleprompter during her Univision town hall, which the X algorithm then promoted in its trending topics as fact.",
    "url": "https://www.axios.com/2024/10/19/musk-ackman-election-misinformation"
  },
  {
    "text": "Microphone malfunction: Trump waits on stage for 18 minutes during ‘technical difficulties’  —  Donald Trump's rally in Detroit hit a snag on Friday night when the audio stopped working and the Republican presidential nominee passed the time walking around on the stage for about 18 minutes waiting for a fix.",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/10/18/trump-microphone-problem-detroit/75742522007/"
  }
]