[
  {
    "text": "Editor Jon Ralston's 2024 Nevada election predictions  —  I should have done the mic drop in 2022.  —  Picking the winners in the top two races, both of which were agonizingly close, should have been the swan song, the ride off into the sunset on my oracular career.",
    "url": "https://thenevadaindependent.com/article/editor-jon-ralstons-2024-nevada-election-predictions"
  },
  {
    "text": "Our Final 2024 Ratings  —  We mentioned a few weeks ago that we misplaced our Crystal Ball.  As an update, we regret to say that we still have not found it.  So no final ratings this year.  Have fun on Tuesday!  —  ...  ...  ...  OK, fine, we'll give it a try.",
    "url": "https://centerforpolitics.org/crystalball/our-final-2024-ratings/"
  },
  {
    "text": "Election forecaster predicts 218-217 House  —  Sabato's Crystal Ball, a prominent election forecaster, predicted Monday that this year's elections will result in a House divided by one vote.  —  “Just like the presidential race, the battle for the House has been a Toss-up for essentially the whole cycle … ",
    "url": "https://thehill.com/homenews/campaign/4971446-sabatos-crystal-ball-predicts-218-217-house/"
  },
  {
    "text": "Trump Stepped on a Rake Yesterday—and He Knew It  —  DONALD TRUMP DOESN'T ADMIT TO MISTAKES, but he knew he made one Sunday morning.  —  For 96 minutes, at his first of his three rallies that day, Trump barely looked at his teleprompter.  He darkly obsessed about election fraud … ",
    "url": "https://www.thebulwark.com/p/trump-stepped-on-a-rake-lititz-rally-grievances"
  },
  {
    "text": "Trump is confident on election's eve: 'It's ours to lose'  —  Former President Trump thinks it's his election to lose as voters go the polls to elect a new president.  —  If he's right, he'll make history, becoming the first former president to lose office and then win it again since 1892.",
    "url": "https://thehill.com/homenews/campaign/4970776-trump-election-loss-challenge/"
  },
  {
    "text": "U.S. Presidential Contest, November 2024  —  Harris +4 Points Against Trump Nationally  —  In this final, national NPR/PBS News/Marist Poll before Election Day, Vice President Kamala Harris edges former President Donald Trump among likely voters nationally including those who are undecided yet leaning toward a candidate.",
    "url": "https://maristpoll.marist.edu/polls/u-s-presidential-contest-november-2024/"
  },
  {
    "text": "Elon Musk's $1 million-a-day voter sweepstakes can proceed, a Pennsylvania judge says  —  The $1 million-a-day voter sweepstakes that Elon Musk 's political action committee is hosting in swing states can continue through Tuesday's presidential election, a Pennsylvania judge ruled Monday.",
    "url": "https://apnews.com/article/musk-million-sweepstakes-lottery-pennsylvania-krasner-4f683c48eb7dcc57f183e54ef16e7320"
  },
  {
    "text": "Elon Musk lawyer says $1 million voter giveaway winners are not random  —  Elon Musk's pro-Trump group does not choose the winners of its $1 million-a-day giveaway to registered voters at random, but instead picks people who would be good spokespeople for its agenda, a lawyer for the billionaire said on Monday.",
    "url": "https://www.reuters.com/legal/judge-weighs-challenge-elon-musks-1-million-voter-giveaway-2024-11-04/"
  },
  {
    "text": "Trump Claims “Illegal Alien” Voting Is Rampant.  His Own Party Disagrees.  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up to receive our biggest stories as soon as they're published.  —  In public remarks, former President Donald Trump has repeatedly … ",
    "url": "https://www.propublica.org/article/trump-pennsylvania-rnc-training-video-undocumented-voting-election"
  },
  {
    "text": "Georgia Judge Rejects Third Lawsuit From GOP Fulton County Election Official  —  A Georgia judge rejected a third lawsuit from Julie Adams — a GOP member of the Fulton County Board of Elections and Registration — seeking additional election records she claims she needs to certify tomorrow's election results.",
    "url": "https://www.democracydocket.com/news-alerts/georgia-judge-rejects-third-lawsuit-from-gop-fulton-county-election-official/"
  },
  {
    "text": "Russia Suspected of Plotting to Send Incendiary Devices on U.S.-Bound Planes  —  Two devices that ignited in Europe, officials say, were part of a covert operation to put them on cargo or passenger aircraft  —  Western security officials say they believe that two incendiary devices … ",
    "url": "https://www.wsj.com/world/russia-plot-us-planes-incendiary-devices-de3b8c0a"
  },
  {
    "text": "Tucker Carlson Says Abortions Cause Hurricanes in Election Eve Broadcast  —  In a podcast appearance, Tucker Carlson dismissed scientific research that links global warming to more potent and frequent hurricanes, saying instead that “it's probably abortion, actually.”",
    "url": "https://www.nytimes.com/2024/11/04/us/politics/tucker-carlson-hurricanes-abortion-demonic-nuclear-weapons.html"
  },
  {
    "text": "A pro-Trump influencer says a Russian agent paid him $100 to post a fake voter fraud video.  It wasn't the first time  —  An American social media influencer said he was paid $100 by a pro-Kremlin propagandist to post a fake video of Haitian immigrants claiming to vote in the US presidential election.",
    "url": "https://www.cnn.com/2024/11/04/politics/fake-georgia-voting-video-russian-disinformation/"
  },
  {
    "text": "X's plan to interfere with the election  —  With polls essentially tied and hours to go until Election Day, no one knows for certain who will win the 2024 US presidential election.  But we can say with some certainty what will happen if the result is anything other than a landslide victory for Donald Trump … ",
    "url": "https://www.platformer.news/x-election-elon-musk-voter-fraud-misinformation/"
  },
  {
    "text": "A Key Trump Staffer Was Fired Last Week For Being a White Nationalist  —  Luke Meyer was Trump's regional field director for western Pennsylvania.  Online, he was the white nationalist Alberto Barbarossa and a co-host of Richard Spencer's podcast.  —  People are seen during a rally … ",
    "url": "https://www.politico.com/news/magazine/2024/11/04/white-nationalist-trump-campaign-00187282"
  },
  {
    "text": "Ohio sheriff's lieutenant apologizes for 'won't help Democrats' post, blames sleep medication  —  An Ohio sheriff's patrol commander who declared on Facebook that he would not help Democrats and would require proof of who a person voted for before providing them aid has apologized … ",
    "url": "https://apnews.com/article/ohio-sheriff-springfield-wont-help-democrats-apology-13603baba33b86365e262d45fbf4dbbd"
  },
  {
    "text": "Poll: Harris has massive lead among swing state college students … - Another factor is how many out-of-state students attending schools in swing states vote there vs. in their home states via absentee ballot. … - In a race that included Green Party candidate Jill Stein and Libertarian Chase Oliver … ",
    "url": "https://www.axios.com/2024/11/04/poll-harris-trump-swing-state-college-students"
  },
  {
    "text": "A fixture of American politics for nearly a decade, Trump rallies are coming to an end  —  They have been the nerve center of his political movement since he first announced his candidacy in 2015.  —  Regardless of who wins Tuesday's election, a key fixture of America's political landscape … ",
    "url": "https://www.nbcnews.com/politics/2024-election/trump-rallies-are-coming-end-rcna178736"
  },
  {
    "text": "Joe Rogan endorses Trump on eve of Election Day … - “If it wasn't for him we'd be f—ked,” Rogan wrote in the post, which links to his interview with Musk.  — “He makes what I think is the most compelling case for Trump you'll hear, and I agree with him every step of the way.",
    "url": "https://www.axios.com/2024/11/05/joe-rogan-endorses-trump-on-eve-of-election-day"
  },
  {
    "text": "Algerian Boxer Imane Khelif Has XY Chromosomes And “Testicles” : French-Algerian Medical Report Admits  —  A shocking new development has emerged in the case of Algerian boxer Imane Khelif after a French journalist reportedly gained access to a damning medical report revealing Khelif has “testicles.”",
    "url": "https://reduxx.info/algerian-boxer-imane-khelif-has-xy-chromosomes-and-testicles-french-algerian-medical-report-admits/"
  },
  {
    "text": "Trump's Crowds Are Dwindling as His Campaign Winds Down  —  The former president likes to talk about the attendance at his rallies, but empty seats and early exits have grown more common.  —  Donald J. Trump has spent parts of the last week of his campaign speaking in self-aggrandizing reverence … ",
    "url": "https://www.nytimes.com/2024/11/04/us/politics/trump-rally-crowds.html"
  },
  {
    "text": "Steelworkers show up for Trump in Pittsburgh, bucking union that endorsed Harris  —  PITTSBURGH — The United Steelworkers union endorsed Kamala Harris.  But some of its members are showing up to Donald Trump's evening rally in Pittsburgh to show their support for the former president.",
    "url": "https://www.politico.com/live-updates/2024/11/04/2024-elections-live-coverage-updates-analysis/steelworkers-for-trump-00187273"
  },
  {
    "text": "Harris botched interview with Muslim influencer by celebrating ‘bacon’ as ‘a spice’  —  She jumped out of the frying pan and into the fire.  —  Vice President Kamala Harris is getting roasted for refusing to talk about the Mideast war with a Muslim influencer — and instead spending … ",
    "url": "https://nypost.com/2024/11/04/us-news/harris-botched-interview-with-muslim-influencer-by-celebrating-bacon-as-a-spice/"
  },
  {
    "text": "How to Get Through Election Day  —  Store up some enlightenment for the white-knuckle hours ahead.  —  This might be nostalgia talking, but I miss the old Election Nights, the kind we used to have before the stakes became so gruesomely high.  No one was warning of “existential consequences” … ",
    "url": "https://www.theatlantic.com/ideas/archive/2024/11/election-results-grief-minimization/680517/"
  },
  {
    "text": "Man Arrested and Charged with Attempting to Use a Weapon of Mass Destruction and to Destroy an Energy Facility in Nashville  —  For Immediate Release  —  View the complaint here.  —  Skyler Philippi, 24, of Columbia, Tennessee, was arrested by federal agents and charged with attempting … ",
    "url": "https://www.justice.gov/opa/pr/man-arrested-and-charged-attempting-use-weapon-mass-destruction-and-destroy-energy-facility"
  },
  {
    "text": "Some Republican-led states refuse to let Justice Department monitors into polling places  —  Some Republican-led states say they will block the Justice Department's election monitors from going inside polling places on Election Day, pushing back on federal authorities' decades-long practice … ",
    "url": "https://apnews.com/article/justice-department-election-monitors-republican-states-b432050ce1a28e106394b6cefeb4866c"
  },
  {
    "text": "“I am scared every day”: Experts say GOP men targeting no-fault divorce to keep women “trapped”  —  As worries grow after Dobbs, experts fear restricting no-fault divorce could be a death sentence for some women  —  Raquell Barton was knee-deep in her doctorate program at the University … ",
    "url": "https://www.salon.com/2024/11/04/i-am-scared-every-day-experts-say-men-targeting-no-fault-divorce-to-keep-women-trapped/"
  },
  {
    "text": "Quincy Jones, music titan who worked with everyone from Frank Sinatra to Michael Jackson, dies at 91  —  Quincy Jones, the multitalented music titan whose vast legacy ranged from producing Michael Jackson's historic “Thriller” album to writing prize-winning film and television scores … ",
    "url": "https://apnews.com/article/quincy-jones-dead-a9e31c7e39c448d8971519f47a22dd21"
  }
]