[
  {
    "text": "Trump signs controversial spending bill during White House 4th of July celebrations  —  The president pushed Congress to get the bill passed before the holiday.  —  President Donald Trump presents a sweeping spending and tax legislation, known as the “One Big Beautiful Bill Act,” … ",
    "url": "https://abcnews.go.com/Politics/trump-sign-controversial-spending-bill-white-house-4th/story?id=123482017"
  },
  {
    "text": "Is This Really How We're Legislating Now?  —  Speaker Mike Johnson once again defied skeptics and found a majority in a high-stakes vote, with the House passing the president's big policy bill on Thursday along party lines.  He and John Thune, the Senate leader, ably made whatever deals … ",
    "url": "https://www.nytimes.com/2025/07/04/opinion/congress-john-thune-mike-johnson.html"
  },
  {
    "text": "Trump Signs ‘Big, Beautiful Bill’ Into Law  —  President's measure includes tax cuts and spending reductions  —  WASHINGTON—President Trump's “one big, beautiful bill” is now law.  —  In a splashy Fourth of July ceremony, with a B-2 stealth bomber and fighter jets flying over the White House … ",
    "url": "https://www.wsj.com/politics/policy/trump-signs-big-beautiful-bill-into-law-302edba6"
  },
  {
    "text": "Multiple deaths reported in Hill Country, rescue efforts underway as flash flooding threatens communities  —  Lt. Gov. Dan Patrick said rescuers are searching for survivors, including 23 girls missing from a Christian camp along the Guadalupe River.  —  Officials said as many as 13 bodies … ",
    "url": "https://www.texastribune.org/2025/07/04/texas-flooding-deaths/"
  },
  {
    "text": "Frantic Search for the Missing After At Least Six Killed in Texas Flood  —  The authorities confirmed that people had died as a result of the flooding along the Guadalupe River, but the scope of the disaster was not immediately clear.  —  At least six people were killed and frantic searches … ",
    "url": "https://www.nytimes.com/2025/07/04/us/texas-flooding-kerr-county-san-angelo.html"
  },
  {
    "text": "Russia Hits Ukraine With Large Air Barrage Hours After Trump-Putin Call  —  It was the latest in a series of almost weekly large-scale missile and drone attacks.  President Trump said he “didn't make any progress” with President Vladimir V. Putin of Russia.",
    "url": "https://www.nytimes.com/2025/07/04/world/europe/ukraine-russia-war-putin-trump.html"
  },
  {
    "text": "Judge transfers new case challenging South Sudan deportations  —  An administrative stay issued Friday morning will last until 4:30 p.m. Further action would have to come from Massachusetts.  Read the new claims at Law Dork.  —  After a hearing on Friday, U.S. District Judge Randolph Moss transferred … ",
    "url": "https://www.lawdork.com/p/breaking-judge-issues-administrative"
  },
  {
    "text": "Judge clears way for U.S. to deport eight men to South Sudan … “This Court interprets these Supreme Court orders as binding on this new petition,” Murphy said in a brief order, “as Petitioners are now raising substantially similar claims, and therefore Petitioners motion is denied.”",
    "url": "https://www.politico.com/news/2025/07/04/trump-south-sudan-deportation-00440024"
  },
  {
    "text": "Concentration Camp Labor  —  With the passage of Trump's death bill, we face the prospect of many great harms, including an archipelago of concentration camps across the United States.  —  Concentration camps are sites of tempting slave labor.  Among many other aims, the Soviets used … ",
    "url": "https://snyder.substack.com/p/concentration-camp-labor"
  },
  {
    "text": "China sees Trump's new law as ‘one of the greatest acts of strategic self-harm’: analyst  —  According to one analyst, only two groups are celebrating H.R. 1 — President Donald Trump's massive new budget law — on July 4: Republicans, and the Chinese Communist Party.",
    "url": "https://www.alternet.org/trump-china-law/"
  },
  {
    "text": "AOC Warns of ICE ‘Explosion’ After ‘Big Beautiful’ Bill Passes  —  THE WORST HAS YET TO COME  —  “It is setting up to make what's happening now look like child's play,” said the Democratic representative.  —  Rep. Alexandria Ocasio-Cortez warned that the effects of President Donald Trump's … ",
    "url": "https://www.thedailybeast.com/alexandria-ocasio-cortez-warns-ice-explosion-imminent-after-beautiful-bill/"
  },
  {
    "text": "BCG modelled plan to ‘relocate’ Palestinians from Gaza  —  Consulting firm had multimillion-dollar role in contentious new aid scheme for shattered enclave  —  Unlock the Editor's Digest for free  —  Boston Consulting Group modelled the costs of “relocating” Palestinians from Gaza and entered … ",
    "url": "https://www.ft.com/content/c0e661cc-55db-4e2a-b17b-a656e0cf6c14"
  },
  {
    "text": "The Bulwark's top editor shares how the anti-Trump site tripled its subscriber base in a year — and why it's betting on YouTube  — The Bulwark, a news website that's fiercely critical of President Donald Trump, has grown rapidly.  — Since the 2024 election, The Bulwark has roughly doubled its paid subscriber base.",
    "url": "https://www.businessinsider.com/the-bulwark-jonathan-last-interview-growth-youtube-cable-msnbc-cnn-2025-7"
  },
  {
    "text": "GOA to File “One Big Beautiful Lawsuit” Against NFA Registry as “One Big Beautiful Bill” Heads to President's Desk  —  FOR IMMEDIATE RELEASE  —  Washington, D.C. -Gun Owners of America (GOA) and Gun Owners Foundation (GOF), alongside our allies Palmetto State Armory (PSA) … ",
    "url": "https://www.gunowners.org/goa-to-file-one-big-beautiful-lawsuit-against-nfa-registry-as-one-big-beautiful-bill-heads-to-presidents-desk/"
  },
  {
    "text": "Patel and Ratcliffe try to bolster claims that FBI and CIA conspired against Trump  —  The release of formerly classified documents this week shows how Trump appointees are using their power to try to prop up his allegations about both agencies.  —  The release of formerly classified FBI … ",
    "url": "https://www.nbcnews.com/politics/national-security/patel-ratcliffe-try-bolster-claims-fbi-cia-conspired-trump-rcna216848"
  },
  {
    "text": "Jan. 6 federal prosecutor fired by Pam Bondi quotes Theodore Roosevelt in passionate farewell letter  —  The email came amid the continued targeting of career Justice Department and FBI officials disfavored by the Trump administration.  —  WASHINGTON — One of three career federal prosecutors fired … ",
    "url": "https://www.nbcnews.com/politics/justice-department/jan-6-federal-prosecutor-farewell-letter-rcna216978"
  },
  {
    "text": "Trump says he didn't know an offensive term he used in a speech is considered antisemitic  —  President Donald Trump says he didn't know the term “shylock” is considered antisemitic when he used it in a speech to describe unscrupulous moneylenders.  Trump told reporters early Friday … ",
    "url": "https://apnews.com/article/trump-offensive-term-jews-antisemitism-shakespeare-6c6517f6de0e4c80936c40055069c0db"
  },
  {
    "text": "ICE prepares detention blitz with historic $45 billion in funding  —  Much of the new allocation from Congress — larger than detention spending by the Obama, Biden and first Trump administrations combined — will go to private prison contractors tasked with doubling the nation's capacity to lock up migrants.",
    "url": "https://www.washingtonpost.com/business/2025/07/04/trump-bill-ice-immigrant-detention/"
  }
]