[
  {
    "text": "Forget No Labels.  Biden's Third-Party Peril is on the Left.  —  LOS ANGELES — Memo to Democrats: It's not Nancy Jacobson who's disrupting President Joe Biden's speeches most every time he appears in public and it's also not Nancy Jacobson floating Robert F. Kennedy Jr. $15 million to help him get on general election ballots.",
    "url": "https://www.politico.com/news/magazine/2024/02/04/biden-third-party-peril-00139380"
  },
  {
    "text": "Poll: 20-point deficit on handling economy highlights Biden's struggles against Trump  —  The president's approval rating has fallen to a new low in NBC News polling, as Trump narrowly leads in a 2024 general election matchup.  —  Despite a growing economy and little opposition for his party's nomination … ",
    "url": "https://www.nbcnews.com/politics/2024-election/poll-biden-trump-economy-presidential-race-rcna136834"
  },
  {
    "text": "How a Trump conviction changes the 2024 race in our latest poll  —  A slice of Trump supporters say they wouldn't stick with the former president if he's convicted of a felony this year.  —  The newest national NBC News poll shows former President Donald Trump leading current President Joe Biden … ",
    "url": "https://www.nbcnews.com/politics/2024-election/trump-conviction-changes-2024-race-latest-poll-rcna137087"
  },
  {
    "text": "Ann Coulter: Best Thing Trump Could Do for America Is ‘Die’  —  The one-time MAGA supporter became a born-again anti-Trumper in recent years, admitting she was “a very stupid girl” to support Trump in the early days of his ascendance.  —  Ann Coulter didn't mince her words when asked … ",
    "url": "https://www.thedailybeast.com/ann-coulter-best-thing-trump-could-do-for-america-is-die"
  },
  {
    "text": "They hoped solar panels would secure the future of their farm.  Then their neighbors found out  —  GARDNER, Kansas − Donna Knoche made her way up to the podium at the Johnson County Commission hearing on June 6, 2022, her new yellow shirt crisp and her voice steady.",
    "url": "https://www.usatoday.com/story/news/investigations/2024/02/04/solar-power-in-kansas/71920670007/"
  },
  {
    "text": "The Observer view: the list of Brexit wins is in.  It's short and feeble  —  Department for Business and Trade has cherry-picked statistics to suggest the project has been a success  —  In the run-up to the 2016 referendum, Conservative campaigners sold Brexit as the answer to all of the country's problems.",
    "url": "https://www.theguardian.com/commentisfree/2024/feb/03/observer-view-list-of-brexit-wins-is-in-short-and-feeble"
  },
  {
    "text": "Nikki Haley Flails When Confronted by Her Own Secession Comments  —  The GOP candidate had said last week that states could secede if they felt the need to do so.  —  Nikki Haley, fresh off her Civil War history refresher on this week's Saturday Night Live, appeared to remember … ",
    "url": "https://www.thedailybeast.com/nikki-haley-flails-when-confronted-by-her-own-secession-comments"
  },
  {
    "text": "South Dakota tribe bans governor from reservation over US-Mexico border remarks  —  A South Dakota tribe has banned Republican Gov. Kristi Noem from the Pine Ridge Reservation after she spoke this week about wanting to send razor wire and security personnel to Texas to help deter immigration … ",
    "url": "https://apnews.com/article/oglala-sioux-reservation-governor-ban-south-dakota-9f811bbd1ffaadf979e4353ad6e961ad"
  },
  {
    "text": "Nikki Haley targets Trump during Saturday Night Live appearance for refusal to debate  —  2024 Republican presidential candidate Nikki Haley made a guest appearance on Saturday Night Live to poke fun at former President Donald Trump for his refusal to debate her on the campaign trail.",
    "url": "https://www.washingtonexaminer.com/news/2836080/nikki-haley-appears-snl-target-trump-debates/"
  },
  {
    "text": "When Joe Biden lost his purpose  —  Between his son's death and his presidential run, Biden cast about for meaning  —  Several months before Joe Biden left the vice presidency, Louis Freeh, the former FBI director, began messaging Hunter Biden in hopes of enticing his father into a business partnership.",
    "url": "https://www.washingtonpost.com/politics/2024/02/03/joe-biden-beau-death/"
  },
  {
    "text": "Tucker Carlson Being Spotted in Moscow Sparks Frenzied Speculation  —  The reported appearance of former Fox News host Tucker Carlson in the Russian capital has sparked intense speculation over the purpose of the conservative media personality's visit to Moscow.",
    "url": "https://www.newsweek.com/tucker-carlson-moscow-russia-vladimir-putin-1866669"
  },
  {
    "text": "George Stephanopoulos Cuts Off GOP Senator After He Suggests Trump Could Defy SCOTUS  —  Senator, thanks for your time this morning,\" George Stephanopoulos said before Sen. Vance's mic was cut off.  —  ABC News anchor George Stephanopoulos would not tolerate another word from Sen. J.D. Vance … ",
    "url": "https://www.thedailybeast.com/george-stephanopoulos-cuts-off-jd-vance-after-he-suggests-trump-could-defy-scotus"
  },
  {
    "text": "Jeffries on House Republicans: ‘Wholly owned subsidiaries of Donald Trump’  —  House Minority Leader Hakeem Jeffries (D-N.Y.) blasted House Republicans on Sunday for being “wholly owned subsidiaries of Donald Trump.”  —  Jeffries discussed the bipartisan Senate negotiations … ",
    "url": "https://thehill.com/homenews/house/4447414-jeffries-house-republicans-wholly-own-subsidiaries-of-donald-trump/"
  },
  {
    "text": "Trump's team worries about a hollow victory in Nevada  —  Donald Trump is virtually assured of winning all 26 of the delegates available in Nevada's GOP caucuses Thursday, but his team is worried that the state's plan to hold a primary two days before the caucuses could wind up embarrassing the former president.",
    "url": "https://www.axios.com/2024/02/04/trump-team-worries-hollow-victory-nevada"
  }
]