[
  {
    "text": "Exclusive: FEMA staff confused after head said he was unaware of US hurricane season, sources say  —  Staff of the Federal Emergency Management Agency were left baffled on Monday after the head of the U.S. disaster agency said during a briefing that he had not been aware the country has a hurricane season … ",
    "url": "https://www.reuters.com/world/us/fema-staff-confused-after-head-said-he-was-unaware-us-hurricane-season-sources-2025-06-02/"
  },
  {
    "text": "Suspect in Colorado attack on Israeli hostage event charged with hate crime  —  Mohamed Sabry Soliman yelled “Free Palestine” as he used a makeshift flamethrower and tossed an incendiary device into the crowd in Colorado, authorities said.  —  BOULDER, Colorado — The man accused of using … ",
    "url": "https://www.washingtonpost.com/nation/2025/06/02/boulder-attack-suspect-charges-mohamed-soliman/"
  },
  {
    "text": "Musk Isn't “Gone” — and Tech Fascism Is Running Rampant  —  A chorus of media voices sang in unison this week, repeating in call-and-response fashion the tale of “Elon Musk leaving government,” implying that he would now return to “focusing on his companies,” presumably between hits of ketamine and Adderall.",
    "url": "https://america2.news/musk-isnt-gone-and-tech-fascism-is-running-rampant/"
  },
  {
    "text": "Ernst draws challenger after defending GOP megabill  —  State Rep. J.D. Scholten, who once challenged former Iowa Rep. Steve King, said: “I just felt, you know, I have to do this.”  —  After Sen. Joni Ernst (R-Iowa) told a town hall audience, “We're all going to die,” when responding … ",
    "url": "https://www.politico.com/news/2025/06/02/democrat-announces-run-against-joni-ernst-after-were-all-going-to-die-comments-00380630"
  },
  {
    "text": "Ernst's ‘we all are going to die’ quip underscores GOP's Medicaid challenge  —  The senator's sarcasm-tinged response to controversy complicates Republican efforts to downplay their bill's effects on Americans' Medicaid coverage.  —  As Senate Republicans return to work … ",
    "url": "https://www.washingtonpost.com/politics/2025/06/03/ernst-medicaid-cuts-republican-message/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ4OTIzMjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzUwMzA1NTk5LCJpYXQiOjE3NDg5MjMyMDAsImp0aSI6ImUyNmJiNzNhLTc2ZjQtNDk1ZS1hYWIxLThjMDcxYWZmZjQxMiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzA2LzAzL2VybnN0LW1lZGljYWlkLWN1dHMtcmVwdWJsaWNhbi1tZXNzYWdlLyJ9.o9Vz1l5dZJxpoSOFU-akrJdzsHp7n618BG-zqg9GFp0&itid=gfta"
  },
  {
    "text": "F.T.C. Investigates Ad Groups and Watchdogs, Alleging Boycott Collusion  —  The regulator is looking into whether roughly a dozen groups violated antitrust law by coordinating boycotts among advertisers.  —  The Federal Trade Commission is investigating whether roughly a dozen prominent advertising … ",
    "url": "https://www.nytimes.com/2025/06/02/technology/ftc-investigation-advertising-boycotts.html?unlocked_article_code=1.L08.Zm0E.vxArA9JuHVMK&smid=url-share"
  },
  {
    "text": "A 23-Year-Old Crypto Bro Is Now Vetoing NSF Grants While Staring At His Water Bottle  —  Picture this: You're a researcher who has spent years developing a grant proposal, gone through layers of expert review, and received National Science Foundation (NSF) approval.",
    "url": "https://www.techdirt.com/2025/06/02/a-23-year-old-crypto-bro-is-now-vetoing-nsf-grants-while-staring-at-his-water-bottle/"
  },
  {
    "text": "Putin's Whole Trump Strategy Is in Tatters After Epic Drone Humiliation  —  Vladimir Putin might have thought he had succeeded in persuading Donald Trump that the Ukrainians had already lost the war against Russia.  But an ingenious sneak attack targeting Putin's most prized military assets proves otherwise … ",
    "url": "https://www.thedailybeast.com/putins-whole-trump-strategy-is-in-tatters-after-epic-drone-humiliation/"
  },
  {
    "text": "A Stephen Miller Staffer and Tough Talk: Inside Trump's Latest Attack on Harvard  —  The Justice Department opened an investigation into the student-run Harvard Law Review.  The startling accusations show how the Trump administration is wielding power in pursuit of its political agenda.",
    "url": "https://www.nytimes.com/2025/06/02/us/politics/harvard-law-review-investigation-trump.html?unlocked_article_code=1.ME8.YbSg.pR0vHWIKDszN&smid=url-share"
  },
  {
    "text": "Trump threatens to eviscerate NASA  —  Betelgeuse and its environs.  Credit: Adam Block /Steward Observatory/University of Arizona  —  June 2, 2025 Issue #885  —  Subscribers want to explore the universe, and I'm happy to help  —  Proposed White House budget will destroy NASA",
    "url": "https://badastronomy.beehiiv.com/p/trump-threatens-to-eviscerate-nasa-cb96"
  },
  {
    "text": "Scoop: U.S. nuclear deal offer allows Iran to enrich uranium  —  The nuclear deal proposal the U.S. gave Iran on Saturday would allow limited low-level uranium enrichment on Iranian soil for a to-be-determined period of time, Axios has learned, contradicting public statements from top officials.",
    "url": "https://www.axios.com/2025/06/02/iran-nuclear-deal-proposal-enrich-uranium"
  },
  {
    "text": "Top Trump officials visit prolific Alaska oil field amid push to expand drilling  —  President Donald Trump wants to double the amount of oil coursing through Alaska's vast pipeline system and build a massive natural gas project as its “big, beautiful twin,” a top administration official … ",
    "url": "https://apnews.com/article/alaska-trump-energy-pipeline-oil-burgum-10e25f00ad75f9a5785bbd64cf39f4b1"
  },
  {
    "text": "The Secret History of Trump's Private Cellphone  —  This article was featured in the One Story to Read Today newsletter.  Sign up for it here.  —  Just before Election Day, a disturbing piece of information made its way to Donald Trump.  Whenever he takes or makes calls on his personal cellphone … ",
    "url": "https://www.theatlantic.com/politics/archive/2025/06/trump-private-cellphone-china-hackers/683006/?gift=201cWZnM2XBz2eP81zy0pIjBkWA8VK0NF-8HfVdQTTY&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Defying DeSantis, Florida Pride Marchers Light Up Jacksonville Bridge with Rainbow Colors  —  Erin In The Morning is a reader-supported publication.  To receive new posts and support my work, consider becoming a subscriber.  —  Last year, when Florida Governor Ron DeSantis issued a ban … ",
    "url": "https://www.erininthemorning.com/p/defying-desantis-florida-pride-marchers"
  },
  {
    "text": "Here's the latest.  —  The suspect is an Egyptian citizen who stayed in the United States after his tourist visa expired in 2023, an official said.  Eight people were injured in the attack in Boulder, Colo., on Sunday.  —  Here's the latest.  —  The suspect in the Boulder, Colo. … ",
    "url": "https://www.nytimes.com/live/2025/06/02/us/boulder-colorado-attack-suspect"
  },
  {
    "text": "Fifth partner leaves Paul Weiss to join new firm  —  REUTERS/Eddie Keogh Purchase Licensing Rights  —  Another partner has left law firm Paul, Weiss, Rifkind, Wharton and Garrison, joining Karen Dunn and others who split to launch their own firm late last month.",
    "url": "https://www.reuters.com/legal/legalindustry/fifth-partner-leaves-paul-weiss-join-new-firm-2025-06-02/"
  },
  {
    "text": "Tallying Trump's online posting frenzy: 2,262 ‘truths’ in 132 days  —  In his current term, the influencer-in-chief has left his own record for social media missives in the dust.  He posts day and night.  —  President Donald Trump is posting on the internet with a velocity and ferocity far beyond … ",
    "url": "https://www.washingtonpost.com/technology/2025/06/03/trump-truth-social-twitter/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ4OTIzMjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzUwMzA1NTk5LCJpYXQiOjE3NDg5MjMyMDAsImp0aSI6ImMyZGM5ZTU3LTU3ZTItNDVlYy1hNmEzLTNiZGMzNWE1OTkyMyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS90ZWNobm9sb2d5LzIwMjUvMDYvMDMvdHJ1bXAtdHJ1dGgtc29jaWFsLXR3aXR0ZXIvIn0.rORhiPW0vGkV0U1MFVkMqLgX6-lPdpwBBqR7mfNxd-M&itid=gfta"
  },
  {
    "text": "Records of dead people show how the pro-Trump spin machine keeps going  —  Supporters cite a prosaic DOGE announcement as evidence that a Social Security problem that never existed has been fixed. … — President Donald Trump, in a speech to Congress, March 4",
    "url": "https://www.washingtonpost.com/politics/2025/06/03/social-security-dead-trump-false/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ4OTIzMjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzUwMzA1NTk5LCJpYXQiOjE3NDg5MjMyMDAsImp0aSI6ImEwYjU2MjI5LTZiM2QtNDI2My1hNGM2LTRhZjgwNTVmMTA1YSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzA2LzAzL3NvY2lhbC1zZWN1cml0eS1kZWFkLXRydW1wLWZhbHNlLyJ9.3ufnr7v4D50l2c6VO9L-tPXFV0VsWLFQMzkefhwNRcE&itid=gfta"
  },
  {
    "text": "‘Needlessly reckless’: Local leaders, community condemn South Park ICE raids  —  A popular Italian restaurant in South Park is receiving an overwhelming outpouring of support from the community after U.S. Immigration and Customs Enforcement agents detained a handful of their employees Friday night in a surprise raid.",
    "url": "https://www.nbcsandiego.com/news/local/community-speaks-after-ice-raids-at-south-park-italian-restaurant/3837706/"
  },
  {
    "text": "MAGA Launches Bonkers Hunt to ‘Prove’ Biden Is a Robot Clone  —  Trump's Truth Social post sent MAGA into a frenzied hunt for “evidence” proving that Biden is a robot.",
    "url": "https://www.thedailybeast.com/crazy-proof-maga-believes-shows-biden-is-a-robot-clone/"
  },
  {
    "text": "Dupont Circle park to close during WorldPride, Park Service says  —  The Park Service statement says the request was made “based on a history and pattern of destructive and disorderly behavior from unpermitted activities happening in the park during past DC Pride weekends.”",
    "url": "https://www.washingtonpost.com/dc-md-va/2025/06/02/world-pride-dupont-circle-park-dc/"
  },
  {
    "text": "Justice Dept. Capitol Siege Section head Greg Rosen resigns, says Trump Jan. 6 pardons sent “terrible message”  —  The federal prosecutor who helped lead the largest federal criminal case in American history has resigned his position in the Justice Department.",
    "url": "https://www.cbsnews.com/news/justice-department-capitol-siege-section-greg-rosen-resigns/"
  },
  {
    "text": "Elon Musk's failure in government  —  His legacy will be to make reform even harder  —  When donald trump announced last November that Elon Musk would be heading a government-efficiency initiative, many of his fellow magnates were delighted.  The idea, wrote Shaun Maguire … ",
    "url": "https://www.economist.com/united-states/2025/06/02/elon-musks-failure-in-government"
  },
  {
    "text": "Exclusive: US pushes countries for best offers by Wednesday as tariff deadline looms  —  The Trump administration wants countries to provide their best offer on trade negotiations by Wednesday as officials seek to accelerate talks with multiple partners ahead of a self-imposed deadline in just five weeks … ",
    "url": "https://www.reuters.com/business/us-pushes-countries-best-offers-by-wednesday-tariff-deadline-looms-2025-06-02/"
  },
  {
    "text": "Trump admin can't avoid First Amendment trial on student protesters  —  Find out the breaking legal news in real time, right in your inbox.  —  Upgrade now!  —  The Trump administration failed on Monday in its effort to avert a trial next month to determine whether a federal judge … ",
    "url": "https://www.allrisenews.com/p/aaup-rubio-trial"
  },
  {
    "text": "Curtis Yarvin's Plot Against America  —  The reactionary blogger's call for a monarch to rule the country once seemed like a joke.  Now the right is ready to bend the knee.  —  In the spring and summer of 2008, when Donald Trump was still a registered Democrat, an anonymous blogger known … ",
    "url": "https://www.newyorker.com/magazine/2025/06/09/curtis-yarvin-profile?currentPage=all"
  },
  {
    "text": "Teachers Are Not OK  —  Last month, I wrote an article about how schools were not prepared for ChatGPT and other generative AI tools, based on thousands of pages of public records I obtained from when ChatGPT was first released.  As part of that article, I asked teachers to tell me how AI has changed how they teach.",
    "url": "https://www.404media.co/teachers-are-not-ok-ai-chatgpt/"
  },
  {
    "text": "Regulation or Repression?  How the Right Hijacked the DSA Debate  —  The conversion of a disinformation code from self-regulation to requirement sparks an international tiff.  What's really happening?  —  noupside.bsky.social  —  Meet The Authors",
    "url": "https://www.lawfaremedia.org/article/regulation-or-repression--how-the-right-hijacked-the-dsa-debate"
  },
  {
    "text": "Rubio leading negotiations with Bukele on returning migrants  —  The Justice Department disclosed that Secretary of State Marco Rubio is leading negotiations for the return of a Venezuelan man sent to a Salvadoran prison.  —  The disclosure, made in Monday court filings … ",
    "url": "https://thehill.com/policy/defense/5329609-rubio-leading-negotiations-with-bukele-on-returning-migrants/"
  },
  {
    "text": "All international travelers should get measles vaccinations, CDC says  —  U.S. health officials have changed their advice to international travelers about measles, saying that Americans should be vaccinated against the virus no matter where they're going.  U.S. residents are recommended to get measles-mumps-rubella shots, anyway.",
    "url": "https://apnews.com/article/measles-international-travel-vaccine-980fdb9fcf8522fed01d23427eba4429"
  },
  {
    "text": "Trump, Xi likely to discuss trade soon: Bessent  —  President Trump and Chinese President Xi Jinping will likely talk about trade “soon” amid trade tensions between the two countries, Treasury Secretary Scott Bessent said Sunday.  —  Bessent said during a Sunday interview on CBS's … ",
    "url": "https://thehill.com/homenews/administration/5327788-trump-xi-talks-trade-minerals/"
  },
  {
    "text": "Time To Dust Off The Authoritarian Regime Survival Guide  —  In 2017, Polish activist Martin Mycielski offered advice on Twitter—hashtagged #LearnFromEurope—that eventually became a guide for dealing with fascism.  —  The Big Picture and Amelia Mavis Christnot  —  ∙ Paid",
    "url": "https://thinkbigpicture.substack.com/p/trump-2025-authoritarian-regime-survival"
  }
]