[
  {
    "text": "How the Trump Campaign Ran With Rumors About Pet-Eating Migrants—After Being Told They Weren't True  —  Springfield, Ohio, city officials were contacted by Vance's team and said the claims were baseless.  It didn't matter and now the town is in chaos.  —  SPRINGFIELD, Ohio … ",
    "url": "https://www.wsj.com/us-news/springfield-ohio-pet-eating-claims-haitian-migrants-04598d48"
  },
  {
    "text": "JD Vance got a former professor to delete a blog post Vance wrote in 2012 attacking GOP over anti-immigrant rhetoric  —  A week after President Barack Obama won reelection in November 2012, JD Vance, then a law student at Yale, wrote a scathing rebuke of the Republican Party's stance on migrants … ",
    "url": "https://www.cnn.com/2024/09/17/politics/jd-vance-delete-2012-blog-post-attacking-gop-anti-immigrant-rhetoric/"
  },
  {
    "text": "JD Vance Makes Light of Actual Foreign Interference in His State  —  At a press conference on Ohio's efforts to respond to the chaos created in Springfield by a slew of bomb threats, Governor Mike DeWine revealed that a number of the bomb threats came from “one particular country” overseas.  —  Video",
    "url": "https://www.emptywheel.net/2024/09/18/jd-vance-makes-light-of-actual-foreign-interference-in-his-state/"
  },
  {
    "text": "Hezbollah hit by a wave of exploding pagers and blames Israel.  At least 9 dead, thousands injured … Pagers used by hundreds of members of the militant group Hezbollah exploded near simultaneously in Lebanon and Syria on Tuesday, killing at least nine people — including an 8-year-old girl … ",
    "url": "https://apnews.com/article/lebanon-hezbollah-israel-exploding-pagers-8893a09816410959b6fe94aec124461b"
  },
  {
    "text": "Johnson's colleagues baffled by his shutdown strategy … - “I don't know how he thinks it's going to pass ... where are the votes coming from?” said Rep. Troy Nehls (R-Texas).  — Another House Republican, speaking on the condition of anonymity, called Johnson's plan “puzzling” … ",
    "url": "https://www.axios.com/2024/09/18/johnsons-colleagues-baffled-by-his-shutdown-strategy"
  },
  {
    "text": "Over 100 Republican National Security Leaders Endorse Vice President Harris  —  Donald Trump cannot be trusted “to support and defend the Constitution of the United States against all enemies, foreign and domestic . . . and bear true faith and allegiance to the same.",
    "url": "https://rbmralumni4harris.substack.com/p/over-100-republican-national-security"
  },
  {
    "text": "111 Former G.O.P. Officials Back Harris, Calling Trump ‘Unfit to Serve’  —  The signatories of a letter endorsing the Democratic vice president included former members of Congress, defense secretaries, C.I.A. directors and other national security officials.  —  More than 100 former national … ",
    "url": "https://www.nytimes.com/2024/09/18/us/politics/republican-officials-harris-endorsement.html"
  },
  {
    "text": "Russia propaganda group behind fake Kamala Harris hit-and-run story, says Microsoft  —  Microsoft researchers found that the group created a video, paid an actor to appear as the alleged victim, and spread the claim through a fake website  —  A false claim circulating on social media … ",
    "url": "https://www.theguardian.com/us-news/2024/sep/18/kamala-harris-fake-hit-run-story-russia-propaganda-storm-1516"
  },
  {
    "text": "Scripps News/Ipsos poll: Majority supports mass deportation of undocumented immigrants  —  The poll also showcases major partisan divides between voters on how to address one of the biggest topics of the presidential race: immigration.  —  A majority of Americans support the mass deportation … ",
    "url": "https://www.scrippsnews.com/politics/path-to-the-white-house/scripps-news-ipsos-poll-majority-supports-mass-deportation-of-undocumented-immigrants"
  },
  {
    "text": "The Miles Davis of Tax Policy  —  Trump's just making it up on the fly.  —  Leading the news this morning: Melania Trump's latest video hawking her forthcoming memoir.  “Why do I stand proudly behind my nude modeling work?” the former first lady asks over a string soundtrack.",
    "url": "https://www.thebulwark.com/p/the-miles-davis-of-tax-policy"
  },
  {
    "text": "Trump traps Senate GOP with flip-flop on taxes … - They'll have to harmonize their own positions — in real time — with a president who is constantly changing his.  —  Trump posted he would “get SALT back.”  — That's a strong indication he wants to let those in high-tax states deduct … ",
    "url": "https://www.axios.com/2024/09/18/trump-salt-tax-cuts-senate"
  },
  {
    "text": "AJC poll finds Kamala Harris and Donald Trump are locked in a tight race in Georgia  —  The race has tightened since the AJC's poll in June when the former president held a 5-point lead over President Joe Biden.  —  Vice President Kamala Harris and former President Donald Trump are locked … ",
    "url": "https://www.ajc.com/politics/ajc-poll-finds-kamala-harris-and-donald-trump-are-locked-in-a-tight-race-in-georgia/C5CQ6742V5AHVIDUVQ77LQ7YMY/"
  },
  {
    "text": "The FBI is investigating suspicious packages sent to election officials in more than 15 states  —  The FBI and the U.S. Postal Inspection Service on Tuesday were investigating the origin of suspicious packages that have been sent to or received by elections officials in more than 15 states … ",
    "url": "https://apnews.com/article/elections-workers-security-suspicious-packages-e3400b1e86bc02f7345d9970ef356bec"
  },
  {
    "text": "Network of Georgia election officials strategizing to undermine 2024 result  —  Emails reveal Georgia Election Integrity Coalition, a group of officials and election deniers, coordinating in swing state  —  The fight for democracy is supported by  —  Emails obtained by the Guardian reveal … ",
    "url": "https://www.theguardian.com/us-news/2024/sep/18/trump-election-georgia"
  },
  {
    "text": "Trump's delusional debate spin speaks volumes  —  The contrast with Biden is telling. … Kamala Harris clobbered Donald Trump during their first (and likely only) presidential debate on September 10.  She humiliated him by smirking and laughing at his offensive buffoonery.",
    "url": "https://www.publicnotice.co/p/trump-debate-spin-kamala-harris"
  },
  {
    "text": "A new government report reveals the fundamental flaw in the American economy  —  A little-noticed report by the non-partisan Congressional Budget Office (CBO) released this month reveals why, for most Americans, the economy is broken.  The report focuses on the American economy from 2019 to 2021.",
    "url": "https://popular.info/p/a-new-government-report-reveals-the"
  },
  {
    "text": "Afraid to Seek Care Amid Georgia's Abortion Ban, She Stayed at Home and Died  —  Candi Miller's family said she didn't visit a doctor “due to the current legislation on pregnancies and abortions.”  Maternal health experts deemed her death preventable and blamed Georgia's abortion ban.",
    "url": "https://www.propublica.org/article/candi-miller-abortion-ban-death-georgia"
  },
  {
    "text": "Now a Roe advocate, woman raped by stepfather as a child tells her story in Harris campaign ad  —  A 22-year-old woman who became an abortion rights advocate after she was raped by her stepfather as a child tells her story in a new campaign ad for Democratic presidential nominee Kamala Harris.",
    "url": "https://apnews.com/article/harris-abortion-campaign-ad-roe-hadley-duvall-cdb874e7c3e7fe12fb1bfb95d06e907f"
  },
  {
    "text": "NPR Exclusive: U.S. overdose deaths plummet, saving thousands of lives  —  For the first time in decades, public health data shows a sudden and hopeful drop in drug overdose deaths across the U.S.  —  “This is exciting,” said Dr. Nora Volkow, head of the National Institute On Drug Abuse … ",
    "url": "https://www.npr.org/2024/09/18/nx-s1-5107417/overdose-fatal-fentanyl-death-opioid"
  },
  {
    "text": "Judge Who Tossed Trump's Docs Case Repeatedly Violated Disclosure Rule: Report  —  Florida Judge Aileen Cannon failed to disclose lavish trips hosted by influential conservative law school  —  FLORIDA DISTRICT COURT Judge Aileen Cannon failed to disclose her attendance at several right-wing … ",
    "url": "https://www.rollingstone.com/politics/politics-news/aileen-cannon-disclosure-reports-trips-1235104678/"
  }
]