[
  {
    "text": "The Alitos, the Neighborhood Clash and the Upside-Down Flag  —  Inside the escalating conflict on a bucolic suburban street that Justice Alito said prompted a “Stop the Steal” symbol at his home.  —  The police in Fairfax County, Va., received an unusual phone call on Feb. 15, 2021.",
    "url": "https://www.nytimes.com/2024/05/28/us/justice-alito-neighbors-stop-steal-flag.html"
  },
  {
    "text": "Trump stuns donors with behind-closed-doors rant about bombing Russia and China: report  —  Former President Donald Trump told a recent group of donors at a fundraising event that he would have bombed Russia and China in response to their aggression against U.S. allies, reportedThe Washington Post on Tuesday.",
    "url": "https://www.rawstory.com/trump-donors-2668393354/"
  },
  {
    "text": "“Full panic mode”: Experts say Trump mad he's “finally being treated like any other defendant”  —  Trump on Truth Social complained that the rules in his trial are the same as “virtually every criminal court”  —  Donald Trump is not behaving like someone who expects to be found “not guilty.”",
    "url": "https://www.salon.com/2024/05/28/full-panic-mode-experts-say-mad-hes-finally-being-treated-like-any-other-defendant/"
  },
  {
    "text": "Emerging Portrait of Judge in Trump Documents Case: Prepared, Prickly and Slow  —  Judge Aileen Cannon's handling of court hearings offers insights into how the case accusing Donald Trump of illegally retaining classified material has become bogged down in unresolved issues.",
    "url": "https://www.nytimes.com/2024/05/29/us/politics/trump-documents-judge-aileen-cannon.html"
  },
  {
    "text": "Republican member of Fulton elections board won't certify primary results  —  Her lawsuit seeks detailed voting data and a ruling that her duties are discretionary  —  A Republican member of the Fulton County elections board refuses to certify primary election results unless given access … ",
    "url": "https://www.ajc.com/news/atlanta-news/republican-member-of-fulton-elections-board-wont-certify-primary-results/IDYT7CZVMZAJXHDAADS7G6JNT4/"
  },
  {
    "text": "Steinglass pokes hole in defense's argument around National Enquirer  —  Steinglass makes a very good point about the Dino Sajuddin story and corresponding payment.  —  Sajuddin is the former Trump Tower doorman who claims Trump fathered a child out of wedlock, a claim the former president has denied.",
    "url": "https://www.nbcnews.com/politics/donald-trump/live-blog/trump-trial-live-updates-closing-statements-hush-money-case-rcna153996/rcrd42325?canonicalCard=true"
  },
  {
    "text": "Florida civics training links “cancel culture” to mass murder  —  The Florida Department of Education's civics training does not just train educators to teach Christian nationalism.  The same program also includes a section on Communism's legacy.  This has been a priority of Governor Ron DeSantis (R).",
    "url": "https://popular.info/p/florida-civics-training-links-cancel"
  },
  {
    "text": "U.S. Coast Guard: Man Dies After Jumping Off World's Largest Cruise Ship  —  Authorities said a passenger died after allegedly leaping from the world's largest cruise ship on Sunday during a journey from Florida to Honduras.  —  The vessel the man went overboard from was identified … ",
    "url": "https://www.breitbart.com/local/2024/05/28/u-s-coast-guard-man-dies-jumping-off-worlds-largest-cruise-ship/"
  },
  {
    "text": "What you need to know about Trump's trial before the verdict  —  The defense really struggled.  But all it takes is one juror. … After six wild weeks and innumerable citations of Jonathan Turley, Donald Trump's criminal trial in New York is finally coming to an end.",
    "url": "https://www.publicnotice.co/p/trump-new-york-criminal-trial-recap"
  },
  {
    "text": "Playbook: All politics is legal  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  JUST POSTED — “Democrats Plan $100 Million Push on Abortion Rights to Win House,” by WSJ's Natalie Andrews: “In a memo to donors, the House Majority PAC outlined … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/05/29/all-politics-is-legal-00160338"
  },
  {
    "text": "FBI arrests ‘dreaded’ Jan. 6 defendant they say rammed ‘Trump’ sign into police line  —  William George Knight shoved an officer during the Capitol attack, the FBI said, after “ramming” a giant metal-framed “TRUMP” sign into police officers at the Capitol.  —  WASHINGTON — A Jan. 6 participant … ",
    "url": "https://www.nbcnews.com/politics/justice-department/fbi-arrests-dreaded-jan-6-defendant-say-rammed-trump-sign-police-line-rcna154374"
  },
  {
    "text": "US pier constructed off Gaza has broken apart  —  The temporary pier constructed by the US military to transport aid into Gaza broke apart and sustained damage in heavy seas on Tuesday in a major blow to the American-led effort to create a maritime corridor for humanitarian supplies into the war-torn enclave, the Pentagon said.",
    "url": "https://www.cnn.com/2024/05/28/politics/us-gaza-pier-broken-apart/"
  },
  {
    "text": "The slaughter in Rafah and Israel's moral nadir  —  Israel is massacring Palestinians — and undermining its own security in the process. … The carnage was horrific even by the bloody standards set by Israel's war: An emergency doctor on the ground told NPR that it was … ",
    "url": "https://www.vox.com/world-politics/351968/the-slaughter-in-rafah-and-israels-moral-nadir"
  },
  {
    "text": "Appeals court upholds retired NYPD officer's 10-year prison sentence for Capitol riot attack  —  A federal appeals court on Tuesday upheld a retired New York Police Department officer's conviction and 10-year prison sentence for assaulting a police officer during the Jan. 6, 2021, siege at the U.S. Capitol.",
    "url": "https://apnews.com/article/thomas-webster-new-york-police-officer-capitol-riot-aa0448b1995618059b299c27be519457"
  },
  {
    "text": "Trump Endorses GOP Opponent of Top House Conservative Bob Good  — Congressman backed DeSantis early in GOP presidential contest  — Good and his challenger both showed support for Trump at trial  —  Donald Trump on Tuesday endorsed the primary opponent of Representative Bob Good … ",
    "url": "https://www.bloomberg.com/news/articles/2024-05-29/trump-endorses-gop-opponent-of-top-house-conservative-bob-good"
  },
  {
    "text": "Nikki Haley Writes ‘Finish Them!’ on Israeli Bomb After Refugee Massacre  —  The former UN Ambassador and failed presidential candidate toured areas ravaged byHamas' Oct. 7 attack  —  DAYS AFTER DOZENS of Palestinians were killed by Israeli air strikes against displacement camps in Southern Gaza … ",
    "url": "https://www.rollingstone.com/politics/politics-news/nikki-haley-finish-them-bomb-israel-gaza-1235028702/"
  },
  {
    "text": "The media and sullen nonvoters should listen to Ken Burns  —  The historian knows something about civil war — and moral responsibility in politics.  —  A skilled graduation speaker who poetically delivers life lessons and imparts insightful advice can leave me teary-eyed.",
    "url": "https://www.washingtonpost.com/opinions/2024/05/28/ken-burns-graduation-election-trump/"
  },
  {
    "text": "Marco Rubio Wants to Be Trump's Vice President.  He Doesn't Want to Audition.  —  The last time the Florida senator lived in Donald J. Trump's orbit he was mocked and defeated.  As he returns, he's trying to do it on his terms.  —  Senator Marco Rubio, the Republican of Florida … ",
    "url": "https://www.nytimes.com/2024/05/28/us/politics/marco-rubio-trump-vp.html"
  },
  {
    "text": "Texas House Speaker Survives Challenge From Hard Right  —  Dade Phelan, the speaker of the Texas House, defeated a party activist and first-time candidate backed by former President Donald J. Trump in a bitter contest.  —  The speaker of the Texas House, Dade Phelan, won renomination in a runoff on Tuesday … ",
    "url": "https://www.nytimes.com/2024/05/28/us/politics/phelan-texas-house-speaker-runoff.html"
  },
  {
    "text": "Ohio House agrees to Biden ballot fix compromise if ‘anti-democratic’ Senate provisions removed  —  President Joe Biden delivers the State of the Union address during a joint meeting of Congress in the House chamber at the U.S. Capitol on Thursday, March 7, 2024, in Washington, DC.",
    "url": "https://ohiocapitaljournal.com/2024/05/28/ohio-house-agrees-to-biden-ballot-fix-compromise-if-anti-democratic-senate-provisions-removed/"
  }
]