[
  {
    "text": "Justice Thomas Did Not Disclose Additional Trips, Democrats Say  —  The revelation was included in a report by Democratic staff members on the Senate Judiciary Committee who had conducted a 20-month investigation into ethics practices at the Supreme Court.  —  Justice Clarence Thomas failed … ",
    "url": "https://www.nytimes.com/2024/12/21/us/politics/clarence-thomas-trips-disclosure-investigation.html?unlocked_article_code=1.jE4.NCNP.unHbe2UnoEuT&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "New ethics inquiry details more trips by Clarence Thomas paid for by wealthy benefactors  —  Investigation by Senate Democrats found that Thomas accepted gifts and travel worth more than $4.75m since 1991  —  A nearly two-year investigation by Democratic senators of supreme court ethics details … ",
    "url": "https://www.theguardian.com/us-news/2024/dec/21/ethics-inquiry-supreme-court"
  },
  {
    "text": "Live updates: Biden signs funding bill; Questions move to Johnson  —  President Biden has signed legislation passed by Congress on Friday to prevent a government shutdown, as qustions shift to Speaker Mike Johnson's future.  —  The government-funding legislation was approved … ",
    "url": "https://thehill.com/homenews/house/5051942-live-updates-government-shutdown-congress-trump/"
  },
  {
    "text": "Mike Johnson concludes the 118th Congress as it began — in chaos  —  A historically unproductive Congress ends with the House speaker battling to keep his job amid an ungovernable majority.  —  The 118th Congress ended almost exactly as it began: with chaos in the House of Representatives … ",
    "url": "https://www.washingtonpost.com/politics/2024/12/21/mike-johnson-concludes-118th-congress-it-began-chaos/"
  },
  {
    "text": "Biden signs government funding bill, averting shutdown crisis  —  The move formally ends the impending shutdown crisis after Congress passed the bill.  —  WASHINGTON — President Joe Biden signed a government funding bill on Saturday, formally averting a shutdown crisis after Congress passed the bill.",
    "url": "https://www.nbcnews.com/politics/white-house/biden-signs-government-funding-bill-averting-shutdown-rcna185114"
  },
  {
    "text": "Private messages detail an alleged campaign to tarnish Blake Lively after she accused Justin Baldoni of misconduct on the set of “It Ends With Us.”  —  Last summer, as the release of “It Ends With Us” approached, Justin Baldoni, the director and a star of the film, and Jamey Heath … ",
    "url": "https://www.nytimes.com/2024/12/21/business/media/blake-lively-justin-baldoni-it-ends-with-us.html?unlocked_article_code=1.jE4.yE_4._RPuitPEWM2c&smid=nytcore-ios-share&referringSource=articleShare&tgrp=ctr"
  },
  {
    "text": "Biden secures 235th confirmed judicial appointee, one more than Trump  —  Democratic U.S. President Joe Biden secured his 235th appointment to the federal judiciary on Friday, narrowly surpassing President-elect Donald Trump's first-term tally by one with a record number of women and people of color named to the bench.",
    "url": "https://www.reuters.com/world/us/biden-secures-235th-confirmed-judicial-appointee-one-more-than-trump-2024-12-21/"
  },
  {
    "text": "Senate approves bill to expand Social Security to millions of Americans  —  Legislation to expand Social Security benefits to millions of Americans passed the U.S. Senate early Saturday and is now headed to the desk of President Biden, who is expected to sign the measure into law.",
    "url": "https://www.cbsnews.com/news/social-security-fairness-act-senate-vote-passed/"
  },
  {
    "text": "NYPD's top cop Jeffrey Maddrey abruptly resigns after allegedly demanding underling perform sexual favors — including ‘kiss his penis’ — in exchange for overtime  —  The NYPD's highest-ranking uniformed officer abruptly resigned late Friday night after The Post uncovered explosive allegations … ",
    "url": "https://nypost.com/2024/12/21/us-news/nypds-top-cop-jeffrey-maddrey-abruptly-resigns-after-allegedly-demanding-underling-perform-sexual-favors-in-exchange-for-overtime/"
  },
  {
    "text": "Trump's ‘stunningly unqualified’ diplomatic team shapes up at breakneck speed  —  Trump is hardly the first US president to introduce miscast nominees, but he has nominated ambassadors at a rate not recalled in recent memory  —  They seem an unlikely, almost motley, crew of emissaries.",
    "url": "https://www.theguardian.com/us-news/2024/dec/21/trump-team-cabinet"
  },
  {
    "text": "A Win for the Vibecession Story  —  Guess what?  Popular economic narratives aren't reliable  —  Still experimenting with this newsletter.  My original plan was to write most weekdays and take weekends off.  But there's so much to write about!  So I will sometimes put up relatively brief … ",
    "url": "https://paulkrugman.substack.com/p/a-win-for-the-vibecession-story"
  },
  {
    "text": "He's anti-democracy and pro-Trump: the obscure ‘dark enlightenment’ blogger influencing the next US administration  —  Key figures in the incoming administration follow Curtis Yarvin, who's pushing for an autocratic takeover of the US  —  Curtis Yarvin is hardly a household name in US politics.",
    "url": "https://www.theguardian.com/us-news/2024/dec/21/curtis-yarvin-trump"
  },
  {
    "text": "Senile Biden's insult to families of Marines murdered in disastrous Afghan withdrawal  —  Joe Biden kept the grieving relatives of the Marines killed in Afghanistan waiting for three hours while he napped on Air Force One on the tarmac before a dignified transfer, multiple military families have told Daily Mail.",
    "url": "https://www.dailymail.co.uk/news/article-14210847/biden-insult-senile-health-coverup-marine-families-afghanistan.html"
  },
  {
    "text": "Trump outlines slate of appointments less than a month from Inauguration Day  —  President-elect Donald Trump announced a slate of new appointees to his administration on Saturday, less than one month before he is to be sworn into office on January 20 next year.",
    "url": "https://www.washingtonexaminer.com/news/white-house/3268199/trump-outlines-slate-of-appointments-less-than-a-month-from-inauguration-day/"
  },
  {
    "text": "Outrage as Elon Musk claims ‘only AfD can save Germany’  —  German health minister calls US billionaire's intervention weeks before election ‘undignified and problematic’  —  Elon Musk has caused outrage in Berlin after appearing to endorse the far-right, anti-immigrant Alternative für Deutschland.",
    "url": "https://www.theguardian.com/world/2024/dec/20/elon-musk-claims-only-afd-can-save-germany"
  },
  {
    "text": "Scoop: Jeffries' plan to kill the debt ceiling forever … - Republicans have a significant bloc of debt and deficit hawks who will likely vote against raising the debt ceiling under any circumstances.  — That gives the Democratic leader considerable leverage to use the debt limit to force concessions.",
    "url": "https://www.axios.com/2024/12/20/hakeem-jeffries-trump-abolish-debt-ceiling"
  }
]