[
  {
    "text": "Supreme Court rules Trump cannot be kicked off ballot  —  The decision swiftly ended the legal fight over whether states could bar Trump from state ballots based on the Constitution's 14th Amendment.  —  WASHINGTON — The Supreme Court on Monday handed a sweeping win to former President Donald Trump … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-rules-trump-cannot-kicked-colorado-ballot-rcna132291"
  },
  {
    "text": "Supreme Court keeps Trump on ballot, rejects Colorado voter challenge  —  Decision comes a day before Super Tuesday and as justices weigh other key cases affecting Donald Trump  —  The Supreme Court on Monday unanimously sided with Donald Trump, allowing the former president to remain … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/04/supreme-court-trump-ballot-decision/"
  },
  {
    "text": "The institutions of government aren't going to protect democracy  —  There is no real question about the intent of the riot at the Capitol on Jan. 6, 2021.  —  Donald Trump made clear his interest in undermining the results of the 2020 election for months beforehand, sowing misleading … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/04/trump-ballot-supreme-court-ruling/"
  },
  {
    "text": "Joe Biden's Last Campaign  —  Trailing Trump in polls and facing doubts about his age, the President voices defiant confidence in his prospects for reëlection.  —  “I'll show you where Trump sat and watched the revolution,” Joe Biden said, stepping out from behind his desk in the Oval Office.",
    "url": "https://www.newyorker.com/magazine/2024/03/11/joe-bidens-last-campaign?currentPage=all"
  },
  {
    "text": "What the Information Operation about Joe Biden's Age Looks Like  —  One reason Joe Biden is behind in the polls, I'm fairly convinced, is because Democrats relentlessly participate in an organized campaign to use Biden's age to dehumanize him.  —  Whether it involves making reasonable critiques … ",
    "url": "https://www.emptywheel.net/2024/03/04/what-the-information-operation-about-joe-bidens-age-looks-like/"
  },
  {
    "text": "No Matter Race, Age or Gender, More Voters Say Trump's Policies Helped Than Biden's  —  Times/Siena polls highlight how comparatively well-regarded Donald J. Trump's policies are, even by groups that were affected by policies that Democrats hope will be motivating issues in 2024.",
    "url": "https://www.nytimes.com/2024/03/04/us/politics/trump-biden-policies-help-hurt.html"
  },
  {
    "text": "Key Figure in Trump's Business Pleads Guilty to Felony Perjury  —  Allen H. Weisselberg, the former Trump Organization finance chief, has already spent time at the Rikers Island jail complex.  The perjury plea will send him back.  —  Allen H. Weisselberg, a longtime lieutenant … ",
    "url": "https://www.nytimes.com/2024/03/04/nyregion/weisselberg-guilty-trump-business.html"
  },
  {
    "text": "Former Trump CFO Allen Weisselberg pleads guilty to perjury in ex-president's civil fraud case  —  Allen Weisselberg, the former chief financial officer of Donald Trump's company, pleaded guilty Monday in New York to perjury in connection with testimony he gave in the ex-president's civil fraud case.",
    "url": "https://apnews.com/article/trump-fraud-weisselberg-perjury-0101a9972cefd1e1fb4ba6d36e69fecb"
  },
  {
    "text": "Wisconsin: Settlement shows Trump lawyers made fake electors plan  —  Two attorneys for then-President Donald Trump orchestrated a plan for fake electors to file paperwork falsely saying the Republican won Wisconsin in a strategy to overturn Joe Biden's 2020 victory there and in other swing states … ",
    "url": "https://apnews.com/article/electors-trump-settlement-ballot-2020-wisconsin-f416cd04adfa9f92c382b7c9e8a94ce7"
  },
  {
    "text": "Pro-Trump lawyers central to alternate-elector plot settle Wisconsin lawsuit  —  Two attorneys who advanced a strategy to try to overturn the 2020 presidential election by organizing rosters of Republicans to falsely portray Donald Trump as the winner of several states, have reached … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/04/wisconsin-trump-fake-electors-chesebro-troupis-settlement/"
  },
  {
    "text": "Trump supporters target black voters with faked AI images  —  Donald Trump supporters have been creating and sharing AI-generated fake images of black voters to encourage African Americans to vote Republican.  —  BBC Panorama discovered dozens of deepfakes portraying black people as supporting the former president.",
    "url": "https://www.bbc.com/news/world-us-canada-68440150"
  },
  {
    "text": "AI-generated images of Trump with Black voters being spread by supporters  —  No evidence to tie fake images, including one created by Florida radio host, to Trump campaign, BBC Panorama investigation finds  —  Dozens of fake, artificial intelligence-generated photos showing Donald Trump … ",
    "url": "https://www.theguardian.com/us-news/2024/mar/04/trump-ai-generated-images-black-voters"
  },
  {
    "text": "Opill, first over-the-counter birth control pill, will go on sale later this month  —  The pill was cleared by the FDA for use without a prescription last July.  —  Opill a daily oral contraceptive.  —  Opill, the first over-the-counter birth control pill that can be purchased without a prescription … ",
    "url": "https://abcnews.go.com/Health/opill-counter-birth-control-pill-sale-month/story?id=107775263"
  },
  {
    "text": "JetBlue Airways and Spirit Airlines Call Off Merger Deal  —  A federal judge ruled against the $3.8 billion deal in January, siding with antitrust enforcers  —  JetBlue Airways and Spirit Airlines terminated their merger agreement, weeks after a judge ruled that the $3.8 billion deal … ",
    "url": "https://www.wsj.com/business/earnings/jetblue-airways-scraps-3-8-billion-takeover-of-spirit-airlines-e1d014b0"
  },
  {
    "text": "Trump's White House Was ‘Awash in Speed’ — and Xanax  —  Under Trump, the White House Medical Unit was “like the Wild West,” and staffers had easy access to powerful stimulants and sedatives, sources tell Rolling Stone  —  IF YOU EVER looked at the actions of the Trump White House and wondered, ‘Are they on drugs?’",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-white-house-drugs-speed-xanax-1234979503/"
  },
  {
    "text": "Philly LGBT Affairs executive director yells, ‘I work for the mayor,’ as she films her and her husband's arrest  —  Philadelphia's head of LGBT affairs and her husband were arrested by a state trooper Saturday, in what the mayor is calling a “very concerning,” interaction … ",
    "url": "https://www.cnn.com/2024/03/03/us/philadephia-lgbt-affairs-arrest-footage/"
  },
  {
    "text": "France becomes first country to explicitly enshrine abortion rights in constitution  —  PARIS — With the endorsement of a specially convened session of lawmakers at Versailles, France on Monday became the first country in the world to explicitly enshrine abortion rights in its constitution … ",
    "url": "https://www.washingtonpost.com/world/2024/03/04/france-abortion-constitution/"
  },
  {
    "text": "Lauren Boebert was busy working out if her ex had thrown her stuff into a pond as her manager spoke at a campaign event, report says  — Lauren Boebert did not attend a campaign event at a Colorado coffee shop last month.  — Boebert traveled to her home in another district to find out if her ex had discarded her belongings.",
    "url": "https://www.businessinsider.com/lauren-boebert-skipped-campaign-event-ex-threw-stuff-into-pond-2024-3"
  },
  {
    "text": "Fox News Stars Flip Out When Reminded That Trump ‘Had Dinner With Nazis’  —  Fox pundit Tammy Bruce complained that a Democratic guest was labeling most Republicans as Nazis and racist Harris Faulkner scolded him before going to commercial break.  —  Fox News anchor Harris Faulkner … ",
    "url": "https://www.thedailybeast.com/fox-news-stars-flip-out-when-reminded-that-trump-had-dinner-with-nazis"
  }
]