[
  {
    "text": "Trump's Net Worth Hits $6.5 Billion, Making Him One of World's 500 Richest People  — Former president joins Bloomberg's list of 500 richest people  — Trump Media merger adds billions of dollars to paper fortune  —  Trump Bond Cut to $175 Million Amid Appeal of NY Fine",
    "url": "https://www.bloomberg.com/news/articles/2024-03-25/donald-trump-6-4-billion-net-worth-makes-him-one-of-world-s-richest-people"
  },
  {
    "text": "Team Biden Roasts ‘Feeble, Confused, Tired’ Trump After Unhinged Presser  —  The president has been going after his presumptive 2024 opponent with a little more venom than usual … The president's campaign responded to Trump's wild press conference in New York on Monday by slamming the former president as … ",
    "url": "https://www.rollingstone.com/politics/politics-news/biden-campaign-roasts-feeble-confused-tired-trump-1234994066/"
  },
  {
    "text": "No One Is Above the Law, Except, Apparently, Donald Trump  —  As the week began, it looked as though Donald Trump would finally face consequences — or at least, a consequence — for his actions.  —  Last month, a New York state trial court found the former president liable for inflating … ",
    "url": "https://www.nytimes.com/2024/03/26/opinion/trump-trials-bond-invincibility.html"
  },
  {
    "text": "Billionaires sought to help fund Trump bond in civil fraud case, sources say  —  Some major Republican donors were working together to help U.S. presidential candidate Donald Trump fund the original bond amount needed to cover his $454 million civil fraud judgment ahead of Monday's deadline … ",
    "url": "https://www.reuters.com/world/us/billionaires-sought-help-fund-trump-bond-civil-fraud-case-sources-say-2024-03-26/"
  },
  {
    "text": "Key Bridge collapses into Patapsco River in Baltimore after vessel hits support column; state of emergency declared  —  Baltimore's Francis Scott Key Bridge collapsed early Tuesday morning after a support column was struck by a container ship, sending at least seven cars into the Patapsco River … ",
    "url": "https://www.baltimoresun.com/2024/03/26/key-bridge-collapses-into-patapsco/"
  },
  {
    "text": "Cargo ship hits Baltimore's Key Bridge, bringing it down.  Rescuers are looking for people in water  —  Watch live views from Baltimore where a major bridge snapped and collapsed after a container ship rammed into it early Tuesday, and several vehicles fell into the river below.",
    "url": "https://apnews.com/article/baltimore-bridge-collapse-53169b379820032f832de4016c655d1b"
  },
  {
    "text": "Ohio man gets 2.5 years in prison for death threats made in 2022 to Arizona's top election official  —  An Ohio man who acknowledged making death threats in voicemails left for then-Arizona Secretary of State Katie Hobbs during the 2022 election season was sentenced Monday to 2 1/2 years in prison.",
    "url": "https://apnews.com/article/arizona-election-threats-voicemails-hobbs-sentence-87e7b8e99cb5961ff2ed38eab550a44b"
  },
  {
    "text": "Chuck Todd Elaborates On Why NBC Shouldn't Have Hired Ronna McDaniel  —  In a social media post, the NBC newsman said honest journalists shouldn't have to “lend their credibility to someone who intentionally tried to ruin ours.”  —  LOADING  —  Chuck Todd is elaborating on why NBC News … ",
    "url": "https://www.huffpost.com/entry/chuck-todd-x-ronna-mcdaniel_n_660209a3e4b079ac3ef1ed54"
  },
  {
    "text": "Scoop: GOP group privately warns against all-in Biden attacks … - “Steer clear of making the election a singular referendum on Joe Biden,” wrote Dee Duncan, the president of the Republican State Leadership Committee (RSLC).  — The memo advised against using Biden “as your crutch” … ",
    "url": "https://www.axios.com/2024/03/25/republicans-attack-biden-2024-gop"
  },
  {
    "text": "Sean ‘Diddy’ Combs's homes raided by Homeland Security  —  The Los Angeles and Miami homes of renowned musician and producer Sean “Diddy” Combs were raided by authorities as part of a federal investigation, officials said.  —  The action is related to a sex trafficking probe in New York … ",
    "url": "https://thehill.com/blogs/in-the-know/4555004-sean-diddy-combs-homes-raided/"
  },
  {
    "text": "Trump loves to play the victim — NY appeals court bailout shows he's the most coddled person alive  —  There appears to be no end of breaks for a spoiled rich boy who has never done a decent thing in his 77 years  —  As anyone who listens to him can attest, Donald Trump may be the most self-pitying person on planet Earth.",
    "url": "https://www.salon.com/2024/03/26/loves-to-play-the-victim--ny-appeals-bailout-shows-hes-the-most-coddled-person-alive/"
  },
  {
    "text": "Records confirm Trump's mother-in-law came to U.S. through process he derided  —  Melania Trump sponsored her mother to immigrate to the United States through a family-based process that former president Donald Trump aggressively sought to end, according to federal immigration records released Monday.",
    "url": "https://www.washingtonpost.com/immigration/2024/03/25/trump-melania-parents-chain-migration/"
  },
  {
    "text": "Elon Musk Fought Government Surveillance — While Profiting Off Government Surveillance  —  Ten years ago, the internet platform X, then known as Twitter, filed a lawsuit against the government it hoped would force transparency around abuse-prone surveillance of social media users.",
    "url": "https://theintercept.com/2024/03/25/elon-musk-x-dataminr-surveillance-privacy/"
  },
  {
    "text": "Inside the squatting hysteria  —  On March 17, a provocateur named Leonel Moreno posted a video on TikTok where he purports to give instructions on how people can successfully “squat” in other people's houses.  It was one of many videos he made about how to exploit American law.",
    "url": "https://popular.info/p/inside-the-squatting-hysteria"
  },
  {
    "text": "Jeff Yass just bought Trump.  Here's what he stands to gain.  —  The right-wing billionaire and TikTok investor is about to help the former president add billions of dollars to his net worth.  This is what oligarchy looks like.  —  Billionaire investor Jeff Yass is playing his Trump card.",
    "url": "https://www.msnbc.com/the-reidout/reidout-blog/trump-truth-social-tik-tok-jeff-yass-rcna144951"
  },
  {
    "text": "Florida Passes Law Banning Social Media for Minors Under 14  —  The legislation prohibits social-media accounts for some teens regardless of parental consent  —  Florida Gov. Ron DeSantis signed legislation Monday that prohibits people under 14 years old from having social-media accounts … ",
    "url": "https://www.wsj.com/politics/florida-passes-law-banning-social-media-for-minors-under-14-abae4ce3"
  },
  {
    "text": "Could Murkowski's dislike for Trump remake the Senate?  —  With assists from POLITICO's Congress team  —  TIME FOR SOME ALASKA GAME THEORY  —  Sen. Lisa Murkowski (R-Alaska) has always been a free thinker.  But a second White House term for Donald Trump could force her into a new lane.",
    "url": "https://www.politico.com/newsletters/inside-congress"
  }
]