[
  {
    "text": "Trump's social media account shares a campaign video with a headline about a ‘unified Reich’  —  A video posted to Donald Trump's account on his social media network included references to a “unified Reich” among hypothetical news headlines if he wins the election in November.",
    "url": "https://apnews.com/article/trump-election-2024-rhetoric-germany-antisemitism-31002afb91b642c0314223d19e51f427"
  },
  {
    "text": "A Hidden Variable in the Presidential Race: Fears of ‘Trump Forever’  —  Undecided voters are concerned that if Donald Trump returns to the White House, he'll never leave.  —  As the rematch between Joe Biden and Donald Trump draws nearer, political professionals are detecting … ",
    "url": "https://www.bloomberg.com/news/features/2024-05-21/voters-fear-trump-won-t-leave-if-he-wins-2024-presidential-election"
  },
  {
    "text": "Jon Stewart Sounds Off on the ‘Real Cancel Culture’  —  ‘CONSTANT VICTIMIZATION’  —  “Jerry Seinfeld took more shit over the past two weeks promoting a Pop-Tart movie than Harrison Butker did for his entire speech,” Stewart said on Monday's “Daily Show.”  —  Chiefs kicker Harrison Butker … ",
    "url": "https://www.thedailybeast.com/jon-stewart-blasts-trump-cancel-culture-and-gop-hypocrisy-after-harrison-butker-outrage"
  },
  {
    "text": "Harrison Butker is Catholic.  So What?  —  This is America: We need to tolerate a Catholic man saying Catholic things at a Catholic university.  —  Perhaps you have heard of Harrison Butker, the 28-year-old Kansas City Chiefs kicker at the center of the latest viral outrage.",
    "url": "https://www.thefp.com/p/harrison-butker-is-catholic"
  },
  {
    "text": "Controversial Donald Trump movie ‘The Apprentice’ depicts him as rapist  —  A dark new biopic starring Sebastian Stan as a young Trump is the talk of Cannes.  —  CANNES, France — Had a movie called “The Apprentice” about a young Donald Trump's rise to power premiered in America … ",
    "url": "https://www.washingtonpost.com/entertainment/movies/2024/05/20/donald-trump-the-apprentice-cannes/"
  },
  {
    "text": "Israeli officials seize AP equipment and take down live shot of northern Gaza, citing new media law  —  Israeli officials seized a camera and broadcasting equipment belonging to The Associated Press in southern Israel, accusing the news organization of violating a new media law by providing images to Al Jazeera.",
    "url": "https://apnews.com/article/live-transmission-israel-associated-press-57e8f662907334ba3599156276381190"
  },
  {
    "text": "Trump's Reported Fund-Raising Tops Biden's for First Time  —  The pace of giving to Donald Trump's campaign and the Republican Party picked up in April, according to his advisers.  But President Biden still has far more cash on hand.  —  Former President Donald J. Trump and the Republican Party … ",
    "url": "https://www.nytimes.com/2024/05/21/us/politics/trump-biden-fundraising.html"
  },
  {
    "text": "Biden quietly advances a range of progressive policies  —  He did so just before a deadline on his rule-making authority.  —  ∙ Paid … Congress, in case you're just back from Mars, has been so mired in gridlock that its main function — passing laws — has become about as common as hens teeth.",
    "url": "https://www.publicnotice.co/p/biden-congressional-review-act-2024-deadline"
  },
  {
    "text": "Scarlett Johansson says she is ‘shocked, angered’ over new ChatGPT voice  —  Lawyers for Scarlett Johansson are demanding that OpenAI disclose how it developed an AI personal assistant voice that the actress says sounds uncannily similar to her own.  —  Johansson's legal team has sent OpenAI … ",
    "url": "https://www.npr.org/2024/05/20/1252495087/openai-pulls-ai-voice-that-was-compared-to-scarlett-johansson-in-the-movie-her"
  },
  {
    "text": "Special counsel suspected additional obstruction effort by Trump in classified docs case  —  The allegations were revealed in a newly unsealed court filing Tuesday.  —  Former President Donald Trump listens during a news conference after attending the wake of New York City police officer Jonathan Diller … ",
    "url": "https://abcnews.go.com/US/special-counsel-suspected-additional-obstruction-effort-trump-classified/story?id=110438582"
  },
  {
    "text": "An Alabama Trump appointee is threatening to jail LGBTQ civil rights lawyers  —  A forum-shopping dispute that been ongoing for two years briefly reached the Eleventh Circuit on Monday.  Also: More on Alito.  And: Law Dork in the news.  —  An “unprecedented judicial investigation” … ",
    "url": "https://www.lawdork.com/p/alabama-burke-threatening-jail-lgbtq-lawyers"
  },
  {
    "text": "‘Millionaires tax’ has already generated $1.8 billion this year for Massachusetts, blowing past projections  —  Massachusetts' so-called “millionaires tax” appears primed to actually deliver billions.  —  State officials said Monday that the voter-approved surtax on high earners has generated … ",
    "url": "https://www.bostonglobe.com/2024/05/20/metro/millionaires-tax-massachusetts-generated-18-billion/"
  },
  {
    "text": "Trump Mode  —  How Trump gives his quislings room to defend him.  —  ∙ Paid  —  1. 12 Years a President  —  At the NRA convention this weekend Donald Trump floated, in an oblique way, the idea of a third term.  —  “You know, FDR 16 years—almost 16 years—he was four terms.",
    "url": "https://www.thebulwark.com/p/trump-mode"
  },
  {
    "text": "Imprisoned ex-Trump aide Peter Navarro predicts Fed Chair's ouster and ‘mass deportations’ in a second presidential term  —  The Scoop  —  Federal Reserve Chair Jerome Powell would be gone in the first 100 days of a second Donald Trump term that would also include mass deportations … ",
    "url": "https://www.semafor.com/article/05/21/2024/imprisoned-ex-trump-aide-peter-navarro-predicts-ouster-of-fed-chair-jay-powell"
  },
  {
    "text": "Trump seems unlikely to testify.  Here's the latest.  —  The jury has been dismissed until closing arguments next Tuesday, but the court has more business to deal with this afternoon.  Lawyers for Donald J. Trump called just two witnesses before wrapping up their case.  —  The jury will begin deliberations next week.",
    "url": "https://www.nytimes.com/live/2024/05/21/nyregion/trump-trial-hush-money"
  },
  {
    "text": "How sanctions played havoc with Iran's ageing helicopters  —  US-made Bell 212 carrying country's president was almost 30 years old when it crashed into a mountainside  —  The circumstances could hardly have been more difficult as the decades-old helicopter, which had clocked up thousands … ",
    "url": "https://www.ft.com/content/f5a9be7a-b446-426f-8b04-ee6a340bb781"
  },
  {
    "text": "Biden and Big Oil Had a Truce.  Now, It's Collapsing.  —  Companies were enjoying record profits.  But the president's decision to pause permits for gas export terminals has whipped up industry support, and donations, for Donald Trump.  —  Early in his term, President Biden seemed … ",
    "url": "https://www.nytimes.com/2024/05/21/climate/trump-campaign-oil-gas.html"
  },
  {
    "text": "On the Death of Iranian President Raisi and Others in a Helicopter Crash  —  The United States expresses its official condolences for the death of Iranian President Ebrahim Raisi, Foreign Minister Amir-Abdollahian, and other members of their delegation in a helicopter crash in northwest Iran.",
    "url": "https://www.state.gov/on-the-death-of-iranian-president-raisi-and-others-in-a-helicopter-crash/"
  }
]