[
  {
    "text": "How the Special Counsel's Portrayal of Biden's Memory Compares With the Transcript  —  The special counsel, Robert K. Hur, accused the president last month of “significant” memory problems.  The interview transcript offers context to his report.  —  A transcript of a special counsel's hourslong interview … ",
    "url": "https://www.nytimes.com/2024/03/12/us/politics/hur-biden-memory-transcript.html"
  },
  {
    "text": "Robert Hur Admits Telling Biden He Seemed To Have ‘Photographic Recall’  —  The special counsel admitted his comment wasn't in the final report, in which he described the president's memory as “faulty,” “hazy” and “poor.”  —  LOADING  —  Although special counsel Robert Hur impugned Joe Biden's memory … ",
    "url": "https://www.huffpost.com/entry/robert-hur-biden-photographic-recall-eric-swalwell_n_65f0920ae4b01707c6d1f807"
  },
  {
    "text": "Biden clinches Democratic nomination  —  President Biden won the Georgia Democratic primary, according to Decision Desk HQ projections, giving him enough delegates to clinch the Democratic presidential nomination and all but guaranteeing he will face off against former President Trump again in November.",
    "url": "https://thehill.com/homenews/campaign/4527035-joe-biden-democratic-nomination-delegates/"
  },
  {
    "text": "Schiff Attacked Special Counsel Hur for Reporting Biden's Failing Memory.  Here's What Happened Next.  —  On Tuesday, Special Counsel Robert Hur testified in a House Judiciary hearing about his report detailing President Joe Biden's handling of classified documents.",
    "url": "https://townhall.com/tipsheet/madelineleesman/2024/03/12/hur-hearing-n2636392"
  },
  {
    "text": "Ken Buck announces he will leave Congress on March 22, scrambling race to replace him that includes Lauren Boebert  —  U.S. Rep. Ken Buck will leave Congress on March 22, the Windsor Republican announced Tuesday in a surprise decision that's scrambling the already highly contentious … ",
    "url": "https://coloradosun.com/2024/03/12/ken-buck-congress-departure-march-22/"
  },
  {
    "text": "GOP Rep. Ken Buck to leave Congress at end of next week  —  Republican Rep. Ken Buck of Colorado, a hardline conservative who has clashed with his own party at times, announced on Tuesday that he will leave Congress at the end of next week.  —  Buck criticized dysfunction on Capitol Hill … ",
    "url": "https://www.cnn.com/2024/03/12/politics/ken-buck-leaving-congress-early/"
  },
  {
    "text": "Buck to retire next week, narrowing House GOP majority  —  Rep. Ken Buck (R-Colo.) will retire from Congress next week, he said Tuesday, a stunning announcement that will narrow the House GOP's razor-thin majority even further.  —  Buck — who has become known for breaking from his party … ",
    "url": "https://thehill.com/homenews/house/4526727-buck-retiring-next-week/"
  },
  {
    "text": "Aaron Rodgers and Jesse Ventura Top R.F.K. Jr.'s List for Running Mate  —  Mr. Kennedy said he had been speaking with the Jets quarterback “pretty continuously” for the past month.  —  Robert F. Kennedy Jr. has recently approached the N.F.L. quarterback Aaron Rodgers and the former Minnesota governor … ",
    "url": "https://www.nytimes.com/2024/03/12/us/politics/rfk-jr-aaron-rodgers-jesse-ventura.html"
  },
  {
    "text": "Conference Acts to Promote Random Case Assignment  —  The Judicial Conference of the United States has strengthened the policy governing random case assignment, limiting the ability of litigants to effectively choose judges in certain cases by where they file a lawsuit.",
    "url": "https://www.uscourts.gov/news/2024/03/12/conference-acts-promote-random-case-assignment"
  },
  {
    "text": "Trump takes control of the RNC with mass layoffs, restructuring  —  The move has raised fears among some former officials about the party's future support for down-ballot candidates  —  Former president Donald Trump took charge of the Republican National Committee this week with the political equivalent … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/12/rnc-trump-firings-takeover/"
  },
  {
    "text": "Trump just opened the door to Social Security cuts.  Take him seriously.  —  A second Trump presidency is likely to bring more austerity than the first one did.  —  During his 2016 campaign, Donald Trump called for a ban on all Muslim immigration to the United States … ",
    "url": "https://www.vox.com/politics/2024/3/12/24098773/trump-social-security-medicare-cuts-entitlements-position-2024"
  },
  {
    "text": "Wisconsin Republicans fire 8 more Evers appointees, including regents and judicial watchdogs  —  Republicans who control the state Senate fired eight more of Democratic Gov. Tony Evers' appointees Tuesday, including two Universities of Wisconsin regents who voted against a deal … ",
    "url": "https://apnews.com/article/senate-republicans-reject-governor-appointees-wisconsin-9041cc81dabcdd0851e8064e31ed7d54"
  },
  {
    "text": "NAACP urges Black athletes to avoid Florida public universities over anti-DEI policies  —  Black college athletes should rethink any decision to attend public colleges and universities in Florida, the NAACP advised in an extraordinary letter issued in response to efforts by Gov. Ron DeSantis … ",
    "url": "https://npr.org/2024/03/12/1238108601/naacp-black-athletes-florida-desantis-boycott"
  },
  {
    "text": "Wisconsin Supreme Court will reconsider ruling limiting absentee ballot drop boxes  —  The Wisconsin Supreme Court will consider overturning its own ruling limiting the use of absentee ballot drop boxes, the justices said Tuesday.  The court ruled in July 2022 that absentee drop boxes … ",
    "url": "https://apnews.com/article/wisconsin-absentee-ballots-drop-boxes-supreme-court-17a8a322d20e2562d23016e98978ad0b"
  },
  {
    "text": "Trump says pardoning Capitol attackers will be one of his first acts if elected again  —  In a Truth Social post, the ex-president said he will pardon ‘hostages’ convicted for their part in the Capitol attack in 2021  —  Donald Trump has said one of his first acts if given a second presidency … ",
    "url": "https://www.theguardian.com/us-news/2024/mar/12/trump-january-6-pardons"
  },
  {
    "text": "Uvalde police chief abruptly announces resignation days after report cleared officers in massacre at Robb Elementary School  —  Hours before the Uvalde City Council was expected to reject a report clearing local police officers of wrongdoing in the Robb Elementary School massacre, the city's police chief told CNN he is resigning.",
    "url": "https://www.cnn.com/2024/03/11/us/uvalde-former-mayor-report-robb-elementary"
  },
  {
    "text": "Discharge Petition No. 9, Bill Number: H.Res. 1016, 118th Congress  —  SPONSOR: James P. McGovern DESCRIPTION: Pursuant to clause 2 of rule XV, I, James P. McGovern, move to discharge the Committee on Rules from the consideration of the resolution entitled, a resolution providing for consideration of the bill … ",
    "url": "https://clerk.house.gov/DischargePetition/2024031209?CongressNum=118"
  },
  {
    "text": "Experts Place New Secret Society Squarely In The Christian Nationalist Revival  —  Right-wing secret society asks prospective members for thoughts on “Christian nationalism,” but denies that it's a Christian nationalist organization  —  A men-only, Christian-only, right-wing secret society … ",
    "url": "https://talkingpointsmemo.com/news/experts-place-new-secret-society-squarely-in-the-christian-nationalist-revival"
  },
  {
    "text": "Fewer than 100 House Republicans expected to attend GOP retreat … - Members who are skipping cited grievances ranging from the location to a lack of advance information on logistics.  — Fox Business host Larry Kudlow, who was slated to speak at the event, also cancelled at the 11th hour — dealing a blow to the agenda.",
    "url": "https://www.axios.com/2024/03/12/house-republican-retreat-infighting"
  },
  {
    "text": "Former Texas GOP official sentenced to 4 centuries in prison for child sex abuse  —  Bo Michael Dresner, a former precinct chairman for the Hays County, Texas Republican Party, was sentenced to more than four centuries in prison after pleading guilty to multiple counts of child sexual abuse … ",
    "url": "https://www.rawstory.com/republican-jail-sentence/"
  },
  {
    "text": "In states with laws targeting LGBTQ issues, school hate crimes quadrupled  —  School hate crimes targeting LGBTQ+ people have sharply risen in recent years, climbing fastest in states that have passed laws restricting LGBTQ student rights and education, a Washington Post analysis of FBI data finds.",
    "url": "https://www.washingtonpost.com/education/2024/03/12/school-lgbtq-hate-crimes-incidents/"
  }
]