[
  {
    "text": "Koch network stops spending on Nikki Haley's presidential campaign  —  Americans for Prosperity Action said it had to “take stock” after Haley's loss in South Carolina.  —  Americans For Prosperity Action, the powerful conservative group supporting Nikki Haley in the Republican presidential primary … ",
    "url": "https://www.politico.com/news/2024/02/25/koch-afp-nikki-haley-00143212"
  },
  {
    "text": "Status Report: Warning Signs for Trump  —  A quick check-in on the state of affairs on the other side of the campaign aisle.  For some time now, it's been down to two people, Trump and Haley, and yesterday the GOP primary contest was in Haley's home state of South Carolina.  —  Newsflash: Trump won.",
    "url": "https://statuskuo.substack.com/p/status-report-warning-signs-for-trump"
  },
  {
    "text": "Three Theories for Why Trump's Primary Results Are Not Matching Expectations  —  He has underperformed the polls in each of the first three contests.  —  It's still early in the primary season, but a whiff of a possible polling error is already in the air.",
    "url": "https://www.nytimes.com/2024/02/26/upshot/trump-polling-primaries.html"
  },
  {
    "text": "Months After Backing Haley, Koch Network Suspends Support for Her Campaign  —  The group's chief executive wrote in an email to staff on Sunday that it would now focus on House and Senate races.  —  The political network created by the billionaire industrialist Koch brothers announced … ",
    "url": "https://www.nytimes.com/2024/02/25/us/politics/haley-koch-network.html"
  },
  {
    "text": "RNC Chair Ronna McDaniel announces her resignation  —  Former President Donald Trump has already endorsed a new slate of leaders at the Republican National Committee ahead of the general election.  —  WASHINGTON — Ronna McDaniel said Monday that she will step down next month as chairwoman … ",
    "url": "https://www.nbcnews.com/politics/2024-election/rnc-chair-ronna-mcdaniel-resignation-rcna137347"
  },
  {
    "text": "Ronna McDaniel, the R.N.C.'s Top Official, Plans to Step Down on March 8  —  The chairwoman of the Republican National Committee said on Monday that she would step down in just over a week, as former President Donald J. Trump seeks to install a new handpicked leader for the national party ahead of the general election this fall.",
    "url": "https://www.nytimes.com/2024/02/26/us/politics/ronna-mcdaniel-rnc-trump.html"
  },
  {
    "text": "Ronna McDaniel to step down as RNC chair next week  —  “The R.N.C. has historically undergone change once we have a nominee, and it has always been my intention to honor that tradition,” McDaniel said.  —  Ronna McDaniel announced Monday she will step down from her role … ",
    "url": "https://www.politico.com/news/2024/02/26/ronna-mcdaniel-rnc-00143263"
  },
  {
    "text": "Lawmakers fail to reach deal with partial shutdown looming  —  Senate Majority Leader Chuck Schumer (D-N.Y.) on Sunday blasted Republicans over for threat of what he called “a harmful and unnecessary government shutdown” as Congress struggles to strike a bipartisan deal days out from a key funding deadline.",
    "url": "https://thehill.com/policy/energy-environment/4488498-lawmakers-fail-to-reach-deal-with-partial-shutdown-looming/"
  },
  {
    "text": "Smoke and mirrors: What Republicans are really saying about IVF  —  On February 16, the Alabama Supreme Court ruled that frozen embryos are “children,” and fertility clinics that destroy frozen embryos could be sued under Alabama's Wrongful Death of a Minor Act.",
    "url": "https://popular.info/p/smoke-and-mirrors-what-republicans"
  },
  {
    "text": "Palestinian Authority prime minister and government resign  —  Palestinian Authority Prime Minister Mohammed Shtayyeh and his government have submitted their resignations, he announced Monday.  —  “I would like to inform the honorable council and our great people that I placed … ",
    "url": "https://www.cnn.com/2024/02/26/middleeast/palestinian-authority-prime-minister-resigns-intl/"
  },
  {
    "text": "Inside the Internal Debates of a Hospital Abortion Committee  —  Post-Roe America: Abortion Access Divides the Nation  —  After the Supreme Court overturned Roe v. Wade, ending nearly 50 years of federal protection for abortion, some states began enforcing strict abortion bans while others became new havens for the procedure.",
    "url": "https://www.propublica.org/article/abortion-doctor-decisions-hospital-committee"
  },
  {
    "text": "Republican Opposition to Birth Control Bill Could Alienate Voters, Poll Finds  —  A survey conducted by Americans for Contraception shows the overwhelming popularity of birth control, and suggests voters are primed to punish Republicans for opposing a measure to protect access to it.",
    "url": "https://www.nytimes.com/2024/02/26/us/politics/republicans-birth-control-ivf.html"
  },
  {
    "text": "Supreme Court to Hear Free Speech Challenges to Social Media Laws  —  The tech industry argues that laws in Florida and Texas, prompted by conservative complaints about censorship, violate the First Amendment.  The court's decision could fundamentally alter the nature of speech on the internet.",
    "url": "https://www.nytimes.com/2024/02/26/us/politics/supreme-court-social-media-texas-florida.html"
  },
  {
    "text": "Democratic operative admits to commissioning fake Biden robocall that used AI  —  Steve Kramer acknowledged Sunday that he created the fake Joe Biden robocall at the center of a multistate investigation after NBC News reported about his involvement.  —  Steve Kramer, a veteran political consultant working … ",
    "url": "https://www.nbcnews.com/politics/2024-election/democratic-operative-admits-commissioning-fake-biden-robocall-used-ai-rcna140402?taid=65dbacde592fef00019b1579"
  },
  {
    "text": "Exclusive: Hunter Biden sees his sobriety as key to keeping Trump from winning … - “Most importantly, you have to believe that you're worth the work, or you'll never be able to get sober. … “I have always been in awe of people who have stayed clean and sober through tragedies and obstacles few people ever face.",
    "url": "https://www.axios.com/2024/02/26/hunter-joe-biden-sober-2024-trump"
  }
]