[
  {
    "text": "Trump readies blanket tariffs as he brushes off inflation worries  —  In a wide-ranging interview with NBC News, Trump talked about tariffs, sending Patriot missiles to NATO for Ukraine and how he'll sell his recently passed “big, beautiful bill.”  —  President Donald Trump on Thursday … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-tariffs-inflation-hasbro-ukraine-patriot-missiles-nato-russia-rcna218125"
  },
  {
    "text": "Trump's Tariffs Blow Up the Copper Market  —  U.S. firms will pay 50% more while waiting years for more U.S. production.  —  President Trump likes tariffs for their own sake, and the latest evidence is his bewildering decision to slap a 50% tax on copper imports.",
    "url": "https://www.wsj.com/opinion/donald-trump-copper-tariffs-defense-china-ff3eefb1?st=FpjXfU&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Trump Plans ‘Major’ Russia Statement Monday, Mulls Sanctions  —  President Donald Trump said he plans to make a “major statement” on Russia, as the US prepares to send more American weapons to Ukraine via purchases from NATO allies.  —  “I think I'll have a major statement to make on Russia on Monday … ",
    "url": "https://www.bloomberg.com/news/articles/2025-07-11/trump-plans-major-russia-statement-monday-criticizes-putin"
  },
  {
    "text": "Sen. Angela Paxton files for divorce from Attorney General Ken Paxton  —  In a statement, Angela Paxton said she moved to end her 38-year marriage “on biblical grounds,” citing “recent discoveries.”  —  State Sen. Angela Paxton announced Thursday she has filed for divorce from her husband, Texas Attorney General Ken Paxton.",
    "url": "https://www.texastribune.org/2025/07/10/angela-paxton-divorce-texas-attorney-general-ken/"
  },
  {
    "text": "ICE handcuffs 71-year-old grandmother, a U.S. citizen, at San Diego immigration court … A grandmother planning to document ICE arrests at the San Diego courthouse instead became the story Tuesday after video of her own arrest began circulating.  —  An ICE agent accused the woman of pushing her.",
    "url": "https://www.nbcsandiego.com/news/local/ice-arrests-71-year-old-grandmother-a-us-citizen-at-san-diego-immigration-court/3865098/"
  },
  {
    "text": "State Department to Soon Begin Mass Layoffs  —  Secretary of State Marco Rubio's plan to downsize a “bloated” department had been on hold after a court ruling.  —  The State Department formally notified employees on Thursday that it was about to begin layoffs as part of a consolidation plan … ",
    "url": "https://www.nytimes.com/2025/07/10/us/politics/state-department-mass-layoffs.html"
  },
  {
    "text": "New Whistleblower Docs Bolster Claim Emil Bove Spoke Openly of Defying Courts  —  Emil Bove, a top DOJ official, is currently in the middle of a contentious nomination process for a seat on the federal judiciary.  — Copy  —  A whistleblower who leveled explosive allegations against Emil Bove … ",
    "url": "https://www.notus.org/courts/new-whistleblower-docs-emil-bove"
  },
  {
    "text": "Trump warns Republicans against rejecting cuts to PBS and NPR  —  President Trump on Thursday threatened to withhold his support for any Republican who opposes a rescissions package of roughly $9 billion in cuts to foreign aid and public broadcasting.  —  “It is very important … ",
    "url": "https://thehill.com/homenews/administration/5395791-trump-warns-republicans-against-rejecting-cuts-to-pbs-and-npr/"
  },
  {
    "text": "A Baseball Coach Says He Fended Off ICE Agents Questioning Kids on the Upper West Side  —  After coaching baseball on the west side of Manhattan for more than 20 years, Youman Wilder says he had a first-of-a-kind experience at the end of last month.  —  Wilder was leading a group … ",
    "url": "https://www.westsiderag.com/2025/07/10/a-baseball-coach-says-he-fended-off-ice-agents-questioning-kids-on-the-uws"
  },
  {
    "text": "The F.B.I. Is Using Polygraphs to Test Officials' Loyalty  —  Some senior officials who have taken the test have been asked whether they said anything negative about the F.B.I. director, Kash Patel.  — 1.2k  —  Typically, the F.B.I. has turned to polygraph tests to sniff out employees … ",
    "url": "https://www.nytimes.com/2025/07/10/us/politics/fbi-polygraph-kash-patel.html?unlocked_article_code=1.VU8.AnJL.I4rSD7g8Hmop&smid=url-share"
  },
  {
    "text": "Grok 4 seems to consult Elon Musk to answer controversial questions  —  During xAI's launch of Grok 4 on Wednesday night, Elon Musk said — while live-streaming the event on his social media platform, X — that his AI company's ultimate goal was to develop a “maximally truth-seeking AI.”",
    "url": "https://techcrunch.com/2025/07/10/grok-4-seems-to-consult-elon-musk-to-answer-controversial-questions/"
  },
  {
    "text": "Cops Probed Trump Terror Chief, 22, Over Teen Love Triangle  —  EYEBROW-RAISING  —  Police were called in after a threatening message was sent to a child by the ex-gardener chosen by the president to lead a key homeland security post, The Daily Beast has learned.  —  EXCLUSIVE",
    "url": "https://www.thedailybeast.com/cops-probed-thomas-fugate-trump-terror-chief-22-over-teen-love-triangle/"
  },
  {
    "text": "Fired Justice Department official warns we are “driving straight into an abyss”  —  A 17-year former Justice Department official is warning of a wave of retribution inside the agency.  —  Patty Hartman, who served as a top public affairs specialist at the FBI and federal prosecutors' offices … ",
    "url": "https://www.cbsnews.com/news/fired-justice-department-official-we-are-falling-into-an-abyss/"
  },
  {
    "text": "Justice Dept. Demands Patient Details From Trans Medicine Providers  —  Doctors and hospitals were subpoenaed for private information on gender-related care for minors, the latest move by the Trump administration to stop the treatments.  —  The Justice Department has issued subpoenas demanding … ",
    "url": "https://www.nytimes.com/2025/07/10/health/transgender-medicine-minors-trump-subpoena.html?unlocked_article_code=1.VU8.-jw7.Tu6IpFti68dH&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "US Department of Labor moves to prevent illegal immigrants from utilizing taxpayer-funded workforce programs  —  WASHINGTON - The U.S. Department of Labor's Employment and Training Administration today announced new guidance to ensure illegal immigrants are not allowed access … ",
    "url": "https://www.dol.gov/newsroom/releases/osec/osec20250710"
  },
  {
    "text": "California surgical center staff demand to see warrant as ICE agents detain landscaper  —  Federal immigration agents seeking to detain a Honduran landscaper chased him into a Southern California surgical center and quickly found themselves in a tense standoff as clinic staff demanded to see identification and a warrant.",
    "url": "https://apnews.com/article/ice-arrest-california-surgery-center-c827038f1a40227dc05ab1c28b048035"
  },
  {
    "text": "Live updates: New Hampshire judge pauses Trump's birthright citizenship order  —  EDITED BY  CURTIS YEE, BERNARD MCGHEE, NELL CLARK AND SAM BURDETTE  —  President Donald Trump posted a letter to social media Thursday evening announcing Canadian goods will be subject to a 35% tariff rate starting Aug. 1 … ",
    "url": "https://apnews.com/live/donald-trump-news-updates-7-10-2025"
  },
  {
    "text": "Federal immigration agents blockade Camarillo farm, clash with demonstrators  —  Federal immigration agents descended on a farm outside of Camarillo on July 10, blocking off a road outside the facility and clashing with protesters.  —  Reports flooded social media on Thursday morning … ",
    "url": "https://eu.vcstar.com/story/news/local/2025/07/10/immigration-raid-near-camarillo-sets-up-clash-with-ice-protesters/84540242007/"
  },
  {
    "text": "Trump's EPA Chief Tried to Debunk Chemtrails, but Nobody Actually Read the Report  —  Lee Zeldin's social media posts about weather phenomena confused many into thinking he had endorsed conspiracy theories … Unfortunately, he seems to have left many people confused as to the agency's actual policies and actions.",
    "url": "https://www.rollingstone.com/politics/politics-news/chemtrail-conspiracy-theory-epa-lee-zeldin-1235382905/"
  },
  {
    "text": "Harvard Explores New Center for Conservative Scholarship Amid Trump Attacks  —  The Ivy League school has discussed an effort to ‘support viewpoint diversity’ with potential donors, says it ‘will not be partisan’  —  Harvard leaders have discussed creating a program that people briefed … ",
    "url": "https://www.wsj.com/us-news/education/harvard-conservative-scholarship-center-trump-attacks-a187242a"
  },
  {
    "text": "U.S. Department of Education Opens Title VI Investigation into George Mason University  —  A Complaint Filed with OCR Alleges that the University Has Widespread Policies in Hiring and Promotion That Discriminate on the Basis of Race  —  Today, the U.S. Department of Education's Office for Civil Rights … ",
    "url": "https://www.ed.gov/about/news/press-release/us-department-of-education-opens-title-vi-investigation-george-mason-university"
  },
  {
    "text": "DHS Tells Police That Common Protest Activities Are ‘Violent Tactics’  —  DHS is urging law enforcement to treat even skateboarding and livestreaming as signs of violent intent during a protest, turning everyday behavior into a pretext for police action.  —  The Department of Homeland Security … ",
    "url": "https://www.wired.com/story/dhs-tells-police-that-common-protest-activities-are-violent-tactics/"
  },
  {
    "text": "DHS Cancels Extreme Weather Comms Grant While Bodies Still Being Recovered in Texas … As more than a hundred fatalities have been confirmed in Texas flash floods and some 170 remain missing, Department of Homeland Security Secretary Kristi Noem has both denied that DOGE cuts … ",
    "url": "https://talkingpointsmemo.com/edblog/dhs-cancels-extreme-weather-comms-grant-while-bodies-still-being-recovered-in-texas/sharetoken/1ae01ce6-3274-4b56-8da4-74a64b9ca750"
  },
  {
    "text": "Some of Iran's Enriched Uranium Survived Attacks, Israeli Official Says  —  The assessment came as experts are trying to determine how long it would take Iran to rebuild its nuclear program in the aftermath of U.S. and Israeli strikes.  —  Israel has concluded that some of Iran's underground stockpile … ",
    "url": "https://www.nytimes.com/2025/07/10/us/politics/iran-attacks-damage.html?unlocked_article_code=1.VU8.AVO7.Y4BNHAZtAqfU&smid=url-share"
  },
  {
    "text": "Freed from ICE detention, Mahmoud Khalil files $20 million claim against Trump administration  —  On a recent afternoon, Mahmoud Khalil sat in his Manhattan apartment, cradling his 10-week-old son as he thought back to the pre-dawn hours spent pacing a frigid immigration jail in Louisiana, awaiting news of the child's birth in New York.",
    "url": "https://apnews.com/article/mahmoud-khalil-ice-release-trump-columbia-protests-570f7af32010c16b1a00dd7e78f4c687"
  },
  {
    "text": "Trump administration backs away from abolishing FEMA  —  As the president heads to Texas to see the impact of last week's deadly flash floods, the White House has backed away from plans to abolish the agency, officials said.  —  For months, President Donald Trump and his homeland security secretary … ",
    "url": "https://www.washingtonpost.com/politics/2025/07/11/trump-fema-texas-floods/"
  },
  {
    "text": "How Netanyahu Prolonged the War in Gaza to Stay in Power … Prime Minister Benjamin Netanyahu on June 5.  —  ‘You no longer have a government’  —  Six months into the war in the Gaza Strip, Benjamin Netanyahu was preparing to bring it to a halt.  Negotiations were underway … ",
    "url": "https://www.nytimes.com/2025/07/11/magazine/benjamin-netanyahu-gaza-war.html"
  }
]