[
  {
    "text": "Live Updates: Eric Adams Is Indicted in New York  —  The indictment makes Mr. Adams the first sitting New York City mayor to face criminal charges.  —  Here's the latest on the mayor's indictment.  —  Mayor Eric L. Adams has been indicted on federal criminal charges … ",
    "url": "https://www.nytimes.com/live/2024/09/25/nyregion/eric-adams-indicted-corruption?unlocked_article_code=1.Nk4.RfxD.LvCd4VYdPWrg&smid=nytcore-ios-share&referringSource=articleShare&sgrp=c-cb"
  },
  {
    "text": "Eric Adams Is Indicted After Federal Corruption Investigation  —  The indictment makes Mr. Adams the first sitting mayor of New York City to be charged with a federal crime.  —  Eric L. Adams, a retired police captain who was elected as New York City's 110th mayor nearly three years ago … ",
    "url": "https://www.nytimes.com/2024/09/25/nyregion/eric-adams-indicted.html"
  },
  {
    "text": "New York Mayor Eric Adams expected to face federal charges  —  “If I am charged, I am innocent and I will fight this with every ounce of my strength and spirit,” the mayor said.  —  New York Mayor Eric Adams is expected to face federal charges by prosecutors out of the Southern District … ",
    "url": "https://www.nbcnews.com/news/us-news/new-york-city-mayor-eric-adams-federal-charges-rcna172370"
  },
  {
    "text": "Andrew Cuomo eyes NYC mayor job … The charges have not yet been revealed.  — While Adams is adamant he will not be stepping down, he is already facing a tough Democratic primary next year on top of mounting calls to resign.  — Cuomo's formal entrance into the fray would be a wildcard.",
    "url": "https://www.axios.com/2024/09/26/andrew-cuomo-nyc-mayor-eric-adams-indictment"
  },
  {
    "text": "Eric Adams becomes first sitting NYC mayor indicted in historic federal probe — claims feds persecuting him over migrant crisis  —  Mayor Eric Adams has been indicted by a grand jury on charges connected to a federal probe, sources told The Post — as the defiant mayor claimed he was being persecuted … ",
    "url": "https://nypost.com/2024/09/25/us-news/nyc-mayor-eric-adams-indicted-by-grand-jury-in-historic-federal-probe-sources/"
  },
  {
    "text": "Playbook: The race to replace McConnell heats up  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  FROM ZERO BOND TO CASH BOND — NYC Mayor ERIC ADAMS, who once deemed himself the “face of the new Democratic Party,” was indicted by federal prosecutors yesterday … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/09/26/the-race-to-replace-mcconnell-heats-up-00181133"
  },
  {
    "text": "Kamala Harris: American Women Don't Need Trump's ‘Protection’  —  NOT HAVING IT  —  “I don't think the women of America need him to say he's going to protect them.  The women of America need him to trust them,” Harris said.  —  Vice President Kamala Harris rejected Donald Trump's recent assertion that … ",
    "url": "https://www.thedailybeast.com/harris-speaks-for-american-women-in-dismissing-trumps-promise-to-protect-them"
  },
  {
    "text": "GOP Rep. Clay Higgins deletes post calling Haitian migrants ‘thugs,’ telling them to get ‘their a** out of our country’  —  House Democrats immediately tried to reprimand GOP Rep. Clay Higgins of Louisiana from the floor of the chamber on Wednesday over a since deleted social media post calling … ",
    "url": "https://www.cnn.com/2024/09/25/politics/clay-higgins-deletes-post-haitian-migrants/"
  },
  {
    "text": "Rep. Clay Higgins Posts, Then Deletes, Racist Comments About Haitians  —  False claims about migrants in Springfield, Ohio, who are legal residents, became a campaign issue after Donald J. Trump brought them up at the presidential debate this month.  —  Representative Clay Higgins … ",
    "url": "https://www.nytimes.com/2024/09/25/us/politics/clay-higgins-haitians-springfield-ohio.html"
  },
  {
    "text": "The Undecided Voters Are Not Who You Think They Are  —  For the great majority of Americans who have firmly settled on Kamala Harris or Donald Trump, the idea that anyone could still be undecided in that choice is almost incomprehensible.  But the incredulity may be rooted in confusion about who most undecided voters really are.",
    "url": "https://www.theatlantic.com/politics/archive/2024/09/undecided-voters-2024-election/680026/"
  },
  {
    "text": "U.S. Presidential Contest: Arizona, September 2024  —  Marist Arizona Poll  —  Trump +1 Point Against Harris in Arizona  —  In Arizona, one point separates former President Donald Trump and Vice President Kamala Harris among likely voters statewide, including those who are undecided yet leaning toward a candidate.",
    "url": "https://maristpoll.marist.edu/polls/u-s-presidential-contest-arizona-september-2024/"
  },
  {
    "text": "“The evidence will be powerful”: Legal experts say Jack Smith about to drop a bomb in Trump case  —  Legal scholars expect a bitter fight over what evidence may be redacted from the public  —  Special counsel Jack Smith is expected to submit an “oversized” brief in former President Donald … ",
    "url": "https://www.salon.com/2024/09/25/the-evidence-will-be-powerful-legal-experts-say-jack-smith-about-to-drop-a-bomb-in-case/"
  },
  {
    "text": "The fruits of Jack Smith's 2-year investigation into Trump will land on Tanya Chutkan's desk today  —  It may be the final inflection point in the case before Nov. 5.  —  Special counsel Jack Smith, stymied at every turn by federal courts from putting Donald Trump on trial … ",
    "url": "https://www.politico.com/news/2024/09/26/jack-smith-trump-investigation-dossier-00181108"
  },
  {
    "text": "Statement from President Joe Biden on Passage of the Continuing Resolution  —  Tonight, bipartisan majorities in both chambers of Congress passed a continuing resolution to keep the government open through mid-December.  I want to thank both houses of Congress—especially Senators Murray … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/09/25/statement-from-president-joe-biden-on-passage-of-the-continuing-resolution/"
  },
  {
    "text": "Mark Robinson's Top Staff in the Lieutenant Governor's Office Plan to Resign  —  North Carolina's Republican nominee for governor has already lost most of his campaign staff after a news report linked him to disturbing comments on a porn site.  —  Senior staff members in the office … ",
    "url": "https://www.nytimes.com/2024/09/25/us/politics/mark-robinson-staff-resignation.html"
  },
  {
    "text": "Wausau mayor moves ballot box in controversial act  —  Wausau Mayor Doug Diny is facing scrutiny after video surveillance footage showed him carting the city's outdoor ballot drop box inside on Sunday while sporting a Department of Public Works jacket and hard hat.",
    "url": "https://wausaupilotandreview.com/2024/09/24/wausau-mayor-moves-ballot-box-in-controversial-act-public-outcry-and-potential-legal-consequences-loom/"
  },
  {
    "text": "Lebanese prime minister believes ceasefire between Israel and Hezbollah possible  —  Israel rejected proposals on Thursday for a ceasefire with Hezbollah and conducted a military exercise simulating manoeuvres in Lebanon, defying allies including the United States which had called for an immediate halt in fighting.",
    "url": "https://www.reuters.com/world/middle-east/lebanese-prime-minister-believes-ceasefire-between-israel-hezbollah-possible-2024-09-26/"
  },
  {
    "text": "Huge ad spending pours into defining Harris in the ‘blue wall’ battlegrounds  —  Michigan, Pennsylvania and Wisconsin are absorbing more than half of the presidential campaigns' ad spending, with both sides trying to fill in voters' perceptions of Harris.  —  Money talks.",
    "url": "https://www.nbcnews.com/politics/2024-election/huge-ad-spending-pours-defining-harris-blue-wall-battlegrounds-rcna172538"
  },
  {
    "text": "Barack Obama's Secret Service Detail Penetrated, Armed Man Walks Up to SUV  —  BARACK OBAMA ARMED MAN STROLLS UP TO HIS SUV With Secret Service Nearby … 1:15 PM PT — A rep for Secret Service tells TMZ ... “The Secret Service cannot provide the details on our means and methods of protection … ",
    "url": "https://www.tmz.com/2024/09/25/barack-obama-secret-service-breach-security-failure-armed-man/"
  },
  {
    "text": "Statement from President Joe Biden on U.S. Support for Ukraine  —  I am proud to welcome President Zelenskyy back to the White House today.  For nearly three years, the United States has rallied the world to stand with the people of Ukraine as they defend their freedom from Russian aggression … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/09/26/statement-from-president-joe-biden-on-u-s-support-for-ukraine/"
  },
  {
    "text": "Common myths about the new FBI crime statistics, debunked  —  This week, the FBI released its report on crime in the United States during 2023.  The report aggregates data from over 16,000 law enforcement agencies that collectively cover over 94% of U.S. residents.",
    "url": "https://popular.info/p/common-myths-about-the-new-fbi-crime"
  }
]