[
  {
    "text": "‘My ultimate and absolute revenge’: Trump gives chilling CPAC speech on presidential agenda  —  Unbound and unhinged, ex-president vilifies immigrants before devolving into bizarre riffs, including calling himself ‘total genius’  —  Donald Trump styled himself as a “proud political dissident” … ",
    "url": "https://www.theguardian.com/us-news/2024/feb/24/donald-trump-cpac-speech"
  },
  {
    "text": "3 takeaways from the South Carolina GOP primary  —  Donald Trump has swept the traditional early states in the Republican presidential nominating contest after defeating Nikki Haley on Saturday in South Carolina.  —  News organizations called the race shortly after polls closed … ",
    "url": "https://www.washingtonpost.com/politics/2024/02/24/south-carolina-gop-primary-trump-haley/"
  },
  {
    "text": "Republicans Are Done With Mike Pence — Except Trump's VP Contenders  —  Intermediaries for Elise Stefanik, Kristi Noem and Tim Scott have been asking questions about how Pence handled the vetting gauntlet in 2016.  —  With the GOP presidential primary over in all but name … ",
    "url": "https://www.politico.com/news/magazine/2024/02/25/mike-pence-is-toxic-in-trump-world-but-vp-hopefuls-still-want-his-teams-wisdom-00142725"
  },
  {
    "text": "Koch network stops spending on Nikki Haley's presidential campaign  —  Americans for Prosperity Action said it had to “take stock” after Haley's loss in South Carolina.  —  Americans For Prosperity Action, the powerful conservative group supporting Nikki Haley in the Republican presidential primary … ",
    "url": "https://www.politico.com/news/2024/02/25/koch-afp-nikki-haley-00143212"
  },
  {
    "text": "Beyond shock and awe: Inside Trump's potential second-term agenda  —  From nationwide abortion bans to classroom culture wars, assaults on climate science and political weaponization of the military, his return to the White House could make Trump 1.0 seem tame.",
    "url": "https://www.politico.com/news/2024/02/25/second-trump-term-00140488"
  },
  {
    "text": "Trump's request to suspend E. Jean Carroll's $83M verdict swiftly denied by judge  —  U.S. District Court Judge Lewis Kaplan declined a request to grant a stay after a jury ordered Donald Trump to pay writer E. Jean Carroll over $83 million for defamation.  —  “Twenty-five days … ",
    "url": "https://www.rawstory.com/trump-e-jean-carroll-stay-denied/"
  },
  {
    "text": "Fiona Hill: Trump comparison to Navalny ‘brazen’ and ‘shameful’  —  Former National Security Council adviser Fiona Hill went after former President Trump on Sunday after he compared himself to the late Russian opposition leader Alexei Navalny as a political dissident.",
    "url": "https://thehill.com/homenews/campaign/4488138-fiona-hill-trump-comparison-to-navalny-brazen-and-shameful/"
  },
  {
    "text": "Climate change is throwing the water cycle into chaos across the U.S.  —  As the planet continues to warm, this cycle is expected to be increasingly stretched, warped and broken.  —  The water cycle that shuttles Earth's most vital resource around in an unending, life-giving loop is in trouble.",
    "url": "https://www.nbcnews.com/science/science-news/climate-change-throwing-water-cycle-chaos-us-rcna137892"
  },
  {
    "text": "Hobbycraft refused to sell paint to black man as ‘he may use it for graffiti’  —  Louis Gray says he was racially profiled after trying to buy spray paint to make over his son's bicycle helmet  —  A black man shopping for paint with his four-year-old son says he was racially profiled … ",
    "url": "https://www.theguardian.com/world/2024/feb/25/hobbycraft-refuse-to-sell-paint-to-black-man-as-he-may-use-it-for-graffiti"
  },
  {
    "text": "Justice Thomas Hires Law Clerk Accused of Sending Racist Text Messages  —  Crystal Clanton, who is close with the Thomas family, has said she does not remember sending the messages, which emerged in 2017.  —  Justice Clarence Thomas recently hired a law clerk who was previously accused … ",
    "url": "https://www.nytimes.com/2024/02/24/us/crystal-clanton-clarence-thomas-clerk.html"
  },
  {
    "text": "Democratic operative admits to commissioning fake Biden robocall that used AI  —  Steve Kramer acknowledged Sunday that he created the fake Joe Biden robocall at the center of a multistate investigation after NBC News reported about his involvement.  —  Steve Kramer, a veteran political consultant working … ",
    "url": "https://www.nbcnews.com/politics/2024-election/democratic-operative-admits-commissioning-fake-biden-robocall-used-ai-rcna140402?taid=65dbacde592fef00019b1579"
  },
  {
    "text": "Ukraine war: Zelensky says 31,000 troops killed since Russia's full-scale invasion  —  Volodymyr Zelensky says 31,000 Ukrainian soldiers have been killed during Russia's full-scale invasion.  —  The Ukrainian president said he would not give the number of wounded as that would help Russian military planning.",
    "url": "https://www.bbc.com/news/world-europe-68397525"
  },
  {
    "text": "Newsom launches abortion ads in Republican states to fight ‘war on women’  —  Series of new advertisements target Republican efforts to criminalize abortions and a ‘war on travel’ for reproductive care  —  California's governor, Gavin Newsom, is launching a series of new advertisements … ",
    "url": "https://www.theguardian.com/world/2024/feb/25/gavin-newsom-abortion-ads-republican-states"
  },
  {
    "text": "Biden's frustration with the media boils over  —  Months out from November's high-stakes election, the White House and the Biden campaign are going public with growing frustration over how the president is being portrayed in the media.  —  Biden's camp is taking swings over press coverage … ",
    "url": "https://thehill.com/homenews/administration/4485566-joe-biden-donald-trump-media-frustration/"
  }
]