[
  {
    "text": "Tensions are so high at Columbia ahead of Passover that all classes will be virtual today  —  Officials at Columbia University, facing surging tensions on campus that raised safety concerns, have announced all classes will be virtual on Monday as Passover begins.",
    "url": "https://www.cnn.com/2024/04/22/business/columbia-tensions-passover-virtual-classes/"
  },
  {
    "text": "LIVE: Over 45 pro-divestment protesters arrested on Beinecke Plaza  —  The female counter-protester approached the middle of the circle, chanting, “I am proud!”  In response, protesters began singing and chanting, drowning the woman out.  The two counter-protesters receded down Grove Street.",
    "url": "https://yaledailynews.com/blog/2024/04/22/live-police-begin-arresting-pro-divestment-protesters-on-beinecke-plaza/"
  },
  {
    "text": "Statement from Columbia University President Minouche Shafik  —  Dear Members of the Columbia Community,  —  I am deeply saddened by what is happening on our campus.  Our bonds as a community have been severely tested in ways that will take a great deal of time and effort to reaffirm.",
    "url": "https://president.columbia.edu/news/statement-columbia-university-president-minouche-shafik-4-22"
  },
  {
    "text": "Live updates Opening statements expected in Trump hush money trial  —  NEW YORK — Opening statements are expected Monday morning in Donald Trump's trial for allegedly falsifying business records to hide a hush money payment during the 2016 presidential election campaign.",
    "url": "https://www.washingtonpost.com/politics/2024/04/22/trump-hush-money-trial-live-updates/"
  },
  {
    "text": "Live Updates: Jurors in Trump Criminal Case Told That He Lied ‘Over and Over and Over’  —  Donald J. Trump is charged with falsifying business records to cover up a sex scandal that threatened to derail his 2016 campaign.  A lawyer for Mr. Trump insisted that the former president “did not commit any crimes.”",
    "url": "https://www.nytimes.com/live/2024/04/22/nyregion/trump-hush-money-trial"
  },
  {
    "text": "Trump's Trial Is the Reality Show He Never Wanted  —  The former president faces weeks of challenging witnesses and tawdry stories.  —  Prosecutors and defense attorneys will make opening statements today in a criminal fraud trial in New York that Donald Trump has tried mightily, and unsuccessfully, to delay.",
    "url": "https://www.bloomberg.com/opinion/articles/2024-04-22/trump-s-trial-is-the-reality-show-he-never-wanted"
  },
  {
    "text": "The Supreme Court Should Rule Swiftly on Trump's Immunity Claim  —  On Thursday, the U.S. Supreme Court will hear Donald Trump's arguments that he is immune from prosecution for his efforts to steal the 2020 presidential election.  It is likely that all — or nearly all … ",
    "url": "https://www.nytimes.com/2024/04/22/opinion/trump-immunity-supreme-court.html"
  },
  {
    "text": "Republicans Are Suing for the Right To Harass Election Workers  —  You might think that even in today's highly polarized election environment there would be a bipartisan consensus to protect election workers from intimidation and harassment.  If you thought so, you would be wrong.",
    "url": "https://www.democracydocket.com/opinion/republicans-are-suing-for-the-right-to-harass-election-workers/"
  },
  {
    "text": "What Donald Trump Fears Most  —  Donald Trump's biographers all seem to agree that he didn't get a lot of love from his father.  But what Fred Trump did impart to his son was an indelible lesson: There are two kinds of people in the world—killers and losers—and like his father, Donald had to be a killer.",
    "url": "https://www.theatlantic.com/politics/archive/2024/04/donald-trump-manhattan-trial-fear/678144/"
  },
  {
    "text": "Ilhan Omar's daughter, Isra Hirsi, says she's homeless, cries poverty after suspension from $90K-per-year college over anti-Israel protests  —  The privileged daughter of Minnesota Rep. Ilhan Omar amazingly claims she's homeless and can't get food after being kicked out of her prestigious $90 … ",
    "url": "https://nypost.com/2024/04/22/us-news/ilhan-omars-daughter-says-shes-homeless-after-being-suspended-from-college-over-anti-israel-protests/"
  },
  {
    "text": "‘Civil War’ is terrifying not for what it says about America, but about journalism  —  Around 2 p.m. on Friday, I opened my laptop and bought a ticket on Fandango for that night's showing of Civil War, the No. 1 movie in America that depicts a not-too-distant U.S. future of killing fields, refugee camps and bombed-out shopping malls.",
    "url": "https://www.inquirer.com/opinion/commentary/civil-war-movie-about-journalism-20240421.html"
  },
  {
    "text": "John Legend says Trump believes ‘to his core’ that ‘Black people are inferior’  —  Singer John Legend says former President Trump is a racist down “to his core.”  —  Speaking to MSNBC's Jen Psaki on Sunday, Legend spoke of Trump's response to the Black Lives Matter protests following the 2020 murder of George Floyd.",
    "url": "https://thehill.com/blogs/in-the-know/4611098-john-legend-trump-black-people-racist/"
  },
  {
    "text": "How Trump has become angrier and more isolated on Truth Social  —  For years, Donald Trump was among Twitter's loudest and most inescapable voices: a brash, bomb-throwing businessman turned president who could capture the global news cycle with a single tweet.",
    "url": "https://www.washingtonpost.com/politics/interactive/2024/trump-truth-social-posts/"
  },
  {
    "text": "Some migrants flown by DeSantis to Martha's Vineyard qualify for victim visas, feds say  —  Some of the 49 migrants flown to Martha's Vineyard by the state of Florida are now able to legally work in the United States and have temporary protections from deportation — because they are considered victims … ",
    "url": "https://www.miamiherald.com/news/politics-government/state-politics/article287896095.html"
  },
  {
    "text": "Biden Earth Day Event Will Try to Reach Young Voters, a Crucial Bloc  —  At a national park in Virginia on Monday, the president will point to investments in clean energy and appear with future members of his American Climate Corps.  —  President Biden will travel to a national park in Virginia on Monday … ",
    "url": "https://www.nytimes.com/2024/04/22/us/politics/biden-climate-young-voters.html"
  },
  {
    "text": "Papua New Guinea leader takes offense after Biden implies an uncle was eaten by cannibals  —  MELBOURNE, Australia (AP) — Papua New Guinea's Prime Minister James Marape accused Joe Biden of disparaging the South Pacific island nation by implying that an uncle of the U.S. president had been eaten by … ",
    "url": "https://apnews.com/article/papua-new-guinea-biden-ambrose-finnegan-marape-cannibals-9479088c4262fe6879258e5ad135238f"
  },
  {
    "text": "California launches unprecedented targets to achieve carbon neutrality by 2045  —  California on Monday released a first-of-its-kind plan to harness more than half of the state's land to decrease carbon emissions.  —  Over the next two decades, the state will be working to accomplish 81 nature-based goals … ",
    "url": "https://thehill.com/policy/energy-environment/4611524-california-climate-unprecedented-nature-based-targets-carbon-neutrality/"
  },
  {
    "text": "Paying for it doesn't make it a market (permalink)  —  Anyone who says “If you're not paying for the product, you're the product” has been suckered in by Big Tech, whose cargo-cult version of markets and the discipline they impose on companies.  —  Here's the way that story goes … ",
    "url": "https://pluralistic.net/2024/04/22/kargo-kult-kaptialism/#dont-buy-it"
  },
  {
    "text": "Marjorie Taylor Greene's “space lasers” show how the GOP gets away with escalating violence  —  From Kari Lake's “strap on a Glock” to the Supreme Court coddling Capitol rioters, GOP threat levels are growing  —  Rep. Marjorie Taylor Greene sure knows how to get the attention she craves by saying something incredibly stupid.",
    "url": "https://www.salon.com/2024/04/22/marjorie-taylor-greenes-space-lasers-show-how-the-gets-away-with-escalating-violence/"
  },
  {
    "text": "The next president may be chosen by indifference  —  Those born in 1995 or after have never been able to vote in a presidential general election for any Republican besides Donald Trump.  If you were born four years after that, your choices between the two major parties have only been Trump and Joe Biden.",
    "url": "https://www.washingtonpost.com/politics/2024/04/22/voter-interest-polling-biden-trump/"
  },
  {
    "text": "The GOP's Pro-Russia Caucus Lost.  Now Ukraine Has to Win.  —  Once U.S. money starts flowing again, the dynamics of the war will change.  —  It's not too late, because it's never too late.  No outcomes are ever preordained, nothing is ever over, and you can always affect what happens tomorrow by making the right choices today.",
    "url": "https://www.theatlantic.com/ideas/archive/2024/04/republican-ukraine-russia-aid/678150/?gift=hVZeG3M9DnxL4CekrWGK3_cjBNHDlqfgMUKykcIiQBE&utm_source=copy-link"
  },
  {
    "text": "House Republicans blame Greene and Freedom Caucus for lack of border wins … - GOP leadership brought up border security provisions alongside their foreign aid package — but the package was blocked by Republicans from reaching the House floor under normal rules.",
    "url": "https://www.axios.com/2024/04/22/house-republicans-greene-border-security-foreign-aid"
  },
  {
    "text": "How Biden Can Press His Ukraine Advantage  —  A great new spot from our pals at Republican Voters Against Trump is out this morning.  “I was wondering if you guys are hiring right now,” the narrator toting the hidden camera asks a sequence of mall-store managers.  “I'm currently facing 88 felonies.",
    "url": "https://www.thebulwark.com/p/how-biden-can-press-his-ukraine-advantage"
  }
]