[
  {
    "text": "Key agencies, including some led by Trump loyalists, refuse to comply with Musk's latest demand  —  Key U.S. agencies, including the FBI, State Department and the Pentagon, have instructed their employees not to comply with cost-cutting chief Elon Musk's demand that federal workers explain … ",
    "url": "https://apnews.com/article/musk-federal-workers-trump-demand-firings-06553df358086db05917d3c50f3699d6"
  },
  {
    "text": "Kash Patel tells FBI staff to ignore Elon Musk request to list their achievements  —  Agency reportedly seeking guidance from DoJ as Musk's demand sparks confusion across key government agencies  —  The new FBI director, Kash Patel, has told his agency employees to hold off on responding … ",
    "url": "https://www.theguardian.com/us-news/2025/feb/23/elon-musk-tells-us-federal-workers-to-explain-what-they-achieved-last-week-or-be-fired"
  },
  {
    "text": "Elon Musk Threatens FBI Agents and Air Traffic Controllers With Forced Resignation if They Don't Respond to an Email  —  Employees throughout the federal government have until 11:59 pm ET Monday to detail five things they accomplished in the last week.  —  Elon Musk is once again leaving … ",
    "url": "https://www.wired.com/story/doge-elon-musk-forced-resignation-email-twitter/"
  },
  {
    "text": "New Doge/Musk Email Goes Seriously Sideways  —  We've got a fascinating story unfolding with the new Musk email I reported on below.  And yes, something can be fascinating while also being grave, dangerous and in its own way terrifying.  Over the course of the evening top leadership at the FBI … ",
    "url": "https://talkingpointsmemo.com/edblog/new-doge-musk-email-goes-seriously-sideways"
  },
  {
    "text": "Joy Reid's MSNBC Show Canceled in Major Shake-Up  —  Ms. Reid's 7 p.m. program will be replaced by a panel show co-hosted by Symone Sanders Townsend, Alicia Menendez and Michael Steele.  —  Joy Reid's evening news show on MSNBC is being canceled, part of a far-reaching programming overhaul orchestrated … ",
    "url": "https://www.nytimes.com/2025/02/23/business/msnbc-joy-reid.html?unlocked_article_code=1.zE4.FslK.eZ38_1_IrEe5&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Trump Envoy Can't Name a Single Concession Russia Will Make in Peace Deal  —  CNN host Jake Tapper exposed President Trump's negotiation strategy in the war in Ukraine as a top foreign affairs envoy struggled to point out one concession Russia would make in a peace deal.",
    "url": "https://www.thedailybeast.com/trump-envoy-steve-witkoff-cant-name-a-single-concession-russia-will-make-in-peace-deal/"
  },
  {
    "text": "Chaos erupts at legislative town hall in Coeur d'Alene  —  COEUR d'ALENE — Saturday's legislative town hall hosted by the Kootenai County Republican Central Committee turned volatile after some attendees voiced their concerns over the possible repeal of Medicaid expansion and other bills working their way through the Idaho Legislature.",
    "url": "https://cdapress.com/news/2025/feb/22/chaos-erupts-at-kcrcc-legislative-town-hall/"
  },
  {
    "text": "Hegseth: Trump Will Install New Military Attorneys Who Won't Be ‘Roadblocks to Anything’  —  The defense secretary justified the firings of top judge advocate generals  —  Secretary of Defense Pete Hegseth defended the Trump administration's purge of top military lawyers because they want people … ",
    "url": "https://www.rollingstone.com/politics/politics-news/hegseth-military-lawyers-firings-roadblocks-1235276960/"
  },
  {
    "text": "Merz declares victory in German election  —  BERLIN — Friedrich Merz's conservative alliance has won Germany's national parliamentary election, while the far right has recorded its highest-ever showing.  —  The conservatives, consisting of Merz's Christian Democratic Union (CDU) … ",
    "url": "https://www.politico.eu/article/german-election-results-2025-friedrich-merz-cdu-conservative-party-win-exit-poll/"
  },
  {
    "text": "Live Updates: Merz Appears Poised to Be Next Chancellor  —  Early exit polls suggest that Friedrich Merz, the candidate for the conservative Christian Democrats who has vowed to bring stronger leadership in Europe, will be Germany's next leader.  The hard-right AfD party was in second place.",
    "url": "https://www.nytimes.com/live/2025/02/23/world/germany-election"
  },
  {
    "text": "German election: Projections say CDU/CSU leads with 29%  —  To view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video  —  Early projections say Germany's conservative bloc has secured some 29% of the votes, emerging as the largest party ahead of the far-right AfD with around 19.5%.",
    "url": "https://www.dw.com/en/german-election-projections-say-cdu-csu-leads-with-29/live-71700729"
  },
  {
    "text": "Republicans Face Angry Voters at Town Halls, Hinting at Broader Backlash  —  After a monthlong honeymoon for the G.O.P. at the start of President Trump's term, lawmakers are confronting a groundswell of fear and disaffection in districts around the country.  —  Some came with complaints … ",
    "url": "https://www.nytimes.com/2025/02/23/us/politics/republicans-congress-town-halls-trump.html?unlocked_article_code=1.zE4.ac8t.Fpct8t-bKu6p&smid=url-share"
  },
  {
    "text": "Photos: ‘Distress flag’ towers over Yosemite to protest cuts as crowds view firefall  —  A group of frustrated Yosemite National Park staffers hoping to draw attention to the federal government's sweeping workforce cuts hung an upside-down American flag Saturday thousands of feet off the ground on the side of El Capitan.",
    "url": "https://www.sfchronicle.com/outdoors/article/yosemite-protest-job-cuts-20180229.php"
  },
  {
    "text": "Condoms for Gaza?  Ukraine started the war with Russia?  The president's manipulations of the truth lay the groundwork for radical change.  —  The United States sent $50 million in condoms to Hamas.  Diversity programs caused a plane crash.  China controls the Panama Canal.  Ukraine started the war with Russia.",
    "url": "https://www.nytimes.com/2025/02/23/us/politics/trump-alternative-reality.html"
  },
  {
    "text": "Chris Murphy Emerges as a Clear Voice for Democrats Countering Trump  —  The second-term senator from Connecticut is eschewing caution and throwing out the traditional political playbook as he seeks a broader audience for his critiques of the president and his agenda.",
    "url": "https://www.nytimes.com/2025/02/23/us/politics/chris-murphy-democrats-trump.html?unlocked_article_code=1.zE4.I5EL.cs0dK-t2A4PK&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "ICE's Next Deportation Target Is Unaccompanied Migrant Children  —  The Trump administration is taking action to deport minors who came to the U.S. without their parents  —  The Trump administration is ordering immigration agents to find and deport thousands of undocumented immigrant children … ",
    "url": "https://www.rollingstone.com/politics/politics-news/ice-deportation-target-unaccompanied-migrant-children-1235277326/"
  },
  {
    "text": "Enrique Tarrio follows and insults officers who defended US Capitol on January 6  —  Ex-leader of far-right Proud Boys trails group through lobby of Washington hotel, engaging officer Michael Fanone  —  Enrique Tarrio, the former leader of the far-right Proud Boys group who was convicted … ",
    "url": "https://www.theguardian.com/us-news/2025/feb/22/enrique-tarrio-capitol-police"
  },
  {
    "text": "Thousands in Midwestern GOP Districts Attend Sanders' First Stops on Tour to Fight Oligarchy  —  After addressing more than 3,400 Nebraska residents in Omaha Friday evening, U.S. Sen. Bernie Sanders on Saturday made his second stop on his National Tour to Fight Oligarchy—telling Iowa City … ",
    "url": "https://www.commondreams.org/news/bernie-sanders-donald-trump"
  },
  {
    "text": "Trump uses merch to monetize agenda … But this fundraising effort is the latest reminder that for Trump, the campaign never ends.  — The black “Make America Great Again” caps that Musk frequently wears have become the Trump team's second-best selling item ever — behind only the red and white MAGA hat … ",
    "url": "https://www.axios.com/2025/02/23/trump-merchandise-executive-orders"
  },
  {
    "text": "They Help Make the Hamptons the Hamptons, and Now They're Living in Fear  —  Latino immigrants care for some of America's most lavish beachside mansions.  Their disappearance would affect the wealthy, too.  —  Local officials have tried to calm undocumented workers' fears at public meetings.",
    "url": "https://www.nytimes.com/2025/02/23/nyregion/east-hampton-immigration-nannies.html"
  },
  {
    "text": "Trump halts medical research funding in apparent violation of judge's order  —  Health department orders NIH to hold Federal Register submissions - critical step in process for funding studies  —  The Trump administration has blocked a crucial step in the National Institutes of Health (NIH) … ",
    "url": "https://www.theguardian.com/us-news/2025/feb/23/trump-nih-health-medical-research"
  },
  {
    "text": "Zelenskiy says he is willing to give up presidency if it means peace in Ukraine  —  Ukraine's President Volodymyr Zelenskiy said on Sunday he was willing to give up his position if it meant peace in Ukraine, quipping that he could exchange his departure for Ukraine's entry into NATO.",
    "url": "https://www.reuters.com/world/europe/zelenskiy-says-he-is-willing-give-up-presidency-if-it-means-peace-ukraine-2025-02-23/"
  }
]