[
  {
    "text": "The Situation: The Cult of Unqualified Authenticity  —  On Pete Hegseth and the first hearing for a Trump nominee for a major cabinet position  —  Meet The Authors  —  Published by The Lawfare Institute in Cooperation With  —  The Situation on Friday reflected on the sentencing of Donald Trump in New York.",
    "url": "https://www.lawfaremedia.org/article/the-situation--the-cult-of-unqualified-authenticity"
  },
  {
    "text": "Joni Ernst Says She Will Vote to Confirm Pete Hegseth  —  The Iowa Republican's decision dramatically increases the likelihood that Mr. Hegseth will have enough votes to be confirmed as President-elect Donald J. Trump's defense secretary.  —  Senator Joni Ernst, Republican of Iowa … ",
    "url": "https://www.nytimes.com/2025/01/14/us/politics/joni-ernst-pete-hegseth-confirmation.html"
  },
  {
    "text": "Search SEC.gov & EDGAR  —  Securities and Exchange Commission v. Elon Musk, No. 1:25-cv-00105 (D.D.C. filed Jan. 14, 2025)  —  SEC Charges Elon Musk for Violating the Beneficial Ownership Reporting Requirements of the Federal Securities Laws  —  The Securities and Exchange Commission announced today … ",
    "url": "https://www.sec.gov/enforcement-litigation/litigation-releases/lr-26219"
  },
  {
    "text": "SEC Sues Musk Over Securities Violation in Federal Court  —  The Securities and Exchange Commission sued Elon Musk in federal court over an alleged securities violation, according to a court docket.  —  The agency claimed Musk failed to timely disclose a major purchase of Twitter Inc. shares ahead … ",
    "url": "https://www.bloomberg.com/news/articles/2025-01-14/sec-sues-elon-musk-over-securities-violation-in-federal-court"
  },
  {
    "text": "S.E.C. Sues Elon Musk Over Twitter-Related Securities Violations  —  Regulators filed a lawsuit in federal court stemming from Mr. Musk's $44 billion purchase of the social media company now called X.  —  U.S. securities regulators sued Elon Musk in federal court in Washington on Tuesday … ",
    "url": "https://www.nytimes.com/2025/01/14/technology/sec-elon-musk-securities-violations.html"
  },
  {
    "text": "Texas House elects new Speaker in blow to far-right wing  —  The Texas House on Tuesday elected state Rep. Dustin Burrows (R) to lead the chamber in a blow to the rising far-right wing of the party, defeating a candidate supported by Texas Attorney General Ken Paxton (R) and other top state figures.",
    "url": "https://thehill.com/homenews/state-watch/5085530-texas-house-elects-new-speaker-blow-to-far-right-wing/"
  },
  {
    "text": "Meta just flipped the switch that prevents misinformation from spreading in the United States  —  I.  —  Last week, Meta announced a series of changes to its content moderation policies and enforcement strategies designed to curry favor with the incoming Trump administration.",
    "url": "https://www.platformer.news/meta-ends-misinformation-enforcement-zuckerberg/"
  },
  {
    "text": "Playbook: Joe Biden's Irish goodbye  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  TODAY — Six big confirmation hearings dominate Capitol Hill.  AG-designate PAM BONDI kicks things off at 9:30 a.m. At 10, would-be Secretary of State MARCO RUBIO goes … ",
    "url": "https://www.politico.com/newsletters/playbook/2025/01/15/joe-bidens-irish-goodbye-00198331"
  },
  {
    "text": "Biden Races to Cement His Legacy Through a Series of Actions  —  The president has issued policy decisions in a number of areas in the final days of his term, including environmental justice, prison reform and immigration.  —  In the final days of his term, President Biden has issued a series … ",
    "url": "https://www.nytimes.com/2025/01/15/us/politics/biden-policy-decisions.html"
  },
  {
    "text": "Jack Smith reminds us of the futility of truth in the Trump era  —  Yesterday unfolded in a sort of perfectly stupid synchronicity, with the past crimes of Donald Trump, as detailed in the just-released Jack Smith report, being overshadowed by the confirmation hearing for Trump's secretary of defense nominee, Pete Hegseth.",
    "url": "https://www.publicnotice.co/p/jack-smith-final-report-trump-january-6"
  },
  {
    "text": "Yoon becomes South Korea's first sitting president to be detained after martial law chaos  —  South Korea's impeached president, Yoon Suk Yeol, was detained in a major law enforcement operation at the presidential compound Wednesday, defiantly insisting the anti-corruption agency … ",
    "url": "https://apnews.com/article/south-korea-yoon-martial-law-detain-8dd7f03661be39729741de9a3b5d1714"
  },
  {
    "text": "Scoop: Trump's $500 million post-election windfall … - “The money is just pouring in at Mar-a-Lago. … - “We're looking at half a billion [dollars] by June, and we're on track,” this adviser said. … - They include the president-elect's inauguration account, the MAGA Inc. super PAC … ",
    "url": "https://www.axios.com/2025/01/15/trump-windfall-fundraising-500-million"
  },
  {
    "text": "Michelle Obama Will Skip Trump's Inauguration  —  Mrs. Obama also declined to attend the funeral of Jimmy Carter last week, which would have put her face-to-face with Mr. Trump.  —  Michelle Obama, the former first lady, will not attend the inauguration of President-elect Donald J. Trump, her office said in a statement on Tuesday.",
    "url": "https://www.nytimes.com/2025/01/14/us/politics/michelle-obama-trump-inauguration.html"
  },
  {
    "text": "I have struggled with how to respond to Mark Zuckerberg and Facebook's descent into toxic masculinity and Neo-Nazi madness.  While I have thought about quitting Facebook, I find great value in the connections and friends I have here, and it doesn't seem fair that I should lose that because Zuckerberg is having a mid-life crisis.",
    "url": "https://www.linkedin.com/posts/marklemley_i-have-struggled-with-how-to-respond-to-mark-activity-7284685204676362241-7h9r"
  },
  {
    "text": "Jeff Bezos, Elon Musk and Mark Zuckerberg to attend Trump's inauguration  —  They will be sitting on the dais during the swearing-in as Silicon Valley leaders aim to make inroads with Trump, who attacked Big Tech during his first presidency.  —  Tech moguls Jeff Bezos … ",
    "url": "https://www.washingtonpost.com/politics/2025/01/14/jeff-bezos-elon-musk-mark-zuckerberg-attend-trump-inauguration/"
  },
  {
    "text": "The Biden-Harris Administration Record  —  Letter from President Biden  —  Four years ago, we stood in a winter of peril and a winter of possibilities.  We were in the grip of the worst pandemic in a century, the worst economic crisis since the Great Depression, and the worst attack on our democracy since the Civil War.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2025/01/15/the-biden-harris-administration-record/"
  },
  {
    "text": "How a major bank cheated its customers out of $2 billion, according to a new federal lawsuit  —  An explosive new lawsuit filed by the Consumer Financial Protection Bureau (CFPB) alleges that Capital One bank cheated its customers out of $2 billion.  According to the lawsuit … ",
    "url": "https://popular.info/p/how-a-major-cheated-its-customers"
  },
  {
    "text": "Supreme Court hears porn sites' bid to strike down online age verification laws  —  The justices are weighing mandate that adult sites must verify users aren't kids  —  The Pornhub logo displays on a smartphone screen, Sept. 23, 2024.  —  With online access to pornography … ",
    "url": "https://abcnews.go.com/Politics/supreme-court-hears-porn-sites-bid-strike-online/story?id=117439757"
  },
  {
    "text": "Russell Vought Poised to Expand Power of White House Budget Office  —  If confirmed, Mr. Vought will be at the center of President-elect Donald Trump's plans to upend the federal bureaucracy.  —  While leading the Office of Management and Budget during the first Trump administration … ",
    "url": "https://www.nytimes.com/2025/01/15/business/russell-vought-budget-office-confirmation-hearing.html?unlocked_article_code=1.pU4.YUeP.xEk4xJrmJG9o&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Trump will begin his presidency in delicate position, poll finds  —  As Donald Trump prepares to once again assume the office of the presidency, a new NPR/PBS News/Marist poll finds that, despite his claims of an “unprecedented and powerful mandate,” Trump may have to be careful about how far he decides to go with what he wants to do.",
    "url": "https://www.npr.org/2025/01/15/nx-s1-5259893/poll-trump-immigration-economy-favorability"
  },
  {
    "text": "Mike Johnson eyes April deadline to pass one big MAGA bill through the House, but GOP senators are skeptical  —  House and Senate Republicans still disagree on the best strategy to advance Trump's policy priorities on the border, energy and taxes.  A recent Trump-GOP meeting failed to resolve it.",
    "url": "https://www.nbcnews.com/politics/congress/mike-johnson-april-deadline-pass-one-big-maga-bill-house-rcna187688"
  }
]