[
  {
    "text": "Mike Lee confronted by Minnesota colleague over shooting comments  —  Sen. Mike Lee of Utah was confronted by a Senate colleague Monday over his social media post that blamed the Minnesota shootings over the weekend that killed a former Democratic legislative leader on “Marxists.”",
    "url": "https://www.politico.com/live-updates/2025/06/16/congress/tina-smith-confronts-mike-lee-00409329"
  },
  {
    "text": "‘This is not a joke’: Sen. Amy Klobuchar rips Mike Lee for posts about a deadly Minnesota shooting  —  “This isn't funny,” Sen. Klobuchar says of Lee's misleading posts about targeted slaying.  —  After spending the weekend on lockdown to protect against a gunman who shot … ",
    "url": "https://www.sltrib.com/news/politics/2025/06/16/mineesota-shootinig-sen-amy/"
  },
  {
    "text": "Mike Lee Draws Outrage for Posts Blaming Assassination on the Far Left  —  The Republican senator from Utah suggested in social media posts that the killings were the work of “Marxists,” and mocked Minnesota's Democratic governor.  He later issued a more sober condemnation of the violence.",
    "url": "https://www.nytimes.com/2025/06/16/us/politics/mike-lee-minnesota-assassination-democrats.html"
  },
  {
    "text": "Chilling details emerge in Minnesota shootings as Vance Boelter faces federal charges: ‘Stuff of nightmares’  —  Two state lawmakers were spared, authorities said.  —  Authorities gather at a baseball park in Green Isle, Minnesota, June 15, 2025.  —  The man suspected of shooting and killing … ",
    "url": "https://abcnews.go.com/US/minnesota-lawmakers-shooting-suspect-vance-boelter-due-court/story?id=122882740"
  },
  {
    "text": "Minnesota senator confronts colleague for ‘terrible’ post on shooting  —  In a post on Sunday, Sen. Mike Lee (R-Utah), appeared to blame the killings on the political left.  Sen. Tina Smith sought him out to chat.  —  Summary1  —  Less than 72 hours after the murder of a state representative … ",
    "url": "https://www.washingtonpost.com/politics/2025/06/16/mike-lee-tina-smith-minnesota-shooting/"
  },
  {
    "text": "Trump officials reverse guidance exempting farms, hotels from immigration raids  —  ICE agents have been advised to continue conducting workforce enforcement operations on agricultural businesses despite concerns the raids will negatively affect the food industry.  —  Summary21",
    "url": "https://www.washingtonpost.com/immigration/2025/06/16/trump-farms-hotels-immigration-raids/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzUwMDQ2NDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzUxNDI4Nzk5LCJpYXQiOjE3NTAwNDY0MDAsImp0aSI6IjYwNmMxMGFkLTVlYjQtNDVjNi1hYzcyLWNmZjkzMDdiYjU0NCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9pbW1pZ3JhdGlvbi8yMDI1LzA2LzE2L3RydW1wLWZhcm1zLWhvdGVscy1pbW1pZ3JhdGlvbi1yYWlkcy8ifQ.Ud1j0dRlcVjt3OzkLR8XjCdxD1Z9lIPe3jjA1qpoGF4&itid=gfta"
  },
  {
    "text": "Trump Renews Embrace of Putin Amid Ongoing Rift With Allies  —  President Trump opened his remarks at the Group of 7 gathering of industrialized nations by criticizing the decision to expel Russia from the bloc after Moscow's 2014 “annexation” of Crimea.  —  President Trump could have opened by talking about trade.",
    "url": "https://www.nytimes.com/2025/06/16/world/canada/trump-g7-russia-ukraine.html"
  },
  {
    "text": "Trump signals escalation in Israel-Iran conflict as he leaves G7 summit early … U.S. President Donald Trump on Tuesday said his early departure from the Group of Seven summit was owed to “much bigger” things than planning a ceasefire between Tel Aviv and Tehran, after urging Iranians to “immediately evacuate Tehran.”",
    "url": "https://www.cnbc.com/2025/06/17/g7-leaders-urge-de-escalation-in-middle-east-blame-iran-for-instability-and-terror-.html"
  },
  {
    "text": "GOP senator says he will oppose Senate tax, Medicaid bill  —  Wisconsin Sen. Ron Johnson (R) says he cannot support the Senate bill to enact President Trump's agenda to cut taxes, secure the border and boost defense spending because it doesn't do enough to reduce the federal deficit, telling reporters he's a “no” on the legislation.",
    "url": "https://thehill.com/homenews/senate/5353670-ron-johnson-objects-senate-bill-deficit/"
  },
  {
    "text": "Senate unveils trickiest text of Trump's “big, beautiful bill”  —  Senate Finance Committee Republicans published their text of President Trump's “one big, beautiful bill” Monday evening, which includes major tax reforms and even steeper Medicaid cuts than the House called for.",
    "url": "https://www.axios.com/2025/06/16/senate-gop-one-big-beautiful-bill-text-taxes-medicaid-cuts"
  },
  {
    "text": "The Trump Mobile T1 Phone looks both bad and impossible  —  It's supposedly made in the US, cheap, and coming this fall.  I doubt it all. … It costs $499, and you can reserve one now with a $100 down payment.  It is, according to the website, coming in September.  —  That's about all I feel confident saying.",
    "url": "https://www.theverge.com/gadgets/687492/trump-mobile-phone-t1"
  },
  {
    "text": "Trump's Smartphone Can't Be Made in America for $499 by August  —  Trump Mobile's phone shows some specs that would beat Apple's biggest, priciest iPhone models  —  When the Trump Organization said it would launch a mobile-phone service, it also said it would sell a $499 T1 Phone beginning … ",
    "url": "https://www.wsj.com/tech/trump-t1-phone-components-features-2415c7cd?st=hU7bu8&reflink=desktopwebshare_permalink"
  },
  {
    "text": "How Tough Is Iran?  A String of Military Losses Raises Questions.  —  Iran is often portrayed as one of the world's most dangerous actors, but with its attacks on Iranian defenses, nuclear sites and proxy militias, Israel has exposed a compromised and weakened adversary.",
    "url": "https://www.nytimes.com/2025/06/16/world/middleeast/iran-military-defense.html"
  },
  {
    "text": "Jury finds MyPillow founder defamed former employee for a leading voting equipment company  —  A federal jury in Colorado on Monday found that one of the nation's most prominent election conspiracy theorists, MyPillow founder Mike Lindell, defamed a former employee for a leading voting equipment company … ",
    "url": "https://apnews.com/article/mike-lindell-dominion-voting-defamation-2020-election-af473792a6e395d86ea6ca0f97742c3f"
  },
  {
    "text": "Judge rules some NIH grant cuts illegal, saying he's never seen such discrimination in 40 years  —  A federal judge ruled Monday it was illegal for the Trump administration to cancel several hundred research grants, adding that the cuts raise serious questions about racial discrimination.",
    "url": "https://apnews.com/article/nih-research-trump-cuts-dei-rfk-4fec9f308f3ff427185a12e88f260c81"
  },
  {
    "text": "FIFA Club World Cup Ticket Sales TANK After DHS Says Agents Will Be At Stadium  —  Tickets to the opening match that were once $349 (and up) could be had for just $4.  —  Turns out authoritarianism can be bad for business.  —  Sales for the FIFA Club World Cup, a series of precursor games ahead … ",
    "url": "https://www.huffpost.com/entry/fifa-club-world-cup-ticket-prices-dhs_n_68505826e4b043333688af81"
  },
  {
    "text": "Stating the obvious: Mass protests are not going to help Trump  —  Republicans continue to stand by Trump, while the rest of the country is getting fed up.  —  It's understandable that media coverage of Saturday's events would focus on an obvious political contrast: While President Donald … ",
    "url": "https://www.washingtonpost.com/opinions/2025/06/16/democrats-fear-mass-protests-trump/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzUwMDQ2NDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzUxNDI4Nzk5LCJpYXQiOjE3NTAwNDY0MDAsImp0aSI6ImQwZWY5MTQyLTY1YTMtNGM1My04YzU1LTU5ZDlmNzc5ZjFlNyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9vcGluaW9ucy8yMDI1LzA2LzE2L2RlbW9jcmF0cy1mZWFyLW1hc3MtcHJvdGVzdHMtdHJ1bXAvIn0.vakYQcFVcfOwH4-LR8tY-TTiPMWADY_ixg_d96Cp3Ko&itid=gfta"
  },
  {
    "text": "More Dems from outside Minnesota found in shooting hit list  —  A growing number of Democratic lawmakers from across the Midwest are revealing they were named on the alleged target list of Vance Boelter, the suspect in the shooting of two Minnesota state lawmakers and their spouses.",
    "url": "https://www.axios.com/2025/06/16/democrats-vance-boelter-minnesota-shooting-list"
  },
  {
    "text": "Many Exporters No Longer Want Dollars, US Bank Executive Says  —  When Paula Comings, the head of currency sales for US Bancorp, talks to US importers, she increasingly hears the same message: Their foreign counterparties no longer want to be paid in dollars.",
    "url": "https://www.bloomberg.com/news/articles/2025-06-16/many-exporters-no-longer-want-dollars-us-bank-executive-says"
  },
  {
    "text": "Explosions seen across Tehran after Trump warns Iranians to evacuate  —  At the same time as explosions were being reported, US President Donald Trump called on Iranian civilians to “immediately evacuate Tehran.”  —  Iranian media reported several explosions and heavy air defense fire in the Iranian capital of Tehran on Tuesday.",
    "url": "https://www.jpost.com/middle-east/article-857984"
  }
]