[
  {
    "text": "Trump's latest about-face: He now says 2020 election was ‘long over’  —  It's a new piece of rhetoric that Trump hopes will help him win immunity from his criminal charges.  —  In the months after the 2020 election, Donald Trump leaned on his campaign to launch ad blitzes and legal challenges … ",
    "url": "https://www.politico.com/news/2024/01/12/trump-2020-election-legal-00135230"
  },
  {
    "text": "E. Jean Carroll Wants Judge to Stop Trump From Turning Trial Into a ‘Circus’  —  Carroll's legal team on Friday questioned whether Trump can even testify — and showed his five-minute courtroom tirade in his fraud case to argue he wants to ‘sow chaos’  —  JWPlayer",
    "url": "https://themessenger.com/politics/trump-e-jean-carroll-judge-testimony-trial"
  },
  {
    "text": "‘This to Him Is the Grand Finale’: Donald Trump's 50-Year Mission to Discredit the Justice System  —  The former president is in unparalleled legal peril, but he has mastered the ability to grind down the legal system to his advantage.  It's already changing our democracy.",
    "url": "https://www.politico.com/news/magazine/2024/01/12/donald-trump-indictments-legal-system-00135151"
  },
  {
    "text": "Dean Phillips: I'm Being Blackballed — and It's Joe Biden's Fault  —  What the Minnesota Rep's unsurprising media struggles say about our news ecosystem.  —  “I'm appalled,” fumes U.S. Rep. and presidential hopeful Dean Phillips.  “I'm disappointed.  I'm disgusted that professionals … ",
    "url": "https://www.politico.com/news/magazine/2024/01/12/dean-phillips-msnbc-joe-biden-00135134"
  },
  {
    "text": "US and UK carry out strikes against Iran-backed Houthis in Yemen  —  The US and UK militaries launched strikes against Houthi targets in Houthi-controlled areas of Yemen on Thursday, marking a significant response after the Biden administration and its allies warned that the Iran-backed militant group … ",
    "url": "https://www.cnn.com/2024/01/11/politics/us-strikes-houthis-yemen/"
  },
  {
    "text": "Moderate Democrats say they'd help Mike Johnson keep his job as speaker  —  Conservatives have floated ousting Johnson over a bipartisan spending deal and Ukraine aid.  His predecessor, Kevin McCarthy, was deposed by the same group of hardliners.  —  WASHINGTON — A handful of moderate Democrats … ",
    "url": "https://www.nbcnews.com/politics/congress/moderate-democrats-say-help-mike-johnson-keep-job-speaker-rcna133711"
  },
  {
    "text": "Hunter Biden's Offer to Testify Won't Protect Him From Contempt, GOP Says  —  If Republicans 'want to play chicken with this, fine, that's their choice,' a source close to Hunter Biden told The Messenger  —  House Republicans said Friday they will continue to pursue contempt of Congress charges … ",
    "url": "https://themessenger.com/politics/hunter-bidens-offer-to-testify-wont-protect-him-from-contempt-gop-says"
  },
  {
    "text": "Oil companies will soon pay fees for emitting a climate ‘super-pollutant’  —  The action is one of the Biden administration's strongest against the fossil fuel industry under provisions of a 2022 climate law  —  The Environmental Protection Agency on Friday proposed steep new fees … ",
    "url": "https://www.washingtonpost.com/climate-environment/2024/01/12/methane-fee-epa-climate/"
  },
  {
    "text": "Americans divided on how SCOTUS should handle Trump ballot access: POLL  —  The U.S. Supreme Court will hear ballot access arguments on Feb. 8.  —  Former President and Republican presidential candidate Donald Trump campaigns, in Clinton, Iowa, Jan 6, 2024.",
    "url": "https://abcnews.go.com/US/americans-divided-scotus-handle-trump-ballot-access-poll/story?id=106300304"
  },
  {
    "text": "Elise Stefanik's Ugly “Hostages” Barb Points to Serious GOP Mayhem Ahead  —  GOP Representative Elise Stefanik no doubt thought it was shrewd to describe the rioters who attacked the Capitol as “January 6 hostages.”  This sort of talk hits a sweet trifecta for a GOP leader with seemingly limitless ambition.",
    "url": "https://newrepublic.com/article/178044/elise-stefanik-jan-6-hostages-gop-mayhem"
  },
  {
    "text": "The real Senate battleground  —  PROGRAMMING NOTE: We'll be off this Monday for Martin Luther King Jr. Day but will be back in your inboxes on Tuesday.  —  THE BUZZ: BANKING ON THE BAY — Reps. Katie Porter and Adam Schiff launched their first TV ads of the Senate campaign this week … ",
    "url": "https://www.politico.com/newsletters/california-playbook/2024/01/12/the-real-senate-battleground-00135240"
  },
  {
    "text": "Fox News Kicks Mike Lindell and His MyPillow Ads to the Curb  —  The pillow magnate claims Fox News “canceled” him for hiring Lou Dobbs, but a Fox News source with knowledge told The Daily Beast that Lindell simply hasn't paid his bills.  —  MAGA pillow magnate Mike Lindell alleges that Fox News … ",
    "url": "https://www.thedailybeast.com/fox-news-kicks-mike-lindell-and-his-mypillow-ads-to-the-curb"
  },
  {
    "text": "EXCLUSIVE: Here's The Tape of Roger Stone Discussing Assassination of Democrats — Which He Denied Ever Doing  —  Roger Stone has contested Mediaite's reporting this week regarding comments he made on tape floating the assassination of two members of Congress.",
    "url": "https://www.mediaite.com/politics/exclusive-heres-the-tape-of-roger-stone-discussing-assassination-of-democrats-which-he-denied-ever-doing/"
  },
  {
    "text": "Statement from President Joe Biden on Early Student Debt Cancellation for Borrowers Enrolled in SAVE  —  From Day One of my Administration, I vowed to fix the student loan system and make sure higher education is a pathway to the middle class - not a barrier to opportunity.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/01/12/statement-from-president-joe-biden-on-early-student-debt-cancellation-for-borrowers-enrolled-in-save/"
  },
  {
    "text": "Prosecutors to seek death penalty for white supremacist who killed 10 at Buffalo supermarket  —  Federal prosecutors said Friday that they will seek the death penalty against a white supremacist who killed 10 Black people at a Buffalo supermarket.  Payton Gendron, 20, is already serving … ",
    "url": "https://apnews.com/article/buffalo-supermarket-shooting-death-penalty-b6ab8eda541c2c0a0b512a89b0471b91"
  },
  {
    "text": "More than $482 million recovered from 1,600 millionaires who have not paid tax debts  —  WASHINGTON — The Internal Revenue Service announced today continued progress to expand enforcement efforts related to high-income individuals, large corporations and complex partnerships as part of wider efforts to transform the agency.",
    "url": "https://www.irs.gov/newsroom/irs-ramps-up-new-initiatives-using-inflation-reduction-act-funding-to-ensure-complex-partnerships-large-corporations-pay-taxes-owed-continues-to-close-millionaire-tax-debt-cases"
  },
  {
    "text": "Quaker Oats recalls more granola products due to salmonella risk  —  Quaker Oats is expanding a prior recall to include additional cereals, granola bars and snacks sold across the U.S. because they could be contaminated with salmonella.  —  The recalled products are sold throughout the 50 states … ",
    "url": "https://www.cbsnews.com/news/quaker-granola-recall-salmonella/"
  },
  {
    "text": "Iowa blizzard cancels GOP events, threatens caucus turnout  —  Candidates are canceling events, as extreme weather shuts campaigning down.  —  WEST DES MOINES, Iowa — Every campaign takes a certain number of precautions heading into the critical stretch run of a primary.",
    "url": "https://www.politico.com/news/2024/01/12/iowa-blizzard-cancels-gop-events-threatens-caucus-turnout-00135322"
  },
  {
    "text": "Supreme Court to review restrictions on homeless encampments  —  The Supreme Court said Friday it will consider whether state and local officials can punish homeless individuals for camping and sleeping in public spaces when shelter beds are unavailable.  —  The justices will review … ",
    "url": "https://www.washingtonpost.com/politics/2024/01/12/supreme-court-homeless-encampments-restrictions/"
  }
]