[
  {
    "text": "Democrats flip the script, eyeing debt limit to block Trump's agenda  —  Republicans have leveraged the debt ceiling for years to block Democrats' agenda.  Now liberals see an opening to stymie Trump.  —  DORAL, Florida — Democrats in Congress are considering forcing a showdown … ",
    "url": "https://www.washingtonpost.com/business/2025/01/27/trump-debt-ceiling-democrats/"
  },
  {
    "text": "Trump's agenda is about to hit a make-or-break moment  —  Huddling at the president's Florida resort, Republicans are looking to make a game plan.  —  House Republicans are heading to President Donald Trump's Miami-area resort for their annual policy retreat.  They're not going there for the weather.",
    "url": "https://www.politico.com/news/2025/01/27/republican-retreat-trump-doral-gop-agenda-00002101"
  },
  {
    "text": "Colombia yields on US deportation flights to avert trade war  —  A looming trade war between the US and Colombia appears to have been averted after the Colombian government agreed to allow US military flights carrying deported migrants to land in the Andean country.",
    "url": "https://www.bbc.com/news/articles/c20p36e62gyo"
  },
  {
    "text": "Nvidia falls 12% in premarket trading as China's DeepSeek triggers global tech sell-off … WATCH NOW  —  U.S. technology firms plunged in premarket trading, as Chinese startup DeepSeek sparked concerns over competitiveness in AI and America's lead in the sector, triggering a global sell-off.",
    "url": "https://www.cnbc.com/2025/01/27/nvidia-falls-10percent-in-premarket-trading-as-chinas-deepseek-triggers-global-tech-sell-off.html"
  },
  {
    "text": "Trump expected to sign executive orders to reshape the military, including banning transgender troops  —  President Donald Trump on Monday is expected to sign three executive orders that would reshape the military, including banning transgender service members from serving in the US armed forces … ",
    "url": "https://www.cnn.com/2025/01/27/politics/donald-trump-military-executive-orders/"
  },
  {
    "text": "Trump's Flaming Turd of an Argument for Ending Birthright Citizenship  —  My late father, an old-school seersucker-and-bow-tie Virginia lawyer, had his good days in court and his other days.  After one particularly fraught session in another city, he called my mother to report.  “I did just fine,” he said.",
    "url": "https://washingtonmonthly.com/2025/01/27/trumps-flaming-turd-of-an-argument-for-ending-birthright-citizenship/"
  },
  {
    "text": "Navajo Nation leaders raise alarm over reports of Indigenous people being questioned and detained during immigration sweeps  —  At least 15 Indigenous people in Arizona and New Mexico have reported being stopped at their homes and workplaces, questioned or detained by federal law enforcement … ",
    "url": "https://www.cnn.com/2025/01/27/us/navajo-detained-ice-indigenous-immigration-trump/"
  },
  {
    "text": "No. We Should Not Move Beyond ‘That’  —  The Philadelphia Eagles are going to the Super Bowl.  (So are the Kansas City Chiefs, but who cares?)  The last time the Eagles won it all, in 2018, many of the players declined an invitation to the White House to celebrate with President Trump … ",
    "url": "https://www.thebulwark.com/p/no-we-should-not-move-beyond-that"
  },
  {
    "text": "Trump Just Broke the Law.  Blatantly.  And He Might Get Away With It.  —  Imagine that there were a particularly dirty NFL player—call him Thompson—who developed a habit of doing something new and possibly dangerous to opposing players.  Penalty flags didn't deter him.  On and on he went.",
    "url": "https://newrepublic.com/article/190704/trump-fires-inspectors-general-broke-law-blatantly"
  },
  {
    "text": "Europe's Elon Musk Problem … During an american election, a rich man can hand out $1 million checks to prospective voters.  Companies and people can use secretly funded “dark money” nonprofits to donate unlimited money, anonymously, to super PACs, which can then spend it on advertising campaigns.",
    "url": "https://www.theatlantic.com/magazine/archive/2025/03/musk-tech-oligarch-european-election-influence/681453/?gift=hVZeG3M9DnxL4CekrWGK34_jHWNsAU1mvPsKLSJcYGQ&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Dem leads early Virginia governor polls  —  Former U.S. Rep. Abigail Spanberger received 44% support in two surveys.  —  Early surveys show former U.S. Rep. Abigail Spanberger (D) leading Lt. Gov. Winsome Earle-Sears (R) in the race to replace Virginia Gov. Glenn Youngkin (R) … ",
    "url": "https://pluribusnews.com/news-and-events/dem-leads-early-virginia-governor-polls/"
  },
  {
    "text": "The Meme Coin Is Just the Beginning  —  The Market for Foreign Government Business Under Trump's New Ethics Policy  —  President Trump's new meme crypto token has dropped from its pre-inaugural highs and in recent days has been valued at only $ 29 billion, a fall of 60 per cent from its peak.",
    "url": "https://executivefunctions.substack.com/p/the-meme-coin-is-just-the-beginning"
  },
  {
    "text": "Wisconsin's Supreme Court Race: A Pivotal Battle Over Abortion  —  A contest for control of Wisconsin's top court may be even nastier and more expensive than its bitter 2023 predecessor, with the fate of an 1849 abortion ban and other policies at stake.  —  Tens of millions of dollars flooding into a state election.",
    "url": "https://www.nytimes.com/2025/01/27/us/politics/wisconsin-supreme-court-race.html"
  },
  {
    "text": "The Deportation Nightmare Begins  —  Whatever Trump intends, this will spiral out of control  —  Item: On Thursday, agents of Immigration and Customs Enforcement entered the back of a small business in Newark, NJ without a warrant and arrested three undocumented workers.",
    "url": "https://paulkrugman.substack.com/p/the-deportation-nightmare-begins"
  },
  {
    "text": "Gangster's Paradise  —  Today we're going to the Bad Place.  I'm sorry in advance.  —  The argument I'm going to walk you through is that President Trump keeps inching closer to violence and his decision to remove protection from former government employees who are being targeted by Iran is a message about his intentions.",
    "url": "https://www.thebulwark.com/p/gangsters-paradise"
  },
  {
    "text": "Kristi Noem Is So Late To Her Swearing-In By JD Vance, He Leaves: Report  —  The new homeland security secretary eventually took her oath elsewhere at a notable conservative's home.  —  LOADING  —  Kristi Noem kept Vice President JD Vance waiting about 25 minutes to swear … ",
    "url": "https://www.huffpost.com/entry/kristi-noem-jd-vance-swearing-in_n_67975c1de4b0b90703e8688a"
  },
  {
    "text": "Wall Street Journal labels RFK Jr. ‘dangerous to public health’ ahead of hearings  —  The editorial board of The Wall Street Journal is coming out in opposition to Robert F. Kennedy Jr., President Trump's pick to lead the Department of Health and Human Services (HHS).",
    "url": "https://thehill.com/homenews/media/5108598-wall-street-journal-rfk-jr-hhs-trump-anti-vax/"
  },
  {
    "text": "In Exacting Retribution, Trump Aims at the Future as Well as the Past  —  The president made good on promises to seek revenge against enemies during his first week back in power, signaling in the process that anyone who crosses him in the future could also suffer.",
    "url": "https://www.nytimes.com/2025/01/27/us/politics/trump-politics-enemies-pompeo-fauci.html"
  },
  {
    "text": "Chris Hayes wants you to pay attention  —  THE SCENE  —  Chris Hayes is in the attention business, and it's in trouble.  “Public discourse is a now a war of all against all for attention,” the MSNBC host writes in The Sirens' Call, which Penguin will publish on Tuesday.",
    "url": "https://www.semafor.com/article/01/26/2025/chris-hayes-wants-you-to-pay-attention"
  },
  {
    "text": "Why Trump won't be deporting “millions” of criminals … - About 13,100 of those were convicted in homicides and are imprisoned in the U.S. They'll have deportation hearings after serving their sentences. … But being in the U.S. illegally is a civil violation, not a criminal one.",
    "url": "https://www.axios.com/2025/01/27/undocumented-immigrants-crime-deportations-trump"
  },
  {
    "text": "I Voted for John Fetterman.  He Betrayed Supporters Like Me. … I don't have a lot of political regrets, but at the very top of the list is voting for John Fetterman in 2022.  At the time, I was living in a small town called Tunkhannock in the northeast corner of Pennsylvania, where I grew up … ",
    "url": "https://www.currentaffairs.org/news/i-voted-for-john-fetterman.-he-betrayed-supporters-like-me"
  },
  {
    "text": "Some GOP senators want open committee vote on Gabbard  —  Any Republican opposition could doom the top intelligence nominee's confirmation.  —  Some Republican senators are pushing for the unusual step of making public a key vote on Tulsi Gabbard's nomination in the Senate Intelligence Committee … ",
    "url": "https://www.politico.com/news/2025/01/27/tulsi-gabbard-senate-intelligence-committee-vote-006977"
  }
]