[
  {
    "text": "Poll finds Biden damaged by debate; with Harris and Clinton best positioned to win  —  Vice President Kamala Harris is now running ahead of Trump, 42 percent to 41 percent, the survey found.  —  A top Democratic pollster has a new survey showing President Joe Biden still in contention against Donald Trump … ",
    "url": "https://www.politico.com/news/2024/07/09/biden-clinton-harris-democrat-poll-00166937"
  },
  {
    "text": "The Democratic Party Must Speak the Plain Truth to the President  —  For voters who held out hope that President Biden's failure to communicate during last month's debate was an aberration, the intervening days have offered little comfort.  —  Donald Trump's candidacy for a second term poses a grave threat to American democracy.",
    "url": "https://www.nytimes.com/2024/07/08/opinion/editorials/democrats-biden-truth.html"
  },
  {
    "text": "July 2024 National Poll: Trump 46%, Biden 43%  —  Home Polls July 2024 National Poll: Trump 46%, Biden 43%  —  The latest Emerson College Polling survey finds former President Donald Trump leading President Joe Biden in a national matchup, 46% to 43%; 11% are undecided.",
    "url": "https://emersoncollegepolling.com/july-2024-national-poll-trump-46-biden-43/"
  },
  {
    "text": "Kamala Harris beats Donald Trump, new poll shows, performs better than Joe Biden  —  WASHINGTON — Vice President Kamala Harris could narrowly beat Donald Trump in November, according to a new national poll from a Democratic pollster.  —  Harris is ahead by 1 point in the poll conducted … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/07/09/harris-beat-trump-poll-biden/74333759007/"
  },
  {
    "text": "J.D. Vance Has a Problem on His Face  —  J.D. VANCE IS THE BEST BET on the predictive markets to be Donald Trump's running mate.  But an only-in-MAGAville issue might stand in the Ohio Republican's way: facial hair.  —  “J.D. has a beard.  But Trump is a clean-shaven guy.",
    "url": "https://www.thebulwark.com/p/jd-vance-has-a-problem-on-his-face"
  },
  {
    "text": "Playbook PM: Haley releases delegates to Trump  —  THE CATCH-UP  —  SCOOP: HALEY RELEASES DELEGATES — Former South Carolina Gov. NIKKI HALEY is releasing all of her 97 delegates and urging them to vote for DONALD TRUMP at next week's Republican National Convention, our colleague Meridith McGraw reports.",
    "url": "https://www.politico.com/newsletters/playbook-pm/2024/07/09/scoop-haley-releases-delegates-to-trump-00132333"
  },
  {
    "text": "House Dems' ‘sad’ venting session yields no clear path forward on Biden's future  —  In a private Tuesday meeting, multiple House Democrats made the case for replacing the president at the top of the ticket, while House Minority Leader Hakeem Jeffries advised members to stay unified.",
    "url": "https://www.politico.com/news/2024/07/09/house-dems-vent-00167036"
  },
  {
    "text": "The media has been breathlessly attacking Biden.  What about Trump?  —  The bigger story is Donald Trump's appalling unfitness for office.  He tried to overturn a legitimate election and is a felon  —  It's possible for two conflicting ideas to be true at once.",
    "url": "https://www.theguardian.com/commentisfree/article/2024/jul/09/biden-media-attacks-trump-felon"
  },
  {
    "text": "Navy sailor tried to access Biden's medical records multiple times  —  A junior Navy sailor attempted to access the medical records of President Biden from a military medical database three times in February but was unable to do so, the U.S. Navy confirms to CBS News.",
    "url": "https://www.cbsnews.com/news/navy-sailor-tries-to-access-biden-medical-records/"
  },
  {
    "text": "How Biden's Inner Circle Worked to Keep Signs of Aging Under Wraps  —  Aides kept a tight rein on the president's travel plans, news conferences, public appearances and meetings with donors while Biden's stumbles became increasingly obvious",
    "url": "https://www.wsj.com/politics/policy/joe-biden-age-public-election-campaign-343a47bf"
  },
  {
    "text": "White House doctor offers explanation for Parkinson's expert's visits  —  The doctor held regular Neurology clinics at the White House, she said  —  In a letter released late Monday night by the president's physician, Dr. Kevin O'Connor, he confirmed that Dr. Kevin Cannard … ",
    "url": "https://abcnews.go.com/Politics/white-house-doctor-offers-explanation-parkinsons-experts-visits/story?id=111764565"
  },
  {
    "text": "Marla Maples Is Reportedly Ready to Throw Her Hat in the Trump VP Ring  —  ALL IS FORGIVEN  —  The former president's second wife opened up on her relationship with Trump and 2024 in a new interview, and sources tell the Evening Standard she's ready to join the veepstakes.",
    "url": "https://www.thedailybeast.com/marla-maples-is-reportedly-ready-to-throw-her-hat-in-the-trump-vp-ring"
  },
  {
    "text": "A Dangerous Double Standard  —  All our energies must go to defeating Trump  —  What a weekend.  You know I have seen some things in my seven decades covering American politics.  I have never seen anything quite like the wrangling, hand-wringing, and behind-the-scenes gamesmanship currently swirling around President Biden.",
    "url": "https://steady.substack.com/p/a-dangerous-double-standard"
  },
  {
    "text": "Conservative MP attacked online after praising police for arrest in alleged homophobic crime  —  Michelle Ferreri applauded arrest of man after Pride flag was torched  —  Conservative MP Michelle Ferreri is praising the Peterborough Police Service for arresting a man accused of hurling homophobic slurs … ",
    "url": "https://www.cbc.ca/news/politics/conservative-mp-homophobic-hate-crime-1.7257454"
  },
  {
    "text": "In Satirical Spoof, Exxon Admits to Gaslighting Public on Climate Change  —  Director Adam McKay's Yellow Dot Studios slams the fossil fuel company's attempt to hoodwink consumers into taking the blame for the climate crisis  —  In February, ExxonMobil CEO Darren Woods pointed a finger … ",
    "url": "https://www.rollingstone.com/politics/politics-news/exxon-satirical-ad-gaslighting-public-climate-change-1235055226/"
  },
  {
    "text": "U.S. Officials Say Russia Is Unlikely to Take Much More Ukrainian Territory  —  Russian forces continue to inflict pain, but NATO leaders gathering in Washington can say that their efforts to strengthen Ukraine are working.  —  Russia is unlikely to make significant territorial gains … ",
    "url": "https://www.nytimes.com/2024/07/09/us/politics/russia-ukraine-nato.html"
  },
  {
    "text": "AOC Breaks Her Post-Debate Silence With Ringing Biden Endorsement  —  ‘MATTER IS CLOSED’  —  Rep. Alexandria Ocasio-Cortez (D-NY) told reporters Monday that after speaking “extensively” with President Joe Biden over the weekend, she is supporting his reelection bid.",
    "url": "https://www.thedailybeast.com/aoc-breaks-her-post-debate-silence-with-ringing-biden-endorsement"
  }
]