[
  {
    "text": "Playbook: How the push to unseat Johnson could unfold  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  WHAT UNION JOE IS READING — “Tennessee workers at VW plant vote to unionize with UAW,” by The Tennessean's Todd Price and Gary Estwick … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/04/20/how-the-push-to-unseat-johnson-could-unfold-00153483"
  },
  {
    "text": "US House approves $61bn in military aid for Ukraine after months of stalling  —  Ukrainian president thanks America after Speaker Mike Johnson secures bipartisan support for funding Ukraine, Israel and Taiwan  —  After months of stalling, the US House of Representatives finally approved … ",
    "url": "https://www.theguardian.com/us-news/2024/apr/20/us-house-approves-61bn-aid-ukraine"
  },
  {
    "text": "House passes foreign aid bills to Israel, Ukraine and Taiwan  —  The House of Representatives has voted to pass roughly a $95 billion foreign aid package that includes funding to Ukraine, Israel and Taiwan.  —  Democratic support outweighed Republican opposition from those who had various frustrations … ",
    "url": "https://npr.org/2024/04/20/1245993370/house-ukraine-israel-aid-bills"
  },
  {
    "text": "Trump Privately Rages About His Sketch Artist, Courtroom Nap Reports  —  The former president's anger during the first week of his New York hush money trial was “maxed out, even for him,” a source tells Rolling Stone  —  Donald Trump, if you take it from him, is cherishing the opportunity … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-trial-mad-haberman-sketch-artist-1235007794/"
  },
  {
    "text": "Trump forced to listen silently to people insulting him as he trades a cocoon of adulation for court  —  He seems “selfish and self-serving,” said one woman.  The way he carries himself in public “leaves something to be desired,” said another.  —  His “negative rhetoric and bias,” said another man, is what is “most harmful.”",
    "url": "https://apnews.com/article/trump-trial-jurors-hush-money-criticism-b4fe05a61ed566a587523d1120b46a76"
  },
  {
    "text": "Volkswagen workers in Tennessee pass historic vote to unionize  —  Victory marks the first win in the United Auto Workers campaign to organize the Southern factories of a dozen automakers  —  Volkswagen workers in Chattanooga, Tenn., passed a historic vote to join the United Auto Workers on Friday … ",
    "url": "https://www.washingtonpost.com/business/2024/04/19/vw-uaw-tennessee-vote/"
  },
  {
    "text": "Biden celebrates Tennessee Volkswagen plant's vote to join UAW  —  President Biden celebrated the “historic vote” Friday for workers at a Tennessee Volkswagen plant to join the United Auto Workers (UAW) union.  —  “Congratulations to the workers at Volkswagen in Chattanooga, Tennessee … ",
    "url": "https://thehill.com/homenews/state-watch/4608235-biden-celebrates-tennessee-volkswagen-plant-vote-join-uaw/"
  },
  {
    "text": "‘Yes, I Did It’: Politician Confesses to Murdering Wife on Social Media  —  ‘I DID EVERYTHING RIGHT’  —  “The lying wretch got what she deserved,” he wrote, among other disturbing things.  —  A politician in Russia's Tver region has sent shockwaves through the country after apparently confessing … ",
    "url": "https://www.thedailybeast.com/yes-i-did-it-politician-confesses-to-murdering-wife-on-social-media"
  },
  {
    "text": "Michael Avenatti says he's talking to Trump's legal team — and would testify for the ex-prez  —  Disgraced Stormy Daniels' attorney Michael Avenatti has been in contact with former President Trump's legal defense team and is ready and willing to testify against his former client, he told The Post in an interview from jail.",
    "url": "https://nypost.com/2024/04/20/us-news/michael-avenatti-says-hes-in-conversations-with-trump-legal-team/"
  },
  {
    "text": "US weighs sending additional military advisers to Ukraine as Russia gains momentum  —  The troops would be serving in a non-combat role, officials said.  —  The U.S. is considering sending additional military advisers to the embassy in Kyiv, the latest show of American commitment to Ukraine … ",
    "url": "https://www.politico.com/news/2024/04/20/us-troops-ukraine-00153499"
  },
  {
    "text": "Musk Says Maher Hit Bullseye Comparing Nickelodeon to Neverland Ranch  —  ANTI-WOKE  —  “Wow, Bill Maher hits the bullseye,” Musk wrote on social media.  —  Bill Maher has labeled kids' TV network Nickelodeon as “Neverland Ranch with craft services”—and teed off on progressives' views … ",
    "url": "https://www.thedailybeast.com/elon-musk-says-bill-maher-hit-bullseye-comparing-nickelodeon-to-neverland-ranch"
  },
  {
    "text": "Russia's War Against Evangelicals  —  After they beat Azat Azatyan so bad blood came out of his ears; after they sent electric shocks up his genitals; after they wacked him with pipes and truncheons, the Russians began to interrogate him about his faith.  “When did you become a Baptist?",
    "url": "https://time.com/6969273/russias-war-against-evangelicals/"
  },
  {
    "text": "Hillary Clinton: ‘What Trump really wants’ is to ‘kill his opposition’  —  Former Secretary of State Hillary Clinton said that former President Trump aspires to be like Russian President Vladimir Putin  —  Former Secretary of State Hillary Clinton suggested on a podcast Friday that her old rival … ",
    "url": "https://www.foxnews.com/media/hillary-clinton-what-trump-really-wants-kill-opposition"
  },
  {
    "text": "Four ‘Three Percenter’ militia members sentenced to prison over Jan. 6 charges  —  Four “Three Percenter” militia members were sentenced to prison Friday over charges related to the Jan. 6, 2021 Capitol riot, according to a press release from the U.S. Attorney's Office for the District of Columbia.",
    "url": "https://thehill.com/regulation/court-battles/4608101-three-percenter-militia-members-sentenced-prison-jan-6-charges/"
  }
]