[
  {
    "text": "Baltimore bridge collapse caused by DEI efforts, Utah Rep. Phil Lyman says  —  Lyman, who is also running for Utah governor, blamed diversity efforts for the disaster.  —  Phil Lyman, a Utah Republican lawmaker and candidate for governor, quickly used Baltimore's Francis Scott Key Bridge collapse … ",
    "url": "https://www.sltrib.com/news/politics/2024/03/26/baltimore-bridge-collapse-caused/"
  },
  {
    "text": "6 missing construction workers likely died in Francis Scott Key bridge collapse  —  As six construction workers remained unaccounted for after the Francis Scott Key Bridge collapsed Tuesday morning an executive with the company where they worked and Maryland's Coast Guard said it is presumed they had died.",
    "url": "https://www.thebaltimorebanner.com/community/transportation/key-bridge-collapse-YDNMRSLMDREE7ADUZJQFQJ3WDA/"
  },
  {
    "text": "Baltimore bridge collapses after powerless cargo ship rams into support column; 6 people are missing  —  A container ship lost power and rammed into a major bridge in Baltimore early Tuesday, causing it to snap and plunge into the river below.  Several vehicles fell into the chilly waters, and rescuers are searching for survivors.",
    "url": "https://apnews.com/article/baltimore-bridge-collapse-53169b379820032f832de4016c655d1b"
  },
  {
    "text": "Key Bridge collapses into Patapsco River in Baltimore after vessel hits support column; state of emergency declared  —  Baltimore's Francis Scott Key Bridge collapsed early Tuesday after a container ship struck a support column, sending at least seven cars into the Patapsco River … ",
    "url": "https://www.baltimoresun.com/2024/03/26/key-bridge-collapses-into-patapsco/"
  },
  {
    "text": "NBC News to drop ex-RNC chair Ronna McDaniel after Rachel Maddow, ‘Morning Joe’ revolt  —  NBC News plans to drop former Republican National Committee boss Ronna McDaniel as a paid contributor after network stars including MSNBC prime time headliner Rachel Maddow and the co-hosts of “Morning Joe” … ",
    "url": "https://nypost.com/2024/03/26/media/nbc-news-to-drop-ex-rnc-chair-ronna-mcdaniel-after-rachel-maddow-morning-joe-revolt/"
  },
  {
    "text": "NBC reverses decision to hire Ronna McDaniel after on-air backlash  —  The network's biggest stars had lambasted the hiring across MSNBC's lineup on Monday, with more critiques expected this week  —  Amid a chorus of on-air protest from some of the network's biggest stars … ",
    "url": "https://www.washingtonpost.com/style/media/2024/03/26/nbc-drops-ronna-mcdaniel-backlash/"
  },
  {
    "text": "‘Assured failure’: Ex-White House lawyer provides new details of final days of Trump's 2020 election gambit  —  Pat Philbin gave his first public testimony about the chaotic final days of the Trump presidency.  —  Donald Trump's deputy White House counsel, Pat Philbin, was nervous.",
    "url": "https://www.politico.com/news/2024/03/26/white-house-trump-2020-00149195"
  },
  {
    "text": "Trump ally Clark attempted ‘coup’ at US Justice Dept, ethics counsel says  —  Jeffrey Clark, a former senior official in the U.S. Justice Department, made false claims as he attempted to enlist the agency in former President Donald Trump's efforts to undo his 2020 election loss, a Washington ethics lawyer said on Tuesday.",
    "url": "https://www.reuters.com/world/us/trump-justice-official-clark-faces-ethics-hearing-over-2020-election-role-2024-03-26/"
  },
  {
    "text": "Trump's Truth Social is now a public company.  Experts warn its multibillion-dollar valuation defies logic  —  New York CNN  —  For the first time in almost 30 years, part of Donald Trump's business empire has gone public.  Trading started with a bang, but the frenzy eased considerably … ",
    "url": "https://www.cnn.com/2024/03/26/markets/trump-media-stock-truth-social/"
  },
  {
    "text": "Trump's Media Company Worth Nearly $8 Billion on First Trading Day  —  Trump Media & Technology Group, fresh from a merger with a cash-rich shell company, started trading on the Nasdaq, adding billions of dollars to the former president's wealth.  —  Former President Donald J. Trump's social … ",
    "url": "https://www.nytimes.com/2024/03/26/business/trump-media-stock.html"
  },
  {
    "text": "Judge Imposes Gag Order on Trump in Manhattan Criminal Trial  —  The order limiting the former president's speech came the day after Justice Juan M. Merchan set an April 15 trial date for the hush-money case.  —  The New York judge presiding over one of Donald J. Trump's criminal trials imposed … ",
    "url": "https://www.nytimes.com/2024/03/26/nyregion/trump-trial-gag-order.html"
  },
  {
    "text": "Judge issues gag order barring Donald Trump from commenting on witnesses, others in hush money case  —  A New York judge issued a gag order Tuesday barring Donald Trump from making public statements about witnesses, prosecutors, court staff and jurors in his upcoming hush-money criminal trial.",
    "url": "https://apnews.com/article/trump-gag-order-hush-money-new-york-68317dee722581bfbde51c305788b614"
  },
  {
    "text": "The Utter Ridiculousness of ‘Trump Bibles’  —  LONG CON DON  —  The criminally indicted, twice-divorced, sexual-assaulting ex-president doesn't have many people left to con—so he's going back to evangelicals as his marks. … Is there any better way to celebrate the glory of the Resurrection … ",
    "url": "https://www.thedailybeast.com/the-utter-ridiculousness-of-trump-bibles"
  },
  {
    "text": "Banning abortion is increasing government regulation, no matter what the New York Times tells you  —  The New York Times has another one of those gauzy profiles of conservatives it loves so much, this one focused on Erin Hawley 1 and her attempts to ban medical care for women … ",
    "url": "https://www.findinggravity.net/p/banning-abortion-is-increasing-government"
  },
  {
    "text": "A Supreme Court Justice Sounds a Warning  —  Former Supreme Court Justice Stephen Breyer says in a new book and interview that conservative justices' approach can't serve the country and is doomed to fail.  —  When Justice Stephen Breyer stepped down from the Supreme Court in 2022 … ",
    "url": "https://www.politico.com/news/magazine/2024/03/26/stephen-breyer-supreme-court-interview-00148948"
  },
  {
    "text": "Ken Paxton agrees to community service, paying restitution to avoid trial in securities fraud case  —  Paxton, who will not have to enter a plea under the terms of the agreement, faced the prospect of decades in prison if he had been convicted of fraud.  —  HOUSTON — Prosecutors on Tuesday agreed … ",
    "url": "https://www.texastribune.org/2024/03/25/ken-paxton-plea-deal-securities-fraud-felony/"
  },
  {
    "text": "Qatari royal invested about $50 million in pro-Trump network Newsmax  —  Before and after the investment, senior newsroom leaders urged Newsmax staff to soften coverage of Qatar, current and former employees said  —  A member of the Qatari royal family invested roughly $50 million in Newsmax … ",
    "url": "https://www.washingtonpost.com/nation/2024/03/26/qatar-newsmax-investment/"
  },
  {
    "text": "Rep. Jamie Raskin Calls For Hearing On ‘Influence Peddling’ By Jared Kushner  —  Donald Trump's son-in-law has been a poster boy for cashing in on government service in basically the same way that Republicans claim the Bidens have done.  —  LOADING  —  WASHINGTON ― … ",
    "url": "https://www.huffpost.com/entry/jamie-raskin-james-comer-jared-kushner_n_66030b4ae4b006c390571b90"
  },
  {
    "text": "Misinformation runs rampant after Baltimore bridge collapse … - The crew of the Singapore-flagged Dali issued a mayday call before striking the bridge and notified authorities that it was experiencing a power issue, according to Maryland Gov. Wes Moore.  — Paul Wiedefeld … ",
    "url": "https://www.axios.com/2024/03/26/francis-scott-key-bridge-collapse-reasons-conspiracy"
  },
  {
    "text": "Missouri AG sues Media Matters over its X research, demands donor names  —  Media watchdog slams “meritless, expensive, and harassing investigations.”  —  Missouri Attorney General Andrew Bailey yesterday sued Media Matters in an attempt to protect Elon Musk and X from the nonprofit watchdog … ",
    "url": "https://arstechnica.com/tech-policy/2024/03/missouri-ag-sues-media-matters-in-lawsuit-echoing-elon-musks-complaints/"
  },
  {
    "text": "Obama, Fearing Biden Loss to Trump, Is on the Phone to Strategize  —  The former president and the current one are now on the same page about Joseph R. Biden Jr.'s political future.  It was not always that way.  —  As the election approaches, President Biden is making regular calls … ",
    "url": "https://www.nytimes.com/2024/03/26/us/politics/obama-biden.html"
  },
  {
    "text": "BlackRock CEO Larry Fink wants Boomers to fix ‘retirement crisis’: 'It's no wonder younger generations, Millennials and Gen Z, are so economically anxious'  —  BlackRock Inc. Chief Executive Officer Larry Fink warned of a looming “retirement crisis” facing the US and called on baby boomers … ",
    "url": "https://fortune.com/2024/03/26/blackrock-ceo-larry-fink-boomers-fix-retirement-crisis-millennials-gen-z-economically-anxious/"
  }
]