[
  {
    "text": "Harris sees boost in favorability after Biden drops out of race: POLL  —  The vice president's approval among independents jumped, poll finds.  —  Vice President Kamala Harris speaks during the American Federation of Teachers' 88th national convention, on July 25, 2024, in Houston, Texas.",
    "url": "https://abcnews.go.com/Politics/harris-sees-boost-favorability-after-biden-drops-race/story?id=112306763"
  },
  {
    "text": "'Don't sleep on Florida': Harris candidacy jolts battered state Democrats  —  The state is seeing more Democratic volunteers, but the party is up against serious GOP headwinds.  —  TALLAHASSEE, Florida — Vice President Kamala Harris' catapult to the top of the ticket has given Florida Democrats a rush of adrenaline.",
    "url": "https://www.politico.com/news/2024/07/28/kamala-harris-florida-election-00171420"
  },
  {
    "text": "Buttigieg says voters have transferred their concerns about age to Trump  —  “How could anybody not watch the stuff he's saying, the rambling on the trail, and not be just a little bit concerned?” he said.  —  Secretary of Transportation Pete Buttigieg said Sunday that with incumbent Joe Biden … ",
    "url": "https://www.politico.com/news/2024/07/28/buttigieg-voters-trump-age-00171533"
  },
  {
    "text": "Hill Dems believe this VP contender would help address Harris' biggest weakness  —  Some congressional Democrats believe the Arizona senator could help Harris on immigration.  —  A growing number of House Democrats are telling Kamala Harris that she should pick Sen. Mark Kelly as her vice president … ",
    "url": "https://www.politico.com/news/2024/07/28/dems-push-mark-kelly-vp-00171422"
  },
  {
    "text": "Playbook: Harris sprints out of the gates  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  COUNTDOWN — Election Day is 100 days away.  —  BLUE HEAT — What a difference a week makes.  —  Seven days ago at this time, Democrats felt wobbly at best … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/07/28/harris-sprints-out-of-the-gates-00171531"
  },
  {
    "text": "Harris raised $200M in first week of White House campaign and signed up 170,000 volunteers  —  Vice President Kamala Harris' campaign has raised $200 million since she emerged as the likely Democratic presidential nominee last week, an eyepopping haul in her race against the Republican nominee, former President Donald Trump.",
    "url": "https://apnews.com/article/harris-campaign-fundraising-200-million-5db5d7c5001c87377e4ba11250fff597"
  },
  {
    "text": "Harris raises $200 million in first week of campaign … - Former President Trump and the Republican National Committee had been catching up to Biden and the Democratic National Committee in fundraising before Biden's extraordinary decision to drop out.  — Harris' fundraising haul will give … ",
    "url": "https://www.axios.com/2024/07/28/kamala-harris-2024-donations-fundraising-biden-trump"
  },
  {
    "text": "'We all realize it's unlikely.' But Pete Buttigieg's VP stock is rising.  —  He has taken heat in his role in the Biden administration.  But to some Harris advisers, he makes an intriguing pitch.  —  Suddenly, Pete Buttigieg is everywhere.  —  The transportation secretary is blitzing … ",
    "url": "https://www.politico.com/news/2024/07/28/pete-buttigieg-longshot-vp-harris-00171515"
  },
  {
    "text": "In Tim Walz, Democrats see a potential VP pick who can shore up the ‘blue wall’  —  The Minnesota governor's allies argue his appeal to rural and working-class voters as well as progressives could offer Kamala Harris a unique boost.  —  When Minnesota Gov. Tim Walz showed up on MSNBC's … ",
    "url": "https://www.nbcnews.com/politics/2024-election/tim-walz-kamala-harris-vp-blue-wall-rcna163436"
  },
  {
    "text": "Trump faces backlash for 'in four years, you don't have to vote again' remark  —  Some Democrats say his comments, directed at a Christian audience, signaled his plans to be a dictator.  His campaign says he was talking about ‘uniting’ the country, and experts point to his ‘deliberately ambiguous’ speaking style.",
    "url": "https://www.washingtonpost.com/politics/2024/07/27/trump-faces-backlash-four-years-you-dont-have-vote-again-remark/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzIyMDUyODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzIzNDM1MTk5LCJpYXQiOjE3MjIwNTI4MDAsImp0aSI6ImFmYWExNWViLTQ5NzItNDk2ZC05MjM0LTg2YzQ3YzdiNjY2NCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzA3LzI3L3RydW1wLWZhY2VzLWJhY2tsYXNoLWZvdXIteWVhcnMteW91LWRvbnQtaGF2ZS12b3RlLWFnYWluLXJlbWFyay8ifQ.3gulIE3VIPD7kmmqW2y6EgohBci3V57klKtzdZNms2M&itid=gfta"
  },
  {
    "text": "Elon Musk Shares Manipulated Harris Video, in Seeming Violation of X's Policies  —  The billionaire owner of the social media platform X reposted a video that mimics Vice President Kamala Harris's voice, without disclosing that it had been altered.  —  Elon Musk, the world's richest man … ",
    "url": "https://www.nytimes.com/2024/07/27/us/politics/elon-musk-kamala-harris-deepfake.html?unlocked_article_code=1.-k0.B2HH.1C3LSFn2VOaS&smid=url-share"
  },
  {
    "text": "'Maybe I've Gotten Worse': Trump Makes Clear That Unity Is Over  —  At a rally in Minnesota on Saturday, former President Donald J. Trump once more escalated his attacks against Vice President Kamala Harris, painting her as extreme and mocking her demeanor.  —  Early in his speech in Minnesota … ",
    "url": "https://www.nytimes.com/2024/07/28/us/politics/trump-vance-unity-minnesota.html"
  },
  {
    "text": "US Farmers Want to Adapt to Climate Change, But Crop Insurance Won't Let Them  —  Growers looking to transition to regenerative agriculture are running into a federal insurance barrier.  —  In Kansas, where a prolonged drought has killed crops and eroded the soil, Gail Fuller's farm is like an oasis.",
    "url": "https://www.bloomberg.com/news/features/2024-07-28/crop-insurance-won-t-let-some-farmers-adapt-to-climate-change"
  },
  {
    "text": "‘Litigation is a certainty’: Trump's call to end birthright citizenship would face a mountain of opposition  —  An executive order would kick-start a legal fight that could lead to a Supreme Court ruling on the issue.  —  WASHINGTON — When Donald Trump took office in 2017 … ",
    "url": "https://www.nbcnews.com/politics/2024-election/litigation-certainty-trumps-call-end-birthright-citizenship-face-mount-rcna162314"
  }
]