[
  {
    "text": "Trump aides alarmed he's ‘just golfing all day and stewing’ as election slips away: WaPo  —  According to a report from the Washington Post, Donald Trump's inner circle grew increasingly alarmed at his complacency during the Democratic National Convention and had to convince him to hit … ",
    "url": "https://www.rawstory.com/trump-campaign-faltering/"
  },
  {
    "text": "Harris leading Trump by 7 points: Poll  —  Vice President Harris holds a 7-point edge over former President Trump nationally in a new poll, marking the latest gain for the Democratic presidential candidate as the general election approaches.  —  A survey from Fairleigh Dickinson University … ",
    "url": "https://thehill.com/homenews/campaign/4846433-harris-leading-trump-by-7-points-poll/"
  },
  {
    "text": "Joyless Lindsey Graham: Democrats' Joy 'Doesn't Exist in Real World'  —  GLASS HALF FULL  —  The Republican senator made the comments in response to the DNC “love fest” during an appearance on CNN's “State of the Union.”  —  Republican Senator Lindsey Graham said he isn't buying all that Democratic … ",
    "url": "https://www.thedailybeast.com/lindsey-graham-says-joy-doesnt-exist-in-the-real-world"
  },
  {
    "text": "Watch: Scott Jennings laughed at on CNN for claiming 'People don't want to feel joy'  —  It did not take long on Sunday morning for conservative CNN political commentator Scott Jennings to realize he had stepped in it when he claimed, “People don't want to feel joy” during his appearance on “State of the Union.”",
    "url": "https://www.rawstory.com/scott-jennings-cnn-joy/"
  },
  {
    "text": "The DNC Gave Kamala Harris a Major Boost  —  The campaign raised over $80 million while attracting an army of volunteers.  —  The Democratic National Convention wasn't just four days of good vibes: It was also the cause of a major fundraising and volunteer boom for the Harris-Walz ticket.",
    "url": "https://www.motherjones.com/politics/2024/08/kamala-harris-post-dnc/"
  },
  {
    "text": "Harris campaign says it has raised $540M, sees surge of donations during DNC  —  Vice President Kamala Harris' campaign says it has now raised $540 million for its election battle against Republican nominee former President Donald Trump.  —  The campaign has had no problems getting supporters … ",
    "url": "https://apnews.com/article/kamala-harris-donald-trump-fundraising-43b32b26125229db182234f7ec06da14"
  },
  {
    "text": "Be Careful What Trump's Lawyers Wish For, Superseding Indictment Edition  —  On Friday, first Bloomberg (Yahoo version), then NYT reported that Jack Smith “has decided against seeking a major hearing” to address which of the allegations charged against Donald Trump were official versus unofficial acts.",
    "url": "https://www.emptywheel.net/2024/08/25/be-careful-what-trumps-lawyers-wish-for-superseding-indictment-edition/"
  },
  {
    "text": "Sunday Snapshot: Trump's ambiguous abortion messaging … 1. GOP lawmakers struggle with Trump's abortion policies … - Philip Klein, the editor of the conservative National Review Online, wrote Friday in a piece titled “Trump's Abandonment of Pro-Lifers Is Complete,” that with his Truth Social post … ",
    "url": "https://www.axios.com/2024/08/25/trump-reproductive-rights-sunday-snapshot"
  },
  {
    "text": "Trump's pledge to be ‘great for women and their reproductive rights’ angers advocates  —  The former president invoked language more commonly used by Democrats, and anti-abortion advocates quickly took notice of his tonal shift.  —  Donald Trump attempted to strike a new tone on the issue … ",
    "url": "https://www.politico.com/news/2024/08/24/trump-abortion-reactions-00176276"
  },
  {
    "text": "Lara Trump on DNC: 'They're attempting to run on hating Donald Trump'  —  Republican National Committee (RNC) co-chair Lara Trump said on Sunday she thought Democrats focused too much on bashing former President Trump during last week's convention and should have spent more time outlining their policy goals.",
    "url": "https://thehill.com/homenews/campaign/4846936-lara-trump-donald-trump-dnc/"
  },
  {
    "text": "How I've been convincing Christians they don't have to vote Republican  —  Democrats need to embrace the idea that evangelicals, and especially white male evangelicals, are worth winning and can be won.  —  During the last month, Christians for Kamala joined the ranks of groups supporting … ",
    "url": "https://www.msnbc.com/opinion/msnbc-opinion/christians-kamala-can-pull-evangelical-voters-away-donald-trump-rcna167561"
  },
  {
    "text": "Why Were Justice Dept. Officials Scared to Talk to This Book's Author?  —  In “Where Tyranny Begins,” the journalist David Rohde reveals how former President Donald Trump tried to use the federal law enforcement agency to help himself and punish his foes.  —  Buy Book ▾",
    "url": "https://www.nytimes.com/2024/08/25/books/review/where-tyranny-begins-david-rohde.html?unlocked_article_code=1.Fk4.BuNG.jijwJoTIiZtS&smid=nytcore-ios-share&referringSource=articleShare&sgrp=c-cb"
  },
  {
    "text": "Ignore my brother Bobby, Max Kennedy says  —  I'm heartbroken over my brother Bobby's endorsement of Donald Trump.  —  I think often about my father and how he might have viewed the politics of our time.  I'm not sure what he would have thought about TikTok or AI, but this much I know for sure: He would have despised Donald Trump.",
    "url": "https://www.latimes.com/opinion/story/2024-08-25/robert-kennedy-donald-trump-kamala-harris"
  },
  {
    "text": "Trump event at wall Obama built highlights an unkept promise  —  The Republican nominee heaped praise on a section of barrier that was actually built by his predecessor.  —  MONTEZUMA PASS, Ariz. — A brown ribbon carved a straight gash across a vast, flat desert basin, the only mark of human civilization visible on this wilderness.",
    "url": "https://www.washingtonpost.com/politics/2024/08/25/trump-event-wall-obama-built-highlights-an-unkept-promise/"
  }
]