[
  {
    "text": "Judge Denies Trump's Bid to Throw Out Conviction Over Immunity Ruling  —  Justice Juan M. Merchan thwarted one of several attempts by Donald J. Trump to clear his record of 34 felonies before returning to the White House.  —  A judge on Monday rejected Donald J. Trump's argument … ",
    "url": "https://www.nytimes.com/2024/12/16/nyregion/trump-immunity-criminal-case.html"
  },
  {
    "text": "Judge rejects Trump request to toss Bragg charges in New York on basis of presidential immunity  —  Judge Merchan has not yet ruled on Trump's motion to dismiss the charges altogether  —  Judge Juan Merchan on Monday rejected Trump attorneys' request to dismiss charges brought … ",
    "url": "https://www.foxnews.com/politics/judge-rejects-trump-request-toss-bragg-charges-new-york-basis-presidential-immunity"
  },
  {
    "text": "3 dead, others injured in a shooting at a private Christian school in Wisconsin  —  A student opened fire at a private Christian school Monday morning in Wisconsin, killing two people in the final week before Christmas break.  The shooter also died, police said.",
    "url": "https://apnews.com/article/wisconsin-school-shooting-498c8ad26d299602553201ad639a4a5c"
  },
  {
    "text": "Abundant Life Christian School shooting in Madison: 4 killed, 5 hurt  —  The suspected shooter, a juvenile believed to be a student, is also dead.  —  LIVE  —  Emergency vehicles are parked outside the Abundant Life Christian School in Madison, Wis., where multiple injuries were reported following a shooting, Dec. 16, 2024.",
    "url": "https://abcnews.go.com/US/shooting-reported-christian-school-madison-wisconsin-police/story?id=116835038"
  },
  {
    "text": "Live updates: At least 3 dead in shooting at Abundant Life Christian School in Madison, Wisconsin  —  Police say one of the dead is a juvenile believed to be the shooter at the K-12 private school. … A handgun was recovered at the school  —  Officers found a handgun … ",
    "url": "https://www.nbcnews.com/news/us-news/live-blog/abundant-life-school-shooting-madison-live-updates-rcna184404"
  },
  {
    "text": "The toxic nature of “debate me, bro” culture  —  Dan Dezner has a good blog about how even if the resistance to things like RFK Jr.'s war on vaccines is able to mostly hold the line — far from a guarantee in itself — there is a huge opportunity cost to pretending there is any legitimate … ",
    "url": "https://www.lawyersgunsmoneyblog.com/2024/12/the-toxic-nature-of-debate-me-bro-culture"
  },
  {
    "text": "Trump passes over RFK Jr.'s daughter-in-law for CIA's No. 2 job  —  Amaryllis Fox Kennedy, a former undercover C.I.A. operative, faced strenuous opposition from some Republicans, including Sen. Tom Cotton.  —  President-elect Donald Trump has told close aides he is no longer considering … ",
    "url": "https://www.washingtonpost.com/national-security/2024/12/16/amaryllis-fox-kennedy-trump-cia/"
  },
  {
    "text": "AOC loses key vote in House Oversight race to Gerry Connolly … - The House Democratic caucus still has to vote on whether to accept the recommendation - though that ratification is rarely denied.",
    "url": "https://www.axios.com/2024/12/16/aoc-house-steering-committee-oversight-connolly"
  },
  {
    "text": "Questions ABC News Should Answer Following the $16 Million Trump Settlement … As someone who practiced press law for more than twenty years, and served as a senior executive of news organizations for just as long, I was shocked by the decision of ABC News last week to pay $16 million … ",
    "url": "https://www.cjr.org/business_of_news/questions-abc-news-should-answer-16-million-trump-settlement.php"
  },
  {
    "text": "A low, low point for ABC News  —  ABC News not only settled a defamation suit with Trump.  It paid out $15 million.  What?",
    "url": "https://www.washingtonpost.com/opinions/2024/12/16/abc-news-trump-settlement-stephanopoulos/"
  },
  {
    "text": "Trump sues Des Moines Register, top pollster for ‘brazen election interference,’ fraud over Harris poll  —  FIRST ON FOX: President-elect Donald Trump is suing the Des Moines Register and its top pollster J. Ann Selzer for “brazen election interference” and fraud over its final 2024 presidential … ",
    "url": "https://www.foxnews.com/politics/trump-sues-des-moines-register-top-pollster-brazen-election-interference-fraud-over-harris-poll"
  },
  {
    "text": "Trump's Retribution Tour Begins  —  On Monday evening, Trump sued Ann Selzer, the respected pollster who incorrectly predicted a Harris victory in Iowa.  Is he looking for compensation over damages or simply firing a warning shot to the industry ahead of his next term?",
    "url": "https://puck.news/trump-sues-iowa-pollster-ann-selzer-for-being-wrong/"
  },
  {
    "text": "Another Federal Judge Reverses Decision To Retire, Ruins Trump's Plans To Fill His Seat  —  U.S. appeals court judge James Wynn, an Obama appointee, is the third judge to change his mind about retiring since Trump won reelection.  —  LOADING  —  WASHINGTON — For the third time since Donald Trump won … ",
    "url": "https://www.huffpost.com/entry/federal-judges-reverse-decision-retire-trump_n_67604bbbe4b000ebe4d6501a"
  },
  {
    "text": "Trudeau considering his options as leader after Freeland quits cabinet, sources say  —  Prime Minister Justin Trudeau is considering his options as leader, sources tell CTV News, after Finance Minister Chrystia Freeland revealed she will quit cabinet.  —  In an explosive resignation letter … ",
    "url": "https://www.ctvnews.ca/politics/trudeau-considering-his-options-as-leader-after-freeland-quits-cabinet-sources-say-1.7146952"
  },
  {
    "text": "Hegseth's Guard Left the Army After the Beating of a Civilian During Training  —  John Hasenbein, who has escorted Donald J. Trump's pick for defense secretary to meetings on Capitol Hill, said he was unjustly prosecuted for the 2019 episode.  —  When Pete Hegseth visited senators on Capitol Hill … ",
    "url": "https://www.nytimes.com/2024/12/16/us/politics/hegseth-bodyguard-army.html"
  },
  {
    "text": "Oh, Never Mind  —  Do you remember when candidate Donald Trump said, “Grocery prices have skyrocketed.  How can a family afford that?  So, when I win, I will immediately bring prices down.”  That was at a rally in August.  —  Or how about this: “We will end inflation and make America affordable again … ",
    "url": "https://steady.substack.com/p/oh-never-mind"
  },
  {
    "text": "The post-Biden job scramble begins  —  With help from Daniel Lippman, Jack Detsch, Maggie Miller and Sam Skove  —  Resumes are flying around Washington as President JOE BIDEN's national security team frantically searches for jobs once they're kicked out of office next month.",
    "url": "https://www.politico.com/newsletters/national-security-daily/2024/12/16/the-post-biden-job-scramble-begins-00194575"
  },
  {
    "text": "Meddling for MAGA  —  Patrick Soon-Shiong, the owner of the Los Angeles Times, has dismayed staffers as he curtails critical coverage of Donald Trump.  —  Patrick Soon-Shiong's meddling at the Los Angeles Times has grown more pervasive than previously realized.",
    "url": "https://www.status.news/p/patrick-soon-shiong-los-angeles-times-donald-trump-fcad"
  },
  {
    "text": "Prisoner CNN helped free from Syrian prison was actually notorious Assad regime torturer: report  —  The prisoner CNN helped free from a secret facility in Syria was actually a notorious member of Bashar al-Assad's forces known to torture those who refused to pay him off, according to a shocking local fact check.",
    "url": "https://nypost.com/2024/12/16/world-news/prisoner-filmed-by-cnn-being-freed-from-syrian-prison-was-actually-notorious-assad-regime-torturer-report/"
  },
  {
    "text": "Trump and SoftBank CEO Announce $100 Billion Investment in US Projects  —  The technology company plans to invest $100 billion in U.S. projects, echoing the multibillion-dollar pledge it made after Donald J. Trump's first election victory in 2016.  —  President-elect Donald J. Trump's … ",
    "url": "https://www.nytimes.com/2024/12/16/us/trump-softbank-investment.html?unlocked_article_code=1.iE4.-fpn.Uu6E3a2JXlsv&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Senate Democrats push plan to abolish Electoral College  —  Three Democratic senators unveiled a constitutional amendment to abolish the Electoral College system Monday, just more than a month after President-elect Trump stunned the Democrats by sweeping all seven battleground states … ",
    "url": "https://thehill.com/homenews/senate/5043206-senate-democrats-abolish-electoral-college/"
  },
  {
    "text": "Trump Is Back, This Time Without Disdain  —  As his domestic critics have gotten in line, so the world has saluted his restoration, if reluctantly.  —  Almost exactly eight years ago, President-elect Trump hosted a gathering at Trump Tower for the leaders of America's biggest technology companies.",
    "url": "https://www.wsj.com/opinion/trump-is-back-this-time-without-disdain-silicon-valley-eu-50129b17?st=TaegpK&reflink=article_copyURL_share"
  },
  {
    "text": "'There's Not A Darn Thing Anybody Can Do': Rash Of Jan. 6 Pardons Will Mean Trouble, Former Prosecutor Says  —  No president before has pardoned people who were “essentially his co-conspirators in crime,” one legal expert said.  —  LOADING  —  If you take Donald Trump at his word … ",
    "url": "https://www.huffpost.com/entry/trump-jan-6-pardons-prediction_n_67506447e4b0c23471385bc6"
  }
]