[
  {
    "text": "DOJ expected to announce indictment of Texas Democratic Rep. Henry Cuellar, sources say  —  Federal authorities searched the congressman's home in Laredo in 2022 as part of an investigation into the country of Azerbaijan and a group of U.S. businessmen.  —  WASHINGTON — The Justice Department … ",
    "url": "https://www.nbcnews.com/politics/congress/doj-expected-announce-indictment-texas-democratic-rep-henry-cuellar-so-rcna150567"
  },
  {
    "text": "Democratic Rep. Henry Cuellar and wife indicted on federal bribery charges  —  Washington — Democratic Rep. Henry Cuellar and his wife were indicted on more than a dozen federal charges alleging they took hundreds of thousands of dollars in bribes from an oil company owned by the government … ",
    "url": "https://www.cbsnews.com/news/henry-cuellar-innocent-justice-department-indictment/"
  },
  {
    "text": "SEC charges Trump Media auditor with ‘massive fraud’ on hundreds of companies, imposes lifetime ban … The auditing firm for Trump Media and the auditor's owner were charged Friday with “massive fraud” by the Securities and Exchange Commission for work that affected more than 1,500 SEC filings, the federal regulator announced.",
    "url": "https://www.cnbc.com/2024/05/03/trump-media-auditor-charged-by-sec-with-massive-fraud-permanently-barred-from-public-company-audits.html"
  },
  {
    "text": "Trump Media's accounting firm charged with ‘massive fraud’  —  New York CNN  —  BF Borgers, Trump Media & Technology Group's independent accounting firm, was charged by the Securities and Exchange Commission on Friday with widespread fraud and accused of operating a “sham audit mill.”",
    "url": "https://www.cnn.com/2024/05/03/business/trump-media-accounting-firm-charged-fraud/"
  },
  {
    "text": "SEC Charges Audit Firm BF Borgers and Its Owner with Massive Fraud Affecting More Than 1,500 SEC Filings  —  The Securities and Exchange Commission today charged audit firm BF Borgers CPA PC and its owner, Benjamin F. Borgers (together, “Respondents\"), with deliberate and systemic failures … ",
    "url": "https://www.sec.gov/news/press-release/2024-51"
  },
  {
    "text": "Gov. Kristi Noem's account of meeting North Korean dictator in doubt  —  UPDATE: Since the original publication of this story, a Noem spokesman told The Dakota Scout “the publisher will be addressing conflated world leaders' names in the book before it is released.”",
    "url": "https://www.thedakotascout.com/p/gov-kristi-noems-account-of-meeting"
  },
  {
    "text": "8 Possible Trump VP Candidates Who Haven't Shot Their Dogs  —  That we know of!  —  LOADING  —  Kristi Noem thought the political world would be impressed by her story of executing a dog, but she seems to have misjudged her fellow Republicans — including, most critically, Donald Trump.",
    "url": "https://www.huffpost.com/entry/trump-vp-list-kristi-noem_n_6634f704e4b0fc2b95294be2"
  },
  {
    "text": "Donald Trump is using campus protests to stoke right-wing violence for the election  —  Disinformation about leftist “violence” is used by MAGA to justify their own, very real crimes  —  Despite all the hysteria in the punditry about campus protests against the war in Gaza, by and large, the student activists have been peaceful.",
    "url": "https://www.salon.com/2024/05/03/donald-is-using-campus-to-stoke-right-wing-violence-for-the/"
  },
  {
    "text": "Trump Violates Gag Order by Posting Video Attacking Judge's Daughter  —  This potential violation occurred after Judge Merchan held Trump in contempt of court  —  On Thursday night, Trump posted a link to a Rumble clip of Steve Bannon's War Room podcast in which Trump supporting host Doug Burquam … ",
    "url": "https://www.meidastouch.com/news/trump-violates-gag-order-by-posting-video-attacking-judges-daughter"
  },
  {
    "text": "How one text exchange gave Trump an ominous day in court  —  Editor's Note: Norman Eisen is a CNN legal analyst and editor of “Trying Trump: A Guide to His First Election Interference Criminal Trial.”  He served as counsel to the House Judiciary Committee for the first impeachment and trial of then-President Donald Trump.",
    "url": "https://www.cnn.com/2024/05/02/opinions/keith-davidson-testimony-trump-ominous-day-in-court-eisen/"
  },
  {
    "text": "Biden finalizes rule opening up Obamacare to DACA recipients  —  Federal health officials estimate that roughly 100,000 people enrolled in the Deferred Action for Childhood Arrivals program will sign up for subsidized plans through the health insurance marketplace over the next year under the rule.",
    "url": "https://www.politico.com/news/2024/05/03/biden-obamacare-daca-00155881"
  },
  {
    "text": "Former government official charged with falsely implicating colleagues in Jan. 6 attack  —  Investigators say Miguel Zapata used “burner” emails to submit anonymous, false tips to an FBI tipline about seven ex-colleagues.  —  Federal prosecutors have charged a former government employee … ",
    "url": "https://www.politico.com/news/2024/05/03/former-government-official-charged-jan-6-capitol-riots-00155949"
  },
  {
    "text": "Make Billionaires Pay (Their Taxes)  —  Until recently, it was hard to know just how good the superrich are at avoiding taxes.  Public statistics are oddly quiet about their contributions to government coffers, a topic of legitimate interest in democratic societies.",
    "url": "https://www.nytimes.com/interactive/2024/05/03/opinion/global-billionaires-tax.html"
  },
  {
    "text": "Texas man files legal action to probe ex-partner's out-of-state abortion  —  The previously unreported petition reflects a potential new antiabortion strategy to block women from ending their pregnancies in states where abortion is legal.  —  As soon as Collin Davis found out his ex-partner … ",
    "url": "https://www.washingtonpost.com/investigations/2024/05/03/texas-abortion-investigations/"
  },
  {
    "text": "Trump Trial Live Updates: Hope Hicks Details Campaign's Panic Over ‘Access Hollywood’ Tape  —  On the stand in Donald J. Trump's criminal trial, Ms. Hicks, who was his press secretary in 2016, described the chaos that ensued after the infamous recording of the candidate discussing how he groped women was made public.",
    "url": "https://www.nytimes.com/live/2024/05/03/nyregion/trump-hush-money-trial"
  },
  {
    "text": "President Biden Announces Recipients of the Presidential Medal of Freedom  —  Today, President Biden named nineteen recipients of the Presidential Medal of Freedom.  —  The Presidential Medal of Freedom is the Nation's highest civilian honor, presented to individuals who have made exemplary contributions … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/05/03/president-biden-announces-recipients-of-the-presidential-medal-of-freedom-2/"
  },
  {
    "text": "Israel briefs US on plan to move Gazans ahead of Rafah invasion  —  The Israel Defense Forces recently told the U.S. government and aid groups operating on the ground that they had developed a plan to move people out of Rafah.  —  The Israeli military has informed aid groups … ",
    "url": "https://www.politico.com/news/2024/05/03/israel-gazans-rafah-invasion-00156024"
  },
  {
    "text": "Ron DeSantis bans ‘global elite’ lab-grown meat  —  Florida Governor Ron DeSantis has banned lab-grown meat, saying he will “save our beef” from the “global elite” and its “authoritarian plans”.  —  “Florida is fighting back against the global elite's plan to force the world to eat meat grown … ",
    "url": "https://www.bbc.com/news/world-us-canada-68947766"
  },
  {
    "text": "Jeffco GOP cancels Kristi Noem event amid dog-killing controversy  —  Jefferson County Republicans embraced the national furor over Governor Kristi Noem's killing of a puppy, then backtracked citing “safety concerns.”  —  JEFFERSON COUNTY, Colo. — South Dakota Governor Kristi Noem (R) … ",
    "url": "https://www.9news.com/article/news/local/next/next-with-kyle-clark/kristi-noem-colorado-gop-event-canceled/73-8b7b16f9-ddac-4dbc-8195-f81ec4bb2eab"
  }
]