[
  {
    "text": "Trump augurs divisive year in angry Christmas rant  —  Most global political, spiritual and national leaders mark Christmas with a plea for peace, or by stressing the virtues of family and unity.  —  That's not Donald Trump's style.  —  The ex-president unleashed an online torrent of fury and bitterness … ",
    "url": "https://www.cnn.com/2023/12/26/politics/trump-christmas-rant/"
  },
  {
    "text": "How Trump Is Running Differently This Time  —  A wrecking ball.  A bull in a China shop.  A “chaos candidate.”  During Donald Trump's whirlwind rise to the presidency, his opponents and critics frequently noted his penchant for havoc.  Surely, they believed, voters would not want to steer the country toward disorder and mayhem.",
    "url": "https://www.nytimes.com/2023/12/26/opinion/trump-biden-election.html"
  },
  {
    "text": "A Trump Conviction Could Cost Him Enough Voters to Tip the Election  —  Recent general-election polling has generally shown Donald Trump maintaining a slight lead over President Biden.  Yet many of those polls also reveal an Achilles' heel for Mr. Trump that has the potential to change the shape of the race.",
    "url": "https://www.nytimes.com/2023/12/26/opinion/trump-polling-conviction.html"
  },
  {
    "text": "Statement from Secretary of Defense Lloyd J. Austin III on U.S. Strikes in Iraq  —  Today, at President Biden's direction, U.S. military forces conducted necessary and proportionate strikes on three facilities used by Kataib Hezbollah and affiliated groups in Iraq.",
    "url": "https://www.defense.gov/News/Releases/Release/Article/3626180/statement-from-secretary-of-defense-lloyd-j-austin-iii-on-us-strikes-in-iraq/"
  },
  {
    "text": "Statement from NSC Spokesperson Adrienne Watson on U.S. Strikes in Iraq  —  Early this morning in northern Iraq, U.S. military personnel were targeted by a one-way attack drone.  The attack wounded three U.S. service-members, one critically.  The Iranian-backed militia Kataib Hezbollah … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2023/12/25/statement-from-nsc-spokesperson-adrienne-watson-on-u-s-strikes-in-iraq/"
  },
  {
    "text": "Republican Rep. Marjorie Taylor Greene targeted in swatting attempt on Christmas Day  —  Rep. Marjorie Taylor Greene, R-Ga., was targeted by a swatting attempt at her Georgia home on Christmas Day.  —  The Republican lawmaker shared on X, the platform formerly known as Twitter, on Monday that … ",
    "url": "https://www.usatoday.com/story/news/politics/2023/12/26/marjorie-taylor-green-ga-swatting-christmas/72029352007/"
  },
  {
    "text": "Jared Polis slammed for cringe-filled ‘Feliz Navidad’ performance amid immigrant crisis  —  Gov. Jared Polis (D-CO) is under fire after a Christmas Eve message in which Polis treated his state to an a cappella rendition of “Feliz Navidad.”  —  Polis, 48, sang Jose Feliciano's 1970 classic through … ",
    "url": "https://www.washingtonexaminer.com/news/polis-slammed-feliz-navidad-performance-migrant-crisis"
  },
  {
    "text": "Colorado Gov. Jared Polis faces backlash for cringy ‘Feliz Navidad’ rendition as migrant crisis surges  —  Colorado Governor Jared Polis is drawing harsh criticism for his “Feliz Navidad” holiday message as the state struggles for resources while battling a significant immigration crisis … ",
    "url": "https://nypost.com/2023/12/26/news/colorado-gov-jared-polis-ripped-for-cringy-feliz-navidad-rendition-as-migrant-crisis-surges-in-denver/"
  },
  {
    "text": "The latest front in the Gaetz vs. McCarthy fight: House primaries  —  Gaetz keeps supporting candidates in primaries where McCarthy has already backed someone else.  —  Republicans are desperate to avoid nasty primaries next year.  But the architect of Kevin McCarthy's ouster from the speakership has other plans.",
    "url": "https://www.politico.com/news/2023/12/26/the-latest-front-in-the-gaetz-vs-mccarthy-fight-house-primaries-00133131"
  },
  {
    "text": "Scoop: Top Bibi confidant expected in D.C. for talks on next phase of Gaza war … - A senior U.S. official said the main issue of discussion between the Biden administration and the Netanyahu government is “how to wrap things up and on what timeframe.”",
    "url": "https://www.axios.com/2023/12/25/netanayahu-dermer-gaza-israel-hamas-war-talks"
  },
  {
    "text": "The 2024 economy could be shockingly normal  —  The economy in 2024 is on track to be described with a word that hasn't been applicable yet this decade: Normal. … But there is good reason to think 2024 will give way to something less chaotic.  — Pandemic-disrupted supply chains are pretty much righted.",
    "url": "https://www.axios.com/2023/12/26/2024-economy-interest-rates-inflation-labor"
  },
  {
    "text": "In a scorching year, scientists wonder if climate change is speeding up  —  This year's record temperatures have some scientists concerned that the pace of warming may be accelerating.  But not everyone agrees.  —  For the past several years, a small group of scientists has warned … ",
    "url": "https://www.washingtonpost.com/climate-environment/2023/12/26/global-warming-accelerating-climate-change/"
  },
  {
    "text": "Georgia offered Medicaid with a work requirement.  Few have signed up.  —  Only 1,800 people enrolled — and critics blame the paltry expansion on an overly complex program with too many hurdles for people to clear.  —  A GOP experiment forcing low-income people to work to qualify … ",
    "url": "https://www.politico.com/news/2023/12/26/georgia-public-health-insurance-expansion-00132698"
  },
  {
    "text": "Apple Watch import ban takes effect, company files appeal  —  Apple filed an appeal on Tuesday of a decision to ban imports of Apple (AAPL.O) Watches based on a complaint from medical monitoring technology company Masimo (MASI.O) after U.S. President Joe Biden's administration declined to veto a government tribunal.",
    "url": "https://www.reuters.com/technology/biden-administration-allows-us-trade-tribunals-ban-apple-watch-imports-2023-12-26/"
  }
]