[
  {
    "text": "Trump's thuggish response to the California fires is a bad omen  —  Southern California is experiencing its most devastating winter fire season in more than 40 years.  As of Sunday, ongoing wildfires have destroyed more than 12,000 homes and killed at least 24 people while burning through an area larger than San Francisco.",
    "url": "https://www.publicnotice.co/p/trump-california-wildfires-response-newsom"
  },
  {
    "text": "House Republicans and Trump discuss tying California wildfire aid to debt ceiling  —  The current California fires could become the costliest natural disaster in U.S. history.  —  A group of House Republicans and President-elect Donald Trump talked about tying wildfire aid … ",
    "url": "https://www.politico.com/news/2025/01/13/house-republicans-trump-wildfire-aid-00197766"
  },
  {
    "text": "Barrasso vows no ‘blank check’ for wildfire aid  —  Senate Majority Whip John Barrasso (R-WY) came out against any idea of a “blank check” passing through Congress to provide aid to California as the wildfires continue to devastate the Los Angeles area.  —  Speaking on CBS News's Face … ",
    "url": "https://www.washingtonexaminer.com/news/senate/3284423/barrasso-vows-no-blank-check-for-wildfire-aid/"
  },
  {
    "text": "NVIDIA Statement on the Biden Administration's Misguided ‘AI Diffusion’ Rule  —  For decades, leadership in computing and software ecosystems has been a cornerstone of American strength and influence worldwide.  The federal government has wisely refrained from dictating the design … ",
    "url": "https://blogs.nvidia.com/blog/ai-policy/"
  },
  {
    "text": "Europe's Largest Pension Fund Sold Tesla Stake Over Musk's Pay  —  Europe's largest pension fund sold its entire €571 million ($585 million) stake in Tesla Inc. in the third quarter partly due to disagreement with Elon Musk's remuneration package.  —  “We had a problem” with Musk's pay package … ",
    "url": "https://www.bloomberg.com/news/articles/2025-01-12/europe-s-largest-pension-fund-sold-tesla-stake-over-musk-s-pay"
  },
  {
    "text": "FACT SHEET: Ensuring U.S. Security and Economic Strength in the Age of Artificial Intelligence  —  Artificial intelligence is quickly becoming central to both security and economic strength.  The United States must act decisively to lead this transition by ensuring that U.S. technology … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2025/01/13/fact-sheet-ensuring-u-s-security-and-economic-strength-in-the-age-of-artificial-intelligence/"
  },
  {
    "text": "The corporate lobbyist who will run the Trump White House  —  During the 2024 campaign, Trump condemned the power of lobbyists in Washington, DC, and pledged that, if he returned to the White House, they would have no influence.  “Above all, you deserve leadership in Washington that does … ",
    "url": "https://popular.info/p/the-corporate-lobbyist-who-will-run"
  },
  {
    "text": "Steve Bannon condemns Elon Musk as ‘racist’ and ‘truly evil’  —  Ex-Trump adviser denounces tech CEO's embrace of some forms of immigration and vows to ‘take this guy down’  —  In an escalation of discontent among the highest-profile far-right followers of Donald Trump … ",
    "url": "https://www.theguardian.com/us-news/2025/jan/12/steve-bannon-calls-elon-musk-racist"
  },
  {
    "text": "Vance says those who ‘committed violence’ on Jan. 6 ‘obviously’ shouldn't be pardoned  —  Vice President-elect JD Vance said people who “committed violence” on Jan. 6, 2021, “obviously” shouldn't be pardoned by President-elect Trump.  —  “I think it's very simple, look … ",
    "url": "https://thehill.com/homenews/administration/5081525-vance-says-those-who-committed-violence-on-jan-6-obviously-shouldnt-be-pardoned/"
  },
  {
    "text": "2025 Trans Girl Scouts To Order Cookies From!  —  PLEASE buy from people who have not filled their goals!  —  Did you know that for a long time, Girl Scouts has openly included transgender and nonbinary individuals in its membership?  I first learned of this four years ago while searching … ",
    "url": "https://www.erininthemorning.com/p/2025-trans-girl-scouts-to-order-cookies"
  },
  {
    "text": "Which of Trump's nominees should get confirmed?  We made a chart.  —  Confirmation hearings will begin Tuesday for President-elect Donald Trump's intended Cabinet nominees.  We would not have picked any of his choices for our hypothetical Cabinet.  But, as we have argued for decades … ",
    "url": "https://www.washingtonpost.com/opinions/interactive/2025/trump-nominees-confirmation-hearings-editorial-board/"
  },
  {
    "text": "Newsom suspends landmark environmental laws to ease rebuilding in wildfire zones  — Requirements for building permits and reviews in the California Environmental Quality Act and the California Coastal Act will be eased for victims of the fires in Pacific Palisades, Altadena and other communities.",
    "url": "https://www.latimes.com/california/story/2025-01-12/newsom-suspends-landmark-environmental-regulations-palisades-altadena-fires"
  },
  {
    "text": "Michael Cohen pleas for Biden presidential pardon: 'I'm somebody's son also'  —  Cohen has said he planned to leave the country if Trump were re-elected  —  Former Trump attorney Michael Cohen is demanding President Biden pardon him like he pardoned his son Hunter before President-elect Donald Trump can take office.",
    "url": "https://www.foxnews.com/media/michael-cohen-pleas-biden-presidential-pardon-im-somebodys-son-also"
  },
  {
    "text": "Thailand's cabinet approves draft law to legalise casinos and gambling  —  Thailand's cabinet has approved a draft law that would legalise gambling and casinos, a move aimed at boosting tourism, jobs and investment, Prime Minister Paetongtarn Shinawatra said on Monday.",
    "url": "https://www.reuters.com/world/asia-pacific/thai-cabinet-approves-draft-law-legalise-casinos-gambling-pm-says-2025-01-13/"
  },
  {
    "text": "California Fire Facts  —  LIE - California Cut Firefighting Budgets  — FACT: The number of CalFIRE personnel has nearly doubled since 2019 (from 5,829 to 10,741)  — FACT: CalFIRE's budget has nearly doubled since 2019 ($2 Billion to $3.8 Billion)  —  LIE - These Wildfires are Caused … ",
    "url": "https://gavinnewsom.com/california-fire-facts/"
  },
  {
    "text": "Biden spoke with Netanyahu; Sullivan says hostage deal very close  —  Netanyahu updated Biden on progress and on the mandate he has given his top-level security delegation now in Doha in order to advance a hostage deal, Netanyahu said in a statement.  —  WASHINGTON — U.S. President Joe Biden spoke … ",
    "url": "https://www.nbcnews.com/politics/politics-news/biden-spoke-netanyahu-sullivan-says-hostage-deal-close-rcna187328"
  }
]