[
  {
    "text": "To Serve His Country, President Biden Should Leave the Race  —  President Biden has repeatedly and rightfully described the stakes in this November's presidential election as nothing less than the future of American democracy.  —  Donald Trump has proved himself to be a significant jeopardy … ",
    "url": "https://www.nytimes.com/2024/06/28/opinion/biden-election-debate-trump.html"
  },
  {
    "text": "The Sum of All Fears  —  No Secret podcast today.  This stuff is as serious as a heart attack, so Sarah and I sat down with Tim and did an emergency pod for the flagship instead.  We didn't want it hidden behind a paywall.  The moment is too important.  —  That conversation … ",
    "url": "https://www.thebulwark.com/p/the-sum-of-all-fears-a60"
  },
  {
    "text": "CNN fails the nation  —  The signal failure of the American media during the Trump era has been the refusal to hold Donald Trump accountable for his behavior - and, in particular, his endless lies.  —  That has never been more obvious than it was at Thursday night's presidential debate.",
    "url": "https://presswatchers.org/2024/06/cnn-fails-the-nation/"
  },
  {
    "text": "Joe Biden Is a Good Man and a Good President.  He Must Bow Out of the Race.  —  I watched the Biden-Trump debate alone in a Lisbon hotel room, and it made me weep.  I cannot remember a more heartbreaking moment in American presidential campaign politics in my lifetime … ",
    "url": "https://www.nytimes.com/2024/06/28/opinion/joe-biden-tom-friedman.html"
  },
  {
    "text": "Biden acknowledges bad debate performance and age … - The president appeared to address some of those criticisms head-on Friday in an attempt to assuage Democrats' concerns. … - “I don't walk as easy as I used to, I don't speak as smoothly as I used to, I don't debate as well as I used to, but I know what I do know.",
    "url": "https://www.axios.com/2024/06/28/biden-debate-rally-north-carolina"
  },
  {
    "text": "CNN Flash Poll: Majority of debate watchers say Trump outperformed Biden  —  Registered voters who watched CNN's presidential debate between Joe Biden and Donald Trump largely think Trump outperformed Biden, according to a CNN poll of debate watchers conducted by SSRS, with most saying … ",
    "url": "https://www.cnn.com/2024/06/28/politics/debate-poll-cnn-trump-biden/"
  },
  {
    "text": "A Newly Energized Joe Biden Addresses The Elephant In The Room  —  “I don't debate as well as I used to, but I know what I do know: I know how to tell the truth,” Biden said at a North Carolina rally.  —  LOADING  —  At a rally in North Carolina on Friday, President Joe Biden brought … ",
    "url": "https://www.huffpost.com/entry/joe-biden-rally-debate-performance_n_667ef506e4b0d079dd459439"
  },
  {
    "text": "10 options if Democrats actually try to replace Biden  —  It remains a fraught and seemingly unlikely happening, even as Democrats fret about Biden's debate performance.  But here's who has surfaced before — and could again.  —  The Democratic Party has spent much of the 2024 campaign burying … ",
    "url": "https://www.washingtonpost.com/politics/2024/06/28/democrat-options-replace-biden/"
  },
  {
    "text": "Biden's debate is a “DEFCON 1” moment for Democrats … - With breathtaking speed, private discussions about Biden's expected performance against Donald Trump went from optimism to shock and even questions about whether Biden could continue his campaign. … - A “disaster,” one former Biden administration official called it.",
    "url": "https://www.axios.com/2024/06/28/biden-trump-debate-defcon1-2024-election"
  },
  {
    "text": "How To Process Biden's Debate Disaster  —  A lot of things happened.  Here are some of the things.  This is TPM's Morning Memo.  —  Say It Ain't So, Joe  —  I loathe theater criticism-style debate coverage, but by any standard it was a disastrous performance by President Biden.",
    "url": "https://morningmemo.talkingpointsmemo.com/p/how-to-process-bidens-debate-disaster"
  },
  {
    "text": "Attorney General Merrick B. Garland Statement on the Supreme Court's Decision in Fischer v. United States  —  For Immediate Release  —  The Justice Department issued the following statement from Attorney General Merrick B. Garland on the Supreme Court's decision in Fischer v. United States:",
    "url": "https://www.justice.gov/opa/pr/attorney-general-merrick-b-garland-statement-supreme-courts-decision-fischer-v-united-states"
  },
  {
    "text": "Supreme Court makes it harder to charge Capitol riot defendants with obstruction, charge Trump faces  —  The Supreme Court on Friday limited a federal obstruction law that has been used to charge hundreds of Capitol riot defendants as well as former President Donald Trump.",
    "url": "https://apnews.com/article/supreme-court-capitol-riot-obstruction-2cdba47baa5cea8177d651de751760a6"
  },
  {
    "text": "The Supreme Court weakens federal regulators, overturning decades-old Chevron decision  —  The Supreme Court on Friday upended a 40-year-old decision that made it easier for the federal government to regulate the environment, public health, workplace safety and consumer protections … ",
    "url": "https://apnews.com/article/supreme-court-chevron-regulations-environment-5173bc83d3961a7aaabe415ceaf8d665"
  },
  {
    "text": "Steve Bannon must report to prison by Monday after Supreme Court rejects last-minute appeal  —  Bannon, a former Trump adviser, was convicted of contempt of Congress in July 2022 for defying subpoenas from the House Jan. 6 committee and sentenced to four months.",
    "url": "https://www.nbcnews.com/politics/supreme-court/steve-bannon-must-report-prison-monday-supreme-court-rejects-last-minu-rcna158584"
  },
  {
    "text": "Who do you think the Democratic Party should nominate as its presidential candidate, if it wants to have the best chance of winning?  —  EXPLORE MORE DATA & ARTICLES  —  See results",
    "url": "https://today.yougov.com/topics/politics/survey-results/daily/2024/06/28/3f653/2"
  },
  {
    "text": "Supreme Court allows Oregon city policy targeting homeless people  —  The justices ruled that ordinances in Grants Pass do not violate the Constitution's Eighth Amendment, which bars cruel and unusual punishment.  —  WASHINGTON — The Supreme Court on Friday rejected a constitutional challenge … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-rejects-challenge-oregon-city-laws-targeting-ho-rcna153249"
  },
  {
    "text": "Johnson says Biden's Cabinet should discuss invoking 25th Amendment  —  Speaker Mike Johnson said Friday that President Joe Biden's Cabinet should discuss invoking the 25th Amendment in the wake of a politically disastrous debate that compounded age and acuity questions.",
    "url": "https://www.politico.com/live-updates/2024/06/28/congress/johnson-on-the-debate-house-gop-biden-trump-00165777"
  },
  {
    "text": "Final thoughts on tonight's debate  —  Thanks for joining Heather and me tonight.  It was a painful evening.  —  Let me leave you with these quotes:  —  “The great masses of the people ... will more easily fall victim to a big lie than to a small one.”  — Adolf Hitler, Mein Kampf",
    "url": "https://robertreich.substack.com/p/final-thoughts-on-tonights-debate"
  }
]