[
  {
    "text": "Issue 1 failing overwhelmingly in early vote results  —  Issue 1 is losing big in early results released Tuesday night from across Ohio.  —  Early numbers show the issue failing overwhelmingly in larger counties including Franklin, Hamilton, Cuyahoga, Summit, Lucas, Montgomery and Stark.",
    "url": "https://www.dispatch.com/story/news/politics/2023/08/08/ohio-issue-1-special-electionresults-voters-decide-tuesday-on-august-8-ballot-issue/70487461007/"
  },
  {
    "text": "Ohio Voters Reject Constitutional Change Intended to Thwart Abortion Amendment  —  The contest was seen as a test of efforts by Republicans nationwide to curb voters' use of ballot initiatives.  —  Ohio voters rejected a bid to make it harder to amend the State Constitution on Tuesday … ",
    "url": "https://www.nytimes.com/2023/08/08/us/ohio-election-issue-1-results.html"
  },
  {
    "text": "GOP attempt to stymie abortion in Ohio backfires spectacularly  — Ohioans issued a major rebuke to Republican officials on Tuesday night.  — Voters rejected a gambit to get ahead of an abortion rights vote this November.  — The result illustrates that the GOP is still struggling … ",
    "url": "https://www.businessinsider.com/ohio-gop-issue-1-abortion-analysis-results-2023-8?op=1"
  },
  {
    "text": "In a win for abortion-rights supporters, Ohio voters reject Issue 1  —  Ohioans voted down a proposal that would have made it harder to pass future proposed constitutional amendments in the state, including one in November about abortion rights.  —  Here's how Ohio's August special election could affect abortion rights",
    "url": "https://www.nbcnews.com/politics/elections/ohio-issue-one-reject-loss-abortion-rights-ballot-measure-rcna98842"
  },
  {
    "text": "Arizona coalition seeks to enshrine abortion rights in state constitution next year  —  In the 14 months since the U.S. Supreme Court overturned Roe v. Wade, advocacy groups have sought to protect abortion rights through state constitutional amendments.  —  A coalition of reproductive … ",
    "url": "https://www.nbcnews.com/politics/elections/arizona-coalition-seeks-enshrine-abortion-rights-state-constitution-ye-rcna98844"
  },
  {
    "text": "Ohio voters reject measure aimed at blocking abortion rights amendment  —  The defeat of Ohio's Issue 1 is a blow to efforts by conservatives who want to raise barriers to passing ballot measures that would establish a right to abortion. … Ohio voters rejected an effort that would have made it harder … ",
    "url": "https://19thnews.org/2023/08/ohio-issue-1-results-abortion/"
  },
  {
    "text": "Ohio voters reject changes to ballot process in a win for abortion rights  —  This has massive implications for this fall's abortion rights measure.  —  In yet another major rebuke of Republicans over abortion rights, voters in Ohio on Tuesday handily turned down a GOP-led effort … ",
    "url": "https://www.politico.com/news/2023/08/08/ohio-constitution-abortion-voting-00110394"
  },
  {
    "text": "Previously Secret Memo Laid Out Strategy for Trump to Overturn Biden's Win  —  The House Jan. 6 committee's investigation did not uncover the memo, whose existence first came to light in last week's indictment.  —  A lawyer allied with President Donald J. Trump first laid out a plot … ",
    "url": "https://www.nytimes.com/2023/08/08/us/politics/trump-indictment-fake-electors-memo.html"
  },
  {
    "text": "Trump on possible court-ordered limits: 'They're not taking away my First Amendment rights'  —  The former president campaigned in New Hampshire called the latest charges against him “bullshit,” saying, “I will talk about it.”  —  Former President Donald Trump could soon be strapped … ",
    "url": "https://www.politico.com/news/2023/08/08/trump-on-possible-gag-order-pound-sand-00110357"
  },
  {
    "text": "Trump mocks ‘fat pig’ Chris Christie's weight  —  The former president made fun of the former New Jersey governor and 2024 Republican nomination rival during a speech in New Hampshire.  —  MANCHESTER, N.H. — Former President Donald Trump mocked Chris Christie, one of his rivals … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-mocks-fat-pig-chris-christies-weight-rcna98859"
  },
  {
    "text": "Judge schedules Friday hearing on protective order in election subversion case against Trump  —  US District Judge Tanya Chutkan scheduled a hearing for Friday at 10 a.m. ET on the scope of a protective order - the rules imposed for the handling of evidence - in the special counsel's election subversion case … ",
    "url": "https://www.cnn.com/2023/08/08/politics/trump-protective-order-hearing/"
  },
  {
    "text": "Scoop: Kari Lake prepares to enter Arizona Senate race  —  Former Arizona GOP gubernatorial nominee Kari Lake is staffing up for a Senate campaign in anticipation of an October launch, making Arizona ground zero to replay — and relitigate — GOP losses in the last two elections.",
    "url": "https://www.axios.com/2023/08/08/kari-lake-arizona-senate-race-campaign-election"
  },
  {
    "text": "GOP Lawmaker's Wife Makes Little Free Libraries a Culture War Battleground  —  Arkansas State Rep. Stephen Meeks' spouse boasted she's been “swapping out” books for Bibles. … The wife of an Arkansas Republican state lawmaker has expanded the culture wars to miniature free libraries … ",
    "url": "https://www.thedailybeast.com/arkansas-rep-stephen-meeks-wife-jennifer-swaps-books-for-bibles-in-little-free-libraries"
  },
  {
    "text": "Judge orders airline lawyers to take extremist advocacy group's “religious-liberty training”  —  U.S. District Judge Brantley Starr issued an order Monday that three senior Southwest Airlines lawyers attend eight hours of “religious-liberty training” this month as part of court-ordered sanctions … ",
    "url": "https://www.lawdork.com/p/judge-orders-adf-religious-liberty-training"
  },
  {
    "text": "Is it cheaper to refuel your EV battery or gas tank?  We did the math in all 50 states.  —  Gasoline cars are cheaper to refuel than electric vehicles.  —  I've heard this claim pop up everywhere from Massachusetts to Fox News over the past two years.  My neighbor even refuses to plug … ",
    "url": "https://www.washingtonpost.com/climate-environment/interactive/2023/electric-vehicle-charging-price-vs-gasoline/"
  },
  {
    "text": "What to know about the EG.5 coronavirus subvariant, now dominant in the U.S.  —  Although the updated booster shots expected in the fall don't target EG.5, experts said they may nonetheless offer some protection.  —  A new coronavirus variant, EG.5, now accounts for the largest proportion … ",
    "url": "https://www.nbcnews.com/health/health-news/eg5-coronavirus-variant-dominant-symptoms-spread-rcna98768"
  },
  {
    "text": "“Anti-woke” darling Richard Hanania is exposed: What this says about the “intellectual” right  —  While Trump feeds red meat to the base, the alt-right grifts educated conservatives with “respectability” packaging  —  For those who want to understand the vast differences between elite … ",
    "url": "https://www.salon.com/2023/08/08/anti-woke-darling-richard-hanania-is-exposed-what-this-says-about-the-intellectual-right/"
  },
  {
    "text": "Tampa mayor's big catch on Keys fishing trip? 70 pounds of cocaine.  —  Mayor Castor, the former Tampa police chief, was with family when they spotted $1.1 million worth of drugs.  —  There was something in the water, black and bobbing.  —  The package adrift in the Atlantic caught the eye … ",
    "url": "https://www.tampabay.com/news/florida/2023/08/08/tampa-mayor-jane-castor-cocaine-drug-key-west-fishing/"
  },
  {
    "text": "A Simple Law Is Doing the Impossible.  It's Making the Online Porn Industry Retreat.  —  Pornhub has pulled out of multiple states rather than comply with age-verification laws.  —  On June 15, 2022, a freshman legislator in Louisiana's House of Representatives accomplished something … ",
    "url": "https://www.politico.com/news/magazine/2023/08/08/age-law-online-porn-00110148"
  },
  {
    "text": "Roberts and Barrett join liberals as Supreme Court revives federal ghost gun restrictions  —  The Supreme Court on Tuesday agreed to freeze a lower court order that bars the government from regulating so-called ghost guns - untraceable homemade weapons - as firearms under federal law.",
    "url": "https://www.cnn.com/2023/08/08/politics/supreme-court-ghost-guns/"
  },
  {
    "text": "U.K. election regulator says hackers had access for over a year but elections still secure  —  Most of the voter information that was accessed was already public, the Electoral Commission said.  —  Hackers gained access to the U.K.'s election regulator, the Electoral Commission, for more than a year, the agency said Tuesday.",
    "url": "https://www.nbcnews.com/tech/security/uk-election-regulator-says-hackers-access-year-elections-still-secure-rcna98863"
  },
  {
    "text": "Biden to Restrict Investments in China, Citing National Security Threats  —  The measure to clamp down on investments in certain industries deemed to pose security risks, set to be issued Wednesday, appears likely to open a new front in the U.S.-China economic conflict.",
    "url": "https://www.nytimes.com/2023/08/08/business/economy/biden-china-companies-restrictions.html"
  },
  {
    "text": "Biden Said EV Maker Proterra Was ‘Getting Us in the Game.’ It Just Declared Bankruptcy.  —  Biden repeatedly praised green energy company as his energy secretary held stock in it  —  President Joe Biden promoted the company.  Its top executive landed a spot on a White House board.",
    "url": "https://freebeacon.com/energy/biden-said-ev-maker-proterra-was-getting-us-in-the-game-it-just-declared-bankruptcy/"
  },
  {
    "text": "White House unveils wage rule for federal projects, in win for unions  —  Vice President Harris announced a new rule on Tuesday to bolster union requirements for projects paid for by federal funds, as the Biden administration tries to quell fears among organized labor about the push for clean energy.",
    "url": "https://www.washingtonpost.com/business/2023/08/08/biden-davis-bacon-union-rules/"
  }
]