[
  {
    "text": "‘Make them pay’: Canada puts Trump's ‘first friend’ Elon Musk's Tesla in the crosshairs of tariff war  —  Canada's EV adoption rate is outpacing that of the U.S., with nearly 17% of new cars sold in the third quarter of 2024 being fully electric, compared to just 8% in the US.  —  Business Today Desk",
    "url": "https://www.businesstoday.in/world/canada/story/make-them-pay-canada-puts-trumps-first-friend-elon-musks-tesla-in-the-crosshairs-of-tariff-war-463097-2025-02-01"
  },
  {
    "text": "B.C. premier announces countermeasures against U.S. tariffs, including ban on ‘red-state’ liquor  —  U.S. President Donald Trump will impose 25% tariff on most Canadian imports beginning Tuesday  —  B.C. Premier David Eby has announced immediate countermeasures in response to incoming U.S. tariffs … ",
    "url": "https://www.cbc.ca/news/canada/british-columbia/bc-premier-david-eby-us-tariffs-1.7448307"
  },
  {
    "text": "Mexican president orders retaliatory tariffs against U.S.  —  Mexican President Claudia Sheinbaum on Saturday ordered retaliatory tariffs in response to the U.S. decision to slap 25% tariffs on all goods coming from Mexico, marking the apparent start of a trade war between the two countries.",
    "url": "https://www.reuters.com/world/americas/mexican-president-orders-retaliatory-tariffs-against-us-2025-02-02/"
  },
  {
    "text": "Trump signs order imposing tariffs on Canada, Mexico and China  —  It's the first official action of the president's second-term trade war.  —  President Donald Trump on Saturday imposed tariffs on imports from Canada, Mexico and China, the nation's three largest trading partners … ",
    "url": "https://www.washingtonpost.com/business/2025/02/01/tariff-mexico-canada-trump/"
  },
  {
    "text": "Tariffs Are Here.  The Price Hikes Coming for These Items May Surprise You.  —  Now might be a good time to buy a car.  You might grab some tomatoes, toy trucks or tequila along the way.  —  The Trump administration said Saturday it will levy 25% import tariffs on goods from Mexico and Canada … ",
    "url": "https://www.wsj.com/economy/trade/tariffs-are-nearly-here-the-price-hikes-coming-for-these-items-may-surprise-you-99cba7a4"
  },
  {
    "text": "Mexico, Canada announce retaliatory measures following Trump tariffs  —  Mexico and Canada are retaliating against President Trump's Saturday tariff announcements, enacting countermeasures of their own.  —  “Problems are not resolved by imposing tariffs, but by talking and dialoguing … ",
    "url": "https://thehill.com/policy/international/5121268-mexico-canada-announce-retaliatory-measures-following-trump-tariffs/"
  },
  {
    "text": "Elon Musk's team has gotten access to the Treasury Department's payments system.  — Trump tariffs: The Canadian government has been notified by the United States government that goods exported to the United States will be subject to a 25 percent tariff, with a lower rate for Canadian oil … ",
    "url": "https://www.nytimes.com/live/2025/02/01/us/trump-tariffs-news/treasury-department-payments-system?unlocked_article_code=1.tk4.2ZbK.3uhE-0Ft611J&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Elon Musk's Team Now Has Access to Treasury's Payments System  —  Treasury Secretary Scott Bessent gave Mr. Musk's representatives at the so-called Department of Government Efficiency a powerful tool to monitor and potentially limit government spending.  — 1.4k",
    "url": "https://www.nytimes.com/2025/02/01/us/politics/elon-musk-doge-federal-payments-system.html?unlocked_article_code=1.tk4.2ZbK.3uhE-0Ft611J"
  },
  {
    "text": "DOGE is ripping out the guts of government  —  DOGE is beginning to hit, and this piece, by Mike Masnick, provides the best overview I've seen of what's happening. … The gloss that I'd add to what Mike says is this.  Just as happened with Twitter, we are seeing a Silicon Valley power fantasy playing out in real life.",
    "url": "https://www.programmablemutter.com/p/doge-is-ripping-out-the-guts-of-government"
  },
  {
    "text": "Musk aides gain access to sensitive Treasury Department payment system  —  The access — granted by Scott Bessent, Trump's newly confirmed treasury secretary — comes after the ousting of the agency's top career official.  —  Billionaire Elon Musk's deputies have gained access … ",
    "url": "https://www.washingtonpost.com/business/2025/02/01/elon-musk-treasury-payments-system/"
  },
  {
    "text": "Wyden Demands Answers Following Report of Musk Personnel Seeking Access to Highly Sensitive U.S. Treasury Payments System  —  In New Letter to Treasury Secretary Bessent, Wyden Warns That Political Meddling in Treasury Payments Risks Severe Economic Damage, Calls Out Dangerous Conflicts … ",
    "url": "https://www.finance.senate.gov/chairmans-news/wyden-demands-answers-following-report-of-musk-personnel-seeking-access-to-highly-sensitive-us-treasury-payments-system"
  },
  {
    "text": "Senior FBI official forcefully resisted Trump administration firings  —  Brian Driscoll pushed back so aggressively that some feared he would be dismissed.  Driscoll has so far not handed over the names of thousands of FBI agents who worked on Jan. 6th cases.",
    "url": "https://www.nbcnews.com/politics/national-security/senior-fbi-official-forcefully-resisted-trump-administration-firings-rcna190301"
  },
  {
    "text": "BREAKING NEWS: CDC orders mass retraction and revision of submitted research across all science and medicine journals.  Banned terms must be scrubbed.  —  I believe we are breaking news some news here.  To help sustain independent journalism and analysis, please support Inside Medicine.",
    "url": "https://insidemedicine.substack.com/p/breaking-news-cdc-orders-mass-retraction"
  },
  {
    "text": "End Appears Near for U.S. Aid Agency, Democratic Lawmakers Say  —  A sense of crisis among aid groups was growing as U.S.A.I.D.'s website went dark.  —  The website for the U.S. Agency for International Development went dark Saturday afternoon as lawmakers and aid workers … ",
    "url": "https://www.nytimes.com/2025/02/01/us/us-aid-agency-trump.html?unlocked_article_code=1.t04.Z808.njdMGjTNRFbz&smid=url-share"
  },
  {
    "text": "‘This is not right’: Outrage as major government agency accused of ‘breaking the law’  —  The National Transportation Safety Board made a pro-Elon Musk announcement that took onlookers by storm.  —  The NTSB said over the weekend that it would only be announcing news about major aircraft accidents … ",
    "url": "https://www.rawstory.com/trump-musk-ntsb-outrage-x/"
  },
  {
    "text": "Rebecca Lobach ID'd as female soldier inside doomed Black Hawk during DC crash  —  The U.S. Army has identified the female soldier in the doomed Black Hawk helicopter which crashed into an American Airlines flight this week, killing more than 60 people.  —  Capt. Rebecca M. Lobach, of Durham … ",
    "url": "https://nypost.com/2025/02/01/us-news/rebecca-lobach-idd-as-female-soldier-inside-doomed-black-hawk-during-dc-crash/"
  },
  {
    "text": "Tulsi Gabbard faces growing concern about her nomination after a tough confirmation hearing  —  Many in the White House were “rattled” by her refusal to directly answer a question about Edward Snowden, according to a person familiar with the White House's thinking.",
    "url": "https://www.nbcnews.com/politics/congress/tulsi-gabbard-concern-nomination-tough-confirmation-hearing-rcna190307"
  },
  {
    "text": "Health Programs Shutter Around the World After Trump Pauses Foreign Aid  —  Lifesaving treatment and prevention programs for tuberculosis, malaria, H.I.V. and other diseases cannot access funds to continue work.  —  Lifesaving health initiatives and medical research projects have shut … ",
    "url": "https://www.nytimes.com/2025/02/01/health/trump-aid-malaria-tuberculosis-hiv.html?unlocked_article_code=1.tk4.KySl.9gK0vyAP6_Wx&smid=url-share"
  },
  {
    "text": "Education Department employees placed on leave for attending diversity training  —  Several employees began receiving leave notices late Friday.  —  Federal employees at the Education Department could be placed on administrative leave for previously attending a diversity training.",
    "url": "https://www.politico.com/news/2025/02/01/education-department-diversity-training-00201957"
  },
  {
    "text": "Musk's Junta Establishes Him as Head of Government  —  Imagining how we'd cover overseas what's happening to the U.S. right now  —  I've long believed that the American media would be more clear-eyed about the rise and return of Donald Trump if it was happening overseas in a foreign country … ",
    "url": "https://www.doomsdayscenario.co/p/musk-s-junta-establishes-him-as-head-of-government"
  },
  {
    "text": "Trump's DEI purge targets federal workers who did not work in DEI  —  Dozens of workers at the Education Department, Energy Department and other agencies who didn't work on diversity or inclusion issues have been placed on administrative leave after Trump's executive order.",
    "url": "https://www.washingtonpost.com/education/2025/02/01/trump-dei-energy-education-departments/"
  }
]