[
  {
    "text": "Senate dismisses Mayorkas impeachment without trial  —  The Senate voted Wednesday to dismiss two articles of impeachment against Homeland Security Secretary Alejandro Mayorkas, shutting down the possibility of a lengthy Senate trial, which Republicans had demanded to bring attention … ",
    "url": "https://thehill.com/homenews/senate/4600362-mayorkas-impeachment-dismissed-trial/"
  },
  {
    "text": "GOP makes weak pitch as Senate rejects Mayorkas impeachment articles  —  Republicans are pretending that Democrats set a dangerous precedent by discarding Alejandro Mayorkas' impeachment without a trial.  They have it backwards.  —  More than a month after House Republicans impeached … ",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/gop-makes-weak-pitch-senate-rejects-mayorkas-impeachment-articles-rcna148343"
  },
  {
    "text": "Playbook: Why Biden world has gone quiet on the Trump trial  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  THE BUZZ OF THE LEGAL WORLD — “2 of Trump's jurors are lawyers.  Would they acquit on a technicality?” by Betsy Woodruff Swan … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/04/18/why-biden-world-has-gone-quiet-on-the-trump-trial-00152989"
  },
  {
    "text": "Kennedy family to endorse Biden in show of force against RFK Jr. … - With a substantial number of voters telling pollsters they are dissatisfied with both Biden and Trump, Democrats are increasingly petrified that a Kennedy name on the ballot will throw the election to Trump.",
    "url": "https://www.axios.com/2024/04/18/kennedy-family-biden-endorsement-rfk-jr"
  },
  {
    "text": "Kennedy family members will endorse Biden at Philadelphia event  —  The move is a rebuke of Robert F. Kennedy Jr., who is pursing the White House as an independent  —  Several Kennedy family members plan to endorse President Biden for reelection at a campaign event in Philadelphia on Thursday … ",
    "url": "https://www.washingtonpost.com/politics/2024/04/18/kennedy-family-members-endorse-biden/"
  },
  {
    "text": "Johnson's Chamberlain-or-Churchill moment  —  Good morning, Early Birds.  A redacted version of special counsel Robert Mueller's report on Russian interference in the 2016 election was released publicly five years ago today.  Tips: earlytips@washpost.com.  Was this forwarded to you?  Sign up here.",
    "url": "https://www.washingtonpost.com/politics/2024/04/18/johnsons-chamberlain-or-churchill-moment/"
  },
  {
    "text": "Biden chokes up while talking about deceased son and Trump's disparaging remarks about service members  —  “That man doesn't deserve to have been the commander in chief for my son, my uncle,” he said, referring to Beau Biden and Ambrose Finnegan, who both served in the military.",
    "url": "https://www.nbcnews.com/politics/2024-election/biden-chokes-talking-beau-trumps-remarks-service-members-rcna148274"
  },
  {
    "text": "Trump campaign asks for cut of candidates' fundraising when they use his name and likeness  —  The campaign sent the letter as the former president is struggling to close a fundraising gap with Biden.  —  Former President Donald Trump's campaign has found a new way to press for badly needed cash.",
    "url": "https://www.politico.com/news/2024/04/17/trump-campaign-fundraising-five-percent-00152830"
  },
  {
    "text": "Trump is funneling campaign money into cash-strapped businesses.  Experts say it looks bad.  —  Donald Trump's main 2024 White House campaign fundraising operation sharply increased spending at the former president's properties in recent months, funneling money into his businesses … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/04/18/trump-campaign-funnels-money-to-his-businesses/73344744007/"
  },
  {
    "text": "Complaint Asks the FBI to Probe Trump Claims on a $50 Million Loan  —  GIMME SHELTER  —  A government watchdog group is filing a complaint about a $50 million loan that Trump claimed for years on government disclosure forms but which may have never existed.",
    "url": "https://www.thedailybeast.com/complaint-asks-the-fbi-to-probe-trump-claims-on-a-dollar50-million-loan"
  },
  {
    "text": "DOJ nearing settlement with sexual assault victims of Larry Nassar over FBI failures  —  The Department of Justice is close to reaching a settlement with the sexual abuse victims of former U.S. gymnastics team doctor Larry Nassar.  —  According to the Wall Street Journal … ",
    "url": "https://www.washingtonexaminer.com/news/2970224/doj-nearing-settlement-victims-larry-nassar-fbi-failures/"
  },
  {
    "text": "The two-party system isn't the problem  —  See: Netanyahu, Benjamin.  —  ∙ Paid … The US two-party system is a perennial punching bag.  —  “Can the US ever break the two-party binary?”  Al Jazeera asked earlier this year.  “How to fix democracy: Move beyond the two-party system … ",
    "url": "https://www.publicnotice.co/p/two-party-system-isnt-the-problem-israel-england"
  },
  {
    "text": "Senate nominee bankrolled by far-right activist trashing MLK and the Civil Rights Act  —  Judd Legum, Tesnim Zekeria, and Rebecca Crosby  —  Last month, Bernie Moreno won the Republican nomination for U.S. Senate in Ohio.  Moreno benefited from an early endorsement from Turning Point Action … ",
    "url": "https://popular.info/p/senate-nominee-bankrolled-by-far"
  },
  {
    "text": "Miscalculation Led to Escalation in Clash Between Israel and Iran  —  Israeli officials say they didn't see a strike on a high-level Iranian target in Syria as a provocation, and did not give Washington a heads-up about it until right before it happened.  —  Israel was mere moments away … ",
    "url": "https://www.nytimes.com/2024/04/17/world/middleeast/iran-israel-attack.html"
  },
  {
    "text": "Biden suggests unfounded idea about his uncle and ‘cannibals’ in World War II  —  President Joe Biden appeared to suggest that cannibals ate his uncle after he was shot down during World War II, though military records say otherwise.  —  Speaking with reporters on Wednesday in Scranton … ",
    "url": "https://www.washingtonexaminer.com/news/white-house/2970009/biden-unfounded-idea-uncle-cannibals-in-world-war-ii/"
  },
  {
    "text": "Blinken Is Sitting on Staff Recommendations to Sanction Israeli Military Units Linked to Killings or Rapes  —  A special State Department panel told Secretary of State Antony Blinken that the U.S. should restrict arms sales to Israeli military units that have been credibly accused of human rights abuses.",
    "url": "https://www.propublica.org/article/israel-gaza-blinken-leahy-sanctions-human-rights-violations"
  },
  {
    "text": "Jawbone of Long Dead U.S. Marine Found in Kid's Rock Collection  —  ‘UNEXPECTED’  —  He was laid to rest at a cemetery in Missouri back in 1951, and there had reportedly never been any inkling that the grave did not contain all of his remains.  —  Capt. Everett Leland Yager of the U.S. Marine Corps … ",
    "url": "https://www.thedailybeast.com/jawbone-of-long-dead-us-marine-found-in-kids-rock-collection"
  },
  {
    "text": "Our Uniquely American Drug Shortages  —  More drugs are in short supply than ever before.  We've known the reason why for a long time: monopolistic middlemen.  —  Last week, the American Society of Health-System Pharmacists (ASHP) announced that the United States has the largest number … ",
    "url": "https://prospect.org/health/2024-04-17-our-uniquely-american-drug-shortages/"
  },
  {
    "text": "Red states threaten librarians with prison — as blue states work to protect them  —  Sam Lee, a leader of the Connecticut Library Association, heads to work these days torn between hope and fear.  —  She's encouraged because legislators in her state proposed a bill this year making it harder for school boards to ban library books.",
    "url": "https://www.washingtonpost.com/education/2024/04/16/library-legislation-restrictions-protections/"
  },
  {
    "text": "Kennedy family to endorse Biden in Philadelphia in latest rebuke to RFK Jr.  —  The Kennedy family is set to endorse President Biden in his reelection campaign on Thursday during an event in Philadelphia, a strong rebuke of Robert F. Kennedy Jr.'s independent White House bid.",
    "url": "https://thehill.com/homenews/campaign/4601404-kennedy-family-to-endorse-biden-in-philadelphia-in-latest-rebuke-to-rfk-jr/"
  },
  {
    "text": "Russia to Hire Contract Soldiers in Bid to Avoid Unpopular Draft  — Kremlin anxious not to stir fears that triggered 2022 exodus  — Ukraine has faced delays in Western aid and personnel shortage  —  Russia is preparing to enlist more contract soldiers as it presses its invasion of Ukraine … ",
    "url": "https://www.bloomberg.com/news/articles/2024-04-18/war-in-ukraine-russia-to-enlist-more-hired-soldiers-to-avoid-conscription"
  }
]