[
  {
    "text": "Why the White House is letting McCarthy flail  —  The administration has no plans to help as Kevin McCarthy and House Republicans inch closer to a government shutdown.  —  Speaker Kevin McCarthy is struggling to pass a bill to fund the government — and the White House isn't about to throw him a lifeline.",
    "url": "https://www.politico.com/news/2023/09/20/biden-white-house-mccarthy-shutdown-budget-00116965"
  },
  {
    "text": "GOP tensions over abortion won't go away  —  Good morning, Early Birds.  President George W. Bush vowed 22 years ago today in an address to a joint session of Congress to wage a “war on terror” that would “not end until every terrorist group of global reach has been found, stopped and defeated.”",
    "url": "https://www.washingtonpost.com/politics/2023/09/20/gop-tensions-over-abortion-wont-go-away/"
  },
  {
    "text": "Playbook: Inside the Dems' shutdown strategy  —  Presented by With help from Eli Okun and Garrett Ross  —  DRIVING THE DAY  —  DON'T QUIT YOUR DAY JOB — “Rep. Ken Buck eyes CNN job while criticizing Biden impeachment inquiry,” by NY Post's Steven Nelson: “Buck, 64, confirmed … ",
    "url": "https://www.politico.com/newsletters/playbook/2023/09/20/inside-the-dems-shutdown-strategy-00116988"
  },
  {
    "text": "Breaking Up Is Hard to Do  —  Rupert Murdoch didn't want to dump his ratings leader and favorite Fox host.  But was Tucker Carlson giving him a choice?  —  After Donald Trump was elected president in 2016, Fox News — to the surprise of many, including founder Rupert Murdoch, who loathed Trump … ",
    "url": "https://nymag.com/intelligencer/article/michael-wolff-fox-news-rupert-murdoch-tucker-carlson-book-excerpt.html"
  },
  {
    "text": "Three fake electors charged in Georgia election probe seek to move cases to federal court  —  David Shafer, Shawn Still and Cathy Latham are among the 16 Georgians who acted as so-called false electors for Trump in Georgia in 2020.  —  Three Georgia Republicans who participated … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/three-fake-electors-charged-georgia-election-probe-seek-move-cases-fed-rcna107952"
  },
  {
    "text": "Biden's campaign set to counterpunch on misinformation  —  With social-media platforms pulling back from policing false political claims, and Trump gearing up for a fight, Biden's 2024 campaign is rebooting its online defenses.  —  Joe Biden's presidential campaign is overhauling its strategy … ",
    "url": "https://www.politico.com/news/2023/09/19/bidens-social-media-misinfo-fight-00116721"
  },
  {
    "text": "September 2023 National Poll: A Trump Bump In GOP Primary  —  Home Polls September 2023 National Poll: A Trump Bump In GOP Primary … The September Emerson College Polling national survey of U.S. voters finds former President Donald Trump with a 47-point lead over his closest competitor … ",
    "url": "https://emersoncollegepolling.com/september-2023-national-poll-a-trump-bump-in-gop-primary/"
  },
  {
    "text": "Trump Jr.'s X account hacked  —  Donald Trump Jr.'s account on X, formerly known as Twitter, was hacked on Wednesday morning, leading to the spread of false and inflammatory posts under his name.  —  A representative for Trump Jr. confirmed to The Hill that the account, which has more than 10 million followers, was hacked.",
    "url": "https://thehill.com/policy/technology/4213609-trump-jr-s-x-account-hacked/"
  },
  {
    "text": "Democrats retake razor-thin majority in Pennsylvania state House  —  Democrat Lindsay Powell won the open state House seat in a special election in Allegheny County, restoring a one-seat Democratic majority in the swing state.  —  Democrat Lindsay Powell, a nonprofit worker and former staffer … ",
    "url": "https://www.nbcnews.com/politics/elections/democrats-retake-razor-thin-majority-pennsylvania-state-house-rcna105803"
  },
  {
    "text": "Harris's unpopularity is the product of her liberal bubble  —  is wildly unpopular, likely because she lives in a thick liberal bubble where she is shielded from ever having to deal with reality.  —  This was apparent from Harris's comments on Tuesday during her “Fight for Our Freedoms” college tour.",
    "url": "https://www.washingtonexaminer.com/opinion/harris-unpopularity-liberal-bubble"
  },
  {
    "text": "Trump and Meadows joked about Covid on plane after Biden debate, book says  —  Exclusive: Ex-aide Cassidy Hutchinson says Trump ordered White House guests who tested positive to remove masks in Oval Office  —  Donald Trump and his chief of staff Mark Meadows joked about the then US president having Covid … ",
    "url": "https://www.theguardian.com/books/2023/sep/20/trump-meadows-joked-covid-biden-debate-cassidy-hutchinson-book"
  },
  {
    "text": "Tim Ballard has resigned from Operation Underground Railroad amid reports of sexual misconduct  —  Ballard, an anti-sex trafficking activist, said in a statement that “the latest tabloid-driven sexual allegations are false.”  —  Tim Ballard, the anti-sex trafficking activist whose exploits inspired … ",
    "url": "https://www.nbcnews.com/news/tim-ballard-resigned-operation-underground-railroad-reports-sexual-mis-rcna105835"
  },
  {
    "text": "Tuberville to try going around his own blockade to confirm Marine commandant  —  Sen. Tommy Tuberville (R-Ala.) told senators that he will attempt to force a one-off vote on Wednesday to confirm Gen. Eric Smith to become the new commandant for the Marine Corps while he maintains his blockade on more than 300 military promotions.",
    "url": "https://thehill.com/homenews/senate/4212731-tuberville-to-try-going-around-his-own-blockade-to-confirm-marine-commandant/"
  },
  {
    "text": "Biden to create new office of gun violence prevention  —  The move, long sought by gun-control groups, comes amid stalled progress on firearms legislation  —  President Biden on Friday will announce the creation of a new office for gun violence prevention, an escalation of the administration's efforts … ",
    "url": "https://www.washingtonpost.com/politics/2023/09/19/biden-creates-gun-violence-prevention-office/"
  },
  {
    "text": "White House launches American Climate Corps  —  The move comes as Democratic lawmakers and activists call on President Joe Biden to take bigger steps to fight climate change.  —  WASHINGTON — The White House on Wednesday announced the launch of the American Climate Corps … ",
    "url": "https://www.nbcnews.com/politics/white-house/white-house-launches-american-climate-corps-rcna105931"
  },
  {
    "text": "Rishi Sunak considers weakening key green policies  —  Rishi Sunak is considering weakening some of the government's key green commitments in a major policy shift.  —  It could include delaying a ban on the sales of new petrol and diesel cars and phasing out gas boilers, multiple sources have told the BBC.",
    "url": "https://www.bbc.com/news/uk-politics-66857551"
  },
  {
    "text": "Former congressman sentenced to nearly 2 years in prison for insider trading  —  Stephen Buyer, a Republican who represented an Indiana district, was convicted in March of insider trading related to his consulting work.  —  A former Republican lawmaker who served in Congress for nearly … ",
    "url": "https://www.nbcnews.com/politics/politics-news/former-rep-stephen-buyer-sentenced-22-months-insider-trading-rcna105927"
  },
  {
    "text": "Right-Wing Group That Compares Biden Conservation Plan to Genocide Is Getting Taxpayer Money  —  American Stewards of Liberty paints apocalyptic visions about environmental programs.  Counties are buying the hype, for tens of thousands in taxpayer funds.",
    "url": "https://www.thedailybeast.com/american-stewards-of-liberty-which-compares-biden-conservation-plan-to-genocide-is-getting-taxpayer-mone"
  }
]