[
  {
    "text": "Trump delivers profanity, below-the-belt digs at Catholic charity banquet  —  The only person off limits for Trump's roast was himself.  —  NEW YORK — Republican presidential nominee Donald Trump used his remarks at a Catholic charity banquet here on Thursday to skewer prominent Democrats, often in off-color terms.",
    "url": "https://www.washingtonpost.com/politics/2024/10/17/trump-harris-al-smith-dinner/"
  },
  {
    "text": "Critics Slam Al Smith Charity Dinner For Normalizing ‘Deranged Madman’ Donald Trump  —  Critics didn't find the former president's attendance at the white-tie event funny, with emcee Jim Gaffigan drawing ire too.  —  LOADING  —  Critics condemned the appearance of Donald Trump … ",
    "url": "https://www.huffpost.com/entry/donald-trump-al-smith-dinner-slammed_n_6711fdc4e4b069ea0f05fe71"
  },
  {
    "text": "“I did make a mistake”: Baier apologizes for playing edited Trump clip in Harris interview  —  The Fox News anchor's deceptive video clip left out Trump's remarks about “enemies from within”  —  Fox News anchor Bret Baier is apologizing for playing a misleadingly edited clip in an interview with Vice President Kamala Harris.",
    "url": "https://www.salon.com/2024/10/17/i-did-make-a-mistake-baier-apologizes-for-playing-edited-clip-in-harris-interview/"
  },
  {
    "text": "Former GOP adviser: White House race is Harris's to lose  —  Mark McKinnon, a longtime GOP political adviser, says he thinks Vice President Harris will win the election, now just 18 days away.  —  “I'm going to make a bold prediction here because I just don't give a sh- if I'm wrong … ",
    "url": "https://thehill.com/homenews/media/4940718-republican-adviser-mark-mckinnon-kamala-harris-donald-trump-2024-election/"
  },
  {
    "text": "Playbook: Trump's media backout  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  A ONE-TWO PUNCH — With 18 days left until Election Day, VP KAMALA HARRIS will be hitting the road with the two most popular members of her party: BARACK and MICHELLE OBAMA.",
    "url": "https://www.politico.com/newsletters/playbook/2024/10/18/trumps-media-backout-00184324"
  },
  {
    "text": "Trump Is Speaking Like Hitler, Stalin, and Mussolini  —  To support The Atlantic's journalism, please consider subscribing today.  —  Rhetoric has a history.  The words democracy and tyranny were debated in ancient Greece; the phrase separation of powers became important in the 17th and 18th centuries.",
    "url": "https://www.theatlantic.com/politics/archive/2024/10/trump-authoritarian-rhetoric-hitler-mussolini/680296/?gift=hVZeG3M9DnxL4CekrWGK34vU4G4QMrQTKJxena1OKFY&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Trump overcharged Secret Service agents to stay at his D.C. hotel, new Democratic report says  —  Then-President Donald Trump also benefited from U.S. officials and others seeking jobs and pardons who paid for stays at his downtown Washington hotel, House Democrats allege.",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-secret-service-dc-hotel-emoluments-pardons-jobs-democrat-report-rcna175714"
  },
  {
    "text": "Trump hotel overcharged Secret Service, report by House Democrats finds  —  Trump's D.C. hotel charged the Secret Service above-normal government rates — and sometimes charged the agency more than it did other patrons, House Democrats found.  —  During Donald Trump's presidency … ",
    "url": "https://www.washingtonpost.com/politics/2024/10/18/trump-hotel-secret-service-overcharging/"
  },
  {
    "text": "Majority of Americans Feel Worse Off Than Four Years Ago  —  Economic Confidence Index remains negative at -26  —  WASHINGTON, D.C. — More than half of Americans (52%) say they and their family are worse off today than they were four years ago, while 39% say they are better off and 8% volunteer that they are about the same.",
    "url": "https://news.gallup.com/poll/652250/majority-americans-feel-worse-off-four-years-ago.aspx"
  },
  {
    "text": "Harris Will Campaign With the Obamas Next Week  —  Barack and Michelle Obama will make their first campaign appearances alongside Kamala Harris at rallies in Georgia and Michigan.  —  Here come the Obamas.  —  Former President Barack Obama and Michelle Obama, the former first lady … ",
    "url": "https://www.nytimes.com/2024/10/18/us/politics/kamala-harris-michelle-obama-barack-obama.html"
  },
  {
    "text": "Julian Zelizer on Trump's increasingly dire rhetoric  —  “He doesn't even really use code words or anything.  He's just all in.”  —  ∙ Paid … In the closing days of the 2024 campaign, Donald Trump is talking a lot about “the enemy within.”  He's threatened to deploy the US military against his domestic political foes.",
    "url": "https://www.publicnotice.co/p/julian-zelizer-interview-trump"
  },
  {
    "text": "JD Vance Campaign Event With Christian Right Leaders May Have Violated Tax and Election Laws, Experts Say  —  Ziklag and the Courage Tour, the far-right groups that hosted the Republican vice-presidential nominee, are charities that can't legally intervene in political campaigns.  —  Co-published with Documented",
    "url": "https://www.propublica.org/article/vance-ziklag-courage-tour-christian-right-tax-election-laws"
  },
  {
    "text": "Biden tells Netanyahu it's time to end Gaza war after Sinwar's elimination … - Israeli and U.S. officials say Sinwar's death on Wednesday creates an opportunity to resume talks on a deal to release the 101 hostages still held by Hamas and establish a ceasefire in Gaza.",
    "url": "https://www.axios.com/2024/10/17/biden-netanyahu-sinwar-gaza-war"
  },
  {
    "text": "Even Fox News's Bret Baier Admits Harris Outsmarted Him in Interview  —  Fox News's Brett Baier went on the offensive during an interview with Kamala Harris Wednesday night, but even he had to admit she got the best of him.  —  In a segment reacting to his own contentious interview … ",
    "url": "https://newrepublic.com/post/187245/kamala-harris-fox-news-bret-baier-roasted-interview"
  },
  {
    "text": "Trump says Fox shouldn't air negative ads  —  Former President Trump criticized Fox News in an interview Friday for airing negative political ads attacking him, saying he would appeal directly to media mogul Rupert Murdoch to remove them from the network.  —  “In the old days, you never played negative ads.",
    "url": "https://thehill.com/homenews/media/4940810-donald-trump-fox-news-negative-campaign-ads/"
  },
  {
    "text": "Tim Walz Defends Queer And Trans Youth At Length In Interview With Glennon Doyle  —  Erin In The Morning is a reader-supported publication.  To receive new posts and support my work, consider becoming a subscriber.  —  On Thursday, Governor Tim Walz sat down for an interview with author Glennon Doyle … ",
    "url": "https://www.erininthemorning.com/p/tim-walz-defends-trans-people-at"
  },
  {
    "text": "When the Top General in the U.S. Says You're ‘Fascist to the Core’  —  Toward the end of his tenure, Gen. Mark Milley, who was the chairman of the Joint Chiefs of Staff from 2019 to 2023, told Bob Woodward of The Washington Post that Donald Trump was a fundamental threat to the safety and integrity of the United States.",
    "url": "https://www.nytimes.com/2024/10/18/opinion/trump-woodward-milley-mass-deportation.html?unlocked_article_code=1.TE4.aEQr.bu63SohLeWP4&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Turns out we'll see a big Jack Smith document dump before the election  —  U.S. District Judge Tanya Chutkan has agreed to release a dossier of evidence amassed by special counsel Jack Smith, ruling Thursday that the high public interest in the document outweighs Trump's demand that she keep it hidden until after the election.",
    "url": "https://www.politico.com/live-updates/2024/10/17/2024-elections-live-coverage-updates-analysis/more-trump-evidence-coming-00184297"
  },
  {
    "text": "How Silicon Valley Billionaires Became Trump's Biggest Donors … Last February, the billionaire financier Nelson Peltz summoned a group of about 20 wealthy, predominantly Republican donors and a handful of G.O.P. strategists to dinner at his $334 million waterfront estate in Palm Beach … ",
    "url": "https://www.nytimes.com/2024/10/18/magazine/trump-donors-silicon-valley.html"
  },
  {
    "text": "Harris's pandering to black men won't work  —  Confronted with a series of polls indicating a historic cratering of support among black men, Vice President Kamala Harris unveiled a new “Opportunity Agenda for Black Men,” hoping to entice one of the Democratic Party's most critical voting blocs to show up to the polls in November.",
    "url": "https://www.washingtonexaminer.com/opinion/3194506/harris-pandering-to-black-men-wont-work/"
  }
]