[
  {
    "text": "GOP tensions explode after McCarthy bows out of speaker race  —  House Republicans were distraught, furious and concerned for the future of their party after Rep. Kevin McCarthy (R-Calif.) announced he won't run for speaker again after being ousted on Tuesday.",
    "url": "https://www.axios.com/2023/10/04/house-republicans-kevin-mccarthy-removal-speaker"
  },
  {
    "text": "The House GOP Is a Failed State  —  Kevin McCarthy's ouster is dramatic evidence, if redundant, about the state of the modern GOP.  —  At the start, Kevin McCarthy's speakership was effectively an optical illusion.  At the end, it was an exercise in self-abasement.  Francis Chung/POLITICO",
    "url": "https://www.politico.com/news/magazine/2023/10/03/house-gop-failed-state-00119842"
  },
  {
    "text": "'He's about clicks': Florida Republicans furious at Gaetz  —  They called him divisive and an attention-seeker.  —  MIAMI — Florida's congressional Republicans are done with Matt Gaetz.  —  They left the House chamber last night furious after Gaetz led seven other GOP members … ",
    "url": "https://www.politico.com/news/2023/10/04/florida-republicans-matt-gaetz-furious-00119865"
  },
  {
    "text": "House bipartisan caucus risks collapse after McCarthy ouster … The Republicans say he was punished for “doing the right thing” after advancing a stopgap funding bill on a bipartisan basis.  — Frustrated members said that Democrats in the group, which is aimed at finding bipartisan solutions … ",
    "url": "https://www.axios.com/2023/10/03/problem-solvers-caucus-mccarthy-removal-speaker"
  },
  {
    "text": "As McCarthy tumbled toward defeat, Trump did not defend his speakership  —  Trump's limited support for the man he famously called ‘my Kevin’ encapsulated a relationship that has ebbed and flowed over the years  —  As Kevin McCarthy battled this week to keep the job he would eventually lose … ",
    "url": "https://www.washingtonpost.com/politics/2023/10/04/trump-mccarthy-relationship/"
  },
  {
    "text": "McCarthy ouster exposes the Republican Party's destructive tendencies  —  By voting to expel Kevin McCarthy as House speaker, Republicans ground the work of Congress to a halt and revealed the danger of governing by chaos  —  Nine months into their reign as the majority party in the House … ",
    "url": "https://www.washingtonpost.com/politics/2023/10/04/mccarthy-speaker-ouster-analysis/"
  },
  {
    "text": "Republicans Cut Off Their Own Heads  —  A gang of eight ousts a Speaker with no plan or replacement in mind.  —  A band of eight Republicans succeeded in ousting Kevin McCarthy as House Speaker on Tuesday, and we trust they're happy.  They now have the chaos they wanted, though it isn't clear what else they hope to achieve.",
    "url": "https://www.wsj.com/articles/kevin-mccarthy-removed-as-speaker-house-motion-to-vacate-eight-republicans-gop-matt-gaetz-5fb0e1c2?mod=followamazon"
  },
  {
    "text": "Trump is not ruling out being the new House speaker  —  Believe it or not, the House speaker doesn't actually have to be serving in the House.  —  Trump addresses calls for him to be the next House speaker  —  Does Donald Trump want to be speaker of the House?",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-not-ruling-new-house-speaker-rcna118794"
  },
  {
    "text": "Nikki Haley vaults to second place in New Hampshire in new GOP primary poll  —  Today's Suffolk University/Boston Globe/USA TODAY poll (yes, that's a mouthful) will be touted by Nikki Haley's campaign.  She's rocketed into second place with the support of 19% of likely New Hampshire Republican Primary voters … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2023/10/04/suffolk-boston-globe-usa-today-poll/71050447007/"
  },
  {
    "text": "October 2023 Winthrop Poll Results  —  South Carolina Registered Voters poll of 1569 (weighted) respondents (MOE +/- 2.47%)  —  ROCK HILL, SOUTH CAROLINA - Despite currently facing multiple criminal charges, Donald Trump remains South Carolina voters' top pick to become the 2024 Republican candidate … ",
    "url": "https://www.winthrop.edu/winthroppoll/2023-october-winthroppoll-results.aspx"
  },
  {
    "text": "McHenry ordered Pelosi to leave her Capitol hideaway office by Wednesday  —  The former speaker blasted the move as a “sharp departure from tradition.”",
    "url": "https://www.politico.com/live-updates/2023/10/03/congress/mchenry-pelosi-hideaway-office-house-remove-00119803"
  },
  {
    "text": "Giuliani's Drinking, Long a Fraught Subject, Has Trump Prosecutors' Attention  —  The former mayor's drinking has become an investigative subplot in Donald Trump's federal case over 2020 election interference.  But long before that, friends had grown deeply concerned.",
    "url": "https://www.nytimes.com/2023/10/04/us/politics/rudy-giuliani-drinking.html"
  },
  {
    "text": "Bob Menendez's wife hit and killed a man while driving on Bogota's Main Street in 2018  —  Nadine Arslanian Menendez, federally indicted in a bribery scheme with her husband, Sen. Bob Menendez, struck and killed a man while driving her Mercedes-Benz on Main Street in Bogota in December 2018.",
    "url": "https://www.northjersey.com/story/news/new-jersey/2023/10/04/bob-menendez-wife-car-accident-bogota-nj-police-indictment/71051427007/"
  },
  {
    "text": "Jordan becomes first to announce run for speaker  —  His candidacy will likely run right into Majority Leader Steve Scalise (R-La.), who is also considering a speakership bid and has worked to court conservatives.",
    "url": "https://www.politico.com/live-updates/2023/10/04/congress/jordain-officially-in-00119892"
  },
  {
    "text": "Exclusive: US will transfer weapons seized from Iran to Ukraine  —  The US will transfer thousands of seized Iranian weapons and rounds of ammunition to Ukraine, in a move that could help to alleviate some of the critical shortages facing the Ukrainian military as it awaits more money … ",
    "url": "https://www.cnn.com/2023/10/04/politics/us-iran-seized-weapons-ukraine/"
  },
  {
    "text": "DeSantis Gets a $15 Million Cash Infusion and Moves Staff Into Iowa  —  The relocation caps off a monthslong retooling of the campaign, which was in financial dire straits this summer.  But the Florida governor still has a steep climb ahead.  —  Gov. Ron DeSantis of Florida is relocating … ",
    "url": "https://www.nytimes.com/2023/10/04/us/politics/desantis-iowa-fundraising.html"
  }
]