[
  {
    "text": "Who Should Be Trump's No. 2?  —  “Who should President Trump choose for V.P.?” is one of the most popular questions among the political cognoscenti right now.  It's understandable: Donald Trump won both Iowa and New Hampshire with more than 50 percent of the vote, after his closest competitors … ",
    "url": "https://www.nytimes.com/2024/02/05/opinion/trump-vice-president.html"
  },
  {
    "text": "The 91-year-old Republican suing to kick Donald Trump off the ballot  —  Norma Anderson, a trailblazing former GOP legislator, is among the Colorado voters who have challenged the Republican front-runner's candidacy in a case that will be heard by the Supreme Court",
    "url": "https://www.washingtonpost.com/politics/2024/02/05/trump-supreme-court-ballot-norma-anderson/"
  },
  {
    "text": "The Week Ahead  —  This week, with oral argument scheduled before the Supreme Court on Thursday, we'll be focusing on the litigation over the 14th Amendment, and whether the state of Colorado can remove Donald Trump from the ballot in that state.  An audio feed of the argument will be live-streamed on the Court's website.",
    "url": "https://joycevance.substack.com/p/the-week-ahead-99a"
  },
  {
    "text": "Donald Trump's Global Business Empire Is Growing Again  —  Former president resumes expansion of his foreign real-estate portfolio after pause during White House term  —  During Donald Trump's first campaign and his four years in the White House, his foreign business dealings drew constant scrutiny for potential conflicts of interest.",
    "url": "https://www.wsj.com/politics/policy/trump-organization-global-business-assets-3f946891?mod=followamazon"
  },
  {
    "text": "Republicans demonstrate their unseriousness about the border  —  Trump ordered Mike Johnson and company to punch themselves in the face and they obliged. … In recent months, the Biden White House and Democrats in Congress have signaled readiness to accept a bipartisan border deal heavily tilted towards … ",
    "url": "https://www.publicnotice.co/p/mike-johnson-trump-bipartisan-border-deal-senate"
  },
  {
    "text": "Statement from President Joe Biden on Bipartisan Senate National Security Agreement  —  For too long, going back decades, the immigration system has been broken.  It's time to fix it.  That's why over two months ago I instructed members of my administration to work with a bipartisan group of Senators to … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/02/04/statement-from-president-joe-biden-on-bipartisan-senate-national-security-agreement/"
  },
  {
    "text": "Why The Border Deal Happened: Republicans Held Europe For Ransom  —  Europeans supporting aid to Ukraine get a brutal lesson in how American politics is hampering the transatlantic security relationship.  —  Rep. Greg Murphy said he agreed with former NATO chief Anders Fogh Rasmussen (above) … ",
    "url": "https://www.politico.com/news/magazine/2024/02/05/what-happens-when-nato-meets-the-freedom-caucus-00139351"
  },
  {
    "text": "A Major Sign of Trouble in Nancy Mace's Office: Total Staff Turnover  —  Nancy Mace's entire D.C. office has turned over since Nov. 1.  Former staff members described a “toxic” work culture driven by a “delusional” boss. … Add another ignoble credential to Rep. Nancy Mace's résumé.",
    "url": "https://www.thedailybeast.com/a-major-sign-of-trouble-in-nancy-maces-office-total-staff-turnover"
  },
  {
    "text": "Not just Civil War  —  Insurrection and Trump's Ineligibility for Office  —  Section 3 of the Fourteenth Amendment bans oath-breaking insurrectionists from holding office.  The Supreme Court of Colorado has ruled that Trump's name should not appear on primary ballots in that state.",
    "url": "https://snyder.substack.com/p/not-just-civil-war"
  },
  {
    "text": "Biden condemns ‘anti-Arab hate’ after Wall Street Journal op-ed labels Michigan city 'America's jihad capital'  —  President Biden called out “anti-Arab hate” against Dearborn, Mich., residents after an op-ed in the Wall Street Journal called the city “America's jihad capital.”",
    "url": "https://thehill.com/homenews/administration/4448494-biden-condemns-anti-arab-hate-after-wall-street-journal-op-ed-labels-michigan-city-americas-jihad-capital/"
  },
  {
    "text": "Publix versus the public  —  Elected officials should not do the bidding of corporate donors; they should act in the best interests of their constituents.  It is often difficult, however, to prove a politician's motivation.  A politician can generally claim that an act or omission that benefits … ",
    "url": "https://popular.info/p/publix-versus-the-public"
  },
  {
    "text": "House Republicans Impeach Alejandro Mayorkas at Their Peril  —  Just when you thought House Republicans couldn't warp the impeachment process any more, here we are, watching them twist and stretch this weighty constitutional provision beyond all recognition — like some grimy wad of Silly Putty pulled … ",
    "url": "https://www.nytimes.com/2024/02/05/opinion/house-impeachment-mayorkas.html"
  },
  {
    "text": "McCarthy wanted a successor.  He got a fight.  —  In red California, the race to replace the former speaker could be a microcosm of forces shaping the Republican Party.  —  Kevin McCarthy couldn't bend unruly Republican lawmakers to his will in Washington.  Back home in Bakersfield, Republican voters may reject his succession plan.",
    "url": "https://www.politico.com/news/2024/02/05/mccarthy-ouster-succession-fight-00139440"
  },
  {
    "text": "When the tech bros come for me  —  First, the tech bros came for the warehouse workers, and I said nothing.  Paying them terrible wages, working them to the bone, tracking their every second, injuring them at record levels, all in the pursuit of customer obsession and profit.",
    "url": "https://gerrymcgovern.com/when-the-tech-bros-come-for-me/"
  },
  {
    "text": "Tucker Carlson Being Spotted in Moscow Sparks Frenzied Speculation  —  The reported appearance of former Fox News host Tucker Carlson in the Russian capital has sparked intense speculation over the purpose of the conservative media personality's visit to Moscow.",
    "url": "https://www.newsweek.com/tucker-carlson-moscow-russia-vladimir-putin-1866669"
  }
]