[
  {
    "text": "The Trump-Zelensky blowup, broken down by body-language analysts  —  The decision not to use an interpreter, the power imbalance, Trump's misstatements and Zelensky's “warrior energy” helped fuel the unusual public flap.  —  just now  —  President Donald Trump and Vice President JD Vance … ",
    "url": "https://www.washingtonpost.com/world/2025/03/01/zelensky-trump-video-body-language/"
  },
  {
    "text": "A Day of American Infamy  —  In August 1941, about four months before the Japanese attack on Pearl Harbor, Franklin Roosevelt met with Winston Churchill aboard warships in Newfoundland's Placentia Bay and agreed to the Atlantic Charter, a joint declaration by the world's leading democratic powers on … ",
    "url": "https://www.nytimes.com/2025/02/28/opinion/a-day-of-american-infamy.html?unlocked_article_code=1.0k4.2WNT.xlHiyZ4L5Pwy&smid=bs-share"
  },
  {
    "text": "Putin Wins the Trump-Zelensky Oval Office Spectacle  —  Vice President Vance starts a public fight that only helps Russia's dictator.  —  Toward the end of his on-camera, Oval Office brawl with Ukraine's Volodymyr Zelensky on Friday, President Trump quipped that it was “great television.”",
    "url": "https://www.wsj.com/opinion/putin-wins-the-trump-zelensky-oval-office-spectacle-e23e9b21?st=xfiJdB&reflink=desktopwebshare_permalink"
  },
  {
    "text": "The War Trump Chooses  —  That wasn't Trump against Zelens'kyi.  It was Americans against reason  —  The Americans claim that their attempt to humiliate the Ukrainian president in the White House yesterday was about peace.  On that premise, nothing they said makes any sense.",
    "url": "https://snyder.substack.com/p/the-war-trump-chooses"
  },
  {
    "text": "Trump's Dressing Down of Zelensky Plays Into Putin's War Aims  —  The public blowup could propel President Vladimir V. Putin of Russia to escalate the fight in Ukraine instead of agreeing to peace.  —  President Trump says he wants a quick cease-fire in Ukraine.",
    "url": "https://www.nytimes.com/2025/03/01/world/europe/trump-zelensky-putin.html"
  },
  {
    "text": "President Trump Embarrassed Himself, the Nation, and Every Thinking Human on Earth  —  In the Oval Office on Friday, Donald Trump and JD Vance behaved like angry children.  Volodymyr Zelenskyy acted like a man.  —  (Permanent Musical Accompaniment to the Last Post of the Week from the Blog's Favourite Living Canadian)",
    "url": "https://www.esquire.com/news-politics/politics/a63982213/trump-zelenskyy-ukraine-deal-argument/"
  },
  {
    "text": "Trump Is Rootin' for Putin  —  It was a sickening spectacle: the man who tried to upend democracy bullying the man who is fighting for democracy.  —  The air seemed to turn flame red as the TV stars-turned-pols sat side by side in elegant yellow armchairs and had the wildest dust-up ever televised from the Oval Office.",
    "url": "https://www.nytimes.com/2025/03/01/opinion/trump-is-rootin-for-putin.html"
  },
  {
    "text": "Behind the Collision: Trump Jettisons Ukraine on His Way to a Larger Goal  —  The president's explosive Oval Office encounter reflected his determination to put aside alliances and commitments to principles in favor of raw great power negotiations.  —  After five weeks in which President Trump … ",
    "url": "https://www.nytimes.com/2025/02/28/us/politics/trump-ukraine-zelensky.html"
  },
  {
    "text": "Musk's Purges Suddenly Take a Horrific Turn—and Wreck an Ugly MAGA Lie  —  It has a dry, bureaucratic name, but Ready to Use Therapeutic Food has functioned for over a decade as a lifeline for countless starving children around the globe.  Manufactured in the United States and distributed … ",
    "url": "https://newrepublic.com/article/192193/musk-usaid-purge-horrific-turn-maga-lie"
  },
  {
    "text": "Francis Collins Retires From N.I.H., Saying Colleagues ‘Deserve the Utmost Respect’  —  Dr. Collins, a renowned geneticist, ran the National Institutes of Health for 12 years.  His parting statement offered a pointed, if veiled, message to the Trump administration.",
    "url": "https://www.nytimes.com/2025/03/01/us/politics/francis-collins-nih-retires.html"
  },
  {
    "text": "Cuomo Enters N.Y.C. Mayor's Race, Upending Contest to Unseat Adams  —  The comeback attempt, three years after Andrew M. Cuomo resigned as governor in scandal, will test New Yorkers' appetite for second chances, and change.  —  Former Gov. Andrew M. Cuomo announced on Saturday that he would run … ",
    "url": "https://www.nytimes.com/2025/03/01/nyregion/andrew-cuomo-mayor-nyc.html"
  },
  {
    "text": "‘Let him stew in his own juice,’ Pelosi advises ahead of Trump's speech  —  The ex-speaker tore apart a copy of Trump's 2020 address to Congress.  This time, she says Democrats need to coalesce on one, short message.  —  Just now  —  Nancy Pelosi still recalls the precise nature … ",
    "url": "https://www.washingtonpost.com/politics/2025/03/01/nancy-pelosi-trump-democrats-congress/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQwODA1MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQyMTgzOTk5LCJpYXQiOjE3NDA4MDUyMDAsImp0aSI6ImM5OWVkYjczLTA4NDktNDA0ZC04MWIyLWMyNGJiOThlOWNjOCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzAzLzAxL25hbmN5LXBlbG9zaS10cnVtcC1kZW1vY3JhdHMtY29uZ3Jlc3MvIn0.t5BQWaEXcsaLymEU4HOsPwja0ju12zz8l-_6g7dqIeg&itid=gfta"
  },
  {
    "text": "Good Trouble: JD Vance Chastised by Vermont Snow Reporter  —  JD Vance, fresh off of helping his boss ambush & insult a foreign leader in the White House yesterday afternoon, is on vacation in Vermont with his family this weekend and will be skiing at Sugarbush Resort in Warren, VT, a 15-minute drive from where I live.",
    "url": "https://kottke.org/25/03/jd-vance-chastised-by-vermont-snow-reporter"
  },
  {
    "text": "Kennedy Jr backtracks and says US measles outbreak is now a ‘top priority’ for health department  —  Health secretary earlier said outbreak was ‘not unusual’ but with first US measles death in decade steps up response  —  Two days after initially downplaying the outbreak as “not unusual,” … ",
    "url": "https://www.theguardian.com/us-news/2025/mar/01/kennedy-jr-measles-outbreak-health-department"
  },
  {
    "text": "Medicare and Medicaid agency faces compromised functions and disruption from Trump's firings  —  A top CMS official retires and lambastes the way dismissals have been carried out  —  The federal agency that oversees Medicare, Medicaid, and other major health care programs is facing employee firings … ",
    "url": "https://www.statnews.com/2025/03/01/federal-employees-cms-layoffs-complicate-trump-promise-medicare-medicaid/"
  },
  {
    "text": "Wreckage, Rapists, and Resistance: Week Six of the Coup  —  They used to say war is how Americans learn geography.  This civil war as Team Trump lays waste to most federal institutions is how Americans are going to learn what their federal government did.  Specifically what it did for us … ",
    "url": "https://www.meditationsinanemergency.com/wreckage-a-rapists-and-resistance-week-six/"
  },
  {
    "text": "Formerly anti-vax parents on how they changed their minds: ‘I really made a mistake’  —  Researchers believe personal stories are more persuasive than facts alone in addressing vaccine skepticism  —  When Nikki Hill Johnson's first daughter was born in 2012, Johnson didn't hesitate … ",
    "url": "https://www.theguardian.com/global/2025/feb/27/how-anti-vax-parents-changed-their-minds"
  },
  {
    "text": "General Services Administration cuts tech unit  —  18F employed researchers, website designers and product managers.  —  The General Services Administration cleaved one of its technology units Saturday morning as part of a Trump administration directive to cull the federal workforce and reduce government spending.",
    "url": "https://www.politico.com/news/2025/03/01/general-services-administration-cuts-tech-unit-00206860"
  },
  {
    "text": "Some government employees are instructed — again — to not respond to 5 things email as Musk doubles down  —  Agencies and departments dealing with national security had told employees to not directly respond to Musk's first request.  —  The State Department has again instructed its employees … ",
    "url": "https://www.politico.com/news/2025/03/01/5-things-email-national-security-00002746"
  },
  {
    "text": "We tried to quantify the impact of abrupt PEPFAR cuts.  The results startled even us  —  These policy decisions put lives at risk  —  In May 2023, about a year before the President's Emergency Plan for AIDS Relief was up for congressional renewal, a  —  alleged that PEPFAR funding … ",
    "url": "https://www.statnews.com/2025/03/01/pepfar-usaid-funding-cuts-trump-hiv-aids/"
  },
  {
    "text": "Judge blocks Trump order threatening funding for institutions that offer care for transgender youth  —  President Donald Trump's plan to pull federal funding from institutions that provide gender-affirming care for transgender youth will remain blocked on a long-term basis under a federal judge's ruling in Seattle late Friday.",
    "url": "https://apnews.com/article/trump-transgender-gender-affirming-care-14ff427c42ac52e37305ae51fd5a66bb"
  }
]