[
  {
    "text": "Biden's Call With Hispanic Lawmakers Goes Off the Rails  —  The call ended abruptly after Rep. Mike Levin asked Biden to withdraw from the race.  Soon after, Levin formally called on Biden to step down as the nominee.  — Copy  —  As President Joe Biden tries to talk with Democratic lawmakers … ",
    "url": "https://www.notus.org/biden-2024/biden-call-hispanic-lawmakers-off-the-rails"
  },
  {
    "text": "Live Election Updates: Biden, Dealt a Blow by Donors, Heads to Michigan  —  President Biden is set to cap a tumultuous week by attacking his rival in a key battleground state.  But the fallout from his poor debate performance continued on Friday, with major donors said to have frozen roughly $90 million in pledges.",
    "url": "https://www.nytimes.com/live/2024/07/12/us/biden-trump-election"
  },
  {
    "text": "Another battlground Dem calls on Biden to withdraw  —  A 19th Hill Democrat is calling on President Joe Biden to withdraw from the ticket — one of California's most vulnerable Democrats.  “First, let me say that President Biden has been an outstanding leader, not only of our nation, but of the entire free world.",
    "url": "https://www.politico.com/live-updates/2024/07/12/congress/19th-dem-calls-on-biden-to-drop-out-00167847"
  },
  {
    "text": "After Biden's debate performance, the presidential race is unchanged  —  The race for the presidency remains statistically tied despite President Biden's dismal debate performance two weeks ago, a new national NPR/PBS NewsHour/Marist poll finds.  —  Biden actually gained a point since last month's survey … ",
    "url": "https://www.npr.org/2024/07/12/nx-s1-5036518/biden-trump-poll"
  },
  {
    "text": "Contest for President Still “Up for Grabs”  —  NPR/PBS News/Marist National Poll  —  Biden +2 Percentage Points Against Trump, Despite Concerns about Biden's Mental Fitness  —  With just days to go before the start of the Republican National Convention, President Joe Biden … ",
    "url": "https://maristpoll.marist.edu/polls/contest-for-president-still-up-for-grabs/"
  },
  {
    "text": "Scoop: Inside Biden's shrinking inner circle … - Democrats inside and outside the White House tell Axios they're worried that Biden isn't receiving a 360-degree view of his — and his party's — perilous political situation.  — In the two weeks since Biden's disastrous debate … ",
    "url": "https://www.axios.com/2024/07/12/biden-election-inner-circle-withdrawal-criticism"
  },
  {
    "text": "GOP Rep Delivers a House Floor Speech Straight Out of 'The Handmaid's Tale'  —  BLESSED BE THE FRUIT  —  In a speech before the House that seemed lifted right out of Margaret Atwood's dystopian classic, Rep. Glenn Grothman said he wants the U.S. to go back to 1960.",
    "url": "https://www.thedailybeast.com/rep-glenn-grothman-delivers-speech-straight-out-of-the-handmaids-tale"
  },
  {
    "text": "New York judge throws out Rudy Giuliani's bankruptcy case  —  The decision paves the way for two former Georgia election workers who won a defamation claim against him to pursue and potentially seize his assets.  —  A federal judge in New York on Friday threw out Rudy Giuliani's bankruptcy case … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/12/rudy-giuliani-bankruptcy/"
  },
  {
    "text": "Sunrise, powerful youth climate group, calls for Biden to drop out  —  Sunrise's Executive Director Aru Shiney-Ajay on Friday cited low enthusiasm for Biden among young people.  —  The influential youth green group Sunrise Movement is calling on President Joe Biden to drop his reelection bid to “protect” his climate legacy.",
    "url": "https://www.politico.com/news/2024/07/12/sunrise-youth-climate-biden-elections-00167851"
  },
  {
    "text": "July 11, 2024  —  Yesterday, Raw Story reported that Ivan Raiklin, Trump's self-declared “Secretary of Retribution” has compiled a “Deep State target list” of 350 people he wants to see arrested and punished for “treason” if Trump is reelected.  The list includes Democratic and Republican elected officials … ",
    "url": "https://heathercoxrichardson.substack.com/p/july-11-2024"
  },
  {
    "text": "‘It was horrifying’: Chutkan warns against complacency about Jan. 6  —  The judge in Trump's federal election subversion case used a Friday sentencing in a relatively routine Jan. 6 case to issue the warning.  —  The Jan. 6 attack on the Capitol is far from ancient history and still inflicts pain … ",
    "url": "https://www.politico.com/news/2024/07/12/judge-warns-complacency-jan-6-capitol-riot-sentencing-00167841"
  },
  {
    "text": "Remarks by President Biden in Press Conference  —  Washington, D.C.  —  7:27 P.M. EDT  —  THE PRESIDENT:  Hey, everybody.  Thank you.  Please be seated.  —  Well, good evening.  We just concluded this year's NATO Summit.  And the consensus among the members was it was a great success.",
    "url": "https://www.whitehouse.gov/briefing-room/speeches-remarks/2024/07/11/remarks-by-president-biden-in-press-conference-9/"
  },
  {
    "text": "Exclusive: Meta removes Trump account restrictions ahead of 2024 election … - While those penalties were designed to limit any public figure's accounts during civil unrest, Donald Trump's accounts were the only ones that have so far been subject to those restrictions, a spokesperson confirmed.",
    "url": "https://www.axios.com/2024/07/12/trump-meta-facebook-instagram-account-restrictions-election"
  },
  {
    "text": "The most important story about Trump's VP is why he needs a new one  —  Trump is replacing Mike Pence for behaving honorably on Jan. 6.  His substitute would not.  —  The most important story about Donald Trump's incipient pick for his vice presidential running mate is the reason he needs … ",
    "url": "https://www.mediamatters.org/donald-trump/most-important-story-about-trumps-vp-why-he-needs-new-one"
  },
  {
    "text": "AT&T says hackers stole records of nearly all cellular customers' calls and texts  —  The data contains records of calls and texts between approximately May 1 and Oct. 31, 2022, and on Jan. 2, 2023.  —  Hackers stole six months' worth of call and text message records of nearly every … ",
    "url": "https://www.nbcnews.com/news/us-news/t-says-hackers-stole-records-nearly-cell-customers-calls-texts-rcna161507"
  },
  {
    "text": "Sharply More Americans Want to Curb Immigration to U.S.  —  55% want immigration levels reduced, highest since 2001  —  WASHINGTON, D.C. — Significantly more U.S. adults than a year ago, 55% versus 41%, would like to see immigration to the U.S. decreased.",
    "url": "https://news.gallup.com/poll/647123/sharply-americans-curb-immigration.aspx"
  }
]