[
  {
    "text": "Judge in Alien Enemies Act case chides DOJ lawyer over refusal to answer key questions about deportations  —  The court fight focuses on the Trump administration's use of a 1798 law to deport people it claims are part of the Venezuelan gang Tren de Aragua.  —  WASHINGTON — A federal judge pressed … ",
    "url": "https://www.nbcnews.com/politics/trump-administration/judge-alien-enemies-act-case-chides-doj-lawyer-refusal-answer-key-ques-rcna196754"
  },
  {
    "text": "US Institute of Peace says DOGE has broken into its building  —  President Trump targeted the organization and a few others in a Feb. 19 executive order aiming to shrink the federal government  —  Employees of Elon Musk's Department of Government Efficiency entered the U.S. Institute … ",
    "url": "https://www.nbcwashington.com/news/president-trump-politics/us-institute-of-peace-doge-trump-administration/3869923/"
  },
  {
    "text": "Trump administration guts board of US Institute of Peace.  Group says DOGE arrives  —  The Trump administration fired most of the board of the U.S. Institute of Peace and sent its new leader into the Washington headquarters of the independent organization on Monday, in its latest effort … ",
    "url": "https://apnews.com/article/doge-trump-us-institute-of-peace-03362c3440884c6b29e28ad0d88f5014"
  },
  {
    "text": "Trump Administration Live Updates: Judge Plans to Press White House Over Deportation Flights  —  Where Things Stand  — Deportation flights: A federal judge is set to press Trump administration lawyers at a 5 p.m. hearing about whether the White House had violated a court order in deporting migrants with little to no due process.",
    "url": "https://www.nytimes.com/live/2025/03/17/us/trump-news?unlocked_article_code=1.4k4.lzKK.8mLbMK-3nPeL&smid=url-share"
  },
  {
    "text": "Leaked memo: DOGE plots to cut Social Security phone support  —  An internal memo from the Social Security Administration proposes changes to its phone service that could derail the benefits application process for many Americans.  —  Why it matters: The Trump administration has repeatedly … ",
    "url": "https://www.axios.com/2025/03/17/social-security-trump-doge"
  },
  {
    "text": "Exclusive: Navajo Code Talkers disappear from military websites after Trump DEI order  —  Articles about the renowned Native American Code Talkers have disappeared from some military websites, with several broken URLs now labeled “DEI.”  —  Why it matters: From 1942 to 1945 … ",
    "url": "https://www.axios.com/local/salt-lake-city/2025/03/17/navajo-code-talkers-trump-dei-military-websites-wwii"
  },
  {
    "text": "Amid ‘DEI’ purge, Pentagon removes webpage on Iwo Jima flag-raiser  —  Pages celebrating Navajo code talkers and other minority service members were also erased.  —  Jon Swaine is an investigative reporter on Signal at jonswaine.55.  Alex Horton is a national security reporter on Signal at alexhorton.85.",
    "url": "https://www.washingtonpost.com/investigations/2025/03/17/pentagon-dei-native-american-iwo-jima/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQyMTg0MDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQzNTY2Mzk5LCJpYXQiOjE3NDIxODQwMDAsImp0aSI6IjFkMTljZThmLTg5MmMtNDc4Ni1hNDgxLTAwZTI3Y2JkOTNkMSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9pbnZlc3RpZ2F0aW9ucy8yMDI1LzAzLzE3L3BlbnRhZ29uLWRlaS1uYXRpdmUtYW1lcmljYW4taXdvLWppbWEvIn0.Vl4_XrW7cle1xIII9cLwLdvk1HC6o_v-NX15bYKI6FI&itid=gfta"
  },
  {
    "text": "Elon Musk's Starlink Expands Across White House Complex  —  Trump administration officials said the company donated the internet service, saying the gift had been vetted by the lawyer overseeing ethics issues in the White House Counsel's Office.  —  Starlink, the satellite internet service operated … ",
    "url": "https://www.nytimes.com/2025/03/17/us/politics/elon-musk-starlink-white-house.html?unlocked_article_code=1.404.YQoK.rMD9xAA-77wW&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Trump to end Secret Service protection for Hunter and Ashley Biden  —  When President Joe Biden took office, he extended protections to Trump's adult children for six months.  —  President Donald Trump said Monday that he is terminating Secret Service protection for his predecessor's two adult children: Hunter and Ashley Biden.",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-end-secret-service-protection-hunter-ashley-biden-rcna196826"
  },
  {
    "text": "At Kennedy Center, Trump envisions remaking Honors, suggests he could host  —  Trump and his board suggested several artists for the awards, including Sylvester Stallone, Andrea Bocelli, Elvis Presley and Babe Ruth.  —  President Donald Trump visited the Kennedy Center on Monday … ",
    "url": "https://www.washingtonpost.com/entertainment/theater/2025/03/17/trump-kennedy-center-honors-board-meeting/"
  },
  {
    "text": "Trump Insists He Was Being “Sarcastic” About Major Campaign Promise  —  One month before the election, 70 percent of Americans felt that foreign affairs comprised either a “very important” or “extremely important” component of their vote.  But as it turns out, Donald Trump's repeat campaign promises … ",
    "url": "https://newrepublic.com/post/192824/donald-trump-ukraine-war-campaign-promise"
  },
  {
    "text": "Israel resumes war in Gaza with a series of massive airstrikes against Hamas  —  Israel resumed the war in Gaza with a series of massive airstrikes against what it described as Hamas targets all across the enclave overnight.  —  The big picture: The strikes come exactly two months … ",
    "url": "https://www.axios.com/2025/03/18/israel-gaza-war-resumes-airstrikes-hamas"
  },
  {
    "text": "EEOC Acting Chair Andrea Lucas Sends Letters to 20 Law Firms Requesting Information About DEI-Related Employment Practices  —  WASHINGTON - Today, U.S. Equal Employment Opportunity Commission (EEOC) Acting Chair Andrea Lucas sent letters to 20 law firms requesting information about their diversity … ",
    "url": "https://www.eeoc.gov/newsroom/eeoc-acting-chair-andrea-lucas-sends-letters-20-law-firms-requesting-information-about-dei"
  },
  {
    "text": "Give back the Statue of Liberty, French MEP tells US  —  French Socialist MEP says Washington's embrace of dictators negates the values that led France to bestow the iconic statue some 140 years ago.  —  She's been covered by a glacier, smashed up by various giant monsters … ",
    "url": "https://www.politico.eu/article/statue-of-liberty-france-nyc-mep-socialists-democrats-group/"
  },
  {
    "text": "Trump appoints Charlie Kirk, Walt Nauta, Michael Flynn to military boards  —  President Trump on Monday announced a slew of allies would be appointed to the Board of Visitors at the nation's military academies, including lawmakers and conservative media personalities.",
    "url": "https://thehill.com/policy/defense/5199551-trump-appoints-charlie-kirk-walt-nauta-michael-flynn-to-military-boards/"
  },
  {
    "text": "Texas Arrests Midwife and Associate on Charges of Providing Abortions  —  The two arrests in greater Houston appear to be the first time abortion providers have been charged with violating abortion bans in their state since Roe v. Wade was overturned in 2022.",
    "url": "https://www.nytimes.com/2025/03/17/us/politics/abortion-arrest.html"
  },
  {
    "text": "STAT+: NIH cancels funding for landmark diabetes study at a time of focus on chronic disease  —  The Trump administration has canceled funding for an ongoing 30-year, nationwide study tracking patients with prediabetes and diabetes, researchers said, at a time when top officials have emphasized … ",
    "url": "https://www.statnews.com/2025/03/17/trump-cuts-columbia-university-nih-cancels-diabetes-prevention-program-study/"
  },
  {
    "text": "Trump Administration Aims to Eliminate E.P.A.'s Scientific Research Arm  —  More than 1,000 chemists, biologists and other scientists could be laid off under a plan to dismantle the Office of Research and Development.  —  The Environmental Protection Agency plans to eliminate its scientific research arm … ",
    "url": "https://www.nytimes.com/2025/03/17/climate/trump-eliminates-epa-science.html"
  },
  {
    "text": "'Don't Tell Melania': Trump Once Offered Rising MAGA Star His Bed  —  The alleged comments cast new light on the president's eyebrow-raising marriage to Melania Trump.",
    "url": "https://www.thedailybeast.com/dont-tell-melania-trump-once-offered-rising-maga-star-his-bed/"
  },
  {
    "text": "GUEST POST: We Are Professors at Columbia.  Here is How We Would Respond.  —  Five Columbia University political scientists offer their unofficial response to the Trump administration's demands on their university.  —  Everything that has been posted on Drezner's World over the past … ",
    "url": "https://danieldrezner.substack.com/p/guest-post-we-are-professors-at-columbia"
  },
  {
    "text": "Silencing the Voice of America  —  Data from the Asia Power Index shows just how successful the Voice of America has been.  —  The Trump administration cares little for soft power.  The abrupt shuttering of the Voice of America and other US-funded media outlets including Radio Free Asia attest to this.",
    "url": "https://www.lowyinstitute.org/the-interpreter/silencing-voice-america"
  },
  {
    "text": "Trump Lays Groundwork for Investigating People Pardoned by Biden  —  President asserts in social-media post that Biden's pardons were ‘void, vacant, and of no further force of effect’  —  President Trump questioned the validity of pardons granted by President Joe Biden before he left office … ",
    "url": "https://www.wsj.com/politics/policy/trump-lays-groundwork-for-investigating-people-pardoned-by-biden-73ee33ad"
  },
  {
    "text": "Conor McGregor anti-immigration rant in White House condemned by Irish PM  —  Micheál Martin says MMA fighter's comments before Trump meeting 'do not reflect spirit of Saint Patrick's Day'  —  Ireland's prime minister has denounced anti-immigration comments made by Conor McGregor … ",
    "url": "https://www.theguardian.com/sport/2025/mar/17/conor-mcgregor-anti-immigration-rant-white-house-condemned-by-irish-pm"
  }
]