[
  {
    "text": "The Wrecking-Ball Caucus: How the Far Right Brought Washington to Its Knees  —  Right-wing Republicans who represent a minority in their party and in Congress have succeeded in sowing mass dysfunction, spoiling for a shutdown, an impeachment and a House coup.",
    "url": "https://www.nytimes.com/2023/09/23/us/republicans-congress-freedom-caucus.html"
  },
  {
    "text": "McCarthy stares into the shutdown abyss  —  The speaker has only one clear exit route away from a government closure: working with Democrats.  It's a path he still refuses to take.  —  Speaker Kevin McCarthy has only one way out of next week's impending government shutdown: working with Democrats.",
    "url": "https://www.politico.com/news/2023/09/23/mccarthy-stares-into-shutdown-abyss-00117658"
  },
  {
    "text": "Clarence Thomas' Latest Pay-to-Play Scandal Finally Connects All the Dots  —  ProPublica released a new report on Friday detailing Justice Clarence Thomas' close relationship with the Koch brothers with previously undisclosed and extraordinarily damning new details.",
    "url": "https://slate.com/news-and-politics/2023/09/clarence-thomas-chevron-ethics-kochs.html"
  },
  {
    "text": "Clarence Thomas' Koch Party Is Latest Shocking Ethics Breach  —  Thomas should be forced to recuse himself from hearing cases brought by groups that he helps fundraise for and who fly him on private jets. … Justice Clarence Thomas once championed the Supreme Court line of precedent giving deference … ",
    "url": "https://www.thedailybeast.com/clarence-thomas-koch-party-is-latest-shocking-ethics-breach-shan-wu-writes"
  },
  {
    "text": "McCarthy backtracks, says he will keep Ukraine aid in Pentagon funding bill  —  Speaker Kevin McCarthy (R-Calif.) on Saturday said he will keep Ukraine aid in the Pentagon funding bill, a reversal from his announcement one day earlier that he would strip the money out due to opposition from Rep. Marjorie Taylor Greene (R-Ga.).",
    "url": "https://thehill.com/homenews/house/4220034-mccarthy-backtracks-says-he-will-keep-ukraine-aid-in-pentagon-funding-bill/"
  },
  {
    "text": "McCarthy reverses on Ukraine aid as GOP scrambles on funding bills  —  The backtrack comes as Republicans try to shore up votes to move forward after two setbacks.  —  Speaker Kevin McCarthy is backtracking on his plan to remove Ukraine aid from a massive military spending bill … ",
    "url": "https://www.politico.com/news/2023/09/23/mccarthy-ukraine-aid-00117801"
  },
  {
    "text": "Was McCarthy distracted from governing by impeachment inquiry?  —  House Republicans pledge a slow, methodical pace on the Biden impeachment inquiry, but some rank-and-file believe that their leaders have missed the target on priorities  —  Congressional bureau chief",
    "url": "https://www.washingtonpost.com/politics/2023/09/23/house-impeachment-shutdown/"
  },
  {
    "text": "Misinformation research is buckling under GOP legal attacks  —  An escalating campaign, led by Rep. Jim Jordan (R-Ohio) and other Republicans, has cast a pall over programs that study political disinformation and the quality of medical information online  —  Academics, universities … ",
    "url": "https://www.washingtonpost.com/technology/2023/09/23/online-misinformation-jim-jordan/"
  },
  {
    "text": "Fetterman calls for Menendez to resign  —  Menendez was indicted for accepting bribes Friday.  —  Sen. John Fetterman (D-Penn.) called for Sen. Bob Menendez (D-N.J.) to resign from the Senate on Saturday, making him the first Democratic senator to call for his resignation.",
    "url": "https://www.politico.com/news/2023/09/23/fetterman-menendez-resign-00117800"
  },
  {
    "text": "New Jersey rep. announces challenge to unseat Menendez following indictment  —  Rep. Andy Kim (D-N.J.) announced Saturday that he will primary Sen. Bob Menendez (D-N.J.) after the senator was indicted on corruption charges Friday.  —  “After calls to resign, Senator Menendez said 'I am … ",
    "url": "https://thehill.com/homenews/campaign/4220083-new-jersey-rep-suggests-he-may-run-to-unseat-menendez-following-indictment/"
  },
  {
    "text": "US mother sentenced to two years in prison for giving daughter abortion pills  —  Jessica Burgess pleaded guilty in July to providing an abortion after 20 weeks and tampering with human remains  —  Jessica Burgess, a Nebraska mother accused of helping her teenage daughter use pills to end her pregnancy … ",
    "url": "https://www.theguardian.com/us-news/2023/sep/22/burgess-abortion-pill-nebraska-mother-daughter"
  },
  {
    "text": "U.S. Provided Canada With Intelligence on Killing of Sikh Leader  —  American intelligence gave assistance, but communications intercepted by Canada were more definitive in linking India to the killing of Hardeep Singh Nijjar.  —  American spy agencies provided information to Ottawa … ",
    "url": "https://www.nytimes.com/2023/09/23/us/politics/canada-sikh-leader-killing-intelligence.html"
  },
  {
    "text": "Cassidy Hutchinson Reappears.  She Has More Trump Stories to Tell.  —  “I would like not to be a hermit,” the former White House aide says upon the publication of a memoir about her journey down a political rabbit hole.  —  Cassidy Hutchinson dropped out of sight last year after she testified … ",
    "url": "https://www.nytimes.com/2023/09/23/us/politics/cassidy-hutchinson-trump.html"
  },
  {
    "text": "Richard Branson to climate change deniers: 'it's a fact of life'  —  While in New York for the United Nations General Assembly, Virgin Group founder Richard Branson shared details of his next endeavor: combating climate change.  —  The billionaire British businessman announced Monday … ",
    "url": "https://thehill.com/policy/energy-environment/4220087-richard-branson-on-climate-change-deniers/"
  },
  {
    "text": "Joe Biden Is About to Go Where No President Has Gone Before  —  A picket line.  —  On September 15, the United Auto Workers began a targeted strike against Ford, GM, and Stellantis (the conglomerate that includes Chrysler) in an effort to secure higher wages, a four-day work week, and other protections in the union's next contract.",
    "url": "https://www.motherjones.com/politics/2023/09/joe-biden-is-about-to-go-where-no-president-has-gone-before/"
  },
  {
    "text": "Robert F. Kennedy Jr. Flirts With the Libertarian Party  —  Mr. Kennedy sat down with the party's chair in July, a previously undisclosed meeting, as Democrats fret about a third party bid.  —  For months, Robert F. Kennedy Jr. has said he plans to continue his long-shot challenge … ",
    "url": "https://www.nytimes.com/2023/09/23/us/politics/robert-f-kennedy-jr-libertarian-party.html"
  }
]