[
  {
    "text": "A Plaintive Cry For Election Reforms Before It's Too Late  —  A lot of things happened.  Here are some of the things.  This is TPM's Morning Memo.  Sign up for the email version.  —  It Doesn't Have To Be This Way  —  As voting wraps up across the country today, let me take a quick step … ",
    "url": "https://talkingpointsmemo.com/morning-memo/election-reforms-campaign-finance-dark-money-oligarchy"
  },
  {
    "text": "A random number generator determined the “favorite” in our forecast  —  So fine: let's go to the tiebreaker round.  —  ∙ Paid  —  When I say the odds in this year's presidential race are about as close as you can possibly get to 50/50, I'm not exaggerating.",
    "url": "https://www.natesilver.net/p/a-random-number-generator-determined"
  },
  {
    "text": "Harris and Trump tie in Dixville Notch midnight vote to kick off Election Day  —  Vice President Kamala Harris and former President Donald Trump have tied with three votes each in the tiny New Hampshire township of Dixville Notch, kicking off Election Day in one of the first places in the country to report its presidential preference.",
    "url": "https://www.cnn.com/2024/11/05/politics/dixville-notch-new-hampshire-2024-results/"
  },
  {
    "text": "How Trump used the ‘red mirage’ in vote counting to deny his 2020 loss  —  Procedures in some states can create a false impression that Republicans are winning since the last ballots to be counted tend to lean Democratic.  —  Shortly after Election Day came and went in 2020 with no presidential decision … ",
    "url": "https://www.washingtonpost.com/politics/2024/11/05/election-2020-red-mirage-trump/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzMwNzgyODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzMyMTY1MTk5LCJpYXQiOjE3MzA3ODI4MDAsImp0aSI6IjliOWU3YWEyLWUxYjEtNDI5Mi05OTdjLTY0MjhmM2M2YjgyMyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzExLzA1L2VsZWN0aW9uLTIwMjAtcmVkLW1pcmFnZS10cnVtcC8ifQ.6QFcrX6YvLuDSD86Ff_Llg9ClnMg6kmUM4g9_GMj4s4&itid=gfta"
  },
  {
    "text": "Trump and allies have primed supporters to falsely believe he has no chance of losing  —  It's possible former President Donald Trump wins the election - and also quite possible he loses.  But many in Trump's orbit keep falsely telling his supporters the only way that happens is because of cheating.",
    "url": "https://www.npr.org/2024/11/05/nx-s1-5179073/trump-and-allies-have-primed-supporters-to-falsely-believe-he-has-no-chance-of-losing"
  },
  {
    "text": "MAGA outrage over wives voting for Kamala Harris is funny — but it's also dangerous  —  When it comes to political bait, it was the tastiest sort: a cheeky ad run by Vote Common Good, and voiced by Julia Roberts, reminding women that they don't have to tell their husbands if they vote for Vice President Kamala Harris.",
    "url": "https://www.salon.com/2024/11/05/bracing-for-magas-backlash-the-strategy-behind-secret-kamala-harris-is-safety/"
  },
  {
    "text": "What to watch — and what to avoid — on election night  —  It's not about where to watch.  It's about how to watch.  —  Well, we made it.  It's Election Day.  —  Today could go down as one of the most important days in the history of our country as the nation decides between Vice President Kamala Harris … ",
    "url": "https://www.poynter.org/commentary/2024/what-to-watch-what-to-avoid-election-night/"
  },
  {
    "text": "X's plan to interfere with the election  —  With polls essentially tied and hours to go until Election Day, no one knows for certain who will win the 2024 US presidential election.  But we can say with some certainty what will happen if the result is anything other than a landslide victory for Donald Trump … ",
    "url": "https://www.platformer.news/x-election-elon-musk-voter-fraud-misinformation/"
  },
  {
    "text": "The MAGA Propaganda Machine Has Successfully Censored Voices Calling Out its Lies  —  In 2020, the U.S. found itself in the midst of an unprecedented election—one defined not only by candidates or policies, but by a fight over what was real.  During that election, I was one of the leaders … ",
    "url": "https://www.theunpopulist.net/p/the-maga-propaganda-machine-has-successfully"
  },
  {
    "text": "Nicolle Wallace on Vance calling Harris ‘trash:’ ‘You just effed up’  —  MSNBC's Nicolle Wallace said Monday that Ohio Sen. JD Vance, the Republican vice presidential nominee, “effed up” by calling Vice President Harris “trash.”  —  “In my humble view, lights out,” Wallace said on “Deadline: White House.”",
    "url": "https://thehill.com/homenews/campaign/4972454-nicolle-wallace-on-vance-calling-harris-trash-you-just-effed-up/"
  },
  {
    "text": "White supremacist planned to blow up Nashville power station with explosives-laden drone, Justice Department says  —  A Tennessee man with ties to white nationalist groups has been arrested after federal prosecutors say he tried to use what he thought was a drone packed with explosives … ",
    "url": "https://www.cbsnews.com/news/white-supremacist-power-grid-attack-skyler-philippi-justice-department/"
  },
  {
    "text": "Republican mega-donors asked their employees who they will vote for in survey  —  Staunchly pro-Trump Uihleins gave anonymous survey to workers at Uline, headquartered in swing state of Wisconsin  —  The Republican mega-donors Dick and Liz Uihlein, who are the third largest donors … ",
    "url": "https://www.theguardian.com/us-news/2024/nov/04/election-republican-uline-survey"
  },
  {
    "text": "Judges deny requests to block DOJ from monitoring polls  —  Federal judges denied two states' requests to bar the Justice Department (DOJ) from dispatching lawyers to monitor adherence to federal voting rights laws on Election Day.  —  Both Missouri and Texas asked federal courts to keep DOJ lawyers away from their polls.",
    "url": "https://thehill.com/regulation/court-battles/4972091-judge-wont-block-doj-election-poll-monitors/"
  },
  {
    "text": "José Andrés threatens to challenge Maryland Republican in Congress  —  Celebrity chef José Andrés could trade the kitchen for Congress if he follows through on a threat to challenge a Maryland Republican, saying the state “deserves better.”",
    "url": "https://thehill.com/blogs/in-the-know/4972233-jose-andres-maryland-republican-andy-harris/"
  },
  {
    "text": "You Can Trust the Vote Count  —  Mistakes happen, but many of the stories you've heard turn out to be untrue.  —  As Republican chief election officials, we care deeply about the integrity of our elections.  It should be easy to vote and hard to cheat.  —  Americans heading to the polls should know their vote will count.",
    "url": "https://www.wsj.com/opinion/you-can-trust-the-vote-count-election-2024-georgia-utah-republican-officials-1d5130bb"
  },
  {
    "text": "Bernard Marcus, cofounder of The Home Depot and billionaire Republican megadonor, has died  —  New York CNN  —  Bernard “Bernie” Marcus, the billionaire Home Depot cofounder and a Republican megadonor, who in recent years became an outspoken supporter of former President Donald Trump, has died, the company announced Tuesday.",
    "url": "https://www.cnn.com/2024/11/05/business/home-depot-bernie-marcus-death"
  },
  {
    "text": "Joint ODNI, FBI, and CISA Statement  —  Today, the Office of the Director of National Intelligence (ODNI), the Federal Bureau of Investigation (FBI), and the Cybersecurity and Infrastructure Security Agency (CISA) released the following statement:  —  Since our statement on Friday … ",
    "url": "https://www.fbi.gov/news/press-releases/joint-odni-fbi-and-cisa-statement-110424"
  },
  {
    "text": "Americans Who Want Out  —  Every four years, some liberal Americans threaten to leave the country if a Republican wins the presidency.  Canada has become almost a joke—or maybe a fantasy—in certain left-leaning circles, not just a country but an escape hatch, a next life waiting if the election goes the “wrong” way.",
    "url": "https://www.theatlantic.com/politics/archive/2024/11/americans-who-want-leave-country-election/680486/"
  },
  {
    "text": "Trump Announces Dumbest Person You Know Will Lead Missile Defense … Herschel Walker is back and ready to lead our country's missile defense system.  —  That is not some cruel joke, but a very real thing Donald Trump proposed at his Georgia rally on Sunday—minutes after Walker confused … ",
    "url": "https://newrepublic.com/post/187873/trump-dumbest-person-missile-defense-herschel-walker"
  },
  {
    "text": "A Trump Field Director Was Fired for Being a White Nationalist  —  A white nationalist worked on the Trump campaign in an important position in Pennsylvania for five months — until Friday, when the Pennsylvania GOP fired him after learning about his views from my reporting.",
    "url": "https://www.politico.com/news/magazine/2024/11/04/white-nationalist-trump-campaign-00187282"
  },
  {
    "text": "What ProPublica Reporters Will Be Watching on Election Day  —  Reporters from ProPublica will be on the ground watching stories they've covered unfold as voters head to the polls.  Among the issues: abortion, extremism, poll workers and election administration in battleground states.",
    "url": "https://www.propublica.org/article/election-day-2024-propublica-reporters"
  },
  {
    "text": "‘I went to a Trump rally — the curtains are closing on his circus’  —  It might not feel like it, but it is a recent phenomenon that American elections are judged by the size of rallies and crowd-drawing power.  —  This spectacle, pioneered by Donald Trump, has become synonymous with his brand.",
    "url": "https://metro.co.uk/2024/11/04/i-went-a-trump-rally-curtains-closing-circus-21926419/"
  }
]