[
  {
    "text": "From a Capitol Hill Basement, Bannon Stokes the Republican Party Meltdown  —  The former Trump adviser has helped create the spectacle of G.O.P. dysfunction, using it to build his own following and those of the right-wing House rebels who took down Kevin McCarthy.",
    "url": "https://www.nytimes.com/2023/10/04/us/politics/bannon-republicans-gaetz-mace.html"
  },
  {
    "text": "There Are Tapes: GOP Rep. Has Recording of Kevin McCarthy ‘Belittling’ Him  —  LORDY  —  Rep. Tim Burchett (R-TN) told CNN on Wednesday morning that he recorded his Monday night call with Kevin McCarthy that featured the since-ousted Speaker of the House “belittling” the Tennessee lawmaker.",
    "url": "https://www.thedailybeast.com/gop-rep-tim-burchett-has-recording-of-kevin-mccarthy-belittling-him"
  },
  {
    "text": "Hours After Gag Order, Trump Launches Fresh Vitriol Against New York Judge  —  Donald Trump on Wednesday launched fresh vitriol against the judge and prosecuting attorney in his New York business fraud trial, carefully skirting a gag order imposed on him just a day prior.",
    "url": "https://newrepublic.com/post/175971/trump-gag-order-attack-new-york-judge-attorney-general"
  },
  {
    "text": "Florida Rep. Frederica Wilson calls out John Kelly: 'He knew Mr. Trump's record'  —  She's considering suing him for defamation.  —  Rep. Frederica Wilson has many things to say about former White House chief of staff John Kelly.  None are very nice.  —  “Mr. Kelly is an idiot,” she said in an interview Wednesday.",
    "url": "https://www.politico.com/news/2023/10/04/florida-frederica-wilson-john-kelly-trump-00120029"
  },
  {
    "text": "What Can Patrick McHenry, the Interim Speaker, Do?  —  Representative Patrick T. McHenry of North Carolina, who took the gavel, may oversee the election of a new speaker.  But he does not have the power to run the chamber.  —  Moments after the House voted to boot Representative Kevin McCarthy … ",
    "url": "https://www.nytimes.com/2023/10/04/us/politics/patrick-mchenry-interim-speaker.html"
  },
  {
    "text": "EXCLUSIVE: President Joe Biden's German Shepherd Commander is seen biting White House staffer, days before it bit Secret Service agent, in new photos  — Previously unseen photos obtained by DailyMail.com show  Commander biting White House grounds superintendent Dale Haney, on September 13",
    "url": "https://www.dailymail.co.uk/news/article-12589937/Joe-Bidens-dog-Commander-bites-staffer-Dale-Haney.html"
  },
  {
    "text": "Officiant fires gun to welcome bride, shoots grandson — and wedding goes on  —  Michael Gardner wanted to start his nephew's wedding with a bang.  —  His plan involved shooting a blank from a revolver into the air to signal to the roughly 200 people gathered on Saturday that the outdoor ceremony … ",
    "url": "https://www.washingtonpost.com/nation/2023/10/04/wedding-officiant-shoots-grandson-michael-gardner-nebraska/"
  },
  {
    "text": "Inside the Menendez Indictment: A Mercedes and a Secretive Fatal Crash  —  A 2018 fatal car crash in Bogota, N.J., drew no media attention and resulted in no charges.  The driver was the soon-to-be wife of Senator Robert Menendez.  —  It was a cold evening in December 2018, and Nadine Arslanian … ",
    "url": "https://www.nytimes.com/2023/10/04/nyregion/nadine-menendez-mercedes-death.html"
  },
  {
    "text": "Trump Announces $45.5 Million Fund-Raising Haul, Tripling DeSantis  —  The Trump campaign's total, which cannot be independently verified until later this month, was built in part by an outpouring of money after his mug shot in Georgia was released.  —  Donald J. Trump's campaign announced … ",
    "url": "https://www.nytimes.com/2023/10/04/us/politics/trump-campaign-fund-raising-desantis.html"
  },
  {
    "text": "Imagine If Democrats Had Done It  —  The Republican party is sustained by two fundamental asymmetries.  And there's no cure for either of them.  —  ∙ Paid  —  We did an emergency live show last night about the McCarthy ouster.  You can find it here.  (There won't be a Thursday night show this week.)",
    "url": "https://thetriad.thebulwark.com/p/imagine-if-democrats-had-done-it"
  },
  {
    "text": "20 GOP senators led by Rick Scott vow to block bills not related to funding government  —  Facing a pileup of spending bills and a possible government shutdown, 20 Republican senators led by Sen. Rick Scott (Fla.) say they will delay any legislation moving on the Senate floor that does not relate directly to funding the government.",
    "url": "https://thehill.com/homenews/senate/4238926-20-gop-senators-led-by-rick-scott-vow-to-block-bills-not-related-to-funding-government/"
  },
  {
    "text": "GOP candidate says he smeared ‘fecal matter’ on daycare center because of Obama: report  —  A Republican candidate for New Jersey Assembly has admitted to being convicted in a criminal incident where he smeared “fecal matter” on the door of a daycare facility he was feuding with in 2009 … ",
    "url": "https://www.rawstory.com/gop-2665797669/"
  },
  {
    "text": "‘The Drew Barrymore Show’ Writers Decline to Return (Exclusive)  —  The daytime talk show is coming back Oct. 16, but the show's three WGA writers — Chelsea White, Cristina Kinon and Liz Koe — have turned down an offer to return with it.  —  The Drew Barrymore Show is once again readying its return … ",
    "url": "https://www.hollywoodreporter.com/tv/tv-news/drew-barrymore-show-writers-decline-return-1235606269/"
  },
  {
    "text": "Colorado high court to hear case against Christian baker who refused to make trans-themed cake  —  The baker previously won a case before the U.S. Supreme Court on a technicality in 2018, after refusing to make a gay couple's wedding cake.  —  On the heels of a U.S. Supreme Court victory … ",
    "url": "https://www.nbcnews.com/nbc-out/out-politics-and-policy/colorado-high-court-hear-case-christian-baker-refused-make-trans-theme-rcna118815"
  },
  {
    "text": "‘Fixin’ to ride the lightning': Soldier who was handcuffed, hit, pepper-sprayed during traffic stop appeals case after jury mostly sides with police  —  A U.S. Army soldier who sued police after being pepper-sprayed, beaten and threatened with firearms during a traffic stop in a rural southern Virginia town … ",
    "url": "https://lawandcrime.com/civil-rights/fixin-to-ride-the-lightning-soldier-who-was-handcuffed-hit-pepper-sprayed-during-traffic-stop-appeals-case-after-jury-mostly-sides-with-police/"
  },
  {
    "text": "Russia Withdraws Black Sea Fleet Vessels From Crimea Base After Ukrainian Attacks  —  Pullout represents painful setback for the Kremlin, which seized Crimea in 2014  —  Russia has withdrawn the bulk of its Black Sea Fleet from its main base in occupied Crimea, a potent acknowledgment … ",
    "url": "https://www.wsj.com/world/russia-withdraws-black-sea-fleet-vessels-from-crimea-base-after-ukrainian-attacks-51d6d4f5?mod=followamazon"
  },
  {
    "text": "Biden cancels $9 billion in student debt for 125,000 borrowers  — President Joe Biden announced Wednesday that he approved $9 billion in student loan forgiveness for 125,000 Americans.  — The relief is a result of his administration's fixes to number of programs … ",
    "url": "https://www.cnbc.com/2023/10/04/biden-cancels-9-billion-in-student-debt-for-125000-borrowers-.html"
  },
  {
    "text": "Biden administration waives 26 federal laws to allow border wall construction in South Texas  —  It marks the administration's first use of a sweeping executive power employed often during the Trump presidency.  —  McALLEN, Texas — The Biden administration announced on Wednesday … ",
    "url": "https://www.politico.com/news/2023/10/04/biden-administration-waives-26-federal-laws-to-allow-border-wall-construction-in-south-texas-00120045"
  },
  {
    "text": "Exclusive: Donald Trump Followers Targeted by FBI as 2024 Election Nears  —  The federal government believes that the threat of violence and major civil disturbances around the 2024 U.S. presidential election is so great that it has quietly created a new category of extremists that it seeks … ",
    "url": "https://www.newsweek.com/2023/10/13/exclusive-fbi-targets-trump-followers-2024-election-nears-1831836.html"
  },
  {
    "text": "Giuliani: ‘I have never had an alcohol problem’  —  Former Trump lawyer Rudy Giuliani vehemently denied having a drinking problem Wednesday, following the Times report.  —  Former Trump lawyer and adviser Rudy Giuliani vehemently denied having a drinking problem Wednesday … ",
    "url": "https://www.politico.com/news/2023/10/04/rudy-giuliani-drinking-00119923"
  }
]