[
  {
    "text": "Trump's co-defendants are already starting to turn against him  —  There's a nascent courtroom strategy by some people close to Donald Trump: Heap blame on the former president.  —  The finger-pointing among Donald Trump's inner circle has begun.  —  And as his four criminal cases march toward trials … ",
    "url": "https://www.politico.com/news/2023/09/05/trump-cases-defendants-flipping-00113910"
  },
  {
    "text": "The 14th Amendment Trump Panic  —  Banning Trump from the ballot under Section 3 of the post-Civil War constitutional amendment would harm U.S. law and democracy.  —  You'd think Donald Trump's opponents would learn.  When they fight the former President in the voting booth … ",
    "url": "https://www.wsj.com/articles/the-14th-amendment-donald-trump-panic-election-ballot-constitution-amendment-candidate-president-fb3d65?mod=followamazon"
  },
  {
    "text": "BREAKING: More than 60 Atlanta training center activists named in RICO Indictment  —  The Georgia Attorney General's Office is prosecuting the case  —  X  —  More than five dozen activists were indicted on RICO charges last week over the ongoing efforts to halt construction of the city … ",
    "url": "https://www.ajc.com/news/crime/breaking-more-than-60-training-center-activists-named-in-rico-indictment/DQ6B6GHTAJAJRH4SLGIIBAMXR4/"
  },
  {
    "text": "Appeals court limits special counsel's effort to access Rep. Scott Perry's phone  —  Investigators have long been fighting to obtain records from Perry, who aided Donald Trump's effort to remain in power after the 2020 election.  —  A federal appeals court panel has partially blocked efforts … ",
    "url": "https://www.politico.com/news/2023/09/05/scott-perry-phone-court-ruling-00114005"
  },
  {
    "text": "Former Proud Boys leader Enrique Tarrio sentenced to 22 years for role in Jan. 6 attack  —  “I will have to live with that shame ... for the rest of my life,” Tarrio said.  —  A federal judge on Tuesday sentenced former Proud Boys leader Enrique Tarrio to 22 years in prison … ",
    "url": "https://abcnews.go.com/Politics/former-proud-boys-chairman-enrique-tarrio-convicted-seditious/story?id=102929276"
  },
  {
    "text": "George Santos Insists He Is Not Working On A Plea Deal  —  The U.S. attorney prosecuting the case against freshman Rep. George Santos (R-N.Y.) has indicated they are involved in discussions on how to resolve the case.  However, in a series of texts to TPM, Santos insisted those talks … ",
    "url": "https://talkingpointsmemo.com/news/george-santos-insists-he-is-not-working-on-a-plea-deal"
  },
  {
    "text": "George Santos and aide appear to be discussing plea deals with feds  —  Santos has been charged with wire fraud, money laundering and theft of public funds.  —  NEW YORK — Rep. George Santos and his former campaign aide, both indicted by federal prosecutors, appear to be in plea talks with the government … ",
    "url": "https://www.politico.com/news/2023/09/05/george-santos-indictment-plea-deal-00114038"
  },
  {
    "text": "Consistent Signs of Erosion in Black and Hispanic Support for Biden  —  It's a weakness that could manifest itself as low Democratic turnout even if Trump and Republicans don't gain among those groups.  —  President Biden is underperforming among nonwhite voters in New York Times/Siena College national polls … ",
    "url": "https://www.nytimes.com/2023/09/05/upshot/biden-trump-black-hispanic-voters.html"
  },
  {
    "text": "Sen. Sheldon Whitehouse files ethics complaint over Justice Samuel Alito interview  —  The Rhode Island Democrat asked Chief Justice John Roberts to investigate comments made by Alito in a Wall Street Journal interview.  —  WASHINGTON — Democratic Sen. Sheldon Whitehouse is demanding … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/sen-sheldon-whitehouse-files-ethics-complaint-justice-samuel-alito-int-rcna103394"
  },
  {
    "text": "A Huge Threat to the U.S. Budget Has Receded.  And No One Is Sure Why.  —  For decades, runaway Medicare spending was the story of the federal budget.  —  Now, flat Medicare spending might be a bigger one.  —  Something strange has been happening in this giant federal program.",
    "url": "https://www.nytimes.com/interactive/2023/09/05/upshot/medicare-budget-threat-receded.html"
  },
  {
    "text": "New York AG asks judge to sanction Trump for rehashing failed legal arguments  — New York Attorney General Letitia James asked a judge Tuesday to sanction Donald Trump, other defendants, and their lawyers for rehashing the same legal arguments in James' big civil fraud lawsuit against the former president.",
    "url": "https://www.cnbc.com/2023/09/05/new-york-ag-asks-judge-to-sanction-trump-for-rehashing-failed-legal-arguments.html"
  },
  {
    "text": "Alabama's congressional map is struck down again for diluting Black voters' power  —  A panel of three federal judges has struck down Alabama's latest map of congressional election districts for not following a court order to comply with the landmark Voting Rights Act.",
    "url": "https://www.npr.org/2023/09/05/1193749552/alabama-congressional-map"
  },
  {
    "text": "Man Cleared of Rape Conviction 48 Years Later Thanks to DNA  —  Leonard Mack fell victim to racial bias and discarded evidence, but said he never lost hope  —  A Facebook icon representing an external link to share the article on Facebook.A Twitter icon representing an external link to share … ",
    "url": "https://themessenger.com/news/man-cleared-of-rape-conviction-48-years-later-thanks-to-dna"
  },
  {
    "text": "Gaetz advocates forcing impeachment votes in warning to McCarthy  —  Rep. Matt Gaetz (R-Fla.) on Tuesday forecast upcoming moves to force House votes on impeachment, while sending a warning shot to Speaker Kevin McCarthy (R-Calif.).  —  The firebrand Republican's remarks come as McCarthy … ",
    "url": "https://thehill.com/homenews/house/4188271-gaetz-advocates-forcing-impeachment-votes-in-warning-to-mccarthy/"
  },
  {
    "text": "United Airlines requests nationwide ground stop, FAA says  —  The exact cause for grounding its fleet is unknown, but could be because of technological problems, according to authorities.  —  United Airlines has requested grounding its fleet nationwide, according to the Federal Aviation Administration.",
    "url": "https://www.nbcnews.com/news/us-news/united-airlines-requests-nationwide-ground-stop-faa-says-rcna103470"
  },
  {
    "text": "CNN Poll: GOP voters' broad support for Trump holds, with less than half seriously worried criminal charges will harm his 2024 chances  —  Former President Donald Trump continues to hold what has proven to be an unshakeable position atop the Republican field of candidates vying … ",
    "url": "https://www.cnn.com/2023/09/05/politics/cnn-poll-trump-primary-criminal-charges/"
  },
  {
    "text": "Judge Chutkan is The Boss  —  Trump's Day of Judgment in a D.C. court is coming, and a Black female jurist will be critical to his fate.  —  John Lauro was in a predicament last week that bodes well for the survival of the Republic.  Lauro is Donald Trump's lead attorney in the most important trial … ",
    "url": "https://washingtonmonthly.com/2023/09/05/judge-chutkan-is-the-boss/"
  },
  {
    "text": "Capitol Hill doctor: McConnell did not have a stroke or seizure when freezing before cameras  —  The Capitol's attending physician, Brian Monahan, said in a new letter that Senate GOP Leader Mitch McConnell did not suffer a stroke or seizure - and is not suffering from Parkinson's disease … ",
    "url": "https://www.cnn.com/2023/09/05/politics/mitch-mcconnell-health-latest/"
  },
  {
    "text": "Why Hunter Biden might not be the slam dunk issue GOP commentators hoped  —  The controversy surrounding Hunter Biden is falling flat in the GOP primary.  —  Aides to President Joe Biden had braced for the Republican candidates to pile on the Hunter Biden attacks during the first primary debate.",
    "url": "https://www.politico.com/news/2023/09/05/hunter-biden-gop-primary-00113820"
  },
  {
    "text": "Americans Are Losing Faith in the Value of College.  Whose Fault Is That?  —  For most people, the new economics of higher ed make going to college a risky bet.  —  A decade or so ago, Americans were feeling pretty positive about higher education.  Public-opinion polls in the early 2010s all told the same story.",
    "url": "https://www.nytimes.com/2023/09/05/magazine/college-worth-price.html"
  },
  {
    "text": "Republicans hired way more ex-lobbyists as congressional staffers in the last year than Democrats, analysis finds  — In Washington, people often move between jobs as Capitol Hill staffers and as lobbyists.  — Per a new analysis, Republicans have hired way more former lobbyists than Democrats in the last year.",
    "url": "https://www.businessinsider.com/republicans-hire-more-lobbyists-than-democrats-last-year-legistorm-2023-9?op=1"
  },
  {
    "text": "US says 52 mln air bag inflators should be recalled over rupture threat  —  U.S. auto safety regulators said Tuesday that 52 million air bag inflators produced by auto suppliers ARC Automotive and Delphi Automotive need to be recalled because they may rupture and send dangerous metal fragments flying.",
    "url": "https://www.reuters.com/business/autos-transportation/us-says-52-million-air-bag-inflators-are-unsafe-should-be-recalled-2023-09-05/"
  },
  {
    "text": "Comer Subpoenas Mayorkas, DHS & Secret Service Employees After Obstructing Investigation into Politicized Hunter Biden Criminal Investigation  —  WASHINGTON—House Committee on Oversight and Accountability Chairman James Comer (R-Ky.) today issued six subpoenas to the Department of Homeland Security … ",
    "url": "https://oversight.house.gov/release/comer-subpoenas-mayorkas-dhs-secret-service-employees-after-obstructing-investigation-into-politicized-hunter-biden-criminal-investigation/"
  },
  {
    "text": "Would Trump pardon the Proud Boys?  —  The first time that Donald Trump said the words “Proud Boys” out loud — at least in public — came during the first presidential debate of the 2020 election cycle.  —  That was the moment in which moderator Chris Wallace challenged Trump to … ",
    "url": "https://www.washingtonpost.com/politics/2023/09/05/would-trump-pardon-proud-boys/"
  },
  {
    "text": "House Majority Forward Announces $20 Million Voter Registration and Grassroots Mobilization Campaign  —  Initial Investment Includes Outreach to Black, Latino, AAPI, and Native American Communities  —  Washington, D.C. - House Majority Forward is announcing an initial $20 million investment … ",
    "url": "https://www.housemajorityforward.org/news/house-majority-forward-announces-20-million-voter-registration-and-grassroots-mobilization-campaign"
  },
  {
    "text": "CNN Exclusive: Special counsel election probe continues with focus on fundraising, voting equipment breaches  —  Special counsel Jack Smith is still pursuing his investigation into efforts to overturn the 2020 election a month after indicting Donald Trump for orchestrating a broad conspiracy … ",
    "url": "https://www.cnn.com/2023/09/05/politics/special-counsel-election-probe-continues-fundraising-voting-equipment-breaches-sidney-powell/"
  },
  {
    "text": "Climate-linked ills threaten humanity  —  The floods came, and then the sickness.  —  Muhammad Yaqoob stood on his concrete porch and watched the black, angry water swirl around the acacia trees and rush toward his village last September, the deluge making a sound that was like nothing he had ever heard.",
    "url": "https://www.washingtonpost.com/climate-environment/interactive/2023/pakistan-extreme-heat-health-impacts-death/"
  }
]