[
  {
    "text": "Trump's Lust for Power Cannot Be Satiated  —  It is a fool's errand to try to rationalize President Trump's obsession with tariffs.  —  This is not to say that people haven't tried.  There are any number of theories that seek to explain Trump's preoccupation with tariffs and trade wars.",
    "url": "https://www.nytimes.com/2025/04/09/opinion/trump-tariffs-rationale-power.html"
  },
  {
    "text": "Live Updates: Markets Slide Further as U.S. Imposes Punishing Tariffs  —  President Trump's latest moves included a 104 percent tariff on Chinese goods.  Stocks and bonds slumped as Beijing hit back with its own levies and European leaders prepared retaliation measures.  —  Here's the latest.",
    "url": "https://www.nytimes.com/live/2025/04/08/business/trump-tariffs-china-stock-market?unlocked_article_code=1.-U4.NY0I.9O_0qafgC9ol&smid=url-share"
  },
  {
    "text": "Trump pauses reciprocal tariffs for 90 days, increases China tariffs to 125%  —  President Trump on Wednesday announced a 90-day pause on most of his new tariffs, and a lowering of the “reciprocal tariff” rate to 10%, effective immediately, he said on Truth Social.",
    "url": "https://www.cbsnews.com/news/trump-announces-90-day-tariffs-pause/"
  },
  {
    "text": "Trump temporarily drops tariffs to 10% for most countries, hits China harder with 125% … President Donald Trump on Wednesday dropped tariffs under his new trade plan to 10% on imports from most countries, as he announced a 90-day pause for higher, so-called reciprocal tariffs that took effect on many countries this week.",
    "url": "https://www.cnbc.com/2025/04/09/trump-announces-90-day-tariff-pause-for-at-least-some-countries.html"
  },
  {
    "text": "Trump pauses reciprocal tariffs for 90 days for everyone but China  —  President Trump paused the sweeping reciprocal tariffs the U.S. imposed on dozens of countries this week, saying dozens had reached out to negotiate new trade deals.  —  Why it matters: Economists said the tariffs … ",
    "url": "https://www.axios.com/2025/04/09/trump-tariffs-pause-china-stocks-recession"
  },
  {
    "text": "Elon Musk's DOGE Is Getting Audited  —  The General Accountability Office's audit examines DOGE's handling of data at a number of federal agencies, according to sources and records reviewed by WIRED.  —  The General Accountability Office (GAO) is auditing Elon Musk's so-called Department of Government Efficiency (DOGE).",
    "url": "https://www.wired.com/story/gao-audit-elon-musk-doge-government-agencies/"
  },
  {
    "text": "How Musk and Trump Are Working to Consolidate Government Data About You  —  Databases that Elon Musk's team is trying to access include more than 300 personal details about members of the U.S. public.  —  The federal government knows your mother's maiden name and your bank account number.",
    "url": "https://www.nytimes.com/2025/04/09/us/politics/trump-musk-data-access.html?unlocked_article_code=1.-U4.Iry8.1A4wKeGn4nWS&smid=url-share"
  },
  {
    "text": "House GOP moves to turn off ability to force vote on rescinding Trump ‘Liberation Day’ tariffs  —  House Republicans are moving to turn off Democrats' ability to force a vote on rescinding the sweeping global tariffs imposed by President Trump as part of his “Liberation Day” announcement.",
    "url": "https://thehill.com/homenews/house/5240652-house-gop-trump-tariffs-vote/"
  },
  {
    "text": "U.S. Treasury Yields Jump as Trump Tariffs Fuel Bond Selloff  —  The increase in long-end Treasury yields prompted a rise in European counterparts, though the selloff in Europe was less intense  —  U.S. Treasury yields continued to surge after President Trump's sweeping duties … ",
    "url": "https://www.wsj.com/finance/u-s-treasury-yields-jump-europe-follows-as-tariff-turmoil-continues-28d86a61"
  },
  {
    "text": "FBI director Kash Patel removed as director of Bureau of Alcohol, Tobacco, Firearms and Explosives  —  Trump appointee replaced by US army secretary Daniel Driscoll, four people familiar with the matter said  —  The FBI director Kash Patel was quietly removed as the acting director of the Bureau of Alcohol … ",
    "url": "https://www.theguardian.com/us-news/2025/apr/09/kash-patel-director-atf-bureau-removal"
  },
  {
    "text": "Exclusive: Kash Patel removed as acting ATF director, replaced by Army Secretary, sources say  —  FBI Director Kash Patel was removed as the Acting Director of the Bureau of Alcohol, Tobacco, Firearms and Explosives and replaced by U.S. Army Secretary Daniel Driscoll, four people familiar with the matter said on Wednesday.",
    "url": "https://www.reuters.com/world/us/kash-patel-removed-acting-atf-director-replaced-by-army-secretary-sources-say-2025-04-09/"
  },
  {
    "text": "U.S. says it is now monitoring immigrants' social media for antisemitism  —  U.S. Citizenship and Immigration Services has announced it will begin screening immigrant's social media for evidence of antisemitic activity as grounds for denying immigration benefit requests.",
    "url": "https://www.npr.org/2025/04/09/g-s1-59149/immigrants-social-media-antisemitism-dhs"
  },
  {
    "text": "DHS to Begin Screening Aliens' Social Media Activity for Antisemitism  —  WASHINGTON— Today U.S. Citizenship and Immigration Services (USCIS) will begin considering aliens' antisemitic activity on social media and the physical harassment of Jewish individuals as grounds for denying immigration benefit requests.",
    "url": "https://www.uscis.gov/newsroom/news-releases/dhs-to-begin-screening-aliens-social-media-activity-for-antisemitism"
  },
  {
    "text": "How Trump Is Putting Law Firms in a No-Win Situation  —  As Willkie Farr & Gallagher learned, cutting a deal with the White House can avert a financially punitive executive order.  But doing so can draw internal rebukes and external criticism.  —  Willkie Farr & Gallagher last week became … ",
    "url": "https://www.nytimes.com/2025/04/09/us/politics/trump-law-firms-orders.html"
  },
  {
    "text": "Some elite Trump supporters are having regrets.  We asked them why.  —  President Donald Trump's tariffs haven't only demolished trillions in wealth and raised the chance of a global recession.  They've also led some prominent Trump supporters to wonder whether they made a huge mistake.",
    "url": "https://www.vox.com/on-the-right-newsletter/407623/trump-tariff-culture-war-hanania-khan-ferguson"
  },
  {
    "text": "Dollar Confidence Crisis Is Here, Deutsche Bank Warns  —  The broad selloff in U.S. stocks and bonds, and the continuing decline in the dollar, represents a “simultaneous collapse in the price of all U.S. assets,” analysts at Deutsche Bank said Wednesday.  They warned that “unchartered territory” lies ahead.",
    "url": "https://www.wsj.com/livecoverage/stock-market-trump-tariffs-trade-war-04-09-25/card/dollar-confidence-crisis-is-here-deutsche-bank-warns-OS3izqVU0PPvpBGqOC2k"
  },
  {
    "text": "About 90% of Migrants Deported to El Salvador Had No US Criminal Record  — Men were accused of ties to Tren de Aragua criminal gang  — US court records show just a few charges for serious crimes  —  Trump administration officials have described the men deported to El Salvador prisons last month as … ",
    "url": "https://www.bloomberg.com/news/articles/2025-04-09/about-90-of-migrants-sent-to-salvador-lacked-us-criminal-record?accessToken=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzb3VyY2UiOiJTdWJzY3JpYmVyR2lmdGVkQXJ0aWNsZSIsImlhdCI6MTc0NDIwNjMxOCwiZXhwIjoxNzQ0ODExMTE4LCJhcnRpY2xlSWQiOiJTVFFQVjhEV0xVNjgwMCIsImJjb25uZWN0SWQiOiI4RjAwQzE5NzhFODA0RkI3Qjk2QzIxODkwOEUxNTI1NCJ9.DydvvKB6uLcNj3ieicip8K8PVCRoeveD72K4VQ9n-cc&leadSource=uverify%20wall"
  },
  {
    "text": "Multiple federal judges temporarily halt Trump's Alien Enemies Act removals  —  UPDATE: This report was expanded and updated, with the final update at 2:10 p.m. April 9.  —  In two lawsuits filed in the two days since the U.S. Supreme Court limited Alien Enemies Act litigation to habeas corpus proceedings … ",
    "url": "https://www.lawdork.com/p/aclu-brings-class-habeas-action-in"
  },
  {
    "text": "Many lawyers who argue for Trump at Supreme Court are heading for the exit  —  At least half of the front-line attorneys in the solicitor general's office plan to leave, people familiar with the matter said, as Trump's emergency requests pile up at the high court.",
    "url": "https://www.washingtonpost.com/politics/2025/04/09/trump-solicitor-general-office-lawyers-departures/"
  },
  {
    "text": "Gabbard's Pick to Run Counterterrorism Center Aided Start of a Right-Wing Paramilitary Group  —  When Tulsi Gabbard, the director of national intelligence, went looking for someone to head the National Counterterrorism Center, she landed on Joe Kent, a former Green Beret, past CIA officer … ",
    "url": "https://www.motherjones.com/politics/2025/04/joe-kent-tulsi-gabbard-national-counterterrorism-center-first-amendment-praetorian-robert-patrick-lewis/"
  },
  {
    "text": "Trump asks Supreme Court to let him fire independent regulators  —  The cases test the boundaries of presidential power and involve Gwynne Wilcox of the National Labor Relations Board and Cathy A. Harris of the Merit Systems Protection  —  Just now  —  The Trump administration on Wednesday asked … ",
    "url": "https://www.washingtonpost.com/politics/2025/04/09/trump-supreme-court-fire-independent-regulators/"
  },
  {
    "text": "'Where's Alex?'  A Beloved Caregiver Is Swept Up in Trump's Green Card Crackdown … Alfredo Orellana, 31, was not just a caregiver for Luke Ferris, a 28-year-old with severe autism.  The pair worked out at the gym, got tacos and played video games together.  They exchanged elbow bumps.",
    "url": "https://www.nytimes.com/2025/04/09/us/immigration-green-card-crackdown-trump.html?unlocked_article_code=1.-U4.tnnm.vNSYzDag7l2_&smid=nytcore-android-share"
  },
  {
    "text": "Ice director says deportations should be run like ‘Amazon Prime for human beings’  —  Todd Lyons said he wanted US immigration agency to be ‘like a business’ in its deportation process  —  The head of Immigration and Customs Enforcement said he'd like the agency to implement a system of trucks … ",
    "url": "https://www.theguardian.com/us-news/2025/apr/09/ice-todd-lyons-deporation-amazon"
  },
  {
    "text": "'I Know Musk's Secret Blueprint to Destroy Social Security from The Inside'  —  COLD AND CALCULATED  —  “I'm almost certain that the goal is privatization,” one 15-year veteran of the agency tells the Daily Beast.  —  EXCLUSIVE  —  Rennie Glasgow took a pay cut when he left a job in sales … ",
    "url": "https://www.thedailybeast.com/veteran-insider-believes-elon-musk-is-out-to-sabotage-social-security/"
  },
  {
    "text": "Inside a Powerful Database ICE Uses to Identify and Deport People  —  A powerful Immigration and Customs Enforcement (ICE) database, parts of which have been seen by 404 Media, allows the federal government to search for and filter people by hundreds of different, highly specific categories.",
    "url": "https://www.404media.co/inside-a-powerful-database-ice-uses-to-identify-and-deport-people/"
  },
  {
    "text": "Lavish Trump spending undermines public trust  —  The Trump administration is forcing the American people to make sacrifices and endure “short-term” pain because of their policies.  Apparently, the need for sacrifice only applies to the American people, not Donald Trump.",
    "url": "https://thehill.com/opinion/5239509-public-funds-waste-musk-trump/"
  },
  {
    "text": "Bessent cancels Hill appearance amid market turmoil  —  Treasury Secretary Scott Bessent canceled a planned appearance on Capitol Hill Wednesday before a group of House Republicans.  Bessent had been scheduled to address the Republican Study Committee lunch, where he was expected … ",
    "url": "https://www.politico.com/live-updates/2025/04/09/congress/bessent-cancels-hill-appearance-amid-market-turmoil-00280957"
  }
]