[
  {
    "text": "Trump Seeks, Without Evidence, to Blame D.E.I. and Democrats for the Crash  —  President Trump's remarks, suggesting that diversity in hiring and other Biden administration policies somehow caused the disaster, reflected his instinct to immediately frame major events through his political or ideological lens.",
    "url": "https://www.nytimes.com/2025/01/30/us/politics/trump-plane-crash-dei-faa-diversity.html?unlocked_article_code=1.tE4.Z0ud.JbQhMo4mtVkd"
  },
  {
    "text": "Trump's Plane Crash Response Is as Cheap as You'd Expect  —  THERE ARE PLENTY OF REASONABLE, nuanced, principled criticisms of DEI programs, and we at The Bulwark have made a lot of them.  —  But the attack on diversity, equity, and inclusion (DEI) programs that Donald Trump and JD Vance advanced … ",
    "url": "https://www.thebulwark.com/p/trumps-plane-crash-response-is-as"
  },
  {
    "text": "Plane crashes in D.C.'s Potomac River with 64 on board after midair collision with Army helicopter — live updates  —  What to know about the Washington, D.C., plane crash  — Search efforts continue in the Potomac River after an American Airlines plane with 60 passengers and four crew … ",
    "url": "https://www.cbsnews.com/live-updates/plane-crash-dc-helicopter-potomac-river/"
  },
  {
    "text": "Trump, without citing evidence, attacks FAA diversity initiatives during plane crash briefing, prompts fierce backlash  —  “I put safety first ... Democrats put policy first,” Trump said.  —  President Donald Trump speaks about the mid-air crash between American Airlines flight 5342 … ",
    "url": "https://abcnews.go.com/Politics/trump-evidence-appears-blame-faa-diversity-initiatives-factor/story?id=118272015"
  },
  {
    "text": "F.C.C. Chair Orders Investigation Into NPR and PBS Stations  —  Brendan Carr, the chairman of the Federal Communications Commission, recently expressed concern about NPR and PBS's sponsorships.  —  Brendan Carr, the chairman of the Federal Communications Commission, informed NPR and PBS … ",
    "url": "https://www.nytimes.com/2025/01/30/business/media/npr-pbs-fcc-investigation.html?unlocked_article_code=1.tE4.njGJ.s2ljEztrWYxy&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "The Patel Dossier  —  Everything you want to know about Kash Patel—and so very much more.  —  Meet The Authors … Kash Patel today goes before the Senate Judiciary Committee, which is considering his nomination to be director of the FBI.  To say that Patel is an unusual nominee would understate the matter considerably.",
    "url": "https://www.lawfaremedia.org/article/the-patel-dossier"
  },
  {
    "text": "Breaking Down OPM's ‘Fork in the Road’ Email to Federal Workers  —  Though the subject line borrows a phrase from Musk's Twitter email, the federal government is not a private company, and its HR policies are arcane and legally binding.  —  Meet The Authors",
    "url": "https://www.lawfaremedia.org/article/breaking-down-opm-s--fork-in-the-road--email-to-federal-workers"
  },
  {
    "text": "FAA Chief Quit on Jan. 20 After Elon Musk Told Him to Resign  —  The Federal Aviation Administration's leader stepped down on Jan. 20, months after Elon Musk demanded that he quit.The move by Michael Whitaker means the FAA has no Senate-confirmed leader for one of the biggest crises in its history … ",
    "url": "https://www.thedailybeast.com/faa-chief-michael-whitaker-quit-on-jan-20-after-elon-musk-told-him-to-resign/"
  },
  {
    "text": "Trump Gutted Key Aviation Safety Committee Before D.C. Plane Crash  —  Last week, just days after his inauguration, Donald Trump eliminated the membership of a key committee that handles aviation security.  And on Wednesday night,  a passenger plane collided with a military helicopter in the Washington, D.C., area.",
    "url": "https://newrepublic.com/post/190934/trump-aviation-safety-committee-dc-plane-crash"
  },
  {
    "text": "In Tense Call, Governors Push Schumer to Fight Harder Against Trump  —  On a call with Senator Chuck Schumer, the minority leader, six Democratic governors pushed him to slow down the confirmation of President Trump's nominees and to do more to block his agenda.",
    "url": "https://www.nytimes.com/2025/01/29/us/politics/chuck-schumer-trump-agenda-cabinet.html?unlocked_article_code=1.tE4.uTbf.cKtvP65o9Anu&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Sam Bankman-Fried's Parents Explore Seeking Trump Pardon for Son  — They've met with lawyers and other figures in Trump's orbit  — FTX co-founder was sentenced to 25 years for fraud last year  —  The Impact of Trump's DEI Actions The Impact of Trump's DEI Actions The Impact of Trump's DEI Actions",
    "url": "https://www.bloomberg.com/news/articles/2025-01-30/sam-bankman-fried-s-parents-explore-seeking-trump-pardon-for-son"
  },
  {
    "text": "MSU college abruptly cancels Lunar New Year event, citing Trump DEI orders  —  Michigan State University cancelled an annual Lunar New Year celebration following new executive orders targeting diversity, equity and inclusion policies and concerns from students, according to emails obtained by The State News.",
    "url": "https://statenews.com/article/2025/01/msu-college-abruptly-cancels-lunar-new-year-event-citing-trump-orders"
  },
  {
    "text": "Former USDA Inspector General Defies Trump Order, Escorted from Her Office  —  Security agents escorted the inspector general of the U.S. Department of Agriculture out of her office on Monday after she refused to comply with her dismissal by the Trump administration, according to Reuters.",
    "url": "https://www.newsweek.com/former-usda-inspector-general-defies-trump-order-escorted-her-office-2023069"
  },
  {
    "text": "A combative nomination hearing raises more questions about Gabbard  —  Tulsi Gabbard's comments on Edwards Snowden didn't appear to be helping her case as her confirmation bid for director of national intelligence remains uncertain.  —  President Donald Trump's nominee to be the nation's top spy chief faced … ",
    "url": "https://www.politico.com/news/2025/01/30/tulsi-gabbard-mark-warner-law-dni-unqualified-00201517"
  },
  {
    "text": "Trump Administration Orders Agencies to Find More DEI Workers to Ax  —  Government offices have cut dozens of positions and canceled millions of dollars in contracts  —  Trump administration officials are pressing federal agencies to dig deeper to find diversity workers to push out of the government … ",
    "url": "https://www.wsj.com/politics/policy/trump-administration-orders-agencies-to-find-more-dei-workers-to-ax-7b627c36"
  },
  {
    "text": "Live Updates: Plane Crashes Near Washington After Colliding With Army Helicopter  —  The American Airlines flight from Wichita, Kan., plunged into the Potomac River, the F.A.A. said.  An Army official said it collided with a Black Hawk helicopter.  —  Here is the latest on the crash.",
    "url": "https://www.nytimes.com/live/2025/01/29/us/plane-crash-washington-dc"
  },
  {
    "text": "Singer Marianne Faithfull dies at 78  —  Singer and actress Marianne Faithfull has died at the age of 78, her spokesperson has said.  —  Faithfull was known for hits that included As Tears Go By, which reached the UK top 10 in 1964, and starring roles in films including 1968's The Girl On A Motorcycle.",
    "url": "https://www.bbc.com/news/articles/cp8k931j423o"
  },
  {
    "text": "Criminal records of Jan. 6 rioters pardoned by Trump include rape, domestic violence  —  Editor's Note: This story includes descriptions of violent crimes and sexual abuse involving both adults and children that may be disturbing to readers.  —  On his first day in office … ",
    "url": "https://www.npr.org/2025/01/30/nx-s1-5276336/donald-trump-jan-6-rape-assault-pardons-rioters"
  },
  {
    "text": "To Pay for Trump Tax Cuts, House GOP Floats Plan to Slash Benefits for the Poor and Working Class  —  A menu of options being circulated by congressional Republicans also includes new tax cuts for corporations and the ultrawealthy.  —  One of the hallmarks of Donald Trump's presidential campaign … ",
    "url": "https://www.propublica.org/article/trump-tax-cuts-congress-republicans-plan-slash-benefits"
  },
  {
    "text": "Pentagon agency pauses celebrations for Martin Luther King Jr. Day, Black History Month and more  —  WASHINGTON — The Defense Department's intelligence agency has paused observances of Martin Luther King Jr. Day, Pride Month, Holocaust Days of Remembrance and other cultural or historical annual events … ",
    "url": "https://www.stripes.com/theaters/us/2025-01-29/department-of-defense-pauses-cultural-observances-16642776.html"
  },
  {
    "text": "Tulsi Gabbard refuses to call Edward Snowden a “traitor” … “So, was Edward Snowden a traitor?”  — Gabbard would not give a yes or no answer, saying only that she is “committed if confirmed as Director of National Intelligence to join you in making sure that there is no future Snowden-type leak.”",
    "url": "https://www.axios.com/2025/01/30/tulsi-gabbard-edward-snowden-traitor"
  },
  {
    "text": "Alexandria Ocasio-Cortez lays out battle plan against ‘shockingly dim’ Trump White House  —  The Trump White House this week sparked chaos across the nation when it issued an executive order that resulted in Medicaid portals getting shut down in all 50 states.",
    "url": "https://www.rawstory.com/alexandria-ocasio-cortez-2671031806/"
  },
  {
    "text": "Senior FBI leaders promoted by former Director Wray have been demoted or reassigned, sources say  —  At least five senior FBI leaders who were promoted by former Director Christopher Wray have been notified they are being demoted or reassigned, according to sources briefed on the matter … ",
    "url": "https://www.cnn.com/2025/01/30/politics/senior-fbi-leaders-demoted-wray/"
  },
  {
    "text": "Hiding in the attic in Donald Trump's America  —  It was the best of times, it was the worst of times.  On the seventh night of Donald Trump's long-dreaded second presidency, thousands of joyous Philadelphians poured into the streets.  Not for him , of course, but because our beloved Birds … ",
    "url": "https://www.inquirer.com/columnists/attytood/immigration-raids-trump-deepseek-tech-eagles-superbowl-20250128.html"
  },
  {
    "text": "Trump Administration Considers Halting Congestion Pricing  —  The New York City tolling program began on Jan. 5 after defying obstacles for decades.  A move to stop it would likely touch off a legal battle between the state and federal government.  —  The Trump administration is considering … ",
    "url": "https://www.nytimes.com/2025/01/30/nyregion/nyc-trump-congestion-pricing.html?unlocked_article_code=1.tE4.p5Cn.mjMA4BYv5brH"
  },
  {
    "text": "Calvin Robinson's license revoked by the Anglican Catholic Church over political actions  —  Statement from the Anglican Catholic Church  —  At approximately 3:00 pm today (1/29) members of the College of Bishops of the ACC were made aware of a post made on X showing the end of a speech … ",
    "url": "https://anglican.ink/2025/01/29/calvin-robinson-license-revoked-by-the-anglican-catholic-church-over-political-actions/"
  },
  {
    "text": "Exclusive: Trump Middle East envoy says rebuilding Gaza could take 10 to 15 years … - The administration is working on concluding implementation of the first phase of the deal between Israel and Hamas to release hostages held in Gaza in exchange for a ceasefire.",
    "url": "https://www.axios.com/2025/01/30/gaza-rebuilding-plans-trump-administration"
  },
  {
    "text": "US ban on gun sales to adults under age 21 is unconstitutional, court rules  —  A decades-old U.S. government ban on federally licensed firearms dealers selling handguns to adults under the age of 21 is unconstitutional, a U.S. appeals court held on Thursday, citing recent U.S. Supreme Court rulings expanding gun rights.",
    "url": "https://www.reuters.com/legal/us-ban-gun-sales-adults-under-age-21-is-unconstitutional-court-rules-2025-01-30/"
  }
]