[
  {
    "text": "Let's Ask Trump To Leave The Race  —  Have you read the post debate hot takes?  Here's the Editorial Board of The New York Times: … That sentiment was echoed across the opinion pages.  Here's a screenshot from Friday night.  —  Other respected commentators, many of them friends … ",
    "url": "https://thelefthook.substack.com/p/lets-ask-trump-to-leave-the-race"
  },
  {
    "text": "Democrats: Stop Panicking  —  As a former Republican who spent decades pointing out flaws in the Democratic Party, I watch the current Democratic panic over President Biden's debate performance with a mix of bafflement and nostalgia.  —  It's baffling that so many Democrats are failing … ",
    "url": "https://www.nytimes.com/2024/06/29/opinion/democrats-panic-joe-biden.html"
  },
  {
    "text": "To serve his country, Donald Trump should leave the raceBoard  —  President Joe Biden's debate performance was a disaster.  His disjointed responses and dazed look sparked calls for him to drop out of the presidential race.But lost in the hand wringing was Donald Trump's usual bombastic litany of lies … ",
    "url": "https://www.inquirer.com/opinion/editorials/first-presidential-debate-joe-biden-donald-trump-withdraw-20240629.html"
  },
  {
    "text": "Biden campaign fundraises $27 million after first debate … The Biden campaign has raised $27 million starting from the day of the first presidential debate through Friday evening, a campaign spokesperson announced on Saturday.  —  The number comes in the middle of President Joe Biden's … ",
    "url": "https://www.cnbc.com/2024/06/29/biden-campaign-fundraises-27-million-post-debate.html"
  },
  {
    "text": "Behind the Curtain: Biden oligarchy will decide fate … These allies alone hold sway over decisions big and small in Biden's life and presidency.  — The president engaged in no organized process outside his family in deciding to run for a second term, the N.Y. Times' Peter Baker reports.",
    "url": "https://www.axios.com/2024/06/29/biden-debate-replace-advisers"
  },
  {
    "text": "Haley Warns Trump to Prepare for Younger Rival, Renews Call for Cognitive Tests  —  Former GOP presidential contender says Democrats should move on from Biden  —  Nikki Haley, the runner-up to Donald Trump in this year's GOP nomination race, said Democrats need to dump President Biden … ",
    "url": "https://www.wsj.com/politics/elections/haley-warns-trump-to-prepare-for-younger-rival-renews-call-for-cognitive-tests-5c6d7294"
  },
  {
    "text": "Biden supporters to New York Times: ‘F— off!’  —  The New York Times, after months of accusations of slanted coverage of the presidential race and whining that President Joe Biden refused to sit for an interview, made a startling declaration after Thursday night's debate:",
    "url": "https://www.nj.com/politics/2024/06/biden-supporters-to-new-york-times-f-off.html"
  },
  {
    "text": "‘The vibes are really bad’  —  Welcome to POLITICO's West Wing Playbook, your guide to the people and power centers in the Biden administration.  —  RALEIGH, North Carolina — Several West Wing officials were so demoralized by President JOE BIDEN's poor performance in Thursday night's debate … ",
    "url": "https://www.politico.com/newsletters/west-wing-playbook/2024/06/28/the-vibes-are-really-bad-00165772"
  },
  {
    "text": "What SCOTUS just did to broadband, the right to repair, the environment, and more … Since the New Deal era, the bulk of the functioning US government is the administrative state — think the acronym soup of agencies like the EPA, FCC, FTC, FDA, and so on.  Even when Capitol Hill is not mired … ",
    "url": "https://www.theverge.com/24188365/chevron-scotus-net-neutrality-dmca-visa-fcc-ftc-epa"
  },
  {
    "text": "‘So bad’: Bob Woodward calls Biden's debate performance political h-bomb  —  WASHINGTON − Bob Woodward knows a little bit about political scandals that could bring down the president.  —  The famous journalist, who helped break the 1972 Watergate scandal, told MSNBC Friday … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/06/29/bob-woodward-watergate-biden/74255601007/"
  },
  {
    "text": "Republicans use cannabis smell complaints as ‘excuse’ to oppose legalization, advocates say  —  Norml argues lawmakers exaggerate scent complaints to support policies banning public use of marijuana  —  Some Republican lawmakers, including Florida governor Ron DeSantis … ",
    "url": "https://www.theguardian.com/us-news/article/2024/jun/29/cannabis-legalization-smell-complaint-republican"
  },
  {
    "text": "Memo Reveals Trump's Plan to Slash the Size of the G.O.P. Platform  —  In another sign of Donald J. Trump's grip on the Republican Party, his team wants the party's platform to be a succinct pro-Trump document, not an “unnecessarily verbose treatise.”  —  Donald J. Trump's top advisers … ",
    "url": "https://www.nytimes.com/2024/06/29/us/politics/trump-gop-platform.html"
  },
  {
    "text": "‘People need to wake up’: Rep. Crockett pushes back against Biden debate criticism  —  Rep. Jasmine Crockett joins Ali Velshi to react to Biden's debate performance, urging Democrats to avoid unnecessary panicking.  “It's almost like we're scared of our shadow sometimes,” Crockett says.",
    "url": "https://www.msnbc.com/ali-velshi/watch/-people-need-to-wake-up-rep-jasmine-crockett-pushes-back-against-biden-debate-criticism-213947973853"
  },
  {
    "text": "Biden Administration Opposes Surgery for Transgender Minors  —  The statement followed a report in The Times that a federal health official had urged the removal of age minimums from treatment guidelines for transgender minors.  —  The Biden administration said this week … ",
    "url": "https://www.nytimes.com/2024/06/28/health/transgender-surgery-biden.html"
  }
]