[
  {
    "text": "Trump Rails Against ‘Shylocks And Bad People’ In Iowa Speech  —  President Donald Trump employed a term often used as a slur against Jewish people as he blasted bankers during a speech in Iowa on Thursday evening.  The remark came as he was touting tax cuts in his so-called “Big Beautiful Bill … ",
    "url": "https://talkingpointsmemo.com/news/trump-rails-against-shylocks-and-bad-people-in-iowa-speech"
  },
  {
    "text": "What Trump Told Me About His Complete Domination of Congress  —  Demanding a bill by Independence Day was a telling flourish for someone with zero tolerance for independence in the legislative branch.  —  When I reached President Donald Trump by phone Tuesday night, with his “big, beautiful” … ",
    "url": "https://www.politico.com/news/magazine/2025/07/03/trump-interview-megabill-rachael-bade-00438195"
  },
  {
    "text": "After House Republicans ignored her appeals, Lisa Murkowski's vote looks even worse  —  The Alaska Republican cast an indefensible vote in favor of the GOP's megabill.  After the House approved the same package, her vote now looks even worse.  —  Three Senate Republicans balked … ",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/house-republicans-ignored-appeals-lisa-murkowskis-vote-looks-even-wors-rcna216750"
  },
  {
    "text": "House passes sprawling domestic policy bill, sending it to Trump's desk  —  The Republican package would slash taxes, boost spending on immigration enforcement and the military, and impose steep cuts to Medicaid, SNAP and clean energy funding.  —  WASHINGTON — The Republican-controlled House … ",
    "url": "https://www.nbcnews.com/politics/congress/house-final-vote-trump-big-beautiful-bill-republicans-rcna216626"
  },
  {
    "text": "They Savaged Their Party's Bill.  Then They Voted for It.  —  Many Republicans had harshly criticized President Trump's marquee bill extending tax cuts and slashing social safety net programs — almost right up until the moment they voted for it.  —  In the days leading up to House passage … ",
    "url": "https://www.nytimes.com/2025/07/03/us/politics/republican-criticism-trump-policy-bill.html"
  },
  {
    "text": "Republicans Are Cutting Medicare.  Not Only Medicaid, Medicare.  —  Passage of the Big Beautiful Bill will force mandatory sequestration that will mean half a trillion dollars in Medicare cuts.  —  House Speaker Mike Johnson (R-LA) speaks with reporters ahead of a final vote … ",
    "url": "https://prospect.org/politics/2025-07-03-republicans-cutting-medicare-not-only-medicaid/"
  },
  {
    "text": "Trump Claims Sweeping Power to Nullify Laws, Letters on TikTok Ban Show  —  In purporting to license otherwise illegal conduct by tech firms, President Trump set a precedent expanding executive power, legal experts warned.  —  Attorney General Pam Bondi told tech companies … ",
    "url": "https://www.nytimes.com/2025/07/03/us/politics/trump-bondi-tiktok-executive-power.html?unlocked_article_code=1.Tk8.cwes.GGYdG9AILg_A&smid=url-share"
  },
  {
    "text": "SCOTUS allows Trump admin to send eight men to South Sudan with no process  —  The U.S. Supreme Court issued an order on Thursday that will empower the Trump administration to send people subject to deportation to countries they have no connection with that are so dangerous the Trump administration advises Americans not to travel there.",
    "url": "https://www.lawdork.com/p/scotus-allows-trump-admin-to-send"
  },
  {
    "text": "Supreme Court paves the way for Trump to send migrants to South Sudan  —  The Justice Department had sought clarification of a recent Supreme Court decision that cleared the path for the administration to quickly deport immigrants to “third countries.”  —  WASHINGTON — The Supreme Court … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-trump-send-migrants-south-sudan-djibouti-rcna214952"
  },
  {
    "text": "Mamdani Identified as Asian and African American on College Application  —  Zohran Mamdani, the Democrat running for mayor of New York City, was born in Uganda.  He doesn't consider himself Black but said the application didn't allow for the complexity of his background.",
    "url": "https://www.nytimes.com/2025/07/03/nyregion/mamdani-columbia-black-application.html?unlocked_article_code=1.Tk8.dq-_.OgG4Ktak82Hp&smid=url-share"
  },
  {
    "text": "Zohran Mamdani Said He Was Black on Columbia University Application  —  Yesterday I wrote a round-up of bad news for Columbia University.  One of the four stories I mentioned was the hack of Columbia's computers which appeared to have been done by someone interested in finding out if the school … ",
    "url": "https://hotair.com/john-s-2/2025/07/03/zohran-mamdani-said-he-was-black-on-columbia-university-application-n3804458"
  },
  {
    "text": "200 Marines among those being sent to Florida to help ICE  —  ICE will determine the duties assigned to the Marines.  —  Marines from the Marine Corps Air Ground Combat Center (MCAGCC) at Twentynine Palms guard the Wilshire Federal Building as people protest the involvement of the U.S … ",
    "url": "https://abcnews.go.com/Politics/200-marines-florida-ice/story?id=123466361"
  },
  {
    "text": "US military says 200 Marines being sent to support ICE in Florida  —  The U.S. military said on Thursday it will send 200 Marines to Florida to provide administrative and logistical support to Immigrations and Customs Enforcement.  —  The Marines are the first wave of U.S. Northern Command's support … ",
    "url": "https://www.reuters.com/world/us/us-military-says-200-marines-being-sent-support-ice-florida-2025-07-03/"
  },
  {
    "text": "Roughly 140 EPA staffers who signed ‘dissent’ letter are put on leave  —  Trump officials have placed 139 employees who signed a letter of dissent protesting the Environmental Protection Agency's current direction and policies on leave Thursday.  —  The Trump administration has placed … ",
    "url": "https://www.washingtonpost.com/climate-environment/2025/07/03/epa-dissent-letter-employees-leave/"
  },
  {
    "text": "Fact Sheet: President Donald J. Trump Makes Our National Parks Great Again  —  PUTTING AMERICANS FIRST: Today, President Donald J. Trump signed an Executive Order investing in our national treasures by increasing fees for foreign tourists visiting our national parks to improve services, access, and affordability for Americans.",
    "url": "https://www.whitehouse.gov/fact-sheets/2025/07/fact-sheet-president-donald-j-trump-makes-our-national-parks-great-again/"
  },
  {
    "text": "Immigration Agents Appear to Urinate in Public at a California School  —  School officials have demanded answers from federal agencies.  It was the latest example of how locals have scrutinized the actions of immigration agents.  —  The line of S.U.V.s and vans streamed through an open gate … ",
    "url": "https://www.nytimes.com/2025/07/03/us/immigration-agents-urinate-california-school.html?unlocked_article_code=1.T08.3CJR.PU7F2LVKhfCi&smid=url-share"
  },
  {
    "text": "Alina Habba Has Been Under an Ethics Investigation for Over a Year  —  Documents obtained by NOTUS detail an investigation into Trump's pick for U.S. attorney for New Jersey.  — Copy  —  Alina Habba, once President Donald Trump's personal attorney and now the interim U.S. attorney for New Jersey … ",
    "url": "https://www.notus.org/donald-trump/alina-habba-ethics-investigation"
  },
  {
    "text": "Southwest Nebraska medical center announces plans to close, blames uncertainty over funding  —  The uncertainty over federal Medicaid funding appears to have claimed its first victim in Nebraska.  —  Community Hospital in McCook announced Wednesday that it will close Curtis Medical Center in Curtis … ",
    "url": "https://nebraskapublicmedia.org/en/news/news-articles/southwest-nebraska-hospital-announces-plans-to-close-blames-uncertainty-over-funding/"
  },
  {
    "text": "Trump Targets Google After Meta and X Payouts  —  Mark Zuckerberg paid $25 million.  Elon Musk followed with $10 million.  Now it could be Sundar Pichai's turn.  —  Of all the titans of social media, Google CEO Sundar Pichai tried to keep the groveling to a minimum after Donald Trump won last year.",
    "url": "https://www.theatlantic.com/politics/archive/2025/07/trump-google-lawsuit-settlement/683420/?gift=FEWAoWcq6grjKzrSTXJ8NuPIZEWu3fZ907TOz8tsGOo&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  }
]