[
  {
    "text": "Donald Trump's tariffs will fix a broken system  —  Next we must tackle the barrage of non-tariff weapons used to strangle American exports  —  The writer is President Trump's senior counsellor for trade and manufacturing  —  The international trade system is broken — and Donald Trump's reciprocal tariff doctrine will fix it.",
    "url": "https://www.ft.com/content/f313eea9-bd4f-4866-8123-a850938163be"
  },
  {
    "text": "Trump threatens new 50% tariffs on China if Beijing doesn't remove retaliatory duties: Live updates … WATCH NOW … CNBC's reporters are covering the tariffs and their effects, live on air and online from our bureaus in Washington; London; Singapore; San Francisco; and Englewood Cliffs, New Jersey.",
    "url": "https://www.cnbc.com/2025/04/07/trump-tariffs-live-updates-stock-market-crypto.html"
  },
  {
    "text": "Bessent flew to Florida to lobby Trump on tariff message  —  Bessent flew to Florida on Sunday to encourage Trump to start putting more emphasis on talking about his endgame.  —  Treasury Secretary Scott Bessent flew to Florida Sunday to encourage President Donald Trump to focus his message … ",
    "url": "https://www.politico.com/news/2025/04/07/trump-bessent-trade-deals-tariff-endgame-messaging-00277395"
  },
  {
    "text": "Supreme Court allows Trump to enforce Alien Enemies Act for rapid deportations for now  —  The Supreme Court on Monday allowed President Donald Trump to enforce the Alien Enemies Act for now, handing the White House a significant victory that will let immigration officials rely … ",
    "url": "https://cnn.com/2025/04/07/politics/supreme-court-deportation-flights-trump"
  },
  {
    "text": "Trump asks Supreme Court to block judge's order requiring US to bring back man who was wrongly deported  —  The Trump administration has described Abrego Garcia's deportation both as an “administrative error” and a “clerical error.”  —  The Trump administration is asking the Supreme Court … ",
    "url": "https://www.politico.com/news/2025/04/07/abrego-garcia-case-trump-deportation-el-salvador-00276237"
  },
  {
    "text": "Supreme Court allows Trump to deport Venezuelans under wartime law, but only after judges' review  —  The Supreme Court on Monday allowed the Trump administration to use an 18th century wartime law to deport Venezuelan migrants, but said they must get a court hearing before they are taken from the United States.",
    "url": "https://apnews.com/article/supreme-court-trump-deportations-el-salvador-9988b667199e1b02fc0a6a83570225c1"
  },
  {
    "text": "Supreme Court puts hold on order that deported Maryland man must be returned to US  —  Supreme Court Chief Justice John Roberts has temporarily placed on hold a judge's order that the Trump administration must bring back to the United States a Maryland father it had mistakenly deported to El Salvador.",
    "url": "https://www.usatoday.com/story/news/nation/2025/04/07/supreme-court-hold-order-return-deported-maryland-father/82979310007/"
  },
  {
    "text": "7 GOP senators sign on to bill to check Trump's trade authority  —  Seven Republican senators, including Sen. Chuck Grassley (Iowa), the Senate's president pro tempore, and Sen. Mitch McConnell (Ky.), the former Senate Republican leader, have signed on to a bipartisan bill that would require Congress … ",
    "url": "https://thehill.com/homenews/senate/5236142-congress-tariff-bill-trump/"
  },
  {
    "text": "Scoop: Trump issues veto threat on tariff bill  —  President Trump would veto the legislation introduced by Sens. Maria Cantwell (D-Wash.) and Sen. Chuck Grassley (R-Iowa) that would limit the president's authority to unilaterally impose tariffs, according to a White House statement seen by Axios.",
    "url": "https://www.axios.com/2025/04/07/trump-veto-tariff-bill-grassley"
  },
  {
    "text": "How actual ‘fake news’ caused a market whiplash  —  New York CNN  —  An errant post on X may have just shaken the stock market, showing how influential — and unreliable — the social media platform can be.  —  Unsourced “headlines” about a potential “90-day pause in tariffs” … ",
    "url": "https://cnn.com/2025/04/07/media/fake-news-x-post-caused-market-whiplash/"
  },
  {
    "text": "US Justice Dept mobilized armed Marshals to warn ex-lawyer over congressional testimony, letter shows  —  The U.S. Justice Department sent armed U.S. Marshals to deliver a letter warning a fired career pardon attorney about testifying to congressional Democrats, her lawyer said in a letter seen by Reuters on Monday.",
    "url": "https://www.reuters.com/world/us/us-justice-dept-mobilized-armed-marshals-warn-ex-lawyer-over-congressional-2025-04-07/"
  },
  {
    "text": "Trump Plans $92 Million Military Parade—Honoring Himself  —  Donald Trump may finally get his long-desired military parade through the streets of Washington.  —  The Washington City Paper, citing an unnamed D.C. source, reports that the president has chosen June 14, 2025 … ",
    "url": "https://newrepublic.com/post/193674/trump-military-parade-birthday"
  },
  {
    "text": "RFK's Anti-Vax Flock Turns on Him  —  RFK's biggest fans turn on him  —  For vaccine opponents, Robert F. Kennedy Jr.'s appointment as secretary of health and human services represented something close to nirvana.  It was a chance, finally, to take on Big Pharma and to bring … ",
    "url": "https://www.thebulwark.com/p/rfks-anti-vax-flock-turns-on-him-mmr-measles-winsome-earle-sears"
  },
  {
    "text": "UAW President Shawn Fain explains why he supports Trump's tariffs  —  President Trump's announcements on tariffs have dismayed many of his erstwhile supporters on Wall Street.  The suddenness — and steepness — of the tariffs announced last Wednesday prompted some global manufacturers … ",
    "url": "https://www.npr.org/2025/04/07/nx-s1-5352409/trump-auto-tariffs-uaw-shawn-fain"
  },
  {
    "text": "RFK Jr. says he plans to tell CDC to stop recommending fluoride in drinking water  —  The addition of low levels of fluoride to drinking water was long considered one of the greatest public health achievements of the last century.  —  / Source: The Associated Press",
    "url": "https://www.nbcnews.com/health/health-news/rfk-jr-says-plans-tell-cdc-stop-recommending-fluoride-drinking-water-rcna200127"
  },
  {
    "text": "Scoop: Schatz expands holds to more than 300 Trump nominees  —  Sen. Brian Schatz (D-Hawaii) is expanding his holds on President Trump's nominees to include an additional 50 names — along with a batch of bipartisan foreign affairs bills, Axios has learned.  —  Why it matters … ",
    "url": "https://www.axios.com/2025/04/07/schatz-holds-more-than-300-trump-nominees"
  },
  {
    "text": "Elon Musk's Secret Weapon: the US Marshals Service  —  “The risk to people's civil rights is enormous.”  —  As if Elon Musk didn't already have enough advantages, between his billions and his leverage over President Donald Trump, he appears to have another ace up his sleeve: the US Marshals Service.",
    "url": "https://www.motherjones.com/politics/2025/04/elon-musk-us-marshals-service-deputy-special-marshals-doge/"
  },
  {
    "text": "‘Wi-Fi Keeps Going Down’: Donald Trump's Return-to-Office Mandate Is Going Terribly  —  Dozens of federal employees tell WIRED the return-to-office order has resulted in widespread chaos, plummeting productivity, and significantly reduced services to the public.",
    "url": "https://www.wired.com/story/federal-workers-rto-chaos/"
  },
  {
    "text": "Stephen A. Smith No Longer Ruling Out Possibility of Running for President in 2028  —  “I've decided that I'm no longer going to close that door.  I'm gonna keep my options open.  I'm going to entertain the possibility.”  —  After some polls had shown him as one of the top candidates … ",
    "url": "https://barrettmedia.com/2025/04/07/stephen-a-smith-no-longer-ruling-out-possibility-of-running-for-president-in-2028/"
  },
  {
    "text": "Turns Out Trump Lied About Those Deportations to El Salvador … 60 Minutes' Cecelia Vega on Sunday confirmed what anyone who's been paying attention already suspected: An overwhelming majority of the Venezuelan men that Trump deported to a Salvadoran megaprison have no criminal record whatsoever.",
    "url": "https://newrepublic.com/post/193673/60-minutes-trump-deportations-el-salvador"
  },
  {
    "text": "Why America's Oligarchs May Regret Their Obedience  —  Putin's Russia shows what happens when billionaire businessmen choose to back a strongman.  —  When tech billionaires and crypto moguls hailed Donald Trump's reelection and flocked to his inauguration ceremony and ball … ",
    "url": "https://www.theatlantic.com/ideas/archive/2025/04/putin-oligarchy-trump/682287/?gift=tIHyeEUg4NM6vyxJ-5M0ENwBABroFmtbrJvOnBpye6A&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "US bishops halt partnerships with federal government on aid programs, citing funding cuts  —  The U.S. Conference of Catholic Bishops announced Monday that it is ending a half-century of partnerships with the federal government to serve refugees and children, saying the “heartbreaking” … ",
    "url": "https://apnews.com/article/catholic-bishops-refugee-resettlement-trump-administration-362231100b8e4650c00d22a75b5c6ab8"
  }
]