[
  {
    "text": "Democrats laugh off Greene's plan to force Johnson ouster vote … - “She is about to realize her inevitable irrelevance,” one senior House Democrat told Axios just minutes after Greene made her announcement.  — Another senior House Democrat cast Greene's motion as “drama that hurts Republicans.”",
    "url": "https://www.axios.com/2024/05/01/democrats-greene-vote-mike-johnson-ouster"
  },
  {
    "text": "Marjorie Taylor Greene says she's moving ahead with effort to oust Speaker Johnson  —  Her plan seems doomed to fail as Democrats said they would help save Johnson.  —  Marjorie Taylor Greene (2nd R) and Thomas Massie (R) hold a press conference outside the US Capitol in Washington, DC, on May 1, 2024.",
    "url": "https://abcnews.go.com/Politics/marjorie-taylor-greene-shes-moving-ahead-effort-oust/story?id=109802294"
  },
  {
    "text": "Back to 1968?  —  Rep. Marjorie Taylor Greene is shooting her shot, forging ahead with her doomed crusade to oust House Speaker Mike Johnson.  “I think the American people need to see a recorded vote,” she said moments ago from the steps of the Capitol.  “Does members of Congress support the Uniparty?”",
    "url": "https://www.thebulwark.com/p/back-to-1968"
  },
  {
    "text": "Trump backs surveillance and prosecution of women to enforce abortion bans  —  As part of an extensive interview with Time Magazine, former President Donald Trump expanded on what abortion access would look like in the United States in a potential second term.",
    "url": "https://popular.info/p/trump-backs-surveillance-and-prosecution"
  },
  {
    "text": "Trump's disturbing Time interview shows he has no idea abortion is a ticking time bomb for the GOP  —  Donald Trump thinks he's brilliantly found a way to evade responsibility for the backlash to overturning Roe  —  Donald Trump has said many things that should have chased him out of politics a long time ago.",
    "url": "https://www.salon.com/2024/05/01/disturbing-time-interview-shows-he-has-no-idea-abortion-is-a-ticking-time-bomb-for-the/"
  },
  {
    "text": "Democrats enter panic mode as Gaza protests erupt … - “The longer they continue, and the worse that they get, the worse it's going to be for the election overall,” one House Democrat told Axios.  — The demonstrations, the lawmaker warned, are “bringing out [the public's] most conservative side.”",
    "url": "https://www.axios.com/2024/05/01/college-protests-democrats-congress"
  },
  {
    "text": "Dueling protesters clash at UCLA hours after police clear pro-Palestinian demonstration at Columbia  —  Officers have taken protesters into custody after Columbia University called in police to end the pro-Palestinian occupation on the New York campus.  The scene unfolded shortly … ",
    "url": "https://apnews.com/article/israel-palestinian-campus-student-protests-war-c6e5549532c85f13493daa22d0d143ac"
  },
  {
    "text": "Biden Clears $6 Billion in Debt for Closed Art School's Students  — Move will help 317,000 students who attended subpar colleges  — Biden looks to deliver student-debt relief ahead of election  —  President Joe Biden is forgiving $6.1 billion in student loans for more than 300,000 attendees … ",
    "url": "https://www.bloomberg.com/news/articles/2024-05-01/student-loan-forgiveness-biden-clears-6b-for-art-institutes-attendees"
  },
  {
    "text": "United Methodists repeal longstanding ban on LGBTQ clergy  —  United Methodist delegates repealed their church's longstanding ban on LGBTQ clergy with no debate on Wednesday, removing a rule forbidding “self-avowed practicing homosexuals” from being ordained or appointed as ministers.",
    "url": "https://apnews.com/article/united-methodist-lgbtq-clergy-general-conference-acabe18fe22b6838e3005ad8895534fa"
  },
  {
    "text": "RFK Jr. is all over conservative media.  Trump's camp is concerned.  —  The independent presidential candidate is quickly becoming a thorn in Donald Trump's side.  —  Robert F. Kennedy Jr.'s increasingly frequent appearances on conservative media platforms are beginning to raise alarms at Mar-a-Lago.",
    "url": "https://www.politico.com/news/2024/05/01/rfk-jr-trump-2024-elections-00155425"
  },
  {
    "text": "Trump Is Now Raging at His Own Lawyer—and Wrecking a Big MAGA Fantasy  —  Because Donald Trump must always be seen as wielding absolute mastery over his hapless, flailing opponents, he and his propagandists want you to believe his hush-money trial in Manhattan has proven nothing but a smashing political success for him.",
    "url": "https://newrepublic.com/article/181138/trump-raging-lawyer-todd-blanche-maga-fantasy"
  },
  {
    "text": "Trump Unleashes Bizarre ‘Word Salad’ Answer During Live Nighttime TV Interview  —  The former president left many confused with his rambling answer on Fox News.  —  LOADING  —  Donald Trump has people wondering just what he was trying to say during a rambling monologue on Fox News … ",
    "url": "https://www.huffpost.com/entry/donald-trump-word-salad_n_6631f693e4b0849b2edd8d91"
  },
  {
    "text": "Israel tells U.S. it will punish Palestinian Authority if ICC issues warrants … - That investigation has been extended to the Oct. 7 attacks and the war that has been raging in Gaza since then, according to the prosecutor's office. … - U.S. and Israeli officials said Israel told … ",
    "url": "https://www.axios.com/2024/05/01/us-israel-palestinian-authority-icc-arrest-warrant"
  },
  {
    "text": "Historian says Trump lawyer “deliberatively misleading” SCOTUS: Ben Franklin “would be horrified”  —  Franklin's actual speech cited at immunity hearing “says exactly the opposite of what John Sauer was implying”  —  When Trump lawyer D. John Sauer spoke before the Supreme Court last week calling … ",
    "url": "https://www.salon.com/2024/04/30/historian-says-lawyer-deliberatively-misleading-scotus-ben-franklin-would-be-horrified/"
  },
  {
    "text": "2024 Race for the White House  —  NPR/PBS NewsHour/Marist National Poll  —  Biden and Trump Competitive in Two-Way and Multi-Candidate Fields  —  Two points separate President Joe Biden and former President Donald Trump among registered voters nationally in the 2024 Presidential Election.",
    "url": "https://maristpoll.marist.edu/polls/2024-race-for-the-white-house-may01/"
  },
  {
    "text": "Pro-Israel counter-protesters attempt to storm encampment, sparking violence  —  A counter-protester dressed in black sprays an aerosol from a cannister as they run past the metal barricade surrounding the ongoing Palestine solidarity encampment.  Around 100 counter-protesters attempted … ",
    "url": "https://dailybruin.com/2024/05/01/pro-israel-counter-protesters-attempt-to-storm-encampment-sparking-violence"
  },
  {
    "text": "SCOTUS plays dumb as Trump claims sweeping immunity  —  PN is a reader-supported publication made possible by paid subscribers.  If you aren't one, please click the button to support our independent journalism.  —  ✍️ Subscribe to Public Notice ✍️",
    "url": "https://www.publicnotice.co/p/scotus-trump-immunity-arguments-explained"
  },
  {
    "text": "San Francisco's smash-and-grab politics  —  We're hosting team trivia night at Manny's in San Francisco's Mission district.  Join Playbook co-authors Lara and Dustin for an evening of tough questions and adult beverages.  Winners will receive a Manny's gift card and POLITICO swag bag.",
    "url": "https://www.politico.com/newsletters/california-playbook/2024/05/01/san-franciscos-smash-and-grab-politics-00155373"
  },
  {
    "text": "Trump: ‘Marco has this residency problem.’  —  DONALD TRUMP'S CAMPAIGN STAFF has assembled a dozen dossiers on possible running mates, but they largely remain unopened by the presidential candidate, who's conducting his own vetting process by asking friends, consultants, and insiders whom they think he should pick and why.",
    "url": "https://www.thebulwark.com/p/trump-vp-shortlist-marco-rubio"
  },
  {
    "text": "A Huge Gender Gap Is Emerging Among Young Voters  —  It has become clear that one constituency — young voters, 18 to 29 years old — will play a key, if not pivotal, role in determining who will win the Biden-Trump rematch.  —  Four years ago, according to exit polls, voters in this age group kept Trump from winning re-election.",
    "url": "https://www.nytimes.com/2024/05/01/opinion/biden-younger-voters-gender.html"
  },
  {
    "text": "The Danger of a Small Act of Cowardice  —  The first time I photographed Gerald Ford, he was a day away from being nominated as vice president, after Spiro Agnew had resigned in disgrace.  The portrait I made ran on the cover of Time, a first for both of us.  Ford was my assignment, then he became my friend.",
    "url": "https://www.theatlantic.com/politics/archive/2024/05/gerald-ford-liz-cheney-award/678246/"
  },
  {
    "text": "Multi-state E.coli outbreak connected to walnuts: CDC  —  The Centers for Disease Control and Prevention (CDC) warned on Tuesday of an E. coli outbreak linked to organic walnuts sold in bulk that has so far infected 12 people across the states of California and Washington.",
    "url": "https://thehill.com/homenews/administration/4635317-multi-state-e-coli-outbreak-connected-to-walnuts-cdc/"
  },
  {
    "text": "The situation at Columbia was not equivalent to the Capitol attack  —  The idea that young people can't develop their own opinions is long-standing and intertwined with a right-wing view of college  —  People of a certain age will recognize the argument offered by several prominent voices as a Monet.",
    "url": "https://www.washingtonpost.com/politics/2024/05/01/columbia-campus-protests-jan6/"
  }
]