[
  {
    "text": "Person of interest in fatal shooting of UnitedHealthcare CEO Brian Thompson ID'd as Luigi Mangione, an ex-Ivy League student  —  The person of interest identified in the killing of UnitedHealthcare CEO Brian Thompson is an anti-capitalist former Ivy League student — who liked online quotes from … ",
    "url": "https://nypost.com/2024/12/09/us-news/person-of-interest-in-fatal-shooting-of-unitedhealthcare-boss-brian-thompson-idd-as-luigi-mangione-an-ex-ivy-league-student/"
  },
  {
    "text": "Here's what to know about the manhunt.  —  A man is being held for questioning in connection with last week's killing of a health insurance executive in Midtown Manhattan, according to three law enforcement officials briefed on the investigation.  —  The man was identified based on a tip … ",
    "url": "https://www.nytimes.com/live/2024/12/09/nyregion/uhc-ceo-murder-suspect"
  },
  {
    "text": "Rupert Murdoch Fails in Bid to Change Family Trust  —  A Nevada commissioner ruled resoundingly against Mr. Murdoch, who was trying to give full control of his empire to his son Lachlan and lock in Fox News's right-wing editorial slant.  —  A Nevada commissioner ruled resoundingly … ",
    "url": "https://www.nytimes.com/2024/12/09/business/media/rupert-lachlan-murdoch-family-trust.html?unlocked_article_code=1.gE4.iOYP.Rq-9tE_M2nfz&smid=url-share"
  },
  {
    "text": "Nobel Laureates Urge Senate to Turn Down Kennedy's Nomination  —  Elevating Mr. Kennedy to secretary of H.H.S. “would put the public's health in jeopardy,” more than 75 laureates wrote.  —  More than 75 Nobel Prize winners have signed a letter urging senators not to confirm Robert F. Kennedy Jr. … ",
    "url": "https://www.nytimes.com/2024/12/09/health/kennedy-hhs-nobel-laureates.html?unlocked_article_code=1.gE4.oGBh.LR5JFpV5S1fn&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "More than 75 Nobel laureates urge Senate to reject RFK Jr.  —  Seventy-seven Nobel laureates signed a letter urging the Senate to oppose the confirmation of Robert F. Kennedy Jr. to lead the Department of Health and Human Services (HHS), The New York Times reported Monday.",
    "url": "https://thehill.com/policy/healthcare/5031298-nobel-laureates-oppose-rfk-jr/"
  },
  {
    "text": "Daniel Penny acquitted in subway chokehold death of Jordan Neely  —  A Manhattan jury has cleared Daniel Penny of criminal wrongdoing in the chokehold death of Jordan Neely on a crowded subway — a caught-on-video killing that sparked fierce debate over the city's mental health system and crime underground.",
    "url": "https://nypost.com/2024/12/09/us-news/daniel-penny-cleared-of-all-charges-in-jordan-neelys-death/"
  },
  {
    "text": "Shouting match breaks out on ‘The View’ as hosts clash over Trump threat  —  Co-hosts at “The View” got into a heated debate Monday as they talked about threats from Donald Trump against his perceived foes.  —  During an interview with “Meet the Press” Sunday, Trump had argued that the members … ",
    "url": "https://www.rawstory.com/trump-revenge-2670395985/"
  },
  {
    "text": "Jason Miller says Trump's suggestion to jail Jan. 6 committee members was taken out of context  —  Jason Miller, a senior adviser to Donald Trump, on Monday sought to walk back the president-elect's recent statement that he believes the members of the House's Jan. 6 committee who investigated him should be jailed.",
    "url": "https://www.politico.com/live-updates/2024/12/09/congress/trump-jan-6-00193315"
  },
  {
    "text": "GOP Congresswoman Nancy Mace is caught on video in gross act with two women and a man  —  Her crusade against transgender bathroom access has cemented her role as a hardline culture warrior and MAGA favorite.  —  But an eye-popping video unearthed exclusively by DailyMail.com suggests … ",
    "url": "https://www.dailymail.co.uk/news/article-14152809/Nancy-Mace-caught-gross-video-two-women-man.html"
  },
  {
    "text": "Ernst Hints That She Will Not Oppose Hegseth for Defense Secretary  —  Senator Joni Ernst, an Iowa Republican who is facing re-election in 2026, appeared less skeptical after President-elect Donald Trump's supporters threatened her with political retribution.",
    "url": "https://www.nytimes.com/2024/12/09/us/politics/ernst-hegseth-defense-trump.html"
  },
  {
    "text": "Playbook PM: A Jan. 6 insider on the transition team?  —  ON THE WAY OUT THE DOOR — Interesting parting gesture from Sen. JOE MANCHIN (I-W.Va.): “I'm proud to introduce legislation with @SenPeterWelch that would establish 18-year term limits for Justices of the United States Supreme Court.”",
    "url": "https://www.politico.com/newsletters/playbook-pm/2024/12/09/a-jan-6-insider-on-the-transition-team-00132333"
  },
  {
    "text": "Trump talks ACA, abortion pills on ‘Meet the Press’  —  Health Care  —  Trump talks health care on ‘Meet the Press’  —  President-elect Trump had his first sit-down broadcast interview since he was reelected last month.  —  During the interview on NBC's “Meet the Press” Sunday night … ",
    "url": "https://thehill.com/newsletters/5031560-trump-talks-aca-abortion-pills-on-meet-the-press/"
  },
  {
    "text": "U.S. charges Assad officials with war crimes in Syria … - They're accused of “cruel and inhuman treatment on detainees under their control, including U.S. citizens, in detention facilities at the Mezzeh Military Airport (Mezzeh Prison), near Damascus, Syria,” from 2012 to 2019, per a DOJ statement Monday.",
    "url": "https://www.axios.com/2024/12/10/syria-intelligence-officials-war-crimes-justice-department"
  },
  {
    "text": "Kari Lake a top contender to become Trump's ambassador to Mexico  —  The Scoop  —  Kari Lake is a leading contender for the nomination as Donald Trump's ambassador to Mexico, two people familiar with the situation told Semafor.  —  Lake won Trump's endorsement in both her unsuccessful bids for statewide office in Arizona.",
    "url": "https://www.semafor.com/article/12/09/2024/kari-lake-a-top-contender-to-become-trumps-ambassador-to-mexico"
  },
  {
    "text": "Top ‘Washington Post’ editor kills article on deputy's departure  —  As the Washington Post newsroom awaits the appointment of a new top editor, its acting news chief intervened to block an article about the departure of its second-highest-ranking editor, a contender for the position … ",
    "url": "https://www.npr.org/2024/12/09/nx-s1-5222807/washington-post-editor-kills-article-times-bezos"
  },
  {
    "text": "Tariffs Are Trump's Tool to Consolidate His Hold on Power  —  They won't only be injurious to the U.S. economy but also to its liberal democracy because he will use them to reward friends and punish enemies  —  Donald Trump has precious few rigidly held political beliefs … ",
    "url": "https://www.theunpopulist.net/p/tariffs-are-trumps-tool-to-consolidate"
  },
  {
    "text": "US woman caught with golden gun in luggage at Sydney airport jailed for a year  —  Liliana Goodson travelled to Australia in 2023 to attend clown school with the gold-plated pistol, worth about $3,000, in her luggage  — Get our breaking news email, free app or daily news podcast",
    "url": "https://www.theguardian.com/australia-news/2024/dec/09/us-woman-caught-with-golden-gun-in-luggage-at-sydney-airport-jailed-for-a-year-ntwnfb"
  },
  {
    "text": "GOP Rep. Eyes Medicare, Social Security For DOGE Cuts: ‘We Can Move The Retirement Age Back’  —  Republican Rep. Mark Alford (R-MO) suggested Monday that Medicare and Social Security are on the table when it comes to accomplishing the Department of Government Efficienty's goal of cutting $2 trillion from the federal budget.",
    "url": "https://www.mediaite.com/tv/gop-rep-eyes-medicare-social-security-for-doge-cuts-we-can-move-the-retirement-age-back/"
  },
  {
    "text": "404 Media Objects to Texas Attorney General Ken Paxton's Subpoena to Access Our Reporting  —  In October, Texas Attorney General Ken Paxton subpoenaed 404 Media, demanding that we hand over confidential information about our reporting and an anonymous source to help the state of Texas … ",
    "url": "https://www.404media.co/404-media-objects-to-texas-attorney-general-ken-paxtons-subpoena-to-access-our-reporting/"
  },
  {
    "text": "Elon Musk's Stunning $250 Million Favor to Trump Should Wake Up Dems  —  We have now learned, belatedly, that billionaire Elon Musk spent at least $250 million to help billionaire Donald Trump win the White House.  One key part of that spending came in the form of the $20 million Musk dumped into a brazen pro-Trump propaganda campaign.",
    "url": "https://newrepublic.com/article/189147/musk-250-million-campaign-finance"
  },
  {
    "text": "Susan Wild absent from Ethics Committee meeting after Gaetz leaks to press  —  Rep. Susan Wild (Pa.), the top Democrat on the House Ethics Committee, was absent from the panel's meeting last week after being traced as the source of leaks to the press regarding the investigation into former Rep. Matt Gaetz … ",
    "url": "https://thehill.com/homenews/house/5031565-susan-wild-ethics-committee-gaetz/"
  },
  {
    "text": "Federal court blocks ACA coverage for Dreamers  —  A federal court in North Dakota has blocked Affordable Care Act (ACA) coverage for immigrants that came into the U.S. illegally as children, also known as “Dreamers.”  —  U.S. District Judge Daniel M. Traynor on Monday granted Kansas … ",
    "url": "https://thehill.com/policy/healthcare/5031527-federal-court-blocks-aca-coverage-for-dreamers/"
  },
  {
    "text": "Trump's NIH pick wants you to believe he's a victim of government censorship  —  Dr. Jay Bhattacharya made his name by claiming he was censored during the Covid pandemic.  But it never happened.  —  President-elect Donald Trump has nominated Dr. Jay Bhattacharya, a Stanford professor … ",
    "url": "https://www.msnbc.com/opinion/msnbc-opinion/jay-bhattacharya-censored-government-nih-trump-covid-rcna183120"
  },
  {
    "text": "Even the Koch Brothers Weren't This Brazen  —  Tech billionaires such as Jeff Bezos and Marc Andreessen aren't even trying to mask their politics anymore.  —  Marc Andreessen has been feeling pretty good since Election Day, and at the end of November, he went on The Joe Rogan Experience to say as much.",
    "url": "https://www.theatlantic.com/technology/archive/2024/12/tech-billionaires-trump-administration/680930/?gift=iWa_iB9lkw4UuiWbIbrWGeBaLMJojcj3uZMqwFT-HHY&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Money in Your Pockets: Governor Hochul Proposes Sending 8.6 Million New Yorkers an Inflation Refund Check as First Proposal of 2025 State of the State  —  Proposal Would Deliver $3 Billion by Taking Excess Sales Tax Revenue Driven by Inflation and Giving That Money Back to Everyday New Yorkers",
    "url": "https://www.governor.ny.gov/news/money-your-pockets-governor-hochul-proposes-sending-86-million-new-yorkers-inflation-refund"
  },
  {
    "text": "Joe and Jill Biden awkwardly ignore a beaming Kamala Harris at the Kennedy Center Honors  —  Lame duck President Biden and first lady Jill Biden ignored a beaming Vice President Kamala Harris — who was applauding enthusiastically for the couple — as they entered the Kennedy Center Honors to a standing ovation, awkward video shows.",
    "url": "https://nypost.com/2024/12/09/us-news/joe-jill-biden-ignore-kamala-harris-at-kennedy-center-honors/"
  },
  {
    "text": "Rep. Brian Mast wins Foreign Affairs gavel … - Mast, who was viewed as a dark horse candidate heading into Monday, will replace Chairman Michael McCaul (R-Texas), who is term limited out of the position. … - He has aligned more closely with Trump's position on Ukraine aid thanWagner and Wilson.",
    "url": "https://www.axios.com/2024/12/09/rep-brian-mast-wins-house-foreign-affairs-gavel"
  }
]