[
  {
    "text": "The facts about Biden's new immigration policy  —  On Tuesday, President Joe Biden announced executive actions that would impose sweeping changes to how the nation treats asylum seekers.  Anyone who attempts to cross the border outside of a designated port of entry will be considered presumptively ineligible … ",
    "url": "https://popular.info/p/the-facts-about-bidens-new-immigration"
  },
  {
    "text": "Scoop: Trump's protectors push Johnson for House vote … - Conservatives want a floor vote on a bill that would allow current or former presidents to move any state case brought against them — such as the one in New York that resulted in Trump's conviction — to federal court, according to multiple House Republican sources.",
    "url": "https://www.axios.com/2024/06/04/trump-capitol-hill-protectors-house-mike-johnson"
  },
  {
    "text": "GOP plans aggressive ‘weaponization’ investigations in wake of Trump conviction  —  House Speaker Mike Johnson vowed to use House oversight powers and other measures to target jurisdictions pursuing prosecutions of the former president.  —  Congressional Republicans returned to Washington … ",
    "url": "https://www.washingtonpost.com/politics/2024/06/04/gop-trump-house-weaponization-investigations/"
  },
  {
    "text": "Playbook: Inside Dems' Bibi breach  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  IN MEMORIAM — Ben White, a longtime POLITICO reporter and Morning Money author who also worked for CNBC, the NYT, the FT, WaPo and The Messenger, died Saturday at 52 … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/06/05/inside-dems-bibi-breach-00161702"
  },
  {
    "text": "Behind the Curtain: MAGA's jail plan … Nowhere would that be truer than at the Justice Department, which Trump wants to make his fief and retribution arm.  —  Bannon told us Bragg could be targeted using the 14th Amendment (equal protection) and Fourth Amendment (outlawing unreasonable searches … ",
    "url": "https://www.axios.com/2024/06/05/trump-alvin-bragg-election-2024-jail"
  },
  {
    "text": "Behind Closed Doors, Biden Shows Signs of Slipping  —  Participants in meetings said the 81-year-old president performed poorly at times.  The White House said Biden is sharp and his critics are playing partisan politics.  —  WASHINGTON—When President Biden met with congressional leaders … ",
    "url": "https://www.wsj.com/politics/policy/joe-biden-age-election-2024-8ee15246"
  },
  {
    "text": "Israel Secretly Targets U.S. Lawmakers With Influence Campaign on Gaza War  —  Israel's Ministry of Diaspora Affairs ordered the operation, which used fake social media accounts urging U.S. lawmakers to fund Israel's military, according to officials and documents about the effort.",
    "url": "https://www.nytimes.com/2024/06/05/technology/israel-campaign-gaza-social-media.html"
  },
  {
    "text": "Scoop: GOP campaign arm's birth control message … - The Senate on Wednesday will vote on the Right to Contraception Act, part of a push Majority Leader Chuck Schumer (D-N.Y.) has timed ahead of the second anniversary of the Supreme Court ruling overturning Roe v. Wade",
    "url": "https://www.axios.com/2024/06/04/birth-control-bill-gop-memo-democrats"
  },
  {
    "text": "Ethics panel probes Rep. Spartz over staff abuse claims  —  The Indiana Republican has drastically cut staff pay and communicated ‘with complete and total rage,’ according to complaints.  —  The House Ethics Committee has made preliminary inquiries into Rep. Victoria Spartz's treatment … ",
    "url": "https://www.politico.com/news/2024/06/04/ethics-panel-probes-rep-spartz-over-staff-abuse-claims-00161623"
  },
  {
    "text": "Colorado Republican Party issues call to burn all Pride flags  —  The party's shift toward extremism continued with a nod to an infamous anti-gay slur and an invitation to burn Pride flags.  —  COLORADO, USA — The Colorado Republican Party marked the start of Pride Month with a mass email attacking … ",
    "url": "https://www.9news.com/article/news/local/local-politics/colorado-gop-call-burn-gay-pride-flags/73-e5156582-2888-46d2-b535-d5981c149817"
  },
  {
    "text": "'It's very possible': Trump floats imprisoning his political opponents  —  Discussing his guilty verdict, Trump said his opponents were going down a “terrible path.”  —  Fresh off last week's historic guilty verdict, former President Donald Trump had a warning for his political opponents on Tuesday.",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-floats-imprisoning-political-opponents-rcna155543"
  },
  {
    "text": "US maternal mortality rate far higher than in peer nations, report finds  —  Alarming disparities persist, particularly between white and Black mothers, according to new report by Commonwealth Fund  —  The US has a far higher rate of maternal mortality than other peer wealthy nations … ",
    "url": "https://www.theguardian.com/global-development/article/2024/jun/05/maternal-mortality-rate"
  },
  {
    "text": "Alito's the tip of the iceberg: More Republicans wave Christian nationalist flag despite MAGA threat  —  Nothing innocent about the “Appeal to Heaven” flag, especially when Trump calls for the right's “breaking point”  —  When news broke late last month that Justice Samuel Alito had an … ",
    "url": "https://www.salon.com/2024/06/05/alitos-the-tip-of-the-iceberg-more-wave-christian-nationalist-flag-despite-maga/"
  },
  {
    "text": "Scoop: Dem groups to pour millions into downballot races in battleground states … - Money is already pouring into the same swing states, which will be critical to President Biden's re-election. … - The National Democratic Redistricting Committee and the States Project … ",
    "url": "https://www.axios.com/2024/06/05/emocrats-state-legislature-races-2024-election"
  },
  {
    "text": "Trump Super PAC Says It Took In Nearly $70 Million in May  —  In a memo for donors obtained by The New York Times, the group also said it viewed Pennsylvania as critical to the Trump campaign's success in November.  —  The original super PAC supporting Donald J. Trump's presidential campaign plans … ",
    "url": "https://www.nytimes.com/2024/06/05/us/politics/trump-super-pac-fundraising.html"
  },
  {
    "text": "Donald Trump Is Banned from 37 Countries as Convicted Felon, Including Major Allies Like Canada and U.K.  —  If elected president again, Trump would need special permission to enter several key countries for maintaining foreign relations  —  Donald Trump may face travel restrictions … ",
    "url": "https://people.com/donald-trump-barred-entering-37-countries-convicted-felon-8657038"
  },
  {
    "text": "Bankrolling the Big Lie  —  Since the earliest months after the January 6, 2021 insurrection, CREW's “This sedition is brought to you by...” tracker has been bringing accountability to the corporate PACs and industry groups that funnel money into the Sedition Caucus—those 147 members of Congress … ",
    "url": "https://www.citizensforethics.org/reports-investigations/crew-reports/bankrolling-the-big-lie/"
  },
  {
    "text": "Ippei Mizuhara, Shohei Ohtani's ex-interpreter, pleads guilty to stealing millions from him  —  Shohei Ohtani's former interpreter, Ippei Mizuhara, pleaded guilty to federal charges Tuesday, admitting he stole millions from the Los Angeles Dodgers' star player to pay off illegal gambling debts.",
    "url": "https://www.cbsnews.com/news/ippei-mizuhara-shohei-ohtani-former-interpreter-pleads-guilty-federal-charges/"
  }
]