[
  {
    "text": "Trump Allies Pledge ‘Holy War’ Against Taylor Swift  —  Taylor Swift hasn't even endorsed Joe Biden's 2024 campaign, but Trump is already privately grousing he's “more popular” than her  —  Singer-songwriter Taylor Swift hasn't even endorsed President Joe Biden for reelection yet.",
    "url": "https://www.rollingstone.com/politics/politics-features/donald-trump-more-popular-taylor-swift-maga-biden-1234956829/"
  },
  {
    "text": "Why Trumpers are losing it over Taylor Swift  —  Swift goes to football games to support her boyfriend, shattering MAGA brains. … MAGA this week at last found its true, final, most hated enemy.  Not Barack Obama.  Not Hilary Clinton.  Not Joe Biden.  Not even Hunter Biden.",
    "url": "https://www.publicnotice.co/p/taylor-swift-causes-trumpers-to-lose-it-kelce"
  },
  {
    "text": "Trump Risks Losing More Than Half of Swing-State Voters If Found Guilty  —  Even more voters say they won't support him if he's sent to prison.  —  More than half of swing-state voters wouldn't vote for Donald Trump if he were convicted of a crime, according to a new Bloomberg News/Morning Consult poll … ",
    "url": "https://www.bloomberg.com/news/articles/2024-01-31/trump-guilty-verdict-loses-half-of-key-state-voters-in-election-2024"
  },
  {
    "text": "As judges mull presidential immunity, Trump reaps the benefits of delay  —  For over three weeks, the D.C. Circuit has been sitting on a potentially decisive question.  —  Whether Donald Trump faces a potential prison sentence in 2024 is at the mercy of a federal appeals court that's operating … ",
    "url": "https://www.politico.com/news/2024/01/31/trump-trial-immunity-delay-00138688"
  },
  {
    "text": "Exclusive: Hotelier Robert Bigelow gives Trump $1 million for legal fees  —  Hotelier Robert Bigelow told Reuters on Tuesday he gave Republican presidential candidate Donald Trump $1 million for his legal fees and agreed to donate another $20 million to a pro-Trump outside group for campaign purposes.",
    "url": "https://www.reuters.com/world/us/donor-bigelow-gave-trump-1-mln-legal-fees-donate-20-million-more-2024-01-30/"
  },
  {
    "text": "Judge orders Tesla to undo Elon Musk's $56 billion pay package  —  The ruling by a Delaware court stems from a Tesla shareholder lawsuit over the tech billionaire's 2018 compensation package  —  A Delaware judge on Tuesday ruled that Elon Musk's generous 2018 compensation package … ",
    "url": "https://www.washingtonpost.com/technology/2024/01/30/elon-musk-pay-package/"
  },
  {
    "text": "Elon Musk cannot keep Tesla pay package worth more than $55 billion, judge rules  —  Elon Musk is not entitled to landmark compensation package awarded by Tesla's board of directors that is potentially worth more than $55 billion, a Delaware judge ruled Tuesday.",
    "url": "https://apnews.com/article/elon-musk-tesla-compensation-pay-shareholders-e75687178d1175fba36ca55bd9c4c805"
  },
  {
    "text": "Pennsylvania man arrested after allegedly decapitating his father and displaying his head on YouTube  —  In the video, which has since been removed, Justin Mohn says his father was a federal employee and refers to him as a traitor while voicing right-wing conspiracy theories.",
    "url": "https://www.nbcnews.com/news/us-news/pa-man-arrested-decapitating-father-youtube-video-rcna136509"
  },
  {
    "text": "Beheading Suspect Justin Mohn: Called For Attacks, Had Past Police Interactions & Sang That Dad Was Jealous Of Him  —  Approximately an hour before 9-1-1 received a call from a distraught woman stating that her husband's head was found inside her home, a man self-identified as 33-year-old Justin Mohn posted … ",
    "url": "https://levittownnow.com/2024/01/31/beheading-suspect-justin-mohn-called-for-attacks-had-past-police-interactions-sang-that-dad-was-jealous-of-him/"
  },
  {
    "text": "Activist who led ouster of Harvard president linked to ‘scientific racism’ journal  —  Christopher Rufo recommends a newsletter to his readers that has published several supporters of discredited genetics theory  —  Rightwing activist Christopher Rufo has links to a self-styled … ",
    "url": "https://www.theguardian.com/world/2024/jan/31/rightwing-activist-christopher-rufo-ties-scientific-racism-journal"
  },
  {
    "text": "Democrats risk a new progressive rebellion as Biden embraces border deal  —  The left isn't fuming as loudly about the bipartisan immigration talks as it is about the Israel-Hamas war — yet.  But the discontent is brewing.  —  Progressives are frustrated with President Joe Biden for embracing … ",
    "url": "https://www.politico.com/news/2024/01/31/biden-border-deal-progressives-00138687"
  },
  {
    "text": "Florida Bans Transgender Drivers From Changing ID to Match Gender  —  The memo also provides a definition for gender that states it is not about gender identity, but ‘commonly been understood’ as a synonym for sex  —  JWPlayer  —  Transgender individuals will no longer be able to change … ",
    "url": "https://themessenger.com/politics/florida-bans-transgender-drivers-from-changing-id-to-match-gender"
  },
  {
    "text": "Congressman urging Texas to ignore the Supreme Court is backed by major law firms  —  Congressman Chip Roy (R-TX) is publicly urging Texas to ignore the Supreme Court.  In previously unreported comments, Roy explained that he feared his position would push the country into “a post-constitutional world.”",
    "url": "https://popular.info/p/congressman-urging-texas-to-ignore"
  },
  {
    "text": "The ‘Profound Influence’ of Christian Extremists on Mike Johnson  —  Speaker Mike Johnson's spiritual journey reveals ties to Christian fundamentalists who support slavery.  Johnson's office won't say where he stands on that issue. … If you want to know where Republican House Speaker Mike Johnson stands … ",
    "url": "https://www.thedailybeast.com/the-profound-influence-of-christian-extremists-on-mike-johnson"
  },
  {
    "text": "U.S. winning world economic war  —  The United States economy grew faster than any other large advanced economy last year — by a wide margin — and is on track to do so again in 2024.  —  Why it matters: America's outperformance is rooted in its distinctive structural strengths, policy choices, and some luck.",
    "url": "https://www.axios.com/2024/01/31/us-economy-2024-gdp-g7-nations"
  },
  {
    "text": "Sinema's fundraising plummets as reelection decision deadline nears  —  The Arizona independent is raising less and less each quarter.  —  Sen. Kyrsten Sinema's (I-Ariz.) fundraising cratered to her lowest quarterly total yet this cycle as she stares down an April deadline to file for reelection.",
    "url": "https://www.politico.com/news/2024/01/30/kyrsten-sinema-donations-00138738"
  },
  {
    "text": "Fulton County cyberattack investigated for possible connection to Trump election case  —  The hack hasn't affected material related to the case against Trump and more than a dozen co-defendants, a district attorney's spokesperson says.  —  ATLANTA — Officials investigating the recent cyberattack … ",
    "url": "https://www.nbcnews.com/politics/politics-news/fulton-county-cyberattack-investigated-possible-connection-trump-elect-rcna136464"
  },
  {
    "text": "Syphilis Is Soaring in the U.S.  —  Cases have risen by 80 percent since 2018, the C.D.C. reported.  But chlamydia remains by far the most common sexually transmitted infection.  —  Syphilis, once nearly eliminated in the United States, continues to resurge, reaching the highest rate … ",
    "url": "https://www.nytimes.com/2024/01/30/health/syphilis-cdc.html"
  },
  {
    "text": "Disturbing Bill Would Let Arizona Legislators Ignore Election Results  —  The proposed bill would give the legislature absolute power to control the state's electoral college votes, disenfranchising millions of citizens.  —  An Arizona lawmaker who signed on to be a “fake elector” … ",
    "url": "https://www.thedailybeast.com/disturbing-bill-would-let-arizona-legislators-ignore-election-results"
  },
  {
    "text": "Pro-Life Demonstrators Found Guilty, Face Up To 11 Years In Federal Prison  —  NASHVILLE — Six pro-lifers were found guilty on Tuesday after the Biden administration charged them over a peaceful protest at a Tennessee abortion facility in 2021.  They face up to 10.5 years in prison.",
    "url": "https://www.dailywire.com/news/pro-life-demonstrators-found-guilty-face-up-to-11-years-in-federal-prison"
  },
  {
    "text": "‘Smoking gun proof’: fossil fuel industry knew of climate danger as early as 1954, documents show  —  Documents show industry-backed Air Pollution Foundation uncovered the severe harm climate change would wreak  —  The fossil fuel industry funded some of the world's most foundational climate science … ",
    "url": "https://www.theguardian.com/us-news/2024/jan/30/fossil-fuel-industry-air-pollution-fund-research-caltech-climate-change-denial"
  }
]