[
  {
    "text": "Inside Elon Musk's Plan for DOGE to Slash Government Costs  —  Mr. Musk has turned to Silicon Valley to help recruit executives who will take up unofficial positions across the federal government.  —  An unpaid group of billionaires, tech executives and some disciples of Peter Thiel … ",
    "url": "https://www.nytimes.com/2025/01/12/us/politics/elon-musk-doge-government-trump.html?unlocked_article_code=1.ok4.JXW-.m8CE_yWg6VxQ&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Pardoned by Trump, Manafort Is Back and Looking for Foreign Work  —  The president-elect's 2016 campaign chairman, four years after receiving clemency, is testing the international market with a team of Trump-linked consultants.  —  Constant Méheut and Michael Schwirtz",
    "url": "https://www.nytimes.com/2025/01/12/us/politics/trump-manafort.html?unlocked_article_code=1.ok4.k_bq.-NCsI5kUVYHV&smid=url-share"
  },
  {
    "text": "Trump Calls Officials Handling Los Angeles Wildfires ‘Incompetent’  —  Governor Gavin Newsom and Los Angeles County authorities have invited President-elect Donald J. Trump to tour the devastation, but he has not publicly responded.  —  President-elect Donald J. Trump offered fresh criticism early Sunday … ",
    "url": "https://www.nytimes.com/2025/01/12/us/trump-los-angeles-fire-newsom-bass.html"
  },
  {
    "text": "Republican congressman calls for halting of disaster relief to California  —  Warren Davidson of Ohio says aid should be withheld until the state ravaged by wildfires reforms forestry management  —  A Republican US congressman from Ohio has called for federal disaster relief to be withheld … ",
    "url": "https://www.theguardian.com/us-news/2025/jan/11/warren-davidson-republican-disaster-relief-california-wildfires"
  },
  {
    "text": "House Republican Threatens To Withhold Disaster Aid From California Amid Deadly Wildfires  —  Ohio congressman Warren Davidson's “problem” with the state's forest management appears to echo misleading claims in conservative media.  —  LOADING  —  Rep. Warren Davidson (R-Ohio) … ",
    "url": "https://www.huffpost.com/entry/warren-davidson-threatens-withhold-disaster-aid-los-angeles-wildfires_n_6783645fe4b058cbe140f029"
  },
  {
    "text": "Trump Plans a Cruel Deportation Propaganda Blitz to Scare Away Immigrants  —  The president-elect and his allies plan to take their racist Springfield terror campaign national  —  Donald Trump is coming back into office this month on a vow to initiate the “largest” mass deportation operation … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-deportation-propaganda-blitz-immigrants-1235231889/"
  },
  {
    "text": "Steve Bannon: ‘I Will Do Anything’ to Keep Elon Musk out of the White House  —  ROME — Former Breitbart News executive chairman Steve Bannon has declared war on Elon Musk, vowing to have the tech billionaire kicked out of the White House by the time Donald Trump is inaugurated.",
    "url": "https://www.breitbart.com/politics/2025/01/11/steve-bannon-i-will-do-anything-keep-elon-musk-out-white-house/"
  },
  {
    "text": "Jack Smith, Who Led Prosecutions of Trump, Resigns  —  Mr. Smith, a special counsel appointed by Attorney General Merrick B. Garland, had signaled that he would step down before Donald J. Trump's inauguration.  —  Jack Smith, the special counsel who brought two unsuccessful federal prosecutions … ",
    "url": "https://www.nytimes.com/2025/01/11/us/politics/jack-smith-special-counsel-resigns.html"
  },
  {
    "text": "Fires, Hurricanes, Extreme Weather: The Media Misses the Climate Link  —  Protesting the fossil fuel industry and their political allies can help fix the narrative, and turn disasters into opportunities for climate action … For the destruction of Asheville?  The devastation of Acapulco?",
    "url": "https://www.rollingstone.com/politics/political-commentary/los-angeles-fires-climate-media-1235232654/"
  },
  {
    "text": "Transcript: FEMA administrator Deanne Criswell on “Face the Nation with Margaret Brennan,” Jan. 12, 2025  —  The following is the full transcript of an interview with FEMA administrator Deanne Criswell on “Face the Nation with Margaret Brennan” that aired on Jan. 12, 2025.",
    "url": "https://www.cbsnews.com/news/deanne-criswell-fema-administrator-face-the-nation-transcript-01-12-2025/"
  },
  {
    "text": "Trump's expansionist designs prompt worried responses from foreign leaders  —  As some Republicans line up behind Trump's annexation threats, leaders in Greenland and Denmark are trying to de-escalate.  —  President-elect Donald Trump's fixation on expanding the nation's territory to include Greenland … ",
    "url": "https://www.washingtonpost.com/politics/2025/01/12/trump-greenland-panama-canal-expansion/"
  },
  {
    "text": "Trump's Cabinet picks are set for Senate hearings.  Here's the schedule  —  After the initial crush of personnel announcements for President-elect Donald Trump's incoming administration, now the nominations process officially begins.  —  Senate hearings are scheduled this coming week for several of Trump's picks for the Cabinet.",
    "url": "https://apnews.com/article/trump-cabinet-picks-senate-hearings-schedule-4ed7745df0eae49bad07d02d7b16805b"
  },
  {
    "text": "Biden Awards Medal of Freedom to Pope Francis  —  President Biden, a Catholic, awarded the medal with distinction to the pontiff, to whom he has turned for personal guidance.  —  President Biden awarded the Presidential Medal of Freedom with Distinction to Pope Francis on Saturday … ",
    "url": "https://www.nytimes.com/2025/01/11/us/politics/biden-medal-of-freedom-pope-francis.html"
  },
  {
    "text": "Dem senator warns ‘LA fires are preview of coming atrocities,’ claims Trump bought off by ‘Big Oil’  —  Ed Markey claims there is a ‘climate crisis’  —  As fires wreak havoc in California, Sen. Ed Markey, D-Mass., claimed in a post on X the catastrophe is “what a climate emergency looks like.”",
    "url": "https://www.foxnews.com/politics/dem-senator-warns-la-fires-preview-coming-atrocities-claiming-trump-bought-off-big-oil"
  },
  {
    "text": "Trump tells House Republicans to find a ‘fair number’ on SALT  —  New York Republicans left a meeting with the incoming president saying he supported increasing the cap on the SALT deduction.  —  New York Republicans came out of a Mar-a-Lago meeting with Donald Trump on Saturday confident … ",
    "url": "https://www.politico.com/news/2025/01/11/trump-tells-house-republicans-to-find-a-fair-number-on-salt-00197703"
  }
]