[
  {
    "text": "How Trump's Verbal Slips Could Weaken His Attacks on Biden's Age  —  Donald Trump, 77, has relentlessly attacked President Biden, 80, as too old for office.  But the former president himself has had a series of gaffes that go beyond his usual freewheeling style.",
    "url": "https://www.nytimes.com/2023/10/30/us/politics/trump-biden-age.html"
  },
  {
    "text": "Colorado Trial Will Consider Whether the 14th Amendment Disqualifies Trump  —  While some prominent constitutional experts argue that a clause in the amendment applies to former President Donald J. Trump after Jan. 6, that view is far from universal among legal scholars.",
    "url": "https://www.nytimes.com/2023/10/30/us/politics/trump-colorado-trial-14th-amendment-jan-6.html"
  },
  {
    "text": "DOJ seeks 10 years for Trump appointee who assaulted officers on Jan. 6  —  “Hell yea I'm going.  I'm a Trump appointee.  I better be there,” Federico Klein wrote ahead of the Capitol attack.  —  WASHINGTON — The Justice Department is seeking 10 years in federal prison … ",
    "url": "https://www.nbcnews.com/politics/justice-department/trump-appointee-federico-klein-jan-6-doj-10-years-sentence-memo-rcna122774"
  },
  {
    "text": "Trump maintains commanding lead in Iowa poll  —  Nikki Haley is tied with Ron DeSantis for second place in the NBC/Des Moines Register/Mediacom survey as Trump's backers remain the most committed.  —  Former President Donald Trump now leads his nearest Republican rivals by nearly 30 points in Iowa … ",
    "url": "https://www.nbcnews.com/meet-the-press/first-read/trump-maintains-commanding-lead-iowa-poll-rcna122410"
  },
  {
    "text": "McConnell goes all out as Ukraine fight fractures GOP  —  His intense lobbying effort puts the Senate GOP leader at odds with his new House counterpart, Speaker Mike Johnson.  —  Mitch McConnell is abandoning his typically cautious style when it comes to aiding Ukraine … ",
    "url": "https://www.politico.com/news/2023/10/30/mcconnell-goes-all-out-as-ukraine-fight-fractures-gop-00123966"
  },
  {
    "text": "Outraised and embattled, Lauren Boebert heads back to Colorado with a revamped campaign strategy  —  Retreating from the turmoil in Washington, D.C., Rep. Lauren Boebert arrived in bucolic southwest Colorado to turmoil of a different sort — the lingering impact of an embarrassing moment … ",
    "url": "https://apnews.com/article/boebert-gop-voters-campaign-apology-reelection-frisch-af8cf7cb563e6b97bc75f3e8b849281c"
  },
  {
    "text": "The Christofascism of Mike Johnson  —  The new House speaker is an opposition researcher's goldmine. … It took Mike Johnson just a couple days last week to rise from a relatively obscure Louisiana congressman to House speaker.  Suffice it to say his background and policy positions … ",
    "url": "https://www.publicnotice.co/p/mike-johnson-christofascism"
  },
  {
    "text": "‘Chilling’: Dem Lawmaker Says She Had Election-Denying Exchange With Mike Johnson  —  Rep. Madeleine Dean said Johnson managed to become House speaker because “very few people knew him or knew what he stands for.”  —  LOADING  —  Rep. Madeleine Dean (D-Pa.) described new House Speaker Mike Johnson … ",
    "url": "https://www.huffpost.com/entry/madeleine-dean-mike-johnson-election-denier_n_653f9f74e4b0ae2dc0b46f48"
  },
  {
    "text": "Kelly Johnson, who is married to House Speaker Mike Johnson, practices a form of Christian counseling that classifies people into ‘choleric’, ‘phlegmatic,’ and other ancient personality types purportedly ordained by God  — Kelly Johnson, the wife of House Speaker Mike Johnson, was a Christian therapist.",
    "url": "https://www.businessinsider.com/mike-johnson-wife-kelly-johnson-christian-counseling-phlegmatic-2023-10?op=1"
  },
  {
    "text": "Lawyer for Former George Santos Treasurer Says He Was Also Duped  —  A lawyer representing one of George Santos' former treasurers says he was also lied to—and the false information he provided to the media wasn't his fault.  —  When George Santos' congressional campaign came under federal investigation … ",
    "url": "https://www.thedailybeast.com/lawyer-for-former-george-santos-treasurer-says-he-was-also-duped"
  },
  {
    "text": "Kevin McCarthy gets MAGA primary challenger  —  Former Speaker Kevin McCarthy (R-Calif.) is getting a primary challenger in his reelection race for his House seat representing the state's 20th congressional district.  —  David Giglio, who previously lost a congressional bid for the state's 13th district … ",
    "url": "https://thehill.com/homenews/campaign/4283327-mccarthy-maga-gop-primary-challenger/"
  },
  {
    "text": "Israel at war: IDF operates in Gaza, frees captive soldier  —  1,400 Israelis murdered since October 7, including 315 soldiers  • Four out of 239 known hostages released by Hamas, one rescued  —  Mossad chief Barnea flies to Qatar to secure hostage release",
    "url": "https://www.jpost.com/middle-east/2023-10-30/live-updates-770764"
  },
  {
    "text": "Antisemitic threats to our community  —  Dear members of the Cornell community,  —  Earlier today, a series of horrendous, antisemitic messages threatening violence to our Jewish community and specifically naming 104 West — the home of the Center for Jewish Living — was posted on a website unaffiliated with Cornell.",
    "url": "https://statements.cornell.edu/2023/20231029-antisemitic-threats.cfm"
  },
  {
    "text": "Attorney General Ken Paxton's securities fraud trial set for April 15  —  The charges stem from accusations that in 2011 Paxton tried to solicit investors in a McKinney technology company without disclosing that it was paying him to promote its stock.  The attorney general has pleaded not guilty.",
    "url": "https://www.texastribune.org/2023/10/30/ken-paxton-securities-fraud-charges-trial/"
  }
]