[
  {
    "text": "Abundant Life Christian School shooting in Madison: 4 killed, 5 hurt  —  The suspected shooter, a juvenile believed to be a student, is also dead.  —  LIVE  —  Emergency vehicles are parked outside the Abundant Life Christian School in Madison, Wis., where multiple injuries were reported following a shooting, Dec. 16, 2024.",
    "url": "https://abcnews.go.com/US/shooting-reported-christian-school-madison-wisconsin-police/story?id=116835038"
  },
  {
    "text": "3 dead, others injured in a shooting at a private Christian school in Wisconsin  —  A student opened fire at a private Christian school Monday morning in Wisconsin, killing two people in the final week before Christmas break.  The shooter also died, police said.",
    "url": "https://apnews.com/article/wisconsin-school-shooting-498c8ad26d299602553201ad639a4a5c"
  },
  {
    "text": "Judge Denies Trump's Bid to Throw Out Conviction Over Immunity Ruling  —  Justice Juan M. Merchan thwarted one of several attempts by Donald J. Trump to clear his record of 34 felonies before returning to the White House.  —  A judge on Monday rejected Donald J. Trump's argument … ",
    "url": "https://www.nytimes.com/2024/12/16/nyregion/trump-immunity-criminal-case.html"
  },
  {
    "text": "Judge in Trump's hush money case denies bid to toss out guilty verdict  —  The president-elect had argued the charges against him should be dismissed because of a Supreme Court ruling in July on presidential immunity.  —  The New York judge who presided over Donald Trump's hush money trial denied … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/judge-trumps-hush-money-case-denies-bid-toss-guilty-verdict-rcna184434"
  },
  {
    "text": "The toxic nature of “debate me, bro” culture  —  Dan Dezner has a good blog about how even if the resistance to things like RFK Jr.'s war on vaccines is able to mostly hold the line — far from a guarantee in itself — there is a huge opportunity cost to pretending there is any legitimate … ",
    "url": "https://www.lawyersgunsmoneyblog.com/2024/12/the-toxic-nature-of-debate-me-bro-culture"
  },
  {
    "text": "Trump seeks to smooth over concerns about RFK Jr.  —  President-elect Trump tried to downplay concerns about Robert F. Kennedy Jr. on Monday, telling reporters that his nominee for Health and Human Services secretary won't be “radical.”  —  “I think he's going to be much less radical than you would think … ",
    "url": "https://thehill.com/policy/healthcare/5043243-trump-rfk-jr/"
  },
  {
    "text": "Trump passes over RFK Jr.'s daughter-in-law for CIA's No. 2 job  —  Amaryllis Fox Kennedy, a former undercover C.I.A. operative, faced strenuous opposition from some Republicans, including Sen. Tom Cotton.  —  President-elect Donald Trump has told close aides he is no longer considering … ",
    "url": "https://www.washingtonpost.com/national-security/2024/12/16/amaryllis-fox-kennedy-trump-cia/"
  },
  {
    "text": "AOC loses key vote in House Oversight race to Gerry Connolly … - The House Democratic caucus still has to vote on whether to accept the recommendation - though that ratification is rarely denied.",
    "url": "https://www.axios.com/2024/12/16/aoc-house-steering-committee-oversight-connolly"
  },
  {
    "text": "Questions ABC News Should Answer Following the $16 Million Trump Settlement … As someone who practiced press law for more than twenty years, and served as a senior executive of news organizations for just as long, I was shocked by the decision of ABC News last week to pay $16 million … ",
    "url": "https://www.cjr.org/business_of_news/questions-abc-news-should-answer-16-million-trump-settlement.php"
  },
  {
    "text": "Why ABC News settled with Donald Trump for $15 million  —  George Stephanopoulos ended Sunday's “This Week” program without any mention of him or ABC News settling Donald Trump's defamation lawsuit against them.  The suit was triggered by a segment on “This Week,” but ABC News has not reported … ",
    "url": "https://www.cnn.com/2024/12/16/media/george-stephanopoulos-trump-settlement-abc"
  },
  {
    "text": "Japan's SoftBank plans to invest $100 billion in US projects over the next four years.  —  President-elect Donald Trump joined SoftBank Group CEO Masayoshi Son to announce plans by the Japanese company to invest $100 billion in U.S. projects over the next four years.",
    "url": "https://apnews.com/article/donald-trump-softbank-investment-us-8df47668f894b5d922839d98887bbb0e"
  },
  {
    "text": "Another Federal Judge Reverses Decision To Retire, Ruins Trump's Plans To Fill His Seat  —  U.S. appeals court judge James Wynn, an Obama appointee, is the third judge to change his mind about retiring since Trump won reelection.  —  LOADING  —  WASHINGTON — For the third time since Donald Trump won … ",
    "url": "https://www.huffpost.com/entry/federal-judges-reverse-decision-retire-trump_n_67604bbbe4b000ebe4d6501a"
  },
  {
    "text": "Trudeau considering his options as leader after Freeland quits cabinet, sources say  —  Prime Minister Justin Trudeau is considering his options as leader, sources tell CTV News, after Finance Minister Chrystia Freeland revealed she will quit cabinet.  —  In an explosive resignation letter … ",
    "url": "https://www.ctvnews.ca/politics/trudeau-considering-his-options-as-leader-after-freeland-quits-cabinet-sources-say-1.7146952"
  },
  {
    "text": "The post-Biden job scramble begins  —  With help from Daniel Lippman, Jack Detsch, Maggie Miller and Sam Skove  —  Resumes are flying around Washington as President JOE BIDEN's national security team frantically searches for jobs once they're kicked out of office next month.",
    "url": "https://www.politico.com/newsletters/national-security-daily/2024/12/16/the-post-biden-job-scramble-begins-00194575"
  },
  {
    "text": "Hegseth's Guard Left the Army After the Beating of a Civilian During Training  —  John Hasenbein, who has escorted Donald J. Trump's pick for defense secretary to meetings on Capitol Hill, said he was unjustly prosecuted for the 2019 episode.  —  When Pete Hegseth visited senators on Capitol Hill … ",
    "url": "https://www.nytimes.com/2024/12/16/us/politics/hegseth-bodyguard-army.html"
  },
  {
    "text": "Prisoner CNN helped free from Syrian prison was actually notorious Assad regime torturer: report  —  The prisoner CNN helped free from a secret facility in Syria was actually a notorious member of Bashar al-Assad's forces known to torture those who refused to pay him off, according to a shocking local fact check.",
    "url": "https://nypost.com/2024/12/16/world-news/prisoner-filmed-by-cnn-being-freed-from-syrian-prison-was-actually-notorious-assad-regime-torturer-report/"
  },
  {
    "text": "Meddling for MAGA  —  Patrick Soon-Shiong, the owner of the Los Angeles Times, has dismayed staffers as he curtails critical coverage of Donald Trump.  —  Patrick Soon-Shiong's meddling at the Los Angeles Times has grown more pervasive than previously realized.",
    "url": "https://www.status.news/p/patrick-soon-shiong-los-angeles-times-donald-trump-fcad"
  },
  {
    "text": "Oh, Never Mind  —  Do you remember when candidate Donald Trump said, “Grocery prices have skyrocketed.  How can a family afford that?  So, when I win, I will immediately bring prices down.”  That was at a rally in August.  —  Or how about this: “We will end inflation and make America affordable again … ",
    "url": "https://steady.substack.com/p/oh-never-mind"
  },
  {
    "text": "Gillibrand makes a last-minute White House push for women's rights constitutional amendment  —  Democratic Sen. Kirsten Gillibrand is making an all-out push in the waning days of the Biden administration that she believes could bolster reproductive rights, calling on the president to certify … ",
    "url": "https://www.cnn.com/2024/12/16/politics/kirsten-gillibrand-equal-rights-amendment/"
  },
  {
    "text": "'There's Not A Darn Thing Anybody Can Do': Rash Of Jan. 6 Pardons Will Mean Trouble, Former Prosecutor Says  —  No president before has pardoned people who were “essentially his co-conspirators in crime,” one legal expert said.  —  LOADING  —  If you take Donald Trump at his word … ",
    "url": "https://www.huffpost.com/entry/trump-jan-6-pardons-prediction_n_67506447e4b0c23471385bc6"
  },
  {
    "text": "Trump Is Back, This Time Without Disdain  —  As his domestic critics have gotten in line, so the world has saluted his restoration, if reluctantly.  —  Almost exactly eight years ago, President-elect Trump hosted a gathering at Trump Tower for the leaders of America's biggest technology companies.",
    "url": "https://www.wsj.com/opinion/trump-is-back-this-time-without-disdain-silicon-valley-eu-50129b17?st=TaegpK&reflink=article_copyURL_share"
  },
  {
    "text": "How Democrats Lost Their Way on Immigration  —  Not long ago, immigration was a winning issue for Democrats.  When Mitt Romney lost to Barack Obama in 2012, his defeat was blamed, in part, on his hard-line stance in favor of “self-deportation”—making life so hard for immigrants that they would choose to return to their home country.",
    "url": "https://www.theatlantic.com/politics/archive/2024/12/comprehensive-immigration-reform-democrats/680996/"
  },
  {
    "text": "Sanders defends Warren comments on ‘outrageous’ UnitedHealthcare CEO killing  —  Sen. Bernie Sanders (I-Vt.) defended Sen. Elizabeth Warren (D-Mass.) for her remarks about UnitedHealthcare CEO Brian Thompson's shooting and the country's health care system, calling it “outrageous” Thompson was killed.",
    "url": "https://thehill.com/homenews/senate/5042199-sanders-defends-warren-united-healthcare-ceo-shooting/"
  }
]