[
  {
    "text": "Exclusive |  DOGE Staffer Resigns Over Racist Posts  —  A staffer for Elon Musk's Department of Government Efficiency whose access to U.S. Treasury payment systems was approved by a federal judge on Thursday has links to a deleted social-media account that advocated for racism and eugenics.",
    "url": "https://www.wsj.com/tech/doge-staffer-resigns-over-racist-posts-d9f11a93?st=AawTSB&reflink=article_copyURL_share"
  },
  {
    "text": "Scoop: Trump orders key government agency to cancel all media contracts … - The discovery, made through a U.S. government spending database that has long been publicly available, triggered erroneous theories on X about the Biden administration “funding” anti-Trump media.",
    "url": "https://www.axios.com/2025/02/06/trump-politico-subscriptions-doge-elon-musk"
  },
  {
    "text": "Note to Our Readers  —  POLITICO has been the subject of debate on X this week.  Some of it has been misinformed, and some of it has been flat-out false.  Let's set the record straight.  —  POLITICO has been the subject of debate on X this week.  Some of it has been misinformed, and some of it has been flat-out false.",
    "url": "https://www.politico.com/news/2025/02/06/politico-note-to-readers-00202917"
  },
  {
    "text": "Trump Administration Live Updates: Judge Delays Program Offering Federal Workers Incentives to Quit  —  Where Things Stand  — Judge delays resignation plan: A federal judge in Massachusetts has stopped, at least temporarily, the Trump administration's effort to get federal employees … ",
    "url": "https://www.nytimes.com/live/2025/02/06/us/president-trump-news"
  },
  {
    "text": "Deadline for Trump's federal worker buyout proposal temporarily blocked by judge  —  Washington — A federal judge on Thursday temporarily blocked the Office of Personnel Management's deadline for federal employees to accept the Trump administration's “deferred resignation” offer.",
    "url": "https://www.cbsnews.com/news/judge-temporarily-blocks-implementation-deferred-resignation-program/"
  },
  {
    "text": "Elon Musk's Demolition Crew  —  On President Donald Trump's authority alone, Elon Musk, the world's richest man, has been unleashed on federal agencies.  Employees from Musk's companies and those of his allies, as well as young staffers he's recruited, are wresting authority from career workers and commandeering computer systems.",
    "url": "https://projects.propublica.org/elon-musk-doge-tracker/"
  },
  {
    "text": "Musk's DOGE agents access sensitive personnel data, alarming security officials  —  The highly restricted data includes personally identifiable information for millions of federal employees maintained by the Office of Personnel Management.",
    "url": "https://www.washingtonpost.com/national-security/2025/02/06/elon-musk-doge-access-personnel-data-opm-security/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM4ODE4MDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQwMjAwMzk5LCJpYXQiOjE3Mzg4MTgwMDAsImp0aSI6IjMzY2FjZGU4LTk2YzUtNDMwNy1hYzhkLTU4NDE2NDE5NmY2YyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb25hbC1zZWN1cml0eS8yMDI1LzAyLzA2L2Vsb24tbXVzay1kb2dlLWFjY2Vzcy1wZXJzb25uZWwtZGF0YS1vcG0tc2VjdXJpdHkvIn0.nWJSbAT-3T8RS0msHLffPMldiE4oia6wMlED6HyqDdk&itid=gfta"
  },
  {
    "text": "Gutting USAID threatens billions of dollars for U.S. farms, businesses  —  U.S. businesses that sold goods and services to USAID are in limbo, including American farms dealing in rice, wheat and soybeans purchased as food aid.",
    "url": "https://www.washingtonpost.com/politics/2025/02/06/trump-usaid-money-american-farms/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM4ODE4MDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQwMjAwMzk5LCJpYXQiOjE3Mzg4MTgwMDAsImp0aSI6IjYwZGFiZDMzLWE4M2YtNGUyNS04ODc0LTdlNmQ1MTRjZjQyZCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzAyLzA2L3RydW1wLXVzYWlkLW1vbmV5LWFtZXJpY2FuLWZhcm1zLyJ9.IzZA6sOcleD0rgo0U0wUkl9lwBWO80i7ZXuywtWQkaM"
  },
  {
    "text": "DOGE Teen Owns ‘Tesla.Sexy LLC’ and Worked at Startup That Has Hired Convicted Hackers  —  Experts question whether Edward Coristine, a DOGE staffer who has gone by “Big Balls” online, would pass the background check typically required for access to sensitive US government systems.",
    "url": "https://www.wired.com/story/edward-coristine-tesla-sexy-path-networks-doge/"
  },
  {
    "text": "Musk associates sought to use critical Treasury payment system to shut down USAID spending, emails show  —  Four days after Donald Trump's inauguration, Elon Musk's top lieutenants at the Treasury Department asked its acting secretary, a career civil servant, to immediately shut off … ",
    "url": "https://www.cnn.com/2025/02/06/politics/elon-musk-treasury-department-payment-system/"
  },
  {
    "text": "N.C.A.A., Following Trump's Order, Excludes Transgender Athletes From Women's Sports  —  The decision, effective immediately, came a day after President Trump signed an order barring transgender girls and women from playing in women's sports at federally funded educational institutions.",
    "url": "https://www.nytimes.com/2025/02/06/us/politics/ncaa-transgender-athletes-ban.html"
  },
  {
    "text": "Judge in Seattle accuses Trump of trying to change the Constitution  —  A federal judge in Seattle has once again blocked the Trump administration's attempt to rescind birthright citizenship — the guarantee embedded in the 14th Amendment to the Constitution that every person born in the U.S. is an American citizen.",
    "url": "https://www.seattletimes.com/seattle-news/politics/judge-in-seattle-continues-block-on-trump-birthright-citizenship-order/"
  },
  {
    "text": "Elon Musk's DOGE is feeding sensitive federal data into AI to target cuts  —  At the Department of Education, the tech billionaire's team has turned to artificial intelligence to hunt for potential spending cuts —  part of a broader plan to deploy the technology across the federal government.",
    "url": "https://www.washingtonpost.com/nation/2025/02/06/elon-musk-doge-ai-department-education/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM4ODE4MDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQwMjAwMzk5LCJpYXQiOjE3Mzg4MTgwMDAsImp0aSI6ImQ5ODQzODVkLTBlMTItNDJjNi1iNWE0LWZhOWEzZmYzY2UzMyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb24vMjAyNS8wMi8wNi9lbG9uLW11c2stZG9nZS1haS1kZXBhcnRtZW50LWVkdWNhdGlvbi8ifQ.b0SqsMdUOLZwTDLjLXDMh_15BHPto1JGxkf68AwGOZE"
  },
  {
    "text": "White House Preparing Order to Cut Thousands of Federal Health Workers  —  The executive order could come as soon as next week, if the Trump administration goes ahead with plans  —  The White House is working on an executive order to fire thousands of U.S. Department of Health and Human Services workers … ",
    "url": "https://www.wsj.com/health/healthcare/white-house-preparing-order-to-cut-thousands-of-federal-health-workers-bd1e0b7f?st=jRECP9&reflink=article_copyURL_share"
  },
  {
    "text": "Trump taps televangelist kook to run new White House ‘faith’ office  —  Christian nationalism is in full swing after Donald Trump's Thursday announcement of a task force to “eradicate anti-Christian bias,” as well as a new White House Faith Office led by right-...",
    "url": "https://www.dailykos.com/stories/2025/2/6/2301871/-Trump-taps-televangelist-kook-to-run-new-White-House-faith-office"
  },
  {
    "text": "Dozens of Clinical Trials Have Been Frozen in Response to Trump's USAID Order  —  The stop-work order on U.S.A.I.D.-funded research has left thousands of people with experimental drugs and devices in their bodies, with no access to monitoring or care.  —  Asanda Zondi received a startling phone call … ",
    "url": "https://www.nytimes.com/2025/02/06/health/usaid-clinical-trials-funding-trump.html?unlocked_article_code=1.u04.9RLE.FchWQG7dLw3N&smid=url-share"
  },
  {
    "text": "JD Vance accidentally directed us to a crucial moral question  —  Theology isn't usually part of the job description for America's vice president, but that's not stopping JD Vance from giving it a try just a couple of weeks into his new position.  —  In a Fox News segment on immigration … ",
    "url": "https://www.vox.com/future-perfect/398460/jd-vance-ordo-amoris-order-love-christianity-catholic-charity"
  },
  {
    "text": "Eradicating Anti-Christian Bias  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:  —  Section 1.  Purpose and Policy.  It is the policy of the United States, and the purpose of this order … ",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/02/eradicating-anti-christian-bias/"
  },
  {
    "text": "Rubio acting director of the National Archives  —  In addition to being the Secretary of State and the acting director of USAID, Marco Rubio is also the acting archivist of the United States, according to a high-level official.  —  Per the official, Rubio has been the acting archivist since shortly … ",
    "url": "https://abcnews.go.com/Politics/live-updates/trump-second-term-live-updates/?id=118389757&entryId=118517407&cid=social_twitter_abcn"
  },
  {
    "text": "Do Democrats Have a Plan?  —  Senator Brian Schatz on how the Party should be responding to Donald Trump's breakneck assault on the government.  —  Three weeks into office, President Trump has issued a slew of controversial executive orders, fired officials across government agencies … ",
    "url": "https://www.newyorker.com/news/q-and-a/do-democrats-have-a-plan-brian-schatz"
  },
  {
    "text": "Airline Pilots in the DC Plane Crash Acted as Expected, Experts Say  —  The pilots of the American Airlines regional jet in the Washington airport collision acted as expected, aviation safety experts and other pilots said.  —  Just after 8:43 p.m. on Jan. 29, an air traffic controller … ",
    "url": "https://www.nytimes.com/2025/02/06/business/dc-plane-crash-american-airlines-pilots.html"
  },
  {
    "text": "Trump administration disbands task force targeting Russian oligarchs  —  The U.S. Justice Department under President Donald Trump is disbanding an effort started after Russia's 2022 invasion of Ukraine to enforce sanctions and target oligarchs close to the Kremlin.",
    "url": "https://www.reuters.com/world/us/trump-administration-disbands-task-force-targeting-russian-oligarchs-2025-02-06/"
  },
  {
    "text": "US immigration is gaming Google to create a mirage of mass deportations  —  Thousands of press releases about decade-old enforcement actions topped search results, all updated with a timestamp from after Trump's inauguration  —  News of mass immigration arrests has swept across the US over the past couple of weeks.",
    "url": "https://www.theguardian.com/us-news/2025/feb/06/ice-us-immigration-deportations-google"
  },
  {
    "text": "A.G. Pam Bondi says Trump sets DOJ policy, all DOJ lawyers are “his lawyers”  —  Shortly after being sworn into office on Wednesday, Attorney General Pam Bondi went from the Oval Office to the Justice Department to do President Donald Trump's bidding.  —  Immediately issuing a series of orders … ",
    "url": "https://www.lawdork.com/p/ag-pam-bondi-says-trump-sets-doj"
  },
  {
    "text": "Whole Foods says Trump's actions make union win moot  —  Amazon's grocery chain also claims organizers at a Philadelphia store illegally pressured workers ahead of the successful unionization vote.  —  Amazon-owned Whole Foods asked regulators to dismiss the results of a union election … ",
    "url": "https://www.washingtonpost.com/technology/2025/02/05/whole-foods-union-trump-labor/"
  },
  {
    "text": "Senate Republicans confirm Project 2025 co-author Russell Vought as White House budget director  —  Although Democrats have been divided on various Trump nominees, they have unified in their opposition to Vought.  —  WASHINGTON — The Senate voted along party lines Thursday to confirm Russell Vought … ",
    "url": "https://www.nbcnews.com/politics/congress/senate-republicans-confirm-russell-vought-white-house-budget-director-rcna190993"
  },
  {
    "text": "America's Unions Sue DOGE, Launch the ‘Department of People Who Work for a Living’  —  Litigation efforts are finally starting to catch up to Musk's blitzkrieg against the government. … Elon Musk has created his own fake government agency—the Department of Government Efficiency, or DOGE … ",
    "url": "https://gizmodo.com/americas-unions-sue-doge-launch-the-department-of-people-who-work-for-a-living-2000559998"
  },
  {
    "text": "The Oligarchs Who Came to Regret Supporting Hitler  —  They helped him in pursuit of profit.  Many ended up in concentration camps.  —  he was among the richest men in the world.  He made his first fortune in heavy industry.  He made his second as a media mogul.",
    "url": "https://www.theatlantic.com/ideas/archive/2025/02/hitler-oligarchs-hugenberg-nazi/681584/?gift=47TjPNd1fvywdLyCkprj-EJBlPeRkjmVd1eOOJPLmzw&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Michigan legislator says she underwent sterilization to avoid pregnancy during Trump presidency  —  Hundreds gather at the Michigan Capitol to protest Trump's politics  —  Hundreds of people gather on the steps of the Michigan State Capitol in Lansing, Mich., on Feb. 5, 2025 … ",
    "url": "https://michiganadvance.com/2025/02/06/michigan-legislator-says-she-underwent-sterilization-to-avoid-pregnancy-during-trump-presidency/"
  },
  {
    "text": "C.D.C. Posts, Then Deletes, Data on Bird Flu Spread Between Cats and People  —  The data, which appeared fleetingly online on Wednesday, confirmed transmission in two households.  Scientists called on the agency to release the full report.  —  Cats that became infected with bird flu might … ",
    "url": "https://www.nytimes.com/2025/02/06/health/cdc-bird-flu-cats-people.html"
  }
]