[
  {
    "text": "Mike Waltz out as national security adviser, but Trump says he'll be ambassador to U.N.  —  National security adviser Mike Waltz and his deputy, Alex Wong, will be leaving their posts in the Trump White House, according to multiple sources familiar with their departure.",
    "url": "https://www.cbsnews.com/news/trump-mike-waltz-alex-wong/"
  },
  {
    "text": "Trump plans to oust national security adviser Mike Waltz  —  Names for a replacement have been discussed around the West Wing for weeks.  —  President Donald Trump is planning to oust national security adviser Mike Waltz, who has lost the confidence of other administration officials … ",
    "url": "https://www.politico.com/news/2025/05/01/trump-plans-to-oust-national-security-adviser-mike-waltz-00321200"
  },
  {
    "text": "Why Trump's White House turned on Mike Waltz  —  Mike Waltz has been a dead man walking for the past month, and the outgoing national security adviser started to act like it, Trump administration sources tell Axios.  —  Why it matters: “Signalgate” badly damaged Waltz, but it wasn't his only problem.",
    "url": "https://www.axios.com/2025/05/01/mike-waltz-firing-trump-white-house"
  },
  {
    "text": "Mike Waltz, other National Security Council staffers out in latest Trump purge following Signal chat leak  —  Fox News confirmed Waltz and his deputy, Alex Wong, left the office Thursday  —  Trump administration National Security Advisor Mike Waltz and other staffers are out at the National … ",
    "url": "https://www.foxnews.com/politics/mike-waltz-other-national-security-council-staffers-out-latest-trump-purge-following-signal-chat-leak?intcmp=tw_fnc&taid=68138d4d0a593f0001991728"
  },
  {
    "text": "There Is a Way Forward: How to Defeat Trump's Power Grab  —  The first 100 days of President Trump's second term have done more damage to American democracy than anything else since the demise of Reconstruction.  Mr. Trump is attempting to create a presidency unconstrained by Congress or the courts … ",
    "url": "https://www.nytimes.com/2025/05/01/opinion/trump-100-days-opposition.html?unlocked_article_code=1.D08.Wnt3.Ah8QmwuoCnE2"
  },
  {
    "text": "Spooked By Trade Wars, Trump Officials Hoard Supplies: ‘It Would Be Stupid Not To!’  —  Some Trump administration officials are stockpiling toilet paper and food before Trump's tariffs cause prices to skyrocket … Well, many Americans aren't listening to that advice, according to survey data this year … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-officials-hoarding-supplies-trade-war-tariffs-1235329235/"
  },
  {
    "text": "Trump Town Hall Bursts Into Laughter When He Says He Hasn't Made Any Mistakes  —  NOTHING BUT WINNING  —  The president said there's nothing he would have done differently during his first 100 days in office.  —  Donald Trump's first 100 days back in office have been marked by chaos … ",
    "url": "https://www.thedailybeast.com/trump-town-hall-audience-bursts-into-laughter-when-he-says-he-hasnt-made-any-mistakes/"
  },
  {
    "text": "Trump-appointed judge says president's use of Alien Enemies Act is unlawful in first-of-its-kind ruling  —  A Donald Trump-appointed federal judge in Texas ruled that the president unlawfully invoked the Alien Enemies Act and blocked the administration from quickly deporting some alleged members of a Venezuelan gang.",
    "url": "https://cnn.com/2025/05/01/politics/alien-enemies-act-trump-rodriguez-ruling"
  },
  {
    "text": "Microsoft Drops Law Firm That Made a Deal With Trump From a Case  —  The tech giant instead engaged a firm that is fighting the president's executive orders, Jenner & Block, in a sign that those firms can still attract clients.  —  When big law firms attacked by President Trump decided … ",
    "url": "https://www.nytimes.com/2025/05/01/business/microsoft-drops-trump-compliant-law-firm.html"
  },
  {
    "text": "Robert F. Kennedy Jr will require all new vaccines to undergo placebo testing, WaPo reports  —  U.S. Health and Human Services Secretary Robert F. Kennedy Jr intends to shift the way vaccines are tested, The Washington Post reported on Wednesday, citing a spokesperson from the HHS.",
    "url": "https://www.reuters.com/business/healthcare-pharmaceuticals/robert-f-kennedy-jr-will-require-all-new-vaccines-undergo-placebo-testing-wapo-2025-05-01/"
  },
  {
    "text": "Haagen-Dazs and Buddha: Elon Musk waxes philosophical on his time with Trump  —  Musk reflected on what it has been like at the center of the U.S. DOGE Service.  At times, the man running the show wondered aloud how the show even started.  —  Elon Musk sat down in the Roosevelt Room late Wednesday afternoon … ",
    "url": "https://www.washingtonpost.com/politics/2025/05/01/hagen-dazsand-buddha-elon-musk-waxes-philosophical-his-time-with-trump/"
  },
  {
    "text": "It's Trump's Economy Now  —  Many people have complained about New York Times headlines, with reason.  All too often an equivocating, sanewashing headline belies the excellent reporting that follows.  But yesterday the Times got it right about the first-quarter decline in GDP … ",
    "url": "https://paulkrugman.substack.com/p/its-trumps-economy-now"
  },
  {
    "text": "And So It Begins: Aetna/CVS pulling out of ACA exchanges next year as GOP allows IRA subsidies to expire  —  via Bruce Japsen at Forbes, the first shoe has dropped: … Below I list the 17 states where CVS/Aetna is pulling out of the ACA market.  —  IMPORTANT: I've included my estimate … ",
    "url": "https://acasignups.net/25/05/01/and-so-it-begins-aetnacvs-pulling-out-aca-exchanges-next-year-gop-allows-ira-subsidies"
  },
  {
    "text": "Majority of public opposes GOP plan for Medicaid cuts: Poll  —  Large majorities of Americans, including Republicans, oppose federal funding cuts to Medicaid, according to a new poll from health policy research group KFF.  —  The results are yet another warning sign for congressional … ",
    "url": "https://thehill.com/policy/healthcare/5275399-gop-medicaid-cut-plan-opposition-kff-survey/"
  },
  {
    "text": "The last boats without crippling tariffs from China are arriving.  The countdown to shortages and higher prices has begun  —  New York CNN  —  Some of the last cargo ships carrying Chinese goods without crippling tariffs are currently drifting into US ports.  Come next week, though, that will change.",
    "url": "https://cnn.com/2025/05/01/business/ports-shelves-tariffs-shipping"
  },
  {
    "text": "Fact check: Trump falsely claims he warned Americans during his campaign of a tariff ‘transition period’  —  President Donald Trump falsely claimed Tuesday that he warned during his 2024 campaign that his tariffs would require Americans to experience a “transition period.”",
    "url": "https://cnn.com/2025/05/01/politics/fact-check-trump-tariff-warning"
  },
  {
    "text": "Trump Wants a New Air Force One So Badly He's Refurbishing a Qatari Plane  —  The luxury plane is being outfitted in Texas for Trump's use as his frustration mounts with Boeing  —  President Trump is done waiting for Boeing .  —  Frustrated by delays on Boeing's work to deliver a new Air Force One … ",
    "url": "https://www.wsj.com/business/airlines/air-force-one-trump-qatari-jet-l3harris-fc903838?st=szsFkZ&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Scoop: White House launches Drudge-style website to promote Trump  —  The White House has launched a new Drudge Report-like website devoted to promoting pro-Trump news stories.  —  Why it matters: The site, called White House Wire, represents the administration's latest effort to circumvent … ",
    "url": "https://www.axios.com/2025/04/30/trump-white-house-drudge-style-website-launch"
  },
  {
    "text": "Trump Administration Cancels $1 Billion in Grants for Student Mental Health  —  Congress authorized the money in a bipartisan breakthrough around addressing gun violence after a shooting at an elementary school in Uvalde, Texas, killed 19 children and two teachers.",
    "url": "https://nytimes.com/2025/05/01/us/politics/trump-mental-health-grants.html?unlocked_article_code=1.D08.-FT6.gyMf3mNjKNKw&smid=tw-share"
  },
  {
    "text": "Weekly jobless claims surge to 241,000, more than expected, in latest sign of economic trouble … WATCH NOW  —  Initial unemployment claims posted an unexpected increase last week in a potential trouble sign for the wobbling U.S. economy.  —  First-time filings for unemployment insurance totaled … ",
    "url": "https://www.cnbc.com/2025/05/01/weekly-jobless-claims-surge-to-241000.html"
  },
  {
    "text": "New Oklahoma curriculum includes pro-Trump conspiracy theories  —  Beginning in the 2025-26 school year, thousands of high school students in Oklahoma will be required to learn about President Trump's debunked claims that the 2020 election was tainted by fraud.",
    "url": "https://popular.info/p/new-oklahoma-curriculum-includes"
  },
  {
    "text": "At a Dubai Conference, Trump's Conflicts Take Center Stage  —  A deal for a state-backed Emirati firm to use a Trump-affiliated digital coin was announced in a panel that included the president's son and his business partner, who promised, “This is only the beginning.”",
    "url": "https://www.nytimes.com/2025/05/01/us/politics/trump-cryptocurrency-usd1-dubai-conference-announcement.html?unlocked_article_code=1.D08.ONb_._5tK-MNW9xSf&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "The Justice Department ended a decades-old school desegregation order.  Others are expected to fall  —  When the Justice Department lifted a school desegregation order in Louisiana this week, officials called its continued existence a “historical wrong” and suggested that others dating … ",
    "url": "https://apnews.com/article/school-segregation-order-civil-rights-justice-department-7fc5e2e4ef8e9ad4a283f563c042ae7c"
  },
  {
    "text": "The New Culture of the Right: Vital, Masculine and Intentionally Offensive  —  The left has dictated culture for decades.  Jonathan Keeperman is trying to change that.  —  Ross Douthat: There's been a lot of talk about a vibe shift since Donald Trump's election and return to office … ",
    "url": "https://www.nytimes.com/2025/05/01/opinion/right-wing-masculinity-culture.html?unlocked_article_code=1.D08.Sci5.b1OIbhTGL_Lz&smid=url-share"
  },
  {
    "text": "A small Montana town has thrived on federal jobs.  Now come Trump's cuts.  —  In this pocket of red America, locals worry that the losses at Rocky Mountain Laboratories and the Bitterroot National Forest could have dire consequences.  —  HAMILTON, Mont. — In an era of rural decline … ",
    "url": "https://www.washingtonpost.com/nation/2025/05/01/hamilton-montana-federal-government-job-cuts/"
  },
  {
    "text": "What the First 100 Days Taught Us About Resisting Trump  —  FOR ANYONE WHO WANTS to oppose the Trump administration and the damage it has been doing—from reckless firings and cuts, to a lawless deportation regime, to democratic backsliding toward authoritarianism—the first hundred days … ",
    "url": "https://www.thebulwark.com/p/what-the-first-100-days-taught-us-about-resisting-trump"
  },
  {
    "text": "Trump shut down program to end human waste backing into Alabama homes, calling it ‘illegal DEI’  —  A $26 million federal program to help residents of Lowndes County, Alabama, who have dealt with inadequate sewage systems for decades was stopped by an executive order.",
    "url": "https://www.nbcnews.com/news/nbcblk/trump-canceled-dei-program-raw-sewage-alabaman-homes-rcna201164"
  },
  {
    "text": "Trump's VA strands thousands of veterans by ending a key mortgage program  —  The U.S. Department of Veterans Affairs, as of Thursday, has ended a new mortgage-rescue program that so far has helped about 20,000 veterans avoid foreclosure and keep their homes.",
    "url": "https://www.npr.org/2025/05/01/nx-s1-5382448/va-veterans-affairs-mortgages-foreclosure-vasp"
  },
  {
    "text": "‘Bumbling F*cking Idiot!’  White House Insider Slams Trump Envoy Steve Witkoff Over Solo Putin Meetings  —  A Trump White House insider torched special envoy Steve Witkoff as a “bumbling fucking idiot” in frustration at the former real estate magnate's approach to diplomacy and, in particular … ",
    "url": "https://www.mediaite.com/news/bumbling-fcking-idiot-white-house-insider-slams-trump-envoy-steve-witkoff-over-solo-putin-meetings/"
  },
  {
    "text": "Ex-Trump Official Targeted for Investigation Loses Global Entry Status  —  Chris Krebs, a cybersecurity official in the first Trump administration, had declared that the 2020 election was conducted securely.  —  Chris Krebs, the former cybersecurity official in President Trump's first term whom … ",
    "url": "https://www.nytimes.com/2025/04/30/us/politics/chris-krebs-global-entry.html"
  },
  {
    "text": "For One Texas County, Arresting Migrants Made Big Money  —  Kinney County, along Texas' border with Mexico, collected some $1.7 million in bail from migrants who were deported before they could make their court appearances.  The money was never returned.  —  Kinney County has collected large amounts … ",
    "url": "https://www.nytimes.com/2025/05/01/us/migrants-border-bail-forfeit-kinney-county-texas.html?unlocked_article_code=1.D08.tGwV.RZYD1S9KE7y4&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Trump's HHS casts doubt on evidence supporting gender-affirming care for youth  —  The Trump administration questioned the evidence supporting gender-affirming health care for youth in a lengthy review published Thursday by the Department of Health and Human Services (HHS) … ",
    "url": "https://thehill.com/homenews/lgbtq/5277822-trump-hhs-report-transgender-youth-gender-affirming-care/"
  },
  {
    "text": "North Korea Stole Your Job  —  For years, North Korea has been secretly placing young IT workers inside Western companies.  With AI, their schemes are now more devious—and effective—than ever.  —  On paper, the first candidate looked perfect.  Thomas was from rural Tennessee … ",
    "url": "https://www.wired.com/story/north-korea-stole-your-tech-job-ai-interviews/"
  }
]