[
  {
    "text": "Statement from President Joe Biden on the Equal Rights Amendment  —  I have supported the Equal Rights Amendment for more than 50 years, and I have long been clear that no one should be discriminated against based on their sex.  We, as a nation, must affirm and protect women's full equality once and for all.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2025/01/17/statement-from-president-joe-biden-on-the-equal-rights-amendment/"
  },
  {
    "text": "Biden says the Equal Rights Amendment is law.  What happens next is unclear  —  President Biden on Friday declared that he considers the Equal Rights Amendment to the Constitution is “the law of the land,” a surprising declaration that does not have any formal force of effect … ",
    "url": "https://www.npr.org/2025/01/17/nx-s1-5264378/biden-era-national-archivist-constitution"
  },
  {
    "text": "Biden just announced there's a new constitutional amendment.  Huh?  —  Three days before leaving office, President Joe Biden has made a surprising announcement: He declared that a decades-old proposed Constitutional amendment enshrining equal rights on the basis of sex is now “the law of the land.”",
    "url": "https://www.vox.com/politics/395506/equal-rights-amendment-biden-law-land"
  },
  {
    "text": "Kennedy Sought to Stop Covid Vaccinations 6 Months After Rollout  —  Robert F. Kennedy Jr. petitioned the F.D.A. to revoke authorization of the shots at a time when they were in high demand and considered life-saving.  —  Robert F. Kennedy Jr., President-elect Donald J. Trump's choice to lead … ",
    "url": "https://www.nytimes.com/2025/01/17/health/rfk-jr-covid-vaccines.html?unlocked_article_code=1.p04.VtD-.Gp_05XPFwAE6&smid=url-share"
  },
  {
    "text": "Trump's inauguration expected to be moved indoors  —  President-elect Donald Trump's inauguration is expected to be moved indoors Monday due to dangerously cold temperatures projected in the nation's capital, multiple sources with direct knowledge of the plans told CNN.",
    "url": "https://www.cnn.com/2025/01/17/politics/inauguration-moving-indoors-cold-weather"
  },
  {
    "text": "Transition Live Updates: Trump, Citing Cold Weather, Moves Inauguration Indoors  —  Where Things Stand  — President-elect Donald J. Trump announced that he would move his inauguration ceremony inside the Capitol Rotunda on Monday because extreme cold is forecast.",
    "url": "https://www.nytimes.com/live/2025/01/17/us/trump-confirmation-hearings-news"
  },
  {
    "text": "Exclusive |  CBS Owner Discusses Settling Trump Suit, With Merger Review on Tap  —  Paramount, owner of CBS, its namesake studio and several cable channels, has a major piece of business in front of the new administration: its planned merger with Skydance Media.",
    "url": "https://www.wsj.com/business/media/cbs-owner-discusses-settling-trump-suit-with-merger-review-on-tap-a5916925?st=J6cdvU&reflink=article_copyURL_share"
  },
  {
    "text": "Vivek Ramaswamy plans to announce Ohio gubernatorial run  —  The co-leader of Trump's Department of Government Efficiency initiative plans to announce a run for Ohio governor, two people familiar with his plans said.  —  Biotech entrepreneur and former presidential candidate Vivek Ramaswamy plans … ",
    "url": "https://www.washingtonpost.com/politics/2025/01/17/vivek-ramaswamy-ohio-governor-run/"
  },
  {
    "text": "Trump to Begin Large-Scale Deportations Tuesday  —  Chicago will be early target and the government will send as many as 200 officers to carry out the operation, according to people familiar with the planning  —  The incoming Trump administration is planning a large-scale immigration raid … ",
    "url": "https://www.wsj.com/politics/policy/trump-to-begin-large-scale-deportations-tuesday-e1bd89bd?st=47HCM3&ref=paydayreport.com"
  },
  {
    "text": "CNN settles lawsuit after $5 million defamation verdict  —  CNN reached a legal settlement with a security contractor Friday after a Florida jury found the network had defamed him by suggesting he was charging “exorbitant prices” to evacuate people from Afghanistan after the U.S. withdrawal in August 2021.",
    "url": "https://www.npr.org/2025/01/17/nx-s1-5251209/cnn-defamation-afghanistan-evacuations-black-market"
  },
  {
    "text": "Florida jury says CNN defamed Navy veteran in story about endangered Afghans  —  A Florida jury on Friday found that CNN defamed a U.S. Navy veteran in a 2021 story about people paid to rescue endangered Afghans following the Taliban takeover of that country.  —  It was an unusual ruling against a media outlet in a defamation case.",
    "url": "https://apnews.com/article/cnn-guilty-defamation-afghans-137bf5dbc2d72762d29c9f7596f63ec2"
  },
  {
    "text": "As Zuckerberg Goes Around Whining About Biden, He Made Sure To First Get His New Approach Approved By Trump  —  Remember how Zuckerberg was “done with politics”?  Remember how he promised that he was going to stop doing what politicians demanded he do?  —  Now it turns out that he not only … ",
    "url": "https://www.techdirt.com/2025/01/17/as-zuckerberg-goes-around-whining-about-biden-he-made-sure-to-first-get-his-new-approach-approved-by-trump/"
  },
  {
    "text": "CNN wants to exile Jim Acosta's show to the ‘Siberia of television news’ to stop him annoying Trump  —  CNN is apparently plotting to exile star anchor Jim Acosta — a longtime antagonist of President-elect Donald Trump — to the “Siberia of television news” in a bid to “throw a bone” … ",
    "url": "https://nypost.com/2025/01/17/media/cnn-exiling-jim-acosta-to-siberia-of-tv-news-to-throw-a-bone-to-trump/"
  },
  {
    "text": "TikTok CEO thanks Trump for commitment to finding solution after court upholds ban  —  TikTok CEO Shou Chew thanked President-elect Trump on Friday for his commitment to find a solution that keeps the app available in the U.S., after the Supreme Court upheld a law requiring the platform … ",
    "url": "https://thehill.com/policy/technology/5092198-tiktok-ceo-trump-support/"
  },
  {
    "text": "Washington DC residents flee ahead of Trump inauguration: 'I can't be here'  —  Republicans and conservatives meanwhile are pouring in for celebrations with hotels being nearly 70% booked  —  Alejandra Whitney-Smith has plans for president-elect Donald Trump's inauguration next week: spend a week in a cabin without technology.",
    "url": "https://www.theguardian.com/us-news/2025/jan/17/trump-inauguration-washington-dc-residents-leave"
  },
  {
    "text": "Eric Adams, With Pardon Talk Swirling, Meets With Trump Near Mar-a-Lago  —  The New York mayor, who has expressed interest in a pardon to resolve federal corruption charges, met with President-elect Donald J. Trump and his son Eric on Friday.  —  Mayor Eric Adams of New York City met … ",
    "url": "https://www.nytimes.com/2025/01/17/nyregion/adams-trump-mar-a-lago.html"
  },
  {
    "text": "Bill Gates ‘Impressed’ With Trump's Interest in Global Health During Three-Hour Dinner  —  Microsoft co-founder says he discussed HIV, polio and global health with president-elect  —  Add Bill Gates to growing the list of billionaires dining with President-elect Donald Trump before he returns to the White House.",
    "url": "https://www.wsj.com/politics/policy/bill-gates-donald-trump-meeting-e54fc20d"
  },
  {
    "text": "Live Updates: Israeli Government Approves Gaza Cease-Fire  —  Prime Minister Benjamin Netanyahu's office said the deal, which includes the release of hostages for Palestinian prisoners, would go into effect on Sunday.  —  Here's the latest on the agreement.",
    "url": "https://www.nytimes.com/live/2025/01/17/world/israel-hamas-gaza-ceasefire"
  },
  {
    "text": "FBI assistant special agent in charge who said New Orleans attack ‘not a terrorist event’ reassigned  —  The FBI later put out a statement confirming the Bourbon Street attack was ‘terrorism’  —  The FBI assistant special agent in charge who told the media and the public the New Orleans attack was … ",
    "url": "https://www.foxnews.com/us/fbi-assistant-special-agent-charge-who-said-new-orleans-attack-not-terrorist-event-reassigned"
  },
  {
    "text": "Yellen: Debt limit will be hit day after Trump's inauguration  —  Treasury Secretary Janet Yellen on Friday said the nation will hit its debt ceiling the day after President Trump is inaugurated, and that the agency will begin “extraordinary measures” to stave off the threat of a national default.",
    "url": "https://thehill.com/business/5092786-treasury-yellen-debt-ceiling/"
  },
  {
    "text": "Exclusive: Elon Musk May Be the Latest Leader of D.C.'s Line Hotel  —  The president-elect's best new buddy hopes to snap up the hot Adams Morgan address  —  In huge pre-inauguration news, tech titan Elon Musk is slated to be the highest bidder on D.C.'s trendy Line hotel.",
    "url": "https://dc.eater.com/2025/1/17/24346186/exclusive-elon-musk-dc-line-hotel"
  },
  {
    "text": "Voters Want MAGA Lite From Trump, WSJ Poll Finds  —  Survey shows Biden leaves office with record-low approval and a badly tarnished party  —  Voters support many of the goals President-elect Donald Trump has set for his second term.  They are just not on board with all the ways he wants to accomplish them.",
    "url": "https://www.wsj.com/politics/policy/donald-trump-policy-approval-poll-849feb84?st=AdVB9g"
  },
  {
    "text": "Justice Department Statements on Supreme Court's Decision in TikTok, et al. v. Garland  —  For Immediate Release  —  The Justice Department issued the following statements from Attorney General Merrick B. Garland and Deputy Attorney General Lisa Monaco on the Supreme Court's decision in TikTok, et al. v. Garland:",
    "url": "https://www.justice.gov/opa/pr/justice-department-statements-supreme-courts-decision-tiktok-et-al-v-garland"
  },
  {
    "text": "HHS Announces 15 Additional Drugs Selected for Medicare Drug Price Negotiations in Continued Effort to Lower Prescription Drug Costs for Seniors  —  Medicare has selected 15 more drugs to negotiate directly with participating drug companies.  Building on the success of the first round of negotiations … ",
    "url": "https://www.cms.gov/newsroom/press-releases/hhs-announces-15-additional-drugs-selected-medicare-drug-price-negotiations-continued-effort-lower"
  },
  {
    "text": "A Trump-Voting Farmer's Warning: Mass Deportations Would Be a Disaster  —  Florida crackdown previews what could be in store for growers  —  Florida tomato grower Tony DiMare is all for President-elect Donald Trump slapping tariffs on the Mexican farmers who undercut him by paying workers a fraction of what he does.",
    "url": "https://www.bloomberg.com/news/features/2025-01-17/will-trump-remove-illegal-immigrants-farmers-say-deportations-raise-food-prices"
  },
  {
    "text": "Supreme Court to hear case on opting out of lessons with LGBTQ+ books  —  Parents in Montgomery Count, Maryland, want to be able to opt out of instruction on gender and sexuality that they say goes against their religious convictions.  —  January 17, 2025  —  Live updates: Trump's inauguration … ",
    "url": "https://www.washingtonpost.com/politics/2025/01/17/lgbtq-books-supreme-court-montgomery-maryland-schools-religion/"
  }
]