[
  {
    "text": "Media creates Biden “fitness” crisis  —  Robert Hur, the Republican special prosecutor assigned to investigate President Biden, is a lawyer, not a doctor.  On Thursday, Hur issued a lengthy report that came to the legal conclusion that charges against Biden for mishandling classified materials were not warranted.",
    "url": "https://popular.info/p/manufacturing-a-political-crisis"
  },
  {
    "text": "‘But His Memory’ and the slow train wreck of American democracy  —  Some night around the year 2064, when the ragtag children of the last historians huddle around a cave fire and mix up some berries and the blood of their groundhog dinner to paint crude images of what the heck ever happened … ",
    "url": "https://www.inquirer.com/opinion/commentary/biden-memory-trump-supreme-court-20240211.html"
  },
  {
    "text": "Why the Hur report triggers bad 2016 flashbacks  —  It's like James Comey and “but her emails” all over again. … Last week, Robert Hur, the special counsel charged with investigating whether President Biden mishandled classified documents, dropped a 388-page report concluding that Biden did, but not enough to warrant prosecution.",
    "url": "https://www.publicnotice.co/p/hur-report-biden-classified-docs-comey-flashback"
  },
  {
    "text": "In Trump-Biden Rematch, the Only Sure Loser Is China  —  Trump vows massive tariffs that could shrink US-China trade to practically nothing — and Biden has new restrictions ready to roll before election day  —  Donald Trump's China trade war frayed economic ties between the two global superpowers.",
    "url": "https://www.bloomberg.com/news/features/2024-02-12/trump-biden-2024-election-rematch-promises-economic-pain-for-china"
  },
  {
    "text": "Donald Trump: Taylor Swift Is ‘Disloyal’ If She Endorses President Biden … LOADING",
    "url": "https://www.huffpost.com/entry/donald-trump-taylor-swift-biden-endorsement_n_65c92cb5e4b0fb721d617f17"
  },
  {
    "text": "Nato chief says Donald Trump comments ‘undermine all of our security’  —  Watch: Trump would not protect countries from attack by Russia if they do not pay enough into Nato  —  Donald Trump's suggestion the US would not protect Nato allies failing to spend enough on defence … ",
    "url": "https://www.bbc.com/news/world-us-canada-68269354"
  },
  {
    "text": "GOP senators defy Trump by advancing foreign aid bill  —  The vote was a decisive 67-27.  —  Donald Trump spent the weekend telling senators they should not pass more unconditional U.S. foreign aid.  More than a dozen Republicans ignored him Sunday, moving forward on a bill to send $95 billion in aid to Ukraine, Israel and Taiwan.",
    "url": "https://www.politico.com/news/2024/02/11/gop-senators-defy-trump-by-advancing-foreign-aid-00140868"
  },
  {
    "text": "‘Enough to make Reagan ill’: Trump's NATO remarks under fire  —  “Honestly this seems kinda important,” said Sen. Brian Schatz.  —  Democrats and some Republicans were quick to condemn Donald Trump after the former president said Saturday night he would “encourage” Russia to attack … ",
    "url": "https://www.politico.com/news/2024/02/11/trump-nato-remarks-democrats-putin-00140848"
  },
  {
    "text": "Biden disparages Netanyahu in private but hasn't changed U.S. policy toward Israel  —  As the reported Palestinian death toll in Gaza reaches 28,000, the president continues to believe that unequivocally supporting Israel is the right policy.  —  WASHINGTON — President Joe Biden has been venting … ",
    "url": "https://www.nbcnews.com/news/investigations/biden-disparages-netanyahu-private-hasnt-changed-us-policy-israel-rcna138282"
  },
  {
    "text": "Statement From Pentagon Press Secretary Maj. Gen. Pat Ryder on Secretary of Defense Lloyd J. Austin III's Health Status  —  Pentagon Press Secretary Maj. Gen. Pat Ryder provided the following statement:  —  Today, at approximately 2:20 pm, Secretary of Defense Lloyd J. Austin III was transported … ",
    "url": "https://www.defense.gov/News/Releases/Release/Article/3673016/statement-from-pentagon-press-secretary-maj-gen-pat-ryder-on-secretary-of-defen/"
  },
  {
    "text": "Exclusive: How Biden botched the border  —  Aboard Air Force One en route to tour the southern border in January 2023, President Biden sat at the head of his conference table and exploded with fury.  — The president lit into his team, which included then-Deputy Chief of Staff Jen O'Malley Dillon … ",
    "url": "https://www.axios.com/2024/02/12/how-biden-botched-border"
  },
  {
    "text": "Dutch court orders halt to export of F-35 jet parts to Israel  —  A Dutch appeals court on Monday ordered the government to block all exports of F-35 fighter jet parts to Israel over concerns they were being used in violations of international law during Israel's Gaza offensive.",
    "url": "https://www.reuters.com/business/aerospace-defense/dutch-court-orders-halt-export-f-35-jet-parts-israel-2024-02-12/"
  },
  {
    "text": "Jack Smith's Subtle Shot at Trump Mar-a-Lago Judge Aileen Cannon  —  Federal prosecutors working on the Donald Trump Mar-a-Lago documents case are trying to convince Judge Aileen Cannon by pointing to cases she worked on at the DOJ.  —  Faced with a federal judge in the Donald Trump Mar … ",
    "url": "https://www.thedailybeast.com/jack-smiths-subtle-shot-at-trump-mar-a-lago-judge-aileen-cannon"
  },
  {
    "text": "Inside Trump's plans to deport millions from the U.S. … - If elected, Trump wants to mobilize ICE agents — along with the FBI, the Drug Enforcement Administration, federal prosecutors, the National Guard, and even state and local law enforcement officers — to carry out deportations … ",
    "url": "https://www.axios.com/2024/02/11/trump-promise-deport-millions-migrants-reality"
  }
]