[
  {
    "text": "Trump votes in his “last” election: “I don't even want to think about losing” … - He also cast doubt on the efficiency and reliability of voting machines, and called it an “absolute outrage” that key states take so long to count ballots.  — But Trump did say there will be “no violence” … ",
    "url": "https://www.axios.com/2024/11/05/trump-votes-election-fair-declare-victory"
  },
  {
    "text": "Musk to Spend Election Night With Trump  —  Elon Musk has spent $119 million on a super PAC supporting Donald Trump and held events on his behalf.  But his ownership of X is especially valuable.  —  Elon Musk plans to spend election night with former President Donald J. Trump … ",
    "url": "https://www.nytimes.com/2024/11/05/us/politics/elon-musk-trump-election-night.html"
  },
  {
    "text": "A random number generator determined the “favorite” in our forecast  —  When I say the odds in this year's presidential race are about as close as you can possibly get to 50/50, I'm not exaggerating.  —  At exactly midnight on Tuesday, I pressed the “go” button for the final time on our election model this year.",
    "url": "https://www.natesilver.net/p/a-random-number-generator-determined"
  },
  {
    "text": "How the Election Could Unfold: Four Scenarios  —  A look at plausible outcomes that might wind up seeming obvious in hindsight.  —  The 2024 election is close and deeply uncertain.  —  One reason?  On paper, neither side ought to win.  —  For Democrats, it's a textbook challenge.",
    "url": "https://www.nytimes.com/2024/11/05/upshot/election-scenarios-polls.html?unlocked_article_code=1.Xk4.9EQX.lzjBH_RZ4PO9&smid=url-share"
  },
  {
    "text": "Mike Johnson on certifying election results: ‘Everybody needs to calm down’  —  House Speaker Mike Johnson (R-La.) said “everybody needs to calm down” when asked about election certification, adding that there's been too much “emotion” and “misinformation.”  —  When asked by EWTN News … ",
    "url": "https://thehill.com/homenews/campaign/4973098-mike-johnson-certifying-election-results-everybody-needs-to-calm-down/"
  },
  {
    "text": "Non-credible bomb threats against Atlanta-area polling places were from Russia, secretary of state says  —  Several non-credible bomb threats that briefly disrupted voting at two Georgia polling places originated from Russia, Georgia Secretary of State Brad Raffensperger told reporters Tuesday.",
    "url": "https://www.cnn.com/2024/11/05/us/georgia-non-credible-bomb-threat-russia/"
  },
  {
    "text": "Vance says he's lost friends over Trump support  —  Ohio Sen. JD Vance, the Republican vice presidential nominee, said Tuesday that he's lost friends over his support for former President Trump.  —  “We can't discard friends, and we can't discard family members,” Vance said in a clip … ",
    "url": "https://thehill.com/homenews/campaign/4972658-vance-lost-friendships-trump-support/"
  },
  {
    "text": "Nicolle Wallace on Vance calling Harris ‘trash:’ ‘You just effed up’  —  MSNBC's Nicolle Wallace said Monday that Ohio Sen. JD Vance, the Republican vice presidential nominee, “effed up” by calling Vice President Harris “trash.”  —  “In my humble view, lights out,” Wallace said on “Deadline: White House.”",
    "url": "https://thehill.com/homenews/campaign/4972454-nicolle-wallace-on-vance-calling-harris-trash-you-just-effed-up/"
  },
  {
    "text": "The MAGA Propaganda Machine Has Successfully Censored Voices Calling Out its Lies  —  In 2020, the U.S. found itself in the midst of an unprecedented election—one defined not only by candidates or policies, but by a fight over what was real.  During that election, I was one of the leaders … ",
    "url": "https://www.theunpopulist.net/p/the-maga-propaganda-machine-has-successfully"
  },
  {
    "text": "Giuliani Moved Possessions From N.Y. Apartment as Creditors Closed In  —  Lawyers for the two election workers seeking to collect on a $148 million defamation judgment against Rudolph W. Giuliani found that he had largely cleared out his Upper East Side home.",
    "url": "https://www.nytimes.com/2024/11/05/us/politics/giuliani-apartment-defamation-election.html?unlocked_article_code=1.Xk4.FMaD.HRrsOdodBJn7&smid=url-share"
  },
  {
    "text": "Rudy Giuliani ordered to appear in court after missing deadline to turn over assets  —  A judge has ordered Rudy Giuliani to appear in a New York courtroom on Thursday to explain why he missed a deadline to surrender his belongings as part of a $148 million defamation judgment.",
    "url": "https://apnews.com/article/rudy-giuliani-defamation-georgia-election-workers-deadline-2417b2b46e7c573b149b1b3f448038c8"
  },
  {
    "text": "Remembering Bernie Marcus  —  BERNIE'S STORY  —  The Home Depot is deeply saddened by the passing of our beloved founder, Bernard Marcus.  To us, he was simply “Bernie.”  —  Bernie was an inspiration in many ways.  He was a master merchant and a genius with customer service.",
    "url": "https://corporate.homedepot.com/news/company/remembering-bernie-marcus"
  },
  {
    "text": "Officials warn against fake US election videos, but see little disruption  —  The FBI on Tuesday warned Americans about two new fake videos falsely citing terror threats and voter fraud, the latest in a string of disinformation that officials expect will intensify as voters head to the polls on Election Day.",
    "url": "https://www.reuters.com/world/us/fbi-warns-against-two-fake-videos-officials-combat-election-disinformation-2024-11-05/"
  },
  {
    "text": "More Than 80 Million Americans Cast Early Ballots  —  Despite sporadic mishaps, the early voting season went relatively smoothly, both in person and by mail.  —  More than 80 million voters cast an early ballot either by mail or in person in a weekslong early voting season that was defined by a relatively seamless process.",
    "url": "https://www.nytimes.com/2024/11/05/us/politics/80-million-early-votes.html"
  },
  {
    "text": "A Plaintive Cry For Election Reforms Before It's Too Late  —  A lot of things happened.  Here are some of the things.  This is TPM's Morning Memo.  Sign up for the email version.  —  It Doesn't Have To Be This Way  —  As voting wraps up across the country today, let me take a quick step … ",
    "url": "https://talkingpointsmemo.com/morning-memo/election-reforms-campaign-finance-dark-money-oligarchy"
  },
  {
    "text": "MAGA outrage over wives voting for Kamala Harris is funny — but it's also dangerous  —  When it comes to political bait, it was the tastiest sort: a cheeky ad run by Vote Common Good, and voiced by Julia Roberts, reminding women that they don't have to tell their husbands if they vote for Vice President Kamala Harris.",
    "url": "https://www.salon.com/2024/11/05/bracing-for-magas-backlash-the-strategy-behind-secret-kamala-harris-is-safety/"
  },
  {
    "text": "Man convicted in 9/11-style plot to kill Americans  —  A man accused of being a Somalian terror group operative has been convicted of a 9/11-style plot to kill Americans, the Justice Department said Monday.  —  The Justice Department said in a press release that a 34-year-old Kenyan named … ",
    "url": "https://thehill.com/regulation/court-battles/4972836-somalian-terror-group-convicted/"
  },
  {
    "text": "Trump Campaign Finishes the Election by Taking Revenge on the Media  —  With hours until the polls close, the Trump campaign is punishing reporters over critical stories either they or their outlets have written in recent days.  —  Politico had three reporters and a photographer credentialed … ",
    "url": "https://nymag.com/intelligencer/article/trump-campaign-election-media.html"
  },
  {
    "text": "Trump says Harris ‘copied my routine’ on ‘SNL’  —  Former President Trump said Monday that Vice President Harris “copied my routine” in her appearance on “Saturday Night Live” two days earlier.  —  “She uses everything I do.  She uses ... even ‘Saturday Night Live,’ they copied,” Trump said at a rally in Reading, Pa. “They copied.",
    "url": "https://thehill.com/homenews/campaign/4972350-trump-says-harris-copied-my-routine-on-snl/"
  },
  {
    "text": "Judges deny requests to block DOJ from monitoring polls  —  Federal judges denied two states' requests to bar the Justice Department (DOJ) from dispatching lawyers to monitor adherence to federal voting rights laws on Election Day.  —  Both Missouri and Texas asked federal courts to keep DOJ lawyers away from their polls.",
    "url": "https://thehill.com/regulation/court-battles/4972091-judge-wont-block-doj-election-poll-monitors/"
  },
  {
    "text": "He's an Arab mayor in Michigan.  Here's why he's unapologetically pro-Trump.  —  Dearborn Heights Mayor Bill Bazzi believes Trump is “a man of peace.” … DEARBORN HEIGHTS, Michigan — Bill Bazzi, the mayor of Dearborn Heights, was all smiles when we met in his office yesterday, on Election Day eve.",
    "url": "https://www.politico.com/news/2024/11/05/donald-trump-bill-bazzi-michigan-gaza-00187395"
  }
]