[
  {
    "text": "Senator Robert Menendez Is Indicted in New York  —  Mr. Menendez, a New Jersey Democrat, was charged six years after his trial in a different corruption case ended in a hung jury.  —  Senator Robert Menendez of New Jersey, the chairman of the Foreign Relations Committee … ",
    "url": "https://www.nytimes.com/2023/09/22/nyregion/robert-menendez-indicted.html"
  },
  {
    "text": "Andy Kim tells Menendez to resign  —  Democratic congressman: ' It doesn't matter what your job title is or your politics — no one in America is above the law'  —  Rep. Andy Kim (D-Moorestown) is calling on U.S. Senator Bob Menendez to resign following his indictment on federal corruption charges.",
    "url": "https://newjerseyglobe.com/congress/andy-kim-tells-menendez-to-resign/"
  },
  {
    "text": "Sen. Menendez, wife indicted on bribe charges as probe finds $100,000 in gold bars, prosecutors say  —  U.S. Sen. Bob Menendez of New Jersey and his wife were indicted Friday on charges that they took bribes of cash, gold bars and a luxury car for a range of corrupt acts … ",
    "url": "https://apnews.com/article/senator-menendez-indicted-729db45fcf21c42ba707c9d0139349e9"
  },
  {
    "text": "Eric Holder calls for Menendez resignation  —  Former Attorney General Eric Holder called on New Jersey Sen. Bob Menendez (D) to step down on Friday after he was indicted on bribery charges.  —  “As both a leader in the Democratic Party & the former Attorney General and given the nature of the charges … ",
    "url": "https://thehill.com/homenews/senate/4219054-eric-holder-calls-for-menendez-resignation/"
  },
  {
    "text": "Sen. Bob Menendez indicted over gifts of gold bars, car, apartment  —  Menendez has served as senator from New Jersey since 2006.  —  A federal grand jury in New York has returned an indictment against United States Sen. Bob Menendez, D-N.J., chairman of the powerful Foreign Relations Committee.",
    "url": "https://abcnews.go.com/Politics/sen-bob-menendez-indicted-gifts-gold-bars-car/story?id=103407936"
  },
  {
    "text": "Clarence Thomas Secretly Participated in Koch Network Donor Events  —  Friends of the Court: SCOTUS Justices' Beneficial Relationships With Billionaire Donors  —  Supreme Court Justice Clarence Thomas' decadeslong friendship with real estate tycoon Harlan Crow and Samuel Alito's luxury travel … ",
    "url": "https://www.propublica.org/article/clarence-thomas-secretly-attended-koch-brothers-donor-events-scotus"
  },
  {
    "text": "Katherine Clark names the Democrats' price to save Kevin McCarthy  —  The number two Democratic leader in the House reveals the conditions upon which her caucus may lend Kevin McCarthy the votes he needs to pass a CR and fend-off a potential challenge to his speakership.",
    "url": "https://www.politico.com/news/2023/09/22/pbdd-house-minority-whip-katherine-clark-dems-00117441"
  },
  {
    "text": "Playbook: How Matt Gaetz took over the House  —  Presented by With help from Eli Okun and Garrett Ross  —  DRIVING THE DAY  —  NEW SCOTUS INVESTIGATION JUST DROPPED — ProPublica is up with its latest must-read dive into ethics on the Supreme Court.  This time, the story centers … ",
    "url": "https://www.politico.com/newsletters/playbook/2023/09/22/how-matt-gaetz-took-over-the-house-00117565"
  },
  {
    "text": "America's Cities Need Republicans, and I'm Becoming One  —  While Dallas has thrived, elsewhere Democratic policies have exacerbated crime and homelessness.  —  Dallas  —  I have been mayor of Dallas for more than four years.  During that time, my priority has been to make the city safer, stronger and more vibrant.",
    "url": "https://www.wsj.com/articles/americas-cities-need-republicans-and-im-becoming-one-dallas-texas-mayor-965dbaa4?mod=followamazon"
  },
  {
    "text": "Trump lights his legal defenses on fire on Meet the Press  —  This free edition of Public Notice is made possible by paid subscribers.  If you aren't one already, please sign up to support our work.  We're currently offering free trials for all new signups.  Just click the button below.",
    "url": "https://www.publicnotice.co/p/trump-meet-the-press-legal-defenses-destroyed"
  },
  {
    "text": "Why Did Trump Lose His ‘Billion Dollar Lawyer’?  —  Nasty infighting and a brutal indictment led to Trump parting ways with “one of the finest lawyers I've ever dealt with,” says one Atlanta defense attorney  —  LAST MONTH, WHEN Donald Trump parted ways with “Billion Dollar Lawyer” … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-fulton-county-drew-findling-1234829429/"
  },
  {
    "text": "Biden's GOP debate strategy: Send Newsom  —  Joe Biden's re-election campaign is deploying California Gov. Gavin Newsom to the second Republican presidential debate next week in Simi Valley, Calif., Biden campaign advisers tell Axios.  —  Why it matters: It's the latest example … ",
    "url": "https://www.axios.com/2023/09/22/biden-deploys-newsom-gop-debate-president"
  },
  {
    "text": "UAW widens strike against GM and Stellantis but not Ford  —  Union President Shawn Fain said the UAW is broadening its strike to 38 warehouses in 20 states over lack of progress in contract talks  —  The United Auto Workers on Friday widened its strike against General Motors and Jeep-maker Stellantis … ",
    "url": "https://www.washingtonpost.com/business/2023/09/22/uaw-strike-updates-biden/"
  },
  {
    "text": "U.S. will send Ukraine ATACMS long-range missiles for the first time  —  Some in Washington had resisted supplying the weapons system, known as “attack-ems,” out of fear that would widen the war with Russia.  —  U.S to give Ukraine an additional $325 million in military aid",
    "url": "https://www.nbcnews.com/news/world/russia-ukraine-war-atacms-biden-zelenskyy-long-range-missile-rcna116876"
  },
  {
    "text": "Trump notches another delegate selection rule win in Massachusetts  —  The state Republican Party on Thursday voted to keep a winner-take-all threshold likely to benefit Trump.  —  SAUGUS, Mass. — Massachusetts Republicans just handed Donald Trump another win in his quest to tilt state delegate-selection rules in his favor.",
    "url": "https://www.politico.com/news/2023/09/22/trump-delegate-selection-rule-massachusetts-00117684"
  },
  {
    "text": "‘Waiting for him to drop out’: DeSantis' influence nosedives in Florida  —  Some party members view the once-powerful governor as weakened amid his campaign struggles.  —  TALLAHASSEE, Fla. — Florida Gov. Ron DeSantis is losing his clout in Florida.  —  College boards, stacked … ",
    "url": "https://www.politico.com/news/2023/09/22/desantis-florida-republicans-governor-elections-00117514"
  }
]