[
  {
    "text": "Firework mortars, gas cannisters stuffed inside Tesla that exploded outside Trump's Las Vegas hotel  —  Firework mortars and camp fuel canisters were found stuffed into the back of the Tesla Cybertruck that exploded outside President-elect Donald Trump's Las Vegas hotel early Wednesday … ",
    "url": "https://apnews.com/article/trump-hotel-vehicle-fire-las-vegas-ad4c171c7a6af64f08db93d9fdc2d749"
  },
  {
    "text": "Fireworks, gas tanks and camping fuel used in Tesla cybertruck explosion outside Las Vegas Trump Hotel  —  Authorities believe fireworks, gas tanks and camping fuel were connected to a detonation system controlled by the driver in the Tesla Cybertruck that exploded outside a Trump Hotel in Las Vegas Wednesday morning.",
    "url": "https://www.cnn.com/2025/01/01/us/cybertruck-fire-trump-hotel-las-vegas/"
  },
  {
    "text": "Liz Cheney Is Among 20 Chosen to Receive Presidential Citizens Medal  —  Two close advisers to President Biden will also be honored, in addition to career lawmakers who have worked across the aisle and advocates for liberal causes.  —  President Biden will award the Presidential Citizens Medal … ",
    "url": "https://www.nytimes.com/2025/01/02/us/politics/presidential-citizens-medal-liz-cheney.html"
  },
  {
    "text": "Biden is giving the 2nd highest civilian award to the leaders of the Jan. 6 congressional committee  —  President Joe Biden is bestowing the second highest civilian medal on Liz Cheney and Bennie Thompson, leaders of the congressional investigation into the Capitol riot who Donald Trump … ",
    "url": "https://apnews.com/article/biden-citizens-medals-jan-6-cheney-thompson-f725b7003ea11239b90962a8cf0d5305"
  },
  {
    "text": "Speaker Johnson faces narrowest House majority in nearly 100 years  —  Speaker Mike Johnson will face a major challenge in the new Congress - the narrowest House majority in nearly 100 years.  —  That is, if he can keep the gavel.  —  Republicans will soon control the House, Senate and White House.",
    "url": "https://www.cnn.com/politics/narrow-house-majority-congress-dg/"
  },
  {
    "text": "Democrats rage as Johnson restricts their ability to oust him … - “This makes it clear that they have no intention of working together to find common ground,” Rep. Jim McGovern (D-Mass.), the top Democrat on the House Rules Committee, said of the rules change in a statement.",
    "url": "https://www.axios.com/2025/01/02/mike-johnson-democrats-motion-to-vacate-rules"
  },
  {
    "text": "New Orleans attack suspect named, accused of killing at least 10, injuring dozens  —  The suspect accused of plowing a truck through a crowd on Bourbon Street early Wednesday morning has been identified by a law enforcement source as 42-year-old Shamsud Din Jabbar.",
    "url": "https://www.nola.com/news/crime_police/new-orleans-suspect-bourbon-street-attack/article_d90e3452-c85f-11ef-a68f-f30b3ad49828.html"
  },
  {
    "text": "The attack was the deadliest in the U.S. in more than a year.  —  Officials postponed the Sugar Bowl and said they were hunting for possible connections between the suspect, who rammed into New Year's revelers, and terrorist organizations.  —  TRANSCRIPT  —  Back  —  Deadly New Year's Day Attack in New Orleans",
    "url": "https://www.nytimes.com/live/2025/01/01/us/new-orleans-vehicle-crash?unlocked_article_code=1.l04.NOtM.UNls5FGSFORo&smid=bs-share"
  },
  {
    "text": "Texas sues to impose bigotry on the rest of the country  —  Ken Paxton's lawsuit against the NCAA is a glorified Fox News segment.  —  Donald Trump and JD Vance spent the 2024 election spewing the most rank transphobia, a tactic that should have made them pariahs but instead helped win them the presidency.",
    "url": "https://www.publicnotice.co/p/ken-paxton-ncaa-lawsuit-texas-trans-athletes"
  },
  {
    "text": "Pornhub Is Now Blocked In Almost All of the U.S. South  —  Almost two years ago, Louisiana passed a law that started a wave that's since spread across the entire U.S. south, and has changed the way people there can access adult content.  As of today, Florida, Tennessee … ",
    "url": "https://www.404media.co/pornhub-is-now-blocked-in-almost-all-of-the-u-s-south/"
  },
  {
    "text": "Cruise ship stomach bug illnesses hit 12-year high: CDC  — 14 of 16 cruise ship outbreaks caused by norovirus  — Five of the outbreaks took place in December - Norovirus prevalent in crowded, semi-enclosed spaces  —  More people experienced gastrointestinal illnesses while aboard … ",
    "url": "https://thehill.com/policy/5061889-cruise-ship-stomach-illnesses-12-year-high-cdc/"
  },
  {
    "text": "The huge stakes in a new Supreme Court case about pornography  —  Texas asks the justices to abandon longstanding First Amendment protections for sexual speech.﻿ … If you've studied First Amendment law, it's impossible not to experience déjà vu while reading the briefs … ",
    "url": "https://www.vox.com/scotus/391248/porn-supreme-court-free-speech-coalition-paxton-first-amendment"
  },
  {
    "text": "Trump plans ‘victory rally’ at Washington arena day before inauguration  —  President-elect Donald Trump plans to hold a “victory rally” at the Capital One Arena in Washington on Jan. 19, the day before he is sworn in, according to a sign-up page on his inaugural website.",
    "url": "https://www.washingtonpost.com/politics/2025/01/02/trump-administration-transition-johnson-speaker/"
  },
  {
    "text": "Here's What Trump's Mexico Invasion Plan Could Look Like  —  As Trump and his incoming administration threaten Mexican drug cartels, experts warn their plan could create more violence and put Americans in danger  —  A MQ-9 Reaper drone keeps watch above the caravan of SUVs as a pair of helicopters … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-mexico-invasion-plan-1235223266/"
  },
  {
    "text": "The Rise Of Big Potato  —  Allegations of price collusions among the potato cartel reveal the new, sophisticated methods food corporations are using to keep prices high.  —  One afternoon in April 2022, Josh Saltzman, the owner of a sports bar in Washington, D.C., opened his inbox to find … ",
    "url": "https://www.levernews.com/the-rise-of-big-potato/"
  },
  {
    "text": "Trump's election changed how Americans feel about the economy  —  Turns out America's economic gloom was fueled by something far thornier than inflation  —  It's generally a rare thing for the person you're interviewing to burst out laughing.  But that's what happened to me, recently … ",
    "url": "https://www.businessinsider.com/vibecession-is-over-fake-politics-consumer-confidence-economy-feelings-sentiment-2025-1"
  },
  {
    "text": "Trump Falsely Suggested New Orleans Suspect Was an Immigrant  —  The president-elect said on social media that he was right about fearing criminals on the other side of the border.  Officials later identified the suspect as a U.S.-born citizen and Army veteran.",
    "url": "https://www.nytimes.com/2025/01/01/us/politics/trump-new-orleans.html?unlocked_article_code=1.mE4.ofuV.W-VZBHgqNYIp&smid=url-share"
  }
]