[
  {
    "text": "Trump defends the prospect of Qatar gifting him a plane to use as Air Force One  —  President Donald Trump is ready to accept a luxury Boeing 747-8 jumbo jet as a gift from the ruling family of Qatar during his trip to the Middle East this coming week, and U.S. officials say it could be converted into a potential presidential aircraft.",
    "url": "https://apnews.com/article/trump-qatar-gift-jet-air-force-one-7f9afb461c6b3ac16fca3bb0973715ff"
  },
  {
    "text": "Qatar calls reports of pending jet gift to Trump ‘inaccurate’  —  The president might end up with a luxury jumbo jet, but it won't happen this week.  —  Qatar on Sunday denied reports that the Trump administration is preparing to accept a luxury jet from the country's royal family in the coming days.",
    "url": "https://www.politico.com/news/2025/05/11/qatar-calls-jet-gift-trump-inaccurate-00341084"
  },
  {
    "text": "Trump Is Poised to Accept a Luxury 747 From Qatar for Use as Air Force One  —  The plan raises substantial ethical issues, given the immense value of the lavishly appointed plane and that Mr. Trump intends to take ownership of it after he leaves office.  —  The Trump administration plans … ",
    "url": "https://www.nytimes.com/2025/05/11/us/politics/trump-qatar-jet-gift-air-force-one.html"
  },
  {
    "text": "Trump to accept luxury jet from Qatar to use as Air Force One  —  The Trump administration is set to accept a luxury plane from the Qatari royal family that will be retrofitted and used as Air Force One during the president's second term, two people familiar with the agreement told CNN.",
    "url": "https://cnn.com/2025/05/11/politics/trump-luxury-jet-qatar-air-force-one"
  },
  {
    "text": "Flights Could Be Disrupted Across U.S., Transportation Secretary Warns  —  After a series of problems at Newark Liberty International Airport, the secretary, Sean Duffy, said he would meet with airline leaders on Wednesday to plan to scale back Newark flights.",
    "url": "https://www.nytimes.com/2025/05/11/nyregion/newark-airport-flight-disruptions-duffy.html?unlocked_article_code=1.GU8.jg6x.m8ofFo8O4sXJ&smid=url-share"
  },
  {
    "text": "U.S. officials say ‘substantial progress’ made in China trade talks  —  The White House said it was announcing a trade deal without providing any details.  Representatives from the U.S. and China had been meeting in Switzerland.  —  Bessent: ‘Substantial progress’ in US-China trade talks",
    "url": "https://www.washingtonpost.com/business/2025/05/11/us-china-trade-talks-switzerland/"
  },
  {
    "text": "Proposal Cutting Medicaid Aims for GOP Middle Ground  —  House bill is set to include work requirements but not deeper reductions some fiscal hawks demanded  —  WASHINGTON—House Republicans are releasing their plan to cut Medicaid spending, with the program's defenders in the GOP appearing … ",
    "url": "https://www.wsj.com/politics/policy/house-republicans-medicaid-cuts-8164a810"
  },
  {
    "text": "A Common Sense Budget Reconciliation Bill  —  My committee's legislation supports U.S. innovation, strengthens Medicaid, and ends Green New Deal-style waste.  —  When President Trump took the podium for his Second Inaugural Address, he promised a “revolution of common sense” … ",
    "url": "https://www.wsj.com/opinion/a-common-sense-budget-reconciliation-bill-house-energy-and-commerce-committee-d8ab0d71"
  },
  {
    "text": "Trump Says He Will Sign Executive Order Aimed at Lowering Drug Prices  —  President wants to tie drug prices U.S. pays to those paid by other countries  —  WASHINGTON—President Trump on Sunday said he would sign an executive order aimed at lowering the cost of prescription drugs … ",
    "url": "https://www.wsj.com/politics/policy/trump-says-he-will-sign-executive-order-aimed-at-lowering-drug-prices-2a5b9b28"
  },
  {
    "text": "Trump to sign executive order he says will slash drug prices by up to 80%  —  Trump calls out Democrats and announces plans to drop prices of prescription drugs ‘almost immediately’  —  President Donald Trump announced he plans to sign an executive order on Monday that will reduce the cost … ",
    "url": "https://www.foxnews.com/politics/trump-sign-executive-order-he-says-slash-drug-prices-up-80"
  },
  {
    "text": "White South Africans Granted Refugee Status by Trump Leave for U.S.  —  Dozens of Afrikaners who claim discrimination in their home country left Johannesburg on Sunday.  Their departure for the U.S. came as the Trump administration was halting virtually all refugee admissions.",
    "url": "https://www.nytimes.com/2025/05/11/world/africa/white-south-africans-granted-refugee-status-by-trump-leave-for-us.html"
  },
  {
    "text": "Will we allow ICE to behave as a secret police?  —  I had missed the story from two weeks ago about what happened after (apparent) agents of the U.S. Immigration and Customs Enforcement (ICE), one wearing a balaclava to hide his face, seized two men at the Charlottesville, Va. courthouse.",
    "url": "https://walterolson.substack.com/p/will-we-allow-ice-to-behave-as-a"
  },
  {
    "text": "How Tariffs Are Crushing Small Businesses: ‘Nobody in Power Seems to Care’  —  Owners are laying off staff and tapping personal savings, hoping to hold out until a trade deal with China; an $8,752 fee on a $5,649 order  —  The owner of a San Francisco card-game company cashed in his money-market funds.",
    "url": "https://www.wsj.com/business/entrepreneurship/small-business-tariffs-e6dfaccb?st=YG4MXP&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Trump administration fires top copyright official days after firing Librarian of Congress  —  The Trump administration has fired the nation's top copyright official , Shira Perlmutter, days after abruptly terminating the head of the Library of Congress, which oversees the U.S. Copyright Office.",
    "url": "https://apnews.com/article/copyright-director-firing-government-trump-7ab99992a96131bce7de853b66feec68"
  },
  {
    "text": "US popularity collapses worldwide in wake of Trump's return  —  The world is more divided than ever, but there's still something (nearly) everyone agrees on: The U.S. is unloved.  —  The United States is becoming less popular globally in the aftermath of Donald Trump's return to the White House, according to new data.",
    "url": "https://www.politico.eu/article/usa-popularity-collapse-worldwide-trump-return/"
  },
  {
    "text": "Pope Leo XIV calls for peace in Ukraine and Gaza in symbolically rich blessing on Mother's Day  —  Pope Leo XIV called for a genuine and just peace in Ukraine and an immediate ceasefire in Gaza, in his first Sunday noon blessing as pontiff that featured some symbolic gestures suggesting a message of unity in a polarized Catholic Church.",
    "url": "https://apnews.com/article/vatican-pope-leo-xiv-a16ff59f75260ca8baf5d90890523766"
  },
  {
    "text": "Elon Musk's regulatory troubles have begun to melt away in Trump's second term  —  The Trump administration has halted some regulatory matters involving Musk's companies and fired people from agencies investigating Tesla, SpaceX and Neuralink.  —  Tech billionaire Elon Musk's regulatory problems have started to fade into the past.",
    "url": "https://www.nbcnews.com/tech/elon-musk/elon-musks-regulatory-issues-begun-melt-away-trumps-second-term-rcna202848"
  }
]