[
  {
    "text": "Trump Wants Us to Know He Will Stop at Nothing in 2025  —  Over the last few weeks, we've gotten a pretty good idea of what Donald Trump would do if given a second chance in the White House.  And it is neither exaggeration nor hyperbole to say that it looks an awful lot like a set … ",
    "url": "https://www.nytimes.com/2023/11/14/opinion/trump-stephen-miller-immigration.html"
  },
  {
    "text": "House Speaker Mike Johnson endorses Trump, defends ‘stolen election’ claims  — House Speaker Mike Johnson endorsed former President Donald Trump for the 2024 Republican presidential nomination for what appeared to be the first time.  — “I'm all in for President Trump,” Johnson, R-La., said on CNBC's “Squawk Box.”",
    "url": "https://www.cnbc.com/2023/11/14/speaker-mike-johnson-endorses-trump-defends-false-election-claims.html"
  },
  {
    "text": "Johnson Said in 2015 Trump Was Unfit and Could Be ‘Dangerous’ as President  —  Speaker Mike Johnson, then a Republican state lawmaker, posted on social media that Donald J. Trump lacked the character and morality to be president and could be vindictive.  —  Years before he played a lead role … ",
    "url": "https://www.nytimes.com/2023/11/14/us/politics/mike-johnson-donald-trump.html"
  },
  {
    "text": "After Trump case video leak, Georgia prosecutor seeks emergency seal for evidence  —  The Atlanta-area prosecutor leading the criminal racketeering case against former president Donald Trump and 14 allies alleging they broke the law when they sought to overturn Trump's 2020 election loss … ",
    "url": "https://www.washingtonpost.com/national-security/2023/11/14/fani-willis-trump-case-videos/"
  },
  {
    "text": "Ex-Trump allies detail efforts to overturn election in Georgia plea videos  —  A former attorney for Donald Trump has told Georgia prosecutors that a top presidential aide said to her in December 2020 that “the boss” did not plan to leave the White House “under any circumstances,” … ",
    "url": "https://www.washingtonpost.com/national-security/2023/11/13/trump-georgia-case-videos-overturn-2020-election/"
  },
  {
    "text": "Greene calls GOP colleague a p‑‑‑‑  —  Rep. Marjorie Taylor Greene (Ga.) called fellow GOP Rep. Darrell Issa (Calif.) a p‑‑‑‑ Tuesday after he attacked her for lacking the “maturity and experience” to understand the proper way to bring … ",
    "url": "https://thehill.com/homenews/house/4308930-greene-issa-house-gop/"
  },
  {
    "text": "8 Republicans Voted With All House Democrats to Block Mayorkas Impeachment  —  Democrats get by in the House with a little help from their Republican friends.  They blocked Rep. Marjorie Taylor Greene's move to force a straight up or down vote on the impeachment of DHS Secretary Mayorkas Monday night.",
    "url": "https://hotair.com/karen-townsend/2023/11/14/8-republicans-voted-with-all-house-democrats-to-block-mayorkas-impeachment-n592316"
  },
  {
    "text": "More Than 400 U.S. Officials Sign Letter Protesting Biden's Israel Policy  —  The signers, representing some 40 government agencies, reflect growing internal dissent over the administration's support of Israel's military campaign in Gaza.  —  More than 400 political appointees … ",
    "url": "https://www.nytimes.com/2023/11/14/us/politics/israel-biden-letter-gaza-cease-fire.html"
  },
  {
    "text": "Biden officials rebel against president on Israel-Hamas war, sign dissent letter  —  Hundreds of anonymous Biden administration officials are demanding a cease-fire in Gaza  —  Four hundred government officials from 40 departments and agencies within President Biden's administration signed … ",
    "url": "https://www.foxnews.com/politics/biden-officials-rebel-president-israel-hamas-war-sign-dissent-letter"
  },
  {
    "text": "Inflation was flat in October from the prior month, core CPI hits two-year low  — The consumer price index was flat in October from the previous month but increased 3.2% from a year ago.  Both were below Wall Street estimates, sparking a major rally on Wall Street.",
    "url": "https://www.cnbc.com/2023/11/14/cpi-inflation-report-october-2023.html"
  },
  {
    "text": "Mike Johnson's shutdown plan gets a hall pass from furious Freedom Caucus  —  Members of the conservative House Freedom Caucus took an official position against the two-tiered stopgap funding bill aimed at averting a government shutdown just hours before it is set to come to the floor for a vote on Tuesday.",
    "url": "https://www.axios.com/2023/11/14/freedom-caucus-mike-johnson-government-shutdown"
  },
  {
    "text": "Trump's Truth Social has lost $73 million since its launch, faces potential shutdown  — Trump Media and Technology Group, Truth Social's parent company, lost $50 million in the fiscal year ending Dec. 2022 and $23 million in the first half of 2023.  — The losses come as TMTG tries … ",
    "url": "https://www.cnbc.com/2023/11/14/trumps-truth-social-has-lost-73-million-since-its-launch-faces-potential-shutdown.html"
  },
  {
    "text": "He's a Communist Trust Fund Baby Who Inherited Millions.  Now, He's Using Daddy's Money To Harass Jews.  —  Earlier this year, avowed communist James “Fergie” Chambers secured “multiple hundreds of millions of dollars” from his family, which controls the Cox Enterprises empire.",
    "url": "https://freebeacon.com/israel/hes-a-communist-trust-fund-baby-who-inherited-millions-now-hes-using-daddys-money-to-harass-jews/"
  },
  {
    "text": "GOP lawmaker claims Kevin McCarthy elbowed him after meeting, sparking altercation  —  The former speaker denied jabbing at his colleague.  —  Representative Kevin McCarthy, a Republican from California, departs following a House Republican caucus meeting on Capitol Hill in Washington, DC, Oct. 13, 2023.",
    "url": "https://abcnews.go.com/Politics/gop-lawmaker-claims-kevin-mccarthy-elbowed-after-meeting/story?id=104879724"
  },
  {
    "text": "‘I do my best not to revisit this’: Emotional Paul Pelosi tells court of the moment he was attacked by a hammer-wielding David DePape in his own home in front of cops - having stalled him by calling 911  — DePape said he was looking for Nancy Pelosi, the then-Speaker of the House, and attacked Paul with a hammer, fracturing his skull",
    "url": "https://www.dailymail.co.uk/news/article-12745289/paul-pelosi-david-depape-attacked-san-francisco-trial-testimony.html"
  },
  {
    "text": "The alarming news progressive groups delivered to the White House  —  Top White House aides reviewed private polling showing Biden's economic message falling flat and suggesting paths toward a turnaround.  —  Earlier this fall, President Joe Biden's top aides met a pair of progressives … ",
    "url": "https://www.politico.com/news/2023/11/14/white-house-bidenomics-polling-00126982"
  },
  {
    "text": "Nearly two dozen toddlers sickened by lead linked to applesauce pouches, CDC says  —  Children ages 1 to 3 were affected, and at least one child showed a blood lead level eight times higher than the level that raises concern, the Centers for Disease Control and Prevention said.",
    "url": "https://www.nbcnews.com/health/health-news/nearly-two-dozen-toddlers-sickened-lead-linked-applesauce-pouches-cdc-rcna125067"
  },
  {
    "text": "Sen. Markwayne Mullin stands up to fight Teamsters boss during Senate hearing  —  A Senate hearing got heated on Tuesday when Sen. Markwayne Mullin (R-OK) stood up in an apparent move to physically fight Teamsters President Sean O'Brien.  —  The move came after O'Brien … ",
    "url": "https://www.washingtonexaminer.com/policy/economy/markwayne-mullin-stands-up-fight-teamsters-obrien-senate-hearing"
  },
  {
    "text": "House members left in stunned disbelief, horror by video of Hamas' attack on Israel  —  Lawmakers exited a screening of video from the Hamas attack largely in silence, several of them openly crying  —  House lawmakers were stunned into shock and disbelief by a screening on Capitol Hill of footage of Hamas' attack on Israel on Oct. 7.",
    "url": "https://jewishinsider.com/2023/11/capitol-hill-israel-hamas-attacks-footage-screening/"
  },
  {
    "text": "Dems prepare to save another GOP speaker from a shutdown  —  In a private caucus meeting, Minority Leader Hakeem Jeffries outlined all the ways Speaker Mike Johnson's spending bill was a win for the party.",
    "url": "https://www.politico.com/live-updates/2023/11/14/congress/house-dems-ready-to-bail-out-gop-again-00127034"
  },
  {
    "text": "'He'll be out': Santos' GOP critics anxiously await report they hope will help boot him  —  If it's damning, as many expect, an Ethics Committee report could provide the votes to officially sever the New York Republican from the House.  —  Rep. George Santos (R-N.Y.) has evaded two efforts this year to oust him from the House.",
    "url": "https://www.politico.com/news/2023/11/14/george-santos-ethics-report-ouster-00126887"
  },
  {
    "text": "WHO Paying Off It's Congo Rape Victims (Poorly)  —  Well before the World Health Organization was forced to deal with COVID they were dispatched to fight a significant outbreak of Ebola.  Africa was hit especially hard, particularly in Congo, so the WHO sent teams there ostensibly to provide medication and other treatments to patients.",
    "url": "https://hotair.com/jazz-shaw/2023/11/14/who-paying-off-its-congo-rape-victims-poorly-n592325"
  }
]