[
  {
    "text": "Senator Robert Menendez Is Indicted in New York  —  Mr. Menendez, a New Jersey Democrat, was charged six years after his trial in a different corruption case ended in a hung jury.  —  Senator Robert Menendez of New Jersey, the chairman of the Foreign Relations Committee … ",
    "url": "https://www.nytimes.com/2023/09/22/nyregion/robert-menendez-indicted.html"
  },
  {
    "text": "Sen. Bob Menendez indicted on bribery charges  —  The New Jersey Democrat and Senate Foreign Relations Committee chair had been under investigation for about a year.  This is his second indictment since becoming a senator.  —  Sen. Bob Menendez, D-N.J., has been indicted on federal bribery charges … ",
    "url": "https://www.nbcnews.com/politics/congress/sen-bob-menendez-indicted-federal-charges-rcna111447"
  },
  {
    "text": "Andy Kim tells Menendez to resign  —  Democratic congressman: ' It doesn't matter what your job title is or your politics — no one in America is above the law'  —  Rep. Andy Kim (D-Moorestown) is calling on U.S. Senator Bob Menendez to resign following his indictment on federal corruption charges.",
    "url": "https://newjerseyglobe.com/congress/andy-kim-tells-menendez-to-resign/"
  },
  {
    "text": "Sen. Menendez, wife indicted on bribe charges as probe finds $100,000 in gold bars, prosecutors say  —  U.S. Sen. Bob Menendez of New Jersey and his wife were indicted Friday on charges that they took bribes of cash, gold bars and a luxury car for a range of corrupt acts … ",
    "url": "https://apnews.com/article/senator-menendez-indicted-729db45fcf21c42ba707c9d0139349e9"
  },
  {
    "text": "Schumer in talks with McConnell as shutdown fears grow: ‘We may now have to go first’  —  Watch CNN Chief Congressional Correspondent Manu Raju's interview with Senate Majority Leader Chuck Schumer this Sunday at 11 a.m. ET/8 a.m. PT on CNN's “Inside Politics”.  —  CNN  —",
    "url": "https://www.cnn.com/2023/09/22/politics/chuck-schumer-senate-government-funding-tv/"
  },
  {
    "text": "Katherine Clark names the Democrats' price to save Kevin McCarthy  —  The number two Democratic leader in the House reveals the conditions upon which her caucus may lend Kevin McCarthy the votes he needs to pass a CR and fend-off a potential challenge to his speakership.",
    "url": "https://www.politico.com/news/2023/09/22/pbdd-house-minority-whip-katherine-clark-dems-00117441"
  },
  {
    "text": "Clarence Thomas Secretly Participated in Koch Network Donor Events  —  Friends of the Court: SCOTUS Justices' Beneficial Relationships With Billionaire Donors  —  Supreme Court Justice Clarence Thomas' decadeslong friendship with real estate tycoon Harlan Crow and Samuel Alito's luxury travel … ",
    "url": "https://www.propublica.org/article/clarence-thomas-secretly-attended-koch-brothers-donor-events-scotus"
  },
  {
    "text": "America's Cities Need Republicans, and I'm Becoming One  —  While Dallas has thrived, elsewhere Democratic policies have exacerbated crime and homelessness.  —  Dallas  —  I have been mayor of Dallas for more than four years.  During that time, my priority has been to make the city safer, stronger and more vibrant.",
    "url": "https://www.wsj.com/articles/americas-cities-need-republicans-and-im-becoming-one-dallas-texas-mayor-965dbaa4?mod=followamazon"
  },
  {
    "text": "Biden to join the picket line in UAW strike  —  His decision to stand alongside the striking workers represents perhaps the most significant display of union solidarity ever by a sitting president.  —  President Joe Biden will travel to Michigan to join the picket line of auto workers on strike nationwide, he said on Friday afternoon.",
    "url": "https://www.politico.com/news/2023/09/22/biden-to-join-the-picket-line-in-uaw-strike-00117749"
  },
  {
    "text": "Why Did Trump Lose His ‘Billion Dollar Lawyer’?  —  Nasty infighting and a brutal indictment led to Trump parting ways with “one of the finest lawyers I've ever dealt with,” says one Atlanta defense attorney  —  LAST MONTH, WHEN Donald Trump parted ways with “Billion Dollar Lawyer” … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-fulton-county-drew-findling-1234829429/"
  },
  {
    "text": "Trump lights his legal defenses on fire on Meet the Press  —  This free edition of Public Notice is made possible by paid subscribers.  If you aren't one already, please sign up to support our work.  We're currently offering free trials for all new signups.  Just click the button below.",
    "url": "https://www.publicnotice.co/p/trump-meet-the-press-legal-defenses-destroyed"
  },
  {
    "text": "Biden's GOP debate strategy: Send Newsom  —  Joe Biden's re-election campaign is deploying California Gov. Gavin Newsom to the second Republican presidential debate next week in Simi Valley, Calif., Biden campaign advisers tell Axios.  —  Why it matters: It's the latest example … ",
    "url": "https://www.axios.com/2023/09/22/biden-deploys-newsom-gop-debate-president"
  },
  {
    "text": "Jack Smith adds war crimes prosecutor — his deputy from the Hague — to special counsel team  —  The special counsel's office is gearing up to put Donald Trump on trial in two criminal cases next year.  —  Special counsel Jack Smith has added a veteran war crimes prosecutor … ",
    "url": "https://www.politico.com/news/2023/09/22/jack-smith-special-counsel-prosecutor-trump-00117736"
  },
  {
    "text": "U.S. will send Ukraine ATACMS long-range missiles for the first time  —  Some in Washington had resisted supplying the weapons system, known as “attack-ems,” out of fear that would widen the war with Russia.  —  U.S to give Ukraine an additional $325 million in military aid",
    "url": "https://www.nbcnews.com/news/world/russia-ukraine-war-atacms-biden-zelenskyy-long-range-missile-rcna116876"
  },
  {
    "text": "Former White House staffer Cassidy Hutchinson says Trump is “dangerous for the country”  —  Cassidy Hutchinson, a former senior advisor to White House chief of staff Mark Meadows, made international headlines when she testified before the House Select Committee to Investigate the January 6 Attack.",
    "url": "https://www.cbsnews.com/news/former-white-house-staffer-cassidy-hutchinson-says-trump-is-dangerous-for-the-country/"
  },
  {
    "text": "Nebraska Mother Gets Prison For Giving Abortion Pills To Pregnant Daughter  —  The woman was sentenced Friday to two years in prison for assisting her teen daughter with an abortion and helping to conceal it.  —  LOADING  —  A Nebraska mother who pleaded guilty to giving her teenage daughter pills … ",
    "url": "https://www.huffpost.com/entry/ap-us-abortion-charges-nebraska_n_650de46be4b0e83cc0dad7cc"
  }
]