[
  {
    "text": "Trump, asked if he has to ‘uphold the Constitution,’ says, 'I don't know'  —  Trump said on NBC News' “Meet the Press” that he's following lawyers' advice as he tries to execute rapid deportations, arguing that giving immigrants due process is time-consuming.",
    "url": "https://www.nbcnews.com/politics/trump-administration/trump-asked-uphold-constitution-says-dont-know-rcna204580"
  },
  {
    "text": "Trump says, 'I don't know,' when asked if he's required to uphold Constitution  —  The president also downplayed fears of a recession and spoke of potential successors when his four-year term ends in an NBC interview.  —  WEST PALM BEACH, Fla. — President Donald Trump … ",
    "url": "https://www.washingtonpost.com/politics/2025/05/04/trump-nbc-interview-constitution-economy/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ2MzMxMjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ3NzEzNTk5LCJpYXQiOjE3NDYzMzEyMDAsImp0aSI6IjQ0NzE5NGM5LWMzOWMtNGIzMC05ZWRkLWJjMjBiMWM3NTM5MyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzA1LzA0L3RydW1wLW5iYy1pbnRlcnZpZXctY29uc3RpdHV0aW9uLWVjb25vbXkvIn0.ts5YWWrQEfp-OXw7r84u2vY5gmzwSiqLWI-3Joier-Q&itid=gfta"
  },
  {
    "text": "Trump Administration Live Updates: President Casts Doubt on Due Process Rights  —  Where Things Stand  — Trump on due process: President Trump said in an interview aired on Sunday that he did not know whether every person on American soil was entitled to due process … ",
    "url": "https://www.nytimes.com/live/2025/05/04/us/trump-news"
  },
  {
    "text": "Trump's 48-hour scramble to fly migrants to a Salvadoran prison  —  The administration rounded up some of the Venezuelans two days before the flights took off, pressing forward even as Venezuela agreed to accept deportees.  —  The message from Secretary of State Marco Rubio … ",
    "url": "https://www.washingtonpost.com/immigration/2025/05/04/trump-el-salvador-alien-enemies-act-venezuelans/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ2MzMxMjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ3NzEzNTk5LCJpYXQiOjE3NDYzMzEyMDAsImp0aSI6IjhhOTQ4MDU5LTU2YjQtNGQyZC1hZDQ0LTVmNWJlNDkzNDMzNiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9pbW1pZ3JhdGlvbi8yMDI1LzA1LzA0L3RydW1wLWVsLXNhbHZhZG9yLWFsaWVuLWVuZW1pZXMtYWN0LXZlbmV6dWVsYW5zLyJ9.NX0-UlQELrhci3ft5ktVwQ1VpmPffOelKB_JoptGd_0&itid=gfta"
  },
  {
    "text": "Eight arrested in two separate anti-terror operations  —  Eight men, including seven Iranian nationals, have been arrested in two separate counter-terrorism police investigations.  —  Five were arrested at various locations around England on Saturday as part of a “pre-planned” … ",
    "url": "https://www.bbc.com/news/articles/cx2wqy5ejdjo"
  },
  {
    "text": "Voice of America's fate still in flux after appeals court pauses back-to-work orders  —  Less than two months ago, when the Trump administration turned off the Voice of America's networks and websites, Kari Lake, a fierce loyalist to President Donald Trump, said the agency is “unsalvageable.”",
    "url": "https://cnn.com/2025/05/03/media/voice-of-america-return-trump-lake"
  },
  {
    "text": "Elon Musk's Starbase on its way to becoming a Texas city after lopsided early voting results  —  The South Texas home of Elon Musk's SpaceX rocket company is on its way to becoming an official city with a galactic name: Starbase.  A vote Saturday to formally organize Starbase as a city … ",
    "url": "https://apnews.com/article/elon-musk-starbase-texas-city-7863bf3bac65e9718eef19b27978933b"
  },
  {
    "text": "Justice Department lawyers face skeptical judges upset by ‘shoddy work’  —  As they defend against more than 200 lawsuits challenging President Donald Trump's initiatives, some government lawyers are getting scolded from the bench.  —  Justice Department lawyers defending … ",
    "url": "https://www.washingtonpost.com/politics/2025/05/04/trump-policies-lawyers-court-judges-unimpressed/"
  },
  {
    "text": "Here's the source code for the unofficial Signal app used by Trump officials  —  Yesterday, I published an analysis of what I could publicly find about TM SGNL, the obscure and unofficial Signal app used by Mike Waltz, and presumably also by Pete Hegseth, JD Vance, Tulsi Gabbard, and other fascists in Trump's government.",
    "url": "https://micahflee.com/heres-the-source-code-for-the-unofficial-signal-app-used-by-trump-officials/"
  },
  {
    "text": "Republicans in Congress Use Obscure Law to Roll Back Biden-Era Regulations  —  As G.O.P. lawmakers have largely ceded power to President Trump, they are also pushing the bounds of a little-known statute to undo federal rules — and potentially undermining the filibuster.",
    "url": "https://www.nytimes.com/2025/05/03/us/politics/republicans-congressional-review-act.html?unlocked_article_code=1.Ek8.9ftr.ET70oghiprdA&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "'I'll be an eight-year president': Trump weighs in on third-term speculation  —  Trump told “Meet the Press” a third term is something “you're not allowed to do.”  And he mentioned not only JD Vance but Marco Rubio when asked about future GOP leaders.  —  President Donald Trump offered … ",
    "url": "https://www.nbcnews.com/politics/2028-election/-eight-year-president-trump-weighs-third-term-speculation-rcna204579"
  },
  {
    "text": "Trump defends the high price tag for his military parade: ‘Peanuts compared to the value’  —  In an exclusive interview with NBC News' “Meet the Press,” Trump also outlined a White House renovation he hopes to carry out — which he said he will pay for himself.",
    "url": "https://www.nbcnews.com/politics/trump-administration/trump-defends-high-cost-military-parade-peanuts-rcna204581"
  },
  {
    "text": "Trump Battles Academia, but Especially the Ivy League … President Trump's attacks on Harvard and other Ivy League schools have endeared him to his base.Sophie Park for The New York Times  —  There it was for all to see, President Trump's tangled relationship with the Ivy League … ",
    "url": "https://www.nytimes.com/2025/05/04/us/politics/trump-ivy-league.html"
  },
  {
    "text": "V.A. Mental Health Care Staff, Crowded into Federal Buildings, Raise Patient Privacy Alarms … At a V.A. clinic in Oakland, mental health professionals are sharing call center-style offices, such as a mailroom where supervisors had the cubby-hole mailboxes removed to install two desks.",
    "url": "https://www.nytimes.com/2025/05/04/us/politics/veterans-affairs-mental-health-privacy.html?unlocked_article_code=1.Ek8.rIgF.r70z0QzHxtJq&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "AP PHOTOS: Many in Gaza face malnutrition and hunger as blockade enters its third month  —  Malnutrition and hunger are becoming increasingly prevalent in the Gaza Strip as Israel's total blockade enters its third month.  A shortage of food and supplies has driven the territory toward starvation, according to aid agencies.",
    "url": "https://apnews.com/article/gaza-israel-palestinians-malnutrition-children-2756d23409216bf1721ae3b2ca9d9d31"
  },
  {
    "text": "L.A. federal prosecutors resign over plea deal for convicted sheriff's deputy, sources say  —  Several federal prosecutors — including the chief of the Public Corruption and Civil Rights Section — have submitted their resignations following a plea deal offered by the new U.S. attorney … ",
    "url": "https://www.latimes.com/california/story/2025-05-03/los-angeles-federal-prosecutors-resign-deputy-plea"
  },
  {
    "text": "How Misinformation and Partisan ‘New Media’ Changed a California Town  —  Residents of Oakdale, Calif., have abandoned traditional media outlets for a mishmash of online sources.  These days, they're often not sure what information to trust.  —  As time has gone on, traditional news outlets in Oakdale … ",
    "url": "https://www.nytimes.com/2025/05/03/technology/news-misinformation-facebook-oakdale.html"
  },
  {
    "text": "DOJ opens probe after left-wing DA requires prosecutors to consider race in plea deals  —  Soros-backed prosecutor in Minneapolis hit with DOJ civil rights probe  —  The Justice Department has opened a civil rights investigation into the Minneapolis-area Hennepin County Attorney's Office's … ",
    "url": "https://www.foxnews.com/politics/doj-opens-probe-after-left-wing-da-requires-prosecutors-consider-race-plea-deals"
  },
  {
    "text": "Putin says he hopes there will be no need to use nuclear weapons in Ukraine  —  Russian President Vladimir Putin has said that the need to use nuclear weapons in Ukraine had not arisen and that he hopes it will not.  —  In comments aired Sunday in a film by Russian state television … ",
    "url": "https://apnews.com/article/russia-ukraine-war-nuclear-putin-ceasefire-868bda4fc666ec3b05a1e512eca91b3c"
  },
  {
    "text": "What It Takes to Win—or Lose—in a Meeting With Trump  —  Companies and institutions are honing a playbook for approaching an unpredictable president  —  When Ohio State University President Ted Carter visited the White House last month, he brought President Trump and Vice President JD Vance … ",
    "url": "https://www.wsj.com/politics/policy/what-it-takes-to-winor-losein-a-meeting-with-trump-63e545e1"
  },
  {
    "text": "How a School in a Tiny, New York Town Beat ICE  —  Sackets Harbor demanded that Tom Homan return three children and their mother.  Why did he cave?  —  When the school board, or most of it, met for its regularly scheduled session on April 15, Sackets Harbor was still a feel-good story.",
    "url": "https://www.bloomberg.com/opinion/articles/2025-05-04/how-sackets-harbor-got-ice-and-tom-homan-to-cave-on-deportations"
  },
  {
    "text": "Love on the Spectrum stars call on RFK Jr. to resign  —  Two stars of the popular Netflix reality dating show Love on the Spectrum said Robert F. Kennedy Jr.'s controversial comments about autism couldn't be further from their reality — and they have the potential to do tremendous damage to the community.",
    "url": "https://www.vox.com/today-explained-podcast/411542/love-on-the-spectrum-rfk-autism-dani-james"
  },
  {
    "text": "Everyone Wants a Piece of Trump's ‘Golden Dome’ Defense Plan  —  Lasers in space, ‘rods from God’ and a huge number of satellites are being discussed for proposed missile shield  —  Laser-toting satellites capable of taking out missiles have long been the stuff of science fiction.",
    "url": "https://www.wsj.com/politics/national-security/trump-golden-dome-america-defense-contractors-7bc332a4"
  }
]