[
  {
    "text": "‘No one involved in the effort thinks he has a path’: Biden insiders say the writing is on the wall  —  The set of Democrats who think he should reconsider his decision to stay in the race has grown to include aides, operatives and officials tasked with guiding his campaign to victory.",
    "url": "https://www.nbcnews.com/politics/2024-election/biden-reelection-insiders-no-path-debate-rcna161296"
  },
  {
    "text": "Angry and stunned Democrats blame Biden's closest advisers for shielding public from full extent of president's decline  —  At a star-studded fundraiser for President Joe Biden in Los Angeles last month, George Clooney wasn't the only one who came away concerned about the president.",
    "url": "https://www.cnn.com/2024/07/11/politics/joe-biden-age-decline-democrats-angry/"
  },
  {
    "text": "GOP Push To Fine Merrick Garland $10,000 A Day Over Biden Audio Fails  —  Rep. Anna Paulina Luna (R-Fla.), who pushed for the penalty, said she would try again when Congress returns.  —  LOADING  —  Some Republicans' effort to punish Attorney General Merrick Garland for withholding audio … ",
    "url": "https://www.huffpost.com/entry/gop-attempt-to-fine-garland-flops-in-house_n_669039ebe4b0c4c9f3a754d7"
  },
  {
    "text": "Potentially dozens of Democrats expected to call on Biden to step aside after NATO conference  —  Four Democratic sources with knowledge tell CBS News that they expect dozens of Democratic lawmakers over the next 48 hours to issue statements calling for President Biden to step out of the race.",
    "url": "https://www.cbsnews.com/news/potentially-dozens-of-democrats-expected-to-call-on-biden-to-step-aside-after-nato-conference/"
  },
  {
    "text": "White House guests recount concerns after seeing Biden weeks before debate: ‘What we witnessed was troubling’  —  Some guests at a White House concert in June say they had concerns about Biden.  —  President Joe Biden, center, during a Juneteenth concert on the South Lawn of the White House, June 10, 2024.",
    "url": "https://abcnews.go.com/US/white-house-guests-recount-concerns-after-biden-weeks/story?id=111849442"
  },
  {
    "text": "Joe Biden Calls Kamala Harris ‘Vice President Trump’ at Crucial Press Conference  —  OH JOE  —  The president's make-or-break press conference started with a mix-up after he called Ukrainian President Zelensky “Putin.”  —  Deputy Washington Bureau Chief  —  Joe Biden started … ",
    "url": "https://www.thedailybeast.com/joe-biden-calls-kamala-harris-vice-president-trump-in-disastrous-start-to-press-conference"
  },
  {
    "text": "Biden does some damage control with House Dems — but not enough  —  President Joe Biden delivered a steady performance at a high-stakes press conference Thursday but still fell short of assuring jittery Democrats concerned about his future, prolonging painful questions across the party.",
    "url": "https://www.politico.com/live-updates/2024/07/11/congress/how-dem-lawmakers-viewed-bidens-performance-00167743"
  },
  {
    "text": "Obama, Pelosi privately expressed concerns over Biden  —  Barack Obama and Nancy Pelosi have spoken privately about Joe Biden and the future of his 2024 campaign.  Both the former president and ex-speaker expressed concerns about how much harder they think it's become for the president to beat Donald Trump.",
    "url": "https://www.cnn.com/2024/07/11/politics/obama-pelosi-biden-democrats-2024/"
  },
  {
    "text": "Rep. Marie Gluesenkamp Perez suggests Biden should resign and drop out of presidential race  —  U.S. Reps. Earl Blumenauer and Adam Smith have also called for Biden to drop out, though not to resign.  Other Oregon and Washington Democrats have been noncommittal.",
    "url": "https://www.kgw.com/article/news/politics/national-politics/marie-gluesenkamp-perez-statement-biden/283-c293250b-ed80-4360-bce5-532931e8700a"
  },
  {
    "text": "The Embattled Biden Campaign Tests Kamala Harris's Strength vs. Trump  —  The campaign is quietly carrying out a head-to-head survey of voters between the vice president and Donald Trump, in a sign of the uncertainty even atop the Democratic Party.  —  Under siege from fellow Democrats … ",
    "url": "https://www.nytimes.com/2024/07/11/us/politics/biden-kamala-harris-poll-trump.html"
  },
  {
    "text": "Biden faces his lowest point since the debate  —  Two weeks after debate, Biden allies struggle to quell unrest.  —  As Joe Biden struggles to contain the fallout from his poor debate performance, a gulf is widening between how the president's most inner circle and the rest of the Democratic Party … ",
    "url": "https://www.politico.com/news/2024/07/11/biden-inner-circle-democrats-problems-00167636"
  },
  {
    "text": "Biden Advisers Weigh How to Convince Him to End His Campaign  —  Close allies of the president are developing a case for why he should step aside.  But Mr. Biden is increasingly isolated.  —  Follow the latest Biden news and election polls.  —  President Biden found himself increasingly isolated … ",
    "url": "https://www.nytimes.com/2024/07/11/us/politics/biden-aides-campaign.html"
  },
  {
    "text": "Joe Biden Is Facing Questions About His Age And Mental Acuity.  What About Donald Trump?  —  The president is only three years older than Trump, who routinely goes off on bizarre tangents, mixes up important people and blatantly lies.  —  LOADING  —  WASHINGTON ― He's too old.",
    "url": "https://www.huffpost.com/entry/donald-trump-joe-biden-age_n_6690465ae4b0877e5b949f35"
  },
  {
    "text": "Civic Media  —  Statement regarding edits to the July 4th interview with President Biden  —  The Earl Ingram Show was one of two radio programs contacted by the Biden campaign following the June 27th debate to speak with President Biden.  The interview was recorded on July 3rd and aired … ",
    "url": "https://civicmedia.us/2024/07/11/statement-regarding-edits-to-the-july-4th-interview-with-president-biden"
  },
  {
    "text": "Milwaukee radio station says it agreed to edit interview with Joe Biden  —  Jessie Opoien Molly BeckMilwaukee Journal Sentinel  —  MADISON — Civic Media, a Wisconsin-based progressive talk-radio network, said Thursday it had agreed to make two edits to an interview with President Joe Biden … ",
    "url": "https://www.jsonline.com/story/news/politics/elections/2024/07/11/milwaukee-radio-station-says-it-agreed-to-edit-interview-with-biden/74369012007/"
  },
  {
    "text": "Project 2025's plan to upend Medicare should set off alarm bells  —  Project 2025 is a comprehensive transition plan organized by right-wing think tank The Heritage Foundation to guide the next GOP presidential administration.  Its lengthy guidebook, Mandate For Leadership … ",
    "url": "https://www.mediamatters.org/project-2025/project-2025s-plan-upend-medicare-should-set-alarm-bells"
  },
  {
    "text": "Breaking Down Project 2025  —  Recently, it's been encouraging to see so many Americans waking up to the danger of Project 2025.  Celebrities such as Taraji P. Henson, who spoke repeatedly about it during the recent Black Entertainment Television awards, as well as a grassroots effort … ",
    "url": "https://thinkbigpicture.substack.com/p/project-2025-heritage-foundation-trump"
  }
]