[
  {
    "text": "Hegseth Said to Have Shared Attack Details in Second Signal Chat  —  The defense secretary sent sensitive information about strikes in Yemen to an encrypted group chat that included his wife and brother, people familiar with the matter said.  —  Defense Secretary Pete Hegseth shared detailed information … ",
    "url": "https://www.nytimes.com/2025/04/20/us/politics/hegseth-yemen-attack-second-signal-chat.html?unlocked_article_code=1.BE8.BauJ.3YOHxBJpnIXl&smid=url-share"
  },
  {
    "text": "Former Top Pentagon Spokesperson Details ‘Month From Hell’ Inside the Agency  —  The total chaos at the Department of Defense is becoming a major distraction for the Trump administration, writes John Ullyot.  —  It's been a month of total chaos at the Pentagon.",
    "url": "https://www.politico.com/news/magazine/2025/04/20/pentagon-chaos-ullyot-hegseth-00205594"
  },
  {
    "text": "Pope Francis, first Latin American pontiff who ministered with a charming, humble style, dies at 88  —  Pope Francis, history's first Latin American pontiff who charmed the world with his humble style and concern for the poor but alienated conservatives with critiques of capitalism and climate change, died Monday.",
    "url": "https://apnews.com/article/vatican-pope-francis-dead-01ca7d73c3c48d25fd1504ba076e2e2a"
  },
  {
    "text": "Latest Updates: Pope Francis Dies at 88  —  His groundbreaking pontificate worked to make the Catholic Church more inclusive.  Cardinals will now decide whether to continue his approach or restore more doctrinaire leadership.  —  Buenos Aires  —  Jerusalem  —  Havana  —  Washington",
    "url": "https://www.nytimes.com/live/2025/04/21/world/pope-francis-updates-vatican?unlocked_article_code=1.BU8.ABqr.4mi44ok7JwwC&smid=url-share"
  },
  {
    "text": "Pope Francis has died on Easter Monday aged 88  —  Pope Francis died on Easter Monday, April 21, 2025, at the age of 88 at his residence in the Vatican's Casa Santa Marta.  —  At 9:45 AM, Cardinal Kevin Farrell, Camerlengo of the Apostolic Chamber, announced the death of Pope Francis from the Casa Santa Marta with these words:",
    "url": "https://www.vaticannews.va/en/pope/news/2025-04/pope-francis-dies-on-easter-monday-aged-88.html"
  },
  {
    "text": "Pope Francis' Last Act Was to Give JD Vance a Lesson About Migrants  —  CHRISTIAN VALUES  —  The pontiff, who died Monday, spoke up in opposition to MAGA policies and suggested in a final statement that they stirred up “contempt.”  —  Pope Francis, who died at 88 on Monday … ",
    "url": "https://www.thedailybeast.com/pope-francis-last-act-was-to-give-jd-vance-a-lesson-about-migrants/"
  },
  {
    "text": "Homeland Security Secretary Kristi Noem's bag, including $3,000 in cash, is stolen from DC restaurant  —  Department of Homeland Security Secretary Kristi Noem fell victim to a thief while eating dinner at a downtown Washington, DC, restaurant Sunday night, two sources familiar with the incident … ",
    "url": "https://cnn.com/2025/04/21/politics/homeland-security-kristi-noem-purse-stolen/"
  },
  {
    "text": "House Dems travel to El Salvador to secure Maryland man's return  —  More Democrats are making the trip abroad to raise awareness for what they call a “constitutional crisis” surrounding Kilmar Abrego Garcia's deportation.  —  Four more Democratic lawmakers have landed in El Salvador … ",
    "url": "https://www.politico.com/news/2025/04/21/house-democrats-el-salvador-maryland-man-return-00300733"
  },
  {
    "text": "How Democrats Won Wisconsin In 2025: Turnout.  —  Democrats swelled with confidence after their victory in the State Supreme Court race in Trump-won Wisconsin.  It seemed that public opinion swung sharply against Donald Trump and the GOP despite Elon Musk's eight-figure investment in the state.",
    "url": "https://split-ticket.org/2025/04/21/how-did-democrats-win-wisconsin-in-2025/"
  },
  {
    "text": "Is Donald Trump Breaking the Law?  Seven Experts Weigh In.  —  Trump critics say we are in a constitutional crisis.  The White House says that's hysterical.  What do our top legal minds say?  —  The first 90 days of President Trump's second term have been marked by a series of aggressive legal maneuvers.",
    "url": "https://www.thefp.com/p/is-donald-trump-breaking-the-law"
  },
  {
    "text": "Diplomats Are Freaking Out About Trump's Leaked Executive Order  —  STATE OF PANIC  —  One official said monkeys with a typewriter could have come up with a more logical plan for the State Department.  —  American diplomats spent the weekend panicking about a possible plan to radically reshape … ",
    "url": "https://www.thedailybeast.com/diplomats-are-freaking-out-about-donald-trumps-leaked-executive-order/"
  },
  {
    "text": "Trump's Surgeon General Pick Distorted Key Parts of Her Résumé  —  Dr. Janette Nesheiwat, an urgent-care physician and former Fox News medical contributor 1 who is President Donald Trump's nominee for surgeon general of the United States, has over at least the last 15 years falsely represented … ",
    "url": "https://lastcampaign.substack.com/p/trumps-surgeon-general-pick-distorted"
  },
  {
    "text": "Japan to voice concern over US trade deal inconsistency, PM Ishiba says  —  Japanese Prime Minister Shigeru Ishiba said on Monday Tokyo has no plan to terminate a trade deal struck with the U.S. in 2019, but will keep voicing “grave concern” over inconsistency between the deal and President Donald Trump's latest automobile tariffs.",
    "url": "https://www.reuters.com/business/japan-voice-concern-over-us-trade-deal-inconsistency-pm-ishiba-says-2025-04-21/"
  },
  {
    "text": "What We've Learned So Far From Tracking Student Visa Data  —  More than 1,500 students from nearly 250 colleges have had their visas revoked, but who they are—and why they've been targeted—is still largely unknown. … Our goal was to understand the scope of the federal government's involvement … ",
    "url": "https://www.insidehighered.com/news/global/international-students-us/2025/04/21/five-key-takeaways-tracking-student-visa"
  },
  {
    "text": "Trump Administration Irate at Harvard, Plans to Pull Additional $1 Billion in Funding  —  The university publicized a government demand letter that asked for federal oversight of the campus  —  The Trump administration has grown so furious with Harvard University after a week … ",
    "url": "https://www.wsj.com/us-news/education/trump-administration-irate-at-harvard-will-pull-additional-1-billion-in-funding-8c209113?st=6r13ey&reflink=article_copyURL_share"
  },
  {
    "text": "Solicitor General John Sauer's Predicament  —  His incompatible duties to the president and the Supreme Court are coming to a head. … Yesterday Justice Alito published a fiery statement explaining his dissent from the Supreme Court's early Saturday morning order directing the U.S. government … ",
    "url": "https://executivefunctions.substack.com/p/solicitor-general-john-sauers-predicament"
  },
  {
    "text": "Baby Bonuses, Fertility Planning: Trump Aides Assess Ideas to Boost Birthrate … “We need to channel the MAHA spirit and really dive deep into infertility,” said Emma Waters, a policy analyst at the Heritage Foundation, referring to Robert F. Kennedy Jr.'s Make America Healthy Again campaign.Rebecca Kiger for The New York Times",
    "url": "https://www.nytimes.com/2025/04/21/us/politics/baby-bonuses-fertility-planning-trump-aides-assess-ideas-to-boost-birthrate.html?unlocked_article_code=1.BU8.eK_C.XLnbRfNPvs8-"
  },
  {
    "text": "GOP lawmakers running out of options to pay for Trump's costly agenda  —  Republican leaders are rapidly running out of ways to pay for President Trump's agenda as GOP lawmakers shoot down various proposals to cut spending or increase revenues.  —  Without finding some new ideas … ",
    "url": "https://thehill.com/homenews/senate/5255483-trump-agenda-funding-problems/"
  },
  {
    "text": "If Ukraine-Russia Negotiations Fail, Victory Remains an Option  —  ON FRIDAY, SECRETARY OF STATE MARCO RUBIO announced that “in a matter of days,” the administration would decide whether negotiating an end to the Russia-Ukraine War is “doable.”  It's unclear what the administration … ",
    "url": "https://www.thebulwark.com/p/if-ukraine-russia-negotiations-fail-vistory-remains-option-trump-rubio-zelensky-putin-war"
  },
  {
    "text": "Supreme Court rejects Minnesota effort to revive ban on young adults from carrying guns  —  The measure struck down by lower courts bars 18-to-20-year-olds from applying for licenses to carry firearms in public.  —  WASHINGTON — The Supreme Court on Monday delivered a blow to Minnesota's attempt … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-rejects-minnesota-effort-revive-ban-young-adults-carryin-rcna202114"
  },
  {
    "text": "Trump Administration Live Updates: White House Defends Hegseth Over 2nd Signal Chat on Strikes  —  Where Things Stand  — Hegseth chat: President Trump “absolutely has confidence” in Defense Secretary Pete Hegseth, the White House press secretary, Karoline Leavitt, told reporters … ",
    "url": "https://www.nytimes.com/live/2025/04/21/us/trump-administration-news"
  }
]