[
  {
    "text": "Hunter Biden, Defying Deposition Subpoena, Again Offers Public Testimony  —  The president's son appeared at a news conference at the Capitol as House investigators awaited him at a private session he declined to attend.  —  Hunter Biden, the president's son, appeared on Capitol Hill … ",
    "url": "https://www.nytimes.com/2023/12/13/us/politics/hunter-biden-impeachment-testimony.html"
  },
  {
    "text": "Hunter Biden flouts subpoena for closed-door testimony, demanding to testify publicly: ‘I am here’  —  President Joe Biden's son Hunter Biden defied Republican investigators' subpoena for closed-door testimony, demanding to testify publicly Wednesday.  —  In his first public statement since … ",
    "url": "https://www.cnn.com/2023/12/13/politics/hunter-biden-capitol-hill/"
  },
  {
    "text": "Supreme Court will decide access to key abortion drug mifepristone  —  The Supreme Court announced Wednesday that it will decide this term whether to limit access to a key abortion drug, returning the polarizing issue of reproductive rights to the high court for the first time since … ",
    "url": "https://www.washingtonpost.com/politics/2023/12/13/abortion-drug-supreme-court-mifepristone-fda/"
  },
  {
    "text": "Supreme Court agrees to hear showdown over abortion pill access  —  In a high-stakes legal battle, the Biden administration is defending federal approval of the abortion pill mifepristone, including a recent move to make it available by mail.  —  WASHINGTON — The Supreme Court on Wednesday took … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-agrees-hear-showdown-abortion-pill-access-rcna128185"
  },
  {
    "text": "Trump Tries to Slow Down Appeals Court Review on ‘Presidential Immunity’  —  The former president's lawyers cited ‘How the Grinch Stole Christmas’ in a court filing on Wednesday arguing against a speedy briefing schedule … “The prosecution has one goal in this case: To unlawfully attempt to try … ",
    "url": "https://themessenger.com/politics/trump-appeals-court-review-presidential-immunity"
  },
  {
    "text": "Fani Willis Responds to GOP Backlash to Trump Case: ‘They Want to Come Up With This Foolishness’  —  ‘They worry the hero is treated the same as everybody else,’ the Fulton County, Georgia district attorney said  —  Fulton County, Ga., District Attorney Fani Willis is speaking up amid pushback … ",
    "url": "https://themessenger.com/politics/fani-willis-georgia-republican-senators-trump-case"
  },
  {
    "text": "Tesla to Recall More Than Two Million Vehicles Over Autopilot Safety Concerns  —  Move follows two-year investigation by the National Highway Traffic Safety Administration  —  Tesla will recall more than two million vehicles over concerns over its Autopilot system, following a two-year probe … ",
    "url": "https://www.wsj.com/business/autos/tesla-recalls-more-than-two-million-vehicles-over-autopilot-safety-concerns-274eb6e6?mod=followamazon"
  },
  {
    "text": "André Braugher Dies: Star Of ‘Homicide: Life On The Street’, ‘Brooklyn Nine-Nine’ & Other Series And Films Was 61  —  Co-Editor-in-Chief, Film  — VIBE Editor-In-Chief Datwon Thomas Takes Executive Producer, Talent Post At Dick Clark Productions  — Mort Engelberg Dies … ",
    "url": "https://deadline.com/2023/12/andre-braugher-dead-homicide-life-on-the-street-brooklyn-nine-nine-actor-1235665513/"
  },
  {
    "text": "Contraception is a winning issue, conservative strategists tell GOP  —  Former Trump confidante Kellyanne Conway and other strategists are citing poll data showing strong demand among GOP voters for birth control after the fall of Roe.  —  Kellyanne Conway is going to Capitol Hill on Wednesday … ",
    "url": "https://www.politico.com/news/2023/12/13/kellyanne-conway-contraception-republicans-2024-00131410"
  },
  {
    "text": "Playbook: A protest that should worry Biden and Harris  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  IT'S A WRAP — “Climate summit makes ‘historic progress’ — but the world still can't quit oil,” by Karl Mathiesen, Zia Weise, Zack Colman … ",
    "url": "https://www.politico.com/newsletters/playbook/2023/12/13/a-protest-that-should-worry-biden-and-harris-00131484"
  },
  {
    "text": "We Were Told Biden Is Secretly Running the DOJ.  Why Is His Son Being Charged? … It has long been an article of faith on the right that Attorney General Merrick Garland is prosecuting Donald Trump because President Biden wants him to.  Even the Trump-skeptical corners … ",
    "url": "https://nymag.com/intelligencer/2023/12/bidens-justice-department-merrick-garland-independent-hunter-trump.html"
  },
  {
    "text": "US agency will not reinstate $900 mln subsidy for SpaceX Starlink unit  —  The U.S. Federal Communications Commission on Tuesday reaffirmed its 2022 decision to deny SpaceX satellite internet unit Starlink $885.5 million in rural broadband subsidies.  —  The FCC said the decision impacting … ",
    "url": "https://www.reuters.com/technology/space/us-agency-will-not-reinstate-900-mln-subsidy-spacex-starlink-unit-2023-12-13/"
  },
  {
    "text": "‘Thank God they walked out’: Oregon's partisan divide highlights heightened animosity in statehouses  —  Republicans lawmakers in Oregon are banned from running for reelection after staging a six-week protest over guns, abortion and transgender issues.  —  Ten Oregon Republican senators … ",
    "url": "https://www.politico.com/news/2023/12/13/partisan-politics-oregon-walkout-00131348"
  },
  {
    "text": "Manchin taking 2-month tour to test appetite for national ‘movement’  —  Sen. Joe Manchin (D-W.Va.) said Tuesday that he has not decided on his political future but will launch a two-month winter tour to determine whether there is a national “movement” for a third-party ticket.",
    "url": "https://thehill.com/homenews/senate/4358076-manchin-taking-two-month-tour-to-test-appetite-for-national-movement/"
  },
  {
    "text": "Trump makes third Iowa trip this month in final weeks before GOP voting starts in caucusesDonald Trump is making his third trip to Iowa this month as ...  CORALVILLE, Iowa (AP) — Donald Trump is making his third trip to Iowa this month as he increasingly turns his attention to the state … ",
    "url": "https://apnews.com/article/trump-iowa-2024-presidential-election-e15775f86b720bd4eae5e09967eb66f9"
  },
  {
    "text": "Trump considers overhauling his approach to North Korea if he wins in 2024  —  The idea, which has been considered in other forms during years of U.S.-led negotiations with North Korea, would be a shift in Washington's overall approach to Pyongyang.  —  Donald Trump is considering a plan … ",
    "url": "https://www.politico.com/news/2023/12/13/trump-north-korea-nuclear-weapons-plan-00131469"
  },
  {
    "text": "One-in-Five Mail-In Voters Admit They Cheated in 2020 Election  —  More than 20% of voters who used mail-in ballots in 2020 admit they participated in at least one form of election fraud.  —  A new national telephone and online survey by Rasmussen Reports and The Heartland Institute finds … ",
    "url": "https://www.rasmussenreports.com/public_content/politics/partner_surveys/one_in_five_mail_in_voters_admit_they_cheated_in_2020_election"
  },
  {
    "text": "Monumental, Youngkin announce deal to move Caps, Wizards to Virginia  —  Renderings show a 20,000-seat arena, practice facilities for the Wizards and Capitals, expanded esports facilities, a performing arts venue, “fan plaza” and more  —  The owner of the Wizards and Capitals has reached … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2023/12/13/capitals-wizards-move-alexandria-potomac-yard/"
  },
  {
    "text": "GOP Rep. Mike Garcia Secretly Sold Boeing Stock Ahead of Damning Report  —  A Republican lawmaker sold up to $50,000 of Boeing shares just before a committee he was on released a damning report about Boeing—and then he blew the deadline to report it.",
    "url": "https://www.thedailybeast.com/gop-rep-mike-garcia-secretly-sold-boeing-stock-ahead-of-damning-report"
  },
  {
    "text": "The truth about Wreaths Across America  —  Wreaths Across America is a non-profit organization that places wreaths on the graves of military veterans.  It's a simple gesture that has proven popular.  Wreaths Across America placed 33,000 wreaths in 2007, its first year.",
    "url": "https://popular.info/p/the-truth-about-wreaths-across-america"
  },
  {
    "text": "Scoop: House Freedom Caucus compares Mike Johnson to John Boehner … - The Freedom Caucus played a leading role in Boehner stepping down as speaker in 2015, and it blocked several speaker candidates in October after five of its members voted to oust former Speaker Kevin McCarthy.",
    "url": "https://www.axios.com/2023/12/13/freedom-caucus-mike-johnson-john-boehner"
  }
]