[
  {
    "text": "Syria rebels celebrate in captured Homs, set sights on Damascus  —  Syrian President Bashar al-Assad flew out of Damascus for an unknown destination on Sunday, two senior army officers told Reuters, as rebels said they had entered the capital with no sign of army deployments.",
    "url": "https://www.reuters.com/world/middle-east/syria-rebels-celebrate-captured-homs-set-sights-damascus-2024-12-07/"
  },
  {
    "text": "BREAKING: Syrian rebels announce fall of Russia-backed Assad regime  —  Editor's Note: This is a developing story and is being updated.  —  Syrian rebels announced on Dec. 8 that they had ousted President Bashar al-Assad from the capital city of Damascus.  —  “The tyrant Bashar al-Assad has fled.",
    "url": "https://kyivindependent.com/breaking-syrian-rebels-announce-fall-of-assad-regime/"
  },
  {
    "text": "In the Syrian Regime's Hour of Need, Its Patron Iran Makes an Exit  —  The collapse of a partnership built over four decades would reshape the balance of power in the Middle East.  —  For decades, Iran has expended much blood and money in support of Syria's president, Bashar al-Assad … ",
    "url": "https://www.nytimes.com/2024/12/07/world/middleeast/iran-syria-rebels.html"
  },
  {
    "text": "Syria Live Updates: Government Forces Withdraw From Damascus Suburbs, Monitors Say  —  Two war monitoring groups said Syria's military had pulled out of a number of Damascus suburbs where anti-government protests erupted.  The movements could not immediately be confirmed.  —  Here are the latest developments.",
    "url": "https://www.nytimes.com/live/2024/12/07/world/syria-war-damascus"
  },
  {
    "text": "Assad regime in Syria may fall in days, US increasingly believes  —  Biden administration officials, watching the remarkable speed of the Syrian rebel advance, increasingly see the possibility of the regime of Bashar al-Assad falling within days, five US officials told CNN.",
    "url": "https://www.cnn.com/2024/12/07/politics/assad-regime-syrian-civil-war/"
  },
  {
    "text": "US announces nearly $1 billion more in longer-term weapons support for Ukraine  —  The United States will provide nearly $1 billion more in longer-term weapons support to Ukraine, Defense Secretary Lloyd Austin said Saturday as the Biden administration rushes to spend all the congressionally approved money … ",
    "url": "https://apnews.com/article/ukraine-weapons-russia-trump-biden-himars-zelenskyy-7b2560ad6bd54a6275da0ceb5241c0e8"
  },
  {
    "text": "Youngkin: Jordanians ‘crashed’ Quantico.  Feds: It was an Amazon delivery.  —  Virginia's governor has used the arrest of two undocumented men who misunderstood directions to stop at a check-in station to inflame fears over illegal immigration.  —  RICHMOND — There are two versions … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2024/12/07/youngkin-jordanians-crashed-quantico-feds-it-was-an-amazon-delivery/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzMzNTQ3NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM0OTI5OTk5LCJpYXQiOjE3MzM1NDc2MDAsImp0aSI6IjgzYWY1MTMyLTUzMWEtNGU2My04YzgzLWI4MTI5Y2YyZDg2ZCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9kYy1tZC12YS8yMDI0LzEyLzA3L3lvdW5na2luLWpvcmRhbmlhbnMtY3Jhc2hlZC1xdWFudGljby1mZWRzLWl0LXdhcy1hbi1hbWF6b24tZGVsaXZlcnkvIn0.1jJjTWfYv90NubfLGoqKzGOt_YV22RwoDeDyoEMQSMs&itid=gfta"
  },
  {
    "text": "Federal employees scramble to insulate themselves from Trump's purge  —  Career civil servants are scrubbing social media, changing job titles and looking for private sector work over fear that Trump might fire them  —  Lisa Rein covers federal agencies and the management of government.",
    "url": "https://www.washingtonpost.com/politics/2024/12/08/federal-employees-trump-fear-purge/"
  },
  {
    "text": "Climate Activists Need to Radically Change Their Approach Under Trump  —  Donald Trump's return to Washington might seem like a terrifying moment for the fight against climate change.  The incoming administration is not just hostile to the energy transition; it's also expected to pull … ",
    "url": "https://www.nytimes.com/2024/12/08/opinion/climate-clean-energy-trump.html"
  },
  {
    "text": "Want a Job in the Trump Administration?  Be Prepared for the Loyalty Test.  —  Applicants for government posts, including inside the Pentagon and the intelligence agencies, say they have been asked about their thoughts on Jan. 6 and who they believe won the 2020 election.",
    "url": "https://www.nytimes.com/2024/12/07/us/politics/trump-administration-loyalty-test.html?unlocked_article_code=1.f04.VnV0.LFCzCFmEwLaBio"
  },
  {
    "text": "What Doctors Like Myself Know About Americans' Health Care Anger  —  I rushed around the patient as he lay motionless with his eyes closed in the emergency room.  He was pale and sweaty, his T-shirt stained with vomit.  You didn't have to be a health-care worker to know that he was in a dire state.",
    "url": "https://www.nytimes.com/2024/12/08/opinion/health-care-anger.html"
  },
  {
    "text": "What the Murder of the UnitedHealthcare C.E.O. Means to America  —  What the death of a health-insurance C.E.O. means to America.  —  As you know, the C.E.O. of UnitedHealthcare, fifty-year-old Brian Thompson, was murdered on the street in midtown Manhattan, on Wednesday morning, twenty minutes before sunrise.",
    "url": "https://www.newyorker.com/news/the-lede/what-the-murder-of-the-unitedhealthcare-ceo-brian-thompson-means-to-america"
  },
  {
    "text": "UnitedHealthcare CEO shooting latest: Suspect's backpack had Monopoly money: Sources  —  The manhunt for CEO Brian Thompson's killer is now on its fourth day.  —  Members of the NYPD search the pond near Bethesda Fountain in Central Park for possible evidence tied to the shooting death … ",
    "url": "https://abcnews.go.com/US/unitedhealthcare-ceo-shooting-latest-manhunt-nationwide-police-learn/story?id=116551771"
  },
  {
    "text": "FDA may outlaw food dyes ‘within weeks’: Bombshell move would affect candy, soda and cakes, revolutionize American diets  —  The Food and Drug Administration will decide on a ban of certain food dyes in the coming weeks after receiving a petition to review the safety of Red 3, NBC News reports.",
    "url": "https://nypost.com/2024/12/07/lifestyle/fda-may-outlaw-food-dyes-within-weeks-bombshell-move-would-affect-candy-soda-and-cakes-revolutionize-american-diets/"
  }
]