[
  {
    "text": "Jim Jordan's allies tried strong-arming his GOP critics.  It backfired.  —  “The one thing that will never work with me — if you try to pressure me, if you try to threaten me, then I shut off,” GOP Rep. Mario Díaz-Balart said.  —  Jim Jordan's allies attempted to badger House Republicans into making him speaker.",
    "url": "https://www.politico.com/news/2023/10/17/conservative-pressure-jordan-speaker-bid-00122089"
  },
  {
    "text": "Congressman's Wife Receives Anonymous Texts Warning Husband to Vote For Jim Jordan: ‘Will Not Hold Any Political Office Ever Again’  —  The wife of Rep. Don Bacon (R-NE) reportedly received anonymous text messages and emails warning her husband to back Rep. Jim Jordan's (R-OH) House speakership campaign ahead of Tuesday's vote.",
    "url": "https://www.mediaite.com/politics/congressmans-wife-receives-anonymous-texts-warning-husband-to-vote-for-jim-jordan-will-not-hold-any-political-office-ever-again/"
  },
  {
    "text": "The resurrection of Jim Jordan  —  Tesnim Zekeria, Rebecca Crosby, and Judd Legum  —  On Tuesday, Republicans came close to making Congressman Jim Jordan (R-OH), a key player in the effort to overturn the 2020 presidential election, the next Speaker of the House.  Jordan received 200 votes — 17 fewer than he needed.",
    "url": "https://popular.info/p/the-resurrection-of-jim-jordan"
  },
  {
    "text": "10/18/23 ☀️ Punchbowl News AM … If it wasn't obvious to you Tuesday morning when we laid out 10-plus members who were likely to vote no, it should be obvious now.  —  Jordan lost 20 Republicans on the House floor Tuesday during the speaker tally, netting just 200 votes.",
    "url": "https://punchbowl.news/archive/101823-punchbowl-news-am/"
  },
  {
    "text": "The quest for a speaker may never end  —  Good morning, Early Birds.  Sneakers are not allowed in the Speaker's Lobby — but surely the House could make an exception for a reporter as fashionable as our colleague Jackie Alemany, especially when there is no speaker?  —  Tips: earlytips@washpost.com.",
    "url": "https://www.washingtonpost.com/politics/2023/10/18/quest-speaker-may-never-end/"
  },
  {
    "text": "Playbook: Revenge of the squishes  —  Presented by With help from Eli Okun and Garrett Ross  —  DRIVING THE DAY  —  DATELINE TEL AVIV — President JOE BIDEN landed less than three hours ago at Ben Gurion International Airport, where he was greeted and embraced on the tarmac … ",
    "url": "https://www.politico.com/newsletters/playbook/2023/10/18/revenge-of-the-squishes-00122168"
  },
  {
    "text": "Jim Jordan's Speaker Bid Hanging by a Thread  —  Good afternoon and welcome to Press Pass.  Today's edition is free, so sign up below if you haven't already and please share this newsletter with someone who you think might benefit from a regular dose of informative pain.",
    "url": "https://plus.thebulwark.com/p/jim-jordans-speaker-bid-hanging-by"
  },
  {
    "text": "The Wrestlers Trying to Stop Jim Jordan From Becoming House Speaker  —  They were abused in the '80s and '90s.  They say Jordan knew and did nothing.  —  Republican Ohio Rep. Jim Jordan is trying to become the next speaker of the House of Representatives.",
    "url": "https://slate.com/news-and-politics/2023/10/jim-jordan-wrestling-ohio-state-scandal-speaker-house-representatives.html"
  },
  {
    "text": "U.S. says thwarts drone attack on its troops in Iraq  —  The U.S. military thwarted an attack targeting its forces in Iraq early on Wednesday, intercepting two drones before they could strike, two U.S. officials told Reuters.  —  The officials, who spoke on condition of anonymity … ",
    "url": "https://www.reuters.com/world/us-says-thwarts-drone-attack-its-troops-iraq-2023-10-18/"
  },
  {
    "text": "Russian sources disappeared after Trump declassified ex-spy's evidence, UK court told  —  Former MI6 officer's witness statement criticises ‘reckless’ publication of Mueller testimony about ex-president's Russia links  —  Donald Trump's decision to declassify evidence given by a former British spy … ",
    "url": "https://www.theguardian.com/us-news/2023/oct/17/russian-sources-disappeared-after-trump-declassified-ex-spys-evidence-uk-court-told"
  },
  {
    "text": "Center for Politics Study: Partisan Desires Override Support for Constitutional Freedoms and American Values  —  A new national study by the Center for Politics at the University of Virginia reveals a stunning number of Americans endorsing policies that could challenge the U.S. Constitution … ",
    "url": "https://centerforpolitics.org/crystalball/articles/center-for-politics-study-indicates-many-americans-favor-actions-that-challenge-constitutional-bounds-to-serve-partisan-aims/"
  },
  {
    "text": "Department of Defense Releases Declassified Images, Videos of Coercive and Risky PLA Operational Behavior  —  The Department of Defense today released a collection of declassified images and videos depicting 15 recent cases of coercive and risky operational behavior by the People's Liberation Army … ",
    "url": "https://www.defense.gov/News/Releases/Release/Article/3559903/department-of-defense-releases-declassified-images-videos-of-coercive-and-risky/"
  },
  {
    "text": "Travel Advisory  —  Lebanon - Level 4: Do Not Travel  —  Raised to Level 4 and updated to reflect the authorized departure of family members of U.S. government personnel and some non-emergency personnel on a case-by-case basis.  —  Raised to Level 4 and updated to reflect the authorized departure … ",
    "url": "https://travel.state.gov/content/travel/en/international-travel/International-Travel-Country-Information-Pages/Lebanon.html"
  },
  {
    "text": "EXCLUSIVE: X, formerly known as Twitter, will begin charging new users $1 a year to access key features including the ability to tweet and retweet  —  The owner of X, Elon Musk, has long floated the idea of charging users $1 to use the platform.  —  X, the platform formerly known as Twitter … ",
    "url": "https://fortune.com/2023/10/17/twitter-x-charging-new-users-1-dollar-year-to-tweet/"
  },
  {
    "text": "WATCH: Cornell Professor Says Hamas Atrocities Were ‘Exhilarating’  —  A Cornell University professor told a crowd of students that the Hamas terror attacks against Israeli citizens were “exhilarating” and “energizing.”  —  “It was exhilarating,” Russell Rickford, a history professor at Cornell … ",
    "url": "https://freebeacon.com/latest-news/watch-cornell-professor-says-hamas-atrocities-were-exhilarating/"
  },
  {
    "text": "Pritzker launches abortion rights group Think Big America  —  The new political advocacy nonprofit plans to focus on ballot measures in Nevada, Ohio and Arizona.  —  CHICAGO — Illinois Gov. JB Pritzker launched a national nonprofit group focused on protecting and expanding abortion rights … ",
    "url": "https://www.politico.com/news/2023/10/18/pritzker-abortion-rights-think-big-america-00122159"
  },
  {
    "text": "Failed GOP Michigan Gubernatorial Candidate Jailed on Jan. 6 Charges  —  ‘CELEBRATED VIOLENCE’  —  A former Republican candidate for the Michigan governorship will spend two months behind bars after a judge sentenced him Tuesday on charges related to the Jan. 6 attack on the U.S. Capitol.",
    "url": "https://www.thedailybeast.com/failed-republican-michigan-gubernatorial-candidate-ryan-kelley-jailed-on-jan-6-charges"
  }
]