[
  {
    "text": "Arizona Republicans denounce revived 1864 abortion ban in sudden reversal  —  As the party struggles to talk about abortion, response marks fastest and strongest rebuke of bans since the fall of Roe  —  Hours after Arizona's supreme court declared on Tuesday that a 160-year-old abortion ban … ",
    "url": "https://www.theguardian.com/us-news/2024/apr/10/arizona-republicans-against-state-abortion-ban"
  },
  {
    "text": "‘Catastrophic,’ ‘a shock’: Arizona's abortion ruling threatens to upend 2024 races  —  State Supreme Court rules a near-total ban from 1864 can go into effect in a battleground state that could play an outsize role in the presidential election and help determine which party controls the U.S. Senate next year",
    "url": "https://www.washingtonpost.com/elections/2024/04/10/arizona-abortion-ban-politics-election/"
  },
  {
    "text": "Arizona lawmaker leads prayer circle on state seal at Capitol building, sparking backlash  —  Arizona Sen. Anthony Kern invited a prayer group to the Senate floor on Monday.  —  Seen in a video filmed by an anonymous attendee, Kern led the group, who spoke in tongues, through a prayer as they knelt over the state seal.",
    "url": "https://www.azcentral.com/story/news/politics/arizona/2024/04/09/anthony-kern-prayer-circle-arizona-capitol-floor/73264047007/"
  },
  {
    "text": "Former Trump executive Allen Weisselberg sentenced to 5 months in jail for lying in civil fraud case  —  Allen Weisselberg, a retired executive in Donald Trump's real estate empire, was sentenced on Wednesday to five months in jail for lying under oath during his testimony in the civil fraud lawsuit brought … ",
    "url": "https://apnews.com/article/weisselberg-trump-perjury-new-york-b76cde56c6cb983ab8789f95d5a0c6c0"
  },
  {
    "text": "Donald Trump's first criminal trial is nearly here — and he's already starting to melt down  —  Trump is very worried about his election interference case for good reason  —  There's been some talk lately about Donald Trump's light campaign schedule compared to President Joe Biden … ",
    "url": "https://www.salon.com/2024/04/10/donald-first-criminal-trial-is-nearly-here--and-hes-already-starting-to-melt-down/"
  },
  {
    "text": "Ex-Trump CFO Allen Weisselberg to be sentenced for perjury in Trump civil fraud trial  —  Manhattan District Attorney Alvin Bragg is recommending a five-month jail sentence for Weisselberg after he pleaded guilty to two counts of perjury in former President Donald Trump's civil fraud trial.",
    "url": "https://www.nbcnews.com/politics/donald-trump/ex-trump-cfo-allen-weisselberg-sentenced-perjury-trump-civil-fraud-tri-rcna147144"
  },
  {
    "text": "Trump's Ex-Finance Chief Is Sentenced to 5 Months in Rikers for Perjury  —  Allen H. Weisselberg admitted that he had lied about helping Donald J. Trump inflate his net worth to win favorable loan terms.  —  Allen H. Weisselberg, Donald J. Trump's longtime financial lieutenant … ",
    "url": "https://www.nytimes.com/2024/04/10/nyregion/allen-weisselberg-sentenced-trump.html"
  },
  {
    "text": "RFK Jr. sounds like Trump as he courts MAGA voters … - Kennedy is now drawing fire from Trump and other conservatives who once hailed Kennedy's campaign. … - “This is a humanitarian crisis because of the understanding across the globe that we now have an open border here,” … ",
    "url": "https://www.axios.com/2024/04/10/kennedy-trump-maga-biden-voters"
  },
  {
    "text": "Scoop: Biden plans order to limit southern border crossings by end of month … But Biden, briefed on polls of rising voter anger, wants a dramatic step. … - Biden would use authority in Section 212(f) of the Immigration and Nationality Act, which gives the president broad leeway … ",
    "url": "https://www.axios.com/2024/04/10/biden-border-executive-order-immigrants-asylum-limit"
  },
  {
    "text": "Siding with special counsel, Cannon agrees to keep witness identities secret  —  Despite sharp words for prosecutors, the Trump-appointed judge in the classified documents case said they presented evidence to justify the sealing.  —  The judge handling the classified documents case … ",
    "url": "https://www.politico.com/news/2024/04/09/cannon-agrees-to-keep-witness-identities-secret-00151402"
  },
  {
    "text": "Trump's deeply misogynist lie about moms killing babies  —  It reveals a fear of women's empowerment he shares with the Christian right. … On Monday, Donald Trump released a video announcing his much heralded abortion “policy.”  The statement was typically garbled, deliberately vague, and chock full of absurd assertions.",
    "url": "https://www.publicnotice.co/p/trump-abortion-statement-lie-moms-killing-babies"
  },
  {
    "text": "Tied California House race heading to a recount  —  A spokesperson for one of the tied candidates blasted the recount request as “a page right out of Trump's political playbook.”  —  SACRAMENTO, California — Officials in Santa Clara County are gearing up for a recount in the wild race … ",
    "url": "https://www.politico.com/news/2024/04/09/tied-california-house-race-heading-to-a-recount-00151424"
  },
  {
    "text": "Zelensky ups pressure on Trump to visit war-torn Ukraine  —  Ukrainian President Volodymyr Zelensky is urging former President Trump to come and visit war-torn Ukraine, amid reports that he would pressure Ukraine to cede land to Russia if he return to the White House.",
    "url": "https://thehill.com/policy/international/4584958-zelensky-pressure-trump-visit-ukraine/"
  },
  {
    "text": "Klain on Biden: He is focused too much on bridges  —  The former chief of staff praised the president's accomplishments.  But he also wondered whether he had the right focus.  —  Former White House chief of staff Ron Klain openly questioned President Joe Biden's political strategy Tuesday night … ",
    "url": "https://www.politico.com/news/2024/04/09/ron-klain-joe-biden-infrastructure-00151438"
  },
  {
    "text": "Nuclear deal in tatters, Iran edges close to weapons capability  —  Six years after the Trump administration withdrew from the Iran nuclear accord, Tehran is rapidly accumulating enriched uranium, some of it very close to weapons grade.  Experts fear that a bomb could be a short dash away.",
    "url": "https://www.washingtonpost.com/national-security/2024/04/10/iran-nuclear-bomb-iaea-fordow/"
  },
  {
    "text": "Exit polls suggest a big win by South Korea's liberal opposition parties in parliamentary election  —  (AP Video/Yong Jun Chang and Yong-ho Kim)  —  South Koreans prepare to vote for new 300-member parliament, AP explains  —  South Korea's liberal opposition parties were expected to win … ",
    "url": "https://apnews.com/article/south-korea-parliamentary-election-yoon-c362a024e6eff3d4a410927be00b4d0c"
  },
  {
    "text": "Consumers will finally see FCC-mandated ‘nutrition labels’ for most broadband plans … Starting on Wednesday, all but the smallest ISPs will be required to publish broadband “nutrition labels” on all of their plans, the regulator announced.  The FCC's intention behind the labels … ",
    "url": "https://www.theverge.com/2024/4/10/24125572/fcc-broadband-nutrition-labels-isp-deadline-today"
  },
  {
    "text": "Paul Simon tapped to perform and menu released for Japanese state dinner  —  Guests at the state dinner for Japan at the White House will dine on house-cured salmon and pistachio cake with matcha ganache, and are set to get some A-list entertainment with a performance by Paul Simon.",
    "url": "https://thehill.com/blogs/in-the-know/4585236-paul-simon-tapped-menu-released-japanese-state-dinner/"
  },
  {
    "text": "Biden administration imposes first-ever national drinking water limits on toxic PFAS  —  The Biden administration on Wednesday finalized strict limits on certain so-called “forever chemicals” in drinking water that will require utilities to reduce them to the lowest level they can be reliably measured.",
    "url": "https://apnews.com/article/forever-chemicals-pfas-pollution-epa-drinking-water-1c8804288413a73bb7b99fc866c8fa51"
  },
  {
    "text": "America's moment of truth on Ukraine  —  Republicans have a stark choice: help Zelenskyy or pay fealty to Trump  —  The last time David Cameron, Britain's foreign secretary, urged Capitol Hill to pass Ukraine aid, he was told to “kiss my ass” by Marjorie Taylor Greene, one of the most vocal pro-Russia Republicans.",
    "url": "https://www.ft.com/content/98f37cee-aaf6-47c5-b032-bde2968e00f0"
  },
  {
    "text": "Biden's strategy to reach tuned-out voters: Content over crowds  —  Biden's re-election hinges on disengaged voters.  His campaign is trying to reach them one video at a time.  —  President Joe Biden's recent battleground state campaign tour didn't draw major crowds.",
    "url": "https://www.nbcnews.com/politics/2024-election/bidens-strategy-reach-tuned-voters-content-crowds-rcna146146"
  },
  {
    "text": "Hundreds of groups urge Big Tech CEOs to step up fight against AI-fueled lies  —  Happy Tuesday!  I am pinch-hitting for my colleagues Cristiano and Will today.  Send your worst AI deepfakes to naomi.nix@washpost.com.  —  More than 200 civil advocacy groups are calling on Big Tech to bolster … ",
    "url": "https://www.washingtonpost.com/politics/2024/04/09/hundreds-groups-urge-big-tech-ceos-step-up-fight-against-ai-fueled-lies/"
  },
  {
    "text": "Trump's ‘Virtues’ and Other Fairy Tales  —  FOLLOW THE MONEY.  That phrase—a legendary Hollywood screenwriter's addition to the Watergate lore—turns out in fact to be excellent advice for an investigation.  And if one is investigating how the Claremont Institute, the California-based think tank … ",
    "url": "https://www.thebulwark.com/p/trumps-virtues-and-other-fairy-tales"
  }
]