[
  {
    "text": "New speaker of the House Mike Johnson once wrote in support of the criminalization of gay sex  —  Speaker of the House Mike Johnson has a history of harsh anti-gay language from his time as an attorney for a socially conservative legal group in the mid-2000s.",
    "url": "https://www.cnn.com/2023/10/25/politics/mike-johnson-gay-sex-criminalization-kfile/"
  },
  {
    "text": "What everyone should know about the new House Speaker, Mike Johnson  —  Judd Legum, Tesnim Zekeria, and Rebecca Crosby  —  On Wednesday, after weeks of chaos, House Republicans unanimously selected Congressman Mike Johnson (R-LA) as the new Speaker.  Compared to the previous Republican candidates … ",
    "url": "https://popular.info/p/what-everyone-should-know-about-the"
  },
  {
    "text": "The inmates elect their new asylum leader  —  Also: Bellingcat's Eliot Higgins on the golden age of Twitter disinformation.  —  ∙ Paid … The latter part of this newsletter features a Q&A with Bellingcat's Eliot Higgins.  But before we get to that, I want to share some quick thoughts on the new House speaker.",
    "url": "https://www.publicnotice.co/p/speaker-maga-mike-johnson-explained"
  },
  {
    "text": "The New Speaker is Everything Voters Hate about the GOP  —  The election of a Far Right Speaker is a huge opportunity for Democrats to once again run against MAGA Extremism  —  After three weeks, multiple failed votes, and several well known Republicans face-planting on the House floor … ",
    "url": "https://www.messageboxnews.com/p/the-new-speaker-is-everything-voters"
  },
  {
    "text": "Playbook: What's in store for Speaker Johnson  —  Presented by With help from Eli Okun and Garrett Ross  —  DRIVING THE DAY  —  LATEST IN MAINE — Lewiston Sun Journal: “At least 16 people were killed and dozens more injured in multiple shootings here Wednesday night, in what is likely the deadliest shooting in Maine's history.”",
    "url": "https://www.politico.com/newsletters/playbook/2023/10/26/whats-in-store-for-speaker-johnson-00123692"
  },
  {
    "text": "How Mike Johnson's main strength will become his biggest liability  —  Everyone agrees that the Louisianan's anonymity helped him get the speakership.  It won't help him with the long list of other congressional crises.  —  Mike Johnson's anonymity in Washington was a driving force … ",
    "url": "https://www.politico.com/news/2023/10/25/how-mike-johnson-won-an-impossible-speakership-00123529"
  },
  {
    "text": "Exclusive: Fulton County DA has discussed plea deals with at least 6 more Trump co-defendants  —  Fulton County prosecutors have discussed potential plea deals with at least six additional co-defendants charged alongside Donald Trump for attempting to subvert the 2020 presidential election, multiple sources tell CNN.",
    "url": "https://www.cnn.com/2023/10/25/politics/fulton-county-da-is-discussing-plea-deals-with-at-least-5-more-trump-co-defendants/"
  },
  {
    "text": "Special counsel urges judge to reimpose Trump's federal gag order  —  Prosecutors say Trump's recent verbal attacks show he's a threat to D.C. proceedings — and the safety of witnesses.  —  Special counsel Jack Smith is urging a federal judge to reinstate a gag order on Donald Trump … ",
    "url": "https://www.politico.com/news/2023/10/25/special-counsel-trump-federal-gag-order-00123676"
  },
  {
    "text": "The One Simple Trick For Avoiding Prison Could Be Slipping Out Of Reach For Trump  —  As the coup-attempting former president's co-defendants continue taking plea deals, his bargaining position for a deal of his own gets weaker.  —  WASHINGTON — As Donald Trump's co-defendants and associates … ",
    "url": "https://www.huffpost.com/entry/trump-plea-deal-slipping_n_65394be5e4b0c8556103bef9"
  },
  {
    "text": "At least 16 dead, dozens wounded in Lewiston shootings; police give few details on overnight search for gunman  —  A commercial man lift falls off trailer and blocks Route 4 in Rangeley  —  Hundreds of new laws take effect in Maine Wednesday.  Here's what you need to know",
    "url": "https://www.sunjournal.com/2023/10/25/multiple-victims-reported-following-shootings-in-lewiston/"
  },
  {
    "text": "At Least 16 Killed in Maine Shootings With Suspect at Large  —  A man opened fire at a bowling alley and a bar in Lewiston, Maine, on Wednesday night, killing at least 16 people and engulfing the state's second-largest city in chaos.  The suspect remained at large as authorities ordered residents … ",
    "url": "https://www.bloomberg.com/en/news/thp/2023-10-26/urgent-police-say-there-s-an-active-shooter-in-lewiston-maine-and-they-are-investigating-multiple-scenes"
  },
  {
    "text": "Justice Thomas's R.V. Loan Was Forgiven, Senate Inquiry Finds  —  The justice failed to repay much, perhaps all, of the $267,230 loan.  His benefactor wiped the slate clean, with ethical and potential tax consequences.  —  The terms of the private loan were as generous as they were clear … ",
    "url": "https://www.nytimes.com/2023/10/25/us/politics/clarence-thomas-rv-loan-senate-inquiry.html"
  },
  {
    "text": "Judge orders Trump to take the stand in N.Y. fraud trial, fines him $10,000 for violating gag order again  —  Trump was called to testify for the first time in the New York trial and was fined $10,000 for violating his gag order again.  —  Donald Trump stormed out of a Manhattan courtroom Wednesday … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/judge-orders-trump-take-stand-ny-fraud-trial-fines-10000-violating-gag-rcna122199"
  },
  {
    "text": "Remarks by President Biden and Prime Minister Anthony Albanese of Australia in Joint Press Conference  —  PRESIDENT BIDEN:  The sun is over there.  (The President removes his sunglasses.)  I don't need these.  (Laughter.)  —  Hello, folks.  —  Mr. Prime Minister, we've been in close touch since … ",
    "url": "https://www.whitehouse.gov/briefing-room/speeches-remarks/2023/10/25/remarks-by-president-biden-and-prime-minister-anthony-albanese-of-australia-in-joint-press-conference/"
  },
  {
    "text": "Harvard Creates Task Force for Doxxed Students Amid Backlash Over Israel Statement  —  Harvard will establish a task force to support students experiencing doxxing, harassment, and online security issues following backlash against students allegedly affiliated with a statement that held Israel … ",
    "url": "https://www.thecrimson.com/article/2023/10/25/doxxing-task-force/"
  },
  {
    "text": "New York Republicans to push ahead with resolution to expel George Santos from House  —  Some New York Republicans say they're going to push ahead with a formal resolution to expel embattled Rep. George Santos, Republican of New York, now that the House is open after its three-week speaker stalemate.",
    "url": "https://www.cbsnews.com/news/george-santos-expel-from-house/"
  }
]