[
  {
    "text": "Live Updates: One Juror Dismissed as Selection Continues in Trump Trial  —  The third day of Donald J. Trump's criminal trial began with the dismissal of one of the seven jurors who had already been seated.  The former president is accused of falsifying business records to cover up a sex scandal.",
    "url": "https://www.nytimes.com/live/2024/04/18/nyregion/trump-hush-money-trial"
  },
  {
    "text": "2 members of Trump jury excused, including woman who feared being identified  —  Two people who were selected to serve on the jury in former President Donald Trump's criminal trial in New York were excused on Thursday, including one woman who expressed concerns about being identified publicly and her ability to remain impartial.",
    "url": "https://www.cbsnews.com/news/donald-trump-new-york-court-criminal-trial/"
  },
  {
    "text": "Conservatives corner Mike Johnson in House floor confrontation … - The House changed its rules this Congress to allow a single member to challenge the speaker's job with a motion to vacate.  — One option being urged by Johnson allies is to change House rules in coming days to force … ",
    "url": "https://www.axios.com/2024/04/18/mike-johnson-gaetz-motion-to-vacate-ukraine"
  },
  {
    "text": "Momentum grows to remove Johnson over potential change to ouster rule  —  Momentum is growing quickly behind the effort to remove Speaker Mike Johnson (R-La.) from power if he moves to alter the motion to vacate rule as part of a package of foreign aid that's expected to pass through the House this weekend.",
    "url": "https://thehill.com/homenews/house/4602553-speaker-johnson-ouster-rule/"
  },
  {
    "text": "RFK Jr. gains ballot access in Michigan, campaign says … - Kennedy has been waging an uphill battle to get his independent presidential bid on the ballot in states across the country.  — He had already officially qualified to appear on the presidential ballot in Utah … ",
    "url": "https://www.axios.com/2024/04/18/rfk-jr-michigan-ballot-2024"
  },
  {
    "text": "Playbook: Why Biden world has gone quiet on the Trump trial  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  THE BUZZ OF THE LEGAL WORLD — “2 of Trump's jurors are lawyers.  Would they acquit on a technicality?” by Betsy Woodruff Swan … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/04/18/why-biden-world-has-gone-quiet-on-the-trump-trial-00152989"
  },
  {
    "text": "Key Takeaways … Approximately half (53%) of young Americans indicate they will “definitely be voting” in the 2024 general election for president.  Young Americans' interest in voting in 2024 is now on par with Harvard Youth Poll data from 2020, which indicated that 54% would likely vote.",
    "url": "https://iop.harvard.edu/youth-poll/47th-edition-spring-2024#key-takeaway--id--1564"
  },
  {
    "text": "Trump is funneling campaign money into cash-strapped businesses.  Experts say it looks bad.  —  Donald Trump's main 2024 White House campaign fundraising operation sharply increased spending at the former president's properties in recent months, funneling money into his businesses … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/04/18/trump-campaign-funnels-money-to-his-businesses/73344744007/"
  },
  {
    "text": "Miscalculation Led to Escalation in Clash Between Israel and Iran  —  Israeli officials say they didn't see a strike on a high-level Iranian target in Syria as a provocation, and did not give Washington a heads-up about it until right before it happened.  —  Israel was mere moments away … ",
    "url": "https://www.nytimes.com/2024/04/17/world/middleeast/iran-israel-attack.html"
  },
  {
    "text": "Complaint Asks the FBI to Probe Trump Claims on a $50 Million Loan  —  GIMME SHELTER  —  A government watchdog group is filing a complaint about a $50 million loan that Trump claimed for years on government disclosure forms but which may have never existed.",
    "url": "https://www.thedailybeast.com/complaint-asks-the-fbi-to-probe-trump-claims-on-a-dollar50-million-loan"
  },
  {
    "text": "Freedom Caucus on alert for possible moves against it by GOP leaders  —  The Floor Action Response Team, shorthanded as “FART,” aims to guard against an unannounced request to pass resolutions that would limit the group's leverage.",
    "url": "https://www.politico.com/live-updates/2024/04/18/congress/hfc-on-alert-00153097"
  },
  {
    "text": "Top Democrat in fiery speech says House ‘diddling around’ while people ‘dying in Ukraine’  —  Rep. Rosa DeLauro (Conn.), the top Democrat on the House Appropriations Committee, delivered a fiery speech during a debate on foreign aid Thursday, accusing the lower chamber of “diddling around” … ",
    "url": "https://thehill.com/homenews/house/4602675-top-democrat-delauro-house-diddling-around-while-people-dying-ukraine-foreign-aid/"
  },
  {
    "text": "36-year-old joins wave of House Republican retirements … - Two House Republicans told Axios they expect more retirement announcements in the coming weeks. … - “It is time to pursue other opportunities and have the benefit of spending more time with my family,” he said.",
    "url": "https://www.axios.com/2024/04/18/jake-laturner-retire-house-gop-kansas"
  },
  {
    "text": "Google fires 28 employees involved in sit-in protest over $1.2B Israel contract  —  Google has fired 28 employees over their participation in a 10-hour sit-in at the search giant's offices in New York and Sunnyvale, California, to protest the company's business ties with the Israel government, The Post has learned.",
    "url": "https://nypost.com/2024/04/17/business/google-fires-28-employees-involved-in-sit-in-protest-over-1-2b-israel-contract/"
  },
  {
    "text": "GOP makes weak pitch as Senate rejects Mayorkas impeachment articles  —  Republicans are pretending that Democrats set a dangerous precedent by discarding Alejandro Mayorkas' impeachment without a trial.  They have it backwards.  —  More than a month after House Republicans impeached … ",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/gop-makes-weak-pitch-senate-rejects-mayorkas-impeachment-articles-rcna148343"
  },
  {
    "text": "Biden suggests uncle eaten by ‘cannibals’ in New Guinea — but military says his WWII plane lost at sea  —  President Biden twice implied Wednesday that his uncle Ambrose Finnegan was eaten by cannibals in New Guinea after his plane crashed during World War II — even though military records show … ",
    "url": "https://nypost.com/2024/04/17/us-news/biden-suggests-uncle-eaten-by-cannibals-in-new-guinea-but-military-says-his-wwii-plane-lost-at-sea/"
  },
  {
    "text": "The anti-abortion movement is showing its true colors  —  The facade of the anti-abortion movement is cracking, despite the movement's strenuous attempts to appear reasonable.  Evidence has been coming fast and furious this year, thanks to courts stacked with anti-abortion judges whose radical decisions … ",
    "url": "https://thehill.com/opinion/judiciary/4602554-the-anti-abortion-movement-is-showing-its-true-colors/"
  },
  {
    "text": "Rep. Mike Gallagher hints death threats may be behind his early resignation  —  GREEN BAY, Wisc.  (WLUK) — With just days until he leaves his seat in Congress, Rep. Mike Gallagher, R-Wisc., could be shedding some light on the reasoning behind his early resignation",
    "url": "https://nbcmontana.com/news/connect-to-congress/rep-mike-gallagher-hints-young-family-death-threats-may-be-behind-his-early-resignation-house-select-committee-on-the-chinese-communist-party-alejandro-mayorkas-fbi-capitol-police-swatting-family-secret-service-law-enforcement-reporters-fentanyl-china"
  },
  {
    "text": "WaPo Gives Bill Barr Platform to Attack Joe Biden without Mentioning Barr's Role in Framing Biden  —  WaPo wrote a story on Bill Barr's statement on Fox News that he would support Trump over Biden because Biden would represent a “continuation of the Biden administration is national suicide.”",
    "url": "https://www.emptywheel.net/2024/04/18/wapo-gives-bill-barr-platform-to-attack-joe-biden-without-mentioning-barrs-role-in-framing-biden/"
  },
  {
    "text": "Risk of bird flu spreading to humans is ‘enormous concern’, says WHO  —  Chief scientist voices fears about H5N1 variant that has ‘extraordinarily high’ mortality rate in humans  —  The World Health Organization has raised concerns about the spread of H5N1 bird flu, which has an “extraordinarily high” mortality rate in humans.",
    "url": "https://www.theguardian.com/world/2024/apr/18/risk-bird-flu-spreading-humans-enormous-concern-who"
  }
]