[
  {
    "text": "Trump ex-chief Mark Meadows asks judge to protect him from arrest as he seeks to move Georgia case to federal court  — Former Trump chief of staff Mark Meadows asked a federal judge to immediately move the Georgia election case out of state court in order to protect him from being arrested.",
    "url": "https://www.cnbc.com/2023/08/22/trump-ex-aide-meadows-asks-judge-to-protect-him-from-arrest-in-ga-case.html"
  },
  {
    "text": "Donald Trump to surrender at Fulton county jail on Thursday night  —  Exclusive: Trump had lawyers negotiate booking to take place during prime viewing hours to get maximum television ratings  —  Donald Trump is expected to surrender at the Fulton county jail on Thursday evening on racketeering … ",
    "url": "https://www.theguardian.com/us-news/2023/aug/22/donald-trump-surrender-fulton-county-jail-thursday-night"
  },
  {
    "text": "Trump attorneys guided false electors in Georgia, GOP chair says  —  The false electors were later used by Trump allies to attempt to foment a conflict on Jan. 6, 2021 and derail the transfer of power to President Joe Biden.  —  Former Georgia Republican Party Chair David Shafer said attorneys … ",
    "url": "https://www.politico.com/news/2023/08/22/trump-indictment-false-electors-00112229"
  },
  {
    "text": "D.C. Attorney General is probing Leonard Leo's network  —  The Federalist Society co-chair and ex-Trump judicial adviser has utilized nonprofit groups to collect more than $1 billion for conservative causes.  —  Washington D.C. Attorney General Brian Schwalb is investigating judicial activist Leonard Leo … ",
    "url": "https://www.politico.com/news/2023/08/22/d-c-attorney-general-is-probing-leonard-leos-network-00112331"
  },
  {
    "text": "Tucker Carlson and Donald Trump reunite to try to upstage Fox News  —  The on-again, off-again partnership found mutual benefit in a pre-recorded interview to air during the first Republican presidential debate  —  Last Wednesday, Donald Trump welcomed Tucker Carlson and his small team … ",
    "url": "https://www.washingtonpost.com/politics/2023/08/22/tucker-carlson-donald-trump-reunite-try-upstage-fox-news/"
  },
  {
    "text": "A key witness in the Trump classified docs case changed his testimony after switching lawyers, special counsel says  —  The man identified as “Trump Employee 4” had been represented by Stanley Woodward, who was being paid by the former president's Save America PAC.",
    "url": "https://www.nbcnews.com/politics/donald-trump/witness-trump-docs-case-changed-testimony-switching-lawyers-special-co-rcna101308"
  },
  {
    "text": "Trump Campaign Trolls DeSantis in Milwaukee on Eve of GOP Debate  —  It's the latest example of the Trump campaign's efforts to mock the Florida governor  —  A Facebook icon representing an external link to share the article on Facebook.A Twitter icon representing an external link to share … ",
    "url": "https://themessenger.com/politics/trump-campaign-trolls-desantis-in-milwaukee-on-eve-of-gop-debate"
  },
  {
    "text": "Trump vows massive new tariffs if elected, risking global economic war  —  Former president floats 10 percent tax on all foreign imports and calls for ‘ring around the collar’ of U.S. economy  —  Even in the face of growing personal legal peril, Donald Trump summoned his top economic advisers … ",
    "url": "https://www.washingtonpost.com/business/2023/08/22/trump-trade-tariffs/"
  },
  {
    "text": "Audio: Vivek Ramaswamy Says He Wants ‘the Truth About 9/11’  —  The GOP presidential candidate claimed The Atlantic misquoted him.  Listen for yourself.  —  This summer, I set out to write about Vivek Ramaswamy because I thought that his public-speaking skills set him apart from his GOP presidential rivals.",
    "url": "https://www.theatlantic.com/politics/archive/2023/08/vivek-ramaswamy-audio-recording/675076/"
  },
  {
    "text": "The Secret Weapon Hackers Can Use to Dox Nearly Anyone in America for $15  —  Most Americans have very little choice but to provide their personal information to credit bureaus.  Hackers have found a way into that data supply chain, and are advertising access in group chats used by violent criminals who rob, assault, and shoot targets.",
    "url": "https://www.404media.co/the-secret-weapon-hackers-can-use-to-dox-nearly-anyone-in-america-for-15-tlo-usinfosearch-transunion/"
  },
  {
    "text": "Alaska Gov. Mike Dunleavy endorses Donald Trump  —  Most Republican governors have been hesitant to endorse in the presidential race.  —  Alaska Gov. Mike Dunleavy is endorsing Donald Trump, giving the former president the support of a governor whose state is expected to hold its nominating contest … ",
    "url": "https://www.politico.com/news/2023/08/22/alaska-gov-mike-dunleavy-endorses-donald-trump-00112332"
  },
  {
    "text": "Why do Republicans disproportionately believe health misinformation?  —  Rep. Marjorie Taylor Greene (R-Ga.) had only one comment to add when sharing a wildly conspiratorial article alleging that the recent surge in covid cases could be a way to force compliance with vaccination efforts … ",
    "url": "https://www.washingtonpost.com/politics/2023/08/22/republicans-vaccines-polls/"
  },
  {
    "text": "‘Cherry-picking’: Candidates lash out at RNC after not making debate stage  —  Perry Johnson said he planned to take legal action.  So did Larry Elder.  And Will Hurd said he thought the RNC cherry-picked polls.  —  The Republican National Committee announced late Monday night … ",
    "url": "https://www.politico.com/news/2023/08/22/republican-debate-2024-participants-00112282"
  },
  {
    "text": "McCarthy: House could launch impeachment inquiry ‘when we come back into session’  —  Speaker Kevin McCarthy (R-Calif.) warned Tuesday that the House could launch an impeachment inquiry as soon as September if the Biden administration doesn't turn over documents — including some that were apparently never requested by the GOP.",
    "url": "https://thehill.com/homenews/house/4165602-mccarthy-house-could-launch-impeachment-inquiry-when-we-come-back-into-session/"
  },
  {
    "text": "Russian Offensive Campaign Assessment, August 21, 2023  —  Click here to see ISW's interactive map of the Russian invasion of Ukraine.  This map is updated daily alongside the static maps present in this report.  —  Click here to access ISW's archive of interactive time-lapse maps of the Russian invasion of Ukraine.",
    "url": "https://understandingwar.org/backgrounder/russian-offensive-campaign-assessment-august-21-2023"
  },
  {
    "text": "Crying Covenant School Parents Booted From Tennessee Special Session  —  Despite pleas from loved ones, Tennessee state legislators passed a bill that will allow more guns on school campuses.  —  The grieving parents of children who were massacred at The Covenant School in March or whose children … ",
    "url": "https://www.thedailybeast.com/covenant-school-shooting-parents-in-tears-as-theyre-kicked-out-of-tennessee-special-session"
  },
  {
    "text": "Inside the text-for-pay campaign that got Asa Hutchinson on the debate stage  —  Students were paid $20 a pop for every $1 donation they found for the former Arkansas governor.  —  Live from a Des Moines television studio, Asa Hutchinson, the longshot presidential candidate … ",
    "url": "https://www.politico.com/news/2023/08/22/text-for-pay-campaign-asa-hutchinson-00112298"
  },
  {
    "text": "Rep. Van Orden says eldest daughter died after battle with cancer  —  Rep. Derrick Van Orden (R-Wis.) said Tuesday that his oldest daughter, Sydney Marie (Van Orden) Martenis, died after a yearlong battle with an aggressive form of cancer.  —  Van Orden said she died “peacefully surrounded by her family” … ",
    "url": "https://thehill.com/blogs/blog-briefing-room/news/4165225-rep-van-orden-says-eldest-daughter-died-after-battle-with-cancer/"
  }
]