[
  {
    "text": "Trump is suddenly in need of a lot of cash.  That's everyone's problem.  —  The former president was just ordered to pay $355 million in his New York fraud case, bringing the tally this year to nearly half a billion dollars in civil damages.  —  Two recent verdicts have now left Donald Trump … ",
    "url": "https://www.vox.com/24073920/trump-financial-new-york-trouble-fraud-e-jean-carroll-civil-suit-damages-debt"
  },
  {
    "text": "Trump Ordered to Pay $355 Million and Barred From New York Business  —  The ruling in Donald J. Trump's civil fraud case could cost him all his available cash.  The judge said that the former president's “complete lack of contrition” bordered on pathological.",
    "url": "https://www.nytimes.com/2024/02/16/nyregion/trump-civil-fraud-trial-ruling.html"
  },
  {
    "text": "Trump and His Family Are Fined $355 Million for Fraud—and a Lack of Remorse That “Borders on Pathological”  —  The ruling, if upheld, marks the end of the Trump Organization as we know it.  —  New York Supreme Court Justice Arthur Engoron ordered Donald Trump to pay $355 million in fines … ",
    "url": "https://slate.com/news-and-politics/2024/02/donald-trump-civil-fraud-355-million-new-york-restrictions-trump-organization.html"
  },
  {
    "text": "For Donald Trump, the Recriminations Will Be Televised  —  The former president's trials aren't being aired.  That isn't stopping him from turning them into a political reality show.  —  The civil-fraud case against Donald J. Trump's businesses in New York, in which he was ordered to pay a penalty of $355 million, was not televised.",
    "url": "https://www.nytimes.com/2024/02/17/arts/television/donald-trump-trials.html"
  },
  {
    "text": "Zelenskiy Invites Trump to Observe ‘Real War’ at Frontlines  — Former president has questioned US commitment to NATO alliance  — Ukrainian leader in Germany at Munich Security Conference  —  Ukrainian President Volodymyr Zelenskiy invited Donald Trump to travel with him to the frontlines … ",
    "url": "https://www.bloomberg.com/news/articles/2024-02-17/zelenskiy-invites-trump-to-experience-real-war-at-frontlines"
  },
  {
    "text": "Trump's legal debts top a half-billion dollars.  Will he have to pay?  —  NEW YORK (AP) — Donald Trump's legal debts might now exceed a half-billion dollars.  —  A New York judge ordered Trump and his companies Friday to pay $355 million in fines, plus interest, after ruling that he had manipulated … ",
    "url": "https://apnews.com/article/trump-fraud-carroll-fines-82d423b8e7a7f9a32470729c5f4410e5"
  },
  {
    "text": "'I Have to Say Goodbye.  But I Don't Want to Go to Jail.'  —  One of Navalny's closest friends mourns his death, and Russia's future.  —  Alexei Navalny didn't want to be a martyr.  What he wanted, according to Yevgenia Albats, one of his closest friends, was to lead his country.",
    "url": "https://www.politico.com/news/magazine/2024/02/17/alexei-navalny-death-russia-putin-00142002"
  },
  {
    "text": "Which came first, the Biden age concerns or the coverage of them?  —  It is immediately obvious why the White House pushed back as hard as it did on a draft of a report from special counsel Robert Hur summarizing his investigation into President Biden's possession of classified materials.",
    "url": "https://www.washingtonpost.com/politics/2024/02/16/biden-age-concerns/"
  },
  {
    "text": "Ex-FBI official sentenced to over two years for hiding payment from Albanian businessman  —  WASHINGTON - A former top FBI counterintelligence official was sentenced on Friday to 28 months in prison for concealing at least $225,000 he took from an Albanian businessperson with ties to the Albanian government.",
    "url": "https://www.usatoday.com/story/news/politics/2024/02/17/charles-mcgonigal-fbi-official-albania/72640427007/"
  },
  {
    "text": "The majority of traffic from Elon Musk's X may have been fake during the Super Bowl, report suggests  —  These numbers are legitimately shocking. … Also riding high from the big game?  Elon Musk's X. The company formerly known as Twitter published its own press release … ",
    "url": "https://mashable.com/article/x-twitter-elon-musk-bots-fake-traffic"
  },
  {
    "text": "Justice Department Transfers Approximately $500,000 in Forfeited Russian Funds to Estonia for Benefit of Ukraine  —  For Immediate Release  —  Estonia to Support Ukraine Using Funds Forfeited by United States After Interception of Sophisticated Military-Grade Machinery Bound for Russia; Defendant in Scheme Separately Pleads Guilty",
    "url": "https://www.justice.gov/opa/pr/justice-department-transfers-approximately-500000-forfeited-russian-funds-estonia-benefit"
  },
  {
    "text": "‘Star witness’ mostly silent in hearing to disqualify Fani Willis  —  ATLANTA — A man billed as the “star witness” in the case to disqualify Fulton County District Attorney Fani T. Willis (D) took the stand Friday and acknowledged he exchanged text messages about Willis with the defense attorney … ",
    "url": "https://www.washingtonpost.com/national-security/2024/02/16/fani-willis-hearing-terrence-bradley-trump-georgia/"
  },
  {
    "text": "GOP House chair: Johnson has no way out of Ukraine floor vote  —  The GOP chair of the House Foreign Affairs Committee was bullish Friday on the chamber delivering U.S. military assistance to Ukraine, Israel and Taiwan, despite the “brainwashing” of some within his caucus who oppose foreign spending … ",
    "url": "https://thehill.com/homenews/house/4473343-mccaul-johnson-ukraine-aid-floor-vote/"
  },
  {
    "text": "February 2024 National Poll: Biden Performs Strongest Against Trump among Prominent Democrats  —  Biden's Age,Trump's Criminal Indictments Raise ‘Serious Doubts’ for Majority of Voters  —  A new Emerson College Polling national survey on the potential 2024 presidential election reveals … ",
    "url": "https://emersoncollegepolling.com/february-2024-national-poll-biden-performs-strongest-against-trump-among-prominent-democrats/"
  },
  {
    "text": "U.S. Plans to Send Weapons to Israel Amid Biden Push for Cease-Fire Deal  —  Delivery would include bombs, precision-guidance kits and bomb fuses  —  ISTANBUL—The Biden administration is preparing to send bombs and other weapons to Israel that would add to its military arsenal … ",
    "url": "https://www.wsj.com/world/middle-east/u-s-plans-to-send-weapons-to-israel-amid-biden-push-for-cease-fire-deal-184e75bc?mod=politics_whatsnews_pos3"
  }
]