[
  {
    "text": "Exclusive: Trump ally Bernie Kerik meets with special counsel investigators  —  Donald Trump ally Bernie Kerik met Monday with special counsel Jack Smith's investigators who are handling the probe related to the 2020 election aftermath and the January 6, 2021, insurrection.",
    "url": "https://www.cnn.com/2023/08/07/politics/bernie-kerik-trump-grand-jury/"
  },
  {
    "text": "Trump and his new lawyer are not on the same page about judge's recusal  —  The former president's public statements are already diverging from the advice of his newest lawyer, John Lauro.  —  Donald Trump blared Sunday morning that his legal team would be “immediately asking for recusal” … ",
    "url": "https://www.politico.com/news/2023/08/07/trump-lawyer-judge-recusal-00110103"
  },
  {
    "text": "‘Of course he lost’: Ron DeSantis rejects Trump's 2020 election claims  —  Florida Gov. Ron DeSantis on Sunday rejected Donald Trump's claim that he was the true winner of the 2020 presidential election in his most forceful comments to date on the matter.  —  “Whoever puts their hand … ",
    "url": "https://www.nbcnews.com/politics/2024-election/ron-desantis-of-course-trump-lost-2020-election-rcna98200"
  },
  {
    "text": "‘Fake’ elector plot raised concerns over legal peril, indictment shows  —  A contingency plan, a crime or a ‘donkey show’?  Doubts across seven states and within the Trump campaign.  —  Six weeks after the 2020 election, senior campaign officials for Donald Trump called a group … ",
    "url": "https://www.washingtonpost.com/national-security/2023/08/07/fake-electors-trump-indictment/"
  },
  {
    "text": "The Pelosi Factor … If you were going to draw up a list of the people most responsible for the latest indictment of Donald Trump, the former president himself would be at the top, followed by the prosecutors who have brought the case.  Republicans in Congress perversely deserve a great deal of credit … ",
    "url": "https://nymag.com/intelligencer/2023/08/how-nancy-pelosi-long-game-led-to-trumps-indictment.html"
  },
  {
    "text": "John Eastman, awaiting potential indictment, asks judge to postpone his disbarment proceedings  —  The lawyer who advised Donald Trump in the weeks leading up to Jan. 6 is known as “co-conspirator 2” in the special counsel's newest case.  —  Attorney John Eastman, an architect of Donald Trump's … ",
    "url": "https://www.politico.com/news/2023/08/07/eastman-trump-disbarment-postpone-00110131"
  },
  {
    "text": "Judge dismisses Trump's defamation claim against E. Jean Carroll  —  A U.S. judge on Monday dismissed Donald Trump's defamation counterclaim against the writer E. Jean Carroll, handing a fresh legal defeat to the former president as he seeks another White House term.",
    "url": "https://www.reuters.com/legal/judge-dismisses-donald-trumps-defamation-claim-against-e-jean-carroll-2023-08-07/"
  },
  {
    "text": "Trump counterclaim against E. Jean Carroll dismissed, DA can get deposition  — A federal judge dismissed a counterclaim by Donald Trump against the writer E. Jean Carroll in her pending lawsuit that accuses him of defaming her after she wrote that he had raped her.",
    "url": "https://www.cnbc.com/2023/08/07/judge-trump-deposition-in-e-jean-carroll-case-can-go-to-prosecutors.html"
  },
  {
    "text": "The Weaponization of Loneliness  —  To defend America against those who would exploit our social disconnection, we need to rebuild our communities.  —  The question that preoccupied me and many others over much of the past eight years is how our democracy became so susceptible to a would-be strongman and demagogue.",
    "url": "https://www.theatlantic.com/ideas/archive/2023/08/hillary-clinton-essay-loneliness-epidemic/674921/"
  },
  {
    "text": "Officer who held back crowd during George Floyd's murder sentenced to over 4 years in prison  —  Tou Thao, the former Minneapolis police officer who held back a crowd of bystanders during George Floyd's fatal arrest in May 2020, was sentenced to four years and nine months in prison Monday … ",
    "url": "https://www.cnn.com/2023/08/07/us/tou-thao-george-floyd-sentence/"
  },
  {
    "text": "The Mystery Behind Russia's Secret VIP Flight to North Korea  —  The stealthy military flight comes a week after Russia's defense minister visited Pyongyang with the goal of convincing North Korea to boost weapons sales to Moscow.  —  A Russian military plane made a mysterious trip to Pyongyang on August 1, according to flight radar.",
    "url": "https://www.thedailybeast.com/secret-russian-military-flight-to-north-korea-fuels-fears-of-weapons-sales"
  },
  {
    "text": "The Secret Hand Behind the Women Who Stood by Cuomo?  His Sister.  —  For nearly two years, Madeline Cuomo back channeled with grass-roots activists to help smear her brother's accusers.  He was “seeing everything,” she told his defenders.  —  The menacing posts began cropping up on Twitter … ",
    "url": "https://www.nytimes.com/2023/08/07/nyregion/cuomo-women-sister-madeline.html"
  },
  {
    "text": "Some conservatives have surprising ‘Barbie’ take despite criticisms of liberal agenda  —  ‘Barbie’ surpassed $1 billion in global box office sales, despite ‘woke’ claims  —  Some conservatives are standing by the film “Barbie,” despite criticisms and reviews that blasted the blockbuster film for an allegedly liberal agenda.",
    "url": "https://www.foxnews.com/politics/some-conservatives-surprising-barbie-take-despite-criticisms-liberal-agenda"
  },
  {
    "text": "John Eastman shows the path from misinformation to revolution  —  Tom Klingenstein is a major donor to Republican political candidates and the chairman of the board of directors of the right-wing Claremont Institute.  It is not entirely clear which of those roles spurred his recent interview … ",
    "url": "https://www.washingtonpost.com/politics/2023/08/07/eastman-misinformation-2020-election/"
  },
  {
    "text": "Rudy Giuliani puts luxury Manhattan apartment on the block for $6.5 million  — Rudy Giuliani's 3-bedroom Upper East Side co-op apartment just hit the market.  — The unit, in a landmarked Madison Avenue building, has extensive wood paneling and a library.",
    "url": "https://www.businessinsider.com/rudy-giuliani-manhattan-apartment-asking-price-6-5-million-2023-8?op=1"
  },
  {
    "text": "Judge Cannon Blows Off Concerns about Walt Nauta's Conflicted Representation  —  Before I attempt to explain the substance of the order that Aileen Cannon issued in response to DOJ's request for a Garcia hearing, let me point out how it looks on the docket.  —  Before DOJ filed its motion … ",
    "url": "https://www.emptywheel.net/2023/08/07/judge-cannon-blows-off-concerns-about-walt-nautas-conflicted-representation/"
  },
  {
    "text": "China hacked Japan's sensitive defense networks, officials say  —  Tokyo has strengthened its defenses after a major cybersecurity breach, but gaps remain that could slow information-sharing with the Pentagon.  —  In the fall of 2020, the National Security Agency made an alarming discovery … ",
    "url": "https://www.washingtonpost.com/national-security/2023/08/07/china-japan-hack-pentagon/"
  },
  {
    "text": "Mayor Adams Announces Placement of new Humanitarian Emergency Response and Relief Center  —  NEW YORK - New York City Mayor Eric Adams today announced the placement of a new Humanitarian Emergency Response and Relief Center on Randall's Island as the number of asylum seekers currently in the city's care surpasses 57,200.",
    "url": "https://www.nyc.gov/office-of-the-mayor/news/577-23/mayor-adams-placement-new-humanitarian-emergency-response-relief-center"
  }
]