[
  {
    "text": "Chaos Erupts When Republican Candidates Are Asked if They Believe in Climate Change  —  There is no scientific dispute on the question, but almost none of the Republican presidential candidates gave a straight answer.  —  It was an unusual litmus test for a Republican primary debate … ",
    "url": "https://www.nytimes.com/2023/08/23/us/republican-debate-climate-change.html"
  },
  {
    "text": "The spiciest moments of the first GOP debate  —  Trump wasn't on stage.  But the debate didn't lack for intense exchanges.  —  Candidates tonight on stage are Asa Hutchinson (far left), Chris Christie, Mike Pence, Ron DeSantis, Vivek Ramaswamy, Nikki Haley, Tim Scott and Doug Burgum.",
    "url": "https://www.politico.com/news/2023/08/23/first-republican-debate-highlights-00112617"
  },
  {
    "text": "The winners and losers from the first Republican debate  —  Eight Republican presidential candidates who sought some kind of traction against former president Donald Trump faced off Wednesday night at the first debate of the 2024 GOP primary race in Milwaukee.  Trump was absent.",
    "url": "https://www.washingtonpost.com/politics/2023/08/23/who-won-republican-debate/"
  },
  {
    "text": "Magical Thinking in Milwaukee  —  One couldn't help but pity the dutiful campaign staffers and surrogates who trickled into the spin room in Milwaukee last night.  They arrived with an unenviable task: to convince reporters that their respective candidates had won the first debate of the Republican presidential primary.",
    "url": "https://www.theatlantic.com/politics/archive/2023/08/trump-republican-presidential-debate-milwaukee/675104/"
  },
  {
    "text": "Fact-check: What Republican candidates got right, wrong in first debate on Fox News  —  Eight Republican presidential candidates sparred over foreign aid, abortion limits and climate change in the first GOP primary debate ahead of the 2024 presidential election.",
    "url": "http://www.politifact.com/article/2023/aug/24/fact-checks-first-republican-presidential-debate/"
  },
  {
    "text": "DeSantis' forgettable night  —  Good morning, Early Birds.  In case you need it: a crib sheet for “Ashoka.”  Tips: earlytips@washpost.com.  Thanks for waking up with us. … In today's edition ...  Trump to surrender in Georgia ... Matt Viser on President Biden's Wednesday in Tahoe … ",
    "url": "https://www.washingtonpost.com/politics/2023/08/24/desantis-forgettable-night/"
  },
  {
    "text": "5 takeaways from the first Republican primary debate  —  Imagine a world in which Donald Trump decided not to run again for reelection.  —  That's what the audience experienced for about the first 50 minutes of the first Republican presidential primary debate.  There had been only fleeting, subtle swipes at Trump in that time.",
    "url": "https://www.npr.org/2023/08/24/1195577120/republican-debate-candidates-trump-pence-ramaswamy-haley-christie-milwaukee-2024"
  },
  {
    "text": "Trump replaces top Georgia lawyer ahead of surrender  —  Former President Donald Trump has replaced his top Georgia lawyer ahead of his surrender Thursday evening, sources tell CNN.  —  Drew Findling, the lawyer who has led Trump's defense in Georgia, is being replaced by Steven Sadow … ",
    "url": "https://www.cnn.com/2023/08/24/politics/trump-georgia-lawyer/"
  },
  {
    "text": "Jim Jordan launches probe into Georgia Trump prosecution  —  House Judiciary Chairman Jim Jordan (R-Ohio) fired off a sweeping request for documents dealing with former President Trump's prosecution for election interference in Georgia, asking Fulton County District Attorney Fani Willis (D) to turn over all records relating to the case.",
    "url": "https://thehill.com/regulation/court-battles/4169099-jim-jordan-launches-probe-into-georgia-trump-prosecution/"
  },
  {
    "text": "Federal Judge Refuses To Block Arrests Of Mark Meadows, Jeffrey Clark In Georgia Case  —  The former White House chief of staff and former Justice Department official separately argued to bar their arrests as they seek to move the case to federal court.  —  LOADING",
    "url": "https://www.huffpost.com/entry/jeffrey-clark-mark-meadows-requests-to-block-arrest-rejected_n_64e68f95e4b01168be1758d6"
  },
  {
    "text": "Russian mercenary chief and mutineer Prigozhin killed in jet crash, state media say  —  Yevgeny Prigozhin, the notorious mercenary chieftain who led a failed uprising against Russian President Vladimir Putin's government two months ago, was aboard a private jet that crashed north of Moscow … ",
    "url": "https://www.latimes.com/world-nation/story/2023-08-23/jet-crash-in-russia-kills-10-wagner-chief-prigozhin-passenger-list"
  },
  {
    "text": "Franklin & Marshall Poll Release: August 2023  —  I'm writing to share our summary report for the August 2023 Franklin & Marshall College Poll.  I've highlighted a few of the key findings below, but I encourage you to read the full report, which is also included.",
    "url": "https://www.fandmpoll.org/poll-release-august-2023/"
  },
  {
    "text": "Trump suggests in Carlson interview that U.S. could see more political violence  —  The former president also again defended the mob of his supporters that attacked the Capitol on Jan. 6, 2021  —  Former president Donald Trump suggested that the United States could see intensifying political violence … ",
    "url": "https://www.washingtonpost.com/politics/2023/08/23/trump-tucker-carlson-interview/"
  },
  {
    "text": "Marjorie Taylor Greene Cries ‘Racist’ Over Not-Racist Debate Exchange  —  The extremist lawmaker was suddenly upset about racism after Chris Christie called out Vivek Ramaswamy.  —  LOADING  —  Rep. Marjorie Taylor Greene, the Georgia Republican who once spoke at a white nationalist conference … ",
    "url": "https://www.huffpost.com/entry/marjorie-taylor-greene-racist-chris-christie-vivek-ramaswamy_n_64e72cf4e4b0b98eea9026de"
  },
  {
    "text": "Ex-cop is suspected gunman in mass shooting at O.C. biker bar, sources say; 4 dead, 6 injured  —  A gunman believed to be a former cop killed three people and six were taken to hospitals after a shooting Wednesday night at a landmark biker bar in Trabuco Canyon, according to the Orange County sheriff.",
    "url": "https://www.latimes.com/california/story/2023-08-23/mass-shooting-cooks-corner-biker-bar-trebuco-orange-county"
  },
  {
    "text": "'We're Winning': Apple Formally Endorses Right to Repair Legislation After Spending Millions Fighting It  —  Apple told a California legislator that it is formally supporting a right to repair bill in California, a landmark move that suggests big tech manufacturers understand they have lost … ",
    "url": "https://www.404media.co/apple-endorses-california-right-to-repair-bill/"
  },
  {
    "text": "House Judiciary Committee expected to launch inquiry into Fulton County District Attorney Fani Willis  —  The Republican-led House Judiciary Committee is expected to open a congressional investigation into Fulton County District Attorney Fani Willis as soon as Thursday, a source tells CNN … ",
    "url": "https://www.cnn.com/2023/08/24/politics/house-republican-conference-trump-defense/"
  },
  {
    "text": "Free Lawyers!  But Big Strings Attached  —  If your boss is accused of criming, and investigators want to talk to you, here's a tip: Be wary if the company generously offers to pay for your lawyer.  —  Remember Cassidy Hutchinson, the former aide to former White House chief of staff Mark Meadows?",
    "url": "https://statuskuo.substack.com/p/free-lawyers-but-big-strings-attached"
  }
]