[
  {
    "text": "Trump cancels a streak of events with only days until election … - Vice President Kamala Harris, on the other hand, has been on a media blitz after enduring criticism from Republicans about a perceived lack of interviews.  — And while Harris has ventured into the unfriendly territory … ",
    "url": "https://www.axios.com/2024/10/18/trump-cancels-interviews-2024"
  },
  {
    "text": "Playbook: Trump's media backout  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  A ONE-TWO PUNCH — With 18 days left until Election Day, VP KAMALA HARRIS will be hitting the road with the two most popular members of her party: BARACK and MICHELLE OBAMA.",
    "url": "https://www.politico.com/newsletters/playbook/2024/10/18/trumps-media-backout-00184324"
  },
  {
    "text": "Critics Slam Al Smith Charity Dinner For Normalizing ‘Deranged Madman’ Donald Trump  —  Critics didn't find the former president's attendance at the white-tie event funny, with emcee Jim Gaffigan drawing ire too.  —  LOADING  —  Critics condemned the appearance of Donald Trump … ",
    "url": "https://www.huffpost.com/entry/donald-trump-al-smith-dinner-slammed_n_6711fdc4e4b069ea0f05fe71"
  },
  {
    "text": "An ‘exhausted’ Trump says no to another interview  —  Recently, it's become something of a pattern: Donald Trump is scheduled for an interview with a neutral media outlet, the date nears and then ... things fall apart.  It happened just this week to planned Trump sit-downs with NBC in Philadelphia and CNBC's … ",
    "url": "https://www.politico.com/live-updates/2024/10/18/2024-elections-live-coverage-updates-analysis/trump-skips-another-interview-00184327"
  },
  {
    "text": "Univision Town Hall Participants Unimpressed With ‘Arrogant’ Trump  —  Participants in the event expressed frustration with the former president in interviews with Rolling Stone … Three participants in the event expressed their frustration over Trump's failure to answer them directly … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-univision-town-hall-responses-latino-voters-1235137221/"
  },
  {
    "text": "Trump delivers profanity, below-the-belt digs at Catholic charity banquet  —  The only person off limits for Trump's roast was himself.  —  NEW YORK — Republican presidential nominee Donald Trump used his remarks at a Catholic charity banquet here on Thursday to skewer prominent Democrats, often in off-color terms.",
    "url": "https://www.washingtonpost.com/politics/2024/10/17/trump-harris-al-smith-dinner/"
  },
  {
    "text": "“I did make a mistake”: Baier apologizes for playing edited Trump clip in Harris interview  —  The Fox News anchor's deceptive video clip left out Trump's remarks about “enemies from within”  —  Fox News anchor Bret Baier is apologizing for playing a misleadingly edited clip in an interview with Vice President Kamala Harris.",
    "url": "https://www.salon.com/2024/10/17/i-did-make-a-mistake-baier-apologizes-for-playing-edited-clip-in-harris-interview/"
  },
  {
    "text": "Judge in Trump 2020 election case unseals more evidence from special counsel  —  The judge overseeing President Donald Trump's 2020 election interference case released more evidence collected by special counsel Jack Smith on Friday, unveiling an enormous batch of heavily redacted records.",
    "url": "https://www.cbsnews.com/news/trump-2020-election-case-evidence-unsealed-tanya-chutkan-jack-smith/"
  },
  {
    "text": "Trump judge's latest release of Jan. 6. evidence was heavily redacted.  Here's what was included.  — A federal judge has released additional evidence against Donald Trump in his election interference case.  — The release follows a previously unsealed motion with new evidence against Trump by special counsel Jack Smith.",
    "url": "https://www.businessinsider.com/donald-trump-judge-release-additional-evidence-election-interference-case-2024-10"
  },
  {
    "text": "A Mystery $30 Million Wave of Pro-Trump Bets Has Moved a Popular Prediction Market  —  Four Polymarket accounts have systematically placed frequent wagers on a Trump election victory  —  Vice President Kamala Harris and former President Donald Trump are neck and neck in the polls.",
    "url": "https://www.wsj.com/finance/betting-election-pro-trump-ad74aa71?st=SbQdzx&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Trump Is Speaking Like Hitler, Stalin, and Mussolini  —  To support The Atlantic's journalism, please consider subscribing today.  —  Rhetoric has a history.  The words democracy and tyranny were debated in ancient Greece; the phrase separation of powers became important in the 17th and 18th centuries.",
    "url": "https://www.theatlantic.com/politics/archive/2024/10/trump-authoritarian-rhetoric-hitler-mussolini/680296/?gift=hVZeG3M9DnxL4CekrWGK34vU4G4QMrQTKJxena1OKFY&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "How Silicon Valley Billionaires Became Trump's Biggest Donors … Last February, the billionaire financier Nelson Peltz summoned a group of about 20 wealthy, predominantly Republican donors and a handful of G.O.P. strategists to dinner at his $334 million waterfront estate in Palm Beach … ",
    "url": "https://www.nytimes.com/2024/10/18/magazine/trump-donors-silicon-valley.html?unlocked_article_code=1.TE4.yMQN.L2APvfL4FtSL&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Trump overcharged Secret Service agents to stay at his D.C. hotel, new Democratic report says  —  Then-President Donald Trump also benefited from U.S. officials and others seeking jobs and pardons who paid for stays at his downtown Washington hotel, House Democrats allege.",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-secret-service-dc-hotel-emoluments-pardons-jobs-democrat-report-rcna175714"
  },
  {
    "text": "This Is Exactly How an Elon Musk-Funded PAC Is Microtargeting Muslims and Jews With Opposing Messages  —  An Elon Musk-funded group called Future Coalition PAC is targeting Muslim voters in Michigan and Jewish voters in Pennsylvania with diametrically opposed political advertisements about Kamala Harris.",
    "url": "https://www.404media.co/this-is-exactly-how-an-elon-musk-funded-pac-is-microtargeting-muslims-and-jews-with-opposing-messages/"
  },
  {
    "text": "Majority of Americans Feel Worse Off Than Four Years Ago  —  Economic Confidence Index remains negative at -26  —  WASHINGTON, D.C. — More than half of Americans (52%) say they and their family are worse off today than they were four years ago, while 39% say they are better off and 8% volunteer that they are about the same.",
    "url": "https://news.gallup.com/poll/652250/majority-americans-feel-worse-off-four-years-ago.aspx"
  },
  {
    "text": "Labour activists campaigning for Kamala Harris in US ‘likely to break electoral law’  —  Campaign donation rules could be breached if travel expenses of a volunteer exceed $1,000  —  Labour activists who travel to the US to campaign for the Democrats are likely to break electoral law, The Telegraph understands.",
    "url": "https://www.telegraph.co.uk/us/politics/2024/10/18/labour-activists-travel-us-campaign-kamala-likely-break-law/"
  },
  {
    "text": "Julian Zelizer on Trump's increasingly dire rhetoric  —  “He doesn't even really use code words or anything.  He's just all in.”  —  ∙ Paid … In the closing days of the 2024 campaign, Donald Trump is talking a lot about “the enemy within.”  He's threatened to deploy the US military against his domestic political foes.",
    "url": "https://www.publicnotice.co/p/julian-zelizer-interview-trump"
  },
  {
    "text": "JD Vance Campaign Event With Christian Right Leaders May Have Violated Tax and Election Laws, Experts Say  —  Ziklag and the Courage Tour, the far-right groups that hosted the Republican vice-presidential nominee, are charities that can't legally intervene in political campaigns.  —  Co-published with Documented",
    "url": "https://www.propublica.org/article/vance-ziklag-courage-tour-christian-right-tax-election-laws"
  },
  {
    "text": "Montana ranger comes forward with account of Sheehy gun incident  —  Candidate says he was shot in Afghanistan; ranger witness to gun incident questions that account  —  Over 35 seasons working as a ranger in Glacier National Park, Kim Peach, 67, recalls only two incidents in which he responded … ",
    "url": "https://www.washingtonpost.com/politics/2024/10/18/sheehy-montana-senate-gunshot-glacier-park-ranger-peach/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI5MjI0MDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzMwNjA2Mzk5LCJpYXQiOjE3MjkyMjQwMDAsImp0aSI6ImY4NDEwNDMzLWIwODctNDg1NC05ZDljLWE4Y2QzZWQ0ODJhNyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzEwLzE4L3NoZWVoeS1tb250YW5hLXNlbmF0ZS1ndW5zaG90LWdsYWNpZXItcGFyay1yYW5nZXItcGVhY2gvIn0.RibvK21Uh6kQC5fks28p--d-s1_XlP83Z3zV4bM1M2s&itid=gfta"
  },
  {
    "text": "When the Top General in the U.S. Says You're ‘Fascist to the Core’  —  Toward the end of his tenure, Gen. Mark Milley, who was the chairman of the Joint Chiefs of Staff from 2019 to 2023, told Bob Woodward of The Washington Post that Donald Trump was a fundamental threat to the safety and integrity of the United States.",
    "url": "https://www.nytimes.com/2024/10/18/opinion/trump-woodward-milley-mass-deportation.html?unlocked_article_code=1.TE4.aEQr.bu63SohLeWP4&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "House Rating Change: Scott Perry's Race Moves to Toss Up  —  In 2022, some Republican House members paid a price for their hardline reputations.  The highest-profile example was in Colorado's 3rd District, where GOP Rep. Lauren Boebert won reelection by just 546 votes in her race … ",
    "url": "https://www.cookpolitical.com/analysis/house/pennsylvania-house/house-rating-change-scott-perrys-race-moves-toss"
  }
]