[
  {
    "text": "RFK Jr. candidacy hurts Trump more than Biden, NBC News poll finds  —  The finding contrasts with a number of other national polls, and it comes amid concerted Democratic efforts to prevent Kennedy from harming Biden's campaign.  —  The latest national NBC News poll shows the third-party vote … ",
    "url": "https://www.nbcnews.com/politics/2024-election/rfk-jr-candidacy-hurts-trump-biden-nbc-news-poll-finds-rcna148536"
  },
  {
    "text": "Poll: Election interest hits new low in tight Biden-Trump race  —  NBC News' latest national poll shows Biden's numbers inching up as Robert F. Kennedy Jr., inflation and abortion all scramble the 2024 contest.  —  The share of voters who say they have high interest in the 2024 election … ",
    "url": "https://www.nbcnews.com/politics/2024-election/poll-biden-trump-tight-race-election-interest-low-rcna148170"
  },
  {
    "text": "Pritzker says it's ‘throwing away’ votes if Democrats backed someone other than Biden  —  Illinois Gov. JB Pritzker (D) said Democrats would be “throwing away” their votes if they supported someone other than President Biden in November's presidential election.  —  “I'm not suggesting there aren't other names on the ballot.",
    "url": "https://thehill.com/homenews/campaign/4609357-pritzker-says-its-throwing-away-votes-if-democrats-backed-someone-other-than-biden/"
  },
  {
    "text": "Trump's Trial Challenge: Being Stripped of Control  —  The mundanity of the courtroom has all but swallowed Donald Trump, who for decades has sought to project an image of bigness and a sense of power.  —  “Sir, can you please have a seat.”  —  Donald J. Trump had stood up to leave … ",
    "url": "https://www.nytimes.com/2024/04/21/us/politics/trump-trial-analysis.html"
  },
  {
    "text": "Will a Mountain of Evidence Be Enough to Convict Trump?  —  Monday will see opening statements in the People of the State of New York v. Donald J. Trump.  The state's case seems strong, but a conviction is far from assured.  —  In the official record, the case is known as the People … ",
    "url": "https://www.nytimes.com/2024/04/21/nyregion/trump-trial-hush-money-evidence.html"
  },
  {
    "text": "Trump Deflates  —  It wasn't just Putin who lost in the House vote on Ukraine aid.  —  Ukraine won.  Trump lost.  —  The House vote to aid Ukraine renews hope that Ukraine can still win its war.  It also showed how and why Donald Trump should lose the 2024 election.",
    "url": "https://www.theatlantic.com/politics/archive/2024/04/trump-republican-vote-ukraine-aid/678148/"
  },
  {
    "text": "Trump's super PAC has helped foot his legal bills.  That might end soon.  —  Save America has now spent about $60 million on legal consulting since the beginning of 2023.  —  A PAC controlled by former President Donald Trump that has devoted tens of millions of dollars to his and his allies' legal bills … ",
    "url": "https://www.politico.com/news/2024/04/20/trump-legal-fees-spending-00153508"
  },
  {
    "text": "Evangelicals with ties to “The Family” met Mike Johnson and Zelenskyy ahead of Ukraine vote  —  We're getting nearly a real-time look at The Family's anti-LGBTQ+ religious diplomacy in action  —  If you see evangelical House Republicans softening their opposition to military aid for Ukraine, don't assume it's divine intervention.",
    "url": "https://www.salon.com/2024/04/19/evangelicals-with-ties-to-the-family-met-mike-johnson-and-zelenskyy-ahead-of-ukraine-vote_partner/"
  },
  {
    "text": "On a panel with CNN Senior Political Commentator Scott Jennings and CNN Political Commentators Jamal Simmons and Kate Bedingfield, Texas Rep. Tony Gonzales tells CNN's Dana Bash: “The house is a rough and rowdy place,” but Speaker Mike Johnson won't be ousted.",
    "url": "https://www.cnn.com/videos/politics/2024/04/21/sotu-gonzalez-during-panel.cnn"
  },
  {
    "text": "US poised to impose sanctions on IDF unit accused of violations in West Bank  —  Israeli leaders vow to oppose expected measures under Leahy law against the Netzah Yehuda battalion  —  A unit of the Israel Defense Forces is facing US sanctions over its treatment of Palestinians in the occupied West Bank … ",
    "url": "https://www.theguardian.com/world/2024/apr/21/us-poised-impose-sanctions-israel-defense-force-netzah-yehuda-battalion"
  },
  {
    "text": "Americans Who Want To Kill Americans  —  The Reframe is totally free for all readers, and is supported with voluntary subscriptions by about 5% of readers.  —  If you find value in these essays, and only if you can afford to, please consider becoming a paid sponsor.",
    "url": "https://www.the-reframe.com/americans-who-want-to-kill-americans/"
  },
  {
    "text": "Johnson, Like Pence, Draws Praise for Defying His Party and Doing His Job  —  In the Republican Party of 2024, styled in the image of former President Donald J. Trump, a norm-preserving, consensus-driven act — even a basic one — can be a career-ending offense.",
    "url": "https://www.nytimes.com/2024/04/20/us/politics/johnson-pence-republicans-ukraine-aid.html"
  },
  {
    "text": "A prehistory of MAGA: “Mainstream” conservatives never really purged the fascists  —  Author David Austin Walsh says “respectable” conservatives have tolerated racists and neo-Nazis all along  —  David Austin Walsh's new book, “Taking America Back: The Conservative Movement and the Far Right … ",
    "url": "https://www.salon.com/2024/04/20/a-prehistory-of-maga-mainstream-conservatives-never-really-purged-the-fascists/"
  },
  {
    "text": "Residents push for renaming of Trump Plaza to disassociate from ex-president  —  Tenants of the high-rise in New Rochelle, New York, want to abandon the name which has at times affected real estate value  —  While Donald Trump endures the ignominy of being the first former US president … ",
    "url": "https://www.theguardian.com/us-news/2024/apr/21/trump-plaza-rename-real-estate-value"
  },
  {
    "text": "Bolsonaro Praises Musk at Rio Rally as His Legal Troubles Grow  — X owner pledged to reinstate accounts seen spreading fake news  — Brazil's right contends Supreme Court oversteps its authority  —  Former Brazil President Jair Bolsonaro praised Elon Musk as a free-speech advocate … ",
    "url": "https://www.bloomberg.com/news/articles/2024-04-21/jair-bolsonaro-praises-elon-musk-at-brazil-rally-amid-police-probes"
  },
  {
    "text": "Proud Boys appear at Trump rally, drawing condemnation from Biden  —  Members of the violent extremist group were calling for the release of everyone charged in the Jan. 6, 2021, attack on the Capitol.  Trump has pledged to pardon rioters.  —  WILMINGTON, N.C. — At least 10 men wearing … ",
    "url": "https://www.washingtonpost.com/politics/2024/04/20/trump-rally-proud-boys-north-carolina/"
  },
  {
    "text": "Kristi Noem Says Mike Pence Has ‘Failed’ Donald Trump  —  ‘RIPPING HIM APART’  —  The South Dakota governor, and vice presidential hopeful, declined to say whether she would have certified the 2020 election results in a CNN interview.  —  South Dakota Gov. Kristi Noem continued … ",
    "url": "https://www.thedailybeast.com/kristi-noem-says-mike-pence-has-failed-donald-trump"
  }
]