[
  {
    "text": "A victory for reproductive rights?  Democratic candidate Marilyn Lands wins Alabama special election  —  Democrat Marilyn Lands won a contentious special election for a state house seat in deep-red Alabama on Tuesday night, in a race that could signal the dominant role of abortion … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/03/26/alabama-special-election-marilyn-lands-results/73107672007/"
  },
  {
    "text": "Democrat who made reproductive rights a campaign focus will win Alabama special election, CNN projects  —  Marilyn Lands, a Democrat who made reproductive rights a central part of her campaign, will win a special election Tuesday for an Alabama state House seat, CNN projects.",
    "url": "https://www.cnn.com/2024/03/26/politics/alabama-special-election-democrat-reproductive-rights"
  },
  {
    "text": "Democrat wins Alabama special election after focusing on IVF, abortion  —  Democratic candidate Marilyn Lands is projected to win the special election in Alabama state House District 10, according to Decision Desk HQ.  —  Lands, a licensed professional counselor, beat Republican Teddy Powell … ",
    "url": "https://thehill.com/homenews/campaign/4557670-democrat-wins-alabama-special-election-after-focusing-on-ivf-abortion/"
  },
  {
    "text": "Scoop: House Democrats find new opening to hit GOP on IVF … - The policy funds fertility services for unmarried veterans, those in same-sex marriages and those who sustained service-related disabilities.  — “IVF is morally dubious and should not be subsidized by the American taxpayer … ",
    "url": "https://www.axios.com/2024/03/26/house-democrats-freedom-caucus-ivf"
  },
  {
    "text": "Baltimore bridge collapse caused by DEI efforts, Utah Rep. Phil Lyman says  —  Lyman, who is also running for Utah governor, blamed diversity efforts for the disaster.  —  Phil Lyman, a Utah Republican lawmaker and candidate for governor, quickly used Baltimore's Francis Scott Key Bridge collapse … ",
    "url": "https://www.sltrib.com/news/politics/2024/03/26/baltimore-bridge-collapse-caused/"
  },
  {
    "text": "‘Assured failure’: Ex-White House lawyer provides new details of final days of Trump's 2020 election gambit  —  Pat Philbin gave his first public testimony about the chaotic final days of the Trump presidency.  —  Donald Trump's deputy White House counsel, Pat Philbin, was nervous.",
    "url": "https://www.politico.com/news/2024/03/26/white-house-trump-2020-00149195"
  },
  {
    "text": "Trump ally Clark attempted ‘coup’ at US Justice Dept, ethics counsel says  —  Jeffrey Clark, a former senior official in the U.S. Justice Department, made false claims as he attempted to enlist the agency in former President Donald Trump's efforts to undo his 2020 election loss, a Washington ethics lawyer said on Tuesday.",
    "url": "https://www.reuters.com/world/us/trump-justice-official-clark-faces-ethics-hearing-over-2020-election-role-2024-03-26/"
  },
  {
    "text": "The Utter Ridiculousness of ‘Trump Bibles’  —  LONG CON DON  —  The criminally indicted, twice-divorced, sexual-assaulting ex-president doesn't have many people left to con—so he's going back to evangelicals as his marks. … Is there any better way to celebrate the glory of the Resurrection … ",
    "url": "https://www.thedailybeast.com/the-utter-ridiculousness-of-trump-bibles"
  },
  {
    "text": "Trump's Truth Social is now a public company.  Experts warn its multibillion-dollar valuation defies logic  —  New York CNN  —  For the first time in almost 30 years, part of Donald Trump's business empire has gone public.  Trading started with a bang, but the frenzy eased considerably … ",
    "url": "https://www.cnn.com/2024/03/26/markets/trump-media-stock-truth-social/"
  },
  {
    "text": "Trump slow to invest in states that could decide election as some in GOP fear ‘skeleton’ campaign  —  In his bid to retake the White House, few states hold as much promise for Donald Trump as Michigan.  The former president has already won the state once and President Joe Biden … ",
    "url": "https://apnews.com/article/republican-presidential-election-trump-battleground-community-centers-e2ff949e3dd0d0bd278b9ce4b5bcfc2d"
  },
  {
    "text": "Was the 2020 election stolen?  Job interviews at RNC take an unusual turn.  —  Prospective hires say agreeing with Trump's false election claim appears to be a new litmus test for being hired by the party  —  Those seeking employment at the Republican National Committee after a Trump-backed purge … ",
    "url": "https://www.washingtonpost.com/nation/2024/03/26/rnc-2020-election-stolen-trump-hiring/"
  },
  {
    "text": "Missouri AG sues Media Matters over its X research, demands donor names  —  Media watchdog slams “meritless, expensive, and harassing investigations.”  —  Missouri Attorney General Andrew Bailey yesterday sued Media Matters in an attempt to protect Elon Musk and X from the nonprofit watchdog … ",
    "url": "https://arstechnica.com/tech-policy/2024/03/missouri-ag-sues-media-matters-in-lawsuit-echoing-elon-musks-complaints/"
  },
  {
    "text": "NBC reverses decision to hire Ronna McDaniel after on-air backlash  —  The network's biggest stars had lambasted the hiring across MSNBC's lineup on Monday, with more critiques expected this week  —  Amid a chorus of on-air protest from some of the network's biggest stars … ",
    "url": "https://www.washingtonpost.com/style/media/2024/03/26/nbc-drops-ronna-mcdaniel-backlash/"
  },
  {
    "text": "Justices likely to keep medication abortion available on current terms  —  The argument that courts should overrule the FDA's mifepristone decisions faced a skeptical Supreme Court.  But, the Comstock Act waits in the wings.  —  Mifepristone — one of two drugs prescribed in the U.S … ",
    "url": "https://www.lawdork.com/p/justices-likely-to-keep-medication"
  },
  {
    "text": "Trump Goes on Bizarre Rant About ‘CROOKED JOE BUDEN’ Who 'DISINFORMATES AND ‘MISINFORMATES’ About Obamacare  —  Former President Donald Trump appeared to announce he supports Obamacare — or at least is not running to end the ACA -but that's the least newsworthy part of his latest ALL CAPS rant … ",
    "url": "https://www.mediaite.com/opinion/trump-goes-on-bizarre-rant-about-crooked-joe-buden-who-disinformates-and-misinformates-about-obamacare/"
  },
  {
    "text": "Judge Imposes Gag Order on Trump in Manhattan Criminal Trial  —  The order limiting the former president's speech came the day after Justice Juan M. Merchan set an April 15 trial date for the hush-money case.  —  The New York judge presiding over one of Donald J. Trump's criminal trials imposed … ",
    "url": "https://www.nytimes.com/2024/03/26/nyregion/trump-trial-gag-order.html"
  },
  {
    "text": "Facebook snooped on users' Snapchat traffic in secret project, documents reveal  —  In 2016, Facebook launched a secret project designed to intercept and decrypt the network traffic between people using Snapchat's app and its servers.  The goal was to understand users' behavior … ",
    "url": "https://techcrunch.com/2024/03/26/facebook-secret-project-snooped-snapchat-user-traffic/"
  },
  {
    "text": "The House GOP thought it was moving past internal drama.  Then more showed up.  —  Republicans are once again dealing with the threat of removal for the speaker while critical legislation faces an unclear future  —  House Republicans finally felt they were done going through the stages of grief.",
    "url": "https://www.washingtonpost.com/politics/2024/03/27/house-gop-thought-it-was-moving-past-internal-drama-then-more-showed-up/"
  },
  {
    "text": "Rep. Jamie Raskin Calls For Hearing On ‘Influence Peddling’ By Jared Kushner  —  Donald Trump's son-in-law has been a poster boy for cashing in on government service in basically the same way that Republicans claim the Bidens have done.  —  LOADING  —  WASHINGTON ― … ",
    "url": "https://www.huffpost.com/entry/jamie-raskin-james-comer-jared-kushner_n_66030b4ae4b006c390571b90"
  },
  {
    "text": "Misinformation runs rampant after Baltimore bridge collapse … - The crew of the Singapore-flagged Dali issued a mayday call before striking the bridge and notified authorities that it was experiencing a power issue, according to Maryland Gov. Wes Moore.  — Paul Wiedefeld … ",
    "url": "https://www.axios.com/2024/03/26/francis-scott-key-bridge-collapse-reasons-conspiracy"
  },
  {
    "text": "A Georgia man created a tool to challenge voter registrations.  Trump's allies may use it.  —  Election deniers and allies of former President Donald Trump want to help regular citizens ask election officials to clean the voter rolls.  That effort has alarmed experts who worry … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/03/27/georgia-ai-tool-to-challenge-2024-voter-registrations/72946319007/"
  },
  {
    "text": "Breyer says Supreme Court risks creating ‘Constitution that no one wants’  —  Former Supreme Court Justice Stephen Breyer said the Supreme Court risks creating a “Constitution that no one wants” if it follows its current way of interpreting law.  —  In an interview with Politico magazine published Tuesday … ",
    "url": "https://thehill.com/regulation/court-battles/4558082-breyer-says-supreme-court-risks-creating-constitution-that-no-one-wants/"
  },
  {
    "text": "Ken Paxton agrees to community service, paying restitution to avoid trial in securities fraud case  —  Paxton, who will not have to enter a plea under the terms of the agreement, faced the prospect of decades in prison if he had been convicted of fraud.  —  HOUSTON — Prosecutors on Tuesday agreed … ",
    "url": "https://www.texastribune.org/2024/03/25/ken-paxton-plea-deal-securities-fraud-felony/"
  }
]