[
  {
    "text": "Live Updates: Eric Adams Is Indicted in New York  —  The indictment makes Mr. Adams the first sitting New York City mayor to face criminal charges.  —  Here's the latest on the mayor's indictment.  —  Mayor Eric L. Adams has been indicted on federal criminal charges … ",
    "url": "https://www.nytimes.com/live/2024/09/25/nyregion/eric-adams-indicted-corruption?unlocked_article_code=1.Nk4.RfxD.LvCd4VYdPWrg&smid=nytcore-ios-share&referringSource=articleShare&sgrp=c-cb"
  },
  {
    "text": "Andrew Cuomo eyes NYC mayor job … The charges have not yet been revealed.  — While Adams is adamant he will not be stepping down, he is already facing a tough Democratic primary next year on top of mounting calls to resign.  — Cuomo's formal entrance into the fray would be a wildcard.",
    "url": "https://www.axios.com/2024/09/26/andrew-cuomo-nyc-mayor-eric-adams-indictment"
  },
  {
    "text": "Eric Adams Is Indicted After Federal Corruption Investigation  —  The indictment makes Mr. Adams the first sitting mayor of New York City to be charged with a federal crime.  —  Eric L. Adams, a retired police captain who was elected as New York City's 110th mayor nearly three years ago … ",
    "url": "https://www.nytimes.com/2024/09/25/nyregion/eric-adams-indicted.html"
  },
  {
    "text": "Playbook: The race to replace McConnell heats up  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  FROM ZERO BOND TO CASH BOND — NYC Mayor ERIC ADAMS, who once deemed himself the “face of the new Democratic Party,” was indicted by federal prosecutors yesterday … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/09/26/the-race-to-replace-mcconnell-heats-up-00181133"
  },
  {
    "text": "The Undecided Voters Are Not Who You Think They Are  —  For the great majority of Americans who have firmly settled on Kamala Harris or Donald Trump, the idea that anyone could still be undecided in that choice is almost incomprehensible.  But the incredulity may be rooted in confusion about who most undecided voters really are.",
    "url": "https://www.theatlantic.com/politics/archive/2024/09/undecided-voters-2024-election/680026/"
  },
  {
    "text": "Kamala Harris Will Win the Popular Vote  —  Here's how we know.  —  Absent an extraordinary upending event, Kamala Harris will win the national popular vote on November 5th.  I'm confident of that not because she is ahead in the polling averages, or because of a “forecast,” conventionally conceived.",
    "url": "https://www.weekendreading.net/p/kamala-harris-will-win-the-popular"
  },
  {
    "text": "U.S. Presidential Contest: Arizona, September 2024  —  Marist Arizona Poll  —  Trump +1 Point Against Harris in Arizona  —  In Arizona, one point separates former President Donald Trump and Vice President Kamala Harris among likely voters statewide, including those who are undecided yet leaning toward a candidate.",
    "url": "https://maristpoll.marist.edu/polls/u-s-presidential-contest-arizona-september-2024/"
  },
  {
    "text": "The fruits of Jack Smith's 2-year investigation into Trump will land on Tanya Chutkan's desk today  —  It may be the final inflection point in the case before Nov. 5.  —  Special counsel Jack Smith, stymied at every turn by federal courts from putting Donald Trump on trial … ",
    "url": "https://www.politico.com/news/2024/09/26/jack-smith-trump-investigation-dossier-00181108"
  },
  {
    "text": "Trump May Have Just Handed Jack Smith a Massive Win  —  Did Donald Trump just make Jack Smith's job that much easier by admitting that he knows he lost the 2020 election?  —  During a speech Wednesday in Mint Hill, North Carolina, Trump appeared to give up the game when speaking about his performance four years ago.",
    "url": "https://newrepublic.com/post/186384/donald-trump-jack-smith-2020-election-lost"
  },
  {
    "text": "'There's empirical evidence:' Harris shuts down interviewer who tries to defend Trump  —  Vice President Kamala Harris pushed back at her MSNBC interviewer Wednesday evening over a controversial claim about former President Donald Trump.  —  “The 11th Hour host” Stephanie Ruhle grilled Harris … ",
    "url": "https://www.rawstory.com/kamala-harris-donald-trump/"
  },
  {
    "text": "Vance keeps gaffing by actually detailing Trump's policies  —  “Concepts of a plan” is an easier sell than what they really want to do. … Donald Trump is a scam artist.  He promises voters everything and delivers almost nothing.  That's worked for him in the past, but Trump's current running mate … ",
    "url": "https://www.publicnotice.co/p/jd-vance-gaffes"
  },
  {
    "text": "Rudy Giuliani disbarred in D.C. over 2020 election scheme  —  Just when it seemed things couldn't get much worse for Rudy Giuliani, the former Republican mayor was officially disbarred in Washington, D.C.  —  Last summer, a Washington, D.C.-based bar discipline committee concluded … ",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/rudy-giuliani-disbarred-dc-2020-election-scheme-rcna172822"
  },
  {
    "text": "Trump lawyers to ask appeals court to toss $489 million civil fraud ruling  —  Lawyers for former President Donald Trump and his company will argue to an appeals panel Thursday that it should throw out a judge's February ruling that Trump must fork over hundreds of millions of dollars … ",
    "url": "https://www.cbsnews.com/news/trump-fraud-appeals-court-489-million/"
  },
  {
    "text": "GOP Rep. Clay Higgins deletes post calling Haitian migrants ‘thugs,’ telling them to get ‘their a** out of our country’  —  House Democrats immediately tried to reprimand GOP Rep. Clay Higgins of Louisiana from the floor of the chamber on Wednesday over a since deleted social media post calling … ",
    "url": "https://www.cnn.com/2024/09/25/politics/clay-higgins-deletes-post-haitian-migrants/"
  },
  {
    "text": "Harris makes scandal-plagued Republican the star of her campaign to win North Carolina  —  There's an unlikely star in Kamala Harris ' push to win North Carolina: Mark Robinson.  The state's embattled Republican candidate for governor, Robinson is featured in conversations this week … ",
    "url": "https://apnews.com/article/trump-harris-north-carolina-president-election-3a3bb41f75baab8543532f6dcc6cd1cb"
  },
  {
    "text": "Despite Persistent Warnings, Texas Rushed to Remove Millions From Medicaid.  That Move Cost Eligible Residents Care.  —  The decision to buck federal government guidelines was one of many that led to serious repercussions for Texas residents who rely on Medicaid.",
    "url": "https://www.propublica.org/article/texas-medicaid-unwinding-consequences"
  },
  {
    "text": "How Musk threatens America's national security, and what must be done  —  His incitement to assassinate America's commander-in-chief is only the most recent illustration  —  Shortly after the apparent second assassination attempt against Trump, Elon Musk responded in a now deleted post … ",
    "url": "https://robertreich.substack.com/p/how-elon-musk-threatens-national"
  },
  {
    "text": "Trump's promises would spike inflation and wipe out jobs, study finds  —  Former President Donald Trump has promised to attack the United States affordability crisis by imposing immense tariffs, carrying out unprecedented deportations and even influencing interest rate decisions.",
    "url": "https://www.cnn.com/2024/09/26/business/trump-inflation-jobs-tariffs-economy/"
  },
  {
    "text": "‘Be a man and vote for a woman’: Kamala Harris's unlikely edge in America's masculinity election  —  Republicans are making anxiety around masculinity a key voting issue - but the Democratic nominee is hoping to turn it to her advantage  —  A man in a baseball cap strides through a field of corn.",
    "url": "https://www.theguardian.com/us-news/2024/sep/26/masculinity-trump-kamala-harris-us-election"
  },
  {
    "text": "Wausau mayor moves ballot box in controversial act  —  Wausau Mayor Doug Diny is facing scrutiny after video surveillance footage showed him carting the city's outdoor ballot drop box inside on Sunday while sporting a Department of Public Works jacket and hard hat.",
    "url": "https://wausaupilotandreview.com/2024/09/24/wausau-mayor-moves-ballot-box-in-controversial-act-public-outcry-and-potential-legal-consequences-loom/"
  }
]