[
  {
    "text": "Forget Biden's SOTU Performance, and Focus on Tiny, Weak Mike Johnson  —  Joe Biden more than made it through Thursday night's State of the Union address.  That moment that his supporters always fear—the major brain fart, the confusing of Nikki Haley with Nancy Pelosi (oh wait, that was someone else)—never came.",
    "url": "https://newrepublic.com/post/179672/forget-bidens-sotu-performance-focus-tiny-weak-mike-johnson"
  },
  {
    "text": "Republican Katie Britt Ruthlessly Mocked for SOTU Response  —  Alabama Senator Katie Britt on Thursday faced widespread backlash after delivering the Republican Party's response to President Joe Biden's State of the Union address.  —  Many users on X, formerly Twitter … ",
    "url": "https://www.newsweek.com/republican-katie-britt-ruthlessly-mocked-sotu-response-1877151"
  },
  {
    "text": "‘What the Hell Am I Watching’: Republicans Torch Their Own SOTU Rebuttal  —  Alabama Sen. Katie Britt was panned after delivering the most bizarre State of the Union rebuttal in recent memory  —  THE RITUAL SURROUNDING the annual State of the Union is never complete until the president's opposition … ",
    "url": "https://www.rollingstone.com/politics/politics-news/katie-britt-sotu-rebuttal-torched-republicans-1234983528/"
  },
  {
    "text": "Biden.  Can.  Win.  —  Believe.  —  ∙ Paid  —  Before we get started: Sarah and I taped a banger of a Secret Podcast this morning and I pushed it out early.  You can catch it here.  Trigger warning: Johnny from Jersey is insufferable.  —  Join  —  1. Brandon  —  Were you surprised?",
    "url": "https://plus.thebulwark.com/p/biden-can-win"
  },
  {
    "text": "Republicans baffled by Katie Britt's State of the Union response: ‘One of our biggest disasters’  —  The 42-year-old Alabama senator is a rising Republican star but her kitchen table speech did not land well even in her own party  —  Katie Britt's Republican response to Joe Biden's State … ",
    "url": "https://www.theguardian.com/us-news/2024/mar/08/katie-britt-sotu-reaction"
  },
  {
    "text": "What Biden's SOTU ad-libs say about his politics — and his preparedness  —  President Biden came into Thursday night's State of the Union address amid remarkably low expectations about his performance.  The right-wing media universe has been focused for months on his age … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/08/biden-sotu-speech-ad-libs/"
  },
  {
    "text": "Media Falls In Love All Over Again With ‘Feisty,’ ‘Fiery’ Biden  —  In today's Amiable Skeptics episode, which will go up early this afternoon but was taped later in the day yesterday, Adam Baldwin and I briefly discussed the upcoming State of the Union speech.",
    "url": "https://hotair.com/ed-morrissey/2024/03/08/media-falls-in-love-all-over-again-with-feisty-fiery-biden-n3784321"
  },
  {
    "text": "Republicans underestimated Joe Biden  —  Biden gave conservatives an opportunity to literally stand up for a procedure that helps protect life, leading to one of the most striking visuals of this year's State of the Union.  —  President Joe Biden's State of the Union address this year boomed from beginning to end.",
    "url": "https://www.msnbc.com/opinion/msnbc-opinion/biden-state-union-address-shut-down-republican-attacks-rcna142367"
  },
  {
    "text": "Democrat demands apology from Van Orden after SOTU outburst  —  Rep. Mark Pocan (D-Wis.) is demanding an apology from his fellow Wisconsin Rep. Derrick Van Orden (R) following Van Orden's outburst at Thursday's State of the Union address.  —  The outburst came as Biden spoke critically … ",
    "url": "https://thehill.com/homenews/house/4518834-democrat-demands-apology-van-orden-state-of-the-union-outburst-lies/"
  },
  {
    "text": "Official GOP Response to SOTU Has Republicans ‘Losing It’  —  Sen. Katie Britt of Alabama gave the GOP response to President Biden's annual address—which got panned by some in her own party.  —  As President Joe Biden mingled on the House floor following his State of the Union address Thursday night … ",
    "url": "https://www.thedailybeast.com/official-katie-britt-gop-response-to-state-of-the-union-has-republicans-losing-it"
  },
  {
    "text": "Full Transcript of Biden's State of the Union Speech  —  In an address that previewed the issues his campaign will focus on in the November election, President Biden made the case for a second term. … Good evening.  Good evening.  If I were smart, I would go home now.",
    "url": "https://www.nytimes.com/2024/03/08/us/politics/state-of-the-union-transcript-biden.html"
  },
  {
    "text": "A lot of moms can't see themselves in Katie Britt's kitchen  —  The Alabama senator's performance seemed aimed at suburban women whom Republicans have done little to win back  —  Before Sen. Katie Boyd Britt (R-Ala.) had even begun her State of the Union rebuttal on Thursday night … ",
    "url": "https://www.washingtonpost.com/style/power/2024/03/08/katie-britt-gop-response-to-biden-speech-suburban-women/"
  },
  {
    "text": "Trump Posts $91.6 Million Bond for Defamation Judgment in Carroll Case  —  Donald J. Trump is contending with civil penalties that are together worth more than half a billion dollars.  —  Donald J. Trump on Friday posted a $91.6 million bond in a defamation case he recently lost … ",
    "url": "https://www.nytimes.com/2024/03/08/nyregion/trump-carroll-bond-defamation.html"
  },
  {
    "text": "Trump posts $91M bond while appealing E. Jean Carroll defamation judgment  —  NEW YORK — Donald Trump on Friday secured a bond for more than $91 million to cover the judgment in writer E. Jean Carroll's defamation case while he appeals.  —  A document was posted in federal court memorializing … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/08/trump-91-million-e-jean-carroll-defamation-bond/"
  },
  {
    "text": "Trump's takeover of Republican National Committee set to become official Friday  —  Donald Trump is wasting little time putting his imprint on the Republican Party just days after becoming its presumptive presidential nominee.  —  As the Republican National Committee meets here Friday … ",
    "url": "https://www.cnn.com/2024/03/08/politics/trump-republican-national-committee/"
  },
  {
    "text": "Pentagon Review Finds No Evidence of Alien Cover-Up  —  But the new report suggests that the public's belief that the government is hiding what it knows will probably continue.  —  In the 1960s, secret test flights of advanced government spy planes generated U.F.O. sightings.",
    "url": "https://www.nytimes.com/2024/03/08/us/politics/pentagon-ufo-alien-review.html"
  },
  {
    "text": "‘A likelihood of bribery, jury tampering, or of physical injury or harassment’: At first criminal trial of a former president, judge keeps juror names protected — and warns Trump about gag order  —  An extensive history of public and repeated attacks on trial jurors and grand jurors … ",
    "url": "https://lawandcrime.com/high-profile/a-likelihood-of-bribery-jury-tampering-or-of-physical-injury-or-harassment-at-first-criminal-trial-of-a-former-president-judge-keeps-juror-names-protected-and-warns-trump-about-gag-o/"
  }
]