[
  {
    "text": "Texas State House Panel Advances Gerrymandered Congressional Map  —  The full Texas House will now vote next week on a map drawn to flip five House districts to the G.O.P., but Democrats might walk out to deny Republicans a quorum.  —  A Republican-led committee of the Texas House voted … ",
    "url": "https://www.nytimes.com/2025/08/02/us/politics/texas-redistricting.html"
  },
  {
    "text": "The simple way Democrats should talk about Trump and Epstein  —  The scandal has haunted the president in part because of a truth voters already feel: Republicans protect elites  —  Democrats must not let Jeffrey Epstein die.  —  They must highlight how this saga exposes the president for who he has always been.",
    "url": "https://www.theguardian.com/commentisfree/2025/aug/02/democrats-epstein-trump"
  },
  {
    "text": "Economic fears of investors are here — and fed by Trump's reaction  —  Ambitious policies, erratic approach dominate outlook.  —  For months, the U.S. economy appeared to be weathering the disruptive effects of President Donald Trump's trade and immigration policies.",
    "url": "https://www.washingtonpost.com/business/2025/08/02/trump-economic-uncertainty/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzU0MTA3MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzU1NDg5NTk5LCJpYXQiOjE3NTQxMDcyMDAsImp0aSI6ImI4NDkyNDA3LTFjYTItNDM1NC05NGIyLTM5ZTAxMmRhNDdiNyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9idXNpbmVzcy8yMDI1LzA4LzAyL3RydW1wLWVjb25vbWljLXVuY2VydGFpbnR5LyJ9.LCrLmyztwnLwcwyWMf7cSoL6e4MxvWWBwbRY5KuIlfY"
  },
  {
    "text": "Republicans slam Trump's firing of Bureau of Labor Statistics chief  —  President claimed that recently released figures showing jobs slowdown were ‘rigged’ to make him look bad  —  Senior Republican lawmakers are condemning the decision of their party leader, Donald Trump … ",
    "url": "https://www.theguardian.com/us-news/2025/aug/02/republicans-trump-bureau-of-labor-statistics-commissioner"
  },
  {
    "text": "Lashing Out Over Russia and Jobs Data, Trump Displays His Volatile Side  —  The president had been on something of a winning streak.  But when faced with facts and foes that wouldn't bend to his will, he responded with impatience and disproportionate intensity.",
    "url": "https://www.nytimes.com/2025/08/02/us/politics/trump-russia-jobs.html"
  },
  {
    "text": "Office of Special Counsel launches investigation into ex-Trump prosecutor Jack Smith  —  The investigation comes after GOP Sen. Tom Cotton requested that Smith be investigated for “unprecedented interference in the 2024 election.”  —  The U.S. Office of Special Counsel, an independent federal agency … ",
    "url": "https://www.nbcnews.com/politics/trump-administration/office-special-counsel-launches-investigation-ex-trump-prosecutor-jack-rcna222625"
  },
  {
    "text": "Smithsonian to restore Trump to impeachment exhibit ‘in the coming weeks’  —  A placard referring to Trump's two impeachments was removed from the National Museum of American History in July, after the Smithsonian agreed to perform a “content review”  —  Just now",
    "url": "https://www.washingtonpost.com/entertainment/art/2025/08/02/trump-impeachment-smithsonian-restore/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzU0MTA3MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzU1NDg5NTk5LCJpYXQiOjE3NTQxMDcyMDAsImp0aSI6ImFjYjhkZGMzLTI0N2EtNDRmZS05NmQzLTk0NDczMjkyNzQwMSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9lbnRlcnRhaW5tZW50L2FydC8yMDI1LzA4LzAyL3RydW1wLWltcGVhY2htZW50LXNtaXRoc29uaWFuLXJlc3RvcmUvIn0.Bq-rJULAgAnGsbw8b5ItUMhCRLP4IBra0E4VxSbZr_4&itid=gfta"
  },
  {
    "text": "Smithsonian will again include Trump in impeachment exhibit in ‘coming weeks’  —  The museum's decision to remove a placard referencing President Donald Trump from an impeachments exhibit sparked concerns over Trump's influence on the cultural institution.  —  The Smithsonian's National Museum … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/smithsonian-will-include-trump-impeachment-exhibit-coming-weeks-rcna222690"
  },
  {
    "text": "India Will Buy Russian Oil Despite Trump's Threats, Officials Say  —  There is a growing sense in India that its leaders should not allow American policymaking to shape its choices on vital energy supplies.  —  Indian officials said on Saturday that they would keep purchasing cheap oil … ",
    "url": "https://www.nytimes.com/2025/08/02/world/asia/india-russia-oil-trump-threats.html?unlocked_article_code=1.bE8.ZW0z.r4HdNGIfryLm&smid=url-share"
  },
  {
    "text": "Trump's Domestic Use of Military Set to Get Worse, Leaked Memo Shows  —  President Donald Trump has already enmeshed the United States military in domestic law enforcement operations involving immigration to an unprecedented degree.  He has authorized a major military buildup at the border.",
    "url": "https://newrepublic.com/article/198708/trump-military-anti-immigration-dhs-leaked-memo"
  },
  {
    "text": "Supreme Court signals it may rule on law protecting power of minority voters  —  The justices asked opposing parties in a battle over a Louisiana voting map to submit briefs addressing the matter.  —  Just now  —  The Supreme Court has signaled that it may rule on the constitutionality … ",
    "url": "https://www.washingtonpost.com/politics/2025/08/02/supreme-court-louisiana-voting-rights-act/"
  },
  {
    "text": "Senate confirms Jeanine Pirro as U.S. Attorney for the District of Columbia  —  Washington - The Senate on Saturday approved the nomination of Jeanine Pirro, an ardent loyalist of President Trump and a FOX News fixture, confirming the cable news personality to a top prosecutor post in Washington, D.C.",
    "url": "https://www.cbsnews.com/news/senate-confirms-jeanine-pirro-dc-us-attorney/"
  },
  {
    "text": "Appeals court upholds order barring DHS from immigration sweeps based on language, job  —  A federal appeals court upheld a lower ruling on Friday barring the Trump administration from solely considering race, language or employment as reasonable suspicion to detain migrants.",
    "url": "https://thehill.com/homenews/administration/5433644-appeals-court-trump-admninistration-dhs-immigration-sweeps/"
  },
  {
    "text": "Pro Soccer Player Sent To El Salvador Over Tattoo Details ‘Hell On Earth’ At CECOT  —  “Both the physical and mental abuse doled out by the officers made me think sometimes that I would never leave that place,” Jerce Reyes Barrios said.  —  When Jerce Reyes Barrios first got … ",
    "url": "https://www.huffpost.com/entry/pro-soccer-player-cecot-experience-trump_n_688ced10e4b09332e3ae150b"
  },
  {
    "text": "I Am Suing the Department of Justice for the Epstein Files Training Videos  —  On July 20th, I was the first to report the existence of training videos instructing FBI personnel how to flag mentions of Trump and others in the Epstein files.  Today, I'm suing for those videos.",
    "url": "https://www.muellershewrote.com/p/i-am-suing-the-department-of-justice"
  },
  {
    "text": "After a Lag, Consumers Begin to Feel the Pinch of Tariffs  —  There are growing signs that President Trump's levies are filtering through to consumer prices, as companies exhaust options for keeping them stable.  —  Companies are starting to shift more tariff-related costs onto consumers.",
    "url": "https://www.nytimes.com/2025/08/02/business/trump-tariffs-consumer-prices.html"
  }
]