[
  {
    "text": "Witness tells House Ethics Committee that Matt Gaetz paid her for sex: Sources  —  The committee has interviewed at least half a dozen women who were witnesses.  —  Rep. Matt Gaetz looks on during a news conference about unidentified aerial phenomena (UAP) transparency on Capitol Hill in Washington, D.C., Nov. 30, 2023.",
    "url": "https://abcnews.go.com/US/witness-tells-house-ethics-committee-matt-gaetz-paid/story?id=111217102"
  },
  {
    "text": "Scoop: White House cancels meeting, scolds Netanyahu in protest over video … - “This decision makes it clear that there are consequences for pulling such stunts,” a U.S. official said.  — “The Americans are fuming. … - Some Israeli officials were already en route to Washington when the meeting was cancelled.",
    "url": "https://www.axios.com/2024/06/19/netanyahu-video-biden-cancels-iran-meeting"
  },
  {
    "text": "Roger Stone Caught on Tape Discussing Trump's Plan to Challenge 2024 Election  —  CANDID CAMERA  —  Self-proclaimed “dirty trickster” Roger Stone was secretly videotaped at Mar-a-Lago during a remarkably candid conversation.  —  Roger Stone, a longtime Republican operative who served … ",
    "url": "https://www.thedailybeast.com/roger-stone-caught-on-tape-discussing-trumps-plan-to-challenge-2024-election"
  },
  {
    "text": "Amy Coney Barrett may be poised to split conservatives on the Supreme Court  —  Legal experts see signs of a “raging” philosophical debate among the court's supermajority.  —  A rift is emerging among the Supreme Court's conservatives — and it could thwart the court's recent march to expand gun rights.",
    "url": "https://www.politico.com/news/2024/06/19/amy-coney-barrett-supreme-court-conservatives-rift-00164047"
  },
  {
    "text": "“The Supreme Court is thinking about the Constitution all wrong”  —  Madiba Dennie on “The Originalism Trap.” … I recently had the pleasure of (virtually) sitting down with Madiba K. Dennie to talk about her new book, “The Originalism Trap: How Extremists Stole the Constitution and How We the People Can Take It Back.”",
    "url": "https://www.publicnotice.co/p/madiba-dennie-the-originalism-trap-interview"
  },
  {
    "text": "Trump's Ground Game Is No Longer In Our Hearts  —  DONALD TRUMP'S PRESIDENTIAL CAMPAIGN may have a ground game after all.  And if all goes as planned, Trump will have a George Soros-backed political committee and the Democrats' top election-law firm to thank.",
    "url": "https://www.thebulwark.com/p/trump-campaigns-get-out-the-vote-plans"
  },
  {
    "text": "Trump and McCarthy wanted revenge.  It didn't quite go as planned.  —  The biggest primary on Tuesday night remains unresolved, but battleground House races that could decide control of the chamber were set for November.  —  The biggest race of Tuesday night still doesn't have a winner.",
    "url": "https://www.politico.com/news/2024/06/19/virginia-oklahoma-primaries-00164072"
  },
  {
    "text": "Trump Wasn't Going to Stay in Milwaukee.  Then Reporters Asked.  —  The Republican convention will be held in swing-state Wisconsin's largest city.  The nominee, however, had planned to stay in his own hotel in Chicago, before members of the media began inquiring.",
    "url": "https://www.nytimes.com/2024/06/18/us/politics/trump-milwaukee-rnc.html"
  },
  {
    "text": "‘Totally normal for a dictator’: Trump stuns with latest demand for punishment  —  Former President Donald Trump left onlookers shocked Tuesday when he declared private citizens should lose their jobs should they refuse to follow his party line.  —  Trump's Truth Social message … ",
    "url": "https://www.rawstory.com/trump-2668542213/"
  },
  {
    "text": "Some black people on social media are mad that white people have off for Juneteenth  —  Juneteenth is supposed to be a joyous occasion that is set aside as a federal holiday to commemorate the end of the institution of slavery in the United States — even though slavery did not truly end … ",
    "url": "https://www.washingtonexaminer.com/opinion/3051197/some-black-people-on-social-media-are-mad-that-white-people-have-off-for-juneteenth/"
  },
  {
    "text": "Ship attacked by Yemen's Houthi rebels in fatal assault sinks in Red Sea in their second sinking  —  Yemen's Houthi rebels sink another carrier in the Red Sea killing at least one sailor on board.  AP news director Jon Gambrell explains the ongoing attacks by Houthis in the Red Sea as a second ship targeted sinks.",
    "url": "https://apnews.com/article/houthi-rebels-ship-attack-red-sea-yemen-bfa7d321e55c5bb59b268b82ef3c56ba"
  },
  {
    "text": "GOP senator blocks Democratic bill to ban bump stocks after Supreme Court ruling  —  Washington — A Republican senator blocked a Democratic-led attempt to pass legislation Tuesday that would have restored a Trump-era ban on bump stocks, an accessory that enables semi-automatic weapons to shoot … ",
    "url": "https://www.cbsnews.com/news/senate-democrats-to-try-to-ban-bump-stocks-after-supreme-court-ruling/"
  },
  {
    "text": "This GOP-leaning political polling firm has turned into a purveyor of anti-vaccine propaganda  —  Rasmussen Reports used to be a fairly creditable and credible political polling organization, good enough to be included among the pollsters relied on by services such as FiveThirtyEight to give … ",
    "url": "https://www.latimes.com/business/story/2024-06-19/this-gop-leaning-polling-firm-has-turned-into-a-purveyor-of-anti-vaccine-propaganda"
  },
  {
    "text": "Russia and North Korea sign partnership deal that appears to be the strongest since the Cold War  —  In talks with Putin, Kim vows ‘full support’ for Russia in Ukraine  —  North Korean leader Kim welcomes Russia's Putin at official ceremony in Pyongyang  —  Russian President Vladimir Putin … ",
    "url": "https://apnews.com/article/vladimir-putin-kim-jong-un-russia-north-korea-summit-ukraine-a6b8d2c12de7ee2ab6716d4747c9850e"
  },
  {
    "text": "Jan. 6 defendant who walked out during a debate loses House GOP primary runoff in Georgia  —  Republican Chuck Hand served 20 days behind bars for his participation in the Jan. 6, 2021, attack on the U.S. Capitol.  —  WASHINGTON — A convicted Jan. 6 defendant from Georgia who served 20 days … ",
    "url": "https://www.nbcnews.com/politics/2024-election/georgia-2nd-district-gop-runoff-jan-6-rioter-chuck-hand-rcna157221"
  },
  {
    "text": "Dr. Anthony Fauci finally reverses course, agrees keeping schools closed during COVID was ‘mistake’  —  Dr. Anthony Fauci, a top adviser to two presidential administrations during the COVID-19 pandemic, reversed course in a Tuesday interview and agreed that shutting down schools … ",
    "url": "https://nypost.com/2024/06/18/us-news/dr-anthony-fauci-finally-reverses-course-agrees-keeping-schools-closed-during-covid-was-mistake/"
  },
  {
    "text": "Something's Rotten About the Justices Taking So Long on Trump's Immunity Case  —  For those looking for the hidden hand of politics in what the Supreme Court does, there's plenty of reason for suspicion on Donald Trump's as-yet-decided immunity case given its urgency.",
    "url": "https://www.nytimes.com/2024/06/19/opinion/supreme-court-trump-immunity.html"
  },
  {
    "text": "Xi Calls for Greater Loyalty and Discipline in China's Military  — Chinese president holds meeting in symbolic Party stronghold  — At least a dozen senior military officials ousted last year  —  Chinese President Xi Jinping called for “deep reflection” from the country's armed forces … ",
    "url": "https://www.bloomberg.com/news/articles/2024-06-19/xi-calls-for-greater-loyalty-and-discipline-in-china-s-military"
  },
  {
    "text": "Another evangelical abuse scandal: It's a big reason why they worship Trump  —  Another week, and another prominent Christian right pastor gets outed for alleged or apparent sexual abuse.  Robert Morris, the founder of Gateway Church in the Dallas suburbs, was accused last week by a woman … ",
    "url": "https://www.salon.com/2024/06/18/another-evangelical-abuse-scandal-its-a-big-reason-why-they-worship/"
  },
  {
    "text": "French far-right leader Bardella backs Ukraine, but would not send long-range missiles  —  French far-right leader Jordan Bardella said on Wednesday that he backed Ukraine's right to defend itself against Russia, but if elected prime minister he would not provide Kyiv with missiles that would allow it to strike Russia's territory.",
    "url": "https://www.reuters.com/world/europe/french-far-right-leader-bardella-backs-ukraine-would-not-send-long-range-2024-06-19/"
  },
  {
    "text": "The Murky Business of Transgender Medicine  —  Did Texas Children's Hospital commit fraud to pay for child sex-change procedures?  —  / Eye on the News / Health Care, The Social Order  —  The “gender-affirming care” business has always had an aura of madness around it.",
    "url": "https://www.city-journal.org/article/the-murky-business-of-transgender-medicine"
  },
  {
    "text": "No more bridges left to burn in Jewish Westchester  —  As Rep. Jamaal Bowman fights for his political life, Jewish leaders in the district say he's left a long trail of betrayal in his wake  —  In late spring of 2022, Rep. Jamaal Bowman (D-NY) reached out to a local Jewish leader … ",
    "url": "https://jewishinsider.com/2024/06/rep-jamaal-bowman-westchester-county-jewish-community/"
  }
]