[
  {
    "text": "Abortion Rights Fuel Big Democratic Wins, and Hopes for 2024  —  Election results from Tuesday showed that Democrats, independents and even some moderate Republicans can coalesce around the issue.  —  Democrats won decisive victories in major races across the country on Tuesday evening … ",
    "url": "https://www.nytimes.com/2023/11/08/us/politics/election-results-democrats-abortion.html"
  },
  {
    "text": "Democratic Gov. Andy Beshear wins re-election in Kentucky  —  NBC News projects a victory for Beshear, who leaned on his work as governor and outspent opponent Daniel Cameron.  —  Democratic Gov. Andy Beshear of Kentucky has won re-election, defying the usual political leanings of the red state, NBC News projects.",
    "url": "https://www.nbcnews.com/politics/elections/democratic-governor-andy-beshear-wins-second-term-kentucky-rcna122072"
  },
  {
    "text": "Ohio Votes to Establish Right to Abortion  —  The State Constitution will protect access to the procedure.  The result sends a strong signal that voters are still angry about the demise of Roe.  —  Ohio voters approved a ballot measure enshrining a right to abortion in the State Constitution on Tuesday … ",
    "url": "https://www.nytimes.com/2023/11/07/us/politics/ohio-abortion-amendment.html"
  },
  {
    "text": "Democrats romp, Youngkin flops: 4 takeaways from Tuesday's election  —  Joe Biden's party has had a very strong year at the ballot box.  Whether it extends to the president in 2024 is another matter.  —  Joe Biden has had a very bad few days.  His party just had a banner year.",
    "url": "https://www.politico.com/news/2023/11/08/election-day-2023-results-takeaways-00126035"
  },
  {
    "text": "Playbook: What last night means for Joe Biden  —  Presented by With help from Eli Okun and Garrett Ross  —  DRIVING THE DAY  —  FOR YOUR RADAR — “Americans divided over Israel response to Hamas attacks, AP-NORC poll shows,” by AP's Chris Megerian and Linley Sanders … ",
    "url": "https://www.politico.com/newsletters/playbook/2023/11/08/what-last-night-means-for-joe-biden-00126047"
  },
  {
    "text": "Elections are more important than polls  —  President Biden's numbers aren't great.  But he and his party keep winning anyway. … Some 48 hours ago, pundits were rushing to explain how, why, where, and exactly to what extent the Democratic Party is doomed.",
    "url": "https://www.publicnotice.co/p/2023-elections-beshear-ohio-abortion-blue-wave"
  },
  {
    "text": "Democrat Andy Beshear wins reelection in Kentucky governor's race  —  Democratic Gov. Andy Beshear was projected to win reelection in Kentucky, according to Decision Desk HQ, fending off a challenge from his former President Trump-backed Republican challenger.",
    "url": "https://thehill.com/homenews/campaign/4297778-andy-beshear-kentucky-governors-race-democrat/"
  },
  {
    "text": "CNN Poll: Trump narrowly leads Biden in hypothetical rematch  —  One year out from Election Day 2024, former President Donald Trump narrowly leads President Joe Biden, 49% to 45% among registered voters, in a hypothetical rematch in the latest CNN poll conducted by SSRS.",
    "url": "https://www.cnn.com/2023/11/07/politics/cnn-poll-trump-biden-matchup/"
  },
  {
    "text": "Virginia Democrats win full control of the state legislature, AP reports  —  Virginia Democrats have maintained their control of the state Senate and flipped the state House, consolidating their grip on the state legislature in what will remain divided government.",
    "url": "https://www.npr.org/2023/11/08/1211314220/virginia-democrats-win-full-control-of-the-state-legislature-ap-reports"
  },
  {
    "text": "Ohio Issue 1 Election Results: Establish a Constitutional Right to Abortion  —  Ohio Issue 2 Passes  —  Ohio has voted to legalize the possession and sale of marijuana.  ›  —  Ohio Issue 1 Passes  —  Ohio has voted to make the right to an abortion protected by the State Constitution.",
    "url": "https://www.nytimes.com/interactive/2023/11/07/us/elections/results-ohio-issue-1-abortion-rights.html"
  },
  {
    "text": "LIVE ELECTION RESULTS: Kentucky, Mississippi, Ohio, Pennsylvania, Rhode Island, Virginia  —  It's a Tuesday in November and it's a big Election Day for several different states and municipalities.  There are gubernatorial races in Kentucky and Mississippi, a special election for one of Rhode Island's … ",
    "url": "https://redstate.com/redstatestaff/2023/11/07/live-election-results-kentucky-mississippi-ohio-pennsylvania-rhode-island-virginia-n2166023"
  },
  {
    "text": "Trump Stepped Down From Trust Within Days of Allen Weisselberg's Post-Indictment Resignation  —  The revelation was largely subsumed by the former president's rambunctious and pugilistic testimony, insulting the judge and New York attorney general  —  Donald J. Trump's ongoing civil fraud trial … ",
    "url": "https://themessenger.com/politics/trump-resigned-trust-allen-weisselberg-indictment"
  },
  {
    "text": "Democrat flips deep-red New Jersey Assembly seat in upset  —  Democrats have successfully flipped a seat in New Jersey's General Assembly in a a deep-red district that has not elected a Democratic legislator in three decades.  —  Decision Desk HQ projects that Democrat Avi Schnall has won … ",
    "url": "https://thehill.com/homenews/campaign/4298839-democrat-flips-deep-red-new-jersey-assembly-seat-in-upset/"
  },
  {
    "text": "I Was Branded the ‘Central Park Karen’.  I Still Live in Hiding  —  “Slit your wrists,” strangers texted me.  —  “If anyone deserves prison rape, it's you,” people I had never met called me to say.  —  “The noble thing to do is to remove yourself from society...so please kill yourself.”",
    "url": "https://www.newsweek.com/i-was-branded-central-park-karen-i-still-live-hiding-1839483"
  },
  {
    "text": "House votes to censure Rashida Tlaib over anti-Israel comments  —  The House of Representatives has voted to censure Rep. Rashida Tlaib, D-Mich., in a 234 - 188 vote on Tuesday night.  —  The punishment, while largely symbolic, was a formal public rebuke of her most recent anti-Israel comments … ",
    "url": "https://www.foxnews.com/politics/house-votes-censure-rashida-tlaib-over-anti-israel-comments"
  },
  {
    "text": "Danica Roem becomes Virginia's first openly transgender state senator  —  Virginia Democrat Danica Roem was projected to win her election Tuesday, according to Decision Desk HQ, becoming the commonwealth's first openly transgender state senator and the first out transgender person elected to a state Senate anywhere in the South.",
    "url": "https://thehill.com/homenews/campaign/4297911-danica-roem-becomes-virginias-first-openly-transgender-state-senator/"
  },
  {
    "text": "House GOP moves to reduce Buttigieg's salary to $1  —  It has no shot at becoming law, but it's not the first time Republicans have tried to use obscure spending rules this way.",
    "url": "https://www.politico.com/live-updates/2023/11/07/congress/mtg-aims-at-buttigieg-00125906"
  },
  {
    "text": "Moms for Liberty Candidates Take a Beating in Some School Races  —  The far-right group's school board candidates did not fare well in several important ballots across the U.S.  —  Moms for Liberty, the right-wing “parental rights” group advocating a hardline anti-woke agenda in America's schools … ",
    "url": "https://www.thedailybeast.com/moms-for-liberty-candidates-taught-a-lesson-in-2023-elections"
  },
  {
    "text": "Top Biden adviser Mitch Landrieu expected to leave the White House  —  Landrieu, a senior adviser to the president, was brought on two years ago to implement the $1.2 trillion bipartisan infrastructure law.  —  WASHINGTON — White House infrastructure coordinator Mitch Landrieu is expected … ",
    "url": "https://www.nbcnews.com/politics/white-house/top-biden-adviser-mitch-landrieu-expected-leave-white-house-rcna124114"
  }
]