[
  {
    "text": "Following Trump indictment, agency moves on investigation of Lt. Gov. Jones  —  A state agency is moving ahead with plans that will determine whether Lt. Gov. Burt Jones faces criminal charges as part of a scheme to overturn the 2020 presidential election in Georgia.Jones is one of 30 people … ",
    "url": "https://www.ajc.com/politics/following-trump-indictment-agency-moves-on-investigation-of-lt-gov-jones/GCK6Q7HZABB5PEHAMSQGWGTNEQ/"
  },
  {
    "text": "Who is Scott McAfee, the judge assigned to oversee Trump case in Georgia?  —  The newly leveled case against former President Donald Trump and his co-defendants accusing them of engaging in a conspiracy to overturn the results of the 2020 presidential election in Georgia has been assigned to a judge who is a lifelong Georgian.",
    "url": "https://www.cnn.com/2023/08/15/politics/scott-mcafee-trump-judge-georgia-rico-case/"
  },
  {
    "text": "4 things revealed by Trump's Georgia indictment  —  Donald Trump has been criminally charged for the fourth time this year, with Fulton County District Attorney Fani T. Willis unveiling an indictment Monday night concerning Trump's attempts to overturn the 2020 presidential election result in Georgia.",
    "url": "https://www.washingtonpost.com/politics/2023/08/15/takeaways-trump-georgia-indictment/"
  },
  {
    "text": "We Will Finally Get a Trump Mugshot With Georgia Indictment … Donald Trump has been indicted for a fourth time in Georgia—this time for helping to lead a “criminal racketeering enterprise” in his efforts to overturn the 2020 election.  —  This case is the first indictment where we may get a mugshot of the former president.",
    "url": "https://newrepublic.com/post/174993/will-finally-get-trump-mugshot-georgia-indictment"
  },
  {
    "text": "MAGA Talking Heads Want Georgia Republicans to Overhaul Laws to Pardon Trump  —  Trump's fourth indictment prompted dubious legal arguments from the right.  —  Dastardly Stalinist Democrats have made it illegal to watch television, leading the country “towards the greatest constitutional crisis since … ",
    "url": "https://www.thedailybeast.com/maga-talking-heads-want-georgia-republicans-to-overhaul-laws-to-pardon-trump"
  },
  {
    "text": "Trump asks for hold on Jan. 6 lawsuit due to federal charges  —  Former President Trump is asking for a hold on a lawsuit related to the Jan. 6, 2021, attack on the Capitol due to his federal charges.  —  The partner of Brian Sicknick, a Capitol Police officer who died after responding … ",
    "url": "https://thehill.com/regulation/court-battles/4153376-trump-asks-for-hold-on-jan-6-lawsuit-due-to-federal-charges/"
  },
  {
    "text": "The indictment Trump feared most  —  “Most indicted president.”  That was our Axios AM headline on Aug. 2 — 13 days ago. … - Any one of them could send former President Trump to prison for years. … - Fulton County District Attorney Fani Willis used a mobster statute … ",
    "url": "https://www.axios.com/2023/08/15/indictment-trump-prison-rico"
  },
  {
    "text": "The Hill's Morning Report — Trump, advisers charged with Georgia election scheme  —  Editor's note: The Hill's Morning Report is our daily newsletter that dives deep into Washington's agenda.  To subscribe, click here or fill out the box below.  —  Close  —  Thank you for signing up!",
    "url": "https://thehill.com/newsletters/4152921-the-hills-morning-report-trump-advisers-charged-with-georgia-election-scheme/"
  },
  {
    "text": "Hillary Clinton expresses ‘profound sadness’ over indictments  —  In an interview on MSNBC, Hillary Clinton said she feels “profound sadness” that the U.S. has a former president who has faced indictments “that went right to the heart of whether or not our democracy would survive.”",
    "url": "https://www.nbcnews.com/politics/donald-trump/live-blog/trump-georgia-indictment-rcna98900/rcrd16869?canonicalCard=true"
  },
  {
    "text": "Elon Musk's X is throttling traffic to websites he dislikes  —  The site formerly known as Twitter has added a five-second delay when a user clicks on a shortened link to the New York Times, Facebook and other sites Musk commonly attacks, a Washington Post analysis found",
    "url": "https://www.washingtonpost.com/technology/2023/08/15/twitter-x-links-delayed/"
  },
  {
    "text": "Former high-level FBI official pleads guilty in connection to scheme working for sanctioned Russian oligarch  —  The former head of counterintelligence for the FBI's New York field office pleaded guilty Tuesday to one count of conspiracy in connection to a scheme working for a sanctioned Russian oligarch in 2021.",
    "url": "https://www.cnn.com/2023/08/15/politics/charles-mcgonigal-fbi/"
  },
  {
    "text": "Special counsel says Hunter Biden's gun deal is ‘withdrawn’ and invalid  —  Special counsel David Weiss said the deal his team previously reached with Hunter Biden to resolve a felony gun possession charge was never approved by a probation officer and is not binding.",
    "url": "https://www.cnn.com/2023/08/15/politics/special-counsel-hunter-biden-gun-deal/"
  },
  {
    "text": "Treasury Secretary Janet Yellen Says She Ate Magic Mushrooms During China Visit  —  “There was this delicious mushroom dish,” said Yellen.  —  LOADING  —  Janet Yellen said she thoroughly enjoyed her July trip to China — and a local meal that included magic mushrooms.",
    "url": "https://www.huffpost.com/entry/treasury-secretary-janet-yellen-says-she-ate-magic-mushrooms-during-recent-china-visit_n_64db4d9ce4b06b5d9bad6341"
  },
  {
    "text": "New Hampshire 2024: DeSantis Fades, Trump Maintains Lead in Primary  —  Home Polls New Hampshire 2024: DeSantis Fades, Trump Maintains Lead in Primary  —  Kelly Ayotte Leads Joyce Craig in Potential Granite State Gubernatorial Matchup  —  A new Emerson College Polling survey … ",
    "url": "https://emersoncollegepolling.com/new-hampshire-2024-desantis-fades-trump-maintains-lead-in-primary/"
  },
  {
    "text": "Fox News contributor: “There is nothing wrong with saying over the phone, hey I need to find 11,000 votes.  That's not criminal.  That's just speech.”  —  THE LATEST  —  Trump's Georgia indictment shows the perilous power of the right-wing fever swamp",
    "url": "https://www.mediamatters.org/fox-news/fox-news-contributor-there-nothing-wrong-saying-over-phone-hey-i-need-find-11000-votes"
  },
  {
    "text": "Biden to visit Maui wildfire aftermath, pledges support ‘as long as it takes’  —  His remarks followed several days of public silence on the disaster.  —  President Joe Biden on Tuesday pledged to help Maui recover from the devastating wildfires there “as long as it takes” … ",
    "url": "https://abcnews.go.com/Politics/biden-visit-maui-wildfire-aftermath-pledges-support-long/story?id=102285674"
  }
]