[
  {
    "text": "Trump faces backlash for 'in four years, you don't have to vote again' remark  —  Some Democrats say his comments, directed at a Christian audience, signaled his plans to be a dictator.  His campaign says he was talking about ‘uniting’ the country, and experts point to his ‘deliberately ambiguous’ speaking style.",
    "url": "https://www.washingtonpost.com/politics/2024/07/27/trump-faces-backlash-four-years-you-dont-have-vote-again-remark/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzIyMDUyODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzIzNDM1MTk5LCJpYXQiOjE3MjIwNTI4MDAsImp0aSI6ImFmYWExNWViLTQ5NzItNDk2ZC05MjM0LTg2YzQ3YzdiNjY2NCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzA3LzI3L3RydW1wLWZhY2VzLWJhY2tsYXNoLWZvdXIteWVhcnMteW91LWRvbnQtaGF2ZS12b3RlLWFnYWluLXJlbWFyay8ifQ.3gulIE3VIPD7kmmqW2y6EgohBci3V57klKtzdZNms2M&itid=gfta"
  },
  {
    "text": "Harris camp responds to Trump telling Christians they 'don't have to vote again' if he gets elected  —  “I don't care how, but you have to get out and vote,” Trump said.  —  As former President Donald Trump wrapped his nearly 75-minute speech on Friday night, he delivered a final pitch … ",
    "url": "https://abcnews.go.com/Politics/harris-camp-responds-trump-telling-christians-dont-vote/story?id=112338473"
  },
  {
    "text": "Cotton says Harris makes Biden ‘look competent and moderate’  —  Sen. Tom Cotton (R-Ark.) blasted Vice President Harris on Sunday, saying she makes President Biden “look competent and moderate.”  —  “Under Joe Biden and Kamala Harris, everything has gone to hell.  And it will be much worse under Kamala Harris.",
    "url": "https://thehill.com/homenews/campaign/4796693-tom-cotton-kamala-harris-joe-biden-competent-moderate/"
  },
  {
    "text": "Harris raised $200M in first week of White House campaign and signed up 170,000 volunteers  —  Vice President Kamala Harris' campaign has raised $200 million since she emerged as the likely Democratic presidential nominee last week, an eyepopping haul in her race against the Republican nominee, former President Donald Trump.",
    "url": "https://apnews.com/article/harris-campaign-fundraising-200-million-5db5d7c5001c87377e4ba11250fff597"
  },
  {
    "text": "Kamala Harris raises $200 million in less than a week  —  The outpouring of cash and Democratic enthusiasm for Harris has reshaped the presidential race since Biden dropped out.  —  Kamala Harris's campaign has raised more than $200 million since President Biden endorsed her last Sunday … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/28/harris-200-million-fundraising-week/"
  },
  {
    "text": "'Don't sleep on Florida': Harris candidacy jolts battered state Democrats  —  The state is seeing more Democratic volunteers, but the party is up against serious GOP headwinds.  —  TALLAHASSEE, Florida — Vice President Kamala Harris' catapult to the top of the ticket has given Florida Democrats a rush of adrenaline.",
    "url": "https://www.politico.com/news/2024/07/28/kamala-harris-florida-election-00171420"
  },
  {
    "text": "Harris sees boost in favorability after Biden drops out of race: POLL  —  The vice president's approval among independents jumped, poll finds.  —  Vice President Kamala Harris speaks during the American Federation of Teachers' 88th national convention, on July 25, 2024, in Houston, Texas.",
    "url": "https://abcnews.go.com/Politics/harris-sees-boost-favorability-after-biden-drops-race/story?id=112306763"
  },
  {
    "text": "Elon Musk Shares Manipulated Harris Video, in Seeming Violation of X's Policies  —  The billionaire owner of the social media platform X reposted a video that mimics Vice President Kamala Harris's voice, without disclosing that it had been altered.  —  Elon Musk, the world's richest man … ",
    "url": "https://www.nytimes.com/2024/07/27/us/politics/elon-musk-kamala-harris-deepfake.html?unlocked_article_code=1.-k0.B2HH.1C3LSFn2VOaS&smid=url-share"
  },
  {
    "text": "Media rebounds on seismic news cycle … - Job cuts across broadcast, digital, and print news companies were up 14.6% during the first half of this year, compared to the first half of last year, per Challenger, Gray & Christmas, Inc. … The Supreme Court later ruled Trump has some immunity from criminal prosecution (July 1).",
    "url": "https://www.axios.com/2024/07/28/media-news-cycle-harris-trump-biden"
  },
  {
    "text": "Stricter Covid mask rules could've saved hundreds of thousands of lives, new study finds  —  Restrictions in Northeastern states likely ‘saved many lives’ say researchers  —  Support truly  —  independent journalism  —  Our mission is to deliver unbiased, fact-based reporting that holds power to account and exposes the truth.",
    "url": "https://www.independent.co.uk/news/world/americas/covid-mask-vaccine-rules-study-b2586693.html"
  },
  {
    "text": "'Maybe I've Gotten Worse': Trump Makes Clear That Unity Is Over  —  At a rally in Minnesota on Saturday, former President Donald J. Trump once more escalated his attacks against Vice President Kamala Harris, painting her as extreme and mocking her demeanor.  —  Early in his speech in Minnesota … ",
    "url": "https://www.nytimes.com/2024/07/28/us/politics/trump-vance-unity-minnesota.html"
  },
  {
    "text": "Putin warns the United States of Cold War-style missile crisis  —  Russian President Vladimir Putin on Sunday warned the United States that if Washington deployed long-range missiles in Germany from 2026 then Russia would station similar missiles in striking distance of the West.",
    "url": "https://www.reuters.com/world/putin-warns-united-states-cold-war-style-missile-crisis-2024-07-28/"
  },
  {
    "text": "Kelly emerges as a top contender for Harris's VP pick  —  Video Player is loading.  —  Play Video  —  Unmute  —  Current Time 0:00 … Stream Type LIVE  —  Seek to live, currently behind liveLIVE  —  Playback Rate  —  Chapters  — Chapters  —  Descriptions  — descriptions off, selected",
    "url": "https://thehill.com/homenews/campaign/4795312-mark-kelly-kamala-harris-arizona-jd-vance/"
  },
  {
    "text": "F-16 fighter jets arrive in Ukraine but may not tip advantage against Russia  —  Ukrainian and Western officials now caution that the aircraft once championed by Kyiv as a game changer are unlikely to make an immediate impact on the battlefield.  —  KYIV — Long-awaited F-16 fighter jets … ",
    "url": "https://www.washingtonpost.com/world/2024/07/28/f-16s-ukraine-planes-war-russia/"
  },
  {
    "text": "Failure of communication: Local SWAT team details account of Trump rally assassination attempt  —  “I believe our team did everything humanly possible that day.”  —  Republican presidential candidate former President Donald Trump is rushed offstage by U.S. Secret Service agents after being grazed … ",
    "url": "https://abcnews.go.com/Politics/failure-communication-local-swat-team-details-account-trump/story?id=112340601"
  }
]