[
  {
    "text": "Department of Defense Security for the Protection of Department of Homeland Security Functions  —  MEMORANDUM FOR THE SECRETARY OF DEFENSE  —  THE ATTORNEY GENERAL THE SECRETARY OF HOMELAND SECURITY  —  Numerous incidents of violence and disorder have recently occurred and threaten … ",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/06/department-of-defense-security-for-the-protection-of-department-of-homeland-security-functions/"
  },
  {
    "text": "Trump Administration Says National Guard Will Be Deployed to L.A. Protests  —  Streets of Paramount, Calif., in Los Angeles County were in chaos as federal immigration officials squared off with protesters, using tear gas and flash-bang grenades.  —  The Trump administration said it planned … ",
    "url": "https://www.nytimes.com/2025/06/07/us/la-immigration-raids-ice.html"
  },
  {
    "text": "Newsom blasts deployment of National Guard to LA as ‘purposefully inflammatory’  —  The California governor said the federal government is deploying 2,000 soldiers amid unrest over immigration sweeps in Los Angeles.  —  LOS ANGELES — California Gov. Gavin Newsom on Saturday denounced … ",
    "url": "https://www.politico.com/news/2025/06/07/newsom-national-guard-los-angeles-00393526"
  },
  {
    "text": "Trump deploying California National Guard over governor's objections to LA to quell protests  —  President Donald Trump is deploying 2,000 California National Guard troops over the governor's objections to Los Angeles where protests Saturday led to clashes between immigration authorities and demonstrators.",
    "url": "https://apnews.com/article/immigration-raids-los-angeles-2d1d5e2f638da600c4b34fe8bf8cf3aa"
  },
  {
    "text": "Trump activates National Guard in L.A.-area protests  —  California Gov. Gavin Newsom condemned the move  —  LOS ANGELES — President Donald Trump on Saturday ordered the California National Guard to Los Angeles to intervene in protests of immigration sweeps, a move condemned by California Gov. Gavin Newsom (D).",
    "url": "https://www.washingtonpost.com/politics/2025/06/07/los-angeles-immigration-protests-national-guard/"
  },
  {
    "text": "Live updates: Trump to deploy National Guard in L.A. amid protests over immigration raids  —  California Gov. Gavin Newsom said the move is unnecessary and will escalate tensions after limited protests over federal immigration raids in the Los Angeles area.",
    "url": "https://www.nbcnews.com/news/us-news/live-blog/paramount-california-home-depot-protest-rcna211650#rcrd80998"
  },
  {
    "text": "White House aide calls Los Angeles anti-ICE protests an ‘insurrection’  —  Federal agents in Los Angeles on Saturday faced off against demonstrators protesting immigration raids following Friday's protests that senior White House aide Stephen Miller condemned as an “insurrection” against the United States.",
    "url": "https://www.reuters.com/world/us/white-house-aide-calls-los-angeles-anti-ice-protests-an-insurrection-2025-06-07/"
  },
  {
    "text": "Riot police, anti-ICE protesters square off in Los Angeles after raids  —  Helmeted police in riot gear turned out on Friday evening in a tense confrontation with protesters in downtown Los Angeles, after a day of federal immigration raids in which dozens of people across the city were reported to be taken into custody.",
    "url": "https://www.reuters.com/world/us/riot-police-anti-ice-protesters-square-off-los-angeles-after-raids-2025-06-07/"
  },
  {
    "text": "Trump says Elon Musk will face ‘very serious consequences’ if he funds Democratic candidates  —  In an interview with NBC News, the president also said he assumes his relationship with the tech billionaire is over following their recent falling out.  —  President Donald Trump on Saturday … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-elon-musk-consequences-funds-democratic-candidates-rcna211605"
  },
  {
    "text": "NASA, Pentagon push for SpaceX alternatives amid Trump's feud with Musk  —  The fight between President Donald Trump and Elon Musk highlights the government's outsized dependence on a single company for missions.  —  NASA and Pentagon officials moved swiftly this week to urge competitors … ",
    "url": "https://www.washingtonpost.com/technology/2025/06/07/trump-musk-spacex-nasa-national-security/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ5MjY4ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzUwNjUxMTk5LCJpYXQiOjE3NDkyNjg4MDAsImp0aSI6ImVhNjUwNWE2LTA4NmYtNDg4Zi05YzhlLWEwNjk4YzYxODI4NyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS90ZWNobm9sb2d5LzIwMjUvMDYvMDcvdHJ1bXAtbXVzay1zcGFjZXgtbmFzYS1uYXRpb25hbC1zZWN1cml0eS8ifQ.Iila_cuA9PeViYr9JwWcIHNlu-o-svv5N1flR0uZGEg&itid=gfta"
  },
  {
    "text": "Inside the battles that shattered Trump and Musk's alliance  —  Trump called Musk “a big-time drug addict” in a phone call shortly after their public feud.  —  President Donald Trump was dejected, processing his very public split with the world's richest man.",
    "url": "https://www.washingtonpost.com/politics/2025/06/07/trump-elon-musk-fight-behind-scenes/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ5MjY4ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzUwNjUxMTk5LCJpYXQiOjE3NDkyNjg4MDAsImp0aSI6ImNhNTkwZWQyLTQ1ODMtNDZjOC1iZTFkLWU0OTYwMjg0NjhlOSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzA2LzA3L3RydW1wLWVsb24tbXVzay1maWdodC1iZWhpbmQtc2NlbmVzLyJ9.RkUPkArItHizAr7HCg185DaEzBhfES918Mvvu2Wf_2c&itid=gfta"
  },
  {
    "text": "Trump says he thinks the government has a ‘very easy case’ against Kilmar Abrego Garcia  —  In an interview with NBC News, the president said it was the Justice Department's decision, not his, to bring the Maryland man back to the U.S.  —  President Donald Trump on Saturday … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-thinks-government-easy-case-kilmar-abrego-garcia-rcna211606"
  },
  {
    "text": "Colombia Candidate Fighting for Life After Assassination Bid  —  Surgeons are operating on Colombian presidential candidate Miguel Uribe Turbay after an assassination attempt that recalled the political violence that roiled the nation in the 1980s and 1990s.",
    "url": "https://www.bloomberg.com/news/articles/2025-06-07/colombia-presidential-candidate-uribe-shot-in-bogota-semana"
  },
  {
    "text": "Conservatives on SCOTUS give DOGE the go-ahead  —  A one-two punch: DOGE gets access to your data, but the public is restricted from getting information about DOGE.  —  On Friday afternoon, heading into the weekend, the U.S. Supreme Court told the Trump administration that the non-department Department … ",
    "url": "https://www.lawdork.com/p/conservatives-on-scotus-give-doge"
  },
  {
    "text": "White House security staff warned Musk's Starlink is a security risk  —  Starlink satellite connections in the White House bypass controls meant to stop leaks and hacking.  —  Elon Musk's team at the U.S. DOGE Service and allies in the Trump administration ignored White House communications experts worried … ",
    "url": "https://www.washingtonpost.com/technology/2025/06/07/starlink-white-house-security-doge-musk/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ5MjY4ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzUwNjUxMTk5LCJpYXQiOjE3NDkyNjg4MDAsImp0aSI6IjFkMjZiM2ZmLWI1NWUtNDNiYS1iZDY4LWMyMWY3YWFhYTJhZCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS90ZWNobm9sb2d5LzIwMjUvMDYvMDcvc3Rhcmxpbmstd2hpdGUtaG91c2Utc2VjdXJpdHktZG9nZS1tdXNrLyJ9.HUMCoxKyZvfEtXsaid9wL2eW6I6JPvmH_8-vp_Yeoz4&itid=gfta"
  },
  {
    "text": "What to know about counterprotests to Trump's June 14 parade  —  Protestors are taking to the streets and community hubs nationwide on June 14 in what organizers expect will be the largest single-day anti-President Trump rally since the start of the administration.",
    "url": "https://www.axios.com/2025/06/07/no-kings-protest-trump-military-parade-june-14"
  },
  {
    "text": "The Great Un-Awokening  —  Presented by With help from Eli Okun and Bethany Irvine  —  Happy Saturday.  This is Adam Wren.  Get in touch.  —  President Donald Trump attends UFC-316 featuring Merab Dvalishvili vs. Sean O'Malley at 9:30 p.m.  —  DRIVING THE DAY",
    "url": "https://www.politico.com/newsletters/playbook/2025/06/07/the-great-un-awokening-00393429"
  },
  {
    "text": "Proud Boys Freed by Trump Sue the Government for $100 Million  —  Once convicted of serious felonies, members of the extremist group now paint themselves as “patriotic” victims of political warfare  —  In a Bizarro World lawsuit against the federal government, Proud Boys who were pardoned … ",
    "url": "https://www.rollingstone.com/politics/politics-news/proud-boys-freed-trump-sue-government-1235358123/"
  }
]