[
  {
    "text": "Who is allowed to practice identity politics?  —  I don't really know why Kamala Harris lost.  The best explanation I've seen is that Harris ran into a buzzsaw of anti-incumbent post-pandemic disillusionment that has played out across the developed world.  You can add more strategic … ",
    "url": "https://donmoynihan.substack.com/p/who-is-allowed-to-practice-identity"
  },
  {
    "text": "The Democrats Need an Honest Conversation on Gender Identity  —  One of the mysteries of this election is how the Democrats approached polling day with a set of policies on gender identity that they were neither proud to champion—nor prepared to disown.  —  Although most Americans agree … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/11/democrats-dishonest-gender-conversation-2024-election/680604/"
  },
  {
    "text": "Bernie vs. Nancy: Dems' working-class reckoning … - “While the Democratic leadership defends the status quo, the American people are angry and want change. … - “Will the big money interests and well-paid consultants who control the Democratic Party learn any real lessons from this disastrous campaign?”",
    "url": "https://www.axios.com/2024/11/10/democrats-working-class-voters-trump"
  },
  {
    "text": "More Democrats fear the party's image isn't just damaged - it's broken  —  Everyone agrees they lost the working class, but they're deeply divided on where to place the blame — and what to do about it.  —  Democrats are having a full-blown identity crisis.",
    "url": "https://www.politico.com/news/2024/11/10/democratic-party-crisis-mode-00188547"
  },
  {
    "text": "Unions Bet Big on Harris.  Now They're Bracing for Consequences.  —  Government unions, service worker unions and industrial unions all face possible repercussions from Donald Trump's victory, but not necessarily all the same kind.  —  Besides the Harris campaign and its affiliated political … ",
    "url": "https://www.nytimes.com/2024/11/10/us/politics/trump-unions.html?unlocked_article_code=1.Y04.lwpq.LH9im5k_3mab&smid=url-share"
  },
  {
    "text": "Trump wins Arizona, flipping a swing state Biden won in 2020  —  Donald Trump recaptured a longtime GOP state that he won in 2016 but lost in 2020, as it slipped away from Republicans since his political rise.  —  President-elect Donald Trump has won Arizona, NBC News projects … ",
    "url": "https://www.nbcnews.com/politics/2024-election/trump-wins-arizona-election-harris-swing-state-rcna173809"
  },
  {
    "text": "Donald Trump says he won't ask Nikki Haley, Mike Pompeo to join his second administration  —  President-elect Donald Trump said Saturday he will not ask his former United Nations Ambassador Nikki Haley or his former Secretary of State Mike Pompeo to serve in his incoming administration.",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/11/10/trump-haley-pompeo-2024-election/76176249007/"
  },
  {
    "text": "A new era dawns.  America's tech bros now strut their stuff in the corridors of power  —  The era that began with the Great Disruptor's first term is over.  Beware the emerging elite  —  In hindsight, 2016 was the beginning of the beginning.  And 2024 is the end of that beginning and the start of something much, much worse.",
    "url": "https://www.theguardian.com/commentisfree/2024/nov/11/a-new-era-dawns-americas-tech-bros-now-strut-their-stuff-in-the-corridors-of-power"
  },
  {
    "text": "Gallego defeats Lake in Arizona Senate race  —  Rep. Ruben Gallego (D-Ariz.) is projected to beat Republican Kari Lake in a consequential race for Arizona Senate, dealing the former local news anchor her second straight electoral loss, according to Decision Desk HQ.",
    "url": "https://thehill.com/homenews/campaign/4969256-ruben-gallego-defeats-kari-lake/"
  },
  {
    "text": "Democrat Marie Gluesenkamp Perez wins Washington state rematch  —  The first-term Democrat will return to Congress after defeating Joe Kent for the second time.  —  Democratic Rep. Marie Gluesenkamp Perez won a rematch with GOP challenger Joe Kent in Washington state, The Associated Press projected Saturday.",
    "url": "https://www.politico.com/news/2024/11/09/marie-gluesenkamp-perez-wins-washington-house-race-00188168"
  },
  {
    "text": "Sen. Bernie Sanders says he does not support urging Justice Sonia Sotomayor to step down  —  In an interview on “Meet the Press,” the senator said it would not be “sensible” to ask Sotomayor to step down while Biden is still in office.  —  Sen. Bernie Sanders, I-Vt., on Sunday defended … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/bernie-sanders-doesnt-support-urging-sotomayor-step-down-rcna179494"
  },
  {
    "text": "Trump on Day 1: Begin deportation push, pardon Jan. 6 rioters and make his criminal cases vanish  —  Donald Trump has said he wouldn't be a dictator — “except for Day 1.”  According to his own statements, he's got a lot to do on that first day in the White House.",
    "url": "https://apnews.com/article/trump-day-1-priorities-deportations-drilling-ukraine-6747c6e64b0440978f59450b928f61d1"
  },
  {
    "text": "Scoop: Tom Cotton locks down the votes for Senate GOP's #3 job … - Cotton had been a serious contender for top positions in a Trump administration, but he decided to remain in the Senate, as Axios first reported.  — Cotton's expected win on Wednesday would box out Sen. Joni Ernst (R-Iowa) from leadership entirely.",
    "url": "https://www.axios.com/2024/11/10/tom-cotton-senate-republican-leadership-election"
  },
  {
    "text": "Democrats' $1.9 trillion bet that blew up  —  Nearly four years ago, the Biden administration and Congressional Democrats made a $1.9 trillion bet in the form of the American Rescue Plan.  They lost, as it contributed to a surge in inflation that fueled massive voter discontent and Donald Trump's return to the White House.",
    "url": "https://www.axios.com/2024/11/10/trump-policy-stimulus-inflation"
  },
  {
    "text": "Can Trump be the New Reagan?  —  A clear victory gives the president-elect a strength and credibility on the world stage that he lacked eight years ago.  —  Eight years ago, at a post-election breakfast party we threw in POLITICO's Brussels offices, I watched Donald Trump claim victory … ",
    "url": "https://www.politico.com/news/magazine/2024/11/10/trump-world-international-affairs-00188476"
  }
]