[
  {
    "text": "Trump replaces top Georgia lawyer ahead of surrender  —  Former President Donald Trump has replaced his top Georgia lawyer ahead of his surrender Thursday evening, sources tell CNN.  —  Drew Findling, the lawyer who has led Trump's defense in Georgia, is being replaced by Steven Sadow … ",
    "url": "https://www.cnn.com/2023/08/24/politics/trump-georgia-lawyer/"
  },
  {
    "text": "Fulton County prosecutors ask judge to set Oct. 23 trial on Trump racketeering charges  —  A trial just two months from now seems implausible given the torrent of anticipated pretrial motions and complex legal issues likely to be litigated before a jury can be seated.",
    "url": "https://www.politico.com/news/2023/08/24/fulton-county-prosecutors-ask-judge-to-set-oct-23-trial-on-trump-racketeering-charges-00112816"
  },
  {
    "text": "Jim Jordan launches probe into Georgia Trump prosecution  —  House Judiciary Chairman Jim Jordan (R-Ohio) fired off a sweeping request for documents dealing with former President Trump's prosecution for election interference in Georgia, asking Fulton County District Attorney Fani Willis (D) to turn over all records relating to the case.",
    "url": "https://thehill.com/regulation/court-battles/4169099-jim-jordan-launches-probe-into-georgia-trump-prosecution/"
  },
  {
    "text": "House Republicans launch investigation into Fulton County DA after Trump indictment  —  The GOP move against District Attorney Fani Willis replays a familiar script for the party — playing defense in the former president's legal battles.  —  House Republicans are replaying a familiar script … ",
    "url": "https://www.politico.com/news/2023/08/24/house-republicans-launch-investigation-into-fulton-county-da-00112769"
  },
  {
    "text": "Trump chief of staff Mark Meadows, lawyer Jeffrey Clark get $100,000 bonds in Georgia  — Former White House chief of staff Mark Meadows' bond was set at $100,000 in the Georgia criminal case accusing ex-President Donald Trump and his allies of illegally trying to overturn the state's 2020 election results.",
    "url": "https://www.cnbc.com/2023/08/24/trump-chief-of-staff-mark-meadows-gets-100000-bond-in-georgia-election-case.html"
  },
  {
    "text": "The Most Unsettling Presidential Debate Spectacle Ever  —  A lot of things happened.  Here are some of the things.  This is TPM's Morning Memo.  Sign up for the email version.  —  What WAS That?  —  When one of America's two major political parties has become a cult of personality … ",
    "url": "https://talkingpointsmemo.com/morning-memo/gop-presidential-debate-surreal-spectacle"
  },
  {
    "text": "The winners and losers from the first Republican debate  —  Eight Republican presidential candidates who sought some kind of traction against former president Donald Trump faced off Wednesday night at the first debate of the 2024 GOP primary race in Milwaukee.  Trump was absent.",
    "url": "https://www.washingtonpost.com/politics/2023/08/23/who-won-republican-debate/"
  },
  {
    "text": "Why do Republicans even bother with this whole farce?  —  Trump wasn't there, but we saw why he's leading: GOP voters don't care about substance, just unjustified grievances  —  Going into Wednesday night, there were some valiant efforts from the Beltway media to hype the first debate of the Republican presidential primary.",
    "url": "https://www.salon.com/2023/08/24/why-do-even-bother-with-this-whole-farce/"
  },
  {
    "text": "Trump suggests in Carlson interview that U.S. could see more political violence  —  The former president also again defended the mob of his supporters that attacked the Capitol on Jan. 6, 2021  —  Former president Donald Trump suggested that the United States could see intensifying political violence … ",
    "url": "https://www.washingtonpost.com/politics/2023/08/23/trump-tucker-carlson-interview/"
  },
  {
    "text": "Exclusive: US believes missile inside Russia likely shot down Prigozhin's presumed plane, US officials say  —  The United States believes a surface-to-air missile originating from inside Russia likely shot down the plane presumed to be carrying mercenary leader Yevgeny Prigozhin on Wednesday, two U.S. officials told Reuters on Thursday.",
    "url": "https://www.reuters.com/world/europe/us-believes-missile-inside-russia-likely-shot-down-prigozhins-presumed-plane-us-2023-08-24/"
  },
  {
    "text": "Russian mercenary chief and mutineer Prigozhin killed in jet crash, state media say  —  Yevgeny Prigozhin, the notorious mercenary chieftain who led a failed uprising against Russian President Vladimir Putin's government two months ago, was aboard a private jet that crashed north of Moscow … ",
    "url": "https://www.latimes.com/world-nation/story/2023-08-23/jet-crash-in-russia-kills-10-wagner-chief-prigozhin-passenger-list"
  },
  {
    "text": "Chaos Erupts When Republican Candidates Are Asked if They Believe in Climate Change  —  There is no scientific dispute on the question, but almost none of the Republican presidential candidates gave a straight answer.  —  It was an unusual litmus test for a Republican primary debate … ",
    "url": "https://www.nytimes.com/2023/08/23/us/republican-debate-climate-change.html"
  },
  {
    "text": "DOJ sues SpaceX, alleging hiring discrimination against refugees and asylum seekers  —  The lawsuit says between 2018 and 2022, SpaceX “wrongly claimed” that export control laws limited its hiring to U.S. citizens and lawful permanent residents.  —  The U.S. Department of Justice sued SpaceX on Thursday … ",
    "url": "https://www.nbcnews.com/tech/tech-news/doj-sues-spacex-alleging-hiring-discrimination-refugees-asylum-seekers-rcna101634"
  },
  {
    "text": "Franklin & Marshall Poll Release: August 2023  —  I'm writing to share our summary report for the August 2023 Franklin & Marshall College Poll.  I've highlighted a few of the key findings below, but I encourage you to read the full report, which is also included.",
    "url": "https://www.fandmpoll.org/poll-release-august-2023/"
  },
  {
    "text": "Orange County mass shooter identified as ex-cop targeting estranged wife, sources say  —  A gunman who officials say killed three people and wounded six others Wednesday night at a landmark biker bar in Trabuco Canyon was a former police officer, according to officials.  —  Orange County Dist.",
    "url": "https://www.latimes.com/california/story/2023-08-23/mass-shooting-cooks-corner-biker-bar-trebuco-orange-county"
  }
]