[
  {
    "text": "Media creates Biden “fitness” crisis  —  Robert Hur, the Republican special prosecutor assigned to investigate President Biden, is a lawyer, not a doctor.  On Thursday, Hur issued a lengthy report that came to the legal conclusion that charges against Biden for mishandling classified materials were not warranted.",
    "url": "https://popular.info/p/manufacturing-a-political-crisis"
  },
  {
    "text": "The Only Mental Acuity I'm Questioning These Days Is the Mainstream Media's  —  Well, of course both The New York Times and The Washington Post led with stories Saturday morning about Joe Biden's age and mental acuity.  The story of special counsel Robert Hur's report and its petty rhetoric … ",
    "url": "https://newrepublic.com/article/178933/mental-acuity-biden-trump-media"
  },
  {
    "text": "The Republican Plot Against Donald Trump  —  The Republican Plot Against Donald Trump  —  The inside story of how Congress is pursuing endless war in Ukraine—and trying to stop a Trump election.  —  This weekend, Senate Democrats (joined by a few Republicans, including most Republican leadership) … ",
    "url": "https://www.theamericanconservative.com/how-congress-is-pursuing-endless-war-in-ukraine-and-trying-to-stop-a-trump-election/"
  },
  {
    "text": "‘We have to get this done’: A top House Republican pushes for Ukraine aid, stat  —  Intel Chair Mike Turner says he's confident Speaker Mike Johnson will allow a vote on a Senate aid package.  —  The chair of the House Intelligence Committee is warning that time is running out for Ukraine … ",
    "url": "https://www.politico.com/news/2024/02/12/mike-turner-ukraine-funding-00140924"
  },
  {
    "text": "Trump Faces Fraud Trial Ruling and Criminal Trial Hearing in NY Next Week  —  Donald Trump faces a ruling in a civil fraud case that could drain his cash coffers.  He may also receive a court date for what would be the first criminal trial of a former U.S. president.",
    "url": "https://www.nytimes.com/2024/02/12/nyregion/trump-civil-criminal-trial.html"
  },
  {
    "text": "Jack Smith's Subtle Shot at Trump Mar-a-Lago Judge Aileen Cannon  —  Federal prosecutors working on the Donald Trump Mar-a-Lago documents case are trying to convince Judge Aileen Cannon by pointing to cases she worked on at the DOJ.  —  Faced with a federal judge in the Donald Trump Mar … ",
    "url": "https://www.thedailybeast.com/jack-smiths-subtle-shot-at-trump-mar-a-lago-judge-aileen-cannon"
  },
  {
    "text": "Former RNC Chair Comes Up With Damning New Way To Describe Trump Supporters  —  Michael Steele asked why some voters don't just get what the former president is about.  —  LOADING  —  Michael Steele, a former chair of the Republican National Committee, on Sunday, ripped Donald Trump supporters as … ",
    "url": "https://www.huffpost.com/entry/michael-steele-donald-trump-supporters_n_65ca0c52e4b067c6b73da848"
  },
  {
    "text": "‘The voice we woke up to’: Bob Edwards, longtime ‘Morning Edition’ host, dies at 76  —  Bob Edwards, the veteran broadcaster and longtime host of Morning Edition who left an indelible mark on NPR's sound, has died.  He was 76 years old.  —  NPR's Susan Stamberg says Edwards' voice became part … ",
    "url": "https://www.npr.org/2024/02/12/165681524/bob-edwards-dead-npr-host"
  },
  {
    "text": "Exclusive: How Biden botched the border  —  Aboard Air Force One en route to tour the southern border in January 2023, President Biden sat at the head of his conference table and exploded with fury.  — The president lit into his team, which included then-Deputy Chief of Staff Jen O'Malley Dillon … ",
    "url": "https://www.axios.com/2024/02/12/how-biden-botched-border"
  },
  {
    "text": "“lol hey guys”: Biden campaign joins TikTok to reach young voters  —  President Biden's re-election campaign officially launched its TikTok account on Sunday with a Super Bowl-themed video. … - By Monday morning, the video had 3.9 million views.  — “In a media ecosystem that is more fragmented … ",
    "url": "https://www.axios.com/2024/02/12/biden-campaign-tiktok-account-first-video"
  },
  {
    "text": "Call and Response: Putin Demanded Greater Russia and Trump Agreed  —  Over the weekend, Putin and Donald Trump seem to have come to public agreement that, if elected in November, Trump would help Putin pursue Greater Russia.  —  In his session with Tucker Carlson, after all … ",
    "url": "https://www.emptywheel.net/2024/02/12/call-and-response-putin-is-demanding-greater-russia/"
  },
  {
    "text": "Statement From Walter Reed Military Medical Center Officials on Secretary of Defense Lloyd J. Austin III's Health Status  —  Dr. John Maddox, Trauma Medical Director, and Dr. Gregory Chesnut, Center for Prostate Disease Research of the Murtha Cancer Center Director, at Walter Reed National … ",
    "url": "https://www.defense.gov/News/Releases/Release/Article/3673065/statement-from-walter-reed-military-medical-center-officials-on-secretary-of-de/"
  },
  {
    "text": "Trump's NATO comments stir up a political storm as Russia keeps quiet  —  @WWW.LINKEDIN.COM/IN/SAMUELMEREDITH @SMEREDITH19  — The Kremlin on Monday declined to comment on Donald Trump's remarks about not wanting to protect a NATO country from a future attack by Moscow, if they were behind on their payments.",
    "url": "https://www.cnbc.com/2024/02/12/russia-keeps-quiet-as-trumps-nato-comments-stir-up-a-political-storm.html"
  },
  {
    "text": "Violent crime is dropping fast in the U.S. — even if Americans don't believe it  —  In 2020, the United States experienced one of its most dangerous years in decades.  —  The number of murders across the country surged by nearly 30% between 2019 and 2020, according to FBI statistics.",
    "url": "https://www.npr.org/2024/02/12/1229891045/police-crime-baltimore-san-francisco-minneapolis-murder-statistics"
  },
  {
    "text": "‘Anti-CPAC’ summit planned with prominent GOP Trump critics  —  A summit aimed at rivaling the Conservative Political Action Conference (CPAC) and featuring prominent Republican critics of former President Trump will take place in Washington later this month.",
    "url": "https://thehill.com/homenews/campaign/4462901-anti-cpac-summit-planned-prominent-gop-trump-critics/"
  }
]