[
  {
    "text": "Exclusive: Suspect in Coachella Valley Trump assassination attempt denies accusation, supports ex-president  —  Suspect a registered Republican from Las Vegas and member of a right-leaning anti-government group, sheriff says  —  A third assassination attempt against former President Donald Trump … ",
    "url": "https://www.pressenterprise.com/2024/10/13/las-vegas-man-found-with-loaded-firearm-high-capacity-magazine-near-trump-rally-in-coachella-valley/"
  },
  {
    "text": "Weapons Violation Arrest  —  Reporting Supervisor: Sergeant Ben Medina  —  File # C242860022  —  Details:  —  at 4:59 p.m., deputies assigned to former President Donald Trump's rally in the Coachella Valley contacted the driver of a black SUV at a checkpoint at the intersection of Avenue 52 and Celebration Drive.",
    "url": "https://www.riversidesheriff.org/CivicAlerts.aspx?AID=5898"
  },
  {
    "text": "October 13, 2024  —  “He is the most dangerous person ever.  I had suspicions when I talked to you about his mental decline and so forth, but now I realize he's a total fascist.  He is now the most dangerous person to this country...a fascist to the core.”",
    "url": "https://heathercoxrichardson.substack.com/p/october-13-2024"
  },
  {
    "text": "Trump wages campaign against real-time fact checks  —  The moves are the latest example of Trump's long-held resistance to being called to account for his falsehoods.  —  Donald Trump and his campaign have waged an aggressive campaign against fact-checking in recent months, pushing TV networks … ",
    "url": "https://www.washingtonpost.com/politics/2024/10/14/trump-fact-checks-interviews-debates/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI4ODc4NDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzMwMjYwNzk5LCJpYXQiOjE3Mjg4Nzg0MDAsImp0aSI6ImI2YWVjMjVmLTg5ZjAtNGUxZC1hNzZkLTUzYTA3NTE4MDExYyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzEwLzE0L3RydW1wLWZhY3QtY2hlY2tzLWludGVydmlld3MtZGViYXRlcy8ifQ.XqIMcy51gjAE5KI8FSFomDkajk73pwJMikZtVVX7EdI&itid=gfta"
  },
  {
    "text": "Harris Suggests Trump Is ‘Weak and Unstable’ in Pointed Challenge  —  Kamala Harris asked why Donald J. Trump had not released his medical records, appeared on “60 Minutes” or agreed to a second debate.  —  Vice President Kamala Harris challenged former President Donald J. Trump on Sunday … ",
    "url": "https://www.nytimes.com/2024/10/13/us/politics/harris-trump-weak-and-unstable.html"
  },
  {
    "text": "Harris rallies in a Pennsylvania bellwether county as she focuses on ‘blue wall’ states  —  Sen. John Fetterman, D-Pa., said Erie County is a microcosm of Pennsylvania and warned of Trump's “very unique and special connection” in rural areas he's visiting to boost Harris.",
    "url": "https://www.nbcnews.com/politics/2024-election/kamala-harris-rallies-pennsylvania-bellwether-county-focuses-blue-wall-rcna175046"
  },
  {
    "text": "Internal polling memo has warning signs for Senate Republicans  —  Some races are tightening but other key pickup opportunities are moving in the wrong direction, according to a new round of polling from the Senate Leadership Fund.  —  The top GOP super PAC charged with flipping the Senate … ",
    "url": "https://www.politico.com/news/2024/10/13/senate-republican-poll-memo-00183570"
  },
  {
    "text": "Hurricane recovery officials in N.C. relocated amid report of ‘armed militia,’ email shows  —  Safety fears are growing as misinformation collides with a large-scale federal recovery effort.  —  LAKE LURE, N.C. — Federal emergency response personnel on Saturday had employees operating … ",
    "url": "https://www.washingtonpost.com/weather/2024/10/13/federal-officials-nc-temporarily-relocated-amid-report-armed-militia-email-shows/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI4NzkyMDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzMwMTc0Mzk5LCJpYXQiOjE3Mjg3OTIwMDAsImp0aSI6ImVhZWZhZDUyLWFhY2EtNDc3Zi1iZDRlLWZkMzM1NmVjOTBjMiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS93ZWF0aGVyLzIwMjQvMTAvMTMvZmVkZXJhbC1vZmZpY2lhbHMtbmMtdGVtcG9yYXJpbHktcmVsb2NhdGVkLWFtaWQtcmVwb3J0LWFybWVkLW1pbGl0aWEtZW1haWwtc2hvd3MvIn0.BaGrTy9ZRxMPH9cxITvM1C18f2v862tZKRIZxsmtuSc&itid=gfta"
  },
  {
    "text": "Harris gives Democrats a boost, but control of House up for grabs  —  Democrats have a fair shot at flipping control of the House — largely because of the boost provided by Vice President Harris at the top of the ticket — but the battle is a horse race that is too close to call heading … ",
    "url": "https://thehill.com/homenews/house/4929541-democrats-house-control-harris/"
  },
  {
    "text": "Josh Hawley's Local Newspaper Declares Him the ‘Worst Sitting Senator’  —  NO CONFIDENCE  —  The St. Louis Post-Dispatch objected to Hawley's actions leading up to the Jan. 6 Capitol riots.  —  A local newspaper in Missouri wrote a scathing rebuke of the state's Sen. Josh Hawley … ",
    "url": "https://www.thedailybeast.com/st-louis-post-dispatch-names-josh-hawley-the-worst-sitting-senator"
  },
  {
    "text": "Behind the Curtain — Election scenario 1: War-gaming a Trump sweep … This period, lasting at least two years, until the next congressional races, would allow Republicans to move ambitiously — with few brakes beyond the Senate filibuster.  — The vast majority of congressional leaders are now Trump loyalists.",
    "url": "https://www.axios.com/2024/10/14/trump-election-win-scenario-gop"
  },
  {
    "text": "The Atlantic Editor-In-Chief Jeffrey Goldberg warns newsroom decay is how ‘democracy decomposes’  —  “We're sleepwalking into an absolute disaster,” Goldberg said.  —  In an industry beset by challenges, The Atlantic is a rare bright spot.  —  The 167-year-old magazine announced this week … ",
    "url": "https://www.status.news/p/atlantic-jeffrey-goldberg-2024-interview"
  },
  {
    "text": "Michigan Republican Blames ‘Proofing Error’ for Misleading Ad in Black-Owned Newspaper  —  The state's legislative Black caucus have asked the attorney general and a county prosecutor to investigate Tom Barrett's congressional campaign for potential voter disenfranchisement.",
    "url": "https://www.nytimes.com/2024/10/14/us/politics/michigan-republican-misleading-ad.html"
  },
  {
    "text": "‘Vile stuff’: NYT shamed by its own former public editor for whitewashing Trump racism  —  Former New York Times public editor Margaret Sullivan this week shamed her one-time employer for its coverage of the 2024 presidential election.  —  Writing on her Substack page … ",
    "url": "https://www.rawstory.com/trump-racism-2669387273/"
  },
  {
    "text": "US to send anti-missile system and troops to Israel, Pentagon says  —  The United States said on Sunday it will send U.S. troops to Israel along with an advanced U.S. anti-missile system, in a highly unusual deployment meant to bolster the country's air defenses following missile attacks by Iran.",
    "url": "https://www.reuters.com/world/us-send-anti-missile-system-israel-says-pentagon-2024-10-13/"
  },
  {
    "text": "The Trump Voters Who Don't Believe Trump  —  When the former president endorses violence and proposes using the government to attack his enemies, many of his supporters assume it's just an act.  —  One of the more peculiar aspects of Donald J. Trump's political appeal is this … ",
    "url": "https://www.nytimes.com/2024/10/14/us/elections/trump-promises-extreme-rhetoric.html"
  },
  {
    "text": "Orbán threatens to mess with Ukraine aid to help Trump  —  Hungary's latest attempt to disrupt Ukraine aid isn't about money — it would penalize the EU.  It's about making friends with Donald Trump.  —  Hungarian Prime Minister Viktor Orbán is preparing to serve … ",
    "url": "https://www.politico.eu/article/viktor-orban-threaten-ukraine-aid-help-donald-trump/"
  },
  {
    "text": "Attacks on Gay Rights Push Russia's LGBTQ Community Into the Shadows  —  Vladimir Putin has weaponized antigay views to tighten his grip on power as he pursues his war in Ukraine  —  A decade ago, Russian publisher Leo Veles says, he could hang out in gay bars and clubs in Moscow and St. Petersburg.",
    "url": "https://www.wsj.com/world/russia/attacks-on-gay-rights-push-russias-lgbtq-community-into-the-shadows-3b5e417e?st=GWMLfG&reflink=article_copyURL_share"
  },
  {
    "text": "Cheney doubts Johnson will carry out ‘constitutional obligations’ to certify election  —  Former Rep. Liz Cheney (R-Wyo.) said in a Sunday interview that she doubts House Speaker Mike Johnson (R-La.) will carry out “his constitutional obligations” to certify the 2024 election.",
    "url": "https://thehill.com/homenews/campaign/4931211-cheney-johnson-certify-2024-election/"
  }
]