[
  {
    "text": "Rep. George Santos won't seek reelection after scathing ethics report cites evidence of lawbreaking  —  The House Ethics committee in a scathing report Thursday said it has amassed “overwhelming evidence” of lawbreaking by Rep. George Santos of New York that has been sent to the Justice Department … ",
    "url": "https://apnews.com/article/ethics-congress-santos-5ebffe514d8779fbc16a77fa1ab5e0df"
  },
  {
    "text": "There's ‘substantial evidence’ that Rep. George Santos broke the law, House panel finds  —  The House Ethics Committee said it will refer its findings, including new “uncharged” conduct, to the Justice Department.  —  WASHINGTON — The House Ethics Committee on Thursday released … ",
    "url": "https://www.nbcnews.com/politics/congress/substantial-evidence-rep-george-santos-broke-law-ethics-panel-finds-rcna125335"
  },
  {
    "text": "Statement of the Chairman and Ranking Member of the Committee on Ethics Regarding Representative George Santos  —  Pursuant to House Rule XI Clause 3(q)(1), today the Chairman of the Committee on Ethics, Representative Michael Guest, and the Ranking Member, Representative Susan Wild … ",
    "url": "https://ethics.house.gov/press-releases/statement-chairman-and-ranking-member-committee-ethics-regarding-representative-76"
  },
  {
    "text": "Ethics panel finds ‘substantial evidence’ that Rep. Santos violated federal laws  —  House investigators found “substantial evidence” that Rep. George Santos (R-N.Y.) knowingly violated a litany of ethics and criminal laws, according a House Ethics Committee report released Thursday.",
    "url": "https://www.washingtonpost.com/politics/2023/11/16/george-santos-ethics-committee-report/"
  },
  {
    "text": "Rep. George Santos will not seek reelection after damning House Ethics report  — Republican Rep. George Santos of New York said Thursday he will not seek reelection in 2024 in the wake of a damning House Ethics report.  — The report found Santos likely committed campaign fraud and other ethical violations.",
    "url": "https://www.cnbc.com/2023/11/16/rep-george-santos-likely-committed-fraud-house-ethics-panel-says.html"
  },
  {
    "text": "Santos won't run for reelection in 2024  —  Rep. George Santos (R-N.Y.) announced Thursday he will no longer run for reelection in 2024, dropping out of the race shortly after the House Ethics Committee released a scathing report detailing “substantial evidence” that the embattled Congressman “violated federal crimes.”",
    "url": "https://thehill.com/homenews/house/4313020-santos-wont-run-for-re-election-in-2024/"
  },
  {
    "text": "House Ethics Committee report on George Santos finds “substantial evidence” of wrongdoing  —  Washington — The House Ethics Committee released a long-awaited report on its investigation into embattled Rep. George Santos on Thursday, finding that there was “substantial evidence” of wrongdoing by the congressman.",
    "url": "https://www.cbsnews.com/news/house-ethics-committee-george-santos-report/"
  },
  {
    "text": "Elon Musk faces scrutiny after calling antisemitic X post the ‘absolute truth’  —  Tech billionaire Elon Musk is facing a wave of backlash after engaging with an antisemitic social media post on Wednesday, calling it the “absolute truth.”  —  The antisemitic post that Musk seemed to endorse came … ",
    "url": "https://thehill.com/homenews/media/4312813-elon-musk-facing-scrutiny-antisemitic-post/"
  },
  {
    "text": "Elon Musk's Disturbing ‘Truth’  —  The billionaire affirmed the deadliest anti-Semitic conspiracy theory in recent American history.  —  The Hebrew Immigrant Aid Society “likes to bring invaders in that kill our people ... Screw your optics, I'm going in.”",
    "url": "https://www.theatlantic.com/ideas/archive/2023/11/elon-musks-disturbing-truth/676019/"
  },
  {
    "text": "More pandas will be coming to the U.S., China's president signals  —  SAN FRANCISCO — Chinese President Xi Jinping signaled that China will send new pandas to the United States, calling them “envoys of friendship between the Chinese and American peoples.”  —  “We are ready to continue … ",
    "url": "https://www.npr.org/2023/11/16/1213443655/pandas-us-china-xi"
  },
  {
    "text": "Rudy's Ukraine caper looks even worse now  —  This free edition of Public Notice is made possible by paid subscribers.  If you aren't one already, please consider signing up.  Just click the button below.  —  Click for Public Notice free trial  —  There's something so utterly predictable … ",
    "url": "https://www.publicnotice.co/p/giuliani-ukraine-kulyk-derkach-dubinsky-treason"
  },
  {
    "text": "A rare look at the devastation caused by AR-15 shootings  —  Editor's note: The photos, videos and personal accounts below are extremely disturbing and may be too upsetting for some people.  Read why The Post is publishing this story.  —  When a gunman fires an AR-15 ...",
    "url": "https://www.washingtonpost.com/nation/interactive/2023/ar-15-force-mass-shootings/"
  },
  {
    "text": "Arizona Poll: Democrat Ruben Gallego Holds Lead In Hypothetical Three-Way Race  —  Incumbent Sen. Kyrsten Sinema trails both Gallego and Republican Kari Lake in a potential 2024 showdown  —  A new survey from an Arizona-based pollster found Independent Sen. Kyrsten Sinema trailing her potential general election opponents.",
    "url": "https://themessenger.com/politics/arizona-poll-democrat-ruben-gallego-holds-lead-in-hypothetical-three-way-race"
  },
  {
    "text": "Trumpworld Is Already at War Over Staffing a New Trump White House  —  A year out from Election Day, Trumpworld is tearing itself apart over different groups claiming they have the inside track on staffing the White House. … The America First Policy Institute was supposed to add … ",
    "url": "https://www.thedailybeast.com/trumpworld-is-already-at-war-over-staffing-a-new-trump-white-house"
  },
  {
    "text": "USCP Statement on the Unlawful Demonstration outside the DNC  —  Last night approximately 200 people gathered in front of the Democratic National Committee (DNC) headquarters to protest the conflict in the Middle East.  —  We have handled hundreds of peaceful protests, but last night's group was not peaceful.",
    "url": "https://www.uscp.gov/media-center/press-releases/uscp-statement-unlawful-demonstration-outside-dnc"
  },
  {
    "text": "‘Signs of life’ on longshot Senate border deal  —  Good morning, Early Birds.  Dwayne Johnson, a.k.a. The Rock, was on Capitol Hill on Wednesday.  We wonder if he and Sen. Joe Manchin III (D-W.Va.) met up to discuss a potential presidential unity ticket.  Tips: earlytips@washpost.com.",
    "url": "https://www.washingtonpost.com/politics/2023/11/16/signs-life-longshot-senate-border-deal/"
  },
  {
    "text": "‘Same clown car with a different driver’: House GOP goes off the rails  —  Mike Johnson may have avoided a shutdown, but the House GOP is still emotionally raw from its 22-day speakership fight.  —  The House GOP has descended, as one member put it, into “schoolyard bully bullshit.”",
    "url": "https://www.politico.com/news/2023/11/15/the-house-gop-is-stuck-on-a-failure-loop-00127418"
  },
  {
    "text": "How Trump plays the media on abortion  —  Since the fall of Roe v. Wade, abortion has been a losing issue for Republicans.  This was evident in this year's election: in Ohio, voters approved a constitutional amendment to enshrine abortion rights.  In Kentucky, pro-choice Governor Andy Beshear … ",
    "url": "https://popular.info/p/how-trump-plays-the-media-on-abortion"
  },
  {
    "text": "Where efforts to disqualify Trump from 2024 ballot stand  —  Former President Trump is set to soon learn his fate in a Colorado legal challenge seeking to remove him from the 2024 presidential ballot, after a judge heard closing arguments on Wednesday.",
    "url": "https://www.axios.com/2023/11/16/trump-efforts-disqualify-2024-ballot-14th-amendment"
  },
  {
    "text": "The Morning Briefing: So Much for ‘Nikkimentum’  —  Top O' the Briefing  —  Happy Thursday, dear Kruiser Morning Briefing friends.  Dalyxes was gaining quite the reputation for being able to delicately flavor moonshine whilst pairing it with nonpareils.  —  One of the most tiring things … ",
    "url": "https://pjmedia.com/stephen-kruiser/2023/11/16/the-morning-briefing-so-much-for-nikkimentum-n4923948"
  },
  {
    "text": "Starbucks Workers Walk Out on Red Cup Giveaway Day  —  Unionized employees say promotional events like the one on Thursday exacerbate staffing and scheduling problems at the chain's stores.  —  Thousands of unionized Starbucks workers walked off the job on Thursday to press their demands … ",
    "url": "https://www.nytimes.com/2023/11/16/business/starbucks-strike-red-cup-day.html"
  },
  {
    "text": "Trump's Mistrial Motion Has ‘Total Lack of Merit’ and There's No ‘Urgency’ to Respond, New York AG Says  —  New York Attorney General Letitia James requested a reply deadline of Dec. 8, given the ‘demonstrable lack of urgency’  —  There is no “urgency” to respond to former President Donald Trump's motion … ",
    "url": "https://themessenger.com/politics/trump-mistrial-motion-lack-merit-letitia-james"
  },
  {
    "text": "Last Post, Please Read  —  Good morning.  This is Zandar's Dad.  I am sorry to tell you that he passed away over the weekend, peacefully in his sleep.  Fortunately, his computer was on and open to this page but I don't know if I will be able to post again.  This blog was Jon's passion.",
    "url": "http://zandarvts.blogspot.com/2023/11/last-post-please-read.html"
  },
  {
    "text": "Biden Expected to Face Harsh Criticism in Classified-Document Probe  —  Special counsel isn't likely to bring a criminal case over handling of records from Biden's time as vice president and in the Senate  —  The prosecutor investigating why classified documents ended up at President Biden's home … ",
    "url": "https://www.wsj.com/politics/national-security/biden-expected-to-face-harsh-criticism-in-classified-document-probe-39c3c27f?mod=followamazon"
  },
  {
    "text": "Biden calls Xi a dictator after carefully planned summit  —  U.S. President Joe Biden said on Wednesday he had not changed his view that Chinese President Xi Jinping was effectively a dictator, a comment likely to land with a thud in Beijing after the two leaders held straightforward summit talks.",
    "url": "https://www.reuters.com/world/biden-calls-xi-dictator-after-carefully-planned-summit-2023-11-16/"
  },
  {
    "text": "Playbook: Biden and Xi clear the air  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  THE TRUTH IS OUT THERE — Garrett Graff for POLITICO Mag: “We Have a UFO Problem.  What We Don't Have (Yet) is a Serious Answer.”  —  SHOWDOWN ON SOUTH CAPITOL STREET … ",
    "url": "https://www.politico.com/newsletters/playbook/2023/11/16/bidens-one-two-step-with-china-00127542"
  }
]