[
  {
    "text": "Donald Trump Weirdly Simulates Sex Act on Microphone Stand  —  NUT JOB  —  The former president had a meltdown at a rally in Milwaukee Friday night over a faulty mic, which culminated in him simulating fellatio.  —  Donald Trump had a full meltdown during his rally in Milwaukee on Friday night … ",
    "url": "https://www.thedailybeast.com/donald-trump-weirdly-simulates-sex-act-on-microphone-stand/"
  },
  {
    "text": "Trump Needs Help  —  Last night he simulated oral sex in public.  —  I do not know how to put this gently or tastefully, so I will factually describe what happened last night in Milwaukee: A former president of the United States held a rally, during which he used a microphone holder … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/11/trump-pantomimes-oral-sex-at-rally/680511/?gift=mBLCHcnsd_Gd3EecvWSKTdY-sV8z3C4QU-jpQ797nnw&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Trump Losing Sleep Over Polling Numbers Days Before Election  —  SLEEPLESS IN MAR-A-LAGO  —  The GOP nominee is growing obsessive in the last mad dash to Election Day.  —  Donald Trump is reportedly losing sleep, battling anxiety, and obsessing over his polling numbers as the GOP nominee hopes … ",
    "url": "https://www.thedailybeast.com/trump-losing-sleep-over-polling-numbers-days-before-election/"
  },
  {
    "text": "Trump's Microphone Trouble in Milwaukee Leaves Him ‘Seething’  —  After rally goers complained that they could not hear him, the former president asked, “Do you want to see me knock the hell out of people backstage?”  —  The signs in the crowd said “Trump will fix it,” … ",
    "url": "https://www.nytimes.com/2024/11/02/us/politics/trump-microphone-milwaukee-rally.html?unlocked_article_code=1.W04.Jxvf.2GBua3Ys0Pob&smid=url-share"
  },
  {
    "text": "Trump will spend every day until the election in North Carolina, a swing state he won twice  —  Donald Trump will rally supporters in North Carolina every day until Tuesday's election, a flurry of late activity in the only swing state that he won in both his 2016 and 2020 campaigns.",
    "url": "https://apnews.com/article/donald-trump-north-carolina-campaign-aacda8a46f20d1dc654ca9ef4c2c3de8"
  },
  {
    "text": "October surprise: Trump just blew a huge lead, and the Madison Square Garden rally started the drop, says top data scientist  —  Donald Trump speaks during a campaign rally at Madison Square Garden in New York on Oct. 27.  —  Donald Trump is suffering an historic descent in the campaign's final days … ",
    "url": "https://fortune.com/2024/11/02/election-odds-donald-trump-lead-kamala-harris-madison-square-garden-rally-electoral-votes/"
  },
  {
    "text": "Mike Johnson adds to Democrats' 11th hour arsenal … - “This is really deadly for them in the Midwest. … - The lawmaker added that there is “chatter among colleagues already” about incorporating the episode into their closing message and using it to argue “how little they care about ... older industrial cities.”",
    "url": "https://www.axios.com/2024/11/02/mike-johnson-chips-act-repeal-democrats"
  },
  {
    "text": "Trump reiterates his remarks on protecting women, ramps up attacks on Harris  —  Donald Trump on Saturday leaned into his controversial comments about protecting women and escalated his attacks on Kamala Harris, threatening that if she were to become president, “she will get overwhelmed and melt down, and millions of people will die.”",
    "url": "https://www.politico.com/live-updates/2024/11/02/2024-elections-live-coverage-updates-analysis/trump-on-protecting-women-00186924"
  },
  {
    "text": "The POLITICO Race to Watch: Montana Senate  —  Candidates: Sen. Jon Tester (D) vs. aerospace executive Tim Sheehy (R) Ad spending since Labor Day: $84.5 million for Democrats; $72.9 million for Republicans Past results: Tester won reelection for a third time in 2018, beating now-Rep. Matt Rosendale … ",
    "url": "https://www.politico.com/live-updates/2024/11/02/2024-elections-live-coverage-updates-analysis/politico-race-to-watch-00186780"
  },
  {
    "text": "Inside the Ruthless, Restless Final Days of Trump's Campaign  —  To support The Atlantic's journalism, please consider subscribing today.  —  At the end of June, in the afterglow of a debate performance that would ultimately prompt President Joe Biden to end his campaign for reelection … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/11/trump-2024-campaign-lewandowski-conway/680456/?gift=FBOE1bpLi-EM2SKEfMCmivncqMow9hId0i_YE9w6Y98&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Harris campaign launches closing ad  —  The Harris campaign released its closing ad on Saturday — “Brighter Future” — which will air nationally across NFL games on CBS and Fox this weekend, including during the Detroit Lions vs. Green Bay Packers game — a matchup of swing-state teams … ",
    "url": "https://www.politico.com/live-updates/2024/11/02/2024-elections-live-coverage-updates-analysis/harris-closing-ad-football-00186908"
  },
  {
    "text": "New York Times editorial board urges voters to choose Harris  —  The New York Times editorial board published an opinion piece on Saturday urging people not to vote for former President Trump.  —  “You already know Donald Trump.  He is unfit to lead.  Watch him.",
    "url": "https://thehill.com/homenews/campaign/4967701-new-york-times-editorial-board-urges-voters-to-choose-harris/"
  },
  {
    "text": "Close RFK Jr. friend whose account promoted “Jew World Order” conspiracy theory says she's “working with” Trump's transition team  —  Charlene and Ty Bollinger have also promoted QAnon and conspiracy theories about vaccines, cancer prevention, 9/11, and the 2020 presidential election",
    "url": "https://www.mediamatters.org/antisemitism/close-rfk-jr-friend-whose-account-promoted-jew-world-order-conspiracy-theory-says-shes"
  },
  {
    "text": "Tlaib declines to endorse Harris at UAW rally in Detroit  —  Detroit — U.S. Rep. Rashida Tlaib of Detroit declined to endorse Vice President Kamala Harris' bid for the presidency Friday at a United Auto Workers union rally as Democrats made a late appeal to get union voters to the polls.",
    "url": "https://www.detroitnews.com/story/news/politics/2024/11/01/rashida-tlaib-declines-to-endorse-kamala-harris-at-uaw-rally-in-detroit/75969687007/"
  },
  {
    "text": "Raffensperger urges voters to ignore X ad purporting fraud: 'Don't fall for it'  —  Georgia Secretary of State Brad Raffensbegrer addresses a video falsely depicting a Haitian immigrant voting numerous times during a Friday CNN appearance.  —  “As we checked it out, came to a conclusion real quick.",
    "url": "https://thehill.com/homenews/campaign/4967636-raffensperger-urges-voters-ignore-x-ad-purporting-fraud/"
  },
  {
    "text": "Elon Musk's canvassing operation sued in California for alleged labor law violations  —  Plaintiffs accuse America Pac of several violations during its operation to support Orange county's Michelle Steel  —  Elon Musk's troubled canvassing operation on behalf of Donald Trump and the Republican party … ",
    "url": "https://www.theguardian.com/us-news/2024/nov/02/elon-musk-america-pac-labor-law-violations"
  },
  {
    "text": "Maher delivers final message to undecided voters: It may get worse under Trump  —  Bill Maher warned viewers that things may get worse if former President Trump gets a second term in The White House.  —  “So, dear Christmas Eve voter, I say to you: things aren't that bad … ",
    "url": "https://thehill.com/homenews/campaign/4967355-maher-delivers-final-message-backing-harris/"
  },
  {
    "text": "In Shift From 2020, Identity Politics Loses Its Grip on the Country  —  There are signs that society is moving away from the progressive left's often strict expectations about how to discuss culture and politics.  —  The last time Kamala Harris ran for president, during the 2020 primaries … ",
    "url": "https://www.nytimes.com/2024/11/02/us/politics/election-2024-harris-progressives.html?unlocked_article_code=1.W04.Gpl9.KS2pK6RrJflO&smid=nytcore-ios-share&referringSource=articleShare"
  }
]