[
  {
    "text": "Russia's Staggering Success In Duping Willing Republicans And Right Wing Media  —  A lot of things happened.  Here are some of the things.  This is TPM's Morning Memo.  —  The Plot Thickens  —  The former FBI informant charged with fabricating the Burisma bribery story about President Biden … ",
    "url": "https://morningmemo.talkingpointsmemo.com/p/russias-staggering-success-in-duping"
  },
  {
    "text": "Republicans Delete Reference To FBI Informant From Impeachment Interview Request Letter  —  The indictment of an FBI informant for fabricating a bribery allegation against Joe Biden has blown a hole in the impeachment case against the president.  —  LOADING",
    "url": "https://www.huffpost.com/entry/republican-impeachment-alexander-smirnov_n_65d566cde4b0cc1f2f7a01b3"
  },
  {
    "text": "Jim Jordan Is in Deep Trouble  —  Ohio congressman Jim Jordan could face major repercussions over the Republican attempt to impeach Joe Biden after a former FBI informant charged with making false bribery claims against the president was accused of using Russian intelligence, legal experts suggest.",
    "url": "https://www.newsweek.com/jim-jordan-joe-biden-impeachment-bribery-russia-1871889"
  },
  {
    "text": "Nikki Haley sides with Alabama Supreme Court on IVF ruling: ‘Embryos, to me, are babies’  —  The Alabama court's recent ruling raised concerns among doctors and patients worried that classifying embryos as children could restrict in-vitro fertilization.  —  NORTH AUGUSTA, S.C. … ",
    "url": "https://www.nbcnews.com/politics/2024-election/nikki-haley-sides-alabama-supreme-court-ivf-ruling-embryos-are-babies-rcna139819"
  },
  {
    "text": "Shock, anger, confusion grip Alabama after court ruling on embryos  —  Alabama doctors are puzzled over whether they will have to make changes to in vitro fertilization procedures.  Couples have crammed into online support groups wondering if they should transfer frozen embryos out of state.",
    "url": "https://www.washingtonpost.com/nation/2024/02/20/alabama-supreme-court-ivf-embryos/"
  },
  {
    "text": "Fearing prosecution, UAB pauses in vitro fertilization after Alabama embryo court ruling  —  The University of Alabama at Birmingham health system has paused in vitro fertilization procedures following an Alabama Supreme Court decision due to fear of criminal prosecution and lawsuits, a spokeswoman said.",
    "url": "https://www.al.com/news/2024/02/uab-pauses-in-vitro-fertilization-due-to-fear-of-prosecution-officials-say.html"
  },
  {
    "text": "FACT SHEET: President Biden Cancels Student Debt for more than 150,000 Student Loan Borrowers Ahead of Schedule  —  Today, President Biden announced the approval of $1.2 billion in student debt cancellation for almost 153,000 borrowers currently enrolled in the Saving on a Valuable Education (SAVE) repayment plan.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/02/21/fact-sheet-president-biden-cancels-student-debt-for-more-than-150000-student-loan-borrowers-ahead-of-schedule/"
  },
  {
    "text": "Biden cancels student debt for 150K borrowers  —  The Biden administration announced Wednesday it is forgiving a total of $1.2 billion in student debt for roughly 153,000 borrowers.  —  The relief comes through the Saving on a Valuable Education (SAVE) repayment plan, which made changes … ",
    "url": "https://thehill.com/homenews/administration/4480304-biden-cancels-student-debt-for-150k-borrowers/"
  },
  {
    "text": "Trump and allies plotting militarized mass deportations, detention camps  —  As president, Trump sought to use military planes and bases for deportation.  Now, he and his allies are talking about a new effort that current and former officials warn could be impractical and dangerous.",
    "url": "https://www.washingtonpost.com/politics/2024/02/20/trump-mass-deportations-immigration/"
  },
  {
    "text": "Trump confirms names on VP shortlist: 'They're all good, they're all solid'  —  Former President Trump confirmed a list of names floated to be on his vice presidential shortlist Tuesday, during a town hall event in Greenville, S.C.  —  Trump joined Fox News Channel's Laura Ingraham to discuss … ",
    "url": "https://thehill.com/homenews/campaign/4480275-trump-confirms-names-on-vp-shortlist/"
  },
  {
    "text": "Mike Johnson invoked God in a GOP presentation on keeping the majority.  It didn't land well.  —  The speaker delivered a presentation that, while ostensibly about holding the majority this fall, took a notably moral turn, according to two people in the room.",
    "url": "https://www.politico.com/live-updates/2024/02/21/congress/johnsons-sermon-to-gop-retreagt-00142436"
  },
  {
    "text": "The Antisemitic Cartoon  —  Dear Members of the Harvard Community,  —  A few groups purporting to speak on behalf of Harvard affiliates recently circulated a flagrantly antisemitic cartoon in a post on social media channels.  The cartoon, included in a longer post, depicted what appeared … ",
    "url": "https://www.harvard.edu/president/news/2024/the-antisemitic-cartoon/"
  },
  {
    "text": "Nex Benedict matters  —  Nex Benedict, a 16-year-old Oklahoma sophomore, died on February 8.  Nex, who was non-binary, was attacked in an Owasso High School bathroom the previous day, sustaining serious head injuries.  Nex's grandmother and legal guardian, Sue Benedict, said … ",
    "url": "https://popular.info/p/nex-benedict-matters"
  },
  {
    "text": "Sean Hannity and the case of the sawdust ‘cocaine’  —  A central tenet of Sean Hannity's on-air rhetoric over the past few years has been that the federal government — and, specifically, federal law enforcement — is not reliable.  —  After all, how else to wave away the various indictments of his friend and ally Donald Trump?",
    "url": "https://www.washingtonpost.com/politics/2024/02/21/hannity-hunter-sawdust-cocaine/"
  },
  {
    "text": "California Budget Deficit Swells to $73 Billion as Incoming Tax Revenue Falls, Watchdog Reports  —  California's budget watchdog warned Tuesday that the state's deficit has swelled to $73 billion this year, just a month after Gov. Gavin Newsom (D.) painted a rosier picture of the state's financial outlook.",
    "url": "https://freebeacon.com/california/california-budget-deficit-swells-to-73-billion-watchdog-reports/"
  },
  {
    "text": "Mar-a-Lago judge denies Trump's request to file briefs together in documents case, orders slower, one-by-one pace instead  —  The federal judge overseeing Donald Trump's indictment for allegedly illegally retaining classified documents at his Mar-a-Lago estate in Florida has denied a request … ",
    "url": "https://lawandcrime.com/high-profile/mar-a-lago-judge-denies-trumps-request-to-file-briefs-together-in-documents-case-orders-slower-one-by-one-pace-instead/"
  },
  {
    "text": "Donald Trump may not believe in God, but he still plans to turn America into a Christian theocracy  —  Like any cult leader, Trump's goal is to get power — and the religious right is ready to take advantage  —  If there were only some way to prove it, I would happily bet everything I own that Donald Trump does not believe in God.",
    "url": "https://www.salon.com/2024/02/21/donald-may-not-believe-in-god-but-he-still-plans-to-turn-america-into-a-christian-theocracy/"
  },
  {
    "text": "Florida School Rocked by More Cases of Measles as Parents Skip Vax  —  Eleven other states have reported measles cases this year, but no area has been hit as hard as South Florida.  —  An elementary school in Florida has been hit with a measles outbreak that's made six students sick … ",
    "url": "https://www.thedailybeast.com/florida-elementary-school-rocked-by-more-cases-of-measles"
  },
  {
    "text": "Tax records reveal the lucrative world of covid misinformation  —  Four major nonprofits that rose to prominence during the coronavirus pandemic by capitalizing on the spread of medical misinformation collectively gained more than $118 million between 2020 and 2022, enabling the organizations … ",
    "url": "https://www.washingtonpost.com/nation/2024/02/21/covid-misinformation-earnings/"
  },
  {
    "text": "How the Kremlin weaponized Russian history — and has used it to justify the war in Ukraine  —  Earlier this month, when Tucker Carlson asked Vladimir Putin about his reasons for invading Ukraine two years ago, Putin gave him a lecture on Russian history.  The 71-year-old Russian leader spent … ",
    "url": "https://apnews.com/article/russia-ukraine-war-history-putin-propaganda-80cb70fff9820357eddb83170695bdbb"
  },
  {
    "text": "Sidney Powell and Other Trump-Aligned Lawyers Will Face Legal Penalties  —  The Supreme Court declined to take up an appeal by a group of lawyers who challenged the 2020 election results in Michigan.  —  Sidney Powell, L. Lin Wood and several other lawyers who advanced former President … ",
    "url": "https://www.nytimes.com/2024/02/21/us/politics/trump-sidney-powell-kraken.html"
  },
  {
    "text": "A reporter investigated neo-Nazis.  Then they came to his house in masks.  —  The chilling visit to Raw Story reporter Jordan Green's home represents an increasingly common tactic by extremist groups  —  Jordan Green reports on extremists for the news website Raw Story … ",
    "url": "https://www.washingtonpost.com/style/media/2024/02/20/raw-story-neo-nazi-journalist-house/"
  },
  {
    "text": "Appeals court tosses Obama-era federal coal leasing moratorium  —  A federal appeals court on Wednesday axed an Obama-era moratorium on new coal mine leasing on public lands.  —  It did so by overturning a ruling from 2022 that revived the Obama-era freeze on auctioning off federally owned lands for coal mining.",
    "url": "https://thehill.com/policy/energy-environment/4481282-appeals-court-tosses-obama-era-coal-leasing-moratorium/"
  },
  {
    "text": "Former CNN anchor John Avlon announces bid for Congress  —  Former CNN anchor John Avlon announced a bid Wednesday for New York's first congressional district, claiming “democracy is in danger.”  —  In a video posted on X, formerly known as Twitter, Avlon said he was running to help preserve democracy … ",
    "url": "https://thehill.com/homenews/house/4480256-john-avlon-cnn-announces-bid-for-congress/"
  },
  {
    "text": "Ron DeSantis ally Chris Rufo has close ties with ‘dissident right’ magazine  —  Relationship with IM-1776 that praises dictators, racist ideologues and attacks liberal democracy is collaborative and supportive  —  Chris Rufo, a rightwing culture-war celebrity and close Ron DeSantis ally … ",
    "url": "https://www.theguardian.com/world/2024/feb/21/chris-rufo-im-1776-far-right-desantis"
  },
  {
    "text": "White House uses GOP recess as tool to hammer inaction on Ukraine aid  —  A new memo offers a “vacation reading” list of potential threats if a defense funding bill is not approved.  —  The White House ratcheted up its onslaught on House Republican leadership, criticizing them for going on … ",
    "url": "https://www.politico.com/news/2024/02/21/white-house-gop-recess-ukraine-aid-00142425"
  }
]