[
  {
    "text": "Live Updates: Trump Threatens to Cut Elon Musk's Government Contracts as Feud Escalates  —  The open acrimony between the two men comes after the billionaire denounced President Trump's signature domestic policy bill as an “abomination.”  —  Haiyun Jiang for The New York Times  —  Here's the latest.",
    "url": "https://www.nytimes.com/live/2025/06/05/us/trump-elon-musk"
  },
  {
    "text": "Trump and His Team Tease Vengeance Against Elon as Feud Goes Nuclear  —  The president is threatening to “terminate” Musk's federal contracts, while a senior appointee warns the administration could investigate his companies  —  President Donald Trump has threatened to “terminate” … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-threatens-vengeance-against-elon-musk-feud-1235356996/"
  },
  {
    "text": "Trump and Musk's relationship flames out just as intensely and publicly as it started  —  Donald Trump and Elon Musk's alliance took off like one of SpaceX's rockets.  It was supercharged and soared high.  And then it blew up.  —  The spectacular flameout Thursday peaked as Trump threatened … ",
    "url": "https://apnews.com/article/trump-musk-tax-bill-6e7845081259c34db785182c51569c0c"
  },
  {
    "text": "Trump-Musk Feud Explodes as Elon Alleges Trump Is in Epstein Files  —  Meanwhile, the president suggested the world's richest man may have come down with a nasty case of Trump Derangement Syndrome  —  Elon Musk has been waging a full-throated campaign against Donald Trump's “big, beautiful” … ",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-slams-elon-musk-dispute-spending-bill-1235356539/"
  },
  {
    "text": "Tesla Plunges After Conflict Erupts Between Musk and Trump … Trump on Thursday said he was “very disappointed” by the Tesla chief executive officer's criticism of the president's signature tax policy bill.  Musk fired back in several social media posts, saying in one that “without me, Trump would have lost the election.”",
    "url": "https://www.bloomberg.com/news/articles/2025-06-05/tesla-has-1-2-billion-at-risk-in-trump-bill-musk-wants-to-kill"
  },
  {
    "text": "Mike Johnson scrambles to stop Elon Musk from torching the megabill  —  The speaker is mounting a multi-front rebuttal to the billionaire's criticism — and trying to keep the backlash contained.  —  Mike Johnson has spent his 19 months as speaker forging a close relationship with President Donald Trump … ",
    "url": "https://www.politico.com/news/2025/06/05/elon-musk-mike-johnson-megabill-00390657"
  },
  {
    "text": "Musk calls for Trump's impeachment  —  Elon Musk unleashed a fresh round of tweets Thursday evening, calling for President Trump to be impeached and declaring that SpaceX would begin decommissioning a spacecraft essential to NASA's operation.  —  Why it matters: Trump's threat to cancel billions … ",
    "url": "https://www.axios.com/2025/06/05/musk-trump-impeachment"
  },
  {
    "text": "Musk Says SpaceX to Decommission Dragon Spacecraft Immediately  —  Elon Musk said he was going to decommission SpaceX's Dragon spacecraft that ferries cargo and people to the International Space Station for the US, escalating a dayslong spat between the billionaire and President Donald Trump.",
    "url": "https://www.bloomberg.com/news/articles/2025-06-05/musk-says-spacex-to-decommission-dragon-spacecraft-immediately-mbjtsokw"
  },
  {
    "text": "Stephen Miller Erupts in Fury Over Low Arrests—and Hands Dems a Weapon  —  The potential deportation of people like Carol Hui, which has shocked locals in the Missouri town where she's lived for 20 years, has inspired a searching debate: What did people think they were voting for when they chose Donald Trump?",
    "url": "https://newrepublic.com/article/196154/stephen-miller-erupts-fury-low-arrests-and-hands-dems-weapon"
  },
  {
    "text": "Medicare is a target as Senate GOP faces megabill math issues  —  Republicans have so far kept hands off the politically sensitive program.  But senators are now desperate to find additional spending cuts.  —  Senate Republicans are eyeing possible Medicare provisions to help offset the cost … ",
    "url": "https://www.politico.com/news/2025/06/05/medicare-is-a-target-as-senate-gop-faces-megabill-math-issues-00389537"
  },
  {
    "text": "D.C.'s Reagan National Airport will close during Army's birthday bash  —  Military flyovers and fireworks on June 14, which coincides with Trump's birthday, are expected to disrupt commercial passenger flights.  —  Reagan National Airport is expected to halt takeoffs and landings … ",
    "url": "https://www.washingtonpost.com/business/2025/06/05/army-trump-birthday-parade-airport-closure/"
  },
  {
    "text": "ICE officers stuck in Djibouti shipping container with deported migrants  —  Trump officials transferred the migrants to the East African nation in response to a judge's order.  They now face threats that include rocket attacks from Yemen.  —  Nearly a dozen immigration officers … ",
    "url": "https://www.washingtonpost.com/immigration/2025/06/05/djibouti-deportations-migrants-ice-trump/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9"
  },
  {
    "text": "A Harvard acceptance fulfilled a dream for a student in Ethiopia.  Trump's order stands in his way  —  Winning admission to Harvard University fulfilled a longtime goal for Yonas Nuguse, a student in Ethiopia who endured a war in the country's Tigray region, internet and phone shutdowns … ",
    "url": "https://apnews.com/article/trump-harvard-ban-acceptance-foreign-students-6a2c96addad4c63ad10afe19eb425acd"
  },
  {
    "text": "A Massachusetts student arrested by ICE on his way to volleyball practice has been released  —  A Massachusetts high school student who was arrested by immigration agents on his way to volleyball practice has been released from custody after a judge granted him bond Thursday.",
    "url": "https://apnews.com/article/marcelo-gomes-ice-massachusetts-arrest-volleyball-1356302a723f6f5b0a95028754f7291e"
  },
  {
    "text": "Trump Appoints 22-Year-Old Ex-Gardener and Grocery Store Assistant to Lead U.S. Terror Prevention  —  Counter-terror chief was pulling up weeds just five years ago.",
    "url": "https://www.thedailybeast.com/donald-trump-appoints-22-y-o-ex-gardener-grocery-store-assistant-as-us-homeland-department-terrorist-chief/"
  },
  {
    "text": "After Putin call, Trump suggests Ukraine, Russia should ‘fight for a while’  —  Following his talk with Putin, Trump expressed understanding of Russia's need to retaliate against Ukraine's drone strike on its bomber fleet.  —  President Donald Trump's comment about inevitable Russian retaliation following … ",
    "url": "https://www.washingtonpost.com/world/2025/06/05/putin-trump-phone-call-retaliation-drones/"
  },
  {
    "text": "Elon Musk is a Disgusting Abomination  —  On Tuesday, after Elon Musk blasted out the screed above, a friend texted me: “I guess the worm has turned.  Oh, wait, I guess that's RFK.”  Indeed.  We don't know exactly what set off this tweet and the series of whines that followed, but it may have been the ketamine talking.",
    "url": "https://paulkrugman.substack.com/p/elon-musk-is-a-disgusting-abomination"
  },
  {
    "text": "Rubio sanctions international criminal court judges for ‘targeting’ US and Israel  —  US secretary of state cites ‘illegitimate actions’ of court that issued arrest warrants against Israeli officials  —  The United States is sanctioning four judges from the international criminal court … ",
    "url": "https://www.theguardian.com/us-news/2025/jun/05/marco-rubio-sanctions-icc-judges-israel-gaza"
  },
  {
    "text": "Bidenworld goes scorched earth on Karine Jean-Pierre  —  Former Biden press secretary Karine Jean-Pierre announced Tuesday that she's written a book about a “broken” Biden White House and what she sees as the betrayal of the former president by the Democratic Party.",
    "url": "https://www.axios.com/2025/06/05/karine-jean-pierre-book-reaction-biden-aides"
  },
  {
    "text": "George Clooney predicts what will happen to ‘Trumpism’ after Trump's term  —  CNN's Anderson Cooper interviewed actor George Clooney on the set of his Broadway play, “Good Night, and Good Luck,” which is focused on Edward R. Murrow's famous battle with Senator Joseph McCarthy.",
    "url": "https://cnn.com/2025/06/04/politics/video/george-clooney-ac-trumpism-gop-digvid"
  }
]