[
  {
    "text": "How Trump Fumbled his Attack on Biden's Age  —  Donald Trump and the Republicans smelled blood.  President Biden had recently been on the defensive about his age.  A series of polls released over the weekend heightened Democratic concerns.  The Republicans knew the press would treat … ",
    "url": "https://www.messageboxnews.com/p/how-trump-fumbled-his-attack-on-bidens"
  },
  {
    "text": "Why It's Hard to Explain Joe Biden's Unpopularity  —  Joe Biden is one of the most unpopular presidents in modern American history.  In Gallup polling, his approval ratings are lower than those of any president embarking on a re-election campaign, from Dwight Eisenhower to Donald Trump.",
    "url": "https://www.nytimes.com/2024/03/09/opinion/joe-biden-approval-unpopular.html"
  },
  {
    "text": "Inside Trump's TikTok flip-flop … I don't want Facebook, who cheated in the last Election, doing better.  They are a true Enemy of the People!\"  Trump posted on Truth Social Thursday.  — Hours earlier, a key House committee voted unanimously to advance a bill — backed by Biden … ",
    "url": "https://www.axios.com/2024/03/09/tiktok-ban-trump-republicans"
  },
  {
    "text": "Gingrich: Biden's most inspirational State of the Union moment was ‘when he left’  —  Former House Speaker Newt Gingrich (R-Ga.) said President Biden's most inspirational moment of his State of the Union address was “when he left” Friday.  “I think at the end when he left,” … ",
    "url": "https://thehill.com/homenews/media/4521016-gingrich-bidens-most-inspirational-state-of-the-union-moment-was-when-he-left/"
  },
  {
    "text": "Was Trump supporter Katie Britt caught in whopping lie about graphic sex trafficking story?  —  During her widely panned Republican response to the State of the Union Address on Thursday night, Sen. Katie Britt of Alabama told a graphic sex-trafficking story about a woman who was sexually abused … ",
    "url": "https://www.nj.com/news/2024/03/was-sen-katie-britt-caught-in-whopping-lie-about-graphic-sex-trafficking-story.html"
  },
  {
    "text": "Biden said Republicans oppose women's rights — Katie Britt's “tradwife” response proved him right  —  The “pro-life” lie gives way to GOP leaders denouncing women's suffrage and attacking birth control  —  Politicians love to talk about their families, but in her Thursday night response … ",
    "url": "https://www.salon.com/2024/03/09/biden-said-oppose-womens-rights--katie-britts-tradwife-response-proved-him-right/"
  },
  {
    "text": "Biden rebutter Sen. Britt blasted for recycling 20-year-old sex traffic story to attack border policy  — In her rebuttal to Biden's State of the Union, Republican Sen. Katie Britt of Alabama used what appears to be a sex trafficking victim's experience from the early 2000s to condemn President Joe Biden's current border policy.",
    "url": "https://www.cnbc.com/2024/03/09/katie-britt-unrelated-sex-trafficking-story-state-of-the-union-rebuttal.html"
  },
  {
    "text": "Inside A Secret Society Of Prominent Right-Wing Christian Men Prepping For A ‘National Divorce’  —  A trove of documents obtained by TPM reveal the society's inner workings.  —  A secret, men-only right-wing society with members in influential positions around the country is on a crusade … ",
    "url": "https://talkingpointsmemo.com/news/inside-a-secret-society-of-prominent-right-wing-christian-men-prepping-for-a-national-divorce"
  },
  {
    "text": "DeSantis faces pushback in Florida as voters tire of war on woke  —  Conservative lawmakers rejected a host of new culture wars proposals in the legislature  —  The bill banning rainbow flags from public buildings in Florida sounded like a sure bet.  —  State Rep. David Borrero (R) … ",
    "url": "https://www.washingtonpost.com/nation/2024/03/09/desantis-florida-woke-culture-wars-legislature/"
  },
  {
    "text": "“Tradwives” offer an alluring vision of right-wing Christianity — online warriors are fighting back  —  The #FundieSnark movement battles to “deconstruct” those picture-perfect images of Christian social media  —  As social media stunts go, it's hard to top this one: Give birth to your eighth child at age 33.",
    "url": "https://www.salon.com/2024/03/08/tradwives-offer-an-alluring-vision-of-right-wing-christianity--online-warriors-are-fighting-back/"
  },
  {
    "text": "Immigrants are less likely to commit crimes than U.S.-born Americans, studies find  —  The murder of Laken Riley took center stage during Thursday night's State of The Union.  Riley was a 22-year-old student who was killed last month at the University of Georgia.",
    "url": "https://npr.org/2024/03/08/1237103158/immigrants-are-less-likely-to-commit-crimes-than-us-born-americans-studies-find"
  },
  {
    "text": "Exclusive: US prepared ‘rigorously’ for potential Russian nuclear strike in Ukraine in late 2022, officials say  —  In late 2022, the US began “preparing rigorously” for Russia potentially striking Ukraine with a nuclear weapon, in what would have been the first nuclear attack in war since … ",
    "url": "https://www.cnn.com/2024/03/09/politics/us-prepared-rigorously-potential-russian-nuclear-strike-ukraine/"
  },
  {
    "text": "US ‘prepper’ culture diversifies amid fear of disaster and political unrest  —  Brook Morgan surveyed booths at the “Survival & Prepper Show” in Colorado that were stocked with boxes of ammunition, mounds of trauma medical kits, and every type of knife imaginable.",
    "url": "https://www.reuters.com/world/us/prepping-disaster-diversifies-more-americans-lose-trust-2024-03-09/"
  },
  {
    "text": "Mexican cartel members laugh after National Guard helicopter crashes, kills 3  —  The cartel members can be heard laughing immediately after the fatal helicopter crash  —  Cartel members were seen laughing after a National Guard helicopter carrying three soldiers and a Border Patrol agent crashed near the southern border in Texas.",
    "url": "https://www.foxnews.com/us/mexican-cartel-members-laugh-after-national-guard-helicopter-crashes-kills-3"
  },
  {
    "text": "FBI informant accused of smearing Bidens had past credibility issues  —  Alexander Smirnov revealed his FBI role as he chased financial deals that caused him legal trouble, at one point listing what appeared to be a traffic median as his home address  —  When a Los Angeles internet entrepreneur decided … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/09/alexander-smirnov-fbi-biden-impeachment/"
  }
]