[
  {
    "text": "Government shutdown hours away as House GOP pitches last-ditch deal  —  Just hours before a government shutdown, the House planned to vote on a measure to keep the government open for 45 days at current spending levels, adding money for U.S. disaster relief but none of the billions of dollars … ",
    "url": "https://www.washingtonpost.com/politics/2023/09/30/government-shutdown-updates/"
  },
  {
    "text": "McConnell announces Senate Republicans won't let bipartisan spending bill advance  —  Senate Minority Leader Mitch McConnell (R-Ky.) announced Senate Republicans will vote against advancing the chamber's bipartisan stopgap spending bill as members see an emerging bill coming from the House as the main way to avoid a government shutdown.",
    "url": "https://thehill.com/homenews/senate/4231910-mcconnell-announces-senate-republicans-wont-let-bipartisan-spending-bill-advance/"
  },
  {
    "text": "How Did the Government Get to a Shutdown, and What Will It Take to Reopen?  —  Any deal to keep it open would have to be bipartisan, since the Senate and White House are controlled by Democrats, and the House by Republicans.  —  The federal government is careening toward a shutdown at midnight on Saturday.",
    "url": "https://www.nytimes.com/2023/09/30/us/politics/shutdown-government-reopen.html"
  },
  {
    "text": "Squabbles, missteps and failure to govern: The Republican week that was  —  Republicans offered a kaleidoscopic display of self-inflicted wounds by politicians unwilling to govern responsibly and loath to confront the damage done by Donald Trump  —  There are good weeks and bad weeks … ",
    "url": "https://www.washingtonpost.com/politics/2023/09/30/republican-shutdown-trump-missteps/"
  },
  {
    "text": "Biden aides are sure Republicans will be blamed for a possible government shutdown  —  As Speaker Kevin McCarthy tries to placate his House Republican conference in the fight over spending, the White House is holding out hope that a bipartisan deal brokered days ago in the Senate can eventually overcome the standoff.",
    "url": "https://www.cnn.com/2023/09/30/politics/biden-aides-government-shutdown-republican-blame/"
  },
  {
    "text": "Pregnant with no OB-GYNs around: In Idaho, maternity care became a casualty of its abortion ban  —  After an Idaho hospital closed its obstetrics department, pregnant women in the county have been left without nearby care.  Their OB-GYNs fled the state.  —  If you're pregnant in Bonner County … ",
    "url": "https://www.nbcnews.com/health/womens-health/pregnant-women-struggle-find-care-idaho-abortion-ban-rcna117872"
  },
  {
    "text": "The Trump administration touted him as a victim of #MeToo.  Now he's accused of dismembering a girlfriend  —  The gruesome discovery spoke to a ghastly crime.  —  On the afternoon of July 20, someone using a waterfront trail in Alameda spotted a large garbage bag wrapped in duct tape … ",
    "url": "https://www.sfchronicle.com/bayarea/article/alameda-murder-joseph-roberts-18380333.php"
  },
  {
    "text": "‘Multiple’ people dead after truck crash and ammonia leak lead to evacuation in Illinois  —  The Friday evening crash involved a semi-truck that started leaking anhydrous ammonia, prompting an evacuation of people within about a one mile radius of the crash, including parts of Teutopolis in south central Illinois.",
    "url": "https://www.nbcnews.com/news/us-news/multiple-people-dead-truck-crash-ammonia-leak-lead-evacuation-illinois-rcna118210"
  },
  {
    "text": "Trump's attack on Milley fuels special counsel's push for a gag order  —  Donald Trump has unleashed a social media attack on Mark Milley, suggesting he should have been put to death for treason.  —  Special counsel Jack Smith's office argued Friday that Donald Trump's recent attacks … ",
    "url": "https://www.politico.com/news/2023/09/29/trumps-attack-on-milley-fuels-special-counsels-push-for-a-gag-order-00119253"
  },
  {
    "text": "‘No enemies to the right’: DeSantis ally hosts debate hedging white nationalism  —  Christopher Rufo's Twitter space discussed conservatives cooperating with extremists ‘to destroy the power of the left’  —  Conservative activist Christopher Rufo, who is a close ally of Florida governor … ",
    "url": "https://www.theguardian.com/world/2023/sep/30/conservative-christopher-rufo-florida-twitter-debate"
  },
  {
    "text": "'It's crazy': Shutdown caps Congress' week from hell  —  Back in the 1990s, as then-Speaker Gingrich put it, Republicans could at least “afford to have five or six people be idiots.”  —  Democratic Rep. Jamaal Bowman has never seen a scenario like this week: “Not in real life — in movies.",
    "url": "https://www.politico.com/news/2023/09/30/congress-dysfunction-government-shutdown-00119206"
  },
  {
    "text": "Trump animates California Republicans with calls to shoot people who rob stores  —  In an occasionally dark and profane speech, Donald Trump on Friday sought to win over Republicans in California by complaining that rich people in Beverly Hills smell bad because they're denied water … ",
    "url": "https://apnews.com/article/donald-trump-california-republicans-desantis-e2f59e579f106c03aaf6189ea1079f11"
  },
  {
    "text": "A President on a Picket Line  —  On Tuesday, Joe Biden became the first sitting American president to walk a picket line.  Specifically, he joined strikers and spoke briefly outside a General Motors facility in Van Buren Township, Mich., where hundreds of striking autoworkers were demanding … ",
    "url": "https://www.nytimes.com/2023/09/30/opinion/biden-trump-uaw-strike.html"
  },
  {
    "text": "Dress code debate reflects the US Senate's diminished reputation  —  The debate over the U.S. Senate dress code, spurred by Sen. John Fetterman (D-Pa.), is a fight that seems insignificant to most yet reflects how the once vaunted and respected institution of the U.S. Senate has diminished in the eyes of the American people.",
    "url": "https://thehill.com/opinion/campaign/4228226-dress-code-debate-reflects-the-us-senates-diminished-reputation/"
  },
  {
    "text": "Michigan Republican Party faces financial turmoil, bank records show  —  Lansing — The Michigan Republican Party had about $35,000 in its bank accounts in August, according to internal records that flash new warning signs about the dire state of the GOP's finances and raise questions … ",
    "url": "https://www.detroitnews.com/story/news/politics/2023/09/29/michigan-republican-party-faces-financial-turmoil-bank-records-show/71003017007/"
  },
  {
    "text": "Judge in Trump racketeering case denies motion to suppress evidence  —  X  —  Fulton County Superior Court Judge Scott McAfee on Friday denied a motion by former Trump campaign attorney Kenneth Chesebro to toss out emails and memos he wrote detailing a plan to use a Republican slate of electors … ",
    "url": "https://www.ajc.com/news/judge-in-trump-racketeering-case-denies-kenneth-chesebros-motion-to-suppress-evidence/5ORYBK6NQ5D2NP7BQ775QEINJA/"
  },
  {
    "text": "IRS contractor charged with stealing Donald Trump's tax returns, which were leaked to press  —  Federal prosecutors announced charges Friday against a contractor with the Internal Revenue Service who allegedly stole the tax returns of a high-ranking government official.",
    "url": "https://www.cnn.com/2023/09/29/politics/irs-contractor-trump-taxes/"
  }
]