[
  {
    "text": "President Trump's mindless tariffs will cause economic havoc  —  But the rest of the world can limit the damage  —  If you failed to spot America being “looted, pillaged, raped and plundered by nations near and far” or it being cruelly denied a “turn to prosper”, then congratulations … ",
    "url": "https://www.economist.com/leaders/2025/04/03/president-trumps-mindless-tariffs-will-cause-economic-havoc"
  },
  {
    "text": "Trump contradicts aides, talking points on purpose of global tariffs  —  Investors and global leaders have been trying to understand the purpose of sprawling new import duties.  —  President Donald Trump on Thursday contradicted his top aides on the purpose of his sprawling new global tariff regime … ",
    "url": "https://www.washingtonpost.com/business/2025/04/03/tariffs-trump-global-trade-talks/"
  },
  {
    "text": "Trump's new tariff math looks a lot like ChatGPT's  —  ChatGPT, Gemini, Grok, and Claude all recommend the same “nonsense” tariff calculation. … When President Donald Trump began yesterday's announcement of the White House's latest trade policy brandishing a novelty-sized cardboard sign labeled … ",
    "url": "https://www.theverge.com/news/642620/trump-tariffs-formula-ai-chatgpt-gemini-claude-grok"
  },
  {
    "text": "Trump Jets Off to Watch Golf as U.S. Economy Goes Up in Flames  —  TRUMPENOMICS  —  The stock market is in free fall, but the president is headed to Florida.  —  President Donald Trump's response to a tanking U.S. stock market—brought on by his sweeping tariff announcement Wednesday—is to fly to Florida.",
    "url": "https://www.thedailybeast.com/trump-jets-off-to-watch-golf-as-us-economy-goes-up-in-flames/"
  },
  {
    "text": "Will Malignant Stupidity Kill the World Economy?  —  A quick thank you to my readers.  When I struck out on my own, I wasn't sure if anyone would follow.  But I just passed 300K subscribers.  I'll try to be worthy of your support.  —  America created the modern world trading system.",
    "url": "https://paulkrugman.substack.com/p/will-careless-stupidity-kill-the"
  },
  {
    "text": "The real reason Trump is destroying the economy  —  The Trump administration's tariffs are, by every reasonable account, an economic catastrophe in the making.  So why are they happening?  —  One explanation is that this is simply democracy at work.  President Donald Trump campaigned … ",
    "url": "https://www.vox.com/politics/407053/trump-tariff-expensive-democracy-authoritarianism-breakdown"
  },
  {
    "text": "They're Not Tariffs, They're Sanctions  —  Stop trying to place coherence on a policy that's really just a mob boss breaking legs and asking for protection money.  —  President Donald Trump departs after signing an executive order on tariffs in the Rose Garden at the White House, April 2, 2025, in Washington.",
    "url": "https://prospect.org/economy/2025-04-03-theyre-not-tariffs-theyre-sanctions/"
  },
  {
    "text": "Trump sued over China tariffs  —  President Trump was sued Thursday over the 20 percent tariffs he imposed on Chinese goods in the weeks leading up to Wednesday's broader announcement.  —  It marks the first known legal challenge against Trump's tariffs, which have fulfilled a campaign promise and rattled financial markets.",
    "url": "https://thehill.com/homenews/5231388-trump-sued-over-china-tariffs/"
  },
  {
    "text": "Trump Fires 6 N.S.C. Officials After Oval Office Meeting With Laura Loomer  —  During the 30-minute meeting, the far-right activist excoriated National Security Council officials in front of the president and Michael Waltz, the national security adviser.  —  President Trump fired six National … ",
    "url": "https://www.nytimes.com/2025/04/03/us/politics/trump-meeting-laura-loomer.html"
  },
  {
    "text": "White House fires three NSC staffers after president meets with far-right activist Laura Loomer  —  The White House has fired at least three National Security Council staffers, three sources familiar with the move told CNN.  —  The firings came after Laura Loomer, the far-right activist … ",
    "url": "https://cnn.com/2025/04/03/politics/nsc-firings-trump-laura-loomer-meeting/"
  },
  {
    "text": "Scoop: Multiple firings on Trump's National Security Council after Loomer visit  —  Several members of President Trump's embattled National Security Council have been fired, a U.S. official and a second source familiar told Axios on Thursday.  —  Why it matters: The firings come … ",
    "url": "https://www.axios.com/2025/04/03/trump-laura-loomer-fire-national-security-council"
  },
  {
    "text": "Top Republican leads bill to reassert Congress' tariff power amid Trump trade war  —  Sen. Chuck Grassley, a senior Republican lawmaker from the farm-heavy state of Iowa, is spearheading new legislation that would reassert Congress' authority over tariffs amid President Donald Trump's trade war escalation.",
    "url": "https://www.politico.com/live-updates/2025/04/03/congress/top-republican-leads-bill-to-reassert-congress-tariff-power-amid-trump-trade-war-00268710"
  },
  {
    "text": "‘Oh Sh-t’: RH Chief Is Shocked as Tariffs Drag Down Stock 44% … “Oh sh-t.”  That was RH Chief Executive Officer Gary Friedman's reaction to what was happening to the luxury furniture maker's stock price on Wednesday evening.  —  Donald Trump had just announced plans for an avalanche … ",
    "url": "https://www.bloomberg.com/news/articles/2025-04-03/rh-plummets-30-on-threat-from-trump-s-tariffs-outlook-miss?accessToken=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzb3VyY2UiOiJTdWJzY3JpYmVyR2lmdGVkQXJ0aWNsZSIsImlhdCI6MTc0MzcwMDcwMiwiZXhwIjoxNzQ0MzA1NTAyLCJhcnRpY2xlSWQiOiJTVTU0WDdEV1JHRzAwMCIsImJjb25uZWN0SWQiOiJCOTdGRUFDNjI5N0Y0ODdGODFCOTE5MTRCOUE0QTVENiJ9.2jep0al9SCQm6b0Oig_lkuY24dhmfhIZf-LZn0CDw8U"
  },
  {
    "text": "Dow drops 1,400 as US stocks lead worldwide sell-off after Trump's tariffs ignite a COVID-like shock  —  Financial markets around the world are reeling Thursday following President Donald Trump's latest and most severe set of tariffs, and the U.S. stock market is taking the worst of it so far.",
    "url": "https://apnews.com/article/stocks-markets-rates-tariffs-52dbb020a4c41122e31669c2da236d67"
  },
  {
    "text": "California, Connecticut and Washington lose federal grant funding for local libraries and museums  —  Sydney Carruth and Ryan J. Reilly  —  Several states were notified this morning the federal grant funding they rely on to operate local libraries and museums has been terminated.",
    "url": "https://www.nbcnews.com/politics/trump-administration/live-blog/trump-tariffs-china-doge-musk-immigration-live-updates-rcna199420/rcrd76195?canonicalCard=true"
  },
  {
    "text": "RFK Jr. announces HHS reinstating some programs, employees cut by mistake  —  He didn't indicate when the reinstatements would happen.  —  Health and Human Services Secretary Robert F. Kennedy Jr. arrives before President Donald Trump speaks during an event to announce new tariffs … ",
    "url": "https://abcnews.go.com/Politics/rfk-jr-announces-hhs-reinstating-programs-employees-cut/story?id=120463293"
  },
  {
    "text": "Trump Administration Set to Pause $510 Million for Brown University  —  The administration has now targeted five schools' federal funding as part of a pledge to combat what it considers to be antisemitism on university campuses.  —  The Trump administration intends to block $510 million … ",
    "url": "https://www.nytimes.com/2025/04/03/us/trump-administration-brown-university-funding-pause.html"
  },
  {
    "text": "Eugene Robinson Leaves the Washington Post After Jeff Bezos' ‘Significant Shift’ to Opinion Section  —  “I wish nothing but the very best for the paper and for all of you.  I won't be a stranger,” the political columnist tells his colleagues after 45 years at WaPo",
    "url": "https://www.thewrap.com/eugene-robinson-leaves-the-washington-post-jeff-bezos-opinion/"
  },
  {
    "text": "Stellantis idles plants in Mexico and Canada due to tariffs … DETROIT — Stellantis is pausing production at two assembly plants in Canada and Mexico as the company attempts to navigate President Donald Trump's new round of 25% automotive tariffs that took effect Thursday.",
    "url": "https://www.cnbc.com/2025/04/03/stellantis-idles-plants-in-mexico-and-canada-due-to-tariffs.html"
  },
  {
    "text": "The American Age Is Over  —  1. Canada  —  Fittingly, it was the Canadian prime minister, Mark Carney, who declared the official time of death. … And just like that, the age of American empire, the great Pax Americana, ended.  —  Share  —  We cannot overstate what has just happened.",
    "url": "https://www.thebulwark.com/p/the-american-age-is-over"
  },
  {
    "text": "Trump Officials Could Be Held in Contempt for Deportation Flights, Judge Says  —  Judge says administration ‘acted in bad faith’ in removal of alleged Venezuelan gang members under wartime law  —  WASHINGTON—A federal judge said he was considering whether to hold Trump administration officials … ",
    "url": "https://www.wsj.com/politics/policy/trump-officials-could-be-held-in-contempt-for-deportation-flights-judge-says-279bb61d"
  },
  {
    "text": "A Response to a Member of Congress  —  Sydney Kamlager-Dove, Democrat of California, accused me of serial sex offenses in a public hearing, then said my lack of response was “telling.”  It's listed below  —  1,746  —  Sydney Kamlager-Dove, a Democrat representing California's 37th district … ",
    "url": "https://www.racket.news/p/a-response-to-a-member-of-congress"
  },
  {
    "text": "Federal judge temporarily blocks $11 billion in Trump administration's cuts to public health funding  —  A federal judge on Thursday temporarily blocked the Trump administration's move to cut over $11 billion in public health funding to states after 23 states and the District of Columbia sued to keep the funding intact.",
    "url": "https://www.cbsnews.com/news/trump-public-health-cuts-states-lawsuit/"
  },
  {
    "text": "Radio Free Europe says US switches off satellite transmitting Russia broadcast  —  PRAGUE - The head of Radio Free Europe/Radio Liberty said on April 3 that the US government had switched off a satellite that transmitted its Russian-language programme into Russia.",
    "url": "https://www.straitstimes.com/world/europe/radio-free-europe-says-us-switches-off-satellite-transmitting-russia-broadcast"
  },
  {
    "text": "States sue to block Trump's election order, saying it violates the Constitution  —  Democratic officials in 19 states filed a lawsuit Thursday against President Donald Trump's attempt to reshape elections across the U.S., calling it an unconstitutional invasion of states' clear authority to run their own elections.",
    "url": "https://apnews.com/article/trump-elections-executive-order-states-lawsuit-5790caa7d4d801c4053e73dfa50622e9"
  }
]