[
  {
    "text": "Live Updates: Trump to Be Sentenced in N.Y. Criminal Case  —  The proceedings are set to begin at 9:30 a.m. in Manhattan.  Though the president-elect is expected to avoid jail time, his sentencing on 34 counts will formalize his status as a felon and make him the first to carry that distinction into the White House.",
    "url": "https://www.nytimes.com/live/2025/01/10/nyregion/trump-hush-money-sentencing?unlocked_article_code=1.oE4.Lfvj.59La0Pj1ELhH&smid=url-share"
  },
  {
    "text": "Meta Deletes Trans and Nonbinary Messenger Themes  —  Meta deleted nonbinary and trans themes for its Messenger app this week, around the same time that the company announced it would change its rules to allow users to declare that LGBTQ+ people are “mentally ill,” 404 Media has learned.",
    "url": "https://www.404media.co/meta-deletes-trans-and-nonbinary-messenger-themes/"
  },
  {
    "text": "Inside Mark Zuckerberg's Sprint to Remake Meta for the Trump Era  —  After visiting President-elect Donald J. Trump in November, Mr. Zuckerberg decided to relax Meta's speech policies.  He asked a small team to carry out his goals within weeks.  The repercussions are just beginning.",
    "url": "https://www.nytimes.com/2025/01/10/technology/meta-mark-zuckerberg-trump.html?unlocked_article_code=1.oE4.jwD6.Qu-_MhilMnvv&smid=url-share"
  },
  {
    "text": "Meta never cared about factchecking.  What it wants is friction-free oligarchy  —  The company's plan to end its factchecking program is about appeasing Trump.  That signals the making of a mafia state  —  This week Meta announced the elimination of its factchecking program in the US … ",
    "url": "https://www.theguardian.com/commentisfree/2025/jan/10/meta-factchecking-donald-trump"
  },
  {
    "text": "Exclusive: Meta kills DEI programs … - The moves come just three days after Meta ended many of its efforts to fact-check and police speech on Facebook, Instagram and Threads.  — The announcement also follows a host of public moves by tech companies and executives to align with the politics … ",
    "url": "https://www.axios.com/2025/01/10/meta-dei-programs-employees-trump"
  },
  {
    "text": "House GOP puts Medicaid, ACA, climate measures on chopping block  —  The menu of potential spending offsets has been circulated by House Budget Chair Jodey Arrington.  —  House Republicans are passing around a “menu” of more than $5 trillion in cuts they could use to bankroll President-elect … ",
    "url": "https://www.politico.com/news/2025/01/10/spending-cuts-house-gop-reconciliation-medicaid-00197541"
  },
  {
    "text": "DOGE is dispatching agents across U.S. government  —  Federal officials are already dealing with surrogates from Elon Musk and Vivek Ramaswamy's nongovernmental body before Donald Trump is sworn in again.  —  Elon Musk and Vivek Ramaswamy are sending representatives to agencies across … ",
    "url": "https://www.washingtonpost.com/business/2025/01/10/musk-ramaswamy-doge-federal-agencies/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM2NDg1MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM3ODY3NTk5LCJpYXQiOjE3MzY0ODUyMDAsImp0aSI6ImRhY2Q0MmI5LWM5NjEtNGM1ZS05YWU4LWNiNTBlNjM3NTI0NyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9idXNpbmVzcy8yMDI1LzAxLzEwL211c2stcmFtYXN3YW15LWRvZ2UtZmVkZXJhbC1hZ2VuY2llcy8ifQ.SPfFh8QQmh7CW5xnX93Txv0_sUOA_AFxK_KUkCFRgO4&itid=gfta"
  },
  {
    "text": "US adds whopping 256K jobs in December  —  The U.S. added 256,000 jobs and the unemployment rate ticked down to 4.1 percent in December, according to data released Friday by the Labor Department.  —  The December jobs report showed the U.S. economy blowing past expectations to end the year.",
    "url": "https://thehill.com/business/5078668-us-adds-whopping-256k-jobs-in-december/"
  },
  {
    "text": "Gabbard reverses course on key intel-gathering tool as nomination teeters … In her first public comments since being nominated, Gabbard told us in an exclusive statement that she now supports Section 702, saying the program is “crucial” and “must be safeguarded to protect our nation while ensuring the civil liberties of Americans.”",
    "url": "https://punchbowl.news/article/senate/gabbard-changes-stance-on-section-702/"
  },
  {
    "text": "How Outlets on the Left and Right Have Covered the Los Angeles Wildfires  —  Media outlets reported similarly on the destruction caused by the fires that raced through Southern California.  But partisan publications attributed them to very different causes.",
    "url": "https://www.nytimes.com/2025/01/09/business/media/los-angeles-wildfires-media-coverage.html?unlocked_article_code=1.oE4.2VtQ.XBN_sSFfrSvO&smid=url-share"
  },
  {
    "text": "Barry Blitt's “Two's a Crowd”  —  Elon Musk takes center stage.  —  In cartoonist Barry Blitt's portrayal of the upcoming Inauguration Day, the new President is sidelined into a dash of yellow hair and a sliver of red tie.  “On January 20, 2025, the next leader of the United States—and of the free world—assumes power,” Blitt said.",
    "url": "https://www.newyorker.com/culture/cover-story/cover-story-2025-01-20"
  },
  {
    "text": "As a Climate Scientist, I Knew It Was Time to Leave Los Angeles  —  I am utterly devastated by the Los Angeles wildfires, shaking with rage and grief.  The Altadena community near Pasadena, where the Eaton fire has damaged or destroyed at least 5,000 structures, was my home for 14 years.",
    "url": "https://www.nytimes.com/2025/01/10/opinion/la-fires-los-angeles-wildfires.html?unlocked_article_code=1.oE4.wlwn.9-ljiFqRbGB9&smid=bs-share"
  },
  {
    "text": "Mike Johnson Seeks Money From Democratic Bill He Called ‘Legislative Malpractice’  —  The House speaker opposed the Inflation Reduction Act and has vowed to roll it back.  But he's quietly urging the EPA to give his district a grant funded by the law.  —  LOADING",
    "url": "https://www.huffpost.com/entry/mike-johnson-inflation-reduction-act-grant_n_6781505de4b03b195d664a4a"
  },
  {
    "text": "A time for truth and reconciliation  —  Trump's return to the White House augurs the ‘apokálypsis’ of the ancien regime's secrets  —  The writer is a technology entrepreneur and investor.  —  In 2016, President Barack Obama told his staff that Donald Trump's election victory was “not the apocalypse”.",
    "url": "https://www.ft.com/content/a46cb128-1f74-4621-ab0b-242a76583105"
  },
  {
    "text": "Supreme Court Rebuke of Trump on Sentencing Shows Its Divisions  —  Two Republican appointees, Chief Justice Roberts and Justice Barrett, joined the court's three liberals in ordering the president-elect to face sentencing on Friday.  —  The Supreme Court's rejection on Thursday … ",
    "url": "https://www.nytimes.com/2025/01/09/us/supreme-court-trump-hush-money.html"
  },
  {
    "text": "Opening the DNC's Black Box  —  Why we're publishing a previously undisclosed list of all 448 members of the Democratic National Committee  —  Three weeks from now, the Democratic National Committee will convene in National Harbor, Maryland, to elect a new party chair and other national officers.",
    "url": "https://prospect.org/politics/2025-01-10-opening-dncs-black-box/"
  },
  {
    "text": "DHS to Extend Temporary Protected Status for Venezuela  —  Extension Allows Eligible Venezuelan Nationals Who Arrived on or Before July 31, 2023, to Maintain TPS and Employment Authorization Following Vetting  —  WASHINGTON -The Department of Homeland Security announced today the extension … ",
    "url": "https://www.dhs.gov/news/2025/01/10/dhs-extend-temporary-protected-status-venezuela"
  },
  {
    "text": "Biden job gains top Trump and Obama … - Trump oversaw 2.1 million job losses, although there were 6.6 million jobs added during his first three years in office (i.e., pre-pandemic years).  — Obama oversaw 7.1 million job gains, with losses at the beginning of his first term due to the Great Financial Crisis.",
    "url": "https://www.axios.com/2025/01/10/iden-job-gains-obama-trump"
  },
  {
    "text": "Live Updates: Supreme Court Seems Poised to Uphold Law That Could Ban TikTok in the U.S.  —  Congress labeled the app's Chinese ownership a national security risk and passed a law that would ban the social media platform unless it was sold.  TikTok and creators say that violates their free speech rights.",
    "url": "https://www.nytimes.com/live/2025/01/10/us/tiktok-ban-supreme-court?unlocked_article_code=1.oE4.-nt6.xNNZ0Hn5IdV2&smid=url-share"
  },
  {
    "text": "Another Fox News alum invited to join the new Trump administration  —  Donald Trump has picked Fox News contributor Leo Terrell to serve as senior counsel to the assistant attorney general for civil rights in the Justice Department, Harmeet K. Dhillon.  Trump said Terrell … ",
    "url": "https://www.politico.com/live-updates/2025/01/09/congress/trump-turns-again-to-fox-news-00197453"
  },
  {
    "text": "Bird Flu Is a National Embarrassment  —  America should have more aggressively intervened almost a year ago.  —  Three years ago, when it was trickling into the United States, the bird-flu virus that recently killed a man in Louisiana was, to most Americans, an obscure and distant threat.",
    "url": "https://www.theatlantic.com/health/archive/2025/01/bird-flu-embarrassing/681264/"
  },
  {
    "text": "Kash Patel's Emails Offer Insight Into How He Might Run the FBI  —  More than 800 pages of Patel's emails obtained by FOIA Files, from the Office of Director of National Intelligence, raise questions about whether he'll weaponize the FBI to settle scores if he's confirmed as the bureau's next director.",
    "url": "https://www.bloomberg.com/news/newsletters/2025-01-10/trump-nominee-kash-patel-s-odni-emails-show-how-he-might-politicize-fbi"
  },
  {
    "text": "House Judiciary chair to keep Hunter Biden investigation alive  —  The House Judiciary Committee will continue its probe into the criminal investigation of Hunter Biden, committee Chair Jim Jordan said in an interview on Thursday.  It's a sure sign that, even as President Joe Biden prepares to leave office … ",
    "url": "https://www.politico.com/live-updates/2025/01/09/congress/jordan-hunter-biden-impeachment-00197387"
  },
  {
    "text": "University of West Florida braces for leadership changes  —  The University of West Florida is bracing for significant changes in leadership following a wave of new appointments to its Board of Trustees.  —  Over the past month, the Florida Board of Governors replaced three trustees … ",
    "url": "https://www.wuwf.org/local-news/2025-01-08/university-of-west-florida-braces-for-leadership-changes"
  },
  {
    "text": "Economists Are in the Wilderness.  Can They Find a Way Back to Influence?  —  Economists have long helped to shape policy on issues like taxes and health care.  But flawed forecasts and arcane language have cost them credibility.  —  Partway through a panel discussion at a recent economics conference … ",
    "url": "https://www.nytimes.com/2025/01/10/business/economy/economists-politics-trump.html?unlocked_article_code=1.oE4.6jlt.KRS65--CQgjV&smid=url-share"
  }
]