[
  {
    "text": "Rep. Mace introduces measure to ban trans women from Capitol's female bathrooms  —  The South Carolina Republican's resolution comes two weeks after the historic election of Democrat Sarah McBride, a trans woman, to Congress.  —  CORRECTION  —  A previous version of this article misattributed … ",
    "url": "https://www.washingtonpost.com/politics/2024/11/19/nancy-mace-transgender-bathroom-ban/"
  },
  {
    "text": "Republican bathroom bill targets Congress's first transgender member  —  South Carolina Republican Nancy Mace introduces bill two months before Sarah McBride is to be sworn in  —  After Delaware elected the first ever openly transgender member of Congress earlier this month … ",
    "url": "https://www.theguardian.com/us-news/2024/nov/19/sarah-mcbride-congress-bathroom-bill-transgender"
  },
  {
    "text": "Republicans fume as GOP absences help Democrats move judicial nominees  —  Senate Republicans aired frustrations Tuesday after Vice President-elect Vance and other party members skipped votes Monday, greasing the skids for Democratic-backed judicial nominees to be greenlighted as part … ",
    "url": "https://thehill.com/homenews/senate/4998960-senate-republicans-frustrated-judicial-nominees-vance/"
  },
  {
    "text": "In reversal, Thune seeks to slow down Biden's judicial nominees  —  In 2020, Thune touted the importance of confirming judges to the bench.  —  Senator John newly elected Senate Majority Leader for the upcoming 119th Congress, speaks to reporters at the U.S. Capitol, Nov. 13, 2024, in Washington.",
    "url": "https://abcnews.go.com/Politics/reversal-thune-seeks-slow-bidens-judicial-nominees/story?id=116010653"
  },
  {
    "text": "Harris lost to Trump.  She may have one last chance to defy him.  —  The vice president is prepared to provide tie-breaking votes in critical judicial appointments as Biden works to push through confirmations.  —  Fresh from a devastating loss to Donald Trump, Vice President Kamala Harris … ",
    "url": "https://www.nbcnews.com/politics/kamala-harris/kamala-harris-break-ties-biden-judicial-nominees-rcna180776"
  },
  {
    "text": "Hacker Is Said to Have Gained Access to File With Damaging Testimony About Gaetz  —  The computer file is said to contain testimony from the woman who said she had sex with Matt Gaetz, President-elect Donald Trump's choice to be attorney general, when she was 17.",
    "url": "https://www.nytimes.com/2024/11/19/us/politics/matt-gaetz-hack-testimony.html?unlocked_article_code=1.bE4.f2SX.A-EoaFu8nQma&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Linda McMahon expected to be named Education secretary, sources say  —  Trump transition co-chair Linda McMahon is expected to be named as secretary of the Department of Education, four sources familiar with the matter told CNN.  —  The decision took shape after it became clear that McMahon would be passed over for Commerce secretary.",
    "url": "https://www.cnn.com/2024/11/19/politics/linda-mcmahon-education-secretary-trump"
  },
  {
    "text": "Trump expected to pick Linda McMahon, former wrestling executive, to head Department of Education, sources say  —  President-elect Donald Trump is expected to pick Linda McMahon, the former wrestling executive, to head the Department of Education, two sources familiar with the transition told CBS News Tuesday.",
    "url": "https://www.cbsnews.com/news/trump-to-pick-linda-mcmahon-head-department-of-education-sources/"
  },
  {
    "text": "The stunning success of vaccines in America, in one chart  —  Measles, mumps, and polio are supposed to be diseases of the past.  In the early to mid-20th century, scientists developed vaccines that effectively eliminated the risk of anyone getting sick or dying from illnesses that had killed millions over millennia of human history.",
    "url": "https://www.vox.com/future-perfect/386215/trump-rfk-jr-vaccines-health-measles-chart"
  },
  {
    "text": "‘100% on board’: Border state offers Trump massive plot of land to aid mass deportation operation  —  Texas has ramped up its own efforts to secure southern border  —  EXCLUSIVE: Texas is offering the incoming Trump administration a tract of more than 1,400 acres on which to stage … ",
    "url": "https://www.foxnews.com/politics/border-state-offers-trump-massive-plot-land-aid-mass-deportation-operation"
  },
  {
    "text": "Trump Is Calling Senators on Behalf of Matt Gaetz.  It's Not Going Well.  —  “Matt Gaetz is toxic among House Republicans.  Among Senate Republicans, he is radioactive,” one source familiar with the conversations told NOTUS.  — Copy  —  As Republicans circle the wagons around Matt Gaetz … ",
    "url": "https://www.notus.org/trump-transition/trump-calling-senators-matt-gaetz-not-going-well"
  },
  {
    "text": "Donald Trump Has NOT Won a Majority of the Votes Cast for President  —  Donald Trump's popular vote total has fallen below 50 percent, and his margin over Kamala Harris has narrowed considerably as all the votes are counted.  —  Pocket  —  “America has given us an unprecedented and powerful mandate … ",
    "url": "https://www.thenation.com/article/politics/donald-trump-vote-margin-narrowed/"
  },
  {
    "text": "Weak turnout in key cities hurt Harris in the ‘blue wall’ states  —  More people voted in 2024 than in 2020 in Michigan, Pennsylvania and Wisconsin, but that growth came from pro-Trump areas.  —  A new analysis of precinct-level data by the NBC News Decision Desk shows the extent … ",
    "url": "https://www.nbcnews.com/politics/2024-election/weak-turnout-key-cities-hurt-harris-blue-wall-states-rcna180669"
  },
  {
    "text": "Trump picks Dr. Oz to lead massive Medicare and Medicaid agency CMS … President-elect Donald Trump on Tuesday said he would nominate Dr. Mehmet Oz — celebrity TV host and former U.S. Senate candidate — as Centers for Medicare & Medicaid Services administrator.",
    "url": "https://www.cnbc.com/2024/11/19/trump-picks-dr-oz-to-lead-massive-medicare-medicaid-agency-cms.html"
  },
  {
    "text": "Bucks County board chair says comment about violating election law has been misinterpreted  —  Bucks County Board of Commissioners Chair Diane Ellis-Marseglia said Monday that her comments about violating the Pennsylvania Supreme Court were taken out of context after they set off a national backlash … ",
    "url": "https://www.inquirer.com/politics/election/bucks-county-commissioner-diane-ellis-marseglia-20241118.html"
  },
  {
    "text": "Italian village offers $1 homes to Americans upset by the US election result  —  For travel tips, recipes and more insight on Italian culture, sign up for CNN's Unlocking Italy newsletter.  This eight-part guide will have you packing your bags in no time.  —  CNN  —",
    "url": "https://www.cnn.com/2024/11/19/travel/italian-village-ollolai-wants-americans-election-one-dollar-homes"
  },
  {
    "text": "Far-right militia targets US military over baseless hurricane ‘weather weapon’ claims  —  Veterans on Patrol believes government caused Helene with weather manipulation tech, Telegram chats reveal  —  A vigilante militia notorious for its patrols on America's border with Mexico has threatened … ",
    "url": "https://www.theguardian.com/us-news/2024/nov/19/far-right-militia-targets-military-weather-manipulation"
  },
  {
    "text": "Trump ignores transition rules.  It's a ‘hostile takeover,’ ally says.  —  Donald Trump's transition team has begun what a close ally calls a hostile takeover of the federal government, ignoring the rules for the handover of power in the process.  —  A thousand miles from the austere buildings … ",
    "url": "https://www.washingtonpost.com/politics/2024/11/19/trump-transition-fbi-state-gsa/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzMxOTkyNDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzMzMzc0Nzk5LCJpYXQiOjE3MzE5OTI0MDAsImp0aSI6IjBmZTE4ODlkLWQ3YmItNGI0NS1iOGZiLTZiNWIzNjhlMjRmYiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzExLzE5L3RydW1wLXRyYW5zaXRpb24tZmJpLXN0YXRlLWdzYS8ifQ.wVIZb_aXpYqSO7JbPVHOpVLuVUc_yRKPWMrwcuZXAxk&itid=gfta"
  },
  {
    "text": "Texas Education Board Backs Curriculum With Lessons Drawn From Bible  —  School districts serving more than two million elementary school children would be able to adopt a curriculum that draws on the Bible.  —  Texas education officials approved in an initial vote on Tuesday … ",
    "url": "https://www.nytimes.com/2024/11/19/us/texas-bible-curriculum-public-schools.html"
  },
  {
    "text": "Multiple election offices report receiving mailed ballots misdirected from other states  —  Terry Thompson had an election to run for voters in Cascade County, Montana.  Why then, she thought, was her office in Great Falls being sent mailed ballots completed by voters in places such as Wasilla … ",
    "url": "https://apnews.com/article/election-voting-mail-ballots-postal-service-7c942c832398d55843fbc20898d85385"
  },
  {
    "text": "Macron urges Putin to ‘be reasonable’ on nuclear weapons  —  Russia has lowered its threshold for beginning a nuclear war.  —  RIO DE JANEIRO — French President Emmanuel Macron told Russian President Vladimir Putin on Tuesday to climb down from making nuclear threats after Russia lowered … ",
    "url": "https://www.politico.eu/article/emmanuel-macron-france-vladimir-putin-russia-war-in-ukraine-nuclear-weapons/"
  },
  {
    "text": "Vance says Trump is interviewing FBI director replacements  —  President-elect Donald Trump's plans to end business-as-usual at the Justice Department apparently include replacing FBI Director Christopher Wray, Vice President-elect JD Vance indicated in a social media post on Tuesday.",
    "url": "https://www.politico.com/live-updates/2024/11/19/congress/donald-trump-fbi-director-00190476"
  },
  {
    "text": "Vice's Hard-Right Turn to Trumpism  —  VICE News once covered the border with videos that exposed the hardships faced by immigrants, such as “The Human Cost of Hardening the US-Mexico Border” and “What It's Like To Raise Your Child In An Immigration Detention Center.”",
    "url": "https://theintercept.com/2024/11/19/vice-news-right-wing-trumpism/"
  },
  {
    "text": "‘Morning Joe’ meeting with Trump was driven by fears of retribution from incoming administration, sources say  —  New York CNN  —  “Morning Joe” co-hosts Joe Scarborough and Mika Brzezinski announced Monday, in dramatic fashion, that they went to Mar-a-Lago last week for a fence-mending meeting with President-elect Donald Trump.",
    "url": "https://www.cnn.com/2024/11/19/media/morning-joe-trump-mar-a-lago-meeting-fears/"
  },
  {
    "text": "Manhattan D.A. Suggests Freezing Trump's Case While He Is President  —  With President-elect Donald J. Trump's sentencing on hold, his lawyers are pushing to dismiss the case.  The district attorney, Alvin L. Bragg, is opposing the effort.  —  Manhattan prosecutors on Tuesday rebuffed … ",
    "url": "https://www.nytimes.com/2024/11/19/nyregion/trump-bragg-manhattan-case.html"
  }
]