[
  {
    "text": "Jack Smith pushes court to disallow cameras in Trump election interference trial  —  Special Counsel Jack Smith is pushing to disallow cameras in former President Trump's election interference trial.  —  In a Friday filing, Smith asked the court to deny applications by a group of media organizations … ",
    "url": "https://thehill.com/regulation/court-battles/4293348-smith-pushes-court-disallow-cameras-trump-election-interference-trial/"
  },
  {
    "text": "It Just Got Worse—Again—for Donald Trump  —  Whenever I look at the latest polls and start to freak out about Donald Trump winning the presidency again, I calm myself by remembering that the guy is very likely going to be an at-least-once convicted felon by next November.",
    "url": "https://newrepublic.com/post/176633/john-eastman-donald-trump-worse"
  },
  {
    "text": "Lauren Boebert Wants ‘Mercy.’ Some Republicans Want an Alternative.  —  The “Beetlejuice” incident continues to haunt the once-unrepentant congresswoman from Colorado.  The state's old guard is lining up behind a primary challenger.  —  At a casino bingo hall in southwestern Colorado … ",
    "url": "https://www.nytimes.com/2023/11/04/us/politics/lauren-boebert-republican-colorado-primary.html"
  },
  {
    "text": "Republicans Introduce Bill To Expel Palestinians From The United States  —  Rep. Ryan Zinke (R-Mont.) and a group of far-right House Republicans want to revoke visas issued to Palestinians.  —  LOADING  —  WASHINGTON — Rep. Ryan Zinke (R-Mont.) introduced legislation on Thursday … ",
    "url": "https://www.huffpost.com/entry/ryan-zinke-republicans-expel-palestinians_n_65454496e4b01b258583b5de"
  },
  {
    "text": "Zinke Introduces Bill to Expel Palestinians from the United States  —  (WASHINGTON, D.C.) - Today, Western Montana Congressman Ryan Zinke introduced the Safeguarding Americans from Extremism (SAFE) Act to prevent Palestinian terrorists from abusing the United States' legal immigration system … ",
    "url": "https://zinke.house.gov/media/press-releases/zinke-introduces-bill-expel-palestinians-united-states"
  },
  {
    "text": "When It Comes to Israel, Who Decides What You Can and Can't Say?  —  Last week, the Anti-Defamation League and the Louis D. Brandeis Center for Human Rights Under Law sent a letter to nearly 200 college presidents urging them to investigate campus chapters of Students for Justice in Palestine … ",
    "url": "https://www.nytimes.com/2023/11/04/opinion/israel-palestine-speech-debate.html"
  },
  {
    "text": "How Speaker Mike Johnson's plans for a Christian law school unraveled  —  Johnson vouched for the school — and agreed to serve as its dean — without seeing a key feasibility study, he would ultimately admit  —  In February 2012, Mike Johnson sent an aide on an urgent mission at the college … ",
    "url": "https://www.washingtonpost.com/politics/2023/11/04/mike-johnson-law-school-louisiana-college-shreveport/"
  },
  {
    "text": "RFK Jr. comes ‘home’ to his anti-vaccine group, commits to ‘a break’ for U.S. infectious disease research  —  He has suggested without evidence that researchers and pharmaceutical companies are driven by profit to neglect chronic conditions.  —  At an anti-vaccine conference in Georgia on Friday … ",
    "url": "https://www.nbcnews.com/politics/politics-news/rfk-jr-comes-home-anti-vaccine-group-commits-break-us-infectious-disea-rcna123551"
  },
  {
    "text": "Haley, Pledging to ‘Close’ the Border, Is Asked: What About Migrants Who Are Already Here?  —  Tough promises on immigration from Nikki Haley and her rivals for the Republican nomination face logistical and legal barriers.  —  On the national debate stage, in interviews and at town halls … ",
    "url": "https://www.nytimes.com/2023/11/04/us/politics/nikki-haley-immigration.html"
  },
  {
    "text": "House Speaker Mike Johnson greets official Washington in a honeymoon period that's likely to be brief  —  One of the most unrecognizable members of Congress is now navigating new relationships, a potential government shutdown and two wars: “This is like an F5 hurricane.”",
    "url": "https://www.nbcnews.com/politics/congress/republican-house-speaker-mike-johnsons-first-days-new-job-rcna123561?taid=65464e7a4c3a57000109c2fa"
  },
  {
    "text": "House and Senate elections could provide historic, reverse results  —  Targeting different political terrain, Democrats could flip the House while Republicans claim the Senate  —  Congressional bureau chief  —  Exactly a year out from the 2024 elections, the battle for control of Congress … ",
    "url": "https://www.washingtonpost.com/politics/2023/11/04/election-2024-house-senate-historic/"
  },
  {
    "text": "Scoop: Blinken tells Israelis humanitarian pause will buy Israel time for Gaza operation  —  Secretary of State Tony Blinken told his Israeli counterparts on Friday that agreeing to a humanitarian pause will help the U.S. fend off growing pressure it is facing over its support of Israel's operation … ",
    "url": "https://www.axios.com/2023/11/04/israel-hamas-blinken-gaza-ceasefire"
  },
  {
    "text": "Jamie Raskin Marks Up George Santos' Thank-You Note With Corrections … LOADING",
    "url": "https://www.huffpost.com/entry/jamie-raskin-george-santos-thank-you-note_n_654571bce4b01b258583cc3e"
  },
  {
    "text": "Jan. 6 rioter accused of ripping officer's gas mask sentenced to 7 years in prison  —  A Texas man accused of forcefully removing a Capitol Police officer's gas mask during the Jan. 6, 2021, riot on the Capitol, was sentenced to 7 years in prison on Friday.  —  Steven Cappuccio … ",
    "url": "https://thehill.com/regulation/court-battles/4293127-jan-6-rioter-gas-mask-sentenced/"
  }
]