[
  {
    "text": "Trump is fighting an uphill battle in his fraud trial.  But it could be years before penalties kick in.  —  A verdict is expected in December.  Here's how the case is going — and what comes next.  —  NEW YORK — Two months into Donald Trump's civil fraud trial, the case does not seem to be going well for him.",
    "url": "https://www.politico.com/news/2023/11/27/trump-civil-fraud-trial-penalties-00128639"
  },
  {
    "text": "Trump, Who Destroyed Roe, Thinks He Can Run As an Abortion ‘Moderate’ in 2024  —  The former president is privately declaring victory over his party's “extreme” anti-abortion crusaders, while publicly touting his record of stripping women's rights away  —  THE MAN WHO essentially ended … ",
    "url": "https://www.rollingstone.com/politics/politics-features/donald-trump-abortion-moderate-run-2024-election-1234893936/"
  },
  {
    "text": "Why Trump's Trials Should Be on TV  —  The conduct of the trials, their fairness, and their possibly damning verdicts will be at the center of the 2024 election.  Transparency is crucial.  —  On November 6th, Donald Trump emerged from a New York City courtroom, where he had testified … ",
    "url": "https://www.newyorker.com/magazine/2023/12/04/why-trumps-trials-should-be-on-tv?currentPage=all"
  },
  {
    "text": "From Niagara Falls to Texas to Gaza, a horrifying look into the abyss of a post-truth future  —  “There was truth and there was untruth, and if you clung to the truth even against the whole world, you were not mad.”  — George Orwell, 1984In the ever-shrinking world of a free and fair media … ",
    "url": "https://www.inquirer.com/opinion/commentary/free-press-right-wing-authoritarianism-20231126.html"
  },
  {
    "text": "Biden to Skip U.N. Climate Summit, White House Official Says  —  He has attended the past two summits and calls climate change “the ultimate threat” but will miss the talks that are set to begin in Dubai on Thursday.  —  President Biden will not attend a major United Nations climate summit … ",
    "url": "https://www.nytimes.com/2023/11/26/climate/biden-climate-cop28-dubai.html"
  },
  {
    "text": "Trump's Pardoning of a Loan Shark Derailed a Federal Investigation: Report  —  The former president undermined negotiations between Jonathan Braun and prosecutors who hoped Braun would testify against other predatory lenders in exchange for his release",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-pardon-loan-shark-jonathan-braun-1234897002/"
  },
  {
    "text": "Donations to GOP drop as worries mount about the party's finances  —  Donors have not cut as many large checks to the RNC in recent years, and the party's small-dollar program has also suffered  —  The Republican Party's finances are increasingly worrisome to party members … ",
    "url": "https://www.washingtonpost.com/politics/2023/11/27/republican-party-finances-election/"
  },
  {
    "text": "COP28: UAE planned to use climate talks to make oil deals  —  The United Arab Emirates planned to use its role as the host of UN climate talks as an opportunity to strike oil and gas deals, the BBC has learned.  —  Leaked briefing documents reveal plans to discuss fossil fuel deals with 15 nations.",
    "url": "https://www.bbc.com/news/science-environment-67508331"
  },
  {
    "text": "White House Touts New Supply Chain Measures as Inflation Eases  — Actions include funding for injectable medicines, clean energy  — Administration links 2022 inflation surge to supply chains  —  The Biden administration will announce a redoubling of measures to strengthen supply chains on Monday … ",
    "url": "https://www.bloomberg.com/news/articles/2023-11-27/white-house-touts-new-supply-chain-measures-as-inflation-eases"
  },
  {
    "text": "When Peter Antonacci was stricken in governor's office he lay in hallway 24 minutes before anyone noticed  —  Peter Antonacci, Gov. Ron DeSantis's handpicked choice last year to lead the state's controversial new elections fraud office, collapsed and died in a hallway in the governor's office moments after … ",
    "url": "https://www.floridabulldog.org/2023/11/peter-antonacci-stricken-governors-office-lay-hallway-24-minutes-before-noticed/"
  },
  {
    "text": "Christie says he plans to stay in GOP race through convention  —  Former New Jersey Gov. Chris Christie said he plans to stay in the Republican primary race through next summer's nominating convention, dismissing a recent CNN poll that shows him trailing former President Donald Trump … ",
    "url": "https://www.cnn.com/2023/11/26/politics/chris-christie-republican-2024-haley-trump-cnntv/"
  },
  {
    "text": "A Jewish professor at USC confronted pro-Palestinian students.  He's now barred from campus  —  Homepage News,Israel-Hamas,Education  —  Until recently, USC professor John Strauss was known mostly for his research on the economics of developing countries, with decades of fieldwork in Indonesia and China.",
    "url": "https://www.latimes.com/california/story/2023-11-26/a-usc-professor-called-for-hamas-to-be-killed-hes-now-banned-from-campus"
  },
  {
    "text": "Gaza: Findings on October 17 al-Ahli Hospital Explosion  —  Evidence Points to Misfired Rocket but Full Investigation Needed  —  (Jerusalem) - The explosion that killed and injured many civilians at al-Ahli Arab Hospital in Gaza on October 17, 2023, resulted from an apparent rocket-propelled munition … ",
    "url": "https://www.hrw.org/news/2023/11/26/gaza-findings-october-17-al-ahli-hospital-explosion"
  },
  {
    "text": "4-year-old Israeli American hostage is released  —  Abigail Edan, the 4-year-old American dual citizen abducted by Hamas on October 7, has been released - marking the first successful release of an American hostage since the start of a truce between Israel and Hamas.  Edan is one of the 17 hostages released Sunday.",
    "url": "https://www.cnn.com/2023/11/26/politics/abigail-edan-jake-sullivan-national-security-adviser-israel-gaza-hostages-cnntv/"
  },
  {
    "text": "Attackers seize an Israel-linked tanker off Yemen in a third such assault during the Israel-Hamas war  —  Attackers seized a tanker linked to Israel off the coast of Yemen on Sunday, authorities said.  While no group immediately claimed responsibility, it comes as at least two other maritime attacks … ",
    "url": "https://apnews.com/article/israel-palestinians-hamas-war-yemen-ship-attack-526842504dc9f6bb7ca6e1d5104f77a3"
  }
]