[
  {
    "text": "Biden Shrinks Trump's Edge in Latest Times/Siena Poll  —  The president's popularity has ticked up slightly, though voters still view Donald J. Trump more favorably and have dour views of the economy.  —  President Biden has nearly erased Donald J. Trump's early polling advantage … ",
    "url": "https://www.nytimes.com/2024/04/13/us/politics/trump-biden-times-siena-poll.html"
  },
  {
    "text": "Voters think the nation is going off rails — just not in their state  —  Polls show voters believe their own state is doing much better than the country.  The size of that gap could determine who wins in November.  —  Voters are not shy about saying how bad they perceive things are.",
    "url": "https://www.washingtonpost.com/politics/2024/04/13/voter-perceptions-economy/"
  },
  {
    "text": "Trump boosting efforts to wrest Pennsylvania back to GOP victory  —  Former President Trump is turbocharging his efforts to win back Pennsylvania with visits set in critical swing areas of the state on Saturday.  —  It's part of an aggressive push by the former president to make inroads … ",
    "url": "https://thehill.com/homenews/campaign/4591371-trump-boosting-efforts-to-wrest-pennsylvania-back-to-gop-victory/"
  },
  {
    "text": "Vessel seized in Strait of Hormuz amid Iran tensions, shipping firms say  —  Iran's Revolutionary Guards seized an Israeli-linked cargo ship in the Strait of Hormuz on Saturday, days after Tehran said it could close the crucial shipping route and warned it would retaliate for an Israeli strike on its Syria consulate.",
    "url": "https://www.reuters.com/world/middle-east/ukmto-receives-report-incident-50nm-northeast-uaes-fujairah-2024-04-13/"
  },
  {
    "text": "Judge declines to delay Trump's NY hush money trial over complaints of pretrial publicity  —  Trump the defendant and 2024 presidential candidate aims to campaign at New York hush money trial  —  The judge in Donald Trump's hush money criminal case on Friday turned down the former president's request … ",
    "url": "https://apnews.com/article/trump-hush-money-trial-4c79619c5e89e13d672e070a4244a302"
  },
  {
    "text": "Donald Trump Says He Will Testify in Hush-Money Trial  —  Jury selection begins Monday in the prosecution of Donald J. Trump on charges of covering up a sex scandal.  He said he would try to sway jurors personally, though he has backed away in the past.  —  Donald J. Trump … ",
    "url": "https://www.nytimes.com/2024/04/12/nyregion/trump-trial-testify-hush-money-case.html"
  },
  {
    "text": "Trump the Front-Runner?  Not So Fast.  —  As foreign leaders trek to Mar-a-Lago to restore their ties to the once and future president, they might be surprised to learn that the election isn't as sealed as they seem to think.  —  Just as the stock market's record gains this year have been driven … ",
    "url": "https://www.politico.com/news/magazine/2024/04/13/trump-the-front-runner-not-so-fast-00152010"
  },
  {
    "text": "Mike Pence pushes a post-Trump path for conservatives and GOP  —  The former vice president, who decided not to endorse his old running mate, believes many in the conservative movement have lost their way to populism  —  Mike Pence became vice president by bearing witness to Donald Trump … ",
    "url": "https://www.washingtonpost.com/politics/2024/04/13/mike-pence-trump-conservative-movement/"
  },
  {
    "text": "Judge rejects Hunter Biden's bid to dismiss the federal gun charges against him  —  The judge denied all of Biden's attempts to have the case thrown out.  —  The federal judge overseeing a case involving gun charges against Hunter Biden rejected efforts by the president's son to have the case dismissed.",
    "url": "https://www.nbcnews.com/politics/politics-news/judge-rejects-hunter-bidens-bid-dismiss-federal-gun-charges-rcna147675"
  },
  {
    "text": "‘The 401(k) industry owns Congress’: How lawmakers quietly passed a $300 billion windfall to the wealthy  —  Greased by lobbying and campaign cash, tax breaks for retirement savings are one thing Congress agrees on.  But they also blow out the deficit and add to income inequality.",
    "url": "https://www.politico.com/news/2024/04/13/how-your-401k-ate-the-federal-budget-00150319"
  },
  {
    "text": "Infuriated Democrats grapple with GOP vote to blast Biden … - “There's the work that all of the serious adults are trying to work on [to address] an incredibly complicated and gut-wrenching situation, and then there is this nonsense,” Rep. Greg Landsman (D-Ohio) told Axios.",
    "url": "https://www.axios.com/2024/04/12/democrats-republicans-vote-biden-israel-house"
  },
  {
    "text": "DeSantis signs controversial bill banning civilian boards from investigating police misconduct  —  Gov. Ron DeSantis signed a controversial bill Friday stripping citizen oversight boards of their power to investigate police misconduct.  —  The bill, HB 601, instead allows local chiefs … ",
    "url": "https://www.sun-sentinel.com/2024/04/12/desantis-signs-controversial-bill-banning-civilian-boards-from-investigating-police-misconduct/"
  },
  {
    "text": "For all his bombast, Trump is plummeting - financially, legally and politically  —  He's losing cash reserves and legal gambits, and his eponymous stock - DJT - took an embarrassing tumble this week  —  Donald Trump is doing his best Wizard of Oz imitation.",
    "url": "https://www.theguardian.com/commentisfree/2024/apr/12/donald-trump-finance-stock-trial"
  },
  {
    "text": "Trump says federal abortion ban is not needed ‘because we broke Roe v. Wade’  —  Former President Trump on Friday said there was no need for a federal law limiting abortion because “we broke Roe v. Wade,” and said states were working “brilliantly” as many GOP-led legislatures restrict access to abortion.",
    "url": "https://thehill.com/homenews/campaign/4591180-trump-says-federal-abortion-ban-is-not-needed-because-we-broke-roe-v-wade/"
  },
  {
    "text": "Exclusive: Google Contract Shows Deal With Israel Defense Ministry  —  Google provides cloud computing services to the Israeli Ministry of Defense, and the tech giant has negotiated deepening its partnership during Israel's war in Gaza, a company document viewed by TIME shows.",
    "url": "https://time.com/6966102/google-contract-israel-defense-ministry-gaza-war/"
  },
  {
    "text": "US Steel shareholders approve takeover by Japan's Nippon Steel opposed by Biden administration  —  U.S. Steel shareholders have overwhelmingly approved the company's sale to Nippon Steel of Japan for $14.1 billion in cash, voicing unequivocal support for a combination that has drawn opposition … ",
    "url": "https://apnews.com/article/us-nippon-steel-takeover-aa6075aabe046f86350f7df4e009cde6"
  }
]