[
  {
    "text": "RNC Moving to Declare Trump Its Presumptive Nominee  —  An RNC committeeman has submitted the proposal despite Nikki Haley's vow to stay in the race.  —  The Republican National Committee (RNC) is reviewing a draft resolution that, if approved, would declare Donald Trump … ",
    "url": "https://thedispatch.com/newsletter/dispatch-politics/rnc-moving-to-declare-trump-its-presumptive-nominee/"
  },
  {
    "text": "Republican National Committee considering move that would declare Trump the presumptive nominee  —  A draft resolution circulating among the Republican National Committee would formally declare Donald Trump the Republican Party's 2024 presumptive nominee.  —  While the former president … ",
    "url": "https://www.cnn.com/2024/01/25/politics/rnc-trump-presumptive-nominee-resolution"
  },
  {
    "text": "Trump opens up lead over Biden in rematch many Americans don't want  —  Donald Trump leads Democratic President Joe Biden by six percentage points in a Reuters/Ipsos poll that showed Americans are unhappy about an election rematch that came into sharper focus this week.",
    "url": "https://www.reuters.com/world/us/americans-dismayed-by-biden-trump-2024-rematch-reutersipsos-poll-finds-2024-01-25/"
  },
  {
    "text": "1/25/24 ☀️ Punchbowl News AM … Senate Minority Leader Mitch McConnell did four extraordinary things Wednesday afternoon, all of which we scooped in our PM edition Wednesday night. … McConnell told GOP senators that before border security talks began, immigration policy united Republicans and Ukraine aid divided them.",
    "url": "https://punchbowl.news/archive/12524-punchbowl-news-am/"
  },
  {
    "text": "McConnell casts doubt on border and Ukraine aid deal as GOP fury threatens both  —  The Senate minority leader's shift comes as Trump pushes Republicans to oppose the immigration pact, seeking instead to wield border chaos as a political weapon against Biden.",
    "url": "https://www.nbcnews.com/politics/congress/mcconnell-doubt-ukraine-aid-immigration-border-deal-trump-republicans-rcna135626"
  },
  {
    "text": "McConnell Casts Doubt on Border Deal, Saying Trump Opposition May Sink It  —  The minority leader privately told Republicans that the former president had put his party “in a quandary,” casting further doubt on the deal's chances and the fate of Ukraine aid that the G.O.P. has tied to it.",
    "url": "https://www.nytimes.com/2024/01/25/us/politics/mcconnell-border-deal-trump.html"
  },
  {
    "text": "Trump Spokesperson Steven Cheung Booted From Defamation Trial for Phone Alarm  —  U.S. District Judge Lewis Kaplan, notoriously strict about electronics in his courtroom, brought down the hammer when the alarm went off in the middle of witness testimony on Thursday",
    "url": "https://themessenger.com/politics/trump-spokesperson-steven-cheung-booted-defamation-trial-phone-alarm"
  },
  {
    "text": "Trump briefly testifies in E. Jean Carroll damages trial, clashes with judge  —  The former president was on the witness stand for about three minutes.  Closing arguments will take place Friday morning.  —  Former President Donald Trump took the witness stand in a federal courthouse … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/e-jean-carroll-trial-trump-expected-court-today-rcna135110"
  },
  {
    "text": "Trump-Carroll Defamation Trial  —  Trump Briefly Takes Stand in Civil Case  —  E. Jean Carroll seeks at least $10 million from the former president in a second defamation trial.  A jury last year found that he had sexually abused her in the 1990s.  —  Benjamin Weiser and Maria CramerReporting from the courthouse",
    "url": "https://www.nytimes.com/live/2024/01/25/nyregion/trump-carroll-defamation-trial"
  },
  {
    "text": "Ex-Trump adviser Peter Navarro sentenced to 4 months for contempt of Congress  —  Former Trump White House official Peter Navarro was sentenced Thursday to four months in prison for contempt of Congress for defying a subpoena from the House committee investigating the Jan. 6 U.S. Capitol attack.",
    "url": "https://www.npr.org/2024/01/25/1226836737/peter-navarro-sentence-contempt-congress"
  },
  {
    "text": "Peter Navarro: Trump official sentence to four months  —  Trump White House official Peter Navarro has been convicted of contempt of Congress charges for refusing to cooperate with a congressional investigation into the Jan. 6 Capitol attack.  Navarro was charged with two misdemeanor counts, both punishable by up to a year behind bars.",
    "url": "https://apnews.com/article/trump-navarro-white-house-contempt-jan-6-2d6efbc6e15e52eeaa1559d80e7e904c"
  },
  {
    "text": "Eagle Pass is today's Fort Sumter.  Biden must federalize the Texas National Guard.  —  The high-stakes game of Texas Hold 'Em taking place on the banks of the Rio Grande between the tin soldiers of that state's Republican Gov. Greg Abbott and the U.S. Border Patrol has reached a tension level … ",
    "url": "https://www.inquirer.com/opinion/texas-border-abbott-biden-national-guard-20240125.html"
  },
  {
    "text": "Tea with salt?  American scientist's “outrageous proposal” leaves U.S.-U.K. relations in “hot water,” embassy says  —  How do you take your tea?  One lump of sugar, two or maybe some milk?  Unless you're adding salt, one U.S. scientist says, your cup won't be perfect … ",
    "url": "https://www.cbsnews.com/news/tea-with-salt-american-scientists-outrageous-proposal-leaves-u-s-u-k-relations-in-hot-water-embassy-says/"
  },
  {
    "text": "McConnell dispels doubts about his commitment to a border-Ukraine deal  —  The Senate GOP leader made clear that Donald Trump's opposition to an agreement was not souring him on the negotiations.",
    "url": "https://www.politico.com/live-updates/2024/01/25/congress/mcconnell-clarifies-00137879"
  },
  {
    "text": "U.S. Secretly Alerted Iran Ahead of Islamic State Terrorist Attack  —  Washington passed actionable intelligence to Tehran about the plot that killed 84 and wounded many more  —  WASHINGTON—The U.S. secretly warned Iran that Islamic State was preparing to carry out the terrorist attack early … ",
    "url": "https://www.wsj.com/world/middle-east/u-s-secretly-alerted-iran-ahead-of-islamic-state-terrorist-attack-af77a19a?mod=followamazon"
  },
  {
    "text": "Biden to deploy CIA director to help broker major Gaza deal  —  William Burns is looking to close gaps between Israel and Hamas on a deal that includes the release of all hostages in Gaza and a two-month cease-fire  —  President Biden plans to dispatch CIA Director William J. Burns … ",
    "url": "https://www.washingtonpost.com/national-security/2024/01/25/william-burns-cia-gaza-israel-hostages/"
  },
  {
    "text": "New Cars Would Require Speed-Limiting Technology Under California Bill  —  A California bill would require new cars sold or made in the state to incorporate technology that limits the speed of the vehicle.  —  “This bill would require certain vehicles, commencing with the 2027 model year … ",
    "url": "https://freebeacon.com/latest-news/new-cars-would-require-speed-limiting-technology-under-california-bill/"
  },
  {
    "text": "Alabama GOP congressman disagrees with Nikki Haley: ‘Everyone has some racist in them’  —  Rep. Jerry Carl, R-Ala., said that in his experience, the GOP presidential candidate's comments that America is “not a racist country” was not true.  —  An Alabama Republican congressman said on Wednesday that … ",
    "url": "https://www.nbcnews.com/politics/2024-election/alabama-gop-congressman-jerry-carl-nikki-haley-racist-rcna135693"
  },
  {
    "text": "Vince McMahon Accused of Sex Trafficking by WWE Staffer He Paid to Keep Quiet  —  Janel Grant files lawsuit saying McMahon pressured her into sex with him and other men at wrestling business, raising questions about 2022 board probe into CEO's payouts  —  A woman who received a payout … ",
    "url": "https://www.wsj.com/business/vince-mcmahon-accused-of-sex-trafficking-by-wwe-staffer-he-paid-to-keep-quiet-0b19b21c?mod=followamazon"
  },
  {
    "text": "Elon Musk Is Spreading Election Misinformation, but X's Fact Checkers Are Long Gone  —  Civil rights lawyers and Democrats are sounding alarms about Mr. Musk's claims about voting.  The Biden campaign called his posts “profoundly irresponsible.”  —  In the spring of 2020 … ",
    "url": "https://www.nytimes.com/2024/01/25/us/politics/elon-musk-election-misinformation-x-twitter.html"
  },
  {
    "text": "White House stressing safe gun storage in new initiative  —  The White House on Thursday announced a series of actions emphasizing the importance of safe storage of weapons, the latest step in the Biden administration's efforts to curtail gun violence.  —  The Department of Justice is releasing … ",
    "url": "https://thehill.com/homenews/administration/4428723-white-house-stressing-safe-gun-storage-in-new-initiative/"
  },
  {
    "text": "Housing is now unaffordable for a record half of all U.S. renters, study finds  —  Over the past two years, Genuine Campbell was shocked at how rent for her two-bedroom apartment in Philadelphia just kept going up — from $1,300 a month to $1,600.  She's a single mom of four … ",
    "url": "https://www.npr.org/2024/01/25/1225957874/housing-unaffordable-for-record-half-all-u-s-renters-study-finds"
  },
  {
    "text": "Nancy Mace's Bizarre Jan. 6 Plan: ‘Get Punched in the Face’  —  “She literally begged us to let her leave the office and head to the floor so she could ‘get punched in the face’ and ‘get media attention,’” one former aide said.  —  On her third day as a congresswoman, as violent marauders overtook … ",
    "url": "https://www.thedailybeast.com/nancy-maces-bizarre-jan-6-plan-get-punched-in-the-face"
  },
  {
    "text": "How Big Pharma Is Fueling a Radical MAGA Agenda  —  Republicans' Project 2025 blueprint is an assault on women's health care.  It would also end Biden's Medicare drug-pricing plan  —  Big Pharma has invested big money in the organizations planning what a MAGA policy agenda will look like in a new Trump administration.",
    "url": "https://www.rollingstone.com/politics/politics-features/big-pharma-fueling-maga-agenda-1234953950/"
  },
  {
    "text": "An Iowa bill would make students sing the national anthem every day.  One lawmaker sang it  —  When it came time for her closing comments at Wednesday's Iowa House subcommittee meeting, Rep. Sue Cahill stood — and began singing the national anthem.  —  “O say can you see, by the dawn's early light … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/01/25/iowa-bill-require-students-sing-national-anthem-every-day/72349739007/"
  },
  {
    "text": "Intimidation of State and Local Officeholders  —  Left unchecked, abuse harms not only elected officials but also the public they serve.  —  The January 6 insurrection at the Capitol seemed to mark a new peak in extremist intimidation targeting public officials.",
    "url": "https://www.brennancenter.org/our-work/research-reports/intimidation-state-and-local-officeholders"
  }
]