[
  {
    "text": "Scoop: Wall Street thinks Kamala Harris picking governor for VP … - If the campaign signals are being correctly interpreted, that would narrow the veepstakes down to Kentucky Gov. Andy Beshear, Pennsylvania Gov. Josh Shapiro, and Minnesota Gov. Tim Walz.  — Some donors in the financial services … ",
    "url": "https://www.axios.com/2024/07/31/kamala-harris-vp-pick-wall-street-donors"
  },
  {
    "text": "Harris to hold first rally with running mate Tuesday in Philadelphia  —  The vice president is expected to announce her pick sometime before the appearance.  —  Vice President Kamala Harris is expected to announce her running mate by Tuesday, when she will hold her first rally with her pick in Philadelphia.",
    "url": "https://www.politico.com/news/2024/07/30/harris-first-rally-running-mate-tuesday-philadelphia-00171999"
  },
  {
    "text": "Playbook: Harris puts Trump on his heels  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  DEVELOPING OVERNIGHT — “Hamas leader ISMAIL HANIYEH was assassinated in the early hours of the morning in Iran, the Palestinian militant group said on Wednesday … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/07/31/harris-puts-trump-on-his-heels-00172025"
  },
  {
    "text": "Symbolism won't persuade Black men to vote for Harris.  Here's what will.  —  As Kamala Harris inherits the presidential campaign of Joe Biden, she also inherits his sagging poll numbers with working-class Black men.  The historic nature of Harris's candidacy will be viewed by many Black male voters … ",
    "url": "https://thehill.com/opinion/campaign/4800764-symbolism-wont-persuade-black-men-to-vote-for-harris-heres-what-will/"
  },
  {
    "text": "Trump Flipped Out That ‘Lunatic’ Project 2025 Could Tank His Campaign  —  The former president effectively “birthed” Project 2025.  Now that the project is a political liability, one of Trump's foot soldiers is out of a job  —  AS HE ENTERED the final stretch of the 2024 presidential race … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-project-2025-abortion-campaign-1235071152/"
  },
  {
    "text": "Massacre on Mass. Ave.  —  Rolling Stone: “In the world of two weeks ago, the graphic Democratic euphoria on display in Atlanta Tuesday would have been almost inconceivable: a Division I basketball arena packed so full of ecstatic supporters that the fire marshal was refusing to let anyone else in.”",
    "url": "https://www.thebulwark.com/p/massacre-on-mass-ave"
  },
  {
    "text": "Trump Forces Out Project 2025 Mastermind  —  YOU'RE FIRED  —  The Trump campaign ousted the architect of Project 2025, an ultra-conservative policy manifesto.  But J.D. Vance is still tied to the right-wing project. … Donald Trump's campaign has forced an architect … ",
    "url": "https://www.thedailybeast.com/trump-campaign-puts-the-screws-to-project-2025-mastermind"
  },
  {
    "text": "Hamas leader Haniyeh assassinated in Tehran  —  Haniyeh, along with one of his guards, was reportedly killed at his Tehran residence.  —  Hamas leader Ismail Haniyeh was killed in Iran, Hamas claimed on Wednesday morning, while claiming Israel was behind the attack.",
    "url": "https://www.jpost.com/breaking-news/article-812649"
  },
  {
    "text": "Hamas leader Ismail Haniyeh killed in Tehran - what we know so far  —  Hamas leader Ismail Haniyeh was assassinated early on Wednesday morning in Iran, the Palestinian militant group and Tehran said.  —  This is what we know about the killing of Haniyeh, one of Israel's numerous assassinations of its enemies over the years.",
    "url": "https://www.reuters.com/world/middle-east/what-we-know-so-far-about-assassination-hamas-leader-2024-07-31/"
  },
  {
    "text": "Willie Brown on Kamala Harris: 'She'll Deport My Ass'  —  At 90, Harris's mentor and former boyfriend is basking in her rise to power — along with those of his many other proteges.  —  SAN FRANCISCO —  Since Kamala Harris became vice president, her former boyfriend and political mentor … ",
    "url": "https://www.politico.com/news/magazine/2024/07/31/willie-brown-kamala-harris-campaign-column-00171885"
  },
  {
    "text": "Meet the conspiracy theorist and anti-LGBTQ extremist pulling the strings at major American corporations  —  In recent months, major companies have publicly announced that they are abandoning their diversity efforts.  In at least two cases, companies were pressured into taking action … ",
    "url": "https://popular.info/p/meet-the-conspiracy-theorist-and"
  },
  {
    "text": "J.D. Vance's Obsessions Are Way Creepier Than Being Childless  —  DON'T DISS DOLLY!  —  OK, J. D. Vance: When did we begin equating fertility with patriotism?  And, if Republicans are so keen on people having kids, why would the party cut family assistance programs? … Having children is good.",
    "url": "https://www.thedailybeast.com/michael-ian-black-jd-vances-obsessions-are-way-creepier-than-being-childless"
  },
  {
    "text": "More Than 100 Silicon Valley Investors Pledge to Support Kamala Harris  —  The group, including Democratic donors such as Reid Hoffman and Vinod Khosla, has been organized under an effort called VCsForKamala.  —  More than 100 venture capitalists said on Wednesday that they had pledged … ",
    "url": "https://www.nytimes.com/2024/07/31/technology/silicon-valley-investors-support-kamala-harris.html"
  },
  {
    "text": "Rick Wilson on the weirdness of JD Vance  —  “The Mountain Dew jokes, the awkward campaign videos — it just doesn't connect.”  —  ∙ Paid … Like many liberals, I quietly hoped heading into the RNC that Donald Trump would pick JD Vance as his running mate, because I suspected it might go badly.",
    "url": "https://www.publicnotice.co/p/rick-wilson-interview-jd-vance-trump-weird"
  },
  {
    "text": "RFK Jr.'s campaign struggles with Harris in race  —  Video Player is loading.  —  Play Video  —  Unmute  —  Current Time 0:00 … Stream Type LIVE  —  Seek to live, currently behind liveLIVE  —  Playback Rate  —  Chapters  — Chapters  —  Descriptions  — descriptions off, selected",
    "url": "https://thehill.com/homenews/campaign/4800614-robert-kennedy-campaign-troubles/"
  },
  {
    "text": "Who's Afraid of Josh Shapiro?  —  Sign up for The Decision, a newsletter featuring our 2024 election coverage.  —  A politician designed in a lab to help Democrats win pivotal Rust Belt swing states would probably look a lot like Josh Shapiro.  In 2016, when Donald Trump won Pennsylvania … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/07/josh-shapiro-netanyahu-jewish-vp/679300/"
  },
  {
    "text": "X suspends ‘White Dudes for Harris’ account after massive fundraiser  —  The account was reinstated, but the issue sparked concerns about how Musk could use X to sway voters, even as Republicans welcome his influence.  —  SAN FRANCISCO — Elon Musk's social media platform X suspended … ",
    "url": "https://www.washingtonpost.com/technology/2024/07/30/white-dudes-harris-suspended-x-twitter/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzIyMzEyMDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzIzNjk0Mzk5LCJpYXQiOjE3MjIzMTIwMDAsImp0aSI6IjU5OTM0MmVhLTlkYzAtNGE1Ny05YjBiLWQ1ZjkyOTYzZjcwYyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS90ZWNobm9sb2d5LzIwMjQvMDcvMzAvd2hpdGUtZHVkZXMtaGFycmlzLXN1c3BlbmRlZC14LXR3aXR0ZXIvIn0.cWe0jwql8I6h06KSd2FGzP1C99fsKs9IAfOFqCBCpPA&itid=gfta"
  },
  {
    "text": "Fed poised to cut rates, ignoring Trump and GOP lawmakers  —  If the Fed follows through on an expected cut in September, any political fallout might not be immediately apparent.  —  Federal Reserve Chair Jerome Powell looks ready to start easing off on the economy before the election … ",
    "url": "https://www.politico.com/news/2024/07/31/fed-interest-rate-cuts-trump-republican-backlash-00171918"
  },
  {
    "text": "Sen. Mark Kelly rips Trump over role in killing bipartisan border bill  —  The former president has sought to cast Vice President Kamala Harris as a “border czar” who has failed to secure the border amid record crossings of migrants.  —  Sen. Mark Kelly, D-Ariz., on Tuesday went … ",
    "url": "https://www.nbcnews.com/politics/2024-election/sen-mark-kelly-rips-trump-role-killing-bipartisan-border-bill-rcna164443"
  }
]